[{"isVegetarian": false, "title": "Lamb chops with butter bean gratin", "url": "www_bbc_co_uk_food_recipes_lamb_chops_with_butter_05845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 French-trimmed lamb chops", "125ml/4½fl oz extra virgin olive oil", "salt and freshly ground black pepper", "1 red onion, finely chopped", "4 salted anchovy fillets, chopped", "8 tomatoes, chopped", "450g/1lb can butter beans, drained, rinsed ", "100g/3½oz peas, fresh or frozen", "1 tbsp fresh mint, finely chopped", "1 tbsp sherry vinegar", "150g/5oz breadcrumbs", "75g/2½oz parmesan, finely grated", "100g/3½oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Rub the olive oil over the lamb chops and season with salt and freshly ground black pepper. ", "Heat a griddle pan until hot and grill the lamb chops for two minutes on each side. Remove from the pan and keep warm", "For the gratin, heat a tablespoon of olive oil in a frying pan and gently fry the onion on a medium heat for five minutes, or until soft. ", "Add the anchovy, tomatoes, butter beans, peas, mint, sherry vinegar and the remaining olive oil and simmer for a further five minutes.", "Spoon the butter bean mixture into the ramekins ", "To make the topping, mix the breadcrumbs, parmesan and butter together until well combined. Sprinkle over the beans and place under the grill for 2-3 minutes, or until golden-brown.", "Serve with the lamb chops alongside the butter bean gratin.  "]}, {"isVegetarian": false, "title": "Lamb chops with harissa glazed aubergine", "url": "www_bbc_co_uk_food_recipes_lamb_chops_with_harissa_88196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 rack lamb, cut into 8 chops", "50ml/2fl oz pomace oil", "2 sprigs rosemary, leaves removed", "2 springs thyme, leaves removed ", "2 garlic cloves, sliced ", "sea salt and freshly ground black pepper", "1 small aubergine, cut into 6 pieces lengthways", "2 tbsp rapeseed oil", "50g/1¾oz rose harissa paste", "30g/1oz agave syrup", "1 tsp lemon juice", "75ml/2½fl oz coconut yoghurt", "½ lime, zest and juice", "sea salt", "300g/10½oz fine green beans", "2 sprigs mint, leaves removed and chopped", "1 garlic clove, crushed ", "1 large banana shallot, diced", "4 tsp malt vinegar", "50ml/2fl oz rapeseed oil ", "50g/1¾oz roasted, salted peanuts, roughly chopped", "handful coriander cress", "½ red chilli, thinly sliced"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the lamb chops, marinate in pomace oil, rosemary, thyme and garlic for at least an hour.", "For the harissa glazed aubergine preheat the oven to 180C/160C Fan/Gas 4 and line a baking tray with foil.", "Heat a griddle until hot. Brush the aubergine with oil and season with salt.  Griddle well on each side then transfer to the tray. Cook in the oven for 15 minutes.", "Meanwhile mix the harissa paste, agave, lemon juice together with 4 teaspoons of water and a pinch of salt. Set aside.", "Remove the aubergine from the oven and brush with the harissa mix. Return to the oven for 5 minutes.", "Mix the yoghurt with the lemon juice, zest and pinch of salt. Set aside.", "For the chutney, in large saucepan of boiling, salted water blanch the beans for 1-2 minutes. Refresh them in cold water, then drain.", "Mix the mint, garlic, shallot, vinegar and oil in a bowl.", "Stir in the beans and set aside.", "To finish the lamb, preheat the grill to high. Season the chops and grill until cooked to your liking.", "To serve, put the aubergine on a large plate and dot the yoghurt around, sprinkle with peanuts and chilli and garnish with the coriander. Serve with the lamb chops and green bean and mint chutney."]}, {"isVegetarian": false, "title": "Lamb casserole with aubergine", "url": "www_bbc_co_uk_food_recipes_lamb_casserole_with_94069", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 8oz aubergines, cut into 5mm thick slices", "150ml/5fl oz olive oil", "2 red peppers, seeds removed and sliced", "1.5kg/3lb 5oz lamb shoulder, bone removed, fat trimmed and cut into 3cm/1¼in pieces", "1 large onion, finely chopped", "2 x 400g tins chopped tomatoes", "1 tsp sugar", "1 large handful roughly chopped parsley", "1 tsp salt, plus extra for sprinkling", "10 turns black peppermill"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sprinkle the aubergine with salt and leave to drain in a colander for 1 hour. Remove and dry with a tea towel.", "Heat the oil in a large lidded casserole over medium heat. Add the aubergines and peppers and cook, turning occasionally, until lightly browned, about 10 minutes. Remove with a slotted spoon and set aside.", "Add the lamb to the casserole and cook over medium heat, stirring frequently, until lightly coloured, about 8 minutes.", "Add the onion and cook for 4 minutes. Add the tomatoes, sugar, parsley, salt and pepper. Cover and simmer for 1½ hours, until the meat is tender and the sauce is thick.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Return the aubergines and red peppers to the pan, folding them through the stew a little. Bake for 20 minutes. "]}, {"isVegetarian": false, "title": "Lamb cooked on hay, served with boulangère potatoes", "url": "www_bbc_co_uk_food_recipes_lamb_cooked_on_hay_64832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "1 onion, thinly sliced", "1 leek, thinly sliced", "1 fennel, thinly sliced", "2 garlic cloves", "1 fresh thyme sprig", "1 tsp fennel seeds", "50g/2oz butter", "500ml/18fl oz lamb or chicken stock", "700g/1lb 9oz potatoes", "salt and freshly ground black pepper", "dash olive oil", "½ bag of hay (clean eating hay from the petshop and not bedding hay)", "1 rack of lamb, French trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the boulangère potatoes, preheat the oven to 160C/325F/Gas 2.", "Heat a heavy-based pan, add some oil, then add the sliced onion, leek, fennel,  garlic, thyme, fennel seeds and fry for 3-4 minutes.", "Meanwhile, bring the stock to the boil in a saucepan and grease a small ovenproof dish with a little of the butter.", "Slice the potatoes thinly on a mandoline and start to layer up the dish with alternating layers of potato and the onion mixture, seasoning with salt and freshly ground black pepper in between.", "For the final layer, arrange the potatoes in a neat layer and pour over the hot stock.  ", "Add a couple of knobs of butter, cover with foil and bake for one hour. Remove the foil and cook for another 30 minutes, or until cooked and crisp.", "For the lamb, turn the oven up to 200C/400F/Gas 6.", "Heat a dash of olive oil in a cocotte (a cast iron casserole dish with a lid) placed over a stove top and brown the lamb all over. Remove the lamb from the cocotte.", "Add the hay and a little more oil, just until the hay starts to smoke, then place the lamb on top and cover with the lid.  ", "Bake in the oven for 12-15 minutes, or until the lamb is pink.", "To serve, remove the lamb from the hay, rest for 5-10 minutes, then carve and serve with the boulangère potatoes."]}, {"isVegetarian": false, "title": "Lamb cutlet in tandoori spices with pearl barley, greens and raita", "url": "www_bbc_co_uk_food_recipes_lamb_cutlet_in_tandoori_08184", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp corn oil", "1 tsp garlic and ginger paste", "¼ tsp Kashmiri chilli powder", "1½ tsp tandoori masala spice mix", "1 tsp cracked coriander seeds", "¼ tsp salt", "1 tsp thick Greek yoghurt", "1 lime, juice only", "1 x 175g/6oz double bone lamb cutlet (ask your butcher for this)", "1 tbsp vegetable oil, for frying", "½ onion, peeled", "1 tbsp olive oil", "¼ tsp cumin seeds", "60g/2¼oz shallots, sliced into rings", "10g/¼oz butter", "1 tsp mild curry powder", "¼ tsp chilli flakes", "4 stalks choi sum (or other oriental greens), finely chopped ", "100g/3½oz cooked pearl barley (see tip)", "60g/2¼oz mangetout, sliced into thin strips", "50g/1¾oz piquillo peppers, sliced", "lime juice, to taste ", "handful coriander, chopped", "150ml/5fl oz Greek yoghurt", "100g/3½oz cucumber, finely chopped", "salt, to taste", "chaat masala, to taste (available in Indian grocery stores)"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the marinade, combine all the ingredients to make a paste. Coat the lamb and set aside for 10 minutes, or longer if possible. ", "To cook the lamb, heat the oil in an ovenproof pan and sear the lamb on all sides until browned. Then place the onion in the bottom of the pan and rest the cutlet on top. Roast for 5–6 minutes.", "Meanwhile for the vegetables, heat the oil in a large frying pan or sauté pan. Once hot, add the cumin seeds, shallots, butter and a sprinkle of salt. Gently fry until the shallots are soft. Stir in the curry powder, chilli flakes and a splash of water and cook for 1–2 minutes. Add the choi sum and toss. Add the pearl barley and cook through for a minute or so before adding the mangetout and pequillo peppers. Squeeze in a little lime juice and stir in the coriander.", "Remove the lamb from the oven and set aside to rest for 5–10 minutes.", "For the raita, combine all the ingredients together, taste, and adjust the seasoning if necessary. ", "To serve, place a few tablespoons of the vegetables in the middle of the serving plates. Carve the cutlet into two equal pieces and place to the side of the vegetables. Finish with the raita."]}, {"isVegetarian": false, "title": "Lamb cutlets marinated with spiced dates and sultanas", "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_marinated_27430", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/2¾oz fresh dates", "65g/2¼oz sultanas", "30g/1oz fresh root ginger", "10g garlic", "1 green chilli", "½ tsp ground cardamom", "55g/2oz lemon juice", "1 tsp cumin and black cumin powder mixed 50:50", "30g/1oz brown onion, roughly chopped", "100g/3½oz strained yoghurt (strain your yogurt in a sieve lined with muslin for a few hours to get rid of excess moisture)", "8 lamb cutlets ", "squeeze lime juice", "2 tbsp garlic and ginger paste", "salt, to taste", "30g/1oz double cream", "handful mint leaves", "handful coriander leaves", "½ tsp green chilli paste ", "¼ tsp black salt ", "pinch of salt ", "½ tsp chaat masala ", "½ lime, juice only", "about 5 tbsp strained yoghurt (strain your yogurt in a sieve lined with muslin for a few hours to get rid of excess moisture)", "1 small carrot, cut into 1cm/½in dice", "¼ cucumber, peeled, cut into 1cm/½in dice ", "5-6 sliced breakfast radishes", "1 banana shallot, cut into rings", "1 tomato, chopped, seeds removed", "lemon juice, to taste", "olive oil, to taste", "small handful chopped coriander", "50g/1¾oz clarified butter", "chat massala ", "ground cardamom"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["In a food processor, combine the dates, sultanas, ginger, garlic, green chilli, cardamom, lemon juice, cumin/black cumin powder, brown onion and strained yoghurt together and blend until smooth.", "Put the cutlets in a shallow dish with the lime juice, garlic and ginger paste and salt.", "Stir the double cream into the blended ingredients to loosen and then add the mixture to the cutlets.", "Cover with foil and leave to marinade overnight (preferably) in the fridge. Remove from the fridge and allow the cutlets to come to room temperature when you are ready to cook.", "Preheat the oven to 220C/450F/Gas 7 and preheat the grill to hot.", "Skewer the cutlets horizontally and suspend them over a roasting tray. Cook under the grill for a minute or so on either side, then transfer in to the oven to cook for 7-8 minutes.", "Remove from the oven, drizzle with clarified butter and allow to rest. Sprinkle with chat massala and cardamom.", "For the green chutney, blend the mint, coriander and green chilli into a smooth paste. Add the black salt, normal salt, chaat masala and lime juice. Taste and add salt to taste. Mix in the yoghurt, adding more to taste.", "For the kachumber salad, place the carrot, cucumber, radishes, shallot and tomatoes in a bowl. Dress with the lemon juice, olive oil and chopped coriander. Season to taste.", "Serve the cutlets with the salad and green chutney."]}, {"isVegetarian": false, "title": "Lamb cutlets with chicken mousse and sauce Choron", "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_with_70035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz skinless chicken breast, roughly chopped ", "1 egg white", "425ml/¾ pint double cream", "1 tbsp each roughly chopped fresh chives, tarragon, parsley and mint", "5 French-trimmed lamb chops, all visible fat removed", "200g/7oz pig’s caul", "good splash rapeseed oil, for cooking ", "knob butter, for cooking ", "sea salt and freshly ground white pepper", "4 large or 8 small gelatine leaves", "75g/2½oz caster sugar", "425ml/¾ pint apple juice", "150ml/¼ pint cider vinegar", "1 large shallot, finely chopped", "small bunch fresh mint, finely chopped", "3 egg yolks", "2 tsp caster sugar", "1 tsp lemon juice", "1 tbsp dry white wine", "1 tbsp white wine vinegar", "1 shallot, thinly sliced", "175g/6oz salted butter", "3 tomatoes skinned, deseeded and finely diced", "2 tbsp chopped tarragon"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the mint jelly, put the gelatine in a shallow bowl, just cover with cold water and leave for a few minutes to soften. Meanwhile, put the sugar, apple juice and vinegar in a saucepan over a low heat until the sugar has dissolved. Turn up the heat and bring nearly to the boil. Remove the gelatine from the water, squeeze out any excess water, add the gelatine to the pan and stir until dissolved. Set aside to cool. Add the chopped shallot, mint and plenty of salt and pepper, cover and refrigerate until set. ", "For the lamb cutlets, purée the chicken breast in a food processor (you may need to use a spatula to push the mixture back towards the blades a few times). Add the egg white and blend again. Transfer to a sieve set over a bowl and push through a little at a time using the back of a ladle (don’t use too fine a sieve or you will be at it all day).", "Put some ice in a larger bowl and place the bowl containing the chicken over this. Slowly pour in the cream, beating carefully with a spatula until you have a dropping consistency. Fold in the herbs and season well.", "Quenelle a good tablespoon of the chicken mixture onto the top of each lamb cutlet, then wrap each one in the pig’s caul. Refrigerate until needed.", "When ready to cook, preheat the oven to 200C/180C Fan /Gas 6. ", "For the sauce Choron, quickly blend the egg yolks, sugar and a pinch of salt in a food processor. In a small pan, heat the lemon juice, wine, wine vinegar and sliced shallot and reduce by half. In another saucepan, melt the butter and allow to bubble. Turn on the food processor again and strain in the hot reduced liquor, followed slowly by the hot butter. Pour the sauce into a bowl, then stir in the tomatoes and tarragon.  ", "To finish the lamb, preheat a frying pan over a brisk heat and add the rapeseed oil and butter. Fry the cutlets on the underside for 2-3 minutes. Transfer to a trivet in a roasting tray and roast for 5 minutes. Leave to rest for 5 minutes, then serve with sauce Choron and mint jelly."]}, {"isVegetarian": false, "title": "Lamb cutlets spiced with fennel (shahi chaap amber)", "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_spiced_with_71223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 green cardamom pods, lightly bruised with a rolling pin", "12 cloves", "8cm/3¾in piece cinnamon stick", "2 tsp fennel seeds", "2 Indian bay leaves", "1½ tsp black peppercorns", "1 tsp ground ginger", "1.5 litres/2½ pints full-fat milk", "1kg/2lb 4oz lamb cutlets (from a rack of lamb)", "75ml/2½fl oz vegetable oil", "250g/9oz plain flour", "2 tsp cornflour", "2 tsp ground black pepper", "2 tsp fennel seeds, toasted and ground", "1 tsp ground ginger", "1 tsp ground cardamom (seeds from 30 green pods)", "1 tsp salt", "3 green chillies, finely chopped, with seeds", "2 free-range egg whites", "pinch chat masala, to finish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the cardamom pods, cloves, cinnamon stick, fennel seeds, bay leaves, black peppercorns and ginger into a deep, sturdy pan and add the milk and 500ml/18fl oz of water. Simmer gently for 10 minutes. Add the lamb cutlets and simmer very gently for 10 minutes. Leave to cool in the liquid (the lamb should still be pink in the middle at this stage).", "For the batter, sift together the flour and cornflour in a bowl, then stir in the black pepper, fennel, ginger, cardamom and salt, followed by the chillies. Lightly beat the egg whites in a separate bowl until just frothy and then whisk them into the dry ingredients.", "Strain the milk and remove the lamb cutlets from the pan. Add enough of the cool milky stock to make a thin batter the consistency of single cream.", "Add the cooled cutlets to the batter and turn to coat evenly. Heat the vegetable oil in a large frying pan over a medium heat. Take a few cutlets from the batter, add to the pan (don’t overcrowd it) and fry for 2–3 minutes on each side until golden-brown. Keep these warm while you cook the rest.", "Sprinkle with chat masala, and serve hot."]}, {"isVegetarian": false, "title": "Lamb cutlets with mint, chilli and golden potatoes", "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_with_mint_16788", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_cutlets_with_mint_16788_16x9.jpg", "ingredients": ["500g/1lb 2oz baby new potatoes, washed and halved but not peeled", "3 tbsp olive oil", "½ tsp dried chilli flakes", "1 tsp dried mint", "½ tsp celery salt", "8 lamb cutlets, preferably organic, trimmed of fat", "100g/3½oz rocket", "1 tsp sea salt flakes or ½ tsp pouring salt", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh mint"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the halved baby potatoes on to steam.", "Get out a large dish – in which the lamb cutlets will fit in a single layer – and first pour into it the olive oil and sprinkle in the chilli flakes, dried mint and celery salt. ", "Using one lamb cutlet as if it were a wooden spoon, smoosh the oil with its sprinklings around a bit, so that it is rather better mixed, then place the lamb cutlets in a single layer, turn them instantly, and leave to marinate for 10 minutes.", "Heat a large, heavy-based, non-stick frying-pan – big enough for all the cutlets to fit in – then duly place them all in it (the oil that clings to them from the marinade is plenty enough for them to fry in) and fry over a medium heat for five minutes. While the cutlets cook, check that the potatoes are tender, which they should be by now; in which case, turn the heat off under your steamer.", "Using tongs (for ease), turn the cutlets over and cook for a further three minutes. If you are going to make this an entire one-plate meal, strew the bottom of a large serving platter with rocket, or any other leafage you desire, and when the lamb cutlets are cooked, but still juicily pink, remove them to the salad-lined (or, indeed, naked) plate. Obviously, cook for longer if you like your lamb well done.", "Tip the steamed potatoes into the pan and fry for three minutes, then turn them over and fry for another three minutes, shaking the pan every now and again to make them tumble and turn in the hot, spiced fat.", "Using a slotted spatula or similar, transfer the potatoes to the plate of cutlets and sprinkle with one teaspoon of sea salt flakes (I like these plenty salty, but if you have more austere tastes or are feeding small children, then decrease the salt or ignore the command altogether) and the chopped parsley and mint."]}, {"isVegetarian": false, "title": "Lamb dhansak", "url": "www_bbc_co_uk_food_recipes_lamb_dhansak_79850", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_dhansak_79850_16x9.jpg", "ingredients": ["3 tbsp sunflower oil", "1 kg/2lb 4oz diced lamb shoulder or leg, or a mixture of both", "2 onions, chopped", "25g/1oz fresh root ginger, peeled", "4 garlic cloves, peeled", "2 red chillies, seeds removed, chopped", "10 green cardamom pods", "1½ tbsp ground cumin", "1½ tbsp ground coriander", "½ tbsp ground turmeric", "1 x 400g/14oz can chopped tomatoes", "200ml/7fl oz beef stock ", "75g/2½oz red lentils", "3 tbsp honey", "salt and pepper", "boiled rice"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 3 (130C fan).", "Heat two tablespoons of oil in a large frying pan. Add the lamb and fry in two batches until browned. Remove from the pan with a slotted spoon and set aside.", "Add the remaining oil to the pan. Add the onion and fry for 4-5 minutes, or until beginning to soften.", "Meanwhile, place the ginger, garlic and chilli into a small food processor and blend until finely chopped. ", "Bash the cardamom pods with the end of a rolling pin to split the husks, then remove the seeds and grind them to a fine powder in a pestle and mortar. Add to the pan with the remaining spices and the garlic and ginger mixture. ", "Add the remaining ingredients to the pan and add the lamb. Bring to the boil, then cover and place in the oven to simmer for 1½-2 hours, or until tender. Check the seasoning and serve with boiled rice."]}, {"isVegetarian": false, "title": "Lamb doner", "url": "www_bbc_co_uk_food_recipes_lamb_doner_75979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_doner_75979_16x9.jpg", "ingredients": ["175g/6oz 20% fat lamb mince", "175g/6oz diced lamb leg meat, visible fat removed", "2 garlic cloves, finely grated ", "½ tsp flaky sea salt ", "½ tsp bicarbonate of soda ", "2 tsp ground cumin ", "1 tsp ground paprika ", "1 tsp onion powder ", "1 tsp dried oregano ", "pinch dried chilli flakes ", "freshly ground black pepper ", "100ml/3½fl oz 0% fat plain yoghurt", "2 tbsp finely chopped  mint leaves ", "pinch granulated sweetener ", "pinch salt ", "2 medium corn tortillas ", "40g/1½oz iceberg lettuce, shredded ", "50g/1¾oz cucumber, thinly sliced ", "2 tomatoes, thinly sliced", " ½ small red onion, thinly sliced ", "6 pickled chillies ", "hot sauce (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/220C Fan/Gas 9.", "To make the doner, place all ingredients into a food processor and pulse until smooth. Divide the mixture in half. Shape each portion into a ball and roll out between two large sheets of baking paper, until very thin. Remove the top sheet of baking paper from each piece of meat. Bake for 3–4 minutes until browned. ", "Remove the trays from the oven and carefully use cook’s blowtorch over the surface of the lamb until blackened in small areas. Leave to rest for a couple of minutes. ", "To make the yoghurt sauce, mix together all the ingredients and set aside.", "Warm the tortillas on the top shelf of the oven for 1 minute and place between two warmed plates.", "Slice the lamb into strips, about 2.5cm/1in wide. Serve the lamb on the open tortillas and top with the serving ingredients, yoghurt sauce and hot sauce, if using. Fill generously until unable to wrap."]}, {"isVegetarian": false, "title": "Lamb fore shanks with English vegetables", "url": "www_bbc_co_uk_food_recipes_lamb_fore_shanks_with_73979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_fore_shanks_with_73979_16x9.jpg", "ingredients": ["3 tbsp oil", "6 x 200g/7oz lamb fore shanks", "2 onions, sliced", "2 garlic cloves, crushed", "1 rounded tbsp plain flour", "300ml/10fl oz red wine", "450ml/16fl oz chicken stock", "1 tbsp redcurrant jelly", "1 tbsp chopped rosemary leaves", "250g/9oz baby carrots, cut in half lengthways if large", "250g/9oz parsnips, cut into batons ", "250g/9oz baby turnips, cut in half lengthways if large", "a knob of butter", "salt and freshly ground black pepper", "2 tbsp chopped parsley, to garnish"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Heat 2 tablespoons of the oil in a deep, ovenproof frying pan or flameproof casserole dish and brown the lamb shanks all over on a high heat for 5–6 minutes or until golden-brown. Remove with a slotted spoon and set aside.", "Add the remaining oil and the onion and garlic and fry over a medium heat for 3–4 minutes until soft. Measure the flour into a bowl, pour in the wine and whisk into a smooth paste. Add the stock to the onions, then add the wine and flour mixture and, stirring continuously, bring to the boil. Add the redcurrant jelly and rosemary and stir until thickened.", "Place the browned lamb back in the pan, season with salt and pepper, then cover with a lid and transfer to the oven to cook for about 2 hours or until the lamb is tender and just falling off the bone.", "When ready to serve, bring a saucepan of salted water to the boil, add the carrots, parsnips and turnips and boil for 8–10 minutes or until tender. Drain.", "Add a third of the vegetables to the lamb casserole and stir. Melt a knob of butter in a frying pan and fry the remaining vegetables over a high heat for 4–5 minutes or until golden-brown. Season with salt and pepper and remove from the hob.", "Serve one fore shank per person with some of the sauce and vegetables from the casserole and extra fried vegetables on the side. Garnish with the chopped parsley to finish."]}, {"isVegetarian": false, "title": "Lamb kofta curry", "url": "www_bbc_co_uk_food_recipes_lamb_kofta_curry_60692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, roughly chopped", "2 plump green chillies (deseed first if you prefer)", "15g/½oz chunk fresh root ginger, peeled and roughly chopped", "4 garlic cloves, roughly chopped", "1 tsp flaked sea salt", "2 tsp garam masala", "¼ tsp hot chilli powder", "1 tbsp tomato purée ", "freshly ground black pepper", "600g/1lb 5oz lean minced lamb", "3 heaped tbsp finely chopped, fresh coriander leaves", "thick natural yogurt and fresh coriander, to serve (optional)", "3 tbsp ghee or sunflower oil", "2 onions, roughly chopped", "4 garlic cloves, finely chopped", "25g/1oz chunk fresh root ginger, peeled and finely chopped", "½ -1 tsp hot chilli powder", "1 tbsp garam masala ", "4 large ripe tomatoes, roughly chopped", "1 tbsp tomato purée", "1 tsp flaked sea salt", "½ tsp caster sugar", "500ml/18fl oz lamb stock (made with ½ lamb stock cube)", "1 cinnamon stick", "2 bay leaves", "cooked rice", "thick natural yogurt ", "fresh coriander leaves "], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the onion, chillies, ginger, garlic, salt, garam masala, chilli powder and tomato purée in a food processor. Season with lots of freshly ground black pepper. (For a great flavour add more than you imagine you’ll need.)", "Blend the ingredients into a paste as smooth as you can get it. You’ll need to remove the lid of the food processor and push the mixture down with a spatula 2-3 times.  Add the lamb and blend once more. Transfer to a bowl and stir in the coriander. Cover the dish with cling film and chill for 1-3 hours, or overnight, to allow the mixture to stiffen and the meat to absorb all the wonderful spices.", "To make the sauce, heat the ghee (or oil) in a large non-stick saucepan or sauté pan and gently fry the onions, garlic and ginger for about 10 minutes, or until softened and lightly browned, stirring regularly. Add the chilli powder and garam masala and cook for 20-30 seconds, stirring constantly.  ", "Stir in the roughly chopped tomatoes and cook for 3-4 minutes over a high heat, or until they soften and release their juice, stirring constantly. Add the tomato purée and sprinkle with the salt and sugar and pour over the lamb stock. Season with lots of ground black pepper, add the cinnamon and bay leaves and bring to a simmer. Cover the sauce loosely with a lid and cook for 20 minutes, stirring occasionally.", "While the sauce is simmering, make the meatballs. Take a small portion of mince mixture at a time and roll into a smooth ball – a little smaller than a walnut in its shell. You should be able to make around 24 balls. If your mince becomes a little sticky, either roll with wetted hands or dust your hands with plain flour as you roll. Put on a plate as soon as each one is rolled.", "Remove the pan with the sauce from the heat after its 20 minutes are up and discard the cinnamon stick and bay leaves – they will be easy to pick out with a fork or tongs. Blend the sauce with a stick blender until as smooth as possible. (If you don’t have a stick blender, leave to cool for a few minutes then transfer to a food processor and blend to a purée.)", "Return the sauce to the heat and stir in 200ml/7fl oz water. Bring to a gentle simmer. Drop all the meatballs gently into the bubbling sauce and return to a simmer. Cook, uncovered, for a further 30-35 minutes, or until the meatballs are tender and the sauce is thick, stirring regularly. If the sauce reduces too far or begins to stick on the bottom of the pan, add a little extra water and continue cooking. Adjust the salt and pepper to taste. ", "Serve the meatballs with rice, topped with thick natural yogurt and fresh coriander leaves if you like."]}, {"isVegetarian": false, "title": "Lamb koftas with spicy tahini dip", "url": "www_bbc_co_uk_food_recipes_lamb_kofta_with_spicy_47334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz lean lamb mince", "50g/1¾oz sweet potato, grated", "50g/1¾oz fresh breadcrumbs", "50g/1¾oz Greek-style plain yoghurt", "2 garlic cloves, crushed", "2 tsp ground coriander", "1 tsp ground cumin", "2 tbsp finely chopped fresh coriander", "2 tbsp finely chopped fresh mint", "1 bunch flatleaf parsley, finely chopped", "olive oil, for greasing", "sea salt and freshly ground black pepper", "200g/7oz Greek-style plain yoghurt", "3 tbsp tahini", "2 lemons, juice only", "4 garlic cloves, crushed", "¼ tsp hot chilli powder", "1 tsp sea salt", "8 crisp Little Gem leaves", "1 tsp fresh mint, finely chopped", "1 tsp fresh coriander, finely chopped", "1 tsp flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "For the koftas, mix all the ingredients up to and including the parsley together and season with salt and pepper. Shape the mixture into 16 ovals. ", "Lightly grease a baking tray with the oil. Arrange the koftas on the tray and bake for 30–35 minutes, turning after 20 minutes. ", "For the tahini dip, mix all the ingredients together in a bowl. Stir in 3–6 tablespoons water if you prefer a looser dip.", "To serve, place two lettuce leaves on each of four plate, top with four koftas, drizzle with the tahini dip and sprinkle with the herbs. Roll up the leaves and enjoy."]}, {"isVegetarian": false, "title": "Lamb koftas and baba ganoush", "url": "www_bbc_co_uk_food_recipes_lamb_koftas_and_baba_53755", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb lamb mince", "1 tsp ground coriander", "1 tsp ground cumin", "1 tsp ground turmeric", "1 garlic clove, crushed", "1 lime, juice only", "1 green chilli, finely chopped", "2-3 tbsp freshly chopped coriander", "salt and pepper", "4-5 tsp vegetable oil, for frying", "flatbreads, to serve", "2 aubergines", "2 garlic cloves", "4 tbsp tahini", "2 lemons, juice only", "1 tsp ground cumin", "2 tbsp olive oil", "2 tbsp freshly chopped parsley"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the koftas, mix the mince with all the other ingredients, except the oil, in a large bowl and use your hands to make golf-ball sized rounds, which you can then mould into long cylinder-like kofta shapes. Place the koftas on a baking tray and transfer to the fridge to chill for a couple of hours.", "Heat the vegetable oil in a deep frying pan until hot. Shallow fry the koftas (alternatively cook on a hot barbecue or in an oven preheated to 200C/400F/Gas 6 for 20-25 minutes). When the koftas are cooked through, set them aside to rest until ready to serve.", "Meanwhile, make the baba ganoush. Roast the aubergines directly over a gas flame on the hob until the skins are blackened (or use a chef's blowtorch if you have one) taking care not to burn yourself. Leave to cool for a bit, then peel away the charred skin.", "Put the aubergine flesh into a food processor or blender with the garlic, tahini, lemon juice, cumin and some salt and pepper and blend to a rough paste. Transfer to a serving dish, drizzle with the olive oil and scatter with the parsley.", "Serve the cooked koftas with the baba ganoush and flatbreads."]}, {"isVegetarian": false, "title": "Lamb koftas with brown sauce and a cucumber and mint salad", "url": "www_bbc_co_uk_food_recipes_lamb_koftas_with_brown_86271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/1lb 4oz lamb mince", "salt, to taste", "½ tsp ground mace", "2 red chillies, chopped", "4 garlic cloves, crushed", "1 small red onion, finely chopped", "1 red pepper, finely chopped", "handful fresh coriander, chopped", "1 tsp coriander seeds, toasted and ground ", "1 tsp cumin seeds, toasted and ground", "1 tsp fennel seeds, toasted and ground ", "1 tsp pepper corns, toasted and ground ", "4 tbsp sunflower oil", "1 onion, finely chopped", "600g/1lb 5oz tinned chopped tomatoes", "250g/9oz dates, chopped", "2 Granny Smith apples, peeled, cored and chopped", "75g/2½oz dark brown sugar", "3 tbsp blackstrap molasses", "175ml/6fl oz malt vinegar", "100g/3½oz packet tamarind pulp without seeds", "4 tbsp Worcestershire  sauce", "2 tsp mustard powder", "1 tsp sea salt", "6 garlic cloves, roughly chopped", "1 tsp cayenne pepper", "7cm/3in piece of cassia or cinnamon", "1 tsp paprika", "6 whole cloves", "½ tsp whole black peppercorns", "½ tsp ground cardamom", "2 sprigs fresh tarragon, leaves only, finely chopped ", "½ cucumber, peeled and sliced", "2 tbsp chopped fresh mint", "200g/7oz thick natural yoghurt", "2 tbsp mint jelly", "1 garlic clove, chopped", "pinch chilli powder", "1 lemon, juice only", "flatbreads, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb koftas, put all the ingredients, apart from the oil, in a large bowl and mix to combine. Form into sausage shapes. If you have the time, leave them to rest in the fridge for half an hour.", "Heat a flat griddle pan. Oil the koftas and cook on the griddle pan and cook for 5–6 minutes. Keep turning until cooked through.", "For the brown sauce, place all the ingredients, except for the tarragon, into a large wide pan and add enough water to cover the ingredients. Cook for about an hour and a half until reduced to a think consistency. Remove from the heat and blend until smooth. Finish with the fresh tarragon.", "For the cucumber and mint salad, place all the ingredients into a large bowl and mix.", "Serve the lamb koftas with flatbreads, the brown sauce and the salad."]}, {"isVegetarian": false, "title": "Lamb lettuce wraps with peanut sauce", "url": "www_bbc_co_uk_food_recipes_lamb_lettuce_wraps_with_40131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz lean diced lamb leg ", "150ml/5fl oz dark soy sauce", "6 tbsp clear honey ", "4 tsp ground cinnamon ", "3 tsp ground cumin ", "2 garlic cloves, crushed ", "vegetable oil, for frying ", "2 heads round lettuce or 3 heads Little Gem lettuce, leaves separated ", "1 x 400ml tin coconut milk ", "250g/9oz smooth peanut butter ", "2 tbsp clear honey ", "unsalted peanuts, roughly chopped, to serve ", "4 spring onions, roughly chopped, to serve"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Using a meat mallet or a rolling pin, flatten each piece of lamb with a few hits. Add the meat to a mixing bowl with the soy sauce, honey, cinnamon, cumin and garlic. Using your hands, mix well so that the honey is spread evenly into the mixture. Cover with cling film and leave in the fridge to marinate for at least 2 hours, or overnight. ", "For the peanut sauce, heat the coconut milk, peanut butter and honey in a saucepan over a medium-low heat. Bring to a gentle simmer, stirring constantly, until the peanut butter and honey dissolve into the coconut milk. Set aside until needed. ", "Heat a large frying pan over a medium-high heat and drizzle in a little vegetable oil. Shaking off any excess marinade, fry the lamb a little at a time to ensure you don’t overcrowd the pan. ", "Meanwhile, gently reheat the peanut sauce until warm. ", "Serve the meat on a platter with the lettuce leaves, peanuts and spring onions and the peanut sauce in a bowl. To assemble a wrap, take a lettuce leaf, place some lamb on top, drizzle with peanut sauce and top with nuts and spring onions. Roll up and enjoy. "]}, {"isVegetarian": false, "title": "Lamb curry with coriander rice and chapatis", "url": "www_bbc_co_uk_food_recipes_lamb_madras_with_59455", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2 tbsp coriander seeds", "2 tbsp fenugreek seeds", "1 tbsp mustard seeds", "1 tsp cumin seeds", "½ tsp fennel seeds", "1 tsp black peppercorns", "1 cinnamon stick, broken into pieces", "5 cloves", "1 tbsp ground turmeric", "1½-2kg/3lb 5oz - 4lb 8oz lamb shoulder", "olive oil, for drizzling", "1 green bird's-eye chilli", "2 garlic cloves", "1.5cm/¾in piece fresh root ginger, peeled", "1 onion, thinly sliced", "12 curry leaves", "3 cardamom pods", "2 bay leaves", "400g tin chopped tomatoes", "200ml/7fl oz beef stock", "2 tsp tamarind juice", "2 tbsp chopped fresh coriander", "salt and freshly ground black pepper", "325g/11½oz chapati flour, plus extra for dusting (available in some supermarkets and Asian grocers)", "1½ tsp salt", "1 tbsp oil", "200g/7oz basmati rice", "1 tbsp coriander leaves"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put all of the curry powder ingredients into a spice grinder and grind to a fine powder. (Alternatively use a pestle and mortar.)", "Preheat the oven to 170C/150C Fan/Gas 2. ", "Season the lamb all over with salt and pepper and 2 tbsp of the curry paste. Place the lamb in an ovenproof dish and drizzle with olive oil. Cook in the oven for 2-4 hours.", "In a small food processor, blend the chilli, garlic and ginger to a paste, adding a splash of water if necessary. ", "Place a pan over a high heat and add the onions (add a splash of oil to the pan if it is too dry). Fry for 2-3 minutes, or until softened and starting to colour. ", "Add 2½ tablespoons of the curry powder to the pan along with the garlic, chilli and ginger paste, curry leaves, cardamom and bay leaves. Stir well and cover with the chopped tomatoes, beef stock and tamarind juice. Season, to taste, with salt and freshly ground black pepper. Cover the pan with a lid and simmer over a low heat for 30-40 minutes.", "Once the lamb has cooked, allow it to rest for at least 20 minutes. Shred the lamb meat and stir it into the sauce. Add the coriander just before serving.", "For the chapatis, sift the flour and salt into a large bowl and gradually mix in about 200ml/7fl oz water to form a soft dough (you may not need all of the water). Cover and set aside to rest for 10 minutes.", "Turn the dough out onto a floured work surface, lightly knead and then divide equally into 12 balls. Roll out each ball as thinly as possible. Heat a frying pan over a high heat and add the oil. Cook the chapatis one at a time, frying for 1-2 minutes on both sides or until golden-brown and puffed up. ", "Place the rice in a saucepan and add 350ml/12fl oz salted water and bring to the boil. Cook over a low heat until the water has evaporated, then remove from the heat, cover with a lid and leave to steam for 10 minutes. When the rice is cooked, stir through the coriander leaves ", "To serve, put the curry in a shallow serving bowls and serve the rice and chapatis on the side."]}, {"isVegetarian": false, "title": "Lamb madras with bombay potatoes", "url": "www_bbc_co_uk_food_recipes_lamb_madras_with_bombay_09160", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_madras_with_bombay_09160_16x9.jpg", "ingredients": ["1 x 2.5kg/5½lb shoulder of lamb", "1 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp coriander seeds", "2 tbsp fenugreek seeds", "1 tbsp mustard seeds", "1 tsp cumin seeds", "½ tsp fennel seeds", "1 tsp black peppercorns", "1 cinnamon stick", "5 cloves", "1 tbsp ground turmeric", "1 green bird’s-eye chilli", "2 garlic cloves, peeled", "1½cm/¾in root ginger, peeled", "1 onion, thinly sliced", "2 tbsp vegetable oil", "12 curry leaves", "3 cardamom pods", "2 bay leaves", "400g/14oz chopped tomatoes", "200ml/7fl oz beef stock", "2 tsp tamarind paste", "500g/1lb 2oz potatoes, cut into 2cm/1in cubes", "4 tbsp vegetable oil", "½ tsp mustard seeds", "½ tsp chilli powder", "¼ tsp ground turmeric", "2 tbsp fresh coriander, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the roast shoulder of lamb, preheat the oven to 170C/325F/Gas 3.", "Rub the shoulder of lamb all over with the olive oil, then season with salt and freshly ground black pepper and set aside.", "Meanwhile to make the Madras curry powder, place the coriander, fenugreek, mustard, cumin, fennel seeds, black peppercorns, cinnamon and cloves in a spice grinder and grind to a powder. Stir in the turmeric.", "Put the chilli, garlic and ginger in a small food processor and blend until a paste if formed. If it does not come together add a small amount of water. ", "Heat the vegetable oil in a casserole pot with a lid. Add the lamb and fry on all sides until browned. Remove the lamb from the casserole and set aside. ", "Add the onion to the hot casserole pot and fry until soft and starting to colour. Add 2½ tbsp of the Madras curry powder, then the garlic, chilli and ginger paste and the curry leaves, cardamom and bay leaves and stir.", "Add the lamb back into the pot and cover with the chopped tomatoes, stock and tamarind and season with salt and pepper. Place a lid on and roast the lamb in the oven for 3-4 hours, basting every hour or so with the juices in the roasting tray. Cook until the meat is very tender and falling off of the bone.", "Once cooked remove the lamb from the sauce and simmer the remaining liquid until it reduces in volume to make a thick sauce. ", "Using a fork, shred the lamb and add it back to the sauce.", "For the Bombay potatoes, place the potatoes in cold water and bring to the boil. Cook for 5-8 minutes and drain.", "Heat a large pan and add the oil. Once hot, add the mustard seeds. When they start popping in the pan add the chilli powder and turmeric and add the potatoes. Take care of your eyes and face while the mustard seeds are popping.", "Cook for 5-8 minutes, or until the potatoes absorb the spices.", "To serve, place the lamb Madras on a serving plate with the potatoes alongside. Garnish with chopped coriander."]}, {"isVegetarian": false, "title": "Lamb pencil fillets with kidneys and balsamic vinegar", "url": "www_bbc_co_uk_food_recipes_lamb_pencil_fillets_with_11465", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp rapeseed oil", "55g/2oz butter, plus 1 tbsp for the sauce", "4 lambs’ kidneys, trimmed and halved", "10 lamb pencil fillets", "250ml/9fl oz chicken stock", "1 tbsp balsamic vinegar", "1 tbsp chopped fresh mint", "1 tsp mint sauce", "1 tsp wholegrain mustard", "1/2 shallot, finely chopped", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat, add 25g/1oz of the butter and fry the kidney halves for three minutes, turning, to colour, then remove from the pan and keep warm. ", "Add a further 25g/1oz butter to the pan and fry the pencil fillets for three minutes, turning, to colour, keeping them underdone. Remove from the pan and keep warm.", "Remove excess oil from the pan, then add the stock and vinegar and reduce. Add the mint, mint sauce, mustard and shallot and mix.. ", "Just before serving, stir one tablespoon of butter into the sauce along with the parsley and any meat juices from the pencil fillets. ", "Divide the lamb and kidneys between plates and serve with the sauce and seasonal vegetables. "]}, {"isVegetarian": false, "title": "Lamb rendang with coriander and lime rice", "url": "www_bbc_co_uk_food_recipes_lamb_rendang_with_83481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp vegetable oil", "4 lamb shanks", "20g/¾oz coriander seeds", "½ tsp cumin seeds", "½ tsp turmeric powder", "1 cinnamon stick", "3 cardamom pods, crushed and seeds removed", "1 star anise", "1 large onion, sliced", "3 garlic cloves, chopped", "3 red chillies, seeds removed and chopped", "1 thumb-sized piece of fresh root ginger, peeled and chopped", "1 lemongrass stalks, pounded", "1 bay leaf", "50g/1¾oz tamarind paste", "1 x 400g/14oz tin coconut milk", "250ml/9oz warm beef stock", "200g/7oz basmati rice", "1 tbsp coriander leaves", "1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb rendang, heat a large casserole or ovenproof pan and add two tablespoons of oil. Fry the lamb shanks to seal them all over and set aside.", "In a dry frying pan, gently toast the coriander seeds, cumin seeds, turmeric, cinnamon stick, cardamom seeds and the star anise until fragrant. Tip into a spice grinder and grind to a powder (alternatively place in a mortar and pound with a pestle until the spices are as fine as possible).", "In a large pan heat the remaining oil and, once hot, add the onion, garlic, chillies, ginger and pounded lemongrass. Cook gently until the onions have softened and the mixture starts to smell fragrant. ", "Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma.", "Add the lamb shanks, increase the heat and stir to brown the meat and completely coat it in the spices – this will take a few minutes. ", "Add the tamarind paste and coconut milk, bring to the boil and then add the warm stock. ", "Increase the heat to high and continue cooking to reduce the volume of liquid in the pan. Stir occasionally until the sauce has reduced to a thick paste, then reduce the heat to low and keep cooking and stirring until the sauce is really thick and coats the meat – approximately 2½ hours.", "For the coriander rice, place the rice in a pan with 365ml/12fl oz salted water. Cook over a low heat until the water has evaporated, then remove from the heat, cover with a lid and leave to steam for 10 minutes.", "When the rice is cooked, stir through the coriander leaves and lime juice.", "To serve, pile the rice onto serving plates and place a lamb shank on top and spoon over the rendang sauce."]}, {"isVegetarian": false, "title": "Lamb rogan josh", "url": "www_bbc_co_uk_food_recipes_lamb_rogan_josh_04376", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_rogan_josh_04376_16x9.jpg", "ingredients": ["1 bunch fresh coriander, stalks and leaves separated", "1 red chilli, seeded and roughly chopped", "2 tsp coriander seeds, toasted and ground", "2 tsp cumin seeds, toasted and ground", "1 tsp black peppercorns, roughly ground", "2 tsp paprika", "1 tsp turmeric", "2 tsp garam masala", "pinch salt", "2 tbsp tomato purée", "1 tbsp groundnut oil", "5cm/2in cinnamon stick", "5 cardamom pods, lightly crushed", "3 dried bay leaves", "4 cloves", "1 onion, roughly chopped", "600g/1lb 5oz lamb neck fillet, all visible fat removed, cut into 3cm/1in chunks", "2 garlic cloves, peeled and crushed", "1 thumb-sized piece fresh root ginger, peeled and finely grated", "100g/3½oz fat-free natural yoghurt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the paste, in a mixer, blend together the coriander stalks, red chilli, ground spices and salt. Mix in the tomato purée. ", "To cook the lamb, heat the oil in a large heavy-based casserole. Fry the cinnamon stick, cardamom pods, bay leaves and cloves for 2 minutes. Add the onion and lamb and fry for 4-5 minutes, stirring. Add the garlic and ginger and fry for 2 minutes. ", "Add the spice paste  and fry for another 2 minutes, stirring", "Add 400ml/14fl oz water, then cover with a lid and simmer for 40-50 minutes, until cooked. Stir in the yoghurt and cook for 10 minutes. Serve garnished with the fresh coriander leaves."]}, {"isVegetarian": false, "title": "Lamb rump with roasted onion squash and salsa verde", "url": "www_bbc_co_uk_food_recipes_lamb_rump_with_roasted_47021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemons, juice only", "75ml/3fl oz olive oil", "6 garlic cloves, left whole", "2 tbsp chopped fresh rosemary", "4 lamb rumps, with fat on", "salt and freshly ground black pepper", "50g/2oz fresh flatleaf parsley leaves", "25g/1oz rocket leaves", "15g/½oz fresh mint leaves", "15g/½oz fresh marjoram leaves", "4-6 tbsp olive oil (to cover the herbs)", "¼ garlic clove", "1½ tbsp capers", "6 anchovy fillets", "1 tbsp Dijon mustard, or to taste", "salt and freshly ground black pepper", "4 onion squash (or other small autumn squash), peeled and cut in half, seeds removed, flesh cut into 3cm/1¼in cubes", "35ml/1¼fl oz olive oil, plus extra for drizzling", "1 tsp fresh thyme leaves", "1 garlic clove, finely chopped", "800g/1lb 12oz fresh spinach", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the lamb, preheat the oven to 190C/375F/Gas 5.", "Pour the lemon juice and olive oil into a bowl. Add the six whole garlic cloves and all of the rosemary and mix together.", "Add the lamb rump and rub it all over with the marinade. Set aside for at least one hour.", "Meanwhile, for the salsa verde, finely chop the herbs and cover with oil immediately so that they don’t turn brown.", "Pound the garlic, capers and anchovies to a paste in a pestle and mortar (or in a food processor).  ", "Mix the herbs into the paste, then stir in Dijon mustard, to taste. ", "Season, to taste, with salt and freshly ground black pepper (remember that anchovies and capers are both quite salty). ", "For the roasted onion squash, place the cubes of onion squash into an ovenproof dish. Mix with the olive oil, the thyme and  the chopped garlic.", "Cover the dish with aluminium foil and cook for 30 minutes, or until softened.", "Remove the aluminium foil and return the squash to the oven for a further 5-10 minutes, or until golden-brown. Keep warm.", "Remove the lamb from the marinade and pat dry. Season all over with salt and freshly ground black pepper.", "Heat an ovenproof frying pan over very high heat. When the pan is hot, add the marinated lamb rump and fry on all sides, or until browned all over.", "Transfer the lamb to the oven and roast for 10-12 minutes (for medium, depending on the size of the rump).", "Remove the lamb from the oven and set aside to rest for a couple of minutes.", "While the lamb is resting, bring a pan of salted water to the boil. Add the spinach and boil for one minute, or until wilted. Drain into a colander and press lightly with the back of a wooden spoon to remove any excess water. Season, to taste, with salt and freshly ground black pepper and drizzle over a little olive oil.", "To serve, spoon a little of the roasted onion squash into the centre of each of four serving plates. Pile a little spinach on top of each portion of squash. Carve each lamb rump lengthways into three slices and rest them against the spinach and squash. Spoon some of the salsa verde on top of the lamb."]}, {"isVegetarian": false, "title": "Lamb sausages in prosciutto with fresh green salad", "url": "www_bbc_co_uk_food_recipes_lamb_sausages_in_82136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "500g/1lb 1oz lamb mince", "1 tbsp ground coriander", "2 tbsp ground cumin", "½ red onion, finely chopped", "3 tbsp finely chopped fresh flatleaf parsley", "1 red chilli, seeds removed, finely chopped", "4 tbsp fresh breadcrumbs", "1 free-range egg, beaten", "salt and freshly ground black pepper", "12 prosciutto slices", "150g/5¼oz fresh peas (shelled weight)", "150g/5¼oz fresh broad beans (podded weight)", "6 smoked bacon rashers, cut into strips", "small handful rocket", "Small handful baby spinach", "6 tbsp olive oil", "2 tbsp white wine vinegar", "1 tsp wholegrain mustard", "2 tbsp crème fraîche", "200g/7¼oz natural yoghurt", "¼ cucumber, peeled, diced", "2 tbsp chopped fresh mint", "salt and freshly ground black pepper."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb sausages, preheat the oven to 190C/375F/Gas 5. Lightly grease a baking tray", "Place the lamb mince in a large bowl and break it up using a fork. Add the ground coriander, cumin, onion, parsley, chilli and breadcrumbs and stir. Add the egg, season, to taste, with salt and freshly ground black pepper and mix until well combined.", "Divide the mixture in 12 portions, shape each portion into a sausage using your hands, then wrap in a slice of prosciutto. Place the sausages onto the prepared baking tray and bake for 20-25 minutes, or until golden-brown and cooked though.", "Meanwhile, for the yoghurt and cucumber dip, mix all of the ingredients together in a bowl and season, to taste, with salt and freshly ground black pepper.", "For the fresh green salad with bacon, steam the peas and broad beans for three minutes, or until tender. Refresh the peas and broad beans in a bowl of iced water, then drain and pat dry with kitchen paper.", "Fry the bacon in a frying pan for 1-2 minutes on each side, or until crisp. Set aside to drain on kitchen paper.", "For the creamy mustard vinaigrette, whisk all of the ingredients together in a small bowl. Place the rocket, baby spinach, peas, broad beans and bacon into a large bowl, pour over the dressing and mix until well combined.", "To serve, place the sausages onto each of four serving plates and spoon the salad alongside. Serve the yoghurt and cucumber dip in a small bowl alongside."]}, {"isVegetarian": false, "title": "Lamb sausages on lightly pickled cabbage and bacon", "url": "www_bbc_co_uk_food_recipes_lamb_sausages_on_lightly_66276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp rapeseed oil", "12 lamb sausages", "1 green cabbage, shredded", "2 tbsp salt", "55g/2oz butter", "6 rashers bacon, cut into small strips", "1 shallot, finely chopped", "1 tbsp white wine vinegar", "salt freshly ground black pepper", "12-16 new potatoes, boiled ", "fresh curly parsley, chopped,  to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan and cook the sausages, turning regularly, for 15-20 minutes, or until cooked through.", "Meanwhile, in a bowl, mix the cabbage with the salt. Bring a large pan of water to the boil, then plunge the cabbage into the water for 30 seconds. Drain the cabbage, then put it in a large bowl of cold water. Drain again and set aside.", "Melt the butter in a large sauté pan and fry the bacon until lightly browned. Lower the heat and add the shallot. Add the drained cabbage and vinegar and cook for three minutes, or until done to your liking. Season to taste with salt and pepper.", "Serve the sausages with the cabbage and new potatoes, garnished with the chopped parsley."]}, {"isVegetarian": false, "title": "Lamb shank tagine with figs", "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_18307", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "4 lamb shanks", "2 onions, thickly sliced", "4 garlic cloves, finely chopped", "1 tsp ground coriander", "1 tsp ground cumin", "½ tsp cayenne pepper", "½ tsp ground cinnamon", "½ tsp ground cardamom", "½ tsp ground ginger", "600ml/20fl oz chicken stock", "large pinch saffron, soaked in warm water", "salt and freshly ground black pepper", "1 tbsp honey", "12 dried figs", "1 tbsp preserved lemon, finely chopped", "1 tbsp lemon juice", "few parsley leaves", "few mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large casserole. Add the shanks, two at a time, and brown well on all sides. Remove the shanks from the casserole and add the onions. Fry for several minutes until starting to take on some colour, then add the garlic and spices. Cook for a couple more minutes.", "Pour in the chicken stock, saffron and soaking water. Return the shanks to the saucepan and season well with salt and pepper. Bring to the boil, then turn down and cover. ", "Cook for around two hours, or until the shanks are tender. Remove the shanks from the casserole and skim off the excess fat. Return the shanks to the casserole and add the honey, figs and preserved lemon. ", "Continue to cook on a medium heat, uncovered, for a further half an hour, to soften the figs and reduce down the volume of liquid. Stir through the lemon juice and taste for seasoning. Add salt and pepper, to taste.", "Serve the tagine garnished with parsley and mint leaves."]}, {"isVegetarian": false, "title": "Lamb seekh kebab", "url": "www_bbc_co_uk_food_recipes_lamb_seekh_kebab_07913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 green chillies, stalk removed, broken", "2 tbsp chopped fresh coriander (stem, stalk and leaves)", "3 garlic cloves, peeled", "1cm/½in piece fresh root ginger, peeled", "50g/1¾oz lamb fat (from around the kidney preferably)", "½ tbsp Kashmiri red chilli powder", "1 tsp cumin seeds, lightly toasted", "1 tsp garam masala ", "1 tsp salt", "450g/1lb lamb mince (or diced boned lamb)", "2 red onions, 1 peeled and very finely chopped, 1 sliced into 3-5mm thick slices", "1 red pepper, seeds removed, very finely chopped", "1 large tomato, sliced into 3-4mm thick slices", "1 tbsp chopped fresh coriander (stem, stalk and leaves)", "100g/3½oz coriander leaves and stalks, washed thoroughly to remove any grit ", "20g/1oz mint leaves, stalks removed (optional)", "3 garlic cloves, peeled", "3 Thai green chillies, stalks removed", "3 tbsp vegetable oil", "1 tsp salt", "½ tsp sugar", "1 lemon, juice only", "salad greens, to serve ", "1 pomegranate, seeds removed", "naan breads, to serve (optional)"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the kebab, put all the ingredients except the mince in a food processor. Blend until thoroughly combined then add the mince and pulse briefly - this will maintain the texture of the meat. Alternatively, mix all the ingredients together in a bowl and pass through a mincer.", "Chill the spiced mince in the fridge for an hour to take in the flavours and firm up.", "For the vegetable coat, mix all the ingredients together and season with salt, to taste.  Set aside.", "For the kebab, preheat a barbecue or grill to hot.", "Divide the mince into two equal parts. Take one half and divide into six equally-sized balls. Wet your hands and using your fingers, slowly spread the mince on the skewers to make kebabs 8-10cm/3¼-4in long. To avoid the mixture sticking, keep your hands wet and intermittently run water over the kebabs as you make them. This will smooth the outer texture of the kebab. Make sure the kebabs are quite thick, as this will help retain the flavours and juices. ", "Coat the kebabs with half the chopped vegetables and press lightly so the colourful vegetables stick to the mince. Set aside until ready to cook.", "Divide the remaining mince mixture into six balls. Spread the remaining chopped vegetables on a chopping board, then press the balls of mince into the vegetables so they stick to one side. Set aside.", "For the green coriander chutney, in a food processor blend together the herbs, garlic and chillies until a soft, spoonable consistency. Transfer to a small bowl and cover with the oil. (This will keep in the fridge for 2-3 days, but once salt and lemon have been added, it is best used straight away.) ", "When ready to use, mix in the salt, sugar and lemon juice. Taste to check the seasoning.", "Cook the kebabs on the barbecue or under a grill for 6-8 minutes, turning regularly to ensure the meat is cooked evenly throughout. ", "Cook the meat patties on a hot grill pan or barbeque for 3-4 minutes, vegetable side first, then turn over and cook another 2-3 minutes. ", "Rest the kebabs for a few of minutes then serve with the green coriander chutney, salad leaves and pomegranate seeds. Or serve in naan breads to make wraps."]}, {"isVegetarian": false, "title": "Lamb shank tagine with tabbouleh", "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_28848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp ras-el-hanout", "½ tsp ground cinnamon", "½ tsp ground ginger", "½ tsp smoked sweet paprika", "½ tsp ground cumin", "¼ tsp freshly ground black pepper", "¼ tsp ground turmeric", "4 lamb shanks ", "3 tbsp olive oil", "1 onion, thickly sliced", "2 garlic cloves, peeled, finely chopped", "1 x 400g/14oz tin chopped tomatoes", "1 tbsp runny honey", "2 tbsp pomegranate molasses (available from Middle Eastern grocers and some supermarkets)", "½ tsp saffron", "350ml/12fl oz chicken stock", "125g/4½oz stoneless dried apricots, halved", "110g/4oz green olives, stones removed", "75g/2½oz whole almonds", "salt and freshly ground black pepper", "2 preserved lemons, rind only, chopped", "175g/6oz bulgur wheat", "350ml/12fl oz chicken stock", "1 small red onion, finely chopped", "100g/3½oz pistachios, roughly chopped", "1 lemon, juice only", "1 pomegranate, seeds only", "3 tbsp extra virgin olive oil", "small bunch each of fresh flat leaf parsley, coriander and mint, chopped ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb shank tagine, preheat of the oven to 160C/315F/Gas 3.", "Mix the ras-el-hanout, ground cinnamon, ground ginger, smoked sweet paprika, ground cumin, freshly ground black pepper and ground turmeric together in a bowl. Add the lamb shanks and turn in the mixture to coat them evenly. ", "Heat a large pan until smoking hot, then add a tablespoon of the olive oil and sear the lamb shanks on all sides for 2-3 minutes, or until golden-brown all over. Remove the lamb shanks from the pan and set aside.", "Add the remaining olive oil to the same pan and fry the onion and garlic for 2-3 minutes, or until softened. Add the lamb shanks back to the pan and stir well, then add all of the remaining tagine ingredients - except for the coriander and salt and freshly ground black pepper - and bring to a simmer. ", "Reduce the heat, cover the pan with a lid and place in the oven for two hours, or until the lamb is tender. ", "Remove the lid and cook for a further 30 minutes, or until the tagine is slightly thickened. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the tabbouleh, place the bulgur wheat into a pan with the chicken stock. Bring to the boil, then reduce the heat to a simmer. Cover the pan with a lid and cook for 8-10 minutes over a low heat. Check that the bulgur wheat is tender. If not cook for a little longer. When cooked drain off the excess stock.", "Remove from the heat and allow to cool slightly, and then transfer the bulgur wheat to a bowl. Add the red onion, pistachios, lemon juice, pomegranate, olive oil and herbs and mix well. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the tabbouleh among four serving plates, and then spoon the lamb shank tagine alongside and sprinkle the coriander and preserved lemon over the top and serve."]}, {"isVegetarian": false, "title": "Lamb shank tagine with herb tabbouleh", "url": "www_bbc_co_uk_food_recipes_lamb_shank_tagine_with_41954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks ", "3 tbsp olive oil", "1 onion, thickly sliced", "2 garlic cloves, peeled, finely chopped", "1 tsp ras-el-hanout", "2 tbsp harissa paste", "2 cinnamon sticks", "½ tsp ground ginger", "½ tsp smoked sweet paprika", "1 tsp ground cumin", "¼ tsp freshly ground black pepper", "½ tsp ground turmeric", "1 x 400g/14oz tin chopped tomatoes", "1 tbsp clear honey", "½ tsp saffron", "350ml/12fl oz chicken stock", "125g/4½oz stoneless dried apricots, halved", "110g/3¾oz green olives, stones removed", "100g/3½oz flaked almonds, leave a few for garnish", "salt and freshly ground black pepper", "175g/6oz bulgur wheat", "350ml/12fl oz chicken stock", "1 small red onion, finely chopped", "350g/12oz pistachio nuts, shells removed, roughly chopped", "1 lemon, juice and zest", "1 pomegranate, seeds only", "3 tbsp extra virgin olive oil", "3 tbsp chopped fresh flat leaf parsley ", "3 tbsp chopped fresh coriander leaves", "3 tbsp chopped fresh mint ", "3 tbsp chopped fresh tarragon", "2 tbsp coriander cress "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the lamb shank tagine, preheat the oven to 160C/325F/Gas 3.", "Heat a large tagine pan or a large ovenproof dish. Season the lamb shanks all over with salt and pepper. Pour in the olive oil and, once hot, fry the lamb shanks all over until golden-brown. Remove them from the pan and set aside.", "In the same pan you used to fry the shanks, add the onion and garlic and fry for 2-3 minutes.", "Add the ras-el-hanout, harissa, cinnamon sticks, ground ginger, smoked sweet paprika, ground cumin, freshly ground black pepper and ground turmeric and cook for a further two minutes. ", "Add the lamb shanks back to the pan and stir well, then add all of the remaining tagine ingredients - except a few of the flaked almonds for garnish.", "Reduce the heat, cover the pan with a lid and cook in the oven for two hours, or until the lamb is tender. ", "Remove the lid and cook for a further 30 minutes, or until the tagine is slightly thickened. ", "For the tabbouleh, place the bulgur wheat into a pan with the chicken stock. Bring to the boil, then reduce the heat to a simmer. Cover the pan with a lid and cook for 15-20 minutes over a low heat. When the bulgur wheat is tender, drain off the excess stock.", "Remove from the heat and allow to cool slightly, and then transfer the bulgur wheat to a bowl. Add the red onion, pistachios, lemon juice and zest, pomegranate, olive oil and herbs and mix well. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the tabbouleh among four serving plates, and then spoon the lamb shank tagine alongside. Chop the coriander cress and sprinkle over the tagine along with the flaked almonds."]}, {"isVegetarian": false, "title": "Lamb shanks with anchovy", "url": "www_bbc_co_uk_food_recipes_lamb_shanks_with_anchovy_36460", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_shanks_with_anchovy_36460_16x9.jpg", "ingredients": ["2 x lamb shanks ", "freshly ground black pepper", "1 tbsp olive oil", "2 onions, roughly chopped ", "1 clove garlic, sliced", "4 anchovy fillets, chopped ", "2 sprigs rosemary", "2 bay leaves", "250ml/8fl oz  chicken or beef stock ", "250ml/8fl oz red wine ", "handful of fresh parsley, chopped "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/300F/Gas 4.", "Season the lamb shanks with the pepper. Brown them in a casserole with a little olive oil.", "When the shanks are slightly browned add the roughly chopped onions and garlic. Chop up two of the anchovy fillets and add to the casserole. Tear in the rosemary and bay leaves.  Then add the stock and the wine and bring to a simmer. ", "When simmering, put the lid on and bake in the oven for two hours, with a little turn of the shanks halfway through.", "Remove the shanks to a serving dish and leave to rest in a warm oven. ", "Meanwhile tend to the sauce by adding two more chopped anchovies and a handful of chopped parsley. Bring the sauce to the boil, check the seasoning on then pour over the resting lamb shanks and serve."]}, {"isVegetarian": false, "title": "Lamb shanks pie", "url": "www_bbc_co_uk_food_recipes_lamb_shanks_pie_83534", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks", "1 tbsp rapeseed oil", "2 onions, roughly chopped", "4 garlic cloves, crushed", "2 tbsp plain flour, plus extra for dusting", "250ml/9fl oz white wine", "750ml/1¼ pints chicken stock", "600g/1lb 5oz potatoes, peeled and cut into 2.5cm/1in pieces", "3 large carrots, cut into 2.5cm/1in pieces", "4 celery stalks, cut into 2.5cm/1in pieces", "2 bay leaves", "2 sprigs fresh rosemary", "4 sprigs fresh thyme", "1 x 400g tin haricot beans, drained", "1 free-range egg and 1 free-range egg yolk, lightly beaten", "400g/14oz ready-made puff pastry", "300g/10½oz peas", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½.", "Season the lamb shanks all over with salt and freshly ground black pepper. ", "Heat the oil in a large, flameproof casserole over a high heat. Add the lamb shanks and fry for a few seconds on all sides, or until browned all over. Remove from the casserole and set aside.", "Reduce the heat to medium, add the onions and fry for 2-3 minutes, or until softened. Add the garlic and fry for a further 1-2 minutes. Stir in the flour so it forms a paste with the pan juices. Continue cooking for a minute, then slowly pour in the wine and stock, stirring well to combine it with the flour paste. ", "Add the potatoes, carrots, celery, bay leaves, rosemary and thyme and bring the mixture to the boil. Reduce the heat until the mixture is simmering.", "Stir in the drained beans, then return the lamb shanks to the casserole and bring the mixture back to simmering point. Cover the casserole with the lid and transfer to the oven for 2 hours. Alternatively, simmer over a low heat on the hob.", "When the meat on the lamb shanks comes away easily from the bone but is not falling off it, remove the casserole from the oven (or hob).", "Transfer the casserole contents to a large pie dish, standing the lamb shanks upright. Set aside to cool completely. (The lamb must be completely cooled before you top it with the pastry.)", "Preheat the oven to 180C/160C Fan/Gas 4.", "Brush the inside and outside of the rim of the pie dish with some of the beaten egg and egg yolk.", "Roll the pastry out onto a lightly floured work surface until it is 5cm/2in bigger than the diameter of the pie dish and about 0.5cm/¼in thick.", "Carefully lay the pastry over the lamb shanks in the pie dish. Using a sharp knife, make four small slits in the pastry where the lamb shank bones are, then gently push the pastry around the bones so that they stick through it. ", "Crimp the pastry around the edge of the pie dish to seal it to the outside rim. Brush the pastry all over with the remaining beaten egg and sprinkle the top with salt. ", "Bake the pie in the oven for 45-60 minutes, or until the pastry has risen and is golden-brown all over and the filling is hot. ", "Just before serving, cook the peas in a pan of salted, boiling water for 3-4 minutes, or until tender. Drain and serve with the pie. "]}, {"isVegetarian": false, "title": "Lamb shoulder pastilla, baked beetroot, salsa verde, ewes’ milk curd", "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_pastilla_74296", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz demerara sugar", "150g/5oz fine salt", "1 sprig thyme", "1 sprig rosemary", "1 bay leaf", "1 star anise", "2 garlic cloves, crushed", "1 lemon, peel only", "1kg/2lb 4oz boneless lamb shoulder", "1.5kg/3lb 5oz duck fat", "3 large sprigs thyme", "3 large sprigs rosemary", "1 bay leaf", "½ head of garlic", "200ml/7fl oz sherry", "4 small fresh beetroot, peeled", "rock salt and cracked white pepper", "olive oil", "10g/¼oz fresh thyme leaves", "10g/¼oz chopped rosemary", "175g/6oz picked mint", "110g/4oz picked flat leaf parsley", "75g/3oz picked basil", "1 shallot finely chopped", "1 garlic clove, very finely sliced", "pinch salt", "2 tsp English mustard", "6 fillets of anchovies marinated in brine", "300ml/10fl oz extra virgin olive oil", "10g/½oz capers, drained", "sherry vinegar", "100g/4oz ewes' milk curd, at room temperature", "lemon juice, to taste", "pinch cracked black pepper", "salt, to taste", "50g/2oz chopped mint", "250ml/9floz reduced lamb sauce", "salt and freshly ground black pepper", "sherry vinegar, to taste ", "25g/1oz salsa verde (from above)", "2 large roasting potatoes (such as Maris piper or Lovers), peeled", "250g/9oz clarified butter", "8 sheets filo pastry", "vegetable oil, for deep frying", "pinch ground cumin", "drizzle olive oil", "1 punnet pea shoots "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the lamb brine, mix all the ingredients except the lamb together in a saucepan with 2 litres/3½ pints of water and bring to a simmer, just to dissolve the sugar and salt. ", "Leave to cool, then submerge the lamb into the brine, cover and place in the fridge for 24 hours.", "For the confit of lamb, melt the fat with the herbs and garlic in a roasting tin over the hob to 85C/185F (using a food thermometer to check). Take the lamb shoulder out of the brine, pat it dry and carefully place it into the hot fat. ", "Cover with foil and cook for four hours either on the hob, or in the oven at 100C/225F/Gas ¼, checking and turning the lamb every hour. ", "The lamb is cooked when you can push a roasting fork or skewer through the meat like a block of butter. ", "Leave the lamb to cool completely in the fat and rest. ", "For the baked beetroot, preheat the oven to 180C/350F/Gas 4.", "Cut four squares of baking paper and foil the same size, big enough to wrap the beetroot and have a little excess at the top. ", "Heat the sherry in a pan and cook until it has reduced to half its volume.", "Cut the beetroots at the top with a cross nearly all the way through, season with the olive oil, salt and pepper all over making sure you get it inside the beetroot. ", "Drizzle a little bit of the reduced sherry all over the beetroots and finish with a few slices of the picked thyme and rosemary. ", "Pull the sides of the foil and baking paper up then add a splash of water to each beetroot. This will help steam them during cooking. ", "Now wrap them up, bringing the baking paper and foil together to seal the parcel.", "Bake in the oven for one hour.", "Take the beetroots out the oven and keep warm. Don’t open until you are ready to serve.", "For the salsa verde, heat a large, deep saucepan of water until boiling. Have a bowl of iced water ready to cool the herbs down. ", "Add all the fresh herbs to the pan of boiling water and make sure they are completely submerged for 10 seconds. ", "Take the herbs out, shaking them off then plunge them into the iced water.  ", "Fry the shallot and garlic in a pan with a little oil for three minutes with a pinch of salt. ", "When the shallot is soft, add the mustard and anchovies. Mix well, take off the heat to cool and add 200ml/7fl oz of the olive oil.", "Drain the herbs and stir them into the shallot mixture. Add the capers. Place the mixture in a food processor and start to blend, gradually adding the remaining 100ml/4fl oz of olive oil. Don’t blend for too long – leave the mixture with some texture.", "Season to taste with salt and sherry vinegar. ", "Keep the salsa verde at room temperature in a bowl covered with cling film.  ", "For the ewes’ milk curd, season the curd with the lemon juice and cracked black pepper to taste. Add a little salt, to taste, depending on how salty the curd is already. Set aside.", "For the pastilla, pick the meat from the soft confit lamb into a bowl removing any big lumps of fat or gristle (but don’t take all the fat away as this is great for flavour). ", "Add the chopped mint, reduced lamb sauce, seasoning and sherry vinegar to taste. ", "Add a little of the salsa verde, just to coat, without getting the mixture too wet. Set aside.", "Heat the clarified butter in a pan until warm, but not hot. Place the potato on a mandoline and wind round to make potato string. ", "Place the potato string into the clarified butter making sure the butter coats all the potato. ", "Lay out two sheets of filo pastry about 20cm/8in wide and 20cm/8in long on top of each other. Divide the meat mixture into four portions and roughly shape each portion in your hand like a sausage. ", "Place a sausage shape of the mixture on the filo and roll up like a spring roll, folding the sides over and brushing with the clarified butter to help it stick. ", "Finally wind the string potato around the filo parcel. Repeat with the remaining filo and mixture and place on a tray to leave to set in the fridge for 30 minutes.", "Heat a deep fat fryer to 180C/350F. (CAUTION: Hot oil can be dangerous. Don't leave unattended).", "Add the pastillas to the deep fat fryer and fry until golden-brown and crisp, about three minutes.", "Remove with a slotted spoon and drain on kitchen paper. Lightly season with salt and cumin and carve how you wish.", "To serve, place the warm beetroots in the foil package on each of four plates and open up the top of the foil and baking paper. ", "Place a dollop of the ewes' curd on top of the beetroot. Finish with a little olive oil and fresh pea shoots.", "Place a spoonful of the salsa verde on the plate. ", "Place the pastille on the plate, drizzle with a little more olive oil and serve."]}, {"isVegetarian": false, "title": "Lamb shoulder with purple sprouting broccoli", "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_with_40153", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.5kg/3lb 5oz lamb shoulder, boned by the butcher, not rolled and tied", "2 tbsp extra virgin olive oil", "6 garlic cloves, peeled ", "8 anchovy fillets in oil ", "4 sprigs fresh rosemary", "50g/1¾oz pitted black olives, preferably Taggiasche", "250ml/9fl oz white wine", "500g/1lb 2oz purple sprouting broccoli, tough stems removed ", "2 tbsp good-quality extra virgin olive oil", "salt and pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the shoulder of lamb, preheat the oven to 180C/350F/Gas 4.", "Trim any excess fat from the lamb shoulder. Heat a flameproof casserole and add the oil. Add the lamb shoulder and fry over a high heat to brown it on all sides. Take it out of the pan and pour off any excess fat.", "Add the garlic cloves, anchovies, rosemary, olives and white wine to the casserole and set the shoulder on top. Cover tightly with a lid or foil and place in the oven to cook for 1–1½ hours, or until the meat is very tender. ", "Occasionally baste the meat with the juices. Remove the lid and cook the lamb uncovered for the last 10 minutes, to reduce the cooking juices by about half.  ", "For the purple sprouting broccoli, towards the end of the lamb cooking time, cook the broccoli in a pan of boiling salted water until tender. Drain and dress with olive oil. Season with salt and pepper, to taste. ", "Serve the shoulder of lamb in slices with its cooking juices and the broccoli. "]}, {"isVegetarian": false, "title": "Lamb shoulder with harissa and lamb stovies", "url": "www_bbc_co_uk_food_recipes_lamb_shoulder_with_90539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp caraway seeds", "3 tsp coriander seeds", "6 tsp cumin seeds", "1-2 tbsp honey", "1 lemon, juice only", "200g/7oz harissa paste", "1 shoulder of lamb (about 2.5kg/5lb 8oz) ", "3 tbsp rapeseed oil", "1 whole head of garlic, cut in half", "3 onions, cut in half", "few sprigs rosemary", "few sprigs thyme", "salt and freshly ground black pepper", "250g/9oz unsalted butter", "600g/1lb 5oz onion, finely chopped (about 4-6 onions)", "50g/1¾oz garlic purée", "6 bay leaves", "100g/3½oz sprigs thyme", "1kg/2lb 4oz lamb belly (also known as breast), skinned and cut into 2cm/1in dice", "2kg/4lb 8oz floury potatoes, peeled and cut into 0.5cm/¼in dice", "300ml/10fl oz strong lamb stock", "20g/¾oz chopped curlyleaf parsley", "10g picked tarragon leaves", "20g/¾oz finely chopped chives", "salt and white pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/180C Fan/Gas 6.", "For the spice paste, toast all the spices in a hot dry pan for a few minutes until aromatic. Grind them to a fine powder in a spice grinder or pestle and mortar. Mix the ground spices, honey and lemon juice with the harrisa paste and transfer to a piping bag.", "Prepare the lamb by making deep slashes into the flesh as many or as little as you like depending on the amount of heat you want from the harrissa, as we will be filling these with the paste.", "Smear oil over the meat and season with salt and pepper. Put the head of garlic, onions, rosemary and thyme in the bottom of a large, deep oven dish. Place the lamb on top and pipe the spice paste into the slashes. Cover with tin foil and seal the edges.", "Roast in the oven for 15 minutes then reduce the temperature to 160C/140C Fan/Gas 3 and leave it to roast for 4 hours. Do not open to check the meat during cooking. Remove from the oven, cover with aluminium foil and leave to rest for 20 minutes before serving.", "For the stovies, take a heavy-based, lidded pan that is large enough to fit all the ingredient. Heat the butter in the pan and fry the onions to soften them without colouring. Add the garlic purée and fry until the onions are translucent", "Tie the bay leaves and thyme sprigs together with kitchen string. Add them to the pan.", "Add the diced lamb and the potatoes and season with salt and white pepper. Cover with the lid and cook on a low to medium heat until the meat starts to give off its juices. This will take 1-2 hours.", "Stir in the stock and bring to the boil, then simmer with the lid on until the potatoes are breaking down into the liquid and are cooked through.", "Take off the heat, stir in the chopped herbs and season, to taste, with salt and pepper. To serve, place the shoulder on a serving board with a bowl of the stovies on the side."]}, {"isVegetarian": false, "title": "Lamb skewers with Turkish salad", "url": "www_bbc_co_uk_food_recipes_lamb_skewers_with_26099", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_skewers_with_26099_16x9.jpg", "ingredients": ["740g/1lb 10oz lamb fillet, trimmed and cubed", "1 tsp olive oil", "1 tsp dried oregano", "1 lemon, finely grated rind only", "½ tsp ground paprika", "4 wholemeal pitta breads", "salt and freshly ground black pepper", "1 small cucumber, deseeded and chopped", "4 firm, ripe tomatoes, deseeded and chopped", "1 green pepper, cored, deseeded and chopped", "1 small red onion, chopped", "1 small bunch of mint, finely chopped", "1 tbsp extra virgin rapeseed or olive oil", "100g/3½oz reduced-fat feta cheese, diced", "2 tbsp chopped parsley", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Rub the lamb with the olive oil, dried oregano, lemon rind, paprika, some salt and freshly ground black pepper. Thread on to 4 long or 8 short metal skewers and leave to marinate for at least 10 minutes. Preheat the grill to a hot setting. ", "For the salad, mix together the cucumber, tomatoes, pepper, onion, mint and oil in a large serving bowl and sprinkle over the feta and parsley. Stir in the lemon juice and season well with salt and freshly ground black pepper. Set aside.", "Cook the lamb skewers under the grill for 5-10 minutes, or until cooked to the pinkness desired, turning occasionally. Remove from the grill and leave to rest for 2-3 minutes.", "Meanwhile, wrap the pitta breads in foil and place in the oven for 5-8 minutes or until warm. ", "Arrange the lamb skewers on the pitta breads with the Turkish salad and serve. "]}, {"isVegetarian": false, "title": "Lamb steak with minty broad beans", "url": "www_bbc_co_uk_food_recipes_lamb_steak_with_minty_38336", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_steak_with_minty_38336_16x9.jpg", "ingredients": ["4 lamb steaks (roughly 150g/5½oz each)", "2 tsp olive oil", "1 tbsp red wine vinegar", "2 tsp roughly chopped fresh mint", "½ tsp pomegranate molasses", "1 tsp ground cumin", "500g/1lb 2oz fresh broad bean pods", "2 tsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "½ lemon, zest and juice", "1 tsp ground cumin", "pinch cinnamon", "1 tsp roughly chopped fresh oregano (or thyme)", "200ml/7fl oz chicken stock", "150g/5½oz small tomatoes, halved", "1 tsp pomegranate molasses", "1 tbsp roughly chopped flatleaf parsley, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lamb steaks in a large bowl. Add the remaining lamb ingredients and rub into the meat. Cover and leave to marinate for 10 minutes.", "Meanwhile, place the brad beans in a large bowl and over with boiling water. Set aside the water is cool enough to handle. Drain the beans and slip of their outer skins.", "Heat the olive oil in a saucepan placed over a medium heat. Add the onion and cook until soft. Add the garlic, lemon zest, spices,oregano, beans and stock. Cook for 5 minutes and check the seasoning. Stir in the tomatoes, lemon juice and pomegranate molasses. ", "Heat a barbecue or grill to a high temperature and cook the lamb for 2–3 minutes on each side or until cooked through. Allow to rest 2–3 minutes.", "Divide the beans between four plate and top with the lamb steaks. Sprinkle with fresh parsley and serve."]}, {"isVegetarian": false, "title": "Lamb slice with garlic mayonnaise", "url": "www_bbc_co_uk_food_recipes_lamb_slice_with_garlic_01679", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_slice_with_garlic_01679_16x9.jpg", "ingredients": ["2 free-range egg yolks", "salt and freshly ground white pepper", "175ml/6fl oz extra virgin olive oil", "175ml/6fl oz sunflower oil", "lemon juice, to taste", "2 garlic cloves, crushed to a paste", "4 slices cold, leftover cooked lamb breast (see Top recipe tip)", "salt and freshly ground black pepper", "plain flour, for dredging", "1 free-range egg, beaten", "breadcrumbs, for coating", "1 tbsp oil", "watercress, for serving"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the garlic mayonnaise, place the egg yolks into a bowl with the salt and freshly ground white pepper. Gradually whisk together while very gradually trickling in the sunflower oil, followed by the olive oil. Once the mixture is becoming very thick, add a little lemon juice. ", "Continue beating, adding the oil a little faster and speeding up the beating speed. Add more lemon juice, salt and freshly ground black pepper to taste. Set aside in the fridge.", "Season the lamb with salt and freshly ground black pepper.  Place the flour, beaten egg and dry breadcrumbs into three shallow bowls. Dredge the lamb slices in the flour, then dip into the beaten egg and roll in the breadcrumbs.", "Heat the oil in a heavy-based frying pan and fry the lamb slices until golden-brown. Carefully turn over the lamb and cook on the other side. Remove the lamb from the pan and drain on kitchen paper.", "Stir the crushed garlic into the mayonnaise. Place the slices onto warmed plates and serve the garlic mayonnaise in a bowl on the side. Squeeze some lemon juice over the meat if liked."]}, {"isVegetarian": false, "title": "Lamb stew with black pepper, coconut and clove", "url": "www_bbc_co_uk_food_recipes_lamb_stew_with_black_83254", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_stew_with_black_83254_16x9.jpg", "ingredients": ["1kg/2lb 4oz boneless lamb shoulder or mutton haunch, well cleaned of all skin, sinew, fat, gristle and cut into 1cm/½in cubes", "4 x 2.5cm/1in pieces cinnamon stick, discard tiny pieces that break off", "10 cloves", "1 tsp black peppercorns, or more to taste", "2 tbsp rapeseed oil or vegetable oil", "2 red onions, cut into quarters and sliced", "1½ tbsp plain flour", "1 x 400ml/14fl oz tin coconut milk", "salt", "3 large potatoes, peeled, cut into large cubes and boiled until soft"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the prepared lamb or mutton into a casserole dish that has a tight-fitting lid. Add the cinnamon, cloves and peppercorns, and enough cold water to just cover the meat. Cover the pan tightly (line the edge of the lid in aluminium foil to increase the tightness if necessary). Bring to the boil, then reduce the heat to low and simmer for 30 minutes. ", "Partly uncover the pan, allowing steam to escape and the liquid to reduce, and continue to simmer on the lowest heat for a further hour. ", "In a separate pan, heat the oil and cook the onions gently until soft, giving them a good seasoning of salt. Add the flour to the onions and stir for 3–4 minutes, or until the flour is absorbed into the oil and is cooked. ", "Add the onion mixture to the meat pan and mix well. Bring to the boil, then reduce the heat to low and simmer for 10–15 minutes, stirring, until well combined and thickened. Add the coconut milk and simmer for a further 30 minutes, stirring frequently. Check the texture of the lamb or mutton: it will go from being quite hard to very tender quite suddenly; this is the point at which the stew is ready.  ", "When the meat is tender add the cooked potatoes, and simmer for a minute until the potatoes are warmed through. Taste and adjust the seasoning if necessary. Serve with crusty bread and some vegetables."]}, {"isVegetarian": false, "title": "Lamb stew with port, porcini and herby dumplings", "url": "www_bbc_co_uk_food_recipes_lamb_stew_with_port_00129", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp vegetable oil", "75g/2¾oz unsalted butter", "900g/2lb lamb neck, cut into 2cm/¾in cubes", "200g/7oz bacon lardons (preferably oak smoked)", "1 bunch spring onions, chopped (white and green part)", "2 garlic cloves, chopped", "5 fresh sage leaves, chopped", "500g/1lb 2oz shop-prepared butternut squash and sweet potato mix", "25g/1oz sun-dried tomatoes, chopped", "4 tbsp plain flour", "50g/1¾oz dried porcini mushrooms, chopped", "2 tbsp plum or cherry jam", "1 bay leaf", "few shakes of Worcestershire sauce", "250ml/9fl oz port", "500ml/18fl oz beef stock", "1 tbsp English mustard powder", "4 tbsp freshly chopped flatleaf parsley, to serve", "salt and black pepper", "150g/5½oz self-raising flour", "75g/2¾oz shredded beef or vegetable suet", "small handful fresh thyme leaves", "1 medium free-range egg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Heat a lidded casserole dish and add the oil and butter. Once melted, add the lamb in batches and fry until browned all over. Remove from the pan and set aside. ", "Add the bacon lardons to the pan and cook for 1-2 minutes or until crisp. Add the spring onions, garlic and sage and cook for a further 2-3 minutes. Add the butternut squash and sweet potato mix and stir. Add the sun-dried tomatoes, flour, mushrooms, jam and bay leaf and cook for a further 1-2 minutes. ", "Return the sealed lamb to the pan along with the Worcestershire sauce and port. Cook until the port has reduced by half. Add the stock, mustard powder and season with salt and pepper stir. Cover with the lid and transfer to the oven for 20 minutes.", "For the dumplings, place the flour, suet and thyme leaves into a large glass bowl and mix to combine. Add the egg and 50ml/2fl oz water, mix and bring to a dough. Roll the mixture into 12 evenly-sized dumplings.", "Remove the stew from the oven and stir in most of the parsley.", "Place the dumplings on top of the stew and place back in the oven with the lid on for 10 minutes. Remove the lid and cook for a further 15-20 minutes, or until the dumplings are golden-brown.", "To serve, spoon some of the stew and dumplings into shallow serving bowls and garnish with the remaining parsley."]}, {"isVegetarian": false, "title": "Lamb tagine", "url": "www_bbc_co_uk_food_recipes_lamb_tagine_13748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "1kg/2lb 4oz lamb shoulder, diced ", "2 onions, cut into thick semicircles ", "6–8 garlic cloves, peeled and left whole", "2 small aubergines, diced", "pinch saffron", "2 tsp coriander seeds, crushed", "2 tsp cumin seeds, crushed", "few cardamom pods", "few black peppercorns", "pinch turmeric", "300ml/10fl oz dry white wine", "1 tbsp tomato purée", "1 x 400g tin chopped tomatoes", "1 x 400g tin chickpeas, drained", "large handful dried apricots, cut in half", "500ml/18fl oz lamb or chicken stock", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh coriander ", "250g/9oz couscous", "pinch of saffron", "300ml/10fl oz hot chicken stock", "100g/3½oz flaked almonds, toasted", "100g/3½oz raisins, soaked in water", "4 tbsp olive oil", "4 tbsp mixed chopped herbs, such as mint, coriander and parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb tagine, in a large ovenproof, lidded pan or casserole heat the olive oil. Season the lamb with salt and pepper. Once the oil is hot, brown the lamb on all sides for about 10 minutes. Add the onions and garlic. Cook for a few minutes to soften, then stir in the aubergines and spices and cook for a further 2 minutes.", "Pour in the white wine and simmer until the volume of liquid is reduced in volume by half. Stir in the tomato purée, tinned tomatoes and chickpeas and cook for a few minutes to reduce further. ", "Add the apricots and stock. Cover the pan with a lid and cook gently for 1½–2 hours, or until the meat is very tender. ", "Just before serving, remove the lid off and reduce the sauce a little until thickened, if necessary.", "Meanwhile, put the couscous in a large heatproof bowl. Mix the saffron into the hot stock then pour it over the couscous. Cover with cling film and leave for 5 minutes.", "Once the stock has been soaked up, mix in the flaked almonds, raisins, olive oil and chopped herbs.", "Serve the lamb tagine in bowls with the couscous alongside. Garnish with the chopped mint and coriander."]}, {"isVegetarian": false, "title": "Lamb vindaloo", "url": "www_bbc_co_uk_food_recipes_lamb_vindaloo_41903", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_vindaloo_41903_16x9.jpg", "ingredients": ["1.3 kg/3lb boneless lamb shoulder, cut into roughly 4cm/1¾in chunks", "100ml/3½fl oz red wine vinegar", "2 tbsp sunflower oil", "2 tsp sea salt flakes", "500g/1lb 2oz potatoes, peeled and cut into roughly 2.5cm/1in pieces", "125ml/4½fl oz sunflower oil", "4 onions, 3 finely sliced and 1 chopped", "6 garlic cloves, roughly chopped", "3 long red chillies (do not deseed), roughly chopped", "25g/1oz fresh root ginger, peeled, roughly chopped", "1 tbsp English mustard powder", "1 tbsp ground cumin", "1 tbsp ground coriander", "1 tbsp ground paprika", "2 tsp ground turmeric", "2 tsp cayenne pepper", "1 tsp ground cinnamon", "2 tsp sea salt flakes", "2 bay leaves"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Trim the lamb, discarding any really hard lumps of fat and sinew. Mix the vinegar, vegetable oil and salt in bowl until well combined. Add the lamb and turn to coat in the marinade. Cover and chill in the fridge for two hours.", "Preheat the oven to 180C/350F/Gas 4.", "For the sauce, heat three tablespoons of the sunflower oil in a large heavy-based frying pan and cook the sliced onions very gently over a medium-low heat for 15 minutes until softened and lightly browned, stirring occasionally.", "While the sliced onions are cooking, put the remaining chopped onion, garlic, chillies, ginger, mustard powder, cumin, coriander, paprika, tumeric, cayenne pepper and cinnamon in a food processor and blend to a purée. ", "Stir the purée into the fried onions. Add two tablespoons of oil and cook together for five minutes, or until thickened and beginning to colour. Remove the mixture from the pan and place into a casserole dish.", "Drain the lamb in a colander and reserve the marinade. Return the frying pan to the heat and add two tablespoons of the remaining oil. Fry the lamb in four or five batches over a medium-high heat, turning occasionally until lightly browned. Add a little extra oil if necessary. Add the lamb to the casserole.", "Pour the reserved marinade and 500ml/17fl oz water into the casserole dish. Add the salt and bay leaves and bring to a simmer. Cover the surface of the curry with a piece of greaseproof paper, then cover with a lid. Cook in the oven for 45 minutes. ", "Remove the casserole from the oven and stir the potato chunks into the curry, re-cover with the greaseproof paper and the lid and continue to cook for a further hour or until the lamb and potatoes are very tender. Season, to taste, with salt.", "Serve with spoonfuls of yogurt, chopped coriander and rice or wamed naan bread."]}, {"isVegetarian": false, "title": "Lamb three ways", "url": "www_bbc_co_uk_food_recipes_lamb_three_ways_54983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.5kg/3lb 5oz lamb shoulder, boned and tied", "salt and freshly ground black pepper", "dash vegetable oil", "1 onion, chopped", "2 carrots, peeled and chopped", "few sprigs thyme", "4 garlic cloves", "1 bottle red wine", "500ml/18fl oz lamb stock", "1 onion, finely chopped", "olive oil, for frying", "1.5kg/3lb 5oz lamb trimmings (shoulder and leg)", "1 bottle red wine", "1.2 litres/2 pints lamb stock", "1 small bunch fresh parsley", "plain flour, for dusting", "2 free-range eggs", "100g/3½oz Japanese panko breadcrumbs", "vegetable oil, for deep-fat frying", "2 racks of lamb (5 bones in each rack), French-trimmed", "dash vegetable oil", "4 raw beetroot", "salt and freshly ground black pepper", "dash vegetable oil", "butter, for frying", "handful of chard/beetroot leaves, blanched", "1.5kg/3lb 5 oz potatoes, peeled and sliced thinly on a mandoline", "salt and freshly ground black pepper", "2 tbsp thyme leaves", "6 garlic cloves, crushed", "1.8 litres/3 pints double cream", "cooking liquid leftover from the shoulder of lamb and bon bons", "1 tsp cornflour (if needed to thicken the jus)", "1 small onion or 2 shallots, roughly chopped", "small bunch fresh mint, chopped", "small bunch fresh coriander, chopped", "small bunch fresh flatleaf parsley, chopped", "1 lemon, zest and juice", "2 garlic cloves, chopped", "olive oil", "salt and freshly ground black pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the slow-cooked lamb shoulder, preheat the oven to 160C/325F/Gas 3.", "Season the lamb shoulder with salt and freshly ground black pepper, to taste.", "Heat a dash of vegetable oil in a hot pan and cook the lamb until coloured on all sides. ", "Transfer to a roasting tray and add the onion, carrots, thyme and garlic. ", "Cover with the red wine and stock and cover tightly with aluminium foil. ", "Cook in the oven for three hours, or until tender. Reserve any cooking juices for the jus.", "For the lamb bon bon, fry the onion in a pan with oil until softened. Add the lamb trimmings and allow to colour. ", "Pour in the wine and stock and leave to braise over a low heat for 2½-3 hours, or until tender. In a food processor, blend the braised trimmings with the parsley. Drain off the juice (retaining it) and, using your hands, form into balls.  Set aside.", "For the lamb cutlet, preheat the oven to 180C/350F/Gas 4 and season the lamb with salt and pepper.", "Heat a dash of oil in a large pan and fry the lamb until browned. Transfer to the oven and cook for 10-12 minutes, or until medium-rare (you may wish to cook the lamb longer if medium-rare isn’t to your liking). Remove from the oven and leave to rest before carving. ", "For the beetroot and chard, boil the beetroot in a pan of salted water until softened. Drain well and leave to cool.", "Once cooled, peel and then cut into quarters. ", "To serve, fry the beetroot quickly in a touch of oil with salt and pepper. For the leaves, melt the butter in a pan and wilt the leaves for 1-2 minutes. ", "For the potato gratin, preheat the oven to 180C/350F/Gas 4. Layer the potato slices in a gratin dish, seasoning with salt and pepper between each layer.", "Add the thyme leaves and crushed garlic alternatively between the layers. Pour over the double cream and leave to sit for 10 minutes. ", "Cook for 50 minutes to one hour, or until golden-brown. Cut into squares to serve. ", "For the jus, strain the liquid leftover from the slow-cooked shoulder. Boil the liquid in a saucepan until the volume of liquid has reduced by half. Add any reserved cooking liquor from making the bon bon and reduce again. Thicken the jus if necessary with a little cornflour mixed to a paste with cold water.", "To finish the lamb bon bon, prepare a plate of flour, a bowl of lightly beaten egg and a plate of Japanese panko breadcrumbs. ", "Heat the oil in a deep fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Dust the bon bons in flour, dip in the beaten egg and coat in the breadcrumbs. Fry in the deep-fat fryer until cooked through, then carefully remove with a slotted spoon and place on a plate lined with kitchen paper.", "For the mint salsa, blend the onions (or shallots), mint, coriander, parsley, lemon zest, lemon juice and garlic until smooth in a food processor.", "Gradually add enough oil to make a smooth, dropping consistency. Season to taste.", "To serve, arrange the potato gratin on each of four serving dishes. Put the lamb shoulder pieces alongside. Spoon the beetroot quarters and wilted leaves next to the lamb shoulder and sit the lamb cutlet on top. Arrange the lamb bon bons alongside and spoon the mint salsa next to meat. Drizzle with the jus to serve. "]}, {"isVegetarian": false, "title": "Lamb with cockles", "url": "www_bbc_co_uk_food_recipes_lamb_with_cockles_52690", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz cockles", "300ml/10fl oz medium-sweet cider", "3 lamb neck fillets", "1 tsp thyme, finely chopped", "sea salt and freshly ground black pepper", "generous knob of butter", "1 large onion, halved and finely sliced", "100g/3½oz bacon lardons", "1 tbsp cider vinegar", "1 tbsp chopped fresh parsley", "1 tbsp celery leaves, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Place the cockles in a colander and rinse under a cold running tap, shaking to wash off any grit or to break open any glued together with silt.", "Put the cockles and cider into a medium-sized heavy pan. Cover with the lid and steam for 2-3 minutes until the cockles have opened. Strain the cockles, discarding any that remain closed, then strain the liquor again through a fine sieve to remove as much grit as possible.", "Season the lamb with the thyme, sea salt and freshly ground black pepper. In a very hot ovenproof pan, melt the butter and quickly brown the lamb all over then remove the meat from the pan and set it aside.", "Tip the onion and lardons into the same pan and cook over a moderate heat until the onions are translucent. Pour in the cider vinegar to deglaze the pan then return the meat to the pan and pour in the cockle liquor. Cover the pan with a lid, transfer it to the oven and cook for 45 minutes to one hour.", "Meanwhile, pick three-quarters of the cockles from their shells, leaving the remainder in their shells. Add all the cockles to the lamb, warm through then season with sea salt and freshly ground black pepper and stir in the parsley and celery leaves.", "Slice the lamb onto warmed plates, ladle over the cockles and liquor and serve with boiled potatoes and Savoy cabbage."]}, {"isVegetarian": false, "title": "Lamb with fresh peas (Agnello con piselli freschi)", "url": "www_bbc_co_uk_food_recipes_lamb_with_fresh_peas_03722", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_fresh_peas_03722_16x9.jpg", "ingredients": ["1 kg/2lb 2oz boned lamb shoulder, cut into large chunks", "salt and freshly ground black pepper", "150ml/5fl oz extra virgin olive oil", "2 onions, sliced", "1 large carrot, sliced", "1 celery stalk, sliced", "5 garlic cloves, crushed", "20g/¾oz anchovy fillets", "handful fresh thyme sprigs", "1 red chilli, sliced", "250ml/9fl oz white wine", "25ml/1fl oz white wine vinegar", "250g/9oz fresh or frozen peas", "400g/14oz potatoes, skin on, cut into quarters", "200g/7oz cherry tomatoes, halved", "1-2 loaves crusty bread, sliced and toasted"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the lamb chunks with salt and freshly ground black pepper and set aside.", "Heat the olive oil in a large saucepan and fry the onions, carrot and celery for 4-5 minutes or until softened.", "Add the garlic, anchovies, thyme and chilli and continue to cook, stirring, until the anchovies have almost dissolved into the oil.", "Add the lamb to the pan and fry until browned all over.", "Stir in the wine and continue to cook until the volume of the liquid has reduced by half, then add the vinegar. Reduce the heat , cover and simmer gently for a further 20 minutes.", "Add the peas, potatoes and tomatoes, cover again and continue to cook for about an hour or until the sauce has reduced by half.", "Remove from the heat and serve with lots of good toasted bread."]}, {"isVegetarian": false, "title": "Mulled lamb", "url": "www_bbc_co_uk_food_recipes_lamb_with_port_and_85617", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_port_and_85617_16x9.jpg", "ingredients": ["1 tsp cardamom pods, seeds only", "1 tsp cumin seed", "1 tsp ground cinnamon", "3 tbsp groundnut oil, plus extra for frying", "600g/1lb 7oz lamb neck fillet, cut into large chunks", "12 baby shallots", "1 tbsp plain flour", "300ml/10½fl oz port", "800ml/1½pt lamb stock or beef stock", "300g/10½oz prunes", "1 cinnamon stick", "salt and freshly ground black pepper", "1 pomegranate, seeds only", "6-10 mint leaves "], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a mortar and pestle, grind together the caradmom seed and the cumin seed to a powder, then stir in the ground cinnamon.", "Mix in the spices with the groundnut oil and rub the spice paste all over the chunks of lamb.", "In a large casserole, fry the lamb in a little more oil until browned all over and then set aside (you may need to do this in batches).", "In the same pan, fry the shallots for five minutes until golden-brown and then return the lamb to the pan.", "Add the flour and cook through for a minute.", "Pour in the port and the stock. Add the prunes and cinnamon stick and season well with salt and freshly ground black pepper.", "Put a lid on the casserole and bake for an hour.", "Serve with a scattering of pomegranate seeds and some torn mint leaves."]}, {"isVegetarian": false, "title": "Lamb with torn bread and apricot stuffing and caramelised chicory", "url": "www_bbc_co_uk_food_recipes_lamb_with_torn_bread_and_53988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz unsalted butter", "1 onion, chopped", "1 garlic clove, crushed", "2 tsp cumin seeds", "200g/7oz sourdough bread, torn into bite-sized pieces ", "2 tsp dried chilli flakes", "150g/5oz dried apricots, roughly chopped", "50g/2oz shelled pistachio nuts, roughly chopped", "sea salt and freshly ground black pepper", "1 tbsp olive oil, for brushing", "2kg/4lb 8oz lamb leg, bone in ", "4 chicory heads, halved lengthways", "3 red onions, cut into wedges", "3 tbsp soft brown sugar", "½ tbsp dried chilli flakes", "2 tbsp olive oil", "2 tbsp cider vinegar", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, heat the butter in a large frying pan over a medium heat. ", "Add the onion and cook, stirring occasionally, for 6-8 minutes, or until softened. ", "Add the crushed garlic and half of the cumin seeds and cook for another minute. ", "Tip the mixture into a large bowl and add the torn bread, chilli flakes, dried apricots and pistachio nuts and season well with sea salt and freshly ground black pepper. Set aside until needed.", "Preheat the oven to 190C/375F/Gas 5. ", "Mix the olive oil with the remaining cumin seeds and brush this mixture over the entire surface of the lamb. ", "Place the lamb in a large roasting tin and cook for 1 hour 20 minutes in total. However, 15 minutes before the end of cooking, place the stuffing mixture into the pan around the lamb and return it to the oven. ", "Meanwhile, for the caramelised chicory, place the chicory and onions in a baking dish and sprinkle with the sugar and chilli flakes. ", "Drizzle with the oil and vinegar and season to taste with sea salt and freshly ground black pepper. Place in the oven and cook for 35-45 minutes, or until golden-brown and caramelised. ", "Once the lamb is cooked, cover loosely with foil and leave to rest for 15 minutes before carving. ", "Serve the lamb in slices with the caramelised chicory and stuffing alongside.."]}, {"isVegetarian": false, "title": "Lamb with hummus and tortillas", "url": "www_bbc_co_uk_food_recipes_lamb_with_hummus_and_07348", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_with_hummus_and_07348_16x9.jpg", "ingredients": ["500g/1lb 2oz lamb fillet, cut into 15mm/½in slices", "1 lemon, grated rind and juice", "1 sprig of rosemary, chopped", "3 mixed peppers, cored, deseeded and chopped", "1 small aubergine, sliced", "4 flour wholemeal tortillas", "400g/14oz tin chickpeas, rinsed and drained", "2 tbsp Greek yoghurt", "2 tbsp lemon juice", "1 tbsp chopped parsley", "100g/3½oz rocket"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the lamb, lemon rind and juice, rosemary and peppers in a non-metallic bowl and stir well. Cover and leave to marinate in a cool place for 30 minutes.", "Meanwhile, put the hummus ingredients in a food processor or blender and blitz for 30 seconds. Place in a bowl.", "Heat a griddle or heavy-based frying pan, add the lamb mixture and the aubergine and fry for 3—4 minutes, or until the lamb is cooked through (You may need to do this in batches.).", "Heat the tortillas. Wrap the lamb and vegetables in the tortillas with the hummus and serve rocket."]}, {"isVegetarian": false, "title": "Lamb and barley hot pot", "url": "www_bbc_co_uk_food_recipes_lambandbarleyhotpot_91976", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 lamb shanks", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 onions, peeled, roughly chopped", "3 carrots, peeled, roughly chopped", "½ swede or turnip, peeled and cut into small chunks", "4 cloves garlic, peeled, roughly chopped", "2 tbsp finely chopped fresh rosemary", "2 bay leaves", "2 sprigs fresh thyme, finely chopped", "2 tbsp tomato purée", "250g/9oz pearl barley", "1½ litres/3 pints chicken stock", "2-3 tbsp mint jelly", "3 tbsp roughly chopped fresh flatleaf parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Season the lamb shanks with salt and freshly ground black pepper. Heat a large ovenproof casserole until smoking, add the oil and lamb shanks and cook for 2-3 minutes on each side, or until golden-brown all over.", "Remove the lamb from the pan and set aside. Add the onions, carrots, swede and garlic to the pan and cook for 2-3 minutes, or until golden-brown.", "Add the rosemary, bay leaves, thyme and tomato purée to the pan and cook for a further minute, then stir in the pearl barley. Cover with the chicken stock and bring to a simmer. ", "Cover the pan with a tight-fitting lid, then transfer to the oven to cook for at least three hours, or preferably 5-6 hours, until the lamb is very tender. (You may need to add a bit more liquid.)", "Remove the pan from the oven and stir in the mint jelly and parsley. Season, to taste, with salt and freshly ground black pepper and serve."]}, {"isVegetarian": false, "title": "Lamb and leek kebabs with cauliflower purée", "url": "www_bbc_co_uk_food_recipes_lambandleekkebabswit_84163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz leg of lamb, cut into large cubes", "1 leek, chopped into 1cm/½in wheels", "1 tbsp olive oil", "2 garlic cloves, finely chopped", "2 tbsp honey", "salt and freshly ground black pepper", "1 tbsp olive oil", "¼ cauliflower, blanched", "½ potato peeled, chopped and blanched", "1 tsp chopped fresh mint", "1 tsp chopped fresh parsley", "salt and freshly ground black pepper", "100ml/3½fl oz red wine", "2 tbsp honey", "1 tsp chopped fresh mint", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the two wooden skewers in water for 10 minutes. ", "To make the kebabs, place the lamb, leek, olive oil, garlic and honey into a large bowl and mix together. Season with salt and freshly ground black pepper. ", "Thread the leek and lamb alternately onto a skewer.", "Heat a griddle pan until smoking. Add the kebab and cook for two minutes on side, or until the lamb is cooked through.", "To make the purée, place the olive oil, cauliflower, potato, mint and parsley all into a food processor, season, to taste, with salt and freshly ground black pepper and blend until smooth.", "In a frying pan boil the wine, honey and mint and pan and reduce until thickened.", "To serve, place the kebab on a plate with the purée alongside and pour over the wine sauce."]}, {"isVegetarian": false, "title": "Lamb and fenugreek dumpling stew", "url": "www_bbc_co_uk_food_recipes_lambandfenugreekdump_90002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lambandfenugreekdump_90002_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "600g/1lb 5oz lamb, cleaned and cut into small pieces, fat trimmed", "1 tsp mustard seeds", "1 large onion, finely chopped", "5 large garlic cloves, peeled", "4cm/1½in piece root ginger, peeled", "salt, to taste", "1 tsp sugar", "1 tbsp ground coriander ", "1 tbsp ground cumin", "½ tsp ground turmeric", "¼-½ tsp red chilli powder, to taste", "3 tomatoes, blended to a purée in a food processor", "300ml/½ pint water", "400ml/14fl oz coconut milk", "1-2 tsp lemon juice, to taste", "1 small sweet potato, peeled and cut into chunks", "250g/8oz canned chickpeas, drained and rinsed", "100g/3½oz chapati flour (or wholemeal flour)", "45g/1½oz gram flour (chickpea flour)", "2 tbsp chopped dried fenugreek leaves, or 4 tbsp chopped fresh fenugreek leaves ", "1½ tsp freshly grated ginger", "¾ tsp salt", "¾ tsp sugar ", "pinch ground turmeric", "1 tbsp lemon juice", "2 tbsp vegetable oil", "1/3 tsp baking powder", "handful chopped fresh coriander", "1¼ tsp garam masala"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat the oil in a non-stick pan over a medium heat. Add the lamb and fry for 3-4 minutes, turning occasionally, until brown on all sides. Remove from the pan and set aside on a warm plate. ", "Add the mustard seeds to the same pan and fry for 30 seconds, or until the seeds start to pop. (CAUTION: keep the pan well away from your face and eyes.) Add the onion and fry for 3-4 minutes, or until golden-brown. ", "Meanwhile, in a food processor, blend the garlic and ginger to a paste, adding a splash of water to bind the mixture. ", "Add the garlic and ginger paste to the fried onions and continue to cook for 2-3 minutes, or until the water has evaporated from the paste and it has turned golden-brown. ", "Add the salt, sugar, ground coriander, ground cumin, ground turmeric and red chilli powder and cook for a further 20-30 seconds. ", "Add the puréed tomatoes and 100ml/3½fl oz of the water, stir well and bring the mixture to a gentle simmer. Simmer for 6-8 minutes, stirring well, or until the volume of liquid has completely reduced and the sauce has almost dried out.", "Meanwhile, for the fenugreek dumplings, mix all of the fenugreek dumplings ingredients together in a bowl until well combined, then bring the mixture together to form a semi-soft dough. ", "Using your hands, roll the mixture into three sausage shapes, then pinch off six pieces from each sausage. Roll the pieces into smooth balls. Set aside.", "When the sauce has reduced, add the coconut milk, lemon juice and the rest of the water. Continue to simmer for five minutes. Add the sweet potato to the stew and bring back to the boil. Reduce to a simmer and after six minutes, add the dumplings. Cover the pan with a lid and continue to simmer for 6-7 minutes, or until the potato is tender. ", "Add the reserved lamb and the chickpeas to the pan, cover again and cook for a further 4-5 minutes, or until the lamb is cooked to your liking. ", "Stir in the fresh coriander and garam masala just before serving."]}]