[{"ingredients": ["1 naranja, solo jugo", "2 cucharaditas de salsa de soja", "pizca de copos de chile seco", "1 cucharadita de semillas de sésamo", "1 filete de caballa, cortado por la mitad", "½ lima, solo jugo", "2 cucharadas de hojas de cilantro fresco picado", "puñado de cohete fresco", "1 naranja, cortada en cuñas, para servir"], "method": ["Coloque el jugo de naranja, la salsa de soja, los copos de chile y las semillas de sésamo en una sartén y cocine a fuego lento durante 3-4 minutos.", "Agregue la caballa y cocine durante dos minutos en cada lado, o hasta que esté bien cocida. Retire del fuego, exprima el jugo de lima y espolvoree con cilantro.", "Coloque las hojas del cohete en un recipiente, vierta sobre los jugos de la sartén de caballa y revuelva.", "Para servir, amontone la ensalada de cohetes en un plato de servir. Cubra con la caballa y adorne con gajos de naranja."], "url": "www_bbc_co_uk_food_recipes_orientalstylecitrusm_88381", "title": "Caballa de cítricos de estilo oriental con ensalada de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "2 cucharadas de aceite de sésamo", "1 lima, solo jugo", "1 pieza de jengibre fresco, pelado, rallado", "2 chiles rojos, finamente picados", "1 manojo de cilantro, hojas retiradas, más o menos picadas", "2 cucharadas de salsa de soja", "2 cucharadas de miel", "1 cucharada de salsa Worcestershire", "4 pechugas de pollo sin piel sin hueso, cortadas en tiras de 1cm / ½ pulgada", "sal marina y pimienta negra recién molida", "6 cebollas de primavera, cortadas en diagonal", "2 cucharadas de semillas de sésamo, tostadas", "2 aguacates maduros, desollados y picados", "2 limas, solo jugo", "1 diente de ajo, triturado hasta formar una pasta", "4 cucharadas de cilantro fresco, picado", "1 chile rojo, finamente picado", "1 chalote, finamente picado", "150ml / 5fl oz de aceite de oliva", "splash salsa Tabasco", "sal y pimienta negra recién molida"], "method": ["Para el adobo, coloque todos los ingredientes del adobo en un tazón y mezcle para combinar.", "Para el pollo, coloque el pollo en el tazón de adobo. Revuelva bien y déjelo marinar en la nevera, cubierto con film transparente durante al menos una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén hasta que esté caliente y luego agregue las tiras de pollo marinado. Cocine a fuego alto durante 1-2 minutos, volteándolas una vez para que se doren bien por ambos lados.", "Transfiera las tiras de pollo a una bandeja para hornear y colóquelas en el horno para cocinar por otros cinco minutos o hasta que estén completamente cocidas.", "Retire el pollo del horno y sazone con sal marina gruesa y pimienta negra recién molida. Espolvorear con las cebolletas y las semillas de sésamo tostadas.", "Para el guacamole, coloque los aguacates picados en un tazón y agregue el jugo de lima.", "Agregue los ingredientes restantes de guacamole, mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el pollo en seis platos con una cucharada de guacamole servido al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_orientalstylechicken_85425", "title": "Pollo de estilo oriental con guacamole", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, finamente rebanada", "Jengibre de raíz de 1 cm / ½ en pieza finamente picado", "1 diente de ajo, finamente picado", "100 g / 3½ oz de champiñones silvestres", "50g / 2oz de espinaca", "100g / 3½oz de fideos de udon listos para cocinar", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas, para adornar"], "method": ["Caliente el aceite en una sartén, agregue la cebolla, el jengibre y el ajo y saltee durante 1-2 minutos.", "Agregue los champiñones y las espinacas y saltee hasta que se ablanden. Agregue los fideos, condimente, al gusto, con sal y pimienta negra recién molida, y mezcle bien.", "Para servir, coloque los fideos salteados en un plato para servir y espolvoree cebollino."], "url": "www_bbc_co_uk_food_recipes_orientalstylenoodles_85589", "title": "Fideos estilo oriental salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de aceite de sésamo", "200ml / 7fl oz de caldo de verduras calientes", "1 cucharada de salsa de soja", "2 piezas de 50 g / 1½ oz de filete de salmón, peladas", "50g / 1¾oz de fideos de arroz", "1 cucharada de semillas de sésamo, para adornar", "1 cucharada de cebolletas frescas picadas, para adornar"], "method": ["Coloque el aceite de oliva y sésamo, el caldo y la salsa de soja en una cacerola y deje que hierva.", "Reduzca el fuego a fuego lento. Agregue las piezas de salmón a la sartén y cocine por 3-4 minutos, o hasta que estén casi cocidas.", "Agregue los fideos a la sartén y retírelos del fuego. Cúbralo con una tapa y déjelo durante unos minutos, hasta que los fideos se hayan suavizado.", "Para servir, vierta el caldo en un recipiente y espolvoree sobre las semillas de sésamo y el cebollín."], "url": "www_bbc_co_uk_food_recipes_orientalstylesalmona_85347", "title": "Caldo de salmón y fideos de estilo oriental", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de solomillo 100g / 3½", "½ chalote de plátano, cortado en cubitos", "100g / 3½ mangetout, en rodajas finas", "Tallarines de huevo cocidos 55 g / 2 oz", "1 cucharada de salsa de soja", "1 cucharada de aceite", "puñado de menta fresca", "puñado de albahaca fresca", "puñado de cilantro fresco", "2 cucharadas de azúcar en polvo", "salpicaduras de agua", "½ chile rojo, cortado en cubitos", "1 diente de ajo, aplastado", "1 cucharadita de aceite de sésamo", "2 cucharaditas de vinagre de vino blanco", "1 cucharada de cilantro fresco, picado"], "method": ["Calentar el aceite en una sartén. Agregue el bistec y cocine a su gusto. Retirar de la sartén y dejar reposar.", "Agregue la chalota a la sartén y cocine para ablandar durante dos minutos.", "Agregue el mangetout y saltee por un minuto más.", "Agregue la salsa de soja, el aceite de oliva y los tallarines para calentarlos.", "Revuelva a través de las hierbas frescas y colóquelas en un plato caliente.", "Para el aderezo coloque el azúcar y un chorrito de agua en una sartén y derrita el azúcar con un poco de calor.", "Agregue los ingredientes restantes del aderezo y mezcle bien sobre el fuego durante un minuto y retire del fuego.", "Para servir, cortar el filete en tiras finas, servir en la parte superior de la ensalada de pasta y rociar sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_orientalthaibeefsala_78245", "title": "Ensalada de carne al estilo tailandés con tagliatelle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 500ml / 18fl oz", "1 vaina de vainilla", "100 g / 4 oz de azúcar en polvo (más extra para el relleno)", "6 yemas de huevo de gallinas camperas"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Vierta la crema en una olla. Divida la vaina de vainilla a lo largo y raspe las semillas en la crema.", "Pique la vaina vacía en trozos pequeños, y añádalos a la crema.", "Llevar la crema al punto de ebullición, luego reducir el fuego y hervir a fuego lento durante cinco minutos.", "Mientras tanto, en un tazón separado, bata el azúcar y las yemas de huevo juntas en un tazón grande y resistente al calor hasta que estén pálidas y esponjosas.", "Devuelve la crema al punto de ebullición. Viértala sobre la mezcla de huevo, batiendo continuamente hasta que espese, esto indica que los huevos han comenzado a cocinarse ligeramente.", "Cuele la mezcla a través de un tamiz fino en una jarra grande, y luego use esto para llenar seis moldes hasta aproximadamente dos tercios llenos.", "Coloque los moldes en una bandeja grande para asar y vierta suficiente agua caliente para llegar hasta la mitad de su exterior. (Esto se llama bain-marie).", "Coloque el baño maría en el estante central del horno y hornee durante 40-45 minutos, o hasta que las natillas estén recién preparadas pero todavía un poco tambaleantes en el medio.", "Retire los moldes del agua y déjelos a un lado para que se enfríen a temperatura ambiente. Enfríe hasta que sea necesario.", "Cuando esté listo para servir, espolvoree uniformemente una cucharadita rasa de azúcar impalpable sobre la superficie de cada crème brûlée y luego caramelice con la soplete de un chef.", "Déjelo enfriar por un par de minutos, luego sirva."], "url": "www_bbc_co_uk_food_recipes_originalcremebrulee_81524", "title": "Crème brûlée original", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/originalcremebrulee_81524_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85 g / 3 oz de atún fresco, en rodajas", "1 cucharada de salsa de soja", "1 lima, solo jugo", "1 cucharada de miel clara", "1 cucharada de aceite de oliva", "5 rábanos, rallados", "2 cucharadas de hojas de rábano, finamente picadas", "1 cucharadita de azúcar en polvo", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Coloque el atún fresco en un tazón con la salsa de soja, el jugo de lima y la miel transparente y déjelo marinar durante tres minutos.", "Escurre el atún. Freír las rodajas de atún en aceite de oliva en una sartén pequeña antiadherente durante 1-2 minutos en ambos lados. Agregue el adobo para el último minuto para calentarlo.", "Coloque todos los ingredientes restantes en un tazón para servir y sazone con sal y pimienta negra recién molida.", "Sirva el atún en la parte superior de la ensalada y rocíe sobre los jugos de la sartén."], "url": "www_bbc_co_uk_food_recipes_orientaltunaandradis_85802", "title": "Ensalada oriental de atún y rábano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de ciabatta", "2 cucharadas de aceite de oliva", "1 diente de ajo", "3 tomates, picados", "2 cucharadas de hojas de albahaca fresca, picada", "sal y pimienta negra recién molida"], "method": ["Rocíe aceite de oliva sobre el pan y tápelo en una sartén caliente.", "Frote el pan tostado con ajo.", "Mezcle los tomates picados con la albahaca y sazone con sal y pimienta negra recién molida.", "Coloque la mezcla sobre el pan tostado y sirva sobre una tabla de madera."], "url": "www_bbc_co_uk_food_recipes_originalbruscetta_85797", "title": "Bruschetta de tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo, sin semillas y en cubos", "1 pimiento amarillo, sin semillas y en cubos", "12 tomates cherry", "4 cebollas para ensalada con la parte superior, la cola y el corte en longitudes de 5cm / 2in", "2 calabacines para bebés, cortados en trozos", "aceite de cacahuete o aceite de girasol, para asar", "4 brochetas de kebab", "arroz basmati, para servir", "2-3 cucharadas de salsa de soja", "1 diente de ajo, aplastado", "1 cucharadita de azúcar", "pizca de jengibre molido", "sal y pimienta negra recién molida al gusto", "1 cucharada de aceite de maní o girasol", "1 chalote, finamente picado", "½ cucharadita de chile en polvo", "1 diente de ajo, aplastado", "1 cucharada de azúcar moreno oscuro", "Cacahuetes tostados sin sal de 110g / 4oz, molidos", "150ml / 5fl oz de leche de coco", "½ limón, solo jugo"], "method": ["Mezcle todas las verduras juntas en un tazón. Combine los ingredientes del marinado en un recipiente aparte y vierta sobre las verduras, asegurándose de que las verduras estén bien cubiertas.", "Cubra y deje durante dos horas, revolviendo de vez en cuando.", "Para el aderezo, caliente el aceite en una olla pequeña y fríe la chalota hasta que comience a dorarse. Agregue el chili en polvo y cocine por un minuto.", "Agregue dos cucharadas de adobo de las verduras, el ajo, el azúcar y los cacahuetes molidos. Revuelva bien.", "Agregue la leche de coco un poco a la vez. Llevar a ebullición y cocine a fuego lento durante dos minutos. Agregue el jugo de limón y sazone al gusto.", "Pase las verduras marinadas a los pinchos. Cepíllese con un poco de aceite y ase a la parrilla sobre los carbones durante aproximadamente 15 minutos, volteándolos de vez en cuando.", "Suavemente vuelva a calentar el aderezo de maní.", "Sirve los kebabs en una cama de arroz, rociados con aderezo de maní."], "url": "www_bbc_co_uk_food_recipes_orientalvegetablekeb_6552", "title": "Brochetas de vegetales orientales con aderezo de maní", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalvegetablekeb_6552_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 x 200 g / 7 oz de espinillas de cerdo", "450ml / 16fl oz de vino blanco", "25ml / 1fl oz de aceite de oliva", "1 zanahoria grande, más o menos picada", "3 palitos de apio, más o menos picados", "1litre / 1¾ pintas de caldo de pollo", "½ manojo de tomillo fresco", "Tocino tocino 80 g / 3 oz, cortado en cubitos", "1 bulbo de ajo nuevo, roto en clavos", "2 cucharadas de mantequilla sin sal", "10 rábanos de desayuno frondosos, lavados", "3 hojas de salvia, finamente picadas", "2 cucharadas de perejil rizado, picado", "sal y pimienta"], "method": ["Adobar el cerdo en 150 ml / 5½ fl oz de vino blanco en una bolsa de sándwich, dejar en la nevera durante al menos ocho horas y hasta 24 horas.", "Precaliente el horno a 150C / 300F / Gas 2. Escurra el cerdo y deseche el vino.", "Calienta una sartén resistente al horno de base pesada y agrega el aceite. Cuando esté caliente, agregue las espinillas de cerdo y fría hasta que estén doradas y caramelizadas por todos lados.", "Agregue la zanahoria y el apio a la sartén y cocine hasta que estén coloreados. Agregue el caldo, el tomillo y el resto del vino y deje que hierva. Elimina cualquier impureza que llegue a la cima.", "Coloque una tapa en la parte superior (o cubra con papel de aluminio) y transfiérala al horno. Cocine por 2-3 horas, hasta que el cerdo esté muy tierno.", "Cuando la carne de cerdo esté cocida, retírela del caldo de cocción y manténgala caliente hasta que esté lista para servir (puede envolverla en una película adhesiva para ayudar a mantenerla caliente y húmeda).", "Pase el caldo de cocción por un colador y vuelva a la sartén. Llevar a ebullición y cocinar hasta que el volumen del líquido se haya reducido a una consistencia de salsa.", "Mientras tanto, en una sartén por separado, freír los lardons de tocino hasta que estén crujientes y dorados. Agregue la nueva temporada de ajo y mantequilla y fría por otros 3-4 minutos. Agregue los rábanos y continúe cocinando hasta que estén tiernos. Agregue la salvia, el perejil y tres cucharadas de caldo de cerdo reducido. Sazone al gusto con sal y pimienta.", "Para servir, glasear las espinillas de cerdo con el caldo reducido y servir en la parte superior de las verduras."], "url": "www_bbc_co_uk_food_recipes_ossobuco_of_pork_with_46639", "title": "Ossobuco de cerdo con añada y rábano de temporada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 Propietario (ぇ ぇ l じ ん)", "2 cucharadas de aceite de oliva", "harina común, para quitar el polvo", "sal y pimienta", "30g / 1oz de mantequilla", "1 cebolla pequeña, picada muy finamente", "½ barra de apio, picada finamente", "150ml / 5fl oz de vino blanco seco", "290ml / 10fl oz de material en caliente", "1 limón, ralladura solamente, rallado", "½ diente de ajo, finamente picado", "1 cucharada de perejil picado fino"], "method": ["Elija una sartén lo suficientemente grande como para caber todos los ossi buchi en una sola capa.", "Caliente el aceite y dore el ossi buchi por ambos lados después de espolvorearlo ligeramente con harina. Sácalos de la sartén y reserva.", "Agregue la mantequilla a la sartén y agregue las verduras picadas con una pizca de sal para cocinarlas suavemente sin quemar durante unos minutos. Cuando las verduras estén blandas, devuelva la carne a la sartén y agregue el vino. Cocine suavemente hasta que la humedad esté casi completamente seca.", "Agregue el caldo caliente, baje la temperatura y cubra con una tapa hermética. Cocine suavemente durante 1 hora y media o hasta que la carne salga del hueso, volteándolas cada 20 minutos más o menos. Al girar el ossi buchi, asegúrese de levantarlos suavemente con una espátula para que queden en una sola pieza y la médula no se pierda.", "Cuando esté cocido, coloque el ossobuco en el plato de servir y manténgalos calientes. Mezcle todos los ingredientes de gremolata y espolvoree sobre el ossobuco antes de servir."], "url": "www_bbc_co_uk_food_recipes_ossobucomilanesestyl_65553", "title": "Agujero de hueso estilo milanés (agujero milanesa)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1¼ oz de miel", "2 cucharadas de melaza de granada", "200ml / 7fl oz de agua tibia", "Bata de cordero de 500 g / 1 libra y 2 onzas, cortada en tiras delgadas de 2 cm / 1 in", "150 g / 5½ oz de cordero picado", "½ cucharadita de comino molido", "3 cucharadas de orégano fresco, picado fino, más cuatro ramitas para servir", "200g / 7oz de higos secos", "Ciruelas de 200g / 7oz, piedras quitadas", "Almendras blanqueadas enteras de 150 g / 5½ oz", "Manzana de 300g / 10½oz, sin corazón y en rodajas finas", "20 ml / 4 cucharaditas de agua de rosas", "sal y pimienta negra recién molida", "40 g / 1½ oz de mantequilla", "200g / 7oz de arroz basmati, lavado y escurrido", "200g / 7oz de almendras enteras blanqueadas", "2 g de azafrán, remojado en 20 ml / 4 cucharaditas de agua de rosas durante dos horas", "30g / 1¼ oz de miel", "200 ml / 7 fl oz oz vegetal ligero"], "method": ["Para el cordero otomano, mezcle la miel, la melaza de granada y el agua tibia en un bol.", "Seque las tiras de cordero en una sartén a fuego medio.", "Agregue la mezcla de miel y más agua si es necesario y cocine a fuego lento. Cocine muy suavemente hasta que la carne esté muy suave y casi derretida, aproximadamente 45-60 minutos.", "Mientras tanto, coloque el cordero picado, el comino y el orégano picado en un bol y mezcle bien. Sazonar con sal y pimienta negra recién molida y luego dar forma a albóndigas muy pequeñas, del tamaño de avellanas.", "Cuando la barriga de cordero esté muy tierna, agregue las albóndigas a la sartén con los higos, las ciruelas pasas y las almendras. Cocine a fuego lento durante 20 minutos a fuego lento, luego sazone, al gusto, con más sal y pimienta.", "Agregue la manzana en rodajas y, finalmente, agregue el agua de rosas.", "Para el pilaf de arroz, agregue la mantequilla a una sartén y derrita suavemente, luego mezcle el arroz y cocine por un minuto más o menos.", "Agregue los ingredientes restantes, reduzca el fuego y cocine a fuego lento hasta que el arroz esté tierno y el líquido se haya absorbido por completo.", "Para servir, amontone el arroz en cada plato y póngalo junto al cordero. Adorne con un par de ramitas de orégano."], "url": "www_bbc_co_uk_food_recipes_ottoman_lamb_with_98112", "title": "El cordero otomano con azafrán y pilaf de arroz de agua de rosas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "6 muslos de pollo deshuesados, despellejados, cortados por la mitad (aproximadamente 600 g / 1 lb 5 oz)", "150 g / 5oz de cocción de chorizo, pelado y cortado en rodajas de 5 mm / ¼ in", "4 dientes de ajo, aplastados", "300g / 10½oz de tomates grandes frescos, cortados a la mitad, sin semillas, rallados en carne (luego descartados)", "1 cucharadita de pimentón dulce ahumado", "1 limón, ralladura solamente", "1,5 litros / 2½ pintas de caldo de pollo caliente", "3 hojas de laurel", "2 ramitas de tomillo", "200 g / 7 oz de judías verdes, cortadas en trozos cortos", "500 g / 1lb de paella 2 oz de arroz", "1 cucharadita de hilos de azafrán, empapados en un poco de agua tibia", "puñados en pareja mejillones en vivo, limpios, sin barba y enjuagados (deseche los mejillones que no se cierren al golpearlos)", "12 gambas crudas", "cuñas de limón, para servir", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una paellera de 36cm / 14in o en una sartén muy grande colocada a fuego medio. Sazonar los muslos de pollo con sal y pimienta negra recién molida y freír durante cinco minutos, volteando regularmente hasta que estén ligeramente coloreados. Agregue el chorizo ​​y cocine por un minuto más.", "Agregue el ajo y cocine durante unos minutos más, luego empuje todo a un lado. Agregue los tomates y fría por unos minutos, luego mezcle todo y espolvoree el pimentón y la ralladura de limón. Vierta en todos menos una cucharada grande de caldo de pollo y vuelva a hervir. Agregue las hojas de laurel, el tomillo y las judías verdes y sazone con un poco de sal.", "Cuando el caldo de pollo haya vuelto a hervir, baje a fuego lento y espolvoree el arroz, tratando de ponerlo en una capa lo más parecida posible. Vierta el azafrán y revuelva - ¡esta es la única vez que debe remover su paella una vez que se haya agregado el arroz! Llevar a ebullición de nuevo, luego cocine a fuego lento durante 5 minutos.", "Baje la temperatura y deje que el arroz hierva a fuego lento, esto demorará entre 12 y 15 minutos. Si se está secando, pruebe; si todavía está demasiado firme (crujiente), agregue un poco más de caldo. Cuando esté satisfecho con el arroz al dente, coloque los mejillones y gambas sobre la paella. Cúbralo con una toalla húmeda o una tapa si tiene uno y espere a que los mejillones se abran y las gambas se pongan rosadas. Sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_our_paella_92328", "title": "Nuestra paella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/our_paella_92328_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de aceite de girasol", "6% 20sausages,% 20at% 20least% 2085 %% 20meat", "4 palitos de apio", "3 zanahorias", "2 cebollas, cortadas a la mitad y en rodajas", "6 muslos de pollo deshuesados ​​y sin piel (aproximadamente 450 g / 1 lb)", "2 dientes de ajo, aplastados", "200 g / 7 onzas de trozo de carne magra ahumada, cortada y cortada en cubos de 2 cm / 1 in", "2 x 400 g / 14 onzas de latas de tomates picados", "150ml / 5fl oz de vino tinto (o agua)", "1 cucharadita de azúcar en polvo", "1 cucharadita de hojuelas de chile seco", "1 hoja de laurel", "4-5 ramitas espesas tomillo fresco", "400g / 14oz pueden frijoles cannellini en agua, escurridos y enjuagados", "400g / 14oz pueden frijoles en agua, escurridos y enjuagados", "pimienta negra recién molida", "puñado de perejil recién hecho", "½ naranja grande, solo ralladura, finamente rallado"], "method": ["Cepille una sartén antiadherente grande con aceite de girasol, usando la punta de un cepillo de pastelería. Agregue las salchichas a la sartén y cocine a fuego medio durante 10 minutos, volteándolas de vez en cuando hasta que estén doradas por todos lados.", "Mientras tanto, recorte el apio y pele las zanahorias y córtelas en rodajas diagonales de aproximadamente 1.5 cm / ½ pulgadas de espesor.", "Precalentar el horno a 180C / 350F / Gas 4.", "Agregue las cebollas a la sartén y cocine con las salchichas durante 6-8 minutos, revolviendo regularmente hasta que estén suaves y ligeramente doradas.", "Corta los muslos de pollo con cualquier grasa visible, encontramos un buen par de tijeras de cocina que hace bien el trabajo, luego corta los muslos por la mitad.", "Agregue los pedazos de ajo y pollo a la sartén con las salchichas y las cebollas y cocínelos durante 3-4 minutos, volteando el pollo dos veces hasta que se coloreen por completo.", "Transfiera todo a una gran cazuela a prueba de llamas.", "Agregue el jamón, el apio, las zanahorias, los tomates, el vino tinto y 300 ml / ½ litro de agua fría, luego espolvoree sobre el azúcar impalpable y las hojuelas de chile. Agregue la hoja de laurel y el tomillo y sazone con mucha pimienta negra molida.", "Deje que la cassoulet hierva a fuego lento sobre la placa, cubra con una tapa y transfiérala al horno. Cocine por 45 minutos.", "Saque la cazuela del horno y agregue todos los frijoles. Cubra nuevamente con la tapa y coloque el plato nuevamente en el horno por otros 30 minutos.", "Justo antes de que el cassoulet esté listo, prepare la guarnición. Picar el perejil aproximadamente y mezclar con la ralladura de naranja en un tazón pequeño.", "Sirva porciones grandes de cassoulet en platos profundos o cuencos anchos con una buena pizca de aderezo de perejil picante en cada uno."], "url": "www_bbc_co_uk_food_recipes_our_special_cassoulet_05208", "title": "Nuestro cassoulet especial", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/our_special_cassoulet_05208_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110g / 4oz de arándanos secos", "55ml / 2fl oz de puerto de rubí", "45 g / 1½ oz de mantequilla", "1 cebolla pequeña, picada", "2 lonchas de tocino verde sin ahumar, sin cortar, cortadas en tiras", "2 dientes de ajo picados", "450 g / 1 libra de carne de salchicha", "85g / 3oz pan rallado blanco o marrón suave", "2 cucharadas de perejil fresco, picado", "½ cucharadita de hojas frescas de tomillo picadas", "150g / 5½oz de castañas peladas y cocidas, más o menos picadas", "1 huevo, ligeramente batido", "sal y pimienta negra recién molida"], "method": ["Remoje los arándanos en el puerto durante una hora.", "Derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla y el tocino y cocine suavemente hasta que la cebolla esté tierna y el tocino esté cocido.", "Agregue el ajo y fría por otro minuto.", "Retire del fuego para que se enfríe un poco, luego vierta en un recipiente.", "Agregue todos los ingredientes restantes, incluidos los arándanos y el puerto, y mezcle bien, agregando suficiente huevo para unir para formar una pasta espesa.", "Freír un pequeño botón de la mezcla para probar el condimento y agregar sal y pimienta negra recién molida a la mezcla según el gusto. El relleno ahora está listo para usar, para rellenar pavo o pollo."], "url": "www_bbc_co_uk_food_recipes_outsideinstuffing_78913", "title": "Embutido de salchicha, arándano y bacalao", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero, aproximadamente 2 kg / 4 lb 8 oz, unido en 8 piezas", "3 cucharadas de aceite de oliva", "1 cucharada de semillas de sésamo", "2 cucharadas de zumaque de tierra", "2 dientes grandes de ajo, triturados o rallados", "½ -1 cucharadita de copos de chile", "1 cucharada de puré de tomate", "1 cucharada de melaza de granada", "1 cucharadita de sal"], "method": ["Mezcle todos los ingredientes del marinado, frote bien con el pollo y deje en la nevera durante 1 hora.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Ponga el pollo en una lata para asar, rocíe con aceite de oliva y esparza las semillas de sésamo. Asar en el horno durante 30 minutos o hasta que esté cocido. (Para comprobar que el pollo esté cocido, perfore en la parte más gruesa del muslo, los jugos deben quedar claros)."], "url": "www_bbc_co_uk_food_recipes_oven-roasted_chicken_13123", "title": "Pollo asado al horno con zumaque, melazas de granada, chile y semillas de sésamo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven-roasted_chicken_13123_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 muslos de pollo deshuesados ​​y sin piel", "2 limones no encerados", "100ml / 3½fl oz de aceite de oliva", "4 dientes de ajo grasos o 6 más pequeños, finamente rallados o picados", "2 hojas de laurel secas o frescas", "2 cucharaditas de pimentón", "2 cucharaditas de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de hojuelas de chile seco", "¼ cucharadita de canela molida", "¼ cucharadita de nuez moscada recién rallada", "2 cucharaditas de copos de sal marina", "hojas de lechuga, para servir", "Yogur natural de 250g / 9oz", "4 cucharadas de tahini", "1 grasa o 2 dientes de ajo pequeños, finamente rallados o picados", "sal pizca de grasa, o al gusto", "1 cucharada de semillas de granada"], "method": ["Tome una bolsa de congelador grande con cierre y coloque los muslos de pollo en ella. Usando un rallador fino, preferiblemente un microplane, ralle en la ralladura de limón. Exprime los limones y agrega el jugo. Vierta el aceite de oliva y agregue el ajo, luego agregue todos los ingredientes restantes.", "Agite todo sobre el conjunto, luego selle la bolsa, colóquela en un plato o en un plato y refrigérela durante al menos 6 horas o hasta 1 día.", "Cuando esté listo para cocinar, precaliente el horno a 220C / 200C Ventilador / Gas 7. Retire el pollo del refrigerador y permita que alcance la temperatura ambiente.", "Incline el contenido de la bolsa del congelador en una lata para asar poco profunda - la mía mide 44x34x1.5cm / 17x13x½ pulgadas - y asegúrese de que todos los muslos del pollo queden planos y no uno encima del otro (si es posible) antes de asar en el horno caliente durante 30 minutos, momento en que deben cocinarse (aunque obviamente debe verificar) y dorado en la parte superior.", "Cuando el pollo esté más o menos cocinado, prepare la salsa simplemente combinando el yogur con el tahini y el ajo, mezcle y sal al gusto, y espolvoree con algunas semillas de granada.", "Cubra un plato o un par de platos con lechuga crujiente, triturada o desgarrada en trozos, y luego cubra con el pollo bien caliente, vertiendo los jugos aceitosos sobre ellos, a menos que sea, por alguna razón inexplicable, jugos antiaéreos. Si quisieras hacer que el pollo vaya más allá, podrías cortar los muslos en rebanadas gruesas en lugar de dejarlos enteros. Y por favor, agregue cualquiera de los acompañamientos sugeridos, detallados en mi introducción."], "url": "www_bbc_co_uk_food_recipes_oven-cooked_chicken_04728", "title": "Shawarma de pollo cocido al horno", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven-cooked_chicken_04728_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de abadejo de 1,2 kg / 2lb11 oz, pelado y deshuesado", "sal marina y pimienta negra recién molida", "2 chalotes de plátano, finamente picados", "10 granos de pimienta blanca", "5 ramitas de tomillo fresco", "100ml / 3½fl oz de vino blanco", "100ml / 3½fl oz de vinagre de vino blanco", "Crema doble 50ml / 2fl oz", "200g / 7oz de mantequilla fría, cortada en cubitos", "10 rábanos, cortados por la mitad a lo largo con las tapas todavía encendidas", "200g / 7oz girolles champiñones", "50 ml / 2 fl oz de agua", "12 flores de borraja, para adornar", "8 rodajas finas de lardo"], "method": ["Espolvoree el colín con un poco de sal marina, envuelva con una película adhesiva y colóquelo en la nevera durante dos horas.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Enjuague el pescado y séquelo con la cocina, luego córtelo en cuatro porciones y colóquelo en un plato para horno forrado con un trozo de papel engrasado con mantequilla.", "Coloque los chalotes, los granos de pimienta y el tomillo en una cacerola con el vino blanco y el vinagre y cocine a fuego medio hasta que se reduzca a un glaseado.", "Agregue la crema doble y lleve a ebullición, luego reduzca el fuego y bata gradualmente en 150 g / 5 oz de la mantequilla. Sazonar con sal y pimienta negra recién molida, pasar a través de un colador y mantener el calor.", "Coloque una perilla de mantequilla en cada una de las porciones de colín y luego colóquela en el horno por tres minutos.", "Hilvane el pescado con la mantequilla derretida y luego vuelva al horno por otros 3-4 minutos o hasta que esté recién cocinado.", "Mientras el pescado se está cocinando, deje los rábanos en una sartén con un poco de mantequilla y sal marina, déjelos a un lado y manténgalos calientes.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla restante, los girolles y el agua y cocinar hasta que los champiñones se ablanden.", "Cuando el pescado esté cocido, vierta la salsa de mantequilla sobre los platos para servir calentados, agregue los rábanos y coloque el pescado encima. Agregue los girolles y luego coloque un par de rodajas de lardo encima del pescado. Adorne con las flores de borraja y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_oven_baked_pollock_with_72838", "title": "Pollock al horno con rábanos, flores de borraja y lardo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 patatas dulces grandes, restregadas", "1-2 grandes patatas Maris Piper o King Edward, frotadas", "4 ramitas de tomillo, solo hojas", "1 cucharadita de comino molido", "1 pizca de hojuelas de chile", "1 cucharada de aceite de oliva", "2 cucharaditas de pimentón ahumado en caliente", "copos de sal marina"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Corte las batatas en trozos gruesos y colóquelas en un tazón grande. Corte las papas blancas en trozos ligeramente más finos (tardan más en cocinarse, por lo que deben ser un poco más pequeñas para un tiempo de cocción igual) y agregue al tazón. Agregue el resto de los ingredientes y mezcle hasta que las cuñas estén uniformemente cubiertas. Sazonar con sal marina y luego extender sobre una bandeja para hornear antiadherente en una capa uniforme. (Coloque las batatas en el centro y las papas blancas alrededor del borde de la bandeja donde estará más caliente).", "Cocine por 20-25 minutos, revisando después de 10 minutos, sacudariendo y volteándolo ocasionalmente, hasta que esté bien cocido. Si las batatas se cocinan antes de que las otras estén listas, quítelas del horno y déjelas reposar por más tiempo."], "url": "www_bbc_co_uk_food_recipes_oven_chips_67210", "title": "Chips de horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven_chips_67210_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan crujiente blanco", "aceite de oliva", "100g / 3½oz de queso de cabra", "2 cucharadas de miel líquida", "2 ramitas de tomillo fresco, solo hojas", "puñado cada perifollo fresco, menta, albahaca", "2 cucharaditas de vinagre balsámico"], "method": ["Recorta dos círculos de pan de 5cm / 2 pulgadas usando un cortador de pasteles. Rocíe cada uno con un poco de aceite de oliva. Caliente una sartén y una plancha durante dos minutos en cada lado, o hasta que estén dorados.", "Precalentar la parrilla a mediano. Coloque el pan en una bandeja para hornear, cubra con el queso de cabra, la miel y las hojas de tomillo y colóquelo debajo de la parrilla durante 3-4 minutos.", "Coloque las hierbas en un tazón grande, agregue un poco de aceite de oliva y el vinagre balsámico y mezcle para cubrir las hojas.", "Para servir, coloque una pila de ensalada de hierbas en un plato de servir y cubra con queso de cabra crostini."], "url": "www_bbc_co_uk_food_recipes_ovenbakedgoatscheese_86203", "title": "Crostini de queso de cabra a la parrilla con miel y tomillo servido en una ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]