[{"isVegetarian": false, "title": "Tarta de queso Banoffee con migas de jengibre, plátanos caramelizados y tatin de tarta de plátano", "url": "www_bbc_co_uk_food_recipes_banoffee_cheesecake_with_11022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125 g / 4½ oz de pastel de jengibre", "300g / 10½oz de queso crema", "50 g / 1 oz de crema fresca", "Crema doble 50ml / 2fl oz", "4 cucharadas de azúcar glas", "1 cucharada de jarabe de arce", "225 g / 8 oz de caramelo o dulce de leche", "4 ramitas de menta fresca, para decorar", "200 g / 7 oz de azúcar en polvo", "2 plátanos grandes, pelados y cortados en trozos", "agua helada, en un recipiente", "Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de sal", "275g / 9¾oz de mantequilla fría, cortada en cubos pequeños", "125ml / 4fl oz de agua helada", "115 g / 4 oz de azúcar en polvo", "2-3 plátanos pequeños, pelados y en rodajas"], "serves": "Porciones 2", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la tarta de queso banoffee, coloca el pastel de jengibre en un procesador de alimentos y muévelo a migas. Dejar de lado.", "Coloque el queso crema, la crème fraîche, la crema doble, el azúcar glas y el jarabe de arce en un tazón grande y mezcle. Agite suavemente el caramelo en lata para crear un efecto dominó. Refrigere hasta que esté listo para servir.", "Para los plátanos caramelizados, cocine 200 g / 7 oz de azúcar en polvo en una sartén grande a fuego medio-bajo sin remover hasta que se haya derretido. Aumenta el fuego hasta que el caramelo se torne dorado claro. Retire del fuego, agregue los plátanos y, con dos cucharas, cubra con cuidado en el caramelo. (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado). Coloque las bananas en el recipiente con agua helada para prepararlas.", "Para la tarta tatin de plátano, ponga la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro. Agregue la sal y 250 g / 9 oz de la mantequilla al pozo. Ponga la harina en la mantequilla con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano. Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, trabaje gradualmente en el agua hasta que esté todo incorporado. No trabajes demasiado la masa, deberías tener un efecto marmoleado con la mantequilla. Enrolle la mezcla en una bola, envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enharina ligeramente una superficie de trabajo limpia y extienda la masa a un rectángulo de 40x20cm / 16x8 pulgadas. Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba y sobre eso. Dale un cuarto de vuelta. Enrolle la masa en un rectángulo de 40x20cm / 16x8 pulgadas como antes, y vuelva a doblarla en tres. Estos son los primeros dos turnos. Envuelva el bloque en una película adhesiva y refrigere durante 30 minutos.", "Dale a la masa otras dos vueltas, rodando y doblando como antes. Esto hace un total de cuatro giros. Envuélvala en una película adhesiva y refrigere durante al menos 30 minutos.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Divida el azúcar en polvo de 115 g / 4 oz de manera uniforme entre dos sartenes para horno muy pequeñas (alternativamente, utilice una sartén grande). Cocine a fuego lento sin remover hasta que el azúcar se haya derretido. Aumenta el fuego hasta que el caramelo se torne dorado claro. Retire del fuego, ponga la mitad de la mantequilla restante en cada sartén y revuelva suavemente. Coloque cuidadosamente los plátanos rebanados en cada bandeja.", "En una superficie de trabajo ligeramente enharinada, extienda la masa al grosor de una moneda de una libra. Recorta dos círculos ligeramente más grandes que la circunferencia de las sartenes pequeñas (o un círculo si usa una sartén grande). Cualquier pastel sobrante puede congelarse y usarse en otros platos. Cubra cada bandeja con una ronda de repostería, empujando los bordes alrededor de los plátanos. Hornee durante 10-12 minutos, o hasta que la masa esté dorada y cocida. Retire del horno y deje a un lado para que se enfríe un poco.", "Para servir, invierta un plato sobre las sartenes y saque las tartas. Ponga un montón de migas de torta de jengibre en cada plato y una quenelle de la mezcla de queso crema en la parte superior. Coloque algunos trozos de plátano caramelizado al lado. Adorne con menta fresca."]}, {"isVegetarian": true, "title": "Pie de banoffee", "url": "www_bbc_co_uk_food_recipes_banoffee_pie_90466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 175g / 6oz", "75g / 3½oz de mantequilla fría, en cubos", "100 g / 3½ oz de mantequilla", "100g / 3½oz de azúcar mascabado ligero", "2 x 397 g / 14 oz latas de leche condensada", "300 ml / 10 fl oz doble crema", "1 plátano grande", "un poco de jugo de limón", "un poco de leche belga rallada o chocolate puro, para rociar"], "serves": "Para 6", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa de copos, coloque la harina en un tazón y frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a finas migas de pan. Agregue 2-3 cucharadas de agua fría gradualmente, mezclándolas para formar una masa suave.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y úsela para revestir una lata de flan de 20 cm / 8 pulgadas. Cúbralo en una película adhesiva y colóquelo en la nevera para que se enfríe durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Alinee la caja de repostería con papel de aluminio y llénela con alubias para hornear. Hornee a ciegas en el horno por unos 15 minutos, luego quite los frijoles y la hoja y cocine por otros cinco minutos para secar la base. Retire del horno.", "Para el relleno de caramelo, ponga la mantequilla y el azúcar en una sartén grande antiadherente. Caliente suavemente hasta que la mantequilla se haya derretido y el azúcar se haya disuelto, luego agregue la leche condensada. Revuelva de forma continua y pareja con una cuchara de madera de punta plana durante unos cinco minutos, o hasta que la mezcla esté espesa y tenga un color dorado toffee, tenga cuidado, ya que se quema fácilmente. Convierta el relleno en la caja de pastelería cocida y deje enfriar y fraguar.", "Para el relleno, azote la crema doble en un tazón grande hasta que simplemente mantenga su forma y se extienda uniformemente sobre la mezcla fría de toffee. Pele y corte el plátano y sumérjalo en un poco de jugo de limón para evitar la decoloración.", "Apila las rodajas de plátano encima de la crema y espolvorea todo el pastel con chocolate rallado. Retire el anillo del flan y transfiéralo a una placa plana. Servir bien frío."]}, {"isVegetarian": false, "title": "Pastel de Banoffee con malvaviscos y plátanos caramelizados", "url": "www_bbc_co_uk_food_recipes_banoffee_pie_with_78481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 175g / 6oz", "75g / 2¾oz de mantequilla sin sal fría, cortada en cubitos", "2-3 cucharadas de agua helada", "150g / 5½oz de mantequilla salada, cortada en cubitos", "150g / 5½oz de azúcar morena suave", "300g de leche condensada de estaño", "400ml / 14fl oz de crema doble, batida", "2 plátanos pequeños, en rodajas", "100 g / 3½ oz de chocolate negro, rallado", "aceite vegetal, para engrasar", "5-6 cucharadas de azúcar glas, tamizado, para quitar el polvo", "5-6 cucharadas de harina de maíz, tamizada, para quitar el polvo", "Hoja de 9 hojas de gelatina", "450g / 1lb de azúcar granulada", "1 cucharada de glucosa líquida", "2 claras de huevo grandes de gallinas camperas", "1 cucharadita de extracto de vainilla", "100 g // 3½ oz de azúcar en polvo", "1 manojo de plátanos", "helado de vainilla", "menta fresca, picada"], "serves": "Sirve 6-8", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la tarta de banoffee, ponga la harina en un tazón y frote la mantequilla sin sal con las puntas de los dedos hasta que la mezcla se asemeje a finas migas de pan. Agregue el agua fría gradualmente, mezclándola para formar una masa suave. Extienda la masa sobre una superficie de trabajo ligeramente enharinada y úsela para revestir una lata de flan con estrías de 20 cm / 8 pulg. Poner en la nevera para enfriar durante 30 minutos.", "Alinee la caja de pastelería con papel de hornear y llénela con alubias o arroz. Ciega a fuego lento durante 15 minutos, luego retira los frijoles y el papel de hornear y cocina por otros 5 minutos para secar la base. Sacar del horno y dejar enfriar.", "Mientras tanto, ponga la mantequilla y el azúcar en una cacerola grande y derrita a fuego medio. Una vez derretido agregue la leche condensada y mezcle. Vierta en la caja de repostería fría. Deje que se solidifique y se enfríe.", "Coloque las rodajas de plátano encima de la salsa de caramelo, cubra con la crema batida y adorne con el chocolate rallado.", "Para hacer los malvaviscos, engrasar ligeramente una bandeja de horno poco profunda, aproximadamente 30x20 cm / 12x8 pulgadas y espolvorear con azúcar glas y harina de maíz.", "Remoje las hojas de gelatina en 140ml / 4½fl oz de agua fría.", "Ponga el azúcar, la glucosa y 200 ml / 7 fl oz de agua en una sartén de base pesada. Llevar a ebullición y continuar cocinando durante aproximadamente 12-15 minutos hasta que la mezcla alcance 127C en un termómetro de azúcar. Cuando el almíbar esté a la temperatura adecuada, deslice con cuidado las hojas de gelatina suavizadas y el agua de remojo. El jarabe burbujeará, así que tenga cuidado de no quemarse. Vierta el jarabe en una jarra de metal.", "Batir las claras de huevo hasta que estén tieso, de preferencia con un batidor eléctrico en un tazón. Continúe batiendo mientras vierte el jarabe caliente de la jarra. La mezcla se tornará brillante y comenzará a espesarse. Agregue el extracto de vainilla y continúe batiendo durante unos 5-10 minutos, hasta que la mezcla esté rígida y lo suficientemente gruesa como para mantener su forma en el batidor.", "Coloque la mezcla en la lata preparada y alise con una espátula húmeda si es necesario. Deje por lo menos 1 hora para establecer.", "Polvore una superficie de trabajo con azúcar glas y harina de maíz. Afloje el malvavisco alrededor de los lados de la bandeja con una espátula y apáguela sobre la superficie espolvoreada. Cortar en cuadrados y rodar el azúcar glas y la harina de maíz. Deje secar un poco en una rejilla de alambre.", "Para los plátanos caramelizados, caliente una sartén grande y agregue el azúcar, deje en el fuego hasta que se convierta en caramelo (PRECAUCIÓN: el azúcar hirviendo es extremadamente caliente. Maneje con mucho cuidado.) Una vez convertido en un caramelo, agregue 4 cucharadas de agua para crear un poco de salsa Agregue los plátanos picados al bebé a la salsa y revuelva para cubrir.", "Para servir, ponga una porción del pastel de banoffee en el centro. Adorne con una bola de helado, cuadrados de malvaviscos, algunos plátanos caramelizados y espolvoree la menta."]}, {"isVegetarian": true, "title": "Tarta de queso Banoffee con salsa de chocolate", "url": "www_bbc_co_uk_food_recipes_banoffeecheesecakewi_85024", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banoffeecheesecakewi_85024_16x9.jpg", "ingredients": ["Galletas de avena de chocolate de 150g / 6oz, aplastadas", "75g / 3oz de mantequilla", "2 cucharadas de miel clara", "4 plátanos, pelados y cortados en trozos", "400 g / 14 oz de queso crema", "4 cucharadas de azúcar glas", "1 cucharada de jarabe de arce", "1 x 225g / 8oz de dulce de leche o caramelo enlatado", "40 g / 1½ oz de mantequilla", "Crema doble 175ml / 7fl oz", "225g / 8oz de chocolate con leche, aproximadamente picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la tarta de queso, coloque las galletas de chocolate trituradas en un tazón. Agregue un tercio de la mantequilla y toda la miel a los bizcochos triturados y mezcle bien todo junto con una cuchara de madera.", "Con una cuchara, vierta la mezcla de migas de galleta en una lata de pastel con forma de resorte de 23 cm / 9 pulgadas y aplaste con el dorso de una cuchara.", "Caliente una sartén hasta que esté caliente, luego agregue la mantequilla restante y las bananas y fría por 2-3 minutos, hasta que estén doradas.", "Retire los plátanos de la sartén y déjelos a un lado para que se enfríen. Arregle los plátanos en la parte superior de la base de galletas, reservando algunos para servir.", "Coloque el queso crema y el azúcar glas en un bol y bata hasta que quede suave. Agregue el jarabe de arce y el dulce de leche o caramelo.", "Con una cuchara, coloque la mezcla dulce de queso crema en la lata del pastel encima de los plátanos.", "Coloque en el refrigerador y deje reposar durante al menos 30 minutos, preferiblemente durante la noche.", "Mientras tanto, para la salsa de chocolate, coloque la mantequilla y la crema en una olla y cocine a fuego lento a fuego medio.", "Agregue el chocolate picado y revuelva para combinar.", "Baja la temperatura y mantén el chocolate mantecoso sobre la placa hasta que el chocolate se haya derretido y la mezcla esté suave y brillante.", "Para servir, retire la tarta de queso de la nevera, retire la lata y colóquela en un plato para servir. Cubra con los plátanos fritos reservados y una cucharada de salsa de chocolate."]}, {"isVegetarian": true, "title": "Pie de banoffee", "url": "www_bbc_co_uk_food_recipes_banoffeepiewithpecan_86926", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banoffeepiewithpecan_86926_16x9.jpg", "ingredients": ["Galletas digestivas de 150 g / 5½ oz (alrededor de 10)", "75g / 2¾oz de mantequilla", "75g / 2¾oz de mantequilla", "75g / 2¾oz de azúcar mascabado ligero", "1 x 397 g / 14 oz de leche condensada entera (ver consejo)", "1 cucharadita de extracto de vainilla", "300 ml / 10 fl oz doble crema", "3 plátanos pequeños maduros, cortados", "50g / 1¾oz de chocolate negro, derretido o cacao en polvo"], "serves": "Sirve 8", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Alinee la base de una lata profunda de 20 cm / 8 pulg. Con papel de hornear.", "Para hacer la base, triture los bizcochos en migajas finas y derrita la mantequilla a fuego lento. Vierta en un recipiente y mezcle para combinar. Cuchara en la base de la lata y presione hacia abajo con la parte posterior de una cuchara hasta que esté nivelada. Coloque en la nevera por 15 minutos.", "Para hacer el relleno, caliente la mantequilla y el azúcar en una olla pequeña antiadherente y revuelva a fuego lento hasta que se combinen. Agregue la leche condensada y deje que hierva, revolviendo durante 2 a 3 minutos. No hierva demasiado o se volverá granulada y dulce. Agregue la vainilla y vierta en la lata. Coloque en la nevera durante al menos 1 hora.", "Batir la crema en un bol hasta que se formen picos suaves.", "Coloque las rodajas de plátano en rondas ordenadas sobre el toffee. Con una cuchara, vierta la crema en la parte superior y nivele. Establecer en la nevera durante una hora.", "Retira de la lata y coloca el chocolate derretido en la parte superior o en polvo con cacao en polvo."]}, {"isVegetarian": true, "title": "Pastel de banoffee fácil", "url": "www_bbc_co_uk_food_recipes_banoffeepie_89031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Galletas digestivas 250 g / 9 oz", "100g / 4oz de mantequilla, derretida, más extra para engrasar", "400g/14oz dulce de leche (sometimes sold as caramel)", "2 plátanos, pelados y en rodajas", "Crema batida de 300 ml / ½ pinta, batida hasta que se formen picos suaves", "2 cucharadas de chocolate negro rallado"], "serves": "4-6", "time": {"preparation": "1-2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque los bizcochos en un procesador de alimentos y pulse hasta que la mezcla se asemeje a migas de pan finas. Transfiera a un tazón y mezcle la mantequilla derretida, mezcle bien para combinar.", "Coloque la mezcla en una lata de torta suelta de 20cm / 8in ligeramente engrasada y presione hacia abajo en la base y hacia arriba a lo largo de los lados. Coloque en la nevera para enfriar durante 30 minutos.", "Con una cuchara, coloque el dulce de leche sobre la base de la galleta y cubra con una capa de plátanos rebanados. Coloque la crema batida encima y decore con chocolate rallado.", "Cortar en rodajas y servir."]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_24607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450 g / 1 libra de harina blanca fuerte", "7g de sal", "20 g / oz de levadura fresca", "75 g / 2½ oz de mantequilla, más extra para engrasar y servir", "50g / 1¾oz de azúcar moreno", "2 cucharaditas de especias mixtas", "350g / 12oz de frutas secas mezcladas, como pasas, grosellas, pasas y arándanos", "1 huevo de gallinas camperas", "225ml / 8fl oz de té caliente fuerte", "aceite, para engrasar", "mantequilla, para servir (opcional)", "50 g / 1 oz de azúcar en polvo"], "serves": "Sirve 8-10", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque la harina, la sal y la levadura en un tazón grande para mezclar y luego frote la mantequilla con los dedos hasta que la mezcla se asemeje a migas de pan finas. Mezcle el azúcar, la mezcla de especias y la fruta seca hasta que estén distribuidos uniformemente.", "Agregue el huevo y el té y junte la mezcla para formar una masa. Amasar en una superficie de trabajo limpia hasta que quede suave. Vuelva a colocar en el recipiente, cúbralo con una película adhesiva engrasada y deje hasta duplicar su tamaño, al menos una hora.", "Precaliente el horno a un ventilador de 200C / 180C / 400F / Gas 6 y engrase una lata de hogaza de 900 g / 2lb.", "Derriba la masa, luego dale forma y colócala en la lata de pan. Cubra nuevamente con película adhesiva engrasada y demuéstrela por otros 30 minutos. Retire la película adhesiva y hornee en el centro del horno durante 20 minutos.", "Cubra el bara brith con papel de aluminio y continúe horneando por otros 25 minutos. Retire del horno, sáquelo de la lata y déjelo enfriar sobre una rejilla de alambre durante 20 minutos.", "Para el jarabe de azúcar, traiga 50ml / 1¾fl oz de agua y el azúcar a ebullición en una olla pequeña y cocine hasta que esté almibarado. Retire del fuego y cepille la barra con el glaseado. Deje que se enfríe completamente antes de cortar. Servir en rebanadas con mantequilla, si quieres"]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_33441", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_33441_16x9.jpg", "ingredients": ["450 g / 1 libra de fruta mixta seca", "250g / 9oz de azúcar moreno", "300ml / ½ pinta de té negro caliente", "2 cucharaditas de especias mixtas", "Harina de auto aumento de 450g / 1lb", "1 huevo de gallinas camperas, golpeado"], "serves": "Hace 1 torta", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["En un tazón grande, sumerja la fruta y el azúcar en el té filtrado y déjelo toda la noche.", "Al día siguiente, precalentar el horno a 170 ° C / 325 ° F / Gas 3. Cubrir una lata de pan de 900 g / 2 lbs con pergamino para hornear.", "Mezcle los ingredientes restantes en la mezcla de frutas y bata bien.", "Vierta la mezcla en la lata de pan y hornee el horno y hornee durante 1 hora y media o hasta que un pincho insertado en el centro salga limpio."]}, {"isVegetarian": true, "title": "Bara brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_40487", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_40487_16x9.jpg", "ingredients": ["375g / 13oz de fruta mixta seca", "1 naranja mediana, ralladura y jugo", "1 cucharada colmada de especias mixtas molida", "25 g / 1 oz de miel clara", "225ml / 8fl oz Earl Grey tea, caliente", "mantequilla sin sal, para engrasar", "1 huevo mediano de granja, golpeado", "1 manzana grande para comer (aproximadamente 200 g / 7 oz), sin corazón, rallada", "Harina de crianza integral 175g / 6oz tamizada", "Harina blanca autoelevada de 200g / 7oz, tamizada"], "serves": "Sirve 12", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Coloque la fruta seca, la ralladura de naranja, la mezcla de especias y la miel en un tazón grande. Vierta sobre el té caliente y revuelva para combinar. Cubra el recipiente con film transparente y déjelo en remojo durante 4-5 horas o durante la noche.", "Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Engrase ligeramente una lata de pan de 900 g / 2 lb con mantequilla y alinee con papel de hornear.", "Mezcle el jugo de naranja, el huevo batido y la manzana rallada con la fruta empapada. Dobla la harina tamizada hasta que esté completamente combinada.", "Con una cuchara, coloque la mezcla en la lata de pan revestida y colóquela en el horno en el estante del medio durante 45 minutos.", "Retire del horno y cubra la torta con una capa doble de papel de aluminio para evitar que se dore demasiado. Continúe horneando por 1 hora y media o hasta que un pincho insertado en el centro del pastel salga limpio.", "Retire de la lata y transfiera a una rejilla de alambre. Cúbralo con un paño de cocina y déjelo enfriar por completo."]}, {"isVegetarian": true, "title": "Galletas de oveja Bara Brith", "url": "www_bbc_co_uk_food_recipes_bara_brith_sheep_54510", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bara_brith_sheep_54510_16x9.jpg", "ingredients": ["10 bolsitas de té", "salpicar licor de naranja", "6 cucharadas de fruta seca mixta", "1 naranja, ralladura fina solamente", "½ limón, ralladura fina únicamente", "500g / 1lb 2 oz de harina de auto aumento, más extra para quitar el polvo", "125g / 4½ oz de azúcar en polvo", "½ cucharadita de especias mixtas", "½ cucharadita de jengibre seco", "½ cucharadita de canela", "½ cucharadita de sal", "350g / 12oz de mantequilla sin sal, en cubos", "1-2 cucharadas de suero de leche, para aflojar", "700g / 1lb 9oz de azúcar glas", "color blanco perlado", "1½ cucharadita de extracto de almendra", "pasta de color negro para alimentos", "pasta de color plateado claro metálico para alimentos"], "serves": "Hace 24 galletas grandes", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 190 ° C / 170 ° Ventilador / Gas 5. Cubra una bandeja grande para hornear con papel para hornear.", "Coloque las bolsitas de té en un recipiente, cúbralas con agua hirviendo y prepare durante 5 minutos, hasta que estén muy fuertes. Retire las bolsitas de té y agregue un chorrito de licor de naranja. Remoje la fruta mezclada en el té durante 10-15 minutos, luego drene bien y reserve.", "Cuando esté frío, picar la fruta seca muy finamente, agregar zests cítricos y transferir a una mano de mortero. Moler la mezcla a una pasta.", "Ponga la harina, el azúcar, las especias y la sal en un tazón grande. Frote la mantequilla con la punta de los dedos. Agregue 3 cucharaditas de los ingredientes del almirez y el mortero. Mezcle y combine con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue solo suficiente suero de leche para unir la mezcla como una masa.", "Estire la superficie de trabajo ligeramente enharinada hasta que la masa tenga aproximadamente ½ cm de espesor. Recorta las formas con un cortador de galletas en forma de oveja y transfiérelas a la bandeja preparada. Pinchar todo con un tenedor y hornear durante 10-12 minutos o hasta que estén pálidas doradas. Dejar enfriar un poco, luego transferir a una rejilla para que se enfríe por completo.", "Para la formación de hielo, tamiza dos tercios del azúcar glas en un tazón y mezcla suficiente agua para hacer una formación de hielo espesa pero vertible. Agregue un poco de color de comida nacarada. Coloque una botella apretada en una botella y cubra uniformemente los cuerpos de las ovejas para hacer los vellones. Reserve en un lugar fresco para permitir que se forme la guinda.", "Tamice el azúcar glas restante y mezcle con el extracto de almendras y suficiente agua para formar una capa de hielo espesa. Transfiera la mitad de la formación de hielo a un recipiente aparte. Agregue el color negro de comida a uno y el plateado al otro. Poner en dos bolsas desechables con pequeñas boquillas llanas. Use la capa de hielo negro para decorar las cabezas y las patas de las ovejas y la plata para formar remolinos en sus vellones. Permita que la formación de hielo se establezca, luego sirva."]}, {"isVegetarian": true, "title": "Bara brith soplado", "url": "www_bbc_co_uk_food_recipes_bara_brith_souffls_91119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml / 10fl oz de té negro fuerte recién hecho", "40 g / 1½ oz de azúcar moreno oscuro", "100 g / 3½ oz de fruta seca mixta", "4 huevos grandes de gallinas camperas", "50 g / 1¾oz de azúcar en polvo, más extra para quitar el polvo", "30g / 1 oz de harina de maíz", "Leche 250ml / 9fl oz", "1 cucharadita de especias mixtas molidas", "azúcar en polvo, para quitar el polvo"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combina el té y el azúcar moreno oscuro en un tazón resistente al calor y revuelve hasta que el azúcar se haya disuelto. Agregue la fruta seca y cubra con una película adhesiva. Déjalo en remojo durante 1 hora.", "Escurra la fruta, inserte en un procesador de alimentos y mezcle hasta que quede suave.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Separe las claras de huevo y las yemas en dos cuencos separados. Batir las yemas con el azúcar impalpable y la harina de maíz.", "Ponga la leche y la mezcla de especias en una olla y cocine a fuego lento. Verter sobre las yemas de huevo, batir para combinar y luego volver a la sartén a fuego alto. Llevar a ebullición y cocinar durante 3 minutos, batiendo constantemente. Retirar del fuego y dejar enfriar. Batir el puré de frutas hasta que quede suave.", "Batir las claras de huevo con un batidor eléctrico de mano hasta que se formen picos suaves. Incorpore la mezcla de crema pastelera un tercio a la vez, teniendo cuidado de no eliminar el aire.", "Divida la mezcla entre cuatro moldes y alise la parte superior con una espátula. Hornea durante 18 minutos hasta que estén dorados, luego espolvorea con azúcar glas y sírvelo inmediatamente."]}, {"isVegetarian": false, "title": "Pato de Berbería con cerezas y ganache de chocolate", "url": "www_bbc_co_uk_food_recipes_barbaryduckwithcherr_91549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml / 14fl oz de vinagre de cabernet sauvignon", "125g / 4½ oz de chocolate puro", "Mantequilla sin sal 110g / 4oz, ablandada", "2 patos barbary", "1 litro / 1 pinta 15fl oz de grasa de pato", "2 dientes de ajo", "6 ramitas de tomillo fresco", "1 cucharada de aceite de oliva", "3 chalotes, picados", "1 cucharadita de azúcar en polvo", "Puerto de 300 ml / 10½ fl oz", "300ml / 10½fl oz de caldo de pollo", "sal y pimienta negra recién molida", "200g / 7oz de cerezas frescas, piedras removidas", "1 berrecho de cordero para servir (sustituya el berro de mostaza si no está disponible)"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para la ganache de chocolate, coloque el vinagre en una olla no reactiva y deje que hierva. Cocine hasta que el volumen del líquido se haya reducido a 110 ml / 4 fl oz.", "Coloque el chocolate en un tazón sobre una fuente de agua hirviendo a fuego lento (no permita que el agua toque el fondo del tazón). Calienta hasta que se derrita.", "Retire el recipiente del fuego, luego mezcle suavemente la mantequilla y el vinagre reducido. Mezcle hasta que esté bien combinado. Coloque en el refrigerador hasta que esté firme, aproximadamente dos horas.", "Para el pato, precaliente el horno a 150 ° C / 300 ° F / Gas 2. Retire las patas y los senos del pato. (No necesitarás el cadáver para esta receta, ahorra para hacer inventario de otro plato).", "Caliente una sartén grande a prueba de horno hasta que esté tibia, luego agregue las patas de pato, con la piel hacia abajo, y cocínelas durante un minuto hasta que se doren. Agregue la grasa de pato, un diente de ajo y la mitad del tomillo.", "Cocine en el horno precalentado durante 1-1½ horas, luego retire cuidadosamente las patas de pato de la grasa y manténgalo caliente.", "Mientras tanto, calentar otra sartén hasta que esté caliente. Agregue el aceite de oliva, los chalotes y el ajo y el tomillo restantes. Cocine por 2-3 minutos, o hasta que se ablanden, luego agregue el azúcar y cocine por un minuto más, revolviendo hasta que el azúcar se haya disuelto. Agregue el puerto y cocine hasta que se reduzca a un glaseado pegajoso. Agregue el caldo de pollo y cocine hasta que el volumen se reduzca a la mitad (la salsa debe ser lo suficientemente gruesa para cubrir la parte posterior de una cuchara).", "Pase la salsa a través de un tamiz de vuelta a la sartén y sazone, al gusto, con sal y pimienta negra recién molida. Agregue las cerezas y cocine por un minuto.", "Retire la piel de la pechuga de pato y agregue la piel a la sartén con las patas de pato y la grasa. Regrese al horno y cocine hasta que estén blandos, de 2 a 3 minutos. Raspe la grasa de la piel del pato cocido. Colóquelo en una bandeja para hornear, luego pese otra bandeja para hornear pesada para mantenerla plana. Regrese al horno y cocine durante 4-5 minutos, o hasta que estén crujientes.", "Sazone la pechuga de pato con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente, agregue un poco de la grasa de pato y agregue la pechuga de pato. Cocine a cada lado durante 2-3 minutos o hasta que esté cocido a su gusto. Retire de la sartén y deje reposar durante 2 a 3 minutos. Mantener caliente", "Para servir, coloque una pierna de pato en el centro de cada una de las cuatro placas. Talla los senos en tres pedazos y colócalos alrededor de la pierna.", "Coloque un pedazo de piel de pato crujiente sobre los trozos de pechuga de pato. Usando dos cucharas, forma el ganache de chocolate en quenelles de forma ovalada y coloca uno encima de cada pedazo de piel de pato crujiente. Coloque las cerezas y la salsa alrededor del pato, esparza sobre el berrendo de cordero y sirva."]}, {"isVegetarian": false, "title": "Barbacoa con costillas para el bebé con col de apio nabo", "url": "www_bbc_co_uk_food_recipes_barbecue_baby_back_ribs_42228", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/barbecue_baby_back_ribs_42228_16x9.jpg", "ingredients": ["2kg / 2lb 4oz bebé espalda costillas de cerdo, en bastidores", "2 tallos de apio, cortados, partidos por la mitad", "1 cebolla, rebanada gruesa", "2 chiles rojos, cortados por la mitad a lo largo", "1 bulbo de ajo, cortado por la mitad horizontalmente", "250ml / 9fl oz de jugo de manzana", "125ml / 4½fl oz de ketchup de tomate", "150g / 5oz de azúcar mascabado oscuro", "2 cucharadas de salsa Worcestershire", "1 cucharadita de pimentón picante ahumado", "1 cucharadita de pimentón dulce ahumado", "75ml / 2½fl oz de vinagre de vino blanco", "50ml / 2fl oz de whisky bourbon", "3 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de sidra", "300ml / 10½ fl oz aceite de colza", "1 apionabo, en juliana y colocado en agua acidulada", "2 cucharadas de perejil fresco de flatleaf", "sal marina y pimienta negra recién molida"], "serves": "Sirve 2-4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para las costillas, coloque las costillas en una cacerola grande, ancha y de base pesada con el apio, la cebolla, los chiles, el ajo y el jugo de manzana. Vierta solo el agua suficiente para cubrir el contenido de la sartén. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 1-1½ horas, o hasta que la carne esté tierna. De vez en cuando, quite cualquier espuma que salga a la superficie durante la cocción.", "Mientras tanto, para la salsa de barbacoa, caliente el ketchup y el azúcar mascabado en una sartén a fuego medio durante 2 o 3 minutos, o hasta que el azúcar se haya disuelto en el ketchup.", "Agregue la salsa Worcestershire, las paprikas ahumadas y el vinagre y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine durante 4-5 minutos, o hasta que espese. Agregue el bourbon, luego retírelo del fuego y déjelo a un lado. Refrigere cuando esté frío.", "Para la ensalada, mezcle las yemas de huevo, la mostaza y el vinagre en un tazón grande hasta que estén bien combinados. Poco a poco agregue el aceite en una corriente muy fina, batiendo continuamente, hasta que la mezcla se espese a una mayonesa liviana y todo el aceite se haya incorporado por completo.", "Escurra bien el apionabo y elimine el exceso de humedad con papel de cocina. Revuelva el apionabo y el perejil en la mayonesa y sazone, al gusto, con sal y pimienta negra recién molida. Enfriar en la nevera hasta que sea necesario.", "Cuando las costillas estén cocidas, precaliente el horno a 240C / 220C Fan / Gas 9, o tan caliente como sea posible.", "Retire las costillas del licor de caza furtiva con una cuchara ranurada y transfiera a una bandeja grande para asar. Cepille las costillas con la salsa de barbacoa, luego tueste en el horno durante 10-15 minutos, volteándolo cada cinco minutos, hasta que las costillas estén pegajosas y carbonizadas alrededor de los bordes.", "Para servir, amontone las costillas en un plato de servir y sirva el col de apio y la salsa de barbacoa restante al costado."]}, {"isVegetarian": false, "title": "Barbecue sweetcorn con chile ahumado, mantequilla de ajo", "url": "www_bbc_co_uk_food_recipes_barbecue_sweetcorn_with_51495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 mazorcas de maíz dulce", "225 g / 8oz de mantequilla sin sal, a temperatura ambiente", "2 cucharadas de jugo de limón", "2 cucharadas de hierbas frescas picadas, como el cilantro o el perejil", "2 anchoas, finamente picadas", "1 cucharada de chalote picado", "4 cucharadas de salsa de barbacoa ahumada (o ketchup ahumado)", "2 rodajas de chiles chipotle ahumados o chiles frescos", "½ cucharadita de sal", "¼ cucharadita de pimienta blanca molida"], "serves": "Hace 12 mazorcas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la barbacoa a caliente. Barbacoa el maíz hasta que esté bien cocido.", "Para la mantequilla de ajo picante ahumada, coloque todos los ingredientes en un procesador de alimentos y mezcle durante 30 segundos, o hasta que la mezcla esté brillante y suave.", "Convierta en un tazón y reserve.", "Para servir, cubra el maíz con una cucharada de mantequilla suave y sirva inmediatamente."]}, {"isVegetarian": false, "title": "Rodaballo y puerros a la parilla, girolles y almendras frescas", "url": "www_bbc_co_uk_food_recipes_barbecue_turbot_and_14289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pepino, pelado, sin semillas y finamente picado", "120 g / 4½ oz de azúcar en polvo", "175g / 6oz de vinagre de arroz", "250g / 9oz de mantequilla sin sal ablandada", "1 cucharada de mostaza Dijon", "1 limón, ralladura y jugo", "1 diente de ajo, aplastado", "1 cucharada de hojas de tomillo limón", "1 cucharadita de sal", "pizca de cayena", "Almendras molidas 15 g / ½ oz", "1 x 2kg / 4lb 8oz-3kg / 6lb 8oz de rodaballo entero (dividido en 6 tramos)", "3 puerros delgados, cortados por la mitad a lo largo", "150 g / 5½ oz pequeños girolles, limpiados", "50g / 1¾oz de mantequilla", "2 limones, solo jugo", "100 g / 3½ oz de almendras frescas, sin cáscara", "2 limones, segmentados y cortados en piezas de 2cm / ¾in", "200ml / 7fl oz de caldo de pollo", "20g / ¾oz lilliput alcaparras", "20g / ¾oz de pepino en escabeche, desde arriba", "1 cucharada de perejil finamente picado", "1 cucharadita de estragón finamente picado", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente la barbacoa.", "Para hacer el pepinillo en vinagre, coloque una cacerola pequeña a fuego medio. Agregue el azúcar y el vinagre y caliente hasta que el azúcar se haya disuelto. Retire de la sartén y agregue el pepino. Dejar de lado.", "Mezcle los ingredientes de mantequilla de limón en un tazón pequeño.", "Engrase ligeramente el rodaballo en ambos lados, sazone y coloque el lado blanco con la piel hacia abajo sobre la barbacoa. Cocine por 4 minutos y voltee. Agregue una cucharada de mantequilla de limón en cada tramo y cocine por otros 5 minutos o hasta que estén cocidos. Quítese la barbacoa y déjela descansar. Retire la piel oscura.", "Coloque los puerros en la barbacoa hasta que estén carbonizados. Ponga un poco de mantequilla de limón en cada puerro y cocine por otros 2 minutos.", "Saltear los girolles en una cacerola con un chorrito de aceite de oliva y una pizca de mantequilla de limón.", "Para la salsa, coloque una sartén a fuego medio. Agregue la mantequilla y cocínela hasta que tome un color marrón rojizo. Agregue el jugo de limón, almendras frescas y el resto de los ingredientes. Condimentar con sal y pimienta.", "Para servir, coloca el rodaballo en un plato de servir. Coloque los puerros y girolles alrededor del borde y vierta sobre la salsa."]}, {"isVegetarian": false, "title": "Envolturas de barriga de cordero a la barbacoa", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_belly_15029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 zanahoria, más o menos picada", "1 cebolla, más o menos picada", "Anís de 2 estrellas", "1 bulbo de ajo, cortado por la mitad horizontalmente", "pequeño racimo de perejil fresco", "1 chili chipotle ahumado seco", "1 x 1.75kg / 3lb 14 oz vientre de cordero, huesos eliminados", "2 cebollas rojas, finamente rebanadas", "200ml / 7fl oz de vinagre de sidra", "2 cucharadas de azúcar en polvo", "½ cucharadita de semillas de mostaza negra", "½ cucharadita de sal marina", "¼ de pepino, finamente cortado", "Pasta de chipotle 75g / 2¾oz", "275ml / 9¾fl oz de ketchup de tomate", "175ml / 6fl oz de jarabe de arce", "1 cucharada de salsa Worcestershire", "1 cucharada de vinagre de sidra", "5 cucharadas de salsa de soja ligera", "8-12 panes naan o pides (panes turcos)", "racimo pequeño de ramitas de cilantro fresco"], "serves": "Sirve 8-12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el cordero, coloca la zanahoria, la cebolla, el anís estrellado, el ajo, el perejil y el chile chipotle en una olla grande. Llene a la mitad la sartén con agua fría, luego ponga el vientre de cordero encima y vierta solo el agua suficiente para cubrir la carne. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que hierva a fuego lento y cocine a fuego lento durante 1 hora, hasta que la carne esté realmente tierna.", "Mientras tanto, para las cebollas rojas encurtidas, coloque las cebollas rojas en rodajas en un tazón, luego caliente el vinagre de sidra, el azúcar en polvo, las semillas de mostaza y la sal en una sartén no reactiva hasta que el azúcar se haya disuelto y la mezcla esté hirviendo a fuego lento.", "Vierta el líquido sobre las cebollas, agregue el pepino, revuelva bien y deje enfriar.", "Para la salsa de barbacoa, caliente una sartén no reactiva a fuego medio hasta que esté caliente, luego agregue la pasta de chipotle y saltee durante 1-2 minutos. Agregue la salsa de tomate y el jarabe de arce y saltee durante otros 2-3 minutos, o hasta que burbujee. Agregue la salsa Worcestershire, el vinagre de sidra y la salsa de soja, ponga la mezcla a ebullición, luego reduzca el fuego hasta que hierva a fuego lento y cocine a fuego lento durante 5-6 minutos, o hasta que espese. Dejar de lado.", "Cuando el cordero se haya cocinado, retírelo de la sartén con una espumadera y déjelo a un lado para drenarlo y enfriarlo.", "Precaliente el horno a 200C / 180C Ventilador / 400F / Gas 6. Caliente el pan naan o pida en el horno por unos minutos.", "Para servir, triture groseramente la carne de cordero y dobla la carne en la salsa de barbacoa tibia. Coloque la mezcla sobre el pan caliente, con algunas de las cebollas rojas encurtidas y hojas de cilantro esparcidas en la parte superior."]}, {"isVegetarian": false, "title": "Cordero a la parilla, salsa verde, ensalada de tomate, cuscús tostado y queso blanco", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_salsa_59620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pierna de cordero doble, deshuesada y pegada al mismo grosor", "medio manojo de perejil fresco", "medio manojo de menta fresca", "medio manojo de orégano fresco", "1 diente de ajo, pelado", "1 guindilla verde pequeña, sin grano", "4 cucharadas de alcaparras", "250ml / 9fl oz de aceite de oliva, más extra a llovizna", "200g / 7oz de aceitunas verdes sin hueso grandes, más o menos picadas", "100g / 3½oz de queso blanco", "copos de sal marina y pimienta negra recién molida", "50g / 13 / 4oz de mantequilla", "50ml / 2fl oz de aceite de oliva", "150g / 51 / 2oz de cuscús", "10g / 1 / 2oz de almendras, tostadas", "6 tomates heirloom, cortados en formas de igual tamaño", "4 cucharaditas de vinagre balsámico blanco", "pequeña albahaca fresca puñado, apenas rasgada"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Pon el cordero en un plato grande y poco profundo. Mezcle el perejil, la menta, el orégano, el ajo, el chile, las alcaparras y el aceite de 150 ml / 5 fl oz en un procesador de alimentos. Vierta dos tercios de la mezcla sobre el cordero, cubra con film transparente y marinado en la nevera durante 24 horas. Reserve la mezcla restante en el refrigerador, cubierto.", "Cuando esté listo para cocinar, precaliente su barbacoa a caliente.", "Para el cuscús, derrita la mantequilla con el aceite en una cacerola de base pesada a fuego medio. Agregue el cuscús y fría hasta que esté oscuro y bien tostado. Vierta 300ml / 10 fl oz oz de agua fría y cubra con película adhesiva, luego reserve.", "Mezcle las aceitunas con el aceite restante de 100 ml / 31/2 fl oz, cubra y reserve. Para la ensalada, coloque los tomates en un plato para servir poco profundo, luego espolvoree sobre el vinagre, la albahaca y una pizca de sal. Cubra y reserve.", "Cocine el cordero en la barbacoa durante 4 minutos por cada lado, o hasta que esté bien dorado pero aún rosado en el medio. Transfiéralo a un plato de servir, rocíe con aceite y déjalo reposar por 20 minutos.", "Para terminar el cuscús, tueste las almendras en una sartén caliente durante 2-3 minutos. Espolvoree el cuscús utilizando un tenedor, mezcle las almendras, un chorrito de aceite y una cucharada de salsa verde reservada y sazone con sal y pimienta.", "Coloque los tomates y el cuscús en los platos y decore con las aceitunas. Agrega una quenelle de la salsa verde. Tallar el cordero y dividir por igual entre las placas. Cuchara en el queso fresco y rociar con los jugos de reposo."]}, {"isVegetarian": false, "title": "Cordero a la parilla con calabazas al horno, anchoas, alcaparras y mantequilla marrón", "url": "www_bbc_co_uk_food_recipes_barbecued_lamb_with_55922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g / 1lb 9oz de filete de cordero o filetes de pierna de cordero, cortados en 4 porciones iguales", "aceite de oliva, para cocinar", "sal marina y pimienta", "2 calabazas de nogal, o aproximadamente 1,2 kg / 2 libras 12 oz mezcladas cebolla / calabaza espagueti, sin pelar y cortadas en cuñas delgadas", "1 guindilla roja, sin semillas, más o menos picadas", "2 dientes de ajo, pelados y toscamente picados", "Mantequilla sin sal 110g / 4oz, ablandada", "1 cucharada de flor de miel", "1 cabeza grande cavolo nero, solo hojas", "aceite de oliva virgen extra, para lloviznar", "30g / 1¼ oz de alcaparras en vinagre", "½ limón, cáscara y jugo solamente", "4 anchoas en conserva, finamente picadas"], "serves": "Sirve 4 como plato principal, 6-8 como tapa", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las porciones de cordero en un recipiente y rocíe sobre una aceituna y sazone con sal y pimienta. Deje marinar mientras la calabaza se está cocinando.", "Coloque las piezas de calabaza en una bandeja para hornear. Rocíe un poco de aceite de oliva y agregue el chile, el ajo, 50 g / 1¾ oz de la mantequilla y una buena cantidad de condimentos. Mezcle la calabaza con sus manos asegurándose de que esté completamente cubierta.", "Coloque la bandeja en el horno y cocine hasta que la calabaza comience a caramelizar, luego baje la temperatura a 160 ° C / 325 ° F / Gas 3 y continúe cocinando hasta que la calabaza esté tierna y suave. Debes girar la calabaza dos veces durante este proceso para asegurar un color uniforme y para que la calabaza no se pegue.", "Cuando la calabaza esté lista, rocíela con la miel y déjela a un lado.", "Caliente una barbacoa o una sartén a la parrilla al máximo de calor. Coloque el cordero en la parrilla o barbacoa y cocine durante 3-4 minutos en cada lado, o hasta que esté bien carbonizado y la carne todavía tenga un resorte cuando se empuja con un dedo. La carne debe ser rosada por dentro. Deje reposar la carne durante al menos cinco minutos.", "Blanquee el cavolo nero en una sartén con agua salada hirviendo, escurra bien y mezcle con un poco de aderezo y aceite de oliva virgen extra.", "Coloque una olla pequeña a fuego alto y agregue la mantequilla restante. Cocine la mantequilla hasta que tome un color marrón nuez y luego agregue inmediatamente las alcaparras, el jugo de limón y la ralladura y las anchoas. Sazone con sal y pimienta y luego apague el fuego.", "Para servir, corte el cordero en 12 piezas, dividido en platos para servir con la calabaza y el repollo y luego cuchara sobre la salsa de mantequilla."]}, {"isVegetarian": false, "title": "Sardinas asadas", "url": "www_bbc_co_uk_food_recipes_barbecued_sardines_27707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pepino, cortado por la mitad a lo largo, semillas raspadas, carne finamente picada", "1 chalote de plátano, finamente cortado en cubitos", "2 dientes de ajo, aplastados", "4 cucharadas de aceite de oliva virgen extra", "3 cucharadas de eneldo fresco picado", "3 cucharadas de hojas de menta fresca picada", "3 cucharadas de hojas de cilantro fresco picado", "2 limas, solo jugo", "16 sardinas, escamas y tripas extraídas (pida a su pescadero que haga esto por usted)", "sal marina y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Remoje cuatro pedazos de madera gruesa no tratada en agua fría, preferiblemente durante la noche.", "Treinta minutos antes de que quieras comer, enciende la barbacoa. Permita que las llamas se enciendan y se apaguen.", "Mientras tanto, mezcle el pepino, el chalote, el ajo, el aceite, las hierbas y el jugo de lima en un tazón, y sazone al gusto con sal y pimienta negra recién molida. Dejar de lado.", "Cuando las brasas estén al rojo vivo, clava cuatro sardinas por la cola en cada tablón de madera. Coloque las piezas de madera en los carbones (o alternativamente en una rejilla cerca de las brasas) y cocine durante 5-6 minutos, o hasta que las sardinas estén carbonizadas y cocidas.", "Para servir, coloque cuatro sardinas en cada plato de servir. Cucha la salsa al lado."]}, {"isVegetarian": false, "title": "Langostinos a la barbacoa en adobo de ajo y perejil", "url": "www_bbc_co_uk_food_recipes_barbecuedlangoustine_91732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cucharadas de aceite de oliva", "3 cucharadas de vinagre de vino blanco", "4 dientes de ajo, aplastados hasta formar una pasta con el filo de un cuchillo", "perejil pequeño, solo hojas, finamente picado", "sal y pimienta negra recién molida", "24 langostinos, o langostinos tigre, limpios, cabezas y caparazones retirados (reserva), desvanecidos"], "serves": "Rinde 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["En un tazón, mezcle el aceite, el vinagre de vino blanco, el ajo y el perejil en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue las langostinos y las cáscaras de langostinos reservadas a la mezcla de adobo, tape y deje enfriar en la nevera durante al menos una hora.", "Mientras tanto, enciende la barbacoa 30 minutos antes de que quieras comer. Remoje 12 pinchos de madera en agua durante 30 minutos, luego sacuda el exceso de agua.", "Cuando las brasas son de color ceniza y las langostinos se han marinado, ensarte tres langostinos en cada brocheta y colóquelos en la parrilla de la barbacoa. Cocine, voltee regularmente y hilvane con la mezcla restante de adobo, hasta que esté rosado y completamente cocido, luego sirva."]}]