[{"ingredients": ["100ml / 3½fl oz de yogur natural", "1 lima, solo jugo", "2 dientes de ajo, aplastados", "pieza del tamaño del pulgar jengibre fresco, pelado, finamente picado", "1 cucharada de semillas de cilantro molido", "1 cucharada de comino molido", "1 cucharada de sal masala", "1 cucharada de pimentón", "pizca de sal", "4 x 150 g / 5oz filetes de halibut, cortados en trozos", "50ml / 2oz de mantequilla, derretida", "1 limón, solo jugo", "1 cebolla picada", "5 dientes de ajo", "3-5 chiles rojos, semillas retiradas", "3 cucharadas de aceite de maní", "1 manojo de hojas de cilantro fresco, picado", "pedazo de pulgar de jengibre fresco, picado", "5 tomates de ciruela, picados", "1 cucharadita de cilantro molido", "2 cucharaditas de comino molido", "1 cucharadita de pimentón", "2 cucharaditas de alholva molida", "1 cucharadita de sal masala", "sal", "50ml / 2fl oz de yogurt natural", "150ml / 5fl de leche en oz", "hojas frescas de cilantro, para adornar", "arroz basmati, cocinado", "pan naan"], "method": ["Combine todos los ingredientes del adobo en un tazón. Agregue las piezas de halibut y vuélvalas a cubrir completamente. Ensarte en brochetas de madera, coloque en una bandeja para hornear, tape y deje enfriar en la nevera durante al menos dos horas.", "Precalentar la parrilla a su configuración más alta.", "Coloque los pinchos de fletán debajo de la parrilla y cocínelos, hilvanando cada dos minutos con la mantequilla y el jugo de limón, girando los pinchos hasta que estén dorados por todos lados y cocinados, aproximadamente diez minutos.", "Mientras tanto, para la salsa, coloque la cebolla, el ajo y los chiles en un procesador de alimentos y mezcle hasta que quede suave.", "Caliente el aceite de maní en una sartén a fuego lento. Agregue la mezcla de cebolla y freír durante 6-7 minutos, o hasta que estén doradas.", "Coloque las hojas de cilantro, el jengibre y los tomates en un procesador de alimentos y mezcle hasta que quede suave.", "Agregue la mezcla de tomate en la sartén y cocine durante 15-20 minutos, hasta que la mayoría del líquido se haya evaporado.", "Agregue el cilantro molido, el comino, el pimentón, la alholva y el garam masala y sazone al gusto con sal. Revuelva y cocine durante 1-2 minutos, luego mezcle gradualmente el yogur.", "Agregue la leche y aumente el fuego para llevar la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante cinco minutos.", "Para servir, coloque dos pinchos de fletán en un plato, ponga una salsa y adorne con las hojas de cilantro. Sirve con arroz basmati y naan."], "url": "www_bbc_co_uk_food_recipes_halibuttikkamasalawi_84406", "title": "Halibut tikka masala con arroz basmati", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pedazos de halibut, pesando aprox. 200g / 7¼ oz cada uno", "2 limones, solo jugo", "110 g / 4 oz de mantequilla", "sal"], "method": ["Marca el pescado con un cuchillo afilado y marina el jugo de limón durante aproximadamente 15 minutos.", "Escurrir, reservar el zumo de limón y secar con paños de cocina.", "Derrita 75 g / 3 oz de mantequilla en una sartén grande, asegurándose de que el calor sea suave y la mantequilla no se queme.", "Cocine el pescado en la mantequilla durante aproximadamente 3-4 minutos en cada lado.", "Aumente el fuego y vierta el jugo de limón del adobo; permita burbujear y evaporarse levemente.", "Agregue la mantequilla restante para espesar la salsa.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_halibutwithlemonbutt_73188", "title": "Halibut con mantequilla de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75ml / 3fl oz sake", "75ml / 3fl oz", "Pasta de miso blanca 225g / 8oz", "Azúcar granulada 110 g / 4 oz", "4 x 175g / 6oz filetes de fletán, piel en", "Lichis frescos de 110 g / 4 oz, pelados, sin piedras, en rodajas", "75g / 3oz de anacardos tostados", "1 pequeño manojo de hojas de menta", "Mango de 110 g / 4 oz, en rodajas", "1 hojas pequeñas de cilantro racimo", "1 chile rojo, finamente cortado en diagonal", "50g / 2oz de virutas de coco fresco", "110 g / 4 oz de hojas de mizuna", "50g / 2oz de hojas de cohete", "1 lima, solo jugo", "2 cucharadas de aceite de cacahuete", "sal y pimienta negra recién molida"], "method": ["Para el halibut, coloca el sake y el mirin en una sartén y lleva a ebullición. Hervir durante 20-30 segundos para quemar el alcohol; luego reduce el calor", "Agregue la pasta blanca de miso y revuelva para disolver. Vuelva a encender el fuego y agregue el azúcar, revolviendo una vez más para disolverlo.", "Retirar del fuego, transferir a un recipiente y dejar enfriar.", "Coloque un tercio del miso a un lado para la ensalada.", "Coloque los filetes de fletán en la mezcla fría de miso restante, cubra y coloque en el refrigerador durante al menos 24 horas, preferiblemente 48 horas.", "Precaliente la parrilla a alto y el horno a 200C / 390F / Gas 6.", "Retire el mero del miso y limpie cualquier exceso antes de colocarlo en la bandeja de la parrilla.", "Coloque debajo de la parrilla para cocinar por 2-3 minutos hasta que estén doradas, luego retire y coloque en el horno precalentado. Cocine durante 5-8 minutos, o hasta que el pescado esté cocido hasta el final.", "Para la ensalada, coloque todos los ingredientes de la ensalada excepto el jugo de lima y el aceite de cacahuete en un tazón y mezcle.", "Coloque dos cucharadas del miso reservado en un recipiente, agregue el jugo de lima y el aceite de cacahuete y mezcle. Sazonar con sal y pimienta negra recién molida. Agregue este aderezo a la ensalada y revuelva para combinar.", "Para servir, espolvorea la ensalada en cada uno de los cuatro platos. Corte el fletán por la mitad en la diagonal, coloque el pescado encima de la ensalada y sirva con un poco más de miso en la parte superior."], "url": "www_bbc_co_uk_food_recipes_halibutwithlycheecas_88171", "title": "Halibut con ensalada de lichi, anacardo y miso", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 200 g / 7 oz filetes de halibut, pieles eliminado", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla sin sal", "2 cucharadas de aceite de cacahuete", "Papas 350g / 12oz, peladas, cocidas en agua hirviendo y enfriadas", "200 g / 7 oz mezclada de carne de cangrejo blanca y marrón", "2 cucharadas de perejil fresco de hoja plana picada", "½ limón, solo jugo", "½ cucharadita de esencia de anchoa", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "Pan rallado japonés de 110 g / 4 oz (a menudo se vende como panko)", "5 cucharadas de aceite de cacahuete", "250g / 9oz de tomates de ciruela, cortados por la mitad", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "sal y pimienta negra recién molida", "20g / ¾oz de alcaparras saladas, lavadas y escurridas", "6 filetes de anchoa en aceite de oliva, escurridos", "40 g / 1½ oz de perejil fresco de flatleaf, solo hojas", "10g / ½ oz de estragón fresco, solo hojas", "10 g / ½ oz de menta fresca, solo hojas", "2 dientes de ajo", "1 limón, ralladura y jugo", "150ml / 5fl oz de aceite de oliva virgen extra"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Sazone los filetes de halibut con sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla, el aceite de cacahuete y los filetes de halibut y cocínelos durante tres minutos en cada lado, o hasta que estén ligeramente dorados y completamente cocidos. Cuando la mantequilla comience a burbujear y se ponga marrón, espárcela sobre la parte superior del pescado. Retire de la sartén.", "Para los pasteles de crab, ralla las papas en un tazón grande.", "Agregue la carne de cangrejo blanca y marrón, el perejil, el jugo de limón, la esencia de anchoa y el huevo y mezcle cuidadosamente hasta que se combinen. Sazonar con sal y pimienta negra recién molida.", "Enrolla la mezcla de cangrejo en ocho bolas y aplástala ligeramente con la palma de tus manos. Ruede cada empanada de cangrejo en las migas de pan japonesas.", "Caliente el aceite de cacahuete en una sartén por separado, agregue las tortas de crab en lotes, y cocine durante 3-4 minutos por cada lado hasta que estén doradas por ambos lados y cocidas.", "Para los tomates baby vine, coloque las mitades de tomate en una bandeja para hornear y rocíe con aceite de oliva y vinagre balsámico.", "Sazonar los tomates al gusto con sal y pimienta negra recién molida y cocinar en el horno durante 8-10 minutos hasta que se ablanden levemente.", "Para la salsa verde, mezcle todos los ingredientes de salsa verde en un procesador de alimentos para obtener un puré con la consistencia de crema doble. Sazone al gusto con pimienta negra recién molida.", "Para servir, vierta un poco de salsa verde en cada plato. Coloque el fletán en la parte superior y cuchara más salsa verde. Coloque dos de los pasteles de crab y una cucharada de los tomates baby vine junto a él."], "url": "www_bbc_co_uk_food_recipes_halibutwithsalsaverd_89441", "title": "Halibut con salsa verde, crabcakes y baby vine tomatoes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 175 g / 6oz de filetes de halibut", "Harina normal de 100 g / 3½ oz", "2-3 cucharadas de pimienta de cayena", "1 cucharadita de sal de apio", "1 cucharadita de ajo en polvo", "sal y pimienta negra recién molida", "2 cucharaditas de aceite", "botón de mantequilla", "150ml / 5fl oz de jugo de tomate fresco (hecho mezclando 4-5 tomates frescos y pasando por un colador para recolectar el jugo. Deseche la pulpa y las semillas).", "50ml / 2fl oz de vinagre de vino tinto", "100ml / 3½fl oz de aceite de oliva", "1 diente de ajo, finamente picado", "sal y pimienta negra recién molida", "400g / 14oz de frijoles mezclados enlatados, enjuagados y escurridos", "2 palitos de apio, finamente picado", "1 chile verde, sin semillas, picadas", "250ml / 9fl oz de yogur griego", "1 cucharada de eneldo fresco picado", "1 lima, solo jugo", "medio pepino, pelado, rallado", "sal y pimienta negra recién molida", "1 lima, cortada en rodajas, para adornar", "pequeño puñado de perejil picado, para adornar"], "method": ["Para el halibut, mezcle la harina, la pimienta de cayena, la sal de apio y el ajo en polvo en un bol y sazone bien con sal y pimienta negra recién molida. Dragar los filetes de halibut en la mezcla de harina especiada y sacudir el exceso de anty.", "Calentar el aceite en una sartén a fuego medio. Agregue la mantequilla, y cuando comience a formar espuma agregue el pescado.", "Cocine los filetes de halibut durante tres minutos en cada lado, o hasta que estén recién cocidos. (Si los filetes son muy gruesos, transfiéralos al horno precalentado a 180 ° C / 365 ° F / Gas 4 y ase durante otros 4-6 minutos o hasta que estén completamente cocidos).", "Para la ensalada de frijoles, mezcle el jugo de tomate, el vinagre de vino tinto, el aceite de oliva y el ajo en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar los frijoles mezclados, el apio y el chile y mezclar bien.", "Para el tzatziki, mezcle el yogur, el eneldo y el jugo de lima en un tazón limpio.", "Agregue el pepino rallado y la temporada, al gusto, con sal y pimienta negra recién molida. (Diluir la mezcla con agua si es necesario)", "Para servir, coloque una cucharada grande de la ensalada de frijoles en cada tazón de servir. Coloque un trozo de fletán encima de cada uno y coloque una cucharada de tzatziki al costado.", "Adorne con trozos de lima y perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_halibutwithbeansalad_89688", "title": "Fletán con ensalada de frijoles y tzatziki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "12 cebollas de primavera, cortadas, en rodajas", "1 diente de ajo, aplastado hasta formar una pasta con el filo de un cuchillo", "12 champiñones silvestres frescos, lavados a fondo para eliminar la arena, en rodajas", "75ml / 2¾fl oz de vino blanco", "300 ml / 10 fl oz doble crema", "sal y pimienta negra recién molida", "1 limón, solo jugo", "1 cucharada de estragón fresco picado", "100 g / 3½ oz de harina, para quitar el polvo", "sal y pimienta negra recién molida", "100 g / 3½ oz de mantequilla", "4 x 175 g / 6¼ oz de filetes de fletán", "100 g / 3½ oz de hojas frescas de espinaca, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la salsa, caliente la mantequilla en una sartén a fuego medio. Agregue las cebolletas, el ajo y los champiñones y fríe durante 8-10 minutos, o hasta que estén blandos.", "Agregue el vino y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que el líquido se haya evaporado casi por completo.", "Agregue la crema y continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido en un tercio. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar el jugo de limón y el estragón.", "Mientras tanto, para el halibut, espolvoree la harina en un plato y sazone, al gusto, con sal y pimienta negra recién molida. Dragar los filetes de halibut en la harina hasta que estén completamente cubiertos, sacudiendo cualquier exceso.", "Calentar la mantequilla en una sartén a prueba de horno a fuego medio. Agregue los filetes de halibut recubiertos, en tandas si es necesario, y freír durante 2-3 minutos en cada lado.", "Transfiera la sartén al horno y continúe cocinando el halibut por otros 6-8 minutos, o hasta que esté recién cocido. (NB: El halibut se cuece cuando la carne es opaca).", "Para servir, coloque un puñado de hojas crudas de espinaca en el centro de cada una de las cuatro placas para servir. Coloque un filete de halibut encima de cada uno. Cuchara sobre la salsa de crema de cebolla de primavera."], "url": "www_bbc_co_uk_food_recipes_halibutwithspringoni_92292", "title": "Fletán con salsa de crema de cebolla de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de halibut 4 x 150 g / 5½ oz", "125g / 4½oz de harina natural", "sal y pimienta negra recién molida", "pizca de pimentón", "1 cucharadita de aceite vegetal", "1 cucharada de mantequilla sin sal", "Tocino tocino de 200 g / 7 oz", "Fechas de 200g / 7oz, piedras removidas, picadas", "1 cucharada de pasta Harissa preparada", "75ml / 2¾oz de vino de Madeira", "100 ml / 3½ fl oz de caldo de pollo", "20 aceitunas Kalamata negras", "200g / 7oz de trigo o cuscús cocidos cocidos", "4 cuñas de limón", "1 cucharada de perejil fresco picado"], "method": ["Espolvorear la harina en un plato y sazonar, al gusto, con sal y pimienta negra recién molida y una pizca de pimentón. Dragar los filetes de halibut en la mezcla hasta que esté completamente cubierto.", "Calentar el aceite vegetal en una sartén a fuego medio. Cuando el aceite esté caliente, agregue los filetes de halibut sazonados y fríalos por 2-3 minutos por cada lado, o hasta que estén dorados por ambos lados.", "Coloque una perilla de la mantequilla encima de cada filete de halibut y continúe cocinando. Cuando la mantequilla se haya derretido, hilvana los filetes en la mantequilla derretida hasta que estén completamente cocidos, luego exprime el jugo de limón y coloca los filetes de fletán a un lado en un plato caliente.", "Mientras tanto, para la salsa harissa picante, fría el tocino en una sartén por separado durante 6-8 minutos, o hasta que esté crujiente y dorado. Agregue las fechas y harissa paste y mezcle bien para combinar, luego reduzca el fuego y continúe cocinando por 2-3 minutos.", "Agregue el vino de Madeira, el caldo y las aceitunas y continúe cocinando por otros 4-5 minutos, o hasta que el volumen del líquido se haya reducido y la salsa se haya espesado.", "Para servir, divida el trigo bulgar o el cuscús por igual entre cuatro platos para servir. Coloque un filete de fletán frito encima de cada uno. Verter sobre la salsa de estilo marroquí y adornar con una rodaja de limón. Espolvorea sobre el perejil fresco picado."], "url": "www_bbc_co_uk_food_recipes_halibutwithmoroccans_91624", "title": "Halibut con salsa harissa picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de cuscús", "125ml / 4½fl oz de caldo de verduras calientes", "5 cucharadas de aceite de oliva", "1 limón, solo jugo", "1 pimiento rojo asado, rallado", "50g / 2oz de almendras copos tostadas", "50 g / 2 oz de albaricoques secos, picados", "Queso halloumi de 200g / 7oz, cortado en cubos de 2.5cm / 1 pulgada", "8 tomates cherry", "8 setas de botón", "3 cucharadas de aceite de oliva", "1 cucharadita de orégano seco", "manojo de perejil, solo hojas picadas", "manojo de albahaca picada, solo hojas picadas", "manojo de menta picada, solo hojas picadas", "2 cucharadas de alcaparras escurridas", "2 dientes de ajo, picados", "½ cucharadita de mostaza Dijon", "100ml / 3½fl oz de aceite de oliva", "sal marina y pimienta negra recién molida para sazonar"], "method": ["Para el cuscús, coloca el cuscús en un recipiente y cúbrelo con el caldo caliente. Cubra el recipiente con un plato o película adhesiva y déjelo durante cuatro minutos.", "Descubre el cuenco y esponja el cuscús con un tenedor. Agregue el resto de los ingredientes, sazone al gusto con sal y pimienta negra recién molida.", "Para los kebabs, precaliente una sartén a fuego medio-alto. Mezcle todos los ingredientes del kebab y sazone al gusto con sal marina y pimienta negra recién molida. Pase los ingredientes por los pinchos de kebab de metal y cocine en la plancha caliente durante 5-6 minutos, volteándolos con frecuencia.", "Para la salsa verde, coloque todos los ingredientes de salsa verde, aparte del aceite de oliva, en un procesador de alimentos y mezcle, agregando gradualmente el aceite hasta que tenga una pasta suelta.", "Para servir, espolvoree el cuscús en los platos, cubra con los kebabs y rocíe con la salsa verde."], "url": "www_bbc_co_uk_food_recipes_halloumi_and_mushroom_59313", "title": "Brochetas de Halloumi y champiñones con salsa verde y cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite de oliva", "Bloque halloumi 225g / 8oz o queso kefalotiri", "1 huevo pequeño de granja, golpeado", "3 cucharadas de sémola fina", "2 cucharadas de miel clara", "1 cucharadita de semillas de sésamo negro", "1 cucharadita de orégano seco", "pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una sartén antiadherente.", "Corta el halloumi horizontalmente por el medio. Sumerja las rodajas de halloumi en el huevo batido y luego enrolle la sémola. Freír a fuego medio durante unos minutos en cada lado hasta que estén doradas.", "En una sartén pequeña y separada, caliente la miel. Sirve el halloumi cortado en cuadrados, rociado con miel caliente y espolvoreado con semillas de sésamo, orégano y pimienta negra."], "url": "www_bbc_co_uk_food_recipes_halloumi_saganaki_92664", "title": "Halloumi saganaki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_saganaki_92664_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75ml / 2½fl oz de aceite de oliva", "1 cucharadita de sal de cebolla", "1 cucharadita de ajo en polvo", "1 cucharadita de hojuelas de chile", "1 cucharada de hojas secas de fenogreco", "Halloumi de 500 g / 1lb 2 oz, cortado en cubos de 2 cm / 1 in", "400 g / 14oz de sandía, cortada en cubos de 2 cm / 1 in", "Pan blanco 150g / 5½oz, cortado en cubos de 2cm / 1in", "Pasta de tamarindo 95g / 3½ oz", "60g / 2¼oz de miel que moquea", "½ cucharadita de canela", "1 cebolla roja pequeña, finamente picada"], "method": ["Remoje ocho pinchos de madera en agua fría durante 15 minutos.", "Para hacer el adobo, coloque todos los ingredientes en una jarra y mezcle.", "Vierta agua recién hervida sobre el halloumi en un recipiente y déjela durante 20 minutos. Esto hará que el queso sea realmente suave y liso en el centro cuando esté cocido.", "Para hacer los pinchos, escurra el halloumi, luego coloque en un tazón grande con la sandía y el pan. Rocíe sobre el adobo y mezcle con las manos. Pinche cubos de halloumi, sandía y pan alternativamente hasta que se quede sin pinchos. Si queda adobo, rocíe sobre los pinchos.", "Para la salsa, mezcle la pasta de tamarindo, 100 ml / 3½ fl oz de agua, miel, canela y cebolla roja juntos en un tazón. Dejar de lado.", "Coloque una sartén a fuego alto y cepille ligeramente o rocíe con un poco de aceite. Planche los pinchos durante aproximadamente 6 minutos, volteándolos cada 1-2 minutos para que carbonice cada lado. Alternativamente, puede cocinarlos debajo de la parrilla durante 8-10 minutos, volteándolos de vez en cuando. Sirve los pinchos con la salsa de tamarindo."], "url": "www_bbc_co_uk_food_recipes_halloumi_and_watermelon_74518", "title": "Pinchos de Halloumi y sandía con salsa de tamarindo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 8 pinchos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_and_watermelon_74518_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de cuscús", "Halloumi de 80 g / 3 oz, en rodajas", "1 tomate, cortado en trozos de 1cm / ½ en trocitos", "¼ de pepino, cortado en trozos de 1cm / ½ en", "5 aceitunas negras, picadas", "2 ramitas de menta, hojas recogidas", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida"], "method": ["Cocine el cuscús según las instrucciones del paquete.", "Caliente una sartén a fuego alto. Agregue las rebanadas de halloumi y la plancha durante 3-4 minutos, o hasta que aparezcan rayas doradas en la superficie del queso.", "Coloque el cuscús en el recipiente que planea comer y agregue el halloumi, el tomate, el pepino, las aceitunas y la menta.", "Rocíe abundantemente con el aceite y sazone con sal y pimienta. Coma enseguida o prepare su fiambrera lista para llevar al trabajo."], "url": "www_bbc_co_uk_food_recipes_halloumi_tomato_cucumber_92076", "title": "Cuenco de granos de Halloumi, tomate, pepino y cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_tomato_cucumber_92076_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 chiles rojos frescos", "2 cucharadas de miel líquida", "1 lima, partida a la mitad", "225 g / 8 oz de halloumi de queso, en rodajas en 8 piezas", "hojas de ensalada de su elección", "aceite de oliva virgen extra a gusto"], "method": ["Rebana 2 de los chiles, dejando las semillas adentro, luego desmiembra el tercero y córtalo en dados finos (esto es para un fuego completo, puedes sembrar más cautelosamente si lo deseas) y agrega a un recipiente pequeño - idealmente, el género se vende como una sartén para derretir mantequilla, junto con la miel, y se exprime en 1 cucharadita de jugo de lima de la mitad de la lima. Coloque la bandeja en el aro más pequeño de la placa de cocción y llévela a una burbuja, baje la temperatura y deje que se evapore durante 4 minutos. Revuelva con frecuencia y no deje la sartén sin supervisión, de lo contrario, pasará espuma sobre la placa. Retire del fuego.", "Antes de dirigirse al halloumi, coloque unas cuantas hojas de ensalada en 2 platos y vierta sobre ellas la cantidad de aceite que desee. Corte la mitad restante de lima en trozos, y haga estallar una en cada plato si así lo desea.", "Caliente una sartén de hierro fundido o de base pesada. Cuando esté caliente, agregue las rodajas de halloumi y cocínelas - sin aceite en la sartén - durante 30-60 segundos hasta que estén a rayas de tigre por debajo, luego gire las rebanadas y cocínelas hasta que la parte inferior quede también bronceada.", "Retire el halloumi de los platos revestidos de ensalada y coloque sobre el queso los trozos de chile pintados de rojo en su glaseado de miel. Comer de inmediato No es difícil de hacer."], "url": "www_bbc_co_uk_food_recipes_halloumi_with_quick_69971", "title": "Halloumi con salsa rápida de chile picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloumi_with_quick_69971_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Halloumi 250 g / 9 oz", "Harina sazonada 90ml / 6tbsp", "200 g / 7oz de hojas de ensalada mixtas", "1 mango maduro, pelado, apedreado y en rodajas", "1 cucharada de menta, finamente picada", "150ml / 5fl oz de yogurt natural", "½ limón, solo jugo", "sal y pimienta negra recién molida", "3 cucharadas de aceite de cacahuete", "125g / 4oz de tomates cherry, cortados a la mitad", "ramitas de menta, para adornar"], "method": ["Corta el halloumi en ocho rebanadas y luego córtalas por la mitad. Cubra la harina sazonada y déjela a un lado.", "Coloque las hojas de la ensalada en cuatro platos para servir y coloque rebanadas de mango encima.", "Para preparar el aderezo, mezcle la menta picada, el yogur y el jugo de limón en un tazón y sazone al gusto.", "Caliente el aceite en una sartén o plancha antiadherente y fría rápidamente el halloumi durante aproximadamente 2 minutos por cada lado, hasta que se dore.", "Coloque cuatro piezas de halloumi en cada cama de hojas y rocíe con un poco del aderezo.", "Adorne con tomates cherry y ramitas de menta y sirva inmediatamente con aderezo extra en el lado."], "url": "www_bbc_co_uk_food_recipes_halloumiandmangowith_1048", "title": "Halloumi y mango con aderezo de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Queso halloumi 150g / 5oz", "½ limón, jugo", "20ml / 1oz de aceite de oliva", "pimienta negra rajada al gusto"], "method": ["Cortar el halloumi en ½ cm / ¼ en rebanadas gruesas.", "Cocine a la parrilla o fríe el queso en el aceite de oliva.", "Rocíe el jugo de limón y la pimienta negra agrietada y sirva."], "url": "www_bbc_co_uk_food_recipes_halloumicheeselemono_13052", "title": "Queso Halloumi, limón, aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "25 g / 1 oz de cacao en polvo", "1½ cucharadita de polvo de hornear", "150 g / 5 oz de azúcar en polvo", "150 g / 5oz de mantequilla sin sal ablandada a temperatura ambiente", "1 huevo de gallinas camperas", "8 cucharadas de leche", "125g / 4½oz de mantequilla sin sal, ablandada", "250 g / 9 oz de azúcar glas, cernida", "1 cucharada de leche", "1 cucharadita de extracto de vainilla", "pasta colorante para alimentos verdes", "pasta roja para colorear alimentos", "Ojos dulces comestibles", "chispas de chocolate", "hojuela de chocolate, desmenuzada", "giros suaves de regaliz negro"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Alinee una bandeja para muffins con 9 cajas de papel.", "Tamiza la harina, el cacao en polvo y el polvo de hornear en un bol. Agregue el azúcar y la mantequilla y bata la mezcla hasta que esté bien combinada.", "Agregue el huevo y la leche hasta que la mezcla esté espesa y suave.", "Divida la mezcla entre la caja de papel y hornéela en el horno durante 20-25 minutos, o hasta que el contacto sea flexible y la broche insertada en el centro de uno de los pasteles salga limpia. Dejar de lado para enfriar en una rejilla de alambre.", "Coloque la mantequilla en un tazón grande y bata con un batidor de mano eléctrico hasta que esté suave y esponjosa.", "Tamice el azúcar glas, luego trabaje en la mantequilla, comenzando lentamente al principio y luego batiendo con más fuerza una vez que todo el azúcar se haya combinado.", "Agregue la leche y la vainilla, luego bata hasta que quede cremoso y suave.", "Guarde 1 cucharada de glaseado para colorear rojo. Colorea el resto del glaseado verde (puede que necesites agregar la menor cantidad de rojo para hacer un color verde oliva).", "Coloque una cucharada colmada de glaseado en cada magdalena. Use una espátula para alisar los lados en ángulo y aplanar la parte superior.", "Decora con giros de regaliz, ojos de caramelo, chocolate descascarillado y chispas de chocolate. Use el glaseado rojo para dibujar en los puntos de sutura con un palito de cóctel."], "url": "www_bbc_co_uk_food_recipes_halloween_40352", "title": "Halloween Franken-cupcakes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 9 cupcakes grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_40352_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla, ablandada, más extra para engrasar", "250 g / 9 oz de azúcar en polvo", "4 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de extracto de vainilla", "Harina de auto crianza de 200g / 7oz", "50 g / 2 oz de cacao en polvo", "350 g de harina común", "½ cucharadita de jengibre molido", "1 cucharadita de bicarbonato de soda", "100 g / 3½ oz de mantequilla, cortada en cubos", "175g / 6oz de azúcar morena suave y ligera", "4 cucharadas de jarabe de oro", "1 huevo de gallinas camperas, ligeramente golpeado", "glaseado blanco (como el glaseado real), para decorar las galletas", "125g / 4½oz de mantequilla, suavizada", "250 g / 9 oz de azúcar glas", "2 cucharadas de cacao en polvo", "1 cucharada de leche", "½ paquete de galletas Oreo o bourbon", "1 paquete de palitos de chocolate (como Matchmakers)", "dulces de halloween"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase y forme una lata de pastel rectangular de 20x30 cm / 8x12 pulgadas con papel de hornear.", "Batir la mantequilla y el azúcar con una batidora de mano hasta que la mezcla esté pálida y esponjosa. Agregue los huevos un poco a la vez, batiendo bien entre cada adición, agregando el extracto de vainilla con el último del huevo.", "Tamiza la harina y el polvo de cacao en un bol. Dobla la mezcla de harina en la mezcla de mantequilla hasta que esté completamente incorporada.", "Con una cuchara, coloque la masa para pasteles en la lata preparada y alise la superficie con el dorso de una cuchara.", "Hornee por 30 minutos hasta que esté firme al tacto (un pincho de madera insertado en el centro debe salir limpio).", "Deje que se enfríe durante 10 minutos en la lata antes de pasar a una rejilla para que se enfríe por completo.", "Para las piedras sepulcrales de galletas de jengibre, coloque la harina, el jengibre y el bicarbonato de soda en un tazón. Frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a finas migas de pan.", "Agregue el azúcar, el jarabe y el huevo y mezcle hasta que forme una masa suave. Envuelva la película adherida y deje enfriar en la nevera durante 30 minutos.", "Precaliente el horno a 180C / 350F / gas 4.", "Estira la masa sobre una superficie ligeramente enharinada y corta tus formas; solo necesitarás unas pocas para el pastel, así que corta algunas otras formas de Halloween para galletas adicionales.", "Coloque las formas en las bandejas para hornear engrasadas y hornee en el horno durante 10-12 minutos. Retire de las hojas con una espátula y colóquelo sobre una rejilla para que se enfríe por completo antes de decorar con una capa de hielo blanca.", "Para la crema de mantequilla, bata la mantequilla en un tazón grande con un mezclador de mano hasta que quede cremoso y luego agregue el azúcar glas una cucharada por vez, batiendo bien entre cada adición. Agregue el cacao en polvo y la leche y bata otra vez durante otros cinco minutos hasta que esté suave y esponjoso.", "Mezcle las galletas Oreo o bourbon en finas migas en un procesador de alimentos.", "Extiende la crema de mantequilla sobre la torta enfriada, cubriendo la parte superior y los lados - no te preocupes si no es lisa - algunos bultos y protuberancias la harán más fangosa.", "Rompe los palitos de chocolate por la mitad de manera desigual, luego pégale alrededor de la torta para formar la cerca.", "Espolvoree el suelo de galletas sobre la superficie antes de pegar en las lápidas y decorar con dulces espeluznantes."], "url": "www_bbc_co_uk_food_recipes_halloween_cake_10801", "title": "Pastel de Halloween", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_cake_10801_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla, suavizada", "250 g / 9 oz de azúcar en polvo", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de extracto de vainilla", "Harina normal 150g / 5½ oz", "Harina de auto crianza de 75g / 2½ oz", "1 cucharadita de bicarbonato de soda", "50 g / 2 oz de cacao en polvo", "200ml / 7fl oz de suero de leche o yogur natural", "Azúcar 250 g / 9 oz", "120g / 4½ oz de jarabe dorado", "4 huevos de gallinas camperas, solo para blancos", "2 cucharadas de hilos de azúcar de chocolate"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4. En línea doce moldes para muffins con cajas muffin.", "Para los pasteles, bata la mantequilla y el azúcar con una batidora manual hasta que quede muy ligera y esponjosa. Agregue los huevos un poco por vez, batiendo bien después de cada adición. Agregue el extracto de vainilla con el último del huevo.", "Tamiza las harinas, el bicarbonato de sodio y el cacao en un tazón grande.", "Doble suavemente la mezcla de harina en la mezcla de mantequilla junto con el suero de leche hasta que esté completamente combinada y suave.", "Coloque una cucharada sopera de la mezcla en cada caja de muffins y luego hornee en el horno durante 20 minutos hasta que esté firme al tacto.", "Colocar sobre una rejilla para enfriar.", "Para la formación de hielo, coloque el azúcar, el jarabe dorado y cuatro cucharadas de agua en una cacerola grande. Calienta suavemente, revolviendo hasta que el azúcar se haya disuelto.", "Ponga a hervir el jarabe de azúcar y cocínelo durante unos 5-6 minutos hasta que el jarabe alcance los 115ºC / 239F cuando se lo mida con un termómetro de azúcar. Retire la sartén del fuego.", "Mientras el almíbar está hirviendo, en un tazón grande bata las claras de huevo con una batidora manual hasta que se formen picos suaves cuando se quite la batidora. Luego, con la batidora a baja velocidad, vierta el jarabe de azúcar en un flujo constante y suave: tenga cuidado de no echar el jarabe en los batidores, ya que puede salpicar en sus manos.", "Una vez que se ha agregado todo el jarabe, aumente la velocidad del mezclador y mezcle durante aproximadamente 10 minutos hasta que el glaseado esté completamente frío, espeso y brillante. No escatime en los latigazos o su formación de hielo será demasiado suave y sus fantasmas se combarán.", "Coloque el glaseado en una manga pastelera equipada con una boquilla grande y lisa. Pipe un círculo de glaseado en cada magdalena. Luego, sosteniendo la bolsa en posición vertical sobre el centro del pastel, vierta un alto montículo de hielo, luego retire rápidamente la punta para formar un pequeño pico en la parte superior.", "Agregue mechones de chocolate para los ojos o cualquier decoración que desee. El glaseado de merengue se mantendrá fuera de la nevera (el jarabe de azúcar habrá pasteurizado la clara de huevo), pero asegúrese de que no se caliente demasiado o que el merengue se derrita."], "url": "www_bbc_co_uk_food_recipes_halloween_ghost_cupcakes_04170", "title": "Cupcakes de fantasmas de Halloween", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 18 pastelitos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_ghost_cupcakes_04170_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de jugo de arándano", "1,5 litros / 2½ pintas de limonada", "3 limas, solo jugo", "gran puñado de gusanos gomosos"], "method": ["Vierta todos los ingredientes en un tazón de vidrio grande y mezcle hasta que estén bien combinados.", "Coloque los gusanos gummi sobre el borde del tazón."], "url": "www_bbc_co_uk_food_recipes_halloween_punch_45819", "title": "Golpe de Halloween", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloween_punch_45819_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal, ablandada a temperatura ambiente", "100 g / 3½ oz de azúcar en polvo", "1 huevo de gallinas camperas, ligeramente golpeado", "Harina normal de 275g / 10oz", "1 cucharadita de extracto de vainilla", "Para decorar", "400g / 14oz de azúcar glasé", "3-4 cucharadas de agua", "2-3 gotas de colorantes de alimentos"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Cubra una bandeja para hornear con papel resistente a la grasa.", "Batir la mantequilla y el azúcar juntos en un bol hasta que se combinen.", "Batir el huevo y el extracto de vainilla, poco a poco, hasta que estén bien combinados.", "Agregue la harina hasta que la mezcla se una como masa.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 1 cm / ½ pulg.", "Usando cortadores de galleta estilo Halloween, corte los bizcochos de la masa y colóquelos cuidadosamente sobre la bandeja para hornear.", "Hornee los bizcochos por 8-10 minutos, o hasta que estén pálidos dorados. Poner a un lado para endurecer durante 5 minutos, luego enfríe en una rejilla de alambre.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y agregue suficiente agua para crear una mezcla suave. Agregue el colorante de alimentos.", "Cuidadosamente, extienda el glaseado sobre los bizcochos con un cuchillo y déjelo a un lado hasta que la formación de hielo se endurezca."], "url": "www_bbc_co_uk_food_recipes_halloweenbiscuits_93840", "title": "Galletas de Halloween", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6-8 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/halloweenbiscuits_93840_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cangrejos enteros frescos", "jengibre de raíz de pieza pequeña, en rodajas", "1 tallo de limoncillo, magullado", "4 hojas de lima Kaffir, magulladas", "1 chalote, picado", "salpicaduras de salsa de pescado, más extra para servir", "2 filetes de pescado blanco de su elección", "Fideos fideos 200 g / 7 oz, cocidos y cortados en longitudes manejables", "50g / 2oz cebolleta", "1 guindilla grande, cortada longitudinalmente y sin semillas", "2 puñados de rao ram herb fresco, picado (disponible en algunas tiendas asiáticas. Puedes sustituir una mezcla de cilantro fresco y menta)", "1 lima, cortada en cuñas", "pimienta negra recién molida, al gusto"], "method": ["Pon los cangrejos en una sartén y cúbrelos con agua. Agregue el jengibre, limoncillo, hojas de lima kaffir, chalota y un toque de salsa de pescado. Cubra con una tapa y deje que hierva. Cocine a fuego lento durante 10-15 minutos. Retire los cangrejos y déjelos enfriar.", "Mientras tanto, coloque el pescado blanco en el caldo caliente en el que se cocinó el cangrejo y déjelo cocer en su calor residual.", "Elige la carne de los cangrejos. Reserve la carne blanca para la sopa y use la carne oscura para otro plato.", "Coloque los fideos en un tazón para servir, luego agregue las cebolletas, la carne de cangrejo, el chile, la hierba rao ram y las rodajas de lima.", "Vuelva a hervir el caldo y cocine sobre los fideos, junto con un trozo de pescado blanco.", "Sirva con salsa de pescado y pimienta negra recién molida al costado."], "url": "www_bbc_co_uk_food_recipes_halongcrabandwhitefi_81506", "title": "Sopa larga de los vermicelli de los cangrejo y de los pescados blancos con la hierba del ram de Rao", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]