[{"ingredients": ["2 cucharadas de aceite de oliva", "pizca de cayena", "sal y pimienta negra recién molida", "1 muslo de pollo, hueso retirado", "1 cucharada de miel clara", "1 cucharada de semillas de sésamo", "2 cucharadas de aceite de oliva", "1 chile rojo, picado", "2 cucharadas de perejil fresco picado", "Arroz de grano largo de 150 g / 5 oz, cocinado según las instrucciones del paquete", "sal y pimienta negra recién molida", "2 cebolletas frescas enteras"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo con semillas de sésamo y miel, caliente un recipiente a prueba de horno a fuego medio. Mezcle el aceite de oliva, la pimienta de cayena y el condimento en un tazón y cubra el pollo con la mezcla.", "Freír el pollo durante 3-4 minutos en una sartén a prueba de horno a fuego medio, o hasta que esté crujiente y dorado. Rocíe la miel sobre el pollo y hornee en el horno durante 10-12 minutos, o hasta que el pollo esté bien cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho). Retire el pollo del horno y espolvoree con las semillas de sésamo.", "Para el chile y el arroz perejil, caliente una cucharada de aceite en una sartén separada a fuego medio. Freír el chile, el perejil y el arroz durante 4-5 minutos, y sazonar al gusto con sal y pimienta negra recién molida.", "Para servir, cepille el interior de una taza de té o similar con el aceite restante. Coloque la mezcla de chile y perejil en la taza, presione el arroz hacia abajo para que el arroz se amolde a la taza, y luego ponga el arroz en un plato. Coloque la miel y el pollo con semillas de sésamo encima del arroz y decore con cebolletas frescas."], "url": "www_bbc_co_uk_food_recipes_honeysesameseedchick_89442", "title": "Pollo con semillas de sésamo y miel con chile y arroz perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, sin piel, cortada en tiras", "dash aceite de oliva", "½ naranja, jugo y ralladura", "15g / ½ oz de raíz de jengibre fresco, rallado", "1 cucharada de miel clara", "sal y pimienta negra recién molida", "Fideos de huevo 150 g / 5½ oz", "dash aceite de oliva", "½ zanahoria, cortada en cintas finas", "1 diente de ajo, finamente picado", "pizca de pimentón", "25 g / 1 oz de raíz de jengibre fresco, finamente cortado en cerillas", "pizca de copos de chile seco", "2 cucharadas de salsa de soja", "½ naranja, ralladura y jugo", "1-2 cucharaditas de aceite de sésamo", "pequeño puñado de perejil fresco, picado"], "method": ["Para el pollo chamuscado, rocíe el pollo con aceite de oliva. Calentar una sartén y freír el pollo durante 1-2 minutos. Agregue el jugo de naranja y la ralladura, el jengibre, la miel, la sal y la pimienta negra recién molida y fría por otros 1-2 minutos, o hasta que estén dorados y cocidos.", "Para los fideos, cocinar los fideos de acuerdo con las instrucciones del paquete y escurrir.", "Calentar el aceite de oliva en un wok, agregar las cintas de zanahoria y freír suavemente durante 1-2 minutos. Agregue el ajo, pimentón, rodajas de jengibre y hojuelas de chile y fría por un minuto. Agregue la salsa de soja, el jugo de naranja y la ralladura y el aceite de sésamo y fríelos por un minuto más. Agregue el perejil fresco picado y los fideos cocidos.", "Para servir, apile los fideos en un plato para servir y cubra con el pollo chamuscado."], "url": "www_bbc_co_uk_food_recipes_honeysearedchickenwi_88188", "title": "Pollo a la miel con zanahoria y jengibre frito fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 higos frescos", "2 cucharadas de miel clara", "30 g / 1 oz de mantequilla, en cubos", "2 ramitas de tomillo fresco", "2 rebanadas de brioche, a la parrilla", "crema de vainilla lista para usar, calentada, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta una cruz en la parte superior de cada higo y aprieta ligeramente la parte inferior para abrirla. Coloque en un plato gratinado, rocíe la miel, la mantequilla y el tomillo y hornee por 6-7 minutos.", "Retire del horno y coloque encima del brioche a la parrilla en un plato para servir. Vierta sobre la crema caliente de vainilla y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_honeythymeandfigbrus_87365", "title": "Brioche de miel, tomillo e higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 higos", "2 cucharaditas de vinagre balsámico", "1 cucharada de miel", "1 ramita de tomillo fresco, solo hojas", "100 ml / 3½ fl oz yogur de estilo griego", "½ cucharadita de canela molida", "1 cucharada de miel", "1 naranja, ralladura y un chorrito de jugo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para los higos tostados, corte la parte superior de los higos y haga una cruz en la parte superior de cada uno. Aprieta suavemente para abrir los higos ligeramente.", "Coloque los higos en un trozo grande de papel de aluminio y rocíe con el vinagre balsámico, la miel y el tomillo. Selle para hacer un paquete al juntar los bordes.", "Caliente una sartén a prueba de horno y coloque el paquete en la sartén.", "Transfiera la sartén al horno y tueste durante cinco minutos. Coloque el paquete en un plato de servir.", "Para la miel y el yogur de naranja, coloque el yogur, la canela, la miel, la ralladura de naranja y el jugo en un tazón pequeño y mezcle bien.", "Para servir, abra el paquete de higos y cubra con el yogur."], "url": "www_bbc_co_uk_food_recipes_honeythymeandbalsami_86176", "title": "Higos de miel, tomillo e hinojo balsámico con miel y yogur de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de fideos de arroz planos doblados", "1 cucharadita de aceite de sésamo tostado", "Filete de eglefino entero de 200 g / 7 oz, sin piel, más o menos picado", "Calamares de 100g / 3½ oz, limpios, toscamente picados", "pellizcar copos de sal marina", "pizca de pimienta blanca molida", "1 cucharadita de salsa de ostras", "1 cucharadita de vino de arroz Shaoxing (o jerez seco)", "1 clara de huevo grande de gallinas camperas", "1 cucharada de harina de maíz", "1 cucharada de tallos de cilantro en rodajas finas", "aceite de colza, para freír", "puñado de hojas de col rizada", "1 cucharadita de sal marina finamente molida", "1 cucharadita de pimienta blanca molida", "3 cucharaditas de azúcar", "algunas ramitas hojas de cilantro", "1 cucharada de aceite de colza", "1 cucharada de raíz de jengibre recién rallado", "3 hongos shiitake, tallos eliminados, en rodajas", "100 g / 3½ oz de tofu ahumado, cortado en finas porras", "1 cucharadita de salsa de soja oscura premium", "2 cucharadas de salsa de soja ligera", "1 cucharada de salsa de ostras (opcional)", "pizca de azúcar en polvo", "100g / 3½oz de brotes de soja sin procesar, lavados", "1 racimo grande (4-5) de cebollas moradas en juliana", "1 cucharada de aceite de sésamo tostado", "1 cucharadita de aceite de chile"], "method": ["Ponga a hervir 1,5 litros / 2½ litros de agua y agregue los fideos de arroz secos. Cocine durante 10 minutos hasta que esté al dente, escurra con agua fría, rocíe sobre el aceite de sésamo y revuelva para evitar que se peguen los fideos. Dejar de lado.", "Para las bolas de cilantro, coloque el eglefino y el calamar picados en un procesador de alimentos, agregue la sal, pimienta blanca molida, salsa de ostras, vino de arroz Shaoxing, clara de huevo y harina de maíz, y mezcle bien con una pasta ligera.", "Coloque la cuchara en un recipiente, espolvoree sobre los tallos de cilantro finamente picados y mezcle bien. Usando dos cucharas, forme bolas: la mezcla debe hacer 12 bolas de 3.5cm / 1¾ de diámetro.", "Quater-llene una freidora o wok con aceite de colza y precaliente a 180C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido.) Coloque las bolas y cocínelas hasta que flote a la superficie y se tornen doradas . Cuidadosamente saque las bolas y escurra sobre papel de cocina.", "Para la guarnición, vierta la col rizada una por una en el aceite y fría hasta que esté crujiente, luego escurra sobre papel de cocina. Combine la sal, la pimienta blanca molida y el azúcar en un tazón pequeño. Espolvoree ligeramente la col rizada con la mezcla para cubrirla.", "Para los fideos salteados, caliente el wok a fuego alto, agregue el aceite de colza hasta que esté caliente. Agregue el jengibre por unos segundos, luego agregue el hongo shiitake y las piezas de tofu ahumado y cocine por 2 minutos, o hasta que se dore en los bordes.", "Espolvorear sobre la col rizada crujiente y el cilantro fresco y servir inmediatamente con las bolas de pescado de cilantro."], "url": "www_bbc_co_uk_food_recipes_hong_kong-style_fried_75618", "title": "Hong Kong al estilo de pescado frito y bolas de calamar con fideos de soja oscura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 bolas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de algarroba (disponible en tiendas naturistas)", "1 cucharadita de extracto de vainilla", "½ cucharadita de extracto de almendra", "Jarabe de jarabe de 1-2 cucharaditas (disponible en delicatessen o especialistas en línea) o jarabe de arce", "1-2 cucharaditas de maca en polvo (opcional, disponible en tiendas naturistas)", "¼ cucharadita de sal", "400 g de leche de coco con toda su grasa"], "method": ["Mezcle todos los ingredientes y 300ml / 10½ fl oz de agua juntas en un procesador de alimentos hasta que estén súper suaves y bien combinados.", "Transfiera la mezcla a una sartén y caliente con un poco de calor.", "Servir inmediatamente en tazas."], "url": "www_bbc_co_uk_food_recipes_horlixier_49938", "title": "Bebida de coco caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/horlixier_49938_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "1,5kg / 3lb filete de cocción de 5 oz, cortado en cubitos", "3 cebollas grandes, más o menos picadas", "6 dientes de ajo, triturados o finamente picados", "300ml / 10fl oz de caldo de carne", "50g / 1¾oz de harina natural", "300ml / 10fl oz de vino blanco seco", "3 cucharadas de salsa Worcestershire", "1 cucharada de azúcar mascabado ligero", "sal y pimienta negra recién molida", "500g / 1lb 2oz de champiñones castaños, cortados a la mitad", "3 cucharadas de mostaza Dijon", "3 cucharadas de salsa de rábano picante a la crema", "3-4 cucharadas de crema doble (opcional)"], "method": ["Caliente 2 cucharadas de aceite en una cazuela con tapa, resistente a las llamas, a fuego alto, a fuego alto. Agregue la carne de res, en tandas si es necesario, y fría por 4-5 minutos, o hasta que se dore por todas partes. Retire la carne de la cazuela con una cuchara ranurada y déjela a un lado.", "Calentar el aceite restante en la sartén, agregar las cebollas y el ajo y freír, revolviendo bien, durante 4-5 minutos, o hasta que estén blandos, raspando cualquier trozo dorado del fondo de la cazuela con una cuchara de madera. Agregue el caldo de carne.", "En un tazón grande, bata la harina con un poco de vino hasta que quede suave, luego vierte gradualmente el resto del vino, batiendo hasta que se combine con una mezcla suave con la consistencia de crema doble.", "Regrese la carne dorada a la cazuela y vierta sobre la mezcla de vino y harina. Llevar a ebullición, revolviendo hasta que espese, luego agregar la salsa Worcestershire y el azúcar y sazonar, a gusto, con sal y pimienta negra recién molida. Cubra la cacerola con la tapa, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, y cocine a fuego lento muy suavemente durante 2 horas, revolviendo de vez en cuando (alternativamente, cocine la cazuela en un horno bajo).", "Después de 2 horas, agregue los champiñones, vuelva a hervir la mezcla, vuelva a tapar, reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante media hora más o hasta que la carne esté tierna.", "Mezcle la mostaza, el rábano picante y la crema doble (si usa) en un recipiente hasta que estén bien combinados. Justo antes de servir, revuelva en la cazuela. Sirva con puré de papas y verduras al vapor."], "url": "www_bbc_co_uk_food_recipes_horseradish_and_mustard_10990", "title": "Cazuela de res de rábano picante y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/horseradish_and_mustard_10990_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 chiles de ave, finamente picados, semillas opcionales", "1 diente de ajo, finamente picado", "2 cucharadas colmadas de azúcar de palma", "2 cucharadas de salsa de pescado tailandesa", "½ lima, solo jugo", "Calamar bebé 400 g / 14 oz, tentáculos reservados", "1 diente de ajo, finamente picado", "20 cebollines al ajo con flores (o un manojo de cebolletas), cortados en longitudes de 2.5cm / 1in", "5 cebolletas, cortadas, cortadas a la mitad y descuartizadas longitudinalmente", "5 chalotes tailandeses (o 1 chalota de plátano), en rodajas finas", "20 tomates cherry, cortados por la mitad", "½ pepino, cortado por la mitad, sin semillas, rebanadas gruesas", "grandes hojas de menta", "puñado de hojas de albahaca tailandesa (alternativamente, use albahaca normal)", "pedazo de jengibre del tamaño de un pulgar, pelado y cortado en láminas finas", "2 cucharadas de aceite vegetal", "1 cucharada de aceite de sésamo"], "method": ["Para el aderezo, moler los chiles y el ajo junto con los otros ingredientes del aderezo en un almirez y mortero. Dejar de lado.", "Para la ensalada, limpie y prepare el calamar, cortándolo por la mitad y manteniendo los tentáculos. Retire la piel y puntúe. Dejar de lado.", "Combine el ajo, el ajo cebollino (o cebollín), cebolleta, chalotes tailandeses (o chalotes de plátano), tomates cherry y pepino en un tazón grande con las hojas de menta fresca y las hojas de albahaca tailandesa (o albahaca normal).", "Caliente un wok o una sartén grande con aceite vegetal y de sésamo. Una vez caliente, freír el jengibre y cocinar hasta que se torne dorado. Agregue el calamar y los tentáculos y cocínelos durante aproximadamente 1 ½ minutos, o hasta que el calamar se haya doblado y esté recién cocinado.", "Agregue el aderezo del almirez y el mortero al calamar caliente y mezcle, luego agregue el calamar caliente a la ensalada y mezcle bien, sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hot_and_spicy_thai_squid_01824", "title": "Ensalada de calamar tailandés picante (Yam pra-muek)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_and_spicy_thai_squid_01824_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de rábano picante recién remojado, remojado en 2 cucharadas de agua caliente", "1 cucharada de vinagre de vino blanco", "pizca de mostaza en polvo inglesa", "pizca de azúcar en polvo", "sal y pimienta para probar", "150ml / 5fl oz de crema doble, ligeramente azotada"], "method": ["Escurra el rábano picante empapado y mezcle con todos los demás ingredientes."], "url": "www_bbc_co_uk_food_recipes_horseradishsauce_1304", "title": "Salsa de rábano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Arroz de sushi premium de 350g / 12oz, lavado bien y enjuagado con agua fría hasta que el agua corra limpia", "2 chiles rojos medianos, semillas retiradas y rebanadas", "4 dientes de ajo, finamente picados", "1 cucharada de pasta de frijoles", "1 cucharada de sedimento", "2 cucharadas de vinagre de arroz", "4 cucharadas de miel orgánica", "1 cucharada de aceite de maní", "1 diente de ajo, finamente picado", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado y cortado en matchsticks", "4 muslos grandes de pollo, sin piel, deshuesados ​​y rebanados en cubos de 1cm / ½ en cubitos", "1 cucharada de vino de arroz Shaoxing, o jerez seco", "2 calabacines grandes, cortados en tiras largas y finas en rodajas con un pelador", "1 diente de ajo, finamente picado", "1 cucharadita de jengibre rallado", "1 chile rojo mediano, sin semillas y finamente picado", "1 cucharadita de repente", "1 cucharadita de vinagre de arroz negro Chinkiang o vinagre balsámico", "½ cucharada de aceite de sésamo tostado", "1 cucharadita de aceite de chile Sichuan", "1 cebolla tierna, finamente picada", "1 pequeño puñado de tierra, camarones baby fritos secos", "1 pizca de granos de pimienta tostados de Sichuan"], "method": ["Agregue el arroz de sushi lavado a una cacerola grande. Agregue 500ml / 18fl oz de agua y llévelo a ebullición. Una vez que hierva, coloque una tapa hermética y reduzca el fuego a fuego lento. Cocine el arroz por 30 minutos, o hasta que el agua se haya evaporado, la base esté ligeramente dorada y el arroz esté tostado (cuando salga de la sartén, el arroz saldrá en una capa entera). Quite el calor y la mitad de la cobertura, esto mantendrá el arroz caliente, pero también deje que el vapor escape para mantener el fondo crujiente.", "Para la salsa, coloque todos los ingredientes en un recipiente y reserve.", "Para el pollo, caliente un wok a fuego alto hasta que esté humeante. Agregue el aceite de maní y agite alrededor del aceite para cubrir los lados de la sartén. Agregue el ajo y el jengibre y mezcle todo alrededor de la sartén. Luego agregue el pollo y dore todo. Vierta el vino de arroz Shaoxing.", "Agregue todos los ingredientes de la salsa y cocine a fuego alto, revolviendo todo el tiempo, hasta que la salsa se haya reducido y sea brillante y espesa. Quítate el calor.", "Para los fideos de calabacín, llene una olla grande con 1 litro / 1¾ de agua hirviendo y agregue las tiras de calabacín. Manténgalos moviéndose en el agua durante 1-2 minutos, luego drene a fondo y agregue a un recipiente. Agregue los ingredientes restantes y reserve.", "Para servir, coloca el arroz en un plato grande para compartir. Viste los calabacines agridulces alrededor de los lados del arroz y vierte el pollo agridulce en el medio (incluidos los jugos de la sartén). Para adornar, espolvoree cebollas de primavera, camarones secos fritos en polvo y pimienta tostada de Sichuan."], "url": "www_bbc_co_uk_food_recipes_hot_and_sour_chicken_08241", "title": "Pollo agridulce", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 huevos de gallinas camperas", "300 g / 10½ oz de azúcar en polvo", "100g / 3½oz de chocolate con leche, picado", "200 g / 7 oz de chocolate negro, picado", "150 g / 5½ oz de mantequilla sin sal, cortada en cubos", "150 g / 5½ oz de harina común, tamizada", "pellizcar canela molida", "pizca de tierra mezcla de especias", "1½ cucharadita de polvo de hornear", "1 cucharada de cacao en polvo (opcional)", "Crema doble 250ml / 9fl oz", "100g / 3½oz de chocolate con leche, picado", "Crema doble 250ml / 9fl oz", "1 cucharada de azúcar en polvo (o al gusto)", "2 cucharadas de menta, rallado", "4 cucharadas de panal molido"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una bandeja cuadrada de 23 cm / 9 pulgadas con papel pergamino.", "Para el brownie, bata los huevos y el azúcar en un tazón grande hasta que estén pálidos y espesos.", "Derrita el chocolate con leche, el chocolate negro y la mantequilla en un tazón grande y resistente al calor, sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Una vez fundido, déjelo enfriar por unos minutos.", "Revuelva el chocolate derretido en la mezcla de huevo para combinar.", "Introduzca con cuidado la harina tamizada, las especias, el polvo de hornear y el polvo de cacao en la mezcla.", "Coloque la mezcla de brownie en la lata preparada, alisa la parte superior con una espátula.", "Hornee en el horno durante 20-25 minutos, o hasta que el centro esté listo y la parte superior sea elástica al tacto y empiece a agrietarse. Dejar de lado para enfriar en la lata.", "Para la salsa de chocolate, caliente la crema suavemente en una sartén. Coloque el chocolate con leche en un tazón grande y vierta la crema caliente, batiendo para combinar.", "Para la crema de menta, mezcle la crema doble y el azúcar glas juntos en un tazón grande hasta que se formen picos suaves cuando se quite la batidora. Dobla la menta rallada.", "Cuando el brownie esté completamente frío, córtelo en cuadrados y colóquelo en tazones para servir. Rocíe con la salsa de chocolate y cubra con una cucharada de crema de menta batida. Espolvorea sobre el panal triturado para servir."], "url": "www_bbc_co_uk_food_recipes_hot_chocolate_brownie_19774", "title": "Brownie de chocolate caliente, salsa de chocolate, crema de menta batida y panal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces% 20% 20", "250g / 9oz de mantequilla sin sal, cortada en cubos", "4 huevos de gallinas camperas más 3 yemas", "175g / 6oz de azúcar en polvo", "Frambuesas 250 g / 9 oz", "helado de frambuesa, para servir", "Frambuesas 200 g / 7 oz", "1 vaina de vainilla, dividida", "2 cucharadas de agua de frambuesa", "1 cucharada de azúcar glas"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Derrita el chocolate y la mantequilla en un tazón resistente al calor colocado sobre una olla de agua hirviendo a fuego lento, asegurándose de que el fondo del recipiente no toque el agua.", "Batir los huevos, las yemas y el azúcar juntos en un tazón grande durante 5-10 minutos, o hasta que haya duplicado su tamaño. Dobla en la mezcla de chocolate.", "Pon las frambuesas en un plato resistente al horno. Verter sobre la mezcla de chocolate y hornear durante 15-20 minutos, o hasta que se haya establecido.", "Para hacer la salsa, coloque todos los ingredientes en una cacerola de fondo grueso y coloque a fuego lento. Incline las frambuesas blandas en un colador y empújelos a través del tamiz en una jarra con el dorso de una cuchara.", "Vierta la salsa sobre el pudín caliente y sirva con helado de frambuesa."], "url": "www_bbc_co_uk_food_recipes_hot_chocolate_pudding_46950", "title": "Pudín de chocolate caliente con frambuesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "180 g / 6% C2% BCoz% 20plain% 20chocolate% 20 (% 2036%% 20cocoa% 20solids mínimo)", "300 ml / 10 fl oz de leche", "25 g / 1 oz de cacao en polvo", "4 yemas de huevo grandes de gallinas camperas", "60g / 2¼ oz de azúcar en polvo, más extra para quitar el polvo", "Harina normal de 40 g / 1½ oz", "6 claras de huevo grandes de gallinas camperas", "40 g / 1½ oz de azúcar en polvo"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5. Coloque una bandeja para hornear pesada en el estante del medio del horno.", "Engrase un plato soufflé de 14x8cm (1,2 litros / 2 pinta) con mantequilla y polvo con azúcar en polvo. Haga un collar para el plato de soufflé doblando un pedazo de pergamino para hornear de 50x30 cm / 20x12 pulgadas 4 veces (para hacer un cuello profundo de 7½ cm / 3 pulgadas). Envuélvelo alrededor de la parte superior del plato y asegúralo con una cuerda.", "Para la crème pâtissière chocolat, derrita el chocolate en un tazón sobre una fuente de agua hirviendo. Retirar del fuego y dejar enfriar un poco.", "Vierta la leche y el polvo de cacao en una sartén de base pesada y deje que hierva gradualmente. Retire del fuego y deje enfriar durante 30 segundos. Mientras tanto, en un tazón mediano, mezcle las yemas de huevo y el azúcar impalpable hasta que estén pálidas, luego mezcle con la harina común. Vierta la leche con chocolate en los huevos, batiendo continuamente, luego vierta en la sartén.", "Regrese a ebullición, batiendo continuamente a fuego medio y cocine durante 1 minuto hasta que espese. Retire del fuego y mezcle con el chocolate derretido. Con una cuchara, coloque la crema de chocolate en un tazón, cubra la superficie con una película adhesiva para evitar que se forme la piel y déjela enfriar a temperatura ambiente.", "En un tazón limpio bata las claras de huevo a picos suaves. Agregue el azúcar y continúe batiendo a un merengue tieso y brillante.", "Batir un tercio de la mezcla de merengue en la crema pastelera de chocolate, luego doblar en los dos tercios restantes con una cuchara grande de metal. La mezcla debe ser bastante floja.", "Vierta la mezcla en el plato de soufflé. Pase el pulgar por el borde interior del plato para asegurar un buen aumento. Hornee en la bandeja de hornear precalentada durante 40-50 minutos o hasta que esté bien subida y elástica para tocar."], "url": "www_bbc_co_uk_food_recipes_hot_chocolate_souffle_95703", "title": "Soufflé de chocolate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_chocolate_souffle_95703_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["130 g / 4½ oz de salchicha de chorizo, cortada en diagonal", "Bola de mozzarella de 150 g / 5½ oz, cortada en discos", "pimienta negra recién molida", "½ baguette, cortado a un lado y separado", "puñado de hojas de espinaca bebé"], "method": ["Coloque las rebanadas de chorizo ​​en una sartén grande de base pesada a fuego medio. No es necesario usar ningún aceite o mantequilla. Cocine suavemente durante 4-5 minutos, volteando hasta la mitad, hasta que el aceite comience a escapar de la salchicha.", "Coloque las rodajas de mozzarella encima del chorizo, luego cuidadosamente con un poco de aceite sobre la parte superior.", "Cocine por 2-3 minutos para permitir que el queso se derrita, luego sazone con unos pocos giros de pimienta negra recién molida.", "Con una cuchara, coloque el chorizo ​​y la mozzarella en la baguette y luego saque los jugos de la sartén por encima. De nuevo, no hay necesidad de untar el pan con mantequilla, ya que los jugos de la sartén garantizarán que el pan se humedezca deliciosamente.", "Coloque un puñado de hojas de espinaca dentro de la barra de pan. Dale un buen apretón, permitiendo que todos los jugos se empapen en el pan y la espinaca se marchite un poco.", "Cortar la baguette por la mitad y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hot_chorizo_and_20568", "title": "Sándwich de chorizo ​​caliente y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_chorizo_and_20568_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Frijoles verdes de 250g / 9oz, recortados, cortados en piezas de 1.5cm / ⅝in", "Florecillas pequeñas de coliflor de 500 g / 1 lb 2 oz, cortadas en cuartos", "Calabacines de 250g / 9oz, cortados, cortados longitudinalmente en rebanadas de 1cm / ½", "100g / 3½oz de sal marina fina", "3 cebollas picadas", "300ml / 10½fl oz de vinagre de malta", "300ml / 10½fl oz de vinagre de vino blanco", "1 cucharada colmada de mostaza inglesa en polvo", "1 cucharada de cúrcuma molida", "1 cucharadita de jengibre molido", "1 cucharadita de hojuelas de chile seco", "25g / 1 oz de harina de maíz", "250g / 9 oz de azúcar granulada"], "method": ["Esterilice los frascos de mermelada: primero lave los frascos en agua jabonosa y enjuague con agua tibia y limpia. Precaliente el horno a 140C / 275F / Gas 1. Seque los frascos, al revés, en una rejilla por 30 minutos.", "Coloque las verduras en un recipiente para mezclar no metálico, rocíe con la sal y mezcle hasta que estén bien combinadas. Cubra con un plato y déjelo reposar durante 24 horas.", "Enjuague las verduras en varios cambios de agua fría.", "Coloque las cebollas en una cacerola grande y agregue el vinagre de malta. Llevar a fuego lento a fuego lento y cocinar durante 15 minutos.", "Mezcle cinco cucharadas de vinagre de vino blanco con la mostaza en polvo, la cúrcuma, el jengibre, los copos de chile y la harina de maíz. Revuelva el vinagre de vino blanco restante y el azúcar en el vinagre de malta y las cebollas hasta que se disuelva. Incline las verduras escurridas en la misma sartén, vuelva a hervir a fuego lento y cocine durante 10 minutos, revolviendo ocasionalmente.", "Revuelva la mezcla de harina de maíz en la sartén con las verduras hasta que estén bien combinadas. Cocine por otros 8-10 minutos, revolviendo regularmente hasta que los vegetales estén tiernos pero crujientes y la salsa espesada.", "Coloque el pepinillo en los frascos de mermelada, asegurándose de que todas las verduras estén distribuidas uniformemente y se enfríen. Cubra con tapas de metal recubiertas de vidrio o plástico y selle. Etiquete y almacene en un lugar fresco y oscuro durante al menos un mes antes de comer."], "url": "www_bbc_co_uk_food_recipes_hot_mustard_pickle_87973", "title": "Encurtido de mostaza caliente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 5 jarras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_mustard_pickle_87973_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de vino de arroz o vinagre de sidra", "50 g / 2 oz de azúcar en polvo", "2 cucharaditas de sal marina", "1 cucharadita de semillas de mostaza amarilla", "1 pepino, en rodajas finas", "1 manojo pequeño de eneldo fresco, solo hojas, más o menos picadas", "12 rebanadas de pan de masa fermentada, preferiblemente una mezcla de trigo y centeno", "40 g / 1½ oz de mantequilla ablandada", "1 cucharada de mostaza Dijon", "300g / 10½oz de pastrami en rodajas finas", "Fuenteina 400 g / 14 oz, en rodajas", "aceite vegetal, para freír", "3 pastinacas, peladas y cortadas en rodajas delgadas como una oblea utilizando un pelador de patatas", "3 zanahorias, peladas y cortadas en rebanadas finas como una oblea utilizando un pelador de patatas", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Haga hervir a fuego lento el vinagre de vino de arroz en una olla no reactiva con las semillas de azúcar, sal y mostaza, revolviendo hasta que el azúcar se haya disuelto.", "Coloque las rodajas de pepino en un recipiente y vierta sobre la mezcla de vinagre caliente. Agregue el eneldo y reserve para infundir.", "Mientras tanto, tuesta todas las rebanadas de masa fermentada y unte con mantequilla. Extienda 4 rebanadas con mostaza y cubra cada una con una capa de pastrami. Divida la mitad de las rodajas de queso por igual entre las 4 rebanadas de pan, luego coloque una capa de pepinillos en vinagre encima del queso.", "Repita este proceso de estratificación con otra rebanada de pan y la mantequilla restante, la mostaza, el pastrami, el queso y el pepinillo en vinagre. Termine cada sándwich con un pedazo de pan.", "Envuelva cada sándwich en una hoja grande de pergamino para hornear, luego asegúrelo con una cuerda para cocinar.", "Transfiera las parcelas a una bandeja para hornear y hornéelas en el horno durante 10 minutos, o hasta que los sándwiches se hayan calentado y el queso se haya derretido.", "Caliente el aceite en una freidora a 160C / 325F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Baje con cuidado las rodajas de chirivía y de zanahoria en el aceite en lotes y fríe durante 4-5 minutos, o hasta que estén crujientes pero no doradas, el objetivo es secar las verduras sin quemarlas. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina. Sazonar con sal y pimienta negra recién molida.", "Sirva los sándwiches calientes en platos en sus paquetes, con una pila de chirivía y zanahoria crujiente al lado de cada uno."], "url": "www_bbc_co_uk_food_recipes_hot_paper_bag_sandwiches_01464", "title": "Sandwiches de bolsa de papel caliente de pastrami, fontina y pepino encurtido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10fl oz de leche entera", "500g / 1lb 2oz de harina blanca fuerte", "75 g / 2½ oz de azúcar en polvo", "1 cucharadita de sal", "7 g de levadura de acción rápida", "50g / 1¾oz de mantequilla", "1 huevo de gallinas camperas, golpeado", "150g / 5oz sultanas", "80g / 3oz de cáscara mixta", "1 manzana, sin corazón y picado", "2 naranjas, solo cáscara", "2 cucharaditas de canela molida", "aceite de girasol, para engrasar el bol", "Harina normal de 75 g / 2½ oz, más extra para espolvorear", "3 cucharadas de mermelada de albaricoque"], "method": ["Ponga la leche a hervir y luego retírela del fuego y deje enfriar hasta que alcance la temperatura de la mano.", "Mezcle la harina, el azúcar, la sal, la levadura, la mantequilla y el huevo en un tazón, luego agregue lentamente la leche calentada hasta que forme una masa suave y pegajosa.", "Agregue las pasas sultanas, la cáscara mixta, la manzana picada, la ralladura de naranja y la canela, luego incline el tazón sobre una superficie ligeramente enharinada. Amasar la masa sujetando la masa con una mano y estirándola con la curación de la otra mano, luego doblándola sobre sí misma. Repita durante cinco minutos o hasta que quede suave y elástico.", "Coloque la masa en un recipiente ligeramente engrasado, cubra con una película adhesiva untada con aceite y deje que se levante durante aproximadamente una hora, o hasta que duplique su tamaño.", "Divida la masa en 12 piezas iguales y enrolle cada pieza en una bola suave sobre una superficie ligeramente enharinada. Coloque los bollos en una bandeja para hornear forrada con pergamino, dejando suficiente espacio para que los bollos solo toquen cuando se elevan y se expanden. Reserve para probar por una hora más.", "Caliente el horno a 220C / 425F / Gas 7.", "Para la cruz, mezcle la harina con aproximadamente cinco cucharadas de agua en un tazón pequeño, agregue el agua una cucharada a la vez, para que agregue lo suficiente para una pasta espesa. Cuchara en una manga pastelera con una boquilla pequeña. Pase una línea a lo largo de cada fila de bollos, luego repita en la otra dirección para crear cruces.", "Hornee durante 20-25 minutos en el estante del medio del horno o hasta que estén dorados.", "Suavemente calienta la mermelada de albaricoque para que se derrita, luego sécala para eliminar cualquier trozo. Mientras el atasco aún esté caliente, cepille sobre la parte superior de los panecillos calientes y deje que se enfríe. Suavemente raspe los bollos para servir, revelando bordes tentadoramente suaves."], "url": "www_bbc_co_uk_food_recipes_hot_cross_buns_74750", "title": "Bollos cruzados calientes", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_cross_buns_74750_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina blanca, más extra para espolvorear", "1 cucharadita de sal marina fina", "75ml / 2½fl oz de aceite de oliva", "250ml / 9fl oz de agua tibia", "90g / 3¼oz de cuscús", "Filete de abadejo de 400 g / 14 oz (o coley, merluza, chaqueta de cuero o merlán), despellejado y cortado en rodajas de 1 cm / ½", "1 cucharadita de sal", "90ml / 3fl oz de aceite vegetal", "2 dientes de ajo, pelados y rallados", "15g / ½ oz de jengibre fresco, pelado y rallado", "60 g / 2¼ oz de bok choi o ensalada de col, en rodajas finas", "8 cebollas de primavera, cortadas en diagonal", "pequeño puñado de cilantro fresco, toscamente picado", "½ cucharadita de salsa Tabasco o Sriracha", "½ cucharadita de salsa de soja"], "method": ["Para los panes planos, tamice la harina en un tazón grande y agregue la sal, el aceite y el agua. Mezcle en una masa. Si está demasiado seco para juntarse, agregue una cucharada o dos más de agua. Dé vuelta a un tablero ligeramente enharinado (o en un mezclador de alimentos con un gancho de masa) y amase durante 5-10 minutos hasta que quede suave y elástico.", "Divide la masa en ocho pedazos y rueda en bolas. Ruede las bolas en círculos de 20-23 cm / 8-9 pulgadas. Precalentar una sartén antiadherente a fuego alto. Coloque un círculo de masa en la sartén y cocine por un minuto más o menos, hasta que se hinche. Voltee y cocine por otro minuto (desarrollará 'manchas' oscuras). Repita para cocinar el resto de los panes planos. Mantener caliente", "Para el abadejo con especias, pon el cuscús en un recipiente poco profundo. Sazonar el pescado ligeramente con sal y volcar en el cuscús.", "Calentar el aceite en una sartén, luego fría el pescado durante tres minutos, volteándolo hasta la mitad. Transfiera a un plato, agregue el ajo y el jengibre a la sartén y freír con el cuscús residual durante 1-2 minutos.", "Para servir, coloque el pescado en el centro de cada pan plano. Espolvoree con el bok choi, luego espolvoree el ajo, el jengibre, el cuscús y el aceite de la sartén. Espolvoree las cebolletas y el cilantro, y luego rocíe sobre el Tabasco y la salsa de soja. Dobla los panes planos y sirve dos por persona."], "url": "www_bbc_co_uk_food_recipes_hot_pollack_and_piadina_83316", "title": "Aguardiente de abadejo y paladares de Piadina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de cilantro", "5 cucharadas de aceite de oliva", "2 cebollas en rodajas", "1 cucharadita de sal", "½ cucharadita de pimentón", "½ cucharadita de sal masala", "500g / 1lb 2oz de arroz blanco recién hecho", "500g / 1lb 2 oz de salmón ahumado en caliente, roto en pedazos del tamaño de un bocado", "Guisantes congelados de 225 g / 8 oz, descongelados bajo un grifo frío", "Crema doble 50ml / 2fl oz", "2 cucharadas de cilantro fresco finamente picado", "2 cucharadas de cebollines frescos finamente cortados", "4 huevos de gallinas camperas, hervidos, pelados y descuartizados", "1 limón, cortado en cuñas"], "method": ["Coloque una sartén grande y profunda a fuego medio. Agregue las semillas de comino y cilantro y revuelva hasta que comiencen a reventar. Tenga cuidado de no quemarlos. Aplastar a un polvo fino en un molinillo de especias o una mano de mortero.", "En la misma sartén, caliente el aceite a fuego medio. Agregue las cebollas y la sal y cocine durante 5 minutos o hasta que estén suaves y translúcidos. Agregue las especias molidas, incluyendo el pimentón y el garam masala, reduzca el fuego a bajo y cocine durante 5 minutos.", "Aumente el fuego a medio y agregue el arroz. Revuelva hasta que esté cubierto con todas las especias. Agregue el salmón ahumado en caliente y los guisantes y cocine hasta que estén calientes.", "Quite el fuego y agregue la crema, el cilantro y el cebollín. Arriba con los huevos. Sirva con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_hot_smoked_salmon_26970", "title": "Kedgeree de salmón ahumado en caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hot_smoked_salmon_26970_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de salsa de soja", "1 cucharada de miel clara", "2 x 125 g / 4½ oz de filetes de salmón", "puñado de virutas de madera de roble, madera de manzano o cerezo", "5 g de levadura", "225ml / 8 fl oz de leche", "1 yema de huevo de gallinas camperas", "100 g / 3½ oz de harina de centeno", "Harina de pan blanco 75g / 2¾oz", "azúcar pizca", "pizca de sal", "2 claras de huevo de gallinas camperas", "2 cucharadas de aceite de oliva", "2 calabacines grandes, en juliana", "Jengibre fresco de la raíz de 15m m / ⅝in en la pieza, rallado", "2 dientes de ajo rallados", "1 chile rojo, finamente picado", "1-2 cucharaditas de jugo de limón fresco", "4 cucharadas de aceite de oliva", "montón de cebolletas frescas, cortadas", "sal y pimienta negra recién molida"], "method": ["Para el salmón ahumado en caliente, cepille la soja y la miel sobre los filetes de salmón y deje macerar durante 1 hora. Coloque los filetes en el estante de un ahumador y colóquelos sobre la placa a fuego alto hasta que las virutas empiecen a arder. (Vigile el ahumador y las virutas durante la cocción). Cierre el ahumador, baje el fuego y cocine durante 5 minutos, o hasta que el salmón esté húmedo pero no demasiado cocido. Deje que el salmón se enfríe un poco antes de sacarlo del ahumador.", "Para los blinis, mezcle la levadura, la leche y la yema de huevo en un tazón pequeño. Coloque las harinas, el azúcar y la sal en un tazón grande y cree un pozo en el centro. Vierta la mezcla de leche gradualmente en el pozo y mezcle bien para combinar. Batir las claras de huevo en un tazón pequeño hasta que formen picos rígidos. Dobla las claras de huevo en la mezcla de harina.", "Caliente el aceite en la sartén y vierta una cucharada de mezcla en el aceite caliente. Voltee el blini cuando la parte inferior esté firme y cocine hasta que ambos lados estén dorados. Repita hasta que se agote toda la mezcla. Mantenga los blinis cocidos calientes.", "Para la ensalada de calabacines, blanquee el calabacín en agua hirviendo con sal durante 10 segundos, revitalícelo y drene bien. Coloque el jengibre, el ajo, el chile, el jugo de limón y el aceite en un tazón pequeño y mezcle para combinar. Sazone con sal y pimienta y vierta el aderezo sobre el calabacín. Espolvorea con las cebolletas.", "Sirva el salmón ahumado caliente en la parte superior de los blinis, con la ensalada de calabacín en el lateral."], "url": "www_bbc_co_uk_food_recipes_hot_smoked_salmon_on_38551", "title": "Blinis de salmón ahumado caliente con ensalada de calabacín", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]