[{"ingredients": ["4 mini filetes de pollo", "1 cucharada de salsa de soja", "1 naranja, solo ralladura", "2 cucharadas de aceite de oliva", "Necesitará 4 pinchos de madera, empapados en agua durante diez minutos antes de usar"], "method": ["Coloque el pollo en un tazón pequeño y agregue la salsa de soja, la ralladura de naranja y el aceite de oliva. Deje de lado por cinco minutos para marinar.", "Pase cada mini filete de pollo en un pincho. Caliente una sartén de plancha y fría los pinchos de pollo durante tres minutos en cada lado, o hasta que estén cocidos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenskewers_86939", "title": "Pinchos de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de chile en polvo", "1 cucharadita de cúrcuma molida", "1 cucharadita de curry en polvo", "3 cucharadas de crema doble", "1 pechuga de pollo cortada en tiras", "½ pimiento verde, sin semillas, cortado en pedazos", "1 tomate, picado", "¼ de cebolla, finamente picada", "½ limón, solo jugo", "¼ de mango, pelado, removido de piedra, picado", "2 cucharadas de menta fresca picada", "2 cucharadas de cilantro fresco picado"], "method": ["Remoje dos brochetas de madera en agua fría durante 10-15 minutos, luego drene y reserve.", "Para los pinchos, mezcle el chile en polvo, la cúrcuma molida y el polvo de curry en un tazón con la crema hasta que estén bien combinados.", "Pase las tiras de pollo por los pinchos, alternando el pollo con el pimiento verde, luego frótelo con la cremosa mezcla de especias.", "Caliente un molde a la parrilla hasta que esté humeando y páseles los pinchos por 2-3 minutos en ambos lados, o hasta que estén dorados y el pollo esté bien cocido. (El pollo se cuece cuando los jugos se vuelven transparentes cuando se perfora en la parte más gruesa con un pincho).", "Para la salsa, combine todos los ingredientes de la salsa en un tazón pequeño.", "Sirva los pinchos de pollo junto con un tazón de salsa para mojar."], "url": "www_bbc_co_uk_food_recipes_chickenskewerswithma_90727", "title": "Brochetas de pollo con salsa de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "2 cebollas en rodajas", "2 palitos de apio, finamente picado", "2 zanahorias, finamente cortadas en cubitos", "Harina normal de 25g / 2oz", "1.2 litros / 2 pintas de caldo de pollo", "450 g / 1 lb de pollo cocido, despellejado y desmenuzado", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola grande a fuego medio y fría a fuego lento la cebolla, el apio y la zanahoria hasta que empiecen a ablandarse.", "Agregue la harina y cocine durante 2 minutos. Agregue el caldo de pollo y lleve la mezcla a ebullición, revolviendo mientras lo hace. Sazone con sal y pimienta, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 10 minutos, hasta que los vegetales estén tiernos.", "Agregue el pollo cocido y cocine hasta que se caliente. Ajuste el aderezo, agregue el perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_chickensoup_1918", "title": "Sopa de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickensoup_1918_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1,5 kg / 3 lb 5 oz de pollo", "1 cebolla, pelada, en rodajas", "2 tallos de apio picados", "2 dientes de ajo, pelados, picados", "6-8 tallos de perejil fresco", "1 hoja de laurel", "12 granos de pimienta blanca", "4 huevos de gallinas camperas", "150ml / 5½fl oz de aceite vegetal", "300ml / 10½fl oz de caldo de pollo caliente, más 1 litro / 15¼fl oz para cocinar las albóndigas", "200 g / 7 oz de comida matzá", "1 cucharada de eneldo fresco picado", "sal y pimienta negra recién molida"], "method": ["Para la sopa de pollo, coloque todos los ingredientes de la sopa en una olla grande, cubra con agua fría y deje hervir. Reduzca el fuego y cocine a fuego lento durante 1 hora.", "Retire el pollo y déjelo a un lado para que se enfríe un poco. Retire la carne del pollo y corte en trozos.", "Cuele el líquido a través de un paño de muselina en una olla limpia. Deje que el líquido gotee en lugar de tratar de empujarlo para crear un caldo claro.", "Mientras tanto, para las albóndigas, bata los huevos, el aceite, la mitad del caldo y la harina de matz en un bol para formar una pasta espesa. Agregue el caldo restante y el eneldo y sazone al gusto con sal y pimienta negra recién molida. Dejar de lado por una hora.", "Con las manos engrasadas, enrolle la mezcla de bola de masa en bolas pequeñas, de aproximadamente 2.5 cm de diámetro. Mientras tanto, caliente el caldo de pollo hasta hervir a fuego lento y cocine las albóndigas durante 30 minutos.", "Para servir, recaliente el caldo de pollo, si es necesario, y coloque un poco de pollo cocido en el fondo de cada uno de los 6 tazones para servir, vierta el caldo de pollo encima y agregue unas albóndigas."], "url": "www_bbc_co_uk_food_recipes_chickensoupanddumpli_93484", "title": "Sopa de pollo y albóndigas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickensoupanddumpli_93484_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "2 pechugas de pollo de corral sin piel, cortadas en tiras", "1 diente de ajo, aplastado", "1 cucharadita de jengibre fresco rallado", "1 estrella de anís", "½ cucharadita de chile rojo fresco finamente picado", "puñado de mangetout", "2 pak choi, tallos separados", "4 cebollas de primavera, cortadas en ángulo", "100 g / 3½ oz de champiñones silvestres mezclados, cortados y cortados en trozos de tamaño uniforme", "4 cucharadas de salsa de soja", "2 cucharadas de vinagre balsámico", "puñado de perejil recién hecho", "1 cucharada de estragón fresco picado", "1 cucharada de cebolletas frescas picadas"], "method": ["En una sartén grande o wok, caliente el aceite de cacahuate a fuego medio-alto.", "Agregue las tiras de pollo y cocine, agitando ligeramente, durante 3-4 minutos hasta que el pollo se ponga blanco y esté casi cocido.", "Agregue el ajo, el jengibre, el anís estrellado y el chile, y cocine por otros 30 segundos.", "Agregue el mangetout, pak choi, cebollas tiernas y champiñones, y sofría por otros 3-4 minutos hasta que estén ligeramente cocidos.", "Termine con la salsa de soja, vinagre balsámico y hierbas frescas. Revuelva juntos brevemente y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenstirfriedwith_86683", "title": "Pollo salteado con pak choi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenstirfriedwith_86683_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ chalota, pelada y en rodajas", "¼ de pimiento rojo, en rodajas", "½ pechuga de pollo, en rodajas", "pizca de copos de chile", "1 cucharada de miel", "1 cucharada de salsa de soja", "1 cucharada de aceite de sésamo", "½ lima, solo jugo", "½ pak choi, en rodajas", "1 cucharada de harina de maíz, mezclada con agua", "Fideos de huevo de 110 g / 4 oz, cocidos", "semillas de sésamo, para servir"], "method": ["Calentar el aceite en una sartén grande o wok. Saltee las rodajas de chalote, pimienta y pollo durante unos minutos, hasta que el pollo esté dorado.", "Agregue los copos de chile, la miel, la salsa de soja, el aceite de sésamo y el jugo de lima. Revuelva-fríe por unos minutos.", "Agregue el pak choi y vierta la mezcla de harina de maíz y agua. Caliente suavemente durante otros 3-4 minutos, revolviendo ocasionalmente, hasta que el pollo esté cocido.", "Agregue los fideos y caliente.", "Transfiera a un tazón para servir y espolvoree con semillas de sésamo para servir."], "url": "www_bbc_co_uk_food_recipes_chickenstirfry_76489", "title": "Salteado de pollo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "1 cebolla tierna, finamente picada", "1 chile de ojo de pájaro, sin semillas, finamente picado", "2 mini filetes de pollo picados en trozos pequeños", "45g / 1½oz de frijoles de soja congelados", "Fideos listos para cocinar 200 g / 7 oz", "2 cucharaditas de salsa de soja", "½ naranja, solo jugo", "1 cucharadita de semillas de sésamo", "1 cucharada de menta fresca picada"], "method": ["Calienta el aceite en un wok. Agregue la cebolleta, el ají, el pollo y los frijoles de soya al wok y saltee durante tres minutos.", "Agregue los fideos, la salsa de soja y el jugo de naranja al wok y saltee durante otros 2-3 minutos, o hasta que el pollo esté bien cocido.", "Para servir, revuelva las semillas de sésamo y la menta a través de los fideos y apile en un plato."], "url": "www_bbc_co_uk_food_recipes_chickenstirfry_86938", "title": "Salteado de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["huesos de un cadáver de pollo cocido, incluida la piel", "1 zanahoria, pelada y picada", "1 cebolla, pelada y descuartizada", "1 tallo de apio, más o menos picado", "6 granos de pimienta negra", "1 hoja de laurel seca", "3 tallos frescos de perejil", "1 ramita de tomillo fresco"], "method": ["Pon todos los ingredientes en una sartén grande y cúbrelos con agua. Llevar a ebullición y quitar toda la espuma que se haya formado. Cubra y cocine a fuego lento muy suavemente durante 2-3 horas.", "Colar en un tazón grande y dejar enfriar. Relajarse durante la noche.", "Elimine cualquier grasa que se haya formado en la superficie. Use dentro de 3 días o congele.", "Para congelar, reduzca el caldo a la mitad hirviéndola vigorosamente. Guay. Verter en bandejas de cubitos de hielo y congelar. Cuando esté congelado, coloque los cubos en una bolsa, etiquételos, y cuando quiera usar uno, simplemente coloque una jarra y agregue agua hirviendo para disolver el cubo."], "url": "www_bbc_co_uk_food_recipes_chickenstock_1294", "title": "Caldo de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 1-2 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, sin piel, rebanada en 4 tiras", "4 lonchas de tocino rayado ahumado", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "½ cebolla, finamente picada", "2 lonchas de tocino rayado ahumado, picado", "150g / 5½oz de papas nuevas, cortadas en rodajas de 0.5cm / ¼ in", "sal y pimienta negra recién molida", "2 tomates, cortados a la mitad", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharaditas de azúcar en polvo", "2 cucharaditas de vinagre balsámico", "1 cucharada de hojas de albahaca fresca picada", "1 cucharada de aceite de oliva", "100 g / 3½ oz espinacas, lavadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, enrolle cada tira de pollo en un trozo de tocino rayado. Asegúrelo, si es necesario, con un palito de cóctel. Calienta una sartén antiadherente a prueba de horno y freír el pollo durante 2-3 minutos, girando con frecuencia, hasta que esté ligeramente dorado por todas partes.", "Transfiera al horno y cocine por otros 6-8 minutos, o hasta que esté completamente cocido.", "Para las papas salteadas, caliente el aceite y la mantequilla en una sartén antiadherente, agregue la cebolla y fríela suavemente hasta que esté suave pero no coloreada. Agregue el tocino y fría hasta que estén dorados.", "Agregue las papas y cocine a fuego moderado hasta que estén tiernas y doradas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para los tomates agridulces, coloque las mitades de tomate en un plato pequeño a prueba de horno y rocíe sobre el aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida y espolvorear sobre el azúcar.", "Transfiera al horno y tueste durante 8-10 minutos, o hasta que se colapse. Retire del horno y rocíe sobre el vinagre balsámico mientras los tomates todavía estén calientes.", "Cuando los tomates se hayan enfriado un poco, espolvorea sobre la albahaca.", "Para la espinaca marchita, caliente el aceite de oliva en una sartén, agregue las espinacas y saltee durante 1-2 minutos, o hasta que la espinaca se marchite. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque las papas salteadas en un plato para servir y cubra con las piezas de pollo. Sirva los tomates y las espinacas marchitas al lado."], "url": "www_bbc_co_uk_food_recipes_chickenstripsinsmoke_86901", "title": "Tiras de pollo en tocino ahumado con tomates agridulces y patatas salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ puerro, finamente picado", "50ml / 2fl oz de vino blanco", "1½ cucharadas de vinagre de vino blanco", "¼ de pimiento naranja, finamente picado", "1 pechuga de pollo cortada en tiras", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 rebanadas de queso mozzarella, para servir"], "method": ["Para la vinagreta, sudar el puerro en una sartén con el vino blanco, el vinagre de vino blanco y la naranja picante durante 5 minutos.", "Para el pollo, sazone al gusto con sal y pimienta negra recién molida. Caliente el aceite de oliva en una sartén, luego agregue las tiras de pollo y cocine, revolviendo, durante 5 minutos o hasta que esté bien cocido.", "Para servir, coloque la vinagreta en un plato, cubra con las tiras de pollo y cubra con las rebanadas de queso mozzarella."], "url": "www_bbc_co_uk_food_recipes_chickenstripswithlee_80768", "title": "Tiras de pollo con vinagreta de puerro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pollo a 300 g / 10 oz, cortada en tiras", "2 cucharadas de pimentón ahumado", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "50 g / 2 oz de mantequilla, para freír", "Tocino tocino 100 g / 3½ oz", "1 cebolla, en rodajas", "50g / 2 oz champiñones, en rodajas", "50 g / 2 oz de champiñones Portobello, en rodajas", "1 diente de ajo, aplastado", "Brandy 50ml / 2floz", "150ml / 5fl oz de caldo de pollo", "125ml / 4fl oz de crema agria", "Hojaldre precortado de 4 piezas, cortado aproximadamente 1,5 cm / ½ pulgada más ancho que el tamaño de cuatro platos individuales para hornear a prueba de horno", "1 huevo de gallinas camperas, golpeado", "sal y pimienta negra recién molida", "col roja en escabeche o remolacha en escabeche"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Espolvoree las tiras de pollo con una cucharada de pimentón ahumado y sazone bien con sal y pimienta negra recién molida.", "Caliente el aceite vegetal en una sartén hasta que esté humeando. Agregue el pollo y fríelo rápidamente, volteándolo ocasionalmente, hasta que se dore por todas partes. Retirar del fuego y mantener caliente.", "Derretir la mantequilla en la misma sartén y freír los lardons durante 2-3 minutos, hasta que estén dorados. Agregue la cebolla y cocínela durante 4-5 minutos hasta que esté suave y ligeramente dorada.", "Agregue las setas en rodajas y el ajo y cocine por un par de minutos para ablandar.", "Agregue el brandy y prepárelo cuidadosamente. Ten cuidado con las llamas. (No se preocupe si el brandy no se enciende, la cocción eliminará el alcohol).", "Agregue el caldo, lleve a ebullición y cocine para reducir el volumen del líquido a la mitad.", "Agregue la crema agria y la restante una cucharada de pimentón. Revuelva bien y cocine a fuego lento para reducir la salsa a la consistencia de crema doble espesa.", "Coloque el pollo de nuevo en la sartén para calentarlo.", "Divida la mezcla de pollo entre cuatro platos individuales para hornear a prueba de horno.", "Cepille un poco de huevo batido alrededor de los bordes exteriores de los platos de tarta, luego presione las piezas de pastelería en la parte superior de los platos. Cepille con generosas cantidades de huevo batido.", "Corta un poco de ventilación en cada parte superior de pastelería para permitir que salga el vapor.", "Transfiera al horno para cocinar por 10-15 minutos, o hasta que las partes superiores estén crujientes y doradas.", "Para servir, retire los platos de tarta del horno y deje que se enfríen un poco antes de colocarlos en los platos. Sirva con tazones de col roja en escabeche o remolacha."], "url": "www_bbc_co_uk_food_recipes_chickenstroganoffpie_85481", "title": "Pastel de pollo stroganoff", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 muslo de pollo, hueso retirado", "50g / 2oz de queso cambozola", "2 rebanadas de jamón de Parma", "½ batata, pelada y en cubos", "300ml / 10fl oz de agua hirviendo", "25g / 1oz de mantequilla", "Crema doble 50ml / 2fl oz", "Sal y pimienta negra recién molida", "1 cucharada de perejil fresco picado", "2 cucharadas de aceite de oliva", "½ cebolla, en rodajas", "Brócoli 150 g / 6 oz, en rodajas", "½ cucharadita de copos de chile"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para el pollo relleno, coloque el pollo en una tabla y aplánelo. Coloque el queso en el centro del pollo y envuelva el pollo alrededor. Envuelva la envoltura de jamón de Parma alrededor del pollo para hacer un paquete.", "Caliente una sartén antiadherente y fría el pollo hasta que esté dorado. Coloque en el horno precalentado y cocine por 12 minutos.", "Para el puré de boniato, hierva la batata en el agua durante 8 minutos o hasta que esté tierna. Escurra y haga puré y agregue la mantequilla, la crema, el condimento y el perejil picado.", "Para el brócoli sofrito, caliente un wok y agregue el aceite. Agregue las cebollas y cocine por cuatro minutos.", "Agregue el brócoli y el chile y cocine por otros cinco minutos.", "Para servir, coloque el puré en el medio del plato y cubra con el pollo. Sirve el brócoli en el lado."], "url": "www_bbc_co_uk_food_recipes_chickenstuffedwithch_79091", "title": "Pollo relleno de queso, envuelto en jamón de Parma con puré de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, preferiblemente de corral, peladas", "250g / 8¾oz de queso de cabra", "manojo de hierbas frescas mezcladas (como el perejil, el estragón y el eneldo), picado", "8 rebanadas de jamón de Parma", "pimienta negra recién molida", "500 g / 1lb 2 oz zanahorias, cocidas al vapor hasta que estén tiernas", "2 manojos de espárragos ingleses, cocidos al vapor hasta que estén tiernos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Con un cuchillo afilado, haga una incisión profunda por un lado de cada pechuga de pollo para formar un bolsillo en cada uno.", "En un tazón, mezcle el queso de cabra y las hierbas mixtas, luego rellene las pechugas de pollo con la mezcla.", "Envuelva dos lonchas de jamón de Parma alrededor de cada pechuga de pollo rellena y sazone al gusto con pimienta negra recién molida.", "Coloque las pechugas de pollo envueltas y rellenas en una bandeja para hornear y transfiéralas al horno. Cocine por 20-25 minutos, o hasta que esté cocido. (NB: el pollo se cuece cuando los jugos se hacen transparentes cuando el pollo se perfora en la parte más gruesa con un pincho).", "Para servir, coloque una pechuga de pollo rellena en el centro de cada plato. Sirva con zanahorias al vapor y espárragos."], "url": "www_bbc_co_uk_food_recipes_chickenstuffedwithgo_92050", "title": "Pechugas de pollo rellenas de queso de cabra envueltas en jamón de Parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 1.2-1.5kg / 2lb 9oz-3lb 4 oz de pollo orgánico deshuesado (excepto el ala): el peso dado es antes de retirar los huesos", "4 rebanadas de jamón", "Mascarpone 150 g / 5 oz", "2 ramitas de romero fresco, finamente picado", "1½ limones, cáscara y jugo", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "Brócoli brotación púrpura de 150g / 5oz, cortado", "Brócoli Romanesco 150 g / 5 oz, cortado en lanzas"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Coloque el pollo en una tabla de cortar, con la piel hacia abajo. Retire los dos mini filetes de pechuga de pollo y reserve.", "Coloque las rodajas de jamón sobre la pechuga de pollo y cosas en las piernas.", "En un tazón pequeño, mezcle el mascarpone con el romero y la ralladura de limón y el jugo.", "Coloque una cucharada de la mezcla de mascarpone en ambos senos y en las piernas, reservando una cucharada.", "Aplanar los mini-filetes ligeramente con un rodillo y colocar sobre los senos cubiertos de mascarpone. Voltee el pollo, metiendo las patas hacia abajo y la piel alrededor para comer.", "Calentar una sartén a prueba de horno y agregar la mitad del aceite de oliva. Sazone el pollo con sal y pimienta negra recién molida y coloque el lado de la piel hacia abajo en la sartén. Freír durante dos minutos o hasta que la piel esté dorada.", "Coloque en el horno y tápelos durante 18-25 minutos, hasta que estén cocidos. Pruebe que el pollo esté cocido perforando la carne con un pincho; si los jugos son claros, el pollo está cocido.", "Retire el pollo del horno y drene el exceso de grasa de la sartén. Coloque el pollo en un plato y descanse, cubierto con papel de aluminio, durante cinco minutos.", "Agregue la cucharada final de la mezcla de mascarpone a la sartén y mezcle con los jugos carnosos.", "Mientras tanto, trae una sartén con agua salada a ebullición. Agregue el brócoli brotación púrpura y el brócoli Romanesco y cocine durante tres minutos, o hasta que estén tiernos.", "Escurrir el brócoli y colocar de nuevo en la sartén. Mezcle con el aceite de oliva restante y sazone con sal y pimienta negra recién molida.", "Para servir, esculpe el pollo por la mitad y sirva con el brócoli."], "url": "www_bbc_co_uk_food_recipes_chickenstuffedwithpr_88077", "title": "Pollo relleno de prosciutto, mascarpone y romero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo sin piel", "½ puerro, finamente cortado", "6 hojas de albahaca fresca", "pellizcar jengibre molido", "2 cucharadas de crema doble", "sal y pimienta negra recién molida", "2 cucharadas de semillas de sésamo", "dash aceite de oliva", "25g / 1oz de mantequilla", "½ puerro, finamente cortado", "1 diente de ajo, picado", "pizca de curry en polvo", "salpicar vino blanco", "Crema doble de 150 ml / 1/4 de pinta", "sal y pimienta negra recién molida", "300ml / ½ pinta de aceite vegetal, para freír", "¼ repollo Savoy, muy finamente cortado", "2 cucharaditas de azúcar glas", "1 cucharadita de sal", "1 tomate de ciruela, descuartizado, para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la pechuga de pollo rellena, retire el mini filete de la parte inferior de la pechuga de pollo y déjelo a un lado. Corta una hendidura horizontalmente a través de la longitud de la pechuga de pollo para hacer un bolsillo dentro del pecho.", "Blanquee los puerros cortados en rodajas en agua hirviendo con sal durante 3-4 minutos, o hasta que estén blandos y luego escurra.", "En un recipiente, picar finamente el mini filete de pollo reservado y colocar en un bol. Mash ligeramente con un tenedor para hacer una pasta, luego agregue los puerros blanqueados, albahaca, jengibre, crema doble, sal y pimienta negra recién molida.", "Coloca la mezcla en el bolsillo de la pechuga de pollo y tira de la carne para sellar el relleno. Ruede el pollo en las semillas de sésamo.", "Calentar el aceite de oliva en una sartén, agregar el pollo y freír en todos los lados hasta que estén dorados. Envuelva el pollo en papel de aluminio, colóquelo en el horno y hornee durante diez minutos o hasta que esté completamente cocido. Ponga a un lado, en un lugar cálido, para descansar durante cinco minutos y luego cortar en cuatro pedazos.", "Para la salsa cremosa de puerro, derrita la mantequilla en una cacerola, agregue los puerros y fríela suavemente durante tres minutos, o hasta que se ablanden. Agregue el ajo y el polvo de curry y fría por un minuto. Agregue el vino y cocine a fuego lento durante 2-3 minutos. Agregue la crema, la sal y la pimienta negra recién molida y cocine a fuego lento hasta que el líquido se haya reducido a la mitad.", "Para la col frita crujiente, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Coloque con cuidado la col picada en el aceite caliente y fría por 30 segundos o hasta que esté crujiente. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y luego espolvorear con el azúcar y la sal.", "Para servir, vierta la cremosa salsa de puerros en un plato para servir, cubra con la pechuga de pollo rellena y coloque encima un montón de algas crujientes fritas. Adorne con un tomate de ciruela en cuartos."], "url": "www_bbc_co_uk_food_recipes_chickenstuffedwithle_88277", "title": "Pollo relleno de puerro, albahaca y jengibre con repollo frito crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas españolas", "5 dientes de ajo", "1 limón, jugo", "1 manojo de perejil plano", "1 manojo de cilantro", "sal marina, sazonar", "comino en polvo, polvo de cilantro, polvo de chili y polvo de cúrcuma, al gusto", "½ taza de aceite de oliva virgen extra", "aceite de oliva, para cocinar", "1 pollo entero, picado en piezas de estilo salteado", "1 cebolla española, picada en seis", "2 zanahorias, cortadas en trozos grandes", "1 ñame pequeño, cortado en trozos grandes", "2 cucharadas de miel", "pequeño puñado de aceitunas negras", "1 limón en conserva, finamente picado (ver receta separada)", "agua o caldo", "8 fechas frescas, piedras removidas"], "method": ["Para hacer la chermoula, simplemente coloque todos los ingredientes en un procesador de alimentos y mezcle.", "Marinar bien el pollo en la pasta.", "Calentar el aceite de oliva en una cacerola de base pesada. Agregue las piezas de pollo y saltee por un par de minutos, coloreando bien por todos lados.", "Agregue la miel, las verduras, las aceitunas y el limón en conserva y mezcle bien.", "Agregue suficiente caldo o agua para cubrir generosamente el pollo y las verduras, y cocine hasta que el pollo esté cocido y las verduras estén blandas. Agregue las fechas."], "url": "www_bbc_co_uk_food_recipes_chickentagine_12157", "title": "Tagine de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo, cortadas en tiras finas", "1 lata de frijoles cannellini escurridos y lavados", "1 cebolla roja, finamente rebanada", "1 chile rojo, picado", "1 diente de ajo, aplastado", "pequeño racimo de cilantro, picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "100ml / 3½fl oz de crema agria", "4 conchas de taco", "3 tomates de ciruela, sin semilla y picados", "1 chile rojo, picado", "1 pimiento verde, finamente picado", "½ cebolla roja", "½ limón, solo jugo", "1 cucharada de aceite de oliva", "50g / 2oz de pepino, finamente cortado", "50g / 2oz de queso cheddar rallado", "½ cebolla roja, cortada en cubitos"], "method": ["En una sartén honda, saltee el pollo con un poco de aceite hasta que esté cocido.", "Agregue los frijoles y la cebolla, el chile y el ajo y un poco de cilantro picado.", "Agregue el jugo de limón y la sazón, y luego mezcle un poco de crema agria.", "En otro tazón, mezcle los ingredientes de la salsa.", "Para servir, vierta la mezcla de pollo en las cáscaras de taco y agregue un poco de salsa. Vierte un poco más de crema agria en el interior, decora con el pepino, el queso cheddar rallado y la cebolla roja, ¡y come con gusto!"], "url": "www_bbc_co_uk_food_recipes_chickentacoswithgree_72277", "title": "Tacos de pollo con salsa de pimienta verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de aceitunas verdes", "100ml / 3½fl oz de aceite de oliva", "1 cebolla grande, picada", "4 pechugas de pollo", "2 dientes de ajo picados", "1 cucharadita ras-el-hanout (disponible en algunos supermercados o tiendas especializadas)", "½ g hilos de azafrán", "1 cucharadita de jengibre molido", "1 cucharadita de pimienta negra recién molida", "1 limón grande en conserva, solo cáscara, picado", "3 cucharaditas de cilantro fresco picado", "1 cucharadita de perejil fresco picado", "vegetales, para servir"], "method": ["Caliente el aceite de oliva en una cacerola pesada. Agregue las cebollas y fría con cuidado, revolviendo con frecuencia hasta que estén suaves y translúcidas. Agregue las pechugas de pollo y fría por un minuto o dos. Agregue el ajo, el ras-el-hanout, el azafrán, el jengibre y la pimienta, y fría por 2-3 minutos hasta que estén dorados. Agregue el limón conservado, el cilantro, el perejil y las aceitunas.", "Agregue suficiente agua para cubrir el pollo y luego llévelo a ebullición. Reduzca el fuego, cubra y cocine a fuego lento durante unos 35 minutos."], "url": "www_bbc_co_uk_food_recipes_chickentagine_74834", "title": "Tagine de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickentagine_74834_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo", "3 cucharadas de salsa de soja", "3 cucharadas de jugo de naranja", "3 cucharadas de miel", "1 cabeza de brócoli, cortada en florecillas"], "method": ["Corta el pollo en trozos.", "Mezcle la salsa de soja, naranja y miel. Use la mitad para marinar el pollo y reserve la otra mitad para el aderezo.", "Caliente una sartén a la plancha y cocine al pollo por 4-5 minutos, o hasta que esté cocido.", "Ponga a hervir una olla de agua con sal. Agregue el brócoli y cocínelo por cuatro minutos o hasta que esté tierno, luego drene.", "Sirva el brócoli vestido con la salsa restante, cubierto con el pollo."], "url": "www_bbc_co_uk_food_recipes_chickenteriyakiwithb_78211", "title": "Teriyaki de pollo con ensalada de brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas y sin piel", "4 cucharadas de pasta tandoori preparada", "2 cucharadas de yogurt natural", "3 cucharadas de aceite vegetal o ghee (mantequilla clarificada)", "1 ramita de canela", "8 vainas de cardamomo", "1 cebolla grande, finamente picada", "3cm / 1¼ en pieza de jengibre fresco, pelado y rallado", "2 dientes de ajo, aplastados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de cúrcuma", "½-1 cucharadita de pimienta de cayena (dependiendo de qué tan caliente le guste)", "1x200g puede cortar tomates", "150ml / 5fl oz de caldo de pollo o agua", "1½ cucharadita de sal masala", "½ limón, solo jugo", "½ cucharadita de sal"], "method": ["Corta el pollo en trozos pequeños y mézclalo con la pasta tandoori y el yogur. Deje marinar en un plato no metálico durante al menos un par de horas (o durante la noche), revolviendo ocasionalmente.", "Caliente el aceite o el ghee en una sartén honda, y cuando esté muy caliente agregue la canela, las vainas de cardamomo y la cebolla. Freír durante unos 5-6 minutos hasta que empiecen a dorarse, luego agregar el jengibre, el ajo, el comino, el cilantro, la cúrcuma y la pimienta de cayena.", "Después de que las especias se hayan cocinado durante aproximadamente un minuto, agregue el pollo con el adobo. Freír durante 3-4 minutos, luego agregar los tomates enlatados, caldo de pollo o agua, garam masala, jugo de limón y sal. Llevar el curry a fuego lento y cocinar a fuego lento durante unos 10 minutos. Sirva inmediatamente con arroz o pan naan."], "url": "www_bbc_co_uk_food_recipes_chickentikkamasala_67780", "title": "Pollo tikka masala", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickentikkamasala_67780_16x9.jpg", "isVegetarian": false, "recommendations": 0}]