[{"ingredients": ["5 limones", "1 manojo pequeño de hojas de menta fresca", "1 manojo pequeño de perejil fresco de hojaldre, solo hojas", "½ pequeño eneldo fresco", "½ pequeño racimo fresco", "1 manojo pequeño de estragón fresco", "1 bulbo de ajo, cortado por la mitad horizontalmente", "250ml / 9fl oz de aceite de oliva virgen extra", "1kg / 2lb 4oz cojín de ternera (una articulación de la pierna), cortado en rodajas gruesas de 2cm / ¾in", "1 chalote, finamente picado", "2 ramitas de albahaca fresca, solo hojas", "3 anchoas, escurridas, finamente picadas", "1 cucharada de mostaza Dijon", "1 cucharada de alcaparras, escurridas", "Hojas de espinaca 300 g / 10½ oz", "sal marina y pimienta negra recién molida"], "method": ["Primero prepare su barbacoa: encienda la barbacoa para que se encienda y se apague, luego espere hasta que las brasas estén brillantes pero todavía no se hayan puesto blancas. Alternativamente, caliente una sartén a fuego alto hasta que esté muy caliente.", "Ralla dos de los limones en un tazón grande y luego exprime el jugo. Agregue algunas de las ramitas de menta, perejil, eneldo, perifollo y estragón, y el bulbo de ajo a la mitad. Vierta en 150ml / 5fl oz del aceite de oliva virgen extra, mezcle hasta que esté bien combinado y reserve.", "Sandwich las rodajas de ternera entre dos hojas largas de película adhesiva. Golpéelos con un rodillo hasta que tengan un grosor aproximado de 1 cm / ½, luego agréguelos al aceite Herby y revuelva para cubrir. Dejar de lado.", "Pique finamente las hierbas restantes y agréguelas a un recipiente con la chalota. Zest más de dos de los limones, luego cortar de nuevo. Agregue las anchoas y pique de nuevo, luego mezcle la mostaza de Dijon y las alcaparras y pique hasta que estén finas. Sazonar, al gusto, con sal y pimienta negra recién molida, luego hacer un bien en el centro de la mezcla.", "Levante las rodajas de ternera del adobo y colóquelas en la barbacoa o en la sartén. Cocine por 2-3 minutos en un lado, luego 2 minutos en el otro lado. Transfiera a un plato de servir.", "Mientras tanto, caliente 50 ml / 2 fl oz del aceite restante en una sartén. Agregue las hojas de espinaca y cocínelas hasta que se marchiten, luego colóquelas en la parte superior de las rodajas de ternera.", "Corta el limón restante en trozos. Rocíe el aceite restante en el pozo en el centro de la mezcla de salsa verde, luego mezcle para formar una pasta espesa. Coloque la salsa verde encima de la ternera y las espinacas. Adorne el plato con las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_veal_escalopes_with_13599", "title": "Veal escalopes with salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "300g / 10½oz de arroz basmati", "450ml / 16fl oz de caldo de pollo", "sal y pimienta negra recién molida", "2 riñones de ternera enteros, limpios y recortados", "5 cucharadas de aceite de oliva", "2 chalotes, picados", "25g / 1oz de mantequilla", "2 cucharadas de aguardiente", "4 cucharadas de vino blanco seco", "Crema doble 250ml / 9fl oz", "2 cucharaditas de mostaza integral", "1 cucharadita de mostaza Dijon", "1 cucharadita de hierba mixta o mostaza estragón", "50 g / 1¾oz de mantequilla sin sal", "1-2 dientes de ajo picados", "50 g / 1¾oz de espinaca (hoja grande o bebé)"], "method": ["Para el arroz pilaf, caliente la mantequilla y el aceite de oliva en una sartén grande a fuego medio. Agregue la cebolla y el ajo y fría por 2-3 minutos, o hasta que estén blandos. Agregue el arroz y mezcle bien para cubrir. Verter en el caldo, remover bien y luego llevar la mezcla a ebullición.", "Reduzca el fuego hasta que el líquido hierva a fuego lento. Cubra la olla con una tapa o papel de aluminio y continúe cocinando a fuego lento durante 15-18 minutos, hasta que el arroz haya absorbido el caldo y esté tierna. Sazonar, al gusto, con sal y pimienta.", "Para los riñones de ternera, corte con cuidado la grasa circundante en los riñones, luego gírelos boca abajo para revelar los tendones grasos. Con la punta de un cuchillo afilado, corte alrededor de los tendones para que los riñones salgan limpios. Divida los riñones en trozos pequeños, siguiendo los lóbulos naturales tanto como sea posible.", "En una sartén de base pesada, caliente un poco de aceite de oliva hasta que esté caliente. Agregue los riñones y sazone ligeramente con sal y pimienta. Cocine por 3-4 minutos (dependiendo del tamaño), girando los riñones para sellar todo. Inclínese en un colador para drenar. Los riñones aún deberían estar muy rosados ​​cuando terminen de cocinar en la salsa.", "En la misma sartén, fría los chalotes en la mantequilla a fuego medio, revolviendo con frecuencia, durante 5 minutos sin dejar que se coloreen. Aumente el fuego, agregue el brandy y cocine hasta que el volumen del líquido se reduzca a la mitad. Agregue el vino y vuelva a reducirlo a la mitad. Agregue la crema y reduzca a una salsa ligera. Retire del fuego y mezcle todas las mostazas. Vuelva a calentar suavemente, no hierva o se pondrá amargo. Agregue los riñones y caliente.", "Para servir, derrita la mantequilla en una sartén. Agregue el ajo y fría por 1-2 minutos, luego agregue las espinacas y cocine hasta que se marchiten. Es posible que necesite agregar 1-2 cucharadas de agua si la espinaca comienza a pegarse a la sartén.", "Sirva los riñones, el arroz y las espinacas marchitas en tazones poco profundos con la salsa vertida sobre los riñones."], "url": "www_bbc_co_uk_food_recipes_veal_kidneys_in_a_creamy_76920", "title": "Riñones de ternera en una cremosa salsa de mostaza con arroz pilaf y espinaca marchita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "85g / 3oz de mantequilla", "4 filetes de ternera", "12 tallos de espárragos", "3 cucharadas de caldo de pollo", "4 cucharadas de vino blanco seco", "6 tomates, sin semillas y finamente cortados en cubitos", "1 cucharada de granos de pimienta verde en salmuera, escurridos", "1 cucharada de perejil fresco, picado", "4 cucharadas de aceite de cacahuete", "1 cucharada de vinagre de vino blanco", "2 yemas de huevo", "1 cucharadita de mostaza Dijon", "½ limón, solo jugo", "140ml / ¼ de pinta de aceite de colza", "Aceite de maní 140ml / ¼ pinta", "Puré de 55 g / 2 oz de guisantes cocidos", "sal marina y pimienta negra recién molida"], "method": ["Caliente el aceite y la mantequilla 55 g / 2 oz en una sartén grande. Cocine la ternera a su gusto, luego retírela de la sartén y manténgase caliente.", "Saca la grasa de la sartén y agrega el caldo y el vino. Calienta hasta reducir el volumen a la mitad.", "Para la mayonesa de guisantes, en un tazón grande mezcle las yemas de huevo y la mostaza. Agregue el jugo de limón y gradualmente agregue los aceites. Una vez que se alcanza la consistencia correcta, agregue el puré de guisantes y mezcle bien. Condimentar con sal y pimienta.", "Para la vinagreta, mezcle los tomates con los granos de pimienta verde, el perejil, el aceite de cacahuete y el vinagre de vino blanco. Mezcle el vino blanco y la reducción de caldo de la sartén de cocción.", "Para los espárragos, cocine los espárragos en agua hirviendo con sal durante 3-5 minutos, hasta que estén tiernos. Retirar y sumergir en agua helada. Drene bien y quite las puntas. Corta cada tallo en tres.", "Derretir la mantequilla restante en una sartén. Agregue las puntas y los tallos picados y cocine durante tres minutos.", "Para servir, ponga la mayonesa en el medio del plato y espolvoree sobre los tallos de espárragos picados. Coloque la ternera encima y gotee la vinagreta por el exterior del plato. Termina con puntas de espárragos."], "url": "www_bbc_co_uk_food_recipes_veal_fillet_on_pea_29783", "title": "Filete de ternera sobre mayonesa de guisantes con vinagreta de tomate y pimiento verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2oz de pecho de ternera, cortado en cubos de 4cm / 1½ pulgadas", "1 cebolla grande, pelada, dejada entera, tachonada con 2 dientes", "2 zanahorias, peladas", "1 puerro, solo parte blanca", "1 ramo de garni (paquete de 1 ramita de perejil recién hecho, 1 ramita de tomillo fresco y 1 hoja de laurel fresca)", "sal al gusto", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente cortado en cubitos", "300g / 11oz de arroz basmati", "450ml / 16floz de caldo de pollo", "24 cebollas cóctel pequeñas, peladas", "líquido de cocción de la ternera (ver arriba)", "250g / 9 oz pequeños champiñones, cortados", "líquido de cocción de las cebollas y los champiñones (ver arriba)", "300 ml / 11 fl oz crema doble", "2 yemas de huevo de gallinas camperas,", "2 cucharadas de crema", "sal y pimienta negra recién molida"], "method": ["Para la ternera, coloque los cubos de carne en una cacerola grande, cubra con agua fría y lleve a ebullición.", "Cuando el agua esté hirviendo, reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego cocine a fuego lento durante 30 minutos, eliminando cualquier espuma que se acumule en la superficie del líquido a intervalos.", "Agregue las verduras, bouquet garni y una pizca de sal, o al gusto. Continúe cocinando a fuego lento durante 1 hora y 20 minutos más, agregando más agua según sea necesario para cubrir la ternera y las verduras. (NB: El contenido del recipiente debe estar cubierto por el agua en todo momento).", "Mientras la carne hierve a fuego lento, decante cuidadosamente 500 ml / 18floz del líquido de cocción.", "Mientras tanto, para el arroz pilaf, caliente la mantequilla y el aceite de oliva en una sartén a fuego medio. Agregue la cebolla y el ajo y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue el arroz y mezcle bien para cubrir.", "Vierta en el caldo, revuelva bien, luego lleve la mezcla a ebullición.", "Reduzca el fuego hasta que el líquido hierva a fuego lento. Cubra la sartén y continúe cocinando a fuego lento durante 15-18 minutos hasta que el arroz haya absorbido el caldo y esté tierna. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para las cebollas y los champiñones, coloque las cebollas de cóctel en una sartén por separado y vierta sobre el líquido de cocina decantado. Ponga a hervir el líquido de cocción y luego reduzca el fuego hasta que el líquido hierva a fuego lento.", "Continúe cocinando a fuego lento las cebollas durante 10-15 minutos, o hasta que estén tiernas. Agregue los champiñones, cubra la olla con una tapa y continúe cocinando a fuego lento por otros 10 minutos o hasta que los vegetales estén tiernos.", "Escurra las cebollas y los champiñones, recogiendo el líquido de cocción en la sartén con la ternera. Mantenga calientes las cebollas y los champiñones.", "Cuando las piezas de ternera estén tiernas, quítelas de la sartén y déjelas a un lado. Mantener caliente", "Para la salsa, cuele el líquido de cocción de las cebollas y los champiñones en una olla limpia (deseche las verduras).", "Haga hervir el líquido de cocción y continúe hirviendo durante 12-15 minutos, o hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema doble y luego vuelva a hervir durante otros 4-5 minutos.", "Mientras tanto, en un tazón, mezcle las yemas de huevo y la crema fresca hasta que estén bien combinados.", "Retire la sartén del fuego y agregue la yema de huevo y la mezcla de crème fraîche. Revuelva continuamente hasta que la mezcla esté completamente incorporada y la salsa se haya espesado ligeramente. Sazone al gusto, con sal y pimienta negra recién molida, luego cuele la mezcla a través de un colador fino.", "Para servir, espolvorea un poco de ternera, cebollas y champiñones en el centro de cada uno de los seis a ocho platos para servir. Rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_vealblanquette_92615", "title": "Blanquette de ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas de ternera, recortadas", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cucharadas de eneldo fresco picado", "2 cucharadas de perifollo fresco picado", "2 cucharadas de cebolletas frescas picadas", "Pan rallado japonés de 75g / 3oz (también se vende como panko)", "50g / 2oz de mantequilla", "500g / 1lb 2 oz de harina común", "4 huevos de gallinas camperas", "2 cucharadas de crema doble", "2 cucharadas de eneldo fresco picado", "2 cucharadas de cebolletas frescas picadas", "2 cucharadas de perifollo fresco picado", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "300 ml / 11 fl oz de carne de vacuno o ternera", "110ml / 4fl oz) de vino tinto", "50g / 2oz de mantequilla"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para la carne de ternera, sazone la carne de ternera con sal y pimienta negra recién molida, luego frote el aceite de oliva en la ternera.", "Mezcle las hierbas y las migas de pan en un recipiente hasta que estén bien combinadas. Presione las chuletas de ternera en el pan rallado para cubrir.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y, cuando haga espuma, agregue las chuletas de ternera. Freír por 2-3 minutos en cada lado, o hasta que estén doradas. Coloque en el horno durante 8-10 minutos, o hasta que estén cocidos.", "Para el spätzle, ponga a hervir un cazo de agua con sal.", "Mezcle todos los ingredientes spätzle, excepto la mantequilla y el aceite de oliva, en un procesador de alimentos para formar una masa. Sazone al gusto con sal y pimienta negra recién molida.", "Coloque una cucharada de la masa sobre una superficie de trabajo limpia. Con la palma de su mano, enrolle la masa en forma de salchicha delgada de 2-3 cm de largo. Repita con el resto de la mezcla.", "Con cuidado, deje caer el spätzle en el agua hirviendo y cocínelo durante 1-1½ minutos. Drene y enjuague con agua helada para refrescar.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla, el aceite de oliva y el spätzle y freír durante 1-2 minutos hasta que estén coloreados.", "Para la salsa, coloque el caldo en una cacerola, lleve a ebullición, baje el fuego y cocine a fuego lento durante 5-7 minutos hasta que el líquido se haya reducido en dos tercios.", "Agregue el vino tinto y repita, cocinando hasta que el líquido se haya reducido en dos tercios.", "Agregue la mantequilla, sazone al gusto con sal y pimienta negra recién molida, y mezcle hasta que la salsa esté brillante.", "Para servir, coloca una chuleta de ternera en cada plato de servir. Agregue una porción del spätzle al lado y vierta una cucharada de salsa de vino tinto sobre la ternera."], "url": "www_bbc_co_uk_food_recipes_vealchopwithspatzlea_89437", "title": "Chuleta de ternera con spaetzle y salsa de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 escalopes de ternera de 175g / 6oz o 4 chuletas de 275g / 10oz", "8 hojas de salvia fresca, 4 finamente picadas", "50g / 2oz de queso parmesano, recién rallado", "sal", "pimienta negra recién molida", "4 rebanadas finas de jamón de Parma", "50g / 2oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "4 pimientos asados", "1 bola de mozzarella de búfala, cortada en 8 rebanadas", "4 cucharadas de vino blanco seco", "4 cucharadas de caldo de ternera", "300g / 10½oz de judías verdes", "1 cucharada de aceite de oliva", "puñado de menta picada", "1 limón, solo jugo", "1 diente de ajo, en rodajas finas"], "method": ["Coloque los escalopes o las chuletas en un tablero, cúbralos con película adhesiva y bata cada uno con un mazo de carne o un rodillo hasta que midan aproximadamente 5 mm / ¼ de grosor.", "Coloque una hoja de salvia en el centro de cada escalope, espolvoree con queso parmesano y sazone con una cantidad escasa de sal y un rechinar decente de pimienta negra. Cubra cada una con una loncha de jamón de Parma, empujando hacia abajo para que el jamón se selle al escalope.", "Caliente la mitad de la mantequilla y el aceite en una sartén grande de base pesada. Cocine los escalopes, con el lado del jamón de Parma hacia abajo, durante dos minutos, luego voltéelos y cocínelos durante un minuto más en el otro lado. Retírelo y déjelo a un lado para mantenerlo caliente, con el lado del jamón hacia arriba, reservando la sartén y sus jugos.", "Precalienta tu parrilla. Coloque dos rodajas de pimienta y mozzarella en cada escalope, luego asa los escalopes hasta que el queso se derrita.", "Mientras tanto, agregue la salvia picada a la sartén y cocine durante 30 segundos. Verter el vino y el caldo y hervir para emulsionar y reducir a la mitad. Agregue la mantequilla restante y sazone al gusto.", "Coloque un escalope en cada uno de los cuatro platos calentados, ponga una cuchara sobre la salsa de mantequilla de salvia y sirva con papas nuevas.", "Para las judías verdes, cocine a fuego lento las judías verdes hasta que estén tiernas.", "Mezcle con los ingredientes restantes y sirva."], "url": "www_bbc_co_uk_food_recipes_vealescalopeswithpar_72315", "title": "Escalopes de ternera con jamón, salvia y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "Ternera de 100 g / 3½ oz, aplanada con un mazo de carne o rodillo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "85g / 3 oz champiñones, descuartizado", "1 diente de ajo, aplastado", "1 cucharada de mostaza de grano", "2 cucharadas de crema coagulada", "sal y pimienta negra recién molida", "2 cucharadas de cebolletas frescas picadas", "puñado de hojas de hierba fresca"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el escalope de ternera, caliente el aceite y la mantequilla en una sartén y sazone la ternera con sal y pimienta negra recién molida. Freír durante 1-2 minutos en ambos lados, o hasta que estén dorados, luego transferir al horno durante 4-5 minutos, o hasta que estén bien cocidos. Retire y deje reposar en un plato caliente.", "Para las setas de crema de ajo, caliente el aceite y la mantequilla en una sartén y fríe los champiñones y el ajo por 4-5 minutos, o hasta que los champiñones estén dorados. Agregue la mostaza, la crema y la sazón, al gusto, con sal y pimienta negra recién molida. Cocine por otros 2-3 minutos, luego agregue las cebolletas.", "Con una cuchara, coloca los champiñones cremosos en un plato para servir y coloca la ternera encima. Coloque un puñado de hierbas frescas al lado y sirva."], "url": "www_bbc_co_uk_food_recipes_vealescalopewithgarl_90138", "title": "Escalope de ternera con champiñones crema de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco", "1 cucharada de albahaca fresca picada", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas", "1 cucharada de perifollo fresco picado", "1 diente de ajo, picado", "sal y pimienta negra recién molida", "100 g / 3½ oz de ternera", "2 cucharadas de harina normal", "2 huevos de gallinas camperas, golpeados", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "1 manzana de postre, pelada, sin corazón y picada", "Tomates cherry 55g / 2oz, descuartizados", "½ cebolla roja, en rodajas", "2 cucharadas de azúcar moreno", "2 cucharadas de vinagre balsámico"], "method": ["Para la ternera, coloque el pan, las hierbas, el ajo, la sal y la pimienta negra recién molida en un procesador de alimentos y métalo a migas. Incline hacia una bandeja para hornear.", "Polvore la ternera en la harina, luego sumerja el huevo batido y cúbralo en las migas de pan. Caliente la mantequilla en una sartén a prueba de horno hasta que haga espuma, luego fríe la ternera durante 2-3 minutos en ambos lados, o hasta que se dore. Transfiera al horno para cocinar por otros 5-6 minutos, o hasta que esté crujiente y cocido.", "Para los ragu, coloque todos los ingredientes ragu en una olla pequeña y cocine durante 6-8 minutos, o hasta que las manzanas estén tiernas.", "Coloque el ragu en un plato para servir y coloque el escalope encima."], "url": "www_bbc_co_uk_food_recipes_vealschnitzelwithapp_90137", "title": "Escalope de ternera con ragú de manzana y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Escalope de ternera 100g / 3¾oz", "75g / 2¾oz de pan rallado", "1 cucharada de aceite de oliva", "25 g / 1 oz de mozzarella, en rodajas", "1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "3 cucharadas de vinagre de vino tinto", "4 cucharadas de azúcar moreno"], "method": ["Precalentar la parrilla a alto.", "Cubra la ternera en las migas de pan. Calentar el aceite de oliva en una sartén a prueba de horno y freír la ternera hasta que se dore por ambos lados.", "Coloque las rodajas de mozzarella encima de la ternera y transfiéralas a la parrilla por tres minutos o hasta que el queso se haya derretido.", "Para la salsa picante, caliente el aceite de oliva en una olla pequeña. Agregue la cebolla y el ajo y fría hasta que estén dorados.", "Agregue el vinagre y el azúcar moreno y cocine a fuego lento durante 5-6 minutos.", "Sirve el chutney encima de la ternera."], "url": "www_bbc_co_uk_food_recipes_vealwithonionchutney_76986", "title": "Escalopes de ternera con salsa picante de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6-8 cucharadas de aceite de oliva", "½ cebolla roja grande o 1 pequeña, finamente picada", "2 dientes de ajo", "sal y pimienta negra recién molida", "2 x 400g / 14oz latas de tomates picados", "200ml / 7fl oz de caldo de verduras", "Escalopes de ternera de 4 x 175 g / 6oz", "harina, para quitar el polvo", "1 bola de mozzarella de búfala, cortada en 4 rebanadas"], "method": ["Calienta la mitad del aceite de oliva en una sartén. Freír la cebolla durante 5-7 minutos hasta que esté suave y translúcida.", "Agregue los dientes de ajo enteros y cocine durante aproximadamente un minuto. Sazonar con sal y pimienta negra recién molida.", "Agregue los tomates picados y el caldo. Deje que la mezcla hierva a fuego lento y reduzca durante aproximadamente 40 minutos. Es posible que desee agregar más caldo y dejar que hierva durante más tiempo, o agregar más aderezo, según el gusto.", "Coloque los escalopes de ternera en un tablero y cúbralos en una película adhesiva. Batir cada uno con un mazo de carne o rodillo hasta que tengan aproximadamente 1 cm / ½ pulgada de grosor.", "Cubra la ternera en harina, sal y pimienta negra recién molida, luego caliente el aceite de oliva restante y saltee la ternera durante 2-3 minutos por cada lado.", "Agregue la salsa a la sartén, luego coloque una rebanada de queso mozzarella en cada escalope de ternera y una cucharada de salsa encima. Cocine a fuego lento durante cinco minutos.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_vealwithtomatoandmoz_82881", "title": "Ternera con tomate y mozzarella", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de tofu de seda, escurrido", "150g / 5½oz de chocolate negro vegano, roto en pedazos", "1 vaina de vainilla, solo semillas", "½ cucharadita de anís estrellado molido", "2 cucharadas de melaza", "jarabe de agave, al gusto", "20 g / ¾oz de almendras copos tostadas, para servir", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½fl oz de jarabe de glucosa", "2 cucharadas de jarabe de oro", "pellizcar bicarbonato de soda", "1 cucharada de aceite vegetal", "4 albaricoques en conserva", "1 estrella de anís", "azúcar pizca"], "method": ["Ponga el tofu en un tazón y mezcle con una batidora de mano hasta que tenga un puré.", "Derrita el chocolate en un recipiente de vidrio a prueba de calor, sobre una olla de agua hirviendo a fuego lento, teniendo cuidado de que el recipiente no toque el agua.", "Agregue el tofu, el anís estrellado molido, las semillas de vainilla y el jarabe de agave, al gusto. Poner en un vaso y refrigerar hasta que esté listo.", "Alinee una bandeja para hornear con papel de hornear.", "Para hacer el panal, coloca el azúcar, la glucosa y el jarabe dorado en una olla profunda y caliéntalo hasta que alcance los 145ºC. (Esto debería demorar unos 5 minutos).", "Rápidamente mezcle el bicarbonato de soda. Tenga cuidado ya que la mezcla va a aparecer muy repentinamente. Vierta rápidamente sobre la bandeja de horno forrada. Aparta para enfriar y endurecer.", "Para hacer los albaricoques, caliente el aceite en una sartén. Agregue los albaricoques y el anís estrellado y cocine hasta que los albaricoques comiencen a caramelizarse. Espolvorea una pizca de azúcar y déjala enfriar.", "Para servir, espolvorear las almendras tostadas en la parte superior de la mousse y servir con los albaricoques y el panal."], "url": "www_bbc_co_uk_food_recipes_vegan_chocolate_mousse_39814", "title": "Mousse de chocolate vegano con albaricoque y albaricoques caramelizados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de aceite de coco, más extra para engrasar", "100 g / 3½ oz de cacao en polvo", "6 cucharadas de jarabe de arce", "2 cucharaditas de extracto de vainilla", "1 cucharadita de extracto de naranja", "pizca de sal", "60g / 2¼oz de bayas de goji (disponibles en tiendas de productos saludables)", "½ naranja orgánica, solo ralladura, en juliana"], "method": ["Engrase un plato de vidrio rectangular pequeño (aproximadamente 17 cm / 7 pulgadas x 11 cm / 4 pulgadas) con un poco de aceite de coco. Línea con pergamino para hornear.", "Caliente el aceite de coco en una cacerola a fuego lento hasta que se derrita. Batir el cacao en polvo hasta que esté suave y bien combinado.", "Agregue el jarabe de arce, el extracto de vainilla, el extracto de naranja y la sal hasta que estén bien combinados, luego agregue casi todas las bayas de Goji, reservando un puñado pequeño para la decoración.", "Vierta la mezcla de chocolate en la lata preparada, luego espolvoree sobre las bayas de goji restantes y la ralladura de naranja, presionándolas suavemente sobre la superficie.", "Enfríe en la nevera durante 1 hora o hasta que esté listo.", "Rebane con un cuchillo afilado y sirva."], "url": "www_bbc_co_uk_food_recipes_vegan_chocolate_orange_20436", "title": "Mordeduras de trufa de naranja y chocolate vegano", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Hace 24 piezas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_chocolate_orange_20436_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Calabaza de 400g / 14oz, cortada en rondas de 2.5cm / 1in", "150 g / 5½ oz de mantequilla de anacardo", "1 cucharada de jalapeños en vinagre, más 1 cucharada de jugo de decapado", "1 diente de ajo grande, finamente picado", "3-4 cucharadas de levadura nutricional", "3 cucharadas de leche de almendras (o leche vegana alternativa)", "½ limón, solo jugo", "sal y pimienta negra recién molida", "7 envolturas de tortillas integrales, cada una cortada en 6 triángulos", "7 envolturas de tortillas blancas, cada una cortada en 6 triángulos", "4 tomates medianos, toscamente picados", "2 cebollas rojas, más o menos picadas", "2 aguacates, cortados a la mitad y toscamente picados", "puñado de cilantro fresco, toscamente picado"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee una bandeja de hornear con papel de hornear.", "Coloque la calabaza en la bandeja de hornear y tueste durante 30 minutos, o hasta que esté suave y se libere la humedad de la carne. Dejar de lado para enfriar.", "Mientras tanto, distribuya las tortillas sobre unas bandejas para hornear (asegurándose de que no se superpongan, si es posible) y hornee durante 15-20 minutos, volteándolas hasta la mitad de la cocción.", "Retire la piel de la pulpa de calabaza y deséchela. Ponga la calabaza en un procesador de alimentos con los ingredientes restantes de la salsa y mezcle hasta que quede muy suave.", "Esparce un tercio de las tortillas crujientes en un plato resistente al horno, cubre con un tercio de los tomates, cebolla y salsa. Repita este proceso hasta que todo se haya agotado. Cubra con el aguacate y el cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_vegan_nachos_02050", "title": "Nachos veganos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_nachos_02050_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de aceite de coco, derretido, más extra para engrasar", "160 g / 5¾ oz de almendras molidas", "Una pizca de sal marina", "pellizcar bicarbonato de soda", "1½ cucharada de jarabe de arce", "½ cucharadita de extracto de vainilla", "250g / 9oz de ciruelas suaves", "5 cucharadas de aceite de coco", "3 cucharadas de jugo de jengibre recién prensado (disponible en línea o consulte la sugerencia)", "2 cucharaditas de jengibre de raíz finamente rallado", "3 cucharaditas de extracto de vainilla", "2 pizca de sal"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase ligeramente 4 latas de tarta minúscula, 10cm / 4in de diámetro, con un poco de aceite de coco.", "Para la masa, pulse todos los ingredientes de la masa en un procesador de alimentos hasta que la mezcla se una como masa. Gire sobre una superficie de trabajo limpia y presione una bola suave, usando sus manos. Envuelva la película adherida y déjela enfriar durante 10 minutos en la nevera.", "Cortar la masa en 4 piezas del mismo tamaño, luego enrollar cada una en una bola. Aplane cada bola entre las palmas de sus manos, luego coloque en las latas de tartas preparadas. Use los dedos para extender y alisar la masa fina y uniformemente sobre la base y los lados de cada lata. No se preocupe por romper la masa, simplemente repare los agujeros y apunte al acabado más fino posible. Elimine cualquier exceso de hojaldre con un cuchillo afilado. Pinche la base de cada caja de pastelería varias veces con un tenedor. Enfriar en la nevera durante al menos 20 minutos.", "Hornee durante 10-12 minutos o hasta que los bordes estén dorados claros. Retírelo y déjelo a un lado para que se enfríe y se caliente. Suavemente, coloque las cajas de repostería en una rejilla de alambre y déjelas a un lado para que se enfríen por completo.", "Mientras tanto, para el relleno, mezcle todos los ingredientes en un procesador de alimentos hasta que quede suave. Agregue más jengibre y sal, al gusto.", "Extienda la mezcla de relleno en las cajas de tartas refrigeradas, alisándolas en una capa uniforme. Enfríe en el refrigerador hasta que sea necesario, o sirva a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_vegan_prune_and_ginger_17804", "title": "Vegano ciruela y tarta de jengibre con pasteles de almendras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_prune_and_ginger_17804_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "55g / 2oz de azúcar glasé", "Margarina de soja 55 g / 2 oz"], "method": ["Tamiza la harina y el azúcar glas en un tazón grande y agrega la margarina de soja.", "Use las puntas de los dedos para frotar la grasa en la harina hasta que tenga una mezcla que se asemeje a pan rallado grueso sin grandes trozos de margarina restantes. Intente trabajar rápidamente para que no se vuelva grasoso.", "Junta la mezcla para formar una masa, agregue harina adicional si la mezcla está demasiado húmeda, o un poco de agua si está demasiado seca, una cucharadita a la vez.", "Envuelva la masa en una película adhesiva y déjela enfriar durante 10-15 minutos antes de usarla."], "url": "www_bbc_co_uk_food_recipes_veganpastry_83823", "title": "Pastelería vegana dulce vegana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para una lata de flan de 9 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 puerro, cortado en trozos pequeños", "1 zanahoria grande, cortada en pequeños trozos", "1 batata, cortada en pequeños trozos", "1 tallo de apio, cortado en pequeños trozos", "sal marina y pimienta negra recién molida", "1 cucharadita de comino molido", "1 x 400 g / 14 oz pueden cortar tomates", "2 cucharadas de vinagre balsámico", "tomillo pequeño racimo, atado con una cuerda (opcional)", "570ml / 1 pinta de caldo de verduras", "150 g / 5 oz de judías verdes, recortadas", "1 salchicha de chorizo ​​crudo (alrededor de 110 g / 4 oz), cortado en trozos pequeños"], "method": ["Caliente el aceite de oliva en una sartén grande a fuego medio. Agregue el puerro, la zanahoria, la batata y el apio y fría por 10-12 minutos, o hasta que las verduras comiencen a ablandarse pero no coloreen.", "Sazone con sal y pimienta negra recién molida y agregue el comino, los tomates, el vinagre balsámico, el tomillo, el caldo de verduras y las judías verdes. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 40-45 minutos, o hasta que las verduras estén tiernas.", "Mientras tanto, caliente una sartén a fuego medio-alto y fría el chorizo ​​durante 10-12 minutos, o hasta que esté crujiente y dorado.", "Retire el tomillo de la sopa y agregue el chorizo. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sirva la sopa en tazones de sopa calientes y sirva con pan crujiente en el costado."], "url": "www_bbc_co_uk_food_recipes_vegetable_and_chorizo_81634", "title": "Sopa de verduras y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_and_chorizo_81634_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas de primavera, en rodajas", "¼ de pimiento fresco, picado", "50g / 2oz de judías verdes, recortadas", "4 baby sweetcorn", "4 papas nuevas baby, descuartizadas", "1 cucharadita de pasta de curry madras", "100g / 3½oz de tomates picados", "2-3 florecillas de coliflor fresca"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque todos los ingredientes y 125ml / 4fl de agua en un plato tapado para horno pequeño y mezcle hasta que estén bien combinados.", "Cubra con la tapa y hornee en el horno durante 30-40 minutos, o hasta que las papas estén cocidas."], "url": "www_bbc_co_uk_food_recipes_vegetable_bhuna_17476", "title": "Asado de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 zanahoria pequeña, pelada, cortada en cubos pequeños", "1 patata mediana, pelada, cortada en un cubo pequeño", "¼ de pimiento verde, cortado en cubitos", "¼ de pimiento rojo, cortado en cubitos", "25g / 1oz de judías verdes, finamente picadas", "50g / 2oz de guisantes congelados", "1 cucharadita de puré de tomate", "½ cucharadita de chiles verdes finamente picados", "1 cucharadita de sal masala", "¼ cucharadita de cúrcuma molida", "225g / 8oz de arroz basmati cocido", "1 cebolla pequeña, finamente picada", "4 anacardos tostados, picados", "½ cucharadita de semillas de comino, tostadas", "½ cucharadita de chile rojo en polvo", "yogur, para servir"], "method": ["Precalentar el horno a 170 ° C / 235 ° F / Gas 3.", "Cocine la zanahoria, la patata, los pimientos, los frijoles y los guisantes en una olla con agua hirviendo durante 3-4 minutos, o hasta que estén tiernos. Drene y regrese a la sartén.", "Agregue el puré de tomate, los chiles verdes, el garam masala y la cúrcuma a las verduras y mezcle hasta que estén bien combinados.", "Coloque la mitad del arroz en el fondo de un plato resistente al horno, extienda la mezcla de verduras en la parte superior, y luego coloque el resto del arroz en la parte superior, extendiéndolo de manera uniforme.", "Espolvoree la capa superior de arroz con las cebollas picadas, los anacardos, las semillas de comino y el chile rojo en polvo. Cubra con papel de aluminio y hornee durante 15 minutos.", "Sirve con yogurt."], "url": "www_bbc_co_uk_food_recipes_vegetable_biryani_50072", "title": "Biryani vegetal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_biryani_50072_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pastinaca", "2 remolachas, busque variedades amarillas o anaranjadas, así como púrpura", "1 zanahoria", "1 litro / 1¾ pintas de aceite vegetal", "sal al gusto"], "method": ["Cortar las verduras con una mandolina japonesa.", "Caliente el aceite en una freidora de grasa o en una cacerola a 180 ° C / 350 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue un tipo de verduras en rodajas a la grasa caliente a la vez y una vez doradas y cocidas, retírelas con una espumadera y transfiéralas a un plato forrado con papel de cocina. Repita con los tres tipos de vegetales.", "Espolvorea con sal para servir."], "url": "www_bbc_co_uk_food_recipes_vegetable_crisps_47848", "title": "Patatas fritas vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 papa grande, pelada y cortada en cubos de 2cm / ¾in", "1 calabaza pequeña, pelada, sin semillas y cortada en cubos de 2cm / ¾in", "1 berenjena, cortada en cubos de 2cm / ¾in", "6 cucharadas de pasta de curry tikka masala", "3 cucharadas de aceite vegetal", "2 cebollas, finamente cortadas", "700 g / 1 libra de tomates de 9 oz, picados", "Leche de coco de estaño 400ml", "2 pimientos rojos, cortados en rodajas gruesas", "2 calabacines, cortados en cubos de 2cm / ¾in", "algunas ramitas de cilantro, para servir", "sal y pimienta negra recién molida", "500g / 1lb 2 oz de harina blanca lisa", "1 cucharadita de polvo de hornear", "1 cucharada de sal", "400ml / 14fl oz de leche entera", "50ml / 2fl oz de aceite vegetal", "4 tomates frescos, toscamente picados", "2 dientes de ajo, finamente picados", "100g / 3½oz de mantequilla o ghee, derretida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para preparar el curry, coloque la papa, la calabaza y la berenjena en una lata grande para asar y cúbrala con 2 cucharadas de pasta de masala y 2 cucharadas de aceite. Sazone con sal y pimienta y tueste durante 30 minutos.", "Calentar el aceite restante en una cacerola grande a fuego medio y freír las cebollas durante 10 minutos, hasta que estén suaves y doradas. Agregue la pasta de masala restante y cocine por otros 3 minutos. Agregue los tomates, leche de coco y 100 ml / 3½ fl oz de agua. Llevar a ebullición y cocine a fuego lento durante 10 minutos.", "Agregue los vegetales tostados a la sartén, junto con los pimientos y los calabacines y cocine a fuego lento durante 10-15 minutos, hasta que estén tiernos.", "Para hacer el naan, precaliente el horno a 230C / 210C Fan / Gas 8.", "Coloque la harina, el polvo de hornear, la sal, la leche y el aceite en un tazón grande y mezcle para formar una masa suave. Permita descansar por 1 hora.", "Estirar la masa en formas naan y cubrir con los tomates y el ajo. Hornee por 10 minutos hasta que se infle. Puedes terminar el naan bajo una parrilla caliente si lo deseas.", "Esparce el curry con cilantro y sirve con los panes naan al costado."], "url": "www_bbc_co_uk_food_recipes_vegetable_curry_with_43231", "title": "Curry de verduras con tomate y ajo naan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]