[{"isVegetarian": false, "title": "Big kids’ raspberry blancmange", "url": "www_bbc_co_uk_food_recipes_big_kids_raspberry_43909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 gelatine leaves", "750g/1lb 10oz fresh raspberries", "100g/3½oz icing sugar", "1 heaped tbsp cornflour", "250ml/9fl oz full-fat milk", "1 tsp vanilla extract", "250ml/9fl oz double cream", "2-3 sprigs lemon verbena, leaves only, to decorate"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the gelatine leaves in a bowl of cold water for a few minutes, until softened.", "Meanwhile, blend 600g/1lb 5oz of the raspberries and all but 2 tablespoons of the icing sugar to a purée in a food processor. Strain the mixture through a fine sieve into a bowl, discarding the seeds.", "In a bowl, whisk the cornflour and the remaining icing sugar with 75ml/3fl oz of the milk to form a smooth, thick paste. Stir in the remaining milk and vanilla extract until smooth and well combined, then pour the mixture into a saucepan and heat until just simmering.", "Simmer for a couple of minutes until the mixture has thickened slightly, then squeeze the soaked gelatine leaves dry and add them to the mixture, stirring constantly until dissolved.", "Remove the pan from the heat and whisk in the double cream and 150ml/5fl oz of the raspberry purée until well combined.", "Pour the blancmange mixture into the moulds and chill in the fridge for at least 4 hours.", "When ready to serve, remove the moulds from the fridge and quickly dip them into a bowl of hot water to loosen the blancmange. Invert the moulds onto serving plates. Serve with the remaining raspberry purée, garnished with the remaining whole fresh raspberries and the lemon verbena leaves. "]}, {"isVegetarian": true, "title": "Biker’s cherry pecan brownies", "url": "www_bbc_co_uk_food_recipes_bikers_chocolate_46736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, plus extra for greasing", "175g/6oz caster sugar", "175g/6oz soft light brown sugar", "4 large free-range eggs", "100g/3½oz plain flour", "50g/1¾oz cocoa powder", "125g/4½oz plain dark chocolate ", "125g/4½oz white chocolate", "100g/3½oz shelled pecan nuts (or walnuts)", "70g/2½oz packet dried sour cherries  "], "serves": "Makes 16-20 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C (fan)/Gas 5. Lightly butter a 20x30cm/8x12in rectangle brownie or tray bake tin and line the base and sides with a large sheet of baking parchment. ", "Put the butter in a medium saucepan and place over a very low heat until only just melted. Remove the butter from the heat and stir in the sugars until well combined. Whisk the eggs in a large bowl until smooth and slowly pour the butter and sugar mixture on top, stirring constantly until well combined.", "Put the flour and cocoa powder in a sieve and sift on top of the egg and butter mixture. Beat hard with a wooden spoon until smooth. Leave to cool for 10 minutes. (This will prevent the chocolate chunks melting too quickly when they are added to the batter.)", "Put all the chocolate on a board and cut into chunky pieces with a large knife. You want the chunks to be around 1.5cm/¾in. Break the pecan nuts or walnuts in half. Stir the chocolate pieces, cherries and nuts into the cake batter. Pour into the prepared tin and spread to all the corners with a rubber spatula or the back of a spoon.", "Bake the brownie in the centre of the oven for 25-30 minutes, or until the mixture is crusty on the surface and lightly cooked inside.  Do not allow it to overcook as the cake will become spongy rather than gooey in the centre.", "Remove from the oven and leave to cool for 5-10 minutes. Take out of the tin and transfer to a board. Cut into squares or rectangles to serve warm or leave to cool completely if serving cold. This brownie should keep well for 3-4 days if well wrapped with foil – but we doubt it will last that long!"]}, {"isVegetarian": false, "title": "Bigos stew", "url": "www_bbc_co_uk_food_recipes_bigos_stew_69890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigos_stew_69890_16x9.jpg", "ingredients": ["50g/1¾oz butter", "1 onion, sliced", "1 tsp juniper berries, crushed", "½ tsp caraway seeds", "300g/10½oz lean pork belly, cubed", "1 tbsp brown sugar", "500g/1lb 2oz sauerkraut", "half a white cabbage, shredded", "200g/7oz fresh chopped tomatoes or 400g tin tomatoes", "500ml/18fl oz chicken or beef stock", "10g/¼oz dried mushrooms", "300g/10½oz smoked Polish sausage, such as kabanas, chopped", "1 apple, grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large casserole. Add the onion and sauté over a medium heat until the onion is softened and translucent. Sprinkle over the juniper berries and caraway, then add the pork. Sprinkle over the brown sugar. Turn the heat up high for a couple of minutes, turning the meat so it browns well. ", "Drain the sauerkraut well and give it a rinse if you want to reduce the vinegar flavour. The easiest thing to do is squeeze it out with your hands. Add to the casserole with the white cabbage and chopped tomatoes, then pour over the stock. Simmer for about 30 minutes.", "Soak the dried mushrooms in warm water. When they have softened, drain, adding their soaking liquor to the casserole. Chop the mushrooms finely and add these to the casserole, along with the sausage and apple. ", "Simmer for a further hour and a half and serve or cover overnight and reheat the following day. "]}, {"isVegetarian": false, "title": "Scotch broth", "url": "www_bbc_co_uk_food_recipes_bikers_scotch_broth_91406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bikers_scotch_broth_91406_16x9.jpg", "ingredients": ["75g/3oz pearl barley", "1.15kg/2½lb lamb shoulder", "2 litres/3½ pints cold water or lamb stock", "2 onions, chopped", "1 bay leaf", "bunch fresh thyme", "2 carrots, cut in 2.5cm/1in pieces", "2 turnips, cut in 2.5cm/1in pieces (optional)", "2 celery stalks, trimmed, cut in 2.5cm/1in pieces", "1 heaped tsp sea salt flakes, plus extra to taste", "2 potatoes, cut in 2.5cm/1in pieces", "½ savoy cabbage, trimmed, cored and finely shredded", "handful fresh parsley, roughly chopped", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the pearl barley into a bowl and cover with cold water. Set aside to soak.", "Meanwhile, pace the lamb in a large saucepan or flameproof casserole and cover with the cold water or lamb stock. Bring to a simmer and skim off the scum. Add the onion, bay leaf and thyme to the pan. Return to a gentle simmer and cook for one hour, skimming occasionally.", "Add the carrots, turnips and celery to the casserole with the lamb. Season with the salt and freshly ground black pepper. Bring to a very gentle simmer, cover with a lid and cook for 30 minutes. ", "After the vegetables and lamb have been simmering for 30 minutes, rinse the pearl barley in a sieve under cold running water. Turn the lamb over. Add the pearl barley and potatoes to the casserole. Cook gently for a further 30 minutes, uncovered. ", "Stir in the cabbage and return to a gentle simmer. Continue cooking uncovered for a further 15 minutes or until the lamb is very tender and is falling off the bone and the barley is softened. Remove the pan from the heat", "Lift the lamb out of the pot with tongs or a large fork and put on a board. Carve off all the meat, slicing or tearing into largish chunks and discarding any skin and bone. Season the broth with more salt and pepper to taste and spoon into large, deep plates. Divide the lamb between the plates and sprinkle with freshly chopped parsley. "]}, {"isVegetarian": false, "title": "Bill Granger's caramel chicken", "url": "www_bbc_co_uk_food_recipes_billgrangerscaramelc_73143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken thigh fillets, skinless, chopped in half", "1 tbsp vegetable oil", "1 red onion, sliced ", "3 garlic cloves, sliced", "55ml/2fl oz dark soy sauce", "110g/4oz brown sugar", "55ml/2fl oz Thai fish sauce", "steamed rice, to serve", "steamed green vegetables, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken and oil in a bowl and toss to combine. Heat a large frying pan over a high heat until hot. Add half the chicken and cook for two minutes on one side until lightly browned, turn and cook for another minute. Remove from the pan and repeat with the remaining chicken. ", "Reduce the heat to medium and add a little extra oil if needed. Add the onion and garlic and cook for five minutes, stirring occasionally. Return the chicken to the pan, season liberally with black pepper, add the soy sauce and stir to combine. ", "Cover the pan, reduce heat to low and cook for 10 minutes, stirring occasionally. Increase the heat to high, add the sugar and stir to combine. Cook uncovered for 3-4 minutes, or until the sauce is rich, dark and syrupy.", "Add the fish sauce and stir to combine. Place in a serving dish and serve with steamed rice and green vegetables."]}, {"isVegetarian": false, "title": "Sausage rolls", "url": "www_bbc_co_uk_food_recipes_bigsausagerolls_86258", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigsausagerolls_86258_16x9.jpg", "ingredients": ["30g/1oz butter", "100g/3½oz button mushrooms, finely chopped ", "1 tbsp Worcestershire sauce", "1 tbsp Tabasco sauce", "1 tbsp dried thyme", "450g/1lb sausage meat (you can easily push the meat out from the skins of readymade sausages)", "salt and freshly ground black pepper ", "450g/1lb ready-rolled puff pastry", "1 free-range egg, beaten"], "serves": "Makes 16-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a large frying pan and fry the mushrooms until soft. Transfer to a large bowl.", "Add the Worcestershire sauce, Tabasco sauce, thyme and sausage meat and season well with salt and freshly ground black pepper. Mix until thoroughly combined.", "Roll the puff pastry out into a large rectangle, then cut into two long rectangles.", "Place a layer of sausage meat mixture down the middle of each pastry rectangle, then brush each with beaten egg on one edge.", "Fold the other side of the pastry over onto the egg-washed edge. Press down to seal and trim any excess. Cut each pastry roll into 8-10 small sausage rolls.", "Place the sausage rolls onto a baking tray and transfer to the oven to bake for 15-20 minutes, or until crisp and golden and the sausage meat is completely cooked through."]}, {"isVegetarian": false, "title": "Bill's spicy sausage pasta", "url": "www_bbc_co_uk_food_recipes_billsspicysausageand_73069", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/billsspicysausageand_73069_16x9.jpg", "ingredients": ["4 Italian sausages", "2 tbsp olive oil", "1 red onion, cut into wedges", "2 garlic cloves, crushed", "400g tin chopped tomatoes", "1 red pepper, cut into strips", "½ tsp chilli flakes", "2 tsp dried oregano", "2 tbsp chopped fresh parsley, optional", "200g/7oz whole wheat fusilli, or pasta of your choice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put a medium non-stick pan over a high heat and brown the sausages in 1 tablespoon of olive oil. Set the browned sausages to one side.", "Reduce the heat to a medium flame and sweat the onions and garlic in the remaining oil for 2 minutes. Add the tomatoes, red pepper, chilli, oregano and sausages to the pan. Simmer covered until the red peppers soften (this should take about 10 minutes).", "Cook the fusilli until al dente (with a bite) according to the manufacturer's instructions.", "Drain the pasta well and put into two bowls with the sauce. Serve with a scatter of chopped parsley over the top."]}, {"isVegetarian": true, "title": "Bircher muesli", "url": "www_bbc_co_uk_food_recipes_bircher_muesli_70498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bircher_muesli_70498_16x9.jpg", "ingredients": ["1 apple", "50g/1¾oz rolled oats", "40g/1½oz raisins", "1 tbsp sunflower seeds", "1 tbsp chia seeds", "125ml/4fl oz cashew milk (or other plant-based milk)", "1 tbsp maple syrup, date syrup or honey (optional)", "handful of blueberries, raspberries or strawberries (optional)"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Grate the apple into a large bowl and discard the core. ", "Add the oats, raisins, seeds and cashew milk and mix well. Add the syrup and berries, if using, and mix again. ", "Transfer the mixture to an airtight jar, seal and refrigerate for at least 6 hours, or up to 3 days. This allows the oats to absorb the milk. Return to room temperature before serving."]}, {"isVegetarian": true, "title": "Muesli", "url": "www_bbc_co_uk_food_recipes_birchermuesli_88972", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/birchermuesli_88972_16x9.jpg", "ingredients": ["100g/7oz oats", "25g/1oz dried apricots, chopped", "25g/1oz dried prunes, chopped", "1 tbsp pumpkin seeds", "1 tbsp sunflower seeds", "fresh berry fruits, to serve", "milk, yoghurt or fruit juice, to serve"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the oats, dried apricots, dried prunes, pumpkin seeds and sunflower seeds together and spoon into a serving bowl.", "To serve, scatter over a handful of fresh berry fruits and pour over the milk, yoghurt or fruit juice."]}, {"isVegetarian": false, "title": "Biscotti with hot mocha dipping sauce", "url": "www_bbc_co_uk_food_recipes_biscotti_with_hot_mocha_60995", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/biscotti_with_hot_mocha_60995_16x9.jpg", "ingredients": ["250g/9oz plain flour (280g/10oz plain flour, if making the chocolate biscotti)", "½ tsp baking powder", "250g/9oz caster sugar", "3 free-range eggs, beaten", "220g/8oz shelled and chopped pistachios", "125g/4½oz dried cranberries, chopped", "1 lemon, zest only", "200g/7oz shelled and chopped hazelnuts", "125g/4½oz dates, chopped", "1 lemon, zest only", "50g/1¾oz melted dark chocolate, cooled to tepid temperature", "25g/1oz chocolate chips\t", "35g/1¼oz chopped almonds", "1 orange, zest only", "½ tsp vanilla essence ", "150g/5½oz good-quality dark chocolate", "150ml/5fl oz double cream", "100ml/3½fl oz espresso coffee", "100g/3½oz small marshmallows", "100ml/3½fl oz honey"], "serves": "Makes 20 portions per base recipe", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the biscotti base, preheat the oven to 160C/325F/Gas 3 (do not use the fan on your oven).", "Mix together the flour, baking powder and sugar in a bowl and add the eggs slowly to make a dough.", "For the pistachio and cranberry biscotti, add the nuts, cranberries and lemon zest at this point. ", "For the hazelnut and date biscotti add the nuts, dates and lemon zest at this point. ", "For the chocolate, almond and orange biscotti, add the tepid melted chocolate to the base dough and mix in thoroughly before adding the chocolate chips, almonds, orange zest, and vanilla essence.", "Knead the mixture gently and then separate and roll into two logs. Place on a lined baking tray and bake for 25 minutes in the preheated oven.", "Cool slightly and cut into 1-2cm/½-¾in thick slices.", "Return to the tray to the oven and bake for another 10-15 minutes, turn over and continue to bake for another 10-15 minutes until golden-brown. ", "For the mocha sauce, combine all ingredients in a heavy-based saucepan and heat them gently, stirring constantly until all the marshmallows and chocolate have melted. ", "Serve the hot mocha sauce in a cup with the biscotti on the side to dunk in."]}, {"isVegetarian": true, "title": "Biscotti with limoncello", "url": "www_bbc_co_uk_food_recipes_biscotti_with_limoncello_55604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz caster sugar", "3 unwaxed lemons, zest and juice", "350ml/12fl oz eau-de-vie (colourless fruit liqueur), 40-80% proof, or vodka", "250g/9oz plain flour", "250g/9oz caster sugar", "1½ tsp baking powder", "2 free-range eggs, lightly beaten", "90g/3¼oz sultanas", "90g/3¼oz raisins", "90g/3¼oz dried sour cherries", "115g/4oz dried apricots, roughly chopped", "1 lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the limoncello, heat the sugar and 75ml/5 tbsp water in a saucepan over a medium heat. Stir to dissolve the sugar. ", "Bring the mixture up to the boil, then simmer briskly for 3-4 minutes until the bubbles look syrupy. Remove from the heat and leave to cool. ", "Add the lemon zest and juice to the syrup while it is still slightly warm. Then add the eau-de-vie or vodka. ", "Pour the limoncello into a sterilised bottle or jars and seal. Leave in a cool, dark place for 24 hours, shaking occasionally, then strain into a clean bottle.", "Put in the freezer for several hours before serving. The liqueur is best served in frozen shot glasses.", "Method for biscotti, preheat the oven to 180C/350F/Gas 4 and line a baking tray with parchment.", "Mix the flour, sugar and baking powder together in a large bowl. ", "Add half the beaten eggs and mix well, then add half of what’s left and mix again.", "Now add the last quarter a little bit at a time until the dough takes shape but isn’t too wet (you may not need to use all the eggs). ", "Add the dried fruit and lemon zest and mix well.", "Divide the dough in half, and each half into a sausage shape and place on the baking tray, leaving at least a 6cm/2½in gap between them.", "Lightly flatten the ‘sausages’, then bake for 20-30 minutes until golden brown.", "Remove from the oven and leave for 10 minutes to cool and firm up.", "Turn the oven down to 150C/300F/Gas 2.", "Once cooled move the cooked biscotti dough onto a cutting board. Using a serrated knife, cut the biscotti on an angle into 5mm/¼in slices.", "Lay the slices on the baking tray. Return to the oven and cook for eight minutes, then turn the slices over and cook for a further 10-15 minutes or until pale golden brown.", "Remove from the oven and cool the biscotti on wire racks. ", "To serve, pile the biscotti onto a plate and serve with a shot of limoncello."]}, {"isVegetarian": true, "title": "Biscuit and banana bake", "url": "www_bbc_co_uk_food_recipes_biscuit_and_banana_bake_18797", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 amaretti biscuits, crumbled ", "6 shortbread biscuits, crumbled", "3-4 bananas, sliced ", "150ml/5fl oz almond liqueur, such as amaretto ", "50g/1¾oz salted butter", "2 tbsp soft light brown sugar", "150g/5½oz whole almonds, toasted and roughly chopped ", "250g/9oz crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5. ", "Roughly crumble nearly all the biscuits into individual ramekins. Set the remainder aside. Slice the banana and spread out over the top of each dish. Pour over the liqueur, dot with butter and sprinkle with sugar.  ", "Bake for 25 minutes, basting frequently. ", "Scatter over the toasted and chopped almonds and some more crumbled biscuits. Serve with crème fraiche."]}, {"isVegetarian": true, "title": "Bitter chocolate and coffee mousse cake served with a coffee anglaise", "url": "www_bbc_co_uk_food_recipes_bitter_chocolate_and_38429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz caster sugar", "2 free-range eggs", "75g/2½oz plain flour, sifted", "20g/1oz butter, melted and cooled", "8 tbsp coffee liqueur", "100g/3½oz dark chocolate, melted", "1 leaf gelatin, soaked in cold water for five minutes", "4 tbsp instant coffee, dissolved in 4 tbsp boiling water", "2 tbsp icing sugar", "2 free-range eggs, separated ", "300ml/10fl oz double cream, softly whipped", "2 free-range egg whites", "175g/6oz chocolate (70% cocoa solids), chopped", "1 free-range egg yolk", "4 free-range egg whites", "25g/1oz caster sugar", "275ml/9¾oz double cream", "1 tbsp instant coffee granules", "3 free-range eggs, yolks only", "2 tbsp caster sugar", "1 tbsp cornflour", "100g/3½oz dark chocolate (70% cocoa solids)", "40g/1½oz caster sugar", "60ml/4 tbsp double cream", "sweetened cocoa powder, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 18 x 30cm/7 x 12in flat baking trays with baking parchment.", "For the sponge cake, beat together the caster sugar and eggs until the mixture is pale and fluffy and the mixture forms ribbons on the surface when drizzled. Fold in the plain flour, then pour in the melted butter and fold through. ", "Pour the mixture onto the lined baking trays and bake for 8-10 minutes, or until golden-brown. Remove from the oven and allow to cool. Once cold, peel off the baking parchment and use a 7cm/2¾in cutter to cut eight discs. ", "Place a disc of sponge into the bottom of a chefs’ ring set on each of four serving plates. Drizzle over a tablespoon of coffee liqueur on each disc. Leave to soak and then brush with a little of the melted chocolate. ", "For the coffee mousse, squeeze out the excess water from the gelatin leaves and stir into the hot coffee.", "Whisk together the icing sugar and egg yolks in a bowl until pale and fluffy. Fold the coffee mixture into the egg yolk mixture. Fold in the whipped cream.", "In a clean mixing bowl, whisk the egg whites until stiff peaks form when the whisk is removed.  Fold the egg whites into the coffee mousse. ", "Pour the coffee mousse onto the soaked bases until the chefs’ rings are half-filled. Soak the remaining discs of sponge in the remaining coffee liqueur and then place on top of the mousse.  Brush with a little more dark chocolate and then make the chocolate mousse.", "For the chocolate mousse, place the chopped chocolate in a bowl set over a pan of gently simmering water. Once melted, remove from the heat and allow to cool slightly. Beat in the egg yolk. ", "In a clean bowl, whisk the egg whites until soft peaks form when the whisk is removed. Gradually whisk in the sugar, a little at a time, until stiff and glossy peaks form. ", "Once the chocolate has cooled to body temperature, fold the egg whites into the chocolate. Spoon the mousse into a piping bag and then pipe it on top of the cakes. Place in the fridge to set. ", "For the coffee anglaise, heat the cream in a saucepan with the coffee granules. ", "In a large bowl, mix together the egg yolks, cornflour and caster sugar, then pour in the hot coffee cream, whisking all the time. Return the mixture to a clean saucepan and place over a low heat.  Stir continuously until the custard has thickened and coats the back of a spoon. Pour into a bowl and set aside to cool. Chill in the fridge.", "For the chocolate sauce, place the chocolate sauce ingredients with five tablespoons water into a saucepan and heat gently.  When all the ingredients have melted, pour into a squeezy bottle or a bowl and allow to cool. ", "Once ready to serve, use a blowtorch to warm the ring around the mousse stack making it easy to remove. Dust the tops with sweetened cocoa powder. Drizzle with a little of the chocolate sauce and serve the cold coffee anglaise in a jug alongside. "]}, {"isVegetarian": false, "title": "Bitterballen", "url": "www_bbc_co_uk_food_recipes_bitterballen_57810", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bitterballen_57810_16x9.jpg", "ingredients": ["2 tbsp olive oil", "300g/10½oz minced pork", "½ onion, very finely chopped", "1 carrot, grated", "vegetable oil, for frying", "1 tsp grated nutmeg", "2 tbsp finely chopped fresh parsley", "1 lemon, juice and zest", "salt and freshly ground black pepper", "50g/1¾oz butter", "75g/2¾oz plain flour", "225ml/8fl oz full-fat milk, warmed", "2 free-range eggs, beaten", "125g/4½oz breadcrumbs"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and fry the minced pork for 4-5 minutes, or until browned all over. Remove the pork from the pan and set aside.", "Add the onion and carrot to the pan and fry for 4-5 minutes. Remove from the pan and add to the fried pork. Set aside to cool.", "Stir in the nutmeg, parsley and lemon juice and zest and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, melt the butter in a saucepan, stir in the flour and cook for 2-3 minutes. Gradually stir in the warm milk to form a thick sauce.", "Add the sauce to the meat mixture and mix until well combined. Set aside to cool.", "Once cool, divide the mixture into small balls.", "Beat the eggs in a bowl and sprinkle the breadcrumbs onto a plate.", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the balls into the egg, then coat in the breadcrumbs. Fry the balls for 3-4 minutes, or until golden-brown. Remove the balls from the pan and set aside to drain on kitchen paper.", "Serve with chutney and pickled onions."]}, {"isVegetarian": true, "title": "Black badger brownies", "url": "www_bbc_co_uk_food_recipes_black_badger_brownies_04899", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_badger_brownies_04899_16x9.jpg", "ingredients": ["handful raisins", "1 tbsp dark rum", "200g/7oz dark chocolate (minimum 70% cocoa solids)", "125g/4½oz unsalted butter", "400g tin carlin peas, drained and rinsed", "3 free-range eggs (preferably organic)", "150g/5oz soft brown sugar", "1½ tsp cocoa powder"], "serves": "Makes 16 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the raisins in the rum for 3 hours, or preferably overnight.", "Preheat the oven to 170C/150C Fan/Gas 3½. Grease and line a 20cm/8in square brownie tin with baking paper.", "Melt the chocolate and butter together in a heatproof bowl placed over simmering water, ensuring the bowl doesn't touch the water. Stir to combine and set aside to cool slightly.", "Blend the peas to a purée in a food processor. Add the eggs, sugar and cocoa powder and blend until smooth. Pour in the chocolate mixture and  blend until smooth. Add the raisins and their soaking liquor and pulse until combined", "Pour into the prepared brownie tin, bake for 20–25 minutes until set, but still a bit squidgy. Allow to cool completely in the tin before cutting."]}, {"isVegetarian": true, "title": "Black banana cake", "url": "www_bbc_co_uk_food_recipes_black_banana_cake_52982", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_banana_cake_52982_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "175g/6oz sugar (half light muscovado, half golden caster) ", "75g/2½oz hazelnuts", "2 free-range eggs", "175g/6oz self-raising flour ", "2 very ripe bananas (about 250g/9oz total weight)", "drop vanilla extract", "175g/6oz good-quality dark or milk chocolate chips", "a little demerara sugar"], "serves": "Serves at least 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line the base and sides of a 20cm x 12cm/8in x 5in loaf tin with baking parchment.", "Beat the butter and sugars until light and coffee-coloured. This is best achieved in a food mixer. ", "Toast the hazelnuts, rub them in a tea towel to remove their skins, then grind quite finely. ", "Slowly add the eggs to the butter and sugar mixture, then mix in the toasted ground hazelnuts and self-raising flour. ", "Peel the bananas and chop them the small pieces. Gently fold the vanilla extract, the bananas and the chocolate chips into the cake mixture, turning gently and taking care not to overmix. ", "Scoop the cake batter into the prepared loaf tin. Dust with a little demerara sugar. Bake for between 1 hour and 1 hour 10 minutes, covering the cake with foil if the top starts to darken too quickly. "]}, {"isVegetarian": true, "title": "Black bean and brown rice bowl with poached eggs", "url": "www_bbc_co_uk_food_recipes_black_bean_and_smoke_29105", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_smoke_29105_16x9.jpg", "ingredients": ["110g/3½oz brown rice, rinsed", "1 tbsp olive oil", "1 x 400g tin black beans, drained and rinsed ", "2 tsp smoked paprika", "1 tsp white wine vinegar", "2 free-range eggs", "50g/2oz spinach ", "1 avocado, halved and sliced", "60g/2oz feta, crumbled", "1 lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil, add the rice and simmer for 30-40 minutes, until tender. Drain and set aside. ", "Place a little olive oil in a small pan, add the black beans and warm through over a low to medium heat. Stir through the smoked paprika.", "Meanwhile, bring another pan of water to the boil, reduce to a simmer and add the white wine vinegar. Gently crack the eggs in one at a time, as close to the water as possible, and poach on a low simmer for 3 minutes. ", "While the eggs are cooking, add the spinach to the beans and wilt for 2 minutes then season with salt and pepper. ", "Place the cooked rice in a large bowl, add the spinach and black beans and mix to combine. Spoon the mixture into two serving bowls and top with the poached eggs, slices of avocado and crumbles of feta. Add lemon juice, salt and pepper to taste. "]}, {"isVegetarian": true, "title": "Black bean and avocado salad", "url": "www_bbc_co_uk_food_recipes_black_bean_and_avocado_32747", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_avocado_32747_16x9.jpg", "ingredients": ["4 tbsp lime juice ", "7 tbsp extra virgin olive oil ", "3-4 jalapeño peppers (or 1 red chilli), finely chopped, to taste", "1 garlic clove, minced", "pinch ground cumin", "salt and freshly ground black pepper", "3 x 400g tins cooked black beans, drained", "large handful chopped fresh coriander", "4 medium tomatoes, chopped into wedges, seeds removed (or 16 cherry tomatoes, halved)", "1 large red pepper, stalk and seeds removed, sliced into thin strips", "1 red onion, thinly sliced", "5 spring onions, trimmed and thinly sliced (or 1 small red onion, thinly sliced)", "200g/7oz fresh watercress, tough stems snipped into half", "2 large ripe avocados, skin and seeds removed, cut into cubes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all of the dressing ingredients in a jam jar, replace the lid and shake until well combined. Season with salt and pepper. Add more chilli if desired.", "For the salad, rinse the black beans under cold running water and drain. Put in a large mixing bowl and pour over half of the dressing.", "Add the remaining salad ingredients, apart from the watercress and avocado and stir well to combine.  ", "To serve, divide the watercress among 4 serving plates. Spoon the salad on top, then cover with the avocado cubes. Drizzle a little more dressing over each portion. "]}, {"isVegetarian": false, "title": "Black bun", "url": "www_bbc_co_uk_food_recipes_black_bun_66755", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bun_66755_16x9.jpg", "ingredients": ["300g/10½oz plain flour", "75g/3oz lard, cubed", "75g/3oz butter, cubed", "pinch of salt", "½ tsp baking powder", "1 free-range egg, beaten, for glazing", "200g/7oz plain flour", "300g/10½oz raisins", "300g/10½oz currants", "½ tsp ground ginger", "½ tsp ground cinnamon", "½ tsp ground allspice", "½ tsp mixed spice", "¼ tsp ground black pepper", "100g/3½oz dark muscovado sugar", "100g/3½oz mixed peel, chopped", "½ tsp bicarbonate of soda", "2 tbsp whisky", "1 free-range egg ", "3 tbsp buttermilk"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, sift the flour into a bowl and rub in the lard and butter until the mixture resembles breadcrumbs.  Add the salt, baking powder and four tablespoons of cold water and mix to a soft dough. Turn out and knead into a ball. Wrap in cling film and leave to chill in the fridge while you make the filling.", "Preheat the oven to 180C/350F/Gas 4 (fan 160C).", "For the filling, mix all the ingredients together in a large bowl. ", "Line a 900g/2lb loaf tin with baking parchment. On a lightly floured surface, roll out two thirds of the pastry to a rectangle large enough to line the tin.  Drape into the tin and press up against the sides. Spoon the filling into the tin, pressing down to compress. ", "Roll out three quarters of the remaining pastry to a rectangle large enough to cover the tin. Dampen the edges of the pastry with water and press the pastry lid on top to seal. Trim the edges and crimp using the tines of a fork. Roll out the remaining pastry, along with any trimmings, and use to make a bow to decorate the top, then attach with a little water. ", "Glaze with beaten egg and bake for two hours. Remove from the oven and leave to cool in the tin before turning out. "]}, {"isVegetarian": true, "title": "Black cherry and hazelnut jam", "url": "www_bbc_co_uk_food_recipes_black_cherry_and_47093", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_cherry_and_47093_16x9.jpg", "ingredients": ["400g/14oz fresh cherries", "200g/7oz (about 2) Bramley apples", "350g/12oz granulated or caster sugar", "1 small lemon, juice only", "50g/2oz chopped, roasted hazelnuts"], "serves": "Makes about 600ml/20fl oz (about 2 jam jars)", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the cherries (either pitted, whole or halved) into a saucepan and cover with 500ml/18fl oz water. Bring to the boil, then cook until the cherries are very tender and the water almost evaporated.", "Peel and grate the Bramley apples, minus the core and pips, and add the grated apple to the pan. Boil again until the apple threads are very soft and falling apart and the liquid has almost disappeared.", "Add the sugar and lemon juice, bring to the boil and cook until the preserve reaches 105C/220C on a sugar thermometer. Stir in the hazelnuts towards the end of cooking.", "Leave to cool for a few minutes, then pour into hot clean jars and seal immediately.", "Leave the jam until the following day before eating, and after opening keep in the refrigerator."]}, {"isVegetarian": false, "title": "Black cod with saikyo miso and sesame spinach", "url": "www_bbc_co_uk_food_recipes_black_cod_with_miso_38131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 black cod fillets, about 150–200g/5½–7oz each, pin-boned", "4 stalks hajikami or 50g/1¾oz pickled ginger, to serve", "50g/1¾oz lotus root or taro chips, to serve, optional", "50ml/2fl oz sake", "100ml/3½fl oz mirin", "400g/14oz white miso paste", "125g/4½oz caster sugar", "200ml/7fl oz dashi stock or fish stock", "2 tbsp dark soy sauce", "1 tbsp caster sugar", "500g/1lb 2oz large leaf spinach", "50g/1¾oz sesame seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the saikyo miso, put the sake, mirin, miso paste and sugar in a medium saucepan and bring to the boil over a high heat. Cook for a few minutes, until the sugar has dissolved. Leave to cool to room temperature. ", "Put the cod in a bowl and cover with the saikyo miso (reserving a little to garnish). Cover and leave to marinate at room temperature for 2–3 hours. ", "When you're ready to cook the cod, preheat the oven to 220C/200C Fan/Gas 7. Heat an ovenproof frying pan over a medium heat. Lift the fish fillets out of the marinade and cook them skin side-down in the pan for 2 minutes. Turn the fish over and roast in the oven for 6–8 minutes, or until cooked through and blackened.", "Meanwhile, for the sesame spinach, bring the dashi stock to the boil in a large saucepan and add the soy sauce and sugar. Once the sugar has dissolved, add the spinach, stir and turn off the heat. Toast the sesame seeds in a dry frying pan until golden, then crush using a mortar and pestle. Drain the spinach, reserving the liquid, and squeeze out any excess moisture. Mix the spinach with almost all the toasted seeds and a little of the cooking liquor.", "To serve, gather the spinach into a ball and top with the remaining sesame seeds. Serve with the cod and hajikami, with a few drops of the reserved saikyo miso on each plate."]}, {"isVegetarian": false, "title": "Black cod with red onion jam and charred lettuce", "url": "www_bbc_co_uk_food_recipes_black_cod_with_red_onion_62871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz liquorice liqueur", "2 tbsp honey", "100ml/3½fl oz prosecco", "½ lemon, peel only (reserve the juice for dressing the lettuce)", "5g chocolate mint leaves, chopped", "1 chilli, seeds removed, cut in half lengthways", "15g tarragon", "4 x 140g/5oz Alaskan black cod fillets", "salt and freshly ground black pepper", "500g/1lb 2oz red onion, chopped (about 6 onions)", "125g/4½oz caster sugar", "20g/¾oz cooked beetroot, chopped", "50ml/2fl oz red wine vinegar", "2 Little Gem lettuce, cut into quarters", "2 tbsp extra virgin olive oil", "handful pea shoots"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the black cod, prepare the marinade the day before you want to eat. Add the liquorice liqueur, honey, prosecco, lemon peel, chocolate mint leaves, chilli and tarragon to large bowl and mix to combine. Add the cod fillets and marinate in the fridge overnight. The next day, remove the cod and discard the marinade. Season the fish with salt and pepper. Set aside until ready to cook.", "For the red onion jam, put the onions, caster sugar, beetroot and vinegar in a pan and simmer over a low heat for approximately 45 minutes. Once the mixture resembles a thin jam, use a spatula to pass it through a strong sieve to remove lumps. Set aside to cool.", "To cook the fish, preheat the grill to a low-medium heat. Grill the cod for 15-20 minutes, or until nicely glazed and firm", "To serve, char the lettuce using a chef’s blow torch then dress with olive oil and the reserved lemon juice.", "Spoon some onion jam onto each plate and top with the cod. Put the lettuce alongside and dress the plate with pea shoots. Serve immediately."]}, {"isVegetarian": true, "title": "Black Forest cupcakes", "url": "www_bbc_co_uk_food_recipes_black_forest_cupcakes_02412", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_cupcakes_02412_16x9.jpg", "ingredients": ["125g/4½oz butter, softened", "175g/6oz caster sugar", "2 free-range eggs", "200g/7oz self-raising flour", "2 tbsp cocoa powder", "125ml/4fl oz milk", "100g/3½oz dark chocolate (minimum 70% cocoa solids), melted, plus extra to serve", "1 x 360g/12½oz  jar black cherries in kirsch", "½ tsp arrowroot or cornflour mixed with a little water to make a smooth paste", "300ml/10fl oz double cream, lightly whipped"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line a 12-hole muffin tray with paper cases.", "Beat the butter and sugar together in a bowl until light and creamy. Gradually add the eggs, one at a time, until well combined.   Sift in the flour and cocoa powder and mix until well combined.  Fold in the milk and melted chocolate.  ", "Spoon or pipe the mixture into the muffin cases and bake for 18-20 minutes, or until well risen and springy to the touch.", "Remove the cakes from the tin and set aside to cool on a cooling rack.", "Drain the cherries in a sieve collecting the kirsch in the bowl below.  Pierce the cakes with a skewer and carefully pour about a teaspoon of the kirsch over each cake.  ", "Heat the kirsch and arrowroot paste in a small saucepan until just boiling. Remove the pan from the heat and beat until thickened. ", "Using a small knife make a well in the top of each cake by removing a disk of cake", "Pipe or spoon a swirl of cream onto the cakes, top with a few cherries and drizzle with the thickened kirsch. Just before serving, grate over some chocolate."]}, {"isVegetarian": true, "title": "Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_black_forest_gateau_43895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_forest_gateau_43895_16x9.jpg", "ingredients": ["225g/8oz butter, softened, plus extra for greasing", "225g/8oz caster sugar", "160g/5½oz  self-raising flour", "65g/2¼oz cocoa powder", "½ tsp baking powder", "4 medium eggs", "340g/11¾oz jar of morello cherry jam", "2 x 80g/2¾oz packs of sweetened dried sour cherries", "2–3 tbsp Kirsch", "100ml/3½fl oz cherry brandy (ideally morello cherry brandy)", "500ml/18fl oz double cream", "50g/2oz dark chocolate, coarsely grated", "fresh cherries, to decorate"], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 190°C/375F/Gas 5. Grease 2 x 20cm/8 in loose-based sandwich tins and line the bases with baking parchment.", "Put the butter, sugar, flour, cocoa powder, baking powder and eggs into a food processor and blend until smooth and thick. You may need push the mixture down from the sides a couple of times to make sure the mixture is well blended.", "Divide the batter between the prepared cake tins and spread it out evenly with a rubber spatula. ", "Bake for 22–25 minutes or until the cakes are nicely risen and just beginning to shrink away from the sides of the tins. Remove them from the oven and cool for 5 minutes before turning out on to a wire rack. Take off the lining paper and leave the cakes to cool. ", "When the cakes are cold, cut them in half, horizontally, with a long-bladed serrated knife. Take care to keep the knife parallel to the work surface, to get a good even cut. Place the cakes back on the wire rack or a board, cut sides up.", "For the filling, put the jam in a saucepan with the sour cherries and Kirsch and place over a low heat. Bring to a gentle simmer and cook for 6–8 minutes, stirring, until the jam has melted and the cherries are beginning to swell. Leave to cool for 15 minutes.", "Sprinkle the cherry brandy over the chocolate sponges, then spread three of them with the sour cherry mixture and leave to cool. Make sure that the sponge without the cherry topping is from the top half of a cake. ", "Whip 300ml/10fl oz of the cream with an electric hand-whisk until soft peaks form.", "Transfer one of the sponges (with the cherry topping) very carefully to a cake stand or plate – slide a cake tin base under the sponge to help you. Using a couple of pudding spoons, dollop about a third of the whipped cream gently on top of the cherry mixture. There is no need to spread it out, but try to keep the spoonfuls evenly spaced over the cake. Sprinkle with a little of the grated chocolate.", "Top with another sponge and repeat the layers twice more. You should end up with three layers of sponge, cherries, cream and chocolate. Place the final sponge on top, with its top surface facing upwards.", "Whip the remaining 200ml/8fl oz of the cream with an electric hand-whisk until soft peaks form.", "Using the flat side of a palette knife, spread about three tablespoons of the cream over the top of the cake, taking it all the way to the edge. Spoon the remaining cream into a piping bag fitted with a large, plain nozzle and pipe rosettes around the edge of the cake. Tip almost all the remaining grated chocolate into the centre and sprinkle the rest over the rosettes.", "Decorate with fresh cherries if you have some. Keep the cake cool or chill until ready to serve.", "It’s best to eat it the same day as it is made – how could you resist? – but if you need to make the cake in advance, chill it in the fridge for up to 24 hours and allow to stand at room temperature for 30 minutes before serving."]}, {"isVegetarian": true, "title": "Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_black_forest_gteau_01263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range eggs, separated ", "185g/6½oz golden caster sugar", "80g/3oz cocoa powder", "pinch salt", "600ml/20fl oz double cream", "1 vanilla pod, seeds only", "60g/2¼oz icing sugar", "350g/12oz cherries in kirsch", "340g/12oz jar morello cherry jam, 3 tbsp reserved for the topping", "1 tsp cornflour mixed with 2 tsp water", "750g/1lb 10oz cherries, stoned", "3 tbsp morello cherry jam", "50-60 dark chocolate pencils"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and grease and line a 22cm/8½in spring-form cake tin with baking paper. ", "Combine the egg yolks and sugar in a freestanding mixer and whisk over a high speed for 3 minutes until pale, fluffy and doubled in volume. Sift in the cocoa powder and fold in, keeping as much air in as possible. ", "In a separate clean bowl, whisk the egg whites with a pinch of salt until stiff peaks form when the whisk is removed from the bowl. ", "Fold the egg whites into the chocolate mixture a third at a time. Carefully pour the mixture into the lined tin and bake for 40 minutes. Remove from the oven and leave to cool completely.", "For the filling, whisk the cream, vanilla and icing sugar until soft peaks form. Drain the cherries, reserving the kirsch, then fold them into the cream. ", "For the decoration, put the fresh cherries and jam into a saucepan and cook over a high heat for 2 minutes until glossy. Add the cornflour mixture, cook for a further minute and then set aside to cool completely.", "To assemble the cake, using sharp bread knife, cut the sponge into three equal slices. Set one slice on a cake stand or serving board and then spoon over 3 tablespoons of the reserved kirsch. ", "Spread half of the jam over the top and then top with half of the cream. Lay a second sponge on top, press down gently, then repeat the layering process, finishing with a final layer of sponge. Run a palette knife around the edge of the cake to smooth out any cream; this should coat the outside of the cake with a thin layer of cream which will help the chocolate pencils to stick to the cake. ", "Decorate the outside of the cake with a tightly packed line of chocolate pencils, then spoon the glazed cherries into the centre. Chill for at least an hour before serving."]}]