[{"isVegetarian": true, "title": "Champiñones Portobello a la parrilla con salsa de champiñones y ensalada de brócoli", "url": "www_bbc_co_uk_food_recipes_bakedportobellomushr_81603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 diente de ajo, aplastado", "20g / ½ oz de mantequilla", "2 champiñones portobello, limpios y sin tallos", "sal y pimienta negra recién molida", "dash aceite de oliva", "¼ de puerro, finamente picado", "2 dientes de ajo picados", "3 hongos castaños, finamente cortados", "3 setas con tapa cerrada, finamente cortadas", "150ml / 5fl oz de crema doble", "1 cucharadita de mostaza Dijon", "25 g / 1 oz de perejil fresco, picado", "100g / 3½ oz de florecillas de brócoli", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a su configuración más alta.", "Para los champiñones portobello asados, mezcle el ajo con la mantequilla en un tazón pequeño, luego extiéndalos sobre la parte superior de los champiñones. Sazonar con sal y pimienta negra recién molida y colocar debajo de la parrilla durante seis minutos.", "Para hacer la salsa de champiñones, caliente el aceite de oliva en una olla pequeña y agregue el puerro. Saltee durante 2-3 minutos, hasta que esté ligeramente dorado. Agregue el ajo y los champiñones y saltee por otros dos minutos.", "Agregue la crema doble, agregue el Dijon y sazone con sal y pimienta negra recién molida. Cocine suavemente por un minuto. Finalmente agregue el perejil y manténgalo caliente hasta que esté listo para servir.", "Para hacer la ensalada de brócoli, cocine al vapor las flores de brócoli durante seis minutos o hasta que esté al dente. Agregue el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Para servir, coloque los floretes de brócoli alrededor del plato, vierta la salsa de champiñones en el medio del plato y cubra con los hongos Portobello a la parrilla."]}, {"isVegetarian": true, "title": "Papa al horno con puerros", "url": "www_bbc_co_uk_food_recipes_bakedpotatowithleeks_88968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 patata para hornear", "1 cucharada de aceite de oliva", "1 puerro mediano, rebanado", "300 ml / ½ litro de leche", "55 g / 2 oz de mantequilla", "3 cucharadas de harina común", "Queso cheddar 110 g / 4½ oz, rallado", "½ cucharadita de mostaza", "pellizcar nuez moscada molida", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote la papa con el aceite de oliva, colóquela en una bandeja para hornear y hornéela en el horno por 45-60 minutos, o hasta que la papa esté bien cocida.", "Mientras la patata se hornea, cocine el puerro en rodajas en una sartén con agua hirviendo con sal durante 3-4 minutos, o hasta que esté tierno. Escurrir y apartar.", "En una sartén, caliente suavemente la leche. Derrita la mantequilla en una cacerola, agregue la harina y revuelva hasta que se forme una pasta suave. Poco a poco bata la leche tibia, poco a poco, hasta que se incorpore la leche y la mezcla esté suave y sin grumos. Llevar a ebullición, reducir el fuego y dejar hervir a fuego lento, revolviendo con frecuencia, durante 4-5 minutos, o hasta que la salsa se espese.", "Agregue el queso rallado, la mostaza, la nuez moscada, la sal y la pimienta negra recién molida. Revuelva bien y cocine durante un minuto, luego retírelo del fuego y manténgalo caliente hasta que la papa esté cocida.", "Corta a la mitad la papa y saca la carne, dejando intacta la piel de la papa.", "Mash la carne de patata con los puerros blanqueados y cuchara la mezcla de nuevo en las pieles de patata. Vierta la salsa de queso tibia sobre la papa y sirva."]}, {"isVegetarian": true, "title": "Tarta de queso de frambuesa al horno", "url": "www_bbc_co_uk_food_recipes_bakedraspberrycheese_86567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["23cm / 9en base de esponja lista para usar", "3 cucharadas de licor de frambuesa", "200 g / 7 oz de azúcar en polvo", "1 limón, cáscara y jugo solamente", "4 cucharadas de harina de maíz", "850g / 1lb 14oz de queso crema con toda su grasa", "3 huevos de gallinas camperas", "1 vaina de vainilla, semillas raspadas", "375 ml / 13 fl oz crema doble", "Frambuesas 250 g / 9 oz", "150g / 5oz de chocolate blanco, más o menos picado", "Frambuesas 350 g / 11 oz", "3 cucharadas de licor de frambuesa", "1 limón, solo jugo", "2 cucharadas de azúcar glas, o al gusto", "200 ml / 7 fl oz crema doble, ligeramente batida, para servir"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la tarta de queso, coloque la base de la esponja en el fondo de una lata de pastel con forma de resorte de 23cm / 9in. Rocíe el licor sobre la esponja.", "Coloque el azúcar, el jugo de limón y la ralladura y la harina de maíz en un bol y agítelos.", "Agregue el queso crema y bata bien. Agriete los huevos, uno a la vez, latiendo bien entre cada adición. Agregue las semillas de vainilla y mezcle bien, luego vierta la crema doble y bata hasta que la mezcla esté suave. Doble las frambuesas y el chocolate blanco.", "Vierte la mezcla en el molde de la torta y dale a la lata un ligero batido para distribuir la mezcla de forma pareja.", "Coloque la lata de la torta en una lata de asar llena a una profundidad de aproximadamente 0,5 cm / ¼ in con agua. Transfiere al horno y hornea por 50 minutos, o hasta que la parte superior esté ligeramente dorada y la tarta de queso esté lista. Retirar del horno y enfriar en la lata.", "Mientras tanto, para las bayas borrachas, caliente una sartén hasta que esté caliente y coloque 250 g / 9 oz de las frambuesas en la sartén. Revuelva freír durante un minuto, luego agregue el licor de frambuesa y con cuidado flambeado.", "Agregue el jugo de limón y el azúcar glas, al gusto.", "Vierta la mezcla en una licuadora y mezcle hasta que quede suave, luego pase a través de un colador, presionando con el dorso de una cuchara, para eliminar todas las semillas.", "Para servir, corte la tarta de queso en trozos y coloque una pieza en el centro de cada plato. Ponga una cucharada de las frambuesas restantes alrededor del plato, rocíe sobre las bayas borrachas y cubra la tarta de queso con una cucharada de crema batida."]}, {"isVegetarian": false, "title": "Compota de ruibarbo al horno", "url": "www_bbc_co_uk_food_recipes_bakedrhubarbcompote_73685", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kilo / 2lb 3oz de ruibarbo forzado o champaña", "250g / 8¾oz de azúcar en polvo", "1 vaina de vainilla, dividida longitudinalmente (opcional)", "mantequilla, para engrasar"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Corte el ruibarbo en longitudes de 3 cm / 1 in y mezcle con el azúcar y la vainilla.", "Deje que se macere durante un mínimo de una hora o toda la noche si es posible.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Ligeramente un plato para hornear mantequilla, escurrir el ruibarbo y empacar. Cubrir con papel aluminio y hornear durante veinte minutos.", "Retire del horno y deje enfriar antes de destapar."]}, {"isVegetarian": true, "title": "Pudín de arroz al horno con compota de manzana con especias", "url": "www_bbc_co_uk_food_recipes_bakedricepuddingwith_78627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g / 2oz de mantequilla", "Azúcar 75g / 3 oz", "125g / 5oz de arroz de grano redondo", "750ml / 1pint 7fl oz de leche", "semillas raspadas de 2 vainas de vainilla", "Crema doble 150ml / 6fl oz", "pizca de sal", "75g / 2oz de mantequilla", "Azúcar demerara 100 g / 3 oz", "4 manzanas Bramley, peladas y cortadas en cubitos", "¼ cucharadita de jengibre molido", "¼ cucharadita de canela molida", "¼ cucharadita de nuez moscada"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el arroz con leche, precaliente el horno a 140C / 280F / Gas 1.", "Coloque una cacerola a fuego medio y agregue la mantequilla y el azúcar.", "Agregue el arroz y cocine hasta que se hinche.", "Agregue la leche, las semillas de vaina de vainilla, la crema y una pizca de sal y deje que hierva.", "Revuelva bien para combinar.", "Verter en un plato resistente al horno y hornear durante 2-2 ½ horas.", "Para la compota de manzana, coloque una cacerola a fuego medio y agregue la mantequilla y el azúcar.", "Agregue las manzanas y las especias y revuelva para combinar.", "Deje que hierva a fuego lento y cocine hasta que las manzanas se hayan suavizado pero aún conserven algo de textura.", "Dejar enfriar.", "Para servir, coloque una cucharada de arroz con leche en un recipiente y cubra con una cucharada de compota de manzana."]}, {"isVegetarian": true, "title": "Pudín de arroz al horno con salsa de frambuesa", "url": "www_bbc_co_uk_food_recipes_bakedricepuddingwith_85140", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g / 4oz de arroz jazmín tailandés", "450ml / 16fl oz de leche entera", "Crema doble 450ml / 16fl oz", "75g / 3oz de azúcar en polvo", "1 vaina de vainilla, dividida", "nuez moscada recién rallada", "25g / 1oz de mantequilla, más extra para engrasar", "6 cucharadas de azúcar glas", "Frambuesas 250 g / 9 oz", "2 cucharadas de azúcar glas", "50 ml / 2 fl oz de agua"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el budín de arroz al horno, engrase ligeramente un recipiente para pudín de 1 litro / 1¾ de pinta o un plato resistente al horno.", "Lavar el arroz con agua fría y escurrir.", "Coloque la leche y la crema en una olla con la vaina de vainilla y deje que hierva lentamente.", "Agregue el arroz y el azúcar y mezcle bien.", "Vierta la mezcla en el recipiente para pudin o en el plato y ralle sobre un poco de nuez moscada.", "Cortar la mantequilla en trozos pequeños y colocar sobre la mezcla de arroz.", "Transfiera el plato al horno y hornee durante aproximadamente 15 minutos, luego baje la temperatura a 150C / 300F / Gas 2.", "Hornee por 1 hora más o hasta que esté dorado por encima y cremoso por debajo.", "Precalentar la parrilla a mediano. Espolvorea la superficie del budín de arroz con el azúcar glas y colócalo debajo de la parrilla para que se caramelice. Alternativamente, caramelizar con un mini-soplete.", "Para la salsa de frambuesa, coloque las frambuesas, el azúcar glas y el agua en un procesador de alimentos y mezcle hasta que quede suave.", "Pase la mezcla a través de un colador colocado sobre un recipiente para eliminar las pepitas de frambuesa.", "Para servir, coloque una cucharada de salsa de frambuesa en cada plato y cubra con una cucharada grande de arroz con leche."]}, {"isVegetarian": true, "title": "Ensalada de pimiento asado, brócoli y limón", "url": "www_bbc_co_uk_food_recipes_bakedhotpepperbrocco_89050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash aceite de oliva", "pequeño puñado brócoli brotación púrpura, cortado en florecillas", "½ pimienta Romero, en rodajas", "½ cebolla, en rodajas", "2 dientes de ajo, en rodajas", "1 lima, partida a la mitad", "1 limón, reducido a la mitad", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite de oliva en una sartén a prueba de horno, luego agregue el brócoli, la pimienta, la cebolla, el ajo, la lima y las mitades de limón y fríe durante 2-3 minutos, revolviendo con frecuencia. Sazone con sal y pimienta negra recién molida, luego coloque en el horno y tueste durante 6-8 minutos, o hasta que los vegetales estén tiernos.", "Para servir, amontone las verduras en un plato para servir y exprima el jugo del limón tostado y la lima, y ​​rocíe con un poco de aceite de oliva."]}, {"isVegetarian": true, "title": "Roquefort al horno con higos y cebollas balsámicas", "url": "www_bbc_co_uk_food_recipes_bakedroquefortwithfi_87000", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g / 8½oz de tortas de avena", "125g / 4½oz de mantequilla derretida", "700g / 1lb 8½oz de queso ricotta", "300g / 10½oz de queso blando con toda su grasa", "6 huevos de gallinas camperas, golpeados", "sal y pimienta negra recién molida", "200 g / 7oz de queso Roquefort", "200g / 7oz de higos secos, picados", "200ml / 7fl oz de vinagre balsámico", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de nuez moscada recién rallada", "200 g / 7 oz de cebollas bebé", "1 diente de ajo, aplastado", "sal y pimienta negra recién molida", "berro", "pequeño cestón de berros mostaza, cortado", "hojas de remolacha"], "serves": "Sirve 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón, triture las galletas de avena y mezcle con la mantequilla derretida, luego presione en una lata para pasteles con forma de resorte de 25cm / 10in.", "Para el relleno, coloque el queso ricotta, queso blando, huevos y sal y pimienta negra recién molida en un procesador de alimentos y pulse hasta que quede suave.", "Agregue el queso Roquefort y los higos secos al procesador de alimentos y vuelva a pulsar.", "Con una cuchara, coloque la mezcla de queso en la base de la torta de avena y transfiérala al horno para hornear durante una hora. Retirar del horno y dejar enfriar.", "Para las cebollas, coloque el vinagre balsámico, azúcar impalpable, nuez moscada, cebollín y ajo en una sartén pequeña a fuego medio. Llevar a ebullición, luego reduzca el fuego a fuego lento hasta que las cebollas se hayan suavizado y el líquido se haya reducido a un jarabe.", "Para servir, corte el pastel de queso y coloque una rodaja de queso en cada plato. Cubra con algunas de las cebollas y coloque un puñado de berros, berros de mostaza y hojas de remolacha al lado. Rocíe el resto del almíbar de las cebollas."]}, {"isVegetarian": false, "title": "Salmón al horno servido con mariscos y pesto de patata", "url": "www_bbc_co_uk_food_recipes_bakedsalmonservedwit_78845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1,5 kg / 3 lb 5 oz de salmón fresco, limpiado", "4 limones no encerados, descuartizados", "5 dientes de ajo, cortados por la mitad", "1 manojo grande de perejil fresco de flatleaf", "200 g / 7 oz almejas", "200g / 7oz de gambas frescas", "Mejillones 200g / 7oz", "200g / 7oz de tomates cherry frescos", "2 vasos de vino blanco seco", "8 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida al gusto", "1kg / 2¼lb de patatas nuevas", "3 cucharadas de salsa de pesto", "sal y pimienta negra recién molida al gusto"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el salmón en el medio de una lata grande para asar (de al menos 10 cm de alto). Rellene el vientre del salmón con los limones, los dientes de ajo y algo del perejil.", "Rodee el salmón con las almejas, gambas, mejillones, tomates cherry y cualquier resto de limones y ajos.", "Verter sobre el vino blanco y el aceite de oliva y sazonar con sal y pimienta negra recién molida. Cubra completamente el salmón con el perejil restante.", "Cubra con papel de aluminio y colóquelo en el horno. Hornee durante aproximadamente 45 minutos, hasta que el pescado esté cocido y la carne comience a desprenderse fácilmente del hueso. Retire del horno y coloque en un plato grande rodeado de almejas cocidas, langostinos, mejillones y tomates. Rocíe todo con cualquier jugo de asar.", "Para las papas, caliente una olla con agua y deje que hierva. Agregue una pizca de sal, luego agregue las papas y cocínelas hasta que estén al dente.", "Escurra las papas, deje que se enfríen y luego córtelas a la mitad.", "En un tazón grande mezcle la salsa de pesto y las patatas juntas.", "Sazonar con sal y pimienta negra recién molida y servir inmediatamente con el salmón."]}, {"isVegetarian": false, "title": "Salmón al horno con corteza de parmesano y perejil", "url": "www_bbc_co_uk_food_recipes_bakedsalmonwithparme_72802", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedsalmonwithparme_72802_16x9.jpg", "ingredients": ["6 x 150g / 5oz filetes de salmón, desollados", "sal y pimienta negra recién molida", "150g / 6oz de queso crema", "diente de ajo pequeño, aplastado", "½ limón, corteza rallada solamente", "25g / 1oz de pan blanco fresco", "25g / 1oz de parmesano fresco rallado grueso", "2 cucharadas de perejil fresco picado, más extra para decorar", "pimenton"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Sazonar ambos lados de los filetes de salmón y colocar en una bandeja para hornear engrasada o en lata para asar.", "Mash el queso crema con el ajo, la sal y la pimienta y la cáscara de limón.", "Divida en seis y extiéndalos sobre cada filete de salmón.", "Mezcle las migas de pan, el parmesano y el perejil en un tazón pequeño y sazone.", "Espolvorea encima de la mezcla de queso crema y espolvorea con pimentón.", "Hornee en el horno por unos 15 minutos. Para saber cuándo termina el salmón, habrá cambiado de translúcido a un rosado opaco.", "Servir inmediatamente, adornado con perejil picado."]}, {"isVegetarian": false, "title": "Suela enrollada al horno con vino blanco y salsa de eneldo", "url": "www_bbc_co_uk_food_recipes_bakedrolledsolewithw_85488", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 solomillo, pelado y rebanado por la mitad a lo largo", "30 g / 1 oz de mantequilla, cortada en trozos, más extra para engrasar", "½ limón, solo jugo", "sal y pimienta negra recién molida", "2 cucharadas de vino blanco", "4 cucharadas de crema doble", "1 cucharadita de mostaza Dijon", "½ limón, solo jugo", "puñado de eneldo fresco, picado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la suela enrollada al horno, engrase un plato pequeño a prueba de horno y coloque las tiras de la suela en el plato. Ruede las suelas y salpique con la mantequilla. Exprima el jugo de limón y sazone con sal y pimienta negra recién molida.", "Transfiera el plato al horno y hornee por 6-8 minutos, o hasta que esté cocido.", "Para el vino blanco y la salsa de eneldo, coloque el vino blanco en una olla pequeña, lleve a ebullición y cocine a fuego lento hasta que el volumen se reduzca a la mitad.", "Agregue la crema y hierva a fuego lento hasta que la salsa esté ligeramente espesa. Agregue la mostaza, el jugo de limón y el eneldo.", "Para servir, coloque la suela enrollada al horno en un plato de servir y rocíe sobre la salsa."]}, {"isVegetarian": false, "title": "Vieiras al horno", "url": "www_bbc_co_uk_food_recipes_bakedscallops_85006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 vieiras, limpiadas, dejadas en sus caparazones", "25g / 1oz de mantequilla, derretida", "½ chile rojo, picado", "50g / 1¾oz de pan rallado", "sal y pimienta negra recién molida", "puñado de berros"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque las vieiras en una bandeja para hornear, cubra con la mantequilla derretida, el chile y el pan rallado y sazone con sal y pimienta negra recién molida.", "Coloque la bandeja debajo de la parrilla y cocine durante 3-4 minutos, o hasta que estén doradas.", "Para servir, coloque las vieiras en un plato en sus caparazones con el berro colocado al lado."]}, {"isVegetarian": false, "title": "Vieiras al horno con tomate Sunblush y chile", "url": "www_bbc_co_uk_food_recipes_bakedscallopswithsun_92468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 vieiras, limpiadas", "2 conchas de vieira, limpiadas", "3 tomates sunblush, picados", "2 cebolletas, cortadas, picadas", "½ lima, solo jugo", "½ chile rojo, sin semillas, picadas", "1 cucharada de salsa de soja"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Regrese la carne de vieira a las cáscaras limpiadas y esparza el resto de los ingredientes.", "Coloque las conchas de vieiras en una bandeja de horno y hornee en el horno precalentado durante 5-7 minutos, o hasta que las vieiras estén cocidas. (NB: Las vieiras se cocinan cuando la carne es opaca.) Servir inmediatamente."]}, {"isVegetarian": false, "title": "Lubina al horno con estofado de alcachofas bebé púrpura, espárragos y una espuma de vino blanco", "url": "www_bbc_co_uk_food_recipes_bakedseabasswithbrai_93994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucharadas de aceite de oliva", "2 lubinas enteras, filetes retirados, pin deshuesado, piel dejada en", "½ manojo de albahaca fresca", "8 alcachofas púrpuras bebé, peladas, cortadas por la mitad", "100ml / 3½fl oz de aceite de oliva", "25g / 1oz de mantequilla", "125ml / 4½fl oz de vino blanco", "1 limón, solo jugo", "75ml / 2½ fl oz crema doble", "1 manojo de espárragos", "2 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "1 chalote, pelado, finamente cortado", "150ml / 5¼fl oz de vino blanco", "100ml / 3½fl oz de caldo de pescado", "Crema doble 50ml / 2fl oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la lubina al horno, precaliente el horno a 200C / 400F / Gas 6.", "Engrase dos hojas de papel de aluminio con aceite de oliva y coloque dos de los filetes de lubina en la parte superior de cada hoja. Sazonar con sal y pimienta y poner las hojas de albahaca en el pescado. Dobla la lámina para hacer dos paquetes y sellar.", "Coloque en el horno para hornear durante 6-8 minutos.", "Mientras tanto, para el bebé, alcachofas y espárragos morados, coloque las alcachofas peladas, con la cabeza hacia abajo, en una sartén. Agregue el aceite de oliva, la mantequilla y el vino blanco. Cubra la sartén con una tapa.", "Caliente la mezcla a fuego medio y luego cocine las alcachofas por 15 minutos, o hasta que un cuchillo filoso pueda insertarse suavemente en el centro.", "Cuando las alcachofas estén cocidas, quítelas de la sartén con una espumadera y córtelas por la mitad. Coloque la mitad de las alcachofas en una licuadora con el jugo de limón y la crema y mezcle hasta obtener un puré suave. Dejar de lado.", "Cocine los espárragos en agua con sal hirviendo durante 1-2 minutos. Escurrir y cortar por la mitad, colocar en un recipiente con aceite de oliva y sazonar con sal y pimienta negra recién molida.", "Caliente una sartén de plancha, agregue los espárragos y las mitades de alcachofas reservadas y la plancha durante 1-2 minutos en cada lado, o hasta que aparezcan marcas carbonizadas en los vegetales.", "Para la espuma de vino blanco, caliente la mantequilla en una sartén y fría las chalotas por 2-3 minutos, o hasta que se ablanden. Agregue el vino blanco y cocine a fuego lento durante 2-3 minutos, o hasta que el volumen de vino blanco se haya reducido en un tercio.", "Agregue el caldo de pescado a la sartén y continúe cocinando hasta que el líquido se haya reducido a la mitad. Cuele la mezcla a través de un colador en una cacerola y agregue la crema. Sazonar con sal y pimienta negra recién molida. Mezcle usando una licuadora manual para producir una espuma.", "Sirva una pizca de puré de alcachofa en el centro de cada plato de servir. Cubra con las alcachofas y pescado a la parrilla. Coloque los espárragos alrededor del pescado y cubra con una cucharada de espuma de vino blanco."]}, {"isVegetarian": false, "title": "Cómo cocinar dorada con ajo y romero", "url": "www_bbc_co_uk_food_recipes_bakedseabreamwithgar_90179", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedseabreamwithgar_90179_16x9.jpg", "ingredients": ["1 x 450 g / 1 libra de dorada, escamada y eviscerada (o 2 x 160 g / 5½ oz de filetes de dorada)", "6 dientes de ajo asado, la piel restante (simplemente asar los dientes de ajo, envuelto en papel de aluminio, en un horno caliente con un chorrito de aceite de oliva y sal marina durante unos diez minutos)", "1 guindilla seca pequeña (o al gusto)", "algunas ramitas de romero fresco", "pizca de sal marina", "2 cucharadas de vino blanco seco", "50ml / 2fl oz de buena calidad, afrutado, aceite de oliva extra virgen", "perejil picado", "1 limón, descuartizado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 220C / 430F / Gas 7. Con un cuchillo afilado y flexible, quite los filetes de la dorada (o pídale a su pescadero que lo haga por usted).", "Coloque una hoja grande de papel de aluminio, de unos 60 cm de largo, en una superficie de trabajo y cubra con una capa de papel pergamino del mismo tamaño. Doble los bordes para que la lámina y el pergamino estén asegurados en los bordes.", "Coloque los filetes en el papel pergamino y esparza sobre los dientes de ajo tostados (apriételos suavemente para liberar el interior blando mientras lo hace).", "Desmenuce el chile seco y espolvoree algunas hojas de romero. Sazonar con sal marina y verter sobre el vino. Rocíe sobre el aceite de oliva.", "Selle el papel de pergamino y papel de aluminio alrededor del pescado. Comience en los extremos, rodándolos hacia adentro para asegurarse de que los extremos estén sellados correctamente, luego doble los lados para crear un paquete en forma de pastoso. El paquete debe sellarse herméticamente para que el pescado hierva mientras se cocina sin que salga vapor.", "Coloque el pescado en una bandeja de asar. Coloque en el horno precalentado y tueste durante 8-10 minutos.", "Cuando esté cocido, retírelo del horno y colóquelo en un plato grande para servir. Con cuidado, deshaga la lámina y el pergamino, doblando los lados.", "Para servir, espolvorea un poco de perejil fresco picado y exprime el jugo de limón fresco al gusto."]}, {"isVegetarian": false, "title": "Risotto español al horno", "url": "www_bbc_co_uk_food_recipes_bakedspanishrisotto_70241", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedspanishrisotto_70241_16x9.jpg", "ingredients": ["250g / 9oz de tomates cherry", "1 cebolla roja, finamente picada", "2 dientes de ajo, finamente picados", "2 cucharadas de aceite de oliva", "300g / 10oz de arroz risotto", "4 filetes de muslo de pollo, cortados por la mitad", "200 g / 7 oz de chorizo, en rodajas gruesas", "2 cucharaditas de romero fresco picado", "1 litro / 1¾ pintas de caldo de pollo caliente", "pellizco de hebras de azafrán", "8 gambas grandes y crudas", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 220C / 425F / Gas 7. Coloque los tomates cherry en una lata para asar y espolvoree sobre la cebolla roja, el ajo y el aceite de oliva. Asar durante 20 minutos hasta que los tomates se ablanden.", "Agregue el arroz, el pollo, el chorizo, el romero, el caldo de pollo, el azafrán y un poco de sal y pimienta, mezclándolos bien. Vuelve al horno por 20 minutos.", "Agregue las gambas y vuelva al horno por otros 10 minutos hasta que el arroz esté tierno y el pollo esté bien cocido."]}, {"isVegetarian": false, "title": "Costillas de puerco al horno con peras, patatas, cebollas y mantequilla de Roquefort", "url": "www_bbc_co_uk_food_recipes_bakedspareribchopswi_89921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g / 3oz de mantequilla, a temperatura ambiente", "50g / 2oz de queso Roquefort, desmenuzado", "Papas cerosas de 500 g / 1 lb 2 oz, cortadas en rodajas gruesas de 2 mm", "8 ramitas de tomillo fresco", "6 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cebollas rojas, peladas, cortadas en 8 cuñas cada una", "6 peras pequeñas para conferencias, a la mitad y sin corazón", "4 x 225 g / 8 oz de chuletas de repuesto", "50 g / 2 oz de azúcar moreno oscuro", "110g / 4oz de berros, recogidos", "110g / 4oz de achicoria, hojas separadas", "Nueces 110g / 4oz fuera de sus caparazones, tostado", "1½ cucharadas de vinagre de vino tinto", "½ cucharadita de crème de cassis (opcional)", "2 cucharadas de aceite de oliva", "6 cucharadas de aceite de nuez"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la mantequilla de Roquefort, coloca la mantequilla y Roquefort en un tazón y machaca con una cuchara de madera. Enfriar en el congelador durante diez minutos, luego cuchara sobre una hoja de film transparente y enrollar en forma de salchicha, retorciendo los extremos para sellar. Coloque en el refrigerador para enfriar durante una hora, o hasta que esté firme.", "Precalentar el horno a 200C / 390F / Gas 6.", "Para las chuletas de costilla de cerdo, coloque las rodajas de patata en una lata de asar con el tomillo y rocíe más de la mitad del aceite de oliva. Sazonar bien con sal y pimienta negra recién molida. Revuelva bien para cubrir, luego coloque las cebollas, las peras (con el lado del corte hacia abajo) y las chuletas de cerdo en la parte superior.", "Rocíe el aceite restante, sazone nuevamente con sal y pimienta negra recién molida, luego mezcle ligeramente para cubrir el aceite.", "Coloque en el horno para cocinar durante 15 minutos, o hasta que el cerdo esté ligeramente dorado. Reduzca el calor del horno a 190 ° C / 375 ° F / Gas 5, luego retire la lata del horno.", "Voltee las chuletas y voltee las peras para que queden hacia arriba. Espolvorea las peras con el azúcar moreno, luego devuelve la lata al horno. Asar durante otros 30-40 minutos, o hasta que el cerdo esté dorado y cocido, las peras caramelizadas y las papas tiernas.", "Para la ensalada, coloque el berro, la achicoria y las nueces en un bol. En un recipiente más pequeño, mezcle el vinagre, cassis y aceites, luego sazone con sal y pimienta negra recién molida. Rocíe el aderezo sobre la ensalada, luego mezcle bien para cubrir.", "Para servir, espolvorea las chuletas de cerdo, las papas y las peras en cuatro platos y coloca la ensalada al lado. Cortar un trozo de mantequilla Roquefort y colocar sobre la parte superior de la carne de cerdo para derretir."]}, {"isVegetarian": true, "title": "Berenjena rellena al horno con nuez y Roquefort", "url": "www_bbc_co_uk_food_recipes_bakedstuffedaubergin_71986", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedstuffedaubergin_71986_16x9.jpg", "ingredients": ["4 berenjenas grandes", "2 dientes de ajo picados", "1 cebolla blanca pequeña, cortada en cubitos", "6 tomates, cortados en cubitos", "1 ramita pequeña de romero fresco", "1 ramita pequeña de tomillo fresco", "aceite de oliva virgen", "sal y pimienta negra recién molida", "Nueces de 60 g / 2½ oz", "50g / 2oz de pan rallado recién tostado", "200g / 8oz de queso vegetariano Roquefort", "4 cucharadas de aceite de oliva", "1 cebolla mediana, muy finamente cortada", "1 diente de ajo, picado grueso", "1 x 400 g de tomates de buena calidad", "10 pequeñas hojas de albahaca fresca, trituradas", "orégano fresco picado"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 440F / Gas 6.", "Corta las berenjenas por la mitad, dejando las partes superiores y marca la superficie de la carne con un cuchillo.", "Coloque en una bandeja para hornear con el lado cortado hacia arriba, rocíe con aceite de oliva y sazone con sal y pimienta. Hornee durante aproximadamente 30 minutos o hasta que estén suaves.", "Mientras las berenjenas se cocinan, fría la cebolla y el ajo en aceite por unos minutos. Agregue los tomates y las hierbas y cocine para ablandar", "Retire la carne de las berenjenas asadas, reservando las pieles que se rellenarán más tarde. Picar la carne de berenjena en cubos pequeños.", "Agregue la carne de berenjena y las nueces ligeramente picadas a la mezcla de tomate y sazone generosamente con sal y pimienta. Coloque la mezcla en las pieles de berenjena (si lo hace de antemano, puede refrigerar las berenjenas en esta etapa).", "Desmenuce el queso y cubra con pan rallado. Vuelva al horno o colóquelo bajo una parrilla caliente hasta que el queso se derrita, el pan rallado crujiente y la carne caliente.", "Para la salsa de tomate, caliente el aceite en una sartén y fría la cebolla durante cinco minutos. Agregue el ajo y fría por un minuto más. Agregue los tomates y lleve a ebullición, agregue el orégano picado, reduzca el fuego y cocine a fuego lento durante 30-40 minutos. A la mitad, agrega las hojas de albahaca picadas.", "Cuando haya terminado de cocinar, agregue sal al gusto y mezcle hasta lograr un puré suave con una batidora manual o procesador de alimentos. La salsa se conserva durante unos días en la nevera, pero es mejor si se come recién hecha.", "Sirva las berenjenas calientes con la salsa de tomate caliente al lado."]}, {"isVegetarian": true, "title": "Queso Vacherin Mont d'Or al horno con bruschetta de ajo", "url": "www_bbc_co_uk_food_recipes_bakedvacherinmontdor_87921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350 g / 12 oz Vacherin Mont d'Or (en una caja de madera)", "4 dientes de ajo, en rodajas", "1 ramita de romero fresco, cortado en trozos cortos", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "6 rebanadas de baguette", "2 cucharadas de aceite de oliva", "2 dientes de ajo, pelados y partidos por la mitad"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el Vacherin Mont d'Or al horno, retire la tapa de la caja de queso. Haga varias ranuras en la parte superior del queso con un cuchillo afilado y coloque las rodajas de ajo y romero en las ranuras.", "Rocíe con aceite de oliva y sazone con un poco de sal y pimienta negra recién molida.", "Coloque en una bandeja para hornear y coloque en el horno durante 8-10 minutos, hasta que se derrita.", "Para la bruschetta de ajo, rocíe las rebanadas de baguette con aceite de oliva y frote con ajo.", "Caliente una sartén a la plancha y cocine el pan durante dos minutos en cada lado, o hasta que esté carbonizado. Retirar del fuego y cortar en los dedos.", "Para servir, coloque la caja de queso en un plato para servir y sumerja los dedos bruschetta de ajo en el queso fundido."]}, {"isVegetarian": true, "title": "Soufflé de tomate y queso al horno con ensalada de calabacín y hierbas", "url": "www_bbc_co_uk_food_recipes_bakedtomatoandcheese_86037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tomate de ternera cortado en la parte superior y semillas recogidas", "1 huevo blanco de corral", "½ yema de huevo de gallinas camperas", "30g / 1oz de queso Edam, rallado", "sal y pimienta negra recién molida", "¼ de calabacín, rallado", "puñado de perejil recién hecho", "puñado de albahaca fresca", "puñado de cebolletas frescas", "2 cucharaditas de aceite de oliva", "1 cucharadita de vinagre balsámico"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para el soufflé, precalentar el horno a 200C / 400F / Gas 6.", "Coloque el tomate en una bandeja para hornear antiadherente.", "Batir la clara de huevo hasta que se formen picos rígidos donde se quita la batidora.", "Mezcle la yema de huevo con el queso y sazone al gusto con sal y pimienta negra recién molida.", "Doble suavemente la clara de huevo en la mezcla de queso y la cuchara en la cavidad del tomate.", "Hornee en el horno durante seis minutos, o hasta que se haya levantado y preparado.", "Para la ensalada, coloque el calabacín y las hierbas en un recipiente.", "Mezcle el aceite y el vinagre y revuelva a través de la ensalada.", "Sirva el tomate souffléd inmediatamente en un plato al lado de la ensalada."]}]