[{"isVegetarian": true, "title": "Pasta con albahaca y perejil", "url": "www_bbc_co_uk_food_recipes_basilandparsleydress_86891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Hojas de albahaca de 55 g / 2 oz, finamente picadas", "30 g / 1 oz de perejil flatleaf, finamente picado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "150 g / 5½ oz de pasta seca de su elección"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las hierbas picadas en un recipiente con el aceite de oliva y sazone con sal y pimienta negra recién molida. Déjalo infundir.", "Cocine la pasta de acuerdo con las instrucciones en el paquete. Cuando la pasta esté cocida, escurra y remueva el aceite y las hierbas. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Budín de albahaca y frutas de verano con jarabe de albahaca", "url": "www_bbc_co_uk_food_recipes_basilandsummerfruitp_83779", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 11oz de frutas congeladas mixtas, descongeladas", "1 cilantro de bayas frescas mezcladas: fresas, moras y frambuesas, (fresas cortadas y cortadas en cuartos)", "50 g / 2 oz de azúcar en polvo", "10 hojas de albahaca fresca, toscamente picadas", "14 rebanadas finas de pan blanco", "200 g / 7 oz de azúcar en polvo", "110 ml / 4 fl oz de agua", "1 albahaca fresca de manojo grande"], "serves": "Rinde 4", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Coloque 150 g / 5½ oz de la fruta mixta descongelada en un recipiente.", "Agregue la mitad de las bayas frescas, la mitad del azúcar impalpable y las hojas de albahaca.", "Revuelva bien y déjelo a un lado.", "Coloque el resto de la fruta congelada y el azúcar en un procesador de alimentos y mezcle con un puré.", "Vierta la salsa a través de un colador fino y reserve.", "Retire las cortezas del pan y, usando un anillo de cocinero, recorte cuatro círculos para que quepan en la base de los cuatro moldes. Repita este proceso para crear tapas para el pudin.", "Con el pan restante cortar rodajas para alinear el borde interior de cada molde.", "Ligeramente aceite el interior de cada molde, luego alinee con película adhesiva.", "Sumerja los pequeños círculos de pan en un lado en el puré de fruta y colóquelos en el fondo del molde, con la parte sumergida hacia abajo.", "Repita con las rebanadas de pan para cubrir los lados, superponiéndose ligeramente.", "Llene el centro con las frutas reservadas con infusión de albahaca y un chorrito de puré de fruta (reservando algunas para las últimas rondas de pan) entre los contenidos y presione bien hacia abajo.", "Sumerja un lado de las cuatro rondas de pan restantes en el último puré de fruta.", "Coloque en el refrigerador hasta que esté listo para servir.", "Para hacer el jarabe de albahaca, coloca el azúcar y el agua en una cacerola a fuego alto y deja que hierva a fuego lento.", "Cocine a fuego lento durante 6-8 minutos hasta que se forme un jarabe de azúcar espeso, sin caramelizar el azúcar.", "Agregue las hojas de albahaca, luego retírelas del fuego y déjelas en infusión y enfríe.", "Una vez que esté frío, colóquelo en un procesador de alimentos y mezcle con una salsa.", "Cuele el jarabe de albahaca en una jarra a través de un tamiz forrado de muselina.", "Para servir, coloque los budines en un plato y decore con cualquier puré de fruta restante y coloque las bayas frescas restantes en la parte superior. Termine con un chorrito de jarabe de albahaca."]}, {"isVegetarian": true, "title": "Sorbete de albahaca con tartas individuales de crema de zarzamora y albahaca", "url": "www_bbc_co_uk_food_recipes_basilsorbetwithindiv_88521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 11 oz de azúcar en polvo", "300ml / 11fl oz de agua", "Hojas y tallos de albahaca 125 g / 4½ oz", "1 cucharada de jugo de limón", "300ml / 11fl oz de leche entera", "4 tallos grandes de albahaca fresca", "2 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "20g / ¾oz de harina de maíz", "500 g / 1 libra de hojaldre listo para usar de 2 oz, enrollado a 3 mm / 1/8 de grosor", "1 yema de huevo de gallinas camperas, ligeramente batida", "500 g / 1 libra 2 oz zarzamoras", "3 cucharadas de almendras en copos", "4 ramitas de albahaca fresca, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el sorbete, coloque el azúcar, el agua y la albahaca en una cacerola a fuego alto. Llevar a ebullición y hervir hasta que el azúcar se haya disuelto.", "Retire del fuego y deje enfriar un poco antes de verter el jarabe de albahaca en una licuadora de alimentos. Mezcle hasta lograr una consistencia suave y luego pase a través de un colador en un recipiente limpio con la parte posterior de una cuchara para empujar la mezcla.", "Vierta a través de un segundo tamiz, alineado con un pedazo de muselina limpia o un paño de cocina limpio, en un recipiente limpio. Deja enfriar.", "Una vez que la mezcla se haya enfriado por completo, transfiéralo a una máquina de helados y agítelo hasta que se congele de acuerdo con las instrucciones del fabricante. Transfiera a un recipiente y congele hasta que se solidifique.", "Precalentar el horno a 220C / 428F / Gas 7.", "Para la crema de albahaca, coloca la leche y la albahaca en una olla y lleva a ebullición.", "Coloque las yemas de huevo, el azúcar y la harina de maíz en un tazón y bata para combinar. Vierta la leche caliente sobre la mezcla de huevo y mezcle hasta que quede suave.", "Regrese la mezcla a la cacerola y cocine a fuego lento, revolviendo continuamente, durante 1-2 minutos, o hasta que sea lo suficientemente espeso para mantener su forma. Deja enfriar.", "Mientras tanto, para la tarta, corte la masa en cuatro cuadrados de 13cm / 5 pulgadas y colóquela en una bandeja para hornear. Cepille la masa con la yema de huevo batida. Usa un cuchillo afilado para marcar una línea de 1 cm por cada borde de la masa, alrededor de los cuadrados, teniendo cuidado de no cortar todo el camino (esto aumentará para crear una costra alrededor del borde cuando se cocine). .", "Divida la crema de albahaca enfriada de manera uniforme entre cada uno de los cuatro cuadrados de repostería, extendiéndolo suavemente hasta los bordes marcados.", "Coloque las moras en hileras sobre la parte superior de la crema, esparza sobre las almendras en copos y transfiéralas al horno. Hornee durante 15-20 minutos, o hasta que la masa esté crujiente y dorada.", "Para servir, coloque cada tarta en un plato de servir y cubra cada una con una bola de sorbete. Adorne con una ramita de albahaca."]}, {"isVegetarian": false, "title": "Carne vasca con koji, maíz con crema, lechuga a la parrilla, heno enoki y salsa de vino tinto", "url": "www_bbc_co_uk_food_recipes_basque_beef_with_koji_75586", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7 oz de carne de res de filete de solomillo (ver abajo)", "1-2 cucharadas de aceite vegetal", "4 chalotes de plátano grandes, en rodajas", "½ diente de ajo", "1 hoja de laurel", "½ manojo de tomillo", "12 granos de pimienta negra, agrietados (opcional)", "1 cucharada de semillas de hinojo", "750ml / 26fl oz de carne de ternera o de res", "750ml / 26fl oz de vino tinto", "1½ cucharada de aceite de oliva virgen extra", "1 diente de ajo, en rodajas finas", "1 chalote de plátano pequeño, en rodajas finas", "3 ramitas de tomillo atadas con una cuerda de cocina", "200g / 7oz de maíz dulce", "1 cucharada de mantequilla sin sal", "4 cucharadas de shio koji (disponible en línea)", "Crema doble 250ml / 9fl oz", "sal y pimienta blanca, al gusto", "1 grupo de hongos enoki blancos", "2 x 250 g / 9 oz de solomillo de ternera vasco", "100 g / 3½ oz shio que", "1 cucharada de mantequilla clarificada", "1 lechuga pequeña gema", "aceite de oliva", "sal", "4 zanahorias baby, finamente cortadas en una mandolina"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa de vino tinto, cocine el borde de carne en una sartén con aceite hasta que se dore por todas partes. Coloque la carne en una olla a presión de 3 litros / 5¼ litros.", "Usando la misma sartén, cocine las chalotas con un poco de aceite hasta que estén caramelizadas. Agregue el ajo, la hoja de laurel, el tomillo, los granos de pimienta y las semillas de hinojo. Cocina durante 2-3 minutos para liberar los aromas. Mientras tanto caliente el caldo en una sartén a fuego lento.", "Agregue el vino tinto a la charola y déjelo hervir. Cocine hasta que se reduzca casi todo el vino. Retire cualquier melé de la superficie mientras lo hace.", "Agregue el caldo y la mezcla de vino a la olla a presión y colóquela según las instrucciones. Cocine a presión durante 2 horas.", "Cuele el líquido y vuelva a agregarlo a una sartén. Cocine para reducir el líquido hasta que la salsa esté sedosa y brillante. Esto debería cubrir la parte posterior de una cuchara.", "Si no tiene una olla a presión, agregue el caldo, la mezcla de vino tinto y la carne a la misma sartén. Calienta y reduce el volumen lentamente. Cuando el líquido comience a ser más espeso en consistencia, cuela las hierbas y los chalotes de la mezcla y sigue reduciendo, eliminando cualquier melé sobre la marcha. Esto hará una salsa de vino tinto pero no tan intensamente aromatizada como la versión de la olla a presión.", "Para la crema de maíz, calentar una olla pequeña con el aceite de oliva. Cocine suavemente el ajo y la chalota hasta que estén transparentes.", "Agregue el tomillo y el maíz dulce. Revuelva constantemente por un par de minutos hasta que el maíz esté cocido, luego agregue el koji. Cocine por otro par de minutos para cocinar el koji.", "Revuelva de vez en cuando para evitar que el maíz se enganche en el fondo de la sartén y luego agregue la crema.", "Cocine por 5 minutos o hasta que quede espeso y cremoso, revolviendo ocasionalmente. Sazone al gusto. Retire el tomillo del maíz. Mezcle en una licuadora, en tandas si es necesario, manteniendo un poco de maíz a un lado para agregar de nuevo después de la mezcla para dar textura.", "Para el hongo enoki 'heno', deseche la parte superior e inferior de los champiñones y sepárelos hasta separarlos en hebras. Deshidratar en un deshidratador o en un horno seco (sin ventilador), a 54ºC. Esto toma 30 minutos. Almacenar en un lugar seco.", "Para preparar el plato, precaliente un horno a 120C / 100C Fan / Gas ½.", "Marinar la carne en el shio koji durante al menos 10 minutos. No lave el koji, coloque la carne en una bandeja y golpee suavemente con la mano o una sartén para aplanarla (para asegurarse de que la carne esté bien, pero no la aplaste por completo).", "Configure una plancha (lado plano) a muy caliente.", "Comience a cocinar el solomillo en la plancha. Sigue moviendo la carne en diferentes puntos de la plancha. El bistec está terminado cuando hay un color pardo dorado en cada lado.", "Coloque en una bandeja con la mantequilla clarificada y cocine en el horno durante 1-2 minutos (raro), 3-4 (medio raro).", "Corte la lechuga Little Gem por la mitad, engrase suavemente y sazone y coloque directamente sobre la plancha muy caliente. Tomará 1-2 minutos para colorear.", "Una vez que el filete esté cocido, descanse por un par de minutos en un tablero antes de tallar. Verifique el condimento: la carne no debería necesitar sal, pero podría agregarle pimienta negra, al gusto.", "Corte la lechuga por la base y divídala en hojas.", "Coloque la crema de maíz, bistec y lechuga en platos para servir. Vierta un poco de salsa de vino tinto y termine con el heno seco de hongos en la parte superior y las zanahorias en rodajas."]}, {"isVegetarian": false, "title": "Pastel de pollo vasco", "url": "www_bbc_co_uk_food_recipes_basque_chicken_pie_70267", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basque_chicken_pie_70267_16x9.jpg", "ingredients": ["4 muslos de pollo deshuesados ​​y sin piel, cortados en pedazos del tamaño de un bocado", "2 cucharaditas de pimentón ahumado", "2 cucharaditas de sal marina en copos", "pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cebollas medianas, cortadas en 12 cuñas", "1 pimiento verde, cortado a la mitad, sin semillas y en rodajas", "1 pimiento rojo, reducido a la mitad, sin semillas y en rodajas", "3-4 ramitas de tomillo fresco", "2 hojas de laurel", "Salchicha de chorizo ​​de 150 g / 5½ oz, pelada y cortada en rodajas finas", "3 dientes de ajo, aplastados", "4 tomates maduros grandes (cada uno de aproximadamente 100 g / 4½ oz), desollados y toscamente picados", "2 cucharadas de harina", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "1 cucharadita de polvo de hornear", "½ cucharadita de sal marina fina", "75g / 2¾oz de mantequilla sin sal, más extra para engrasar", "1 yema de huevo mediana", "4-5 cucharadas de agua fría", "1 huevo, batido o leche entera, para glasear"], "serves": "Sirve 4 - 5", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque las piezas de pollo en un bol y espolvoree sobre el pimentón, la sal y un montón de pimienta negra recién molida. Frota el condimento en la carne y reserva.", "Calentar el aceite en una sartén grande y freír las cebollas y los pimientos con el tomillo y las hojas de laurel durante 3 minutos, mientras se remueve. Agregue el pollo y el aderezo y cocine por otros 3 minutos, volteando el pollo regularmente hasta que comience a colorear. Agregue el chorizo ​​y el ajo y fría por 2 minutos más. Agregue los tomates y cocine por 5 minutos o hasta que estén suaves y jugosos, revolviendo regularmente.", "Incline la bandeja para que el líquido corra hacia un lado y espolvoree la harina sobre las verduras, el pollo y el chorizo. Revuelva rápidamente, luego ponga el molde a nivel y mezcle el licor de cocción con la harina. Hacerlo de esta manera debería evitar pequeños grumos de harina, pero no se preocupe si tiene algunos, nadie lo notará. Agregue más sal y pimienta si es necesario y continúe cocinando durante un minuto, revolviendo hasta que la salsa se espese. Retire del fuego e incline todo en una lata para asar o un plato resistente al horno, que mida aproximadamente 25x30 cm / 10x12 pulgadas y al menos 4 cm / 1½ pulgadas de profundidad. Deja enfriar.", "Para la masa, pulse la harina, el polvo de hornear, la sal, la mantequilla y la yema de huevo en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado. Lentamente vierta el agua con el motor en marcha, mezclando hasta que la mezcla se una como masa (puede que no necesite usar toda el agua). Forma la masa en una bola.", "Precalentar el horno a 200C / 400F / Gas 6.", "Ruede los pasteles en un rectángulo del mismo tamaño que la lata. Colóquelo sobre el relleno de pastel y coloque los lados de la masa alrededor del relleno. Cepille con huevo batido o leche para glasear.", "Hornee por unos 30 minutos o hasta que la masa esté dorada y el relleno esté caliente."]}, {"isVegetarian": false, "title": "Pollo vasco con ensalada de alcachofas y pimientos", "url": "www_bbc_co_uk_food_recipes_basque_chicken_with_21426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cebollas rojas pequeñas, cortadas en cuartos", "1 pimiento rojo, sin corazón, sin semillas, cortado en tiras de 1cm / ½ in de espesor", "1 pimiento verde, sin corazón, sin semillas, cortado en tiras de 1cm / ½ in de espesor", "6 dientes de ajo, en rodajas finas", "1 pollo, con un peso aproximado de 1.6kg / 3lb 8oz, cortado en 8 piezas", "2 cucharadas de piment d'Espelette (polvo de chile rojo), disponible en línea o en tiendas especializadas", "1 cucharadita de hojuelas de pimiento rojo picado", "250ml / 9fl oz de jerez blanco seco", "1 limón, solo jugo", "125g / 4½oz de chorizo ​​fresco, cortado en trozos de 5 mm / ¼ de grosor", "aceite de oliva virgen extra", "250ml / 9fl oz de caldo de pollo o agua", "4 tomates de ciruela, cortados a la mitad longitudinalmente", "sal marina y pimienta negra recién molida", "2 alcachofas globo grandes", "5 cucharadas de aceite de oliva extra virgen", "1½ cucharadas de vinagre de Jerez", "1 cucharadita de pimiento de Espelette", "2 dientes de ajo, finamente picados", "Hojas de frisée de 125g / 4½oz, solo en amarillo y blanco claro", "2 pimientos rojos, sin corazón, sin semillas, cortados en cubitos", "2 racimos de cebollas de primavera, cortadas, en rodajas finas", "1 cebolla roja pequeña, finamente cortada", "4 cucharadas de hojas frescas de perejil de flatleaf"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la gallina vasca, coloque la cebolla roja, los pimientos y el ajo en una sola capa sobre una lata para asar poco profunda. Sazonar las piezas de pollo con sal, pimienta, piment d'Espelette y las hojuelas de pimiento rojo picado y agregar a la lata. Vierta el jerez y el jugo de limón sobre el pollo. Cubra la sartén con film transparente y déjelo marinar en la nevera durante al menos 6 horas.", "Cuando el pollo esté casi listo para cocinar, precaliente el horno a 160 C / 140 C Fan / Gas 3 y coloque una rejilla en el tercio inferior del horno.", "Retire el pollo del adobo. Cuele el líquido y reserve, reserve las verduras también. Seque el pollo y sazone con sal y pimienta una vez más. Coloque una cazuela a fuego medio-alto y agregue aceite de oliva para cubrir la base del plato. Agregue el chorizo, cocine por unos 3 minutos y luego retírelo y déjelo a un lado. En la misma olla, dore el pollo, con la piel hacia abajo primero, hasta que se dore, luego retírelo y déjelo a un lado.", "Agregue las verduras del adobo a la misma cacerola y cocínelas hasta que estén tiernas, esto debería tomar de 5 a 6 minutos. Vierta el líquido de adobo reservado en la olla y cocine a fuego alto hasta que el volumen de líquido se haya reducido a la mitad. Regrese el pollo y el chorizo ​​a la olla y agregue el caldo y los tomates. Llevar a fuego lento, y transferir al horno, descubierto. Estire hasta que las patas de pollo estén blandas y el pollo completamente cocido, esto tomará aproximadamente 45 minutos.", "Mientras tanto prepara la ensalada. Pele la capa exterior de las alcachofas, recorte el tallo y saque el interior. Coloque las alcachofas en agua con un poco de jugo de limón para evitar que se pongan marrones.", "En un tazón pequeño, mezcle el aceite de oliva, el vinagre de jerez, el piment d'Espelette y el ajo. Sazonar con sal. Cortar finamente las alcachofas, preferiblemente en una mandolina, y agregar el aceite batido. Mezcle para combinar y sazone con más sal si es necesario.", "En una ensaladera grande, mezcle las hojas de frisée, los pimientos, las cebollas tiernas, la cebolla roja y el perejil. Sirva el pollo vasco con la ensalada al lado."]}, {"isVegetarian": true, "title": "Batata vada con salsa de tamarindo", "url": "www_bbc_co_uk_food_recipes_batata_vada_with_68469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 papas harinosas, dejadas enteras", "1 cucharada de aceite vegetal", "100g / 3½oz urid dal lentejas (gramo negro)", "1 cucharadita de semillas de mostaza negra", "8-10 hojas de curry", "pizca de cúrcuma molida", "1 cucharada de jengibre fresco de raíz finamente rallado", "2 dientes de ajo, aplastados", "1 chile verde, finamente picado", "pizca de sal", "exprimir jugo de limón", "100 g / 3½ gramos de harina (harina de garbanzo)", "pizca de sal", "¼ cucharadita de cúrcuma molida", "1 cucharadita de polvo de hornear", "½ cucharadita de chile en polvo", "aceite de girasol, para freír", "50g / 1¾oz de puré de tamarindo", "1 cucharadita de comino molido, asado", "½ cucharadita de chile rojo en polvo caliente", "pellizcar jengibre molido", "pizca de sal", "4-5 cucharadas de azúcar moreno"], "serves": "Hace 16", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Ponga a hervir una olla grande de agua y cocine las papas durante 20 minutos, o hasta que estén tiernas hasta la punta de un cuchillo. Dejar enfriar. Retire las pieles y machaque la carne, luego reserve.", "Agregue el aceite vegetal a una cacerola grande a fuego lento y mezcle el urad dal para tostar durante unos minutos. Agregue las semillas de mostaza, las hojas de curry, la cúrcuma, el jengibre, el ajo y el chile y cocínelas durante 30 segundos.", "Agregue el puré de papas, mezcle bien y sazone con sal y jugo de limón. Retirar del fuego y hacer 12-16 bolas con una mini bola de helado. Cubra y refrigere hasta que esté firme.", "Mientras tanto, para hacer la masa, mezcle todo junto con 110 ml / 4 fl oz de agua en un tazón. Cubra y enfríe hasta que esté listo para usar.", "Para hacer la salsa, coloque todos los ingredientes, excepto el azúcar moreno, en una olla grande con 100 ml de agua. Llevar a ebullición a fuego alto, cocine a fuego lento durante 1 minuto y luego agregue el azúcar moreno y la burbuja hasta que espese.", "Caliente el aceite en una cacerola profunda a 170 ° C o hasta que un cubo de pan marse en 30 segundos. Tomando una bola a la vez, sumérgete en la masa, sacuda el exceso y freír durante 4-5 minutos, o hasta que estén dorados. Sirve con la salsa de tamarindo."]}, {"isVegetarian": true, "title": "Pastel Battenberg", "url": "www_bbc_co_uk_food_recipes_battenburg_cake_60878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/battenburg_cake_60878_16x9.jpg", "ingredients": ["175g / 6oz de mantequilla ablandada, más extra para engrasar", "175g / 6oz de azúcar en polvo de oro", "3 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "½ cucharadita de extracto de vainilla", "pasta roja para colorear alimentos", "6 cucharadas de mermelada de albaricoque", "Mazapán listo para el uso 500g / 1lb 2 oz", "2-3 cucharadas de azúcar glas, para rodar."], "serves": "Hace 1 torta", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Engrase un molde para pastel de base suelta de 20cm / 8 pulgadas con mantequilla.", "Tome una tira de pergamino para hornear de 30cm x 20cm / 12in x 8in y haga un doblez de 8cm / 3in en el centro. Esto creará una división en la torta para que las dos esponjas de diferentes colores puedan cocinarse al mismo tiempo.", "Alinee la lata con el pergamino para hornear, manteniendo la división en el centro.", "Ponga la mantequilla, el azúcar, los huevos, la harina y la vainilla en un procesador de alimentos y pulse hasta que estén bien combinados.", "Transfiera la mezcla a un recipiente en escalas, quite la mitad de la masa y colóquela en un recipiente diferente.", "Agregue un poco de colorante rojo para alimentos en un tazón y dóblelo en la mezcla hasta que esté bien mezclado.", "Coloque los batidos en cada lado del molde preparado y alise la superficie con el dorso de una cuchara.", "Hornee en el centro del horno durante aproximadamente 25 minutos, o hasta que las esponjas hayan subido. Enfríe en la lata durante cinco minutos, luego deslice un cuchillo por el exterior de cada esponja y gírelos sobre una rejilla de alambre. Si las esponjas se han levantado de manera desigual, presione la superficie suavemente hasta que esté nivelada. Deja hasta que esté completamente frío.", "Para armar la torta, primero coloque una esponja encima de la otra y corte los bordes crujientes para que sean del mismo tamaño. Corta las esponjas por la mitad a lo largo para hacer cuatro rectángulos largos.", "Caliente la mermelada de albaricoque en una olla y presione a través de un colador fino.", "Cepille el lado largo de una de las esponjas con mermelada y sándwich junto con una esponja de un color de contraste. Haz lo mismo con las otras dos esponjas.", "Coloque los dos pares de esponjas juntas como un tablero de damas y cepille la parte superior y los lados con mermelada.", "Coloque el mazapán sobre una superficie espolvoreada con azúcar glas y ruede dentro de un rectángulo de aproximadamente 40 cm x 20 cm / 16 pulgadas x 10 pulgadas; debe ser lo suficientemente grande como para envolver la torta completamente, dejando los extremos expuestos, y ser de aproximadamente 5 mm / ¼ de espesor.", "Voltee la torta boca abajo en el mazapán y cepille la parte inferior de las esponjas con mermelada.", "Envuelva el mazapán alrededor del pastel, presionándolo suavemente sobre la superficie de las esponjas, y presione los bordes para formar una unión firme.", "Regrese con la costura debajo, recorte una fina rebanada en cada extremo y colóquela en un plato para servir."]}, {"isVegetarian": false, "title": "Bacalao malteado con patatas fritas y ketchup de tomate casero", "url": "www_bbc_co_uk_food_recipes_battered_cod_with_chips_15260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Vinagre de vino tinto 250ml / 9floz", "1 hoja de laurel", "½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "Azúcar moreno suave ligero 75g / 3oz", "4 x 400g / 14oz de tomates enlatados", "1 cucharadita de sal", "1 cucharada de mostaza inglesa en polvo", "1 diente de ajo, aplastado", "Salsa Tabasco, al gusto", "2 cucharadas de puré de tomate", "1-2 cucharadas de harina de maíz", "Patatas harinosas de 400g / 14oz, peladas y cortadas en bastones gruesos de 6cm / 2½ pulgadas de largo y secadas sobre papel de cocina", "15 g / 2 / 3oz de levadura fresca", "azúcar pizca", "Cerveza 200ml / 7floz", "1 cucharadita de vinagre de sidra", "Harina normal de 200g / 7oz", "pizca de sal", "4 x 175g / 6oz de filete de bacalao, despellejado y huesos de alfiler"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el ketchup de tomate, coloca el vinagre, la hoja de laurel, las especias y el azúcar en una sartén de base pesada y deja que hierva a fuego lento.", "Agregue los ingredientes restantes y deje hervir, revolviendo para evitar que se pegue.", "Reduzca la temperatura y cocine a fuego lento, revolviendo con frecuencia durante 30 minutos: tenga cuidado de que la mezcla no se enganche ni se queme.", "Mezcle en un procesador de alimentos o licuadora y cuele la salsa a través de un colador.", "Si encuentra que la salsa es demasiado fina una vez que está fría, simplemente vuelva a hervirla y espese con un poco de harina de maíz mezclada con agua, teniendo cuidado de no hacer almidón y demasiado espeso. Esto evitará que el agua del tomate se separe de la salsa.", "Caliente una freidora a 170C / 350F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Coloque las papas en la freidora por lotes y cocine por 2-3 minutos hasta que estén tiernas pero no coloreadas.", "Drene en papel de cocina y suba la freidora a 190C / 375F.", "Espolvorea la levadura y el azúcar en un tazón.", "Vierta la cerveza y el vinagre y mezcle con la harina. Sal", "Dejar fermentar - está listo para usar cuando la mezcla comience a burbujear.", "Sumerja los filetes de bacalao en la mezcla y fríalos hasta que estén dorados y cocidos - alrededor de 3-4 minutos.", "Retire con una espumadera y escurra sobre papel de cocina.", "Mantenga caliente en una bandeja en el horno si es necesario.", "Coloque los chips semicocidos en la freidora por lotes y cocine por otros 2-3 minutos hasta que estén dorados y crujientes.", "Para servir, apile las papas en el plato y coloque el bacalao al costado. Sirve con una cucharada de ketchup de tomate."]}, {"isVegetarian": false, "title": "Baguettes maltratadas con guisantes blandos y mayonesa de limón", "url": "www_bbc_co_uk_food_recipes_battered_pollock_81633", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "300ml / 10½ fl oz aceite de colza", "2 limones, ralladura y jugo", "Harina normal de 200g / 7oz", "15 g / ½ oz de levadura fresca", "pizca de azúcar en polvo", "pizca de sal", "1 cucharada de vinagre de sidra", "Cerveza 200ml / 7fl oz", "goteo o aceite vegetal, para freír", "Filetes de abadejo de 1kg / 2lb y 4oz, piel encendida, huesos de alfiler retirados, cortados en 5cm / 2pulgadas", "sal marina, al gusto", "1 baguette largo, cortado por la mitad a lo largo", "50g / 1¾oz de mantequilla, ablandada"], "serves": "Sirve 4-6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para los guisantes blandos, mida los guisantes en una jarra. Viértalos en un tazón grande y cúbralos con 3 veces su volumen de agua fría. Agregue el bicarbonato de soda y remoje durante al menos 12 horas, o preferiblemente durante la noche.", "Escurra los guisantes empapados y enjuáguelos con agua fría.", "Ponga a hervir los guisantes empapados en una olla grande de agua fría. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento durante 1½-2 horas, cubra, revuelva de vez en cuando, o hasta que los guisantes estén blandos en textura pero no demasiado secos. Si todavía tienen textura húmeda después de 2 horas, continúe cocinando, destapado, para secarse un poco.", "Batir la mantequilla y sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para la mayonesa de limón, mezcle los huevos y la mostaza en un procesador de alimentos hasta que quede pálido y cremoso. Con el motor todavía en funcionamiento, agregue gradualmente el aceite en una corriente delgada, hasta que la mezcla espese hasta obtener una mayonesa lisa y espesa (es posible que no necesite todo el aceite). Agregue la ralladura de limón y el jugo y sazone, al gusto, con sal y pimienta negra recién molida. Enfriar en la nevera hasta que sea necesario.", "Para el colín maltratado, mezcle la harina, la levadura, el azúcar, la sal y el vinagre en un tazón grande hasta que estén bien combinados. Agregue la cerveza hasta que la mezcla se una como una mezcla espesa y suave.", "Coloque la mezcla a un lado para fermentar durante aproximadamente 30 minutos. Está listo para usar cuando la mezcla comienza a burbujear.", "Caliente el goteo o el aceite vegetal en una freidora a 190 ° C, o caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja cada trozo de pescado en la mezcla para cubrir completamente. Baje los dedos de pescado en el aceite caliente en lotes, y fría durante 4-6 minutos, o hasta que el pescado esté bien cocido y la masa esté dorada. Retire los dedos de pescado del aceite con una cuchara ranurada y déjelo a un lado para drenar el papel de cocina. Sazonar, al gusto, con sal.", "Cuando todo el pescado haya sido cocinado, vierta la mezcla restante en el aceite caliente y fría hasta que esté crujiente y dorado.", "Para servir, unte las mitades de baguette, luego extiéndelas con los guisantes blandos. Llene la baguette con los trozos de abadejo, luego rocíe sobre la mayonesa de limón. Espolvorea los restos de masa. Cortar la baguette rellena en rodajas y servir en un plato para que las personas se ayuden."]}, {"isVegetarian": false, "title": "Adorno y chirrido", "url": "www_bbc_co_uk_food_recipes_bauble_and_squeak_09032", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bauble_and_squeak_09032_16x9.jpg", "ingredients": ["50g / 2oz de mantequilla", "1 cebolla roja, en rodajas", "6 bayas de enebro", "200 g / 7 oz de ganso sobrante, desgarrado en pedazos", "200g / 7oz de jamón sobrante, rasgado en pedazos", "200g / 7oz de calabaza asada sobrante, cortada en trozos", "100g / 3½oz de relleno sobrante", "8 papas asadas sobrantes, cortadas en trozos", "5 lonchas de tocino sobrante, cortadas en trozos grandes", "6-8 coles de Bruselas crudas, reducidas a la mitad"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Derrita la mantequilla en una sartén grande y fría la cebolla roja hasta que se ablande.", "Aplastar el enebro con un mortero y agregar a las cebollas.", "Cuando las cebollas estén doradas, agregue los ingredientes restantes. Con un tenedor, machaque las papas y la calabaza, distribuyéndolas uniformemente para unir la carne.", "Agregue las coles de Bruselas y cocine durante 15 minutos, agregando más mantequilla si es necesario. (Si solo tiene restos de Bruselas cocida, puede agregarlos, pero cocínelos durante unos cinco minutos)."]}, {"isVegetarian": false, "title": "Malvavisco con guisantes blandos, pan y mantequilla", "url": "www_bbc_co_uk_food_recipes_battered_sea_bream_with_99418", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "75g / 3oz de mantequilla", "4 filetes de dorada, pin boned", "3 huevos de gallinas camperas, yemas y claras separadas", "Harina normal de 75g / 3oz", "75ml / 3fl oz de agua con gas", "sal marina", "pimienta negra recién molida", "4 rebanadas de pan blanco grueso", "1 limón, cortado en cuñas"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Remoje los guisantes en un tazón grande, en tres veces su volumen de agua con el bicarbonato de soda durante al menos cuatro horas o, si tiene tiempo, durante la noche.", "Escurra los guisantes, enjuáguelos bajo el grifo y colóquelos en una fuente grande y cúbralos con el agua. Cubra y hierva, y una vez hervida, reduzca el fuego y cocine a fuego lento los guisantes durante 1½-2 horas, revolviendo de vez en cuando.", "Los guisantes deben ser suaves y de textura blanda pero no demasiado secos. Si están mojados, continúe cocinando sobre el fuego con la tapa apagada para secar un poco. Batir la mantequilla y sazonar.", "Calentar el aceite para freír en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las yemas de huevo y la harina en un tazón y bata para combinarlas con una masa espesa.", "Batir las claras de huevo en un recipiente aparte hasta que se formen picos suaves cuando se quite el batidor.", "Dobla esto en la mezcla, alternando con el agua con gas para hacer una masa suave y esponjosa.", "Sumerja el besugo a través de la mezcla y freír durante 3-4 minutos, o hasta que se dore. (Es posible que deba hacer esto por lotes.) Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, coloca el pescado en el plato, unta el pan y colócalo al lado. Termine con una cucharada de guisantes blandos y una rodaja de limón."]}, {"isVegetarian": true, "title": "Cóctel de navidad", "url": "www_bbc_co_uk_food_recipes_bbc_four_cocktail_68933", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbc_four_cocktail_68933_16x9.jpg", "ingredients": ["Whisky bourbon de buena calidad 50ml / 2fl oz", "1 cucharada de jugo de cereza", "1 cucharadita de brandy de cereza", "1 cucharada de licor de naranja", "35ml / 1¼fl oz de zumo de pomelo rosado", "pizca de amargos de pomelo (10 gotas)", "pizca de amargos Peychauds (10 gotas)", "hielo, para servir", "granadina, para glaseado", "azúcar en polvo, para glaseado", "1 guindilla roja, preferiblemente ojo de pájaro", "cinta de ralladura de pomelo"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Para congelar el borde del vaso de cóctel, vierta un poco de granadina en un recipiente poco profundo y ponga un poco de azúcar en un plato. Sumerja el borde del vaso en la granadina y luego cúbralo con el azúcar.", "Pon todos los ingredientes del cóctel en una coctelera y agítalo.", "Poner hielo en el vaso y verter sobre el cóctel.", "Decora con chile y pomelo."]}, {"isVegetarian": false, "title": "Pollo BBQ 'cerveza-can'", "url": "www_bbc_co_uk_food_recipes_bbq_beer-can_chicken_80142", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_beer-can_chicken_80142_16x9.jpg", "ingredients": ["4 cucharadas de cerveza dorada clara, más 500 ml / 17floz para marinar el pollo, más 300 ml / 10½ fl oz de cerveza dorada clara para asar (reservar la lata de cerveza vacía)", "Extracto de malta 90g / 3oz", "½ cucharadita de chile en polvo", "½ cucharadita de mostaza en polvo inglesa", "½ cucharadita de ajo machacado", "½ cucharadita de pimentón ahumado", "½ cucharadita de azúcar mascabado", "1 x 2 kg / 4 lb 4 oz de pollo, de preferencia de corral", "160g / 5½oz de mantequilla", "pizca de sal"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el pollo, mezcle cuatro cucharadas de la cerveza, el extracto de malta, el chile en polvo, la mostaza, el ajo, el pimentón ahumado y el azúcar en un bol para hacer una pasta.", "Frote la pasta sobre el pollo y déjelo a un lado para que se mate durante tres horas. Vierta más de 500ml / 18fl oz de cerveza y déjela marinar durante la noche", "Precaliente la barbacoa (es mejor usar una barbacoa con una tapa) o alternativamente precaliente el horno a 190C / 375F / Gas 5.", "Enjuague el adobo del pollo y seque. Con cuidado, unte la mantequilla debajo de la piel del pollo y sobre los muslos y sazone con sal. Vierta la 300 ml / 10 ½ oz de cerveza en la lata de cerveza reservada, luego coloque cuidadosamente el pollo en la lata de cerveza, de modo que el pollo esté sentado en posición vertical, con la lata en su cavidad.", "Ase el pollo durante 40-45 minutos, rociándolo un par de veces. Retire el pollo de la barbacoa o el horno y déjelo reposar durante 15 minutos."]}, {"isVegetarian": false, "title": "B.B.L.T (panza, brioche, lechuga y tomate)", "url": "www_bbc_co_uk_food_recipes_bblt_belly_brioche_70548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-1.5kg / 2lb 4oz-3lb 5oz vientre de cerdo", "1 bulbo de ajo", "1 cebolla española, pelada y partida en dos", "½ cabeza de apio, más o menos picada", "20 granos de pimienta", "2 hojas de laurel", "tomillo pequeño racimo", "250ml / 9fl oz de aceite vegetal", "Tocino rayado 125g / 4½oz, picado grueso", "1 yema de huevo grande", "½ cucharadita de vinagre de vino de arroz", "½ cucharadita de mostaza Dijon", "1 cucharada de jugo de limón", "2 cucharadas de salsa de soja ligera", "20ml / ¾fl oz de aceite de oliva", "1 cebolla roja pequeña, finamente picada", "2 dientes de ajo pequeños, aplastados", "1 cucharadita de pimentón ahumado", "1 tallo de limoncillo, cortado y finamente picado", "2 cucharaditas de azúcar en polvo, o al gusto", "1 cucharadita de vinagre de vino tinto", "2 cucharaditas de salsa de pescado", "1 cucharadita de jugo de lima", "200g / 7oz de tomates de ciruela madurados en la vid", "aceite de oliva", "4 bollos de hamburguesa brioche, cortados por la mitad", "4 hojas de lechuga Little Gem crujientes"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el vientre de cerdo, coloque todos los ingredientes en una sartén grande y vierta suficiente agua para cubrir el cerdo entre 3-4 cm. Deje que el líquido hierva a fuego lento y elimine cualquier espuma o espuma que salga a la superficie. Una vez que el agua esté razonablemente clara, coloque un trozo de papel para hornear arrugado, cortado al diámetro de la sartén, sobre la barriga de cerdo. Esto ayudará a mantener la humedad en la sartén durante la cocción.", "Hervir a fuego lento la barriga de cerdo durante dos horas hasta que esté muy tierna. No debe haber resistencia cuando la perforas con un cuchillo. Deje que la barriga se enfríe completamente en el líquido de cocción.", "Levante el cerdo enfriado de la sartén y colóquelo en una bandeja para hornear. Cubra con una película adhesiva y refrigere durante al menos una hora hasta que se haya endurecido, lo que hará que sea más fácil cortar. Una vez que esté firme, retire la barriga de cerdo del refrigerador y corte en porciones individuales.", "Mientras se cocina el cerdo, prepare la mayonesa con tocino. Caliente el aceite en una sartén pequeña a fuego lento, agregue el tocino y fríalo suavemente hasta que haya consumido toda su grasa.", "Cuele el tocino a través de un colador fino y reserve el aceite con sabor a tocino. (El tocino no se usa en esta receta). Deje que el aceite se enfríe a temperatura ambiente antes de comenzar a hacer la mayonesa o se puede partir.", "Batir la yema de huevo, el vinagre y la mostaza juntos en un tazón grande. Batiendo continuamente, rocíe lentamente el aceite de tocino refrigerado en el tazón en una corriente constante para crear una emulsión. Una vez que se haya incorporado todo el aceite, agregue el jugo de limón y la salsa de soja, que adelgazarán la mayonesa. Pruebe y ajuste el condimento al gusto. Cubra el recipiente y refrigere hasta que esté listo para usar.", "Para el chutney de tomate, caliente el aceite en una cacerola y agregue la cebolla. Cocine la cebolla a fuego medio durante 8-10 minutos, revolviendo ocasionalmente, hasta que esté suave y translúcida. Agregue el ajo, el pimentón y la hierba de limón, y mezcle bien. Cocine suavemente por otros cinco minutos, revolviendo de vez en cuando.", "Caliente el azúcar en otra sartén seca hasta que se derrita y comience a caramelizar a un color marrón dorado. Agregue el vinagre de vino tinto y la salsa de pescado al caramelo. Si el caramelo se endurece al contacto con el líquido, revuelva la mezcla durante unos minutos hasta que se disuelva. Vierta esto sobre la mezcla de cebolla y agregue el jugo de limón. Cocine por un minuto y agregue los tomates cortados en cubitos y mezcle bien. Cocine por un minuto más y luego retire la sartén del fuego.", "Cuando esté listo para servir, retire la corteza gruesa del vientre de cerdo. Calentar una capa delgada de aceite de oliva en una sartén. Agregue las piezas de panza de cerdo y freír durante unos dos minutos en cada lado hasta que estén doradas y calientes. Tueste los panecillos brioche y esparza un poco de mayonesa de tocino en las mitades inferiores. Disponga unas pocas hojas de lechuga en cada base de brioche, luego coloque las piezas de pan de cerdo y una generosa cucharada de salsa picante de tomate en la parte superior. Cubra con las tapas de brioche y sirva a la vez."]}, {"isVegetarian": false, "title": "Pollo a la barbacoa con ensalada de col", "url": "www_bbc_co_uk_food_recipes_bbq_chicken_with_52315", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_chicken_with_52315_16x9.jpg", "ingredients": ["100ml / 3½fl oz de vinagre de sidra", "2 cucharadas de azúcar moreno oscuro", "1 cucharadita de pimentón ahumado", "1 cucharada de mostaza Dijon", "1 cucharada de salsa de soja oscura", "½ cucharadita de sal marina y pimienta negra", "4 muslos de pollo deshuesados, piel sobre", "½ repollo rojo pequeño, finamente cortado", "2 zanahorias ralladas gruesas", "1 cebolla roja pequeña / ½ grande, finamente rebanada", "8 rábanos, en rodajas", "3 cebollas de primavera, muy finamente cortadas", "2 limas, solo jugo", "2 cucharaditas de semillas de cebolla negra", "1 cucharada de semillas de girasol", "1 cucharada de semillas de calabaza", "pequeño racimo de cilantro fresco, finamente picado", "menta fresca de manojo pequeño, finamente picada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el glaseado para el pollo, combine el vinagre con 100 ml / 3½ fl oz de agua en una olla. Agregue el azúcar, pimentón ahumado, mostaza y salsa de soja. Agitar para combinar y llevar a ebullición. Reduzca el fuego y cocine a fuego lento durante 10 minutos, o hasta que espese. Retirar del fuego y sazonar al gusto con sal y pimienta.", "Mientras tanto, agregue los ingredientes para la ensalada de col a un tazón grande, mezcle para combinar y sazone al gusto.", "Caliente una sartén a fuego alto hasta que esté caliente. Abra los muslos de pollo y sazone con sal y pimienta. Coloque el pollo con la piel hacia abajo sobre la plancha y fríe durante 3-4 minutos.", "Cepille el pollo con un poco de glaseado, luego dé vuelta y cocine por 3-4 minutos más, cepillando ocasionalmente con el glaseado mientras cocina. Apague el fuego y descanse durante cinco minutos.", "Cortar en rodajas gruesas y servir con la ensalada de col. Rocíe con cualquier jugo pegajoso antes de servir."]}, {"isVegetarian": false, "title": "Filete de barbacoa con champiñones a la parrilla y salsa de peppercorn", "url": "www_bbc_co_uk_food_recipes_bbq_fillet_steak_with_56885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g / 10½oz de patatas harinas, cortadas en trozos grandes", "2 filetes de solomillo de ternera de 150-200 g / 5-7½ oz", "2 hongos Portobello", "50 ml / 2 fl oz en Madeira", "40 g / 1½ oz de mantequilla, cortada en cubos", "2 ramitas de tomillo frescas", "Crema doble 350ml / 12fl oz", "100ml / 3½fl oz de aceite de oliva", "1 hoja de laurel", "2 dientes de ajo, 1 entero y 1 rebanado fino", "200 g / 7 oz de setas", "2 cucharaditas de perejil fresco finamente picado", "100ml / 3½fl oz de salsa Worcestershire", "2 cucharadas de granos de pimienta verde, aplastados", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Hervir las papas en agua con sal durante 15-20 minutos o hasta que estén tiernas.", "Mientras tanto, calienta una barbacoa o plancha a fuego vivo. Ase los filetes de carne y los champiñones de Portobello durante 3-4 minutos por cada lado para los medios raros. Aumente el tiempo de cocción por bien hecho.", "Caliente el Madeira en una sartén y bata la mayor parte de la mantequilla hasta que tenga una salsa suave. Agregue una ramita de tomillo y luego los filetes cocidos. Retire del fuego, cubra y deje que los filetes descansen en la salsa. Mantenga los hongos Portobello calientes.", "Vierta 100 ml / 3½ fl oz de crema doble en una olla. Agregue el aceite de oliva, la ramita de tomillo restante, la hoja de laurel y el diente de ajo entero pelado. Deje que hierva a fuego lento, apague el fuego y déjelo a un lado para infundir durante 15 minutos.", "Escurra las papas y machaque bien hasta que quede suave. Cuele la crema Herby a través de un colador y golpéala con las papas hasta que tenga un puré muy suave.", "Derretir la mantequilla restante en una sartén grande y agregar el ajo en rodajas. Agregue los champiñones silvestres y saltee, revolviendo ocasionalmente, durante 5-10 minutos. Sazonar y agregar el perejil.", "Retire los filetes de la salsa y corte en tiras finas. Agregue la salsa Worcestershire a la salsa Madeira y reduzca hasta que tenga alrededor de 3 cucharadas soperas. Agregue la crema doble restante y los granos de pimienta.", "Coloque el puré de papa en el medio de dos platos para servir. Coloque el hongo Portobello en el centro y coloque la carne cortada en la parte superior. Con una cuchara, coloca los champiñones y sirve con la salsa."]}, {"isVegetarian": false, "title": "Malvaviscos de frambuesa BBQ con salsa de frambuesa", "url": "www_bbc_co_uk_food_recipes_bbq_raspberry_24234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g / 1lb de azúcar granulada", "1 cucharada de glucosa líquida", "9 hojas de gelatina, empapadas en 140ml / 4¾fl oz de agua", "2 claras de huevo de gallinas camperas", "1 cucharadita de extracto de vainilla", "aceite vegetal, para engrasar", "Frambuesas 125g / 4½ oz, ligeramente trituradas", "5-6 cucharadas de azúcar glas", "5-6 cucharadas de harina de maíz", "Frambuesas 250 g / 9 oz", "2 cucharadas de azúcar glas"], "serves": "Para 6", "time": {"preparation": "1-2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Para los malvaviscos, coloque el azúcar granulada, la glucosa y 200 ml / 7 fl oz de agua en una cacerola de base pesada y deje que hierva. Caliente hasta que un termómetro de azúcar muestre 127C / 260F.", "Agregue las hojas de gelatina remojadas y el agua al jarabe de azúcar caliente. Revuelva la mezcla y viértala en una jarra.", "Coloque las claras de huevo en un recipiente sin grasa y bata hasta obtener picos firmes.", "Continúe batiendo las claras de huevo, luego vierta el jarabe de azúcar sobre las claras de huevo, batiendo todo el tiempo hasta que los blancos estén brillantes.", "Agregue el extracto de vainilla y continúe batiendo durante aproximadamente 5-10 minutos hasta que la mezcla sea lo suficientemente gruesa como para mantener su forma en un batidor.", "Engrase ligeramente una bandeja para hornear de 30cm x 20cm / 12in x 8in. Espolvorea la bandeja con azúcar glas y harina de maíz.", "Vierta la mitad de la mezcla y esparza las frambuesas por encima. Cubra con la mezcla restante, alisando la parte superior con una espátula húmeda. Enfriar en la nevera durante al menos una hora.", "Para la salsa de frambuesa, coloque todos los ingredientes en un procesador de alimentos y mezcle hasta obtener un puré suave. Pase la mezcla a través de un colador fino con una espátula o cuchara.", "Retire el malvavisco de la nevera, espolvoree un poco más de azúcar glas y harina de maíz sobre la superficie de trabajo. Afloje el borde del malvavisco y luego colóquelo sobre la superficie de trabajo espolvoreada.", "Cortar en cuadrados y rodar los malvaviscos en el azúcar glas y harina de maíz para cubrir.", "Precalentar la parrilla a altura o usar una barbacoa.", "Coloque con cuidado los malvaviscos en un pincho de madera. Grill durante 1-2 minutos hasta que esté ligeramente chamuscado y pegajoso.", "Sirva los pinchos de malvaviscos con un tazón de salsa de frambuesa."]}, {"isVegetarian": false, "title": "BBQ caballa con ensalada de rábano, pepino y borraja", "url": "www_bbc_co_uk_food_recipes_bbq_mackerel_with_a_97497", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8-12 rábanos, con sus tapas en", "6 cucharadas de vinagre de sidra", "3 cucharadas de aceite de colza prensado en frío, más extra para la caballa", "1 cucharada de azúcar en polvo", "sal y pimienta negra recién molida", "½ pepino, pelado, cortado por la mitad y sin semillas, en rodajas finas", "15 g / ½ onza de cebollín, finamente picado", "4 filetes de caballa, deshuesados", "puñado de flores de borraja, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lave bien los rábanos, córtelos y léelo para usarlo como hoja de ensalada. (Si sus rábanos ya están recortados, las hojas de ensalada normales servirán como su ensalada). Corta finamente todos los rábanos, mantente a un lado.", "En un recipiente, coloque el vinagre, el aceite de colza y el azúcar. Luego sazone con sal y pimienta y mezcle.", "Agregue los rábanos y mezcle, luego agregue el pepino y el cebollín y mezcle bien.", "Precaliente una barbacoa o, alternativamente, caliente una parrilla o una bandeja antiadherente si está lloviendo. Sazonar la caballa con sal, pimienta y rociar con un poco más de aceite. Cocine durante unos tres minutos por cada lado, según el método de cocción.", "Mientras el pescado se está cocinando, agregue las hojas de rábano (o las hojas de ensalada si se usa) al bol y mezcle bien.", "Para servir, comparte la ensalada entre cuatro platos y agrega el aderezo. Coloque un filete de caballa cocida en cada plato y adorne con las flores de borraja."]}, {"isVegetarian": false, "title": "Pechuga de pollo a la barbacoa con salsa de calabacín", "url": "www_bbc_co_uk_food_recipes_bbqchickenbreastwith_12161", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pechugas de pollo, sin piel", "3 calabacines grandes (calabacines), cortados en rodajas ½ cm / ¼ de grosor", "4 dientes de ajo, picados aproximadamente", "aceite de oliva virgen extra", "sal marina y pimienta negra recién molida", "290 ml / ½ litro de agua o caldo de pollo", "50g / 2oz de mantequilla ablandada"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente abundante aceite de oliva virgen extra en una sartén grande.", "Agregue el ajo y la sal marina, y fría por un par de minutos.", "Agregue el calabacín y toque un poco más de sal, y continúe freír, revolviendo continuamente para que los calabacines se muevan.", "Agregue el agua o el caldo y deje hervir a fuego lento durante 2 o 3 minutos, hasta que el calabacín esté bien ablandado.", "Retire la mitad del calabacín de la sartén y mezcle aproximadamente con la mantequilla. Regrese esto a la sartén y agregue pimienta, sal y un chorrito más de aceite de oliva.", "Mientras tanto, espolvorea bien las pechugas de pollo con sal, aceite de oliva virgen extra y parrilla a la parrilla por unos minutos a cada lado para producir un efecto entrecruzado. Asegúrese de agregar otra pizca de sal a las pechugas de pollo cuando las gire. Esto se derrite en la carne mientras descansa. Descanse las pechugas de pollo durante 2 minutos.", "Para servir, coloca la salsa de calabacín en platos para servir y coloca el pollo encima con una pizca de aceite de oliva virgen extra y una pizca de pimienta negra recién molida."]}]