[{"isVegetarian": true, "title": "May orchid sweet and sour sauce", "url": "www_bbc_co_uk_food_recipes_mayorchidsweetandsou_11032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1x225g/8oz tin chopped tomatoes ", "1 dessert spoon tomato purée", "1 orange, juice only ", "25g/1oz soft brown sugar", "25g/1oz white sugar", "90ml/3fl oz malt vinegar", "2tsps cornflour", "4 tbsp water", "2 tbsp apricot brandy liqueur or Grand Marnier - optional"], "serves": "Makes 350ml/12fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sieve the chopped tomatoes into a saucepan and work with a wooden spoon until a little pulp is left in the sieve. Discard the pulp. ", "Add the tomato purée, orange juice, soft brown sugar, white sugar, malt vinegar and stir well.", "Bring mixture to the boil. ", "Dissolve the corn flour with water and add to the sauce.  Bring this to the boil until thickened.", "Add apricot brandy or Grand Marnier if desired."]}, {"isVegetarian": true, "title": "MB zinger", "url": "www_bbc_co_uk_food_recipes_mb_zinger_61787", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mb_zinger_61787_16x9.jpg", "ingredients": ["300ml/10fl oz cranberry juice", "150ml/5fl oz bitter lemon", "2 tbsp brandy", "1 lime, halved and sliced ", "mint leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the cranberry juice, bitter lemon and brandy together in a large jug and pour over ice into glasses of your choice. Garnish with lime and mint and serve straight away.  "]}, {"isVegetarian": false, "title": "McSingh's Scotch pie", "url": "www_bbc_co_uk_food_recipes_mcsinghs_scotch_pie_98356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp cumin seeds", "1 tbsp rapeseed oil or vegetable oil, plus extra for greasing", "2 medium red onions, finely chopped ", "6 garlic cloves, crushed", "3 green chillies, seeds removed (optional), finely chopped ", "1 large red pepper, seeds removed, finely chopped", "1 tsp ground mace or grated nutmeg", "2 tsp ground coriander", "1kg/2lb 4oz lamb mince ", "1 tsp freshly ground white pepper", "3 tbsp chopped fresh coriander", "salt", "340g/12oz plain flour, plus extra for dusting", "½ tsp salt", "90ml/3fl oz milk", "150g/5½oz lard, chopped into cubes, plus extra for greasing", "1 free-range egg, yolk only, beaten, for brushing"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.", "In a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined.  Set aside, covered, in the fridge.", "Preheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard. ", "To make the pastry, sift the flour and salt in a large bowl and make a well in the centre. ", "Put the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil. ", "Pour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.", "Dust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.", "Add the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape. ", "Brush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.", "Run a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles."]}, {"isVegetarian": true, "title": "Meat-free chilli con carne", "url": "www_bbc_co_uk_food_recipes_meat-free_chilli_con_30042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat-free_chilli_con_30042_16x9.jpg", "ingredients": ["1 tbsp rapeseed oil ", "1 large onion, finely chopped ", "2 garlic cloves, finely chopped", "1 red chilli, finely chopped ", "½ tsp ground cumin", "1 tbsp paprika ", "1 tsp chilli powder", "250g/9oz soya mince ", "400g tin chopped tomatoes", "3 tbsp tomato purée", "300ml/½pint vegetable stock", "1 green pepper, seeds removed and cubed", "1 yellow pepper, seeds removed and cubed", "1 carrot, grated ", "400g tin kidney beans in water, drained ", "1 tsp cornflour ", "handful fresh coriander, finely chopped", "2 wholemeal pitta breads, halved", "4 tbsp sour cream", "50g/1¾oz cheddar, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan over a medium heat. Add the onion and garlic and cook for 4-5 minutes, or until soft.  ", "Add the red chilli, cumin, paprika and chilli powder and cook for 1 minute. Add the soya mince and cook for 2-3 minutes. ", "Add the chopped tomatoes, tomato purée, vegetable stock, peppers and carrot and bring to the boil. Reduce the heat to medium-low and simmer for 10 minutes, stirring occasionally.", "Add the kidney beans and cook for 5 minutes. Mix the cornflour with 1 tablespoon water, then add it to the pan and cook for a further 5 minutes. Stir in the coriander.", "Serve the chilli with the pitta halves, sour cream and grated cheese. "]}, {"isVegetarian": false, "title": "Meat and cabbage buns (Bierocks)", "url": "www_bbc_co_uk_food_recipes_meat_and_cabbage_buns_80117", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp caster sugar", "300ml/½ pint warm water", "1 x 7g/¼oz sachet of fast-action dried yeast", "500g/1lb 2oz strong white flour, plus extra for dusting", "1 tsp fine sea salt", "1 tbsp sunflower oil, plus extra for greasing", "2 tbsp sunflower oil", "500g/1lb 2oz lean minced beef", "2 large onions, finely chopped", "1 small white cabbage", "1 tbsp fine sea salt", "½ tbsp ground white pepper", "1 tsp coarsely ground black pepper", "1 tbsp caraway seeds", "1 tsp cumin seeds", "1 tsp fennel seeds", "1 tsp ground cumin", "50g/2oz butter, melted", "mustard and pickles"], "serves": "Makes 20", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, stir the sugar into the warm water in a bowl. Sprinkle over the yeast and stir it lightly, then leave for 10 minutes until a light foam floats on the surface. ", "Mix the flour and salt in a bowl and make a well in the centre. Stir the oil into the yeast mixture and slowly pour it all into the flour, mixing with a wooden spoon and then with your hands to form a soft dough.", " Knead the dough on a floured surface for about 10 minutes until it’s smooth and elastic. Put the dough in a lightly oiled bowl, cover with oiled cling film and leave it to rise in a warm place for 30–45 minutes.", "To prepare the filling, heat the oil in a large non-stick frying pan over a medium heat and gently fry the beef and onions until lightly browned, stirring regularly. ", "Remove any damaged leaves from the cabbage, cut it into quarters and discard the tough core. Finely shred the leaves. ", "Stir the cabbage leaves, salt, pepper and all the spices into the pan with the meat. Continue to fry and stir for 3 or 4 minutes more. Add 100ml/3½fl oz water, cover the pan and cook gently for 5 minutes until the cabbage is very soft. Remove the pan from the heat, stir the mixture well and leave to cool.", "Return the dough to the work surface and knock it back with your knuckles. Knead it lightly again, then divide it into 20 equal portions and roll each one into a ball. Roll out the balls on a lightly floured surface into rounds measuring about 12cm/4½ in, roughly the diameter of a saucer.", "You’ll need two large baking sheets, lined with baking parchment. Place two tablespoons of the filling into the middle of a dough round, leaving a small border around the edge. Brush the border with water and bring the sides of the dough over the filling into the centre and pinch them together to seal. Place the filled bun on a baking tray, with the seam underneath. Repeat until you’ve used all the dough and filling, then leave the buns in a warm place for about 20 minutes until they have doubled in size. ", "Preheat the oven to 180°C/350F/Gas 4. Bake the bierocks for about 20 minutes until they are well risen and golden brown. Brush them with the melted butter and serve warm with mustard and pickles – and beer, of course!"]}, {"isVegetarian": false, "title": "Meat and potato pie", "url": "www_bbc_co_uk_food_recipes_meat_and_potato_pie_22149", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat_and_potato_pie_22149_16x9.jpg", "ingredients": ["2 large onions, chopped", "700g/1lb 9oz chuck steak (braising steak), cut into 4-5cm/1½-2in chunks", "400g/14oz waxy potatoes, such as Charlotte, peeled and cut into 4cm/1½oz chunks", "400g/14oz floury potatoes, such as Desiree, peeled and cut into 4cm/1½oz chunks", "salt and pepper", "375g/13oz plain flour", "175g/6oz shredded beef suet"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["First make the filling, put the onions and steak in a large pan. Add enough water to just cover them and bring to a simmer. Cover with a lid, reduce the heat and simmer gently for 1½ hours.", "Add the potatoes to the pan, along with some salt and pepper, and cook for 30-35 minutes more or until the potatoes are soft and the meat tender. The gravy should be nicely thickened by the potatoes. ", "Check the seasoning and add salt and pepper to taste.", "Pour off 300-600ml/10-20fl oz of liquid from the pan – enough to leave the filling nicely moist but not swimming in liquid – and save this to use as gravy with the pie. Transfer the filling to a 1.2 litre/2 pint pie dish and leave to cool completely.", "Heat your oven to 200C/400F/Gas 6. ", "For the suet crust, combine the flour and suet in a large bowl with some salt and pepper. Gradually mix in enough cold water to form a soft, slightly sticky dough. Leave to stand for five minutes.", "On a lightly floured surface, roll out the pastry to a 7-8mm/1/3in thickness. Cut a 2cm/¾in strip of pastry. Dampen the edges of the rim of the pie dish with water. Stick the pastry strip onto the rim and dampen this too. Lay the remaining pastry on top. Press down to seal the edges, crimp or flute the edges of the pastry then trim off the excess.", "Bake the pie for 30-40 minutes, or until the pastry is golden-brown. Leave to stand for 10–15 minutes before serving."]}, {"isVegetarian": false, "title": "Meat and potato pie", "url": "www_bbc_co_uk_food_recipes_meat_and_potato_pie_66778", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meat_and_potato_pie_66778_16x9.jpg", "ingredients": ["2.75kg/6lb braising steak, cut into cubes", "3 medium onions, chopped", "2.75kg/6lb potatoes, peeled, cut into chunks", "1 tbsp beef extract", "4 tbsp gravy granules", "500g/1lb 2oz plain flour", "2 tsp salt", "125g/4½oz margarine, cut into small cubes", "125g/4½oz lard, cut into small cubes", "125ml/4fl oz cold water", "1 free-range egg, beaten"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pie filling, put the beef and onions into a large, lidded saucepan and season with salt. Pour in enough water to cover the contents of the pan and bring to the boil. Once boiling, put cover the pan with a lid, reduce the heat and simmer gently for 2½–3 hours, or until the meat is tender. ", "Meanwhile, for the pastry, tip the flour and salt into a bowl, and add the cubes of margarine and lard. Using your fingertips, rub the fat into the flour until the mixture has the texture of breadcrumbs, and no large lumps of fat remain. Add the water and mix with a cutlery knife until the pastry begins to come together. Add more water very gradually if needed. Knead the dough lightly, shape into a ball, wrap in clingfilm and chill in the fridge for 30 minutes, or until the beef mixture is cooked. (Alternately, blend the flour, salt, margarine and lard in a food processor until the mixture has the texture of breadcrumbs. With the motor running slowly add the water through the funnel, until the mixture starts to come together.)", "Once the meat has been cooking for two hours, preheat the oven to 200C/400F/Gas 6. ", "Cook the potatoes in salted water until tender. Drain and set aside.", "When the meat is tender, remove the pan from the heat. Ladle some of the liquid from the meat into a jug to cool. Mix together the gravy granules and meat extract, and gradually add to the cooled liquid, mixing in thoroughly. Pour over the meat, and heat gently until simmering. Once simmering, remove from the heat and leave to cool slightly. ", "Remove the pastry from the fridge. Cut a small amount of pastry and roll it out on a lightly floured work surface to a 3mm/⅛in thickness . Cut the pastry into thin strips. Dampen the rim of a 28 x 38cm/11in x 15in pie dish with water, and line the rim with the strips of pastry. ", "Strain the meat and onions, reserving the sauce. Spread the meat and onions in an even layer in the base of the dish. Layer the potatoes on top of the meat and onions. Pour the reserved sauce over the filling, until just below the top of the potatoes. Reserve any remaining sauce. ", "Roll the remaining pastry out on a floured work surface to a 3mm/⅛in thickness, and cut to the size of the pie dish. Brush the strips of pastry on the rim of the dish with beaten egg, and place the pastry lid on top. Press the edges to seal, and brush the lid of the pie with the remaining beaten egg. Cut a few slits in the lid of the pie to allow steam to escape.", "Cook in the preheated oven for 50–60 minutes, or until the pastry is golden-brown and the filling is bubbling inside. ", "Serve the hot pie with the reserved sauce on the side. "]}, {"isVegetarian": false, "title": "Meat patties", "url": "www_bbc_co_uk_food_recipes_meat_patties_12781", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz lard ", "40g/1½oz butter", "175g/6oz plain flour", "pinch of salt", "1 free-range egg, beaten with a drop of milk", "1 small onion, chopped", "1 tbsp oil or butter", "1 thick slice bread", "125g/4½oz roast beef, or other cooked meat", "leftover gravy ", "sea salt and freshly ground black pepper"], "serves": "Makes 10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["First make the pastry. Rub the fat into the flour, or pulse in a food processor, until the mixture resembles breadcrumbs. Add the salt and mix with enough water to form a dough.", "Wrap the dough in cling film and leave it to rest in the fridge while you make the filling.", "Heat the oil in a frying pan and fry the onion for 4-5 minutes, or until soft, then leave to cool. ", "Blend the bread in a food processor to make breadcrumbs, then add the meat and onion and pulse until coarsely chopped. ", "Tip the mixture into a bowl and add enough gravy to make a soft mixture. Season, to taste, with sea salt and freshly ground black pepper.", "Preheat the oven to 200C/400F/Gas 6.  Grease a 12-hole patty tin (or fairy cake tin).", "Roll out the pastry and cut 10 large circles for the bases of the pies and 10 smaller circles for the lids.", "Place the larger pastry rounds in greased patty tins and add a heaped teaspoon of filling to each. Dampen the edges of the patties with water and top with the lids, making sure the edges are well sealed.", "Brush the patties with the beaten egg and pierce a hole in each one to allow the steam to escape. Bake the patties in the preheated oven for 20–30 minutes or until golden-brown."]}, {"isVegetarian": false, "title": "Meat ravioli", "url": "www_bbc_co_uk_food_recipes_meat_ravioli_19110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz ‘00’ flour, plus extra for flouring", "100g/3½oz semolina, plus extra for dusting", "4 free-range eggs", "½ small onion, finely chopped", "125g/4½oz pork mince", "125g/4½oz beef mince", "4 tbsp white wine", "1 free-range egg, beaten", "60g/2¼oz fresh breadcrumbs", "handful fresh parsley, finely chopped", "2 tbsp olive oil", "1 garlic clove, thinly sliced", "½ red chilli, chopped", "10 cherry tomatoes, halved", "handful fresh basil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, mix the flour and semolina together on a clean work surface or in a large bowl. Make a well in the centre and break in the eggs. With a fork or with your hands, gradually mix the flour with the eggs to form a soft dough. Knead the dough for 5 minutes, or until smooth. Shape the dough into a ball, wrap in cling film and leave to chill in the fridge for at least 30 minutes.", "Flour the pasta machine with semolina and divide the pasta into 4 equal pieces. Starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other pieces of dough.", "Once the pasta sheets have reached the ideal thickness, dust with semolina and set aside.", "For the tomato sauce, add the olive oil to a pan and add the garlic and chilli. Cook for 2-3 minutes, until the garlic starts to colour a little. Add the tomatoes and warm through in the pan. Season with salt and pepper.", "To make the ravioli, put a pasta sheet on your board and place a heaped teaspoon of the ricotta mixture at equal intervals along the pasta. Brush a little of the beaten egg around each filling then lay another pasta sheet on top and carefully press down around each filling ball to remove any air. Cut in squares with your ravioli cutter or knife, then dust with semolina flour and set aside. Repeat the process with the meat filling.", "To cook the ravioli bring some water to the boil and a good tablespoon of salt (the water should be as salty as the sea). Drop the ravioli in to the water in small batches and cook until the float to the surface, then add them to the tomato sauce. You can add a little of the pasta water to the sauce to get the right consistency.", "Scatter some basil leaves over the top and serve."]}, {"isVegetarian": false, "title": "Meatball and pearl barley stew", "url": "www_bbc_co_uk_food_recipes_meatball_and_pearl_84927", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 onion, diced ", "4 carrots, diced ", "1 garlic clove, thinly sliced", "1 litre/1¾ pints beef stock (made with a stock cube) ", "½ tsp dried mixed herbs ", "175g/6oz pearl barley, well rinsed ", "salt and black pepper ", "400g/14oz beef mince ", "1 onion, finely chopped", "1 garlic clove, finely chopped", "½ tsp dried mixed herbs ", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan or casserole dish over a medium heat. Add the olive oil to the pan along with the onion, carrots and a pinch of salt. Fry for 5-6 minutes, or until the onions are softened and translucent. Add the garlic and cook for a further 1-2 minutes, or until aromatic. ", "Pour in 750ml/1¼pint of the stock and add the dried herbs and pearl barley.  Bring to just below boiling point and then reduce the heat until very gently simmering. Cook for 30 minutes. ", "For the meatballs, mix together the mince, onion, garlic and herbs along with a generous pinch of salt and pepper. Using your hands, roll into 16 balls.", "Heat a frying pan over a medium heat and add one tablespoon of olive oil. Once hot, fry the meatballs on all sides until nicely coloured, being careful not to burn them. You may need to do this in batches. ", "Transfer the coloured meatballs to the pan with the barley and gently mix through. Put the frying pan over a medium heat and pour 100ml/3½fl oz of water into the pan. Use a wooden spoon to scrape the bottom and catch all the flavours from frying the meatballs then pour this liquid into the pan with the barley.", "Add the remaining stock to the barley pan, cover and cook for a further 10 minutes, or until the meatballs are cooked through. Serve warm."]}, {"isVegetarian": false, "title": "Meatball curry", "url": "www_bbc_co_uk_food_recipes_meatball_curry_51206", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatball_curry_51206_16x9.jpg", "ingredients": ["450g/1lb lean beef mince ", "1 tsp crushed garlic", "1 large onion, finely chopped", "½ tsp black pepper, coarsely ground", "1 tsp garam masala", "1 free-range egg", "1 tsp rapeseed oil", "1 tsp cumin seeds", "1 tsp finely chopped root ginger", "1 x 400g/14oz can chopped tomatoes", "1 tsp tomato purée", "½ tsp ground turmeric", "60-90ml/2-3fl oz water (optional)", "cooked brown basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the beef mince, garlic, half of the onion, pepper, garam masala and egg together in a bowl. Using your hands, shape the meat mixture into 24 balls. ", "Preheat the grill to hot. Line the bottom of a grill tray with aluminium foil and place the meatballs on the grill tray. (This will allow the fat to drain off into the lined tray, saving on washing up.) Grill the meatballs under a medium heat for 10-15 minutes, turning occasionally, or until nicely browned.", "Heat the rapeseed oil in a frying pan, and add the cumin seeds and the remaining onion. Cook for 4-5 minutes, or until softened, then stir in the ginger.", "Add the chopped tomatoes, tomato purée and turmeric and cook for 10 minutes or until the sauce has thickened.", "Add the cooked meatballs, reduce the heat and simmer for 20 minutes. Add 60-90ml/2-3fl oz water if the curry is a bit dry. Serve with rice."]}, {"isVegetarian": false, "title": "Meatballs in gravy", "url": "www_bbc_co_uk_food_recipes_meatballs_in_gravy_04987", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz lean beef mince", "250g/9oz pork mince", "1 small onion, very finely chopped", "1 garlic clove, finely chopped", "25g/1oz fresh white breadcrumbs", "2 tsp dried mixed herbs", "sea salt and freshly ground black pepper", "2 tsp sunflower oil", "1 tbsp sunflower oil", "1 medium onion, finely sliced", "1 tbsp plain flour", "150ml/5fl oz red wine", "300ml/10fl oz beef stock made with 1 beef stock cube", "1 tbsp tomato purée"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the beef and pork mince in a large bowl and add the onion, garlic, breadcrumbs and dried herbs. Season with salt and freshly ground black pepper and mix well with clean hands. Divide the mixture into 20 portions and roll into small, neat balls.", "Heat the sunflower oil in a large non-stick frying pan and fry the meatballs for 6–8 minutes, or until nicely browned on all sides. Roll the meatballs around in the pan as they brown to prevent them from becoming flattened on one side. (You may need to do this in batches.) Transfer the meatballs to a large lidded saucepan.", "To make the gravy, heat the sunflower oil in the frying pan and gently fry the onion over a low heat for five minutes, or until softened, stirring regularly. ", "Sprinkle the flour into the pan and stir well. Slowly add the red wine, stock and tomato purée, stirring constantly. ", "Pour the gravy over the meatballs and bring to the boil. Reduce the heat, cover the pan with a lid and leave to simmer gently over a low heat for 30 minutes, stirring occasionally.", "Remove the lid and increase the heat. Boil the gravy for another 3–5 minutes or until thickened. Season, to taste, with salt and freshly ground black pepper and serve. "]}, {"isVegetarian": false, "title": "Meatballs in tomato sauce with cinnamon and cumin (Soutzoukakia)", "url": "www_bbc_co_uk_food_recipes_meatballs_in_tomato_95724", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_in_tomato_95724_16x9.jpg", "ingredients": ["500g/1lb 2oz beef mince", "2 garlic cloves, finely chopped or grated", "1 free-range egg, beaten", "½ tsp ground cumin", "½ tsp dried oregano", "2 slices stale white bread (about 100g/3½oz), soaked in red wine, squeezed dry and torn into small pieces", "½ tsp salt", "12 turns black peppermill", "3 tbsp olive oil", "3 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "5cm/2in cinnamon stick", "1 tsp ground cumin", "1 tsp sugar", "150ml/5fl oz red wine", "1 tbsp tomato purée", "500ml/18fl oz passata", "½ tsp salt", "12 turns black peppermill", "cooked rice", "12 green olives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the meatballs, put all the ingredients, except the olive oil, in a large bowl and mix. With wet hands, shape the mixture into 20 to 24 rugby-ball shapes. ", "Heat the oil in a frying pan over a high heat and fry the meatballs until golden-brown on all sides, or grill on a griddle pan if you like grill lines on the patties.", "To make the tomato sauce, heat the oil in a lidded saucepan over medium heat. Sweat the onion and garlic with the cinnamon stick, cumin and sugar until soft, about 10 minutes. Add the red wine and bring to the boil, then reduce the heat to medium. Add the tomato purée, passata, salt and pepper and cook until slightly thickened, about 20 minutes.", "Add the meatballs and simmer for 20–30 minutes covered until cooked through, adding a little water if the sauce is too thick. Serve with rice and green olives. "]}, {"isVegetarian": false, "title": "Meatballs with cherry tomato sauce and tagliatelle", "url": "www_bbc_co_uk_food_recipes_meatballs_with_cherry_34105", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_cherry_34105_16x9.jpg", "ingredients": ["200g/7oz beef mince ", "½ tsp thyme ", "2 spring onions, finely chopped ", "salt and freshly ground black pepper", "2 tbsp olive oil, for frying", "1 tbsp extra virgin olive oil ", "2 garlic cloves, thinly sliced", "pinch dried chilli flakes (or more if you like spicy food) ", "400g tin cherry tomatoes or chopped tomatoes", "5 basil leaves, shredded (optional)", "200g/7oz fresh tagliatelle, cooked according to packet instructions", "freshly grated Parmesan"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, put all of the meatball ingredients, apart from the oil, in a bowl. Season with salt and pepper, then use your hands to thoroughly mix everything together. Divide the mixture into 10 evenly sized pieces and roll each piece into a ball, then flatten slightly so they will cook more quickly.", "Heat the olive oil in a large frying pan over a medium heat then add the meatballs and fry for 5-6 minutes, turning once or twice, or until golden-brown on both sides and cooked through.", "For the sauce, heat the olive oil in a saucepan over a medium heat, add the garlic and chilli and fry for 1 minute. Tip in the tomatoes, increase the heat to high, and simmer for 5 minutes to reduce slightly then season with salt and pepper. Stir in the basil leaves, reserving a little for garnish. ", "To serve, spoon the hot tagliatelle into a wide bowl, put the meatballs on top, pour over the tomato sauce, scatter with Parmesan and garnish with a little basil."]}, {"isVegetarian": false, "title": "Swedish meatballs with cream sauce", "url": "www_bbc_co_uk_food_recipes_meatballs_with_cream_52301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp oil", "1 onion, chopped", "1 anchovy fillet, chopped ", "200ml/7fl oz reduced veal stock (or chicken stock)", "200ml/7fl oz double cream ", "1 tsp cornflour ", "salt and freshly ground black pepper", "½ onion, finely chopped", "150ml/5fl oz double cream", "100ml/3½fl oz milk", "1 tbsp salt", "1 tsp ground allspice", "100g/3½oz fresh breadcrumbs ", "250g/9oz beef mince ", "250g/9oz pork mince", "4 tbsp vegetable oil, for frying, plus extra for greasing", "75g/2½oz unsalted butter", "¼ white cabbage, shaved thinly on a mandoline", "1 head fennel, shaved thinly on a mandoline", "salt", "2 apples, shaved thinly on a mandoline", "2 tbsp olive oil", "3 tbsp soured cream", "salt and pepper", "1 tbsp white wine vinegar", "500g/1lb 2oz new potatoes, cooked"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cream sauce, heat the oil in a large pan and fry the onions until soft and translucent. Add the anchovy and stock. Bring to the boil and cook until the volume of liquid has reduced by a third. Add the cream and cook over a low heat for another 6-8 minutes. ", "Mix the cornflour with a little water to form a paste then stir it into the sauce. Season with salt and pepper. Keep warm until ready to serve.", "Preheat the oven to 220C/200C Fan/Gas 6. ", "For the meatballs, fry the onion in a little butter until soft then transfer to a large bowl.  Mix in the cream, milk, salt, spices and breadcrumbs. Add the beef and pork mince and mix thoroughly by hand. Roll the mixture into small balls and place them on a lightly oiled baking tray. ", "Add some water to another baking tin and place it in the bottom of the oven to create steam. Roast the meatballs for 10 minutes, or until firm. ", "For the salad, put the cabbage and the fennel in a large sieve. Sprinkle with salt and set aside for 5-10 minutes. Then squeeze the liquid out of the cabbage using your hands. Place in a bowl and mix in the remaining salad ingredients. Season with salt and pepper. ", "To finish the meatballs, heat the oil and remaining butter in a large frying pan and fry until browned (do this in batches if necessary; do not crowd the pan). ", "To serve, put the meatballs in a serving bowl and pour over the cream sauce. Serve the salad alongside in separate serving bowls. A little lingonberry jam would be traditional, too."]}, {"isVegetarian": false, "title": "Meatballs with fennel and ricotta", "url": "www_bbc_co_uk_food_recipes_meatballs_with_fennel_10756", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_fennel_10756_16x9.jpg", "ingredients": ["1 chicken carcass", "½ onion", "½ stick of celery", "½ leek", "1 bay leaf", "5 black peppercorns", "1 small sprig fresh thyme", "50ml/2fl oz olive oil", "2 large onions, thinly sliced", "1 bay leaf", "2 litres/3½ pints full-fat milk", "pinch sea salt", "2 lemons, juice only", "100g/3½oz butter", "50g/1¾oz fresh breadcrumbs", "500g/1lb 2oz pork mince", "100g/3½oz finocchiona salami (salami with fennel), finely chopped", "1 free-range egg", "pinch fennel seeds", "1 sprig fresh rosemary, leaves only, finely chopped", "1 sprig fresh oregano, leaves only, finely chopped", "1 tbsp olive oil, plus extra for drizzling", "1 fennel head, very thinly sliced (use a mandoline, if available)", "50g/1¾oz Parmesan cheese, grated", "2 tbsp pine nuts, toasted", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken stock, put all the stock ingredients in a large saucepan. Cover with cold water and slowly bring to the boil. Reduce the heat and simmer for 3 hours. Skim off any fat from the surface, the more fat you remove, the clearer, and therefore purer, your stock will be.", "Strain the stock through a sieve lined with a fine cloth. Slowly pour it through - don’t press or it will become cloudy. Pour the strained stock into a clean saucepan and simmer until the volume of liquid has reduced by half. Strain again and chill.", "For the onion jam, heat the olive oil in a saucepan. Add the onions and bay leaf and cook gently until soft. Cook over a low heat for about an hour, or until the onions are golden-brown and their natural sugars have caramelised. Remove from the heat. When cool, place in a airtight container and transfer to the fridge. ", "To make the ricotta, heat the milk until just below boiling, then add the salt and lemon juice. Remove from the heat and set aside for 10 minutes. After this time, the milk should be curdled. Strain through a muslin cloth and leave to rest for 30 minutes (leave for longer if you prefer a drier ricotta). Store in an airtight container and in the fridge. ", "Preheat the oven to 180C/160C Fan/Gas 4.", "For the meatballs, melt 50g/1¾oz butter in a frying pan over a medium heat. Add the breadcrumbs and toast until golden-brown, stirring often. If they start to colour too quickly, lower the heat. Set aside to cool.", "Mix the mince, salami, egg, fennel seeds and herbs in a bowl. Roll into golf-ball size balls using your hands. Heat a drizzle of olive oil in a frying pan, then add the meatballs and fry them all over to seal. Transfer to an ovenproof dish.", "Put the fennel and a tablespoon olive oil in the pan and cook gently for about 10 minutes. Add 2 tablespoons of the onion jam and all of the chicken stock. Bring to the boil, then reduce the heat and simmer until the volume of liquid has reduced by three-quarters. Add the remaining butter and swirl it around so it emulsifies and combines into a sauce. Season with salt and pepper and pour the mixture over the meatballs.", "Bake the meatballs for 10 minutes, then remove, sprinkle with Parmesan and spoon over a few tablespoons of ricotta. Return to the oven for 5 minutes, or until the Parmesan has browned. Sprinkle the reserved breadcrumbs and pine nuts evenly over the top and serve immediately."]}, {"isVegetarian": false, "title": "Meatballs with herb salad", "url": "www_bbc_co_uk_food_recipes_meatballs_with_herb_94389", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_herb_94389_16x9.jpg", "ingredients": ["8 cardamom pods", "2 tsp coriander seed", "4 large cloves garlic", "large pinch salt", "300g/11oz lean beef mince", "200g/7oz pork mince", "½ tsp turmeric", "chilli powder, to taste", "1 free-range egg; beaten", "1-2 tbsp groundnut oil", "115g/4oz cream cheese", "200g/7oz baby plum tomatoes, cut in half lengthways", "1 tbsp plain yoghurt", "2-3 tbsp chopped coriander leaves", "2 tbsp flaked almonds, toasted", "4 shallots, finely sliced and deep-fried", "150g/5½oz mixed salad leaves", "2 tbsp finely chopped mint leaves", "2 tbsp finely chopped chives", "2 tbsp finely chopped flat leaf parsley", "2 tbsp finely chopped oregano", "1 tsp white wine vinegar", "1 tsp English mustard", "3 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the meatballs, take the seeds out of cardamom, place into a coffee grinder or pestle and mortar with the coriander and grind to a fine powder. Chop the garlic with the salt until it forms a paste, or add it to the pestle and mortar.", "Place the beef and pork into a bowl and mix together vigorously to soften the texture – this will help stop the cheese escaping.", "Add the ground spices, turmeric, chilli powder and garlic then mix really well with your hands and add the beaten egg.", "Wet your hands, take pieces of the mixture and form into meatballs the size of ping-pong balls. You should have about 12 meatballs.", "Lightly oil a clean work surface with a little of the groundnut oil and gently press the balls into flattened circles", "Put a teaspoon of cream cheese in the centre of each meat circle and carefully bring the meat up round it to enclose the cheese completely, making rather larger meatballs.  Roll gently and make sure there are no holes.", "Heat a frying pan until hot, add the remaining oil and fry the meatballs for 10 minutes over medium high heat, turning regularly. Place the meatballs into a serving dish and keep warm.", "Turn the heat right up then add the tomatoes to the pan, flash-fry them quickly then remove the pan from the heat and stir in the the yoghurt.", "For the salad, toss together the leaves and herbs in a large bowl. Whisk the vinegar, mustard and olive oil together and season with salt and black pepper, then toss together with the salad leaves.", "To serve, arrange the salad around the edge of a platter then place the meatballs in the centre. Pour the tomatoes over the meatballs and garnish with the chopped coriander, almonds and fried shallots.\r\n"]}, {"isVegetarian": false, "title": "Meatballs with tomato sauce", "url": "www_bbc_co_uk_food_recipes_meatballs_with_tomato_70221", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballs_with_tomato_70221_16x9.jpg", "ingredients": ["250g/9oz minced beef", "1 medium free-range egg", "2 tbsp fresh or dried breadcrumbs", "1 tsp dried mixed herbs", "1 garlic clove", "1 tbsp vegetable oil", "salt and pepper", "400g tin chopped tomatoes", "1 tsp dried mixed herbs", "1 tsp caster sugar", "1 garlic clove", "150g/5½oz spaghetti"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beef, egg, breadcrumbs and herbs into a large bowl. Peel and finely grate the garlic then add to the bowl. Work the mixture together with your hands until thoroughly mixed. Season with salt and pepper. Roll the mixture into 12 equal-sized balls.", "Heat the oil in a large frying pan over a medium-high heat. Fry the meatballs in batches for 8 minutes until golden-brown all over. Return all of the meatballs to the pan then pour over the chopped tomatoes, mixed herbs and sugar. Peel and grate the garlic, add to then pan then cook over a medium heat for 8-10 minutes.", "While the meatballs are cooking, bring a large pan of salted water to the boil. Add the spaghetti and cook for 10-12 minutes or according to the packet instructions. Just before the spaghetti is ready, add a ladleful of the pasta water to the tomato sauce to thin it down, if necessary.", "Drain the spaghetti and add to the pan with the meatballs. Toss to combine then divide between two serving bowls."]}, {"isVegetarian": false, "title": "Meatball sandwich", "url": "www_bbc_co_uk_food_recipes_meatballsandtomatosa_90717", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballsandtomatosa_90717_16x9.jpg", "ingredients": ["100g/3½oz minced beef", "1 small garlic clove, finely chopped", "4 tsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "3 tomatoes, chopped", "1 tbsp tomato ketchup", "2 tbsp chopped fresh parsley (optional)", "salt and freshly ground black pepper", "1 small baguette or baton, sliced in half", "simple green salad"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, put the mince and garlic in a bowl and mix well to combine. Shape into small meatballs with wet hands.", "Heat the olive oil in a pan and fry the meatballs for 5-6 minutes, turning frequently, until browned all over and cooked through. Remove the meatballs from the pan, set aside and keep warm.", "For the sauce, fry the onion and garlic in the pan the meatballs were cooked in for 2-3 minutes, or until softened. Stir in the tomatoes and ketchup. Season with salt and pepper. Simmer for 3-4 minutes, or until the tomatoes are tender, then stir in the chopped parsley (if using). ", "Return the meatballs to the pan to warm through in the sauce. Spoon into the baguette and serve with a green salad alongside. "]}, {"isVegetarian": false, "title": "Meatballs in a tomato and lentil sauce", "url": "www_bbc_co_uk_food_recipes_meatballsinatomatoan_84354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["slice pancetta, chopped into cubes", "½ onion, chopped", "1 tbsp brown sugar", "1 tbsp balsamic vinegar", "55g/2oz tinned lentils, drained", "100g/3½oz tinned cherry tomatoes, drained", "small handful fresh basil leaves, torn", "1 slice of bread, crusts removed", "1 clove garlic, chopped", "2 sausages, skins removed", "1 free-range egg yolk", "2 tsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the pancetta into a saucepan over a high heat and fry until crisp and golden.", "Lower the heat to medium and add the onion and soften.", "Add the sugar and vinegar and cook for two minutes.", "Add the lentils and tomatoes and simmer for five minutes.", "For the meatballs, place all the meatball ingredients into a food processor and blend until combined.", "Transfer the meatball mixture onto a clean work surface and using your hands, shape into meatballs.", "Heat the olive oil in saucepan over a high heat and fry the meatballs until golden and cooked through. ", "Add the basil to the sauce and stir through, then transfer into a shallow serving bowl.  ", "To serve, place the meatballs on top of the sauce."]}, {"isVegetarian": false, "title": "Meatballs in spicy tomato sauce served with rice", "url": "www_bbc_co_uk_food_recipes_meatballsinspicytoma_91271", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb 8¾oz beef mince", "1 free-range egg, lightly beaten", "1 onion, peeled and finely chopped", "2 tsbp olive oil", "3 tbsp olive oil", "1 large onion, peeled and finely chopped", "3 garlic cloves, peeled and finely chopped", "1 tsp cumin seeds", "1 tsp black peppercorns, left whole", "1 tsp cloves", "1 cinnamon stick", "1 bay leaf", "4 green cardamom pods, slightly crushed", "1 tbsp garam masala", "1 tbsp mild chilli powder", "1 tbsp ground turmeric", "4 x 400g/14oz cans tomatoes", "plain cooked rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, mix the beef mince, beaten egg and chopped onion together in a large bowl, using your hands, until well combined.", "With wet hands, roll the mixture into walnut-sized balls.", "Heat the oil in a frying pan over a medium heat. Add the meatballs in batches and fry for 4-5 minutes turning regularly, or until golden-brown all over and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "For the spicy tomato sauce, heat the oil in a large pan over a low to medium heat. Add the onion and garlic and fry for 6-8 minutes, or until softened but not coloured.", "Add the cumin seeds, black peppercorns, cloves, cinnamon stick, bay leaf and cardamom pods and continue to fry for 3-4 minutes, or until the spices are fragrant. ", "Add the garam masala, chilli powder and ground turmeric and fry for a further 2-3 minutes, or until fragrant. ", "Add the canned tomatoes and bring the mixture to a simmer. Simmer for 18-20 minutes, or until the mixture has thickened.", "Stir the meatballs into the spicy tomato sauce until coated and continue to simmer for 4-5 minutes, or until warmed through. ", "To serve, spoon the rice into the centre of four serving plates. Spoon the meatballs and spicy tomato sauce on top."]}, {"isVegetarian": false, "title": "Meatballs in tomato sauce", "url": "www_bbc_co_uk_food_recipes_meatballsintomatosau_81631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz good quality sausagemeat ", "1 tbsp olive oil", "1 tbsp olive oil", "½ tsp dried chilli flakes", "2 garlic cloves chopped", "50g/1¾oz baby vine tomatoes", "½ tsp balsamic vinegar", "1 tbsp fresh basil leaves, roughly chopped", "1 tbsp fresh sage leaves, roughly chopped ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the meatballs, using floured hands, shape the sausagemeat into walnut-sized balls.", "Heat the oil and in a frying pan over a medium heat. Add the meat balls and fry for 6-8 minutes, until browned all over and completely cooked through.", "To make the tomato sauce, heat the oil, chilli flakes and garlic in a frying pan for two minutes.", "Add the tomatoes and cook for 5-6 minutes, stirring to break down to a thick sauce.", "Add the balsamic vinegar and fresh herbs and stir.", "Add the meatballs, stir together and season, to taste, with salt and freshly ground black pepper.", "To serve, pour into a large warm bowl."]}, {"isVegetarian": false, "title": "Meatballs with tomato sauce", "url": "www_bbc_co_uk_food_recipes_meatballswithtomatos_74759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatballswithtomatos_74759_16x9.jpg", "ingredients": ["2 tbsp olive oil", "150g/5oz onion, finely chopped", "1 clove garlic, crushed", "900g/2lb freshly minced beef", "2 tbsp freshly chopped herbs, such as marjoram, or 1 tbsp rosemary", "1 free-range egg, beaten", "salt and freshly ground black pepper", "3 tbsp olive oil", "3 tbsp olive oil", "110g/4oz onion, sliced", "1 garlic clove, crushed", "150g/5¼oz fresh mozzarella, grated", "1 tsp sugar", "salt and freshly ground black pepper", "2 x 400g/14oz cans tomatoes"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of olive oil in a heavy stainless steel saucepan over a gentle heat and add the onion and garlic. Cover and sweat for four minutes, until soft and a little golden. Allow to cool.", "In a bowl, mix the minced beef with the cold sweated onion and garlic. Add the herbs and the beaten egg. Season the mixture with salt and pepper.", "Fry a tiny bit to check the seasoning and adjust if necessary. Divide the mixture into approximately 24 round balls. Cover the meatballs and refrigerate until required.", "Meanwhile, make the tomato sauce. Heat the oil in a stainless steel saucepan. ", "Add the sliced onion and the crushed garlic, toss until coated, cover, and sweat on a gentle heat until soft and pale golden.", "Slice the canned tomatoes and add, with all the juice, to the onion mixture.  ", "Season the contents with sugar, salt and freshly ground pepper.", "Cook the tomatoes uncovered for approximately 30 minutes or until the tomato softens (while this is cooking make the meatballs).", "Heat a frying pan and cook the meatballs for about 10 minutes in about three tablespoons of olive oil.", "When they are cooked, put them into an ovenproof dish with the tomato sauce and top with the grated mozzarella. Place under a preheated grill until the cheese has melted. ", "Serve with spaghetti."]}, {"isVegetarian": false, "title": "Meat feast calzone", "url": "www_bbc_co_uk_food_recipes_meatfeastcalzone_86391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain strong flour, plus extra for dusting", "90ml/3fl oz milk, warmed to body temperature", "50ml/2fl oz water, warmed to body temperature", "1 tsp dried yeast", "25ml/1fl oz olive oil", "pinch salt", "150g/5oz cherry tomatoes, halved", "200g/7oz buffalo mozzarella, roughly chopped", "200g/7oz assorted Italian cold meats (for example: salami, prosciutto, speck)", "1 tbsp capers, rinsed and drained", "30g/1oz grated parmesan"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, sift the flour into a bowl.", "Mix the milk, water and yeast together in a separate bowl.", "Add the yeast mixture to the flour and mix together to form a dough. Knead the dough for five minutes on a floured and even service.", "Add the olive oil and knead again to combine. Cover the bowl with cling film and leave somewhere warm for two hours.", "Preheat the oven to 230C/450F/Gas 8. Place a baking tray into the oven to preheat.", "Add the salt to the dough and knead again, then divide the dough into four equal portions and roll into balls.", "Place each ball onto a floured work surface and roll out into 20cm/8in circles.", "For the filling, place all of the filling ingredients into a bowl and mix together well.", "Place one quarter of the filling mixture onto one half of each dough circle, leaving a 2cm/1in gap around the edge.", "Brush the clean edges with water then fold the other sides over to cover the filling and pinch the edges to seal the four parcels.", "Place the calzones onto the preheated baking sheet and transfer to the oven to bake for eight minutes, or until the dough is cooked through and the filling hot."]}, {"isVegetarian": false, "title": "Meatloaf", "url": "www_bbc_co_uk_food_recipes_meatloaf_12471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatloaf_12471_16x9.jpg", "ingredients": ["750g/1lb 10oz lean minced beef", "175g/6oz pork sausage meat", "1 egg, beaten ", "1 medium onion, finely chopped", "1 clove garlic, crushed", "1 tablespoon sage leaves, chopped", "1 tablespoon mustard", "1 heaped tablespoon tomato purée", "110g/4oz fresh breadcrumbs", "½ tsp paprika", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas4.", "Place all the ingredients in a large mixing bowl and mix thoroughly - it s best to use your hands here.", "Transfer the mix to a 900g/2lb loaf tin and pat down until level. Cover the top of the mixture with an oiled piece of greaseproof paper.", "Bake in the oven for 1 hour 30 minutes or until the meatloaf is cooked through. (Remove the paper 15 minutes before the end of cooking)."]}, {"isVegetarian": false, "title": "Meatloaf and mashed potato", "url": "www_bbc_co_uk_food_recipes_meatloafandmashedpot_88604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg, beaten", "150ml/5fl oz milk", "300g/10½oz soft white bread, cut into cubes", "1 tbsp Dijon mustard", "pinch dried thyme", "pinch freshly grated nutmeg", "pinch dried basil", "handful fresh parsley, finely chopped", "1 onion, finely chopped", "100g/3½oz celery, finely chopped", "225g/8oz bacon lardons, fried until golden-brown all over", "salt and freshly ground black pepper", "700g/1lb 5oz minced beef", "200g/7oz minced pork", "1 tbsp Worcestershire sauce", "3 slices streaky bacon", "450g/1lb potatoes, peeled and boiled", "75g/2½oz butter", "salt and freshly ground black pepper", "gravy"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the meatloaf, place the egg and milk into a large bowl and mix together.", "Add the cubes of bread and leave to stand for 15 minutes.", "Mash the milk and egg-soaked bread with a fork.", "Add the mustard, thyme, nutmeg, basil, onion, celery and bacon lardons, season with salt and freshly ground black pepper and mix well.", "Add the beef and pork mince and the Worcestershire sauce. Mix well to combine thoroughly.", "Cover with cling film and place into the fridge to chill (overnight if possible, but for at least two hours).", "Preheat the oven to 180C/360F/Gas 4.", "Transfer the meatloaf mixture into a 30cm x 11cm/12in x 4in loaf tin.", "Top with the streaky bacon slices to cover.", "Transfer to the oven and bake for 55 minutes, or until completely cooked through.", "Remove from the oven and leave the meatloaf to stand for 5-6 minutes before slicing.", "For the mashed potato, mash the freshly cooked potatoes. Place into a pan over a low heat and mix in the butter. Season, to taste, with salt and freshly ground black pepper.", "To serve, slice the meat loaf. Place a slice onto each plate with a dollop of mashed potato alongside. Pour over some gravy and enjoy."]}, {"isVegetarian": false, "title": "Meatzza", "url": "www_bbc_co_uk_food_recipes_meatzza_60080", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meatzza_60080_16x9.jpg", "ingredients": ["500g/1lb 2oz minced beef (preferably organic)", "3 tbsp grated parmesan", "3 tbsp breadcrumbs or porridge oats (not instant)", "3 tbsp chopped fresh parsley", "2 free-range eggs, lightly beaten", "1 garlic clove, crushed", "Salt and freshly ground black pepper, to taste", "Butter, for greasing", "1x400g/14oz can chopped tomatoes, drained", "1 tsp garlic oil", "1 tsp oregano", "1 x 125g/4½oz ball mozzarella (not buffalo), halved, then sliced", "Few leaves fresh basil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "In a large bowl, using your hands, combine the mince, parmesan, breadcrumbs or oats, parsley, eggs, garlic, and add some salt and pepper. Do not overwork it, just lightly mix together or the meat will become compacted and dense.", "Butter a round baking tin of about 28cm/11in diameter and turn the meat into it, pressing the mixture lightly with your fingers to cover the bottom as if the seasoned minced meat were your pizza crust.", "Make sure you’ve drained as much runny liquid as possible out of your can of chopped tomatoes, then mix the tomato with the garlic oil, oregano and some salt and pepper and spread, using a rubber spatula, lightly on top of the meat base. Arrange the mozzarella slices on top, and then put in the oven for 20-25 minutes, by which time the meat should be cooked through and lightly set and the mozzarella melted.", "Remove from the oven and let it sit for five minutes, then adorn with some basil leaves and bring it to the table before cutting into wedges, like a pizza."]}, {"isVegetarian": false, "title": "Medallions of lamb with creamy leeks and port sauce", "url": "www_bbc_co_uk_food_recipes_medallionsoflambwith_84926", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5oz lamb fillet, cut into three medallions ", "50g/1¾oz breadcrumbs", "½ tsp Dijon mustard", "1 tbsp chopped fresh parsley", "1 tbsp olive oil", "½ onion, chopped", "½ leek, white part only, chopped", "1 garlic clove, chopped", "150ml/5fl oz double cream", "50g/2oz Stilton", "50ml/1¾fl oz white wine", "150ml/5fl oz beef stock", "2 tbsp port", "50g/2oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat the oil in an ovenproof frying pan. Add the lamb and cook for 1-2 minutes on each side.", "In a bowl mix together the breadcrumbs, Dijon mustard and parsley. Place the breadcrumb mixture onto each piece of lamb, then transfer to the oven to bake for 4-5 minutes, or until cooked through. Remove from the oven and leave to rest for 3-4 minutes.", "For the creamy leeks, heat the oil in a frying pan, Add the onion, leek and garlic and fry for four minutes.", "Add the cream, Stilton and white wine and cook for five minutes, or until the Stilton has melted and the cream sauce is thick.", "For the port sauce, heat the beef stock and port together in a small saucepan. Bring to the boil and cook for five minutes, then add the butter and stir in to melt.", "To serve, place the creamy leeks into the middle of a plate. Top with the lamb and drizzle the port sauce all over."]}, {"isVegetarian": false, "title": "Medieval chicken with whole garlic cloves", "url": "www_bbc_co_uk_food_recipes_medieval_chicken_with_04370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small packet saffron threads", "400ml/14fl oz white wine", "1 roasting chicken", "1 tsp freshly ground black pepper", "1 tsp ground cinnamon", "5 small garlic bulbs", "5cm/2in piece fresh ginger, peeled and finely chopped", "olive oil", "sea salt"], "serves": "Serves 4 - 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "Soak the saffron in a little of the wine. Rub the chicken all over with the pepper and cinnamon and place the chicken in an ovenproof dish.", "Cut the tops off the garlic bulbs so you can see the cloves and arrange them around the chicken with the ginger. Pour a little olive oil into the garlic bulbs and pour the saffron and remaining wine around the chicken. Season the chicken with salt and place in the oven.", "Roast for 20 minutes then lower the oven temperature to 170C/325F/Gas 3 and cook for another 40 minutes, or until the juices run clear and the chicken is cooked through. Baste the chicken and garlic regularly during cooking."]}, {"isVegetarian": true, "title": "Mediterranean bean stew with potato griddle cakes", "url": "www_bbc_co_uk_food_recipes_mediterranean_bean_stew_56916", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_bean_stew_56916_16x9.jpg", "ingredients": ["2 tbsp extra-virgin olive oil, plus extra to serve", "2 red onions cut into wedges", "2 courgettes, chopped into 1cm/½in batons", "150g/5½oz celeriac, cut into cubes", "1 garlic clove, finely chopped", "2 tbsp tomato purée", "1 tbsp smoked paprika", "1 x 440g/1lb tin chopped tomatoes", "200ml/7fl oz vegetable stock", "1 x 400g/14oz tin butter beans or mixed beans, drained", "handful fresh basil", "1 lemon, zest only", "100g/3½oz cooked broad beans", "250g/9oz mashed potatoes", "1 tsp baking powder", "100g/3½oz plain flour", "salt and freshly ground black pepper ", "1 tbsp fresh thyme", "2 tbsp vegetable oil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the stew, heat two tablespoons of the oil in a casserole pan and fry the onions, courgettes, celeriac and garlic for 4-5 minutes.", "Add the tomato purée and smoked paprika and cook for a further 4-5 minutes. Add the chopped tomatoes and stock, bring to boil, then reduce to a simmer for 20-25 minutes.", "Stir in the butter beans, basil and lemon zest and cook for a further 10 minutes, then stir in the broad beans. Finish the stew with a good glug of extra-virgin olive oil.", "Meanwhile, for the griddled potato cakes, mix the ingredients together in a bowl until well combined, then shape the potato mixture into six patties. ", "Heat the oil in a frying pan and fry the patties for 3-4 minutes on each side, or until crisp and golden-brown on both sides.", "To serve, ladle the stew into serving bowl and serve the potato cakes alongside."]}, {"isVegetarian": true, "title": "Mediterranean puff pastry tart", "url": "www_bbc_co_uk_food_recipes_mediterranean_puff_50963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_puff_50963_16x9.jpg", "ingredients": ["280g/10oz ready-rolled light puff pastry ", "200g/7oz baby courgettes, cut into 15mm/⅝in slices ", "1 large red pepper, cored, seeds removed, cut into 2cm/¾in chunks ", "1 large yellow pepper, cored, seeds removed, cut into 2cm/¾in chunks ", "1 red onion, cut into 2cm/¾in chunks ", "4 garlic cloves, sliced ", "2 sprigs rosemary, leaves picked and finely chopped ", "4 sprigs thyme, leaves picked ", "olive oil spray ", "1 tbsp semi-skimmed milk ", "100g/3½oz cherry tomatoes, halved ", "75g/2¾oz goats’ cheese, crumbled ", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Using a sharp knife, trim the sheet of puff pastry to 25 x 28cm/10 x 11in. Place it on a baking tray lined with baking parchment and score a border 2cm/¾in in from the edge all the way round. Prick the pastry within the margin, using a fork. Leave to rest in the fridge for about an hour. Meanwhile, preheat the oven to 240C/220C Fan/Gas 9.", "Put the courgettes, pepper and red onion into a large bowl. Add the garlic and herbs and season generously with salt and pepper. Line a large baking tray with baking parchment, lay the vegetables on it and spray 15–20 times with oil. ", "Brush the puff pastry all over with the milk and sprinkle with a little salt. Cook on the middle shelf of the oven, with the vegetable tray on the top shelf above, for 15 minutes, rotating both trays halfway through to ensure even colouring. Remove both trays from the oven and reduce the temperature to 160C/140C Fan/Gas 3. Set the vegetables aside. ", "Press the inside of the pastry down and return to the oven for 25 minutes to get a super-crisp base. ", "Take the tart case out of the oven and increase the temperature to 200C/180C Fan/Gas 6. Tip the roasted vegetables into the tart case, scatter over the cherry tomatoes and goats’ cheese and season with salt and pepper. ", "Bake for 20–25 minutes until the vegetables are cooked through and the cheese is softening and colouring at the edges. Cut the tart into quarters and serve."]}, {"isVegetarian": true, "title": "Mediterranean filo pastry pie", "url": "www_bbc_co_uk_food_recipes_mediterraneanfilopas_90227", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanfilopas_90227_16x9.jpg", "ingredients": ["225g/9oz packet ready-made filo pastry, fresh or frozen (you'll need about ten sheets measuring about 34cm x 30cm/13in x 12in or larger in size)", "85g/3oz butter, melted, for brushing", "2 tbsp olive oil", "1 large red onion, halved and sliced finely", "600g/1lb 5oz baby leaf spinach", "freshly grated nutmeg, to taste", "salt and freshly ground black pepper", "55g/2oz sultanas", "85g/3oz pine nuts, toasted", "225g/8oz feta", "3 medium free-range eggs", "rocket salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Remove the filo pastry sheets from their packaging and place them on a clean work surface. Keep them covered with a clean, damp cloth while you're working, to stop the pastry from drying out.", "For the filling, heat half of the olive oil in a frying pan. Add the sliced the onion and gently fry for 5-6 minutes over a medium heat, until lightly browned and softened.", "Heat the remaining olive oil in a large, heavy-bottomed pan. Add the spinach and cook, uncovered, for a few minutes, until it wilts. When the spinach is cooked, place it in a colander set over a bowl to drain and cool. Discard any liquid that comes out.", "Remove the fried onions from the frying pan and place on a plate to cool.", "With a sharp knife, trim the filo pastry sheets to a size just smaller than your baking sheet. Place a sheet of filo pastry on the baking sheet and brush with some of the melted butter, using a pastry brush. Repeat with four more filo sheets, brushing with butter as you go. This will be the base of the pie. Cover the remaining five filo pastry sheets with a clean cloth.", "When the spinach has cooled, place it into a large bowl. Grate in some fresh nutmeg and season with salt and freshly ground black pepper. Stir in the sultanas, the cooled onions and the pine nuts.", "Crumble the feta into the mixture and mix together well. Beat the eggs together in a clean bowl. Add some of the egg mixture to the spinach mixture. Add just enough so that the mixture is moist but not runny (you may not use all of the beaten egg).", "To assemble the pie, spoon the spinach and feta mixture onto the prepared filo pastry base. Leave an empty 'frame' around the edge of about 4cm/1½in on each side.", "Fold the four edges of the pastry in towards the middle to enclose the filling.", "To make the top of the pie, trim the remaining five sheets of filo pastry to the size of the base with its folded-in edges. Brush one of the filo sheets with some of the remaining melted butter and place on top of the spinach and cheese mixture. Repeat with the remaining four sheets, brushing with melted butter as you go.", "Brush the top layer of filo pastry with the last of the melted butter. Lightly score the top of the pie with a sharp knife. Bake it in the preheated oven for 45-50 minutes, or until the filo pastry crust is a deep golden-brown.", "Serve slices of the pie with a rocket salad."]}, {"isVegetarian": false, "title": "Mediterranean chicken roulade with mushroom orzo and rocket salad", "url": "www_bbc_co_uk_food_recipes_mediterraneanchicken_89440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless free-range chicken breasts, skin removed", "4 thin slices pancetta", "12 fresh basil leaves", "110g/4oz Dolcelatte cheese, cut into 12 strips", "4 baby plum tomatoes, halved", "2 tbsp olive oil", "10g/½oz dried porcini mushrooms, soaked in boiling water", "2 tbsp olive oil", "1 small onion, finely chopped", "1 garlic clove, crushed", "110g/4oz chestnut mushrooms, finely chopped", "250g/9oz orzo pasta", "500ml/18fl oz chicken stock", "1 tbsp chopped fresh lemon thyme", "1 tbsp lemon juice", "50g/2oz parmesan cheese, finely grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "1 bag rocket leaves, washed", "4 tbsp parmesan shavings", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the Mediterranean chicken roulade, slice part of the way through each chicken breast, then open out each breast. Sandwich each one between two sheets of cling film and beat with a rolling pin or similar until they are 5mm thick.", "Place a slice of pancetta onto a clean work surface and lay one of the chicken breasts on top of it.", "Place three of the basil leaves in the centre of the chicken, then top with three slices of the Dolcelatte.", "Lay one plum tomato half in each of the two gaps between the cheese. Season with salt and freshly ground black pepper. ", "Roll the chicken roulade from one end to form a cylinder, securing with a cocktail stick if necessary.", "Repeat the process for each of the three remaining chicken breasts.", "Heat the olive oil in an ovenproof frying pan until hot, then add the chicken roulades and cook for one minute on each side, or until golden-brown.", "Transfer to the oven for 15-20 minutes until the cheese is bubbling and the chicken is cooked through. (The chicken is cooked through when the juices run clear when pierced with a skewer.)", "For the mushroom orzo, drain the mushrooms and chop finely.", "Heat the olive oil in a frying pan until hot, then add the onion and cook for one minute, until softened.", "Add the garlic, the chestnut mushrooms and the porcini mushrooms and cook for a further minute. ", "Add the orzo pasta and mix until well combined. Add the chicken stock, bring to a simmer, cover with a lid and cook for 5-8 minutes until the orzo pasta has absorbed the liquid and is tender.", "Remove the lid, add the lemon thyme, lemon juice and parmesan and stir well. Season to taste with salt and freshly ground black pepper.", "For the rocket salad, mix the olive oil and balsamic vinegar in a bowl. Place the rocket leaves into a serving bowl and pour the dressing over them. Sprinkle with the parmesan shavings and season to taste with salt and freshly ground black pepper. Toss the rocket salad until combined.", "To serve, pile some salad onto each serving plate and spoon some mushroom orzo alongside. Cut the chicken roulades into thick slices and arrange them on top of the orzo."]}, {"isVegetarian": false, "title": "Mediterranean lamb chops", "url": "www_bbc_co_uk_food_recipes_mediterraneanlambcho_14373", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanlambcho_14373_16x9.jpg", "ingredients": ["4 lean lamb chops or cutlets", "1 tbsp, fresh mint", "1 tbsp, fresh rosemary", "2 cloves garlic", "2 tbsp olive oil", "1 small aubergine, sliced", "1 courgette, sliced", "1 red or yellow pepper, cut in large chunks", "50g/2oz feta cheese, crumbled", "250g/9oz cherry tomatoes"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 5.", "Using a pestle and mortar or wooden spoon and bowl, pound together the fresh mint, fresh rosemary and the garlic, then mix with 1 tbsp olive oil. Smear over four lean lamb chops or cutlets.", "Place the aubergine, courgette and red or yellow pepper on to a baking sheet. Drizzle with 1 tbsp olive oil and place the lamb chops on top. Bake in the oven for 20-25 minutes.", "Top the chops with feta cheese and add the cherry tomatoes to the pan. Cook for a further 10 minutes until the cheese just starts to brown.", "Serve the chops with the roasted vegetables, toasted ciabatta bread and mixed leaf salad."]}, {"isVegetarian": false, "title": "Mediterranean pork meatballs", "url": "www_bbc_co_uk_food_recipes_mediterraneanporkmea_85971", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz olive oil", "1 onion, chopped", "1 celery stalk, finely chopped", "2 garlic cloves, chopped", "2 tbsp tomato purée", "2 x 400g/14fl oz cans chopped tomatoes", "1 cinnamon stick", "100ml/3½fl oz chicken stock", "100ml/3½fl oz red wine", "salt and freshly ground pepper", "1 tbsp olive oil", "1 onion, chopped", "5 garlic cloves, chopped", "450g/1lb minced pork", "1 tbsp chopped fresh basil", "1 tsp ground cinnamon", "salt and freshly ground pepper", "vegetable oil, for brushing", "spaghetti, cooked according to packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the oil in a large pan over a low heat. Add the onion, celery and garlic and fry until softened, but not coloured. ", "Add the tomato purée and cook for a few minutes, then add the canned tomatoes, cinnamon, stock and wine.", "Season, to taste, with salt and freshly ground black pepper and bring to the boil, then turn the heat down very low.", "Half-cover the pan with a lid and leave the sauce to simmer for one hour, stirring occasionally.", "If you want a smooth sauce, transfer to a food processor and blend the sauce, then pass it through a fine sieve before using. Otherwise use as it is.", "Meanwhile, for the meatballs, heat the oil in a frying pan over a medium heat.", "Add the onion and the garlic and fry until softened. Remove from the heat and allow to cool slightly.", "Preheat the grill to its highest setting.", "Place the pork mince, basil and cinnamon into a bowl and add the cooked onion and garlic. Season generously with salt and freshly ground black pepper and mix well.", "Roll small amounts of the mince mixture into balls. This quantity of mixture should make 12-16 meatballs, depending on size.", "Brush the meatballs with a little oil and place onto a baking tray.", "Place under the grill to cook for 6-8 minutes, turning occasionally and brushing them with a little oil as they brown.", "To serve, stir the cooked spaghetti through the sauce and place onto plates with three or four meatballs placed on top."]}, {"isVegetarian": true, "title": "Mediterranean pasta", "url": "www_bbc_co_uk_food_recipes_mediterraneanpasta_88410", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 small onion, finely chopped", "2 small cloves garlic, finely chopped", "2 x 400g/14oz cans chopped tomatoes", "1 tbsp sun-dried tomato paste", "1 bay leaf", "1 tsp dried thyme", "1 tsp dried basil", "1 tsp dried oregano", "1 tsp dried parsley", "½ tsp salt, or to taste", "½ tsp brown sugar", "freshly ground black pepper", "1 aubergine", "2 courgettes", "2 red peppers, de-seeded", "2 garlic gloves, peeled", "2-3 tbsp olive oil", "12 small vine-ripened tomatoes", "500g/1 lb 1oz pasta shapes, such as gigli, lumache or conchiglie", "100g/3½oz parmesan cheese (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the oil in a pan. Add the onions and fry until soft but not browned. Add the garlic and fry for one minute.", "Add the remaining sauce ingredients and bring to the boil. Reduce the heat and simmer for about an hour. Check for seasoning and add more salt and freshly ground black pepper, if needed.", "For the vegetables, preheat the oven to 180C/355F/Gas 4.", "Chop the aubergine, courgettes and red peppers into 2.5cm/1in pieces and place in a roasting tin with the whole garlic cloves. Drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper. Mix the vegetables to coat in the olive oil. Roast in the oven, stirring occasionally, for 45 minutes, or until soft turning golden. Add the tomatoes to the roasting tin for the last 20 minutes of cooking time.", "When ready to serve, cook the pasta according to the packet instructions. Drain the pasta well and stir through the sauce.", "Divide evenly among four serving plates and top with the roasted vegetables. Grate over the parmesan cheese and serve with crusty bread or bruschetta on the side."]}, {"isVegetarian": false, "title": "Mediterranean-style lamb chops", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylela_83720", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanstylela_83720_16x9.jpg", "ingredients": ["2 tbsp chopped fresh mint ", "1 tsp finely chopped fresh rosemary ", "3 garlic cloves", "2 tbsp olive oil", "4 lean lamb chops or cutlets", "1 aubergine, sliced", "4 courgettes, sliced", "2 red peppers, cut into large chunks", "2 yellow peppers, cut into large chunks", "85g/3oz feta cheese, crumbled", "250g/9oz cherry tomatoes", "mixed leaf salad"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Using a pestle and mortar or food processor, blend together the mint, rosemary and the garlic, then add one tablespoon of the olive oil. Smear the herb mixture over the lamb chops.", "Place the aubergine, courgette and peppers on a baking sheet. Drizzle with the remaining olive oil and place the lamb chops on top. Place into the oven to roast for 20-25 minutes.", "Remove from the oven and top the chops with the feta and add the cherry tomatoes to the tray. Return to the oven for a further 10 minutes until the cheese just starts to brown and the lamb chops are just cooked through.", "Serve the chops with the roasted vegetables and mixed leaf salad."]}, {"isVegetarian": true, "title": "Mediterranean-style pasta with sun-blushed tomatoes, artichokes and olives", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylepa_88356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "¼ red onion, chopped", "4 sun-blushed tomatoes, chopped", "100g/3½oz roasted artichokes (from a jar), drained and chopped", "2 tbsp black olives, pits removed", "small handful fresh sage leaves, chopped", "salt and freshly ground black pepper ", "125g/4½oz fresh tagliatelle", "grated parmesan (or a similar vegetarian hard cheese), to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan, add the onion and fry gently for four minutes, or until softened but not coloured. Add the sun-blushed tomatoes, roasted artichokes and black olives and fry for 1-2 minutes. Stir in the sage leaves and season, to taste, with salt and freshly ground black pepper.", "Cook the tagliatelle according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Return to the pan, add the sauce and stir to coat.", "Spoon into a bowl and serve with grated parmesan on top."]}, {"isVegetarian": true, "title": "Mediterranean vegetable stack with chargrilled polenta and sauce vierge", "url": "www_bbc_co_uk_food_recipes_mediterraneanvegetab_86234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ yellow courgette, sliced", "½ aubergine, sliced", "salt and freshly ground black pepper", "125g/4½oz quick-cook polenta", "250ml/9fl oz hot chicken stock (vegetarians can substitute vegetable stock)", "pinch dried chilli flakes", "2 tsp chopped fresh rosemary ", "salt and freshly ground black pepper", "olive oil, for drizzling", "2 tbsp olive oil", "1 tomato, chopped", "small handful fresh basil, chopped", "salt and freshly ground black pepper", "squeeze lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the vegetable stack, rub the courgette and aubergine slices with the olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot and griddle the courgette and aubergine slices for 2-3 minutes on each side, or until softened and lightly charred. Set aside and keep warm.", "For the chargrilled polenta, place the polenta and stock into a small saucepan. Add the chilli flakes, rosemary and seasoning and bring to the boil. Reduce the heat and simmer for 2-3 minutes, or until all the stock has been absorbed and the polenta is no longer grainy.", "Lightly oil a small roasting tin and pour in the polenta. Allow to cool, then place into the fridge to chill and set. When set, cut the polenta into three equally sized squares.", "Rub the squares with olive oil, heat a griddle pan and griddle the polenta squares for 1-2 minutes on each side, until lightly charred.", "For the sauce vierge, place all the sauce vierge ingredients into a bowl and mix well.", "To serve, place one chargrilled polenta square onto a serving plate and top with the grilled courgette slices. Place another layer of polenta on top, then the aubergine slices, followed by the final square of polenta. Pour the sauce vierge around the plate."]}, {"isVegetarian": true, "title": "Mediterranean-style salad with tapenade", "url": "www_bbc_co_uk_food_recipes_mediterraneanstylesa_85106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, chopped", "50g/1¾oz black olives, stones removed", "2 tbsp olive oil", "2 tomatoes, chopped", "1 handful fresh parsley", "1 handful fresh basil, torn", "1 tsp balsamic vinegar ", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the tapenade, place the garlic, olives and oil into a mini food processor and blend until smooth.", "For the Mediterranean-style salad, place all of the salad ingredients into a bowl and mix well.", "To serve, place the salad onto a plate with the tapenade drizzled over."]}, {"isVegetarian": true, "title": "Medium-cut Seville orange marmalade", "url": "www_bbc_co_uk_food_recipes_medium-cut_seville_70291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medium-cut_seville_70291_16x9.jpg", "ingredients": ["500g/1lb 2 oz Seville oranges", "50ml/2 fl oz lemon juice", "1kg/2lb 4 oz white sugar: regular, not with added pectin", "soft dark brown sugar, optional"], "serves": "Makes 3-4 450g/1lb jars", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Weigh the oranges and make a note of the weight, as this will tell you how much of the other ingredients you’ll need, to ensure the marmalade sets well. My basic ratio is: both the sugar and the strained liquid from the sliced and simmered oranges should roughly equal twice the weight of the uncooked whole oranges. So if you start with 500g/1lb 2 oz whole oranges, after cooking you want to be left with a litre/1¾ pint of liquid once the peels have been strained out, and you need 1kg/2lb 4 oz of sugar. ", "Cut the oranges in half and squeeze out the juice, as this makes chopping the peel less messy. Remove any pips from the juice, spoon any remaining pips out of the peel, place them in a tea cup and cover with water. Then chop the peel into shreds about 0.25cm/⅛in across and place these in a bowl with the juice and cover with water. Leave both overnight, as this will help the marmalade set well.", "The next day, place the peel and water in a saucepan. Sieve the pips, place their soaking water (which will have jellied slightly) into the saucepan, then tie the pips in muslin and drop this into the pot. Bring to the boil then simmer for 2-3 hours, topping up with water so that the fruit stays well covered, until the peel is soft when squished between your fingers. Alternatively, cook in a pressure cooker for about 30 minutes.", "Strain the juice from the peel and measure it. Whatever the original weight of fruit was at the beginning, you want about double that in cooking liquid. So if you started with 500g/1lb 2 oz fruit, then try and have roughly a litre/1¾ pint (in other words 1000ml or 1000g) of cooking liquid left. If you have more, boil it down in a saucepan to intensify it. If you have less, top it up with water to dilute it.", "Then add the sugar (double the weight of the oranges), plus 1-2 tbsp brown sugar if you like to make the colour darker. Add the strained peel, plus 50ml/2 fl oz of lemon juice for every 500g/1lb 2 oz uncooked whole oranges used. Bring to the boil, skim off any white froth and pips that rise to the surface, and then boil until the temperature reaches 105C/220F.", "Meanwhile sterilise enough jars in the oven and have the lids washed and ready. When the marmalade reaches 105C/220F, turn the heat off and leave for 10 minutes. Ladle the marmalade into a jug then pour this carefully into the jars, leaving just a bare 0.5cm/¼in gap at the top. Screw the lid on tightly and leave undisturbed until completely cold. "]}, {"isVegetarian": true, "title": "Medjool date and walnut scones", "url": "www_bbc_co_uk_food_recipes_medjool_date_and_walnut_11732", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz self-raising flour sifted, plus extra for flouring", "100g/3½oz butter, at room temperature, chopped into little squares, plus extra for greasing", "40g/1½oz caster sugar", "pinch flaked sea salt\t", "300ml/10fl oz full-fat milk", "1 tbsp crème fraîche", "Medjool dates, chopped into chunks (to taste)", "walnuts, toasted and chopped (to taste)", "strawberry jam ", "clotted cream"], "serves": "Makes 6 large scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 6 and grease and flour a baking tray. ", "Put the flour into a large bowl, add the butter and rub it into the flour to make breadcrumbs. Add the sugar and salt and mix together. ", "Pour in the milk gradually and mix in, reserving a few tablespoons for a glaze. Mix in the crème fraîche until well-combined. ", "Add dates and walnuts, to taste, ensuring that they’re evenly dispersed.", "Lightly flour a clean work surface and roll out the scone dough to a thickness of 2.5cm/1in and use a round pastry cutter to cut out six scones. Re-roll any off-cuts to make more scones, but be careful not to overwork the dough.", "Place the scones onto the prepared baking tray and bake for 15 -20 minutes, or until risen and golden-brown. ", "Serve with good-quality strawberry jam and clotted cream."]}, {"isVegetarian": true, "title": "Medley of fruit with citrus-spiced biscuits and Champagne", "url": "www_bbc_co_uk_food_recipes_medley_of_fruit_with_82189", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, softened", "120g/4½oz golden caster sugar", "2 free-range egg yolks", "½ large orange, finely grated zest only", "½ unwaxed lemon, finely grated zest only", "250g/9oz plain flour, plus extra for dusting", "½ tsp mixed spice", "¼ tsp ground ginger", "¼ tsp ground cinnamon", "¼ orange, finely grated zest only", "¼ lime, finely grated zest only", "¼ unwaxed lemon, finely grated zest only", "50g/1¾oz caster sugar", "150g/5½oz raspberries", "100g/3½oz caster sugar", "1 lemon, juice only ", "1 clementine, segmented ", "½ pineapple, balled using a Parisian scoop ", "50g/1¾oz blackberries, halved ", "50g/1¾oz passion fruit seeds", "50g/1¾oz black seedless grapes, halved", "50g/1¾oz pomegranate seeds", "1 pear, peeled and balled using a Parisian scoop ", "Champagne ", "small fresh mint leaves, to decorate"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the biscuits, preheat oven to 200C/180C Fan/Gas 6. ", "Beat the butter and sugar in a bowl until pale and creamy. Gradually beat in the egg yolks until fully incorporated, then beat in the rest of the ingredients.", "Roll out the dough on a lightly floured surface until about 5mm/¼in thick. Cut out the biscuits using a 6cm/2in cutter and arrange them on a non-stick baking sheet, re-rolling and cutting any trimmings. Transfer the biscuits to the fridge until firm.", "To make the citrus sugar, mix the zests with the sugar in a small bowl until combined. ", "Bake the biscuits for 8–10 minutes, or until they are starting to turn a pale golden colour. Sprinkle the hot biscuits with the citrus sugar and leave to cool on a wire rack.", "To make the fruit medley, blend the raspberries with the sugar and lemon juice in a food processor, then pass through a sieve. ", "Divide the purée between four serving glasses, top with a mixture of the fruits and decorate with mint leaves. ", "In front of the guests, crack open the Champagne and pour over the top of the dish. Serve with the citrus-spiced biscuits. "]}, {"isVegetarian": false, "title": "Seafood with herbs and garlic", "url": "www_bbc_co_uk_food_recipes_medleyofseafoodwithh_72992", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/19½oz mixed seafood (such as cod, salmon and prawns) ", "40g/1½oz butter", "½ tbsp chopped garlic", "4 tbsp spring onions, finely chopped", "120ml/4½fl oz dry white wine", "1 tsp lemon zest", "½ tsp salt", "1 x 400g/14¼ oz can chopped tomatoes, with the juices", "few drops Tabasco sauce (optional) or chilli sauce", "1 tbsp chopped parsley", "1 tbsp chopped chives", "1 tbsp chopped dill", "a few sprigs of various herbs, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the fish and cut into 5cm (2in) pieces. Wash the prawns and remove shells.", "Melt 20g (¾oz) of butter in a large frying pan. Add the garlic and fry until just starting to colour. ", "Add the seafood, spring onions, white wine, and lemon zest.", "Cover and simmer for two minutes. ", "Remove the lid and add the tomatoes, Tabasco sauce and herbs.", "Simmer for just two minutes more.", "Turn off the heat and stir in the remaining butter.", "Serve immediately in warm bowls, garnished with a few sprigs of herbs."]}, {"isVegetarian": true, "title": "Jam-filled butter biscuits (sables)", "url": "www_bbc_co_uk_food_recipes_medley_of_mini_sables_84193", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medley_of_mini_sables_84193_16x9.jpg", "ingredients": ["250g/9oz plain flour", "200g/7oz butter, cut into small cubes", "100g/3½oz icing sugar", "pinch of salt", "2 free-range egg yolks", "4 tbsp raspberry jam", "4 tbsp apricot jam"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Place the flour, butter, icing sugar and salt into a bowl. Using your fingertips, rub the ingredients together until the mixture resembles breadcrumbs. ", "Add the egg yolks and mix until a dough forms. Turn out onto a lightly floured work surface and roll out to a thickness of about 0.5cm/¼in. Cut out shapes using a 4cm/1½in cutter. ", "Divide the sables in half. Using a 2cm/1in fluted cutter, make a hole in the middle of half of the sable biscuits and discard the dough. Place all the sables on a baking tray.", "Bake the sables for 10-12 minutes, or until light golden-brown and crisp. Remove and transfer to a wire rack to cool. ", "Using a teaspoon, place a small dollop of raspberry jam on a whole sable. Place a sable (with a hole) over the whole sable biscuit. Repeat until half the sables are done with raspberry jam, then repeat the process, using apricot jam, for the remaining sables. "]}, {"isVegetarian": false, "title": "Meen molee (Fish curry cooked in coconut)", "url": "www_bbc_co_uk_food_recipes_meenmoleefishcurryco_77185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 garlic cloves", "3 green finger chillies", "5cm/2in piece root ginger, peeled", "3 tbsp groundnut oil", "1 small onion, finely sliced", "5-6 curry leaves ", "¼ tsp ground turmeric ", "¼ tsp salt ", "200ml/7fl oz coconut milk ", "155ml/6fl oz boiling water", "500g/1lb 2oz haddock fillets, cut into 4cm/2in-wide pieces", "2 medium tomatoes, coarsely chopped", "basmati rice"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the garlic, chillies, and ginger together in a food processor and process until smooth.", "Heat the oil in a frying pan or wok and fry the onion with the curry leaves for four minutes over a medium heat.", "Stir in the garlic, chilli and ginger mixture with the turmeric and salt.  Fry for two minutes, then add 100ml/3½fl oz coconut milk with 155ml/6fl oz boiling water.", "Simmer for two minutes and then add the fish pieces and gently simmer for 5-6 minutes.  ", "Add half of the tomato and the remaining coconut milk and simmer for 3-4 minutes.", "Garnish with the remaining chopped tomato.", "Serve with basmati rice."]}, {"isVegetarian": false, "title": "Megrim sole with shrimp butter, sea kale and lemon flowers", "url": "www_bbc_co_uk_food_recipes_megrim_sole_with_shrimp_07093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 450g/16oz megrim sole or Cornish sole", "110g/4oz plain flour", "salt and freshly ground black pepper", "50ml/2fl oz vegetable oil", "knob of butter", "150g/5oz sea kale, cut into 5cm/2in batons", "2 lemons", "125g/4½oz butter ", "60g/2oz shallot, finely chopped", "1 tsp mace", "½ tsp cayenne pepper", "2 tsp Gentlemen’s relish", "90g/3½oz brown shrimps ", "salt and freshly ground black pepper", "squeeze lemon juice", "1 punnet pea shoots, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sole, preheat the oven to 230C/450F/Gas 8.", "Ask your fishmonger to remove the dark skin from the megrim. You can do it yourself by cutting into the tail of the fish at an angle and gently scraping back the skin. With a dry kitchen towel pull the skin from the tail towards the head, it should all pull away.", "Cut the head off and using sharp scissors, cut around the edge of the fish and remove the fins. Wash the fish and pat dry.", "Sprinkle the flour onto a plate and season with salt and freshly ground black pepper.", "Dust the fish in the flour on each side.", "Heat a non-stick ovenproof frying pan on a high heat and pour in the vegetable oil.", "Place the fish in the pan, white skin-side down, and fry for 2-3 minutes, or until pale golden-brown. Turn the fish over using a palette knife.", "Add a knob of butter and place in the oven to cook for 6-7 minutes.", "Meanwhile, for the shrimp butter, cook the sea kale in a pan of salted boiling water for 2-3 minutes, or until tender. Drain and refresh in iced water, then drain once more and pat dry. ", "Peel the lemon, remove the pith by gently scraping with a knife (try not to pierce the flesh of the lemon) and slice into rounds (these are your lemon flowers.)", "Heat a frying pan until hot, add the butter and shallot and fry for 2-3 minutes. Add the mace, cayenne pepper and Gentlemen’s relish and stir until well combined. Add the shrimps and sea kale, remove the pan from the heat and keep warm.", "Season with salt and freshly ground black pepper and a squeeze of lemon juice.", "To serve, place the sole in the centre of a large serving plate. Spoon over the shrimp mixture, criss-crossing the batons of sea kale over the top of the fish. Squeeze in two slices of lemon, then sprinkle with pea shoots."]}, {"isVegetarian": true, "title": "Melanzane pasta", "url": "www_bbc_co_uk_food_recipes_melanzane_pasta_59215", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/melanzane_pasta_59215_16x9.jpg", "ingredients": ["2 large or 3 small aubergines, sliced into 5mm/¼in rounds", "4 tbsp olive oil", "6–7 sheets dried lasagne ", "salt and freshly ground black pepper", "50g/1¾oz butter, plus extra for greasing", "50g/1¾oz plain flour", " 568ml/1 pint milk, warmed", "1 tsp Dijon mustard", "100g/3½oz Parmesan (or a similar vegetarian alternative), grated", "2 garlic cloves, crushed", "1 x 400g tin chopped tomatoes", "500ml/18fl oz passata", "1 bunch basil, chopped", "2 tsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a 2.5 litre/4½ pint ovenproof dish with butter and line two baking trays with non-stick baking paper. ", "Arrange the aubergine slices in a single layer on the prepared trays. Drizzle over the oil and season with salt and pepper. Roast for 20–25 minutes turning the slices over halfway through the cooking time. Set aside. ", "Lay the pasta sheets in a dish and cover with hot water for 10 minutes to soften. ", "To make the béchamel sauce, heat the butter in a saucepan. Once melted, sprinkle in the flour and whisk for a few minutes over a high heat to form a roux. Pour the warmed milk into the roux and whisk. Bring to the boil, whisking for a few minutes until smooth. Add the mustard and two-thirds of the Parmesan. Season with salt and pepper and stir. Set aside.", "To make the tomato sauce, put all the ingredients in a mixing bowl. Season with salt and pepper. ", "To assemble, spoon a third of the tomato sauce in the base of the prepared dish, top with a third of the béchamel. Arrange a third of the aubergines on top and 3–3½ sheets of lasagne (you may need to break the lasagne into pieces to make it fit in an even layer). Repeat so you have three layers of sauce and two layers of pasta, sprinkle with the remaining Parmesan.", "Leave to stand for 1 hour before cooking, or overnight.", "Bake for 35–45 minutes until golden-brown and bubbling. Stand for 5 minutes before serving. Serve hot with garlic bread."]}, {"isVegetarian": false, "title": "Melon and Parma ham salad", "url": "www_bbc_co_uk_food_recipes_melonandparmahamsala_78028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ melon, de-seeded and chopped into small chunks", "50g/1¾oz rocket leaves", "2 endive leaves, sliced into thin julienne strips", "1 tbsp olive oil", "3 sun-dried tomatoes", "2 slices Parma ham", "4 endive leaves, sliced in half length ways", "1 tsp balsamic vinegar", "salt and freshly ground black pepper, to taste"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl toss the melon, rocket and endive julienne in the olive oil.", "Transfer to a plate and add the sun-dried tomatoes and Parma ham.", "Place the eight halves of endive leaves around the salad, pointing outwards.", "Drizzle with the balsamic vinegar and season to taste."]}, {"isVegetarian": true, "title": "Melon cocktail", "url": "www_bbc_co_uk_food_recipes_meloncocktail_83623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lime, juice only", "1 tbsp runny honey", "1 tbsp fresh mint leaves", "½ cantalope melon, small rounds cut out with a melon baller, the skin left as a complete 'bowl'", "50g/1¾oz whole walnuts", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the lime juice, honey and mint into a small food processor and blend until smooth.", "Pour the mixture into a bowl, add the melon balls and walnuts and mix well to coat.", "To serve, pour the mixture into the empty melon shell 'bowl'."]}]