[{"ingredients": ["sal", "900 g / 2 libras 4 oz de coles de Bruselas, recortadas y hojas sueltas quitadas", "2 cucharaditas de aceite de oliva", "225g / 8oz de panceta, cortada en cubos"], "method": ["Ponga a hervir una olla de agua con sal y agregue los brotes. Cocine por 8-10 minutos, o hasta que estén tiernos, luego drene en un colador.", "Calentar una sartén a fuego alto hasta que esté caliente. Agregue el aceite de oliva y los cubos de panceta y fríe durante 5-7 minutos, o hasta que la panceta esté crujiente y dorada.", "Agregue los brotes drenados y mezcle para calentar. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brussels_sprouts_with_12803", "title": "Coles de Bruselas con panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brussels_sprouts_with_12803_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de tocino rayado ahumado o no ahumado, más o menos picadas", "1 chalota de plátano, en rodajas finas", "2 dientes de ajo, aplastados", "250 g / 9 oz de coles de Bruselas, finamente trituradas", "30g / 1oz de almendras tostadas, aproximadamente picadas"], "method": ["Calentar una sartén a fuego medio y freír el tocino hasta que esté crujiente. Transfiera a un plato forrado con papel de cocina para escurrir.", "Agregue la chalota y el ajo a la sartén y cocine durante 2 minutos, hasta que estén suaves. Agregue los brotes y cocine por 3-4 minutos, hasta que se marchiten, revolviendo ocasionalmente.", "Regrese el tocino a la sartén, agregue las almendras y cocínelas durante 2 minutos. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_brussels_sprouts_with_57377", "title": "Coles de Bruselas con almendras tostadas y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "Harina normal de 55g / 2oz", "200ml / 7fl de leche en oz", "100ml / 3½ fl oz crema doble", "Queso cheddar 85 g / 3 oz, rallado", "½ cucharadita de mostaza Dijon", "sal y pimienta negra recién molida", "100 g / 3½ oz de coles de Bruselas, en cuartos", "pequeño puñado de cebollín fresco picado, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derrita la mantequilla en una cacerola, agregue la harina y revuelva hasta que se forme una pasta espesa. Retire del fuego y bata gradualmente en la leche y la crema. Regrese al fuego y revuelva hasta que la mezcla se espese.", "Agregue el queso rallado, la mostaza, la sal y la pimienta negra recién molida y cocine a fuego lento durante cinco minutos a fuego lento.", "Coloque las coles de Bruselas en cuartos en una sartén de agua hirviendo con sal y hierva durante 3-4 minutos, luego escurra.", "Coloque las coles de Bruselas cocidas en la base de un pequeño plato gratinado y vierta sobre la salsa de queso. Coloque en el horno y hornee por 8-10 minutos, o hasta que estén doradas en la parte superior. Esparcir con cebolletas frescas picadas y servir."], "url": "www_bbc_co_uk_food_recipes_brusselssproutgratin_88284", "title": "Bruselas brotar gratinado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3-4 cucharadas de grasa de pavo de la salsa, o 15 g / ½ onza de mantequilla", "1 cebolla, finamente picada", "400 g / 14oz de coles de Bruselas (sobrantes o recién cocinadas), ralladas", "600g / 1lb 5oz de papas asadas sobrantes, chirivías, zanahorias o cualquier otra verdura de Navidad", "sal y pimienta negra recién molida"], "method": ["Calienta la mitad de la grasa en una sartén antiadherente. Agregue la cebolla y fría a fuego medio hasta que esté transparente. Agregue los brotes y cocine hasta que todo comience a caramelizar alrededor de los bordes. Transfiera a un tazón.", "Amasar los vegetales de raíz sobrantes juntos, luego agregarlos a la cebolla y los brotes. Sazonar bien", "Calienta la grasa restante en la sartén. Vuelva a colocar la mezcla, presionando hacia abajo. Cocine hasta que la base tenga una costra realmente buena. Cuidadosamente recorra los bordes con una espátula para asegurarse de que se desprenderá fácilmente (no lo hará si la costra no se ha cocido durante el tiempo suficiente), luego colóquela en un plato, antes de deslizarla hacia atrás, con el lado cocido hacia arriba, en el pan.", "Cocine hasta que se forme otra corteza, luego sirva. (Alternativamente, puede esperar a que se forme una costra, descomponerlo y aplanarlo nuevamente, repitiendo un par de veces hasta que la burbuja y el chirrido sean una mezcla de puré y pepitas de costra crujientes y bien doradas)."], "url": "www_bbc_co_uk_food_recipes_bubble_and_squeak_64067", "title": "Burbujas y chillido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 chalotes, pelados", "150g / 5oz de mantequilla", "3 cucharadas de azúcar en polvo", "200ml / 7fl oz de vino tinto", "125ml / 4fl oz puerto", "crema de cassis", "600ml / 1 pinta de existencias de carne de vacuno", "1 hoja de laurel fresca", "1 limón, ralladura solamente", "1 cucharadita de tomillo seco", "3 cucharadas de aceite de oliva", "2 puerros, lavados, rebanados", "Papas de 1.25kg / 2lb 12oz, peladas, hervidas, trituradas y dejadas enfriar", "750g / 1lb col de primavera de 10 oz, finamente rallada, blanqueada (o repollo cocido o coles de Bruselas sobrantes)", "copos de sal marina y pimienta negra recién molida"], "method": ["Para los chalotes confitados, cocine a fuego lento los chalotes suavemente durante 4-5 minutos en una olla de agua hirviendo para ablandar. Desagüe.", "Calentar la mantequilla en una sartén no reactiva, agregar las chalotas y freír suavemente hasta que estén doradas, alrededor de 3-4 minutos.", "Agregue el azúcar y revuelva hasta que se derrita y comience a caramelizar y cubrir las chalotas.", "Mezcle el vino, el puerto, la casis y el caldo en un bol. Agregue un cuarto de la mezcla de vino a la sartén con las chalotas y deje hervir, luego agregue la hoja de laurel y la ralladura de limón. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que el líquido se reduzca a un glaseado.", "Agregue un poco más de la mezcla de vino a la sartén y cocine a fuego lento de nuevo hasta que el líquido se haya reducido a un glaseado. Agregue el líquido restante poco a poco, reduciéndolo cada vez, hasta que los chalotes estén cubiertos en el glaseado. Dejar de lado hasta que sea necesario.", "Para la burbuja y el chirrido, caliente la mitad del aceite de oliva en una sartén y cocine los puerros durante 3-4 minutos, o hasta que estén suaves pero no coloreados.", "Mezcle los puerros, el puré de patatas y el repollo en un bol. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Calentar el aceite de oliva restante en la sartén. Coloque cuatro anillos de 7,5 cm / 3 in en la sartén y pellizque la burbuja y cháquelos en los anillos, empacando suavemente. Cocine hasta que esté dorado en la parte inferior, gire los anillos con cuidado y cocine en el otro lado. Retire de la sartén y mantenga caliente hasta que esté listo para servir, quitando cuidadosamente los anillos de los chefs antes de servir."], "url": "www_bbc_co_uk_food_recipes_bubble_and_squeak_and_38318", "title": "Burbujas y chirridos y chalotes confitados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bubble_and_squeak_and_38318_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cebollas de primavera grandes, más o menos picadas", "rebanada grande de mantequilla", "aceite de oliva, para freír", "3-4 vainas de cardamomo", "1 semillas de cilantro apiladas", "1 cucharadita de semillas de comino", "restos de puré de patatas", "crema doble pequeña (150ml / 5fl oz) doble", "puñado de hojas de cilantro fresco, picado"], "method": ["Calentar una sartén y agregar las cebolletas, la mantequilla y una buena gota de aceite de oliva para evitar que la mantequilla se queme.", "Mientras tanto, quite las semillas negras de las vainas de cardamomo con la parte posterior de un cuchillo. Colóquelo en un mortero (o alternativamente use una bolsa de plástico y un rodillo), agregue las semillas de cilantro y las semillas de comino y trabaje con la mano del mortero o el rodillo hasta que estén gruesas. No los mueles hasta obtener un polvo completo: quieres textura y frutos secos de las especias.", "Agregue las especias a las cebolletas y cocine, revolviendo de vez en cuando, hasta que se vuelvan de color marrón dorado pálido, pero antes de que comiencen a arder y crujientes. Agregue la mezcla de cebolla a un puré de patatas sobrantes en un tazón y forme cuatro tortas de papa con las manos. Vuelva a colocar los pasteles en la sartén y cocine hasta que estén crujientes y dorados en cada lado, literalmente unos minutos, eso es todo, y retírelos de la sartén.", "Para una salsa rápida, agregue la crema a la sartén que se usa para cocinar la burbuja y pique los pasteles con un poco de cilantro fresco. Llevar a ebullición y sazonar bien. Sirva la burbuja y chuletas directamente con la salsa. Estos también son maravillosos servidos con lonjas de tocino a la parrilla o filetes a la parrilla."], "url": "www_bbc_co_uk_food_recipes_bubbleandsqueakcakes_92283", "title": "Pasteles de burbuja y chirrido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["675 g / 1½ lb de patatas Maris Piper, peladas y cortadas en trozos", "Col rizada 225g / 8oz o col de primavera, finamente en rodajas", "25g / 1oz de mantequilla", "1 puerro o cebolla pequeña picada", "150ml / 5fl oz de leche entera de crema", "pimienta blanca recién molida", "6 lonchas de tocino rayado, cortado en lardons", "2 cucharadas de vinagre de vino blanco", "4 huevos de gallinas camperas", "salsa holandesa hecha a medida, para servir"], "method": ["Coloque las papas en una sartén grande de agua salada (una cucharadita de sal por 600 ml / pinta de agua). Llevar a ebullición y cocine a fuego lento hasta que estén tiernos.", "Coloque 1 cm / ½ pulgada de agua en una olla grande y deje que hierva. Agregue media cucharadita de sal y el repollo y cocine a fuego fuerte durante 4-5 minutos, hasta que estén tiernos.", "Escurra las papas cocidas y deje que el vapor se apague. Escurra bien la col.", "Usando la misma sartén, derrita la mantequilla, luego agregue el puerro o la cebolla y cocínelo suavemente durante 7-8 minutos, o hasta que se ablanden pero aún estén translúcidos.", "Pase las papas a través de un ricer de patata (si no tiene una, puede usar un triturador) en la sartén y agregue el repollo, la leche y la pimienta blanca al gusto. Mezclar bien", "Calentar una sartén hasta que esté caliente y agregar el tocino y freír hasta que esté crujiente. Agregue el tocino a la mezcla de papa y forme cuatro hamburguesas.", "Calienta la sartén. Coloque las hamburguesas en la sartén caliente y cocine por 2-3 minutos, o hasta que estén doradas, luego voltee y cocine por otros 2-3 minutos.", "Mientras tanto, ponga a hervir un sartén de agua con sal y agregue el vinagre. Batir el agua para crear un remolino y, una vez asentado, romper un huevo. Cocine a fuego lento durante 2-3 minutos, retire el huevo escalfado con cuidado con una cuchara ranurada y colóquelo en un plato para drenar. Repita el proceso con los huevos restantes.", "Para servir, coloque la burbuja y chillar en un plato y cubra con los huevos y una cucharada de salsa holandesa."], "url": "www_bbc_co_uk_food_recipes_bubbleandsqueakwithp_84100", "title": "Burbuja y chillido con huevo escalfado y salsa holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "150 g / 5½ oz de azúcar en polvo de oro", "6 huevos grandes de gallinas camperas, separados", "Chocolate negro de alta calidad de 250 g / 9 oz (mínimo 60% de sólidos de cacao)", "250g / 9oz de mantequilla sin sal ablandada", "450g / 1lb de azúcar glas dorada, más extra para quitar el polvo", "50 g / 1¾oz de cacao en polvo, tamizado", "2 cucharadas de leche", "Crema doble 400ml / 14fl oz, ligeramente azotada", "250g / 9 oz de frambuesas", "dash whisky licor (opcional)"], "method": ["Este rollo de Navidad se puede hacer de dos maneras: con glaseado de crema de mantequilla y decoraciones festivas, o lleno de crema y bayas.", "Precaliente el horno a 220 ° C / 425 ° F / Gas 7. Cubra una lata de rollo suizo de 23x33 cm / 9x13 con papel resistente a la grasa y cepíllese ligeramente con aceite.", "Combine el azúcar impalpable y las yemas de huevo en un bol y mezcle hasta que estén livianos y gruesos. Derrita el chocolate con 4 cucharadas de agua fría en un tazón sobre una fuente de agua hirviendo a fuego lento. Cuando pueda ver que el chocolate se ha derretido hasta que esté suave, agregue la mezcla de azúcar y huevo.", "Mientras tanto, bata las claras de huevo hasta que estén firmes pero no secas. Doble suavemente una cucharada de claras de huevo en la mezcla de chocolate para aligerarlo, luego doble las claras restantes con una cuchara grande de metal. No mezcle en exceso, y siempre use una acción suave. Vierta la mezcla suavemente en la lata preparada y hornee por 12-14 minutos (no más), hasta que se haya levantado y firme al tacto.", "Retire a una rejilla de alambre y deje enfriar en la lata durante al menos 2 horas.", "Una vez que esté frío, coloque una hoja de papel resistente a la grasa en un tablero. Con un movimiento audaz, coloque todo el pastel en la hoja de papel, luego levante la lata. Cuidadosamente retire el papel y corte los bordes del pastel.", "Para hacer el glaseado de crema de mantequilla, bata la mantequilla hasta que esté suave, luego tamiza el azúcar glas y el cacao. Agregue la leche y combine juntos hasta que esté suave. Extiende la mitad del glaseado sobre el pastel hasta los bordes.", "Ruede como lo haría con un rollo suizo: comenzando por el lado largo frente a usted, use el papel para enrollar el pastel hacia usted, alrededor de la guinda; no te preocupes por las grietas Transfiera a un plato de servir plano. Cuidadosamente, esparza el resto del glaseado sobre la torta (puede picar el glaseado si lo desea). Enfríe hasta que sea necesario, luego decorar con decoraciones festivas y tamizar sobre azúcar glas.", "Para hacer que la crema se llene, extiende la torta invertida con la crema batida, espárzala sobre las bayas y agrega algunas gotas de Drambuie, si quieres. Cuidadosamente enrolle como se describe arriba. Tamice el azúcar glas antes de servir."], "url": "www_bbc_co_uk_food_recipes_buchedenoel_73213", "title": "Navidad chocolate Yule log", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buchedenoel_73213_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de calabaza cocida", "140g / 4¾oz de harina de alforfón", "1 cucharada de canela molida", "4 cucharadas de aceite de coco, derretido", "4 cucharadas de jarabe de arce", "2 cucharaditas de extracto de vainilla", "1 cucharadita de polvo de hornear", "1 cucharada de vinagre de sidra de manzana", "1½ cucharada de jarabe de arce", "130g / 4½oz de aceite de coco", "2 cucharadas de tahini", "2 cucharaditas de extracto de vainilla", "pétalos de rosa comestibles secos o chocolate vegano rallado, para decorar"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja de magdalenas de 12 hoyos con cajas de papel.", "Mezcle todos los ingredientes de las magdalenas y 3 cucharadas de agua juntas en un procesador de alimentos hasta que estén suaves y bien combinados.", "Divida la mezcla por igual entre las cajas de magdalenas (aproximadamente 3 cucharadas soperas por caja de papel). Hornee durante 18-20 minutos, o hasta que un pincho insertado en el centro de los cupcakes salga limpio. Retire los cupcakes de la lata y déjelos a un lado para que se enfríen en una rejilla hasta que estén completamente fríos.", "Mientras tanto, batir los ingredientes de glaseado junto con un batidor eléctrico hasta que estén suaves y esponjosos. Enfríe en la nevera hasta que los bizcochos se hayan enfriado, luego vuelva a batir.", "Transfiera el glaseado de arce tahini a una manga pastelera y glasee los cupcakes. Espolvorear con pétalos de rosa o chocolate vegano rallado y servir."], "url": "www_bbc_co_uk_food_recipes_buckwheat_and_butternut_60078", "title": "Magdalenas de alforfón y mostaza con glaseado de arce tahini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_and_butternut_60078_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400ml / 14fl oz de leche sin lácteos o jugo de manzana", "125 g / 4½ oz de harina de alforfón", "40 g / 1½ oz de harina de gramo", "1 cucharada de harina de maíz", "pizca de sal", "200 g / 7 oz de soja o crema de queso normal", "1 limón, jugo y ralladura", "aceite de colza, para freír", "200 g / 7 oz de salmón ahumado", "pequeño grupo de cebolletas, picadas", "25 g / 1 oz de semillas de calabaza, tostadas", "1 cucharada de caperberries, más o menos picados"], "method": ["Mezcle la leche, las harinas, la sal y los 65 ml / 2 g / l de agua sin leche en un tazón grande. Deje reposar la mezcla durante al menos 1 hora.", "Mientras tanto, mezcle el queso crema, el jugo de limón y la ralladura de limón en un tazón. Batir hasta que quede suave y cremoso y almacenar en la nevera hasta que esté listo para usar.", "Caliente una sartén antiadherente de 20-25 cm / 8-10 pulgadas a fuego medio hasta que esté caliente. Cepíllese ligeramente con aceite y vierta un poco de la mezcla, agitándola para que forme una fina capa en el fondo de la sartén. Si la masa no es lo suficientemente fina, puede agregar un poco más de líquido a la mezcla.", "Cuando la parte superior del panqueque esté seco (aproximadamente 1 minuto) voltee el panqueque y cocine el otro lado por un minuto más, los panqueques deben colorearse ligeramente. Repita con la masa restante. Puede mantener calientes los panqueques cocidos envolviéndolos en papel de aluminio y colocándolos en un horno a baja temperatura.", "Extienda una capa generosa de queso crema sobre el panqueque y cubra con una rebanada de salmón ahumado, cebollino, semillas de calabaza y alcaparras. Ruede el panqueque para encerrar el relleno y servir."], "url": "www_bbc_co_uk_food_recipes_buckwheat_pancakes_with_39810", "title": "Panqueques de trigo sarraceno con salmón ahumado y crema de cítricos", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Rinde 8 panqueques", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_pancakes_with_39810_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta pizzoccheri 300 g / 10½ oz (hecha generalmente con 1/3 harina italiana '00', 2/3 harina de alforfón)", "200g / 7oz de papas cerosas, peladas y cortadas en cubos pequeños", "200 g / 7 oz de acelga suiza, hojas solo", "sal y pimienta negra recién molida", "80g / 3oz de mantequilla sin sal", "3 dientes de ajo, en rodajas", "300g / 10½oz de bitto o queso toma, cortado en cubos pequeños", "100 g / 4 oz de parmesano (o un queso duro vegetariano similar), recién rallado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Ponga los pizzoccheri, las papas y las acelgas en una olla grande y cubra con agua hirviendo con sal. Cocinar juntos hasta que estén suaves, aproximadamente 14 minutos.", "Mientras tanto, derrita la mantequilla en una sartén pequeña y fría el ajo hasta que esté cocido, pero no marrón.", "Escurra la pasta de pizzoccheri, las papas y la acelga y coloque en un plato grande a prueba de horno. Mientras aún esté tibio, mezcle los cubos de queso. Verter sobre la mantequilla espumosa y el ajo y espolvorear sobre el parmesano. Sazone al gusto con sal y pimienta, luego mezcle bien.", "Hornee en el horno por 20 minutos. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_buckwheat_pasta_with_71440", "title": "Pasta alforfón con patatas y acelga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de chips de chocolate negro", "125 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "125 g / 4½ oz de harina de alforfón", "25 g / 1 oz de cacao en polvo, tamizado", "½ cucharadita de bicarbonato de soda", "½ cucharadita de sal marina fina", "60 g / 2¼ oz de mantequilla sin sal", "125g / 4½oz de azúcar morena oscura", "1 cucharadita de pasta de vainilla o extracto", "2 huevos grandes de gallinas camperas, nevera-fría"], "method": ["Repique las chispas de chocolate en un plato plano y póngalo en la nevera mientras continúa haciendo la mezcla. Tampoco estaría de más enterrarlos en el congelador. Hago esto para que las virutas no se derritan demasiado al hornear, dejándote con pepitas de chocolate intenso.", "Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra un par de bandejas para hornear (o 1 si se hornea en 2 lotes) con papel para hornear.", "Picar el chocolate amargo, y derretirlo en un recipiente adecuado en el microondas o sobre una fuente de agua hirviendo. Dejar de lado para enfriar un poco.", "En otro tazón, mezcle la harina de trigo sarraceno, el cacao, el bicarbonato y la sal, y bifurque para asegurarse de que todo esté bien combinado.", "En otro cuenco más (uso mi batidora independiente aquí, pero un bol y un batidor de mano o, de hecho, una cuchara de madera y una grasa en el codo también funcionarían), unte la mantequilla y el azúcar con el extracto de vainilla hasta que tenga un color caramelo oscuro esponjoso, usando una espátula para raspar los lados del recipiente si es necesario. Golpee el chocolate frío y derretido, luego los huevos fríos (me parece que esto significa que no es necesario refrigerar la masa antes de hornear) uno por uno, y cuando ambos se absorban en la mezcla de mantequilla y azúcar, raspe el lados del tazón nuevamente, baje la velocidad y golpee cuidadosamente los ingredientes secos.", "Usando una cuchara de madera o una espátula, dobla las fritas de chocolate frías, y echa una cucharada de masa redonda en una bandeja para hornear forrada, dejando alrededor de 6 cm / 2½ pulgadas entre cada una. Coloque el recipiente con la masa de galletas restante en el refrigerador mientras el primer lote está en marcha.", "Hornee durante 9-10 minutos, momento en el cual las galletas se colocarán en los bordes, pero de lo contrario parecerán poco cocidas, luego retire la hoja del horno y deje que las galletas reposen en la bandeja caliente por otros 10 minutos antes de transferirlas a un rejilla para enfriar.", "Cuando la bandeja esté fría o tenga otra alineada y lista para salir, saque el recipiente de masa de la nevera y proceda como antes."], "url": "www_bbc_co_uk_food_recipes_buckwheat_triple_32460", "title": "Triple galletas de trigo sarraceno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace aproximadamente 25 cookies", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_triple_32460_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30ml / 1fl oz de aceite de oliva", "100g / 3½ oz champiñones, finamente rebanados", "240ml / 9fl oz de vino blanco seco", "1 cucharada de eneldo fresco relleno, picado (puede sustituirlo por secado)", "un puñado de cebolletas frescas, picadas", "Crema de 300 ml / 10 fl oz - vaca, cabra, soja o avena, dependiendo de lo que sea capaz de comer", "225 g / 8 oz de salmón ahumado cortado en fósforos delgados", "sal marina y pimienta negra recién molida", "1 limón, solo jugo", "Fideos de alforfón 350g / 12oz"], "method": ["Caliente el aceite en una sartén ancha y fría los hongos durante 4 a 5 minutos; no les dejes color.", "Agregue el vino, aumente el fuego y cocine rápidamente por otros cinco minutos para reducir el vino.", "Agregue las hierbas y la crema, mezcle completamente, luego agregue el salmón y vuelva a calentar suavemente, pero no hierva.", "Sazone al gusto con sal marina, pimienta y jugo de limón. Cúbralo, déjelo a un lado y manténgalo caliente.", "Cocine los fideos en abundante agua hirviendo y ligeramente salada hasta que estén casi al dente, de 4 a 8 minutos dependiendo de la variedad. Drene y enjuague bien con agua hirviendo.", "Convierta la pasta en un plato para servir calentado y mezcle suavemente la salsa de salmón antes de servir."], "url": "www_bbc_co_uk_food_recipes_buckwheatnoodleswith_77288", "title": "Fideos de trigo sarraceno con salmón ahumado y eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla", "225ml / 8 fl oz de leche", "1 cucharadita de sal", "¼ de cucharadita de azúcar", "60 g / 2½ oz de harina de arroz", "2½ cucharadas de harina de alforfón", "1½ cucharadita de aceite vegetal", "2 huevos pequeños, preferiblemente de campo abierto", "40 ml / 1½ fl oz de agua mineral con gas"], "method": ["Derretir la mantequilla en una sartén pequeña. Agregue la leche, la sal y el azúcar, revuelva bien y apague el fuego.", "Coloque las dos harinas en un recipiente para mezclar, haga un pozo en el centro y vierta el aceite vegetal y agregue los huevos. Mezcle los huevos y el aceite con un batidor, gradualmente agregue la harina por los lados hasta que comience a espesarse. Agregue la mezcla de leche poco a poco hasta que todo se haya incorporado y la mezcla esté suave. Finalmente, bate en el agua.", "Vierta la mezcla a través de un colador mediano en un recipiente y refrigere durante al menos dos horas. (El tiempo de reposo permite que el rebozado se relaje y que la harina absorba los líquidos por completo. El rebozado se puede preparar hasta un día antes y refrigerarse).", "Para cocinar, caliente una sartén de 15-18 cm / 6-7 in. Agregue un poco de aceite. Cuando la sartén esté caliente, vierta suficiente masa para cubrir la base de la sartén.", "Deje que se cocine por un lado durante 1-2 minutos, voltee al otro lado y continúe cocinando, hasta que quede moteado y ligeramente dorado.", "Deslízate sobre un plato y mantén el calor mientras preparas el resto de los panqueques. Puede apilar uno encima del otro, ya que pueden despegarse más tarde, pero lo mejor es comerlo recién sacado de la sartén."], "url": "www_bbc_co_uk_food_recipes_buckwheatpancakebatt_74763", "title": "Panqueques de trigo sarraceno sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 panqueques de 18cm / 7in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275 ml / 9½ fl oz de leche desnatada", "1 huevo de gallinas camperas", "pizca de sal", "1 cucharadita de aceite vegetal", "Harina integral de 55g / 2oz", "Harina de alforfón 55g / 2oz", "1 cucharadita de aceite vegetal, para cocinar", "1 limón, solo jugo", "1 naranja, solo jugo"], "method": ["Coloque la leche, el huevo, la sal y el aceite en un tazón grande y mezcle bien.", "Tamiza la harina de trigo y alforfón en un recipiente aparte.", "Agregue la harina mezclada a la mezcla de leche gradualmente, revolviendo constantemente hasta que se forme una mezcla suave. Deje reposar la masa durante treinta minutos antes de cocinar.", "Agregue una cucharadita de aceite a una olla caliente, vierta un octavo de la mezcla y cocine durante 1-2 minutos por cada lado, o hasta que se dore por cada lado. Retire de la sartén y coloque entre las hojas de papel de hornear y mantenga caliente mientras repite el proceso con la mezcla restante para crear ocho panqueques.", "Para servir, coloque un panqueque en un plato calentado y agregue un chorrito de jugo fresco de limón y naranja."], "url": "www_bbc_co_uk_food_recipes_buckwheatpancakes_80141", "title": "Panqueques de trigo sarraceno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 175g / 6oz", "pizca de sal", "65 g / 2¼ oz de mantequilla fría sin sal, cortada en cubos de 5-10 mm / ¼-½ en", "Manteca de cerdo fría de 65 g / 2¼ oz, cortada en cubos de 5-10 mm / ¼-½ en", "1 cucharadita de jugo de limón", "2 cucharadas de harina normal", "1kg / 2lb 4 oz búfalo guiso de carne, cortado en 4-5cm / 2in cubos", "1-2 cucharadas de aceite vegetal", "25 g / 1oz de mantequilla sin sal", "12 chalotes, pelados pero abandonados enteros", "2 zanahorias grandes cortadas en rodajas de 2cm / 1 in", "2 cucharaditas de champiñones champiñones", "1 cucharada de puré de tomate", "300 ml / 10½ fl oz cerveza o cerveza negra", "300ml / 10½fl oz de caldo de carne", "algunas ramitas de tomillo", "1 cucharadita de azúcar morena oscura", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, batido, para glasear"], "method": ["Para hacer la hojaldre, combine la harina y la sal en un tazón grande. Coloque la mantequilla y la manteca de cerdo en un recipiente aparte, mezclándolos sin apretarlos.", "Tome un cuarto de las grasas mezcladas y frótelas en la harina ligeramente con los dedos.", "Combine el jugo de limón con 130 ml / 4 fl oz de agua y mezcle ligeramente en la harina para formar una masa muy suave.", "Estirar la masa sobre una superficie bien enharinada hasta formar un rectángulo, de aproximadamente 10x30 cm / 4x12 pulgadas.", "Tome otro cuarto de las grasas mezcladas y salpique uniformemente sobre los dos tercios superiores del rectángulo de repostería.", "Ahora doble el tercio inferior vacío hacia arriba y el tercio superior hacia abajo sobre él, como si doblara una letra.", "Gire la masa 90 grados y selle los bordes presionando hacia abajo con los dedos.", "Estirar la masa y repetir el punteado y doblar tres veces para usar toda la grasa.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante al menos 30 minutos antes de extenderla y usarla.", "Para hacer el relleno, ponga la harina en un recipiente grande y sazone generosamente con sal y pimienta. Mezcle la carne en la harina hasta que esté bien cubierta.", "Caliente una cucharada de aceite y la mantequilla en una cazuela a prueba de fuego a fuego medio-alto. Trabajando en tandas, dore bien la carne, agregando un poco más de aceite si es necesario. Transfiere la carne dorada a un plato.", "Baje el fuego debajo de la sartén, agregue un poco más de aceite si es necesario y agregue los chalotes y las zanahorias. Freír suavemente durante un par de minutos, hasta que los chalotes estén comenzando a ablandarse. Devuelve toda la carne a la sartén. Agregue el ketchup de hongos y el puré de tomate y cocine por otros dos minutos.", "Vierta la cerveza y el caldo, luego agregue el tomillo y el azúcar. Llevar a ebullición, luego reduzca el fuego, cubra con una tapa y cocine a fuego lento durante una hora o hasta que la carne esté tierna.", "Transfiera la carne a un plato para pastel de 1.5 litros / 2½ pinta y deje que se enfríe completamente. (Si hay mucho líquido, retírelo para que sirva como salsa).", "Precalentar el horno a 200C / 400F / Gas 6.", "En una superficie enharinada, extienda la masa hasta un espesor de 3 mm (aproximadamente el grosor de una moneda de 1 £).", "Cortar una tira de pastelería de 2 cm / 1 in. Humedezca el borde del plato para pastel con agua y presione la tira de repostería sobre el borde.", "Corta la masa restante un poco más grande que el plato para pastel. Siente un embudo de pastel en el centro del relleno. Presione la tapa sobre la parte superior y engarce los bordes. Recorta el exceso de masa.", "Cepille la masa con huevo batido y haga un agujero de vapor para exponer el embudo. Hornee durante 35-40 minutos hasta que la masa esté crujiente y dorada. Dejar reposar de 10 a 15 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_buffalo_and_ale_pie_72032", "title": "Pastel de búfalo y ale", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "4 cucharadas de salsa de chile", "1½ cucharadita de vinagre de vino blanco", "2 cucharaditas de salsa Worcestershire", "pellizque cada una de sal de apio, pimienta de cayena y pimienta negra", "½ cucharada de salsa barbacoa", "2 gotas de aceite de humo (opcional)", "50ml / 2fl oz de suero de leche", "½ repollo rojo pequeño, rallado o rallado", "½ zanahoria, rallada", "½ cebolla roja, finamente rebanada", "½ chile rojo, finamente picado", "1 cucharada de hojas de cilantro finamente picadas", "1-2 tbsp mayonesa colmada", "50g / 1¾oz de panko breadcrumbs", "1½ cucharadita de cilantro molido", "1½ cucharadita de semillas de hinojo molido", "50g / 1¾oz de harina natural", "1 huevo de gallinas camperas, ligeramente golpeado", "2 pechugas de pollo (aproximadamente 175g / 6oz), butterflied", "1 cucharada de aceite de girasol", "4 panecillos de pretzel, o similares, cortados por la mitad y tostados, para servir"], "method": ["Para hacer la salsa de búfalo, mezcle todos los ingredientes, a excepción del suero de leche, en una cacerola. Traiga a fuego lento y revuelva bien. Deje que se enfríe completamente y agregue el suero de leche. Cubra y deje en la nevera hasta que esté listo para servir.", "Para hacer el repollo, mezcle todos los ingredientes hasta que estén bien combinados. Cubra y deje en la nevera hasta que esté listo para servir.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para hacer el pollo, mezcle las migas de pan, el cilantro y las semillas de hinojo en un bol. Pon la harina y el huevo batido en tazones separados. Separe cada trozo de pollo en la harina y sacuda el exceso. Sumerja el pollo en el huevo y cubra con las migas de pan condimentadas.", "Calentar el aceite en una sartén y freír el pollo hasta que se dore por ambos lados. Transfiera a una bandeja para hornear y hornee en el horno durante 8-10 minutos o hasta que el pollo esté bien cocido y no haya rastros de color rosado.", "Para servir, espolvorea una porción generosa del repollo en las mitades inferiores de los panecillos tostados. Extienda una cucharada del aderezo de búfalo sobre los lados cortados de las mitades superiores. Coloque el pollo encima del repollo y agregue el panecillo superior."], "url": "www_bbc_co_uk_food_recipes_buffalo_chicken_burgers_84771", "title": "Hamburguesas de pollo Buffalo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4 hamburguesas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalo_chicken_burgers_84771_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas cerosas de 500 g / 1 libra y 2 onzas, lavadas y cortadas en trozos", "1 cucharada de aceite de oliva", "3 cucharadas de mayonesa", "1 diente de ajo, aplastado", "½ limón, solo jugo", "110g / 4oz de mantequilla", "120ml / 4fl oz salsa de chile picante", "½ cucharada de salsa Worcestershire", "2 cucharaditas de pimentón", "½ cucharadita de pimienta de cayena", "½ cucharadita de sal marina", "½ cucharadita de pimienta negra recién molida", "aceite de girasol, para freír", "Harina normal de 100 g / 3½ oz", "Alas de pollo 1.3kg / 3lb", "2 lechugas Little Gem, hojas separadas", "12 apio, en rodajas", "1 cucharada de menta fresca picada", "1 cucharada de cilantro fresco picado", "1 cucharada de perejil fresco picado", "1 limón, solo jugo", "1 cucharadita de mostaza Dijon", "3 cucharadas de aceite de oliva"], "method": ["Para las papas, precalentar el horno 200C / 180C Fan / Gas 6.", "Coloque las papas en una bandeja de horno con un poco de aceite de oliva, sal y pimienta. Mezcle bien y luego tueste durante 45 minutos o hasta que las papas estén doradas.", "Cuando las papas estén listas, sáquelas del horno y déjelas enfriar durante aproximadamente 5 minutos.", "En un tazón grande, prepare el aderezo mezclando la mayonesa, el ajo y el jugo de limón, luego sazone con sal marina y pimienta negra molida al gusto. Agregue las papas y revuelva para cubrir.", "Para las alitas de pollo, bata la mantequilla, la salsa de chile picante, la salsa Worcestershire, 1 cucharadita de pimentón, pimienta de cayena y sal y pimienta negra en una cacerola a fuego alto. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 5 minutos hasta que espese un poco.", "Para las alas, caliente 5cm / 2in de aceite de girasol en una cacerola grande y profunda hasta que alcance 190C / 375F (o hasta que un pequeño cubo de pan chisporrotea y se ponga marrón en 1 minuto cuando se lo agrega al aceite).", "Sazone la harina con sal y pimienta y mezcle con la cucharadita restante de pimentón. Separar el pollo en la harina y freír las alas en tandas en aceite caliente durante 15 minutos, o hasta que esté cocido, crujiente y dorado. Retirar del aceite con pinzas y escurrir en un plato forrado con papel de cocina. Coloque las alitas de pollo en un tazón grande y mezcle con la salsa hasta que esté completamente cubierto.", "Para la ensalada, mezcle la lechuga, el apio y las hierbas en un tazón grande. En un recipiente aparte, mezcle todos los ingredientes del aderezo. Justo antes de servir vierte el aderezo sobre la ensalada.", "Para servir, coloque las alitas de pollo en un plato para servir y sirva la ensalada al costado, con las papas en un recipiente aparte."], "url": "www_bbc_co_uk_food_recipes_buffalo_chicken_wings_25720", "title": "Alitas de pollo Buffalo con ensalada de papas asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Alas de pollo de 1 kg / 2 libras y 4 onzas, puntas extraídas y divididas en \"drumettes\" y \"flats\"", "aceite vegetal, para freír", "algunos palitos de apio", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "2 dientes de ajo, aplastados", "125ml / 4fl oz de salsa picante", "1 cucharada de vinagre de sidra", "1 cucharadita de azúcar en polvo", "100g / 3½oz de queso azul cremoso", "1 cebolla pequeña, muy finamente picada", "100ml / 3½fl oz de suero de leche", "150ml / 5fl oz crema fresca", "1 cucharadita de vinagre de sidra"], "method": ["Si tienes tiempo, prepara las alas rociándolas generosamente con sal. Disponga, en un estante en la nevera, cubra y deje enfriar durante la noche, esto los ayudará a crujir cuando los fríe. Una hora antes de que desee cocinarlos, retírelos del refrigerador para que alcancen la temperatura ambiente y séquelos.", "Para la salsa picante, derrita la mantequilla en una cacerola pequeña y agregue el ajo. Cocine suavemente por un minuto o dos, luego bata la salsa picante, el vinagre y el azúcar. Condimentar con sal y pimienta.", "Para hacer la salsa de queso azul, machaque el queso con la cebolla, el suero de leche, la crème fraîche y el vinagre.", "Vierta suficiente aceite en una freidora o en una olla grande, para llenarlo a no más de la mitad. Calentar el aceite a 160C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cocine las alas en lotes durante unos 10 minutos, luego escurra el exceso de aceite. Aumente la temperatura del aceite a 190 ° C y fría de nuevo, cocine por otros 2 minutos, hasta que esté cocido, muy crujiente y de color marrón oscuro. Apaga el papel de cocina.", "Pon las alas en un bol y sofríelas en la salsa picante. Servir con la salsa de queso azul y el apio."], "url": "www_bbc_co_uk_food_recipes_buffalo_wings_09457", "title": "alas de búfalo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalo_wings_09457_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ bombilla pequeña de hinojo, herby tops reservada", "1 calabacín amarillo pequeño", "pequeño manojo de menta fresca, desgarrado en pedazos", "½ naranja, piel eliminada, finamente cortada en rodajas", "½ limón, solo jugo", "3 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida", "1 rebanada gruesa de pan de masa fermentada", "1 diente de ajo, pelado, cortado por la mitad", "125 g / 4½ oz de mozzarella de búfala"], "method": ["Con un pelador de verduras, afeite ligeramente el hinojo y el calabacín en tiras. Coloque en un tazón con menta y la mitad de las tapas de hinojo.", "Agregue las rodajas de naranja y el jugo de limón y revuelva para combinar.", "Rocíe una cucharada de aceite de oliva y sazone al gusto con sal y pimienta negra recién molida.", "Caliente una sartén a fuego alto hasta que esté caliente.", "Tueste bien el pan por ambos lados durante 2 a 3 minutos o hasta que quede chamuscado con las marcas de la sartén. Retire de la sartén y colóquelo en un plato.", "Frote el pan de masa fermentada a la brasa con el lado cortado del ajo y rocíe sobre otra cucharada de aceite de oliva.", "Rompa la mozzarella por la mitad y colóquela en el pan tostado.", "Coloque la ensalada de hinojo y calabacín en la parte superior y rocíe sobre el aceite de oliva restante. Dispersa sobre las partes superiores de hinojo reservadas."], "url": "www_bbc_co_uk_food_recipes_buffalomozzarellabru_93627", "title": "Bruschetta de mozzarella con hinojo afeitado y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalomozzarellabru_93627_16x9.jpg", "isVegetarian": true, "recommendations": 0}]