[{"ingredients": ["3 cucharadas de aceite de girasol", "2 cebollas grandes, peladas y picadas", "Jengibre fresco de la raíz de los 4cm / 2in, pelado y tajado", "½ cucharadita de semillas de comino", "2 cucharadas de cilantro molido", "1 cucharada de comino molido", "1 cucharadita de chile en polvo (opcional)", "4 dientes de ajo, pelados y picados", "Pechuga de pollo de 1.5kg / 3lbs, sin piel, picada", "115g / 4oz anacardos", "1 hoja de laurel", "sal y pimienta negra recién molida", "4 cucharadas de crema doble", "puñado de cilantro fresco, solo hojas", "arroz basmati blanco, cocido, para servir"], "method": ["Calentar el aceite en una cacerola grande, agregar las cebollas picadas y el jengibre y freír durante 3-4 minutos, o hasta que estén suaves pero no coloreados. Agregue las semillas de comino, el cilantro molido, el comino molido y el chile en polvo, si se usan, y fría hasta que estén aromáticos. Agregue el ajo picado y fría por un minuto más.", "Agregue las piezas de pollo, los anacardos y la hoja de laurel, y deje que el pollo se dore un poco a fuego medio. Sazonar con sal y pimienta negra recién molida, cubrir con agua hirviendo y llevar a ebullición. Reduzca el fuego a fuego lento y cocine suavemente por 15 minutos.", "Agregue la crema doble, suba el fuego y deje burbujear durante 4-5 minutos, o hasta que la salsa se espese.", "Espolvoree sobre el cilantro fresco picado y sirva con arroz basmati blanco."], "url": "www_bbc_co_uk_food_recipes_chickenkormawithcash_89032", "title": "Korma de pollo con anacardos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero, despellejado y cortado en 10 piezas: 2 muslos, 2 alas, 2 muslos y 4 porciones de senos", "150 g / 6 oz de yogur", "100ml / 3½ fl oz crema doble", "1 cucharada de azúcar en polvo", "1 cucharadita de sal", "6 dientes", "1 pizca de azafrán", "1 ramita de canela", "8 vainas de cardamomo verde", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de cilantro", "½ cucharadita de pimienta de cayena", "1 cucharada de aceite vegetal", "2 cucharaditas de semillas de comino", "4 dientes de ajo", "3 cm / 1¼ en pieza de jengibre fresco", "3 cebollas, finamente picadas", "50g / 2oz de almendras en copos, ligeramente trituradas", "100ml / 3½ oz de agua", "2 cucharaditas de sal masala", "1 cucharada de cilantro picado", "50 g / 2 oz de levadura fresca", "2-3 cucharadas de agua tibia", "500 g / 1 libra de harina de autoaumento de 1½ oz", "½ cucharadita de azúcar en polvo", "10 cucharadas de agua (más extra si es necesario)", "½ cucharadita de sal", "1 cucharada de aceite vegetal"], "method": ["Para el korma de pollo, coloque todos los ingredientes del adobo en un tazón grande y mezcle para combinar.", "Agregue las piezas de pollo y mezcle bien para cubrir uniformemente.", "Cubra y coloque en el refrigerador, idealmente durante 24 horas, pero al menos durante la noche.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para las cebollas, caliente una sartén hasta que esté caliente, luego agregue el aceite vegetal.", "Agregue las semillas de comino, el ajo y el jengibre y saltee durante 30 segundos.", "Agregue las cebollas y las almendras y fría por otros 2-3 minutos.", "Coloque el pollo marinado en una cazuela grande.", "Agregue la mezcla de cebolla y agua y revuelva bien para combinar.", "Cubra y coloque en el horno durante 1-1 ¼ horas hasta que el pollo esté tierno.", "Justo antes de servir, agregue el garam masala y el cilantro picado.", "Para el pan plano, desmenuce la levadura en un tazón pequeño, luego mezcle en 2-3 cucharadas de agua tibia.", "Tamiza la harina, la sal y el azúcar en otro tazón.", "Vierta el agua de levadura en la harina y agregue 10 cucharadas de agua. Mezcle para formar una masa. Agregue otra cucharada o más de agua si es necesario para lograr una masa flexible.", "Amasar la masa hasta que esté suave y flexible.", "Coloque en un recipiente, cúbralo sin apretar y déjelo en un lugar cálido durante dos horas.", "Retire la masa del recipiente y amasar ligeramente para eliminar el exceso de aire.", "Divídalo en bolas del tamaño de una pelota de golf, luego deje que se demuestre durante otros 15 minutos.", "Desplácese hasta un disco delgado de 14cm / 7 pulgadas.", "Caliente el aceite vegetal en una sartén hasta que esté caliente, luego agregue el disco y la parrilla por tres minutos en cada lado.", "Sirve con el pollo Korma."], "url": "www_bbc_co_uk_food_recipes_chickenkormawithgril_74655", "title": "Pollo Korma con pan plano a la parrilla", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "sal y pimienta negra recién molida", "1 pechuga de pollo pequeña, finamente picada", "15 g / ½ oz mozzarella, finamente picada", "1 cucharada de albahaca picada", "1 diente de ajo, finamente picado", "1 hoja de lasaña fresca, cortada en seis tiras de 7cm / 3 pulgadas, blanqueada", "2 yemas de huevo de gallinas camperas, batidas", "aceite de oliva, a llovizna", "½ puerro, finamente picado", "50ml / 2fl oz de vino blanco", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "1 cucharada de perejil picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una sartén pequeña, derrita la mantequilla. Sazonar el pollo, luego agregar a la sartén para dorar por todos lados.", "En un tazón, mezcle la mozzarella, la albahaca y el ajo. Coloque las tiras de lasaña y rellene con la mezcla de pollo y mozzarella. Doble y use las yemas de huevo para sellar.", "Coloque en una bandeja para hornear, rocíe con aceite de oliva y hornee en el horno durante 10-12 minutos, o hasta que estén cocidos.", "Mientras tanto, para la salsa, cocine a fuego lento el puerro en una sartén con el vino durante 5 minutos.", "Agregue la crema y sazone con sal y pimienta negra recién molida.", "Termine con el perejil, luego cubra los ravioles para servir."], "url": "www_bbc_co_uk_food_recipes_chickenleekandmozzar_80765", "title": "Ravioles de pollo, puerro y mozzarella con salsa cremosa de puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pollo de 250 g / 9 oz, cortada en tiras finas", "Fideos de huevo finos de 180g / 6oz directamente al wok", "2 cucharadas / 30 ml / 1 fl oz de miel clara", "4 cucharadas de aceite vegetal", "1 cucharada de jengibre fresco picado", "1 diente de ajo, aplastado", "3 cebollas de primavera, picadas", "½ chile rojo, finamente picado", "1 zanahoria pequeña, en rodajas", "1 pimiento rojo, cortado en tiras", "1 cabeza de pak choi, picada", "2 cucharadas de salsa de soja oscura", "2 cucharadas de aceite de sésamo tostado", "1 lima, ralladura y jugo", "pequeño racimo de cilantro fresco, toscamente picado", "50g / 2oz de anacardos tostados sin sal"], "method": ["En primer lugar, prepare todos los ingredientes.", "Caliente un wok grande a fuego alto. Agregue un poco del aceite y el pollo. Sofría el pollo por un minuto, luego agregue la miel y continúe cocinando hasta que el pollo esté completamente cocinado y tenga un rico color dorado. Retira del wok y ponlo a un lado.", "Agregue el aceite restante al wok recalentado y fría el ajo, el jengibre y el chile por unos 20 segundos. Agregue el resto de las verduras, manteniendo el fuego alto, saltee hasta que estén tiernas, pero aún retenga algo.", "Agregue los fideos precocidos y saltee por un minuto más o menos antes de devolver el pollo a la sartén.", "Mezcle bien, agregue el cilantro picado, ajuste el aderezo, agregue el aceite de sésamo con salsa de soja y la ralladura de limón y el jugo.", "Sirva con una dispersión de anacardos sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickenlimeandcashew_4133", "title": "Pollo, lima y anacardo salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla", "4 dientes de ajo, finamente picados", "1 cebolla picada", "2 cucharadas de piñones", "2 cucharadas de almendras en copos", "1 cucharada de grosella", "½ cucharadita de pimienta de Jamaica", "1 cucharadita de albahaca seca", "Hígados de pollo de 450 g / 1 lb, limpios y finamente picados", "sal y pimienta negra recién molida", "manojo de perejil flatleaf, picado", "manojo de eneldo, picado", "Arroz de grano largo 340g / 12oz", "850 ml / 1½ pintas de caldo de pollo", "el perejil de azafrán y flatleaf, para adornar"], "method": ["Derrita la mantequilla en una sartén, luego agregue el ajo y la cebolla y sude unos minutos. Agregue los piñones y las pasas de Corinto y cocine durante 2 minutos. Agregue la pimienta de Jamaica, la albahaca y los hígados de pollo y dore ligeramente.", "Sazonar con sal y pimienta negra recién molida y agregar las hierbas frescas. Retire de la sartén y reserve.", "Para el arroz, mezcle el arroz en el residuo mantecoso en la sartén por un par de minutos, vierta sobre el caldo y llévelo a ebullición. Cocine a fuego lento hasta que el arroz haya absorbido parte del caldo. Doble con cuidado la mezcla de hígado. Cúbralo con una tapa y déjelo reposar durante 15 minutos.", "Pelusa con un tenedor y servir, adornado con azafrán y perejil."], "url": "www_bbc_co_uk_food_recipes_chickenliverandalmon_81501", "title": "Pilaf de hígado de pollo y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin piel sin hueso, cortadas en tiras finas", "sal al gusto", "Polvo chino de cinco especias, al gusto", "1 chile rojo, finamente picado", "1in / 2.5cm pieza de raíz fresca de jengibre, pelada y rallada", "4 dientes de ajo, pelados y finamente picados", "1 cucharada de aceite de maní", "1 cucharada de aceite de sésamo", "2 zanahorias, peladas y cortadas en piezas de fósforos", "1 repollo de primavera, sin núcleo, hojas finamente trituradas", "½ cabeza de brócoli, cortado en pequeños floretes", "2 cabezas de bok choi, picadas", "4 cebolletas, picadas", "Fideos de huevo de 400 g / 14 onzas, cocidos de acuerdo con las instrucciones del paquete", "1 cilantro fresco de racimo pequeño, solo hojas, picado", "60ml / 2fl oz sake, más 1 cucharada", "3 cucharadas de vino de arroz Shaoxing (disponible en algunos supermercados o tiendas de comestibles asiáticos, sustituya el jerez seco si no está disponible)", "3 cucharadas de salsa de chile dulce", "1½tsp pla (salsa de pescado tailandés)", "1 cucharadita de salsa de soja ligera", "1 cucharada de harina de maíz", "1 puñado de brotes de soja", "pimienta negra recién molida, al gusto"], "method": ["Coloque las tiras de pollo en un recipiente y sazone con la sal y el polvo chino de cinco especias.", "En un tazón pequeño, mezcle el chile picado, el jengibre rallado y el ajo picado. Agregue aproximadamente un quinto de esta mezcla al pollo y mezcle bien, luego deje el pollo a un lado para que se mate por unos minutos.", "Caliente el aceite de cacahuete en un wok hasta que comience a ahumar, luego agregue el pollo y fríalo por 2-3 minutos, volteándolo una vez, hasta que se dore por todas partes. Transfiera el pollo chamuscado, junto con cualquier jugo, del wok a un recipiente y déjelo a un lado.", "Regrese el wok al fuego y agregue el aceite de sésamo. Freír el resto de la mezcla de chile, jengibre y ajo durante unos 30 segundos, o hasta que esté fragante, luego agregar las zanahorias, el repollo y el brócoli y saltear durante 1-2 minutos.", "Agregue el pollo nuevamente al wok (reservando los jugos).", "En un tazón pequeño, mezcle el sake, el vino de arroz Shaoxing, una cucharadita de nam pla y la salsa de chile dulce, luego agregue al wok y revuelva bien.", "Agregue el bok choi picado y las cebolletas al wok junto con los fideos de huevo cocidos. Revuelva freír durante 1-2 minutos para calentar, luego agregue los brotes de soja.", "Agregue la salsa de soja ligera, una cucharada de sake, el nam pla restante y la harina de maíz. Mezcle bien para combinar, luego agregue al wok y cocine por un minuto, o hasta que el líquido se haya espesado un poco.", "Para servir, sazone el chow mein con pimienta negra recién molida y divídalo entre cuatro platos para servir. Adorne con las hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chickenchowmein_92064", "title": "Pollo chow mi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, derretida", "1kg / 2lb 3oz hígados de pollo", "sal y pimienta negra recién molida", "1 cucharada de aguardiente", "4 cucharadas de crema doble", "Para decorar", "Algunos granos de pimienta negra triturados"], "method": ["Limpie los hígados de pollo, quitando y descartando cualquier trozo verdoso o sinuoso.", "Caliente dos cucharadas de mantequilla derretida en una sartén de base pesada. Cuando la mantequilla comience a formar espuma, agrega los hígados de pollo a la sartén caliente.", "Cocine los hígados suavemente durante 3-4 minutos, moviéndolos con cuidado, pero no los deje dorar. (Puede necesitar hacer esto en tandas, dependiendo del tamaño de su sartén). Sazone con sal y pimienta negra recién molida.", "Agregue el brandy a la sartén y flamee cuidadosamente el brandy durante unos segundos para quemar el alcohol. Permita que los hígados se enfríen un poco.", "Coloque los hígados (sin incluir los jugos de cocina) en el tazón de un procesador de alimentos y mezcle. Con el motor en marcha, agregue la mayor parte de la mantequilla restante (reservando dos cucharadas para la parte superior) en un flujo constante. No agregue los sólidos lácteos que se habrán hundido en el fondo de la sartén.", "Con el motor todavía en funcionamiento, agregue la crema doble y mezcle durante algunos segundos más. La mezcla de hígado debe ser bastante suave.", "Pase la mezcla de hígado a través de un tamiz, empujando la mezcla con una cuchara de madera en un recipiente, descartando cualquier parte dura que quede en el tamiz (esto tomará alrededor de 10-15 minutos). Esto hará un parfait ultra suave.", "Coloque el parfait en un plato de terrina y alise la superficie con un cuchillo, si es necesario. Espolvoree unos granos de pimienta triturados en la parte superior y vierta sobre la mantequilla derretida reservada. Coloque en la nevera para que se enfríe y fije por lo menos durante dos horas.", "Usando una cuchara calentada en agua caliente, saque el parfait en un plato de servir. Sirva con brioche tostado y algunas hojas mixtas de ensalada de bebé."], "url": "www_bbc_co_uk_food_recipes_chickenliverparfaitw_90184", "title": "Parfait de hígado de pollo con brandy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenliverparfaitw_90184_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "Hígados de pollo de 500 g / 1 lb 2oz, recortados", "1 diente de ajo, picado", "2 ramitas de tomillo", "2 hojas de albahaca", "3 cucharadas de jerez seco", "2 cucharadas de aceite vegetal", "½ cebolla roja, finamente picada", "2 manzanas Granny Smith (o manzanas crujientes similares) picadas", "½ cucharadita de canela", "½ cucharadita de jengibre molido", "3 cucharadas de alegar (vinagre hecho con cerveza) o vinagre balsámico", "2 cucharadas de azúcar moreno", "8 rebanadas de pan blanco, sin costras"], "method": ["Para el parfait de hígado de pollo, forrar una lata de pan con film transparente.", "Caliente una cucharada de mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los hígados de pollo. Freír por 1-2 minutos o hasta que estén doradas.", "Agregue el ajo, el tomillo, la albahaca y el jerez, luego coloque el jerez encendido con una cerilla. Permita que las llamas se enciendan y se apaguen. (PRECAUCIÓN: asegúrese de que el extractor esté apagado y mantenga la sartén lejos de los ojos, la cara y otros objetos). Freír los hígados de pollo en la mezcla durante 1-2 minutos más.", "Transfiera la mezcla a un procesador de alimentos, agregue la mantequilla restante y mezcle hasta obtener una pasta homogénea. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Con una cuchara, coloque la mezcla de parfait en el molde de pan revestido y deje enfriar en la nevera durante al menos tres horas, o hasta que se endurezca.", "Para la salsa picante de manzana con especias, caliente el aceite en una sartén separada a fuego medio. Cuando el aceite esté caliente, agregue la cebolla y fría por 1-2 minutos, o hasta que se ablande.", "Agregue las manzanas, la canela y el jengibre molido, revuelva bien y freír durante 2-3 minutos más, o hasta que las manzanas se hayan ablandado.", "Agregue el alegar (o vinagre balsámico) y el azúcar y cocine a fuego lento durante 2-3 minutos hasta que la mezcla se haya espesado.", "Transfiera la mitad de la mezcla de chutney a un procesador de alimentos y mezcle con un puré.", "Regrese la salsa picante en la sartén con la chutney gruesa y revuelva hasta que esté bien combinada. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la tostada Melba, precaliente la parrilla a su nivel más alto. Coloque cuatro de las rebanadas de pan en una bandeja para hornear y tueste durante 1-2 minutos en cada lado, o hasta que estén crujientes y doradas en ambos lados.", "Corta la tostada horizontalmente y devuelve la tostada a la bandeja para hornear, con los lados suaves hacia arriba. Grill durante 1-2 minutos, o hasta que estén crujientes y doradas.", "Repita el proceso con las cuatro rebanadas de pan restantes. Corte cada rebanada de tostada Melba en cuatro triángulos.", "Para servir, coloque ocho triángulos de pan tostado Melba en el centro de cada plato de servir. Coloque una rebanada gruesa del parfait de hígado de pollo helado a cada lado de la tostada. Ponga un poco de salsa picante de manzana al lado."], "url": "www_bbc_co_uk_food_recipes_chickenliverparfaitw_90441", "title": "Parfait de hígado de pollo con chutney de manzana con especias y pan tostado Melba", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "3 ramitas de tomillo, solo hojas", "1 diente de ajo, aplastado", "pizca de nuez moscada recién rallada", "½ cucharadita de pimienta de Jamaica molida", "1 naranja, solo ralladura", "sal marina y pimienta negra recién molida", "Hígados de pollo de 400g / 14oz, recortados de cualquier membrana y cartílago, toscamente picados", "50ml / 2fl oz de brandy", "100ml / 3½ fl oz crema doble", "120 g / 4½ oz de mantequilla sin sal, en cubos", "80g / 3oz de mantequilla sin sal", "maza pizca de tierra", "½ naranja, solo ralladura", "2 ramitas de tomillo, solo hojas"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue los chalotes y el tomillo y cocine suavemente durante cinco minutos, o hasta que estén suaves. Agregue el ajo, las especias, la ralladura de naranja y una buena pizca de sal y pimienta y cocine por otros dos minutos, o hasta que esté fragante.", "Agregue los hígados de pollo a la sartén y freír durante 6-8 minutos, o hasta que estén recién cocidos. Para probar, retire un trozo de hígado de la bandeja y córtelo para abrirlo; debe estar húmedo pero no más sangriento (un poco de rosa está bien). Retire del fuego y ponga todo en un procesador de alimentos. Mezclar hasta que esté suave.", "Agregue el brandy a la sartén para desglasar, luego agregue la crema y cocine a fuego lento. Cocine por dos minutos, revolviendo cualquier residuo de la sartén. Vierta en el procesador de alimentos y mezcle de nuevo hasta que quede suave. Con el motor en marcha, agregue gradualmente la mantequilla en cubos y mezcle hasta que quede suave.", "Pasar la mezcla a través de un tamiz fino en un recipiente y luego dividir entre cuatro moldes. Alise las partes superiores golpeando la parte inferior de los moldes contra la superficie de trabajo, luego coloque en el refrigerador mientras prepara el acabado de mantequilla.", "Derrita la mantequilla en una cacerola con la maza molida y una cuchara sobre los patés. Espolvorea sobre la ralladura de naranja y las hojas de tomillo para decorar. Refrigere durante dos horas antes de servir con rebanadas de pan de masa fermentada tostada y encurtidos de maíz."], "url": "www_bbc_co_uk_food_recipes_chickenliverpate_85880", "title": "Paté de hígado de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenliverpate_85880_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite vegetal", "5 cebolletas grandes, cortadas, cortadas aproximadamente en diagonal", "1 cebolla picada", "2 dientes de ajo, picados", "2cm / ¾ en pieza de jengibre, finamente picado", "1 guindilla roja, sin semillas, cortada en tiras finas", "1 cabeza pak choi, partes blancas y verdes separadas, finamente picadas", "pizca de sal", "2 muslos de pollo, piel y huesos retirados, carne picada en tiras", "1 pizca de pimienta molida", "1 litro / 1¾ pintas de caldo de pollo caliente", "1 plato de salsa de soja", "Fideos de huevo 150 g / 5½ oz", "1 tallo de limoncillo, ligeramente aplastado con el filo de un cuchillo", "2 cucharadas de cilantro fresco picado"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la cebolla tierna, la cebolla, el ajo, el jengibre y el chile y fría por 2-3 minutos, o hasta que las cebollas se hayan ablandado levemente.", "Agregue los jirones blancos de pak choi y la sal. Continúe freír durante 3-4 minutos, o hasta que el pak choi se haya marchitado y las otras verduras se hayan ablandado.", "Agregue las tiras de pollo y la pimienta de Jamaica molida y revuelva hasta que los ingredientes estén bien combinados y cubiertos con la pimienta de Jamaica. Continúe freír por 2-3 minutos o hasta que las especias estén fragantes.", "Agregue el caldo de pollo y la salsa de soya a la sartén. Llevar a ebullición y cocinar durante 3-4 minutos.", "Agregue los jirones verdes de pak choi, los fideos de huevo y el tallo de la hierba de limón y revuelva bien. Continúe hirviendo la mezcla durante 4-5 minutos, o hasta que los fideos estén tiernos y el pollo esté completamente cocido. Justo antes de servir, agregue el cilantro picado.", "Sirve en tazones de una sola vez."], "url": "www_bbc_co_uk_food_recipes_chickennoodlesoup_91328", "title": "Sopa de fideos con pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo cortada en tiras finas", "½ pimiento picante, picado", "2 cucharadas de cebollín fresco, picado", "2 cucharadas de perejil fresco, picado", "2 cucharadas de aceite de oliva", "50g / 1¾oz de carne de coco fresco rallado", "líquido de un coco fresco", "½ lima, solo jugo", "1 diente de ajo, finamente picado", "½ whisky escocés, picado", "1 cucharada de cilantro fresco, picado", "100ml / 3½ fl oz crema doble", "hojas frescas de cilantro, para adornar"], "method": ["Para hacer las albóndigas, coloque el pollo, el chile, el cebollín y el perejil en un procesador de alimentos y mezcle en una mezcla de carne picada.", "Enrolle porciones iguales de la mezcla de carne picada en albóndigas del tamaño de una pelota de golf.", "Calentar el aceite en una sartén mediana. Agregue las albóndigas y fría por dos minutos para dorar por todas partes.", "Transfiera las albóndigas a una bandeja para hornear y colóquelas en el horno para hornear durante cinco minutos.", "Mientras tanto, para hacer la salsa de curry de coco, coloque el coco rallado, el líquido de coco, el jugo de lima, el ajo, el chile, el cilantro y la crema en una cacerola mediana a fuego medio. Cocine hasta reducir a una salsa espesa, luego vierta en un recipiente caliente.", "Para servir, coloque las albóndigas en el bol de salsa de curry de coco y adorne con unas hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_chickenmeatballswith_79686", "title": "Albóndigas de pollo con curry de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cadáveres de pollo, más 6 patas de pollo", "2,5 litros / 4 pintas 8 fl oz de agua", "3 zanahorias, peladas, picadas", "2 tallos de apio, cortados, picados", "1 puerro grande, cortado, en rodajas", "2 cebollas grandes, peladas, picadas", "2 hojas frescas de laurel", "1 pequeño racimo de tomillo fresco", "1 cucharadita de pimienta negra", "1 cucharadita de sal en escamas", "Fideos de arroz a 150 g / 5 oz", "1 cucharada de perejil fresco picado", "1-2 cucharadas de cebolletas frescas picadas, para servir"], "method": ["Coloque las carcasas de pollo y las baquetas en una sartén grande y profunda y cúbralas con el agua. Agregue las zanahorias, el apio, el puerro y la cebolla.", "Haga un bouquet garni con las hojas de laurel y el tomillo atando las hierbas junto con un hilo de cocina. Agregue el bouquet garni a la sartén junto con los granos de pimienta y la sal.", "Cubra la olla con la tapa y lleve la mezcla a ebullición, luego reduzca el fuego hasta que esté hirviendo a fuego lento. Cocine a fuego lento durante aproximadamente dos horas, quitando cualquier espuma que se eleva a la superficie del líquido de vez en cuando. Guarde para enfriar un poco, luego cuele el caldo en una sartén más pequeña. Recoge la carne de los muslos de pollo y agrégala al caldo colado.", "Cuando esté listo para servir el caldo, llévelo a fuego lento y luego agregue los fideos. Cocine los fideos de acuerdo con las instrucciones del paquete hasta que estén tiernos, luego agregue el perejil picado.", "Sirva la sopa de fideos de pollo en tazones con los cebollines picados espolvoreados."], "url": "www_bbc_co_uk_food_recipes_chickennoodlesoup_93136", "title": "Sopa de fideos con pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickennoodlesoup_93136_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pollo deshuesadas, sin piel, de 225 g / 8oz, cortadas en tiras finas", "1 huevo blanco de corral", "2 cucharadas de harina de maíz", "1 cucharadita de sal", "½ cucharadita de pimienta blanca recién molida", "225 g / 8 oz de fideos de huevo frescos y delgados (sustituya los fideos de huevo secos si no están disponibles)", "300 ml / 10 fl oz de maní o aceite vegetal", "175g / 6oz de brotes de soja frescos", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de salsa de ostras", "1 cucharada de salsa de soja ligera", "300ml / 10½fl oz de caldo de pollo", "1 cucharadita de sal", "½ cucharadita de pimienta negra recién molida", "1 cucharada de harina de maíz, mezclada con 1½ cucharada de agua", "3 cucharadas de cebolletas finamente picadas, para adornar"], "method": ["Para el pollo, coloque las tiras de pollo en un tazón y agregue la clara de huevo, harina de maíz, sal y pimienta blanca recién molida. Mezcle bien hasta que el pollo esté cubierto uniformemente, luego cubra el tazón con película adhesiva y enfríe en la nevera durante al menos 20 minutos.", "Para los fideos, blanquear los fideos de huevo frescos durante 2-3 minutos en una olla grande de agua hirviendo con sal, o hasta que estén tiernos. (Si utiliza fideos de huevo secos, cocine de acuerdo con las instrucciones del paquete, reduciendo el tiempo de cocción en aproximadamente 1-2 minutos). Drene bien y extienda en una bandeja para hornear para que se enfríe.", "Caliente un wok hasta que esté muy caliente y agregue el aceite (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Cuando el aceite esté muy caliente, fría los fideos por lotes hasta que estén muy crujientes. Escurrir sobre papel de cocina.", "Cuando todos los fideos estén listos, retire el wok del fuego e inmediatamente agregue los trozos de pollo, revolviendo vigorosamente para evitar que se peguen. Cuando las piezas de pollo se pongan blancas, aproximadamente 2 minutos, retírelas con una espumadera y escurra.", "Limpie el wok y colóquelo a fuego alto. Agregue los brotes de soja, el vino de arroz, la salsa de ostras, la salsa de soja, el caldo de pollo, la sal y la pimienta negra. Ponga a hervir la mezcla, reduzca el fuego, agregue la mezcla de harina de maíz y cocine a fuego lento. Regrese las piezas de pollo al wok y revuelva para cubrirlas con la salsa.", "Para servir, coloque los fideos crujientes en un plato de servir y cuchara sobre el pollo y la salsa. Adorne con cebolletas picadas."], "url": "www_bbc_co_uk_food_recipes_chickenoncrispynoodl_93614", "title": "Pollo en fideos crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo grande, articulado (o use 2 patas de pollo grandes y 2 pechugas, a la mitad)", "sal", "2 cucharadas de aceite de oliva", "mantequilla perilla", "1 cebolla picada", "2-3 dientes de ajo, picados", "2 cucharadas de pimentón dulce, o 1 cucharada de cada pimentón dulce y caliente", "1 cucharada de harina", "285ml / ½ pinta de caldo de pollo", "3 cucharadas de perejil de flatleaf fresco picado", "2 pimientos rojos, semillas extraídas y cortadas en tiras de 1cm / 0.5in", "4 tomates grandes maduros, toscamente picados", "250ml / 8fl oz de crema agria"], "method": ["Frote las piezas de pollo con sal. Caliente el aceite y la mantequilla en una sartén grande de fondo grueso y dore el pollo por unos minutos. Retire el pollo de la sartén y colóquelo a un lado.", "En la misma sartén, agregue las cebollas, el ajo y el sudor durante aproximadamente 5 minutos. Agregue el pimentón, la harina y revuelva hasta que se combinen, tenga cuidado de no quemarlo.", "Agregue el caldo y revuelva. Devuelva las piezas de pollo a la bandeja, agregando un poco más de existencias si las mezclas parecen demasiado secas. Agregue la mitad del perejil y deje que hierva. Agregue las tiras de pimiento rojo, reduzca el fuego y cocine a fuego lento durante 10 minutos. Agregue los tomates y cocine a fuego lento durante aproximadamente 1 hora.", "Cuando el pollo esté cocido, retire la sartén del fuego. Agregue la crema agria y el perejil restante. Controle el condimento y sirva."], "url": "www_bbc_co_uk_food_recipes_chickenpaprikawithle_80341", "title": "Pimentón de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenpaprikawithle_80341_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla, más extra para freír", "1 cucharada de harina", "200ml / 7fl oz de caldo de pollo", "3 cucharadas de crema doble", "apretón de jugo de limón", "ramita de estragón fresco (opcional)", "1 pimiento verde mediano, en rodajas", "puñado de setas, limpiadas y descuartizadas", "Pollo cocido 400 g / 14oz, rallado", "225 g / 8oz de hojaldre listo para usar", "1 huevo mediano de granja, golpeado"], "method": ["Precalentar el horno a 200C / 180C (ventilador) / Gas 6.", "Para la salsa, derrita la mantequilla en una cacerola de fondo grueso, agregue la harina y cocine lentamente a fuego lento durante 3 minutos, o hasta que la mezcla huele a tostado. Vierta el caldo de pollo, suba el fuego y revuelva constantemente hasta hervir a fuego lento. Agregue la crema y cocine a fuego lento hasta la salsa hasta que tenga una consistencia almibarada. Agregue el jugo de limón y el estragón. Apaga el fuego", "En otra sartén, fríe con cuidado el pollo, los pimientos y los champiñones en un pomo de mantequilla durante 5 minutos, luego agrégalos a la salsa.", "Unte con mantequilla un plato resistente al horno lo suficientemente grande como para contener la mezcla de pastel de pollo con espacio de sobra. Agregue la mezcla de pollo al plato.", "Extienda la masa sobre una superficie de trabajo enharinada, hasta un grosor de aproximadamente ¼ in / 1 cm. Coloque la masa sobre el relleno y recorte cuidadosamente los bordes. Use los adornos para hacer formas recortadas para decorar la superficie del pastel. Corta un par de agujeros de aire con un cuchillo para permitir que escape el vapor. Cepille la masa con el huevo batido.", "Hornee el pastel en el horno precalentado durante aproximadamente 25-35 minutos. La parte superior debe estar bien dorada y la tubería de llenado caliente. Retirar, dejar enfriar un poco y servir."], "url": "www_bbc_co_uk_food_recipes_chickenpie_80250", "title": "Tarta de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenpie_80250_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2 kg / 4 lb 7 oz de pollo entero", "1.5 litros / 2 pintas 12½ fl oz miel hidromiel", "1 ramita de tomillo fresco", "50g / 2oz de mantequilla", "1 cucharada de aceite de oliva", "500 g / 1 libra 2 oz zanahorias Chantenay (u otras zanahorias dulces similares)", "75ml / 3fl oz de agua", "50g / 2oz de mantequilla", "3 cucharadas de miel", "½ cucharadita de comino molido", "sal y pimienta negra recién molida"], "method": ["Para el pollo, quite las alas, las piernas y los muslos del pollo. Coloque todas las piezas de pollo, incluida la corona, en una sartén grande con el hidromiel y la ramita de tomillo. Cubra con una tapa y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 25-30 minutos, o hasta que el pollo esté bien cocido. Retire el pollo de la sartén y seque, luego talle las pechugas de pollo alejándolas de la corona. (Puede reservar la carcasa de pollo para hacer inventario en otra receta).", "Regrese la sartén con el hidromiel de miel al fuego y lleve a ebullición, luego cocine a fuego lento durante 6-8 minutos, o hasta que se reduzca ligeramente. Agregue la mitad de la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Caliente la mantequilla restante y el aceite de oliva en una sartén hasta que forme espuma, luego fría los trozos de pollo, con la piel hacia abajo, durante 2 a 3 minutos, o hasta que estén dorados y crujientes. Apartar y mantener caliente.", "Para las zanahorias glaseadas, cocine las zanahorias en una sartén de agua hirviendo con sal durante 2-3 minutos, o hasta que estén tiernas. Escurra y coloque en una sartén limpia junto con el agua, la mantequilla, la miel y el comino, revolviendo bien.", "Llevar a ebullición, luego cocinar durante 4-5 minutos, o hasta que el líquido en la sartén espese a una consistencia almibarada y las zanahorias estén glaseadas y tiernas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el pollo entre cuatro platos y espolvoree algunas zanahorias glaseadas al lado. Rocíe el mead reducido en miel y sirva."], "url": "www_bbc_co_uk_food_recipes_chickenpoachedinmead_91505", "title": "Pollo escalfado en hidromiel con zanahorias Chantenay glaseadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, picadas en piezas de 2cm / 1in", "Jengibre fresco de 2cm / 1in, finamente picado", "5 dientes de ajo, finamente picados", "2 cucharadas de aceite vegetal, más extra para freír el pollo", "400 g / 14¼ oz de arroz basmati, lavados y empapados en agua fría durante al menos 30 minutos", "600ml / 1 pinta 1½fl oz de agua", "2 cucharadas de aceite vegetal", "1 cebolla grande, finamente rebanada", "4 dientes de ajo, finamente picados", "Jengibre fresco de 5cm / 2in, finamente picado", "2 cucharadas de polvo de curry Madras suave", "200ml / 7¼fl oz de leche de coco", "200ml / 7¼fl oz de caldo de pollo", "1 x 400 g / 14¼ oz puede cortar tomates", "2 patatas grandes, peladas y picadas en trozos grandes", "1 x 400 g / 14¼ oz pueden garbanzos, escurridos y enjuagados", "puñado de cilantro fresco, finamente picado"], "method": ["Para el pollo, combine el pollo, el jengibre, el ajo y el aceite vegetal en un plato poco reactivo. Cubra y deje en la nevera para marinar durante al menos una hora.", "Para el arroz basmati, coloca el arroz en una sartén con tapa. Agregue el agua y hierva a fuego medio con la tapa puesta. Una vez que hierva, reduzca a fuego lento y cocine durante 8-10 minutos. Retire del fuego y deje reposar durante al menos 10 minutos antes de servir.", "Mientras tanto, para el curry, caliente el aceite en una sartén grande a fuego medio. Agregue la cebolla y cocine durante 10 minutos, o hasta que la cebolla se haya suavizado y haya adquirido un poco de color. Agregue el ajo y el jengibre y cocine por otros cinco minutos. Agregue el polvo de curry y cocine durante dos minutos.", "Agregue la leche de coco, el caldo de pollo y los tomates. Llevar a ebullición y agregar las papas. Cocine a fuego lento durante unos 10 minutos, o hasta que las papas estén tiernas. Agregue los garbanzos y vuelva a hervir. Cocine a fuego lento durante dos minutos.", "Para cocinar el pollo, caliente un chorrito de aceite en una sartén a fuego alto. Cocine el pollo por todos lados hasta que esté dorado y cocido. Reserve el pollo, cubierto, en un lugar cálido hasta que esté listo para servir.", "Para servir, coloque cantidades generosas de curry y pollo en los platos de arroz. Adornar con el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_chickenpotatoandchic_91415", "title": "Curry de pollo, patata y garbanzo con arroz basmati", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 pies de gallina, hervidos durante 40-45 minutos y luego frotados para eliminar la piel y cualquier callosidad", "4 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "1 chile rojo, finamente picado", "5 cucharadas de vino blanco", "10 tomates datterini (o tomates baby plum), cortados por la mitad", "Espagueti 200g / 7oz", "4 cucharadas de perejil recién picado"], "method": ["Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue el ajo y el chile en la sartén.", "Agregue los pies de pollo, el vino y 5 cucharadas de agua. Llevar a ebullición, agregar los tomates y cocinar durante 5-10 minutos.", "Mientras tanto, caliente una cacerola con agua salada hirviendo y cocine los espaguetis según las instrucciones del paquete.", "Mezcle los espaguetis escurridos en la salsa y adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_chickens_feet_with_11790", "title": "Pies de pollo con ajo, tomate y espagueti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 puñados grandes de cuscús", "1 limón, solo jugo", "3 naranjas, 2 jugos solamente, 1 izquierda entera", "pareja glugs aceite de oliva con sabor a fruta", "sal y pimienta negra recién molida", "puñado de carne de pollo de un pollo asado orgánico sobrante", "puñado de cebolletas frescas picadas", "puñado de hojas de albahaca fresca, más si te apetece", "puñado de brotes de guisantes"], "method": ["Coloque el cuscús en un recipiente y vierta un poco de agua hirviendo (debe cubrir los granos unos centímetros más o menos). Deja durante unos 15 minutos, hasta que el cuscús haya absorbido el líquido.", "En un tazón para mezclar por separado, mezcle el jugo de limón y el jugo de naranja con el aceite de oliva y sazone bien con sal y pimienta negra recién molida, agregando más aceite de oliva si lo desea. Vierta el aderezo sobre el cuscús cocido y déjelo remojar el aderezo durante aproximadamente 10 minutos.", "Mientras tanto, pele la naranja restante cortando las puntas, colocándola sobre una tabla de cortar y cortando los lados con un cuchillo afilado para quitar la piel y la médula. Corta la naranja en trozos de buen tamaño. Agregue los trozos de naranja, pollo y hierbas al cuscús y mezcle suavemente. No sobremezclar; se trata de una ligereza de contacto.", "Divida los brotes de guisantes entre dos platos o platos poco profundos y luego cuélelos suavemente con la ensalada de cuscús de pollo."], "url": "www_bbc_co_uk_food_recipes_chickensaladwithcous_92275", "title": "Ensalada de pollo con cuscús y naranjas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickensaladwithcous_92275_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar de palma 50g / 2oz", "50ml / 2fl oz de salsa de pescado", "2 x 400ml / 14fl oz latas de leche de coco", "8 muslos de pollo sin piel sin hueso", "cubitos de hielo (opcional)", "8 hojas de lima, muy finamente cortadas", "4 chalotes tailandeses rojos, pelados, en rodajas finas", "1 pimiento rojo, sin semillas, en rodajas finas", "3 chiles rojos pequeños, finamente cortados", "1 pepino, cortado por la mitad a lo largo, semillas recogidas con una cucharilla, carne en juliana", "1 coriandro grande, solo hojas", "1 manojo pequeño de menta, solo hojas", "1 manojo pequeño de albahaca tailandesa, solo hojas", "1 cucharadita de aceite vegetal", "1 cucharadita de agua fría", "4 piezas cuadradas de hoja de plátano, 15cm x 15cm / 6in x 6in (disponible en algunos supermercados asiáticos)", "Cacahuetes salados asados ​​50g / 2oz, ligeramente aplastados", "1 coco, cáscara eliminada, carne finamente cortada (opcional)"], "method": ["Llevar el azúcar de palma, la salsa de pescado y la leche de coco a ebullición en una sartén.", "Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Agregue los muslos de pollo y cocine en el líquido durante 4-5 minutos, o hasta que el pollo esté recién cocido. (NB: El pollo se cuece si los jugos salen limpios cuando se inserta un pincho en la parte más gruesa). Retire los muslos de pollo del líquido de cocción con una espumadera y seque con papel de cocina. Reserve el líquido de cocción.", "Caliente una sartén a fuego alto. Agregue el pollo escalfado y cocínelo durante 3-4 minutos, volteándolo regularmente, hasta que las marcas doradas de la plancha aparezcan por todos lados. Dejar de lado.", "Mientras tanto, devuelva el líquido de cocción al fuego y déjelo hervir. Continúe hirviendo durante 1-2 minutos, luego transfiera el líquido de cocción a un tazón y coloque el tazón en un fregadero o plato grande lleno de hielo, si se usa, o llene con agua fría.", "Agregue las hojas de lima en rodajas a la leche de coco caliente y mezcle hasta que el líquido se haya enfriado y las hojas de la lima sean fragantes.", "En un tazón separado, mezcle los chalotes, la pimienta, los chiles y el pepino hasta que estén bien combinados.", "Agregue una cucharada de la mezcla de coco y lima a la ensalada y mezcle para cubrir los ingredientes en el aderezo.", "Cuando los muslos de pollo estén lo suficientemente fríos para manipularlos, corta la carne en tiras y agrégala a la ensalada. Mezcle para combinar.", "Agregue las hierbas y mezcle bien para combinar.", "Para servir, mezcle la cucharadita de aceite vegetal con una cucharadita de agua. Cepille los cuadrados de hojas de plátano con esta mezcla. Coloque un cuadrado de hoja de plátano en el centro de cada una de las cuatro placas de servir. Divida la ensalada de pollo por igual entre los cuadrados de hojas de plátano. Rocíe un poco del aderezo de coco y lima restante. Espolvorea sobre los cacahuetes y el coco, si los estás usando."], "url": "www_bbc_co_uk_food_recipes_chickensaladwiththai_91766", "title": "Ensalada de pollo con salsa tailandesa de albahaca y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]