[{"isVegetarian": false, "title": "Braised beef with stout and oysters", "url": "www_bbc_co_uk_food_recipes_braised_beef_with_stout_47057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 kg/2lb 4oz shin of beef, cut into 2cm/¾ in pieces", "2 onions, finely chopped", "3 celery sticks, finely chopped", "2 garlic cloves, finely chopped", "1 thyme sprig, leaves removed", "1 bay leaf", "1 tbsp tomato purée", "250ml/9fl oz veal or beef stock", "440ml/16fl oz Irish stout ", "50g/1¾oz butter", "2 potatoes, peeled, and cubed ", "2 slices Irish soda bread, crusts removed and cut into small triangles", "2 tsp Dijon mustard", "1 tbsp finely chopped fresh flatleaf parsley", "3 fresh oysters, shucked", "1 tsp lemon juice", "1 garlic clove, finely chopped", "1 tsp finely chopped fresh tarragon", "2 tbsp snipped fresh chives", "2 tbsp fresh chervil leaves", "2 tbsp fresh tarragon leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "For the braised beef, heat the oil in a casserole dish placed over a high heat. Add the beef and seal on all sides until coloured. Remove the beef using a slotted spoon and set aside. Add the onion, celery, garlic, thyme and bay leaf to the dish and cook for 2–3 minutes. Add the tomato purée and cook for a further 2 minutes.", "Return the meat to the casserole dish and pour in the stock and stout. Cover and cook in the oven for 2–3 hours, or until the beef is very tender. Once cooked, set aside the meat, strain the stock and place in a saucepan over a low heat until reduced to a thick consistency. ", "Cook the potatoes in boiling, salted  water for 10–15 minutes, or until tender. Drain and set aside. ", "For the oyster soda bread, heat 1 tablespoon of the butter in a small frying pan. Add the soda bread and fry until crispy. Stir in the Dijon mustard and sprinkle with the chopped parsley.", "Heat the remaining butter in a small frying pan and sauté the oysters. Stir in the lemon juice, garlic, tarragon and potatoes. Combine together with the soda bread pieces and set aside. ", "Divide the oyster bread and potatoes between four wramed bowls. Top with the beef and spoon over the reduced stock. Scatter over the herbs and serve."]}, {"isVegetarian": false, "title": "Braised chicken turbigo", "url": "www_bbc_co_uk_food_recipes_braised_chicken_turbigo_17260", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 3kg/6½lb chicken", "285ml/½ pint chicken stock", "2 tbsp vegetable oil", "110g/4oz butter", "12 chipolatas", "170g/6oz button mushrooms, halved", "1 glass dry white wine", "4 tomatoes, skinned and chopped, seeds removed", "4 x 70g/2½oz slices black pudding, cut into rounds with a pastry cutter, offcuts roughly chopped", "2 slices white bread", "1 tbsp chopped parsley", "celery leaves from the central stalks, chopped", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4.", "Cut the chicken into eight pieces (two breasts, legs, and thighs), season with salt and pepper and set aside. ", "Chop up the remaining carcass and wings, put into a pan with the chicken stock. Simmer for 20 minutes.", "Meanwhile, heat one tablespoon of oil in a casserole dish and add 30g/1oz of butter. Place the chicken breasts into the pan skin-side down, fry until golden-brown, then remove from the pan and set aside. Place the leg pieces in the casserole and leave to cook for five minutes, then remove. Add the chipolatas, brown and remove. Add the mushrooms to the pan to brown, then add the white wine and cook to reduce the volume by half.", "Return the chicken and chipolatas to the casserole and strain in the chicken stock. Cover with the lid and transfer to the oven for 25-30 minutes, or until cooked.", "Remove the chicken, chipolatas and mushrooms from the pan and place in a serving dish.", "Add the tomatoes and black pudding offcuts to the stock. Simmer until the sauce is reduced in volume by two-thirds. Stir in 55g/2oz butter and season with salt and pepper, to taste.", "Meanwhile, heat a little oil in a frying pan and fry the rounds of black pudding until cooked, then transfer to the serving dish with the chicken.", "Cut the bread into four heart-shaped pieces or circles with a cookie cutter. Heat the remaining oil and butter in the frying pan and fry until golden-brown on one side. Dip the ends in the sauce, then in the chopped parsley.", "Pour the sauce over the dish. Sprinkle the celery leaves on top, lay the croutons on top and serve."]}, {"isVegetarian": false, "title": "Braised duck with peas", "url": "www_bbc_co_uk_food_recipes_braised_duck_with_peas_18884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 1.35kg/3lb ducks and giblets", "1 litre/1¾ pints chicken stock", "150g/5oz butter", "225g/8oz bacon lardons", "225g/8oz small button onions ", "110g/4oz carrots, diced", "110g/4oz leeks, diced", "1 tbsp chopped fresh sage", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh parsley", "450g/1lb peas, podded", "1 lettuce, shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Place the giblets and stock into a saucepan and simmer for 30 minutes.", "Meanwhile, heat a large ovenproof casserole or deep roasting tray on the hob. Add 25g/1oz of the butter and the lardons and fry for 1-2 minutes, then add the button onions and fry for a further 2-3 minutes, or until golden-brown. Remove the bacon and onions and set aside.", "Prick the ducks all over with a sharp knife and rub all over with a little salt. Fry the ducks in the casserole until browned all over. Drain off any fat.", "Strain the stock into the casserole, bring to the boil, cover with a lid or foil and braise in the oven for one hour.", "Return the button onions, bacon to the casserole with the carrots and leeks and braise for a further 15 minutes.", "Remove the ducks from the casserole and set aside to rest in a warm place. Spoon off any excess fat.", "Return the casserole to the hob and bring to the boil. Add the herbs, peas and lettuce to the sauce and continue to cook until the volume of the liquid had reduced by one-third.", "Whisk in the remaining butter and season, to taste, with salt and freshly ground black pepper.", "To serve, carve the ducks and arrange on a serving plate, then spoon over the sauce."]}, {"isVegetarian": false, "title": "Braised lamb, red lentil stew and parsley salad", "url": "www_bbc_co_uk_food_recipes_braised_elbow_of_lamb_04295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "4 lamb shanks (or lamb elbows)", "1 onion, chopped", "3 garlic cloves, crushed", "1 stick of celery, chopped", "1 carrot, chopped", "3 stalks of rosemary", "1 tbsp ras-el-hanout", "200ml/7floz red wine", "1½ litre/2½ pints lamb stock", "1 tbsp olive oil", "½ onion, diced", "2 garlic cloves, peeled and chopped", "½ carrot, diced", "200g/7oz red lentils", "lamb stock (from above)", "salt and freshly ground black pepper", "1 tbsp chopped parsley", "1 shallot, cut into rings", "2 tbsp white wine vinegar", "110ml/4floz light olive oil", "8 fillets of anchovies", "1 tbsp capers", "salt and freshly ground black pepper", "1 small bunch of parsley (leaves only)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb, preheat the oven to 220C/425F/Gas 7.", "Heat a casserole dish until hot, then add the oil and lamb and brown on all sides. Remove from dish and place to one side.", "Add all the vegetables and the rosemary. Sauté until golden-brown then add the ras el hanout and cook for 30 seconds.", "Add the wine and cook until reduced by half.", "Place the lamb back in the dish and cover with lamb stock.", "Place the lid on the dish and put it in the oven for 2½ hours. Check half way through and add more stock if required.", "When cooked, remove the lamb from the dish. Strain the stock through a fine sieve into a pan. Return to the heat and cook it until the stock has reduced by half, then set aside.", "For the lentils, heat a sauté pan until hot, add the oil, onion, garlic and carrot and sweat for a couple of minutes until just softened.", "Add the lentils and enough stock to half cover then bring to a simmer.", "Cook over a gentle heat, adding stock until the lentils are cooked to a sauce consistency, not too dry.", "Season with salt and black pepper then stir in the chopped parsley.", "For the parsley salad, place the shallots in a bowl and pour over the vinegar.", "Add the olive oil, anchovies and capers, mix well then season.", "Pour the mixture over the parsley and mix to combine.", "To serve, blow torch the lamb until browned then place on a plate. Cover with red lentil stew and serve with parsley salad."]}, {"isVegetarian": false, "title": "Braised feather blade beef", "url": "www_bbc_co_uk_food_recipes_braised_feather_blade_49306", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_feather_blade_49306_16x9.jpg", "ingredients": ["1kg/2lb 2oz feather blade steak, trimmed and cut into 250g/10oz pieces", "3 tbsp oil", "3 bannana shallots or 1 medium onion, sliced", "2 celery sticks, trimmed, sliced", "2 carrots, thickly sliced", "2 garlic cloves, crushed", "250ml/10fl oz red wine", "500ml/17fl oz beef stock ", "2 tbsp tomato purée", "4-5 sprigs fresh thyme", "1 bay leaf", "1 tsp English mustard ", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 3.  ", "Season the beef on both sides with salt and lots of freshly ground black pepper. Heat one tablespoon of the oil in a large heavy-based frying pan. Fry the steak pieces over a medium-high heat for 2-3 minutes on each sides, or until browned. Transfer the beef pieces to a casserole dish. (You may need to do this in batches.)", "Return the frying pan to the hob and reduce the heat. Add the remaining oil and gently fry the shallots, celery and carrots for 6-8 minutes or until golden-brown and softened. Stir in the garlic, cook for a further minute and add the mixture to the casserole.", "Deglaze the pan with wine and allow to bubble for a few seconds, stirring constantly and pour over the meat and vegetables. Stir the stock and the tomato purée. Strip the thyme leaves from the stalks and scatter into the pan, add the bay leaf and mustard and stir until well combined. Bring to the boil and remove the dish from the heat.", "Cover the surface of meat and liquid carefully with a piece of greaseproof paper. Place a lid on top and cook in the oven for 3-3½ hours or until the beef is very tender. Skim any fat away from the surface that appears during cooking.", "Transfer the meat to a plate. Strain the cooking liquor and vegetables through a sieve into a large non-stick frying pan. Press the vegetables with the bottom of a ladle to extract a rich purée and stir into the cooking liquor. Add salt and freshly ground black pepper, to taste.", "Bring the mixture to a simmer for 3-5 minutes, or until the sauce is well reduced, thick and glossy. Add the beef to the liquid and heat through for 3-4 minutes, spooning over the sauce to glaze. Serve with some green vegetables and mashed potatoes."]}, {"isVegetarian": true, "title": "Braised fennel with butter and parmesan", "url": "www_bbc_co_uk_food_recipes_braised_fennel_with_81864", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_fennel_with_81864_16x9.jpg", "ingredients": ["750g/1½lb fennel bulbs, trimmed, halved, trimmings reserved", "50g/1¾oz butter ", "salt and freshly ground black pepper", "3 tbsp dry vermouth", "splash pastis (optional, alternatively add more dry vermouth)", "60g/2oz parmesan (or similar vegetarian hard cheese), grated, plus extra for serving"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Melt the butter in a casserole dish over a low heat. Place the fennel into the butter cut-side down, and scatter around the trimmings. Season with salt and freshly ground black pepper and increase the heat. ", "Add the vermouth and pastis. Cover with a sheet of foil loosely pressed down on the vegetables, and put the lid on top. Place into the oven to cook for 30 minutes.", "Remove the dish from the oven and turn over the fennel. Return to the oven and cook for a further 30 minutes, or until very tender when poked with a small, sharp knife. ", "Preheat the grill to high. ", "Remove the fennel from the dish. Place in a warmed shallow oven-proof dish cut-side up, cover with foil and place in the oven while you make the sauce. ", "Pour the trimmings and cooking juices through a fine sieve suspended over a small pan. Warm through and add 45g/1½oz of the parmesan. Blend with a hand blender until smooth and creamy (about the consistency of pouring cream).", "Pour the mixture over the fennel and sprinkle with the remaining cheese. Place under the grill and cook until the surface is pale golden-brown and slightly bubbling around the edges. ", "Serve with extra parmesan for sprinkling over. "]}, {"isVegetarian": false, "title": "Braised hogget pie", "url": "www_bbc_co_uk_food_recipes_braised_hogget_pie_16464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz boneless shoulder of hogget", "6 shallots, roughly sliced", "2 tbsp tomato purée", "2 garlic cloves, crushed", "4 carrots, cubed", "2 celery stalks, roughly sliced", "1 small bunch fresh thyme, leaves only", "750ml bottle red wine", "500ml/18fl oz beef stock", "1kg/2lb 4oz waxy potatoes, peeled and thickly sliced", "50g/2oz butter", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Season the hogget all over with plenty of salt and pepper. ", "Heat a large, heavy-based casserole over a medium heat. When the pan is hot, add the hogget and fry for a couple of minutes on all sides, until browned all over. Remove from the pan and set aside. ", "Add the shallots and tomato purée to the casserole and fry in the hogget juices for 2-3 minutes, until softened, stirring well. ", "Add the garlic, carrots and celery and continue to fry for 3-4 minutes, until softened, stirring well.", "Add the thyme leaves and red wine and bring the mixture to the boil. Return the hogget to the pan, pour over the beef stock, then return the mixture to the boil. Transfer the casserole to the oven and cook for 2 hours. ", "After 2 hours, lift the hogget out of the casserole using a couple of carving forks and set aside on a board to cool slightly. Taste the sauce and add more salt and pepper if needed. ", "Tear the hogget into strips and return them to the casserole, mixing them into the sauce. ", "Layer the sliced potatoes over the top of the casserole and dot with the butter. Season with salt and pepper.", "Return the casserole to the oven for a further 30 minutes, or until the potatoes are tender and golden-brown and the casserole is bubbling."]}, {"isVegetarian": false, "title": "Braised Jacob’s Ladder, kohlrabi, mustard cream and crisp shallots", "url": "www_bbc_co_uk_food_recipes_braised_jacobs_ladder_31819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints cola", "150g/5fl oz dark soy sauce ", "70g/2½oz barbecue sauce", "150g/5½oz tomato ketchup", "50ml/2fl oz Worcestershire sauce", "1 pink grapefruit, juice only", "2 Jacob’s Ladder short ribs, cut into individual ribs", "250g/9oz unsalted butter, diced", "1 large banana shallot, peel and finely slice", "pinch onion salt", "250g/9oz double cream", "25g/1oz wholegrain mustard", "salt, to taste", "100g/3½oz raspberry vinegar", "200g/7oz light olive oil", "1 small kohlrabi, peeled and thinly sliced", "salt", "1 bunch rocket leaves", "50g/1¾oz parmesan cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 100C/200F/Gas ¼. ", "For the braising liquor and Jacob’s Ladder, mix all the ingredients except the ribs together in an ovenproof dish which will snugly fit the ribs. Add the ribs and coat in the braising liquor. ", "Cover the dish with aluminium foil and cook for 6-7 hours, or until the meat can be removed from the bone easily.", "Remove from the oven and allow to cool slightly.", "Remove the meat from the bone and place in a frying pan.  Add enough of the braising liquor to come a quarter of the way up the ribs. Place on a medium heat and cook until the volume of liquid has reduced to a thick sauce. Ensure the meat is coated well with the sauce. Keep warm", "For the crisp shallots, melt the butter in a heavy-bottomed pan over a high heat. Add the shallots and stir constantly. ", "When the shallot starts to colour, remove it from the pan and strain through a sieve. Season with onion salt and drain on kitchen roll.", "For the mustard cream, whisk the cream until soft peaks form when the whisk is removed. Add the mustard and a pinch of salt. Mix well, being careful not to over whip the cream, then transfer to the fridge.", "For the kohlrabi, mix the vinegar and oil together until emulsified.", "Put the kohlrabi in a bowl and coat generously with the vinaigrette.Set aside for 10 minutes to soften.", "To serve, divide the meat between four serving plates. Scatter the crisp shallots over the meat and place a spoonful of mustard cream and the kohlrabi alongside. Garnish with a few rocket leaves and finely grated parmesan."]}, {"isVegetarian": false, "title": "Braised lamb neck with pea and lettuce ragoût", "url": "www_bbc_co_uk_food_recipes_braised_lamb_neck_with_23209", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large whole lamb neck, about 1.6kg/3lb8oz, cut in half by butcher", "2 tbsp olive oil", "2 carrots, peeled and chopped", "2 tomatoes, chopped", "1 fennel head, trimmed and chopped", "1 garlic head, cloves divided and peeled", "1 onion, chopped", "1 red pepper, deseeded and chopped", "6 green cardamom pods, bruised", "1 tsp fennel seeds", "1 tbsp curry powder", "1 tbsp tomato purée", "300ml/10fl oz dry white wine", "2 litres/3½ pints lamb stock ", "1 bouquet garni", "pinch ground cumin", "sea salt and freshly ground black pepper", "2 carrots, peeled and diced", "1 tbsp olive oil", "70g/2½oz smoked lardons", "450g/1lb shelled fresh or frozen peas", "1 Little Gem lettuce, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the braised lamb neck, preheat the oven to 200C/180C/Gas 6.", "Pat the lamb neck dry. Heat a tablespoon of the olive oil in a large sauté or frying pan. Add the lamb neck and cook for 2–3 minutes to seal on all sides. Set aside. ", "Heat the remaining oil in a large flameproof casserole. Add the carrots, tomatoes, fennel, garlic, onion, red pepper, cardamom pods, fennel seeds and curry powder. Season with a pinch of salt and gently fry for 8–10 minutes, or until the vegetables are beginning to soften. Add the tomato purée and stir for another minute. ", "Add the wine, stirring to deglaze the pan, and boil until the wine evaporates. Add the lamb stock, bouquet garni and the lamb neck. Season with salt and pepper. Cover the casserole and bring the stock to the boil. Transfer to the oven and leave the lamb to braise for 3–3½ hours, or until the meat is tender enough to flake from the bone. Season the lamb with salt, pepper and cumin. Cover with kitchen foil and set aside.", "Meanwhile, for the ragoût, bring a small saucepan of salted water to the boil and place a bowl of iced water in the sink. Add the carrots to the boiling water, blanch until just tender and drain well. Plunge into the iced water. Once cool, drain well and set aside. ", "About 10 minutes before serving, heat the oil in a sauté or frying pan. Add the lardons and gently fry until they render their fat and are coloured all over. Set the pan aside.  ", "Strain the lamb cooking juices through a fine sieve into a saucepan and boil until reduced by half. Season with salt and pepper, if necessary.", "To finish the ragoût, add the peas, blanched carrots and 150ml/5fl oz of the reduced cooking juices to the pan with the lardons. Leave to simmer for 3–4 minutes, or until the peas are tender. Stir in the lettuce and continue simmering until it wilts. Season with salt and pepper, if necessary.", "Transfer the ragoût and lamb neck to warmed plates and serve immediately with the remaining cooking juices alongside. "]}, {"isVegetarian": false, "title": "Braised Jacob’s Ladder beef with wild mushrooms and pancetta", "url": "www_bbc_co_uk_food_recipes_braised_jacobs_ladder_51141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "4 Jacob’s Ladder (short rib) beef pieces", "300g/10oz pancetta, cut into lardons", "400g/14oz whole baby shallots", "3 garlic cloves, finely chopped", "2 sprigs rosemary", "2 sprigs thyme", "300ml/10½fl oz red wine", "400g/14oz chopped tomatoes", "600ml/1 pint veal jus", "50g/1¾oz butter", "400g/14oz wild mushrooms", "2 tbsp chopped parsley", "500g/1lb 2oz King Edward potatoes, peeled and cut into chunks", "100g/3½oz butter", "200ml/7fl oz double cream", "500g/1lb 2oz bunches baby carrots", "50g/1¾oz butter", "25g/1oz sugar", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the braised beef preheat the oven to 160C/325F/Gas 3.", "Heat a large lidded casserole pot and add the oil. Once hot, add the beef pieces, two at a time, and fry all over to brown them. Remove from the pan and set aside.", "Add the pancetta and cook until crisp. Add the whole baby shallots and stir until they have colour on them.", "Add the garlic, rosemary and thyme and cook for two more minutes.", "Put all the beef back into the pan and add the red wine and heat until the volume of liquid has reduced by half. Add the tomatoes and jus and then cook in the preheated oven with the lid on for 2-3 hours, or until the meat is cooked to your liking.", "For the mash, place the potatoes in a pan of cold water and bring to the boil. Cook for 15-20 minutes, drain and then put them back into the pan warm. ", "Keep on the heat for a minute and mash the potato. Add the butter and cream and mash until smooth.", "To cook the baby carrots, place all the ingredients in a pan with 500ml/18fl oz water and cook for 4-6 minutes, or until the carrots are cooked.", "When you are ready to serve, remove the casserole dish from the oven, take out the beef pieces and set aside. Heat the casserole on the hob with the lid off and reduce the liquid down in volume by half to a syrupy consistency.", "While the sauce is reducing, in a separate pan heat the butter and, once melted and hot, add the wild mushrooms and cook for 2-3 minutes and then sprinkle over the chopped parsley. ", "Add the mushrooms into the reduced sauce.", "Serve the Jacob’s Ladder beef pieces with the mushroom sauce, mashed potato and baby carrots."]}, {"isVegetarian": false, "title": "Braised lamb shank with bay and borlotti beans", "url": "www_bbc_co_uk_food_recipes_braised_lamb_shank_with_05514", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_lamb_shank_with_05514_16x9.jpg", "ingredients": ["2 tbsp olive oil", "2 lamb shanks ", "salt, to taste", "2 onions, roughly chopped", "1 stick celery, roughly chopped ", "1 litre/1¾ pint brown lamb stock", "4 bay leaves ", "2 lemons ", "50g/1¾oz sugar", "2 tbsp olive oil", "1 white onion, chopped", "2 merguez sausages, cooked", "3 garlic cloves, chopped", "1 x 400g/14oz tin borlotti beans, drained and rinsed under cold running water", "2 tbsp chopped flatleaf parsley ", "1 tbsp olive oil", "2 garlic cloves, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the braised lamb shank, preheat the oven to 150C/300F/Gas 2.", "Heat the oil in a heavy-based frying pan and season the shanks with a little salt, then add them to the hot frying pan. Colour all over as much as possible, and, once coloured, add to a casserole. ", "Tip the onion and celery into the frying pan and cook until softened. Add the vegetables to the casserole. Pour in the stock and add the bay leaves. Bring to the boil and skim off any impurities that rise to the top of the pan.", "Put a lid on the casserole and braise in the oven for 1½-2 hours.", "Remove from the oven and leave to rest in the braising liquor.", "Measure out 500ml/18fl oz of the braising liquor into a pan and cook until the liquid has reduced to a glaze (or sauce) consistency.", "For the borlotti beans, using a knife, peel the lemons and cut the peel into fine strips (like marmalade). Blanch the peel in a pan of boiling water and refresh in a bowl of ice cold water three times. ", "Juice the lemons and place in a saucepan with the sugar. Bring to the boil, then add the peel and cook until it becomes a light syrup.", "Heat a large frying pan and add the oil. Once hot, add the onion and fry with the mergeuz sausage until lightly coloured. Add the garlic and cook for a further two minutes. ", "Remove the sausages and slice into bite-sized pieces.", "Add the beans to the pan with half of the reduced braising liquor, the lemon syrup and most of the picked flatleaf parsley.", "To serve, heat the tablespoon of olive oil in a pan and fry the garlic until crisp. Drain on a plate lined with kitchen paper.", "Divide the beans between two plates, lay the braised shanks on top and brush the shanks with the remaining glaze. Garnish with the remaining parsley, one of the bay leaves each and the crispy garlic."]}, {"isVegetarian": false, "title": "Braised lamb shanks with dauphinoise potatoes", "url": "www_bbc_co_uk_food_recipes_braised_lamb_shank_with_57818", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil", "2 lamb shanks", "1 onion, roughly chopped", "2 garlic cloves, roughly chopped", "1 stick celery, roughly chopped", "1 carrot, peeled and chopped", "½ tsp black peppercorns", "2 sprigs fresh thyme ", "2 sprigs fresh rosemary", "2 bay leaves", "300ml/10fl oz red wine", "1 litre/1¾ pints lamb stock", "30g/1oz salted butter", "600ml/20fl oz double cream", "2 sprigs fresh thyme", "2 garlic cloves, thinly sliced", "6 large potatoes (Maris Piper or similar), thinly sliced on a mandolin", "salt and freshly ground black pepper ", "50g/2oz unsalted butter", "½ hispi or savoy cabbage, shredded"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "To make the lamb, heat the oil in a large ovenproof casserole dish over a medium heat. Brown the lamb shanks on all sides, then transfer them to a plate or board. Add the onion, garlic, celery, peppercorns and herbs to the pan and cook for 5 minutes. ", "Add the lamb back to the pan. Pour in the wine and simmer until reduced by half. Add the stock, cover with the lid and bake for 2½ hours, or until tender. ", "Meanwhile, to make the dauphinoise, place the cream, thyme and garlic in a saucepan and season with salt and pepper. Bring to the boil and remove from the heat immediately. ", "Lay some of the potatoes in a single layer in an ovenproof dish and cover with some of the cream mixture. Repeat this in layers until all the potatoes and cream have been used. Bake for 1–1¼ hours, or until golden and a knife easily goes all the way through.", "When the lamb is cooked, strain the liquid into a saucepan. Put the lamb shanks into a roasting tin and roast for 10–15 minutes to brown. Simmer the liquid over a medium heat until reduced to the consistency of double cream. Whisk in the butter and keep warm.  ", "If using hispi cabbage, heat a sauté pan, add the butter and cook until wilted. If using savoy cabbage, blanch it first in boiling water, drain and then cook in butter.", "Serve the lamb with the dauphinoise potatoes and cabbage and pour over the sauce. "]}, {"isVegetarian": false, "title": "Braised lamb shanks with colcannon mash", "url": "www_bbc_co_uk_food_recipes_braised_lamb_shanks_with_80478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 small lamb shanks (about 475g each)", "2 tbsp sunflower oil", "2 onions, finely chopped", "2 celery sticks, finely chopped", "2 carrots, finely chopped", "3 garlic cloves, crushed", "1-2 tbsp plain flour", "375ml/13fl oz red wine", "1 tbsp tomato purée", "2 tbsp roughly chopped fresh rosemary", "2 bay leaves", "750ml/1½ pint chicken stock", "4 tbsp finely chopped fresh mint", "2 tbsp finely chopped garlic", "2 tbsp finely grated lemon zest", "small handful fresh flatleaf parsley leaves", "1.25kg/2lb 12oz floury potatoes, peeled and cubed", "1 head savoy cabbage, washed and shredded", "75g/2½oz butter", "100ml/3½fl oz milk", "sea salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb shanks, place a really large casserole on a high heat. Season the lamb shanks all over. Add the oil and, working in batches, sear the lamb shanks all over until golden-brown, transferring them to a large plate as you go.", "Next, reduce the heat to medium and add the onions, celery and carrots to the pan. Cook for 6-8 minutes until soft but not coloured, adding the garlic for the last minute. Mix in the flour. ", "Increase the heat and then add the wine, allowing it to bubble down for a minute or two. Now add the tomato purée, then the rosemary and bay leaf. Season well with salt and pepper.", "Return the lamb shanks to the pan, pour over the stock and cover with a tight fitting lid. Bring to the boil and then reduce to a very gentle simmer for about 3 hours. Turn the shanks occasionally during this time. Once cooked, the meat from the lamb shanks should be really tender and just falling off the bone. ", "Meanwhile, prepare the gremolata. Simply toss the mint, lemon zest, parsley and garlic together in a small bowl. Cover and chill until serving.", "Half an hour before serving, prepare the mash. Cook the potatoes in a large pan of boiling salted water for 15-20 minutes or until tender. While the potatoes cook, steam the cabbage until just tender. Warm the milk and butter in a small pan until just boiling then remove from the heat. ", "Drain the potatoes well. Add the milk and butter mixture and mash until smooth. Stir the cabbage through to wilt completely and season to taste. Cover and keep warm.", "To serve, spoon a large dollop of creamy mash into the centre of each serving bowl or plate. Sit a lamb shank on top, spoon the sauce over and scatter generously with the gremolata."]}, {"isVegetarian": false, "title": "Braised lamb with salt baked potatoes and cottage cheese dressing", "url": "www_bbc_co_uk_food_recipes_braised_lamb_with_salt_86436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x rolled breast of lamb (500g/1lb 2oz–750g/1lb 10oz each)", "750ml/1⅓ pints chicken stock", "2 medium baking potatoes ", "200g/7oz pork fat", "100g/3½oz  coarse sea salt ", "1 green chilli, roughly chopped, to serve", "1 bunch of spring onions, finely chopped, to serve", "2 tbsp cottage cheese", "2 tbsp Greek-style yoghurt ", "1 garlic clove, crushed", "1 tbsp of dark French mustard ", "1 tbsp wholegrain mustard"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Pour the stock into a large saucepan and bring to a simmer. Add the lamb breasts and braise for 1–2 hours or until tender. Spoon off the rendered fat, place in a bowl and refrigerate. Remove the meat and allow to cool. Unroll and lay flat on a baking tray. Place another baking tray on top of the lamb and put in the fridge overnight until set.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Roll the potatoes in the pork fat. Roll generously in the coarse sea salt until covered. Wrap in kitchen foil and bake for 1 hour.", "Meanwhile, mix together all the dressing ingredients and set aside.", "Shred the lamb with two forks. ", "Place a frying pan over a high heat and add some of the rendered lamb fat. Add the lamb to the pan and fry until really crispy.", "To serve, cut the potatoes in half and divide between four plates. Top each potato with 3 tablespoons of dressing and a quarter of the shredded lamb. Garnish with the chilli and spring onions, serve immediately.  "]}, {"isVegetarian": false, "title": "Braised mutton with capers and caramelised onions", "url": "www_bbc_co_uk_food_recipes_braised_mutton_with_60536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/1¾oz thyme leaves", "15g/½oz Douglas fir pine", "20g/1¾oz coriander seeds", "20g/1¾oz chopped fresh rosemary", "200g/7oz sea salt", "2kg/4lb 2oz mutton shoulder, cut into 4 pieces", "1 tbsp olive oil", "1.5 litres/2½ pints chicken stock", "50g/2oz butter", "1 shallot, finely chopped", "2 tbsp fine capers", "3 tbsp chopped fresh chervil, chickweed and coriander leaves ", "50g/2oz caster sugar", "50ml/2fl oz white wine vinegar", "2 banana shallots, finely sliced", "2 red onions, halved, layers separated", "2 tbsp groundnut oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Grind the thyme, pine, coriander seeds and rosemary in a spice grinder or pestle and mortar and mix until a fine-powder consistency.", "Mix the spices with the salt in a large bowl. Coat the mutton pieces with the spices, cover with clingfilm and leave to marinate in the fridge for 24 hours.", "Once the meat has marinated, rinse off the salt under cold water and then pat the meat dry with a paper towel.", "Heat the oil in a frying pan on a high heat and fry the meat pieces for 2-3 minutes, or until the outer flesh is dark brown and starting to caramelise.", "Put the meat into a pressure cooker and cover with chicken stock. ", "Heat the cooker until it reaches full pressure and cook for 45 minutes.", "Remove the pressure cooker from the heat and strain the meat through a sieve, and gather the juices into a clean saucepan.", "Heat the meat juices until the mixture is reduced by two-thirds, or can coat the back of a spoon.", "Flake the meat using a fork. Add 150ml/5fl oz of the reduced stock and mix until well combined (reserve the remaining reduced stock). Season to taste with salt and freshly ground black pepper. ", "Once the meat has cooled, chill in the fridge for 1 hour, or until the mixture is firm to the touch.", "Cut a 40cm x 30cm/16in x 12in piece of cling film and place it onto a work surface. Shape the mutton mixture into a cylinder shape and place in the middle of the clingfilm. Wrap the clingfilm tightly around the mutton mixture and twist the end several times. Roll the mutton mixture to achieve a smooth cylinder. Chill in the fridge for 2-3 hours.", "Fry the butter in a frying pan over a high heat until it becomes dark brown in colour", "Add the reserved cooking liquor to the butter, along with the shallots and capers. Season with salt and black pepper.", "For the pickled shallots, place the sugar, vinegar and shallots into a bowl and mix until well combined.", "Meanwhile for the roast onions, heat the oil in a frying pan and add the onions. Fry until the onions caramelise and are tender. Remove the onions from the pan and drain onto kitchen paper. Season with salt and freshly ground black pepper.", "Unwrap the clingfilm from the mutton and carve the mutton into thick slices.", "Fry the mutton in a frying pan until brown on both sides then place in the oven to warm through. Add three tablespoons of the reduced stock cooking liquor to coat the mutton. Remove the meat from the pan and roll in the chopped herbs. ", "To serve, place the roast onions on top of the mutton, drizzle over with the sauce. Serve with the pickled shallots. "]}, {"isVegetarian": false, "title": "Braised ox cheek, pickled walnuts, smoked anchovy, glazed carrots and mash", "url": "www_bbc_co_uk_food_recipes_braised_ox_cheek_pickled_28513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ox cheeks, trimmed", "salt and freshly ground black pepper", "50ml/2fl oz vegetable oil", "100g/3½oz carrot, chopped", "100g/3½oz onion, chopped", "50g/1¾oz celery, chopped", "1 head of garlic, cut in half horizontally", "375ml/13fl oz red wine", "150ml/5fl oz Madeira", "100g/3½oz passata", "1.5 litres/2½ pints beef stock", "4 sprigs thyme", "4 bay leaves", "15g/½oz dried ceps", "4 juniper berries, crushed", "4 smoked anchovy fillets", "3-4 pickled walnuts, chopped", "2 tbsp chopped flatleaf parsley", "300g/11oz Chantenay carrots, cut in half lengthways", "75g/2½oz butter", "salt", "100g/3½oz carrot juice", "1 sprig tarragon", "squeeze of lemon juice", "1kg/2lb 4oz Maris Piper or Yukon Gold potatoes", "150ml/5fl oz hot milk", "150ml/5fl oz hot cream", "250g/9oz butter, diced, at room temperature"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Season the ox cheeks with salt and black pepper, cover and leave in the fridge for 24 hours until you are ready to cook.", "Preheat the oven to 160C/325F/Gas 3.", "Heat a heavy frying pan over a high heat, add the vegetable oil and sear the ox cheeks on all sides to colour. Transfer to a casserole dish.", "In the pan used to sear the ox cheeks, gently fry the vegetables and garlic until lightly caramelised. Add the wine and Madeira and cook until the volume of liquid is reduced by half. Add the passata and the beef stock. Bring to the boil and skim of any scum that rises to the surface.", "Add the thyme, bay, ceps, juniper berries, anchovies and two of the walnuts.", "Cover with a lid or aluminium foil, and cook in the preheated oven for 2-2½ hours, or until the meat is very tender.", "Remove from the oven, lift the cooked cheeks out onto a tray and cover with foil. Keep warm.", "Strain the cooking liquor into a clean pan and heat to reduce in volume until you have a good flavour and a sauce consistency. Keep the sauce warm until needed.", "For the glazed carrots, place the carrots in a single layer in shallow pan, add the butter, a pinch of salt and just enough carrot juice to cover. Bring to the boil, covered with a lid, and cook until tender – you may need to add a little water from time to time. When the carrots are just cooked remove the lid and reduce the cooking liquid until thick enough to glaze the carrots. Add a little lemon juice to taste. ", "For the mash, cut the potatoes into evenly-sized pieces, place in a pan with enough cold water to cover them and add a good pinch of salt. Bring to the boil, then reduce to a simmer for around 20 minutes or until tender.", "Drain well then return to the pan and dry fry over a low heat stirring for a few minutes.", "Mash the potatoes. While the potatoes are still hot, add the milk, cream and butter to your taste and mix to combine. Add salt if needed.", "To serve, divide the mash, ox cheek and carrots between four serving plates, warm the sauce adding the rest of the walnuts and the chopped parsley just before serving. Spoon the sauce over the cheeks."]}, {"isVegetarian": false, "title": "Braised pigs' cheeks with garlic-cumin potatoes", "url": "www_bbc_co_uk_food_recipes_braised_moorish-style_98800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 tbsp olive oil, for frying", "750g/1lb 10oz pigs' cheeks, preferably Ibérico pork or Gloucestershire Old Spot, trimmed of fat and sinew", "1 onion, chopped", "1 carrot, chopped", "4 garlic cloves, chopped", "½ tsp cumin seeds", "1 tsp smoked paprika", "2 tsp raisins", "200ml/7fl oz oloroso sherry", "750ml/1¼ pints good-quality beef or dark-chicken stock", "25g/1oz bitter chocolate", "700g/1lb 8oz waxy potatoes such as Desirée potatoes, peeled, cut into cubes", "1 tbsp olive oil, for frying", "3 garlic cloves, finely sliced", "1 tsp crushed cumin seeds", "125g/4½oz softened unsalted butter", "1 slice crusty white bread, crusts removed, cut into chunks", "70g/2½oz blanched almonds, preferably Spanish", "1 tsp fresh thyme leaves", "½ tsp grated orange zest", "small handful fresh flatleaf parsley leaves", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pigs' cheeks, preheat the oven to 150C/130C Fan/Gas 2.", "Heat the oil in an ovenproof casserole over a medium heat. Add the pigs' cheeks and fry for 1-2 minutes on all sides, or until browned all over. Remove from the casserole and set aside.", "Add the onion, carrots and garlic to the casserole and fry for 4-5 minutes, or until light golden-brown.", "Add the cumin, smoked paprika and raisins, stir well and continue to cook for a further 1-2 minutes.", "Pour in the sherry and bring to the boil, scraping up any burned bits from the bottom of the pan using a wooden spoon. Continue to boil until the volume of sherry has reduced by two-thirds.", "Return the pigs' cheeks to the casserole, the pour over the stock and return the mixture to the boil. Transfer the casserole to the oven and cook for 2-2½ hours, or until the pigs' cheeks are tender and the cooking liquid has reduced and thickened to a sauce.", "Meanwhile, for the garlic-cumin potatoes, boil the potato cubes in a pan of salted water for 8-10 minutes, or until tender. Drain well, mash using a potato ricer or masher, then set aside to cool.", "Heat the oil in a frying pan over a medium heat. Add the garlic and cumin and fry until the garlic is pale golden-brown.", "Mix together the mashed potatoes, garlic, cumin and the cooking oil in a bowl until well combined. Stir in the butter, then season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the picada, blend all of the picada ingredients to a thick paste in a food processor. Season, to taste, with salt and freshly ground black pepper.", "When the pigs' cheeks are cooked, remove the casserole from the oven and place it on the hob over a medium heat. Stir in the chocolate and the three-quarters of the picada and simmer for 2-3 minutes, or until the chocolate has melted and the sauce has thickened a little more. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the pigs' cheeks equally among 4 serving bowls. Spoon the potatoes alongside. Garnish each dish with some of the remaining picada."]}, {"isVegetarian": false, "title": "Braised ox cheeks with gentleman’s relish", "url": "www_bbc_co_uk_food_recipes_braised_ox_cheeks_with_52702", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_ox_cheeks_with_52702_16x9.jpg", "ingredients": ["2 x  ox cheeks, fat and skin removed, cut into 6 pieces", "50g/2oz plain flour", "1 tbsp oil ", "2 celery stalks, chopped", "1 leek, chopped", "2 carrots, chopped", "225ml/8fl oz red wine", "1 litre/1¾ pints beef stock", "150g/5oz salted anchovy fillets", "250g/9oz butter, cubed", "½ tsp cayenne pepper", "½ tsp ground nutmeg", "½ tsp ground cinnamon", "freshly ground black pepper", "½ lemon, juice only", "1 tbsp Worcestershire sauce", "½ garlic clove"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dredge the ox cheeks in flour and heat the oil in the casserole dish. Fry the cheeks until golden-brown all over, then remove from the dish using a slotted spoon.", "Add the vegetables to the casserole and cook for 2-3 minutes. Pour in the wine and scrape up any browned bits with a wooden spoon.", "Add the stock and bring to boil, return the ox cheeks to the dish, bring to a simmer and cook for 2-3 hours, or until the ox cheeks are very tender.", "Remove the cheeks from the sauce and boil for 4-5 minutes, or until the sauce has thickened. Strain the sauce, then return the ox cheeks back to the sauce.", "Meanwhile, for the relish, blend all the ingredients in a food processor until well combined. Spoon the butter onto a large piece of clingfilm, roll into a long sausage, then chill in the fridge.", "Serve the cheeks a slice of relish."]}, {"isVegetarian": false, "title": "Braised ox cheeks with roasted bone marrow, horseradish pomme purée and roasted carrots", "url": "www_bbc_co_uk_food_recipes_braised_ox_cheeks_with_73835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ox cheeks", "300ml/10½fl oz red wine", "100ml/3½fl oz port ", "1 small onion, roughly chopped", "2 stalks celery, roughly chopped", "1 large carrot, roughly chopped", "½ head garlic, smashed", "¼ bunch fresh thyme", "3g black peppercorns, crushed", "1 bay leaf", "150g/5½oz horseradish cream", "1kg/2lb 4oz Ratte potatoes", "75g/2½oz butter", "75g/2½oz milk ", "4 x 7.5cm/3in veal marrow bones", "250g/9oz chicken stock", "125g/4½oz unsalted butter", "salt and pepper", "4 small carrots, left whole", "50g/1¾oz unsalted butter", "½ sourdough loaf, crust removed, broken into breadcrumbs", "2 sprigs fresh thyme, leaves picked"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the braised ox cheeks, place all the ingredients in a large bowl and marinade for 24 hours. ", "When marinated, put everything in a large saucepan and bring to a simmer. Skim off any impurities which rise to the surface. ", "Simmer for 2-2½ hours, or until the ox cheeks are tender. Leave to cool in the cooking liquor.  ", "Once cooled, remove the ox cheeks from the liquor and strain the liquor through a fine sieve. Place the sieved liquor in a clean pan and bring to the boil. Reduce to a simmer and cook until the volume of liquid has reduced and the sauce has a glaze consistency. Keep warm until ready to serve.", "For the horseradish pomme purée, blend the horseradish cream in a food processor for five minutes, then pass through a fine sieve.", "In a pan of boiling salted water, cook the Ratte potatoes until they are tender. Drain and set aside to cool for a few minutes. When cool enough to handle, peel the potatoes and put them through a ricer. Stir in the butter, milk and horseradish cream to taste.", "For the roasted bone marrow, preheat the oven to 180C/350F/Gas 4. Place the veal marrow bones on a baking tray and roast in the oven for approximately 12 minutes, or until the marrow reaches a core temperature of 70C/158F on a meat thermometer. Remove from the oven and set aside.", "For the roasted carrots, put the chicken stock and 75g/2½oz butter in a saucepan and bring to the boil. Whisk to combine and season generously. Add the carrots and par boil. Add the remaining butter to a pan and heat until foaming. Add the carrots and cook until tender.", "For the breadcrumbs, melt the butter in a frying pan until foaming. Add the breadcrumbs and fry until crisp and golden-brown. Add the thyme leaves, stir through and leave to drain on a plate lined with kitchen paper.", "To serve, spoon the horseradish purée into a shallow serving bowl. Divide the ox cheeks among the bowls, placing it on top. Put the carrots and veal bones next to the ox cheek. Drizzle the sauce over and sprinkle with breadcrumbs.  "]}, {"isVegetarian": false, "title": "Braised lamb shanks with roasted sweet potatoes and spiced crisps", "url": "www_bbc_co_uk_food_recipes_braised_lamb_shanks_with_48541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lamb shanks (about 350g/12oz each)", "1 tbsp olive oil", "2 onions, thinly sliced", "1 garlic clove, crushed", "2 pinches saffron", "2 tsp cumin seeds", "100g/3½oz  hopped tomatoes or passata", "250ml/9fl oz chicken stock", "salt and freshly ground black pepper", "4 sweet potatoes, peeled", "1–2 tsp dried red chilli flakes", "sea salt", "olive oil, for drizzling", "4 garlic cloves", "1 tsp black peppercorns", "1 tsp coriander seeds", "2 tbsp honey", "1 tbsp olive oil", "8 sheets brick or filo pastry", "1 tbsp smoked paprika"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the lamb with the salt and pepper. Add the oil to a casserole dish and place over a high heat. Add the lamb shanks and braise for 10 minutes, or until browned all over. ", "Preheat the oven to 180C/160C Fan/Gas 4. Add the onions and garlic to the casserole dish, cook for 5 minutes and then add the saffron, cumin seeds, tomatoes and stock. Season well and bring to the boil. Cover and cook  for 2 hours. Increase the oven temperature to 200C/180C Fan/Gas 6.", "For the roasted sweet potatoes, place the potatoes on a baking tray lined with kitchen foil. Sprinkle over the chilli flakes and season with salt. Drizzle with olive oil, seal the potatoes in the foil and bake for 45 minutes. Leave the oven on. ", "For the spiced crisps, crush the garlic, peppercorns and coriander seeds in a mortar. Stir in the honey and oil to make a paste. Brush this mixture onto the brick sheets. Transfer the pastry sheets to a baking tray and bake for 10–15 minutes, or until crisp. Dust with the paprika then leave to cool and cut into strips. ", "Serve the lamb shanks with the roasted sweet potatoes on the side and garnished with the spiced crisps. "]}, {"isVegetarian": false, "title": "Braised pig cheeks with mashed potato and Bramley apple sauce", "url": "www_bbc_co_uk_food_recipes_braised_pig_cheeks_with_47819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "12 pig cheeks, trimmed", "1 large banana shallot, finely chopped", "1 large carrot, finely chopped", "2 celery sticks, finely diced", "2 garlic cloves, finely diced", "1 bouquet garni", "200ml/7fl oz red wine", "400ml/14fl oz veal jus or beef stock", "100g/3½oz unsalted butter, diced", "1kg/2lb 4oz fluffy potatoes, preferably King Edward, cut into chunks", "150g/5½oz unsalted butter", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "4 small carrots, cut in half at an angle", "75g/2¾oz butter", "2 tbsp caster sugar", "2 Bramley apples, peeled, cored and chopped", "50g/1¾oz butter", "2-4 tbsp caster sugar, to taste", "50g/1¾oz unsalted butter", "head of kale, leaves removed and roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2.", "Heat a large ovenproof dish on the hob, once hot add the olive oil. Fry the pigs cheeks in batches until they are golden-brown in colour, set aside. Add the shallot, carrots, celery and garlic and cook gently for 3-4 minutes. Add the bouquet garni and return the pig cheeks to the dish.", "Increase the heat and add the red wine. Cook until the liquid has reduced by half, then add the veal jus. Transfer the dish to the oven and cook for 2-2½ hours, or until the pig cheeks are tender.", "Remove from the oven and strain the liquid into a separate pot, keep the cheeks warm. Reduce the sauce by half and then gradually add the diced butter until you have a thick sauce. Put the cheeks in the sauce and warm through.", "Meanwhile, for the mashed potatoes, put the potatoes in a pan of salted water, bring to the boil. Then simmer for 15 minutes, or until tender. Drain and return the potatoes to the pan over the heat to remove any excess moisture. Mash well, add the butter and cream and beat to a smooth purée. Season with salt and pepper. ", "For the carrots, put the carrots, butter, sugar and 200ml/7fl oz water in a lidded pan and bring to a simmer. Cover and cook gently for 4-5 minutes, or until the carrots are tender. Season with salt and pepper.", "For the Bramley apple sauce, put the apples, butter and 50ml/2fl oz water in a lidded saucepan, cover and place over a medium heat. Cook until the apple has broken down, this should take about 4-5 minutes. Then beat with a spoon to form a purée, season with sugar and salt to taste.", "For the buttered kale, heat the butter in a frying pan. Add the kale leaves and 2 tablespoons of water and cook until wilted.", "To serve, put a spoonful of the mash potato in a serving bowl, place the pigs cheeks on top and spoon over the sauce. Serve the carrots, kale and apple sauce alongside."]}, {"isVegetarian": false, "title": "Braised pork belly with mushrooms", "url": "www_bbc_co_uk_food_recipes_braised_pork_belly_with_35944", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz whole dried shiitake mushrooms ", "1 small bunch spring onions, one thinly sliced, the rest cut into 4cm/1½in lengths", "2 tbsp vegetable oil", "5cm/2in piece fresh root ginger, peeled and finely chopped", "3 garlic cloves, finely chopped", "1 star anise ", "1 piece cassia bark", "800g/1lb 12oz pork belly (ideally a 5-layered cut – skin/fat/meat/fat/meat), cut into cubes", "3 tbsp Shaoxing rice wine ", "3 tbsp dark soy sauce ", "1 tbsp light soy sauce ", "2 tbsp caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Soak the mushrooms in boiling water for 15 minutes. ", "Heat the oil in a large lidded saucepan over a medium-high heat. Fry the lengths of spring onion with the ginger, garlic, star anise and cassia bark for 3–4 minutes, or until fragrant.", "Add the pork and cook until it starts to brown. (Fry in batches, if necessary). ", "Add the rice wine, soy sauces, sugar, mushrooms and their soaking liquid and enough water to cover the pork. Cover the pan and simmer gently for 1½–2 hours, or until the pork is really tender and falling apart. ", "Remove the lid, turn up the heat and cook uncovered over a high heat for 10–15 minutes until the volume of the sauce reduces by half and is thick and syrupy. ", "Adjust the seasoning to taste, scatter with the sliced spring onion and serve with steamed rice. "]}, {"isVegetarian": false, "title": "Braised rabbit with chilli, garlic and artichokes with roasted fennel", "url": "www_bbc_co_uk_food_recipes_braised_rabbit_with_62688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 whole rabbit including legs, jointed, diced, including bone", "1 red chilli, seeds removed and chopped", "2 garlic cloves, sliced", "2 sprigs rosemary, finely chopped", "4 baby artichokes, prepared and sliced", "1 lemon, zest and juice", "300ml/10fl oz white wine ", "400ml/14fl oz chicken stock", "2 tbsp olive oil", "2 bulbs fennel, trimmed and quartered", "2 tbsp flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rabbit, heat a large sauté pan and add the oil. Once hot add the rabbit and seal on all sides until golden-brown. Add the chilli, garlic and rosemary and cook for 2 minutes. Then add the artichokes and lemon zest and cook for a further minute.", "Add the wine and cook until reduced in volume by half. Add the chicken stock and cook for 30-40 minutes, or until tender. Finish with some lemon juice.", "Meanwhile, for the roasted fennel, preheat the oven to 180C/160C Fan/Gas 4. ", "Heat a frying pan and add the oil, once hot add the fennel wedges and cook on each side until golden-brown. Roast in the oven for 10-15 minutes, or until soft. Just before serving add the fennel to the rabbit and finish with the fresh parsley."]}, {"isVegetarian": false, "title": "Braised rabbit with fennel and pastis and chickpea purée", "url": "www_bbc_co_uk_food_recipes_braised_rabbit_with_63312", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.5kg/3lb 5oz farmed rabbit (ask your butcher to joint the rabbit into 2 legs, 2 shoulders, with the saddle and rack cut into 4. Keep the kidneys intact)", "2 tbsp Dijon mustard ", "1 tbsp olive oil, plus extra for drizzling", "1 onion, roughly chopped", "2 garlic cloves, roughly chopped", "1 large fennel bulb, roughly chopped", "1 lemon, juice only", "250ml/9fl oz pastis", "4 slices smoked ventreche or pancetta", "sea salt and freshly ground black pepper", "1 tbsp roughly chopped fennel tops or fresh dill, to serve", "1 x 400g tin cooked chickpeas, drained", "2 garlic cloves, chopped", "150ml/5fl oz extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Place the rabbit in a large bowl and smother with the mustard. ", "Heat the oil in an ovenproof pan and gently fry the onion, garlic and fennel for 2 minutes. Add the rabbit, lemon juice and pastis and season with salt and pepper. Lay the ventreche on top.", "Cover with a tight-fitting lid and bake for 1–1¼ hours. Leave to cool for 15 minutes. ", "To make the chickpea purée, blend the chickpeas and garlic in a food processor and gradually add the olive oil until a smooth purée is formed. Warm through in a saucepan.", "Transfer the rabbit to serving bowls. Drizzle with a little olive oil and sprinkle over the fennel tops. Lay the cooked ventreche on top and serve with the chickpea purée."]}, {"isVegetarian": false, "title": "Braised shin of beef with parsnip purée", "url": "www_bbc_co_uk_food_recipes_braised_shin_of_beef_43227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4kg/9lb beef shin, on the bone", "sea salt and freshly ground black pepper", "olive oil, for frying", "2 carrots, chopped", "1 onion, chopped", "1 celery stalk, chopped", "1 garlic clove, crushed", "2 star anise", "400ml/14fl oz red wine", "100ml/3½oz port", "1 pig's trotter", "300ml/10fl oz beef stock", "425ml/15fl oz stout", "4 tbsp dark soy sauce", "2 tbsp fish sauce", "1kg/2lb 4oz parsnips, cut into small cubes", "2 shallots, finely chopped", "200ml/7fl oz milk", "100ml/3½fl oz cream", "2 bay leaves", "1 tbsp olive oil", "½ lemon, juice only"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Trim most of the excess fat from the beef shin, leaving on some for colour and flavour. Prepare the beef by taking the meat off the bone in seams and cut into big chunks. Season well with sea salt and freshly ground black pepper. Heat a little oil in a frying pan and fry the pieces of beef until browned on all sides.", "Heat a little more oil in a heavy-based flameproof casserole. Add the vegetables and star anise and cook briefly until the vegetables are just soft. Pour in the red wine and port and bubble until the liquid has reduced by half. Add the beef and pig's trotter and cover with the stock. Bring to the boil, skimming off any scum that rises to the surface, then add the stout, soy sauce and fish sauce. Transfer to the oven and cook for three hours, or until the meat is very tender.", "Take the casserole out of the oven, remove the meat from the pan and keep warm. Strain the cooking liquid, return it to the pan and bring to the boil. Let it bubble until the sauce is thick then season with sea salt and freshly ground black pepper. Take the pig's trotter out of the meat mixture and reserve the meat – it is delicious on toast. Return the beef to the pan and put it back in the oven for a further 30 minutes.", "Meanwhile, make the parsnip purée. Place the parsnips and shallots into a saucepan with the milk, cream and bay leaves and cover with water. Add the olive oil and lemon juice and a good pinch of salt and bring to the boil. Reduce the heat and simmer gently for 15-20 minutes. Drain the vegetables, reserving the cooking liquid, and discard the bay leaves. Place the vegetables in a food processor and blend with enough cooking liquid to make a purée with the consistency of whipped cream. Season with salt and freshly ground white pepper and keep warm.", "Spoon the meat onto warmed plates and serve with the parsnip purée."]}, {"isVegetarian": false, "title": "Braised steak with gravy", "url": "www_bbc_co_uk_food_recipes_braised_steak_with_gravy_24508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_steak_with_gravy_24508_16x9.jpg", "ingredients": ["4 braising steaks (about 200g/7oz each)", "3 tbsp sunflower oil", "1 medium onion, halved and cut into 12 wedges", "1 garlic clove, crushed", "500ml/18fl oz beef stock made with 1 beef stock cube, or 500ml/18fl oz fresh beef stock", "1 tbsp tomato purée", "1 tbsp chopped fresh thyme, or ½ tsp dried thyme", "1 bay leaf", "1 tsp cornflour", "½ tsp English mustard powder", "salt and freshly ground black pepper", "Homemade chips, (see recipe in link)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. ", "Trim off any hard fat from the beef and season on both sides with salt and lots of freshly ground black pepper. ", "Heat a tablespoon of the oil in a large non-stick frying pan.", "Fry the steaks, two at a time, over a medium-high heat for a couple of minutes on each side, or until nicely browned, then transfer to a large flameproof casserole dish. Add a little more oil to the pan if necessary.", "Return the pan to the hob and reduce the heat. Add the remaining oil and gently fry the onion for five minutes, or until softened and lightly browned, stirring regularly. ", "Stir in the garlic, cook for one more minute, then transfer the onion and garlic to the casserole dish. ", "Pour over the stock and add the tomato purée, thyme and bay leaf. ", "Bring to the boil, then cover the casserole and transfer carefully to the oven. Cook for 1¼-1½ hours, or until the beef is very tender.", "Mix the cornflour and mustard powder in a small bowl and stir in a tablespoon of cold water until smooth. Remove the lid from the casserole dish and stir in the cornflour mixture. Season to taste with salt and freshly ground black pepper.", "Place the casserole over a medium-high heat and simmer for 2-3 minutes, or until the gravy reduces and becomes thickened and glossy, stirring regularly. ", "Transfer the steaks to four warmed plates and spoon over the gravy. Serve with chips."]}, {"isVegetarian": false, "title": "Braised sweetcorn and wood pigeon", "url": "www_bbc_co_uk_food_recipes_braised_sweetcorn_and_80968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 sweetcorn cobs, husks removed", "4 wood pigeon crowns", "salt and pepper", "2 tbsp vegetable oil", "20 baby onions, peeled", "1 carrot, cut into strips", "2 rashers smoked streaky bacon, chopped", "300ml/10fl oz sweetcorn stock (from above)", "100g/3½oz cooked sweetcorn kernels (from the sweetcorn stock)", "50g/1¾oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweetcorn stock, preheat the oven to 200C/400F/Gas 6.", "Place the sweetcorn on a baking tray and cook in the oven for 20 minutes. Set aside to cool.", "When the sweetcorn is cooled, stand the cobs upright on a chopping board, and cut down as close as possible to the core to remove the kernels. Set aside the kernels and cut the cores of the sweetcorn in half and place them in a large saucepan. Cover them with the water and bring to the boil. Simmer for 20 minutes, then strain into a jug and set aside, reserving both the stock and the kernels.", "For the braised sweetcorn and wood pigeon, reduce the oven temperature to 160C/320F/Gas 3.", "Season the wood pigeon with salt and pepper and heat a large frying pan.", "When the pan is hot, add one tablespoon of the oil and place the pigeons into the hot pan. Cooked until coloured all over, and then place them in the oven for 10-12 minutes. The pigeons are done when the thickest part of the thigh is pierced with a skewer and the juices run clear. ", "When cooked, place the pigeon crowns on a plate, cover and set aside to rest for 10-12 minutes.", "Bring a saucepan of water to the boil and blanch the onions and carrots for 2-3 minutes. Drain and refresh in ice-cold water. Remove the onions and carrots and place on a plate lined with kitchen roll.", "Heat a large frying pan and add the remaining tablespoon of oil. Once hot, add the bacon and cook until crisp and golden-brown. Add the onions and cook for a further two minutes.", "Cover the bacon and onions with the sweetcorn stock and bring to the boil. Add the sweetcorn kernels and carrots and simmer for five minutes.", "Add the butter, season with salt and pepper and set aside in a warm place while you remove the pigeon meat from the carcass.", "To serve, pour the sweetcorn and bacon soup into a large serving bowl and arrange the pigeon meat on top."]}, {"isVegetarian": false, "title": "Braised turbot in beer with bacon, shallots and peas", "url": "www_bbc_co_uk_food_recipes_braised_turbot_in_beer_52606", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 rashers streaky smoked bacon ", "1 tbsp light rapeseed oil", "100g/3½oz unsalted butter", "20 small shallots, peeled and left whole", "12 garlic cloves, peeled and left whole", "1 sprig rosemary", "100ml/3½fl oz red wine vinegar", "750ml/26fl oz beer", "500ml/18fl oz fish stock", "1 x 1.5kg/3lb 5oz turbot, fins trimmed, split down the centre and cut into steaks with the bone in", "200g/7oz peas fresh or frozen", "3 tbsp chopped fresh flatleaf parsley, plus extra for garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the grill and cook the bacon until crisp. Set aside to cool and then chop into small pieces. ", "To make the braising liquid, heat a large pan and add the oil and 75g/2½oz of the butter. ", "When the oil is hot, add the shallots and the garlic. Cook for four minutes and then add the rosemary and cook for a further two minutes so the garlic and shallots begin to colour. ", "Add the vinegar and cook until reduced in volume to almost nothing. ", "Add the beer and reduce in volume again to half the amount.", "Add the fish stock and bring to the boil. Skim off any impurities that rise to the top and simmer for five minutes. ", "To cook the fish, place the portions into the beer liquor and cover with foil, with the foil touching the surface of the liquid. Cook on a low heat for 12 minutes. Remove the foil and carefully turn the fish and add the peas and parsley. Cook for one minute and remove from the heat. ", "Warm a large serving platter, then carefully remove the fish from the beer and place it onto the platter.", "Heat the braising liquor and whisk in the remaining 25g/1oz butter. Season to taste with salt and pepper.", "To serve, spoon some of the liquor over the fish and sprinkle over the crisp bacon and a little more parsley."]}, {"isVegetarian": true, "title": "Braised bean curd with garlic and pepper", "url": "www_bbc_co_uk_food_recipes_braisedbeancurdwithg_8815", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cloves garlic, crushed", "2 tsp coriander root, chopped", "2 tsp light soy sauce", "1 tsp sugar", "4 tbsp groundnut oil", "1 tsp sesame oil", "1 packet firm tofu (bean curd), cut in half horizontally, then each piece cut into 8 triangles (16 triangles in total)", "6 tbsp groundnut oil", "150ml/5fl oz vegetable stock", "2 tbsp light soy sauce", "1 tbsp tomato purée", "1 tbsp rice or white wine vinegar", "1 heaped tsp arrowroot", "1 tsp coarsely ground black pepper", "2 tsp sesame oil", "For garnish:", "½ cucumber, halved and sliced thinly", "4 spring onions, shredded"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make the marinade, grind all the ingredients together in a pestle and mortar to form a paste. ", "Place the beancurd triangles in a flat dish and cover with the marinade. Leave for at least 30 minutes (or overnight). ", "Heat the oil and fry the marinated beancurd until golden brown on both sides. Remove from the pan and drain on kitchen paper. ", "Tip out any excess oil remaining in the pan, then place the vegetable stock, soy sauce, tomato purée and vinegar into the pan together with the arrowroot which should be made into a paste with a little water. Bring to the boil, stirring to thicken, and return the beancurd to the pan to heat through. ", "Remove the pan from the heat and stir in the black pepper and sesame oil.", "Tranfer to a serving dish and garnish with cucumber and spring onions."]}, {"isVegetarian": false, "title": "Braised beef short ribs with salsify and bashed neeps", "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_85339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz beef short ribs, cut through the bone to 10cm/4in lengths ", "salt and freshly ground black pepper", "2 tbsp flour", "2 onions, peeled, roughly chopped", "2 celery sticks, roughly chopped", "1 carrot, peeled, roughly chopped", "1 tsp tomato purée ", "330ml/11½fl oz Innis and Gunn beer, or similar bottle ale or beer", "2 litres/3½ pints beef stock", "1 bay leaf", "few sprigs fresh thyme", "3 garlic cloves, peeled, roughly chopped", "5 black peppercorns", "6-8 salsify sticks, peeled, cut at an angle into 2.5cm/1in pieces", "salt and freshly ground black pepper ", "25g/1oz butter", "1 tbsp chopped fresh parsley", "400g/14oz turnips or swede, peeled, cut into chunks", "50g/2oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, preheat the oven to 220C/430F/Gas 7.", "Season the beef ribs with salt and freshly ground black pepper and dust with half of the flour. Place them in a roasting tray with the onion, celery and carrot and roast in the oven for 30-40 minutes, turning every so often, until nicely browned.", "When cooked, transfer the vegetables and ribs to a heavy-bottomed saucepan, leaving the fat and juices behind, and set aside.", "Put the roasting tray with the fat and juices over a low heat.  Add the remaining flour and the tomato purée and cook for one minute, stirring. Gradually add the beer and beef stock, stirring well to avoid lumps forming. Bring to the boil.", "Pour the beer gravy into the pan with the ribs and vegetables and place over a medium heat. Add the bay leaf, thyme, garlic and peppercorns. Season with salt and freshly ground black pepper and cover.  Bring to the boil, then lower the heat and simmer gently for 1½-2 hours, or until the meat is tender: it should be almost falling off the bone without being too soft.", "Remove the ribs and vegetables with a slotted spoon, discarding the vegetables. Continue simmering the sauce until it reduces and thickens to a rich gravy-like consistency. You can add a little cornflour mixed in water if it's not thick enough.", "For the salsify, place the salsify in a saucepan with salted water and bring to the boil. Lower the heat and simmer for 6-8 minutes, until tender.", "Drain and toss in the butter and parsley and season with salt and freshly ground black pepper to taste.", "For the bashed neeps, place the turnips or swede into a saucepan of water and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until tender.", "Drain and return to the pan. Add the butter. Mash the turnips to a purée with a potato masher then season with salt and freshly ground black pepper.", "To serve, reheat the ribs in the sauce. Serve with a spoonful of bashed neeps, the salsify and a generous spoonful of sauce."]}, {"isVegetarian": false, "title": "Braised beef", "url": "www_bbc_co_uk_food_recipes_braisedbeef_10377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1¾ lb beef topside or round shoulder", "20ml/¾fl oz oil", "100g/3½oz mirepoix - see below", "60g/2oz bacon trimmings, blanched", "1 garlic clove, with skin on", "200g/7oz fresh tomatoes, cut in quarters ", "salt,  pepper", "500ml/17fl oz  red wine", "500ml/17fl oz brown stock", "a little cornflour", "carrots, baby leek, pearl onions ", "mange tout, blanched", "button mushrooms", "1 carrot", "fresh thyme", "fresh rosemary", "1 small onion", "1 stick celery", "1 tbsp tomato purée"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the meat with salt and pepper.", "Brown the meat in oil. Remove the meat from the pan.", "Add the mirepoix ingredients to the pan along with the bacon, garlic, tomatoes and purée to the pan. Cook till softened.", "Add the brown stock to the pan and stir. Reduce the liquid until it is a syrupy consistence.", "Return the meat to the pan. Deglaze the meat with the wine or marinade.", "Cover the pan and braise the meat until tender 180C/350F/Gas 4 for approximately 1½hrs turning occasionally. ", "Remove the meat from the pan. Reduce the sauce and if necessary bind with cornstarch. ", "Strain the sauce and skim the fat. Season to taste adding a little more of the brown stock.", "Place the meat on a serving dish. Pour a small quantity of sauce over the carved meat before serving.", "Garnish with the blanched carrots, baby leek, pearl onions, mange tout, button mushrooms fried in a little butter with the remaining bacon."]}, {"isVegetarian": false, "title": "Braised beef short ribs with horseradish mash", "url": "www_bbc_co_uk_food_recipes_braisedbeefshortribs_93391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2kg/4lb 4oz short beef ribs", "2 carrots, peeled, cut into pieces", "1 large onion, peeled, thickly sliced", "5 garlic cloves, peeled", "2-3 sprigs fresh thyme", "400g/14oz canned chopped tomatoes", "350ml/12fl oz red wine", "200ml/7fl oz beef stock", "salt and freshly ground black pepper", "2kg/4lb 4oz potatoes, peeled, cut into large pieces", "110g/4oz butter", "200ml/7fl oz milk", "2-4 tsp creamed horseradish ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the ribs, preheat the oven to 170C/325F/Gas 3.", "Heat the oil in a large roasting tray over a medium to high heat. Add the beef ribs and fry, turning regularly, until browned on all sides.", "Add the carrots, onion and garlic and stir until coated in the oil and pan juices.", "Add the thyme sprigs, then pour in the chopped tomatoes, red wine and beef stock and mix well to combine. Bring the mixture to the boil, then transfer to the oven and cook, uncovered, for 2-2½ hours, or until the sauce has thickened and the meat is falling from the bones. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the horseradish mash, boil the potatoes in a pan of salted water for 15-18 minutes, or until tender. Drain well then return to the pan.", "Return the pan to the heat for a few seconds to drive off any excess moisture, then remove from the heat. Mash the potatoes until smooth using a potato masher or ricer, then beat in the butter and milk, using a wooden spoon. ", "Stir in the creamed horseradish until well combined, then season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the beef ribs equally among four serving plates. Spoon over the cooked vegetables and sauce. Place a dollop of mash alongside each serving."]}, {"isVegetarian": false, "title": "Braised belly of pork", "url": "www_bbc_co_uk_food_recipes_braisedbellyofpork_11369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange,  peel only", "10 juniper berries ", "1 star anise ", "10g/½oz peppercorns ", "5cm/2½in piece ginger, peel only", "1 x 1kg/2¼lb  piece of belly pork ", "1 onion, cut in half, each half studded with 3 cloves", "6 shallots, peeled", "4 carrots, cut in half lengthways", "8 garlic cloves, peeled", "2 large leeks, cut into 5cm/2in pieces", "1 tsp chicken bouillon", "1litre/1¾pt chicken stock", "1 bouquet garni (parsley stalks, thyme, bay leaf and celery bound with leek)", "3litres/5¼pt water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the orange peel, juniper berries, star anise, peppercorns and ginger peel in a piece of muslin cloth and secure with string.", "Place the muslin parcel and the remaining ingredients into a saucepan of water and bring to the boil, then reduce the heat until the mixture is simmering and cook for 2-3 hours. Remove from the heat and set aside to cool.", "Once cool,  remove the belly of pork from its cooking liquid and place onto a chopping board.", "Remove the excess fat and cut into slices. ", "Strain the remaining mixture through a sieve, reserving the liquid and vegetables. ", "Cut the vegetables into smaller pieces and place back into the strained liquid along with the sliced belly of pork.  ", "Serve with crushed new potatoes."]}, {"isVegetarian": true, "title": "Braised cabbage with Shetland black potatoes", "url": "www_bbc_co_uk_food_recipes_braisedcabbagewithsh_79107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2 Shetland potatoes, chopped into 1cm cubes", "200g/7oz savoy cabbage, shredded", "3 sprigs fresh thyme", "handful fresh coriander", "1 lemon, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Add the potato and cook for six minutes, until golden and soft.", "Add the savoy cabbage and thyme sprigs and sauté for a further four minutes.", "Add the coriander and lemon juice and stir in gently.", "To serve, place in a large bowl."]}, {"isVegetarian": false, "title": "Braised chicken wings and seared scallops with hazelnuts", "url": "www_bbc_co_uk_food_recipes_braisedchickenwingsa_93748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 chicken wings, tips removed", "salt and freshly ground black pepper", "50g/2oz butter", "1 small onion, peeled, finely diced", "1 medium carrot, peeled, cut into small dice", "1 celery stick, cut into small dice", "110ml/4fl oz white wine", "500ml/18fl oz chicken stock", "1 tsp fresh thyme leaves", "50g/2oz hazelnuts, toasted, finely chopped", "2 tsp olive oil", "8 medium scallops", "1 lemon, juice only", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the braised chicken wings, season the chicken wings, to taste, with salt and freshly ground black pepper.", "Heat the butter in a frying pan until foaming and fry the chicken wings, skin-side down, for 2-3 minutes, or until golden-brown. Remove from the pan and set aside.", "Add the onion, carrot and celery to the pan and fry for 2-3 minutes, or until softened. ", "Pour in the white wine, bring the mixture to the boil and cook until the volume of the liquid has reduced by half. ", "Return the chicken wings to the pan, pour over the chicken stock and bring to the boil. Reduce the heat and simmer for 30-40 minutes. Remove the pan from the heat and set aside to cool.", "Once cooled, remove the chicken wings from the pan, remove the wing bones and chill the meat in the fridge.", "For the scallops, heat the olive oil in a frying pan and fry the scallops for 1 minute, then carefully turn the scallops over and fry for 30 seconds. Remove the scallops from the pan and season to taste, with lemon juice and salt. ", "Add the chicken wings to the pan and fry for 2-3 minutes or until the skin is crisp.", "To serve, reheat the vegetables and stock and add the thyme and hazelnuts.", "Place 2 chicken wings and 2 scallops into each of 4 serving bowls and spoon of the stock and vegetables."]}, {"isVegetarian": true, "title": "Braised chestnuts in red wine gravy", "url": "www_bbc_co_uk_food_recipes_braisedchestnutsinre_8862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["For approximately 1 pint of gravy:", "170g/6oz dried chestnuts, soaked in cold water overnight ", "85g/3oz carrots, cut in half ", "85g/3oz celery, cut in half ", "85g/3oz leeks, cut in half ", "1 small onion, peeled and  cut in half ", "1 tsp crushed garlic ", "2 bay leaves", "2 cloves", "1 tsp juniper berries", "1 tsp black peppercorns", "sprig fresh thyme", "sprig fresh parsley", "2 tbsp butter or sunflower oil ", "570ml/1 pint water ", "570ml/1 pint red wine ", "2 tsp yeast extract ", "2 tbsp cornflour ", "1 tbsp tomato pureé"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Drain and rinse chestnuts, remove loose skins and discard any chestnuts with suspicious-looking holes. ", "Place chestnuts, carrot, celery, leek, onion, garlic, loose spices and butter/oil in a 1.5 litre/3 pint capacity saucepan. Fry together until the mixture starts to brown. Add water and wine, bring to the boil and simmer with lid on for 90 minutes. The chestnuts should be tender but not fall apart. ", "Strain stock into a clean pan, pick out chestnuts from vegetables and save as a garnish. Discard remaining vegetable mixture. ", "Mix yeast extract, cornflour, and tomato pureé to a paste with 4 tbsp cold water and stir into the hot chestnut stock. Bring to the boil stirring frequently, simmer for 5 minutes until thickened.", "Serve with a nut roast."]}, {"isVegetarian": false, "title": "Braised lemon and honey chicken with feta salad", "url": "www_bbc_co_uk_food_recipes_braisedchickenwithle_83777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1.6 kg/3lb 8oz chicken, cut into 8 pieces", "1 red onion, sliced", "12 garlic cloves, peeled but left whole", "1 lemon, cut into chunks", "175ml/6fl oz chicken stock", "125g/4½ oz honey", "small handful fresh oregano leaves", "400g/14oz tin chickpeas, rinsed and drained", "150g/5oz feta cheese, crumbled", "small handful fresh flatleaf parsley", "2 Lebanese cucumbers, chopped", "1 green pepper, core and seeds removed, chopped", "50g/2oz black olives, pitted and halved ", "3 tbsp olive oil", "1 tbsp lemon juice", "sea salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat a large frying pan over high heat, add the oil and chicken and cook for five minutes until golden.  ", "Remove and set aside.", "Reduce the heat to medium-high, add the onion and cook for one minute.", "Add the garlic and cook for one minute.", "Return the chicken to the pan with the lemon, chicken stock and honey, reduce the heat, cover the pan and simmer for 20 minutes or until the chicken is cooked through.", "Lift out the chicken and put on a baking tray.", "Increase the heat under the sauce, and simmer, uncovered for another 15 minutes to thicken.", "Place the chicken under a hot grill for five minutes until crisp.  ", "Arrange the chicken on a platter, drizzle with the sauce and sprinkle with oregano.", "For the salad, gently mix together the chickpeas, feta, parsley, cucumber, green pepper and olives in a large bowl. ", "Whisk the olive oil and lemon juice and season with salt and pepper.", "Toss the dressing with the salad. ", "Serve."]}, {"isVegetarian": false, "title": "Braised lamb shanks with pearl barley and root vegetables", "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_88343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "4 lamb shanks, trimmed of any excess fat", "2 tbsp pearl barley", "300ml/10fl oz lamb stock (or water)", "1 fresh thyme sprig", "½ tsp dried thyme", "1 sprig fresh parsley", "1 tsp salt", "150g/6oz carrots, roughly chopped", "1 large leek, cut into eight equal pieces", "4 small potatoes, peeled, quartered", "2 small onions, quartered", "salt and freshly ground black pepper ", "4 heaped tbsp flatleaf parsley leaves, blanched and refreshed in cold water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3.  ", "Heat the oil in a large frying pan over high heat. Add the lamb shanks and fry, turning occasionally, until golden-brown on all sides.", "Transfer the lamb shanks to a large flameproof casserole or ovenproof pan with a lid, and add the barley, stock or water, herbs, and salt. Cover tightly with foil and then with the lid, and cook in the oven for 1½ hours.", "Remove the casserole from the oven, add the vegetables and a little more water if needed. Season, to taste, with salt and freshly ground black pepper, then re-cover the casserole, and return it to the oven for another hour.", "Remove the casserole from the oven and check that the lamb is moist and almost falling off the bone. If you think that it's not quite ready, return it to the oven for another 15 minutes and check again.", "Transfer the lamb shanks from the cooking pot to a warmed serving platter and cover with kitchen foil while you finish the braised vegetables.", "Place the casserole over a medium heat and bring the liquid to the boil. Reduce the heat and simmer. Add more water if required to provide a nice gravy.", "Add the blanched parsley leaves and season, to taste, with salt and freshly ground black pepper.", "To serve, ladle the braised vegetables onto warmed plates and place a shank on top of each portion."]}, {"isVegetarian": false, "title": "Braised lamb shanks with flageolet beans", "url": "www_bbc_co_uk_food_recipes_braisedlambshankswit_91429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lamb shanks", "salt and freshly ground black pepper", "1 tbsp olive oil", "350ml/12fl oz red wine", "1 onion, cut into quarters", "1 head garlic, cut in half horizontally", "2 sprigs fresh rosemary", "5 anchovy fillets", "1 litre/1¾ pints hot beef stock", "50g/2oz butter", "75g/3oz butter", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp chopped fresh rosemary", "4 tomatoes, skins and seeds removed, chopped", "400g/14oz canned flageolet beans, drained and rinsed", "3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lamb shanks, preheat the oven to 150C/300F/Gas 2.", "Season the lamb shanks with salt and freshly ground black pepper.", "Heat the oil in a large casserole over a medium heat. When the oil is hot, add the lamb shanks and fry on all sides until browned all over.", "Add the red wine and bring to a simmer. Continue to simmer until the volume of liquid has reduced by a third.", "Add the onion, garlic, rosemary and anchovy fillets and stir well to combine.", "Add enough of the hot beef stock to just cover the lamb (the bones should be protruding from the surface of the liquid). Return the mixture to a gentle simmer.", "Transfer the casserole to the oven and cook, uncovered, for three hours, turning the lamb shanks occasionally (about once every 45 minutes).", "Meanwhile, for the flageolet beans, heat half of the butter in a frying pan over a medium heat. When the butter is foaming, add the onion, garlic and rosemary and fry for 2-3 minutes, or until just softened.", "Add the tomatoes and cook for a further 2-3 minutes, or until they have broken down slightly. ", "Add the drained flageolet beans and stir until heated through. Season, to taste, with salt and freshly ground black pepper.  ", "Add the remaining butter and stir until the butter has melted. Add the parsley and stir well to combine.", "When the lamb shanks are cooked through, remove them from the cooking liquid and set aside on a warm plate.", "Return the casserole to the hob and bring the cooking liquid to the boil. Boil for 4-5 minutes, or until it has reduced slightly.", "Strain the reduced cooking liquid through a fine sieve into a clean saucepan, then season, to taste, with salt and freshly ground black pepper. Add the butter and whisk until it has melted and the sauce is glossy.", "To serve, divide the flageolet beans equally among four serving plates. Place one lamb shank on top of each. Drizzle the reduced sauce over and around the lamb shanks."]}, {"isVegetarian": false, "title": "Braised lemongrass-skewered plaice with creamy tomato and tarragon sauce and spinach", "url": "www_bbc_co_uk_food_recipes_braisedlemongrassske_89243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 plaice fillets", "salt and freshly ground black pepper", "2 lemongrass stems", "2 shallots, chopped", "2 garlic cloves, lightly crushed", "2 tomatoes", "50g/2oz butter", "110ml/4fl oz white wine", "175ml/6fl oz fish stock", "110ml/4fl oz double cream, lightly whipped", "2 sprigs fresh tarragon, leaves only, roughly chopped", "300g/10oz baby spinach"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Season the plaice with salt and freshly ground black pepper, then roll up like cigars. Cut one of the lemongrass stalks lengthways into four to create skewers and push a skewer through each plaice roll to secure.", "Butter a small ovenproof dish and add the shallots and garlic.", "Blanch the tomatoes for one minute in boiling water, then remove the skins and cut into quarters. Reserve the skins.", "De-seed the tomatoes and place the seeds and skin into the buttered dish with the shallots and garlic.", "Cut the tomato quarters into very small cubes and set aside.", "Heat a frying pan until hot and add half the butter and all the plaice rolls. Cook for one minute on each side, until just golden-brown. Place the plaice rolls into the dish and pour over the white wine and fish stock.", "Cover the dish with kitchen foil and place into the oven to cook for 7-10 minutes, until the fish is just cooked through.", "Remove from the oven and remove the plaice from the dish and set aside in a warm place.", "Pour the cooking liquid from the dish through a sieve into a clean frying pan. Simmer until reduced in volume by half.", "Add the reserved tomato pieces, the whipped cream, tarragon and the remaining stalk of lemongrass and warm through. Season with salt and freshly ground black pepper.", "Heat a separate frying pan until hot. Add the remaining butter and all of the spinach and cook until the spinach has just wilted down.", "To serve, place a spoonful of spinach into the centre of each of two plates. Top each with two rolls of plaice and spoon over the sauce."]}, {"isVegetarian": true, "title": "Braised lentils", "url": "www_bbc_co_uk_food_recipes_braisedlentils_89207", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "100g/3½oz brown lentils, rinsed", "1 bay leaf", "1 onion, chopped", "1 fresh red chilli, chopped", "400g/14oz tinned plum tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pot of salted water to the boil and add one tablespoon of the olive oil. Add the lentils and bay leaf and cook for 15 minutes, or until the lentils are tender. Drain well and set aside. ", "Heat the remaining oil in a frying pan and fry the onion for 5-6 minutes, or until the onion is soft and golden. Stir in the chopped chilli and cook for a further 1-2 minutes, then add the drained lentils and the tinned tomatoes with all of their juice. Season with salt and freshly ground black pepper, then lower the heat and allow to simmer gently for ten minutes.", "Spoon into serving bowls and serve immediately."]}, {"isVegetarian": false, "title": "Basic braised mince", "url": "www_bbc_co_uk_food_recipes_braisedmince_91963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedmince_91963_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "3 onions, chopped", "6 garlic cloves, chopped", "1 tsp chopped fresh thyme", "1 tsp chopped fresh rosemary", "1 kg/2¼lb beef mince ", "400g tin chopped tomatoes", "1 tbsp Worcestershire sauce", "3 beef stock cubes"], "serves": "Makes 2 x 1kg/2lb 4oz batches of mince", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the vegetable oil in a large pan over a high heat. Add the onions, garlic and herbs and fry for 3-4 minutes, or until softened and golden-brown. Turn off the heat and set the pan aside.", "Heat half a tablespoon of the remaining oil in a separate pan over a medium heat. Add a third of the beef mince and fry for 4-5 minutes, or until browned.", "Transfer the browned mince to the pan containing the onions, garlic and herbs. Repeat the process twice more with the remaining oil and the remaining batches of mince. (Overloading the pan will not speed things up because the pan will lose heat, so take your time.)", "Return the pan containing the cooked mince and vegetables to a medium heat. Add the tinned tomatoes and Worcestershire sauce and stir the mixture well to combine. Bring the mixture to a simmer.", "Meanwhile, crumble the stock cubes into a large heatproof jug and add 1 litre/1¾ pints of boiling water. Stir until the stock cubes have dissolved. Add the stock to the beef and bring to a simmer. Simmer for 1 hour, uncovered, or until the volume of liquid has reduced slightly and the sauce has thickened.", "The braised mince can be eaten straightaway, served with rice or spaghetti. See the tips sections for other ways to use the mince. "]}, {"isVegetarian": false, "title": "Braised pork cheeks with ginger carrots and Jersey Royal potatoes", "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_91132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 pork cheeks, trimmed of all fat and sinew", "salt and freshly ground black pepper ", "2 tbsp olive oil", "1 onion, chopped", "1 carrot, chopped", "50g/2oz ginger, chopped", "1 sprig fresh thyme", "2g coriander seeds, lightly crushed", "250ml/9fl oz ginger beer", "1 litre/1 pint 15¼fl oz chicken stock", "500g/1lb 2oz baby carrots, leaf bases left on", "1 tsp ground ginger", "1 tbsp honey ", "25g/1oz butter", "300g/11oz Jersey Royal potatoes, scrubbed", "25g/1oz butter"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork cheeks, season the pork cheeks with salt and freshly ground black pepper, to taste.", "Heat a deep frying pan until hot, add half of the oil and the cheeks and fry on both sides until golden-brown. Remove the cheeks from the pan and set aside.", "Add the other tablespoon of oil to the pan, then add the onion, carrot, ginger, thyme and coriander seeds and cook over a medium heat until golden-brown.", "Pour in the ginger beer and cook until the liquid has reduced to a syrupy glaze; then lay the cheeks on top of the vegetables.", "Pour over the chicken stock to cover, bring to the boil, then reduce the heat and simmer for one hour until the cheeks are tender. Remove the cheeks from the pan and set aside.", "Pass the braising liquid through a sieve into a clean pan and return to the heat. Simmer until thickened, then add the cheeks and mix to cover the cheeks in the glaze.", "For the ginger carrots, bring a pan of salted water to the boil, add the carrots and cook for two minutes, or until just tender. Drain and set aside.", "Heat a frying pan until hot, add the ground ginger and honey and bring to the boil.", "Whisk in the butter, add the cooked carrots and fry for one minute, or until golden-brown.", "Bring a pan of salted water to the boil, add the Jersey Royals and cook for 4-7 minutes, or until tender. Drain the potatoes, return to the pan and add the butter. Stir to coat.", "To serve, share the glazed cheeks among four plates, place the carrots alongside and pour any remaining sauce around the pork. Place the Jersey Royals on the side."]}, {"isVegetarian": false, "title": "Braised pork cheeks with polenta and squid", "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_93223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 pork cheeks, fat and sinew removed", "2 tbsp olive oil", "50ml/2fl oz red wine vinegar", "1 onion, peeled, chopped", "2 carrots, peeled, chopped", "150ml/5fl oz white wine", "1 tsp ground ginger", "1 tsp ground coriander", "1 tsp ground cinnamon", "1 tsp mixed spice", "2 star anise", "2 tomatoes, chopped", "1 garlic clove, peeled", "1 sprig fresh thyme", "1 bay leaf", "2 tbsp honey", "1 tbsp soy sauce", "1 litre/1¾pt chicken stock", "500ml/17½fl oz milk", "500ml/17½fl oz chicken stock", "175g/6oz quick-cook polenta", "25g/1oz grated parmesan", "25g/1oz unsalted butter", "salt and freshly ground black pepper", "25g/1oz butter", "200g/7oz curly kale", "1 tbsp olive oil", "1 medium squid, cleaned, scored, cut into triangles", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the pork cheeks, to taste, with salt and freshly ground black pepper.", "Heat one tablespoon of the olive oil in a non-reactive frying pan over a medium heat, and fry the pork cheeks for 4-5 minutes, or until browned on all sides. Remove the pork from the pan and set aside.", "Carefully drain the fat from the pan add the vinegar, scraping up any browned bits with a wooden spoon to deglaze. Remove from the heat.", "Heat the remaining olive oil in a frying pan and fry the onions and carrots for 2-3 minutes, or until softened.", "Add the white wine and spices and continue to cook until the volume of the mixture has reduced by half. ", "Place the pork cheeks and pan juices into the pan and add the remaining pork cheek ingredients. Bring the mixture to the boil, then transfer to the oven to cook for 1½-2 hours, or until the pork cheeks are tender.", "Remove the pork cheeks from the pan and set aside, then strain the cooking mixture through a sieve. Reserve the liquid and discard the vegetables.", "Cook the pork cheeks and reserved cooking liquid in a saucepan for 4-5 minutes, or until the liquid has reduced slightly and the pork cheeks are sticky and glazed.", "Meanwhile, for the polenta, heat the milk and stock in a saucepan and bring to the boil. Slowly whisk in the polenta and simmer for 4-5 minutes.", "Stir in the parmesan and butter and season, to taste, with salt and freshly ground black pepper.", "To serve, heat the butter in a frying pan and fry the kale for 4-5 minutes, or until wilted and tender. Heat the olive oil in a frying pan and fry the squid for 1-2 minutes, or until just cooked. Season, to taste, with lemon juice and salt and freshly ground black pepper. ", "Spoon some polenta onto each of 4 serving plates, top with the pork cheeks and squid and spoon the kale alongside."]}, {"isVegetarian": true, "title": "Braised red cabbage", "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_2528", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium red cabbage, quartered, cored and sliced", "2 red onions, peeled and sliced", "80g/3oz dried cranberries", "2 Bramley apples, peeled, cored and grated", "1 tsp ground cinnamon", "25g/1oz demerara sugar", "3 tbsp red wine vinegar", "Salt and pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/3325F/Gas 3.", "Mix the cabbage with the rest of the ingredients and put in an ovenproof dish.", "Season well and cover with foil. ", "Bake in the oven for 60-90 minutes until the cabbage is tender and juicy. Mix the ingredients together 2-3 times during cooking.", "Allow to cool and store in the fridge. Reheat when needed."]}, {"isVegetarian": false, "title": "Braised red cabbage with apples and sherry vinegar", "url": "www_bbc_co_uk_food_recipes_braisedredcabbagewit_87606", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedredcabbagewit_87606_16x9.jpg", "ingredients": ["50g/2oz butter", "1 medium onion, finely sliced", "2 dessert apples, peeled, cored and sliced", "1kg/2¼lb red cabbage, finely sliced", "100g/4oz sultanas or raisins", "200ml/7fl oz sherry vinegar", "salt and freshly ground pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a stainless steel or flameproof casserole over a medium heat (an aluminium pan will not work for this).", "Fry the onion in the butter for three minutes, then add the apple and cabbage.", "Cook for five minutes or so, until softened, then add the sultanas and the sherry vinegar.", "Place a lid on the pan and cook for one hour, until all the vegetables are just tender. ", "Season to taste with salt and freshly ground black pepper and replace the lid. Continue to cook until the cabbage is tender and all the liquid has evaporated. This dish will keep for several days, covered, in the fridge. Simply heat it up again when ready to serve."]}, {"isVegetarian": false, "title": "Braised red cabbage", "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_81485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30ml/1oz olive oil", "2 garlic cloves, sliced", "1 banana shallot, sliced", "50g/1¾oz streaky smoked bacon, chopped", "¼ red cabbage, shredded", "30ml/1fl oz red wine", "1 tbsp red wine vinegar", "1 tbsp brown sugar", "100ml/3½fl oz hot vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the garlic and shallot and fry for 2-3 minutes to soften.", "Add the streaky bacon and fry for 3-4 minutes, until golden.", "Add the red cabbage and continue to cook for five minutes.", "Add the red wine, vinegar and sugar. Bring to the boil, reduce the heat and simmer for 4-5 minutes, until the liquid volume is reduced by three quarters.", "Add the stock and simmer for another five minutes, until the cabbage is cooked through. ", "Season, to taste, with salt and freshly ground black pepper and pour into a large warm bowl to serve."]}, {"isVegetarian": true, "title": "Braised rice with mushrooms", "url": "www_bbc_co_uk_food_recipes_braisedricewithmushr_77787", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz rice", "½ pint/290ml chicken or vegetable stock", "75g/2½ oz mushrooms, sliced", "75g/2½ oz Romero pepper, sliced", "handful fresh mixed herbs, chopped", "30g/1¼oz butter"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Bring the rice and chicken stock to the boil in a large ovenproof pan. Place in the oven for ten minutes.", "Add in the mushrooms and peppers.  Cover with a lid and return to the oven for three minutes.", "Remove the rice from the oven and stir in the herbs and butter."]}, {"isVegetarian": false, "title": "Braised salmon with mustard and Gruyère herb crust, sautéed spinach and roasted vine tomatoes", "url": "www_bbc_co_uk_food_recipes_braisedsalmonwithmus_83759", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crumbed in a food processor", "25g/1oz Gruyère cheese, grated", "15g/½oz cheddar cheese, grated", "4 sprigs thyme, leaves picked", "4 tbsp curly parsley, roughly chopped", "50g/2oz butter, softened", "4 x 150g/5¼oz salmon fillets", "50ml/2fl oz fish stock", "50ml/2fl oz white wine", "50g/2oz Dijon mustard", "150g/6oz vine tomatoes", "2 tbsp balsamic vinegar", "1 tbsp olive oil", "25g/1oz butter", "4 handfuls spinach leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crust, put all the crust ingredients in a food processor and blend until smooth.", "Spread the mixture out on a lined baking tray and chill until set.", "For the salmon, preheat the oven to 200C/400F/Gas 6 and pour the fish stock and wine into an oven-proof dish. ", "Place the salmon fillets into the dish and season with salt and pepper.", "Brush with the mustard.", "Cut the crust into rectangles to cover the salmon place and on top.", "Cook in the oven for ten minutes, or until cooked through.", "Take the salmon out of the oven and leave to rest.", "Place the tomatoes on a baking tray, pour over vinegar and oil, season and roast alongside the in the oven for eight minutes.", "Heat a frying pan until hot then add the butter. When foaming, add the spinach and sauté for two minutes until wilted.", "To serve, place the spinach in the centre of the plate, place the salmon on top and the roasted tomatoes on the side."]}, {"isVegetarian": false, "title": "Braised Savoy cabbage with bacon", "url": "www_bbc_co_uk_food_recipes_braisedsavoycabbagew_68087", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedsavoycabbagew_68087_16x9.jpg", "ingredients": ["1 Savoy cabbage, cored and shredded", "110g/4oz smoked streaky bacon, derinded and chopped", "55g/2oz butter", "85ml/3fl oz dry white wine", "2 tbsp fresh chopped parsley", "2 tsp fennel seeds", "2 tbsp crème fraîche", "salt and freshly ground pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large pan. Add the bacon and cook for 3-4 minutes.", "Add the cabbage and mix all together. Add the wine and season well. Cover and cook gently for 10 minutes until the cabbage is tender.", "Stir in the fennel seeds, parsley and crème fraîche and serve."]}]