[{"isVegetarian": false, "title": "Magdalenas de tocino, huevo y queso", "url": "www_bbc_co_uk_food_recipes_bacon_egg_and_cheese_08419", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_egg_and_cheese_08419_16x9.jpg", "ingredients": ["4-6 tocino de lonjas de tocino", "4 huevos de gallinas camperas", "4 cucharadas de yogurt probiótico completo en grasa (o salsa de manzana preparada)", "4 cucharadas de harina de coco", "40g / 1½ oz de queso Cheddar maduro, rallado", "2 cebollas de primavera, cortadas, finamente cortadas", "pequeña col rizada, tallos resistentes eliminados, hojas finamente cortadas", "¼ cucharadita de polvo de hornear", "¼ cucharadita de sal", "gran pizca de pimienta negra recién molida"], "serves": "Rinde 4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190 ° C / 170 ° Ventilador / Gas 6. Línea 4 de los orificios de una lata de muffin grande con papel de hornear.", "Caliente una sartén antiadherente a fuego medio a alto. Agregue el tocino en tandas y fría hasta que estén crujientes. Dejar enfriar, luego cortar en trozos y reservar.", "Batir los huevos y el yogur juntos hasta que esté suave y aireado, luego mezcle los ingredientes restantes hasta que estén bien combinados.", "Divida la masa del panecillo por igual entre 4 de los orificios del molde para muffins preparado, o hasta que la mezcla alcance los tres cuartos de los lados.", "Hornee durante 18-20 minutos, o hasta que las partes superiores de los muffins estén doradas y un pincho insertado en el centro de los muffins salga limpio."]}, {"isVegetarian": false, "title": "Bacon rarebit con salsa picante de manzana", "url": "www_bbc_co_uk_food_recipes_bacon_rarebit_with_apple_45531", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_rarebit_with_apple_45531_16x9.jpg", "ingredients": ["150g / 5½oz de azúcar moreno claro y suave", "100 g / 3½ oz de sultanas", "125ml / 4½fl oz de vinagre de malta", "2 comiendo manzanas, sin corazón y más o menos picadas", "3 tomates, toscamente picados", "1 cebolla, finamente picada", "8 rebanadas de tocino seco curado en seco", "Queso cheddar maduro 350g / 12oz, rallado", "50ml / 2fl oz de cerveza", "1 cucharadita de mostaza inglesa", "3-4 guiones de salsa Tabasco", "1 cucharadita de salsa Worcestershire", "2 cucharadas de harina normal", "sal marina y pimienta negra recién molida", "4 rebanadas de pan blanco rebanado grueso"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa picante, caliente una sartén grande hasta que esté caliente. Agregue el azúcar morena y las pasas sultanas y caliente hasta que el azúcar se esté derritiendo. Agregue el vinagre y cocine hasta que esté completamente disuelto y comience a caramelizar.", "Agregue las manzanas, los tomates y la cebolla y cocine durante 10 minutos, o hasta que la manzana esté tierna y la mezcla espesa. Retirar del fuego y decantar en un recipiente esterilizado.", "Para la rarebit, precaliente la parrilla a alto.", "Coloque el tocino en la bandeja del horno y ase a la parrilla durante 4-6 minutos, o hasta que se dore por los bordes y recién cocido.", "Coloque el queso y la cerveza en una sartén y caliente suavemente hasta que el queso se derrita, burbujee y suavice, luego agregue la salsa de mostaza, tabasco y Worcestershire. Agregue la harina y cocine hasta que espese. Sazonar, al gusto, con sal y pimienta negra.", "Mientras tanto, tuesta el pan en cada lado y luego acuéstelo en un plato resistente al horno. Cubra con dos pedazos del tocino cocido y espolvoree la mezcla de rareza sobre la parte superior.", "Grill durante 2-3 minutos, o hasta que el relleno esté dorado y burbujeante. Sirve con una cucharada de chutney."]}, {"isVegetarian": false, "title": "Estrato de tocino", "url": "www_bbc_co_uk_food_recipes_bacon_strata_83356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 huevos de gallinas camperas", "500ml / 18fl oz de leche entera", "250g / 1lb 5½oz de queso ricotta", "Pan de masa fermentada de 125 g / 4½ oz, desgarrado en trozos pequeños", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "1 cebolla, finamente rebanada", "200g / 7 oz de tocino ahumado lardons", "175g / 6oz calabaza tostada asada, picada", "Mozzarella de búfalo 150 g / 5½ oz, picada", "1 cucharada de salvia fresca picada", "75g / 2¾oz de parmesano recién rallado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Batir los huevos y la leche en un bol. Agregue el queso y el pan y mezcle hasta que estén bien combinados. Sazonar con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén y freír la cebolla hasta que esté suave. Agregue el tocino y cocine hasta que estén dorados y crujientes. Agregue la calabaza, la mozzarella y la salvia", "Vierta la mitad de la mezcla de pan eggy en la base de un plato a prueba de horno de 25 cm / 10 in. Agregue la mitad de la mezcla de calabaza.", "Repita el proceso de estratificación en el punto 4. Termine rociándolo con parmesano y hornee en el horno durante 30 minutos, o hasta que la mezcla se haya fraguado y el queso burbujee en la parte superior.", "Sirva los estratos de tocino con vegetales verdes y pan de ajo."]}, {"isVegetarian": false, "title": "Tocino y salchichas envueltas en queso", "url": "www_bbc_co_uk_food_recipes_baconandcheesewrappe_78526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 salchichas", "2 cucharaditas de aceite vegetal", "55g / 2oz de queso cheddar maduro, en trozos", "2 rebanadas de tocino trasero, estirado con la parte posterior de un cuchillo"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén a fuego medio. Agregue las salchichas y cocínelas durante aproximadamente 5 minutos, de modo que todos los lados estén dorados y cocidos.", "Retirar de las salchichas de la sartén y enfriar. Una vez que estén lo suficientemente frías para manipular, haga hendiduras a lo largo de cada salchicha.", "Rellene el queso dentro de las ranuras, luego envuelva con el tocino.", "Coloque en el horno durante 5-10 minutos, o hasta que el tocino esté bien crujiente y las salchichas estén bien cocidas.", "Retire del horno y sirva en un plato caliente."]}, {"isVegetarian": false, "title": "Bacon gofres con huevos escalfados y salsa holandesa", "url": "www_bbc_co_uk_food_recipes_bacon_waffles_with_50318", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 250g / 9oz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "3 huevos de gallinas camperas", "425ml / 15fl oz de leche entera", "115g / 4oz de mantequilla sin sal, derretida", "8 rebanadas de tocino de estilo americano cocinado (o tocino ahumado sin corteza), picado", "1 chalote, finamente cortado en cubitos", "3 granos de pimienta", "1 hoja de laurel", "2 cucharadas de vinagre de vino blanco", "2 yemas de huevo grandes de gallinas camperas", "125g / 4½oz de mantequilla, derretida", "sal marina y pimienta negra recién molida", "2 cucharadas de vinagre de vino blanco", "4 huevos de gallinas camperas", "12 rebanadas de tocino rayado", "2-3 cucharadas de cebollines finamente picados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar un generador de gofres a la configuración media. Precalentar el horno a 135C / 275F / Gas 1.", "En un tazón grande mezcle la harina, el polvo de hornear, la sal y el azúcar. Agregue los huevos, la leche y la mantequilla derretida hasta que estén bien combinados. Agregue el tocino cocido.", "Vierta un cucharón de la mezcla en cada pocillo de la máquina de hacer gofres, cierre la tapa y cocine durante cinco minutos, o hasta que estén dorados y crujientes. Repita el proceso hasta que se agote la pasta, manteniendo los waffles cocidos calientes sobre una rejilla en el horno.", "Para el holandés, coloque la chalota, los granos de pimienta, la hoja de laurel, el vinagre de vino blanco y dos cucharadas de agua en la sartén y cocine hasta que el volumen del líquido se haya reducido a la mitad. Colar en un tazón grande y enfriar un poco.", "Agregue las yemas de huevo en la mezcla de vinagre con una pizca de sal. En un flujo constante, agregue gradualmente la mantequilla derretida hasta que esté todo incorporado. Sazone la salsa con sal marina y pimienta negra recién molida.", "Para los huevos y el tocino, ponga a hervir un sartén de agua con sal y agregue el vinagre. Reduzca el fuego a fuego lento y mezcle el agua para crear un remolino. Una vez que se haya asentado, cuidadosamente rompa un huevo en el agua. Cocine a fuego lento durante 2-3 minutos, retire el huevo escalfado con una cuchara ranurada y colóquelo en un plato para drenar. Repita el proceso con los huevos restantes.", "Caliente una sartén hasta que esté caliente, agregue el tocino y cocine hasta que quede crujiente en ambos lados. Escurra el tocino en papel de cocina.", "Para servir, coloque los waffles en platos para servir, cubra con los huevos escalfados y el tocino. Termine con una llovizna de salsa holandesa y las cebolletas picadas."]}, {"isVegetarian": false, "title": "Pan de maíz con tocino y chile", "url": "www_bbc_co_uk_food_recipes_baconandchillicornbr_72338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de maíz", "350g / 12¼ oz de tocino ahumado, cortado en cubitos", "2 cebollas tiernas, finamente picadas", "115g / 4¼oz de granos de maíz", "½ cucharadita de hojuelas de chile seco", "Polenta de 300 g / 10½ oz", "Harina normal de 350g / 12¼ oz", "1 cucharada de azúcar en polvo", "1 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de sodio", "½ cucharadita de sal", "375ml / 13½fl oz de suero de leche", "2 huevos, ligeramente batidos", "1 cucharada de jarabe de arce", "½ cucharadita de pimienta negra molida", "2 cucharadas de mantequilla sin sal, derretida"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 390F / Gas 6. Ligeramente untar con mantequilla una lata de pastel.", "Calentar el aceite en una sartén y freír el tocino hasta que esté crujiente y libere su grasa. Agregue las cebollas de primavera y cocine durante cinco minutos, luego agregue los granos de maíz y las hojuelas de chile y revuelva para combinar. Deje que se enfríe un poco.", "Combina la polenta, la harina, el azúcar, el polvo de hornear, el bicarbonato de sodio y la sal. Agregue la mezcla de tocino, el suero de leche, los huevos, el jarabe de arce, la pimienta negra y la mitad de la mantequilla derretida. Mezclar bien.", "Vierta la mezcla en la lata de torta preparada y cepille la parte superior con la mantequilla derretida restante. Hornee hasta que estén dorados (aproximadamente 20-25 minutos). Sirve caliente."]}, {"isVegetarian": false, "title": "Tocino y lentejas", "url": "www_bbc_co_uk_food_recipes_baconandlentils_14547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Junta de tocino de 560 g / 1½ lb", "12 cebollas de botón", "1 cucharada de aceite", "450 g / 1 libra de lentejas puy", "1 zanahoria, partida a la mitad", "1 palo de apio", "1 hoja de laurel", "1 ramita de tomillo", "2 dientes de ajo, aplastados", "1 pomo de mantequilla", "3 huevos duros", "2 cucharadas de perejil picado"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pon el tocino en una sartén y cúbrelo con agua fría. Llevar a ebullición. Escurra y enjuague con agua fría y seque con papel de cocina.", "Caliente el aceite en una cazuela honda y agregue el tocino y la cebolla. Cocine hasta que las cebollas comiencen a dorarse.", "Agregue las lentejas, la zanahoria, el apio, las hierbas y el ajo. Cubre con agua y ponle una tapa. Cocine muy lentamente durante aproximadamente 2 horas.", "Cuando las lentejas estén cocidas, quite el tocino, las hierbas y la zanahoria. Cuela las lentejas.", "Coloque las lentejas en un plato para servir y agregue la mantequilla. Cortar el tocino y colocar alrededor del plato. Adorne con perejil picado y huevos duros, a la mitad."]}, {"isVegetarian": false, "title": "Ensalada de tocino y champiñones", "url": "www_bbc_co_uk_food_recipes_baconandmushroomsala_77657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 seta de campo, en rodajas", "½ cebolla roja, en rodajas", "1 naranja, solo ralladura", "1 rebanada de tocino, frita y en rodajas", "85g / 3oz Stilton, desmenuzado", "2 puñados de perejil recién hecho", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "3 dientes de ajo, en rodajas y fritos", "1 rebanada de pan, cortado en una ronda gruesa"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["En un tazón mezcle los champiñones, la cebolla roja, la ralladura de naranja, el tocino, el Stilton, el perejil, el aceite de oliva y el vinagre balsámico.", "Caliente una sartén a la plancha y cocine el pan durante dos minutos en cada lado.", "Sirva la ensalada en la parte superior del pan a la parrilla, cubierto con el ajo."]}, {"isVegetarian": false, "title": "Ensalada de tocino y Bruselas", "url": "www_bbc_co_uk_food_recipes_baconbutteredbrussel_84617", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baconbutteredbrussel_84617_16x9.jpg", "ingredients": ["1 cucharada de aceite de oliva", "100g / 3½ oz de tocino ahumado lardons", "500 g / 1 lb 2 oz de coles de Bruselas, recortadas", "50g / 1¾oz de arándanos secos", "bolsa de hojas mezcladas", "100 ml / 3½ fl oz marsala o jerez", "Pacanas de 50g / 1¾oz, ligeramente tostadas", "3 cucharadas de aceite de nuez", "2 cucharadas de vinagre de jerez", "½ cucharadita de miel", "½ cucharadita de mostaza (opcional)"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva en una sartén grande. Agregue el tocino y cocine hasta que esté muy crujiente y la grasa se haya consumido. Retire con una espumadera y escurra sobre papel de cocina.", "Cortar finamente las coles de Bruselas y agregar a la sartén. Cocine a fuego alto hasta que los brotes comiencen a dorarse en los bordes. Agregue 100 ml / 3½ fl oz de agua y continúe cocinando, revolviendo regularmente, hasta que el agua se haya evaporado y las Bruselas estén recién cocidas; deberían haberse marchitado un poco pero seguir teniendo un aspecto muy fresco. Mantener caliente", "Mientras tanto, coloca los arándanos en una olla pequeña y cúbrelos con el marsala. Llevar a ebullición y cocine a fuego lento hasta que todo el líquido haya sido absorbido por los arándanos: serán brillantes y regordetes.", "Batir el aceite de nuez y el vinagre de jerez junto con la miel y la mostaza, si se usa. Condimentar con sal y pimienta.", "Para armar la ensalada, acomode las hojas en un tazón o bandeja de servir. Agregue las coles de Bruselas y la mayor parte del aderezo y mezcle suavemente. Espolvoree sobre el tocino, las pacanas y los arándanos y sirva."]}, {"isVegetarian": false, "title": "Tocino de tocino con mayonesa de mostaza", "url": "www_bbc_co_uk_food_recipes_baconbuttywithmustar_88034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 lonchas de tocino rayado", "2 rebanadas de ciabatta", "rociar aceite de oliva", "150ml / ¼ de pinta de yogur griego", "1 cucharada de crema doble", "2 cucharaditas de mostaza integral", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para la mantequilla de tocino, caliente una sartén de plancha, agregue el tocino rayado y cocine hasta que quede crujiente. Dejar de lado.", "Rocíe dos rebanadas de chapata con aceite de oliva y luego dore en ambos lados en la misma sartén en la que cocinó el tocino.", "Para la mayonesa de mostaza, mezcle el yogur, la crema, la mostaza, el jugo de limón, la sal y la pimienta negra recién molida en un bol.", "Para servir, apilar el tocino en la chapata a la parrilla. Coloque una cucharada sobre una generosa cucharada de mayonesa y coloque la otra rebanada de pan en la parte superior."]}, {"isVegetarian": false, "title": "Tocino de tocino y salsa marrón", "url": "www_bbc_co_uk_food_recipes_baconbuttyandbrownsa_91737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g / 1½lb de harina de pan fuerte, más extra para quitar el polvo", "1 cucharadita de levadura seca", "1 cucharadita de azúcar", "400ml / 14fl oz de agua tibia", "1 cucharadita de sal", "1 cucharada de aceite vegetal", "4 chalotes, pelados, finamente picados", "4 tomates frescos, picados", "Fechas de 75g / 2½oz, picadas", "50ml / 2fl oz de salsa de tamarindo lista", "1 cucharadita de jengibre molido", "4 dientes", "4 granos de pimienta negra", "pizca de cúrcuma molida", "pizca de cayena", "pizca de cilantro molido", "200 ml / 7 fl oz de agua", "700ml / 1 pinta 5fl oz de vinagre de malta", "1 cucharada de mostaza en polvo", "2 cucharadas de melaza", "pizca de sal", "2 cucharadas de azúcar mascabado", "2 cucharadas de harina de maíz, mezclada con suficiente agua para formar una pasta suelta", "30 rebanadas de tocino grueso y ahumado, a la parrilla", "mantequilla, para difundir"], "serves": "Sirve 10", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Ligeramente aceite y harina dos latas de pan de 450 g / 1 lb.", "Para el pan, tamiza la harina, la levadura y el azúcar en un tazón grande. Poco a poco agregue el agua, mezcle suavemente sobre la marcha, hasta que la mezcla se una para formar una masa (es posible que no necesite toda el agua).", "Amasar la masa en una superficie de trabajo ligeramente enharinada durante 3-5 minutos, o hasta que la masa se sienta suave y elástica. Coloque la masa de nuevo en el recipiente y cubra con una toalla de té húmeda. Deja en un lugar cálido y seco durante dos horas.", "Agregue la sal a la masa, luego amasar durante 2-3 minutos más o hasta que quede suave y elástica. Cortar en dos panes oblongos, luego coloque cada pieza en una lata de pan preparada. Cubra con una toalla de té húmeda nuevamente y déjela reposar en un lugar cálido y seco durante una hora. Mientras tanto, precalentar el horno a 220C / 430F / Gas 7.", "Hornee los dos panes durante 30-40 minutos, o hasta que estén dorados y cocidos. (El pan sonará hueco cuando se golpee en la parte inferior.) Retire del horno y deje enfriar.", "Para la salsa marrón, caliente el aceite en una sartén no reactiva y fría a fuego lento las chalotas durante 4-5 minutos, o hasta que estén blandas pero no coloreadas. Agregue los tomates, las fechas, la salsa de tamarindo, el jengibre, los clavos de olor, los granos de pimienta, la cúrcuma, la pimienta de cayena, el cilantro molido y el agua. Llevar a ebullición, luego reducir el fuego y hervir a fuego lento durante diez minutos.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave. Pasar la mezcla a través de un tamiz muy fino en una sartén limpia, no reactiva y llevar a ebullición. Agregue el vinagre de malta, la mostaza en polvo, la melaza, la sal y el azúcar mascabado. Batir bien y hervir durante 4-5 minutos.", "Reduzca el fuego, agregue la pasta de harina de maíz y cocine durante un minuto más o hasta que la salsa se espese. Dejar enfriar un poco. (La salsa puede enfriarse y almacenarse en una botella hermética por hasta tres semanas en la nevera).", "Para servir, cortar en rodajas gruesas el pan y untar con mantequilla cada rebanada. Coloque tres rebanadas de tocino cocido entre dos rebanadas de pan, con cucharadas de salsa marrón en la parte superior del tocino. Servir inmediatamente."]}, {"isVegetarian": false, "title": "Pollo relleno de queso envuelto en tocino con pasta fresca con hierbas y brócoli salteado", "url": "www_bbc_co_uk_food_recipes_baconwrappedcheesech_87168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 muslo de pollo sin hueso, sin piel, deshuesada", "Queso cheddar de 55g / 2oz, rebanado", "3 lonjas de tocino", "pimienta negra recién molida", "1 cucharada de aceite de oliva", "Crema doble 250ml / 9fl oz", "1 diente de ajo, aplastado", "puñado cada cebollino fresco, eneldo, perejil, picado", "sal y pimienta negra recién molida", "Arcos de pasta 125g / 4½oz, cocinados según las instrucciones del paquete", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cabeza de brócoli, cortada en florecillas", "salpicar agua"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para el pollo, rellene el muslo de pollo con las rodajas de queso y sazone con sal y pimienta negra recién molida.", "Envuelva el pollo en lonchas de tocino. Asegure con un pincho de madera.", "Caliente el aceite de oliva en una sartén para horno, agregue el pollo y cocínelo hasta que esté dorado por todos lados. Coloque la sartén en el horno y cocine durante 12 minutos o hasta que el pollo esté bien cocido.", "Para la pasta, coloca la crema y el ajo en una cacerola y llévalo a ebullición. Tan pronto como hierva, retírelo del fuego, mezcle las hierbas y sazone, al gusto, con sal y pimienta negra recién molida. Agregue la pasta cocida y mezcle bien.", "Para el brócoli, caliente el aceite de oliva y la mantequilla en una sartén, agregue el brócoli y un chorrito de agua y saltee durante tres minutos.", "Para servir, apile la pasta en un plato para servir o en un tazón, corte el muslo de pollo en 3-4 rebanadas verticales y colóquelo encima de la pasta. Sirva con el brócoli salteado en un lado."]}, {"isVegetarian": false, "title": "Emparedado de tocino", "url": "www_bbc_co_uk_food_recipes_baconsandwich_82114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "2 rebanadas de pan blanco crujiente", "2 rebanadas de jamón", "2 tomates, cortados a la mitad", "sal y pimienta negra recién molida", "aceite de oliva, a llovizna"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Rocíe el aceite de oliva sobre el pan. Caliente una sartén hasta que esté caliente, agregue las rebanadas de pan y la plancha durante dos minutos en cada lado.", "Retira de la sartén y luego plancha el prosciutto hasta que quede crujiente. Retirar.", "Agregue los tomates a la sartén de la parrilla y cocínelos hasta que estén blandos.", "Para servir, coloque el jamón en una rebanada de pan a la parrilla, cubra con los tomates, sazone bien con sal y pimienta negra recién molida, rocíe con aceite de oliva y coloque la otra rebanada de pan en la parte superior."]}, {"isVegetarian": false, "title": "Pollo envuelto en tocino con queso y torre de papa", "url": "www_bbc_co_uk_food_recipes_baconwrappedchickenw_84124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pechuga de pollo", "25g / 1oz de queso Wensleydale, picado", "Tocino rayado de 100 g / 3½ oz", "1 cucharada de aceite de oliva, más extra para la grasa", "½ patata, pelada y finamente cortada", "25g / 1oz de queso Wensleydale", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Con un cuchillo afilado, corte un bolsillo hasta la mitad de la pechuga de pollo. Rellene el queso en el bolsillo y envuelva el pollo en el tocino rayado, para sellar el bolsillo.", "Caliente una sartén a prueba de horno y, cuando esté caliente, agregue la pechuga de pollo envuelta y fría por dos minutos en cada lado, hasta que el tocino esté dorado pero no crujiente. Transfiera al horno y cocine por cinco minutos, o hasta que esté completamente cocido. (Sabrá que el pollo está cocido cuando, si se perfora, los jugos se vuelven transparentes).", "Para hacer la torre de papa, coloque un anillo de 5cm / 2in engrasado en una superficie de trabajo limpia. Agregue capas alternativas de papa y queso, sazonar bien con sal y pimienta negra recién molida entre cada capa.", "Caliente el aceite en una sartén a prueba de horno a fuego medio. Levanta cuidadosamente el anillo de los chefs y agrégalo a la sartén. Cocine por dos minutos en cada lado, luego transfiera al horno y hornee durante 12 minutos.", "Para servir, empuje la torre de papas y queso fuera del anillo de los chefs en un plato y sirva el pollo al costado."]}, {"isVegetarian": false, "title": "Pizza de tocino, mozzarella y champiñones", "url": "www_bbc_co_uk_food_recipes_baconmozzarellaandmu_80090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal 150g / 5½ oz", "50 ml / 2 fl oz de agua", "2 cucharadas de aceite de oliva", "pizca de sal", "1 tomates de ciruela", "3 cucharadas de aceite de oliva", "1 diente de ajo, finamente picado", "25g / 1oz de perejil picado", "25 g / 1 oz de albahaca picada", "sal y pimienta negra recién molida", "Tocino frito con tocino frito 50g / 1oz", "50g / 1¾oz de mozzarella ahumada rasgada", "50g / 1¾oz de champiñones marinados"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la base, en un tazón grande mezcle la harina, el agua, el aceite y la sal para formar una masa.", "Espolvorea tus manos con harina y forma la masa en una bola. Estirar en una superficie enharinada en una ronda de 20cm / 8in.", "Calentar una sartén pequeña y cocinar por dos minutos en cada lado.", "Para hacer la salsa de tomate, coloque los tomates, el aceite de oliva y el ajo en una cacerola.", "Cocine a fuego lento hasta que espese, luego agregue las hierbas. Sazonar con sal y pimienta negra recién molida.", "Extienda un poco de salsa de tomate en la pizza. Espolvoree sobre el tocino, los champiñones y el queso, y sazone con sal y pimienta negra recién molida.", "Hornee en el horno durante cinco minutos hasta que el queso se haya derretido."]}, {"isVegetarian": false, "title": "Paloma envuelta en tocino relleno con ralladura de naranja con tomates asados ​​y ensalada de cítricos", "url": "www_bbc_co_uk_food_recipes_baconwrappedpigeonst_88925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pechos de paloma", "1 naranja, solo ralladura", "1 cucharada de romero fresco picado", "4 lonchas de tocino ahumado", "1 cucharada de aceite de oliva", "7 tomates cherry de vid", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 naranja, pelada y segmentada", "½ limón, pelado y segmentado", "1 cucharada de perifollo fresco picado", "6 hojas de albahaca fresca, rotas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la paloma, coloque las lonchas de tocino una al lado de la otra sobre una tabla de cortar. Aplane los senos de paloma con un mazo de carne o rodillo y colóquelos uno al lado del otro en el tocino. Dispersar sobre la ralladura de naranja y el romero, luego enrollar bien con el tocino en el exterior.", "Calentar el aceite de oliva en una sartén y freír los pechos durante 6-8 minutos, hasta que estén dorados por completo y cocidos. Retire del fuego y reserve para descansar, luego corte a la mitad.", "Para los tomates asados, coloque los tomates en una sartén a prueba de horno y rocíe sobre el aceite de oliva. Caliente hasta que el aceite comience a chisporrotear, luego sazone con sal y pimienta negra recién molida y transfiéralo al horno para asar durante 6-7 minutos, hasta que se ablande.", "Para la ensalada de cítricos, combine todos los ingredientes de la ensalada en un tazón y mezcle suavemente para combinar.", "Para servir, apile la ensalada de cítricos en un plato para servir y coloque la paloma en rodajas encima. Coloque los tomates cherry tostados en un lado y sirva."]}, {"isVegetarian": false, "title": "Emparedado de tocino", "url": "www_bbc_co_uk_food_recipes_baconsandwich_81145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "Tocino rayado de 50 g / 2 oz", "25g / 1oz de mantequilla sin sal, ablandada", "2 rebanadas de pan de granja blanco grueso", "sal y pimienta negra recién molida", "1 cucharada de ketchup de tomate"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite en una sartén. Freír las lonjas de tocino hasta que estén crujientes y doradas por ambos lados.", "Extienda la mantequilla en las rebanadas de pan, luego coloque el tocino sobre el pan. Sándwich juntos y sazone con sal y pimienta negra recién molida. Cortar en triángulos en una tabla de cortar.", "Servir en un plato con una cucharada de ketchup a un lado."]}, {"isVegetarian": true, "title": "Bagels", "url": "www_bbc_co_uk_food_recipes_bagels_47163", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bagels_47163_16x9.jpg", "ingredients": ["450g / 1lb de harina de pan fuerte, más extra para quitar el polvo", "2 cucharaditas de sal", "7g sachet de levadura de acción rápida", "2 cucharadas de miel clara", "1 cucharada de aceite vegetal, más extra para engrasar", "3 cucharadas de melaza o melaza negra", "polenta fina, para rociar", "1 huevo de gallinas camperas, golpeado", "semillas de sésamo, sal marina, semillas de amapola o un aderezo salado de su elección (opcional)"], "serves": "Sirve 7", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Tamiza la harina y la sal en un tazón grande para mezclar, luego agrega la levadura y mezcla bien.", "Mida 250ml / 9fl oz de agua tibia en una jarra medidora y luego agregue la miel y el aceite.", "Haga un pozo en el centro de la harina y vierta el líquido gradualmente, juntando la masa con sus manos.", "Convierta la masa en una superficie de trabajo limpia, seca y enharinada. Comience amasando la masa, estirándola con la palma de una mano y volviéndola a doblar con la otra. Amasar durante aproximadamente 10 minutos, agregando más harina si la masa se vuelve muy pegajosa. Continúa amasando hasta que la masa esté firme y elástica.", "Forme la masa en una bola grande y colóquela en un tazón grande ligeramente engrasado. Gire la masa en el aceite para cubrir. Cúbralo con una película adhesiva o una bolsa de plástico y colóquelo en un lugar cálido y seco durante 1 a 3 horas, o hasta que la masa duplique su tamaño.", "Cuando la masa haya probado, ponga a hervir una olla grande de agua y agregue la melaza o melaza. Cubra y apague el fuego.", "Engrase ligeramente dos bandejas para hornear y espolvoree con polenta. Retire la masa del cuenco, luego golpee hacia abajo y amasarlo brevemente. Enróllalo en forma de salchicha áspera y divídelo en siete trozos iguales. Mientras trabaja con un pedazo, mantenga los otros cubiertos con una toalla de té limpia.", "Firmemente despliegue cada trozo en forma de salchicha larga y delgada. Junta los extremos, salpica los extremos con un poco de agua y apriétalos para sellar. Coloque en las bandejas de hornear preparadas y repita con la masa restante.", "Cubra y reserve para probar durante otros 10-20 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Traiga la olla de melaza y el agua a fuego lento. Coloque suavemente cada panecillo en el agua (haga esto en lotes de no más de tres a la vez) y dé vuelta después de 1-2 minutos. Cocine a fuego lento durante otros 1-2 minutos, luego retire los bagels del agua y drene.", "Coloque las rosquillas en las bandejas de horneado preparadas, separándolas ampliamente. Cepille las partes superiores con el huevo batido y espolvoree con semillas de sésamo, sal marina, semillas de amapola o un aderezo salado de su elección. Hornee en el horno durante 15 minutos, o hasta que estén dorados, luego délos vuelta por otros diez minutos para cocinar las bases. Transfiera a una rejilla para enfriar antes de servir."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_79923", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml / 4fl oz de aceite de oliva virgen extra", "4-5 dientes de ajo, pelados y aplastados", "12 anchoas conservadas en aceite de oliva, escurridas y picadas", "120g / 4oz de mantequilla sin sal, cortada en cubos", "Selección de verduras crudas como hinojo, coliflor, escarola, apio, pimientos y calabacines, cortadas en trozos del tamaño de un bocado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Ponga el aceite de oliva en una sartén con el ajo y las anchoas y revuelva a fuego lento durante unos minutos.", "Batir en 90 g de mantequilla, y tan pronto como se haya derretido, retirar del fuego y batir un par de veces más para que todo esté cremoso y amalgamado.", "Saborea, y si sientes que quieres esta salsa de inmersión, que debe ser picante pero no acre, un poco más suave, luego agrega dos cucharadas más de mantequilla.", "Vierta en un plato de fondue sobre una llama o simplemente sirva en un recipiente muy cálido.", "Sirve con las verduras crudas para mojar."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_81861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de aceite de oliva", "¼ cebolla roja, finamente rebanada", "Filetes de anchoas 150g / 5½oz en aceite de oliva, picados", "200g / 7oz de frijoles flageolet enlatados, escurridos", "150ml / ¼ pinta de caldo de verduras", "1 cucharada de crema doble", "2 rebanadas de pan blanco crujiente, costras quitadas y en cubos", "1 cucharada de perejil fresco picado, para decorar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una cucharada de aceite de oliva en una cacerola mediana, agregue la cebolla roja y los filetes de anchoa y saltee durante tres minutos.", "Agregue los frijoles y el caldo de verduras y cocine por dos minutos. Agregue la crema doble y caliente por un minuto.", "Retire del fuego y mezcle con una batidora de mano hasta que quede suave. Dejar de lado.", "Para hacer los croutons, enrolle el pan en cubos en dos cucharadas de aceite de oliva, sazone bien y fríalos por tres minutos o hasta que estén dorados. Escurrir sobre papel de cocina.", "Para servir, vierta la sopa caliente en un bol y espolvoree sobre los croutons y el perejil picado."]}]