[{"isVegetarian": true, "title": "Flapjack cinnamon apple crumble with vanilla custard", "url": "www_bbc_co_uk_food_recipes_flapjack_cinnamon_apple_32656", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjack_cinnamon_apple_32656_16x9.jpg", "ingredients": ["250g/9oz porridge oats ", "2 tsp lemon zest ", "125g/4½oz unsalted butter ", "100g/3½oz muscovado sugar", "100g/3½oz golden syrup ", "1kg/2lb 4oz Granny Smith or cooking apples, peeled, cored and cut into chunks ", "40g/1½ oz unsalted butter ", "1 tsp cinnamon ", "1–2 tbsp muscovado sugar ", "1 lemon, juice only", "1 tbsp cornflour ", "150g/5½oz raisins ", "600ml/1 pint whole milk ", "1 tbsp vanilla bean extract ", "4 free-range eggs, yolk only (roughly 80g/3oz)", "20g/¾oz caster sugar ", "2 tsp cornflour"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2. ", "For the crumble topping, spread the oats on a large baking tray and bake for 10–15 minutes, stirring once, until they are toasted and golden in colour. Once toasted, put the oats into a bowl and add the lemon zest. Leave the oven on. ", "Melt the butter, sugar and syrup in a saucepan over a medium heat until the sugar has dissolved. Pour over the oats, give it a good mix and set aside.", "Put the apples, butter, cinnamon, 1 tablespoon of sugar and the lemon juice into a pan. Cook for about 10 minutes on a medium heat, until the apples have softened slightly. Stir in the cornflour and raisins, then tip the mixture into a 25cm/10in square or round ovenproof baking dish. Top with the flapjack mix in an even layer. Bake on the middle shelf of the oven for 40–45 minutes. ", "Meanwhile, for the custard put the milk and vanilla into a pan and bring to the boil, then turn down to a gentle simmer. Put the egg yolks, sugar and cornflour into a bowl and whisk until the mixture is light. Slowly add the warm milk in a steady stream, whisking all the time. Once all the milk is added, pour it back into the pan over a medium heat and stir gently with a spoon till the mixture thickens. ", "Pour straight into a serving jug and, if there is a wait, cover with cling film, making sure the film touches the top of the custard. Unless of course you enjoy the skin, in which case by all means leave it exposed. Serve the crumble with the custard alongside."]}, {"isVegetarian": true, "title": "Flapjacks", "url": "www_bbc_co_uk_food_recipes_flapjacks_84370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter, melted", "50g/1¾oz caster sugar", "50ml/2fl oz clear honey, plus extra for drizzling", "200g/7oz oats", "icing sugar, to dust"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Line a baking sheet with greasproof paper.", "Place all the ingredients into a bowl and mix together.", "Spoon the flapjack mixture onto the greaseproofed baking sheet, and place into the oven to cook for 10 minutes. ", "Remove the flapjacks and transfer into the freezer for five minutes to set and firm.", "Once the flapjacks are set, remove from the freezer and cut into chunks.", "To serve, place onto a serving plate and dust with icing sugar and drizzle over with honey."]}, {"isVegetarian": true, "title": "Flapjacks", "url": "www_bbc_co_uk_food_recipes_flapjacks_86993", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flapjacks_86993_16x9.jpg", "ingredients": ["175g/6oz butter", "175g/6oz golden syrup", "175g/6oz muscovado sugar", "350g/12oz porridge oats", "½ lemon, finely grated zest", "pinch ground ginger"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2 and line a 20cm/8in square baking tin with baking paper.", "Melt the butter in a medium pan over a low heat. Dip a brush in the butter and brush the baking tin with a little bit of it. Add the golden syrup and sugar to the butter and heat gently. Once the sugar is dissolved and the butter is melted, remove the pan from the heat and stir in the porridge oats, lemon zest and ginger.", "Pack the mixture into the baking tin and squash down. Bake in the oven for 40 minutes.", "Once cooked, remove from the oven, leave to cool for 15 minutes, then turn out on to a chopping board and cut into squares.", "These flapjacks are delicious in a packed lunch or as a grab-and-go breakfast."]}, {"isVegetarian": false, "title": "Flash fried steak with mushroom ketchup", "url": "www_bbc_co_uk_food_recipes_flash_fried_steak_with_94231", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "1½ shallots, finely chopped", "4 Portobello mushroom, pulsed in food processor", "125g/4½oz demerara sugar", "100g/3½oz white wine vinegar", "500ml/18fl oz double cream", "2 anchovies", "2 tbsp oil ", "2 x 250g/9oz tail fillet steaks, flattened to 1cm/½in thick ", "table salt, to taste ", "1 tsp cracked black pepper", "knob butter", "1 bunch watercress, picked and washed", "crispy shallot rings "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the mushroom ketchup, heat a frying pan and add the butter. Once melted, fry the shallots for a few minutes. Add the blended mushrooms and fry until soft.", "Add the sugar and vinegar and cook until the volume of liquid has reduced then add cream and reduce again. Blend in a food processor with the anchovies then pass through a sieve. Keep in the fridge until needed.", "For the flash fried steak, in a large very hot frying pan, add a little oil. Once hot, season the steaks with the salt and black pepper.", "Add a knob of butter to the pan and then add the steak. Cook for 30-40 seconds one side and then 20 seconds on the other side.", "Let the steaks rest for two minutes and then slice. ", "To serve, serve the sliced steak with the mushroom ketchup, watercress and shallot rings."]}, {"isVegetarian": false, "title": "Flash-fried salmon with yellow pepper and onion salsa", "url": "www_bbc_co_uk_food_recipes_flashfriedsalmonwith_87243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tbsp olive oil", "150g/5½oz salmon fillet, sliced into pieces 0.5cm/½in thick", "½ lemon, juice only", "¼ yellow pepper, finely chopped", "¼ red onion, finely chopped", "1 tsp chilli flakes", "2 tbsp chopped fresh parsley", "1 tbsp olive oil", "1 lemon, zest and juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat the oil in a small frying pan over a high heat and fry the salmon slices for 20 seconds on each side, or until just cooked through.", "Remove the salmon from the pan to a serving plate and squeeze over the lemon juice.", "For the salsa, mix all the salsa ingredients together in a bowl and serve with the salmon."]}, {"isVegetarian": false, "title": "Flat rib broth", "url": "www_bbc_co_uk_food_recipes_flat_rib_broth_00443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "4 carrots, 2 finely chopped, 2 diced ", "1 onion, finely chopped", "1 large stick celery, finely chopped", "1kg/2lb 4oz flat rib, or short ribs (including the bone) ", "125g/4½oz pearl barley", "125g/4½oz split peas", "2 bay leaves", "salt and freshly ground black pepper", "100g/3½oz lentils", "1 leek, sliced", "1 small turnip, cut into 1cm/½in dice", "2 medium potatoes, cut into 1cm/½in dice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large saucepan over a medium heat. Add the two finely chopped carrots, the onion and celery and cook for five minutes, or until soft. Add the flat ribs and 3 litres/5¼ pints of boiling water to the pan. ", "Bring back to the boil and add the pearl barley, split peas and bay leaves. Place a lid on the saucepan and reduce the heat. Simmer with the lid on for 1½ hours.", "Taste and add a good pinch of salt and pepper, to taste. Add the lentils and cook for a further 20 minutes, making sure to replace the lid.", "After 20 minutes, add the leeks, the reserved diced carrot, the turnip and the potatoes and cook for a further 20 minutes, or until tender.", "Adjust the seasoning by adding salt and pepper if required.", "Remove the flat ribs from the pan and set aside on a warm plate.", "Ladle the broth into serving bowls and carve a piece of flat rib from the bone and place on top of the broth. "]}, {"isVegetarian": false, "title": "Flatbread pizza with pepperoni, courgette and onion", "url": "www_bbc_co_uk_food_recipes_flatbread_pizza_with_08542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting ", "salt and black pepper", "2 tbsp olive oil ", "150-200ml/5-7fl oz warm water", "3 tbsp olive oil ", "2 garlic cloves, finely chopped ", "1 x 400g/14oz tin chopped tomatoes ", "½ tsp dried mixed herbs ", "1 courgette (about 200g/7oz), grated ", "2 balls mozzarella, drained and torn ", "100g/3½oz pepperoni slices ", "1 onion, very finely sliced "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the flatbreads, sieve the flour into a mixing bowl and season with a couple of pinches of salt and a pinch of pepper. Add the olive oil and mix in the warm water - starting with 150ml/5fl oz and adding more if needed to bring the mixture together to form a thick dough. Knead the dough in the bowl to bring it together.", "Knead the dough on a floured work surface for 3-4 minutes, or until the dough is slightly elastic. Cover and leave to rest while you prepare the rest of the dish.", "For the toppings, heat a small saucepan over a low heat. Add a dash of olive oil and add the garlic and fry for one minute. Add the tomatoes, dried herbs and a pinch of salt and pepper and bring to a simmer. Mash the tomatoes with a potato masher to create a smoother sauce and simmer the mixture for 10-15 minutes, or until thickened to a spreadable sauce.", "Preheat the oven to the highest temperature and place a non-stick baking tray in the oven to heat.", "For the flatbreads, divide the dough into four balls and roll each ball out on a floured surface until about 5mm/¼in thick. Lightly oil the hot baking tray, place the flatbread pizza bases on top and cook in the hot oven for 2-3 minutes (you may need to do this in batches if you don’t have room to do them all at once).", "Turn the flatbread pizza bases over. Taste the tomato sauce and add salt and pepper to taste. Divide the tomato mixture between the four flatbread pizza bases, spreading out until you almost reach the edges but leaving a 2cm/¾in border round the edge. ", "Sprinkle over the grated courgette, top with the torn mozzarella, pepperoni slices and onion. Drizzle with a little extra olive oil, season with salt and pepper and place back into the hot oven for 6-7 minutes, or until the base is cooked through and the cheese melting and turning golden-brown. Serve immediately. "]}, {"isVegetarian": true, "title": "Flattened rice with poha potatoes", "url": "www_bbc_co_uk_food_recipes_flattened_rice_with_poha_64857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium waxy potatoes (such as Charlotte or Jersey Royal)", "140g/5oz poha rice (also called flaked rice or thick flattened rice)", "3 tbsp olive oil", "generous pinch of ground asafoetida ", "½ tsp urad dal", "½ whole brown mustard seeds", "½ tsp whole cumin seeds", "1 dried hot chilli", "10-15 fresh curry leaves, lightly crushed", "½ onion, chopped", "salt", "1 tsp sugar", "2-3 tbsp chopped fresh coriander, to garnish", "4 wedges of lime or lemon, to serve", "1 round lettuce, washed and leaves separated", "¼ cucumber, chopped", "3 plum tomatoes, chopped"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes until cooked. Drain and set aside to cool, then peel and cut into 1cm/½in cubes.", "Put the rice in a sieve and wash gently but thoroughly under cold running water. Empty it into a bowl, cover generously with water and leave to soak for two minutes. Drain and leave in the sieve set over a bowl. ", "Put the oil in a large, non-stick frying pan and set it over a medium-high heat. When hot, add the asafoetida and the urad dal. As soon as the dal starts to pick up a little colour, add the mustard seeds, cumin seeds and chilli (whatever type you are using). As soon as the mustard seeds start to pop, a matter of seconds, add the curry leaves (take care as they will splutter), then the onion and potatoes. Lower to a medium heat and fry, stirring now and again, for 3-4 minutes or until the onion and potatoes are slightly browned.", "Sprinkle a pinch of salt over the top and stir.", "Add the poha rice, gently breaking up any lumps, and sprinkle ½ teaspoon of salt and one teaspoon sugar over the top. Cook on a low heat for 3-4 minutes, tossing frequently by lifting all the ingredients from the bottom of the pan with a flat spatula and folding them over, until the poha is heated through. Cover and set aside until you are ready to eat. ", "To make the salad, mix all the ingredients in a large bowl.", "To serve, garnish the poha potatoes with fresh coriander and serve with lime or lemon wedges. Serve the salad alongside."]}, {"isVegetarian": false, "title": "Flexible fish stew", "url": "www_bbc_co_uk_food_recipes_flexible_fish_stew_82833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "knob of butter", "1 bulb fennel, finely chopped, fronds reserved for garnish", "1 bunch spring onions, chopped", "1 tsp paprika", "6 whole peppercorns", "1 x 400g tin chopped tomatoes", "6-8 baby new potatoes (preferably Jersey Royals), washed and halved ", "4-8 mussels, cleaned and beards removed", "small fillet haddock (about 150-170g), skinned, pin boned and cut into chunks ", "small fillet monkfish (about 150-170g), skinned, pin boned and cut into chunks ", "12 Queen Scallops or fresh prawns (optional)", "large sprig fresh tarragon", "handful cherry tomatoes, halved", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the base for the stew, heat a little olive oil and a knob of butter in a large saucepan. When the butter is melted, add the chopped vegetables and a pinch of salt. ", "Cover with a lid and simmer gently for 4-5 minutes, then add a teaspoon of paprika, a generous twist of freshly ground black pepper and the whole peppercorns. Pour in the tinned tomatoes, then fill the empty tin with water and add that to the pot as well. Simmer with a lid on for 5 minutes or so, stirring occasionally. Add the new potatoes, replace the lid and continue to simmer for another 5 minutes, or until the potatoes are nearly cooked through.  ", "If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Add the fish and mussels to the pan. If you are using Queen scallops or fresh prawns, they should go in a minute or two later, as they will cook quickly. ", "Add a large sprig of tarragon and simmer for a few more minutes. The mussels are cooked when they've opened up. Discard any that don't open. ", "Serve the stew in bowls garnished with the cherry tomatoes and fennel fronds."]}, {"isVegetarian": true, "title": "Floating island with strawberry coulis and summer fruit", "url": "www_bbc_co_uk_food_recipes_floating_island_with_39422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter, softened, for greasing", "225g/8oz cream cheese", "100g/3½oz icing sugar, sifted", "1 lemon, zest only, plus a squeeze of the lemon juice", "200g/7¼oz strawberries, hulls removed, cut in half", "200g/7¼oz raspberries", "75g/2½ oz icing sugar, sifted (or caster sugar)", "220g/7¾oz egg whites", "230g/8¼oz caster sugar", "2 vanilla pods, seeds scraped out using a sharp knife", "50g/2oz pistachios, shells removed, finely chopped (optional)", "100g/3½oz caster sugar", "150g/5¼oz raspberries", "16 strawberries, hulls removed, cut into quarters", "1 small white-fleshed melon, such as Honeydew, peeled, seeds removed, flesh finely diced", "1 small orange-fleshed melon, such as canteloupe, peeled, seeds removed, flesh very finely diced"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease the insides of six dariole moulds by brushing them with the softened butter.", "For the cream cheese mixture, beat the cream cheese, icing sugar, lemon zest and a squeeze of lemon juice in a large bowl until well combined. Chill in the fridge until needed.", "For the strawberry coulis, heat the strawberries and raspberries in a large pan for 4-5 minutes, or until they start to break down. ", "Add the icing (or caster) sugar and continue to cook the fruit for a further 2-3 minutes, or until the sugar has dissolved. ", "Transfer the coulis mixture to a food processor and blend until smooth, adding a splash of water to the mixture if necessary to loosen. Strain the coulis through a sieve and set aside to cool. Chill in the fridge until needed.", "For the floating islands, make a meringue mixture: whisk the egg whites in a bowl until soft peaks form when the whisk is removed. Add the sugar and vanilla seeds and continue to whisk until stiff, glossy peaks form when the whisk is removed. Transfer the mixture to a piping bag and set aside.", "For the caramel, heat a non-stick frying pan over a medium heat and add the sugar. Cook the sugar until it has dissolved and formed a caramel. ", "Pour a little of the caramel into each of the dariole moulds and tip the moulds to line them with the caramel. ", "Pipe some of the meringue mixture into each mould. ", "Arrange the moulds in a roasting tray. Add enough boiling water to reach halfway up the sides of the moulds and bake in the oven for 7-8 minutes, or until the meringue has just set.", "To serve, drizzle a little of the coulis into each of six serving bowls. Sprinkle the raspberries, strawberries and melon into the bowls. Turn out one floating island into each bowl, spooning over any excess caramel from the mould. Place a quenelle of the cream cheese mixture alongside each serving. "]}, {"isVegetarian": true, "title": "Floating islands", "url": "www_bbc_co_uk_food_recipes_floating_islands_01988", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_01988_16x9.jpg", "ingredients": ["750ml/1⅓ pint milk", "1 vanilla pod, seeds only", "8 free-range egg yolks", "190g/7oz caster sugar", "500ml/18fl oz milk ", "1 tbsp caster sugar", "8 free-range egg whites", "190g/7oz caster sugar", "75g/2½oz caster sugar "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crème anglaise, heat the milk and vanilla seeds in a saucepan over a medium heat. Simmer for 4-5 minutes.", "Whisk together the egg yolks and sugar in a mixing bowl.", "Pour the hot milk mixture onto the eggs and sugar, a little at a time, so the eggs do not start to cook, whisking continuously until smooth and creamy. ", "Return the mixture to the saucepan and place the pan over a medium heat and stir continuously for 4-5 minutes, or until the mixture has thickened enough to coat the back of a spoon.", "Strain the mixture through a sieve into a bowl, leave to cool and then refrigerate.", "For the poaching liquor, combine the milk and 500ml/18fl oz water with the sugar in a saucepan, stirring to dissolve the sugar.", "For the meringue, using an electric hand whisk, whisk the whites in a bowl until stiff peaks form when the whisk is removed, but the mixture should not look too dry. Add one tablespoon of the sugar to the egg whites, and continue to whisk until the mixture comes back to stiff peaks. Add the sugar one tablespoon at a time until it has all been used, and the meringue is thick and glossy.", "Using a serving spoon dipped in cold water, shape big quenelles of the meringue and gently poach in the milk and water solution, turning after 4-5 minutes to ensure they are cooked on both sides. Make sure the liquid doesn’t boil or the meringues will puff then collapse. When fully cooked, gently place on a wire rack to drain.", "For the caramel, pour the sugar into a clean pan. Melt the sugar slowly, stirring with a wooden spoon over a low heat until the sugar turns a dark copper colour. Remove immediately from the heat to ensure the caramel does not burn.", "Pour the caramel over the meringues. When set, take the caramel-covered meringues off the tray and serve in a generous pool of the crème anglaise."]}, {"isVegetarian": true, "title": "Floating islands", "url": "www_bbc_co_uk_food_recipes_floatingislands_86219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range egg whites", "125g/4½oz caster sugar", "50g/2oz icing sugar", "1 vanilla pod, split, seeds scraped out", "1 tbsp honey"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the egg whites into a clean, dry bowl and whisk with an electric hand whisk until stiff peaks form when the whisk is removed. Gradually add the sugar one tablespoon at a time until all the sugar is incorporated and the mixture is glossy. ", "Half-fill a medium saucepan with boiling water, add the vanilla seeds and bring to a gentle boil.", "Using two tablespoons, make quenelles (large spoonfuls) of meringue mixture and then drop the quenelles into the boiling vanilla water. Poach for 2-3 minutes, turn over, drizzle with honey and poach for another 2-3 minutes. ", "Carefully spoon onto a plate and repeat with the rest of the meringue mix."]}, {"isVegetarian": true, "title": "Floral tea cake", "url": "www_bbc_co_uk_food_recipes_floral_tea_cake_15741", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floral_tea_cake_15741_16x9.jpg", "ingredients": ["3 tbsp camomile tea (preferably whole flowers) ", "120g/4½ oz unsalted butter", "8 free-range eggs", "250g/9oz caster sugar", "250g/9oz plain flour", "420g/15oz baking margarine ", "850g/1lb 14oz icing sugar", "½ tsp elderflower cordial ", "2 drops elderflower extract (available online), optional", "yellow food colouring gel"], "serves": "Makes 1 x 20cm/8 inch cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and flour a 20cm/8in springform cake tin.", "For the cake, crush the tea in a spice grinder or pestle and mortar until it is a fine powder. Melt the butter in a saucepan and stir in the tea. When melted, remove from the heat.", "Crack the eggs into a large mixing bowl and beat in the sugar using an electric mixer. Beat until the mixture is thick enough to hold its shape for several seconds when drizzled on its surface (known as the ribbon stage, this can take around 15 minutes). Sift in a third of the flour and fold in using a large metal spoon. Sift in another third of the flour and fold in as before. Sift in the remaining flour into the butter mixture and mix well then gently fold into the rest of the batter.", "Transfer the batter to the tin and bake for 45 minutes (checking regularly to make sure it doesn’t over brown). When cooked, remove from the oven and leave to cool in the tin for 5 minutes. Remove from the tin and leave to cool on a wire rack. ", "For the buttercream, using an electric mixer beat the margarine, icing sugar and elderflower flavourings together in a large bowl. Keep beating until white and fluffy, then set aside in the fridge until needed.", "To assemble, if necessary, trim the top of the cake to ensure it is flat. Cut the cake in half horizontally. Add a generous layer of buttercream to the bottom layer of cake and then place the other layer on top. Transfer the cake to a serving board or cake stand.", "Spread a thin layer of buttercream all over the cake (also known as a crumb coat).", "Fit a large piping bag with a medium closed star nozzle. Smear streaks of the yellow food colouring on the inside of the piping bag using a pastry brush or a round tipped knife.  ", "Fill the piping bag with buttercream and pipe a few test dots until the buttercream comes out two-tone. Starting at the base of the cake, pipe lines of dots all around the cake to cover the sides, then start piping the top in circles of dots starting at the edge and working inwards. Place in the fridge between icing levels if you find the buttercream is melting. "]}, {"isVegetarian": false, "title": "Fantastic fish fingers", "url": "www_bbc_co_uk_food_recipes_floss_fantastic_fish_31623", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floss_fantastic_fish_31623_16x9.jpg", "ingredients": ["40g/1½oz bread (approximately 1 thick slice) ", "400g/14oz skinless white fish fillets (such as cod, haddock or pollock)", "5 tbsp plain flour", "1 large free-range egg, beaten", "¼ tsp paprika (optional)", "1 tsp garlic powder (optional)", "freshly ground black pepper", "little sunflower oil, a spray oil is also good to use"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with non-stick parchment paper. ", "To make the breadcrumbs, put the bread in a food processor and blitz into fine breadcrumbs. If you do not have a food processor, you could also try grating the bread, but you would need an adult to help you with this. ", "Pat the fish dry using kitchen paper. Carefully cut the fish into strips, the strips should be about 2cm thick and 8cm long. Run your finger gently over the fish to make sure all the bones have been taken out, you can get an adult to double-check this for you. ", "Set up your assembly line. Get 3 dinner plates and one shallow bowl ready.  ", "Put the flour on the first plate. Crack the egg into the shallow bowl and beat lightly using a fork.  Put the breadcrumbs on the second plate and mix with the paprika, garlic powder and black pepper. The third plate is for the coated fish fingers. ", "Toss each fish finger in the flour and shake off any excess. Next, dip the fish fingers into the egg mixture and allow any extra egg liquid to drip back into the bowl. Then coat the fish fingers with the breadcrumbs. Slightly press the fish fingers into the breadcrumbs to make sure they are well coated and then put them on the third plate. ", "Put the fish fingers in the fridge for 10 minutes, this will help the coating stick to the fish better.  Wash your hands again before moving on to the next step, it is really important to always wash your hands after handling raw fish or meat.", "Arrange the fish fingers in a single layer on the prepared baking tray. Drizzle or spray some oil over the fish fingers.", "Bake in the oven for 10-12 minutes, turning halfway through using cooking tongs. The fish fingers are cooked when the crumbs are golden-brown and the fish is cooked through.", "These fish fingers are best served with ketchup for dipping and with sweet potato wedges and peas alongside. "]}, {"isVegetarian": true, "title": "Rich flourless chocolate cake", "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_82362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz good-quality dark chocolate, chopped into pieces", "100g/3½oz unsalted butter, plus extra for greasing", "4 large free-range eggs, separated", "175g/6½oz icing sugar, sifted"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a large baking mould.", "In a small bowl resting over a saucepan of hot water, melt the chocolate and butter together (the bowl should not be touching the water).", "In a separate bowl whisk the egg yolks with the icing sugar until pale and creamy.", "Fold the melted chocolate into the egg mixture.", "Using a clean whisk, whisk the egg whites until soft peaks form, then fold gradually into the chocolate mixture.", "Using a spatula pour the mixture into the greased mould, then bake in the oven for approximately 30 minutes, until slightly cracked on the top, but still gooey in the middle. Serve."]}, {"isVegetarian": true, "title": "Floating islands with spun sugar", "url": "www_bbc_co_uk_food_recipes_floating_islands_with_03517", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/floating_islands_with_03517_16x9.jpg", "ingredients": ["300ml/10½fl oz whole milk", "300ml/10½fl oz double cream", "1 tsp vanilla bean paste", "6 free-range eggs, yolks only", "100g/3½oz caster sugar", "6 free-range eggs, whites only", "150g/5½oz caster sugar", "100g/3½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the poaching liquid (and what will become the crème anglaise), heat the milk and cream in a large lidded pan or deep-sided frying pan. Stir in the vanilla bean paste and bring to a simmer over a low heat.", "For the meringues, in a large grease-free bowl use an electric hand whisk to whisk the egg whites together on fast speed, until stiff peaks form when the whisk is removed. Add one tablespoon of the sugar to the egg whites and continue to whisk until the mixture comes back to stiff peaks. Keep adding sugar one tablespoon at a time until 150g/5½oz has been used, and the meringue is thick and glossy.", "Using two large tablespoons or serving spoons dipped in cold water, shape six large quenelles from the meringue mixture and place in the poaching liquid, over a very low heat for about 9-10 minutes, flipping the quenelles halfway through.  Cover the pan with a lid while poaching. Make sure the poaching liquid doesn’t boil or the meringues will puff up then collapse.", "When the quenelles are really puffed up and cooked, transfer them to a wire rack to drain.", "For the crème anglaise, pass the poaching milk through a sieve into a large jug.  ", "In a large bowl, whisk the egg yolks and caster sugar together until pale and fluffy.  Pour over the warm poaching milk, whisking continuously.  Pour the mixture into a clean heavy-based pan and cook over a very low heat for 3-4 minutes stirring continuously until smooth and thick enough to coat the back of a spoon. Remove from the heat and set aside.", "For the spun sugar, melt the sugar, without stirring, in a small stainless steel pan over a medium heat. Grease a rolling pin or knife steel with oil. Take care as the sugar will be very hot. When it turns a dark golden-brown remove from the heat. Leave to cool slightly, then, using the back of a fork, flick the caramel backwards and forward over the rolling pin or knife steel.  Gather the strands into rough ball shape and place on a sheet of parchment paper. ", "To serve, pour a little crème anglaise into each serving bowl and float a quenelle of meringue on top. Decorate the quenelle with a ball of spun sugar."]}, {"isVegetarian": true, "title": "Flourless chocolate cake", "url": "www_bbc_co_uk_food_recipes_flourlesschocolateca_93580", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flourlesschocolateca_93580_16x9.jpg", "ingredients": ["300g/10½oz plain chocolate, broken into pieces ", "225g/8oz caster sugar ", "175ml/6fl oz boiling water  ", "225g/8oz salted butter, cut into cubes, plus extra for greasing  ", "6 free-range eggs, separated  ", "1 tsp instant coffee powder ", "2 tsp vanilla extract ", "200ml/7fl oz crème fraîche", "255g/9oz summer berries ", "1 tbsp plain chocolate, grated", "Icing sugar, to dust"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cake, grease and line the base of a 23cm/9in springform tin with baking parchment. ", "Blend the chocolate and sugar in a food processor until a fine powder forms. Add the boiling water, butter, egg yolks, coffee powder and vanilla extract and blend until well combined.", "In a clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed, then, using a metal spoon, gently fold into the chocolate mixture.", "Pour the mixture into the prepared cake tin and bake for 45-55 minutes, or until a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven and allow to cool in the tin, then transfer to the fridge for 2-3 hours. ", "To serve, remove the cake from the tin and place on a serving plate or cake stand, spread the crème fraîche on top, then scatter over the berries. To decorate, grate some chocolate over the top, or dust with icing sugar."]}, {"isVegetarian": true, "title": "Flower power pizza", "url": "www_bbc_co_uk_food_recipes_flower_power_pizza_13681", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flower_power_pizza_13681_16x9.jpg", "ingredients": ["butter, ghee or coconut oil, for greasing", "140g/5oz cauliflower (about ¼ of a head without the stalk)", "1 egg white, beaten", "50g/1¾oz ground almonds", "40g/1½oz buckwheat flour", "½ tsp sea salt", "½ tsp black pepper", "¼ tsp bicarbonate of soda", "1 medium mozzarella ball", "2 handfuls fresh tomatoes (a mixture of colours look good)", "chilli flakes (optional)", "handful fresh basil", "drizzle of olive oil, to serve"], "serves": "Makes 1 30cm/12in pizza", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/190C fan/350F/Gas 4. Line a baking tray with baking parchment and lightly grease with butter, ghee or coconut oil.", "Grate the cauliflower into rice-sized pieces using a hand grater or food processor.", "Put all the pizza base ingredients in a bowl and mix well with a spoon, or add to the food processor and blend, to form a sticky dough.", "Using the back of a spoon, spread the dough out onto the greased parchment on the tray, shaping it into a circle 30cm/12in wide.", "Bake in the oven for about five minutes, then flip it over and return to the oven for another two minutes.", "Pull the mozzarella ball apart into small pieces and arrange over the base of the pizza.", "Slice the tomatoes into 1cm/½in thick slices and arrange over the pizza. Add the chilli flakes, if desired.", "Bake the pizza for 10-15 minutes more until the mozzarella is melted and bubbling.", "Sprinkle the basil over the top of the pizza before serving and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Fluffy American pancakes", "url": "www_bbc_co_uk_food_recipes_fluffyamericanpancak_74828", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fluffyamericanpancak_74828_16x9.jpg", "ingredients": ["135g/4¾oz plain flour", "1 tsp baking powder", "½ tsp salt", "2 tbsp caster sugar", "130ml/4½fl oz milk", "1 large egg, lightly beaten", "2 tbsp melted butter (allowed to cool slightly) or olive oil, plus extra for cooking", "Maple syrup", "Butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour, baking powder, salt and caster sugar into a large bowl. In a separate bowl or jug, lightly whisk together the milk and egg, then whisk in the melted butter.", "Pour the milk mixture into the flour mixture and, using a fork, beat until you have a smooth batter. Any lumps will soon disappear with a little mixing. Let the batter stand for a few minutes.", "Heat a non-stick frying pan over a medium heat and add a knob of butter. When it's melted, add a ladle of batter (or two if your frying pan is big enough to cook two pancakes at the same time). It will seem very thick but this is how it should be. Wait until the top of the pancake begins to bubble, then turn it over and cook until both sides are golden brown and the pancake has risen to about 1cm (½in) thick.", "Repeat until all the batter is used up. You can keep the pancakes warm in a low oven, but they taste best fresh out the pan.", "Serve with lashings of real maple syrup and extra butter if you like."]}, {"isVegetarian": true, "title": "Focaccia", "url": "www_bbc_co_uk_food_recipes_focaccia_08389", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focaccia_08389_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white bread flour", "2 tsp salt", "2 sachets dried easy blend yeast", "2 tbsp olive oil", "400ml/14fl oz cold water", "olive oil, for drizzling", "fine sea salt"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, salt, yeast, olive oil and 300ml/10½fl oz of the water into a large bowl. Gently stir with your hand or a wooden spoon to form a dough then knead the dough in the bowl for five minutes, gradually adding the remaining water.", "Stretch the dough by hand in the bowl, tuck the sides into the centre, turn the bowl 80 degrees and repeat the process for about five minutes.", "Tip the dough onto an oiled work surface and continue kneading for five more minutes. Return the dough to the bowl, cover and leave to rise until doubled in size.", "Line two large baking sheets with baking paper. Tip the dough out of the bowl and divide into two portions. Flatten each portion onto a baking sheet, pushing to the corners, then leave to prove for one hour.", "Preheat the oven to 220C/425F/Gas 7. Drizzle the loaves with oil, sprinkle with fine sea salt then bake in the oven for 20 minutes. When cooked, drizzle with a little more olive oil and serve hot or warm."]}, {"isVegetarian": true, "title": "Focaccia", "url": "www_bbc_co_uk_food_recipes_focaccia_82368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint tepid water", "1½ tsp dried yeast or 2 heaped tsp fresh yeast", "500g/1lb 2oz '00' flour or strong white bread flour, plus extra for dusting", "1½ tsp salt", "3 tbsp olive oil, plus extra for greasing ", "extra virgin olive oil, for drizzling", "medium coarse sea salt", "2 sprigs rosemary, torn into small pieces"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Pour a little of the tepid water into a small bowl. Add the yeast and blend using your fingers. Leave the yeast for five minutes to soften and dissolve.", "Mix the flour and salt together in a large mixing bowl. You may like to transfer your mixture to a pastry board or other flat work surface at this stage and prepare the dough there, in traditional Tuscan style. Otherwise, mix the dough in the bowl.", "Make a well in the centre of the flour and salt mixture. Pour the blended yeast and water into the well along with the olive oil. Mix thoroughly. Gradually add the rest of the tepid water until a sticky dough is formed.", "Transfer the dough onto a floured surface. Gather any stray pieces. Knead the dough for about 10 minutes, adding a little extra flour if necessary, until smooth and elastic and the dough no longer sticks to your hand. To see if it is ready, you can carry out the stretch test: pull off a piece of dough, it should be elastic enough not to break quickly when stretched out.", "Next accumulate any stray ends and rough sections by 'chafing' your ball of dough. Hold it and curve your hands around it, use your palms to pull at its sides gently while you slowly rotate it, letting your little fingers meet underneath. Do this for five minutes. You should be left with a neat, smooth ball.", "Oil a bowl and place the dough inside and cover with either oiled cling film or a damp tea towel. Leave in a warm place to rise until doubled in size - about 1½ hours depending on the room temperature.", "Use your fist to knock it back, then knead it again for a further two minutes. ", "Leave to rest again, but only for 5-10 minutes. ", "Shape by placing into a shallow baking tray, using your hands to spread it out to a depth of about 1.5cm/¾in, then allow to rise again, covered with a tea towel, until doubled in size - this will take about 30 minutes. Preheat the oven to 200C/400F/Gas 6.", "Create a dimpled effect by repeatedly pushing your fingertips gently into the surface of the dough. Drizzle a generous amount of extra virgin olive oil evenly over the dough. Sprinkle over the sea salt and push the small pieces of rosemary into the dough. ", "Bake for 25-35 minutes or until the top is crusty and cooked through to the base. Serve."]}, {"isVegetarian": true, "title": "Focaccia with garlic and rosemary", "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_28682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12g fresh yeast, or 7g instant yeast", "350ml/12fl oz lukewarm water ", "500g/1lb 2oz strong white bread flour, plus extra for dusting", "2 tsp salt ", "semolina or dried breadcrumbs, for sprinkling", "1 tbsp extra virgin olive oil, plus extra for drizzling ", "2 garlic cloves, finely chopped ", "needles of 2 rosemary branches, finely chopped ", "1 tsp sea salt ", "freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Dissolve the yeast in the warm water.  Place the flour and salt in a bowl, add the yeast mixture and mix to form a soft dough.  Lightly flour the work surface and knead well for 5 minutes until smooth and elastic.  Cover with a tea towel and rest in a warm place for 20 minutes. ", "Roll out the dough on a lightly floured work surface into a rectangular shape roughly the same as a 38x28cm/15x11in baking tray. Sprinkle the tray with semolina or breadcrumbs.  ", "Place the dough in the tray and pour the extra virgin olive oil in the middle.  With your fingers, spread the oil all over.  Leave for 5 minutes, then poke the dough all over with your fingers to make indentations.  Sprinkle the garlic, rosemary, salt and a little black pepper over the top. Cover with a cloth and leave to rest in a warm place for 45 minutes, or until doubled in size. ", "Preheat the oven to 240C/220C Fan/Gas 9. ", "Bake for about 15 minutes until evenly golden-brown.  Check the focaccia occasionally as domestic ovens often colour one side more, so turn the baking tray round accordingly.", "Remove and immediately drizzle a little extra virgin olive oil all over. Leave to cool, then cut into squares."]}, {"isVegetarian": true, "title": "Focaccia with garlic and rosemary", "url": "www_bbc_co_uk_food_recipes_focaccia_with_garlic_and_35777", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour ", "7g instant yeast ", "1 tsp salt ", "oil, for greasing", "2 tbsp extra virgin olive oil, plus extra to drizzle after baking", "3 rosemary branches, needles only, finely chopped ", "2 large garlic cloves, finely chopped ", "1 tsp flaked sea salt  ", "freshly ground black pepper "], "serves": "Makes 1 medium-sized rectangular focaccia", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the flour, yeast and salt with up to 350ml/12fl oz lukewarm water, until you have a soft dough. Knead for 10-15 minutes. Transfer to an oiled bowl, cover with cling film and leave to rise for 30 minutes.", "After 30 minutes, place into a lined and slightly warmed baking tray of 37 x 27cm/14 x 10¾in. Drizzle with olive oil and top with fresh rosemary, chopped garlic, sea salt and a little pepper.", "Press your fingers into the dough to make dimples and then rest again for another 30 minutes.", "Preheat the oven to 240C/450F/Gas 8. ", "Bake for about 15 minutes, or until evenly golden-brown.  Check the focaccia from time to time as domestic ovens can very often colour one side and not the other. Check and move the tray accordingly.  ", "Once cooked, remove from the oven and immediately drizzle some olive oil all over. Leave to cool, then cut into squares.  "]}, {"isVegetarian": true, "title": "Focaccia bread", "url": "www_bbc_co_uk_food_recipes_focacciabread_83716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3Ib 5oz strong white bread flour", "1 x 7g/¼oz sachet dried yeast", "50ml/2fl oz olive oil, plus a little extra for oiling", "pinch salt", "570ml/20fl oz/1 pint warm water", "sprigs rosemary", "2 tbsp olive oil", "1 tsp coarse sea salt"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, yeast, olive oil and salt in a mixer with a dough hook.", "Add the water to make a soft dough, and knead in the mixer until smooth and shiny.", "Transfer to an oiled bowl, cover with a tea towel and leave in a warm place for about an hour until well risen. ", "Tip the mix out onto a floured surface and knead to knock out any air pockets. Roll the dough into an oval-like shape about 2cm/¾in thick. Transfer to an oiled baking tray.", "Firmly press your fingers into the surface to 'pit' the surface. For the topping, drizzle with olive oil and lightly grind sea salt over the top. ", "Put a small sprig of rosemary into each pit. ", "Cover with a tea towel and set the loaf aside for another 20 minutes.  ", "Preheat the oven to 200C/400F/Gas 6.", "Transfer the loaf to the middle shelf of the oven and cook for about 15 minutes until golden brown.", "Serve straightaway."]}, {"isVegetarian": true, "title": "Focaccia with rosemary", "url": "www_bbc_co_uk_food_recipes_focacciawithrosemary_90210", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/focacciawithrosemary_90210_16x9.jpg", "ingredients": ["30g/1oz fresh yeast", "½ tsp sugar", "600ml/1 pint 2fl oz warm water", "4 tbsp olive oil, plus extra for oiling", "680g/1½lb strong white flour, plus extra for dusting", "2 tsp salt", "2 tbsp olive oil", "1½ tsp coarse salt", "leaves from 3-4 rosemary sprigs"], "serves": "Makes 2 loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the yeast with the sugar in a small bowl for about 30 seconds, until the yeast becomes liquid. Stir in two-thirds of the water and the olive oil.", "In a large bowl stir together the flour and the salt. Pour the yeast mixture into the flour and salt along with some of the remaining water, if needed. Mix with a wooden spoon and bring together to form a soft dough. Add more water if the dough is a bit dry.", "Turn the dough out onto a lightly floured surface and knead for ten minutes until smooth and elastic.", "Place the dough into a large, lightly oiled bowl. Cover with cling film or a damp cloth and leave in a warm place to rise for about 1½ hours until doubled in size.", "Preheat the oven to 220C/400F/Gas 7.", "When the dough has risen, knead it again for about five minutes on a clean floured work surface to 'knock it back'.", "Shape the dough into two rough circles. Place the circles onto two baking sheets, cover with a clean, damp cloth and allow to prove (rise) until double their original size (about 10-15 minutes).", "When the dough has risen, use your fingertips to form dimples in the dough. Brush with the olive oil and sprinkle with the salt and rosemary leaves.", "Transfer the baking sheets to the oven and bake for ten minutes.", "Reduce the heat to 190C/375F/Gas 5 and bake for a further 25-30 minutes until the loaves are golden and cooked-through. If you like, you can spray the bread with water (using a mister) once or twice during baking so that it 'steams' in the oven.", "When baked, turn out onto a wire rack to cool slightly. The focaccia is best eaten the day it's made."]}, {"isVegetarian": true, "title": "Fondant fancies", "url": "www_bbc_co_uk_food_recipes_fondant_fancies_28732", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondant_fancies_28732_16x9.jpg", "ingredients": ["175g/6oz unsalted butter, softened", "175g/6oz caster sugar", "3 free-range eggs, lightly beaten", "175g/6oz self-raising flour", "1-2 tbsp milk", "50g/1¾oz caster sugar", "50ml/2fl oz water", "¼ tsp lemon essence", "150g/5½oz icing sugar", "75g/2¾oz butter, softened", "3-5  tbsp strawberry jam", "2 tbsp apricot jam, warmed gently, then passed through a sieve", "250g/9oz marzipan", "450g/1 lb fondant icing sugar", "green, pink and yellow food colouring", "sugar flowers, to decorate"], "serves": "Makes 25", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease and line a 20cm/8in square cake tin.", "Beat together the butter and sugar in a bowl until light and fluffy. Beat in the eggs, a little at a time, until well combined. (If the mixture looks like it is curdling add a spoonful of the flour.)  Fold in the flour and add a little milk if the mixture looks a stiff.", "Spoon the cake batter into the cake tin and level using the back of a spoon.  Bake for 35-40 minutes, or until golden-brown and a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven, set aside to cool for five minutes, then turn out and allow to cool completely upside down, on a wire rack.", "Meanwhile, for the sugar syrup, heat the sugar and water in a saucepan until the sugar has dissolved. Stir in the lemon essence.", "For the filling, beat the butter in a bowl until soft and smooth, slowly beat in the icing sugar. Continue to beat until fluffy. ", "Very carefully, using the longest knife you have, remove the dark crust from the top of the cake and turn the cake upside down.  Then cut the cake in half horizontally.", "Drizzle or brush the bottom cake layer with the sugar syrup and then spread with the buttercream. Top with the jam and carefully sandwich with the top half of the cake. ", "Wrap the cake in cling film and chill for 2-3 hours, this will make it easier to cut the cake later. ", "Lightly dust the work surface with icing sugar and roll out the marzipan to the same size as the cake.  Once the cake is chilled. brush the top of the cake with the sieved apricot jam.  Carefully lift the marzipan onto the cake smooth it flat along the top of the cake and cut off any excess marzipan. Cut the cake into equal 25 x 4cm/1½in squares. ", "Sieve the fondant icing sugar into a small bowl and stir in enough hot water to make a smooth icing thick enough to coat the cakes. Reserve three tablespoons of the icing into another bowl, cover with cling film and set aside.  ", "Divide the remaining icing into three bowls. Add a few drops of green food colouring to one of the bowls of icing and mix until smooth. Repeat with the other bowls of icing using the pink and yellow food colouring. ", "Coat the cake squares with the icing, easing the icing down the sides of the cakes until you have an even coating all over the cakes.  Sit the cakes on a cooling rack until the icing is set. ", "Spoon the reserved icing into a piping bag with a very fine nozzle and pipe simple decorations onto the fondant fancies. Squeeze a little of the icing onto the sugar flowers and use them to decorate the fondant fancies."]}, {"isVegetarian": true, "title": "Mary Berry's fondant fancies", "url": "www_bbc_co_uk_food_recipes_fondant_fancies_88368", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondant_fancies_88368_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "225g/8oz baking spread or softened butter", "225g/8oz caster sugar", "1 lemon, grated rind only", "4 free-range eggs", "250g/9oz unsalted butter, softened", "200g/7oz icing sugar", "3 tbsp apricot jam", "200g/7oz marzipan", "1 kg/2lb 4oz white fondant icing", "150ml/5fl oz water", "food colouring (any colour)", "flavouring (any flavouring)", "100g/3½oz dark chocolate"], "serves": "Makes 25", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Grease and line a 20cm/8in square tin with two strips of parchment paper.", "For the sponge, beat together all the sponge ingredients until smooth. Tip the cake mixture into the tin and tap lightly to level out. ", "Bake for about 40 minutes, or until a metal skewer inserted in the middle comes out clean.", "Allow to cool in the tin for 10 minutes, then turn out and allow to cool completely on a wire rack, before putting in the fridge to chill (or alternatively place in the freezer for a few minutes until chilled but not frozen).", "While the cake is chilling, make the buttercream.  Beat together the softened butter and icing sugar in a bowl until lighter in colour, and smooth.", "Place 100g/3½oz of the buttercream in a piping bag and allow to slightly firm up in the fridge.  Keep the rest in a bowl for the cake sides.", "For the marzipan topping, heat the apricot jam in a small saucepan and sieve it into a bowl.", "Brush the top of the cake with the sieved apricot jam.  ", "Roll the marzipan out very thinly, cover the top of the cake and chill again.", "Cut the cake into 25 equal squares (each 4cm/1½in square).  You may need to cut off the edges if they have rounded and pulled away from the sides of the tin - all the edges must be straight and neat.", "Cover four sides of each square with buttercream (not the marzipan top or the base). Using the buttercream in the piping bag, pipe a blob in the centre of each square on top of the marzipan. Leave to set in the fridge for 20 minutes.", "For the icing and decoration, cut the fondant icing into small cubes. Place in a sturdy free-standing mixer with a paddle. Churn the icing until it stars to break down, adding a splash of water if it's too hard. Very gradually add the water - the icing will become smooth and more liquid.", "Add flavouring and food colouring to taste - be careful not to add too much at once, you can always add more but can’t undo it!", "Melt the chocolate either in the microwave or in a heatproof bowl set over a pot of simmering water (do not allow the bottom of the bowl to touch the water).  Once melted, place the chocolate in piping bag and set aside.  ", "Take the cakes out of the fridge and place one onto a fork.", "Dip each square into the icing one at a time and carefully set onto a cooling rack, with parchment underneath to catch the drips. Try not to get finger prints on them - for this reason it is best to insert the fork at an angle so that you can slide the cake off onto the cooling rack easily.  ", "Leave the fondant to set, but do not put in the fridge as the icing will lose its shine.", "Using the piping bag of melted chocolate, drizzle the chocolate over each fancy in a zig-zag pattern.", "Leave to set and then place on a cake stand to serve."]}, {"isVegetarian": true, "title": "Fondant potatoes", "url": "www_bbc_co_uk_food_recipes_fondantpotatoes_93087", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fondantpotatoes_93087_16x9.jpg", "ingredients": ["150g/5oz butter", "4 potatoes, peeled, cut into barrel-shapes using a cookie cutter", "75ml/3fl oz chicken or vegetable stock", "2 garlic cloves, peeled, crushed lightly with the edge of a knife", "2-3 sprigs fresh thyme", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter over a medium heat in a saucepan. When the butter is foaming, add the potatoes and fry until deep golden-brown on one side, about 5-6 minutes. (Do not move the potatoes as they cook.)", "Turn over the potatoes and cook for a further 5-6 minutes, or until golden-brown on both sides. ", "Carefully pour in the stock, then add the garlic cloves and thyme sprigs. (CAUTION: the hot fat will splutter when it comes into contact with the stock.) Season, to taste, with salt and freshly ground black pepper.", "Cover the pan with a lid and reduce the heat until the stock is simmering. Simmer the potatoes until tender, then remove the potatoes from the pan using a slotted spoon and keep warm."]}, {"isVegetarian": true, "title": "Foolproof green salad", "url": "www_bbc_co_uk_food_recipes_fool-proof_green_salad_90764", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fool-proof_green_salad_90764_16x9.jpg", "ingredients": ["8 tbsp extra virgin olive oil", "3 tbsp white wine vinegar", "1 tbsp balsamic vinegar", "1 tbsp Dijon mustard", "1 tbsp caster sugar", "1 bunch fresh dill, chopped", "salt and freshly ground black pepper", "8 spring onions, thinly sliced", "8 celery sticks, thinly sliced", "1 small fennel bulb, thinly sliced", "½ large cucumber, halved lengthways and sliced", "200g/7oz mixed salad leaves, roughly torn", "1 Romaine lettuce, roughly torn", "100g/3½oz rocket or watercress, roughly torn"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, put the oil, vinegars, mustard, sugar and salt and pepper in a bowl and whisk until evenly combined and thickened. Taste and season again if needed, then mix in the dill.", "Put the spring onions, celery and fennel in a large salad bowl. Pour in the dressing and toss well. ", "Place half the cucumber and half the mixed leaves, Romaine lettuce and rocket in the bowl. Season, then top with the remaining cucumber, leaves, Romaine lettuce and rocket. Season well and chill for up to 4 hours", "Just before serving, toss everything together."]}, {"isVegetarian": true, "title": "Foolproof cheese soufflé", "url": "www_bbc_co_uk_food_recipes_foolproofcheesesouff_65612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter, plus extra for buttering soufflé dish ", "30g/1oz plain flour ('00' if possible) ", "150ml/5fl oz full-fat milk ", "1 tsp Dijon mustard ", "pinch cayenne pepper ", "4 eggs, 4 whites and 2 yolks ", "85g/3oz grated cheese (I use gruyère, but you can use any hard cheese) ", "salt and pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven on to 200C/400F/Gas 6. ", "Heat the milk until just below boiling. ", "Melt the butter, stir in the flour and cook for 1 minute. Take off the heat and gradually beat in the milk. Cook for 1 minute until you have a thick sauce. ", "Season well and stir in the mustard. Cool for 1 minute whilst you butter the soufflé dish. ", "Separate the eggs. Beat the yolks into the sauce along with most of cheese. ", "Whisk the egg whites until you have soft peaks, don't overdo. Fold into the sauce. Fill the dish three quarters full. Run your finger round the edge to get a 'top-hat' finish. ", "Place into an oven dish, top with the remaining cheese and a pinch of cayenne. ", "Place in the oven and cook for 15-17 minutes."]}, {"isVegetarian": true, "title": "Foolproof mayonnaise", "url": "www_bbc_co_uk_food_recipes_foolproofmayonnaise_93365", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range egg yolks", "1 free-range egg", "1 tbsp French mustard", "½ lemon, juice only", "½ tsp caster sugar", "400ml/14¼fl oz vegetable oil", "Salt and freshly ground black pepper"], "serves": "Makes 400ml", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all the ingredients except the oil in a food processor for 10-15 seconds, or until well combined. While the motor is running, pour the oil into the food processor very slowly until the well combined and the mixture is thick and glossy.", "Season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Football pies", "url": "www_bbc_co_uk_food_recipes_football_pies_25880", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/football_pies_25880_16x9.jpg", "ingredients": ["250g/9oz plain flour, plus extra for dusting ", "pinch salt", "125g/4½oz chilled butter, cubed", "2 medium egg yolks", "1 free-range egg, beaten for egg wash", "splash of oil, for frying", "1 small onion, chopped", "500g/1lb 2oz lean steak mince", "1 tbsp tomato purée", "1 tbsp plain flour", "200ml/7fl oz beef stock", "a few dashes of Worcestershire sauce", "100g/3½oz frozen peas", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour, salt and butter in a bowl and rub together using your fingertips, until the mixture resembles breadcrumbs and there are no lumps of butter left. Add the egg yolks and a tablespoon cold water. Gently bring the pastry together, adding more water if necessary. ", "Tip the pastry onto a lightly floured work-surface and gently knead until it has formed into a shiny ball. Wrap in cling-film and chill for at least 45 minutes.", "For the filling, heat the oil in a large frying pan, and fry the onion until it begins to soften. Add the mince and fry until completely browned, moving it all the time. Add the tomato purée and cook for a few minutes. Add the flour and cook for 1 minute, pour in the stock and a few shakes of Worcestershire sauce. ", "Turn the heat down to a simmer, season and leave to cook for about 20 minutes or until the sauce has reduced and thickened. Turn off the heat and leave to cool.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Remove the pastry from the fridge and unwrap it. Divide the pastry into quarters and then halve each quarter. ", "To line each of the pie dishes, roll out one of the pieces of pastry to a thickness of 2mm, and line the foil pastry case by gently pressing the pastry right to the base. There needs to be about 1cm pastry overhanging the edges. Repeat to line the other tins.", "Now roll out the other pieces of pastry, slightly thicker this time, to make the pie lids. ", "Mix the peas into the cooled filling and divide between the pie dishes. Brush a little egg wash around the overhanging pastry and place the lids on top. Trim the edges of the pastry. Crimp the edges of the pastry by pinching the edge with your forefinger and thumb, and then using the forefinger of your other hand, push up from below, creating a neat wave. Repeat all the way around the edge.  ", "Brush a little more egg wash on top, and score a design in the top of the pastry to make it look like a football. Place on a baking tray, and bake for 30-40 minutes, or until the pies are crisp and golden-brown. ", "Remove from the oven and wait ten minutes before removing the pastry cases. Serve warm. "]}, {"isVegetarian": true, "title": "Forest fruit and white chocolate arctic roll", "url": "www_bbc_co_uk_food_recipes_forest_fruit_and_white_67803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450ml/16fl oz whole milk", "1 vanilla pod, seeds removed", "300g/10½oz good-quality white chocolate, broken into pieces", "6 large free-range egg yolks", "110g/4oz caster sugar", "300ml/10fl oz double cream", "150–200g/5½–7oz frozen fruits of the forest", "3 medium free-range eggs", "100g/3½oz caster sugar", "80g/3oz plain flour", "2 tsp cocoa powder", "250g/9oz frozen fruits of the forest", "125ml/4fl oz cassis", "150g/5½oz white chocolate, melted"], "serves": "Serves 6–8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Pour the milk into a large saucepan, add the vanilla pod and bring to a simmer. Slowly add the white chocolate, whisking all the time until melted. Remove from the heat.", "Put the egg yolks and sugar in a large glass bowl and beat using an electric hand whisk until pale.", "Gradually pour the milk mixture over the egg mixture, whisking all the time. Pour the custard back into the saucepan, then cook over a low heat until the mixture is thick enough to coat the back of a spoon. Leave to cool.", "Once cool, mix in the cream and fruit. Transfer to an ice cream machine and churn until it starts to firm up.", "Remove the ice cream and lay it on a sheet of cling film. Mould it into an 23cm/9in long log and wrap it in the cling film, then secure the ends with a twist. Place in the freezer.", "For the chocolate sponge, preheat the oven to 200C/180C Fan/Gas 6. Line a 23x33cm/9x13in Swiss roll tin with greaseproof paper.", "Put the eggs and sugar into a large glass bowl and beat using a hand-held whisk until doubled in size. Sieve and then fold in the flour and cocoa powder, keeping the air in the mix. Pour the mixture into the lined tin and bake for 8-10 minutes. Leave to cool.", "To assemble the arctic roll, lay the ice cream log at one end of the sponge and roll up. Wrap in cling film and freeze for 1 hour, or until firm.", "To serve, put the fruits and cassis in a medium saucepan and warm through. Pour the fruit over the log and drizzle with the melted white chocolate."]}, {"isVegetarian": false, "title": "Forest truffle chicken", "url": "www_bbc_co_uk_food_recipes_forest_truffle_chicken_19890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/forest_truffle_chicken_19890_16x9.jpg", "ingredients": ["100ml/3½fl oz rapeseed oil", "1 large chicken, jointed into 8 pieces", "salt and black pepper", "200g/7oz bacon lardons", "200g/7oz shallots, peeled and cut in half lengthways", "1 garlic bulb, cut in half horizontally", "500g/1lb 2oz wild mushrooms (such as chanterelles, girolles, ceps, and morelles), cleaned ", "50g/1¾oz butter", "50ml/2fl oz madeira ", "500ml/18fl oz dark chicken stock", "200ml/7fl oz double cream", "1 bunch fresh tarragon", "1 small truffle"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Add half the oil to a large hot pan. ", "Season the chicken pieces with salt and pepper. Add to the pan and fry until deep-golden brown, then turn over and repeat on the other side.", "Heat a large casserole or heavy based pan until hot then add two tablespoons of oil. Fry the lardons until crisp, then add the shallots and garlic and cook until coloured. ", "Transfer the chicken to the casserole. In the same frying pan, fry the mushrooms in the butter for 3-4 minutes. Add the Madeira, stock, cream and tarragon. Season to taste with salt and freshly ground black pepper.", "Pour the sauce over the chicken and simmer for 15-20 minutes.", "To serve, pile the chicken in a serving bowl, cover in sauce and shave over the truffle."]}, {"isVegetarian": true, "title": "Forest fruit crumble with custard", "url": "www_bbc_co_uk_food_recipes_forestfruitcrumblewi_85408", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, plus extra for greasing ", "100g/3½oz caster sugar", "4 ready-made ginger biscuits", "120g/4oz pistachio nuts", "55g/2oz plain flour", "200g/7oz frozen forest fruits", "5 tbsp milk", "5 tbsp double cream", "1 free-range egg yolk", "1 tbsp caster sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease an ovenproof dish with butter.", "Place the butter, sugar, ginger biscuits, pistachios and flour into a food processor and pulse until the mixture resembles breadcrumbs.", "Place a layer of the frozen forest fruits into the base of the ovenproof dish and top with the crumble mixture.", "Transfer to the oven and bake for 10-15 minutes, until the topping is crisp and golden.", "For the custard, place the milk and cream into a saucepan over a medium heat and heat until steaming. Remove from the heat and allow to cool slightly.", "Whisk the egg yolk and sugar together in a bowl.", "Gradually pour the milk and cream mixture into the yolk and sugar, whisking constantly.", "Return the custard mixture to the milk saucepan and simmer gently over a medium heat, stirring constantly, until the custard thickens and coats the back of a spoon.", "Strain the custard through a sieve into a jug.", "To serve, spoon a portion of the crumble into a bowl and pour over some custard."]}, {"isVegetarian": true, "title": "Forest fruits cheesecake", "url": "www_bbc_co_uk_food_recipes_forestfruitscheeseca_85409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 ready-made ginger biscuits, crushed", "30g/1oz butter, melted", "55g/2oz mascarpone", "55g/2oz double cream", "1 tbsp honey", "½ lemon, juice only", "85g/3oz frozen forest fruits"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the crushed biscuits with the melted butter in a bowl.", "Place a deep chefs' ring onto a plate and press the biscuit mixture into the base of the ring.", "In a clean bowl, mix together the mascarpone, cream, honey and lemon juice.", "Place three tablespoons of the frozen forest fruits over the biscuit base, then spoon over the cream mixture. Add the remaining fruit to fill the ring.", "Carefully remove the chefs' ring (you may need to use a mini-blowtorch to loosen the ring) and serve."]}, {"isVegetarian": true, "title": "Forgotten cookies", "url": "www_bbc_co_uk_food_recipes_forgotten_cookies_60368", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/forgotten_cookies_60368_16x9.jpg", "ingredients": ["2 large free-range egg whites, at room temperature", "pinch fine sea salt", "100g/3½oz caster sugar ", "1 tsp cornflour ", "1 tsp cider vinegar or white wine vinegar ", "¼ tsp ground cardamom ", "75g/2½oz mini dark chocolate chips ", "75g/2½oz pistachios, finely chopped"], "serves": "Makes 12–14", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4 and line a large baking tray with baking paper. Whisk together the egg whites and salt in a grease-free bowl, until you have soft peaks. Whisk in the sugar a little at a time until thick and gleaming.", "By hand, fold in the cornflour, vinegar and cardamom, then add the chocolate chips and most of the pistachios and very gently fold these in too.", "With a spoon, drop mounded blobs of the mixture, 4–5cm/2in in diameter, onto the prepared tray. Sprinkle with the remaining pistachios.", "Put the cookies into the oven, shut the door and turn off the oven immediately. Let the cookies sit in the turned-off oven overnight."]}, {"isVegetarian": true, "title": "Fortune cookies", "url": "www_bbc_co_uk_food_recipes_fortune_cookies_37274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "1½ tbsp cornflour", "50g/1¾oz caster sugar", "1 tsp salt", "3 tbsp vegetable oil", "3 free-range eggs, whites only", "1 tsp water", "1½ tsp vanilla extract", "½ tsp almond extract "], "serves": "Makes 15 cookies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line a baking tray with a silicone mat. Write fortunes on pieces of paper about 6cm x 1cm/2½in x ½in. ", "Sift the flour and cornflour into a large bowl then add the sugar and salt and mix well. Using a wooden spoon, stir in the oil, egg whites, water and vanilla and almond extracts. ", "Place tablespoons of the mixture onto the silicone mat and use the back of a metal spoon to swirl out the mixture into 10cm/4in circles. Leave space between each cookie as they will spread a little during cooking; you will get about five cookies onto the baking tray so will have to cook them in batches. Bake in the oven for 10-12 minutes. The outer edge of each cookie should turn golden brown and the cookies should be easy to remove with a spatula when cooked.", "Place a fortune in the centre of each cookie and while the cookie is still soft and pliable, fold it in half and pinch the semi circular edges together to seal.  Place the folded edge of the cookie onto the rim of a cup or glass and gently pull the two corners down, one on the inside of the cup and one on the outside, to form the classic fortune cookie shape. Set aside to cool and repeat with the remaining cookies."]}, {"isVegetarian": false, "title": "Fougasse with chickpea and olive oil purée, pesto and tapenade", "url": "www_bbc_co_uk_food_recipes_fougasse_with_chickpea_84307", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/¼oz fresh yeast (or 1 x 7g sachet fast action yeast)", "500g/1lb 2oz strong bread flour", "2 tsp salt", "350g/12oz water (weighing the water is more accurate)", "1 x 400g/14oz tinned chickpeas, drained and rinsed well", "2 garlic cloves, roughly chopped", "1 lemon, juice only", "250ml/9floz extra virgin olive oil", "110g/4oz pine nuts", "3 garlic cloves, roughly chopped", "110g/4oz parmesan, grated", "1 lemon, juice only", "3-4 bunches fresh basil ", "4 tbsp extra virgin olive oil", "sea salt", "300g/11oz black olives, stones removed", "75g/3oz tinned tuna in olive oil", "150g/5oz capers, drained", "½ lemon, juice only", "5 tbsp extra virgin olive oil"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fougasse, preheat the oven to 240C/475F/Gas 9 and preheat a baking stone or upturned baking tray.", "Rub the yeast into the flour using your fingertips. ", "Add the salt and water and, holding the bowl with one hand, mix the ingredients with your other hand for 2-3 minutes, or until the mixture comes together as a dough. ", "Scoop the dough out onto the work surface and continue to knead the dough, stretching and folding it over on itself until it becomes smooth and elastic. Place the dough into a bowl, cover with cling film and set aside for at least one hour, or until the dough has doubled in size.", "Use a plastic spatula to release the dough from the bowl - you should be able to scoop it out easily in one piece and transfer it to the work surface without stretching it. Be careful not to deflate the dough when handling it, but let it spread out to cover a square of your work surface. Generously flour the top of the dough.", "Cut the dough into two rectangles, then cut each piece again into three roughly rectangular pieces. ", "Handle the dough as gently as you can so that it stays as light and full of air as possible and keep the pieces well-floured. Cut a large diagonal cut across the centre of each piece of dough, making sure that you don’t go right to the edges of the dough, but cut all the way through the dough to the work surface.", "Make three smaller diagonal cuts fanning out on each side of the central one.", "Put your fingers into the slits and gently open them out to form holes. (Be bold - it is better to make a fewer cuts and really open out the holes.)", "Lift the pieces of dough onto a lightly floured wooden peel or flat-edged baking tray, then slide them onto the preheated baking stone.", "Spray water into the inside of the oven and close the door. Reduce the heat to 230C/450F/Gas 8 and bake for 10-12 minutes, or until golden brown.", "Meanwhile, for the chickpea and olive oil purée, pulse the chickpeas and garlic in a blender or food processor until smooth. Add the lemon juice, and pulse until smooth, then add the olive, a little at a time and pulse until the mixture is a quite loose, but not too runny, paste. (You may not need all of the olive oil.) ", "For the pesto, pulse the pine nuts, garlic and parmesan in a blender to a coarse paste.", "Add the basil and pulse again, then add the lemon juice and the olive oil, a little at a time, until you have the texture you want. Season, to taste, with salt. (The key to a good pesto is not to overwork the ingredients, otherwise the basil bruises and will start to turn black and lose its fresh flavour.)", "For the tapenade, blend the olives in a food processor until roughly chopped. Add the remaining ingredients and keep pulsing in short bursts to a coarse paste.", "Serve the fougasse with the dips."]}, {"isVegetarian": true, "title": "Four nut chocolate brownies", "url": "www_bbc_co_uk_food_recipes_fournutchocolatebrow_67259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz macadamia nuts ", "25g/1oz Brazil nuts ", "25g/1oz pecan nuts ", "25g/1oz hazelnuts ", "50g/2oz dark chocolate (75 per cent cocoa solids) ", "110g/4oz butter ", "2 eggs, beaten ", "225g/8oz granulated sugar ", "50g/2oz plain flour ", "1 level tsp baking powder ", "¼ level teaspoon salt"], "serves": "Makes 15", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Begin by chopping the nuts roughly, not too small, then place them on a baking sheet and toast them in a preheated oven for 8 minutes exactly. Please use a timer here otherwise you'll be throwing burned nuts away all day! ", "While the nuts are cooking, put the chocolate and butter together in a large mixing bowl fitted over a saucepan of barely simmering water, making sure the bowl doesn't touch the water. ", "Allow the chocolate to melt, then beat it until smooth, remove it from the heat and ", "simply stir in all the other ingredients until thoroughly blended.", "Now spread the mixture evenly into the prepared tin and bake on the centre shelf of the oven for 30 minutes or until it's slightly springy in the centre. ", "Remove the tin from the oven and leave it to cool for 10 minutes before cutting into roughly 15 squares. Then, using a palette knife, transfer the squares on to a wire rack to finish cooling."]}, {"isVegetarian": false, "title": "Fragrant chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_fragrant_chicken_noodle_59139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints chicken stock (home-made or bought)", "2 lemongrass stalks", "4 bird’s eye chillies", "4-5 kaffir lime leaves (optional)", "3 long shallots, peeled and finely sliced", "50g/2oz piece fresh root ginger, peeled and sliced thinly", "3 garlic cloves, peeled and halved lengthways", "4 tbsp lime juice", "2 tbsp nam pla (Thai fish sauce)", "100g/3½oz medium rice or egg noodles", "100g/3½oz mange tout, trimmed and sliced diagonally ", "1 red pepper, deseeded and very thinly sliced", "small bunch fresh coriander, roughly torn", "250g/9oz minced chicken", "2 spring onions, trimmed and finely sliced", "1 garlic clove, peeled and crushed", "1 birds eye chilli, finely chopped ", "1 tbsp cornflour, plus extra for dusting", "¼ tsp fine sea salt", "2 tbsp chopped fresh coriander leaves", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the soup base, pour the stock into a large saucepan and bring to a simmer. Finely chop one of the lemongrass stalks and add to the pan. Split two of the chillies lengthways almost all the way through and add to the pan. ", "Add the lime leaves, if using, one of the sliced shallots and all the ginger and garlic. Bring to a low simmer and cook gently for 15 minutes. Remove from the heat and leave to stand..", "For the chicken balls, put all the ingredients in a large bowl and mix until well combined. Tip some cornflour onto a plate and use dust your hands. Roll the chicken mixture into 16 small balls and put on a large dinner plate. ", "Strain the infused stock through a sieve into a clean pan. Stir in the remaining shallots, lime juice and fish sauce.  Slice the remaining two bird’s eye chilles very finely and add to the pan. Bash the lemon grass with a rolling pin to bruise, and stir into the stock.", "Bring to a gentle simmer and add the chicken balls. Cook for five minutes, allowing the liquid to bubble. Add the noodles and return to a simmer for two minutes. ", "Stir in the mange tout and red pepper and simmer for two minutes more until the chicken balls are cooked through and the vegetables and noodles are just tender. Add salt and freshly ground black pepper, to taste, adding a little extra lime juice or fish sauce if needed.", "Ladle into deep bowls, scatter the coriander over and serve."]}, {"isVegetarian": true, "title": "Fragrant pilau rice", "url": "www_bbc_co_uk_food_recipes_fragrantpilaurice_67870", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fragrantpilaurice_67870_16x9.jpg", "ingredients": ["450g/1lb basmati rice (for a more authentic flavour and texture it is best not to use easy-cook rice; however, it will still work and be very tasty if you do)", "1 medium onion, finely chopped", "large knob butter, plus extra to serve", "4 cardamom pods", "8 cloves", "1 cinnamon stick", "pinch saffron threads (optional)", "2 bay leaves", "600ml/1 pint hot chicken stock, vegetable stock or water", "salt"], "serves": "4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["To make sure you get lovely fluffy rice, wash it in several changes of cold water, then leave to soak for about 30 minutes in fresh cold water. If you don't have time for this, place in a sieve and wash under the cold tap for a minute or so.", "Cook the onion in the butter for around 5 minutes until softened. Add the spices, saffron and bay leaves and cook for a couple more minutes. The spices will give a wonderful fragrant flavour to the rice. Add the rice and stir until the grains are coated in the butter before stirring in the stock or water and salt. Bring to the boil and then cover with a tight-fitting lid. If the lid isn't very tight, cover the pan with aluminium foil before putting the lid on. Turn the heat down low and leave to cook for 10 minutes before turning off the heat. Don't remove the lid; just leave the rice to continue cooking in the pan for about 5 minutes until you're ready to serve. ", "The rice should have absorbed all the water and will just need fluffing up with a fork. Add a knob of butter before serving."]}, {"isVegetarian": false, "title": "Fragrant pork and aubergines", "url": "www_bbc_co_uk_food_recipes_fragrantpork_89290", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fragrantpork_89290_16x9.jpg", "ingredients": ["4 tbsp groundnut oil ", "1 aubergine, halved lengthways and cut into 1cm/½in slices", "2 garlic cloves, finely chopped ", "1 tbsp grated fresh root ginger ", "1 red chilli, finely chopped ", "200g/7oz pork mince", "1 tbsp Shaoxing rice wine or dry sherry", "2 tbsp chilli bean sauce (available from Asian grocers)", "200ml/7fl oz hot chicken stock", "2 heads pak choi or ½ Chinese cabbage, halved and sliced lengthways ", "1 tbsp clear rice vinegar or cider vinegar", "1 tsp toasted sesame oil", "2 spring onions, chopped", "1 tbsp cornflour, mixed with 2 tbsp cold water"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add two tablespoons of the groundnut oil, then fry the aubergine slices with a splash of water for 3-4 minutes, or until softened and golden-brown all over. Transfer to a plate and set aside.", "Wipe away the excess oil from the wok, reheat and add the remaining groundnut oil. Heat until smoking. Stir fry the garlic, ginger and chilli for a few seconds, then add the minced pork. Stir fry for one minute, then add the rice wine or sherry. Cook for 3-4 minutes, or until browned, then add the chilli bean sauce and hot chicken stock. Return the aubergines to the wok and add the pak choi.", "Season, to taste, with the vinegar and sesame oil and bring to the boil. Cook for 3-4 minutes, or until the pork is cooked through, then stir in the spring onions. Add the cornflour paste and stir until the liquid has thickened. ", "Spoon the fragrant pork and aubergines into a serving bowl and serve immediately."]}, {"isVegetarian": false, "title": "Fragrant Thai prawns with lemongrass, chilli, broccoli and cashews", "url": "www_bbc_co_uk_food_recipes_fragrantthaiprawnswi_89380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz broccoli, cut into florets", "400ml/14fl oz fish stock", "1 stalk lemongrass, tough outer leaves removed, inside chopped", "¼ onion, chopped", "1 tbsp tomato purée", "3 heads from tiger prawns (see below)", "1 tbsp vegetable oil", "½ onion, sliced", "2 garlic cloves, finely chopped", "1 red chilli, finely sliced", "3 tiger prawns, peeled and de-veined", "55g/2oz cashew nuts, toasted", "1 lime, juice only", "2 tbsp chopped fresh coriander", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil. Add the broccoli florets and cook for 1-2 minutes, or until they have softened slightly but are still firm. Drain.", "Simmer the fish stock, lemongrass, chopped onion and tomato purée in a separate saucepan over a medium heat. ", "Add the prawn heads to the stock. Simmer for 5-7 minutes, then remove from the heat, strain, and set the stock aside. Discard the prawn heads.", "For the prawns and broccoli, heat the oil over a medium heat, then fry the onion, garlic and chilli for 3-4 minutes to soften. ", "Add the prawns and fry until they are pink and cooked through. Then add the toasted cashew nuts and the broccoli florets. ", "Pour 150ml/5fl oz of the reserved fish stock into the pan, mix well, then stir in the lime juice. Heat through for 2-3 minutes, then stir in the coriander and chives. ", "To serve, spoon the broccoli and broth into a bowl and arrange the prawns on top of the dish."]}, {"isVegetarian": true, "title": "Fraisier cake", "url": "www_bbc_co_uk_food_recipes_fraisier_cake_75507", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fraisier_cake_75507_16x9.jpg", "ingredients": ["125g/4½oz caster sugar", "4 free-range eggs", "2 lemons, zest only, finely grated", "125g/4½oz self-raising flour, plus extra for flouring", "50g/1¾oz unsalted butter, melted and cooled slightly, plus extra for greasing", "600ml/20fl oz milk", "vanilla pod", "4 free-range eggs, plus 2 free-range egg yolks ", "180g/6¼oz caster sugar", "1 tbsp kirsch", "100g/3½oz cornflour", "150g/5½oz butter, cut into cubes and kept at room temperature", "75g/2¾oz caster sugar", "2 lemons, juice only", "200g/7oz marzipan", "200g/7oz dark chocolate, for decoration", "600g/1lb 5oz medium sized strawberries "], "serves": "Makes 1 x 23cm/9in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Grease, flour and line the base of a 23cm/9in spring-form or round loose bottom cake tin.", "Place the sugar, eggs and lemon zest in a large bowl set over a pan of simmering water.", "Using an electric hand whisk, whisk the mixture over a medium heat until doubled in volume and pale in colour. The mixture is at the right stage when it forms a ribbon trail when the whisk is lifted out of the mixture. Remove from the heat. ", "Sift in two-thirds of the flour and gently fold into the whisked mixture with a metal spoon or spatula. Add the remaining flour and fold again. Try to keep in as much of the air as possible.  Make sure all the flour is incorporated into the mixture.", "Gently fold in the melted butter.", "Pour the mixture into the cake tin and bake for 25-30 minutes or until the sides of the cake begin to come away from the tin and it is pale golden-brown.  ", "When cooked, allow the sponge to cool a little bit in the tin, then turn out onto a cooling rack. Be careful as this sponge is quite delicate. It should be just under 5cm/2in in height.", "To make the crème pâtissière, pour the milk into a wide based pan, split the vanilla pod along its length using a sharp knife, and add it to the milk along with the vanilla seeds. Bring the milk up to the boil, then take it off the heat. ", "Whisk together the eggs, sugar, kirsch and cornflour in a medium sized bowl until blended. ", "Remove the vanilla pod from the milk and pour the hot milk through a sieve into the egg mixture. Whisk to combine.", "Pour the custard back into a clean saucepan and set over a medium heat. ", "Stir the custard constantly until the mixture thickens. The mixture will take about four minutes to thicken, but when it does it happens very quickly, so you need to really keep stirring to prevent lumps. Whisk until smooth.", "Cook the mixture until the crème is very thick, so that it can be piped and it will hold its shape. Stir in the butter until thoroughly melted and combined.", "Allow to cool slightly, pour into a shallow dish and chill in the fridge for about an hour until really cold and set firm.  This chills it faster as it cools over a larger surface area – alternatively you could fill the piping bags with it at this stage and leave overnight to chill. ", "Place the ingredients for the lemon syrup in a small saucepan with 70ml/4½ tbsp water. Heat gently until the sugar dissolves, then boil rapidly for two minutes. Remove from the heat and set aside to cool.", "Meanwhile, roll out a thin disc of marzipan to fit a 23cm/9in circumference circle. It is best if you draw around the 23cm/9in base of another loose bottomed tin for the perfect circle.  For best results and a perfectly flat surface, chill it in the fridge until it is needed. ", "Slice the sponge in half horizontally, creating two slim discs of cake. The cut must be as level as possible as it will be visible in the finished cake.", "Place a strip of acetate plastic around the inside of the springform tin. Or line the base and sides with cling film or parchment lined foil.", "Place one layer of sponge cake in the bottom of the cake tin. Then liberally brush the sponge with half the syrup.  With the back of a spoon, gently squash the edges of the cake down so that they are pushed directly against the sides of the tin, creating the defined edges necessary for the Fraisier cake.", "Rinse, hull and halve about 12 strawberries, try and make sure they are all the same height.", "Place the cut sides of the strawberries against the plastic on the inside of the tin. The strawberry halves should be sitting snugly beside each other, so it looks like a little crown inside the tin.", "Take the chilled crème pâtissière out of the fridge and spoon two thirds of the crème into a piping bag, fitted with a 1cm/½in nozzle.", "Pipe a swirl covering the exposed sponge completely in the bottom of the tin.", "Then pipe between each of the strawberries so the gaps are filled right to the top with the crème pâtissière.", "Set about 3-5 strawberries to one side for decoration, then hull and quarter the rest of them and place on top of the crème, so it raises the inside of the cake by about an inch.", "Pipe another swirl of crème pâtissière on top of the cut strawberries to cover the whole surface. Then smooth with a palette knife.", "Place the other disc of sponge on top of this, with the cut side uppermost, so it has a  completely flat top. Brush with the remaining syrup.", "Gently press the top down quite firmly, so that the cake and filling push against the acetate to create the distinctive smooth and defined sides of the Fraisier cake.", "Lay the chilled marzipan circle on top of the cake and put the whole thing back in the fridge to set.", "Make some pretty decorations of your choice with melted dark chocolate.", "When ready to serve, remove the cake from fridge. ", "Very carefully release the spring tin/loose bottom and remove the cake from the tin and from the acetate or cling film.", "Place onto a serving plate and decorate with reserved strawberries, chocolate decoration and a dusting of icing sugar.  Serve chilled."]}, {"isVegetarian": true, "title": "Frangipane tart with custard", "url": "www_bbc_co_uk_food_recipes_frangipane_tart_with_63856", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz cold butter", "250g/9oz plain flour, plus extra for dusting", "1 free-range egg", "225g/8oz jam", "225g/8oz butter, softened", "1 vanilla pod, split and seeds scraped out (pod reserved)", "225g/8oz caster sugar", "5 free-range eggs", "225g/8oz ground almonds", "75g/3oz whole blanched almonds", "250ml/9fl oz milk", "250ml/9fl oz double cream", "4 free-range egg yolks ", "110g/4oz caster sugar"], "serves": "Serves 10-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the butter and flour into a food mixer and mix until the texture resembles breadcrumbs, then add the egg and mix until combined into a firm dough.", "Wrap in cling film and place in the fridge to rest for 30 minutes.", "For the tart, preheat the oven to 160C/325F/Gas 3. ", "On a work surface lightly dusted with flour, roll out the pastry to about 3mm thick. ", "Carefully line a 23cm/9in deep-sided, loose bottomed tart tin with the pastry, pressing the pastry into the edges of the tin. Spread the jam over the base of the tart, then place in the fridge to rest for 10 minutes.", "To make the frangipane, beat the butter, vanilla seeds and sugar together in a bowl until pale and fluffy. ", "Crack in the eggs, one at a time, beating well after each addition, until all of the eggs have been fully incorporated into the mixture. Fold in the ground almonds carefully by hand.", "Top the pastry case with the almond mixture and smooth to the edges, then decorate with the blanched almonds, in concentric circles.", "Bake the tart in the preheated oven for 35-40 minutes, or until the filling has risen, is cooked through and the surface is pale golden-brown. ", "For the custard, put the milk and cream in a shallow saucepan with the vanilla pod leftover from making the frangipane filling. Set over a medium heat and bring to the boil.", "Meanwhile, whisk the egg yolks and sugar together in a bowl.", "When the milk is boiling, pour it onto the eggs whisking all the time, then return the whole mixture to the pan and cook over a gentle heat, whisking occasionally until thick enough to coat the back of a wooden spoon.", "Strain into a clean pan and warm through.", "To serve, cut the tart into wedges, place onto plates and pour the custard alongside."]}, {"isVegetarian": true, "title": "Free-form fruit pie", "url": "www_bbc_co_uk_food_recipes_free-form_fruit_pie_56828", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/free-form_fruit_pie_56828_16x9.jpg", "ingredients": ["240g/8½oz plain flour, plus extra for dusting", "115g/4oz butter, chilled and cut into cubes", "75g/2½oz caster sugar, plus extra for sprinkling", "pinch of salt", "1 large free-range egg, plus 1 small beaten egg for brushing", "2 tbsp iced water", "500g/1lb 2oz rhubarb, cut into 2.5cm/1in pieces", "200g/7oz strawberries, hulled and sliced", "2–3 tbsp caster sugar, to taste", "2 tsp icing sugar, to decorate (optional)"], "serves": "Serves 6–8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, put the flour in a mixing bowl or food processor. Add the butter, sugar and salt and rub everything together using your fingertips until it has the texture of fine breadcrumbs. (Alternatively, pulse in the food processor.) Add the large egg and iced water and mix or pulse together until well combined. Tip out onto a work surface and bring together into a ball of pastry. Wrap in cling film and put in the fridge to rest for 30 minutes. ", "Preheat the oven to 200C/Fan 180C/Gas 6. Line a baking tray with non-stick baking paper. ", "Roll out the pastry on a lightly floured work surface to a rough circle approximately 35cm/14in diameter. Using the rolling pin, lift the pastry onto the baking tray.", "Sprinkle the rhubarb over the pastry, leaving a rim of about 5cm/2in. Scatter the strawberries on top of the rhubarb, then sprinkle the fruit with the 2–3 tablespoons of sugar.", "Fold up the pastry edges to make a pie with an open centre. Brush the pastry with the beaten egg and sprinkle with the remaining sugar.", "Bake for 30–35 minutes, or until the pastry is golden and crisp and the fruit is cooked. Sieve the icing sugar over the pastry to serve if you wish. "]}, {"isVegetarian": true, "title": "Free-form trifle with berries and custard", "url": "www_bbc_co_uk_food_recipes_freeformtriflewithbe_92227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/17½oz mixed berries (blueberries, raspberries, blackberries)", "3 tbsp sugar, or more to taste", "splash water", "500g/17½oz ready-made plain sponge cake", "250ml/9fl oz ready-made custard", "icing sugar, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the raspberries, blackberries and blueberries to the boil in a saucepan with the sugar and a little water. Simmer for a few minutes until the fruits burst. Set aside.", "Slice the sponge cake into thin pieces and place these in a bowl or in four individual soup plates. Spoon over the warm fruits and some of their syrup. Trickle over the custard and, if you wish, dust with icing sugar."]}, {"isVegetarian": true, "title": "Freekeh salad", "url": "www_bbc_co_uk_food_recipes_freekeh_salad_16186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz freekeh ", "1 small red onion, very finely chopped ", "250g/9oz dried cranberries ", "200g/9oz blanched almonds ", "20g/¾oz dill, fronds and stems finely chopped ", "400g/14oz pomegranate seeds", "150ml/¼ pint pomegranate molasses ", "generous glug of olive oil"], "serves": "Serves 6–8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Bring a large saucepan of water to the boil and cook the freekeh according to the packet instructions (about 15–20 minutes). Drain, rinse thoroughly until cold and place in a large mixing bowl.", "Add the remaining ingredients to the bowl with the freekeh and give everything a thoroughly good mix. Cover with cling film and allow to rest for an hour before serving."]}, {"isVegetarian": true, "title": "Freekeh salad", "url": "www_bbc_co_uk_food_recipes_freekeh_salad_48068", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freekeh_salad_48068_16x9.jpg", "ingredients": ["200g/7oz freekeh, pearled spelt or pearled barley", "5 tbsp olive oil", "4 spring onions, finely chopped", "1 pomegranate, seeds only", "handful flatleaf parsley, roughly chopped", "handful mint, roughly chopped", "1 tbsp pomegranate molasses", "2 tbsp pistachios, roughly crushed", "salt and freshly ground black pepper"], "serves": "Serves 4 as a side dish", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the freekeh and 1 litre/1¾ pint water in a pan together with 1 teaspoon of salt and 1 tablespoon of the olive oil. Bring to the boil, then turn down to a simmer and cook for 15 minutes until just tender. Drain and allow to cool.", "When cool, mix together the freekeh with the spring onions, pomegranate seeds and herbs. Season with salt and pepper. ", "Whisk together the remaining 4 tablespoons of olive oil and the pomegranate molasses with a pinch of salt, and dress the salad with it, mixing gently. Serve topped with pistachios."]}]