[{"ingredients": ["1 cucharada de girasol o aceite de oliva suave", "1 cebolla mediana, finamente rebanada", "2 dientes de ajo, en rodajas finas", "75g / 2½oz de chorizo ​​suave para cocinar", "1 cucharadita de pimentón ahumado en caliente", "1 x 400 g de tomate picado", "200ml / 7fl oz de agua recién hervida", "2 cucharadas de puré de tomate", "1 x 400 g de garbanzos de lata", "75g / 2½oz de col rizada rizada, enjuagados, triturados, tallos resistentes eliminados", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Caliente el aceite en una cacerola grande antiadherente a fuego medio. Agregue la cebolla y el ajo y sofríalos suavemente durante 2-3 minutos, revolviendo ocasionalmente, hasta que se ablanden pero no se doren.", "Mientras la cebolla se está cocinando, corte el chorizo ​​en rodajas de aproximadamente 1.5 cm / ½. Mezcle las rodajas de chorizo ​​y el pimentón ahumado caliente en la mezcla de cebolla y ajo y freír durante 1-2 minutos más.", "Agregue los tomates enlatados, agua y puré de tomate a la sartén y mezcle bien. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Escurra los garbanzos en un colador y enjuague con agua fría. Agréguelos a la mezcla de tomate y vuelva a hervir a fuego lento. Continúe cocinando a fuego lento durante 8-10 minutos, revolviendo una o dos veces, hasta que el volumen de salsa se haya reducido a la mitad.", "Agregue la col rizada al guiso y continúe cocinando a fuego lento durante 1-2 minutos más o hasta que esté tierna. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta el estofado en tazones para servir y sirva con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_chickpea_and_chorizo_36240", "title": "Garbanzo y guiso de chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_and_chorizo_36240_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g de garbanzos de lata, escurridos", "160g de maíz dulce de estaño, escurrido", "1 cucharadita de cebolla en polvo", "1 cucharadita de pimentón ahumado", "1 cucharada de jugo de limón", "2 cucharadas de harina de gramo", "2 cucharadas de aceite de colza", "4 bollos integrales", "1 cabeza pequeña lechuga gema, hojas separadas", "2 tomates grandes, en rodajas", "sal marina y pimienta negra recién molida"], "method": ["Calienta una barbacoa hasta que las llamas se hayan apagado y los carbones estén brillantes. Si no está utilizando una barbacoa, caliente una sartén hasta que esté caliente.", "Incline los garbanzos en un recipiente y aplastelos en una pasta espesa con un triturador de patatas. Agregue el maíz dulce, cebolla en polvo, pimentón ahumado, jugo de limón y mucha sal y pimienta negra.", "Agregue la harina de gramo y mezcle bien hasta que todo comience a pegarse. Divida la mezcla en cuatro, luego forme cada cuarto en forma de hamburguesa.", "Cepille las hamburguesas con aceite y colóquelas en la barbacoa o en la plancha. Cocine a cada lado durante 2 minutos, hasta que estén crujientes y calientes.", "Divida los panecillos y caliente la barbacoa o la plancha. Sirva las hamburguesas en los panecillos, cubiertas con hojas de lechuga y tomate. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickpea_and_sweetcorn_87660", "title": "Hamburguesas de garbanzos y maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_and_sweetcorn_87660_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas rojas, cortadas en cubitos", "3 dientes de ajo, finamente picados", "1 cucharadita de cilantro molido", "½ cucharadita de comino molido", "pizca de cúrcuma molida", "1 chile rojo picante, finamente picado", "1 manojo de cilantro fresco y los tallos, finamente triturados", "2 x 400 g / 14 oz latas de garbanzos cocidos, escurridos", "1 limón, solo jugo", "Polenta de tierra 250g / 9oz", "2 cucharadas de aceite de girasol", "sal y pimienta negra recién molida", "½ cebolla roja, en rodajas", "½ pimiento rojo, en rodajas", "sal al gusto", "pizca de zumaque de tierra", "2 tomates, en rodajas", "gran puñado de hojas de lechuga Cos", "Salsa de chile Sriracha, al gusto", "mayonesa vegana, al gusto", "4 bollos de hamburguesa"], "method": ["Calentar el aceite de oliva en una sartén y freír la cebolla y el ajo durante diez minutos hasta que estén blandos. Agregue las especias y el cilantro y cocine por un minuto más. Retire del fuego.", "Pulse los garbanzos en una licuadora con la mezcla de especias de cebolla. Pruebe, sazone con sal y pimienta y agregue un chorrito de jugo de limón. Forme la mezcla en hamburguesas y guarde en el refrigerador hasta que esté listo para cocinar.", "Para la ensalada, sal la cebolla roja y el pimiento rojo en un plato y déjalo por 20 minutos.", "Cuando esté listo para cocinar las hamburguesas, espolvoree la polenta en un plato y presione las hamburguesas en la polenta. Caliente el aceite de girasol en una sartén y fría las hamburguesas por ambos lados hasta que estén cocidas. (Alternativamente, puede hornear estos en una bandeja engrasada durante 15-20 minutos a 200C / 180C Fan / Gas 6.)", "Para terminar la ensalada, lave la cebolla y la pimienta con agua fría y fría y escurra. Espolvorea el zumaque sobre los tomates. Combine los tomates con las hojas de lechuga Cos, la cebolla roja y el pimiento rojo. Mezcle la salsa de chile y la mayonesa en un plato pequeño.", "Sirva las hamburguesas en los panecillos con la ensalada y el chile al lado."], "url": "www_bbc_co_uk_food_recipes_chickpea_burgers_00951", "title": "Hamburguesas de garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_burgers_00951_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 chiles verdes", "2 chalotas", "1 diente de ajo", "1 jengibre raíz de la pieza del tamaño de un pulgar, pelado", "3 tallos de limoncillo", "12 hojas de lima kaffir", "pizca de sal", "1 cucharada de aceite vegetal", "1 cucharada de azúcar de palma", "2 pimientos verdes, asados ​​y pelados", "puñado de cilantro fresco", "2 cucharadas de aceite vegetal", "1 x 400 ml / 14fl oz puede leche de coco", "100ml / 3½fl oz de caldo de verduras", "1 x 400g / 14fl oz pueden garbanzos, escurridos", "1 pimiento rojo, finamente picado", "puñado de frijoles finos", "puñado de habas cocidas", "arroz jazmín cocido", "rodajas de limón"], "method": ["Para la pasta de curry, mezcle todos los ingredientes de la pasta de curry en una licuadora hasta que quede suave (esto puede tomar unos minutos).", "Para el curry, caliente el aceite en una sartén a fuego lento. Freír la pasta de curry hasta que esté fragante.", "Agregue la leche de coco y el caldo y lleve la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento durante cinco minutos.", "Agregue los garbanzos, el pimiento rojo, los frijoles finos y las habas, y cocine durante 2-3 minutos más.", "Sirva el curry con arroz jazmín y trozos de lima."], "url": "www_bbc_co_uk_food_recipes_chickpea_curry_24812", "title": "Garbanzo al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina de gramo", "2 pizca de sal", "pizca de pimienta negra recién molida", "aceite de coco o ghee, para freír", "1 calabacín, cortado, toscamente picado", "2 puñados de tomates cherry", "1 berenjena pequeña, cortada, picada", "1 cucharadita de semillas de comino", "1 cucharada de ghee o aceite de coco", "2 cucharaditas de ghee", "250g / 9oz de champiñones", "1 diente de ajo, finamente picado", "pizca de tomillo seco", "pequeño puñado de Cheddar rallado", "1 aguacate maduro, piel y piedra eliminados, en rodajas", "200 g / 7 oz de salmón ahumado", "Cohete de 80g / 3oz", "1 cucharadita de semillas de sésamo negro", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "method": ["Para los panes planos, coloque la harina en un tazón y sazone con sal y pimienta. Haga un pozo en el centro de la harina y vierta gradualmente 400ml / 14fl oz de agua fría en una corriente delgada, batiendo continuamente, hasta que esté suave y bien combinado como una pasta espesa. Dejar de lado durante al menos 30 minutos, o preferiblemente durante la noche, a temperatura ambiente, para permitir que la harina de gramo absorba completamente el agua.", "Agregue un poco de aceite de coco o ghee a una sartén de hierro fundido o de cerámica, frótelo por toda la base y luego caliente a fuego medio a alto.", "Cuando la sartén esté caliente, agregue 4 cucharadas de la masa de pan plano a la sartén, agitándola hasta que el pan plano tenga 10-12 cm / 4-5 pulgadas de ancho y 2 mm de grosor. Cocine como un panqueque tradicional durante 1-2 minutos, luego voltee y continúe cocinando en el otro lado hasta que esté crujiente y dorado por ambos lados. Repita el proceso con la masa restante de pan plano.", "Para la cubierta vegetal asada, precalentar el horno a 220C / 200C Ventilador / Gas 7. Disponga las verduras en una bandeja grande para asar en una sola capa, luego espolvoree las semillas de comino y sazone con sal y pimienta. Apunte las verduras con el ghee. Asar durante 30-40 minutos, volteando a la mitad del tiempo de cocción, hasta que estén tiernos.", "Para el relleno de champiñones de ajo, precaliente la parrilla a su nivel más alto. Derrita el ghee en una sartén a fuego medio. Agregue los champiñones y freír durante 4-5 minutos, agregando el ajo y el tomillo durante el último minuto de la cocción. Condimentar con sal y pimienta. Extienda la mezcla de champiñones de ajo sobre los panes planos y espolvoree sobre el queso rallado. Coloque los panes planos en una bandeja para hornear. Grill durante 1-2 minutos, o hasta que el queso se haya derretido y esté burbujeando.", "Para el aderezo de aguacate y salmón, cubra los panes planos con capas de rodajas de aguacate, salmón ahumado y hojas de rúcula. Espolvorea sobre las semillas de sésamo y el limón. Sazonar con sal y pimienta fresca."], "url": "www_bbc_co_uk_food_recipes_chickpea_flatbreads_78711", "title": "Panes planos de garbanzo con ingredientes sabrosos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Rinde 8 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_flatbreads_78711_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos grandes de gallinas camperas", "1 cucharada de aceite de oliva light", "2 cucharaditas de semillas de comino", "1 cucharadita de semillas de mostaza negra", "2 cucharadas de polvo de curry mediano, más extra para rociar", "1 cucharadita de gránulos de ajo", "1 cucharadita de jengibre molido", "400g de tomates cortados en lata", "400 g de garbanzos de lata, escurridos y enjuagados", "1 cucharada de jugo de limón", "100ml / 3½fl oz de agua hirviendo", "Espinaca de la hoja del bebé 180g / 6oz", "sal y pimienta negra recién molida", "2 cucharadas de cilantro fresco picado, para decorar"], "method": ["Pon a hervir una olla pequeña de agua y cocina los huevos durante 6-8 minutos, o hasta que se hagan a tu gusto. Cuando esté lo suficientemente frío como para manejarlo, cáscara, parta a la mitad y déjelo a un lado.", "Mientras tanto, caliente el aceite en una sartén grande a fuego lento. Agregue el comino, las semillas de mostaza negra, el polvo de curry, los gránulos de ajo y el jengibre molido y saltee por 1 minuto.", "Agregue los tomates, garbanzos, jugo de limón y agua hirviendo y sazone con sal y pimienta. Cocine a fuego alto durante 6-8 minutos, o hasta que se reduzca y espese, revolviendo con frecuencia. Agregue la espinaca y cocine hasta que se marchite.", "Divida el curry entre dos cuencos poco profundos, cubra cada uno con dos mitades de huevo y espolvoree un poco de polvo de curry. Esparce con cilantro y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickpea_spinach_and_egg_50755", "title": "Garbanzo, espinaca y huevo al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpea_spinach_and_egg_50755_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Puré de castañas sin endulzar de 100 g / 3½ oz o castañas enteras en conserva", "4 cucharadas de aceite de oliva, girasol, avellana o nuez", "2 cucharadas de jerez dulce medio, marsala o el puerto", "Garbanzos enlatados 100g / 3½oz", "2 cucharadas de semillas de girasol", "sal marina y pimienta negra recién molida"], "method": ["Purée las castañas o el puré de castañas en un procesador de alimentos con el aceite de su elección y el jerez, marsala o el puerto hasta que esté suave.", "Agregue los garbanzos y el puré brevemente si desea mantener un poco de \"crujiente\" en los garbanzos; si quieres un relleno totalmente liso, no importa qué tan vigorosamente lo hagas.", "Eliminar del procesador. Agregue las semillas de girasol y sazone al gusto.", "Puede usar el relleno dentro de un pavo, hornearlo en pequeñas bolas junto al ave, o usarlo como un paté sobre pan tostado."], "url": "www_bbc_co_uk_food_recipes_chickpeaandchestnuts_77291", "title": "Garbanzo y relleno de castaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla, finamente picada", "5 rebanadas de chorizo", "1 cucharadita de polvo de curry suave", "50g / 2oz de garbanzos en lata, escurridos"], "method": ["Caliente el aceite de oliva en una olla pequeña, agregue la cebolla, el chorizo ​​y el curry en polvo y saltee durante 3-4 minutos o hasta que las cebollas se ablanden.", "Agregue los garbanzos y cocine a fuego lento durante seis minutos. Servir en un tazón."], "url": "www_bbc_co_uk_food_recipes_chickpeaandchorizocu_81844", "title": "Garbanzo y chorizo ​​al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de garbanzos secos, empapados durante la noche en abundante agua fría", "1 cucharada de aceite", "500g / 1lb 2oz muslos de pollo", "125 g / 4½ oz de chorizo, cortado en trozos del tamaño de un bocado", "3 dientes de ajo picados", "1 cebolla picada", "2 cucharaditas de cilantro molido", "100ml / 3½fl oz de jerez seco (opcional)", "1 x 400 g / 14 oz pueden cortar tomates", "200ml / 7fl oz de caldo de pollo", "sal y pimienta negra recién molida", "aceite de oliva virgen extra", "almendras copos tostadas"], "method": ["Escurra y enjuague los garbanzos, y agregue a una olla grande con agua fría para cubrir. Ponga los garbanzos a ebullición, reduzca el fuego y cocine a fuego lento hasta que estén tiernos, alrededor de una hora. Desagüe.", "Calentar el aceite en una sartén y freír los muslos de pollo hasta que estén dorados por todos lados. Retire de la sartén y reserve. Luego fríe el chorizo ​​en aceite hasta que empiece a crujir.", "Agregue las cebollas, el ajo y el cilantro y fría por 2-3 minutos hasta que se ablanden. Vierta el jerez y deje burbujear por un minuto, luego incline los tomates en lata y el caldo. Llevar a ebullición.", "Agregue el pollo dorado y los garbanzos y cocine a fuego lento durante 20-25 minutos, o hasta que el pollo esté completamente cocido. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Servido cubierto con almendras copos y un remolino de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_chickpeaandchorizoso_81545", "title": "Garbanzo y guiso de chorizo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpeaandchorizoso_81545_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "1 cebolla picada", "1 diente de ajo, aplastado", "¼ cucharadita de sal", "½ cucharadita de comino en polvo", "¼ cucharadita de polvo de cilantro", "¼ cucharadita de cúrcuma en polvo", "¼ cucharadita de chile rojo en polvo", "1 tomate fresco, picado", "400 g de garbanzos de lata, escurridos y enjuagados", "Jengibre de raíz de 5cm / 2in, rallado", "pizca de garam masala", "panes pitta o arroz basmati simple, para servir"], "method": ["Caliente una cacerola con tapa profunda o un wok de tamaño mediano y agregue el aceite. Freír las cebollas y el ajo, hasta que las cebollas estén caramelizadas", "Agregue los polvos de sal, comino, cilantro, cúrcuma y chile rojo. Mezcle por un minuto e incline el tomate. Cocine la salsa hasta que empiece a espesarse.", "Agregue 4 cucharadas de agua y revuelva. Luego incline los garbanzos y mezcle. Mash algunos de los garbanzos mientras se cocina. Cubra y cocine a fuego lento durante 5 minutos. Luego agrega el jengibre y el garam masala. Cocine por otro minuto.", "Sirve con panes pitta o arroz basmati simple."], "url": "www_bbc_co_uk_food_recipes_chickpeacurry_2213", "title": "Garbanzo al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpeacurry_2213_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "½ tomate de ternera, sin semilla y finamente picado", "3 mini panes pitta blancos, desgarrados en trozos pequeños", "2 cucharadas de garbanzos cocidos en conserva, enjuagados y escurridos", "Hojas de espinaca 55 g / 2 oz", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico, más extra para servir", "6 hojas de albahaca fresca, rotas"], "method": ["Combine todos los ingredientes en un tazón y mezcle bien para combinar. Sirva en un plato con un chorrito adicional de vinagre balsámico."], "url": "www_bbc_co_uk_food_recipes_chickpeaspinachandon_89256", "title": "Garbanzos, espinacas y cebolla fatto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla roja, finamente rebanada", "3 dientes de ajo, en rodajas finas", "2 cucharaditas de jengibre recién rallado", "1 o 2 chiles verdes, a gusto, sin semillas y finamente picados", "1 cucharadita de sal marina", "2 X 400 g / 14 oz latas de garbanzos, escurridos", "80ml / 2¾fl oz de agua", "1 cucharadita de comino", "1 cucharadita de cúrcuma, opcional", "pimienta negra recién molida", "500g / 17½oz de tomates cherry", "100 g / 3½oz de hojas de espinaca inglesa bebé", "yogurt natural", "pan de pita", "aceite de oliva", "sal y pimienta negra recién molida", "pimenton"], "method": ["Caliente una sartén grande y profunda a fuego medio a alto.", "Agregue el aceite, la cebolla, el ajo, el jengibre, los chiles y la sal y cocine durante cinco minutos (o hasta que las cebollas estén blandas) teniendo cuidado de revolver regularmente.", "Agregue los garbanzos, 80ml / 2¾fl oz de agua, comino, cúrcuma y pimienta y cocine por cinco minutos o hasta que el agua se evapore.", "Agregue los tomates y cocine por otros dos minutos para suavizar.", "Retire del fuego y verifique que no tenga condimento.", "Revuelva a través de la espinaca y cubra con yogur.", "Para hacer las patatas fritas pitta, romper los pedazos de pan pitta y rociar con aceite de oliva, sal, pimienta y pimentón.", "Hornee en un horno moderado durante 10-12 minutos o hasta que estén crujientes.", "Sirva con el estofado en un plato calentado."], "url": "www_bbc_co_uk_food_recipes_chickpeastewwithtoma_73070", "title": "Guiso de garbanzos con tomate y chile verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 (u 8 como guarnición)", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickpeastewwithtoma_73070_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cabezas de achicoria amarilla", "1 cucharada de jugo de limón", "1 cucharada de azúcar", "2 pizcas grandes de sal marina", "6 granos de pimienta blanca", "10g de mantequilla sin sal", "2 pequeños tallos de acelga con hojas, tallos cortados en trozos de 1cm; hojas ásperamente picadas", "35 g / 1¼ oz de mantequilla sin sal", "35g / 1¼ oz de harina común", "450ml / 16fl oz de leche entera", "100g / 3½oz de queso Comté, finamente rallado", "1 cucharada de mostaza Dijon", "Una pizca de sal marina", "pizca de pimienta blanca recién molida", "4 rebanadas de jamón cocido", "50g / 1¾oz de queso Comté, finamente rallado"], "method": ["Para la achicoria, ponla en una cacerola mediana y agrega el jugo de limón, azúcar, sal, pimienta y suficiente agua para cubrir apenas. Coloque a fuego medio y cubra con un círculo de papel para hornear y una tapa más pequeña que el diámetro de la sartén (esto es para mantener la achicoria sumergida). Llevar a ebullición, luego cocine a fuego lento durante 45-60 minutos. Es importante cocinar la achicoria lentamente para eliminar la mayor parte de su amargor.", "Levante la achicoria en una rejilla para drenar y enfriar. Una vez que esté frío, presione suavemente cualquier humedad adicional con un paño de cocina.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para la acelga, ponga la mantequilla y 100 ml / 3½ fl oz en una cacerola a fuego alto. Cocine los tallos durante 20 minutos, agregando más agua si es necesario. Una vez que estén tiernas, sáquelas y cocine las hojas durante 3 minutos en la misma agua. Cuele, mezcle los tallos y las hojas y acomódelos en un pequeño plato gratinado.", "Mientras tanto, prepara la salsa de queso. En una cacerola pequeña a fuego medio, derrita la mantequilla. Agregue la harina, bata hasta que quede suave y cocine hasta obtener un color rubio chiflado. Retire la sartén del fuego, bata la leche y vuelva al fuego. Cocine durante al menos 4 minutos, revolviendo constantemente con la batidora hasta que la salsa se espese.", "Agregue el queso y la mostaza y cocine durante 3 minutos, revolviendo, hasta que el queso se haya derretido por completo. Retire del fuego, pruebe y sazone si es necesario.", "Para armar el gratinado, doble las rebanadas de jamón por la mitad y coloque una cabeza de achicoria en cada rebanada. Empaque bien en el plato gratinado encima de la acelga. Cuchara sobre la salsa de queso y espolvorea con el queso restante. Hornee en la parte superior del horno durante 25 minutos hasta que se doren."], "url": "www_bbc_co_uk_food_recipes_chicory_gratin_84963", "title": "Gratinado de achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicory_gratin_84963_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mostaza Dijon", "½ cucharadita de vinagre de vino blanco", "1 cucharadita de azúcar en polvo", "1 cucharadita de perejil fresco picado", "100ml / 3½fl oz de aceite de oliva", "100 g / 3½ oz de nueces, tostadas y picadas", "75g / 2¾oz de hojas de cohete", "75g / 2 ¾oz de hojas de achicoria", "1 cucharadita de semillas de sésamo", "75g / 2¾oz de tocino, fritos hasta que estén crujientes"], "method": ["En un tazón mezcle la mostaza, el vinagre, el azúcar y el perejil. Poco a poco agregue el aceite de oliva, batiendo todo el tiempo, hasta que se forme una emulsión.", "Agregue las nueces picadas al tazón y mezcle. Sazonar, probar con sal y pimienta negra recién molida.", "Para servir, coloque el cohete y la achicoria en un plato, espolvoree semillas de sésamo y espolvoree un poco del aderezo, luego coloque el tocino crujiente encima."], "url": "www_bbc_co_uk_food_recipes_chicoryandrocketsala_84212", "title": "Ensalada de achicoria y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 10oz", "pizca de sal", "100 g / 3½ oz de mantequilla, más extra para engrasar", "2 huevos medianos de granja, ligeramente golpeados", "100g / 3½oz de azúcar glasé", "Arándanos de 650g / 1lb 7 oz, reservando 30 arándanos para decoración", "130ml / 4fl oz de jugo de manzana", "150 g / 6 oz de azúcar en polvo", "1½ cucharadita de extracto de vainilla", "1 cucharadita de canela molida", "1 x 8 g de pectina de bolsita", "2½ cucharadas de harina de maíz", "Frambuesas de 650g / 1lb 7oz, reservando 20 frambuesas para decoración", "150 g / 6 oz de azúcar en polvo", "1 limón, solo jugo", "1½ bolsitas de gelatina en polvo, empapada en 5 cucharadas de agua fría", "Crema doble de 100 ml / 3½ fl oz, batida a picos suaves", "850 ml / 1½ pintas de crema doble, muy frío, directamente del refrigerador", "80g / 3¼ oz de azúcar glas", "2 cucharaditas de extracto de vainilla", "Frambuesas 150g / 6oz", "50 g / 2 oz de azúcar en polvo", "1 cucharada de harina de maíz", "150g / 6oz de arándanos", "50 g / 2 oz de azúcar en polvo", "1 cucharada de harina de maíz"], "method": ["Para la masa, tamiza la harina y la sal en un tazón. Frote la mantequilla en la harina hasta que la mezcla se asemeje a pan rallado. Agregue los huevos ligeramente batidos un poco a la vez, mezclando hasta que la masa se una (es posible que no necesite todos los huevos). Amasar ligeramente hasta que forme una bola suave, luego envolver en una película adhesiva y colocar en la nevera durante 45 minutos.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase ligeramente una lata para tarta de 29 cm / 11½ pulgadas.", "Para la mermelada de arándanos, coloque los arándanos, el jugo de manzana, el azúcar, la vainilla y la canela en una cacerola y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cuatro minutos. Agregue la pectina y la harina de maíz. Cocine por un minuto, luego retire del fuego y deje que se enfríe un poco.", "Sobre una superficie ligeramente enharinada, extienda la masa a un grosor de 0.5cm / ¼in. Ruede la masa sobre el rodillo y transfiérala a la lata engrasada. Suavemente empuje los pasteles en la lata.", "Coloque un cuadrado de pergamino para hornear en la cáscara de los pasteles, llénelo con frijoles para hornear y hornee \"a ciegas\" durante 15 minutos. Retire el papel y los frijoles para hornear y devuelva la caja de repostería al horno durante 10-12 minutos hasta que se dore. Coloque la lata en una rejilla para enfriar y déjela enfriar por completo.", "Para el relleno de gasa de frambuesa, coloque las frambuesas, el azúcar y el jugo de limón en una sartén pequeña y deje hervir durante 3-4 minutos. Cuele las frambuesas a través de un colador en un recipiente, presionando la fruta a través del colador con el dorso de una cuchara de madera.", "Retire la gelatina del agua empapada, exprima y mezcle con la mezcla de frambuesa. Deje que se enfríe un poco, luego mezcle con la crema batida. Vierta el relleno de gasa en una bandeja grande para enfriar. Revise cada 15-20 minutos hasta que esté semiajustado; esto debería demorar aproximadamente una hora.", "Extienda la mermelada de arándanos uniformemente sobre la base de la caja de repostería fría. Coloque en la nevera para establecer.", "Para la crema de chantilly, enfríe un tazón de vidrio durante 10-15 minutos en el refrigerador (tanto la crema como el recipiente deben estar muy fríos). Con una batidora eléctrica portátil, bate la crema fría hasta que se formen picos suaves cuando se quite la batidora. Tamizar el azúcar glas, agregar la vainilla y batir para combinar. No exageres ya que la crema chantilly debe ser bastante suave. Transfiera la crema a una manga pastelera equipada con una boquilla estrella grande y refrigere.", "Cuando el relleno de gasa de frambuesa se haya espesado pero todavía se pueda verter, viértalo en la caja de la repostería y alise la parte superior con una espátula. Coloque el pastel en el refrigerador durante 20-30 minutos o hasta que la gasa se haya fijado por completo.", "Para el coulis de frambuesa, coloque las frambuesas, el azúcar y 100 ml / 3½ fl oz de agua en una olla pequeña y deje que hierva suavemente. Cocine a fuego lento durante cuatro minutos, luego presione la fruta a través de un tamiz fino en un tazón. Regrese el puré de fruta a la cacerola y agregue la harina de maíz. Lleva la mezcla a fuego lento, revolviendo constantemente, hasta que espese. Dejar de lado para enfriar. Repita el proceso para los coulis de arándanos.", "Cuando el relleno de gasa se haya fijado, coloque rosetas de crema chantilly en la parte superior, creando círculos concéntricos, comenzando desde el borde exterior y trabajando hacia adentro.", "Transfiera el coulis de frambuesa a una manga pastelera equipada con una boquilla pequeña y plana, y vierta un remolino de coulis en la mitad de las rosetas. Repita el proceso con el coulis de arándanos en las rosetas restantes.", "Coloque un arándano o frambuesa en cada roseta con los coulis a juego. Enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_chiffon_pie_63461", "title": "Pastel de chifón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de 155g / 5½oz de auto crianza", "170 g / 5 oz de azúcar en polvo", "14 g / ½ oz de cacao en polvo", "1 cucharadita de polvo de hornear", "170g / 5¾oz de margarina para hornear, más extra para engrasar", "3 huevos grandes de gallinas camperas", "1½ cucharada de leche semidesnatada", "233 g / 8¼ oz de chocolate blanco, rallado o picado en trozos muy pequeños", "180 g / 6¼ oz de crema batida (a temperatura ambiente, pero no caliente, ya que no batirá)", "Crema doble de 180 g / 6¼ oz (a temperatura ambiente, pero no caliente, ya que no batirá)", "60 g / 2¼ oz de claras de huevo pasteurizadas (1½ claras de huevo grandes de gallinas camperas)", "¾ cucharadita de extracto de menta estadounidense", "gel de color verde para alimentos", "mantequilla sin sal, para engrasar", "200 g / 7 oz de azúcar en polvo", "5 cucharadas de jarabe de oro", "2 cucharaditas de bicarbonato de soda", "gran manojo de menta fresca, hojas recogidas", "polvo de brillo dorado (opcional)"], "method": ["Primero prepare los moldes para las mousses. Corta una tira de acetato lo suficiente como para cubrir la circunferencia interior de un anillo de 7cm / 2¾ en alimentos. Usando el interior del anillo de alimentos como guía, pegue el acetato en un bucle y asegúrelo con cinta adhesiva.", "Cree doce bucles y colóquelos en una bandeja forrada con papel de hornear (la bandeja debe caber en su refrigerador o congelador). Estos formarán los moldes para las tortas de mousse.", "Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase y forre una lata de rollo suizo de 33x22 cm / 13x8½ in con papel de hornear.", "Para la esponja, tamice la harina, el azúcar, el cacao en polvo y el polvo de hornear en un tazón grande. Agregue la margarina y los huevos y mezcle a alta velocidad durante 10 segundos con una batidora eléctrica. Raspe los lados del recipiente con una espátula y agregue la leche. Mezcle nuevamente en alto por 20 segundos o hasta que esté completamente combinado.", "Vierta la mezcla en la lata de rollo suizo forrado y alise la superficie. Hornee durante 15-20 minutos en el estante del medio, hasta que la mitad de la esponja salte hacia atrás cuando se presiona ligeramente.", "Incline la esponja sobre una rejilla de enfriamiento y retire el papel antigrasa. Dejar de lado para enfriar.", "Cuando la esponja es genial. Recorta doce círculos de esponja con un anillo de comida de 7 cm / 2 pulgadas como guía. Presione cada círculo hacia abajo en las guías de acetato y presione para asegurarse de que la superficie esté plana y nivelada. Tape cualquier espacio pequeño con restos de esponja, si es necesario.", "Para la mousse, coloque el chocolate en un tazón grande y resistente al calor sobre una cacerola hasta la mitad con agua hirviendo a fuego lento (no permita que el agua toque el recipiente). Revuelva con una espátula hasta que esté casi derretido, luego retírelo del fuego y permita que se derrita por completo. Poner a un lado para enfriar (el chocolate debe estar tan fresco como sea posible sin ponerlo).", "Agregue la crema batida, la crema doble, las claras de huevo y el extracto de menta en un tazón grande. Batir con una batidora eléctrica hasta que se formen picos suaves cuando se quite la batidora. Agregue una gota de colorante para alimentos para hacer que la crema se vuelva verde pálido. Batir para combinar, agregar un poco de colorante adicional si es necesario.", "Cuando el chocolate se haya enfriado tanto como sea posible, pero aún esté líquido, agregue una cucharada de crema y pliéguelo rápidamente para evitar que se formen grumos. Trabajando rápidamente, doble suavemente la mezcla de chocolate en la crema hasta que esté completamente combinada. Vierta suavemente la mezcla en una gran bolsa de plástico desechable con un gran agujero en la punta. Pipe la mousse de menta en los moldes a una profundidad de 3 cm / 1¼in. Agite suavemente para nivelar la parte superior, si es necesario. Enfríe en la nevera hasta que la mousse esté lista (aproximadamente 2 horas en la nevera o 30 minutos en el congelador).", "Para el panal, engrase y forre una lata cuadrada de 20 cm / 8 pulg. Con papel de hornear antiadherente.", "Agregue el azúcar impalpable y el jarabe dorado (use una cucharada que haya estado en agua hirviendo para dejar que el jarabe se deslice fácilmente) a una cacerola profunda a fuego medio (es importante que la cacerola esté profunda porque el panal de abejas burbujeará). Caliente hasta que el azúcar se derrita y la mezcla se haya vuelto de color caramelo ámbar. Retire del fuego y agregue rápidamente el bicarbonato de soda. Batir vigorosamente hasta que el bicarbonato de sodio se haya disuelto y las burbujas hayan comenzado a aparecer. Vierta la mezcla en la lata preparada y deje enfriar durante al menos 30 minutos.", "Una vez frío, retire el papel de hornear y corte la mitad del panal en fragmentos triangulares. Pulse la otra mitad en un procesador de alimentos en una migaja áspera.", "Para ensamblar, retire los collares de acetato cuidadosamente. Si la mousse se adhiere al collar, regrese a la nevera o al congelador y vuelva a intentarlo en 10 minutos. Limpie los bordes alisándolos con una espátula de compensación pequeña si es necesario.", "Cubra la parte superior de cada mousse con una capa de panal triturado y termine con un trozo de panal. Coloque una hoja de menta en la parte superior y cepille con polvo de brillo dorado, si lo usa."], "url": "www_bbc_co_uk_food_recipes_childhood_ice_cream_94439", "title": "Tortas de mousse de helado de infancia", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 pasteles individuales", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/childhood_ice_cream_94439_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 melón maduro de melón", "2 mangos maduros", "1 naranja", "1 papaya madura", "4 maracuyá", "Frambuesas 225 g / 8 oz", "crème fraîche fría, para servir (opcional)"], "method": ["Con un cuchillo afilado, corte el melón por la mitad, saque las semillas y deseche. Corta cada mitad en cuatro. Retire la corteza deslizando el cuchillo entre la pulpa y la corteza del melón, luego corte el melón en pedazos del tamaño de un bocado", "Pele el mango con un cuchillo afilado o pelador. Corta las mejillas de mango a cada lado de la gran piedra plana central, luego corta el mango en cubos. Corta el mango alrededor de la piedra también.", "Con un cuchillo de sierra, corte la parte superior e inferior de la naranja, luego corte toda la cáscara y la médula. Corta entre los segmentos de naranja para eliminar cada pieza.", "Pele la papaya con un cuchillo o pelador de patatas y luego corte la fruta por la mitad. Saque y deseche las semillas y corte la fruta en pedazos.", "Corta la fruta de la pasión por la mitad y saca las semillas.", "Coloque toda la fruta preparada, excepto las frambuesas, en un bol, cubra con una película adhesiva y colóquela en el refrigerador, mezclándola de vez en cuando.", "Justo antes de servir, agregue las frambuesas frescas. Sirve con crème fraîche frío si te gusta."], "url": "www_bbc_co_uk_food_recipes_chilled_fresh_fruit_03931", "title": "Ensalada de fruta fresca enfriada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Tomates de ciruela maduros de 1 kg / 2½ lb u otros toms con sabor, lavados y partidos por la mitad", "3 cucharadas de aceite de oliva", "tres dientes de ajo enteros sin pelar", "sal y pimienta negra recién molida", "2 cucharaditas de azúcar moreno claro", "150 ml / 5 fl oz de pollo ligero o caldo de verduras, o agua (opcional)", "un puño generoso lleno de hojas de albahaca", "1 diente de ajo", "1 cucharada de piñones", "2 cucharadas de aceite de oliva"], "method": ["Coloque los tomates cortados hacia arriba en una bandeja para hornear, agregue los dientes de ajo enteros. Sazonar bien con sal y pimienta, espolvorear con el azúcar y rociar sobre el aceite de oliva. Asar en un horno moderado (180 ° C / 375 ° F / Gas 4) durante aproximadamente 45 minutos, hasta que los tomates estén ligeramente dorados y comiencen a exudar jugo. Retire la bandeja del horno y deje enfriar por unos momentos.", "Elija los dientes de ajo tostados y exprima la carne suave de las cáscaras de papel doradas en un platillo. Coloque un colador sobre un recipiente y frote los tomates a través de él para extraer el jugo y la carne. Frote la pulpa de ajo asada a través del tamiz también, junto con los jugos grasos de la sartén.", "Los tomates varían en jugosidad y sabor, así que pruebe la mezcla y ajuste los condimentos. Adelgazarse con un poco de caldo, o incluso agua, puede ayudar a obtener el sabor y la consistencia que desea. Recuerde que los sabores se atenuarán un poco cuando la sopa se enfríe.", "Coloque el recipiente en el refrigerador y déjelo enfriar durante al menos cuatro horas (o acelere el proceso de enfriamiento colocando el recipiente en un recipiente grande de hielo y agua y revolviendo ocasionalmente).", "Libra o corta junto con un cuchillo grande, la albahaca, el ajo y los piñones, hasta que tengas una pulpa de grano fino. Revuelva en el aceite de oliva. Este pesto está destinado a ser bastante líquido. Dejar reposar por una hora o dos suavizará el borde duro del ajo crudo.", "Sirva la sopa colocándola en cuencos fríos y rociando una generosa cucharada de pesto sobre cada plato."], "url": "www_bbc_co_uk_food_recipes_chilledroasttomatoso_8879", "title": "Sopa de tomate asado con pesto", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 conchas de langosta", "dash aceite de oliva", "50ml / 2fl oz de brandy", "2 zanahorias, finamente cortadas", "½ bulbo de hinojo, finamente picado", "2 dientes de ajo picados", "Anís de 2 estrellas", "1 cucharadita de semillas de cilantro", "2 chalotes, en rodajas finas", "1 cucharada de puré de tomate", "1.5 litros / 2½ pintas de caldo de pollo", "3 tomates de ciruela", "6 claras de huevo de gallinas camperas", "½ zanahoria", "½ chalota", "ramito de estragón", "colas cocidas y garras de carne de langosta de 4 langostas", "1 botella de aceite de limón", "100g / 3½ oz de habas desgranadas, escaldadas y peladas nuevamente", "1 manojo de zanahorias baby, blanqueadas y cortadas en 1cm / ½ en bastones", "hojas de estragón, al gusto", "1 manojo de puerros tiernos, blanqueados y cortados en bastones", "100g / 3½ oz de hinojo, blanqueado"], "method": ["Para hacer el consomé, freír las cáscaras de langosta en aceite de oliva durante cinco minutos, desglasar la sartén con un pequeño chorrito de brandy y escurrir las cáscaras en un colador.", "En una sartén por separado, freír las zanahorias, el hinojo, el ajo, el anís estrellado, las semillas de cilantro y los chalotes en una pizca de aceite de oliva durante cinco minutos.", "Agregue el puré de tomate y cocine por tres minutos. Agregue las conchas, caldo de pollo, brandy y tomates. Llevar a fuego lento y cocinar durante 40 minutos.", "Retirar del fuego, enfriar un poco y pasar a través de un paño de muselina en un recipiente limpio. Deje que se enfríe completamente.", "Para aclarar el consomé, mezcle todos los ingredientes para la clarificación en una licuadora y bátalo en el caldo de langosta refrigerada.", "Coloque sobre el fuego y cocine a fuego lento.", "Una vez que se forme una costra en la parte superior, haga un pequeño orificio con un cucharón y cocine a fuego lento durante 20 minutos.", "Retire del fuego y cuele cuidadosamente a través de doble muselina, sabor y sazone si es necesario. Dejar enfriar en el refrigerador hasta que esté listo para usar.", "Cortar las colas de langosta cocida en segmentos y colocar en un recipiente frío. Con cuidado, coloque los ingredientes de la guarnición encima y vierta el consomé frío. Termine con un chorrito de aceite de limón."], "url": "www_bbc_co_uk_food_recipes_chilled_lobster_consomm_00047", "title": "Ensalada de langosta enfriada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "6 cebolletas grandes, lavadas y en rodajas", "2 dientes de ajo, pelados y picados", "1 loncha de tocino de loncha, picada", "500ml / 18fl oz de caldo de verduras", "675g / 1lb 8oz de guisantes frescos o congelados sin cáscara", "1 ronda de lechuga, lavado y picado", "Gran puñado de menta recién picada", "sal", "Pimienta blanca recién molida", "4 cucharadas de crema doble ligeramente espesada", "Ramitas de menta fresca"], "method": ["Calienta el aceite en una sartén grande. Agregue las cebollas de primavera, el ajo y el tocino y cocine suavemente durante 5-7 minutos o hasta que las cebolletas estén suaves pero no doradas.", "Verter en el caldo y llevar a ebullición. Agregue los guisantes, vuelva a hervir y reduzca al punto de ebullición. Revuelva en el", "lechuga y menta. Continúe cocinando durante 2-3 minutos o hasta que los guisantes estén tiernos.", "Mezcle la mezcla de sopa en un licuador o licuadora hasta que quede suave. Sazone al gusto. Si usa un licuadora, no llene demasiado el recipiente y enfríe la mezcla de sopa levemente antes de licuar. Vierta en un tazón grande y deje enfriar. Cubra y enfríe durante cuatro horas o toda la noche.", "Para servir, vierta la sopa en los cuencos de sopa fría. Vierta una cucharada de crema en la sopa y cubra con una ramita de menta antes de servir."], "url": "www_bbc_co_uk_food_recipes_chilledpeaandmintsou_72223", "title": "Sopa de guisantes y menta refrigerada", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]