[{"ingredients": ["165g / 5½oz de mantequilla suave", "100g / 3½oz de azúcar moreno claro", "100 g / 3½ oz de azúcar en polvo", "4 huevos de gallinas camperas", "Harina de auto aumento 260 g / 9 oz", "80g / 3oz de queso ricotta", "3 cucharadas de esencia de café o 2 cucharadas de café disuelto en 4 cucharadas de agua", "12 galletas amaretti, aproximadamente desmenuzadas", "azúcar glas y cacao en polvo, para quitar el polvo", "500g / 1lb 2oz mascarpone", "1 vaina de vainilla, solo semillas (o 2 gotas de extracto de vainilla)", "4 cucharadas de azúcar glas", "4 cucharadas de vino Marsala", "8 galletas amaretti, aproximadamente desmenuzadas", "165g / 5½ oz de azúcar granulada", "165ml / 5½fl oz de agua", "2 cucharadas de esencia de café o 2 cucharadas de café en polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre un molde de muffin con 12 cajas de muffin.", "Coloque la mantequilla y los azúcares en un tazón grande y mezcle hasta que estén suaves y esponjosos. Agregue la mitad de los huevos, luego incline la mitad de la harina y revuelva bien. Repita con el resto de los huevos, luego tamice la harina restante. Agregue la ricotta, el café y los bizcochos y mezcle bien.", "Usando una bola de helado o dos cucharadas de postres, divida la mezcla entre las cajas de muffins. Extiende la mezcla con el dorso de una cuchara. Hornee en el horno durante 25-30 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio. Sacar del horno y dejar enfriar.", "El relleno y el jarabe se pueden hacer mientras los pasteles se hornean. Mezcle todos los ingredientes de relleno en un recipiente y déjelos a un lado en la nevera.", "Ponga todos los ingredientes de jarabe en una sartén a fuego lento y deje que el azúcar se disuelva. Suba el fuego y hierva por unos minutos o hasta que esté espeso, luego retire la sartén del fuego y déjela enfriar.", "Una vez que los pasteles estén cocidos, retíralos del horno y déjalos enfriar en la lata. Una vez que pueda manejarlos, retire cada torta de la caja y corte en dos horizontalmente. Coloque las mitades con el lado cortado hacia arriba en un plato grande. Cepíllese generosamente con el jarabe de azúcar. Enfréntate aquí, los pasteles deben estar realmente, realmente húmedos. Mantenga el resto del almíbar para verter sobre los pasteles en la mesa.", "Vuelva a unir las mitades con una cucharada generosa de crema de mascarpone, espolvoree las cubiertas con azúcar glasé y cacao en polvo y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mini-tiramisu_cakes_73687", "title": "Tartas de mini tiramisú", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini-tiramisu_cakes_73687_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla, derretida, más extra para engrasar", "Harina 100g / 3½ oz de levante automático, más extra para quitar el polvo", "100 g / 3½ oz de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "½ cucharadita de extracto de almendra", "60 g / 2¼ oz de manzanas Bramley, peladas y en rodajas finas", "Almendras en copos de 15g / ½oz", "crema fresca, para servir (opcional)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Engrase el interior de los aros de cocina con un poco de mantequilla y espolvoréelo con harina. Coloque los anillos de cocción en una bandeja para hornear forrada con papel de hornear.", "Vierta la mantequilla derretida en un tazón grande. Agregue el azúcar, la harina, el huevo y el extracto de almendras y mezcle hasta que estén combinados.", "Ponga un poco de la mezcla en la base de cada anillo, coloque algunas rodajas de manzana sobre la masa y coloque la mezcla de torta restante en la parte superior, nivelando con la parte posterior de una cucharilla.", "Esparce cada pastel con almendras en copos. Hornee durante 25-30 minutos o hasta que estén bien dorados.", "Déjelo enfriar por unos 10 minutos antes de quitar los anillos. Sirva caliente con una cucharada de crème fraîche."], "url": "www_bbc_co_uk_food_recipes_mini_apple_and_almond_10454", "title": "Mini tortas de manzana y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 6 tortas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_apple_and_almond_10454_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "Arroz arborio 250 g / 9 oz", "125ml / 4½oz de vino blanco seco", "700 ml / 1 libra 9 oz de caldo de pollo fresco, caliente", "pizca de azafrán", "2 cucharadas de mantequilla", "30 g / 1 oz de queso parmesano, rallado", "2 lonchas pancetta", "1 ramita fresca de romero, solo hojas", "Ciabatta rancia 150g / 5½oz, picado en pedazos", "30 g / 1 oz de pistachos sin sal, sin cáscara y finamente picados", "Mozzarella de búfalo 50 g / 1¾oz, finamente picada", "25 g / 1 oz de queso fontina, rallado", "30g / 1oz de tomates secados al sol en aceite, finamente picados", "1 huevo, ligeramente batido", "sal y pimienta negra recién molida", "½ cucharada de aceite de oliva", "2 dientes de ajo, aplastados", "1 chile rojo, finamente picado", "25 g / 1 oz de albahaca fresca, hojas recogidas, tallos finamente picados", "400 g de tomates de hojalata"], "method": ["Caliente el aceite en una sartén de base pesada a fuego medio y agregue la cebolla. Cocine por 10 minutos o hasta que esté transparente. Agregue el ajo, el arroz y las tostadas durante unos minutos. Vierta el vino y cocine, revolviendo, hasta que se evapore.", "Mientras tanto, caliente el caldo de pollo. Revuelva una cucharada de caldo caliente en el arroz hasta que haya sido absorbido. Continúe agregando el caldo, un cucharón a la vez, agregando el azafrán hasta la mitad de la cocción, hasta que el arroz esté casi cocinado.", "Retire el arroz del fuego, agregue la mantequilla y deje cubierto por 4 minutos. Agregue el parmesano y luego unte la mezcla en una bandeja para hornear fría hasta que esté listo para usar.", "Mientras tanto, para hacer la salsa, caliente el aceite en una sartén a fuego medio y fría el ajo, el chile y los tallos de albahaca durante 5 minutos. Agregue los tomates y cocine a fuego lento durante 20 minutos.", "Retire los tomates del fuego y mezcle con una batidora de mano. Agregue las hojas de albahaca y déjelas a un lado en un lugar cálido hasta que estén listas para servir.", "Freír las lonjas de panceta con el romero hasta que estén crujientes en una sartén. Incline en un procesador de alimentos con la chapata y mezcle en pan rallado. Incline la mezcla en un tazón.", "En un tazón, combine todos los ingredientes restantes, que no sean el huevo, mezcle bien y forme 16 bolitas.", "Empaque el arroz enfriado alrededor de la bola de relleno y cepille cada uno con huevo batido y luego revuelva la mezcla de pan rallado hasta que se cubra.", "Caliente una freidora a 180 ° C o hasta que un cubo de pan se dore en 20 segundos (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los arancini en lotes durante 2 o 3 minutos hasta que estén dorados. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Sirve con la salsa arabiatta."], "url": "www_bbc_co_uk_food_recipes_mini_arancini_05304", "title": "Mini arancini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "125g / 4½oz de mantequilla fría, cortada en cubitos", "2 cucharadas de azúcar", "pizca de sal", "2 yemas de huevos de gallinas camperas", "1 cucharada de crema doble", "250g / 9oz de azúcar moreno", "50g / 1¾oz de mantequilla", "Crema doble de 142ml / ¼ de pinta", "2 plátanos maduros", "Crema doble 500ml / 18fl oz", "4 cucharadas de azúcar glas", "125g / 4½oz de chocolate de buena calidad, rasurado con un cuchillo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6. Engrasar un envase de 12 agujeros petit four", "Para la masa, coloque la harina, la mantequilla, el azúcar y la sal en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue las yemas de huevo y suficiente crema para unir la mezcla y formar una masa. Envuelva la masa en una película adhesiva y colóquela en la nevera durante al menos 30 minutos.", "Mientras tanto, haz el caramelo. Caliente el azúcar y la mantequilla en una sartén hasta que el azúcar se haya disuelto, agregue la crema y vierta la mezcla en un tazón. Dejar de lado para enfriar.", "Ruede los pasteles en una superficie de trabajo enharinada, corte 12 círculos y utilícelos para alinear los agujeros del petit four tin. Hornee en el horno durante 12-16 minutos o hasta que la masa esté dorada y crujiente. Con cuidado, transfiera las cajas de repostería a una rejilla de alambre y déjelas a un lado para que se enfríen.", "Para la mousse, machaque los plátanos con una licuadora de mano. Batir la crema hasta que tenga picos suaves y luego doblar en los plátanos y el azúcar. Vierta en un tazón y relájese en la nevera.", "Para ensamblar, coloque un poco de toffee en cada caja de repostería. Coloque la mousse en una manga pastelera equipada con una boquilla y un tubo en la parte superior del toffee. Dispersar sobre el chocolate raspado."], "url": "www_bbc_co_uk_food_recipes_mini_banoffee_pies_39023", "title": "Mini pasteles de banoffee", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 x 25cm / 10 pulgadas de hojas cuadradas de pasta filo prefabricada", "mantequilla, derretida, para cepillar", "Filete de cola de filete 125 g / 4½ oz, cortado en 25 cubos de igual tamaño (alrededor de 1.5 cm / ½ pulgada)", "sal y pimienta negra recién molida", "1 cucharadita de miel clara", "1 cucharada de aceite vegetal", "4 cucharadas de salsa de rábano picante a la crema caliente", "1 cucharada de perejil picado, para adornar"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cepille ambas hojas de la masa de filo con la mantequilla derretida y colóquelas una al lado de la otra. Usando un cortador de hojaldre cuadrado de 5 cm / 2 pulgadas, o un cuchillo afilado, corte 25 cuadrados de cada hoja de masa (debe haber exactamente la cantidad correcta de masa para obtener 50 cuadrados sin adornos).", "Tome un bollo cuadrado y coloque otro sobre él, girando la capa superior en ángulo para crear una forma de estrella. Repita este proceso con todos los cuadrados de repostería para crear 25 estrellas.", "Presione una estrella de repostería, con la mantequilla hacia abajo, en cada uno de los moldes de la lata de muffins para crear 24 cajas mini tartaletas. (La estrella de repostería restante se puede cocinar por separado en un molde para muffins individual, o se puede desechar).", "Hornee las cajas de tartaletas en el horno durante 5-10 minutos, o hasta que estén doradas y crujientes. Retire del horno y transfiéralo cuidadosamente a una rejilla de alambre para que se enfríe completamente.", "En un tazón, sazone los filetes de solomillo con sal y pimienta negra recién molida, luego rocíe sobre la miel y mezcle bien para cubrir la carne.", "Calentar el aceite en una sartén a fuego muy alto, luego freír el bistec durante 1-2 minutos en todos los lados, o hasta que se dore por todas partes, pero aún rosado en el medio. Transfiera a un plato y reserve para descansar por un minuto o dos.", "Ponga cucharadas pequeñas, del mismo tamaño, del rábano picante en las cajas de repostería enfriadas, luego coloque un trozo caliente de solomillo encima de cada una. Espolvoree cada tartaleta con una pizca de perejil picado justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_mini_beef_wellington_18819", "title": "Tartaletas de ternera Mini Wellington", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 24", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_beef_wellington_18819_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de arándanos frescos o congelados", "1 cucharada de azúcar en polvo", "1 cucharada de jugo de limón", "100 g / 3½ oz de mantequilla, refrigerada y en cubos", "Harina normal de 200 g / 7 oz, tamizada", "Azúcar glaseado de 40 g / 1½ oz, tamizado", "1 huevo de gallinas camperas, golpeado", "55 g / 2 oz de mantequilla o untar para hornear", "Azúcar en polvo de 55 g / 2 oz", "1 huevo de gallinas camperas, golpeado", "40 g / 1½ oz de almendras molidas", "1 cucharada de harina normal", "85g / 3oz de azúcar glasé", "arándanos frescos"], "method": ["Para la mermelada, coloque todos los ingredientes en una olla pequeña y caliente suavemente hasta que las bayas comiencen a reventar. Cocine durante unos minutos hasta que la mezcla se espese, luego retírela del fuego, cuele a través de un colador y deje enfriar por completo.", "Para la masa, frote la mantequilla en la harina en un tazón mediano hasta que la mezcla se asemeje a migas de pan finas y luego mezcle el azúcar. Use una espátula para cortar el huevo batido y luego presione para formar una bola. Envuelva la película adherida y deje enfriar durante al menos 30 minutos.", "Engrase una lata para muffins de 12 hoyos. Desenvuelva la masa, coloque una hoja grande de papel antigrasa en la parte superior y extienda la masa hasta un grosor de 3 mm / ⅛ pulg. Use una cuchilla redonda de 5 cm / 2 in para cortar 12 bases para las mini tartas y coloque una en cada orificio de la moldes para muffin. Haga los lados cortando 12 tiras de 1 cm / ½ pulgada x 18 cm / 7 pulg. De la masa restante y presione suavemente alrededor de cada orificio del molde para muffins. Enfríe por 15 minutos.", "Precalentar el horno a 170 C / 325 F / Gas 3.", "Para el frangipane, coloque los ingredientes en un bol y bata con una batidora eléctrica hasta que estén suaves y bien combinados.", "Pinche las bases de las cajas de pastelería y coloque media cucharadita de mermelada en cada una. Cubra con la mezcla de frangipane y hornee en el horno durante unos 25 minutos hasta que el frangipane se haya levantado y dorado. Enfriar en la lata durante unos minutos y luego transferir a una rejilla de alambre.", "Para el relleno, mezcle el azúcar glas con un poco de agua para formar una pasta espesa. Extienda sobre las tartas enfriadas y cubra cada una con uno o dos arándanos frescos."], "url": "www_bbc_co_uk_food_recipes_mini_blueberry_bakewell_93838", "title": "Mini tartas de Blueberry Bakewell", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_blueberry_bakewell_93838_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 500 g / 1 libra 2 oz paquete de hojaldre confeccionado", "harina común, para quitar el polvo", "20g / ¾oz de hongos porcini secos o grandes morillas", "2 cucharadas de aceite vegetal", "sal y pimienta negra recién molida", "4 x 180g / 6oz rebanadas de filete de res", "4 chalotes pequeños, pelados y muy finamente picados", "botón de mantequilla", "500g / 1lb 2 oz de champiñones castaños, finamente picados", "Generoso guiso medio jerez dulce (opcional)", "gran puñado de hojas frescas de tomillo", "1 huevo de gallinas camperas, ligeramente golpeado", "300 ml / 10 fl oz doble crema"], "method": ["Ruede la masa de hojaldre en una superficie de trabajo enharinada a un grosor de 5 mm / ¼. Recorte la masa en un cuadrado de 36cm / 14 pulgadas. Luego corte en cuatro cuadrados más pequeños y colóquelos en dos bandejas para hornear. Enfriar en la nevera durante cinco minutos.", "Enjuague los champiñones secos en agua fría, luego colóquelos en un recipiente y cúbralos con agua caliente. Déjalo en remojo durante 20 minutos.", "Mientras tanto, caliente el aceite en una sartén hasta que esté muy caliente. Sazone bien la carne con sal y pimienta negra recién molida. Freír por un minuto en cada lado. Retire de la sartén y reserve.", "Coloque los chalotes en la sartén y fría durante 4-5 minutos o hasta que estén blandos. Agregue la mantequilla y los champiñones castaños y cocine por unos minutos.", "Mientras tanto, escurre los hongos secos y pique finamente, luego agréguelos a la sartén con el glug de jerez, si los usa. Aumente el fuego y cocine hasta que la mayor parte del jerez se haya evaporado.", "Agregue el tomillo, cocine durante un minuto, luego retire la sartén del fuego y déjela a un lado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire la masa de la nevera y coloque una cucharada de la mezcla de champiñones en el centro de cada pieza de masa; extiéndelo al mismo tamaño que el filete de carne. Cubra con el bistec y cepille los bordes con el huevo batido.", "Dibuja las esquinas y los bordes de la masa para que se encuentren y se superpongan ligeramente en el medio. Gírelo hacia arriba y déle forma a los lados un poco con sus manos. Si la masa es suave, enfríela en la nevera durante 5-10 minutos para que se endurezca.", "Corta la parte superior de los Wellington con un cuchillo y cepíllalos con el resto del huevo batido. Hornea de 12 a 14 minutos (para medio raro), o hasta que esté cocido a tu gusto.", "Cinco minutos antes de que los Wellington estén listos, vuelva a calentar la mezcla de champiñones restante. Cuando esté caliente, agregue la crema doble y cocine a fuego alto durante 2-3 minutos. Retire la sartén del fuego, sazone con sal y pimienta negra recién molida, luego cubra con una tapa para mantener el calor.", "Sirva los Wellingtons con una cucharada de salsa."], "url": "www_bbc_co_uk_food_recipes_mini_beef_wellingtons_12665", "title": "Mini beef Wellingtons con champiñones, jerez y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla salada, cortada en cubos y congelada", "100 g / 3½ oz de manteca de cerdo, cortado en cubos y congelado", "Harina normal de 250g / 9oz", "½ cucharadita de sal", "1 cucharada de jugo de limón", "aceite infusionado con ajo (disponible en la mayoría de los grandes supermercados), para freír", "2 dientes de ajo ahumado, finamente picado", "1 chalote, finamente picado", "10 g de hongos porcini secos, empapados en agua hirviendo durante unos minutos", "125 g / 4½ oz de champiñones castaños, lavados, en rodajas", "pequeño racimo de tomillo", "50ml / 2fl oz de vino blanco seco", "1 cucharadita de sal marina", "pimienta negra agrietada", "Filete de solomillo de 6 x 80 g / 3 oz", "sal y pimienta negra recién molida", "6 rebanadas de jamón prosciutto", "1 huevo de gallinas camperas, golpeado"], "method": ["Para la repostería, en un procesador de alimentos, mezcle la mantequilla, manteca, harina y sal hasta que se asemeje a pan rallado. Agregue el jugo de limón y suficiente agua fría para unir la mezcla en una masa.", "En una superficie de trabajo ligeramente enharinada, extienda la masa en un rectángulo grande. Con un borde corto hacia usted, doble el tercio inferior hacia arriba y el tercio superior hacia abajo. Gire la masa 90 grados (un cuarto de vuelta) y repita el balanceo y plegado. Envuelva la película adherida y colóquela en la nevera durante 20 minutos.", "Para el champiñón duxelle, caliente un poco de aceite de ajo en una sartén. Agregue el ajo y la chalota y fríe con cuidado hasta que la chalota esté suave y translúcida.", "Escurra los hongos porcini y exprima el exceso de agua. Agrégalos a un procesador de alimentos y pulsa hasta que se asemejen a migas de pan.", "Para la masa, repita el proceso de laminado y plegado y vuelva a la nevera durante otros 15-20 minutos.", "Para el champiñón duxelle, ponga los hongos porcini y los champiñones castaños en la sartén con el ajo y la chalota. Cocine a fuego lento durante 10 minutos, luego agregue el tomillo y el vino. Sazonar con sal y pimienta y, cuando la mezcla se reduzca a una pasta, reservar para enfriar.", "Para la carne de res, caliente una sartén de base pesada a fuego medio-alto. Cuando la sartén esté caliente, condimente el bistec y cocínelo hasta que se dore por todas partes (es posible que deba hacerlo por lotes). Dejar de lado para enfriar.", "Cuando el bistec esté frío, envuelve bien cada pieza en una loncha de jamón.", "Para la masa, repita el proceso de laminado y plegado una vez más. Vuelve a la nevera por 15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando esté frío, en una superficie de trabajo ligeramente enharinada, extienda la masa a un rectángulo de 30cm x 45cm / 12in x 18in (alrededor de 5mm de grosor). Usando un cuchillo afilado, córtelo en rectángulos de 6cmx15cm / 2in x 6in y extiéndalo con la mezcla de champiñones. Coloque una pieza de carne en el medio de cada cuadrado y envuélvala bien en la masa, teniendo cuidado de asegurarse de que la carne esté completamente encerrada. Prensar la costura de la masa y meter los extremos.", "Cepíllese con huevo batido, califique las copas y hornee durante unos 25 minutos, o hasta que la masa esté crujiente y dorada. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_mini_beef_wellingtons_53236", "title": "Mini botas Wellingtons", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 6 Wellingtons de carne de vacuno individuales", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 375 g / 13 oz, más extra para quitar el polvo", "pizca de sal", "175g / 6oz de mantequilla, en cubos", "75-110ml / 3-4fl oz de agua fría", "400g / 14oz de arándanos", "50 g / 2 oz de azúcar en polvo", "2 vainas de vainilla, partidas, semillas raspadas", "2 yemas de huevo de gallinas camperas, batidas", "200g / 7oz de crema coagulada", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "Leche 150ml / 5floz", "Crema doble 150ml / 5floz", "150g / 5oz de arándanos", "50 g / 2 oz de azúcar en polvo", "2 cucharadas de agua"], "method": ["Para el pastel, coloque la harina, la sal y la mantequilla en un tazón y frote hasta que la mezcla se asemeje a pan rallado.", "Agregue el agua un poco a la vez, hasta que la mezcla se una como masa. Amasar ligeramente, dar forma a un disco grueso, envolver en film transparente y enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Espolvoree la superficie de trabajo con un poco de harina y luego enrolle los pasteles a un grosor de 5 mm / ¼. Recorta cuatro círculos de 15cm / 6in y cuatro de 10cm / 4½del pastel.", "Alinee cada uno de los cuatro moldes dariole con los círculos de masa más grandes.", "Mezcle las semillas de arándanos, azúcar y vainilla juntas en un recipiente hasta que estén bien combinadas. Divida la mezcla entre los moldes dariole, presionando firmemente.", "Cepille el borde de la masa con la yema de huevo batida y cubra cada molde con un círculo de repostería de 10 cm. Presione hacia abajo los bordes firmemente y recorte cualquier exceso. Engarce los bordes y cepille con la yema de huevo restante.", "Hornee en el horno durante 30-35 minutos, o hasta que la masa esté cocida y dorada.", "Retire los pasteles del horno y déjelos a un lado para que se enfríen durante cinco minutos.", "Para la crema pastelera, bata las yemas de huevo y el azúcar en un bol hasta que estén bien combinados.", "Llevar la leche y la crema a ebullición en una cacerola. Batir lentamente la mezcla de crema en los huevos hasta que estén bien combinados. Regrese la mezcla a la cacerola y caliente lentamente, revolviendo continuamente, hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara.", "Para la compota, caliente una sartén hasta que esté caliente, agregue los arándanos, el azúcar y el agua y cocínelos durante 2-3 minutos o hasta que estén almibarados.", "Para servir, coloca la natilla en un charco en el centro del plato y luego coloca el pastel encima. Rocíe la compota alrededor del plato y termine con una quenelle de crema coagulada."], "url": "www_bbc_co_uk_food_recipes_mini_blueberry_pies_19105", "title": "Mini pasteles de arándanos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal para engrasar", "1 huevo de gallinas camperas", "1 cucharada de polenta (cocción rápida)", "1 gran puñado de espinacas baby", "100 g / 3½ oz de requesón", "pellizcar el chile en polvo suave", "Harina normal de 45g / 2oz", "pimienta negro"], "method": ["Primero lávate las manos y ponte un delantal. Pese y mida todos los ingredientes. Pídale a un adulto que precaliente el horno a 200 ° C / 400 ° F / Gas 5. Aceite una bandeja de mini muffins usando el cepillo para pasteles y el aceite vegetal.", "Rompa el huevo en un bol y bátalo con el tenedor, luego agregue la polenta. Esto permite que la polenta se reblandezca un poco antes de cocinar.", "Pídele a un adulto que te ayude a cortar las hojas de espinaca en pedazos pequeños con tijeras.", "Agregue el requesón, el chile en polvo y la pimienta negra al bol de mezcla. Luego agregue la mezcla de huevo y polenta. Espolvorea la harina común sobre la mezcla y revuelve hasta que esté completamente combinada", "Divida la mezcla en partes iguales entre las seis partes de la lata de muffins. Hornee durante 12-15 minutos o hasta que estén dorados en la parte superior. Deja enfriar. Sirva uno o dos de estos pequeños pasteles salados con jamón."], "url": "www_bbc_co_uk_food_recipes_mini_cheese_munchies_61275", "title": "Mini bocadillos de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6 tentempiés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de arándanos", "2 manzanas Granny Smith, peladas, sin corazón y cortadas en cubos pequeños", "175g / 6oz picado fechas Medjool, finamente picado", "2 cucharaditas de canela molida", "2 naranjas, ralladura fina y jugo solamente", "2 cucharadas de vinagre balsámico", "sal marina y pimienta negra recién molida", "Harina de espelta lisa o integral de 225g / 8oz, más extra para quitar el polvo", "75g / 2½oz de mantequilla sin sal", "1 huevo de gallinas camperas", "pizca de sal", "1 cucharada de aceite de oliva", "75 g / 2½ oz de calabaza pelada y / o batata, cortadas en cubos pequeños", "1 cebolla pequeña, finamente picada", "1 ramita de tomillo, hojas recogidas", "1 diente de ajo, finamente picado", "75g / 2½oz de espinaca para bebé", "300g / 10½oz de lentejas Puy o verdes enlatadas, escurridas", "75 g / 2½ oz de castañas cocidas, finamente picadas (estañada está bien)", "25g / 1oz de piñones tostados", "1 manzana pequeña roja / verde, pelada, sin corazón y muy finamente picada", "pizca de nuez moscada recién rallada", "1-2 cucharaditas de canela molida", "½ cucharadita de pimentón (opcional)", "1 huevo de gallinas camperas, golpeado", "hojas de ensalada, para servir"], "method": ["Para la salsa, mezcle todos los ingredientes, incluyendo un poco de sal y pimienta, en una sartén mediana. Agregue 100 ml / 3½ fl oz de agua y deje que hierva. Reduzca el fuego y cocine a fuego lento durante unos 10 minutos, revolviendo ocasionalmente, hasta que los arándanos se rompan y ablanden, y las manzanas y las fechas se hayan cocinado para darles una salsa gruesa.", "Retire del fuego y sirva caliente o frío. Esto se mantendrá en un recipiente hermético en el refrigerador hasta por un mes.", "Para la masa, coloque todos los ingredientes en un procesador de alimentos y gírelos juntos hasta que comiencen a formar una bola lisa de masa. Si usa harina de espelta simple, agregue 3 cucharadas de agua para ayudar a unirlo. Si usa harina integral, necesitará agregar otras 1-2 cucharadas de agua. Alternativamente, para hacer a mano, frote la harina en la mantequilla hasta que la mezcla se asemeje a pan rallado. Batir ligeramente el huevo en un tazón pequeño y remover en las migas muy bien con un cuchillo de mesa hasta que se formen grumos. Agregue el agua (como arriba) para unirlo.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Para los mini Wellingtons, caliente el aceite en una sartén grande a fuego medio-bajo. Agregue la calabaza y / o la batata, la cebolla y las hojas de tomillo y cocine durante unos 15 minutos, revolviendo de vez en cuando, hasta que la calabaza esté tierna.", "Mientras se está cocinando, espolvoree ligeramente la superficie de trabajo con harina y extienda la masa hasta un cuadrado de 36 cm / 14 pulgadas, aproximadamente 1 mm de grosor (o tan delgado como pueda obtenerlo). Asegúrate de que los bordes sean rectos y nítidos, cortándolos con un cuchillo si es necesario. Corte este cuadrado en cuartos y coloque los 4 cuadrados en una bandeja grande para hornear forrada con pergamino para hornear (o duplíquelos con un pergamino entre cada par si la bandeja no es lo suficientemente grande). Cubra con film transparente y refrigere durante aproximadamente 10 minutos.", "Una vez que las verduras estén cocidas, agregue el ajo y cocine por un minuto más, luego incline la mezcla en un tazón grande. Regrese la sartén al fuego, agregue la mitad de la espinaca junto con 1 cucharada de agua. Cocine durante 1-2 minutos mientras se agita, hasta que se marchite. Incline en un colador en el fregadero, luego repita con la mitad restante de espinacas. Enjuague todo bajo agua fría hasta que se enfríe lo suficiente como para manipularlo, luego tome puñados a la vez, exprima la mayor cantidad posible de agua de la espinaca y agréguela a la mezcla de vegetales.", "Agregue las lentejas, las castañas, los piñones, la manzana, la nuez moscada y la canela. Agregue el pimentón si lo desea, me encanta el pimentón en casi todo. Mezcle bien y luego sazone, al gusto, con sal y pimienta", "Divida la mezcla de llenado de manera uniforme entre los 4 cuadrados de masa, poniéndola en el centro de cada uno. Deje un borde de aproximadamente 2 cm / ¾ pulg. Alrededor de la mezcla y cepille con el huevo batido (reserve el huevo restante). Doble 2 esquinas opuestas de la masa hacia dentro para encontrarse en el medio. Luego, dobla las otras esquinas opuestas en el centro también, pero solo superponiendo el primer trozo de masa para que se adhieran firmemente y formen una bolsa. Voltéelos para que el lado sellado quede abajo y use un cuchillo pequeño y afilado para cortar la parte superior con 3 'cortes'. Colóquelos en una sola capa sobre una bandeja para hornear y vuelva a colocarlos en la nevera durante 10 minutos para que se endurezcan.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Retire los Wellington de la nevera y cepille las partes superiores y laterales con el huevo restante. Hornee durante 25-30 minutos o hasta que la masa esté cocida y dorada y el relleno esté bien caliente. Retirar del horno y servir con hojas de ensalada."], "url": "www_bbc_co_uk_food_recipes_mini_chestnut_apple_and_65851", "title": "Wellingtons de castaña, manzana y espinaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_chestnut_apple_and_65851_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ onzas de mantequilla, suavizadas", "150g / 5½oz de azúcar mascabado ligero", "3 huevos grandes de gallinas camperas", "150g / 5½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear de nivel", "1 cucharada de esencia de café", "75g / 2½oz de nueces picadas", "150 g / 5½ onzas de mantequilla, suavizadas", "450g / 1lb de azúcar glas, tamizado", "2 cucharadas de leche", "1 cucharada de esencia de café", "Mitades de nuez 200 g / 7 oz, finamente picadas", "16 granos de café cubiertos de chocolate"], "method": ["Precaliente el horno a 190 ° C / 170 ° C (ventilador) / 375 ° F / Gas 5. Engrase un mini pastel de 16 tazas y hilvane el pergamino para hornear o, alternativamente, engrase 16 anillos de chefs (5 cm / 2 pulgadas de diámetro) y colóquelos en una bandeja para hornear forrada con pergamino para hornear.", "Para las tortas, coloque la mantequilla, el azúcar, los huevos, la harina, el polvo de hornear y la esencia de café en un bol y bata con una cuchara de madera hasta que esté completamente mezclado y sin grumos. Dobla las nueces.", "Divida o pipe la mezcla en partes iguales entre las mini latas de pastel. Hornee por unos 12-15 minutos, o hasta que esté bien levantado y la parte superior de la tarta salta hacia atrás cuando se presiona ligeramente con el dedo.", "Dejar enfriar en latas por unos minutos. Cuando esté lo suficientemente frío como para manipularlo, saque los pasteles de las latas y retire el pergamino. Deje que se enfríe completamente en una rejilla de alambre.", "Para el relleno y la decoración, bata la mantequilla, el azúcar glas, la leche y la esencia de café en un bol hasta que quede suave.", "Cuando los pasteles estén completamente fríos, recorte la parte superior si tiene forma de cúpula. Rebana por la mitad horizontalmente, luego siéntala junto con aproximadamente un cuarto de la crema de mantequilla.", "Extienda una fina capa de crema de mantequilla alrededor de cada pastel y luego enrolle los lados en nueces picadas.", "Con una cuchara, coloca la crema de mantequilla restante en una manga pastelera con una boquilla de estrella pequeña (2D) y coloca una rosa en la parte superior de cada pastel. Coloque un grano de café cubierto de chocolate sobre las uniones.", "Arregle los cupcakes en el mejor puesto de pasteles que tenga y sirva."], "url": "www_bbc_co_uk_food_recipes_mini_coffee_and_walnut_12591", "title": "Mini café y tortas de nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 mini pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_coffee_and_walnut_12591_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "75 g / 2½ oz de mantequilla ablandada, en cubos", "75 g / 2½ oz de azúcar en polvo", "3 yemas de huevo medianas", "400 ml / 14 fl oz crema doble", "1 cucharadita de pasta de frijoles de vainilla", "1 cucharada de azúcar glas, tamizada", "3 cucharadas de mermelada de albaricoque", "3 cestitas de frambuesas"], "method": ["Para hacer el pâte sucrée, mida la harina en un tazón. Frote la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Agregue el azúcar, agregue las yemas de huevo y mezcle hasta que los ingredientes se unan para formar una masa. Amasa la mezcla suavemente hasta que quede suave.", "Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante aproximadamente 30 minutos.", "Precalentar el horno a 190C / Fan 170C / Gas 5.", "Mientras tanto, haz el glaseado para terminar las tartas más tarde. Caliente la mermelada de albaricoque en una cacerola, luego pase a través de un colador en un tazón. Agregue un chorrito de agua si es necesario para que el glaseado se escurra. Dejar de lado.", "Extienda la masa refrigerada en una superficie de trabajo ligeramente enharinada y corte alrededor de 12 rondas usando un cortador redondo para pasteles de 7,5 cm / 3 pulgadas (preferiblemente con bordes lisos en lugar de rizados). Cualquier pastel sobrante se puede volver a enrollar solo una vez.", "Facilita las rondas de repostería en el molde y golpea ligeramente las bases con un tenedor. Corta doce piezas cuadradas de 10cm / 4 pulgadas de pergamino para hornear y úsalos para alinear cada caja de repostería (encontrarás que el pergamino se asienta mejor si lo arruinas primero). Llene cada caja de repostería con lentejas crudas o arroz (los frijoles para hornear serán demasiado grandes para las latas).", "Hornee las cajas de repostería por unos 15 minutos o hasta que estén doradas. Deje que se enfríe durante unos minutos en la lata, luego déjelos en una rejilla. Retire el papel y las lentejas / arroz, y deje enfriar por completo.", "Para hacer el relleno, batir la crema, el azúcar y la vainilla hasta que forme picos suaves cuando se quite la batidora.", "Para servir, vierta un poco de relleno en cada caja de tartaleta. Coloque las frambuesas encima y cepille abundantemente el atasco sobre las frutas para glasear."], "url": "www_bbc_co_uk_food_recipes_mini_fruit_tarts_30208", "title": "Mini tartas de frutas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12 tartaletas pequeñas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla, ablandada, más extra para engrasar", "50g / 1¾oz de cáscara confitada", "100 g / 3½ oz de sultanas doradas", "100g / 3½oz de arándanos secos", "2 cucharadas de ron con especias", "425 g / 15 oz de harina de pan blanco, más extra para espolvorear", "60g / 2¼ oz de azúcar en polvo", "1 cucharadita de sal", "18 g de levadura fresca", "160ml / 5¼fl oz de agua tibia", "3 huevos de gallinas camperas, 2 huevos enteros y 1 batido para lavar huevos", "1 naranja, solo ralladura", "Crema doble 500ml / 18fl oz", "125g / 4½oz de azúcar moreno claro y suave", "5 cucharadas de ron"], "method": ["Para el pan dulce, engrase una lata para panecillos de 12 hoyos y cara profunda con mantequilla.", "En un tazón, mezcle la cáscara confitada, sultanas y arándanos con el ron especiado hasta que se combinen. Dejar de lado.", "Agregue la harina, el azúcar y la sal al recipiente de un mezclador de alimentos. Batir la levadura con un poco de agua en un recipiente aparte hasta que se disuelva. Agregue la mezcla de levadura a la harina, luego agregue el agua restante y los huevos enteros y bata hasta que la mezcla se una como masa. (Esto también se puede hacer a mano o con un batidor eléctrico de mano).", "Agregue la mantequilla poco a poco, luego agregue la ralladura de naranja y continúe batiendo durante 4-5 minutos, o hasta que la masa esté suave.", "Coloque la masa a un lado, tapada, en su tazón, para probar durante aproximadamente 1 hora, o hasta que se haya duplicado en tamaño.", "Rechace la masa, espolvoree sobre la fruta seca y amase la fruta en la masa, ya sea en el recipiente o sobre una superficie de trabajo ligeramente enharinada (se sentirá muy pegajosa).", "Enrolla la masa en una bola y córtala en 10-12 piezas del mismo tamaño. Enrolle cada pieza en una bola sobre una superficie de trabajo ligeramente enharinada. Coloque uno en cada orificio de la lata de muffins. Cubra la lata con film transparente y luego déjela a un lado para probar nuevamente durante aproximadamente 45 minutos, hasta que se levante.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Cepille la parte superior de la masa de panettone levantado con la colada de huevo, luego hornee en el horno durante 18-20 minutos, o hasta que se dore y se eleve. Retirar de la lata y reservar para enfriar en una rejilla de alambre.", "Para la mantequilla de ron, bata la crema doble en el tazón de un mezclador de alimentos de pie durante 3-5 minutos, o hasta que se convierta en grumos de grasa sólida con una base líquida. ¡Cubra la batidora con una toalla de cocina o un trapo de muselina a medio golpe, ya que el líquido salpicaría en todas partes mientras comienza a separarse!", "Cubra un tazón grande con la misma toalla de té o muselina, luego incline la mezcla. Coloque la tela en los bordes para cubrir la mantequilla sólida y exprimir todo el líquido. Descarta el liquido", "Incline la mantequilla nuevamente dentro del tazón y bata con azúcar morena suave durante 3-4 minutos, o hasta que esté pálida y esponjosa, agregando el ron un poco a la vez.", "Vierta la mantequilla de ron en frascos esterilizados y selle. Enfríe en el refrigerador o congele hasta que lo necesite, o sirva inmediatamente junto a los panettones calientes."], "url": "www_bbc_co_uk_food_recipes_mini_cranberry_94888", "title": "Mini panetones de arándanos", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "2 limones, zumos y jugo sin cera grandes", "110g / 4oz de mantequilla sin sal", "175g / 6oz de azúcar en polvo", "1 cucharada de harina de maíz", "aerosol de liberación de pastel o mantequilla, para engrasar", "175g / 6oz de extensión para hornear", "175g / 6oz de azúcar en polvo", "3 huevos medianos de granja", "Harina normal 175g / 6oz", "pizca de sal", "1½ cucharadita de polvo de hornear", "1 cucharada de hojas de tomillo de limón finamente picadas", "½ limón, solo ralladura", "100 g / 3½ oz de azúcar en polvo", "algunas ramitas de tomillo fresco de limón, hojas recogidas", "1½ limones, cáscara y jugo solamente", "35 g / 1 oz de azúcar en polvo", "1 limón sin cebar, solo cáscara", "12 rodajas de limón confitadas", "hojas de tomillo, para decoración", "50 g / 1¾oz de mantequilla sin sal, ablandada", "50g / 1¾oz de azúcar glas", "100 g / 3½ oz de queso mascarpone", "100 ml / 3½ fl oz crema doble, batida"], "method": ["Para la cuajada de limón, mezcle los huevos en una cacerola pequeña. Agregue la ralladura de limón, jugo de limón, mantequilla, azúcar y harina de maíz. Revuelva a fuego lento hasta que la cuajada espese. Vierta en un recipiente y luego enfríe en la nevera.", "Para la esponja, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Rocíe la lata de panecillo con aerosol de liberación de torta o grasa con mantequilla. Alinee la parte inferior de las bandejas con pequeños círculos de papel para hornear.", "Coloque la pasta para hornear y el azúcar en una batidora y crema independientes hasta que estén suaves y pálidos. Mezcle los huevos, luego agregue la harina, la sal, el polvo de hornear, el tomillo y la ralladura de limón.", "Llene cada orificio de la lata para muffins hasta llenar tres cuartas partes (es más fácil usar una bola de helado, si tiene una). Hornee durante 15-20 minutos, o hasta que estén dorados y elásticos al tacto.", "Permita que los pasteles se enfríen en las latas, luego retírelos y colóquelos en los bastidores de alambre para que se enfríen por completo.", "Para el almíbar, caliente el azúcar impalpable, el tomillo, la ralladura de limón y el jugo en una olla pequeña hasta que el azúcar se disuelva y se forme un jarabe.", "Con un tenedor o un pincho, perfore las esponjas y luego use un pincel de pastelería para aplicar el jarabe tibio sobre los pasteles.", "Para el relleno, mezcle el jarabe restante con el azúcar y la ralladura de limón. Rocíe sobre la parte superior de los mini pasteles para crear el clásico topping de llovizna de limón.", "Para el llenado, use un batidor eléctrico para untar la mantequilla y el azúcar. Agregue el mascarpone y luego doble la crema batida. Coloque el relleno en una tubería con una pequeña boquilla redonda.", "Corta los pasteles por la mitad y coloca pequeñas rondas en la parte superior de la mitad inferior de cada pastel. Extienda la crema de limón en las mitades superiores y luego colóquela encima de las bases con crema.", "Cubra con las rodajas de limón confitadas y unas hojas de tomillo y acomódelas en un plato para servir o en un soporte para pasteles."], "url": "www_bbc_co_uk_food_recipes_mini_lemon_and_thyme_47253", "title": "Mini tortas de llovizna con limón y tomillo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12 mini pasteles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas", "1 cucharadita de jugo de limón", "150 g / 5½ oz de azúcar en polvo", "115 g / 4 oz de pistachos sin sal, mezclados con un polvo fino", "115g / 4oz de chocolate blanco con frambuesas secas, derretidas", "Crema doble de 142ml / ¼ de pinta", "115g / 4oz de chocolate blanco, afeitado con un cuchillo", "12 frambuesas frescas", "12 hojas pequeñas de menta"], "method": ["Precalentar el horno a 110C / 225F / Gas ¼. Cubra una bandeja para hornear con papel resistente a la grasa.", "Batir las claras de huevo y el jugo de limón en un bol hasta que formen picos rígidos, luego doblar el azúcar y los pistachos. Coloque la mezcla en una bolsa de plástico con una boquilla simple y pise pequeños nidos en la bandeja para hornear. Hornee en el horno durante dos horas, luego sáquelo del horno y déjelo enfriar por completo. Retire con cuidado los merengues del papel.", "Vierta el chocolate derretido en los nidos de merengue. Batir la crema en un bol hasta que se formen picos rígidos cuando se quite la batidora. Con una cuchara, coloca la crema en una manga pastelera con una boquilla pequeña y pipa en el centro de los nidos.", "Afeite el chocolate blanco sobre los nidos y decore cada uno con una frambuesa y una hoja de menta."], "url": "www_bbc_co_uk_food_recipes_mini_meringue_nests_with_63500", "title": "Nido de merengue mini con pistachos y frambuesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200 g / 7oz, más extra para enrollar", "100 g / 3½ oz de mantequilla, en un bloque, congelado", "100 g / 3½ oz de manteca de cerdo, en un bloque, congelado", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de azúcar granulada", "6 peras grandes y firmes (preferiblemente las que son rectas y altas)", "300 g / 10½ oz de azúcar en polvo", "500ml / 18fl oz de vino blanco seco", "2 palitos de canela", "1 naranja, solo ralladura"], "method": ["Para la pasta de hojaldre áspera, mida la harina en un bol y ralle la mantequilla y la manteca de cerdo en la harina. Use un cuchillo para cubrir la mantequilla y la manteca en la harina. Agregue 120-150 ml / 4-5 fl oz de agua fría y mezcle hasta que se junte para formar una masa firme.", "Estirar la masa en una superficie de trabajo enharinada a un rectángulo. Doble el tercio superior hacia abajo y doble el tercio inferior hacia arriba y hacia arriba. Gírelo 90 grados (un cuarto de vuelta) y repita el laminado y plegado. Ponga a un lado, cubierto, en la nevera durante 20 minutos.", "Repita el laminado, plegado y enfriamiento dos veces más para que tenga un total de cuatro pliegues y vueltas. Poner a un lado, envuelto en una película adhesiva, en la nevera hasta que esté listo para usar.", "Mientras tanto, para las peras cocidas, pele las peras, manteniendo los tallos intactos. Incline el azúcar impalpable en una olla grande con 400 ml / 14 fl oz de agua, el vino blanco, la canela y la ralladura de naranja y lentamente hierva, revolviendo hasta que el azúcar se disuelva. Hervir durante tres minutos.", "Agregue las peras a la sartén. Regrese a ebullición, reduzca el fuego a fuego lento y cocine por 15 minutos. Al reservar el jarabe, retire las peras de la sartén con una espumadera y déjelas enfriar sobre papel de cocina. Usando una bola de melón o una cucharadita pequeña, retire el núcleo de las peras.", "Regrese el almíbar al fuego y hierva rápidamente durante 10-15 minutos hasta que el volumen del líquido se reduzca a la mitad y el jarabe sea grueso. Retirar del fuego y reservar para enfriar.", "Cuando la fruta y el almíbar estén fríos, extienda la masa fría a un rectángulo que mida 60x20cm / 23½x8in y un grosor de no más de 5mm / ¼in.", "Con un cuchillo afilado y una regla, corte la masa en tiras largas de 8 mm / ⅓ de ancho. Necesitarás alrededor de 18-20 tiras.", "Cepille las peras con el jarabe de azúcar enfriado y, comenzando desde la parte inferior, envuelva las tiras de masa alrededor de las peras. Cuando llegue al final de la tira de pastelería, cepille ligeramente el extremo con almíbar y presione para adherirse a la siguiente tira de pastelería. Continúa envolviendo hasta llegar a la parte superior de la pera. (Tres tiras deben cubrir cada pera). Meta el final de la última pieza de repostería detrás de la espiral de masa anterior.", "Corta seis formas de hoja del resto de la masa. Dibuja las venas en las hojas con un cuchillo afilado y pega una hoja debajo del tallo de cada pera de repostería, con un poco de jarabe de azúcar.", "Precaliente el horno a 200C / 180C (Ventilador) / 400F / Gas 6. Coloque las peras cubiertas de repostería en una bandeja para hornear. Cepille la masa con huevo batido y espolvoree con el azúcar granulada. Hornea por 25-30 minutos.", "Retire del horno y deje enfriar durante 10-15 minutos y luego sirva con un chorrito de jarabe de azúcar reducido."], "url": "www_bbc_co_uk_food_recipes_mini_pear_pies_77186", "title": "Mini pasteles de pera", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 6 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_pear_pies_77186_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de rango medio", "300 g / 10½ oz de azúcar en polvo", "1 cucharada de harina de maíz", "1 cucharadita de vinagre de vino blanco", "400 ml / 14 fl oz crema doble", "1 vaina de vainilla, solo semillas", "Fresas de 500g / 1lb y 2oz, sin cáscara", "1-2 cucharadas de azúcar glas, al gusto", "1 limón, solo jugo", "Fresas de 200g / 7oz, descascaradas y cortadas en cuartos", "Frambuesas 200 g / 7 oz", "2 ramitas de menta fresca, hojas recogidas", "2 cucharadas de azúcar glas"], "method": ["Precalentar el horno a 125C / 250F / Gas ½.", "Para las mini pavlovas, coloque las claras de huevo en el tazón de un procesador de alimentos grande con un accesorio batidor (asegúrese de que el recipiente esté escrupulosamente limpio). Batir hasta que se formen picos suaves cuando se quite la batidora. Poco a poco bata el azúcar hasta que las claras de huevo estén firmes. Dobla la harina de maíz y el vinagre.", "Con una cuchara, coloca el merengue en pequeños nidos y colócalos en el horno durante 10 minutos. Reduzca el calor a 100C / 200F / Gas ¼ y cocine durante una hora. Deja en el horno durante la noche para que se enfríe por completo.", "Para la crema de vainilla, coloque la crema y las semillas de vainilla en un tazón grande y bata hasta que se formen picos suaves cuando se quite la batidora. Dejar de lado.", "Para la salsa de fresa, coloque las fresas en un procesador de alimentos con el azúcar glas y el jugo de limón. Mézclelo hasta obtener un puré y luego páselo por un colador fino.", "Para servir, coloque las fresas en cuartos en un tazón y agregue la salsa de fresa. Coloque los nidos de merengue en platos para servir y cuchara la crema en la parte superior. Cubra con las fresas en la salsa junto con algunas frambuesas frescas. Adorne con hojas de menta y una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_mini_pavlovas_with_63854", "title": "Mini pavlovas con crema de vainilla y salsa de fresa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pan plano grande de tortilla blanca", "30 g / 1 oz de tomate pasado", "Selección de ingredientes como albahaca fresca, pimientos en rodajas y pollo cocinado triturado", "30 g / 1 oz de queso cheddar maduro, rallado"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Use un cortador de galletas de 7cm / 2¾in para cortar seis círculos pequeños de la envoltura y colocarlos en una bandeja para hornear.", "Coloque una cucharadita de passata en cada círculo y extiéndalo al borde. Espolvoree sobre algunos ingredientes y cubra con un poco de queso rallado.", "Hornee en el horno durante 10-15 minutos o hasta que el queso se derrita y se dore."], "url": "www_bbc_co_uk_food_recipes_mini_pizza_flyers_02035", "title": "Mini folletos de pizza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 mini pizzas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 600g / 1lb 5oz", "pizca de sal", "300g / 10½oz de mantequilla, 100g / 3½oz enfriada y cortada en cubos, 200g / 7oz congelada", "Setas de castaña 300g / 10½oz, recortadas", "2 cucharadas de hojas de tomillo", "1 cucharada de aceite de girasol", "25 g / 1oz de mantequilla sin sal", "2 cebollas rojas, finamente cortadas", "2 cucharaditas de azúcar morena suave", "1 cucharada de vinagre de Jerez", "300 g / 10½ oz de carne de salchicha de buena calidad", "100 g / 3½ oz de pudin negro, cortado en piezas de 2cm / 1in", "1 huevo de gallinas camperas, batido, para esmaltar", "1 cucharada de semillas de sésamo"], "method": ["Para el atajo de hojaldre, mezcle la harina y la sal en un tazón. Frote la mantequilla fría con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Poco a poco agregue suficiente agua para formar una masa (alrededor de 4-6 cucharadas de agua).", "Ruede la masa en un rectángulo sobre una superficie de trabajo ligeramente enharinada.", "Rejilla gruesa la mantequilla congelada sobre los dos tercios inferiores de la masa. Dobla hacia abajo el tercio superior y dobla el tercio inferior como si doblaras una letra.", "Gire la masa doblada 90 grados en la superficie de trabajo y vuelva a extenderla en un rectángulo.", "Doble nuevamente en tres partes, envuelva la masa en una película adhesiva y déjela reposar en la nevera durante 30 minutos. Repita el proceso de balanceo, plegado y giro dos veces más, enfriándose entre cada vuelta. En total habrás hecho cuatro turnos. Descansa la masa en la nevera mientras haces el relleno.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, coloque los champiñones en un procesador de alimentos y sazone con sal y pimienta. Pulse hasta que los champiñones se descompongan hasta obtener una pasta áspera. Agrega el tomillo y dale a la mezcla un pulso final.", "Coloque la mezcla de champiñones en una sartén seca a fuego medio-alto y cocine, revolviendo a menudo, hasta que toda la humedad se haya evaporado de los champiñones. Retire de la sartén y deje enfriar.", "Mientras tanto, usando la misma sartén, caliente el aceite y la mantequilla a fuego medio-bajo. Agregue las cebollas y el azúcar y cocine lentamente hasta que las cebollas estén muy suaves y dulces. Esto llevará al menos 20 minutos. Una vez que esté caramelizado, agregue el vinagre de jerez.", "Para ensamblar, despliegue la masa en un rectángulo de 60x45cm / 24x18 pulgadas y córtela en 12 cuadrados.", "Divida la mezcla de champiñones en 12 porciones y extienda una porción en el centro de cada cuadrado de masa, dejando un espacio de 2 cm en la parte superior e inferior.", "En un tazón, mezcle la carne de salchicha con la morcilla y moldee en 12 formas de salchicha. Coloca encima de la pasta de champiñones y luego extiende las cebollas caramelizadas encima de cada salchicha.", "Haga dos pequeños cortes diagonales desde cada esquina de la masa, para eliminar un pequeño triángulo. A continuación, doble las \"alas\" superior e inferior sobre los extremos de la carne de salchicha. Corta un fleco de 1 cm / ½ pulg. Por los pasteles a cada lado del relleno. Traiga una tira sobre el relleno de un lado, luego una del otro y así sucesivamente, cruzando las tiras para formar un efecto trenzado. Meta los extremos de la masa debajo de la trenza, recortando cualquier exceso si es necesario.", "Repita con los cuadrados restantes de repostería hasta que tenga 12 mini trenzas de salchicha. Coloque las trenzas en una bandeja para hornear, cepille con huevo batido y espolvoree semillas de sésamo.", "Hornee durante 20 minutos, hasta que la masa esté dorada. Deje que se enfríe durante cinco minutos más o menos, luego sirva caliente o frío."], "url": "www_bbc_co_uk_food_recipes_mini_sausage_plaits_04508", "title": "Rollitos de morcilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12 trenzas de salchicha", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mini_sausage_plaits_04508_16x9.jpg", "isVegetarian": false, "recommendations": 0}]