[{"isVegetarian": true, "title": "Mango and lime fool", "url": "www_bbc_co_uk_food_recipes_mangoandlimefool_88796", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, skin and stone removed, chopped", "150ml/5¼fl oz double cream, lightly whipped", "1 tbsp honey, plus extra for drizzling", "½ lime, juice and zest only", "lime wedges and fresh mint sprigs, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a small bowl, mix together the chopped mango, whipped cream, honey, lime juice and zest and spoon into a serving glass. Garnish with an extra drizzle of honey, lime wedges and mint sprigs."]}, {"isVegetarian": true, "title": "Mango and lime tarte tatin with butterscotch sauce", "url": "www_bbc_co_uk_food_recipes_mangoandlimetartetat_85594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour, plus extra for flouring", "100g/3½oz unsalted butter, cut into cubes", "50g/2oz caster sugar", "50ml/2fl oz milk ", "50g/2oz caster sugar", "1 mango, peeled and roughly chopped", "1 lime, juice and zest", "50g/2oz caster sugar", "50g/2oz soft brown sugar", "100g/3½oz butter", "½ orange, juice only", "200ml/7fl oz double cream, plus extra, whipped, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the caster sugar and pulse again. Add the milk and pulse until the mixture comes together as a dough.", "Turn the dough out onto a floured surface and lightly knead. Roll the dough out to ½cm/¼in thick and cut out a circle to fit the size of a small ovenproof frying pan.", "For the filling, heat the sugar in the same ovenproof frying pan until melted, then add the mango pieces, lime juice and zest and cook until caramelised.", "Place the pastry over the filling mixture in the pan and press down around the edges.", "Transfer to the oven and bake for 8-10 minutes, or until golden-brown.", "For the butterscotch sauce, heat the sugars and butter in a small pan until the mixture is melted and well combined and turns a caramel colour. Add the orange juice and cream and stir until smooth.", "To serve, turn the tarte tatin out onto a plate and pour over the butterscotch sauce. Serve with a dollop of whipped cream."]}, {"isVegetarian": false, "title": "Mango and mangetout noodle salad", "url": "www_bbc_co_uk_food_recipes_mangoandmangetoutnoo_70351", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb cooked noodles (shop bought, cooked are fine otherwise use thin rice noodles)", "2 mangoes, very firm ", "175g/6oz mangetout, shredded lengthways", "6 spring onions, very finely sliced", "handful fresh coriander (stalks are fine here)", "handful fresh mint ", "2 limes, juice and zest", "2 tbsp clear honey", "2 tsp freshly grated ginger", "1 tbsp fish sauce or soy sauce (optional)", "6 tbsp sunflower oil", "1 tbsp toasted sesame oil", "3 tbsp toasted sesame seed", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the mangoes and then slice into fine strips. Tip into a bowl with the mangetout, spring onions and cooked noodles.", "Pour the lime juice and zest, honey, ginger and fish sauce (if using) into a blender, add the coriander and the mint and blend to form a smooth paste.", "Next slowly add the sunflower oil through the feeder, with the motor running, to form a smooth emulsion. Finally add the in the sesame oil.", "Toss the salad with the dressing and sprinkle with the sesame seeds just before serving."]}, {"isVegetarian": true, "title": "Mango chutney", "url": "www_bbc_co_uk_food_recipes_mangochutney_1319", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangochutney_1319_16x9.jpg", "ingredients": ["4 large mangoes, peeled, stoned and sliced", "salt", "4 cloves garlic, peeled and crushed", "450g/1lb caster sugar", "2 baking apples, peeled, cored and chopped", "1 tbsp English mustard powder", "1 tbsp grated fresh root ginger", "600ml/1 pint white wine vinegar", "1 tbsp cayenne pepper"], "serves": "Makes 2 x 250ml/9oz jars", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put the mango slices in a large bowl and sprinkle with salt. Leave overnight. In the morning, drain off the juice and rinse the fruit.", "Put the garlic, sugar, apples, mustard, ginger, vinegar and cayenne pepper in a pan and, over a low heat, dissolve the sugar. ", "Bring to the boil and add the mangoes. Simmer for 30 minutes until the chutney is thick and syrupy. Spoon into sterilised jars and seal."]}, {"isVegetarian": false, "title": "Mango 'egg' with toasted brioche", "url": "www_bbc_co_uk_food_recipes_mangoeggwithtoastedb_92671", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints bottled mineral water", "5g alginate or algin powder (available from specialist online retailers)", "100ml/3½fl oz whipping cream", "1 cinnamon stick", "4 cloves", "1 star anise", "3 medium free-range eggs, beaten ", "100g/3½oz soft brown sugar", "4 slices brioche, slices cut into discs using a 7cm/3in cookie cutter", "1 tbsp vegetable oil", "30g/1¼oz unsalted butter", "20g/¾oz icing sugar", "1g gluco powder, or similar edible calcium ions (available from specialist online retailers)", "150g/5oz mango purée (or 1 whole mango, peeled, stone removed, flesh chopped, blended to a smooth purée in a food processor with 30ml/1¼fl oz water)", "50ml/2fl oz Greek-style yoghurt", "crackle crystals, to serve (optional) (available from specialist online retailers)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the alginate bath, blend the bottled mineral water and algin powder in a food processor for 5-10 minutes, or until well combined. ", "Strain the mixture through a fine sieve, then pour the strained liquid into a large baking tray a least 5cm/2in deep. Chill in the fridge for 24 hours (this removes the air from the liquid).", "Meanwhile, for the brioche, bring the cream, cinnamon, cloves and star anise to the boil in a pan. Remove from the heat and set aside to cool. ", "When the cream mixture has cooled, discard the cinnamon, cloves and star anise. Whisk the cream into the beaten egg. Add the sugar and whisk again until well combined. Submerge the brioche discs into the egg mixture to soak, then chill, covered, in the fridge overnight.", "For the mango 'egg', add the gluco powder to the mango purée. Blend in a food processor until well combined, then transfer to a clean bowl. Cover and chill in the fridge overnight.", "Using a small spoon or teaspoon, scoop four small portions of the chilled mango purée from the mixture and roll into balls, using your hands, or two teaspoons. ", "When all of the mango balls have been prepared, remove the alginate bath from the fridge. Carefully lower the balls of mango purée into the alginate mixture, leave for 30 seconds, or until a skin forms on the outside of the balls, then remove from the liquid using a slotted spoon and transfer to a bowl of water (this will rinse any remaining alginate off the egg).", "Using an ice cream scoop or rounded dessert spoon, scoop four balls of Greek-style yoghurt. Carefully lower the balls into the alginate mixture. ", "Drain the 'yolks' from the water and return them to the alginate mixture, resting one on top of each ball of Greek-style yoghurt, in the centre to resemble a fried egg. Leave for 30 seconds, or until a skin forms on the 'egg'.", "Remove from the alginate mixture using a slotted spoon and transfer to a fresh bowl of clean water (this will rinse any remaining alginate off the egg).", "When ready to eat, heat the vegetable oil in a non-stick frying pan over a medium heat. Add the soaked brioche discs to the pan and fry for 2-3 minutes on each side, or until golden-brown on both sides. Add the butter and icing sugar to the pan and continue to cook the brioche until the butter has melted, the icing sugar has dissolved and the brioche discs are caramelised.", "To serve, paint a smear of mango purée across the centre of each of four serving plates. Place one brioche disc into the centre of each plate. Place a mango 'egg' on top of each brioche disc. Garnish with a sprinkling of crackle crystals, if using."]}, {"isVegetarian": true, "title": "Mango fool", "url": "www_bbc_co_uk_food_recipes_mangofool_76149", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": [" ½ mango, cut up", "2 tbsp caster sugar", "1 lime, zest and juice only, (keep separate) ", "300ml/10½fl oz double cream", "fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Purée  the mango in a blender with the caster sugar and lime juice.", "Whip the double cream with the lime zest.", "Take a tall glass and start by layering with the mango purée and  lime cream.  Repeat this process and finish with the mango purée on top.", "Garnish with the mint to serve."]}, {"isVegetarian": true, "title": "Mango fool with spun sugar", "url": "www_bbc_co_uk_food_recipes_mangofoolwithspunsug_84036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango,stone removed,  peeled and sliced", "50ml/2fl oz whipping cream", "100ml/4fl oz Greek yoghurt", "25g/1oz icing sugar", "sprig fresh mint", "125g/4½oz caster sugar", "cold water, to cover"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fool, line the bottom of a tall glass with half of the sliced mango. ", "Place the cream, yoghurt and icing sugar into a bowl and mix together well. ", "Spoon the cream mixture into the glass and top with the remaining mango.", "For the spun sugar, place the sugar and enough water to cover into a saucepan and place over a high heat. Leave until the sugar has dissolved and the liquid has turned a light caramel colour. Remove from the heat and place the saucepan into a frying pan containing cold water. ", "Using a fork, carefully pull out  sugar threads from the pan and shape around an oiled clean steel or other metal implement in a twisted pattern. ", "To serve, place the sugar threads on top of the pudding glass along with a sprig of mint."]}, {"isVegetarian": true, "title": "Mango hedgehog with chilli", "url": "www_bbc_co_uk_food_recipes_mangohedgehogwithchi_77885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, skin left on ", "½tsp chilli powder ", "25g/1oz icing sugar ", "5 tbsp Greek-style yoghurt ", "1 tbsp honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat grill to high.", "Cut the mango flesh in a crisscross pattern on top. Fold the mango inside out, pressing the skin inwards. This should look like a hedgehog. ", "Place the mango hedgehog onto an oven-proof sheet and sprinkle with the chilli and dust with the icing sugar.", "Place under the hot grill for four minutes until the mango is slightly golden.", "Mix the yoghurt and honey together.", "Transfer the hedgehog from the grill to a dish and serve with the honey yoghurt mix."]}, {"isVegetarian": true, "title": "Mango parfait with passion fruit and meringue stacks", "url": "www_bbc_co_uk_food_recipes_mangoparfaitwithpass_87048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range egg yolks", "75ml/3fl oz water", "200g/7oz caster sugar", "250g/9oz mango flesh, roughly chopped", "250ml/9fl oz double cream", "75ml/3fl oz free-range egg whites", "2 free-range egg whites", "50g/2oz caster sugar", "175ml/6fl oz double cream, lightly whipped", "3 passion fruit, flesh scooped out", "2 tbsp icing sugar", "½ mango, finely sliced"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the mango parfait, place the egg yolks, water and half the sugar into a saucepan and whisk to combine. Place over a low heat and cook gently, stirring occasionally, for about ten minutes, until the mixture thickens.", "Remove from the heat and pour into a mixing bowl. Whisk until the mixture cools and is light and fluffy.", "Meanwhile, place the mango flesh into a blender and blend until smooth. Pass through a sieve into a bowl.", "Add the cream to the mango mixture and whisk until the mixture forms soft peaks when the whisk is removed. Fold in the cooled egg yolk mixture.", "Place the egg whites into a bowl and whisk until soft peaks form when the whisk is removed. Gradually add the remaining caster sugar, continuing to whisk until stiff and glossy.", "Fold the egg white mixture into the cream mixture until well combined.", "Spoon the mixture into six individual pudding moulds lined with cling film. Place into the freezer for 1-2 hours until completely firm.", "Preheat the oven to 100C/200F/Gas ¾.", "For the meringue stack, place the egg whites into a bowl and whisk until soft peaks form when the whisk is removed.", "Gradually add the sugar and continue to whisk until stiff and glossy.", "Spoon the mixture into a piping bag fitted with a small plain nozzle. Draw 18 7.5cm/3in diameter circles onto baking parchment and place onto a baking sheet. Pipe the meringue in a spiral to fill each circle.", "Transfer to the oven and cook for 20 minutes, then turn the oven off but leave the meringues in there for at least two hours. When crisp, remove from the oven and allow to cool completely.", "Remove the parfait from the freezer five minutes before serving.", "To serve, place a meringue disc onto each of six serving plates. Spread a little whipped cream over them, then drizzle with the passion fruit flesh. Top with another meringue and the remaining cream and passion fruit, then finish with a third meringue.", "Turn the parfaits out onto the plates with the meringues. Dust the meringue stacks with icing sugar and top with a few mango slices."]}, {"isVegetarian": true, "title": "Mango lassi", "url": "www_bbc_co_uk_food_recipes_mangolassi_74038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz single cream", "200ml/7fl oz full fat milk", "400ml/14fl oz natural unsweetened yoghurt", "400ml/14fl oz mango pulp", "4 tsp caster sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the ingredients together and serve with ice. Easy!"]}, {"isVegetarian": true, "title": "Mango passion with honey and yoghurt", "url": "www_bbc_co_uk_food_recipes_mangopassionwithhone_67097", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangopassionwithhone_67097_16x9.jpg", "ingredients": ["200g/7oz carton Greek yoghurt", "1 tbsp clear honey", "1 small mango, peeled and cut into cubes", "2 passion fruit", "fresh mint, to garnish"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the honey and yoghurt in a small bowl. Using a teaspoon, scoop the seeds and flesh from the passion fruit into a bowl and mix with yoghurt mixture.  ", "Divide the mango and yoghurt mixture in half and place into two stemmed glasses. Chill for up to 8 hours. Serve at room temperature and garnish with fresh mint."]}, {"isVegetarian": true, "title": "Mango smoothie", "url": "www_bbc_co_uk_food_recipes_mangosmoothie_86438", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangosmoothie_86438_16x9.jpg", "ingredients": ["2 Indian Alphonso mangoes, in season from April (or use canned puréed mangoes)", "250–300ml/9–10½ fl oz cold milk ", "½–1 tsp runny honey, or to taste, according to the size and sweetness of the mangoes", "ice cubes, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Stand one of the mangoes upright with the narrow end facing you. Slice off the 'cheeks' on either side of the stone and slice these in half lengthwise. ", "Cut around the stone to take off as much flesh as possible, capturing all the running juices in a bowl. ", "Remove the skin by peeling or cutting the fruit carefully off it. Repeat with the other mango. Discard the skin and purée the flesh and juice in a food processor or blender.", "Add the milk and honey and combine until it becomes a thick smooth mass. Chill until ready to drink. Add the ice cubes and serve straight from the fridge. A little goes a long way, so serve in small glasses."]}, {"isVegetarian": true, "title": "Mango smoothie", "url": "www_bbc_co_uk_food_recipes_mangosmoothie_92192", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 ripe mango", "1 ripe banana", "3 heaped tbsp Greek-style yoghurt", "300ml/10½fl oz milk ", "ice cubes (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients in a food processor until smooth and well combined. ", "To serve, pour into two tall glasses."]}, {"isVegetarian": true, "title": "Mango tarte tatin", "url": "www_bbc_co_uk_food_recipes_mangotartetatin_87711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour, plus extra for dusting", "2 tbsp caster sugar", "55g/2oz butter", "1 free-range egg yolk", "30g/1oz butter", "1 tbsp brown sugar", "½ mango, peeled and sliced", "½ lime, juice only", "double cream, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour, sugar and butter into a food processor. Pulse until the mixture resembles breadcrumbs.", "Add the egg yolk and pulse until the mixture comes together as a dough.", "Turn the dough out onto a lightly floured surface and roll out to make a round slightly larger than a small ovenproof frying pan.", "For the filling, heat the butter in a small ovenproof frying pan. Add the brown sugar and mango slices and fry until the mango is just starting to caramelise. Squeeze in the lime juice and remove from the heat.", "Place the pastry over the mango in the pan and push down around the edges to seal in the filling.", "Transfer the pan to the oven and bake for 12-15 minutes, or until the pastry is golden-brown and crisp.", "Carefully turn the tart out onto a plate so that the mango is on top and slice into wedges. Serve with double cream."]}, {"isVegetarian": true, "title": "Mango with chilli", "url": "www_bbc_co_uk_food_recipes_mangowithchilli_85020", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango ", "½ chilli, finely chopped ", "½ tsp mixed spice", "1 tbsp runny honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Criss-cross the mango flesh, then turn the mango half inside out to make a 'hedgehog' shape.", "Sprinkle over the chopped chilli, mixed spice and honey.", "Place the mango onto a baking sheet then place under the grill for 2-3 minutes.", "To serve, place the mango onto a plate."]}, {"isVegetarian": true, "title": "Mango with lime", "url": "www_bbc_co_uk_food_recipes_mangowithlime_76371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ mango, peeled and sliced", "icing sugar, to dust", "½ lime, juiced and zested", "double cream, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mango in a bowl and dust heavily with icing sugar. ", "Add the lime juice and zest to the bowl and mix. Set aside and allow to marinate for up to ten minutes. ", "Meanwhile, whip the cream in a clean bowl to thicken.", "Transfer the mango to a serving dish and spoon the whipped cream on top to serve"]}, {"isVegetarian": false, "title": "Mangsho fita shinni (beef curry)", "url": "www_bbc_co_uk_food_recipes_mangsho_fita_shinni_36848", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangsho_fita_shinni_36848_16x9.jpg", "ingredients": ["5 tbsp vegetable oil", "1 large cinnamon stick", "5 cardamom pods", "3 bay leaves", "5cm/2in piece fresh root ginger, finely chopped", "5 garlic cloves, crushed", "1 large onion, chopped", "1 tsp ground turmeric", "1 tsp chilli powder", "1 tsp ground cumin", "2 tsp curry powder", "500g/1lb 2oz beef, boneless, cubed", "3 chillies, sliced lengthways (remove seeds if you want less heat)", "handful fresh coriander", "salt", "250g/9oz rice flour, plus extra for dusting", "pinch salt", "2 tsp paprika", "2 tsp garlic powder", "1 tsp chilli flakes", "300g/10½oz okra, halved lengthwise", "4 tbsp vegetable oil, for frying"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry, heat the oil in a large pan. Add the cinnamon, cardamom and bay leaves and cook for 1 minute. Add the ginger, garlic, onion and cook for 10 minutes. Add the ground spices and cook for 1 minute, taking care not to burn them. Add the beef and cook over a medium-high heat for 30 minutes.", "Add 200ml/7fl oz water, season with salt. Cook over a medium heat for 30 minutes. Remove from the heat and add the chillies and coriander (reserve some coriander for garnish).", "Meanwhile, for the fita, bring 750ml/26fl oz water to the boil in a large pan with a little salt. Remove from the heat and add the rice flour. Leave for 10 minutes, covered, to cook the rice out. Remove the dough while still hot and roll out onto a surface dusted with rice flour. Cut out into small rounds. ", "Heat a flat pan over a medium heat. Cook the fita for about 1 minute on each side, until they are cooked through but have not coloured.", "For the okra, work the paprika, garlic powder, chilli flakes and ½ teaspoon salt into the okra. Heat the vegetable oil in a large frying pan over a high heat. Briefly fry the okra – it should keep its colour and have a soft bite to it.", "To serve, spoon out the beef curry and serve with the fita and the okra. Garnish with the coriander."]}, {"isVegetarian": true, "title": "Manhattan", "url": "www_bbc_co_uk_food_recipes_manhattan_87544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz bourbon ", "25ml/1fl oz sweet red vermouth ", "2 dashes Angostura bitters ", "1 tsp syrup from a jar of maraschino cherries ", "twist orange zest, to garnish ", "maraschino cherry, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bourbon, vermouth, bitters and syrup into a mixing glass filled with ice and stir well.", "Strain into a cocktail glass and garnish with an orange twist and a maraschino cherry."]}, {"isVegetarian": true, "title": "Vegetable chilli with peanut butter cabbage and sadza", "url": "www_bbc_co_uk_food_recipes_manyatis_vegetable_35397", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "1 small onion, chopped", "2 carrots, diced", "½ red pepper, seeds removed and chopped", "½ yellow pepper, seeds removed and chopped", "½ green pepper, seeds removed and chopped", "100g/3½oz green beans, chopped", "2 tomatoes, chopped", "3–4 chillies, seeds removed and flesh chopped", "salt and freshly ground black pepper", "375g/13oz white cornmeal (mealie meal)", "½ small cabbage (or any seasonally vegetable), shredded", "1 small onion, chopped", "1 tomato, chopped", "4 tbsp peanut butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli, heat the oil in a large pan and gently fry the onion until soft but not brown. ", "Add the carrots, peppers and green beans, fry briefly then add the tomatoes, and chillies and simmer the stew until the vegetables are tender. Season to taste with salt and freshly ground black pepper.", "For the sadza, mix 225g/8oz of the cornmeal with 250ml/9fl oz of water. ", "Bring 750ml/1¼ pints of water to the boil in a pan, then turn down the heat and add the cornmeal mixture, stirring all the time. Cook for five minutes, then gradually add the remaining cornmeal. Transfer to a bowl or plate and flatten into a round shape with a wooden spoon.", "For the peanut butter cabbage, pour about 125ml/4fl oz of water into a pan and bring to the boil. Add the cabbage and cook until slightly softened but still crunchy.", "Add the onion and tomato then stir in the peanut butter, adding more water if the mixture seems too thick. Season with salt and freshly ground black pepper. Serve with the sadza and vegetable chilli."]}, {"isVegetarian": false, "title": "Summery maple-glazed gammon with fresh apricot and ginger chutney", "url": "www_bbc_co_uk_food_recipes_maple-glazed_gammon_with_52545", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.8-2kg/4-4lb 8oz gammon, boned", "2 bay leaves", "1 onion, halved ", "6 peppercorns", "3 tbsp maple syrup", "1 tsp English mustard powder", "3 tbsp light muscovado sugar", "2 tbsp olive oil", "2 onions, finely chopped", "1 garlic clove, crushed", "400g/14oz ready-to-eat dried apricots, diced", "2 crisp eating apples, peeled, cored and diced", "100g/3½oz light muscovado sugar", "200ml/7fl oz cider vinegar", "5 tbsp grated root ginger", "2 red chillies, finely chopped", "2 oranges, zest and juice", "8 tbsp maple syrup"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3 (140C fan).", "Place the gammon in a deep saucepan that it just fits, add the bay leaves, onion and peppercorns. Add enough water to cover the gammon, then bring to the boil and cover with a lid. Transfer to the preheated oven and cook for about two hours, or until tender. ", "Increase the oven temperature to 220C/425F/Gas 7 (200C fan).", "When the ham is cooked, remove it from the pan, and, using a sharp knife cut off the skin, leaving a layer of fat underneath. Place the gammon in a small roasting tin. ", "Mix the glaze ingredients together and pour over the layer of fat. Score the fat into diamond shapes and roast for about 20-25 minutes, or until golden-brown, basting halfway through the cooking time.", "While the gammon is cooking you can make the chutney.  Heat the oil in a medium sized pan and fry the onions over a low heat until really tender and transparent but not browned. Add all the remaining ingredients, bring to the boil, then simmer for about 10 minutes, or until the apricots have softened and everything is soft and pulpy.", " Serve the chutney hot or cold.  If cold, spoon into sterilised jars, label and seal the top."]}, {"isVegetarian": false, "title": "Maple and balsamic glazed lamb chops with couscous", "url": "www_bbc_co_uk_food_recipes_maple_and_balsamic_26200", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_and_balsamic_26200_16x9.jpg", "ingredients": ["large handful fresh thyme sprigs, leaves picked", "salt and pepper", "8 lamb chops or cutlets", "vegetable oil", "1 bunch spring onions, trimmed and sliced", "50g/2oz flaked almonds", "handful fresh mint", "1 pomegranate, seeds only", "300g/10½oz couscous", "200g/7oz feta ", "drizzle of extra virgin olive oil", "25g/1oz butter", "2 tbsp maple syrup", "1 tbsp balsamic vinegar", "Salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the thyme leaves over a large plate with a little salt and pepper, then squish the lamb chops or cutlets into the mix, turning them over to coat the both sides. This will give a lovely crust when cooked. ", "Place a large frying pan on a medium heat with a good glug of oil. Fry the lamb chops for about 3-4 minutes on the first side or until they are golden brown.  Flip the lamb over and leave to cook for a further 3-4 minutes depending how you like them cooked. ", "Meanwhile, tip the couscous into a medium bowl, pour boiling water from a kettle to cover a little over the top, cover with cling film and leave aside for about five minutes. ", "For the glaze, put the butter, maple syrup and balsamic vinegar into a small saucepan over a high heat. Bring to the boil and then reduce to simmer, leaving it to bubble away for about three minutes, stirring from time to time. When the glaze is thickened and syrupy (a little thinner than golden syrup) remove from the heat and keep warm. ", "Check the couscous grains have absorbed all the water and are tender and then fluff it up with a fork. Crumble the feta cheese in, season with salt and pepper and add a good drizzle of extra virgin olive oil. Stir together and re-cover to keep warm.", "Cut into the centre of one of the lamb chops or cutlets to check that they are cooked to your liking. When ready, remove them onto a plate to rest for a few minutes, covered with tin foil (this will make the chops more tender and juicy). ", "Add the spring onions and flaked almonds to the frying pan in which you cooked the lamb and fry on a medium heat for 1-2 minutes, stirring them a bit every now and then. Remove from the heat when the spring onions are wilted and the almonds golden brown.", "Divide the couscous among four serving plates. Place two lamb chops on top of each plate and drizzle the glaze (and any resting juices) over. Scatter over the onion and almond mixture and tear over the mint leaves. Top with the pomegranate seeds and serve. "]}, {"isVegetarian": false, "title": "Maple bacon lollies", "url": "www_bbc_co_uk_food_recipes_maple_bacon_lollies_81721", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_bacon_lollies_81721_16x9.jpg", "ingredients": ["vegetable oil, for greasing", "1–2 rashers of unsmoked streaky bacon", "10g pecans, toasted and chopped", "150g/5½oz caster sugar", "25g/1oz golden syrup", "2 tbsp maple syrup", "4 lolly sticks"], "serves": "Makes 4-6 lollies", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat your grill to high.", "Place a sheet of baking parchment on a board, then draw four 6.5cm/2½in circles on it, spaced apart. Turn the paper over so that the pencil is on the other side but you can see it through the paper. Brush each circle area with vegetable oil.", "Snip the rind off the bacon rashers, then grill until crisp and golden-brown. Let them cool then snip them into little pieces. ", "Divide the cooled bacon among the circles, along with the pecan nuts. Position the lollipop sticks near the circle, too.", "Put the sugar and 75ml/2½fl oz of water into a small heavy-based pan and heat gently to dissolve the sugar. Add the golden syrup and maple syrup. Turn up the heat slightly and use a sugar thermometer to watch the temperature carefully until it reaches 150C/300F (the ‘hard crack’ stage). (CAUTION: boiling sugar can be extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.)", "Meanwhile, fill the sink with 10cm/4in cold water.", "When the sugar and syrup mixture reaches 150C/300F take it off the heat and dip the base of the pan in the sink of cold water to stop it cooking any further. Cool for a minute or two, then carefully place a spoonful of the syrup into each circle over the bacon/pecans. The syrup will run, but will thicken slightly on cooling. Press in the sticks, then continue to spoon the syrup into the circle on top of the first spoonful of syrup. ", "Allow to set for about 30 minutes then carefully lift off the parchment.", "Surprise your friends with this delicious combination of flavours. "]}, {"isVegetarian": false, "title": "Maple-glazed turkey with a sweetcorn stuffing", "url": "www_bbc_co_uk_food_recipes_maple_glazed_turkey_with_15074", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "1 red onion, finely chopped", "2 garlic cloves, crushed", "1 green pepper, finely chopped", "2 tbsp dry sherry", "½ glass dry white wine", "salt and pepper", "225g/8oz sausage meat", "1 x 280g/10oz tin sweetcorn", "2 tbsp chopped parsley", "1 x 5.4kg/12lb turkey", "175g/6oz melted butter", "2 tbsp maple syrup", "1 tbsp lemon juice", "salt and pepper", "½ onion, chopped", "1 glass dry white wine", "300ml/½ pint chicken stock", "potato flour, to thicken (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the stuffing, heat a little oil in a large frying pan. Add the onion, garlic and green pepper. Gently fry for two minutes without colouring. Pour in the sherry and white wine. Bring to the boil and cook until the volume of liquid has reduced by two-thirds. Remove from the heat and set aside to cool. Season to taste with salt and pepper.", "When the onion mixture is cool, mix in the sausage meat, sweetcorn and parsley. Set aside.", "For the glazed turkey, remove the wishbone from the turkey. Turn the turkey on its side and crush to break the back bone. ", "Push the stuffing into the neck cavity and reshape the turkey into its original shape. Secure the open cavity with string or a skewer.", "Preheat the oven to 220C/425F/Gas 7.", "Place the turkey on one side in a roasting tray and baste with melted butter. Roast in the oven for 30 minutes.", "Turn the turkey onto the other side and baste with the juices in the roasting tray.", "Reduce the oven temperature to 180C/350F/Gas 4 and cook for a further 30 minutes. ", "Turn the turkey on to its back, so the breasts are pointing upwards. ", "For the glaze, slowly heat the maple syrup and lemon juice. Brush the turkey breasts with the glaze and the juices from the roasting tin. Return to the oven for about four hours.", "Check the turkey is cooked by piercing a leg – if the juices run clear it’s ready. Remove from the roasting tray and set aside, covered in a warm place, to rest for 15 minutes before carving.", "For the gravy, place the roasting tray over a medium heat and add the chopped onion. Cook for 3-4 minutes, or until soft and golden-brown.", "Strain off any excess fat, return the onions to the roasting tin (if removed during straining) and add the white wine and chicken stock. Bring to the boil, season with salt and pepper, and add a little potato flour to thicken (if desired). Strain and pour into a jug. Serve the turkey in slices with the gravy."]}, {"isVegetarian": true, "title": "Maple, pecan and cranberry granola", "url": "www_bbc_co_uk_food_recipes_maple_pecan_and_40192", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maple_pecan_and_40192_16x9.jpg", "ingredients": ["125ml/4fl oz maple syrup", "25g/1oz caster sugar", "25ml/1fl oz sunflower oil", "½ tsp vanilla extract", "500g/1lb 2oz jumbo rolled oats ", "175g/6oz mixed seeds (like pumpkin, sunflower, sesame or linseeds)", "150g/5oz pecans (or walnuts)", "50g/2oz whole almonds", "25g/1oz flaked almonds", "75g/2¾oz desiccated coconut ", "pinch of salt (optional)", "2 tsp cinnamon (optional)", "150g/5½oz dried cranberries"], "serves": "Makes 1.3kg/3lb of granola", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line two large roasting trays with parchment paper and set aside.", "Put the maple syrup, sugar, oil and vanilla extract into a large bowl and mix well. Then toss in the oats, mixed seeds, pecans (or walnuts), whole almonds, flaked almonds, coconut and salt and cinnamon (if using). Give it a good stir and then get your hands in, picking it up and  letting it fall down to coat and moisten everything really well. ", "Pour the mixture onto the roasting trays and spread it out evenly. Bake in the oven for about 15 minutes, giving it a good stir and swapping them about on their shelves half way through. ", "The granola should be golden-brown when cooked. Remove and leave to cool completely before stirring the cranberries through. Store in an airtight container for up to a month."]}, {"isVegetarian": false, "title": "Maple pulled pork with BBQ-style beans, chilli cornbread and an apple and pecan slaw", "url": "www_bbc_co_uk_food_recipes_maple_pulled_pork_with_23642", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 tbsp ground cumin", "1 tbsp ground coriander", "1 tsp ground cinnamon", "1 tsp smoked paprika", "1 tbsp tomato purée", "50ml/2fl oz cider vinegar", "50g/1¾oz soft brown sugar", "400g/14oz tinned chopped tomatoes", "150ml/5fl oz maple syrup", "1kg/2lb 4oz belly pork", "1 tbsp salt", "1 tbsp freshly ground black pepper", "4 tbsp butter", "200g/7oz cornmeal", "65g/2¼oz plain flour", "1½ tsp baking powder", "1 tsp salt", "35g/1oz caster sugar", "1 red chilli, finely chopped", "1 bunch spring onions, finely chopped", "3 medium free-range eggs, beaten", "160g/5½oz whole milk", "1 tbsp vegetable oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 red chilli, finely chopped", "400g/14oz tinned chopped tomatoes", "2 tbsp tomato ketchup", "2 tbsp barbecue sauce", "1 tsp English mustard powder", "300g/10½oz tinned kidney beans, drained", "300g/10½oz tinned black beans, drained", "300g/10½oz tinned haricot beans, drained", "450g/1lb sweet potatoes, skin on, cut into 2cm/¾in slices", "2 tbsp olive oil", "4 Granny Smith apples, cored and thinly sliced", "4 white chicory, leaves separated", "120g/4¼oz pecan nuts", "200ml/7fl oz crème fraîche", "1 lemon, juice only", "50ml/2fl oz olive oil", "4 sprigs fresh coriander"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Meanwhile heat a large frying pan and add the oil. Once hot, fry the onion for 3-4 minutes. ", "Add the garlic, cumin, coriander, cinnamon, smoked paprika and tomato purée and cook for three minutes.", "Add the vinegar, sugar, tomatoes, maple syrup and 250ml/9fl oz water, and cook for 20-30 minutes.", "Score the pork with a sharp knife and rub with salt and pepper. Heat a griddle pan and fry on the skin side for 4-5 minutes.", "Place the scored pork in a deep roasting tin and add the maple syrup mixture.  Set aside while you make the cornbread", "To make the chilli cornbread, place the butter in a small saucepan and melt. Pour it in a 20cm/8in square cake tin.", "Pour the cornmeal, flour, baking powder and salt in a large mixing bowl and add the sugar, chilli and spring onions and stir.", "In a separate bowl, whisk together the eggs and milk. ", "Gradually add the wet ingredients to the dry and mix with a wooden spoon.", "Pour the mixture into the prepared cake tin and bake for 20 minutes. When the cornbread is golden brown and springy to the touch, remove and leave to cool. ", "At the same time, place the glazed pork belly in the hot oven for 30 minutes, then reduce the oven temperature to 150C/300F/Gas 3 and cook for 3½ hours.", "For the beans, place a saucepan on on a medium heat and add the oil. Once hot, add the onion and fry for three minutes.", "Add the garlic and red chilli and cook for a further three minutes, stirring frequently so the garlic does not burn.", "Add the chopped tomatoes, ketchup, barbecue sauce, mustard and drained beans. Bring to the boil, reduce the heat and cook for 40 minutes.", "For the sweet potatoes, heat a griddle pan, add the sliced sweet potatoes to the pan and cook either side for 4-5 minutes to get char-marks. Place in the oven for 20-30 minutes, or until tender.", "For the apple and pecan slaw, place the apples, chicory and pecans into a large bowl. Whisk the crème fraîche, lemon juice and oil in a separate bowl. Set aside.", "Remove the pork from the oven and leave until cool enough to handle. Pour off the sauce into a saucepan, place on the heat and cook until the volume of liquid has reduced by half. ", "Remove all the fat from the pork and pull it into pieces.", "Just before serving, add the dressing to the apple and pecan slaw and mix well. Serve the pork with the cornbread, beans, slaw and sauce. Top each serving of pork with a sprig of coriander."]}]