[{"ingredients": ["½ botella de vino tinto", "1 ramita de canela", "Anís de 2 estrellas", "2 dientes", "1 naranja, en rodajas", "1 limón, en rodajas", "50g / 1¾oz de azúcar moreno"], "method": ["Coloque todos los ingredientes en una cacerola y cocine a fuego lento durante 6-8 minutos, sin hervir. Alternativamente, coloque los ingredientes en su olla de cocción lenta y cocine a fuego lento hasta que estén calientes (1-2 horas, dependiendo de su olla de cocción lenta).", "Para servir, vierta el vino caliente en copas a prueba de calor."], "url": "www_bbc_co_uk_food_recipes_mulledwine_84959", "title": "Vino caliente con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_84959_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ botella de vino tinto", "1 naranja, jugo y ralladura", "250g / 9oz de fruta seca mixta", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de especias mixtas", "1 cucharada de harina de maíz", "25 ml / 1 fl oz de agua", "100 g / 3½ oz de azúcar en polvo", "Castañas asadas 150g / 5½oz", "½ limón, solo jugo"], "method": ["Para la compota, coloque el vino, jugo de naranja y ralladura, fruta seca, azúcar y especias en una sartén y cocine durante seis minutos.", "Coloque la harina de maíz y el agua en un recipiente aparte y mezcle los ingredientes hasta que la mezcla esté suave.", "Agregue la mezcla de harina de maíz a la compota y revuelva hasta que la textura de la salsa se espese.", "Para las castañas caramelizadas, caliente el azúcar en una sartén a fuego lento, hasta que el azúcar se derrita para crear un caramelo suave. Agregue las castañas al caramelo y mezcle bien para cubrirlas. Luego vierta el jugo de limón y mezcle bien. Luego vierta la mezcla en una bandeja para hornear antiadherente engrasada.", "Para servir, coloca la compota en un tazón limpio. Espolvoree algunas de las castañas encima de la compota."], "url": "www_bbc_co_uk_food_recipes_mulledwinefruitcompo_84808", "title": "Compota de fruta del vino caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 naranja, solo piel, médula blanca eliminada", "1 limón, solo piel, médula blanca eliminada", "1 cucharada de jengibre rallado", "1 ramita de canela", "2 dientes", "100ml / 3½fl oz de vodka de vainilla", "6 cápsulas de cardamomo", "200ml / 7fl oz puerto", "750ml / 1pint 7fl oz de vino tinto", "150g / 5¼ oz de azúcar", "Gelatina en hoja de 25 g / 1 oz, ablandada en agua fría, escurrida", "12 cucharadas de frutas congeladas de verano, descongeladas", "400 g / 14 oz de crema fresca", "Crema doble de 550 ml / 1 pinta, batida hasta que se formen picos suaves cuando se quita la batidora", "1 cucharadita de extracto de vainilla", "puñado de almendras en copos, tostadas, para decorar"], "method": ["Caliente a fuego lento la naranja y la ralladura de limón, jengibre, canela, clavo de olor, vodka de vainilla, vainas de cardamomo, vino tinto y azúcar, hasta que esté caliente, pero no hirviendo. Cuele la mezcla a través de un tamiz sobre la gelatina ablandada en un tazón grande y revuelva bien.", "Con una cuchara, coloca la fruta suave en un tazón grande de vidrio y vierte suficiente mezcla de gelatina para llenarla un tercio del camino hacia arriba. Enfríe en la nevera durante la noche, o hasta que se hayan fraguado por completo.", "Mezcle la mitad de la crema batida con la crema pastelera y la vainilla en un recipiente hasta que estén bien combinados y vierta esta mezcla en la gelatina.", "Para servir, vierta la crema batida restante sobre la bagatela y esparza sobre las almendras en copos."], "url": "www_bbc_co_uk_food_recipes_mulledwinetrifle_93108", "title": "Bocadillo de vino caliente", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwinetrifle_93108_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "1 cebolla grande, finamente picada", "2 dientes de ajo picados", "2 zanahorias medianas, cortadas en cubos de 1.5cm / ⅝in", "2 palitos de apio, en rodajas finas", "1 camote mediano, pelado, cortado en cubos de 1.5cm / ⅝in", "1 manzana comiendo, pelada, descuartizada, cortada en cubos de 1.5cm / ⅝in", "1 cucharada de polvo de curry medio", "1 cubo de vegetales o caldo de pollo (baja en sal es lo mejor)", "1litre / 1¾ pintas de agua hirviendo", "1 cucharada de puré de tomate", "1 cucharada de chutney de mango", "100g / 3½oz de arroz basmati", "100 g / 3½ oz de yogur natural o crema agria, para servir", "cilantro fresco o perejil de hoja plana, para adornar (opcional)", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla con el aceite en una cacerola grande y mezcle la cebolla, el ajo, la zanahoria, el apio y la batata. Cocine a fuego medio durante 10 minutos, revolviendo regularmente hasta que las verduras comiencen a ablandarse y dorar ligeramente. Agregue los trozos de manzana y espolvoree sobre el polvo de curry. Cocine por otros 2 minutos más, revolviendo mientras se cocina.", "Desmenuce el cubo en una jarra de medir y vierta sobre el agua hirviendo. Mezcle para combinar. Viértalo en la sartén y agregue el puré de tomate y el chutney de mango. Llevar a ebullición, luego reducir el fuego ligeramente y dejar hervir a fuego lento durante 30 minutos, revolviendo ocasionalmente. Cocine hasta que las verduras estén tiernas.", "Mientras la sopa hierve a fuego lento, llene a medias un sartén mediano con agua y deje que hierva. Agregue el arroz y vuelva a hervir. Cocine por 10 minutos o hasta que el arroz esté tierno. Escurra el arroz en un colador y enjuague con agua corriente hasta que esté frío.", "Cuando la sopa esté lista, refresque la sopa durante unos minutos y mezcle con una batidora o en un procesador de alimentos hasta que esté suave antes de remover el arroz enfriado. Si quieres una textura más rústica para la sopa, no la combines.", "Agregue suficiente agua para darle una buena consistencia, (alrededor de 150-200 ml / 5½-7fl oz). Caliente la sopa durante 3-4 minutos hasta que esté caliente y revise el condimento, agregue sal y pimienta negra recién molida al gusto.", "Sirva la sopa en tazones hondos y cubra cada uno con una cucharada de yogur natural o crema agria. Adorne con ramitas de cilantro o perejil plano si lo desea."], "url": "www_bbc_co_uk_food_recipes_mulligatawny_soup_68949", "title": "Sopa mulligatawny", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulligatawny_soup_68949_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "½ pimiento rojo, picado", "1 cucharada de curry en polvo", "1 cucharadita de cúrcuma", "1 cubo de caldo de pollo (los vegetarianos pueden sustituirlo por un cubo de caldo de verduras).", "400ml / 14fl oz de agua", "puñado de piña, picado", "Crema doble 75ml / 3fl oz"], "method": ["Caliente el aceite en una cacerola y agregue la cebolla y la pimienta. Freír suavemente a fuego medio durante tres minutos, para suavizar.", "Agregue el curry en polvo y la cúrcuma y cocine por un minuto más.", "Mezcle en el cubo común y agregue el agua y la piña. Llevar a ebullición y luego reducir el fuego y hervir a fuego lento durante diez minutos.", "Agregue la crema doble y cocine a fuego lento durante 2-3 minutos para espesar la sopa.", "Vierta la sopa en un recipiente y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mulligatawnysoup_83986", "title": "Sopa de pimiento y piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina integral 230g / 8oz", "Sémola de 115 g / 4 oz", "¾ cucharadita de sal fina (flor de sal de oro ahumada Guérande si está disponible)", "55 g / 2 oz de semillas de sésamo", "55 g / 2 oz de semillas de lino", "55g / 2oz semillas de calabaza - aproximadamente molidas", "1 cucharada de miel líquida", "3½ cucharadas de aceite vegetal, más extra para engrasar", "semillas molidas o especias de su elección (opcional)"], "method": ["En un tazón grande, mezcle la harina integral, la sémola y la sal junto con el sésamo, el lino y las semillas molidas de calabaza.", "En un recipiente aparte, bata 210ml / 7¼fl oz de agua con la miel y el aceite. Agregue los ingredientes secos y mezcle con una masa medianamente firme.", "Amasa la masa durante cinco minutos. Vuelve al tazón, cúbrelo y déjalo a un lado durante 20 minutos.", "Precalentar el horno a 180 ° C / 375 ° F / Gas 4. Línea 2-3 bandejas para hornear con pergamino antiadherente.", "Engrase la superficie de trabajo y ruede la masa hasta un grosor de 3 mm.", "Usando una regla y un cuchillo afilado o un cortador de pizza, corte la masa en rectángulos o diamantes, de aproximadamente 5x15cm / 2x6 pulgadas. Coloque las bandejas preparadas juntas, pero sin tocar.", "Rocíe las galletas con agua. En este punto, puede agregar un relleno si lo desea (más semillas molidas o especias). Puede volver a colocar los restos sobrantes, pero no serán tan exitosos como amasando primero. Alternativamente, ponga los restos en una bandeja y hornearlos para comer.", "Hornea las galletas por 15-18 minutos. Apague el horno, abra la puerta por 30 segundos y vuelva a cerrar. Deje las bandejas en el calor residual del horno durante 10-15 minutos para obtener una textura crujiente adicional. Transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_multi-seed_savoury_03806", "title": "Galletas sabrosas de semillas múltiples", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 48", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seed_savoury_03806_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de harina sin trigo (una mezcla de harina de papa, harina de arroz, harina de tapioca y goma de xantano)", "1 cucharadita de sal", "2 cucharadas de azúcar en polvo", "2 cucharaditas de levadura de acción rápida", "310ml / 10fl oz de leche entera", "1 cucharadita de vinagre de sidra", "6 cucharadas de aceite vegetal, más extra para engrasar", "2 huevos de gallinas camperas, más 1 huevo de gallinas camperas para lavar huevos", "4 cucharadas de semillas mezcladas, como semillas de calabaza, sésamo y girasol, más extra para el acabado"], "method": ["Engrase y forre una lata de hogaza de 900g / 2lb.", "Coloque la harina en un mezclador de alimentos independiente fijado con el accesorio batidor de globo.", "Agregue la sal, el azúcar y la levadura en tres pilas separadas.", "Mezcle la leche, el vinagre, el aceite y dos huevos en una jarra.", "Vierta el líquido en el recipiente para mezclar y agregue las semillas.", "Encienda la batidora y bata los ingredientes durante aproximadamente 3-4 minutos.", "Coloque la mezcla en la lata preparada, cúbrala con película adhesiva untada con aceite y déjela durante aproximadamente una hora, o hasta que duplique su tamaño.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Hornee durante aproximadamente 35-45 minutos. Cubra con papel de aluminio después de diez minutos.", "Aproximadamente diez minutos antes del final del tiempo de cocción, cepille la barra con huevo batido (huevo batido) y espolvoree sobre las semillas.", "Retirar del horno, dejar enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_multi-seeded_wheat-free_24145", "title": "Pan sin semillas de trigo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seeded_wheat-free_24145_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400ml / 14fl oz de leche entera", "1 cebolla pequeña, espesamente cortada", "2 hojas de laurel", "Filetes de pescado blanco de 500 g / 1 lb 2 oz, preferentemente bacalao, eglefino o abadejo, desollados", "40 g / 1½ oz de mantequilla", "Harina normal de 40 g / 1½ oz", "150g / 5½oz de guisantes congelados", "200g / 7oz grandes gambas crudas, peladas", "sal marina y pimienta negra recién molida", "800 g / 1 libra de papas medianas de 12 oz, peladas y cortadas en cuartos", "40 g / 1½ oz de mantequilla, en cubos", "3 cucharadas de leche", "Queso Cheddar maduro de 100 g / 3½ oz, rallado"], "method": ["Para hacer el relleno, vierta la leche en un recipiente con tapa grande y agregue la cebolla en rodajas y las hojas de laurel. Sazone con sal y pimienta negro.", "Coloque los filetes de pescado en la sartén y cocine a fuego lento, tape y cocine por dos minutos.", "Retire la sartén del fuego y deje reposar e infunda durante 20 minutos. Escurra el pescado a través de un colador en un recipiente, luego vierta la leche en una jarra.", "Mientras tanto, prepara el puré para el relleno. Mitad llene una olla grande con agua fría. Agregue las papas y deje hervir. Reduzca el fuego y cocine a fuego lento durante 15 minutos o hasta que las papas estén suaves.", "Escurra las papas y devuélvalas a la sartén. Mash con la mantequilla, la leche y tres cuartas partes del queso rallado. Sazone al gusto con sal y pimienta negra.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para terminar el llenado, derrita la mantequilla en una cacerola mediana y agregue la harina. Cocine por unos segundos, luego agregue gradualmente la leche infundida, revuelva constantemente, y cocine a fuego lento a fuego medio durante 3-4 minutos hasta que la salsa esté suave y espesa. Agregue los guisantes y sazone con sal y pimienta negra.", "Extienda un tercio de la salsa en la base de un plato a prueba de horno de 1,5 litros / 2 ¼. Esparce la mitad de los filetes de pescado sobre la salsa, partiéndola en trozos gruesos a medida que avanzas y descartando la cebolla y las hojas de laurel.", "Coloque la mitad de las gambas sobre el pescado y vierta otro tercio de la salsa. Repita esto con los pescados y gambas restantes y termine con el tercio final de la salsa en la parte superior.", "Vierta el puré sobre la mezcla de pescado, extendiéndose hasta los bordes con una espátula. Bifurque la superficie y espolvoree sobre el queso restante. Coloque el plato en una bandeja de horno y hornee en el centro del horno durante unos 25 minutos o hasta que la parte superior esté dorada y el relleno burbujee."], "url": "www_bbc_co_uk_food_recipes_mums_everyday_fish_pie_43141", "title": "Pastel de pescado diario de mamá con puré de queso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mums_everyday_fish_pie_43141_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2½ cucharadas de aceite de colza", "1 cucharadita de semillas de comino", "2 cucharaditas de semillas de sésamo", "Jengibre 200 g / 7 oz, en rodajas finas", "1 guindilla verde, hendidura abierta", "sal al gusto", "1 cucharadita de chile rojo en polvo", "Azúcar de palma 100g / 3½oz", "100g / 3½oz de pasta de tamarindo", "pellizcar asafoetida", "1 chile rojo seco", "½ cucharadita de semillas de mostaza", "5-6 hojas de curry", "4 pechugas de pollo, con la piel puesta", "Pechuga de pollo 300 g / 10½ oz, picada", "1 cebolleta, picada", "2 cucharadas de jengibre, finamente picado", "pizca sal masala", "sal al gusto", "1 litro / 1¾ pintas de caldo de pollo", "aceite vegetal, para freír", "2 cucharadas de aceite de colza", "1 cucharadita de semillas de comino", "50g / 1¾oz de jengibre, finamente picado", "1 guindilla verde, hendidura abierta", "2 cebollas medianas, finamente picadas", "1 cucharadita de chile rojo en polvo", "2 cucharaditas de cilantro molido", "1 cucharadita de cúrcuma molida", "2 tomates medianos, picados", "jengibre fresco, en juliana y crujiente frito", "Berro de apio", "Berro shiso rojo"], "method": ["Para la salsa picante, caliente dos cucharadas de aceite en una sartén, fría las semillas de comino durante 1-2 minutos y luego agregue las semillas de sésamo, el jengibre y el chile verde y sazone con un poco de sal.", "Revuelva durante 2-3 minutos y luego cubra la mezcla con un círculo de papel resistente a la grasa y deje que se cocine lentamente durante 40-45 minutos hasta que el jengibre esté casi cocinado.", "Deje que la mezcla se enfríe, luego transfiérala a un procesador de alimentos y mezcle hasta formar una pasta fina con la pasta de tamarindo y el azúcar de palma.", "Caliente el aceite restante en una sartén por separado, agregue la asafétida, el chile rojo y las semillas de mostaza. A medida que estallen las semillas de mostaza, agregue las hojas de curry, revuelva por 30 segundos y luego viértalo en la mezcla de chutney de jengibre y mezcle bien. Dejar de lado.", "Mientras tanto, prepara el pollo. Coloque cada pechuga de pollo en un pedazo grande de papel de aluminio y aplánelos con un mazo de carne.", "Mezcle la pechuga de pollo picada con la cebolla tierna, el jengibre, el garam masala y un poco de sal y divídala en cuatro porciones.", "Coloque una porción de carne picada sobre la pechuga de pollo aplastada y enrolle en un rollo con la lámina. Aprieta los extremos de la lámina girando cada extremo.", "Deje que el caldo de pollo hierva a fuego lento en una cacerola y cocine los rollitos durante 25-30 minutos o hasta que el pollo esté completamente cocido. Retire los rollos de la acción y deje enfriar.", "Calentar un poco de aceite en una sartén. Retire la lámina de los rollos de pollo y dóblese por todos lados hasta que estén ligeramente coloreados y crujientes.", "Mientras el pollo está cazando furtivamente, prepare la salsa. Calentar el aceite en una sartén, freír suavemente las semillas de comino y el jengibre y luego agregar el chile verde y las cebollas picadas.", "Freír hasta que las cebollas estén caramelizadas hasta que estén doradas, luego agregue el chile en polvo, el cilantro y la cúrcuma. Cocine por 2-3 minutos y luego sazone con sal y agregue los tomates picados.", "Cuando los tomates se hayan ablandado, coloque la mezcla en un procesador de alimentos y mezcle hasta obtener una pasta fina, humedecida con un poco de caldo si es necesario. Guarde la salsa a un lado y manténgala caliente.", "Para servir, corte cada rollo de pollo en tres pedazos iguales. Coloque la salsa y la salsa picante en el plato y coloque tres pedazos de pastel sobre la salsa. Adorne con el jengibre frito y las hojas de berro."], "url": "www_bbc_co_uk_food_recipes_murg_adraki_57546", "title": "Murg Adraki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 2 oz de azúcar en polvo", "120ml / 4fl oz de agua hirviendo", "500ml / 18fl oz de yogur natural de buena calidad", "½ limón, solo jugo, colado", "150g / 5½oz de azúcar moreno oscuro, más 1 cucharada para rociar", "Harina normal de 120 g / 4½ oz, tamizada", "50g / 2oz de mantequilla salada, suavizada", "Avellanas de 100 g / 4 oz, conchas eliminadas, tostadas", "1 huevo grande de gallinas camperas", "½ cucharadita de polvo de hornear", "Crema agria de 150 g / 5½ oz", "1 cucharada de avellanas, conchas eliminadas, tostadas, finamente picadas"], "method": ["Para el sorbete de yogur, coloque el azúcar y el agua hirviendo en una olla pequeña y vuelva a hervir, revolviendo para disolver el azúcar. Una vez disuelto, hierva por unos segundos, luego retírelo del fuego y déjelo enfriar.", "Cuando el jarabe de azúcar esté frío, viértalo en un tazón con el yogur y el jugo de limón. Pruebe y agregue un poco más de jugo de limón si es necesario. Agite en una máquina para hacer helados de acuerdo con las instrucciones del fabricante durante aproximadamente 15 minutos, o hasta que estén en su lugar, luego transfiéralos a un recipiente y congélelos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para la tarta, coloque el azúcar (excepto una cucharada para rociar), la harina, la mantequilla y las nueces en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado grueso. Retire la mitad de la mezcla del procesador de alimentos y extiéndala sobre el fondo de una lata antiadherente redonda de 20 cm / 8 pulgadas que tenga una profundidad de 5 cm / 2 pulgadas (sin fondo suelto). Bate la mezcla suavemente con la parte posterior de una cuchara como lo harías con la base de una tarta de queso, sin presionar demasiado.", "Incline la otra mitad de la mezcla en un recipiente. Agriete el huevo, agregue el polvo de hornear y la crema agria y bata para hacer un batido suave. Vierta esta mezcla sobre la base de miga. Espolvorea sobre la cucharada reservada de azúcar mascabado. Transfiera al horno y hornee durante aproximadamente 25 minutos, o hasta que esté firme. Para verificar si está hecho, inserte un pincho en el centro, debe salir limpio. Permita que la tarta alcance la temperatura ambiente antes de servir.", "Para servir, corte la tarta en trozos y espolvoree sobre las avellanas picadas. Sirva con una cucharada del sorbete de yogur."], "url": "www_bbc_co_uk_food_recipes_muscovadoandhazelnut_86417", "title": "Tarta de moscovato y avellana con sorbete de yogur", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "sal y pimienta", "1 diente de ajo, aplastado", "200g / 7oz de tomates enlatados", "1 cucharada de vinagre de vino blanco", "25g / 1oz de mantequilla", "2 cebollas, finamente cortadas", "4 setas grandes y planas, con tallo recortado para que no llegue al borde del hongo", "1 cucharada de aceite de oliva", "1 bola de mozzarella", "4 bollos de hamburguesa, cortados por la mitad"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el gusto, caliente una sartén pequeña a fuego medio y agregue el aceite de oliva. Freír la cebolla y una pizca de sal en el aceite durante 4-5 minutos, o hasta que la cebolla esté suave. Agregue el ajo y cocine durante dos minutos, luego agregue los tomates y el vinagre. Hervir a fuego lento durante cinco minutos, o hasta que la mezcla se espese hasta obtener una consistencia deliciosa. Pruebe y ajuste el condimento según sea necesario. Deja enfriar.", "Para las cebollas, caliente una sartén a fuego medio y derrita la mantequilla en la sartén. Agregue la cebolla en rodajas y una pizca de sal. Baje el fuego y deje las cebollas, revolviendo de vez en cuando, para cocinar durante 25-30 minutos, o hasta que estén doradas y completamente colapsadas.", "Para el resto de la hamburguesa, coloque los champiñones con el tallo hacia arriba en una bandeja de horno, rocíe con el aceite y sazone con sal y pimienta. Hornee en el horno por 10 minutos, o hasta que comience a ablandarse. Mientras tanto, corta la bola de mozzarella en cuatro rebanadas iguales. Después de que los champiñones se hayan cocinado durante 10 minutos, retírelos del horno y coloque una rebanada de mozzarella en cada uno de los hongos en la parte superior del tallo. Vuelva a poner en el horno durante 5-7 minutos para derretir la mozzarella.", "Para ensamblar, tueste ligeramente el lado cortado de los panecillos de hamburguesas. Extiéndalo con un poco de condimento y luego coloque los champiñones encima del panecillo de hamburguesa inferior. Divida las cebollas entre las hamburguesas y agregue cualquier condimento restante en la parte superior. Finaliza emparedando cada hamburguesa con las mitades restantes."], "url": "www_bbc_co_uk_food_recipes_mushroom_and_mozzarella_44092", "title": "Hamburguesa de hongos y mozzarella con gusto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_mozzarella_44092_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva o colza", "750g / 1lb 10oz de champiñones mezclados (preferiblemente portobello, castañas y setas), cortados en trozos", "3 dientes de ajo, en rodajas", "tomillo pequeño racimo, hojas recogidas", "2 cebollas rojas, en rodajas", "2 zanahorias, finamente picadas", "Colinabo de 250 g / 9 oz, finamente picado", "200 ml / 7 fl oz de vino blanco o caldo de verduras", "1 cucharada de salsa Worcestershire vegetariana", "1 cucharada de mostaza Dijon", "2 cucharadas de mostaza integral", "perejil de flatleaf fresco de manojo pequeño, toscamente picado", "2-4 cucharadas de crème fraiche (opcional)", "3 chirivías pequeñas, ralladas", "sal marina y pimienta negra recién molida"], "method": ["Coloque una sartén grande a prueba de horno a fuego alto y agregue un buen chorro de aceite. Agregue suficientes hongos para cubrir la base de la sartén, sazone con sal y pimienta, saltee hasta que esté bien dorado y comience a crujir en los bordes. Transfiera a un recipiente y fríe los champiñones restantes en tandas.", "Vuelva a poner la sartén en el fuego y agregue otro glug de aceite. Agregue el ajo, el tomillo, la cebolla, la zanahoria y el colinabo, sazone con una buena pizca de sal y pimienta y cocine a fuego medio durante 10 minutos, hasta que se suavice y comience a dorarse.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Agregue los champiñones y el vino o caldo, y cocine a fuego lento hasta que casi todo el líquido se haya evaporado. Agregue la salsa Worcestershire, las mostazas, el perejil y la crema fresca, si está usando, y cocine suavemente por unos minutos más, hasta que tenga una salsa rica. Pruebe y agregue más sal y pimienta si es necesario.", "Sazonar los parnsips con sal y pimienta y apilar sobre la mezcla de champiñones, dejando un pequeño espacio alrededor del borde. Rocíe generosamente con aceite y hornee durante 40 minutos, hasta que estén dorados y crujientes.", "Sirve con algunos verdes alegres."], "url": "www_bbc_co_uk_food_recipes_mushroom_and_parsnip_91300", "title": "Seta y pastinaca rösti pie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_parsnip_91300_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de sal", "1 huevo de gallinas camperas", "2 cucharadas de crema agria", "15g / ½ oz de champiñones secos", "40 g / 1½ oz de mantequilla", "1 cebolla pequeña, finamente picada", "Setas de campo de 150 g / 5½ oz, muy finamente picadas", "1 diente de ajo, finamente picado", "Chucrut 200g / 7oz (peso escurrido)", "1 cucharada de perejil finamente picado", "1 cucharada de eneldo finamente picado", "sal y pimienta negra recién molida", "migas de pan", "cebollino picado"], "method": ["Para hacer la masa, tamiza la harina y la sal en un tazón grande. Haz un bien en el medio. Batir ligeramente el huevo con la crema agria y 2 cucharadas de agua y verter en el pozo.", "Con un tenedor, comience a trabajar la harina en los ingredientes húmedos, hasta que tenga una masa áspera y harinosa. Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar hasta que la masa esté suave. No debe ser pegajoso; si lo es, agregue un poco más de harina. Cubra la masa con film transparente y déjelo durante 1 hora.", "Mientras tanto, haz el relleno. Cubra los champiñones secos con agua caliente y déjelos en remojo durante 10 minutos.", "Derrita la mitad de la mantequilla en una sartén grande y agrega la mitad de la cebolla, los champiñones y el ajo. Freír por unos minutos hasta que la mezcla esté bastante seca. Enjuague el chucrut en agua fría y escúrralo bien. Picar finamente y agregar a la sartén.", "Escurra los champiñones secos, reservando su líquido de remojo. Picar finamente y agregar a la sartén. Cuele el líquido reservado en la sartén. Agregue 200 ml / 7 fl oz de agua. Deje que se cocine a fuego lento, revolviendo regularmente, hasta que toda la mezcla esté bastante seca y el chucrut se haya ablandado, esto demorará unos 20 minutos. Agregue el perejil y el eneldo y et al lado. Deja enfriar.", "Ruede la masa a un grosor de 1-2 mm. Use un cortador para cortar rondas de 7cm / 2¾in de diámetro. Junta los restos de la masa para formar los círculos restantes.", "Ponga una cucharada de la mezcla de hongos y chucrut en el centro de cada ronda. Luego junte los bordes para formar una forma de media luna. Engarce o pliegue con los dedos o use un tenedor para sellar.", "Para cocinar, ponga a hervir una olla grande de agua con sal. Cocine los pierogi, en tandas, durante aproximadamente 5 minutos. Están listos cuando flotan hacia la cima. Escurrir y poner papel de cocina.", "Para el relleno, caliente la mantequilla restante en una sartén grande y cocine la cebolla restante hasta que esté suave, agregue las migas de pan y mezcle. Freír hasta que las migas estén crujientes.", "Cubra los pierogi con la cebolla pan rallado y cebollines picados y servir."], "url": "www_bbc_co_uk_food_recipes_mushroom_and_sauerkraut_52289", "title": "Pierogi de setas y chucrut", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace aproximadamente 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "racimo de cebollas en rodajas finas", "2 dientes de ajo, finamente picados", "10 botones o champiñones castaños, en rodajas finas", "200 g / 7 oz de espinaca fresca, lavada", "1 tarrina de crema de 200ml7fl oz", "sal y pimienta negra recién molida", "Tallarines secos 300g / 10½oz"], "method": ["Caliente el aceite en una sartén y fríe con cuidado las cebollas y el ajo durante unos minutos, o hasta que estén doradas. Agregue las setas y fría a fuego alto durante 8-10 minutos, o hasta que el agua se haya evaporado. Incline la espinaca en la sartén y revuelva regularmente a medida que se marchita. Continúe cocinando a fuego medio hasta que la mayor parte del agua se haya evaporado.", "Retire la sartén del fuego y agregue la crema fresca. Regrese la sartén al fuego, deje que hierva y cocine a fuego lento durante unos minutos o hasta que la salsa se espese. Sazone al gusto con sal y pimienta recién molida.", "Mientras tanto, cocine la pasta en una olla grande de agua hirviendo con sal, de acuerdo con las instrucciones del paquete. Una vez cocido, escurra la pasta y mezcle con la salsa de champiñones y espinacas. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mushroom_and_spinach_09065", "title": "Tagliatelle de setas y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_and_spinach_09065_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva", "2 dientes de ajo, 1 pelado, 1 finamente picado", "1 chile rojo pequeño, finamente picado", "400 g / 14 oz de champiñones mixtos, picados", "1 cucharada de perejil fresco de flatleaf picado", "1 cucharada de hojas frescas de mejorana", "sal y pimienta negra recién molida", "8 rebanadas de pan Pugliese (o masa fermentada)"], "method": ["Calienta seis cucharadas de aceite de oliva en una sartén, freír el ajo picado y el chile por un minuto, luego agrega los champiñones y freír durante 2-3 minutos más, o hasta que estén cocidos.", "Agregue el perejil y la mejorana y sazone con sal y pimienta negra recién molida.", "Mientras tanto, tuesta las rebanadas de pan en ambos lados. Frote cada pedazo de pan ligeramente con el diente de ajo entero y cepille con el aceite de oliva restante, luego corte en porciones individuales si es necesario. Cuchara sobre los champiñones y servir."], "url": "www_bbc_co_uk_food_recipes_mushroom_crostini_99270", "title": "Crostini de setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_crostini_99270_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva, más extra para la repostería", "3 dientes de ajo, finamente picados", "1.2kg / 2lb 7oz de champiñones silvestres, setas más grandes picadas", "3 cucharadas de perejil picado grueso", "1 guindilla pequeña, finamente picada (opcional)", "8 rectángulos pasta de filo ready-made, sobre 20x20cm / 8x8in", "pequeño manojo de cebollín fresco"], "method": ["Precalentar el horno a 220C / 450F / Gas 8.", "Calentar el aceite en una sartén, agregar el ajo y los champiñones y freír a fuego alto durante 3-4 minutos, o hasta que esté cocido. Sazonar con sal y pimienta negra recién molida y espolvorear sobre el perejil. Dejar de lado para enfriar.", "Cepille un lado de cada hoja de masa de filo con un poco de aceite de oliva.", "Coloque una hoja de hojaldre sobre otra para crear dos capas de masa, luego coloque una cuarta parte de la mezcla de hongos en el centro de la masa.", "Reúna las esquinas de la masa para crear un paquete y asegúrelo con un par de cebolletas. Cepíllese todo con aceite de oliva y colóquelo en una bandeja para hornear.", "Repite el proceso con la masa restante de filo y la mezcla de champiñones.", "Hornee los paquetes durante 10-12 minutos, o hasta que la masa esté cocida y dorada."], "url": "www_bbc_co_uk_food_recipes_mushroom_purses_97982", "title": "Bolsos de hongos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_purses_97982_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Hojaldre de mantequilla de 500g / 1lb 2oz", "pizca de cayena, pimentón o escamas de chile, opcional", "2 chalotes, finamente picados", "450 g / 1 libra de champiñones castaños, finamente picados", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "hojas de estragón pequeñas, picadas", "salpicaduras de Madeira", "Crema doble de 200 ml / 7 fl oz", "puñado de setas girolle, picadas", "botón de mantequilla", "apretón de jugo de limón", "cebollino pequeño, picado, para adornar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Ruede los pasteles en un rectángulo grande, de aproximadamente 2 mm de grosor. Debe ser lo suficientemente grande como para que después de hornear pueda usar un cortador de galletas para hacer 12 círculos de aproximadamente 7.5cm de diámetro.", "Coloque en una bandeja para hornear y pinche con un tenedor (es posible que deba dividir la masa entre dos bandejas para hornear). Espolvoree con cayena, pimentón o hojuelas de chile, si se usa, y coloque otra bandeja para hornear encima para evitar que la masa se hinche demasiado mientras se hornea.", "Hornee durante 20 minutos, o hasta que estén crujientes y doradas. Retire la bandeja superior y déjela a un lado para que se enfríe.", "Para el relleno, freír los chalotes y champiñones en mantequilla. Sazone con sal, pimienta y el estragón, seguido de un glug de Madeira y la crema. Déjalo burbujear hasta que se reduzca en volumen en aproximadamente un tercio. Transfiera a un procesador de alimentos o licuadora y mezcle hasta obtener una consistencia de mousse. Coloque una cuchara en una manga pastelera equipada con una boquilla normal de tamaño mediano.", "Para la guarnición, freír los girolles en una sartén por separado con un poco de mantequilla durante 2-3 minutos hasta que se ablanden. Termine con un chorrito de jugo de limón.", "Para ensamblar, corte doce círculos de masa con un cortador de galletas. Los círculos deben tener alrededor de 7.5 cm / 3 pulgadas de ancho. Pipe una buena cantidad de la mousse de champiñones cuidadosamente en un círculo de repostería. Cubra con otro círculo de masa y otra capa de mousse. Termine con un círculo final de masa y decore con girolles y cebollino. Repita hasta que haya agotado todos los círculos de repostería."], "url": "www_bbc_co_uk_food_recipes_mushroom_mille_feuille_39761", "title": "Mushroom millefeuille", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_mille_feuille_39761_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla grande, finamente picada", "1 pimiento verde, finamente picado", "1 puerro mediano, finamente picado", "1-2 dientes de ajo, aplastados", "Botón de 300 g / 10½ oz o champiñones castaños rallados o finamente picados", "2 cucharadas de harina normal", "450ml / 16fl oz de caldo de verduras", "450ml / 16fl de leche en oz", "1 cucharada de perejil finamente picado", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Derrita la mantequilla en una sartén a fuego lento y sude suavemente la cebolla, el pimiento verde, el puerro y el ajo hasta que empiecen a ablandarse.", "Aumente el fuego y agregue los champiñones a la sartén, revuelva hasta que estén bien combinados. Continúe freír hasta que los champiñones estén cocidos. Agregue la harina y cocine por un minuto. Retire la sartén del fuego y agregue la sartén un poco a la vez, revolviendo bien entre cada adición.", "Una vez que se hayan agregado todas las existencias, devuelva la sartén al fuego, hierva, reduzca el fuego y cocine a fuego lento durante unos minutos. Vierta la leche y cocine a fuego lento. Agregue el perejil picado y sazone al gusto con sal y pimienta negra recién molida.", "Vierte la sopa en tazones y sírvela con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_mushroom_soup_03841", "title": "Sopa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroom_soup_03841_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20g / ¾oz de hongos secos o porcini secos", "10 g / oz de mantequilla", "2 chalotes o 1 puerro, finamente picado", "1 diente de ajo, en rodajas", "500g / 1lb 2oz de champiñones frescos, una mezcla de Portobello, castaña, botón y setas, en la combinación que desee", "700 ml / 1¼ pinta de pollo o verdura", "1 tomillo de ramita grande", "25 ml / 1 fl oz de jerez o marsala o jugo de ½ limón", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco finamente picado, para servir"], "method": ["Mide 150ml / 5fl oz de agua recién hervida y viértela sobre los hongos secos en un tazón. Déjalo en remojo durante 10 minutos.", "Calentar la mantequilla en una cacerola de base pesada. Pica finamente los chalotes o el puerro, y agrega a la cacerola. Cubra y deje cocer a fuego lento durante 5 minutos.", "Agregue el ajo y las setas frescas a la sartén. Suba el fuego y cocine por unos minutos hasta que los champiñones estén brillantes.", "Cuele los hongos en remojo, reservando el licor. Pique finamente los champiñones remojados y agregue a la sartén. Vierta el licor reservado y el caldo, luego agregue el tomillo. Condimentar con sal y pimienta.", "Llevar a ebullición, luego cocine a fuego lento durante 5 minutos. Agregue el jerez, marsala o jugo de limón. Retire la ramita de tomillo, luego enfríe ligeramente y mezcle cuidadosamente la sopa con una batidora manual. Debe ser un hermoso color marrón rico. Servir inmediatamente cubierto con una pizca de perejil picado."], "url": "www_bbc_co_uk_food_recipes_mushroom_soup_72353", "title": "Sopa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 chalotes, toscamente picados", "2 dientes de ajo, finamente picados", "400g / 14oz diferentes hongos diferentes, más o menos picados", "4 ramitas de tomillo fresco", "150ml / 5fl oz de crema doble", "1 cebolla roja, finamente rebanada", "150 g / 5½ oz varios hongos diferentes, más o menos picados", "1 cucharada de perejil fresco finamente picado", "1 cucharada de estragón fresco picado", "¼ pan de masa fermentada, desgarrado en pedazos", "1 diente de ajo, finamente picado", "4 cucharadas de aceite de oliva", "100 g / 3½ oz de queso parmesano (u otro queso duro vegetariano), rallado, para servir", "½ trufa, recién afeitada (opcional), para servir"], "method": ["Para hacer la sopa, caliente el aceite en una sartén a fuego medio. Agregue los chalotes, ajo, champiñones y tomillo y cocine de 2 a 3 minutos. Agregue 500ml / 18fl oz de agua,", "llevar a ebullición y cocinar por otros 3 minutos. Agregue la crema y blitz en una licuadora hasta que quede suave.", "Para hacer el relleno, caliente el aceite en una sartén a fuego medio. Agregue la cebolla y los champiñones y cocine durante 2 minutos. Agregue las hierbas y mezcle para combinar.", "Para hacer el pan, caliente el aceite en una sartén a fuego medio. Agregue el pan y el ajo y cocine hasta que estén crujientes. Retirar de la sartén y dejar escurrir sobre papel de cocina.", "Para servir, vierta la sopa en tazones para servir y cubra con la guarnición y el pan de ajo. Adorne con el parmesano y las virutas de trufa."], "url": "www_bbc_co_uk_food_recipes_mushroom_soup_with_19428", "title": "Sopa de champiñones con pan de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]