[{"isVegetarian": false, "title": "Cómo hacer chili con carne", "url": "www_bbc_co_uk_food_recipes_beef_chilli_con_carne_92275", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_con_carne_92275_16x9.jpg", "ingredients": ["1 cebolla roja grande, finamente picada", "2 cucharadas de aceite de oliva", "1 zanahoria, cuarteada longitudinalmente y picada", "2 dientes de ajo, aplastados", "1 cucharadita de chile en polvo", "¾ cucharadita de pimentón dulce ahumado", "½ cucharadita de orégano seco", "Picadillo de ternera de calidad superior de 500 g / 1 lb 2 oz", "2 cucharadas de puré de tomate", "1 x 400 g / 14 oz de frijoles de lata, drenados y enjuagados", "1 pimiento rojo o verde, sin semillas y picado", "1 x 400g / 14oz de tomates picados de mejor calidad", "500-750ml / 18-22fl oz de caldo de carne", "sal marina y pimienta negra", "2 cuadrados de chocolate negro al 70% rallado", "cilantro de racimo pequeño, picado", "arroz cocido", "cilantro fresco, toscamente picado", "crema agria"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una cazuela grande o una sartén de fondo grueso a fuego medio. Agregue un glug de aceite y una vez caliente agregue la cebolla. Cocine por un minuto y agregue las zanahorias. Cocine durante 5-7 minutos, o hasta que las cebollas estén blandas y translúcidas. Agregue el ajo y cocine durante 2-3 minutos más.", "Agregue las especias y el orégano y cocínelos durante dos minutos o hasta que estén aromáticos. Agregue la carne de res, rompiéndola mientras se fríe en trozos pequeños. Cocine por 3-4 minutos, o hasta que se dore por todos lados y rómpalo en pedazos pequeños. Agregue el puré de tomate y cocine durante dos minutos.", "Agregue los frijoles y la pimienta picada, revuelva sobre el fuego durante 3-4 minutos para ablandar un poco la pimienta, luego agregue los tomates y suficiente caldo de carne a un poco más que cubrir la carne. Revuelva todo alrededor, raspando el fondo de la sartén con una cuchara de madera para despegar cualquier trozo del fondo, y sazone con sal y pimienta.", "Lleve a fuego lento a fuego lento, reduzca el fuego a fuego lento y cocine por 1½-2 horas, o hasta que espese y rico. Si en algún momento el nivel del líquido parece bajo, agregue un poco de agua caliente o cualquier cantidad restante.", "Antes de servir, agregue los cuadrados de chocolate rallado y revuelva a través de la carne caliente de chili con carne para que se derrita. Pruebe y sazone con sal y pimienta según sea necesario.", "Sirva con arroz y adornar el chile con cilantro y crema agria."]}, {"isVegetarian": false, "title": "Carne bourguignon", "url": "www_bbc_co_uk_food_recipes_beef_bourguignon_09721", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de harina normal", "sal y pimienta negra recién molida", "1 kg / 2lb 4 oz de hoja de ternera, cortada en cubos grandes", "2 cucharadas de aceite de oliva", "150 g / 5½ oz de panceta, cortada en pequeños trozos", "2 chalotes, finamente picados", "1 diente de ajo, aplastado", "50ml / 2fl oz de brandy", "500ml / 18fl oz de vino tinto de Borgoña u otro vino tinto", "250ml / 9fl oz de caldo de carne", "1 bouquet garni compuesto por 2 hojas de laurel, 2 ramitas de tomillo, 2 ramitas de flatleaf de perejil", "25g / 1oz de mantequilla", "Chalotes pelados del bebé 150g / 5½oz (o cebollas de botón congeladas)", "Setas de castaña 200g / 7oz", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "110g / 4oz de mantequilla", "110ml / 4fl oz de leche entera", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "100g / 3½oz de cebollas pequeñas perladas, peladas (o cebollas de botón congeladas)", "100 g / 3½ oz de tocino, cortado en lardons", "150g / 5½ oz champiñones, tallos eliminados dejaron todo", "½ manojo de perejil, finamente picado"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para la carne de bourguignon, espolvoree la harina en un plato y sazone con sal y pimienta negra recién molida. Dragar la carne con la harina sazonada y reservarla.", "Caliente una cucharada de aceite en una sartén grande con tapa y fríe la panceta durante 1-2 minutos o hasta que se dore. Agregue la carne y fría por otros 4-5 minutos, o hasta que se dore por cada lado. Agregue los chalotes y el ajo y fría por 4-5 minutos, o hasta que se ablanden.", "Agregue el brandy e incline lentamente la sartén hacia la llama de gas, o enciéndala con una cerilla. Deje que las llamas se enciendan y luego se apaguen. (Precaución: mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Agregue el vino tinto y el caldo de carne y cocine a fuego lento. Agregue el bouquet garni, luego cubra y cocine a fuego lento durante dos horas, o hasta que la carne esté tierna y la salsa se haya espesado.", "Caliente la mantequilla y el aceite restante en una sartén y fríe los chalotes o las cebollas durante 4 a 5 minutos, o hasta que estén doradas.", "Agregue las cebollas doradas y los champiñones castaños a la mezcla de carne y cocine por otros 20 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el puré, cocine las papas en una sartén con agua salada hirviendo durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y regrese a la sartén, luego coloque sobre el fuego durante un minuto para eliminar el exceso de humedad.", "Aplaste bien las papas, luego agregue la mantequilla y la leche y bata con una cuchara de madera hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la guarnición, caliente el aceite de oliva y la mantequilla en una sartén pequeña. Agregue las cebollas y fría hasta que estén doradas. Agregue la panceta y fría hasta que esté dorado y crujiente. Incline los champiñones y continúe freír hasta que los champiñones estén suaves y dorados. Termine con el perejil picado y déjelo a un lado hasta que esté listo para servir.", "Para servir, divida el puré por partes iguales entre los platos y sirva la carne del bourguignon al costado, con la guarnición en la parte superior."]}, {"isVegetarian": false, "title": "Chili de ternera salteado con arroz con yogur", "url": "www_bbc_co_uk_food_recipes_beef_chilli_flash_fry_04956", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_flash_fry_04956_16x9.jpg", "ingredients": ["1½ cucharadita de cilantro molido", "1½ cucharadita de comino molido", "¼ cucharadita de cúrcuma molida", "½ cucharadita de jugo de lima", "Filete de solomillo de 200g-250g / 7-9oz, finamente cortado en tiras de 0.25cm", "3 cucharadas de aceite de girasol o colza", "Jengibre fresco de la raíz 15-20g / ½oz-¾oz, rallado", "15-20 g / ½oz-¾oz de ajo, finamente picado", "1 cebolla, finamente rebanada", "½ pimiento verde, tallo y semillas retirados, finamente rebanados", "½ pimiento rojo, tallo y semillas removidos, finamente rebanados", "3-4 cebollas de primavera, cortadas, finamente cortadas", "Tomates de ciruela 55g / 2oz, sin semillas, carne cortada en tiras finas", "1-2 chiles verdes, tallo eliminado, en rodajas", "1 cucharadita de chile en polvo, o al gusto", "sal al gusto", "2 cucharadas de cilantro fresco picado", "2-3 cucharadas de aceite de girasol", "1 cucharadita de semillas de mostaza", "½ cucharadita de semillas de comino", "15-20 hojas frescas de curry, ralladas", "pinza grande asafoetida (hing)", "2 chiles verdes, tallos eliminados, finamente picados", "1 cucharadita de jengibre fresco de raíz finamente picado", "1 tomate pequeño, piel y semillas retiradas, cortadas en cubitos", "½ cucharadita de jugo de lima", "500g / 1lb 2 oz de yogur griego bajo en grasa", "1 cucharadita de hojas de cilantro fresco picado", "400g-500g / 14oz-1lb 2oz de arroz basmati, cocido según las instrucciones del paquete con 1 cucharadita de sal, enfriado a temperatura ambiente", "2 cucharaditas de sal, o al gusto"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para sofreír el chile de ternera en un bol, mezcle todas las especias molidas hasta que estén bien combinadas. Agregue el jugo de lima para formar una pasta suave. Agregue la carne y mezcle hasta que esté completamente cubierto en el adobo. Cubra el tazón con película adhesiva y enfríe la carne en la nevera durante al menos una hora.", "Para el yogur de arroz, caliente el aceite en un wok con tapa a fuego alto. Cuando el aceite esté humeando, agregue las semillas de mostaza, luego cubra inmediatamente el wok con la tapa y reduzca ligeramente el calor. (Precaución: las semillas de mostaza saldrán y pueden saltar de la sartén; manténgala a una distancia segura).", "Una vez que las semillas de mostaza hayan saltado, retire la tapa, agregue las semillas de comino y las hojas de curry, y saltee por unos segundos, hasta que las semillas de comino se oscurezcan. Agregue la asafétida, los chiles y el jengibre, y saltee durante 1-2 minutos más. Agregue los tomates y el jugo de lima y sofría por 2-3 minutos más, o hasta que los tomates comiencen a descomponerse.", "Retire el wok del fuego, deje que el contenido de la sartén se enfríe un poco, luego mezcle el yogur, el cilantro y el arroz cocido. Sazonar, al gusto, con sal. Dejar de lado.", "Para el chile de ternera frito, cuando la carne esté marinada, caliente la mitad del aceite en un wok a fuego alto. Cuando el aceite esté humeando, agregue las piezas de carne marinada. Sofreír ligeramente durante 3-4 minutos, hasta que se dore uniformemente (no agite demasiado el wok). Retire los trozos de carne del wok y déjelos a un lado en un plato.", "Regrese el wok al fuego y agregue el aceite restante. Agregue el jengibre y el ajo y saltee durante 1-2 minutos. Agregue las cebollas y continúe revolviendo hasta que se ablanden.", "Agregue los pimientos, las cebolletas, los tomates y los chiles al wok y espolvoree el chile en polvo. Continúe revolviendo hasta que las verduras se ablanden y comiencen a colorear. Rocíe los jugos de la carne reservada. Sazonar, al gusto, con sal.", "Cuando casi todos los jugos de carne se hayan evaporado del wok, devuelva la carne reservada al wok y revuelve durante un minuto para recalentar. Retire el wok del fuego y revuelva a través del cilantro fresco.", "Para servir, divida el yogur en partes iguales entre los platos y sirva sobre la carne picada de chile."]}, {"isVegetarian": false, "title": "Chili de res con chocolate amargo", "url": "www_bbc_co_uk_food_recipes_beef_chilli_with_bitter_27455", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_chilli_with_bitter_27455_16x9.jpg", "ingredients": ["4 cucharadas de aceite vegetal", "Filete de ternera de buena calidad de 500 g / 1 lb 2 oz, finamente cortado en cubitos", "500 g / 1lb 2 oz de carne picada de buena calidad", "1 cebolla blanca, pelada, finamente picada", "1 cebolla roja, pelada, finamente picada", "2 palitos de apio, cortados, picados", "1 chili chipotle seco", "1 cucharada de hojuelas de chile seco", "½ cucharada de chile en polvo", "2 cucharaditas de orégano seco", "3 cucharadas de azúcar moreno claro", "2 x 400 g / 14 onzas de latas de tomates picados", "500ml / 17fl oz de caldo de carne", "1 x 400 g / 14 oz pueden frijoles, drenados y enjuagados", "1 x 400 g / 14 oz puede frijoles de ojos negros, drenados y enjuagados", "copos de sal marina y pimienta negra recién molida", "75g / 3oz de chocolate puro, mínimo 70% de sólidos de cacao, más o menos picados", "manojo de cilantro fresco", "arroz al vapor", "8 cucharadas de crema agria", "4 cebollas de primavera, cortadas, finamente cortadas"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente dos cucharadas de aceite a fuego medio a alto en una sartén grande de base pesada con una tapa ajustada.", "Freír el bistec cortado en cubos hasta que se dore por todas partes, poniendo cada lote a un lado en un plato con una cuchara ranurada.", "Agregue otra cucharada de aceite a la sartén y agregue la carne picada, freír hasta que se dore por todas partes. Retire la carne picada de la sartén con una espumadera y déjela a un lado con el bistec.", "Agregue la cucharada restante de aceite a la sartén y fría la cebolla blanca, la cebolla roja y el apio durante 3-4 minutos, o hasta que las cebollas se ablanden pero no se doren.", "Agregue el chile chipotle, las hojuelas de chile, el chile en polvo y el orégano hasta que estén bien combinados. Cocine por otros dos minutos.", "Regrese la carne cortada en dados y picada a la sartén, luego mezcle el azúcar, los tomates picados, el caldo de carne, los frijoles y los guisantes de ojos negros. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra y continúe cocinando a fuego lento durante 2-3 horas. (Alternativamente, precaliente el horno a 140C / 280F / Gas 1 para cocinarlo en un plato resistente al horno por la misma cantidad de tiempo).", "Justo antes de servir, sazone el chile con hojuelas de sal de mar molidas y pimienta recién molida. Agregue el chocolate hasta que se derrita, luego agregue el cilantro picado.", "Sirva el chile con un tazón de arroz al vapor y cubra cada porción con una cucharada de crema agria. Adorne con las cebolletas en rodajas."]}, {"isVegetarian": false, "title": "Zapatero de res con scones de queso cheddar y romero", "url": "www_bbc_co_uk_food_recipes_beef_cobbler_with_79871", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_cobbler_with_79871_16x9.jpg", "ingredients": ["90ml / 3fl oz de aceite vegetal", "3 cucharadas de harina común", "sal y pimienta negra recién molida", "Filete de chuletón 900 g / 2lb o bistec guisado, cortado en cubos", "2 cebollas en rodajas", "2 zanahorias, cortadas en trozos", "2 palitos de apio, cortados en pedazos de 2cm / 1in", "1 puerro, lavado y cortado en anillos gruesos", "1 cucharada de puré de tomate", "600 ml / 1 pinta de vino tinto", "600ml / 1 pinta de existencias de carne de vacuno", "1 hoja de laurel", "Harina de auto crianza de 80g / 3oz", "100g / 3½oz de harina integral de auto crianza", "65g / 2¼ oz de harina malteada", "pizca de sal", "1 cucharada de romero fresco finamente picado", "Queso cheddar 150 g / 5½ oz, rallado", "175ml / 6fl oz de leche entera", "1 huevo de gallinas camperas, golpeado", "harina extra para quitar el polvo", "perejil, para adornar"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el estofado, precaliente el horno a 180C / 350F / Gas 4.", "Sazone la harina con sal y pimienta. Mezcle el filete en los cuatro para que cada pieza esté cubierta.", "Caliente la mitad del aceite en una cazuela y fría la carne en tandas hasta que se dore por todas partes. Retire de la sartén y colóquela a un lado.", "Caliente el aceite restante en la misma sartén y fría la cebolla, la zanahoria, el apio y el puerro hasta que estén coloreados. Agregue el puré de tomate y cocine por otros dos minutos.", "Vierte el vino en la sartén y caliéntalo. Con una cuchara de madera, raspa la carne y las verduras carbonizadas del fondo de la sartén. Agregue el caldo, la hoja de laurel y devuelva la carne a la sartén.", "Cubra con una tapa y cocine en el horno durante 1½ horas en el horno precalentado (alternativamente cocine en la placa a fuego muy lento durante 1 hora y media).", "Mientras tanto, haz que el zapatero sea el mejor. Mezcle las harinas en un recipiente. Agregue la sal, el romero picado y 100 g / 3½ oz del queso. Lentamente agregue la leche y junte la mezcla. Es posible que no necesite toda la leche. Trate de no sobrecargar la mezcla mezclándola demasiado ya que esto endurecerá el resultado final.", "Incline la mezcla sobre una superficie enharinada y agréguela para formar una masa suave. Forme la masa en un círculo áspero, manteniéndola bastante gruesa, aproximadamente 2,5 cm / 1 in. Recorta ocho círculos del tamaño de un bollo. Cepille la parte superior de los bollos con huevo batido y espolvoree sobre el queso restante.", "Retire el guiso del horno y coloque los bollos en la parte superior del guiso. Aumente la temperatura del horno a 220C / 425F / Gas 7. Vuelva a colocar el guiso en el horno y hornee, sin tapar, durante 20-25 minutos hasta que los bollos estén dorados. Sirva con una pizca de perejil picado."]}, {"isVegetarian": false, "title": "Carne de vaca comido con tortellini", "url": "www_bbc_co_uk_food_recipes_beef_consomm_with_29917", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2lb 4oz de carne magra picada", "2 zanahorias picadas", "1 puerro, recortado, toscamente picado", "1 ramita de tomillo fresco, solo hojas", "2 claras de huevo de gallinas camperas", "2 litros / 3½ pintas de caldo de carne fresca", "250g / 9oz tipo '00' harina de pasta, más extra para espolvorear", "4 yemas de huevo de gallinas camperas", "1 huevo entero de gallinas camperas mezclado con 2 cucharaditas de agua fría, más 1 huevo batido de gallinas camperas", "Paté tostado de granja de 50g / 1¾oz", "1 zanahoria, pelada pero dejada entera", "1 calabacín"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para el consomé, mezcle la carne picada, las zanahorias, el puerro y el tomillo en una cacerola grande.", "Bata las claras de huevo en un tazón pequeño y limpio hasta que estén espumosas, luego agrégalas a la cacerola y mezcla bien. Agregue un poco del caldo hasta que esté bien combinado, luego agregue el caldo restante y revuelva nuevamente.", "Caliente la sartén hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento durante aproximadamente 1 ½ horas, sin remover. Durante este tiempo, las claras de huevo subirán a la superficie del consomé y se llevarán las impurezas.", "Cuele el contenido de la sartén a través de un tamiz fino forrado con una tela de muselina y recoja el líquido filtrado en una olla limpia (la carne y las verduras coladas no se usan en esta receta, pero se pueden usar en otra receta, como un pastel o guiso). Mantenga caliente el consomé filtrado.", "Mientras tanto, para los tortellini, en un tazón grande, mezcle la harina, las yemas de huevo y el huevo entero mezclado con agua. Frote los ingredientes secos en los ingredientes húmedos hasta que la mezcla se asemeje a pan rallado, luego junte la mezcla para formar una masa. Alternativamente, use un procesador de alimentos para mezclar los ingredientes.", "Extienda la masa de tortellini en una superficie de trabajo ligeramente enharinada y amasar ligeramente durante 2-3 minutos, o hasta que quede suave y elástica. Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 20 minutos. Cortar la masa de pasta fría en cuartos. Estire un cuarto de la masa sobre una superficie de trabajo ligeramente enharinada hasta que quede muy delgada. Esto puede hacerse usando un rodillo o una máquina de pasta. Si está utilizando una máquina de pasta, desempolve los rodillos y colóquelos en su posición más amplia, luego pase la masa de pasta por la máquina, recogiendo la pasta enrollada en el otro extremo. Siga enrollando la hoja de pasta a través de la máquina, reduciendo los rodillos a su configuración más amplia cada vez, hasta que la pasta se haya enrollado a través de los rodillos ajustados a su ajuste más estrecho.", "Estirar otra cuarta parte de la pasta de pasta de la misma manera.", "Coloque una hoja de pasta en una superficie de trabajo ligeramente enharinada. Cuchara cucharaditas del paté a intervalos de 5 cm / 2 pulgadas por la mitad de la hoja de pasta, luego cuchara otra fila de porciones de paté por la otra mitad para crear 2 filas.", "Cepille las partes expuestas de la hoja de pasta con el huevo batido, luego coloque cuidadosamente la segunda hoja de pasta en la parte superior y presione hacia abajo alrededor del relleno de paté para sellar, eliminando las burbujas de aire a medida que avanza.", "Con un cortador de galletas, corte los discos de la pasta de modo que el relleno de tortellini quede en el centro de cada círculo con un borde de 0.5cm / ¼ pulgada alrededor.", "Doble con cuidado los discos de pasta llenos por la mitad, luego gire cada extremo y coloque las puntas sobre el relleno hasta que se encuentren, de modo que la pasta rellena tenga forma de anillo.", "Repita todo el proceso hasta que todo el paté se haya agotado y todas las formas de pasta se hayan convertido en tortellini. La pasta restante desenrollada se puede congelar para usar en otra receta (ver consejo).", "Rompa la zanahoria y el calabacín utilizando un melón baller, parisienne scoop o similar (alternativamente, corte la zanahoria y el calabacín).", "Ponga a hervir a fuego lento una olla de agua y baje las bolas de tortellini, zanahoria y calabacín al agua. Cocine a fuego lento durante 1-2 minutos, luego retire de la sartén con una cuchara ranurada y divídalo por igual entre los tazones de servir. Vierte el consomé en los tazones y sirve inmediatamente."]}, {"isVegetarian": false, "title": "Curry de ternera Marie Kiteria", "url": "www_bbc_co_uk_food_recipes_beef_curry_marie_kiteria_74737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12-15 hojas de curry frescas o secas", "500 g / 1 libra de cebollas de 2 oz, más o menos picadas", "2 cucharadas de aceite de colza", "200g / 7oz de espesor de yogurt natural", "3 cucharadas de puré de tomate", "2 x 5cm / 2in de raíz de jengibre fresco, pelado y finamente picado", "4-6 dientes de ajo, finamente picados", "1 cucharadita de comino molido", "2 cucharadas de cilantro molido", "1 cucharada colmada de chile en polvo", "1 cucharadita de cúrcuma molida", "Filete de rape de ternera de 500 g / 1 lb 2 oz, cortado en cubos de 2,5 cm / 1 in, enjuagado", "4-5 bayas de nogal o ciruelas deshuesadas", "Leche de coco de la lata 400ml / 16fl oz", "1 cucharadita de masala de sal (opcional)", "2-3 chiles verdes con los dedos, divididos en cuatro a lo largo,", "sal y pimienta negra recién molida", "1 cucharadita de aceite de colza o ghee", "3cm / 1in canela en rama", "2-3 vainas de cardamomo, ligeramente trituradas", "2-3 dientes", "1 cucharadita de semillas de comino", "1 cebolla pequeña, finamente cortada", "500 g / 1 lb 2 oz de arroz basmati o de grano largo", "1 litro / 1¾ pintas de agua hirviendo"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Si usa hojas de curry secas, sumérjalas en un poco de agua durante unos minutos, luego drene.", "Coloque la cebolla y el aceite en un procesador de alimentos y mezcle hasta lograr una pasta fina y suave. Incline la mezcla en un tazón grande y mezcle el yogur, puré de tomate, jengibre, ajo, hojas de curry y especias molidas.", "Transfiera la mezcla a una cacerola grande y mezcle la carne con las bayas de nogal. Cubra con una tapa y cocine a fuego medio durante aproximadamente una hora, o hasta que el aceite se haya separado y la carne esté cocida. Revuelva a menudo para evitar que se pegue al fondo de la sartén y sazone con sal si es necesario.", "Mientras tanto, haz el pilau. Precaliente su horno a 190C / 170C Fan / Gas 5. Caliente el aceite o ghee en una cazuela de 25cm / 10in. Agregue las especias y fría por 1-2 minutos, o hasta que estén coloreados. Agregue la cebolla y saltee durante 1-2 minutos, o hasta que esté pálida. Agregue el arroz y saltee durante 2-3 minutos, revolviendo con frecuencia para que todos los granos queden uniformemente cubiertos.", "Vierta sobre el agua hirviendo, sazone con sal y revuelva bien, limpiando los lados de los granos sueltos. Llevar a ebullición, luego reducir el fuego a fuego lento y cubrir con una tapa. Cocine por 10 minutos, revolviendo suavemente cada minuto más o menos y limpiando los lados del arroz antes de volver a cubrir la sartén. Agregue un poco más de agua si es necesario.", "Hornee el arroz por 15-20 minutos. Revuelva el arroz con un tenedor para hornear, aflojando todos los granos.", "Para terminar el curry, revuelva el garam masala, si se usa, en la leche de coco, luego agregue al curry. Suelta los chiles y cocina a fuego lento durante unos minutos más. Sazone al gusto.", "Sirve el curry con el pilau."]}, {"isVegetarian": false, "title": "Empanadas de carne", "url": "www_bbc_co_uk_food_recipes_beef_empanadas_19631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "2 cucharaditas de polvo de hornear", "1 cucharadita de sal", "60 g / 2¼ oz de mantequilla", "60 g / 2¼ oz manteca de cerdo o manteca vegetal", "75-100ml / 2½-3½fl oz de agua helada", "2 cucharadas de aceite de oliva", "½ cubo de caldo de carne desmenuzado", "Filete de solomillo o solomillo de 400 g / 14 oz, finamente picado", "1 cebolla, finamente picada", "1 pimiento verde pequeño, finamente picado", "3 dientes de ajo, aplastados", "3 cucharadas de vino tinto", "½ cucharadita de comino molido", "½ cucharadita de pimentón", "½ cucharadita de chile en polvo", "12 aceitunas verdes rellenas de pimiento, en rodajas", "1 cucharadita de sal", "½ cucharadita de pimienta negra molida", "1 huevo batido de corral, para untar pasteles"], "serves": "Hace 12", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la masa, combine la harina, el polvo de hornear y la sal en un tazón.", "Corta la manteca y la mantequilla en cubos de 1 cm / ½, agrega a la harina y frota la grasa en la harina hasta que se asemeje a migas de pan finas. Agregue suficiente agua fría para formar una masa suave. Envuelva la película adhesiva y déjela en la nevera para descansar durante una hora.", "Para el relleno de empanada, caliente una cucharada de aceite en una sartén grande, espolvoree el caldo en el aceite caliente y fría por 30 segundos, revolviendo continuamente. Agregue el bistec y fría por unos dos minutos hasta que se dore. Coloque la carne y los jugos a un lado.", "Calentar la cucharada restante de aceite de oliva, agregar la cebolla y el pimiento verde y freír hasta que estén blandos, unos tres minutos. Agregue el ajo y fría por un minuto más. Agregue el vino, el comino, el pimentón, el chile en polvo, las aceitunas y la sal y la pimienta negra recién molida. Freír por un minuto más, revolviendo continuamente. Regrese la carne y los jugos a la sartén y mezcle bien. Dejar de lado para enfriarse.", "Para rellenar las empanadas, saque la pastelería del refrigerador y, sobre una superficie bien enharinada, extienda una hoja delgada. Usando un platillo como plantilla, recorta los discos de hojaldre.", "Coloque una cucharada de relleno en la mitad del círculo de repostería. Cepille el borde con huevo, doble y doble los bordes.", "Cepille con huevo y colóquelo en una bandeja para hornear engrasada. Hornee durante 20 minutos o hasta que estén dorados.", "Sirve frío o caliente como aperitivo o entrante."]}, {"isVegetarian": false, "title": "Empanadas de carne de res y maíz al estilo mexicano", "url": "www_bbc_co_uk_food_recipes_beef_empanadas_and_94573", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 300-400 g / 10½ oz-14 oz de la carne de la mejilla", "4 cucharadas de aceite de oliva", "1 cebolla, más o menos picada", "1 zanahoria, más o menos picada", "1 apio en barra, aproximadamente picado", "1 hoja de laurel", "200ml / 7fl oz de vino tinto", "400ml / 14fl oz de caldo de carne", "Harina normal de 350g / 12oz", "1 cucharadita de polvo de hornear", "175g / 6oz de mantequilla salada, refrigerada", "4 cucharadas de aceite de oliva", "½ cebolla, más o menos picada", "1 diente de ajo, finamente picado", "1 chile rojo seco, finamente picado", "1 cucharadita de pimentón ahumado", "1 cucharadita de semillas de comino", "1 cucharada de puré de tomate", "1 cucharada de alcaparras, escurridas", "2 huevos de gallinas camperas, golpeados", "4 cabezas de maíz dulce, cáscara y seda eliminado", "2 cucharadas de mayonesa", "1 cucharadita de pimienta chipotle molido", "150 g / 5½ oz de cotija o queso feta, desmenuzado", "½ diente de ajo, aplastado", "1 lima, solo jugo", "2 cebollas de primavera, picadas", "30g / 1oz de jalapeños en rodajas, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 160C / 180C Fan / Gas 3.", "Para estofar la mejilla de ternera, caliente el aceite en un plato resistente al horno, agregue la mejilla de la carne de res y dore por todos lados para sellar. Retire de la sartén y reserve", "Agregue las verduras y la hoja de laurel y cocine durante 3-4 minutos hasta que estén suaves. Coloque la mejilla de la carne de nuevo en el plato, agregue el vino y cocine hasta que el líquido se reduzca en volumen a la mitad. Agregue el caldo, sazone con sal y pimienta y colóquelo en el horno durante 2-3 horas o hasta que la carne se desprenda fácilmente de la mejilla.", "Para las empanadas, rellene la harina, el polvo de hornear y la mantequilla en un procesador de alimentos, agregando un poco de agua para unir. Envuelva la masa en una película adhesiva y descanse en la nevera durante 1 hora.", "Caliente el aceite en una sartén a fuego medio y fría la cebolla, el ajo, las especias y el puré de tomate. Agregue la carne cocida y las alcaparras. Si la mezcla está demasiado seca, agregue un poco de jus de cocción para aflojarla. Cocine hasta que esté caliente.", "Para ensamblar las empanadas, retire la masa del refrigerador y estire al grosor de una moneda de una libra (3 mm). Corta círculos de la masa, usando un platillo de 10 cm / in o cortador de pasteles. Alinee una bandeja para hornear con papel de hornear.", "Ponga 2 cucharaditas colmadas llenando la mitad de cada círculo de repostería. Humedezca los bordes de la masa con un poco de agua, doble la mitad no llena de cada hojaldre sobre la mitad llena y doble los bordes o use un tenedor para sellar. Cepille con el huevo, colóquelo en la bandeja para hornear y hornéelo por 25 minutos.", "Mientras tanto, calentar una sartén grande a fuego alto y remar el maíz dulce, volteándolo ocasionalmente, hasta que todos los lados estén a la parrilla y dorados.", "Corta los granos de la mazorca sosteniendo el maíz en su base y pasando un cuchillo afilado de arriba a abajo. Mezcle los granos con mayonesa, chipotle, cotija, ajo, jugo de lima, cebolletas y jalapeños. Sirve con las empanadas."]}, {"isVegetarian": false, "title": "Medallones de solomillo de ternera con crema de brandy y champiñones", "url": "www_bbc_co_uk_food_recipes_beef_fillet_medallions_90079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para freír", "3 chalotes, finamente picados", "5 cucharadas de aguardiente", "2 dientes de ajo, finamente picados", "Castaño mezclado 180g / 6oz y setas salvajes, en rodajas", "500ml / 18fl oz de caldo de carne", "3 ramitas de tomillo, solo hojas", "salpicaduras doble crema", "600 g / 1 libra de filete de carne de vacuno de 5 oz, cortado en medallones", "sal y pimienta negra recién molida", "Papas de 400g / 14oz, peladas y picadas", "150ml / 5fl de leche en oz", "2 cebollas de primavera, en rodajas", "30g / 1oz de mantequilla", "300g / 10½oz de judías verdes", "2 chalotas, en rodajas finas", "dash aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne y la salsa, caliente un poco de aceite vegetal en una sartén y agregue los chalotes y el ajo. Cocine hasta que esté ligeramente coloreado.", "Agregue los champiñones y freír hasta que estén cocidos.", "Agregue el brandy y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo y el tomillo y, nuevamente, cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema y cocine hasta que la mezcla se haya reducido a una consistencia de salsa.", "Mientras tanto, para el campeón, coloque las papas en una sartén con agua y déjelas hervir. Cocine por 15-20 minutos, o hasta que estén tiernos.", "Para la carne y la salsa, ponga una sartén grande a fuego medio. Sazone los medallones de ternera, al gusto, con sal y pimienta. Frote con aceite y fría en cada lado durante al menos dos minutos, dependiendo de lo bien que disfrute de su filete. Mantenga caliente hasta que esté listo para servir.", "Para el campeón, cuando las patatas estén cocidas, escurra bien y machaque hasta que quede suave.", "Coloque la leche y la cebolla tierna en una olla pequeña y deje que hierva. Cocine a fuego lento hasta que las cebollas estén cocidas, luego pase la mezcla a través de un colador fino. Revuelva la leche en el puré de papas y manténgala caliente hasta que esté lista para servir.", "Para la fricassée, ponga a hervir una olla de agua, agregue las judías verdes y cocine a fuego lento durante cuatro minutos. Prepare un recipiente con agua helada.", "Retire los frijoles del fuego, drene y coloque brevemente en agua fría. Drenar de nuevo.", "En una sartén, fría ligeramente la chalota en un poco de aceite y agrega las judías verdes. Sazone al gusto con sal y pimienta negra recién molida.", "Sirve la carne con la salsa, el fricasé de frijoles y el campeón."]}, {"isVegetarian": false, "title": "Filete de ternera con ensalada de achicoria y queso azul y chips de apio", "url": "www_bbc_co_uk_food_recipes_beef_fillet_on_the_bone_66102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de clara de huevo (3 huevos pequeños blancos de gallinas camperas)", "500g-1kg / 1lb 2oz-2lb 4oz de sal fina", "1 apio nabo, aproximadamente 650 g / 1 libra 7 oz", "390 g de nueces en escabeche", "Harina de tapioca 100 g / 3½ oz", "aceite vegetal, para freír", "aceite de oliva, para freír", "1 filete de ternera en el hueso", "1 achicoria roja", "1 achicoria blanca", "1 lechuga rizada", "75g / 2¾oz de queso azul, desmenuzado", "1 cucharada de 2.5cm / 1 en cebollines picados", "2 cucharadas de aceite de nuez, para lloviznar", "sal y pimienta negra recién molida", "300 ml / 10 fl oz jus o salsa de carne de vacuno, para servir", "2 nueces, toscamente picadas, para servir"], "serves": "Porciones 2", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Mezcle las claras de huevo y la sal en una pasta. Coloque la pasta alrededor del apionabo para formar una costra de sal y colóquela en una bandeja para hornear. Hornea durante 1 hora y media, luego deja reposar para que se enfríe por completo. (Esto se puede hacer la noche anterior, si se prefiere).", "Drene las nueces en escabeche, reserve el líquido y mezcle en un procesador de alimentos. Agregue lentamente el líquido, mezclando todo el tiempo, hasta que se forme un puré espeso y suave. Tamiza la mezcla en un recipiente limpio y reserva.", "Para los chips de apio nabo, rompa la costra de sal y deséchela. Cortar el apio nabo en trozos del tamaño de un chip y polvo en la harina de tapioca. Caliente el aceite en una freidora a 190 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los chips de celariac hasta que estén dorados, luego escurrir sobre papel de cocina.", "Calentar un poco de aceite de oliva en una sartén a fuego alto. Sazone la carne, luego fría durante 2 minutos por cada lado, o hasta que se haga a su gusto. Reserve para descansar en un lugar cálido.", "Corte la base de la achicoria y la lechuga y quite las hojas exteriores. Separe las hojas internas y colóquelas en un tazón grande. Espolvoree sobre el queso azul y el cebollino, sazone y rocíe con un poco de aceite de nuez.", "Para servir, caliente el jus hasta que esté caliente. Retire el hueso del filete de carne y corte la carne por la mitad, luego colóquelo en dos platos calientes y espolvoree el jus sobre él. Agregue las papas fritas y la ensalada con una cucharada de ketchup de nueces al costado. Espolvorear con nueces picadas."]}, {"isVegetarian": false, "title": "Filete de res con miso de pimienta negra y ensalada de setas japonesa en escabeche", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_13708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml / 5½fl oz de sake", "150ml / 5½fl oz", "20 g de jengibre fresco, pelado y finamente picado", "2 cucharaditas de ajo machacado", "3 cucharaditas de pimienta negra recién molida", "Pasta de miso rojo 200g / 7oz", "4 filetes de solomillo de res de 200 g / 7 oz", "wasabi recién rallado, para servir", "1 cucharada de aceite vegetal", "300 g / 10½ oz mezclar hongos japoneses (mantener el shiitake por separado)", "350 ml / 12 fl oz", "100ml / 3½fl oz de vinagre de arroz", "50ml / 2fl oz de salsa de soja ligera", "1 cebolla, cortada en anillos de 1cm / ½ en"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Para la carne con miso, caliente el sake y el mirin juntos en una cacerola pequeña durante 3-4 minutos, o hasta que el alcohol se haya evaporado. Agregue el jengibre y el ajo y cocine por 2-3 minutos, o hasta que estén tiernos. Agregue la pimienta y la pasta de miso y revuelva hasta que se mezcle. Retire del fuego.", "Cepille los filetes ligeramente con la mezcla. Si es posible, marinado, cubierto, en la nevera durante 2-3 horas, pero vuelva a la temperatura ambiente antes de cocinar.", "Para la ensalada de hongos japonesa en escabeche, caliente el aceite en una sartén y fría los champiñones shiitake hasta que estén coloreados. Agregue los champiñones restantes y fría por 2-3 minutos.", "Desglasar la sartén vertiendo 100 ml / 3½ fll de mirin, luego burbujear hasta reducir a la mitad. Vierta el vinagre y la salsa de soja, revuelva, retire del fuego y reserve.", "Precalentar una sartén de plancha a caliente. Cocine los aros de cebolla durante 5-7 minutos, volteándolos hasta la mitad, hasta que estén caramelizados en ambos lados. Transfiera a un recipiente con tapa a prueba de calor y reserve.", "Traiga el mirin restante de 250ml / 9fl a ebullición, luego viértalo sobre las cebollas. Selle el contenedor y déjelo enfriar.", "Para la carne con miso, precaliente una sartén de plancha de alta densidad a fuego medio. Cocine los filetes hasta que se forme una costra. Continúe cocinando y volteando, cepillando los filetes con más miso de pimienta negra cada vez que los gire, hasta que se cocinen a su gusto. Tenga cuidado de no dejarlos atrapar, o el miso se volverá amargo. Deje que se enfríe durante al menos 20 minutos.", "Cortar los filetes y colocar en un plato. Sirve con champiñones, cebollas y wasabi."]}, {"isVegetarian": false, "title": "Solomillo de ternera con patatas rosti y salsa de Madeira", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_potato_43905", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 papas grandes Maris Piper, peladas y ralladas", "2 cucharadas de crema", "1 huevo de gallinas camperas, solo yema", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla, derretida", "25g / 1oz de mantequilla", "1 chalote de plátano, reducido a la mitad longitudinalmente", "ramita de tomillo fresco", "85g / 3oz de mantequilla", "1 chalote de plátano, finamente picado", "1 diente de ajo, picado", "50 ml / 2 fl oz en Madeira", "100ml / 3½fl oz de caldo de carne", "1 cucharada de estragón fresco picado", "1 cucharada de aceite de colza", "2 x 150g-200g / 5½-7oz de filetes de res gruesos", "200 g / 7 oz de setas", "2 cucharadas de perejil fresco picado", "50 g / 1¾oz de espinaca baby"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los rosti, envuelva las papas ralladas en una toalla de té limpia y exprima la mayor cantidad de líquido que pueda.", "Coloque la papa rallada en un bol con la crème fraîche y la yema de huevo. Condimentar con sal y pimienta. Revuelve para combinar.", "Caliente la mantequilla en una sartén a fuego medio y coloque dos anillos de 7,5 cm / 3 in en la sartén. (Si no tiene anillos de chef, simplemente moldee la mezcla de papa en dos hamburguesas). Coloque la mezcla de papa en los aros, presione bien con una cuchara y cocine durante 3-4 minutos o hasta que se dore, luego retire los anillos (si se usan).", "Voltee el rosti, presione la mezcla hacia abajo y cocine durante 3-4 minutos en el otro lado, o hasta que esté bien cocida.", "Para la chalota, puntos de mantequilla en una lata de asar. Coloque las mitades de chalote en la mantequilla, con el lado del corte hacia abajo, y ponga la ramita de tomillo en la parte superior. Asar en el horno precalentado durante 5-10 minutos hasta que esté blando.", "Para la salsa, caliente una sartén y agregue 55 g / 2 oz de mantequilla. Una vez caliente agregue la chalota y el ajo y cocine por 2-3 minutos. Agregue el Madeira y stock. Cocine hasta que el volumen del líquido se haya reducido a la mitad y tenga una salsa espesa (el caldo hecho en casa, o el caldo comprado como líquido funciona mejor para esto, en lugar del caldo hecho de polvo que es más acuoso).", "Agregue el estragón y agregue el resto de la mantequilla, para darle a la salsa un acabado brillante.", "Para la carne, caliente una sartén y agregue el aceite de colza. Una vez caliente, agregue el filete y cocine en cada lado durante 3-4 minutos.", "Cuando la carne esté casi lista, agrega los champiñones a la sartén. Hilvane la carne con los jugos de la bandeja mientras cocina. Cuando la carne esté cocida a tu gusto, sácala de la sartén y ponla a un lado para que descanse.", "Agregue el perejil a los champiñones y cocine por otros minutos hasta que los champiñones estén cocidos.", "En una sartén por separado, agregue la espinaca y dos cucharadas de agua. Cocine hasta que se marchite.", "Para servir, coloque un rosti en el centro de cada plato y cubra con los champiñones y las espinacas. Coloque la carne en la parte superior y cuchara sobre la salsa."]}, {"isVegetarian": false, "title": "Solomillo de ternera con puré de ajo silvestre y una guisada de setas", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_wild_74776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 1¾oz de mantequilla sin sal", "4 chalotas pequeñas, en rodajas", "1 diente de ajo, aplastado", "300g / 10½oz de ajo silvestre", "30g / 1 oz de perifollo fresco, picado", "30g / 1 oz de estragón fresco, picado", "150ml / 5fl oz de crema doble", "pizca de sal", "2 cucharadas de aceite de oliva / aceite de colza", "75g / 2½oz de mantequilla sin sal", "4 x 120 g / 4 oz de filetes de carne", "100g / 3½oz de mantequilla sin sal", "1 diente de ajo, aplastado", "1 chalote, finamente picado", "200g / 7oz de hongos silvestres surtidos", "2 cucharadas de Madeira", "100 ml / 3½ fl oz de caldo de res o caldo de pollo marrón", "1 cucharadita de mostaza integral", "1 tomate, pelado, sin semillas y finamente picado", "1 cucharadita de estragón fresco picado", "2-3 cucharadas de aceite de oliva o aceite de colza", "12 puntas de espárragos", "hojas frescas de ajo silvestre"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el puré de ajo silvestre, derrita la mantequilla en una cacerola. Agregue los chalotes y el ajo y cocine suavemente sin colorearlos. Agregue el ajo silvestre, el perifollo y el estragón y cocine hasta que el ajo silvestre esté tierno.", "Transfiera a una licuadora. En una sartén pequeña llevar la crema a ebullición. Agregue esto a la licuadora. Mezclar hasta que esté suave. Sazonar con sal al gusto. Poner en una botella de plástico y mantener caliente hasta servir.", "Para la carne, sazone la carne con sal. Caliente el aceite y la mantequilla en una sartén hasta que forme espuma. Cocine la carne durante unos minutos en cada lado hasta que esté cocida a su gusto. Déjalo a un lado para descansar antes de servir.", "Para el guisado de hongos silvestres, derrita 20 g / ¾oz de la mantequilla en una sartén, agregue el ajo y la chalota picada y cocine hasta que quede transparente. Agregue los champiñones, sazone con sal y pimienta y cocine suavemente por 3 minutos. Agregue el Madeira a la sartén y raspe el fondo de la sartén. Cocine hasta que se reduzca en un tercio en volumen. Añadir el caldo y hervirlo. Agregue la mostaza y el resto de la mantequilla. Sazone con sal y pimienta y luego y el tomate y el estragón justo antes de servir.", "Para las puntas de los espárragos, caliente una sartén a la plancha. Cubra los espárragos en el aceite, sazone con sal y pimienta, luego colóquelos en la plancha caliente, volteándolos ocasionalmente. Cocine durante aproximadamente 5 minutos hasta que esté listo y listo para servir.", "Para servir, vierta el puré de ajo salvaje en el plato de la botella de plástico. Cortar la carne por la mitad, agregar al plato con el fricasé de setas y los espárragos. Adornar con hojas de ajo silvestre."]}, {"isVegetarian": false, "title": "Caldo de carne", "url": "www_bbc_co_uk_food_recipes_beef_hotpot_59730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_hotpot_59730_16x9.jpg", "ingredients": ["1kg / 2lb 2oz filete estofado, cortado, cortado en trozos de 5cm / 2in", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "75g / 3oz de mantequilla", "150g / 5oz cebollas bebé, peladas", "4 zanahorias, peladas, cortadas en trozos", "1 cucharada de harina normal", "Vino tinto 200ml / 7floz", "400ml / 14fl oz de caldo de carne fresca", "2 ramitas de tomillo frescas", "Patatas de 1 kg / 2 lb 2 oz, cortadas en rodajas de 5 mm / ¼ pulgadas"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Sazonar la carne con sal y pimienta negra recién molida.", "Caliente una cacerola grande hasta que esté muy caliente, luego agregue el aceite y un poco de mantequilla. Freír la carne hasta que se dore por todos lados, luego retirar de la sartén y reservar. (Puede necesitar hacer esto en lotes).", "Agregue las cebollas y otro pomo de mantequilla a la sartén y fría por 2-3 minutos, o hasta que estén ligeramente doradas. Agregue las zanahorias y cocine por un minuto más.", "Agregue la harina y agregue gradualmente el vino tinto, revolviendo hasta que quede suave. Agregue la carne dorada y el caldo, sazone con sal y pimienta negra recién molida y deje que hierva. Agregue el tomillo fresco, luego coloque las papas encima. Puntee la superficie con la mantequilla restante.", "Cubra con una tapa y cocine en el horno durante una hora.", "Retire la tapa y aumente el calor a 200C / 400F / Gas 6 durante 30 minutos."]}, {"isVegetarian": false, "title": "Carne de res con sabor, lleva brócoli y dulce y saborea la calabaza", "url": "www_bbc_co_uk_food_recipes_beef_jhal_faraizi_karhai_92693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Patatas crujientes pequeñas de 340g / 12oz sin pelar", "2 cucharadas de aceite de oliva o de colza", "½ cucharadita de semillas de comino entero", "1 cebolla mediana, cortada en cubos de 7mm / ⅓in", "2-3 chiles verdes frescos y calientes (como los chiles de ojo de pájaro) picados", "Carne asada sobrante de 340g / 12oz, cubos de 7mm / ⅓in", "1 cucharadita de sal", "pimienta negra recién molida", "3 cucharadas de aceite de oliva o de colza", "⅛ cucharadita de asafoetida molida", "¼ cucharadita de semillas de comino entero", "¼ cucharadita de semillas de mostaza entera", "Brotes de brócoli recortados 400 g / 14oz", "½ cucharadita de sal", "¼ cucharadita de pimienta de cayena", "3 cucharadas de aceite de oliva", "generoso pizca asafoetida suelo", "½ cucharadita de semillas de mostaza marrones o amarillas", "560g / 1¼lb de calabaza pelada y sin semillas, cortada en 2.5cm / 1 en trozos", "¾-1 cucharadita de sal", "1½ cucharadita de azúcar en polvo", "⅛-¼ cucharadita de pimienta de cayena", "1 cucharada de yogur natural", "2 cucharadas de cilantro fresco picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne de vaca jhal faraizi, hiérvalas en una sartén con agua con sal y déjelas enfriar. Una vez que estén fríos, pélelos y córtelos en cubos de 7 mm / in.", "Caliente el aceite en una sartén grande, preferiblemente antiadherente, a fuego medio-alto. Cuando esté caliente, agregue las semillas de comino. Déjelos chisporrotear durante cinco segundos, luego agregue la cebolla, las papas cocidas y los chiles.", "Baje el fuego a medio y sofreír la mezcla durante 4-5 minutos, o hasta que la cebolla se haya suavizado y sea translúcida. Agregue la carne, la sal y mucha pimienta negra recién molida, luego saltee por un minuto más.", "Reduzca el fuego a medio-bajo. Presione hacia abajo todos los ingredientes en la sartén con una espátula para formar una torta plana que llene la sartén. Continúe cocinando durante 12-15 minutos, girando la sartén para que la parte inferior de la \\\"torta\\\" se dore uniformemente. Mantener caliente", "Para el brócoli karhai, caliente el aceite en un karhai (o wok con tapa o sartén) a fuego medio-alto.", "Cuando el aceite esté caliente, agregue las semillas de asafoetida, comino y mostaza (tenga en cuenta que las semillas de mostaza saltan de la sartén a los ojos). Tan pronto como las semillas de mostaza comiencen a reventar, agregue el brócoli. Revuelva freír durante un minuto, luego agregue la sal y la pimienta de cayena.", "Vierta cuatro cucharadas de agua y deje que la mezcla hierva a fuego lento. Cubra la olla con una tapa, baje el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine durante 7-8 minutos, o hasta que el brócoli esté tierno, revolviendo de vez en cuando.", "Mientras tanto, para la calabaza agridulce, caliente el aceite en una sartén con tapa a fuego medio. Cuando esté caliente, agregue las semillas de asafoetida y mostaza. Tan pronto como las semillas comiencen a aparecer, en cuestión de segundos, agregue la calabaza.", "Sofría la calabaza por 2-3 minutos o hasta que las piezas empiecen a dorarse. Agregue 50 ml / 2 fl oz de agua, cubra la olla con una tapa, baje el fuego y cocine durante 8-10 minutos, o hasta que la calabaza esté tierna.", "Agregue la sal, el azúcar, la pimienta de cayena y el yogur. Revuelva hasta que esté bien combinado y cocínelo, destapado, a fuego medio, hasta que la mezcla de yogur se haya calentado. Agregue el cilantro fresco.", "Para servir, divida la carne de jhal faraizi en cuatro porciones iguales y sírvala caliente con el karahi brócoli y calabaza."]}, {"isVegetarian": false, "title": "Sopa de gulash de carne de res (Gulyas leves)", "url": "www_bbc_co_uk_food_recipes_beef_goulash_soup_gulyas_16159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_goulash_soup_gulyas_16159_16x9.jpg", "ingredients": ["1kg / 2lb 4oz bistec estofado o carne de venado", "2 cucharadas de harina normal", "aceite vegetal", "2 cebollas medianas, cortadas en cubitos", "4 zanahorias medianas, cortadas en cubitos", "2 palitos de apio, hojas y todo, cortados en cubitos", "1 pimiento rojo, sin semillas y en cubitos", "5 dientes de ajo, aplastados", "4 cucharadas de buena paprika húngara dulce", "2 cucharadas de semillas de alcaravea, trituradas", "60 g / 4 cucharadas de puré de tomate", "3 hojas de laurel", "2 litros / 3½ pintas buen caldo de carne", "4 papas, peladas y picadas en cubos pequeños", "sal marina copos", "pimienta negra recién molida", "crema agria y perejil de hoja plana, para adornar"], "serves": "Para 6 - 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Recorta la carne y córtala en trozos del tamaño de un bocado. En un tazón grande, mezcle la harina con una cucharadita de sal y pimienta. Agregue la carne y revuelva para que todos los trozos se espolvoreen con harina.", "Caliente una cucharada de aceite en una sartén grande y dore la carne en pequeños lotes, dejando a un lado cada lote mientras dora al siguiente. Tenga cuidado de no amontonar la sartén o la carne se pondrá de vapor en lugar de marrón.", "Mientras tanto, caliente un poco de aceite en una sartén grande de fondo grueso, agregue las cebollas, zanahorias, apio, pimiento rojo y ajo. Cocine suavemente por unos 10 minutos hasta que empiecen a ablandarse.", "Agregue la carne de res, pimentón, semillas de alcaravea, puré de tomate y hojas de laurel, luego vierta el caldo de carne.", "Revuelva bien, cubra la sartén y cocine a fuego lento durante al menos 1 ½ horas hasta que la carne esté comenzando a ponerse tierna. Agregue las papas y continúe cocinando a fuego lento por otros 30 minutos. Verifica el condimento antes de servir.", "Sirva la sopa en tazones con un generoso remolino de crema agria y una buena pizca de perejil."]}, {"isVegetarian": false, "title": "Aceitunas de ternera y salsa de cerveza de cebolla", "url": "www_bbc_co_uk_food_recipes_beef_olives_and_onion_11851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite vegetal, para freír", "1 chalote, finamente picado", "2 cucharadas de champiñones picados", "120 g / 4½ oz de carne picada", "2 cucharadas de pan rallado", "1 cucharada de mostaza Dijon", "2 x 80 g / 3 oz rebanadas de carne de res o carne de res", "2 cebollas, finamente picadas", "1 cucharada de harina normal", "100ml / 3½fl oz de cerveza oscura", "250ml / 9fl oz de caldo de carne", "2 cucharadas de aceite de oliva", "1 puerro, más o menos picado", "4 zanahorias, peladas y picadas", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Caliente una pizca de aceite en una sartén y fría la chalota y los champiñones hasta que estén blandos, luego déjelos enfriar.", "Mezcle las verduras fritas con la carne picada, pan rallado y mostaza.", "Forme dos salchichas de la longitud de las rodajas de carne de res, luego enrolle la rodaja de carne alrededor de la mezcla. Ate con hilo de cocina y sazone con sal y pimienta.", "Calentar un poco más de aceite en una sartén y freír hasta que se dore por todas partes. Agregue las cebollas y cocine hasta que se hayan coloreado un poco, luego agregue la harina y la cerveza. Cocine a fuego lento durante 5 minutos, luego agregue el caldo. Cubra sin apretar y cocine a fuego lento durante 30 minutos.", "Mientras tanto, mezcle los puerros y las zanahorias en aceite de oliva y tueste en el horno durante 25-30 minutos.", "Sirva las aceitunas de ternera con los puerros y las zanahorias."]}, {"isVegetarian": false, "title": "Pastel de carne", "url": "www_bbc_co_uk_food_recipes_beef_pasties_45473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 4,5 kg / 10 lb, más extra para quitar el polvo", "3 cucharadas de sal", "Manteca de 2.25kg / 5lb", "1.2 litros / 2 pintas de agua fría", "3kg / 6lb 8oz de falda de carne o bistec estofado, cortado en cubos de 2cm / 1in", "Harina normal 150g / 5½ oz", "sal y pimienta negra recién molida.", "Patata de 4,5 kg / 10 lb, pelada, más o menos picada", "Colina de 1.5kg / 3lb 5oz, pelada, más o menos picada", "1,5 kg / 3lb cebolla de 5oz, pelada, picada finamente", "10 huevos de gallinas camperas, golpeados"], "serves": "Hace 40 pasties", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa, combine la harina, la sal y la manteca y frote hasta que la mezcla se asemeje a pan rallado, esto se puede hacer en un procesador de alimentos industrial o en lotes.", "Ya sea a mano, o con el motor todavía en funcionamiento, agregue gradualmente el agua en una corriente delgada hasta que la mezcla se una como masa.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, coloque la carne picada y la harina en un tazón grande y mezcle hasta que la carne esté cubierta con la harina. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cuando la pastelería se haya enfriado, divídala en 40 piezas de tamaño uniforme. Extienda cada pedazo de masa en una superficie de trabajo ligeramente enharinada hasta que sea más grande que un plato de comida. Asegúrate de no rasgar la masa.", "Usando un plato como plantilla, recorte los bordes de cada pieza de masa para formar un disco.", "Coloque una cucharada de la papa picada en la mitad de cada disco de hojaldre, dejando 1,5 cm / ¾ in libre a lo largo de los bordes.", "Con una cuchara, coloque un poco del colinabo en la parte superior de la capa de patata, y luego espolvoree un poco de cebolla picada sobre la capa de colinabo. Finalmente, cuchara sobre parte de la carne.", "Cepille ligeramente los bordes de la masa ligeramente con un poco del huevo batido.", "Doble la mitad vacía del disco de repostería sobre la mitad llena y presione los bordes con un tenedor, o gire los bordes para sellar.", "Cepille la parte superior de cada pasty con más huevo batido. Con un cuchillo afilado, corte una pequeña cruz en la parte superior de las empanadas a través de la cual puede escapar el vapor. Repita el proceso con los pasteles restantes, las verduras y la carne.", "Coloque las empanadas en una bandeja para hornear y transfiéralas al horno. Hornee durante 45-50 minutos, o hasta que la masa esté crujiente y dorada, y el relleno esté bien cocido y caliente.", "Cuando los pasteles estén cocidos, retírelos del horno y déjelos a un lado para que descansen de 5 a 10 minutos antes de servirlos."]}, {"isVegetarian": false, "title": "Pithivier de carne", "url": "www_bbc_co_uk_food_recipes_beef_pithivier_74073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7 onzas de verduras cocidas sobrantes, más o menos picadas", "1 cucharada de perejil de flatillo picado", "sal marina y pimienta negra recién molida", "Salsa de carne sobrante de 50 ml / 2 fl oz, más extra para servir", "2 x 375g / 13oz de hojaldre con mantequilla listo para usar", "harina común, para quitar el polvo", "2 cucharaditas de mostaza integral", "300 g / 10½oz de carne cocida sobrante, cortada en rodajas finas", "2 yemas de huevo de gallinas camperas, batidas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra una bandeja para hornear grande con papel de silicona para hornear.", "Mezcle las verduras y el perejil en un tazón, luego sazone, al gusto, con sal y pimienta negra recién molida. Aplastando la mezcla ligeramente en una masa, agregando lo suficiente de la salsa sobrante para que se mantenga unida.", "Extienda una pieza de hojaldre en una superficie de trabajo ligeramente enharinada hasta un grosor de 3 mm. Levanta un plato sobre la masa y córtalo con un cuchillo afilado para crear un gran disco de hojaldre. Busque un recipiente que tenga aproximadamente 3 cm / 1¼ pulgadas de diámetro más pequeño que el disco de hojaldre, luego arránquelo en el centro y úselo como plantilla para marcar un círculo más pequeño en la masa. Transfiera el disco de pastelería a la bandeja de horneado preparada.", "Pinche el círculo interno de repostería varias veces con un tenedor. Extienda un poco de la mostaza, luego coloque un poco de la carne cocida encima, luego una parte de la mezcla de vegetales encima de eso, siempre dentro del círculo marcado.", "Con una cuchara, alternar las capas de la mezcla de mostaza, carne de res y vegetales en el centro del disco de pastelería hasta que todo se haya agotado.", "Cepille el borde de la pastelería con algo del huevo batido.", "Extienda la segunda pieza de masa sobre una superficie de trabajo ligeramente enharinada hasta un grosor de aproximadamente 5 mm / ¼ in. Coloque la masa sobre la parte superior de la cúpula de relleno, presionando suavemente alrededor de los bordes para sellar las dos piezas de masa juntas.", "Recorte cualquier exceso de pastelería. Use cualquier recorte para decorar la parte superior del pithivier con forma de flor. Use un cuchillo de mantequilla para anotar los detalles en los pétalos y el tallo, si lo desea.", "Cepille la superficie del pithivier por todas partes con el huevo batido restante. Hornee en el horno durante 20 minutos, o hasta que el relleno esté bien caliente y la masa esté crujiente y dorada.", "Sirve el pithivier con la salsa sobrante restante."]}]