[{"isVegetarian": false, "title": "Cauliflower cheese with maple syrup pancetta", "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_with_76792", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium cauliflower, stalk removed, florets separated", "100g/3½oz butter", "40g/1½oz plain flour", "500ml/18fl oz milk", "1 tbsp Dijon mustard", "300g/10½oz extra mature cheddar, grated", "sea salt and freshly ground black pepper", "3 slices brioche, blitzed to crumbs in a food processor", "20 rashers streaky bacon or pancetta", "2 tbsp maple syrup"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Bring a large pan of salted water to the boil, then cook the cauliflower florets for 5-6 minutes, or until tender. Drain well and refresh in a large bowl of iced water.", "Melt half of the butter in a large saucepan. When melted, whisk in the flour to form a smooth paste. Continue to cook the paste for 1-2 minutes, whisking continuously. ", "Gradually add the milk to the paste, whisking after each addition until smooth. When all of the milk has been added to the sauce, stir in the mustard and half of the grated cheese until smooth. Season, to taste, with salt and freshly ground black pepper.", "Drain the cooled cauliflower florets and transfer to an ovenproof dish. Pour over the cheese sauce, then sprinkle over the remaining grated cheese.", "Place the dish under the grill for 4-5 minutes, or until the cheese is golden-brown and bubbling.", "Meanwhile, melt the remaining butter in a frying pan over a medium heat. Add the brioche crumbs and fry until golden-brown and crisp, stirring well. Transfer to a bowl.", "Wipe the frying pan with kitchen roll. Add the pancetta and dry-fry until crisp and golden-brown. Drizzle over the maple syrup and stir until it coats all of the pancetta.", "To serve, sprinkle the breadcrumbs over the cauliflower cheese. Lay the rashers of maple syrup pancetta on top. Spoon onto plates."]}, {"isVegetarian": false, "title": "Cauliflower salad with barbecue chicken and honey", "url": "www_bbc_co_uk_food_recipes_cauliflower_salad_with_90691", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_salad_with_90691_16x9.jpg", "ingredients": ["4 chicken breasts, cut in half lengthways", "2 tbsp olive oil", "8 sprigs fresh thyme, leaves only", "4 ripe tomatoes, cut in half horizontally", "3 tbsp clear honey", "1 large cauliflower, core removed, broken into florets", "250ml/9fl oz maple syrup", "6 tbsp white wine vinegar", "1 heaped tsp curry powder", "75g/2½oz shelled pistachio nuts, roughly chopped", "75g/2½oz toasted flaked almonds", "4 spring onions, trimmed, sliced", "3 tbsp chopped fresh mint leaves", "3 tbsp chopped fresh coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Thirty minutes before you want to eat, prepare your barbecue: allow the flames to flare up and die down until the coals are just glowing. ", "Meanwhile, rub the chicken-breast pieces in half of the oil and season, to taste, with salt and freshly ground black pepper. Add half of the thyme leaves and mix well.", "When the barbecue is ready, place the chicken pieces, skin-side down, onto the barbecue and grill for 8-10 minutes on each side, or until golden-brown and cooked through. (The chicken is cooked through if the juices run clear when a skewer is inserted into the centre of the meat.)", "Place the tomato halves, cut-side down, on a sheet of aluminium foil. Fold up the edges of the foil to make a tray, then drizzle over the remaining oil and the honey. Sprinkle over the remaining thyme and season, to taste, with salt and freshly ground black pepper.", "Place the foil tray on the barbecue grill, alongside the chicken, and grill for 12-15 minutes, or until the tomatoes have softened and blackened slightly.", "Meanwhile, blend the cauliflower florets to crumbs in a food processor, then transfer to a large bowl. ", "Heat a frying pan over a medium heat. When hot, add the maple syrup, vinegar and curry powder, stir well, and cook for 1-2 minutes, or until heated through.", "Add the maple syrup mixture to the cauliflower, then add the pistachios, almonds, spring onions and herbs and stir until well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, pile the cauliflower salad onto a large serving platter and top with the barbecued chicken pieces and the grilled tomatoes. Drizzle over the juices left in the tomato tray."]}, {"isVegetarian": true, "title": "Cauliflower soup with Stilton choux", "url": "www_bbc_co_uk_food_recipes_cauliflower_soup_with_39115", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 onion, finely chopped", "1 garlic clove, finely chopped", "800g/1lb 12oz cauliflower florets, roughly chopped", "1 litre/1¾ pint vegetable stock", "250ml/9fl oz double cream", "2 tbsp reduced balsamic vinegar (or regular balsamic vinegar)", "2 tbsp extra virgin olive oil", "2 tbsp coriander cress", "125ml/4fl oz water", "50g/1¾oz butter, diced", "75g/2¾oz plain flour", "2 free-range eggs", "75g/2¾oz Stilton, crumbled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat a large pan until hot. Add the butter, onion and garlic and sauté for two minutes, or until just softened.", "Add the cauliflower and vegetable stock and bring to the boil.", "Reduce the heat and simmer for 4-6 minutes, or until the cauliflower is tender.", "Cool slightly, then place the mixture in a food blender and blitz to a purée.", "Return to the saucepan and add 200ml/7fl oz of the cream. Season with salt and freshly ground black pepper and return to the boil. ", "Simmer for a minute, then keep warm until ready to serve.", "For the stilton cheese choux, heat a deep fat fryer to 190C/375F.", "Place the water and butter in a saucepan and bring to a rolling boil for a minute.", "Remove from the heat and add the flour in one go – beating well until the mixture is smooth and comes away from the sides of the pan.", "Return to the heat for a minute or two to cook through.", "Remove from the heat again and add the eggs, one at a time, beating well between the addition of each egg.", "Add the blue cheese and mix well. Season with salt and freshly ground black pepper.", "Drop teaspoonfuls of the batter into the fryer and fry for 2-3 minutes, or until golden-brown and crisp (you may need to do this in batches).", "Drain onto kitchen paper and season with a little salt.", "To serve, ladle the soup into bowls and place a few of the Stilton cheese choux on top. Drizzle over the balsamic vinegar, the remaining double cream and olive oil. Finish with a scattering of coriander cress."]}, {"isVegetarian": true, "title": "Cauliflower cheese and roasted peppers", "url": "www_bbc_co_uk_food_recipes_cauliflowercheeseand_84897", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 red pepper, seeds removed, sliced", "200g/7oz cauliflower, blanched ", "150ml/5fl oz double cream", "150g/5oz cheddar, grated ", "1 free-range egg yolk"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan and add the red pepper. Fry for three minutes, until beginning to soften, then add the cauliflower and cook for two minutes.", "Transfer the pepper and cauliflower mixture to an ovenproof dish.", "For the cheese sauce, heat the cream and 100g/3½oz of the cheddar in a saucepan over a low heat, stirring to melt the cheese. Bring to a simmer and cook for three minutes, then remove from the heat and add the egg yolk. Stir well to combine, then pour the mixture over the cauliflower and peppers.", "Top the dish with the remaining grated cheddar and place into the preheated oven to bake for eight minutes, or until bubbling and golden brown.", "Serve in the ovenproof dish straight from the oven."]}, {"isVegetarian": false, "title": "Cauliflower cheese with salmon", "url": "www_bbc_co_uk_food_recipes_cauliflowercheesewit_83926", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflowercheesewit_83926_16x9.jpg", "ingredients": ["1 large cauliflower, cut into florets", "50g/2oz butter, plus extra for greasing", "50g/2oz plain flour", "450ml/16fl oz milk", "2 free-range egg yolks", "1 tsp English mustard", "splash of Worcestershire sauce", "salt and black pepper", "150g/5oz cooked flaked salmon", "125g/4½oz cheddar cheese, grated", "75g/3oz emmental cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Bring a large pan of salted water to the boil, then add the cauliflower and cook for two minutes.", "Drain and place in a buttered ovenproof dish.", "Place the butter and flour into a saucepan and heat to melt the butter.", "Cook, stirring for one to two minutes until lightly golden.", "Remove from the heat and gradually whisk in the milk to form a smooth sauce.", "Return to the heat and simmer for two to three minutes.", "Remove from the heat and beat in the egg yolks, mustard and Worcestershire sauce.", "Season with salt and pepper and flake the salmon into the sauce, stirring carefully.", "Pour over the cauliflower and top with the grated cheeses.", "Place in the oven and cook for 10-15 minutes, until golden brown. Serve immediately."]}, {"isVegetarian": true, "title": "Cauliflower curry", "url": "www_bbc_co_uk_food_recipes_cauliflowercurry_80942", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "¼ large onion, sliced ", "1 tsp mild curry power", "1 tsp chilli flakes ", "1 tsp cumin seeds ", "½ cauliflower, cut into florets", "hot water as needed ", "7 new potatoes, chopped into small chunks, par-boiled and drained ", "85ml/3fl oz semi-skimmed milk", "salt and freshly ground black pepper to taste ", "1 tbsp fresh coriander, chopped ", "1 tbsp fresh chives, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large frying pan over a moderate heat. Add the sliced onion and fry for 2-3 minutes, until softened. ", "Add the curry powder, chilli flakes and cumin seeds and fry for a further minute.", "Add the cauliflower florets, stir well to coat in the spices, and then add enough hot water to cover the cauliflower. Bring to the boil then lower the heat to a simmer for 8-10 minutes. ", "Add the par-boiled potatoes and cook for two minutes, or until the potatoes and cauliflower are completely cooked.", "Add the milk, season, to taste, with salt and freshly ground black pepper and heat through for one minute.", "Add the coriander and chives and stir through. ", "To serve, spoon the curry into four bowls."]}, {"isVegetarian": true, "title": "Cauliflower, egg and blue cheese gratin", "url": "www_bbc_co_uk_food_recipes_cauliflowereggandblu_84693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small cauliflower, cut into small florets", "50ml/2fl oz double cream", "50g/1¾oz blue cheese", "1 free-range egg yolk", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/400F/Gas 6.", "Place the cauliflower into a saucepan of boiling water and simmer for 3-5 minutes, or until tender, then drain and transfer to a small ovenproof dish.", "Pour the cream over the cauliflower and scatter over the blue cheese. Make a well in the middle of the mixture and place the egg yolk into the well, then season well with salt and freshly ground black pepper.", "Transfer the dish to the oven and cook for eight minutes, or until the egg has set and the cheese is bubbling. ", "To serve, remove from the oven and serve immediately."]}, {"isVegetarian": true, "title": "Cauliflower fritters with curried mayonnaise", "url": "www_bbc_co_uk_food_recipes_cauliflowerfrittersw_91594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb cauliflower, cut into florets", "1 free-range egg", "125ml/4½fl oz ice-cold water", "pinch salt", "125g/4½oz plain flour", "vegetable oil, for deep frying", "125g/4½oz ready-made mayonnaise", "1 tbsp medium curry paste", "1 tbsp chopped fresh coriander leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cauliflower fritters, bring a pan of water to the boil. Add the cauliflower florets and boil for 3-4 minutes, or until just tender. Drain well, then refresh in cold water and drain again. Set aside.", "In a bowl, beat the egg and water together. Add the salt and flour and beat until the mixture forms a smooth batter. ", "Heat the vegetable oil in a deep fat fryer set to 180C. Alternatively, pour the vegetable oil into a deep, heavy-based pan so that it reaches two-thirds of the way up the pan and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Dip the drained cauliflower florets into the batter, then carefully lower them into the hot oil, in batches if necessary. Deep fry for 3-4 mins, or until crisp and golden-brown, then carefully remove them from the oil using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with any remaining cauliflower florets.", "For the curried mayonnaise, mix the mayonnaise and curry paste together in a small bowl until well combined. ", "To serve, place a spoonful of the curried mayonnaise into the centre of each of four serving bowls. Arrange the cauliflower fritters around the curried mayonnaise. Sprinkle over the chopped coriander leaves."]}, {"isVegetarian": true, "title": "Cauliflower cheese", "url": "www_bbc_co_uk_food_recipes_cauliflower_cheese_55471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_cheese_55471_16x9.jpg", "ingredients": ["1 medium head cauliflower, broken into large florets", "40g/1½oz butter", "40g/1½oz plain flour", "400ml/14fl oz milk", "1 tsp English mustard", "100g/3½oz mature cheddar cheese, grated", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Wash the cauliflower thoroughly and place in a large saucepan of salted water. Bring to the boil and cook for 3-5 minutes, until the cauliflower is almost tender, but still fairly firm. Tip into a colander and leave to drain.", "To make the sauce, melt the butter in a medium, heavy-based pan and stir in the flour. Cook over a gentle heat for one minute. Remove the pan from the heat and gradually add the milk, a little at a time, stirring well between each addition. Return the pan to a medium heat and bring the mixture to the boil, stirring constantly. Simmer for two minutes, then remove from the heat.", "Stir in the mustard and two thirds of the cheese and set aside. Arrange the cauliflower in and ovenproof baking dish. Carefully pour over the sauce, ensuring the cauliflower is completely covered. Scatter over the remaining cheese and bake for 25-30 minutes, until the top is golden-brown and bubbling. "]}, {"isVegetarian": true, "title": "Cauliflower mash", "url": "www_bbc_co_uk_food_recipes_cauliflowermash_76888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter ", "½ onion, thinly sliced", "1 cauliflower, cut into florets ", "100g/3½oz mature cheddar, grated", "75ml/2½fl oz double cream", "salt and freshly ground white pepper ", "pinch nutmeg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan. Add the onion and sweat for 1-2 minutes until softened.", "Add the cauliflower and enough water to just cover the ingredients. Stir to combine, bring to the boil and reduce to a simmer for 8-10 minutes or until tender.", "Drain through a colander and place the cauliflower mixture in a food processor.", "Add the cheese and cream and blend until you have a thick puree.", "Season with salt, freshly ground white pepper and pinch of nutmeg."]}, {"isVegetarian": true, "title": "Cauliflower soup", "url": "www_bbc_co_uk_food_recipes_cauliflowersoupwithc_90939", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflowersoupwithc_90939_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 tsp ground cumin", "1 tsp ground coriander", "800g/1¾lb cauliflower florets, roughly chopped", "1 litre/1¾ pints chicken or vegetable stock", "150ml/5fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cauliflower soup, heat the oil in a deep, heavy-based pan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, or until just softened.", "Add the ground cumin and ground coriander and fry for a further 1-2 minutes, or until fragrant.", "Add the chopped cauliflower and chicken stock. Bring the mixture to the boil, then reduce the heat and simmer for 8-12 minutes, or until the cauliflower is tender. Remove from the heat and set aside to cool.", "Carefully pour the soup mixture into a food processor and blend to a purée (or alternatively, use a stick blender in the saucepan). Return the puréed soup mixture to the pan and add the cream. Season, to taste, with salt and freshly ground black pepper and warm through for 1-2 minutes.", "To serve, divide the cauliflower soup equally among four serving bowls. Serve with crusty bread and butter."]}, {"isVegetarian": false, "title": "Cawl", "url": "www_bbc_co_uk_food_recipes_cawl_92334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz neck of lamb (on the bone), preferably Welsh, cut into serving pieces", "2 litres/3 pints 10½fl oz lamb stock", "225g/8oz potatoes, peeled and chopped", "225g/8oz onions, peeled and chopped", "225g/8oz leeks, trimmed and sliced into 1cm/½in slices", "225g/8oz carrots, peeled and chopped", "225g/8oz swede, peeled and chopped"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Place the lamb into a large pan and pour over the stock. Bring the liquid to the boil, then reduce the heat until it is simmering and continue to simmer for one hour.", "Add the chopped vegetables and continue to cook for a further hour. Remove from the heat, cover and set aside to cool overnight.", "When you are ready to serve the stew, return the mixture to the boil and continue to boil for 15 minutes, or until completely heated through.", "To serve, divide the cawl equally among four to six serving plates. Serve with crusty bread and Welsh cheese."]}, {"isVegetarian": true, "title": "Mary Berry's classic fruit cake", "url": "www_bbc_co_uk_food_recipes_celebration_cake_61952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz currants", "225g/8oz sultanas", "225g/8oz raisins", "175g/6oz glacé cherries, rinsed, dried and quartered", "175g/6oz ready-to-eat dried apricots, snipped into pieces", "75g/3oz mixed candied peel, finely chopped", "4 tbsp brandy, plus extra brandy for 'feeding' the cake", "275g/10 oz plain flour", "½ tsp grated nutmeg", "¾ tsp ground mixed spice", "400g/14oz butter, softened", "400g/14oz dark muscovado sugar", "5 free-range eggs", "65g/2½oz whole almonds, chopped (skins left on)", "1 tbsp black treacle", "1 lemon, grated zest only", " 1 orange, grated zest only", "whole blanched almonds", "glacé cherries, rinsed, dried and halved"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the currants, sultanas, raisins, rinsed, dried and quartered cherries, snipped apricots and chopped mixed peel in a large bowl. Stir in the brandy, cover the bowl and leave in a cool place overnight.", "Lightly grease a 23cm/9 in deep round cake tin. Cut a strip of non-stick baking parchment to fit twice around the sides of the tin, fold the bottom edge of the strip up by about 2.5cm/1 in creasing it firmly, then open out the fold and cut slanting lines into this narrow strip at intervals. Put a circle of non-stick baking parchment into the base of the tin, lightly grease the outer edge and then fit the prepared strip of parchment with the snipped edge in the base of the tin to line the sides of the tin. Place a second circle of non-stick baking parchment in to cover the cut part of the paper.", "Preheat the oven to 140C/275F/Gas 1.", "Put the flour, grated nutmeg, mixed spice, butter, sugar, eggs, chopped almonds, black treacle and the citrus zest into a large bowl and beat well to mix thoroughly. Fold in the soaked fruits.", "Spoon the mixture into the prepared cake tin and spread out evenly with the back of a spoon. Decorate the top with the whole blanched almonds and glacé cherries, pushing them lightly into the top of the cake mixture. Cover the top of the cake loosely with a double layer of greaseproof paper. Bake in the pre-heated oven for about 4¼-4 ¾ hours, or until the cake feels firm to the touch and a skewer inserted into the centre comes out clean. Allow the cake to cool in the tin.", "When cool, pierce the cake at intervals with a fine skewer and 'feed' with a little splash of brandy. Once the cake is completely cold, leave the lining paper on the cake, wrap in a double layer of greaseproof paper and again in foil. Store in a cool, dry place for up to three months, feeding at intervals with more brandy."]}, {"isVegetarian": true, "title": "Celebration celeriac and sweet garlic pie", "url": "www_bbc_co_uk_food_recipes_celebration_celeriac_and_33665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_celeriac_and_33665_16x9.jpg", "ingredients": ["250g/9oz plain spelt flour, plus extra for dusting", "125g/4½oz cold unsalted butter, cubed", "½ tsp fine sea salt", "few sprigs each fresh rosemary, thyme and sage, leaves picked and finely chopped", "1 unwaxed lemon, finely grated zest only", "25g/1oz Cheddar, grated", "1 free-range egg yolk", "3 heads garlic, cloves separated and peeled", "olive oil", "1 tsp balsamic vinegar", "1 tbsp runny honey", "2 sprigs each fresh rosemary, thyme and sage, leaves picked and finely chopped, plus extra to garnish", "1kg/2lb 4oz celeriac, peeled, 300g/10½oz reserved, the rest cut into 2cm/¾in pieces", "220g/8oz Lancashire cheese or Cheddar, crumbled", "150g/5½oz crème fraîche", "½ lemon, juice only", "1 tbsp wholegrain mustard", "small bunch fresh parsley, chopped", "dash Worcestershire sauce", "2 free-range eggs, beaten", "salt and freshly ground black pepper"], "serves": "Serves 8–10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pastry, put the flour in a mixing bowl. Add the butter and salt and rub gently with your fingertips until the mixture resembles fine breadcrumbs. Stir through the herbs, lemon zest and Cheddar.", "Beat the egg yolk with 1 tablespoon of cold water in a bowl. Add to the flour mixture and combine until it forms a dough, adding more cold water if needed. Wrap in cling film and place in the fridge while you make the filling.", "To make the filling, put the garlic in a saucepan, cover with cold water and bring to a gentle simmer. Cook for 2–3 minutes, then drain.", "Wipe the saucepan dry. Add the garlic and 1 tablespoon of olive oil and fry over a high heat for 2 minutes. Add the vinegar and 100ml/3½fl oz water, bring to the boil and simmer gently for 10 minutes. ", "Add the honey, most of the rosemary and thyme (reserving the rest, with the sage) and a good pinch of salt. Cook over a medium heat for 5 minutes, or until most of the liquid has evaporated and the garlic is coated in a dark syrup. ", "Meanwhile, put the celeriac in a saucepan, cover with freshly boiled water and boil for 7–10 minutes, or until soft and slightly translucent. Drain and tip into a big mixing bowl.", "Add the cheeses, crème fraiche, lemon juice, mustard, parsley, Worcestershire sauce and eggs. Add a good pinch of salt and grind of pepper and gently fold in the garlic.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Sprinkle flour onto a clean work surface and roll out the pastry to 3-4mm thick. Line a 20cm/8in round cake tin with the pastry, ensuring a little spills over the edges. Pour the filling into the pastry case. Coarsely grate the reserved celeriac and pile it on top. Finish with the reserved rosemary, thyme, sage and a drizzle of olive oil.", "Bake for 45 minutes, or until the tart filling has set and the top is golden brown. Leave to cool a little, then take it out of the tin. Serve warm with a few herbs sprinkled over. "]}, {"isVegetarian": true, "title": "Celebration chocolate mousse cake", "url": "www_bbc_co_uk_food_recipes_celebration_chocolate_26103", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_chocolate_26103_16x9.jpg", "ingredients": ["25g/1oz cocoa powder, plus extra for dusting", "3 tbsp boiling water", "100g/3½oz caster sugar", "100g/3½oz self-raising flour", "1 level tsp baking powder", "2 large free-range eggs", "100g/3½oz margarine, plus extra for greasing", "2 tbsp brandy", "300g/11oz plain chocolate (no more than 40-50 per cent cocoa solids), broken into squares", "450ml/16fl oz whipping cream", "225g/8oz fresh raspberries and blueberries", "double cream", "icing sugar, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease the tin with margarine and line the base and sides with baking paper. You need to line the tin right to the top even though the sponge will not fill it.", "For the chocolate cake, measure the cocoa powder into a large bowl. Pour over the boiling water and mix to a paste with a spatula. Add the rest of the dry ingredients and the eggs and margarine and beat until smooth using a hand-held mixer. ", "Spoon the cake mixture into the prepared cake tin and level the surface with a palette knife. Bake in the oven for 20-25 minutes, or until a skewer inserted into the centre of the cake comes out clean and the cake feels springy to the touch.", "While the cake is still hot, brush the brandy over the top of the cake. Leave the cake to cool in the tin. ", "Meanwhile, for the mousse, place the chocolate in a bowl and melt over a pan of gently simmering water (do not allow the base of the bowl to touch the water). Stir continuously, taking care not to let the chocolate get too hot. Set aside to cool a little.", "Whip the cream until soft peaks form when the whisk is removed. Carefully fold in the melted chocolate until smooth and not streaky. ", "When the cake has cooled, and while it is still in the tin, spoon the chocolate mousse on top and level with a palette knife. Cover the cake tin with cling film and chill in the fridge for a minimum of 4 hours, and preferably overnight, until the mousse is firm.", "To serve, carefully remove the cake from the tin and transfer it to a flat plate. Dust the top with cocoa powder, then pile the raspberries and blueberries into the centre. Finish with a light dusting of icing sugar. Cut into wedges and serve with pouring cream."]}, {"isVegetarian": true, "title": "Celebration chocolate cake", "url": "www_bbc_co_uk_food_recipes_celebration_chocolate_18175", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_chocolate_18175_16x9.jpg", "ingredients": ["190g/6½oz self-raising flour", "150g/5oz caster sugar", "2 level tbsp cocoa powder", "1 level tsp bicarbonate of soda", "1 level tsp baking powder", "2 tbsp golden syrup", "2 free-range eggs", "150ml/¼ pint sunflower oil", "150ml¼ pint milk", "200g/7oz white chocolate ", "150ml/¼ pint double cream", "1 x 125g/4½oz tub full-fat cream cheese"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 180C/350F/Gas 4 and grease and line with greased greaseproof paper the bases of two 20cm/8in straight-sided loose bottomed sandwich tins.", "Sift the dry ingredients into a large bowl and make a well in the centre. Add the syrup, eggs, oil and milk, mix with an electric hand whisk and pour into the tins.  ", "Bake in the oven for 25-30 minutes, or until the cakes springs back when lightly pressed with your fingertips. Turn out on a wire rack, remove the paper and leave to cool.", "For the icing, break the white chocolate into a bowl. Heat the double cream in a pan, until very hot but not boiling and pour the hot cream over the white chocolate to melt it. Stir until melted and set aside to cool.  ", "Spoon the cream cheese into a bowl then gradually add the white chocolate mixture and stir until combined. Set aside to cool a little, until thick enough to ice.", "Spread half of the icing on one cake, sit the other cake on top and spread the remaining icing on top to give a pretty finish. "]}, {"isVegetarian": true, "title": "Celebration cornet cake", "url": "www_bbc_co_uk_food_recipes_celebration_cornet_cake_49654", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 egg ", "2 tbsp vegetable oil ", "2 tbsp milk ", "½ tsp vanilla extract ", "12 fresh raspberries ", "60g/2oz self-raising flour ", "1 tbsp caster sugar ", "3 flat-bottomed ice cream cones"], "serves": "Makes 3 cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash your hands and put on an apron. Weigh and measure all the ingredients. Ask a grown-up to preheat the oven to 200C/400F/Gas 5.  ", "Break the egg gently into a cup. Then separate the egg by making a claw shape with one hand and hold it over a bowl. Then pour the whole egg into your hand and catch the yolk, letting the white drip down into the bowl. (You can put the yolk aside for another recipe.)  ", "Whisk the egg white with a fork to make some bubbles. Add the oil and milk and mix again.   Add the vanilla extract.", "Take six raspberries and put them to one side. Put the remaining raspberries into the egg white mixture – you can crush them a little to make the mixture go pink.", "In another mixing bowl, stir together the self-raising flour and sugar.", "Tip the wet ingredients into the flour mixture and stir until completely mixed. The mixture will be quite wet.", "Put the ice cream cones into a 500g loaf tin so they stand up straight. Add a raspberry to the bottom of each cornet. Divide the cake batter equally among the ice cream cones using two spoons – one to scoop it up and one to push it in. Now add one raspberry on the top of each as decoration. Ask a grown-up to put them in the oven for 20-25 minutes. Leave to cool. Serve the cakes with extra fresh raspberries."]}, {"isVegetarian": false, "title": "Celeriac and apple soup with bacon and parsley", "url": "www_bbc_co_uk_food_recipes_celeriac_and_apple_soup_32322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriac_and_apple_soup_32322_16x9.jpg", "ingredients": ["500g/1lb 2oz (roughly 3) eating apples", "50g/1¾oz butter", "1 tbsp sunflower oil", "2 onions, chopped", "1 celeriac (roughly 750g/1lb 10oz), cut into roughly 2cm/¾in chunks", "1 large carrot (roughly 120g/4½oz), cut into roughly 1.5cm/½in slices", "2 garlic cloves, crushed", "2 medium potatoes (roughly 250g/9oz), peeled and cut into roughly 2cm/¾in chunks", "1 small bunch fresh thyme (3-4 sprigs)", "1 bay leaf", "1.3 litres/2¼ pints vegetable or chicken stock, made with 1 stock cube", "flaked sea salt and freshly ground black pepper", "1 tsp sunflower oil", "4 rashers rindless smoked streaky bacon", "4 tbsp crème fraîche", "2 tbsp milk", "small handful flat leaf parsley, leaves roughly torn"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the apples, cut them into quarters and remove the cores. Cut the apples into thick slices. Melt 25g/1oz of the butter in a large saucepan and fry the apple pieces over a medium heat for five minutes, or until lightly browned, turning regularly. Using a slotted spoon, transfer the apple pieces to a plate and return the pan to the heat.", "Add the remaining butter and oil to the pan and as soon as the butter melts, gently fry the onions, celeriac and carrot for 15 minutes, or until the onions are softened and very lightly browned, stirring occasionally. Add the garlic, apples, potatoes, thyme and bay leaf and cook for three minutes more, stirring.", "Pour the stock into the pan, season with black pepper and bring to the boil. Reduce the heat to a simmer and cook for about 25 minutes, or until the celeriac and carrots are very soft, stirring occasionally.", "Remove the pan from the heat. Remove the thyme stalks and bay leaf and discard. Cool slightly and then blend the soup with a stick blender until very smooth. (For an even more velvety soup, pass it through a fine sieve into a clean bowl.) Add a little extra water if necessary until the right consistency is reached. Alternatively, allow the soup to cool for a while and then blend in a food processor until smooth and return to the pan.", "Adjust the seasoning with salt and pepper to taste. Set aside until ready to serve.", "To make the garnish, brush the oil over the inside of a small non-stick frying pan and fry the bacon for 2-3 minutes on each side over a medium-high heat until browned and crisp. Drain on kitchen paper. ", "Mix the crème fraîche with the milk in a small bowl until smooth.", "Reheat the soup gently just before serving, stirring constantly. Ladle into warmed bowls. ", "Drizzle the crème fraîche mixture into each bowl of soup. Carefully snip the crisp bacon into pieces with kitchen scissors and scatter on top. Sprinkle with the parsley, season with a little freshly ground black pepper and serve."]}, {"isVegetarian": true, "title": "Celeriac remoulade", "url": "www_bbc_co_uk_food_recipes_celeriac_remoulade_65265", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriac_remoulade_65265_16x9.jpg", "ingredients": ["650g/1lb 7oz celeriac, peeled and sliced into thin matchsticks (see tip) ", "1 lemon, juice only", "6 tbsp light mayonnaise", "1 tbsp Dijon mustard", "½ lemon, juice only", "pinch of sugar", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the celeriac in a bowl and cover with approximately 100ml/3½fl oz cold water. Add the lemon juice. Toss well to prevent it going brown. ", "Mix all the dressing ingredients together and season with salt and pepper. ", "Drain the celeriac, toss in the dressing and leave to soften for 30 minutes before serving."]}, {"isVegetarian": true, "title": "Celeriac ribbons with chard, garlic and pumpkin seeds", "url": "www_bbc_co_uk_food_recipes_celeriac_ribbons_with_50177", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small celeriac, peeled then cut into ribbons using a vegetable peeler", "1 lemon, juice only", "40g/1½oz pumpkin seeds", "2 tbsp extra virgin olive oil", "15g/½oz butter", "4 thyme sprigs, leaves removed", "2 garlic cloves, finely chopped", "½ tsp dried chilli flakes", "1 bunch chard, stalks sliced and leaves shredded", "20g/¾oz pecorino or hard vegetarian cheese", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Squeeze most of the lemon juice into a large bowl of cold water and add the celeriac ribbons. ", "Dry-fry the pumpkin seeds in a frying pan over a medium heat until they’ve puffed up and popped. Set aside.", "Bring a large saucepan of salted water to the boil, add the celeriac and cook for 1 minute. Drain and reserve the water. ", "Heat the oil and butter in a large non-stick frying pan over a medium heat. When the butter has melted add the thyme, garlic and chilli flakes and cook for 5 minutes until fragrant and almost golden. ", "Add the chard to the pan and cook for a couple of minutes, season with salt and pepper and a squeeze of lemon juice. Turn up the heat and stir in half the cheese. Add the celeriac and a slosh of the cooking water and toss, shaking the pan until the sauce looks glossy. ", "Divide between plates, top with more cheese and serve."]}, {"isVegetarian": false, "title": "Celeriac  risotto", "url": "www_bbc_co_uk_food_recipes_celeriac_risotto_28472", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 head celeriac ", "50ml/2floz white wine vinegar, plus 1 tsp ", "500g/1lb 2oz winkles", "500ml/18floz chicken stock", "50g/1¾oz butter", "1 black truffle, finely chopped", "150g/5½oz mascarpone ", "150g/5½oz parmesan", "150ml/5fl oz reduced dark chicken stock", "1 pomelo, peeled and segmented", "1 stick celery, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Wash and peel the celeriac, reserving the peel. Rough chop 500g/1lb 2oz of the flesh and cut the rest into very small dice, about the size of grains of rice.", "Place the celeriac peel and 500ml/18fl oz water into a saucepan, bring to the boil and simmer for 30 minutes. Strain through a fine sieve and reserve the stock.", "Bring a pan of salted water to the boil, add the roughly chopped celeriac and simmer for 10-12 minutes until soft. Drain, then place into a food processor with 50ml/2fl oz of the white wine vinegar. Blend to a fine purée then pass through a fine sieve.", "Cook the winkles in boiling salted water with the teaspoon of white wine vinegar for one minute. Drain the winkles then pick them from the shell and remove the waste sack and foot. ", "Place the winkles into a saucepan and cover with the chicken stock. Bring to a simmer and cook for 45 minutes. ", "Heat a non-stick frying pan until medium hot, add the butter and celeriac dice and cook gently for one minute. Add a little of the celeriac stock at a time, as if making a risotto, and when the stock is absorbed add some more, until the celeriac is just tender, this should take only 5-6 minutes. Add the truffle and cook for one minute. ", "Once cooked, add the mascarpone, parmesan and reduced dark chicken stock. Add the winkles and stir through.", "To serve, spoon the celeriac purée into the base of a soup plate. Spoon the 'risotto' over the top. Scatter the pomelo segments over and finish with a little celery leaf."]}, {"isVegetarian": true, "title": "Celeriac and Stilton gratin", "url": "www_bbc_co_uk_food_recipes_celeriacandstiltongr_90746", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "½ celeriac, peeled and grated", "100ml/3½fl oz double cream", "55g/2oz Stilton cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the olive oil and butter together in a pan and gently fry the celeriac for 4-5 minutes, or until beginning to brown. Stir in the cream and cheese, then transfer to an ovenproof gratin dish. Bake in the oven for 10-12 minutes, or until golden-brown on top and bubbling."]}, {"isVegetarian": true, "title": "Celeriac and potato boulangere", "url": "www_bbc_co_uk_food_recipes_celeriacandpotatobou_77525", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, plus extra for greasing ", "2 onions, finely sliced", "1 celeriac, cut into 0.5cm/½in thick slices", "500g/1lb 1oz potatoes, cut into 0.5cm/½in thick slices", "600ml/1 pint 1 fl oz hot chicken stock (vegetarians can substitute vegetable stock)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/450F/Gas 6.", "Heat a frying pan until hot then add half the butter and all the onions.", "Sweat for 3-4 minutes until just softened.", "Place a layer of celeriac slices  into the bottom of a buttered ovenproof dish.", "Top with a layer of onions, then potatoes, then onions again, seasoning with salt and freshly ground black pepper as you go.", "Repeat with the remaining celeriac, onions and potatoes, finishing with a layer of potatoes.", "Dot with the remaining butter.", "Pour over the hot stock so all the layers are covered.", "Transfer to the oven and cook for 45-60 minutes, checking occasionally to make sure the stock hasn't completely evaporated, and pressing the layers down with the back of a spoon.", "Bake until nearly all the stock is absorbed and the top layer is golden brown.", "Serve."]}, {"isVegetarian": true, "title": "Celeriac dauphinoise", "url": "www_bbc_co_uk_food_recipes_celeriacdauphinoise_84618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small celeriac, peeled and very thinly sliced", "1 tbsp olive oil", "½ tsp freshly grated nutmeg", "150ml/5fl oz milk", "150ml/5fl oz double cream", "1 clove garlic, finely chopped", "salt and freshly ground black pepper", "75g/2½oz Shropshire blue cheese, crumbled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place all the ingredients except the cheese into a large saucepan and heat until the mixture begins to boil. ", "Pour the mixture into a small buttered gratin dish.  Add the cheese to the top of the mixture and bake in the oven for 15 minutes or until bubbling, golden-brown on top and the celeriac is soft.", "To serve, remove from the oven and spoon the gratin onto a clean plate."]}, {"isVegetarian": false, "title": "Celeriac remoulade with homemade mayonnaise", "url": "www_bbc_co_uk_food_recipes_celeriacremouladewit_71405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 egg yolks", "2 tsp white wine vinegar", "1 tsp Dijon mustard", "salt", "freshly ground black pepper", "300ml/10fl oz vegetable oil ", "½ celeriac, peeled and grated", "1 lemon, juice only", "1 tbsp Dijon mustard", "handful fresh flatleaf parsley, chopped", "salt", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mayonnaise, place all the ingredients, except the oil, into a food processor and blend until pale and creamy. ", "With the motor running, pour in enough oil, in a steady stream, until the mayonnaise is thick.", "For the Remoulade, place the celeriac, lemon juice, mustard, seasoning and parsley into a large bowl. ", "Mix together well and stir in the home-made mayonnaise. Season to taste.", "Mix to combine and serve."]}]