[{"ingredients": ["80g / 3oz de mantequilla, derretida y enfriada, más extra para engrasar", "Pastelería filo comprada en tienda de 270 g / 10 oz", "4 cucharadas de mermelada de albaricoque", "500g / 1lb 2oz de yogur griego bajo en grasa (sin grasa)", "2 cucharadas de miel", "1 vaina de vainilla, solo semillas (o alternativamente 2 gotas de extracto de vainilla)", "racimo pequeño uvas negras sin semillas, cortadas a la mitad", "manojo de grosellas rojas", "1 fruta de dragón, pelada y en cubos", "2 higos grandes, descuartizados"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 con el estante del medio listo. Engrase bien una lata para muffins de 12 hoyos o una lata de cupcakes.", "Corte la masa filo en cuadrados que sean lo suficientemente grandes como para caber en los agujeros del panecillo y cuelgue un poco sobre los lados. Cepille cada pieza de filo con mucha mantequilla derretida para evitar que se queme en el horno, luego empuje un cuadrado filo en ocho de los agujeros y cubra con otro filo cuadrado, tendrá que colocar capas de 3-4 piezas.", "Coloque las cajas de filo en el horno durante cinco minutos más o menos, dándoles tiempo para crujir. Una vez que se vean dorados y crujientes, quítelos del horno y déjelos enfriar durante 10 minutos más o menos. Quítelos de la bandeja del muffin y colóquelos en platos para servir. ¡Siempre tiendo a romper al menos uno cuando los saco!", "Coloque el atasco en una olla pequeña y caliente suavemente hasta que esté tibia.", "Mezcle el yogur griego, la miel y la vainilla en un bol, luego coloque una buena cucharada en cada caja de repostería. Divida la fruta entre las tartaletas, amontonándola en alto. Cepille con la mermelada de albaricoque caliente para hacer un glaseado brillante y sirva."], "url": "www_bbc_co_uk_food_recipes_the_skinny_tart_74715", "title": "La tarta flaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8 tartas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/the_skinny_tart_74715_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de hojas de albahaca", "50g / 1¾oz de piñones tostados", "50g / 1¾oz de queso parmesano, rallado", "2 dientes de ajo", "75-125ml / 2½-4fl oz de aceite de oliva virgen extra", "2 jarras de pimientos rojos asados", "2 pimientos amarillos", "2 pimientos verdes", "400g / 14oz de tomates de herencia, rebanados", "2 cucharadas de aceite de oliva", "1 calabacín en rodajas", "1 cebolla roja grande, pelada y cortada en cuñas", "200g / 7oz de queso duro. rebanado", "1 pan de pan redondo grande (aproximadamente 23 cm / 9 pulgadas de ancho)", "sal y pimienta negra recién molida"], "method": ["Para el pesto, coloque todos los ingredientes excepto el aceite en un procesador de alimentos y mezcle. Poco a poco agregue el aceite hasta que tenga una pasta espesa, y deje de lado.", "Para el emparedado, coloque los pimientos rojos y amarillos directamente sobre una llama de gas y siga girando hasta que todo se vuelva negro. Retire de la placa y coloque en un recipiente, cúbralo con una película adhesiva y déjelo a un lado. Una vez que se enfríe lo suficiente como para manipularlo, retire la piel negra y corte la carne en cuartos, quitando las semillas.", "Calentar una sartén y rociar los calabacines en rodajas con aceite de oliva. Coloque en la plancha hasta que esté carbonizado en ambos lados.", "Rebana la parte superior de la barra de pan. Ahueca el pan sacando el pan suave, dejando 3 cm / 1 ¼ de pan alrededor del borde.", "Llene el pan hueco con capas de pimientos, tomates, calabacines, cebolla roja, queso y pesto, sazonándolo entre cada capa.", "Vuelva a colocar la tapa del pan y empuje hacia abajo, puede envolverlo en una película adhesiva y dejarlo toda la noche o cortar de inmediato."], "url": "www_bbc_co_uk_food_recipes_the_ultimate_cheese_and_25145", "title": "El mejor sándwich de queso y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "8 huevos de gallinas camperas", "600 ml / 20 fl oz de leche", "sal marina y pimienta negra recién molida", "1 coliflor, cortada en grandes floretes", "300g / 10½oz de judías verdes, recortadas", "1 brócoli, cortado en grandes floretes", "8 zanahorias, peladas y cortadas en porras", "2.75kg / 6lb 2oz solomillo de ternera entero, grasa y tendones recortados", "Goteo o manteca de cerdo de 250 g / 9 oz", "200ml / 7fl oz de vino tinto", "1 litro / 1¾ pintas de caldo de carne", "2 kg / 4 libras 8 onzas grandes de harina de papas como el Rey Eduardo, cada una pelada y cortada en 2 o 3 piezas", "200g / 7oz de lonchas de tocino ahumado, cortadas en lardons", "500 g / 1 lb 2 oz de coles de Bruselas, cortadas y finamente trituradas", "250 g / 9 oz de castañas cocidas, más o menos picadas", "175g / 6oz de mantequilla"], "method": ["Primero prepare la mezcla de budín de Yorkshire. Vierta la harina en un tazón grande. Haga un pozo en el centro, luego mezcle los huevos uno a la vez, trayendo la harina del interior del pozo mientras lo hace.", "Poco a poco bata la leche hasta que la mezcla esté suave y bien combinada. Sazone con sal y pimienta, luego cubra el recipiente y enfríe en la nevera durante la noche.", "También puede preparar las verduras con un día de anticipación. Llevar a ebullición una sartén grande de agua salada. Prepare un tazón grande de agua helada. Agregue las flores de coliflor al agua hirviendo y deje hervir durante 4-5 minutos, o hasta que estén perfectamente tiernas. Retira de la sartén con una espumadera y sumérgete en el cuenco con agua helada. Déjelo a un lado hasta que los flósculos se hayan enfriado (esto evitará que continúen cocinando). Escurrir, transferir a una bandeja de tostado y reservar.", "Repita el proceso con las judías verdes, hirviendo a fuego lento durante solo 2-3 minutos. Agregue los frijoles drenados y enfriados a la bandeja.", "Repita el proceso con las flores de brócoli, hirviendo a fuego lento durante 1-2 minutos. Agregue el brócoli drenado y enfriado a la bandeja.", "Repita el proceso con los bastones de zanahoria, hirviendo a fuego lento durante 6-7 minutos. Agregue la zanahoria drenada y enfriada a la bandeja.", "Esto asegurará que tenga todas las verduras preparadas y perfectamente cocinadas, listas para recalentarse en el día. Enfríe todas las verduras, cubiertas, en la bandeja de asar (o en una bolsa de alimentos o en un recipiente de plástico) hasta que las necesite.", "El día de Navidad, prepare la carne. Precalentar el horno a 200C / 180C Fan / Gas 6.", "Calce la grasa de la carne en un patrón entrecruzado con un cuchillo afilado, luego sazone la carne generosamente con sal y pimienta.", "Calentar una sartén a fuego alto. Cuando la sartén esté muy caliente, agregue 25 g / 1 oz del goteo de la carne y, cuando se haya derretido, fría la carne por todos lados hasta que se dore por todas partes.", "Coloque la unión de la carne de res, con el lado graso hacia abajo, en una bandeja de asar y tueste durante 45-50 minutos (por poco) o más hasta que esté cocido a su gusto, aunque tenga en cuenta que la carne continuará cocinando mientras descansa. Gire la junta de carne a la mitad del tiempo de cocción. Cuando la carne esté cocida a su gusto, transfiérala a un plato grande, cúbrala con papel de aluminio y déjela reposar durante 30 minutos.", "Mientras tanto, para la salsa, devuelva la sartén que contiene los jugos de carne a fuego medio y, cuando esté caliente, agregue el vino. Deje que la mezcla hierva a fuego lento y continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo de carne y vuelva a hervir a fuego lento, hirviendo a fuego lento hasta que el volumen del líquido se haya reducido en un tercio, luego sazone con sal y pimienta. Cuela la salsa en una jarra o en un bote de salsa. Cúbralo y manténgalo caliente hasta que lo necesite (puede que necesite recalentarlo antes de servirlo).", "Luego, prepara las papas asadas. Coloque las papas en una olla grande, cubra con agua fría, agregue una pizca de sal y deje hervir. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento las papas durante 3-4 minutos. Escurra las papas con un colador y sacúdalas un poco en el colador para endurecer los bordes. Dejar de lado.", "Cuando la carne de res tenga solo 35 minutos para cocinar, ponga 100 g / 3½ oz del resto de la carne goteando o manteca de cerdo en una bandeja de asar de lados profundos. Caliente la grasa en el horno durante 5 minutos o hasta que esté caliente.", "Con cuidado agregue las papas cocidas y escurridas a la grasa caliente, asegurándose de mantener la cara lo más lejos posible de la bandeja de asar en caso de que la grasa escupe. Sazone las papas con sal marina, luego devuelva la bandeja de asar al horno. Ase las papas con la carne durante 30 minutos o hasta que comiencen a ponerse doradas y crujientes.", "Voltee las papas una vez que retire la carne del horno, luego aumente la temperatura del horno a 220C / 200C Fan / Gas 7 y tueste las papas por otros 30 minutos.", "Tan pronto como haya volteado las papas, divida 100 g / 3¾oz del goteo restante o manteca de cerdo por igual entre los orificios de dos latas de muffin de 12 hoyos o latas de pudín de Yorkshire. Caliente la grasa en el horno durante 10 minutos o hasta que esté caliente.", "Mientras tanto, transfiere la masa de budín de Yorkshire a una jarra. Con cuidado, vierta la mezcla de budín de Yorkshire en las latas, llenando cada hoyo dos tercios lleno. Hornee los budines de Yorkshire en el horno con las papas asadas durante los últimos 20 minutos que las papas deben quedar para cocinar, asegurándose de no volver a abrir la puerta del horno.", "Después de 20 minutos, abra ligeramente la puerta del horno para permitir que escape el vapor. Retire las papas, que deben estar listas ahora (pínchelas con un cuchillo afilado para comprobar que estén tiernas en el medio). Transfiera a un plato de servir y manténgalo caliente.", "Reduzca la temperatura del horno a 190 ° C / 170 ° Ventilador / Gas 5. Continúe cocinando los budines de Yorkshire a esta temperatura por otros 12-15 minutos, o hasta que estén crujientes, elevados y dorados. Transfiera a un plato de servir y manténgalo caliente.", "Para las coles de Bruselas, caliente el resto del goteo o manteca en una sartén grande a fuego medio. Agregue el tocino y fría por 3-4 minutos, o hasta que esté crujiente y dorado.", "Agregue los brotes y saltee por 2-3 minutos, o hasta que estén marchitos. Agregue las castañas picadas, la mitad de la mantequilla y 2 cucharadas de agua, luego saltee hasta que las castañas se hayan calentado y el líquido se haya evaporado. Condimentar con sal y pimienta. Retirar del fuego y mantener caliente.", "Finalmente, ponga a hervir una cacerola grande de agua con sal, agregue todas las verduras blanqueadas y cocine a fuego lento durante 30 segundos o hasta que se caliente. Escurrir bien y transferir a un plato de servir, salpicado con la mantequilla restante.", "Sirva la carne en un plato, rodeado por las papas asadas en un lado y las coles de Bruselas en el otro. Sirva las verduras en un plato aparte y la salsa en un bote de salsa."], "url": "www_bbc_co_uk_food_recipes_the_ultimate_christmas_34876", "title": "La última carne asada de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/the_ultimate_christmas_34876_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patatas grandes, preferiblemente Maris Piper", "aceite de girasol, para freír", "sal marina copos", "vinagre de malta"], "method": ["Pele las papas y córtelas longitudinalmente en rodajas de aproximadamente 1cm / ½. Corte cada rebanada en trozos bastante gruesos y enjuague en un colador con abundante agua fría para eliminar el exceso de almidón. (Si tiene tiempo, vale la pena dejar que las virutas se empapen en un recipiente con agua fría durante varias horas, o durante la noche). Seque con papel de cocina.", "Caliente una cacerola profunda de fondo grueso medio llena del aceite de girasol a 130ºC. Es importante usar un termómetro de cocina y verificar la temperatura regularmente. Alternativamente, use una freidora eléctrica de alta grasa calentada a 130 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Usando una cuchara grande ranurada de metal, baje suavemente la mitad de las virutas en el aceite caliente y revuelva con cuidado. Freír durante diez minutos, o hasta que esté cocido pero no dorado.", "Retire las virutas de la sartén con una espumadera y déjelas a un lado para que drene un montón de papel de cocina. Repita el proceso con las fichas restantes. (Las fichas se pueden dejar durante varias horas en esta etapa).", "Cuando esté listo para servir, recaliente el aceite a 190C. Con una cuchara ranurada, baje suavemente todas las papas fritas a la sartén y cocine durante 4-5 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Incline en un plato para servir y espolvoree con sal y vinagre para servir."], "url": "www_bbc_co_uk_food_recipes_thebestchipsyouhavee_93121", "title": "Las mejores papas fritas que jamás hayas probado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thebestchipsyouhavee_93121_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza entera de ajo", "Crema doble 500ml / 18fl oz", "pizca de sal", "puñado de perejil, finamente picado", "5 cucharadas de aceite de oliva virgen extra", "1 baguette grande, cortado longitudinalmente en cuatro piezas"], "method": ["Precalentar el horno a 170C / 340F / Gas 3½", "Envuelva todo el bulbo de ajo en papel de aluminio y colóquelo en una bandeja en el horno. Asar durante 40-45 minutos, o hasta que estén blandos.", "Cuando el ajo esté lo suficientemente frío como para manipularlo, corte la parte superior de la bombilla. Exprime todos los suaves dientes de ajo y pica finamente.", "Vierta la crema doble en el recipiente de una batidora independiente y bata durante 3-5 minutos, o hasta que la mezcla se convierta en grumos de grasa sólida con una base líquida.", "Alinee un colador con una tela de muselina limpia y colóquelo sobre un recipiente. Incline la mezcla en el colador y envuelva la muselina alrededor de la crema. Exprime todo el líquido para que tengas una masa sólida de mantequilla en la muselina, luego descarta el líquido.", "Incline la mantequilla en un recipiente, agregue el ajo picado y una generosa pizca de sal. Agregue el perejil picado y mezcle una vez más.", "Caliente una sartén grande de la plancha y cepille el pan con aceite. Coloque en la sartén de la plancha y cocine cada lado durante 1-2 minutos.", "Extienda el pan con la mantequilla de ajo y sirva."], "url": "www_bbc_co_uk_food_recipes_the_ultimate_garlic_23043", "title": "El último pan de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 grosellas", "2 cucharaditas de azúcar blanco", "50ml / 2fl oz de ginebra", "25 ml / 1 fl oz de flor de saúco cordial", "1 cucharada de jugo de lima", "limonada nublada tradicional, para recargar", "grosellas y flores de saúco frescas, para adornar"], "method": ["En un vaso de whisky o Boston, machaque (mezcle) las grosellas con el azúcar utilizando el extremo de un rodillo limpio.", "Agregue la ginebra, el flor de saúco y el jugo de lima. Agite bien, luego cuele en un vaso alto lleno de hielo. Rellene con limonada y decore con algunas grosellas frescas y flores de saúco."], "url": "www_bbc_co_uk_food_recipes_theelizabeth_86502", "title": "Elizabeth", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 patatas gordas y harinosas (Maris Piper, King Edward o Marfona son buenos panaderos)", "aceite de oliva", "sal marina copos", "2 filetes de caballa o trucha ahumados", "1 cucharada de perejil fresco o cebollín picado", "2 puñados de queso cheddar maduro rallado", "1 cucharadita de salsa de rábano picante o mostaza inglesa", "2 grandes perillas de mantequilla", "sal marina y pimienta negra recién molida", "150g / 5oz de queso crema", "1 cucharada de pasta de curry media", "4 cebolletas o ½ cebolla roja pequeña picada", "Pepino de 2.5cm / 1 en pieza, picado en dados", "1-2 tomates maduros, picados", "pequeño puñado de menta fresca picada o hojas de cilantro", "un buen apretón de jugo de limón o lima", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Lave bien las papas, séquelas y pinche varias veces con un tenedor. Vierta un poco de aceite de oliva en sus manos y frote sobre las papas, luego espolvoree un poco de sal marina que debe pegarse al aceite. Coloque directamente en el estante en el horno y hornee por 1¼-1½ hora, dependiendo del tamaño de la patata. Cuando se cocina, la papa debe ser dorada y crujiente por fuera y dar un poco cuando se la aprieta. Servir abierto con abundante mantequilla salada o probar uno de los rellenos a continuación.", "Para el relleno de trucha ahumada gratinada, precaliente la parrilla a fuego medio-alto.", "Separe las papas al horno por la mitad y saque la mayor parte de la carne esponjosa con un tenedor en un recipiente. Agrégale las truchas y agrega el perejil o el cebollín, las tres cuartas partes del queso, el rábano picante o la mostaza y la mantequilla y revuelve con la carne de patata hasta que se combinen. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Vuelva a colocar la cuchara en la piel de las patatas, siéntese en una bandeja para hornear y esparza sobre el queso restante. Ase a la parrilla hasta que el queso esté burbujeante y dorado pálido.", "Para el aderezo de queso crema al curry, mezcle todos los ingredientes de queso crema al curry y sazone, al gusto, con sal y pimienta.", "Dividir abrir las patatas cocidas y cuchara la mezcla de queso en la parte superior: se derretirá y rezumar en la patata caliente y humeante."], "url": "www_bbc_co_uk_food_recipes_theperfectbakedpotat_67837", "title": "La papa al horno perfecta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theperfectbakedpotat_67837_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "2 cucharaditas de polvo de hornear", "1 cucharadita de sal", "125g / 4½oz de mantequilla sin sal", "2 yemas de huevo de gallinas camperas", "125ml / 4½fl oz de agua fría", "Falda de carne de 300 g / 11 oz (o filete estofado), finamente picada", "1 cucharada de harina normal", "150g / 5oz cebolla, pelada, finamente picada", "Colinabo 150g / 5oz, pelado, finamente picado", "Patata de 450g / 1lb, pelada, finamente picada", "40 g / 1½ oz de mantequilla", "1 huevo de gallinas camperas, golpeado"], "method": ["Para la masa, mezcle la harina, el polvo de hornear, la sal, la mantequilla y las yemas de huevo en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Con el motor todavía en funcionamiento, agregue gradualmente el agua en una corriente delgada hasta que la mezcla se una como masa. (Nota: es posible que no necesite usar toda el agua).", "Envuelva la masa en una película adhesiva y enfríe en la nevera durante una hora.", "Mientras tanto, para el llenado, precaliente el horno a 180C / 350F / Gas 4.", "Coloque la carne picada y la harina en un bol y mezcle hasta que la carne esté cubierta con la harina. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sazonar todas las verduras, al gusto, con sal y pimienta negra recién molida.", "Cuando la pastelería se haya enfriado, divídala en seis pedazos iguales. Extienda cada pieza de masa en una superficie de trabajo ligeramente enharinada hasta que sea más grande que el diámetro de un plato. Asegúrate de no rasgar la masa.", "Usando un plato como plantilla, recorte los bordes de cada pieza de masa para formar un disco.", "Coloque una cucharada de la papa picada en la mitad de cada disco de hojaldre, dejando 1,5 cm / ¾ in libre en los bordes.", "Con una cuchara, coloque un poco del colinabo en la parte superior de la capa de patata, luego espolvoree un poco de cebolla picada sobre la capa de colinabo. Finalmente, cuchara sobre parte de la carne.", "Cepille ligeramente los bordes de los discos de pastelería con un poco del huevo batido.", "Cubra el lado lleno de cada disco de pastelería con la otra mitad del disco de pastelería y presione los bordes junto con una horquilla para sellar.", "Cepille la parte superior de cada pasty con más huevo batido. Con un cuchillo afilado, corte una pequeña cruz en la parte superior de las empanadas a través de la cual puede escapar el vapor.", "Coloque las empanadas en una bandeja para hornear y transfiéralas al horno. Hornee durante 45-50 minutos, o hasta que la masa esté crujiente y dorada, y el relleno esté bien cocido y caliente (use un termómetro para carne para verificar la temperatura del interior).", "Cuando los pasteles estén cocidos, quítelos del horno y déjelos a un lado para que descanse de 5 a 10 minutos, luego sirva."], "url": "www_bbc_co_uk_food_recipes_thepeoplescornishpas_91837", "title": "El pastel de Cornualles de la gente", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz basmati, limpiado y remojado en agua fría durante 30 minutos", "365ml / 13fl oz de agua", "½ cucharadita de jugo de limón (opcional)"], "method": ["Escurre el arroz y colóquelo en una olla con agua fresca. Llevar a ebullición.", "Agregue el jugo de limón al agua y revuelva bien. Cubra la olla con una tapa antes de reducir el calor. Cocine a fuego lento durante 7-8 minutos", "Cuando el arroz esté cocido, quite la tapa y retire la sartén del fuego. Deje reposar el arroz durante cinco minutos para permitir que el exceso de humedad salga de la sartén.", "Para servir, esponje el arroz con un tenedor antes de colocar una cucharada en cada uno de los cuatro platos."], "url": "www_bbc_co_uk_food_recipes_theperfectbasmatiric_86574", "title": "El arroz basmati perfecto", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de hojas de té por persona", "leche (opcional)", "azúcar (opcional)"], "method": ["Vacíe el hervidor de agua previamente hervida y llénelo con agua fresca (preferiblemente filtrada). Llevar el hervidor a ebullición.", "Caliente una tetera limpia con un poco de agua justo antes de que alcance el punto de ebullición, luego gire y vierta.", "Use hojas de té en lugar de bolsas para un té con sabor fresco del tipo que usted utiliza depende de usted. Permita 1 cucharadita por persona, más uno para el bote. Asegúrate de que la olla que estás usando tenga suficiente espacio para que el té se forme en el agua.", "Vierta en el agua tan pronto como hierva, llevando la olla al hervidor para que el agua no tenga la oportunidad de enfriarse.", "Cubra la olla con un té acogedor (ya sea uno de su Granny de punto o uno de los frescos, funky disponibles ahora) y deje el té para infundir durante 3-4 minutos. Por más tiempo, arruinarás el verdadero sabor del té, haciéndolo amargo.", "Cuando esté listo, vierta el té a través de un colador de té (a menos que haya una malla adherida a su tetera) en tazas o platillos brillantes y relucientes.", "Cuando agrega la leche depende de si es una persona MIF (leche en primera) o TIF (té en primera), o tal vez lo prefiere negro, con azúcar, una rodaja de limón o una ramita de menta .", "Siéntate y disfruta"], "url": "www_bbc_co_uk_food_recipes_theperfectcuppa_67502", "title": "El cuppa perfecto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina blanca llana 450g / 1lb", "1 cucharadita de bicarbonato de soda", "1 cucharadita de crema de tártaro", "1 cucharadita de sal marina", "1 cucharadita de azúcar", "300ml / 10½fl oz de suero de leche", "2 cucharadas de mantequilla, más extra para servir", "1 kg / 2lb 3oz de puré de papas", "125g / 4½ oz de harina natural, más extra para espolvorear", "sal al gusto", "8 salchichas de ternera o cerdo", "4 tomates maduros, cortados por la mitad", "250-300 g / 9-10½ oz champiñones, limpios", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "8 rodajas de morcilla confeccionada", "8 lonchas de tocino ahumado", "8 huevos de gallinas camperas"], "method": ["Para el pan de soda, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Tamiza la harina, el bicarbonato de sodio, la crema de tártaro y la sal en un tazón grande. Agregue el azúcar hasta que esté bien combinado.", "Poco a poco agregue el suero de leche un poco a la vez, mezcle bien hasta que la mezcla se una como una masa suave. (NB: Puede que no necesite todo el suero de leche. Tenga cuidado de no trabajar en exceso la mezcla).", "Espolvorea tus manos con harina y amasa la masa muy suavemente en el tazón. Forme la masa en una bola suelta y colóquela en una bandeja para hornear enharinada. Corta una cruz profunda en la parte superior del pan con un cuchillo afilado.", "Transfiera el pan de soda al estante del medio del horno y hornee durante 30-35 minutos, o hasta que el pan se haya levantado y esté dorado y suene hueco al tocarlo en la parte inferior. (Mantenga el horno encendido después de quitar el pan).", "Mientras tanto, para las papas de las papas, derrita la mantequilla en una sartén pequeña a fuego medio o bajo. Agregue el puré de papas y la sal y revuelva bien para combinar. Dobla la harina hasta que esté bien combinada.", "Coloque la mezcla en una superficie de trabajo ligeramente enharinada y amasar ligeramente hasta que quede suave.", "Divida la mezcla por la mitad. Extiende cada mitad sobre una superficie de trabajo ligeramente enharinada hasta que forme un círculo del tamaño de un plato grande y tenga un grosor aproximado de 0.5 cm / ¼. Corta cada círculo en cuartos.", "Caliente una sartén grande y antiadherente a fuego medio hasta que esté caliente. Agregue las papas de papa, en tandas, y fríe durante 3-4 minutos en cada lado, o hasta que estén doradas por ambos lados. Mantenga caliente hasta que esté listo para servir.", "Mientras tanto, para freír, acomode las salchichas en una bandeja de asar. Transfiera al horno y tueste durante 25-30 minutos, o hasta que estén dorados y cocidos.", "Coloque las mitades de tomate, corte los lados hacia arriba, en una bandeja de asar separada con los champiñones. Rocíe una cucharada de aceite de oliva y sazone al gusto con sal y pimienta negra recién molida. Asar en el horno durante 10-15 minutos, o hasta que se ablanden.", "Mientras tanto, caliente otra cucharada de aceite de oliva en una sartén grande antiadherente a fuego medio. Agregue las rodajas de morcilla y fría por 1-2 minutos en cada lado, o hasta que estén crujientes en ambos lados. Sacar de la sartén y mantenga caliente.", "Agregue las lonjas de tocino a la misma sartén y fría por 6-8 minutos, o hasta que estén crujientes y doradas por ambos lados.", "Mientras tanto, caliente las dos cucharadas restantes de aceite de oliva en una sartén separada a fuego alto. Cuando el aceite esté caliente, agriete los huevos, en tandas si es necesario, y fría durante 1-2 minutos, o hasta que la yema se acabe de poner.", "Para servir, coloque dos papas de papa en un lado de cada plato de servir. Divida las salchichas, la morcilla, el tocino, las mitades de tomate, los champiñones y los huevos fritos entre los platos para servir, junto con las papas de las papas. Cortar el pan de soda, untar con mantequilla y servir al lado."], "url": "www_bbc_co_uk_food_recipes_theulsterfry_92143", "title": "Los alevines del Ulster", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "10g / ½ oz de mantequilla, cortada en cubitos", "sal y pimienta negra recién molida", "2 cucharaditas de aceite de oliva"], "method": ["Romper los huevos en un bol y batir con un tenedor hasta que quede suave. Agregue la mantequilla fría en cubitos.", "Sazonar los huevos con sal y pimienta negra recién molida.", "Caliente una sartén antiadherente pesada a fuego alto y agregue el aceite. Cuando el aceite esté humeando, vierta los huevos rápidamente en la sartén.", "Usando un tenedor de madera o una espátula y trabajando en un movimiento circular, mueva los huevos en la sartén alrededor, mientras que al mismo tiempo mueve la sartén hacia adelante y hacia atrás a través del calor. Permita que los huevos comiencen a coagularse.", "Deja de mover la sartén. Permita que los huevos formen una piel clara y luego retire la sartén del fuego.", "Levante la bandeja e incline la manija hacia arriba y lejos de usted. Al mismo tiempo, toque el mango de la sartén para que la tortilla se mueva hacia el extremo opuesto de la sartén.", "Usando el lado de un tenedor, dobla la tortilla hacia el centro en ambos lados para formar una forma de cigarro.", "Incline la tortilla en un plato. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_theperfectomelette_86680", "title": "La tortilla perfecta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theperfectomelette_86680_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de chocolate puro, roto en pedazos", "175g / 6oz de azúcar en polvo", "6 huevos, separados", "2 cucharadas de cacao en grano, tamizado", "300 ml / 10 fl oz doble crema", "2 naranjas, solo ralladura, finamente ralladas", "segmentos o rebanadas de naranja, empapados en Grand Marnier", "azúcar en polvo", "33cm x 23cm (13in x 9in) Estaño rollo suizo"], "method": ["Engrase sutilmente la lata y la línea suiza con pergamino para hornear antiadherente, empujándolo hacia las esquinas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Derretir el chocolate lentamente en un recipiente sobre una fuente de agua caliente. Deje que se enfríe un poco.", "Coloque el azúcar y las yemas de huevo en un tazón y bata con un batidor eléctrico a alta velocidad hasta que quede ligero y cremoso.", "Agregue el chocolate enfriado y revuelva hasta que esté bien mezclado.", "Batir las claras de huevo en un tazón grande hasta que estén firmes pero no secos.", "Agregue una cucharada grande de claras de huevo en la mezcla de chocolate, mezcle suavemente y luego doble las claras de huevo restantes, luego el cacao.", "Vierta en la lata preparada y nivele suavemente la superficie.", "Hornee en el horno precalentado durante unos 20 minutos hasta que esté firme al tacto.", "Retire el rollo del horno, déjelo en la lata y coloque una rejilla de refrigeración sobre la parte superior de la torta, teniendo cuidado de no tocar la torta.", "Coloque una toalla de té húmeda y limpia sobre la rejilla, y déjela durante varias horas o durante la noche en un lugar fresco; no se preocupe, se hundirá un poco. (Si el paño de cocina se seca, simplemente vuelva a humedecerlo).", "Batir la crema hasta que conserve su forma, y ​​agregue la ralladura de naranja.", "Espolvoree un pedazo grande de pergamino para hornear antiadherente con azúcar glas.", "Coloque el rollo sobre el papel y despegue el papel de revestimiento.", "Recorta los dos bordes largos para un acabado más inteligente (¡también te da la oportunidad de probar los adornos!).", "Extienda con la crema batida y enrolle como un rollo suizo: comience con uno de los bordes cortos, ruede apretadamente para comenzar y use el papel para ayudar. No se preocupe si se rompe, ¡eso es bastante normal y parte de su encanto!", "Sirve rebanadas con segmentos de naranja y Grand Marnier."], "url": "www_bbc_co_uk_food_recipes_theultimatechocolate_73731", "title": "El último truco de chocolate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz de papas (como King Edwards, Maris Piper o Estima)", "sal y pimienta blanca", "mantequilla, al gusto", "100g / 3½oz de queso gruyère rallado", "1 litro / 1 pinta 15fl oz de caldo de pescado", "4 cucharadas de vermut seco", "1 cebolla, más o menos picada", "1 bombilla pequeña de hinojo, sin corazón y picado", "1 zanahoria pequeña, picada", "1 pequeño palo de apio, picado", "1 hoja de laurel", "pellizcar el azafrán", "750g / 1lb 10oz de pescado blanco (como el eglefino, la merluza, la lubina o el halibut)", "Abadejo ahumado de 250 g / 9 oz", "200 g / 7 oz de salmón", "120g / 4oz de gambas crudas", "75g / 2½oz de mantequilla sin sal", "Harina normal de 75 g / 2½ oz", "150ml / 5fl oz de leche entera", "gran puñado de perejil, finamente picado", "150ml / 5fl oz de crema doble", "sal y pimienta blanca", "mantequilla, para engrasar el plato", "Espinaca de la hoja 125g / 4½oz", "4 huevos duros", "25 g / 1 oz de migas de ciabatta", "25g / 1oz de queso parmesano rallado"], "method": ["Para el relleno de papa, coloque las papas en una olla grande con agua salada hirviendo y cocínelas durante 15-20 minutos, o hasta que estén tiernas.", "Escurrir bien las papas y machacarlas con un triturador de patatas o ricer junto con sal, pimienta blanca y mantequilla, al gusto.", "Agregue el gruyère y reserve las papas, manteniéndolas calientes.", "Para el caldo de caza furtiva, coloque el caldo de pescado, el vermut, la cebolla, el hinojo, la zanahoria, el apio, la hoja de laurel y el azafrán en una sartén grande y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante cinco minutos.", "Para el pescado, coloque el pescado blanco, el eglefino ahumado, el salmón y las gambas en el caldo y cocine por tres minutos. Con una cuchara ranurada, retire con cuidado el pescado de la sartén y déjelo a un lado.", "Vierta el caldo a través de un colador en una sartén limpia, descartando las verduras y hierbas. Vuelva a hervir el caldo y cocine a fuego lento hasta que se reduzca a la mitad.", "Para la salsa de perejil, caliente la mantequilla y la harina juntas en una sartén a fuego lento, revolviendo para hacer una pasta.", "Agregue el caldo reducido un cucharón a la vez y siga batiendo hasta que quede suave. Agregue la leche y el perejil, lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante diez minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para terminar la salsa, agregue la crema doble a la sartén y sazone, al gusto, con sal y pimienta blanca.", "Para armar la tarta, unte generosamente una cacerola y desmenuce el pescado retirado, descartando la piel y los huesos. Coloque el pescado en la cacerola y vierta aproximadamente la mitad de la salsa de perejil en la parte superior (reserve el resto de la salsa para usarla como salsa para verter en el pastel terminado).", "Ponga a hervir una olla grande de agua con sal y agregue las espinacas a la sartén. Blanch por un minuto hasta que la espinaca se haya marchitado. Escurrir bien.", "Cortar los huevos duros y colocar sobre el pescado, seguido de la espinaca blanqueada.", "Cubra con el puré de papas.", "En un tazón pequeño, mezcle las migas de pan ciabatta y el parmesano. Espolvorea las migas de pan de queso encima del pastel.", "Coloque en el horno precalentado y hornee durante unos 20-25 minutos, o hasta que la parte superior esté dorada. Vuelva a calentar la salsa de perejil y sirva el pastel caliente con la salsa de perejil restante vertida sobre."], "url": "www_bbc_co_uk_food_recipes_theultimatefishpie_87821", "title": "El último pastel de pescado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theultimatefishpie_87821_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350 ml / 12 fl oz de agua", "100ml / 3½ fl oz de leche", "4 granos de pimienta negra", "10 vainas de cardamomo verde, ligeramente trituradas", "buenas pizca de semillas de hinojo verde", "pieza pequeña canela en rama", "1 cucharadita de jengibre fresco, pelado y cortado en rodajas", "1 bolsa de té negro", "azúcar al gusto", "sal, al gusto (opcional)"], "method": ["Caliente el agua y la leche en una sartén con especias y jengibre hasta que hierva. Baje la temperatura y cocine a fuego medio a bajo durante 15 minutos. Tenga cuidado ya que la leche puede subir y hervir fácilmente.", "Una vez que el volumen se reduce a una taza grande, agregue la bolsita de té y déjela preparar durante un minuto o más si le gusta el té fuerte.", "Para servir, cuele en una taza y agregue azúcar o sal si lo usa, al gusto."], "url": "www_bbc_co_uk_food_recipes_theultimatemasalatea_86647", "title": "El mejor té de masala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1 taza", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theultimatemasalatea_86647_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3-4 cucharadas de aceite de oliva", "1 cebolla, pelada, finamente cortada", "250g / 9oz de tofu firme, finamente picado", "1 remolacha cocida (no en vinagre), pelada, rallada", "150 g / 5½ oz de champiñones fritos, escurridos", "1 zanahoria, pelada, rallada", "1 cucharadita de pimentón ahumado", "1 diente de ajo, pelado, aplastado", "1 cucharadita de tomillo fresco picado", "1 cucharada de frijoles picados", "sal y pimienta negra recién molida", "6 bollos de hamburguesa", "6 cucharadas de mayonesa lista para usar (opcional)", "3 tomates de bistec, cortados en rodajas gruesas", "2-3 pepinillos, en rodajas"], "method": ["Calienta 1-2 cucharadas de aceite de oliva en una sartén a fuego medio-bajo y freír las cebollas durante 15 minutos, revolviendo con frecuencia, o hasta que estén suaves y doradas.", "En un tazón, mezcle las cebollas cocidas, el tofu, la remolacha, los champiñones, las zanahorias, el pimentón ahumado, el ajo, el tomillo y los frijoles. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Con las manos húmedas, divida la mezcla en porciones de aproximadamente 150 g / 5 oz y forme hamburguesas.", "Caliente el aceite de oliva restante en una sartén y fría las hamburguesas durante 3-4 minutos en ambos lados, o hasta que estén doradas. Caliente una sartén hasta que esté humeando, luego agregue las hamburguesas y fríe durante 1-2 minutos más en ambos lados, o hasta que haya líneas profundas de ambos lados.", "Para servir, coloque las hamburguesas en los panecillos de hamburguesas y organice las coberturas de su elección."], "url": "www_bbc_co_uk_food_recipes_theultimateveggiebur_91774", "title": "La mejor hamburguesa vegetariana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theultimateveggiebur_91774_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de girasol", "100g / 3½oz de cebolla picada congelada (o 1 cebolla mediana picada)", "Harina normal de 20g / ¾oz", "400 ml / 14 fl oz de leche semidesnatada", "400ml / 14fl oz de agua recién hervida", "2 papas medianas (aproximadamente 200g / 7oz cada una), peladas, cortadas en cubos de aproximadamente 2cm / ¾in", "¼ cucharadita de sal", "pimienta negra recién molida", "100g / 3½oz de granos de maíz dulce congelado", "125 g / 4½ oz de puerros en rodajas congeladas (o 1 puerro mediano, cortado y cortado en trozos finos)", "4 x 90 g / 3¼ oz de filetes de abadejo ahumado congelados", "4 huevos grandes de gallinas camperas (opcional)", "puñado de hojas de perejil fresco de flatleaf picadas, para adornar (opcional)"], "method": ["Caliente la mantequilla y el aceite en una sartén grande y antiadherente a fuego medio. Agregue la cebolla y fría por 3 minutos, revolviendo regularmente, hasta que esté completamente ablandada pero no coloreada. Espolvorea sobre la harina y revuelve bien las cebollas.", "En una jarra medidora, mezcle la leche y el agua. Poco a poco agregue 700 ml / 1¼ pintas de líquido a las cebollas, revolviendo después de cada adición.", "Agregue las papas y la sal a la sartén y sazone generosamente con pimienta negra recién molida. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento, revolviendo regularmente, durante 10-12 minutos, o hasta que las papas estén casi tiernas. Agregue el maíz dulce y los puerros y vuelva la mezcla a fuego lento.", "Coloque los filetes de abadejo ahumado en la parte superior de la sopa de pescado y continúe cocinando a fuego lento durante 10-15 minutos, o hasta que el pescado se haya descongelado y la carne se desmenuce fácilmente al pinchar con un cuchillo. (Esto dependerá del grosor de cada filete). Gire el pescado dos veces mientras los filetes hierven a fuego lento, sin permitir que se rompan si es posible.", "Retire con cuidado los filetes de eglefino ahumado cocidos de la sopa con una cuchara ranurada y déjelos a un lado en un lugar cálido. (Retire la piel en este punto si lo prefiere). Revuelva la leche y el agua restante en la sartén y vuelva a hervir a fuego lento, revolviendo.", "Si usa los huevos, llene una olla ancha hasta la mitad con agua hirviendo. Reduzca el fuego hasta que el agua apenas hierva a fuego lento. Cuidadosamente agrieta los huevos en el agua de a uno por vez, separándolos bien. Cueza muy suavemente durante 3-4 minutos, o hasta que los blancos se hayan solidificado pero las yemas permanezcan líquidas. Retire los huevos escalfados de la sartén con una cuchara ranurada", "Para servir, vierta la sopa en los cuencos tibios, sazonándola nuevamente con sal y pimienta, si es necesario. Cubra cada porción con uno de los filetes de eglefino y un huevo escalfado, si lo usa. Adorne con perejil, si está usando. Sirva con rebanadas de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_thick_smoked-haddock_90997", "title": "Sopa de abadejo ahumado grueso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thick_smoked-haddock_90997_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tazas de agua hirviendo", "2 tazas de azúcar en polvo", "3 semillas de cardamomo", "1 canela grande", "2 tazas de harina común", "1 taza de mantequilla salada o mantequilla clarificada, derretida", "½ taza de pasas", "pistachos picados", "pétalos de rosa cristalizados"], "method": ["Vierta el agua hirviendo en una jarra, luego agregue el azúcar hasta que se disuelva. Agregue el cardamomo y la canela y reserve.", "Tamice la harina en un recipiente grande y ancho y cocine a fuego lento, revolviendo a menudo, hasta que se dore. Esto puede demorar hasta 25 minutos, pero tenga cuidado de no quemarlo, ya que hará que el sabor del plato sea amargo.", "Vierta la mantequilla derretida y las pasas y revuelva hasta que la mezcla se parezca a un roux. Debería comenzar a salir de los lados de la sartén. Retire del fuego.", "Tamice las especias del agua azucarada, luego agregue el agua a la mezcla de harina. Regrese la sartén al fuego y mezcle muy rápido para evitar grumos. (Esto puede ser más fácil con una persona para sostener la sartén mientras otra agita vigorosamente). Cocine hasta que el agua se absorba. La mezcla tendrá la consistencia de una masa muy suave y azucarada.", "Servir caliente, adornado con pistachos y pétalos de rosa cristalizados."], "url": "www_bbc_co_uk_food_recipes_thoosha_shinni_91830", "title": "Carne de ternera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thoosha_shinni_91830_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz de mantequilla, ablandada, más extra para engrasar", "150 g / 5 oz de azúcar en polvo", "2 huevos de gallinas camperas", "algunas gotas esencia de vainilla", "pizca de sal", "125g / 4½oz de harina natural", "25 g / 1 oz de cacao en polvo", "1½ cucharadita de polvo de hornear", "1 cucharada de colorante rojo para alimentos", "450g / 1lb de glaseado blanco listo para rodar", "350g / 12oz de mantequilla, ablandada, más extra para engrasar", "Azúcar en polvo 350g / 12oz", "6 huevos de gallinas camperas", "½ cucharadita de esencia de vainilla", "pizca de sal", "Harina normal de 300g / 10oz", "50 g / 2 oz de cacao en polvo", "1 cucharada de levadura en polvo", "Colorante alimentario rojo 50ml / 2fl oz", "800 g / 1¾lb de glaseado blanco listo para rodar", "650g / 1lb de mantequilla de 7oz, ablandada, más extra para engrasar", "Azúcar en polvo de 650 g / 1 lb 7 oz", "10 huevos de gallinas camperas", "1 cucharada de esencia de vainilla", "gran pizca de sal", "Harina común de 575g / 1lb 5oz", "75g / 3oz de cacao en polvo", "35 g / 1 g de polvo de hornear", "100ml / 3½fl oz de colorante rojo para alimentos", "1.25kg / 2lb 12 oz de glaseado blanco listo para rodar", "730 g / 1 libra de mantequilla de 10 oz, suavizada", "Azúcar de formación de hielo 1.8kg / 4lb", "225g / 8oz de queso crema", "algunas gotas esencia de vainilla"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Tome la lata de torta más pequeña y sáquela dos veces en papel resistente a la grasa. Cortar ambos círculos. Mida la circunferencia del estaño con una cuerda, luego corte una tira larga de papel a lo largo del hilo y doble por la mitad a lo largo. Engrase la lata con mantequilla y coloque uno de los círculos de papel en la base. Engrase nuevamente, agregue un segundo círculo, luego engrase una vez más. Engrase el borde interior de la lata y alinee con la tira larga de papel. Repita esto con la lata de 23cm / 9in y lata de 30cm / 12in.", "Para el nivel pequeño, bata la mantequilla y el azúcar juntos en un tazón grande hasta que estén suaves y esponjosos. Poco a poco, agregue los huevos, la vainilla y la sal, y la mitad de la harina para evitar que la mezcla se cuaje. Agregue la harina restante, el cacao en polvo y el polvo de hornear y déle un latido final para mezclar. Agregue el colorante para alimentos y mezcle bien. Vierta la cuchara en la lata preparada y hornee por 40-45 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Retire la torta del horno, deje enfriar durante cinco minutos, luego retírela de la lata, retire el papel resistente a las grasas y deje que se enfríe completamente en una rejilla.", "Para el nivel medio, repita los pasos 3 y 4 y cocine el pastel durante 1 hora y 15 minutos.", "Para el nivel grande, repita los pasos 3 y 4 y cocine el pastel durante 1 hora y 30 minutos.", "Mientras tanto, para la crema de mantequilla, unte la mantequilla ablandada y el azúcar glas en un tazón muy grande hasta que esté suave y esponjosa. Agregue el queso crema y unas gotas de esencia de vainilla al gusto. (Si no está usando la crema de mantequilla de inmediato, cubra la superficie con película adhesiva y deje que se enfríe hasta que esté lista para usar. Vuelva a batir la mezcla hasta que esté suave y esponjosa antes de usarla).", "Usando un cuchillo de sierra de hoja larga, corte con cuidado la torta más pequeña por la mitad y sándwich junto con tres cucharadas colmadas de crema de mantequilla. Corte los pasteles restantes de la misma manera, usando seis cucharadas colmadas de crema de mantequilla para emparedar la torta mediana y ocho cucharadas colmadas de crema de mantequilla para la grande.", "Extienda una cucharadita de crema de mantequilla en cada tarta de pastel y coloque los pasteles sobre ellos, al revés (esto le da a las tortas una tapa más plana para la formación de hielo).", "Usando la mitad de la crema de mantequilla restante, extienda una capa delgada sobre la parte superior y los lados de cada torta hasta que se cubra. Refrigere los pasteles durante 30 minutos o hasta que se haya solidificado. Extienda el glaseado restante sobre los pasteles para darle un acabado suave y deje enfriar en el refrigerador hasta que se endurezca.", "Para cubrir los pasteles con hielo listo para rodar, hiela solo una torta a la vez, ya que la formación de hielo puede secarse muy rápidamente. Asegúrate de que la superficie de trabajo esté limpia y seca, luego amasa el glaseado hasta que esté tibia y caliente. Coloque dos cucharadas de azúcar glas en un pequeño colador y use para quitar el polvo ligeramente en la superficie de trabajo.", "Corta un trozo de cuerda para cada pastel para medir la longitud combinada de la parte superior y los costados: este será el tamaño al que se enrollará tu círculo de glaseado. Enrolle la formación de hielo en un círculo lo suficientemente grande que tenga 0.4cm / ⅙ de grueso. Con cuidado deslice sus manos y brazos debajo del glaseado, levante centralmente sobre el pastel y póngalo sobre la crema de mantequilla (puede usar un rodillo grande para esto en su lugar - simplemente sostenga el pin sobre el centro del glaseado y voltee el glaseado sobre él. , posición y rueda sobre la torta). Espolvorea tus manos con un poco de azúcar glas y frótalas suavemente sobre el pastel para suavizar el glaseado sobre la superficie y para asegurarte de que se haya adherido a la crema de mantequilla debajo.", "Utilice una cuchilla afilada de hoja larga para recortar los bordes, cortando hacia abajo limpiamente (siga limpiando la hoja de la cuchilla, de lo contrario se formará hielo y será difícil obtener un corte limpio). Repita con los pasteles restantes y la formación de hielo.", "Para apilar las tortas, sostenga una varilla de espiga en el lado de la torta mediana y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulgadas de distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta. No deberían elevarse por encima del nivel de la formación de hielo. Si no calculó bien y el clareado es demasiado largo, quítelo y elimine cualquier exceso con un cuchillo afilado. Mida, corte e inserte las barras de la misma manera para la torta grande. Los tres pasteles ahora se pueden apilar directamente el uno al otro. Una vez que estén apilados, es mejor no moverlos, por lo que es más seguro armarlos en su lugar o en la posición que desee que se muestren."], "url": "www_bbc_co_uk_food_recipes_three-tier_red_velvet_17795", "title": "Pastel de terciopelo rojo de tres niveles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-tier_red_velvet_17795_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de colza", "3 salchichas de pavo, despellejadas y picadas", "1 cucharadita de pimentón dulce ahumado", "1 pimiento rojo grande, rebanado grueso, opcional", "1 x 300 g de patatas nuevas, escurridas y en rodajas", "6 huevos de gallinas camperas, golpeados", "Guisantes congelados de 60 g / 2 oz, descongelados, opcional", "Queso Cheddar 100g / 3½ oz, rallado, opcional", "1 tomate, en rodajas, opcional", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Coloque una sartén a prueba de horno a fuego medio y agregue una cucharadita de aceite. Agregue las salchichas y pimentón ahumado y fría durante 1 minuto. Agregue la pimienta, si está usando, y baje la temperatura. Cubra y cocine por 2 minutos, o hasta que se suavice. Incline la mezcla en un plato y déjela a un lado.", "Caliente el aceite restante en la sartén, mezcle las papas y fríaselas durante 1 minuto.", "Sazonar los huevos, verterlos en la sartén y revolver. Baje el fuego y cocine por 2-3 minutos, o hasta que se haya puesto en la parte inferior, sacando los huevos del lado unas cuantas veces.", "Apague el fuego y agregue el tomate, las arvejas y / o el Cheddar, si está usando. Cuchara sobre la mezcla de salchichas en este punto. Para darle un giro, podría darle a cada tercio de la frittata un topping diferente si está sirviendo a personas con diferentes preferencias.", "Hornea de 6 a 8 minutos o hasta que esté hinchado y dorado. Deje que se enfríe durante 3 minutos antes de pasar una espátula alrededor de los bordes y deslizar sobre un tablero o placa. Cortar en tercios y servir."], "url": "www_bbc_co_uk_food_recipes_three-way_frittata_71196", "title": "Tortilla familiar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-way_frittata_71196_16x9.jpg", "isVegetarian": false, "recommendations": 0}]