[{"isVegetarian": true, "title": "Valentine cupcakes", "url": "www_bbc_co_uk_food_recipes_valentinecupcake_93564", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/valentinecupcake_93564_16x9.jpg", "ingredients": ["125g/4oz unsalted butter, softened", "125g/4oz caster sugar", "2 free-range eggs", "125g/4oz self-raising flour", "150g/5oz raspberries", "6 passion fruit, sieved pulp only", "a little milk, to loosen the mixture as necessary", "500g/1lb 1½oz icing sugar", "160g/5½oz butter", "1 vanilla pod, seeds only", "2-3 drops pink liquid food colouring", "50ml/1¾oz milk ", "hundreds and thousands"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the cakes, preheat the oven to 180C/350F/Gas 4. Sit 12 paper cases in a muffin tray. ", "Beat the butter and sugar in a bowl until pale and creamy. Add the eggs, one at a time, and beat until well combined. ", "Fold the flour, raspberries and passion fruit pulp into the mixture until almost smooth.  If the mixture looks too stiff, add a little milk, as necessary.", "Divide the mixture among the paper cases then bake for 20 minutes. Remove from the oven and set aside to cool in the tin for 10 minutes. Turn the cakes out onto a wire rack and set aside until completely cooled. ", "For the icing, using an electric whisk, cream the icing sugar and butter together until light and fluffy. Whisk in the vanilla pod seeds and food colouring. Gradually whisk in enough milk to form a smooth paste.", "Spoon the icing into a piping bag with a large star-shaped nozzle and pipe the icing over the cake. Sprinkle over the hundreds and thousands."]}, {"isVegetarian": true, "title": "Vanilla and bourbon cheesecake", "url": "www_bbc_co_uk_food_recipes_vanilla_and_bourbon_20548", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "25cm/10in diameter sponge base (cut from a large bought flan case)", "200g/7oz caster sugar ", "3 lemons, finely grated zest only", "4 tbsp cornflour ", "3 tbsp sultanas, soaked in a bit of bourbon ", "850g/1lb 14oz full fat soft cream cheese ", "3 medium free-range eggs ", "1½ tsp vanilla essence ", "1 vanilla pod, sliced lengthways, seeds removed", "whiskey or bourbon, to taste (optional) ", "375ml/13fl oz cream ", "10 small bananas ", "25g/1oz butter ", "2 tbsp sugar ", "500ml/18fl oz double cream", "175g/6oz unsalted butter", "175g/6oz demerara sugar", "1 tbsp golden syrup", "1 tbsp black treacle", "175g/6oz plain chocolate, broken into pieces", "50g/1¾oz caster sugar", "sprigs of fresh mint"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Butter a 25cm/10in loose-bottomed cake tin. ", "Cut the sponge horizontally into 2 discs. Use 1 disc to line the prepared cake tin. ", "In a bowl mix together the sugar, lemon zest, cornflour and sultanas using a wooden spoon, then beat in the cream cheese. Add the eggs one by one, then add the vanilla essence, beating constantly until all the eggs are well incorporated. ", "Add the vanilla seeds and a generous splash of whisky or bourbon (about 4 tablespoons), if using. Add the cream and beat well until the mixture is smooth. Pour gently over the sponge base in the cake tin. ", "Sit the tin in a deep baking tray filled with 2-3mm of warm water to help create steam during cooking. Bake for 50 minutes until the top is golden. Remove and leave to cool and set completely before removing from the tin. ", "For the bananas, just before serving, peel the bananas and pan fry in the butter and sugar until brown and slightly caramelised. ", "For the toffee sauce, in a pan set over a low heat combine the cream, butter and sugar. When the butter and sugar have melted, whisk in the syrup and treacle.", "For the chocolate sauce, melt the chocolate in a bowl set over a pan of simmering water (make sure the bottom of the bowl does not touch the water). ", "Heat the sugar in a pan with 100ml/3½fl oz water, stirring until the sugar dissolves. Bring to the boil. Stir the sugar syrup into the melted chocolate until smooth and shiny. ", "Cut the cheesecake into wedges and serve with the bananas and the toffee and chocolate sauce. Garnish with fresh mint."]}, {"isVegetarian": true, "title": "Vanilla and orange cheesecake with almond sponge, orange and cardamom syrup", "url": "www_bbc_co_uk_food_recipes_vanilla_and_orange_64396", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz icing sugar, sifted", "150g/5½oz ground almonds", "3 free-range eggs", "90g/3¼oz egg yolks (about 5 large egg yolks)", "275g/9¾oz egg whites (about 9 large egg whites)", "110g/4oz caster sugar", "120g/4¼oz plain flour, sifted", "200g/7oz caster sugar", "2 vanilla pods, seeds only", "1 lemon, zest only", "1 orange, zest only", "4 tbsp cornflour", "845g/1lb 14oz cream cheese", "3 free-range eggs", "375ml/12½fl oz double cream", "10 oranges, juiced (to make about 400ml/14fl oz orange juice)", "400g/14oz caster sugar", "4 empty vanilla pods", "8 cardamom pods, cracked", "1 orange, peeled, cut into small pieces", "½ pomegranate seeds", "1-2 tbsp shredded fresh mint "], "serves": "Makes 2 cheesecakes", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the almond sponge, mix the icing sugar and ground almonds together in a mixing bowl. ", "In a separate bowl, whisk the whole eggs and yolks together, then whisk in the icing sugar and almonds and continue to beat until pale and thick. ", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl.", "Add the sugar, a little at a time, whisking as you go, until the mixture forms stiff peaks when the whisk is removed from the bowl. ", "Fold the sugar into the egg and almond mixture and then gently fold in the sieved flour. ", "Divide the mixture between two trays lined with a non-stick silicone mat and smooth with a palette knife. Bake in the oven for 12-14 minutes, or until pale golden-brown. ", "Remove the sponge from the oven and leave to cool slightly in the trays before carefully removing to a wire rack to cool completely.", "Cut the sponge to line two 28cm x 7cm/11in x 2¾in deep chefs’ rings. ", "Reduce the oven temperature to 150C/300F/Gas 2,", "For the cheesecake, beat together the caster sugar, vanilla seeds, lemon and orange zest, cornflour and cream cheese in a bowl until pale and fluffy. ", "Beat in the eggs, one by one, and then add the cream to the mixture. Beat to combine.", "Pour the cheesecake mixture into the lined chefs’ rings and bake the cheesecakes in the oven for 35-40 minutes, or until set. Remove from the oven and leave in the rings to cool.", "To make the orange syrup, heat the orange juice, sugar, vanilla pods and cardamom in a pan and cook until the mixture has reduced and is thickened and syrupy. Strain into a clean pan and heat gently. ", "To serve, cut the cheesecake into wedges and arrange on serving plates. Scatter the chopped orange and pomegranate seeds on top and drizzle with orange and cardamom syrup. Finish with shredded mint to serve.  "]}, {"isVegetarian": false, "title": "Vanilla and yoghurt panna cotta with pomegranate jelly", "url": "www_bbc_co_uk_food_recipes_vanilla_and_yogurt_panna_76284", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanilla_and_yogurt_panna_76284_16x9.jpg", "ingredients": ["3 gelatine leaves", "100ml/3½fl oz double cream", "100ml/3½fl oz full-fat milk", "100g/3½oz caster sugar", "1 vanilla pod, seeds only", "300g/10½oz Greek yoghurt", "135g/4¾oz pack raspberry jelly, cut into cubes", "300ml/10fl oz pomegranate juice ", "½ pomegranate, seeds only"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, put the gelatine in a bowl of cold water and leave to soak for five minutes. ", "Place the double cream, milk, sugar and vanilla seeds into a small pan and heat though gently, just enough for the sugar to dissolve, stirring from time to time. ", "Meanwhile, put the yoghurt in a large jug, stirring to loosen it up and set aside. Remove the creamy mixture from the heat once ready.", "The gelatine should be soft by now, so lift it out of the water and squeeze the excess water out. Drop the gelatine into the creamy mixture and stir until dissolved. Leave to cool to body temperature for about 10-15 minutes. ", "Meanwhile, prepare your glasses. You will need 6 x 200ml/7fl oz pretty glasses for serving, but as the layers are set at a slant, the glasses will need to be propped to one side. Depending on the shape or type of glass, you may find egg cartons or even crumpled tea towels perfect to help prop the glasses. They could also tilt perfectly sitting in individual ramekins. Whatever you use, set them on a large tray or trays that will easily fit in the fridge.", "Once cool, pour the creamy mixture over the yoghurt and then gently whisk everything together. ", "Carefully pour the mixture into the six glasses, dividing it evenly, without allowing any to spill out. Carefully place the tray in the fridge and leave to set for 1-2 hours, or until nice and firm. To start the setting process off quickly, you can always put them in the freezer for 20 minutes or so before popping them in the fridge to finish setting.", "Meanwhile, for the jelly layer, place the raspberry jelly into a measuring jug. Pour over 200ml/7fl oz of just-boiled water and stir until the jelly dissolves. Stir in the pomegranate juice, then leave the liquid to cool to room temperature - make sure it is really cool so as to not melt the panna cotta on impact. ", "Remove the set panna cottas from the fridge and stand the glasses upright, removing any props. Pour the cool jelly over each one, dividing it evenly. Return the glasses back to the fridge for about two hours, or until the jelly is set firm.", "When you are ready to serve, top each panna cotta with pomegranate seeds and sit on a serving plate with a small spoon. These will keep for a few days in the fridge."]}, {"isVegetarian": false, "title": "Vanilla and strawberry baked cheesecake", "url": "www_bbc_co_uk_food_recipes_vanilla_and_strawberry_46714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["23cm/9in ready-made sponge base", "200g/7oz caster sugar", "1 lemon, zest and juice only", "4 tbsp cornflour", "850g/1lb 14oz full-fat cream cheese", "3 free-range eggs", "1 vanilla pod, seeds scraped out", "375ml/13fl oz double cream", "250g/9oz strawberries, cut into quarters", "150g/5oz white chocolate, roughly chopped", "250g/9oz strawberries", "1 lemon, juice only", "2 tbsp icing sugar, or to taste", "100g/3½oz strawberries"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheesecake, preheat the oven to 180C/350F/Gas 4.", "Place the sponge base into the bottom of a 23cm/9in springform, loose-based cake tin. ", "Place the sugar, lemon juice and zest and cornflour into a bowl and whisk together. ", "Add the cream cheese and beat well. Crack in the eggs, one at a time, beating well between each addition. Add the vanilla seeds and mix well, then pour in the double cream and whisk until the mixture is smooth. Fold in the strawberries and white chocolate.", "Pour the mixture into the cake tin and give the tin a light shake to evenly distribute the mixture.", "Wrap the cake tin in a sheet of foil to make it waterproof, then place it into a roasting tin filled to a depth of about 0.5cm/¼in with water. Transfer to the oven and bake for 50 minutes, or until the top is lightly golden-brown and the cheesecake is just set. Remove from the oven and leave to cool in the tin, then keep in the fridge until ready to serve.", "For the strawberry sauce, heat a frying pan until hot and place 250g/8oz of the strawberries into the pan. Stir-fry for one minute.", "Stir in the lemon juice and icing sugar, to taste.", "Pour the mixture into a blender and blend until smooth, then pass through a sieve, pressing with the back of a spoon, to remove all the seeds.", "To serve, remove the cheesecake from the fridge, remove from the tin and place a slice onto a serving plate. Top with the sauce and some strawberries."]}, {"isVegetarian": true, "title": "Vanilla baked cheesecake with blackberries", "url": "www_bbc_co_uk_food_recipes_vanilla_baked_cheesecake_59336", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanilla_baked_cheesecake_59336_16x9.jpg", "ingredients": ["200g/7oz digestive biscuits", "100g/3½oz butter, melted", "125g/4½ oz blackberries", "2 tsp caster sugar", "1 vanilla pod, split", "500g/1lb 2oz full-fat cream cheese", "3 free-range eggs", "½ lemon, juice only", "75ml/2½fl oz double cream", "56g/2oz plain flour", "196g/7oz caster sugar", "35g/1oz honey", "70g/2oz liquid glucose", "200g/7oz caster sugar", "20g/1oz bicarbonate of soda", "freshly ground black pepper (optional)"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 130C/250F/Gas½. Line a 20cm/8in spring-form cake tin. ", "For the cheesecake base, place the digestive biscuits into a food processor and pulse until the mixture resembles breadcrumbs. Mix together with the melted butter, then press the mixture into the bottom of the lined cake tin. Use the bottom of a glass to even out the biscuit mixture. Place into the fridge. ", "For the blackberry purée, place the berries and sugar into a pan along with a splash of water and simmer over a medium-low heat until the berries break down and become tender. Blend to a smooth puree in a food processor, then pass through a fine sieve into a bowl. Set aside to cool. ", "For the cheesecake filling, scrape the vanilla seeds out from the pods and beat into the cream cheese until well combined. In a jug, whisk together the eggs, lemon juice and cream. ", "Add half of the egg mixture to the cream cheese and mix together until smooth and well combined. Add the flour and sugar to the cream cheese mixture, then mix in the remaining egg mixture until smooth. ", "Pour the cheesecake mixture into the prepared tin, then drizzle over the blackberry purée. Bake the cheesecake for 40 minutes, or until the cheesecake is set and lightly golden on top. Set aside to cool. ", "For the black pepper honeycomb, place a silicone mat onto a large baking tray. ", "Place the honey, liquid glucose, caster sugar and water into a large, deep-sided pan and heat until the mixture reaches 150C/300F on a sugar thermometer. ", "Quickly stir in the bicarbonate of soda (be careful as the mixture will rapidly expand and bubble up), then pour onto the silicone mat. Lightly spread over the mat with a palette knife and sprinkle over some freshly ground black pepper. Set aside until cooled and hardened. ", "Before serving, break the honeycomb into pieces. Cut the cheesecake into slices and decorate the top with shards of black pepper honeycomb."]}, {"isVegetarian": false, "title": "Vanilla cured salmon with cucumber ketchup, charred cucumber and pickled ginger", "url": "www_bbc_co_uk_food_recipes_vanilla_cured_salmon_21998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 vanilla pods", "200g/7oz caster sugar ", "200g/7oz sea salt ", "1.5kg/3lb 5oz salmon fillet, skin on, pin boned, washed and patted dry", "1 bunch breakfast radishes, halved lengthways, to garnish", "1 punnet mustard cress, to garnish", "watercress, to garnish", "2 cucumbers", "100ml/3½fl oz rice wine vinegar", "1 tsp caster sugar", "1 tsp sea salt", "2-3 tsp xantham gum", "rapeseed oil, for griddling", "100ml/3½fl oz rice wine vinegar", "1 pinch caster sugar", "1 pinch sea salt", "50g/1¾oz piece fresh root ginger, peeled and finely cut into thin strips"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the salmon, put the vanilla pods and sugar into a food processor, blend to a fine purée and then stir in the sea salt.", "Place some cling film on a clean work surface, then put half the sugar mixture in a line down the centre.", "Place the salmon fillet on top, skin-side down then sprinkle the rest of the mixture over the top to cover the salmon.", "Wrap the salmon up loosely with the cling film, then place it on a tray in the fridge for 24 hours.", "Remove the salmon from the cling film, brush off the salt mixture and rinse it thoroughly under cold water, then pat dry and wrap in clean cling film until ready to serve.", "For the cucumber ketchup, cut the outer edge of the cucumbers off so that you are left with two long 2cm/¾in square batons. Set aside.", "Roughly chop the outer parts of the cucumber before putting into a food processor with the rice wine vinegar, sugar and salt.", "Blend to a fine purée, then add the xanthan gum one teaspoon at a time until it thickens.", "Heat a griddle pan until hot, drizzle the cucumber batons with a little rapeseed oil and then cook on each side until charred and hot through. Remove from the heat and cut into small cubes.", "For the pickled ginger, place the vinegar, sugar and salt into a medium saucepan and heat until the sugar has dissolved. ", "Add the ginger and simmer for 1-2 minutes, or until the ginger has wilted down.", "Remove from the heat and leave to cool.", "To serve, slice the salmon finely and layer onto each plate, top with pieces of the charred cucumber, teaspoon-sized blobs of the ketchup and the halved radishes. Scatter the pickled ginger, mustard cress and watercress over the top to finish. "]}, {"isVegetarian": true, "title": "Vanilla crème brûlée with strawberry sauce", "url": "www_bbc_co_uk_food_recipes_vanilla_crme_brle_with_58708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7 free-range egg yolks", "110g/4oz caster sugar", "2 vanilla pods, seeds only", "250ml/9fl oz whole milk", "750ml/1¼ pint double cream", "55g/1¾oz demerara sugar", "250g/9oz fresh strawberries, hulled"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ½.", "For the crème brûlées, place the egg yolks into a bowl, add the caster sugar and vanilla and whisk together until pale and fluffy and well combined.", "Add the milk and cream and whisk until well combined.", "Ladle the mixture into ramekins and place the ramekins into a deep roasting tin. ", "Place the tin into the oven and pour in enough boiling water to come halfway up the sides of the ramekins. Bake for one hour, or until just set. ", "Remove from the roasting tin and allow to cool. When cool, refrigerate the crème brûlées for at least two hours, or until thoroughly chilled and firm.", "For the strawberry sauce, place half of the strawberries into a food processor and blend to a purée. Strain through a fine sieve.", "Halve the rest of the strawberries and stir through the passed sauce.", "When ready to eat, sprinkle the demerara sugar over the top of the brûlées and caramelise with either a chef’s blowtorch or by putting them under a hot grill until the sugar starts to bubble and caramelised. Place each dish on a plate and serve with the strawberry sauce in a small dish alongside."]}, {"isVegetarian": false, "title": "Vanilla panna cotta with poached figs and plums", "url": "www_bbc_co_uk_food_recipes_vanilla_panna_cotta_with_75584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint double cream", "500ml/18fl oz milk", "100g/3½oz sugar", "2 vanilla pods, split and seeds scraped out", "15g/½oz gelatine leaves", "500ml/18fl oz red wine", "200g/7oz crème de cassis", "100g/3½oz sugar", "½ bunch rosemary", "1 star anise", "1 cinnamon stick", "4 plums, stoned and cut into quarters", "4 figs, cut into quarters", "100g/3½oz blackberries"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Put the cream, milk, sugar and vanilla pod and seeds in a pan, and slowly bring to the boil.", "Soak the gelatine leaves in cold water until soft then squeeze the remove any excess water. Once the cream mixture has come to the boil, stir in the gelatine until dissolved. Strain through a fine sieve into a jug and discard the vanilla pod.", "Pour the mixture into moulds or glasses, and leave to cool before transferring to the fridge to set.", "Put the red wine, crème de cassis, sugar, rosemary and spices in a pan and bring to the boil. Reduce the heat and allow to simmer for half an hour to infuse the spices.", "Add the plums and figs to the red wine, and continue to cook for 2-3 minutes. Remove from the heat, allow to cool slightly, then add the blackberries. Set aside to cool completely.", "Serve the cooked fruits with the set panna cotta."]}, {"isVegetarian": false, "title": "Vanilla panna cotta, roasted watermelon, chilled ginger, mint and melon soup", "url": "www_bbc_co_uk_food_recipes_vanilla_panna_cotta_20752", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾pints double cream", "135g/4¾oz caster sugar", "7 vanilla pods", "3 gelatine leaves (soaked in a bowl with cold water to soften)", "1 watermelon, cut into 3cm/1¼in cubes (keep any excess, misshapen, watermelon for the soup)", "reserved watermelon", "100g/3½oz caster sugar", "1 tbsp chopped fresh mint", "1 tbsp ground ginger"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the vanilla panna cotta, put the cream and sugar into a saucepan. ", "Split the vanilla pods, using a sharp knife scrape the seeds into the cream, and add the pods. Bring to the boil. ", "Squeeze any excess water from the soaked gelatin. Add it to the hot cream and whisk to dissolve. Pour the mixture into six individual dariole moulds.  ", "Place into the fridge and leave to set.", "For the ‘roasted’ watermelon, fry the watermelon in a pan until coloured all over.", "For the soup, blend all the excess watermelon in a blender or food processor.", "In a pan, heat the sugar and 100ml/3½fl oz water until the sugar dissolves. Leave to cool down. Stir in the mint, ground ginger and blended watermelon and put in the fridge to chill.", "Once the panna cotta has set, turn each one out onto a plate. ", "Serve with the chilled soup and caramelised watermelon chunks."]}, {"isVegetarian": true, "title": "Vanilla and gingerbread cheesecake", "url": "www_bbc_co_uk_food_recipes_vanillaandgingerbrea_84059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz readymade gingerbread, sliced", "450g/1lb cream cheese", "250g/9oz caster sugar", "250g/9oz crème fraîche", "475ml/17fl oz double cream", "2 vanilla pods, seeds scraped out", "200g/7oz strawberries", "2 tsp caster sugar", "2 tsp balsamic vinegar"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Place the gingerbread onto a tray and leave out overnight to dry.", "When dry and hard, place into a food processor and pulse until fine crumbs are formed. Set to one side.", "Place the cream cheese, caster sugar, crème fraîche, double cream and vanilla seeds into a large bowl. Whisk together until smooth.", "Place the cream mixture into a plastic piping bag and carefully pipe into 4.5cm/2in deep by 5.5cm/2½in wide chefs' rings.", "Smooth off the top with the back of a flat knife and place in the fridge for two hours to set.", "When set, remove from the fridge and leave at room temperature for five minutes.", "Place the ginger crumbs onto a plate and carefully pick up the chefs' rings and dip each end of the cheesecake into the ginger crumbs.", "Lightly shake each cheesecake onto a plate, removing the ring.", "Meanwhile, for the strawberries, heat a frying pan over a high temperature. Add the strawberries and sugar to the frying pan and fry briefly for a minute, then pour over the balsamic and cook for a furthur 30 seconds.", "To serve, spoon some of the strawberries onto the plate, alongside the cheesecake."]}, {"isVegetarian": true, "title": "Vanilla and gingerbread cheesecakes with fresh raspberries and raspberry sorbet", "url": "www_bbc_co_uk_food_recipes_vanillaandgingerbrea_86247", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz strong rye flour", "125g/4½oz plain flour ", "4 tsp baking powder", "2 tsp ground mixed spice", "2 tsp ground ginger", "125ml/4fl oz whole milk", "250g/9oz perfumed clear honey", "3 medium free-range eggs", "50g/2oz light muscovado sugar ", "1 small lemon, grated zest only", "1 small orange, grated zest only ", "seeds scraped from ½ split vanilla pod", "1 thick slice of lemon", "300g/10oz caster sugar", "15g/½oz liquid glucose (available from cake specialists and online)", "500g/1lb 2oz English raspberries", "caster sugar for sprinkling", "¼ tsp liquid glucose ", "½ lemon, juice only", "250g/9oz full-fat soft cheese", "250ml/9fl oz double cream", "125g/4½oz crème fraîche", "125g/4½oz caster sugar", "seeds scraped from 1 split vanilla pod", "300g/10oz English raspberries"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the gingerbread, preheat the oven to 160C/320F/Gas 3 and grease and line a 900g/2lb loaf tin. ", "Sift the dry ingredients into a large bowl. Mix the milk, honey, eggs and sugar in another bowl with the citrus zest and vanilla seeds, then add to the dry ingredients and mix well until evenly combined. Spoon the mixture into the prepared tin. Bake for 45 minutes or until a skewer inserted in the centre comes out clean. Cool in the tin for about 30 minutes, then remove and leave to cool on a wire rack.", "To make gingerbread crumbs (you need 100g/4oz), cut the gingerbread into 5mm/¼in-thick slices and leave to dry on a tray overnight. The next day, grind the slices to fine crumbs in a food processor. Store in a plastic container until ready to use. (The rest of the gingerbread can be eaten as a cake; wrapped in foil it will keep for a week or more.)", "For the stock syrup, put the lemon slice in a heavy pan with the sugar, liquid glucose and 300ml/½ pint water. Heat gently, stirring occasionally, until the sugar has dissolved, then bring to the boil and boil for five minutes. Cool. Remove the lemon slice, then pass the syrup through a fine sieve. Chill in a covered container in the fridge.", "For the raspberry sorbet, put the raspberries in a heavy pan, sprinkle lightly with caster sugar and two tablespoons of water, and cook over a low heat for about five minutes or until the raspberries soften. Tip into a fine sieve set over a bowl and push the purée through to remove the seeds. Cover and chill in the fridge.", "Set 100ml/3½fl oz of raspberry purée aside in the fridge for later. Combine the remaining purée with 250ml/9fl oz of the chilled stock syrup, the liquid glucose and lemon juice. Churn in an ice cream machine until thickened, according to manufacturer's instructions, then decant into a clean container and store in the freezer until ready to use. ", "For the cheesecakes, stand eight metal chefs' rings, each measuring 5.5cm/2¼in tall and 4.5cm/1¾in across, on a non-stick mat or baking sheet lined with cling film. Combine the soft cheese, cream, crème fraîche, sugar and vanilla seeds in a large bowl. Whisk together well until thick, then put the mixture in a plastic piping bag and pipe neatly into the rings. Make sure there are no gaps or air pockets and pipe right up to the tops, then smooth the tops with the back of a flat knife. Refrigerate for two hours or until set firm. ", "Meanwhile, make scoops of sorbet and transfer to a tray lined with baking parchment. Place in the freezer. Put the raspberries in a bowl with the reserved 100ml/3½fl oz raspberry purée and lightly mix with a fork. Set aside at room temperature. ", "About five minutes before serving, remove the cheesecakes from the fridge. One at a time, lift each cheesecake off the mat and dip both ends in the gingerbread crumbs, then warm the ring in your hands for 30 seconds (or very quickly flash round the ring with a blowtorch). Now hold the ring over a plate and carefully lift it up so the cheesecake drops out onto the plate. ", "To finish, put a spoonful of the raspberries to the side of each plate and sprinkle a line of gingerbread crumbs between the cheesecake and the raspberries. Top each cheesecake with a scoop of sorbet and serve immediately."]}, {"isVegetarian": true, "title": "Vanilla and chocolate soufflé", "url": "www_bbc_co_uk_food_recipes_vanillaandchocolates_87716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "cocoa powder, for dusting", "3 free-range egg whites", "55g/2oz ready-made fresh vanilla custard", "icing sugar, to dust"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Grease a ramekin with butter and lightly dust with cocoa powder.", "Whisk the egg whites until stiff peaks form when the whisk is removed, then gently fold in the custard.", "Run your fingernail or the end of a teaspoon around the inside edge of the ramekin to loosen the soufflé from the side. Place onto a baking sheet and transfer to the oven to bake for 8-10 minutes, until risen and golden-brown.", "To serve, transfer the soufflé onto a plate and dust with icing sugar."]}, {"isVegetarian": true, "title": "Vanilla and white chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_vanillaandwhitechoco_84134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-made shortbread biscuits", "125g/4½oz butter, melted", "600g/1lb 5oz full-fat cream cheese", "600g/1lb 5oz ricotta", "6 free-range eggs", "150g/5¼oz caster sugar", "2 vanilla pods, seeds scraped out ", "150g/5¼oz white", "chocolate, plus extra for drizzling", "mixed fresh berries", "double cream, to serve"], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 175C/350F/Gas 4. ", "Place the biscuits into a food-standard plastic bag and crush with a rolling pin or similar heavy object. Tip the crumbs into a mixing bowl.", "Add the melted butter and mix well. Press the breadcrumb mixture into the base of a 25cm/10in spring-form cake tin.", "Place the cream cheese, ricotta, eggs, caster sugar and vanilla seeds into a food processor and pulse until smooth.", "Meanwhile, place the chocolate in a heatproof bowl placed over a saucepan of barely simmering water (don't allow the bowl to touch the water) and leave to melt. Take care not to stir, as this may ruin the chocolate. Once it has all melted, remove the bowl from the heat and allow to cool slightly.", "Gently fold the melted chocolate into the cheese mixture, then spoon the cheese and chocolate mixture into the tin, smooth over the top with a palette knife and transfer to the oven. Cook for 50 minutes to an hour, until the surface light and springy to the touch. Remove from the oven and leave to cool.", "To serve, carefully release the spring-sides of the tin and remove. To serve, cut out a slice of the cheesecake. Place onto a plate, drizzle the melted chocolate over and serve with a handful of berries and a dollop of cream."]}, {"isVegetarian": true, "title": "Vanilla, honey and apricot tarte tatin with whipped cream", "url": "www_bbc_co_uk_food_recipes_vanillahoneyandapric_86208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter", "85g/3oz plain flour, plus extra for dusting", "1 free-range egg, beaten", "30g/1oz butter", "3 tbsp honey", "3 apricots, halved, stones removed", "1 vanilla pod, split, seeds scraped out", "100ml/3½fl oz double cream, whipped, to serve"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the butter and flour into food processor and pulse until the mixture resembles breadcrumbs. Add the egg and blend until it comes together as a ball of pastry. ", "Turn out onto a floured surface, knead for one minute and then roll to the thickness of a pound coin. Cut to the size of an ovenproof medium-sized frying pan and set aside.", "For the filling, heat the butter and honey in the frying pan, add the apricots, cut-side down, and the vanilla seeds and sauté for 2-3 minutes. ", "Turn over the apricots, cover with the prepared pastry and press down the edges to seal the pastry round the apricots. Bake in the oven for 15 minutes. ", "Remove from the oven, place a serving plate over the top of the frying pan, and flip the pan to turn out the tatin, fruit-side up. ", "To serve, cut into slices and top with lashings of whipped cream."]}, {"isVegetarian": false, "title": "Vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_vanillaicecream_4616", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanillaicecream_4616_16x9.jpg", "ingredients": ["2 vanilla pods", "500ml/16fl oz double cream (see tip)", "70g/3oz sugar", "3 egg yolks"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Halve the vanilla pods lengthways and scrape out the seeds. Add the pods to the cream and bring to the boil, then add the sugar and stir until the sugar has dissolved.", "Meanwhile, whisk the egg yolks in a large bowl then slowly whisk in the hot cream mixture.", "Pour the mixture through a fine sieve into another bowl and whisk in the vanilla seeds. Pour the mixture into a freezer-proof container and freeze for 2-3 hours, or until set.  "]}, {"isVegetarian": false, "title": "Vanilla panna cotta", "url": "www_bbc_co_uk_food_recipes_vanillapannacotta_87907", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vanillapannacotta_87907_16x9.jpg", "ingredients": ["3 gelatine leaves", "250ml/9fl oz milk", "250ml/9fl oz double cream", "1 vanilla pod, split lengthways, seeds scraped out", "25g/1oz sugar", "175g/6oz sugar", "175ml/6fl oz water", "splash cherry liqueur", "350g/12oz raspberries", "4 sprigs fresh mint", "icing sugar, to dust"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the panna cotta, soak the gelatine leaves in a little cold water until soft.", "Place the milk, cream, vanilla pod and seeds and sugar into a pan and bring to a simmer. Remove the vanilla pod and discard.", "Squeeze the water out of the gelatine leaves, then add to the pan and take off the heat. Stir until the gelatine has dissolved.", "Divide the mixture among four ramekins and leave to cool. Place into the fridge for at least an hour, until set.", "For the sauce, place the sugar, water and cherry liqueur into a pan and bring to the boil. Reduce the heat and simmer until the sugar has dissolved.", "Take the pan off the heat and add half the raspberries. Using a hand blender, blend the sauce until smooth.", "Pass the sauce through a sieve into a bowl and stir in the remaining fruit.", "To serve, turn each panna cotta out onto a serving plate. Spoon over the sauce and garnish with a sprig of mint. Dust with icing sugar."]}, {"isVegetarian": false, "title": "Veal and kidneys with spinach, fries and a veal reduction", "url": "www_bbc_co_uk_food_recipes_veal_and_kidneys_with_11906", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 x 150g/5½oz veal tail fillet, trimmed, seasoned", "300g/10½oz veal kidneys, cleaned and sliced", "75g/2½oz unsalted butter", "100ml/3½fl oz madeira", "2 sprigs fresh thyme", "1 garlic clove, crushed", "100g/3½oz large leaf spinach", "50g/1¾oz unsalted butter", "1 large potato, peeled and cut into chips", "vegetable oil for deep-frying", "100ml/3½fl oz balsamic vinegar", "150ml/5fl oz veal stock", "75g/2½oz unsalted butter", "salt and freshly ground black pepper", "1 shallot, diced", "2 garlic cloves, chopped", "4-6 tbsp chopped parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal and kidneys, heat half the oil in a frying pan and once hot cook the veal for 3-4 minutes, or until done to your liking. Set aside to rest.", "Heat a clean pan and add the remaining oil and cook the kidneys for 2-3 minutes, then finish with a little butter. Set aside to rest.\r\nPut the madeira, thyme and garlic in a clean pan and heat to reduce in volume by half.", "Heat the butter in a large sauté pan, add the spinach and a little water and cook until it wilts.", "Heat deep-fat fryer to 180C, or half-fill a deep pan with oil and heat to 180C or until a piece of bread dropped into the oil turns golden brown in 15 seconds (Caution: Hot oil can be dangerous. Do not leave unattended). ", "Fry the chips for 3-4 minutes. Drain and season with salt.", "For the veal reduction, heat a saucepan and add the vinegar and cook until reduced to half the volume. Add the stock and reduce again to half the volume. Finish with the butter and season with salt and pepper.", "For the dressing, place all the ingredients into a medium bowl and mix.", "To serve, slice the veal fillet and kidneys. Place the cooked spinach in the centre of the plate and dot with slices of fillet and kidneys. Top with some of the dressing, the veal reduction and the madeira reduction. Mix the rest of the dressing with the warm salted chips and pile on top."]}, {"isVegetarian": false, "title": "Veal cutlet marinated in barley miso, ginger and yuzu with burnt chili cucumber pickle", "url": "www_bbc_co_uk_food_recipes_veal_cutlet_marinated_in_10646", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp barley miso", "3 tbsp finely chopped fresh root ginger", "3 tbsp finely diced yuzu zest (available from specialist suppliers)", "2 tbsp finely chopped shallot ", "1 tsp crushed garlic", "1 pinch shichimi pepper (available from Japanese suppliers)", "2 tsp soy sauce", "2 tsp sake", "2 tsp mirin", "4 tbsp rice bran oil (available online)", "280g/10oz veal cutlet, bone on ", "1 red chilli", "1 yellow courgette, halved lengthways", "1 green courgette, halved lengthways", "1 pinch sea salt", "3 tbsp sushi vinegar", "½ ruby grapefruit, cut into segments", "5-6 sprigs fresh coriander", "fresh ginger juice, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the miso, ginger, yuzu zest, shallot, garlic, shichimi pepper, soy sauce, sake, mirin and oil in a shallow dish. ", "Whisk the marinade together until well combined, then add the veal cutlet to the dish and rub the marinade all over it. Marinade for 24 hours.", "For the burnt chilli cucumber pickle, blacken the chilli directly over a direct flame (either with a mini-blow torch or simply over the gas hob). ", "Roughly chop the chilli, including the blackened skin and seeds.", "Cut the courgette on the diagonal, then make three cuts, following the diagonal, 2-3mm apart, but not going all the way through. Make a final cut all the way through - you will have a little fan of courgette. Repeat with the remaining courgettes.", "Season the sliced courgette with sea salt and allow to stand for a few minutes, just enough to soften. Pour over the sushi vinegar.", "Combine the red chili, courgette, ruby grapefruit segments and coriander in a small bowl. ", "Preheat the oven to 180C/350F/Gas 4 and preheat a griddle to hot.", "Griddle the veal cutlets on each side until browned. Transfer to a roasting tray and roast for about six minutes, turning once in the oven.", "Allow the veal cutlets to rest for a couple of minutes. ", "Squeeze a little ginger juice over the resting cutlet and serve with the burnt chili cucumber pickle."]}, {"isVegetarian": false, "title": "Veal and olive stew", "url": "www_bbc_co_uk_food_recipes_veal_and_olive_stew_67582", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4oz rose veal shoulder, cut into 4cm/1½in chunks", "1 tbsp plain flour", "3 tbsp olive oil", "100g/3½oz pancetta, bacon lardons, or similar", "2 onions, finely chopped", "2 sticks celery, finely chopped", "3 carrots, thinly sliced", "4 garlic cloves, finely chopped ", "500ml/18fl oz white wine", "100ml/3½fl oz chicken stock", "1 piece pared lemon zest", "2 bay leaves", "1 large sprig thyme", "2 sprigs rosemary", "200g/7oz fresh tomatoes, peeled and finely chopped or puréed", "150g/5½oz green olives", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dust the veal pieces in the flour and season with salt and pepper. Heat a tablespoon of the olive oil in a large frying pan and fry the veal on both sides. Do this in two batches, using another tablespoon of olive oil for the second batch. Set the veal aside.", "Heat the remaining tablespoon of olive oil in a large casserole. Add the pancetta and fry on a medium–high heat until crisp and brown and the the fat should has started to render out. ", "Add the onions, celery and carrot and reduce the heat. Fry until the vegetables have taken on some colour and softened slightly – around 10 minutes.", "Add the garlic and cook for a couple of minutes, then add the veal to the casserole. Deglaze the frying pan with some of the white wine and pour this over the veal, then add the rest of the wine to the casserole, along with the chicken stock. ", "Add the lemon zest and herbs and season with salt and pepper. Bring to the boil, then turn down and cover. Simmer for 45 minutes.", "Add the tomatoes and olives and cook for a further half an hour, uncovered, to allow the sauce to reduce down a little. Serve."]}, {"isVegetarian": false, "title": "Veal escalopes with salsa verde", "url": "www_bbc_co_uk_food_recipes_veal_escalopes_with_13599", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 lemons", "1 small bunch fresh mint leaves", "1 small bunch fresh flatleaf parsley, leaves only", "½ small bunch fresh dill", "½ small bunch fresh chervil", "1 small bunch fresh tarragon", "1 bulb garlic, cut in half horizontally", "250ml/9fl oz extra virgin olive oil", "1kg/2lb 4oz veal cushion (a joint from the leg), cut into 2cm/¾in thick slices", "1 shallot, finely chopped", "2 sprigs fresh basil, leaves only", "3 anchovies, drained, finely chopped", "1 tbsp Dijon mustard", "1 tbsp capers, drained", "300g/10½oz spinach leaves", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["First prepare your barbecue: light the barbecue so that it flares up and dies down, then wait until the coals are glowing but have not yet turned white. Alternatively, heat a griddle pan over a high heat until very hot.", "Zest two of the lemons into a large bowl, then squeeze in the juice. Add a few of the sprigs of mint, parsley, dill, chervil and tarragon, and the halved garlic bulb. Pour in 150ml/5fl oz of the extra virgin olive oil, mix until well combined and set aside.", "Sandwich the veal slices between two long sheets of cling film. Bash them with a rolling pin until they are about 1cm/½in thick, then add them to the herby oil and stir to coat. Set aside.", "Finely chop the remaining herbs together and add them to a bowl with the shallot. Zest over two of the lemons, then chop again. Stir in the anchovies and chop again, then stir in the Dijon mustard and capers and chop until fine. Season, to taste, with salt and freshly ground black pepper, then make a well in the centre of the mixture.", "Lift the veal slices out of the marinade and lay them on the barbecue or griddle pan. Cook for 2-3 minutes on one side, then 2 minutes on the other side. Transfer to a serving platter.", "Meanwhile, heat 50ml/2fl oz of the remaining oil to a frying pan. Add the spinach leaves and cook until just wilted, then lay them on top of the veal slices.", "Cut the remaining lemon into wedges. Drizzle the remaining oil into the well in the centre of the salsa verde mixture, then mix together to form a thick paste. Spoon the salsa verde on top of the veal and spinach. Garnish the platter with the lemon wedges."]}, {"isVegetarian": false, "title": "Veal kidneys in a creamy mustard sauce with pilau rice and wilted spinach", "url": "www_bbc_co_uk_food_recipes_veal_kidneys_in_a_creamy_76920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "300g/10½oz basmati rice", "450ml/16fl oz chicken stock", "salt and freshly ground black pepper", "2 whole veal kidneys, cleaned and trimmed", "5 tbsp olive oil", "2 shallots, chopped", "25g/1oz butter", "2 tbsp brandy", "4 tbsp dry white wine", "250ml/9fl oz double cream", "2 tsp wholegrain mustard ", "1 tsp Dijon mustard ", "1 tsp mixed herb or tarragon mustard ", "50g/1¾oz unsalted butter", "1-2 garlic cloves, chopped", "50g/1¾oz spinach (large leaf or baby)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pilau rice, heat the butter and olive oil in a large pan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, or until softened. Add the rice and stir well to coat. Pour in the stock, stir well and then bring the mixture to the boil.", "Reduce the heat until the liquid is simmering. Cover the pan with a lid or aluminium foil and continue to simmer for 15-18 minutes, until the rice has absorbed the stock and is tender. Season, to taste, with salt and pepper.", "For the veal kidneys, carefully cut away the surrounding fat on the kidneys, then turn them upside down to reveal the fatty sinews. With the point of a sharp knife, cut around the sinews so the kidneys come away clean. Divide the kidneys into bite sized pieces, following the natural lobes as much as possible. ", "In a heavy-based frying pan, heat a little olive oil until smoking hot. Add the kidneys and season lightly with salt and pepper. Cook for 3-4 minutes (depending on size), turning the kidneys to seal all over. Tip into a colander to drain. The kidneys should still be very pink when they finish cooking in the sauce. ", "In the same pan, gently fry the shallots in the butter over a medium heat, stirring frequently, for 5 minutes without letting them colour. Increase the heat, add the brandy and cook until the volume of liquid is reduced by half. Add the wine and again reduce by half. Add the cream and reduce to a light sauce. Remove from the heat and whisk in all the mustards. Reheat gently, do not boil or it will become bitter. Add the kidneys and heat through. ", "To serve, melt the butter in a sauté pan. Add the garlic and fry for 1-2 minutes, then add the spinach and cook until wilted. You might need to add 1-2 tablespoons of water if the spinach starts to stick to the pan.", "Serve the kidneys, rice and wilted spinach in shallow serving bowls with the sauce poured over the kidneys."]}, {"isVegetarian": false, "title": "Veal fillet on pea mayonnaise with tomato and green pepper vinaigrette", "url": "www_bbc_co_uk_food_recipes_veal_fillet_on_pea_29783", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "85g/3oz butter", "4 veal fillet steaks", "12 stems asparagus", "3 tbsp chicken stock", "4 tbsp dry white wine", "6 tomatoes, deseeded and finely diced", "1 tbsp green peppercorns in brine, drained", "1 tbsp fresh parsley, chopped", "4 tbsp groundnut oil", "1 tbsp white wine vinegar", "2 egg yolks", "1 tsp Dijon mustard", "½ lemon, juice only", "140ml/¼ pint rapeseed oil", "140ml/¼ pint groundnut oil", "55g/2oz purée of cooked peas", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and 55g/2oz butter in a large frying pan. Cook the veal to your liking, then remove from the pan and keep warm. ", "Tip the fat out of the pan and add the stock and wine. Heat until reduced in volume by half. ", "For the pea mayonnaise, in a large bowl whisk together the egg yolks and mustard. Add the lemon juice and gradually beat in the oils. Once the right consistency is reached, add the pea purée and mix well. Season with salt and pepper.", "For the vinaigrette, mix the tomatoes with the green peppercorns, parsley, groundnut oil and white wine vinegar. Mix in the white wine and stock reduction from the cooking pan.", "For the asparagus, cook the asparagus in salted boiling water for 3-5 minutes, until just tender. Remove and plunge into iced water. Drain well and remove the tips. Cut each stalk into three. ", "Melt the remaining butter in a frying pan. Add the tips and chopped stalks and cook for three minutes.", "To serve, put the mayonnaise in the middle of the plate and sprinkle over the chopped asparagus stalks. Place the veal on top and dribble the vinaigrette around the outside of the plate. Finish with asparagus tips."]}, {"isVegetarian": false, "title": "Veal blanquette", "url": "www_bbc_co_uk_food_recipes_vealblanquette_92615", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz breast of veal, cut into 4cm/1½in cubes", "1 large onion, peeled, left whole, studded with 2 cloves", "2 carrots, peeled", "1 leek, white part only", "1 bouquet garni (bundle of 1 sprig fresh flatleaf parsley, 1 sprig fresh thyme and 1 fresh bay leaf)", "salt, to taste", "25g/1oz butter", "1 tbsp olive oil", "1 onion, finely diced", "1 garlic clove, finely diced", "300g/11oz basmati rice", "450ml/16floz chicken stock", "24 small cocktail onions, peeled", "cooking liquid from the veal (see above)", "250g/9oz small button mushrooms, trimmed", "cooking liquid from the onions and mushrooms (see above)", "300ml/11fl oz double cream", "2 free-range egg yolks, ", "2 tbsp crème fraîche", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal, place the cubes of meat into a large saucepan, cover with cold water and bring to the boil. ", "When the water is boiling, reduce the heat until the water is simmering gently, then simmer for 30 minutes, skimming off any froth that collects of the surface of the liquid at intervals. ", "Add the vegetables, bouquet garni and a large pinch of salt, or to taste. Continue to simmer for a further 1 hour 20 minutes, adding more water as necessary to cover the veal and vegetables. (NB: The pan contents should be covered by the water at all times.)", "While the meat is simmering, carefully decant 500ml/18floz of the cooking liquid.", "Meanwhile, for the pilau rice, heat the butter and olive oil in a frying pan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, or until softened.", "Add the rice and stir well to coat.", "Pour in the stock, stir well, then bring the mixture to the boil.", "Reduce the heat until the liquid is simmering. Cover the pan and continue to simmer for 15-18 minutes until the rice has absorbed the stock and is tender. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the onions and mushrooms, place the cocktail onions into a separate pan and pour over the decanted cooking liquid. Bring the cooking liquid to the boil, then reduce the heat until the liquid is simmering. ", "Continue to simmer the onions for 10-15 minutes, or until tender. Add the mushrooms, cover the pan with a lid and continue to simmer for a further 10 minutes, or until the vegetables are tender.", "Drain the onions and mushrooms, collecting the cooking liquid in the pan with the veal in it. Keep the drained onions and mushrooms warm. ", "When the veal pieces are tender, remove them from the pan and set aside. Keep warm.", "For the sauce, strain the cooking liquid from the onions and mushrooms into a clean saucepan (discard the vegetables).", "Bring the cooking liquid to a boil and continue to boil for 12-15 minutes, or until the volume of liquid has reduced by half. ", "Stir in the double cream, then return the mixture to the boil for a further 4-5 minutes. ", "Meanwhile, in a bowl, mix together the egg yolks and crème fraîche until well combined.", "Remove the pan from the heat, then stir in the egg yolk and crème fraîche mixture. Stir continuously until the mixture is completely incorporated and the sauce has thickened slightly. Season, to taste, with salt and freshly ground black pepper, then strain the mixture through a fine sieve. ", "To serve, spoon some of the veal, onions and mushrooms into the centre of each of six to eight serving plates. Drizzle over the sauce."]}, {"isVegetarian": false, "title": "Veal chop with spatzle and red wine sauce", "url": "www_bbc_co_uk_food_recipes_vealchopwithspatzlea_89437", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 veal chops, trimmed", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp chopped fresh dill", "2 tbsp chopped fresh chervil", "2 tbsp chopped fresh chives", "75g/3oz Japanese breadcrumbs (also sold as panko)", "50g/2oz butter", "500g/1lb 2oz plain flour", "4 free-range eggs", "2 tbsp double cream", "2 tbsp chopped fresh dill", "2 tbsp chopped fresh chives", "2 tbsp chopped fresh chervil", "50g/2oz butter", "2 tbsp olive oil", "300ml/11fl oz beef or veal stock", "110ml/4fl oz) red wine", "50g/2oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "For the veal, season the veal chop with salt and freshly ground black pepper, then rub the olive oil into the veal.", "Mix the herbs and the breadcrumbs in a bowl until well combined. Press the veal chops into the breadcrumbs to coat.", "Heat a frying pan until hot, add the butter and, when foaming, add the veal chops. Fry for 2-3 minutes on each side, or until golden-brown. Place in the oven for 8-10 minutes, or until cooked through.", "For the spätzle, bring a saucepan of salted water to the boil.", "Blend all the spätzle ingredients, except the butter and olive oil, in a food processor to form a dough. Season to taste with salt and freshly ground black pepper.", "Place a spoonful of the dough onto a clean work surface. With the palm of your hand, roll the dough into a thin sausage-shape 2-3cm long. Repeat with the rest of the mixture.", "Carefully drop the spätzle into the boiling water and cook for 1-1½ minutes. Drain and rinse in iced water to refresh.", "Heat a frying pan until hot, add the butter, olive oil and spätzle and fry for 1-2 minutes until coloured.", "For the sauce, place the stock into a saucepan, bring to the boil, then turn down the heat and simmer for 5-7 minutes until the liquid has reduced by two thirds.", "Add the red wine and repeat, cooking until the liquid has reduced by two thirds.", "Add the butter, season to taste with salt and freshly ground black pepper, and whisk until the sauce is glossy.", "To serve, place a veal chop onto each serving plate. Pile a helping of the spätzle alongside and pour a spoonful of the red wine sauce over the veal."]}, {"isVegetarian": false, "title": "Veal escalopes with prosciutto, sage and mozzarella", "url": "www_bbc_co_uk_food_recipes_vealescalopeswithpar_72315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 175g/6oz veal escalopes or 4 275g/10oz chops", "8 fresh sage leaves, 4 finely chopped", "50g/2oz parmesan cheese, freshly grated", "salt ", "freshly ground black pepper", "4 thin slices Parma ham", "50g/2oz unsalted butter", "1 tbsp olive oil", "4 roasted peppers", "1 ball buffalo mozzarella, cut into 8 slices", "4 tbsp dry white wine", "4 tbsp veal stock", "300g/10½oz green beans", "1 tbsp olive oil", "handful chopped mint", "1 lemon, juice only", "1 clove garlic, sliced thinly"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the escalopes or chops on a board, cover them with cling film and beat each one with a meat mallet or rolling pin until they are about 5mm/¼in thick.", "Place one sage leaf in the centre of each escalope, sprinkle with parmesan, and season with a scant amount of salt and a decent grinding of black pepper. Top each with one slice of Parma ham, pushing down so the ham seals itself to the escalope.", "Heat half the butter and the oil in a large, heavy-based frying pan. Cook the escalopes, Parma ham side down, for two minutes, then turn them over and cook for a further one minute on the other side. Remove and set aside to keep warm, ham side up, reserving the pan and it's juices. ", "Preheat your grill. Place two slices of pepper and mozzarella on each escalope, then grill the escalopes until the cheese is melting. ", "Meanwhile, add the chopped sage to the frying pan and cook for 30 seconds. Pour in the wine and stock and boil to emulsify and reduce by half. Whisk in the remaining butter and season to taste.", "Place one escalope on each of four warmed plates, spoon over the sage butter sauce and serve with new potatoes.", "For the green beans - steam the green beans until tender.", "Toss with the remaining ingredients and serve."]}, {"isVegetarian": false, "title": "Veal escalope with garlic cream mushrooms", "url": "www_bbc_co_uk_food_recipes_vealescalopewithgarl_90138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "100g/3½ oz veal, flattened with a meat mallet or rolling pin", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp butter", "85g/3oz button mushrooms, quartered", "1 garlic clove, crushed", "1 tbsp grain mustard", "2 tbsp clotted cream", "salt and freshly ground black pepper", "2 tbsp chopped fresh chives", "handful of fresh herb leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the veal escalope, heat the oil and butter in a pan and season the veal with salt and freshly ground black pepper. Fry for 1-2 minutes on both sides, or until golden-brown, then transfer to the oven for 4-5 minutes, or until cooked through. Remove and allow to rest on a warm plate. ", "For the garlic cream mushrooms, heat the oil and butter in a frying pan and gently fry the mushrooms and garlic for 4-5 minutes, or until the mushrooms are browned. Stir in the mustard, cream and season, to taste, with salt and freshly ground black pepper. Cook for a further 2-3 minutes, then stir in the chives.", "Spoon the creamy mushrooms onto a serving plate and place the veal on top. Place a handful of fresh herbs to the side and serve."]}, {"isVegetarian": false, "title": "Veal schnitzel with apple and tomato ragù", "url": "www_bbc_co_uk_food_recipes_vealschnitzelwithapp_90137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread", "1 tbsp chopped fresh basil", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh chervil", "1 garlic clove, chopped", "salt and freshly ground black pepper", "100g/3½ oz veal ", "2 tbsp plain flour", "2 free-range eggs, beaten", "25g/1oz butter", "1 tbsp olive oil", "1 dessert apple, peeled, cored and chopped", "55g/2oz cherry tomatoes, quartered", "½ red onion, sliced", "2 tbsp brown sugar", "2 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the veal, place the bread, herbs, garlic, salt and freshly ground black pepper into a food processor and pulse to crumbs. Tip out onto a baking sheet.", "Dust the veal in the flour, then dip in the beaten egg and coat in the breadcrumbs. Heat the butter in an ovenproof frying pan until frothing, then fry the veal for 2-3 minutes on both sides, or until golden-brown. Transfer to the oven to cook for a further 5-6 minutes, or until crisp and cooked through. ", "For the ragu, place all of the ragu ingredients in a small pan and cook down for 6-8 minutes, or until the apples are tender. ", "Spoon the ragu onto a serving plate and place the schnitzel on top."]}, {"isVegetarian": false, "title": "Veal escalopes with onion chutney", "url": "www_bbc_co_uk_food_recipes_vealwithonionchutney_76986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3¾oz veal escalope", "75g/2¾oz breadcrumbs", "1 tbsp olive oil", "25g/1oz mozzarella, sliced", "1 tbsp olive oil", "½ onion, chopped    ", "1 clove garlic, chopped", "3 tbsp red wine vinegar", "4 tbsp brown sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Coat the veal in the breadcrumbs. Heat the olive oil in an ovenproof frying pan and fry the veal until golden on both sides.", "Place the slices of mozzarella on top of the veal and transfer to the grill for three minutes or until the cheese has melted.", "For the chutney, heat the olive oil in a small saucepan. Add onion and garlic and fry until golden. ", "Add the vinegar and brown sugar and simmer for 5-6 minutes.", "Serve the chutney on top of the veal."]}, {"isVegetarian": false, "title": "Veal with tomato and mozzarella", "url": "www_bbc_co_uk_food_recipes_vealwithtomatoandmoz_82881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6-8 tbsp olive oil", "½ large or 1 small red onion, finely chopped", "2 cloves garlic", "salt and freshly ground black pepper", "2 x 400g/14oz tins chopped tomatoes", "200ml/7fl oz vegetable stock", "4 x 175g/6oz veal escalopes", "flour, for dusting", "1 ball buffalo mozzarella, cut into 4 slices"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat half the olive oil in a frying pan. Fry the onion for 5-7 minutes until soft and translucent. ", "Add the whole garlic cloves and cook for about one minute. Season with salt and freshly ground black pepper.", "Add the chopped tomatoes and the stock. Let the mixture simmer and reduce for about 40 minutes. You may wish to add more stock and let it boil for longer, or add further seasoning, according to taste.", "Place the veal escalopes on a board and cover them in cling film. Beat each one with a meat mallet or rolling pin until they are about 1cm/½in thick.", "Coat the veal in flour, salt and freshly ground black pepper, then heat the remaining olive oil and sauté the veal for 2-3 minutes on each side.", "Add the sauce to the frying pan, then place a slice of mozzarella on each veal escalope, and spoon some of the sauce on top. Simmer for five minutes. ", "Serve immediately."]}, {"isVegetarian": true, "title": "Vegan chocolate mousse with honeycomb and caramelised apricots", "url": "www_bbc_co_uk_food_recipes_vegan_chocolate_mousse_39814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz silken tofu, drained", "150g/5½oz vegan dark chocolate, broken into pieces", "1 vanilla pod, seeds only", "½ tsp ground star anise", "2 tbsp treacle", "agave syrup, to taste", "20g/¾oz toasted flaked almonds, to serve", "100g/3½oz caster sugar", "100ml/3½fl oz glucose syrup", "2 tbsp golden syrup", "pinch bicarbonate of soda", "1 tbsp vegetable oil", "4 preserved apricots", "1 star anise", "pinch sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the tofu in a bowl and blend with a hand blender until you have a purée.", "Melt the chocolate in a heatproof glass bowl sat over a saucepan of simmering water, being careful not to let the bowl touch the water. ", "Whisk in the tofu, ground star anise, vanilla seeds and agave syrup, to taste. Spoon into a glass and refrigerate until set.", "Line a baking tray with baking paper.", "To make the honeycomb, put the sugar, glucose and golden syrup into a deep saucepan and heat until it reaches 145C. (This should take about 5 minutes.)", "Quickly whisk in the bicarbonate of soda. Be careful as the mixture will bubble up very suddenly. Quickly pour onto the lined baking tray. Set aside to cool and harden.", "To make the apricots, heat the oil in a frying pan. Add the apricots and star anise and cook until the apricots start to caramelise. Sprinkle over a pinch of sugar and leave to cool.", "To serve, sprinkle the toasted almonds on top of the mousse and serve with the apricots and honeycomb.  "]}, {"isVegetarian": true, "title": "Vegan chocolate orange truffle bites", "url": "www_bbc_co_uk_food_recipes_vegan_chocolate_orange_20436", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_chocolate_orange_20436_16x9.jpg", "ingredients": ["200g/7oz coconut oil, plus extra for greasing", "100g/3½oz cocoa powder", "6 tbsp maple syrup", "2 tsp vanilla extract", "1 tsp orange extract", "pinch salt", "60g/2¼oz goji berries (available from health-food stores)", "½ organic orange, zest only, julienned"], "serves": "Makes 24 pieces", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Grease a small rectangular glass dish (approximately 17cm/7in x 11cm/4in) with a little coconut oil. Line with baking parchment.", "Heat the coconut oil in a saucepan over a low heat until melted. Whisk in the cocoa powder until smooth and well combined.", "Stir in the maple syrup, vanilla extract, orange extract and salt until well combined, then stir in almost all of the goji berries, reserving a small handful for decoration.", "Pour the fudge mixture into the prepared tin, then sprinkle over the remaining goji berries and the orange zest, pressing them gently onto the surface.", "Chill in the fridge for 1 hour, or until set. ", "Slice with a sharp knife and serve."]}, {"isVegetarian": true, "title": "Vegan nachos", "url": "www_bbc_co_uk_food_recipes_vegan_nachos_02050", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_nachos_02050_16x9.jpg", "ingredients": ["400g/14oz butternut squash, chopped into 2.5cm/1in rounds", "150g/5½oz cashew butter", "1 tbsp pickled Jalapeños, plus 1 tbsp pickling juice", "1 large garlic clove, finely chopped", "3–4 tbsp nutritional yeast", "3 tbsp almond milk (or alternative vegan milk)", "½ lemon, juice only", "salt and freshly ground black pepper", "7 wholemeal tortillas wraps, each cut into 6 triangles", "7 white tortillas wraps, each cut into 6 triangles", "4 medium tomatoes, roughly chopped", "2 red onions, roughly chopped", "2 avocados, halved and roughly chopped", "handful fresh coriander, roughly chopped"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with baking paper.", "Place the butternut squash onto the baking tray and roast for 30 minutes, or until soft and moisture is being released from the flesh. Set aside to cool.", "Meanwhile, spread the tortillas over a few baking trays (ensuring they don't overlap, if possible) and bake for 15–20 minutes, turning half way through cooking. ", "Remove the skin from the butternut squash flesh and discard. Put the squash into a food processor with the remaining sauce ingredients and blend until very smooth.", "Scatter a third of the crispy tortillas into an ovenproof dish, cover with a third of the tomatoes, onion and sauce. Repeat this process until everything has been used up. Top with the avocado and coriander and serve."]}, {"isVegetarian": true, "title": "Vegan prune and ginger tart with almond pastry", "url": "www_bbc_co_uk_food_recipes_vegan_prune_and_ginger_17804", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegan_prune_and_ginger_17804_16x9.jpg", "ingredients": ["25g/1oz coconut oil, melted, plus extra for greasing ", "160g/5¾ oz ground almonds", "pinch sea salt", "pinch bicarbonate of soda", "1½ tbsp maple syrup ", "½ tsp vanilla extract", "250g/9oz soft prunes", "5 tbsp coconut oil", "3 tbsp freshly pressed ginger juice (available online, or see tip)", "2 tsp finely grated root ginger", "3 tsp vanilla extract", "2 pinches salt "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Lightly grease 4 mini tart tins, 10cm/4in in diameter, with a little coconut oil.", "For the pastry, pulse all of the pastry ingredients in a food processor until the mixture just comes together as a dough. Turn out onto a clean work surface and press into a smooth ball, using your hands. Wrap in cling film and chill for 10 minutes in the fridge.", "Cut the dough into 4 equal-sized pieces, then roll each into a ball. Flatten each ball between the palms of your hands, then place into the prepared tart tins. Use your fingers to spread and smooth the pastry thinly and evenly across the base and sides of each tin. Don't worry about breaking the pastry-just patch up any holes and aim for the thinnest finish possible.Trim away any excess pastry using a sharp knife. Prick the base of each pastry case several times with a fork. Chill in the fridge for at least 20 minutes.", "Bake for 10-12 minutes, or until the edges are pale golden-brown. Remove and set aside to cool and crisp up. Gently turn out the pastry cases onto a wire rack and set aside to cool completely. ", "Meanwhile, for the filling, blend all of the ingredients together in a food processor until smooth. Add more ginger and salt, to taste. ", "Spread the filling mixture into the cooled tart cases, smoothing each into an even layer. Chill in the fridge until needed, or serve at room temperature."]}, {"isVegetarian": true, "title": "Vegan sweet shortcrust pastry", "url": "www_bbc_co_uk_food_recipes_veganpastry_83823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz plain flour", "55g/2oz icing sugar", "55g/2oz soya margarine"], "serves": "Makes enough for a 9in flan tin", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and icing sugar into a large bowl and add the soya margarine. ", "Use your fingertips to rub the fat into the flour until you have a mixture that resembles coarse breadcrumbs with no large lumps of margarine remaining. Try to work quickly so that it doesn't become greasy.", "Bring the mixture together to form a dough, adding extra flour if the mixture is too wet, or some water if too dry, a teaspoon at a time.", "Wrap the dough in cling-film and chill for 10-15 minutes before using."]}, {"isVegetarian": false, "title": "Vegetable and chorizo soup", "url": "www_bbc_co_uk_food_recipes_vegetable_and_chorizo_81634", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_and_chorizo_81634_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 leek, cut into small chunks", "1 large carrot, cut into small chunks", "1 sweet potato, cut into small chunks ", "1 celery stalk, cut into small chunks", "sea salt and freshly ground black pepper", "1 tsp ground cumin", "1 x 400g/14oz can chopped tomatoes", "2 tbsp balsamic vinegar ", "small bunch thyme, tied together with string (optional)", "570ml/1 pint vegetable stock", "150g/5oz green beans, trimmed", "1 raw chorizo sausage (about 110g/4oz), cut into small chunks"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil  in a large pan over a medium heat. Add the leek, carrot, sweet potato and celery and fry for 10-12 minutes, or until the vegetables start to soften but don't colour.", "Season with salt and freshly ground black pepper and add the cumin, tomatoes, balsamic vinegar, thyme, vegetable stock and green beans. Bring to the boil then reduce the heat and simmer for 40-45 minutes, or until the vegetables are tender.", "Meanwhile, heat a frying pan over a medium-high heat and fry the chorizo for 10-12 minutes, or until crisp and golden-brown. ", "Remove the thyme from the soup and stir in the chorizo. Season, to taste, with salt and freshly ground black pepper.", "Ladle the soup into warm soup bowls and serve with crusty bread on the side."]}, {"isVegetarian": true, "title": "Vegetable bhuna", "url": "www_bbc_co_uk_food_recipes_vegetable_bhuna_17476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 spring onions, sliced", "¼ fresh pepper, chopped", "50g/2oz French beans, trimmed", "4 baby sweetcorn", "4 baby new potatoes, quartered", "1 tsp madras curry paste", "100g/3½oz chopped tomatoes", "2-3 fresh cauliflower florets"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to  180C/350F/Gas 4.", "Put all of the ingredients and 125ml/4fl oz water into a small lidded ovenproof dish and mix until well combined. ", "Cover with the lid and bake in the oven for 30-40 minutes, or until the potatoes are cooked through."]}, {"isVegetarian": true, "title": "Vegetable biryani", "url": "www_bbc_co_uk_food_recipes_vegetable_biryani_50072", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_biryani_50072_16x9.jpg", "ingredients": ["1 small carrot, peeled, cut into small cubes", "1 medium potato, peeled, cut into small cube", "¼ green pepper, diced", "¼ red pepper, diced", "25g/1oz French beans, finely chopped", "50g/2oz frozen peas", "1 tsp tomato purée", "½ tsp finely chopped green chillies", "1 tsp garam masala", "¼ tsp ground turmeric ", "225g/8oz cooked basmati rice", "1 small onion, finely chopped", "4 roasted cashew nuts, chopped", "½ tsp cumin seeds, toasted", "½ tsp red chilli powder", "yoghurt, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/235F/Gas 3.", "Cook the carrot, potato, peppers, French beans and peas in a pan of boiling water for 3-4 minutes, or until tender. Drain and return to the pan. ", "Add the tomato purée, green chillies, garam masala and turmeric to the vegetables and mix until well combined.", "Place half of the rice at the bottom of an ovenproof dish, spread the vegetable mixture on top, and then place the rest of the rice on top, spreading it evenly.", "Sprinkle the top layer of rice with the chopped onions, cashew nuts, cumin seeds and red chilli powder. Cover with aluminium foil and bake for 15 minutes. ", "Serve with yoghurt."]}, {"isVegetarian": true, "title": "Vegetable crisps", "url": "www_bbc_co_uk_food_recipes_vegetable_crisps_47848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 parsnip ", "2 beetroot, look for yellow or orange varieties as well as purple", "1 carrot ", "1 litre/1¾ pints vegetable oil ", "salt, to taste"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Slice the vegetables using a Japanese mandolin.", "Heat the oil in a deep-fat fryer or heavy-based saucepan to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Add one type of sliced vegetables to the hot fat at a time and once browned and cooked through, remove with a slotted spoon and transfer to a plate lined with kitchen paper. Repeat with all three types of vegetable.", "Sprinkle with salt to serve."]}, {"isVegetarian": true, "title": "Vegetable curry with tomato and garlic naan", "url": "www_bbc_co_uk_food_recipes_vegetable_curry_with_43231", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large potato, peeled and cut into 2cm/¾in cubes  ", "1 small butternut squash, peeled, deseeded and cut into 2cm/¾in cubes  ", "1 aubergine, cut into 2cm/¾in cubes  ", "6 tbsp tikka masala curry paste", "3 tbsp vegetable oil", "2 onions, finely sliced", "700g/1lb 9oz tomatoes, roughly chopped", "400ml tin coconut milk", "2 red peppers, thickly sliced", "2 courgettes, cut into 2cm/¾in cubes  ", "few coriander sprigs, to serve", "salt and freshly ground black pepper", "500g/1lb 2oz plain white flour", "1 tsp baking powder", "1 tbsp salt", "400ml/14fl oz whole milk", "50ml/2fl oz vegetable oil", "4 fresh tomatoes, roughly chopped", "2 garlic cloves, finely chopped", "100g/3½oz butter or ghee, melted "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the curry, put the potato, squash and aubergine into a large roasting tin and coat with 2 tablespoons of the masala paste and 2 tablespoons of the oil. Season with salt and pepper and roast for 30 minutes. ", "Heat the remaining oil in a large saucepan over a medium heat and fry the onions for 10 minutes, until soft and golden brown. Stir in remaining masala paste and cook for a further 3 minutes. Add the tomatoes, coconut milk and 100ml/3½fl oz water. Bring to the boil and simmer for 10 minutes. ", "Add the roasted vegetables to the pan, along with the peppers and courgettes and simmer for 10–15 minutes, until tender. ", "To make the naan, preheat the oven to 230C/210C Fan/Gas 8.", "Place the flour, baking powder, salt, milk and oil in a large bowl and mix to form a smooth dough. Allow to rest for 1 hour.", "Roll out the dough into naan shapes and top with the tomatoes and garlic. Bake for 10 minutes until puffed up. You can finish the naan under a hot grill if you wish.", "Scatter the curry with coriander and serve with the naan breads on the side. "]}, {"isVegetarian": true, "title": "Vegetable garden risotto", "url": "www_bbc_co_uk_food_recipes_vegetable_garden_risotto_60989", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_garden_risotto_60989_16x9.jpg", "ingredients": ["250g/10oz broad beans ", "50g/2oz butter", "3 tbsp olive oil", "1 tbsp chopped fresh mint leaves", "1 onion, finely chopped", "2 garlic cloves, crushed", "3-4 sprigs fresh thyme", "1 long strip lemon zest", "1 bay leaf", "150g/5oz Arborio risotto rice", "150ml/5oz dry white wine", "750ml/1 pint 7fl oz  hot vegetable stock", "100g/3½oz peas", "1 bunch asparagus, trimmed and cut into short lengths", "100g/3½oz fresh runner beans, de-stringed and cut into long thin strips", "100g/3½oz feta cheese, drained and crumbled into small pieces", "sea salt flakes and freshly ground black pepper", "parmesan shavings, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a saucepan with water and bring to the boil. Add the broad beans and return to the boil. Cook for one minute then drain in a colander under running water until cold. Remove the beans from their skins and set aside.  Mix the mint with two tablespoons of the olive oil and set aside.", "Melt 25g/1oz of the butter with the remaining oil in a large non-stick saucepan and fry the onion and garlic for five minutes until softened, but not coloured. Stir in the thyme, lemon zest, bay leaf and risotto rice and cook for a few seconds more until the rice is glistening.", "Pour the wine in to the pan and boil over a medium heat until the liquid has reduced by half. Slowly start adding the stock, a ladleful at a time, stirring well between each addition. Simmer for 2-3 minutes or until the liquid has almost all been absorbed before adding more. Cook for 15 minutes or until the rice is tender. ", "Meanwhile, fill a medium saucepan with water and bring to the boil. Cook the runner beans for three minutes, or until tender. Drain in a colander then return to the pan and toss with a small knob of the remaining butter and plenty of ground black pepper.", "Remove the thyme and lemon zest from the rice and discard. Stir in the broad beans, peas and asparagus with the remaining stock and cook for three minutes until tender, stirring regularly. Remove from the heat and stir in the feta. Season with salt and freshly ground black pepper. Cover with a lid and set aside.", "Add the remaining butter to the risotto and stir. Spoon into four deep plates and tap gently on the work surface to spread the risotto slightly.  Spoon over the minted olive oil. Top with the runner beans and shavings of fresh parmesan and serve immediately."]}, {"isVegetarian": true, "title": "Vegetable Mexican chilli with tortilla chips", "url": "www_bbc_co_uk_food_recipes_vegetable_mexican_chilli_39549", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_mexican_chilli_39549_16x9.jpg", "ingredients": ["2 small sweet potatoes, cut into 2cm/¾in cubes ", "2 tsp chilli powder ", "2 tsp paprika ", "pinch ground cinnamon", "4 tbsp olive oil ", "1½ red onions, finely chopped", "2 celery sticks, finely chopped ", "2 carrots, finely chopped", "2 garlic cloves, crushed ", "1 red chilli, finely chopped", "1 red pepper, thinly sliced ", "1 yellow pepper, thinly sliced", "150g/5½oz chestnut mushrooms, quartered", "1 aubergine, cut into 2cm/¾in cubes ", "1 tsp ground coriander", "1 tsp ground cumin", "400g tin kidney beans in chilli sauce", "400g tin plum tomatoes ", "2–3 dashes Worcestershire sauce (optional)", "1–2 dashes Tabasco sauce ", "dash red wine vinegar ", "200ml/7fl oz vegetable stock ", "small bunch fresh coriander, leaves picked and stalks chopped", "salt and freshly ground black pepper", "vegetable oil, for deep-frying", "3 large flour tortillas "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Put the sweet potatoes in a large roasting tin and sprinkle with a teaspoon each of the chilli powder and paprika, and the cinnamon. Season and drizzle with half the oil. Roast for 20 minutes, or until tender. ", "Meanwhile, heat the remaining oil in a large saucepan over a low–medium heat. Fry the onions, celery and carrots gently for 10 minutes, or until softened. Add the garlic and chilli and fry for a minute before adding all the remaining vegetables. Cook for 10 minutes, or until everything is starting to soften. ", "Add the remaining chilli powder and paprika, the ground coriander, cumin and plenty of seasoning and cook for 1–2 minutes. Add the kidney beans, tomatoes, Worcestershire sauce, if using, Tabasco, red wine vinegar and stock. Bring to the boil, reduce the heat and simmer for 20–30 minutes. ", "Add the roast sweet potato and coriander stalks to the chilli and cook for 5 minutes. ", "Meanwhile, make the tortilla chips. Heat the oil in a deep saucepan until it reaches 180°C, or a cube of bread browns in 20 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Cut the tortillas into small triangles and deep-fry in batches for 1–2 minutes, or until crisp. Drain on kitchen paper.", "Garnish the chilli with the coriander and serve with the tortilla chips and some cooked rice, if liked. "]}, {"isVegetarian": true, "title": "Vegetable pakoras and coconut dal", "url": "www_bbc_co_uk_food_recipes_vegetable_pakoras_and_19643", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_pakoras_and_19643_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "1 onion, finely chopped", "2 garlic cloves, finely sliced", "1 tbsp medium curry powder", "200g/7oz split red lentils", "1 x 400ml tin coconut milk", "½-1 tsp salt, to taste", "2 tbsp lime or lemon juice", "freshly ground black pepper", "350g/12oz frozen mixed vegetables, thawed and drained", "4 heaped tbsp chopped fresh coriander (optional)", "150g/5½oz gram flour, sifted", "1½ tsp fine sea salt", "1 tsp hot chilli powder", "1 tsp ground turmeric", "2 tbsp sunflower oil, plus extra for deep-frying", "4 tbsp plain yoghurt", "3-4 tbsp mango chutney", "1 lime, cut into wedges (optional)", "handful chopped fresh coriander (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the coconut dal, heat the oil in a large non-stick saucepan over a low heat. Add the onion and garlic and fry very gently for 5-6 minutes, stirring regularly until softened and just beginning to brown. Stir in the curry powder and cook for a further 30-40 seconds.", "Add the lentils, coconut milk, 400ml/14fl oz water and half a teaspoon of salt to the onion and garlic mixture, then bring it to the boil. Reduce the heat until the mixture is simmering. Simmer, stirring regularly, for 25-30 minutes, or until the lentils are swollen and tender and the dal has thickened. Stir in the lime or lemon juice, season, to taste, with the remaining salt and plenty of freshly ground black pepper, then remove from the heat and set aside until needed. (The dal can be reheated when required; meanwhile, the flavours will intensify as it stands.)", "For the pakoras, in a large mixing bowl, mix the thawed vegetables with the chopped coriander, if using. Add the flour, salt, chilli powder and turmeric and stir to combine and coat the vegetables in the mixture. ", "Stir in the 2 tablespoons of sunflower oil using a large wooden spoon, then gradually add 150ml/5fl oz tepid water in a thin stream, stirring constantly, until the ingredients coating the vegetables form a thick, smooth batter.", "Add enough sunflower oil to reach 2.5cm/1in up the sides of a deep-sided, heavy-based saucepan. Heat the oil to 160C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. Take care not to allow the oil to overheat. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Carefully lower dessertspoonfuls of the pakora batter into the hot oil, in batches of 6 or 7. You will need to push the batter off the spoon using a second spoon. Cook the pakoras for 2½-3 minutes, turning once during cooking, until they are crisp and golden-brown and float to the surface of the oil. Remove the pakoras from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining pakora batter.", "Just before serving, reheat the dal, adding a little extra boiling water to loosen it if necessary. ", "To serve, ladle the dal onto plates with a spoonful of yoghurt and mango chutney alongside. Garnish with a lime wedge and chopped coriander, if using. Serve the pakoras on separate side plates, or as a starter."]}, {"isVegetarian": true, "title": "Vegetable risotto", "url": "www_bbc_co_uk_food_recipes_vegetable_risotto_65864", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium onion, finely chopped", "1 tbsp olive oil", "1 garlic clove,  finely chopped or crushed", "350g/12oz risotto rice", "1 vegetable stock cube", "1 x 400g/14oz can flageolet beans in water", "1 x 198g/7oz can sweetcorn", "125g/4½oz green beans", "100g/3½oz frozen peas", "40g/1½oz parmesan cheese or low-fat mature cheddar cheese, finely grated", "2 tbsp chopped parsley to garnish (optional)", "25g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onion in a microwave-safe bowl. Add the oil and stir well.", "Heat for two minutes on full power.", "Add the garlic and rice to the onions. Stir well and heat for a further two minutes.", "Meanwhile, measure 1 litre/1¾ pints boiling water into a measuring jug, crumble in the stock cube and stir to dissolve. Add the stock to the rice, stir well, cover with a lid or cling film, leaving a small area open, and cook for 10 minutes on full power.", "While the rice is cooking, open the can of flageolet beans and drain and rinse them. Drain the canned sweetcorn and wash and chop the green beans into 2.5cm/1in sticks.", "Stir the rice well before mixing in the green and flageolet beans; then cover and cook for five minutes.", "Mix the sweetcorn and frozen peas into the rice, cover and cook for a final three minutes.", "Lastly, stir in the grated cheese and butter, sprinkle with chopped parsley and serve immediately."]}, {"isVegetarian": true, "title": "Vegetable samosa", "url": "www_bbc_co_uk_food_recipes_vegetable_samosa_35822", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 spring onion, sliced", "50g/2oz cooked potato, chopped into small pieces", "50g/2oz cooked carrot, chopped into small pieces", "1 tbsp frozen peas", "1 tsp korma curry paste", "4 sheets ready-made filo pastry", "vegetable oil, for greasing"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Grease a baking tray.", "Mix the spring onion, potato, carrot, peas and korma paste together in a bowl.", "Lay a sheet of filo pastry lengthways on the work surface. Brush a little oil all over the pastry. Then fold it in half lengthways to make a long, thin rectangle and brush a little more oil on top.", "Place one-quarter of the filling mixture at one end of the strip, leaving a 2cm/1in border. Take the right corner and fold diagonally to the left, enclosing the filling and forming a triangle. Fold again along the upper crease of the triangle. Keep folding in this way until you reach the end of the strip. Brush the outer surface with more oil. Place onto the baking tray and cover while you make the rest of the samosas.", "Bake in the oven for 15-20 minutes, or until golden-brown and crisp."]}, {"isVegetarian": true, "title": "Vegetable samosas with chilli sauce", "url": "www_bbc_co_uk_food_recipes_vegetable_samosas_with_67857", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz plain flour ", "150g/5½oz self-raising flour ", "125g/4½oz butter", "4 tbsp vegetable oil", "1 red onion, finely chopped", "1 tsp finely chopped fresh root ginger", "½ tsp mustard seeds", "1 tbsp ground coriander", "1 tsp ground cumin ", "1 tsp red chilli powder", "½ tsp garam masala", "1 tsp dried mango powder", "1 tsp ground turmeric", "1 tbsp tomato purée", "3 large potatoes, peeled and diced and parboiled until just cooked", "100g/3½oz peas", "½ tsp salt", "4 tbsp chopped fresh coriander leaves", "vegetable oil, for deep-fat frying", "75g/2½oz caster sugar", "2 red chillies, roughly chopped", "3 plum tomatoes, roughly chopped", "8 lime leaves", "2 lemongrass stems, tough outer leaves removed, finely chopped", "25g/1oz roughly chopped fresh root ginger", "2 garlic cloves, peeled, left whole", "2 small shallots, roughly chopped", "4 tbsp Thai fish sauce ", "40ml/1½fl oz sesame oil", "50ml/1¾fl oz dark soy sauce", "2 tbsp clear honey", "3 limes, juice and zest", "110g/4oz crème fraîche"], "serves": "Makes 24 samosas", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the vegetable samosas, preheat a deep-fat fryer to 180C/350F. Or half-fill a deep, heavy-based pan with vegetable oil and heat until a breadcrumb dropped in sizzles and turns golden-brown in 30 seconds. (Caution: hot oil can be dangerous. Do not leave unattended.)", "For the pastry, mix the plain flour, self-raising flour and butter in a bowl. Add a splash of warm water and knead well to make an elastic dough. ", "Divide the dough into 12 small balls and roll each out into a circle. Cut each into two half-circles. You should have 24 half-circles.", "For the filling, heat the vegetable oil in a frying pan. Add the onion and fry until golden-brown. Add the ginger, spices and tomato purée and cook for 2-3 minutes. Add the potatoes and peas and season with salt. Cook the mixture over a low heat, stirring regularly, until the mixture is soft. Finish with the chopped fresh coriander.", "Add a teaspoon of the filling to the middle of one semi-circle and fold into a triangle. Repeat to use up all the dough and filling.", "Deep fry the samosas in the hot oil or deep-fat fryer. Fry in small batches for 4-5 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. ", "For the chilli sauce, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel. ", "Meanwhile, blend all of the remaining chilli sauce ingredients, except the crème fraîche, in a food processor to a smooth purée.", "Once the sugar has caramelised, add the puréed mixture to the caramel and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool.", "Serve the samosas on a plate with a bowl of chilli sauce and a spoonful of crème fraîche."]}, {"isVegetarian": true, "title": "Vegetable scones", "url": "www_bbc_co_uk_food_recipes_vegetable_scones_62237", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp salt", "375g/13oz flour, plus extra for dusting ", "3 tsp baking powder", "200g/7oz of mashed swede", "50g/1¾oz leftover vegetables", "250ml/9fl oz milk", "grated cheese, for topping"], "serves": "Makes Approx 15 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Grease and line a baking tray. ", "Mix the dry ingredients together and add the vegetables. Gradually add the milk until it forms a stiff dough (you may need more or less milk).", "Turn the mixture out onto a lightly floured surface. Pat out to flatten to about 2cm/¾in thick. Use a cutter to stamp out the scones. ", "Sprinkle each scone with a little cheese and place on the prepared baking tray. ", "Bake for about 15 minutes until golden-brown. "]}, {"isVegetarian": true, "title": "Vegetable samosas", "url": "www_bbc_co_uk_food_recipes_vegetable_samosas_24177", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetable_samosas_24177_16x9.jpg", "ingredients": ["250g/9oz plain flour", "1 tsp salt", "2 tsp vegetable oil", "1 free-range egg, separated", "75-150ml/3-5fl oz warm water", "2 large potatoes, peeled", "2 large carrots, finely chopped", "2 tbsp vegetable oil, plus extra for deep-frying", "1 small onion, finely chopped", "½ tsp turmeric", "2 tsp garam masala", "1 tsp black mustard seeds", "1 tsp salt", "½ tsp freshly ground black pepper", "4 garlic cloves, finely chopped", "1 green chilli, seeds removed, finely chopped", "10 curry leaves, finely chopped", "75g/3oz frozen peas, defrosted", "1 tsp lemon juice", "handful fresh coriander leaves"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, mix the flour and salt together in a bowl then pour in the oil and egg yolk and mix together until the mixture resembles breadcrumbs. Gradually stir in enough warm water to form a smooth dough (you may not need all the water). Roll the dough into a ball, wrap in cling film and chill in the fridge for least half an hour", "For the filling, boil the potatoes in a saucepan of salted water for 15-20 minutes, or until just tender, then drain. When cool enough to handle cut into 0.5cm/¼in cubes and set aside. Boil the carrots in a saucepan of salted water for 10-12 minutes, or until tender, then drain. Set aside.", "Heat the two tablespoons of vegetable oil in a large frying pan over a medium heat then add the onion, turmeric, garam masala, mustard seeds, salt and black pepper and fry for about 8 minutes until the onions are softened and translucent and the spices aromatic. ", "Stir in the garlic, chilli, curry leaves, potato and carrot and cook for a further ten minutes then stir in the peas and cook for 2-3 minutes until heated through. Season with the lemon juice, stir in the coriander leaves and set aside to cool.", "To make the samosas, cut the dough into six even-sized pieces and roll into balls. Use a rolling pin to roll each ball into a thin circle, about 15cm/6in diameter. Cut each circle in half to form two semicircles. ", "Take a semicircle and fold into a cone, brushing the edges with the reserved egg white to seal. Fill the cone about half-full with the samosa filling then brush the top edges with egg white and press tightly to seal. Repeat with the remaining dough and filling.", "To cook the samosas half-fill a deep, heavy-based pan with vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended). Fry the samosas in small batches for 4-5 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. Serve."]}, {"isVegetarian": true, "title": "Vegetable spring rolls", "url": "www_bbc_co_uk_food_recipes_vegetable_spring_rolls_79388", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz carrot, grated", "2 tbsp cannellini beans", "50g/2oz beansprouts", "1 spring onion, sliced", "¼ red pepper, sliced", "1 tbsp sweet chilli sauce, plus extra to serve", "8 x 23cm/9in squares ready-made filo pastry", "vegetable oil, for greasing"], "serves": "Makes 4 spring rolls", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Line a baking tray with greaseproof paper.", "Mix the carrot, beans, beansprouts, spring onion, red pepper and sweet chilli sauce together in a bowl.", "Lay a piece of filo pastry on the work surface in a diamond shape. Brush with a little oil, then cover with another piece of pastry. Brush with more oil.", "Spoon one-quarter of the filling onto the corner nearest you. Fold this corner towards the centre and tuck it under the filling. Fold the two outside corners in towards the middle so it looks like an envelope. Brush with oil, then roll up the pastry to look like a sausage. Repeat with the remaining mixture and pastry.", "Bake in the oven for 15-20 minutes, or until crisp and golden-brown."]}, {"isVegetarian": true, "title": "Vegetable ‘tatin’", "url": "www_bbc_co_uk_food_recipes_vegetable_tatin_12785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz puff pastry", "little plain white flour, for dusting", "30g/1oz butter", "1 tbsp rapeseed oil, plus extra for oiling", "1 tbsp sherry vinegar", "1 tbsp light brown sugar", "1 garlic clove, crushed", "1 tsp cumin seeds", "4 baby beetroot, halved through the root", "salt and freshly ground black pepper", "4 sweet pointed peppers, halved and deseeded", "4 carrots", "4 small onions", "1 shallot, finely chopped", "4 breakfast radishes, finely chopped", "1 tsp wholegrain mustard", "1 tbsp cider vinegar", "4 tbsp rapeseed oil", "2 tbsp fresh parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Roll out the puff pastry on a lightly floured surface and cut it to the size of the base of an ovenproof frying pan, then set the pastry aside in the fridge.", " Heat the butter and oil in the pan. Add the vinegar, sugar, garlic and cumin. Add the beetroot, stir well, then season with salt and pepper.", "Put a lid on the pan and transfer to the oven. Cook for 30 minutes, then leave to cool for five minutes.Turn the oven up to 200C/400F/Gas 6.", "Lightly oil the peppers, put them on a baking tray and roast for 15 minutes.", "Meanwhile, boil the carrots and onions in salted water for 8-10 minutes, until just softening, then cool.", "Cut the carrots in half lengthways and the onions in half through the root. Arrange with the beetroot and peppers in the pan, cut-side up. Lay the puff pastry on top of the vegetables and tuck into the sides of the pan.", "Bake for a further 15-20 minutes, or until the pastry is cooked.", "To make the dressing, mix all the ingredients together.", "Allow the tart to sit for five minutes after cooking. Carefully turn the tart out of the pan onto a serving dish, so the pastry is on the bottom. Pour the dressing over and serve."]}]