[{"isVegetarian": true, "title": "Onion bhaji", "url": "www_bbc_co_uk_food_recipes_onionbhaji_85976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/onionbhaji_85976_16x9.jpg", "ingredients": ["2 free-range eggs", "3 onions, sliced", "120g/4oz plain flour", "1 tsp ground coriander", "1 tsp cumin seeds", "3 tbsp vegetable oil, plus extra if required"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Beat the eggs in a bowl.", "Add the onion rings and mix well.", "Add the flour, ground coriander and cumin seeds and stir well to combine.", "Heat the oil in a deep-sided frying pan over a medium heat. When hot add a large spoonful of the bhaji mixture and fry for 30-45 seconds, until golden-brown.", "Turn the bhaji over and fry for a further 30 seconds, until crisp and golden-brown all over. Remove and drain on kitchen paper.", "Repeat with the remaining bhaji mixture, replenishing the oil in the pan if it runs low and allowing it to heat up again after a new addition."]}, {"isVegetarian": true, "title": "Onion bhajis", "url": "www_bbc_co_uk_food_recipes_onionbhajis_77149", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz white onion, chopped", "25g/1oz spinach, chopped", "35g/1¼oz gram flour", "1 tsp fresh root ginger, finely diced", "1 tsp coriander seeds, toasted and ground", "½ green chilli, de-seeded and finely diced", "pinch salt", "pinch red chilli powder", "pinch turmeric", "sunflower oil, for frying", "chaat masala, to serve ( a ground spice mixture available from many Asian grocers - optional)"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the onions, spinach, gram flour, ginger, ground coriander seeds and green chilli together with enough water to bind into a thick batter mixture.", "Add the salt, chilli powder and turmeric and mix thoroughly.", "Heat the sunflower oil in a wok for frying. The oil should come about 2.5cm (1 inch) up the sides of the wok.", "Gently drop a little of the bhaji mixture into the hot oil to test it's hot enough.", "When ready, place golf-ball sized amounts of the mixture into the oil. Reduce the heat and fry gently until golden in colour.", "Remove from the oil and drain on kitchen paper.", "Increase the heat of the oil and return the cooked bhajis to the wok and fry for a second time until crisp and golden brown.", "Sprinkle with chaat masala, if you like, and serve."]}, {"isVegetarian": true, "title": "Onion bhajis, tarka dhal and almond rice", "url": "www_bbc_co_uk_food_recipes_onionbhajistarkadhal_92047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp groundnut or vegetable oil", "5 garlic cloves, peeled, sliced", "1 tsp mixed spice seeds (such as mustard seeds, cumin seeds, coriander seeds and cardamom pods)", "250g/9oz dried split peas, yellow or green", "750ml/1¼ pints water", "150ml/5fl oz Greek-style yoghurt", "75g/2¾oz  gram flour (besan) or plain flour, plus 2 tbsp extra, for dusting", "½ tsp ground cumin", "½ tsp garam masala", "pinch salt", "1-2 red or green chillies, finely sliced", "1 large white onion, sliced", "30g/1oz coriander, leaves only, washed and chopped ", "1 lime, juice only", "¾ tsp ground turmeric", "1 litre/1¾ pints sunflower oil", "2 tbsp butter", "80g/3oz flaked almonds", "350g/¾lb basmati rice", "500ml/17fl oz water", "plain or Greek-style yoghurt", "ready-made mango chutney", "4 sprigs fresh coriander"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tarka dhal, heat the oil in a heavy-based, medium saucepan over a low to medium heat. Add the garlic and spice seeds and fry for 4-5 minutes, or until golden-brown. (CAUTION: The spice seeds may pop during cooking. Cover the pan with a lid and keep the eyes and face away.) ", "Add the split peas and stir well to coat them in the oil and spices. ", "Pour over the water and bring to the boil, skimming off any white foam from the top of the liquid at intervals. ", "When the water is boiling, reduce the heat until the mixture is simmering, then cover the pan and continue to simmer for 35-45 minutes, stirring occasionally, until the split peas are tender and have absorbed all of the water. ", "Meanwhile, for the onion bhajis, in a large mixing bowl, stir together the yoghurt, gram or plain flour, ground cumin, garam masala and salt. Add three tablespoons of water and stir until smooth and well combined. Set aside to rest for 15 minutes.", "When the bhaji batter has rested, stir in the chillies, onion, coriander, lime juice and ground turmeric until well combined. Set aside for a further 15 minutes. ", "Meanwhile, for the almond rice, measure the rice in a measuring jug and take note of the volume - you will need double this amount of water to cook the rice. ", "Heat the butter in a pan over a low heat. When the butter has melted, add the almonds and fry gently for 2-3 minutes, or until pale golden-brown.", "Stir in the rice, then pour over the water. Cover and bring the mixture to a simmer. ", "Reduce the heat to a low simmer, cover with the lid and continue to cook for 8-10 minutes. Turn off the heat and leave the rice to steam on the residual heat for a further 4-5 minutes, then fluff up the grains with a fork before serving.", "For the bhajis, heat the oil in a deep, heavy-based pan or a deep-fat fryer until a breadcrumb sizzles and turns golden-brown when dropped into it. ", "Using a dessertspoon, lower dollops of the bhaji batter into the hot oil in batches of four. Fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides and cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm.", "Repeat the process with the remaining bhaji batter until you have twelve bhajis.", "When the tarka dhal is ready, mash the softened split peas slightly with a fork. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the almond rice equally among four serving plates. Spoon over the tarka dhal. Place three onion bhajis alongside each serving. Serve the yoghurt and mango chutney in dipping bowls alongside. Garnish with sprigs of coriander."]}, {"isVegetarian": true, "title": "Onion bhajis with mango chutney", "url": "www_bbc_co_uk_food_recipes_onionbhajiswithmango_87874", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "2 tsp cumin seeds", "2 tsp coriander seeds", "2 black cardamom pods, split", "2 tsp black mustard seeds", "2 tsp yellow mustard seeds", "2 dried chillies, roughly chopped", "1 tsp salt ", "1 onion, finely sliced", "110g/4oz gram flour (also sold as besan or chickpea flour)", "1 lemon, juice only", "4 tbsp water ", "small handful fresh coriander, chopped", "freshly ground black pepper ", "1 tsp black mustard seeds", "1 tsp black peppercorns", "1 tsp cumin seeds", "1 tsp dried chilli flakes", "1 tsp coriander seeds", "1 green mango, peeled and sliced", "2 ripe mangoes, peeled and sliced", "125g/4½oz soft light brown sugar", "110ml/4fl oz malt vinegar", "1 lemon, cut into wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the bhajis, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, preheat a deep fat fryer to 190C/375F.", "Place the cumin, coriander, cardamom and mustard seeds, dried chillies and salt into a pestle and mortar and grind to a coarse powder.", "Place the spice mixture into a bowl along with the sliced onion and gram flour and mix thoroughly to combine.", "Add the lemon juice and water and mix to form a very sticky batter. Add the fresh coriander and a pinch of freshly ground black pepper and stir well.", "Carefully drop spoonfuls of the batter into the hot oil and deep fry for 2-3 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the mango chutney, heat a frying pan until hot. Place all the spices into the dry pan and toast for 30 seconds, shaking the pan frequently, until the mustard seeds start to pop.", "Add the mangoes and cook for a further minute.", "Add the sugar and cook until dissolved, then add the vinegar. Cover the pan and simmer for 25 minutes, or until the mixture has thickened and the mango has broken down. Remove from the heat and allow to cool slightly.", "Place half the chutney into a food processor and blend to a purée, then return to the pan and mix to combine.", "Pour the chutney into sterilized jars and leave to cool.", "To serve, divide the bhajis among four serving plates and serve with lemon wedges and a dollop of mango chutney."]}, {"isVegetarian": true, "title": "Onion confit tart with melted goats' cheese and pesto", "url": "www_bbc_co_uk_food_recipes_onionconfittartwithm_84453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ red onion, thinly sliced", "2 tsp clear honey", "100g/3½oz ready-rolled puff pastry", "75g/2½oz goats' cheese", "50g/1¾oz pine nuts", "large handful fresh basil leaves", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the onion confit, melt the butter in a small ovenproof frying pan over a medium heat, add the onions and cook gently for five minutes until softened.", "Add the honey and cook for two minutes.", "Cut out a circle of the puff pastry, the same width as the frying pan. Place the pastry over the cooked onions and prick the pastry with a fork. Place into the oven to cook for 10 minutes.", "For the pesto, place the basil leaves and pine nuts into a food processor and blend together. Gradually pour in the olive oil, until the pesto reaches a pouring consistency. Season well with salt and freshly ground black pepper.", "Remove the tart from the oven and transfer onto a serving plate.  Place the goats' cheese on top.", "To serve,  pour the pesto around the tart and serve immediately."]}, {"isVegetarian": false, "title": "Onion gravy", "url": "www_bbc_co_uk_food_recipes_oniongravy_73662", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oniongravy_73662_16x9.jpg", "ingredients": ["2 tbsp vegetable oil", "1 large onion, sliced", "200ml/7fl oz red wine", "100ml/3½fl oz beef stock (or vegetable stock for a vegetarian version)", "1 tsp French mustard", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and add the onion. Fry on a low heat for 30-45 minutes, stirring occasionally, or until the onion is golden-brown but not burnt. ", "Pour in the wine and stock, reduce the heat and allow to simmer for 20 minutes, or until the liquid has reduced by half. Stir in the mustard and season, to taste, with salt and freshly ground black pepper. "]}, {"isVegetarian": true, "title": "Citrus onion, herb and toasted cashew nut salad", "url": "www_bbc_co_uk_food_recipes_onionherbandtoastedc_86844", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp sesame oil", "1 tbsp vegetable oil", "100g/3½oz cashew nuts", "3 spring onions, chopped", "large handful each fresh chervil, coriander and mint", "½ lime, zest and juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oils in a wok and gently toast the cashew nuts for 2-3 minutes. Add the spring onions and fry for two minutes. ", "To serve, mix the herbs together, pile onto a serving plate, top with the cashew nuts and spring onions and squeeze over the lime juice and zest."]}, {"isVegetarian": false, "title": "Onion rings", "url": "www_bbc_co_uk_food_recipes_onionrings_75768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil for deep frying", "½ onion, sliced into rings", "50ml/1¾fl oz milk", "100g/3½oz plain flour"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep pan. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Soak the onion rings in milk.", "Place the flour on the plate.", "Remove the onion rings from the milk and coat them in the flour.", "Deep fry in the oil for 2-3 minutes or until crisp and golden."]}, {"isVegetarian": true, "title": "Onion rings", "url": "www_bbc_co_uk_food_recipes_onionrings_81863", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint vegetable oil", "½ onion, thickly sliced and separated into rings", "150ml/¼ pint whole milk", "100g/3½oz plain flour, seasoned", "Salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a wok to 180C/350F or until a breadcrumb sizzles and turns brown in it. (CAUTION: hot oil can be dangerous, do not leave unattended.)", "Soak the onion rings in the milk for one minute, then dip the onion rings into the seasoned flour and coat well. ", "Dip the onion rings in the milk again and then again in the flour. ", "Carefully drop the onion rings into the hot oil and cook for two minutes or until golden brown on all sides. ", "Remove using a slotted spoon, drain on kitchen paper and serve immediately, sprinkled with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Onion rings", "url": "www_bbc_co_uk_food_recipes_onionrings_84353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½pint vegetable oil, for deep frying", "150g/5½oz self raising flour", "100ml/3½fl oz sparkling water", "45g/3 tbsp fresh chives, chopped", "Pinch turmeric", "1 red onion, peeled and sliced into rings", "Sea salt for sprinkling"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it (CAUTION: Hot oil is very dangerous. Do not leave unattended).", "Place the flour and sparkling water into a bowl and whisk together to form a batter.", "Add the chives and turmeric and mix well.", "Dip the onion rings in the batter and then carefully lower into the hot oil and deep-fry until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper.", "To serve, place onto a serving plate and sprinkle with sea salt."]}, {"isVegetarian": true, "title": "Onion rings with spicy red pepper sauce", "url": "www_bbc_co_uk_food_recipes_onionringswithspicyr_77211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4 oz self-raising flour", "water, to mix ", "1 onion, sliced", "hot oil, to deep fry", "1 red pepper, de-seeded and chopped", "½ tsp chilli flakes", "sea salt", "50ml/1¾fl oz double cream", "½ vegetable stock cube"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the onion rings, mix together the flour and water to make the batter consistency of single cream.", "Heat the oil in a deep, heavy-based saucepan. Dip the onion rings into the batter and then drop in batches into the hot oil for 2-3 minutes. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Remove and drain on kitchen paper.", "For the sauce, place all of the ingredients in a saucepan and bring to the boil over a medium heat.", "Let simmer for 2-3 minutes. Using a hand blender, blend ingredients until smooth.", "Serve with the onion rings."]}, {"isVegetarian": true, "title": "Onion soup with cider and Stilton", "url": "www_bbc_co_uk_food_recipes_onionsoupwithciderst_78910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "1kg/2¼lb onions, roughly chopped", "500ml/18fl oz medium-dry cider", "1 tbsp cider vinegar", "pinch dried thyme", "1 small bay leaf", "2 litres/3½ pints chicken stock (vegetarians can substitute with vegetable stock)", "225g/8oz potato, peeled and diced", "salt and freshly ground black pepper", "4 tbsp butter, room temperature", "2 tbsp single cream", "4 tbsp Stilton (or Cashel Blue), crumbled, room temperature", "1 tbsp fresh parsley, chopped ", "1 tbsp fresh chives, chopped", "onions fried in butter and fresh chervil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a heavy saucepan, add the onions and cook gently over a medium heat for 15 minutes, or until soft and lightly browned.", "Add the cider and cider vinegar and boil until reduced by about a half.", "Add the thyme, bay leaf, chicken stock, potato and a little salt. Bring to a simmer, and cook for about 15 minutes over a low heat.", "Remove the bay leaf and purée the soup with a hand blender until smooth. Season to taste with salt and freshly ground black pepper.", "To make the Stilton butter, mix all the ingredients together in a bowl until they are well blended.", "To serve, ladle the hot soup into warm bowls. Add 1 tbsp of the Stilton butter to each bowl and garnish with fried onions and chervil"]}, {"isVegetarian": false, "title": "Onion rings with sweet and sour dip", "url": "www_bbc_co_uk_food_recipes_onionringswithsweeta_77893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red onion, sliced into thick rings ", "100g/3½oz self-raising flour ", "200ml sparkling water", "250ml hot vegetable oil", "100g/3½oz ricotta", "2 tbsp tomato sauce", "1 tbsp chives, choppped", "½tsp Tabasco sauce", "½tsp Worcestershire sauce", "1 tsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-bottomed pan (CAUTION: hot oil can be dangerous, do not leave unattended).", "Make a batter using self-raising flour and the sparkling water and mix to form a batter with a thick consistency.", "Coat the onion rings and deep fry for 3 minutes until golden. Remove and drain on kitchen paper.", "To make the dip, mix together the ricotta, tomato sauce, chives, Tabasco sauce, Worcestershire sauce and soy sauce. Serve the onion rings with the dip and enjoy."]}, {"isVegetarian": true, "title": "Onion tarte tatin with goats' cheese and balsamic glaze", "url": "www_bbc_co_uk_food_recipes_oniontartetatinwithg_73307", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, softened", "40g/1½oz sugar", "2 medium-to-large onions", "ready-rolled puff pastry (1-2 sheets)", "150ml/5¼fl oz balsamic vinegar", "8 thin slices of goats' cheese"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180 C/350 F/Gas 4.", "Peel the onions and slice into 2.5cm (1in) slices. Gently fry in a little butter over a medium-to-high heat until the onions begin to colour - approximately 3-5 minutes. Leave to cool.", "Wipe the remaining butter around the base of a clean, small, ovenproof frying pan and sprinkle the sugar over the butter. Place the cold, cooked onions on top of the sugar and butter in the pan.", "Cut a disc of puff pastry 2cm (¾in) larger in diameter than the pan containing the onions, butter and sugar. ", "Lay the pastry on top of the onions. The pastry should go up the side of the pan a little way, or over the edges to seal (this will depend on the height of your pan).", "Transfer the pan to the fridge and chill for one hour.", "Meanwhile, in a separate pan, reduce the balsamic vinegar over a medium-high heat to make a glaze.", "Remove the uncooked tart from the fridge and cook in the oven for 10-15 minutes until the pastry is cooked and golden.", "To turn out the tart, carefully place a plate over the pan and quickly turn the pan over (you may need to run a knife around the edge). The tart should be onion-side up, so the pastry has become the base.", "Place the slices of goats' cheese on top of the tart, and drizzle with the balsamic glaze."]}, {"isVegetarian": true, "title": "Open ravioli with dillisk pasta, broad beans, asparagus and fennel in a lemon cream sauce", "url": "www_bbc_co_uk_food_recipes_open_ravioli_with_52448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz strong white flour", "pinch salt", "2 free-range eggs, beaten ", "2 tbsp rapeseed oil", "pinch saffron powder", "2 tbsp very finely chopped dillisk (also known as dulse)", "200g/7oz shelled broad beans ", "15 young asparagus spears, trimmed, sliced lengthways", "2 tbsp rapeseed oil", "6 spring onions, sliced", "1 garlic clove, finely chopped ", "100ml/3½fl oz white wine", "3 tbsp grated parmesan", "300ml/10½fl oz double cream", "1 lemon, zest only", "salt and freshly ground black pepper", "½ fennel bulb, thinly sliced using a mandolin", "1 tsp chopped golden marjoram leaves, plus extra to garnish", "organic calendula and borage flowers, to garnish", "ricotta salata (pressed, dried and salted ricotta), crumbled, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the dillisk pasta, sift the flour and salt into the bowl of a food processor.  Pour in the beaten eggs, oil, saffron and dillisk and process until the dough begins to come together. Turn out onto a clean work surface and and knead for 5-10 minutes, or until smooth. Wrap in cling film and leave to rest for at least 30 minutes. ", "For the broad beans and asparagus, bring a medium-sized saucepan of salted water to the boil, add the broad beans and cook for three minutes, then add the asparagus spears and cook for about 1½-2 minutes more. Remove the beans and asparagus and plunge into a bowl of iced water. Peel the skin of the broad beans and set aside.", "To make the lemon and marjoram sauce, heat the oil in a saucepan, add the spring onions and fry gently for about four minutes, or until softened but not brown. Add the garlic and cook for a further minute.", "Pour in the wine and cook for 1-2 minutes.", "Stir in the parmesan, cream and lemon zest. Check for seasoning, adding salt and freshly ground black pepper as required.", "After two minutes, add the fennel to the cream sauce. Cook for a further two minutes. Stir in the marjoram leaves. ", "Using a slotted spoon, lift the beans and asparagus into the cream sauce and heat through.  ", "Divide the dillisk pasta dough into five equal pieces. Start with the pasta machine at its widest setting and pass the dough through the rollers. Do not fold but repeat this process, decreasing the roller setting down grade by grade with each pass. Take the pasta down to the penultimate setting - do this according to manufacturer's instructions.  Keep the dough you are not working with covered with a damp cloth. Cut the dough into 12x8cm/5x3in rectangles.", "Bring a large pot of salted water to the boil. Add a little olive oil. Cook the rectangles for about 2-3 minutes and carefully lift them out with a slotted spoon.", "To serve, place one square of pasta into a shallow plate or bowl. Using tongs, place some broad beans and asparagus spears on the sheet of pasta, arrange another sheet on top and continue to add the beans and asparagus and spoon over a little sauce. Top with a third sheet, spoon over the sauce and arrange three asparagus spears on top. Three layers per plate is ideal. Spoon over some more sauce. ", "Sprinkle over the calendula petals, borage flowers, reserved golden marjoram leaves and ricotta salata and serve immediately."]}, {"isVegetarian": true, "title": "Open raviolo with mushrooms and artichoke salad", "url": "www_bbc_co_uk_food_recipes_open_raviolo_with_19015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz butter", "1 garlic clove, finely chopped", "600g/1lb 5oz mixed wild mushrooms, cleaned and the larger ones cut in half", "1 tbsp tomato purée", "1 tbsp chopped fresh flatleaf parsley", "salt and freshly ground black pepper", "125ml/4fl oz white wine", "8 sheets egg pasta dough, about 15cm/6in square", "55g/2oz parmesan (or a similar vegetarian hard cheese), grated (optional)", "8 very small, tender globe artichokes, before any chokes have formed", "¼ lemon, juice only", "6 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "85g/3oz parmesan (or a similar vegetarian hard cheese), shaved very thinly "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the open ravioli with mushrooms, heat a frying pan with the butter. Once melted, add the garlic and fry gently until softened, but not browned. ", "Add the mushrooms and stir-fry for about five minutes, then add the tomato purée and parsley and season with salt and pepper to taste.", "Pour in the wine, bring to the boil and let it bubble for a few minutes. ", "For the artichoke salad, trim the artichokes of all tough outer leaves. Cut off and discard the top and bottom, then slice very thinly and put into a bowl of water with a splash of the lemon juice to prevent any discolouration until ready to serve.  ", "To finish the ravioli, place a large saucepan of boiling water on the hob and season with salt. Once it comes to a rolling boil, add a couple of sheets of pasta at a time so that they don’t stick together. Once soft but still retaining a little bite, remove the pasta sheets from the pan with a slotted spoon and set aside. ", "For the artichoke salad, prepare the vinaigrette by whisking together the olive oil, remaining lemon juice, and salt and pepper to taste in a small bowl.  ", "To serve, carefully lay four sheets of pasta on four hot serving plates. Divide the mushroom mixture between them, placing on top, reserving some of the sauce.  ", "Top the mushrooms with the remaining sheets of pasta and brush the top with the remaining sauce.  Sprinkle with grated parmesan, if you like. Drain the artichokes and arrange them on the serving plates.  Pour the vinaigrette over the artichokes and sprinkle the parmesan shavings on top. Serve at once."]}, {"isVegetarian": false, "title": "Pesto and salmon parcels", "url": "www_bbc_co_uk_food_recipes_open_salmon_and_pesto_56820", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/open_salmon_and_pesto_56820_16x9.jpg", "ingredients": ["1 x 320g pack frozen ready-rolled puff pastry", "4 x 125g/4½oz frozen skinless salmon fillets", "plain flour, for dusting", "2 tbsp sun-dried-tomato pesto (from a jar)", "1 tsp full-fat or semi-skimmed milk", "1 tsp freshly squeezed lemon juice", "freshly ground black pepper", "handful fresh basil leaves, to garnish (optional)", "400g/14oz frozen cooked rice", "200g/7oz frozen mixed vegetables"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Take the puff pastry and salmon out of the freezer and thaw for 2 hours at room temperature, or overnight in the fridge.", "When the pastry and salmon have thawed, preheat the oven to 220C/200C Fan/Gas 7 and place a baking tray inside the oven as it heats.", "Unwrap and unroll the pastry onto a clean, lightly floured work surface. Cut it into four equal-sized rectangles. Place 1 heaped teaspoon of the pesto into the centre of each rectangle. ", "Cut each salmon fillet in half widthways and place two halves, side by side, in the centre of each pastry rectangle, on top of the pesto. ", "Brush the edges of each pastry rectangle with the milk, then fold the edges over themselves to create open parcels, pinching the corners to seal. Brush the exposed pastry with a little more milk. Squeeze a little lemon juice over each piece of salmon, and season, to taste, with freshly ground black pepper.", "Remove the baking tray from the oven and place it onto a heatproof surface. Arrange the salmon-and-pesto parcels onto the tray, then bake them in the oven for 20-25 minutes, or until the pastry has risen and is golden-brown, and the salmon is cooked through.", "For the vegetable rice, 5 minutes before the salmon-and-pesto parcels finish cooking, defrost the rice in the microwave until piping hot throughout. Meanwhile, cook the vegetables in a saucepan of boiling water for 2-3 minutes, or until piping hot throughout. Drain in a colander, then mix with the rice.", "To serve, divide the vegetable rice equally among four warmed serving plates, then place one salmon-and-pesto parcel on top of each portion. Garnish with the basil leaves, if using."]}, {"isVegetarian": true, "title": "Open cheese and potato pies", "url": "www_bbc_co_uk_food_recipes_opencheeseandpotatop_84707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour, plus extra for flouring", "pinch salt", "75g/3oz butter, plus extra for greasing", "1 free-range egg yolk", "3-4 tbsp water", "2 tsp grainy mustard", "3 new potatoes, cooked and sliced", "100g/3½oz Camembert, sliced", "handful fresh parsley, basil and chives, chopped, plus extra chives, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Place the plain flour, salt and butter into a food processor and blend until the mixture resembles breadcrumbs. Add the egg and gradually add the water until the mixture comes together into a ball.", "With floured hands, place the dough onto a floured surface and roll to the thickness of a one pound coin using a floured rolling pin.", "Lightly grease two 8cm/3in ovenproof saucers with butter. Use the pastry to line the saucers, cutting out a circle slightly larger than the saucers, then trim away the edges.", "Spread the mustard onto the middle of the pastry, then cover with the sliced potatoes, Camembert and herbs and season well with salt and freshly ground black pepper.", "Transfer to the oven and cook for 10-12 minutes, or until the pastry is golden-brown and the cheese is bubbling. ", "To serve, transfer to a serving plate and garnish with the chives."]}, {"isVegetarian": false, "title": "Open lasagne with rich tomato and onion sauce", "url": "www_bbc_co_uk_food_recipes_openlasagnewithricht_85866", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "2 garlic cloves, chopped", "1 tbsp tomato purée", "400g/14oz canned cherry tomatoes", "2 tbsp white wine", "salt and freshly ground black pepper", "handful fresh basil leaves, chopped", "150ml/¼ pint double cream", "100g/3½oz parmesan cheese, grated ", "pinch freshly grated nutmeg", "salt and freshly ground black pepper", "1 x 250g/9oz packet fresh lasagne sheets, cut in half and cooked according to packet instructions", "4 anchovies, drained and chopped", "2 tbsp grated parmesan", "fresh basil leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the oil in a frying pan, add the onion and gently fry until softened but not coloured. Add the garlic and cook for one minute.", "Add the tomato purée, cherry tomatoes and white wine and simmer for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper, add the basil and stir.", "For the cheese sauce, heat the cream in a small pan and bring to simmering point.  Simmer for 2-3 minutes until the cream thickens.", "Remove from the heat, add the cheese and nutmeg and season, to taste, with salt and freshly ground black pepper.", "To serve, place a large spoonful of sauce onto two serving plates. Top each pile of sauce with a sheet of pasta. Add another spoonful of sauce and sheet of lasagne to each pile and finish with the sauce. Sprinkle over the chopped anchovies and parmesan cheese. Pour over the cheese sauce and garnish with basil."]}, {"isVegetarian": true, "title": "Open ravioli with butternut squash, cherry tomatoes and herb paste", "url": "www_bbc_co_uk_food_recipes_openravioliwithbutte_90354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "pinch salt", "2 free-range eggs", "1 tsp olive oil", "2 tbsp olive oil", "¼ butternut squash, peeled and chopped", "2 garlic cloves, crushed", "2 baby courgettes, chopped", "5 cherry tomatoes, halved", "2 tbsp chopped fresh sage", "100ml/3½fl oz double cream ", "salt and freshly ground black pepper", "2 handfuls fresh basil", "2 handfuls fresh parsley", "1 garlic clove, crushed", "at least 4 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, place all of the pasta ingredients together into a food processor and pulse until the mixture comes together to form a dough. Tip out onto a floured surface and knead into a ball, then wrap in cling film and allow to rest in the fridge for 5-10 minutes. ", "Roll out the pasta dough as thin as possible, then cut into 5cm/2in squares with a sharp knife. Boil the pasta squares in boiling salted water, or until al dente, then drain. ", "For the filling, heat the olive oil in a pan and fry the butternut squash and garlic for 2-3 minutes, then add the courgettes and tomatoes and cook for 4-5 minutes, or until the vegetables are tender. Stir in the sage and cream, and season, to taste, with salt and freshly ground black pepper. Simmer for 6-8 minutes, or until the squash is tender.", "For the herb paste, pulse all of the pesto ingredients together in a food processor until smooth, adding more oil if necessary.", "Place the pasta squares onto a serving plate and spoon the squash filling into the middle of each square. Spoon the pesto around the edges of the plate and serve."]}, {"isVegetarian": false, "title": "Open Stilton and walnut ravioli", "url": "www_bbc_co_uk_food_recipes_openstiltonandwalnut_90488", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz sugar", "100ml/3½fl oz water", "200g/9oz walnuts", "1 tbsp butter", "3 pears, peeled, core removed, and chopped", "salt and freshly ground black pepper", "250g/9oz Stilton, crumbled ", "1 tbsp finely chopped spinach", "large bunch flatleaf parsley", "15g/½oz fresh mint", "1 tbsp fresh tarragon", "1 tbsp capers, drained", "15g/½oz canned anchovies, drained", "1 tbsp Dijon mustard", "100ml/3½fl oz olive oil, warmed", "8 sheets fresh pasta, cut into 7.5cm/3in squares, cooked according to packet instructions"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, place the sugar and water into a pan over a high heat and bring to the boil.", "Add the walnuts and blanch for 30 seconds, then drain.", "Melt the butter in a separate pan over a medium heat. When it begins to foam, add the pears. Season, to taste, with salt and freshly ground black pepper and fry for two minutes, stirring occasionally.", "Add the blanched walnuts, Stilton and spinach and stir to combine. ", "For the salsa verde, place the parsley, mint, tarragon, capers, anchovies, mustard and olive oil into a food processor and blend to combine.", "To serve, place a square of pasta onto each plate. Place a spoonful of the filling mixture onto the middle of the pasta square, then top with another piece of pasta. Repeat this process until you have used up all of the pasta squares and filling. Drizzle over the salsa verde and serve."]}, {"isVegetarian": true, "title": "Open toasted savoury cheese sandwich", "url": "www_bbc_co_uk_food_recipes_opentoastedsavourych_86880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices farmhouse-style bread", "1 tbsp yeast extract", "100g/3½oz cheddar, sliced"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast bread and spread with the yeast extract.", "Arrange the cheddar slices on top of the yeast extract and place under a hot grill for one minute or until the cheese has melted. Serve."]}, {"isVegetarian": true, "title": "Opera cake", "url": "www_bbc_co_uk_food_recipes_opera_cake_04536", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/opera_cake_04536_16x9.jpg", "ingredients": ["100g/3½fl oz caster sugar ", "3 tbsp kirsch", "3 free-range eggs whites", "15g/½oz caster sugar", "100g/3½oz ground almonds", "100g/3½oz icing sugar", "3 free-range eggs", "30g/1oz plain four, sifted", "30g/1oz unsalted butter, melted", "100ml/3½fl oz double cream", "100ml/3½fl oz dark chocolate, 36 per cent cocoa solids, broken into small pieces", "3 free-range egg yolks", "75g/2½oz caster sugar", "225g/8oz unsalted butter, cubed and softened", "2 tsp vanilla paste", "40 small raspberries", "200g/7oz seedless raspberry jam, sieved"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the kirsch syrup, tip the sugar into a small pan. Pour over 200ml/7fl oz water and cook over a medium heat until the sugar has dissolved.  Bring to the boil and simmer for 4-5 minutes, or until the syrup has reduced by half.  Remove from the heat, add the kirsch, stir and leave to cool completely.", "For the joconde sponge, heat the oven to 220C/425F/Fan 200C/Gas 7.  Grease and line a 33x23cm/13x9in Swiss roll tin with baking parchment. Whisk the egg whites in a bowl until stiff peaks form when the whisk is removed from the bowl. Add the caster sugar, one teaspoon at a time, whisking between each addition to make a glossy meringue. Cover with cling film and set aside.  ", "Tip the ground almonds and icing sugar into the bowl of a free-standing food mixer and add the whole eggs. Whisk together for 3-5 minutes, or until doubled in volume. Fold in the flour, and then gently fold in the meringue in three separate batches.  Pour the melted butter down the side of the bowl and fold in, until incorporated. Tip the mixture into the prepared tin and level the surface with a palette knife. Bake for 5-7 minutes until pale, golden-brown and springy to touch.", "Place a sheet of baking parchment over a cooling rack and turn the cake out onto it.  Peel off the baking parchment from the base of the cake and leave to cool completely.  ", "For the chocolate ganache, pour the cream into a small pan and heat until just bubbling. Remove from the heat and add the chocolate. Stir until all the chocolate has melted and mixture is smooth and glossy. Pour into a bowl and leave to set.", "For the crème au beurre, place the egg yolks in the bowl of a food mixer with the whisk attached. In a pan over a gentle heat, dissolve the sugar in three tablespoons of water and then boil it steadily until the syrup reaches 110C/225F on a sugar thermometer. With the food mixer running, slowly pour the syrup over the egg yolks.  Continue whisking until the mixture is thick and mousse-like. Add the butter, a little at a time, whisking continuously and finally add the vanilla paste. ", "To assemble, slice the cooled sponge horizontally so you have two 33x23cm/13x9in sponges. Cut each of the sponges in half vertically, so that you have four sponges.", "Place one of the sponges on a cake board and brush with one-quarter of the kirsch syrup. Spread over one-third of the crème au beurre. Top with another sponge and brush with one-quarter of the kirsch syrup. Spread over the chocolate ganache.  ", "Top with a third sponge and brush with another one-quarter of the kirsch syrup. Spread over another third of the crème au beurre and top with the final sponge. Brush with the remaining kirsch syrup and spread with the remaining crème au beurre.  ", "Arrange the raspberries over the top in rows and brush over the melted jam to glaze. Refrigerate the opera cake for two hours to set the layers and make it easier to trim. Trim the edges using a sharp knife to reveal the layers. "]}, {"isVegetarian": false, "title": "Orange-glazed salmon", "url": "www_bbc_co_uk_food_recipes_orange-glazed_salmon_22521", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 salmon fillets, skin on", "1 tsp ground ginger", "½ tsp ground cinnamon", "½ tsp ground cardamom", "salt and freshly ground black pepper", "1 orange, juice and zest only", "1 tbsp honey", "2 tbsp soy sauce", "3cm/1¼in piece ginger, peeled and grated", "4 garlic cloves, peeled and crushed", "2 tbsp olive oil", "drizzle sesame oil", "cooked couscous"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["First pat dry the salmon fillets with kitchen paper. Mix the ginger, cinnamon and cardamom with salt and pepper and sprinkle it over the salmon. Rub in to make sure it is well coated.", "Put the orange juice and zest, honey, soy sauce, ginger and garlic into a small saucepan. Heat gently until the honey has melted, then turn up the heat and cook until the volume of liquid has reduced by half. Set aside.", "Heat the olive oil in a large frying pan. When it is very hot, add the salmon fillets, skin-side down. Cook for 3-4 minutes until the skin is crisp and the fillets can easily be lifted away from the pan – if they are at all resistant, leave for a little longer. ", "Turn the fillets over and cook for a further minute, then pour the sauce round the fillets. Cook for a minute or two longer until the sauce is syrupy.", "Serve the salmon skin-side up with a little sesame oil drizzled over, the sauce spooned over and couscous on the side."]}, {"isVegetarian": false, "title": "Orange and almond cake", "url": "www_bbc_co_uk_food_recipes_orange_and_almond_cake_08828", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orange_and_almond_cake_08828_16x9.jpg", "ingredients": ["2 oranges", "225g/8oz caster sugar", "6 free-range eggs", "250g/9oz ground almonds", "4 tbsp flaked almonds", "50g/2oz basil leaves", "50ml/2fl oz water", "50g/2oz caster sugar", "150ml/5floz double cream, lightly whipped", "1 vanilla pod, split and seeds scraped"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 23cm/9in springform cake tin.", "Simmer the oranges in a saucepan of simmering water for 45-60 minutes, or until very soft. Remove the pan from the heat and leave the oranges to cool in the water.", "Drain the oranges and roughly chop, discarding the pips. ", "Blend 450g/1lb of chopped orange in a food processor to a purée. Add the sugar, eggs and ground almonds and blend until smooth.", "Spoon the mixture into the cake tin and sprinkle over the flaked almonds.", "Bake in the oven for 25 minutes, then cover loosely with aluminium foil and bake for a further 25-35 minutes, or until cooked through (a skewer inserted in the middle should come out clean). Remove from the oven and set aside to cool.", "Meanwhile, heat the basil, water and sugar in a saucepan until boiling, then simmer for two minutes. Blend the mixture in a blender until smooth, then pass through a fine sieve. Set aside to cool.", "Whisk the double cream and vanilla seeds together in a bowl until soft peaks form, then fold in basil syrup.", "Serve slices of the cake with a dollop of basil cream."]}]