[{"isVegetarian": false, "title": "Neck of lamb stuffed with cannellini beans and hazelnuts", "url": "www_bbc_co_uk_food_recipes_neckoflambstuffedwit_92664", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neckoflambstuffedwit_92664_16x9.jpg", "ingredients": ["4 tbsp extra virgin olive oil, plus extra for greasing", "5 garlic cloves, peeled, chopped", "2 sprigs fresh rosemary, leaves only, chopped", "800g/1lb 12¼oz canned cannellini beans, drained, rinsed", "50g/2oz shelled hazelnuts, toasted, skins removed ", "salt and freshly ground black pepper", "250-300g/9-10½oz cavolo nero, stalks removed", "1.2kg/2lb 10¼oz lamb neck fillets, each butterflied, then beaten out to 15cm x 30cm x 2cm/6in x 12in x 1in rectangles using a meat mallet"], "serves": "Serves  6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7.", "Heat the oil in a saucepan over a medium heat and fry the garlic and rosemary for 2-3 minutes. Once the garlic is pale golden-brown, add the drained beans. Continue to heat, stirring regularly, for 10-12 minutes, or until the beans begin to break down. ", "Stir in the hazelnuts and season, to taste, with salt and freshly ground black pepper. Mash the mixture lightly, using a fork, then spoon onto a plate and set aside to cool.", "Blanch the cavolo nero in a pan of boiling, salted water for four minutes. Drain well and, when cool enough to handle, gently squeeze to remove any excess water.", "Lay each flattened rectangle of neck fillet onto a large piece of cling film and season, to taste, with salt and freshly ground black pepper. Arrange a layer of cavolo nero leaves onto each neck fillet and divide the bean mixture between them. Wet your hands and, using the flats of your palms, press the mixture down to form a compact, even layer.", "Starting with the short edge of the rectangle of lamb, gently but firmly roll up the lamb, using the cling film to keep the shape tight and even, until the lamb forms a neat roll.", "Remove the cling film and tie 3-4 pieces of string around each lamb fillet to hold it in place. (NB: If making in advance, cover the rolled lamb with cling film and store in the fridge overnight. Remove from the fridge 3-4 hours before cooking.)", "Place the stuffed lamb fillets onto a lightly oiled baking tray and season, to taste, with salt and freshly ground black pepper. Transfer to the oven and cook on the top shelf for 20-25 minutes (for medium), or until cooked to your liking. Once cooked, remove from the oven, cover with aluminium foil and set aside to rest for at least 10 minutes.", "To serve, carve the rolled, stuffed lamb into slices and divide the slices equally among six serving plates."]}, {"isVegetarian": false, "title": "Neck of lamb with lemon and thyme", "url": "www_bbc_co_uk_food_recipes_neckoflambwithlemona_8863", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neckoflambwithlemona_8863_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1kg/2¼lb scrag end of neck of lamb, on the bone, or chops from the neck end, or both", "juice of 1½  lemons, plus a little thinly pared rind", "6-8 sprigs of thyme", "a wine glass of water, or lamb stock", "salt and fresh ground black pepper", "white bread", "Greek-style tomato and onion salad"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-based saucepan. Add the lamb and allow it to sizzle and spit, turning occasionally until lightly browned all over. ", "Add the lemon juice, thyme, water or stock, a little salt and plenty of pepper. Bring to the boil then turn down the heat to a gentle simmer and place a lid on the pan. Cook gently, turning the meat over occasionally, for about 50 minutes, until the meat is tender.", "Serve with plenty of good white bread and a perhaps a simple Greek style tomato and onion salad."]}, {"isVegetarian": true, "title": "Nectarine and ginger tarte tatin", "url": "www_bbc_co_uk_food_recipes_nectarineandgingerta_84555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp flour", "20g/¾oz butter", "pinch salt", "½ free-range egg", "2 tsp butter", "2 tbsp brown sugar", "5cm/2in piece of galangal or ginger, finely chopped", "2 nectarines, halved and stones removed", "icing sugar, to dust", "100ml/3½fl oz double cream, whipped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place all the pastry ingredients together in a food processor and blend until a dough forms. Wrap the dough in cling film and transfer to the fridge to chill for 10 minutes.", "For the fruit, melt butter in a small ovenproof frying pan over a medium heat. Add the sugar and stir until dissolved.", "Add the galangal or ginger to the frying pan and cook for two minutes.", "Add the nectarines to the frying pan, with the cut side facing down. Cook for five fminutes until they become soft and brown underneath.", "Roll out the pastry on a lightly floured surface. Cut a disc to match the diameter of the frying pan and use to cover the nectarines. Pinch the edges to seal and transfer the frying pan to the oven. Bake for 12 minutes, or until golden brown and cooked through.", "To serve, turn upside down over a serving plate and tip out. Dust with icing sugar and serve with the whipped cream."]}, {"isVegetarian": true, "title": "Nectarine syllabub", "url": "www_bbc_co_uk_food_recipes_nectarinesyllabub_86545", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar ", "50ml/2fl oz water ", "3 nectarines, peeled, stones removed and chopped", "½ a ready-made Madeira cake, sliced", "75ml/3fl oz sweet dessert wine", "100g/3½oz mascarpone cheese", "60g/2oz icing sugar, sieved ", "225ml/8fl oz double cream, whipped until stiff peaks form when the whisk is removed", "1 nectarine, skin left on, stone removed, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the caster sugar and water in a pan for 4-5 minutes, until the sugar has dissolved and the liquid forms a syrup. ", "Transfer to a food processor and allow to cool slightly. ", "Add the chopped peeled nectarines, then blend to a puree. Allow to cool.", "Place 1-2 slices of Madeira cake into the bottom of each of four serving dishes or bowls and drizzle some of the wine over each. You should use about half of the wine. ", "Place the mascarpone, icing sugar, the remaining wine and whipped cream into a clean bowl and fold together until smooth.", "Add the nectarine puree and gently stir through the mascarpone mixture to create a marbled effect. ", "Add two thirds of the pieces of unpeeled nectarine and fold through the mixture. ", "To serve, spoon the mixture over the wine-soaked sponge in each bowl and top with a few pieces of the remaining nectarine."]}, {"isVegetarian": true, "title": "Neapolitan baked Alaska", "url": "www_bbc_co_uk_food_recipes_neopolitan_baked_alaska_18464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neopolitan_baked_alaska_18464_16x9.jpg", "ingredients": ["1 litre/1¾pint vanilla ice cream", "1 litre/1¾pint strawberry ice cream ", "1 litre/1¾pint chocolate ice cream", "2 large free-range eggs", "50g/1¾oz caster sugar", "30g/1oz self-raising flour ", "20g/¾oz cocoa powder", "20g/¾oz butter, melted", "225g/8oz caster sugar", "4 large free-range egg whites ", "pink gel paste food colouring", "yellow gel paste food colouring", "mixed berries, to decorate"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Line a 3 litre/5¼pint pudding bowl with cling film.  In a large bowl or a freestanding mixer, beat the vanilla ice cream to soften a little then spoon into the base of the pudding bowl.  Level with a spatula and freeze for one hour, or until firm. ", "Wipe out the mixing bowl and add the strawberry ice cream. Beat to soften a little then spoon over the vanilla ice cream.  Level with a spatula and freeze for one hour, or until firm.", "Preheat the oven to 190C(170C fan)/375F/Gas 5. Lightly grease a 20cm/8in sandwich tin and line the base with baking parchment. ", "For the sponge base, place the eggs and sugar into a large bowl and beat at full speed with an electric whisk until the mixture is pale in colour and thick enough to just leave a trail when the whisk is lifted. ", "Sift the flour and cocoa powder over the surface of the mixture and gently fold in with a metal spoon or spatula. Pour the melted butter down the side of the bowl and gently fold in. ", "Pour into the prepared tin and tilt the tin to allow the mixture to spread evenly to the sides. Bake for about 10–12 minutes, or until springy to the touch and beginning to shrink from the sides of the tin. Turn out and leave to cool on a wire rack. ", "For the filling, in a large bowl or mixer, beat the chocolate ice cream to soften a little then spread over the strawberry ice cream. Level with a spatula and freeze for one hour, or until firm.", "Place the cold sponge on an ovenproof serving dish.  Turn the ice cream out onto the sponge and pop it back in the freezer while you are making the meringue. ", "Preheat the oven to 240C(220C fan)/460F/Gas 8½.  ", "To make the meringue, place the sugar and six tablespoons of water in a heavy-based saucepan. Stir the sugar and water over a medium heat until the sugar dissolves, then bring to a fast boil until it reaches 110C/230F.", "Whisk the egg whites in a large bowl of an electric mixer until stiff peaks form when the whisk is removed. ", "When the syrup temperature reaches 115C/240F on a sugar thermometer, slowly and carefully pour the syrup over the egg whites in a thin stream while continuing to whisk. Taking care not to let the syrup run onto the beaters as it may splash.", "Continue whisking for about 15 minutes, or until the meringue is completely cold. ", "Take the cake and ice cream from the freezer and remove the cling film.  Using a palette knife, spread a thin layer of meringue all over the ice cream and sponge to form a coating. ", "Fit a large disposable piping bag with a 2D star nozzle. Using a paint brush or small pastry brush, paint a line of pink gel paste up the inside of the bag in a line from the nozzle to the top. Repeat on the opposite side with the yellow gel paste. Spoon the meringue into the piping bag. ", "Starting from the top of the dome of ice cream and working quickly, pipe small rosettes of meringue over the dome of ice cream, until completely covered. ", "Bake in the preheated oven for about 4-5 minutes, or until golden-brown. Decorate with mixed berries and serve immediately. "]}, {"isVegetarian": true, "title": "Nest of roasted balsamic vegetables with aromatic wild rice", "url": "www_bbc_co_uk_food_recipes_nestofroastedbalsami_6549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet of filo pastry", "3 tbsp sunflower oil", "250g/9oz wild rice", "1 bouquet garni sachet", "1 small pumpkin, finely sliced", "1 large courgette, diced", "50g/2oz button mushrooms", "1 red pepper, diced", "100g/4oz French beans, steamed", "1 small radicchio", "2 tbsp balsamic vinegar", "5 tbsp olive oil", "salt and freshly ground black pepper", "2 large sprigs of rosemary", "1 bunch parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas4.", "Place a 10cm/4in wide flan ring upside down on a baking sheet. Lightly grease the outside of the flan ring.", "Brush five sheets of pastry with sunflower oil and place over the flan ring in layers at different angles, resulting in a star shape. Place in the oven for about 10 minutes or until golden brown. Leave to cool for 5 minutes, then carefully lift the nests off the rings and place upturned on a dinner plate. This needs to be done three more times, until you have four baskets. At this stage, raise the temperature of the oven to 200C/400F/Gas6.", "Wash the rice thoroughly. Add to a large pan of water with the bouquet garni and bring to the boil. Simmer on a low heat for 40 to 45 minutes, until the grains have split and are tender.", "Meanwhile, place all the vegetables in a large bowl and mix. Blend together the balsamic vinegar, olive oil, seasoning and one sprig of rosemary. Pour over the vegetables and set aside for 30 minutes for the vegetables to marinate.", "Grease a large roasting tray and spread the vegetables evenly over the tray. Cover with foil and place in the oven for 15 minutes. Remove the foil and roast for a further 15 minutes.", "To serve, fill each filo nest with the roasted vegetables and marinating juices. Add the wild rice around the edge of the basket and garnish with the parsley and rosemary."]}, {"isVegetarian": true, "title": "Neopolitan 'ice cream' sandwich petits fours", "url": "www_bbc_co_uk_food_recipes_neopolitan_ice_cream_30000", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz free-range egg whites", "150g/5½oz caster sugar", "50ml/2fl oz cold water", "250g/9oz unsalted butter, at room temperature", "3 free-range eggs", "plain flour", "caster sugar", "margarine", "a dot of red food colouring", "3 free-range eggs", "plain flour", "caster sugar", "margarine", "seeds from 1 vanilla pod", "3 free-range eggs", "plain flour", "caster sugar", "margarine", "2 tbsp cocoa", "50g/1¾oz caster sugar", "50g/1¾oz butter", "2 tbsp golden syrup", "50g/1¾oz flour", "1 tsp brandy", "½ tsp ground ginger", "1 lemon, zest only", "100g/3½oz milk chocolate, melted", "100ml/3½fl oz double cream", "100g/3½oz good quality milk chocolate, broken into pieces", "100g/3½oz raspberries", "100g/3½oz icing sugar"], "serves": "Makes 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the Italian meringue buttercream, whisk the egg whites in a bowl until soft foamy peaks form. Weigh out 25g/1oz of the caster sugar, then continue to whisk the egg whites and gradually add the sugar until well combined. Continue to whisk until stiff peaks form when the whisk is removed.", "Heat the remaining sugar and the water into a small saucepan on a low to medium heat until the mixture looks clear. (Swirl the pan if some sugar remains undissolved.) Increase the heat to just above medium and boil until the sugar mixture reaches 118C/245F. (Measure this with a sugar thermometer.)", "Continue to whisk the egg whites and slowly add the sugar syrup, continue whisking until the bowl no longer feels hot then add the butter, at a little at a time, until fully incorporated. Continue whisking for a further 2-3 minutes, or until smooth and thick.", "Beat the buttercream icing with a wooden spoon to remove some of the air then spoon half the mixture into an icing bag fitted with a small plain nozzle. Spoon the remaining buttercream into a bowl and cover with cling film. ", "To make the sponges, preheat the oven to 190C/375F/Gas 5. Line three 30cm x 23cm/12in x 9in Swiss roll tins with greaseproof paper.", "For the pink sponge, weigh the eggs in their shells then weigh out equal quantities of flour, sugar and margarine. Place all the ingredients into a bowl, beat until light and creamy then transfer the mixture to the tin and level the surface with a palette knife. Bake in the oven for 15-20 minutes, or until the sponge is golden-brown and cooked through. Allow the sponge to cool then turn out onto a board and peel off the paper.", "For the vanilla sponge, repeat step 6, adding the vanilla seeds instead of the food colouring. ", "For the chocolate sponge, repeat step 6, substituting two tablespoons of the flour for the cocoa powder.", "To make the mini brandy snap ‘flakes', preheat the oven to 180C/350F/Gas 4. Line two baking trays with greaseproof paper. ", "Heat the sugar, butter and golden syrup in a saucepan until the sugar has dissolved. Stir in the flour, brandy, ground ginger and lemon zest until well combined then spoon small spoonfuls onto the baking trays, leaving plenty of room for the mixture to spread. Bake for 6–7 minutes, or until golden-brown and holes are starting to develop. Remove from the oven, allow to cool a little then wrap each one around an oiled pencil. Set aside to cool on a wire rack. (If the brandy snaps become too stiff to work, return them to the oven for a few seconds.)", "Dip the ends of the brandy snaps into the melted chocolate and set aside to cool on a wire rack.", "To make the ganache, heat the double cream in a saucepan until just boiling, then add the chocolate. Beat until thick and smooth then remove the pan from the heat and set aside. ", "To make the raspberry sauce, push the raspberries through a fine sieve and stir in the icing sugar to make a thick paste. Pour the sauce into a squeezy bottle. ", "To assemble, using a serrated knife and a ruler, cut the sponges into 5cm/2in squares, trimming if necessary to ensure they are all of the same thickness. Sandwich the cakes with the buttercream; pink on the bottom, vanilla in the middle and chocolate on the top. (Refill the piping bag with buttercream if necessary.) Spread ganache on top of the cakes and top with a swirl of  buttercream. Finish with a brandy snap ‘flake’ and drizzle over the raspberry sauce."]}, {"isVegetarian": true, "title": "New York cheesecake", "url": "www_bbc_co_uk_food_recipes_new_york_cheesecake_20451", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/new_york_cheesecake_20451_16x9.jpg", "ingredients": ["150g/5½oz digestive biscuits", "75g/2½oz butter, plus extra for greasing", "900g/2lb full-fat cream cheese", "200g/7oz caster sugar", "200ml/7fl oz soured cream", "3 tbsp plain flour", "3 free-range eggs, plus 1 egg yolk, lightly beaten", "2 tsp vanilla extract"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line the base of a 23cm/9in spring form cake tin.", "Place the biscuits in a plastic bag and crush with a rolling pin to fine crumbs.", "Melt the butter and add the biscuit crumbs, stir to combine. Place in the base of the cake tin and spread in an even layer, then flatten (use your fingers or a potato masher).", "Bake in the oven for 10 minutes until golden. Remove and leave to cool while you prepare the filling. ", "Reduce the oven to 160C/315F/Gas 2. ", "In a large bowl, beat together the cream cheese and sugar until smooth then add the sour cream and flour and beat again. Gradually add the eggs and vanilla essence beating well between each addition (beat in rather than whisk as you don’t want to incorporate too much air as this will affect the smooth surface of the cheesecake).", "Pour the cream cheese mix on to the biscuit base then bake in the oven for 45 minutes. The cheesecake should be just set with a slight wobble and should still be cream on top with just a slight golden hint around the edges.", "Once the cheesecake is cooked, turn off the oven and prop open the door so that it is slightly ajar and leave the cheesecake to cool in the oven – this prevents the top from cracking.", "Once the oven is cool you can remove the cheesecake to cool completely before removing from the tin."]}, {"isVegetarian": false, "title": "New potato and chorizo tortilla", "url": "www_bbc_co_uk_food_recipes_new_potato_and_chorizo_96091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil ", "400g/14oz Jersey Royal potatoes, quartered ", "1 onion, diced ", "1 garlic clove, finely chopped ", "2 bay leaves ", "1 thyme sprig ", "1 rosemary sprig ", "pinch Espelette pepper or smoked paprika ", "pinch sea salt ", "120g/4½oz cooking chorizo, cut into small dice ", "15g/½oz flat-leaf parsley, finely chopped ", "80g/3oz spinach, chopped ", "8 free-range eggs, beaten"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½. ", "Heat the oil a medium sauté pan or frying pan with a lid over a medium heat. Gently fry the potatoes, onion, garlic, bay leaves, thyme, rosemary, Espelette pepper and salt for 13–15 minutes. Stir regularly to avoid any colouring. ", "Add the chorizo and fry for 5 minutes with the lid on so the flavours mingle. Add the parsley and spinach and stir for 30 seconds. Remove from the heat, add the eggs and stir until evenly mixed. ", "Pour the egg mixture into a 20cm/8in non-stick, ovenproof frying pan and place in the oven for 15 minutes, until cooked. Leave to rest for 5 minutes before turning out on to a board or a large serving dish. ", "Cut the omelette into 4–6 wedge-shaped slices using a serrated knife and serve warm. "]}, {"isVegetarian": false, "title": "New York chicken and apple salad", "url": "www_bbc_co_uk_food_recipes_new_york_chicken_and_67791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/new_york_chicken_and_67791_16x9.jpg", "ingredients": ["2 crunchy red apples, such as Red Delicious or Cox’s, cored and cut into 1.5cm/⅝in slices", "½ lemon, juice only", "1 level tsp runny honey", "150g/5½oz red and green seedless grapes, halved", "2 celery sticks, thinly sliced", "4 spring onions, thinly sliced", "1 Little Gem, leaves separated, roughly torn", "2 x 150g/5½oz cooked chicken breasts, skin removed, roughly torn", "1–2 tbsp chopped toasted walnuts", "3–4 sprigs fresh dill, to garnish", "200g/7fl oz fat-free natural yoghurt", "1 garlic clove, crushed", "1 tbsp cider vinegar", "1 level tbsp wholegrain mustard", "2–3 tbsp chopped fresh dill", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the apples in a wide salad bowl and toss with the lemon juice and honey. Add the grapes, celery, spring onion, lettuce and chicken and toss.", "To make the dressing, whisk the yoghurt, garlic, vinegar, mustard and dill together and season. Spoon over the salad and toss well.", "Scatter with the walnuts, garnish with dill and serve."]}, {"isVegetarian": false, "title": "New England clam chowder", "url": "www_bbc_co_uk_food_recipes_newenglandclamchowde_89058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "3 bacon rashers, finely chopped", "2 onions, peeled and chopped", "1 clove garlic, chopped", "2 tbsp plain flour", "1 can clams in water", "3 large potatoes, chopped into cubes", "2 tbsp celery leaves, chopped", "salt and freshly ground black pepper", "1 bay leaf", "1 tbsp butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the bacon and fry for 3-4 minutes, or until crisp. Remove from the pan and set aside. Add the chopped onions and garlic to the pan and gently fry for 3-4 minutes, or until softened but not coloured.", "Return the bacon to pan, stir in the flour slowly and mix until smooth to form a roux.", "Drain the clams, reserving the liquid. Place the liquid in a measuring cup and add enough water to bring the measure up to 480ml/17fl oz. Gradually add the liquid to the pan with the bacon, stirring until it thickens.", "Add the potatoes, chopped celery leaves, salt and freshly ground black pepper and bay leaf, bring to the boil and simmer until the potatoes are tender. If the chowder is too thick, thin down with some milk.", "Add the clams and the butter and heat, stirring continuously, for 2-3 minutes but do not allow the mixture to boil. Pour into a bowl and serve."]}, {"isVegetarian": true, "title": "New potatoes with beans and olives", "url": "www_bbc_co_uk_food_recipes_newpotatoeswithbeans_88617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "200g/7oz cooked new potatoes, quartered", "100g/3½oz green beans, trimmed", "75g/2¾ oz black olives, pits removed, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a frying pan and fry the potato quarters until they turn golden-brown. ", "Add the green beans to the pan and cook for 4-5 minutes, until the beans are tender. ", "Stir in the olives and salt and freshly ground black pepper. Serve as a side dish."]}, {"isVegetarian": false, "title": "New England-style clam chowder with crunchy thyme breadcrumbs", "url": "www_bbc_co_uk_food_recipes_newenglandstyleclamc_93670", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "Knob of butter", "1 onion, peeled, finely chopped", "2 celery sticks, finely chopped", "2 bay leaves", "2 sprigs fresh thyme", "1kg/2¼lbs clams", "1 ear sweetcorn, kernels sliced off and reserved", "500ml/17fl oz chicken stock", "300g/10½oz red potatoes, cut into pieces", "100ml/3½fl oz single cream", "Handful fresh parsley, chopped", "Salt and freshly ground black pepper", "1 slice spelt bread", "1 lemon, zest only", "1 tbsp olive oil", "2 sprigs fresh thyme", "Salt and freshly ground black pepper", "1 tbsp olive oil", "4 slices pancetta"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the oil and butter in a large saucepan and gently fry the onion and celery for 6-8 minutes, or until soft. Add the bay leaves and thyme to the pan.", "Meanwhile, bring 570ml/1 pint water to a simmer in another large saucepan. Add the clams to the pan, cover with the lid, turn the heat to medium and steam for 2-3 minutes, or until all the shells are open.", "Drain the clams, reserving the liquor. Discard any clams that have not opened, then remove the clam meat from the shells and set aside.", "Add the sweetcorn kernels, clam liquor and chicken stock to the onions, and cook for 10-12 minutes, or until the corn is soft.", "Add the potatoes, and cook for a further 8-10 minutes, or until soft, but not falling apart.", "Stir in the clams, cream and parsley, and cook for 4-5 minutes. Season, to taste, with salt and freshly ground black pepper.", "For the breadcrumbs, pulse the bread to rough breadcrumbs in a food processor (or roughly tear with your hands). Heat the oil in a frying pan over a medium-high heat, and fry the breadcrumbs with the lemon zest and thyme for 2-3 minutes, or until golden-brown and crisp. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the soup into 4 bowls and sprinkle over the thyme breadcrumbs. Heat the remaining oil in a frying pan and fry the pancetta slices for 2-3 minutes per side, or until golden-brown and crisp, and serve on top of the soup if desired."]}, {"isVegetarian": true, "title": "English asparagus with a soft egg in crisp breadcrumbs, hollandaise and fine herbs", "url": "www_bbc_co_uk_food_recipes_newseasonenglishaspa_91397", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "2 free-range eggs", "4 free-range eggs, soft-boiled and refreshed in cold water", "200g/7¼oz Japanese panko breadcrumbs", "2 tbsp chopped fresh parsley", "2 tbsp chopped fresh chervil", "2 tbsp chopped fresh tarragon", "vegetable oil, for deep frying ", "1kg/2lb 3¼oz asparagus spears", "iced water", "1 tbsp fresh lemon juice ", "2 free-range egg yolks", "750g/1lb 10½oz clarified butter, melted", "water, as necessary"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the deep-fried eggs, sprinkle the flour onto one plate, beat the two raw eggs in a bowl and sprinkle the Japanese breadcrumbs, parsley, chervil and tarragon (mixed together) onto another plate. One at a time, dredge the soft-boiled eggs first in the flour, then dip them in the beaten eggs, then roll them in the herbs and breadcrumbs mixture until completely coated. ", "Place each coated egg onto a sheet of greaseproof paper and chill in the fridge for at least one hour.", "Meanwhile, for the asparagus, cook the asparagus in boiling, salted water for 2-3 minutes. Drain well and refresh in iced water.", "For the hollandaise sauce, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the lemon juice and egg yolks and whisk continuously for 4-5 minutes, or until the mixture is pale and has doubled in volume.", "Remove the egg and lemon mixture from the heat. Gradually add the clarified butter in a thin stream, whisking continuously, until all of the clarified butter is incorporated into the mixture. ", "Add two tablespoons of water to the hollandaise sauce if necessary, to loosen. Keep warm until ready to use.", "Heat the oil in a deep fat fryer to 190C/375F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Carefully lower the chilled, coated eggs into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "To serve, divide the asparagus spears equally among four serving plates. Place one crisp egg on top of each serving of asparagus. Drizzle the hollandaise sauce around the edge of the plate."]}, {"isVegetarian": false, "title": "New season lamb with a herb and mustard crust and scallion crushed potatoes", "url": "www_bbc_co_uk_food_recipes_newseasonlambwithahe_81981", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz or 4 x 150g/5½oz boneless loin of lamb, trimmed of fat and silverskin ", "salt and freshly ground black pepper", "4 tbsp light olive oil", "6 tbsp fresh breadcrumbs", "1 tsp roughly chopped thyme", "1 tbsp chopped parsley", "1 tbsp smooth strong Dijon mustard", "1 tbsp wholegrain Dijon mustard", "300ml/10fl oz good brown lamb stock, made from bones and trimmings", "pinch of thyme leaves", "1 tsp chopped parsley", "1 tsp wholegrain Dijon mustard", "15g/½oz butter", "700g/1lb 9oz new potatoes, peeled", "85g/3oz butter", "4 spring onions (called scallions in Ireland), finely chopped", "pinch of salt", "olive oil", "seasonal vegetables, blanched, such as new carrots, lettuce, broad beans and girolle mushrooms", "salt and freshly ground black pepper", "fresh parsley sprigs"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the lamb with salt and freshly ground black pepper. In a heavy frying pan, heat 3 tablespoons of the olive oil until it is nearly smoking. Add the lamb and cook over a high heat until browned all over. This should take about 5 minutes; the lamb loin should still be rare inside. Place on a wire rack and allow to cool to room temperature.", "Pour the breadcrumbs onto a baking sheet and drizzle with the remaining olive oil. Mix gently with your fingers. Put into the oven and toast the crumbs until lightly browned, stirring two or three times. When browned, allow to cool, then add the herbs.", "For the sauce, reduce the lamb stock until it has a light sauce consistency. Remove from the heat and stir in the herbs, mustard and butter. Check for seasoning.", "To prepare the scallion crushed potatoes, cook the new potatoes in boiling salted water until tender, then drain. Melt the butter in a saucepan over a moderate heat, add the spring onions and a little salt and cook gently for one minute. Add the potatoes and crush gently with a fork. Keep warm.", "While the potatoes are cooking, finish the lamb. Mix the two mustards together and brush over the top of each loin. Dip the mustard-coated part of the loin into the breadcrumbs and gently press the crumbs onto the mustard. Set the loins on a baking sheet, crumb-side up.", "Place in the top of the oven and roast for 4-5 minutes for medium rare, or 8 minutes for medium-well done. Remove from the oven and allow to rest.", "Heat a little oil in a pan and sauté the blanched carrots, lettuce and broad beans with the girolles for a few minutes. Season to taste with salt and freshly ground black pepper. ", "To serve, spoon the vegetable garnishes and some of the crushed potatoes onto the warmed plates. Slice the lamb, allowing three thick slices for each person, and place on the potatoes. Spoon over the sauce and garnish with fresh parsley."]}, {"isVegetarian": false, "title": "Nice and spicy Thai minced chicken salad (Larb Gai)", "url": "www_bbc_co_uk_food_recipes_nice_and_spicy_thai_90314", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nice_and_spicy_thai_90314_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "2 large, boneless, skinless chicken breasts (about 225g/8oz each), minced up in a food processor", "flaked sea salt and freshly ground black pepper", "2 tbsp fish sauce", "1 lime, juice only", "1 tsp caster, granulated or soft light brown sugar", "3 spring onions, finely chopped", "¼ cucumber, finely diced", "1-2 red chillies, finely sliced, seeds removed for less heat if preferred", "1cm/½in piece fresh root ginger, peeled and finely chopped", "½ bunch coriander, leaves and stalks roughly chopped (about 2 tbsp)", "½ bunch mint, leaves only, ripped ", "1 handful salted (but not dry roasted) peanuts (about 50g/1¾oz)", "12 largish crisp iceberg lettuce leaves (cup-shaped are best)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the oil into a large frying pan over a high heat. Add the minced chicken with salt and pepper and cook for 4-5 minutes, stirring regularly and breaking it up as you do so, until it turns from pink to white. Cut a piece open to check it is cooked and then tip the chicken into a colander set over a bowl. Leave to cool for five minutes (so it doesn’t cause the herbs to wilt) while also allowing any excess liquid to drain off, if necessary.", "Pour the fish sauce and lime juice into a large bowl and stir in the sugar until dissolved. Add the spring onions, cucumber, red chilli, ginger, coriander, all but a small handful of the mint leaves and the peanuts and stir together well. Tip the chicken in and toss it through. Taste it and check to see if it needs a little bit more of anything to get it just to your liking. ", "Arrange three lettuce leaves on each of four serving plates and place a couple of spoonfuls of the mixture into each one. Scatter the remaining mint leaves over to garnish and serve. The best way to eat these is to simply just pick a cup up with your hands and bite in."]}, {"isVegetarian": true, "title": "Nigel Slater's gazpacho", "url": "www_bbc_co_uk_food_recipes_nigel_slaters_gazpacho_92126", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigel_slaters_gazpacho_92126_16x9.jpg", "ingredients": ["½ cucumber, peeled, roughly chopped", "1 large yellow pepper, de-seeded, roughly chopped", "1 large red pepper, de-seeded, roughly chopped", "6 ripe tomatoes, roughly chopped", "2 banana shallots, roughly chopped", "3 garlic cloves, roughly chopped", "100g/3½oz stale white bread, soaked in a little cold water", "3 tbsp olive oil", "2 tbsp sherry vinegar"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend most of the cucumber, peppers, tomatoes and shallots to a rough purée in a food processor, reserving a couple of chunks of each vegetable for the garnish. ", "Add the garlic, soaked bread, olive oil and sherry vinegar to the food processor and blend again until smooth, or to a more textured consistency if desired. ", "Transfer the soup to a jug, cover with cling film and chill for at least 20 minutes, or until cold.", "Cut the reserved vegetables into small cubes. When ready to serve, pour the gazpacho into bowls and garnish with the vegetables."]}, {"isVegetarian": false, "title": "Nigel Slater's Lancashire hotpot", "url": "www_bbc_co_uk_food_recipes_nigel_slaters_lancashire_48954", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigel_slaters_lancashire_48954_16x9.jpg", "ingredients": ["6 lamb chops, weighing approximately 500g/1lb 2oz in total", "3 tbsp olive oil", "1 large carrot, roughly chopped", "1 celery stalk, trimmed, roughly chopped", "1 large onion, roughly chopped", "2 tbsp plain flour", "1 litre/1¾ pints beef stock", "8 sprigs fresh thyme ", "1 bay leaf", "100g/3½oz butter, melted", "2 large floury potatoes, such as Maris Piper, sliced into 1cm/½in-thick discs", "salt and freshly ground black pepper"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C fan/Gas 3.", "Season the lamb chops with plenty of salt and freshly ground black pepper. Heat the oil in a frying pan over a medium heat, then fry the lamb chops for 2-3 minutes on each side, or until browned all over. Transfer the lamb chops to a medium casserole.", "Fry the carrot, celery and onion in the same frying pan for 4-5 minutes, or until coloured and softened.", "Stir the flour into the vegetables and continue to fry for 2-3 minutes, or until the flour turns a biscuit colour.", "Pour in the beef stock and stir well until the liquid has thickened and there are no visible lumps of flour. ", "Transfer the vegetables and thickened stock to the casserole. Add 7 thyme sprigs and the bay leaf, then bring the mixture to the boil. Reduce the heat until the mixture is just simmering.", "Melt the butter in a small saucepan over a medium heat.", "Arrange the potato slices on top of the hotpot, overlapping the edges slightly. Brush the potato slices all over with the melted butter. Sprinkle the top with a few thyme leaves from the remaining sprig of thyme.", "Bake the hotpot in the oven for 1-1½ hours, or until the potato topping is crisp and golden-brown and the vegetables are tender."]}, {"isVegetarian": true, "title": "Nigel’s lazy loaf", "url": "www_bbc_co_uk_food_recipes_nigels_lazy_loaf_71344", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigels_lazy_loaf_71344_16x9.jpg", "ingredients": ["225g/8oz wholemeal flour", "225g/8oz plain flour", "½ teaspoon sea salt", "1 teaspoon caster sugar", "1 teaspoon bicarbonate of soda", "350ml/12fl oz buttermilk"], "serves": "Makes 1 medium-sized loaf", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 8. Put a large casserole dish and its lid into the oven.", "In a large bowl, mix the flours, sea salt, sugar and bicarbonate of soda together with your fingers. Pour in the buttermilk, bringing the mixture together as a soft dough. Working quickly (the bicarbonate of soda will start working immediately), shape the dough into a shallow round loaf about 4cm/1½in thick.", "Remove the hot casserole dish from the oven, dust the inside lightly with flour then lower in the dough. Cover with the lid and return to the oven. ", "The bread should be ready after 25 minutes. Remove from the oven and leave in place for 5 minutes before turning out and leaving to cool slightly before eating. (Soda bread is best eaten warm.) "]}, {"isVegetarian": false, "title": "Adaptable bean soup", "url": "www_bbc_co_uk_food_recipes_nigelsadaptablebeans_92230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigelsadaptablebeans_92230_16x9.jpg", "ingredients": ["2 onions ", "2 carrots ", "2 tbsp olive oil, plus extra for drizzling", "3-4 ripe tomatoes ", "1 bay leaf", "a few large handfuls of pre-cooked cannellini beans", "vegetable stock ", "a few slices of orange peel", "1 parmesan rind, or vegetarian alternative, optional", "salt and freshly ground black pepper", "1 handful chard stalks (and leaves if young)", "fresh parsley, chopped", "French stick, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roughly chop the onions and carrots. Warm a little olive oil in a large pan on a low heat and add the onions and carrots. Chop the tomatoes and add them to the pan with a bay leaf. Add the cannellini beans, followed by the vegetable stock - enough to cover. I like to add a couple of bits of orange peel at this stage, followed by the parmesan rind. ", "Season generously with salt and freshly ground black pepper and let the soup bubble. Chop the chard stalks and add to the liquid. (You could use any other greens you like.) Add plenty of chopped parsley, then add the chard leaves.  Serve with some toasted French stick or ciabatta and a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Nigel Slater's Thai green curry", "url": "www_bbc_co_uk_food_recipes_nigelslatersthaigree_80244", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nigelslatersthaigree_80244_16x9.jpg", "ingredients": ["4 lemongrass stalks, tougher outer leaves discarded ", "6 medium-hot green chillies, seeded and chopped ", "3 cloves garlic, peeled and crushed", "5cm/2in piece of galangal or ginger, peeled and chopped", "2 shallots, peeled and finely chopped", "4 tbsp chopped fresh coriander", "1 tsp ground cumin", "1 tsp chopped lime zest", "1 tbsp nam pla (Thai fish sauce)", "½ tsp ground black peppercorns", "750g/1lb 10oz free-range chicken breasts or thighs, bones removed", "3 tbsp groundnut oil", "200g/7oz chestnut mushrooms, quartered", "400ml/14fl oz tin coconut milk", "400ml/14 fl oz homemade or ready-made chicken stock", "8 lime leaves", "1 tbsp nam pla (Thai fish sauce)", "1 tbsp bottled green peppercorns, drained ", "leaves from a large bunch (about 20g/0.7oz) basil, shredded ", "15g/½oz fresh coriander (leaves and stalks,) roughly chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the curry paste, slice the lemongrass finely. Put it in a food processor with all the remaining curry paste ingredients and whiz to a thick paste, pushing the mixture down from time to time with a spatula. Transfer to a glass or china dish, cover tightly (otherwise it will taint everything in the fridge) and refrigerate.", "For the curry, cut the chicken into finger-thick strips. ", "Warm the oil in a casserole and, when hot and sizzling, add the chicken strips and let them colour slightly on all sides. You will need to do this in batches to avoid crowding the pan. ", "Remove the cooked chicken pieces from the casserole with a slotted spoon. Add the quartered mushrooms to the casserole and fry until golden-brown, adding more oil if needed. ", "Pour in the coconut milk and stock, then add the lime leaves, four heaped tablespoons of the curry paste, the fish sauce, peppercorns and half of the chopped herbs. Bring to the boil, then turn the heat down and simmer for 10 minutes, stirring from time to time.", "Return the chicken to the casserole with a further tablespoon of the paste and simmer for five to six minutes, or until the chicken is cooked through. Stir in the last of the herbs and serve."]}, {"isVegetarian": true, "title": "Nimish", "url": "www_bbc_co_uk_food_recipes_nimish_76724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb double cream", "50g/1¾oz icing sugar", "1 tsp rosewater", "pinch saffron strands, soaked in 100ml/3½fl oz warm milk for 15 minutes", "few chopped pistachios and edible silver leaf (optional)"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Whip the cream in a bowl until soft peaks just start to form – it’s important not to over-whisk it. ", "Sift in the icing sugar, then add the rosewater and the now cool saffron milk and strands. Whisk together for a minute until smooth and a few bubbles appear on the surface. Pour gently into small serving bowls or glasses and chill overnight. ", "Decorate with sliced pistachios, and silver leaf if you like. Serve."]}, {"isVegetarian": true, "title": "Pea kachori", "url": "www_bbc_co_uk_food_recipes_nita_and_meeras_pea_78947", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nita_and_meeras_pea_78947_16x9.jpg", "ingredients": ["4cm/1½in piece root ginger, peeled and roughly chopped ", "2 fresh green chillies, roughly chopped", "600g/1lb 6oz frozen peas ", "3 tbsp rapeseed oil, plus extra for greasing", "1 tsp mustard seeds", "1¼ tsp ground cinnamon", "1¼ tsp garam masala ", "½ tsp ground turmeric ", "1¾ tsp salt", " ½ tsp chilli powder", "300g/10½oz plain flour, plus extra for dusting ", "½ tsp salt", "2 tbsp rapeseed oil, plus extra for greasing", "175ml/6fl oz hot water "], "serves": "Makes 10-15", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Lightly grease a baking tray with a little oil. ", "For the filling, blend the ginger and green chillies to a paste in a food processor, then remove from the food processor and set aside. ", "Blend the peas in the food processor (there is no need to wash the bowl). Remove and set aside. ", "Heat the oil in a lidded frying pan over a medium heat. Add the mustard seeds and fry, covered with the lid, until they start to pop. Take care to keep your eyes and face away from the pan. ", "Add the ginger-and-chilli paste and stir-fry for 1-2 minutes. Add the pea purée and continue to fry, stirring well, for a further 4-5 minutes. ", "Stir in the cinnamon, garam masala, turmeric, salt and chilli powder and fry for a further 2-3 minutes, or until there is little to no moisture left in the pan but the peas are still bright green. Transfer the pan contents to a bowl and set aside. ", "For the pastry, put the flour into a mixing bowl and make a well in the centre. Add the salt and oil to the well, then rub the mixture together using your fingertips until it resembles fine breadcrumbs. ", "Pour in 120ml/4fl oz of the water and stir the mixture until it comes together as a dough. Gradually add the remaining water, kneading it into the dough until it feels firm and pliant. Roll the dough into a ball, then rub your hands with a teaspoonful of oil and pat the dough all over to cover it in the oil - this will keep it moist. ", "Pinch apricot-sized pieces of dough and roll each piece into a 10cm/4in circle on a lightly floured work surface. ", "Place 1 heaped teaspoonful of the filling mixture into the middle of each pastry circle and bring the edges of the pastry up tightly around the peas. Seal at the top by pinching the edges closed and trimming off any excess pastry. Roll each parcel into a ball and place onto the prepared baking tray. ", "Gently roll the kachori balls around on the baking try to coat them in the oil. Bake for 20-30 minutes, or until the pastry is golden-brown."]}, {"isVegetarian": true, "title": "No-churn ice cream", "url": "www_bbc_co_uk_food_recipes_no-churn_ice_cream_72012", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/no-churn_ice_cream_72012_16x9.jpg", "ingredients": ["4 free-range eggs, separated", "100g/3½oz caster sugar", "300ml/½pint double cream", "1 tsp vanilla extract", "100g/3½oz stem ginger, chopped, plus 4 tbsp syrup from the jar", "2-3 tbsp coffee essence", "2 tbsp brandy", "150ml/5fl oz sieved raspberry purée (you could also use strawberry)", "100g/3½oz raisins soaked in 4 tbsp rum for 2 hours"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Whisk the egg whites in a large bowl until stiff peaks form when the whisk is removed.", "Slowly whisk in the caster sugar, then continue to whisk until the egg whites are stiff and glossy.", "Whisk the cream in a separate bowl until soft peaks form when the whisk is removed. ", "Fold the cream, egg yolks and your chosen flavouring (see ingredients list) into the meringue mixture until well combined.", "Pour into a plastic container and freeze for at least two hours."]}, {"isVegetarian": false, "title": "No pastry savoury pie", "url": "www_bbc_co_uk_food_recipes_no_pastry_pie_88935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "1 free-range egg", "150g/5½ oz ricotta", "25g/1oz leek, finely sliced", "1 large rasher cooked bacon, chopped"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease six holes of a muffin tray with vegetable oil.", "Beat the egg and ricotta together in a bowl until smooth. Stir in the leek and bacon.", "Divide the mixture between the muffin holes and bake in the oven for 30 minutes or until just cooked through."]}, {"isVegetarian": true, "title": "'No butter' brandy butter", "url": "www_bbc_co_uk_food_recipes_nobutterbrandybutter_77294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dairy-free margarine", "75g/2½oz pale muscovado sugar, or to taste", "4 tbsp brandy, or to taste"], "serves": "Makes enough for one pudding", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Beat the margarine hard with the sugar until it's light and fluffy.", "Add the brandy to taste."]}, {"isVegetarian": false, "title": "Fillet of sole with capers, chillies, herbs and roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_noisettesofsolewithc_84482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small bunch tomatoes on the vine", "icing sugar, to dust", "30g/1oz butter", "1 fillet sole", "½ chilli, seeds removed and chopped", "1 tsp capers", "1 tbsp chopped parsley, mint and dill"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the tomatoes onto a baking sheet, dust with the icing sugar and place into the oven to roast for ten minutes, until they start to collapse.", "For the sole, heat the butter in a frying pan over a high heat. When foaming add the fish and fry until cooked through, about 2-3 minutes on each side.  Lift the fish out and keep warm.", "Add the chilli, capers and herbs to the pan and warm through.", "To serve, place the fish onto a serving plate and drizzle the herbs over the fish and serve with the roasted tomatoes."]}, {"isVegetarian": true, "title": "Noodle and broccoli stir-fry", "url": "www_bbc_co_uk_food_recipes_noodleandbroccolisti_79028", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "6 long stemmed broccoli florets", "4 spring onions, chopped", "½ mango, peeled and sliced", "110g/4oz egg noodles, cooked according to packet instructions", "¼ scotch bonnet chilli, finely chopped", "2 tbsp fresh chopped herbs", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of olive oil in a large non-stick frying pan. Add the  broccoli florets and sauté for 3-4 minutes, to soften.", "Add the spring onions and sauté for a further 1-2 minutes. ", "Stir in the mango slices and then add the cooked noodles. ", "Stir in the chilli and continue to stir-fry for a further 3-4 minutes.", "Finally add the herbs with a tablespoon of olive oil. Heat for another minute and transfer to a serving plate to serve."]}, {"isVegetarian": true, "title": "Noodle broth", "url": "www_bbc_co_uk_food_recipes_noodlebroth_77706", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz chicken or vegetable stock", "½ a scotch bonnet chilli", "25ml/1 fl oz white wine", "2 bamboo shoots, thinly sliced ", "2 spring onions, thinly sliced", "3 tbsp soy sauce", "2 tbsp honey", "100g/3½oz rice noodles, cooked ", "1 lime, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken or vegetable stock in a pan with the chilli, wine, bamboo shoots, spring onions, soy sauce and honey and simmer for five minutes.", "Add the noodles and finish with a squeeze of lime juice and serve."]}, {"isVegetarian": true, "title": "Noodle broth", "url": "www_bbc_co_uk_food_recipes_noodlebroth_80052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz hot chicken or vegetable stock", "1 small knob ginger, cut into julienne", "1 tbsp spring onion, shredded", "1 tbsp sesame oil", "1 tbsp soy sauce", "50g/1¾oz firm tofu, cubed", "50g/1¾oz rice noodles", "1 tbsp chopped coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the stock to simmer in a small saucepan.", "Add the ginger, spring onion, sesame oil and soy sauce and stir.", "Add the tofu and noodles and half the coriander. Remove from the heat.", "Leave for five minutes to cook through. ", "To serve, pour into a bowl and sprinkle with the remaining coriander."]}, {"isVegetarian": false, "title": "Noodle broth", "url": "www_bbc_co_uk_food_recipes_noodlebroth_87042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rice noodles", "1 tsp olive oil", "½ duck breast, fat removed, thinly sliced", "1 garlic clove, crushed", "1 tsp grated fresh ginger", "1 tomato, chopped", "150ml/¼ pint chicken stock", "1 tbsp fresh coriander, chopped", "1 tsp sesame oil, to serve", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the noodles in a bowl, cover with boiling water and leave aside to soak for five minutes. Drain.", "In a non-stick frying pan, heat the olive oil and fry the duck slices for three minutes.", "Add the garlic, ginger and tomato to the pan and sauté for a further one minute.", "Add the chicken stock to the pan and simmer for five minutes.", "Stir the cooked noodles and coriander into the pan and heat through.", "To serve, pour the broth into a serving bowl and drizzle with the sesame oil. Garnish with the sprig of chervil."]}, {"isVegetarian": false, "title": "Noisettes of lamb with roast garlic and basil cream", "url": "www_bbc_co_uk_food_recipes_noisettesoflambwithr_67909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 garlic cloves in their skins", "600g/1lb 5oz lamb fillet", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "4 tbsp white wine, water, or stock", "200ml/7fl oz double cream", "2 tbsp finely sliced fresh basil", "1-2 tsp Dijon mustard", "a little sautéed spinach, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Toss the garlic cloves with one tablespoon of oil in a saucepan, cover with greaseproof paper and cook on a low heat for a couple of minutes. Remove the garlic from the pan and cover with cling film. Set aside. Season the lamb generously with salt and pepper.  In a heavy frying pan, heat the oil until nearly smoking. Add the lamb, and cook over high heat until well browned.  This should take about 10 minutes, by which time the lamb will be about medium rare.  ", "Remove the lamb and the garlic to a warm plate, and cover with foil.  Pour off the fat from the pan, and add the wine, or water.  Scrape the caramelised juices off the bottom of the pan as the liquid boils.  Now add the cream, and bring to a fast boil. Squeeze the garlic from their skins. They should pop out easily. Mash lightly with a fork. Add the cream and the garlic to the pan, bring to a fast boil, then remove from the heat, and stir in the basil, and the mustard.", "To serve, slice the lamb, adding any juices to the sauce.  Arrange on a warm plate with a little sautéed spinach.  Spoon the sauce around."]}, {"isVegetarian": true, "title": "No-churn blueberry and lemon ice cream", "url": "www_bbc_co_uk_food_recipes_no-churn_blueberry_and_24948", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/no-churn_blueberry_and_24948_16x9.jpg", "ingredients": ["500g/1lb 2oz frozen blueberries, plus extra for garnish", "500g/1lb 2oz  fat-free Greek yoghurt", "125g/4½oz icing sugar, plus extra to decorate", "2 lemons, grated rind and 1 tbsp juice"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the blueberries in a food processor or blender with the yoghurt, icing sugar, lemon rind and juice and process until smooth.", "Spoon the mixture into a freezer-proof container and freeze.", "When the mixture is softly frozen and easily spoonable, serve with a few blueberries and a sprinkling of icing sugar. "]}, {"isVegetarian": true, "title": "Noodle gratin", "url": "www_bbc_co_uk_food_recipes_noodlegratin_87132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz medium egg noodles", "30g/1oz butter", "30g/1oz plain flour", "salt and freshly ground black pepper ", "150ml/¼ pint milk", "55g/2oz cheddar, grated", "sprig fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the noodles into a large heatproof bowl and pour over enough boiling water to cover. Leave for 4-5 minutes, or until softened, then drain.", "Heat the butter in a small pan and add the flour, stirring well. Season with salt and freshly ground black pepper.", "Add the milk gradually, stirring continuously. Bring the sauce to the boil and simmer for 3-4 minutes. Remove from the heat and stir in half the cheese.", "Pour the sauce over the noodles and mix well, then spoon the noodles into a small ovenproof dish and sprinkle over the remaining cheese.", "Place under the hot grill for 1-2 minutes, or until golden-brown.", "To serve, garnish with a sprig of parsley."]}, {"isVegetarian": true, "title": "Noodle salad with chilli nuts", "url": "www_bbc_co_uk_food_recipes_noodlesaladwithchill_85919", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/noodlesaladwithchill_85919_16x9.jpg", "ingredients": ["1 tsp vegetable oil", "1 tsp soy sauce", "2 tsp clear honey", "¼ cucumber, peeled, seeds removed, finely chopped", "¼ red pepper, finely chopped", "100g/3½oz egg noodles, cooked according to packet instructions", "salt and freshly ground black pepper ", "1 tsp vegetable oil", "50g/2oz peanuts", "½ tsp salt", "½ tsp chilli flakes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the noodle salad, put the vegetable oil, soy sauce and honey in a large bowl and mix well.", "Add the cucumber, pepper and cooked noodles, season with salt and pepper and mix well.", "For the chilli nuts, heat the vegetable oil in a frying pan over a medium heat and fry the peanuts for 3-4 minutes. Drain off the oil and fry for a further 2-3 minutes, then add the salt and chilli and stir well to coat the nuts.", "Put the noodle salad in a bowl, sprinkle over the nuts and serve. "]}, {"isVegetarian": false, "title": "Noodles with beansprouts and ham", "url": "www_bbc_co_uk_food_recipes_noodles_with_bean_36223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb egg noodles (dried or fresh)", "dash sesame oil", "450g/1lb fresh beansprouts, ends removed", "50g/2oz shredded cured ham or lean English smoked bacon", "300ml/10fl oz chicken stock", "2 tbsp dark soy sauce", "1 tbsp light soy sauce", "2 tbsp Shaoxing rice wine (or dry sherry)", "1½ tbsp finely chopped garlic", "3 tbsp finely chopped spring onion", "1 tsp salt", "½ tsp freshly ground white pepper", "2 tsp sesame oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and cook the noodles for 3–5 minutes. Drain and immerse in cold water. Drain again, then toss with sesame oil. Set aside.", "Heat a large wok or pan until hot. Add all the sauce ingredients, except for the sesame oil and bring to a simmer. Turn down the heat, add the noodles and toss well. ", "Turn the heat back to high and add the beansprouts and ham and another dash of sesame oil. Stir-fry for 3 minutes, or until the noodles are thoroughly heated. Tip onto a warm platter and serve."]}, {"isVegetarian": true, "title": "Noodle salad", "url": "www_bbc_co_uk_food_recipes_noodlesalad_81382", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp soy sauce", "1 tsp sesame oil", "1 tsp sesame seeds", "1 tsp honey", "½ tsp dried chilli flakes", "100g/3½oz rice noodles, cooked according to packet instructions", "½ red onion, finely chopped", "50g/1¾oz rocket", "1 orange, peeled and segmented", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the soy sauce, sesame oil, sesame seeds, honey and chilli flakes into a large bowl and whisk together.", "Add the noodles, onion, rocket and orange segments and toss together and season, to taste, with salt and freshly ground black pepper.", "To serve, place the noodle salad into the centre of a dish."]}, {"isVegetarian": false, "title": "Noodle salad with coconut and salmon", "url": "www_bbc_co_uk_food_recipes_noodlesaladwithcocon_85349", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 tbsp soy sauce, plus extra to serve", "1 tbsp clear honey", "1 tbsp sesame seeds", "50g/1½oz fresh coconut, grated (or same amount of desiccated coconut, soaked in water and squeezed dry)", "1 tbsp chopped fresh parsley", "3 tomatoes, chopped", "1 chilli, seeds removed, chopped", "2 spring onions, chopped", "100g/3½oz rice noodles, soaked in hot water until softened, drained ", "50g/1½oz salmon fillet, skinned, poached"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients except the rice noodles and salmon into a bowl and mix together well to make a dressing.", "Pour the dressing over the rice noodles and mix together carefully.", "To serve, place the rice noodle salad into a serving bowl, top with the salmon and drizzle with soy sauce."]}, {"isVegetarian": false, "title": "Noodle soup with teriyaki cod", "url": "www_bbc_co_uk_food_recipes_noodlesoupwithteriya_76145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/1 pint vegetable or chicken stock", "½ 'cherry bomb' chilli", "125g/4½oz noodles, cooked ", "1 tbsp fresh coriander", "1 pak choi, cut into quarters", "1 lime, juice only", "150g/5½oz cod, skin on", "1 tsp rock salt", "1 tbsp honey", "1 tbsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the noodle soup, in a large saucepan warm the chicken or vegetable stock with the chilli and noodles for five minutes.", "Add the coriander, pak choi and lime and cook for a further two minutes and serve.", "To make the teriyaki cod, in a medium-sized saucepan heat the oil. Place the cod in the saucepan and fry for two minutes.", "Add the rock salt and then turn over and cook on the other side.", "Place the pan into the oven for three minutes.", "Take out and glaze with the honey and the soy.", "Serve on top of the noodle soup."]}, {"isVegetarian": false, "title": "Noodle soup with teriyaki beef and toasted cashews", "url": "www_bbc_co_uk_food_recipes_noodlesoupwithteriya_85587", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sesame oil", "1 tbsp soy sauce", "2.5cm/1in piece fresh ginger, peeled and finely sliced", "pinch chilli flakes", "150ml/5fl oz hot vegetable stock", "100g/3½oz ready-cooked udon noodles ", "1 tbsp olive oil", "100g/3½oz beef fillet", "salt and freshly ground black pepper", "1 tbsp soy sauce", "1 tbsp clear honey", "1 tbsp cashew nuts, lightly toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the noodle soup, place all the noodle soup ingredients except for the noodles into a saucepan and bring to the boil. Reduce the heat and simmer for five minutes.", "For the teriyaki beef, rub the beef all over with olive oil and season well with salt and freshly ground black pepper.", "Heat a frying pan until hot and fry the beef for 2-3 minutes on each side, or until cooked to your liking. Remove the beef from the pan and set aside to rest in a warm place. Add the soy sauce and honey to the pan and stir, then remove the pan from the heat. ", "Cut the beef into thin slices and stir around in the pan of soy mixture to coat all over in the pan juices.", "To serve, place the noodles into a bowl and pour over the soup. Top with the sliced beef and sprinkle over the cashew nuts."]}, {"isVegetarian": false, "title": "Noodles with prawns and pak choi", "url": "www_bbc_co_uk_food_recipes_noodleswithprawnsand_86069", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, chopped", "½ tsp chilli flakes", "2.5cm/1in piece root ginger, peeled and chopped", "¼ red pepper, seeds removed, chopped", "1 pak choi, leaves separated", "2 raw tiger prawns, shells removed, deveined", "1 tsp soy sauce", "1 tbsp honey", "85g/3oz cooked udon noodles", "1 tbsp chopped fresh coriander", "1 lime, quartered"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or large frying pan and stir fry the garlic, chilli and ginger for one minute.", "Add the red pepper and pak choi and stir fry for a further minute.", "Add the prawns, soy sauce, honey and noodles and cook for 2-3 minutes, or until the prawns have turned pink and are cooked through.", "To serve, place into a serving dish, sprinkle over the coriander and garnish with lime wedges."]}, {"isVegetarian": true, "title": "Noodles with mushrooms and deep-fried spring onions", "url": "www_bbc_co_uk_food_recipes_noodleswithmushrooma_77866", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "150g/5¼oz cooked noodles ", "3 spring onions, finely chopped", "juice of one lime", "75g/2¾oz mixed mushrooms, chopped", "2 tbsp chives, chopped", "2 tbsp coriander, chopped ", "2 tbsp mint, chopped ", "2 tbsp soy sauce", "250ml oil for deep-frying", "6 spring onions, white part only", "100g/3½oz self-raising flour ", "50ml water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a wok heat the oil and add the noodles, spring onions, mushrooms and lime juice. Cook for five minutes.", "Add the chives, coriander, mint and soy and remove from the heat.", "In a bowl mix the flour and water to a smooth paste.", "Coat the spring onions in this batter. ", "Heat the oil in a heavy-bottomed pan (CAUTION: hot oil can be dangerous, do not leave unattended). Fry the spring onions in the hot oil for two minutes or until golden then remove and drain of excess oil on kitchen paper.", "To serve, place the noodles and mushrooms in a bowl and garnish with the deep fried onions."]}, {"isVegetarian": false, "title": "Norfolk dumplings with mince and boiled potatoes", "url": "www_bbc_co_uk_food_recipes_norfolkdumplingswith_92369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 onions, finely chopped", "2½ beef stock cubes, preferably organic", "2kg/4lb 2oz beef mince", "1 tbsp Worcestershire sauce", "1 litre/1¾ pints water", "2 tbsp gravy browning powder", "salt and freshly ground black pepper ", "1.5kg/3lb 4oz self-raising flour, plus extra for dusting", "6 tbsp chopped fresh parsley leaves", "salt and freshly ground black pepper ", "500-750ml/18fl oz-1 pint 6fl oz cold water", "3kg/6lb 8oz white potatoes, peeled, cut into equal-sized pieces", "150g/5oz butter", "600g/1lb 5oz young carrots, scrubbed, trimmed"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mince, heat the oil in a large casserole dish over a high heat. Add the onions and fry for 3-4 minutes, or until softened.", "Add the stock cubes and stir well to dissolve them in the oil. Fry for a further minute.", "Add the mince, in batches, and fry for 6-8 minutes, stirring, or until browned all over. Remove the cooked mince and set aside on a plate. Repeat the process with the remaining mince.", "Return the cooked mince to the casserole, then add the Worcestershire sauce and water and bring the mixture to a simmer.", "Add the gravy browning powder and season, to taste, with salt and freshly ground black pepper. Cover the casserole with a lid and simmer for three hours, stirring occasionally, or until the cooking liquid has thickened and the meat is tender. ", "Meanwhile, for the dumplings, in a large mixing bowl, mix together the flour and chopped parsley. Season, to taste, with salt and freshly ground black pepper.", "Gradually add the water in a thin stream, stirring well, until the mixture comes together as a firm dough. (NB: You may not need to use all of the water.)", "Turn the dough out onto a lightly floured work surface and knead lightly until smooth. Pinch off golf ball-sized pieces of the dough and roll into balls.", "Boil the potatoes in a pan of salted water for 10-15 minutes, or until tender. ", "As the potatoes are cooking, carefully lower the dumplings into the boiling water. When all the dumplings have been added to the pan, reduce the heat until the mixture is simmering, then cover the pan with a lid and simmer for 12-15 minutes, or until the dumplings have risen and the potatoes are just tender. ", "Remove the dumplings from the pan using a slotted spoon and set aside to drain on kitchen paper, then drain the potatoes and return them to the pan. Add half of the butter and stir until the butter melts and coats the potatoes. ", "Meanwhile, bring a pan of salted water to the boil, add the carrots and cook for 4-5 minutes, or until tender. Drain well, then return the carrots to the pan and stir in the remaining butter. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the dumplings into the centre of each of 12 serving plates. Spoon over the mince. Serve the buttered potatoes and carrots alongside."]}, {"isVegetarian": true, "title": "Norwegian custard buns (skolebrød)", "url": "www_bbc_co_uk_food_recipes_norwegian_custard_buns_92546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "285ml/9½fl oz milk", "1 x 7g sachet fast-acting yeast", "85g/3oz caster sugar", "425g/15oz plain flour", "1½ tsp ground cardamom", "oil, for greasing", "200g/7oz raspberries", "200g/7oz granulated sugar", "100ml/3½fl oz milk", "150ml/5fl oz double cream", "2 free-range egg yolks", "55g/2oz caster sugar", "1 tsp vanilla extract", "1 tbsp cornflour", "1 free-range egg, lightly beaten, for glazing", "6 tbsp icing sugar", "55g/2oz desiccated coconut "], "serves": "Makes 12", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, melt the butter in a pan over a low heat and add the cold milk, heating until just tepid. Stir in the yeast and sugar and leave for 10 minutes.", "Mix together the flour and cardamom in the bowl of a free-standing electric mixer fitted with a dough hook.", "Add the yeast mixture and knead with the dough hook until the dough begins to pull away from the bowl.", "Place the dough in a large greased bowl, cover with oiled cling film and leave to rise until doubled (about 1-1½ hours). Take care not to over-prove the buns as otherwise they may collapse.", "For the raspberry jam, add the raspberries and sugar to a large pan and bring to the boil until thickened. ", "Transfer to a large heatproof bowl and leave to cool. When cooled, set aside in the fridge until needed.", "For the custard, warm the milk and cream in a pan until simmering.", "Whisk together the egg yolks, sugar and vanilla extract in another bowl. Whisk in the cornflour.", "Slowly pour the hot milk mixture into the egg mixture, whisking continuously, then return to the pan.", "Cook over a very low heat, stirring constantly until thickened enough to coat the back of a spoon.", "Transfer to a heatproof bowl and set aside to cool. When cooled, set aside in the fridge until needed.", "Turn the dough out onto a lightly floured surface and knock back, lightly kneading until smooth. Roll into a sausage and cut into 12 equal pieces.  Shape into balls and place on a baking tray and cover with oiled cling film. Leave to prove for about 30 minutes.", "Preheat the oven to 200C/fan oven 180C/400F/Gas 6.", "When risen, press down an egg-sized indentation into each bun and fill with the custard. Brush the bun with beaten egg.", "Bake for 20 minutes, or until golden-brown. Transfer to a wire rack to cool.", "Combine the icing sugar with one teaspoon of water to make a glaze. ", "Brush the glaze onto the buns around the custard centre. Dip the glazed part of each bun into the coconut.", "Finish by placing a little jam on top of the custard and serve."]}, {"isVegetarian": false, "title": "Coconut chicken with potatoes, peas, toasted almonds and fresh coriander", "url": "www_bbc_co_uk_food_recipes_northindianstylechic_90991", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp sunflower oil", "4 chicken breasts, skin on", "4 medium potatoes, cut into 2cm/1in cubes", "2 onions, peeled, chopped, then blended in a food processor to a paste ", "3 garlic cloves, peeled, finely grated", "5cm/2in piece fresh ginger, peeled and finely grated", "1 tbsp ground turmeric", "1 tbsp Madras curry powder", "2 cinnamon sticks", "175ml/6¼fl oz chicken stock", "1 x 250ml/9fl oz carton coconut cream", "1 x 400ml/14fl oz can coconut milk", "250g/8¾oz peas", "50g/1¾oz flaked almonds, toasted", "handful chopped fresh coriander leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat two tablespoons of the sunflower oil in a frying pan over a high heat. When the oil is almost smoking, add the chicken breasts, skin-side down. Fry for 2-3 minutes, or until the skin is golden-brown, then turn the chicken breasts over and fry for a further 2-3 minutes, or until golden-brown all over.", "Transfer the chicken breasts to a roasting tray and roast in the oven for 10-12 minutes, or until completely cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove from the roasting tray and set aside on a warm plate.", "Meanwhile, boil the potato cubes in salted water for 10-15 minutes, or until tender. Drain well and set aside.", "Heat the remaining two tablespoons of sunflower oil in a deep-sided pan over a medium heat. Add the blended onions and fry for 8-10 minutes, stirring regularly and adding more oil as necessary to prevent the onions from sticking to the base of the pan. ", "Add the garlic and ginger, and continue to fry, stirring frequently, for 2-3 minutes. ", "Add the turmeric, curry powder and cinnamon sticks, stir well and cook for a further 1-2 minutes, or until the spices are fragrant.", "Pour in the stock, coconut cream and coconut milk. Bring the mixture to a simmer. Simmer for 18-20 minutes, or until the volume of liquid has reduced by about a half and the sauce has thickened. ", "Add the cooked potato cubes and peas and return the curry mixture to the boil.", "To serve, divide the curried potato and pea sauce equally among four serving bowls. Top each with one of the reserved chicken breasts. Sprinkle over the toasted almonds and coriander leaves."]}, {"isVegetarian": false, "title": "Norwegian fish pie", "url": "www_bbc_co_uk_food_recipes_norwegianfishpie_92184", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/norwegianfishpie_92184_16x9.jpg", "ingredients": ["30g/1oz unsalted butter", "½ tsp caraway seeds", "30g/1oz plain flour", "500ml/17fl oz full-fat milk", "100g/3½oz cream cheese", "salt and freshly ground black pepper", "½ onion, peeled, finely chopped", "130g/4½oz canned dolphin-friendly tuna, drained, flaked", "160g/5½oz pasta (such as macaroni, penne or fusilli), cooked according to packet instructions, drained", "60-80g dried breadcrumbs", "6-8 anchovy fillets, cut in half lengthways"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the butter in a frying pan over a medium heat. When the butter is foaming, add the caraway seeds and fry for 1-2 minutes, or until fragrant.", "Add the flour and whisk to a smooth paste. Continue to cook, stirring vigorously, for a further 3-4 minutes, then pour in 125ml/4½fl oz of the milk. Whisk the milk and flour mixture together to a smooth paste. ", "When the mixture is bubbling, add another 125ml/4½fl oz of milk and whisk until it is bubbling and incorporated into the mixture.", "Repeat the process with the remaining 250ml/9fl oz of milk. Continue to whisk and simmer until the sauce is smooth and thick enough to coat the back of a spoon. Remove the pan from the heat and stir in the cream cheese. Season, to taste, with salt and freshly ground black pepper.", "Add the onion, tuna and cooked pasta to the cheese sauce and stir until well combined. ", "Pour the mixture into an ovenproof dish. Sprinkle over the breadcrumbs and lay the anchovy fillets on top. Bake in the oven for 30 minutes, or until the breadcrumbs are crisp and golden-brown and the sauce is bubbling."]}, {"isVegetarian": true, "title": "Nut roast with mushroom gravy and cranberry sauce", "url": "www_bbc_co_uk_food_recipes_nut_roast_38249", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nut_roast_38249_16x9.jpg", "ingredients": ["300g/10½oz spinach or chard leaves", "50g/1¾oz dried cranberries", "50ml/2fl oz oloroso sherry", "1 tbsp olive oil", "15g/½oz butter", "1 onion, finely chopped", "200g/7oz chestnut mushrooms, roughly chopped", "1 large parsnip, coarsely grated (around 250g/9oz)", "2 garlic cloves", "1 tsp dried sage", "1 lemon, zest only", "1 thyme sprig ", "150g/5½oz cooked freekah or spelt grains", "100g/3½oz mixed nuts, roughly chopped", "100g/3½oz cooked chestnuts, roughly chopped", "25g/1oz fresh breadcrumbs", "3 free-range eggs", "25g/1oz butter", "1 tbsp olive oil", "15g/½oz butter", "1 shallot, finely chopped", "1 garlic clove", "few thyme leaves", "250g/9oz chestnut or portobellini mushrooms", "100ml/3½fl oz oloroso sherry", "250ml/9fl oz vegetable stock", "50ml/2fl oz single cream", "250ml/9fl oz cranberries (fresh or frozen)", "100g/3½oz caster sugar", "1 large orange, juice and zest"], "serves": "Serves 8–10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line the loaf tin with baking paper.", "Wash the spinach in plenty of water and put into a saucepan. Heat gently until it has wilted down, stirring a couple of times, then drain over a sieve. Leave to cool, then roughly chop.", "Put the cranberries into a small saucepan and cover with the sherry. Bring to the boil, remove from the heat and set aside until the cranberries have plumped up and absorbed most of the sherry.", "Heat the olive oil and butter in a frying pan. Add the onion and mushrooms and cook over a medium heat until any liquid coming out of the mushrooms has evaporated and the onion has softened. Add the parsnip and continue to cook until the parsnip has reduced in volume and the onion has started to caramelise. Add the garlic, dried sage, thyme and lemon zest, then cook for a couple more minutes. Remove from the heat and allow to cool slightly.", "Put the freekah or spelt into a large bowl along with the mixed nuts, chestnuts, breadcrumbs, spinach, cooked vegetables and the eggs. Season well with salt and pepper and mix thoroughly. ", "Spoon into the lined loaf tin and dot over the butter. Smooth down, but do not pack too tightly. Cover with a layer of greaseproof paper and bake in the oven for about an hour or until piping hot.", "Meanwhile, to make the gravy, heat the olive oil and butter in a saucepan. Add the onion and cook for several minutes until starting to caramelise around the edges. Add the mushrooms and cook for 5 minutes, stirring regularly. Add the garlic and thyme season well and  continue to cook for a couple of minutes. Turn up the heat and pour in the sherry. Allow to bubble until almost completely evaporated, then add the stock. Simmer, covered, for 10 minutes. Stir in the cream just before serving.", "To make the cranberry sauce, put the cranberries into a saucepan with orange juice and zest and the sugar. Gently heat until the sugar has dissolved then turn up the heat and simmer until the cranberries have softened and started to burst. Stir and remove from the heat – you should have a mixture of whole and broken down cranberries. Allow to cool and store in the fridge until needed."]}, {"isVegetarian": true, "title": "Carrot and chickpea traybake", "url": "www_bbc_co_uk_food_recipes_nut-free_carrot_and_32952", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nut-free_carrot_and_32952_16x9.jpg", "ingredients": ["400g tin chickpeas, drained and rinsed ", "70-80g/2½- 2¾oz dates", "1 tbsp vanilla extract", "1 tbsp ground cinnamon", "½ tsp bicarbonate of soda", "1 free-range egg", "3 pinches salt", "1 tsp finely grated root ginger", "1 large carrot (approximately 160g/5¼oz), grated"], "serves": "Makes 16 pieces", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a high-sided baking tray with baking parchment.", "Blend all of the ingredients except the carrot in a food processor until smooth and well combined.  ", "Add the carrot to the food processor and pulse a few times to combine, being careful not to over-blend (the carrot should provide texture and colour to this snack).", "Transfer the mixture to the prepared baking tray, spreading and smoothing it into an even layer using a palette knife.", "Bake in the oven for 30-35 minutes, or until cooked through and browned on top. Remove and set aside to cool slightly, then cut into squares. Serve warm or cold."]}, {"isVegetarian": true, "title": "Nut roast", "url": "www_bbc_co_uk_food_recipes_nut_roast_74357", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nut_roast_74357_16x9.jpg", "ingredients": ["butter, for greasing and frying", "2 tbsp oil", "1 onion, chopped", "3 garlic cloves, grated", "1 tsp finely chopped rosemary (or ½ tsp dried rosemary)", "300g/10½oz flat or portabello mushrooms, roughly chopped", "300g10½oz mixed nuts", "75g/2½oz gruyère, grated", "50g/1¾oz vegetarian Parmesan-style cheese, grated", "125g/4½oz cooked mixed grains, (quinoa, wheatberries, barley, etc., from a vacuum pack)", "125g/4½oz cooked Puy lentils (tinned or vacuum packed is fine)", "small bunch thyme, leaves picked", "small bunch sage, leaves chopped, plus extra whole leaves for garnish", "75g/2½oz soft breadcrumbs, plus extra for garnish", "40g/1½oz pine nuts (optional)", "100g/3½oz dried apricots, chopped", "1 unwaxed lemon, finely grated zest only", "6 large eggs, beaten", "100ml/3½fl oz white wine", "2 tbsp soy sauce", "2 leeks, thinly sliced", "salt and freshly ground black pepper, to taste"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/160C Fan/Gas 4. Butter a 900g/2lb loaf tin and line the bottom with a strip of baking paper that comes up the short sides. This will help loosen the loaf to turn it out.", "Add 1 tablespoon oil to a frying pan and gently fry the onion for 10 minutes until soft, and just beginning to colour. Add the garlic and fry for 1 minute. Transfer to a bowl. Set the pan back on the heat, add the remaining oil and fry the rosemary and mushrooms until they have browned, released their water and are mostly dry. Set aside with the onions and garlic.", "Put the nuts in a food processor and pulse until roughly chopped. Transfer to a large bowl with the cheese, grains, lentils, herbs, breadcrumbs, pine nuts (if using) and apricots. Stir in the onion and mushroom mixture.", "In another bowl, combine the lemon zest, eggs, wine and soy sauce. Pour into the nut mixture, season with salt and plenty of black pepper and stir until thoroughly combined. ", "Put a layer of sliced leeks in the bottom of the prepared loaf tin so they are lying flat and evenly spread out (reserve the green parts for garnish). Pour the nut roast mixture on top and pack down with the back of a spoon. Cover with foil and bake for 1 hour. Allow the nut roast to rest for at least ten minutes before turning out. ", "To garnish, heat a knob of butter in a frying pan over a medium heat. Add the green parts of the sliced leeks and fry for 5 minutes, stirring occasionally, until softened. Add the reserved breadcrumbs and sage leaves, stirring until the breadcrumbs are beginning to crisp a little. Sprinkle the mixture over the top of the turned-out nut roast and serve with all the trimmings."]}, {"isVegetarian": true, "title": "Creamy mushroom ragù with nutmeg mash", "url": "www_bbc_co_uk_food_recipes_nutmegmash_70579", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "450g/1lb chestnut mushrooms, wiped & thickly sliced", "350g/12oz flat field mushrooms, wiped, peeled and thickly sliced", "115g/4oz button mushrooms", "2 heaped teaspoons plain flour", "150ml/¼ pint dry sherry", "300ml/½pint vegetable stock", "300ml/½ pint double cream", "squeeze of lemon juice", "1 bunch fresh thyme, roughly chopped", "salt", "freshly ground black pepper", "900g/2lb potatoes, scrubbed well", "280g/10oz buttermilk", "nutmeg, freshly grated", "1 tablespoon olive oil", "1 large leek, washed and shredded", "450g/1lb dark green cabbage or spring greens, washed and finely shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large frying pan or wok, heat the butter and fry the mushrooms for 5-7 minutes, or until slightly softened. ", "Sprinkle over the flour and cook for a further minute. Add the sherry, half the vegetable stock, and the thyme. Season well and simmer for 10-15 minutes.", "Add the cream and lemon juice to the mushroom broth and simmer for a further five minutes, adding extra vegetable stock if the broth looks too thick. (The broth should be like a thick gravy).", "Cut the scrubbed potatoes into small, even sized pieces. Place into a saucepan, cover with water and cook until tender. ", "Drain well, return to the saucepan, and mash with the buttermilk. Season with nutmeg, salt and freshly ground black pepper and keep warm.", "In a large frying pan or wok, heat the olive oil and fry the leek briskly for two minutes.", "Add the shredded cabbage and stir fry over a high heat for 2-3 minutes or until just tender. Season with salt and pepper to taste.", "To serve, ladle the broth into four warmed, large soup plates. Place a scoop of creamy mashed potato in the centre of the broth and top the potato with a flourish of spicy cabbage."]}]