[{"ingredients": ["2 chalotes, en rodajas finas", "½ cucharadita de aceite de sésamo", "1 guindilla verde, finamente picada (opcional)", "2 cucharadas de pasta de curry verde tailandés", "300ml / 10fl oz de caldo de verduras calientes", "200g / 7oz de leche de coco más liviana", "1 cucharadita de salsa de pescado tailandés (opcional)", "1 berenjena mediana, cortada en trozos de 2cm / 1in", "2 hojas de lima kaffir", "200 g / 7 oz de tofu, cortado en cuadrados de 1,5 cm / ½ pulgadas", "½ pimiento verde, cortado en rodajas finas", "50g / 1¾oz mangetout", "50 g / 1¾oz de maíz enano, reducido a la mitad o cortado en cuartos, según el tamaño", "jugo de 1 lima, más trozos de lima para servir", "puñado de cilantro fresco finamente picado, para servir", "150g / 5½oz de arroz basmati, para servir"], "method": ["Freír las chalotas en el aceite a fuego medio durante 2-3 minutos. Agregue la guindilla y fría por 1 minuto. Agregue la pasta de curry y fría durante 1 minuto.", "Vierta el caldo caliente, la leche de coco y la salsa de pescado tailandés (si está usando) y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 5 minutos.", "Agregue las hojas de berenjena y lima y cocine durante 10 minutos.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Agregue el tofu y el pimiento verde al curry y cocine con la tapa cerrada durante 3 minutos. Agregue el mangetout y el maíz para bebés (si se usa) y exprima el jugo de lima. Cocine por 3 minutos.", "Sirva el curry con el arroz, espolvoreado con cilantro y con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_lighter_thai_green_67858", "title": "Encendedor de vegetales al curry verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lighter_thai_green_67858_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de azúcar", "1 cucharada de sal", "1 cucharadita de curry en polvo", "4 x 150-200 g / 5½-7oz de filetes de merluza", "1 cucharada de aceite de colza", "25g / 1oz de mantequilla", "48 almejas", "175ml / 6fl oz de vino blanco seco", "2 cucharadas de crema doble", "200g / 7oz de mantequilla", "1 limón, solo jugo", "2 cucharadas de alcaparras", "1 cucharada de cebollino picado", "1 col rizada negra principal (repollo negro)", "25g / 1oz de mantequilla", "pizca de nuez moscada rallada", "pizca de sal"], "method": ["Mezcle el azúcar, la sal y el polvo de curry en un tazón pequeño. Frote sobre el lado de la carne del pescado y déjelo a un lado durante 5 minutos, luego enjuague el frote y seque el pescado.", "Lave las almejas. Deseche cualquier almeja abierta que no se cierre cuando se le da un golpecito fuerte. Coloque las almejas en una sartén grande con tapa y el vino blanco. Cocine con la tapa puesta durante 2-3 minutos o hasta que las almejas se abran. Deseche cualquier almeja que no se abra.", "Cuele el licor a través de una tela de muselina en una sartén limpia y reserve las almejas.", "Agregue la crema doble a la sartén y caliente para reducir el volumen en dos tercios. Batir en la mantequilla. Sazonar con jugo de limón. Agregue las alcaparras y las cebolletas picadas.", "Para la col rizada, ponga a hervir un sartén grande de agua hirviendo con sal. Tome las hojas pequeñas dentro de la col rizada negro. Sumérgete en el agua hirviendo y luego saca y escurre. Derrita la mantequilla en una sartén, agregue la col rizada y sazone con sal y nuez moscada.", "Para cocinar la merluza, caliente el aceite de colza en una sartén y luego agregue la mantequilla. Cuando la mantequilla se derrita, agrega el pescado con la piel hacia abajo. Cocine hasta que se dore, luego voltee y cocine hasta que la carne esté sellada y ya no sea translúcida. Regrese al lado de la piel hacia abajo y continúe freír hasta que esté cocido. Retire el pescado de la sartén y escurra sobre papel de cocina.", "Divida la col rizada negra entre los platos para servir y coloque el pescado encima. Retire las almejas de sus caparazones. Agrégalos a la salsa y viértela alrededor de los platos."], "url": "www_bbc_co_uk_food_recipes_lightly_cured_hake_on_62672", "title": "Merluza ligeramente curada en col rizada negra con salsa de almejas, alcaparras y mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / ½ litro de caldo de pescado caliente (los vegetarianos pueden sustituir el caldo de verduras)", "3 tallos del tallo de brócoli", "2 cucharadas de guisantes frescos, o guisantes congelados, descongelados", "1 guindilla, finamente picada", "2 cucharadas de semillas de sésamo", "2 cucharadas de arroz basmati cocido", "2 cucharaditas de salsa de soja", "2 cucharaditas de aceite de sésamo", "puñado de cilantro fresco, picado, para servir"], "method": ["Coloque el caldo en una sartén y llévelo a ebullición. Agregue el brócoli, los guisantes y el chile y hierva hasta que el brócoli y los guisantes estén tiernos.", "Agregue los ingredientes restantes, excepto el cilantro, y cocine a fuego lento suavemente para calentarlos.", "Para servir, vierta el caldo en un recipiente y espolvoree sobre el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_lightorientalstylebr_86168", "title": "Caldo ligero de estilo oriental", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pepinos de bebé, solo piel", "1 cucharada de té verde en polvo", "1 rábano japonés, lavado y pelado", "Jugo de remolacha 75ml / 2½fl oz", "250ml / 9fl oz de aceite de orujo (o un aceite de oliva claro)", "25ml / 1fl oz de vinagre de vino blanco", "½ cucharadita de sal", "7.5 g / oz de azúcar en polvo", "25 ml / 1 fl oz miel", "4 ramitas de tomillo, hojas recogidas y finamente picadas", "1 diente de ajo, finamente picado o rallado", "4 remolachas rojas", "4 pepinos de bebé, cáscara utilizada para adornar (desde arriba)", "5g de sal", "5 g de azúcar", "1 cucharada de jugo de limón", "200 g / 7 oz de sal marina de Cornualles", "125g / 4½ oz de azúcar", "7.5g / ⅓oz semillas de cilantro, aplastadas", "7.5g / ⅓oz de granos de pimienta blanca, aplastados", "4 filetes de caballa muy frescos y de buena calidad, deshuesados ​​y cortados longitudinalmente en dos", "4 limas, cáscara y jugo solamente", "1 pepino grande, solo cáscara", "50ml / 2fl oz de aceite de orujo (o un aceite de oliva claro)"], "method": ["Para la guarnición, pele todos los pepinos de bebé y seque la piel en un deshidratador (alternativamente coloque en un horno a la temperatura más baja durante unas horas o déjelo toda la noche en un armario de aire caliente).", "Cuando las cáscaras de pepino se hayan secado por completo, mezcle hasta obtener un polvo fino en un procesador de alimentos. Mezcle cantidades iguales de polvo de pepino con el polvo de té verde y reserve.", "Para la remolacha, agregue el aceite, el vinagre, la sal, el azúcar y la miel a una licuadora (o un mezclador térmico) y mezcle hasta que esté emulsionado. Agregue el tomillo y el ajo y reserve.", "Use una mandolina para cortar la remolacha, luego coloque en un tazón. Agregue la mezcla de aceite, cubra y deje marinar durante dos horas.", "Para los pepinos de bebé, use un soplete de cocinero para quemar los pepinos de bebé pelados hasta que estén uniformemente coloreados. Coloque en una bolsa de sous vide junto con el resto de los ingredientes.", "Selle la bolsa y transfiérala a un baño de agua (de acuerdo con las instrucciones del fabricante) para que se cocine durante 20 minutos.", "Para la caballa, en un recipiente combine todos los ingredientes, excepto la caballa, la ralladura de lima y el jugo de lima, y ​​mezcle bien.", "Coloque los filetes de caballa con la carne hacia arriba en una bandeja, luego empaquete la mezcla de sal en la carne y déjelo a un lado durante 25 minutos.", "Para el aceite de pepino, pelar el pepino y blanquear la piel. Drene bien, luego agregue a un procesador de alimentos con aceite de orujo y mezcle hasta obtener un aceite verde intenso.", "Para la caballa, cepille la sal de la caballa y deséchela.", "Use un soplete de chef para cocinar la caballa (o cocínelos bajo una parrilla muy caliente durante unos minutos). Sazonar con sal marina, jugo de limón y ralladura.", "Para la guarnición, usando una mandolina, corte el rábano en rodajas. Luego, corta en tiras y sumérgete en el jugo de remolacha muy brevemente antes de servir.", "Para servir, coloque dos pedazos de caballa en el centro de cada plato y cubra con unas rodajas de remolacha marinada. Retire el pepino marinado de la bolsa y córtelo en rodajas gruesas de 2 cm / 1 pulgada, luego coloque las rebanadas alrededor de la caballa. Apila el rábano japonés al final de la caballa. Ponga un poco de aceite de pepino alrededor del plato y luego espolvoree con el polvo de té verde."], "url": "www_bbc_co_uk_food_recipes_lime-cured_mackerel_46354", "title": "Caballa curada con cal, rábano japonés y té verde", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 250 g / 9 oz piezas de rape, recortadas", "2 chiles rojos, finamente picados", "2 dientes de ajo, finamente picados", "2 limas, cáscara y jugo", "3 cucharadas de hojas de cilantro picado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 manojo de berros, para adornar", "450 g / 1 lb de petit pois o guisantes congelados, descongelados y escurridos", "½ cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "3 cucharadas de hojas de menta", "3 cucharadas de hojas de cilantro", "1 chile rojo, sin semillas y finamente picado", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 lima, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "3 tomates, semillas retiradas y finamente picadas", "2 dientes de ajo, finamente picados", "2 cucharadas de hojas de cilantro finamente picadas", "2 cucharadas de chiles jalapeños, finamente picados", "1 lima, solo jugo", "1 pizca de azúcar"], "method": ["Corte la cola de rape hacia atrás para que un poco del hueso sobresalga por un extremo y presione ligeramente la carne hacia abajo.", "Coloque los chiles, el ajo, la ralladura de limón y el jugo, el cilantro y el aceite de oliva en un bol con un poco de sal y pimienta negra recién molida. Agregue las colas de rape y mezcle para cubrir y coloque en la nevera durante al menos 1-2 horas. Retire el pescado del refrigerador y vuelva a la temperatura ambiente antes de cocinarlo.", "Precalienta el horno a 200C / 400F / Gas 6. Calienta una sartén a prueba de horno hasta que esté caliente, agrega las colas de rape, dobla a cada lado y luego transfiérelas al horno y tuesta durante 4-6 minutos hasta que estén recién cocidas. Retire la sartén del horno y deje que los peces descansen durante cinco minutos, volteando el pescado una vez.", "Mientras tanto, prepara el guisante guacamole. Mezcle todos los ingredientes para el guacamole en un procesador de alimentos para hacer un puré grueso. Sazone con sal y pimienta negra recién molida y luego espolvoree en un tazón para servir y cubra con aceite de oliva.", "Para la salsa, coloque todos los ingredientes en un tazón y mezcle suavemente para combinar. Sazonar con sal y pimienta negra recién molida", "Para servir, coloque una cucharada de cada uno de los guacamole y salsa en el plato. Coloque el rape al costado y termine con unas pocas hojas de berros."], "url": "www_bbc_co_uk_food_recipes_lime_and_chilli_monkfish_37149", "title": "Cola de rape de Lima y chili con guacamole de guisante", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, finamente picados", "aceite de oliva, para freír", "1 cucharadita de canela molida", "1 cucharadita de comino molido", "1 cucharadita de pasta de chipotle o 1 chile rojo, finamente picado", "2 x 400 g de judías negras", "sal marina y pimienta negra recién molida", "20 tomates cherry", "½ chile rojo, sin semillas y finamente picado", "algunas ramitas de cilantro fresco, hojas recogidas", "½ lima, solo jugo", "aceite de oliva virgen extra, al gusto", "1 aguacate maduro, piedra removida y pelada", "1 chile verde", "½ lima, solo jugo", "8 tortillas de trigo o maíz", "4 huevos de gallinas camperas, fritos", "puñado de queso rallado, como manchego o queso fresco", "manojo de rábanos del desayuno, limpiado y picado", "yogur natural, de oveja o de leche de coco (opcional)", "algunas ramitas de cilantro", "salsa de chile dulce"], "method": ["Para los frijoles, caliente una sartén a fuego medio. Agregue el ajo y un chorrito de aceite de oliva y cocine por un minuto más o menos, hasta que los bordes del ajo comiencen a dorarse.", "Agregue la canela, el comino y la pasta de chipotle o chile y revuelva por otro minuto para tostar suavemente las especias. Agregue los frijoles y su líquido, hierva a fuego lento, luego baje la temperatura y cocine durante 10-15 minutos, hasta que el líquido se haya espesado pero los frijoles sigan manteniendo su forma. Si es necesario, agregue un poco de agua caliente para aflojar. Sazonar con sal y pimienta y mantener caliente.", "Para la salsa, corta los tomates aproximadamente en un tazón grande. Coloque el chile y el cilantro encima, sazone con sal y pimienta y corte todo esto. Raspe en un tazón grande, agregue el jugo de lima y un chorrito de aceite de oliva y mezcle bien. Dejar de lado.", "Para el guacamole, machaque el aguacate en un bol con un poco de sal y pimienta, el chile y el jugo de lima. Puede usar un triturador de patatas o un tenedor si lo desea.", "Una vez que todo esté listo, caliente sus tortillas. Hago esto sosteniéndolos con pinzas sobre la llama de mi placa de gas, es súper rápido y da un delicioso sabor carbonizado, pero al horno le irá bien.", "Llene las tortillas con los frijoles, salsa, guacamole, huevo, queso y rábanos. No olvides la salsa de chile, el cilantro y un poco de yogur, si los usas."], "url": "www_bbc_co_uk_food_recipes_lime_and_chipotle_black_35645", "title": "Tacos de frijoles negros de Lima y chipotle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lime_and_chipotle_black_35645_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "1 yema de huevo de rango medio", "50g / 1¾oz de azúcar glas", "1 cucharadita de sabor a coco", "165g / 5⅔oz de harina natural, más extra para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "5 huevos grandes de gallinas camperas", "2 yemas de huevo grandes de campo abierto (reserva los blancos para el aderezo)", "150 g / 5½ oz de azúcar en polvo", "5 limas, jugo y ralladura solamente", "1 limón, zumo y ralladura sin cebar", "150ml / 5fl oz de crema doble", "coloración verde (opcional)", "5 claras de huevo grandes de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "50g / 1¾oz de coco desecado", "coco en copos, para decorar"], "method": ["Para la masa, batir la mantequilla en un tazón, agregar la yema de huevo y tamizar el azúcar glas. Mezcle bien hasta que se combinen y agregue el sabor a coco. Tamice la harina y trabaje con una cuchara de madera hasta que tenga una masa firme. Enfriar en la nevera durante 30 minutos o en el congelador durante 10 minutos.", "Engrase la lata de flan con mantequilla. Estirar la masa sobre una superficie de trabajo ligeramente enharinada. Suavemente levante la masa en la lata y presiónela en los bordes. No te preocupes si se desmorona; puedes arreglarlo en la lata. Enfriar en la nevera durante 30 minutos o en el congelador durante 10 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Alinee la caja pastosa con el pergamino para hornear y rellene con frijoles para hornear o arroz sin cocer. Hornee por 15 minutos, luego quite el pergamino y los frijoles para hornear. Hornea por otros 5 minutos. Cepille la masa con el huevo batido y vuelva al horno por 5 minutos. Dejar de lado para enfriar en la lata. Recorta el borde de la masa.", "Reduzca la temperatura del horno a 140C / 120C Fan / Gas 1.", "Para el relleno, en un tazón grande, combine los huevos, las yemas de huevo, el azúcar, la lima y el jugo y la ralladura de limón. Usando un batidor de mano eléctrico, bata durante 2-3 minutos, hasta que quede suave y el azúcar esté completamente incorporado. Agregue la crema y bata durante otro minuto, hasta que se combinen. Agregue un poco de colorante verde, si lo usa. Vierta el relleno en una cacerola y caliente muy suavemente (no se recaliente o revuelva los huevos) revolviendo todo el tiempo, durante 10-15 minutos, hasta que espese.", "Vierta la mezcla en la caja de repostería preparada y hornee durante 10 minutos. Verifique si el relleno está configurado (si desea que se haya configurado). De lo contrario, siga revisando cada 5 minutos hasta que haya un ligero bamboleo en el medio. Retire del horno mientras prepara el merengue.", "Aumente la temperatura del horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el relleno, coloque las claras de huevo y el azúcar en un tazón grande y resistente al calor colocado sobre una sartén con agua apenas hirviendo. Batir suavemente hasta que la temperatura de la mezcla de huevo alcance los 70ºC en un termómetro de azúcar. Retire del fuego y transfiera a la taza de un mezclador independiente equipado con un accesorio batidor. Batir hasta que esté frío, grueso y brillante.", "Vierta la mitad de la mezcla en una bolsa grande con una boquilla de estrella grande. Doble suavemente el coco desecado en el resto (no mezcle demasiado ya que el merengue colapsará). Apila el merengue de coco en la caja de pastelería y alisa suavemente la superficie. La tubería gira con el merengue restante para decorar la parte superior.", "Hornee la tarta durante 15 minutos, o hasta que el merengue quede crujiente por fuera y comience a dorarse. Cinco minutos antes del final de la cocción, esparza algunas hojuelas de coco encima. Retire del horno y deje enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_lime_and_coconut_93553", "title": "Tarta de merengue de lima y coco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 pie de 20cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lime_and_coconut_93553_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, para quitar el polvo", "½ cucharadita de sal de mesa", "280 g / 10 oz de mantequilla sin sal, refrigerada", "¼ cucharadita de jugo de limón", "75g / 2% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070 %% 20cocoa% 20solids)", "1 lima, finamente rebanada", "100 g / 3½ oz de azúcar en polvo blanco", "150ml / 5fl oz de zumo de lima recién exprimido (aproximadamente 7 limas), más la ralladura de 3 limas", "2 huevos grandes de gallinas camperas", "Azúcar en polvo blanco 140g / 5oz", "100g / 3½fl oz de mantequilla sin sal", "Crema doble de 200 ml / 7 fl oz", "35g / 1¼ oz de azúcar glas", "140g / 5oz de grasa total mascarpone"], "method": ["Para hacer la masa de hojaldre, combine la harina, la sal y la mantequilla 30 g / 1 oz en una batidora independiente con la paleta unida. Agregue 110ml / 3¾fl oz de agua y el jugo de limón y amasar hasta conseguir una masa homogénea. Cubra con una película adhesiva y descanse en la nevera durante 15 minutos.", "Toma 2 pedazos grandes de pergamino para hornear y colócalos a cada lado del bloque de mantequilla restante. Aplanar la mantequilla con un rodillo hasta que tenga forma cuadrada.", "Una vez que la masa ha descansado, desplácese hacia un cuadrado lo suficientemente grande como para envolver la mantequilla. Coloque la mantequilla en el centro de la masa en un ángulo de 45 grados (por lo que las esquinas de la mantequilla apuntan a los bordes de la masa). Envuelva la mantequilla en la masa y presione para sellar. Estirar en un rectángulo largo y doblar la masa sobre sí mismo en tercios (como doblar una letra). Saca la masa nuevamente y luego repite el proceso de doblado. Cubra con una película adhesiva y descanse en la nevera durante 15 minutos.", "Repita el proceso de laminado y plegado otras 4 veces. Descanse la masa en la nevera durante otros 20 minutos.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "Una vez que la masa ha descansado, extiéndala a un rectángulo de al menos 45 cm de largo y un grosor de 5 mm. Corta tiras largas de aproximadamente 1½ cm / 3¾ de grueso y 45cm / 17½ pulgadas de largo.", "Comenzando en la punta de un molde de cuerno de crema, envuelva una tira de masa en espiral para asegurar que se superpone. Repita para los 12 moldes. Coloque en 2 bandejas para hornear forradas con papel de hornear antiadherente. Hornee durante 15-20 minutos, hasta que la masa esté crujiente y dorada. Deje que se enfríe un poco antes de quitar los moldes y colocarlos en una rejilla para que se enfríen por completo.", "Derretir el chocolate en un recipiente suspendido sobre una olla de agua hirviendo y sumergir en los extremos anchos de los cuernos. Déjelo enfriar hasta que el chocolate esté listo.", "Para la lima confitada, hierva una olla de agua. Agregue las rodajas de lima y hierva durante 2 minutos, luego elimine con una cuchara ranurada. Frote la olla y enjuague. Luego reemplace el agua hirviendo y las rebanadas de lima y hierva por 2 minutos. Repita este proceso 4 veces (esto eliminará cualquier amargura de las limas). Después del último tiempo, enjuague la sartén y agregue el azúcar y 100 ml / 3 ½ oz de agua.", "Agregue las rodajas de lima y cocine a fuego lento. Cocine por 20 minutos hasta que las rebanadas sean translúcidas. Dejar de lado para enfriar y luego cortar en cuartos.", "Para la cuajada de lima, mezcle el jugo, la ralladura, los huevos, el azúcar y la mantequilla en una cacerola. Cocine a fuego medio hasta que quede suave y espeso. Dejar de lado para enfriar.", "Para la crema de mascarpone Chantilly, bate la crema doble a los picos suaves, luego bate el azúcar glas. En un recipiente aparte, bata el mascarpone hasta que quede suave y luego mezcle en 180 g / 6½ oz de la cuajada. Doble la mezcla de mascarpone en la crema batida. Coloque una cuchara en una manga pastelera equipada con una boquilla de estrella de 1 cm / ½ in.", "Para ensamblar los cuernos, coloque los cuernos de los pasteles en tazas para ayudarlos a pararse. Llénelos con la mezcla de crema y cubra con un trozo de limón confitado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lime_cream_horns_35107", "title": "Cuernos de crema de cal", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 12 cuernos de crema", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 claras de huevo", "100 g / 3½ oz de azúcar en polvo", "160g / 5½oz de coco desecado", "1 cucharadita de ralladura de lima rallada", "1 cucharada de jugo de lima"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Use sus manos para cubrir con mantillo las claras de huevo, el azúcar, el coco, la ralladura de lima y el jugo en un bol hasta que se junten ligeramente.", "Con las manos mojadas, presione la mezcla en una forma plana y cuadrada de aproximadamente 1 cm de altura.", "Use un vaso de licor pequeño hacia arriba para cortar las rondas pequeñas, y colóquelas en una bandeja para hornear ligeramente engrasada o antiadherente.", "Hornea durante 12-15 minutos en el centro del horno hasta que estén ligeramente dorados, simplemente tocados con color.", "Enfríe los macarrones en una rejilla y guárdelos en un recipiente hermético."], "url": "www_bbc_co_uk_food_recipes_limeandcoconutmacaro_71742", "title": "Macarrones de Lima y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/limeandcoconutmacaro_71742_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de leche de coco", "1 cucharada de harina normal", "1 cucharada de harina de maíz", "1 lima, ralladura solamente", "75g / 2¾oz de mantequilla, más extra para preparar los moldes", "3 huevos de gallinas camperas, separados", "Azúcar en polvo de 55 g / 2 oz, más extra para quitar el polvo de los moldes", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Cepille dos platos de ramekin con un poco de mantequilla derretida. Agregue una pequeña cantidad de azúcar a cada uno, gírelos para cubrir los lados y el fondo, sacudiendo cualquier exceso.", "Caliente la leche de coco, la harina, la harina de maíz, la ralladura de lima y la mantequilla en una cacerola a fuego medio durante 5-6 minutos, o hasta que espese un poco.", "Coloque las yemas de huevo en un tazón y vierta la mezcla de leche de coco sobre ellas, batiendo continuamente hasta que estén bien combinadas.", "En un tazón limpio y separado, bata las claras de huevo con el azúcar hasta que forme picos suaves cuando se quite el batidor.", "Con cuidado dobla la mezcla de coco en la mezcla de clara de huevo.", "Vierta la mezcla de soufflé en los moldes, nivele la parte superior con una espátula y colóquela en una bandeja para hornear. Transfiera al horno por 6-8 minutos, o hasta que se levante y se dore.", "Para servir, espolvorear con azúcar glas con un colador. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_limeandcoconutsouffl_89372", "title": "Soufflé de lima y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz basmati", "3 cucharadas de cilantro fresco picado", "1 lima, ralladura y jugo", "sal y pimienta negra recién molida", "pizca de aceite de oliva"], "method": ["Cocine el arroz de acuerdo con las instrucciones del paquete y luego mezcle el cilantro, la ralladura de lima y el jugo, la sal y la pimienta negra recién molida y el aceite de oliva.", "Poner en un bol y servir."], "url": "www_bbc_co_uk_food_recipes_limeandcorianderrice_88154", "title": "Arroz de lima y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 fresas, cascadas y en rodajas", "Crema doble de 300 ml / ½ pinta", "3 cucharadas de yogur al estilo griego", "4 cucharadas de leche condensada", "½ lima, ralladura y jugo", "55 g / 2 oz de chocolate negro, derretido"], "method": ["Coloque dos anillos de 10cm / 4 pulgadas de diámetro en dos platos. Alinee los bordes con rebanadas de fresa.", "Batir la crema en un tazón para mezclar hasta que forme picos suaves. Agregue el yogur griego, la leche condensada y la ralladura de lima. Agregue el jugo de lima, para espesar la mezcla.", "Coloque la mezcla de crema en los anillos cubiertos de fresa y nivele la parte superior. Coloque en el refrigerador para establecer durante 5-10 minutos o más si es posible.", "Suelta las tortas de queso de los anillos calentando cuidadosamente con un soplete de cocina alrededor del exterior. Rocíe con el chocolate derretido y sirva."], "url": "www_bbc_co_uk_food_recipes_limecheesecakewithst_92316", "title": "Tarta de queso con fresas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 limas, cáscara y jugo", "85g / 3oz de mantequilla fría, cortada en cubos", "225 g / 8 oz de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "300ml / 10½fl oz de leche entera", "300ml / 10½ fl oz crema doble", "pizca de sal", "3 huevos de gallinas camperas", "100g / 3½oz de azúcar moreno claro y suave", "40 g / 1½ oz de mantequilla sin sal, ablandada, más extra para engrasar", "4-6 rollos de pan blanco blando, en rodajas", "100 g / 3½ oz de arándanos frescos", "50g / 2oz de arándanos secos", "3-4 cucharadas de ron (opcional)", "8 cucharadas de gelatina de grosella roja lista para usar, para acristalamiento", "Crema doble de 200 ml / 7 fl oz, batida hasta que se formen picos rígidos cuando se retira la batidora, para servir"], "method": ["Para la cuajada de lima, caliente todos los ingredientes de la cuajada de lima en una cacerola de base pesada a fuego lento durante 10-12 minutos, revolviendo constantemente, hasta que la mezcla se espese. Colar a través de un tamiz fino y reservar para enfriar. Una vez que esté frío, vierta en frascos de mermelada esterilizados.", "Para el budín, caliente la leche y la crema en una olla aparte hasta que hierva, luego retire la sartén del fuego. En un recipiente aparte, bata los huevos, la sal y el azúcar hasta que estén bien combinados, luego vierta la mezcla de leche y crema sobre la mezcla de huevo y azúcar, batiendo hasta que esté suave y bien combinado.", "Unte con mantequilla las rebanadas de pan y, usando aproximadamente 12 cucharadas de la cuajada de lima, esparza la cuajada sobre ambos lados de cada rebanada de pan.", "Cubra la parte inferior de un plato engrasado para horno con una capa de rebanadas de pan, superponiendo ligeramente los bordes del pan. Espolvorea sobre algunos de los arándanos frescos y secos y 1-2 cucharadas de ron, si se usan. Repita el proceso de estratificación una vez más, o hasta que todo el pan, los arándanos y el ron se hayan agotado. (NB: Deberías tener suficiente para dos capas).", "Vierta la mezcla de crema y huevo sobre el pan y deje reposar durante una hora.", "Precalentar el horno a 180C / 365F / Gas 4.", "Coloque el plato de budín en una bandeja de asar. Con cuidado, agregue suficiente agua hirviendo a la bandeja para llegar a un tercio del camino por los lados del plato de budín (esto se conoce como baño maría). Transfiera al horno y hornee durante 40-45 minutos, sin tapar, o hasta que la crema se haya endurecido y la parte superior del pudín esté dorada. (NB: revise el pudín de vez en cuando durante la cocción, empujando cualquier arándano que flote hacia la superficie de nuevo debajo de la crema mientras se fija, usando un tenedor, para evitar que se quemen los arándanos).", "Retire el pudin del horno y del baño María y déjelo enfriar durante 8-10 minutos.", "Mientras tanto, caliente la jalea de grosella en una cacerola con dos cucharadas de agua, hasta que la gelatina se haya derretido y la mezcla forme una salsa suave. Cepille la parte superior del budín con esta mezcla, luego déjela enfriar por otros 10 minutos.", "Sirve con la crema batida."], "url": "www_bbc_co_uk_food_recipes_limeandcranberrybrea_92670", "title": "Pan de lima y arándano y pudín de mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/limeandcranberrybrea_92670_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["generoso aceite de oliva glug", "generosa mantequilla perilla", "4 chalotes pequeños, finamente picados", "1 lima, jugo y ralladura solamente", "1 cucharadita de azúcar", "2 docenas de vieiras, cortadas y listas para cocinar", "generoso glug tequila de buena calidad (¡puedes beber el resto de la botella durante la cena!)", "1 puñado de cebollín finamente picado", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva y la mantequilla en una sartén de fondo grueso a fuego medio. Agregue los chalotes y el sudor suavemente - no permita que se doren.", "Agregue el jugo de limón y la ralladura y cocine por un minuto o dos.", "Agregue el azúcar y revuelva continuamente - es importante mantener los ingredientes en movimiento alrededor de la sartén en este punto para evitar que se queme el azúcar.", "Aumente el fuego a alto y luego agregue las vieiras. Fry por otro minuto.", "Agregue un gran chorro de tequila y las cebolletas picadas y flambeadas - si cocina con gas cuidadosamente, deje que la llama solo atrape la sartén o si usa una placa eléctrica, es posible que necesite usar un fósforo para encender el tequila (PRECAUCIÓN: Tenga cuidado al flamear vieiras y mantenga su cara bien lejos de la sartén. Si usted no es un cocinero experimentado, debe tener en cuenta que este método de cocción puede crear grandes llamas). Si el tequila no se enciende rápidamente, no se sienta tentado a mantener la sartén sobre el fuego ya que esto sobre cocinará las vieiras.", "Sirva las vieiras calientes de la sartén y en envolturas calientes de tortilla o con arroz con mantequilla de limón."], "url": "www_bbc_co_uk_food_recipes_limedqueenscallopsfl_79862", "title": "Vieiras de reina con cal flambeadas en tequila", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½ fl oz de leche", "25 g / 1 oz de mantequilla sin sal, más extra para engrasar", "1 cucharada de harina de maíz", "½ cucharadita de jengibre molido", "¼ cucharadita de extracto de vainilla", "2 limas, solo cáscara", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja para hornear en el horno para calentar.", "En un tazón grande bata las claras de huevo hasta que se formen picos duros. Poco a poco agregue el azúcar y continúe batiendo hasta que esté suave y esponjoso. Deténgase cuando la mezcla sea lo suficientemente espesa como para dejar un rastro similar a una cinta cuando se levante la batidora.", "Calentar la leche en una olla pequeña hasta el punto de escaldar. Agregue la mantequilla de 25g / 1oz y permita que se derrita, luego agregue la harina de maíz, el jengibre molido y el extracto de vainilla. Batir hasta que espese. Vierta en un tazón grande y mezcle la ralladura de limón.", "Ponga un poco de la mezcla de clara de huevo en la mezcla de lima y jengibre y mezcle bien. Doble con cuidado el resto de la mezcla de clara de huevo, asegurándose de mantener el volumen.", "Llene dos moldes engrasados ​​con la mezcla y coloque en la bandeja para hornear caliente y en el horno. Cocine por 10 minutos hasta que los soufflés hayan subido.", "Para servir, coloca los soufflés en el centro de un plato y espolvorea con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_limegingerandvanilla_81308", "title": "Soufflé de lima, jengibre y vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Filete de salmón 150 g / 5 oz", "1 lima, pelada y rebanada", "1 cucharadita de azúcar moreno", "sal y pimienta negra recién molida", "85g / 3oz de guisantes congelados", "25g / 1oz de mantequilla", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el salmón, caliente la mitad del aceite de oliva en una sartén a prueba de horno y fría el pescado con la piel hacia abajo durante 2-3 minutos o hasta que esté crujiente y dorado. Coloque las rodajas de lima sobre el pescado, espolvoree con el azúcar, sazone con sal y pimienta negra recién molida y coloque en el horno para asar durante 5-7 minutos, o hasta que esté bien cocido.", "Para los guisantes, cocine los guisantes en agua hirviendo durante 2-3 minutos o hasta que estén tiernos. Escurrir, luego mezclar con la mantequilla y el jugo de lima y sazonar con sal y pimienta negra recién molida.", "Para servir, coloca los guisantes blandos en un plato para servir y coloca el salmón sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_limeroastedsalmonfil_90411", "title": "Lime filete de salmón asado en guisantes cítricos guisantes blandos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de azúcar en polvo", "8 vainas de cardamomo verde, sin semillas y aplastadas", "150ml / 5¼fl oz de agua", "150ml / 5¼fl oz de jugo de limón", "1 cucharada de ralladura de lima rallada o al gusto", "trozos de piña o anillos"], "method": ["Ponga el azúcar impalpable, las vainas de cardamomo y el agua en una sartén. Revuelva sobre un calor suave hasta que el azúcar se haya disuelto.", "Quite el fuego y deje enfriar antes de agregar la ralladura de la cal. Mezcle y vierta sobre los trozos o anillos de piña."], "url": "www_bbc_co_uk_food_recipes_limesyrup_72368", "title": "Jarabe de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Rinde 4 porciones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "165 g / 6 oz de azúcar en polvo", "2 huevos de gallinas camperas, solo yemas", "80g / 3oz de mantequilla sin sal", "1 limón, cáscara y jugo solamente", "6-8 rebanadas gruesas de limón dulce siciliano y pan dulce de naranja (cortezas), descuartizado", "vaso pequeño de licor de limoncello", "4 pequeños nidos de merengue", "300 ml / 10 fl oz de crema fresca", "300 ml / 10 fl oz doble crema", "1 cucharada de azúcar glas", "¼ cucharadita de extracto de vainilla", "puñado de almendras tostadas", "ralladura de limón confitada"], "method": ["Para hacer la cuajada de limón, mezcle los huevos, el azúcar y las yemas en un tazón.", "En una sartén de base pesada, a fuego muy lento, caliente suavemente la mantequilla, la ralladura y el jugo, hasta que la mantequilla se haya derretido. Agregue la mezcla de huevo y revuelva constantemente a fuego lento hasta que se espese. Esto tomará 10 minutos o más. No te apresures o obtendrás huevos revueltos.", "Cuele la mezcla de cuajada de limón en un bol y cúbrala con un círculo de pergamino para hornear, o use film transparente en contacto con la superficie, para evitar que se forme la piel y deje que se enfríe. Si no está usando la cuajada de inmediato, cuele en un recipiente esterilizado, deje enfriar y selle.", "Para armar la bagatela, forre un recipiente para servir de 2 litros / 3½ pinta con rodajas de limón siciliano y pan dulce de naranja, superponiéndolos ligeramente.", "Rocíe el limoncello en la parte superior y déjelo remojar en el pan, luego extienda la crema de limón en la parte superior.", "Rompe los nidos de merengue y distribúyelos sobre la cuajada, seguido de la crema generosamente con una cuchara sobre la parte superior.", "Vierta la crema en un tazón. Agregue la esencia de azúcar y vainilla y bata hasta que contenga picos suaves cuando se quite la batidora. Con una cuchara, coloca la crema encima de la bagatela en suaves picos. Esparce sobre la almendra tostada y la ralladura de limón confitada. Enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_limoncello_trifle_74838", "title": "Bagatela Limoncello", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 hojas de gelatina", "250ml / 8 fl oz de leche", "Crema doble 250ml / 8fl oz", "25 g / 1 oz de azúcar", "Licor de limoncello 50ml / 2oz", "botón de mantequilla", "50 g / 2 oz de azúcar", "Fresas de 150g / 5oz, descuartizadas", "½ limón, solo jugo", "Para decorar:", "rodajas de limón dragadas en azúcar glas"], "method": ["Ablande las hojas de gelatina en agua fría.", "En una cacerola de base pesada, mezcle la leche, la crema, el azúcar y el licor de limoncello. Hervir a fuego lento, retirar del fuego y agregar las hojas de gelatina.", "Revuelva hasta que la gelatina se haya disuelto y vierta en moldes dariole. Deje que se enfríe, luego colóquelo en el refrigerador para ponerlo.", "Para hacer la salsa, coloque la mantequilla y el azúcar en una cacerola a fuego lento y permita que la mantequilla se derrita y el azúcar se disuelva.", "Agregue las fresas picadas y el jugo de limón. Retirar del fuego y pasar a través de un tamiz. Dejar enfriar.", "Voltee la panna cotta en platos individuales y espolvoréese la salsa de fresas. Decorar con una rodaja de limón bañada en azúcar glas."], "url": "www_bbc_co_uk_food_recipes_limoncelloflavouredp_11694", "title": "Panna cotta con sabor a limoncello con salsa de fresa fresca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ciruelas 225g / 8oz, hoyos eliminados, más o menos picados", "50g / 2oz pasas de Corinto", "50g / 2oz sultanas", "150ml / 5fl oz Earl Grey tea", "450g / 1lb de harina de llanura fuerte, más extra para enharinar", "125ml / 4½ fl oz de leche", "6 cucharadas de azúcar morena suave", "110g / 4oz de mantequilla, derretida, más mantequilla extra para engrasar", "2 huevos de gallinas camperas, golpeados", "1½ cucharadita de canela molida", "1½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de extracto de vainilla", "¼ cucharadita de sal", "15 g / ½ oz de levadura seca", "mantequilla", "Queso Lincolnshire"], "method": ["Coloque las frutas secas en un recipiente y vierta sobre el té Earl Grey. Mezcle bien y deje reposar durante 10 minutos.", "Mientras tanto, tamiza la harina en un tazón grande. Prepare una lata de pan grande engrasando y enharinando el fondo y los lados.", "En un recipiente aparte, mezcle la leche, el azúcar, la mantequilla derretida y los huevos hasta que estén bien combinados.", "Agregue las especias, el extracto de vainilla y la sal y bata de nuevo para combinar.", "Agregue la levadura seca y bata de nuevo para combinar.", "Agregue la harina tamizada un poco a la vez y mezcle hasta que toda la harina se haya incorporado a la mezcla y la mezcla se mezcle como una masa blanda.", "Cuele los frutos secos empapados y deseche el té. Agregue las frutas empapadas a la masa y amasar durante 3-5 minutos, o hasta que la masa esté suave y elástica y los frutos estén bien combinados en la mezcla.", "Transfiera la masa a un tazón limpio, cúbrala con una toalla de té limpia y déjela en un lugar cálido durante 1-2 horas, o hasta que duplique su tamaño (comprobado).", "Cuando la masa haya doblado su tamaño, colóquela en una superficie de trabajo ligeramente enharinada y amasarla brevemente. Transfiera la masa a una lata de pan grande y déjela reposar durante una hora más para levantarse.", "Precalentar el horno a 190C / 375F / Gas 5.", "Cuando la masa se haya levantado, hornee en el horno durante 40-50 minutos o hasta que se dore. Dejar de lado para enfriar en la lata.", "Deje que se enfríe antes de cortar.", "Para servir, corte el pan de ciruela en rodajas y sirva con mantequilla y queso."], "url": "www_bbc_co_uk_food_recipes_lincolnshireplumbrea_92134", "title": "Pan de ciruela Lincolnshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 1 pan (6-8)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]