[{"ingredients": ["aceite de oliva, para lloviznar", "aceite de colza, para freír", "150 g / 5½ oz de espinaca para bebés", "Carne de cangrejo blanca 200 g / 7 oz", "4 tomates de ciruela, sin piel, en rodajas finas", "sal marina y pimienta negra recién molida", "pellizcar hilos de azafrán", "500g / 1lb 2oz '00' de harina, más extra para quitar el polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "5 yemas de huevo de gallinas camperas (100 g / 3½ oz), ligeramente batidas", "2 cucharadas de aceite de oliva", "1 chalote, en rodajas finas", "1 cucharada de aceite de oliva", "1 tira de cáscara de limón sin cera", "2 cucharadas de vermut seco", "120ml / 4fl oz crema batida", "50g / 1¾oz Gruyère, rallado"], "method": ["Para hacer la pasta, remoje el azafrán en 1 cucharada de agua hirviendo durante 5 minutos.", "Coloque todos los ingredientes de la pasta, incluido el azafrán en su agua, en un procesador de alimentos y pulse hasta que la masa se una. Colóquelo sobre una superficie de trabajo ligeramente enharinada y amasar bien, hasta que quede suave. Divida la masa en cuatro pedazos, envuelva cada pieza en una película adhesiva y refrigere durante 2 horas.", "Corta cada pedazo de masa por la mitad. Aplanar una pieza sobre una superficie ligeramente enharinada. Enróllelo a través de una máquina de pasta, gradualmente avanzando hacia dos muescas desde la posición más delgada. Coloque la pasta sobre una superficie de trabajo y corte un disco de 7,5 cm / 3 pulgadas. Repita este paso con la masa restante, debe tener ocho discos. Permita que la pasta se seque en la superficie mientras prepara la salsa.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer la salsa, freír la chalota en el aceite a fuego medio hasta que se ablande. Agregue la cáscara de limón y el vermut y deje que hierva. Cocine a fuego lento hasta que se reduzca a la mitad. Agregue la crema y Gruyère, vuelva a hervir y cocine a fuego lento hasta que espese. Pase a través de un colador en una olla limpia y déjelo a un lado.", "Coloque los discos de pasta en una sartén con agua salada a fuego lento. Cocine durante aproximadamente 3 minutos, luego levante con una cuchara ranurada. Sazonar y rociar sobre un chorrito de aceite de oliva.", "Calentar una sartén a fuego medio, agregar un chorrito de aceite de colza y cocinar las espinacas hasta que se marchiten. Condimentar con sal y pimienta.", "Engrase ligeramente una bandeja grande para hornear y coloque sobre cuatro discos de pasta. Divida la espinaca entre los discos y cubra con la carne de cangrejo y dos rodajas de tomate. Termine con otro disco de pasta y una cuchara sobre la salsa Gruyère. Hornea de 10 a 15 minutos o hasta que burbujee y se dore ligeramente. Sirva inmediatamente en platos calientes."], "url": "www_bbc_co_uk_food_recipes_crab_lasagne_12498", "title": "Lasaña de cangrejo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite de girasol", "1 estrella de anís", "3 cucharadas de anacardos picados", "2 chiles verdes finos, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "2 cebollas tiernas, finamente picadas", "500ml / 18fl oz de caldo de pollo caliente", "2-3 cucharadas soperas de salsa de soja", "2 tbsp cornflour colmado mezclado con 50 ml / 2 fl oz de agua", "2 cucharadas de cilantro finamente picado", "sal y pimienta blanca molida", "aceite de girasol, para freír", "250-300 g / 9-10½ oz de carne de cangrejo", "1 huevo de gallinas camperas", "200g / 7 oz de harina de maíz", "1-2 chiles verdes finos, finamente picados", "1 cebolla tierna, finamente picada", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "1-2 cucharadas de cilantro fresco, finamente picado", "2 cucharadas de salsa de soja ligera", "½ cucharadita de pimienta negra molida", "6-8 colas de langostinos, peladas y desveladas", "3 cucharadas de harina de maíz"], "method": ["Para hacer la salsa, caliente el aceite en un wok a fuego alto. Agregue el anís estrellado y luego los anacardos, revolviendo todo el tiempo para que no se quemen. Tan pronto como los anacardos estén dorados, agregue el chile, el jengibre y las cebolletas y saltee hasta que las cebollas estén blandas. Añadir el caldo y hervirlo. Agregue la salsa de soja y sazone al gusto.", "Agregue la mezcla de harina de maíz y siga revolviendo hasta que la salsa se espese y no haya grumos. (Es posible que necesite agregar más harina de maíz, si la salsa no se espesa). Agregue el cilantro y vierta en un tazón para servir.", "Caliente el aceite en una sartén wok o de grasa profunda a 150 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para hacer los buñuelos, ponga la carne de cangrejo en un tazón y mezcle lo mejor que pueda, mezclándolo bien. Si usa solo carne blanca, tendrá que descomponerla por completo.", "Mezcle bien todos los ingredientes restantes hasta que tenga una pasta espesa. Coloque una cucharadita de la mezcla en el aceite y fría hasta dorar por todos lados. Escurrir sobre papel de cocina y luego probar para verificar el condimento, agregar más sal y pimienta a la mezcla según sea necesario. Freír las cucharadas de la mezcla restante, en tandas, teniendo cuidado de no saturar la sartén.", "Aumente la temperatura del aceite a 200C.", "Sazonar las colas de langostinos y rodarlas en harina de maíz. Colóquelos en el aceite y fríalos hasta que estén rosados ​​y cocidos. Escurrir sobre papel de cocina.", "Para servir, divida los buñuelos entre los platos y vierta sobre la salsa. Cubra con las langostinos y sirva con arroz frito."], "url": "www_bbc_co_uk_food_recipes_crab_fritters_with_08803", "title": "Buñuelos de cangrejo con crujientes colas de langostinos y salsa de chile, anacardo y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 900 g / 2 lb de cangrejo cocido, 350 g / 12 oz de carne de cangrejo fresca", "Linguine 315g / 11oz", "25g / 1oz de sal marina", "55ml / 2fl oz de aceite de oliva", "1 diente de ajo, finamente picado", "4 cebolletas, finamente picadas", "½ cucharadita de chile rojo finamente picado", "275g / 10oz eligieron carne de cangrejo blanca fresca", "25ml / 1fl oz de vino blanco seco", "1 cucharada de perejil fresco de hoja plana picada", "1 cucharada de albahaca fresca picada", "sal y pimienta negra recién molida"], "method": ["Para el cangrejo marrón, primero quite las patas retirándolas del lugar donde se encuentran con el cuerpo. Retire las garras sacándolas del cuerpo. Separe el cuerpo de cangrejo de la parte central del cangrejo colocando el cangrejo sobre su parte posterior (con el lado duro hacia abajo). Coloque sus manos debajo del borde del cangrejo y empuje hacia arriba hasta que escuche que se rompe. Es posible que necesite usar un cuchillo pesado para ayudarlo a alejar el cangrejo.", "Retire los diez dedos esponjosos de los \"hombres muertos\" y deséchelos. Escurra el exceso de agua del caparazón del cangrejo y retire el saco estomacal y las membranas duras dentro del caparazón. Use una cuchara para retirar la carne marrón del caparazón y colóquela en un recipiente (puede usarse en otra receta).", "Rompe las dos grandes garras delanteras y elige la carne blanca. Coloque toda la carne blanca en una bandeja de metal y revise a fondo si hay piezas de concha. Cubra y enfríe en la nevera hasta que lo necesite.", "Para la pasta, ponga a hervir un sartén grande de agua con sal, agregue la sal marina y cocine el linguine durante 7-8 minutos, o según las instrucciones del paquete, hasta que esté al dente.", "Mientras tanto, para la salsa, caliente el aceite de oliva en una sartén grande y profunda y agregue el ajo, la cebolleta y el chile. Freír suavemente durante 1-2 minutos, o hasta que se ablanden pero no se coloreen. Agregue la carne de cangrejo y cocine por otro minuto, o hasta que se caliente.", "Agregue el vino a la sartén y cocine hasta que la mayor parte del alcohol se haya evaporado.", "Escurra el linguini, reservando algunas cucharadas de agua de pasta. Agregar a la sartén con la carne de cangrejo y agregar el perejil y la albahaca. Mezcle para cubrir uniformemente, agregando un chorrito de agua de pasta reservada si la mezcla está demasiado seca. Sazone al gusto con sal y pimienta negra recién molida y sirva."], "url": "www_bbc_co_uk_food_recipes_crab_linguine_22025", "title": "Linguine de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_linguine_22025_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas grandes de pan de masa fermentada", "2 cucharadas de aceite de oliva", "350g / 12oz de queso Lincolnshire Poacher, rallado (alternativamente, use un buen queso cheddar)", "50ml / 2fl oz de cerveza", "1 cucharadita de mostaza inglesa", "3-4 guiones Tabasco", "1 cucharadita de salsa Worcestershire", "Carne de cangrejo blanca 150 g / 5½ oz", "50g / 1¾oz de carne de cangrejo marrón", "2 cucharadas de harina normal", "1 yema de huevo de gallinas camperas", "1 cucharada de cebollines finamente picados", "1 cabeza de lechuga Little Gem, hojas separadas y lavadas", "50g / 1¾oz de hojas de ensalada de sangre de toro", "1 yema de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza Dijon", "100ml / 3½fl oz de aceite vegetal", "1 chalote, finamente picado"], "method": ["Precalentar la parrilla a alto.", "Calentar una sartén de plancha. Rocíe la masa fermentada en rodajas con aceite de oliva y coloque sobre la plancha caliente. Cocine a cada lado durante 2-3 minutos, o hasta que aparezcan las marcas de la barra.", "Coloque el queso y la cerveza en una sartén y caliente suavemente hasta que el queso se derrita, y la salsa burbujea y es suave. Agregue la salsa de mostaza, tabasco y Worcestershire. Agregue las carnes de cangrejo blancas y marrones, la harina y la yema de huevo. Cocine hasta que espese, luego sazone, al gusto, con sal y pimienta negra. Termina con las cebolletas picadas. Extienda la mezcla en la masa fermentada a la parrilla y colóquela bajo una parrilla caliente durante 1-2 minutos o hasta que se dore y burbujee.", "Para la ensalada verde y el aderezo francés, ponga las hojas de ensalada en un tazón grande. En un tazón pequeño o jarra mezcle la yema de huevo, el vinagre y la mostaza. Poco a poco agregue el aceite en un flujo constante y suave, batiendo todo el tiempo hasta que se incorpore todo el aceite. Agregue los chalotes picados. Justo antes de servir verter el aderezo sobre las hojas y mezclar.", "Para servir, coloque la rarebit de cangrejo en una tabla de servir junto con la ensalada verde."], "url": "www_bbc_co_uk_food_recipes_crab_rarebit_on_grilled_01579", "title": "Cangrejo raro en masa fermentada a la parrilla con ensalada verde y aderezo francés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de leche entera", "55g / 2oz de mantequilla sin sal ablandada", "175g / 6oz de queso Lancashire, rallado", "2 yemas de huevo de gallinas camperas", "100 g / 3½ oz de carne de cangrejo blanca fresca", "2 cucharadas de perejil plano de hojas picadas", "1 cucharadita de aceite vegetal", "4 rebanadas de pan de masa fermentada", "75g / 2½oz de carne de cangrejo marrón fresca", "pizca de pimentón", "exprimir jugo de limón", "sal y pimienta negra recién molida", "150g / 5½oz de mantequilla sin sal", "25g / 1oz de avellanas blanqueadas, más o menos picadas", "exprimir jugo de limón", "1 cucharadita de mostaza Dijon", "2 cucharaditas de vinagre Chardonnay", "50g / 1¾oz de cohete salvaje"], "method": ["En una sartén, caliente la leche y 30 g / 1 oz de mantequilla hasta que la mantequilla se haya derretido. Agregue el queso y mezcle hasta que se derrita; no hiervas Agregue las yemas de huevo y mezcle bien. Agregue la carne de cangrejo blanco y el perejil y sazone. Mantener caliente", "Mientras tanto, caliente el aceite en una sartén plancha. Cocine la masa madre hasta que esté dorada y crujiente. Escurrir sobre papel de cocina. Caliente la parrilla a fuego medio.", "Precalentar la parrilla a caliente. Mezcle la carne de cangrejo marrón con la mantequilla restante de 25 g / 1 oz, el pimentón y el jugo de limón, luego sazone. Extienda la mezcla en la tostada y vierta sobre la mezcla de queso. Ase a la parrilla hasta que todo se haya derretido y coloreado, pero tenga cuidado de no quemarse.", "Para hacer la ensalada, en una olla de fondo grueso, derrita la mantequilla. Una vez que empiece a formar espuma, mire hasta que se cocine con un agradable color dorado. Agregue las avellanas, luego retírelas del fuego. Agregue el jugo de limón y la temporada. Dejar enfriar a la temperatura del cuerpo, pero no enfriar.", "Mezcle la mostaza y el vinagre en un tazón, luego agregue lentamente la mantequilla derretida y las avellanas para hacer una vinagreta. Viste el cohete en la vinagreta y sírvelo inmediatamente junto a la rarebit. ."], "url": "www_bbc_co_uk_food_recipes_crab_rarebit_spiced_crab_67113", "title": "Receta de cangrejo, ensalada de mantequilla de cangrejo, avellana y beurre noisette", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 lb 2 oz 00 harina de pasta", "3 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "pizca de sal", "60 g / 2¼ oz de manzana Granny Smith, cortada en cubitos", "60g / 2¼ oz de pepino, cortado en cubitos", "300g / 11oz de carne de cangrejo blanca", "1 limón, ralladura solamente", "20 g / ¾oz de cebollín, finamente picado", "6 cebollas de primavera, lavadas y dejadas enteras con solo la raíz cortada", "1 cucharada de aceite de oliva", "sal marina", "400ml / 14fl oz de jugo de manzana nublado", "100ml / 3½fl oz de aceite de colza", "1 cucharadita de semillas de nigella, tostadas", "jugo de limón, al gusto"], "method": ["Para hacer la pasta, junte todos los ingredientes en un procesador de alimentos y descanse durante una hora.", "Para hacer el relleno, rocíe la manzana y el pepino con sal y reserve durante media hora, luego exprima el exceso de líquido.", "En un tazón grande mezcle el cangrejo, la ralladura de limón, el cebollín, la manzana y el pepino. Sazone al gusto y reserve en la nevera.", "Para el aderezo, caliente el jugo de manzana en una sartén para reducirlo en volumen a un almíbar ligero. Agregue el aceite de colza, las semillas de nigella tostadas y el jugo de limón.", "Pase la pasta por la máquina de pasta hasta que quede lisa y perfectamente delgada.", "Corta la hoja de pasta en cuadrados de 40 x 15 cm. Esto debería darle suficiente espacio para llenar y cortar los ravioles.", "Con una cucharada, haga una pequeña pila de relleno de cangrejo en el medio de 20 de los cuadrados.", "Cepille el relleno con agua y coloque otro cuadrado de pasta en la parte superior para formar una tapa. Al trabajar desde un lado del cuadrado, selle cada parcela para asegurarse de que se haya eliminado todo el aire (de lo contrario, estallarán al cocinarse). Use un cortador de hojaldre redondo de 8½ cm / 3½ pulgadas para medir cada raviole y corte alrededor del cortador de hojaldre con un cuchillo. Verifique que los bordes estén sellados nuevamente. Deberías poder hacer 20 raviolis. Colóquelos en una hoja de película adhesiva enharinada colocada en una bandeja para hornear. Déjelos a un lado en el refrigerador hasta que estén listos para cocinar.", "Caliente una sartén seca y cepille las cebolletas en un poco de aceite y sazone con sal. Agregue a la sartén para colorear y vaporizar durante unos minutos hasta que esté ligeramente carbonizado.", "Para cocinar los ravioles, caliente una sartén de agua con sal hasta que hierva. Agregue los ravioles y hiérvalos por un par de minutos hasta que estén cocidos a su gusto y calientes. Una vez cocido, retirar del agua, rociar con aceite de oliva y sazonar con sal marina.", "Para servir, coloque los raviolis en el fondo de un tazón de pasta y coloque las cebolletas chamuscadas y cúbralas con la manzana y el aderezo de semillas de nigella."], "url": "www_bbc_co_uk_food_recipes_crab_ravioli_with_spring_67164", "title": "Ravioles de cangrejo con aderezo de cebolleta", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos, sin semillas, finamente picados", "2 dientes de ajo, finamente picados", "2cm / ½ en jengibre fresco de raíz, pelado y finamente picado", "2 cucharadas de menta finamente picada", "2 cucharadas de cilantro finamente picado", "1-2 cucharadas de salsa de pescado", "2 limas, solo jugo", "pizca de azúcar moreno", "500g / 1lb 2oz de carne de cangrejo blanca cocida", "250 g / 9 oz de carne de cangrejo marrón cocida", "1 lima, ralladura solamente", "1 cucharada de menta finamente picada", "1 cucharada de cilantro finamente picado", "½ repollo chino, en rodajas finas", "puñado de hojas de apio", "2 mangos maduros, piedras removidas, rebanadas finas", "4 hojas de lima Kaffir, finamente picadas, para servir", "100 g / 3½ oz de semillas de sésamo tostadas, para servir"], "method": ["Para el aderezo, mezcle los chiles, el ajo, el jengibre, la menta, el cilantro, la salsa de pescado, el jugo de lima y el azúcar moreno. Dejar de lado.", "Para la ensalada, mezcle la carne de cangrejo, la ralladura de limón, la menta, el cilantro y la mitad del aderezo en un tazón.", "En un recipiente aparte, mezcle el repollo, las hojas de apio y los mangos con el aderezo restante.", "Para servir, cubra la mezcla de repollo con la mezcla de carne de cangrejo y espolvoree sobre las hojas de lima kaffir y las semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_crab_lime_and_chilli_90734", "title": "Ensalada de cangrejo, mango, lima y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 huevos de codorniz", "250 g / 9 oz de carne de cangrejo blanco, recogido", "1 yema de huevo de gallinas camperas", "1 cucharada de estragón fresco, picado", "sal y pimienta negra recién molida", "50g / 1¾oz de harina natural, condimentada con sal y pimienta negra recién molida", "1 huevo de gallinas camperas batido con 50 ml / 2 fl oz de leche", "50g / 1¾oz de panko breadcrumbs", "aceite de girasol, para freír"], "method": ["Hervir los huevos de codorniz en una sartén de agua hirviendo con sal durante 2 minutos y medio, escurrirlos y pelarlos.", "En un tazón mezcle el cangrejo con la yema de huevo, estragón, sal y pimienta.", "Envuelva esta mezcla alrededor de los huevos de codorniz, cubriéndolos por completo.", "Prepare tres tazones: uno con harina de plan, otro con el huevo y la leche, y otro con pan rallado", "Sumerja los huevos de codorniz en primero la harina, luego el huevo se lava y finalmente en las migas de pan.", "Llene una bandeja de lados profundos hasta un tercio con aceite de girasol y caliente a 160 ° C / 325 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los huevos en el aceite y cocine durante unos tres minutos, o hasta que estén dorados, luego saque los huevos y escurra sobre un plato forrado con papel de cocina."], "url": "www_bbc_co_uk_food_recipes_crab_scotch_eggs_35126", "title": "Huevos escoceses de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6 huevos escoceses", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de tocino", "1 cucharada de aceite de oliva extra virgen", "2 dientes de ajo, aplastados", "10 tomates maduros en vides picados", "1 x 400g / 14oz de tomates picados en lata", "250ml / 9fl oz de caldo de pescado", "1 cebolla roja, dejada entera, pelada y cortada", "½ chile verde fresco, sin semillas y picado", "pellizcar el azafrán", "½ cucharadita de azúcar", "500g / 1lb 2oz de espagueti seco", "600g / 1lb 5oz de carne de cangrejo cocida mixta de color marrón y blanco", "puñado de perejil fresco picado", "3 cucharaditas de alcaparras, enjuagadas y picadas", "botón de mantequilla", "sal y pimienta negra recién molida"], "method": ["Freír la panceta en una olla grande con tapa a fuego medio durante 5 minutos. Reduzca el fuego y agregue el aceite de oliva y el ajo, y cocine suavemente durante 2 minutos. Agregue los tomates frescos, tomates enlatados y caldo de pescado y cocine a fuego lento durante 5 minutos. Agregue la cebolla entera, el chile, el azafrán y el azúcar y cocine a fuego lento durante 10 minutos con la tapa puesta.", "Ponga a hervir una olla grande de agua con sal y cocine los espaguetis según las instrucciones del paquete.", "Revuelva la carne de cangrejo en la salsa de tomate y cocine a fuego lento durante 2 minutos. Agregue el perejil y las alcaparras y cocine por otros 2 minutos. Retire toda la cebolla y deséchela.", "Escurrir los espaguetis y agregar a la salsa de tomate junto con un poco de mantequilla. Revuelva bien para cubrir los espaguetis con la salsa, transfiera a la fuente y sirva."], "url": "www_bbc_co_uk_food_recipes_crab_spaghetti_in_a_91406", "title": "Espagueti de cangrejo en salsa de tomate y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["un poco de harina común, para quitar el polvo", "Paquete de pasta brisa paquete 320g", "sal y pimienta negra recién molida", "3 huevos de gallinas camperas, más 2 yemas de huevo", "Crema doble de 425 ml / 15 fl oz", "pizca de nuez moscada recién rallada", "3 cangrejos vestidos o 450 g / 1 lb de carne de cangrejo blanco", "2 cucharadas de aceite de oliva", "2 racimos de cebollas de primavera, en rodajas finas", "40 g / 1½ oz de parmesano recién rallado", "2 aguacates maduros, solo carne, cortados en dados gruesos", "75ml / 3fl oz de aceite de oliva", "2 limas, solo jugo", "3 tomates, desollados, sin semillas y finamente cortados en cubitos", "2 dientes de ajo, finamente picados", "2 chalotes, picados", "1 chile rojo, sin grano y muy finamente picado", "2 cucharadas de cilantro fresco picado"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Empolva ligeramente una superficie de trabajo con harina. Extienda la masa al grosor de una moneda de una libra, para revestir una lata de tarta de 23cm / 9 pulgadas de diámetro, 4cm / 1½ pulgadas de profundidad. Pincha la base con un tenedor, pero no recortes la masa.", "Cubra la masa con papel de hornear, rellene con frijoles para hornear y hornee \"a ciegas\" durante 30 minutos, o hasta que comience a colorear.", "Retire con cuidado los frijoles para hornear y el papel. (Si hay grietas, use los restos de hojaldre o huevo batido para llenarlos). Vuelva a colocar la caja de repostería en el horno durante 5 minutos. Dejar enfriar en una bandeja para hornear. Recorta los pasteles.", "Para la crema pastelera, ponga los huevos, las yemas y la crema en un tazón y bata suavemente, agregando una pizca de nuez moscada, sal y pimienta. Tamizar la natilla en una jarra de vertido.", "Si usa cangrejos vestidos, separe la carne de cangrejo con los dedos y retire cualquier caparazón. Eche la carne blanca y reserve, luego extienda la carne oscura sobre la caja de los pasteles. Si utiliza solo carne blanca, extienda la mitad sobre la caja de pastelería.", "Calentar el aceite en una sartén y freír rápidamente las cebolletas hasta que se ablanden. Agrégalos al estuche de pastelería.", "Mezcle la carne de cangrejo blanco y el parmesano en la crema pastelera, sazone ligeramente, luego con cuidado vierta sobre las cebolletas.", "Hornee la tarta en el centro del horno durante 50 minutos, o hasta que el relleno esté recién preparado. Deje que se enfríe durante unos minutos antes de servir.", "Para el guacamole, en un recipiente mezclar bien todos los ingredientes y sazonar. Si lo hace por adelantado, cubra la superficie firmemente con una capa de película adhesiva, luego cubra el recipiente con otra capa de película adhesiva y déjela a un lado.", "Sirva rebanadas de la tarta con el guacamole en un tazón para servir."], "url": "www_bbc_co_uk_food_recipes_crab_tart_93038", "title": "Tarta de cangrejo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ lima, ralladura y jugo", "80g / 3oz de carne de cangrejo fría (carne blanca y marrón)", "2 kiwis maduros, pelados y cortados en pequeños cubos", "1 chalote, finamente picado", "10cm / 4in pieza de pepino, semillas eliminadas, cortadas en cubos pequeños", "sal", "4 rebanadas de pan", "1 cucharada de mantequilla suave sin sal"], "method": ["Agregue media cucharadita de ralladura de lima a un recipiente y luego cocine en escamas en la carne de cangrejo. Agregue el kiwi, el chalote y el pepino, luego exprima el jugo de la lima y revuelva para cubrir los ingredientes. Pruebe y sazone con sal.", "Tueste el pan y corte en triángulos. Unte con la mantequilla y coloque en un plato al lado de un tazón de cangrejo.", "Para un iniciador especialmente bonito, use un cortador de galleta de 8 cm / 3 in para cortar cuatro círculos de la tostada. Unta con la mantequilla, coloca el cortador de galletas encima y rellena con el tartar de cangrejo para crear montículos limpios."], "url": "www_bbc_co_uk_food_recipes_crab_tartare_with_kiwi_29535", "title": "Tartar de cangrejo con kiwi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz '00' harina de pasta, más extra para espolvorear", "4 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "250 g / 9 oz recogidos de carne de cangrejo blanca", "115g / 4oz escogido carne de cangrejo marrón", "1 limón, solo jugo", "½ cucharadita de pimentón", "1 cucharada de perejil de flatillo, finamente picado", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "perejil de flatleaf pequeño racimo, hojas recogidas", "50g / 2oz de mantequilla", "½ cebolla, finamente picada", "250g / 9oz de guisantes congelados", "500ml / 18fl oz de caldo de pollo", "1 manojo de zanahorias baby, recortadas", "1 manojo de puerros bebé, reducido a la mitad a la mitad", "2 cucharadas de ramitas de perifollo"], "method": ["Para la pasta, coloca la harina, tres de los huevos y el aceite de oliva en un procesador de alimentos y pulsa hasta que forme migas pequeñas. Retire la mezcla del procesador y júntelos para formar una masa.", "Amasar la masa ligeramente en una superficie enharinada durante 2-3 minutos hasta que esté suave y elástica. Envuelva la película adherida y colóquela en la nevera durante 20 minutos.", "Harina la máquina de pasta. Comenzando por la configuración más baja (más gruesa), pase la masa por la máquina, gire la manija con una mano y sostenga la masa al pasar por la máquina con la otra.", "Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. Ayuda a cortar la pasta en trozos más pequeños ya que esto significa que es menos probable que la pasta se seque. Cualquier pasta en la que no esté trabajando debe estar cubierto con película adhesiva.", "Para hacer los tortellini, coloque las dos carnes de cangrejo en un tazón con un poco de jugo, el pimentón y el perejil y mezcle para combinar. Sazone al gusto con sal y pimienta negra recién molida y ajuste el jugo de limón en consecuencia.", "Batir el huevo restante para hacer un lavado de huevos. Coloque una hoja de pasta sobre la superficie de trabajo y elimine discos de 6 cm / 2½ pulgadas de diámetro. Coloque una cucharada de la mezcla de cangrejo en cada disco y cepille los bordes de la pasta ligeramente con la colada de huevo.", "Dobla la mitad de la pasta sobre el relleno y luego presiona ligeramente para sellar. Elija la media luna de pasta y tuerza los bordes, formando un pequeño labio en el borde exterior de la pasta. Repita con la pasta restante y el relleno, luego coloque el tortellini a un lado, cubierto con una película adhesiva, hasta que esté listo para cocinar.", "Para el caldo, ponga a hervir un sartén con agua con sal, pula el perejil durante 30 segundos y luego revuelva en agua helada. Escurrir, exprimir y luego cortar y reservar.", "Caliente una sartén hasta que esté caliente, agregue la mantequilla y la cebolla y cocine suavemente durante unos minutos hasta que se suavice. Agregue los guisantes y el caldo, lleve a ebullición y luego agregue el perejil blanqueado picado.", "Agregue la mezcla por lotes en un procesador de alimentos y mezcle para hacer un caldo fino; primero pruebe con una pequeña cantidad para ver cuánto sale por los lados al mezclar, tenga cuidado de no llenar demasiado ya que el caldo está caliente y puede salir fácilmente de la parte superior. Cuele en una olla limpia, luego vuelva a hervir a fuego lento y revise el condimento.", "Poner a hervir una olla de agua, agregar las zanahorias, hervir durante un minuto, luego agregar los puerros y cocinar por otros dos minutos hasta que estén tiernos. Escurrir y sazonar con un poco de aceite de oliva.", "Para cocinar los tortellini, ponga a hervir un sartén grande de agua con sal, agregue los tortellini y cocínelos durante 1-2 minutos o hasta que floten en la superficie, luego retírelos con una espumadera y escurra. Mezcle con un poco de aceite de oliva, sal y pimienta negra recién molida.", "Para servir, vierta el perejil y el caldo de guisantes en un plato sopero. Coloque unos tortellini encima y esparza las zanahorias y los puerros. Adorne con las ramitas de perifollo."], "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_05319", "title": "Tortellini de cangrejo con caldo de perejil y guisantes", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas", "Harina normal de 250g / 9oz", "1 cucharadita de sal", "75g / 2½oz de mantequilla sin sal", "Chalotes de 75 g / 2½ oz", "Jengibre fresco de la raíz 25g / 1oz, rallado", "75g / 2½oz de carne de cangrejo marrón", "Canales de cangrejo de 250g / 9oz (disponibles en pescaderías)", "250ml / 9fl oz de caldo de pescado", "300g / 11oz de mantequilla sin sal", "½ cucharadita de sal", "pizca de pimienta blanca molida", "1 cucharadita de jugo de limón", "10 g de cebollín fresco", "100ml / 3½fl oz de aceite de oliva", "Vieiras de 40 g / 1½ oz", "1 yema de huevo de gallinas camperas", "Crema doble 25ml / 1fl oz", "40g / 1½oz de carne de cangrejo marrón", "125g / 4½oz de carne de cangrejo blanca", "pimienta de cayena", "jugo de limón, al gusto", "25g / 1oz de mantequilla", "25ml / 1fl oz de aceite de oliva", "1 puerro, cortado en tiras de juliana", "2 zanahorias, cortadas en tiras de juliana", "1 calabacín, cortado en tiras de juliana"], "method": ["Para la pasta, coloque el huevo, la yema de huevo, la harina y la sal en un procesador de alimentos. Encienda el procesador y agregue lentamente dos cucharadas de agua hasta que estén bien combinados. Retire la masa del procesador de alimentos, amasar brevemente hasta que quede suave, luego envuelva la película adhesiva y deje enfriar en la nevera durante 30 minutos.", "Para la salsa de cangrejo, caliente una olla a fuego medio hasta que esté medio caliente. Agregue la mantequilla, los chalotes y el jengibre y fría por cinco minutos.", "Agregue la carne de cangrejo marrón y los restos de cangrejo y fríalos durante cinco minutos.", "Verter en el caldo de pescado y llevar a ebullición, luego cocine a fuego lento durante 20 minutos. Pase la mezcla a través de un colador fino en una olla limpia.", "Para terminar la salsa, agregue la mantequilla, la sal, la pimienta negra recién molida y el jugo de limón. Batir hasta que esté bien combinado.", "Para el aceite de cebollino, caliente el aceite a 80 ° C / 180 ° F y agregue las cebolletas. Infundir durante unos minutos y luego mezclar en un procesador de alimentos hasta que quede suave. Pase la mezcla a través de un tamiz fino y reserve", "Para el relleno de tortellini de cangrejo, coloque las vieiras, la yema de huevo, la crema y la carne de cangrejo marrón en un procesador de alimentos y mezcle hasta que quede suave y como una mousse.", "Agregue la carne de cangrejo blanca. Sazone con sal, pimienta y una pizca de pimienta de cayena. Agregue unas gotas de jugo de limón.", "Separe la mousse de cangrejo en cuatro porciones iguales.", "Para hacer los tortellini, enrolle la pasta con una máquina de pasta o un rodillo. Con un cortador de pasteles, corte la masa en círculos de 10 cm.", "Coloque una cucharada de mezcla de cangrejo en un círculo de pasta, doble la parte superior para formar un semicírculo, presione ligeramente hacia abajo para sellar y luego ajuste los bordes del semicírculo alrededor de su dedo índice y júntelos.", "Ponga a hervir una cacerola de agua con sal, agregue la pasta y cocine a fuego lento durante 4-5 minutos. Desagüe.", "Para las verduras de primavera, caliente una sartén grande y una vez caliente agregue la mantequilla y el aceite. Agregue las verduras y cocine por un par de minutos, o hasta que las verduras estén ligeramente marchitas.", "Para servir, coloque las verduras en el centro de cada uno de los cuatro platos y sirva el tortellini junto con la salsa de cangrejo y un chorrito de aceite de cebollino para cada plato."], "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_53501", "title": "Tortellini de cangrejo con verduras de primavera, salsa de cangrejo y aceite de cebollino", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de harina italiana '00', más extra para quitar el polvo", "1 huevo de gallinas camperas", "6 yemas de huevo de gallinas camperas", "50 g / 1¾oz de harina de sémola fina", "250 g / 9 oz recogidos de carne de cangrejo blanca", "115g / 4oz escogido carne de cangrejo marrón", "1 limón, solo jugo", "1 yema de huevo de gallinas camperas, golpeada", "200g / 7oz de mejillones frescos", "200 g / 7 oz de almejas frescas", "150ml / 5fl oz de vino blanco", "1 cucharada de tallos de cilantro", "75g / 2½oz de mantequilla sin sal", "1 chalote de plátano, finamente picado", "3cm / 1 en jengibre fresco, pelado y finamente picado", "2 palitos de limoncillo fresco, magullado y finamente picado", "150ml / 5fl oz de caldo de pescado", "150ml / 5fl oz de crema doble", "½ limón, solo jugo", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "50 g / 1¾oz de espinaca baby", "2 cucharadas de berro de coriandro", "200g / 7oz de harina italiana '00', más extra para quitar el polvo", "1 huevo de gallinas camperas", "6 yemas de huevo de gallinas camperas", "50 g / 1¾oz de harina de sémola fina", "250 g / 9 oz recogidos de carne de cangrejo blanca", "115g / 4oz escogido carne de cangrejo marrón", "1 limón, solo jugo", "1 yema de huevo de gallinas camperas, golpeada", "200g / 7oz de mejillones frescos", "200 g / 7 oz de almejas frescas", "150ml / 5fl oz de vino blanco", "1 cucharada de tallos de cilantro", "75g / 2½oz de mantequilla sin sal", "1 chalote de plátano, finamente picado", "3cm / 1 en jengibre fresco, pelado y finamente picado", "2 palitos de limoncillo fresco, magullado y finamente picado", "150ml / 5fl oz de caldo de pescado", "150ml / 5fl oz de crema doble", "½ limón, solo jugo", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "50 g / 1¾oz de espinaca baby", "2 cucharadas de berro de coriandro"], "method": ["Pulse la harina, el huevo, las yemas de huevo y la sémola en un procesador de alimentos hasta que estén bien combinados y la mezcla se una como masa. Coloque la masa en un recipiente, cúbrala con film transparente y descanse en la nevera durante 30 minutos.", "Corta la masa de pasta por la mitad. Alimente las piezas de a una a través de una máquina de pasta de acuerdo con las instrucciones de la máquina, terminando en la configuración más delgada.", "Mezcle ambas carnes de cangrejo en un recipiente con un poco de jugo de limón. Sazone al gusto con sal y pimienta.", "Coloque una hoja de pasta sobre una superficie de trabajo enharinada y aplaste los discos de 6-8 cm / 2½-3 pulgadas de ancho. Ponga una cucharada de la mezcla de cangrejo en cada disco y cepille los bordes de la pasta ligeramente con el huevo batido.", "Dobla la mitad de la pasta sobre el relleno y luego presiona ligeramente para sellar. Elija la media luna de pasta y tuerza los bordes, formando un pequeño labio en el borde exterior de la pasta. Repita con la pasta restante y el relleno, luego coloque el tortellini a un lado, cubierto con una película adhesiva, hasta que esté listo para cocinar.", "Para la salsa de limón y jengibre, limpie los mariscos y quite las barbas de los mejillones. Deseche cualquier que esté agrietado, y cualquier caparazón abierto que no se cierre cuando se le da un golpecito fuerte.", "Caliente una olla grande con tapa y agregue los mejillones, las almejas, el vino y los tallos de cilantro. Cocine con la tapa puesta durante 2-3 minutos o hasta que todas las conchas estén abiertas. Descarta cualquiera que no se abra.", "Cuela, guarda el licor, y retira la mitad de los mejillones y las almejas de las conchas y guarda la otra mitad en sus caparazones para su presentación.", "Caliente una sartén hasta que esté caliente y agregue la mantequilla, chalotes, jengibre y hierba de limón y fría durante 5 minutos.", "Vierta el licor de los mejillones y las almejas, agregue el caldo de pescado y llevar a ebullición, luego cocine a fuego lento durante 3-4 minutos. Pase la mezcla a través de un colador fino en una olla limpia.", "Para terminar la salsa, agregue la crema, sal, pimienta y jugo de limón. Batir hasta que esté bien combinado.", "Para la espinaca, caliente una sartén grande y agregue la mantequilla y cocine las espinacas durante 1-2 minutos o hasta que se marchiten.", "Para cocinar la pasta, caliente una olla grande de agua con sal. Una vez que hierva, agregue los tortellini y cocine durante 1-2 minutos o hasta que floten en la parte superior.", "Coloque la espinaca marchita en el centro del recipiente para servir y cubra con los tortellini. Coloque la salsa en la parte superior y adorne con mejillones, almejas y berro de coriandro."], "url": "www_bbc_co_uk_food_recipes_crab_tortellini_with_a_55783", "title": "Tortellini de cangrejo con salsa de limoncillo y jengibre y espinaca marchita", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de algas wakame secas", "½ pepino, pelado", "225 g / 8 oz de carne de cangrejo blanca fresca", "1 cucharada de copos de bonito", "½ cucharadita de gránulos dashi", "40ml / 1½fl oz de agua tibia", "Vinagre de vino de arroz 8ml", "½ cucharadita de azúcar blanco", "1 cucharadita de salsa de soja oscura", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "2 cucharaditas de wasabi en polvo", "300ml / 10 fl oz aceite de colza", "½ cucharadita de sal"], "method": ["Refresque las algas wakame en un recipiente con agua hirviendo durante cinco minutos, luego escurra bien y corte si es necesario.", "Cortar el pepino por la mitad a lo largo y sacar las semillas con una cucharadita. Cortar en rodajas finas.", "Para el aderezo wakame, en un recipiente disuelva los gránulos de dashi en agua tibia y mezcle con el resto de los ingredientes del aderezo. Agregue el alga wakame y el pepino y mezcle bien con el aderezo. Dejar de lado en la nevera para enfriar.", "Para hacer la mayonesa, mezcle las yemas de huevo, el vinagre de vino blanco y el polvo de wasabi en un tazón. Usando un batidor de alambre, bata gradualmente en el aceite unas gotas a la vez, hasta que lo haya incorporado todo y haya logrado una textura parecida a la mayonesa. Sazone al gusto con sal.", "Para servir, divida la carne de cangrejo por igual entre cuatro moldes pequeños y presione suavemente hacia abajo. (O sirva amontonado). Voltee la carne de cangrejo en cuatro platos y coloque una cucharada de mayonesa de wasabi al lado. Tome un puñado grande de algas marinas de pepino y wakame y colóquelas al lado de la carne de cangrejo, espolvoree los copos de bonito encima de las algas y sirva."], "url": "www_bbc_co_uk_food_recipes_crab_with_wakame_salad_12481", "title": "Cangrejo con ensalada wakame y mayonesa de wasabi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva virgen extra", "1 chalote, finamente cortado en cubitos", "1 cucharadita de hojas suaves de tomillo", "2 cucharaditas de esencia de anchoa", "150ml / ¼ pinta de vino blanco seco", "150ml / ¼ litro de caldo de pescado", "sal y pimienta negra recién molida", "450g / 1lb de espárragos, cortados y cortados en piezas de 2.5cm / 1in", "350g / 12oz de carne de cangrejo blanca", "675g1½ libra de fettuccine fresco", "55g / 2oz de mantequilla sin sal", "1 limón, solo jugo", "2 cucharadas de perejil picado"], "method": ["Caliente el aceite de oliva en una sartén de fondo grueso.", "Agregue la chalota y cocine suavemente hasta que esté suave, pero no marrón.", "Agregue el tomillo, la esencia de anchoa, el vino y el caldo de pescado y deje que hierva.", "Cocine hasta que el líquido se haya reducido a la mitad.", "Mientras tanto, trae una olla grande de agua con sal a ebullición.", "Agregue los espárragos y cocine durante seis minutos.", "Drene, retenga el agua y agregue el líquido chalote reducido con el cangrejo.", "Cocine el fettuccine en el agua de espárragos durante aproximadamente 3-4 minutos, dependiendo de la frescura.", "Escurrir y agregar a la salsa de cangrejo.", "Para finalizar, caliente la mantequilla en una sartén hasta que esté tuesta y dorada.", "Agregue el jugo de limón y el perejil y vierta sobre la pasta.", "Mezcle para combinar.", "Sazone al gusto con abundante pimienta negra."], "url": "www_bbc_co_uk_food_recipes_crabandasparagusfett_74709", "title": "Fettuccine de cangrejo y espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz '00' de harina (disponible en la mayoría de las secciones de horneado de los supermercados)", "1 huevo entero de gallinas camperas", "6 yemas de huevo de gallinas camperas", "50 g / 2 oz de harina de sémola fina", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "1 chile rojo, finamente cortado", "½ tallo de limoncillo, finamente picado", "3cm / 1¼ en jengibre fresco, finamente picado", "1 cucharadita de polvo de curry caliente", "200ml / 7fl oz de vino blanco", "Crema doble 250ml / 9fl oz", "350g / 12oz eligieron carne de cangrejo marrón y blanca", "1 lima, solo jugo", "3 cucharadas de cilantro fresco, finamente picado", "sal y pimienta negra recién molida"], "method": ["Para la pasta, coloque la harina '00', los huevos y las yemas de huevo en un procesador de alimentos y procese durante un minuto, o hasta que todo esté unido y sin grumos.", "Cubra y coloque en la nevera para descansar durante 30 minutos.", "Harina la máquina de pasta con harina de sémola y divida la pasta en dos partes iguales. Comenzando por el ajuste más bajo (más grueso), introduzca una pieza de la masa en la máquina, gire el mango con una mano y sostenga la masa con la otra a través de la máquina. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. La pasta debe ser bastante delgada, pero aún así fácil de manejar sin romperse. No tengas la tentación de saltear las configuraciones o la masa puede romperse. Repita con la otra pieza de masa.", "Una vez que las hojas de pasta han alcanzado el grosor ideal, recorte los bordes ligeramente. Adjunte el accesorio cortador de tallarines a la máquina de pasta, enharina bien con más harina de sémola.", "Pase las hojas de masa por la máquina una vez más, cortándolas en tallarines de 5 mm / 0.2 in. Polvo con la harina de sémola restante y coloque en la nevera durante la noche.", "Para la salsa de cangrejo, caliente una sartén hasta que esté caliente y agregue el aceite de oliva, chalotes, chile, hierba de limón, jengibre y polvo de curry. Freír por 2-3 minutos.", "Agregue el vino blanco y cocine a fuego lento. Cocine hasta que el vino se haya reducido a la mitad.", "Agregue la crema y cocine por un minuto más antes de agregar la carne de cangrejo. Revuelva para combinar y cocine a fuego lento durante un minuto.", "Sazone con sal y pimienta negra recién molida, al gusto, y agregue un poco de jugo de lima y cilantro, ahorrando un poco de limón para servir. Ponga a un lado, manteniendo la salsa caliente, mientras cocina la pasta.", "Para servir, ponga a hervir un sartén grande de agua salada, agregue los tallarines y cocine por 2-3 minutos hasta que estén tiernos.", "Escurra la pasta y coloque en la sartén con la salsa y revuelva para combinar. Sirva en tazones con un chorrito de lima."], "url": "www_bbc_co_uk_food_recipes_crabandchillitagliat_87860", "title": "Tagliatelle de cangrejo y chili", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos, 1 yema de huevo", "Carne de cangrejo de 400 g / 14 onzas, fresca o congelada", "300 ml / 10 fl oz crema", "1 cucharada de jugo de limón", "2 cucharadas de cilantro picado", "1 cucharadita de jengibre rallado", "¼ a ½ de chile rojo, sin semillas (puede necesitar agregar más) O ½ cucharadita de Tabasco al gusto", "50g / 2oz de parmesano rallado", "sal y pimienta negra recién molida", "1 x receta de masa salada", "Siga las instrucciones del paquete de repostería y alinee 27cmx3cm o una lata de 30cmx2cm y hornee a ciegas", "4 tomates maduros, picados", "1 cucharada de cebolla o cebolleta, picada", "1-2 dientes de ajo, aplastados", "½-1 chile, finamente picado", "1 cucharada colmada de cilantro picado", "½ lima, solo jugo", "sal y pimienta negra recién molida", "una pizca de azúcar"], "method": ["precaliente el horno a 180C / 356F / Gas 4.", "Batir los huevos y la yema, agregar el resto de los ingredientes, excepto el parmesano y el condimento.", "Agregue sal y pimienta al gusto y vierta en la masa horneada en la lata.", "Espolvoree con parmesano y hornee durante 40 minutos, hasta que se sienta firme al tacto en el centro.", "Para hacer la salsa de tomate, mezcle todos los ingredientes y sazone con sal, pimienta y una pizca de azúcar.", "Sirva con salsa de tomate gruesa en el lateral."], "url": "www_bbc_co_uk_food_recipes_crabandcoriandertart_74910", "title": "Tarta de cangrejo y cilantro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de mantequilla, sin sal", "2 puerros, en rodajas", "Papas de 400g / 14oz cortadas en cubos", "400ml / 14fl oz de caldo de verduras", "75ml / 2½fl oz de vino blanco", "2 pepinos, pelados, sin semillas, finamente picados", "½ limón, solo jugo", "Crema doble 50ml / 2fl oz", "1 cucharada de cebolletas frescas picadas", "250 g / 9 oz de carne de cangrejo blanco cocido", "1 rábano, en rodajas finas, para adornar"], "method": ["Derrita la mantequilla en una sartén hasta que haga espuma, luego agregue los puerros y fríe durante 4-5 minutos, o hasta que estén tiernos.", "Agregue las papas picadas, el caldo y el vino a la sartén y deje hervir. Reduzca el fuego a fuego lento y cocine durante 20-25 minutos, o hasta que las papas estén tiernas.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave. (Ajuste la consistencia de la sopa, si es necesario, agregando agua). Enfriar en la nevera durante al menos 30 minutos o hasta que esté completamente frío.", "Revuelva el pepino en la sopa, luego agregue el jugo de limón, al gusto. Con una cuchara, ponga la sopa en tazones o vasos y agite con la crema doble. Espolvorea sobre el cebollino picado y cubre cada porción con una cucharada de carne de cangrejo y unas rodajas de rábano."], "url": "www_bbc_co_uk_food_recipes_crabandcucumbervichy_91771", "title": "Cangrejo y pepino vichyssoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 bombillas de hinojo bebé", "200g / 7¼oz de carne de cangrejo marrón", "75g / 2½oz de mantequilla sin sal", "Tagliatelle fresco de 450 g / 1 libra", "4 gotas de aceite de trufa", "2 limones, solo jugo", "sal", "pimienta negra recién molida", "400g / 15oz de carne de cangrejo blanca"], "method": ["Pon a hervir una olla grande de agua con sal.", "Deseche las hojas exteriores duras de las bombillas de hinojo, reservando las tapas de plumas verdes para adornar. Cortar los bulbos en finas cuñas y reservar.", "Forzar la carne de cangrejo oscura a través de un colador y agregar a una cacerola con 3-4 cucharadas de agua.", "Agregue la mantequilla y coloque la mezcla en una sartén a fuego lento para derretir la mantequilla y calentarla. Si la salsa es demasiado fina, continúe cocinando hasta que se reduzca.", "Mientras tanto, ponga las rodajas de hinojo y la pasta en el agua hirviendo para cocinar.", "Agregue el aceite de trufa a la salsa de cangrejo y el jugo de limón al gusto. Condimentar con sal y pimienta.", "Escurra el hinojo y la pasta cuando esté al dente y vuelva a la sartén.", "Vierta la salsa de cangrejo y la carne de cangrejo blanca. Mezcle para cubrir.", "Sirva con una pizca de las tapas picadas de hinojo."], "url": "www_bbc_co_uk_food_recipes_crabandfenneltagliat_71812", "title": "Tallarines de cangrejo e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]