[{"isVegetarian": true, "title": "Gulab jamun and English summer fruits", "url": "www_bbc_co_uk_food_recipes_gulabjamunandenglish_86415", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "225g/8oz powdered milk", "110g/4oz plain flour", "1¼ tsp baking powder", "½ tsp bicarbonate of soda", "350ml/12fl oz double cream", "25g/1oz butter, melted", "75ml/3fl oz water", "200g/7oz caster sugar", "1 lemon, juice only", "150g/5oz strawberries, hulled", "150g/5oz raspberries", "4 tbsp icing sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the vegetable oil in a deep fat fryer to 170C/350F.", "Place the milk powder, flour, baking powder and bicarbonate of soda into a bowl and mix to combine.", "Add 100ml/3½fl oz the cream and mix well.", "Add the butter and as much extra cream as necessary to form a soft, slightly sticky dough.", "Roll the dough into small balls and carefully place into the deep fat fryer. Fry for 2-3 minutes until golden and completely cooked through. Carefully remove the cooked balls with a slotted spoon and drain on kitchen paper.", "For the syrup, place the water, sugar and lemon juice into a pan over a medium heat and bring to the boil. Reduce the heat and simmer for 1-2 minutes.", "Carefully place the jamun balls into the syrup and roll around to completely coat. Remove from the heat and leave to absorb the syrup for ten minutes.", "To serve, place the strawberries and raspberries into a bowl and sprinkle with the icing sugar, stirring gently to coat evenly.", "Place the strawberries and raspberries onto a large serving dish and top with the gulab jamun."]}, {"isVegetarian": true, "title": "Gunpowder Plot punch", "url": "www_bbc_co_uk_food_recipes_gunpowderplotpunch_14518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5 litres/2½ pints ginger ale/ginger beer ", "750ml/1¼ pints orange juice ", "1 large lemon, juice and zest ", "2 oranges, juice and zest ", "4 cinnamon sticks ", "¼ tsp grated nutmeg ", "12 cloves ", "5 star anise ", "2.5cm/1in fresh ginger, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan gently heat the ginger ale and orange juice. ", "Add all the other ingredients. Bring to the boil, remove from the heat and leave for a few minutes to allow the flavours to infuse. Serve."]}, {"isVegetarian": false, "title": "Gymkhana chicken pie", "url": "www_bbc_co_uk_food_recipes_gymkhanachickenpie_86568", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp coconut or vegetable oil", "2 cloves", "10 Tellicherry or ordinary black peppercorns", "2.5cm/1in cassia bark (available in Asian stores and some supermarkets)", "12 curry leaves", "1 tsp freshly grated root ginger", "1 medium onion, diced", "50g/2oz plain flour", "salt and freshly ground black pepper, to taste ", "500g/1lb 2oz chicken thighs, boneless and diced", "8-12 baby carrots, peeled, blanched and chopped ", "16-20 silverskin onions", "15 green beans chopped and blanched", "1 tsp ground turmeric ", "½ tsp ground coriander ", "2 tbsp seasoned flour", "400ml/14fl oz coconut milk", "110g/4oz ready made puff pastry sheet", "1 free-range egg, beaten, to brush the pastry", "1 tsp coriander seeds", "½ tsp cumin seeds", "1 tsp fennel seeds", "1 tsp black sesame seeds"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a large pan heat the oil before frying the cloves, peppercorns, cassia bark and curry leaves for about a minute. Add the ginger and onion and cook until the onion is translucent.", "Place the plain flour into a bowl with a little salt and freshly ground black pepper, to taste. Toss the chicken pieces in the flour until they are completly covered.", "Place the chicken pieces into the pan. Sauté the chicken briefly, browning it on all sides. Stir in the carrots, silverskin onions, beans and spices and cook for about one minute. Add the seasoned flour and cook for a further 2-3 minutes. Stir in the coconut milk and simmer for another five minutes before removing the pan from the heat.  Leave to cool.", "Spoon the filling into a pie dish until the filling almost reaches the top. In the centre of the dish place a pie funnel or egg cup. This will hold the pastry up as it cooks. ", "On a chopping board or clean surface, roll out the pastry so that it is slightly larger than the circumference of the pie dish. Use a little water or milk to wet the edges of the pastry and place it over the pie dish. Pinch the edges firmly to seal the pastry onto the dish.", "For the curst, use a mortar and pestle to crush the coriander, cumin, fennel and sesame seeds together.", "Brush the top of the pie with the beaten egg before sprinkling the spice crust over the top. Place the pie into the oven and cook for 10-15 minutes or until the pastry is golden-brown and crisp at the edges. Serve immediately."]}, {"isVegetarian": true, "title": "Gypsy tart", "url": "www_bbc_co_uk_food_recipes_gypsy_tart_81908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour", "2 tbsp icing sugar", "75g/2½oz unsalted butter, chilled, cut into roughly 1cm/½in cubes", "1 free-range egg yolk", "½ tsp lemon juice", "230ml/8fl oz condensed milk", "170ml/6fl oz evaporated milk", "175g/6oz light muscovado sugar"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, mix the flour and icing sugar together in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Mix the egg with the lemon juice and a tablespoon of water. Make a well in the centre of the flour mixture and pour in the egg mix. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball.", "Wrap in cling film and rest in the fridge for at least 15 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "Roll out the pastry on a lightly floured surface to about a 3mm thickness and use it to line the tart tin, leaving excess pastry hanging over the edge. Keep a little uncooked pastry back in case you need to patch any cracks later.", "Line the pastry case with baking parchment or foil, then fill with baking beans, or uncooked rice or lentils. Bake blind for 15 minutes, then remove the parchment and baking beans and return the pastry to the oven for approximately eight minutes, or until it looks dry and faintly coloured.", "Using a small, sharp knife, trim away the excess pastry from the edge of the tin. Use a tiny bit of the reserved raw pastry to patch any cracks or holes if necessary. Turn the oven down to 190C/375F/Gas 5.", "For the filling, put the both milks and the sugar in a large bowl or the bowl of a freestanding mixer. Beat together with an electric whisk, starting off slowly then increasing the speed, for around 10 minutes until the mixture is increased in volume, light and bubbly.", "Pour the mixture into the pastry case. Bake for about 30 minutes (check after 20 minutes), or until just set and still a bit wobbly in the centre. Remove from the oven and leave to cool in the tin before slicing and serving. "]}, {"isVegetarian": false, "title": "Haddock fish fingers, chips and tartare sauce", "url": "www_bbc_co_uk_food_recipes_haddock_goujons_chips_57280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "400g/14oz haddock fillet, skinned, pin bones removed, cut into strips", "110g/4oz plain flour", "200g/7oz fresh breadcrumbs", "3 free-range eggs, beaten", "600g/1lb 6oz chipping potatoes, peeled, cut into chips", "3 free-range egg yolks", "2 tbsp cider vinegar", "300ml/11fl oz rapeseed oil", "110g/4oz capers", "150g/5oz gherkins, chopped", "½ shallot, finely chopped", "1 small bunch fresh dill, chopped", "2 tbsp chopped fresh flatleaf parsley", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock goujons and chips, preheat a deep-fat fryer to 190C/375F. (CAUTION: Hot oil can be dangerous. Do not leave unattended).", "Sprinkle the flour and breadcrumbs onto separate plates and beat the eggs in a bowl. Dredge the haddock strips in the flour, then dip in the egg and coat in the breadcrumbs.", "Deep-fry for 3-4 minutes, or until golden-brown. (You may need to do this in batches.) Remove from the fryer with a slotted spoon and set aside to drain on kitchen paper.", "Add the potatoes to the deep-fat fryer and fry for 3-4 minutes, or until golden-brown and crisp. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with a little salt.", "For the tartare sauce, whisk the egg yolks and vinegar together in a bowl.", "Continue to whisk the mixture and slowly pour in the rapeseed oil until all of the oil is incorporated and mixture is thick and light.", "Stir in the capers, gherkins, shallot and herbs. Season, to taste, with salt and freshly ground black pepper and a squeeze of lemon juice. ", "To serve, pile the chips and goujons onto serving plates and spoon some tartare sauce alongside. "]}, {"isVegetarian": false, "title": "Haddock parcels and coconut rice", "url": "www_bbc_co_uk_food_recipes_haddock_parcels_and_76666", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/haddock_parcels_and_76666_16x9.jpg", "ingredients": ["4 haddock fillets, about 150g/5½ oz each", "4 tbsp chopped fresh coriander", "1 red chilli, chopped", "1 shallot, thinly sliced", "1 lime, sliced, plus extra lime halves to serve", "2 lemongrass stalks, 1 roughly chopped and 1 bashed", "300g/10½oz  basmati rice", "2 fresh or dried kaffir lime leaves", "50ml/2fl oz reduced-fat coconut milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Cut 4 pieces of nonstick baking paper, each 30cm/12in square. Put a haddock fillet in the centre of each piece and arrange some of the coriander, chilli, shallot, lime and chopped lemongrass stalk evenly over each. Wrap them up into neat parcels. Transfer the parcels to a baking sheet and bake for 20 minutes.", "Put the rice in a lidded pan, cover with water and bring to the boil. Simmer with the lid on for 10 minutes, or until the rice is soft. When the rice is cooked and the water absorbed, stir in the coconut milk. ", "Serve with the rice alongside the haddock parcels, with some extra lime halves."]}, {"isVegetarian": false, "title": "Haddock puff", "url": "www_bbc_co_uk_food_recipes_haddock_puff_63743", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz  fresh skinless boneless smoked haddock", "1 tbsp crème fraiche ", "pinch of ground black pepper", "handful watercress  ", "125g/4½oz  puff pastry"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 220C/425F/Gas 8. ", "Ask a grown-up to help you to use the scissors to cut up the haddock into bite-sized pieces, double checking for bones as you go. Put the fish into a mixing bowl and then add the crème fraiche.  Add a pinch of ground black pepper.", "Wash the watercress and dry it off on a tea towel. Tear the leaves off the stalks and put in the mixing bowl with the crème fraiche and fish. Stir and put the bowl to one side.", "Flour your work surface. Roll out the pastry on the floured surface into a rectangle, about 5mm thick and about 15mm x 21mm/6in x 8in (roughly the size of a sheet of A5 paper).", "With the pastry positioned with the short edge closest to you, place the fish mixture onto the bottom half of the rectangle, leaving a 1cm/½in border around the edges.  Brush the edges of the pastry with a little water - this will help them stick together. Bring the top half of the pastry down to cover the mixture like an envelope.  Fold and press the edges together firmly with your fingers.  Trim the edges with a table knife and make a small slit in the top to let the steam out.", "Ask a grown-up to put the parcel on a baking sheet with some baking paper and bake for 25–30 minutes or until golden-brown. Serve with carrot batons and cherry tomatoes."]}, {"isVegetarian": false, "title": "Haddock 'ceviche' with crab salad and ciabatta", "url": "www_bbc_co_uk_food_recipes_haddockcevichewithcr_92452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz undyed smoked haddock fillet, skin removed", "25ml/1fl oz lime juice", "25ml/1fl oz olive oil", "½ tsp pink peppercorns, crushed ", "2 tsp chopped fresh dill ", "200g/7oz cooked white crabmeat", "75g/3oz celeriac, peeled, finely chopped", "½ Granny Smith apple, skin on, core removed, finely chopped", "75g/3oz ready-made mayonnaise", "30g/1½oz crème fraîche ", "1 lemon, juice only", "1 tsp chopped fresh parsley ", "2 punnets micro greens ", "1 ciabatta, sliced into 3-5mm thick slices", "2 tbsp olive oil", "2 sprigs fresh thyme, leaves only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock 'ceviche', cut away the thin ends of the  smoked haddock fillet (reserve these pieces for another recipe) and slice the remaining thick fillet into thin (2-3mm thick) slices. Divide the slices equally among four serving plates and set aside. ", "Place the lime juice, olive oil, crushed pink peppercorns and dill into a bowl, mix well and set aside.", "For the crab salad, mix the celeriac, apple, half of the mayonnaise, the crème fraîche and lemon juice together in a bowl until well combined. Add the crabmeat, the chopped parsley and the remaining mayonnaise, mixing gently until just combined. ", "Place a 5cm/2in chefs' ring onto one of the serving plates, next to the haddock slices, and spoon in a quarter of the crab salad mixture. Remove the ring and repeat with the remaining mixture, placing a portion of crab salad onto each plate. Garnish each crab salad with the micro greens.", "For the ciabatta, preheat the oven to 210C/425F/Gas 7. ", "Place the ciabatta slices on a baking tray and drizzle with the olive oil. Season with salt and freshly ground black pepper and sprinkle over the thyme leaves. Bake in the oven for 4-5 minutes, or until golden-brown and crisp.", "Meanwhile, drizzle the lime juice mixture over the haddock a few minutes before serving. ", "To serve, arrange the toasted ciabatta slices next to the crab salad and haddock 'ceviche'."]}, {"isVegetarian": false, "title": "Haddock with Provençal sauce", "url": "www_bbc_co_uk_food_recipes_haddockwithprovencal_89234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 onion, finely sliced", "2 garlic cloves, crushed and chopped", "250ml/9fl oz passata", "200ml/7fl oz red wine", "100ml/3½fl oz fish stock", "100g/3½oz black olives, stones removed", "2 tbsp chopped fresh tarragon", "1 green pepper, very finely sliced ", "salt and freshly ground black pepper ", "4 x 150g/5oz haddock fillets", "3 tbsp flour, for dusting", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "sautéed potatoes", "4 tomatoes, deseeded, skinned and chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, melt the butter in a pan over a high heat. Add the onion and garlic and fry until softened. ", "Add the passata, wine and stock and bring to boil. Reduce the heat and simmer for 15-20 minutes.", "Add the olives, tarragon and green pepper and season, to taste, with salt and freshly ground black pepper.", "Preheat the oven to 180C/360F/Gas 4.", "For the haddock, dredge the haddock fillets in the flour and season with salt and freshly ground black pepper.", "Heat the oil in a frying pan over medium heat. Add the fish and fry for 1-2 minutes on both sides, until golden-brown all over.", "Transfer the haddock fillets to an ovenproof dish and pour over the sauce. Place into the oven to cook for 8-10 minutes, or until the haddock is cooked through.", "To serve, place a haddock fillet onto each of four plates and spoon the sauce over. Serve with sautéed potatoes and sprinkle with chopped fresh tomatoes."]}, {"isVegetarian": false, "title": "Haggis", "url": "www_bbc_co_uk_food_recipes_haggis_66072", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sheep's stomach or ox secum, cleaned and thoroughly, scalded, turned inside out and soaked overnight in cold salted water", "heart and lungs of one lamb", "450g/1lb beef or lamb trimmings, fat and lean", "2 onions, finely chopped", "225g/8oz oatmeal", "1 tbsp salt", "1 tsp ground black pepper", "1 tsp ground dried coriander", "1 tsp mace", "1 tsp nutmeg", "water, enough to cook the haggis", "stock from lungs and trimmings"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Wash the lungs, heart and liver (if using).  Place in large pan of cold water with the meat trimmings and bring to the boil.  Cook for about 2 hours.", "When cooked, strain off the stock and set the stock aside.", "Mince the lungs, heart and trimmings.", "Put the minced mixture in a bowl and add the finely chopped onions, oatmeal and seasoning.  Mix well and add enough stock to moisten the mixture.  It should have a soft crumbly consistency.", "Spoon the mixture into the sheep's stomach, so it's just over half full.  Sew up the stomach with strong thread and prick a couple of times so it doesn't explode while cooking.", "Put the haggis in a pan of boiling water (enough to cover it) and cook for 3  hours without a lid.  Keep adding more water to keep it covered.", "To serve, cut open the haggis and spoon out the filling.  Serve with neeps (mashed swede or turnip) and tatties (mashed potatoes)."]}, {"isVegetarian": false, "title": "Haggis kebabs with neeps and tatties cake", "url": "www_bbc_co_uk_food_recipes_haggis_kebabs_with_neeps_35842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz haggis", "300g/10½oz herby sausagemeat ", "2 tbsp heather honey", "2 tbsp Scotch whisky", "1 large swede, peeled and chopped into rough cubes", "2 large potatoes, Maris Piper or similar, peeled and chopped into rough cubes", "30g/1oz melted butter, plus extra for frying", "75g/2½oz plain flour", "sea salt and black pepper", "olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the barbecue for direct grilling or a grill to hot.", "Combine the haggis and sausagemeat together in a bowl. Divide into 12 equal pieces and roll into balls. Thread three balls onto each skewer, place on a plate or tray and refrigerate for 30 minutes, or until firm.", "To make the neeps and tatties, boil the swede and potatoes in a large pan of salted water for 20 minutes, or until tender. Drain and leave in the saucepan with the lid off to steam dry for 10–15 minutes. ", "Pass the swede and potatoes through a potato ricer or push through a coarse sieve into a large bowl. Stir in the butter until melted, then stir in the flour and a plenty of salt and pepper. ", "Set a cast iron pan over the barbecue to heat, or heat on the hob. Pat the potato mixture into a large round, or divide into quarters and pat into smaller rounds. Heat a splash of oil in the pan, add a knob of butter and heat until foaming. Fry the potato cake for 4–5 minutes on each side until golden-brown, then remove from the pan. If you make a larger cake, leave to rest for 2 minutes then cut into wedges.", "Meanwhile, grill the haggis kebabs for 8–10 minutes, turning regularly. Towards the end of cooking, mix the honey and whisky together in a small bowl and brush over the kebabs.", "Remove the kebabs from the heat, give them a final brush of the glaze, then serve with the potato cake wedges."]}, {"isVegetarian": false, "title": "Haggis, pickled neeps and tatties", "url": "www_bbc_co_uk_food_recipes_haggis_pickled_neeps_and_98546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ vegetable stock", "200ml/7fl oz white wine vinegar", "200g/7oz caster sugar", "1 bay leaf", "4 sprigs thyme", "6 peppercorns", "3-4 garlic cloves, sliced", "1 turnip, thinly sliced", "2 carrots, finely chopped", "1 onion, finely chopped", "75g/2½oz unsalted butter", "5 peppercorns", "1 bouquet garnis, including celery, thyme, bay and parsley ", "2 garlic cloves, chopped", "100ml/3½fl oz brandy", "200ml/7fl oz Madeira ", "200ml/7fl oz port", "500ml/18fl oz red wine", "400ml/14fl oz veal stock", "100ml/3½fl oz chicken stock", "½ pork belly skin ", "butter, for greasing", "1 whole haggis (cooked)", "1 large potato, sliced thinly on a mandoline", "4 tsp clarified butter", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the neeps, boil all the ingredients, except the turnip, in a pan. Remove from the heat, add the turnip and leave to infuse for 2-3 hours so it takes on the sweet and sour flavours of the pickling liquid.", "For the pork skin, preheat the oven to 180C/160C Fan/Gas 4.", "In a heavy bottomed pan, fry the carrots and onion gently in the butter for 4-5 minutes. Add the peppercorns, bouquet garni and garlic and fry for a further 1-2 minutes. Add the brandy, Madeira, port and red wine. Bring to the boil and cook until the volume of liquid has reduced by half. ", "Add the veal and chicken stocks and bring to the boil. Add the pork skin, cover the surface with a circle of baking paper and braise in the oven for 3-4 hours, adding more chicken stock if it starts to dry out. ", "Once cooked, carefully remove the pork skin and cut into 13x8cm/5x3in pieces. Reserve the cooking liquor. Butter a large piece of alumimium foil and place the skin pieces side-by-side in a line, making sure they overlap. Place the haggis on top, roll into a sausage shape (so the haggis is wrapped in pork skin) and wrap in the foil. Place in a steamer and cook for 15 minutes. ", "For the crispy potatoes, mix the potato slices with the clarified butter and salt in a non-stick frying pan. Fan out the slices to make 4 circles about 5cm/2in wide, cook on a gentle heat until crisp then set aside.", "Once steamed, slice the haggis into 5cm/2in portions and place on serving plates. Top with the pickled neeps and put the crispy potato alongside. Pour over some of the reserved pork cooking liquor and serve. "]}, {"isVegetarian": false, "title": "Haggis two ways", "url": "www_bbc_co_uk_food_recipes_haggis_two_ways_54636", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp unsalted butter, softened", "½ tsp cumin seeds", "5cm/2in piece fresh root ginger, peeled and finely chopped ", "1 small onion, finely chopped", "250-300g/9-10½oz haggis containing grouse, pheasant and duck (such as Macsween 3-bird haggis), skin removed, contents crushed", "500ml/18fl oz stock or water ", "100ml/3½fl oz single cream", "½ tbsp freshly chopped coriander (both leaves and stalks)", "salt and pepper", "1 tbsp oil or butter, for frying", "5cm/2in fresh root ginger, peeled and finely chopped", "2-3 garlic cloves, finely chopped", "2-3 green chillies (slender finger type), finely chopped", "1 medium onion, finely chopped", "250-300g/9-10½oz traditional haggis, skin removed and contents crushed", "1 tsp coriander seeds, toasted and crushed in a pestle and mortar until fine but not powdered", "1 tbsp freshly chopped coriander", "2 tbsp freshly chopped mint", "2-3 free-range eggs, beaten for egg wash", "200-250g/7-9oz dried white breadcrumbs (or semolina)", "100g/3½oz plain flour ", "5-6 tbsp tomato ketchup", "1-2 green chillies, chopped", "few shakes Tabasco, to taste", "1 tsp English mustard ", "400-500g/14oz-1lb 2oz floury potatoes, peeled and cut into thick slices ", "½ tsp cumin seeds, finely crushed", "1 fresh green chilli, finely chopped", "pinch dried mango powder (optional)", "2-4 whole free-range eggs (1 per person) ", "crusty rolls or toast", "salad leaves"], "serves": "Serves 2-4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the soup, melt the butter in a saucepan. When foaming, add the cumin seeds and after 30-40 seconds add the ginger and the onion. Gently fry for 1-2 minutes, or until the onion is soft and translucent. Add the haggis and fry for 3-4 minutes. Pour in the stock, bring to the boil and simmer for 5-6 minutes. Then remove from the heat.", "Purée the contents until very smooth using a blender (if using a jug blender be careful to avoid splashes from the hot liquid). Add the cream and continue to blend. Return the soup to the pan and bring to a simmer. If the soup is too thick for your liking, dilute it with a little extra stock or water. Season with salt and pepper.", "For the haggis and potato cakes, heat a tablespoon of oil or butter in a frying pan. When hot, add the ginger, garlic and green chillies. Gently fry until the garlic begins to colour slightly. Add the onion and gently fry until soft and translucent. Stir in the crushed haggis and gently fry for 3-4 minutes. Season with salt and pepper.", "Then add the coriander seeds, fresh coriander and fresh mint. Set aside to cool completely.", "For the tomato ketchup, blend all the ingredients together then taste and adjust the Tabasco to suit your palate. Place in a small bowl for serving. (If, preferred, you can also blend some mayonnaise into this for a creamier sauce).", "For the crushed potatoes, put the potatoes in enough boiling salted water to cover the potatoes by at least an inch of water. Boil until the slices are tender. Drain and return the potatoes to the pan. Dry them over a low heat, using a spatula to stir and make sure they don’t stick to the bottom. Remove from the heat and mash them (or pass through a ricer if you have one).", "Spread the potatoes on a tray and set aside to cool. When cooled, stir in the crushed cumin, chilli, salt and pepper. You can also add dried mango powder if you have any.", "To finish the haggis and potato cakes, put the egg wash in shallow bowl and the breadcrumbs and flour on separate plates. Divide the crushed potatoes into equal portions (ideally 6) and divide the haggis mixture similarly.", "Flatten each potato portion in the palm of your hand to roughly 1cm/½in thickness and place the haggis mixture in the centre of it. Fold over the potato to encase the haggis evenly and then flatten to form a thick cake roughly 2.5cm/1in thick. Shape it gently until you have no cracked edges and no filling leaking out. Sprinkling a little flour on the potato cakes to help you smooth the surface.", "Roll the potato cakes in just enough flour to coat, dust off any excess. Dip in the beaten egg to coat then cover with breadcrumbs. ", "Preheat the oven to 100C/80C Fan/Gas ¼. ", "Heat 1-2 inches of oil in a deep-sided frying pan or casserole. When hot, fry the potato cakes until golden-brown all over. Transfer them to a baking tray lined with kitchen paper (to absorb any excess oil) and place in the warm oven. Warm the serving plates in the oven as well.", "Fry the eggs in the same pan (you may need to remove some of the oil). Let the white crisp-up a bit, but ensure the yolk remains soft.", "To serve, reheat the soup, add the chopped coriander and put into bowls. Put a dollop of spiced ketchup on each potato cake. Top with a fried egg and serve with a hot crusty roll or toast, some salad leaves and the soup."]}, {"isVegetarian": false, "title": "Haggis, clapshot and whisky sauce", "url": "www_bbc_co_uk_food_recipes_haggisclapshotandwhi_92144", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/haggisclapshotandwhi_92144_16x9.jpg", "ingredients": ["500g/1lb 2oz haggis", "500g/1lb 2oz floury potatoes, such as Maris Piper or King Edward, peeled, chopped", "500g/1lb 2oz swede (yellow turnip), peeled, chopped", "50g/2oz butter", "75ml/2¾fl oz double cream", "sea salt and freshly ground white pepper", "1 tbsp chopped fresh chives", "500ml/17fl oz double cream", "2 tsp wholegrain mustard", "1 tbsp Dijon mustard", "2 tsp whisky", "sea salt and freshly ground white pepper", "1 tbsp chopped fresh chives", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Wrap the haggis tightly in aluminium foil and place onto a baking tray. Bake in the oven for 45 minutes to one hour, or until cooked through. ", "Meanwhile, for the clapshot, boil the potatoes and swede in separate saucepans of salted water for 15-18 minutes, or until tender. Drain well. Add the drained swede to the drained potatoes and mash thoroughly. Add the butter and cream and mash again until smooth and well combined. Season, to taste, with salt and freshly ground white pepper. Stir in the tablespoon of chives. Set aside and keep warm.", "For the whisky sauce, heat the double cream in a pan over a medium heat. Add the wholegrain mustard, Dijon mustard and whisky and stir to combine. Increase the heat until the mixture is simmering and continue to cook for 1-2 minutes. ", "Remove the pan from the heat and season, to taste, with salt and freshly ground white pepper. Stir in the tablespoon of chives, then whisk in the lemon juice.", "To serve, divide the clapshot equally among four serving plates. Place a spoonful of steamed haggis alongside each. Spoon over the warm whisky sauce."]}, {"isVegetarian": false, "title": "Haggis soup", "url": "www_bbc_co_uk_food_recipes_haggissoup_82603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "½ leek, diced", "½ potato, peeled and diced", "¼ swede, peeled and diced", "¾pint chicken stock", "salt and freshly ground black pepper", "85g-110g/3-4 oz haggis"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and sauté the leek, potato and swede for a few minutes, to soften. Season with salt and freshly ground black pepper.", "Pour in the chicken stock and bring to the boil. Reduce the heat, add the haggis and simmer for 10-12 minutes.", "Remove from the heat and spoon into a soup bowl to serve."]}, {"isVegetarian": false, "title": "Haggis and neeps", "url": "www_bbc_co_uk_food_recipes_haggistattiesandneep_82604", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ haggis, cooked", "½ swede, peeled and diced", "salt and freshly ground black pepper", "1 free-range egg, beaten", "½pint beef stock", "splash of red wine", "knob of butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the haggis in the microwave according to packet instructions.", "Bring a pan of water to the boil and cook the swede for 8-10 minutes, until softened. Drain and mash until soft. Pass through a sieve until smooth.  Season with salt and freshly ground black pepper.", "Slice the cooked haggis and arrange in a chefs' ring placed on a plate. Spoon the mash on top and season with salt and freshly ground black pepper. Brush the top with the beaten egg and glaze the top using a blow-torch. Remove the ring.", "To make the gravy, reduce the beef stock and red wine to thicken. Stir in the butter and season with salt and freshly ground black pepper. Simmer for a further few minutes to thicken further.", "Drizzle the gravy over the haggis to serve."]}, {"isVegetarian": false, "title": "Haitian roast chicken with two stuffings served with pumpkin rice", "url": "www_bbc_co_uk_food_recipes_haitianroastchickenw_91735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 1.6kg/3½lb whole chicken", "15g/½oz butter", "2 tsp cayenne pepper", "350ml/12fl oz chicken stock ", "4 tbsp rum", "50g/1¾oz butter", "½ onion, finely chopped", "2 spring onions, trimmed, chopped", "2 garlic cloves, finely chopped", "large pinch freshly grated nutmeg", "3 slices white bread, crusts removed, made into breadcrumbs", "4 sprigs fresh thyme, leaves only", "1 lime, zest and juice", "2 tbsp rum", "2 tsp soft light brown or demerara sugar", "15g/½oz butter", "2 very ripe plantains, peeled and sliced", "2 ripe plum tomatoes, cut into quarters", "salt and freshly ground black pepper ", "550ml/1 pint cold water", "400g/14oz pumpkin flesh, chopped", "3 sprigs fresh thyme", "1 tsp salt", "450g/1lb basmati rice, rinsed and drained twice to remove excess starch", "15g/½oz butter"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Gently ease the skin around the neck and breast of the chicken away from the meat using your fingers, reaching as far down the legs as possible. Set aside.", "For the bread stuffing, heat the butter in a frying pan over a medium heat. Add the onion and fry for 2-3 minutes, or until softened. ", "Add the spring onions and garlic and cook for a further 2-3 minutes, or until softened. ", "Add the nutmeg and breadcrumbs and continue to fry until the breadcrumbs are crisp and golden-brown. ", "Add the thyme leaves, lime zest and juice, rum and sugar and stir well until combined. When the ingredients have warmed through and the sugar has dissolved, remove the pan from the heat and set aside.", "When the bread stuffing mixture is cool enough to handle, push small handfuls of it under the loosened skin of the chicken, until all of the bread stuffing mixture has been used up. Tuck any loose neck skin into the cavity of the bird. Set aside.", "Preheat the oven to 190C/375F/Gas 5. ", "Meanwhile, for the tomato and plantain stuffing, melt the butter in a separate frying pan over a medium heat. Add the plantain and fry for 4-5 minutes, or until tender.", "Add the tomatoes and continue to fry for 4-5 minutes, or until the tomatoes start to break down and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. ", "Stuff the cavity of the chicken with the tomato and plantain stuffing. (Alternatively, cook the tomato and plantain stuffing in a small roasting tray for 25-30 minutes while the chicken is cooking.) ", "For the roast chicken, smear the butter over the skin of the stuffed chicken and sprinkle over the cayenne pepper. Season, to taste, with salt and freshly ground black pepper. ", "Place the chicken into a large roasting tin, then transfer to the oven and roast for 1½-1¾ hours, or until the juices run clear when a skewer is inserted into the chicken where the thigh meets the body.", "Meanwhile, for the pumpkin rice, bring the water, pumpkin, two sprigs of thyme and salt to the boil in a large, covered pan, then reduce the heat until the mixture is simmering and simmer for 8-10 minutes, or until the pumpkin is tender. ", "Remove and discard the thyme sprigs, then mash the pumpkin and cooking liquid together using a potato masher, until the pumpkin breaks down. (NB: The mixture does not have to be mashed until smooth.) ", "Add the rice to the pan with the pumpkin mixture in it and stir. The liquid should cover the rice by 2-2½cm/1-1¼in, so add more water as necessary.", "Add the butter and stir until melted, then cover the pan with the lid and return the mixture to the boil. When the mixture is boiling, immediately reduce the heat to a simmer. Cover and simmer on a low heat for 18-20 minutes, without removing the lid, until the bottom of the rice has browned slightly and all of the rice is tender. ", "When the rice is cooked, add the remaining sprig of thyme, then turn off the heat and leave the pan on the residual heat for a further 3-4 minutes. ", "When the chicken has cooked through, transfer it to a warm plate and cover with aluminium foil. ", "For the gravy, add the chicken stock to the juices that collected in the roasting tray and bring to the boil, scraping up any browned bits up from the bottom of the tray using a wooden spoon. Simmer the gravy until it has thickened, then sieve, reserving the liquid. ", "Heat the rum in a frying pan over a high heat, then remove from the heat and set alight using a match. Allow the flames to flare up, then die down. (NB: keep flammable objects away from the flame.) Pour the rum over the roast chicken.", "To serve, carve the roast chicken and divide it among six serving plates. Place a portion of the tomato and plantain stuffing on top of each serving. Spoon the pumpkin rice alongside. Drizzle over the gravy."]}, {"isVegetarian": false, "title": "Hake a la romana, sautéed lentils and jamón iberico, lemon and olive oil mayonnaise", "url": "www_bbc_co_uk_food_recipes_hake_a_la_romana_sauted_04453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra-virgin olive oil", "1 shallot, finely chopped", "1 carrot, finely chopped", "1 bay leaf", "150g/5½oz dried small green lentils", "500ml/18fl oz chicken stock, cold", "sea salt and freshly ground black pepper", "40g/1½oz baby spinach", "50g/1¾oz jamón iberico, cut into1cm/½in cubes", "1 large free-range egg yolk, at room temperature", "1 tbsp lemon juice", "½ tsp Dijon mustard", "sea salt flakes", "75ml/2½fl oz extra virgin olive oil", "75ml/2½fl oz sunflower oil", "2 tbsp chopped parsley", "olive oil, for frying", "4 x 170g/6oz hake portions", "100g/3½oz plain flour, for coating ", "2 large free-range eggs, beaten", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sautéed lentils, heat the oil in a saucepan and fry the shallot, carrot and bay leaf until they begin to turn golden-brown. Add the lentils and the cold chicken stock, give everything a good stir, and leave to cook for 20-25 minutes, or until the stock has reduced in volume. Remove the bay leaf and season with salt and pepper. Keep warm.", "For the mayonnaise, put the egg yolk, lemon juice, mustard and sea salt into a mixing bowl and lightly blend together. Gradually whisk in the oils, a little at a time, until you have produced a thick and silky smooth mayonnaise. Mix in the parsley.", "For the fish, pour 1cm/½in of olive oil into a large non-stick frying pan, placed over a medium heat, or you can also use a deep-fat fryer heated to 170C/340F (Caution: hot oil can be dangerous. Do not leave unattended).", "Coat the pieces of hake in flour, knock off the excess and then coat well in the beaten egg. Place into the hot oil and fry for about four minutes on each site, depending on the thickness of the fish, until golden-brown. Lift onto kitchen paper, and leave to drain.", "Finally, add the spinach to the lentils and allow it to wilt for a minute or so.", "To serve, divide the lentils among the serving plates. Place the hake on top. Add a tablespoon of lemon mayonnaise on top of the fish, and finally some of the jamón pieces."]}, {"isVegetarian": false, "title": "Hake with pommes mousseline and a shrimp, lemon and caper sauce", "url": "www_bbc_co_uk_food_recipes_hake_with_pommes_91976", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 beef tomato", "125g/4½oz potted shrimp ", "1 shallot, diced", "1 tbsp finely chopped fresh chives", "1 tbsp finely chopped  fresh flatleaf parsley", "50g/1¾oz capers, preferably lilliput", "1 lemon, zested and thinly sliced", "chervil cress, to garnish ", "4–5 large new potatoes, preferably Cyprus or Jersey Royals, washed, peeled and diced", "50ml/2fl oz double cream", "50g/1¾oz unsalted butter", "pinch freshly grated nutmeg", "salt and ground white pepper ", "2 tbsp vegetable oil", "4 x 150–200g/5½oz–7oz hake loin fillets ", "flaked sea salt ", "Espelette pepper", "50g/1¾oz unsalted butter", "200g/7oz baby leaf spinach, washed", "100g/3½oz wild garlic leaves", "garlic flower heads, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut a small cross into the bottom of the tomato with a small, sharp knife and blanch in a pan of boiling water for about ten seconds, then drain and plunge into ice-cold water. Peel the tomato and discard the skin.", "Cut the peeled tomato into quarters and remove the seeds. Pat the tomato pieces dry with a clean tea towel and cut into small dice. Set aside.", "Heat a frying pan over a medium heat and add the potted shrimps, shallots and tomato. Cook for 5–7 minutes until the butter has melted into a sauce. Stir in the herbs and capers and keep warm. ", "For the potatoes, bring a pan of water to the boil and cook the potatoes for 6–8 minutes, or until tender,", "Drain the potatoes and return them to the pan to air-dry for a couple of minutes. Gradually add the cream and butter and mix with a hand-held blender until smooth. Grate in the nutmeg and season. Cover with greaseproof paper and keep warm. ", "For the hake, preheat the grill to medium-high. Heat the vegetable oil in a pan until smoking point, season the skin side of the hake with sea salt and the flesh side with salt and the Espelette pepper. Cook skin-side down in the pan for 1–2 minutes. Place the pan under the grill for 2–3 minutes or until the fish is slightly translucent. ", "Add a knob of butter to the pan, turn over the fish fillets and baste with the melted butter. ", "Heat the remaining butter in a pan set over a high heat. Add the spinach and wild garlic leaves and cook for 1 minute.", "Serve the hake with the pommes mousseline, wilted greens and the shrimp sauce spooned over the top. Garnish with lemon zest, slices and chervil cress and wild garlic flowers, if using."]}, {"isVegetarian": false, "title": "Hake with chanterelles and a Swiss chard stew", "url": "www_bbc_co_uk_food_recipes_hake_with_chanterelles_25340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 shallots, finely chopped ", "2 garlic cloves, crushed", "few small sage leaves ", "300g/10½oz chanterelle mushrooms, cleaned", "100ml/3½fl oz fresh fish stock", "4 x 175g/6oz hake fillets", "sea salt and freshly ground black pepper ", "2 tbsp olive oil", "1 large onion, finely chopped ", "2 garlic cloves, finely sliced ", "2 red peppers, deseeded and finely sliced ", "1 tsp pimentón (Spanish paprika)", "500g/1lb 2oz floury potatoes, sliced", "750g/1lb 10oz Swiss chard, stalks roughly chopped and leaves shredded ", "750ml/26fl oz pint fresh vegetable stock", "sea salt and freshly ground black pepper ", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Swiss chard stew, heat a little oil in a flame-proof casserole and gently fry the onion for 10 minutes until softened. Add the garlic and fry for a minute, then add the peppers and pimentón and fry for a few more minutes.", "Stir in the potatoes and stock. Season generously with salt and pepper then bring to a simmer. Cover and cook for 20 minutes ", "Meanwhile, for the hake, heat a little olive oil in a large pan and gently fry the shallots for 5–10 minutes until really soft. Add the garlic and sage and cook for 30 seconds, then increase the heat and add the mushrooms. Fry for 4–5 minutes, then add the stock and simmer for a couple of minutes. Season with salt and pepper and set aside.", "Heat a little oil in a heavy-based frying pan over a medium heat. Add the hake, skin-side down and cook for 4–5 minutes, or until almost cooked through. Turn and cook for 30 seconds on the other side. Place the cooked hake skin-side up into the pan containing the mushrooms. Cook for a minute or two more.", "Add the chard to the stew for the last few minutes, then serve with the hake and lots of crusty bread to mop up the juices."]}, {"isVegetarian": false, "title": "Hake and clams in a green sauce (merluza en salsa verde)", "url": "www_bbc_co_uk_food_recipes_hake_with_salsa_verde_15301", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 (or 4 large) white asparagus spears, trimmed and blanched for 5-8 minutes", "200g/7oz fresh clams, scrubbed under cold running water and debearded", "3 tbsp olive oil", "3 garlic cloves, finely chopped", "1 small shallot, finely chopped", "1 tbsp plain flour", "200ml/7fl oz dry white wine (ideally Txakoli)", "150ml/5fl oz fresh fish stock", "4 x 180g hake fillets", "200g/7oz peas", "1 small handful flatleaf parsley, finely chopped ", "crusty bread, to serve", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of salted water to the boil and cook the prepared asparagus for a further 4-6 minutes. Drain and set aside.", "Discard any clams with broken shells and any that refuse to close when tapped.", "Heat the oil in a frying pan over a medium heat. Fry the garlic and shallot for 3–4 minutes, or until soft and lightly golden-brown. Stir in the flour and cook for about 2 minutes. Slowly add the wine and cook for 2 minutes, then add the stock. Simmer until you have a silky-smooth sauce.", "Season the hake with salt and pepper and add them to the sauce. Cook the hake for 4–5 minutes, then add the peas and clams. Cover and cook for 2–3 minutes, or until the clams open. Discard any clams that do not open. ", "To finish, add the asparagus and parsley, and simmer for a minute. Season to taste with salt and pepper. Serve in warmed bowls with crusty bread."]}, {"isVegetarian": false, "title": "Hake wrapped in pancetta with curried potatoes", "url": "www_bbc_co_uk_food_recipes_hakewrappedinpancett_76448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5¼oz new potatoes, cooked", "4 spring onions, chopped", "pinch curry powder", "pinch turmeric", "squeeze lemon juice", "150ml/5fl oz double cream", "handful fresh parsley leaves, chopped", "pinch cumin seeds", "1 hake fillet", "4 slices pancetta", "oil, for frying", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the curried potatoes, heat the oil in a sauté or large frying pan. Fry the potatoes and spring onions for a few minutes, to soften.", "Stir in the curry powder and turmeric to coat. Add the lemon juice to the pan and then pour in the cream. ", "Add the parsley and cumin seeds and simmer gently for 8-10 minutes, until thickened.", "For the fish, wrap the pancetta slices around the hake fillet. Heat the oil in a non-stick-frying pan and cook the fish for 2-3 minutes on each side, or until the pancetta is golden brown.", "To serve, transfer the wrapped fish to a serving plate and serve the curried potatoes alongside."]}, {"isVegetarian": true, "title": "Half-time ices", "url": "www_bbc_co_uk_food_recipes_half-time_ices_15023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium orange", "3-4 fresh strawberries, hulled, chopped"], "serves": "Serves 1", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Slice the top off the orange about one-third of the way down, using a sharp knife, and reserve. Suspend the orange parts over a mixing bowl and scoop out as much flesh as possible, allowing the juices to run into the bowl. Reserve the juice and the orange skin.", "Place the chopped strawberries into the orange skin. Pour over the reserved orange juice, adding a little cold water to top up as necessary.", "Place the top part of the orange back onto the bottom part. Carefully transfer the orange to a freezeable, lidded container (propping it up as necessary with scrunched up aluminium foil). Freeze for at least two hours, or until the filling has frozen.", "To serve, remove the top of the orange from the orange and eat the contents with a teaspoon."]}, {"isVegetarian": false, "title": "Halibut with crab and lime croquettes", "url": "www_bbc_co_uk_food_recipes_halibut_with_crab_and_27912", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["rock salt, to cover base of a baking tray", "3 large Maris Piper potatoes", "100g/3½oz picked crab, white and brown meat", "2 lime, zest only", "100g/3½oz plain flour", "ready-made breadcrumbs", "2 free-range eggs, beaten", "vegetable oil, for deep fat frying", "6 carrots", "200g/7oz chestnut mushrooms, chopped into quarters", "knob of butter", "300g/10½oz baby spinach", "1 litre/1¾ pint fresh fish stock", "250g/9oz butter", "50ml/2fl oz vermouth", "salt and freshly ground black pepper", "dash vegetable oil", "6 pieces of halibut, skin on"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cover the base of a baking tray with rock salt, put the potatoes on top and bake for one hour. ", "Once cooked, allow to cool slightly before splitting the skins and scraping out the soft potato.", "For the vegetables, chop the carrots into large rounds, place in a pan of cold salted water, bring to the boil and boil for 10 minutes. The carrots should be al dente (with a slight bite). Drain well and refresh in a bowl of ice cold water. Drain again once cool. ", "To finish the crab and lime croquettes, mix the crab, lime and potatoes. Season and shape into barrel shapes using your hands, place on a plate and put in the fridge to chill and firm up. ", "Place the flour and breadcrumbs on separate shallow plates, and prepare a bowl of beaten egg for the egg wash. Once chilled, dip each croquette into the prepared flour, beaten egg then breadcrumbs until completely coated and set aside.", "To make the sauce, heat the fish stock in a pan, and gradually whisk in the butter until thick and glossy. Add the vermouth and season with salt and freshly ground black pepper. ", "For the vegetables, gently fry the mushrooms in a little butter and salt and pepper for around five minutes, or until cooked. ", "Stir the baby spinach in with the mushrooms so it just begins to wilt.", "For the fish, heat a dash of vegetable oil and fry the fish in a hot pan, skin-side down. Place in the oven to cook for 5-6 minutes, or until the fish is just cooked. ", "Heat some butter in a pan and fry the semi-cooked carrots so that they start to soften around the edges.", "Take the fish out of the oven, cover with foil and allow to rest for five minutes. ", "Heat the oil in a deep fat fryer or heavy-based saucepan to 190C/375F. Carefully deep fry the croquettes for around five minutes, or until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Remove the croquettes from the fryer or pan using a slotted spoon and place on a plate lined with kitchen paper.", "To serve, place the spinach and mushrooms on each of six plates and the fish on top. ", "Place the carrots around the fish and top with a croquette. Serve with the sauce on the side."]}, {"isVegetarian": false, "title": "Halibut with sautéed mushrooms and potato wrapped deep-fried quail’s eggs", "url": "www_bbc_co_uk_food_recipes_halibut_with_sauted_32388", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz chicken stock", "125g/4½oz unsalted butter", "400g/14oz wild mushrooms (preferably a mix of morels, ceps and black trumpets)", "100ml/3½fl oz double cream", "150g/5oz purple sprouting broccoli, cut into small florets", "1½ bunches baby heritage carrots, in a mix of colours", "salt and freshly ground black pepper", "4 tbsp olive oil", "4 fillets halibut, skin on and pin-boned, seasoned with salt and pepper", "100g/3½oz unsalted butter", "8 sprigs fresh chervil, to garnish", "vegetable oil, for deep frying", "1 large potato, peeled ", "1 egg yolk", "12 quail’s eggs, soft boiled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the chicken stock in a saucepan set over a medium-high heat. Cook until the volume of liquid has reduced by a third. ", "For the halibut, heat a large frying pan and add the oil. When hot, add the fish skin-side down and cook for 2-3 minutes. Turn the fish over and cook for a further 2-3 minutes. ", "Meanwhile, for the mushrooms, heat a large frying pan and add 50g/1¾oz of the butter. When the butter is foaming, add the mushrooms and cook for 2 minutes. Stir in the cream and reduced stock, then season with salt and pepper.", "Heat a large saucepan of boiling water and blanch the broccoli and carrots. When tender, drain and refresh the vegetables in ice-cold water.", "Heat a large frying pan and add the remaining butter, once hot add the broccoli and carrots and cook for 1-2 minutes.", "Preheat a deep-fat fryer to 180C. Alternatively, heat the vegetable oil in a deep-sided, heavy bottomed pan until a breadcrumb turns golden-brown when added to the pan. (CAUTION: Hot oil is dangerous. Do not leave unattended).", "For the halibut, add the butter to the pan and baste the fish. Set aside to rest before serving.", "For the quail eggs, put the potato onto the spiraliser and turn to create long strands of potato. Place in a bowl with the egg yolk and mix to coat the potato. Wrap the spiralised potato around the quail’s eggs. Place in the deep fryer for 1-2 minutes and drain on kitchen paper.", "Place the fish in the centre of serving plates and arrange the vegetables, mushrooms and quail eggs around the fish. Garnish with a few sprigs of chervil and serve. "]}]