[{"ingredients": ["4 tomates cherry", "4 hojas de albahaca", "pizca de pimentón", "1 cebolla de primavera", "1 cucharadita de aceite de oliva", "¼ de pimiento verde fresco", "1 cucharada de dulce de maíz", "125 g / 4½ oz (¼ bloque) de hojaldre con mantequilla"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Precaliente el horno a 220C / 425F / Gas 7. Cubra una bandeja para hornear con papel de hornear y cepíllela generosamente con aceite vegetal.", "Agregue los tomates a un recipiente para mezclar y luego córtelos en trozos con las tijeras.", "Arranca las hojas de albahaca y agrégalas al cuenco. Agrega una pizca de pimentón.", "Corta las raíces y la parte superior verde oscura de la cebolla de primavera con las tijeras y tíralas. A continuación, corta la cebolla tierna en trozos pequeños y agrégala a los tomates junto con el aceite de oliva.", "Abra el pimiento colocando los pulgares sobre el tallo y presionando hacia dentro, y desgarre alrededor de una cuarta parte en pedazos del tamaño de un bocado y agréguele esto a los otros ingredientes. A continuación, agregue el maíz dulce en conserva.", "Estirar la masa en una superficie ligeramente enharinada.", "Recorte la masa en un rectángulo uniforme con el cuchillo. Luego, use la punta del cuchillo para dibujar un borde alrededor del rectángulo, como un marco, sin cortar completamente la masa.", "Coloque la masa en la bandeja para hornear forrada de papel; debe hacer esto ahora, ya que es mucho más difícil de mover una vez que está encendida.", "Apila tu relleno vegetal en la parte central de tu base de repostería y extiéndelo hasta los bordes del borde. Hornee durante 15-20 minutos hasta que la masa esté dorada y se haya levantado. Sirve tu tarta con bastones de zanahoria."], "url": "www_bbc_co_uk_food_recipes_treasure_chest_tart_67063", "title": "Tarta del cofre del tesoro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina integral fuerte", "100 g / 3½ oz de harina de centeno", "150g / 5½oz de harina blanca fuerte", "2 g de levadura instantánea", "10g de sal", "340ml / 11¾fl oz de agua", "aceite, para engrasar", "1 ramita de romero fresco, finamente picado", "3 dientes de ajo, aplastados", "1 limón, ralladura solamente", "1 cucharada de aceite de oliva", "4 filetes de pierna de cordero sin hueso", "2 cucharadas de granos de pimienta rosa, aplastados", "sal al gusto", "3 cucharadas de crema", "½ limón, solo jugo", "1 cucharadita colmada de mostaza inglesa", "150g / 5½oz de berro", "175 g / 6 oz de judías verdes, recortadas y blanqueadas", "8 cebolletas, cortadas y cortadas", "12 rábanos, lavados y partidos por la mitad"], "method": ["Mezcle las harinas, la levadura y la sal en un tazón. Agregue 255ml / 9fl oz de agua y, con sus manos, mezcle para formar una masa. Agregue un poco del agua restante y continúe añadiéndola hasta que toda la harina se haya incorporado y los bordes del recipiente estén limpios (puede que no lo necesite todo).", "Amase durante 5-10 minutos, incline la masa en un recipiente limpio y engrasado, cubra con un paño de cocina y deje en un lugar tibio hasta que al menos duplique su tamaño. Esto tomará alrededor de tres horas.", "Una vez que la masa ha subido, incline sobre una superficie de trabajo engrasada. Con las manos, empuje la masa en una forma rectangular que sea bastante plana, como una base de pizza. Con las puntas de los dedos, empuje la superficie de la masa para hacer hoyuelos. Cubra una bandeja para hornear con papel pergamino y transfiera la masa a la bandeja. Pincha el área media de la masa con una docker o tenedor, dejando un borde sin tocar alrededor del exterior.", "Deja en un lugar cálido para probar durante una hora.", "Precalentar el horno a 220 ° C / 425 ° F / Gas 7. Hornear la masa durante aproximadamente 30 minutos, o hasta que esté dorada y cocida.", "Para el cordero, en un tazón grande mezcle el romero, el ajo, la ralladura de limón y el aceite. Agregue el cordero y cubra cada filete en el adobo. Dejar en la nevera por un mínimo de 30 minutos, pero hasta la noche.", "Para el aderezo, en un recipiente mezclar los ingredientes del aderezo y sazonar al gusto.", "Coloque una sartén a fuego alto. Retire el cordero del adobo y espolvoree sobre los granos de pimienta triturados. Sazonar con un poco de sal. Freír el cordero en la sartén caliente durante 2-3 minutos por cada lado, o hasta que esté cocido a su gusto. Retire y deje descansar.", "Para servir, tome una tabla o placa de servir grande. Coloque la zanjadora en el centro. Esparce berros, frijoles, cebolletas y rábanos en la parte superior.", "Corta el cordero de forma inclinada y coloca los pedazos encima de la ensalada. Finalmente cubra con un poco del aderezo de mostaza y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_trencher_with_pink_07402", "title": "Zanjadora con pimienta rosada y cordero al ajo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "2 huevos de gallinas camperas, separados", "Harina normal 150g / 5oz", "sal y pimienta negra recién molida", "250ml / 9fl oz de cerveza británica", "1 filete de rape, sin membrana, cortado en cuatro tiras", "Filete de bacalao a 250 g / 9 oz, sin piel, cortado en cuatro tiras", "Filete de fletán 250g / 9oz, piel eliminada, cortada en cuatro tiras", "25g / 1oz de mantequilla", "2 chalotes grandes, finamente picados", "450 g / 1 libra de guisantes congelados, descongelados", "Crema doble 125ml / 4½fl oz", "4 cucharadas de hojas de menta fresca picadas", "sal y pimienta negra recién molida", "½ limón, solo jugo", "10g / ½ oz de hojas frescas de perejil de flatleaf", "75ml / 3fl oz de aceite de oliva virgen extra", "puñado de brotes de guisantes, para servir"], "method": ["Para los dedos de pescado, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se ponga dorado cuando se le caiga, o precaliente una freidora a 190 ° C / 375 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las yemas de huevo, la harina, la sal y la pimienta negra recién molida en un tazón y mezcle.", "Vierte la cerveza y bate para hacer una mezcla suave.", "Coloque las claras de huevo en un recipiente aparte y bata hasta que se formen picos rígidos cuando se quite el batidor.", "Batir la mitad de las claras de huevo batidas en la masa, luego doble suavemente en la mitad restante.", "Sumerja cada trozo de pescado en la mezcla para cubrir completamente, sacudiendo cualquier exceso.", "Con cuidado, coloque el pescado en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén dorados y cocidos. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Una vez que todo el pescado esté cocido, vierta varias piezas a la vez en el aceite durante 30-45 segundos; esto ayuda a que estén realmente crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Mientras tanto, para el puré de guisantes, caliente la mantequilla en una sartén y fría los chalotes por 1-2 minutos.", "Agregue los guisantes y caliente suavemente, luego agregue la crema y las hojas de menta y cocine por un minuto más.", "Transfiera la mezcla a un procesador de alimentos y mezcle con un puré. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar un chorrito de jugo de limón.", "Para el aceite de perejil, coloque el perejil y el aceite de oliva en un pequeño procesador de alimentos y mezcle con un puré. Vierta la mezcla en un colador forrado con muselina o un paño de cocina limpio y déjelo gotear en un tazón.", "Para servir, espolvoree el puré de guisantes sobre cuatro platos para servir y cubra con algunos brotes de guisantes. Coloque tres dedos de pescado en cada plato y rocíe sobre el aceite de perejil."], "url": "www_bbc_co_uk_food_recipes_trioofbeerbatteredfi_87862", "title": "Trío de dedos de pescado rebozados con cerveza con puré de guisantes y aceite de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de azúcar en polvo", "5 yemas de huevo de gallinas camperas", "250ml / 10½ fl oz de leche", "250ml / 10½ fl oz doble crema", "40 g / 1½ oz de chocolate negro, finamente picado", "½ limón, cáscara y jugo solamente", "1 manojo pequeño de hojas de menta, recogido y picado", "¼ cucharadita de esencia de menta, más algunas gotas extra", "4 cucharadas de azúcar demerara", "250g / 10½oz de hojaldre listo para usar", "2 cucharaditas de azúcar en polvo", "½ cucharadita de nuez moscada recién rallada", "4 ramitas de menta fresca", "4 giros de cáscara de limón", "4 casquetes de chocolate negro"], "method": ["Precalentar el horno a 140C / 285F / Gas 1", "Para la crème brûlées, ligeramente mantequilla 12 moldes muy pequeños.", "Coloque el azúcar y las yemas de huevo en un recipiente y mezcle.", "Coloque la leche y la crema en una sartén a fuego lento y deje que hierva.", "Poco a poco vierta la leche caliente y la mezcla de crema en los huevos, batiendo constantemente para combinar.", "Coloque el chocolate en un tazón limpio. Vierte un tercio de la crema en el chocolate y bate bien hasta que todo el chocolate se haya derretido.", "Cuele la crema de chocolate en cuatro de los moldes.", "Vierte la mitad de la crema restante en un tazón limpio. Agregue la ralladura de limón y el jugo, revuelva para combinar, luego vierta en cuatro de los moldes limpios.", "Agregue la esencia de menta y menta a la crema restante y deje en infusión durante cinco minutos. Coloque una batidora en la crema infusión de menta y mezcle para combinar.", "Pase a través de un tamiz y vierta en los cuatro moldes limpios restantes.", "Coloque los moldes en una bandeja de asar. Vierta agua en la bandeja de asar para que se llene hasta la mitad con agua, luego transfiera al horno para hornear durante 30 minutos, o hasta que las natillas estén recién preparadas.", "Retire la crème brûlées del horno y la lata de asar. Dejar enfriar, luego colocar en la nevera para enfriar.", "Para las palmier, precaliente el horno a 200C / 400F / Gas 6.", "Sobre una superficie plana y limpia, enrolle la masa de hojaldre a ½ cm / ¼ de grosor.", "Espolvorea con tres cuartas partes del azúcar impalpable y tres cuartas partes de la nuez moscada rallada.", "Comenzando en un extremo de la masa, enrolle la masa hacia el centro de la masa.", "Voltea la masa y gira el otro lado hacia el centro para dejar dos rollos iguales de masa pastelera en el centro.", "Cortar la masa enrollada en rebanadas de 1cm / ½ de espesor. Coloque cada rebanada plana en una superficie de trabajo y aplanar ligeramente con un rodillo.", "Coloque las piezas de repostería en una bandeja para hornear y el polvo con el resto del azúcar y la nuez moscada.", "Transfiera al horno y hornee durante 12-15 minutos, hasta que estén dorados y crujientes. Retirar del horno y dejar enfriar.", "Para servir, cuando la crème brûlées esté fría y completamente preparada, deslice suavemente un cuchillo por el borde de cada una de las natillas y gírelas en un plato grande.", "Coloque un tercio del azúcar demerara en un recipiente limpio con un poco de esencia de menta. Espolvoree encima de la crema de menta brûlées.", "Cubra los brûlées de limón y chocolate con el azúcar demerara restante.", "Usando un mini soplete, caliente la cubierta de azúcar de cada crema catalana, hasta que el azúcar se derrita y caramelice.", "Cuando el caramelo se haya enfriado, decore cada menta crème brûlée con una ramita de menta; adornar la crema de limón brûlées con un toque de piel de limón; y adornar la crema de chocolate brûlées con algunos fragmentos de chocolate.", "Agregue varias palmeras al plato y sirva."], "url": "www_bbc_co_uk_food_recipes_trioofcremebruleeswi_86159", "title": "Trío de nata quemada con palmeras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 x bastidores de cordero (mejor final), francés recortado (pregunte a su carnicero para hacer esto)", "3 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "50g / 2oz de almendras en copos", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "¼ cucharadita de pimienta de cayena", "½ cucharadita de canela molida", "1 pera, pelada, sin corazón y picada", "2 dientes de ajo, aplastados", "Albaricoques secos de 150g / 6oz, descuartizados", "75g / 3oz sultanas", "75g / 3oz de arándanos endulzados secos", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "manojo de perejil fresco, picado", "1 cucharada de tomillo fresco picado", "sal marina y pimienta negra recién molida", "2 cucharaditas de harina común", "150ml / 5fl oz de vino tinto", "150ml / 5fl oz de caldo de cordero o agua", "2 cucharaditas de jalea de grosella", "1 cucharada de hojas de menta fresca picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, caliente el aceite en una sartén grande de base pesada. Agregue la cebolla y fríasela suavemente durante cinco minutos, revolviendo ocasionalmente hasta que se ablande. Agregue las almendras y cocine por 1-2 minutos hasta que estén ligeramente tostadas.", "Espolvoree las especias sobre la cebolla y las almendras y cocine por un minuto. Esparce las piezas de pera en la sartén y agrega el ajo, los albaricoques, la pasas sultanas, los arándanos, la naranja y la ralladura de limón. Agitar juntos a fuego medio durante 1-2 minutos. Agregue todas las hierbas y sazone con sal y pimienta negra recién molida. Cocine por un minuto más, retírelo del fuego y déjelo enfriar.", "Sazonar los estantes de cordero con sal y pimienta negra recién molida.", "Coloque las costillas en una lata de asar grande y resistente con el ojo de la carne en la parte inferior. Usando seis largas piezas de cuerda de cocina, ate las costillas en tres puntos.", "Coloque el relleno en el centro de las costillas y cubra la superficie con papel de aluminio. Cubra los extremos de todos los huesos con papel de aluminio para evitar que se queme.", "Tueste la corona por 45 minutos para el rosado y 15 minutos adicionales si prefiere el medio de cordero. Retire la lámina de aluminio cinco minutos antes del final del tiempo de cocción.", "Retire la lata de hornear del horno y transfiera cuidadosamente el cordero y el relleno a un plato de servir. Cubra con papel de aluminio y paños de cocina. Reserve de 10 a 15 minutos.", "Reserve 1 a 2 cucharaditas de grasa en el molde para asar, pero deseche el resto. Caliente la lata y quite los restos de carne con una espátula y deséchela.", "Espolvoree la harina en la lata y cocine durante unos segundos. Vierta lentamente el vino tinto y deje burbujear durante 20 segundos, revolviendo vigorosamente con una cuchara de madera. Agregue el agua, agregue la menta y vuelva a hervir a fuego lento. Cocine por 2-3 minutos, o hasta que espese un poco. Colar un tamiz en una jarra resistente al calor.", "Lleve el cordero a la mesa y corte los huesos para servir. Dependiendo del tamaño de sus bastidores, 2-3 chuletas deben hacer una porción cuando estén acompañadas del relleno afrutado. Cuchara sobre un poco de la salsa y servir."], "url": "www_bbc_co_uk_food_recipes_triple-crown_roast_of_08690", "title": "Asado de cordero de tres copas con relleno de frutas adornado con joyas y salsa de vino tinto moteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/triple-crown_roast_of_08690_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["275 g / 10 oz% 20plain% 20chocolate% 20 (70%% 20cocoa% 20solids)", "275g / 10oz de mantequilla sin sal", "85g / 3oz de pacanas, rotas en pedazos", "85g / 3oz de chocolate con leche, cortado en trozos grandes", "85g / 3oz de chocolate blanco, cortado en trozos grandes", "Harina normal 175g / 6oz", "1 cucharadita de polvo de hornear", "4 huevos grandes, ligeramente golpeados", "1 cucharadita de esencia de vainilla", "Azúcar en polvo 325g / 12oz"], "method": ["Precalentar el horno a 170 C / 325 F / Gas3. Cubra una lata de 30x20x3.5cm / 12x8x1½in con papel o papel de aluminio ligeramente engrasado.", "Coloque el chocolate y la mantequilla en un tazón grande, colóquelos sobre una fuente de agua hirviendo y déjelos derretir.", "Tamiza la harina y el polvo de hornear en un recipiente y reserva. Retire el chocolate derretido del fuego y agregue el azúcar. Agregue los huevos y la esencia de vainilla. Doble la harina, las nueces y el chocolate.", "Vierta la mezcla de chocolate en la lata de torta preparada. Coloque en el horno y hornee durante 20-25 minutos. La parte superior debe ser firme, pero el interior debe sentirse suave cuando se cocina. Dejar enfriar en la lata. Retire los brownies de la lata y corte en cuadrados."], "url": "www_bbc_co_uk_food_recipes_triplechocolatebrown_7685", "title": "Brownies de triple chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 20-24 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/triplechocolatebrown_7685_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango muy maduro, picado", "1 cucharada de jugo de limón", "4 frutas de la pasión, cortadas a la mitad", "1 huevo grande de gallinas camperas", "1 yema de huevo grande de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "60 g / 2¼ oz de mantequilla sin sal, ablandada y cortada en cubos", "Crema doble 50ml / 2fl oz", "130g / 4½oz de coco desecado", "60g / 2¼ oz de azúcar en polvo", "180ml / 6fl oz de leche entera", "½ cucharadita de sal marina en copos", "25 g / 1oz de mantequilla sin sal", "1½ cucharadita de pasta de vainilla", "8 gotas de sabor a coco (opcional)", "2 cucharadas de aceite de coco extra virgen", "Harina normal 180g / 6oz", "aceite de girasol, para freír"], "method": ["Para la salsa de inmersión, mezcle el mango y el jugo de limón con un puré usando un procesador de alimentos.", "Coloque un tazón grande y resistente al calor sobre una fuente de agua hirviendo a fuego lento. Raspe las semillas y la pulpa de las frutas de la pasión y empuje a través de un colador en el tazón. Descarta las semillas. Agregue el puré de mango, huevo, yema de huevo y azúcar al bol. Revuelva con frecuencia hasta que la mezcla sea lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Retire del fuego y agregue la mantequilla de una pieza a la vez. Dejar de lado para enfriar.", "Una vez frío, batir ligeramente la crema doble en un recipiente aparte. Doble suavemente en la mezcla de maracuyá y mango. Dejar de lado", "Para los churros, en un plato poco profundo, mezcle 30 g / 1 oz de coco desecado y 50 g / 1¾ oz de azúcar en polvo. Dejar de lado.", "Coloque el resto de coco desecado de 100 g / 3½ oz en un molinillo de especias y mezcle hasta obtener un polvo fino. Transfiera a una sartén y tueste ligeramente.", "En una olla grande, combine 300 ml / 10 fl oz de agua con el azúcar restante, la leche, la sal, la mantequilla, la pasta de vainilla, el sabor del coco, si se usa, y el aceite de coco. Llevar a ebullición.", "En un recipiente aparte, mezcle la harina y el coco tostado. Agregue esto a la mezcla de azúcar hirviendo y mezcle bien con una cuchara de madera hasta que la masa se una en una bola y se separe de los lados de la sartén. Deje que la masa se enfríe un poco, luego transfiera la mezcla a una manga larga con una boquilla de estrella grande.", "Alinee dos bandejas grandes para hornear con papel antigrasa. Ponga 18 churros en forma de lágrima, luego cúbralos y déjelos enfriar por 10 minutos.", "Caliente el aceite de girasol en una freidora de grasa o en una sartén grande de base pesada hasta que alcance los 190 ° C en un termómetro de cocción. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado, baje los churros enfriados en aceite caliente y fríalos por 2-3 minutos, o hasta que estén dorados, volteándolos una vez durante la fritura. No sobrecargue la bandeja o el aceite se enfriará demasiado y los churros no se cocinarán correctamente. (PRECAUCIÓN: no permita que el aceite se caliente demasiado, ya que podría explotar el churro. Protéjase de las salpicaduras de aceite caliente y mantenga la cara alejada de la bandeja).", "Retire los churros del aceite con una espumadera y escurra sobre un plato forrado con papel de cocina. Cubra los churros en la mezcla de coco y azúcar. Sirve inmediatamente con la salsa."], "url": "www_bbc_co_uk_food_recipes_tropical_churros_98806", "title": "Tropical churros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 18-20 churros", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tropical_churros_98806_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 8¾oz de harina común", "250g / 8¾oz de azúcar en polvo", "1 cucharadita de canela molida", "1 cucharadita de bicarbonato de soda", "3 huevos de gallinas camperas, golpeados", "200ml / 7fl oz de aceite de girasol, más extra para engrasar", "50g / 1¾oz nueces de pacana, más o menos picadas", "50g / 1¾oz de nueces, aproximadamente picadas", "2 plátanos, puré", "1 mango grande, pelado, ahumado, con puré de carne", "2 maracuyá, solo pulpa", "85g / 3oz de piña enlatada, puré", "1 naranja, solo ralladura", "200g / 7oz de queso blando con toda su grasa", "50 g / 1¾oz de mantequilla sin sal, ablandada", "1 naranja, solo ralladura", "400g / 14oz de azúcar glasé"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee tres moldes para pasteles de 20 cm / 8 in.", "Tamiza la harina, el azúcar impalpable, la canela molida y el bicarbonato de soda en un bol.", "Agregue los huevos, el aceite de girasol, las nueces, la fruta y la ralladura de naranja hasta que estén bien combinados.", "Divida la masa de la torta entre las tres latas de pastel y hornee en el horno durante 30-35 minutos, o hasta que se haya levantado y dorado.", "Retire del horno y deje enfriar por 10 minutos. Pase un cuchillo de hoja redonda alrededor del borde interior de las latas para aflojar los pasteles. Retire las tortas de sus latas y transfiéralas a una rejilla para que se enfríen completamente.", "Mientras tanto, para el glaseado de queso crema, mezcle el queso y la mantequilla con un batidor eléctrico hasta que quede espeso y cremoso. Agregue la ralladura de naranja y tamice el azúcar glas. Revuelva suavemente hasta que esté bien combinado, luego enfríe en el refrigerador hasta que lo necesite.", "Una vez que los pasteles estén fríos, unte el glaseado de queso crema encima de cada pastel. Apila los pasteles para hacer un pastel de tres niveles."], "url": "www_bbc_co_uk_food_recipes_tropical_fruit_cake_01471", "title": "Pastel Ruiseñor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tropical_fruit_cake_01471_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 220 g / 8oz, más extra para espolvorear", "30g / 1oz de azúcar glasé", "90 g / 3¼ oz de mantequilla sin sal fría, cortada en cubos de 5 mm", "2 yemas de huevo de rango medio", "1 huevo mediano de granja, batido, para lavar huevos", "6 huevos medianos de granja", "2 naranjas, cáscara de tres y jugo de dos", "2 limas, solo cáscara", "250 g / 9 oz de azúcar en polvo", "1 mango maduro grande, pelado, sin hueso", "3 maracuyas", "1½ cucharada de ron con especias", "Crema doble de 200 ml / 7 fl oz", "4 cucharadas de coco desecado", "Físalis de 100 g / 3½ oz (grosellas de cabo), hojas retiradas"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Engrase y forme una lata de tarta de 23cm / 9in.", "Para la masa, coloque la harina y el azúcar glas en el tazón de un procesador de alimentos y pulse brevemente para mezclar. Agregue la mantequilla y el pulso hasta que la mezcla se asemeje a pan rallado fino.", "Incline la mezcla en un tazón grande y agregue las yemas de huevo y dos cucharadas de agua fría. Mezcle con sus manos hasta que la mezcla se una.", "En una superficie de trabajo ligeramente enharinada, amasar brevemente la masa para unir la masa. Aplane a un círculo grueso, envuélvalo en una película adhesiva y déjelo enfriar en la nevera durante 20 minutos.", "En una superficie de trabajo generosamente enharinada, extienda la masa en un círculo de aproximadamente 3 mm de grosor y lo suficientemente grande como para rellenar la lata de tarta con un poco de exceso.", "Alinee la lata de tarta con la masa, utilizando un rodillo para ayudarlo a levantar la masa. Suavemente empuje la masa en los bordes y deje cualquier exceso que sobresalga de la lata. Coloque la lata de tarta en una bandeja de horno.", "Pincha la base de la masa con un tenedor. Coloque la caja de repostería en la nevera durante 10 minutos.", "Cuando la pastelería esté fría, recubre con cuatro hojas de película adhesiva o un trozo de papel para hornear arrugado. Rellene completamente con frijoles para hornear (o pulsos secos) y hornee a ciegas durante 20 minutos en el estante del medio del horno.", "Retire del horno y levante los frijoles para hornear con la película adhesiva o pergamino para hornear. Cepille la caja de pastelería con el lavado de huevos.", "Vuelve al horno durante ocho minutos, o hasta que la masa parezca seca y dorada.", "Baje la temperatura del horno a 140C / 275F / Gas 1.", "Para el relleno, en un tazón grande y resistente al calor, agregue los huevos, la ralladura de naranja, la ralladura de lima y 150g / 5½ oz del azúcar impalpable. Revuelva suavemente hasta que el azúcar se disuelva: trate de evitar que entre demasiada cantidad de aire en la mezcla.", "En un procesador de alimentos, mezcle la mitad del mango con un puré. Pase a través de un colador para eliminar las fibras y mida 50 g / 1¾oz de puré (cualquier puré sobrante se puede guardar en la nevera durante 2-3 días y se puede usar en batidos, sorbetes o como salsa para postres).", "Cortar las maracuyáceas por la mitad y pasar la pulpa a través de un tamiz en una jarra medidora. Agregue el jugo de naranja para hacer 100 ml / 3½ fl oz de maracuyá y jugo combinados. Vierta la mezcla de huevo junto con el ron, puré de mango y crema doble. Revuelva suavemente hasta que esté bien mezclado. Dejar de lado.", "Para la masa, corte el exceso de masa de los lados con un cuchillo afilado.", "Mientras tanto, coloque el bol del relleno sobre una fuente de agua hirviendo a fuego lento (no permita que el agua toque el recipiente). Revuelva continuamente hasta que la mezcla alcance 55C / 130F en un termómetro de cocción.", "Verter el relleno en la caja de tarta calentada y hornear durante 25 minutos, hasta que se acaba de establecer, pero con un bamboleo en el centro. (Cuando esté cocinado, el relleno debe ser de 70 ° C / 160 ° F en el centro).", "Retire del horno y deje enfriar por 10 minutos. Retire la lata y coloque la tarta en una rejilla para enfriar. Cuando esté completamente frío, coloque la tarta en un plato para servir.", "Para la decoración, esparza el coco desecado en un patrón en el medio de la tarta. Cuidadosamente corte el mango restante y coloque las rebanadas alrededor del borde de la tarta. Termina con el physalis colocado uniformemente alrededor de la tarta."], "url": "www_bbc_co_uk_food_recipes_tropical_manchester_tart_55667", "title": "Tarta tropical de Manchester", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace tarta de 1 x 23 cm / 9 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de avellanas", "50g / 2oz de almendras", "50g / 2oz de piñones", "8 filetes de anchoa enlatados en aceite, escurridos", "1 diente de ajo, finamente picado", "2 cucharadas de alcaparras en salmuera, escurridas", "2 huevos de gallinas camperas, golpeados", "50g / 2oz grissini (palitos italianos), aplastados", "puñado de menta fresca, finamente picado", "75g / 3oz de queso parmesano, finamente rallado", "1 limón, ralladura solamente", "sal y pimienta negra recién molida", "4 truchas enteras, cada una de aproximadamente 450 g / 16 oz, a escala, eviscerado, branquias eliminadas", "110g / 4oz de mantequilla", "sal y pimienta negra recién molida", "300g / 10½oz brócoli brotación púrpura", "1 cucharada de aceite de oliva", "12 dientes de ajo (o al gusto), en rodajas finas", "1 limón, solo jugo"], "method": ["Coloque las avellanas, las almendras, los piñones, las anchoas, el ajo y las alcaparras en un procesador de alimentos y mezcle.", "Transfiera la mezcla de nueces a un recipiente. Agregue los huevos, el grissini triturado, la menta, el parmesano, la ralladura de limón, la sal y la pimienta negra recién molida y revuelva bien para crear una pasta. Si parece un poco húmedo, agregue un poco más de grissini triturado.", "Coloque la trucha en una tabla de cortar y rellene las cavidades con la pasta.", "Ate cada trucha en tres lugares con rafia o cadena de cocina para envolver el pescado alrededor del relleno.", "Caliente la mantequilla en una sartén grande lo suficientemente grande como para caber las cuatro truchas; alternativamente divida la mantequilla entre dos sartenes.", "Cuando la mantequilla se haya derretido, agregue el pescado y fría por 3-5 minutos en cada lado, o hasta que esté recién cocido.", "Poner a hervir una olla de agua a fuego alto. Agregue una pizca de sal y el brócoli brotación púrpura y cocine durante 2-3 minutos. Escurrir y apartar.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva y el ajo, saltear durante 30 segundos antes de agregar el brócoli drenado. Revuelva-fríe por un minuto, luego agregue el jugo de limón y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque cada trucha en un plato de servir y coloque cantidades iguales de brócoli al costado."], "url": "www_bbc_co_uk_food_recipes_troteripieneelegates_86355", "title": "Trucha rellena y brócoli brotación púrpura", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hojas de gelatina", "perifollo del racimo, finamente picado", "manojo de eneldo, finamente picado", "manojo de cebollino, finamente picado", "manojo de estragón, finamente picado", "pequeño puñado de perejil flatleaf, finamente picado", "1 trucha grande, fileteada, deshuesada, sin piel", "12 cangrejos, cáscara blanqueada", "1 repollo Savoy, solo hojas de color verde oscuro, finamente trituradas", "puñado de pequeñas girolles, limpiadas", "125ml / 4fl oz de vino blanco", "salpicar vinagre de vino blanco", "1 chalote de plátano pequeño, finamente picado", "150 g / 5½ oz de mantequilla sin sal, más extra para freír", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Remoje la gelatina en agua fría hasta que esté suave.", "Coloque dos hojas de película adhesiva sobre una superficie limpia y espolvoree el centro con la mitad de las hierbas picadas.", "Presione un filete de trucha sobre las hierbas. Coloque las hojas de gelatina en la parte superior de los peces de manera uniforme. Coloque el segundo filete en la parte superior, en la dirección inversa (de la cabeza a la cola). Cubra con las hierbas restantes, presione hacia abajo con firmeza y ruede la ballotina, comenzando desde la cola, usando la película adhesiva para envolverla firmemente. Gira los extremos para hacer una forma de salchicha. Cubra bien con papel de aluminio y refrigere durante la noche.", "Ponga a hervir una olla grande de agua y pese el ballottine. Agregue el ballottine al agua, aún en su lámina, durante 3 minutos por 450 g / 1 libra. Apague el fuego y déjelo en el agua durante 1 hora. Retirar del agua y dejar enfriar. Poner en la nevera durante la noche.", "Para hacer la beure blanc, coloque el vino, el vinagre y la chalota picada en una cacerola pequeña a fuego medio y reduzca el líquido por tres cuartos. Poco a poco agregue la mantequilla, el aderezo y el jugo de limón. Dejar de lado.", "Blanquee los cangrejos de río durante 3-5 minutos o hasta que estén cocidos y se hayan puesto de color rojo brillante.", "Mientras tanto, pula el repollo verde oscuro rallado durante 1 minuto y revuelva bajo agua fría.", "En una sartén a fuego medio, saltee el cangrejo con los girolles en un poco de mantequilla. Agregue el repollo rallado durante 1-2 minutos.", "Coloque la col, cangrejos de río y girolles entre cuatro placas. Corte la ballotina en cuatro y colóquela encima. Cuchara alrededor de la salsa de mantequilla y sirva."], "url": "www_bbc_co_uk_food_recipes_trout_ballottine_with_91468", "title": "Trucha ballottine con cigalas y girolles", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 pimientos Romano rojos, picados", "4 patatas dulces, cortadas en trozos", "5 cucharadas de aceite de oliva", "1 limón, ralladura solamente", "100g / 3½oz de arroz basmati", "½ cucharada de cúrcuma molida", "3 hojas de laurel", "1 cucharadita de caldo de caldo vegetal", "algunos botones de mantequilla", "Consejos de espárragos de 300 g / 10½ oz", "4 chalotes, picados", "2 dientes de ajo, finamente picados", "50g / 1¾oz de piñones, tostados", "Remolacha cocida 400g / 14oz, rallada", "1 cucharada de azúcar moreno", "3 cucharadas de vinagre balsámico", "sal y pimienta negra", "puñado de eneldo fresco, picado", "puñado de perejil fresco, picado", "puñado de menta fresca, picada", "½ zumo de limón, solo jugo", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra", "Filetes de trucha arcoiris de 500 g / 1 lb 2 oz, deshuesados, desollados", "Trucha ahumada de 120 g / 4¼ oz", "Para la mantequilla de hierbas", "50g / 1¾oz de mantequilla, ablandada", "1 diente de ajo, aplastado", "½ limón, solo ralladura", "puñado de eneldo y perejil, picado", "80ml / 2½fl oz de agua helada", "1 cucharada de jugo de limón", "500g / 1lb 2 oz de harina natural, más extra para espolvorear", "1 cucharadita de sal", "250 g / 9 oz de mantequilla sin sal, en cubos", "1 huevo de gallinas camperas, más 1 yema", "1 huevo de gallina, batido con una pizca de sal, para glasear", "120ml / 4fl oz de aceite de girasol", "1½ cucharada de aceite de colza", "1 huevo de gallinas camperas, solo yema", "pellizque los filamentos de azafrán, empapados en 1 cucharada de jugo de limón durante 15 minutos", "pizca de sal", "½ cucharada de mostaza inglesa", "½ cucharada de jugo de limón", "Ensalada mixta de 200 g / 7 oz", "Lechuga de cordero de 70 g / 2½ oz y cohete salvaje", "300g / 10½oz de tomates cherry"], "method": ["Para el llenado, precaliente el horno a 220C / 425F / Gas 7. Coloque los pimientos picados y las batatas en las bandejas de asar, cúbralas ligeramente con un poco de aceite de oliva y tueste durante 20-30 minutos.", "Coloque la ralladura de limón y el arroz en una olla con un poco de aceite de oliva para cubrir. Agregue la cúrcuma y las hojas de laurel. Mezcle el caldo de verduras con agua caliente (duplique el volumen de agua hasta el arroz). Cubra el arroz con caldo y cocine a fuego lento durante 10-15 minutos, o hasta que el arroz esté cocido. Escurrir bien, agregar un poco de mantequilla y reservar.", "Para la masa, mezcle el agua fría con el jugo de limón. Ponga la harina y la sal en un tazón y, con las puntas de los dedos, frote la mantequilla en la harina hasta que la mezcla se asemeje a migas de pan finas. Haga un pozo en el centro de la mezcla y agregue el huevo entero y la yema de huevo. Traiga la masa junto con sus manos, gradualmente agregue el agua y el jugo de limón hasta que tenga una masa suave.", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y amaselo suavemente hasta formar una bola. Aplane para crear una forma de disco, envuélvala en una película adhesiva y colóquela en la nevera para que descanse durante al menos 10 minutos.", "Mientras tanto, para el relleno, cocine los espárragos en una sartén con agua hirviendo con sal hasta que estén tiernos, luego transfieralos a un recipiente con agua fría para que se enfríen.", "Suavemente fríe los chalotes en una sartén con un poco de mantequilla y un poco de aceite de oliva. Cuando los chalotes son translúcidos, agregue el ajo y cocine durante unos minutos para suavizar. Agregue las chalotas al arroz cocido y revuelva a través de los piñones tostados.", "Freír la remolacha en la misma sartén en la que cocinó las chalotas. Cocine suavemente durante unos minutos hasta que estén tiernas. Agregue el azúcar moreno y el vinagre balsámico y sazone con sal y pimienta. Transfiere a un plato para enfriar.", "Agregue el eneldo picado, el perejil y la menta en un tazón con el jugo de limón, una cucharada de aceite de oliva y el vinagre de vino blanco. Sazone al gusto con sal y pimienta, luego revuelva a través de los espárragos refrigerados.", "En un tazón, mezcle la mantequilla, el ajo, la ralladura de limón y las hierbas picadas. Cubra los filetes de trucha arco iris con la mantequilla de hierbas.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre una lata de pan grande con papel de aluminio y luego pergamino para hornear (para facilitar la remoción del pastel una vez cocido).", "Retire la masa fría de la nevera. Divida en dos y extienda una mitad sobre una superficie de trabajo ligeramente enharinada hasta que sea lo suficientemente grande como para alinear la lata de pan. Alinee la lata con la masa, dejando un pequeño saliente alrededor del borde.", "Comience a recubrir el relleno de pastel, condimentar cada capa a medida que avanza con sal y pimienta. Comience con una capa de arroz, pimientos, filete de trucha arcoiris, trucha ahumada, espárragos, remolacha y batata. Repita hasta que la caja de repostería esté llena y todos los ingredientes hayan sido utilizados.", "Estirar los pasteles restantes para formar una tapa de pastel. Cepille los bordes de la caja de pastelería con un poco de huevo batido, levante la tapa en su lugar y presione hacia abajo para sellar.", "Use cualquier guarnición de pastelería para decorar la parte superior del pastel. Teje tiras de hojaldre en una celosía para representar un cesto de picnic. Cubra con un lazo de repostería, un cierre de cesto de picnic y algunas flores. Cuidadosamente prensar los bordes del pastel y cortar un pequeño cuadrado en el centro del pastel para permitir que salga el vapor. Cepille la superficie de la tarta con huevo y luego hornee durante aproximadamente 50 minutos, o hasta que esté dorado oscuro (verifique después de 30 minutos; si la pasta se dora demasiado rápido, cubra los bordes con papel de aluminio para evitar que se queme).", "Mientras que el pastel se está horneando, haga la mayonesa de azafrán. Mezcle el girasol y el aceite de colza en una jarra medidora. En un bol batir la yema de huevo, el azafrán remojado, la sal, la mostaza y el jugo de limón. Poco a poco agregue el aceite en una corriente delgada, batiendo todo el tiempo hasta que tenga una mayonesa espesa. Transfiera a una olla pequeña y deje enfriar hasta que esté listo para servir.", "Para servir, mezcle las hojas de ensalada y los tomates cherry en un tazón. Sirve el pastel caliente con la ensalada y la mayonesa al lado."], "url": "www_bbc_co_uk_food_recipes_trout_picnic_pie_26682", "title": "Pastel de picnic de trucha", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones 400g / 14oz, lavados y rellenos", "100 ml / 3½ fl oz de vino blanco seco", "4 ramitas de tomillo", "2 cucharadas de aceite de oliva", "Chorizo ​​para cocinar 200g / 7oz, picado", "1 cebolla picada", "2 dientes de ajo picados", "1 x 400 g de tomate picado", "2 cucharadas de perejil de flatleaf fresco picado", "2 filetes de trucha, deshuesados ​​y con piel", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos. Coloque los mejillones, el vino y 2 ramitas de tomillo en una olla grande. Cubra con una tapa y cocine durante 3-4 minutos. Deseche cualquier mejillón que permanezca cerrado y aparte el resto.", "Caliente una cucharada de aceite en una sartén y agregue el chorizo. Cocine por 2-3 minutos, o hasta que estén crujientes. Retire de la sartén y reserve.", "Agregue la cebolla, el ajo y el tomillo restante a la sartén y cocínelos durante 4-5 minutos, o hasta que estén blandos. Regrese el chorizo ​​a la sartén y vierta los tomates. Cocine hasta que el volumen de líquido se haya reducido a la mitad. Agregue los mejillones y el perejil y sazone con sal y pimienta.", "Caliente el aceite restante en una sartén. Una vez caliente, agregue la trucha y fría en cada lado durante 2 minutos, o hasta que esté bien cocida.", "Divida la salsa entre dos platos calentados y cubra con un filete de trucha. Sirva inmediatamente con el pan crujiente."], "url": "www_bbc_co_uk_food_recipes_trout_with_mussel_and_72428", "title": "Trucha con salsa de mejillón y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 filete de trucha", "1 cucharadita de semillas de sésamo", "jugo de medio limón"], "method": ["Calienta la mitad de la mantequilla en una sartén. Agregue la trucha, con la piel hacia abajo, y cocine de uno a dos minutos.", "Cuidadosamente voltee el filete y termine de cocinar en el otro lado por otros dos minutos. Retire la trucha de la sartén y déjela a un lado en un plato caliente.", "Agregue la mantequilla restante. Cuando empiece a formar espuma agregue las semillas de sésamo.", "Cuando las semillas comiencen a adquirir color, exprime el jugo de limón.", "Sirva la trucha con la salsa beurre noisette vertida en la parte superior."], "url": "www_bbc_co_uk_food_recipes_troutbuerrenoisette_78167", "title": "Trucha mantequilla avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 truchas arco iris, limpiadas, evisceradas y con mariposa (pídale a su pescadero que haga esto)", "sal y pimienta negra recién molida", "4 vieiras, limpiadas", "150ml / 5fl oz de crema doble", "½ limón, jugo", "50g / 2oz de mantequilla", "110g / 4oz de mantequilla sin sal", "½ limón, solo jugo", "4 cucharadas de almendras copos tostadas", "2 cucharadas de perejil de hoja plana, más o menos picado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la trucha, sazone el interior de la trucha con sal y pimienta negra recién molida.", "Coloque las vieiras en un procesador de alimentos y mezcle con un puré. Agregue la crema doble y el jugo de limón y el pulso hasta que espese.", "Sazone la mezcla de vieiras con sal y pimienta negra y luego cuchara o pipe en la cavidad de la trucha. Presione la trucha hacia abajo suavemente para cerrar.", "Caliente la mantequilla en una sartén a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue la trucha y fría por 1-2 minutos en cada lado.", "Transfiera la trucha a una bandeja para hornear y hornee por otros 4-5 minutos para terminar de cocinar.", "Retírelo y déjelo a un lado para que descanse durante un minuto, luego despegue la piel y deje la cabeza puesta.", "Para el beurre noisette, caliente una sartén hasta que esté caliente, agregue la mantequilla y caliente hasta que tome un color marrón nuez.", "Agregue el jugo de limón, las almendras tostadas, el perejil y una pizca de sal y pimienta negra recién molida y luego retírelo del fuego.", "Para servir, coloque cada trucha en un plato y cubra con una cuchara el beurre noisette."], "url": "www_bbc_co_uk_food_recipes_trout_with_scallop_29710", "title": "Trucha con muselina de vieiras, noisy beurre y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 450 g / 1 libra de trucha fresca marrón o arcoíris, sin tripas y branquias", "25g / 1oz de mantequilla", "½ cebolla pequeña, pelada, finamente picada", "40 g / 1½ oz de harina natural, más tres cucharadas de dragado", "250ml / 9fl oz de leche entera", "1 cucharadita de puré de tomate", "2 cucharaditas de hojas frescas de estragón fresco picado", "1 cucharadita de mostaza Dijon", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "2 huevos grandes de gallinas camperas, golpeados", "Migajas de pan blancas finas de 100g / 3½oz (hechas de pan duro tostado mezclado en un procesador de alimentos)", "8 cucharadas de almendras molidas", "aceite de girasol, para freír", "1 limón, cortado en cuñas"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Cubra una bandeja para hornear con papel de aluminio y engrase ligeramente con aceite. Coloque la trucha en la bandeja preparada y cubra con una segunda hoja de papel de aluminio. Hornee en el horno durante 12-15 minutos, o hasta que el pescado esté bien cocido. (NB: el pescado se cuece cuando la carne más cercana al hueso en la parte más gruesa es opaca).", "Cuando la trucha esté cocida, déjela enfriar. Cuando esté lo suficientemente frío como para manipularlo, quítele la piel y deséchela. Poner el pescado en escamas en un tamiz suspendido sobre un recipiente, descartando cualquier hueso.", "Mientras tanto, derrita la mantequilla en una sartén grande a fuego medio. Cuando la mantequilla esté espumosa, agregue la cebolla y fría por 2-3 minutos, o hasta que comience a colorear.", "Agregue la harina y continúe calentando durante 30 segundos, revolviendo continuamente.", "Agregue la leche y continúe cocinando, revolviendo continuamente, durante 4-5 minutos, o hasta que la mezcla se espese.", "Retire la sartén del fuego y bata en la puré de tomate, estragón, mostaza Dijon y crema hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida. Cubra la sartén con film transparente y déjela enfriar un poco.", "Cuando la mezcla esté tibia, agregue los copos de trucha hasta que estén bien combinados. Cubra de nuevo y déjela a un lado hasta que se haya enfriado por completo, luego enfríe en el refrigerador por un mínimo de cinco horas o hasta que se solidifique.", "Cuando la mezcla de trucha se haya enfriado, haz quenelles o bolas de la mezcla usando dos cucharas grandes para formar croquetas.", "Vierta los huevos batidos en un recipiente poco profundo. Espolvorea la mitad de las migas de pan y la mitad de las almendras molidas en otro recipiente poco profundo. Espolvorea las tres cucharadas de harina en un tercer tazón.", "Separe cada croqueta ligeramente en la harina, luego sumérjala en el huevo batido y luego revuelva en la mezcla de pan rallado hasta que esté completamente cubierto. Coloque la croqueta preparada en una bandeja para hornear. Repita el proceso hasta que haya preparado ocho croquetas.", "Cuando se hayan preparado ocho de las croquetas, descarte la mezcla de migas de pan y reemplácela con las migas de pan y las almendras restantes. Repita el proceso con la mezcla de croqueta restante hasta que tenga 12-16 croquetas.", "Enfriar las croquetas en la nevera durante al menos 30 minutos.", "Llene a la mitad una sartén grande con aceite de girasol y caliente a 180 ° C (use un termómetro para cocinar para verificar la temperatura).", "Cuando el aceite esté caliente, baje cuidadosamente las croquetas, en tandas, en la sartén con una cuchara ranurada. Freír por 2-3 minutos, volteándolo una vez durante la cocción, o hasta que las migas estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Espolvorea con sal y mantén el calor.", "Repite el proceso con los lotes restantes de croquetas.", "Para servir, apile las croquetas en el centro de un plato para servir y exprima el jugo de las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_troutcroquettes_91864", "title": "Croquetas de trucha", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutcroquettes_91864_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ pimiento rojo, en rodajas", "½ cebolla roja, en rodajas", "1 filete de trucha", "1 limón, en rodajas", "½ chili, picado", "1 cucharada de salsa de soja"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Calentar el aceite en un wok y cuando esté caliente agregar la cebolla roja y el pimiento rojo. Revuelva freír durante uno o dos minutos o hasta que se ablanden.", "Extienda un pedazo grande de pergamino para hornear y coloque las verduras salteadas en el centro.", "Cubra con el filete de trucha y coloque las rodajas de limón y chile picado en la parte superior. Vierta sobre la salsa de soja.", "Dobla el pergamino alrededor del filete de trucha y ciérralo bien.", "Coloque en una bandeja para hornear y cocine en un horno caliente (220C) por diez minutos."], "url": "www_bbc_co_uk_food_recipes_troutenpapilotte_78165", "title": "Trucha en papel de aluminio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de trucha arcoiris, con la piel puesta", "50 g / 1¾oz de hojas frescas de espinaca, lavadas", "½ limón, en rodajas", "pequeño racimo de eneldo fresco", "2 cucharadas de vino blanco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Con un cuchillo afilado, puntúe la piel de la trucha en diagonal a intervalos de 2 cm / ½.", "Corta una hoja de papel de aluminio de unos 30 cm / 12 pulgadas cuadradas y coloca un cuadrado de papel para hornear del mismo tamaño en la parte superior. Coloque la pila de espinacas en el centro del pergamino para hornear, seguido del filete de trucha, las rodajas de limón, el eneldo y el vino blanco. Sazonar con sal y pimienta negra recién molida.", "Acerca los lados de la lámina sobre el pescado y asegúralo. Arrolla los dos extremos abiertos para formar una \"carpa\" para el pez. Coloque en una bandeja para hornear y cocine durante 8-10 minutos, o hasta que estén cocidos.", "Para servir, coloque el paquete de aluminio en un plato de servir y ábralo."], "url": "www_bbc_co_uk_food_recipes_troutenpapillotewith_88055", "title": "Trucha en papillote con vino blanco, eneldo y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55g / 2oz piñones", "1 filete de trucha arcoiris, reducido a la mitad", "1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "½ limón, solo jugo", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "200g / 7oz de arroz de grano largo", "200ml / 7fl oz de caldo de verduras calientes", "sal y pimienta negra recién molida", "2 cucharadas de eneldo fresco picado, más una ramita para decorar", "2 cucharadas de perejil de flatleaf fresco picado", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 chile verde fresco, picado", "3 tomates frescos, picados", "sal y pimienta negra recién molida", "2 cucharadas de vino blanco", "1 puñado de albahaca fresca, desgarrada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la trucha con corteza de piñones, coloque los piñones en un procesador de alimentos o mini batidora y pulse hasta que esté picado. Extiéndalos en una bandeja y enrolle los trozos de filete de trucha en las nueces para cubrir.", "Calentar el aceite y la mantequilla en una sartén pequeña y freír la trucha durante unos cuatro minutos en cada lado, o hasta que estén doradas y crujientes. Agregue el jugo de limón al final, permitiendo que se reduzca ligeramente en la sartén.", "Para la hierba de arroz, caliente el aceite en una sartén a prueba de horno y fría la cebolla y el ajo hasta que estén blandos. Agregue el arroz y fría por 1-2 minutos. Agregue el caldo de verduras calientes, sazone al gusto, con sal y pimienta negra recién molida y revuelva. Cocine en la placa durante aproximadamente 7-8 minutos, luego coloque una tapa en la sartén y colóquela en el horno durante 8-10 minutos más, revolviendo una vez durante la cocción y agregando más agua caliente si se requiere más líquido.", "Retire del horno y agregue el eneldo picado y el perejil.", "Para la salsa de tomate picante, caliente el aceite en una olla y fría la cebolla y el ajo hasta que estén suaves. Agregue la guindilla y fría por otros 1-2 minutos. Agregue los tomates picados, sazone al gusto, con sal y pimienta negra recién molida y suba el fuego hasta que los tomates se cocinen y la salsa burbujee. Agregue el vino blanco y cocine por otros dos minutos. Reduzca el fuego y coloque una tapa en la sartén. Cocine por otros cinco minutos o hasta que los tomates estén cocidos. Finalmente agregue las hojas de albahaca rotas.", "Con una batidora manual, procese la salsa hasta que esté suave, agregue más sal y pimienta negra recién molida si es necesario.", "Para servir, coloque una cucharada de arroz en un plato de servir, coloque las mitades de trucha en la parte superior y vierta sobre la salsa. Adorne con una ramita de eneldo."], "url": "www_bbc_co_uk_food_recipes_troutfilletwithpinen_88058", "title": "Filete de trucha con corteza de piñones, arroz con hierbas y salsa de tomate picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla fría sin sal, cortada en cubos pequeños", "2 chalotes medianos, pelados, en rodajas finas", "½ diente de ajo, pelado, en rodajas finas", "1 ramita de tomillo fresco", "1 pequeña hoja de laurel", "3 granos de pimienta negra, aplastados", "150ml / 5fl oz de vino blanco seco", "1 cucharadita de vinagre de vino blanco", "copos de sal marina", "1-2 cucharadas de jugo de limón recién exprimido", "2-3 cucharadas de harina natural", "sal y pimienta negra recién molida", "2-3 cucharadas de aceite de girasol", "2 x 200 g / 7oz gruesos filetes de trucha marrón o arco iris", "2 puñados de marisma de hinojo, enjuagados a fondo, tallos resistentes eliminados, divididos en pequeños trozos", "1 cucharada de mantequilla", "1-2 cucharadas de jugo de limón recién exprimido", "sal y pimienta negra recién molida"], "method": ["Para la beurre blanc, caliente una cucharada de mantequilla en una sartén no reactiva a fuego medio. Cuando la mantequilla se haya derretido, agregue los chalotes, el ajo, el tomillo, la hoja de laurel y los granos de pimienta y fría durante 2-3 minutos, o hasta que los chalotes estén suaves pero no coloreados.", "Agregue el vino blanco y el vinagre de vino y lleve la mezcla a ebullición. Continúe hirviendo hasta que la mayoría del líquido se haya evaporado, luego bata gradualmente en los cubos de mantequilla fría, uno a la vez, hasta que toda la mantequilla se haya incorporado a la mezcla y la salsa se haya espesado y esté brillante.", "Cuele la beurre blanc a través de un colador fino en un recipiente calentado, luego condimente, sazone, con sal y vierta sobre el jugo de limón. Mantener caliente (NB: No deje la beurre blanc en un lugar demasiado cálido o la salsa puede dividirse).", "Para la trucha, caliente una sartén grande a fuego alto. Espolvoree la harina en un plato y sazone, al gusto, con sal y pimienta negra recién molida. Pat los filetes de pescado fritos con papel de cocina.", "Saque los filetes de trucha, con la piel hacia abajo, en la harina sazonada, luego sacuda el exceso de harina. Sumerja los lados enharinados de los filetes de trucha en el aceite de girasol.", "Cuando la sartén esté caliente, agregue los filetes de trucha, enharinados, y fríalos por 3-4 minutos, o hasta que más de la mitad de la carne de la trucha se haya vuelto opaca y la piel esté crujiente y dorada. (NB: la piel necesita estar plana contra la sartén para que se dore por completo, así que presione los filetes de trucha con una rebanada de pescado si el calor los hace arquearse).", "Gire los filetes de trucha con cuidado y continúe freír durante un minuto más, o hasta que los filetes de trucha estén casi cocidos, pero todavía son un poco raros en el centro.", "Mientras tanto, para el samphire, agregue el samphire a una olla de agua hirviendo (no agregue sal) y cocine por 2-3 minutos, o hasta que esté tierno. Escurra bien, luego devuelva la salmón a la sartén, agregue la mantequilla y el jugo de limón y sazone al gusto con pimienta negra recién molida.", "Para servir, divida la hierba entre dos platos calentados. Coloque la trucha en la parte superior y cuchara sobre la beurre blanc."], "url": "www_bbc_co_uk_food_recipes_troutwithsamphireand_91865", "title": "Trucha con samphire y beurre blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutwithsamphireand_91865_16x9.jpg", "isVegetarian": false, "recommendations": 0}]