[{"isVegetarian": true, "title": "Orange Catalonian crème brûlée", "url": "www_bbc_co_uk_food_recipes_orangecataloniancreg_7101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 oranges, peeled with a knife and cut into pithless segments, soaked in ", "1 tbsp Grand Marnier, or similar", "590ml/1pint double cream", "1 vanilla pod, cut in half and scraped ", "6 egg, yolks only", "50g caster sugar, plus 4 tbsp for sprinkling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 140C/275F/Gas1. ", "Divide the orange segments between each terracotta dish. Put the cream and vanilla pod into a saucepan and heat to boiling point. Cover and allow to infuse for 10 minutes.", "Whisk the egg yolks and sugar together until pale and thick and add the cream. Stir well, strain and pour over the orange segments.", "Cook in a water bath for about 20 minutes, until just set. Leave to chill overnight if time allows or for at least 2-3 hours.", "Sprinkle sugar thinly and evenly over each dish and caramelise with a blowtorch (or under a very hot grill), repeat this process until you have golden crackling topping. ", "Leave to cool and serve within 2 hours.", ""]}, {"isVegetarian": false, "title": "Orange jelly with strawberry coulis and vanilla cream", "url": "www_bbc_co_uk_food_recipes_orangejellywithstraw_87443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 125g/4½oz packet ready-made orange jelly", "30g/1oz chocolate buttons", "85g/3oz fresh strawberries", "1 tbsp icing sugar", "1 tsp balsamic vinegar", "100ml/3½oz double cream", "1 vanilla pod, seeds removed", "sprig fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the orange jelly onto the middle of a serving plate. ", "Grate the chocolate around the jelly. ", "Place 55g/2oz of the strawberries in a small food processor with the icing sugar and balsamic vinegar and blend together to a smooth consistency. Pour into a small bowl. ", "Slice the remaining strawberries and arrange on the plate, around the jelly. Spoon the coulis over the strawberries. ", "Whip the cream in a bowl until soft peaks form when the whisk is removed and stir in the vanilla seeds. Spoon the vanilla cream on top of the jelly. Garnish with a sprig of fresh mint."]}, {"isVegetarian": true, "title": "Orange olives", "url": "www_bbc_co_uk_food_recipes_orangeolives_79055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 clove garlic, peeled and finely chopped", "1 orange, grated zest only", "¼ tsp chilli flakes", "110g/4oz black olives, pitted", "cumin seeds, to serve"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the olive oil into a bowl and stir in the garlic and orange zest.", "Stir in the chilli flakes then add the black olives. Stir again to coat in the oil.", "Transfer the olives to a serving dish and sprinkle with a few cumin seeds, to serve."]}, {"isVegetarian": true, "title": "Orange soufflé", "url": "www_bbc_co_uk_food_recipes_orangesouffle_89078", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "3 tbsp caster sugar, plus extra for sprinkling", "2 large sugar cubes", "1 orange", "250ml/8 fl oz milk", "1 vanilla pod, split", "25g/1oz plain flour", "4 free-range eggs, separated", "4 tbsp orange liqueur", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Butter the inside of a large oven-proof pudding dish and dust with caster to coat the inside evenly with sugar.", "Rub the sugar cubes over the skin of the orange to extract the oil, then crush the sugar cubes in a pestle and mortar. ", "Grate the orange peel to remove the orange zest (do not grate the white pith) and reserve the zest.", "Pour the milk into a pan over a low heat and add the vanilla pod, the sugar cubes and the orange zest. Bring to the boil, stirring occasionally, then cover and remove from the heat. Leave to cool then remove the vanilla pod.", "Place the flour into a clean pan and add a splash of the cooled vanilla and orange-infused milk. Add the caster sugar and mix well. Place over a low heat and gradually stir in the remaining milk infusion, mixing well to avoid lumps. Bring to the boil, then reduce the heat to simmer for 30 seconds, stirring continuously, until smooth and thickened. Remove from the heat and stir well for a couple of minutes.", "Whisk the egg yolks into the cooled sauce one at a time, then cover the mixture with cling film and leave to cool.", "When the mixture is cold, stir in the orange liqueur.", "Place the egg whites into a clean bowl and whisk until soft peaks form when the whisk is removed.", "Fold the whisked egg whites into the milk and egg yolk mixture.", "Transfer the soufflé mixture to the prepared pudding dish and run the handle of a spoon around the inside of the rim of the dish to make a shallow channel in the mixture.", "Place the soufflé into the oven to bake for 15-20 minutes.", "Remove from the oven and dust the surface of the soufflé with icing sugar, then return to the oven to cook for another 5-10 minutes, or until risen and golden-brown.", "Serve immediately at the table in the dish."]}, {"isVegetarian": true, "title": "Orangey honey buns", "url": "www_bbc_co_uk_food_recipes_orangeyhoneybuns_91684", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp caster sugar", "150g/5½oz plain flour", "½ tsp sea salt flakes", "1 x 7g/¼oz sachet easy-blend dried yeast", "3 large free-range eggs, lightly beaten", "75g/2¾oz butter, slightly softened, cut into cubes, plus extra for greasing", "500g/1lb 2oz caster sugar", "1 orange, rind only, rind cut into 4 long strips", "500ml/17fl oz cold water", "100g/3½oz clear honey", "4 tbsp orange liqueur", "½ tsp orange-flower water (optional)", "whipped cream, to serve"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease the wells of a 12-hole muffin tray with butter.", "Mix together the sugar, flour, salt and yeast in a large bowl until well combined. Add half of the beaten eggs, then whisk using an electric whisk until the mixture is well combined and forms a sticky paste.", "Gradually whisk in a little of the remaining beaten egg. When the egg is fully incorporated into the mixture, add 1-2 butter cubes and whisk in until fully incorporated into the mixture.", "Whisk the remaining beaten egg and remaining butter cubes into the mixture in alternate turns, until the mixture comes together as a soft dough. Using a wooden spoon, beat the dough until smooth.", "Divide the dough mixture equally among the wells in the prepared muffin tray. Set aside in a warm place for about an hour, or until the portions of dough have proved (ie. doubled in size and filled the wells in the tray).", "Meanwhile, preheat the oven to 220C/425F/Gas 7.", "When the dough has proved, bake the buns in the oven for 12-15 minutes, or until well risen and pale golden-brown. Set aside to cool on a wire rack.", "Meanwhile, for the syrup, heat the sugar, orange rind and cold water in a pan over a low heat, stirring well. When the sugar has dissolved, bring the mixture to the boil and continue to boil for three minutes, or until the mixture has thickened and resembles syrup.", "Remove the pan from the heat and stir in the honey, orange liqueur and orange-flower water, if using, until well combined. Set aside until cooled slightly.", "Dip six of the buns into the cooled syrup and serve straightaway on serving plates with a spoonful of whipped cream.", "Pack the remaining buns into a 1 litre/1¾ pints sterilised jar. Pour in the remaining syrup and set aside for 20 minutes, then cover the jar and seal tightly. The buns can be kept in the fridge for up to one month."]}, {"isVegetarian": false, "title": "Organic salmon and brassicas", "url": "www_bbc_co_uk_food_recipes_organic_salmon_and_58694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz chives", "50g/1¾oz leek tops ", "50g/1¾oz spring onion tops", "300ml/10fl oz sunflower oil", "pinch salt", "100ml/3½fl oz white wine vinegar", "75g/2¾oz caster sugar", "1 tsp salt", "1 turnip, peeled and sliced", "400ml/14fl oz extra virgin olive oil", "4 sprigs thyme", "10 juniper berries", "10 coriander seeds ", "4 sprigs pine ", "4 spears purple sprouting broccoli, blanched and roasted", "4 cauliflower florets, blanched and roasted", "4 tbsp chicken stock", "4 x 150g/5½oz organic salmon fillets", "2 heads broccoli, stems removed and broken into florets", "salt, to taste", "½ red cabbage, juiced, to yield 250g cabbage juice", "5 tsp soy sauce", "5 tsp mirin", "½ tsp agar agar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the onion oil, blend all the ingredients, except the chicken stock, in a food processor for five minutes. Pour the mixture into a cheesecloth set over a clean bowl and leave to drain overnight. Season the oil with salt and store in an airtight container until needed.", "For the pickled turnip, place the vinegar, sugar and salt into a saucepan and bring to the boil. Leave to cool then place the turnip slices into a bowl or preserving jar and pour the liquid over the top. Leave to marinade for at least one hour.", "For the salmon, place the extra virgin olive oil, thyme, juniper, coriander and pine into a saucepan and heat to 80C/175F. Allow to cool. ", "When you are ready to cook the salmon, heat the infused oil in a wide pan to 46C/115F. Drop in the salmon, remove the pan from the heat and leave for 30 minutes.", "For the broccoli purée, bring a large pan of salted water to the boil, add the broccoli florets and blanch for 90 seconds. Drain well, reserving the liquid, then place the broccoli into a food processor and blend until smooth - if the mixture seems a little thick add a little of the cooking water. Season the purée with a little salt then pass through a fine sieve into a bowl set over an ice bath.\t", "For the red cabbage purée, mix the cabbage juice with the soy and mirin in a saucepan. Season with a little salt, if necessary, then whisk in the agar agar. Bring to a boil, let the mixture bubble for 10 seconds then remove from the heat and pour into a bowl set over an ice bath. When cool and set, blend the mixture to a smooth purée, pass through a fine sieve and chill in the fridge until needed.", "To serve, when the salmon is a few minutes off being cooked, start dressing the plate. Spoon the red cabbage purée into the centre of the plate. Scatter over some of the cauliflower florets then top with the salmon. Place the purple-sprouting broccoli alongside with a spoonful of the broccoli purée. Pile the pickled turnip at the edge of the salmon. Whisk the chicken stock into three tablespoons of the onion oil and quickly warm through in a saucepan. Drizzle the warmed oil around the edge of the food and serve immediately. "]}, {"isVegetarian": false, "title": "Organic new season lamb with rosemary, lemon and zucchero rosato", "url": "www_bbc_co_uk_food_recipes_organicnewseasonlamb_74899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 leg of new season organic lamb, boned and butterflied (you can ask your local butcher to do this for you)", "1 small jar zucchero rosato (rose petal jam) ", "3 tbsp Dijon mustard", "2 unwaxed lemons, grated zest only", "generous bunch of fresh rosemary, stalks removed and leaves roughly chopped", "2 tbsp extra virgin olive oil", "sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/356F/Gas 4. ", "For the rose coating, blend all of the ingredients together in a bowl, adding the olive oil last.", "Season the lamb generously with sea salt and freshly ground black pepper and spread the rose coating all over the skin, using it all up.", "Place the lamb in the preheated oven for 35 minutes.", "Remove from the oven and allow to sit for 20 minutes before slicing and serving."]}, {"isVegetarian": false, "title": "Oriental-style marinated rump of lamb", "url": "www_bbc_co_uk_food_recipes_oriental-style_marinated_79700", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in piece fresh ginger, peeled, finely grated", "4 garlic cloves, peeled", "3 tbsp soy sauce", "2 tbsp ketjap manis", "2 tbsp ready-made sweet-and-sour plum sauce", "2 tbsp mirin", "2 tbsp sesame oil", "extra virgin olive oil", "6 x 160-180g/5-6oz lamb rumps"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, blend all of the marinade ingredients except the olive oil to a smooth paste in a food processor (Alternatively, grind to a paste in a pestle and mortar.) Gradually add a drizzle of olive oil to loosen the marinade mixture as necessary.", "For the lamb, transfer the marinade to a resealable freezer bag and add the lamb rumps. Seal the bag, removing as much air as possible as you do so, then massage the mixture into the meat and set aside in the fridge to marinate for between 2 hours and 24 hours.", "When the meat has marinated, either preheat the oven to 190C/375F/Gas 5, or prepare a barbecue.", "Remove the marinated lamb rumps from the freezer bag and shake off any excess marinade. Place the marinated lamb rumps into a roasting tray and roast in the oven for 20-25 minutes (for medium, depending on the size of the rumps), or until cooked to your liking. Alternatively, cook the lamb rumps on the hot barbecue grill."]}, {"isVegetarian": false, "title": "Asian-inspired cod with stir fry", "url": "www_bbc_co_uk_food_recipes_oriental_cod_with_stir_72954", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_cod_with_stir_72954_16x9.jpg", "ingredients": ["150g/5½oz cod or haddock fillet, boneless", "1 tbsp soy sauce", "1 tbsp mirin ", "1 tsp rice vinegar ", "2 tsp sunflower oil ", "½ red pepper (60g/2¼oz), thinly sliced", "1 small carrot (50g/1¾oz), thinly sliced", "50g/1¾oz mangetout, thinly sliced ", "1 tsp toasted sesame seeds", "few sprigs fresh coriander (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the fish in a plastic food bag, add the soy, mirin and rice vinegar. Give it a good shake and refrigerate or freeze until ready to cook.", "Preheat the grill to its hottest setting and line a small roasting tin with foil. Drain the fish, reserving the marinade. Put the fish on the foil and grill for 5 minutes, or until cooked through.", "Meanwhile, heat a small wok or frying pan over a high heat and add the oil. Add the vegetables and stir-fry for 30 seconds. Add 2 tablespoons water and the reserved marinade and cook for 1–2 minutes, or until hot through. ", "Place the vegetables on a warm plate and top with the fish. Scatter over the sesame seeds and coriander, if using. "]}, {"isVegetarian": false, "title": "Vietnamese-style crayfish and noodle salad", "url": "www_bbc_co_uk_food_recipes_oriental_vegetable_99308", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_vegetable_99308_16x9.jpg", "ingredients": ["200g/7oz extra-fine dried rice noodles", "½ cucumber, halved lengthways", "150g/5½oz cooked and peeled crayfish tails", "1 red pepper, deseeded and thinly sliced", "150g/5½oz beansprouts", "6 spring onions, thinly sliced on the diagonal", "1 small carrot, cut into fine matchsticks", "½–1 fresh red chilli, deseeded and finely chopped", "1 small bunch fresh coriander, chopped", "1 small bunch fresh mint, chopped", "3cm/1¼in piece fresh root ginger, peeled and finely grated", "1 garlic clove, crushed ", "30g/1oz salted peanuts, chopped, to serve (optional)", "salt and freshly ground black pepper", "3 tbsp Thai fish sauce", "3 tbsp lime juice (1–2 limes)", "3 tbsp light muscovado sugar", "1 tbsp sesame oil"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice noodles in boiling water according to the packet instructions, or until they are al dente, then drain and refresh in cold water. Drain again and snip into shorter lengths.", "Using a teaspoon, scoop out the cucumber seeds along the middle of the half and discard. Thinly slice the cucumber on the diagonal and tip into a large salad bowl. ", "Add all the remaining salad ingredients, including the cooked noodles, season with salt and pepper, and toss together.", "For the dressing, mix all the ingredients together in a small bowl. Just before serving, pour the dressing over the salad and toss together. Scatter with the peanuts, if using."]}, {"isVegetarian": false, "title": "Oriental salmon broth", "url": "www_bbc_co_uk_food_recipes_orientalbroth_84531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp sesame oil", "1 garlic clove, chopped", "½ stick lemongrass, outer leaves discarded, finely chopped", "300ml/10½fl oz hot vegetable stock", "100g/3½oz salmon fillet, cubed", "55g/2oz ready-made thin rice noodles, cooked according to packet instructions", "2 lime wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sesame oil in a wok over a low heat. Add the garlic and lemongrass and fry for 3-5 minutes.", "Add the vegetable stock and salmon pieces. Bring to the boil, then reduce the heat to simmer gently for 5-10 minutes, or until the salmon is cooked. ", "Add the noodles and stir well.", "To serve, pour the broth into a bowl and add the lime wedges."]}, {"isVegetarian": true, "title": "Oriental broth with noodles", "url": "www_bbc_co_uk_food_recipes_orientalbrothwithnoo_77710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5¼oz plain flour", "2 free-range eggs ", "25ml/1oz water ", "500ml/17fl oz chicken or vegetable stock ", "1 tbsp soy sauce ", "½ tsp chilli flakes", "1 lime, juice only ", "2 tbsp coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the plain flour with the eggs and water and mix to form a smooth dough.", "Using a pasta machine, place the noodle dough onto the fine noodle setting.  Create your noodles by feeding the pasta through slowly.", "To make the broth, place the chicken or vegetable stock in a deep saucepan with the soy, chilli flakes, lime juice and coriander.  Simmer for five minutes then add the noodles. Cook for a further three minutes and serve in a large bowl."]}, {"isVegetarian": false, "title": "Oriental chicken noodle broth", "url": "www_bbc_co_uk_food_recipes_orientalchickennoodl_84515", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, chopped", "1 garlic clove, chopped", "1 red chilli, sliced", "150ml/5fl oz hot chicken stock", "75g/2½oz chicken breast, cut into strips", "50g/1oz ready-made egg noodles, cooked according to packet instructions", "2 spring onions, chopped", "handful bean sprouts", "salt and freshly ground black pepper", "1 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a medium saucepan over a medium heat. Add the onion and cook for 2-3 minutes, until softened.", "Add the garlic and chilli and cook for another minute.", "Add the chicken stock and chicken breast. Bring to the boil, then reduce the heat to simmer for four minutes, or until the chicken is completely cooked through.", "Add the noodles, spring onions and beans sprouts and season, to taste, with salt and freshly ground black pepper.", "To serve, pour into a bowl and sprinkle with sesame seeds."]}, {"isVegetarian": false, "title": "Oriental chicken pie", "url": "www_bbc_co_uk_food_recipes_orientalchickenpie_67963", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 fresh or dried shiitake mushrooms", "½ roasted or poached chicken", "4 shallots, or 1 small onion", "2 tbsp vegetable oil", "1 tbsp plain flour", "110ml/4fl oz chicken stock ", "1 tbsp soy sauce", "1 tbsp oyster sauce", "1 tbsp hoi sin or plum sauce", "2 tbsp coriander leaves", "500g/1lb 2oz packet frozen puff pastry", "1 egg, yolk only, beaten with", "1 tbsp milk", "110g/4oz mange tout, julienned"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the dried mushrooms in hot water for 30 minutes. ", "Heat the oven to 200C/400F/Gas 6. ", "Shred the meat from the chicken and finely chop.", "Finely slice the shallots or onion. Drain the dried mushrooms, trim off the stalks and finely slice. Trim and finely slice the fresh mushrooms if using.", "Heat the oil, and cook the shallots gently until soft. Sprinkle with the flour, and cook, stirring constantly, for 2 minutes, then gradually add the chicken stock, stirring. ", "Add the mushrooms and soy sauce, oyster and hoi sin sauces and simmer for 5 minutes. Remove from the heat, stir in the chicken and coriander leaves, and leave to cool. ", "Thaw the pastry, roll out, and cut into 8x15 cm squares. Plop 1 hearty tbsp of the mixture on four of the squares, top with the remaining squares, and press down around the filling. Place a large glass or small Chinese bowl over the top, and trim into a circle. ", "Brush with egg yolk, cut a small slash in the top, and bake for 20 minutes or until golden. ", "Serve with julienned mange tout on the side."]}, {"isVegetarian": false, "title": "Oriental chicken salad", "url": "www_bbc_co_uk_food_recipes_orientalchickensalad_68063", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalchickensalad_68063_16x9.jpg", "ingredients": ["4 skinless, boneless chicken breasts", "4 tbsp clear honey", "2 tbsp rice vinegar", "2 tbsp soy sauce", "1 tbsp sesame oil", "1 garlic cloves, crushed", "2.5cm/1in piece fresh ginger, peeled and grated", "2 tbsp sesame seeds, toasted", "small bunch of fresh coriander, roughly chopped", "1 large carrot, cut into fine matchsticks", "1 bunch of spring onions, shredded", "½ cucumber, peeled, halved, de-seeded and cut into matchsticks", "½ Chinese lettuce, finely shredded"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Cut the chicken into thin strips and mix with the honey, vinegar and soy sauce. Leave to marinate in a non-metallic bowl for about 30 minutes. ", "Heat the sesame oil in a frying pan and cook the chicken over a high heat with any marinade for about 5 minutes until the chicken is cooked through, leaving some cooked marinade in the pan to use as the salad dressing.", "To serve warm, toss in a large bowl with the remaining ingredients and eat immediately. To serve cold, leave the cooked chicken and marinade to cool and then toss with the remaining ingredients."]}, {"isVegetarian": false, "title": "Oriental lamb cutlets with soy, honey and chilli on hot bean salad", "url": "www_bbc_co_uk_food_recipes_orientallambcutletsw_87032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz green beans, trimmed", "1 tbsp olive oil", "1 garlic clove, crushed", "½ onion, finely sliced", "¼ tsp caster sugar", "½ tsp chilli flakes", "2 lamb cutlets", "½ tsp chilli flakes", "2 tbsp soy sauce", "1 tbsp clear honey", "½ lime, juice only", "½ orange, juice only", "sprig fresh chervil, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, bring a pan of salted water to the boil and blanch the green beans for two minutes. Drain.", "Heat the olive oil in a non-stick frying pan and add the garlic, onion, sugar and chilli flakes and sauté until the onion is soft but not coloured. ", "Add the drained green beans to the pan and fry for a further one minute. Set aside to keep warm.", "For the oriental lamb cutlets, heat a small non-stick frying pan and place the lamb cutlets, fat-side down, into the pan until the fat has melted and is crisp and golden-brown. Turn the lamb cutlets over and brown on the other side, until the lamb is almost cooked through.", "Add the remaining ingredients to the pan, stir well, and fry the lamb for a further two minutes on each side until the juices have reduced to half the volume.", "To serve, place the lamb cutlets on a bed of the warm beans and garnish with chervil."]}, {"isVegetarian": false, "title": "Oriental marinade", "url": "www_bbc_co_uk_food_recipes_orientalmarinade_5313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp groundnut oil", "4 tbsp pale sherry or rice wine", "2 tbsp light soy sauce", "2 cloves garlic, crushed", "2.5cm fresh ginger, finely grated", "freshly ground black pepper"], "serves": "Makes 175ml/6fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all ingredients. Cover the meat, poultry, fish or shellfish and leave for 2-3 hours. "]}, {"isVegetarian": true, "title": "Oriental-style omelette with shiitake mushrooms", "url": "www_bbc_co_uk_food_recipes_orientalomelettewith_86859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp soy sauce", "3 free-range eggs", "1 tbsp olive oil", "100g/3½oz shiitake mushrooms, sliced", "2 choy sum leaves, roughly chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lightly whisk the eggs and soy sauce together in a bowl.", "Heat the olive oil in a non-stick frying pan and sauté the mushrooms until tender. ", "Stir in the choy sum leaves and cook for one minute, until just wilted.", "Pour in the egg mixture and cook gently until the base sets, then turn over and cook for a further minute. Serve immediately."]}, {"isVegetarian": false, "title": "Sticky barbecue chicken wings and drumsticks", "url": "www_bbc_co_uk_food_recipes_orientalstickychicke_67594", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalstickychicke_67594_16x9.jpg", "ingredients": ["6 chicken drumsticks, preferably free-range ", "6 chicken wings, preferably free-range", "2 tbsp clear honey", "3cm/1¼in piece of fresh ginger, peeled and grated", "1 garlic clove, crushed", "1½ tsp Chinese five spice ", "2 tsp soy sauce", "3 tbsp orange marmalade", "½ tsp grated orange zest", "1 tbsp sesame oil"], "serves": "Makes 12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Slash the chicken drumsticks three to four times each with a sharp knife and place in a non-metallic bowl with the chicken wings. Mix together all of the marinade ingredients and pour over the chicken. Leave to marinate for at least 2 hours, or overnight if you can, turning occasionally. ", "Once it has marinated, place the chicken on the barbecue over medium-hot coals and cook for about 20 minutes, brushing with any marinade left in the dish as it cooks. If it's colouring too quickly, move to a cooler part of the barbecue to cook more gently. It's important you cook the chicken all the way through. ", "If you're unsure, pierce a drumstick with a skewer: if the juices are still pink, carry on cooking. Eat as soon as they're cool enough to handle, with the sticky sauce all around your mouth and fingers. Isn't that what barbecues are all about?", "The chicken can also be cooked in the oven for perfect picnic food. Preheat the oven to 200C/400F/Gas 6.", "Transfer the chicken into a roasting tray with a couple of spoonfuls of marinade. Place in the oven for about 50 minutes, turning occasionally and basting with the marinade and juices until thoroughly sticky and golden, adding extra marinade to the tray if necessary. Once the chicken pieces are cooked, eat them when fresh and hot, or leave to cool before packing up for a picnic or packed lunch."]}, {"isVegetarian": false, "title": "Oriental salad cups", "url": "www_bbc_co_uk_food_recipes_orientalsaladcups_88819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp tinned chickpeas, rinsed and drained", "100g/3½oz flaked cooked salmon", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh coriander ", "1 tbsp chopped fresh mint", "½ tsp chilli flakes", "1 tbsp soy sauce", "1 lime, zest and juice only", "1 tsp honey", "1 tbsp sesame seeds", "1 tbsp sesame oil", "4 whole iceberg lettuce leaves", "1 orange, cut into wedges", "1 tbsp chopped fresh parsley leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together in a bowl and stir until well combined.", "Divide the mixture evenly and spoon into four lettuce cups placed on a serving plate. Garnish with the orange wedges and sprinkle over the parsley."]}, {"isVegetarian": false, "title": "Oriental-style citrus mackerel with rocket salad", "url": "www_bbc_co_uk_food_recipes_orientalstylecitrusm_88381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange, juice only", "2 tsp soy sauce", "pinch dried chilli flakes", "1 tsp sesame seeds", "1 mackerel fillet, cut in half", "½ lime, juice only", "2 tbsp chopped fresh coriander leaves", "handful fresh rocket", "1 orange, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the orange juice, soy sauce, chilli flakes and sesame seeds into a frying pan and simmer for 3-4 minutes.", "Add the mackerel and cook for two minutes on each side, or until cooked through. Remove from the heat, squeeze in the lime juice and scatter with coriander.", "Place the rocket leaves into a bowl, pour over the juices from the mackerel pan and stir.", "To serve, pile the rocket salad onto a serving plate. Top with the mackerel and garnish with orange wedges."]}, {"isVegetarian": false, "title": "Oriental-style chicken with guacamole", "url": "www_bbc_co_uk_food_recipes_orientalstylechicken_85425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "2 tbsp sesame oil", "1 lime, juice only ", "1 piece fresh ginger, peeled, grated", "2 red chillies, finely chopped", "1 bunch of coriander, leaves removed, roughly chopped", "2 tbsp soy sauce", "2 tbsp honey", "1 tbsp Worcestershire sauce", "4 boneless skinless chicken breasts, cut into 1cm/½in strips", "sea salt and freshly ground black pepper", "6 spring onions, sliced on the diagonal", "2 tbsp sesame seeds, toasted", "2 ripe avocados, skinned and chopped", "2 limes, juice only", "1 clove garlic, crushed to a paste", "4 tbsp fresh coriander, chopped", "1 red chilli, finely chopped", "1 shallot, finely chopped", "150ml/5fl oz olive oil", "splash Tabasco sauce", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the marinade, place all the marinade ingredients into a bowl and mix to combine.", "For the chicken, place the chicken into the bowl of marinade. Stir well and leave to marinate in the fridge, covered in cling film for at least one hour.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a griddle pan until hot then add the marinated chicken strips. Cook over a high heat for 1-2 minutes, turning once so they brown nicely on both sides.", "Transfer the chicken strips to a baking sheet and place into the oven to cook for a further five minutes, or until completely cooked through. ", "Remove the chicken from the oven and season with coarse sea salt and freshly ground black pepper. Sprinkle with the spring onions and toasted sesame seeds.  ", "For the guacamole, place the chopped avocados into a bowl and add the lime juice.", "Add the remaining guacamole ingredients, mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the chicken onto six plates with a spoonful of guacamole served alongside each."]}, {"isVegetarian": true, "title": "Oriental-style noodle stir-fry", "url": "www_bbc_co_uk_food_recipes_orientalstylenoodles_85589", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ onion, finely sliced", "1cm/½in piece root ginger, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz wild mushrooms", "50g/2oz spinach", "100g/3½oz ready-cooked udon noodles", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan, add the onion, ginger and garlic and stir fry for 1-2 minutes.", "Add the wild mushrooms and spinach and stir fry until softened. Add the noodles, season, to taste, with salt and freshly ground black pepper, and stir well.", "To serve, place the noodle stir-fry into a serving dish and sprinkle with chives."]}, {"isVegetarian": false, "title": "Oriental-style salmon and noodle broth", "url": "www_bbc_co_uk_food_recipes_orientalstylesalmona_85347", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp sesame oil", "200ml/7fl oz hot vegetable stock", "1 tbsp soy sauce", "2 x 50g/1½oz pieces salmon fillet, skinned ", "50g/1¾oz rice noodles", "1 tbsp sesame seeds, to garnish", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive and sesame oil, stock and soy sauce into a saucepan and bring to the boil.", "Reduce the heat to a simmer. Add the salmon pieces to the pan and poach for 3-4 minutes, or until almost cooked through.", "Add the noodles to the pan and remove from the heat. Cover with a lid and leave for a few minutes, until the noodles have softened.", "To serve, pour the broth into a bowl and sprinkle over the sesame seeds and chives."]}, {"isVegetarian": false, "title": "Thai-style beef salad with tagliatelle", "url": "www_bbc_co_uk_food_recipes_orientalthaibeefsala_78245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½ sirloin steak", "½ banana shallot, diced", "100g/3½ mangetout, thinly sliced", "55g/2oz cooked egg tagliatelle", "1 tbsp soy sauce", "1 tbsp oil", "handful fresh mint", "handful fresh basil", "handful fresh coriander", "2 tbsp caster sugar", "splash of water", "½ red chilli, diced", "1 clove garlic, crushed", "1 tsp sesame oil", "2 tsp white wine vinegar", "1 tbsp fresh coriander, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Add the steak and cook to your liking. Remove from the pan and leave to rest.", "Add the shallot to the pan and cook to soften for two minutes.", "Add the mangetout and stir fry for a further minute.", "Add the soy sauce, olive oil and tagilatelle to heat through.", "Stir through the fresh herbs, and put onto a warm plate.", "For the dressing place the sugar and a splash of water into a pan and melt the sugar over a gentle heat.", "Add the remaining dressing ingredients and stir well over the heat for one minute and remove from the heat.", "To serve, cut the steak into thin strips, serve on top of the pasta salad and drizzle over the dressing."]}, {"isVegetarian": true, "title": "Original crème brûlée", "url": "www_bbc_co_uk_food_recipes_originalcremebrulee_81524", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/originalcremebrulee_81524_16x9.jpg", "ingredients": ["500ml/18fl oz double cream", "1 vanilla pod", "100g/4oz caster sugar (plus extra for the topping)", "6 free-range egg yolks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Pour the cream into a saucepan. Split the vanilla pod lengthways and scrape the seeds into the cream.  ", "Chop the empty pod into small pieces, and add them to the cream.  ", "Bring the cream to boiling point, then reduce the heat and simmer gently for five minutes. ", "Meanwhile, in a separate bowl, beat the sugar and egg yolks together in a large heatproof bowl until pale and fluffy.  ", "Bring the cream back to boiling point. Pour it over the egg mixture, whisking continuously until thickened - this indicates that the eggs have begun to cook slightly. ", "Strain the mixture through a fine sieve into a large jug, and then use this to fill six ramekins to about two-thirds full.  ", "Place the ramekins into a large roasting tray and pour in enough hot water to come halfway up their outsides. (This is called a bain-marie.)", "Place the bain-marie onto the centre shelf of the oven and bake for 40-45 minutes, or until the custards are just set but still a bit wobbly in the middle. ", "Remove the ramekins from the water and set aside to cool to room temperature. Chill until needed.", "When ready to serve, sprinkle one level teaspoon of caster sugar evenly over the surface of each crème brûlée, then caramelise with a chefs' blow-torch.", "Set aside to cool for a couple of minutes, then serve."]}, {"isVegetarian": false, "title": "Oriental tuna and radish salad", "url": "www_bbc_co_uk_food_recipes_orientaltunaandradis_85802", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz fresh tuna, sliced", "1 tbsp soy sauce", "1 lime, juice only", "1 tbsp clear honey", "1 tbsp olive oil", "5 radishes, grated", "2 tbsp radish leaves, finely chopped", "1 tsp caster sugar", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the fresh tuna in a bowl with the soy sauce, lime juice and clear honey and leave to marinate for three minutes.", "Drain the tuna. Fry the tuna slices in olive oil in a small non-stick frying pan for 1-2 minutes on both sides. Add the marinade for the last minute to warm through.", "Place all the remaining ingredients in a serving bowl and season with salt and freshly ground black pepper.", "Serve the tuna on top of the salad and drizzle over the juices from the pan."]}, {"isVegetarian": true, "title": "Tomato and basil bruschetta", "url": "www_bbc_co_uk_food_recipes_originalbruscetta_85797", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices ciabatta", "2 tbsp olive oil", "1 garlic clove", "3 tomatoes, chopped", "2 tbsp fresh basil leaves, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle olive oil over the bread and toast it in a hot griddle pan.", "Rub the toasted bread with garlic.", "Mix the chopped tomatoes with the basil and season with salt and freshly ground black pepper.  ", "Spoon the mixture onto the toasted bread and serve on a wooden board."]}, {"isVegetarian": true, "title": "Oriental vegetable kebabs with peanut dressing", "url": "www_bbc_co_uk_food_recipes_orientalvegetablekeb_6552", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalvegetablekeb_6552_16x9.jpg", "ingredients": ["1 red  pepper, de-seeded and cubed", "1 yellow pepper, de-seeded and cubed", "12 cherry tomatoes", "4 salad onions topped, tailed and cut into 5cm/2in lengths", "2 baby courgettes, cut into chunks", "groundnut oil or sunflower oil, for grilling", "4 kebab skewers", "basmati rice, to serve", "2-3 tbsp soy sauce", "1 garlic clove, crushed", "1 tsp sugar ", "pinch of ground ginger", "salt and freshly ground black pepper to taste", "1 tbsp groundnut or sunflower oil", "1 shallot, finely chopped", "½ tsp hot chilli powder", "1 garlic clove, crushed", "1 tbsp dark brown sugar", "110g/4oz unsalted roasted peanuts, ground", "150ml/5fl oz coconut milk", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the vegetables together in a bowl. Combine the marinade ingredients in a separate bowl and pour over the vegetables, making sure the vegetables are evenly coated.", "Cover and leave for two hours, stirring occasionally.", "For the dressing, heat the oil in a small pan and fry the shallot until starting to brown. Add the chilli powder and cook for one minute.", "Stir in two tablespoons of the marinade from the vegetables, the garlic, sugar and ground peanuts. Stir well. ", "Add the coconut milk a little at a time. Bring to the boil and simmer gently for two minutes. Stir in the lemon juice and season to taste.", "Thread the marinated vegetables on to skewers. Brush with a little oil and grill over the coals for about 15 minutes, turning occasionally.", "Gently re-heat the peanut dressing. ", "Serve the kebabs on a bed of rice, drizzled with peanut dressing."]}, {"isVegetarian": false, "title": "Ossobuco of pork with new season garlic and radish", "url": "www_bbc_co_uk_food_recipes_ossobuco_of_pork_with_46639", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 200g/7oz pork shins", "450ml/16fl oz white wine ", "25ml/1fl oz olive oil", "1 large carrot, roughly chopped", "3 sticks celery, roughly chopped", "1litre/1¾ pints chicken stock", "½ bunch fresh thyme", "80g/3oz bacon lardons, diced", "1 bulb new season garlic, broken into cloves", "2 tbsp unsalted butter", "10 leafy breakfast radishes, washed", "3 sage leaves, finely chopped", "2 tbsp curly parsley, chopped", "salt and pepper"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Marinade the pork in 150ml/5½fl oz white wine in a sandwich bag, left in the fridge for at least eight hours and up to 24 hours.", "Preheat the oven to 150C/300F/Gas 2. Drain the pork and discard the wine. ", "Heat a heavy-based, ovenproof frying pan and add the oil. When hot, add the pork shins and fry until golden-brown and caramelised all over. ", "Add the carrot and celery to the pan and cook until coloured. Add the stock, thyme and the remaining wine and bring to the boil. Skim off any impurities that come to the top. ", "Place a lid on top (or cover with aluminium foil) and transfer to the oven. Cook for 2-3 hours, until the pork is very tender. ", "When the pork is cooked, remove it from the cooking stock and keep warm until ready to serve (you can wrap it in cling film to help keep it warm and moist).", "Pass the cooking stock through a sieve and return to the pan. Bring to the boil and cook until the volume of liquid has reduced to a sauce consistency.", "Meanwhile, in a separate frying pan, fry the bacon lardons until crisp and golden-brown. Add the new season garlic and butter and fry for a further 3-4 minutes. Add the radishes and continue to cook until tender.  Add the sage, parsley and three tablespoons of the reduced pork stock. Season to taste with salt and pepper.", "To serve, glaze the pork shins with the reduced stock and serve on top of the vegetables."]}, {"isVegetarian": false, "title": "Osso buco Milanese style (osso buco alla Milanese)", "url": "www_bbc_co_uk_food_recipes_ossobucomilanesestyl_65553", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ossi buchi (veal shin) ", "2 tbsp olive oil ", "plain flour, for dusting ", "salt and pepper ", "30g/1oz butter ", "1 small onion, chopped very finely ", "½ celery stick, chopped finely ", "150ml/5fl oz dry white wine ", "290ml/10fl oz hot stock ", "1 lemon, zest only, grated ", "½ garlic clove, thinly chopped ", "1 tbsp thinly chopped parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Choose a sauté pan large enough to fit all the ossi buchi in one layer. ", "Heat the oil and brown the ossi buchi on both sides after lightly dusting them with flour. Remove them from the pan and reserve. ", "Add the butter to the pan and add the chopped vegetables with a pinch of salt to cook them gently without burning for a few minutes. When the vegetables are soft return the meat to the pan and add the wine. Cook gently until the moisture is almost completely dried out. ", "Add the hot stock, turn the heat down and cover with a tight lid. Cook gently for 1½ hours or until the meat is coming off the bone, turning them every 20 minutes or so. When turning the ossi buchi make sure that you lift them gently with a spatula so that they stay in one piece and the marrow is not lost. ", "When cooked place the ossi buchi on to the serving dish and keep them warm. Mix all the gremolata ingredients together and sprinkle on to the ossi buchi before serving."]}, {"isVegetarian": false, "title": "Ottoman lamb with saffron and rosewater rice pilaf", "url": "www_bbc_co_uk_food_recipes_ottoman_lamb_with_98112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz honey", "2 tbsp pomegranate molasses", "200ml/7fl oz warm water", "500g/1lb 2oz lamb rump, cut into 2cm/1in thin strips", "150g/5½oz lean minced lamb", "½ tsp ground cumin", "3 tbsp fresh oregano, chopped finely, plus four sprigs to serve", "200g/7oz dried figs", "200g/7oz prunes, stones removed", "150g/5½oz whole blanched almonds", "300g/10½oz apple, cored and thinly sliced", "20ml/4 tsp rosewater", "salt and freshly ground black pepper", "40g/1½oz butter", "200g/7oz basmati rice, washed and drained", "200g/7oz whole almonds, blanched", "2g saffron, soaked in 20ml/4 tsp rosewater for two hours", "30g/1¼oz honey", "200ml/7fl oz light vegetable stock"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the Ottoman lamb, mix together the honey, pomegranate molasses and warm water in a bowl. ", "Dry fry the lamb rump strips in a pan over a medium heat. ", "Add the honey mixture and more water if needed and bring to a simmer. Cook very gently until the meat is very soft and almost melting, about 45-60 minutes.", "Meanwhile, place the minced lamb, cumin and chopped oregano into a bowl and mix well. Season with salt and freshly ground black pepper and then shape into very small meatballs, about the size of hazelnuts.", "When the lamb rump is very tender, add the meatballs to the pan with the figs, prunes and almonds. Simmer for 20 minutes over a low heat, then season, to taste, with more salt and pepper. ", "Add the sliced apple and, finally, add the rosewater.", "For the rice pilaf, add the butter to a pan and melt gently, then stir in the rice and cook for a minute or so. ", "Add the remaining ingredients, reduce the heat and simmer gently until the rice is tender and the liquid is all absorbed.", "To serve, pile the rice onto each plate and spoon the lamb alongside. Garnish with a couple of sprigs of oregano."]}, {"isVegetarian": false, "title": "Our paella", "url": "www_bbc_co_uk_food_recipes_our_paella_92328", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/our_paella_92328_16x9.jpg", "ingredients": ["1 tbsp olive oil ", "6 chicken thighs, boned, skinned, cut in half (about 600g/1lb 5oz)", "150g/5oz cooking chorizo, skinned and cut into 5mm/¼in slices", "4 garlic cloves, crushed", "300g/10½oz fresh large tomatoes, halved, seeds removed, flesh grated (then skin discarded)", "1 tsp sweet smoked paprika", "1 lemon, zest only", "1.5 litres/2½ pints hot chicken stock", "3 bay leaves", "2 sprigs thyme", "200g/7oz green beans, cut into short lengths", "500g/1lb 2oz paella rice ", "1 tsp saffron threads, soaked in a little warm water ", "couple handfuls live mussels, cleaned, de-bearded and rinsed (discard any mussels that do not snap shut when tapped)", "12 raw king prawns", "lemon wedges, to serve", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a 36cm/14in paella pan or a very large frying pan set over a medium heat. Season the chicken thighs with salt and freshly ground black pepper and fry for five minutes, turning regularly until lightly coloured. Add the chorizo and cook for a further minute. ", "Add the garlic and cook for a further couple of minutes, then push everything to one side. Add the tomatoes and fry for a few minutes, then mix everything together and sprinkle in the paprika and lemon zest. Pour in all but a large ladleful of the chicken stock and return to the boil. Add the bay leaves, thyme and green beans and season with a little salt.", "When the chicken stock has returned to the boil, turn down to a simmer and sprinkle in the rice, trying to get it into as even a layer as possible. Pour in the saffron and stir – this is the only time you should stir your paella once the rice has been added! Bring to the boil again, then simmer for 5 minutes.", "Turn the heat down and leave the rice to simmer slowly – this should take between 12–15 minutes. If it is getting dry, taste – if still a little too firm (crunchy), add a little more stock. When you are satisfied the rice is al dente, arrange the mussels and prawns over the paella. Cover with a damp teacloth or a lid if you have one and wait for the mussels to steam open and the prawns to turn pink. Serve with lemon wedges."]}, {"isVegetarian": false, "title": "Our special cassoulet", "url": "www_bbc_co_uk_food_recipes_our_special_cassoulet_05208", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/our_special_cassoulet_05208_16x9.jpg", "ingredients": ["½ tsp sunflower oil", "6 sausages, at least 85% meat", "4 celery sticks", "3 carrots", "2 onions, halved and sliced", "6 boneless, skinless chicken thighs (about 450g/1lb)", "2 garlic cloves, crushed", "200g/7oz piece smoked lean gammon, trimmed and cut into 2cm/1in cubes", "2 x 400g/14oz cans chopped tomatoes", "150ml/5fl oz red wine (or water)", "1 tsp caster sugar", "1 tsp dried chilli flakes", "1 bay leaf", "4-5 bushy sprigs fresh thyme", "400g/14oz can cannellini beans in water, drained and rinsed", "400g/14oz can butter beans in water, drained and rinsed", "freshly ground black pepper", "handful fresh flatleaf parsley", "½ large orange, zest only, finely grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Brush a large non-stick frying pan with the sunflower oil, using the tip of a pastry brush. Add the sausages to the pan and cook over a medium heat for 10 minutes, turning every now and then until nicely browned on all sides. ", "Meanwhile, trim the celery and peel the carrots and cut them into diagonal slices about 1.5cm/½in thick.", "Preheat the oven to 180C/350F/Gas 4. ", "Add the onions to the frying pan and cook with the sausages for 6-8 minutes, stirring regularly until softened and lightly browned.", "Trim the chicken thighs of any visible fat - we find a good pair of kitchen scissors does the job well - then cut the thighs in half. ", "Add the garlic and chicken pieces to the pan with the sausages and onions and cook for 3-4 minutes, turning the chicken twice until coloured all over. ", "Transfer everything to a large flameproof casserole dish. ", "Stir in the gammon, celery, carrots, tomatoes, red wine and 300ml/½ pint cold water, then sprinkle over the caster sugar and chilli flakes. Stir in the bay leaf and thyme and season with lots of ground black pepper. ", "Bring the cassoulet to a simmer on the hob, then cover with a lid and transfer to the oven. Cook for 45 minutes.", "Take the casserole out of the oven and stir in all the beans. Cover with the lid again and put the dish back in the oven for another 30 minutes. ", "Just before the cassoulet is ready, prepare the garnish. Chop the parsley roughly and toss with the orange zest in a small bowl. ", "Serve large portions of the cassoulet in deep plates or wide bowls with a good sprinkling of the zesty parsley garnish on each one."]}, {"isVegetarian": false, "title": "Sausage, cranberry and port stuffing", "url": "www_bbc_co_uk_food_recipes_outsideinstuffing_78913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz dried cranberries", "55ml/2fl oz ruby port", "45g/1½oz butter", "1 small onion, chopped", "2 rashers unsmoked green back bacon, cut into strips", "2 garlic cloves, chopped", "450g/1lb sausage-meat", "85g/3oz soft white or brown breadcrumbs", "2 tbsp fresh parsley, chopped", "½ tsp fresh thyme leaves, chopped ", "150g/5½oz peeled, cooked chestnuts, roughly chopped", "1 egg, lightly beaten", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the cranberries in the port for an hour.", "Melt the butter in a pan over a medium heat. Add the onion and bacon and cook gently until the onion is tender and the bacon is cooked.", "Add the garlic and fry for another minute. ", "Remove from the heat to cool slightly, then pour into a bowl.", "Add all of the remaining ingredients, including the cranberries and port, and mix well, adding enough egg to bind to form a thick paste.", "Fry a small knob of the mixture to test for seasoning, and add salt and freshly ground black pepper to the mixture according to taste. The stuffing is now ready to use, to stuff turkey or chicken."]}, {"isVegetarian": false, "title": "Oven-roasted chicken with sumac, pomegranate molasses, chilli and sesame seeds", "url": "www_bbc_co_uk_food_recipes_oven-roasted_chicken_13123", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven-roasted_chicken_13123_16x9.jpg", "ingredients": ["1 whole chicken, about 2kg/4lb 8oz, jointed into 8 pieces", "3 tbsp olive oil", "1 tbsp sesame seeds", "2 tbsp ground sumac", "2 large garlic cloves, crushed or grated", "½ -1 tsp chilli flakes", "1 tbsp tomato purée", "1 tbsp pomegranate molasses", "1 tsp salt"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix all the marinade ingredients together, rub well into the chicken and leave in the fridge for 1 hour.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Put the chicken in a roasting tin, drizzle with the olive oil and scatter the sesame seeds over. Roast in the oven for 30 minutes or until cooked through. (To check the chicken is cooked, pierce at the thickest part of the thigh - the juices should run clear.)"]}, {"isVegetarian": false, "title": "Oven-cooked chicken shawarma", "url": "www_bbc_co_uk_food_recipes_oven-cooked_chicken_04728", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven-cooked_chicken_04728_16x9.jpg", "ingredients": ["12 skinless and boneless chicken thighs", "2 unwaxed lemons", "100ml/3½fl oz olive oil", "4 fat or 6 smaller garlic cloves, finely grated or minced", "2 dried or fresh bay leaves", "2 tsp paprika", "2 tsp ground cumin", "1 tsp ground coriander", "1 tsp dried chilli flakes", "¼ tsp ground cinnamon", "¼ tsp freshly grated nutmeg", "2 tsp sea salt flakes", "lettuce leaves, to serve", "250g/9oz plain yoghurt", "4 tbsp tahini", "1 fat or 2 smaller garlic cloves, finely grated or minced", "fat pinch salt, or to taste", "1 tbsp pomegranate seeds"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Take a large resealable freezer bag and put the chicken thighs in it. Using a fine grater, preferably a microplane, grate in the lemon zest. Squeeze the lemons and add the juice. Pour in the olive oil and add the garlic, then add all the remaining ingredients.", "Squish everything about together, then seal the bag, place it on a plate or in a dish, and refrigerate for at least 6 hours, or up to 1 day.", "When you’re ready to cook, preheat the oven to 220C/200C Fan/Gas 7. Remove the chicken from the fridge and allow it to reach room temperature.", "Tip the contents of the freezer bag into a shallow roasting tin – mine measures 44x34x1.5cm/17x13x½in – and make sure all the chicken thighs are lying flat and not on top of one another (if possible) before roasting in the hot oven for 30 minutes, by which time they should be cooked through (though obviously you must check) and golden on top.", "When the chicken’s more or less cooked, make the sauce simply by combining the yoghurt with the tahini and garlic, stir and salt to taste, and sprinkle with a few pomegranate seeds.", "Line a platter or a couple of plates with crisp lettuce, shredded or torn into pieces, and then top with the piping hot chicken, pouring the oily juices over them, unless you are, for some inexplicable reason, anti-oily-juices. If you wanted to make the chicken go further, you could cut the thighs into chunky slices rather than leaving them whole. And please do add any of the suggested accompaniments, itemized in my introduction."]}, {"isVegetarian": false, "title": "Oven baked pollock with radishes, borage flowers and lardo", "url": "www_bbc_co_uk_food_recipes_oven_baked_pollock_with_72838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb11oz pollock fillet, skinned and pin boned", "sea salt and freshly ground black pepper", "2 banana shallots, finely chopped", "10 white peppercorns", "5 sprigs fresh thyme", "100ml/3½fl oz white wine ", "100ml/3½fl oz white wine vinegar", "50ml/2fl oz double cream", "200g/7oz cold butter, diced", "10 radishes, cut in half lengthways with the tops still on", "200g/7oz girolles mushrooms", "50ml/2fl oz water", "12 borage flowers, for garnish", "8 thin slices lardo"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Sprinkle the pollock with a little sea salt, wrap in cling film then place in the fridge for two hours. ", "Preheat the oven to 190C/375F/Gas 5. Rinse the fish and pat dry with kitchen then cut into four portions and place onto an ovenproof dish lined with a piece of buttered greaseproof paper.", "Place the shallots, peppercorns and thyme into a saucepan with the white wine and the vinegar and simmer over a medium heat until reduced down to a glaze.", "Add the double cream and bring to the boil then reduce the heat and gradually whisk in 150g/5oz of the butter. Season with salt and freshly ground black pepper, pass through a sieve and keep warm.", "Place a knob of butter onto each of the portions of pollock then place in the oven for three minutes. ", "Baste the fish with the melted butter and then return to the oven for another 3-4 minutes or until just cooked.", "While the fish is cooking, wilt the radishes down a frying pan with a little butter and sea salt then set them aside and keep warm.", "Heat a frying pan until hot, add the remaining butter, the girolles and the water and cook until the mushrooms are softened.", "When the fish is cooked, spoon the butter sauce onto warmed serving plates, add the radishes and place the fish on top. Add the girolles and then place a couple of slices of lardo on top of the fish. Garnish with the borage flowers and serve immediately."]}, {"isVegetarian": true, "title": "Oven chips", "url": "www_bbc_co_uk_food_recipes_oven_chips_67210", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oven_chips_67210_16x9.jpg", "ingredients": ["2 large sweet potatoes, scrubbed", "1-2 large Maris Piper or King Edward potatoes, scrubbed", "4 sprigs thyme, leaves only", "1 tsp ground cumin", "1 pinch chilli flakes", "1 tbsp olive oil", "2 tsp hot smoked paprika", "sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Cut the sweet potatoes into thick wedges and put into a large mixing bowl. Cut the white potatoes into slightly thinner wedges (they take longer to cook so need to be slightly smaller for an equal cooking time) and add to the bowl. Add the remaining ingredients and toss until the wedges are evenly coated. Season with sea salt then spread over a non-stick baking tray in an even layer. (Put the sweet potatoes in the centre and the white potatoes round the edge of the tray where it will be hotter.)", "Cook for 20-25 minutes, checking after 10 minutes, shaking and turning occasionally, until cooked through. If the sweet potatoes are cooked before the others are ready then remove them from the oven and leave the rest to cook for longer."]}, {"isVegetarian": true, "title": "Grilled goats' cheese crostini with honey and thyme served on a herb salad", "url": "www_bbc_co_uk_food_recipes_ovenbakedgoatscheese_86203", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white crusty bread", "olive oil", "100g/3½oz goats' cheese", "2 tbsp runny honey", "2 sprigs fresh thyme, leaves only", "handful each fresh chervil, mint, basil", "2 tsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut out two 5cm/2in circles of bread using a pastry cutter. Drizzle each with a little olive oil. Heat a griddle pan and griddle for two minutes on each side, or until golden. ", "Preheat the grill to medium. Place the griddled bread onto a baking sheet, top with the goats' cheese, honey and thyme leaves and place under the grill for 3-4 minutes.", "Place the herbs into a large bowl, add a splash of olive oil and the balsamic vinegar and mix to coat the leaves.", "To serve, place a pile of herb salad onto a serving plate and top with the goats' cheese crostini."]}, {"isVegetarian": false, "title": "Oven-baked risotto carbonara", "url": "www_bbc_co_uk_food_recipes_ovenbakedrisottocarb_68036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenbakedrisottocarb_68036_16x9.jpg", "ingredients": ["225ml/8fl oz carnaroli rice (or other risotto rice)", "125g/4½oz cubetti pancetta or chopped bacon ", "25g/1oz butter ", "1 medium onion, peeled and finely chopped ", "725ml/1¼ pints chicken or vegetable stock ", "75g/3oz finely grated pecorino, plus some extra for sprinkling ", "1 large egg ", "2 large egg yolks ", "1 heaped tbsp crème fraîche ", "salt and freshly milled black pepper "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 150C/300F/Gas 2.", "First of all, in a large, hot frying pan over a medium heat, fry the pancetta or bacon in its own fat for 4-5 minutes, until it's crisp and golden, then remove it to a plate. Next add the butter to the pan, then the onion, turn the heat down to gentle and let the onion soften in the butter for about 5 minutes. Meanwhile, heat the stock in a small saucepan. Then return the pancetta or bacon to the frying pan and, after that, stir in the rice and move it around until all the grains get a good coating of the buttery juices. Now add the hot stock to the rice, along with some salt and freshly milled black pepper. Let it all come up to a gentle simmer, then transfer the whole lot to the warmed dish, stir it once and then bake, without covering, on the centre shelf of the oven and set a timer for 20 minutes.", "When the time is up, gently stir in the Pecorino, folding and turning the rice grains over, then set the timer for a further 15 minutes. Meanwhile, whisk the egg, egg yolks and crème fraîche together, then remove the risotto from the oven and gently stir in this mixture, making sure it is well mixed. Leave the risotto for about 2 minutes, by which time the eggs and crème fraîche will have thickened - but no longer, as it will get too thick. Serve on warm plates with some more Pecorino Romano sprinkled over."]}, {"isVegetarian": false, "title": "Oven-baked sole with a walnut crust served on a herb salad", "url": "www_bbc_co_uk_food_recipes_ovenbakedsolewithawa_86131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 lemon sole, skinned, filleted", "50g/2oz walnuts, finely chopped", "handful each fresh parsley, chervil, basil, dill", "2 tbsp olive oil", "squeeze lemon juice", "salt and freshly ground black pepper", "1 lemon, cut into wedges", "1 tbsp chopped fresh dill"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the oil in an ovenproof frying pan, add the sole fillets and fry on one side for two minutes. Turn the fillets over, sprinkle with the chopped walnuts and transfer to the oven for five minutes.", "For the herb salad, put all the herbs into a large bowl. Add the olive oil, lemon juice and seasoning and mix well. ", "To serve, pile the herb salad onto a plate and top with the sole fillets. Dip one side of the lemon wedges into the chopped dill to garnish."]}, {"isVegetarian": false, "title": "Sweet miso-marinated salmon with soba noodles", "url": "www_bbc_co_uk_food_recipes_ovenbakedsweetmisoma_73596", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenbakedsweetmisoma_73596_16x9.jpg", "ingredients": ["4 salmon fillets, each weighing 110g/4oz", "300g/10½oz soba noodles", "225g/8oz white miso paste", "200g/7oz sugar", "115ml/4fl oz sake", "115ml/4fl oz mirin", "steamed purple sprouting broccoli", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["In a bowl, mix together all the ingredients for the miso marinade. Put the pieces of salmon in the marinade and leave overnight (do not marinate the fish more than two nights, otherwise they will become hard and too salty).", "Preheat the oven to 170C/325F/Gas 3 (to speed up the cooking time the oven can be preheated to 200C/390F/Gas 6).", "Wipe clean the salmon fillets and place them on an oiled baking tray. Bake for 5-7 minutes on each side, or until cooked. ", "To cook the soba noodles, bring a large saucepan of water to the boil and add the noodles as swiftly as possible. Stir to prevent the noodles from sticking together. ", "Stand by with a cup of cold water and when the water returns to the boil and begins to froth up, add the water. Let the water return to boil and drain. Rinse the noodles under cold running water and drain well again. ", "Serve with steamed purple sprouting broccoli and garnish with a lime wedge."]}, {"isVegetarian": false, "title": "Oven-fried chilli chicken", "url": "www_bbc_co_uk_food_recipes_ovenfriedchillichick_86437", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenfriedchillichick_86437_16x9.jpg", "ingredients": ["large knob fresh ginger, peeled and roughly chopped ", "2-3 garlic cloves, peeled and finely chopped", "2-4 green chillies, cut in half with the stalk, seeds and membranes removed ", "1 tsp salt, or to taste", "1 tsp garam masala", "1 tbsp lemon juice", "2 tbsp oil", "800g/1lb 12oz chicken pieces, skinned and pricked all over with a fork", "3 tbsp vegetable oil ", "¼ tsp salt ", "¼ tsp freshly ground black pepper ", "½ tsp ground cumin", "4 slices white bread, processed to crumbs in a food processor", "1-2 large free-range eggs, beaten", "1 lemon, to serve"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, combine all the marinade ingredients in a pestle and mortar and mix well to make a paste. Add the chicken and coat each piece well in the paste. Cover with cling film and leave for a couple of hours or overnight in the fridge. Bring back to room temperature before continuing.", "Preheat the oven to 225C/435F/Gas 7. ", "Pour the oil into a roasting pan large enough to hold all the chicken pieces in one layer. Place the pan on a high shelf in the oven for 15 minutes to heat up.", "Mix the salt, black pepper and cumin into the breadcrumbs. Take the chicken out of the marinade, letting the excess drip off and roll each piece in the crumbs ensuring an even coating on all sides. ", "Dip the chicken pieces into the beaten egg and add a second coating of crumbs. Place them on the baking sheet and cook for 20 minutes. Then lower the oven to 200C/400F/Gas 6, turn the chicken and cook for another 15-25 minutes (depending on the size of the chicken pieces), or until cooked through.", "Place on a serving dish, cut the lemon into wedges and serve."]}, {"isVegetarian": false, "title": "Oven-grilled tiger prawns with chilli yuzu and white miso aioli", "url": "www_bbc_co_uk_food_recipes_ovengrilledtigerpraw_92738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp yuzu koshou paste (available from some Asian supermarkets and specialist retailers)", "1 tsp fresh garlic paste (blend 1 garlic clove with ½ tsp water)", "1 tsp fresh ginger paste (blend 1cm/½in fresh root ginger with ½ tsp water)", "1 tsp chopped fresh coriander", "1 tbsp freshly grated yuzu peel (available from some supermarkets and Asian grocers)", "1½ tsp ready-made chilli and garlic sauce", "1 tbsp mirin (Japanese rice wine, available from some supermarkets and Asian grocers), or water", "4 tbsp vegetable oil", "4 tbsp cooked potato", "4 tbsp saikyo white miso (available from some supermarkets and Asian grocers)", "1 garlic clove, peeled", "1 poached egg", "250ml/9fl oz vegetable oil", "1 tbsp fresh ginger juice (made by grating and squeezing fresh root ginger and collecting the juice)", "1 lemon, juice only", "2 large tiger prawns, preferably Madagascan, or langoustines, shells on, left whole", "1 daikon (mooli), julienned", "20g/¾oz black sesame seeds", "10 lemon balm leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven and grill to 180C/350F/Gas 4.", "For the chilli yuzu paste, blend all of the chilli yuzu paste ingredients except the mirin and vegetable oil in a food processor to a paste. ", "Gradually add the mirin (or water) and vegetable oil and blend again until all of the liquid has been fully incorporated into the mixture. Set aside.", "For the white miso aioli, blend the cooked potato, white miso, garlic and poached egg in a food processor until smooth and well combined. ", "With the motor still running, gradually add the vegetable oil in a thin stream until it is completely incorporated in the mixture. ", "Add the ginger juice and lemon juice and blend again until well combined.", "For the prawns, lay each prawn on its back. Cut the tail meat and shells in half lengthways using a sharp knife or scissors. Remove the tail meat from the shells and chop roughly. ", "Stir the chopped tail meat into the chilli yuzu paste. ", "Return the prawn and chilli yuzu mixture to the shells (there should be two filled shells per person). Place the four prawn halves onto a baking tray and cook for 1-2 minutes.", "Remove the prawn halves from the oven. Carefully stir the prawn and chilli yuzu mixture around, in the shells. Return the prawns to the oven and cook for a further 1-2 minutes, or until the flesh is pink and cooked through. ", "To serve, squeeze the julienned daikon into two cone shapes. Place one cone of daikon onto the end of each of two rectangular serving plates. Sprinkle over the black sesame seeds. Place two filled prawn halves into the centre of each plate. Place the lemon balm leaves on top. Divide the aioli between two dipping bowls. Place them at the other end of the plates."]}, {"isVegetarian": false, "title": "Oven ki murghi (chicken baked with green chillies and onions)", "url": "www_bbc_co_uk_food_recipes_ovenkimurghichickenb_76546", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ovenkimurghichickenb_76546_16x9.jpg", "ingredients": ["2 tbsp tomato purée", "1 tbsp Dijon mustard", "1 tsp ground cumin", "1 tsp garam masala", "1 tbsp lemon juice ", "½ tsp salt ", "¼ tsp chilli powder ", "100ml/3½fl oz single cream", "4 boned, skinned chicken breasts (weighing approximately 560g/1 lb 4oz in total)", "salt and freshly ground black pepper, to taste", "4 tbsp vegetable oil ", "5cm/2in piece cinnamon stick ", "6 cardamom pods, cracked open", "6 cloves ", "140g/5oz onions, cut into fine half-rings", "2.5cm/1in piece fresh root ginger, peeled and cut into fine slices, then into fine strips", "1-3 hot green chillies, cut at a diagonal into fine strips", "½ tsp black or yellow mustard seeds", "1 clove garlic, finely chopped", "cooked basmati rice, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Put the tomato purée in a bowl and mix with one tablespoon of water.", "Add all the remaining sauce ingredients, in the listed order, mixing as you go.", "Spread out the chicken breasts and season them generously on both sides with salt and freshly ground black pepper.", "Put three tablespoons of the oil in a non-stick frying pan and place over a high heat.", "When hot, add the cinnamon, cracked cardamom pods and cloves.", "After ten seconds, add the chicken breasts in a single layer and brown them lightly on both sides. ", "Remove with a slotted spoon and place in a single layer in an ovenproof dish. ", "Add the onions, ginger, and green chillies to the same frying pan and fry them in the residual oil until they are golden-brown in colour.", "Remove with a slotted spoon and spread evenly over the chicken breasts.", "Add the remaining one tablespoon of oil to the frying pan. When hot, add the mustard seeds. As soon as they pop - this will be just a few seconds - add the garlic and stir.", "As soon as the garlic starts to brown, pour in the sauce. ", "As soon as the sauce heats up and starts bubbling, pour it over and around the chicken without displacing the onion mixture.", "Place the ovenproof dish, uncovered, in the oven and bake for 25 minutes.", "Serve immediately with basmati rice."]}, {"isVegetarian": true, "title": "Oven-dried tomatoes", "url": "www_bbc_co_uk_food_recipes_ovendriedtomatoes_72380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 ripe plum tomatoes", "sea salt ", "6 cloves garlic, crushed with a little salt", "8 tbsp chopped oregano", "freshly ground black pepper", "extra virgin olive oil"], "serves": "Makes 1 litre", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to the lowest heat setting.  Slice the tomatoes in half horizontally and scoop out most of the seeds. Salt the insides and turn cut side down on a wire cake tray - leave for half an hour, then rinse and dry. ", "Mix the crushed garlic with the oregano and black pepper. Spread this mix over the cut side of the tomatoes. Place the tomatoes cut side up in a roasting tray and dribble over olive oil into the tray. Cook in a low oven at 100C/200F/Gas 1 for three hours or leave in the sun for up to two days, taking them in at night.", "Place the tomatoes in a sterilized kilner jar and cover with extra virgin oil.  Use in any recipe that requires sun-dried tomatoes."]}, {"isVegetarian": true, "title": "Oven-roasted chips", "url": "www_bbc_co_uk_food_recipes_ovenroastedchips_76872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large potato, peeled and sliced into long chips", "4 sprigs fresh thyme, leaves only", "2 cloves garlic, sliced", "3 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Place the potato chips flat on a baking tray. Sprinkle with the thyme leaves and garlic and season.", "Drizzle with the olive oil and cook into the oven for 15 minutes, or until crisp and golden.", "Serve."]}, {"isVegetarian": true, "title": "Oven-roasted tomatoes with feta", "url": "www_bbc_co_uk_food_recipes_ovenroastedtomatoesw_588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp extra virgin oil", "750g/1½lb ripe plum ", "tomatoes", "1 tsp fresh thyme leaves", "1½ tsp sea salt flakes", "freshly ground black pepper", "450g/1lb good quality Greek feta cheese"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 240C/475F/Gas 9. Oil a shallow roasting tin with 2 tbsp of the oil.", "Cut the tomatoes in half lengthways and lay them cut-side up in the tin.", "Sprinkle over the thyme and some salt and pepper and roast for 15 minutes.", "Reduce the oven temperature to 150C/300F/Gas 2 and roast for a further 1½ hours until they have shrivelled to about half their original size and concentrated in flavour. Leave to cool.", "Arrange the tomatoes and the feta among four plates and drizzle over the remaining olive oil.", "Sprinkle with a bit more sea salt and some black pepper to serve."]}, {"isVegetarian": true, "title": "Oven roasted vegetables with thyme and honey", "url": "www_bbc_co_uk_food_recipes_ovenroastedvegetable_7597", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb potatoes", "450g/1lb parsnips", "450g/1lb carrots", "1 lemon", "225g/½lb red onions", "virgin olive oil", "5 tbsp clear honey", "thyme", "salt and freshly ground black pepper"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Firstly, wash all the root vegetables but don't peel them. Then slice into large chunky slices. Cut the lemon in half and cut the red onions into quarters.  ", "Place all the vegetables into an oven tray and drizzle with olive oil and honey. Add some sprigs of fresh thyme and season well. Place in a preheated oven 180C/350F/Gas 4 for 30-40 minutes to cook all the vegetables. Remove from the oven from time to time to coat all the vegetables in the glaze and serve."]}]