[{"ingredients": ["120g / 4¼oz de guisantes congelados, descongelados y triturados", "Hojas de col rizada de 150 g / 5½ oz, finamente trituradas", "240g / 8½oz de ricota fresca", "3 huevos de gallinas camperas", "50g / 1¾oz de semillas de chia", "1 cucharada de ralladura de limón (aproximadamente 1 limón)", "2 cucharadas de menta fresca picada", "2 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra", "1 pequeño racimo de berros", "4 cuñas de limón"], "method": ["Coloque todos los ingredientes, excepto el aceite, en un bol y mezcle. Sazonar con sal y pimienta y reservar por 20 minutos.", "Para cocinar los buñuelos, caliente un poco de aceite en una sartén grande a fuego medio. Tome aproximadamente 2 cucharadas de la mezcla y déle forma en una hamburguesa, aplátelo ligeramente. Cocine en lotes durante 2-3 minutos en cada lado hasta que estén dorados, agregando más aceite si es necesario.", "Divida los buñuelos entre los platos para servir. Sirva con berros y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_kale_pea_and_ricotta_41792", "title": "Buñuelos de col rizada, guisantes y ricotta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kale_pea_and_ricotta_41792_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["70g / 2½oz de acacia o miel de Manuka", "50g / 1¾oz de ketchup de tomate", "2 cucharadas de salsa de soja ligera", "4 cucharaditas de vinagre de vino de arroz", "10g de raíz de jengibre, pelado y finamente picado", "½ chile rojo, sin semillas y finamente picado", "¼ de chalote, finamente picado", "75g / 2½oz de membrillo (aproximadamente ¼ de membrillo grande), pelado y cortado en cuñas de 2cm / ¾in", "Vientre de cerdo de 500 g / 1 lb 2 oz, todos los huesos extraídos, piel eliminada o anotada", "20 g / oz de mantequilla", "Una pizca de sal marina", "280g / 9¾oz Westland Winter o Red Curled kale leaves", "8 Hojas de col rizada de Nero di Toscana", "150g / 5½oz de puré de membrillo", "1 cucharada de semillas de sésamo, ligeramente tostado"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½.", "Para el vientre de cerdo, en una cazuela con tapa medio, mezcle todos los ingredientes, excepto el cerdo. Agregue el vientre y hilvane con la salsa. Hornee durante 3 horas, rociando con la salsa cada 20 minutos. Cuando esté cocido, el cerdo será firme pero ofrecerá un poco de resistencia cuando se inserte un cuchillo. Levante la carne de cerdo de la cazuela y déjela reposar, ligeramente cubierta con papel de aluminio.", "Cuele los jugos de cocción en una cacerola a fuego alto y lleve a ebullición. Reduzca el volumen del líquido a la mitad para que cubra la parte posterior de la cuchara. Retire del fuego y reserve.", "Para la col rizada, en una cacerola grande con tapa, mezcle 100 ml / 3½ fl oz de agua, la mantequilla y la sal y llevar a ebullición. Agregue ambas variedades de col rizada y cocínelas, tapadas con una tapa, durante 3-4 minutos, hasta que apenas estén cocidas pero aún retengan un poco de mordida y su maravilloso color. Escurrir bien.", "Para servir, una cucharada del puré de membrillo en el centro de cada plato. Agregue la col rizada, luego corte el vientre de cerdo y divídalo entre las placas. Termine con un poco más de puré y esparza sobre las semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_kale_with_sweet_and_sour_21709", "title": "Col rizada con panceta agridulce y puré de membrillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Yogur 250 g / 9 oz", "50ml / 2fl oz de crema individual", "50ml / 2fl oz de jarabe de azúcar", "sifón con dos cargas", "aceite vegetal, para freír poco profundo y profundo", "500g / 1lb 2oz de papas King Edward, peladas y cortadas en cubos grandes", "100g / 3½oz de papas púrpuras o peruanas, en rodajas finas usando una mandolina", "sal marina", "100g / 3½ oz de azúcar granulada", "2 cucharadas de mango en polvo", "1 cucharadita de chile en polvo de Kashmiri o pimentón dulce", "1 cucharada de sal negra (sal negra)", "1 cucharadita de comino tostado en polvo (semillas tostadas y molidas en polvo)", "1 cucharadita de jengibre molido", "1 cucharadita de semillas de hinojo en polvo", "sal al gusto", "½ granada, solo semillas", "1 cucharada de hojas de cilantro picadas", "1 cucharada de hojas de menta, picadas", "berro de bebé", "chaat masala y polvo de chile rojo, mezclados en una coctelera para rociar"], "method": ["Para la espuma de yogur, mezcle el yogur, la crema y el jarabe de azúcar juntos. Coloque la mezcla en una botella de sifón, asegurándose de que la botella esté al menos medio llena, y cargue con dos cartuchos de nitro. Mantenga la botella fría durante dos horas antes de usarla.", "Para el alora chaat Karara, en una sartén caliente un poco de aceite vegetal y fría las papas King Edward en aceite medio caliente hasta que estén casi cocidas. Quítelos de la sartén y colóquelos en una bandeja forrada con papel de cocina. Coloque otra capa de papel de cocina encima y presione sobre ellos.", "Freírlos nuevamente para hacerlos de color marrón claro y crujientes. Retire y drene en una bandeja forrada con papel de cocina.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C / 350 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Freír las rodajas de patata peruanas para hacer patatas fritas. Espolvorear con sal marina y reservar hasta que se necesite.", "Para el chutney picante, mezcle 100 ml / 3½ fl oz de agua con el azúcar en una olla pequeña y llevar a ebullición. Agregue el resto de los ingredientes y cocine a fuego lento durante 4-5 minutos, o hasta que tenga un chutney bastante espeso. Agregue agua para adelgazar, si es necesario.", "Para servir, mezcle las papas fritas calientes con las semillas de granada, cilantro y 2-3 cucharadas de salsa picante. Coloque en un plato en 3-4 racimos pequeños. Pipe la espuma de yogur en el medio y decorar con patatas crujientes de patata, menta y berros. Espolvorear con chaat masala y chile rojo en polvo."], "url": "www_bbc_co_uk_food_recipes_karara_aloo_chaat_crisp_45821", "title": "Karara aloo chaat (ensalada de papas crujiente)", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de jengibre y pasta de ajo", "430ml / 15fl oz yogur natural", "½ cucharadita de cúrcuma molida", "1 cucharada de chile rojo en polvo", "¼ nuez moscada, rallado", "1 cucharadita de azúcar en polvo", "1½ cucharadita de sal", "1 limón, solo jugo", "1kg / 2lb 4oz cordero de la pierna o el hombro, hueso eliminado, cortado en cubos de 2.5cm / 1in", "500g / 1lb 2oz de arroz basmati", "½ lima, solo jugo", "¼ cucharada de sal", "150 g / 5½ oz de ghee, derretido o aceite vegetal", "40 g / 1½ oz pasas", "60g / 2¼ oz de nueces", "4 vainas de cardamomo verde", "5cm / 2in pieza de canela en rama", "3 hojas de laurel", "1 cucharadita de semillas de comino", "2 vainas de cardamomo negro (opcional)", "2 cucharaditas de cilantro molido", "1 cucharadita de sal masala", "½ cucharadita de hilos de azafrán, empapados en 120ml / 4fl oz de leche tibia o agua", "algunas gotas de agua de rosas o kewra", "30g / 1oz de higos secos y albaricoques", "30g / 1oz de arándanos secos", "20 g / ¾oz de hojas de menta fresca"], "method": ["Mezcle los ingredientes del adobo en un tazón grande, agregue la carne y revuelva para cubrir. Cubra y ponga en el refrigerador para marinar durante 30 minutos, o si es posible durante la noche.", "Mientras tanto, lava el arroz en un par de cambios de agua, luego en remojo durante 20 minutos. Ponga a hervir 2,5 litros / 4½ litros de agua en una olla grande. Agregue el arroz, el jugo de limón y la sal y hierva durante 6 minutos, hasta que el arroz esté cocido en dos tercios. Escurra el arroz y extiéndalo en una bandeja para que se enfríe.", "Calienta dos tercios del ghee o aceite vegetal en una cacerola amplia de base pesada. Agregue las pasas y fría por 30 segundos, o hasta que se hinchen, luego retírelas y escurra sobre papel de cocina. Agregue las nueces y fría por 30 segundos, luego retírelas y escurra sobre papel de cocina.", "Agregue las vainas de cardamomo, la canela y la bahía a la cazuela y fría por 30-60 segundos. Agregue las vainas de comino y cardamomo negro. Agregue la carne con su adobo y cocine durante 10-12 minutos a fuego alto, revolviendo ocasionalmente. Agregue el cilantro, garam masala y 250 ml / 9 fl oz de agua y cocine, tapado, a fuego medio durante 1 hora, o hasta que la carne esté tierna y aún quede algo de salsa en la sartén. Agregue un poco más de agua, si es necesario.", "Para ensamblar, extender una capa uniforme del arroz sobre la carne cocida y la salsa, espolvorear la leche de azafrán, agua de rosas, pasas fritas y nueces, arándanos y menta sobre el arroz y el ghee restante.", "Cubra con una tapa bien ajustada y cocine a fuego medio-bajo durante 10-15 minutos, hasta que el plato esté caliente. Reserve por otros 5 minutos, luego abra la olla y sirva."], "url": "www_bbc_co_uk_food_recipes_kashmiri_biryani_14589", "title": "Biryani de Cachemira", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kashmiri_biryani_14589_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1¼ oz de mantequilla, a temperatura ambiente", "70g / 2¾oz de harina natural, más extra para espolvorear", "1 cucharadita de azúcar en polvo de oro (opcional)", "20g / ¾oz de zanahoria rallada", "50 g / 2 oz de piezas de calabaza, asadas", "3 ramitas pequeñas romero fresco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón, mezcle la mantequilla, la harina y el azúcar, si está usando. Frote la mezcla con las puntas de los dedos hasta que se asemeje a pan rallado.", "Agregue la zanahoria rallada y la calabaza tostada con un tenedor.", "Junta la mezcla como masa con las manos y luego coloca la masa sobre una superficie de trabajo ligeramente enharinada.", "Divida la masa en seis piezas de igual tamaño. Enrolle cada pieza en forma de salchicha y colóquela en una bandeja para hornear.", "Aplaste las longitudes de la masa para galletas en formas de zanahoria de aproximadamente 0.5cm / ¼ de grosor, con sus manos.", "Rompa pequeñas ramitas individuales de las ramitas de romero e inserte una en la parte superior de cada galleta para que se parezca a las tapas de las zanahorias.", "Hornee las galletas en el horno durante 15-20 minutos, o hasta que estén crujientes y doradas. Retire de la bandeja de hornear y déjelo a un lado para que se enfríe en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_katys_carrot_and_squash_66459", "title": "Galletas de zanahoria y calabaza de Katy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 uvas rojas sin semillas, cortadas por la mitad", "1 naranja, cortado por la mitad, carne eliminada, caparazón reservado", "50ml / 2oz de agua tibia y hervida", "1 cucharadita de gránulos de gelatina", "100ml / 3½fl oz de jugo de naranja", "2 hojas de menta fresca grandes"], "method": ["Coloque seis mitades de uva en cada mitad de la piel de naranja vacía. Coloque los revestimientos en tazas, una bandeja para muffins o similar, para que no se vuelquen.", "En un recipiente, mezcle el agua tibia y los gránulos de gelatina y revuelva hasta que la gelatina se haya disuelto por completo.", "Agregue el jugo de naranja y mezcle bien.", "Vierta la mezcla de gelatina en cada mitad de la piel de naranja, casi llenando las pieles. Con cuidado, transfiéralo a la nevera y déjelo reposar de 2 a 3 horas, o hasta que se hayan solidificado las gelatinas.", "Doble cada hoja de menta por la mitad y perfore con un palillo de cóctel para hacer velas para los barcos. Justo antes de servir, introduce una vela en cada gelatina."], "url": "www_bbc_co_uk_food_recipes_katys_jelly_boats_23729", "title": "Barcos de gelatina de Katy", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva, más extra para engrasar", "200g / 7oz de tomates picados en lata", "1 hoja de lasaña fresca, cortada por la mitad", "6 hojas de albahaca fresca", "1 rebanada de jamón", "¼ de mozzarella fresca", "100 g / 3½ oz de ricotta"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un plato pequeño con tapa para horno con un poco de aceite de oliva.", "Vierta un poco de tomate picado en el plato y extiéndalo sobre el fondo. Agregue la mitad de la hoja de lasaña y cubra con un poco más de tomate picado, asegurándose de que cubra la hoja de lasaña.", "Rasgue la mitad de las hojas de albahaca y la mitad del jamón en trozos pequeños y espolvoree en la parte superior.", "Rasgue la mitad de la mozzarella en la parte superior, luego coloque pequeñas cucharadas de la mitad de la ricota en la parte superior y sazone con pimienta negra recién molida.", "Repita el proceso de estratificación con los ingredientes restantes: lasaña, tomates, albahaca, jamón, ricotta y mozzarella. Luego rocíe sobre el aceite de oliva.", "Cubra con la tapa y hornee durante 10 minutos, luego retire la tapa y cocine por otros 10-12 minutos o hasta que esté bien cocida y dorada en la parte superior."], "url": "www_bbc_co_uk_food_recipes_katys_lasagne_50975", "title": "Lasaña infantil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de harina común", "40 g / 1½ oz de mantequilla, cortada en cubos, ablandada", "½ cucharadita de extracto de vainilla", "20 g / ¾ de azúcar en polvo", "6 cerezas glacé, picadas"], "method": ["Precaliente el horno 180C / 350F / Gas 4. Cubra una bandeja de hornear con papel resistente a la grasa.", "Coloque la harina y la mantequilla en un recipiente para mezclar y frote con los dedos hasta que la mezcla se asemeje a pan rallado. Agregue la vainilla, el azúcar y las cerezas.", "Aprieta la mezcla en una bola con tus manos. Espolvoree una superficie de trabajo con harina y ruede la masa a un grosor de 0.5cm / ¼ de pulgada.", "Use un cortador de galletas para cortar formas y colocarlas en la bandeja para hornear. Vuelva a enrollar cualquier masa sobrante para hacer más galletas.", "Hornee los bizcochos por 12-15 minutos o hasta que estén pálidos dorados."], "url": "www_bbc_co_uk_food_recipes_katys_shortbread_35940", "title": "Shortbread para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12 mitades de albaricoque en conserva", "250 g / 9 oz de hojaldre confeccionado", "2 cucharaditas de mermelada de albaricoque", "4 cucharaditas de mermelada de frambuesa"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja de hornear con papel resistente a la grasa.", "Pat cuatro mitades de albaricoque seco con papel de cocina y reservar. Picar los albaricoques restantes en trozos pequeños.", "Espolvoree harina en una superficie de trabajo y enrolle la masa en un rectángulo grande. Use un cortador de pasteles de 10 cm / 4 pulgadas (o un tazón pequeño) para cortar cuatro círculos. Use un cortador de pasteles de 8 cm / 3 pulgadas para presionar ligeramente hacia abajo en el medio de cada círculo, luego coloque en la bandeja de hornear.", "Cepille la mermelada de albaricoque en el círculo más pequeño de cada pieza de pastel, luego cubra cada uno con una mitad de albaricoque. Coloque los albaricoques picados alrededor de la mitad, asegurándose de que el borde de la masa esté transparente.", "Rocíe la mermelada de frambuesa.", "Hornee en el horno durante 10-15 minutos, o hasta que la masa se levante y se dore."], "url": "www_bbc_co_uk_food_recipes_katys_tarts_38582", "title": "Tartas de albaricoque para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 fresas, lavadas", "2 kiwis", "2 plátanos", "1 mango", "16 uvas, lavadas", "50g / 1% C2% BEoz% 20buena calidad% 20dark% 20chocolate% 20 (at% 20least% 2070 %% 20cocoa% 20solids)", "25g / 1oz de mantequilla", "125ml / 4fl oz de crema doble", "1 cucharadita de ralladura de naranja", "1 cucharada de jugo de naranja"], "method": ["Comience por preparar la fruta, para las fresas retire el tallo y corte a la mitad si son grandes.", "Para los kiwis, pele con un pelador de patatas o un cuchillo pequeño y afilado. Corta la parte superior e inferior del kiwi y córtalo en 4 pedazos.", "Para el plátano, pele los plátanos y córtelos en trozos. Si está preparando el plátano de antemano, tendrá que rociarlo con jugo de limón o se pondrá marrón.", "Para el mango, coloque el mango de forma que el extremo puntiagudo quede hacia usted y las mejillas a ambos lados. Corta con un pequeño cuchillo afilado hacia abajo para quitar las mejillas de mango a cada lado de la piedra. Puntuación a lo largo de la mejilla con la punta del cuchillo. Gire 90 grados y marque otra vez para hacer un patrón entrecruzado. Los cuadrados deben ser de tamaño de mordida. Suavemente empuje la carne, corte los cubos y tire la piel.", "Ensarta la fruta en brochetas de kebab de madera, alternando la fruta.", "Para hacer la salsa de chocolate, rompa el chocolate y colóquelo en un recipiente resistente al calor. Siente el recipiente sobre una fuente de agua a fuego lento, asegurándose de que la base del recipiente no toque el agua.", "Permita que el chocolate se derrita lentamente, revolviendo ocasionalmente. El chocolate derretido debe ser liso y brillante.", "Caliente todos los ingredientes restantes en una cacerola pequeña hasta que se combinen uniformemente. No dejes que la crema hierva. Retire del fuego y revuelva a través del chocolate derretido. Revuelva hasta que esté bien combinado y la salsa esté suave y brillante.", "Vierta la salsa de chocolate en un tazón pequeño y sirva como salsa para los kebabs."], "url": "www_bbc_co_uk_food_recipes_kazimas_fruity_kebabs_62555", "title": "Kebabs con sabor a fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kazimas_fruity_kebabs_62555_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de semillas de cilantro", "½ cucharadita de semillas de mostaza marrón", "1 cucharada de semillas de comino", "½ cucharadita de chile en polvo (como cayena)", "½ cucharadita de cúrcuma molida", "¼ cucharadita de pimienta negra agrietada", "1 cucharadita de jengibre fresco rallado", "2 dientes de ajo, aplastados", "75ml / 2½fl oz de vinagre blanco", "500ml / 18fl de leche en oz", "1 cebolla, cortada a la mitad", "2 dientes", "2 hojas de laurel", "500 g / 1 libra de filete de abadejo ahumado de 1 oz, pin boned", "500g / 1lb 1 oz de arroz basmati", "2 cucharaditas de cúrcuma", "1 cebolla picada", "1 diente de ajo", "2cm / 1 en pieza de jengibre, finamente picado", "100ml / 3½fl oz de aceite de girasol", "Pasta de curry madras 60g / 2oz (desde arriba)", "1 chile rojo, picado", "1 estrella de anís", "1 hoja de laurel", "400ml / 14fl oz crema", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas", "1 cucharadita de vinagre de vino blanco, para la caza furtiva", "2 cucharadas de perejil fresco picado, para decorar", "50g / 1¾oz de mantequilla, derretida", "1 cornetón de cilantro, para decorar (opcional)"], "method": ["Para la pasta de curry madras, tueste las semillas de cilantro, semillas de mostaza, semillas de comino, chile en polvo y cúrcuma en una sartén seca a fuego medio. Cuando empiecen a reventar y crujir en la sartén, agregue los granos de pimienta y la tostada por un minuto más. Sáquelo del fuego y apártelo.", "Agregue el jengibre y el ajo a la mezcla de especias y colóquelo en una mini batidora o mortero. Agregue el vinagre y mezcle o machaque hasta obtener una pasta suave.", "Para el eglefino y el arroz, coloque la leche y 500 ml / 18 fl oz de agua en una sartén grande. Stud cada mitad de la cebolla con un clavo de olor y laurel, luego agregue a la leche y llevar a ebullición.", "Coloque el eglefino en una lata honda y vierta sobre la leche caliente. Cubra con película adhesiva muy rápidamente para sellar el vapor y el calor. Reserve por aproximadamente 45 minutos.", "Retire la película adhesiva y transfiera el eglefino a un plato. Retire la piel de los peces y los huesos y déjelos gruesos y tan completos como sea posible.", "Lave el arroz varias veces hasta que el agua se aclare. Agregue el arroz, 1 litro / 1¾ de agua y la cúrcuma en una sartén y deje que hierva. Cuando hierva cubra con una tapa y retírela del fuego. Déjelo a un lado durante 20 minutos, luego una el arroz cocido sobre una bandeja para que se enfríe.", "Para la salsa, en una sartén grande fría la cebolla, el ajo y el jengibre en el aceite de girasol hasta que las cebollas estén ligeramente doradas. Agregue la pasta de madrás y cocine durante cinco minutos, luego agregue el chile, el anís estrellado y la hoja de laurel. Agregue 100 ml / 3½ fl oz de agua y cocine a fuego lento hasta que el volumen de líquido se haya reducido a la mitad.", "Agregue la crema doble y cocine a fuego lento durante 10 minutos, luego transfiera a la licuadora y pulse hasta que quede suave. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, transfiera la salsa a una sartén y cocine a fuego lento. Agregue el arroz y vuelva a calentar suavemente. Doble en tres cuartas partes del eglefino y caliéntelo.", "Mientras tanto, llena una olla grande con agua hirviendo y el vinagre de vino blanco, y cocina los huevos a tu gusto.", "En el último minuto, agregue el eglefino restante y el perejil picado y sirva en recipientes calientes con un huevo escalfado encima. Termine con una cucharada de mantequilla derretida, una pizca de berro de cilantro y un poco de sal y pimienta."], "url": "www_bbc_co_uk_food_recipes_kedgeree_33844", "title": "Plato de pescado desmenuzado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla, finamente picada", "55 g / 2 oz de mantequilla", "300g / 10½oz de arroz basmati", "1 cucharadita de polvo de curry madras", "nuez moscada recién rallada", "200ml / 7fl de leche en oz", "Crema doble 110ml / 4fl oz", "300g / 10½ oz de eglefino ahumado naturalmente, (NO teñido) recogido, huesos extraídos y carne cortada en trozos", "sal marina y pimienta negra agrietada", "pequeño racimo de perejil picado", "3 huevos duros, sin cáscara y cortados a la mitad", "buena pizca de Cayena y nuez moscada recién molida (opcional)", "botón de mantequilla", "Cuñas de limón"], "method": ["Cocine la cebolla suavemente en la mantequilla durante unos minutos, luego agregue el arroz.", "Continúe cocinando suavemente y revolviendo, agregando el curry en polvo y la nuez moscada. Después de unos minutos, agregue la leche, la crema y 250 ml / 9 fl oz de agua.", "Cuando la mezcla comience a hervir a fuego lento, agregue el pescado y continúe hirviendo a fuego lento, revolviendo ocasionalmente hasta que el arroz esté cocido. (Es posible que necesite agregar un poco de agua si la mezcla se vuelve seca).", "Sazone, agregue el perejil y revuelva. Agregue los huevos y decore con cayena y nuez moscada si los usa. Servir cubierto con una pizca de mantequilla y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_kedgeree_11358", "title": "Plato de pescado desmenuzado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kedgeree_11358_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "4 chalotes, picados", "1 diente de ajo, picado", "1 cucharadita de polvo de curry suave", "250 g / 8oz de arroz basmati o de grano largo, cocido y escurrido", "500g / 1lb 2 oz de salmón o abadejo ahumado, cocido, pelado y en copos", "Crema doble de 150 ml / 1/4 de pinta", "sal y pimienta negra recién molida", "3 huevos de gallinas camperas, hervidos, cortados en cuartos", "pequeño cilantro fresco puñado, para adornar"], "method": ["Caliente el aceite de oliva en una cacerola, agregue los chalotes y el ajo y sofríalos suavemente hasta que estén suaves pero no coloreados.", "Agregue el polvo de curry y fría por 3-4 minutos.", "Agregue los chalotes y el ajo al arroz cocido y agregue el pescado y la crema en copos. Sazonar con sal y pimienta negra recién molida.", "Para servir, espolvorear en un plato para servir y esparcir los huevos duros descuartizados y las hojas frescas de cilantro sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_kedgeree_88961", "title": "Plato de pescado desmenuzado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de carne picada o cordero de 2 onzas", "1 cebolla, muy finamente picada", "3 dientes de ajo, aplastados", "1 cucharadita de jengibre molido", "1 cucharadita de comino molido", "½ cucharadita de chile en polvo", "1 cucharadita de pimentón", "pequeño puñado de hojas de cilantro fresco finamente picado", "pequeño puñado de perejil de flatleaf fresco finamente picado", "1 yema de huevo", "2 cucharadas de aceite de oliva", "1 cebolla pequeña, finamente picada", "2 cucharadas de puré de tomate", "400g / 14oz pueden cortar tomates, escurridos del exceso de jugo", "2 cucharaditas de miel", "200g / 7oz de guisantes congelados", "4 huevos de gallinas camperas", "perejil fresco picado, para adornar"], "method": ["Para las albóndigas, coloque la carne picada o el cordero, la cebolla, el ajo, las especias, las hierbas frescas, la yema de huevo y un poco de sal y pimienta en un tazón grande.", "Use sus manos para mezclar todos los ingredientes hasta que estén bien combinados. Forma bolitas del tamaño de una nuez y ponlas a un lado.", "Para la salsa, caliente el aceite de oliva en un tagine o cazuela de fondo grueso. Agregue la cebolla y cocine lentamente a fuego lento hasta que esté transparente.", "Aumente el fuego a medio-alto, agregue las albóndigas y dore ligeramente.", "Revuelva el puré de tomate en los tomates picados y luego agregue al tagine con la miel.", "Revuelva suavemente, cubra y cocine a fuego lento durante diez minutos.", "Agregue los guisantes, luego rompa los huevos en la parte superior del guiso, baje la temperatura y cocine con la tapa durante aproximadamente diez minutos, o hasta que los huevos estén cocidos a su gusto.", "Espolvorear sobre el perejil picado y servir."], "url": "www_bbc_co_uk_food_recipes_keftamkawrataginemea_86380", "title": "Kefta mkawra tagine (albóndigas con huevos en la parte superior)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 450g / 1lb", "225g / 8oz de mantequilla, derretida, más mantequilla extra para engrasar", "1 cucharada de jengibre molido", "225g / 8oz de azúcar morena suave y ligera", "6 huevos de gallinas camperas, golpeados", "Crema doble 110g / 4fl oz", "Coágulos de 150g / 5oz, conchas eliminadas, finamente picadas", "50g / 2oz de mantequilla", "4 manzanas, peladas, sin núcleo, finamente picadas", "2-3 cucharadas de azúcar en polvo", "½ cucharadita de canela molida", "200 ml / 7 fl oz crema doble, ligeramente batida, para servir"], "method": ["Para la torta de cobnut, precaliente el horno a 160 ° C / 325 ° F / Gas 2. Engrase una lata de pan de 1 kg / 2 lb 2 onzas con mantequilla.", "En un tazón, mezcle la harina y la mantequilla derretida hasta que estén bien combinados.", "Agregue el jengibre molido, el azúcar y los huevos batidos y bata hasta que estén bien combinados.", "Agregue la crema y mezcle hasta que la mezcla forme una mezcla suave y espesa.", "Agregue los cochinillos picados hasta que estén bien combinados.", "Con una cuchara, vierta la mezcla en la lata de pan preparada, extendiendo suavemente la mezcla en todas las esquinas y sacudiendo la lata para asegurarse de que la mezcla se haya asentado.", "Transfiera la lata de pan al horno y hornee durante 1-1¼ horas, o hasta que la tarta se haya levantado y esté dorada, y una brocheta insertada en el centro de la tarta salga limpia.", "Deja la torta a un lado para que se enfríe un poco en la lata.", "Mientras tanto, para la compota de manzana, caliente la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue las manzanas, el azúcar impalpable y la canela molida y cocínelas durante 4-5 minutos, o hasta que las manzanas se hayan desmenuzado levemente y la mezcla se haya espesado.", "Para servir, corte el pastel en seis a ocho rebanadas (lo mejor es que aún esté caliente). Sirva cada porción con una cucharada de crema batida y una cucharada de compota de manzana caliente."], "url": "www_bbc_co_uk_food_recipes_kentishcobnutcakeand_92135", "title": "Pastel de manzana de garza y ​​compota de manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de jugo de limón recién exprimido", "900g / 2lb de alcachofas de Jerusalén", "2 cucharadas de aceite de girasol", "100 g / 3½ oz de tocino ahumado, cortado en lardons", "50 g / 1¾oz de mantequilla sin sal", "250 g / 8¾oz de cebollas, peladas y finamente picadas", "1.2 litros / 2 pintas de agua hirviendo", "1 cucharadita de sal marina fina", "pimienta negra recién molida", "3-4 cucharadas de perejil de flatillo finamente picado", "picatostes fritos en aceite de oliva"], "method": ["Llene un recipiente con agua fría y agregue el jugo de limón. Pele las alcachofas de Jerusalén con un pelador de patatas e inmediatamente colóquelas en el recipiente de agua con limón.", "Mientras tanto, caliente el aceite en una sartén grande. Agregue el tocino y fría por 4-5 minutos o hasta que esté dorado y crujiente, de vez en cuando revolviendo con una cuchara de madera. Retire una cucharada de los lardons de tocino y reserve para decorar.", "Agregue la mantequilla a la sartén en la que se cocinó el tocino. Cuando la mantequilla esté espumosa, agregue las cebollas y revuelva. Reduzca el calor y sude por 7-8 minutos.", "Corta finamente las alcachofas y agrégalas a la sartén.", "Agregue el agua a la sartén. Sazonar, al gusto, con sal y pimienta negra recién molida. Vuelva a poner la mezcla a ebullición, luego cocine a fuego lento durante 35 minutos o hasta que las alcachofas estén tiernas.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, divida la sopa por igual entre seis cuencos. Adorne con perejil picado, la cucharada reservada de crotones de tocino y aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_kentartichokeanddryc_91092", "title": "Kent alcachofa y sopa de tocino ahumado curado en seco con croûtons de aceite de oliva y tocino crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de gambas de tigre crudas, sin cáscara y sin nervaduras", "1 cucharada de jugo de limón fresco", "3 cucharadas de aceite de girasol", "1 cebolla rallada", "½ cucharadita de cúrcuma molida", "6 vainas completas de cardamomo, ligeramente trituradas para partir abiertas", "1 cucharadita de chile en polvo", "1 ramita de canela", "3 dientes de ajo, finamente rallados", "Jengibre de raíz de 2.5cm / 1in, finamente rallado", "pequeño racimo de cilantro fresco", "Crema de coco 175ml / 6 fl oz", "sal", "arroz hervido o chapatis, para servir"], "method": ["Mezcle los langostinos con el jugo de limón en un plato poco metálico no metálico y déjelos marinar mientras prepara la salsa. Caliente una sartén de base pesada con dos cucharadas de aceite y luego agregue la cebolla. Cocine por 2-3 minutos hasta que estén suaves pero no coloreados, luego agregue la cúrcuma, las vainas de cardamomo y el chile en polvo. Cocine por 1-2 minutos hasta que esté fragante, revolviendo constantemente.", "Revuelva el aceite restante en la sartén con la canela, el ajo y el jengibre. Cocine por otros 1-2 minutos hasta que el ajo y el jengibre se hayan ablandado y estén bien cocidos.", "Reserve unas cuantas ramitas de cilantro para decorar y mezcle el resto con la crema de coco en un mini procesador de alimentos.", "Mezcle en la sartén con la mezcla de cebolla y especias hasta que estén bien combinados, luego lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 1-2 minutos, luego mezcle las gambas marinadas y sazone con sal. Continúe cocinando a fuego lento durante 1-2 minutos hasta que las gambas estén recién cocidas y tiernas, revolviendo constantemente.", "Adorne el curry con las ramitas de cilantro reservadas y sirva con arroz o chapatis."], "url": "www_bbc_co_uk_food_recipes_keralakingprawnandco_75325", "title": "Kerala king gambas y coco al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/keralakingprawnandco_75325_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de cúrcuma molida", "2 cucharadas de yogur al estilo griego, ligeramente batido", "Pollo entero de 800 g / 1 lb 12 oz, pelado y articulado", "3 cucharadas de aceite vegetal", "2 chiles verdes de ojo de pájaro, cortados longitudinalmente", "1 cebolla (aproximadamente 170 g / 6 oz), en rodajas finas", "2 tomates (aproximadamente 140 g / 5 oz de peso total), puré hasta obtener una pasta homogénea", "100ml / 3½fl oz de leche de coco gruesa", "un pizca de escamas de chile rojo o cilantro fresco picado, para adornar", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "Jengibre fresco de raíz de 2.5cm / 1 en pieza, aproximadamente picado", "8 dientes de ajo, toscamente picados", "1 cucharada de semillas de cilantro", "4 chiles secos de Cachemira (u otros chiles rojos suaves secos)", "2 semillas de hinojo tsp apiladas", "½ cucharadita de pimienta negra", "Corteza de casia de 4cm / 1½ in piece", "5 vainas de cardamomo verde, solo semillas", "1 cucharadita de semillas de comino, tostadas y molidas gruesas", "½ cucharadita de sal negra", "Una pizca de sal marina", "30 g / 1 oz de hojas de menta fresca", "Hojas y tallos de cilantro de 10g / ½ oz", "150 g / 5½ oz de yogur al estilo griego", "Jengibre fresco de raíz de 2.5cm / 1 en pieza, aproximadamente picado", "2 cebollas tiernas, picadas", "500g / 1lb 2oz de arroz basmati cocido en frío", "1 cucharada de aceite vegetal", "1 guindilla verde, picada", "½ lima, ralladura y jugo", "2 cucharadas de cilantro fresco finamente picado"], "method": ["Para el Keralan kozhi kuttan, coloca la cúrcuma, el yogur y una pizca de sal en un bol y mezcle bien. Agregue las piezas de pollo y deje marinar durante una hora.", "Mientras tanto, haz la pasta de curry. Coloque una sartén a fuego lento y agregue el aceite, seguido del jengibre y el ajo. Freír durante aproximadamente un minuto, luego agregar los ingredientes restantes de la pasta y freír durante 5-6 minutos, o hasta que estén ligeramente coloreados. Deje enfriar, luego transfiera a una licuadora, agregue 3-5 cucharadas de agua y rellene hasta obtener una pasta fina. Dejar de lado.", "Para terminar el Keralan kozhi kuttan, coloque una sartén antiadherente de base pesada a fuego medio y agregue el aceite vegetal. Cuando esté caliente, agregue los chiles y déjelos chisporrotear por unos 10 segundos. Agregue la cebolla y una pizca de sal y fría por 10-12 minutos, o hasta que se dore. Agregue los tomates en puré y cocine durante 3 minutos. Agregue la pasta de especias y fría por 4-5 minutos, revolviendo bien, hasta que la salsa se espese un poco. Aumente el fuego y agregue las piezas de pollo marinado, revolviendo bien para cubrirlas con pasta de especias. Freír durante 4 minutos, o hasta que estén ligeramente coloreados. Agregue 100 ml / 3½ fl oz de agua y sazone con sal y pimienta. Cubra con una tapa y cocine a fuego lento durante 25 minutos, o hasta que el pollo esté bien cocido. Agregue la leche de coco, mezcle bien y cocine a fuego lento durante 4-7 minutos o hasta que la salsa se espese un poco.", "Para la raita, en un tazón pequeño, mezcle las semillas de comino trituradas, sal negra y sal marina. Dejar de lado.", "Agregue la menta, el cilantro, el yogur, el jengibre, las cebolletas y 5 cucharadas de agua a la licuadora. Mezcle hasta obtener una pasta suave, luego transfiera a un recipiente y espolvoree sobre la mezcla de especias.", "Para el arroz de lima y cilantro, sazone el arroz cocido con sal y pimienta. Tenedor ligeramente para aflojar los granos y reservar.", "Coloque una cacerola grande a fuego medio y agregue el aceite. Cuando esté caliente, agregue el chile picado y fría por unos segundos. Agregue el arroz y caliente, revolviendo bien. Agregue la ralladura de lima y el cilantro fresco. Mezcle bien y apague el fuego. Revuelva a través del jugo de limón.", "Para servir, decore el curry con hojuelas de chile o cilantro y sirva en tazones junto con el arroz y la raita."], "url": "www_bbc_co_uk_food_recipes_keralan_kozhi_kuttan_64529", "title": "Keralan kozhi kuttan con lima y cilantro arroz y menta raita", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de coco o aceite vegetal", "10 hojas frescas de curry", "1 cebolla grande, en rodajas", "Jengibre fresco de raíz de 2.5cm / 1in, cortado en finas tiras", "4 chiles verdes, divididos abiertos a lo largo", "Mejillones de 500g / 1lb 2oz en el caparazón, limpiados", "½ cucharadita de cúrcuma molida", "½ cucharada de harina de arroz", "500ml / 18fl oz de leche de coco extra gruesa", "1 cucharadita de sal", "250g / 9oz de gambas crudas peladas y desveladas", "Filete de abadejo ahumado sin teñir 200 g / 7oz, cortado en dados en trozos de 1 pulgada", "200g / 7oz limpios tubos de calamar o jibias, anotados", "375g / 13oz de hojaldre de mantequilla - discos de 3 mm / 1 / 8in de espesor, discos de 4 x 16 cm de diámetro", "2 huevos, ligeramente batidos", "1 cucharada de semillas de cebolla negra", "115g / 4oz de semillas de fenogreco germinadas", "115g / 4oz de frijol moong germinado", "1 tomate, sin semillas, cortado en ½ cm / ¼ en dados", "½ pepino, sin semillas, cortado en ½ cm / ¼ en dados", "1 chile verde (opcional), finamente picado", "½ limón, solo jugo", "½ cucharadita de sal", "½ cucharadita de azúcar", "2-3 cucharadas de aceite de oliva", "10 hojas frescas de curry", "2 chiles verdes, abiertos a lo largo"], "method": ["Para el pastel, precaliente el horno a 200C / 400F / Gas 6.", "Primero prepara la salsa. Caliente el aceite en una sartén grande, agregue las hojas de curry, la cebolla, el jengibre y los chiles verdes y cocine, revolviendo, hasta que la cebolla esté suave.", "Agregue los mejillones y la cúrcuma, seguido de la harina de arroz.", "Mezcle la harina de arroz en forma pareja, luego agregue la leche de coco y la sal y cocine a fuego lento.", "Cocine por 2-3 minutos, hasta que los mejillones se abran y la salsa comience a ponerse brillante.", "Retire los mejillones y saque la carne de la cáscara, descartando las cáscaras. Coloque los mejillones a un lado, y continúe cocinando la salsa hasta que espese y se vuelva muy espesa.", "Retire la salsa del fuego, deje enfriar y mezcle los mariscos crudos y la carne de mejillón a través de la salsa.", "Divida el relleno de la empanada en partes iguales entre cuatro sartenes de hierro fundido poco profundas, adorne con los chiles verdes y las hojas de curry y cubra con el disco de hojaldre.", "Cepille los pasteles con huevo, espolvoree con semillas de cebolla negra y hornee en el horno durante 15 minutos, o hasta que el pescado esté bien cocido y la masa esté crujiente y dorada.", "Para la ensalada, mezcle todos los ingredientes para la ensalada.", "Sirve el pastel con la alholva germinada y la ensalada de lentejas moong al lado."], "url": "www_bbc_co_uk_food_recipes_keralan_seafood_pie_15063", "title": "Pastel de marisco de Keralan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "1 cucharadita de semillas de mostaza", "2.5cm / 1 en jengibre fresco, pelado y finamente picado", "1 diente de ajo, finamente picado", "3-4 hojas de curry, finamente trituradas", "1 chile verde, picado", "1 pequeña guindilla roja seca, remojada en agua, luego escurrida y finamente cortada", "2 chalotes pequeños, finamente picados", "75g-110g / 3oz-4oz de coco fresco, rallado", "½ cucharadita de chile rojo en polvo", "¼ cucharadita de cúrcuma molida", "Carne de cangrejo blanco de 200 g / 7 oz, recogido y todo el caparazón eliminado", "1 tomate de ciruela, sin semillas, finamente picado", "1 cucharada de hojas frescas de cilantro, picadas", "sal y pimienta negra recién molida", "1 yema de huevo de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza Dijon", "150ml / 5fl oz de aceite de colza", "2 dientes de ajo, finamente picados", "2 chiles verdes, finamente picados", "3 cucharadas de hojas de cilantro, más o menos picadas", "½ lima, solo jugo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "4 rebanadas finas de pan blanco, cortado en cubos", "4 huevos duros, cortados aproximadamente a ½cm / 0.2in", "250 g / 9 oz de lechuga Cos o cualquier lechuga de hoja grande, cortada en piezas de 2.5 cm / 1 in", "pequeñas hojas de cilantro fresco, toscamente picadas"], "method": ["Para el cangrejo Keralan, asegúrese de que todos los ingredientes estén preparados antes de comenzar a cocinar. Coloque el aceite en un wok o kadhai (un wok de hierro tradicional de la India) y suba el fuego hasta que se forme una bruma. Agregue un par de semillas de mostaza para comprobar si crujen de inmediato; tenga cuidado al hacerlo, ya que saldrán al golpear la sartén.", "Cuando el aceite esté listo, agregue cuidadosamente las semillas de mostaza y, si es posible, cubra la olla con una tapa por unos momentos para evitar que las semillas salgan despedidas y lo golpeen.", "Tan pronto como el chisporroteo se apaga y el aroma se asemeja al olor a asar, agregue el jengibre, el ajo, las hojas de curry y los chiles verdes y rojos.", "Tan pronto como el ajo se ponga pálido, pero no dorado profundo, agregue los chalotes y continúe freír hasta que estén blandos.", "Agregue el coco y fría por 3-4 minutos. Agregue el chili en polvo y la cúrcuma molida.", "Freír durante 30 segundos más antes de agregar la carne de cangrejo, mezclándola bien con una cuchara de madera durante un minuto más.", "Agregue el tomate y el cilantro y mezcle para combinar. Agregue sal y pimienta negra recién molida, al gusto.", "Para la ensalada Currimbhoy, comience por hacer la mayonesa. Coloque la yema de huevo, el vinagre y la mostaza en un procesador de alimentos y mezcle hasta que quede pálido y cremoso.", "Con el motor en funcionamiento, vierta gradualmente el aceite en un flujo constante hasta que la mayonesa se haya espesado.", "Mida 200 g / 7 oz de la mayonesa en un tazón grande (cualquier mayonesa restante debe cubrirse y colocarse en el refrigerador; no la guarde por más de dos días).", "Agregue el ajo, los chiles, las hojas de cilantro y el jugo de lima a la mayonesa en el tazón y mezcle bien. Sazonar con sal y pimienta negra recién molida y dejar de lado.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva. Agregue el pan, sazone con sal y pimienta negra recién molida y fría por 2-3 minutos o hasta que estén dorados y crujientes por todos lados.", "Retire el pan frito (croûtons) de la sartén y escurra sobre papel de cocina.", "Agregue los huevos picados y las hojas de lechuga a la mayonesa con sabor y mezcle: tenga cuidado de no mezclar demasiado ya que la lechuga se debilitará muy rápidamente.", "Agregue la mitad de los croûtons al tazón mientras mezcla, reservando el resto para adornar.", "Para servir, amontone la ensalada en un plato, cubra con más croûtons y hojas de cilantro y coloque el cangrejo al lado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_keralancrabwithcurri_87982", "title": "Keralan cangrejo con ensalada Currimbhoy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]