[{"isVegetarian": true, "title": "Cocktail nachos", "url": "www_bbc_co_uk_food_recipes_cocktailnachos_73331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g/3½oz cheddar cheese", "50g/2oz pickled green jalapeno chillies", "20 salted corn tortilla chips", "2 tbsp chilli salsa", "fresh coriander leaves, for serving"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Coarsely grate the cheddar cheese and finely slice the jalapeno chillies. ", "Lay out the unbroken corn chips on a baking tray, and top each one with a little grated cheese and two slices of jalapeno chilli.", "Bake for 5-10 minutes or until the cheese melts and the corn chips are hot and crisp.", "Add a dab of chilli salsa and a coriander leaf, and serve hot."]}, {"isVegetarian": true, "title": "Cocoa cinnamon bread and butter pudding with butterscotch pears, Chantilly cream and a warm chocolate sauce", "url": "www_bbc_co_uk_food_recipes_cocoa_cinnamon_bread_and_32214", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 loaf sliced white bread", "110g/4oz unsalted butter, softened", "300ml/10fl oz full-fat milk", "300ml/10fl oz double cream", "1 drop vanilla extract ", "1 tsp ground cinnamon", "20g/1oz cocoa powder", "5 free-range eggs", "100g/3½oz caster sugar", "100g/3½oz caster sugar", "100g/3½oz unsalted butter", "100ml/3½fl oz double cream", "2 pears, core removed and sliced  ", "200ml/7fl oz double cream", "25g/1oz icing sugar", "1 drop vanilla extract ", "50g/2oz cocoa powder", "100ml/3½fl oz water", "2 tsp double cream"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cocoa bread and butter pudding, remove all the crusts from the bread and spread one side of each slice with butter. Cut into triangles and lay them, overlapping, in the bottom of an ovenproof dish lightly greased with butter.", "Place the milk, cream, vanilla, cinnamon and cocoa powder in a large saucepan and warm through.", "Put the eggs and sugar in a large bowl and whisk until pale and doubled in size.", "Gradually add the liquid to the eggs whisking all the time. Pour back in to the pan and gently cook until the custard is thick enough to coat the back of a spoon.", "Pour the custard mixture over the bread and leave to sit for 30 minutes, then bake in the oven for 20-30 minutes.", "For the butterscotch roasted pears, place the sugar and butter in a medium frying pan and heat until melted.", "Add the cream and cook for 3-4 minutes, then add the pears and cook for a further 10 minutes.", "To make the Chantilly cream put in the cream, icing sugar and vanilla extract in a large bowl and whisk until stiff peaks form when the whisk is removed.", "For the chocolate sauce, place the cocoa and water in a small saucepan and cook until it thickens. Add the cream. ", "To serve, place a square of the pudding in bowl, pour over the sauce and top with a spoonful of the cream."]}, {"isVegetarian": true, "title": "Coconut-curried vegetables", "url": "www_bbc_co_uk_food_recipes_coconut-curried_82286", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "1 small red onion, peeled, finely sliced", "1 small aubergine, trimmed, diced into 2cm/¾in cubes", "1 tbsp garam masala", "1 tsp ground cumin", "1 tsp coriander seeds", "150g/5oz okra", "150g/5oz cauliflower florets", "75g/3oz frozen peas", "1 tsp ground turmeric", "50g/2oz dried coconut, grated", "½ vegetable stock cube, dissolved in 200ml/7fl oz water", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of vegetable oil in a large lidded saucepan over a medium heat. Add the red onion, aubergine and garam masala and fry until starting to brown, about 8-10 minutes.", "Dry fry the cumin and coriander seeds in a small frying pan until fragrant, then add to the onion mixture and stir well.", "Add the remaining ingredients, stirring well to combine, then cover the pan with a lid.", "Bring the mixture to a simmer and cook for 15-20 minutes, stirring occasionally, until the cauliflower florets are tender. Season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": true, "title": "Coconut and citrus tart with cherry, pineapple, raspberry and coconut fruit salad", "url": "www_bbc_co_uk_food_recipes_coconut_and_citrus_tart_19669", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 readymade (22cm/8½in) pastry case ", "25g/1oz fresh coconut, finely grated, to decorate", "small fresh mint leaves, to decorate", "200g/7oz caster sugar", "370ml/13fl oz double cream", "3 free-range eggs, beaten", "2 limes, juice and finely grated zest", "2 unwaxed lemons, juice and finely grated zest", "200g/10½oz desiccated coconut", "100g/3½oz fresh cherries, pitted", "100g/3½oz raspberries", "100g/3½oz pineapple, cut into bite-sized pieces", "100ml/3½fl oz vanilla syrup", "2 dashes angostura bitters"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking paper and put the pastry case on top. ", "Beat all the tart filling ingredients together and pour into the pastry case. Bake for 40–50 minutes, or until set. ", "To make the fruit salad, put all the fruit in a large bowl and stir in the vanilla syrup and angostura bitters. ", "Serve the tart sliced, with the fruit salad on the side, decorated with the coconut and mint leaves. "]}, {"isVegetarian": false, "title": "Coconut and lime traybake", "url": "www_bbc_co_uk_food_recipes_coconut_and_lime_56467", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 limes, juice and zest only", "1 tsp ground cinnamon", "1 tsp ground mixed spice", "½ tsp ground cloves", "100g/3½oz desiccated coconut", "230g/8oz self-raising flour", "2 tsp baking powder", "230g/8oz golden caster sugar", "230g/8oz butter", "70g/2½oz coconut butter", "4 large free-range eggs, lightly whisked", "50g/1¾oz unsalted butter", "175g/6oz icing sugar", "250g/9oz mascarpone cheese", "green fondant icing", "brown fondant icing", "chocolate beans", "1 lime, zest only"], "serves": "Makes 1 x 12-slice traybake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C Fan/Gas 4 and line a 30x23x4cm/12x9x1½in baking tin with two pieces of aluminium foil, overlapping in the middle.", "In a bowl, mix the lime juice, zest, the spices and desiccated coconut together and leave to soak.", "Sift the flour and baking powder into a separate large bowl and set aside.", "Put the sugar, butter and coconut butter in a food processor and pulse until smooth. Transfer to the bowl of dry ingredients and mix until well combined. Fold in the eggs and soaked coconut mixture.    ", "Spoon the mixture into the prepared tin and bake for about 30 minutes, or until a skewer inserted into the middle comes out clean.", "Leave to cool in the tin for about 5 minutes then turn out onto a wire rack. Remove the foil and leave to cool completely.", "For the icing, put all the ingredients into a food processor and pulse until smooth.", "When the cake is completely cool, spread the icing all over the top. Trim the cake and cut into 12 equally-sized squares.", "For the decoration, roll out both coloured fondants.  Use the green to cut out 48 ‘leaves’ and the brown to cut out 12 ‘trunks’.", "Decorate each square of cake with the fondants to make a palm tree ‘trunk’ and ‘leaves’. Use the chocolate beans to represent coconuts and finish by sprinkling over a little lime zest."]}, {"isVegetarian": true, "title": "Coconut and sticky rice pudding with lime and papaya salad", "url": "www_bbc_co_uk_food_recipes_coconut_and_sticky_rice_52999", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz Thai sticky rice", "1 x 400ml/14fl oz can coconut milk ", "¼ tsp salt", "50g/1¾oz palm sugar, roughly chopped if from a block", "5 kaffir lime leaves", "1 ripe medium papaya, seeds removed, peeled, cut into 5mm/¼in neat slices", "2 limes, zest and juice only", "4 sprigs mint, for garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Soak the rice in 300ml/10fl oz of water for at least 30 minutes, but for up to four hours before using. ", "Drain the rice and wash thoroughly.", "Line a bamboo steamer (with a lid)  with either greaseproof paper, a banana leaf or a clean sheet of muslin. If using greaseproof paper or a banana leaf, pierce some holes using a skewer (don’t make the holes too large, but you do want them to allow the steam through).", "Place about 425ml/¾ pint of water (5cm/2in depth) into a saucepan or a wok and place the rice in the steamer. Put on the lid, bring the water to the boil and then reduce the heat to low-medium and steam for about 20 minutes.", "In the meantime, add the coconut milk, salt, palm sugar and kaffir lime leaves to a saucepan. Warm through over a medium heat - do not boil. ", "Stir frequently for a good 5-7 minutes to infuse the flavours. Once infused, remove from the heat.", "Arrange the prepared papaya onto four plates or a suitable serving dish and pour over the zest and juice of the limes.", "Once the rice is cooked, put it into a mixing bowl and gradually add three-quarters of the infused coconut milk. Reserve the remaining quarter.  ", "Mix well and leave to cool for 10-15 minutes. Transfer the rice into individual serving bowls or a suitable dish and drizzle over the remaining infused coconut milk.", "Serve the papaya salad along with the rice. Garnish with a sprig of mint if liked."]}, {"isVegetarian": false, "title": "Coconut chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_coconut_chicken_noodle_20610", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_chicken_noodle_20610_16x9.jpg", "ingredients": ["1 nest medium egg noodles", "3 spring onions, chopped", "200ml/7fl oz coconut milk", "200ml/7fl oz chicken stock made with ½ a stock cube", "1-2 chicken thighs or drumsticks, skin removed", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the kettle. Break up the noodles and put into a bowl. Cover with boiling water, set aside, and allow the noodles to soften completely - about 10 minutes. ", "Meanwhile, add the white part of the spring onion to a saucepan with the coconut milk, stock and a twist of black pepper. Bring to a simmer, add the chicken thighs and cook for 15-20 minutes. Don’t boil it or the chicken will be tough and the coconut milk will separate (If you use boneless chicken thighs simmer for 8-10 minutes).", "Remove the chicken from the saucepan and check that it is completely cooked. If it’s pink near the bone, return it to the stock for another 5 minutes. When cooked, set the chicken thighs aside to cool slightly.", "Drain the noodles and add them to the coconut liquid. Chop the chicken from the bone and stir into the soup with the green part of the spring onion. Season with salt and black pepper."]}, {"isVegetarian": true, "title": "Coconut pancakes with mango and passion fruit curd", "url": "www_bbc_co_uk_food_recipes_coconut_pancakes_with_70485", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½ plain flour", "15g/½oz caster sugar", "pinch of salt ", "4 medium free-range eggs", "350ml/12fl oz full-fat milk", "2 tbsp desiccated coconut, toasted", "butter, for frying", "8 large free-range egg yolks", "120g/4½oz caster sugar", "160ml/5½fl oz mango juice", "110ml/3½fl oz passion fruit juice", "250g/9oz unsalted butter", "fresh pineapple, thinly sliced", "fresh mint, leaves picked", "dusting of icing sugar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, combine the flour, sugar and salt together, then mix in the eggs with a whisk. Add the milk gradually to avoid any lumps, then stir in the toasted coconut. Leave to rest while you make the curd.", "To make the curd, whisk the eggs, sugar, mango and passion fruit juices together in a saucepan. Place over a medium heat and stir continuously until the mixture thickens - do not boil. Whisk in the butter, cut into small pieces. Cover and leave to cool. ", "To cook the pancakes, add a smear of melted butter to a non-stick pan and ladle in some batter, swirling around to coat the pan - it might take one or two test pancakes before you’ve got the amount of batter just right. Cook each pancake on both sides until golden-brown and then remove to a plate while you cook the next pancake.", "To assemble, spread each pancake with the fruit curd and then roll up into cigars. Serve with fresh pineapple, mint leaves and a dusting of icing sugar."]}, {"isVegetarian": true, "title": "Coconut kisses with ginger filly Chantilly and a strawberry slice", "url": "www_bbc_co_uk_food_recipes_coconut_kisses_with_93280", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_kisses_with_93280_16x9.jpg", "ingredients": ["100g/3½oz desiccated coconut", "200g/7oz caster sugar", "4 free-range egg whites", "200g/7oz low-fat cream cheese", "2½ tsp icing sugar", "1 vanilla pod, seeds only", "2 knobs stem ginger (from a jar in syrup), really finely diced, plus 1 tbsp of the ginger syrup", "8 medium-large strawberries, hulled, pointed ends trimmed and each one cut into 3 discs"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringues, preheat the oven to 110C/225F/Gas ¼ (80C fan). Line two large baking trays with parchment paper and set aside.", "Heat a large frying pan (without any oil in it) over a medium heat and toast the coconut for a few minutes until golden-brown and toasty. Tip into a bowl and set aside. ", "Meringues can be made by hand but it does take a long time. Using a hand whisk or a freestanding mixer makes the whole thing far more enjoyable. Put the sugar and one of the egg whites into a clean bowl and whisk for about 30 seconds on a high speed. Add another egg white and whisk for about two minutes more. The mixture will start to become quite thick. Add the remaining egg whites, one at a time beating really well between each addition. Whisk until the mixture is really, really stiff, white and shiny. It should become so stiff that if you turned the bowl upside down the meringue would not come out! It does take slightly longer to whisk it this way and it is a backward way of making meringues but the beauty of it is you cannot over-whisk this mixture even if you went off and left it for 15 minutes or so, so this method seems to work well for me! Finally, gently fold in the coconut until well combined. ", "Using a large spoon, scoop the mixture into a piping bag which has been fitted with a 1½cm/¾in plain nozzle. Pipe out 48 blobs spaced apart on the baking trays with each one measuring 3-4cm/1¼-1½in wide and with a little peak on the top (to be about 2cm/¾in in height). Bake for around 1 hour 30 minutes, or until the meringues are crisp on the outside but still a little soft on the inside. Swap the trays around on the shelves half way through the cooking time to ensure even cooking.", "When the meringues are cooked, take them out of the oven and set aside to cool down. As they cool, make the ginger filly Chantilly. Mix all of the ingredients, except the strawberries, together well in a bowl and spoon the mixture into a piping bag fitted with a 1½cm/¾in plain nozzle. Pop into the fridge until ready to assemble.", "Once the meringues are completely cool, pipe a small blob of the ginger filly on the bottom of two meringue pieces. Place a slice of strawberry on one of the filly Chantillys and then sandwich it together with the other meringue. Repeat with the remaining meringues and filling to make 24 in total, arranging them on a large platter as you go. Serve straight away. "]}, {"isVegetarian": true, "title": "Coconut, fennel and pistachio biscotti", "url": "www_bbc_co_uk_food_recipes_coconut_fennel_and_40895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["35g/1¼oz coconut chips", "120g/4½oz unsalted pistachios, shelled", "4 tbsp fennel seeds", "110g/4oz unsalted butter, at room temperature ", "200g/7oz caster sugar", "2 large free-range eggs ", "1 tsp coconut essence ", "440g/15½oz plain flour", "1 tsp baking powder", "½ tsp table salt", "200g/7oz dark chocolate (minimum 70% cocoa powder)", "330g/11½oz caster sugar", "50g/1¾oz unsalted butter", "200g/7oz desiccated coconut, toasted", "½ tsp bicarbonate of soda"], "serves": "Makes 24 biscotti", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Put the coconut chips in a dry frying pan and toast them until golden-brown, stirring regularly. Toast the pistachios and fennel seeds in the same way, then transfer the pistachios and fennel seeds to a food processor and pulse until they are just broken.  Set aside to cool.", "In a large bowl, cream together butter and sugar until pale and fluffy. Mix in the eggs and coconut essence.", "Combine the flour, baking powder, salt, toasted coconut, pistachios and three-quarters of the fennel seeds. Add to the butter mixture and mix until well combined (the mixture will be quite stiff so you will find it easier to use an electric mixer). Divide the dough into 2 equal mounds.", "Line 2 baking trays with baking parchment. Place a mound of dough onto each tray and shape them into a rectangle approximately 25x8cm/10x3¼in. Bake for 35 minutes.", "Remove the dough from the oven and set aside to cool on the tray for 15 minutes. Reduce the oven temperature to 160C/140C Fan/Gas 2.", "Slice each log into pieces about 1cm/½in thick. Each log should produce about 12 biscotti. ", "Place the pieces cut-side down on the baking trays and return them to the oven. Bake for 10 minutes on each side, or until they are golden-brown and crisp. Leave to cool on a wire rack.", "For the coconut brittle, line a baking tray with non-stick baking paper.", "Add the sugar, butter and 125ml/4½oz water to a large saucepan. Heat gently until the sugar dissolves. Using a sugar thermometer, continue to heat the mixture to 160C, or until a caramel forms. Remove from the heat immediately and stir in the coconut. Stir in the bicarbonate of soda – the caramel will start to foam so take care not to burn yourself, melted sugar is very hot. Pour onto the prepared tray and leave to cool. ", "When cool, break the brittle into large pieces and add to a food processor. Add the reserved fennel seeds and pulse until broken into a coarse powder.  Transfer to a shallow dish.", "Melt the dark chocolate in a heatproof bowl over a pan of simmering water. Dip the long side of the biscotti in the melted chocolate and then into the coconut brittle. Set aside until the chocolate is set, then serve."]}, {"isVegetarian": false, "title": "Coconut crab with stone bass", "url": "www_bbc_co_uk_food_recipes_coconut_crab_with_stone_52229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz desiccated coconut", "4 cloves", "2 sprigs curry leaves, leaves picked", "1 tsp turmeric", "2 tbsp vegetable oil", "2 onions, finely sliced", "2 green chillies, finely sliced", "2 tbsp tamarind paste", "2 tbsp palm sugar", "400ml/14fl oz coconut milk", "300g/11oz fresh white crab meat, picked", "2 tbsp coriander leaves, roughly chopped", "1 lime, juice only", "4 x 200g/7oz stone bass fillet, skin on", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until medium hot, add two thirds of the coconut, with the cloves, curry leaves and turmeric and fry until golden-brown.", "Place into a small food processor or grinder and blitz to a fine powder.", "Heat a sauté pan or wok until hot, add the vegetable oil and onions and fry until golden-brown.", "Add the chillies and the remaining desiccated coconut and fry for one minute.", "Add the tamarind paste, palm sugar and coconut milk and bring to a simmer.", "Cook for 2-3 minutes until thickened then stir in the crab meat and coriander and season with a little lime juice, salt and black pepper.", "Season the stone bass fillet with salt and black pepper.", "Heat a frying pan until medium hot, add the stone bass skin side down and cook for two minutes, then turn over and cook the other side for two more minutes.", "To serve, spoon the crab curry onto the plate, then top with the stone bass and finish with a sprinkling of coriander cress."]}, {"isVegetarian": false, "title": "Coconut panna cotta with blood oranges and doughnuts", "url": "www_bbc_co_uk_food_recipes_coconut_panna_cotta_with_35812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz double cream", "1 vanilla pod, split in half lengthways and seeds scraped out", "225ml/8fl oz coconut milk", "2 gelatine leaves, soaked in water for at least five minutes", "300ml/10fl oz buttermilk", "250g/9fl oz strong white flour", "pinch salt", "50g/1¾oz caster sugar", "30g/1oz butter, softened", "1 tsp fast-action yeast", "vegetable oil, for deep frying", "50g/1¾oz unsalted butter", "3 blood oranges, 1 zested, then peeled and cut into slices, and 2 juiced", "1 lemon, zest and juice only", "3 tbsp caster sugar", "2 tbsp orange liqueur ", "2 tbsp icing sugar", "2 tbsp brandy ", "25g/1oz fresh coconut, grated", "25g/1oz caster sugar", "4 sprigs fresh mint"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the coconut panna cotta, heat the double cream, vanilla pod and seeds and the coconut milk in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk. Whisk until well combined.", "Pass the mixture through a fine sieve then pour the mixture into dariole moulds or ramekins and chill in the fridge for at least two hours.", "For the mini doughnuts, combine the flour, salt and caster sugar in a large bowl. Mix in the butter, 150ml/5½fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size.", "Divide the dough into 12 equal portions and roll each into a ball.", "Heat the oil in a deep-fat fryer to 150C/320F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: do not leave hot oil unattended.) ", "Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "Meanwhile, for the oranges and sauce, heat a frying pan until hot, add the butter, orange zest and juice, lemon zest and juice and the caster sugar. Stir in the orange liqueur and brandy. Cook for a few minutes until just thickened and bubbling, then remove the pan from the heat.", "Dust the sliced oranges with icing sugar and char using a blow torch or hot grill until caramelised.", "To serve, when the excess oil has drained off the doughnuts, place them onto a plate and dust with the caster sugar and coconut until completely coated.", "Remove the panna cotta from the moulds and turn out into the centre of serving plates. Serve with the mini doughnuts and charred oranges and sauce. Garnish with fresh mint."]}, {"isVegetarian": false, "title": "Coconut prawn curry with cauliflower 'rice'", "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_with_58477", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_with_58477_16x9.jpg", "ingredients": ["1 tbsp light olive oil", "1 onion, roughly chopped", "2 garlic cloves, finely chopped", "2 level tbsp medium curry paste", "2 tbsp tomato purée", "200ml/7fl oz chicken or vegetable stock", "200ml tin reduced fat coconut milk", "1 courgette, cut into 1cm/½in cubes", "400g/14oz raw tiger prawns, peeled (defrosted if frozen)", "salt and freshly ground black pepper", "800g/1lb 12oz cauliflower florets", "1 tsp light olive oil", "1 tbsp pilau spice seasoning ", "6 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan. Add the onion and garlic and cook over a medium heat for 2–3 minutes, or until softened. Add the curry paste and fry for 30 seconds. Add the tomato purée, stock, coconut milk and courgette and simmer for 10 minutes.", "Add the prawns and cook for 4–5 minutes, or until pink and cooked through. Season.", "Meanwhile, to make the pilau, pulse the cauliflower in a food processor until the size of rice. Place in a large, heatproof bowl, cover with cling film, then pierce and microwave on high for 6–8 minutes.", "Heat the oil in a wide frying pan over a medium heat. Fry the pilau seasoning and cauliflower ‘rice’ for 6–7 minutes, or until piping hot. Remove from the heat and stir in the coriander. ", "Serve the curry with the 'rice'."]}, {"isVegetarian": false, "title": "Prawns with freshly grated coconut, green chillies and mustard seeds (Chingri daab)", "url": "www_bbc_co_uk_food_recipes_coconut_prawn_curry_69561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_prawn_curry_69561_16x9.jpg", "ingredients": ["2 tbsp black mustard seeds", "4–6 tbsp vegetable oil", "1 onion, thinly sliced", "1 tsp ground turmeric", "250ml/9fl oz coconut milk", "250g/9oz fresh or frozen coconut flesh, blitzed in a food processor or grated", "1 tsp salt", "350g/12oz peeled raw prawns", "4 fresh green chillies, with seeds, cut lengthways into sixths", "handful chopped coriander, to finish"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the mustard seeds into a mini-food processor and add two tablespoons of water. Blend for a minute and then add another two tablespoons of water and continue blending until the seeds start to break up (this can take a minute or two of persistent blending; add more water if you’re having trouble). Keep blending until you have a rough paste that resembles wholegrain mustard, adding a splash more water if needed. Set aside.", "Heat the vegetable oil in a heavy-based saucepan or karahi over a low-medium heat. Add the onion and fry for 10 minutes. Add the blended mustard paste, turmeric, coconut milk, grated coconut and salt. Bring to a boil then simmer for 4-5 minutes.", "Add the prawns and green chillies and simmer for a further 3-4 minutes, or until the prawns are pink and cooked through. Scatter with coriander and serve."]}, {"isVegetarian": false, "title": "Coconut, raspberry and lemon meringue trifle", "url": "www_bbc_co_uk_food_recipes_coconut_raspberry_and_77291", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium free-range eggs, separated", "250g/9oz caster sugar", "½ tsp salt ", "230g/8oz plain flour", "1 tsp baking powder", "50g/1¾oz raspberries, crushed ", "2 tbsp desiccated coconut", "butter, for greasing", "4 unwaxed lemons", "100g/3½oz unsalted butter", "200g/7oz unrefined caster sugar ", "3 whole free-range medium eggs, plus 1 free-range egg yolk", "50g/1¾oz sugar ", "3 punnets raspberries, chopped", "3 punnets strawberries, chopped ", "600ml/20fl oz full-fat milk", "600ml/20fl oz double cream", "1 vanilla pod", "3 tbsp cornflour", "4 large free-range egg yolks", "75g/2½oz caster sugar", "600ml/20fl oz double cream", "1 punnet raspberries", "50ml/2fl oz coconut milk", "13 tbsp icing sugar", "10 tbsp ground almonds", "2 medium free-range egg whites", "pinch cream of tartar", "3⅓ tbsp caster sugar ", "yellow gel colouring", "2 free-range egg whites", "100g/3½oz caster sugar", "10-15 raspberries, to decorate "], "serves": "Makes 1 large trifle", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the raspberry and coconut lady fingers, preheat the oven to 190C/170(fan)/Gas 5. ", "In a large bowl, whisk the egg yolks with half of the sugar until light and fluffy.", "In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Gradually add the salt and remaining sugar until firm peaks form when the whisk is removed.", "Fold the egg whites into the egg yolk mixture. Sieve the flour and baking powder over the mixture and fold until just incorporated. Fold in the crushed raspberries and the coconut.", "Fill a piping bag with the mixture and pipe 10cm/4in lengths onto a greased baking tray. ", "Bake for 15 minutes, or until golden-brown. Remove from the oven and cool on a wire rack.", "For the lemon curd, zest and juice the lemons. Add the zest and juice, butter and sugar to a heatproof bowl. Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl. Stir until the butter is melted.", "Lightly whisk the eggs and yolk in a bowl. Whisk them into the lemon mixture and then cook for 10-13 minutes, or until thickened, stirring occasionally. Remove the lemon curd from the heat and set aside to cool. Any lemon curd that isn’t used for this recipe can be spooned into sterilised jars, sealed and stored in the fridge.", "For the strawberry and raspberry glaze, add the sugar to 50ml/1¾fl oz of water in a pan and dissolve the sugar over a simmering heat. Simmer until the mixture has thickened, then pour it over the soft fruit in a bowl. Set aside.", "For the custard, heat the milk, cream and vanilla in pan until just below the boiling point..", "Mix together the cornflour and two tablespoons of cold water together in a small bowl. Set aside.", "Whisk the egg yolks and sugar in large bowl. Slowly add the milk mixture and, once combined, pour the mixture back into the pan and return to the heat.", "Cook for 8-10 minutes, or until thick enough to coat the back of a spoon. Quickly whisk in the cornflour mixture. Cook for 1-2 minutes more, or until really thick. Set aside to cool.", "For the coconut and raspberry cream, whisk the cream in a large bowl. Crush in the raspberries and stir in the coconut milk.", "For the lemon and raspberry macaroons, blend the icing sugar and ground almonds in a food processor.", "Whisk the egg whites on high in a large bowl using an electric whisk. When frothy, add a pinch of cream of tartar. Slowly add the caster sugar, whisking with each addition, until firm peaks form when the whisk is removed from the bowl.", "Fold in the food colouring and blended icing sugar and ground almonds. Pipe circles of the mixture onto a baking tray lined with baking paper, about the size of a 50p coin.", "Allow to sit at room temperature (in a non-humid setting) for at least half an hour, until a skin forms over the macaroons. Preheat the oven to 160C/325F/Gas 3.", "Bake for 5-12 minutes (depending on size). The macaroons should not catch any colour.", "For the meringue topping, whisk the egg whites in a bowl on high and then gradually add the caster sugar, whisking as you go, until stiff peaks are formed when the whisk is removed from the bowl.", "To assemble, arrange half the lady fingers in the bottom of a glass trifle bowl. Top with half the lemon curd, followed by all the custard, the remaining half of the lady fingers, the strawberry and raspberry glaze, coconut and raspberry cream and the remaining lemon curd. Finish with the meringue topping. Use a blowtorch to brown the meringue topping. Place the macaroons around the top and add some raspberries in the centre to decorate."]}, {"isVegetarian": true, "title": "Coconut rice", "url": "www_bbc_co_uk_food_recipes_coconut_rice_40744", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz rice", "170ml/6fl oz coconut milk ", "170ml/6fl oz stock", "salt, to taste", "sugar, to taste", "pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice well under cold running water to remove any excess starch and transfer to a saucepan which has a tight-fitting lid.", "Mix the coconut milk and stock together and pour it over the washed rice.", "Cover the saucepan with a lid and bring the rice to boil on high heat.", "Once vigorously boiling, change to a low heat, cover with the lid and allow to simmer for 10 minutes, or until the water level is the same as the top of the rice.", "At this point, turn the heat completely off and allow to rest for a further 10 minutes, keeping the lid on at all times. Use a wooden spoon to fluff up the rice before serving. Add salt, sugar and pepper to taste."]}, {"isVegetarian": true, "title": "Coconut samosas", "url": "www_bbc_co_uk_food_recipes_coconut_samosas_81366", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_samosas_81366_16x9.jpg", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "200g/7oz shredded or grated coconut", "15g/½oz clarified butter (ghee)", "1½ tsp fennel seeds", "vegetable oil, for deep frying", "salt"], "serves": "Makes 15–20 samosas", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour, 200ml/7fl oz water and a pinch of salt in a large bowl and mix together to form a dough. Knead it for 1–2 minutes. Flour a work surface and roll out the dough until it is very thin. Cut out circles using a 6cm/2½in round cutter.", "Put the coconut, clarified butter, fennel and a pinch of salt in a large pan. Bring to a simmer, then cook for 4–5 minutes, or until it’s completely dry. Set aside to cool. ", "Divide the filling between the dough circles. Fold the dough over the filling to enclose it, pinching the edges to seal. Roll and fold the edges.", "Heat the oil in a heavy-bottomed frying pan or deep-fat fryer until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the samosas in batches for 4–5 minutes, or until they turn golden-brown. Remove with a slotted spoon and drain on kitchen paper. Sprinkle with salt and serve."]}, {"isVegetarian": false, "title": "Coconut and green chilli prawns", "url": "www_bbc_co_uk_food_recipes_coconutandgreenchill_74808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz can coconut milk", "5-10 hot green chillies, sliced thickly", "1 tsp ground turmeric", "2 tbsp coriander leaves, finely chopped", "1 tsp freshly ground black pepper", "3 tbsp ground coriander", "1½ tsp ground cumin", "4 tbsp vegetable oil", "2 onions, finely sliced", "2 garlic cloves, cut into fine slivers", "1cm/½in ginger root, cut into small matchsticks", "1 lime, juice only", "1 tsp salt", "120ml/4fl oz water", "900g/2lb raw peeled king prawns", "Thai jasmine rice, cooked, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Open the coconut can without shaking it. ", "Remove the cream at the top and set to one side.", "Now add enough water to the can to fill it to the top again. ", "Swill to combine and pour into a bowl.", "Put the chillies, turmeric, coriander leaves, pepper, ground coriander and ground cumin into a food processor along with four tablespoons of the thinned coconut milk, then blend until smooth.", "Add this mixture to the bowl of thinned coconut milk and stir.", "Heat a deep frying-pan until hot then add the oil, onions, garlic and ginger. ", "Stir fry for 6-7 minutes until brown at the edges. ", "Pour in the seasoned thinned coconut milk, salt and water.", "Bring to the boil then reduce the heat, cover and simmer gently for 10 minutes.", "Add the prawns and reserved thick coconut cream. ", "Stir to combine and return to a simmer.", "Cook until the prawns turn pink.", "Serve immediately with rice."]}, {"isVegetarian": true, "title": "Coconut tart with spiced rum pineapple", "url": "www_bbc_co_uk_food_recipes_coconut_tart_with_spiced_06324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "100ml/3½fl oz dark rum", "1 red chilli, seeds removed, cut into thin strips", "1 vanilla pod, seeds only", "1 star anise", "1 pineapple, peeled and cut into small dice", "250g/9oz sweet shortcrust pastry", "plain flour, for rolling out", "2 free-range eggs, beaten ", "2 unwaxed lemons, juice and finely grated zest ", "200g/7oz caster sugar", "375ml/13fl oz double cream", "180g/6oz freshly grated coconut "], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the spiced rum pineapple, put the sugar in an even layer in a heavy-bottomed pan. Warm on a medium heat, without stirring. When the sugar starts to melt at the edges, shake the pan, then continue to heat. Stir with a wooden spoon until all the sugar has melted and turned to caramel. Carefully add the rum, chilli, vanilla seeds and star anise.", "Put the pineapple in a bowl and pour over the caramel. Cover and set aside for at least an hour.", "For the coconut tart, preheat the oven to 180C/160C Fan/Gas 4.", "Roll out the pastry on a floured surface to the thickness of a pound coin. Use it to line a 25cm/10in fluted, loose-bottomed tart tin. Prick the base with a fork. Line with baking paper and fill with baking beans.", "Bake for 15–20 minutes. Remove the beans and paper and bake for 5–10 minutes more, or until cooked through. Reduce the oven temperature 160C/140C Fan/Gas 3.", "In a large bowl, mix together the eggs, lemon juice and zest, sugar, cream and coconut. Pour into the pastry case and bake for 40 minutes, or until just set.", "Serve slices of the tart with the spiced rum pineapple."]}, {"isVegetarian": true, "title": "Coconut and lime macadamia cake", "url": "www_bbc_co_uk_food_recipes_coconutandlimemacada_73762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz macadamia nuts", "40g/1½oz self-raising flour", "pinch of salt", "6 eggs, separated", "165g/5¾oz sugar", "1 lime, zest only, finely grated", "45g/1½oz desiccated coconut", "125g/4½oz icing (confectioners') sugar, sifted", "2 tbsp lime juice", "1 tsp lime zest, finely grated"], "serves": "Makes 1 x 23cm (9in) cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Place the nuts, flour and salt in the bowl of a food processor and process until the nuts are ground.", "Place the egg yolks and sugar in a separate bowl and beat for three minutes, or until the mixture is pale and creamy. Fold through the zest and coconut, then the nut mixture.", "Place the egg whites in a clean, dry, stainless steel bowl and whisk until stiff peaks form. Using a large metal spoon, fold lightly through the nut batter.", "Spread the batter evenly into a 23cm (9in) greased or non-stick springform cake tin. Bake for 40 minutes, or until the cake is lightly golden.", "Meanwhile, make the icing. Combine all the icing ingredients in a bowl and mix until smooth and glossy.", "Remove from the oven and leave to sit for 10 minutes in the tin. Turn the cake out onto a serving plate. Spread the lime icing over the warm cake, allowing it to drizzle down the sides.", "Serve."]}, {"isVegetarian": true, "title": "Coconut and mango smoothie", "url": "www_bbc_co_uk_food_recipes_coconutandmangosmoot_80089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz mango, peeled and chopped ", "2 tbsp runny honey", "50g/1¾oz soya yoghurt ", "100ml/3½floz soya milk", "100ml/3½floz coconut milk", "1 small handful ice", "½ lime, juice only", "sprig of mint"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the mango, honey, yoghurt, soya milk, coconut milk, ice and lime juice in a liquidiser until smooth.", "Pour into a tall smoothie glass and garnish with a mint sprig."]}, {"isVegetarian": false, "title": "Coconut and prawn broth with rice, spinach and chilli", "url": "www_bbc_co_uk_food_recipes_coconutandprawnbroth_87354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "5 large prawns, shells and heads only", "½ fresh green chilli, chopped", "25g/1oz fresh ginger, sliced", "¼ onion, finely chopped", "1 garlic clove, finely chopped", "300ml/½ pint boiling water", "1 tsp curry powder", "1 tsp tomato purée", "1 tbsp grated fresh coconut", "1 lime, juice only", "handful fresh spinach", "25g/1oz basmati rice, cooked", "small handful fresh coriander leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a medium saucepan, add the prawn shells and heads, chilli, ginger, onion and garlic and sauté for 2-3 minutes. ", "Add the water, curry powder, tomato purée, grated coconut and lime juice. Bring to the boil and cook for ten minutes. ", "Place a fine sieve over another clean pan, pass the mixture through the sieve and discard everything that is left in the sieve. Add the spinach and rice to the broth and stir. ", "To serve, pour into a bowl and garnish with coriander leaves."]}, {"isVegetarian": true, "title": "Coconut and raspberry biscuits", "url": "www_bbc_co_uk_food_recipes_coconutandraspberryb_74768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/4½oz butter, softened", "60g/2½oz caster sugar", "1 egg, preferably free-range, beaten", "1 tsp pure vanilla extract", "100g/3½oz rice flour", "75g/3oz tapioca flour", "1 tsp gluten-free baking powder", "1 tsp xanthan gum", "50ml/2fl oz milk", "175g/6oz raspberry jam", "250g/9oz raspberries", "100g/3½oz butter, softened", "150g/5oz caster sugar", "2 eggs, preferably free-range, lightly beaten", "225g/8oz desiccated coconut", "60g/2½oz rice flour", "Swiss roll tin, 20x30cm/8x12in, lined with parchment paper"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "To make the base, cream the butter and gradually add the caster sugar. Beat until pale, soft and light. Add the egg, a little at a time, beating well after each addition, before adding the vanilla extract.", "Sift together the dry ingredients and stir gently into the creamed mixture. ", "Mix everything together lightly and add the milk to moisten. Spread the mixture into the prepared tin, smoothing it out to the edges. Spread the jam gently over the cake mixture and sprinkle with the raspberries. You may need to press them down gently into the cake mixture.", "Make the topping. Cream the butter and sugar together as before until pale, soft and light. Add the beaten eggs gradually, beating well after each addition. Mix together the coconut and rice flour and fold into the mixture. Spread gently but evenly over the raspberries and bake in the oven for about 35-40 minutes or until a skewer comes out cleanly. ", "Leave to cool in the tin and cut into 24 biscuits."]}, {"isVegetarian": false, "title": "Coconut prawns with spicy mango relish", "url": "www_bbc_co_uk_food_recipes_coconutandvelvetpraw_86842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp arrowroot", "1 tbsp sesame oil", "1 free-range egg white", "pinch salt", "100g/3½oz raw king prawns, peeled", "vegetable oil", "1 lime, juice only", "2 tbsp white wine", "½ tsp curry powder", "½ mango, peeled, stoned, chopped", "100ml/3½fl oz coconut cream", "½ tsp chilli flakes", "dash olive oil", "salt and freshly ground black pepper", "1 tsp caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, mix together the arrowroot, sesame oil, egg white and salt in a medium bowl. Add the prawns and stir until they are all coated. ", "Heat a little vegetable oil in a wok. Add the prawns and cook for 1-2 minutes, or until pink and completely cooked through. Remove from the heat and add the lime juice, white wine and curry powder. Spoon onto a serving plate.", "For the mango relish, put all the ingredients into a small blender or food processor and blend until smooth. Pour into a small bowl and serve as a dipping sauce alongside the prawns."]}, {"isVegetarian": true, "title": "Coconut butternut squash stew", "url": "www_bbc_co_uk_food_recipes_coconutbutternutsqua_65609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 dried hot red chillies (¾-1¼cm/2-3in), seeded and cut in pieces and soaked in warm water for 10 minutes, drained ", "6 spring onions, roughly chopped ", "2 tsp chopped garlic ", "2 stalks lemongrass, outer leaves discarded, chopped (lemon juice could be used instead) ", "1½ tbsp peanut oil, extra if required ", "2 tsp ground coriander ", "½ tsp ground turmeric ", "1 tsp paprika ", "290ml/½ pint of canned unsweetened coconut milk, well stirred ", "150ml/¼ pint hot vegetable stock or water ", "750g/1½lb butternut squash, peeled, seeded and cut into 5cm/2in chunks ", "2 green cardamom pods, crushed ", "1 cinnamon stick ", "1 red pepper, seeded and julienned ", "salt to taste ", "1½ tbsp soy sauce ", "1½ tsp light brown sugar ", "1½ tsp lemon juice ", "2 tbsp fresh coriander leaves"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the chillies, spring onions, garlic and lemongrass to a paste in a processor, adding a little oil if necessary. Heat 1½ tbsp oil in a heavy saucepan over a medium-low heat. Add the chilli paste and cook, stirring until it is fragrant and no longer tastes raw. ", "Add the coriander, turmeric, and paprika and stir for 1 minute. Add the coconut milk and simmer, stirring for 5 minutes. ", "Stir in the stock and bring to a simmer. ", "Reduce the heat to low and add the butternut squash, red pepper, cardamom, cinnamon stick and salt to taste. Simmer, partially covered until the butternut squash is tender and the sauce is reduced, about 20-25 minutes. ", "Stir in the soy sauce, sugar and lemon juice and simmer for another 2 minutes. Serve garnished with coriander leaves. ", "This is quite a wet stew. It can be thickened with cornflour paste if required. Serve with plain rice."]}, {"isVegetarian": true, "title": "Coconut caramel biscuits", "url": "www_bbc_co_uk_food_recipes_coconutcaramelbiscui_85123", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "150g/5½oz coconut biscuits, crushed", "½ lemon, juice only", "1 tsp vegetable oil"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the caster sugar into a frying pan and melt over a medium heat until beginning to turn golden-brown.", "Add the crushed biscuits and mix well. Stir in the lemon juice.", "Grease a baking sheet with vegetable oil, then pour the mixture onto the baking sheet. Leave to cool, then chop into pieces."]}, {"isVegetarian": false, "title": "Coconut fish curry", "url": "www_bbc_co_uk_food_recipes_coconutfishcurry_89979", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconutfishcurry_89979_16x9.jpg", "ingredients": ["1 green chilli, roughly chopped", "pinch dried chilli flakes", "2 tbsp vegetable oil", "½ lemon, juice only", "handful fresh coriander, plus extra for garnish", "1 tbsp vegetable oil", "1 onion, sliced", "1 garlic clove, crushed", "1 large sweet potato, peeled and chopped ", "1 tsp curry powder", "1 tsp cumin ", "150/5oz cod or pollack fillet, skinned and chopped (frozen is fine)", "½ tin coconut milk", "1 handful spinach leaves, or 2 blocks frozen spinach, defrosted and liquid squeezed out", "½ lime, juice only", "salt, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spice paste, place all of the spice paste ingredients into a food processor and blend until smooth. (You can use a pestle and mortar for this, too.)", "For the curry, heat the vegetable oil in a wok and gently fry the onion and garlic for 4-5 minutes, or until softened. Add the sweet potato, curry powder and cumin and continue to fry for further 5-10 minutes, until the sweet potato has softened, then add the fish and two tablespoons of the spice paste. Stir to coat the fish in the spices, then add the coconut milk and bring to a gentle simmer.", "Stir in the baby spinach leaves, lime juice and season with salt, to taste. Cook for another 2-3 minutes, then stir in the coriander.", "Spoon the curry into a bowl and serve."]}, {"isVegetarian": true, "title": "Coconut French toast with griddled mango", "url": "www_bbc_co_uk_food_recipes_coconutfrenchtoastwi_85753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp coconut cream", "1 free-range egg, beaten", "2 tbsp caster sugar", "1 vanilla pod, seeds only", "¼ tsp ground cinnamon", "2 slices baguette or other bread", "2 tsp vegetable oil", "1 tbsp butter", "1 tsp brown sugar", "½ mango, peeled, stone removed and scored", "½ red chilli, finely chopped", "1 tbsp honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the coconut cream, egg, sugar, vanilla seeds and cinnamon into a bowl and mix well.", "Dip the bread into the egg mixture to completely coat.", "Heat the vegetable oil and butter in a non-stick frying pan and fry the bread until golden-brown on both sides.", "Meanwhile, for the mango, heat a griddle pan. Sprinkle the brown sugar over the mango and griddle cut-side down for 3-4 minutes until golden. Turn over, then transfer the pan to the oven and cook for 2-3 minutes. Add the chilli and honey and cook for a further 2-3 minutes.", "To serve, place the French toast onto a plate and top with the caramelised mango."]}, {"isVegetarian": true, "title": "Coconut ice cream", "url": "www_bbc_co_uk_food_recipes_coconuticecream_86100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconuticecream_86100_16x9.jpg", "ingredients": ["290ml/½ pint milk ", "85g/3oz caster sugar", "290ml/½ pint double cream ", "1 coconut, flesh only, cut into small pieces ", "2 tbsp vodka ", "1 bunch fresh mint, finely chopped"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Heat the milk and sugar together in a medium pan over a low heat, until the sugar has dissolved.", "Let the milk cool, before stirring in the cream, coconut pieces, vodka and chopped mint. ", "Transfer the mixture to an ice cream maker and churn according to the manufacturer's instructions.", "Serve once the ice cream is frozen."]}, {"isVegetarian": false, "title": "Coconut prawn soup with toasted sesame oil and chilli", "url": "www_bbc_co_uk_food_recipes_coconutprawnsoupwith_86848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ lime, juice only", "300ml/10½fl oz hot chicken stock ", "1 tbsp coconut cream", "2 tsp toasted sesame oil", "2 spring onions, chopped", "pinch chilli flakes", "70g/2½oz raw king prawns", "small handful fresh coriander leaves, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lime juice, chicken stock, coconut cream, sesame oil, spring onions and chilli flakes into a small saucepan, bring to the boil and cook gently for eight minutes.  ", "Add the prawns and bring back to boiling point, then remove from the heat and leave, covered, for 3-4 minutes, or until the prawns are completely cooked through. Spoon the mixture into a serving bowl, top with fresh coriander and serve."]}, {"isVegetarian": true, "title": "Coconut rice pudding with mango, orange and lime", "url": "www_bbc_co_uk_food_recipes_coconutricepuddingwi_70431", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz short-grain rice", "230ml/8fl oz coconut milk", "110ml/4fl oz milk", "1 tsp orange zest", "2 tsp caster sugar", "1 tsp vanilla essence", "110ml/4fl oz cream", "mango, sliced", "lime wedges", "2 tsp brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rice, coconut milk, milk, zest, sugar and vanilla in a saucepan over a medium heat and bring to the boil. Reduce the heat, cover and cook for 1 hour, stirring occasionally. When the rice is cooked, remove from the heat and leave to cool with the lid on.", "When the mixture is cold, stir in the cream. Pour into a serving bowl, top with mango and a sprinkling of brown sugar and serve with wedges of lime on the side."]}, {"isVegetarian": true, "title": "Coconut rice scented with curry and caramelised onions", "url": "www_bbc_co_uk_food_recipes_coconutricescentedwi_87356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz basmati rice", "100ml/3½fl oz coconut milk", "pinch curry powder", "500ml/18fl oz hot vegetable stock", "1 tbsp grated fresh coconut", "salt and freshly ground black pepper ", "2 tbsp vegetable oil", "½ onion, finely sliced", "salt and freshly ground black pepper", "2 tbsp toasted pine nuts", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the coconut rice, place the rice, coconut milk, curry powder, vegetable stock and grated coconut into a medium saucepan. Bring to the boil, then reduce the heat and simmer gently for ten minutes. Drain well and season with salt and freshly ground black pepper. ", "For the caramelised onions, heat the vegetable oil in a frying pan, add the onions and cook over a gentle heat for ten minutes, stirring occasionally. Season well with salt and freshly ground black pepper.", "To serve, pile the rice into a serving bowl, top with the onions and pine nuts and garnish with chives."]}, {"isVegetarian": true, "title": "Coconut sponge pudding", "url": "www_bbc_co_uk_food_recipes_coconutspongepudding_91835", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz unsalted butter, at room temperature, plus extra for greasing", "225g/8oz golden caster sugar", "4 free-range eggs", "1 lime, zest and juice", "50g/2oz desiccated coconut, toasted", "200g/7oz self-raising flour", "splash milk (optional)", "6 free-range egg yolks", "125g/4½oz caster sugar", "40g/1½oz plain flour", "400ml/13½fl oz canned coconut milk", "1 vanilla pod, split, seeds scraped out", "200ml/7fl oz double cream, whipped to soft peaks"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4. Grease and flour six dariole moulds.", "For the sponge, beat the butter and sugar together in a bowl until pale and fluffy. ", "Crack in the eggs, then add the sugar, then the butter, beating thoroughly between additions. Mix in the lime juice, lime zest, toasted coconut, and flour until the mixture comes together to form a smooth batter. Add a splash of milk if the mixture is too dry. ", "Spoon the sponge mixture into the prepared dariole moulds, then place into the oven and bake for 20-25 minutes, or until the sponge is golden-brown and cooked through (the sponge should be springy to the touch). Remove from the oven and set aside to cool.", "For the custard, whisk the egg yolks and sugar together in a bowl until pale and creamy, then sieve in the flour and mix well until smooth. ", "Place the coconut milk and vanilla pod and seeds into a heavy-based pan and slowly bring to the boil over a medium-low heat. Remove the pan from the heat as soon as the mixture reaches the boil, then remove and discard the vanilla pod. Pour the coconut milk mixture over the egg and sugar mixture, whisking continuously until well combined. ", "Pour the custard mixture back into a clean pan and cook over a medium heat, stirring frequently for 4-5 minutes, or until the custard thickens enough to coat the back of a wooden spoon. ", "To serve, turn the sponge puddings out from their moulds and place onto shallow serving bowls. Spoon the custard over the sponge puddings and serve with dollops of whipped cream."]}, {"isVegetarian": true, "title": "Coconut sorbet with mango tarte tatin and chilli caramel crisp", "url": "www_bbc_co_uk_food_recipes_coconutsorbetwithman_86049", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz caster sugar", "1 x 400ml/14fl oz can coconut milk", "25g/1oz desiccated coconut", "50ml/2fl oz coconut cream", "½ lemon, juice only", "1 tbsp coconut liqueur", "1 free-range egg white", "225g/8oz caster sugar", "50g/2oz butter", "2 mangoes, peeled and cut into cubes", "500g/1lb 2oz ready-made puff pastry", "plain flour, for dusting", "small knob of butter, for greasing", "110g/4oz caster sugar", "pinch crushed chilli flakes"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the coconut sorbet, place the caster sugar, coconut milk and desiccated coconut into a saucepan and bring to the boil.", "When the sugar has dissolved, remove from the heat and stir in the coconut cream, lemon juice and coconut liqueur. Set to one side and cool.", "Place the egg white into a bowl and whisk until soft peaks form when the whisk is removed. ", "Fold the whisked egg white into the coconut mixture. ", "Pour the mixture into an ice cream maker and churn until frozen, according to manufacturer's instructions - or pour into a plastic box and freeze, removing the box from the freezer from time to time to stir. ", "For the mango tatin, preheat the oven to 200C/400F/Gas 6. ", "Divide the caster sugar among four small ovenproof blini pans (or small frying pans) over a low heat.  ", "Cook, without stirring, until the sugar has melted and caramelised, turning golden-brown - take care as the sugar will be very hot.", "Remove the pans from the heat and place a quarter of the butter into each pan. Stir gently to combine. ", "Divide the mango evenly among the four pans and keep warm, while you prepare the pastry.", "Roll the puff pastry to 5mm/¼in thick on a clean, floured surface. Cut out four circles slightly larger than the circumference of the blini pans (or frying pans).", "Cover each pan with a pastry round, pushing the edge down around the mango. ", "Transfer to the preheated oven and bake for 15-20 minutes, until the pastry is golden-brown and cooked through. Remove and allow to cool slightly. ", "For the chilli caramel crisp, lightly grease a baking sheet with butter. Place the sugar into a hot frying pan and cook until melted and caramelised, again taking care.", "Remove the pan from the heat and add the chilli flakes. Pour the caramelised sugar onto the greased baking sheet and cool until hardened. ", "When hard, break into pieces and transfer to a food processor. Blend until fine crumbs are formed. ", "Place a non-stick silicone sheet onto a frying pan.", "Place a 5cm/2in lightly greased chefs' ring onto the sheet and fill with enough of the caramel crumbs to make a thin layer. Heat until the caramel has liquefied; then remove from the heat and cool. ", "Carefully lift off the ring and allow the disc to cool totally. Repeat until you have four discs. Cool.", "To serve, turn each tarte tatin out into the centre of one of four plates. Spoon any residual caramel around the tartes and top with a spoonful of the coconut sorbet and a chilli caramel disc for each serving."]}, {"isVegetarian": true, "title": "Coconut tart with passion fruit cream", "url": "www_bbc_co_uk_food_recipes_coconuttartwithpassi_83977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "2 lemons, juice and zest", "200g/7oz caster sugar", "375ml/13fl oz double cream", "300g/11oz desiccated coconut", "25cm/10in sweetened shortcrust pastry tart shell, blind baked (you can use ready-made)", "250g/9oz mascarpone", "50ml/2fl oz double cream", "2 tbsp icing sugar", "3 passion fruit, sliced in half and pulp removed"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.  ", "For the tart, mix the eggs, lemon zest and caster sugar in a clean bowl throughly, for a minute. ", "Gently mix in the cream, then the lemon juice and finally the desiccated coconut.  ", "Pour into the pastry shell and bake until golden all over. This should take about 40 minutes.  ", "Remove from the oven and leave for one hour to cool and firm up.", "For the cream, let the mascarpone warm to room temperature before putting it into a bowl with the double cream and icing sugar.  ", "Whip until it begins to thicken, then add the passion fruit pulp and beat until firm.", "To serve, simply cut the coconut tart into wedges and place on a serving plate with a spoonful of the passion fruit cream."]}, {"isVegetarian": false, "title": "Cod and parsley stuffed jacket potato", "url": "www_bbc_co_uk_food_recipes_cod_and_parsley_stuffed_30774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large baking potatoes (roughly 225g/8oz each)", "olive oil ", "1 litre/1¾ pint whole milk", "2 garlic cloves, crushed", "1 bay leaf", "300g/10½oz cod fillet, skin removed, boneless", "3 tbsp roughly chopped fresh parsley", "55g/2oz Cheddar, grated", "extra virgin olive oil for drizzling", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to serve", "handful watercress, leaves picked, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/185C Fan/Gas 6. Wash the potatoes well, dry them and prick several times with a fork. Pour some olive oil into your hands and rub over the potatoes. Make four small mounds of sea salt on a baking tray and sit a potato on each one. Bake for 50 minutes–1 hour, or until crispy and cooked.", "Meanwhile, for the filling, put the milk, garlic and bay in a saucepan, season and bring to a simmer. Add the cod and cook gently for 4 minutes, then remove from the heat. Lift out the cod using a slotted spoon and place on a plate. Pour the milk mixture into a jug.", "Let the potatoes cool slightly, then cut them in half lengthways. Scoop out the flesh and put it in a bowl. Flake the cod and add to the potato. Mix in the parsley. Add 150ml/5fl oz of the milk and mash using a potato masher. Add a little more milk if the mixture is too stiff, but don’t let it become sloppy.", "Spoon the flesh back into the potato skins and scatter the cheese on top. Place on a baking tray and bake for 25 minutes, or until piping hot and golden.", "Serve immediately, drizzled with a little olive oil, with lemon wedges and watercress. "]}, {"isVegetarian": false, "title": "Almond and parsley crumb fish with a roasted red pepper sauce and nibbles", "url": "www_bbc_co_uk_food_recipes_cod_balls_with_a_roasted_32022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 300g/10½oz cod fillet, pin boned and diced", "2 x 100g/3½oz red mullet fillets, pin boned and diced", "12 prawns, shells removed", "12 langoustines, shells removed, blanched", "2 tbsp Dijon mustard", "200g/7oz flaked almonds, crushed", "2 tbsp fresh parsley, chopped", "1 slice sourdough bread, cut into cubes", "½ red chilli, finely chopped", "2 garlic cloves, finely chopped ", "50ml/2fl oz extra virgin olive oil", "3 plum tomatoes", "100g/½oz flaked almonds, toasted", "½ tbsp smoked Spanish paprika", "½ jar roasted red peppers ", "1 lemon, juice only", "lemon wedges", "salt and freshly ground black pepper", "Manchego cheese shavings", "Iberico ham", "Membrillo cubes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the seafood, heat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Brush the fish and seafood with the Dijon mustard. Season with salt and pepper. Mix the crushed flaked almonds and chopped parsley together, then press onto the fish and seafood to coat.", "Place in the deep-fat fryer and cook for 2-3 minutes, depending on the size of the seafood. Remove using a slotted spoon and set aside to drain on kitchen paper.", "For the roasted red pepper sauce, gently fry the bread, chilli and garlic in a pan with a little oil until the bread begins to colour. ", "Transfer the pan contents to a blender. Add the tomatoes, almonds, smoked paprika and peppers. Purée the mixture then add the lemon juice and a little olive oil. Season to taste with salt and pepper.", "To serve, place the sauce on a serving platter and put the fish, prawns and langoustines on top. Serve the nibbles alongside."]}, {"isVegetarian": false, "title": "Cod in a rich tomato sauce with courgetti", "url": "www_bbc_co_uk_food_recipes_cod_in_a_rich_tomato_59773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp vegetable oil", "1 very small onion (50g/1¾oz), thinly sliced ", "1 garlic clove, finely chopped ", "½ red pepper (75g/2½oz), roughly chopped ", "pinch smoked paprika  ", "300g/10½oz tinned chopped tomatoes", "1 level tbsp tomato purée ", "175g/6oz cod fillet, boneless, skin on", "150g/5½oz courgetti", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Heat the oil in small frying pan over a medium heat. Add the onion and fry for 4–5 minutes, or until soft. Add the garlic, pepper and paprika and cook for 2 minutes.   ", "Stir in the tomatoes, tomato purée and salt and pepper, to taste. Cook over a medium heat for 10 minutes, or until the mixture begins to thicken. ", "Transfer the sauce into an ovenproof dish, lay the fish on top of the sauce and bake for 10–15 minutes, or until the fish is cooked. ", "Meanwhile, place the ‘courgetti’ in a microwave and cook on high for 2 minutes. Stand for 1 minute before serving with the fish."]}, {"isVegetarian": false, "title": "Cod in parsley sauce with cockles and mashed potato", "url": "www_bbc_co_uk_food_recipes_cod_in_parsley_sauce_47876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz centre-cut cod fillet, pin boned and skinned ", "40g/1½oz sea salt", "knob of butter", "2 large potatoes, peeled and cut into chunks", "125g/4½oz unsalted butter", "125ml/4½fl oz double cream", "100g/3½oz cockles, thoroughly washed to remove any sand or silt", "1 large bunch curly parsley, leaves picked, stalks reserved, both chopped ", "2 shallots, chopped", "150ml/5½fl oz glass white wine", "25g/1oz butter", "25g/1oz flour", "150ml/5½fl oz double cream", "150ml/5½fl oz whole milk ", "30g/1oz crème fraîche", "salt", "1 tsp cayenne pepper", "1 lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the cod, preheat the oven to 330F/450F/Gas 8.", "Lightly salt the cod, wrap in cling film and leave for twenty minutes. Wash the salt off and cut the cod in half.", "For the mashed potato, cook the potatoes in a large pan of boiling water until soft. Drain and return to the pan to dry out a little. ", "For the parsley sauce, give any open cockles a sharp tap on the work surface, discard any that do not close immediately.", "Heat a heavy-based pan until hot. Add the cockles, parsley stalks, shallots and wine. Put the lid on and steam until the cockles open. Drain in a colander, reserving the stock. Discard any cockles that have not opened. Pass the stock through a muslin cloth.  ", "In a clean pan, melt the butter and then stir in the flour to make a roux.  Cook for a few minutes, then gradually add the stock, stirring all the time. Then add the cream, milk and crème fraîche. Season, to taste, with salt, cayenne pepper and lemon juice.", "For the cod, heat the butter in an ovenproof frying pan. Add the cod then transfer to the oven for eight minutes.", "Meanwhile, for the parsley sauce, pick the cockles from their shells and add to the sauce along with the parsley. Keep warm, but do not boil. ", "For the mashed potato, push the potatoes through a potato ricer or a drum sieve (alternatively use a vegetable masher). In a pan, melt the butter and cream together. Fold through the mash and season with salt and white pepper.", "To serve, add the mash to serving bowls. Top with the cod and parsley sauce. "]}, {"isVegetarian": false, "title": "Cod with mango and curry", "url": "www_bbc_co_uk_food_recipes_cod_with_mango_and_curry_37791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp brown sugar", "4 tbsp chardonnay vinegar", "1 small red onion, finely sliced", "1 firm mango, peeled, roughly chopped, stone discarded", "1 tbsp grated ginger", "1 small red chilli, halved, seeds removed, julienned", "4 x 150g/5½oz cod loin, skin on, pin boned", "sea salt and freshly ground black pepper", "1 tsp mild curry powder", "20g/¾oz butter", "1 tbsp olive oil", "60ml/2fl oz fish stock", "60ml/2fl oz coconut milk", "100ml/3½fl oz whipping cream, lightly whipped, plus 2 tbsp cream", "1 tbsp chopped chervil", "1 tsp lemon juice", "1 baby gem lettuce, cut in four", "½ cucumber, peeled, seeds removed, in large julienne"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a small frying pan until medium hot. Add the sugar and vinegar and cook until the sugar has dissolved - about 1-2 minutes. Add the onion, the mango and ginger and cook over a low heat for about six minutes, or until the mango has softened but still is holding its shape. Add the chilli, stir gently to combine then remove from the heat and set aside to cool while you fry the fish. ", "Season the cod on both sides with salt, black pepper and the curry powder. Heat a medium non-stick frying pan over a medium-high heat. Add the butter and olive oil and, when foaming, add the cod, skin-side down and fry for 3-4 minutes, or until the skin is golden-brown and crisp.", "Put four 46x25cm/18x10in rectangles of greaseproof paper on a clean work surface. Arrange your ingredients on one half of the paper, so that you will be able to fold the other half over them afterwards: start with the mango mixture, dividing it equally between the four sheets, then place the cod, skin-side up on top. ", "Fold the paper over the filling and then fold along the edges to seal securely. Make sure the parcels are well sealed so that none of the liquid is lost. Put the parcels on a baking tray and bake for 8-10 minutes. Remove from the oven and leave to rest for two minutes before opening. ", "While the fish cooks, make the sauce. Heat a small pan over a medium heat, pour the fish stock and coconut milk in and bring to the boil, then reduce the heat and simmer gently until reduced by half, for about 4-5 minutes. By now, the fish should be ready, carefully open one side of each parcel and pour out the cooking juices into the sauce, then place the parcels straight onto serving plates. Whisk the whipped cream into the sauce, return to the boil, then remove from the heat and check the seasoning. Add the chervil and finish with the lemon juice.", "Serve the fish parcels with the sauce, along with the baby gem and cucumber.  "]}, {"isVegetarian": false, "title": "Cod with pesto, roast potatoes and peppers traybake", "url": "www_bbc_co_uk_food_recipes_cod_with_pesto_roast_14470", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cod_with_pesto_roast_14470_16x9.jpg", "ingredients": ["640g/1lb 7oz floury potatoes, preferably Maris Piper, peeled and thinly sliced", "2 red peppers, sliced", "2 bay leaves", "2 garlic cloves, finely chopped", "2 tbsp olive oil", "½ tsp sea salt flakes ", "4 x 120g/4oz cod fillets, skinless and boneless ", "freshly ground black pepper", "½ garlic clove ", "25g/1oz pine nuts ", "50g/1¾oz fresh basil leaves", "5 tbsp olive oil ", "25g/1oz Parmesan, finely grated", "1 tbsp lemon juice ", "½ tsp sea salt flakes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Mix the potatoes, peppers, bay, garlic, oil, salt and a good pinch of black pepper in a large roasting tin. Cover tightly with kitchen foil and bake for 1 hour.", "Meanwhile, to make the pesto, blend the garlic and pine nuts in a food processor. Add the basil and pulse until roughly chopped. With the motor still running, add the oil and blend briefly. Stir in the Parmesan, lemon juice and salt. ", "Place the cod on top of the vegetables and spread each fillet with a quarter of the pesto. Bake, uncovered, for 15 minutes, or until the fish is cooked through. Serve immediately."]}, {"isVegetarian": false, "title": "Cod and chips with peas", "url": "www_bbc_co_uk_food_recipes_codandchipswithpeas_86983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, peeled and chopped", "½ red or green chilli, finely chopped", "140g/5oz pancetta cubes or streaky bacon, chopped", "200g/7oz frozen peas, defrosted", "500g/1lb 2oz potatoes, peeled and cut into chips", "1 litre/1¾ pints vegetable oil, for deep-frying", "1 sprig fresh rosemary, leaves only, chopped", "salt, to taste", "100g/3½oz self-raising flour", "100g/3½oz cornflour", "1 tsp Chinese five-spice powder", "1 tsp salt, plus extra to taste", "175-200ml/6¼-7¼fl oz soda water", "2 x 175g/5oz cod or hoki fillets", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the peas, heat the oil in a frying pan over a medium heat and fry the onion for 1-2 minutes. Add the chilli and stir well.", "Add the pancetta or bacon and cook for 8-10 minutes until golden-brown and crisp.", "Add the peas to the pan, give the pan a good shake and cook for a further 2-3 minutes.", "For the chips, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the potatoes into the hot oil. Cook for about ten minutes, until golden-brown and crisp. Remove from the pan using a slotted spoon and drain on kitchen paper.", "Sprinkle with the rosemary and a little salt.", "For the fish, sift the flour, cornflour, five-spice powder and salt into a bowl and stir.", "Gradually pour in the soda water, whisking continuously, to make a smooth batter the consistency of thick double cream.", "Using tongs, dip the fish fillets into the batter to coat completely, shaking off any excess.", "Place the fish into the hot oil that the chips were cooked in. Cook for 4-5 minutes, turning carefully from time to time.", "When golden-brown and crisp, remove the fish from the oil with a slotted spoon and drain on kitchen paper. Sprinkle with salt, to taste.", "To serve, place the fish onto plates with the chips and peas and lemon wedges."]}, {"isVegetarian": false, "title": "Cod and chorizo orzo", "url": "www_bbc_co_uk_food_recipes_codandchorizoorzo_90791", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz orzo pasta", "225g/8oz cod fillet, skinless and boneless", "salt and freshly ground black pepper ", "5 tbsp olive oil", "200g/7oz cooking chorizo, roughly chopped", "½ tsp smoked hot paprika", "90g/3½oz roasted red peppers (from a jar), cut into strips", "3 tbsp chopped fresh flatleaf parsley", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Bring a large pan of salted water to the boil, add the orzo and cook for 10-12 minutes, or until just tender. Drain the orzo and set aside.", "Season the cod with salt and freshly ground black pepper. Heat an ovenproof frying pan until smoking, add one tablespoon of the olive oil and fry the cod for 1-2 minutes on both sides, or until golden-brown all over. Transfer to the oven to cook for 3-4 minutes, or until the fish is cooked through. ", "Remove the fish from the pan and flake the flesh onto a plate. ", "Heat a pan until hot, add the remaining olive oil and the chorizo and fry for 2-3 minutes, or until the chorizo is cooked and the oils are released into the pan. Using a slotted spoon, remove the chorizo from the pan and set aside.", "Add the cooked orzo and smoked sweet paprika to the pan, stir well to coat in the oil and cook for 1-2 minutes. Return the chorizo to the pan and add the roasted red peppers and flaked cod. Mix well to combine and season with salt and freshly ground black pepper. Stir in the parsley and lemon juice.", "To serve, spoon onto serving plates."]}, {"isVegetarian": false, "title": "Cod and chorizo with fennel", "url": "www_bbc_co_uk_food_recipes_codandchorizo_79585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pieces cod fillet, about 150-200g/5¼-7oz", "100g/3½oz black olive tapenade ", "1 tbsp olive oil", "2 bay leaves", "sprig of thyme", "125g/4oz chorizo, thinly sliced", "a few basil leaves", "1 tbsp basil oil", "50g/2oz aubergine, cut in half", "1 tbsp olive oil", "2 baby banana shallots, blanched and sliced in half", "handful of black olives", "½ lemon, juice only", "salt and cracked white pepper", "2 baby fennel, blanched ", "16-20 cherry tomatoes", "250ml/8¾oz tomato juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/430F/Gas 7.", "Make a cut in the side of each cod fillet, and slide the knife around to create a little pocket.", "Spread the tapenade inside. ", "Heat a large ovenproof pan until hot then add the olive oil.", "Add the bay leaves, thyme, chorizo and cod skin-side down and fry for two minutes.", "Turn the fish over so it is skin side up then place the pan into the oven for about five minutes or until the skin is golden and flesh is just cooked.", "For the fennel accompaniment, place the aubergine on a tray in the oven for 10-12 minutes.", "Remove and allow to cool slightly before removing the skin and cut into chunks.", "Heat a frying pan until hot then add the olive oil.", "Add the shallots and aubergine and cook for a couple of minutes.", "Season with salt and cracked white pepper.", "Add the baby fennel, olives, tomatoes and lemon juice and cook for a further two minutes.", "Serve with the cod. Served garnished with basil leaves nad drizzled with basil oil.", "For the tomato juice, place the juice into a small saucepan and gently bring to the boil.", "Serve drizzled around the plate with the cod and chorizo"]}, {"isVegetarian": false, "title": "Cod with parsley sauce and mash", "url": "www_bbc_co_uk_food_recipes_codwithparsleysauce_92631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz full-fat milk", "½ onion, peeled, finely sliced ", "pinch freshly grated nutmeg", "1 fresh bay leaf", "4 whole white peppercorns", "35g/1½oz butter", "25g/1oz flour", "3 tbsp chopped fresh parsley leaves", "salt and freshly ground black pepper", "200g/7oz new potatoes, cooked until tender, drained", "200g/7oz celeriac, peeled and cut into cubes, cooked until tender, drained", "75g/3oz butter", "1 tbsp double cream", "salt and freshly ground black pepper ", "50g/1¾oz flour", "salt and freshly ground black pepper", "4 x 175g/6oz cod fillets", "1-2 tbsp vegetable oil", "75g/3oz butter", "1 lemon, juice only, plus extra lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsley sauce, slowly bring the milk, onion, nutmeg, bay leaf and white peppercorns to a simmer in a pan. Remove the pan from the heat and set aside to cool for 8-10 minutes.", "Meanwhile, melt 25g/1oz of the butter in a heavy-based pan. Whisk in the flour to create a smooth paste (this is called a roux), then cook, whisking continuously, for one minute, or until the paste has thickened. Remove the pan from the heat.", "Strain the milk mixture into the roux mixture, then whisk well until completely incorporated. ", "Return the pan to the heat and gradually bring the mixture to the boil, whisking continuously, until the sauce has thickened enough to coat the back of the spoon.", "Stir in the remaining 10g/½oz of butter until the sauce is glossy, then simmer for 2-3 minutes. Stir in the parsley and season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the mash, crush the cooked potatoes and celeriac cubes in a pan with the butter and cream until smooth and well combined. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the cod, sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Dredge the cod fillets in the seasoned flour until completely coated.", "Heat the oil in a frying pan over a medium heat. When the oil is hot, add the coated cod fillets and fry for 2-3 minutes on each side, or until crisp and golden-brown on both sides and cooked through. (NB: The cod is cooked through when the flesh is opaque.) ", "When the cod is almost cooked through, dot the cod fillets with the butter, then squeeze over the lemon. When the butter has melted, remove the pan from the heat. ", "To serve, spoon a portion of the mash into the centre of each of four serving plates. Place one fried cod fillet on top of each serving. Drizzle over the pan juices, then pour over the parsley sauce. Garnish each plate with a lemon wedge."]}, {"isVegetarian": false, "title": "Codfish (klippfisk) soup", "url": "www_bbc_co_uk_food_recipes_codfish_klipfisk_soup_18817", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/codfish_klipfisk_soup_18817_16x9.jpg", "ingredients": ["1kg/2lb 4oz Klippfisk (salt cod) that has been soaked for 24 hours", "1.8 litre/3¼ pints boiling water", "1 medium sprig rosemary", "15 mustard seeds", "5 allspice", "5 white peppercorns", "5 cloves", "1 garlic clove, finely chopped", "1 small leek, finely shredded", "1 onion, sliced", "3 carrots, shredded or sliced", "100g butter ", "700ml/1¼ pints milk", "700ml/1¼ pints soured cream ", "rosemary sprigs, to garnish"], "serves": "Serves 6 - 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Add all the stock ingredients to a pan and let simmer for 20 minutes.", "Strain, reserving the fish meat, carrots, onions and garlic but discarding everything else.", "Crumble the reserved fish into small pieces. Divide into portions of about 50 grams per person, and keep separate.", "Add the remaining soup ingredients (butter, milk and sour cream)  and simmer for 20 minutes. If you feel the soup is too thin, you can thicken with cornflour but this is usually not necessary.", "When the broth is suitably thick, add the reserved carrots, onions and garlic.", "To serve, divide the broth between the bowls, add a portion of crumbled klippfisk to each bowl and decorate with a sprig of rosemary.", "Serve with bread."]}, {"isVegetarian": true, "title": "Coffee and chestnut meringue cake", "url": "www_bbc_co_uk_food_recipes_coffee_and_chestnut_29340", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 free-range eggs", "350g/12oz caster sugar", "250g/9oz plain flour", "100g/3½oz cocoa powder", "85g/3oz butter, melted, plus extra for greasing", "400ml/14fl oz double cream", "5 tbsp cold strong coffee", "3 tbsp icing sugar, sieved", "250g/9oz mascarpone, softened", "250g/9oz mascarpone", "225g/8oz sweetened chestnut purée", "300ml/10fl oz double cream", "6-8 tbsp brandy", "4-6 large meringue nests, crumbled", "225g/8oz caster sugar", "100ml/3½fl oz water", "4 free-range eggs, whites only", "holly, to garnish"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chocolate cake, preheat the oven to 180C/350F/Gas 4. Lightly grease and line the base of a 25cm/10in loose-bottomed cake tin.", "Whisk the eggs and sugar together in a bowl for 4-5 minutes, or until thick and pale.", "Sift the flour and cocoa powder into a separate bowl then gently fold them into the egg and sugar mixture until just combined and stir in the melted butter.", "Spoon the mixture into the cake tin, lightly smoothing over the top. Place the tin onto a baking sheet and bake in the oven for 35 minutes, or until the cake has risen and is springy to the touch. Remove from the oven, allow to cool briefly then turn out onto a wire rack to cool completely.", "For the coffee mousse, place the cream, coffee and icing sugar into a bowl and whisk to soft peaks.", "Beat the mascarpone in a bowl until very smooth then fold the cream mixture into the mascarpone until just combined.", "For the chestnut mousse, place the mascarpone and chestnut purée into a small processor and blend until smooth.", "Whip the double cream until soft peaks form then fold in the chestnut mixture until just combined.", "For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C/230F on a sugar thermometer.", "At this stage, whisk the egg whites in the bowl of an electric mixer until firm peaks form when the whisk is removed.", "Continue heating the sugar syrup and as soon as it reaches 121C/250F remove the pan from the heat.", "Immediately resume whisking the egg whites with the beater at its lowest speed then pour in the sugar syrup in a steady stream. (CAUTION: Ensure the syrup is clear of the beaters to prevent it being splashed on your hands.)", "Continue beating for about five minutes or until the meringue is tepid.", "To assemble, cut the chocolate cake horizontally into five pieces, placing the bottom piece onto the serving plate.", "Spoon over 1-2 tbsp of the brandy then spread over half the coffee mousse then scatter over a quarter of the crumbled meringue nests.", "Place another piece of sponge on top, sprinkle with another 1-2 tbsp brandy then spread with half the chestnut mousse another quarter of the meringue.", "Repeat these layers, finishing with a layer of sponge.", "Spread the Italian meringue over the sides and top of the sponge stack, forking the meringue to make little peaks.", "Using a blow torch, glaze the meringue until just golden-brown and garnish with holly."]}, {"isVegetarian": true, "title": "Coffee and walnut battenberg cake", "url": "www_bbc_co_uk_food_recipes_coffee_and_walnut_88342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz margarine", "100g/3½oz caster sugar  ", "2 free-range eggs ", "100g/3½oz self-raising flour", "½ tsp baking powder", "50g/1¾oz ground almonds", "few drops vanilla extract", "3 tsp milk", "1½ tsp instant coffee powder", "25g/1oz shelled walnuts, chopped ", "100g/3½oz icing sugar", "40g/1½oz butter, softened ", "½ tsp instant coffee powder ", "1½ tsp milk", "225g/8oz white marzipan", "5 small walnut pieces"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, preheat the oven to 170C/325F/Gas 3. Grease the bottom and sides of a 20cm/8in square, shallow cake tin. ", "Cut out a piece of greaseproof paper that is 7.5cm/3in longer than the length of the tin. Fold the paper in half widthways. Open out the paper and push up the centre fold to make a 4cm/1½in pleat. Line the base of the tin with this, making any adjustments to ensure the pleat runs down the centre of the tin making in effect two rectangular 'tins' within the tin.", "Beat the margarine, sugar, eggs, flour, baking powder and ground almonds in a large bowl for about 2-3 minutes, or until smooth, slightly lighter in colour and glossy looking. (If you put a damp cloth under the bowl, it stops it from moving around.)", "Spoon slightly more than half the mixture into a separate bowl and stir in the vanilla extract and 1½ teaspoons of the milk. Set aside. ", "Mix the coffee in the remaining 1½ teaspoons of milk, stirring until it has dissolved (you don't need to heat the milk), then stir this into the other bowl of mixture along with the chopped walnuts. Spoon the vanilla mixture into one half of the tin and the coffee-walnut mixture into the other half. Level the surface of each half with a knife. Check the paper divider is still straight and in the middle.", "Bake in the oven for 35-40 minutes or until the cake is well risen, springy to the touch and has shrunk slightly from the sides of the tin. Leave to cool in the tin for a few minutes, then loosen the cake from the sides with a round bladed knife, turn it out, peel off the parchment liner and finish cooling on a wire rack. ", "For the butter icing, sift the icing sugar into a medium bowl. Add the butter. Mix the coffee and milk together until the coffee has dissolved, and pour into the bowl. Beat everything together with a wooden spoon until soft and smooth. Set aside.", "Trim the crispy outer edges off the cooled cake with a serrated knife, then cut and trim if necessary into 4 equal strips. Lay one vanilla and one coffee-walnut strip next to each other, then use a little of the butter icing to stick them together. Spread a bit more icing on the top. Stick the remaining two strips together with icing and place them on top to create a chequerboard effect. ", "Spread a little more icing over the top of the assembled cake. ", "Cut two pieces of string, one that is the length of the assembled cake and one that will wrap all around it.", "Roll the marzipan out, on a work surface lightly dusted with sifted icing sugar, into an oblong the length of the cake and sufficiently wide to wrap around the cake, using the pieces of string as your measuring guide. ", "Lay the butter iced side of the cake on the marzipan, positioning it so that when you lift up one long side, it perfectly covers one side of the cake (this way the join will be neatly in the corner). ", "Reserve a teaspoonful of the icing and spread the rest over the remaining three sides of the cake (not the ends). Brush off any crumbs from the marzipan and work surface. Roll the cake over in the marzipan, pressing to neatly cover it, then brush the corner join lightly with water, pressing it to seal. (Try to avoid touching the marzipan with wet fingers as they will mark it.) Turn the cake over so that the join is underneath. Trim a slim slice from each end of the cake to neaten and show off the chequerboard effect. Smooth the marzipan over with your hands so their warmth will give it a smooth finish.", "While the marzipan is still soft, crimp the edges by pinching the marzipan between your thumb and first finger at a slight angle and at regular intervals. Score the top of the cake with long diagonal lines using a sharp knife. Sift over some icing sugar to lightly dust the top, then lay the walnut pieces down the centre, securing with the reserved butter icing. "]}, {"isVegetarian": true, "title": "Coffee and chocolate custard pots", "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_52759", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_and_chocolate_52759_16x9.jpg", "ingredients": ["400g shop-bought low-fat custard", "60g/2¼oz dark chocolate (minimum 70% cocoa solids), broken into pieces", "40ml/1½fl oz strong espresso coffee", "½ orange, finely grated zest only", "¼ tsp ground cardamom", "25ml/1fl oz light squirty cream, to serve", "¼ tsp cocoa powder, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the custard in a saucepan over a medium heat. Add the chocolate, espresso, orange zest and cardamom, stirring continuously until the chocolate has melted. Sieve into a jug.", "Divide equally between four 125ml/4½oz pots or serving bowls and refrigerate to firm up for at least 3 hours (it won’t set completely firm).", "When ready to serve, top with light squirty cream and a dusting of cocoa powder."]}, {"isVegetarian": true, "title": "Coffee and chocolate baklava and breakfast baklava", "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_14427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["14 sheets ready-made filo pastry ", "200g/7oz unsalted butter, melted", "50g/1¾oz milled porridge oats, soaked overnight in 100ml/3½fl oz apple juice", "75g/2½oz roasted chopped hazelnuts  ", "75g/2½oz flaked almonds ", "100g/3½oz dried cranberries, cherries and strawberries", "100ml/3½fl oz honey", "10 slices dried apple, chopped", "½ tsp ground star anise", "2 tsp ground ginger ", "2 tsp ground cinnamon", "2 pieces stem ginger, chopped ", "50g/1¾oz demerera sugar", "400ml/14fl oz apple juice ", "200g/7oz caster sugar", "125g/4½oz roasted chopped hazelnuts ", "2 tbsp cocoa powder ", "2 tbsp instant espresso coffee", "50g/1¾oz chocolate chips ", "1 whole star anise", "30g/1oz demerera sugar ", "300ml/10½fl oz orange juice ", "150g/5½oz caster sugar", "1 tbsp orange blossom extract ", "1 orange, zest only"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the breakfast baklava, preheat the oven to 180C/350F/Gas 4 and grease a large baking tray with butter. Trim eight sheets of filo so they fit neatly in the tray. ", "Place one sheet of filo in the tray and brush with melted butter then place another sheet of filo on top. Sprinkle a layer of oats, nuts, dried fruits, spices, honey, dried apple and stem ginger over. Repeat this process two more times, brushing the filo with butter as you go, then top with a double layer of filo. ", "Before buttering the final sheet of filo, use a sharp pointed knife to cut the baklava in half lengthways. Then cut it in thirds widthways  to make six pieces. Cut each piece on the diagonal to make 12 triangles. Brush the top with butter then add a sprinkling of demerera sugar. ", "Bake for 25-30 minutes, or until golden-brown.  ", "While the baklava is cooking, make a syrup. In a saucepan, heat the apple juice and sugar over a low heat until the sugar is dissolved then bring to the boil. Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C/226F, then remove from the heat and allow to cool.", "When the baklava is cooked, pour over the cooled syrup.  Set aside to cool completely before removing from the tin.", "For the coffee and chocolate baklava, combine the chopped hazelnuts, cocoa, coffee, chocolate, star anise and demerera sugar in a bowl to make the filling.", "Preheat the oven to 200C/400F/Gas 6. Grease a large baking tray with butter. ", "Cut the remaining six sheets of filo in half to create 12 squares and brush one piece with melted butter.  Lay another square over the top and brush with more butter.  Spread a third of the filling over the top then add another piece of filo, brush with butter and finish with another piece of filo, buttering as before.  ", "Using a wooden spoon handle as an aid, gently roll the filo into a sausage then squash it slightly and place in the prepared tin.  Repeat to make two more filo rolls.  ", "Cut each roll into quarters to make 12 portions.  Brush butter all over.", "Bake for 15 minutes, then reduce the oven temperature to 180C/350F/Gas 4 and bake for another 10-15 minutes.  ", "Meanwhile, make a syrup. Heat the orange juice and caster sugar in a pan until the sugar is dissolved then bring to the boil.  Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C/226F, then remove from the heat. Stir in the orange blossom extract and set aside to cool.", "When the baklava is cooked, scatter the orange zest on top and pour over the cooled syrup. Set aside to cool completely before serving."]}]