[{"ingredients": ["2 piezas del tamaño de un puño pan de chapata o cualquier otro pan sin cortar", "2 filetes de anchoa", "3 cucharadas de alcaparras escurridas", "4 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "Tomates 600g / 1lb 2oz, picados", "1 bolsa de hojas de ensalada mixtas", "sal y pimienta"], "method": ["Precaliente el horno a 110C / 225F / Gas ¼ o su configuración más baja.", "Ripea el pan en trozos del tamaño de un bocado, colócalo en una bandeja para hornear y hornea por unos 20 minutos. Asegúrate de que no se quema; lo que estás buscando es pan que sale un poco rancio.", "Mientras tanto, coloca las anchoas, dos cucharadas de las alcaparras, el aceite y el vinagre en un almirez y mortero y aplasta en un aderezo.", "Tómese un tazón grande para mezclar, ponga los tomates y el pan y vierta el aderezo, luego enganche con las manos. Dale un suave apretón para asegurarte de que el pan esponjoso absorba todos los jugos.", "Finalmente, incline las hojas de la ensalada en un plato para servir y deje caer el contenido del tazón sobre la parte superior, terminando con las alcaparras restantes y algo de sal y pimienta."], "url": "www_bbc_co_uk_food_recipes_panzanella_87364", "title": "panzanella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_87364_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 puñados trozos de masa fermentada rancia u otro pan", "sal y pimienta negra recién molida", "7 cucharadas de aceite de oliva virgen extra", "2 cucharadas de vinagre de vino tinto", "1 pepino mediano, pelado, cortado en pequeños trozos", "1 cebolla roja de tamaño mediano", "6 tomates de vid", "3 dientes de ajo, finamente picados", "puñado de hojas de albahaca rotas"], "method": ["Incline el pan en un recipiente, sazone al gusto con sal y pimienta y agregue el aceite de oliva y la mitad del vinagre de vino tinto.", "Retire las pieles de tomate colocando los tomates en agua hirviendo durante unos segundos y refrescándolos en un recipiente con agua helada. Las pieles ahora deberían despegarse fácilmente. Agregue los tomates al pan, junto con el pepino y la cebolla roja. Esparce sobre el ajo finamente picado y agrega una pizca de sal. Mezcle hasta que esté bien combinado.", "Vierta el resto del vinagre de vino tinto, más más al gusto, agregue las hojas de albahaca y mezcle con las manos hasta que estén bien combinadas. Servir."], "url": "www_bbc_co_uk_food_recipes_panzanella_tuscan_tomato_09380", "title": "Panzanella (ensalada toscana de tomate y pan)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panzanella_tuscan_tomato_09380_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 papaya, pelada y descamada", "150ml / 5fl oz de crema doble", "1 vaina de vainilla, solo semillas", "2 cucharadas de azúcar en polvo", "2 cucharadas de pasas", "55 g / 2 oz de mantequilla", "75ml / 2½ fl oz crema doble", "1 ramita de menta fresca, para adornar"], "method": ["Para la mousse, coloque la carne de papaya en una licuadora y mezcle con un puré. Batir la crema junto con las semillas de vainilla hasta que se formen picos rígidos cuando se quite la batidora. Agregue la papaya y enfríe.", "Para la salsa de caramelo con pasas, caliente el azúcar en polvo en una sartén. Agregue las pasas y cocine a fuego lento hasta que el caramelo comience a burbujear. Agregue la mantequilla y, cuando se derrita, agregue la crema. Cocine por unos minutos más hasta que la salsa se espese y se vuelva dorada.", "Para servir, espolvorea la salsa de caramelo y pasas en la base de un vaso y rellena con la mousse de papaya. Adorne con una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_papayamoussewithrais_88611", "title": "Mousse de papaya con salsa de pasas de caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de crema doble, batida hasta que quede rígida", "100g / 3½oz de papaya, pelada, sin semillas y finamente picada", "2 cucharadas de miel líquida", "1 cucharada de papaya, cortada en cubos pequeños, para adornar"], "method": ["Coloque la crema, la papaya picada y una cucharada de miel en un tazón y dóblese.", "Coloque un anillo de chefs aceitado de 5cm / 2in en el centro de un plato y cuchara en parte de la mezcla.", "Para servir, quite el anillo de los chefs, rocíe sobre la cucharada restante de miel y adorne con los cubos de papaya en la parte superior."], "url": "www_bbc_co_uk_food_recipes_papayamousse_81583", "title": "Mousse de papaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 tentáculos de pulpo (alrededor de 350 g / 12 oz)", "5-6 calamar bebé, limpiado, tentáculos separados", "2 cucharadas de aceite de oliva virgen extra", "6 gambas crudas, idealmente rojas sicilianas", "½ limón, solo jugo", "2 filetes de anchoa, finamente picados", "sal marina y pimienta negra", "2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "2 x 400 g. Sazonan los tomates italianos pelados en agua, escurridos (o usan tomates en lata)", "puñado de tomates cherry, desollados y toscamente picados", "5 rebanadas de masa madre rancia, cortada en trozos", "puñado de hojas de albahaca fresca", "pizca de azúcar en polvo", "1 diente de ajo, finamente picado", "puñado de hojas de albahaca fresca, picada", "1 limón no encerado, ralladura fina y jugo", "6 cucharadas de aceite de oliva virgen extra", "1 chile rojo, sin grano y finamente picado", "2 cucharadas de hojas de albahaca finamente picadas", "2 rebanadas de pan plano, idealmente panela de pan de Cerdeña, tostadas"], "method": ["Para los mariscos, comience por hervir los tentáculos del pulpo en agua durante 30 minutos, o hasta que estén tiernos. Desagüe.", "Mientras tanto, para la pappa al pomodoro, caliente el aceite en una cacerola a fuego medio-bajo. Agregue la cebolla y cocine por unos minutos, hasta que se ablande. Agregue los tomates embotellados y frescos, masa fermentada, hojas de albahaca, azúcar y una pizca de sal. Cubra y cocine por unos minutos.", "Para el salmoriglio, separa todos los ingredientes del guindilla en mortero y tritura hasta que se combinen. Agregue la guindilla y una pizca de sal, luego reserve.", "Corta cada tentáculo de pulpo en pedazos del tamaño de un bocado. Marca el calamar en todo el cuerpo. Pat todo seco. Mezcle las piezas de pulpo y el calamar, con sus tentáculos, en el aceite.", "Calentar una sartén a fuego medio-alto. Pon el pulpo en la sartén con el lado cortado hacia abajo. Agregue el calamar y las gambas y sazone con sal y pimienta. Exprima el jugo de limón y cocine durante 3-4 minutos, o hasta que las gambas y el calamar estén bien cocidos. Transfiera a un tazón y mezcle con la anchoa y la mitad del salmoriglio.", "Para servir, coloque la pappa al pomodoro en dos platos hondos, coloque los mariscos encima y rocíe con el salmoriglio restante. Espolvorea sobre la albahaca y sirve con el pan tostado."], "url": "www_bbc_co_uk_food_recipes_pappa_al_pomodoro_with_15568", "title": "Pappa al pomodoro con calamares, pulpo y gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz '00' harina (harina de pasta), más extra para espolvorear", "2 cucharadas de aceite de oliva", "3 huevos grandes de gallinas camperas", "1 cucharadita de sal marina fina", "aceite de oliva virgen extra y pimienta negra recién molida (opcional)"], "method": ["Ponga la harina, el aceite de oliva y los huevos en una batidora o en un procesador de alimentos y mezcle hasta que los ingredientes se unan y formen una masa. Siga mezclando por un minuto, quitando la tapa y girando la masa cada 15-20 segundos. Esto ayudará a que la masa sea más suave. Tenga cuidado de no cortar los dedos en la cuchilla si usa un procesador de alimentos.", "Alternativamente, junte los ingredientes con las manos, trabajando los huevos en la harina un poco a la vez.", "Convierta la masa en una superficie ligeramente enharinada y amasar durante 10 minutos, realmente aporreando y estirando la masa hasta que quede sedosa con un ligero brillo. Envuelva la película adherida y deje enfriar en la nevera durante 30 minutos. Alinee un par de bandejas grandes con pergamino para hornear y espolvoree con un poco de harina tamizada (estas se usarán para preparar la pasta fresca para que se seque).", "Saca la pasta del refrigerador y quita la película adhesiva. Divida en tres pedazos y vuelva a envolver dos de ellos. Forme la pasta restante en un bloque y extiéndala en una superficie muy ligeramente enharinada tan finamente como pueda, incluso más delgada que una pieza de dos peniques. Desea terminar con un rectángulo de aproximadamente 48x30 cm / 19x12 pulgadas. Voltee la masa con regularidad y espolvoree con una pequeña cantidad de harina si comienza a pegarse. No se preocupe si no es perfecto, siempre y cuando pueda hacer algunas tiras anchas y buenas, nadie se dará cuenta.", "Corta la pasta en tiras anchas, tendrás que hacerlas aproximadamente de 2.5 cm de ancho y alrededor de 30 cm de largo. Coloque las tiras en las bandejas, manteniendo cada hebra a unos pocos milímetros de la siguiente. Repita exactamente el mismo proceso con la pasta restante.", "La pasta puede dejarse secar durante algunas horas en este momento o usarse de inmediato. Si las bandejas se llenan demasiado, cúbralas con otra capa de pergamino para hornear y una pizca de harina y luego cree otra capa. (También puede colgar la pasta en un mango de escoba envuelto en una película adhesiva y suspendido entre dos sillas).", "Cuando esté listo para cocinar la pasta, llene a medias una olla muy grande con agua fría, agregue la sal marina fina y deje que hierva. Deja caer la pasta suavemente en el agua caliente y vuelve a hervir, revolviendo con una cuchara larga de madera para separar los hilos.", "Cocine por 2-3 minutos, o hasta que la pasta esté tierna pero firme, revolviendo ocasionalmente. Puede probar la pasta quitando una de las piezas y cortando un poco de un extremo para probar. (Si su sartén no es lo suficientemente grande para toda la pasta, cocínela en dos tandas y agite el primer lote con un poco de aceite de oliva una vez que se haya drenado).", "Escurrir la pasta en un colador y volver a la cacerola. Mezcle con un poco de aceite de oliva y aderezo o la salsa de pasta de su elección. Incline en un plato de servir calentado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pappardelle_pasta_94960", "title": "Pasta Pappardelle", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla grande, finamente picada", "5 cucharadas de aceite de oliva", "sal y pimienta recién molida", "3 rebanadas de tocino rayado, picadas", "50g / 1¾oz de pan blanco fresco", "puñado de perejil (o las hierbas que prefieras, orégano, tomillo y salvia, todo funciona bien), picado", "Carne picada de carne 250 g / 9 oz", "Carne picada de cerdo 250 g / 9 oz", "1 yema de huevo de gallinas camperas", "50ml / 2fl oz de vino tinto", "3 tomates grandes, más o menos picados", "1 x 400g / 14oz de tomates picados en lata", "Pappardelle 500 g / 1lb 2oz", "queso rallado, para servir (quesos duros como parmesano, pecorino y queso cheddar maduro funcionan bien)"], "method": ["Caliente el aceite de oliva en una cazuela de base pesada o en una cacerola grande a fuego lento. Agregue la cebolla y sazone generosamente con sal y pimienta negra recién molida. Aumente el fuego a medio y agregue el tocino. Cocine hasta que las cebollas estén suaves y translúcidas (no coloree).", "Agregue las migas de pan y un puñado generoso de hierbas a la sartén. Revuelva y luego retire la mitad de la mezcla y déjela a un lado en un recipiente para usar en la salsa más adelante. Transfiera la mezcla restante a una licuadora.", "Agregue la carne de res y cerdo picada a la mezcla y pulse para formar una pasta. Agregue la yema de huevo para combinar. Use sus manos para moldear la mezcla en bolas pequeñas del tamaño de pelotas de ping pong.", "Coloque las albóndigas en la cacerola y fría hasta que se doren por completo (esto puede tomar hasta 10 minutos). Retire de la sartén y reserve.", "Agregue la mezcla reservada de cebolla y tocino a la sartén. Deshielo agregando el vino tinto y raspando todos los pedazos del fondo de la sartén. Cuando el vino esté hirviendo, agregue los tomates frescos picados, manteniendo el calor alto. Continúe cocinando, revolviendo todo el tiempo hasta que empiecen a descomponerse. Agregue los tomates enlatados y una lata llena de agua. Vuelve a hervir.", "Pruebe verificar el condimento y cocine por otros cinco minutos. Regrese las albóndigas a la sartén y deje que hierva, luego baje el fuego y cocine a fuego lento durante 15 minutos.", "Mientras tanto, cocine la pasta de acuerdo con las instrucciones del paquete.", "Para servir, mezcle las albóndigas y la pasta con queso rallado, o manténgase separado si lo prefiere."], "url": "www_bbc_co_uk_food_recipes_pappardelle_and_51772", "title": "Pappardelle y albóndigas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pappardelle_and_51772_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "400 g / 14oz de ternera guisada en cubos", "700ml / 1¼ pintas de agua caliente o caldo de carne", "300 g / 10½ oz de champiñones mezclados (como ostra, botón o shiitake), lavados a fondo, tostados en rodajas", "sal y pimienta negra recién molida", "Tomates maduros de 400 g / 14 oz, cada uno cortado en ocho cuñas", "puñado de hojas de albahaca fresca picada", "puñado de hojas de perejil fresco de hojaldre", "1½ cucharadita de vinagre de vino tinto", "sal y pimienta negra recién molida", "Pappardelle de huevo seco, de 250 g / 9 oz, cocido según las instrucciones del paquete, escurrido, para servir", "1 cucharada de mantequilla, ablandada", "40 g / 1½ oz de parmesano recién rallado"], "method": ["Caliente el aceite en una sartén de base pesada. Agregue la carne de res y dore todo, revolviendo regularmente.", "Agregue los champiñones y vierta sobre el agua o el caldo de carne. Lleva la mezcla a fuego lento. Cubra a medias la sartén con una tapa y continúe cocinando la mezcla a fuego alto, revolviendo regularmente, durante 30-45 minutos, o hasta que el volumen del líquido se haya reducido, la salsa se haya espesado y la carne esté lo suficientemente tierna como para descomponerse usando una cuchara de madera.", "Para la salsa de tomate, en un tazón, mezcle todos los ingredientes de salsa de tomate hasta que estén bien combinados.", "Agregue la pasta cocida y escurrida, la mantequilla ablandada y la mitad del queso parmesano rallado a la carne cocida a fuego lento y los champiñones, revolviendo bien hasta que la pasta esté cubierta con la salsa y la mantequilla se haya derretido.", "Divida el pappardelle con carne cocida a fuego lento y champiñones por igual entre cuatro tazones para servir. Cuchara sobre la salsa de tomate y espolvorea sobre el queso parmesano restante."], "url": "www_bbc_co_uk_food_recipes_pappardellewithslowc_92023", "title": "Pappardelle con carne cocida a fuego lento y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pappardellewithslowc_92023_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tomates de ciruela, cortados por la mitad", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 pimiento rojo", "Pan de 40 g / 1½ oz cortado en cubos", "Pimientos del piquillo 110 g / 4 oz", "40 g / 1½ oz de almendras", "Avellanas de 25g / 1oz", "½ limón, solo jugo", "1 cucharadita de pimentón dulce ahumado", "3 cucharadas de perejil de flatleaf fresco picado", "4 filetes de rape de x 200g / 7oz, recortados", "1 cucharada de pimentón ahumado", "1 cucharadita de sal marina fina", "3 cucharadas de aceite de oliva", "200g/7oz padrón peppers", "2 cucharadas de berro de coriandro"], "method": ["Para la salsa romesco, precalentar el horno a 225C / 450F / Gas 8.", "Coloque los tomates en una bandeja para hornear y rocíe con un poco de aceite de oliva, sal y pimienta negra. Asar en el horno durante 15 minutos o hasta que estén tiernos.", "Usando pinzas, coloque la pimienta en un anillo de gas durante 4-5 minutos, o hasta que esté todo carbonizado.", "Coloque el pimiento en un bol, cúbralo con una película adhesiva y déjelo a un lado durante cinco minutos. Una vez que esté lo suficientemente frío para manipularlo, quita la piel y las semillas del pimiento y pártelas aproximadamente.", "Calentar una sartén hasta que esté caliente y agregar un poco del aceite de oliva y el pan. Sazonar con sal y pimienta negra recién molida. Freír por 2-3 minutos, o hasta que estén dorados y crujientes. Retire el pan de la sartén y déjelo a un lado para escurrir sobre papel de cocina.", "Retire los tomates del horno y luego retire las semillas.", "Mezcle los tomates, el pan y los pimientos picados con los ingredientes restantes en un procesador de alimentos hasta que se corten en trozos grandes. Sazonar con sal y pimienta negra recién molida.", "Para el rape pimentón, mezcle el pimentón y la sal en un plato.", "Enrolle el rape en la mezcla de pimentón hasta que esté completamente cubierto.", "Caliente una sartén hasta que esté caliente, agregue un poco del aceite de oliva y selle el rape hasta que se dore por completo, cocine durante 3-4 minutos más. Retire el rape de la sartén y déjelo reposar durante 2 o 3 minutos.", "Calentar una sartén hasta que esté caliente, luego agregue el aceite de oliva restante y los pimientos.", "Freír por 2-3 minutos, o hasta que los pimientos estén dorados e hinchados.", "Para servir, esculpe el rape en rodajas gruesas.", "Coloque la salsa de romesco en el centro de los platos para servir y cubra con los pimientos del perdón. Coloque el rape en rodajas en la parte superior y luego termine con una dispersión de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_paprika_monkfish_with_54566", "title": "Rape de pimentón con salsa romesco y pimientos de padrón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lomo de cerdo deshuesado de 750 g / 1 lb 10 oz", "sal y pimienta negra recién molida", "Ciruelas pasas 75g / 3oz, aproximadamente picadas", "75g / 3oz de albaricoques, toscamente picados", "3 cucharadas de perejil de flatillo, más o menos picado", "2 cucharadas de pimentón", "1 cucharadita de hojas frescas de orégano", "1 cucharadita de hojas frescas de tomillo", "1 diente de ajo, finamente picado", "1 cucharadita de sal marina Maldon u otra sal marina", "2 cucharadas de aceite de oliva", "125g / 4½ oz de cuscús", "150ml / 5fl oz de agua hirviendo", "75g / 3oz de anacardos, toscamente picados", "75g / 3oz de albaricoques, toscamente picados", "1 limón, solo jugo", "2 cucharadas de menta fresca, picada", "2 cucharadas de perejil fresco de flatleaf, aproximadamente picado"], "method": ["Coloque la carne de cerdo, con la carne hacia arriba, en una tabla de cortar con la tapa del vientre mirando hacia usted.", "Con un cuchillo afilado, haga una incisión a la mitad de la carne, paralela a la tabla, cortando casi hasta el final.", "Abra el lomo y sazone bien con sal y pimienta negra recién molida.", "Coloque las ciruelas pasas, los albaricoques y el perejil en un bol, sazone con sal y pimienta negra y mezcle bien.", "Coloque la mezcla de ciruela sobre la carne de cerdo y enrolle la carne alrededor del relleno, en forma de salchicha y átela en tres o cuatro lugares con hilo de cocina.", "Para la pasta de pimentón, coloque todos los ingredientes para la pasta en un recipiente limpio y mezcle para formar una pasta.", "Unte la pasta de pimentón sobre la carne de cerdo y déjela reposar para marinar durante al menos 30 minutos, más tiempo si es posible.", "Coloque la carne en una sartén caliente o barbacoa y cocine en cada lado durante 2-3 minutos para dorar todo.", "Reduzca el fuego y cocine por otros 30-40 minutos, volteándolo cada diez minutos, o hasta que el cerdo esté completamente cocido. Retirar del fuego y dejar reposar durante diez minutos.", "Para el cuscús de anacardo, coloque el cuscús en un recipiente y vierta sobre el agua hirviendo. Poner a un lado y salir hasta que se absorba toda el agua.", "Revuelva el cuscús con un tenedor. Agregue los ingredientes restantes de cuscús y revuelva bien para combinar.", "Para servir, corte la carne de cerdo en rodajas gruesas. Coloque una cucharada grande de cuscús en cada plato y cubra con un par de rebanadas de carne de cerdo."], "url": "www_bbc_co_uk_food_recipes_paprikafruityporkwit_86356", "title": "Pimentón con sabor a fruta y cuscús", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pimiento romano, núcleo y semillas eliminadas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "exprimir jugo de limón", "2 cucharadas de cilantro fresco picado", "½ chile rojo, sin semillas y cortado en tiras largas y delgadas", "sal y pimienta negra recién molida", "Pasta de linguini 85g / 3oz, cocida según las instrucciones del paquete", "1 cucharada de aceite de oliva", "botón de mantequilla", "150g / 5oz de langostinos pelados crudos", "pizca de pimentón", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque el pimiento en una sartén o bandeja para hornear y rocíe sobre el aceite de oliva, luego sazone bien con sal y pimienta negra recién molida. Coloque en el horno para hornear durante 12-14 minutos, hasta que esté cocido y ligeramente chamuscado.", "Retire del horno, coloque el pimiento en un recipiente y cúbralo con una película adhesiva durante cinco minutos. Retire la película adhesiva y despegue la piel de pimienta. Pica finamente la pimienta.", "Para el linguini, mezcle el aceite de oliva, el jugo de limón, el cilantro y el chile juntos en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida y revolver para combinar.", "Agregue la pasta al aderezo y agregue el pimiento rojo asado hasta que esté bien combinado. Reserve para permitir que los sabores se combinen.", "Mientras tanto, para las gambas, caliente el resto del aceite de oliva en una sartén. Agregue el aceite de oliva y la mantequilla y una vez que la mantequilla esté espumante, agregue las gambas.", "Espolvorear sobre el pimentón, revolviendo bien para cubrir, luego freír las gambas durante 1-2 minutos o hasta que las gambas estén cocidas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la ensalada de pasta en un recipiente y coloque las gambas encima."], "url": "www_bbc_co_uk_food_recipes_paprikaprawnswithroa_87758", "title": "Gambas al pimentón con ensalada de pasta de cilantro y pimienta asada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo", "1 cucharada de pimentón", "1 cucharada de mostaza integral", "1 cucharada de curry en polvo", "1 naranja, solo ralladura", "2 muslos de pollo, huesos retirados", "sal y pimienta negra recién molida", "1 naranja, solo jugo", "1 cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "100 g / 3½ oz de coles de Bruselas blanqueadas", "1 cucharada de miel clara"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el frotamiento de pollo, coloque todos los ingredientes de frotar en un procesador de alimentos y mezcle hasta obtener una pasta gruesa.", "Para el pollo, sazone bien el pollo con sal y pimienta negra recién molida y frote con la mezcla de frotar.", "Caliente el aceite de oliva y la mantequilla en una sartén a prueba de horno, luego agregue los muslos de pollo y fría por un minuto en cada lado.", "Vierta sobre el jugo de naranja y transfiéralo al horno para asar durante 15-20 minutos, o hasta que el pollo esté completamente cocido.", "Para las coles de Bruselas, caliente el aceite de oliva y la mantequilla en una sartén. Agregue las coles de Bruselas y freír, agitando continuamente la sartén, durante tres minutos, hasta que todo esté dorado.", "Rocíe la miel, sazone con sal y pimienta negra recién molida y mezcle bien.", "Para servir, coloque las coles de Bruselas en un plato con los muslos de pollo dispuestos en la parte superior."], "url": "www_bbc_co_uk_food_recipes_paprikamustardandora_84962", "title": "Pimentón, mostaza y pollo a la naranja en coles de Bruselas dulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla picada", "2 dientes de ajo picados", "1 cucharadita de pimentón ahumado", "Piezas de Quorn de 150g / 5oz", "150ml / 5fl oz de vino blanco", "150ml / 5fl oz de crema doble", "85g / 3oz de tomates cherry, cortados a la mitad", "Harina de auto aumento de 150g / 5oz", "1 cucharadita de polvo de hornear", "1 cucharada de aceite de oliva", "75ml / 2½ fl oz de leche", "85g / 3oz de queso doble Gloucester, rallado"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Para los ragu, caliente el aceite en una sartén y fríe con cuidado la cebolla y el ajo durante 4-5 minutos, hasta que estén blandos.", "Agregue el pimentón ahumado y las piezas de Quorn y mezcle bien. Continúe freír durante 5-7 minutos, luego agregue el vino y deje que hierva.", "Agregue la crema y las mitades de tomate y cocine a fuego lento durante 3-4 minutos.", "Para las albóndigas, coloque la harina, polvo de hornear, aceite y suficiente leche para unir la mezcla en un procesador de alimentos y pulse hasta que se unan como una masa.", "Agregue el queso y vuelva a pulsar para simplemente combinar.", "Ruede los pedazos de la mezcla en bolas del tamaño de una mandarina, luego colóquelas en una bandeja para hornear. Presione las bolas de masa un poco, luego transfiéralas al horno para hornear durante 8-10 minutos, o hasta que estén doradas.", "Para servir, coloca el ragu en un tazón con las albóndigas al lado."], "url": "www_bbc_co_uk_food_recipes_paprikaquornraguwith_88882", "title": "Pagína Quorn ragú con albóndigas de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de chapati 400g / 14oz, más extra para quitar el polvo", "1 cucharadita de sal", "1 cucharadita de semillas de carom", "5 cucharaditas de aceite vegetal", "1 cucharada de ghee o mantequilla clarificada", "3 cucharadas de aceite vegetal", "1 hoja de laurel", "2 vainas de cardamomo verde", "2cm / ¾in canela en rama", "2 dientes", "1 cucharadita de semillas de comino", "1 cebolla grande, finamente picada", "1 cucharada de jengibre y pasta de ajo", "1 cucharadita de sal", "1 cucharadita de chile rojo en polvo", "1 cucharadita de pimentón ahumado", "½ cucharadita de polvo de cúrcuma", "½ cucharadita de comino en polvo", "1 cucharadita de polvo de cilantro", "2cm / ¾ en pieza de raíz de jengibre fresco, pelado y finamente picado", "2 chiles verdes, finamente picados", "400 g / 14 oz de carne de cordero magra", "100 g / 3½ oz de papas hervidas, ralladas", "2 cucharadas de cilantro fresco picado, hojas y tallos", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 granada, semillas retiradas", "300 g / 10½ oz de yogur griego", "Jengibre fresco de 2½ cm / 1 en pieza, picado", "1 chile verde, picado", "1 cucharadita de comino, tostado y molido", "1 cucharadita de sal", "1 cucharadita de azúcar", "1 cucharada de hojas de cilantro picado"], "method": ["Mezcle la harina, la sal, las semillas de carom, el aceite y 225ml / 8 fl oz de agua para hacer una masa suave. Cubra y descanse durante al menos 15 minutos.", "Mientras tanto, para hacer el relleno. Caliente el aceite en una sartén grande hasta el punto de ahumado, agregue las especias enteras, seguido de las semillas de comino. Cuando comiencen a crujir, agregue las cebollas y cocine a fuego medio-bajo durante 2-3 minutos.", "Agregue el jengibre y la pasta de ajo, sal, especias molidas, jengibre, chiles y revuelva durante 2-3 minutos para cocinar las especias. Agregue el cordero y cocine hasta que se seque y el líquido se haya evaporado. Agregue la papa y cocine por un minuto revolviendo para mezclar bien. Ajustar el aderezo y espolvorear con el cilantro y el jugo de limón. Deje que se enfríe completamente. Deseche las especias enteras, divídalas en diez porciones iguales y enrolle en discos cuando estén lo suficientemente frías para manipularlas.", "Divide la masa en diez bolas. Tome una bola de masa, haga una sangría y siga presionando y girando la masa en la mano para hacer que el agujero sea ligeramente más grande que el tamaño de uno de los discos de cordero. Los bordes del agujero deben ser un poco más delgados que el resto. Coloque un disco de cordero en el agujero y junte los bordes para cubrir el relleno por todos los lados. No deje grietas o el relleno saldrá cuando esté enrollado.", "Rocíe ligeramente una superficie con harina, aplaste suavemente un paratha y luego extiéndalo con cuidado en un disco de 20cm / 8in de diámetro.", "Coloque una sartén de fondo grueso, preferiblemente de hierro fundido, a fuego medio-bajo. Cocine durante unos 2-3 minutos en un lado, dé la vuelta y repita en el otro lado. Mientras se cocina, despliegue el siguiente paratha. Cuando ambos lados se sequen y comiencen a colorear, cepille con un poco de ghee para obtener un color uniforme. Retirar del fuego y mantener las parathas calientes envolviendo sin apretar en papel de aluminio.", "Para la raita, combine todos los ingredientes, excepto algunas semillas de granada y las hojas de cilantro, y mezcle bien. Espolvoree el cilantro y las semillas reservadas en la parte superior y coloque en la nevera hasta que se sirva.", "Sirva los parathas con la raita en el lado."], "url": "www_bbc_co_uk_food_recipes_parathas_stuffed_with_45963", "title": "Parathas rellenas de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de lentejas verde-marrón, como pardina", "6 cucharadas de aceite de oliva", "1 cabeza de ajo, clavos pelados y finamente rebanados", "1 cebolla mediana, finamente picada", "200g / 7oz de zanahoria, finamente picada", "100 g / 3½ oz de jamón Serrano en rodajas finas, finamente picado", "1 cucharada de pimentón dulce (pimentón dulce español ahumado)", "2 grandes tomates maduros en vides, desollados, picados", "125ml / 4fl oz de vino blanco seco", "1 cucharada de perejil picado de hoja plana", "sal y pimienta negra recién molida"], "method": ["Revise las lentejas para ver si hay piedritas, luego enjuague con agua fría. Inclínelos en una cacerola, agregue suficiente agua fría para cubrirlos en 5 cm / 2 in y deje hervir a fuego alto. Reduce el calor", "y déjelos hervir a fuego lento durante aproximadamente 30 minutos o hasta que estén tiernos pero aún un poco al dente. Drene, reservando el líquido de cocción, y colóquelo a un lado.", "Ponga el aceite de oliva, el ajo, la cebolla y la zanahoria en una sartén ancha y poco profunda a fuego medio y cocine suavemente durante 15 minutos o hasta que las verduras estén blandas y apenas comiencen a colorear. Agregue el jamón Serrano y fría por otros 5-6 minutos.", "Agregue el pimentón, los tomates y el vino y cocine a fuego lento durante 5-6 minutos o hasta que la mezcla se cocine en una salsa espesa.", "Mezcle las lentejas en la salsa con 150ml / 5fl oz del líquido de cocción reservado, el perejil picado, 1½ cucharaditas de sal y un poco de pimienta. Cocine a fuego lento por otros 5-6 minutos."], "url": "www_bbc_co_uk_food_recipes_pardina_lentils_with_32549", "title": "Lentejas Pardina con vino blanco, jamón serrano y pimentón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pardina_lentils_with_32549_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla sin sal", "85g / 3oz de azúcar morena oscura", "115g / 4 oz de jarabe de oro", "Harina normal 175g / 6oz", "1½tsp de bicarbonato de soda", "1½ cucharadita de jengibre molido", "55g / 2oz de avena mediana", "1 huevo grande de gallinas camperas", "salpicar leche"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Engrase una lata para hornear cuadrada de 20 cm / 8 pulgadas y alinee con un pergamino para hornear.", "Coloque la mantequilla, el azúcar y el sirope dorado en una sartén a fuego medio y cocine hasta que se derrita y se combine.", "Tamiza la harina, el bicarbonato de soda y el jengibre molido en un bol y mezcle bien.", "Agregue la mezcla derretida de mantequilla y azúcar a los ingredientes secos.", "Agregue el huevo y bata la mezcla hasta lograr una consistencia espesa. Si la mezcla es demasiado dura, agregue un poco de leche para aflojarla.", "Vierta la mezcla de la torta en la lata de torta forrada y hornéela en el horno durante una hora, o hasta que el centro esté firme y elástico al tacto.", "Dejar enfriar, luego cortar en cuadrados. (Esta torta se guarda en lata durante 2-3 semanas. Cuanto más la deje, mejor será su sabor)."], "url": "www_bbc_co_uk_food_recipes_parkin_90139", "title": "Bizcocho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 9", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina fuerte 112g / 4oz", "4 cucharadas de leche entera", "pizca de sal de mesa", "pizca de azúcar en polvo", "55g / 2oz de mantequilla sin sal", "4 huevos medianos de corral, 3 ligeramente batidos y 1 para huevo", "almendras copos puñado", "200 g / 7 oz de azúcar en polvo", "100 g / 3½ oz de avellanas blanqueadas", "Crema doble 600ml / 20fl oz", "1 vaina de vainilla, rebanada por la mitad a lo largo y semillas raspadas", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 220 ° C / 200 ° Ventilador / Gas 7. Cubra una bandeja para hornear con pergamino para hornear y dibuje 4 círculos, aproximadamente 10 cm / 4 pulgadas de ancho.", "Tamizar la harina en una hoja de pergamino para hornear. Ponga la leche, la sal, el azúcar, la mantequilla y 80ml / 2¾fl de onza de agua en una sartén y lleve a ebullición lentamente a fuego medio, hasta que la mantequilla se haya derretido.", "Cuando la mezcla burbujee, retírela rápidamente del fuego, incline la harina de golpe y bata vigorosamente hasta que se forme una masa que deje limpio el costado de la olla. Regrese al fuego y cocine a fuego lento durante al menos 5 minutos.", "Dejar enfriar un poco, luego batir gradualmente en los huevos ligeramente batidos, batiendo bien entre cada adición hasta que la masa esté suave y brillante. Coloque la masa en una bolsa de plástico desechable y corte la punta para hacer un agujero generoso. Pipe 4 anillos gruesos aproximadamente en los círculos (tuberías de los anillos en un solo movimiento).", "Ligeramente cepilla la parte superior con la colada de huevo, luego espolvorea las almendras copos sobre la parte superior del choux.", "Hornee durante 10 a 15 minutos, luego reduzca el calor a 180 ° C / 160 ° C Ventilador / Gas 4 y hornee por otros 10 minutos hasta que estén bien alzados y dorados. Una vez horneado, retírelo del horno e inmediatamente corte los anillos por la mitad horizontalmente y regréselos para que se sequen durante aproximadamente 3-4 minutos.", "Para el praliné, derrita el azúcar impalpable en una sartén a fuego medio hasta que el azúcar se haya derretido hasta obtener un caramelo. Agregue las avellanas y revuelva para cubrir las avellanas en el caramelo. Vierta con cuidado en una estera de silicona y déjelo enfriar y endurecer (el azúcar hirviendo se pone muy caliente; tenga cuidado de no quemarse). Una vez frío, pulsa el praliné hasta obtener un polvo fino en un procesador de alimentos.", "Para el relleno, vierta la crema en un tazón grande. Agregue las semillas de vainilla y látigo hasta que se formen picos suaves cuando se quite la batidora. Coloque una cuchara en una manga pastelera equipada con una boquilla de estrella.", "Espolvoree la mitad del praliné sobre las mitades inferiores de los anillos de choux, y luego vierta una cantidad generosa de crema sobre el praliné. Espolvorea el praliné restante sobre la crema y coloca las tapas de pastelería encima. Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_paris-brest_76134", "title": "Paris-Brest", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 4 pasteles Paris-Brest", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 900g / 2lb", "Azúcar demerara 450g / 1lb", "4 cucharaditas de jengibre molido", "4 cucharaditas de bicarbonato de soda", "1 cucharadita de sal", "225g / 8oz de mantequilla", "450g / 1lb de jarabe dorado", "4 huevos de gallinas camperas", "800 ml / 1 pinta 8 fl oz de leche"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Engrase y alinee seis latas cuadradas de 22cm / 8 pulgadas.", "Tamiza la harina en el cuenco de una batidora grande con el accesorio de la paleta y agrega el azúcar, el jengibre, el bicarbonato de soda y la sal. Mezcla bien con una cuchara.", "Coloque la mantequilla y el jarabe en una sartén y caliente hasta que la mantequilla se haya derretido.", "Pon los huevos y la leche en una jarra y bate juntos hasta que estén bien combinados.", "Poco a poco vierta la mantequilla y el jarabe en la harina y mezcle, luego agregue la mezcla de huevo y leche y bata hasta que la mezcla esté suave. Vierta en las latas forradas.", "Colóquelo en el horno durante una hora o hasta que la brocheta salga limpia cuando se inserte en el centro del estante."], "url": "www_bbc_co_uk_food_recipes_parkin_28695", "title": "Bizcocho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 48", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "115g / 4oz de azúcar morena suave", "1 cucharadita de jengibre molido", "1 cucharadita de bicarbonato de soda", "pizca de sal", "55 g / 2 oz de mantequilla", "115g / 4 oz de jarabe de oro", "1 huevo de gallinas camperas", "200ml / 7fl de leche en oz"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Cubra una lata para pastel de 20 cm / 8 in.", "Tamiza la harina en un tazón grande y agrega el azúcar, el jengibre, el bicarbonato de soda y la sal.", "Coloque la mantequilla y el sirope dorado en una sartén y caliente hasta que la mantequilla se haya derretido.", "Pon el huevo y la leche en una jarra y bate juntos.", "Poco a poco vierta la mantequilla y el jarabe en la harina y revuelva, luego agregue la mezcla de huevo y leche y revuelva hasta que quede suave. Vierta en la lata forrada.", "Hornee en el horno durante una hora o hasta que un pincho salga limpio cuando se ensamble en el centro del estante."], "url": "www_bbc_co_uk_food_recipes_parkin_08211", "title": "Bizcocho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 rebanadas de jamón de Parma", "8-10 cucharaditas de queso de cabra suave", "1 bolsa de bolsa de 70 g / 2½ oz", "sal y pimienta negra recién molida", "8 pepinillos medianos, descuartizados"], "method": ["Coloque cada pedazo de jamón de Parma en una tabla, corte cualquier exceso de grasa y deséchela.", "Extienda una buena cucharadita de queso de cabra en el último trimestre. Condimentar con sal y pimienta. Tome un pequeño puñado de cohetes y póngase encima, dejando algo del cohete sobresaliendo de los extremos. Coloque una pieza de pepino en la parte superior.", "Enrolle el jamón de Parma en forma de cigarro y transfiéralo a la nevera hasta que lo necesite.", "Corta cada rollo por la mitad y coloca de pie sobre el lado cortado en un plato de servir. Servir frío."], "url": "www_bbc_co_uk_food_recipes_parma_ham_goats_cheese_13654", "title": "Jamón de Parma, queso de cabra y canapés de cohetes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 16 canapés", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parma_ham_goats_cheese_13654_16x9.jpg", "isVegetarian": false, "recommendations": 0}]