[{"ingredients": ["100g / 3½oz de pan rallado", "1 cucharada de perejil fresco finamente picado", "1 cucharada de cebollines frescos finamente picados", "2 huevos de gallinas camperas, golpeados", "Escalope de ternera 150g / 5½ oz", "100g / 3½ oz de harina, sazonado con sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "50g / 1¾oz de mantequilla", "100g / 3½oz de patatas nuevas, ralladas", "1 cucharada de aceite de oliva", "½ repollo rojo, rallado", "50ml / 2fl oz de vino tinto", "100 g / 3½ oz de azúcar en polvo", "100ml / 3½fl oz de caldo de pollo caliente", "1 huevo de gallinas camperas", "200ml / 10fl oz de agua hirviendo", "25ml / 1fl oz de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de ternera molida de hierbas, coloque las hierbas y las migas de pan en un procesador de alimentos y mezcle, luego colóquelas en un tazón. Coloque los huevos batidos en un recipiente aparte.", "Dragar la ternera en harina sazonada y palpar cualquier exceso. Sumerja la ternera en el huevo batido hasta cubrir todo, luego sumerja de nuevo en las migas de pan de hierbas para cubrir.", "Repita el proceso de recubrimiento de pan rallado de huevo y hierba.", "Caliente el aceite en una sartén mediana a prueba de horno a fuego medio. Agregue la ternera molida de pan y fría por dos minutos en cada lado, para dorar por todas partes.", "Transfiera al horno y tueste durante cinco minutos, o hasta que la carne de ternera esté cocida. Retire del horno y deje reposar.", "Para hacer la papa rösti, caliente la mitad de la mantequilla en una sartén pequeña a fuego medio. Agregue las papas ralladas, sazonar bien con sal y pimienta negra recién molida. Saltee, sin dar vuelta, hasta que esté dorado.", "Agregue la otra mitad de la mantequilla a la sartén y con cuidado voltee el rösti y cocine el otro lado hasta que esté dorado.", "Para hacer el repollo, caliente el aceite en una cacerola grande a fuego medio. Agregue el repollo triturado y el vino tinto y cocine por tres minutos.", "Agregue el azúcar y cocine, revolviendo bien, durante dos minutos.", "Agregue el caldo de pollo, lleve a ebullición y reduzca el fuego a fuego lento. Cocine a fuego lento durante 5-6 minutos, o hasta que el repollo se haya suavizado.", "Para hacer el huevo escalfado, coloque el agua y el vinagre en una cacerola y caliente para mantener una cocción suave a fuego lento. Agita el agua con una cuchara para crear un efecto de hidromasaje. Agregue suavemente el huevo y el poach durante tres minutos, o hasta que esté cocido a su gusto. Retire con una espumadera y enjuague con agua caliente.", "Para servir, coloque el rösti en el centro de un plato caliente, coloque la ternera molida de pan en la parte superior. Sirva un poco del repollo al lado y cubra con el huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_herbcrumbedvealpotat_80186", "title": "Ternera molida de hierbas, rosti de patata, puerros a la parrilla, col 'confit' y huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 100 g / 3½ oz de filete de res", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de perifollo fresco picado", "1 cucharada de perejil fresco picado", "50g / 1½ oz de pan rallado fresco", "1 cucharada de aceite de oliva", "½ limón, cáscara y jugo solamente", "75g / 2¾oz de frijoles borlotti en conserva, escurridos", "puñado de perejil fresco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de vaca con costra de hierbas, frote la carne con un poco del aceite y sazone bien con sal y pimienta negra recién molida.", "Coloque las hierbas y las migas de pan en un tazón y mezcle bien, luego cubra la carne en la mezcla de migas de pan.", "Caliente el aceite restante en una sartén a prueba de horno y fría la carne durante 3-4 minutos en cada lado.", "Transfiera la sartén al horno y cocínela durante 4-5 minutos, o hasta que esté dorada y cocida a su gusto. Retire del horno y deje reposar.", "Para la ensalada de frijoles borlotti, coloque el aceite y la ralladura de limón y el jugo en un bol y mezcle bien. Agregue los frijoles y el perejil, mezcle bien y sazone con sal y pimienta negra recién molida.", "Para servir, coloca la carne con costra de hierbas en un plato con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_herbcrustedbeefwithb_85109", "title": "Carne de res con hierbas y ensalada de frijoles borlotti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 chuletas de cordero, aplastadas con la base de una olla o un ablandador de carne", "4 cucharadas de pan rallado fresco", "1 cucharada de menta fresca finamente picada", "30g / 1oz de queso Wensleydale con arándanos", "1 cucharada de mantequilla, ablandada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una sartén caliente, fría las chuletas de cordero durante 30 segundos en ambos lados, hasta que se doren.", "En un tazón pequeño, mezcle las migas de pan, la menta, el queso Wensleydale y la mantequilla para hacer una pasta áspera. Sazonar con sal y pimienta negra recién molida.", "Con cuidado, retire las chuletas de cordero de la sartén de la plancha y presione la mezcla de migas de pan en las chuletas.", "Transfiera las chuletas de cordero a una bandeja para hornear y tueste durante cinco minutos o hasta que estén cocidas a su gusto.", "Reserve para descansar durante cinco minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_herbcrustedlambcutle_86950", "title": "Chuletas de cordero con costra de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["275g / 10oz de pan rallado", "110g / 4oz de hojas frescas de perejil de flatleaf", "2 dientes de ajo, pelados", "4 cucharadas de aceite de oliva", "sal y pimienta blanca", "110-150 ml / 4-5 fl oz de agua", "4 filetes de solla, sin piel", "25g / 1oz de mantequilla", "1 chalote, pelado, finamente cortado en cubitos", "50g / 1¾oz de panceta, finamente picada", "200 g / 7¼ oz de papas Royal Jersey, finamente cortadas en cubitos", "100g / 3½oz de frijoles flageolet enlatados, escurridos y enjuagados", "100 g / 3½ oz verdes de primavera, en rodajas finas", "150ml / 5¼fl oz de caldo de pollo", "50g / 1¾oz de mantequilla", "2 cucharadas de perifollo fresco picado"], "method": ["Para la solla con costra de hierbas, precaliente el horno a 200C / 400F / Gas 6.", "Mezcle las migas de pan, el perejil y el ajo en un procesador de alimentos hasta que la mezcla se asemeje a finas migas de pan.", "Agregue el aceite de oliva y sazone, al gusto, con sal y pimienta blanca. Mezcle nuevamente hasta que la mezcla se asemeje a una pasta suave, agregando agua según sea necesario.", "Coloque la mezcla en una hoja grande de papel resistente a la grasa, cubra con otra hoja de papel resistente a la grasa y, utilizando un rodillo, ruede la mezcla hasta el tamaño de los cuatro filetes. Dejar de lado.", "Coloque una hoja de papel resistente a la grasa en una bandeja para hornear y coloque los filetes de pescado encima. Cortar la mezcla prensada en rectángulos para hacer una costra para cada filete. Cubra cada filete de pescado con la corteza y hornee durante 8-10 minutos, o hasta que el pescado esté cocido.", "Para las papas Jersey Royal y el caldo verde de primavera, caliente una sartén grande y agregue la mantequilla. Una vez derretido, agregue el", "chalotes y panceta y freír durante 2-3 minutos hasta que la panceta esté crujiente.", "Agregue las papas y los frijoles flageolet y cocine por otros dos minutos.", "Agregue los verdes de primavera y caliéntelos y cocínelos durante 2-3 minutos, o hasta que el volumen de papel se haya reducido ligeramente.", "Agregue la mantequilla para espesar la salsa y espolvoree sobre el perifollo.", "Para servir, cuchara el Jersey Royal y el caldo verde de primavera en cada uno de los cuatro platos y coloque el pescado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_herbcrustedplaicewit_94023", "title": "Solla con costra de hierbas con Jersey Royal y caldo verde de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rebanada de pan de centeno", "2 ramitas de tomillo fresco, picado", "pequeño puñado de perejil fresco, picado", "sal y pimienta negra recién molida", "Filete de pierna de cordero de 175g / 6oz", "1 cucharada de aceite de oliva", "1 cucharada de hummus", "2 cucharadas de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "½ berenjena, cortada en cubos", "200g / 7oz de tomates cherry enlatados, escurridos", "100 g / 3½ oz de garbanzos enlatados, escurridos", "puñado de perejil fresco, picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer el filete de cordero con costra de hierbas, coloca el pan de centeno, el tomillo, el perejil, la sal y la pimienta negra recién molida en un pequeño procesador de alimentos y pulsa hasta que se formen migas.", "Caliente una sartén hasta que esté caliente. Frote la carne de cordero en el aceite de oliva, sazone con sal y pimienta negra recién molida y coloque en la sartén plancha caliente. Freír el cordero en ambos lados durante tres minutos. Retire del fuego y deje reposar por tres minutos.", "Extienda el hummus en un lado del cordero a la plancha, presione la mezcla de migas de hierbas en la parte superior y transfiera el filete de cordero a una bandeja para hornear antiadherente. Coloque en el horno durante 4-5 minutos, o hasta que la masa esté dorada y el cordero esté cocido a su gusto. Retire del horno y deje reposar por 2-3 minutos antes de servir.", "Para hacer el guiso, caliente una cucharada de aceite de oliva en una cacerola mediana y agregue la cebolla. Saltee hasta que esté suave pero no coloreado.", "Agregue el ajo a la cacerola y saltee suavemente por un minuto más.", "En una sartén por separado, caliente la cucharada restante de aceite de oliva y agregue la berenjena. Freír durante cinco minutos, o hasta que estén doradas por todos lados.", "Agregue la berenjena a las cebollas y el ajo, luego agregue los tomates cherry y los garbanzos drenados y cocine por otros tres minutos.", "Agregue el perejil picado a la sartén y sazone bien con sal y pimienta negra recién molida.", "Para servir, coloque el estofado en un plato y cubra con el filete de cordero con salsa de hierbas."], "url": "www_bbc_co_uk_food_recipes_herbcrustedlambsteak_87004", "title": "Filete de cordero con costra de hierbas con berenjena, tomate y guiso de garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ciabatta de 200g / 8oz, aproximadamente desgarrado", "Corteza de limón 40g / 2oz, rallado", "Alcaparras de 40 g / 2 oz, enjuagadas", "Anchoas de 40g / 2oz", "Cebollas de 40g / 2oz, más o menos picadas", "Aceitunas negras de 40g / 2oz, sin hueso y picadas", "1 manojo de perejil", "1 manojo de albahaca", "2 racks de cordero (8 huesos en cada uno)", "aceite vegetal para freír", "2 cucharaditas de mostaza Dijon", "Tiras de panceta 50g / 2oz", "2 alcachofas, cortadas en rodajas", "Calabacines 125g / 5oz, en cubos y salteados", "Frijoles fava de 50 g / 2 oz, pelados, blanqueados durante 1 minuto, luego sumergidos en agua fría", "4 hojas de menta", "200 ml / 7 fl oz de caldo de carne de vacuno, hervido para reducir a la mitad", "sal marina", "pimienta negra recién molida"], "method": ["Precalentar el horno a 120 ° C / 250 ° F / Gas 1.", "Haz la corteza de la hierba. Coloque la ciabatta, cáscara de limón, alcaparras, anchoas, cebollas y aceitunas en una bandeja para hornear. Colóquelos en el horno para que se sequen durante dos horas.", "Transfiera la mezcla al recipiente de un procesador de alimentos con la cuchilla metálica y gírelo con las hierbas hasta que se formen migas finas, aproximadamente dos minutos.", "Encienda el horno a 180c / 355F / Gas 4. Sazone el cordero y luego caliente una sartén grande y pesada. Agregue suficiente aceite para cubrir la base y selle el cordero en el lado con la grasa, aproximadamente dos minutos.", "Cepille el cordero con mostaza para que esté completamente cubierto y luego enrolle en la corteza de la hierba. Coloque la carne en una fuente para hornear poco profunda y hornéela en el horno hasta que sea poco común, aproximadamente 12 minutos, volteándola hasta la mitad.", "Retire del horno y deje reposar.", "Mientras el cordero se cocina, caliente una sartén y agregue la panceta y luego las cuñas de alcachofa. Sazonar bien", "Agregue los calabacines, las habas y las hojas de menta y agregue un poco de caldo de carne calentada para unir la mezcla. Mantener caliente", "Para servir, corte la parrilla de cordero en chuletas. En cada plato coloque unas chuletas en una cama de la mezcla de verduras.", "Rocíe el caldo de carne alrededor de cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_71980", "title": "Costillar de cordero con costra de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo 300 g / 10½ oz (lomo)", "1 cucharada de tomillo fresco, finamente picado", "1 cucharada de romero fresco, finamente picado", "1 cucharada de orégano fresco, finamente picado", "2 dientes de ajo, finamente picados", "2 cucharadas de aceite de oliva", "1 cucharadita de miel", "50g / 2oz de mantequilla", "1 cebolla roja, finamente picada", "1 manzana comiendo, pelada y finamente picada", "100 g / 3½ oz de lentejas Puy, recién cocidas", "150ml / 5fl oz de sidra de granja", "1 cucharada de miel", "1 cucharada de mostaza integral", "1 cucharada de perejil de flatleaf", "25g / 1oz de mantequilla", "200 g / 7 oz de puré de patatas, bien condimentadas, para servir"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Para hacer la corteza de la hierba, mezcle las hierbas, el ajo, el aceite de oliva y la miel. Enrolla el filete de cerdo en la mezcla para cubrir bien.", "Caliente una sartén hasta que esté al rojo vivo. Agregue la carne de cerdo con costra de hierbas y dore durante un minuto en cada lado. Transfiera al horno y cocine por otros diez minutos. Retire la carne de cerdo y déjela reposar durante al menos cinco minutos antes de servir.", "En una sartén limpia, caliente la mantequilla hasta que espume. Agregue la cebolla y la manzana y cocínelos juntos por dos minutos. Agregue las lentejas y la sidra, y déles unos segundos de tiempo de cocción antes de agregar la miel y la mostaza. Deje calentar las lentejas por 2-3 minutos, luego sazone y agregue el perejil. La idea es dejar suficiente líquido de 'cidery' en las lentejas para proporcionar una salsa.", "En el último minuto, agregue la mantequilla para espesar la salsa.", "Tallar la carne de cerdo en trozos gruesos de 1cm (0.5in). Coloque las rodajas de carne de cerdo en el puré y espolvoree las lentejas y el licor por todas partes."], "url": "www_bbc_co_uk_food_recipes_herbcrustedporkfille_73665", "title": "Filete de cerdo con costra de hierbas con manzana y mostaza Puy lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ciabatta de 200 g / 7¼ oz, aproximadamente desgarrada", "Corteza de limón 40g / 1½ oz, rallado", "Alcaparras 40 g / 1½ oz, enjuagadas", "Anchoas de 40 g / 1½ oz", "40 g / 1½ oz cebollas, más o menos picadas", "Aceitunas negras de 40 g / 1½ oz, deshuesadas y picadas", "1 manojo de perejil", "1 manojo de albahaca", "2 racks de cordero, 8 huesos en cada uno", "aceite vegetal, para freír", "2 cucharaditas de mostaza Dijon", "sal marina y pimienta negra recién molida", "2 calabacines (alrededor de 650 g / 1 lb 7 oz cada uno)", "2 dientes de ajo, aplastados", "2 limones, cáscara y jugo solamente", "1 cucharada de aceite de oliva", "100g / 3½oz de mantequilla, 70 g / 2½oz derretida y el resto enfriado", "1 ramita de tomillo fresco, solo hojas", "2-3 cucharadas de mostaza de grano grueso", "5 cucharadas de crema doble", "sal marina y pimienta negra recién molida"], "method": ["En primer lugar, haz la corteza de la hierba. Precalentar el horno a 120 / C248F / Gas 1. Coloque la ciabatta, corteza de limón, alcaparras, anchoas, cebollas y aceitunas en una bandeja para hornear, y colóquelos en el horno para que se sequen durante dos horas.", "Transfiera la mezcla al cuenco de un procesador de alimentos equipado con una cuchilla de metal y mezcle hasta que se formen migas finas (aproximadamente dos minutos).", "Precalentar el horno a 180 ° C / 356 ° F / Gas 4. Sazonar el cordero y luego calentar una sartén grande de base pesada. Agregue suficiente aceite para cubrir la base y selle el cordero en cada lado con la grasa (aproximadamente dos minutos).", "Cepille el cordero con mostaza para que esté completamente cubierto y luego enrolle en la corteza de la hierba. Coloque la carne en una fuente para hornear poco profunda y hornéela en el horno hasta que sea poco común, aproximadamente 12 minutos, volteándola hasta la mitad.", "Retire del horno y deje reposar.", "Para la calabaza, caliente el horno a 190 ° C / 375 ° F / Gas 5. Corte la calabaza por la mitad, retire las semillas, luego pele y corte la carne en trozos de tamaño uniforme. Coloque en un tazón y agregue el ajo, la ralladura de limón y el jugo, el aceite de oliva y la mitad de la mantequilla derretida.", "Mezcle los ingredientes y luego extiéndalos en una fuente para asar. Esparce sobre las hojas de tomillo y tueste en el horno durante unos 20 minutos, hasta que la calabaza se sienta tierna al perforarla con la punta de un cuchillo.", "Coloque la calabaza asada en un procesador de alimentos o licuadora con la mantequilla restante, la mostaza, la crema y el condimento. Mezcle hasta obtener un puré suave y sirva.", "Para servir, corte los estantes de cordero en chuletas. En cada plato, coloque algunas chuletas en una cama de mezcla de calabaza."], "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_73595", "title": "Costillar de cordero con costra de hierbas y calabaza asada con limón y mostaza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ciabatta de 200g / 8oz, aproximadamente desgarrado", "Cáscara de limón 40g / 2oz", "Alcaparras de 40 g / 2 oz, enjuagadas", "Anchoas de 40g / 2oz", "½ cebolla, más o menos picada", "Aceitunas negras de 40g / 2oz, sin hueso y picadas", "1 manojo de perejil", "1 manojo de albahaca", "2 racks de cordero (8 huesos en cada uno)", "aceite vegetal para freír", "2 cucharaditas de mostaza Dijon", "200ml / 7fl oz de caldo de carne", "vino tinto", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 130C / 250F / Gas 1.", "Para hacer la corteza de la hierba, ponga la ciabatta, la ralladura de limón, las alcaparras, las anchoas, las cebollas y las aceitunas en una bandeja para hornear. Colóquelos en el horno para secarlos durante 1½ horas.", "Transfiera la mezcla al cuenco de un procesador de alimentos equipado con la cuchilla de metal y mezcle con la albahaca y el perejil hasta que se formen migas finas (aproximadamente dos minutos).", "Encienda el horno a 210C / 410F / Gas 7-8. Calentar una sartén grande de base pesada y dorar el cordero por todos lados hasta que se dore, empezando por el costado con la grasa.", "Cepilla el lado gordo del cordero con mostaza para que esté bien cubierto y luego enróllalo en la mezcla de migas de pan para formar la corteza de la hierba. Coloque la carne en un plato para asar poco profundo y hornee en el horno hasta que sea poco común, alrededor de 15-20 minutos.", "Retire del horno y deje la carne para descansar. Agregue el caldo de carne y un chorro de vino tinto a la lata de asar para desglasarlo y crear una salsa. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, corte la parrilla de cordero en chuletas.", "Rocíe la salsa alrededor de cada plato y sirva."], "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_81034", "title": "Costillar de cordero con costra de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de pargo rojo, desollado", "55g / 2oz anacardos", "pequeño puñado de perejil fresco de flatleaf", "coco fresco de pieza pequeña, solo carne", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida", "1 cucharada de mostaza Dijon", "1 cucharada de aceite vegetal", "¼ de cebolla picada", "1 diente de ajo, picado", "150 g / 5½ oz conservas enlatadas, escurridas", "sal y pimienta negra recién molida", "1 cucharadita de aceite vegetal", "55 g / 2 oz okra, en rodajas a lo largo", "1 cucharada de puré de tomate", "2 cucharadas de vino blanco", "2 cucharadas de vinagre de vino blanco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pargo rojo con costra de hierbas, coloque el filete de pargo en una bandeja para hornear antiadherente.", "Coloque los anacardos, el perejil, el coco y el aceite vegetal en un procesador de alimentos y pulse para combinarlos. Sazonar con sal y pimienta negra recién molida.", "Extienda la mostaza sobre el pescado y presione la mezcla de la corteza en la parte superior.", "Transfiere al horno y hornea por 8-10 minutos, o hasta que la masa esté dorada y el pescado esté bien cocido.", "Para el ackee frito, caliente el aceite vegetal en una sartén a fuego medio, agregue la cebolla y fría hasta que esté suave. Agregue el ajo y el ackee y fría hasta que estén crujientes. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa picante, caliente el aceite en una sartén a fuego medio, agregue la okra, puré de tomate, vino y vinagre y cocine a fuego lento hasta que el líquido se reduzca a la mitad y la okra esté tierna.", "Para servir, vierta la chutney en el centro de un plato y cubra con el ackee frito y el pargo rojo."], "url": "www_bbc_co_uk_food_recipes_herbcrustedredsnappe_85773", "title": "Pargo rojo con costra de hierbas con ackee frito y chutney de tomate y okra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de hierbas frescas picadas (romero, perifollo, albahaca)", "75g / 2¾oz de pan de migas frescas", "55 g / 2 oz de mantequilla, derretida", "Filete o filete de salmón fresco de 150 g / 5½ oz", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "1 diente de ajo, picado", "100 g / 3½ oz de judías en conserva, enjuagadas y escurridas", "50ml de leche entera", "1 cucharada de perejil fresco picado", "1 cucharada de aceite de oliva", "1 diente de ajo, picado", "pizca de copos de chile", "150 g / 5½ oz espinacas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las hierbas frescas picadas, pan rallado y mantequilla en un procesador de alimentos y pulse para mezclar.", "Calienta una sartén pequeña. Agregue el aceite y el salmón y cocine por dos minutos en cada lado para dorar. Retire del fuego y cuchara sobre la mezcla de hierbas.", "Transfiera el salmón al horno y hornee durante cinco minutos.", "Para las judías verdes, coloque el aceite en una sartén a fuego medio. Agregue el ajo y saltee por dos minutos.", "Agregue los frijoles y la leche, lleve a ebullición y reduzca el fuego a fuego lento durante cuatro minutos. Mezcle con una batidora de mano hasta que quede suave y agregue el perejil.", "Para las espinacas, caliente el aceite en una sartén. Agregue las hojuelas de ajo y chile y fría por un minuto.", "Agregue las espinacas y cocine por un minuto, hasta que se marchiten.", "Para servir, coloque la espinaca marchita en el centro de un plato y cubra con el salmón con costra de hierbas con el puré de mantequilla en un lado."], "url": "www_bbc_co_uk_food_recipes_herbcrustedsalmonwit_79945", "title": "Salmón de corteza de hierbas con judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾ oz de pan de migas frescas", "1 cucharadita de cada perifollo picado, eneldo, perejil", "sal y pimienta negra recién molida", "1 diente de ajo, picado", "1x110g / 4oz filete de salmón fino, piel en", "1 huevo de gallinas camperas, golpeado", "1 cucharada de aceite de oliva", "1 cucharada de aceite de oliva", "3 dientes de ajo picados", "2 ramitas de romero, hojas recogidas", "1 patata pequeña, pelada, cortada en rodajas y hervida durante 5 minutos"], "method": ["Para el salmón, coloque el pan rallado, las hierbas, el ajo y la sal y la pimienta negra recién molida en un bol y mezcle.", "Sumerja el salmón en el huevo batido y luego sumérjalo en la mezcla de migas de pan.", "Calentar el aceite en una sartén a fuego alto y freír el salmón en ambos lados durante 2-3 minutos o hasta que esté dorado y cocido.", "Para las papas salteadas, en una sartén separada, caliente el aceite de oliva a fuego medio. Agregue el ajo, el romero y las rodajas de patata y saltee durante cinco minutos hasta que estén dorados.", "Para servir, coloque las papas salteadas en un plato para servir y coloque el salmón encima."], "url": "www_bbc_co_uk_food_recipes_herbcrustedsalmonwit_84490", "title": "Salmón con costra de hierbas y papas al ajo salteadas", "time": {"preparation": "", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de lomo de cerdo, aplastado plano con un mazo de carne o rodillo.", "1 cucharada de perejil fresco, picado", "1 cucharada de cebollín fresco, picado", "1 cucharada de cilantro fresco, picado", "100g / 3½oz de pan rallado blanco", "50g / 1¾oz de harina, sazonado con sal y pimienta negra recién molida", "2 huevos enteros de granja, golpeados", "2 cucharadas de aceite de oliva", "1 cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "1 diente de ajo, finamente picado", "frac12; cebolla, finamente picada", "100 g / 3½ oz de champiñones de castaña", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cerdo, coloque las hierbas frescas y las migas de pan en un tazón y mezcle.", "Coloque la harina en un bol y drague el lomo de cerdo en la harina. Sumerja el lomo de cerdo enharinado en los huevos y luego revuelva en la mezcla de migas de hierbas para cubrir.", "Sumérgete en el huevo y en las migas de pan de hierbas una vez más.", "Caliente el aceite en una sartén a prueba de horno a fuego alto. Agregue la carne de cerdo y fría por dos minutos en cada lado hasta que estén crujientes y doradas. Transfiera al horno y tueste durante cinco minutos, o hasta que esté completamente cocido.", "Para los champiñones, caliente el aceite y la mantequilla en una cacerola a fuego medio. Agregue el ajo y la cebolla y fría hasta que estén suaves.", "Agregue los champiñones y cocínelos hasta que estén blandos, luego sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque los champiñones en el medio de un plato de servir y coloque el cerdo encima."], "url": "www_bbc_co_uk_food_recipes_herbcrustporkwithgar_84315", "title": "Cerdo de corteza de hierbas con champiñones al ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2kg / 4lb 8oz pierna de cordero", "pequeño racimo de orégano, hojas recogidas", "1 cucharada de hojas de romero", "4 dientes de ajo, partidos por la mitad", "1 limón, ralladura y jugo", "1 naranja, ralladura y jugo", "2 cucharadas de aceite de oliva", "2 cucharaditas de copos de sal marina"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Siente el cordero en una lata grande para asar, con la piel hacia arriba, y use la punta de un cuchillo afilado para hacer muchas incisiones en toda la piel.", "Ponga el orégano, el romero, el ajo, el limón y la ralladura de naranja, 2 cucharadas de jugo de limón, 2 cucharadas de jugo de naranja, aceite de oliva y sal en un tazón y mezcle con una batidora (alternativamente, use un pequeño procesador de alimentos). Vierta esto sobre el cordero y frote bien. Deja a temperatura ambiente durante 45 minutos.", "Vierte ½ cm de agua recién hervida en el fondo de la lata de asar y tuesta durante 1 hora y 40 minutos. Revise después de una hora para agregar más agua si es necesario y cúbralo con papel de aluminio si la carne comienza a atrapar. Justo antes de que se acabe el tiempo, retire el cordero del horno y verifique que esté hecho a su gusto, ya sea con una sonda y las temperaturas que figuran en las puntas de abajo o perforando con un cuchillo y echando un vistazo.", "Retire el cordero cocido del horno, cúbralo con papel de aluminio y descanse durante 15-30 minutos, verificando de vez en cuando, antes de transferirlo a una tabla para tallar."], "url": "www_bbc_co_uk_food_recipes_herbed_leg_of_lamb_63592", "title": "Pierna de cordero con hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbed_leg_of_lamb_63592_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharaditas de aceite de oliva", "4 remolachas pequeñas, cocidas, peladas y picadas", "1 chalota pequeña, más o menos picada", "1 pimiento jalapeño, toscamente picado", "2 tallos de perejil de flatillo, toscamente picados", "2 tallos de cilantro, toscamente picados", "50g / 1¾oz de nueces sin cáscara, más o menos picadas", "2 cucharaditas de vinagre de jerez", "2 cucharaditas de azúcar en polvo", "Papas 250 g / 9 oz, peladas", "2 dientes de ajo, pelados", "100ml / 3½ fl oz de leche", "100ml / 3½fl oz de aceite de oliva", "sal y pimienta blanca", "1 limón, solo jugo", "puñado de perejil, toscamente picado", "Harina normal de 100 g / 3½ oz", "sal y pimienta negra recién molida", "200 g / 7 oz de pan rallado seco", "pequeño puñado de estragón picado, flatleaf perejil, salvia y perifollo", "2 huevos de gallinas camperas, batidos con un poco de leche", "12 chuletas de venado (del centro de la parrilla)", "aceite vegetal, para freír"], "method": ["Para el gusto, caliente el aceite en una sartén y cocine los ingredientes picados a fuego lento durante 15 minutos. Agregue el vinagre de jerez y el azúcar y cocine por unos minutos hasta que quede brillante. Agregue 50 ml / 2 fl oz de agua y continúe cocinando hasta que las verduras estén tiernas.", "Transfiera a un procesador de alimentos y mezcle hasta obtener un puré suave. Ponga a un lado hasta que esté listo para servir.", "Para la skordalia, coloque las papas en una sartén de base pesada con el ajo, la leche y el aceite de oliva, y sazone al gusto con sal y pimienta. Coloque a fuego medio, lleve a ebullición y cocine durante 15-20 minutos, o hasta que las papas estén suaves.", "Retire del fuego y escurra las papas, reservando el licor de cocción. Coloque las papas en un procesador de alimentos y mezcle con el jugo de limón y la mitad del líquido de cocción. Regrese a la cacerola y doble el perejil.", "Para las chuletas de venado, ponga la harina en un recipiente y sazone generosamente con sal y pimienta. Extienda las migas de pan en un plato y mezcle las hierbas picadas.", "Coloque el huevo batido en un recipiente poco profundo. Coloque la harina, el huevo batido y las migas de pan en una línea lista para cubrir las chuletas. Enrolla las chuletas de venado en la harina (incluido el hueso), sumérgelas en el huevo y cúbrelas con el pan rallado. Asegúrate de que las chuletas estén uniformemente cubiertas y de que las migajas estén bien dobladas (para ayudarlas a que se peguen a las chuletas).", "Precalentar el horno a 150C / 300F / Gas 2.", "Coloque una sartén grande de base pesada a fuego medio. Agregue dos cucharadas de aceite y, una vez que el aceite esté caliente, agregue las chuletas (debe colocar seis en una sartén, pero cocine en lotes más pequeños si es necesario). Freír durante 2-3 minutos por cada lado, o hasta que estén doradas y cocidas a su gusto. Una vez cocinado, colóquelo en el horno para mantenerlo caliente mientras cocina las chuletas restantes.", "Para servir, recaliente la skordalia y, cuando esté caliente, divídala entre platos para servir. Coloque tres chuletas encima y sirva con una quenelle de condimento."], "url": "www_bbc_co_uk_food_recipes_herbed_venison_cutlets_61572", "title": "Chuletas de carne de venado con skordalia, remolacha y salsa jalapeña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de cuscús", "250ml / 9fl oz de caldo de pollo caliente", "1 naranja, cáscara y jugo solamente", "1 cucharadita de semillas de cilantro, trituradas", "25 g / 1oz de pasas", "pimienta negra recién molida", "2 cucharadas de menta fresca picada", "1 cucharada de estragón fresco picado", "4 cebolletas, en rodajas", "¼ de pimiento rojo, picado", "1 lima, solo jugo", "Filete de cordero 150 g / 5½ oz", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de miel", "½ cucharadita de copos de chile", "1 naranja, solo jugo", "1 vaina de vainilla, solo semillas"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cuscús, coloca el cuscús en un tazón grande con la cáscara, la ralladura de naranja, las semillas de cilantro, las pasas y la pimienta negra. Cubra con un plato y déjelo por cinco minutos.", "Pelusa el cuscús con un tenedor, luego agregue el jugo de naranja y revuelva. Agregue la menta, el estragón, las cebollas tiernas, el pimiento rojo y el jugo de lima, y ​​peló de nuevo con un tenedor para combinar.", "Para el cordero, frote la carne con una cucharada de aceite y sazone con sal y pimienta.", "Caliente el aceite restante a fuego medio en una sartén a prueba de horno. Agregue el cordero y cocine hasta que esté dorado por todos lados.", "Rocíe el cordero con la miel y espolvoréelo con las hojuelas de chile, luego póngalo en el horno para asar durante 7-8 minutos. Retire del horno, coloque el cordero a un lado para descansar y retenga los jugos en la sartén.", "Exprime el jugo de naranja en la misma sartén y luego agrega las semillas de vainilla. Cocine a fuego lento el jugo a fuego medio durante 3-4 minutos, hasta que se haya reducido y espesado ligeramente, para formar un glaseado.", "Para servir, espolvorea una porción del cuscús en un plato para servir. Corta el cordero en tres rebanadas y colócalo encima del cuscús. Rocíe con glaseado de chile y miel."], "url": "www_bbc_co_uk_food_recipes_herbedorangecouscous_89355", "title": "Cuscús de cáscara de naranja, cordero chamuscado y glaseado de miel de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lomo de atún fresco de 500g / 1lb 2oz, recortado", "1 lima, solo jugo", "4 cucharadas de perejil de flatleaf tostado", "4 cucharadas de perifollo picado", "4 cucharadas de cebolletas picadas", "4 cucharadas de eneldo picado", "1 pepino, cortado a la mitad longitudinalmente, sin semillas, finamente cortado", "Vinagre de vino de arroz 150ml / 5fl oz", "2 cucharadas de azúcar en polvo", "1 chile rojo, sin semillas y finamente cortado", "1 cebolla roja, finamente rebanada", "½ x 400 g / 7oz de frijoles mezclados enlatados, como frijoles borlotti, frijoles y cannellini, enjuagados y escurridos", "2 cucharadas de perejil de flatleaf, aproximadamente picado", "sal y pimienta negra recién molida", "50 g / 2 oz de hojas de mizuna, para servir (opcional)"], "method": ["Frota el atún con el jugo de lima.", "Mezcle las hierbas juntas y colóquelas sobre una lámina de película adhesiva sobre una superficie plana.", "Coloque el atún en la parte superior y enrolle las hierbas, para cubrir completamente.", "Enrolle la película adhesiva con fuerza alrededor del atún recubierto de hierba para formar un cilindro apretado, girando los extremos para sellar. Coloque en el congelador por dos horas.", "Para la ensalada, coloque el pepino en una sartén y coloque a fuego lento. Caliente el pepino hasta que el exceso de agua se evapore.", "Agregue el vinagre, el azúcar y el chile y cocine a fuego lento, luego retire del fuego.", "Coloque la cebolla en un recipiente y vierta la mezcla de pepino en la parte superior. Revuelva bien, luego reserve para enfriar.", "Cuando la mezcla de pepino y cebolla esté fría, agregue los frijoles y el perejil y mezcle bien para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, retire el atún del congelador. Con un cuchillo afilado, corta el atún muy fino y colócalo en un plato para servir en un círculo.", "Coloque algunas hojas de mizuna en el centro (si está usando) y cubra con una cucharada de ensalada de pepino y frijoles."], "url": "www_bbc_co_uk_food_recipes_herbedtunacarpacciow_89241", "title": "Carpaccio de atún con ensalada de pepino y frijoles", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbedtunacarpacciow_89241_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Brotes de Bruselas 225g / 8oz, recortados", "2 cucharadas de aceite de oliva", "2 ramitas de romero fresco, picado", "3 ramitas de tomillo fresco, picado", "2 dientes de ajo, picados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Hervir los brotes en agua con sal durante aproximadamente 3-4 minutos, luego escurrir.", "Calentar el aceite en una sartén a prueba de horno y freír los brotes junto con las hierbas y el ajo durante 1-2 minutos. Transfiera la sartén al horno y continúe cocinando durante 10-12 minutos, o hasta que los brotes estén tiernos.", "Sirve en un plato gratinado."], "url": "www_bbc_co_uk_food_recipes_herbedroastedsprouts_88180", "title": "Brotes asados ​​con hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina de maíz", "Harina normal de 100 g / 3½ oz", "1 huevo de gallinas camperas", "agua con gas, para unir", "aceite vegetal, para freír", "3 ramitas de perejil fresco", "3 ramitas de cilantro fresco", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "85g / 3oz de trucha de mar", "sal y pimienta negra recién molida", "3 cucharadas de salsa de soja", "½ limón, solo jugo", "1 cucharada de aceite de sésamo"], "method": ["Para los buñuelos, combine la harina de maíz, la harina y el huevo en un tazón y agregue suficiente agua con gas para hacer un batido ligero con la consistencia de crema doble.", "Caliente el aceite en una cacerola profunda y pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Sumerja las ramitas de perejil y cilantro en la masa y fríe en aceite durante 2-3 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para la trucha crujiente, caliente el aceite de oliva y la mantequilla en una sartén y sazone el pescado con sal y pimienta negra recién molida. Freír el pescado durante 2-3 minutos en ambos lados, o hasta que esté dorado y cocido.", "Para la salsa de inmersión, combine todos los ingredientes de la salsa de inmersión en un tazón pequeño.", "Coloque la trucha en un plato de servir y coloque los buñuelos de hierbas al lado. Sirva con la salsa de inmersión a un lado."], "url": "www_bbc_co_uk_food_recipes_herbfritterswithcris_89974", "title": "Buñuelos de hierbas con trucha crujiente, salsa de soja y salsa de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "2 muslos de pollo sin hueso", "1 cucharada de tomillo fresco picado", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "1 cucharada de aceite de oliva", "½ calabacín, picado", "½ berenjena, picada", "1 tomate de vid, sin semilla y picado", "1 cucharada de puré de tomate", "50ml / 2fl oz de agua caliente", "25g / 1oz de aceitunas negras picadas, picadas", "6 hojas de albahaca fresca, rotas", "200ml / 7fl oz de vino tinto", "½ cubo de caldo de pollo", "50ml / 2fl oz de agua caliente", "25g / 1oz de aceitunas negras deshuesadas, cortadas a la mitad"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, unte ligeramente los muslos de pollo con una cucharada de aceite, luego enrolle las hierbas picadas para cubrir. Sazonar bien con sal y pimienta negra recién molida.", "Caliente el aceite restante en una sartén a prueba de horno y coloque el pollo con la piel hacia abajo. Presione el pollo con una espátula y fríalo durante 4-5 minutos o hasta que la piel esté crujiente. Voltee y fría por otros 3-4 minutos, luego transfiera al horno para asar durante 8-10 minutos, o hasta que el pollo esté bien cocido. Los jugos deben quedar claros cuando el pollo se perfora en su punto más grueso.", "Para el pisto, en una sartén otra fría la cebolla y el ajo en el aceite a fuego medio hasta que se ablanden, aproximadamente 3-4 minutos. Agregue el calabacín y la berenjena y fría hasta que comiencen a adquirir un poco de color, aproximadamente cinco minutos. Agregue el tomate picado, puré de tomate, agua y aceitunas. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos antes de revolver a través de la albahaca fresca.", "Para la salsa de aceitunas y vino tinto, llevar el vino en una sartén a hervir y desmenuzar en el cubo de la acción, revolviendo hasta que el cubo se haya disuelto. Agregue el agua caliente, luego reduzca el fuego y cocine a fuego lento durante 4-5 minutos antes de remover las aceitunas.", "Para servir, coloque los muslos de pollo en un plato para servir y póngalo al lado del pisto. Rocíe la salsa de vino rojo oliva alrededor del borde del plato y sirva."], "url": "www_bbc_co_uk_food_recipes_herbroastedchickenth_88810", "title": "Muslos de pollo asados ​​con hierbas con pisto y salsa de aceitunas y vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]