[{"isVegetarian": false, "title": "Fresh papardelle pasta with spinach, anchovy and tomato sauce", "url": "www_bbc_co_uk_food_recipes_freshparpadellepasta_90722", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 free-range eggs", "pinch salt", "2 tbsp olive oil", "½ onion, finely chopped", "8 cherry tomatoes, halved", "5 canned anchovies, drained and chopped", "100ml/3½fl oz white wine", "1 handful baby spinach leaves", "freshly ground black pepper", "4 fresh basil leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, place all of the pasta ingredients into a food processor and pulse until the mixture comes together to form a dough. Tip out onto a floured work surface and knead lightly, then roll out very thinly (use a pasta machine if you have one) and cut into strips using a pasta-cutting wheel. ", "Cook the pasta in boiling water for 1-2 minutes, or until cooked but still al dente, then drain and set aside. ", "For the sauce, heat the olive oil in a pan and gently fry the onion for 2-3 minutes, then stir in the tomatoes, anchovies and wine. Simmer for 3-4 minutes, or until reduced slightly, then stir in the spinach to wilt. ", "Add the cooked pasta to the sauce, mix well to coat, season with black pepper and garnish with the fresh basil leaves."]}, {"isVegetarian": true, "title": "Fresh pasta", "url": "www_bbc_co_uk_food_recipes_freshpasta_82374", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1½lb '00' flour, plus extra for dusting", "10 medium free-range eggs", "semolina, for dusting (optional)"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Pour the flour into a mound onto a flat surface and make a well in the centre. Crack the eggs into the well and gradually mix with either a blunt knife or your hands. When the dough has become a thick paste use your hands to incorporate more of the flour. ", "You can sieve any remaining flour and use the sifted flour while you knead the dough to stop it from sticking to the surface and to your hands, but be careful not to make the dough too dry. Knead until well blended and the dough is soft and flexible. Don't worry if you haven't used up all the flour.", "Leave the pasta to rest for about 20 minutes with a bowl inverted over it or leave it covered in cling film. You can sieve any leftover flour again and save this flour for rolling out the pasta.", "Divide the pasta in half before rolling it out to prevent it drying out. Wrap the half you are not using in cling film.", "Begin by flattening the dough with the palm of your hand, then roll the pasta out using a heavy wooden rolling pin (a pasta machine could also be used). ", "Dust the surface, the pasta and the rolling pin with flour to prevent it sticking. When the dough is thin enough to see your fingers through it, it is ready to be cut into whichever pasta shape you choose.", "When cut, separate into individual pieces and toss with dried semolina or a little more flour to prevent the pasta sticking to itself. Leave it on a floured tray and cook within the hour. Repeat to use up the remaining dough.", "Cook in boiling salted water for 3-5 minutes, depending on the thickness of the strands or shapes."]}, {"isVegetarian": true, "title": "Fresh pasta dough", "url": "www_bbc_co_uk_food_recipes_freshpastadough_3067", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshpastadough_3067_16x9.jpg", "ingredients": ["140g/5oz plain flour or Italian '00' flour", "2 medium eggs, 1 whole and 1 yolk (preferably organic)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour in a food processor and pulse it. Add the whole egg and egg yolk and keep whizzing until the mixture resembles fine breadcrumbs (it shouldn't be dusty, nor should it be a big, gooey ball). This takes 2-3 minutes.", "Tip out the dough and knead to form into a ball shape. Knead it briskly for 1 minute, it should be quite stiff and hard to knead. Wrap in cling film and leave to rest in a cool place for 1 hour before using.", "Now cut the dough into 2 pieces. For each piece, flatten with a rolling pin to about 5mm/¼ in) thickness. Fold over the dough and pass it through the pasta machine at its widest setting, refolding and rolling 7 times (not changing the setting) until you have a rectangular shape 7.5x18cm/3x7 in. It is important to work the dough until it is nice and shiny, as this gives it the \"al dente\" texture. Repeat with the second piece of dough.", "Now you are ready to roll out. Start with the pasta machine at its widest setting, pass the dough through the rollers. Do not fold but repeat this process, decreasing the roller setting down grade by grade with each pass. For most uses, I take the pasta down to the penultimate setting - especially for ravioli, as you are sandwiching two layers together when it is folded. Use straight away to make the ravioli."]}, {"isVegetarian": true, "title": "Fresh pasta with chilli, smoked garlic and wild mushrooms", "url": "www_bbc_co_uk_food_recipes_freshpastawithchilli_87147", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 free-range eggs", "2 tsp extra virgin olive oil, plus extra for drizzling ", "3 tbsp olive oil", "1 smoked garlic clove, chopped", "1 green chilli, finely chopped", "handful each fresh parsley and chives", "30g/1oz butter", "150g/5½oz wild mushrooms, cleaned and sliced", "1 smoked garlic clove, finely chopped ", "1 tbsp chopped parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, place the flour into a food processor and crack in the eggs one at a time with the motor running until the mixture resembles fine breadcrumbs. ", "Add the olive oil and blend for a couple of seconds. Turn out onto a floured surface and knead for five minutes. Ideally wrap in cling film and allow to rest at room temperature for 30 minutes. If you dont have time, it is possible to use it straightaway.", "Work the pasta through a pasta machine according to the machine instructions until it is as thin as possible. Cut into strips either by hand or using the pasta machine and hang up to dry for two minutes. ", "Bring a large pan of salted water to the boil, drop in the pasta and cook for two minutes. Drain well and mix with extra virgin olive oil.", "For the sauce, heat the olive oil in a pan, add the garlic and chilli and sauté for 1-2 minutes. ", "Transfer the mixture to a blender. Add the parsley and chives and blend until smooth.", "For the mushrooms, heat the butter in a frying pan, add the mushrooms and garlic and cook gently for 2-3 minutes until soft.", "To serve, mix the pasta with the chilli sauce, spoon into a serving bowl and scatter with the mushrooms. Garnish with parsley."]}, {"isVegetarian": true, "title": "Fresh pea and mint soup", "url": "www_bbc_co_uk_food_recipes_freshpeaandmintsoup_88416", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra to serve", "25g/1oz butter", "½ onion, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz fresh peas", "200ml/7fl oz vegetable stock", "2 tbsp chopped fresh mint"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a frying pan and fry the onion and garlic until softened but not coloured.", "Add the peas and stock and bring to a gentle simmer. Cook until the peas are tender, about 5-8 minutes.", "Remove from the heat. Stir in the fresh mint and blend until smooth with a hand blender. Serve in a bowl garnished with a drizzle of olive oil."]}, {"isVegetarian": true, "title": "Fresh pea and spinach soup with chives", "url": "www_bbc_co_uk_food_recipes_freshpeaandspinachso_88584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra for drizzling", "½ onion, finely chopped", "1 garlic clove, chopped", "85g/3oz fresh peas, podded", "2 large handfuls baby spinach", "300ml/½ pint hot vegetable stock", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry gently until softened but not coloured. Add the garlic and fry for one minute.", "Add the peas, spinach and hot stock and bring to the boil. Reduce the heat and simmer for eight minutes, or until the peas are tender. Season with salt and freshly ground black pepper and blend with a hand-blender until smooth.", "To serve, pour into a bowl and garnish with chopped fresh chives and a drizzle of olive oil."]}, {"isVegetarian": true, "title": "Fresh plum chutney", "url": "www_bbc_co_uk_food_recipes_freshplumchutney_1320", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshplumchutney_1320_16x9.jpg", "ingredients": ["450g/1lb red plums, halved and stoned", "180g/6oz caster sugar", "120ml/4fl oz cider vinegar", "1 cinnamon stick", "2 star anise"], "serves": "Makes one jar", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a pan and heat gently until the sugar dissolves. Bring to the boil and simmer gently for about 20-30 minutes until the plums are tender and the liquid is syrupy. Cool and keep in the fridge. ", "Serve with cheeses or ham."]}, {"isVegetarian": false, "title": "Fresh seafood pasta", "url": "www_bbc_co_uk_food_recipes_freshseafoodpasta_85131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "15g/½oz butter", "2 spring onions, chopped", "2 garlic cloves, chopped", "150g/5½oz mixed fresh seafood", "pinch saffron, soaked in 1 tbsp water", "150g/5½oz fresh pasta, such as linguine, cooked according to packet instructions", "1 tbsp freshly grated parmesan"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil and butter in a pan, add the spring onions and cook gently for 2-3 minutes. ", "Add the garlic and fry for another minute. Add the seafood and saffron, along with its soaking liquid, and cook for 2-3 minutes. Stir in the hot cooked pasta and mix well to coat.", "To serve, place the seafood pasta into serving dishes and sprinkle over the grated parmesan."]}, {"isVegetarian": true, "title": "Fresh profiteroles filled with crème pâtissière and served with warm chocolate sauce", "url": "www_bbc_co_uk_food_recipes_freshprofiterolesfil_91165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "75g/2½oz plain flour", "pinch salt", "150ml/5¼fl oz water", "50g/1¾oz unsalted butter", "2 large free-range eggs, beaten", "4 free-range egg yolks", "60g/2¼fl oz caster sugar", "2 tsp cornflour", "25g/1oz plain flour", "280ml/10fl oz milk", "100g/3½oz  dark chocolate, at least 70 per cent cocoa solids", "150ml/5¼fl oz whipping cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6 and grease a large baking tray with butter. Sift the flour and salt twice.", "Put the water and butter into saucepan, gradually heat until the butter melts and then increase the temperature. As soon as the water reaches a brisk boil, lower the heat again and tip in all of the flour. Beat quickly until the mixture forms a ball and leaves the sides of the pan clean.", "Remove the pan from the heat and cool slightly. Add the eggs, one at a time, beating hard until the mixture is shiny and firm.", "Spoon 20 equal balls of the mixture onto the buttered baking tray (alternatively you can pipe the pastry onto the tray for a neater finish).", "Bake in the oven for 20-25 minutes, or until golden-brown and puffed up. Transfer to a wire rack to cool.", "For the crème patissière, whisk the egg yolks and sugar together in a bowl until pale and light. Fold in the cornflour and flour.", "Bring the milk to the boil in a small saucepan and then whisk it gradually into the egg mixture. ", "Pour the mixture into a clean pan and bring it slowly to the boil until it thickens. Simmer for a minute and then take the pan off the heat.", "Cover with cling-film to prevent a skin from forming. ", "When the profiteroles are cooled, slice each one in half with a sharp knife. Fill with the crème patissière.", "For the warm chocolate sauce, heat the chocolate and cream in a heatproof bowl placed over a pan of simmering water until melted - do not allow the water to touch the bottom of the bowl. Stir to combine.", "Serve the warm chocolate sauce drizzled over the filled profiteroles."]}, {"isVegetarian": true, "title": "Fresh spaghetti with tomato and basil sauce", "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithto_84970", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour", "1 free-range egg", "pinch salt", "1 tbsp olive oil", "½ onion, chopped", "2 garlic cloves, finely chopped", "200g/7oz fresh chopped tomatoes", "handful fresh basil, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the spaghetti, mix the flour with the egg and salt in a blender until combined.", "Turn the dough onto a floured surface and knead for one minute.", "Wrap the dough in cling film and rest in the fridge for five minutes.", "Roll the dough through a pasta machine according to the manufacturer's instructions until very thin.", "Roll the dough through the spaghetti setting on the pasta machine and set the fresh spaghetti aside until you are ready to cook it.", "To make the sauce, heat the oil in a frying pan. Add the onion and garlic and cook until softened, but not browned.", "Add the tomatoes and cook until broken down.", "Cook the pasta in a large pan of salted boiling water for 30 seconds, before draining well.", "Stir the basil through the tomato sauce and season to taste with salt and freshly ground black pepper.", "Serve the pasta in a serving bowl with the sauce spooned over."]}, {"isVegetarian": false, "title": "Fresh spaghetti with wild mushroom ragù", "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithwi_87692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 free-range eggs", "pinch salt", "1 tbsp oil", "½ onion, finely chopped", "2 rashers streaky bacon, chopped", "200g/7oz mixed wild mushrooms, sliced", "1 garlic clove, finely chopped", "150ml/¼ pint white wine", "3 tbsp double cream", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pasta, place the flour, eggs and salt into a food processor and blend until the mixture comes together as a dough.", "Turn the dough out onto a lightly floured work surface and knead until smooth. Wrap in cling film and leave to rest in the fridge for an hour, if time allows.", "Feed the pasta through a pasta machine, beginning on the thickest setting and working down to the thinnest setting. Slice into thin spaghetti using the pasta cutter on the machine.", "For the ragù, heat the oil in a frying pan and add the onion and bacon. Fry gently until soft, then add the mushrooms and garlic and stir well.", "Add the wine and simmer until reduced by half.", "Add the cream and season, to taste, with salt and freshly ground black pepper.", "Cook the spaghetti in boiling salted water for 2-3 minutes, then drain and mix with the mushroom ragù.", "To serve, divide the spaghetti between two serving bowls."]}, {"isVegetarian": true, "title": "Fresh spaghetti with rich black olive and tomato ragù", "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithri_84620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz fresh spaghetti", "dash of olive oil", "1tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, chopped", "2 roasted red peppers, chopped", "100g/3½oz kalamata olives, pitted and chopped", "1 tbsp tomato ketchup", "dash Tabasco sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the spaghetti into a large pan of boiling salted water with a dash of olive oil. Cook according to packet instructions.  Once cooked drain the pasta in a colander and toss with a little more olive oil.", "For the ragu, heat the oil in a small saucepan.  Add the onion and cook gently for three minutes until the onions have softened. ", "Add the garlic to the onions and cook for one minute. ", "Add the red peppers, olives, ketchup and Tabasco sauce to the ragu and cook for five minutes. ", "Place the hot spaghetti in the pan with the ragu and mix well.  To serve, spoon the mixture into a clean bowl."]}, {"isVegetarian": true, "title": "Fresh tagliatelle with cherry tomato and basil sauce", "url": "www_bbc_co_uk_food_recipes_freshtagliatellewith_88208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 very large free-range eggs", "pinch sea salt", "2 tbsp olive oil", "2 garlic cloves, finely chopped", "1 x 400g/14oz can cherry tomatoes", "½ tsp dried chilli flakes", "salt and freshly ground black pepper", "75g/2¾oz Wensleydale cheese with cranberries", "small bunch fresh basil, torn", "2 tbsp chopped fresh flatleaf parsley", "5 fresh basil leaves, torn"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, combine the flour, eggs and salt in a food processor, adding more flour if needed or a drop of water if the mixture is too dry. Pulse until the mixture comes together as a dough. Turn out onto a floured surface and knead until smooth and elastic.", "Cut the ball of dough in half and feed one half through a pasta machine. Repeat this 5-6 times, decreasing the thickness of the pasta at each stage. Repeat with the other half of the pasta dough.", "Drape the pasta sheets over a wooden spoon or the back of a chair and allow them to dry for about five minutes. Meanwhile, attach the tagliatelle cutter attachment to your pasta machine.", "Feed the sheets through the pasta machine, gathering up the strips as they come out and forming loose 'nests' on a floured surface.", "For the tomato sauce, heat the olive oil in a pan and gently fry the garlic for one minute.", "Add the tomatoes and chilli flakes, season with salt and freshly ground black pepper and cook for 8-10 minutes, until the sauce is slightly reduced. Crumble in the cheese and mix through to melt. Stir in the basil and parsley.", "Cook the pasta in a large saucepan of salted boiling water for about two minutes, or until al dente. Drain and return to the pan, then stir in the sauce. ", "Serve the pasta in shallow bowls, garnished with fresh basil."]}, {"isVegetarian": true, "title": "Fresh tagliatelle with fennel, roasted peppers and peas", "url": "www_bbc_co_uk_food_recipes_freshtagliatellewith_89018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, plus extra for dusting", "2 free-range eggs", "pinch salt", "2 tbsp olive oil", "½ red pepper, chopped", "85g/3oz fresh peas", "¼ fennel bulb, sliced", "75ml/2½fl oz white wine", "1 small handful fresh parsley leaves", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tagliatelle, place the flour, eggs and salt into a food processor and pulse until well-combined. Knead on a floured work surface to bring the dough together, then wind through a pasta machine several times, starting from the thickest setting and working down to the thinnest, until smooth and elastic. Cut tagliatelle from the pasta dough, using the relevant machine attachment, or cut into strips.  ", "Cook the pasta in boiling salted water for 2-3 minutes, or until al dente. Drain and set aside.", "For the sauce, heat the olive oil in a saucepan and lightly fry the red pepper and peas for 4-5 minutes. Add the sliced fennel and white wine, reduce the heat and simmer for five minutes, or until the sauce has thickened slightly.  ", "To serve, mix together the olive oil and the parsley leaves in a small bowl. Stir the cooked tagliatelle into the sauce and pile onto a serving plate. Drizzle over the parsley oil and serve."]}, {"isVegetarian": true, "title": "Fresh tomato salsa (with bruschetta variations)", "url": "www_bbc_co_uk_food_recipes_freshtomatosalsawith_8881", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshtomatosalsawith_8881_16x9.jpg", "ingredients": ["500g/1lb2oz ripe, full-flavoured tomatoes (such as Sungold or Gardener's Delight)", "2 tbsp extra virgin olive oil", "1 medium shallot or small red onion, finely chopped", "a squeeze of lemon or 1 tbsp white wine vinegar", "salt and fresh ground black pepper", "ciabatta", "garlic", "olive oil", "black olives", "anchovies", "fresh basil leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour boiling water over the tomatoes and remove them after 30 seconds. Peel them with a sharp knife and cut into quarters, scoop out the seeds with a thumbnail.", "You are left with skinless, seedless, delectably sweet tomato flesh. This can be left in quarters (for a chunky, salady version) or more finely chopped (if you are tending towards the salsa). Either way, toss with the remaining ingredients and it is ready to serve.", "For the bruschetta variations, grill slices of ciabatta or pugliese bread, rub with garlic and drizzle with olive oil. Mix the tomato salsa (chunky version) with a few chopped black olives, and/or a couple of chopped anchovies and/or a few torn fresh basil leaves. Pile on to the bread and serve as a starter, either on its own or with other antipasti."]}, {"isVegetarian": true, "title": "Fricassée of wild mushrooms", "url": "www_bbc_co_uk_food_recipes_fricasseeofwildmushr_93489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ small French baguette", "1 garlic clove, halved ", "400g/14oz mixed wild mushrooms (pied de mouton, girolle, chanterelle  and trompette de la mort)", "30g/1½oz unsalted butter", "½ banana shallot or ¼ onion, peeled, chopped ", "1 garlic clove, peeled, puréed", "100ml/3½fl oz dry white wine", "4 pinches sea salt", "4 pinches freshly ground black pepper", "10g/½oz fresh flatleaf parsley leaves, roughly chopped", "1 sprig fresh tarragon, leaves only, finely chopped", "2 sprigs fresh chervil, finely chopped", "1 tbsp lemon juice", "200g/7oz tomatoes, quartered, seeds scooped out, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "For the croutons, cut the baguette into 3mm-thick slices and arrange in an even layer on a baking sheet. Toast in the oven for 2-3 minutes on both sides, or until golden-brown and crisp. Rub each slice of toast with the cut sides of the garlic clove. Set aside. ", "For the mushrooms, lightly brush the mushrooms to get rid of any remaining dirt or mud. Briefly wash the mushrooms in a large bowl of fresh water (for no more than 10-15 seconds) then lift them out and place onto a clean tea towel. Gently pat dry, then cut off the base of the stalks and discard. ", "Heat the butter in a pan over a medium heat until foaming, then add the shallots and garlic and fry for 30 seconds. Increase the heat to high, then add the pied de mouton mushrooms and cook for one minute. Add the white wine and cook for one minute, or until the liquid has reduced slightly, then add the girolles. Cook for a further minute before adding the trompette de la mort, herbs, lemon juice and tomatoes. Stir well. Add a splash of water if the mixture is becoming too dry, then season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the mushrooms into serving bowls and crumble over the croutons."]}, {"isVegetarian": true, "title": "Fried aubergine with fennel yoghurt", "url": "www_bbc_co_uk_food_recipes_fried_aubergine_with_69889", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_aubergine_with_69889_16x9.jpg", "ingredients": ["2 heads fennel, quartered ", "1 tbsp olive oil, plus extra for blending", "2 cloves garlic, peeled", "1 lemon, juice only", "1 tbsp fennel seeds, toasted", "300g/10½oz thick Greek yoghurt", "250g/9oz breadcrumbs", "50g/2oz pecorino, grated ", "1 tsp chilli flakes", "salt and freshly ground black pepper ", "4 aubergines, cut into 2cm/1in rounds", "3 free-range eggs, beaten", "100g/3½oz plain flour", "vegetable oil, for deep frying ", "watercress, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the fennel yoghurt, heat the oil in an ovenproof casserole over a medium heat. Add the garlic and fennel and fry for 4-5 minutes, or until golden-brown and slightly softened.  ", "Add the lemon juice to the mixture, stir well, then cover and transfer to the oven. Roast for 15-20 minutes, or until the fennel is tender. Set aside to cool.", "For the aubergine chips, mix together the breadcrumbs, percorino, chilli flakes, salt and pepper in a shallow bowl. ", "Place the plain flour onto a shallow plate and beat the eggs in a shallow bowl. ", "Roll the aubergine sticks in the flour, then dip into the egg and finally coat in the breadcrumb mixture.   ", "Heat the oil in a deep-fat fryer to 150C/300F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Transfer the coated aubergine sticks to the hot oil to deep-fry for about six minutes, or until golden-brown. ", "Remove from the oil with a slotted spoon and drain on kitchen paper. ", "Combine the roasted fennel, roasted garlic and any roasting juices with the fennel seeds in a blender.  You may need to add some more olive oil or  lemon juice, to taste. Blend until the mixture is a smooth purée. ", "Pass the puréed fennel through a sieve and stir into the Greek yoghurt. ", "Serve the fennel yoghurt in a bowl and with the fried aubergine sticks and watercress on the side. "]}, {"isVegetarian": false, "title": "Fried calves' liver with straw fries, onion rings and cavolo nero", "url": "www_bbc_co_uk_food_recipes_fried_calfs_liver_with_41221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5½oz slices calves' livers, trimmed", "salt and freshly ground black pepper", "50g/1¾oz butter", "600g/1lb 5oz potatoes, peeled and cut into ½cm/¼in chips", "vegetable oil, for deep-frying", "salt, to taste", "100g/3½oz cornflour", "150ml/5½fl oz sparkling water", "2 small onions, finely sliced into rings", "50g/1¾oz unsalted butter", "1 head cavolo nero", "2 tbsp brandy", "2 tbsp butter", "2 tbsp Worcestershire sauce", "2 tsp Dijon mustard", "½ tsp sea salt", "freshly ground black pepper", "1 tbsp finely chopped parsley", "1 tsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fried calves' livers, season the livers, to taste, with salt and freshly ground black pepper. Heat a large frying pan over a high heat and add the butter. ", "When the butter is foaming, add the livers and fry on both sides for 1-2 minutes, or until golden-brown all over but still slightly pink in the middle. Remove from the pan and set aside to rest.", "For the straw fries, heat the vegetable oil in a deep-fat fryer to 190C/375F. Alternatively, half-fill a deep, heavy-based pan with the vegetable oil and heat to the same temperature, checking using a digital thermometer. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Fry the chips in the oil for 4-5 minutes, or until golden-brown and crisp. ", "Using a slotted spoon, remove the chips and set aside to drain on kitchen paper. While the chips are still warm, season with salt, to taste. ", "Mix the cornflour and a pinch of salt in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all of the water).", "Dip the onion rings into the batter and carefully lower into the hot oil. Fry for 1-2 minutes on each side, or until crisp and golden-brown on both sides. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper.", "Add the butter to a hot frying pan and, once foaming, add the cavolo nero and cook for a minute and then season with salt and pepper, then cook until wilted.", "For the Diane sauce, add the brandy to the still-hot pan that you cooked the liver in and return it to the heat. Very carefully tip the pan slightly to catch the flame and ignite the brandy. Flambé until the flame subsides. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.)", "Reduce the heat and quickly add the butter, Worcestershire sauce, mustard, sea salt and pepper, stirring vigorously with a wooden spoon for one minute, allowing the mixture to bubble and thicken. ", "Add the parsley and lemon juice to finish.", "To serve, place the cabbage in the centre of the plates and the liver on top. Pour the sauce over and serve alongside the fries and onion rings."]}, {"isVegetarian": false, "title": "Fried cod loin with white bean purée and garlic crisps", "url": "www_bbc_co_uk_food_recipes_fried_cod_loin_with_30050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz dried butter beans, soaked overnight, drained and rinsed", "1 carrot, peeled, cut into quarters", "1 shallot, cut into quarters", "1 garlic clove, crushed", "2 tbsp extra virgin olive oil  ", "1 tbsp chopped flat leaf parsley", "1 lime, zest and juice", "sunflower oil, for deep drying", "100ml/3½fl oz full-fat milk", "4 large garlic cloves, thinly sliced", "3 tbsp plain flour", "sea salt and freshly ground black pepper ", "8 garlic cloves, unpeeled", "4 cod loins, about 150g/5½oz each, skin on, patted dry", "40g/1½oz unsalted butter", "2 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the purée, put the butter beans in a saucepan, cover with cold water and bring to the boil over a high heat, skimming off any foam the rises to the surface. Add the carrot, shallot and garlic, turn the heat down to a simmer, partially cover and cook for 40 minutes until tender. ", "Strain the beans, reserving 4 tablespoons of the cooking liquid. Discard the carrot, shallot and garlic. Put the beans in a blender with 3 tablespoons of the cooking liquid and blend to a smooth purée. Add the extra virgin olive oil and blend again. Add the remaining cooking liquid if the purée is too thick. Season with salt and pepper, then stir in the parsley, half the lime zest and all of the lime juice.", "For the garlic crisps, heat a deep, heavy-bottomed saucepan with enough sunflower oil to deep-fry the garlic. Heat to 160C/315F, or until a cube of bread browns in 45 seconds. Alternatively, use a deep-fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Meanwhile bring the milk to a gentle boil in a small saucepan, add the sliced garlic and blanch for 2-3 minutes until softened slightly but not breaking up. Remove and pat dry with kitchen paper. Discard the milk. ", "Lightly dust the garlic in the flour, then carefully drop a few slices at a time into the hot oil and fry for 2-3 minutes until golden-brown and crisp. Drain on kitchen paper. Season with salt and set aside. ", "For the cod, blanch the garlic cloves in a small saucepan of boiling water for 4-8 minutes until softened, then drain. Refresh in cold water and pat dry with kitchen paper. ", "Season the skin of the cod with salt and pepper. Heat a lidded non-stick frying pan over a high heat. Add the butter and olive oil. When the butter is foaming, add the cod, skin side down, and cook for 3-5 minutes, or until the skin is crisp and golden. Turn the heat down to medium-low, add the blanched garlic cloves, partially cover with the lid and cook for 3-4 minutes. Remove the lid, turn the fish over and cook for a further 2-3 minutes until just cooked through. ", "Serve the cod on a bed of the bean purée with the buttery garlic sauce spooned over the top. Sprinkle with garlic crisps and the remaining lime zest before serving."]}, {"isVegetarian": false, "title": "Fried corned beef and egg with beetroot and potato rosti", "url": "www_bbc_co_uk_food_recipes_fried_corned_beef_and_60973", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large Maris Piper potatoes, scrubbed, not peeled, coarsley grated", "2 beetroot, peeled, coarsely grated", "75g/2½oz crème fraîche", "1 free-range egg, yolk only", "1 tbsp finely chopped fresh parsley", "salt and freshly ground black pepper", "75g/2½oz butter, melted", "1 free-range egg, yolk only", "1 lemon, juice only", "110g/4oz clarified butter, warmed", "pinch cayenne pepper", "pinch salt", "50g/1¾oz butter", "400g/14oz corned beef, sliced", "2 tbsp rapeseed oil", "2 duck eggs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot and potato rosti, preheat the oven to 200C/400F/Gas 6.", "Place the grated potatoes into a clean tea towel inside a bowl and squeeze out any excess water into the bowl.", "Transfer the grated potato and grated beetroot into a clean bowl along with the crème fraîche, egg, parsley, salt and pepper. Stir until well combined.", "Heat the butter in an ovenproof frying pan over a medium heat and place 2 x 7.5cm/3in chefs' rings in the pan. Spoon the potato mixture into the rings, press down well using a spoon, and cook for 3-4 minutes, or until golden-brown. Remove the rings, turn the rosti over, press the mixture down and cook for 3-4 minutes on the other side. ", "Transfer the pan to the oven and bake the rosti for 5-10 minutes, or until tender and cooked through.", "For the hollandaise sauce, put the egg yolk, lemon juice and a tablespoon of water in a blender. Turn on the blender and slowly pour the warmed butter through the lid, the sauce will start to thicken. Season with cayenne pepper and salt.", "For the corned beef and egg, heat a large frying pan and add the butter, once hot, add the sliced corned beef. Cook on each side for 2-3 minutes, until crisp and golden-brown. Remove from the pan. ", "Add the oil to the pan. Break the eggs into the pan and fry until cooked to your liking.", "To serve, place the rosti in the centre of serving plates and place the fried corned beef on top. Top with the fried egg and pour over the hollandaise sauce."]}, {"isVegetarian": true, "title": "Fried tortilla chips in green salsa with fried eggs and crumbled cheese (chilaquiles)", "url": "www_bbc_co_uk_food_recipes_fried_eggs_with_a_crispy_99565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_eggs_with_a_crispy_99565_16x9.jpg", "ingredients": ["¼ onion, roughly chopped", "1½ green serrano or jalapeño chillies, stems removed, halved", "2 garlic cloves, finely chopped", "125ml/4½fl oz chicken stock or water", "380g tin tomatillos, available online", "½ tsp flaked sea salt", "300ml/10fl oz corn or sunflower oil, plus 2 tablespoons", "4 corn tortillas, each cut into 8 triangles", "4 free-range eggs", "75g/2½oz Lancashire cheese or feta, crumbled", "1 shallot, thinly sliced", "1 tbsp roughly chopped fresh coriander", "4 tbsp soured cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the onion, chillies, garlic, stock and tomatillos into a food processor and blend to make a sauce. ", "Place a saucepan over a medium heat and add 2 tablespoons of corn oil. Add the sauce and season with salt to taste. Simmer for 5 minutes, or until thickened. ", "Heat 300ml/10fl oz oil to 190C in a large heavy-based pan (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the tortilla triangles until just golden-brown and crisp, then drain on kitchen paper. ", "Fry the eggs in a little oil in a frying pan over a medium heat, until cooked to your liking.", "Stir the tortillas into the sauce, folding lightly to coat them but taking care not to break them. Divide the mixture between four warm shallow bowls and top each one with a fried egg. Top with crumbled cheese, the shallot, coriander and soured cream. Serve immediately."]}, {"isVegetarian": false, "title": "Fried egg ‘bourguignon’ with duck confit and cracklings and grilled Portobello mushrooms", "url": "www_bbc_co_uk_food_recipes_fried_egg_bourguignon_90211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Portobello mushrooms (about 8cm/3¼in in diameter), stems trimmed and reserved, skin peeled and reserved", "110ml/4fl oz olive oil", "3 garlic cloves, crushed", "4 sprigs fresh thyme, leaves only", "salt and freshly ground black pepper", "5 free-range eggs", "2 tbsp white wine vinegar", "salt and freshly ground black pepper", "110g/4oz plain flour", "200g/7oz fresh breadcrumbs", "vegetable oil, for deep frying", "150g/5oz shallots (about 4 large shallots), finely chopped", "2 garlic cloves, finely chopped", "300ml/11fl oz red wine", "40ml/1½fl oz olive oil", "salt and freshly ground black pepper", "110g/4oz small red onions, such as red pearl onions, peeled and halved", "30g/1¼oz butter", "60ml/2½fl oz chicken stock (or water)", "salt and freshly ground black pepper", "4 tsp olive oil", "150g/5oz mixed wild mushrooms (such as chestnut, shiitake and girolles), trimmed and rinsed", "trimmings and skin from Portobello mushrooms (see above)", "1 ready-made confit duck leg, meat picked from bone and roughly chopped", "2 tbsp sherry vinegar", "mixed cracked peppercorns, to taste", "10g/¼oz fresh chives, sliced", "110g/4oz mixed green salad leaves", "1 tbsp lemon juice", "3 tbsp olive oil", "salt and freshly ground black pepper", "50g/2oz duck ‘cracklings’ (fried duck skin)"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the grilled Portobello mushrooms, place the mushrooms into a bowl, drizzle over the oil and sprinkle with the garlic and thyme leaves. Season, to taste, with salt and freshly ground black pepper. Mix until the mushrooms are coated in the marinade mixture. Set aside to marinate for at least one hour. ", "For the crispy egg, bring a large pot of water to the boil. Add the vinegar and a pinch of salt. Set a bowl of ice water alongside. ", "Boil 4 of the eggs in the water for exactly 5 minutes, then remove from the pan using a slotted spoon and chill in the ice water. ", "Crack the remaining egg into a bowl. Whisk and add a pinch of salt and freshly ground black pepper. ", "Sprinkle the flour and breadcrumbs into two separate shallow dishes and season with salt and freshly ground black pepper. ", "Peel the cooled boiled eggs. Dredge each one first in the flour, then dip it in the whisked egg, then roll it in the breadcrumbs until completely coated. Chill in the fridge.", "Meanwhile, for the shallot purée, bring the shallots, garlic and wine to a gentle simmer in a small saucepan. Simmer until the shallots are tender and the wine has almost completely evaporated. ", "Transfer the mixture to a food processor, add the olive oil, and blend to a smooth purée. Season, to taste, with salt and freshly ground black pepper, then set aside until needed. Keep warm.", "When the mushrooms have marinated, preheat the grill to medium and grill the mushrooms for 7-8 minutes on each side, or until cooked through. ", "Cut each grilled mushroom into a perfect circle using a 7.5cm/3in cookie cutter. Then cut a smaller circle inside each mushroom using a 4cm/1½in cookie cutter to make a donut shape. Keep warm. ", "Chop and reserve the cooked trimmings.", "For the duck confit fricassée, mix together the red onions, butter and chicken broth in a small frying pan. Season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer and cook until the shallots are tender, about 3-4 minutes. ", "Heat the olive oil in a separate pan over a medium to high heat. Add the mixed wild mushrooms, garlic and thyme and fry for 2-3 minutes, or until softened. Season, to taste, with salt and freshly ground black pepper. ", "Add the reserved trimmings from the grilled Portobello mushrooms, the confit duck leg meat and the onion mixture and mix well. ", "Pour in the sherry vinegar and fry for a further 2-3 minutes. ", "Just before serving, heat the oil in a deep fat fryer to 180C/350F. Roll the chilled, coated eggs in more breadcrumbs, then deep-fry until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt. ", "To serve, place a spoonful of shallot purée into the centre of each of four serving plates. Spoon a large spoonful of duck confit fricassée on top, then plate one grilled mushroom ring on top. Slice off the wider end of each deep-fried egg to expose the yolk, then set one inside each Portobello mushroom. Sprinkle over a pinch of cracked peppercorns and some of the chives.", "Whisk the lemon juice with the olive oil and season, to taste, with salt and freshly ground black pepper. Add the salad leaves and mix to coat the leaves in the dressing. Arrange the salad around the edge of the plate with a few duck cracklings. Serve warm."]}, {"isVegetarian": false, "title": "Fried flat fish with a bean stew", "url": "www_bbc_co_uk_food_recipes_fried_flat_fish_with_a_83200", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "200g/7oz cooking chorizo, cut into small chunks", "1 tomato, peeled, seeds removed, finely chopped", "2 garlic cloves, chopped", "1 shallot, chopped", "110g/4oz roasted peppers (from a jar), thickly sliced", "350g/12oz tinned haricot beans, drained", "2 sprigs rosemary, finely chopped", "4 sprigs thyme, finely chopped", "2 tsp sweet smoked paprika", "250ml/9fl oz chicken stock", "50g/1¾oz unsalted butter", "5 tbsp double cream", "2 tbsp roughly chopped flatleaf parsley", "2 tbsp olive oil", "1 whole plaice or lemon sole, filleted and pin boned", "50g/1¾oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until medium-hot. Add the olive oil and the chorizo and cook for 5 minutes, or until the oil has changed colour and the chorizo is crisp around the edges. ", "Add the tomato, garlic and shallot. Gently fry for a minute, then add the peppers, beans, rosemary, thyme and paprika and cook for a further 2 minutes.", "Add the stock and bring to a simmer. Cook for 4-5 minutes, or until the shallot has softened and the volume of liquid has reduced slightly. Stir in the butter, cream and parsley. Season, to taste, with plenty of black pepper.", "For the fish, heat the oil in a medium frying pan. Once hot, add the fish skin-side down in the pan and cook for 2-3 minutes on each side. Add the butter and baste the fish with it as it melts.", "To serve, place the beans in serving bowls and top with the fish."]}, {"isVegetarian": false, "title": "Fried fish with garlic and spring onions", "url": "www_bbc_co_uk_food_recipes_fried_fish_with_garlic_83139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb fillets of sole or plaice (dark skin removed), cut into 2.5cm/1in strips", "2 tsp salt", "¼ tsp freshly ground white pepper", "2 medium free-range eggs", "50g/1¾oz cornflour", "150ml/5fl oz groundnut or vegetable oil", "3 tbsp garlic, finely sliced ", "2 tbsp spring onions, finely chopped\t\t\t", "2 tbsp Shaoxing rice wine or dry sherry", "2 tsp sesame oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["If you are using plaice, ask the fishmonger to remove the dark skin of the plaice or remove it yourself with a small, sharp knife.  ", "Cut the fish fillets into 2.5cm/1in strips. Sprinkle them with a teaspoon of salt and the pepper. Set aside in the fridge for 15 minutes.", "Beat the eggs in a small bowl. Coat the pieces of fish in cornflour and then beaten egg.", "Heat a wok or large frying-pan over high heat until hot. Add the oil. When it is very hot and slightly smoking, turn the heat down to medium. Shallow-fry the fish pieces on each side, in several batches, until they are golden-brown. Drain them on kitchen paper. Pour off the oil and discard it. ", "Wipe the wok or pan clean. Add the rest of the ingredients and the remaining teaspoon of salt. Simmer for 2 minutes. Put the fried fish fillets on a warm serving platter and pour over the hot sauce. Serve at once."]}, {"isVegetarian": true, "title": "Fried goats’ cheese", "url": "www_bbc_co_uk_food_recipes_fried_goats_cheese_52240", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp red wine vinegar", "½ tsp honey", "4 tomatoes, finely chopped", "½ red onion, finely chopped", "1 small garlic clove, finely chopped", "1 red chilli, finely chopped, or ½ tsp dried red chilli flakes", "1 sprig fresh rosemary, leaves only, very finely chopped", "handful fresh parsley leaves, shredded", "handful fresh basil leaves, shredded", "50g/1¾oz plain flour", "2 free-range eggs", "75g/2½oz breadcrumbs (fresh or panko)", "2 tsp herbes de provence or similar", "500g/1lb 2oz goats’ cheese, rind removed, cut into rounds", "olive oil, for frying", "2 garlic cloves, sliced", "salt and freshly ground black pepper", "2 tbsp honey, gently heated (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["If you are serving the salsa, make it first to allow the flavours to meld and develop while you cook the cheese. Put the oil, vinegar and honey in a bowl and stir until the honey has dissolved. Add the remaining ingredients and season. Set aside.", "To make the fried cheese, put half the flour on a small plate. Put one of the eggs in a small bowl and beat. Put half the breadcrumbs on a small plate, add half the herbs and season.", "Dip half the cheese slices in the flour, then dust off any excess. Next dip them in the egg and shake off any excess. Finally, press them into the breadcrumbs and turn them over until coated. Set aside. Repeat with the remaining flour, egg, breadcrumbs and cheese. ", "Pour the oil into a large frying pan until 1cm/½in deep. Add the garlic and fry until it starts to colour, then remove immediately. ", "Fry the cheese in batches – it will not crisp up if you overcrowd the pan – and drain on kitchen paper.", "Serve the fried cheese with the salsa or drizzled with the honey."]}, {"isVegetarian": false, "title": "Fried ham and cheese sandwich", "url": "www_bbc_co_uk_food_recipes_fried_ham_and_cheese_34474", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_ham_and_cheese_34474_16x9.jpg", "ingredients": ["250g/9oz gruyère cheese, grated", "2 free-range egg yolks", "1 tbsp Worcestershire sauce", "1 tsp mustard powder", "2 pinches cayenne pepper", "dash cream (if mixture is too thick to spread)", "4 slices thin white bread (square)", "4 thin slices cooked ham", "olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the sandwich filling ingredients (except the cream) into a food processor and blend until smooth (the mixtuer should spread easily, but add a little cream if needed.) ", "Cover four slices of bread with a thin layer of cheese mixture almost to the edge, place a slice of ham over that and then finally place another slice of bread on to the ham. Press down firmly and then repeat the process for the second sandwich. Cut off the crusts and liberally brush (or spray) each side of the sandwiches with olive oil.", "Cut each sandwich in half to give four rectangles. Heat a large, non-stick frying pan until medium-hot and fry the sandwiches in the dry pan until gorgeously golden-brown and crusted on each side - about two minutes per side. "]}, {"isVegetarian": false, "title": "Fried pork fillet with quince and wilted chard", "url": "www_bbc_co_uk_food_recipes_fried_pork_fillet_with_64068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz pork fillet, trimmed", "salt and freshly ground black pepper", "1 tbsp olive oil", "50g/1¾oz unsalted butter", "110g/4oz sugar ", "90g/3½oz butter", "½ lemon, juice only", "500g/1lb 2oz quince, peeled, cores removed, chopped", "50g/1¾oz unsalted butter", "1 head chard, leaves removed and shredded", "200ml/7fl oz pork jus or gravy"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork fillet, preheat the oven to 200C/400F/Gas 6.", "Season the pork fillet with salt and freshly ground black pepper.", "Heat an ovenproof frying pan until hot, add the oil then the pork fillet, and sear until golden-brown on all sides (about 30-45 seconds on each side). ", "Transfer the pan to the oven and roast for 6-8 minutes. Remove from the oven and rest for five minutes in the pan.", "For the quince, heat the sugar, 40g/1½oz of the butter and the lemon juice with 500ml/18fl oz water in a non-reactive saucepan until the sugar is dissolved and the mixture is well combined. ", "Add the quince and bring the mixture to the boil. Reduce the heat and simmer until the quince has softened. Strain off the liquid, reserving a few tablespoonsful.", "Transfer half of the quince to a food processor and blend to a smooth purée. Pass the purée through a fine sieve, loosening the strained mixture with a little of the reserved cooking liquid if necessary. ", "Put the quince purée in a clean saucepan. Season, to taste, with salt and freshly ground black pepper, and cover with cling film until required. ", "For the rest of the quince, heat the remaining butter in a frying pan and, once hot, add the quince and fry for 1-2 minutes.", "For the wilted chard, heat the butter in a large pan and once hot add the chard and cook until wilted.", "To serve, slice the pork and divide between two serving plates. Add the purée, fried quince and wilted chard."]}, {"isVegetarian": false, "title": "Fried mackerel and sweet potato gnocchi", "url": "www_bbc_co_uk_food_recipes_fried_mackerel_and_sweet_44395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large mackerel fillets ", "1 orange, juice and zest only ", "3 slices red onion ", "3 tbsp sherry vinegar ", "1 tsp sea salt ", "1 small glass white wine", "a few peppercorns", "3 bay leaves", "8 slices prosciutto", "500g/1lb2oz sweet potatoes", "500g/1lb 2oz potatoes, for mash ", "1 free-range egg  ", "200g/7oz 00 flour, plus extra for dusting", "2 litres vegetable stock ", "100g/3½oz unsalted butter ", "handful freshly picked samphire (optional)", "extra virgin olive oil, to taste", "12 large sage leaves, roughly chopped", "75g/2½oz parmesan, freshly grated ", "½ red onion, finely diced", "1 large bunch basil", "3 large ripe tomatoes, peeled and roughly chopped", "a pinch smoked sea salt (available in specialist delicatessens and online) ", "drizzle good olive oil ", "salt and freshly ground black pepper "], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, cut the fillets in half and place in a large bowl. Add the zest of half the orange, the orange juice, onion slices, sherry vinegar, sea salt, white wine, a few peppercorns and the bay leaves. Leave to marinade for an hour, then drain off any liquid and set aside until ready to cook.", "For the Gnocchi, either boil or bake the sweet potatoes and potatoes in their skins until tender (boiling will be faster). If baking, heat the oven to 180C/350F/Gas 4 and bear in mind that the sweet potatoes will take less time to cook than the other potatoes.", "Once the potatoes and sweet potatoes are cooked and cool enough to handle, remove the skins and push the flesh through a potato ricer (or use a potato masher). ", "Season to taste with salt and freshly ground black pepper. Then add the egg and flour a little at a time to form a smooth, slightly sticky dough.", "Tip out the dough onto a clean, floured work surface. Divide the mixture into eight and roll into sausage shapes about 1cm/½in thick. Cut into 2cm/ ¾in long sections and roll in the flour. Carefully but quite firmly roll each piece down the prongs of a fork (this will make the traditional indentations). Compress the gnocchi lightly with your thumb and roll on a floured tray (to round off the ends). Set aside for a few hours to set (or you can freeze them until you need them).", "For the salad, combine all the ingredients together in a bowl. Toss together and set aside until ready to use.", "When you are ready to cook the gnocchi, fill a large pan with the stock and bring to the boil. Add the gnocchi. ", "While the gnocchi is cooking, make the sauce. Gently melt the butter in a large frying pan until the butter becomes a light-brown colour. Add the samphire (if using), a ladel of the gnocchi cooking liquor and some extra virgin olive oil. Remove from the heat and add the sage leaves.  ", "When the gnocchi float to the surface, they are ready. Drain and toss them in the butter. Season to taste with salt and freshly ground black pepper. Sprinkle over the parmesan. ", "For the mackerel, heat a large non-stick frying pan and fry the prosciutto until crisp. Remove from the pan and set aside.  ", "Fry the mackerel fillets in the same pan, skin side down first. After 2-3 minutes turn over and cook the other side for a few minutes.", "Serve the gnocchi with the tomato salad and fried mackerel topped with the crispy ham. Drizzle over the juice from the tomato salad."]}, {"isVegetarian": false, "title": "Fried red mullet with oranges and capers", "url": "www_bbc_co_uk_food_recipes_fried_red_mullet_with_82300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_red_mullet_with_82300_16x9.jpg", "ingredients": ["8 small or 4 medium red mullet, scaled and gutted", "½ tsp salt", "freshly ground black pepper", "semolina, for dusting", "50ml/2fl oz olive oil", "2 small oranges; 1 zested and juiced, 1 thinly sliced into rounds", "1 tbsp capers", "1 tbsp pine nuts, toasted", "pinch chilli flakes", "small handful flatleaf parsley, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the red mullet with the salt and some pepper, and dust with semolina. ", "Heat the olive oil in a frying pan over a medium heat and fry the fish on both sides until golden-brown. Transfer to a plate and keep warm. ", "Deglaze the pan with the orange zest and juice, then add the orange slices, capers, pine nuts, chilli flakes and parsley to the pan and warm through. Pour over the fish and serve immediately."]}, {"isVegetarian": false, "title": "Fried scallops with chilli, sage and lemon, and Swiss chard", "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_25567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz Castelluccio lentils", "1½ garlic cloves, the whole clove peeled and half clove sliced ", "extra virgin olive oil for dressing", "500g/1lb 2oz Swiss chard leaves, stem and thick veins removed and leaves halved", "2 tbsp olive oil ", "1 tsp fennel seeds, crushed", "12 scallops (with roe), cleaned", "1 tsp small capers in vinegar, drained", "1 fresh red chilli, finely chopped", "12 sage leaves", "1 lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lentils in a pan with the whole garlic clove. Cover with water and bring to a simmer, then cook for 20–25 minutes until tender. Drain the lentils. Season and add a good dash of extra virgin olive oil, then cover and keep warm.", "Meanwhile, blanch the Swiss chard leaves in salted boiling water for about 3 minutes until tender. Drain well, squeezing out excess water. ", "Heat 1 tablespoon of the olive oil in a clean pan and fry the sliced garlic with the fennel seeds over a medium-high heat for 30 seconds. Add the drained Swiss chard and stir to combine. Season with salt and pepper, remove from the heat, cover and keep warm.", "Heat a heavy-based frying pan over a high heat. Toss the scallops in a bowl with salt, pepper and 1 tablespoon of olive oil. When the pan is very hot, carefully place the scallops in the pan and cook for 1 minute on each side until golden-brown and cooked through. Add the capers, chilli, sage leaves and a squeeze of lemon. Serve hot, with the lentils and Swiss chard."]}, {"isVegetarian": false, "title": "Fried scallops with caramel miso aubergine", "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_62665", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white miso", "150g/5½oz caster sugar", "vegetable oil, for deep frying", "2 aubergines, cut into 1-2cm/½-¾in cubes", "2 tbsp roughly chopped fresh coriander", "50g/1¾oz butter", "12 scallops, cleaned, roe removed", "100g/3½oz edamame beans", "1 tbsp white sesame seeds", "1 tbsp black sesame seeds", "1 tbsp coriander cress", "1 tbsp red amaranth cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the miso and sugar with 50ml/2fl oz of water in a saucepan, and bring to the boil. Simmer gently for 8-10 minutes, until it has thickened and darkened in colour. Decant the mixture into an airtight container such as a squeezy bottle fitted with a small nozzle lid. ", "Heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the diced aubergine, in batches if necessary, for 2-3 minutes, or until golden-brown and crisp. Remove from the oil using a slotted spoon, then set aside to drain on kitchen paper. Sprinkle over the chopped coriander and mix together. Repeat the process with the remaining aubergine.", "Heat the butter in a large frying pan over a medium to high heat. When the butter is foaming, add the scallops and fry on each side for 2-3 minutes, or until golden-brown and just cooked through. Add the edamame beans and continue to fry until warmed through. Mix the sesame seeds together.", "To serve, spoon the fried aubergine onto the serving plates, scatter over the edamame beans, then sprinkle the sesame seeds on top. Finish with the pan fried scallops and a drizzle of the miso sauce, then garnish with the mixed cress."]}, {"isVegetarian": true, "title": "Fried semolina-crusted aubergine with honey", "url": "www_bbc_co_uk_food_recipes_fried_semolina-crusted_09005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large aubergines ", "vegetable oil, for frying ", "200ml/7fl oz milk ", "6 tbsp semolina", "sea salt flakes, crushed", "75ml/2½fl oz  clear honey ", "Allepo pepper (pul biber) chilli flakes, to serve (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the aubergines and cut them into 3.5cm/1¼in thick discs. Then cut each slice roughly into pieces about 5cm/2in in diameter. Shape variation doesn’t matter and neither does size inconsistency – just make the pieces roughly around the same size so that they cook in the same time.", "Pour about 5cm/2in vegetable oil into a large, deep frying pan and heat the oil over a high heat. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Pour the milk into a small bowl.  Tip the semolina on to a small side plate and season it well with crushed salt.  Dip the aubergine pieces into the milk, then shake off any excess milk and immediately roll the pieces in the seasoned semolina.  ", "Cooking in batches, put the coated aubergine pieces into the hot oil and fry for approximately 1 minute on each side, or until golden brown and cooked through. Once cooked, transfer to a tray or plate lined with kitchen paper to soak up any excess oil. Repeat with subsequent batches.  ", "Serve with a good drizzle of clear honey and a sprinkling of chilli flakes, if using."]}, {"isVegetarian": false, "title": "Fried sole with ginger cream sauce and seasonal vegetables", "url": "www_bbc_co_uk_food_recipes_fried_sole_with_ginger_36957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "2 shallots, finely chopped", "50g/1¾oz fresh ginger, peeled and finely sliced", "200ml/7fl oz white wine", "200ml/7fl oz fish stock", "200ml/7fl oz double cream", " 2 lemon sole, skinned and filleted", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "2cm/1in piece fresh root ginger, peeled, cut into strips", "1 courgette, cut into strips", "1 red pepper, cut into strips", "100g/3½oz mangetout, cut into strips", "100g/3½oz fresh peas", "100g/3½oz broad beans, blanched", "2 tbsp chervil", "2cm/1in piece fresh root ginger, cut into strips"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish, heat a frying pan and add half of the butter and all the shallots and cook for a couple of minutes. Add the ginger and cook for a further couple of minutes.", "Add the white wine and cook until it is reduced in volume by half. Add the stock and reduce by half again and then add the cream. Strain through a fine sieve into another warm pan.", "Heat a large frying pan and add the remaining butter. Season the sole fillets with salt and pepper. Once hot add the seasoned fillets and cook either side for two minutes, then remove from the pan and allow to rest for a couple of minutes.", "For the seasonal vegetables, heat a large frying pan and add the butter. Once hot, add the courgette and cook for a minutes then add the pepper and mangetout and cook for 2-3 minutes. Add the peas and blanched broad beans and allow to cook for a further minute.", "To serve, place a pool of the sauce in the centre of a shallow bowl and some seasonal vegetables on top. Place the sole fillet on top and garnish with fresh chervil and fresh ginger."]}, {"isVegetarian": false, "title": "Fried turkey with bang bang sauce", "url": "www_bbc_co_uk_food_recipes_fried_turkey_with_bang_00594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey thighs, skinless, bone removed and cut into bite-size chunks ", "200ml/7fl oz buttermilk to marinate ", "pinch ground star anise ", "10 coriander seeds, crushed ", "vegetable oil, for deep-frying", "2 tsp baking powder ", "2 tsp cayenne pepper", "4 tsp paprika ", "250g/9oz plain flour ", "4 tsp crushed Sichuan peppercorns ", "2 tsp garlic powder", "1 tsp Chinese 5-spice ", "1 tsp salt", "1 tsp ground black pepper", "salt and freshly ground black pepper", "250g/9oz smooth peanut butter ", "4 tsp soy sauce", "6 tbsp vegetable oil ", "5 tbsp sesame oil", "5 tbsp sweet chilli sauce", "handful curry leaves ", "1 red chilli, thinly sliced", "1 green chillis, thinly sliced", "4 spring onions, thinly sliced ", "1 tbsp micro coriander ", "1 tbsp micro amaranth", "handful toasted peanuts, roughly chopped", "few bean sprouts ", "150g/5½oz pickled onion rings, thinly sliced", "1 tbsp black sesame seeds"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the fried turkey, place the buttermilk into a bowl with the star anise and coriander and mix to combine. Add the turkey, season with salt and pepper and coat well. Cover and marinate in the fridge overnight. ", "When you are ready to cook, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Mix the remaining turkey ingredients together in a bowl. Dip the turkey pieces into the mixture and deep-fry in batches for 6–8 minutes, until cooked through. Drain on kitchen paper and keep warm. ", "Deep-fry the curry leaves, drain on kitchen paper and set aside.", "To make the bang bang sauce, warm the peanut butter in a bowl set over a pan of simmering water until soft. Slowly stir in the remaining ingredients until you have a loose, spoonable sauce. ", "To serve, spoon a generous amount of the sauce on the bottom of a serving plate and pile the crisp turkey on top. Garnish with the fried curry leaves and remaining serving ingredients. Drizzle over some more of the sauce and serve. "]}, {"isVegetarian": true, "title": "Fried baby pineapple with mint and cream", "url": "www_bbc_co_uk_food_recipes_friedbabypineapplewi_89121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 baby pineapple, skin cut off, halved and sliced", "75ml/2½fl oz double cream", "1 sprig fresh mint", "1 lemon wedge, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a frying pan and lightly fry the pineapple slices on both sides for 3-4 minutes, or until they start to colour.", "Transfer the pineapple slices onto a servin g plate, spoon over the double cream and garnish with fresh mint and a wedge of lemon."]}, {"isVegetarian": true, "title": "Fried christophine with corn on the cob", "url": "www_bbc_co_uk_food_recipes_friedchristophinewit_89119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 christophine (also called chow chow), peeled, cored and sliced", "55g/2oz butter", "1 red scotch bonnet chilli, de-seeded (or to taste)", "1 orange scotch bonnet chilli, de-seeded (or to taste)", "1 corn on the cob"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Parboil the christophine slices in boiling water for 3-4 minutes, then drain.", "Melt half of the butter in a frying pan and fry the christophine and the whole scotch bonnet chillies for 4-5 minutes, turning the slices once, until the christophine is tender and golden-brown on both sides. ", "Microwave the corn for 4-5 minutes on high, then remove and fry in another frying pan with the remaining butter for 3-4 minutes, or until the corn is tender.", "To serve, pile the fried christophine and chillies onto a serving plate, and place the corn on the cob on the side."]}, {"isVegetarian": true, "title": "Fried edamame beans with chilli", "url": "www_bbc_co_uk_food_recipes_friededamamebeanswit_86248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5½oz edamame beans, in their pods", "pinch chilli flakes", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and add the beans, chilli flakes and garlic. Season with salt and freshly ground black pepper and sauté for 2-3 minutes, until the beans are tender.", "To serve, place into a serving bowl."]}, {"isVegetarian": false, "title": "Fried egg with pan-fried haggis and mash", "url": "www_bbc_co_uk_food_recipes_friedeggwithpanfried_82605", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 potato, peeled and diced", "½ haggis, sliced", "2 tbsp vegetable oil", "1 free-range egg"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and cook the potato for 8-10 minutes until tender. Drain the potato and mash it. ", "Heat half of the oil in a non-stick pan, spoon the potato mixture in and spread evenly. Season with salt and freshly ground black pepper and fry for 4-5 minutes on each side until golden brown.", "Fry the haggis slices in a separate pan for 3-4 minutes on each side until golden and cooked through. ", "Heat the rest of the oil in a small frying pan, crack the egg in and fry for a few minutes, or until set.", "To serve, arrange the potato cake on a serving plate, serve the cooked haggis on top and top with the fried egg."]}, {"isVegetarian": true, "title": "Fried green beans", "url": "www_bbc_co_uk_food_recipes_friedgreenbeans_80842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil ", "150g/5½oz green beans, finely sliced ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep frying pan and add the olive oil. Add the green beans and fry for five minutes, until cooked through and golden. Season with salt and freshly ground black pepper.", "Serve in a bowl as a side dish."]}, {"isVegetarian": false, "title": "Fried fish in oatmeal with tartare sauce", "url": "www_bbc_co_uk_food_recipes_friedfishinoatmealwi_91975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz mixed fish fillets (such as herring, smoked haddock, plaice, etc), any pin bones removed, cut into strips", "salt and freshly ground black pepper", "½ lemon, juice only", "2 free-range eggs, beaten", "200g/7oz pinhead oatmeal ", "sunflower oil, for frying ", "1 x 500g/1lb 2oz jar ready-made good quality mayonnaise", "2 tbsp chopped capers ", "2 tbsp chopped pickled cornichons or gherkins ", "2 tbsp chopped fresh parsley leaves", "2 tbsp chopped fresh dill", "½ lemon, juice only", "splash Tabasco sauce", "salt, to taste", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the fish strips with salt and freshly ground black pepper, and sprinkle over the lemon juice.", "Pour the beaten eggs into a bowl. Sprinkle the pinhead oatmeal onto a plate. ", "Brush each piece of fish all over with a little of the beaten egg using a pastry brush, then dredge in the oatmeal until completely covered. ", "Pour enough oil into a large frying pan to just cover the base of the pan. Heat the oil over a medium to high heat (CAUTION: hot oil can be dangerous. Do not leave unattended). When the oil is hot, add the prepared fish strips, in batches, and fry for 6-8 minutes, turning once, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper, keeping warm. Repeat the process with the remaining fish.", "Meanwhile, for the tartare sauce, in a bowl, mix together all of the tartare sauce ingredients until well combined. Set aside until ready to serve. (NB: this recipe will make more tartare sauce than is needed. Store the remaining sauce in an airtight jar in the fridge for up to a week.)", "To serve, divide spoonfuls of the tartare sauce equally among four small dipping bowls. Place one dipping bowl into the centre of each of four serving plates. Arrange the fish goujons around the dipping bowls. Sprinkle over salt, to taste, and garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Fried halloumi with courgette and bean salad", "url": "www_bbc_co_uk_food_recipes_friedhalloumiwithcou_78478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 courgette ", "1 handful red Peppadew peppers", "1 handful fresh coriander, chopped", "1 handful tinned mixed beans, rinsed and drained", "juice of ½ lemon", "3 tbsp olive oil", "salt and freshly ground black pepper", "tsp olive oil", "3 slices halloumi cheese"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a peeler, peel the courgette into thin 'ribbons' for the salad. Place into a bowl.", "Add the coriander, mixed beans, lemon juice and olive oil and toss well. Season to taste with salt and freshly ground black pepper.", "In a small frying pan with a little oil add the slices of halloumi and cook for 20 seconds on each side.", "Serve the courgette and bean salad on a plate and place the fried halloumi on top."]}, {"isVegetarian": false, "title": "Fried halibut steaks", "url": "www_bbc_co_uk_food_recipes_friedhalibutsteaks_83811", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz flour", "2 halibut steaks, about 2.5cm/1 inch thick", "juice of 1 lemon", "olive oil, for frying", "chopped parsley", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Scatter a think layer of flour onto a plate. Dip the halibut steaks into the lemon juice, then into the flour on both sides.", "Fry the fish until firm and cooked right through, about five minutes on each side.", "Serve hot scattered with parsley and served with large wedges of lemon."]}, {"isVegetarian": false, "title": "Fried noodles, prawns and char-grilled salad onions", "url": "www_bbc_co_uk_food_recipes_friednoodlesprawnsan_80162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "3 salad onions", "salt and freshly ground black pepper", "2 tbsp sesame oil", "1 garlic clove, chopped", "pinch dried chilli flakes", "2 salad onions, finely chopped", "2 baby aubergines, sliced", "1 handful spinach", "3 prawns, chopped", "150g/5½oz egg noodles, cooked according to packet instructions", "2 tbsp soy sauce", "1 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad onions, place the salad onions and olive oil into a bowl. Season, to taste, with salt and freshly ground black pepper and toss together.", "Heat a griddle pan until smoking. Add the salad onions and char-grill for two minutes on each side, so that brown griddle marks are formed. Remove from the heat and set aside.", "For the noodles, heat the sesame oil in a large wok over a high heat. Add the garlic, chilli, salad onions and aubergine and stir fry for one minute.", "Add the spinach and prawns and cook for a further two minutes, turning the prawns halfway through cooking.", "Add the noodles, drizzle over the soy sauce and toss together.", "To serve, place the noodles on a large warm plate and sprinkle with sesame seeds. Place the char-grilled salad onions criss-crossed on top."]}, {"isVegetarian": false, "title": "Fried herb-stuffed chicken with cabbage and chestnuts", "url": "www_bbc_co_uk_food_recipes_friedherbstuffedchic_92613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless chicken breasts, wing bone attached", "6 tbsp fresh chervil leaves", "6 tbsp flatleaf parsley, leaves only", "3 tbsp freshly grated parmesan cheese", "1 garlic clove", "1 tsp salt", "½ tsp black peppercorns", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "75g/3oz butter", "1 tbsp olive oil", "200ml/7fl oz red wine", "300ml/11fl oz chicken stock", "75g/3oz butter", "1 banana shallot, finely chopped", "1 garlic clove, finely diced", "4 rashers bacon, cut into lardons", "400g/14oz  pointed cabbage, finely shredded", "150g/5oz cooked chestnuts, roughly chopped", "200ml/7fl oz water", "4 sprigs fresh chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/325F/Gas 5.", "For the chicken, cut the meat around the end of the wing bone and push down towards the breast, exposing the bone. Taking great care, using the heel of the knife, cut off the small knuckle at the end of the bone to leave a clean straight bone. Carefully lift the skin away from the breast meat, starting at the end furthest away from the bone, but leaving it intact and still attached at the bone end.", "Place the chervil, flatleaf parsley, parmesan, garlic, salt and peppercorns into a pestle and mortar and pound to a paste. Add the extra virgin olive oil and pound once more to a smooth paste. Season, to taste, with salt and freshly ground black pepper.", "Spoon the herb mixture onto the chicken breasts, then smooth the skin back down to cover the herbs.", "Heat half the butter and the olive oil in an ovenproof frying pan, add the chicken breasts, skin-side down and fry for two minutes, until the skin is crisp and golden-brown then, turn over and cook for another minute. Transfer to the oven for 15 minutes, until the chicken is golden-brown and cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove and rest for five minutes.", "Heat a frying pan until hot, add the red wine and cook until the volume of the liquid has reduced by a third, then add the chicken stock and cook until the volume of the liquid has reduced by a half. Add any chicken juices from the rested chicken, season, to taste, with salt and freshly ground black pepper and add the remaining butter.", "For the cabbage, heat a deep-sided frying pan until hot, add half the butter, the shallot and garlic and sweat for 1-2 minutes. Add the bacon and cook for two minutes until just starting to crisp. Add the cabbage and chestnuts, sauté for 1 minute then add the rest of the butter and the water. Bring to a boil, turn down the heat and simmer gently for 4-5 minutes until the cabbage is tender and the sauce reduced slightly. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the cabbage into the centre of each plate, cut each chicken breast into three slices and place on top of the cabbage. Spoon the sauce around the edge and garnish with a sprig of chervil."]}, {"isVegetarian": false, "title": "Fried onion, chorizo and egg on toast", "url": "www_bbc_co_uk_food_recipes_friedonionchorizoand_84497", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, sliced", "150g/5½ oz chorizo, chopped", "small handful parsley, chopped", "salt and freshly ground black pepper", "2 slices ciabatta", "1 tbsp olive oil", "2 free-range eggs, fried"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan over a medium heat. Add the onion and chorizo and fry for four minutes, until the juices start to run from the chorizo. Stir in the parsley and season with freshly ground black pepper.", "Heat a griddle pan over a high heat. Drizzle the ciabatta with the olive oil and griddle on both sides for two minutes or until golden.", "To serve, place the griddled ciabatta on to a serving plate. Place the chorizo and onion onto top, and then top with the fried eggs."]}, {"isVegetarian": true, "title": "Frittata", "url": "www_bbc_co_uk_food_recipes_frittata_34910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for greasing", "100g/3½oz boiled potatoes, chilled and crushed", "2 fresh asparagus spears, trimmed, chopped", "1 spring onion, trimmed, chopped", "2 heaped tbsp frozen peas", "5 fresh mint leaves, torn", "2 tbsp grated parmesan", "2 free-range eggs, beaten", "pinch freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease an ovenproof dish with a little sunflower oil.", "In a bowl, mix together the asparagus, spring onion and peas. Stir in the mint leaves and parmesan until well combined.", "Tip the beaten eggs into the bowl and mix carefully. Season with freshly ground black pepper and mix again. ", "Spoon the frittata mixture into the prepared ovenproof dish. Place the dish onto a baking tray, then transfer to the oven and bake for 15-20 minutes, or until the eggs have completely set and a skewer inserted into the centre of the frittata comes out clean. ", "Serve with cherry tomatoes."]}, {"isVegetarian": false, "title": "Fried sea bass with poached leeks, pesto and tomato sauce", "url": "www_bbc_co_uk_food_recipes_friedseabasswithpoac_92839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh basil leaves", "2 tbsp pine nuts", "1 garlic clove, peeled", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp tomato purée", "100ml/3½fl oz chicken stock", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 sea bass fillet", "5 baby leeks", "300ml/½pint chicken stock", "25g/1oz butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, blend all the pesto ingredients in a food processor to a rough paste. Season, to taste, with salt and freshly ground black pepper.", "For the tomato sauce, heat the tomato purée in saucepan until it colours. Stir in the stock, bring the mixture to a simmer and continue to simmer until the mixture is well combined and has thickened. Season, to taste, with salt and freshly ground black pepper.", "For the sea bass, heat the olive oil in a frying pan over a medium heat. Fry the sea bass, skin-side down, for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper. Turn the sea bass fillet over and fry for a further 3-4 minutes, or until the skin is crisp and golden-brown and the fish is cooked through. Remove from the pan and set aside to rest on a serving plate.", "For the leeks, bring all the ingredients to the boil in a saucepan. Reduce the heat until the mixture is simmering and poach the leeks for 8-10 minutes, or until tender. Drain the leeks then season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the tomato sauce over the fried sea bass. Serve the poached leeks alongside with a dollop of pesto."]}, {"isVegetarian": false, "title": "Fritto misto with chilli-lime gremolata", "url": "www_bbc_co_uk_food_recipes_frito_misto_with_94137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "150g/5½oz rice flour", "150g/5½oz plain flour", "15g/½oz smoked paprika ", "400g/14oz prepared squid, cleaned", "400g/14oz prepared prawns, peeled and deveined ", "200g/7oz prepared mussels, scrubbed and debearded", "lemon wedges, to serve", "salt and freshly ground black pepper", "1 lime, zest only", "2 garlic cloves, crushed", "1 large green chilli, deseeded and finely chopped ", "½ bunch fresh flatleaf parsley, finely chopped", "200g/7oz bulgur wheat, cooked in stock ", "200g/7oz quinoa, cooked in stock", "100g/3½oz black lentils, cooked in stock", "55g/2oz soya beans, cooked in stock", "85g/3oz kale, stem removed and shredded", "25g/1oz sunflower seeds ", "1 tbsp garlic purée", "1 lime, juice only ", "2 tsp tahini", "25g/1oz spring onions, chopped ", "25g/1oz fresh flatleaf parsley, chopped", "100ml/3½fl oz cold-pressed rapeseed oil"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritto misto, preheat oil in a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "In a large bowl, combine the flours, paprika, salt and pepper on a plate. Toss the seafood in the flour mixture and drop carefully into the deep-fat fryer. Fry until golden then carefully remove using a slotted spoon and drain on kitchen paper. ", "For the gremolata, mix all the ingredients in a small bowl. ", "For the superfood salad, combine all of the ingredients in a large bowl. For the dressing, blitz all of the ingredients in a blender and stir thoroughly through the salad. ", "Serve the fritto misto with the lemon wedges, gremolata and salad alongside. "]}, {"isVegetarian": true, "title": "Potato and leek frittata", "url": "www_bbc_co_uk_food_recipes_frittata_79389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil", "¼ potato, sliced", "½ leek, chopped", "2 free-range eggs, beaten", "handful fresh basil leaves"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan. Add the potatoes and leeks sauté them for 4-5 minutes or until they are softened.", "Add the eggs and basil and gently stir around the pan until the eggs begin to set.", "Carefully turn the frittata over and cook for a further minute, or until cooked through.", "Transfer to a warmed plate and serve immediately."]}, {"isVegetarian": true, "title": "Omelette", "url": "www_bbc_co_uk_food_recipes_frittataomelette_84222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs", "1 tbsp whole milk", "1 tbsp double cream", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl mix together the eggs, milk and cream, then season with salt and freshly ground black pepper. ", "Heat the oil in a frying pan, and pour in the egg mixture.  After one minute, fold the omelette over from one side into the middle. Then fold the top edge over to the bottom. ", "To serve, immediately place the omelette onto a plate."]}]