[{"ingredients": ["1 kg / 2lb 4 oz de grosellas", "1 kg / 2lb 4oz de azúcar granulada"], "method": ["Lave, cubra y corte las grosellas espinosas, descartando las que estén dañadas. Coloque un platillo en el congelador.", "Coloque las grosellas espinosas y 150 ml / 5 fl oz de agua en una sartén grande o en una sartén de conservación. Llevar a ebullición y cocine a fuego lento durante unos 10 minutos hasta que la fruta se ablande.", "Agregue el azúcar y cocine a fuego lento hasta que el azúcar se haya disuelto.", "Aumente el fuego y hierva rápidamente durante 8-10 minutos antes de la prueba para ver si está preparado.", "Para comprobar si el atasco se ha establecido: saque el platillo del congelador y vierta una cucharada pequeña de mermelada. Deje que se enfríe durante un minuto y luego pase el dedo por el atasco, si está arrugado, está listo; si no, hierva por unos minutos más. Continúe probando hasta que el atasco esté listo. (Siempre retire el atasco del fuego mientras realiza la prueba para que, si está listo, no lo cocine en exceso).", "Mientras tanto, esterilice los frascos de mermelada: primero lave los frascos en agua jabonosa y enjuague con agua tibia y limpia. Deje que se sequen por goteo, al revés, en un estante en el horno a 140 ° C / 275 ° F / Gas 1. Déjelos allí durante al menos media hora mientras realiza el atasco.", "Una vez que el atasco esté listo, apague el fuego, quite la espuma y déjelo reposar de 15 a 20 minutos.", "Coloque la mermelada en recipientes esterilizados limpios y selle herméticamente con tapas de rosca mientras el atasco esté caliente."], "url": "www_bbc_co_uk_food_recipes_greengooseberryjam_6896", "title": "Mermelada de grosella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace tarros de 4-5 x 250 g / 9 oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greengooseberryjam_6896_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva", "4 cebollas en rodajas", "1 berenjena, rebanada por la mitad a lo largo y luego en semicírculos de 1 cm / ½ pulgada de espesor", "1 calabacín, en rodajas en rondas de 1cm / ½ pulgadas", "800 g / 1 libra de tomates 12½ oz (en la vid), cortado por la mitad", "1 x 400 g de frijoles flageolet, escurridos", "1 x 400 g de alubias de estaño, escurridas", "50g / 1¾oz de mantequilla", "1 zanahoria grande, cortada en cintas con un pelador de verduras o mandolina", "2 remolachas cocidas, cortadas en rondas de 1cm / ½ pulgadas", "6 ramitas de tomillo fresco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160 C / 140 ventilador / Gas 3.", "Caliente 3 cucharadas de aceite en una cazuela mediana, poco profunda y con tapa a fuego medio. Agregue las cebollas y fría por 4-5 minutos, o hasta que comiencen a dorarse.", "Agregue 500 ml / 18 fl oz de agua y lleve a ebullición, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine a fuego lento durante 20 minutos, o hasta que el agua casi se haya evaporado.", "Caliente otras 4 cucharadas de aceite en una sartén separada a fuego medio. Agregue las piezas de berenjena, en lotes si es necesario, y freír hasta que estén ligeramente coloreados en ambos lados, alrededor de 5-6 minutos (agregue más aceite a la sartén según sea necesario). Repita el proceso con las rondas de calabacín. Dejar de lado.", "Agregue las mitades de tomate a las cebollas guisadas, luego sazone bien con sal y pimienta negra recién molida, cubra la cacerola con la tapa y cocine durante 8-10 minutos, o hasta que esté bien cocida.", "Agregue el flageolet y las alubias a las cebollas y los tomates, luego añada los calabacines y las berenjenas.", "Derrita la mantequilla y la cucharada restante de aceite en una sartén a fuego medio. Agregue las cintas de zanahoria hasta que estén completamente cubiertas con la grasa, luego colóquelas en un enredo sobre la cazuela.", "Agregue las rodajas de remolacha a la sartén y cocine durante 4-5 minutos hasta que se ablanden. Arregle las rodajas de remolacha entre las zanahorias enredadas. Espolvorea sobre las hojas de tomillo.", "Hornee el caldo en el horno por 45-60 minutos, o hasta que los vegetales en la parte superior se hayan puesto crujientes y dorados, y la cacerola se haya espesado. Servir."], "url": "www_bbc_co_uk_food_recipes_greengrocers_hotpot_85436", "title": "El puchero de las verdulerías", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greengrocers_hotpot_85436_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos de gallinas camperas", "Crema doble 350ml / 12fl oz", "2 cucharadas de perejil y cebollín", "3 cebollas de primavera, muy finamente cortadas", "Parmesano 110 g / 4 oz, rallado", "sal marina escamada y pimienta negra recién molida", "5 tomates de ciruela maduros, sin semillas y toscamente picados", "1 cebolla roja pequeña, muy finamente picada", "2 cucharaditas de pasta de tomate secada al sol", "1 cucharada de perejil fresco de hojas planas", "1 cucharada de albahaca fresca, aproximadamente desgarrada", "1 cucharada de jugo de lima", "3 cucharadas de aceite de oliva virgen extra", "sal marina escamada y pimienta negra recién molida"], "method": ["Haz las frittatas. Precalentar el horno a 180C / 350F / Gas 4.", "Batir los huevos con la crema y mucha sal y pimienta negra recién molida. Agregue las hierbas, las cebolletas, el parmesano y luego vuelva a mezclar.", "Engrase un molde con mantequilla y vierta la mezcla. No llene demasiado la bandeja, ya que la mezcla de huevo se dore un poco. Cocine por 20-25 minutos cuando las frittatas estén firmes.", "Enfríe las frittatas en una rejilla para enfriar mientras cocina los lotes restantes.", "Hacer la salsa Coloque todos los ingredientes en un recipiente para mezclar, sazone bien y mezcle bien para combinar.", "Sirve las frittatas con salsa de tomate grueso."], "url": "www_bbc_co_uk_food_recipes_greenherbfrittataswi_70350", "title": "Frittatas de hierbas verdes con salsa de tomate grueso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 lb de petit pois o guisantes congelados, descongelados y escurridos", "½ cebolla roja, finamente picada", "1 diente de ajo, finamente picado", "1 manojo pequeño de hojas de menta fresca", "115g / 4oz de yogurt natural", "½ chile rojo, sin semillas, finamente picado", "1 cucharadita de comino molido", "½ cucharadita de cilantro molido", "1 lima, solo jugo", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "1 bolso grande confeccionado nachos"], "method": ["Coloque las hojas de guisantes, cebolla, ajo y menta en un procesador de alimentos y mezcle hasta obtener un puré espeso.", "Agregue el yogur y mezcle de nuevo, dejando la mezcla ligeramente grumosa.", "Transfiera la mezcla a un recipiente y agregue el chile, el comino, el cilantro y el jugo de lima y sazone al gusto con sal y pimienta negra recién molida.", "Vierta la cuchara en un recipiente para servir y rocíe con aceite de oliva. Servir con un tazón de nachos al lado para mojar."], "url": "www_bbc_co_uk_food_recipes_greenpeadipwithnacho_84337", "title": "Dip de guisantes verdes con nachos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greenpeadipwithnacho_84337_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½ fl oz crema doble", "2 huevos de gallinas camperas, separados", "Queso cheddar 100 g / 3½ oz, rallado", "sal y pimienta negra recién molida", "½ pimiento verde, cortado longitudinalmente, sin semillas"], "method": ["Coloque una bandeja de horno plana en el horno y precaliente el horno a 200C / 400F / Gas 6.", "Vierta la crema doble en una cacerola a fuego alto. Llevar a ebullición, luego retirar del fuego de inmediato y dejar enfriar durante un minuto.", "Coloque las claras de huevo en un bol y mezcle hasta que se formen picos fuertes.", "Coloque las yemas de huevo y el queso rallado en un recipiente aparte. Batir y sazonar bien con sal y pimienta negra recién molida.", "Vierta la crema caliente sobre las yemas de huevo y el queso y mezcle bien.", "Coloque un poco de las claras de huevo en la mezcla de yema y mezcle bien.", "Agregue el resto de la clara de huevo y dóblela suavemente con una cuchara de metal, teniendo cuidado de mantener el volumen.", "Coloque la mezcla de soufflé en la mitad de pimiento, colóquela en la bandeja para hornear caliente y colóquela en el horno para hornear durante 8 minutos, hasta que el soufflé se haya levantado y esté dorado.", "Para servir, coloca el pimiento en el centro de un pequeño plato caliente."], "url": "www_bbc_co_uk_food_recipes_greenpeppercheesesou_81142", "title": "Soufflé de pimiento verde y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["130ml / 4fl oz de caldo de verduras calientes", "60g / 2¼ oz de cuscús gigante de trigo integral", "Brócoli de tallo largo de 130 g / 4½ oz", "Frijoles verdes finos de 180g / 6oz, recortados", "150g / 5½ oz de col rizada", "1 cucharada de aceite de oliva", "½ granada, solo semillas, para servir", "Tahini 25g / 1oz", "2 cucharadas de jugo de limón", "1 cucharadita de copos de sal marina", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Vierta el caldo en una cacerola y lleve a ebullición.", "Incline el cuscús y el caldo caliente en una lata pequeña para asar y cubra con brócoli, frijoles y col rizada. Rocíe el aceite, cubra con papel de cocina y hornee por 25 minutos.", "Mientras tanto, para preparar el aderezo de tahini, bata el tahini y el jugo de limón con una cucharada de agua en un tazón pequeño. Agregue la sal y una buena pizca de pimienta negra.", "Sirva el horno en dos platos, rocíe sobre el aderezo y esparza sobre las semillas de granada."], "url": "www_bbc_co_uk_food_recipes_greens_with_giant_28962", "title": "Verdes con cuscús gigante y tahini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greens_with_giant_28962_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "3 cucharadas de pasta de curry verde tailandés", "125ml / 4fl oz de leche de coco", "½ lima, solo jugo", "1 cucharada de nam pla (salsa de pescado)", "1 cucharada de hojas de cilantro picado", "500g / 1lb 2oz de pescado firme, como el salmón, cortado en cuadrados de tamaño mediano", "8 x 1cm / ½ en rebanadas de piña madura, pelada y cortada en cuadrados", "24 hojas de albahaca o albahaca tailandesa", "aceite, para la parrilla", "225g / 8oz de fideos de arroz secos", "2 cucharadas de aceite de maní (maní)", "Chalotes 50g / 2oz, finamente picados", "4 cebolletas, finamente cortadas en diagonal", "3 chiles rojos frescos (o verdes si quieres un plato más caliente), sin semillas y cortados en tiras finas", "3 cucharadas de ajo picado grueso", "3 cucharadas de salsa de pescado o salsa de soja ligera", "1 cucharada de vino de arroz Shaoxing o jerez seco", "1 cucharada de jugo de lima", "1 cucharada de salsa de soja ligera", "pimienta negra recién molida, al gusto", "1 cucharada de azúcar", "2 cucharadas de salsa de ostras vegetariana", "puñado de ramitas de cilantro fresco", "3 cucharadas de cacahuetes asados ​​toscamente picados, para adornar"], "method": ["Para los kebabs, caliente un wok a fuego alto.", "Vierta el aceite y caliente hasta que fume.", "Agregue la pasta de curry verde y cocine, revolviendo, durante un minuto.", "Agregue la leche de coco y deje que hierva. Cocine hasta que espese ligeramente.", "Retirar del fuego y enfriar por completo, luego agregar jugo de lima, nam pla y cilantro picado.", "Agregue el pescado a la mezcla y mezcle bien. Guay.", "Transfiera a una bolsa de plástico sellada y refrigere durante una hora.", "Remoje ocho pequeños pinchos de madera en agua.", "Ensarta los trozos de pescado en los pinchos, alternando con los cuadrados de piña y las hojas de albahaca.", "Frote una sartén con un poco de aceite, luego caliente sobre una llama alta o una barbacoa.", "Cocine los kebabs durante unos dos minutos en cada lado o hasta que el pescado esté cocido a su gusto.", "Al asar a la parrilla, cepille los pinchos con algo del adobo y sazone con sal (si es necesario) antes de servir.", "Para los cojines de fideos tailandeses, remoje los fideos de arroz en un recipiente con agua caliente durante 25 minutos (o según las instrucciones del paquete).", "Cuando los fideos estén suaves (pero aún al dente), escurra bien en un colador o colador. Descarta el agua", "Calentar un wok a fuego alto. Cuando esté caliente, agregue el aceite. Cuando esté muy caliente y ligeramente humeante, agregue los chalotes, las cebolletas, los chiles y el ajo, y saltee durante un minuto.", "Agregue los fideos de arroz, la salsa de pescado o la salsa de soja, el vino de arroz o jerez, el jugo de lima, la salsa de soja, la pimienta, el azúcar y la salsa vegetariana de ostras, y continúe revolviendo durante dos minutos, mezclándolos bien.", "Agregue el cilantro y saltee enérgicamente por 30 segundos.", "Gire a un plato caliente, espolvoree con los cacahuetes y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_greenthaikebabsandpa_74817", "title": "Brochetas tailandesas verdes y tallarines tailandeses", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 calabaza o calabaza (alrededor de 400 g / 1 libra), cortada en rondas de 2 cm / 1 in", "120ml / 4fl de leche en oz", "1 limón, solo jugo", "4 huevos de gallinas camperas", "300g / 10½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear", "aceite vegetal, para engrasar", "6 cucharadas de yogur al estilo griego", "4 cucharaditas de canela molida", "jarabe de arce, para lloviznar"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Coloque la calabaza o la calabaza en una bandeja grande para asar y tápelos durante 30-45 minutos, hasta que estén blandos. Retirar del horno y reservar para enfriar.", "Mientras tanto, vierta la leche en un vaso y agregue el jugo de limón. Dejar de lado para agriar durante 15 minutos.", "Cuando la calabaza esté lo suficientemente fría como para manipularla, quite la piel, coloque la carne en un procesador de alimentos y pulse hasta que quede suave. Incline en un tazón grande y bata los huevos y la leche agria hasta que estén completamente combinados. Doble la harina y el polvo de hornear.", "Engrase ligeramente una sartén de plancha, asegurándose de engrasar todas las ranuras y colocar a fuego alto. Cuando esté caliente, agregue 1-2 cucharadas de la mezcla en la sartén e inmediatamente baje la temperatura. Empuja la mezcla a los bordes con una espátula. Cocine durante 3-4 minutos, o hasta que la parte superior haya comenzado a asentarse, luego voltee la galleta con una espátula en cada lado y cocine por 3-4 minutos más. Deslice sobre un plato y manténgalo caliente mientras hace más gofres para terminar la mezcla. La mezcla debería hacer 2-3 más, dependiendo del tamaño de la sartén de la plancha.", "Cuando estén cocidos, corte cada waffle en 2-4 piezas, dependiendo de su tamaño, y divídalo entre platos. Coloque una cucharada de yogur en cada una, espolvoree canela, rocíe abundantemente con sirope de arce y sirva."], "url": "www_bbc_co_uk_food_recipes_griddle_pan_pumpkin_16498", "title": "Gofres de pan de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddle_pan_pumpkin_16498_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, más un poco para freír", "Harina normal 225g / 8oz", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "1 cucharada de azúcar en polvo", "2 huevos de gallinas camperas, separados", "200ml / 7fl de leche en oz", "150ml / 5fl oz de suero de leche", "1 cucharadita de extracto de vainilla (opcional)"], "method": ["Derrita la mantequilla en el microondas o en una cacerola a fuego lento y deje que se enfríe un poco.", "Tamiza la harina, el polvo de hornear y la sal en un tazón grande y agrega el azúcar.", "Batir las claras de huevo en un recipiente de vidrio grande y limpio hasta que se formen picos fuertes.", "Caliente la leche hasta que esté tibia en una cacerola mediana a fuego lento. Agregue el suero de leche, la mantequilla derretida, las yemas de huevo y el extracto de vainilla, si está usando, y mezcle hasta que se combinen. Poco a poco, verter la mezcla en la harina, batiendo todo el tiempo (detener tan pronto como se combina, de lo contrario se volverá difícil). Doble suavemente las claras de huevo. Deja a temperatura ambiente durante 30 minutos.", "Caliente una sartén a fuego medio-alto. Agregue un poco de mantequilla y extienda por la plancha con papel de cocina. Agregue 3 cucharadas de masa, para formar una forma redonda y áspera y cocine durante 5-6 minutos. Dé la vuelta y cocine por otros 5-6 minutos. Sirve con jarabe de arce, tocino y / o huevos como lo desees."], "url": "www_bbc_co_uk_food_recipes_griddle_pan_waffles_62298", "title": "Gofres de Cheat", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddle_pan_waffles_62298_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de vinagre de estragón", "50ml / 2fl oz de vino blanco", "1 cucharadita de granos de pimienta blanca", "1 chalote de plátano pequeño, finamente cortado en cubos", "4 huevos, solo yemas", "200g / 7oz de mantequilla, derretida", "2-3 cucharadas de estragón, hojas recogidas y picadas", "¼ limón, solo jugo", "Filetes de solomillo de 4 x 200 g / 7oz", "1 cucharada de aceite de oliva", "4 papas grandes para cortar, cortadas en bastones de 1cm x 7.5cm / ½in x 3in", "aceite vegetal, para freír"], "method": ["Para la salsa bearnesa, coloca el vinagre, el vino blanco, los granos de pimienta y la chalota en una cacerola pequeña y lleva a ebullición.", "Cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Cuele la salsa a través de un colador fino en un recipiente de tamaño mediano y permita que se enfríe un poco.", "Agregue las yemas de huevo a la reducción de vinagre y bate bien.", "Coloque el recipiente sobre una olla sobre agua hirviendo (no permita que el fondo del recipiente toque el agua) y bata constantemente hasta que espese y tenga un color claro.", "Poco a poco agregue la mantequilla derretida, batiendo constantemente.", "Sazonar con sal y pimienta negra y agregar las hojas picadas de estragón. Agregue jugo de limón, al gusto.", "Apague el fuego y deje el recipiente sobre la sartén hasta que esté listo para usar.", "Para las papas fritas, caliente una freidora a 160C / 325F. Alternativamente, caliente el aceite vegetal en una sartén honda de fondo profundo y profundo, hasta que la miga de pan se cocine suavemente y gradualmente se ponga dorada. (PRECAUCIÓN: el aceite caliente es peligroso. No lo deje sin supervisión).", "Coloque con cuidado los bastones de patata en la freidora de grasa en lotes y fríe durante 3-4 minutos, o hasta que estén tiernos pero no coloreados.", "Retire las papas fritas de la freidora en su cesta, luego aumente el calor de la freidora a 190C / 375F (si usa una sartén, caliente el aceite hasta que la miga de pan chisporrotee y se ponga dorada cuando la deje caer) y devuelva las papas al freír y cocinar por 2-3 minutos hasta que estén doradas y crujientes.", "Retire las papas fritas de la freidora y escurra sobre papel de cocina y sazone con sal y un poco de pimienta negra.", "Para los filetes, caliente una sartén hasta que esté caliente.", "Rocíe el aceite sobre los filetes y frote bien para cubrir. Sazone con sal y pimienta negra, luego cocine en la plancha durante 2-3 minutos por cada lado.", "Retire los filetes de la plancha y descanse durante tres minutos antes de servir.", "Para servir, coloque los filetes en cuatro platos para servir, amontone las papas fritas y termine con una cucharada de salsa bearnesa."], "url": "www_bbc_co_uk_food_recipes_griddled_fillet_steak_86566", "title": "Filete de solomillo con papas fritas y salsa bearnesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pato de campo abierto de 400 g / 14 oz, peladas, cortadas en rodajas de 3 mm en un ángulo de 45 grados", "2 cucharadas de aceite de colza, para freír", "1 cucharadita de comino molido", "1 cucharadita de semillas de hinojo", "1 cucharadita de hojuelas de chile seco", "½ cucharadita de cúrcuma molida", "½ cucharadita de sal marina", "½ cucharadita de pimienta negra molida", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharadas de salsa de soja ligera baja en sodio", "3 cucharadas de aceite de maní", "Harina normal de 725 g / 1 lb 10 oz", "150g / 5½oz de harina de pan fuerte", "½ cucharadita de sal", "400ml / 14fl oz de agua hirviendo", "3 cucharadas de aceite de colza, más extra para freír", "1 cucharada de aceite de sésamo", "½ cucharadita de pimienta blanca molida", "½ cucharadita de pimienta negra molida", "1½ cucharadita de sal marina molida", "4 cebolletas, finamente picadas", "3 cucharadas de salsa hoisin, en un pequeño recipiente hondo", "½ lechuga iceberg, rallada", "3 cucharadas de salsa de chile sriracha caliente", "3 cucharadas de salsa de chile dulce mezclado con 2 cucharadas de mayonesa", "½ pepino, cortado en tiras finas, vestido con vinagre de arroz, mirin, sal y azúcar"], "method": ["Mezcle los ingredientes del marinado en un tazón y luego agregue el pato. Usando sus manos, cubra el pato en el adobo. Cubra con film transparente y refrigere durante 20 minutos. Remoje 12 pinchos de bambú de madera en agua fría.", "Mientras tanto, haz los panqueques. En un tazón grande, mezcle 600g / 1lb de harina de 5 oz con toda la harina de pan fuerte y la sal. Agregue el agua hirviendo y mezcle en una masa. Agregue 150ml / 5fl oz de agua fría y amasar en una masa suave. Dejar de lado.", "Caliente el aceite de colza y el sésamo en una olla pequeña y agregue la pimienta blanca, pimienta negra y sal. Retire del fuego.", "Estirar la masa en un círculo plano y extender el aceite sazonado sobre él, teniendo cuidado de no extenderlo hasta los bordes. Esparce las cebolletas en la masa, luego esparce la harina común restante sobre la parte superior.", "Corta la masa en ocho secciones, dejando cada sección a 2 cm del centro. Tome una sección y doble hacia el centro del círculo, luego repita con las secciones restantes. Despliegue nuevamente y repita el plegado circular. (Esto crea capas elásticas elásticas en el panqueque).", "Estirar la masa de nuevo en un rectángulo y luego enrollar en forma de rodillo suizo largo; debe ser de unos 10 cm / 4 pulgadas de ancho. Divida en seis pedazos y divida cada pieza en dos. Aplane cada pieza con su palma y use sus manos o un rodillo para estirar la masa en un círculo. Deberías terminar con 12 panqueques pequeños.", "Caliente un wok o sartén a fuego medio. Agregue una cucharada de aceite de colza y agítelo por los costados de la sartén (alternativamente puede cepillar los panqueques con aceite de colza a cada lado para asegurar una cocción pareja). Agregue de dos a tres panqueques y cocine hasta que estén dorados, volteando a la mitad. Repita hasta que todos los panqueques estén cocidos. Cubra con papel de aluminio y mantenga caliente en el horno hasta que esté listo para servir.", "Para cocinar los pinchos, caliente una sartén a fuego alto. Agregue 2 cucharadas de aceite de colza al pato y mezcle a través de la carne. Ensarte la carne en los pinchos de bambú, dividiéndola por igual entre los pinchos.", "Justo antes de agregar los pinchos a la sartén, frote un poco más de aceite sobre ellos. Cocine por 1 minuto, luego cuando ya no se peguen a la parrilla, dé vuelta y cocine por un minuto más. Transferir a un tablero.", "Para servir, coloque los panqueques, los pinchos y todos los acompañamientos en una tabla de servir para que la gente pueda armar los panqueques. Unte la salsa hoisin en un panqueque, cubra con lechuga, luego el pato, la mayonesa de chile dulce, la sriracha y finalmente el pepino."], "url": "www_bbc_co_uk_food_recipes_griddled_duck_skewers_on_30452", "title": "Brochetas de pato molidas en panqueques de jian bing cebolla de primavera", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cabeza de acelga, tallos cortados en 1cm / ½ en rebanadas, hojas partidas por la mitad", "4 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente cortado", "1 apio en barra, finamente picado", "1 zanahoria, pelada y finamente picada", "1 x 400g / 14oz de tomates picados en lata", "1 x 400 g / 14 oz de garbanzos de lata, escurridos", "1 pimiento rojo asado a la parrilla, sin piel ni semillas, cortado en tiras", "8 chuletas de cordero", "1 cucharadita de romero finamente picado", "sal marina y pimienta negra recién molida", "1 chile rojo, finamente picado", "2 cucharadas de perejil fresco de hojas planas finamente picado"], "method": ["Corta los tallos de la acelga y pásalos bruscamente. Blanquee los tallos y las hojas en agua hirviendo durante aproximadamente cuatro minutos. Desagüe.", "Caliente una cucharada de aceite de oliva en una sartén grande, agregue la cebolla, el ajo, el apio y la zanahoria y cocine suavemente durante 15-20 minutos hasta que estén tiernos. Agregue los tomates enlatados, los garbanzos y la pimienta y cocine durante 10 minutos o hasta que espese. Agregue la acelga y cocine por otros 10 minutos.", "Coloque las chuletas de cordero en un tablero pesado, cubra con película adhesiva y golpee suavemente las chuletas de cordero de manera uniforme con un rodillo o mazo de carne.", "Cuando las chuletas tengan aproximadamente 1 cm / ½ pulgada de espesor, quite la película adhesiva. Frote las chuletas de cordero con una cucharada de aceite de oliva para que queden cubiertas, luego agregue el romero, la sal marina y la pimienta negra.", "En una sartén muy caliente, cocine las chuletas de cordero con un minuto de cada lado para obtener un cordero jugoso y medio raro.", "Termine cortando un chile rojo fresco con un puñado de perejil picado, coloque en un tazón pequeño con las dos cucharadas restantes de aceite de oliva. Rocíe esta mezcla sobre el cordero y sirva con el inzimino al lado."], "url": "www_bbc_co_uk_food_recipes_griddled_lamb_chops_with_00803", "title": "Chuletas de cordero molidas con inzimino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddled_lamb_chops_with_00803_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de trigo bulgur", "700ml / 1¼ pintas de caldo de pollo, calentado", "2 chiles secos chipotle", "1 cucharadita de semillas de fenogreco", "1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "2 dientes de ajo, picados", "2 chalotes, toscamente picados", "2 chiles rojos, sin semillas, picados", "2 cucharadas de aceite de oliva o aceite de colza", "200g / 7oz de piñones tostados", "1 semillas de granada", "½ manojo de menta fresca, toscamente picada", "½ grupo de cilantro fresco, toscamente picado", "1 limón, ralladura y jugo", "sal y pimienta negra recién molida", "8 chuletas de cordero", "½ manojo de romero, atado con una cuerda", "50ml / 2fl oz de aceite de oliva"], "method": ["Para el trigo bulgur, coloca el trigo bulgur en una cacerola y cúbrelo con caldo de pollo tibio. Cocine a fuego lento durante 15-20 minutos, o hasta que esté cocido.", "Escurrir el trigo bulgur, dejar enfriar y agregar a un tazón grande.", "Remoje los chiles secos con chipotle en agua caliente durante cinco minutos hasta que estén suaves, retire y agregue a un procesador de alimentos.", "Caliente una sartén pequeña y caliente la alholva, el comino y las semillas de cilantro hasta que comiencen a desprender un olor fuerte, luego añádalos al procesador de alimentos.", "Agregue el ajo, los chalotes, los chiles y el aceite al procesador de alimentos y mezcle hasta que quede suave. Agregue un par de cucharadas de la mezcla al trigo bulgur y revuelva.", "Agregue los piñones, la granada, la menta, el cilantro, el jugo de limón y la ralladura y termine con sal y pimienta y un poco de aceite de oliva. Dejar de lado.", "Para las chuletas de cordero a la parrilla, calentar una sartén grande e incorporar el romero en el aceite de oliva. Cepille las chuletas con el romero empapado en aceite. Condimentar con sal y pimienta.", "Cocine las chuletas por un par de minutos a cada lado y continúe cepillándolas con el romero y el aceite.", "Para servir, coloca la tabulé en el centro de cada uno de los cuatro platos y apoya las chuletas de cordero contra la tabulé."], "url": "www_bbc_co_uk_food_recipes_griddled_lamb_chops_with_62964", "title": "Chuletas de cordero molidas con piñones y tabbouleh de granada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pimientos rojos", "2 cucharadas de aceite de oliva", "½ pan pan ciabatta, cortado en piezas de 3cm / 1in", "4 tomates maduros en vides, descuartizados", "Almendras blanqueadas de 45 g / 1½ oz", "2 dientes de ajo, pelados, finamente picados", "4 cucharadas de aceite de oliva", "1-2 cucharadas de vinagre de vino tinto", "2 cucharadas de albahaca fresca finamente picada", "1 cucharadita de pimentón ahumado", "1 cucharadita de pimienta de cayena, o al gusto", "4 filetes de atún", "4 cucharadas de aceite de oliva", "1 limón, ralladura y jugo", "2 cucharadas de perejil fresco de flatleaf recién picado"], "method": ["Para la ensalada romesco, precaliente el horno a 200C / 400F / Gas 6.", "Coloque los pimientos en una bandeja para hornear y tápelos durante 30-35 minutos, o hasta que los pimientos estén ennegrecidos.", "Retire del horno y colóquelo en una bolsa de sándwich de plástico. Dejar de lado para hervir durante cinco minutos.", "Caliente el aceite en una sartén y cocine el ciabatta durante 2-3 minutos, volteándolo con frecuencia o hasta que esté crujiente por todos lados.", "Con cuidado pele los pimientos para quitar toda la piel. Coloque los pimientos, la chapata, los tomates, las almendras y el ajo en un tazón grande y déjelos a un lado.", "Para el aderezo, mezcle el aceite de oliva, el vinagre, la albahaca, el pimentón ahumado y la pimienta de cayena en un tazón pequeño.", "Para el atún a la plancha con limón y perejil, coloque los filetes de atún en un tazón mediano con el aceite de oliva, la ralladura de limón y el jugo y el perejil.", "Calentar una sartén a la plancha, agregar los filetes de atún y freír en cada lado durante 2-3 minutos, o hasta que se cocinen a su gusto.", "Para servir, vierta el aderezo sobre la ensalada romesco y revuelva hasta que esté bien combinado. Coloque la ensalada en cada uno de los cuatro platos y sirva el atún al lado."], "url": "www_bbc_co_uk_food_recipes_griddled_lemon_and_68481", "title": "Atún relleno de limón y perejil con ensalada romesco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas de cerdo", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "1½ limas, solo jugo", "2 dientes de ajo, aplastados", "1 cucharada de galangal finamente rallado", "1 cucharada de jengibre fresco de raíz finamente rallado", "3 cucharadas de salsa de pescado tailandesa", "2 chiles verdes de ojo de pájaro, finamente picados", "2 cucharadas de azúcar de palma", "4 cucharadas de cacahuetes salados tostados", "gran manojo de albahaca santa, hojas recogidas", "3 cucharadas de hojas de menta ralladas", "1 repollo rojo, finamente cortado"], "method": ["Para las chuletas de cerdo, precaliente el horno a 220C / 450F / Gas 7.", "Calentar una sartén hasta que esté caliente y el aceite y sazonar las chuletas de cerdo con sal y pimienta negra recién molida.", "Coloque las chuletas de cerdo en la sartén de la plancha y cocine a ambos lados hasta que aparezcan las marcas de la barra.", "Transfiera al horno para cocinar por 3-7 minutos (hasta que esté cocido) - el tiempo dependerá del grosor del corte.", "Para la col lombarda tailandesa, coloque todos los ingredientes, excepto la col, en un almirez y mortero y machaque para hacer una pasta gruesa.", "Coloque la col roja en rodajas en un tazón grande e incline la pasta sobre el repollo. Ligeramente mezcla.", "Para servir, divida la col entre cuatro platos y apoye la carne de cerdo contra ella."], "url": "www_bbc_co_uk_food_recipes_griddled_pork_chop_with_18559", "title": "Chuleta de cerdo rellena con repollo rojo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de mantequilla sin sal", "½ pan de brioche, roto en migas", "2 dientes de ajo, finamente picados", "4 cucharadas de perejil de flatleaf tostado", "4 filetes de solomillo", "2 cucharadas de aceite de oliva", "8 tomates de ciruela, cortados por la mitad", "2 cucharadas de aceite de oliva", "4 cabezas de lechuga Little Gem", "2 aguacates, pelados, piedra removida, rebanada", "30g / 1oz de aderezo francés", "30g / 1 oz de miel", "30g / 1oz de vinagre balsámico blanco", "500ml / 18fl oz de aceite vegetal", "5g de chalote finamente picado", "½ diente de ajo, en rodajas", "1 cucharadita de albahaca picada", "1 cucharadita de hojas de tomillo picadas", "1 cucharadita de cebollines picados", "1 cucharadita de perejil picado"], "method": ["Para el solomillo, caliente una sartén grande y agregue la mantequilla. Una vez derretido, agregue las migas de brioche y el ajo y cocine por un par de minutos o hasta que las migas estén doradas y el ajo cocinado.", "Transfiera a un procesador de alimentos y agregue el perejil. Mezcle hasta que las migas sean de color verde brillante.", "Mientras tanto, caliente una sartén grande y frote la carne con aceite de oliva. Coloque en la plancha y cocine en ambos lados durante 2-3 minutos, o hasta que esté cocido a su gusto. Reserve para descansar antes de servir.", "Para los tomates y la ensalada verde, precaliente la parrilla a altura.", "Coloque los tomates partidos por la mitad en una bandeja de parrilla y rocíe con aceite. Poner debajo de la parrilla por un par de minutos o hasta que esté cocido.", "Una vez cocinado, retíralo de la parrilla y espolvorea sobre algunas de las migajas verdes.", "Para la preparación de la casa, agregue todos los ingredientes a una licuadora y pulse hasta que quede suave.", "Para hacer la ensalada, coloque la lechuga y el aguacate en un tazón grande. Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle.", "Para servir, corte los filetes descansados ​​y colóquelos en los platos junto a los tomates migajados y la ensalada verde. Espolvoree las migas restantes sobre los filetes."], "url": "www_bbc_co_uk_food_recipes_griddled_sirloin_steak_67760", "title": "Solomillo de lomo con brioche, migas de ajo y perejil, tomates a la plancha y ensalada verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de cuscús", "150ml / 5fl oz de caldo de verduras frescas", "1 pimiento rojo, amarillo y verde, sin corazón, sin semillas, cortado en rodajas de 2cm / ¾ en rodajas", "1 cebolla roja grande, cortada en cuñas", "1 calabacín, cortado en gruesas rondas", "aceite de oliva en aerosol", "250g / 9oz bloque halloumi", "sal marina y pimienta negra recién molida", "2 cucharadas de vinagre de vino tinto", "1 cucharadita de ajo en polvo", "½ cucharadita de hierbas secas de Provenza", "½ cucharadita de mezcla de hierbas italianas secas", "1 cucharadita de edulcorante granulado", "1 cucharadita de copos de sal marina", "1 cucharada de harina de maíz, mezclada en una pasta con 1 cucharada de agua", "2 cucharadas de hojas de perejil de flatleaf finamente picadas", "hojas de albahaca y menta", "1 guindilla roja, semillas retiradas, cortadas en ángulo"], "method": ["Ponga el cuscús en un tazón pequeño, agregue una pizca de sal y pimienta y vierta sobre el caldo de verduras calientes. Revuelva bien, cubra con una película adhesiva y déjela a un lado.", "Para el aderezo de hierbas, ponga 200 ml / 7 fl oz de agua, el vinagre de vino, ajo en polvo, hierbas secas, edulcorante y sal en una olla pequeña y llevar a fuego lento. Quite el fuego, mezcle la pasta de harina de maíz, luego vuelva al fuego y cocine por 1-2 minutos, o hasta que espese un poco. Vierta en una jarra y deje que se enfríe, luego agregue el perejil picado.", "Coloque todas las verduras en un tazón grande y sazone con sal y pimienta. Caliente una sartén grande a fuego alto, luego rocíe con aproximadamente 20 atomizadores de aceite. Coloque alrededor de la mitad de las verduras en la sartén, teniendo cuidado de no sobrecargarlas, y rocíelas con otros 20 aerosoles de aceite.", "Cocine por 4-5 minutos en cada lado, hasta que se suavicen y con algunas líneas, luego retírelo a un plato. Repita con las verduras restantes.", "Corta el halloumi por la mitad a lo largo y luego corta cada mitad en 6 rebanadas. Rocíe la sartén de la plancha nuevamente con aceite y coloque las rebanadas de halloumi en la sartén. Cocine a fuego alto durante 6 minutos por cada lado.", "Pelusa el cuscús con un tenedor y cuchara en un plato grande. Cubra con las verduras asadas y el halloumi, luego raspe la albahaca y las hojas de menta y espolvoree sobre la guindilla, si la está usando. Rocíe 6 cucharadas de aderezo de hierbas sobre todo y sirva."], "url": "www_bbc_co_uk_food_recipes_griddled_veg_and_43152", "title": "Verduras grilladas y halloumi con cuscús", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 como principal, 6 como lado", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddled_veg_and_43152_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "3 cebollas rojas, finamente cortadas", "2 dientes de ajo, aplastados", "Arroz de paella 400 g / 14 oz, como calasparra", "1 cucharadita de cúrcuma molida", "1 cucharadita de pimentón ahumado", "800 ml / 1 pinta 7fl oz de caldo de verduras calientes", "1 cucharadita de romero fresco finamente picado", "200g / 7oz de tomates cherry", "150g / 5½oz de guisantes frescos", "125ml / 4fl oz de aceite de oliva virgen extra de buena calidad, preferiblemente español", "1 cucharada de perejil fresco picado, para servir", "1 x 400 g / 14 oz puede alcachofa corazones en agua, escurridos y enjuagados"], "method": ["En una sartén, caliente una cucharada de aceite vegetal a fuego medio. Agregue las cebollas y el ajo y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue la paella de arroz, la cúrcuma molida y el pimentón ahumado y revuelva bien para cubrir las verduras en las especias.", "Agregue el caldo caliente y el romero picado y lleve la mezcla a ebullición, revolviendo bien. Reduzca el fuego a fuego lento y cocine a fuego lento la mezcla, revolviendo ocasionalmente, durante 18-20 minutos, o hasta que la paella de arroz haya absorbido la mayor parte del líquido.", "Agregue los tomates cherry y los guisantes y continúe cocinando a fuego lento por otros 4-5 minutos, o hasta que el arroz esté tierno.", "Retire la sartén del fuego y rocíe sobre el aceite de oliva, luego revuelva hasta que esté bien combinado. Agregue el perejil picado.", "Mientras tanto, caliente una sartén a fuego medio. Frote las alcachofas drenadas por todas partes en las tres cucharadas restantes de aceite vegetal. Cuando la sartén esté caliente, agregue los corazones y la plancha de alcachofa engrasados ​​durante 1-2 minutos por cada lado, o hasta que aparezcan marcas doradas a ambos lados (NB: No revuelva los corazones de alcachofa mientras los plancha).", "Para servir, coloque la paella en el centro de cuatro platos para servir. Coloque algunas de las alcachofas a la parrilla encima de cada porción."], "url": "www_bbc_co_uk_food_recipes_griddledartichokeand_91479", "title": "Alcachofa grillada y paella de cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/griddledartichokeand_91479_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["16 lanzas de espárragos, extremos leñosos recortados", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "125g / 4½oz de mantequilla, derretida", "2 cucharaditas de jugo de limón recién exprimido", "2 cucharaditas de vinagre de vino blanco", "2 yemas de huevo grandes de gallinas camperas", "3 cucharadas de perifollo fresco picado", "4 huevos de pato de gallinas camperas"], "method": ["Ponga a hervir una sartén de agua con sal, agregue las lanzas de espárragos y blanquee durante 1-2 minutos.", "Escurra bien, devuelva las lanzas de espárragos a la sartén, quite el fuego y rocíe sobre el aceite de oliva. Agite la sartén para cubrir las lanzas de espárragos, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, caliente una sartén a fuego medio a alto. Cuando la sartén esté humeando, agregue los espárragos y la plancha escaldados y sazonados durante 3-4 minutos, o hasta que estén tiernos.", "Agregue la mantequilla a la sartén y, cuando haga espuma, agite la sartén para cubrir las lanzas de espárragos en la mantequilla.", "En una sartén no reactiva, calienta el jugo de limón y el vinagre de vino blanco hasta que hierva.", "Coloque las yemas de huevo y una pizca de sal en un procesador de alimentos. Ajuste el motor para que funcione lentamente, luego agregue gradualmente la mezcla caliente de limón y vinagre a las yemas de huevo en una corriente delgada, hasta que toda la mezcla se haya incorporado a las yemas de huevo.", "Con el motor todavía en funcionamiento, agregue gradualmente la mantequilla derretida a la mezcla en una corriente delgada, hasta que esté completamente incorporada.", "Agregue el perifollo a la salsa holandesa y sazone, al gusto, con sal y pimienta negra recién molida. Poner a un lado y mantener caliente (cubra la mezcla para evitar que se forme una piel en la superficie).", "Llevar una olla pequeña de agua a fuego lento.", "Mezcle el agua hirviendo a fuego lento para crear un vórtice, luego cuidadosamente rompa dos de los huevos de pato en el agua. Cueza durante 2-3 minutos, o hasta que los huevos estén cocidos a su gusto, luego retírelos cuidadosamente de la sartén con una espumadera y déjelos a un costado para escurrirlos sobre papel de cocina.", "Repita el proceso con los otros dos huevos de pato.", "Para servir, divida las lanzas de espárragos por igual entre cuatro platos para servir. Coloque un huevo escalfado encima de cada porción de espárragos. Rocíe sobre la salsa holandesa perifollo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_griddledasparaguswit_91431", "title": "Espárragos cuajados con huevo pato escalfado y salsa holandesa perifollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 berenjenas, cortadas en trozos o trozos", "aceite vegetal, para cepillar cuando se hierve", "1 lima, solo jugo", "sal", "10 chiles rojos pequeños, sin tallos", "5 dientes de ajo", "5 limones, solo jugo", "5 cucharadas de vinagre de vino de arroz", "5 cucharadas de agua", "1 cucharada de semillas de comino", "100 ml / 3½ fl oz oz yogur"], "method": ["Coloque las berenjenas en un recipiente, agregue un poco de aceite y el jugo de lima y sazone con mucha sal. Mezcle bien para asegurar un recubrimiento uniforme del aceite.", "Caliente una sartén hasta que fume. Agregue las berenjenas y el carbón por lotes, volteándolas una vez, hasta que estén cocidas y marcadas con líneas de la plancha. Retire cada lote de la sartén y manténgalo caliente.", "Para el nuoc cham, coloque los chiles y el ajo en un procesador de alimentos y mezcle hasta formar una pasta. Agregue el jugo de limón, el vinagre de vino de arroz y el agua, y mezcle nuevamente hasta que esté suave.", "Para el yogur de comino, fría las semillas de comino en una sartén caliente, hasta que se vuelva marrón oscuro y fragante, luego triture el comino con un mortero.", "Coloque el yogur en un tazón para servir y agregue el comino triturado.", "Para servir, acomode las berenjenas en seis platos. Ponga un poco de aderezo nuoc cham sobre cada plato de berenjenas y cubra con una cucharada de yogur de comino."], "url": "www_bbc_co_uk_food_recipes_griddledauberginesal_84602", "title": "Ensalada de berenjena cuajada con nuoc cham", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]