[{"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 huevos de gallinas camperas", "pizca de sal", "2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "8 tomates cherry, cortados a la mitad", "5 anchoas en conserva, escurridas y picadas", "100ml / 3½fl oz de vino blanco", "1 puñado de hojas de espinaca bebé", "pimienta negra recién molida", "4 hojas de albahaca fresca"], "method": ["Para la pasta, coloque todos los ingredientes de la pasta en un procesador de alimentos y pulse hasta que la mezcla se una para formar una masa. Incline sobre una superficie de trabajo enharinada y apelmace ligeramente, luego extiéndala muy finamente (use una máquina de pasta si la tiene) y córtela en tiras con una rueda para cortar pasta.", "Cocine la pasta en agua hirviendo durante 1-2 minutos, o hasta que esté cocida, pero aún al dente, luego drene y reserve.", "Para la salsa, caliente el aceite de oliva en una sartén y fría la cebolla por 2-3 minutos, luego agregue los tomates, las anchoas y el vino. Cocine a fuego lento durante 3-4 minutos, o hasta que se reduzca un poco, luego agregue la espinaca para que se marchite.", "Agregue la pasta cocida a la salsa, mezcle bien para cubrir, sazone con pimienta negra y decore con las hojas frescas de albahaca."], "url": "www_bbc_co_uk_food_recipes_freshparpadellepasta_90722", "title": "Pasta fresca de pappardelle con espinacas, anchoas y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de 700g / 1½lb '00', más extra para quitar el polvo", "10 huevos medianos de granja", "sémola, para quitar el polvo (opcional)"], "method": ["Vierta la harina en un montículo sobre una superficie plana y haga un pozo en el centro. Agriete los huevos en el pozo y gradualmente mezcle con un cuchillo sin filo o con sus manos. Cuando la masa se haya convertido en una pasta espesa, utiliza tus manos para incorporar más harina.", "Puedes tamizar la harina restante y utilizar la harina tamizada mientras amasas la masa para evitar que se pegue a la superficie y a tus manos, pero ten cuidado de no secar demasiado la masa. Amasar hasta que esté bien mezclado y la masa sea suave y flexible. No te preocupes si no has agotado toda la harina.", "Deje reposar la pasta durante aproximadamente 20 minutos con un recipiente invertido sobre ella o déjela tapada con una película adhesiva. Puedes tamizar cualquier resto de harina y guardar esta harina para extender la pasta.", "Divida la pasta por la mitad antes de extenderla para evitar que se seque. Envuelve la mitad que no estás usando en una película adhesiva.", "Comience aplanando la masa con la palma de su mano, luego saque la pasta con un rodillo de madera pesado (también se puede usar una máquina de pasta).", "Espolvorea la superficie, la pasta y el rodillo con harina para evitar que se pegue. Cuando la masa es lo suficientemente delgada como para pasar los dedos a través de ella, está lista para ser cortada en la forma de pasta que elija.", "Cuando corte, separe en trozos individuales y mezcle con sémola seca o un poco más de harina para evitar que la pasta se pegue a sí misma. Déjelo en una bandeja enharinada y cocínelo en una hora. Repita para usar la masa restante.", "Cocine en agua hirviendo con sal durante 3-5 minutos, dependiendo del grosor de las hebras o formas."], "url": "www_bbc_co_uk_food_recipes_freshpasta_82374", "title": "Pasta fresca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 140g / 5oz o harina italiana '00'", "2 huevos medianos, 1 entero y 1 yema (preferiblemente orgánica)"], "method": ["Coloque la harina en un procesador de alimentos y pulse. Agregue el huevo entero y la yema de huevo y siga batiendo hasta que la mezcla se asemeje a pan rallado fino (no debe ser polvoriento ni debe ser una bola grande y pegajosa). Esto toma 2-3 minutos.", "Incline la masa y amasar para formar una bola. Amasarlo enérgicamente durante 1 minuto, debe ser bastante rígido y difícil de amasar. Envuelva la película adhesiva y déjela reposar en un lugar fresco durante 1 hora antes de usarla.", "Ahora corta la masa en 2 pedazos. Para cada pieza, aplánela con un rodillo de aproximadamente 5 mm / ¼ in de grosor. Dobla la masa y pásala por la máquina de pasta en su posición más ancha, doblándola y enrollándola 7 veces (sin cambiar la configuración) hasta que tengas una forma rectangular de 7.5x18cm / 3x7 in. Es importante trabajar la masa hasta que esté bien y brillante, ya que esto le da la textura \"al dente\". Repita con la segunda pieza de masa.", "Ahora estás listo para lanzar. Comience con la máquina de pasta en su configuración más amplia, pase la masa a través de los rodillos. No doble, pero repita este proceso, disminuyendo la configuración del rodillo grado por grado con cada pase. Para la mayoría de los usos, llevo la pasta al último ajuste, especialmente para los ravioles, ya que está intercalando dos capas juntas cuando está doblada. Use de inmediato para hacer los raviolis."], "url": "www_bbc_co_uk_food_recipes_freshpastadough_3067", "title": "Masa de pasta fresca", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshpastadough_3067_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 huevos de gallinas camperas", "2 cucharaditas de aceite de oliva virgen extra, más extra para lloviznar", "3 cucharadas de aceite de oliva", "1 diente de ajo ahumado, picado", "1 chile verde, finamente picado", "puñado de perejil fresco y cebollino", "30g / 1oz de mantequilla", "150 g / 5½ oz de champiñones silvestres, limpios y en rodajas", "1 diente de ajo ahumado, finamente picado", "1 cucharada de perejil picado, para adornar"], "method": ["Para la pasta, coloque la harina en un procesador de alimentos y agriete los huevos uno a la vez con el motor en marcha hasta que la mezcla se asemeje a migas de pan finas.", "Agregue el aceite de oliva y mezcle durante unos segundos. Dar la vuelta a una superficie enharinada y amasar durante cinco minutos. Lo ideal sería envolver en una película adhesiva y dejar reposar a temperatura ambiente durante 30 minutos. Si no tiene tiempo, es posible usarlo de inmediato.", "Trabaje la pasta a través de una máquina de pasta de acuerdo con las instrucciones de la máquina hasta que esté lo más delgada posible. Cortar en tiras ya sea a mano o con la máquina de pasta y colgar para secar durante dos minutos.", "Ponga a hervir una olla grande de agua con sal, vierta la pasta y cocine durante dos minutos. Escurrir bien y mezclar con aceite de oliva virgen extra.", "Para la salsa, caliente el aceite de oliva en una sartén, agregue el ajo y el chile y saltee durante 1-2 minutos.", "Transfiera la mezcla a una licuadora. Agregue el perejil y el cebollín y mezcle hasta que quede suave.", "Para los champiñones, caliente la mantequilla en una sartén, agregue los champiñones y el ajo y cocine suavemente durante 2-3 minutos hasta que estén blandos.", "Para servir, mezcle la pasta con la salsa de chile, la cuchara en un recipiente para servir y esparza los champiñones. Adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_freshpastawithchilli_87147", "title": "Pasta fresca con chile, ajo ahumado y setas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para servir", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "100g / 3½oz de guisantes frescos", "200ml / 7fl oz de caldo de verduras", "2 cucharadas de menta fresca picada"], "method": ["Caliente el aceite y la mantequilla en una sartén y fría la cebolla y el ajo hasta que estén suaves pero no coloreados.", "Agregue los guisantes y el caldo y lleve a fuego lento. Cocine hasta que los guisantes estén tiernos, alrededor de 5-8 minutos.", "Retire del fuego. Agregue la menta fresca y mezcle hasta que quede suave con una batidora de mano. Servir en un bol adornado con una llovizna de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_freshpeaandmintsoup_88416", "title": "Sopa de guisantes y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para lloviznar", "½ cebolla, finamente picada", "1 diente de ajo, picado", "85g / 3oz de guisantes frescos, envasadas", "2 grandes puñados de espinaca baby", "300ml / ½ litro de caldo de verduras calientes", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas"], "method": ["Calentar el aceite de oliva en una cacerola, agregar la cebolla y freír suavemente hasta que esté suave pero no coloreado. Agregue el ajo y fría por un minuto.", "Agregue los guisantes, la espinaca y el caldo caliente y deje que hierva. Reduzca el fuego y cocine a fuego lento durante ocho minutos, o hasta que los guisantes estén tiernos. Sazonar con sal y pimienta negra recién molida y licuar con una batidora manual hasta que quede suave.", "Para servir, vierta en un recipiente y decore con cebolletas frescas picadas y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_freshpeaandspinachso_88584", "title": "Sopa de guisantes y espinacas con ciboulette", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de ciruelas rojas, partidas a la mitad y apedreadas", "Azúcar en polvo 180g / 6oz", "120ml / 4fl oz de vinagre de sidra", "1 ramita de canela", "Anís de 2 estrellas"], "method": ["Pon todos los ingredientes en una sartén y calienta suavemente hasta que el azúcar se disuelva. Llevar a ebullición y cocine a fuego lento durante unos 20-30 minutos hasta que las ciruelas estén tiernas y el líquido esté almibarado. Enfriar y mantener en la nevera.", "Sirve con quesos o jamón."], "url": "www_bbc_co_uk_food_recipes_freshplumchutney_1320", "title": "Chutney de ciruela fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace una jarra", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshplumchutney_1320_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "2 cebollas de primavera, picadas", "2 dientes de ajo picados", "150g / 5½oz de marisco fresco mezclado", "pellizque el azafrán, empapado en 1 cucharada de agua", "150 g / 5½ oz de pasta fresca, como el linguini, cocinado de acuerdo con las instrucciones del paquete", "1 cucharada de parmesano recién rallado"], "method": ["Caliente el aceite de oliva y la mantequilla en una sartén, agregue las cebolletas y cocine suavemente durante 2-3 minutos.", "Agregue el ajo y fría por otro minuto. Agregue los mariscos y el azafrán, junto con su líquido de remojo, y cocine por 2-3 minutos. Agregue la pasta cocida caliente y mezcle bien para cubrir.", "Para servir, coloque la pasta de mariscos en platos para servir y espolvoree sobre el parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_freshseafoodpasta_85131", "title": "Pasta de mariscos frescos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Harina normal de 75 g / 2½ oz", "pizca de sal", "150ml / 5¼fl oz de agua", "50 g / 1¾oz de mantequilla sin sal", "2 huevos grandes de gallinas camperas, golpeados", "4 yemas de huevo de gallinas camperas", "60g / 2¼fl oz de azúcar en polvo", "2 cucharadas de harina de maíz", "Harina normal de 25g / 1oz", "280ml / 10 fl oz de leche", "100 g / 3½ oz de chocolate negro, al menos un 70 por ciento de sólidos de cacao", "150ml / 5¼fl oz de crema batida"], "method": ["Precaliente el horno a 200C / 390F / Gas 6 y engrase una bandeja grande para hornear con mantequilla. Tamiza la harina y la sal dos veces.", "Ponga el agua y la mantequilla en una olla, caliéntela gradualmente hasta que la mantequilla se derrita y luego aumente la temperatura. Tan pronto como el agua hierva enérgicamente, baje el fuego otra vez e incline toda la harina. Batir rápidamente hasta que la mezcla forme una bola y deje los lados de la sartén limpios.", "Retire la sartén del fuego y enfríe un poco. Agregue los huevos, uno a la vez, batiendo con fuerza hasta que la mezcla esté brillante y firme.", "Con una cuchara, coloque 20 bolas iguales de la mezcla sobre la bandeja de horno con mantequilla (alternativamente, puede verter la masa en la bandeja para obtener un acabado más limpio).", "Hornee en el horno durante 20-25 minutos, o hasta que estén dorados e hinchados. Transfiera a una rejilla para enfriar.", "Para la crème patissière, mezcle las yemas de huevo y el azúcar en un bol hasta que estén pálidos y claros. Dobla la harina de maíz y la harina.", "Llevar la leche a ebullición en una cacerola pequeña y luego batirla gradualmente en la mezcla de huevo.", "Vierta la mezcla en una sartén limpia y déjela hervir lentamente hasta que se espese. Cocine a fuego lento por un minuto y luego tome la sartén del fuego.", "Cubra con película adhesiva para evitar que se forme una piel.", "Cuando los profiteroles estén fríos, corte cada uno por la mitad con un cuchillo afilado. Rellena con la crème patissière.", "Para la salsa de chocolate caliente, caliente el chocolate y la crema en un tazón resistente al calor colocado sobre una fuente de agua hirviendo hasta que se derrita, no permita que el agua toque el fondo del tazón. Revuelve para combinar.", "Sirva la salsa de chocolate tibia rociada sobre los profiteroles llenos."], "url": "www_bbc_co_uk_food_recipes_freshprofiterolesfil_91165", "title": "Profiteroles frescos rellenos de crème pâtissière y servidos con salsa de chocolate caliente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 100 g / 3½ oz", "1 huevo de gallinas camperas", "pizca de sal", "1 cucharada de aceite de oliva", "½ cebolla, picada", "2 dientes de ajo, finamente picados", "200g / 7oz de tomates frescos picados", "puñado de albahaca fresca, picada", "sal y pimienta negra recién molida"], "method": ["Para hacer los espaguetis, mezcle la harina con el huevo y la sal en una licuadora hasta que se combinen.", "Convierta la masa en una superficie enharinada y amase durante un minuto.", "Envuelva la masa en una película adhesiva y descanse en la nevera durante cinco minutos.", "Pase la masa por una máquina de pasta de acuerdo con las instrucciones del fabricante hasta que esté muy delgada.", "Haga rodar la masa a través de la configuración de espagueti en la máquina de pasta y coloque los espaguetis frescos a un lado hasta que esté listo para cocinar.", "Para hacer la salsa, caliente el aceite en una sartén. Agregue la cebolla y el ajo y cocínelos hasta que estén suaves, pero no dorados.", "Agregue los tomates y cocine hasta que se descompongan.", "Cocine la pasta en una olla grande de agua hirviendo con sal durante 30 segundos, antes de drenar bien.", "Mezcle la albahaca a través de la salsa de tomate y sazone al gusto con sal y pimienta negra recién molida.", "Sirve la pasta en un tazón con la salsa encima."], "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithto_84970", "title": "Espagueti fresco con tomate y salsa de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 huevos de gallinas camperas", "pizca de sal", "1 cucharada de aceite", "½ cebolla, finamente picada", "2 lonchas de tocino rayado, picadas", "200g / 7oz de setas silvestres mezcladas, en rodajas", "1 diente de ajo, finamente picado", "150ml / ¼ de pinta de vino blanco", "3 cucharadas de crema doble", "sal y pimienta negra recién molida"], "method": ["Para la pasta, coloque la harina, los huevos y la sal en un procesador de alimentos y mezcle hasta que la mezcla se una como masa.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar hasta que quede suave. Envuelva la película adhesiva y déjela reposar en la nevera durante una hora, si el tiempo lo permite.", "Alimente la pasta a través de una máquina de pasta, comenzando con la configuración más espesa y trabajando hasta la configuración más delgada. Cortar en espagueti delgado con el cortador de pasta en la máquina.", "Para el ragù, caliente el aceite en una sartén y agregue la cebolla y el tocino. Freír suavemente hasta que esté suave, luego agregar los champiñones y el ajo y mezclar bien.", "Agregue el vino y cocine a fuego lento hasta que se reduzca a la mitad.", "Agregue la crema y sazone, al gusto, con sal y pimienta negra recién molida.", "Cocine los espaguetis en agua hirviendo con sal durante 2-3 minutos, luego escurra y mezcle con el champiñón ragù.", "Para servir, divide los espaguetis entre dos tazones para servir."], "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithwi_87692", "title": "Espagueti fresco con ragú de setas silvestres", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de espagueti fresco", "pizca de aceite de oliva", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "2 pimientos rojos asados, picados", "Aceitunas Kalamata 100g / 3½ oz, picadas y picadas", "1 cucharada de ketchup de tomate", "dash salsa Tabasco"], "method": ["Coloque los espaguetis en una olla grande de agua salada hirviendo con una pizca de aceite de oliva. Cocine según las instrucciones del paquete. Una vez cocido, escurra la pasta en un colador y mezcle con un poco más de aceite de oliva.", "Para el ragu, caliente el aceite en una olla pequeña. Agregue la cebolla y cocine suavemente durante tres minutos hasta que las cebollas se hayan suavizado.", "Agregue el ajo a las cebollas y cocine por un minuto.", "Agregue los pimientos rojos, las aceitunas, el ketchup y la salsa de Tabasco al ragu y cocínelos durante cinco minutos.", "Coloque los espaguetis calientes en la sartén con los ragu y mezcle bien. Para servir, ponga la mezcla en un bol limpio."], "url": "www_bbc_co_uk_food_recipes_freshspaghettiwithri_84620", "title": "Espagueti fresco con aceitunas negras ricas y ragú de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 huevos muy grandes de gallinas camperas", "Una pizca de sal marina", "2 cucharadas de aceite de oliva", "2 dientes de ajo, finamente picados", "1 x 400 g / 14 oz pueden tomates cherry", "½ cucharadita de hojuelas de chile seco", "sal y pimienta negra recién molida", "75g / 2¾oz de queso Wensleydale con arándanos", "albahaca fresca pequeña, desgarrada", "2 cucharadas de perejil de flatleaf fresco picado", "5 hojas de albahaca fresca, rotas"], "method": ["Para la pasta, combine la harina, los huevos y la sal en un procesador de alimentos, agregue más harina si es necesario o una gota de agua si la mezcla está demasiado seca. Pulse hasta que la mezcla se una como una masa. Poner en una superficie enharinada y amasar hasta que quede suave y elástica.", "Cortar la bola de masa por la mitad y alimentar a la mitad a través de una máquina de pasta. Repita esto 5-6 veces, disminuyendo el espesor de la pasta en cada etapa. Repita con la otra mitad de la masa de pasta.", "Coloque las hojas de pasta sobre una cuchara de madera o en el respaldo de una silla y déjelas secar durante unos cinco minutos. Mientras tanto, coloque el accesorio cortador de tallarines en su máquina de pasta.", "Alimenta las sábanas a través de la máquina de pasta, recogiendo las tiras a medida que salen y formando 'nidos' sueltos sobre una superficie enharinada.", "Para la salsa de tomate, caliente el aceite de oliva en una sartén y fría el ajo por un minuto.", "Agregue los tomates y las hojuelas de chile, sazone con sal y pimienta negra recién molida y cocine durante 8-10 minutos, hasta que la salsa se reduzca ligeramente. Mezcle en el queso y mezcle hasta que se derrita. Agregue la albahaca y el perejil.", "Cocine la pasta en una olla grande de agua hirviendo con sal durante unos dos minutos, o hasta que esté al dente. Drene y vuelva a la sartén, luego agregue la salsa.", "Sirva la pasta en tazones poco profundos, adornado con albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_freshtagliatellewith_88208", "title": "Tallarines frescos con tomate cherry y salsa de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "2 huevos de gallinas camperas", "pizca de sal", "2 cucharadas de aceite de oliva", "½ pimiento rojo, picado", "85g / 3oz de guisantes frescos", "¼ de bulbo de hinojo, en rodajas", "75ml / 2½fl oz de vino blanco", "1 pequeño puñado de hojas frescas de perejil", "1 cucharada de aceite de oliva"], "method": ["Para los tallarines, coloque la harina, los huevos y la sal en un procesador de alimentos y pulse hasta que estén bien combinados. Amasar en una superficie de trabajo enharinada para unir la masa, luego enrollar a través de una máquina de pasta varias veces, comenzando desde el ajuste más grueso hasta el más delgado, hasta que quede suave y elástico. Cortar los tallarines de la masa de la pasta, utilizando el accesorio de la máquina correspondiente, o cortar en tiras.", "Cocine la pasta en agua hirviendo con sal durante 2-3 minutos, o hasta que esté al dente. Escurrir y apartar.", "Para la salsa, caliente el aceite de oliva en una cacerola y fría ligeramente el pimiento rojo y los guisantes durante 4-5 minutos. Agregue el hinojo en rodajas y el vino blanco, reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que la salsa se haya espesado un poco.", "Para servir, mezcle el aceite de oliva y las hojas de perejil en un tazón pequeño. Revuelva el tagliatelle cocido en la salsa y apile en un plato de servir. Rocíe el aceite de perejil y sirva."], "url": "www_bbc_co_uk_food_recipes_freshtagliatellewith_89018", "title": "Tallarines frescos con hinojo, pimientos asados ​​y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb2oz de tomates maduros con sabor completo (como Sungold o Gardener's Delight)", "2 cucharadas de aceite de oliva virgen extra", "1 chalote medio o cebolla roja pequeña, finamente picada", "un chorrito de limón o 1 cucharada de vinagre de vino blanco", "sal y pimienta negra molida", "chapata", "ajo", "aceite de oliva", "aceitunas negras", "anchoas", "hojas frescas de albahaca"], "method": ["Vierta agua hirviendo sobre los tomates y quítelos después de 30 segundos. Pelarlos con un cuchillo afilado y cortar en cuartos, sacar las semillas con una uña.", "Te quedan carne de tomate sin piel, sin semillas y deliciosamente dulce. Esto se puede dejar en cuartos (para una versión gruesa, salady) o más finamente picado (si se tiende hacia la salsa). De cualquier manera, mezcle con los ingredientes restantes y está listo para servir.", "Para las variaciones de bruschetta, asa a la parrilla rebanadas de pan ciabatta o pugliese, frote con ajo y rocíe con aceite de oliva. Mezcle la salsa de tomate (versión gruesa) con unas pocas aceitunas negras picadas y / o un par de anchoas picadas y / o unas hojas de albahaca frescas rotas. Apila el pan y sirve como entrante, ya sea solo o con otros antipasti."], "url": "www_bbc_co_uk_food_recipes_freshtomatosalsawith_8881", "title": "Salsa de tomate fresco (con variaciones de bruschetta)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/freshtomatosalsawith_8881_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ baguette pequeño francés", "1 diente de ajo, reducido a la mitad", "400g / 14oz de setas silvestres mezcladas (cordero, rebozuelo y trompeta de la muerte)", "30 g / 1½ oz de mantequilla sin sal", "½ chalote de plátano o ¼ de cebolla, pelado, picado", "1 diente de ajo, pelado, puré", "100 ml / 3½ fl oz de vino blanco seco", "4 pizca de sal marina", "4 pizca de pimienta negra recién molida", "10g / ½ oz de hojas de perejil fresco de flatleaf, más o menos picadas", "1 ramita de estragón fresco, solo hojas, finamente picado", "2 ramitas de perifollo fresco, finamente picado", "1 cucharada de jugo de limón", "Tomates 200g / 7oz, descuartizados, semillas recogidas, finamente picadas"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Para los crotones, corte la baguette en rebanadas de 3 mm de espesor y coloque en una capa uniforme en una bandeja para hornear. Tueste en el horno por 2-3 minutos en ambos lados, o hasta que esté dorado y crujiente. Frote cada rebanada de pan tostado con los lados cortados del diente de ajo. Dejar de lado.", "Para los champiñones, cepille ligeramente los champiñones para eliminar cualquier suciedad o barro restante. Lave brevemente los champiñones en un recipiente grande con agua fresca (por no más de 10-15 segundos), luego retírelos y colóquelos en una toalla de té limpia. Seque suavemente, luego corte la base de los tallos y deséchela.", "Calentar la mantequilla en una sartén a fuego medio hasta que haga espuma, luego agregar los chalotes y el ajo y freír durante 30 segundos. Aumente el fuego a alto, luego agregue los hongos de pied de mouton y cocine por un minuto. Agregue el vino blanco y cocine por un minuto, o hasta que el líquido se haya reducido un poco, luego agregue los girolles. Cocine por un minuto más antes de agregar la trompette de la mort, hierbas, jugo de limón y tomates. Revuelva bien. Agregue un chorrito de agua si la mezcla se está secando demasiado, luego sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloca los champiñones en tazones para servir y desmenuza los crotones."], "url": "www_bbc_co_uk_food_recipes_fricasseeofwildmushr_93489", "title": "Fricassée de setas silvestres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cabezas de hinojo, descuartizado", "1 cucharada de aceite de oliva, más extra para mezclar", "2 dientes de ajo, pelados", "1 limón, solo jugo", "1 cucharada de semillas de hinojo, tostadas", "Yogur griego de 300 g / 10½oz de espesor", "Pan rallado de 250 g / 9 oz", "Pecorino 50 g / 2 oz, rallado", "1 cucharadita de hojuelas de chile", "sal y pimienta negra recién molida", "4 berenjenas, cortadas en rondas de 2 cm / 1 in", "3 huevos de gallinas camperas, golpeados", "Harina normal de 100 g / 3½ oz", "aceite vegetal, para freír", "berros, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el yogur de hinojo, caliente el aceite en una cacerola a prueba de horno a fuego medio. Agregue el ajo y el hinojo y fría por 4-5 minutos, o hasta que estén dorados y ligeramente suavizados.", "Agregue el jugo de limón a la mezcla, revuelva bien, luego cubra y transfiera al horno. Asar durante 15-20 minutos, o hasta que el hinojo esté tierno. Dejar de lado para enfriar.", "Para las patatas fritas de berenjena, mezcle las migas de pan, percorino, hojuelas de chile, sal y pimienta en un recipiente poco profundo.", "Coloque la harina en un plato poco profundo y batir los huevos en un recipiente poco profundo.", "Enrolla las varitas de berenjena en la harina, luego sumérgelas en el huevo y finalmente cúbrelas con la mezcla de pan rallado.", "Caliente el aceite en una freidora a 150C / 300F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Transfiera los palitos de berenjena cubiertos al aceite caliente para freír durante unos seis minutos, o hasta que estén dorados.", "Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Combine el hinojo asado, el ajo asado y los jugos de tostación con las semillas de hinojo en una licuadora. Es posible que necesite agregar un poco más de aceite de oliva o jugo de limón, al gusto. Mezcle hasta que la mezcla sea un puré suave.", "Pase el hinojo en puré por un colador y mezcle con el yogur griego.", "Sirva el yogur de hinojo en un tazón y con las varitas de berenjena frita y el berro en un costado."], "url": "www_bbc_co_uk_food_recipes_fried_aubergine_with_69889", "title": "Berenjena frita con yogur de hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_aubergine_with_69889_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 x 150 g / 5½ oz rebanadas hígados de terneros, recortados", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "Papas de 600 g / 1 lb 5 oz, peladas y cortadas en chips de ½ cm / ¼ in", "aceite vegetal, para freír", "sal al gusto", "100 g / 3½ oz de harina de maíz", "150ml / 5½fl oz de agua con gas", "2 cebollas pequeñas, cortadas finamente en anillos", "50 g / 1¾oz de mantequilla sin sal", "1 cabeza de col negra", "2 cucharadas de aguardiente", "2 cucharadas de mantequilla", "2 cucharadas de salsa Worcestershire", "2 cucharaditas de mostaza Dijon", "½ cucharadita de sal marina", "pimienta negra recién molida", "1 cucharada de perejil finamente picado", "1 cucharadita de jugo de limón"], "method": ["Para los hígados de los terneros fritos, sazone los hígados, al gusto, con sal y pimienta negra recién molida. Caliente una sartén grande a fuego alto y agregue la mantequilla.", "Cuando la mantequilla esté espumante, agregue los hígados y frítelos en ambos lados durante 1 a 2 minutos, o hasta que se doren por completo, pero aún un poco de color rosa en el centro. Retire de la sartén y reserve para descansar.", "Para las papas fritas, caliente el aceite vegetal en una freidora a 190 ° C / 375 ° F. De forma alternativa, llene a medias una bandeja profunda de base pesada con aceite vegetal y caliente a la misma temperatura, verificando con un termómetro digital. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír las virutas en el aceite durante 4-5 minutos, o hasta que estén doradas y crujientes.", "Con una cuchara ranurada, retire las virutas y déjelas a un lado para escurrirlas sobre papel de cocina. Mientras las patatas fritas aún estén calientes, sazone con sal, al gusto.", "Mezcle la harina de maíz y una pizca de sal en un tazón. Agregue suficiente agua con gas para formar una masa suave (puede que no necesite toda el agua).", "Sumerja los aros de cebolla en la mezcla y cuidadosamente baje en el aceite caliente. Fría durante 1-2 minutos en cada lado, o hasta que estén crujientes y doradas en ambos lados. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre un plato forrado con papel de cocina.", "Agregue la mantequilla a una sartén caliente y, una vez que esté espumante, agregue el cavolo nero y cocine por un minuto y luego sazone con sal y pimienta, luego cocine hasta que se marchite.", "Para la salsa Diane, agregue el brandy a la olla aún caliente en la que cocinó el hígado y regrésela al fuego. Muy cuidadosamente, incline la sartén ligeramente para atrapar la llama y encender el brandy. Flamee hasta que la llama disminuya. (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Reduzca el fuego y agregue rápidamente la mantequilla, salsa Worcestershire, mostaza, sal marina y pimienta, revolviendo vigorosamente con una cuchara de madera durante un minuto, permitiendo que la mezcla burbujee y espese.", "Agregue el perejil y el jugo de limón para terminar.", "Para servir, coloque la col en el centro de las placas y el hígado en la parte superior. Vierta la salsa y sirva junto a las papas fritas y los aros de cebolla."], "url": "www_bbc_co_uk_food_recipes_fried_calfs_liver_with_41221", "title": "Hígado de ternera frita con papas fritas, aros de cebolla y cavolo nero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de frijoles secos, remojados durante la noche, escurridos y enjuagados", "1 zanahoria, pelada, cortada en cuartos", "1 chalote, cortado en cuartos", "1 diente de ajo, aplastado", "2 cucharadas de aceite de oliva virgen extra", "1 cucharada de perejil plano de hojas picadas", "1 lima, ralladura y jugo", "aceite de girasol, para freír", "100ml / 3½fl oz de leche entera", "4 dientes de ajo grandes, en rodajas finas", "3 cucharadas de harina común", "sal marina y pimienta negra recién molida", "8 dientes de ajo sin pelar", "4 lomos de bacalao, aproximadamente 150 g / 5½ oz cada uno, con la piel puesta, secada con palmaditas", "40 g / 1½ oz de mantequilla sin sal", "2 cucharadas de aceite de oliva"], "method": ["Para el puré, coloque los frijoles en una cacerola, cubra con agua fría y hierva a fuego alto, quitando cualquier espuma que salga a la superficie. Agregue la zanahoria, el chalote y el ajo, baje el fuego a fuego lento, cubra parcialmente y cocine durante 40 minutos hasta que estén tiernos.", "Cuele los frijoles, reservando 4 cucharadas de líquido de cocción. Deseche la zanahoria, el chalote y el ajo. Coloque los frijoles en una licuadora con 3 cucharadas de líquido de cocción y mezcle hasta lograr un puré suave. Agregue el aceite de oliva virgen extra y mezcle nuevamente. Agregue el líquido de cocción restante si el puré es demasiado espeso. Sazone con sal y pimienta, luego agregue el perejil, la mitad de la ralladura de lima y todo el jugo de lima.", "Para las patatas fritas de ajo, caliente una olla profunda de fondo grueso con aceite de girasol suficiente para freír el ajo. Caliente a 160 ° C / 315 ° F, o hasta que un cubo de pan se dore en 45 segundos. Alternativamente, use una freidora de grasa. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mientras tanto, lleve la leche a ebullición suave en una cacerola pequeña, agregue el ajo en rodajas y blanquee durante 2-3 minutos hasta que se suavice un poco pero no se rompa. Retire y seque con papel de cocina. Descartar la leche", "Espolvoree ligeramente el ajo en la harina, luego cuidadosamente coloque unas rodajas a la vez en el aceite caliente y fría durante 2-3 minutos hasta que estén doradas y crujientes. Escurrir sobre papel de cocina. Sazonar con sal y dejar de lado.", "Para el bacalao, blanquear los dientes de ajo en una olla pequeña de agua hirviendo durante 4-8 minutos hasta que se ablanden, luego escurrir. Refresque en agua fría y seque con papel de cocina.", "Sazone la piel del bacalao con sal y pimienta. Caliente una sartén antiadherente con tapa a fuego alto. Agregue la mantequilla y el aceite de oliva. Cuando la mantequilla esté espumosa, agregue el bacalao, con la piel hacia abajo, y cocine durante 3-5 minutos, o hasta que la piel esté crujiente y dorada. Baje el fuego a medio-bajo, agregue los dientes de ajo blanqueados, cubra parcialmente con la tapa y cocine durante 3-4 minutos. Retire la tapa, voltee el pescado y cocine durante 2-3 minutos más hasta que esté recién cocido.", "Sirva el bacalao en una cama del puré de frijoles con la salsa de ajo y mantequilla en la parte superior. Espolvorear con patatas fritas de ajo y la ralladura de lima restante antes de servir."], "url": "www_bbc_co_uk_food_recipes_fried_cod_loin_with_30050", "title": "Lomo de bacalao frito con puré de judías blancas y patatas fritas de ajo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 papas grandes de Maris Piper, fregadas, sin pelar, ralladas", "2 remolachas, peladas, ralladas gruesas", "Crema de 75g / 2½ oz", "1 huevo de gallinas camperas, solo yema", "1 cucharada de perejil fresco finamente picado", "sal y pimienta negra recién molida", "75g / 2½oz de mantequilla, derretida", "1 huevo de gallinas camperas, solo yema", "1 limón, solo jugo", "110 g / 4 oz de mantequilla clarificada, calentada", "pizca de cayena", "pizca de sal", "50g / 1¾oz de mantequilla", "400 g / 14 oz de carne en conserva, en rodajas", "2 cucharadas de aceite de colza", "2 huevos de pato"], "method": ["Para remolacha y patata rosti, precaliente el horno a 200C / 400F / Gas 6.", "Coloque las papas ralladas en una toalla de té limpia dentro de un recipiente y exprima el exceso de agua en el recipiente.", "Transfiera la papa rallada y la remolacha rallada a un tazón limpio junto con la crème fraîche, el huevo, el perejil, la sal y la pimienta. Revuelva hasta que esté bien combinado.", "Caliente la mantequilla en una sartén a prueba de horno a fuego medio y coloque 2 x 7,5 cm / 3 in anillos de chefs en la sartén. Coloque la mezcla de papa dentro de los anillos, presione bien con una cuchara y cocine de 3 a 4 minutos o hasta que se dore. Retire los anillos, voltee el rosti, presione la mezcla hacia abajo y cocine durante 3-4 minutos en el otro lado.", "Transfiera la sartén al horno y hornee los rosti durante 5-10 minutos, o hasta que estén tiernos y cocidos.", "Para la salsa holandesa, ponga la yema de huevo, el jugo de limón y una cucharada de agua en una licuadora. Encienda la licuadora y vierta lentamente la mantequilla calentada a través de la tapa, la salsa comenzará a espesar. Sazone con pimienta de cayena y sal.", "Para la carne en conserva y el huevo, caliente una sartén grande y agregue la mantequilla, una vez caliente, agregue la carne en conserva en rodajas. Cocine a cada lado durante 2-3 minutos, hasta que estén crujientes y doradas. Retire de la sartén.", "Agregue el aceite a la sartén. Rompe los huevos en la sartén y freír hasta que estén cocidos a tu gusto.", "Para servir, coloque el rosti en el centro de los platos para servir y coloque la carne en conserva frita en la parte superior. Cubra con el huevo frito y vierta sobre la salsa holandesa."], "url": "www_bbc_co_uk_food_recipes_fried_corned_beef_and_60973", "title": "Carne en conserva frita y huevo con remolacha y patata rosti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]