[{"isVegetarian": false, "title": "Lemon sole Véronique", "url": "www_bbc_co_uk_food_recipes_lemon_sole_vronique_12672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 shallot, roughly chopped", "1 celery stick, chopped", "4 sprigs fresh thyme", "12 langoustine tails, blanched, meat removed, shells reserved", "5 tbsp white wine", "300ml/10fl oz fish stock ", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "100ml/3½fl oz dry vermouth", "200ml/7fl oz stock (from above)", "1 bay leaf", "150ml/5fl oz double cream", "150g/5½oz green grapes, peeled and cut in half ", "¼ cucumber, balled using a Parisian scoop", "75g/2½oz unsalted butted", "2 x lemon sole fillets, skinned, fillets halved and rolled up", "2 tbsp fresh chervil", "selection of edible flowers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the stock, heat the butter in a saucepan and add the shallot, celery and thyme. Cook for 2-3 minutes. Add the langoustine shells and increase the heat. Add the white wine and fish stock and cook for 5 minutes. ", "Remove from the heat and place in a large food processor. Blend everything together, including the shells. Pass through a sieve and set aside.", "For the sauce, heat a large sauté pan and add the butter. Once melted add the shallot and cook for 1 minute. Add the vermouth, stock and bay leaf and cook until the volume of liquid has reduced by half. Add the cream and reduce by half again. Pass through a sieve into a clean pan. Add the grapes and cucumber balls and cook for 1 minute. ", "To cook the sole, heat a large frying pan and add the butter. Once hot add the sole. Cook on each side until golden and cooked through. Add the langoustine meat and warm through. ", "Put the sole fillets on a large plate and top with the langoustines. Pour the sauce around the plate and garnish with the fresh chervil and edible flowers."]}, {"isVegetarian": true, "title": "Lemon soufflé with spun sugar and raspberries", "url": "www_bbc_co_uk_food_recipes_lemon_souffl_with_spun_53293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter, softened", "4 tbsp caster sugar", "4 free-range egg whites", "175ml/6fl oz ready-made vanilla custard", "3 lemons, zest and juice of 2", "200g/7oz caster sugar", "500g/1lb 2oz raspberries", "1 tsp lemon juice", "1-2 tbsp icing sugar, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflé, preheat the oven to 220C/425F/Gas 7.", "Lightly grease four large ramekins with the butter, then dust with half the caster sugar.", "Whisk the egg whites in a large clean bowl until soft peaks form when the whisk is removed. Slowly whisk in the remaining caster sugar and continue to whisk until stiff peaks form. ", "Gently fold in the vanilla custard, lemon zest and juice until just combined. ", "Spoon the mixture gently into the prepared ramekins and place onto a baking tray. ", "Bake in the oven for 7-8 minutes then remove from the oven and serve immediately.", "Meanwhile, for the spun sugar, melt the sugar in a frying pan over a medium heat and when it turns into a deep golden colour, remove from the heat and use a fork to flick back and forth over the back of a ladle to form a cage. Set aside to cool and harden, then carefully twist the cage off of the ladle and place onto the plate.", "Place 300g/11oz of the raspberries and the lemon juice into a food processor and blend to a smooth purée. Taste the mixture and add icing sugar, to taste. Pass the mixture through a fine sieve into a bowl. ", "Place the soufflé onto the plate. Fill the cage with a few raspberries then drizzle the sauce around."]}, {"isVegetarian": true, "title": "Lemon Swiss roll with passionfruit cream and lemon drizzle glaze", "url": "www_bbc_co_uk_food_recipes_lemon_swiss_roll_with_37413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium free-range eggs", "115g/4oz caster sugar, plus extra for dusting", "1 vanilla pod, cut in half lengthways and seeds scraped out", "75g/2½oz self-raising flour", "1 lemon, zest only", "100ml/3½fl oz double cream", "1 tsp vanilla extract", "100g/3½oz cream cheese", "6 passionfruits, seeds removed", "1 lemon, sliced ", "100g/3½oz caster sugar", "100g/3½oz raspberries or strawberries", "50g/1¾oz icing sugar", "1 lemon, zest and juice", "150g/5½oz icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line a 23x33cm/9x13in Swiss roll tin with baking parchment.", "Place the eggs, sugar and vanilla seeds in a large bowl and whisk until very light, fluffy and thickened. Sift the flour over the mixture, add the lemon zest and gently fold in.", "Pour the mixture into the lined tin and use a spatula to smooth the surface. Bake the sponge for 10-12 minutes, or until just firm to the touch.", "Place a piece of baking parchment that is slightly bigger than the Swiss roll tin on the work surface and dust it with caster sugar. Carefully flip the hot sponge over onto the baking parchment and peel off the parchment from the bottom of the sponge. Set aside to cool slightly.", "For the garnish, place the caster sugar and 100ml/3½fl oz water in a saucepan and bring to the boil. When the sugar is dissolved, add the sliced lemon and cook over a low heat for about 20 minutes, or until the lemons are soft. Leave to cool.", "For the passionfruit cream, in a large bowl, whip the double cream with the vanilla extract until soft peaks form when the whisk is removed. Stir in the cream cheese. ", "To assemble the Swiss roll, spread the whipped cream and cream cheese over the top of the sponge and then spoon over the passionfruit seeds. Take one of the short edges, then using the parchment paper underneath to start it off, roll up the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the parchment.", "For the glaze, add all the ingredient to a small pan. Heat the mixture until the sugar dissolves.", "Pour the syrup evenly over the Swiss roll, dust with icing sugar and garnish with the berries and confit lemon slices."]}, {"isVegetarian": true, "title": "Lemon tart", "url": "www_bbc_co_uk_food_recipes_lemon_tart_38623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "100g/3½oz cold butter, plus extra for greasing", "25g/1oz icing sugar, plus extra for dusting", "1 pinch salt", "1 free-range egg", "14 free-range eggs, plus 1 beaten egg for glazing", "550g/1lb 4oz caster sugar", "700ml/1¼ pint double cream", "10 large lemons, zest and juice only", "500g/1lb 2oz crème fraîche, to serve"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the flour, butter, icing sugar and salt in a bowl and rub with the tips of your fingers until it resembles the texture of fine breadcrumbs.", "Add the egg and mix together until it forms a dough, then knead lightly on a work surface until smooth.", "Roll into a ball then flatten slightly, wrap in cling film and put in the fridge to rest for 30 minutes.", "For the tart, preheat the oven to 170C/340F/Gas 3½ and butter a 25cm/10in tart ring (approximately 4.5cm/1¾in deep).", "Break the eggs into a bowl, add the sugar, cream, lemon zest and juice and whisk gently to combine. Place in the fridge to chill.", "Roll out the pastry on a work surface lightly dusted with flour to about 3mm thick – keep turning the pastry a quarter turn every time you roll it so you end up with a perfect circle of pastry.", "Put the buttered tart ring on a flat baking sheet then line it with the pastry, carefully lifting the pastry up then pressing it into the base of the ring, leaving any excess hanging over the edge.", "Line with a several sheets of cling film to cover the pastry and hang over by 10cm/4in then fill the tart with flour, raw rice or baking beans. Fold the cling film back over the flour/rice and bake for 15 minutes. Not all cling film is suitable for use in the oven but aluminium foil or baking parchment can be used instead if preferred.", "Remove the cling film and flour/rice, brush the inside of the tart with the beaten egg and return to the oven for another 3-4 minutes, or until just golden-brown.", "Reduce the oven temperature to 150C/300F/Gas 2. ", "Skim off any bubbles from the top of the lemon cream and discard. ", "Pour half the lemon cream into the pastry case, then transfer to the oven before adding the rest of the filling (this prevents any spillage and gives a neat finish).  ", "Bake for an hour, or until the filling is set but still just wobbling in the centre. Leave to cool at room temperature.", "To serve, cut the tart into wedges and dust with icing sugar. Glaze either by putting the tart under a hot grill or by using a blow torch. Serve with a quenelle of crème fraîche."]}, {"isVegetarian": true, "title": "Lemon tendercake with blueberry compôte", "url": "www_bbc_co_uk_food_recipes_lemon_tendercake_with_52994", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_tendercake_with_52994_16x9.jpg", "ingredients": ["225g/8oz plain flour ", "1½ tsp baking powder ", "½ tsp bicarbonate of soda ", "¼ tsp fine sea salt ", "150ml/5fl oz vegetable oil, plus extra for greasing ", "150g/5½oz caster sugar ", "275ml/9½fl oz coconut milk ", "2 lemons, zest and juice ", "1 tsp vanilla extract ", "150g/5½oz blueberries ", "1 lemon juice, juice only", "1 tbsp caster sugar ", "1½ tsp cornflour ", "250g/9oz coconut milk yoghurt ", "1 tsp vanilla extract ", "2½ tsp icing sugar "], "serves": "Serves 8–12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease the sides and line the base of a 20cm/8in springform cake tin with baking paper. ", "To make the cake, combine the flour, baking powder, bicarbonate of soda and salt in a large bowl. ", "Whisk the oil, sugar and coconut milk together in a jug, followed by the lemon zest and 3 tablespoons of juice and the vanilla extract. ", "Pour the jug of liquid ingredients into the bowl of dry ingredients, whisking to combine, then pour into the prepared tin and bake for 30–35 minutes, by which time the top will be golden brown, the sides shrinking away from the tin and a cake tester should come out clean. Transfer to a wire rack and leave the cake to cool completely in its tin. It may sink slightly as it cools.", "To make the compôte, put the blueberries, 1 tablespoon lemon juice, caster sugar and 50ml/2fl oz of cold water into a saucepan and bring to the boil, then turn down the heat and simmer, stirring gently every now and again, for a couple of minutes until the blueberries have softened. Remove the pan from the heat. ", "Mix 1½ teaspoons of cold water with the cornflour in a small cup and stir the paste into the compôte. Put the pan back over the heat and stir gently for about 30 seconds until bubbling and thickened. If you feel it has become too jammy and thick, simply add a little more water and stir it in over the heat. Pour the compôte into a small heatproof bowl or jug to cool and set. ", "Just before serving, remove the cold cake from its tin and place on a cake stand or plate. ", "Mix the coconut-milk yoghurt and vanilla together, spoon the icing sugar into a tea-strainer, then sieve it over the yoghurt and stir it in before spreading and swirling this soft mixture over the top of the cake. Loosen the blueberry compôte a little with a fork and gently spoon on top, leaving a gleaming white frame. Serve immediately. "]}, {"isVegetarian": true, "title": "Strawberry meringue roulade", "url": "www_bbc_co_uk_food_recipes_lemon_verbena_meringues_29213", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 egg whites", "275g/9¾oz caster sugar", "handful small lemon verbena leaves", "1 tsp icing sugar, for dusting", "350g/12oz strawberries, hulled and halved depending on size", "400ml/14fl oz double cream", "1 vanilla pod, cut in half lengthways and seeds scraped out"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringues, preheat the oven to 180C/160C Fan/Gas 4. Line a large baking sheet with non-stick baking paper or a silicone mat.", "Whisk the egg whites in a clean, glass bowl using an electric hand whisk until stiff peaks form when the whisk is lifted out. Gradually add the sugar, one spoonful at a time, and whisk well between each addition. Whisk until very stiff and glossy and all the sugar has been added. ", "Spoon the mixture onto the lined baking sheet, creating a 35x25cm/14x10in rectangle, and smooth the surface. Sprinkle with most of the lemon verbena. Bake for 8 minutes, or until golden brown. Reduce the temperature to 170C/Fan 150C/Gas 3 and bake for a further 12 minutes, or until crisp.", "Lightly dust a sheet of baking paper with caster sugar. Allow the meringue to cool slightly before turning it out onto the baking paper, lemon verbena side down. Leave to cool. ", "For the filling, put 200g/7oz strawberries in a blender and blend until smooth. Pass the mixture through a sieve into a bowl to remove the seeds.", "Lightly whisk the cream in a large bowl. Stir in the strawberry sauce and 100g/3½oz of the remaining strawberries. Spread the strawberry cream evenly over the meringue. Starting at the long end, roll the roulade up using the paper to help you. ", "Decorate the top of the roulade with the remaining strawberries and lemon verbena leaves and dust with the icing sugar. "]}, {"isVegetarian": true, "title": "Lemon thyme custard with raspberries and sweet scraps", "url": "www_bbc_co_uk_food_recipes_lemon_thyme_custard_with_16395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10½fl oz full-fat milk", "300ml/10½fl oz double cream", "4 sprigs lemon thyme", "6 free-range egg yolks", "50g/1¾oz sugar", "200ml/7fl oz double cream, whipped", "vegetable oil for deep frying", "1 free-range egg white ", "175g/6oz self-raising flour", "pinch bicarbonate of soda", "160ml/5½fl oz sparkling water ", "50g/1¾oz icing sugar", "200g/7oz fresh raspberries"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the lemon thyme custard, place the milk and cream in a large saucepan and add the lemon thyme. Heat for a couple of minutes. Meanwhile place the egg yolks and sugar in a large bowl and whisk. ", "Sieve the milk and cream to get rid of the thyme. Gradually pour the liquid over the egg and sugar and keep whisking to stop the eggs from scrambling.", "Pour the mixture back into the saucepan and cook until it coats the back of the spoon.", "Allow the custard to cool. Once cool, add the whipped cream and mix it in.", "For the sweet scraps, heat the oil in a deep fat fryer to 170C/340F, or heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and goes brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Place the egg white, flour and bicarbonate of soda in a large bowl and whisk. Gradually add the sparkling water, whisking all the time.", "Drizzle the batter into the deep fat fryer and cook for 1-2 minutes to make scraps. Remove with a slotted spoon, drain on a plate lined with kitchen paper and dust with icing sugar.", "To serve, layer the lemon thyme custard and fresh raspberries in a serving glass. Garnish with the sweet scraps and a few more raspberries."]}, {"isVegetarian": true, "title": "No-churn lemon yoghurt ice cream", "url": "www_bbc_co_uk_food_recipes_lemon_yoghurt_ice_cream_79279", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_yoghurt_ice_cream_79279_16x9.jpg", "ingredients": ["300ml/½ pint double cream", "300ml/½ pint full-fat natural yoghurt", "2 lemons, finely grated zest and juice", "350g/12oz caster sugar", "300ml/½ pint milk"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Whisk the cream in a bowl until soft peaks form when the whisk is removed.  Stir in the yoghurt, lemon zest and juice, sugar and milk. Whisk until well combined.", "Pour into a 1.5 litre/2½ pint shallow plastic container, cover with a lid and freeze for at least six hours, preferably overnight, until firm.", "Remove the ice cream from the freezer, cut into chunks and blend in a processor until smooth and creamy.  Return to the plastic container, cover with the lid and return to the freezer until required."]}, {"isVegetarian": false, "title": "Lemon and dill-marinated salmon with herb salad", "url": "www_bbc_co_uk_food_recipes_lemonanddillmarinate_84941", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz salmon fillet, skin removed", "1 tsp caster sugar", "½ lemon, juice only", "small handful fresh dill, finely chopped", "drizzle olive oil", "small handful each fresh chives, parsley, basil, mint, chopped", "squeeze lemon juice", "1 tbsp extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the salmon ingredients into a bowl and stir to coat to salmon well. Cover with cling film and leave to  marinate for ten minutes. Slice thinly.", "To make the herb salad, put the herbs into a large bowl and squeeze over the lemon juice and olive oil. Mix until  the herbs are well coated.", "To serve, put the herb salad on a plate and top with the slices of marinated salmon."]}, {"isVegetarian": true, "title": "Lemonade granita", "url": "www_bbc_co_uk_food_recipes_lemonadegranita_70981", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz caster sugar", "6 lemons, juice and grated rind", "1 lemon grass stalk, roughly flattened with a rolling pin", "450ml/¾ pint soda water"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar, lemon rind and juice, lemongrass stalk in a pan with 150ml/¼ pint water. ", "Heat gently, stirring until the sugar dissolves then simmer gently for five minutes then allow to cool. ", "Strain the liquid into a rigid container then stir in the soda water.", "Transfer to the freezer for at least two hours, whisking every 20 minutes to stop crystals forming.", "Serve in glasses."]}, {"isVegetarian": true, "title": "Lemon and lime pavlova", "url": "www_bbc_co_uk_food_recipes_lemonandlimepavlova_91318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonandlimepavlova_91318_16x9.jpg", "ingredients": ["150g/5½oz caster sugar", "3 free-range egg whites, whisked in a clean bowl until stiff peaks form when the whisk is removed", "½ tsp sherry vinegar", "2 lemons, juice and zest", "3 limes, juice and zest", "175g/6oz caster sugar", "3 free-range eggs, plus 5 free-range egg yolks", "150g/5oz butter, softened", "200g/7oz double cream, whipped until soft peaks form when the whisk is removed ", "12 passion fruit, pulp only, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.", "For the meringue, whisk the sugar, a tablespoon at a time, into the stiffened egg whites, until the mixture is smooth and glossy.", "Gently fold in the sherry vinegar.", "Spoon the meringue mixture onto the prepared baking tray to form a circle about 20cm/8in in diameter. Spoon the remaining meringue in dollops around the edge of the meringue, forming swirls and peaks as you go. ", "Transfer the meringue to the oven and immediately reduce the temperature to 150C/300F/Gas 2. Bake for 45-50 minutes, or until the meringue has hardened on the outside, but is still soft and chewy in the middle. ", "Meanwhile, for the filling, place the lemon juice and zest, lime juice and zest, caster sugar, eggs, egg yolks and 75g/2¾oz of the butter into a heavy-based pan. Whisk over a medium heat until the sugar has dissolved and the mixture is smooth and thick enough to coat the back of a spoon. ", "Add the remaining butter, stirring continuously. Continue to stir until all of the butter has melted and the mixture has thickened considerably. ", "Remove the mixture from the heat and whisk a little, then set aside until completely cool.", "To serve, place the meringue into the centre of a serving platter. Spoon the lemon and lime filling mixture into the centre, then top with the whipped cream and passion fruit pulp."]}, {"isVegetarian": false, "title": "Lemon and garlic-roasted chicken with cheesy butternut mash", "url": "www_bbc_co_uk_food_recipes_lemonandgarlicroaste_85530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast", "1 garlic clove, chopped", "50g/1¾oz cheddar cheese, grated", "2 tsp fresh thyme leaves", "1 lemon, juice and zest only", "2 tbsp olive oil", "salt and freshly ground black pepper", "150g/5½oz butternut squash, peeled and chopped into 1cm/½in cubes", "2 smoked garlic cloves, peeled", "200ml/7fl oz milk", "salt and freshly ground black pepper ", "85g/3oz cheddar cheese, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the lemon and garlic-roasted chicken, cut two slashes into the chicken breast. Tuck the garlic and cheese into the pocket under the mini-fillet, cutting to make it larger if necessary.", "Place the thyme leaves, lemon juice and zest and olive oil into a bowl, season with salt and freshly ground black pepper and mix well.", "Place the chicken into the bowl and leave to marinate for ten minutes.", "Heat a griddle pan and griddle the chicken for 3-4 minutes on each side. Transfer to a baking sheet and roast in the oven for 12-14 minutes, or until completely cooked through.", "Meanwhile, for the cheesy butternut mash, place the squash, garlic and milk into a large pan. Bring to the boil, reduce the heat and simmer for 10-12 minutes, or until the squash is tender. Mash with a potato masher, season well with salt and freshly ground black pepper and stir in the grated cheese. ", "To serve, place the mash onto a plate, top with the chicken and pour over the chicken cooking juices."]}, {"isVegetarian": false, "title": "Lemon and orange Chinese-style beef", "url": "www_bbc_co_uk_food_recipes_lemonandorangechines_79829", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp oil", "knob fresh ginger, peeled and sliced", "170g/6oz beef, thinly sliced", "3 lemon leaves, shredded (or subsitute lime leaves)", "2 tsp sesame oil", "2 tsp sesame seeds", "2 tbsp lemon, zest only", "honey, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small wok over a high heat, until smoking, and add the ginger and beef. Stir fry for two minutes, to brown.", "Turn the heat down slightly, add the remaining ingredients and stir fry for a further two minutes before transferring to a bowl and serving."]}, {"isVegetarian": true, "title": "Lemon and polenta cake with lemon vodka cream", "url": "www_bbc_co_uk_food_recipes_lemonandpolentacakew_83693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 lemons, thinly sliced", "450g/1lb butter", "450g/1lb caster sugar", "6 free-range eggs", "150g/5¼oz ground almonds", "500g/1lb 1½oz quick cook polenta", "2 lemons, zest and juice only", "150g/5¼oz mascarpone", "200ml/7¼fl oz double cream", "45ml/1½fl oz lemon vodka", "30g/1¼oz icing sugar", "½ lemon, juice only", "sprig of mint", "lemon zest"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Line a 30cm/9in deep cake tin with baking parchment.", "Heat a frying pan until hot then add the oil and lemon slices.", "Fry for 1-2 minutes until just caramelised.", "Remove and place caramelised side down in a pattern on the baking parchment in the tin.", "Place the butter and sugar into a large bowl and whisk together until light and fluffy.", "Add the eggs one at a time, mixing well.", "Fold in the ground almonds, polenta, lemon juice and zest and stir to combine.", "Pour the mixture over the lemon slices and spread evenly into the tin.", "Place in the oven for 25-30 minutes until just risen and golden.", "Allow to cool before turning out onto a plate, lemon slices uppermost.", "To make the lemon cream, place the mascarpone into a bowl and beat to soften.", "Pour in the double cream, lemon vodka, icing sugar and lemon juice.", "Whisk until mixture forms soft peaks.", "Serve a wedge of cake with a dollop of cream, a sprig of mint and sprinkle of lemon zest."]}, {"isVegetarian": false, "title": "Lemon and rosemary mackerel with olive dressing", "url": "www_bbc_co_uk_food_recipes_lemonandrosemarymack_88380", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "1 mackerel fillet, cut in half, skin scored with a sharp knife", "1 sprig fresh rosemary, chopped", "salt and freshly ground black pepper", "½ lemon, juice only", "100g/3½oz Kalamata olives, pits removed", "1 garlic clove, chopped", "2 tbsp olive oil", "fresh basil leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, heat the olive oil and butter in a frying pan. Add the mackerel and sprinkle with rosemary, salt and freshly ground black pepper. Fry for two minutes on each side, or until cooked through. Squeeze over the lemon juice and remove from the heat.", "For the dressing, place the olives, garlic and olive oil into a mini blender and process until smooth.", "To serve, place the mackerel onto a serving plate. Pour over the dressing and garnish with fresh basil leaves."]}, {"isVegetarian": true, "title": "Lemon and rosemary bulgar wheat salad", "url": "www_bbc_co_uk_food_recipes_lemonandrosemarybulg_89458", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz bulgar wheat", "½ vegetable stock cube", "boiling water", "1 lemon, zest and juice", "2 tbsp chopped fresh rosemary", "2 tbsp olive oil", "3 spring onions, sliced", "handful mixed salad leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the bulgar wheat into a small pan and crumble the stock cube over it.", "Add boiling water to reach 1cm/½in above the bulgar wheat and stock. Cover with a lid and simmer over a medium heat for 12-15 minutes, or until the bulgar wheat is tender and has absorbed the water. ", "Fluff the wheat with a fork and add the remaining ingredients, mixing well until combined. ", "Press the bulgar wheat salad into a small heatproof bowl so that the wheat moulds to the bowl, and cover with a plate. ", "To serve, turn out the salad onto the serving plate and garnish with the mixed salad leaves."]}, {"isVegetarian": false, "title": "Lemon and thyme chicken with chilli beans", "url": "www_bbc_co_uk_food_recipes_lemonandthymechicken_70823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white wine ", "1 lemon, juice only", "4 boneless chicken breasts ", "plain flour, for dusting ", "120ml/4fl oz olive oil ", "2 small onions, finely sliced ", "1 lemon, zest and pith removed, thinly sliced, plus a few lemon slices to garnish ", "16 branches of fresh thyme, plus a few sprigs to garnish", "10 fresh sage leaves ", "salt ", "freshly ground black pepper", "1 clove of garlic", "1 red chilli, de-seeded and finely chopped", "200g/7oz green beans", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a small bowl, mix together the wine and lemon juice, then set aside. ", "Season the chicken breasts with salt and pepper and rub well in.", "Lightly dust them with some flour, shaking off any excess. With the palm of your hand, flatten the breasts slightly.", "Heat the olive oil in a large pan. Add the chicken and seal on both sides (some chicken breasts contain water and may spit while cooking. To prevent this, cover with a lid).", "Once they are well-sealed and golden brown, remove the chicken breasts from the pan and set aside. ", "Lower the heat, add the onions, season with salt and pepper and sweat until the onions are soft. ", "Add the lemon slices, thyme and sage leaves and mix well.", "Return the chicken to the pan, cover and cook over a gentle heat for three minutes. Raise the heat (but be careful not to burn the onions and lemon).", "Add the wine and lemon juice mixture, then cover and cook for 10-15 seconds, until the mixture is bubbling. ", "Remove the lid and simmer until the liquid has evaporated slightly. You will see the sauce thickening.", "Taste and adjust the seasoning if necessary. ", "Arrange the chicken breasts on a large plate or on individual serving plates and pour the sauce over.", "Garnish with lemon slices and sprigs of thyme.   \t", "To prepare the chilli beans, cook until tender, then drain and toss in the garlic, lemon juice and chopped chilli."]}, {"isVegetarian": true, "title": "Lemon and thyme sweet potato fondant", "url": "www_bbc_co_uk_food_recipes_lemonandthymesweetpo_85374", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 sweet potato, peeled and sliced into 1cm/½in thick rounds", "3 tbsp water", "sprig fresh thyme, leaves only", "salt and freshly ground black pepper", "½ lemon, juice only", "lemon wedge, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan and gently fry the sweet potato slices, turning frequently, until lightly golden on both sides.", "Add the water and thyme leaves and season with salt and freshly ground black pepper. Cover and simmer for 6-8 minutes, or until tender. Squeeze in the lemon juice and stir.", "To serve, place the sweet potato fondant onto a plate and garnish with a lemon wedge."]}, {"isVegetarian": true, "title": "Lemon cheesecake", "url": "www_bbc_co_uk_food_recipes_lemoncheesecake_65665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemoncheesecake_65665_16x9.jpg", "ingredients": ["10 digestive biscuits", "75g/3oz butter, melted", "1 tbsp clear honey", "700g/1½ lb mascarpone cheese", "2 lemon, juice and zest", "200g/7oz caster sugar, plus more to taste", "4 tbsp icing sugar", "mint, to garnish", "450g frozen summer fruits, defrosted", "icing sugar, to taste"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the bottom of a 23cm/9in springform cake tin with some of the melted butter and place a round of greaseproof paper in the base. ", "Crush the biscuits and tip them into a bowl, add the melted butter and honey and stir until well combined.", "Tip the mixture into the bottom of the cake tin. Using the back of a spoon, gently push the crumbs from the centre outward, until smooth and level. This will form the base of the cheesecake.  Chill in the fridge while making the filling.", "For the filling, mix the mascarpone cheese, lemon juice and zest and caster sugar together in a bowl until well combined. Do not mix the mixture too much as this will cause it to split. Taste the mixture and add more sugar, to taste.", "Spoon the mixture into the tin on top of the chilled biscuit mixture and chill in the fridge for at least 2 hours. ", "When ready to serve, either run a hot cloth or blowtorch round the outside of the tin and ease out the cheesecake. ", "For the sauce, blend most of the fruits with some icing sugar (to taste) in a food processor until smooth. Pass the sauce through a sieve.", "Place the cheesecake onto a plate, decorate the top with the sprigs of fresh mint and spoon the sauce around the side. Decorate with the remaining berries."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_11654", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonchicken_11654_16x9.jpg", "ingredients": ["450g/1lb chicken breasts, no skin or bone - cut into strips", "1 egg white", "2 tsp cornflour", "good pinch salt", "sesame oil", "250ml/8fl oz groundnut oil", "3 lemons, juice and zest", "85ml/2fl oz chicken stock", "1 tbsp sugar", "1 tbsp light soy sauce", "splash of dry sherry (optional)", "1 clove garlic, crushed", "1 red chilli, finely chopped", "1 tsp cornflour or arrowroot - mixed with water", "small bunch spring onions, shredded", "seasoning"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the egg white, cornflour, salt, a little sesame oil and chicken in a bowl - stir to make sure the chicken is well coated.  Leave for about 20 minutes.", "Heat a wok until very hot, add some groundnut oil and heat until smoking.  Remove from the heat and add the chicken - stir quickly to stop it from sticking and cook until the chicken turns white.  Drain the chicken over a heatproof bowl, set the chicken to one side, allow the oil to cool and discard.", "Wipe the wok clean and make the sauce. Add the stock, lemon juice and zest, sugar, soy and dry sherry together with the garlic and chilli. Bring to the boil and whisk in the cornflour or arrowroot mixture. Simmer gently for a few moments and then add the chicken. Stir fry to make sure the chicken is well coated and heated through properly.  ", "Add a little sesame oil as final seasoning and serve scattered with spring onions."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_89043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts, skin removed, cut into strips", "3-4 tbsp cornflour, seasoned with salt and freshly ground black pepper", "1 tbsp vegetable oil", "small bunch spring onions, cut into 2cm/1in pieces ", "1 clove garlic, finely sliced", "25g/1oz fresh root ginger, finely sliced", "1 lemon, juice and finely sliced rind only", "1 tbsp light soy sauce", "85ml/3fl oz chicken stock", "dash dry sherry", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the chicken strips in the seasoned cornflour and shake off the excess.", "Heat the vegetable oil in a frying pan, add the chicken and fry until the chicken is beginning to turn golden-brown. Add the spring onions, garlic, ginger and sliced lemon rind.   ", "Squeeze the juice of half a lemon into the pan. Add the soy sauce and chicken stock and a dash of dry sherry. Stir and leave to simmer for 5-6 minutes, or until the chicken is cooked through. Season with freshly ground black pepper. Stir well and serve."]}, {"isVegetarian": false, "title": "Lemon chicken casserole", "url": "www_bbc_co_uk_food_recipes_lemonchickencasserol_90144", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp honey", "1 lemon, zest and juice only, plus 1 lemon, sliced into thin rounds", "2kg/4lb 4oz free-range chicken, cut into 8 pieces", "salt and freshly ground black pepper", "125g/5oz butter", "1 tbsp olive oil", "4 garlic cloves, left whole, lightly crushed", "500ml/17fl oz hot chicken stock", "2 sprigs fresh thyme", "250g/9oz baby leaf spinach"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200/400F/Gas 6.", "Place the honey, lemon zest and lemon juice into a bowl and whisk until well combined. Add the chicken pieces and turn until they are completely coated in the mixture. Season well with salt and freshly ground black pepper and set aside for at least 10 minutes to marinate.", "Heat 40g/1½oz of the butter and half of the olive oil in a pan over a medium heat. When the butter is foaming, add half of the marinated chicken pieces and fry for 5-6 minutes, turning occasionally, until golden-brown. Set the chicken pieces aside on a warm plate.", "Repeat the process with another 40g/1½oz of butter, the remaining oil and the remaining chicken pieces. When the chicken pieces are golden-brown, set them aside.", "Add the garlic cloves, lemon slices and residual marinade juices to the pan and stir well, scraping any burned bits off the bottom of the pan with a wooden spoon.", "Return the cooked chicken pieces to the pan, then add the hot chicken stock and the thyme sprigs and stir well. Bring the mixture to the boil, then place into the oven to cook for 30-35 minutes, or until the chicken is tender and cooked through. Remove the chicken pieces from the pan and set aside on a warm plate.", "Continue to simmer the lemon sauce over a high heat for a further 5-10 minutes, or until the liquid has reduced to the consistency of thin syrup.", "Strain the sauce through a fine sieve, pressing the garlic pulp through the sieve using the back of a wooden spoon. Season the sieved liquid, to taste, with salt and freshly ground black pepper and set aside.", "Heat the remaining butter in a frying pan over a medium heat. When the butter is foaming, add the spinach and fry, stirring regularly, for 3-4 minutes, or until just wilted.", "To serve, place a portion of the wilted spinach into the centre of each plate. Place two pieces of chicken on top of each portion of spinach. Spoon over the lemon sauce and serve immediately."]}, {"isVegetarian": false, "title": "Lemon chicken stuffed with sun-dried tomatoes and apricot cheese", "url": "www_bbc_co_uk_food_recipes_lemonchickenstuffedw_88628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, cut into three pieces", "5 sun-dried tomatoes, chopped", "75g/2¾oz Stilton with apricots, crumbled", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 lemon, juice and zest only", "100g/3½oz spinach leaves, finely sliced", "½ lemon, juice only", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ onion, finely chopped", "2 garlic cloves, finely chopped ", "1 orange pepper, cut into strips", "½ tsp chilli flakes", "1 tbsp caster sugar", "1 tbsp white wine vinegar", "1 orange, juice only", "1 lemon, halved"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the stuffed lemon chicken, lay out the three pieces of chicken breast on a sheet of cling film. Cover with another sheet of cling film and flatten the chicken with a rolling pin or meat mallet.", "Remove the cling film. Pile the chopped tomatoes and cheese into the centre of each chicken piece. Season with salt and freshly ground black pepper, then roll up the chicken around the stuffing, securing with a cocktail stick. ", "Heat the oil in an ovenproof frying pan and sear the stuffed chicken on all sides until golden-brown, about 3-4 minutes. Sprinkle over the lemon zest and squeeze over the juice. Transfer to the oven and roast for about 10-12 minutes, or until completely cooked through.", "For the citrus spinach, place the spinach into a bowl with the lemon juice, oil, salt and freshly ground black pepper and stir well.", "For the pepper sauce, heat the oil in a pan and gently fry the onion, garlic and orange pepper for 4-5 minutes.", "Add the chilli flakes, sugar, white wine vinegar and orange juice and simmer for 6-7 minutes, or until the sauce is reduced and sticky and the peppers are soft.", "To serve, heat a frying pan until hot and place the lemon halves, cut-side down, in the pan. Leave for 4-5 minutes, until charred.", "Place a bed of citrus spinach on a serving plate and top with the stuffed chicken (remove the cocktail sticks). Arrange the chargrilled lemon halves to one side and the pepper sauce in a small bowl on the other side."]}, {"isVegetarian": false, "title": "Lemon chicken", "url": "www_bbc_co_uk_food_recipes_lemonchicken_91444", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz chicken stock", "2 lemons, zest and juice", "1 tbsp dry sherry", "1 garlic clove, left whole", "4 x 150g/5½oz chicken breasts, skin removed", "250ml/9fl oz chicken stock", "4 tbsp caster sugar", "4 lemons, zest and juice", "1 tbsp cornflour, mixed to a paste with a little water", "salt and freshly ground black pepper", "75g/2¾oz butter", "200g/7oz ready-made egg-fried rice ", "4 spring onions, trimmed, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, mix together the chicken stock, lemon zest and juice, sherry and garlic clove in a large casserole. Bring to the boil, then reduce the heat until the mixture is just simmering.", "Add the chicken breasts and cover the casserole with a lid. Cook for 20-25 minutes, or until cooked through. Set aside to cool slightly. ", "For the lemon sauce, bring the chicken stock, sugar and lemon zest and juice to the boil in a pan, then continue to cook for 4-5 minutes.", "Whisk in the cornflour paste until the mixture is smooth. Season, to taste, with salt and freshly ground black pepper.", "Heat the butter in a frying pan over a medium heat. Add the cooled chicken breasts and fry for 2-3 minutes on each side, or until golden-brown on both sides. ", "To serve, place one chicken breast onto each of four serving plates. Pour over the lemon sauce. Spoon a portion of egg-fried rice alongside. Sprinkle over a little spring onion."]}, {"isVegetarian": false, "title": "Lemon chicken with squash mash and spicy stir-fried curly kale", "url": "www_bbc_co_uk_food_recipes_lemonchickenwithsqua_82107", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken breast, skinned and flattened with a meat mallet", "2 tsp plain flour, seasoned with salt and freshly ground black pepper", "1 tbsp butter, melted", "½ lemon ", "1 tbsp chopped fresh parsley, to serve", "lemon wedges, to serve", "½ butternut squash, peeled and chopped", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "1 tbsp butter", "1 tbsp olive oil", "3 spring onions, finely chopped", "125g/4½oz curly kale, chopped", "3 tbsp white wine", "1 tsp dried chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon chicken, roll the chicken in the seasoned flour. ", "Melt the butter in a frying pan, add the floured chicken, squeeze over half the juice from the lemon and cook for 2-3 minutes. ", "Turn over, squeeze over the rest of the lemon and cook for 2-3 minutes or until the chicken is cooked through. Remove from the pan and keep warm.", "To make the butternut squash mash, boil the squash in salted water until soft. ", "Drain and blend in a food processor with the double cream, salt and freshly ground black pepper. ", "Melt the butter in a frying pan, add the blended butternut squash and sauté for 1-2 minutes.", "To make the spicy curly kale, heat the olive oil in a sauté pan and add the spring onions. ", "Cook gently until softened slightly, add the curly kale and cook for another minute, stirring frequently. ", "Add the white wine, chilli flakes, salt and freshly ground black pepper and leave to cook for 5 minutes or until all the liquid has been absorbed.", "To serve, place a pile of butternut squash mash onto a large plate, top with the lemon chicken and spoon the spicy curly kale onto the side. Sprinkle with chopped parsley and serve with wedges of lemon."]}, {"isVegetarian": true, "title": "Lemon curd and champagne syllabub", "url": "www_bbc_co_uk_food_recipes_lemoncurdandchampagn_81036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 ginger biscuits", "100ml/3½fl oz champagne or sparkling wine", "284ml/10fl oz double cream", "4 tbsp icing sugar", "8 tbsp lemon curd", "2 tbsp flaked almonds, toasted", "fresh strawberries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Crumble the biscuits into the bottom of a glass dish and moisten with half of the champagne or sparkling wine.", "Begin whipping the cream with the sugar and when it reaches soft peaks, fold in the remaining champagne and swirl in the lemon curd, leaving a marbling of yellow through the cream.", "Spoon the mixture into the glass dish and scatter with the toasted almonds and strawberries."]}, {"isVegetarian": true, "title": "Lemon curd pancakes", "url": "www_bbc_co_uk_food_recipes_lemoncurdpancakes_67267", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp ricotta", "4 tbsp lemon curd", "caster sugar, to dust", "knob of butter", "4 ready-made crêpes"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium setting.", "Place 1 tbsp of ricotta cheese and 1 tbsp lemon curd in the center of each of four ready- made crêpes.", "Fold up to make triangular packets open at the top.", "Place these in an ovenproof dish and spinkle on a little caster sugar. Dot with butter and cook under a medium grill, until the butter melts and the sugar crisps. Serve at once."]}, {"isVegetarian": true, "title": "Lemon curd meringue tart with blackberry compôte", "url": "www_bbc_co_uk_food_recipes_lemoncurdmeringuetar_90798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz sweet shortcrust pastry", "plain flour, for dusting ", "4 lemons, zest and juice only", "4 free-range eggs, beaten", "350g/12oz caster sugar", "110g/4oz butter", "2 free-range egg whites, whisked until soft peaks form when the whisk is removed", "150g/5oz caster sugar", "50ml/2fl oz crème de mure", "75g/3oz caster sugar", "250g/9oz blackberries", "4 sprigs fresh mint, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lemon curd tarts, on a lightly floured work surface, roll out the pastry to a 0.5cm/¼in thickness. Cut out four 12cm/5in discs from the pastry and line each of four 10cm/4in shallow tart cases with one of the pastry discs. Chill in the fridge for 30 minutes.", "Meanwhile, in a bowl, beat together the lemon zest and juice, eggs and caster sugar until well combined. ", "Transfer the mixture to a saucepan and bring to a simmer over a medium heat, then add the butter and whisk until well combined.", "Continue to simmer for 4-5 minutes, stirring constantly, until the mixture has thickened, then pass the mixture through a fine sieve into a clean bowl. Set the sieved lemon curd mixture aside to cool.", "When the tart cases have chilled, line each with a disc of greaseproof paper or aluminium foil and fill with rice or baking beans. Place the four tart cases onto a baking tray and bake in the oven for 12-15 minutes.", "Remove the greaseproof paper and baking beans and return the tart cases to the oven for a further 4-5 minutes. Remove from the oven and set aside to cool slightly.", "When the tart cases have cooled, divide the lemon curd mixture equally among the pastry cases.", "For the meringue topping, sprinkle the caster sugar onto a baking tray and bake in the oven for 4-5 minutes, or until the sugar is hot but has not melted.", "In a large bowl, gradually add the hot sugar, a third at a time, to the whisked egg whites, whisking constantly, until stiff peaks form when the whisk is removed and the mixture is glossy.", "Spoon the whisked egg mixture into a piping bag.", "Starting from the middle and working outwards, pipe spirals of the meringue mixture onto all four tarts until it covers the lemon curd.", "Using a mini blow torch, heat the meringue until pale golden-brown. (Alternatively, preheat the grill to its highest setting and heat the meringue for 2-3 minutes, or until pale golden-brown.)", "For the blackberry compote, in a pan, bring the caster sugar and crème de mure to a simmer.", "Continue to simmer for 1-2 minutes, then add the blackberries and simmer for a further 2-3 minutes, or until the blackberries are tender and the mixture has just thickened.", "To serve, place a tart onto each of four serving plates. Spoon a little blackberry compote alongside each tart. Garnish each with a sprig of mint."]}, {"isVegetarian": true, "title": "Lemon curd tart", "url": "www_bbc_co_uk_food_recipes_lemoncurdtart_67268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet ready-rolled puff pastry", "egg wash", "lemon curd"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Take a packet of ready rolled puff pastry and cut in half (reserve the other half for another recipe). Using one half score a line about 2.5cm/1in inside the edge all round the pastry. ", "Using a fork prick the pastry inside the line all over.", "Brush the pastry outside the line with egg wash and then bake the pie case in the hot oven  for 15-20 minutes until well coloured.", "Allow to cool, then spread over the lemon curd."]}, {"isVegetarian": true, "title": "Lemon layer cake", "url": "www_bbc_co_uk_food_recipes_lemondrizzlecake_91004", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlecake_91004_16x9.jpg", "ingredients": ["4 lemons, juice only", "75g/2¾oz caster sugar", "200g/7oz caster sugar", "200g/7oz unsalted butter, plus extra for greasing", "2 lemons, zest only", "3 free-range eggs, beaten", "200g/7oz self-raising flour, plus extra for dusting", "2 free-range egg yolks", "75g/2¾oz caster sugar", "50g/1¾oz unsalted butter", "2 lemons, juice and zest ", "100g/3½oz mascarpone"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in springform cake tin with butter, then add a small amount of flour, turn the cake tin to coat the sides and bottom and shake out any excess.", "For the lemon drizzle, in a bowl, mix together the lemon juice and sugar until the mixture is well combined and the sugar has melted. Set aside.", "For the sponge, beat the sugar, butter and lemon zest in a mixing bowl until pale and fluffy, using an electric whisk. ", "Gradually add the eggs, whisking after each addition until the egg is completely incorporated into the mixture before adding the next. Carefully fold in the flour using a metal spoon.", "Pour the cake batter into the prepared cake tin and bake in the oven for 30-40 minutes, or until the sponge has risen and is cooked through. (The sponge is cooked through when a skewer inserted into the centre of the cake comes out clean.) ", "As soon as the cake is cooked, remove it from the springform cake tin and prick the top all over with a cocktail stick. Pour over the lemon drizzle mixture to soak the sponge, then set aside to cool on a wire rack.", "For the filling, whisk the egg yolks and sugar together in a pan over a low to medium heat until the sugar has melted. ", "Add the butter, lemon juice and zest, and continue to cook, whisking continuously, for 4-5 minutes, or until the mixture has thickened and is smooth and well combined. Set aside to cool completely. ", "Using a metal spoon, carefully fold the mascarpone into the cooled lemon curd mixture to create a marbled effect. ", "When the sponge has cooled, cut the cake in half horizontally to create two thinner cakes. Spread the lemon filling all over the lower half of the cake, then place the top half (the half that was pricked and soaked in the lemon drizzle) on top."]}, {"isVegetarian": false, "title": "Lemongrass and coconut panna cotta with coconut meringue and mango", "url": "www_bbc_co_uk_food_recipes_lemongrass_and_coconut_49054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "2 lemongrass stems, chopped", "75g/3oz caster sugar", "3 leaves gelatine, soaked in water", "50ml/2fl oz coconut milk ", "75ml/3fl oz coconut liqueur", "1 mango, peeled and roughly chopped", "3 eggs, whites only", "150g/5oz caster sugar", "25g/1oz desiccated coconut, toasted "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the panna cotta, heat 400ml/14fl oz of the cream with the lemongrass and sugar in a saucepan.", "Bring to a boil, stirring occasionally until all the sugar has dissolved, then reduce the heat and simmer until the volume of the liquid has reduced by half.", "Remove from the heat and allow to cool. Once cooled, pour the lemongrass cream through a fine sieve into a bowl.", "Heat the coconut milk in a separate saucepan until just simmering, then remove from the heat.", "Drain the gelatine leaves and add to the warm coconut milk. Stir until dissolved then pour through a sieve into the lemongrass cream. Allow to cool.", "Whisk the remaining cream and coconut liqueur in a bowl  until soft peaks are formed when the whisk is removed. Fold into the cooled cream until totally incorporated and pour into four ramekins or moulds. Set asid in the fridge for at least two hours until set.", "Meanwhile, blend the mango pieces to a fine purée in a small blender. Pass the mango purée through a sieve into a bowl. Set aside until serving.", "For the coconut meringue, preheat the oven to 100C/200F/Gas ¼. ", "Place the egg whites into a clean glass bowl and whisk until soft peaks form when the whisk is removed.", "Whisk in the caster sugar a spoonful at a time until the mixture is glossy and stiff peaks form when the whisk is removed.", "Line a baking tray with parchment paper, or use a silicone mat, and place eight spoonfuls of meringue mixture onto it. Scatter the toasted coconut over the top.", "Bake in the oven and for 1 ½ hours.", "Remove the meringues from the oven and set aside to completely cool.", "To serve, dip the panna cotta into a bowl of hot water briefly or slide a knife around the outside edge carefully. Spoon the mango purée onto the plate. Turn the panna cotta out onto the purée and set the meringue alongside."]}, {"isVegetarian": false, "title": "Lemongrass and ginger mussels", "url": "www_bbc_co_uk_food_recipes_lemongrass_and_ginger_63752", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemongrass_and_ginger_63752_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "2 shallots, finely chopped", "2 lemongrass stalks, tough outer leaves discarded, soft core finely chopped", "2 garlic cloves, finely chopped", "10cm/4in piece fresh root ginger, peeled, finely chopped", "1-2 red chillies (depending on their heat), finely sliced", "200ml/7oz white wine", "330ml/11fl oz coconut water", "160ml/5½fl oz coconut cream", "2kg/4lb 8oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when tapped firmly)", "2 tbsp olive oil", "1 loaf sourdough bread, thickly sliced", "2 tbsp roughly chopped fresh coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a heavy-based, lidded pan over a medium heat. Add the shallots, lemongrass, garlic, ginger and chilli(es) and fry for 4-5 minutes, or until softened but not coloured.", "Increase the heat to high, then pour in the wine, coconut water and coconut cream and bring to the boil. Add the mussels and cover the pan with the lid. Cook for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).", "Meanwhile, heat a griddle pan over a high heat. When the pan is hot, drizzle the olive oil over the bread slices and grill the bread for 30 seconds on each side, or until chargrill marks appear on both sides.", "When the mussels have cooked, stir in the coriander leaves, then season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the mussels, and the cooking liquor, into four bowls. Serve the bread alongside."]}, {"isVegetarian": true, "title": "Lemon drizzle muffins", "url": "www_bbc_co_uk_food_recipes_lemondrizzlemuffins_10460", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlemuffins_10460_16x9.jpg", "ingredients": ["2 eggs, beaten", "85g/3oz caster sugar", "240ml/8fl oz milk", "100ml/3½fl oz vegetable oil", "300g/10oz plain flour", "3 tsp baking powder", "½ tsp salt", "4 lemons, zest only", "50g/2oz icing sugar", "1 lemon, juice only", "sprigs lemon thyme, to garnish (optional)"], "serves": "Makes 8-10 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a muffin tin with paper cases. Mix the egg, sugar, milk and oil in a large bowl. Sift in the flour, baking powder, salt and then add the lemon. Roughly mix.", "Spoon the mixture into the pre-prepared muffin cases.", "Bake for 30-35 minutes until well risen and golden. Cool on a wire rack.", "Make the lemon drizzle topping by mixing together the sugar and lemon juice.", "Spoon the lemon drizzle mixture over the cooled muffins. If desired, decorate the muffins with sprigs of lemon thyme."]}, {"isVegetarian": false, "title": "Lemongrass chicken and aubergine", "url": "www_bbc_co_uk_food_recipes_lemongrass_chicken_and_25172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs, skinless and boneless", "4 tbsp chopped lemongrass (very finely chop the bottom part of the lemongrass)", "2 tbsp vegetable oil", "1 tsp fish sauce", "35g/1¼oz dark palm sugar", "2 tbsp fish sauce", "1 Japanese long aubergine", "10g/⅓oz finely chopped shallot", "1 tbsp chopped spring onion (green part only)", "1 shallot, sliced into rings", "sea salt", "75g/2½oz pickling liqueur (equal quantities of caster sugar and water, flavoured with a smashed garlic clove)", "75g/2½oz Vietnamese chilli paste", "2 lime leaves, thinly sliced ", "jasmine rice, to serve"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken thighs, put the chicken in a bowl and add half the lemongrass and oil, and all the fish sauce. Leave to marinade for 20 minutes, or longer if convenient.", "Preheat the oven to 200C/400F/Gas 6.", "For the fish caramel sauce, heat a flameproof casserole. Add a tablespoon of water and the palm sugar. Cook over a low heat until the sugar has dissolved and the mixture has a syrup-like consistency.", "Set aside to cool for two minutes, then add the fish sauce and marinated chicken. Return to the heat and cook for 5-8 minutes. Transfer to the oven to finish. ", "For the smokey aubergine, heat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Pierce the aubergine all over with a fork and place over an open flame until it is blistered and burnt all over and tender inside. Set aside to cool a little.", "Meanwhile, for the spring onion vinaigrette place all the ingredients in a pan with 460ml/16fl oz water. Heat gently.", "For the smoky aubergine, add the finely chopped shallot and spring onions to the spring onion vinaigrette.", "Place the shallot rings in the deep fat fryer and deep fry until crisp. Drain and place onto a plate lined with kitchen roll to drain.", "To finish, top and tail the aubergine then slice it down the middle lengthways. Scoop out the tender flesh from the burnt skin and divide between serving plates. Use scissors to cut it into bite-sized pieces.", "Take the spring onions out of the vinaigrette and drain them, reserving the vinaigrette for dressing.", "Garnish with the blanched spring onions, crisp shallots and lime leaves. Dress with the vinaigrette. Serve the chicken in the casserole with jasmine rice."]}, {"isVegetarian": true, "title": "Lemongrass parfait with honeycomb and lemongrass toffee apple bananas", "url": "www_bbc_co_uk_food_recipes_lemongrassparfaitwit_92905", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450ml/16fl oz double cream", "3 lemongrass stalks, cut lengthways, crushed lightly", "3 free-range eggs, separated", "150g/5oz caster sugar", "200g/7oz caster sugar", "50ml/2fl oz runny honey", "1 tbsp liquid glucose", "50ml/2fl oz water", "¾ tsp bicarbonate of soda", "vegetable oil, for greasing", "6 apple bananas, peeled and split lengthways (you can substitute with small unripe bananas)", "50g/2oz butter", "75g/3oz light soft brown sugar", "1 lemongrass stalk, cut lengthways, crushed lightly", "150ml/5fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the lemongrass parfait, place 150ml/5fl oz of the double cream into a small saucepan with the lemongrass and bring to a simmer. Set aside to infuse for at least one hour. Once infused, blend the mixture in a food processor to a fine purée. Pass the mixture through a fine sieve and chill in the fridge until cold.", "Meanwhile, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Whisk the egg yolks and 75g/3oz of the sugar together in the bowl until pale and fluffy.", "Continue cooking, whisking continuously, for 5-6 minutes, or until the mixture thickens. ", "Remove the egg and sugar mixture from the heat and whisk in the cold lemongrass mixture. Whisk until the mixture has cooked and is pale and fluffy. Chill in the fridge for 1-2 hours until cold.", "Whisk the egg whites in a bowl, until soft peaks form when the whisk is removed. Slowly whisk in the remaining sugar until the egg whites are glossy.", "Fold the meringue mixture into the lemongrass mixture.", "Whisk the remaining 300ml/10½oz of double cream in a bowl until stiff peaks form when the whisk is removed. Fold into the lemongrass mixture.", "Place six small chefs' rings onto a baking tray lined with greasproof paper and pour the lemongrass mixture into the rings. Tap the side of the rings gently to remove any air, then chill in the freezer for two hours, or until just solid.", "For the honeycomb, place the sugar, honey, liquid glucose and water into a saucepan and bring to the boil. Continue to cook until the temperature reaches 160C (use a sugar thermometer to check this), remove from the heat and whisk in the bicarbonate of soda. ", "Pour the mixture onto a baking tray lined with greasproof paper. Set aside until the mixture becomes hard, then break into very small pieces using a toffee hammer.", "For the toffee apple bananas, heat a frying pan until hot. Add the bananas, cut-side down, and fry for 1-2 minutes, or until caramelised. Remove from the pan and set aside. Add the butter to the pan and heat until the butter foams, then add the brown sugar and cook until the mixture is a caramel colour.", "Add the lemongrass and the cream, bring to the boil, then reduce the heat until the mixture is simmering and simmer for 2-3 minutes, or until golden-brown. Return the bananas to the pan and heat through. discard the lemongrass.", "To serve, dip the top and bottom of each parfait into the honeycomb pieces.", "Using a warm cloth or a chefs' blowtorch, heat the sides of each chefs' ring to loosen the parfait and turn them out onto the centre of six serving plates. Place a couple of pieces of banana on the side of each parfait then spoon the lemongrass toffee sauce over the top."]}, {"isVegetarian": true, "title": "Potato and carrot gratin", "url": "www_bbc_co_uk_food_recipes_lemongratindauphinoi_88899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz double cream", "150ml/5fl oz milk", "1 lemon, zest only", "salt and freshly ground black pepper", "1 potato, peeled and sliced finely on a mandoline", "3 baby carrots, peeled, cut in half lengthways"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the cream and milk in a medium sized saucepan over a low heat and bring to a simmer.", "Add the lemon zest and season with salt and freshly ground black pepper.", "Add the sliced potato and halved baby carrots and bring to the boil. Transfer to an ovenproof dish and place into the oven to cook for 15-20 minutes, or until cooked and golden-brown on top."]}, {"isVegetarian": false, "title": "Lemongrass poussin with red-cabbage salad", "url": "www_bbc_co_uk_food_recipes_lemongrass_poussin_with_17288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemongrass stalks, outer leaves removed, inner core finely chopped", "2 tbsp roughly chopped fresh coriander leaves", "4 garlic cloves, finely chopped", "2 red chillies, finely chopped", "5cm/2in piece fresh root ginger, peeled and grated", "2 limes, juice only", "300ml/11fl oz vegetable oil", "4 poussins", "1 free-range egg yolk", "2 tsp Dijon mustard", "2 tsp walnut vinegar", "sea salt and freshly ground black pepper", "1 small red cabbage, root removed, leaves very finely sliced"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak a large, unvarnished wooden stick suitable for cooking in cold water, preferably overnight. ", "Light the barbecue and allow the flames to flare up and die down, until the coals are glowing red and starting to turn white.", "In a bowl, mix together the lemongrass, coriander, garlic, chillies, ginger and lime juice until well combined. Stir in 50ml/2fl oz of the vegetable oil, then add the poussin and turn to coat them in the marinade, scooping some inside each, too. ", "When the barbecue is ready, slide the poussins onto the stick, securing them with string. ", "Set the stick about 30cm/12in above the barbecue coals and cook for 30-35 minutes (depending on their size), turning every so often, until the poussins are completely cooked through and no trace of pink remains when the thigh meat is pierced in its thickest part with a skewer.", "To make the dressingwhisk the egg yolk, Dijon mustard, walnut vinegar and 250ml/9fl oz water together in a bowl until combined. Gradually whisk in the remaining vegetable oil, whisking all the time, until emulsified. Season, to taste, with salt and freshly ground black pepper.", "Place the red cabbage into a large bowl, then pour over 100ml/3½fl oz of the dressing and mix well. ", "Serve the poussins whole with a pile of the red-cabbage salad alongside. "]}, {"isVegetarian": true, "title": "Lemon, lime and orange polenta cake with orange caramel sauce", "url": "www_bbc_co_uk_food_recipes_lemonlimeandorangepo_86188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb unsalted butter, plus extra for greasing ", "450g/1lb caster sugar", "450g/1lb ground almonds", "6 free-range eggs", "dash vanilla essence", "½ lime, juice only", "½ lemon, juice only", "squeeze orange juice", "2 lemons, zest only", "1 orange, zest only", "1 lime, zest only ", "225g/8oz polenta", "pinch salt", "1 heaped tsp baking powder", "flour, for dusting", "100g/3½oz unsalted butter", "150g/5oz light brown sugar", "1 tsp orange blossom water", "2 oranges, juice only", "mascarpone cheese, to serve"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Beat the butter and sugar together in a bowl until pale and fluffy.", "Add the almonds and mix together well.", "Add the eggs, one at a time, beating to combine well before adding the next egg.", "Add the vanilla essence and the fruit juices and zests and mix well.", "Add the polenta, salt and baking powder and stir well to combine.", "Spoon the cake mixture into a 30cm/12in greased and floured cake tin and transfer to the oven to bake for 45-55 minutes, or until golden and firm. If the top begins to brown too soon, cover with baking paper to protect the top from burning while the rest of the cake cooks. Remove from the oven and allow to cool.", "For the sauce, place the butter and sugar into a pan over high heat and cook until they melt and begin to caramelise.", "Add the orange blossom water and orange juice and stir well. Simmer for four minutes, until combined.", "To serve, slice a piece of cake and place onto a plate. Add a dollop of mascarpone and drizzle the sauce around."]}, {"isVegetarian": true, "title": "Lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_lemonmeringuepie_86114", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonmeringuepie_86114_16x9.jpg", "ingredients": ["225g/8oz plain white flour", "pinch salt", "110g/4oz cold unsalted butter, cubed", "2 tsp caster sugar", "1 medium free-range egg yolk", "100g/3½oz caster sugar", "7 tbsp cornflour ", "4 large lemons, zest and juice only", "6 free-range egg yolks ", "100g/3½oz unsalted butter, melted", "6 medium free-range egg whites", "300g/10½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and salt into a mixing bowl.", "Add the butter to the flour and then rub between your fingertips until a fine breadcrumb consistency is achieved.", "Add the sugar to the flour and butter. Using your hands, mix to a firm dough with the egg yolk and a splash of cold water.", "Wrap the dough in cling film and allow to rest in the refrigerator for 30 minutes before using.", "Preheat the oven to 190C/375F/Gas 5 and grease a 22cm/9in fluted loose-bottomed tin. Place the tin onto a baking tray.", "Roll out the pastry until it's big enough to generously fit the tin, leaving excess pastry falling over the sides of the tin onto the baking tray underneath the tin - don't trim at this stage.", "Line the pastry with greaseproof paper and fill with baking beans. Now trim the excess pastry using a sharp knife. Bake the pastry case blind for about 15-20 minutes or until the pastry is pale golden and dried out - remove the paper and beans for the last five minutes. Lower the oven heat to 150C/300F/Gas 2.", "Meanwhile, for the lemon curd, mix together the sugar, cornflour and enough water to make a paste, in a large bowl.", "Bring 50ml/2fl oz water and the lemon zest to the boil in a small pan.", "Gradually pour the hot liquid onto the cornflour and sugar, whisking all the time until smooth.", "Beat in the egg yolks, lemon juice and butter. Return to the pan.", "Cook over a low heat, stirring all the time, until thickened. Pour into the baked blind pastry case and leave to cool slightly.", "For the meringue, whisk the egg whites in a large bowl with an electric whisk until they form stiff peaks. Whisk in the caster sugar, a spoonful at a time, whisking well and at a high speed between each addition. Transfer the meringue into a piping bag (with a plain nozzle) and pipe the meringue on top of the lemon curd. ", "Bake for about 35-45 minutes until the meringue is crisp on the outside and soft and marshmallow-like underneath. ", "Serve warm or cold in slices."]}, {"isVegetarian": true, "title": "Lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_lemonmeringuepie_89144", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "½ tsp baking powder", "1 tsp caster sugar", "175g/6oz unsalted butter", "pinch salt", "1 free-range egg", "190g/6¾oz caster sugar", "2 lemons, zest and juice only", "1 free-range egg, yolk only, beaten", "1 tbsp cornflour, dissolved in a little milk", "175ml/6fl oz boiling water", "2 free-range eggs, whites only", "pinch salt", "80g/3oz caster sugar"], "serves": "6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Sieve the flour and the baking powder into a bowl and add the sugar and salt. Cut the butter into small pieces and rub into the flour until the mixture resembles fine breadcrumbs.", "Add the egg and mix until a ball of pastry forms. Wrap in cling film and place into the fridge to chill for half an hour.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the pastry from the fridge and unwrap it. Roll out the pastry on a floured work surface to fit a 20cm/8in tart tin.", "Line the tin with the pastry, pushing it well up the sides. Prick the base with a fork, then place a circle of baking parchment over the base of the pastry and cover with ceramic baking beans (or uncooked rice).", "Transfer to the oven and bake blind for 18-20 minutes. Remove from the oven, remove the baking beans or rice and the baking parchment.", "Reduce the temperature of the oven to 150C/300F/Gas 2.", "Meanwhile, for the filling, place the sugar and the zest and juice of the lemons into a small pan.", "Mix the beaten egg yolk with the cornflour mixture in a clean bowl, then add to the pan of lemon and sugar.", "Add boiling water, then simmer over a low heat, stirring constantly, until thickened. Remove from the heat and allow to cool.", "Once the filling mixture has cooled, pour it into the pastry base in its tin.", "For the meringue topping, whisk the egg whites until stiff peaks form when the whisk is removed.", "Whisk in one tablespoon of caster sugar, then add the remaining caster sugar, one tablespoon at a time, whisking constantly.", "Spread the meringue topping over the pie filling and place into the oven to bake for 45-50 minutes, or until the meringue is light golden-brown and crisp on the outside, but soft underneath.", "Remove from the oven and allow to cool. Serve either warm or cold."]}, {"isVegetarian": false, "title": "Lemon mousse", "url": "www_bbc_co_uk_food_recipes_lemonmousse_88962", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonmousse_88962_16x9.jpg", "ingredients": ["4 medium free-range eggs, separated", "250g/8oz caster sugar", "3 lemons, zest and juice only", "5 tbsp cold water", "15g/½oz powdered gelatine ", "300ml/½ pint double cream", "small handful blanched toasted almonds, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using an electric whisk, whisk together the egg yolks, sugar, lemon zest and juice until the sugar has dissolved and the mixture has thickened a little. (If you do not have an electric whisk, whisk by hand in a glass bowl set over a pan of hot water. When the mixture has thickened, remove the bowl from the pan and whisk until cool.)", "Place the cold water into a heavy-based saucepan, sprinkle in the gelatine and place over a gentle heat, without stirring, until the gelatine has melted. Remove from the heat and leave to cool slightly. ", "In a separate bowl, lightly whip the cream until soft peaks form when the whisk is removed. Stir the melted gelatine into the cream and fold into the egg yolk mixture.   ", "Whisk the egg whites in a separate bowl with an electric hand-whisk until soft peaks form when the whisk isremoved. ", "Place the bowl with the egg yolks inside a bigger bowl filled with ice-cold water. Gently fold the whipped egg whites into the egg yolk mixture with a metal spoon. Stir the mixture until it begins to thicken, then pour into a glass bowl and refrigerate for one hour, or until set. ", "Sprinkle the toasted chopped almonds over the top of the mousse and serve."]}, {"isVegetarian": true, "title": "Lemon pancakes with strawberry compôte and vanilla cream", "url": "www_bbc_co_uk_food_recipes_lemonpancakeswithstr_82590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour", "2 free-range eggs", "300ml/10fl oz milk", "1 lemon, zest only", "1 tbsp vegetable oil", "100g/3½oz strawberries, chopped", "½ orange, zest and juice", "1 tsp caster sugar", "50ml/2fl oz champagne ", "50g/2oz clotted cream", "1 tsp icing sugar", "1 vanilla pod, split and seeds scraped out", "mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pancakes, in a large bowl whisk together all of the pancake ingredients, except for the oil, to form a thick batter.", "Heat the oil in a crepe pan, then ladle spoonfuls of the mixture into the frying pan.", "Fry the pancakes for one minute on both sides until coloured, then pile up on a warm plate.", "To make the strawberry compote, in a frying pan heat the strawberries with the orange zest and juice and the sugar.", "Add the champagne and cook down until the liquid volume is reduced by half.", "To make the vanilla cream, mix the clotted cream with the sugar and vanilla seeds.", "Serve the pancakes on a warm plate with the strawberry compote spooned around. Garnish with a spoonful of the vanilla cream and a sprig of mint on top."]}, {"isVegetarian": true, "title": "Lemon posset with lemon shortbread", "url": "www_bbc_co_uk_food_recipes_lemonpossetwithlemon_85812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonpossetwithlemon_85812_16x9.jpg", "ingredients": ["600ml/21fl oz double cream", "150g/5oz caster sugar", "2 large lemons, zest and juice only", "90g/3½oz icing sugar", "185g/6½oz plain flour", "60g/2½oz cornflour", "30g/1oz ground almonds", "250g/9oz butter, cut into cubes, plus extra for greasing", "2 drops almond essence", "75g/3oz lemon curd", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the posset, place the double cream and the sugar into a large pan over a low heat and bring to the boil slowly. Boil for three minutes, then remove from the heat and allow to cool.", "Add the lemon juice and zest and whisk well.", "Pour the lemon cream mixture into six large serving glasses and refrigerate for three hours.", "Preheat the oven to 180C/355F/Gas 4. ", "For the shortbread, sift the icing sugar, flour and cornflour together into a bowl and add the ground almonds.", "Transfer the flour mixture to a food processor. Add the butter and pulse until there are no visible lumps of butter.", "Add the almond essence. Pulse again, then turn the mixture out onto a lightly floured surface and bring together to form a smooth dough.", "Grease a muffin tray with butter.", "Divide the dough up and roll into small balls. Place the balls into the muffin cups, flattening the tops slightly with your fingers. The dough should come about one third of the way up the side of each muffin cup to give a nice proportion to the finished biscuit.", "Transfer to the oven and bake the shortbreads for 8-12 minutes, until they are a light golden colour.", "Remove from the oven, allow to cool slightly, then, using your thumb, make a small indentation into the top of each biscuit. ", "Let the shortbreads cool for a few minutes, then turn the mould over and tap the shortbreads out. (Be gentle, as the biscuits are fragile while they are still warm.)", "When all the shortbreads are baked and cooled, dust the tops with icing sugar.", "Fill the indentations in the biscuits with lemon curd. ", "To serve, place the lemon possets onto plates with a shortbread alongside. Sprinkle a little lemon zest on top, if you want."]}, {"isVegetarian": false, "title": "Lemon, pancetta and rosemary chicken", "url": "www_bbc_co_uk_food_recipes_lemonpancettarosemar_78339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz oven-ready chicken, thawed if frozen, giblets removed", "1 small bunch fresh rosemary", "1 small bunch fresh thyme ", "2 lemons, finely zested ", "80g/3oz pancetta, chopped", "150g/5¼oz mascarpone", "salt and freshly ground black pepper", "2 onions, thickly sliced", "1 tbsp flour ", "100ml/3½fl oz white wine ", "600ml/1pt chicken stock ", "stuffing balls wrapped in bacon"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Wash the chicken and pat dry.  ", "Strip the leaves from half the rosemary and thyme stalks and finely chop.", "In a bowl, combine the lemon zest, chopped rosemary and thyme, pancetta and mascarpone.  Season to taste with salt and freshly ground black pepper.", "Halve the zested lemons and stuff into the chicken's cavity, along with the remaining herb sprigs.  ", "Use your hand to loosen the skin lying over the breast of the chicken, to create a pocket.  Push the mascarpone mixture under the breast skin to create a thick, even layer.", "Put the onion slices into a large, flameproof roasting tin. Place the chicken on top and cover loosely with foil.", "Cook for 1½-2 hours, basting every 30 minutes, until the juices of the bird run clear when the thigh is pierced with a skewer. If necessary, uncover for the last 30 minutes to brown the bird.", "When cooked, take the chicken from the oven, remove from the roasting tin and leave to rest on a platter, covered loosely with foil, for 30 minutes.", "To make the gravy, pour away any excess fat from the roasting tin and discard the onion slices. ", "Set in the roasting tin over a medium heat, then sprinkle over the flour.  Stir through and cook for two minutes.  ", "Slowly whisk in the wine and stock. ", "Bring to the boil, scraping the bits from the bottom of the roasting tin, then simmer over a low heat for 15 minutes.", "Serve the gravy with the chicken and stuffing balls wrapped in bacon."]}, {"isVegetarian": false, "title": "Lemon poached chicken with tomato salsa", "url": "www_bbc_co_uk_food_recipes_lemonpoachedchickenw_71671", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts", "1 stock cube", "1 red onion", "3 cloves garlic", "olive oil", "200g/7oz ripe cherry tomatoes (ideally a mix of red and yellow)", "small bunch of basil", "1 tbsp chopped thyme", "1 tbsp chopped sage", "2 lemons"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Poach the chicken breasts in boiling water with a stock cube and half a lemon for ten minutes. Leave in the hot stock until ready to serve.", "Meanwhile soften the red onion and two chopped cloves of garlic together in a little olive oil. ", "Add the tomatoes and cook for six or seven minutes. ", "When the tomatoes are warmed through, add another glug of olive oil, seasoning, and a small handful of shredded basil. ", "Make the marinade. Place the thyme, sage, the last clove of garlic and a few basil leaves into a blender with the juice of a lemon and equal amounts of olive oil.  Pulse for a few seconds.", "Just before serving, slice the hot chicken into five or six pieces, without cutting all the way through. Drain the poaching liquor and place the semi-sliced chicken back into the dry pan.  ", "Pour the lemon and herb marinade over the chicken and make sure it coats the chicken evenly.  Heat through.", "To serve, spoon the tomato sauce on the bottom of a dish, finish slicing the chicken and place on top.  Drizzle over the remaining marinade and sprinkle on some chopped basil."]}, {"isVegetarian": true, "title": "Lemon potatoes and asparagus", "url": "www_bbc_co_uk_food_recipes_lemonpotatoesandaspa_79828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz new potatoes, bashed with rolling pin", "1 tbsp olive oil", "splash white wine", "1 tsp cumin seeds", "2 tbsp lemon juice", "1 bunch asparagus, ends trimmed", "1 free-range egg yolk", "2 tsp lemon juice", "25g/1oz butter, melted", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the potatoes, heat the oil in a pan over a high heat. Add the potatoes and sauté for five minutes, until browned.", "Add the wine, cumin seeds and lemon juice and simmer for two minutes.", "Cover with a lid and allow to cook through for 10-15 minutes.", "For the asparagus, heat a griddle pan until smoking. Add the asparagus and char-grill for 4-5 minutes, until cooked through.", "Place the egg yolk and the lemon juice in a bowl and whisk together. Add the melted butter and whisk together well, seasoning, to taste, with salt and freshly ground black pepper.", "To serve, place the potatoes into a serving bowl. Place the asparagus on a plate and drizzle with the hollandaise dressing."]}, {"isVegetarian": true, "title": "Lemon rice", "url": "www_bbc_co_uk_food_recipes_lemonrice_86737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonrice_86737_16x9.jpg", "ingredients": ["2½ tbsp vegetable oil", "½ tsp mustard seeds", "pinch fenugreek seeds", "1 tsp split chana dal (also called Bengal gram lentils)", "1 tsp split black gram (also called urad dal or black lentil)", "2-3 dried red chillies, left whole ", "1 rounded tsp chopped fresh ginger", "¼ tsp ground turmeric", "4 tbsp roasted peanuts", "10 curry leaves, torn in half", "salt, to taste", "3 tbsp lemon juice, or to taste", "350g/12oz freshly cooked basmati rice"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick frying pan and add the mustard and fenugreek seeds, the chana dal, black gram and the chillies and stir fry until lightly browned.", "Add the ginger, ground turmeric, peanuts, curry leaves and salt, to taste, and cook for about 40 seconds.", "Stir in the lemon juice and cook for another minute before adding the rice. Stir fry to heat through, being careful not to break up the grains too much.", "To serve, place the rice onto serving plates."]}, {"isVegetarian": true, "title": "Lemon, ricotta and potato cake", "url": "www_bbc_co_uk_food_recipes_lemonricottaandpotat_92836", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, plus extra for greasing", "350g/12¼oz caster sugar ", "250g/9oz mashed potato", "250g/9oz ricotta", "4 free-range eggs", "125g/4½oz flour", "1 tsp baking powder", "2 lemons, juice and grated zest", "pinch ground cinnamon", "1 tbsp poppy seeds", "crème fraîche, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 5. Grease a 24-26cm/9-10in loose-bottomed cake tin with butter. ", "Cream the butter and sugar together in a bowl until pale and fluffy.", "Whisk in the mashed potato and ricotta using an electric whisk for 4-5 minutes, or until very fluffy.", "Crack in the eggs, one at a time, and whisk again until fully incorporated into the mixture.", "Sift the flour and baking powder together, then fold the mixture into the cake batter until well combined.", "Fold in the lemon juice, lemon zest, cinnamon and poppy seeds until well combined.", "Spoon the cake batter into the prepared cake tin. Bake for 1-1¼ hours, checking regularly, until a skewer inserted into the centre of the cake comes out clean. (If the top of the cake starts to darken too much during cooking, cover it loosely with aluminium foil.)", "Set the cake aside to cool slightly, then serve with crème fraîche."]}, {"isVegetarian": false, "title": "Lemon roasted pork chops with a warm aubergine and potato salad", "url": "www_bbc_co_uk_food_recipes_lemonroastedporkchop_70890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp fennel seeds", "1 bulb fennel", "2 Cox's apples, finely chopped", "12 sage leaves, finely chopped", "juice and fruit of 1 lemon", "8 tbsp olive oil", "salt ", "freshly ground black pepper", "2 pork chops", "2 lemons cut into quarters", "2 tsp demerara sugar", "pinch of salt", "2 tsp olive oil", "2 aubergines, cut into wedges", "2 red or Maris Piper potatoes, cubed", "2 red onions", "2 small bunches basil", "2 red chillies", "2 cloves garlic", "2 tbsp red wine vinegar", "8 tbsp olive oil", "8 cherry tomatoes", "salt ", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Grind the fennel seeds. ", "Mix with finely chopped fennel, apple, sage, lemon and lemon juice. ", "Add oil, salt and freshly ground black pepper.", "Heat the oil. Add the wedges of aubergine. ", "Cook slowly, approximately four minutes.  ", "Place the cubed potatoes into a pan of boiling water and cook until soft, approximately eight minutes, and drain.", "Add chilli, garlic and onion to the aubergine, cook for three minutes and take off the heat. Place the hot potatoes in a mixing bowl with the vinegar, olive oil, basil and squashed cherry tomatoes. Pour over the aubergines and their juices. Mix.", "Grill the pork on both sides and then roast at 180C/350F/Gas 4 for ten minutes with the lemons.", "Serve with the salsa and the warm salad."]}, {"isVegetarian": false, "title": "Lemon sole goujons with mushy peas and sweet potato chips", "url": "www_bbc_co_uk_food_recipes_lemonsolegoujonswith_92441", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonsolegoujonswith_92441_16x9.jpg", "ingredients": ["2 sweet potatoes, skin on, cut into wedges", "2 tbsp olive oil", "50g/1¾oz plain flour", "2 free-range eggs", "100g/3½oz fresh breadcrumbs", "½ tsp cayenne pepper", "½ lemon, zest only", "4 fillets lemon sole, skin removed, cut into 1cm/½in strips", "salt and freshly ground black pepper", "4 tbsp olive oil", "200g/7¼oz peas", "1 tbsp crème fraîche", "½ tsp ready-made mint sauce (or 1 tsp chopped fresh mint leaves)", "salt and freshly ground black pepper", "squeeze lemon juice, to taste", "3 tbsp ready-made mayonnaise", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the sweet potato wedges, place the sweet potato wedges into a large roasting tin, then drizzle over the oil, turning the sweet potato wedges to coat them all over. Roast in the oven for 25-30 minutes, turning halfway through cooking, until the sweet potato wedges are crisp and golden-brown and cooked through.", "Meanwhile, for the lemon sole goujons, sprinkle the flour onto a plate. Beat the eggs in a bowl. Mix together the breadcrumbs, cayenne pepper and lemon zest until well combined, then sprinkle the mixture onto a separate plate.", "Season the fish pieces, to taste, with salt and freshly ground black pepper. Dredge each piece of fish first in the flour, then dip it into the beaten egg, then roll it in the breadcrumbs until completely coated.", "Heat the oil in a frying pan over a medium heat until a breadcrumb sizzles and turns golden-brown when dipped into it. Add the coated fish pieces to the pan, in batches, and fry for 2-3 minutes each side until crisp, golden and cooked through. Remove the fried fish pieces from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining fish pieces. ", "Meanwhile, for the mushy peas, cook the peas in a pan of boiling, salted water for 3-4 minutes, or until just tender. Drain well and crush using a fork or potato masher.", "Stir the crème fraîche and mint sauce (or fresh mint) into the crushed peas and season, to taste, with salt and freshly ground black pepper. ", "For the lemon mayonnaise, stir the lemon juice into the mayonnaise until well combined. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the fried fish goujons equally among four serving plates. Spoon a dollop of lemon mayonnaise on top of each portion. Spoon the sweet potato wedges and mushy peas alongside."]}]