[{"ingredients": ["12 chuletas de cordero recortadas en Francia", "125ml / 4½fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cebolla roja, finamente picada", "4 filetes de anchoas saladas, picadas", "8 tomates, picados", "450 g / 1 libra puede mantequilla frijoles, escurridos, enjuagados", "100g / 3½oz de guisantes, frescos o congelados", "1 cucharada de menta fresca, finamente picada", "1 cucharada de vinagre de Jerez", "Pan rallado de 150 g / 5 oz", "75g / 2½ oz de queso parmesano, finamente rallado", "100 g / 3½ oz de mantequilla"], "method": ["Precalentar la parrilla a alto.", "Frote el aceite de oliva sobre las chuletas de cordero y sazone con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y asar las chuletas de cordero durante dos minutos por cada lado. Sacar de la sartén y mantenga caliente", "Para el gratinado, caliente una cucharada de aceite de oliva en una sartén y fría la cebolla a fuego medio durante cinco minutos o hasta que esté suave.", "Agregue la anchoa, los tomates, las judías, los guisantes, la menta, el vinagre de jerez y el aceite de oliva restante y cocine a fuego lento durante otros cinco minutos.", "Con una cuchara la mezcla de frijoles de mantequilla en los moldes", "Para hacer el relleno, mezcle las migas de pan, el parmesano y la mantequilla hasta que estén bien combinados. Espolvorea sobre los frijoles y colócalos debajo de la parrilla durante 2-3 minutos, o hasta que se doren.", "Sirva con las chuletas de cordero junto con el gratén de frijoles de mantequilla."], "url": "www_bbc_co_uk_food_recipes_lamb_chops_with_butter_05845", "title": "Chuletas de cordero con gratén de frijoles de mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cordero de rack, cortado en 8 chuletas", "50ml / 2fl oz de aceite de orujo", "2 ramitas de romero, hojas retiradas", "2 ramitas de tomillo, hojas retiradas", "2 dientes de ajo, en rodajas", "sal marina y pimienta negra recién molida", "1 berenjena pequeña, cortada en 6 piezas a lo largo", "2 cucharadas de aceite de colza", "50g / 1¾oz de pasta rosa harissa", "30g / 1 oz de jarabe de agave", "1 cucharadita de jugo de limón", "75ml / 2½ fl oz yogur de coco", "½ lima, ralladura y jugo", "sal marina", "300g / 10½oz de judías verdes finas", "2 ramitas de menta, hojas retiradas y picadas", "1 diente de ajo, aplastado", "1 chalote de plátano grande, cortado en cubitos", "4 cucharaditas de vinagre de malta", "50ml / 2fl oz de aceite de colza", "50g / 1¾oz de cacahuetes tostados y salados, más o menos picados", "puñado de coriandro", "½ chile rojo, en rodajas finas"], "method": ["Para las chuletas de cordero, marinar en aceite de orujo, romero, tomillo y ajo durante al menos una hora.", "Para la berenjena glaseada harissa, precaliente el horno a 180 ° C / 160 ° Fan / Gas 4 y cubra una bandeja de horno con papel de aluminio.", "Caliente una plancha hasta que esté caliente. Cepille la berenjena con aceite y sazone con sal. Planche bien a cada lado y luego transfiéralo a la bandeja. Cocine en el horno por 15 minutos.", "Mientras tanto mezcle la pasta de harissa, el agave, el jugo de limón junto con 4 cucharaditas de agua y una pizca de sal. Dejar de lado.", "Retire la berenjena del horno y cepille con la mezcla harissa. Vuelve al horno por 5 minutos.", "Mezcle el yogur con el jugo de limón, la ralladura y una pizca de sal. Dejar de lado.", "Para la salsa picante, en una sartén grande de agua hirviendo, salada pula los frijoles durante 1-2 minutos. Refréscalos en agua fría y luego escúrrelos.", "Mezcle la menta, el ajo, la chalota, el vinagre y el aceite en un tazón.", "Agregue los frijoles y reserve.", "Para terminar el cordero, precaliente la parrilla a lo alto. Sazone las chuletas y la parrilla hasta que estén cocidas a su gusto.", "Para servir, coloque la berenjena en un plato grande y salpique el yogur, espolvoree maní y chile y adorne con el cilantro. Sirva con las chuletas de cordero, judías verdes y chutney de menta."], "url": "www_bbc_co_uk_food_recipes_lamb_chops_with_harissa_88196", "title": "Chuletas de cordero con berenjena glaseada con harissa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Berenjenas de 2 kg / 4 lb y 8 onzas, cortadas en rodajas de 5 mm de grosor", "150ml / 5fl oz de aceite de oliva", "2 pimientos rojos, semillas retiradas y rebanadas", "1.5kg / 3lb Paleta de cordero de 5oz, hueso extraído, corte de grasa y cortado en pedazos de 3cm / 1¼in", "1 cebolla grande, finamente picada", "2 x 400 g de tomates picados", "1 cucharadita de azúcar", "1 gran puñado de perejil picado", "1 cucharadita de sal, más extra para rociar", "10 vueltas de peppermill negro"], "method": ["Espolvorear la berenjena con sal y dejar escurrir en un colador durante 1 hora. Retire y seque con un paño de cocina.", "Caliente el aceite en una cazuela con tapa grande a fuego medio. Agregue las berenjenas y los pimientos y cocine, volteándolos de vez en cuando, hasta que estén ligeramente dorados, aproximadamente 10 minutos. Retire con una espumadera y déjelo a un lado.", "Agregue el cordero a la cazuela y cocine a fuego medio, revolviendo con frecuencia, hasta que esté ligeramente coloreado, aproximadamente 8 minutos.", "Agregue la cebolla y cocine por 4 minutos. Agregue los tomates, el azúcar, el perejil, la sal y la pimienta. Cubra y cocine a fuego lento durante 1 hora y media, hasta que la carne esté tierna y la salsa espesa.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Regrese las berenjenas y los pimientos rojos a la sartén, doblándolos un poco a través del estofado. Hornea por 20 minutos."], "url": "www_bbc_co_uk_food_recipes_lamb_casserole_with_94069", "title": "Cazuela de cordero con berenjena", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "1 cebolla, finamente rebanada", "1 puerro, en rodajas finas", "1 hinojo, en rodajas finas", "2 dientes de ajo", "1 ramita de tomillo fresco", "1 cucharadita de semillas de hinojo", "50g / 2oz de mantequilla", "500ml / 18fl oz de cordero o caldo de pollo", "700g / 1lb 9oz de papa", "sal y pimienta negra recién molida", "dash aceite de oliva", "½ bolsa de heno (limpia comiendo heno de la tienda de mascotas y no heno de cama)", "1 costillar de cordero, francés cortado"], "method": ["Para las papas Boulangère, precaliente el horno a 160 C / 325 F / Gas 2.", "Caliente una sartén de base pesada, agregue un poco de aceite, luego agregue la cebolla en rodajas, el puerro, el hinojo, el ajo, el tomillo, las semillas de hinojo y fría por 3-4 minutos.", "Mientras tanto, ponga a hervir el caldo en una cacerola y engrase un plato pequeño a prueba de horno con un poco de mantequilla.", "Cortar las papas finamente en una mandolina y comenzar a estratificar el plato con capas alternas de papa y la mezcla de cebolla, aderezando con sal y pimienta negra recién molida en el medio.", "Para la capa final, coloque las papas en una capa limpia y vierta sobre el caldo caliente.", "Agregue un par de perillas de mantequilla, cubra con papel de aluminio y hornee por una hora. Retire la lámina y cocine por otros 30 minutos o hasta que esté cocida y crujiente.", "Para el cordero, encienda el horno a 200C / 400F / Gas 6.", "Caliente una pizca de aceite de oliva en una cocotte (una cazuela de hierro fundido con una tapa) colocada sobre una estufa y dore el cordero por todas partes. Retire el cordero de la cocotte.", "Agregue el heno y un poco más de aceite, hasta que el heno comience a humear, luego coloque el cordero encima y cúbralo con la tapa.", "Cueza al horno en el horno por 12-15 minutos, o hasta que el cordero sea rosado.", "Para servir, retire el cordero del heno, descanse durante 5-10 minutos, luego talle y sirva con las papas Boulangère."], "url": "www_bbc_co_uk_food_recipes_lamb_cooked_on_hay_64832", "title": "Cordero cocinado en heno, servido con patatas boulangère", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de maíz", "1 cucharadita de pasta de ajo y jengibre", "¼ cucharadita de chile en polvo Kashmiri", "1½ cucharadita de mezcla de especias tandoori masala", "1 cucharadita de semillas de cilantro agrietadas", "¼ cucharadita de sal", "1 cucharadita de yogur griego grueso", "1 lima, solo jugo", "1 x 175 g / 6oz de chuleta de hueso doble de cordero (pregunte a su carnicero por esto)", "1 cucharada de aceite vegetal, para freír", "½ cebolla, pelada", "1 cucharada de aceite de oliva", "¼ cucharadita de semillas de comino", "60g / 2¼ oz de chalotes, cortados en anillos", "10g / ¼ oz de mantequilla", "1 cucharadita de polvo de curry suave", "¼ cucharadita de copos de chile", "4 tallos de suma de choi (u otras verduras orientales), finamente picadas", "100 g / 3½ oz de cebada perlada cocinada (ver consejo)", "Mangetout de 60 g / 2¼ oz, cortado en tiras finas", "50g / 1¾oz de pimientos del piquillo, rebanados", "jugo de lima, al gusto", "puñado de cilantro, picado", "150ml / 5fl oz de yogur griego", "100g / 3½oz de pepino, finamente picado", "sal al gusto", "chaat masala, al gusto (disponible en tiendas de comestibles indias)"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el adobo, combine todos los ingredientes para hacer una pasta. Cubra el cordero y déjelo a un lado durante 10 minutos o más si es posible.", "Para cocinar el cordero, caliente el aceite en un molde para horno y cocine el cordero por todos lados hasta que se dore. Luego coloque la cebolla en el fondo de la sartén y coloque la chuleta encima. Asar durante 5-6 minutos.", "Mientras tanto, para las verduras, caliente el aceite en una sartén grande o saltee la sartén. Una vez caliente, agregue las semillas de comino, chalotes, mantequilla y una pizca de sal. Freír suavemente hasta que los chalotes estén suaves. Agregue el polvo de curry, los copos de chile y un chorrito de agua y cocínelos durante 1-2 minutos. Agrega la suma de choi y tira. Agregue la cebada perlada y cocínela por un minuto más o menos antes de agregar los pimientos mangetout y pequillo. Exprime un poco de jugo de lima y agrega el cilantro.", "Retire el cordero del horno y déjelo reposar durante 5-10 minutos.", "Para la raita, combine todos los ingredientes, pruebe y ajuste el condimento si es necesario.", "Para servir, coloque unas cucharadas de verduras en el medio de los platos de servir. Talla la chuleta en dos pedazos iguales y colócalos al lado de los vegetales. Termina con la raita."], "url": "www_bbc_co_uk_food_recipes_lamb_cutlet_in_tandoori_08184", "title": "Chuleta de cordero en especias tandoori con cebada perlada, verdes y raita", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 2¾oz de fechas frescas", "65 g / 2¼ oz de sultanas", "30 g / 1 oz de raíz fresca de jengibre", "10g de ajo", "1 chile verde", "½ cucharadita de cardamomo molido", "Jugo de limón de 55g / 2oz", "1 cucharadita de comino y polvo de comino negro mezclado 50:50", "30g / 1oz de cebolla marrón, más o menos picada", "100 g / 3½ oz de yogur colado (cuele el yogur en un colador forrado con muselina durante unas horas para eliminar el exceso de humedad)", "8 chuletas de cordero", "exprimir jugo de lima", "2 cucharadas de pasta de ajo y jengibre", "sal al gusto", "30g / 1oz de crema doble", "puñado de hojas de menta", "puñado de hojas de cilantro", "½ cucharadita de pasta de ají verde", "¼ cucharadita de sal negra", "pizca de sal", "½ cucharadita de chaat masala", "½ lima, solo jugo", "aproximadamente 5 cucharadas de yogur colado (cuele el yogurt en un colador forrado con muselina durante unas horas para eliminar el exceso de humedad)", "1 zanahoria pequeña, cortada en dados de 1 cm / ½ pulgadas", "¼ de pepino, pelado, cortado en 1cm / ½ en dados", "5-6 rábanos de desayuno en rodajas", "1 chalote de plátano, cortado en anillos", "1 tomate, picado, sin semillas", "jugo de limón, al gusto", "aceite de oliva, al gusto", "pequeño cilantro picado", "50g / 1¾oz de mantequilla clarificada", "chat massala", "cardamomo molido"], "method": ["En un procesador de alimentos, combine las fechas, sultaninas, jengibre, ajo, chile verde, cardamomo, jugo de limón, comino / comino negro en polvo, cebolla morada y yogurt colado juntos y mezcle hasta que quede suave.", "Coloque las chuletas en un plato poco profundo con el jugo de lima, el ajo y la pasta de jengibre y sal.", "Revuelva la crema doble en los ingredientes mezclados para aflojar y luego agregue la mezcla a las chuletas.", "Cubra con papel de aluminio y deje marinar durante la noche (preferentemente) en la nevera. Retire del refrigerador y deje que las chuletas alcancen la temperatura ambiente cuando esté listo para cocinar.", "Precaliente el horno a 220C / 450F / Gas 7 y precaliente la parrilla a caliente.", "Pinche las chuletas horizontalmente y colóquelas sobre una bandeja de asar. Cocine por debajo de la parrilla por un minuto más o menos en cada lado, luego transfiéralo al horno para cocinar durante 7-8 minutos.", "Retirar del horno, rociar con mantequilla clarificada y dejar reposar. Espolvorear con chat massala y cardamomo.", "Para la salsa picante verde, mezcle la menta, el cilantro y el chile verde en una pasta suave. Agregue la sal negra, la sal normal, el chaat masala y el jugo de lima. Pruebe y agregue sal al gusto. Mezcle el yogur y agregue más al gusto.", "Para la ensalada kachumber, coloca la zanahoria, el pepino, los rábanos, la chalota y los tomates en un tazón. Vístase con jugo de limón, aceite de oliva y cilantro picado. Sazone al gusto.", "Sirva las chuletas con la ensalada y el chutney verde."], "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_marinated_27430", "title": "Chuletas de cordero marinadas con dátiles y especias", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechuga de pollo sin piel de 350g / 12oz, más o menos picada", "1 clara de huevo", "Crema doble de 425 ml / ¾ de pinta", "1 cucharada de cada cebollino fresco picado, estragón, perejil y menta", "5 chuletas de cordero ribeteadas en francés, sin grasa visible", "200 g / 7 oz de cerdo", "buen aceite de colza splash, para cocinar", "mantequilla de perilla, para cocinar", "sal marina y pimienta blanca recién molida", "4 hojas de gelatina grandes u 8 pequeñas", "75 g / 2½ oz de azúcar en polvo", "425 ml / ¾ pinta de jugo de manzana", "150ml / ¼ litro de vinagre de sidra", "1 chalote grande, finamente picado", "menta fresca de manojo pequeño, finamente picada", "3 yemas de huevo", "2 cucharaditas de azúcar en polvo", "1 cucharadita de jugo de limón", "1 cucharada de vino blanco seco", "1 cucharada de vinagre de vino blanco", "1 chalote, en rodajas finas", "175g / 6oz de mantequilla salada", "3 tomates desollados, sin semillas y finamente cortados en cubitos", "2 cucharadas de estragón picado"], "method": ["Para la gelatina de menta, coloca la gelatina en un recipiente poco profundo, solo cúbrela con agua fría y déjala que se ablande durante unos minutos. Mientras tanto, ponga el azúcar, el jugo de manzana y el vinagre en una cacerola a fuego lento hasta que el azúcar se haya disuelto. Suba el fuego y deje casi hervir. Retire la gelatina del agua, exprima el exceso de agua, agregue la gelatina a la sartén y revuelva hasta que se disuelva. Dejar de lado para enfriar. Agregue la chalota picada, la menta y mucha sal y pimienta, cubra y refrigere hasta que cuaje.", "Para las chuletas de cordero, puré la pechuga de pollo en un procesador de alimentos (es posible que necesite usar una espátula para empujar la mezcla hacia las cuchillas varias veces). Agregue la clara de huevo y mezcle de nuevo. Transfiera a un colador colocado sobre un tazón y empuje un poco a la vez usando la parte trasera de un cucharón (no use un tamiz demasiado fino o estará en él todo el día).", "Pon algo de hielo en un recipiente más grande y coloca el recipiente que contiene el pollo sobre esto. Vierta lentamente la crema, batiendo cuidadosamente con una espátula hasta que tenga una consistencia de caída. Doble las hierbas y sazone bien.", "Quenelle una buena cucharada de la mezcla de pollo en la parte superior de cada chuleta de cordero, luego envuelva cada uno en la cáscara de cerdo. Refrigere hasta que sea necesario.", "Cuando esté listo para cocinar, precaliente el horno a 200C / 180C Fan / Gas 6.", "Para la salsa Choron, mezcle rápidamente las yemas de huevo, el azúcar y una pizca de sal en un procesador de alimentos. En una sartén pequeña, caliente el jugo de limón, el vino, el vinagre de vino y la chalota en rodajas y reduzca a la mitad. En otra sartén, derrita la mantequilla y deje que burbujee. Vuelva a encender el procesador de alimentos y cuele el licor reducido en caliente, seguido lentamente por la mantequilla caliente. Vierta la salsa en un tazón, luego mezcle los tomates y el estragón.", "Para terminar el cordero, precaliente una sartén a fuego fuerte y agregue el aceite de colza y la mantequilla. Freír las chuletas en la parte inferior durante 2-3 minutos. Transfiera a un salvamanteles en una bandeja de asar y tueste durante 5 minutos. Deje reposar durante 5 minutos, luego sirva con salsa de Choron y gelatina de menta."], "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_with_70035", "title": "Chuletas de cordero con mousse de pollo y salsa Choron", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 vainas de cardamomo verde, ligeramente magulladas con un rodillo", "12 dientes", "8cm / 3¾in pieza de canela en rama", "2 cucharaditas de semillas de hinojo", "2 hojas de laurel indias", "1½ cucharadita de granos de pimienta negra", "1 cucharadita de jengibre molido", "1.5 litros / 2½ pintas de leche entera", "1kg / 2lb 4oz chuletas de cordero (de un costillar de cordero)", "75ml / 2½fl oz de aceite vegetal", "Harina normal de 250g / 9oz", "2 cucharadas de harina de maíz", "2 cucharaditas de pimienta negra molida", "2 cucharaditas de semillas de hinojo, tostadas y molidas", "1 cucharadita de jengibre molido", "1 cucharadita de cardamomo molido (semillas de 30 vainas verdes)", "1 cucharadita de sal", "3 chiles verdes, finamente picados, con semillas", "2 claras de huevo de gallinas camperas", "pinch chat masala, para terminar"], "method": ["Coloque las cápsulas de cardamomo, el clavo de olor, la canela, las semillas de hinojo, las hojas de laurel, los granos de pimienta negra y el jengibre en una sartén honda y profunda, y agregue la leche y 500 ml de agua. Cocine a fuego lento durante 10 minutos. Agregue las chuletas de cordero y cocine a fuego lento con cuidado durante 10 minutos. Dejar enfriar en el líquido (el cordero aún debe estar rosado en el medio en esta etapa).", "Para la mezcla, tamice la harina y la harina de maíz en un tazón, luego mezcle la pimienta negra, el hinojo, el jengibre, el cardamomo y la sal, seguidos de los chiles. Batir ligeramente las claras de huevo en un recipiente aparte hasta que estén espumosas y luego incorporarlas en los ingredientes secos.", "Cuele la leche y retire las chuletas de cordero de la sartén. Agregue suficiente del caldo lechoso fresco para hacer que una masa delgada tenga la consistencia de una crema individual.", "Agregue las chuletas enfriadas a la mezcla y gírelas para cubrir uniformemente. Caliente el aceite vegetal en una sartén grande a fuego medio. Saca unas chuletas de la mezcla, agrégalas a la sartén (no la sobrecargues) y fríe durante 2-3 minutos por cada lado hasta que queden doradas. Mantenga estos calientes mientras cocina el resto.", "Espolvorear con chat masala y servir caliente."], "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_spiced_with_71223", "title": "Chuletas de cordero condimentadas con hinojo (Shahi Chaap ámbar)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de papas recién nacidas, lavadas y partidas a la mitad pero sin pelar", "3 cucharadas de aceite de oliva", "½ cucharadita de hojuelas de chile seco", "1 cucharadita de menta seca", "½ cucharadita de sal de apio", "8 chuletas de cordero, preferiblemente orgánicas, cortadas de grasa", "Cohete de 100g / 3½ oz", "1 cucharadita de copos de sal marina o ½ cucharadita de sal", "1 cucharada de perejil fresco picado", "1 cucharada de menta fresca picada"], "method": ["Ponga las papas a la mitad en vapor.", "Saca un plato grande - en el cual las chuletas de cordero encajarán en una sola capa - y primero vierte en él el aceite de oliva y espolvorea en los copos de chile, la menta seca y la sal de apio.", "Usando una chuleta de cordero como si fuera una cuchara de madera, humedezca el aceite con sus rociadas un poco, de modo que esté mejor mezclado, luego coloque las chuletas de cordero en una sola capa, gírelas al instante, y déjelas marinar durante 10 minutos.", "Caliente una sartén antiadherente grande, de base pesada, lo suficientemente grande para que quepan todas las chuletas, y luego colóquelas debidamente en ella (el aceite que se adhiere a ellas desde el adobo es suficiente para que se fríen) ) y freír a fuego medio durante cinco minutos. Mientras las chuletas cocinan, verifique que las papas estén tiernas, lo cual deberían ser a estas alturas; en ese caso, apague el fuego debajo de su barco de vapor.", "Usando pinzas (para mayor comodidad), voltee las chuletas y cocine por otros tres minutos. Si va a hacer de esta una comida entera de una sola placa, esparza el fondo de un plato grande para servir con rúcula o cualquier otro follaje que desee, y cuando las chuletas de cordero estén cocidas, pero aún con un color rosa jugoso, retírelas a la ensalada. -plato (o, de hecho, desnudo). Obviamente, cocina por más tiempo si te gusta el cordero bien hecho.", "Incline las papas al vapor en la sartén y fríaselas durante tres minutos, luego délas vuelta y fríelas por otros tres minutos, sacudiendo la sartén de vez en cuando para hacer que se caigan y pongan la grasa caliente y especiada.", "Usando una espátula ranurada o similar, transfiera las papas al plato de chuletas y espolvoree con una cucharadita de copos de sal marina (me gustan mucho estas saladas, pero si tiene gustos más austeros o está alimentando a niños pequeños, disminuya la sal o ignore). el comando por completo) y el perejil picado y la menta."], "url": "www_bbc_co_uk_food_recipes_lamb_cutlets_with_mint_16788", "title": "Chuletas de cordero con menta, chile y patatas doradas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_cutlets_with_mint_16788_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "1 kg / 2 lb 4 onzas de pierna o paletilla de cordero en cubos, o una mezcla de ambos", "2 cebollas picadas", "25 g / 1 oz de raíz fresca de jengibre, pelada", "4 dientes de ajo, pelados", "2 chiles rojos, sin semillas, picados", "10 vainas de cardamomo verde", "1½ cucharadas de comino molido", "1½ cucharadas de cilantro molido", "½ cucharada de cúrcuma molida", "1 x 400 g / 14 oz pueden cortar tomates", "200ml / 7fl oz de caldo de carne", "Lentejas rojas 75g / 2½oz", "3 cucharadas de miel", "sal y pimienta", "arroz hervido"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 3 (ventilador de 130 ° C).", "Calienta dos cucharadas de aceite en una sartén grande. Agregue el cordero y fría en dos tandas hasta que se dore. Retire de la sartén con una espumadera y déjelo a un lado.", "Agregue el aceite restante a la sartén. Agregue la cebolla y fría por 4-5 minutos, o hasta que comience a ablandarse.", "Mientras tanto, coloque el jengibre, el ajo y el chile en un pequeño procesador de alimentos y mezcle hasta que esté finamente picado.", "Golpea las vainas de cardamomo con el extremo de un rodillo para dividir las cáscaras, luego quita las semillas y tritúralas hasta obtener un polvo fino en un almirez y mortero. Agregue a la sartén con las especias restantes y la mezcla de ajo y jengibre.", "Agregue los ingredientes restantes a la sartén y agregue el cordero. Llevar a ebullición, luego tapar y colocar en el horno a fuego lento durante 1½-2 horas, o hasta que estén tiernos. Controle el condimento y sirva con arroz hervido."], "url": "www_bbc_co_uk_food_recipes_lamb_dhansak_79850", "title": "Largo humo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_dhansak_79850_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz% 2020 %% 20fat% 20lamb% 20mince", "Carne de pierna de cordero en cubos de 175g / 6oz, grasa visible eliminada", "2 dientes de ajo, finamente rallados", "½ cucharadita de sal marina escamosa", "½ cucharadita de bicarbonato de soda", "2 cucharaditas de comino molido", "1 cucharadita de pimentón molido", "1 cucharadita de cebolla en polvo", "1 cucharadita de orégano seco", "pizca de copos de chile seco", "pimienta negra recién molida", "100ml / 3% C2% BDfl% 20oz% 200 %% 20fat% 20plain% 20yoghurt", "2 cucharadas de hojas de menta finamente picadas", "pellizco edulcorante granulado", "pizca de sal", "2 tortillas medianas de maíz", "Lechuga iceberg de 40 g / 1½ oz, rallada", "50g / 1¾oz de pepino, en rodajas finas", "2 tomates, en rodajas finas", "½ cebolla roja pequeña, finamente cortada", "6 chiles encurtidos", "salsa picante (opcional)"], "method": ["Precalentar el horno a 240C / 220C Fan / Gas 9.", "Para hacer el donante, coloque todos los ingredientes en un procesador de alimentos y pulse hasta que quede suave. Divida la mezcla por la mitad. Forme cada porción en una bola y ruede entre dos hojas grandes de papel de hornear, hasta que quede muy delgada. Retire la hoja superior de papel de hornear de cada pieza de carne. Hornee durante 3-4 minutos hasta que se doren.", "Retire las bandejas del horno y use con cuidado el soplete de la cocina sobre la superficie del cordero hasta que se ennegrezca en áreas pequeñas. Deje descansar un par de minutos.", "Para hacer la salsa de yogur, mezcle todos los ingredientes y reserve.", "Caliente las tortillas en el estante superior del horno durante 1 minuto y colóquelas entre dos platos calentados.", "Corte el cordero en tiras, de aproximadamente 2.5 cm de ancho. Sirva el cordero sobre las tortillas abiertas y cubra con los ingredientes para servir, salsa de yogurt y salsa picante, si está usando. Rellene generosamente hasta que no pueda envolver."], "url": "www_bbc_co_uk_food_recipes_lamb_doner_75979", "title": "Doner de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_doner_75979_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite", "6 x 200 g / 7 oz de pierna delantera de cordero", "2 cebollas en rodajas", "2 dientes de ajo, aplastados", "1 cucharada de harina integral", "300ml / 10fl oz de vino tinto", "450ml / 16fl oz de caldo de pollo", "1 cucharada de jalea de grosella", "1 cucharada de hojas de romero picadas", "Zanahorias baby de 250 g / 9 oz, cortadas a la mitad a lo largo si son grandes", "250g / 9 oz pastinacas, cortadas en porras", "Nabos para bebés de 250 g / 9 oz, cortados por la mitad a lo largo si son grandes", "un pomo de mantequilla", "sal y pimienta negra recién molida", "2 cucharadas de perejil picado, para decorar"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente 2 cucharadas de aceite en una sartén honda a prueba de horno o en una cazuela a prueba de fuego y dore las patas de cordero a fuego alto durante 5-6 minutos o hasta que estén doradas. Retire con una espumadera y déjelo a un lado.", "Agregue el aceite restante y la cebolla y el ajo y fría a fuego medio durante 3-4 minutos hasta que estén blandos. Mida la harina en un tazón, vierta el vino y bata en una pasta suave. Agregue el caldo a las cebollas, luego agregue la mezcla de vino y harina y, revolviendo continuamente, lleve a ebullición. Agregue la grosella y el romero y revuelva hasta que espese.", "Coloque nuevamente el cordero dorado en la sartén, sazone con sal y pimienta, cubra con una tapa y transfiera al horno para que se cocine durante aproximadamente 2 horas o hasta que el cordero esté tierno y caiga del hueso.", "Cuando esté listo para servir, ponga a hervir una cacerola con agua con sal, agregue las zanahorias, chirivías y nabos y hierva durante 8-10 minutos o hasta que estén tiernas. Desagüe.", "Agregue un tercio de las verduras a la cazuela de cordero y revuelva. Derretir un poco de mantequilla en una sartén y freír las verduras restantes a fuego alto durante 4-5 minutos o hasta que estén doradas. Sazonar con sal y pimienta y retirar de la placa.", "Sirva una pierna delantera por persona con un poco de salsa y verduras de la cacerola y verduras extra fritas en el lateral. Adorne con el perejil picado para terminar."], "url": "www_bbc_co_uk_food_recipes_lamb_fore_shanks_with_73979", "title": "Patas delanteras de cordero con verduras inglesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_fore_shanks_with_73979_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, más o menos picada", "2 chiles verdes regordetes (primero, déjelos marcar si lo prefiere)", "Jengibre fresco de la raíz del pedazo 15g / ½oz, pelado y bruscamente cortado", "4 dientes de ajo, toscamente picados", "1 cucharadita de sal marina en copos", "2 cucharaditas de sal masala", "¼ cucharadita de chile en polvo", "1 cucharada de puré de tomate", "pimienta negra recién molida", "600g / 1lb 5oz de carne picada magra de cordero", "3 cucharadas colmadas de hojas de cilantro frescas finamente picadas", "yogur natural espeso y cilantro fresco, para servir (opcional)", "3 cucharadas de ghee o aceite de girasol", "2 cebollas, más o menos picadas", "4 dientes de ajo, finamente picados", "25 g / 1 oz de jengibre fresco de raíz, pelado y finamente picado", "½ -1 cucharadita de chile en polvo", "1 cucharada de sal masala", "4 tomates grandes maduros, toscamente picados", "1 cucharada de puré de tomate", "1 cucharadita de sal marina en copos", "½ cucharadita de azúcar en polvo", "500ml / 18fl oz de caldo de cordero (hecho con ½ cubito de cordero)", "1 ramita de canela", "2 hojas de laurel", "arroz cocido", "yogur natural espeso", "hojas frescas de cilantro"], "method": ["Coloque la cebolla, los chiles, el jengibre, el ajo, la sal, el garam masala, el chile en polvo y el puré de tomate en un procesador de alimentos. Sazonar con mucha pimienta negra recién molida. (Para un gran sabor, agregue más de lo que imagina que necesitará).", "Mezcle los ingredientes en una pasta tan suave como pueda obtenerlo. Tendrá que quitar la tapa del procesador de alimentos y empujar la mezcla hacia abajo con una espátula 2-3 veces. Agregue el cordero y mezcle una vez más. Transfiera a un recipiente y agregue el cilantro. Cubra el plato con film transparente y deje enfriar por 1-3 horas, o durante la noche, para permitir que la mezcla se endurezca y que la carne absorba todas las maravillosas especias.", "Para hacer la salsa, caliente el ghee (o aceite) en una sartén antiadherente grande o saltee la sartén y fríe con cuidado las cebollas, el ajo y el jengibre durante unos 10 minutos, o hasta que estén blandos y ligeramente dorados, revolviendo regularmente. Agregue el chile en polvo y el garam masala y cocine durante 20-30 segundos, revolviendo constantemente.", "Agregue los tomates picados y cocine por 3-4 minutos a fuego alto, o hasta que ablanden y liberen su jugo, revolviendo constantemente. Agregue el puré de tomate y espolvoree con sal y azúcar y vierta sobre el caldo de cordero. Sazonar con mucha pimienta negra molida, agregar la canela y las hojas de laurel y llevar a fuego lento. Cubra la salsa sin apretar con una tapa y cocine durante 20 minutos, revolviendo ocasionalmente.", "Mientras la salsa hierve a fuego lento, prepara las albóndigas. Tome una pequeña porción de mezcla de carne a la vez y enrolle en una bola suave, un poco más pequeña que una nuez en su caparazón. Deberías poder hacer alrededor de 24 bolas. Si tu carne picada se vuelve un poco pegajosa, rueda con las manos mojadas o desempolva tus manos con harina mientras rueda. Poner en un plato tan pronto como se lance.", "Retire la sartén con la salsa del fuego después de que hayan transcurrido 20 minutos y deseche la ramita de canela y las hojas de laurel; serán fáciles de extraer con un tenedor o pinzas. Mezcle la salsa con una batidora hasta que esté lo más suave posible. (Si no tiene una batidora, déjela enfriar durante unos minutos y luego transfiérala a un procesador de alimentos y mezcle con un puré).", "Regrese la salsa al fuego y agregue 200 ml / 7 fl oz de agua. Llevar a fuego lento a fuego lento. Coloque todas las albóndigas suavemente en la salsa burbujeante y vuelva a hervir a fuego lento. Cocine, sin tapar, por otros 30-35 minutos, o hasta que las albóndigas estén blandas y la salsa espesa, revolviendo regularmente. Si la salsa se reduce demasiado o comienza a pegarse en el fondo de la sartén, agregue un poco de agua adicional y continúe cocinando. Ajusta la sal y la pimienta al gusto.", "Sirve las albóndigas con arroz, cubierto con yogurt natural espeso y hojas frescas de cilantro si quieres."], "url": "www_bbc_co_uk_food_recipes_lamb_kofta_curry_60692", "title": "Cordero kofta de cordero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de carne de cordero magra", "50 g / 1¾oz de camote, rallado", "50g / 1¾oz de pan rallado fresco", "50g / 1¾oz de yogur natural al estilo griego", "2 dientes de ajo, aplastados", "2 cucharaditas de cilantro molido", "1 cucharadita de comino molido", "2 cucharadas de cilantro fresco finamente picado", "2 cucharadas de menta fresca finamente picada", "1 manojo de perejil, finamente picado", "aceite de oliva, para engrasar", "sal marina y pimienta negra recién molida", "200g / 7oz de yogur natural al estilo griego", "3 cucharadas de tahini", "2 limones, solo jugo", "4 dientes de ajo, aplastados", "¼ cucharadita de chile en polvo", "1 cucharadita de sal marina", "8 hojas de gema pequeña y crujiente", "1 cucharadita de menta fresca, finamente picada", "1 cucharadita de cilantro fresco, finamente picado", "1 cucharadita de perejil flatleaf, finamente picado"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para los koftas, mezcle todos los ingredientes hasta e incluyendo el perejil y sazone con sal y pimienta. Forma la mezcla en 16 óvalos.", "Engrase ligeramente una bandeja de horno con el aceite. Coloque las koftas en la bandeja y hornee por 30-35 minutos, volteándolas después de 20 minutos.", "Para la salsa de tahini, mezcle todos los ingredientes en un tazón. Agregue 3-6 cucharadas de agua si prefiere un baño más suelto.", "Para servir, coloque dos hojas de lechuga en cada una de las cuatro placas, cubra con cuatro koftas, rocíe con la salsa de tahini y espolvoree con las hierbas. Enrolla las hojas y disfruta."], "url": "www_bbc_co_uk_food_recipes_lamb_kofta_with_spicy_47334", "title": "Koftas de cordero con salsa de tahini picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb de carne picada de cordero", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "1 cucharadita de cúrcuma molida", "1 diente de ajo, aplastado", "1 lima, solo jugo", "1 chile verde, finamente picado", "2-3 cucharadas de cilantro recién picado", "sal y pimienta", "4-5 cucharaditas de aceite vegetal, para freír", "panes planos, para servir", "2 berenjenas", "2 dientes de ajo", "4 cucharadas de tahini", "2 limones, solo jugo", "1 cucharadita de comino molido", "2 cucharadas de aceite de oliva", "2 cucharadas de perejil recién picado"], "method": ["Para los koftas, mezcle la carne picada con todos los demás ingredientes, excepto el aceite, en un tazón grande y use sus manos para hacer rondas del tamaño de una pelota de golf, que luego puede moldear en formas de kofta largas como cilindros. Coloque los koftas en una bandeja para hornear y transfiéralos a la nevera para que se enfríen durante un par de horas.", "Caliente el aceite vegetal en una sartén honda hasta que esté caliente. Fríe ligeramente los koftas (alternativamente cocínelos en una barbacoa caliente o en un horno precalentado a 200C / 400F / Gas 6 durante 20-25 minutos). Cuando los koftas estén cocidos, déjelos a un lado para que descansen hasta que estén listos para servir.", "Mientras tanto, haz el baba ganoush. Ase las berenjenas directamente sobre una llama de gas en la placa hasta que las pieles estén ennegrecidas (o use un soplete de chef si tiene una) teniendo cuidado de no quemarse. Deje enfriar un poco, luego quite la piel carbonizada.", "Ponga la carne de berenjena en un procesador de alimentos o licuadora con el ajo, tahini, jugo de limón, comino y un poco de sal y pimienta y mezcle hasta obtener una pasta áspera. Transfiera a un plato para servir, rocíe con el aceite de oliva y espolvoréese con el perejil.", "Sirva los koftas cocidos con baba ganoush y panes planos."], "url": "www_bbc_co_uk_food_recipes_lamb_koftas_and_baba_53755", "title": "Cordero koftas y baba ganoush", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["550g / 1lb 4oz cordero picado", "sal al gusto", "½ cucharadita de maceta de tierra", "2 chiles rojos picados", "4 dientes de ajo, aplastados", "1 cebolla roja pequeña, finamente picada", "1 pimiento rojo, finamente picado", "puñado de cilantro fresco, picado", "1 cucharadita de semillas de cilantro, tostadas y molidas", "1 cucharadita de semillas de comino, tostadas y molidas", "1 cucharadita de semillas de hinojo, tostadas y molidas", "1 cucharadita de granos de pimienta, tostados y molidos", "4 cucharadas de aceite de girasol", "1 cebolla, finamente picada", "600g / 1lb 5oz de tomates picados en lata", "Fechas de 250g / 9oz, picadas", "2 manzanas Granny Smith, peladas, sin corazón y picadas", "75g / 2½ oz de azúcar moreno oscuro", "3 cucharadas de melaza de blackstrap", "175ml / 6fl oz de vinagre de malta", "100g / 3½oz de paquete de pulpa de tamarindo sin semillas", "4 cucharadas de salsa Worcestershire", "2 cucharaditas de mostaza en polvo", "1 cucharadita de sal marina", "6 dientes de ajo, picados", "1 cucharadita de pimienta de cayena", "7cm / 3 en pieza de casia o canela", "1 cucharadita de pimentón", "6 clavos enteros", "½ cucharadita de granos de pimienta negros enteros", "½ cucharadita de cardamomo molido", "2 ramitas de estragón fresco, solo hojas, finamente picadas", "½ pepino, pelado y rebanado", "2 cucharadas de menta fresca picada", "200g / 7oz de espesor de yogurt natural", "2 cucharadas de gelatina de menta", "1 diente de ajo, picado", "pizca de chile en polvo", "1 limón, solo jugo", "panes planos, para servir"], "method": ["Para las koftas de cordero, ponga todos los ingredientes, aparte del aceite, en un tazón grande y mezcle para combinar. Forma en formas de salchichas. Si tiene tiempo, déjelos reposar en la nevera durante media hora.", "Calentar una sartén plana. Engrase los koftas y cocine en la sartén de la plancha y cocínelos durante 5-6 minutos. Siga girando hasta que esté cocido.", "Para la salsa marrón, coloque todos los ingredientes, a excepción del estragón, en una sartén grande y amplia y agregue suficiente agua para cubrir los ingredientes. Cocine durante aproximadamente una hora y media hasta que se reduzca a una consistencia de pensamiento. Retire del fuego y mezcle hasta que quede suave. Termina con el estragón fresco.", "Para la ensalada de pepino y menta, coloque todos los ingredientes en un tazón grande y mezcle.", "Sirva los koftas de cordero con panes planos, la salsa marrón y la ensalada."], "url": "www_bbc_co_uk_food_recipes_lamb_koftas_with_brown_86271", "title": "Koftas de cordero con salsa marrón y ensalada de pepino y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pierna de cordero en cubos magra de 600 g / 1 lb 5 oz", "150ml / 5fl oz de salsa de soja oscura", "6 cucharadas de miel clara", "4 cucharaditas de canela molida", "3 cucharaditas de comino molido", "2 dientes de ajo, aplastados", "aceite vegetal, para freír", "2 cabezas redondas de lechuga o 3 cabezas Lechuga Little Gem, hojas separadas", "1 x 400 ml de leche de coco de estaño", "250 g / 9 oz de mantequilla de maní suave", "2 cucharadas de miel clara", "cacahuetes sin sal, picados, para servir", "4 cebollas de primavera, picadas, para servir"], "method": ["Usando un mazo de carne o un rodillo, aplana cada trozo de cordero con algunos golpes. Agregue la carne a un tazón con la salsa de soja, la miel, la canela, el comino y el ajo. Con las manos, mezcle bien para que la miel se distribuya uniformemente en la mezcla. Cúbralo con una película adhesiva y déjelo en el refrigerador para marinar durante al menos 2 horas o durante la noche.", "Para la salsa de maní, caliente la leche de coco, la mantequilla de maní y la miel en una cacerola a fuego medio-bajo. Llevar a fuego lento a fuego lento, revolviendo constantemente, hasta que la mantequilla de maní y la miel se disuelvan en la leche de coco. Dejar de lado hasta que sea necesario.", "Calentar una sartén grande a fuego medio-alto y rociar con un poco de aceite vegetal. Sacudiendo el adobo sobrante, fríe el cordero poco a poco para asegurarse de no abarrotar la sartén.", "Mientras tanto, vuelva a calentar suavemente la salsa de maní hasta que esté tibia.", "Sirva la carne en un plato con las hojas de lechuga, los cacahuetes y las cebolletas y la salsa de maní en un tazón. Para armar una envoltura, tome una hoja de lechuga, coloque un cordero encima, rocíe con salsa de maní y cubra con nueces y cebolletas. Enrolla y disfruta"], "url": "www_bbc_co_uk_food_recipes_lamb_lettuce_wraps_with_40131", "title": "Envoltura de lechuga de cordero con salsa de maní", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "2 cucharadas de semillas de cilantro", "2 cucharadas de semillas de alholva", "1 cucharada de semillas de mostaza", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 palito de canela, roto en pedazos", "5 dientes", "1 cucharada de cúrcuma molida", "1½-2kg / 3lb 5oz - 4lb 8oz cordero hombro", "aceite de oliva, para lloviznar", "1 guindilla verde", "2 dientes de ajo", "1.5cm / ¾in en pieza de raíz de jengibre fresco, pelado", "1 cebolla, finamente rebanada", "12 hojas de curry", "3 vainas de cardamomo", "2 hojas de laurel", "400g de tomates cortados en lata", "200ml / 7fl oz de caldo de carne", "2 cucharaditas de jugo de tamarindo", "2 cucharadas de cilantro fresco picado", "sal y pimienta negra recién molida", "Harina de chapati 325 g / 11½ oz, más extra para quitar el polvo (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "1½ cucharadita de sal", "1 cucharada de aceite", "200g / 7oz de arroz basmati", "1 cucharada de hojas de cilantro"], "method": ["Ponga todos los ingredientes de curry en polvo en un molinillo de especias y muele a un polvo fino. (Alternativamente, use una mano de mortero).", "Precalentar el horno a 170C / 150C Fan / Gas 2.", "Sazone el cordero con sal y pimienta y 2 cucharadas de la pasta de curry. Coloque el cordero en un plato resistente al horno y rocíe con aceite de oliva. Cocine en el horno durante 2-4 horas.", "En un procesador de alimentos pequeño, mezcle el chile, el ajo y el jengibre en una pasta, agregando un chorrito de agua si es necesario.", "Coloque una sartén a fuego alto y agregue las cebollas (agregue un chorrito de aceite a la sartén si está demasiado seca). Freír por 2-3 minutos, o hasta que se suavice y comience a colorear.", "Agregue 2½ cucharadas de polvo de curry a la sartén junto con el ajo, el chile y la pasta de jengibre, las hojas de curry, el cardamomo y las hojas de laurel. Remover bien y cubrir con los tomates picados, caldo de carne y jugo de tamarindo. Sazonar, al gusto, con sal y pimienta negra recién molida. Cubra la olla con una tapa y cocine a fuego lento durante 30-40 minutos.", "Una vez que el cordero se haya cocinado, déjelo reposar durante al menos 20 minutos. Triture la carne de cordero y revuelva en la salsa. Agregue el cilantro justo antes de servir.", "Para los chapatis, tamice la harina y la sal en un tazón grande y mezcle gradualmente aproximadamente 200 ml / 7 fl oz de agua para formar una masa blanda (es posible que no necesite toda el agua). Cubra y reserve para descansar por 10 minutos.", "Convierta la masa en una superficie de trabajo enharinada, amase ligeramente y divídala en 12 bolas. Estirar cada bola tan finamente como sea posible. Calentar una sartén a fuego alto y agregar el aceite. Cocine los chapatis de a uno por vez, friéndolos durante 1-2 minutos en ambos lados o hasta que estén dorados e hinchados.", "Coloque el arroz en una cacerola y agregue 350 ml / 12 fl oz de agua salada y deje que hierva. Cocine a fuego lento hasta que el agua se haya evaporado, luego retírela del fuego, cúbrala con una tapa y déjela que hierva durante 10 minutos. Cuando el arroz esté cocido, revuelva a través de las hojas de cilantro", "Para servir, ponga el curry en recipientes de servir poco profundos y sirva el arroz y los chapatis en un lado."], "url": "www_bbc_co_uk_food_recipes_lamb_madras_with_59455", "title": "Cordero al curry con arroz cilantro y chapatis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2.5kg / 5½lb hombro de cordero", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de semillas de cilantro", "2 cucharadas de semillas de alholva", "1 cucharada de semillas de mostaza", "1 cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "1 cucharadita de pimienta negra", "1 ramita de canela", "5 dientes", "1 cucharada de cúrcuma molida", "1 guindilla verde", "2 dientes de ajo, pelados", "1½cm / ¾in raíz de jengibre, pelado", "1 cebolla, finamente rebanada", "2 cucharadas de aceite vegetal", "12 hojas de curry", "3 vainas de cardamomo", "2 hojas de laurel", "400g / 14oz de tomates picados", "200ml / 7fl oz de caldo de carne", "2 cucharaditas de pasta de tamarindo", "Papas de 500 g / 1 lb 2 oz, cortadas en cubos de 2 cm / 1 in", "4 cucharadas de aceite vegetal", "½ cucharadita de semillas de mostaza", "½ cucharadita de chile en polvo", "¼ cucharadita de cúrcuma molida", "2 cucharadas de cilantro fresco, toscamente picado"], "method": ["Para el hombro de cordero asado, precaliente el horno a 170 C / 325 F / Gas 3.", "Frote el hombro del cordero con aceite de oliva, sazone con sal y pimienta negra recién molida y reserve.", "Mientras tanto, para preparar el polvo de curry de Madras, coloque el cilantro, el fenogreco, la mostaza, el comino, las semillas de hinojo, los granos de pimienta negra, la canela y el clavo de olor en un molinillo de especias y muela hasta formar un polvo. Agregue la cúrcuma.", "Coloque el chile, el ajo y el jengibre en un procesador de alimentos pequeño y mezcle hasta que se forme una pasta. Si no se combina, agregue una pequeña cantidad de agua.", "Caliente el aceite vegetal en una olla con tapa. Agregue el cordero y fría en todos los lados hasta que se dore. Retire el cordero de la cazuela y déjelo a un lado.", "Agregue la cebolla a la cacerola caliente y fría hasta que esté suave y empiece a colorear. Agregue 2½ cucharadas de polvo de curry de Madras, luego el ajo, el chile y la pasta de jengibre y las hojas de curry, el cardamomo y las hojas de laurel y revuelva.", "Agregue el cordero a la olla y cubra con los tomates picados, caldo y tamarindo y sazone con sal y pimienta. Coloque una tapa y asar el cordero en el horno durante 3-4 horas, hilvanar cada hora más o menos con los jugos en la bandeja de asar. Cocine hasta que la carne esté tierna y se caiga del hueso.", "Una vez cocido, retire el cordero de la salsa y cocine a fuego lento el líquido restante hasta que se reduzca en volumen para hacer una salsa espesa.", "Con un tenedor, triture el cordero y agréguelo a la salsa.", "Para las papas de Bombay, coloque las papas en agua fría y llévelas a ebullición. Cocine por 5-8 minutos y escurra.", "Caliente una sartén grande y agregue el aceite. Una vez caliente, agrega las semillas de mostaza. Cuando comiencen a aparecer en la sartén, agregue el chile en polvo y la cúrcuma y agregue las papas. Cuide sus ojos y cara mientras las semillas de mostaza se están reventando.", "Cocine por 5-8 minutos, o hasta que las papas absorban las especias.", "Para servir, coloque el cordero Madras en un plato con las papas al lado. Adorne con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_lamb_madras_with_bombay_09160", "title": "Cordero madras con bombay patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lamb_madras_with_bombay_09160_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de colza", "55 g / 2 oz de mantequilla, más 1 cucharada para la salsa", "4 riñones de cordero, cortados y partidos por la mitad", "10 filetes de lápiz de cordero", "250ml / 9fl oz de caldo de pollo", "1 cucharada de vinagre balsámico", "1 cucharada de menta fresca picada", "1 cucharadita de salsa de menta", "1 cucharadita de mostaza integral", "1/2 chalote, finamente picado", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una sartén a fuego medio, agregar 25 g / 1 oz de la mantequilla y freír las mitades de los riñones durante tres minutos, volteándolas, colorearlas, luego sacarlas de la sartén y mantenerlas calientes.", "Agregue un poco más de mantequilla de 25g / 1oz a la sartén y fría los filetes de lápiz por tres minutos, volteándolos, para darles color, manteniéndolos insípidos. Sacar de la sartén y mantenga caliente.", "Retire el exceso de aceite de la sartén, luego agregue el caldo y el vinagre y reduzca. Agregue la menta, la salsa de menta, la mostaza y el chalote y mezcle.", "Justo antes de servir, agregue una cucharada de mantequilla en la salsa junto con el perejil y los jugos de carne de los filetes de lápiz.", "Divida el cordero y los riñones entre platos y sírvalos con la salsa y los vegetales de temporada."], "url": "www_bbc_co_uk_food_recipes_lamb_pencil_fillets_with_11465", "title": "Filetes de cordero con riñones y vinagre balsámico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]