[{"ingredients": ["150ml / 5fl oz de grasa", "75g / 2% C2% BDoz% 20 calidad buena% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20broken% 20into% 20pieces% 20", "100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "275 g / 10 oz de azúcar morena clara", "2 huevos de gallinas camperas, ligeramente golpeados", "Harina de 175g / 6oz de auto crianza", "100g / 3½oz de chocolate con leche, roto en pedazos", "50g / 2oz de mantequilla sin sal", "2 cucharadas de cerveza negra", "100g / 3½oz de azúcar glasé", "50 g / 2oz de avellanas tostadas picadas, para decorar"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase un molde para pastel de 20 cm / 8 in con mantequilla.", "Para el pastel, hierva un poco de agua en una sartén. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego suspenda un recipiente resistente al calor sobre el agua, asegurándose de que el fondo del recipiente no toque el agua.", "Agregue las piezas de chocolate negro y fuerte al recipiente resistente al calor y caliente suavemente hasta que se derrita. Una vez derretido, retire el recipiente del fuego y déjelo enfriar.", "En otro recipiente, bata la mantequilla y el azúcar hasta que estén suaves, esponjosos y bien combinados, utilizando un procesador de alimentos o un batidor eléctrico.", "Agregue los huevos uno por uno, batiendo bien entre cada adición.", "Vierta la mezcla fría de chocolate y stout y bata hasta que esté bien combinada. Dobla la harina.", "Coloque la mezcla para pasteles en la lata preparada y hornee en el medio del horno durante 30-35 minutos, o hasta que una brocheta insertada en el centro del pastel salga limpia.", "Retire la torta del horno y déjela enfriar en la lata durante unos minutos, luego retírela de la lata y déjela enfriar por completo en una rejilla.", "Mientras tanto, para la formación de hielo, repita el proceso de llevar un poco de agua a ebullición en una sartén. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento, luego suspenda un recipiente resistente al calor sobre el agua, asegurándose de que el fondo del recipiente no toque el agua.", "Agregue el chocolate, la mantequilla y la cerveza negra al bol, revolviendo hasta que se derrita. Retire el recipiente del fuego y deje la mezcla a un lado para que se enfríe un poco.", "Cuando la mezcla de chocolate derretido se haya enfriado, transfiéralo a un procesador de alimentos, agregue el azúcar glas y el pulso hasta que esté suave y bien combinado. (Alternativamente, mezcle el azúcar glas con una batidora eléctrica de mano).", "Cuando la torta se haya enfriado por completo, extienda el glaseado uniformemente sobre la parte superior y los lados, luego espolvoree sobre las avellanas picadas. Cuando la formación de hielo se haya secado, sirva."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_ale_cake_09939", "title": "Pastel de chocolate y cerveza fuerte", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_ale_cake_09939_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "5 cucharadas de leche", "Harina de auto aumento de 150g / 5oz", "2 cucharadas de azúcar en polvo", "pizca de sal", "75g / 3oz de trocitos de chocolate negro", "aceite de girasol, para freír", "helado de mantequilla, para servir", "jarabe de arce o miel clara, para servir"], "method": ["Batir los huevos y la leche.", "Coloque la harina común, el azúcar impalpable y una pizca de sal en un tazón grande, luego haga un pocillo en el centro, vierta el líquido y bata con un batidor de mano hasta que quede suave.", "Agregue las chispas de chocolate, luego cocine cucharadas de la mezcla en una sartén antiadherente, usando solo un chorrito de aceite de girasol, durante 1-2 minutos por cada lado hasta que se hinchen y se doren.", "Apila y sirve con una bola de helado de caramelo y una llovizna de jarabe de arce."], "url": "www_bbc_co_uk_food_recipes_chocchippuffypancake_65968", "title": "Panqueques mullidos con trocitos de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocchippuffypancake_65968_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de cerveza oscura, más 4 cucharadas para la guinda", "50 g / 1¾oz de cacao en polvo", "Mantequilla 110g / 4oz, ablandada", "275g / 9¾oz azúcar moreno oscuro y suave", "2 huevos grandes de gallinas camperas", "Harina normal 175g / 6oz", "¼ cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "220 g / 8 oz% 20 calidad buena% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)% 20", "220g / 8oz de azúcar glas", "100 g / 3½ oz de mantequilla suave", "Crema doble 250ml / 9fl oz", "50g / 1¾oz de azúcar mascabado", "Extracto de malta 50g / 1¾oz", "pizca de sal"], "method": ["Para la torta de chocolate y ale, engrase y forme una lata de pan de 25 cm / 10 pulg. Precalentar el horno a 180C / 350F / Gas 4.", "Mezcle lentamente la cerveza oscura en el polvo de cacao para formar una pasta.", "En un recipiente aparte, bata la mantequilla y el azúcar moreno oscuro juntos hasta que estén suaves y cremosos, luego agregue los huevos uno por uno, batiendo entre cada adición.", "Agregue la mezcla de cacao y cerveza. Tamizar en la harina, el polvo de hornear y el bicarbonato de soda, revolviendo entre cada adición.", "Vierta la masa de la torta en la lata preparada y hornee durante 30-35 minutos, o hasta que esté suave al tacto. Dejar enfriar sobre una rejilla.", "Derretir el chocolate en un recipiente resistente al calor suspendido sobre una olla de agua hirviendo.", "Batir el azúcar glas y la mantequilla para formar una pasta suave. Agregue cuatro cucharadas de cerveza negra y luego doble el chocolate derretido.", "Para el mascabado y la crema de malta, mezcle todos los ingredientes en un tazón grande hasta que estén gruesos y suaves.", "Cuando la torta se haya enfriado por completo, córtela en rodajas.", "Sirva con la cerveza y el glaseado de chocolate sobre el pastel y una cucharada de mascabado y crema de malta al costado."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_ale_cake_72348", "title": "Tarta de chocolate y cerveza con crema de malta moscovado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 yemas de huevo de rango medio", "120 g / 4 oz de azúcar en polvo", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida longitudinalmente, semillas raspadas", "150 g / 5½ oz de moras frescas", "300 g / 10½ oz de chocolate negro, en trozos", "150g / 5½oz de mantequilla sin sal", "6 huevos medianos de granja, separados", "50 g / 1 oz de azúcar en polvo", "50 g / 1¾oz de mantequilla sin sal", "125 g / 4½ oz zarzamoras"], "method": ["Para el helado de vainilla, bata las yemas de huevo con 60 g / 2¼ oz de azúcar en polvo en un tazón grande hasta que quede espeso y cremoso.", "Coloque el resto del azúcar impalpable, la leche, la crema y las semillas y vainas de vainilla en una sartén y deje que hierva. Vierta la leche caliente en las yemas batidas y revuelva bien.", "Regrese la mezcla a la sartén y cocine a fuego muy lento, revolviendo constantemente con una espátula, hasta que la mezcla tenga un grosor suficiente como para cubrir la parte posterior de una cuchara.", "Enfríe la mezcla de vainilla, luego refrigérela durante al menos una hora. Cuele la mezcla en una máquina para hacer helados y revuelva hasta que se congele, siguiendo las instrucciones del fabricante.", "Para la torta de mousse de chocolate y moras, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata para pasteles con forma de resorte de 24 cm / 9½ pulgadas y cúbrala con papel resistente a la grasa. Dispersar las moras de manera uniforme sobre la base de la lata de torta preparada.", "Coloque el chocolate y la mantequilla en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo (asegúrese de que el recipiente no toque el agua) y permita que el chocolate se derrita, revolviendo ocasionalmente. Retirar del fuego y reservar para enfriar un poco.", "Coloque las yemas de huevo en un tazón grande con dos cucharadas de azúcar y bata ligeramente para combinar.", "Coloque las claras de huevo en un recipiente aparte y bata hasta que se formen picos suaves cuando se quite el batidor del recipiente. Poco a poco agregue el azúcar restante a las claras de huevo, batiendo continuamente, hasta que se formen picos firmes cuando se quite la batidora.", "Vierta el chocolate derretido en el tazón con las yemas de huevo y revuelva para combinar. Doble un tercio de las claras de huevo en la yema de huevo y la mezcla de chocolate hasta que se combinen, y luego doble suavemente las claras de huevo restantes.", "Vierta la mezcla en el molde de la torta y suavemente sobre la parte superior. Hornee en el horno durante 20-25 minutos, o hasta que la torta esté dorada y elástica al tacto. La torta se hace cuando un pincho insertado en el centro sale limpio.", "Retire la torta del horno y deje enfriar en una rejilla de alambre.", "Para servir, derrita la mantequilla en la sartén y agregue las moras. Cocine por 1-2 minutos. Coloque rebanadas de pastel en los platos junto con una bola de helado y una cucharada de las moras cocidas."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_blackberry_33426", "title": "Pastel de mousse de chocolate y mora con helado de vainilla y salsa de mora", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "1 cucharadita de cardamomo molido", "1 cucharadita de canela molida", "Anacardos 50g / 1¾oz, en rodajas finas a lo largo", "Almendras de 55 g / 2 oz, en lonchas finas", "50g / 1¾oz de azúcar morena mascabado", "10g de mantequilla salada", "75ml / 2½ fl oz crema doble"], "method": ["Engrase y forre una bandeja para hornear con papel de hornear.", "Pon la mitad del chocolate, el cardamomo y la canela en un recipiente resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del recipiente. Revuelva de vez en cuando hasta que el chocolate se haya derretido.", "Vierta el chocolate derretido en la bandeja para hornear preparada y extiéndalo en una capa delgada y uniforme. Enfríe en la nevera durante 15 minutos, o hasta que esté listo.", "Mientras tanto, haga el caramelo fundiendo suavemente el azúcar y la mantequilla en una cacerola a fuego lento. Agregue la crema y cocine durante 2 minutos.", "Retire la capa de chocolate de la nevera, esparza la salsa de caramelo encima y vuelva a la nevera durante 15 minutos, o hasta que se endurezca.", "Coloque el resto del chocolate, el cardamomo y la canela en un recipiente resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento, asegurándose de que el agua no toque el fondo del recipiente. Revuelva de vez en cuando hasta que el chocolate se haya derretido.", "Retire el caramelo de chocolate de la nevera, unte con el chocolate derretido restante y espolvoree sobre los anacardos y las almendras. Enfríe en el refrigerador hasta que esté listo.", "Una vez que esté completamente listo, rompe la corteza en pedazos y colócala en bolsas transparentes atadas con cinta."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_caramel_63575", "title": "Corteza de nueces con especias y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de mantequilla sin sal, más extra para engrasar", "75g / 3oz de azúcar en polvo", "2 huevos de gallinas camperas", "½ cucharadita de extracto de vainilla", "Harina normal de 60 g / 2½ oz, tamizada", "2 cucharadas de cacao en polvo", "2 cucharaditas de whisky (preferiblemente solo malta)", "sal", "2 cucharadas de jarabe de oro", "100 g / 3½ oz de azúcar en polvo", "½ cucharadita de cardamomo molido (aproximadamente 12 vainas de cardamomo, semillas finamente molidas)", "1½ cucharadita de bicarbonato de soda", "250 g / 9 oz% 20dark% 20chocolate,% 2070% 20cocoa% 20solids),% 20finely% 20chopped", "Crema doble de 430 ml / ¾ de pinta, batida a picos suaves", "1 cucharada de whisky (preferiblemente solo malta)", "1 cucharadita de cardamomo molido (aproximadamente 50-60 vainas de cardamomo, semillas finamente molidas)", "50 g / 2 oz de azúcar en polvo", "polvo de oro comestible, para decorar"], "method": ["Para la base de esponja, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata redonda de fondo suelto de 20 cm / 8 in con mantequilla.", "En una sartén pequeña, derrita el resto de la mantequilla a fuego lento y reserve.", "Coloque el azúcar en un recipiente metálico y póngalo sobre una fuente de agua hirviendo, verificando que la base del recipiente no esté tocando el agua. Rompa los huevos en el bol, y con un batidor de mano eléctrico bata la mezcla sobre el agua hirviendo durante 1-3 minutos, hasta que se ponga pálida y espumosa. Retire el recipiente de metal del fuego y continúe batiendo la mezcla por otros dos minutos mientras se enfría.", "Revuelva suavemente el extracto de vainilla y una pizca de sal. Con una cuchara de metal, doble cuidadosamente la harina tamizada y el polvo de cacao. Poco a poco gotee en la mantequilla derretida y continúe combinando suavemente.", "Vierta la mezcla en la lata engrasada y hornee durante 10-12 minutos, o hasta que el centro esté firme al tacto. Retirar del horno y enfriar un poco en la lata. Rocíe el whisky sobre la esponja y deje que se enfríe completamente en la lata.", "Para hacer el panal, forre una lata cuadrada de 20 cm / 8 pulgadas con un pergamino para hornear. En una cacerola grande de base pesada, caliente el jarabe dorado y el azúcar juntos y lleve a ebullición, luego cocine a fuego lento durante 5-10 minutos. La mezcla burbujeará y se oscurecerá hasta convertirse en un caramelo dorado, pero tenga cuidado de que no se ponga demasiado oscuro o el sabor sea amargo.", "Agregue el cardamomo y retire la sartén del fuego. Inmediatamente, pero con cuidado, agregue el bicarbonato de soda y mezcle; la mezcla instantáneamente se esponjará significativamente, por lo que se necesita una sartén grande para preparar el jarabe. Vierta inmediatamente en la lata de torta forrada. Déjalo reposar durante al menos una hora, luego despega el papel y rompe el panal en trozos del tamaño de un bocado. El panal permanecerá crujiente en un recipiente seco y hermético por un día o dos, pero se irá ablandando gradualmente con el tiempo.", "Para hacer la torta de chocolate, coloque el chocolate picado en un recipiente grande a prueba de calor y déjelo a un lado.", "Vierta 200ml / 7fl de agua en una sartén, agregue el cardamomo molido y el azúcar, y lleve a ebullición, revolviendo. Cuando hierva, retírela del fuego y deje enfriar durante 30 segundos. Vierta a través de un colador muy fino sobre el chocolate, revolviendo continuamente para formar una mezcla lisa y suave. Deseche el contenido del filtro. Revuelva en el whisky.", "Doble la crema ligeramente batida en la mezcla de chocolate; la mezcla comenzará a endurecerse. Vierta la mezcla sobre la esponja fría hasta los bordes del molde de la torta y nivele con una espátula. La esponja se habrá encogido lejos de los lados de la lata, por lo que la torta cubrirá completamente la esponja. Cubra con film transparente y deje enfriar en la nevera durante unas horas, o durante la noche si es posible.", "Para servir, destape la lata y empuje la torta aflojando la base y moviéndola hacia un plato. Decorar con nido de abeja. Cortar en rodajas (para un acabado suave y profesional, use un cuchillo humedecido en agua hirviendo). Decore cada rebanada con más trozos de panal, cubra con polvo de oro comestible y sirva con más crema doble, si lo desea."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_cardamom_49894", "title": "Pastel de mousse de chocolate y cardamomo con panal casero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina lisa fuerte, más extra para quitar el polvo", "2 cucharaditas de sal", "30ml / 1fl oz de aceite de oliva", "10g de levadura de acción rápida", "390g / 13¼fl oz de tarro de cerezas negras, escurridas", "100ml / 3½fl oz de virutas de chocolate", "100ml / 3½fl oz de chips de chocolate blanco"], "method": ["Ponga la harina en un tazón grande y agregue la sal y el aceite de oliva a un lado, y la levadura a la otra. Agregue lentamente 320 ml / 11 fl oz de agua y mezcle a mano hasta que la masa sea flexible.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante 4-7 minutos. Agregue las cerezas a la masa, (puede que necesite agregar un poco más de harina si la mezcla se vuelve demasiado descuidada), luego agregue las chispas de chocolate. Mezcle bien, agregue un poco de harina si la masa se vuelve demasiado suave.", "Vuelva a colocar la masa en el recipiente, cúbrala con una toalla de té limpia y déjela comprobar hasta que duplique su tamaño (aproximadamente 1-1½ horas).", "En una superficie de trabajo ligeramente enharinada, divida la masa por la mitad y moldee cada mitad en una hebra larga en forma de salchicha. Coloque un hilo sobre el otro para hacer una cruz. Agarra ambos extremos del hilo inferior y tira del extremo superior hacia ti, enrollándolo debajo del extremo más cercano. Levanta el extremo más cercano hacia arriba y sobre el otro filamento. Repita el bucle y cruce, siempre trabajando desde los hilos lejanos, hasta que la masa esté trenzada. Empuje cualquier extremo suelto debajo del pan.", "Polvo una bandeja para hornear con harina. Coloque el pan en la bandeja de hornear. Polvo con harina, coloque en una bolsa de plástico grande y deje probar durante una hora.", "Precalentar el horno a 220C / 200C (ventilador) / 425F / Gas 7.", "Hornee el pan durante 20 minutos, luego reduzca la temperatura del horno a 200C / 180C (ventilador) / 400F / Gas 6 y hornee durante 20-25 minutos más. Transfiera a una rejilla para enfriar.", "Una vez frío, cortar y servir con una taza de té o café."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_39721", "title": "Pan de chocolate y cereza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_cherry_39721_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Leche 250ml / 9fl oz", "75g / 2½oz de mantequilla, más extra para engrasar", "500g / 1lb 2oz de harina de pan blanco fuerte", "1 cucharadita de especias mixtas (opcional)", "7g de levadura instantánea", "75g / 2½oz de azúcar moreno claro y suave", "pizca de sal", "1 huevo de gallinas camperas", "rociar aceite, para engrasar las manos y la superficie de trabajo", "100 g / 3½ oz de mantequilla, ablandada", "50ml / 2fl oz de jarabe de arce", "25g / 1 oz de azúcar morena oscura", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas molidas", "pizca de sal", "100g / 3½oz de cerezas glacé, reducidas a la mitad", "100 g / 3½ oz de chips de chocolate", "1 huevo de gallinas camperas", "2 cucharadas de azúcar demerara", "200g / 7oz de azúcar glasé", "1-2 cucharadas de agua recién hervida"], "method": ["Cubra una bandeja de 26-28 cm / 10½-11 en una lata honda redonda o una lata para asar honda con pergamino para hornear y mantequilla generosamente.", "Pon la leche en una olla y ponla justo debajo del punto de ebullición. Retire del fuego y agregue la mantequilla. Deje reposar hasta que la mantequilla se haya derretido y se haya enfriado a la temperatura de la sangre.", "Coloque la harina y la mezcla de especias (si usa) en un tazón grande con la levadura, el azúcar y una pizca de sal. Haz un bien en el medio.", "Batir el huevo en la mezcla de leche y mantequilla. Agregue esto a la harina y revuelva hasta que esté bien combinado; usted encontrará que tiene una masa muy suave y pegajosa.", "Engrase ligeramente sus manos y la superficie de trabajo, luego saque la masa. Amasar hasta que ya no se pegue y tenga una masa suave y elástica. Regrese la masa al tazón y cubra con una toalla de té húmeda. Deje probarlo hasta que se haya duplicado en tamaño, esto tomará alrededor de una hora y media.", "Para el relleno, bata la mantequilla con el jarabe de arce, azúcar, especias y una pizca de sal hasta que tenga una mantequilla cremosa de color caramelo.", "Voltee la masa y ruede o palmee en un rectángulo de alrededor de 30x23 cm / 12x9 pulgadas. Extienda la mezcla de mantequilla sobre la masa y espolvoree con las chispas de chocolate y las cerezas. Enrolle bastante apretado, luego corte en 10-12 piezas.", "Arregle las rondas, con los lados cortados hacia abajo, en la lata profunda de la torta. Cepíllese con huevo, luego déjelo por otros 30 minutos. Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cepillar nuevamente, luego espolvorear con el azúcar. Hornee en el horno durante 20-25 minutos, o hasta que estén doradas y bien aliñados.", "Para un glaseado opcional, agregue gradualmente agua caliente al azúcar glas para hacer un glaseado lo suficientemente delgado como para verterlo, pero no se escurrirá demasiado. Deje que los bollos se enfríen en la lata, luego rocíe sobre el glaseado si está usando. Deja para establecer."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_50877", "title": "Bollos de chocolate y cereza", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 10-12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_cherry_50877_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de chocolate negro", "225g / 8oz de mantequilla sin sal", "3 huevos de gallinas camperas", "225g / 8oz de azúcar moreno claro", "Harina de auto crianza de 75g / 2½ oz, tamizada", "1 cucharadita de polvo de hornear", "175g / 6oz de nueces picadas sin cáscara y peladas", "pizca de sal", "aproximadamente 100 g / 3½ oz de cerezas glaseadas, picadas", "200g / 7oz de chocolate con leche, picado", "nata", "frambuesas", "algunas ramitas de menta fresca", "azúcar en polvo"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5 y engrase y forre una bandeja cuadrada para hornear de 20 cm / 8 pulgadas con papel para hornear.", "Derrita el chocolate amargo y la mantequilla en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo (no permita que el fondo del recipiente toque el agua). Retirar del fuego y reservar para enfriar un poco.", "En un recipiente para mezclar, bata los huevos hasta que estén livianos, luego bata el azúcar hasta que quede esponjoso.", "En un recipiente aparte, mezcle la harina, el polvo de hornear y las nueces.", "Revuelva la mezcla derretida de chocolate en los huevos con una pizca de sal. Agregue la mezcla de harina, chocolate con leche y cerezas.", "Verter en la lata preparada y hornear en el horno durante 40 minutos.", "Retire del horno y deje enfriar en la lata.", "Cortar en cuadrados y servir con crema coagulada, frambuesas, hojas de menta fresca y una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_cherry_97312", "title": "Rebanada de chocolate y cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de chocolate puro, toscamente picado", "1 cucharadita de polvo de café instantáneo fuerte", "5 huevos de gallinas camperas, separados", "Azúcar en polvo 140g / 5oz", "azúcar en polvo, para quitar el polvo", "hojas de acebo y bayas, para decorar (opcional)", "150ml / 5fl oz de crema doble", "3 cucharadas de puré de castañas edulcorado"], "method": ["Tome una lata de rollo suizo de 33x23 cm o una bandeja para hornear y corte una doble capa de papel de horno antiadherente ligeramente más grande que la lata. Coloque el pergamino en la lata. No se preocupe si los bordes se levantan descuidadamente alrededor de los lados.", "Precalentar el horno a 200C / 400F / Gas 6.", "Ponga el chocolate y el café en una cacerola de base pesada con 85ml / 3 fl oz de agua y ponga a fuego lento para derretir el chocolate.", "Batir las yemas de huevo y el azúcar impalpable hasta que estén pálidos y parecidos a un mousse. Agregue el chocolate derretido.", "Batir las claras de huevo hasta que estén firmes, pero no secos. Con una cuchara grande de metal, mezcle bien una pequeña cantidad en la mezcla de chocolate para aflojarlo. Doble los blancos restantes suavemente. Extienda la mezcla de manera uniforme en la lata de asar forrada.", "Hornee en el horno precalentado durante aproximadamente 12 minutos, o hasta que la parte superior esté ligeramente dorada y firme al tacto.", "Deslice el pergamino de la torta de la bandeja de asar sobre una rejilla de alambre. Dejar enfriar completamente (no cubrir).", "Para hacer el relleno, bate la crema en un tazón y luego mezcla el puré de castañas endulzado.", "Cuando la base de la esponja se haya enfriado por completo (verifique debajo), está listo para armar la trinchera. Ponga papel a prueba de grasa en una superficie de trabajo. Gire el rollo en el papel. Retire con cuidado el papel utilizado para revestir la lata. Extienda el relleno uniformemente sobre la superficie de la torta.", "Usando el papel debajo de la torta para ayudar, enrolle firmemente desde uno de los extremos angostos. Descansa el pastel en su costura. Envuelva bien con papel resistente a la grasa y refrigere durante al menos 30 minutos y hasta la noche. (No importa si la torta se rompe cuando rueda; un poco de azúcar glas tamizada hará maravillas por su apariencia).", "Sirva espolvoreado con azúcar glas y decore con hojas de acebo y bayas."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_chestnut_69367", "title": "Navidad y castaño", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_chestnut_69367_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina de pan blanco fuerte", "150ml / 5fl oz de agua", "275g / 9¾oz de harina de pan blanco fuerte", "2 cucharadas de crema de leche en polvo", "70 g / 2½ oz de cacao en polvo", "5 cucharaditas de chile en polvo", "Azúcar en polvo de 55 g / 2 oz", "¾ cucharadita de sal", "1 bolsita de levadura seca instantánea", "3 huevos de gallinas camperas, ligeramente golpeados", "40 g / 1½ oz de mantequilla, ablandada", "1 chile rojo fresco grande, sin semillas y finamente picado", "aproximadamente 225ml / 8fl oz de agua tibia", "200 g / 7 oz de chocolate de buena calidad", "1 huevo de gallinas camperas, golpeado", "1 cucharada de agua", "2 chiles rojos frescos grandes, semillas retiradas y rebanadas"], "method": ["Para hacer el roux, mezcle la harina y el agua en una olla pequeña. Cocine a fuego medio o bajo hasta que comience a espesarse, luego continúe cocinando por un minuto más, luego retírelo del fuego. Cubra la pasta con película adhesiva y déjela hasta que se haya enfriado a temperatura ambiente.", "Para hacer la masa, tamiza los ingredientes secos en un tazón grande. Agregue la levadura y agregue los huevos batidos, la mantequilla ablandada, el chile picado y la mezcla de roux. Poco a poco, agregue suficiente agua tibia para formar una masa suave, luego déjela en una tabla enharinada y amase durante 10 minutos.", "Forme la masa en forma de bola, colóquela en un bol engrasado y cubra con una película adhesiva. Déjelo a un lado para que se eleve en un lugar cálido hasta que haya duplicado su tamaño.", "Convierta la masa en una tabla enharinada, deséchela, amasar en las chispas de chocolate y divídala en 12 porciones. Forme la masa en bolas, colóquela en una bandeja para hornear engrasada y déjela a un lado para que se levante durante 20 minutos.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Para glasear los panecillos, mezcle el huevo con el agua, cepille sobre los panecillos y esparza sobre los chiles en rodajas. Hornee en el horno por unos 12 minutos."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_chilli_25191", "title": "Bollos de chocolate y chile", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 huevos de gallinas camperas", "165 g / 5¾oz de azúcar en polvo", "5 cucharaditas de extracto de café (o 2 cucharaditas de polvo de espresso instantáneo disuelto en 25 ml / 1 fl oz de agua hirviendo, enfriado)", "Harina normal 150g / 5½ oz", "10 g / ½ oz de cacao en polvo", "40 g / 1½ oz de mantequilla sin sal, derretida", "190g / 6½oz de mantequilla sin sal, suavizada", "375g / 13oz de azúcar glas, tamizado", "2 cucharadas de licor de crema irlandesa", "90 g / 3% C2% BCoz% 20dark% 20chocolate% 20 (70%% 20cocoa% 20solids)", "720g / 1lb 9½oz de azúcar glas, tamizado", "40g / 1½ oz de jarabe de glucosa", "50g / 1¾ oz chocolate blanco, derretido (opcional)", "20 granos de café con chocolate (opcional)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forre una lata de rollo suizo de 35x25 cm / 14x10 en papel para hornear.", "Agregue los huevos y el azúcar a un tazón de mezclar a prueba de calor grande y colóquelo sobre una cacerola de agua hirviendo a fuego lento. (Asegúrese de que el fondo del recipiente no toque el agua).", "Con un batidor portátil de mano, bata la mezcla a baja velocidad durante unos 3 minutos hasta que la mezcla esté tibia al tacto. Retire el tazón del fuego y bata a alta velocidad durante 7 minutos hasta que se triplique en volumen. La mezcla debe sostener cintas en la superficie cuando se levanta el batidor. Agregue el extracto de café o espresso.", "Tamizar la harina y el polvo de cacao en la mezcla en tercios, doblando suavemente cada lote con una cuchara grande de metal hasta que estén completamente combinados. Lentamente vierta la mantequilla derretida contra el interior del tazón y dóblela muy suavemente.", "Vierta suavemente la mezcla en la lata preparada e incline la lata para igualar la superficie. Empuja la mezcla en todas las esquinas. Hornee por 15 minutos hasta que esté ligeramente elástico al tacto. Enfríe en la lata durante 5 minutos, luego transfiéralo a una rejilla para que se enfríe por completo.", "Mientras tanto, para la crema de mantequilla, bata la mantequilla con un batidor de mano eléctrico hasta que esté suave y esponjosa. Poco a poco agregue el azúcar glas a baja velocidad, luego mezcle a alta velocidad durante 5 minutos. Agregue el licor de crema irlandés a un lado hasta que sea necesario.", "Cuando el pastel esté completamente frío, córtalo por la mitad para hacer dos rectángulos de aproximadamente 17,5x12,5 cm / 7x5 pulgadas cada uno. Extienda una fina capa de crema de mantequilla sobre un rectángulo. Coloque el otro encima. Congelar durante 10 minutos para reafirmar la guinda.", "Retire la torta del congelador. Recorte los bordes cuadrados con un cuchillo afilado de sierra, luego mida una rejilla para dividir la torta en cuadrados de 3.5cm / 1¼. Con cuidado, corte la esponja en fantasías individuales. Devuelva los pasteles al congelador por al menos 20 minutos hasta que estén firmemente congelados.", "Trabajando con tres fantasías a la vez, extienda la crema de mantequilla delgada, pero sin problemas, alrededor de los lados y la parte superior antes de devolverlos al congelador. Repita con las fantasías restantes, asegurándose de que estén todas en el congelador durante 20 minutos antes de aplicar el fondant.", "Para el fondant de chocolate, derrita el chocolate negro en un tazón pequeño en el microondas o sobre una fuente de agua hirviendo a fuego lento. Deje que se enfríe un poco.", "Mezcle el azúcar glas tamizado en un tazón grande a prueba de calor con 125 ml / 4 fl oz de agua y el jarabe de glucosa. Coloque el recipiente sobre una fuente de agua hirviendo. Revolviendo constantemente, cocine el fondant hasta que alcance 45C. Retire del fuego y deje que se enfríe a 38C. Agregue el chocolate derretido. Vuelva a colocar el recipiente sobre el fuego para mantener una temperatura de 38 ° C; es lo suficientemente caliente para verterlo suavemente pero lo suficientemente frío para que no se deslice por las cavidades.", "Coloque una rejilla de enfriamiento de cable delgado sobre una bandeja de horno para atrapar cualquier gota de fondant. Tome cada fondant del congelador e inserte un tenedor horizontalmente en la capa inferior de la esponja. Sosténgalo a la moda con el bol de fondant y con generosidad cuchara sobre el fondant para cubrir completamente los lados y la parte superior. Toque suavemente para sacudir el exceso de formación de hielo, luego colóquelo en la rejilla de refrigeración para colocarlo, usando otra horquilla para empujarlo libremente.", "Cuando lo haya configurado, levante cuidadosamente las cavidades del estante de enfriamiento con una cuchilla de paleta offset grande. Decore la parte superior de las fantasías con un remolino de crema de mantequilla, con líneas de chocolate blanco o granos de café con chocolate, según lo desee."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_coffee_11819", "title": "Fantasías de fondant de chocolate y café", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 20 fantasías fondant", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_coffee_11819_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de chocolate puro", "150 g / 5½ oz de mantequilla, más extra para engrasar", "8-10 higos frescos, cortados por la mitad de arriba a abajo", "6 huevos de gallinas camperas, separados", "50 g / 1 oz de azúcar en polvo", "4 cucharadas de licor de naranja, como Cointreau o Grand Marnier, más extra a gusto", "300ml / 10½ fl oz crema doble", "2 cucharadas de cacao en polvo"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase una lata de torta de fondo suelto de 24 cm / 9½ con mantequilla y cubra con silicona o papel para hornear.", "Suspenda un recipiente grande a prueba de calor sobre una olla de agua hirviendo a fuego lento. No permita que la base del recipiente toque la superficie del agua. Agregue el chocolate y la mantequilla al tazón y revuelva hasta que se derrita. Retire el recipiente de la olla y déjelo a un lado para que se enfríe un poco.", "Coloque las mitades de los higos, con el lado del corte hacia abajo, en el fondo de la lata de la torta en círculos concéntricos, con la parte más ancha de los higos hacia afuera.", "Batir las yemas de huevo en un recipiente con la mitad del azúcar y hasta que se espese y se ponga pálido. Agregue el licor de naranja y mezcle de nuevo.", "En otro recipiente, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor.", "Vierta la mezcla de yema de huevo sobre el chocolate derretido, batiendo para combinar. Batir en la mitad de las claras de huevo batidas para aligerar la mezcla, luego doble suavemente y rápidamente las claras de huevo restantes en la mezcla, asegurándose de que estén completamente incorporados.", "Vierta la mezcla de mousse de chocolate en la lata de la torta, teniendo cuidado de no desalojar las mitades de higos. Hornea el pastel en el horno durante 18-20 minutos, o hasta que esté listo. Habrá un pequeño tambaleo en el medio del pastel.", "Mientras tanto, bate suavemente la crema doble hasta que se formen picos suaves cuando se quite la batidora. Agregue un poco de licor de naranja, al gusto.", "Espolvorea la torta cocida con el cacao en polvo, luego quítala con cuidado de la lata. Sirva enseguida oa temperatura ambiente, con una cucharada de la crema burbujeante."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_fig_mousse_33864", "title": "Pastel de mousse de chocolate e higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["harina común, para quitar el polvo", "375g / 13oz de masa de copos de brisa lista para usar", "250 g / 8 oz de chocolate negro, toscamente picados", "Crema doble 250ml / 8floz", "75 g / 3 oz de tallo de jengibre, finamente picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Polvore la superficie de trabajo con harina y ruede la masa finamente. Úselo para revestir un aro grande de 25 cm / 10 pulgadas o 6 anillos para tartaletas individuales de 10 cm / 4 pulgadas de diámetro. Recorta cualquier exceso.", "Alinee la caja para tartas con un pergamino para hornear, llénela con alubias y hornéela en el horno de 12 a 15 minutos. Retire los frijoles para hornear y el papel y cocine por otros 10 minutos o hasta que la base de la tarta esté dorada y cocida. Retire la tarta del horno y déjela enfriar.", "Mientras tanto, caliente el chocolate y la crema en una cacerola a fuego medio, revolviendo continuamente hasta que el chocolate se derrita y la mezcla esté suave y espesa.", "Espolvoree el tallo de jengibre finamente picado sobre la base de la tarta, reservando un poco para decorar.", "Vierta la mezcla de chocolate en la cáscara de tarta y enfríe en la nevera durante 45 minutos, o hasta que se endurezca. Espolvorea sobre el tallo restante de jengibre."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_ginger_92855", "title": "Tartas de chocolate y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_ginger_92855_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de avellanas blanqueadas enteras", "200 g / 7 oz de mantequilla, en cubos, más extra para engrasar", "200 g / 7 oz de chocolate negro, roto en cuadrados", "6 huevos medianos, separados", "200 g / 7 oz azucarero, preferiblemente dorado", "3 cucharadas de licor de avellana o licor de amaretto (o jugo de naranja fresco)", "Extensión de chocolate y avellana 150 g / 5½ oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las avellanas en una bandeja para hornear y tápelas en el centro del horno durante 10 minutos, dando a la sartén un batido hasta la mitad, hasta que estén doradas. Mírelos con cuidado para que no se quemen. Retírelos y déjelos enfriar por unos minutos.", "Reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4. Coloque una lata de torta en forma de resorte de 23 cm / 9 pulg. Y forre la base con papel para hornear.", "Coloque 200 g / 7 oz de las avellanas en un procesador de alimentos y mezcle hasta que estén finamente molidos. Si mezclas las nueces con la consistencia de las migas de pan finas, deberían ser una delicia, pero deja unas pocas piezas más gruesas para agregar textura. Coloque las avellanas restantes a 50 g / 2 oz.", "Coloque la mantequilla y el chocolate en un recipiente resistente al calor y colóquelo sobre una fuente de agua hirviendo a fuego lento. Revuelva ocasionalmente y tan pronto como casi todo el chocolate se haya derretido, retire el recipiente de la sartén y continúe dejando que el chocolate se derrita en el calor residual.", "Agregue las avellanas molidas y deje que la mezcla se enfríe durante 5 minutos.", "Batir las yemas de huevo y el azúcar junto con un batidor eléctrico de mano durante al menos 5 minutos hasta que estén pálidos y cremosos, luego revuelva en la mezcla de chocolate hasta que estén bien combinados. Lave y seque bien los batidores.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos rígidos; están listas cuando puedes girar el tazón boca abajo sin que se caigan los huevos. No más de batir.", "Trabajando rápidamente, mezcle el licor de avellana, el amaretto o el jugo de naranja en la mezcla de chocolate para ablandarlo. Agregue un par de cucharadas de las claras de huevo batidas y revuelva hasta que estén bien combinadas, luego doble suavemente las claras de huevo restantes.", "Coloque la mezcla en la lata preparada y hornee en el centro del horno durante 35-40 minutos o hasta que la torta esté bien levantada y firme.", "Retire la torta del horno y déjela enfriar en la lata durante 30 minutos. Deshaga el clip de resorte e invierta la torta en un plato para servir, luego retire el papel de revestimiento y deje que se enfríe por completo.", "Cuando el pastel esté frío, extiéndelo con la extensión de chocolate y avellanas y espolvorea con las avellanas que colocas a un lado; estas pueden ser enteras o picadas, lo que prefieras."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_38207", "title": "Tarta de chocolate y avellanas (Torta gianduia)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_hazelnut_38207_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "3 x 32cm x 38cm / 13in x 15in hojas de pasta filo", "250 g / 9 oz de chocolate y avellana", "100ml / 3½ fl oz crema doble", "1 cucharada de azúcar en polvo", "½ cucharadita de extracto de vainilla", "azúcar glasé, tamizada para quitar el polvo"], "method": ["Para la masa, precaliente el horno a 200C / 400F / Gas 6 y alinee una bandeja grande para hornear con papel resistente a la grasa.", "Derrita la mantequilla en una olla pequeña, luego retírela del fuego.", "Corte cada hoja de masa de filo en 4 rectángulos del mismo tamaño y cepille cada rectángulo ligeramente con la mantequilla derretida.", "Extienda una cucharada de chocolate para untar, lo más uniformemente posible, en el lado largo de cada pieza de pastel, manteniendo un borde de 2 cm / ¾. Dobla los dos lados cortos de la masa sobre el relleno para sellar el chocolate. Enrolle la masa desde el lado largo, para cerrar completamente el relleno.", "Repita con los rectángulos restantes de pasta filo para hacer 12 rollos.", "Coloque los rollos en la bandeja para hornear forrada y cepíllelos con un poco más de mantequilla derretida, luego hornéelos en el horno durante 8-10 minutos o hasta que la masa esté dorada.", "Retire los rollos del horno y déjelos enfriar en una rejilla de alambre.", "Para la salsa de crema de vainilla, batir la crema muy ligeramente con el azúcar y el extracto de vainilla. Cuchara en un tazón pequeño.", "Para servir, espolvoree los rollos de filo de chocolate con un poco de azúcar impalpable tamizada y colóquelos en un plato para servir con la salsa de crema de vainilla colocada al costado."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_54460", "title": "Rollos de filo de chocolate y avellana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas colmadas de chocolate instantáneo en polvo, más extra para servir", "8-10 dedos de esponja", "16 segmentos de mandarina (enlatados o frescos), más extra para servir", "75g / 3oz de queso crema", "125g / 4½oz de yogurt natural", "½ cucharadita de extracto de vainilla"], "method": ["En un tazón, mezcle las dos cucharaditas de chocolate en polvo caliente con 50 ml / 2 fl oz de agua tibia hervida hasta que quede suave.", "Coloque la mitad de los dedos de la esponja en una capa en el fondo de un tazón pequeño. Rocíe más de la mitad de la mezcla de chocolate para beber para remojar los dedos de la esponja.", "Coloque ocho de los segmentos de mandarina en la parte superior de los dedos de la esponja.", "Batir el queso crema en un tazón para mezclar hasta que quede suave y suelto. Agregue el yogur y el extracto de vainilla hasta que estén bien combinados.", "Con una cuchara, coloque la mitad de la mezcla de queso crema en el platillo y aliméntelo con una espátula.", "Repita el proceso de estratificación una vez más con los dedos restantes de la esponja, tomando la mezcla de chocolate, los segmentos de mandarina y la mezcla de queso crema. Espolvorea la parte superior con un poco de polvo de chocolate caliente extra.", "Cubra el plato con film transparente y deje enfriar en la nevera durante aproximadamente una hora.", "Para servir, cuchara la bagatela en platos de servir y adornar con algunos segmentos de mandarina adicionales."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_mandarin_42366", "title": "Pudín de chocolate y mandarina", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 275g / 9¾oz", "3 cucharadas de cacao en polvo", "1½ cucharadita de bicarbonato de soda", "1½ cucharadita de polvo de hornear", "150 g / 5½ oz de azúcar en polvo de oro", "65g / 2¼oz de azúcar morena suave", "1 naranja, solo ralladura, finamente rallado", "25 g / 1 oz de almendras molidas", "3 huevos grandes de gallinas camperas", "225ml / 8fl oz de aceite de coco, derretido y ligeramente enfriado", "225ml / 8fl oz de leche entera", "3 cucharadas de jarabe de oro", "Harina de auto crianza de 115g / 4oz", "1 cucharadita de polvo de hornear", "115g / 4oz de mantequilla sin sal", "115 g / 4 oz de azúcar en polvo de oro, más 2 cucharadas de jarabe", "2 huevos grandes de gallinas camperas", "1 naranja, ralladura fina y jugo", "10 vainas de cardamomo, solo semillas, aplastadas", "300ml / 10½ fl oz crema doble", "200 g / 7 oz de naranja y chocolate almendra oscura", "200g / 7oz de chocolate puro", "1 naranja, solo ralladura, finamente rallado", "500g / 1lb 2oz de chocolate negro", "225g / 8oz de mantequilla sin sal", "50g / 1¾oz de chocolate blanco, derretido", "almendras copos tostadas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y alinee las latas de pastel redondo de 3 x 20 cm.", "Para la esponja de chocolate, mezcle la harina, el cacao, el bicarbonato de soda y el polvo de hornear en un tazón. Agregue los azúcares, la ralladura de naranja y las almendras molidas. Haz un bien en el medio. Usando un batidor de mano eléctrico, mezcle los huevos, el aceite de coco derretido, la leche y el jarabe hasta que estén bien combinados y suaves.", "Divida por igual entre dos latas y hornee durante 30 minutos, o hasta que estén suaves al tacto. Deje que se enfríe durante unos minutos en la lata, luego colóquelo en una rejilla para enfriar. Retire el papel y permita que se enfríe por completo.", "Para la esponja de naranja, ponga la harina, el polvo de hornear, la mantequilla, el azúcar y los huevos, la ralladura de naranja y las semillas molidas de cardamomo en un bol con la mitad del jugo de naranja. Mezcle bien con un batidor de mano eléctrico hasta que quede suave. Coloque la cuchara en la lata preparada, alise la superficie uniformemente y hornee por 25 minutos, o hasta que quede elástico al tacto. Dejar enfriar en estaño durante unos minutos y luego colocar en la rejilla de enfriamiento y dejar enfriar por completo.", "Coloque el jugo de naranja restante y 2 cucharadas de azúcar para el almíbar en una cacerola. Cocine a fuego lento, revolviendo, hasta que el azúcar se disuelva y el jarabe se espese un poco. Dejar de lado.", "Para el llenado de ganache, ponga la crema en una cacerola a fuego medio hasta que esté a punto de hervir. Retire la crema del fuego y agregue los chocolates picados y la ralladura de naranja. Deje que se derrita durante unos minutos antes de mezclar hasta que quede suave y brillante. Enfriar hasta que la mezcla tenga una consistencia espesa y untable.", "Para el glaseado de chocolate, coloque el chocolate normal en un recipiente resistente al calor sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua). Derrita hasta que esté suave y luego agregue la mantequilla, revolviendo hasta que la mantequilla se derrita y se incorpore. Enfríe hasta que la mezcla solo se pueda verter.", "Para armar la torta, recorte la parte superior de las tortas para que las capas queden planas. Extiende un cuarto del ganache que se llena sobre la parte superior de una de las esponjas de chocolate. Cepille la esponja naranja con el jarabe de naranja y coloque en la parte superior. Extienda otro cuarto del ganache sobre la esponja naranja y coloque la segunda esponja de chocolate encima. Use el ganache restante para cubrir completamente la parte exterior de la torta, creando una superficie lisa.", "Coloque el pastel en un estante colocado sobre una hoja de periódico. Vierta el glaseado de chocolate en la parte superior de la ganache y utilice una espátula de compensación para empujar la guinda sobre toda la torta. Con cuidado, transfiera la torta a un plato de servir antes de que la formación de hielo se haya establecido por completo.", "Ponga el chocolate blanco derretido en una manga pastelera desechable y rocíe sobre la torta. Esparce con almendras en copos para decorar."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_26890", "title": "Pastel de chocolate y naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_26890_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de chocolate negro, roto en pedazos", "30g / 1oz de mantequilla sin sal", "50g / 1¾oz de azúcar glas", "75ml / 2½ fl oz crema doble", "1 huevo grande de gallinas camperas", "3 yemas de huevo grandes de gallinas camperas", "1 cucharadita de extracto de vainilla", "150 g / 5½ oz de azúcar en polvo", "400 ml / 14 fl oz crema doble", "75 g / 2½ oz de avellanas sin piel tostadas, finamente picadas", "200 g / 7 oz de chocolate negro, roto en pedazos"], "method": ["Línea doble una lata de pan de 900 g / 2 libras con film transparente.", "Para el ganache, derrita el chocolate y la mantequilla en un tazón grande y resistente al calor sobre una olla de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Agregue el azúcar glas y la crema doble. Dejar de lado.", "Mientras tanto, coloque el huevo, las yemas de huevo, el extracto de vainilla y el azúcar en un recipiente resistente al calor y póngalo sobre una olla de agua hirviendo a fuego lento, asegurándose de que el recipiente no toque el agua. Batir la mezcla sobre el fuego durante aproximadamente 8 minutos con un batidor eléctrico de mano, hasta que esté espeso y pálido. Sáquelo del fuego y apártelo.", "En un tazón grande por separado, batir la crema doble hasta que esté tieso. Doble suavemente la mezcla pálida de huevo hasta que se combinen.", "Vierta la mitad de la mezcla en la lata de pan preparada. Haga un pozo poco profundo a lo largo del centro y vierta el ganache. Vierta el resto de la mezcla de semifríos en la parte superior y use un cuchillo para hacer remolinos con la ganache. Cubra con una película adhesiva y colóquelo en el congelador para dejarlo durante 6 horas.", "Justo antes de servir, derrita las piezas de chocolate en un recipiente sobre una fuente de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Dejar enfriar a temperatura ambiente.", "Para servir, voltea el semifrío en un plato de servir y retira cuidadosamente la película adhesiva. Vierta el chocolate enfriado en la parte superior, espolvoree con las avellanas tostadas y sirva en rebanadas generosas."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_hazelnut_81026", "title": "Semifrío de chocolate y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, derretida, para engrasar", "75 g / 2½ oz de azúcar en polvo, más extra para quitar el polvo", "150ml / 5fl de leche en oz", "100ml / 3½ fl oz crema doble", "150 g / 5½ oz de chocolate negro, roto en pedazos", "½ naranja, ralladura fina solamente", "3 huevos grandes de gallinas camperas, separados", "15g / ½ oz de harina de maíz", "15g / ½ oz de harina natural", "10g / ⅓oz de cacao en polvo", "300ml / 10fl oz de jugo de naranja", "½ limón, solo jugo", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de licor de naranja"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Cepille los moldes con mantequilla derretida con un pincel de pastelería y espolvoree con azúcar hasta que estén bien cubiertos. Coloque en el congelador hasta que los necesite.", "Para el suflé, caliente suavemente la leche en una cacerola hasta que esté casi hirviendo y déjela a un lado. Mientras tanto, en una cacerola aparte, caliente la crema y el chocolate hasta que el chocolate se derrita. Batir hasta que esté espeso y brillante, incorporar la ralladura de naranja y reservar para enfriar.", "Batir las yemas de huevo con 50 g / 1¾ oz de azúcar hasta que estén cremosas. Tamizar la harina de maíz, la harina común y el cacao, luego espolvorear sobre las yemas de huevo y batir hasta que quede suave. Vierta la leche sobre la mezcla de yema, revuelva constantemente, luego transfiera de vuelta a la cacerola. Revuelva a fuego lento hasta que se espese un poco, luego deje enfriar, batiendo regularmente para asegurarse de que no se desarrolle una piel. Batir en la mezcla de chocolate derretido.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos suaves. Batir en el restante 25 g / 1 oz de azúcar una cucharadita a la vez hasta que la mezcla esté tieso y brillante. Con cuidado, doble las claras de huevo en la mezcla de chocolate un tercio a la vez, incorporándolas por completo antes de agregarlas.", "Divida la mezcla entre los moldes, aplanando la parte superior con una espátula. Pon los moldes en una bandeja y hornea por 12-15 minutos, o hasta que estén bien levantados con un ligero bamboleo en el medio.", "Mientras tanto, para la salsa, coloca el jugo de naranja, el jugo de limón y el azúcar en una olla. Caliente suavemente, revolviendo constantemente, hasta que el azúcar se disuelva. Aumente el fuego un poco y cocine a fuego lento durante unos minutos, o hasta que alcance una consistencia de jarabe. Agregue el licor de naranja una cucharada a la vez y mezcle bien.", "Sirva los soufflés inmediatamente con la salsa en el lado para que los comensales la viertan en el centro de los soufflés."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_34113", "title": "Soufflé de chocolate y naranja con salsa de licor de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]