[{"ingredients": ["1 bulbo de hinojo, aproximadamente picado", "250 g / 9 oz de setas de campo, picadas", "1 cebolla, pelada, más o menos picada", "50g / 2oz de mantequilla", "sal y pimienta negra recién molida", "150ml / 5fl oz de crema doble", "Harina común 110g / 4oz", "½ cucharadita de azúcar", "sal y pimienta negra recién molida", "350ml / 12¼fl oz de leche entera", "1 huevo de gallinas camperas, golpeado", "1 cucharada de mantequilla derretida", "3 cucharadas de perejil fresco picado", "3 cucharadas de aceite vegetal", "25g / 1oz de mantequilla", "Lomo de venado de 450 g / 16 oz, recortado", "275g / 9¾oz de masa de hojaldre lista para usar", "harina, para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "1 repollo Savoy", "50g / 2oz de mantequilla", "1 cucharada de salvia fresca picada", "500 ml / 17 fl oz de caldo de carne de vacuno, hervido a fuego lento en una sartén hasta que el volumen del líquido se haya reducido a 100 ml / 3½ fl oz, para servir"], "method": ["Para el hinojo y champiñones duxelles, mezcle el hinojo, los champiñones y la cebolla en un procesador de alimentos hasta obtener una pasta.", "Caliente una sartén a fuego medio o bajo, luego agregue la mantequilla. Cuando la mantequilla esté espumante, agregue el hinojo y la pasta de champiñones y cocine hasta que toda la humedad se haya evaporado de la pasta. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la crema, luego continúe cocinando la pasta hasta que esté bien caliente y bien combinada.", "Para los panqueques de perejil, tamiza la harina en un tazón de vidrio grande. Agrega el azúcar Sazonar, al gusto, con sal y pimienta negra recién molida.", "Haga un pozo en el centro de la mezcla de harina y azúcar. Poco a poco agregue la leche y el huevo batido, poco a poco, batiendo bien después de cada adición hasta que todo el líquido se haya incorporado a la mezcla antes de agregar la siguiente.", "Cubra la masa de panqueque con película adhesiva, luego enfríe en la nevera durante 30 minutos.", "Cuando la masa de panqueque se haya enfriado, agregue la mantequilla derretida y el perejil picado.", "Caliente una cucharada de aceite en una sartén a fuego alto. Cuando el aceite esté humeando, agregue un cucharón de la pasta fría para panqueques, luego agite la sartén hasta que cubra el fondo de la sartén de manera uniforme. Freír durante 30 segundos, luego darle la vuelta y continuar cocinando por otros 30 segundos. Poner a un lado en un plato y cubrir con una hoja de papel a prueba de grasa. Mantener caliente", "Repite el proceso hasta que toda la pasta de panqueques se haya agotado (deberías obtener tres panqueques de esta mezcla). Separe cada panqueque con papel antigrasa y mantenga calientes los panqueques.", "Para el venado en croûte, forrar una bandeja para hornear con papel antigrasa.", "Caliente una sartén a fuego medio y alto, luego agregue la mantequilla. Cuando la mantequilla esté espumosa, freír el lomo de venado por todos lados hasta que se dore por todas partes. Retire los lomos de venado de la sartén y déjelos a un lado para que descansen en un plato.", "Extienda la masa de hojaldre sobre una superficie de trabajo ligeramente enharinada a un rectángulo de 25cm x 30cm / 10in x 12in.", "Coloque los tres panqueques en la parte superior del rectángulo de repostería para cubrir la masa. Extienda tres cucharadas de la mezcla de duxelles en los panqueques.", "Coloque la carne de venado sellada en el centro de los panqueques. Extienda la mezcla restante de duxelles en la parte superior del lomo de venado.", "Dobla los panqueques lo más fuerte posible alrededor de la carne de venado (no permitas que la mezcla de duxelles se filtre).", "Cepille los bordes de la masa con un poco del huevo batido, luego envuelva la masa alrededor de la carne de venado y los panqueques, superponiendo los bordes y doblando para sellar. Cepille el exterior de la masa con más del huevo batido.", "Transfiera el paquete de carne de venado a la bandeja de horneado preparada, luego enfríe en la nevera durante 30 minutos.", "Precalentar el horno a 220C / 425F / Gas 7.", "Cuando el paquete de carne de venado se haya enfriado, cepíllalo de nuevo con el huevo batido restante. Hornee en el horno durante 15-20 minutos, o hasta que la masa se haya levantado y esté dorada (la carne de venado se cocinará a fuego medio después de 15-20 minutos). Retire del horno y deje reposar por cinco minutos.", "Para la col con mantequilla de Saboya, pula las hojas de col en una sartén de agua hirviendo con sal durante 3-4 minutos, o hasta que estén tiernas. Escurrir bien, luego actualizar en agua fría. Escurrir de nuevo y exprimir las hojas secas. Corta las hojas blanqueadas en tiras.", "Calentar la mantequilla en una sartén a fuego medio. Agregue las hojas de repollo escaldadas y fría por 3-4 minutos, o hasta que estén cubiertas con la mantequilla derretida. Justo antes de servir, agregue la salvia hasta que esté bien combinada.", "Mientras el venado se cocina, reduzca el caldo de carne en una sartén a fuego medio, hasta que el volumen del líquido se haya reducido a 100 ml / 3½ fl oz. Mantener caliente", "Para servir, corte la carne de venado en croûte en cuatro rebanadas, cada una de aproximadamente 0,75 cm / 1½ pulgadas de grosor. Coloque una rebanada en el centro de cada plato de servir. Sirva el repollo con mantequilla al lado. Rocíe sobre el caldo de carne reducido."], "url": "www_bbc_co_uk_food_recipes_loinofvenisonencrout_92734", "title": "Lomo de carne de venado en croute con repollo Saboya con mantequilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla grande, más o menos picada", "6 pimientos, surtidos de rojo y amarillo, sin semillas y descuartizados", "Tomates 400g / 14oz surtidos tamaños y colores", "20 ramitas de tomillo", "8 cucharadas de aceite de oliva", "2 x 400 g de judías de mantequilla", "2 cucharaditas de pimienta de Jamaica", "350g / 12oz de judías verdes", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Transfiera la cebolla y otras verduras a un molde para asar con las ramitas de tomillo y gotee sobre el aceite de oliva. Ase las verduras durante 1 hora.", "Agregue los ejotes y la pimienta de Jamaica molida a la bandeja de asar y mezcle bien, asegurándose de que las partes secas estén bien cubiertas con aceite de oliva. Hornea por otros 30 minutos.", "Corta los extremos del tallo de las judías verdes. Cocine en una sartén con agua salada hirviendo durante 4 minutos. Retirar y refrescar en un recipiente con agua helada.", "Doble las judías verdes en las verduras asadas. Sazone con sal y pimienta y servir."], "url": "www_bbc_co_uk_food_recipes_lokanta_stew_91668", "title": "Guiso de restaurante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lokanta_stew_91668_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pechuga de pollo de 100 g / 3½ oz, cortada en tiras", "2 cucharadas de aceite de oliva", "2 cucharadas de miel", "1 cucharada de semillas de sésamo, tostadas", "1 pequeño puñado de hojas frescas de perejil"], "method": ["Remoje dos brochetas de madera en un recipiente con agua fría durante diez minutos.", "Ensarte el pollo en los pinchos y rocíe más de la mitad del aceite de oliva.", "Caliente una sartén hasta que fume y cocine los pinchos de pollo durante 4 a 5 minutos en ambos lados, o hasta que estén dorados y cocidos. Rocíe la miel y espolvoree sobre las semillas de sésamo.", "Para servir, coloca los pinchos de pollo en un plato de servir. Mezcle las hojas de perejil con el aceite de oliva restante y rocíe en el plato al lado de los pinchos de pollo."], "url": "www_bbc_co_uk_food_recipes_lollipopchickenwithh_89019", "title": "Pollo Lollipop con miel y semillas de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 dientes de ajo, picados", "150ml / 5fl oz de salsa de soja", "2 cucharadas de vinagre de vino tinto", "2 cucharaditas de salsa worcestershire", "½ cucharadita de orégano seco", "½ cucharadita de comino molido", "sal marina y pimienta negra recién molida", "Filete de solomillo de 600 g / 1 lb 5 oz, cortado en cubos de 3 cm / 1¼ en", "aceite vegetal, para freír", "1 cebolla roja grande, cortada en cuñas gruesas", "2 tomates, mitades, semillas retiradas y cortadas en octavos", "1 chili amarillo, sin semillas y rebanado longitudinalmente", "2 cucharaditas de pisco", "25g / 1oz de cilantro fresco, finamente picado", "10g / ¼ oz de perejil fresco de hoja plana, finamente picado", "600g / 1lb 5oz astillando patatas, peladas, cortadas en pedacitos", "aceite de girasol, para freír"], "method": ["Para el adobo, mezcle todos los ingredientes en un tazón con dos cucharadas de agua hasta que estén bien combinados.", "Agregue la carne al tazón y mezcle para que quede bien cubierta en el adobo. Cubra con una película adhesiva y déjelo marinar en la nevera durante aproximadamente cuatro horas.", "Enjuague las virutas en un colador bajo abundante agua fría para eliminar el exceso de almidón. Pat seco con papel de cocina.", "Caliente una cacerola profunda de fondo grueso o una freidora a la mitad llena de aceite de girasol a 130 ° C / 275 ° F. Agregue las papas a la freidora y fríaselas durante 10 minutos, o hasta que se ablanden. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Cuando esté listo para servir, recaliente el aceite a 190 ° C / 375 ° F. Con una cuchara ranurada, baje suavemente todas las papas fritas a la sartén y cocine durante 4-5 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y escurra sobre papel de cocina. Sazone con un poco de sal y mantenga caliente mientras cocina el bistec.", "Escurre la carne, reservando el adobo. Calienta el aceite vegetal en un wok a fuego alto hasta que solo fumes y añadas la carne al wok, ten cuidado, puede que te salpique. Cocine lo más rápido posible, revolviéndolo hasta que la carne esté dorada por todos lados.", "Agregue las rodajas de cebolla roja y cocine por un minuto. Agregue el tomate y el chile e inmediatamente vierta el pisco.", "Vierta sobre el adobo reservado y traiga a fuego lento. Apague el fuego y deje reposar la carne en la salsa durante un par de minutos.", "Coloque el bistec en un lado y las patatas fritas en otro y adorne con cilantro picado y perejil."], "url": "www_bbc_co_uk_food_recipes_lomo_saltado_with_chips_31800", "title": "Lomo saltado with chips", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka de 15 ml / ½ fl oz", "15ml / ½fl oz de ginebra", "Ron ligero 15ml / ½fl oz", "Licor de naranja de 15 ml / ½ fl oz", "15ml / ½fl de jugo de limón fresco", "15 ml / ½ fl oz de zumo de naranja recién exprimido", "1 cucharadita de jarabe de azúcar", "cola, para recargar", "cuña de limón, para adornar"], "method": ["Coloque todos los ingredientes en una coctelera con un puñado de hielo y agite con fuerza.", "Colar el cóctel en un vaso alto, reponer con cola y decorar con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_long_island_iced_tea_42582", "title": "Té helado Long Island", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/long_island_iced_tea_42582_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["525 g / 1 libra de mantequilla sin sal 3 oz, ablandada", "525 g / 1 libra de azúcar en polvo 3 oz", "9 huevos de gallinas camperas, ligeramente golpeados", "2½ cucharadas de suero de leche", "3 limones, ralladura finamente rallada", "550 g / 1 libra de harina de auto aumento 4 oz, tamizada", "1-2 cucharadas de leche", "2 limones, ralladura y jugo", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de mantequilla sin sal, ablandada", "100g / 3½oz de azúcar glas, cernida", "100g / 3½oz de conserva de fresa", "azúcar en polvo, para quitar el polvo", "675g / 1lb 8oz rojo fondant listo para rodar", "250 g / 9 onzas de glaseado de fondant blanco listo para enrollar", "675 g / 1 lb 8 onzas de glaseado de fondant listo para enrollar azul"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos moldes para pasteles redondos de 20 cm / 8 pulgadas y una lata de pan de 8x21 cm / 3¼x8¼ pulgadas.", "En un tazón grande, mezcle la mantequilla y el azúcar con una batidora eléctrica manual hasta que esté pálida y esponjosa.", "Combine los huevos batidos y el suero de leche en otro recipiente. Bata esto en la mantequilla batida un tercio a la vez, batiendo bien después de cada adición. Agregue la ralladura de limón rallado.", "Dobla la harina tamizada con una cuchara grande de metal hasta que esté todo incorporado. Si la mezcla es demasiado dura, aflójela con un poco de leche hasta que la mezcla se desprenda lentamente de la cuchara.", "Ponga un tercio de la masa de torta en cada lata (puede que necesite pesar las tortas redondas para obtenerlas, incluso en tamaño).", "Hornee durante 35-40 minutos, revisando los pasteles después de 30 minutos. Los pasteles están listos cuando están dorados y se han levantado, y un pincho insertado en la torta debe salir limpio.", "Mientras tanto, para el almíbar, combine todos los ingredientes en una cacerola y déjelos hervir suavemente, revolviendo con frecuencia hasta que el azúcar se disuelva. Poner a un lado para enfriar, luego colar antes de usar.", "Retire los pasteles del horno y enfríe los pasteles en las latas durante diez minutos antes de colocarlos en una rejilla. Con un palillo de cóctel o un pincho, haga pequeños agujeros en todas las tortas y cepille sobre el almíbar. Esto mantendrá los pasteles húmedos y agregará más sabor. Deje que los pasteles se enfríen completamente antes de la formación de hielo.", "Para la crema de mantequilla, crema la mantequilla ablandada en un tazón usando una batidora eléctrica de mano. Agregue el azúcar glas un tercio a la vez, batiendo bien entre las adiciones. Dejar de lado.", "Para armar el pastel, prepare los pasteles redondos cortando cualquier redondez en la parte superior para dar un acabado plano.", "Extienda una de las capas redondas con conserva de fresa. Extienda la mitad de la crema de mantequilla sobre la mermelada y cubra con la otra capa de torta redonda.", "Encuentre una imagen del logotipo de London Underground a seguir para el diseño. Sobre una superficie espolvoreada con abundante azúcar glas, extender el glaseado de fondant rojo hasta un grosor de 3 mm. Use un rodillo para enrollar la guinda y levante y cubra la torta redonda. Use una mano más suave (o limpia, muy seca) para facilitar la formación de hielo a los lados de la torta. Recorta el exceso.", "Espolvoree más azúcar glas en la superficie de trabajo, si es necesario, y despliegue el glaseado blanco hasta un grosor de 3 mm. Usando una plantilla, recorte un círculo de 18cm / 7 pulgadas. Cepille la parte superior de la tarta cubierta de glaseado rojo con un poco de agua, luego coloque el círculo blanco en la parte superior.", "Corta la torta redonda en tres piezas, creando un corte ancho de 7cm / 2¾ desde el centro del pastel. Levanta esta rebanada y quita la guinda. Recorte el extremo redondeado para que quede recto y cuadrado.", "Prepare la torta de pan recortando en un rectángulo de 7cm / 2¾ de ancho y 13cm de largo. Cortar esta pieza por la mitad horizontalmente y llenar el centro con mermelada y crema de mantequilla como antes, reservando una cucharada grande de crema de mantequilla. Es posible que deba recortar la parte superior e inferior para que tenga la misma altura que la porción que acaba de levantar de la torta redonda.", "Pegue los dos rectángulos junto con la crema de mantequilla restante. Recorta los extremos para que la pieza mida 30 cm / 12 pulgadas de largo.", "Estirar la formación de hielo azul en la superficie con azúcar en polvo a un grosor de 3 mm en forma de rectángulo largo. Utiliza el rodillo para enrollar el glaseado azul y colócalo sobre el rectángulo. Use un alisador para facilitar la formación de hielo por los lados y suavizar las arrugas. Recorta cualquier exceso.", "Organiza los tres pasteles en un tablero de presentación, con el rectángulo azul en el centro para crear la forma del logotipo de London Underground.", "Estire el glaseado de fondant blanco restante y corte las letras con pequeños cortadores alfabéticos (o con la mano) para deletrear su estación de tubo favorita. Cepille el glaseado azul muy ligeramente con agua para pegar las letras."], "url": "www_bbc_co_uk_food_recipes_london_underground_52779", "title": "Tarta de novedad underground de Londres", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 16-20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de arroz glutinoso (arroz pegajoso), cubierto con agua y remojado durante una hora, luego escurrido", "4 setas negras secas chinas", "200g / 7oz de muslos de pollo deshuesados ​​y sin piel", "100 g / 3½ oz de lomo de cerdo, picado en trozos pequeños", "¼ cucharadita de sal", "2 cucharadas de aceite vegetal", "1 diente de ajo, picado", "2 salchichas chinas (cheong del regazo) o, alternativamente, tocino curado dulce, picado", "2 cucharadas de vino de arroz chino (o jerez seco)", "1 cucharada de salsa de soja ligera", "1 cucharadita de salsa de soja oscura", "1½ cucharadita de harina de maíz", "¼ cucharadita de aceite de sésamo", "pimienta negra o blanca recién molida, al gusto", "4 hojas de loto, cortadas por la mitad"], "method": ["Cubra un vaporizador de bambú con papel pergamino perforado con agujeros (o una hoja de plátano o una hoja de repollo). Llene un wok aproximadamente a la mitad con agua para que el vaporizador esté sentado sobre el agua sin tocarlo. Hierva el agua, cubra el arroz y cocine al vapor por unos 20 minutos. Retire el arroz, cubra y mantenga caliente mientras prepara el resto de los ingredientes.", "Suavice las setas secas sumergiéndolas en un recipiente con agua caliente durante 20-30 minutos. Exprima el exceso de agua, quite los tallos y pique finamente.", "Corta el pollo en pequeños cubos del tamaño de un sello postal. Sazonar el pollo y el cerdo con sal.", "Calentar un wok y agregar el aceite para freír. Cuando el aceite esté caliente, agregue el ajo y saltee hasta que esté aromático (unos 30 segundos). Agregue los cubos de pollo y carne de cerdo. Revuelva freír hasta que se pongan blancos y se haya cocinado en un 80 por ciento.", "Agregue las salchichas y los champiñones escurridos. Revuelva freír por otro minuto.", "En un tazón pequeño, combine el vino de arroz con la soya ligera y la salsa de soja oscura. En un tazón pequeño separado, disuelva la harina de maíz en una cucharada de agua y mezcle con la salsa.", "Dele a la mezcla de salsa un revolvimiento rápido y luego agréguela al wok, revolviendo rápidamente para espesar. Sazonar con pimienta al gusto. Cocine por 1 o 2 minutos más para mezclar todo y calentar. Retire del fuego y agregue el aceite de sésamo. Deja enfriar.", "Para hacer las envolturas, separe el arroz y el relleno en ocho secciones iguales, una sección para cada envoltura. Coloque una hoja de loto en frente de usted. Coloque una porción de la mezcla de arroz en el centro de una hoja de loto. Agregue la mezcla de carne y vegetales en la parte superior, dando forma al arroz con las manos para que forme un anillo alrededor del relleno. Agregue más arroz para cubrir.", "Forme un paquete cuadrado con la hoja de loto y átelo con una cuerda de cocina. Repita con las hojas de loto restantes.", "Cueza al vapor los paquetes de hojas de loto, cubiertos, en un plato resistente al calor en un vaporizador de bambú durante 15 minutos, o hasta que estén cocidos. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_lotus_leaf_wraps_lo_mai_65211", "title": "Envoltura de hojas de loto", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de carne de cangrejo blanca fresca", "200g / 7oz de puré de papa", "1 pimiento rojo, finamente cortado en cubitos", "1 pimiento verde, finamente cortado en cubitos", "4 cebolletas, finamente picadas", "1 chile rojo fresco, finamente picado", "110g / 3¾oz de harina común", "2 huevos medianos de granja, golpeados", "Pan rallado panko de 110g / 3¾oz", "2 cucharadas de aceite vegetal", "2 maíz en la mazorca", "1 mango, finamente cortado en cubitos", "1 manojo de cebollas en rodajas finas", "½ pepino, finamente cortado en cubitos", "1 chile rojo, finamente picado", "1 lima, solo jugo", "1 cucharada de cilantro fresco tostado", "1 lima, cortada en cuñas"], "method": ["Coloque la carne de cangrejo, las papas, los pimientos, las cebolletas y el chile rojo en un tazón grande, sazone con sal y pimienta y mezcle bien.", "Forme la mezcla de cangrejo en hamburguesas gruesas con las manos mojadas. Coloque en un plato y colóquelo en la nevera durante al menos 30 minutos para reafirmarlo.", "Coloque la harina, los huevos y las migas de pan en tres cuencos amplios y separados. Una vez que los pasteles de cangrejo han descansado, dragarlos en la harina, luego sumergirlos en el huevo y finalmente cubrir las migas panko. Regrésalos al plato para descansar en el refrigerador hasta que estés listo para servir.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para la salsa, caliente una sartén de plancha y coloque el maíz en la plancha durante 8-10 minutos, volteándolos hasta que queden carbonizados. Dejar de lado.", "Una vez que el maíz esté cocido, quítelo de la plancha y déjelo enfriar.", "Cuando el maíz esté lo suficientemente frío como para manipularlo, remueve los granos con un cuchillo afilado y agrega a un tazón mediano. Agregue el resto de los ingredientes de la salsa y mezcle. Dejar de lado.", "Caliente una sartén grande y agregue el aceite. Una vez caliente, agregue las tortas de cangrejo y cocine en cada lado durante 3-4 minutos, o hasta que estén crujientes y doradas. Coloque en una bandeja de horno en el horno durante cinco minutos.", "Para servir coloque la salsa en el centro del plato y coloque dos pasteles de cangrejo encima. Cubra con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_louisiana_crab_cakes_89340", "title": "Pasteles de cangrejo de Louisiana con salsa de mango y maíz dulce a la parrilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "1 cucharada de harina de maíz", "½ cucharadita de sal", "15 g / ½ oz de manteca de cerdo", "15g / ½ oz de mantequilla", "2 cucharadas de azúcar en polvo", "175ml / 6fl oz de leche, más extra para acristalamiento", "2-3 cucharadas de mermelada de fresa"], "method": ["Precalentar el horno a 200C / 400F / Gas 6", "Mezcle la harina, la harina de maíz y la sal. Con las yemas de los dedos frote la manteca y la mantequilla hasta que la mezcla tenga la textura de pan rallado.", "Agregue el azúcar y agregue gradualmente la leche hasta que se forme una masa suave. Es posible que no necesite usar toda la leche.", "Amase ligeramente la masa sobre una superficie enharinada hasta que se forme una masa homogénea (esto no tardará mucho).", "Estirar la masa a un rectángulo que mide 50x20cm / 20x8in. Extiende la mermelada sobre la masa.", "Ruede la masa desde el lado más largo como si rodara un rollo suizo. Junta los extremos y pégalos juntos con un poco de leche. Forma el anillo en forma de corazón.", "Haga pequeñas incisiones sobre la superficie de la forma del corazón. Cepille la parte superior con leche.", "Hornee durante 15-20 minutos hasta que estén dorados y la base esté bien cocida."], "url": "www_bbc_co_uk_food_recipes_love_cake_99793", "title": "Amo el pastel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/love_cake_99793_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de girasol o aceite de oliva", "1 pollo de 1,8 kg / 4 lb, unido en ocho porciones", "125g / 4½oz de tocino sin corteza sin corteza, cortado en rodajas de 2cm / ¾in", "1 cebolla mediana, finamente picada", "2 dientes grandes de ajo, finamente picados", "50ml / 2fl oz de brandy", "1 botella de 75 cl vino tinto", "1 x 400 g de tomate picado", "2 hojas de laurel", "2-3 ramitas de tomillo fresco", "16 chalotes pequeños", "200 g / 7 oz de champiñones bebé", "sal y pimienta negra recién molida"], "method": ["Caliente 1 cucharada de aceite en una sartén antiadherente grande colocada a fuego medio-alto. Sazonar el pollo por todos lados con sal y pimienta y agregarlo a la sartén. Cocine hasta que esté dorado, volteándolo una vez. Es posible que deba hacer esto en 2 o 3 lotes, dependiendo del tamaño de su bandeja. Transfiera a una cazuela grande e ininflamable. Regrese la sartén al fuego. Agregue el tocino y fría por 2-3 minutos, o hasta que comience a crujiente. Dispersa encima del pollo.", "Agregue la cebolla a la sartén y cocine a fuego lento durante 4-5 minutos hasta que se dore, agregando el ajo durante el último minuto y revolviendo con frecuencia. Incline la cebolla y el ajo en la cazuela con las piezas de pollo.", "Desglasar la sartén con el brandy, revolviendo bien para eliminar la mayor cantidad de sedimentos sabrosos del fondo de la sartén como sea posible. Agregue la mitad del vino tinto y burbuja por unos segundos más. Vierta el resto del vino y el brandy caliente y la mezcla de vino sobre el pollo. Agregue los tomates, las hojas de laurel y el tomillo. Llevar a fuego lento a fuego lento y cubrir sin apretar con una tapa. Cocine por 30 minutos a fuego lento.", "Mientras tanto, ponga los chalotes en un tazón grande y resistente al calor y cubra con agua recién hervida. Deje reposar durante 5 minutos y luego drene el agua. Cuando los chalotes estén lo suficientemente fríos como para manipularlos, quita las pieles dejando intacta una pequeña parte de la raíz para ayudar a mantenerlas unidas.", "Caliente el aceite restante en una sartén limpia y fría las chalotas a fuego medio hasta que estén ligeramente doradas, revolviendo ocasionalmente. Coloque las setas en la misma sartén y cocine con las chalotas por un par de minutos hasta que estén doradas. Revuelva los chalotes y los champiñones en la cazuela después de que el pollo haya estado cocinando durante 30 minutos. Cubra sin apretar una vez más y cocine a fuego lento durante otros 30-45 minutos, o hasta que el pollo esté tierno y las cebollas estén blandas.", "Con una cuchara grande con ranura, transfiera el pollo, el tocino, las verduras y los champiñones a un tazón grande. Regrese la salsa al fuego y llévela a ebullición. Cocine durante 4-5 minutos, o hasta que la salsa se espese, revolviendo regularmente. Cuando la salsa se haya reducido lo suficiente como para cubrir la parte posterior de una cuchara, devuelva el pollo a la sartén y caliente.", "Esto se sirve mejor con puré de patatas cremosas y judías verdes, adornado con perejil recién picado."], "url": "www_bbc_co_uk_food_recipes_love_in_a_transit_coq_au_25368", "title": "Amor en un tránsito (coq au vin)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de soja congelada, descongelada", "1 cebolla roja pequeña, finamente picada", "2 dientes de ajo, aplastados", "½ cilantro pequeño, hojas y tallos finamente picados", "1-2 Pasa a Russell, prueba de Taha", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de semillas de sésamo tostadas", "2 cucharadas de pan rallado seco", "sal marina y pimienta negra recién molida, al gusto", "aceite de oliva aceite en aerosol", "1 pimiento rojo, semillas eliminadas, descuartizado", "1 pimiento amarillo, sin semillas, descuartizado", "2 calabacines, cortados en bastones largos", "1 berenjena, dividida a la mitad a lo largo y luego cortada en medias lunas", "1 cucharadita de pimentón dulce ahumado", "1-2 cucharaditas de vinagre de jerez, al gusto", "½ racimo de cilantro pequeño, desgarrado", "⅓ pepino, aproximadamente pelado, sin semillas, finamente picado", "1 diente de ajo pequeño, aplastado", "100g / 3½oz de yogur griego sin grasa", "1 limón, jugo de ½, resto cortado en rodajas para servir", "pequeña puñado de menta, hojas trituradas"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Seque los frijoles de soya con papel de cocina para eliminar la mayor cantidad de humedad posible. Coloque los frijoles en un procesador de alimentos y mezcle hasta obtener una pasta áspera. Incline en un tazón, combine con los ingredientes restantes del falafel (excepto el aceite de oliva) y sazone al gusto.", "Forme la mezcla en bolas del tamaño de una pelota de golf y colóquela en una bandeja para hornear. Rocíe con un poco de aceite y luego hornee durante 15-20 minutos, o hasta que estén doradas.", "Para las verduras, coloque las verduras en una bandeja para hornear. Rocíe con un poco de aceite de oliva y espolvoree sobre el pimentón ahumado. Sazone con sal y pimienta y cocine junto con el falafel en el horno precalentado durante 20 minutos.", "Mientras tanto haz la inmersión. Combine el pepino con el ajo, el yogur, el limón y la menta y sazone al gusto.", "Una vez que las verduras estén blandas y el falafel dorado y crujiente por fuera, retírelo del horno. Sazone las verduras asadas con un chorrito de vinagre de jerez y mezcle en el cilantro. Sirva con la salsa de yogur y una rodaja de limón en un lado."], "url": "www_bbc_co_uk_food_recipes_low-carb_falafel_with_19951", "title": "Falafel Edamame con verduras asadas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-carb_falafel_with_19951_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rebanadas de pan integral de buena calidad", "rociar aceite de oliva", "6 tomates de ciruela maduros, a la mitad", "1 diente de ajo, finamente cortado", "2 lonchas de tocino, grasa eliminada", "2 huevos frescos muy frescos", "1 cucharadita de vinagre (como el vinagre de vino blanco)", "250 g / 9 oz espinaca bebé, lavado", "3 ramitas de albahaca fresca, hojas rotas", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "½ cucharada de vinagre de jerez", "1 cucharada de mostaza integral"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rompa el pan en trozos del tamaño de un bocado y esparza en una capa uniforme sobre una bandeja para hornear. Rocíe con un poco de aceite de oliva.", "Coloque los tomates en una bandeja por separado, espolvoree con el ajo en rodajas, coloque las rodajas encima de los tomates y sazone con pimienta. Coloque ambas bandejas en el horno durante 8-10 minutos, o hasta que el pan esté dorado y crujiente. Dejar de lado y dejar enfriar.", "Caliente una sartén a fuego alto hasta que esté caliente. Freír el tocino hasta que esté cocido por ambos lados y cocido. Una vez cocinado, cortar en trozos pequeños.", "Para el aderezo, coloque todos los ingredientes en un tarro de mermelada limpio o una pequeña tina hermética. Agregue dos cucharadas de agua y selle. Agitar hasta que se emulsione. Sazonar con sal y pimienta al gusto. (El aderezo puede almacenarse y usarse en otros platos, ya que producirá más de lo que necesita para esta ensalada).", "Pon a hervir a fuego lento una olla grande de agua y agrega el vinagre de vino blanco (no tengas la tentación de agregar sal ya que esto hará que las claras de huevo se desintegren y arruinarán tus huevos escalfados). Rompe los huevos en un molde o plato pequeño. Batir brevemente el agua para crear un vórtice antes de verter suavemente los huevos partidos en el centro del agua que gira lentamente. Cueza durante cuatro minutos en agua hirviendo a fuego lento, o hasta que esté cocido a su gusto. Retire de la sartén y escurra bien sobre papel de cocina.", "Para servir, ponga los trozos de pan, los tomates asados, las tres cuartas partes del tocino picado y toda la espinaca y la albahaca en un tazón grande. Ponga 1 o 2 cucharadas de aderezo y mezcle para mezclar. Coloque en platos para servir y cubra con un huevo escalfado. Sazonar con pimienta y espolvorear sobre los trozos de tocino restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_low-fat_bacon_egg_50154", "title": "Ensalada de tocino, huevo y espinacas con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_bacon_egg_50154_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "100g / 3½oz de harina integral simple", "pizca de sal", "llovizna de aceite", "½ cebolla roja, finamente rebanada", "1 pimiento rojo, sin semillas y en rodajas finas", "½ cucharadita de pimienta de Jamaica molida", "1 cucharadita de pimentón ahumado", "1 cucharadita de semillas de comino", "2 filetes de solomillo (aproximadamente 200 g / 7 oz cada uno), grasa eliminada, cortada en trozos o tiras del tamaño de un bocado", "½ cucharada de aceite de oliva", "100ml / 3½fl oz de yogur sin grasa", "1 lima, solo jugo", "1 cucharadita de aceite de oliva", "2 dientes de ajo, pelados y en rodajas", "2 cucharaditas de semillas de comino", "1 x 400g / 14oz de frijoles negros de hojalata, parcialmente escurridos", "2 tomates maduros, sin semillas y finamente picados", "¼-½ cebolla roja (dependiendo del tamaño), finamente picada", "1 chile rojo, finamente picado", "1 lima, ralladura y jugo", "1 pequeña lechuga iceberg, rallada"], "method": ["Para las tortillas, ponga las harinas en un tazón. Agregue una pizca de sal, un chorrito de aceite y dos cucharadas de agua. Mezcle con sus manos para juntar la mezcla y formar una masa. Agregue un poco más de agua si la mezcla está demasiado seca. Amasar en el bol durante un minuto hasta que quede suave y elástico, luego dejar reposar durante 5-10 minutos.", "Polvore una superficie de trabajo con un poco de harina. Divida la masa en cuatro y extienda cada pieza en un círculo muy fino con un rodillo enharinado.", "Caliente una sartén de base pesada a fuego medio / alto y cocine las tortillas individualmente en la sartén seca durante 2-3 minutos por cada lado, o hasta que estén ligeramente doradas, burbujeantes y cocidas. Transfiera a un plato y envuélvala en una toalla de té limpia mientras cocina las tortillas restantes.", "Para la carne de res, mezcle todos los ingredientes de la carne de res en un tazón y revuelva para cubrir uniformemente el bistec en el aceite y las especias. Deje marinar mientras prepara el yogur de lima. (Esto se puede hacer por adelantado y dejarlo durante un par de horas).", "Para el yogur de lima, mezcle el jugo de lima y el yogur juntos hasta que se combinen. Dejar de lado hasta que esté listo para usar.", "En una sartén caliente, cocine la mezcla de carne con una pizca de sal a fuego alto durante 3-4 minutos, o hasta que la carne esté dorada por completo. Retire de la sartén y descanse en un plato mientras cocina los frijoles negros.", "Para los frijoles, agregue el aceite a la sartén en la que cocinó el bistec. Agregue las semillas de ajo y comino y cocine a fuego medio durante dos minutos hasta que esté aromático. Agregue los frijoles negros y revuelva para mezclar bien. Aplastarlos ligeramente con el dorso de una cuchara de madera a medida que los caliente. Una vez caliente, retirar del fuego y dejar de lado.", "Para la salsa, mezcle todos los ingredientes de la salsa en un tazón pequeño.", "Para servir, unte los frijoles sobre cada tortilla y cubra con un poco de la carne. Cuchara sobre una salsa pequeña, para probar, y rociar una cucharada de yogurt de lima. Agregue una dispersión de lechuga, enrolle y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_low-fat_beef_and_bean_53274", "title": "Burrito de ternera y frijoles bajos en grasa con yogur de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_beef_and_bean_53274_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 rebanadas de pan de masa fermentada, dependiendo del tamaño", "1 cucharadita de aceite de oliva", "1 diente de ajo, pelado", "2 cabezas de lechuga Cos, hojas separadas y rotas", "1 cucharada de queso parmesano rallado", "1 yema de huevo de gallinas camperas", "4 anchoas en aceite de oliva, drenadas, reservas de petróleo", "½ diente de ajo, rallado", "½ limón, jugo y ralladura", "1 cucharadita de mostaza Dijon", "25 g / 1 oz de queso parmesano, finamente rallado", "2 cucharadas de aceite de oliva extra virgen", "pimienta negra"], "method": ["Caliente una sartén a fuego alto hasta que fume. Rocíe el pan con un poco de aceite y frote con el diente de ajo.", "Planche el pan durante 30-40 segundos en cada lado, o hasta que esté dorado y crujiente con líneas profundas de parrilla. Deje que se enfríe un poco y luego corte en trozos del tamaño de un bocado.", "Mientras tanto, haz el vendaje. Ponga la yema de huevo, las anchoas, una cucharada de aceite de anchoa, el ajo, la ralladura de limón y el jugo, la mostaza y el parmesano en un pequeño procesador de alimentos junto con una pizca o dos de pimienta. Mezclar para pegar. (Alternativamente, picar todo muy bien, y mezclar en una pasta en un tazón para mezclar hasta que esté lo más suave posible).", "Con el motor funcionando, hágalo gradualmente en el aceite, unas gotas a la vez, hasta que esté completamente incorporado. Si el aderezo es demasiado espeso, agregue un poco de agua tibia (aproximadamente dos cucharadas soperas) y mezcle nuevamente. Sazone al gusto con pimienta negra.", "Pon la lechuga en un tazón para servir. Vierta sobre el aderezo y mezcle para mezclar y cubrir. Dispersar sobre los croûtons y el parmesano rallado y servir."], "url": "www_bbc_co_uk_food_recipes_low-fat_caesar_salad_38342", "title": "Ensalada César baja en grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_caesar_salad_38342_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 galletas digestivas bajas en grasa", "10 galletas llanas de azúcar bajas en grasa / reducidas, como Rich Tea", "2 cucharadas de miel clara", "75g / 2½oz de mantequilla, derretida", "6 hojas de gelatina", "150ml / 5fl oz de leche desnatada", "50 g / 2 oz de cacao en polvo", "100 g / 3½ oz de azúcar en polvo", "500g / 1lb 2oz queso quark", "300g / 10½oz de yogur griego sin grasa", "1 cucharadita de extracto de vainilla", "1 vaina de vainilla, solo semillas", "2 claras de huevo de gallinas camperas", "300 g / 10½ oz de fresas frescas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee un molde de pastel de 23 cm / 9 pulg. Con papel resistente a la grasa.", "Para la base, coloque todas las galletas en una bolsa de congelador y golpee con un rodillo hasta que se asemejen a pan rallado. Coloque en un tazón para mezclar y agregue la miel y la mantequilla derretida y mezcle bien para combinar. Presione la mezcla en el fondo de la lata.", "Hornee durante 10-12 minutos. Retire del horno y deje enfriar mientras prepara el relleno.", "Para hacer el relleno, remoje las hojas de gelatina en un recipiente con agua helada durante 10 minutos. Coloque la leche, el cacao en polvo y el azúcar en una cacerola. Deje que hierva a fuego lento, revolviendo constantemente, hasta que el azúcar se haya derretido y el cacao esté completamente combinado. Retirar del fuego y dejar enfriar durante unos minutos. Agregue la gelatina y reserve.", "Pon el quark y el yogur en un tazón y bate juntos hasta que quede suave. Agregue el extracto de vainilla y las semillas de vainilla. Batir para mezclar bien y luego agregar la mezcla de cacao. Batir hasta que quede suave y dejar de lado.", "En otro recipiente, bata las claras de huevo hasta que se formen picos suaves cuando se retire el batidor del recipiente. Dobla un tercio de las claras de huevo en la mezcla de pastel de queso y luego dobla cuidadosamente el resto.", "Con una cuchara, coloque la mezcla en la base y luego colóquela en el refrigerador para que se seque durante al menos 4-6 horas o toda la noche, si es posible. Decorar con fresas y servir."], "url": "www_bbc_co_uk_food_recipes_low-fat_cheesecake_31000", "title": "Pastel de queso bajo en grasa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_cheesecake_31000_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 hongos Portobello grandes", "30 g / 1 oz de hongos porcini secos, remojados en 200 ml / 7 fl oz de agua hirviendo durante 20 minutos", "sal marina y pimienta negra", "Setas de botón de 200 g / 7 oz, limpiadas y recortadas", "500ml / 18fl oz de caldo de pollo fresco", "1 hoja de laurel", "500g / 1lb 2oz de patatas cerosas, peladas", "2 cucharaditas de aceite de oliva", "1 cebolla picada", "1 puerro, picado", "2 pechugas de pollo sin piel, cortadas y cortadas", "1 cucharada de harina normal", "½ manojo de estragón, hojas finamente picadas", "320 g / 11 oz de judías verdes"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque los hongos Portobello en una bandeja para hornear y sazone con sal y pimienta. Asar durante 20 minutos, o hasta que estén tiernos, y luego reservar para enfriar. (Ahora también es un buen momento para remojar los hongos porcini en agua hirviendo).", "Coloque el caldo de pollo en una olla pequeña y deje que hierva. Agregue los champiñones y la hoja de laurel y cocínelos durante 6-8 minutos o hasta que estén tiernos.", "Mientras los hongos se cocinan, prepare el relleno. Coloque las papas en una olla grande y agregue suficiente agua caliente para cubrir las papas. Llevar a ebullición, luego cocine a fuego medio durante 5-7 minutos, o hasta que las papas estén tiernas pero no estén cocidas. Escurrir y dejar enfriar, luego cortar en rodajas finas.", "Agregue el aceite de oliva a una sartén grande a fuego medio. Agregue la cebolla y fría por 5-6 minutos, o hasta que se ablanden. Agregue el puerro y continúe cocinando por 7-8 minutos, o hasta que esté suave.", "Una vez que los champiñones estén suaves y tiernos, retire la hoja de laurel y colóquelos en una licuadora junto con el caldo. Agregue la mitad del licor de remojo seco de champiñones (teniendo cuidado de no obtener ningún pedazo de arena de los champiñones secos) y mezcle hasta que quede suave.", "Una vez que el puerro se suaviza, coloque el pollo en la sartén y revuelva para mezclar. Cocine por dos minutos y luego espolvoree la harina. Revuelva para que todo esté cubierto y cocínelo durante tres minutos. Sazonar con pimienta y una pizca de sal.", "Vierta el champiñón y la mezcla de la licuadora en la sartén con el pollo. Agregue los champiñones remojados (descartando el licor restante ya que puede ser arenoso). Mezclar bien. Apague el fuego y agregue el estragón. Cortar los hongos Portabello cocidos y agregar a la mezcla.", "Vierta el relleno de la tarta en un plato de tarta (mide aproximadamente 18x24cm / 7x9½ pulgadas) y extiéndalo uniformemente. Cubra con rebanadas superpuestas de las papas en rodajas.", "Coloque en el horno precalentado y hornee durante 35-40 minutos, o hasta que la cobertura de la papa esté crujiente, dorada y cocida y el relleno esté burbujeante. Cueza los frijoles a su gusto y sirva con el pastel."], "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_and_43509", "title": "Pastel de pollo y champiñones bajos en grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_and_43509_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 pechugas de pollo sin piel, cortadas y cortadas en trozos pequeños", "4 cucharaditas de polvo de garam masala", "1 cucharadita de sal", "4 dientes de ajo rallados", "Jengibre fresco de la raíz de los 3cm / 1½in en pedazos, rallado", "1 limón, solo jugo", "1-2 cucharaditas de aceite de oliva ligero", "3 cebollas, en rodajas finas", "1-2 chiles verdes largos, al gusto, finamente picados", "2 pimientos verdes, semillas extraídas y cortadas en trozos", "1 cucharada de puré de tomate", "200ml / 7fl oz de caldo de pollo o vegetal", "4 tomates, semillas eliminadas, descuartizadas, cortadas en tiras", "½ cilantro de racimo pequeño, aproximadamente picado", "2 tomates, semillas retiradas, descuartizadas y finamente picadas", "medio pepino, toscamente pelado, descuartizado longitudinalmente, sin semillas y en rodajas", "1 cebolla roja, finamente picada", "½-1 guindilla verde, finamente picada", "2 limas, jugo y ralladura", "½ cilantro pequeño, hojas y tallos finamente picados", "pizca de sal", "arroz cocido"], "method": ["Combine el pollo con los ingredientes del adobo en un tazón. Cúbralo con una película adhesiva y transfiéralo a la nevera durante dos horas, o de la noche a la mañana si es posible.", "Caliente el aceite en una sartén grande hasta que esté caliente. Agregue las cebollas en rodajas y los pimientos y fría por 5-6 minutos, revolviendo ocasionalmente hasta que se ablanden. Agregue tres cuartas partes de la guindilla y cocine durante dos minutos, luego agregue el pollo marinado y el adobo. Cocine por 3-4 minutos", "Agregue el puré de tomate al pollo, revuelva para mezclar y cocine por dos minutos. Agregue el caldo, lleve a ebullición y cocine durante 10 minutos para cocinar el pollo.", "Mientras tanto, para la ensalada de cachumba, combine todos los ingredientes en un tazón. Sazone al gusto con sal y reserve.", "Pruebe el pollo y ajuste el condimento según sea necesario. Agregue los tomates, revuelva y cocine durante 5-10 minutos, o hasta que la salsa se espese y sabor y los tomates se ablanden. Retire del fuego. Adornar con cilantro picado y el resto del chile picado y servir con arroz."], "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_curry_88832", "title": "Curry de pollo bajo en grasa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_curry_88832_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pechugas de pollo de 500 g / 1 lb 2 oz cortadas en trozos del tamaño de un bocado", "1 diente de ajo, rallado", "Yogur natural de 75 g / 2½ oz", "1 cucharada de polvo de especias tikka", "1 caldero de pollo, hecho con 100ml / 3½fl oz de agua hirviendo", "2 cebollas medianas, en rodajas", "2 dientes de ajo, en rodajas", "1 cucharadita de jengibre fresco rallado", "1½ cucharadas de polvo de especias tikka", "1 x 400 g de tomate picado", "1 cilantro fresco de racimo pequeño, picado, más extra para decorar", "sal y pimienta negra recién molida", "3 cucharadas de yogur natural", "Arroz basmati marrón 300g / 10½oz cocido según las instrucciones del paquete"], "method": ["Para el pollo marinado, mezcle todos los ingredientes en un tazón, cúbralo con una película adhesiva y colóquelo en el refrigerador a un lado para marinarlo mientras prepara la salsa.", "Para la salsa tikka masala, traiga el caldo a fuego lento en una cacerola. Agregue las cebollas rebanadas, el ajo y el jengibre. Corte un cuadrado de papel para hornear o papel resistente a la grasa lo suficientemente grande como para cubrir la mezcla en la sartén. Empuje hacia abajo para cubrir la cebolla y el ajo, cubra la olla con una tapa y cocine a fuego lento durante 15 minutos.", "Retire el papel. Las cebollas deben ser translúcidas y suaves. Agregue el polvo de especias tikka, los tomates enlatados y el cilantro picado y deje que hierva. Reduzca ligeramente el fuego y cocine a fuego lento durante 20-30 minutos, hasta que la salsa se espese. Sazonar con sal y pimienta negra recién molida y dejar a un lado para que se enfríe un poco.", "Mientras tanto, precalentar la parrilla a su temperatura más alta. Cubra una bandeja de horno con papel de aluminio, y luego coloque el pollo marinado en la bandeja en una sola capa. Ase el pollo durante 15 minutos, o hasta que las piezas de pollo estén bien cocidas. Dele la vuelta al pollo a la mitad de la cocción, para asegurarse de que esté dorado por todas partes.", "Con una batidora o un procesador de alimentos, mezcle la salsa tikka masala hasta que quede suave. Regrese al fuego y caliente, luego agregue el yogurt natural. (No hierva la salsa después de agregar el yogur o se partirá.) Mezcle los trozos de pollo cocidos en la salsa y sirva con arroz basmati marrón y una pizca de cilantro para terminar."], "url": "www_bbc_co_uk_food_recipes_low-fat_chicken_tikka_04689", "title": "Pollo bajo en grasa tikka masala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chicken_tikka_04689_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de oliva en aerosol para cocinar, para engrasar", "4 claras de huevo grandes de gallinas camperas", "pizca de sal", "2 huevos grandes de gallinas camperas", "1 cucharadita de extracto de vainilla", "75 g / 2½ oz de azúcar en polvo de oro", "2 manzanas Braeburn, peladas, sin corazón y ralladas", "100 g / 3½ oz de harina de auto crianza, tamizada", "40 g / 1½ oz de cacao en polvo, tamizado", "Frambuesas 150g / 5½ oz", "75g / 2½oz de azúcar glas, tamizado, más extra para espolvorear"], "method": ["Precalentar el horno a 170 ° C / 330 ° F / Gas 3.", "Engrase una lata de torta antiadherente de 20 cm / 8 in con un poco de aceite de oliva en aerosol para cocinar. Con un batidor de mano eléctrico, bata las claras de huevo con una pizca de sal hasta que se formen picos rígidos cuando se retire el batidor del tazón, luego déjelos a un lado.", "En un recipiente aparte, bata los huevos enteros, el extracto de vainilla y el azúcar impalpable hasta que estén pálidos, duplique su volumen y el azúcar se haya disuelto.", "Doble la manzana, la harina y el cacao en polvo con una cuchara de metal y luego doble un tercio de la mezcla de clara de huevo en la mezcla de cacao. Una vez combinado, dobla esto en la mezcla restante de clara de huevo.", "Con una cuchara, vierta la mezcla suavemente en el molde de la torta y hornee por 30 minutos, o hasta que se haya levantado (cuando se cocina, la esponja debe rebotar cuando se la presiona ligeramente). Transfiera a una rejilla y déjelo enfriar.", "Una vez que se haya enfriado, corta el pastel por la mitad horizontalmente para crear dos capas. Aplaste dos tercios de las frambuesas y una cucharada de azúcar glas juntos aproximadamente en un tazón y extienda esta mezcla sobre la parte superior de uno de los pedazos de la torta. Encima con la otra pieza.", "Mezcle el azúcar glas restante y suficiente agua para unirlo y formar una fina capa de consistencia de llovizna. Rocíe el glaseado sobre el pastel, deje reposar por 2-3 minutos para endurecerlo un poco y luego decore con las frambuesas restantes."], "url": "www_bbc_co_uk_food_recipes_low-fat_chocolate_sponge_79500", "title": "Bizcocho de chocolate con poca grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_chocolate_sponge_79500_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla mediana, finamente picada", "2 zanahorias pequeñas, peladas y cortadas en cubitos", "2 palitos de apio, cortados y finamente cortados", "250g / 9oz% 20lean% 20beef% 20mince% 20 (menos% 20than% 2010 %% 20fat)", "1 cucharada de ketchup de tomate", "1 cucharada de salsa marrón", "½ cucharada de salsa Worcestershire", "1 cucharada de harina normal", "½ cucharadita de chile en polvo", "½ cucharadita de hojuelas de chile seco (opcional)", "½ cucharadita de pimienta negra recién molida", "200g / 7oz de papas harinosas, preferiblemente King Edwards o Maris Pipers, peladas y cortadas en cubos de 1.5cm / ¾in", "300 ml / ½ pinta de caldo de carne de vacuno, hecho con 1 cubo de carne de vacuno", "75g / 3oz de guisantes congelados", "2 x 145 g / 5 oz de paquetes base de pizza mix", "aproximadamente 200ml / 7fl oz de agua tibia", "harina común, para amasar y enrollar", "1-2 cucharadas de leche semidesnatada"], "method": ["Coloque la cebolla, las zanahorias, el apio y la carne juntos en una cacerola grande antiadherente y fríalos a fuego fuerte durante 2-3 minutos, hasta que la carne ya no esté rosada. Sigue revolviendo con un par de cucharas de madera para romper la carne picada.", "Reduzca el fuego y agregue la salsa de tomate, salsa marrón, salsa Worcestershire, harina, chile en polvo y hojuelas de chile (si se usa) y pimienta negra.", "Cocine por un minuto, luego agregue las papas y el caldo.", "Llevar a ebullición, reducir el calor y cubrir sin apretar. Cocine a fuego lento durante 25 minutos hasta que las papas estén tiernas, revolviendo ocasionalmente. Si es necesario, retire la tapa durante los últimos cinco minutos y revuelva con más regularidad hasta que la mezcla esté espesa.", "Retirar del fuego, agregar los guisantes congelados y dejar enfriar por completo.", "Para hacer la masa, coloque las mezclas de base de pizza en un tazón grande y mezcle con agua tibia de acuerdo con las instrucciones del paquete.", "Dé vuelta a una superficie ligeramente enharinada y amase durante cinco minutos hasta que la masa esté suave y elástica.", "Precalentar el horno a 180C / 350F / Gas 6.", "Usando escamas, divida la masa en seis partes iguales, cada una será de aproximadamente 80 g / 3 oz.", "De cada porción, retire 35 g / 1¼ oz de la masa para usar en las tapas de las empanadas.", "Estire la pieza más grande de cada porción sobre una superficie ligeramente enharinada hasta que tenga alrededor de 3 mm / 1/8 pulgadas de grosor y lo suficientemente grande como para revestir su plato de pastel de aluminio, dejando un poco sobresaliendo por los lados.", "Levante en un plato de pastel y presione bien en la base y los lados. Esto puede ser un poco complicado la primera vez, pero la masa es muy indulgente, así que tómalo lentamente hasta que te acostumbres al método.", "Coloque una sexta parte de la mezcla de carne picada y papa en la caja de tarta. Cepille los bordes sobresalientes con un poco de leche.", "Estire la porción más pequeña de la masa hasta que esté lo suficientemente grande como para cubrir el plato de tarta. Levantarlo en la parte superior del pastel y pellizcar firmemente la masa. Recortar con tijeras de cocina: con las tijeras se detendrá el estiramiento de la masa.", "Repita exactamente el mismo proceso para hacer las otras cinco tartas y colóquelas en una bandeja para hornear.", "Recorte una vez en el centro de cada tapa de pastelería con unas tijeras para crear un gran agujero para que salga el vapor. Cepille los pasteles generosamente con más leche.", "Hornee los pasteles por 15 minutos, luego retírelos del horno y cubra cada uno bastante bien con papel de aluminio.", "Vuelva a colocarlos en el horno por otros 15 minutos o hasta que los pasteles queden dorados y el relleno esté bien caliente.", "Retire los pasteles del horno y déjelos reposar durante cinco minutos antes de retirar la lámina, ¡y luego colóquelos!"], "url": "www_bbc_co_uk_food_recipes_low-fat_minced_beef_and_34423", "title": "Tartas de carne y papas bajas en grasa", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_minced_beef_and_34423_16x9.jpg", "isVegetarian": false, "recommendations": 0}]