[{"ingredients": ["¼ de cebolla, más o menos picada", "1½ chiles verdes serrano o jalapeño, tallos eliminados, cortados a la mitad", "2 dientes de ajo, finamente picados", "125 ml / 4½ fl oz de caldo de pollo o agua", "380g tomatillos de estaño, disponible en línea", "½ cucharadita de sal marina en copos", "300 ml / 10 fl oz de maíz o aceite de girasol, más 2 cucharadas", "4 tortillas de maíz, cada una cortada en 8 triángulos", "4 huevos de gallinas camperas", "75g / 2½oz de queso Lancashire o queso feta, desmenuzado", "1 chalote, en rodajas finas", "1 cucharada de cilantro fresco tostado", "4 cucharadas de crema agria"], "method": ["Coloque la cebolla, los chiles, el ajo, el caldo y los tomatillos en un procesador de alimentos y mezcle para hacer una salsa.", "Coloque una cacerola a fuego medio y agregue 2 cucharadas de aceite de maíz. Agregue la salsa y sazone con sal al gusto. Cocine a fuego lento durante 5 minutos, o hasta que espese.", "Caliente 300ml / 10fl oz de aceite a 190C en una bandeja grande de gran capacidad (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Freír los triángulos de tortilla hasta que queden dorados y crujientes, luego escurrir sobre papel de cocina.", "Freír los huevos en un poco de aceite en una sartén a fuego medio, hasta que estén cocidos a su gusto.", "Revuelva las tortillas en la salsa, doblando ligeramente para cubrirlas pero teniendo cuidado de no romperlas. Divida la mezcla entre cuatro cuencos tibios poco profundos y cubra cada uno con un huevo frito. Cubra con queso desmenuzado, chalote, cilantro y crema agria. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fried_eggs_with_a_crispy_99565", "title": "Chips de tortilla fritos en salsa verde con huevos fritos y queso desmenuzado (chilaquiles)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_eggs_with_a_crispy_99565_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 hongos Portobello (aproximadamente 8 cm / 3¼ pulgadas de diámetro), tallos recortados y reservados, piel pelada y reservada", "110ml / 4fl oz de aceite de oliva", "3 dientes de ajo, aplastados", "4 ramitas de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "5 huevos de gallinas camperas", "2 cucharadas de vinagre de vino blanco", "sal y pimienta negra recién molida", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "aceite vegetal, para freír", "150g / 5oz de chalotes (aproximadamente 4 chalotes grandes), finamente picados", "2 dientes de ajo, finamente picados", "300ml / 11fl oz de vino tinto", "40ml / 1½fl oz de aceite de oliva", "sal y pimienta negra recién molida", "110g / 4oz cebollas rojas pequeñas, como cebollas rojas perladas, peladas y partidas a la mitad", "30 g / 1¼ oz de mantequilla", "60ml / 2½fl oz de caldo de pollo (o agua)", "sal y pimienta negra recién molida", "4 cucharaditas de aceite de oliva", "150g / 5oz de setas silvestres mezcladas (como castaña, shiitake y girolles), recortadas y enjuagadas", "guarniciones y piel de hongos portobello (ver arriba)", "1 pierna de pato confitado listo para usar, carne recogida de hueso y picada", "2 cucharadas de vinagre de jerez", "mezcla de granos de pimienta agrietados, al gusto", "10g / ¼ oz de cebollín fresco, en rodajas", "110 g / 4oz de hojas de ensalada verde mixta", "1 cucharada de jugo de limón", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "50g / 2oz pato 'chicharrones' (piel de pato frito)"], "method": ["Para las setas Portobello a la parrilla, coloque los champiñones en un bol, rocíe sobre el aceite y espolvoree con el ajo y las hojas de tomillo. Sazonar, al gusto, con sal y pimienta negra recién molida. Mezcle hasta que los champiñones estén cubiertos en la mezcla de adobo. Déjalo marinar durante al menos una hora.", "Para el huevo crujiente, ponga a hervir una olla grande de agua. Agregue el vinagre y una pizca de sal. Coloque un recipiente con agua helada al costado.", "Hierva 4 de los huevos en el agua por exactamente 5 minutos, luego retírelos de la sartén con una espumadera y déjelos enfriar en el agua helada.", "Rompe el huevo restante en un tazón. Batir y agregar una pizca de sal y pimienta negra recién molida.", "Espolvoree la harina y las migas de pan en dos platos separados y sazone con sal y pimienta negra recién molida.", "Pele los huevos hervidos enfriados. Primero, drage cada una en la harina, luego sumérjala en el huevo batido y luego enróllela hasta que esté completamente cubierta. Enfríe en la nevera.", "Mientras tanto, para el puré de chalote, llevar los chalotes, el ajo y el vino a fuego lento en una olla pequeña. Cocine a fuego lento hasta que los chalotes estén tiernos y el vino se haya evaporado casi por completo.", "Transfiera la mezcla a un procesador de alimentos, agregue el aceite de oliva y mezcle hasta obtener un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida, luego dejar de lado hasta que se necesite. Mantener caliente", "Cuando los champiñones se hayan marinado, precaliente la parrilla a fuego medio y ase los champiñones durante 7-8 minutos en cada lado, o hasta que estén cocidos.", "Corte cada hongo a la parrilla en un círculo perfecto con un cortador de galletas de 7,5 cm / 3 in. Luego, corte un círculo más pequeño dentro de cada hongo usando un cortador de galletas de 4 cm / 1½ pulgadas para hacer una forma de rosquilla. Mantener caliente", "Picar y reservar los recortes cocidos.", "Para el pato confitado fricassée, mezcle las cebollas rojas, la mantequilla y el caldo de pollo en una sartén pequeña. Sazonar, al gusto, con sal y pimienta negra recién molida. Llevar la mezcla a fuego lento y cocinar hasta que los chalotes estén tiernos, alrededor de 3-4 minutos.", "Caliente el aceite de oliva en una sartén por separado a fuego medio a alto. Agregue las setas silvestres mezcladas, el ajo y el tomillo y fría por 2-3 minutos, o hasta que se ablanden. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue las guarniciones reservadas de las setas Portobello a la parrilla, la carne de pierna de pato confitada y la mezcla de cebolla y mezcle bien.", "Vierta el vinagre de jerez y fría por 2-3 minutos más.", "Justo antes de servir, caliente el aceite en una freidora a 180C / 350F. Enrolle los huevos fríos recubiertos en más migas de pan, luego fríalos hasta que estén dorados. Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina. Espolvorea con sal.", "Para servir, coloque una cucharada de puré de chalota en el centro de cada una de las cuatro placas para servir. Ponga una cucharada grande de confit de pato fricas en la parte superior, luego coloque un anillo de champiñón a la parrilla en la parte superior. Rebane el extremo más ancho de cada huevo frito para exponer la yema, luego coloque uno dentro de cada hongo Portobello. Espolvorea una pizca de granos de pimienta agrietados y algunas cebolletas.", "Batir el jugo de limón con el aceite de oliva y sazonar, al gusto, con sal y pimienta negra recién molida. Agregue las hojas de ensalada y mezcle para cubrir las hojas en el aderezo. Arregle la ensalada alrededor del borde del plato con algunos chisporroteos de pato. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_fried_egg_bourguignon_90211", "title": "Huevo frito 'bourguignon' con confit de pato y chicharrones y champiñones portobello a la parrilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "200g / 7oz de cocción de chorizo, cortado en pequeños trozos", "1 tomate, pelado, sin semillas, finamente picado", "2 dientes de ajo picados", "1 chalote, picado", "Pimientos asados ​​110g / 4oz (de un tarro), rebanados gruesos", "350g / 12oz de judías en conserva, escurridas", "2 ramitas de romero, finamente picadas", "4 ramitas de tomillo, finamente picado", "2 cucharaditas de pimentón dulce ahumado", "250ml / 9fl oz de caldo de pollo", "50 g / 1¾oz de mantequilla sin sal", "5 cucharadas de crema doble", "2 cucharadas de perejil de flatleaf tostado", "2 cucharadas de aceite de oliva", "1 lenguado entero de limón o solla, fileteado y deshuesado", "50 g / 1¾oz de mantequilla sin sal"], "method": ["Caliente una sartén grande hasta que esté a fuego medio. Agregue el aceite de oliva y el chorizo ​​y cocine durante 5 minutos, o hasta que el aceite haya cambiado de color y el chorizo ​​esté crujiente alrededor de los bordes.", "Agregue el tomate, el ajo y la chalota. Freír suavemente por un minuto, luego agregar los pimientos, frijoles, romero, tomillo y pimentón y cocinar por otros 2 minutos.", "Agregue el caldo y caliente a fuego lento. Cocine durante 4-5 minutos, o hasta que la chalota se haya suavizado y el volumen del líquido se haya reducido ligeramente. Agregue la mantequilla, la crema y el perejil. Sazonar, al gusto, con abundante pimienta negra.", "Para el pescado, caliente el aceite en una sartén mediana. Una vez caliente, agregue el pescado con la piel hacia abajo en la sartén y cocine por 2-3 minutos en cada lado. Agregue la mantequilla y hilvane el pescado con él mientras se derrite.", "Para servir, coloque los frijoles en tazones para servir y cubra con los pescados."], "url": "www_bbc_co_uk_food_recipes_fried_flat_fish_with_a_83200", "title": "Pescado plano frito con guiso de frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de lenguado o solla (sin piel oscura) de 450 g / 1 lb, cortados en tiras de 2,5 cm / 1 in", "2 cucharaditas de sal", "¼ cucharadita de pimienta blanca recién molida", "2 huevos medianos de granja", "50g / 1¾oz de harina de maíz", "150ml / 5fl oz de maní o aceite vegetal", "3 cucharadas de ajo, en rodajas finas", "2 cucharadas de cebollas de primavera, finamente picadas", "2 cucharadas de vino de arroz Shaoxing o jerez seco", "2 cucharaditas de aceite de sésamo"], "method": ["Si está usando solla, pídale al pescadero que quite la piel oscura de la solla o quítela usted mismo con un cuchillo pequeño y filoso.", "Cortar los filetes de pescado en tiras de 2,5 cm / 1 in. Espolvorear con una cucharadita de sal y pimienta. Dejar en la nevera durante 15 minutos.", "Batir los huevos en un tazón pequeño. Cubra los trozos de pescado en harina de maíz y luego huevo batido.", "Caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agrega el aceite. Cuando esté muy caliente y ligeramente humeante, reduzca el fuego a medio. Poco fríe las piezas de pescado en cada lado, en varios lotes, hasta que estén doradas. Escurrirlos en papel de cocina. Vierta el aceite y deséchelo.", "Limpie el wok o la sartén. Agregue el resto de los ingredientes y la cucharadita restante de sal. Cocine a fuego lento durante 2 minutos. Coloque los filetes de pescado fritos en un plato caliente para servir y vierta sobre la salsa picante. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_fried_fish_with_garlic_83139", "title": "Pescado frito con ajo y cebolletas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de vinagre de vino tinto", "½ cucharadita de miel", "4 tomates, finamente picados", "½ cebolla roja, finamente picada", "1 diente de ajo pequeño, finamente picado", "1 chile rojo, finamente picado, o ½ cucharadita de chile rojo seco", "1 ramita de romero fresco, solo hojas, muy finamente picado", "puñado de hojas de perejil fresco, triturado", "puñado de hojas de albahaca fresca, triturado", "50g / 1¾oz de harina natural", "2 huevos de gallinas camperas", "Pan rallado de 75 g / 2½ oz (fresco o panko)", "2 cucharaditas de hierbas provenzales o similares", "500g / 1lb 2oz de queso de cabra, sin corteza, cortado en rondas", "aceite de oliva, para freír", "2 dientes de ajo, en rodajas", "sal y pimienta negra recién molida", "2 cucharadas de miel, calentadas suavemente (opcional)"], "method": ["Si está sirviendo la salsa, hágalo primero para permitir que los sabores se fundan y desarrollen mientras cocina el queso. Pon el aceite, el vinagre y la miel en un tazón y revuelve hasta que la miel se haya disuelto. Agregue los ingredientes restantes y sazone. Dejar de lado.", "Para hacer el queso frito, ponga la mitad de la harina en un plato pequeño. Coloca uno de los huevos en un tazón pequeño y bate. Coloque la mitad de las migas de pan en un plato pequeño, agregue la mitad de las hierbas y sazone.", "Sumerja la mitad de las rodajas de queso en la harina y luego elimine el exceso de polvo. Luego sumérgelos en el huevo y quítate el exceso. Finalmente, presiónalos en las migas de pan y voltéalos hasta que estén cubiertos. Dejar de lado. Repita con la harina restante, huevo, pan rallado y queso.", "Vierta el aceite en una sartén grande hasta 1cm / ½ en profundidad. Agregue el ajo y freír hasta que comience a colorear, luego retire de inmediato.", "Freír el queso en tandas (no se dorarán si abarrota la sartén) y escurrir sobre papel de cocina.", "Sirva el queso frito con la salsa o rociado con la miel."], "url": "www_bbc_co_uk_food_recipes_fried_goats_cheese_52240", "title": "Queso de cabra frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Queso gruyere 250 g / 9 oz, rallado", "2 yemas de huevo de gallinas camperas", "1 cucharada de salsa Worcestershire", "1 cucharadita de mostaza en polvo", "2 pizcas de pimienta de cayena", "crema para salpicaduras (si la mezcla es demasiado gruesa para untar)", "4 rebanadas de pan blanco fino (cuadrado)", "4 rebanadas finas de jamón cocido", "aceite de oliva"], "method": ["Coloque todos los ingredientes de relleno de sándwich (excepto la crema) en un procesador de alimentos y mezcle hasta que quede suave (la mezcla se debe extender fácilmente, pero agregue un poco de crema si es necesario).", "Cubra cuatro rebanadas de pan con una fina capa de mezcla de queso casi hasta el borde, coloque una loncha de jamón sobre eso y, finalmente, coloque otra rebanada de pan en el jamón. Presione firmemente y luego repita el proceso para el segundo sándwich. Corta las cortezas y cepilla (o rocía) generosamente cada lado de los sándwiches con aceite de oliva.", "Corta cada sándwich a la mitad para darles cuatro rectángulos. Caliente una sartén grande y antiadherente hasta que esté a fuego medio y fría los sándwiches en la sartén hasta que estén dorados y dorados por ambos lados, unos dos minutos por lado."], "url": "www_bbc_co_uk_food_recipes_fried_ham_and_cheese_34474", "title": "Sandwich de jamón y queso frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_ham_and_cheese_34474_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo 400 g / 14 oz, recortado", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "110 g / 4 oz de azúcar", "90 g / 3½ oz de mantequilla", "½ limón, solo jugo", "500g / 1lb 2oz de membrillo, pelado, sin núcleo, picado", "50 g / 1¾oz de mantequilla sin sal", "1 cabeza de acelga, hojas retiradas y desmenuzadas", "Jus de cerdo 200ml / 7fl oz o salsa"], "method": ["Para el filete de cerdo, precaliente el horno a 200C / 400F / Gas 6.", "Sazonar el filete de cerdo con sal y pimienta negra recién molida.", "Caliente una sartén a prueba de horno hasta que esté caliente, agregue el aceite y luego el filete de cerdo, y dórelo hasta que se dore por todos lados (aproximadamente 30-45 segundos en cada lado).", "Transfiera la sartén al horno y tueste durante 6-8 minutos. Retire del horno y descanse durante cinco minutos en la sartén.", "Para el membrillo, caliente el azúcar, 40 g / 1½ oz de la mantequilla y el jugo de limón con 500 ml / 18 fl oz de agua en una olla no reactiva hasta que el azúcar se disuelva y la mezcla esté bien combinada.", "Agregue el membrillo y ponga la mezcla a ebullición. Reduzca el fuego y cocine a fuego lento hasta que el membrillo se haya suavizado. Cuele el líquido, reservando unas cucharadas.", "Transfiera la mitad del membrillo a un procesador de alimentos y mezcle hasta obtener un puré suave. Pase el puré por un colador fino, aflojando la mezcla colada con un poco del líquido de cocción reservado si es necesario.", "Pon el puré de membrillo en una olla limpia. Sazonar, al gusto, con sal y pimienta negra recién molida, y cubrir con una película adhesiva hasta que se requiera.", "Para el resto del membrillo, caliente la mantequilla restante en una sartén y, una vez caliente, agregue el membrillo y fría por 1-2 minutos.", "Para la acelga marchita, caliente la mantequilla en una sartén grande y una vez caliente agregue la acelga y cocine hasta que se marchite.", "Para servir, corte la carne de cerdo y divídala entre dos platos para servir. Agregue el puré, el membrillo frito y la acelga marchita."], "url": "www_bbc_co_uk_food_recipes_fried_pork_fillet_with_64068", "title": "Filete de cerdo frito con membrillo y acelga marchita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 filetes grandes de caballa", "1 naranja, jugo y ralladura solamente", "3 rebanadas de cebolla roja", "3 cucharadas de vinagre de jerez", "1 cucharadita de sal marina", "1 vaso pequeño de vino blanco", "algunos granos de pimienta", "3 hojas de laurel", "8 rebanadas de jamón", "500 g / 1lb2oz de batatas", "500g / 1lb 2oz de papa, para puré", "1 huevo de gallinas camperas", "200 g / 7 oz harina 00, más extra para quitar el polvo", "2 litros de caldo de verduras", "100g / 3½oz de mantequilla sin sal", "puñado de samphire recién elegido (opcional)", "aceite de oliva virgen extra, al gusto", "12 hojas grandes de salvia, más o menos picadas", "75g / 2½ oz de parmesano, recién rallado", "½ cebolla roja, finamente picada", "1 albahaca grande", "3 tomates grandes maduros, pelados y toscamente picados", "una pizca de sal marina ahumada (disponible en delicatessen especializadas y en línea)", "rociar un buen aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la caballa, corte los filetes por la mitad y colóquelos en un tazón grande. Agregue la ralladura de la mitad de la naranja, el jugo de naranja, las rodajas de cebolla, el vinagre de jerez, la sal marina, el vino blanco, algunos granos de pimienta y las hojas de laurel. Déjelo marinar durante una hora, luego escurra el líquido y déjelo a un lado hasta que esté listo para cocinar.", "Para los Gnocchi, hierva o hornee las batatas y las papas en sus pieles hasta que estén tiernas (la ebullición será más rápida). Si está horneando, caliente el horno a 180 ° C / 350 ° F / Gas 4 y tenga en cuenta que las batatas tomarán menos tiempo para cocinar que las otras patatas.", "Una vez que las papas y las batatas estén cocidas y lo suficientemente frías como para manipularlas, quíteles las pieles y empuje la carne a través de un ricer de papa (o use un triturador de papa).", "Sazone al gusto con sal y pimienta negra recién molida. Luego agregue el huevo y la harina un poco a la vez para formar una masa suave y ligeramente pegajosa.", "Incline la masa sobre una superficie de trabajo limpia y enharinada. Divida la mezcla en ocho y gire en forma de salchichas de aproximadamente 1 cm / ½ pulgada de grosor. Cortar en secciones largas de 2cm / and pulgadas y enrollar la harina. Cuidadosamente, pero con bastante firmeza, mueva cada pieza hacia abajo por los dientes de un tenedor (esto hará las hendiduras tradicionales). Comprima los gnocchi ligeramente con el pulgar y ruede en una bandeja enharinada (para redondear los extremos). Reserve por unas horas para configurar (o puede congelarlas hasta que las necesite).", "Para la ensalada, combine todos los ingredientes en un tazón. Mezcle y reserve hasta que esté listo para usar.", "Cuando esté listo para cocinar los gnocchi, llene una cacerola grande con el caldo y llévela a ebullición. Agrega los gnocchi.", "Mientras el gnocchi se cocina, prepare la salsa. Suavemente derrita la mantequilla en una sartén grande hasta que la mantequilla se vuelva de un color marrón claro. Agregue el samphire (si se usa), un ladel del licor de cocina gnocchi y un poco de aceite de oliva virgen extra. Retire del fuego y agregue las hojas de salvia.", "Cuando los gnocchi flotan a la superficie, están listos. Escurrirlos y echarlos en la mantequilla. Sazone al gusto con sal y pimienta negra recién molida. Espolvorea sobre el parmesano.", "Para la caballa, caliente una sartén antiadherente grande y fría el jamón hasta que quede crujiente. Retire de la sartén y reserve.", "Freír los filetes de caballa en la misma sartén, con la piel hacia abajo primero. Después de 2-3 minutos voltee y cocine el otro lado durante unos minutos.", "Sirva los gnocchi con la ensalada de tomate y la caballa frita con el crujiente jamón. Rocíe el jugo de la ensalada de tomate."], "url": "www_bbc_co_uk_food_recipes_fried_mackerel_and_sweet_44395", "title": "Caballa frita y gnocchi de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 salmonetes rojos pequeños o 4 medianos, a escala y eviscerados", "½ cucharadita de sal", "pimienta negra recién molida", "sémola, para quitar el polvo", "50ml / 2fl oz de aceite de oliva", "2 naranjas pequeñas; 1 zested y jugo, 1 finamente cortado en rondas", "1 cucharada de alcaparras", "1 cucharada de piñones, tostados", "pizca de copos de chile", "pequeño puñado de perejil, toscamente picado"], "method": ["Sazonar el salmonete con la sal y un poco de pimienta, y el polvo con sémola.", "Calentar el aceite de oliva en una sartén a fuego medio y freír el pescado en ambos lados hasta que se dore. Transfiera a un plato y manténgalo caliente.", "Desglasar la sartén con la ralladura de naranja y el jugo, luego agregar las rodajas de naranja, las alcaparras, los piñones, los copos de chile y el perejil a la sartén y calentar. Vierta sobre el pescado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_fried_red_mullet_with_82300", "title": "Salmonetes fritos con naranjas y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_red_mullet_with_82300_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de lentejas Castelluccio", "1½ dientes de ajo, todo el clavo pelado y mitad clavo de olor en rodajas", "aceite de oliva virgen extra para aderezo", "500g / 1lb 2oz Hojas de acelga suizas, tallo y venas gruesas eliminadas y dejadas a la mitad", "2 cucharadas de aceite de oliva", "1 cucharadita de semillas de hinojo, trituradas", "12 vieiras (con huevas), limpiadas", "1 cucharadita de alcaparras pequeñas en vinagre, escurridas", "1 chile rojo fresco, finamente picado", "12 hojas de salvia", "1 limón, solo jugo", "sal marina y pimienta negra recién molida"], "method": ["Pon las lentejas en una sartén con todo el diente de ajo. Cubra con agua y cocine a fuego lento, luego cocine durante 20-25 minutos hasta que estén tiernos. Escurra las lentejas. Sazone y agregue una buena pizca de aceite de oliva virgen extra, luego cubra y mantenga caliente.", "Mientras tanto, blanquee las hojas de acelga en agua hirviendo con sal durante unos 3 minutos hasta que estén tiernas. Drene bien, exprimiendo el exceso de agua.", "Calentar 1 cucharada de aceite de oliva en una olla limpia y freír el ajo en rodajas con las semillas de hinojo a fuego medio-alto durante 30 segundos. Agregue la acelga suiza escurrida y revuelva para combinar. Sazonar con sal y pimienta, retirar del fuego, tapar y mantener caliente.", "Caliente una sartén de base pesada a fuego alto. Mezcle las vieiras en un recipiente con sal, pimienta y 1 cucharada de aceite de oliva. Cuando la sartén esté muy caliente, coloque con cuidado las vieiras en la sartén y cocínelas durante 1 minuto por cada lado hasta que queden doradas y cocidas. Agregue las alcaparras, el chile, las hojas de salvia y un chorrito de limón. Servir caliente, con lentejas y acelga."], "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_25567", "title": "Vieiras fritas con chile, salvia y limón, y acelgas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz blanco miso", "150 g / 5½ oz de azúcar en polvo", "aceite vegetal, para freír", "2 berenjenas, cortadas en cubos de 1-2 cm / ½ pulgadas", "2 cucharadas de cilantro fresco tostado", "50g / 1¾oz de mantequilla", "12 vieiras, limpias, huevas eliminadas", "100g / 3½oz de frijoles edamame", "1 cucharada de semillas de sésamo blanco", "1 cucharada de semillas de sésamo negro", "1 cucharada de berro de coriandro", "1 cucharada de berro de amaranto rojo"], "method": ["Mezcle el miso y el azúcar con 50 ml / 2 fl oz de agua en una cacerola, y llévelo a ebullición. Cocine a fuego lento durante 8-10 minutos, hasta que se espese y se oscurezca en color. Decantar la mezcla en un recipiente hermético como una botella squeezy equipada con una tapa pequeña de la boquilla.", "Caliente el aceite en una freidora a 180 ° C. Alternativamente, caliente el aceite en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Fríe la berenjena picada en dados, en lotes si es necesario, durante 2 a 3 minutos, o hasta que estén doradas y crujientes. Retirar del aceite con una cuchara ranurada, luego dejar de lado para escurrir sobre papel de cocina. Espolvorea sobre el cilantro picado y mezcla. Repita el proceso con la berenjena restante.", "Caliente la mantequilla en una sartén grande a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue las vieiras y fría en cada lado durante 2-3 minutos, o hasta que estén doradas y recién cocidas. Agregue los frijoles edamame y continúe freír hasta que estén calientes. Mezcle las semillas de sésamo juntas.", "Para servir, vierta la berenjena frita sobre los platos de servir, vierta sobre los frijoles edamame y espolvoree las semillas de sésamo encima. Termine con las vieiras fritas y una llovizna de la salsa miso, luego decore con el berro mezclado."], "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_62665", "title": "Vieiras fritas con caramelo miso berenjena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 berenjenas grandes", "aceite vegetal, para freír", "200ml / 7fl de leche en oz", "6 cucharadas de sémola", "copos de sal marina, aplastados", "75ml / 2½fl oz de miel clara", "Aleppo pimienta (pul biber) copos de chile, para servir (opcional)"], "method": ["Pele las berenjenas y córtelas en discos de 3,5 cm / 1¼ pulgadas de grosor. Luego corte cada rebanada aproximadamente en trozos de aproximadamente 5 cm de diámetro. La variación de la forma no importa y tampoco la incoherencia de tamaño: simplemente haga que las piezas tengan aproximadamente el mismo tamaño para que se cocinen al mismo tiempo.", "Vierta aproximadamente 5 cm / 2 en aceite vegetal en una sartén grande y profunda y caliente el aceite a fuego alto. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Vierta la leche en un tazón pequeño. Incline la sémola en un plato lateral pequeño y sazone bien con sal triturada. Sumerja las piezas de berenjena en la leche, luego sacuda el exceso de leche e inmediatamente enrolle las piezas en la sémola sazonada.", "Cocinar en lotes, poner los trozos de berenjena cubiertos en el aceite caliente y freír durante aproximadamente 1 minuto en cada lado, o hasta que estén dorados y cocidos. Una vez cocinado, transfiéralo a una bandeja o plato forrado con papel de cocina para absorber el exceso de aceite. Repita con los lotes siguientes.", "Sirva con una buena llovizna de miel clara y una pizca de hojuelas de chile, si se usa."], "url": "www_bbc_co_uk_food_recipes_fried_semolina-crusted_09005", "title": "Berenjena frita con costra de sémola y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "2 chalotes, finamente picados", "50g / 1¾oz de jengibre fresco, pelado y finamente cortado", "200ml / 7fl oz de vino blanco", "200ml / 7fl oz de caldo de pescado", "Crema doble de 200 ml / 7 fl oz", "2 suela de limón, sin piel y fileteado", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "2cm / 1in pieza de jengibre fresco, pelado, cortado en tiras", "1 calabacín, cortado en tiras", "1 pimiento rojo, cortado en tiras", "Mangetout 100g / 3½ oz, cortado en tiras", "100g / 3½oz de guisantes frescos", "100 g / 3½ oz de habas, blanqueadas", "2 cucharadas de perifollo", "Jengibre fresco de raíz de 2cm / 1 en pieza, cortado en tiras"], "method": ["Para el pescado, caliente una sartén y agregue la mitad de la mantequilla y todas las chalotas y cocine por un par de minutos. Agregue el jengibre y cocine por un par de minutos más.", "Agregue el vino blanco y cocine hasta que se reduzca en volumen a la mitad. Agregue el caldo y reduzca a la mitad nuevamente y luego agregue la crema. Colar a través de un tamiz fino en otra sartén caliente.", "Caliente una sartén grande y agregue la mantequilla restante. Sazone los solos filetes con sal y pimienta. Una vez caliente, agregue los filetes sazonados y cocine a ambos lados durante dos minutos, luego retírelos de la sartén y déjelos reposar por un par de minutos.", "Para las verduras de temporada, caliente una sartén grande y agregue la mantequilla. Una vez caliente, agregue el calabacín y cocine por unos minutos, luego agregue el pimiento y el mangetout y cocine por 2-3 minutos. Agregue los guisantes y las habas blanqueadas y deje cocer durante un minuto más.", "Para servir, coloque un conjunto de la salsa en el centro de un tazón poco profundo y algunas verduras de temporada en la parte superior. Coloque el único filete en la parte superior y adorne con perifollo fresco y jengibre fresco."], "url": "www_bbc_co_uk_food_recipes_fried_sole_with_ginger_36957", "title": "Suela frita con salsa de crema de jengibre y verduras de temporada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 muslos de pavo, sin piel, sin hueso y cortados en trozos del tamaño de un bocado", "200ml / 7fl oz de suero de leche para marinar", "pizca de anís estrellado", "10 semillas de cilantro, aplastadas", "aceite vegetal, para freír", "2 cucharaditas de polvo de hornear", "2 cucharaditas de pimienta de cayena", "4 cucharaditas de pimentón", "Harina normal de 250g / 9oz", "4 cucharaditas de pimienta machacada de Sichuan", "2 cucharaditas de ajo en polvo", "1 cucharadita de 5 especias chinas", "1 cucharadita de sal", "1 cucharadita de pimienta negra molida", "sal y pimienta negra recién molida", "250 g / 9 oz de mantequilla de maní suave", "4 cucharaditas de salsa de soja", "6 cucharadas de aceite vegetal", "5 cucharadas de aceite de sésamo", "5 cucharadas de salsa de chile dulce", "puñado de hojas de curry", "1 chile rojo, en rodajas finas", "1 chiles verdes, en rodajas finas", "4 cebollas de primavera, en rodajas finas", "1 cucharada de micro cilantro", "1 cucharada de micro amaranto", "puñado de cacahuetes tostados, toscamente picados", "algunos brotes de frijol", "Anillos de cebolla en escabeche de 150g / 5½oz, en rodajas finas", "1 cucharada de semillas de sésamo negro"], "method": ["Para hacer el pavo frito, coloque el suero de leche en un tazón con anís estrellado y cilantro y mezcle para combinar. Agregue el pavo, sazone con sal y pimienta y cubra bien. Cubra y marine en la nevera durante la noche.", "Cuando esté listo para cocinar, llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Mezcle los ingredientes restantes de pavo en un tazón. Sumerja las piezas de pavo en la mezcla y fría en lotes durante 6-8 minutos, hasta que estén cocidas. Escurra sobre papel de cocina y manténgalo caliente.", "Freír a fuego lento las hojas de curry, escurrir sobre papel de cocina y reservar.", "Para hacer la salsa bang bang, caliente la mantequilla de maní en un tazón sobre una fuente de agua hirviendo hasta que esté suave. Mezcle lentamente los ingredientes restantes hasta que tenga una salsa suelta y con cuchara.", "Para servir, coloca una cucharada de una cantidad generosa de la salsa en el fondo de un plato para servir y apila el pavo crujiente encima. Adorne con las hojas de curry frito y los ingredientes restantes. Rocíe un poco más de la salsa y sirva."], "url": "www_bbc_co_uk_food_recipes_fried_turkey_with_bang_00594", "title": "Pavo frito con salsa bang bang", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 baby pineapple, piel cortada, partida a la mitad y cortada", "75ml / 2½ fl oz crema doble", "1 ramita de menta fresca", "1 rodaja de limón, para servir"], "method": ["Derrita la mantequilla en una sartén y fría ligeramente las rodajas de piña en ambos lados durante 3-4 minutos, o hasta que comiencen a colorear.", "Transfiera las rodajas de piña a un plato de servir, ponga una cuchara sobre la crema doble y adorne con menta fresca y una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_friedbabypineapplewi_89121", "title": "Piña frita con menta y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 christophine (también llamado chow chow), pelado, sin corazón y en rodajas", "55 g / 2 oz de mantequilla", "1 chilis de capullo de whisky escocés rojo, sin semillas (o al gusto)", "1 guindilla de capullo de whisky escocés descafeinado (o al gusto)", "1 maíz en la mazorca"], "method": ["Mezcle las rodajas de cromofina en agua hirviendo durante 3-4 minutos, luego escurra.", "Derrita la mitad de la mantequilla en una sartén y fría la chistófila y los chiles del bonete entero durante 4-5 minutos, girando las rebanadas una vez, hasta que la crofilina esté tierna y dorada por ambos lados.", "Microondas el maíz durante 4-5 minutos en altura, luego retire y freír en otra sartén con la mantequilla restante durante 3-4 minutos, o hasta que el maíz esté tierno.", "Para servir, amontone la christophine frita y los chiles en un plato para servir, y coloque el maíz en la mazorca a un lado."], "url": "www_bbc_co_uk_food_recipes_friedchristophinewit_89119", "title": "Christophine frito con maíz en la mazorca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "150 g / 5½ oz de frijoles edamame, en sus vainas", "pizca de copos de chile", "2 dientes de ajo, finamente picados", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una sartén y agregar los frijoles, los copos de chile y el ajo. Sazonar con sal y pimienta negra recién molida y saltear durante 2-3 minutos, hasta que los frijoles estén tiernos.", "Para servir, coloque en un tazón de servir."], "url": "www_bbc_co_uk_food_recipes_friededamamebeanswit_86248", "title": "Frijoles fritos edamame con chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 patata, pelada y cortada en cubitos", "½ haggis, en rodajas", "2 cucharadas de aceite vegetal", "1 huevo de gallinas camperas"], "method": ["Poner a hervir una olla con agua y cocinar la papa durante 8-10 minutos hasta que esté tierna. Escurre la papa y machaquela.", "Caliente la mitad del aceite en una sartén antiadherente, vierta la mezcla de papas y extiéndala de manera uniforme. Sazonar con sal y pimienta negra recién molida y freír durante 4-5 minutos en cada lado hasta que estén doradas.", "Freír las rodajas de haggis en una sartén por separado durante 3-4 minutos por cada lado hasta que estén doradas y cocidas.", "Calentar el resto del aceite en una sartén pequeña, romper el huevo y freír durante unos minutos, o hasta que se endurezca.", "Para servir, coloque el pastel de papa en un plato para servir, sirva los haggis cocidos en la parte superior y superior con el huevo frito."], "url": "www_bbc_co_uk_food_recipes_friedeggwithpanfried_82605", "title": "Huevo frito con haggis fritos y puré", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "150 g / 5½ oz de judías verdes, finamente en rodajas", "sal y pimienta negra recién molida"], "method": ["Calentar una sartén honda y agregar el aceite de oliva. Agregue las judías verdes y fría por cinco minutos, hasta que estén cocidas y doradas. Sazonar con sal y pimienta negra recién molida.", "Sirva en un tazón como guarnición."], "url": "www_bbc_co_uk_food_recipes_friedgreenbeans_80842", "title": "Frijoles verdes fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600 g / 1 lb 5 oz de filetes de pescado mezclados (como arenque, abadejo ahumado, solla, etc.), se extrae cualquier espina, se corta en tiras", "sal y pimienta negra recién molida", "½ limón, solo jugo", "2 huevos de gallinas camperas, golpeados", "200g / 7oz de harina de avena con cabeza de alfiler", "aceite de girasol, para freír", "1 x 500 g / 1 lb 2 onzas de jarra de mayonesa de buena calidad confeccionada", "2 cucharadas de alcaparras picadas", "2 cucharadas de pepinillos en vinagre picados y pepinillos", "2 cucharadas de hojas de perejil fresco picado", "2 cucharadas de eneldo fresco picado", "½ limón, solo jugo", "splash salsa Tabasco", "sal al gusto", "1 limón, cortado en cuñas"], "method": ["Sazonar las tiras de pescado con sal y pimienta negra recién molida, y espolvorear sobre el jugo de limón.", "Vierta los huevos batidos en un tazón. Espolvoree la avena con cabeza de alfiler en un plato.", "Cepilla cada trozo de pescado con un poco del huevo batido con un pincel de pastelería, luego draga la avena hasta que esté completamente cubierto.", "Vierta suficiente aceite en una sartén grande para cubrir la base de la sartén. Caliente el aceite a fuego medio a alto (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Cuando el aceite esté caliente, agregue las tiras de pescado preparadas, en tandas, y fría por 6-8 minutos, volteándolas una vez, o hasta que estén crujientes y doradas y completamente cocidas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina, manteniéndola caliente. Repite el proceso con el resto del pez.", "Mientras tanto, para la salsa tártara, en un tazón, mezcle todos los ingredientes de la salsa tartare hasta que estén bien combinados. Ponga a un lado hasta que esté listo para servir. (NB: esta receta hará más salsa tártara de la necesaria. Guarde la salsa restante en un recipiente hermético en la nevera durante hasta una semana).", "Para servir, divida cucharadas de la salsa tártara por igual entre cuatro pequeños cuencos de inmersión. Coloque un tazón de inmersión en el centro de cada una de las cuatro placas de servir. Arregle los goujons de pescado alrededor de los cuencos de inmersión. Espolvorea sobre sal, al gusto y decora con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_friedfishinoatmealwi_91975", "title": "Pescado frito en avena con salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]