[{"isVegetarian": false, "title": "Carne de res y berenjena", "url": "www_bbc_co_uk_food_recipes_beef_and_aubergine_46108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_aubergine_46108_16x9.jpg", "ingredients": ["4 panes pitta, abiertos y cortados en triángulos nacho-sized", "500g / 1lb 2oz de yogur griego", "5 cucharadas de tahini, a temperatura ambiente", "2 limones, solo jugo", "2 dientes de ajo, aplastados", "1-2 cucharaditas de copos de sal marina, al gusto", "125 g / 4½ oz de semillas de granada", "50g / 1¾oz de piñones tostados", "1 cucharada de hojas de menta finamente trituradas", "3 cucharadas de aceite de oliva", "1 cebolla pequeña, finamente picada", "1 berenjena, cortada en cubos pequeños", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "1 cucharadita de pimienta Aleppo o pimentón, más extra para rociar", "1-2 cucharaditas de copos de sal marina, al gusto", "500 g / 1 libra de carne picada 2 oz"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Extienda los triángulos pitta en una bandeja para hornear grande y tueste en el horno durante 10-15 minutos, o hasta que estén crujientes. No los necesita para colorear, pero si lo hacen un poco aquí y allá, eso no es malo. Dejar de lado.", "Para hacer el relleno, bata el yogur, el tahini, 3 cucharadas de jugo de limón, ajo y 1 cucharadita de copos de sal marina juntos en un recipiente resistente al calor que más tarde se asentará sobre una olla. Prueba a ver si quieres más sal. Dejar de lado.", "Para preparar la capa de berenjena-ternera, caliente el aceite en una cacerola o cacerola amplia, aunque no profunda, de fondo grueso y cocine la cebolla, revolviendo ocasionalmente, a fuego medio-bajo durante 5 minutos, luego baje la temperatura a bajo y cocine por otros 4 minutos, revolviendo ocasionalmente, hasta que esté suave y tenga un color caramelo pálido.", "Vierta el fuego a medio, agregue los cubitos de berenjena y revuelva bien. Cocine durante aproximadamente 10 minutos, revolviendo con frecuencia. Baja el fuego si se ven como si estuvieran atrapados.", "Agregue el comino, el cilantro y una cucharadita de pimienta de Alepo y copos de sal marina. Sube el fuego a lo alto, agrega la carne picada y usa un tenedor para dividirlo un poco y gira la sartén hasta que pierda su color rojo. Vuelva a bajar el fuego a medio y cocine por 10 minutos, revolviendo ocasionalmente, hasta que la carne esté bien cocida. Prueba a ver si quieres agregar más sal y luego quita el fuego.", "Vierta aproximadamente 3 cm / 1 ¼ in de agua recién hervida en una sartén fresca y ponga a fuego lento. Siente el recipiente con la mezcla de tahini y yogur encima, asegurándote de que el recipiente no toque el agua. Batir bien hasta que el yogur esté ligeramente por encima de la temperatura ambiente y tenga la consistencia de una crema ligeramente batida.", "Para ensamblar, coloque los nítidos triángulos pitta en un plato redondo grande. Cubra con la mezcla de berenjena y ternera, seguido de la salsa de yogur y tahini. Espolvorear con pimienta Aleppo o pimentón para dar un ligero polvo. Esparce sobre las semillas de granada y los piñones tostados y, finalmente, derrama con las hojas de menta finamente trituradas. Coma con los dedos, estilo nacho."]}, {"isVegetarian": false, "title": "Risotto de carne y queso azul", "url": "www_bbc_co_uk_food_recipes_beef_and_blue_cheese_34718", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 piezas de 200 g / 7 onzas de espinilla de res, con hueso", "375ml / 13fl oz de vino tinto", "aceite vegetal, para freír", "1 zanahoria, en cubitos", "2 tallos de apio, cortados y picados", "½ cebolla, picada", "2 hojas de laurel", "Anís de 2 estrellas", "1 cucharada de sal", "1,2 litros / 2 pintas de caldo de pollo oscuro", "2 cucharadas de aceite de oliva", "50g / 1¾oz de mantequilla, más extra para terminar", "1 cebolla grande, finamente picada", "2 dientes de ajo rallados", "Arroz risotto 400g / 14oz", "1 litro / 1¾ pintas de caldo de carne (desde arriba)", "120 g / 4 oz de queso azul suave, cortado en cubitos", "2 cucharadas de hojas frescas de tomillo"], "serves": "Sirve 8", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Coloque las piezas de espinilla de res en un recipiente y cúbralas con vino tinto. Cubra el recipiente con film transparente y enfríe en la nevera durante la noche. Al día siguiente, retire la carne del vino tinto y seque con papel de cocina. Reserve el vino tinto.", "Precalentar el horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Caliente una cucharada de aceite en una cazuela a prueba de fuego a fuego medio. Freír los trozos de carne de res durante unos segundos en todos los lados, o hasta que estén dorados por todas partes. Retire de la sartén y reserve.", "Agregue la zanahoria, el apio y la cebolla a la cacerola y fríe suavemente durante 4-5 minutos, revolviendo regularmente, hasta que se ablanden. Agregue las hojas de laurel y el anís estrellado, luego coloque la carne dorada sobre las verduras. Espolvorea sobre la sal y vierte el vino tinto reservado. Haga hervir la mezcla.", "Agregue el caldo de pollo y devuelva la mezcla a ebullición. Cubra la cazuela con una tapa y transfiérala al horno. Cocine por 3½-4 horas, o hasta que las espinillas de ternera estén muy tiernas.", "Retire las espinillas de carne de la cazuela. Saca la carne del hueso y córtala en hojuelas. Extrae la médula de los huesos. Apartar y mantener caliente. Cuele el caldo de la cazuela a través de un colador fino y manténgalo caliente.", "Para el risotto, caliente el aceite y la mantequilla en una cacerola a fuego medio. Agregue la cebolla y el ajo y fría por 3-4 minutos, o hasta que estén suaves pero no coloreados.", "Agregue el risotto de arroz y cocine por 1-2 minutos, o hasta que esté cubierto con grasa y ligeramente translúcido.", "Agregue el caldo de carne caliente a cucharadas a la vez, revolviendo bien después de cada adición y dejando que casi todo el líquido se absorba antes de agregar el siguiente cucharón.", "Continúe agregando el caldo hasta que el arroz esté tierno (puede que no necesite usar todo el caldo de carne).", "Retire el risotto del fuego y agregue la carne cocida, la mantequilla, el queso azul y las hojas de tomillo. Agregue la médula ósea, al gusto y revuelva bien hasta que la mantequilla y el queso se hayan derretido, luego sirva en tazones poco profundos."]}, {"isVegetarian": false, "title": "Pizza de hojaldre de res y queso azul", "url": "www_bbc_co_uk_food_recipes_beef_and_blue_cheese_89652", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_blue_cheese_89652_16x9.jpg", "ingredients": ["Hojaldre de mantequilla de 500g / 1lb 2oz", "harina blanca lisa, para quitar el polvo", "1 yema de huevo de gallinas camperas", "1 cucharada de crema doble, para el glaseado", "2 cucharaditas de extracto de carne", "3 cucharadas de mermelada de cebolla", "100ml / 3½fl oz de sidra", "100ml / 3½fl oz de vinagre de sidra", "50g / 1¾oz demerara azúcar", "3 cebollas rojas pequeñas, peladas y cortadas en seis cuñas con la raíz intacta", "75 g / 2 onzas de crema entera en grasa", "75g / 2¾oz de queso azul suave, como Dolcelatte", "1 cucharada de cebollino picado", "sal y pimienta negra recién molida", "Bistec Bavette de 200g / 7oz, en rodajas finas", "50g / 1¾oz de harina de maíz", "4 cucharadas de aceite vegetal, para cocinar", "pimienta de cayena, al gusto", "sal al gusto", "berro, para adornar"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para la base, haga rodar la masa de hojaldre sobre una superficie de trabajo ligeramente enharinada en un círculo de 28cm / 11 pulgadas con un grosor aproximado de 5 mm. Transfiera la masa a una bandeja para hornear forrada con pergamino para hornear. Cubra con film transparente y colóquelo en la nevera durante al menos una hora.", "Para las cebollas agrias, coloque una sartén a fuego medio y agregue la sidra, el vinagre de sidra y el azúcar demerara. Ponga la sartén a hervir y coloque los segmentos de cebolla en el líquido. Baje la temperatura a fuego lento y cocine de 5 a 8 minutos hasta que empiecen a ablandarse. Voltee las cebollas y cocine por otros cinco minutos.", "Cuando esté suave, retire la sartén del fuego, coloque las cebollas en una bandeja para hornear. Use un soplete para chamuscarlos (alternativamente charles bajo una parrilla caliente). Deja enfriar.", "Para la base, precaliente el horno a 220C / 425F / Gas 7.", "Pinche la masa de hojaldre con un tenedor. En un tazón pequeño o taza, mezcle la yema de huevo y la crema doble juntas y cepíllese encima de la masa. Coloque la masa en el horno precalentado y hornee por 20 minutos, o hasta que se levante, crujiente y dorado. Apague el horno a 110C / 225F / Gas ¼ y continúe \\\"secando\\\" la masa por otros 15 minutos. No dejes que se queme.", "Una vez que la masa esté crujiente y seca, retírela del horno y déjela enfriar durante cinco minutos. Aumente la temperatura del horno a 180C / 350F / Gas 4.", "Para la carne de res, mezcle las tiras de carne Bavette en la harina de maíz y sacuda el exceso.", "Caliente el aceite en una sartén antiadherente. Agregue las tiras de carne en lotes (no se amontone la sartén) y freír hasta que estén crujientes, esto tomará alrededor de 6-8 minutos. Una vez crujiente, escurra sobre papel de cocina y sazone con sal y pimienta de cayena mientras la carne esté todavía caliente.", "Cepille la masa con el extracto de carne, unte una capa de mermelada de cebolla y agregue la carne. Calentar en el horno durante unos minutos.", "Para el aderezo crème fraîche, bata la crème fraîche y el queso azul en un bol hasta que estén gruesos. Doble el cebollino picado y sazone con sal y pimienta. Si la mezcla es demasiado espesa, agregue un poco de agua para aflojarla para que pueda rociarse encima de la pizza.", "Saca la pizza del horno, echa encima el aderezo de queso azul y crème fraîche y decora con berros. Servir inmediatamente."]}, {"isVegetarian": false, "title": "Carne de res y chorizo ​​con puré de rábano picante y albóndigas de romero", "url": "www_bbc_co_uk_food_recipes_beef_and_chorizo_with_86545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_chorizo_with_86545_16x9.jpg", "ingredients": ["3 cucharadas de aceite de oliva", "1kg / 2lb 4 oz espinilla de res cortada en trozos de 4cm / 1½ pulgadas", "225g / 8oz de chorizo, cortado en cubitos", "1 cebolla grande, cortada en cubitos", "2 zanahorias grandes, cortadas al mismo tamaño que la carne de vacuno", "2 chirivías grandes, cortadas al mismo tamaño que la carne de res", "2 cucharadas de harina normal", "300ml / ½ pinta de vino tinto", "600ml / 1 pinta de existencias de carne de vacuno", "sal y pimienta negra recién molida", "Harina de levante 225g / 8oz", "pizca de sal", "100g / 4oz de sebo triturado", "1-2 cucharadas de romero fresco, finamente picado", "Papas de 900g / 2lb, peladas y cortadas en trozos", "25 g / 1 oz de rábano picante fresco rallado, o al gusto", "25g / 1oz de mantequilla", "alrededor de 100 ml / 4floz de crema individual"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne, asegúrese de que haya dos estantes disponibles en su horno y precaliente el horno a 160 ° C / 320 ° F / Gas 3. Caliente el aceite de oliva en una cazuela resistente al fuego y dore la carne. (Necesitará hacer esto en tandas, así que no sobrecargue la sartén). Usando una cuchara con ranuras, levante la carne y déjela a un lado.", "Agregue el chorizo ​​y la cebolla a la sartén y fría hasta que se ablande y la grasa se desprenda del chorizo.", "Agregue las zanahorias y las chirivías y continúe cocinando hasta que estén teñidas de color y comiencen a ablandarse. Espolvoree la harina y cocine por 2-3 minutos, revolviendo con frecuencia. Verter sobre el vino y revolviendo constantemente, llevar a ebullición. Agregue el caldo de carne.", "Regrese la carne a la sartén y sazone con sal y pimienta negra recién molida. Cubra con una tapa ajustada y estire en el estante inferior del horno durante dos horas, o hasta que la carne esté tierna - verifique durante el tiempo de cocción para asegurarse de que la carne no se seque demasiado. Si lo hace, agregue un poco de agua hervida.", "Para las albóndigas, forre una bandeja para hornear con papel para hornear antiadherente. Tamiza la harina en un bol con una pizca de sal. Agregue el sebo y el romero y agrégueles suficiente agua fría para formar una masa suave.", "Con las manos enharinadas y trabajando lo más levemente posible con los dedos, divida la mezcla en ocho y déle forma de albóndigas ovales. Coloque en una bandeja para hornear ligeramente espaciada.", "Hornee las albóndigas en el estante sobre la carne durante los últimos 25 minutos del tiempo de cocción de la carne de res, hasta que estén hinchadas y cocidas.", "Mientras tanto, para el puré, hierva las papas en una sartén con agua hirviendo con sal durante 15 minutos o hasta que estén tiernas. Escurrir bien y presionar a través de un ricer de patata en un recipiente caliente. Mezcle el rábano picante, la mantequilla y la crema. Sazone al gusto con sal y pimienta negra recién molida.", "Sirve el puré con la carne y las albóndigas."]}, {"isVegetarian": false, "title": "Estofado de ternera y miel", "url": "www_bbc_co_uk_food_recipes_beef_and_honey_stew_47298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 30g / 1oz", "Filete de estofado de 450 g / 1 lb, cortado en cubos de 2,5 cm / 1 in", "3 cucharadas de aceite vegetal", "1 cebolla, más o menos picada", "2 zanahorias, aproximadamente picadas", "2 puerros, más o menos picados", "½ nabo medio, más o menos picado", "1 cucharada de miel", "550 ml / 1 pinta de existencias de carne de vacuno", "2 patatas grandes, cortadas en trozos", "sal marina y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la harina en una bolsa de congelador, luego agregue los cubos de carne y agite bien para cubrir.", "Caliente el aceite en una sartén grande y dore la carne por todos lados. (Haga esto en lotes ya que agregar demasiada carne a la vez hace que la carne se caliente en lugar de marrón).", "Freír la cebolla en la misma sartén que usaste para la carne, agregando más aceite si es necesario. Una vez que la cebolla esté dorada, agregue las zanahorias, los puerros, el nabo, la miel y el caldo de carne y devuelva la carne a la sartén.", "Cubra la olla con una tapa y cocine a fuego lento el guiso a fuego muy lento durante al menos dos horas: cuanto más tiempo cocine, mejor será.", "Unos 20 minutos antes de servir, agregue la papa al estofado (agregarlos en este punto significa que mantienen su forma). Sazonar, al gusto, con sal marina y pimienta negra recién molida antes de servir."]}, {"isVegetarian": false, "title": "Rollitos de salchicha y rábano picante", "url": "www_bbc_co_uk_food_recipes_beef_and_horseradish_44048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_horseradish_44048_16x9.jpg", "ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "½ cucharadita de sal", "Setas de castaña 300 g / 10½ oz, en rodajas finas", "3 cucharadas de puré de rábano picante", "800 g / 1 libra de salchichas de carne de 12 oz, pieles retiradas", "500 g / 1 libra de hojaldre listo para el uso de 2 oz", "1 huevo de gallinas camperas, golpeado", "poca harina común, para quitar el polvo"], "serves": "Hace 24-30 rollos de salchicha", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Caliente el aceite en una cacerola mediana a fuego medio. Agregue el ajo, la sal y los champiñones y cocine hasta que toda la humedad de los champiñones se haya evaporado. Transfiera a un recipiente y deje enfriar por completo.", "Revuelva el puré de rábano picante en los champiñones. Agregue la carne de salchicha de carne y mezcle hasta que esté bien combinada con las manos.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel de hornear.", "Empolva ligeramente una superficie de trabajo con harina. Extienda la masa a 25x35cm / 10x14 pulgadas, luego córtela en tres rectángulos iguales a lo largo. Estire cada rectángulo un poco más para crear más ancho.", "Divida la mezcla de carne en tres partes iguales. Extienda una parte por un lado de un rectángulo de repostería en forma de salchicha larga y delgada. Cepille el borde largo con un huevo batido y enrolle la masa sobre la carne de salchicha para sellarla. Repita con la carne y la masa de salchichas restantes.", "Corte cada pieza larga en ocho a diez rollos de salchichas y colóquela en la bandeja para hornear preparada. Cepille cada hojaldre con un poco más de huevo batido, luego hornee durante 15-20 minutos.", "Dejar enfriar durante 10 minutos antes de comer, ya que estarán muy calientes."]}, {"isVegetarian": false, "title": "Stroganoff de carne y champiñones", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_99051", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_mushroom_99051_16x9.jpg", "ingredients": ["150g / 5½oz de arroz basmati marrón", "1 cucharada de aceite de oliva light", "4 chalotes, finamente picados", "1 cucharadita de pimentón dulce ahumado", "1 pimiento rojo, sin semillas, más o menos picadas", "Setas de castaña 200 g / 7 oz, en rodajas finas", "2 dientes de ajo, finamente picados", "1 cucharada de vinagre de sidra", "1 cucharada grande de mostaza integral", "150ml / 5fl oz de caldo de carne", "Filete de solomillo magra 200g / 7oz, grasa visible eliminada, finamente rebanada", "100ml / 3½ fl oz de queso fresco sin grasa", "2 cucharadas de pepinillos toscamente picados", "2 cucharadas de cebollines frescos finamente cortados", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine el arroz de acuerdo con las instrucciones del paquete y manténgalo caliente.", "Mientras tanto, caliente el aceite en una sartén grande y fría las chalotas por 5 minutos, o hasta que se ablanden.", "Agregue el pimentón, la pimienta, los champiñones y el ajo y fría por 6-8 minutos, o hasta que estén blandos.", "Agregue el vinagre y la mostaza y deje que hierva. Cocine hasta que el líquido casi se haya evaporado. Vierta sobre el caldo y cocine durante 3-4 minutos, o hasta que espese un poco.", "Agregue el bistec y cocine a fuego alto durante 2-3 minutos, o hasta que esté sellado y cocinado a su gusto.", "Baje la temperatura a bajo y agregue el queso fresco, los pepinillos y la mitad de las cebolletas. Temporada.", "Sirva el stroganoff con el arroz, adornado con las cebolletas restantes."]}, {"isVegetarian": false, "title": "Pastel de carne de res, riñones y champiñones con tapa de hojaldre casera", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_pie_15924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g / 1lb harina simple de 4oz, más extra para quitar el polvo", "¾ cucharadita de sal", "550 g / 1 libra de mantequilla sin sal 4 oz, lo suficientemente suave como para ser flexible", "2 cucharadas de aceite de colza", "Filete de ternera a la plancha de 500 g / 1 libra, cortado en cubos de 5 cm / 2 in", "Riñones de 200g / 7oz, picados", "1 cebolla picada", "90g / 3¼ oz de champiñones", "Setas de castaña 90g / 3¼oz, más o menos picadas", "8 chalotes redondos pequeños, dejados enteros", "2 zanahorias, cortadas en 3 piezas", "4 ramitas de tomillo, hojas recogidas", "2 hojas de laurel", "2 cucharadas de puré de tomate", "200ml / 7fl oz de cerveza oscura", "400ml / 14fl oz de caldo de carne, caliente", "1 huevo de gallinas camperas, golpeado", "Patatas de 2kg / 4lb 8oz, papas más grandes cortadas en cuartos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "Guisantes 200 g / 7 oz, frescos o congelados"], "serves": "Sirve 6-8", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para la masa de hojaldre, ponga la harina y la sal en un tazón grande. Agregue 200 ml / 7 fl oz de agua. Mezcle para combinar y luego incline sobre una superficie de trabajo enharinada. Amasar brevemente para formar una masa áspera, pero uniformemente combinada. Coloque la masa en el refrigerador para descansar durante 1-2 horas.", "Mientras tanto, haz que el pastel se llene. Caliente una cacerola con tapa o una sartén grande a prueba de horno a fuego alto y agregue el aceite. Una vez caliente, fría la carne durante 3-4 minutos, o hasta que se dore por todos lados (puede necesitar hacer esto en lotes). Agregue los riñones y cocine durante 2 minutos. Transfiera la carne a un plato caliente y reserve.", "Agregue la cebolla, los champiñones, las chalotas y las zanahorias enteras a la cacerola vacía y fríe durante 2-3 minutos, o hasta que se ablanden. Agregue el tomillo, las hojas de laurel y el puré de tomate y mezcle bien para combinar.", "Agregue la cerveza y mezcle bien, raspando cualquier sedimento del fondo de la cazuela con una cuchara de madera. Regrese la carne a la cazuela, agregue el caldo caliente, revuelva bien y lleve la mezcla a ebullición. Baje el fuego, coloque una tapa en la cacerola y cocine durante 1 hora y media, o hasta que la carne esté tierna y la salsa espesa. Una vez cocido, retire el relleno del pastel del plato y déjelo enfriar.", "Retire la masa de hojaldre del refrigerador y colóquela sobre una superficie de trabajo ligeramente enharinada. Ruede los pasteles en un rectángulo de aproximadamente 50x30 cm / 20x12 pulgadas. Corta la mantequilla y coloca esto sobre dos tercios de la masa. Dobla la tercera masa sin mantequilla sobre la mantequilla, luego voltea sobre el tercio restante con mantequilla para que la mantequilla quede envuelta dentro de la masa. Tome un rodillo y ruede ligeramente la superficie superior de la masa para expulsar las burbujas de aire. Selle los bordes con un golpe fuerte del rodillo.", "Gire la pastelería 90 grados (un cuarto de vuelta) y doble el tercio inferior de la masa hacia arriba, luego el tercio superior hacia abajo. Haga rodar la masa hacia los bordes doblados hasta que mida aproximadamente 60x25 cm / 23x10 pulgadas, luego doble la masa en tercios otra vez. Dale a la pastelería otros dos turnos. Envuelva la masa en una película adhesiva y transfiérala a la nevera para enfriar durante 30 minutos.", "Para cocinar el pastel, precaliente el horno a 220C / 200C Fan / Gas 7.", "Ponga la mezcla de carne y salsa en un plato redondo a prueba de horno de 23 cm / 9 pulgadas de diámetro. Extienda la masa a 1cm / ⅓ de grosor y corte la masa en un círculo ligeramente más grande que el plato para pastel. Cepille un poco de agua alrededor del borde del plato para pastel, coloque la masa sobre el relleno y presione los bordes para sellar la masa al plato. Cepille el pastel con un poco de huevo batido, coloque el pastel en el horno y cocínelo durante 20-30 minutos, o hasta que la masa esté dorada y pálida y se haya levantado.", "Mientras tanto, para el puré de papas hierva las papas en agua con sal durante 15 minutos, o hasta que estén tiernas. Escurra y coloque las papas en la olla sobre el fuego para eliminar el exceso de humedad. Mash las patatas. Caliente la mantequilla y la crema en una cacerola hasta que la mantequilla se derrita. Agregue al puré y bata bien hasta que esté suave y cremoso. Condimentar con sal y pimienta.", "Hervir los guisantes durante 2-3 minutos y luego escurrir.", "Para servir, ponga una cucharada del pastel en cada plato con el puré y los guisantes al lado."]}, {"isVegetarian": false, "title": "Pastel de carne y champiñones", "url": "www_bbc_co_uk_food_recipes_beef_and_mushroom_pie_97395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de ternera a la plancha de 500 g / 1 lb 2 oz", "sal y pimienta", "2 cucharadas de aceite vegetal", "1 cucharada de harina de maíz", "1 cebolla picada", "2 zanahorias picadas", "2 ramitas de tomillo, hojas recogidas", "160g / 5¾oz de champiñones enteros", "1 cubo de caldo de carne, disuelto en 400 ml / 14 fl oz de agua", "1 yema de huevo de gallinas camperas, golpeada", "100 g / 3½ oz de hojaldre, enrollado a 5 mm de espesor"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sazone la carne con sal y pimienta negra.", "Caliente una cacerola a prueba de horno hasta que esté caliente. Agregue el aceite vegetal y la carne en lotes y fría hasta que se dore. Devuelve toda la carne a la sartén.", "Agregue la harina de maíz y revuelva para cubrir la carne, luego agregue las cebollas, zanahorias, tomillo y champiñones. Freír suavemente durante 2-3 minutos.", "Agregue el caldo y caliente a fuego lento. Cubra con una tapa y cocine a fuego lento durante 2-3 horas, o hasta que la carne esté muy tierna.", "Sazonar, al gusto, con sal y pimienta negra, retirar del fuego y reservar para enfriar.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la mezcla de carne enfriada en un plato grande para pastel.", "Cepille el borde del plato con el huevo batido y luego coloque la masa sobre la parte superior del relleno y el plato.", "Engarce el borde para sellar, luego cepille la masa con más huevo batido y corte dos ranuras en la parte superior del pastel para que escape el vapor.", "Coloque en una bandeja para hornear en el horno durante 25-35 minutos, o hasta que el relleno esté caliente y la masa crujiente y dorada."]}, {"isVegetarian": false, "title": "Pastel de carne y mostaza", "url": "www_bbc_co_uk_food_recipes_beef_and_mustard_pie_58002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_mustard_pie_58002_16x9.jpg", "ingredients": ["1 kg / 2lb 4 oz de falda de carne de vacuno, cortado en trozos grandes", "2 cucharadas de harina normal", "sal y pimienta negra recién molida", "2 cucharadas de aceite de colza", "200ml / 7fl oz de vino tinto", "400ml / 14fl oz de caldo de carne", "1 cebolla, finamente rebanada", "2 zanahorias grandes, cortadas en piezas de 2.5cm / 1in", "3 ramitas de tomillo", "2 cucharadas de mostaza integral", "2 yemas de huevo de gallinas camperas, batidas", "Pasteles de hojaldre con mantequilla de 400g / 14oz, enrollados a 5 mm / ¼ de grosor", "300g / 10½oz de judías verdes finas", "25g / 1oz de mantequilla", "sal marina y pimienta negra recién molida"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Mezcle la carne y la harina en un bol con un poco de sal y pimienta negra.", "Caliente una cazuela grande hasta que esté caliente, agregue la mitad del aceite de colza y suficiente carne para cubrir el fondo de la cazuela.", "Freír hasta que se dore por cada lado, luego quitar y reservar. Repita con el aceite y la carne restante.", "Regrese la carne a la sartén, agregue el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo, la cebolla, las zanahorias, el tomillo y la mostaza, y sazone bien con sal y pimienta.", "Cubra con una tapa y colóquelo en el horno por dos horas.", "Retire del horno, revise el condimento y déjelo enfriar. Retire el tomillo.", "Cuando la carne esté fría y esté listo para armar el pastel, precaliente el horno a 200C / 400F / Gas 6.", "Transfiera la carne a un plato de tarta, cepille el borde con las yemas de huevo batidas y coloque la masa sobre la parte superior. Cepille la parte superior de la masa con más huevo batido.", "Recorte la masa para que quede suficiente exceso para doblar los bordes, colóquela en el horno y hornee durante 30 minutos, o hasta que la masa esté dorada y cocida.", "Para las judías verdes, ponga a hervir una cacerola con agua con sal, agregue los frijoles y cocínelos durante 4-5 minutos, o hasta que estén tiernos.", "Escurra y mezcle con la mantequilla, luego sazone con pimienta negra.", "Para servir, coloque una cucharada grande de pastel en cada plato con algunas judías verdes al lado."]}, {"isVegetarian": false, "title": "Pastel de carne de vaca y cebolla", "url": "www_bbc_co_uk_food_recipes_beef_and_onion_pie_88258", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g / 1lb 10oz de ternera guisada en cubitos", "3 cucharadas de harina común", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "150g / 5oz de cebollas enteras, peladas", "1 cebolla, en rodajas", "3 dientes de ajo, toscamente picados", "150ml / 5½fl oz de cerveza", "300ml / 11fl oz de caldo de carne", "500g / 1lb 2 oz de harina de auto crianza", "250 g / 9 oz de sebo de ternera", "325ml / 12fl oz de agua", "pizca de sal", "50g / 2oz de mantequilla", "Col de 1 hispi, núcleo eliminado, triturado", "3 cucharadas de perejil de flatleaf fresco picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el llenado, precaliente el horno a 150C / 300F / Gas3.", "Mezcle la carne, la harina y el condimento en un tazón.", "Caliente un poco del aceite de oliva en una cazuela grande a prueba de llamas hasta que esté caliente. Agite el exceso de harina de la carne y fría, en lotes, durante 4-5 minutos, o hasta que se dore por todas partes. Retire la carne y reserve.", "Agregue el aceite de oliva restante y las cebollas a la sartén y fría por 3-5 minutos, o hasta que estén blandos y coloreados.", "Regrese la carne a la cazuela y agregue el ajo y la cerveza. Continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el caldo de carne y cocine a fuego lento. Cubra con una tapa y cocine en el horno durante 2 horas.", "Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar de lado para enfriar por completo.", "Para la repostería de sebo, mezcle la harina, el sebo, el agua y la sal en un bol para formar una masa suave (no sobrecargue la masa).", "Extienda tres cuartas partes de la masa a un grosor de 1cm / ½ pulgadas y úsela para revestir un recipiente de pudín de 1,2 litros / 2 pinta. Rellene con el relleno de carne cocida fría y humedezca la masa alrededor del borde del lavabo con agua.", "Enrolle la masa restante a un grosor de 1 cm / ½ pulgadas y colóquela sobre la parte superior del lavabo. Pellizque los bordes firmemente juntos y recorte cualquier exceso.", "Cubra con una doble capa de papel resistente a la grasa y una sola hoja de papel de aluminio. Ate el borde superior con una cuerda.", "Cueza al vapor el budín durante una hora y media en un barco a vapor, o en un plato vuelto hacia arriba en una cacerola cubierta a medio llenar con agua.", "Para el repollo, caliente una sartén hasta que esté caliente, agregue la mantequilla, el repollo y 3 cucharadas de agua y cocínelas durante 4-5 minutos, revolviendo ocasionalmente, hasta que estén tiernas. Agregue el perejil, la sal y la pimienta negra recién molida.", "Sirva el budín en rebanadas con el repollo al costado."]}, {"isVegetarian": false, "title": "Pastel de carne de vaca y ostra", "url": "www_bbc_co_uk_food_recipes_beef_and_oyster_pie_65230", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g / 2lb de ternera guisada, cortada, cortada en cubos ásperos de 3cm / 1¼in", "2-3 cucharadas de aceite de girasol", "3 chalotes largos, descuartizados", "2 dientes de ajo, finamente picados", "125g / 4½oz de lonchas de tocino ahumado, sin corteza, rayado, cortado en tiras de 1cm / ½ pulgada", "1 cucharada de hojas de tomillo toscamente picadas", "2 hojas de laurel", "330ml / 11fl oz de grasa", "400ml / 14fl oz de caldo de res (hecho con un cubo de reserva)", "sal marina escamada y pimienta negra recién molida", "2 cucharadas de harina de maíz, mezclada con 2 cucharadas de agua para hacer una pasta suave", "8 ostras, recién desconchadas", "Harina simple de 400g / 14oz, más extra para enrollar", "¼ cucharadita de sal", "250 g / 9 oz de mantequilla, congelada durante al menos 2 horas", "1 huevo de gallinas camperas, batido, para esmaltar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sazonar los cubos de carne con sal y pimienta negra. Caliente una cucharada de aceite en la sartén y fría la carne a fuego alto. Haga esto en tres lotes para no sobrecargar la sartén, transfiriendo la carne a una gran cazuela a prueba de llama una vez que esté dorada por completo. Agregue aceite extra si la sartén parece seca.", "En la misma sartén, agregue otra cucharada de aceite y cocine los chalotes durante 4-5 minutos, luego agregue el ajo y fría por 30 segundos. Agregue el tocino y fría hasta que esté ligeramente dorado. Transfiera la mezcla de cebolla y tocino a la cazuela y agregue las hierbas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Vierta la cerveza fuerte en la sartén y deje que hierva, revolviendo para sacar cualquier trozo dorado del fondo de la sartén. Vierta la cerveza fuerte sobre la carne en la cazuela y agregue el caldo. Cubra la cazuela y colóquela en el horno durante 1½-2 horas, o hasta que la carne esté tierna y la salsa se reduzca.", "Elimine cualquier grasa de la superficie, pruebe y agregue sal y pimienta si es necesario, luego agregue la pasta de harina de maíz. Coloque la cazuela en la placa - no olvide que estará caliente - y cocine a fuego lento durante 1-2 minutos, revolviendo, hasta que espese. Deja enfriar.", "Aumente el horno a 200C / 400F / Gas 6. Para hacer la masa, coloque la harina y la sal en un tazón muy grande. Ralla la mantequilla y revuélvela en la harina en tres tandas. Poco a poco agregue 325ml / 11fl oz de agua fría, puede que no lo necesite todo, y revuelva con un cuchillo de hoja redonda hasta que la mezcla se una. Amase los pasteles ligeramente en una bola sobre una superficie ligeramente enharinada y reserve 250 g / 9 oz para la tapa del pastel.", "Ruede el resto de la masa hasta aproximadamente 2 cm / in más grande que el plato que está usando. Cubra el plato con la masa y luego amontone en el relleno, metiendo las ostras también. Cepille el borde de la masa con huevo batido.", "Ruede el resto de la masa hasta que sea un poco más grande que su plato y levante suavemente el relleno, presionando los bordes firmemente para sellar, luego recorte con un cuchillo afilado. Cepillar con huevo batido para glasear. Coloque el plato en una bandeja para hornear y hornee durante 25-30 minutos, o hasta que la masa esté dorada y el relleno burbujee."]}, {"isVegetarian": false, "title": "Pilaf de carne de res y guisantes", "url": "www_bbc_co_uk_food_recipes_beef_and_pea_pilaf_11183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "3 dientes de ajo picados", "½ cucharada de semillas de comino", "1 chile rojo, sin semillas, finamente picado", "Carne picada de carne 250 g / 9 oz", "25g / 1oz de mantequilla", "200g / 7oz de arroz blanco", "1 litro / 1¾ de pinta de pollo o caldo de res, hecho de un cubo", "300g / 10½oz de guisantes congelados", "sal y pimienta"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente una olla grande con tapa a fuego medio. Agregue el aceite de oliva y, una vez caliente, fría la cebolla con una pizca de sal durante 5-6 minutos o hasta que esté cocida y ligeramente dorada. Agregue el ajo, las semillas de comino y el chile y continúe cocinando durante dos minutos, o hasta que estén aromáticos.", "Agregue la carne picada a la sartén y cocínela durante 4-5 minutos, o hasta que toda la carne esté dorada en lugar de cruda.", "Agregue la mantequilla y, una vez derretida, mezcle el arroz, mezcle el fuego durante dos minutos para que el arroz comience a absorber la mantequilla derretida y los jugos en la sartén. Vierta suficiente cantidad de caldo para cubrir el arroz en 1 cm / ½ pulg. Revuelva una vez, cubra con una tapa ajustada, reduzca el fuego a medio-bajo y déjelo durante cinco minutos.", "Después de cinco minutos quite la tapa, agregue los guisantes y revuelva. Haga algunos agujeros en el arroz para permitir que salga el vapor y continúe cocinando con la tapa hasta que todo el líquido se haya absorbido y el arroz esté bien cocido.", "Sirva caliente, dividiendo el arroz crujiente en el fondo de la sartén."]}, {"isVegetarian": false, "title": "Carne de res, frijoles de ojos negros y caldo de plátano", "url": "www_bbc_co_uk_food_recipes_beef_black-eyed-bean_and_85011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g / 12oz de frijoles secos de ojos negros", "Filete de solomillo de 900g / 2lb, cortado en cubos de 1cm / ½", "225ml / 8fl oz de aceite vegetal", "100ml / 3½fl oz de aceite de palma roja o aceite vegetal", "1 cebolla blanca grande, picada", "4 dientes de ajo, finamente picados", "Jengibre de 4 cm / 2 pulgadas, rallado", "1 cucharadita de hojuelas de chile seco", "2 x 400 g de tomates picados", "2 cucharadas de puré de tomate", "2 cubos de caldo de carne", "2 ramitas de tomillo fresco", "1 guindilla Scotch, picada", "3 plátanos maduros, pelados y en rodajas", "sal y pimienta negra recién molida"], "serves": "Sirve 6-8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Cocine los frijoles secos en una olla grande de agua hirviendo durante unos 20 minutos hasta que se ablanden. Escurrir y apartar.", "Caliente 2 cucharadas de aceite vegetal en una cazuela grande y dore la carne por todos lados a fuego medio. Eliminar y reservar.", "Calienta el aceite de palma rojo en la misma sartén y freír las cebollas durante 2-3 minutos, hasta que se suavice un poco. Agregue el ajo, el jengibre y las hojuelas de chile seco y revuelva. Agregue los tomates en lata, puré de tomate, cubos de caldo, tomillo y chiles de bonete escocés y sazone con sal y pimienta. Cocine los tomates durante 10 minutos antes de agregar la carne de res y los frijoles y cocine a fuego lento durante 45-60 minutos, revolviendo ocasionalmente.", "Mientras el guiso se cocina, caliente el aceite vegetal restante en una sartén honda y fría las rodajas de plátano en grupos de 2-3 en cada lado hasta que estén doradas. Transfiera a un plato forrado con papel de cocina para escurrir. Cubra el estofado con los plátanos antes de servir."]}, {"isVegetarian": false, "title": "Costillas BBQ a la parrilla", "url": "www_bbc_co_uk_food_recipes_beef_bbq_ribs_24916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucharadas de sal marina", "1 cucharada de ajo en polvo", "1 cucharada de sal de apio", "1 cucharada de pimienta negra agrietada", "1 cucharada de jengibre molido", "1 cucharada de semillas de cilantro trituradas", "2 cucharaditas de chile en polvo", "1 cucharada de hierbas secas de provence", "1 cucharada de pimentón ahumado", "1 x 3.5kg / 7lb 10oz de costilla corta de res en el hueso", "Fechas de 200g / 7oz, más o menos picadas", "250 g / 9 oz de cebollas en escabeche escurridas, más o menos picadas", "570ml / 1 pinta fuerte", "3 cucharadas de mostaza inglesa", "2 cucharadas de salsa Worcestershire", "Jugo de manzana de 300 ml / ½ pinta", "3 cucharadas de miel clara", "3 cucharadas de melaza negra", "3 cucharadas de jarabe de oro", "1 cucharada de Tabasco", "1 cucharada de puré de tomate", "3 cucharadas de azúcar moreno oscuro"], "serves": "Sirve 6-8", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para las costillas curadas en seco, mezcle todos los ingredientes secos y frótelos en la costilla de carne. Coloque la carne en un recipiente grande de plástico y cubra con cualquier mezcla restante de curado. Coloque la tapa y colóquela en el refrigerador durante la noche o durante 24 horas.", "Para el glaseado de barbacoa, coloque las fechas picadas y las cebollas en vinagre en un recipiente. Llevar la stout hasta el punto de ebullición en una cacerola y verterlo sobre las fechas y las cebollas. Cubra con film transparente y deje enfriar a temperatura ambiente.", "En un tazón grande separado, mezcle los ingredientes restantes del glaseado de barbacoa.", "Cuando la fecha y la mezcla de cebolla se haya cocinado y las fechas se hayan suavizado, mezcle la mezcla hasta que quede suave y viértala en el resto de los ingredientes del glaseado de barbacoa.", "Precalentar el horno a 130 ° C / 275 ° F / Gas 1.", "Cuando las costillas se hayan curado, lave la mezcla de curado de las costillas cortas y colóquelas en una cazuela grande con tapa. Vierta sobre el glaseado y tape.", "Coloque en el horno precalentado y cocine muy lentamente durante 5-6 horas, o hasta que la carne esté tierna. Asegúrese de que el esmalte no se evapore: si disminuye demasiado, agregue un poco de agua.", "Cuando la carne esté cocida, retire la sartén del horno y deje enfriar a temperatura ambiente. Cuando esté frío, colóquelo en la nevera para que se enfríe durante la noche. Cuando está frío, la grasa se habrá puesto en la parte superior y se podrá quitar fácilmente.", "Cuando esté listo para recalentar, coloque toda la sartén, con la tapa puesta, en una barbacoa a fuego lento. Deje que las costillas se calienten durante unas 2-3 horas.", "Cuando esté caliente, retire la tapa y reduzca lentamente el glaseado con la carne de res todavía en la sartén, hilvanando las costillas cada 10 minutos. Cuando el glaseado se reduce y recubre la carne, retire las costillas de la sartén y sirva."]}, {"isVegetarian": false, "title": "Kebabs de carne y pimiento", "url": "www_bbc_co_uk_food_recipes_beef_and_pepper_kebabs_82385", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_pepper_kebabs_82385_16x9.jpg", "ingredients": ["400 g / 14 oz filete, grupa o parte superior", "1 pimiento rojo, sin corazón y sin semillas", "1 pimiento verde, sin corazón y sin semillas", "1 cucharadita de semillas de cilantro trituradas", "3 cucharadas de aceite vegetal", "15g / ½oz de cilantro fresco picado", "1 chile rojo, sin semillas y picado", "1 diente de ajo, aplastado", "2 cucharadas de jugo de lima", "4 chapatis", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Remoje 8 pinchos de madera en agua tibia.", "Cortar la carne y los pimientos en cubos de 2.5cm / 1in.", "Mezcle las semillas de cilantro, 2 cucharadas de aceite y la mitad del cilantro picado en un recipiente y sazone al gusto. Agregue la carne y los pimientos y revuelva para cubrir. Cubra y refrigere por hasta 1 hora.", "Mezcle el cilantro restante y el aceite con el chile, el ajo y el jugo de lima para hacer un aderezo, condimentar al gusto y reservar.", "Precalentar la parrilla a un ajuste caliente. Pase la carne y los pimientos a los pinchos. Coloque los pinchos de carne de res en una bandeja forrada de papel de aluminio y ase a la parrilla durante 15 minutos, volteándolos a menudo y rociándolos con los jugos. Caliente los chapatis debajo de la parrilla.", "Pon dos brochetas en cada chapati, rocía sobre el aderezo de cilantro y sírvelo."]}, {"isVegetarian": false, "title": "Bourguignon de carne con puré de papas", "url": "www_bbc_co_uk_food_recipes_beef_bourguignon_with_89401", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de harina normal", "sal y pimienta negra recién molida", "1 kg / 2lb 4 oz de hoja de ternera, cortada en cubos grandes", "2 cucharadas de aceite de oliva", "150 g / 5oz de panceta, cortada en trozos pequeños", "2 chalotes, finamente picados", "1 diente de ajo, aplastado", "50ml / 2fl oz de brandy", "500ml / 18fl oz Borgoña u otro vino tinto", "250ml / 9fl oz de caldo de carne", "1 bouquet garni compuesto por 2 hojas de laurel, 2 ramitas de tomillo, 2 ramitas de hojas planas de perejil", "25g / 1oz de mantequilla", "Chalotes de bebé pelados de 150g / 5oz (o cebollas de botón congeladas)", "Setas de castaña 200g / 7oz", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "110g / 4oz de mantequilla", "110ml / 4fl oz de leche entera", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "100g / 3½oz de cebollas pequeñas perladas, peladas (o cebollas de botón congeladas)", "100 g / 3½ oz de tocino, cortado en lardons", "150g / 5oz botón champiñones, tallos eliminados dejó todo", "½ manojo de perejil plano, finamente picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne de bourguignon, espolvoree la harina en un plato y sazone con sal y pimienta negra recién molida. Dragar la carne con la harina sazonada y reservarla.", "Caliente una cucharada de aceite en una sartén grande con tapa y fríe la panceta durante 1-2 minutos o hasta que se dore. Agregue la carne y fría por otros 4-5 minutos, o hasta que se dore por cada lado. Agregue los chalotes y el ajo y fría por 4-5 minutos, o hasta que se ablanden.", "Agregue el brandy e incline lentamente la sartén hacia la llama de gas, o enciéndala con una cerilla. Deje que las llamas se enciendan y luego se apaguen. (Precaución: mantenga la cara y el cabello alejados de las llamas. No los deje solos).", "Agregue el vino tinto y el caldo de carne y cocine a fuego lento. Agregue el bouquet garni, luego cubra y cocine a fuego lento durante dos horas, o hasta que la carne esté tierna y la salsa se haya espesado.", "Caliente la mantequilla y el aceite restante en una sartén y fríe las cebollas del bebé durante 4-5, o hasta que estén doradas.", "Agregue las cebollas doradas y los champiñones castaños a la mezcla de carne y cocine por otros 20 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el puré, cocine las papas en una sartén con agua salada hirviendo durante 12-15 minutos, o hasta que las papas estén tiernas.", "Drene y regrese a la sartén, luego coloque sobre el fuego durante un minuto para eliminar el exceso de humedad.", "Aplaste bien las papas, luego agregue la mantequilla y la leche y bata con una cuchara de madera hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la guarnición, caliente el aceite de oliva y la mantequilla en una sartén pequeña. Agregue las cebollas y fría hasta que estén doradas. Agregue la panceta y fría hasta que esté dorado y crujiente. A continuación, agregue los champiñones y continúe freír hasta que los champiñones estén suaves y dorados. Termine con el perejil picado y déjelo a un lado hasta que esté listo para servir.", "Para servir, divida el puré por partes iguales entre los platos y sirva la carne del bourguignon al costado, con la guarnición en la parte superior."]}, {"isVegetarian": false, "title": "Carpaccio de ternera con alcaparras fritas y mayonesa de mostaza", "url": "www_bbc_co_uk_food_recipes_beef_carpaccio_with_18464", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Babero de 350g-400g / 12-14oz o filete de falda", "1 cucharada de aceite de maní o girasol", "1 cucharada de alcaparras, escurridas", "50g / 2oz de piñones, tostados", "1 cucharada de mostaza inglesa", "3 cucharadas de mayonesa", "1 cucharada de aceite de oliva virgen extra, más extra para lloviznar", "2 cucharadas de jugo de limón", "2 cucharadas de perejil fresco de flatleaf recién picado", "unas pocas virutas de parmesano (use un pelador de verduras para hacer esto)", "sal marina y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Sazone ambos lados del bistec a fondo con sal y pimienta. Caliente una sartén engrasada de base pesada hasta que esté caliente. Coloque el bistec en la sartén (debe chisporrotear inmediatamente) y cocínelo durante unos 3-5 minutos por cada lado para el medio raro. Transferir a una tabla de cortar y dejar reposar. Una vez que se haya enfriado, refrigere por 1 hora.", "Calentar una cucharada de aceite en una sartén a fuego medio y freír las alcaparras durante unos minutos hasta que estén crujientes e hinchadas. Retire a un recipiente forrado con papel de cocina.", "Mezcle la mostaza, la mayonesa y el aceite de oliva hasta que tenga una salsa suelta. Retire la carne de la nevera y corte finamente en astillas, cortando contra el grano.", "Arregle en un plato grande o bandeja de servir. Rocíe con la mayonesa de mostaza y el jugo de limón, y esparza sobre el perejil, los trozos de parmesano y las alcaparras. Rocíe con aceite de oliva y termine con los piñones y sal y pimienta."]}, {"isVegetarian": false, "title": "Carne de res y caldo de nuez moscada en masa fermentada", "url": "www_bbc_co_uk_food_recipes_beef_cheek_and_butternut_59977", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_cheek_and_butternut_59977_16x9.jpg", "ingredients": ["2 litros / 4¼ pintas de agua hirviendo", "50g / 1¾oz de hongos porcini secos", "4 cucharadas de aceite de oliva", "800 g / 1 libra de 12 onzas de carne de vacuno", "1 cebolla grande, más o menos picada", "1 calabaza, pelada, sin semillas, cortada en trozos de 5 cm / 2", "Pasta de cebada 250 g / 9 oz", "1 pan de masa fermentada redondo grande (el más grande que puedas encontrar)", "3 cucharadas de hojas de perejil fresco picado, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Vierta el agua hirviendo en un tazón grande y agregue los hongos porcini. Reserve para infundir durante 20 minutos.", "Mientras tanto, caliente el aceite en una sartén a fuego medio. Dore la mejilla de carne por todos lados durante 3-4 minutos, luego transfiera a una cazuela con tapa grande.", "Agregue las cebollas a la sartén y fría por 4-5 minutos, o hasta que estén suaves y doradas. Transfiera a la cazuela. Repita el proceso con la calabaza.", "Vierta el líquido porcini y los champiñones en la cazuela y lleve a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra a medias la cazuela con la tapa, luego cocine a fuego lento durante 3 horas, revolviendo ocasionalmente y llenando con agua hirviendo si el volumen del líquido se reduce significativamente.", "Después de 3 horas, incline el orzo en la cazuela y continúe cocinando por otros 10 minutos, o hasta que estén tiernos.", "Mientras tanto, corta la parte superior del pan de masa fermentada y ahueca el interior.", "Vierte el caldo en el pan de masa fermentada vacío, rociando sobre el perejil picado para adornar."]}, {"isVegetarian": false, "title": "Hamburguesas de carne con ensalada de remolacha y zanahoria", "url": "www_bbc_co_uk_food_recipes_beef_burger_with_98749", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_burger_with_98749_16x9.jpg", "ingredients": ["500 g / 1 libra de carne de vaca magra 2 oz", "50g / 1¾oz de pan blanco fresco", "2 cucharaditas de mostaza Dijon", "1 cucharada de pasta de tomate secada al sol", "1 cebolla pequeña, finamente picada", "1 cucharada de mejorana fresca picada", "3 cucharadas de perejil de flatillo picado", "1 yema de huevo de gallinas camperas", "2 cucharadas de aceite", "sal y pimienta negra recién molida", "4 cucharadas de mayonesa entera", "½ limón, solo jugo", "dash sugar", "1 cucharada de salsa de rábano picante", "1 zanahoria grande, pelada y rallada", "Remolacha cruda 150g / 5½oz, pelada y rallada", "2 palitos de apio, muy finamente picados", "2 cebollas de primavera, picadas", "3 cucharadas de perejil de flatillo picado", "2 cucharaditas de mostaza Dijon", "sal y pimienta negra recién molida", "6 hamburguesas o bollos de brioche, cortados por la mitad", "2 tomates grandes de bistec, cortados en rodajas gruesas", "1 pequeña joya, hojas separadas", "6 pepinillos grandes, en rodajas finas"], "serves": "Rinde 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer las hamburguesas, mida todos los ingredientes excepto el aceite en un tazón grande, sazone con sal y pimienta y mezcle con las manos para combinar. Forma en seis hamburguesas bastante planas. Coloque en el refrigerador hasta que lo necesite.", "Para hacer el repollo, mida la mayonesa, la mostaza, un chorrito de jugo de limón, azúcar y rábano picante en una ensaladera, sazone con sal y pimienta y revuelva para combinar. Agregue la zanahoria, la remolacha, el apio, la cebolla tierna y el perejil y revuelva hasta cubrir la salsa.", "Caliente el aceite en una sartén grande hasta que esté caliente. Freír las hamburguesas durante 3-5 minutos en cada lado, o hasta que estén doradas y recién cocidas.", "Planche el lado plano de los panecillos en la sartén hasta que estén tostados, cubra con una hamburguesa, una rodaja de tomate, lechuga, pepinillos y cualquier salsas o salsa picante de su elección. Sirve la ensalada en el lado."]}]