[{"ingredients": ["150ml / 5fl oz de aceite de girasol", "10 cebollas grandes, peladas, picadas", "1kg / 2lb 4 oz zanahorias, peladas, finamente picadas", "Carne picada de carne magra 5kg / 11lb", "Harina normal 300g / 10½ oz", "4,5 litros / 8 pintas de caldo de carne", "2.8 litros / 5 pintas de agua fría", "300g / 10½ oz de puré de tomate", "4 hojas de laurel secas", "4 cucharadas de salsa Worcestershire", "8 cucharadas de perejil finamente picado", "sal y pimienta negra recién molida", "Patatas harinosas de 8 kg / 18 lb, peladas y cortadas en piezas de tamaño uniforme", "400 g / 14 oz de mantequilla, en cubos", "450ml / 16fl de leche en oz"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite de girasol en una sartén grande a fuego medio y fría la cebolla y las zanahorias durante 7-8 minutos, o hasta que las cebollas estén blandas y ligeramente coloreadas.", "Agregue la carne picada a la sartén y cocine con las verduras durante 4-5 minutos, revolviendo con frecuencia, hasta que la carne esté dorada por completo.", "Espolvorea sobre la harina y revuelve bien durante unos minutos para evitar que se formen grumos.", "Poco a poco agregue el caldo de carne a la sartén, luego agregue el agua fría, el puré de tomate y las hojas de laurel. Llevar la mezcla a fuego lento, luego cubrir con la tapa y cocinar a fuego lento durante 25-30 minutos, revolviendo ocasionalmente, hasta que la carne esté tierna y la salsa se haya espesado.", "Sazonar con salsa Worcestershire, sal y pimienta negra recién molida y agregar el perejil. Retire del fuego, coloque la cuchara en varios platos a prueba de horno y reserve.", "Llene a la mitad una sartén muy grande, o dos sartenes más pequeñas, con agua fría. Agregue las papas y lleve a ebullición, luego reduzca el fuego a fuego lento y cocine por unos 15 minutos, o hasta que las papas estén muy suaves.", "Escurra las papas, luego regrese a la sartén a fuego medio. Cocine durante unos segundos para eliminar el exceso de humedad y luego retire las papas del fuego. Agregue la mantequilla y la leche y mezcle hasta que quede suave y cremoso. Sazonar con un poco de sal.", "Vierta el puré sobre la mezcla de carne picada, trabajando hacia el centro desde el exterior. Alise con una espátula y luego cree patrones en la superficie con un tenedor.", "Coloque los platos en las bandejas para hornear y hornee en el centro del horno durante unos 25 minutos, o hasta que las papas estén doradas y el relleno burbujee alrededor de los bordes."], "url": "www_bbc_co_uk_food_recipes_cottage_pie_46881", "title": "Pastel de cabaña para alimentar a una multitud", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, cortada en cubitos", "2 zanahorias, cortadas en cubitos", "1 diente de ajo, aplastado", "Carne picada de carne 250 g / 9 oz", "1 x 410 g / 14½ oz de frijoles al horno", "1 x 400 g / 14 oz de tomates de hojalata", "400 ml / 14 fl oz existencias, a partir de cubo de valores (idealmente de carne de vacuno pero pollo o vegetal está bien)", "Patatas de 900g / 2lb, cortadas en pedazos de igual tamaño", "100ml / 3½ fl oz de leche", "50g / 1¾oz de mantequilla", "sal y pimienta negra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una cacerola grande a fuego medio y agregue el aceite. Una vez caliente, freír las cebollas y las zanahorias suavemente con una pizca de sal durante 6-7 minutos, o hasta que las cebollas sean translúcidas pero no doradas. Agregue el ajo y cocine por otros dos minutos.", "Agregue la carne picada y revuelva para mezclar. Cocine por 5-6 minutos o hasta que toda la carne cruda se ponga marrón. Agregue los frijoles, tomates y caldo. Cocine a fuego lento la mezcla durante 30-40 minutos sin tapa para permitir que la mezcla se reduzca y espese un poco.", "Una vez cocinado, viértalo en una fuente para hornear de tamaño mediano de 21x27 cm / 8x11 pulgadas. Pruebe y agregue sal y pimienta según sea necesario. Deje que se enfríe y luego enfríe en la nevera durante 20 minutos; esto evitará que la papilla se hunda demasiado.", "Mientras tanto hierva las papas en una olla de agua hirviendo con sal durante 15 minutos hasta que estén tiernas. Retirar y escurrir, dejando secar al vapor en el colador durante 3-4 minutos.", "Calienta la leche y la mantequilla juntas en la sartén que usaste para cocinar las papas, hasta que la mantequilla se derrita. Una vez que las papas se hayan secado un poco, coloque de nuevo en la cacerola y machaque con un triturador de papas hasta que quede suave, mezcle bien con la mantequilla y la leche. Pruebe y agregue sal y pimienta al gusto.", "Coloque el puré de patatas encima de la base de carne en la fuente para hornear y hornee en el horno precalentado a 25-30 minutos, o hasta que burbujee y la parte superior de la papa esté dorada."], "url": "www_bbc_co_uk_food_recipes_cottage_pie_67314", "title": "Pastel de cabaña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "Picadillo de ternera a 900 g / 2lb", "2 cebollas picadas", "4 palitos de apio, cortados en cubitos", "50g / 1¾oz de harina natural", "250ml / 9fl oz de vino tinto", "300ml / ½ litro de carne de vacuno", "2 cucharadas de salsa Worcestershire", "2 cucharadas de azúcar mascabado ligero", "1 cucharada de tomillo picado", "250 g / 9 oz de pequeñas setas castañas marrones, en rodajas", "dash of grilled browning (opcional)", "sal y pimienta", "Patatas King Edward de 1,5 kg / 3 lb 5 oz, peladas y cortadas en rodajas de 4 mm", "150ml / 5fl oz de crema doble", "Queso cheddar fuerte 100 g / 3½ oz, rallado"], "method": ["Calentar el aceite en una sartén caliente y agregar la carne. Revuelva a fuego alto hasta que se dore. Con una cuchara ranurada, retire la carne picada de la sartén y déjela a un lado. Agregue las cebollas y el apio a la sartén y fría hasta que comience a ablandarse. Devuelve la carne a la sartén.", "Batir la harina y el vino juntos en un bol para hacer una pasta suave, batir en el caldo y luego agregarlo a la sartén con la salsa Worcestershire, el azúcar y el tomillo. Llevar a ebullición, revolviendo hasta que espese, luego agregue los champiñones y el jugo de salsa si le gusta. Condimentar con sal y pimienta. Cubra con una tapa y cocine a fuego lento durante 45 minutos, o hasta que la carne esté tierna. Compruebe el condimento y agregue sal y pimienta si es necesario.", "Cocine las rodajas de patata en agua hirviendo con sal por unos 4-5 minutos; las papas deben ser suaves. Escurrir cuidadosamente en un colador y dejar enfriar un poco. Si las papas son demasiado duras, estarán cerosas y la crema se les escapará.", "Incline la carne cocida en un plato poco profundo a prueba de horno de 2,4 litros / 4 pinta. Precaliente el horno a 220C / 425F / Gas 7 (ventilador de 200C).", "Coloque una capa de papa blanqueada sobre la carne picada y vierta más de la mitad de la crema. Coloque la papa restante en la parte superior, sazonando entre las capas. Verter sobre la crema restante y espolvorear sobre el queso.", "Hornee en el horno precalentado durante unos 30 minutos, o hasta que estén dorados y burbujeantes."], "url": "www_bbc_co_uk_food_recipes_cottage_pie_with_31714", "title": "Pastel de la casa con patata dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cottage_pie_with_31714_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "1 cebolla grande, pelada, picada", "2 palitos de apio, finamente picados", "2 zanahorias, peladas, finamente picadas", "2 dientes de ajo, pelados, finamente picados", "500 g / 17½ oz de carne magra picada", "150ml / 5fl oz de vino tinto", "2 cucharadas de harina normal", "500ml / 17½fl oz de caldo de carne", "300ml / 10½fl oz de agua fría", "2 cucharadas de puré de tomate", "½ cucharadita de hierbas secas mezcladas", "1 hoja de laurel seca", "splash salsa Worcestershire", "sal y pimienta negra recién molida", "800 g / 1 libra de papas harinas de 12 onzas, como King Edward o Maris Piper, peladas y cortadas en piezas de tamaño uniforme", "40 g / 1½ oz de mantequilla, en cubos", "3 cucharadas de leche", "100g / 3½ oz de queso cheddar maduro, rallado", "sal y pimienta negra recién molida", "judías verdes o repollo Savoy rallado, cocido"], "method": ["Caliente el aceite de girasol en una sartén grande con tapa a fuego medio y fríe con cuidado la cebolla, el apio y las zanahorias durante 7-8 minutos, o hasta que las cebollas estén blandas y ligeramente coloreadas. Agregue el ajo y cocine por 2-3 minutos más.", "Agregue la carne picada a la sartén y cocine con las verduras durante 4-5 minutos, revolviendo con frecuencia, hasta que la carne esté dorada por completo.", "Verter el vino en la sartén, llevar la mezcla a ebullición y cocinar durante 4-5 minutos, o hasta que la mayoría del líquido se haya evaporado, luego espolvorear sobre la harina y mezclar bien durante unos minutos para evitar la formación de grumos.", "Poco a poco agregue el caldo de carne a la sartén, luego agregue el agua fría, el puré de tomate y las hierbas secas. Llevar la mezcla a fuego lento, luego cubrir con la tapa y cocinar a fuego lento durante 25-30 minutos, revolviendo ocasionalmente, hasta que la carne esté tierna y la salsa se haya espesado. Sazonar con un toque de salsa Worcestershire y sal y pimienta negra recién molida. Retírelo del fuego, espolvoréelo en un recipiente para horno de 1,5 litros / 2 pintas de 13 fl oz y déjelo a un lado.", "Precalentar el horno a 200C / 400F / Gas 6.", "Llena a la mitad una sartén grande con agua fría. Agregue las papas y lleve a ebullición, luego reduzca el fuego a fuego lento y cocine por unos 15 minutos, o hasta que las papas estén muy suaves.", "Escurra las papas, luego regrese a la sartén a fuego medio. Cocine por unos segundos para eliminar el exceso de humedad, luego retire las papas del fuego. Agregue la mantequilla, la leche, el queso y el puré hasta que quede suave y cremoso. Sazonar con sal y pimienta negra recién molida.", "Vierta la mezcla sobre la mezcla de carne picada en el plato a prueba de horno, trabajando hacia el centro desde el exterior. Suave con un cuchillo de paleta. Cuando toda la carne esté cubierta con puré, cree patrones en la superficie con un tenedor.", "Coloque el plato en una bandeja de horno y hornee en el centro del horno durante unos 25 minutos, o hasta que las papas estén doradas y el relleno burbujee alrededor de los bordes. Sirva con judías verdes recién hechas o repollo Savoy rallado."], "url": "www_bbc_co_uk_food_recipes_cottagepiewithcheesy_93216", "title": "Pastel de requesón con puré de queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cottagepiewithcheesy_93216_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla grande, picada", "1 zanahoria mediana, picada", "560 g / 1¼ lb de carne picada", "1 x 400g / 14oz puede tomates", "2 cucharadas de puré de tomate", "290ml / 10fl oz de caldo de carne", "1 hoja de laurel", "1 ramita de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "1 cucharada de ketchup de tomate", "1 cucharada de salsa Worcestershire", "mantequilla perilla", "2 puerros picados", "4 papas grandes King Edward", "crema de salpicaduras (al gusto)", "mantequilla de perilla grande (al gusto)", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande con tapa. Agregue la cebolla y la zanahoria y fría a fuego medio durante cinco minutos hasta que estén suaves.", "Agregue la carne picada a la sartén y fría por unos minutos para dorar la carne picada por todas partes.", "Agregue los tomates, el puré de tomate, el caldo de carne, la hoja de laurel y el tomillo a la sartén.", "Cocine a fuego lento durante 30 minutos. Sazonar con sal y pimienta negra recién molida.", "Mientras tanto, para el aderezo de puré, corte las papas en cuartos y hiérvalas en una sartén con agua salada hirviendo durante aproximadamente 10-15 minutos, hasta que estén tiernas.", "Cuando las papas estén cocidas, escurra el agua y machaque bien las papas.", "Agregue la crema, la mantequilla y la sal y pimienta negra recién molida al gusto. Dejar de lado. Precalentar el horno a 190C / 375F / Gas 5.", "Después de 30 minutos de cocción, pruebe la carne y agregue ketchup y salsa Worcestershire si lo desea. Si la mezcla está demasiado húmeda, cocine por unos minutos más para reducir el líquido.", "En una sartén por separado, caliente un poco de mantequilla. Agregue los puerros y fría hasta que estén suaves, pero no coloreados.", "Transfiera la carne a un plato resistente al horno y coloque los puerros encima.", "Coloque cucharadas del puré sobre la carne y los puerros y use una espátula húmeda para alisar los bordes. Cocine durante aproximadamente 30 minutos, hasta que la papa esté crujiente y dorada alrededor de los bordes. Servir caliente."], "url": "www_bbc_co_uk_food_recipes_cottagepiewithleeks_85908", "title": "Pastel de requesón con puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 4oz para hornear papas", "75g / 3oz de mantequilla", "150ml / 5fl de leche en oz", "Sal y pimienta negra recién molida", "400ml / 14fl oz de caldo de carne", "200ml / 7fl oz de vino tinto", "75ml / 3fl oz de vinagre balsámico", "1 cucharada de aceite de oliva", "1 cebolla, pelada, finamente picada", "2 zanahorias, peladas, finamente picadas", "750g / 1lb 11oz carne picada", "1 cucharada de harina normal", "1 hoja de laurel", "Sal y pimienta negra recién molida", "150 g / 5oz de guisantes cocidos, para servir"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el relleno de puré de patatas, pinche las papas con un tenedor y hornee en el medio del horno durante 1-1½ horas, o hasta que estén tiernas.", "Mientras tanto, para el relleno, caliente el caldo de carne, el vino tinto y el vinagre balsámico en una cacerola hasta que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 10-12 minutos, o hasta que el volumen del líquido se haya reducido a la mitad.", "Calentar el aceite de oliva en una sartén grande no reactiva y freír las cebollas y las zanahorias durante 1-2 minutos, o hasta que se ablanden. Agregue la carne picada de res y continúe cocinando durante 4-5 minutos, o hasta que se dore por todas partes. Agregue la harina común y cocine durante 1-2 minutos, luego mezcle la mezcla madre diluida y agregue la hoja de laurel.", "Cocine a fuego lento la mezcla durante 45-60 minutos, o hasta que la carne esté tierna y la salsa se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cuando las papas estén cocidas, córtelas por la mitad, saque la carne y póngala en una cacerola a través de un ricot de papa.", "Coloque la cacerola sobre el fuego, agregue la mantequilla y la leche y revuelva bien con una cuchara de madera hasta que el puré esté suave y cremoso. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para armar la tarta de la casa, coloca la carne picada cocida en una fuente para hornear y coloca el puré de patatas encima.", "Hornee en el horno durante 20-25 minutos, o hasta que estén dorados y burbujeantes.", "Para servir, espolvorea un pastel de requesón en cada uno de los 4 platos para servir. Coloque los guisantes al lado."], "url": "www_bbc_co_uk_food_recipes_cottagepiewithpeas_93324", "title": "Pastel de requesón con guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de comino", "1 cucharada de semillas de cilantro", "50 g / 2 oz de raíz fresca de jengibre", "50g / 2oz de ajo", "2-3 cucharadas de aceite de girasol", "1.25kg / 2lb 12 oz limpiado hombro o pierna de cordero (se mantiene entero)", "2 x 2.5cm / 1 en pedazos canela (o corteza de cassia)", "3-4 cardamomo verde", "2-3 dientes", "3-4 granos de pimienta negra", "2-3 chiles rojos secos grandes", "3 cebollas medianas, picadas", "250g / 9oz de tomates picados", "1 cucharadita de sal, más extra para condimentar", "pimienta negra recién molida", "1 cucharada de cilantro fresco", "3-4 papas para hornear grandes, peladas y picadas", "1 cucharada de mantequilla", "½ cucharadita de semillas de comino", "2-3 dientes de ajo, finamente picados", "1 chile rojo seco, rallado", "250g / 9oz de hojas frescas de espinaca, en trozos grandes", "2 huevos medianos", "Crema doble 75ml / 3floz"], "method": ["Para el relleno del pastel de pastor, precaliente el horno a 140 ° C / 275 ° F / Gas 1.", "Coloque las semillas de comino y cilantro en una sartén seca a fuego lento y tueste hasta que cambien de color ligeramente, luego retírelo de la sartén.", "Moler las especias, el jengibre y el ajo juntos en un molinillo de especias en una pasta fina, agregando solo tanta agua como sea necesario para convertirla en una pasta.", "Caliente una cazuela grande a prueba de horno hasta que esté medianamente caliente, agregue el aceite y continúe calentando hasta que se forme una neblina.", "Agregue el cordero y marque bien en todos los lados hasta que la carne esté bien sellada.", "Retire el cordero de la sartén y déjelo a un lado, luego agregue la canela, el cardamomo, los clavos de olor, los granos de pimienta y los chiles rojos partidos en trozos, a la sartén.", "Freír las especias durante 1-2 minutos hasta que los dientes se hinchen un poco. Agregue un poco de agua a la sartén para desglasarlo, raspando cualquier residuo de carne y disolviéndolo en el agua.", "Agregue las cebollas picadas y cocine hasta que el líquido se evapore, luego fría las cebollas hasta que estén blandas, alrededor de 4-5 minutos.", "Agregue la pasta de especias y cocine durante 5-6 minutos, mezcle bien y luego devuelva el cordero a la sartén.", "Cubra el cordero con la mezcla, sazone ligeramente con sal y pimienta negra recién molida, y cubra la sartén.", "Coloque la sartén en el horno y cocine por 2- 2 horas y media, revolviendo la cazuela de vez en cuando y asegurándose de que las cebollas no se enganchen en el fondo de la sartén.", "Agregue los tomates picados y mezcle bien (agregue un poco más de agua si parece seco) luego cubra y vuelva al horno por otros 15 minutos.", "Verifique que el cordero esté cocido: la carne se habrá retirado del hueso y la carne se sentirá suave al tacto.", "Levante el cordero de la cazuela y colóquelo en una bandeja para que se enfríe un poco.", "Con cuidado, retire todas las especias de la salsa en la cazuela y deséchelas.", "Cuando el cordero esté lo suficientemente frío para manipularlo, saque la carne del hueso y vuelva a colocarla en la cazuela con la salsa.", "Vuelva a colocar a fuego medio bajo y cocine hasta que la salsa se espese bien.", "Agregue el cilantro recién picado, revise el condimento y la cuchara en un plato resistente al horno, lo suficientemente grande como para que el relleno llegue a 2 cm / 1 pulgada de la parte superior del plato.", "Para el relleno, coloque las papas en una cacerola y cúbralas con agua, deje hervir y cocine a fuego lento hasta que estén tiernas.", "Drene, devuelva las papas a la sartén y vuelva a colocarlas sobre el fuego para eliminar la humedad adicional.", "Pase las papas cocidas a través de un ricer (o tritúrelas a un puré suave) y reserve.", "Coloque la mantequilla en el tablero con las semillas de comino, luego pellizque los dos juntos.", "Caliente una sartén y agregue la mantequilla de comino y fríela suavemente hasta que el comino se coloree suavemente, pero no la caliente demasiado o la mantequilla se quemará.", "Tan pronto como el comino cambie de color, retire las semillas y agregue a las papas, transfiriendo la menor cantidad de mantequilla posible.", "Agregue el ajo picado y el chile a la mantequilla en la sartén y fría con cuidado durante un minuto.", "Cuando el ajo esté dorado claro, agregue las hojas de espinaca, revuelva por un minuto o más hasta que esté suave, sazone ligeramente y luego sáquelo de la sartén y colóquelo directamente sobre el plato de cordero rallado, extendiéndolo uniformemente sobre la parte superior.", "Mezcle las semillas de comino en la papa con los huevos y la crema y mezcle bien hasta que esté suave, luego verifique el condimento.", "Extienda la papa sobre la espinaca de manera uniforme, frote un poco la superficie, no tiene que ser lisa, simplemente extenderse.", "Vuelva a colocar en el horno durante 10 minutos, luego aumente la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y cocine por otros 15 minutos hasta que se doren.", "Para servir, coloque una cucharada de pastel en un plato para servir y sirva con un poco de pan crujiente o arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_country_captain_95324", "title": "Pastel de pastor del capitán del país", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo grande para asar, cortado en 8 piezas", "120g / 4oz de mantequilla", "3 cebollas grandes, en rodajas finas", "2 dientes de ajo, finamente picados", "1 cucharada de raíz de jengibre fresco rallado", "2 dientes", "2 hojas de laurel", "Palo de casia de 2.5cm / 1in", "1 cucharadita de cúrcuma", "2 cucharaditas de pimienta negra recién molida", "¾ cucharada de chile verde / rojo fresco finamente picado", "200ml / 7fl oz de caldo de pollo", "½ limón, solo jugo", "sal y pimienta negra recién molida", "hojas frescas de cilantro, para adornar", "200g / 7oz de arroz, cocido de acuerdo con las instrucciones del paquete", "cebolla roja, cortada en anillos", "tocino, cortado en tiras finas y frito hasta que quede crujiente", "coco fresco, rallado", "miseria", "1 huevo de gallinas camperas, duro y picado"], "method": ["Caliente una sartén grande hasta que esté caliente y luego agregue la mitad de la mantequilla y todas las piezas de pollo. Freír el pollo, revolviendo con frecuencia, hasta que se dore por todos lados, luego retírelo de la sartén y póngalo a un lado.", "Derretir la mantequilla restante en otra sartén grande a fuego medio. Agregue la cebolla y fría por 3-4 minutos, hasta que esté suave y dorada.", "Agregue el jengibre y el ajo y fría por un minuto.", "Agregue los dientes de ajo, las hojas de laurel, el palo de casia, la cúrcuma, la pimienta negra y los chiles y fríe durante 1-2 minutos para liberar los sabores.", "Agregue las piezas de pollo y la mitad del caldo. Reduzca el fuego y cocine a fuego lento durante unos 20 minutos hasta que el pollo esté tierno y completamente cocido. (Si es necesario, agregue más caldo durante la cocción para evitar que el pollo se pegue a la sartén).", "Agregue el jugo de limón, sazónese, al gusto, con sal y pimienta negra recién molida y adorne con hojas de cilantro picado.", "Para servir, coloque una cucharada de arroz cocido en cada uno de los cuatro platos y póngalo junto al curry. Espolvorear con aros de cebolla roja, tocino crujiente, coco, maní y huevo duro."], "url": "www_bbc_co_uk_food_recipes_countrycaptainchicke_84737", "title": "Capitán de pollo al curry de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla roja picada", "3 ciruelas, piedras removidas, toscamente picadas", "2 cucharadas de azúcar moreno", "1 cucharada de miel clara", "2 cucharadas de vinagre de vino tinto", "1 lima, solo jugo", "15g / ½ oz de mantequilla", "3 huevos grandes de gallinas camperas, golpeados", "2 rebanadas de jamón, picadas", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco picado"], "method": ["Para la cebolla roja y la salsa de ciruela, caliente el aceite en una sartén. Agregue la cebolla roja y las ciruelas y fría a fuego alto. Agregue los ingredientes de condimento restantes a la sartén y cocine a fuego lento durante cinco minutos hasta que se ablanden.", "Sirva el condimento en un tazón pequeño y déjelo enfriar mientras prepara la tortilla.", "Para la tortilla, derrita la mantequilla en una sartén pequeña.", "Mezcle el huevo batido con el jamón picado en un tazón pequeño y sazone bien con sal y pimienta negra recién molida.", "Agregue la mezcla de huevo a la sartén y mezcle con una cuchara de madera hasta que comience a ponerse alrededor del borde de la sartén. Deje cocinar a fuego lento hasta que se haya fraguado completamente. Con cuidado, voltea la tortilla en un plato y corta en rodajas.", "Sirva la tortilla con el gusto en el lado, adornado con perejil picado."], "url": "www_bbc_co_uk_food_recipes_countryhamomelettewi_87772", "title": "Tortilla de jamón del país con cebolla roja y salsa de ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tallos de apio", "2 zanahorias", "4 cucharadas / 2½ fl oz de aceite de oliva de buena calidad", "1 cebolla grande", "2 patatas pequeñas (como Maris Piper)", "4 dientes de ajo", "1 bouquet garni listo para usar (como tomillo, perejil, romero y salvia)", "2 litros / 3 pintas de agua 10 fl oz", "sal y pimienta negra recién molida", "200 g / 7oz de alubias en conserva, enjuagadas y escurridas", "gran manojo de albahaca fresca hojas", "100 g / 3½ oz de queso parmesano", "100ml / 3½fl oz de aceite de oliva de buena calidad, más extra para lloviznar", "sal y pimienta negra recién molida"], "method": ["Pique el apio y las zanahorias en dados pequeños.", "Mientras estás cortando las verduras, calienta el aceite de oliva en una sartén de fondo grueso. Agregue el apio picado y las zanahorias a la sartén.", "Pele la cebolla y pique en pedazos del mismo tamaño que el apio picado y las zanahorias. Agregar a la sartén.", "Pique las papas en pedazos del mismo tamaño que las otras verduras y agregue a la sartén.", "Triture ligeramente los dientes de ajo con la palma de su mano y agregue los dientes sin pelar a la sartén. Suavemente sude las verduras en el aceite de oliva por unos minutos, solo para colorearlas ligeramente. Agrega el bouquet garni.", "Vierta en el agua y sazone con sal y pimienta negra recién molida. Cubra y traiga la sopa a fuego lento y cocine durante unos 10-15 minutos, hasta que las verduras estén tiernas.", "Haz el pistou. Coloque las hojas de albahaca en un tazón limpio. Picar el parmesano y agregarlo al bol. Vierta el aceite de oliva y sazone con sal y pimienta negra recién molida.", "Mezcle con una salsa suave con una licuadora de mano (o puede preparar la salsa en un mini procesador de alimentos). La salsa debe ser de color verde brillante y tener una consistencia bastante suave (es posible que necesite agregar más aceite).", "Agregue los frijoles a la sopa. Eliminar el bouquet garni.", "Cocine hasta que los vegetales estén tiernos y los granos se hayan calentado.", "Para servir, ponga la sopa en cuencos y agite una o dos cucharadas de pistou en cada una. Rocíe un poco de aceite de oliva y sirva con un buen pan."], "url": "www_bbc_co_uk_food_recipes_countryvegetablesoup_90195", "title": "Sopa de verduras del país con pistou de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/countryvegetablesoup_90195_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de copos de 160 g / 5¾oz, laminada a 5 mm de grosor", "20 g / oz de mantequilla", "1 calabacín, finamente rallado", "sal y pimienta", "100g / 3½oz de brócoli, cortado en pequeños floretes", "2 huevos de gallinas camperas", "180ml / 6fl de leche en oz", "50g / 1¾oz de queso cheddar rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cubra una tarta de 20 cm / 8 in (3,5 cm / 1¼ de profundidad) con la masa, luego colóquela en la nevera durante 30 minutos.", "Cubra la masa con papel de hornear y rellene con alubias para hornear. Hornee en el horno durante 10-15 minutos, o hasta que la masa esté seca.", "Retire el pergamino para hornear y los frijoles y devuelva la caja de repostería al horno por otros 3-5 minutos o hasta que la masa esté dorada y apenas cocida.", "Baje el horno a 180C / 350F / Gas 4.", "Calentar una sartén hasta que esté caliente. Agregue la mantequilla y los calabacines y cocine hasta que estén dorados. Sazone con sal y pimienta negra, luego drene a través de un colador para eliminar el exceso de humedad.", "Espolvoree el brócoli en una olla con agua hirviendo durante 1-2 minutos o hasta que esté cocido. Escurrir, luego actualizar en un tazón de agua helada y escurrir una vez más. Agregue a los calabacines cocidos y mezcle para combinar. Dispersar sobre el fondo de la caja de pastelería.", "Coloque los huevos y la leche en un bol, sazone con sal y pimienta negra y mezcle bien. Agregue la mitad del queso y bata una vez más.", "Verter sobre la mezcla de huevo y leche encima de las verduras en la caja de pastelería, luego esparcir el queso restante por la parte superior.", "Hornee en el horno durante 40-45 minutos, o hasta que estén dorados, burbujeantes y simplemente listos.", "Dejar enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_courgette_and_broccoli_22292", "title": "Quiche de calabacín y brócoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgette_and_broccoli_22292_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de comino", "100g / 3½ oz de harina de auto crianza", "100g / 3½oz de harina integral", "175g / 6oz de azúcar en polvo de oro", "1 cucharadita de polvo de hornear", "pizca de sal", "200g / 7oz de mantequilla sin sal, ablandada", "3 huevos de gallinas camperas", "Calabacines de 250g / 9oz, rallados y secados en una toalla de té limpia", "3-4 manzanas jugosas que comen, peladas", "2-3 cucharadas de jugo de manzana nublado", "2 cucharadas de azúcar", "50g / 2oz de mantequilla, ablandada", "300 g / 10 oz de queso crema, suavizado", "2 puñados de avena", "azúcar en polvo de oro"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Haga una línea con latas de pastel de 2 x 20 cm / 8 pulgadas de diámetro con pergamino para hornear.", "A fuego medio en una sartén, tueste las semillas de alcaravea por 2-3 minutos hasta que estén fragantes.", "Tamiza las harinas en el recipiente de un procesador de alimentos y luego agrega el azúcar, el polvo de hornear y la sal. Agregue la mantequilla y los huevos y trátelos hasta que formen una mezcla. (También puede hacerlo en un tazón grande con un mezclador eléctrico de mano).", "Incline la mezcla en un tazón grande y doble suavemente a través de los calabacines rallados y las semillas de alcaravea.", "Divida la mezcla en partes iguales entre las dos latas de torta forradas y cocine durante 25-30 minutos o hasta que estén doradas y elásticas al tacto. Retirar de las latas y enfriar sobre una rejilla.", "Para el relleno, rallar las manzanas en una sartén y agregar el jugo de manzana según sea necesario para mantener las manzanas húmedas. Agregue el azúcar y deje que la mezcla hierva a fuego lento, revolviendo de vez en cuando hasta que las manzanas estén blandas, caramelizadas y toda la acidez evidente haya desaparecido. Apaga el fuego y deja enfriar.", "Agregue la mantequilla y la mezcla de manzana enfriada al tazón de un procesador de alimentos grande y mezcle hasta obtener un puré. Revuelva esto en el queso crema ablandado y reserve.", "Para el relleno, tueste la avena en una sartén seca hasta que esté dorada y aromática, luego agregue el azúcar para caramelizar la avena.", "Una vez que los pasteles estén frescos, extiende una capa gruesa del relleno sobre una torta. Coloca suavemente la otra torta en la parte superior, luego extiende una capa más delgada de glaseado en la parte superior. Espolvorear con la avena tostada y servir."], "url": "www_bbc_co_uk_food_recipes_courgette_and_caraway_84359", "title": "Torta de calabacín y alcaravea", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 pastel de 20cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgette_and_caraway_84359_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz", "pizca de sal", "85g / 3oz de mantequilla fría, cortada en cubitos", "80g / 2¾oz de queso parmesano (o un queso duro vegetariano similar)", "2 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas, batido para lavar huevos", "2 calabacines, cortados en un dado grande", "sal", "botón de mantequilla", "1 cebolla, finamente rebanada", "1 chile rojo, cortado en cubitos (deja las semillas adentro para agregar un poco de calor)", "Queso cheddar 200 g / 7 oz, rallado", "Crema doble de 200 ml / 7 fl oz", "6 yemas de huevo de gallinas camperas", "1 huevo de gallinas camperas", "nuez moscada pizca", "50g / 1¾oz de queso parmesano, rallado (o un queso duro vegetariano similar)", "4 flores de calabacín", "aceite de colza, al gusto", "sal y pimienta negra agrietada"], "method": ["Para hacer la masa de queso parmesano, en un procesador de alimentos mezcle la harina, la sal, la mantequilla y el parmesano juntos y luego agregue las yemas y dos cucharaditas de agua. Pulse hasta que se junte en una masa.", "Envuelva la masa en una película adhesiva y descanse en la nevera durante una hora.", "Para hacer el relleno, coloque el calabacín en un colador sobre un tazón. Espolvorea con sal y déjalo por 30 minutos para eliminar parte de la humedad.", "Calentar la mantequilla en una sartén. Cuando haga espuma, agregue las cebollas y cocine hasta que estén suaves.", "Lave bien el calabacín en agua corriente y exprima el exceso de agua. Agregue el calabacín y el chile a las cebollas y cocine durante 3-4 minutos más.", "Para la pasta de queso parmesano, extender la masa refrigerada sobre una superficie de trabajo enharinada al grosor de una moneda de una libra.", "Forre un aro de tarta de 20cm / 8in con la masa, teniendo cuidado de empujar la masa en las esquinas y dejando cualquier exceso colgando sobre el borde. Coloque en la nevera durante una hora para descansar.", "Precalentar el horno a 170C / 340F / Gas 3½.", "Cuando esté descansado, forre la caja de repostería con un pergamino para hornear y frijoles para hornear (alternativamente, use arroz o lentejas sin cocer). Hornee la pastelería ciega hasta que esté completamente cocida y tenga un color dorado claro, aproximadamente 15 a 20 minutos. Si el borde de la masa se cocina demasiado rápido, retire la tarta del horno y déjela a un lado con los granos para hornear dejados en su lugar (el calor residual en los granos permitirá que la masa termine de cocinarse sin colorear más). Retire los granos para hornear de la base.", "Una vez que la masa esté cocida, use un cuchillo afilado de sierra para cortar el exceso de masa del lado de la tarta. Retire las migas de la base y cepille con un lavado de huevo.", "Para el llenado, reduzca la temperatura del horno a 160 ° C / 320 ° F / Gas 3.", "En un recipiente para mezclar, mezcle la mezcla de queso cheddar y cebolla. Agregar al caso de pastelería.", "Pon la crema en una cacerola y llévala a ebullición. Agregue las yemas de huevo y cocine hasta que alcancen los 82 ° C / 180 ° F en un termómetro de cocina, luego mezcle todo el huevo y la nuez moscada.", "Vierta la mezcla de crema y huevo en la base de tarta para llenar. Hornee por 20-25 minutos, o hasta que la presentación esté lista.", "Para terminar, esparza el queso parmesano sobre la tarta cocida y usa un soplete para cocinar para dorar el relleno.", "Coloque las flores de calabacín en un recipiente de vapor y cocine por 2-3 minutos. Rocíe con un poco de aceite de colza y sazone con sal y pimienta.", "Para servir, deje que la tarta se enfríe un poco antes de cortar y servir con las flores de calabacín."], "url": "www_bbc_co_uk_food_recipes_courgette_and_cheddar_33978", "title": "Calabacín y tarta de queso cheddar", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750ml / 1¼ pintas de pollo o verdura", "25 g / 1oz de mantequilla sin sal", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "3 ramitas de tomillo fresco, solo hojas", "200g / 7oz de arroz risotto", "200ml / 7fl oz de vino blanco", "Calabacines de 200g / 7oz, cortados, cortados en cubos de 1cm / ½ en cubitos", "4 cucharadas de queso parmesano rallado, más extra para servir", "1 limón sin cebar, ralladura finamente rallada, más 1 cucharada de jugo de limón", "sal y pimienta negra recién molida"], "method": ["Deje que el caldo hierva a fuego lento en una cacerola, luego manténgalo caliente a fuego medio-bajo.", "Calentar la mantequilla en una cacerola grande de base pesada a fuego medio. Agregue los chalotes, el ajo y el tomillo y fría por 1-2 minutos, o hasta que se ablanden.", "Agregue el arroz y mezcle bien hasta que esté cubierto con la mantequilla derretida. Agregue el vino y cocine a fuego lento hasta que casi se haya evaporado.", "Agregue un par de cucharadas del caldo caliente a la sartén, dejando hervir a fuego lento y revolviendo regularmente, hasta que el arroz haya absorbido la mayor parte del líquido. Continúe agregando el caldo de a poquito, revolviendo el arroz regularmente.", "Cuando se haya agregado la mitad del caldo al arroz, mezcle los calabacines, luego continúe agregando el caldo restante hasta que el arroz esté tierno pero tenga una ligera mordida ̶ aproximadamente 15-18 minutos de tiempo total de cocción.", "Agregue el parmesano, la ralladura de limón y el jugo de limón (al gusto). Sazonar bien con sal y pimienta negra recién molida. Servir en tazones, espolvoreado con más queso parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_courgette_and_lemon_44907", "title": "Risotto de calabacín y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgette_and_lemon_44907_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharaditas de aceite de oliva", "1 cebolla roja, finamente rebanada", "375g / 13oz de calabacines, cortados en cubitos", "6 huevos de gallinas camperas", "2 cucharadas de menta picada", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén antiadherente grande con un mango ignífugo. Agregue la cebolla y los calabacines y fría con fuego suave durante 5 minutos, o hasta que estén ligeramente dorados y recién cocinados.", "Precalentar la parrilla a un ajuste caliente.", "Batir los huevos, 2 cucharadas de agua y menta picada. Sazonar con sal y pimienta negra recién molida.", "Agregue la mezcla de huevo a la sartén. Cocine, sin remover, durante 4-5 minutos, o hasta que la frittata esté casi lista y la parte inferior esté dorada.", "Transfiera la sartén a una parrilla caliente y cocine durante 3-4 minutos hasta que la parte superior esté dorada y la frittata esté bien cocida.", "Cortar en cuñas y servir."], "url": "www_bbc_co_uk_food_recipes_courgette_and_mint_16928", "title": "Tortilla de calabacín y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgette_and_mint_16928_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "50g / 2oz de azúcar morena suave", "50g / 2oz de mantequilla suave", "1 huevo", "Calabacín 60g / 2oz", "90g / 3¼ oz de harina de auto crianza", "1 cucharadita de especias mixtas", "media lima, solo jugo"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pese y mida todos los ingredientes. Pida a un adulto que precaliente el horno a 220 ° C / 425 ° F / Gas 7. Engrase un molde pequeño (500 g) de pan con un poco de aceite vegetal con un cepillo para pasteles.", "Coloque el azúcar y la mantequilla en un tazón. Usando la parte trasera de un tenedor machaque los ingredientes hasta que estén completamente combinados.", "Rompe el huevo en una taza y bate con un tenedor. Agregue el huevo al azúcar y la mantequilla y revuelva.", "Rallar el calabacín y agregarlo a la mezcla con la harina, la mezcla de especias y el jugo de lima y remover con una cuchara de madera.", "Pon la mezcla en la lata de pan preparada. Pídale a un adulto que lo ponga en el horno por 20-25 minutos hasta que se dore en la parte superior. Servir en rodajas con un poco de fruta fresca."], "url": "www_bbc_co_uk_food_recipes_courgette_cake_99031", "title": "Pastel de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente rebanada", "2 dientes de ajo, en rodajas finas", "8 hojas grandes de acelgas arcoiris suizas, tallos blancos descartados, toscamente picados", "2 cucharadas de hojas de menta, finamente picadas", "2 cucharadas de perejil fresco, finamente picado", "350 g / 12oz de hojaldre de mantequilla confeccionado", "100g / 3½oz de queso ricotta", "1 limón, ralladura solamente", "6 flores de calabacín, cortadas a la mitad a lo largo si son grandes o 1 calabacín, en rodajas finas a lo largo", "75 g / 2½ oz de queso feta, desmenuzado", "50g / 1¾oz de queso parmesano (u otro queso duro vegetariano), finamente rallado", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y alinee una bandeja de hornear con papel de hornear.", "Calentar el aceite en una sartén mediana a fuego medio y freír la cebolla durante 1-2 minutos. Agregue el ajo y cocine por otros 2 minutos. Agregue la acelga, la menta y el perejil y cocine hasta que se marchite. Condimentar con sal y pimienta.", "Estirar la masa de hojaldre en una superficie enharinada hasta un rectángulo de 20cmx30cm / 8inx12in y colocar en la bandeja de hornear. Marca una línea de 2 cm / 1 pulgada alrededor del borde y pincha el interior de la tarta con un tenedor.", "Extienda la ricota y la ralladura de limón sobre la masa y cubra con la cebolla cocida y la acelga. Coloque los calabacines flores de la cabeza a los pies a lo largo de la masa. Termine con el queso feta y el parmesano rallado.", "Cepille el borde de la masa con el huevo batido y cocine de 20 a 30 minutos o hasta que la pasta esté cocida. Retire la tarta del horno y colóquela en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_courgette_flower_and_25669", "title": "Calabacín y tarta de acelga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Calabacines de 800 g / 1 libra y 12 onzas, cortados en rodajas de 5 mm / ¼ de pulgada", "algunas ramitas de tomillo", "algunas hojas de albahaca", "100 ml / 3½ fl oz crema fresca", "50ml / 2fl de leche en oz", "1 cucharadita de harina común", "Gruyère de 75 g / 2½ oz o queso similar, rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / Fan 180C / Gas 6", "Pon el aceite de oliva en una sartén grande con tapa. Agregue los calabacines y las hierbas y sazone con sal y pimienta.", "Cubra y cocine suavemente durante 10 minutos, revolviendo de vez en cuando, hasta que los calabacines se hayan suavizado un poco, pero todavía estén al dente. El aceite debería haber tomado un color verde intenso y profundo de los calabacines.", "Transfiera a un plato de horno. Batir la crème fraîche, la leche y la harina juntas en un bol y sazonar con sal. Vierta esta mezcla sobre los calabacines, no será suficiente para cubrir completamente los calabacines, pero está bien, se hará burbujas cuando cocine.", "Espolvorea sobre el queso. Hornee en el horno por alrededor de 25 minutos o hasta que se dore y burbujee."], "url": "www_bbc_co_uk_food_recipes_courgette_gratin_04270", "title": "Gratinado de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/courgette_gratin_04270_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 papas para hornear grandes, ralladas gruesas", "sal y pimienta", "1 calabacín, rallado", "2 cucharadas de aceite de oliva", "2 cucharadas de mantequilla sin sal", "2 cucharaditas de vinagre de vino blanco", "4 huevos de gallinas camperas", "2 chalotes, en rodajas finas", "1 cucharada de vinagre de vino blanco", "4 cucharadas de vino blanco", "225g / 8oz de mantequilla salada, en cubos", "4 cucharadas de cebolletas frescas picadas", "2 tomates, pelados, sin semillas, finamente picados", "50g / 1¾oz de harina natural", "50g / 1¾oz de harina de maíz", "pizca de sal", "150ml / 5½fl oz de agua con gas", "8 flores de calabacín"], "method": ["Para el calabacín rösti, sazone generosamente las papas ralladas y luego mezcle con el calabacín. Forme la mezcla en hamburguesas planas, luego cubra y enfríe por 20 minutos.", "En una sartén, caliente el aceite y la mantequilla a fuego medio. Freír los rösti durante cuatro minutos a cada lado, o hasta que estén crujientes y dorados. Escurra en un plato de papel de cocina y manténgalo caliente hasta que esté listo para servir.", "Para el huevo escalfado, caliente una olla de agua a fuego lento a fuego lento (el agua debería estar temblando y debería haber algunas burbujas que se elevan desde el fondo de la olla). Agregue el vinagre, rompa los huevos y cocine por tres minutos. Levante con una espumadera y drene brevemente sobre papel de cocina.", "Para la beurre blanc, agregue los chalotes, el vinagre de vino blanco y el vino blanco a una cacerola y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que solo queden dos cucharadas de líquido en la sartén.", "Agregue una cucharada de agua fría y continúe cocinando a fuego lento hasta que el volumen de líquido restante en la sartén sea de aproximadamente una cucharada.", "Reduzca el fuego a bajo, luego bata gradualmente en la mantequilla, 25 g / 1 oz a la vez, esperando a que la mantequilla se derrita y se incorpore a la mezcla antes de agregar más. Una vez que toda la mantequilla se haya agregado a la reducción, retire la mezcla del fuego y cuele a través de un colador fino en una olla limpia. Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar el cebollino y los tomates. Mantenga caliente hasta que sea necesario.", "Para las flores de calabacín, caliente una freidora a 190 ° C / 375 ° F (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Mezcle la harina, la harina de maíz y la sal en un tazón. Agregue suficiente agua con gas para formar una masa suave (puede que no necesite toda el agua).", "Sumerja las flores de calabacín en la masa y colóquelas en la freidora, teniendo cuidado de no llenar demasiado la freidora (es posible que deba hacerlo por lotes).", "Una vez cocido, retirar cuidadosamente del fuego con una cuchara ranurada y escurrir sobre un plato forrado con papel de cocina. Condimentar con sal y pimienta.", "Para servir, coloque un rösti en el centro de cada plato y cubra con los huevos escalfados. Adorne con las flores de calabacín y beurre blanc."], "url": "www_bbc_co_uk_food_recipes_courgette_rosti_with_32093", "title": "Rösti de calabacín con huevo escalfado, beurre blanc y flores de calabacín fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "250 g / 9oz de arroz Arborio", "150ml / 5fl oz de vino blanco", "1 litro / 1¾ de pinta de pollo o vegetales", "150g / 5½oz de calabacín, cortado en cubitos", "3 cucharadas de mascarpone", "40 g / 1½ oz de parmesano (o un queso duro vegetariano similar), recién rallado", "aceite sin sabor (como el aceite vegetal), para freír", "225g / 8oz de ricotta", "1 limón, ralladura y jugo", "8 flores de calabacín", "1 cucharada de levadura fresca", "pizca de sal", "azúcar pizca", "175ml / 6fl oz de agua tónica", "Harina normal de 200g / 7oz", "Vodka de 25ml / 1fl oz", "1 cucharadita de vinagre de sidra", "10g / ¼ oz de albahaca", "100ml / 3½fl oz de aceite de oliva"], "method": ["Para el risotto de calabacín, derretir 25 g / 1 oz de la mantequilla en una sartén grande hasta espumar. Freír la cebolla y el ajo durante 2-3 minutos, o hasta que se ablanden. Agregue el arroz Arborio y mezcle bien para cubrir la mantequilla.", "Cocine durante 1-2 minutos, o hasta que los granos de arroz comiencen a volverse transparentes, luego agregue el vino y cocine por 3-4 minutos, o hasta que casi todo el líquido se haya evaporado.", "Agregue un cucharón de caldo de pollo a la sartén y mezcle bien. Cocine durante 1-2 minutos, o hasta que se haya absorbido casi todo el caldo, luego agregue otro cucharón de caldo. Repita el proceso hasta que el arroz esté cocido pero aún al dente (mordida de retención).", "Agregue el calabacín durante los últimos 2-3 minutos de cocción y luego mezcle el mascarpone, 25 g / 1 oz del queso parmesano y la mantequilla restante. Sazonar con sal y pimienta negra recién molida.", "Para las flores de calabacín fritas, caliente una sartén profunda llena dos tercios llena con aceite hasta que esté caliente pero no humeando, o caliente una freidora a 190 ° C (375 ° F) (PRECAUCIÓN: el aceite caliente puede ser peligroso. no dejes desatendida.)", "Mezcle la ricota con la ralladura de limón y el jugo, luego mezcle la mezcla con las flores del calabacín y gire el extremo para sellar.", "En un tazón, mezcle la levadura, la sal, el azúcar, el agua tónica, la harina, el vodka y el vinagre. Déjelo a un lado hasta que la mezcla empiece a burbujear, luego sumerja las flores para cubrirlas y fríelas en aceite caliente durante dos minutos. Retirar con una espumadera y escurrir sobre un plato forrado con papel de cocina.", "Para el aceite de albahaca, mezcle la albahaca y el aceite en una licuadora hasta que quede suave, luego pase a través de un colador.", "Para servir, coloque el risotto en tazones para servir y cubra con las flores de calabacín. Rocíe el aceite de albahaca alrededor del risotto y cubra con el parmesano restante."], "url": "www_bbc_co_uk_food_recipes_courgette_risotto_with_70160", "title": "Risotto de calabacín con flores de calabacín fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]