[{"isVegetarian": true, "title": "Nectarinas de crumble al horno", "url": "www_bbc_co_uk_food_recipes_baked_crumble_nectarines_25068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de harina normal", "20 g / oz de mantequilla", "1 cucharadita de azúcar demerara", "1 cucharada colmada de avena", "1 nectarina madura, partida en dos, piedra removida", "2 cucharadas de jugo de naranja", "yogur natural, para servir"], "serves": "Hace 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 450F / Gas 7.", "Frote la harina y la mantequilla juntas en un tazón con la punta de los dedos hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar demerara, luego la avena.", "Coloque las mitades de nectarina en un plato resistente al horno, corte los lados hacia arriba. Vierta el jugo de naranja. Apile la migaja sobre las superficies cortadas de las nectarinas.", "Coloque el plato a prueba de horno en una bandeja de horno. Transfiera al horno y hornee por 12-15 minutos, o hasta que las nectarinas se hayan ablandado y la migaja esté crujiente y dorada.", "Sirva en platos pequeños con yogur natural."]}, {"isVegetarian": false, "title": "Cangrejo al horno 'poblano' con achiote", "url": "www_bbc_co_uk_food_recipes_baked_crab_poblano_with_42581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chile pasilla, sin semillas", "100g / 3½oz de mantequilla salada", "1 cebolla roja grande, cortada en cubitos", "3 dientes de ajo picados", "Pasta de achiote de 20 g / ½ onza, suavizada (disponible en tiendas especializadas y en línea)", "2 cucharadas de jugo de naranja", "2 chiles poblanos, sin semillas y en rodajas finas (o alternativamente 3-4 cucharadas de pimientos jalapeños en vinagre)", "3 tomates grandes, sin semillas y picados", "250 g / 9 oz de carne de cangrejo blanca fresca", "pequeño puñado de cilantro fresco, toscamente picado", "½ cucharadita de sal", "Pan rallado de 30 g / 1 oz panko", "30 g / 1 oz de parmesano (o queso vegetariano vegetariano alternativo), rallado"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Vierta agua hirviendo en un tazón pequeño resistente al calor y remoje el chile pasilla durante 20 minutos. Escurra el agua y pique el chile finamente.", "Precalentar la parrilla a su configuración más alta.", "Derrita la mantequilla en una cacerola y fría la cebolla y el ajo a fuego medio durante 3-4 minutos, hasta que se ablanden.", "Mezcle la pasta de achiote con el jugo de naranja en un tazón pequeño hasta que quede suave, luego revuelva en las cebollas con la pasilla chili, poblanos (o jalapeños en vinagre) y los tomates. Cocine por 4-5 minutos.", "Agregue la carne de cangrejo y el cilantro hasta que se caliente. Sazonar con sal. Divida la mezcla por igual entre 6 moldes.", "Mezcle las migas de pan panko con el queso parmesano y espolvoree sobre los moldes. Grill durante unos minutos hasta que las partes superiores estén crujientes y doradas. Servir inmediatamente."]}, {"isVegetarian": false, "title": "Huevo al horno con jamón y espinacas", "url": "www_bbc_co_uk_food_recipes_baked_egg_with_ham_and_69539", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_egg_with_ham_and_69539_16x9.jpg", "ingredients": ["25g / 1oz rebanada de jamón", "40 g / 1½ oz de espinaca baby", "1 huevo mediano de gallinas camperas", "30g / 1oz rebanada de pan integral o de granero", "2g de margarina baja en grasa (opcional)"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cubra un molde con el jamón. Vierte un poco de agua hirviendo en una cacerola pequeña a fuego lento. Agregue la espinaca y cocine por 2 minutos, o hasta que se marchite. Retirar del fuego, exprimir el exceso de agua y colocar encima del jamón.", "Rompa el huevo encima de la espinaca. Hornee durante 10-15 minutos, o hasta que el huevo se haya solidificado. Mientras tanto, tuesta el pan y extiéndalo con margarina baja en grasa, si lo usa, y sírvalo."]}, {"isVegetarian": true, "title": "Huevos al horno en aguacate con pitta", "url": "www_bbc_co_uk_food_recipes_baked_eggs_in_avocado_52473", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_eggs_in_avocado_52473_16x9.jpg", "ingredients": ["1 aguacate maduro", "2 huevos medianos de granja", "1 tomate, finamente picado", "3 cebollas tiernas, en rodajas finas", "1-2 panes pitta, tostados", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Corte el aguacate por la mitad a lo largo y gírelo para separar las mitades. Cortar un cuchillo en la piedra de aguacate (como un hacha) y sacarlo del aguacate. Si la piedra es pequeña, es posible que necesite una cucharilla para sacar un agujero más grande. Un agujero del tamaño de una cucharada funciona mejor.", "Arruga un poco de papel de aluminio para mantener las mitades de aguacate en su lugar en una bandeja para hornear, o cuñalas en una lata pequeña para que no se muevan.", "Agriete uno de los huevos en un tazón pequeño, luego con cuidado vierta en la mitad del aguacate y sazone con sal y pimienta. Repita con la otra mitad, luego hornee por 12-15 minutos hasta que la clara de huevo esté bien cocida.", "Sirva con el tomate, las cebolletas y la pitta tostada en un lado."]}, {"isVegetarian": true, "title": "Panqueques al horno explorador", "url": "www_bbc_co_uk_food_recipes_baked_explorer_pancakes_79902", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal para engrasar", "1 huevo de gallinas camperas", "2 cucharadas de leche", "2 cebollas de primavera", "pequeño cilantro fresco", "2 cucharadas de dulce de maíz", "8 judías verdes", "Harina normal de 50g / 2oz", "½ cucharadita de polvo de hornear", "pizca de pimienta negra molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Precalentar el horno a 220 ° C / 425 ° F / Gas 7. Cubra una bandeja para hornear con un poco de pergamino para hornear y cúbralo con un poco de aceite.", "Rompa el huevo en una taza, agregue la leche y revuelva hasta que esté bien mezclado.", "Pídale a un adulto que lo ayude a usar unas tijeras para cortar las cebolletas. Corta las raíces y la parte verde oscuro y tíralas. Pica el resto de la cebolla en un tazón. Cortar el cilantro fresco en otra taza con las tijeras. Agregue el cilantro picado al bol para mezclar, luego agregue el maíz dulce.", "Saca un poco de cada extremo de las judías verdes con tus dedos, luego chascalas en pedazos pequeños (aproximadamente 2 cm / 1 in) y agrégalas al tazón. Mezcle todos los ingredientes, luego agregue la mezcla de huevo a las verduras.", "En otro recipiente, mezcle la harina y el polvo de hornear. Agregue la mezcla de harina a la mezcla de verduras y revuelva para formar una mezcla suave, será bastante espesa. Espolvorea en la pimienta.", "Coloque cuatro cucharadas de la mezcla en la bandeja de horno forrada para hacer cuatro panqueques. Añádalos un poco con la parte posterior de la cuchara.", "Hornee en el horno por 10 minutos."]}, {"isVegetarian": true, "title": "Falafel al horno con tzatziki", "url": "www_bbc_co_uk_food_recipes_baked_falafel_with_09084", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharadita de aceite de oliva", "2 cebollas pequeñas (200 g / 7 oz en total), finamente picadas", "2 x 400 g de garbanzos, enjuagados y escurridos", "4 dientes de ajo rallados", "3 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "2 cucharaditas de copos de sal marina", "Hojas de cilantro de 30g / 1oz, más o menos picadas", "30 g / 1 oz de hojas de perejil flatleaf, más o menos picadas", "Harina normal de 40 g / 1½ oz", "pimienta negra recién molida", "aceite de oliva en aerosol", "200ml / 7oz 0% yogur natural bajo en grasa", "Pepino 140 g / 5 oz pieza, rallado", "1 diente de ajo pequeño, finamente rallado", "2 cucharadas de hojas de menta finamente picadas", "Una pizca de sal marina", "pellizco edulcorante granulado"], "serves": "Cumple 18 años", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 230 ° C / 210 ° Ventilador / Gas 8 y alinee una bandeja para hornear con papel para hornear.", "Caliente el aceite de oliva en una sartén pequeña a fuego medio. Agregue las cebollas y cocine durante unos 10 minutos, o hasta que se suavicen y comiencen a dorarse (agregue un chorrito de agua si empiezan a pegarse). Retirar del fuego y dejar enfriar.", "Coloque las cebollas, los garbanzos, el ajo, las especias, la sal, las hierbas picadas, la harina y un poco de pimienta en un procesador de alimentos. Pulse hasta que la mezcla esté bastante suave, deteniéndose cada tanto para raspar los lados con una espátula. Desea conservar algo de textura, pero la pasta debe poder mantenerse unida.", "Divida la mezcla en 18 piezas iguales y forme hamburguesas. Coloque en la bandeja de horno preparada y rocíe las hamburguesas con 10 pulverizaciones de aceite. Cocine en el estante superior del horno durante 20-25 minutos o hasta que se doren.", "Para el tzatziki, coloca el yogurt en un tazón pequeño. Exprima el pepino rallado para eliminar el exceso de líquido, luego agregue al yogur con el ajo, la menta, la sal y el edulcorante. Mezclar bien.", "Baje la configuración del horno a 200C / 180C Fan / Gas 6 y mueva la bandeja de falafel al estante inferior del horno. Hornea por 20-25 minutos más o hasta que esté cocido. Espolvoree con un poco de sal y sirva con el tzatziki."]}, {"isVegetarian": true, "title": "Jengibre al horno parkin con ruibarbo", "url": "www_bbc_co_uk_food_recipes_baked_ginger_parkin_with_37593", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g / 5½oz de azúcar moreno claro y suave", "150 g / 5½ oz de mantequilla ablandada, más extra para engrasar", "Jarabe de oro de 250 g / 9 oz", "75g / 2½ oz de melaza negra", "125g / 4½oz de copos de avena", "Harina de 175g / 6oz de auto crianza", "3 cucharadas de jengibre molido", "1 cucharadita de nuez moscada molida", "1 cucharadita de especias mixtas", "pizca de sal", "2 huevos de gallinas camperas, golpeados", "25 ml / 1 fl oz de leche", "helado de vainilla, para servir", "50g / 1¾oz de mantequilla", "75 g / 2½ oz de azúcar en polvo", "1 naranja, solo ralladura", "4 barras de ruibarbo, cortado en longitudes de 5cm / 2in", "Jarabe dorado de 200g / 7oz", "100 ml / 3½ fl oz de sidra seca", "½ cucharadita de especias mixtas molidas", "½ cucharadita de jengibre molido", "¼ cucharadita de nuez moscada molida"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 140 ° C / 275 ° F / Gas 1 y cocina una lata para pasteles de 30 cm / 12 in x 20 cm / 8 in.", "Para el estacionamiento, coloque el azúcar moreno, la mantequilla, el jarabe y la melaza en una cacerola pequeña y derrita con un poco de calor.", "Ponga la avena, la harina, el jengibre, la nuez moscada, la mezcla de especias y una pizca de sal en un tazón grande, luego agregue los huevos y la leche. Vierta la mezcla derretida de mantequilla y azúcar en el tazón y mezcle con un batidor hasta que se combinen.", "Verter en la lata preparada y hornear durante 1 ¼ horas, o hasta que esté firme en el centro.", "Retire del horno y deje en la lata para que se enfríe antes de girar y cortar en cuadrados. Es mejor guardarlo en una lata durante 2-3 días, ya que se pondrá pegajoso durante todo el proceso.", "Para el ruibarbo, ponga la mantequilla, el azúcar y cinco cucharadas de agua en una sartén grande con la ralladura de naranja y el ruibarbo. Coloque sobre un fuego suave para cocer durante 4-5 minutos, o hasta que esté tierno, luego retírelo del fuego.", "Para el almíbar, combine el jarabe dorado, la sidra y las especias en una cacerola y deje que hierva. Reduzca el fuego y cocine por 3-4 minutos, o hasta que se espese.", "Sirva el parkin en cuadrados con una cucharada de ruibarbo a un lado y el almíbar en la parte superior. Termine con una bola de helado."]}, {"isVegetarian": true, "title": "Jengibre al horno parkin con perry escalfado pera", "url": "www_bbc_co_uk_food_recipes_baked_ginger_parkin_with_52330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina de auto crianza 110g / 4oz", "pizca de sal", "2 cucharadas de jengibre molido", "½ cucharadita de nuez moscada molida", "½ cucharadita de especias mixtas", "75g / 3oz de copos de avena", "Jarabe dorado de 175g / 6oz", "50g / 2 oz de melaza negra", "110 g / 4 oz de mantequilla sin sal, más extra para engrasar", "110g / 4oz de azúcar morena suave", "1 huevo de gallinas camperas, golpeado", "2 cucharaditas de leche entera", "4 peras firmes, peladas, sin corazón y partidas por la mitad", "500ml / 18fl oz perry", "150 g / 5 oz de azúcar en polvo", "2 palitos de canela", "nuez moscada recién rallada", "1 limón, solo cáscara", "helado de vainilla"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el estacionamiento, precaliente el horno a 140 ° C / 275 ° F / Gas 1 y una caja de torta cuadrada de 20 cm / 8 pulgadas.", "Tamice la harina, una pizca de sal, el jengibre, la nuez moscada y las especias mezcladas en un tazón grande. Mezcle los copos de avena.", "Ponga el jarabe, la melaza, la mantequilla y el azúcar en una cacerola pequeña y derrita con un poco de calor - ponga a hervir a fuego lento pero no hierva. Cuando la mantequilla y el azúcar se hayan derretido, vierta en la mezcla de harina y revuelva para combinar.", "Mezcle el huevo batido y la leche para crear una pasta de consistencia suave y casi colada.", "Vierta en la lata con mantequilla y hornee por 50 minutos, o hasta que esté firme en el centro.", "Retire del horno y deje enfriar en la lata durante 5-10 minutos antes de cortar y cortar en cuadrados.", "Para la pera cocida, coloque todos los ingredientes en una cacerola pequeña para que todas las peras estén sumergidas en el líquido.", "Cubra con un pedazo de papel a prueba de grasa cortado en un círculo para ayudar a mantener las peras sumergidas.", "Llevar a ebullición, luego reduzca el fuego a fuego lento y cocine durante 15 minutos hasta que esté tierno - consulte con la punta de un cuchillo para ver si está tierno, si no, vuelva al fuego y cocine por otros cinco minutos y vuelva a controlarlo.", "Retire las peras y reserve. Regrese la sartén al fuego, hierva y reduzca el licor de caza furtiva a la mitad, o hasta que alcance un jarabe liviano.", "Para servir, coloque un cuadrado de parkin en cada plato con una pera al costado, luego cubra el jarabe. Termine con una bola de helado."]}, {"isVegetarian": false, "title": "Merluza al horno con salsa verde y ensalada de hinojo", "url": "www_bbc_co_uk_food_recipes_baked_hake_fennel_apple_56445", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["165g / 6oz de mantequilla sin sal", "Pan rallado de 265 g / 9oz o pan rallado", "2 cucharaditas de sal marina", "glug de aceite de oliva", "4 x 150g / 5½oz-200g / 7oz de filete de merluza, con piel, con espinas", "1 manojo de perejil de flatleaf", "½ manojo de estragón fresco", "4-6 filetes de anchoa", "1 cucharada de alcaparras pequeñas", "2 dientes de ajo, toscamente picados", "1 cucharadita de mostaza Dijon", "1 limón sin cebar, ralladura fina solamente", "2 cucharadas de vinagre de vino tinto", "4-6 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "1 naranja, ralladura fina y jugo", "2 cucharadas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "2 cucharadas de aceite de oliva", "2 bulbos de hinojo, finamente cortados en una mandolina", "2 manzanas verdes, sin corazón, rebanadas y cortadas en cerillas", "1 cucharada de eneldo fresco finamente picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6. Derrite la mantequilla en una sartén a fuego medio-alto hasta que comience a dorarse. Agregue las migas de pan y la sal y cocine hasta que estén doradas. Incline la mezcla en un plato y deje enfriar. Limpie la sartén.", "Caliente el aceite en la sartén a fuego medio-alto. Agregue la merluza y cocine por 2-3 minutos. Gire el pescado por encima y la parte superior con la mezcla de migas de pan. Transfiera al horno y hornee por 4 minutos, o hasta que esté cocido.", "Mientras tanto, para la salsa verde, mezcle el perejil, el estragón, las anchoas, las alcaparras y el ajo en un procesador de alimentos. Agregue la mostaza, la ralladura de limón y el vinagre, luego con el motor en marcha vierta en el aceite hasta que tenga una salsa suave.", "Para la ensalada, haga una vinagreta mezclando el ajo, la ralladura de naranja y el jugo, el vinagre, la mostaza y el aceite en un tazón pequeño. Coloque el hinojo, la manzana y el eneldo en un tazón grande y mezcle con la vinagreta.", "Sirva el pescado con la salsa verde y la ensalada al lado."]}, {"isVegetarian": false, "title": "Albóndigas al horno con verduras escondidas", "url": "www_bbc_co_uk_food_recipes_baked_meatballs_with_17989", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_meatballs_with_17989_16x9.jpg", "ingredients": ["2 cucharadas de aceite de girasol", "1 cebolla, más o menos picada", "1 camote, pelado, cortado en trozos", "2 dientes de ajo, aplastados", "1 x 400 g de tomate picado", "2 cucharadas de puré de tomate", "1 cucharadita de orégano seco", "1 hoja de laurel", "sal y pimienta negra recién molida", "1 rebanada de pan, sin corteza, desmenuzada en trozos pequeños", "4 cucharadas de leche", "1 cebolla pequeña, finamente rallada", "1 zanahoria, pelada, finamente rallada", "1 calabacín, cortado, finamente rallado", "500 g / 1 libra de carne de vaca magra 2 oz", "1 yema de huevo grande de gallinas camperas", "100 g / 3½oz de mozzarella rallada o cheddar", "pimienta negra recién molida"], "serves": "Sirve 5-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Calentar el aceite en una cacerola grande de base pesada, agregar la cebolla y la batata y freír suavemente durante 4-5 minutos, revolviendo regularmente, hasta que la cebolla se haya suavizado y comience a dorarse. Agregue el ajo y fría por 1-2 minutos, revolviendo regularmente.", "Agregue los ingredientes restantes de la salsa y 500 ml / 17 fl oz de agua y revuelva bien para combinar. Condimentar con sal y pimienta. Llevar a ebullición, luego cocine a fuego lento durante 18-20 minutos, revolviendo regularmente, hasta que las verduras estén muy suaves.", "Mientras tanto, pon el pan en un tazón grande. Verter sobre la leche y reservar durante unos minutos hasta que la leche se haya empapado en el pan.", "Agregue la cebolla y la zanahoria. Exprima el exceso de humedad del calabacín y agregue junto con la carne picada y la yema de huevo. Mezcle todos los ingredientes hasta que estén bien combinados. Sazonar bien con pimienta, luego mezclar de nuevo.", "Enróllelas en 24 bolitas, colóquelas en la parte inferior de un plato refractario de 2 litros / 3½ litros para horno. Hornee durante 18-20 minutos, o hasta que estén ligeramente dorados. Drene cualquier líquido que se haya acumulado en el fondo del plato.", "Cuando la salsa esté lista, retire la hoja de laurel. Usando una licuadora de mano, rellene la salsa hasta que quede suave.", "Vierta sobre las albóndigas y espolvoree con la mozzarella. Regrese al horno y cocine durante 20-25 minutos, o hasta que el queso se haya derretido y dorado y la salsa esté burbujeando. Sirva inmediatamente con pasta cocida, arroz o incluso puré de papas."]}, {"isVegetarian": false, "title": "Setas al horno más ligeras", "url": "www_bbc_co_uk_food_recipes_baked_mushrooms_55154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_mushrooms_55154_16x9.jpg", "ingredients": ["1 cucharadita de aceite de oliva", "2 champiñones portobello grandes y planos (150 g / 5½ oz de peso total), limpios, tallos finamente picados", "1 cebolleta, finamente cortada", "1 apio en barra, finamente cortado", "1 medallón de tocino (30 g / 1 oz), aproximadamente picado", "20g / ¾oz de pan rallado fresco", "30 g / 1 oz espinaca bebé", "1 tomate, reducido a la mitad", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Caliente el aceite en una sartén pequeña a fuego medio. Agregue los tallos de champiñones, la cebolla tierna, el apio y el tocino y cocínelos durante 1-2 minutos o hasta que se ablanden. Agregue el pan rallado y las espinacas y sazone.", "Coloque los champiñones con la copa hacia arriba en una bandeja para hornear. Sazone el tomate y colóquelo en la bandeja para hornear.", "Coloque el relleno en los champiñones y hornee durante 10-15 minutos, o hasta que se hayan ablandado. Sirve los champiñones con el tomate."]}, {"isVegetarian": false, "title": "Pappardelle al horno con panceta y porcini", "url": "www_bbc_co_uk_food_recipes_baked_pappardelle_with_21046", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_pappardelle_with_21046_16x9.jpg", "ingredients": ["500ml / 18fl de leche en oz", "20g / ¾oz de hongos porcini secos", "40 g / 1½ oz de mantequilla", "Harina normal de 25g / 1oz", "sal y pimienta negra recién molida", "Pappardelle 100g / 4oz", "50g / 2oz de panceta, cortada en piezas de 2cm / 1in", "4-5 cucharadas de parmesano recién rallado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Caliente la leche en una cacerola, agregue los champiñones porcini, retire del fuego y remoje durante 10 minutos. Cuele a través de un colador suspendido sobre un recipiente, presionando ligeramente los champiñones con la parte posterior del cucharón para extraer toda la leche.", "Caliente la mantequilla en una cacerola limpia, agregue la harina y revuelva a fuego lento durante 2-3 minutos sin colorear el roux.", "Vierta la leche con sabor a porcini de una sola vez y mezcle vigorosamente hasta que quede suave. Cocine la salsa por otros 10 minutos o hasta que la salsa se espese. Sazonar ligeramente con sal y pimienta negra recién molida y reservar.", "Haga hervir una sartén grande de agua salada. Agregue la pasta y cocine hasta que esté al dente. Escurrir en un colador, verter en un recipiente espacioso y mezclar cuidadosamente la salsa, porcini y panceta hasta que estén bien combinados.", "Coloque la pasta en un plato a prueba de horno con mantequilla ligeramente. Alise la superficie y cubra con dos cucharadas de parmesano. Hornee en el horno durante 30-40 minutos, o hasta que burbujee alrededor de los bordes y dorado.", "Sirva el plato caliente en la mesa y tenga queso extra listo."]}, {"isVegetarian": true, "title": "Tarta de ciruela al horno", "url": "www_bbc_co_uk_food_recipes_baked_plum_tart_71302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100 g / 3½ oz de mantequilla, cortada en trozos, más extra para engrasar", "300g / 10½ oz de harina de auto crianza, tamizada", "50 g / 1 oz de azúcar en polvo", "1 naranja, cáscara y 2 cucharaditas de jugo", "150ml / ¼ litro de leche", "Ciruelas 700 g / 1lb 9 oz, apedreado y reducido a la mitad", "50g / 1¾oz de mantequilla", "50g / 1¾oz demerara azúcar", "2 cucharaditas de canela molida"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase ligeramente una lata de rollo suizo de 23x33cm / 9x13in. En un recipiente frote la mantequilla en la harina con las yemas de los dedos. Agregue el azúcar impalpable y la ralladura de naranja. Vierta la leche y mezcle con una cuchilla plana hasta que esté completamente combinada con los ingredientes secos (agregue un poco más de leche si es necesario).", "Incline la mezcla en la lata preparada y alise la superficie.", "Para el relleno, coloque las ciruelas encima, corte el lado hacia arriba, y ponga un pequeño punto de mantequilla encima de cada ciruela.", "En un tazón, mezcle el azúcar demerara y la canela. Espolvorea sobre las ciruelas y termina con un chorrito de jugo de naranja.", "Hornea durante aproximadamente 20 minutos, o hasta que la base esté dorada y las ciruelas estén burbujeantes y jugosas."]}, {"isVegetarian": true, "title": "Melocotones al horno con crema de amaretti y crema", "url": "www_bbc_co_uk_food_recipes_baked_peaches_with_06758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g / 2½oz de avellanas enteras", "Galletas de avena de 40 g / ½ oz", "Galletas amaretti de 40 g / ½ oz", "50 g / 1¾oz de mantequilla sin sal, temperatura ambiente", "25 g / 1 oz de azúcar en polvo", "1 yema de huevo de gallinas camperas", "½ limón, solo jugo", "4 melocotones maduros o nectarinas", "1 cucharadita de ralladura de limón", "4 cucharadas de crema densa", "4 ramitas de menta fresca (opcional)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el relleno, fría las avellanas en una sartén a fuego medio hasta que estén doradas (tenga cuidado de no dejarlas demasiado tiempo sobre el fuego). Picar las avellanas finamente.", "Aplastar los dos tipos de galletas aproximadamente utilizando un rodillo o el fondo de una sartén pequeña y limpia.", "Mezcle las avellanas, los bizcochos, la mantequilla, el azúcar y la yema de huevo en un bol hasta que los ingredientes se mantengan unidos como una pasta áspera.", "Para los melocotones al horno, ponga el jugo de limón en un plato poco profundo. Corta los melocotones por la mitad, quita las piedras y coloca la mitad cortada en el jugo de limón para evitar la decoloración.", "Empaque una cucharada redonda del relleno en cada mitad. Esto debería llenar la cavidad y cubrir la mayor parte de la mitad expuesta. Coloque las mitades en un plato resistente al horno y hornee por 15-20 minutos, dependiendo de la madurez de los melocotones.", "Para servir, coloque los melocotones horneados en platos para servir, y levante una cucharada de crema espesa al lado. Adorne con menta si lo desea."]}, {"isVegetarian": true, "title": "Ñoquis de patata al horno para niños con pesto", "url": "www_bbc_co_uk_food_recipes_baked_potato_gnocchi_10745", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_potato_gnocchi_10745_16x9.jpg", "ingredients": ["30 g / 1 oz de albahaca fresca", "½ diente de ajo, aplastado", "1 cucharada de piñones tostados o nueces (opcional)", "2 cucharadas de queso parmesano rallado", "1-2 cucharadas de aceite de oliva extra virgen", "pimienta negra recién molida", "3-5 papas horneadas grandes (pueden ser sobrantes), partidas a la mitad y papas sacadas (necesitará alrededor de 400 g / 14oz de papa cocida)", "1 huevo de gallinas camperas", "150g / 5½ oz de harina natural (o mezcla de harina sin gluten)", "2 cucharadas de queso rallado fino, como queso parmesano o cheddar", "nuez moscada pizca (opcional)", "hasta 200 g / 7oz de calabaza o zanahorias cocidas, trituradas, pueden sustituirse por algunas de las patatas para hacer gnocchi de naranja", "50 g / 1¾oz de espinaca cocida picada, escurrida (exprima tanta agua como sea posible en un colador) para hacer gnocchi verdes", "1 cucharada de hierbas frescas picadas como albahaca, cebollín o perejil"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Trabajo para niños: para el pesto, lava las hojas de albahaca debajo del grifo y sécalas en una toalla de té o en un ensaladera para ensalada.", "El trabajo de los niños: Agregue las hojas de albahaca a un procesador de alimentos con ajo picado, piñones tostados, parmesano rallado y aceite de oliva. Agregue un toque de pimienta negra y luego mezcle hasta formar un pegamento. Es posible que necesite un poco más de aceite de oliva para que sea suave. (Los adultos deben supervisar esto.) Poner en una jarra y guardar en la nevera hasta que sea necesario.", "Trabajo para adultos: precaliente el horno a 200C / 400F / Gas 6. Pinche las papas para hornear con un tenedor y colóquelas en el horno durante 1-1½ horas. (Los temporizadores del horno son geniales si está en el trabajo: coloque las papas en el horno frío por la mañana y configúrelas para que pasen 90 minutos antes de llegar a su casa). Si usa papas horneadas sobrantes, deberán calentarse. de nuevo o los gnocchi tendrán un sabor pastoso - póngalos en un horno caliente por 10 minutos o cocínelos en el microondas por 30 segundos.", "El trabajo de los niños: si está usando papas recién horneadas, deje que se enfríen lo suficiente para que las manipule con seguridad y luego córtelas a la mitad y los niños pueden sacar la carne en un tazón grande. Agregue cualquier calabaza cocida o zanahoria si está haciendo la opción naranja.", "El trabajo de los niños: machaque la papa cocida con un triturador o un tenedor grande, hasta que esté suave.", "El trabajo de los niños: golpea el huevo suavemente sobre la superficie de trabajo para romperlo; el agrietamiento en una superficie plana creará menos pedazos de concha. Abra el huevo sobre un tazón pequeño. Saca cualquier trozo de concha que haya caído en el recipiente. (Lávese las manos después de tocar los huevos)", "El trabajo de los niños: Agregue el huevo, la harina, el queso rallado, la pimienta negra y la nuez moscada (y las espinacas o las hierbas si está haciendo la versión verde) al tazón y mezcle con las manos hasta que tenga una masa homogénea. Si la masa está pegajosa puedes agregar más harina, se debe sentir como plastilina.", "El trabajo de un niño: divide la masa en cuatro bolas. En una superficie o mesa ligeramente enharinada, enrolle la masa de patata en una salchicha larga y luego, con un cuchillo de mesa, córtela en pedazos de 15 x 2 cm.", "El trabajo de los niños: Presione cada gnocchi con un tenedor para hacer un patrón de surcos (esto los ayuda a cocinar y también ayuda a que la salsa se adhiera a ellos). Repita con el resto de la masa.", "El trabajo de un adulto: Pon a hervir una gran olla de agua con una pizca de sal. Coloque 10 gnocchi a la vez cuidadosamente en el agua y hiérvalos por unos 30 segundos: los gnocchi subirán a la superficie del agua cuando estén cocidos.", "El trabajo de un adulto: retire los ñoquis del agua con una espumadera en un tazón calentado y agregue una cucharadita del pesto. Agregue otro lote de ñoquis a la fuente de agua y repita hasta que todos los gnocchi estén cocidos. Sirve inmediatamente con una ensalada verde."]}, {"isVegetarian": true, "title": "Gnocchi de patata al horno, repollo negro y calabaza", "url": "www_bbc_co_uk_food_recipes_baked_potato_gnocchi_38563", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.25kg / 2lb 12oz para hornear papas (como Catriona o Spunta)", "2 cucharadas de aceite de oliva, más extra para freír", "2 hojas de cavolo nero, tallos retirados, cortados en piezas de 10cm / 4in", "400 g / 14 oz de pumkpin (como Delica), pelado, sin semillas, cortado en dados de 1 cm / ½ pulgadas", "1 huevo de gallinas camperas, golpeado", "100-150 g / 3½-5½ oz de harina común", "Crema doble 530ml / 18fl oz", "75 g / 2½ oz de mantequilla", "cebollín fresco pequeño, finamente picado", "1 limón, solo jugo", "sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6. Hornee las papas durante 45-50 minutos, o hasta que estén suaves.", "Mientras tanto, caliente una cucharada de aceite en una sartén a fuego medio-bajo. Freír el cavolo nero hasta que esté crujiente. Sazonar con un poco de sal y escurrir sobre papel de cocina.", "Calienta otra cucharada de aceite en la misma sartén y freír la calabaza suavemente hasta que esté suave y dorada. Sazonar con un poco de sal y escurrir sobre papel de cocina.", "Saca la carne de papa y pasa a través de un mouli. Vuelva a colocar las pieles en la bandeja para hornear y hornee por otros 12 minutos, o hasta que estén doradas.", "Mientras tanto, coloque una doble capa de película adhesiva sobre su superficie de trabajo. Coloque la carne de papa en el centro, espolvoree un poco de sal y amase brevemente. Agregue un poco del huevo y la harina. Recoja la película adhesiva sobre la masa y amasar muy ligeramente. Enróllalo en forma de salchicha y enfríalo. Retire la película adhesiva y corte piezas de 2.5cm / 1in.", "Mientras tanto, transfiera las pieles de la patata a una sartén mediana y cubra con 500 ml de crema. Llevar a ebullición y cocine a fuego lento suavemente. A medida que las pieles se suavicen, presiónelas con la parte posterior de una cuchara hasta que el sabor se extraiga de ellas. Reduzca la crema en un tercio y pase a través de un colador en un tazón. Agregue la crema restante de 30ml / 1fl oz y sazone bien con sal y un poco de jugo de limón al gusto. Transfiera la crema a una pistola de espuma, agite bien y agregue dos pastillas.", "Para servir, caliente la calabaza y fría los ñoquis en mantequilla por ambos lados durante unos minutos, hasta que estén calientes.", "Coloque los gnocchi en platos para servir y esparza más de la mitad de los cubos de calabaza. Cuidadosamente vierta la espuma en pequeñas cantidades y esparza con los cubos restantes de calabaza, el cavolo nero y el cebollino. Servir inmediatamente."]}, {"isVegetarian": false, "title": "Papa al horno con tocino, taleggio y puerro", "url": "www_bbc_co_uk_food_recipes_baked_potato_skins_with_28036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_potato_skins_with_28036_16x9.jpg", "ingredients": ["4 papas para hornear grandes", "1 cucharada de aceite de oliva", "sal marina", "25g / 1oz de mantequilla", "1 chalote, finamente picado", "1 diente de ajo, finamente cortado", "2 puerros, cortados longitudinalmente y luego en rodajas", "75ml / 2½fl oz de vino blanco", "300ml / 10½ fl oz crema doble", "150g / 5½oz de queso taleggio, aproximadamente picado", "8 rebanadas de tocino rayado", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote las papas con el aceite de oliva, pique todo con un tenedor y colóquelas en una pequeña pila de sal marina en una bandeja para hornear.", "Coloque las papas en el estante superior del horno y hornee hasta que estén tiernas y la piel crujiente, aproximadamente una hora.", "Retire del horno y deje a un lado hasta que esté lo suficientemente frío como para manejarlo.", "Mientras tanto, caliente una sartén hasta que esté medio caliente. Agregue la mantequilla, el chalote y el ajo y cocine por 2-3 minutos, luego agregue los puerros y cocine por otros dos minutos.", "Agregue el vino blanco y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema y cocine por 3-4 minutos, o hasta que espese. Sazonar, al gusto, con sal y pimienta negra.", "Cuando las papas estén lo suficientemente frías, córtelas en cuartos y colóquelas en un plato resistente al horno. Vierta la salsa de puerros en la parte superior y luego agregue las piezas de taleggio.", "Calentar una sartén hasta que esté caliente, agregar el tocino y cocinar hasta que esté dorado y crujiente.", "Cortar el tocino y esparcirlo sobre la parte superior del queso.", "Coloque en el horno y hornee durante 10 minutos, o hasta que estén dorados y burbujeantes."]}, {"isVegetarian": true, "title": "Tarta de queso de frambuesa al horno", "url": "www_bbc_co_uk_food_recipes_baked_raspberry_49297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Galletas digestivas 500g / 1lb", "5 cucharadas de mantequilla sin sal, derretida", "2 cucharadas de azúcar", "pizca de sal", "Queso crema 900g / 2lb, a temperatura ambiente", "160ml / 5⅓fl oz de crema agria", "160ml / 5⅓ fl oz crema doble", "270g / 9½ oz de azúcar", "4 huevos grandes de gallinas camperas", "1 vaina de vainilla, rebanada longitudinalmente y semillas raspadas", "½ jarra de mermelada de frambuesa de buena calidad", "Frambuesas frescas de 340g / 12oz"], "serves": "Sirve 16", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4, con un estante colocado en el tercio inferior del horno.", "Coloque un gran cuadrado de papel de aluminio sobre una superficie plana. Coloque la lata de springform en el medio de la lámina. Doble suavemente la lámina alrededor de los lados de la lata. Tenga cuidado de hacerlo suavemente para que no cree ningún agujero en la lámina (la idea es crear una piel impermeable alrededor de la lata). Presione la lámina alrededor de los bordes de la lata. Coloque un segundo cuadrado grande de papel de aluminio debajo de la lata, y repita. Cubre suavemente la parte superior de las hojas de aluminio alrededor del borde superior de la sartén. Asegúrese de que no entre agua ya que esto arruinaría la corteza.", "En un procesador de alimentos, pulse los bizcochos y la mantequilla derretida hasta que estén finamente molidos y combinados.", "Ponga menos tres cucharadas de migas en el fondo de la lata Springform. Presione suavemente hacia abajo las migas con los dedos, hasta que tenga una capa uniforme en el fondo de la sartén, con solo un ligero aumento a lo largo de los bordes interiores de la lata. Utilice las migas reservadas para rellenar los agujeros o parches irregulares.", "Hornea por 10 minutos. Retire del horno y deje enfriar por aproximadamente 10 minutos.", "Reduzca la temperatura del horno a 160 C / 320 F / Gas 3.", "Para hacer el relleno, agregue el queso crema al tazón de un mezclador independiente. Agregue la crema agria, la crema doble, el azúcar y los huevos. Mezcle a velocidad media durante 5-6 minutos hasta que quede suave, suave y cremoso. Mezcle las semillas de vaina de vainilla. (Recuerde raspar los lados del recipiente de la batidora y raspe los trozos más gruesos de queso crema que se hayan pegado al fondo de la batidora que el accesorio de la paleta no ha incorporado).", "Para el aderezo, en una sartén, caliente suavemente la mermelada de frambuesa con 120 ml / 4 fl oz de agua. Revuelva para formar un líquido suave. Cuele el líquido a través de un tamiz fino para eliminar las semillas. Dejar de lado.", "Para cocinar la tarta de queso, coloque la lata springform envuelta en papel de aluminio en una lata de tostado grande y de lados altos. Llena un hervidor de agua y ponlo a hervir.", "Vierta el relleno de queso crema en la lata Springform sobre la base de la galleta. Alise la parte superior con una espátula o la parte posterior de una cuchara.", "Coloque la lata de asar, con la lata de resorte en su interior, en el horno, en un estante bajo.", "Con cuidado, vierta el agua hirviendo en la lata de asar (tenga cuidado de no quemarse en el horno caliente), hasta que el agua llegue a la mitad del borde de la lata de resorte. (Alternativamente, puede agregar el agua antes de poner la lata en el horno, lo que sea más fácil para usted).", "Hornee por 1 hora y media, o hasta que esté listo.", "Apaga el horno y abre la puerta ligeramente. Deje que la torta de queso en el horno se enfríe muy lentamente durante una hora (este enfriamiento suave ayudará a evitar que la superficie del pastel de queso se agriete).", "Cubra la parte superior de la lata Springform con papel de aluminio, para que no toque realmente la tarta de queso. Enfríe en el refrigerador por un mínimo de cuatro horas o durante la noche.", "Tome el pastel de la nevera y retire la laminilla de alrededor de la lata. Para quitar la tarta de queso de la lata, con cuidado coloca una cuchilla de paleta alrededor del borde de la tarta de queso. Abra el pestillo de resorte, abra con facilidad la lata y levante con cuidado. Puede servir la tarta de queso en la base de la lata, pero, si desea quitarla, deslice con cuidado una cuchilla debajo de la tarta de queso para aflojarla de la lata, luego levante ligeramente un borde de la tarta de queso y deslícela sobre una porción plato.", "Para servir, decorar la parte superior de la tarta de queso con frambuesas frescas cubiertas en el topping."]}, {"isVegetarian": true, "title": "Queso reblochon al horno con beignets de queso azul fritos y verduras de temporada", "url": "www_bbc_co_uk_food_recipes_baked_reblochon_cheese_12280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 queso reblochon entero (en la caja)", "2 cucharadas de aceite de oliva", "50 g / 1¾oz de mantequilla sin sal", "¼ pan de brioche, miga", "2 ramitas de tomillo fresco, hojas retiradas", "50g / 1¾oz de mantequilla", "Harina normal de 75 g / 2½ oz", "2 huevos medianos de granja", "75 g / 2½ oz de queso Stilton", "sal y pimienta negra recién molida", "½ coliflor, cortada en florecillas", "1 manojo de zanahorias", "150g / 5½oz de judías verdes, recortadas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el queso reblochon horneado, precaliente el horno a 180C / 350F / Gas 4.", "Deje el queso en las cajas y puntúe alrededor de la parte superior unos 5 mm / ¼ in y corte la capa superior de la piel.", "Rocíe el aceite sobre los quesos y colóquelo en el horno durante 15-20 minutos, o hasta que esté medio liviano.", "Mientras tanto, caliente una sartén grande y, una vez caliente, agregue la mantequilla. Agregue las migas de pan y el tomillo a la sartén y cocínelos hasta que estén dorados y tostados. Cubra el queso con las migas de pan.", "Para los beignets de queso azul fritos y las verduras de temporada, precaliente una freidora a 190 ° C / 375 ° F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Coloque 125 ml / 4 fl oz de agua y la mantequilla en una olla y deje que hierva durante un minuto.", "Retire la sartén del fuego y agregue la harina, batiendo bien hasta que la mezcla esté suave y se desprenda de los lados de la sartén.", "Regrese al fuego por uno o dos minutos para cocinar la harina.", "Retire del fuego nuevamente y agregue los huevos, uno a la vez, batiendo bien entre la adición de cada huevo.", "Agregue Stilton desmenuzado y mezcle bien. Sazonar con sal y pimienta negra recién molida.", "Ponga cucharaditas de la mezcla en la freidora y fríe por 2-3 minutos, o hasta que estén doradas y crujientes (puede necesitar hacer esto por tandas).", "Retire los beignets del aceite con una espumadera y déjelos a un costado para drenar en un plato forrado con papel de cocina. Sazonar con un poco de sal.", "Mientras tanto, caliente una olla grande de agua hirviendo y cocine las verduras a su gusto. Desagüe.", "Para servir, coloque los quesos horneados en un plato grande y coloque los beignets y las verduras al lado."]}, {"isVegetarian": true, "title": "Tarta de queso al horno con moras, arándanos e higos", "url": "www_bbc_co_uk_food_recipes_baked_ricotta_and_cream_48552", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_ricotta_and_cream_48552_16x9.jpg", "ingredients": ["50 g / 1¾oz de mantequilla sin sal, derretida", "200 g / 7 oz de galletas de jengibre (alrededor de 20 galletas)", "450 g / 1 libra de queso crema con toda su grasa", "250g / 9oz de ricotta", "Crema doble de 150 g / 5½ oz", "3 huevos medianos de granja", "125 g / 4½ oz de azúcar en polvo", "2½ cucharadas de harina de maíz", "1 vaina de vainilla, semillas raspadas", "125 g / 4½ oz de arándanos frescos", "125 g / 4½ oz de moras frescas", "2 higos, cada uno cortado en 6 cuñas de tamaño uniforme", "2 cucharaditas de azúcar glas, cernida", "puñado de hojas de menta fresca (opcional)"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3 (ventilador de 150 ° C).", "Para hacer la base, derrita la mantequilla en una cacerola mediana a fuego lento (o en un recipiente en el microondas). Alinee la base de una lata para pasteles con forma de resorte de 23 cm / 9 pulg con papel de hornear, cepillando un poco de la mantequilla derretida en la base para ayudar a que el papel se adhiera. Rompe las galletas de gingernut en un procesador de alimentos para dar migas finas. Mezcle bien en la mantequilla derretida y luego incline en el fondo de la lata preparada. Presione bien la mezcla en la parte inferior para que quede apretada y nivelada. Coloque en el refrigerador para establecer durante 20 minutos más o menos mientras se completa con el relleno.", "Para el relleno, ponga el queso crema, la ricota, la crema, los huevos, el azúcar, la harina de maíz y las semillas de vainilla en un tazón grande y bata como locos durante unos minutos hasta que todo esté combinado y suave. Un mezclador eléctrico equipado con el accesorio batidor lo hará más fácil que a mano. Una vez que la base de la galleta esté colocada, retire la lata del refrigerador y vierta esta mezcla encima.", "Siéntate en una bandeja para hornear y entra al horno por 40-45 minutos. La tarta de queso debería estar acabada con un pequeño bamboleo. Cuando llegue a esta etapa, apague el horno y deje que se enfríe durante aproximadamente una hora. Esto (generalmente) impide que la tarta de queso se agriete. También evite mover la tarta de queso en esta etapa para ayudar a prevenir el agrietamiento. Sin embargo, no se preocupe si se agrieta, ya que todavía tendrá un delicioso sabor y estará muy bien decorado.", "Una vez que ha tenido una hora de enfriamiento, retire la tarta de queso del horno. La tarta de queso puede estar aún un poco caliente, por lo que puedes comerla así o esperar y comerla cuando esté completamente fría. Coloque las bayas y los higos en la parte superior, espolvoree con azúcar glas y espolvoree sobre las hojas de menta si las usa, y sirva. El pastel de queso se mantendrá durante un par de días, cubierto en la nevera."]}]