[{"isVegetarian": false, "title": "Mussels marinière", "url": "www_bbc_co_uk_food_recipes_mussels_marinere_00294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz fresh mussels ", "2 tbsp olive oil", "1 shallot, finely chopped ", "2 garlic cloves, chopped ", "150ml/5fl oz white wine", "2 sprigs thyme", "150ml/5fl oz double cream", "small bunch flat leaf parsley, chopped ", "crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by thoroughly scrubbing them under plenty of running water, pulling away and discarding the 'beards', the seaweed-like stringy threads. Discard any broken mussels, and any mussels that don't close tightly when you tap them. ", "Heat the olive oil in a heavy pan with a tight-fitting lid. Add the shallot and garlic and cook over a medium heat until softened, but not coloured.", "Add the wine and turn up to a high heat. As the wine starts to boil, add the cleaned mussels and thyme to the pan. Turn the heat down to low. ", "Put the lid on the pan and allow the mussels to steam. Cook for about 4-5 minutes, lifting the lid from time to time to check - you will know they are cooked when the shells have opened. Discard any mussels that remain closed.", "Add the double cream and cook for a further minute.", "Scatter with the chopped parsley and serve in deep bowls."]}, {"isVegetarian": false, "title": "Mussels ‘Rockefeller’ style", "url": "www_bbc_co_uk_food_recipes_mussels_rockefeller_21768", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_rockefeller_21768_16x9.jpg", "ingredients": ["30g/1oz butter", "2 small shallots, finely chopped", "1 celery stick, peeled and chopped", "1kg/2lb 4oz mussels, cleaned and de-bearded", "30ml/1fl oz pastis", "200ml/7fl oz dry sherry", "200g/7oz spinach ", "10g/¼oz fresh parsley leaves, chopped", "2 sprigs fresh tarragon, leaves only", "2-3 drops Tabasco"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and blanch the spinach for 30 seconds. Drain the spinach, rinse it under cold water, squeeze and pat dry.", "Melt the butter in a large saucepan and gently fry the shallots and celery until softened. Tip in the mussels, increase the heat until the sound of sizzling emanates from beneath, then add the pastis and sherry. Shake the saucepan once steam appears, place back onto the heat, and continue cooking for a further 1-2 minutes. ", "Once all the shells are fully open, immediately strain into a colander suspended over a bowl. Shake the mussels to extract the juices and set aside. ", "Pour the juices into a blender along with the reserved spinach and other remaining ‘Rockefeller’ ingredients. Blend until smooth and return the green sauce to the mussel cooking pot. ", "Remove the empty half shell from all the mussels and add the full halves to the green sauce. Briefly reheat and serve."]}, {"isVegetarian": false, "title": "Mussels with bacon and pastis", "url": "www_bbc_co_uk_food_recipes_mussels_with_bacon_and_43156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter, cubed", "2 celery sticks, chopped", "1 onion, chopped ", "6 slices smoked bacon, cut into lardons", "1 garlic clove, chopped", "1 tsp curry powder", "1 pinch of whole grated nutmeg", "75ml/2½fl oz pastis", "500g/1lb 2oz large mussels", "200ml/7fl oz double cream", "1 lemon, juice only", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives ", "crusty bread, to serve "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels. Remove any beards and rinse under plenty of cold, running water. Discard any open ones that won't close when lightly squeezed.", "In a large, lidded saucepan, heat the butter and gently fry the chopped celery, onion and lardons. Stir in the garlic and spices. Stir and cook for a few minutes then add the pastis. ", "Add the mussels and put the lid on the pan. Steam the mussels until they open taking care not to overcook. Remove the mussels with a slotted spoon and put them into a serving bowl. Discard any mussels that have not opened.", "Turn up the heat and cook to reduce the sauce to a third of the volume before adding the cream. Bring to boil then add lemon juice and pour over mussels. ", "To serve, spoon the mussels into large serving bowl and scatter over the fresh herbs."]}, {"isVegetarian": false, "title": "Mussels with Bayonne ham and shallots", "url": "www_bbc_co_uk_food_recipes_mussels_with_bayonne_ham_91522", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_with_bayonne_ham_91522_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz mussels", "100ml/3½fl oz dry white wine", "50g/1¾oz butter ", "1 shallot, finely chopped", "75g/2½oz Bayonne or prosciutto ham, finely chopped", "1 garlic clove, grated or chopped very finely", "1 handful mixed flatleaf parsley, tarragon, chervil and chives, chopped", "freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean and debeard the mussels. If any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them. ", "Add 2 tablespoons wine to a large lidded saucepan. Add the mussels, cover with the lid and cook over a high heat for 3-4 minutes, shaking the pan periodically until they have opened (discard any that do not open). Remove from the heat and strain into a colander over a large bowl. Reserve the cooking liquor and keep the mussels warm. ", "In the same pan, melt the butter and gently cook the shallot, ham and garlic for 4-5 minutes, until softened but not browned. Add the mussel cooking liquor and remaining wine. Bring to a boil and cook until the volume of liquid has reduced by half. Add the mussels and herbs and mix well, then season with black pepper. ", "Serve in warmed bowls with some crusty bread. "]}, {"isVegetarian": false, "title": "Mussels with sparkling wine", "url": "www_bbc_co_uk_food_recipes_mussels_with_sparkling_09137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.75kg/4lb (4 pints) mussels", "2 shallots, chopped", "1 fennel bulb, finely sliced", "300ml/½ pint English sparkling dry white wine", "2 tbsp chopped fresh parsley", "150ml/1/4 pint double cream", "½ lemon, juice only", "25g/1oz unsalted butter", "1 tbsp fennel leaves (or dill), chopped ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels thoroughly, removing the beards, and discard any that are cracked, or remain open after you tap them sharply against the edge of the sink. Transfer to a large, heavy-bottomed pan with lid.", "Add the shallots, fennel, wine and half the parsley. Cover with a lid and cook over a fierce heat for 6-7 minutes, or until all of the mussels have opened.", "Lift the mussels out into a colander set over a bowl. Carefully strain the cooking liquor through a clean tea-towel into a separate clean bowl and allow to stand for five minutes so that any sand sinks to the bottom. Discard the vegetables.", "Pour the liquor into a clean pan, taking care not to disturb any sand at the bottom. Add any liquor from the bowl below the mussels. Add the cream and lemon juice, and boil to reduce by half. Add the butter and remaining parsley, and adjust the seasoning.", "Meanwhile, discard any mussels that remain closed. Divide them between four soup plates, pour the sauce over, sprinkle with fennel leaves (or dill) and serve immediately."]}, {"isVegetarian": false, "title": "Mussels and jamon with sherry", "url": "www_bbc_co_uk_food_recipes_musselsandjamonwiths_71469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb mussels", "2 tbsp olive oil", "half onion, finely chopped", "2 thick or 5 thin slices jamon or prosciutto, diced", "100ml/3½fl oz dry white wine", "3 tbsp sherry"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Scrub the mussels well, then yank out the little beards and discard.", "Heat the oil in a heavy frying pan and cook the onion for five minutes until soft.", "Add the ham, white wine and sherry and bring to the boil. Add the mussels and clamp the lid on tightly.", "Allow to boil for one minute, then give the pan a big shake, remove the lid, and use a pair of tongs to remove the mussels as they open. When all the mussels have opened ( discard any which do not), return them to the pan and toss well in the sauce  and transfer to a large platter. ", "Serve warm or at room temperature."]}, {"isVegetarian": false, "title": "Mussels in a saffron white wine sauce", "url": "www_bbc_co_uk_food_recipes_musselsinasaffronwhi_86539", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "40g/1½oz shallots, chopped ", "pinch of saffron strands ", "1 bay leaf", "1 sprig fresh thyme ", "1 sprig fresh tarragon", "200ml/7fl oz white wine", "100ml/3½fl oz double or whipping cream ", "200ml/7fl oz fish stock ", "1.5kg/3lb 5oz mussels, washed and cleaned - discard any that don't close when tapped ", "salt and freshly ground black pepper, to taste"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan, melt the butter. Add the shallots and cook until they are soft and translucent. Add the saffron, bay leaf, thyme, tarragon and white wine and bring to the boil.", "Once the mixture has reduced by half, add the cream and fish stock to the pan and bring back to the boil. Add the mussels and place a lid over the pan. ", "Once the mixture has returned to the boil and the mussels have opened, strain the mussels in a colander over a pan to collect the sauce. Discard any mussels that have not opened.", "Gently heat the sauce until it has reduced further and season with salt and freshly ground black pepper.", "To serve, place the mussels into a bowl and pour the reduced sauce over them."]}, {"isVegetarian": false, "title": "Mussels marinara", "url": "www_bbc_co_uk_food_recipes_musselsmarinara_86888", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 garlic clove, crushed", "½ red chilli, seeds removed and finely chopped", "1 large vine tomato, chopped", "6tbsp dry white wine", "salt and freshly ground black pepper", "110g/4oz mussels, beards removed (discard any opened mussels that don't close when tapped firmly)", "1 lemon, cut into 4 wedges"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and fry the garlic, chilli and tomato for two minutes. Add the wine and simmer until the sauce has reduced by half.  Season with salt and freshly ground black pepper.", "Add the mussels and cover with a lid.  Simmer in the liquid for 3-4 minutes until the shells have opened. Discard any mussels with shells that have not opened. Squeeze over the juice from one lemon wedge.", "Lift out the mussels, arrange in a shallow bowl and spoon over the sauce. Garnish with the remaining lemon wedges to serve."]}, {"isVegetarian": false, "title": "Mussel skewers on French bread barrel", "url": "www_bbc_co_uk_food_recipes_musselskewersonfrenc_10300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb mussels, cleaned - scrubbed with beards removed", "2 shallots, finely chopped", "2 cloves garlic, finely chopped", "1 bunch basil, picked", "200ml/7fl oz dry white wine", "50g/2oz butter", "1 large or 2 small part baked baguettes", "2 plum tomatoes, skinned, de-seeded and diced", "30 wafer thin slices pancetta (approx 175g/6oz), cut in half ", "175g/6oz mozzarella, grated", "black pepper to season"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a large saucepan.", "Add the chopped garlic and shallots and saute (without colour) for one minute.", "Add the drained mussels (discard any that are already open), half the basil, white wine and freshly milled black pepper.", "Bring to the boil over a high heat and then immediately cover and cook for 4 minutes.", "Remove mussels from pan with a slotted spoon and strain off the liquid through a fine sieve into a saucepan.", "Simmer this liquid for 10 minutes over a low heat.", "After 10 minutes add the rest of the basil, chopped and the tomatoes, leave to infuse over a low heat for a further 8 minutes, keep warm.", "In the meantime remove mussels from their shells, discard any that haven t opened.", "Place each mussel on a piece of the sliced pancetta and roll up. Skewer horizontally onto wooden skewer and repeat until you have 10 mussels on each skewer.", "Place the skewered mussels on a baking sheet.", "Take the baguettes and cut into 6 x 8cm/3¼in barrels. Carefully remove the centres from each leaving ½cm/¼in perimeter around the sides and base. Place on a baking tray and bake as directed on packet, reducing cooking time by 3 minutes.", "Place mussel skewers under a preheated grill and cook for 2 minutes on either side under a medium heat.", "Sprinkle with mozzarella and flash under the grill for a further minute or until the cheese begins to melt.", "Remove bread from the oven and place in deep serving dishes.", "Pour mussel juice into the centre of the up-right barrel of bread and place skewer of mussels across the top. Serve at once."]}, {"isVegetarian": false, "title": "Mussels with coconut crumb crust", "url": "www_bbc_co_uk_food_recipes_musselswithcoconutcr_88894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz brioche crumbs (you can make your own by blending a brioche in a food processor)", "100g/3½oz desiccated coconut, toasted in a dry frying pan", "1 tbsp chopped fresh coriander", "1 tbsp softened butter", "1 red chilli, finely chopped", "1 clove garlic, crushed to a paste with a pinch of salt", "salt and freshly ground black pepper", "12 green lip mussels, ready-cooked, bottom half of the shell on ", "1 pink grapefruit, peeled, segmented", "1 lime, juice only", "1 red chilli, finely chopped", "12 lychees from a can, drained, chopped", "splash Tabasco sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Place the brioche breadcrumbs, toasted coconut, coriander, butter, chilli, garlic and salt and freshly ground black pepper into a bowl and mix together well.", "Place the mussels, open-side up, onto a baking tray. Place a spoonful of the breadcrumb mixture into each mussel to cover the mussel flesh completely. Place under the grill and cook for 5-6 minutes, or until the topping is golden-brown. ", "For the salsa, place the grapefruit segments, lime juice, chilli, chopped lychees and Tabasco into a bowl and mix well. ", "To serve, place three mussels onto each plate and serve a dollop of salsa alongside."]}, {"isVegetarian": false, "title": "Mussels with dry coconut", "url": "www_bbc_co_uk_food_recipes_musselswithdrycoconu_86738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "1 small onion, finely chopped", "2-4 green chillies, whole", "thumb-sized piece fresh ginger, peeled and pounded into a paste in a pestle and mortar", "4 garlic cloves, peeled and pounded into a paste in a pestle and mortar ", "salt, to taste", "½tsp ground turmeric", "1 tbsp garam masala", "3 tomatoes, chopped into large cubes", "1kg/2¼lb mussels, scrubbed and de-bearded", "60g/2oz desiccated coconut", "handful fresh coriander leaves and stalks, chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a medium non-stick pan and fry the onion until golden brown. ", "Add the chillies, ginger and garlic pastes, salt, turmeric, garam masala and tomatoes and cook until the tomatoes have softened and start to break down. ", "Meanwhile, cook the mussels in a large pot of boiling water for about three minutes, until they have opened. Remove them with a slotted spoon and set aside. Reserve the water.", "Add the coconut, coriander and a splash of the cooking water to the spices and tomatoes and stir. The spice mixture should be thick enough to coat the mussels and enter the shells.", "Remove some of the mussels from their shells and leave others in their shells, for a dramatic and appetising effect. Add the mussels to the spice mixture and stir thoroughly. Serve with basmati rice."]}, {"isVegetarian": false, "title": "Mussels with fried artichokes", "url": "www_bbc_co_uk_food_recipes_musselswithfriedarti_84375", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz cooked artichokes from a jar, drained", "50g/1¾oz flour", "500ml/18fl oz vegetable oil", "50g/1¾oz cooked mussels, shells removed", "1 tbsp olive oil", "1 clove garlic", "½tsp white wine vinegar ", "½tsp white wine ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the artichokes, toss the artichokes in the flour and shake off any excess.", "Heat the oil in a heavy-bottomed pan (CAUTION: hot oil can be dangerous, do not leave unattended). When hot add the artichokes and fry until crisp and golden. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To make the vinaigrette, place all the vinaigrette ingredients into a bowl and mix together.", "To serve, arrange the artichokes and cooked mussels on a plate, season, and spoon over the vinaigrette."]}, {"isVegetarian": false, "title": "Mussels with parsley and chilli risotto", "url": "www_bbc_co_uk_food_recipes_musselswithparsleyan_88585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, chopped", "½ red chilli, chopped", "100g/3½oz long grain rice", "85ml/3fl oz white wine", "200ml/7fl oz hot vegetable stock", "85g/3oz cherry tomatoes, halved", "2 tbsp chopped fresh parsley", "25g/1oz butter", "salt and freshly ground black pepper", "1 tbsp olive oil", "100g/3½oz mussels, cleaned - discard any which do not close when tapped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the risotto, heat the oil in a large heavy-bottomed saucepan, add the onion and fry over a low heat until softened but not coloured.", "Add the garlic and chilli and fry for one minute.", "Add the rice and stir over a gentle heat until the rice grains turn translucent.", "Add the wine, turn up the heat and boil until almost all of the liquid has disappeared. Add the vegetable stock, one ladleful at a time, and stir constantly until all the stock has been absorbed and the rice is tender.", "Stir in the tomatoes, parsley and butter and season, to taste, with salt and freshly ground black pepper. Take off the heat, cover with a lid and leave for 3-4 minutes.", "For the mussels, heat the olive oil in a large saucepan until very hot, add the mussels, cover with a lid and shake the pan over the heat until the mussel shells have opened. Discard any that are cracked or have not opened.", "To serve, spoon the risotto into a serving bowl, top with the mussels and serve."]}, {"isVegetarian": false, "title": "Mussels with lychee and coconut", "url": "www_bbc_co_uk_food_recipes_musselswithlycheeand_87249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 shallots, finely sliced ", "1 stalk lemongrass, lightly crushed ", "1 bird's-eye chilli, finely chopped ", "100ml/3½fl oz white wine", "450g/1lb mussels, washed and de-bearded (discard any mussels that remain open after washing)", "440ml/15½fl oz coconut milk", "150g/5oz lychees (fresh or canned; peel them if using fresh)", "salt and freshly ground black pepper", "1 tbsp chopped fresh coriander, to serve", "lime wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large non-stick pan with a lid. Add the shallots, lemongrass stalk and chilli and fry until softened but not coloured.", "Add the white wine to the pan and bring to a boil.", "Add the mussels, coconut milk and lychees. Cover the pan with a lid and give it a good shake.", "After 2-3 minutes, when the mussels have opened, season well with salt and freshly ground black pepper. Discard any mussels that haven't opened.", "To serve, spoon the mussels into bowls and garnish with the coriander sprinkled over the top and the lime wedges alongside."]}, {"isVegetarian": false, "title": "Mussels with pesto pasta", "url": "www_bbc_co_uk_food_recipes_musselswithpestopast_81621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "25g/1oz fresh basil leaves", "2 garlic cloves", "1 tbsp sesame seeds", "salt and freshly ground black pepper ", "150g/5½oz pasta of your choice, cooked according to packet instructions", "1 tbsp olive oil", "1 shallot, sliced", "50ml/2fl oz white wine", "200g/7oz fresh mussels in their shells, beards removed", "50g/1¾oz blue cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "To make the pesto pasta, place the oil, fresh basil, garlic cloves and sesame seeds into food processor. Season, to taste, with salt and freshly ground black pepper and blend to a smooth consistency.", "Place the pesto into a large bowl, add the cooked pasta and toss together to coat.", "For the mussels, heat the olive oil in a lidded saucepan over a medium heat. Add the garlic and shallots and sauté for two minutes, until softened.", "Add the mussels and white wine, stir well and place the lid on. Allow the mussels to steam for 3-4 minutes, then remove the lid and check that all the mussels are cooked and have opened. Discard any that have not opened.", "Select 10 large mussels, open them up and discard the empty half of the shell. Place the mussels on a baking tray, crumble over the blue cheese, season with salt and freshly ground black pepper and place under the grill for two minutes, until the cheese has melted.", "To serve, place the pasta in the centre of a warm plate and arrange the mussels around in their shells."]}, {"isVegetarian": false, "title": "Mussels with spaghetti", "url": "www_bbc_co_uk_food_recipes_musselswithspaghetti_85894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "400g/14oz mussels, cleaned (discard any that don't close when lightly tapped)", "½ shallot, finely chopped", "2 garlic cloves, finely chopped", "150ml/¼ pint white wine", "½ lemon, juice only", "2 tbsp chopped fresh dill ", "2 tbsp chopped fresh parsley ", "200g/7oz spaghetti, cooked according to packet instructions and drizzled with olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan until smoking hot, add the mussels and cook, shaking the pan frequently, until all the shells are open. Discard any that do not open.", "Add the shallot and garlic, turn down the heat and cook gently for 1-2 minutes.", "Add the wine and simmer for one minute, then add the lemon juice and herbs and cook for a further minute.", "Add the cooked spaghetti to the pan and stir well to coat.", "To serve, place into serving bowls."]}, {"isVegetarian": false, "title": "Mustard and lemon sausages with carrot mash", "url": "www_bbc_co_uk_food_recipes_mustard_and_lemon_49577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_and_lemon_49577_16x9.jpg", "ingredients": ["8 plump pork sausages", "2 tbsp grain mustard", "a tbsp smooth Dijon mustard", "3  heaped tbsp runny honey", "2 tbsp lemon juice", "750g/1lb 10oz carrots", "a large knob of butter "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Set the oven at  200C/400F/Gas 6. ", "Put the sausages in a roasting tin large enough to take them in a single layer. If they overlap, they won’t cook properly. ", "In a bowl mix the mustards, honey and lemon juice. Stir well and pour over all the sausages. Bake for 25-30 minutes, rolling the sausages over in the honey and mustard mixture once or twice during cooking, so that they eventually take on a sticky, glossy coat. ", "Meanwhile, to make the mash, trim and scrub the carrots, slice into chunks and pile into a steamer basket or metal colander balanced over a pan of simmering water. Steam, covered, for 15-20 minutes or until just tender.  ", "Remove the carrots from the steamer and mash with a generous knob of butter. Divide the mash between 4 plates and pop the sausages on top."]}, {"isVegetarian": false, "title": "How to cook mussels", "url": "www_bbc_co_uk_food_recipes_musselswithwineandpa_90229", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/musselswithwineandpa_90229_16x9.jpg", "ingredients": ["1kg/2lb 3oz mussels", "drizzle olive oil", "1 shallot, finely chopped", "2 garlic cloves, finely chopped", "75ml/2½fl oz dry white wine", "handful of fresh parsley, chopped", "crusty bread, to serve"], "serves": "Serves 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Clean and debeard the mussels. If any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them.", "Heat the olive oil in a wide, heavy-based pan. Add the shallots and garlic and cook until softened, but not browned.", "Add the wine to the pan and boil for a minute to burn off the alcohol.", "Add the mussels to the pan. Add most of the chopped parsley, cover the pan with a lid and cook the mussels for about 3-4 minutes, giving the pan a shake from time to time. The mussels are cooked when they've opened up. Be sure to discard any that don't open.", "Sprinkle in the remaining parsley, then spoon the mussels into a serving bowl. Pour over the cooking liquid and serve with some crusty bread."]}, {"isVegetarian": false, "title": "Roasted ham hocks with celeriac mash, celeriac and apple salad and a raisin and pasilla chutney", "url": "www_bbc_co_uk_food_recipes_mustard_and_muscovado_29561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 250g smoked ham hocks", "1 onion, peeled", "8 cloves", "1 x 440ml can dry cider ", "½ tsp black peppercorns", "100g/3½oz dark brown muscovado sugar", "pinch ground cloves ", "75g/2½oz English mustard", "30g/1oz pasilla chillies", "200g/7oz muscovado sugar", "50g/1¾oz tamarind pulp", "100ml/3½fl oz red wine vinegar", "4 tbsp port or brandy", "1 star anise", "4 cloves", "200g/7oz raisins", "500g/1lb 2oz floury potatoes, cut into small chunks", "1kg/2lb 4oz celeriac, cut into chunks approximately twice the size of the potato", "50g/1¾oz butter", "100g/3½oz crème fraîche", "salt and freshly ground black pepper", "3 tbsp red wine vinegar", "½ lemon, juice only", "75g/2½oz natural yoghurt", "35g/1¼oz mayonnaise", "¼ tsp wholegrain mustard", "¼ tsp English mustard", "½ celeriac (about 350g/12oz), very finely sliced", "2 Granny Smith apples, very finely sliced", "small bunch flatleaf parsley, roughly chopped"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the ham hocks, soak the ham hocks overnight in a large saucepan of cold water. Drain the next day to remove any excess salt (this applies with an unsmoked ham too), keeping the ham in the pan. ", "Stud the onion with the cloves, then add to the pan with the cider and peppercorns. Add enough cold water to cover the ham, cover with a lid and bring to the boil. Once boiling, reduce the heat to a simmer and cook for 2 hours until the ham is tender to the point of a knife, topping up with boiling water to cover the ham again if necessary.", "Meanwhile, to make the chutney. Heat a frying pan over a medium heat. Once hot, add the chillies, stirring continuously for a few minutes until they smell fragrant and delicious. Try not to burn them or they will turn from delicious to bitter! Transfer to a bowl and cover with boiling water from the kettle (at least 100ml/3½fl oz).  ", "Add the sugar to a small saucepan and melt with the tamarind pulp. Stir in the vinegar, brandy, spices and raisins and let them simmer very gently over a very low heat.  ", "Meanwhile check the chillies. When soft, use a stick blender to blend them to a smooth paste. Add the chillies to the rest of the chutney and simmer gently over a low heat for 10 minutes, seasoning generously with salt.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Lift the hocks out of the pan onto a wire rack sat in a roasting tin (reserve the cooking liquor). When cool enough to handle, remove the skin of the ham (not the fat) using a sharp knife. Discard the skin (or save it to make crackling) and lightly score the fat into diamonds. Mix together the muscovado sugar, ground cloves and mustard then rub it over the fat of the ham. ", "Pour 200ml/7fl oz of the ham cooking liquor into the roasting tin (so the meat doesn’t dry out as it roasts), and roast the hocks on a rack for 35 minutes until the fat is golden and glazed. Remove from the oven and allow to rest.", "Meanwhile, for the celeriac mash, steam or boil the potato and celeriac together for about 15 minutes, until tender. Then, using plenty of elbow grease, roughly mash everything together, stirring in the butter and crème fraîche as you go. If you prefer super-smooth mash, use an electric whisk. Season to taste with salt and pepper.", "For the salad, mix all the ingredients except the celeriac, apple and parsley, together in the bottom of a serving dish. Toss the celeriac and apple in the dressing with the parsley. ", "To serve, pull the ham off the bone in large chunks and serve with the celeriac mash, salad and chutney."]}, {"isVegetarian": false, "title": "Mustard, bacon and caramelised onion scones", "url": "www_bbc_co_uk_food_recipes_mustard_bacon_and_64379", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_bacon_and_64379_16x9.jpg", "ingredients": ["2 rashers streaky bacon, rind removed", "450g/1lb self-raising flour, plus extra for dusting", "generous pinch salt", "pinch baking powder", "1 tsp English mustard powder", "110g/4¼oz unsalted butter, diced", "1 free-range egg, lightly beaten", "50ml/2fl oz double cream", "2 tbsp ready-made onion marmalade, plus extra to serve", "200ml/7fl oz full-fat milk"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Preheat the grill to a medium-high setting. When the grill is hot, grill the bacon for 2-3 minutes on each side, or until crisp and golden-brown. Set aside on a plate lined with kitchen paper. When cool enough to handle, crumble into small pieces. Set aside until needed.", "Sift the flour, salt and baking powder into a large mixing bowl. Stir in the mustard powder.", "Add the diced butter to the bowl, then rub the butter into the flour mixture using your fingertips until the mixture resembles fine breadcrumbs.", "Make a well in the centre of the dry mixture and add the beaten egg and cream, gradually drawing the dry mixture into the wet mixture using a wooden spoon. ", "Stir in the onion marmalade and reserved bacon pieces, then gradually stir in enough milk to make the mixture come together as a soft dough. (The mixture should not be sticky.)", "Dust a clean work surface with a little flour. Turn the dough out onto the work surface and roll it out to a thickness of 2.5cm/1in. Stamp out twelve 5cm/2in rounds from the dough using a cookie cutter, placing them onto a non-stick baking sheet as you go. ", "Bake the scones in the oven for 15-20 minutes, or until risen and golden-brown. Set aside to cool on a wire rack for at least 10 minutes before serving."]}, {"isVegetarian": true, "title": "Mustard and butterbean pâté with garlic toasts", "url": "www_bbc_co_uk_food_recipes_mustardandbeanpatewi_84047", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter beans from a can, rinsed and drained", "1 tbsp wholegrain mustard", "3 tbsp olive oil", "1 tsp lemon juice", "sea salt and freshly ground black pepper", "2 slices french bread", "1 garlic clove, peeled and halved"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the butterbeans, mustard, olive oil and lemon into a food processor and blend until smooth. Season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan until smoking and place the bread onto it. Griddle for two minutes on each side, then remove and rub with the cut side of the garlic.", "To serve, place the toasts onto a plate and top with the bean pâté."]}, {"isVegetarian": false, "title": "Mustard chicken with bean salad", "url": "www_bbc_co_uk_food_recipes_mustardchickenwithbe_77834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for frying", "1 chicken breast, flattened", "25g/1oz butter", "50ml/1¾fl oz white wine", "3 tbsp wholegrain mustard", "100ml/3½fl oz double cream ", "150g/5¼oz tinned haricot beans, rinsed and drained", "¼ red onion, chopped", "3 tbsp fresh coriander, chopped ", "3 tbsp basil, chopped ", "3 tbsp parsley, chopped ", "½ lemon, rind only", "4 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat a chargrill pan with a little oil and cook chicken on both sides for six minutes or until cooked through.", "In a separate saucepan melt the butter. Add the wine and heat to reduce by half.  Mix in the cream and mustard and reduce to make a thick sauce.", "To make the bean salad, mix the beans, red onion, coriander, basil, parsley and lemon rind together in a bowl.  Finally add the olive oil and mix through.", "To serve place the chicken on a bed of salad and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Mustard-crust salmon with a medley of vegetables and basil butter", "url": "www_bbc_co_uk_food_recipes_mustardcrustedsalmon_84598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz fresh breadcrumbs", "1 tbsp fresh, chopped chives", "1 tbsp fresh, chopped parsley", "15g/½oz butter, melted", "salt and freshly ground black pepper", "1 tsp Dijon mustard", "125g/4½ oz salmon fillet", "dash olive oil", "dash olive oil", "¼ onion, sliced", "75g/2½oz can cherry tomatoes", "50g/1¾oz frozen peas, blanched", "½ avocado, peeled and chopped", "3 tbsp double cream", "25g/1oz butter", "handful fresh basil leaves, chopped", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, place the breadcrumbs, herbs, butter, salt and freshly ground black pepper into a bowl and mix well. ", "Spread the Dijon mustard all over the salmon and then roll the salmon in the breadcrumb mixture and press down. ", "Heat the oil in a small frying pan.  Add the salmon and cook for three minutes on each side, or until golden-brown and completely cooked through.", "For the medley of vegetables, heat the oil in a saucepan and add the onions. Cook gently until the onions have softened.", "Add the tomatoes and cook for two minutes. ", "Add the peas, avocado and cream and heat through for one minute.", "For the basil butter, melt the butter in a small saucepan. Then add the basil and lemon juice and season, to taste, with salt and freshly ground balck pepper.", "To serve, place the medley of vegetables onto a clean plate.  Place the salmon on top and pour the basil butter over the salmon."]}, {"isVegetarian": false, "title": "Mustard grilled chicken fillet with chilli and black-eyed bean salad", "url": "www_bbc_co_uk_food_recipes_mustardgrilledchicke_90128", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken fillet", "1 tbsp grain mustard", "2 tbsp olive oil", "1 tbsp white wine vinegar", "1 red chilli, chopped", "2 tbsp chopped fresh dill", "55g/2oz cooked canned black-eyed beans", "¼ banana, peeled, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Soak a wooden skewer in cold water for ten minutes. ", "For the chicken, thread the meat on to the skewer and coat in the mustard. Heat a chargrill pan until smoking and cook the chicken for 3-4 minutes on both sides, or until golden-brown and cooked through. ", "For the salad, mix all of the salad ingredients in a bowl placed onto a plate. Serve with the chicken on top."]}, {"isVegetarian": false, "title": "Mustard toad in the hole", "url": "www_bbc_co_uk_food_recipes_mustardtoadinthehole_87360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz self-raising flour", "pinch of salt", "2 medium free-range eggs, beaten", "300ml/½ pint milk", "1 tbsp Dijon mustard", "drizzle olive oil", "1 Cumberland sausage", "2 tbsp vegetable oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the flour and salt into a large bowl and make a well in the middle.", "In a separate bowl, whisk the eggs with the milk and mustard. Gradually pour the mixture into the well in the middle of the flour and whisk until you have a thick batter. Set aside and leave to rest for a few minutes while you cook the sausage.", "Heat a drizzle of olive oil in a frying pan, add the sausage and fry until brown on all sides. ", "Pour the vegetable oil into a small gratin or pie dish and place in the oven until very hot. Place the sausage into the hot oil and pour over the batter. Place back in the oven  and cook for 15 minutes, or until puffed up and golden-brown. Serve immediately in the gratin dish."]}]