[{"isVegetarian": false, "title": "Autumn lamb with butter beans", "url": "www_bbc_co_uk_food_recipes_autumnlambwithbutter_92715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 175g/6oz lamb leg steaks, fat cut at intervals (this will prevent the lamb steaks from curling as they cook)", "125ml/4½fl oz extra virgin olive oil", "salt and freshly ground black pepper", "1 red onion, peeled, finely chopped ", "4 salted anchovy fillets, chopped", "8 ripe tomatoes, chopped", "450g/1lb canned butter beans, drained, rinsed", "450g/1lb griddled artichokes, preserved in oil (available from delicatessens)", "1 tbsp finely chopped fresh rosemary leaves", "1 tbsp sherry vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan over a medium heat until hot. Rub a little of the oil all over the lamb leg steaks, using your hands, then season, to taste, with salt and freshly ground black pepper.", "Add the lamb leg steaks to the hot pan and cook for 2-3 minutes on each side, or until golden-brown griddle marks appear on both sides of the steaks. Remove from the pan and set aside to rest. Keep warm.", "Meanwhile, heat 1-2 tablespoons of the remaining oil in a separate frying pan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened.", "Add the chopped anchovy fillets and chopped tomatoes and stir to combine.", "Increase the heat, then add the beans and artichokes. Continue to cook for 4-5 minutes, carefully, until the butter beans have softened and the artichokes have warmed through.", "Stir in the remaining oil, rosemary and sherry vinegar until well combined.", "To serve, divide the butter bean mixture equally among four serving plates. Place one lamb leg steak on top of each serving."]}, {"isVegetarian": true, "title": "Autumn rice pudding with poached fruit", "url": "www_bbc_co_uk_food_recipes_autumn_rice_pudding_with_69714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz milk", "500ml/18fl oz cream", "1 vanilla pod, split open", "200g/7oz pudding rice", "1 x 397g/14oz tin condensed milk", "3 plums, sliced", "100g/3½oz brown sugar", "100g/3½oz butter", "6 figs, cut into chunks", "4 tbsp caster sugar", "1 apple ", "1 pear", "1 whole star anise", "1 small stick cinnamon", "2 tbsp sugar, for the fig coulis"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Add the milk, cream and vanilla pod to a large pan, and bring to the boil. ", "Add the rice and stir well. ", "Reduce the heat and simmer for around 20 minutes, or until the rice is just cooked. Stir frequently to avoid the rice sticking the base.", "Preheat the oven to 190C/375F/Gas 5.", "Lay the sliced plums on a baking tray and sprinkle liberally with brown sugar and dot with butter. Roast in a hot oven for about 10 minutes, or until soft and juicy. Set aside", "Once the rice has cooked, over a gentle heat stir in the condensed milk. ", "Put the figs in a pan with three tablespoons of water and two tablespoons of the caster sugar. Bring to the boil, then remove from the heat, transfer to a blender and blend until smooth.", "Slice the other fruits. Place them in a pan and cover with two more tablespoons of caster sugar and four tablespoons of water and bring to the boil. Add a star anise and a small stick of cinnamon and cook until the fruits are soft.", "Remove the pan from the heat and leave to cool.", "Serve the rice pudding with the fruits on the top and the fig coulis spooned over the plate."]}, {"isVegetarian": false, "title": "Avgolemono soup", "url": "www_bbc_co_uk_food_recipes_avgolemono_soup_55766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["bones from a 1.5kg/3lb 5oz chicken, or 450g/1lb wings and/or drumsticks, or leftover bones from a roasted chicken", "1 large carrot, roughly chopped", "2 celery sticks, roughly chopped", "2 leeks, washed and sliced", "2 bay leaves", "2 sprigs thyme", "8 free-range eggs", "1.5 litres/2½ pints chicken stock ", "1 tsp salt", "1 skinless chicken breast, weighing about 170g/6oz", "100g/3½oz orzo pasta", "3 tbsp lemon juice", "30g/1oz butter", "small handful chopped parsley", "cayenne pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken stock, put all the ingredients and 2¼ litres/3¾ pints water in a large pan and bring to the boil, skimming any scum from the surface. Leave to simmer very gently for 2 hours – it is important not to let it boil as that forces the fat from the chicken and makes the stock cloudy. Strain the stock through a sieve, and simmer a little longer to concentrate the flavour if necessary. If not using immediately, leave to cool, then chill or freeze for later use.", "Poach 4 of the eggs in simmering water for 3-4 minutes, then move to a bowl of cold water to stop the cooking process. Refresh in hot water just before serving.", "Heat the stock to a gentle simmer and add the salt. Poach the chicken breast for 20 minutes. Remove from the stock and leave to cool. ", "Bring the stock to the boil, add the orzo pasta. Reduce to a simmer and cook for 7-8 minutes.", "When the chicken breast is cool enough to handle, slice into 4 lengthways then cut across into strips and set aside.", "Whisk the remaining 4 eggs with the lemon juice in a bowl. Pour half the hot stock over the egg and lemon mixture, whisking all the time. Put the egg, lemon and stock back into the pan, return to the heat and stir until the eggs thicken (at about 70–80C). Don’t cook any further.", "Remove from the heat and whisk in the butter and parsley.", "Add the chicken strips to the soup and ladle into individual bowls. Add a reheated poached egg to each serving and sprinkle with a pinch of cayenne pepper."]}, {"isVegetarian": false, "title": "Avocado 'cannelloni' with crab, scallops and sea herbs", "url": "www_bbc_co_uk_food_recipes_avocado_cannelloni_with_35421", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz cherry tomatoes, halved", "2 sprigs fresh thyme, leaves picked ", "salt and pepper", "1 ripe unbruised avocado", "½ lime, juice only", "1 cooked cock crab, white and brown meat separated", "1 tbsp chopped fresh coriander", "1 tbsp mayonnaise", "sea salt and white pepper", "2 pink grapefruit, juice only ", "1 tbsp sugar syrup  ", "1 tsp of xanthan gum", "pinch smoked paprika", "1 tbsp cream", "2 tbsp olive oil", "2 large diver-caught king scallops, shell and corals removed", "selection of sea aster, sea kale & purslane, blanched and kept warm", "1 tbsp coriander cress"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat an oven to 140C/120C Fan/Gas 1. Line a baking tray. ", "Place the tomatoes on the prepared tray and sprinkle the thyme leaves over the top, season with salt and pepper. Place in the oven and cook for 2 hours until dried out.\r\n\r\n", "Lay out a sheet of cling film out that is about 30cm/12in square.", "Halve the avocado, then use a mandolin to slice the avocado thinly, laying the slices side by side along the length of the cling film, leaving 5cm/2in on each end. Now squeeze lime juice over the avocado and season with sea salt and white pepper.", "Take the white crab meat, checking that there is no shell or cartilage in the meat and then flake it into a bowl, lightly season adding the coriander and mayonnaise.  Mix together and spoon out along the middle of the avocado.  Tightly roll the avocado around the crab meat tying the cling film at each end and then put in the fridge for at least 1 hour. ", "Gently warm the grapefruit juice with the sugar syrup over a low heat and whisk in the xanthan gum until thickened.", "Take the brown crab meat, smoked paprika and cream in a blender. Push the mixture through a sieve into a piping bag.  ", "Just before serving, heat a frying pan until very hot, fry the scallops in a little olive oil, for about 1 minute on each side.", "Take the cannelloni out of the cling film and place in the centre of the plate, leave whole.  Then pipe the brown crab meat in little patches all around, alternating with the pink grapefruit gel.  Then place the scallops and sea herbs neatly around the plate. Garnish with the tomatoes and coriander cress and serve. "]}, {"isVegetarian": true, "title": "Avocado, tomato, feta and brown rice grain bowl", "url": "www_bbc_co_uk_food_recipes_avocado_tomato_feta_and_25906", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_tomato_feta_and_25906_16x9.jpg", "ingredients": ["50g/1¾oz brown rice", "1 spring onion, sliced", "1 tomato, sliced", "½ avocado, sliced", "30g/1oz feta, crumbled", "2 sprigs coriander, leaves picked", "1 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice according to packet instructions, then drain. ", "Place the rice in the bowl you plan to eat from. Add the spring onion, tomato, avocado, feta and coriander. ", "Drizzle liberally with the oil and season with salt and pepper. Eat straight away or pack in your lunchbox ready to take to work. "]}, {"isVegetarian": true, "title": "Avocado hummus", "url": "www_bbc_co_uk_food_recipes_avocadohummus_92444", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocadohummus_92444_16x9.jpg", "ingredients": ["1 ripe avocado, cut in half, skin and stone removed", "1 x 400g/14oz can chickpeas, drained and rinsed", "1 garlic clove, peeled, finely chopped", "1-2 lemons, juice only", "½ tsp Tabasco", "½ tsp ground cumin", "sea salt, to taste", "6 ready-made pitta breads, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all of the ingredients in a food processor until smooth. ", "Transfer the avocado hummus to a bowl and cover with cling film. Chill in the fridge for one hour. ", "Serve in bowls with pitta breads."]}, {"isVegetarian": true, "title": "Avocado and goats' cheese crostini", "url": "www_bbc_co_uk_food_recipes_avocadoandgoatschees_72332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 thin slices baguette (1 baguette cut into rounds)", "1 clove garlic, halved", "extra virgin olive oil", "1 ripe avocado, peeled and diced", "100g/3½oz soft goats' cheese", "1 tbsp lemon juice", "1 tbsp chopped basil", "1 tbsp diced red onion", "salt and freshly ground black pepper"], "serves": "Makes 18", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Brush the bread slices with the garlic and a little olive oil, and bake in the oven until golden and crisp (about 10 minutes).  Remove from the oven and allow to cool.", "Meanwhile, make the avocado mixture. Mash the avocado with the goats' cheese.", "Fold in two tablespoons of olive oil, the lemon juice, basil and onion.  Season to taste.", "Top each crostini with a mound of the avocado mixture, and serve."]}, {"isVegetarian": true, "title": "Aubergine 'parmigiana' with fresh tomato (Parmigiana alla melanzane in pomodoro fresco)", "url": "www_bbc_co_uk_food_recipes_aubergineparmigianaw_92785", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large, equally-sized beefsteak tomatoes, ripe but firm, tops sliced off a quarter of the way down the tomato and reserved, seeds and pulp scooped out using a spoon and reserved, hollowed-out tomatoes reserved", "salt and freshly ground black pepper", "9 tbsp extra virgin olive oil, plus extra for drizzling", "1 small onion, peeled, finally chopped", "2 handfuls fresh basil leaves", "2-3 tbsp plain flour, for dredging", "400g/14oz small aubergines, trimmed, thinly sliced into rounds", "2 free-range eggs, beaten with a large pinch of salt", "200g/7oz smoked mozzarella"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the hollowed-out tomatoes onto a plate lined with kitchen paper. Add a pinch of salt to the cavity of each, then turn the tomatoes upside down and set aside for 10-15 minutes to drain of excess moisture.", "Meanwhile, heat four tablespoons of the extra virgin olive oil in a pan over a high heat. Add the onion and fry for 3-4 minutes, or until softened, then add the reserved tomato pulp and half of the basil leaves and season, to taste, with salt and freshly ground black pepper. Stir well.", "Reduce the heat to medium, then half-cover the pan with a lid and continue to cook the tomatoes for 18-20 minutes, or until most of the moisture has evaporated and the mixture has thickened (check and stir the mixture regularly to prevent it from burning).", "Heat two more tablespoons of olive oil in a separate frying pan over a medium to high heat. While the oil is heating up, sprinkle the flour onto a plate and dredge the aubergine rounds in the flour, shaking off any excess. ", "When the oil is hot, dip each aubergine round into the beaten egg. Add the coated aubergine rounds to the hot oil, in batches if necessary, and fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt. Repeat the process with the remaining batches of aubergines, if necessary.", "Add one fried aubergine slice to the cavity of each hollowed-out tomato, then top with a spoonful of the tomato sauce. Place a basil leaf on top of the sauce, then top with a slice of smoked mozzarella. ", "Repeat the layering process until the tomato cavities are full and all of the ingredients have been used up (reserve any excess basil leaves for the garnish). Replace the 'lid' of each tomato and transfer the filled tomatoes to an ovenproof dish. Season, to taste, with salt and freshly ground black pepper and drizzle over a little of the remaining olive oil. ", "Bake the stuffed tomatoes in the oven for 20-25 minutes, or until the tomatoes have softened and the cheese has melted.", "To serve, place one stuffed tomato into the centre of each of six serving plates. Garnish with the remaining basil leaves, then drizzle over the remaining olive oil and season again with salt and freshly ground black black pepper. Serve hot or warm."]}, {"isVegetarian": true, "title": "Avocado salsa", "url": "www_bbc_co_uk_food_recipes_avocadosalsa_79052", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ red onion, peeled and finely chopped", "½ avocado, peeled and diced", "1 tbsp caster sugar", "squeeze lime juice", "pinch chilli flakes", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the onion, avocado and caster sugar in a large bowl. Stir in the lime juice, chilli flakes and seasoning. ", "Spoon the mixture onto a serving plate and serve."]}, {"isVegetarian": true, "title": "Avocado with poached egg and hollandaise", "url": "www_bbc_co_uk_food_recipes_avocadowithpoachedeg_80922", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz boiling water", "50ml/2fl oz white wine vinegar", "1 egg", "50ml/2fl oz white wine vinegar", "5 peppercorns", "½ shallot, finely chopped", "1 bay leaf", "1 egg yolk", "150g/5½fl oz melted butter ", "salt and freshly ground black pepper ", "½ ripe avocado, stone removed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To poach the egg, place the water and vinegar a saucepan and bring to the boil. Reduce the heat to a gentle simmer and swirl the water with a spoon to create a whirlpool effect.", "Carefully add the egg into the centre of the whirlpool and poach for three minutes, or until cooked to your liking.", "To make the hollandaise, place the vinegar, peppercorns, shallot and bay leaf in a small non-reactive saucepan over a high heat. Boil rapidly reducing the volume of liquid to about a tablespoon, then remove from the heat and allow to cool for one minute.", "Place the egg yolk into a large glass bowl and whisk in the cooled vinegar reduction through a sieve.", "Gradually add the melted butter, whisking vigorously and continuously. Season, to taste, with salt and freshly ground black pepper. ", "To serve, place the avocado in the centre of a plate. Place the poached egg onto the avocado and pour over the hollandaise."]}, {"isVegetarian": true, "title": "Avocado with tomato salsa", "url": "www_bbc_co_uk_food_recipes_avocadowithtomatosal_80921", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tsp white vine vinegar", "1 tsp honey", "1 tsp finely chopped shallot ", "100g/3½oz cherry tomatoes, chopped", "1 tbsp finely shredded fresh basil ", "salt and freshly ground black pepper", "½ ripe avocado, stone removed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oil, vinegar, honey and shallot in a large bowl and mix together well.", "Add the tomato and basil, season, to taste, with salt and freshly ground black pepper and toss together.", "To serve, place the avocado in the centre of a plate and spoon in some of the salsa mixture."]}, {"isVegetarian": false, "title": "A warm salad of asparagus, field mushrooms and fresh peas", "url": "www_bbc_co_uk_food_recipes_awarmsaladofasparagu_67967", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 medium asparagus spears, trimmed and peeled", "175g/6oz shelled young peas", "4 tbsp extra virgin olive oil", "1 clove garlic, mashed to a paste with a little salt", "8 small field mushrooms, stalks removed and peeled", "salt and ground black pepper", "1 ciabatta loaf, cut into two horizontally then in two from top to bottom", "1 shallot, finely chopped", "3 tbsp dry vermouth", "55g/2oz unsalted butter, cubed", "1 tbsp chopped flat-leaf parsley", "1 tbsp snipped chives", "1 tsp chopped tarragon", "1 tbsp freshly squeezed lemon juice", "30g/1oz each rocket and watercress leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the asparagus in boiling salted water for 1 minute, remove and set aside.", "Add the peas to the asparagus cooking water and cook for 2-5 minutes, drain and set aside.", "Prepare your barbie, griddle or grill pan.", "Combine the olive oil and garlic and brush over the asparagus and both sides of the mushrooms with salt and black pepper.", "Grill or barbecue the mushrooms for 4 minutes on each side, and the asparagus for 2 minutes each side.  Keep both warm.  Brush the ciabatta slices on both sides with the garlic oil and grill until both sides are toasted.", "In a saucepan heat the remaining oil infusion, add the shallot and over a medium heat allow to cook without colour. ", "Add the vermouth, increase the heat and cook for a further minute. ", "Remove the pan from the heat and whisk in the butter a little at a time. Fold in the peas, parsley, chives, tarragon and lemon juice. Season to taste.  ", "Return to a gentle heat to warm through.", "Combine the rocket and watercress and divide between four plates. Top the leaves with a slice of the grilled bread.  ", "Divide the asparagus and mushrooms between the bread slices, arranging them attractively on top of each slice. Spoon the peas and buttery juices over the salad leaves."]}, {"isVegetarian": false, "title": "Ayam golek (spiced chicken with coconut cream and rojak salad)", "url": "www_bbc_co_uk_food_recipes_ayamgolekspicedchick_86656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2cm/1in piece fresh root ginger", "2cm/1in piece galangal (if galangal is not available, use double the quantity of fresh root ginger)", "1 tsp salt", "4 dried chillies, soaked in hot water to soften", "5 shallots, roughly chopped", "2 garlic cloves", "4 lemongrass stalks, tough outer leaves removed", "4 poussin or baby chickens ", "300ml/10½fl oz coconut cream", "2 tsp sugar", "2 limes, juice only", "2 tbsp shrimp paste", "3 fresh red chillies, seeds removed, finely chopped", "4cm/1½in piece of fresh root ginger, grated", "1 tbsp tamarind pulp, mashed (available in Asian and Indian supermarkets)", "1 lime, juice only", "5 tbsp boiling water", "2 tbsp fish sauce (nam pla)", "3 tbsp caster sugar", "½ small cucumber, cut into triangular chunks", "¼ fresh pineapple, peeled, core removed, cut into cubes", "1 firm unripe mango, peeled, stone removed, cut into thin wedges", "1 firm unripe papaya, peeled, seeds removed, cut into strips", "1 Granny Smith apple, core removed, cut into thin wedges", "2 spring onions, finely sliced", "½ bunch fresh mint, leaves only, torn (plus extra to garnish)", "100g/3½oz roasted blanched peanuts, coarsely crushed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and preheat a large griddle pan until hot.", "For the poussins, place the softened chillies, shallots, garlic, ginger, galangal and salt into a food processor and blend. Add a little water if necessary to form a smooth paste. (Blend the hardest ingredients first, then add the softer ones to the processor to ensure the paste is very smooth.)", "Bruise the lemongrass with a rolling pin, then place a stalk inside the body cavity of each poussin.", "Rub half of the spice paste over both the insides and outsides of the poussins.", "Place the remaining spice paste into a pan. Add the coconut cream and sugar and place over a medium heat. Bring to a boil, then reduce the heat to simmer, until the liquid has reduced by half.", "Place the poussins onto the hot griddle pan and griddle for 3-4 minutes on all sides to achieve golden-brown griddle marks all over.", "Transfer the poussins to a roasting tray and place into the oven to roast for 15-20 minutes, or until completely cooked through. During cooking, baste the poussins with the reduced coconut cream and spice mixture every five minutes.", "Remove the poussins and leave to rest for 4-5 minutes in a warm place. Before serving, pour all of the juices from the roasting tray over the poussins and drizzle with the lime juice.", "For the dressing, reduce the oven temperature to 180C/365F/Gas 4.", "Place the shrimp paste into kitchen foil and wrap up to seal. Bake in the oven for ten minutes, or until it becomes nutty and drier (it should smell aromatic rather than pungent).", "Grind the chillies and ginger together in a pestle and mortar. ", "Add the roasted shrimp paste and grind again with the pestle and mortar to combine well.", "Add the tamarind pulp, lime juice, water, fish sauce and sugar and mix well.", "For the rojak salad, place the cucumber, pineapple, mango, papaya and apple into a bowl and mix together well.", "Add the spring onion and mint and mix through gently.", "Add half of the peanuts and stir through gently.", "Pour over the dressing and stir again to coat well.", "To serve, place a poussin onto each plate. Add a couple of spoonfuls of salad and garnish with the remaining peanuts and a few mint leaves."]}, {"isVegetarian": false, "title": "Aztec molcajete", "url": "www_bbc_co_uk_food_recipes_aztecmolcajete_87914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large garlic cloves ", "1 chipotle chilli (available from some supermarkets or specialist food markets)", "½ Spanish onion, roughly chopped", "1 bunch coriander ", "1 tomato, peeled, quartered and seeds removed", "50ml/2fl oz Mexican beer", "300g/11oz canned peeled tomatoes, chopped", "salt and freshly ground black pepper", "1 free-range organic chicken breast, sliced into strips", "1 tbsp olive oil", "salt and freshly ground black pepper ", "200g/7oz sirloin steak", "150g/5oz cooking chorizo, sliced lengthways", "1 bunch spring onions, trimmed", "4 tbsp sunflower oil", "½ onion, roughly chopped", "2 x 400g/14oz cans red kidney beans in water (drain and discard the water from one of the cans)", "75ml/3fl oz chicken stock", "salt and freshly ground black pepper ", "8 flour or corn tortillas ", "½ bunch coriander, roughly chopped", "1 large avocado, peeled and sliced lengthways", "1 lime"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the salsa, place the garlic, chilli, onion and coriander into a large pestle and mortar and crush to a paste.", "Add the tomato and crush together, before adding the beer and canned tomatoes. Mix to combine.", "Season to taste with salt and freshly ground black pepper.", "Transfer this mixture to a pan (or a traditional Mexican lava stone pestle), place over a high heat and bring to the boil - take care if you're using a stone pestle as it will get very hot.", "Reduce the heat and simmer for 20 minutes. Add more salt and freshly ground black pepper, to taste, and keep warm.", "For the molcajete base, heat a griddle pan until hot. Toss the chicken strips with olive oil and salt and freshly ground black pepper in a small bowl. Place the chicken onto the griddle pan to start cooking while you season the steak.", "Season the steak with salt and freshly ground black pepper, to taste, and add the steak and chorizo to the griddle pan.", "Cook the meat for 2-3 minutes, then turn over and cook for a further another 2-3 minutes, or until cooked all the way through. Remove the meat from the griddle and set aside in a warm place to rest.", "Add the whole spring onions to the griddle pan and griddle for 1-2 minutes. Remove and set aside in a warm place.", "For the refried beans, heat a saucepan until hot and add the sunflower oil and onions and fry until golden-brown.", "Add the beans, along with the water from one of the cans. Stir, add the chicken stock and bring to the boil.", "Reduce the heat and simmer for 5-8 minutes.", "Remove the beans from the heat and allow to cool slightly. Purée with a hand-held blender and season with salt and freshly ground black pepper. Reheat the beans if necessary.", "To serve, toast the tortillas under the grill.", "The salsa should either be served hot in the lava stone pestle, or, if using a saucepan, pour into a normal kitchen pestle and mortar and serve from there.", "Slice the steak and place into the salsa in the pestle, along with the chorizo and chicken. Garnish the top with the grilled spring onions, avocado and chopped coriander. Serve the refried beans and toasted tortillas alongside."]}, {"isVegetarian": true, "title": "Baba ghanoush", "url": "www_bbc_co_uk_food_recipes_baba_ghanoush_81714", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large aubergines ", "2 large vine tomatoes, roughly chopped", "1 roasted red pepper, roughly chopped (from a jar is fine)", "1 small bunch fresh flatleaf parsley, chopped, reserving a few whole leaves for garnish ", "1 garlic clove, crushed", "1 tbsp pomegranate molasses", "2 tbsp extra virgin olive oil", "1 pomegranate, seeds only", "salt and freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Pierce the aubergines with a knife and roast in the oven for 45–50 minutes, or until really soft and tender. Set aside to cool.", "Once cool enough to handle, peel the aubergines and scoop the flesh into a large bowl. ", "Stir in the tomatoes, peppers and parsley and mix well.  Add the garlic, pomegranate molasses, extra virgin olive oil and season with salt and pepper, stirring to combine.", "Arrange in a serving dish, drizzle with olive oil. Garnish with the reserved parsley leaves and some pomegranate seeds."]}, {"isVegetarian": true, "title": "Baba ganoush, grilled aubergine with lentils and aubergine fritters", "url": "www_bbc_co_uk_food_recipes_baba_ganoush_grilled_50988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines", "2 garlic cloves, chopped", "1 lemon", "1 tbsp tahini ", "2 tbsp olive oil", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh mint", "1 aubergine, sliced ", "2 tbsp olive oil", "1 garlic clove, chopped", "150g/5½oz cooked Puy lentils", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh parsley", "2 tbsp olive oil", "1 tbsp white wine vinegar", "2 shallots, chopped", "vegetable oil, for deep-frying", "300g/10½oz chickpea flour", "2 aubergines, cut into finger lengths", "1 lemon, grated zest only", "2 tbsp chopped fresh parsley", "1 red chilli, finely chopped", "100g/3½oz salted ricotta"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baba ganoush, hold the aubergines over a gas flame until blackened all over (alternatively char them under a hot grill). Put them in a large bowl and cover with cling film. Set aside for a few minutes, then wash off the blackened skin and scoop out the flesh. ", "Place in a food processor with the other ingredients apart from the herbs. Blend until smooth but with a little texture. Remove from the processor and season to taste with salt and pepper. Sprinkle over the fresh herbs and serve. ", "For the lentils and grilled aubergine, heat a large ridged griddle pan. Place the aubergine in a bowl and add the oil, garlic and parsley. Mix to coat the aubergine.", "Place the slices of aubergine onto the hot griddle pan and cook for 1–2 minutes on each side.", "Mix the lentils with the remaining ingredients and season with salt and pepper. ", "Put the griddled aubergines onto a serving plate and pile the lentil mixture on top.", "For the aubergine fritters, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Mix the flour with a little water to make a smooth batter. Dip the aubergine pieces into the batter to coat. Deep-fry in batches for 3–4 minutes, or until golden. Leave to drain on kitchen paper.", "Mix the lemon zest, parsley and chilli together. Sprinkle over the deep-fried aubergines and grate over the salted ricotta."]}, {"isVegetarian": true, "title": "Baba ganoush", "url": "www_bbc_co_uk_food_recipes_baba_ganoush_44415", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baba_ganoush_44415_16x9.jpg", "ingredients": ["3 aubergines", "3 garlic cloves, crushed with a teaspoon of salt", "1 lemon, juice only", "2 tbsp tahini", "3 tbsp olive oil", "black pepper, to taste", "1 tbsp chopped flat leaf parsley"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prick the aubergines with a fork. Grill the aubergines until the skin is charred and blacked and the flesh feels soft when you press it (this will take approximately 15-20 minutes, turning halfway through cooking).", "In a pestle and mortar, crush the garlic with the lemon juice, tahini, olive oil and pepper.", "When cool enough to handle, cut the aubergines in half and scoop out the flesh. Mix the soft flesh with the remaining ingredients. ", "Place in a serving dish and finish with a drizzle of olive oil and sprinkle the parsley over the top."]}, {"isVegetarian": true, "title": "Baba ganoush", "url": "www_bbc_co_uk_food_recipes_babaganoush_78707", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babaganoush_78707_16x9.jpg", "ingredients": ["2 aubergine, peeled and chopped", "6 tbsp olive oil", "½ red onion, finely chopped", "2 garlic cloves, crushed", "1 large bunch fresh basil", "splash olive oil", "1 loaf ciabatta ", "extra olive oil, to brush"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in an oven-proof frying pan over a medium heat. Add the aubergine and onion and fry for fifteen minutes to soften. Add the garlic and fry for two minutes", "Meanwhile, heat a griddle pan. Brush the ciabatta with oil and grill the bread on each side for 1-2 minutes, or until brown stripes appear.", "Place the aubergine mixture into a food processor with the basil and a splash of oil. Blend to a rough paste and pour out into a bowl.", "Serve the aubergine mixture with the griddled bread."]}, {"isVegetarian": true, "title": "Baby aubergines with oregano and red onions", "url": "www_bbc_co_uk_food_recipes_baby_aubergines_with_49593", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baby_aubergines_with_49593_16x9.jpg", "ingredients": ["500g/1lb 2oz baby aubergines", "3 tbsp olive oil", "2 tsp dried oregano", "1 small red onion, cut into thin half-moons", "3 tbsp red wine vinegar", "1 tsp sea salt flakes or ½ tsp pouring salt", "4 tbsp extra-virgin olive oil", "1 clove garlic, peeled", "1½ tbsp cold water", "few sprigs fresh oregano (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 250C/475F/Gas 9.", "Slice the baby aubergines in half lengthways, keeping the stalks on: this is an aesthetic consideration, nothing to do with flavour, but humour me.", "Pour the regular olive oil into a very shallow roasting tin, sprinkle in the dried oregano, add the aubergines, cut-side down, and swirl them gently around. Then turn them so they are cut-side up and put the tray in the hot oven for 15 minutes, by which time they should be tender and turning gold in parts.", "As soon as the aubergines are in the oven, put the fine half-moons of red onion in a bowl and cover with the red wine vinegar and salt.", "Remove the cooked aubergines to a platter, and now whisk into the vinegary onions the extra-virgin olive oil, then the grated or minced garlic and, finally, the cold water.", "Pour this over the warm aubergines, using your hands to arrange the glowingly pink onion over them evenly, then leave it all for about half an hour to cool to room temperature before you eat, scattering with fresh oregano, if you have any, when serving."]}, {"isVegetarian": false, "title": "Baby squid stuffed with morcilla with tomatoes and clams", "url": "www_bbc_co_uk_food_recipes_baby_squid_stuffed_with_21407", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "250g/9oz morcilla black pudding ", "3 small squid, cleaned", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 x 227g tin chopped tomatoes ", "1 bay leaf", "1 tsp sweet smoked paprika ", "225ml/8fl oz white wine", "2 handfuls raw clams, scrubbed", "1 bunch flatleaf parsley, finely chopped  "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the squid, heat the oil in a pan over a medium heat. Sweat the shallots and garlic for 5 minutes, or until starting to soften. Add the black pudding, breaking it up with a spoon and stir everything together. Cook for a few minutes until the black pudding is cooked through.  ", "Allow the mixture to cool and stuff the baby squid bodies. Secure with a cocktail stick. ", "To make the tomatoes and clams, heat the oil in a frying pan and sweat the onion and garlic for 5 minutes. Add the tomatoes and bay leaf and simmer until reduced. Add the wine, bring to the boil and simmer to a thick paste. ", "Heat the remaining wine in a saucepan. Add the clams to the pan, discarding any open clams that do not close when given a sharp tap. Cook for 5 minutes, or until the clams are open. (Discard any that do not open.) Remove the clams and pick out the meat. Strain the cooking liquor into the tomato sauce, bring to a simmer and reduce. Add the clam meat and parsley to the sauce and stir well. Keep warm", "Meanwhile, preheat a griddle pan over a high heat. Grill the stuffed squid on both sides until chargrilled.  Slice into thick pieces. ", "Spoon the sauce onto a serving dish and top with the squid. "]}, {"isVegetarian": true, "title": "Baby artichoke tartlets", "url": "www_bbc_co_uk_food_recipes_babyartichoketartlet_67913", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 jar baby artichokes in oil, drained, halved", "1 packet puff pastry", "1 egg yolk, beaten", "smoked paprika (pimenton), for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 220C/425F/Gas 7. ", "Cut the pastry into little squares just slightly larger than the artichokes. Brush pastry with beaten egg yolk. Press an artichoke half into the pastry, cut-side up. Dust with smoked paprika. Bake until the pastry is puffed and golden, about 10 minutes. Serve hot as a canapé."]}, {"isVegetarian": true, "title": "Baby bruschettas with poached pears, gorgonzola and port syrup", "url": "www_bbc_co_uk_food_recipes_babybruschettaswithp_68099", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 small firm pears", "2 tbsp clear honey", "150ml/¼ pint port", "150ml/¼ pint red wine", "225g/8oz gorgonzola (or a similar vegetarian blue cheese), at room temperature", "24 slices of baguette", "2 tbsp extra virgin olive oil"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to hot.", "Halve and core the pears, then cut each pear into 12 small wedges.  Place in a heavy-based saucepan with the honey, port and wine.  Cook for 10-15 minutes or until the pears are tender to the point of a knife but not soft.", "Drain the liquid into a small pan and allow the pear wedges to drain thoroughly.", "Reduce the liquid by two thirds, when it should be a syrupy consistency, this will take 8-10 minutes.  Place in a small glass and allow to cool.", "To make the bruschettas, brush each slice of bread with the olive oil, and then grill until the bruschettas are golden on both sides.  This only takes a minute or two so keep a close eye!", "Just before your guests arrive, generously spread each bruschetta with gorgonzola, top with a poached pear slice.  Finally, using a teaspoon drizzle with the port syrup."]}, {"isVegetarian": false, "title": "Baby cos salad with preserved lemon dressing", "url": "www_bbc_co_uk_food_recipes_babycossaladwithpres_12156", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cloves garlic", "extra virgin olive oil", "2 lemons, juice only", "2 preserved lemons,  finely chopped ", "sea salt and freshly ground black pepper", "2 baby cos lettuce", "2 whole '5' minute eggs, peeled", "4 best quality anchovies", "8 black olives", "grated parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dressing, crush the garlic in a mortar and pestle or garlic press.", "Add some olive oil together with the lemon juice, preserved lemon, sea salt and pepper. Mix well.", "To serve the salad, cut the cos lettuce in half lengthways and place on a serving platter.", "Cut the eggs in half and place over the lettuce followed by the whole anchovies, olives, plenty of pepper and grated parmesan.", "Finish with the dressing over the top."]}, {"isVegetarian": true, "title": "Baby courgettes and chanterelle mushrooms with basil", "url": "www_bbc_co_uk_food_recipes_babycourgettesandcha_91629", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babycourgettesandcha_91629_16x9.jpg", "ingredients": ["large handful fresh chanterelle mushrooms, washed and cleaned to remove any grit, stalks removed, roughly torn", "5 baby courgettes, trimmed, sliced lengthways into thin strips", "3 tbsp olive oil", "large pinch sea salt flakes", "1 garlic clove, peeled, finely chopped", "freshly ground black pepper", "¼ lemon, juice only", "small handful fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the chanterelle mushrooms and courgette strips until well combined. Drizzle over two tablespoons of the olive oil and season with salt, then stir until the vegetables are completely coated in the oil. ", "Heat a frying pan over a high heat. When the pan is smoking, add the courgettes, mushrooms and any remaining oil and fry for 6-8 minutes, without stirring, or until the water from the vegetables has evaporated and the vegetables have softened and are golden-brown. (NB: If the vegetables start to stick to the bottom of the pan, shake the pan occasionally during cooking.)", "When the courgettes and mushrooms are cooked, remove the pan from the heat and add the chopped garlic. Season, to taste, with freshly ground black pepper. ", "To serve, transfer the pan contents to a soup bowl. Drizzle over the remaining olive oil and the lemon juice, then sprinkle over the basil."]}, {"isVegetarian": true, "title": "Baby potatoes with fennel", "url": "www_bbc_co_uk_food_recipes_babypotatoeswithfenn_67361", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["310g/11oz baby salad potatoes", "3 tbsp oil", "¼ tsp fennel seeds (or ½ tsp sugar (if preferred)", "¼ tsp salt", "pinch of garam masala", "¼ tsp chilli powder"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Par-boil the potatoes for 7-8 minutes, then drain them. ", "Leave them to cool. ", "In a frying pan heat the oil, add the spices and mix for 1 minute. ", "Tip in the potatoes and sauté for 3-4 minutes."]}]