[{"ingredients": ["1 cucharada de aceite de oliva extra virgen", "Panceta de 300 g / 11oz, en rodajas", "3 yemas de huevo de gallinas camperas", "50 g / 1¾oz de queso parmesano, rallado, más extra para servir", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "350g / 12oz de pasta fresca de penne", "3 cucharadas de perejil de flatleaf fresco picado"], "method": ["Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva y la panceta y cocine por 3-5 minutos o hasta que estén crujientes. Retire la panceta de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Batir las yemas de huevo, queso parmesano y crema en un tazón y sazonar, al gusto, con sal y pimienta negra recién molida.", "Cocine el penne según las instrucciones del paquete en una sartén de agua hirviendo con sal.", "Escurrir la pasta y agregarla a la mezcla de crema, revolviendo continuamente hasta que quede suave. Agregue la panceta y el perejil y revuelva hasta que estén bien combinados.", "Para servir, coloque la pasta en tazones calientes y espolvoree un poco de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_penne_carbonara_98193", "title": "Penne carbonara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1/2 calabaza, pelada y cortada en trozos de 3cm / 1¼ pulgadas", "½ berenjena, cortado en trozos de 3cm / 1¼in", "1 camote grande, pelado y cortado en trozos de 3cm / 1¼ en", "1 calabacín, cortado en trozos de 3cm / 1¼ en", "3 cucharadas de aceite de oliva, más extra para freír", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "400g / 14oz de tomates picados en lata", "Pasta de penne 400g / 14oz", "Frijoles verdes finos de 100g / 3½oz, cortados en longitudes de 2cm / 1in, blanqueados", "2 cucharadas de perejil de flatleaf tostado", "100g / 3½ oz de pan rallado fresco", "150g / 5½oz de queso cheddar fuerte, rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la calabaza, la berenjena, la batata y el calabacín en una lata grande para asar y rocíe con el aceite de oliva. Asar en el horno durante 20 minutos o hasta que estén suaves y dorados.", "Caliente una sartén mediana y agregue un poco de aceite. Una vez caliente, agregue la cebolla y el ajo. Cocine por 3-4 minutos hasta que esté suave.", "Agregue los tomates enlatados y cocine por otros 15 minutos, o hasta que se reduzca el volumen a la mitad.", "Mientras tanto, coloque una olla grande de agua sobre la placa y agregue una pizca de sal. Una vez que hierva, agregue la pasta penne y cocine según las instrucciones del paquete. Una vez cocido, escurrir e incorporar la salsa de tomate, las verduras asadas, las judías verdes y el perejil. Transfiera a un plato refractario.", "Mezcle las migas de pan y el queso en un tazón pequeño, luego espolvoree sobre la pasta.", "Hornee en el horno por 15-20 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_penne_pasta_with_87725", "title": "Penne pasta con fondant de tomate y verduras asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de penne seca 400 g / 14 oz", "1 x 50g / 1¾oz de anchoas de lata en aceite de oliva, aceite reservado", "2 dientes de ajo, en rodajas finas", "1 cucharadita de hojuelas de chile (use la mitad si prefiere menos calor)", "1 cabeza de brócoli (aproximadamente 350g / 12oz), cortada en pequeños floretes", "sal y pimienta negra"], "method": ["Cocine la pasta de acuerdo con las instrucciones del paquete en una olla grande de agua hirviendo con sal.", "Caliente una sartén grande a fuego medio. Vierta 1½ cucharadas soperas (o todo lo que haya en la lata si no tiene 1½ cucharadas soperas) de aceite de anchoa en la sartén y, una vez caliente, agregue las anchoas y el ajo, rompiendo las anchoas con una cuchara de madera como ellos cocinan. Cocine suavemente hasta que las anchoas se hayan derretido en una pasta. Agregue los copos de chile y mezcle bien. Reduzca el fuego a bajo hasta que la pasta esté lista.", "Cuando la pasta esté a dos minutos de estar lista, agregue el brócoli a la sartén con la pasta. Continúe cocinando durante dos minutos y luego drene, reservando una taza de agua de cocción. Incline la pasta y el brócoli en la sartén con las anchoas y revuelva bien para cubrir todo en la salsa de anchoa. Si las anchoas son demasiado gruesas o la pasta un poco pegajosa, agregue una pizca de agua de pasta, mezcle y continúe agregando hasta que toda la pasta esté cubierta con la salsa.", "Pruebe y ajuste el condimento según sea necesario. Servir."], "url": "www_bbc_co_uk_food_recipes_penne_with_anchovy_19322", "title": "Penne con anchoa, brócoli, chile y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_anchovy_19322_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Penne de trigo integral 350 g / 12 oz", "1 cucharada de aceite de colza virgen extra o aceite de oliva", "2 cebollas tiernas, finamente picadas", "200 g / 7oz de queso mascarpone reducido en grasa", "4 cucharadas de jugo de limón", "Guisantes congelados de 400 g / 14 oz, descongelados", "400 g / 14oz de frijoles congelados, descongelados", "1 pequeño manojo de albahaca, aproximadamente picado, algunas hojas reservadas para decorar", "sal y pimienta negra recién molida"], "method": ["Cocine el penne en una olla grande de agua hirviendo durante 10-12 minutos o hasta que esté al dente.", "Mientras tanto, caliente el aceite en una sartén grande a fuego medio-bajo, agregue las cebollas tiernas y fría durante 1-2 minutos o hasta que se ablanden. Agregue el mascarpone, jugo de limón, guisantes, habas y albahaca. Sazonar con sal y pimienta negra recién molida y revuelva durante 1-2 minutos o hasta que burbujee.", "Escurra el penne, reservando un poco del agua de cocción. Revuelva la pasta en los guisantes y los frijoles. Agregue un poco del agua de cocción de la pasta, si es necesario, para aflojar la mezcla. Adorne con albahaca y sirva."], "url": "www_bbc_co_uk_food_recipes_penne_with_peas_and_44307", "title": "Penne con guisantes y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_peas_and_44307_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Plumas de 300 g / 10½ oz", "400g de tomates cortados en lata", "2 cucharadas de aceite de oliva virgen extra", "pizca de cebolla en polvo", "pellizcar los gránulos de ajo", "½ cucharadita de salsa de chipotle, o al gusto", "250g / 9oz de verduras mediterráneas asadas congeladas", "pimienta negra recién molida", "4 cucharadas de parmesano recién rallado, para servir"], "method": ["Llevar a ebullición una cacerola grande de agua salada. Agregue el penne y cocine según las instrucciones del paquete, normalmente de 10 a 12 minutos.", "Mientras tanto, incline los tomates en una olla grande. Agregue el aceite, el polvo de cebolla, los gránulos de ajo y la salsa de chipotle, revuelva bien, luego hierva a fuego medio. Cocine a fuego lento durante 2 minutos.", "Retire del fuego y mezcle hasta que quede suave con una batidora. Regrese al fuego, agregue los vegetales tostados y cocine por 2-3 minutos, o hasta que burbujee.", "Escurra el penne, reservar un poco de agua, luego incline la pasta en la salsa y revuelva. Agregue un par de cucharadas de agua de pasta a la sartén, luego sazone bien con pimienta negra.", "Servir espolvoreado con parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_penne_with_roasted_77840", "title": "Penne con vegetales asados ​​y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800 g / 1 lb 12 oz de acelga suiza", "2 cucharadas de aceite de oliva", "1 cebolla pequeña, finamente picada", "1 diente de ajo, finamente cortado", "75g / 3oz de rebanado de panceta, cortado en cerillas", "150g / 5oz de salchichas toscanas, sin piel, finamente picadas", "Crema doble 50ml / 2floz", "pizca de copos de chile seco", "Penne rigate 400g / 14oz", "sal marina y pimienta negra recién molida", "parmesano recién rallado, para servir"], "method": ["Recorta los extremos de la acelga y corta las hojas verdes de los tallos blancos.", "Cortar los tallos en fósforos finos y escaldar en agua con sal hirviendo durante 1-2 minutos, o hasta que estén suaves. Escurrir y apartar.", "Blanquee las hojas verdes en agua con sal hirviendo durante 4-5 minutos, luego drene y pique aproximadamente.", "Caliente el aceite de oliva en una olla grande de base pesada, agregue la cebolla y el ajo y cocine suavemente durante 5-6 minutos, o hasta que esté suave.", "Agregue la panceta y la carne de salchicha y cocine a fuego lento durante 20 minutos, luego escurra el exceso de grasa.", "Agregue la crema a la salsa y deje que hierva. Agregue el chile seco y los tallos de acelga blanqueados y sus hojas, luego cocine durante 4-5 minutos. Sazone al gusto, con sal y pimienta negra recién molida.", "Cocine el penne en una olla grande de agua hirviendo, de acuerdo con las instrucciones del paquete, hasta que esté al dente. Escurrir, reservar unas cucharadas de agua de cocción.", "Agregue la pasta a la salsa, mezcle bien y agregue un poco del agua reservada si es necesario para aflojar la salsa.", "Cocine suavemente durante 2 minutos, luego sirva con pimienta negra recién molida y parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_penne_with_sausage_26109", "title": "Penne con salchicha, panceta y acelga", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3-4 cucharadas de aceite de oliva virgen extra", "1 cebolla, pelada y picada", "4 rebanadas de tocino rayado, corteza quitada, picada", "500g / 1lb 2oz de tomates cherry maduros, cortados por la mitad", "sal y pimienta negra recién molida", "1 cucharadita de sal", "2 litros / 3½ pintas de agua hirviendo", "250g / 9oz de pasta penne", "20 g / 3/4 oz de queso parmesano, finamente rallado, para servir", "2 panecillos de ciabatta, cortados por la mitad", "1 diente de ajo, pelado y cortado por la mitad", "aceite de oliva virgen extra, para lloviznar", "250g / 9oz de tomates cherry maduros, cortados en cuartos", "1 x 125 g / 4½ oz de mozzarella de búfala bola", "sal al gusto", "1 albahaca fresca de manojo pequeño, solo hojas"], "method": ["Para la salsa, caliente el aceite en una sartén, agregue la cebolla y cocine a fuego medio durante unos 2-3 minutos, hasta que se ablande.", "Agregue el tocino a la sartén y freír suavemente hasta que esté ligeramente dorado, aproximadamente diez minutos.", "Agregue los tomates a la sartén y mezcle bien.", "Reduzca el fuego y cocine a fuego lento hasta que los tomates comiencen a descomponerse, aproximadamente cinco minutos. Sazonar, al gusto, con sal y pimienta negra recién molida, pero tenga cuidado con la sal ya que el tocino es salado.", "Para la pasta, coloque la sal en una olla de agua hirviendo y agregue el penne.", "Hierva durante 8-10 minutos, o de acuerdo con las instrucciones del paquete, hasta que esté al dente (la pasta debe dar algo de resistencia cuando se muerda). Escurrir, agregar a la sartén con la salsa y mezclar bien.", "Mientras tanto, para la bruschetta, precalentar la parrilla a fuego medio. Tueste las mitades de ciabatta en ambos lados.", "Frote ligeramente los lados cortados del diente de ajo sobre las mitades de ciabatta.", "Rocíe generosamente con aceite de oliva.", "Coloque los tomates encima de la ciabatta. Rompa la mozzarella en pedazos y colóquela encima de los tomates.", "Sazonar, al gusto, con sal y rociar un poco más de aceite de oliva. Rasgue las hojas de albahaca en pedazos y esparza sobre la parte superior.", "Para servir, divida la pasta entre dos tazones y espolvoree sobre el parmesano. Sirve con la bruschetta con mozzarella."], "url": "www_bbc_co_uk_food_recipes_penneallamatriciana_86982", "title": "Penne all'Amatriciana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva virgen extra, más un guión adicional para cocinar la pasta", "2 chiles calientes medianos, en rodajas finas", "2 dientes de ajo picados", "puñado de hojas de albahaca", "600g / 1lb 5oz de tomate picado en lata", "sal al gusto", "Pasta fresca de penne 400 g / 14 oz", "virutas de parmesano (o queso duro vegetariano similar), para servir"], "method": ["Calentar el aceite de oliva en una sartén. Agregue el chile y el ajo a la sartén. Después de aproximadamente un minuto, agregue las hojas de albahaca y suavemente marchítelas en el aceite aromatizado.", "Retire el ajo, la albahaca y el chile de la sartén y déjelos a un lado. Agregue los tomates picados a la sartén.", "Coloque el ajo, la albahaca y el chile en la sartén con los tomates. Cocine a fuego lento durante al menos 10 minutos, hasta que la salsa se haya espesado un poco. Agregue sal al gusto.", "Mientras tanto, cocine la pasta durante unos minutos en una olla grande de agua salada hirviendo con una pizca de aceite de oliva. Escurra la pasta y la salsa de tomate. Servir con virutas de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_pennealarrabiatapast_83813", "title": "Penne al'arrabiata (pasta con salsa de tomate y chile)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennealarrabiatapast_83813_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta penne 250 g / 9 oz, previamente cocinada al dente", "150g / 5oz de panceta, en cubos", "1 cebolla roja mediana, en rodajas", "70g / 3oz de guisantes descongelados", "3 cucharadas de aceite de oliva con sabor a tomate y secado al sol", "1 cucharada de aceite de oliva con sabor a chili", "sal al gusto"], "method": ["En una sartén grande freír las cebollas, la panceta y los guisantes en el tomate secado al sol con sabor a aceite de oliva.", "Deje que se cocine durante aproximadamente 2 minutos hasta que estén crujientes.", "Blanquee la pasta en agua hirviendo durante aproximadamente 30-40 segundos, escurra e inmediatamente ponga la salsa y mezcle bien.", "Rocíe aceite de oliva con sabor a chili sobre la pasta y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_penneallatorrese_65964", "title": "Penne alla torrese", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penneallatorrese_65964_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Paquete de 500 g / 1lb2oz de pasta seca corta, como farfalle, penne o fusilli", "Tarro de 200ml / 7fl oz (aprox.) De passata de tomate de buena calidad", "2 cucharadas de aceite de oliva virgen extra", "2 dientes de ajo, en rodajas", "5 hojas de albahaca fresca", "200ml / 7fl oz de crema individual", "1 vaso pequeño de vodka", "60 g / 2 oz de mantequilla", "1 cucharada de pimienta machacada", "sal", "3 cucharadas de parmesano recién rallado"], "method": ["Para hacer la salsa de tomate, caliente el aceite de oliva en una olla pequeña. Agregue el ajo picado y freír suavemente hasta que estén dorados.", "Agregue el tarro de salsa de tomate y sazone con sal y pimienta. Agregue varias hojas de albahaca fresca y cocine suavemente durante unos 10 minutos.", "Mientras la salsa hierve a fuego lento, ponga a hervir un sartén de agua con sal y cocine la pasta hasta que esté al dente. Escurrir bien .", "Mientras tanto, en una sartén grande derrita la mantequilla, agregue la pimienta triturada y la pasta drenada. Mezcle bien, asegurándose de que toda la pasta esté bien cubierta con mantequilla. Mantenga el fuego alto y mezcle la pasta con una espátula, mientras agrega la salsa de tomate y la crema. Agregue el vaso de vodka, mezcle nuevamente y apague el fuego; si el vodka se evapora, perderás el sabor de él.", "Espolvoree con queso parmesano y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pennealpomodoroevodk_10819", "title": "Pasta con salsa de tomate y vodka", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de penne 125 g / 4½ oz, cocida de acuerdo con las instrucciones del paquete", "1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "¼ de cebolla roja, finamente picada", "½ cucharadita de hojuelas de chile seco", "1 cucharada de puré de tomate", "½ aguacate, piedra removida, rebanada", "pequeñas hojas de cohetes puñado", "1 cucharada de aceite de oliva", "½ cucharada de vinagre balsámico"], "method": ["Coloque todos los ingredientes para la pasta en un recipiente para servir, mezclando bien para combinar los ingredientes.", "Para la ensalada, coloque todos los ingredientes en un recipiente aparte, mezclándolos bien. Sirve junto al plato de pasta."], "url": "www_bbc_co_uk_food_recipes_pennearabattiawithav_84013", "title": "Penne arrabiata con ensalada de aguacate y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "3 cucharadas de hojas frescas de perejil", "1 diente de ajo, aplastado", "1 cucharadita de hojuelas de chile", "una pizca de sal", "Pasta penne 150 g / 5½ oz, cocida de acuerdo con las instrucciones del paquete", "6 hojas de albahaca fresca, rotas", "algunas virutas de trufa blanca fresca, para servir"], "method": ["Coloque el aceite, el perejil, el ajo, los copos de chile y la sal en un procesador de alimentos y mezcle hasta que quede suave.", "Revuelva la mezcla en la pasta de penne cocida y apile en un plato. Adorne con hojas de albahaca recién cortadas y virutas de trufa blanca."], "url": "www_bbc_co_uk_food_recipes_pennewithchilligarli_88845", "title": "Penne con chile, ajo, hierbas y aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "55g / 2oz de guisantes frescos", "6 tomates cherry, cortados por la mitad", "2 cucharadas de vino blanco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "Pasta penne 150 g / 5½ oz, cocida de acuerdo con las instrucciones del paquete", "4 rebanadas de jamón"], "method": ["Caliente el aceite en una sartén y fría ligeramente los guisantes y los tomates durante 3-4 minutos. Agregar el vino a la sartén, llevar a ebullición, verter la crema y sazonar, al gusto, con sal y pimienta negra recién molida.", "Llevar la salsa a fuego lento y cocinar por 4-5 minutos, luego revuelva a través de la pasta de penne cocida. Rasgue el prosciutto en la pasta y sirva en un tazón de pasta calentado."], "url": "www_bbc_co_uk_food_recipes_penneprosciuttonestw_88842", "title": "Pasta cremosa con tomate cherry y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 puñados grandes de hojas frescas de albahaca", "2 dientes de ajo, pelados", "Queso de oveja 75 g / 2½ oz, rallado, más extra para servir", "3 cucharadas de piñones, tostados", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "125g / 4½oz de pasta fresca de penne"], "method": ["Coloque las hojas de albahaca, el ajo, el pecorino rallado y los piñones en una licuadora y procese, agregando gradualmente el aceite de oliva hasta que la mezcla alcance la consistencia deseada. Sazonar con sal y pimienta negra recién molida.", "Cocine el penne fresco según las instrucciones del paquete y escurra, dejando un poco del líquido de cocción en el fondo de la sartén. Agregue el pesto verde a la pasta caliente y revuelva para cubrir.", "Para servir, espolvorear en un plato para servir y esparcir con pecorino rallado."], "url": "www_bbc_co_uk_food_recipes_pennewithfreshgreenp_88289", "title": "Penne con pesto verde fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["255g / 8oz de gambas peladas cocidas", "200g / 7oz de pasta penne", "mirepoix (verduras finamente picadas) como 1 cebolla, 1 tallo de apio, 1 zanahoria, 1 diente de ajo", "½ pinta de caldo de pescado (compre en la tienda)", "½ vaso de vino blanco", "1 cucharada de puré de tomate", "1 hoja de laurel", "3 cucharadas de crema", "manojo de albahaca fresca", "buen puñado parmesano", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "1 cucharada de harina normal"], "method": ["Cocine el penne durante 8 minutos en agua hirviendo con sal, cuele y mezcle con aceite de oliva.", "Precalentar el aceite de oliva en una sartén y agregar los mirapois de cebolla, apio, ajo y zanahoria y cocinar hasta que esté suave.", "Agregue la harina y revuelva en las verduras.", "Agregue el puré de tomate, la hoja de laurel, el jugo de limón, el vino y reduzca, luego agregue el caldo de pescado. Llevar a ebullición y reducir.", "Pase el líquido por un tamiz y regrese a la sartén.", "Agregue las gambas cocidas y vuelva a hervir y agregue la crème fraîche.", "Agregue el penne de cocinero y luego mezcle la mitad del parmesano y algunas hojas de albahaca rotas.", "Sirva con una pizca de parmesano y un poco de albahaca."], "url": "www_bbc_co_uk_food_recipes_pennewithprawnstomat_65890", "title": "Penne con gambas, tomate y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de penne 125 g / 4½ oz, cocida de acuerdo con las instrucciones del paquete", "1 cucharada de aceite de oliva, más 1 cucharada", "1 limón, jugo y ralladura", "pequeño puñado de cohetes", "Filete de atún fresco de 55 g / 2 oz", "sal marina y pimienta negra recién molida", "½ tomate, picado"], "method": ["Coloque la pasta caliente, el aceite de oliva, el limón y el cohete en un tazón para servir, mezclando los ingredientes.", "Caliente el aceite extra en una sartén a fuego alto. Sazonar el atún, al gusto, con sal y pimienta negra recién molida en cada lado. Coloque el atún en la sartén y fría por dos minutos en cada lado, o hasta que esté cocido a su gusto.", "Retire el atún de la sartén y colóquelo encima de la pasta. Espolvorea el tomate picado sobre la parte superior para servir."], "url": "www_bbc_co_uk_food_recipes_pennewithlemonandroc_84012", "title": "Filete de atún con penne, limón y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de tomates cherry, en la vid", "1 cucharada de aceite de oliva", "1 cebolla roja, pelada, finamente picada", "2 dientes de ajo, pelados, finamente picados", "1 chile rojo, finamente picado", "250g / 9 oz de queso Halloumi, cortado en cubos de 1 cm / ½ en", "400g / 14oz de tomates cherry enlatados", "1 cucharada de hojas de orégano fresco picado", "sal y pimienta negra recién molida", "Penne fresco de 400 g / 14 oz, cocinado según las instrucciones del paquete", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "Hojas de cohete de 75g / 3oz", "1 cabeza de lechuga Little Gem, cortada a la mitad longitudinalmente, hojas separadas, lavadas", "75g / 3oz de lechuga de cordero", "3 cucharadas de parmesano recién rallado (o queso duro vegetariano alternativo)"], "method": ["Para la pasta, caliente una sartén hasta que esté caliente a fuego medio, agregue los tomates cherry frescos y fría por 4-5 minutos, o hasta que se ablanden. Retire de la sartén y reserve.", "Agregue el aceite de oliva, la cebolla roja, el ajo y el chile a la sartén, los tomates se cocinaron y freír durante 2-3 minutos.", "Agregue el queso halloumi y cocine por 1-2 minutos en cada lado, o hasta que estén pálidas doradas en ambos lados. Agregue los tomates cherry enlatados y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 2-3 minutos. Agregue los tomates cherry frescos y el orégano y cocínelos por un minuto más. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la pasta cocida a la sartén y mezcle suavemente hasta que esté bien combinada.", "Para la ensalada, mezcle la mostaza y el vinagre en un bol y mezcle con aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque todas las hojas de ensalada en un recipiente y vierta sobre el aderezo. Revuelva hasta que esté bien combinado.", "Para servir, ponga la pasta en cuatro platos para servir y espolvoree sobre el parmesano rallado. Coloque la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_pennewithhaloumiandc_92783", "title": "Penne con halloumi y tomates cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithhaloumiandc_92783_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 rebanadas de tocino", "175g / 6oz de panceta, cortada en cubos", "250g / 10½oz de pasta fresca de penne", "3 yemas de huevo de gallinas camperas", "Crema doble 110ml / 4fl oz", "175g / 6 oz de queso parmesano, rallado, más virutas de queso parmesano, para servir", "sal y pimienta negra recién molida", "6 cucharadas de perejil de flatillo, más o menos picado", "2 cucharadas de aceite de oliva virgen extra", "3 rebanadas de pan crujiente, cortado en cubos", "4 cucharadas de aceite de oliva virgen extra", "2 lechugas Little Gem, hojas separadas", "1 cucharada de vinagre de vino tinto", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta.", "Para la pasta, coloque las rebanadas de panceta en una bandeja y colóquelas debajo de la parrilla durante 2-3 minutos, o hasta que estén crujientes y doradas.", "Mientras tanto, caliente una sartén hasta que esté caliente. Agregue los cubos de panceta y cocine por 3-4 minutos, hasta que se doren por todas partes.", "Llevar a ebullición una sartén grande de agua con sal y agregar la pasta. Cocine según las instrucciones del paquete o hasta que esté al dente.", "Mientras la pasta se cocina, mezcle las yemas de huevo, la crema y el parmesano recién rallado en un bol. Sazonar bien la mezcla con sal y pimienta negra recién molida, luego agregar el perejil de flatleaf y los cubos de panceta cocidos.", "Escurra la pasta y agregue rápidamente a los huevos y la mezcla de crema. Agregue un poco de aceite de oliva y revise el condimento, agregue más sal y pimienta negra recién molida si es necesario.", "Coloque la pasta y la salsa en tazones y cubra con virutas de parmesano y un poco de pimienta negra recién molida. Sirva con las rebanadas de panceta a la parrilla en la parte superior.", "Para la ensalada, caliente una sartén limpia hasta que esté caliente. Agregue una cucharada de aceite de oliva y los cubos de pan. Freír hasta dorar por todas partes para hacer croûtons.", "Coloque las hojas de Little Gem en una ensaladera grande y agregue los croûtons.", "Batir el aceite de oliva restante y el vinagre juntos en un tazón limpio y sazonar con sal y pimienta negra recién molida.", "Vierta el aderezo sobre la ensalada, mezcle bien para combinar y sirva con la pasta."], "url": "www_bbc_co_uk_food_recipes_pennewithpancettaand_88250", "title": "Pasta Penne con panceta y perejil y ensalada Little Gem", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 paquete de penne", "4 chalotes, picados", "2 dientes de ajo picados", "aceite de oliva", "2 paquetes de pancetta", "1 chile rojo, picado", "2 cabezas de radicchio", "vaso de vino blanco", "150ml / 5fl oz de caldo de verduras", "crema doble pequeña bañera", "ralladura y jugo de 1 limón", "1 cucharada de mascarpone", "puñado de perejil fresco, picado", "virutas de parmesano"], "method": ["Cocine el penne en una sartén grande con agua con sal, drene y vuelva a la sartén.", "Mientras la pasta se está cocinando, sude la cebolla y el ajo suavemente en un poco de aceite hasta que estén suaves y retírelos de la sartén. Suba el fuego y agregue la panceta, el chile y el achicoria. Cocine por unos minutos.", "Agregue el vino, almacene y reduzca, agregue la crema y cocine durante unos minutos más. Agregue el mascarpone, el jugo de limón y la ralladura y mezcle bien.", "Agregue la mezcla de radicchio a la pasta cocida y mezcle bien. Incline en un recipiente, espolvoree con perejil y virutas de queso parmesano y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_pennewithradicchioan_8647", "title": "Penne con achicoria y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de oliva", "1 cebolla, finamente picada", "3 dientes de ajo, finamente picados", "1 chile rojo, sin semillas, finamente picado", "400g de tomates cortados en lata", "salpicar vinagre de vino tinto", "1 cucharada de puré de tomate", "Salsa Tabasco, al gusto", "1 cucharadita de azúcar", "hojas pequeñas de albahaca fresca, rotas", "125 g de mozzarella de búfala fresca, desmenuzada", "Pasta penne seca 400 g / 14 oz, cocida de acuerdo con las instrucciones del paquete, escurrida", "parmesano rallado, para servir", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue la cebolla y fría por 4-5 minutos, o hasta que se suavice y comience a colorear. Agregue el ajo y el chile y continúe freír durante 1-2 minutos.", "Vierta los tomates picados, el vinagre de vino tinto, el puré de tomate, un chorrito de Tabasco (al gusto), el azúcar y la mitad de las hojas de albahaca, y mezcle bien. Condimentar con sal y pimienta.", "Deje que la mezcla hierva a fuego lento, luego continúe cocinando a fuego lento hasta que la salsa se haya espesado y reducido en volumen.", "Justo antes de servir, revuelva la mozzarella desmenuzada en la salsa de tomate. Luego revuelva la pasta drenada en la salsa.", "Divida la pasta y la salsa en partes iguales entre cuatro platos para servir. Espolvorea sobre las hojas de albahaca restantes y el queso parmesano rallado."], "url": "www_bbc_co_uk_food_recipes_pennewithspicytomato_92443", "title": "Penne con salsa picante de tomate y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithspicytomato_92443_16x9.jpg", "isVegetarian": true, "recommendations": 0}]