[{"ingredients": ["Harina normal de 200g / 7oz", "3 cucharadas de aceite de oliva, más extra para engrasar", "3 cucharadas de agua", "2 cucharadas de puré de tomate", "1 cucharada de aceite de oliva", "100 g / 3½ oz de champiñones silvestres", "30g / 1oz de tomates bañados por el sol, picados", "55g / 2oz de queso de cabra, desmenuzado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y engrase una bandeja para hornear.", "Mezcle la harina, el aceite de oliva y el agua en un bol para hacer una masa suave.", "Sobre una superficie limpia y plana, enrolle la masa en un disco delgado y colóquela en la bandeja de hornear engrasada.", "Extienda el puré de tomate sobre el disco de masa.", "Mientras tanto, para el aderezo, caliente el aceite de oliva en una sartén a fuego alto. Agregue los champiñones y el tomate bañado en sol y fría por dos minutos.", "Extienda la mezcla de champiñones sobre la pizza, revuelva sobre el queso de cabra y transfiéralo al horno y cocínelo durante 6-8 minutos, hasta que el queso se derrita y la base esté crujiente y dorada."], "url": "www_bbc_co_uk_food_recipes_goatscheesepizza_84262", "title": "Pizza de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz llano o harina '00', más extra para quitar el polvo", "2 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "1 cucharada de aceite de oliva", "2 pizca de sal", "200 g / 7 oz de espinacas baby, marchitas en una sartén y picado", "150g / 5½oz de queso de cabra suave, desmenuzado", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "100g / 3½oz de mantequilla sin sal", "1 chalote, finamente picado", "10 hojas de salvia picadas", "½ diente de ajo, picado", "algunas ramitas de perejil, picadas", "4 tomates, desollados, sin semillas y finamente picados"], "method": ["Para preparar la pasta, coloque la harina, los huevos enteros, las yemas, el aceite y la sal en un tazón grande y, con las manos, amasar hasta que tenga una masa firme. Cubra con film transparente y colóquelo en la nevera durante al menos 5 horas.", "Mientras tanto, haz el relleno. Mezcle la espinaca picada con el queso de cabra, sazone con sal y pimienta negra recién molida y déjela a un lado.", "Luego haz los raviolis. Cuando la masa ha descansado, coloque la masa en una máquina de pasta hasta que tenga dos grandes formas rectangulares planas, de aproximadamente 60 cm de largo. Siga quitando el polvo con harina para que la masa no se pegue.", "Coloque cucharaditas de la mezcla de espinacas y queso de cabra en la masa a aproximadamente 4 cm / 1 ½ pulgadas de distancia. Esmalte entre cada cucharada de relleno con el huevo batido, luego coloque la segunda hoja de pasta en la parte superior. Presione los bordes de cada cuchara de relleno con los dedos. Usando una rueda de pastelería, corte en cuadrados para crear una forma de raviolis.", "Para cocinar, simplemente coloque los ravioles en agua hirviendo con sal durante 2 minutos. Retire con una espumadera y manténgalo caliente.", "Para la salsa, caliente la mantequilla en una sartén y, cuando comience a formar espuma y se ponga dorada, agregue la chalota, la salvia, el ajo, el perejil y los tomates. Cocine por un minuto o dos y sirva a la vez con los raviolis cocidos."], "url": "www_bbc_co_uk_food_recipes_goatscheeseravioliwi_81002", "title": "Ravioles de queso de cabra con salvia y salsa de tomate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo deshuesadas y sin piel", "1 queso de cabra suave recubierto de romero", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "1 queso de cabra Crotin (un pequeño disco semi-firme de queso de cabra), en rodajas", "1 pimiento rojo, descuartizado", "1 calabacín, cortado en tiras finas", "1 berenjena, cortada en rondas de 5 mm / ¼ de grosor", "200g / 7oz de papas nuevas para bebé, hervidas, cortadas por la mitad"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Use un cuchillo afilado para cortar un bolsillo en el costado de cada pechuga de pollo.", "Cortar el queso de cabra suave y presionar en el bolsillo en las pechugas de pollo. Sazonar el pecho con sal y pimienta negra recién molida.", "Caliente una cucharada de aceite de oliva en una sartén a prueba de horno a fuego medio. Cuando el aceite esté caliente, agregue las pechugas de pollo, con la cara de presentación hacia abajo y fría hasta que estén doradas. Gire los senos y cocine por otros dos minutos en el otro lado, luego transfiera la sartén al horno y tueste durante 15 minutos.", "Retire la sartén del horno y cubra con el queso de cabra restante y vuelva al horno para cocinar durante otros cinco minutos, hasta que el pollo esté completamente cocido y el queso se haya derretido.", "Mientras tanto, caliente una sartén hasta que fume.", "Coloque el pimiento rojo, el calabacín y las rodajas de berenjena en un tazón con las dos cucharadas restantes de aceite de oliva y sazone con sal y pimienta negra recién molida. Coloque las verduras en la sartén de la plancha y cocine durante cinco minutos, o hasta que estén tiernas, volteándolas una vez.", "Para servir, coloque las pechugas de pollo en dos platos con un montón de verduras a la parrilla y algunas papas cocidas al lado de cada una."], "url": "www_bbc_co_uk_food_recipes_goatscheesestuffedch_84592", "title": "Pechuga de pollo rellena de queso de cabra con verduras asadas y papas hervidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 50 g / 2 oz de queso de cabra (Crottin Chavignol pero puedes usar cualquiera)", "50 g / 2 oz de almendras molidas", "200 g / 7 oz de pan blanco, no necesita ser fresco", "1 huevo, golpeado", "200ml / 7fl oz de leche entera", "Harina normal de 50g / 2oz", "2 peras enteras", "250ml / 8fl oz de vino tinto", "Puerto de 250 ml / 8 fl oz", "1 ramita de tomillo", "¼ diente de ajo", "Anís de 2 estrellas", "½ ramita de canela", "2 granos de pimienta negra", "1 diente", "250 ml / 8 fl oz de agua", "250ml / 8fl oz de azúcar", "100ml / 3½ fl oz de aceite de nuez", "45ml / 1¾oz de vinagre de vino blanco", "100ml / 3½fl oz de aceite de arachida, o aceite de maíz", "sal y pimienta para probar", "20 g / 1 oz hojas mixtas", "1 cucharadita de cebollines picados", "1 cucharadita de chalotes picados", "Necesitarás una freidora para esta receta."], "method": ["Para hacer el queso de cabra, pele la corteza exterior del queso de cabra.", "Mezcle las almendras molidas y las migas de pan juntas.", "Mezcle el huevo y la leche para hacer un lavado de huevos.", "Enrolle el queso de cabra en la harina, luego lave los huevos y luego en la mezcla de almendras y migas de pan repita esto dos veces y luego refrigere. Dos capas evitarán que el queso se rompa al freírse.", "Para hacer el chutney de pera, pele las peras y déjelas enteras.", "Coloque el puerto en una bandeja pequeña y reduzca hasta que se vuelva almibarado.", "Agregue vino tinto, especias, hierbas y ajo y reduzca a la mitad.", "Agregue el jarabe común (granos de pimienta negra, clavo de olor, agua y azúcar que ya han sido mezclados) y lleve a ebullición.", "Coloque las peras en la mezcla y cocine hasta que estén suaves. Inserte un cuchillo en las peras y si no hay resistencia, se cocinan (aproximadamente 5 minutos).", "Permita que las peras se enfríen en el almíbar. Lo mejor es hacer 1 día de antelación para maximizar el sabor.", "Para el aderezo de nuez, mezcle todos los ingredientes.", "Sazone al gusto con sal y pimienta.", "Coloque el queso de cabra en una freidora caliente [aproximadamente 170 grados] hasta que esté dorado, luego, en un horno caliente precalentado durante aproximadamente 3 minutos. Esto sellará el queso y evitará que se rompa.", "Ponga las peras en cubos y colóquelos cuidadosamente en el plato. Cubra con queso de cabra y hojas de ensalada mezcladas con los chalotes picados, el cebollino y el aderezo de nuez."], "url": "www_bbc_co_uk_food_recipes_goatscheeserolledonb_10171", "title": "Queso de cabra laminado en migas de pan y almendras molidas (masculin de Crottin de Chavignol)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de pan rallado", "50g / 1¾oz de perejil fresco", "100ml / 3½ fl oz crema doble", "100g / 3½oz de queso de cabra", "½ cucharadita de pimienta negra recién molida", "pizca de pimentón", "Tallarines de 150 g / 5½ oz, cocidos de acuerdo con las instrucciones del paquete", "150g / 5½ oz de rape, picados en cubos grandes", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las migas de pan y el perejil en un procesador de alimentos y mezcle.", "Mientras tanto, coloque la crema doble en una cacerola pequeña a fuego medio y cocine a fuego lento.", "Agregue el queso de cabra, pimienta negra y pimentón a la crema y continúe hirviendo a fuego lento para derretir el queso y espesar la salsa.", "Coloque los tagliatelle cocidos y los pedazos de rape en un tazón grande. Vierta la crema y la salsa de queso y mezcle.", "Vierta la salsa y los tallarines en un plato resistente al horno. Espolvorear con las migas de pan de perejil y colocar en el horno para hornear durante cinco minutos, o hasta que la parte superior se ponga dorada.", "Retire del horno y sirva en el plato refractario."], "url": "www_bbc_co_uk_food_recipes_goatscheesetagliatel_80182", "title": "Tallarines de queso de cabra con pan rallado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g / 14 oz de hojaldre", "2 manzanas cocinadas", "2 peras", "2 limas, solo jugo", "225g / 8oz de queso de cabra (chèvre en forma de tronco)", "1 clara de huevo", "1 cucharadita de leche", "1 chile rojo fresco", "1 cucharada de azúcar", "1 cucharada de aceite de oliva", "sal y pimienta recién molida", "ensalada verde"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Estirar la masa de hojaldre a un rectángulo un poco más grande que una hoja de papel A4.", "Coloque la masa en una bandeja para hornear engrasada, cubra y refrigere durante 30 minutos.", "Pelar, cortar y cortar finamente las manzanas y las peras y mezclar con la mitad del jugo de lima.", "Con un cuchillo caliente, húmedo y afilado, corte el chèvre por la mitad a lo largo.", "Corta finamente el chèvre en finas formas de media luna.", "Batir juntos la clara de huevo y la leche.", "Tome el rectángulo de hojaldre y cepille la mezcla de clara de huevo alrededor de sus bordes.", "Coloque rebanadas alternas de manzana y pera en líneas ordenadas sobre el rectángulo, dejando un espacio de 2 cm (¾in) de masa alrededor del borde.", "Coloque las rebanadas de chèvre para que se superpongan con las rebanadas de fruta.", "Hornee la tarta de fruta durante 15-20 minutos hasta que la masa esté crujiente, la fruta esté dorada y el queso de cabra se haya dorado.", "Mientras tanto, usando un mortero y una maja, muela juntos el chile y el azúcar para formar una pasta.", "Mezcle bien el jugo de lima restante, el aceite de oliva, la sal y la pimienta recién molida.", "Una vez que la tarta esté cocida, retírela del horno y déjela reposar durante cinco minutos.", "Rocíe el aderezo de lima y sirva con una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_goatscheesepearandap_73222", "title": "Queso de cabra, pera y tarta de manzana con ají", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 hojas de pasta de filo con mantequilla", "aceite de oliva", "1 cucharadita de tomillo", "1 cucharadita de mejorana", "1 diente de ajo", "Queso cheddar de queso de cabra de 85g / 3oz (un queso duro como el cheddar) - cortado en cubos de 1cm / in", "Condimento"], "method": ["Coloque las hojas sobre una superficie húmeda para evitar que se seque. Cortar en un rectángulo.", "Coloque el queso, las hierbas y el aceite en un recipiente y mezcle.", "Coloque la mezcla en el centro del rectángulo y enrolle en forma de rollo de primavera.", "Gire ambos extremos para hacer una forma de galleta.", "Cepíllese con aceite y hornee en un horno a 200C / 400F / Gas 6 durante 4 minutos hasta que estén crujientes."], "url": "www_bbc_co_uk_food_recipes_goatscheeseparcels_65618", "title": "Parcelas de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento rojo, sin semillas y reducido a la mitad", "1 pimiento amarillo, sin semillas y reducido a la mitad", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 calabacín, rebanado aproximadamente 0.5cm / ¼ de espesor", "1 berenjena pequeña, en rodajas de aproximadamente 0.5cm / ¼ de grosor", "pequeño puñado de albahaca fresca, picada", "1 cucharada de vinagre balsámico", "4 rebanadas de pan blanco del país", "aceite de oliva, para cepillar", "registro de queso de cabra, cortado en cuatro pedazos", "sal y pimienta negra recién molida, al gusto"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Para las verduras, forre una bandeja para hornear con papel de aluminio, coloque los pimientos en la bandeja, rocíe con una cucharada de aceite de oliva y sazone con sal y pimienta negra recién molida. Asar en el horno durante 20 minutos, luego quitar los pimientos del horno y dejar enfriar. Una vez que se haya enfriado, pele y pique en tiras.", "Calentar el aceite de oliva restante en una sartén y freír el calabacín y la berenjena durante unos minutos, sazonar con sal y pimienta negra recién molida.", "En un tazón, mezcle los pimientos, los calabacines y las berenjenas con la albahaca picada y el vinagre balsámico.", "Precalentar una parrilla a fuego medio.", "Para la tostada, cepille el pan rebanado con aceite de oliva y tueste el pan en ambos lados debajo de la parrilla. Coloque una cucharada grande de la mezcla de vegetales en la tostada y luego cubra con queso de cabra. Regrese a la parrilla hasta que el queso de las cabras comience a derretirse y se ponga dorado."], "url": "www_bbc_co_uk_food_recipes_goatscheesetoastiewi_86533", "title": "Queso tostado de cabra con berenjenas, pimientos y calabacines", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas de baguette, frotado con aceite de oliva", "4 rebanadas de tocino rayado, a la parrilla hasta que estén crujientes", "1 cucharada de aceite de oliva, más extra, para servir", "¼ de cebolla, finamente picada", "75g / 2½ oz de espinaca", "1 cucharadita de hojuelas de chile", "sal y pimienta negra recién molida", "100g / 3½oz de queso de cabra"], "method": ["Caliente una sartén de plancha y pásele las rebanadas de baguette hasta que estén doradas por ambos lados. Coloque una rebanada en un plato de servir y cubra con el tocino. Coloque la segunda rebanada de baguette en la parte superior.", "Caliente el aceite de oliva en una sartén, agregue la cebolla y fríela suavemente hasta que se ablande.", "Agregue los copos de espinaca y chile y sazone bien con sal y pimienta negra recién molida. Cocine, revolviendo frecuentemente, durante 1-2 minutos, o hasta que la espinaca se haya marchitado. Retirar del fuego y drenar el exceso de agua.", "Coloque la espinaca encima de la baguette en el plato de servir. Cubra con la tercera rebanada de baguette a la parrilla.", "Calentar una sartén y freír el queso de cabra durante 2-3 minutos en cada lado, o hasta que comience a derretirse.", "Coloque el queso de cabra en la parte superior de la torre y use un mini soplete para dorar por todas partes.", "Para servir, rocíe con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_goatscheesetowerwith_85628", "title": "Torre de queso de cabra con tocino y espinacas picantes salteadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 cebolla, más o menos picada", "1 diente de ajo, picado", "5 cabezas de achicoria finamente cortadas", "2 naranjas, cáscara y jugo solamente", "150 g / 5¼ oz de azúcar en polvo", "250ml / 8 3 / 4fl oz de vino blanco seco", "4 pequeñas rondas de queso de cabra", "4 rebanadas de pan blanco, ligeramente tostado", "20g / 3 / 4oz de mantequilla", "1 manzana, pelada y cortada en cuñas", "Remolacha cocida de 75g / 2½oz cortada en rodajas", "Ensalada de rúcula 50g / 1 3 / 4oz", "Mitades de nuez 25g / 1oz", "2 cucharadas de vinagreta"], "method": ["Caliente una cacerola grande de base pesada hasta que esté caliente, luego agregue la mantequilla.", "Agregue la cebolla y el ajo y fría por 2-3 minutos. Agregue la achicoria y los ingredientes restantes. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 45 minutos, revolviendo ocasionalmente, hasta que esté espeso y caramelizado.", "Precalentar la parrilla hasta que esté caliente.", "Coloque el queso de cabra en la tostada y la parrilla hasta que estén doradas y burbujeantes.", "Calentar una sartén hasta que esté caliente, luego agregar la mantequilla y la manzana y saltear hasta que estén doradas. Dejar de lado y genial.", "Para servir, coloque la mermelada en el centro de un plato de servir. Cubra con tostadas de queso de cabra. Coloque la manzana, la remolacha, las nueces y las hojas de rúcula alrededor.", "Rocíe la vinagreta sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_goatscheesewithchico_83705", "title": "Queso de cabra con naranja de achicoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 rebanadas de jamón de Parma", "1 rebanada gruesa de queso de cabra", "½ cucharada de aceite de oliva", "puñado de perejil fresco de cilantro, perifollo y flatleaf, solo hojas, para servir"], "method": ["Coloque las rodajas de jamón de Parma en un tablero para que se superpongan ligeramente y coloque el queso en el centro. Doble el jamón de Parma alrededor del queso para encerrarlo por completo.", "Calentar el aceite en una sartén pequeña y freír el paquete durante 2-3 minutos en todos los lados, o hasta que esté crujiente y dorado por todas partes.", "Para servir, coloque las hierbas en el centro de un plato para servir y cubra con el paquete de queso."], "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_87235", "title": "Queso de cabra envuelto en jamón de Parma con ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Queso de cabra redondo de 100 g / 4 oz, sin corteza, cortado a la mitad", "4 rebanadas de tocino", "½ pera, sin corazón, picada", "½ cebolla, picada", "1 cucharada de perejil fresco picado", "1 cucharada de aceite de oliva", "1 cucharada de vinagre balsámico", "25g / 1oz de mantequilla", "½ pera, en rodajas", "2 cucharadas de aceite de oliva", "1 cucharadita de mostaza integral", "½ limón, solo jugo", "sal marina y pimienta negra recién molida", "puñado de berros"], "method": ["Envuelva las mitades de queso de las cabras con la panceta.", "Caliente una sartén a fuego medio a alto. Coloque el queso de cabra en la sartén y fríalos durante dos minutos por cada lado, hasta que estén dorados.", "Para el chutney de pera, coloque todos los ingredientes de chutney en una cacerola a fuego medio y cocine a fuego lento durante diez minutos.", "Para la ensalada de pera, derrita la mantequilla en una sartén pequeña. Agregue las peras y fría a fuego medio a alto durante cinco minutos, volteándolas de vez en cuando, hasta que se doren por todas partes.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón limpio y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca el berro en un plato y vierte sobre el aderezo. Cubra con las peras fritas y el queso de cabra y sirva la salsa picante en un tazón al lado."], "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_84037", "title": "Queso de cabra envuelto en panceta con chutney de pera y peras fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "1 coliflor, hojas removidas y cortadas en florecillas", "3 cucharadas de harina de garbanzo (harina de gramo)", "4 cucharadas de harina de maíz", "1 cucharada de pasta de chile", "½ cucharada de hojas frescas de curry picado", "½ cucharada de sal masala", "8 hojas frescas de curry, para adornar", "2 chiles verdes, en rodajas, para adornar", "½ cucharadita de comino molido", "½ cucharadita de semillas de mostaza negra", "1 chile verde", "1 cucharada de nueces de anacardo, rotas", "1 pepino, rallado", "150ml / 5fl oz de yogur natural de espesor", "Harina normal de 250g / 9oz, más extra para espolvorear", "1 cucharadita de sal", "1 cucharada de aceite de oliva"], "method": ["Para la coliflor frita, llene una freidora o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Caliente una olla grande de agua hirviendo con sal y pula la coliflor durante 2-3 minutos. Escurrir bien y dejar reposar.", "Coloque las harinas en un tazón grande y agregue la pasta de chile, hojas de curry picadas y garam masala. Mezcle y agregue suficiente agua fría para obtener una consistencia suave.", "Sumerja la coliflor blanqueada en la masa y fríela durante 2 minutos o hasta que se dore. Déjelo a un lado para drenarlo en el rollo de la cocina y manténgalo caliente hasta que esté listo para servir. (Mantenga caliente la freidora para freír la guarnición en el último minuto).", "Para la ensalada, en una sartén seca a fuego medio, tueste el comino, las semillas de mostaza, el chile verde y las nueces durante 2 o 3 minutos, teniendo cuidado de no quemarlas.", "Coloque el pepino rallado en una toalla de té limpia y exprima el agua. Coloque el pepino en un recipiente con el yogur y mezcle las especias y las nueces tostadas.", "Para los panes planos, mezcle la harina y la sal en un tazón grande. Agregue el aceite y vuelva a mezclar. Poco a poco agregue suficiente agua para formar una masa y amasar hasta que quede suave. Divide en 8 bolas. En una superficie enharinada, extenderlos en panes redondos.", "En una sartén seca a fuego medio, cocine cada pan plano durante 2-3 minutos en ambos lados o hasta que esté bien cocido.", "Justo antes de servir, freír las hojas de curry y cortar en rodajas los chiles verdes.", "Para servir, coloque la coliflor frita en un plato de servir y cubra con la ensalada. Sirva los panes planos en el lado."], "url": "www_bbc_co_uk_food_recipes_gobie_65_goan_street_32808", "title": "Gobi 65", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gobie_65_goan_street_32808_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 110g / 4oz, más extra para espolvorear", "60 g / 2½ oz de mantequilla", "6 albaricoques secos y listos para comer, picados", "30 g / 1 oz de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "uvas sin semillas, para servir (opcional)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con papel para hornear.", "En un tazón, frote la harina y la mantequilla con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado.", "Agregue los albaricoques y el azúcar.", "Poco a poco agregue el huevo batido y revuelva hasta que la mezcla se una como una masa suave. Si la mezcla se vuelve muy pegajosa, agregue un poco más de harina.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada. Córtalo en seis pedazos de igual tamaño y enrolle cada uno en una bola. Coloque las bolas en la bandeja de horno preparada.", "Hornee los bollos en el horno durante 15-20 minutos, o hasta que estén dorados en la parte superior y cocinados (una broche insertada en el centro de cada uno debe salir limpia). Dejar de lado para enfriar, luego comer con uvas, si lo desea."], "url": "www_bbc_co_uk_food_recipes_gold_digger_buns_07011", "title": "Panecillos de oro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 120g / 4oz", "50 g / 1 oz de azúcar en polvo", "120g / 4oz de mantequilla", "50 g / 1 oz de sémola", "24 unidades de dulces de chocolate con mantequilla", "75 g / 2 oz de chocolate negro", "polvo de brillo de oro"], "method": ["Precaliente el horno a 160 ° C / 310 ° F / Gas 2 y engrase ligeramente una bandeja para hornear.", "Coloque todos los ingredientes para la base en un procesador de alimentos y mezcle. Enharina ligeramente una superficie lisa, luego retire la masa y amasar ligeramente hasta que quede suave. Déjalo reposar en la nevera durante 30 minutos.", "En una superficie ligeramente enharinada, extienda la masa hasta un grosor de aproximadamente 5 mm / ¼ in. Corta rondas de 12 x 6 cm / 2 pulgadas y colócalas en la bandeja para hornear. Pinchar dos veces con un tenedor. Si desea enhebrar sus medallas de oro, use una pajita para hacer un agujero en cada galleta.", "Hornee durante aproximadamente 30-40 minutos hasta que estén dorados y firmes. Dejar de lado para enfriar.", "Una vez que los bizcochos se hayan enfriado. Ablande dos piezas de dulce de azúcar (esto puede hacerse masajeando el dulce de azúcar a mano o calentándolo en ráfagas de 10 segundos en un microondas), amase en una bola y ruede o palmee en un círculo del mismo tamaño que los bizcochos. Presione sobre la superficie del shortbread y déjelo reposar en una bandeja durante 30 minutos. Repita para los bizcochos restantes.", "Rompa el chocolate en trozos pequeños y colóquelo en un tazón sobre una fuente de agua hirviendo a fuego lento (no permita que el recipiente toque el agua). Derretir el chocolate, revolviendo con poca frecuencia, hasta que quede suave. Dejar enfriar un poco. Vierta el chocolate sobre los bizcochos hasta que estén completamente cubiertos. Ponga a un lado hasta que el chocolate se haya solidificado, luego cepille el chocolate con el brillo dorado."], "url": "www_bbc_co_uk_food_recipes_gold_millionaire_96516", "title": "Tortas de oro millonarias", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gold_millionaire_96516_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 chiles verdes, sin semilla y toscamente picados", "4 chiles verdes, 1 más o menos picados y 3 restantes enteros", "150g / 5½ oz chalotes, pelados y más o menos picados", "2 dientes grandes de ajo, toscamente picados", "25 g / 1 oz de jengibre fresco, pelado y más o menos picado", "15 g / ½ oz de cúrcuma fresca, pelada y picada, o 1 cucharadita de cúrcuma molida", "2 cucharadas de aceite vegetal", "1 tallo de limoncillo, cortado y magullado", "1 x 400 ml de leche de coco de estaño", "2 cucharaditas de copos de sal marina", "2 cucharaditas de pasta de tamarindo", "4 huevos grandes de gallinas camperas, a temperatura ambiente", "arroz o panes planos (o ambos), para servir"], "method": ["Mezcle los 2 chiles verdes y 1 chile verde picada, chalotes, ajo, jengibre y cúrcuma con una batidora o un mini procesador de alimentos.", "Caliente el aceite en un wok de base pesada o una sartén de tamaño similar con una tapa, agregue la pasta y la hierba de limón y fría con cuidado, revolviendo con frecuencia, durante 5 minutos, hasta que la pasta esté cocida y ablandada.", "Agregue la leche de coco, la sal y el tamarindo con 100 ml / 3 ½ l de agua recién hervida. Haga un par de pequeñas incisiones en cada uno de los 3 chiles enteros con la punta de un pequeño cuchillo afilado y agregue a la sartén. Encienda el fuego para llevarlo a punto de ebullición, luego reduzca el fuego y cocine a fuego lento durante unos 7 minutos, revolviendo frecuentemente, hasta que la salsa se haya cocinado y reducido a una sopa dorada espesa.", "Agriete los huevos en la salsa, cúbralos con una tapa y déjelos hervir a fuego lento durante aproximadamente 4 minutos, o hasta que los blancos estén cocidos pero las yemas todavía estén líquidas, o cocínelas por más tiempo si desea yemas bien cocidas.", "Divida entre dos cuencos, tratando de sacar la mayor parte de la salsa de la sartén primero. Sirva con arroz, panes planos o ambos."], "url": "www_bbc_co_uk_food_recipes_golden_egg_curry_00708", "title": "Curry de huevo dorado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_egg_curry_00708_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["16 bolas de masa listas para cocinar", "75g / 2½oz de queso crema con toda su grasa", "sal y pimienta negra recién molida, al gusto", "1 cucharada de cebolletas frescas picadas", "1 cucharada de perejil fresco picado", "3 cucharadas de chutney de mango"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y alinee una bandeja de hornear con papel antiadherente o papel de aluminio.", "Rebana cada bola de masa por la mitad horizontalmente. En las bandejas para hornear, coloque las medias bolas de masa sobre la parte redondeada con el lado cortado hacia arriba. Es posible que deba cortar una pequeña pieza de la base redondeada para que quede plana en la bandeja sin volcarse.", "Mezcle el queso crema con sal, pimienta, cebollín y perejil y distribuya la mezcla de queso sobre el lado plano de cada bola, extendiéndose hasta los bordes. Coloque una pequeña porción de chutney de mango en la parte superior.", "Hornee durante unos 10-12 minutos o hasta que estén dorados y calientes.", "Arregle en un plato plano y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_golden_dough_balls_with_70562", "title": "Bolas de masa dorada con queso y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 32 sofás", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_dough_balls_with_70562_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de jarabe de oro", "4 cucharadas de miel líquida", "150g / 5oz de mantequilla salada", "Avena de avena 150g / 5oz", "100g / 3½oz de coco desecado", "75g / 2¾oz de guindas", "75g / 2¾oz de mango seco, picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase una bandeja de horno profunda de tamaño mediano. (El tamaño de la bandeja dependerá del grosor de los flapjacks).", "En una cacerola grande, derrita el jarabe dorado, la miel y la mantequilla a fuego lento, revolviendo hasta que estén bien combinados.", "Retire la sartén del fuego y agregue la avena, el coco, las cerezas y el mango.", "Vierta la mezcla de flapjack en la bandeja preparada y presione suavemente hacia abajo en las esquinas de la lata. Hornee durante 25-30 minutos, o hasta que estén doradas en la parte superior.", "Califique el panqueque en trozos cuando aún esté caliente y déjelo enfriar en la lata antes de cortarlo y cortarlo por completo."], "url": "www_bbc_co_uk_food_recipes_goldenflapjackswithm_93620", "title": "Flapjacks dorados con mango, guindas y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goldenflapjackswithm_93620_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 hojas de menta fresca", "1 rodaja de limón", "2 cucharaditas de jarabe de azúcar (vendido como jarabe Gomme)", "Ron de oro de 50ml / 2fl oz", "1 cucharada de jugo de limón", "ginger ale, para recargar", "ramita de menta fresca, para adornar"], "method": ["Coloque las hojas de menta, la rodaja de limón y el jarabe de azúcar en una coctelera y mastique con el extremo de un rodillo.", "Agregue un puñado de hielo y mezcle bien.", "Agregue el ron y el jugo de limón y mezcle bien.", "Rellene con ginger ale y decore con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_goldenmojito_89969", "title": "Mojito dorado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de vino de arroz Shaoxing o jerez seco", "1 cucharada de jengibre fresco de raíz pelado y rallado", "1 cebolleta pequeña, finamente picada", "Filetes de abadejo de 340g / 12oz, cortados en tiras", "1 cucharada de chiles secos triturados", "1 cucharadita de sal marina", "1 cucharadita de pimienta blanca", "100g / 3½oz de pan rallado seco", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas, golpeados", "aceite de maní, para freír", "2 cucharadas de jugo de limón", "2 cucharadas de salsa hoisin", "1 cucharada de salsa de soja oscura", "1 cucharadita de hojuelas de chile secas trituradas", "1 cucharada de harina de maíz, mezclada con 2 cucharadas de agua fría, para espesar"], "method": ["Para los goujons de eglefino, mezcle el vino de arroz Shaoxing, el jengibre rallado y la cebolla picada juntos en un recipiente poco profundo y agregue las tiras de pescado. Cubra con film transparente y déjelo marinar en la nevera durante 20 minutos.", "Mezcle los chiles secos, la sal marina y la pimienta blanca junto con las migas de pan en un tazón, luego incline sobre un plato o bandeja. Sumerja las tiras de pescado marinado en la harina, luego en el huevo batido, luego ruede en la mezcla de pan rallado sazonado. Pat ligeramente para asegurar el pan rallado al pescado, luego sacuda el exceso. Repita con todas las tiras de pescado.", "En cuarto-llene un wok con aceite de cacahuate y caliente hasta que un pequeño cubo de pan caiga en chispas y se vuelva dorado en 15 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido.) Agregue los goujones de pescado en pequeños lotes y fríalos durante 2-3 minutos, o hasta que estén dorados, luego retírelos con una espumadera y escurra sobre papel de cocina. Repita con los goujons de pescado restantes.", "Para la salsa gong bao, caliente todos los ingredientes de la salsa en una cacerola pequeña y, si es necesario, espese con la mezcla de harina de maíz y agua. Retire del fuego y transfiera a un tazón pequeño o molde para mojar.", "Para servir, apile los goujons de pescado en un plato para servir y coloque el tazón de gong bao en un lado. Servir inmediatamente con cuñas de batata asada."], "url": "www_bbc_co_uk_food_recipes_gongbaohaddockgoujon_89278", "title": "Gong bao eglefino goujons", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]