[{"isVegetarian": false, "title": "15 minutos de pasta", "url": "www_bbc_co_uk_food_recipes_15_minute_pasta_33407", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/15_minute_pasta_33407_16x9.jpg", "ingredients": ["Pasta de penne 350g / 12oz", "2 x 80 g / 3 oz paquetes de jamón de Parma, fragmento en trozos pequeños", "250 g / 9 onzas de hongos castaños pequeños, cortados por la mitad o en cuartos", "200g / 7oz de crema entera en grasa", "100 g / 3½ oz de queso parmesano, rallado", "2 cucharadas de perejil picado", "sal y pimienta para probar", "ensalada verde", "pan crujiente"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine la pasta en una sartén con agua salada hirviendo según las instrucciones del paquete. Drenar y reservar", "Calentar una sartén hasta que esté caliente. Agregue las piezas de jamón de Parma y fría hasta que estén crujientes, retire la mitad del jamón en un plato y déjelo a un lado. Agregue los champiñones a la sartén y fría por dos minutos. Agregue la crème fraîche y deje que hierva. Agregue la pasta, el parmesano y el perejil y revuelva sobre el fuego. Sazonar bien con sal y pimienta.", "Sirve con ensalada verde y pan crujiente."]}, {"isVegetarian": true, "title": "Galletas 3D", "url": "www_bbc_co_uk_food_recipes_3d_biscuits_29555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/3d_biscuits_29555_16x9.jpg", "ingredients": ["200g / 7oz de mantequilla suave sin sal", "200 g / 7 oz de azúcar en polvo", "1 cucharadita de esencia de vainilla", "1 huevo de gallinas camperas, ligeramente golpeado", "Harina simple de 400g / 14oz, más extra para quitar el polvo", "1 huevo blanco de corral", "250 g / 9 oz de azúcar glas", "colorante de alimentos, si usa", "glaseado listo para enrollar, en colores de su elección, para decorar las galletas"], "serves": "Hace alrededor de 25 galletas medianas o 12 grandes", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la masa básica, forre una bandeja para hornear con un pergamino para hornear (es posible que necesite dos bandejas para hornear o, como alternativa, cocine los bizcochos por lotes).", "En un tazón, use una cuchara de madera o un mezclador para untar la mantequilla, el azúcar y la esencia de vainilla hasta que quede cremoso. No trabaje demasiado la mezcla en esta etapa. Batir el huevo hasta que esté bien combinado.", "Agregue la harina y mezcle a baja velocidad hasta que se forme una masa. En el cuenco, usa tus manos para amasar suavemente la masa en forma de bola. Envuélvala en una película adhesiva y refrigérela durante al menos una hora.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada a una profundidad de aproximadamente 5 mm, si es posible use espaciadores para lograr un grosor uniforme. Corta las formas deseadas. Para las galletas de pato: use un cortador en forma de pato y un cortador redondo para la base (la base debe ser aproximadamente del mismo tamaño que el pato). Para las galletas de árbol: corte dos formas simples de árbol usando un cortador o una plantilla y corte una forma de árbol por la mitad verticalmente. Para las galletas de mariquita: corte dos rondas, una ligeramente más pequeña que la otra (aproximadamente 5 cm / 2 pulgadas y 3 cm / 1 pulgadas). Para las galletas de cordero: use un cortador o una plantilla para cortar dos formas de cordero para cada galleta terminada y corte dos formas de patas adicionales por separado (para cada galleta de cordero terminada debe tener dos formas de cordero y dos formas de pierna). Para las galletas para sentarse: corte a una persona de pan de jengibre de la masa y luego córtele las piernas. Corte alrededor de 2 mm de alrededor de los bordes de las piernas y corte dos ranuras de la parte inferior del cuerpo de pan de jengibre, alrededor de la profundidad de las patas (las piernas se colocarán aquí una vez al horno). También corte dos óvalos pequeños para los pies.", "Transfiera las formas a la bandeja para hornear con una espátula y vuelva a enfriar durante aproximadamente 30 minutos. (Esto es importante para evitar que las galletas pierdan su forma cuando se hornean).", "Precalentar el horno a 180C / 350F / Gas 4.", "Hornee los bizcochos durante 6-10 minutos, dependiendo del tamaño, hasta que estén ligeramente dorados en los bordes. Transfiera a una rejilla para que se enfríe por completo.", "Para la guinda, batir ligeramente la clara de huevo en un tazón grande. Agregue el azúcar glas y mezcle lentamente al principio para evitar una nube de azúcar glas. Una vez combinado, bate o bate durante unos cinco minutos si usas un batidor eléctrico o un batidor, o durante más tiempo si usas una cuchara de madera. Continúe batiendo hasta que los ingredientes formen una pasta espesa y suave de color blanco brillante. Si está usando colores, separe la formación de hielo en varios tazones y coloree según corresponda.", "Para decorar los bizcochos de pato, despliegue finamente el glaseado amarillo listo para enrollar y cubra las formas del pato. Pipe en cualquier decoración deseada para los ojos, los picos y las alas. Coloque una rejilla sobre un recipiente que lo mantendrá a una altura adecuada para apoyar la galleta de pie. Use la técnica de inundación para congelar los círculos de galletas (consulte el paso 10 para obtener más información) para representar un estanque. Mientras que la formación de hielo todavía está húmeda, coloque la galleta redonda debajo del borde de la rejilla de alambre. Coloca la galleta de pato en posición sobre el glaseado húmedo de la ronda, usando la rejilla como soporte para mantenerla en posición vertical. Deje que la formación de hielo se establezca por completo antes de retirar cuidadosamente la rejilla de soporte.", "Para inundar el hielo de las galletas, trace un contorno alrededor del borde de la galleta utilizando una boquilla fina o cortando el extremo de una bolsa desechable. Deje que la formación de hielo por unos minutos. Para las inundaciones, la formación de hielo debe ser un poco más rápida, así que agregue algunas gotas de agua. Pase una cucharada o una cuchara con la cantidad suficiente de hielo congelado en el centro de la forma helada para llenarlo por completo; no se preocupe por si está limpio en este momento. Use un palillo de dientes para extender la formación de hielo uniformemente dentro de la \\\"pared\\\" de hielo duro. Si la superficie del glaseado no es plana, agite suavemente la galleta hacia adelante y hacia atrás hasta que tenga una cobertura suave.", "Para decorar las galletas de árbol, vierta una línea de glaseado verde alrededor del borde y cubra las galletas usando el método de inundación descrito en el paso 10. Una vez que la formación de hielo esté completamente seca, use un poco de hielo para pasar un zig zag por el borde desnudo de cada mitad de un árbol y colóquelos en el centro de los árboles. Repita en la parte posterior de la galleta con las mitades de los árboles restantes. Puede que tenga que sostener los medios árboles en su lugar mientras se pone la formación de hielo.", "Para decorar las galletas de mariquita, cepille las rondas con agua hervida enfriada y cubra la ronda más grande con un círculo de glaseado listo para enrollar rosado o rojo y el más pequeño con glaseado blanco listo para enrollar. Una la ronda blanca a la base con una bola pequeña de hielo listo para rodar e inclina en un ángulo. Termine de decorar la mariquita pegando una cara y manchas en negro glaseado.", "Para decorar las galletas de cordero, glasee la mitad de los cuerpos de los corderos usando la técnica de inundación en el paso 10, manteniendo las patas libres de hielo. Una vez que la guinda esté seca, extiende una galleta de cordero sin decorar con glaseado y sándwich en la parte posterior de la galleta decorada. Ponga un poco de glaseado en la parte posterior de las patas de cordero individuales y péguelas sobre las patas de cordero para dar un efecto 3D. Cuando la formación de hielo está seca, los bizcochos deben levantarse sin soporte. Si lo desea, decore las piernas del cordero con glaseado.", "Para decorar los bizcochos para sentarse, decore los bizcochos como desee. Coloque las patas hacia los lados en las ranuras precortadas para que la persona se siente con las piernas estiradas frente a ellas. Coloque los pies en la parte inferior de las piernas con hielo y déjelos secar."]}, {"isVegetarian": true, "title": "Helado de cuajada de limón", "url": "www_bbc_co_uk_food_recipes_3wayswithlemoncurd_67266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Crema doble de 290 ml / ½ pinta", "1 jarra (340g / 12oz) de cuajada de limón", "½ limón, jugo y ralladura"], "serves": "Hace 290 ml / ½ pinta", "time": {"preparation": "más de 2 horas", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Batir la crema hasta que se disuelva, luego batir en la cuajada de limón junto con el jugo de limón y la ralladura.", "Untar en un plato para servir y congelar durante al menos cuatro horas."]}, {"isVegetarian": false, "title": "Costilla de ternera con costra de mostaza y tomillo", "url": "www_bbc_co_uk_food_recipes__81487", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2.25kg / 5lb rib-eye de carne de res deshuesada y laminada", "450ml / ¾ pinta de vino tinto", "Vinagre de vino tinto de 150 ml / ¼ de pinta", "1 cucharada de azúcar", "1 cucharadita de pimienta de Jamaica molida", "2 hojas de laurel", "1 cucharada de tomillo fresco picado", "2 cucharadas de granos de pimienta negra, aplastados", "2 cucharadas de mostaza inglesa o Dijon", "200ml / 7fl oz crème frâiche", "4 cucharadas de rábano picante a la crema ya preparado", "1 cucharadita de mostaza inglesa", "1 cucharada de cebolletas frescas picadas", "sal marina y pimienta negra recién molida", "verduras de raíz asadas, para servir"], "serves": "Sirve 8-10", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque el ojo de la costilla de la carne en un plato grande no metálico.", "En una jarra, mezcle el vino tinto, el vinagre, el azúcar, la pimienta de Jamaica, la hoja de laurel y la mitad del tomillo hasta que estén bien combinados.", "Vierta la mezcla sobre la carne y gírela para cubrir uniformemente la mezcla en el líquido. Cubra el plato flojamente con film transparente y déjelo a un lado para que esté marinado en la nevera durante al menos cuatro horas, volteándolo ocasionalmente. (La carne puede ser marinada por hasta dos días).", "Cuando la carne esté lista para cocinar, precaliente el horno a 190C / 375F / Gas 5. Levante la carne del adobo, permitiendo que el exceso de líquido gotee y coloque en un plato, ligeramente tapado, hasta que la carne haya regresado a la habitación. temperatura.", "Espolvoree los granos de pimienta triturados y el tomillo restante en un plato. Extienda la mostaza uniformemente por toda la superficie de la carne, luego enrolle la carne en la mezcla de pimienta y tomillo para cubrirla.", "Coloque la carne de res en costra en una lata de asar y tueste en el horno durante 1 hora 20 minutos (para medio raro) o 1 hora y 50 minutos (para bien hecho).", "Mientras tanto, para la crema de rábano picante, mezcle la crème frâiche, el rábano picante a la crema, la mostaza y el cebollín en un bol hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida, luego espolvorear en un plato para servir y dejar enfriar hasta que se necesite.", "Cuando la carne esté cocida a su gusto, transfiérala a un plato caliente y cubra con papel de aluminio, luego déjela reposar en un lugar cálido durante 25-30 minutos.", "Para servir, esculpir el ojo de la costilla de la carne en rodajas y colocar los platos calientes. Coloque las verduras de raíz asadas al lado. Sirve con la crema de rábano picante."]}, {"isVegetarian": false, "title": "Chuleta de tocino con col hispi, apio de monte y una salsa de perejil", "url": "www_bbc_co_uk_food_recipes__bacon_chop_with_hispi_99182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chuletas de tocino", "2 cucharaditas de hojas de tomillo finamente picadas", "4 bayas de enebro, aplastadas", "2 cucharadas de aceite de oliva", "75g / 2½oz de mantequilla sin sal", "1 cebolla, finamente picada", "1 manzana Bramley, pelada y finamente picada", "1 repollo hispi, rallado", "150ml / 5fl oz de caldo de pollo", "1 manojo de racimo, hojas recogidas, más o menos picadas", "1 limón, solo jugo", "pizca de nuez moscada recién rallada", "pimienta negra recién molida", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "1 hoja de laurel", "algunos granos de pimienta negra", "500ml / 18fl oz de leche entera", "manojo de perejil rizado, finamente picado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Sazone las chuletas con pimienta, una cucharadita de tomillo y las bayas de enebro trituradas. Frote con aceite y reserve.", "Derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla y cocínela durante 5-7 minutos o hasta que esté suave. Agregue la manzana, el repollo, el tomillo restante y el caldo de pollo y cocínelos durante 6-8 minutos o hasta que todo se haya suavizado. Revuelva a través del apio, jugo de limón y nuez moscada rallada.", "Para hacer la salsa de perejil, caliente la mantequilla en una cacerola a fuego medio. Agregue la harina y cocine durante 2 minutos, revolviendo constantemente. Agregue la bahía y los granos de pimienta y agregue gradualmente la leche, batiendo todo el tiempo para evitar grumos. Cocine hasta que espese y revise el condimento. Agregue el perejil picado.", "Caliente una sartén a la plancha y cocine las chuletas durante 5 minutos a cada lado, o hasta que estén bien cocidas.", "Para servir, coloque la col cocinada en un plato para servir con el corte puesto en el lado y vierta sobre la salsa de perejil."]}, {"isVegetarian": false, "title": "Chasseur de pollo con puré de crema", "url": "www_bbc_co_uk_food_recipes__chicken_chasseur_with_19163", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_chicken_chasseur_with_19163_16x9.jpg", "ingredients": ["1 x 1,5 kg / 3 lb 5 oz de pollo, cortado en 8 piezas", "sal y pimienta negra recién molida", "Harina normal de 50g / 2oz", "2 cucharadas de aceite de oliva", "115g / 4oz de mantequilla", "Tocino rayado ahumado 110g / 4oz, cortado en lardons", "150g / 5½ oz champiñones", "150g / 5½ oz chalotes, en rodajas gruesas", "Azúcar en polvo de 55 g / 2 oz", "175ml / 6fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo", "2 cucharadas de puré de tomate", "2 cucharadas de estragón, finamente picado", "2 tomates, desollados, sin semillas y picados", "4 cucharadas de perejil plano, finamente picado", "1 kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "115g / 4oz de mantequilla", "125ml / 4fl oz de leche entera"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sazonar el pollo con sal y pimienta negra recién molida y luego echar la harina para cubrir.", "Caliente una sartén grande hasta que esté caliente, agregue el aceite y la mitad de la mantequilla y luego fría los trozos de pollo con la piel hacia abajo durante 1-2 minutos hasta que estén dorados. Voltea el pollo y fríe en el otro lado por otros 1-2 minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente, agregue la mantequilla restante y fría el tocino y los champiñones hasta que estén dorados. Agregue los chalotes y el azúcar impalpable y fría por 2-3 minutos hasta que estén dorados y caramelizados.", "Agregue el vino y hágalo a fuego lento, revolviendo para desglasar la sartén, luego vierta la mezcla de tocino y champiñón sobre el pollo. Agregue el caldo, el puré de tomate y el estragón al pollo y deje que hierva.", "Reduzca el fuego a fuego lento y cocine durante 30-40 minutos o hasta que el pollo esté cocido y el líquido se haya reducido un poco.", "Mientras tanto, para el puré, coloque las papas en una sartén con agua con sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos hasta que las papas estén tiernas.", "Escurra las papas y colóquelas en la sartén, luego coloque la sartén sobre el fuego durante un minuto para eliminar el exceso de humedad.", "Masifique las papas bien, luego agregue la mantequilla y la leche, batiendo para formar un puré suave. Sazonar con sal y pimienta negra recién molida.", "Cuando el pollo esté cocido, agregue los tomates y el perejil de hoja plana, revise el condimento y luego cocine a fuego lento durante otros dos minutos antes de servir.", "Sirva dos trozos de pollo por persona con la salsa y una cucharada de puré al lado."]}, {"isVegetarian": false, "title": "Salmón ahumado en frío con mantequilla casera y pan integral", "url": "www_bbc_co_uk_food_recipes__cold-smoked_salmon_with_16940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Crema doble 600ml / 20fl oz", "sal al gusto", "pan integral, para servir", "200 g / 7 oz de salmón ahumado"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Vierta la crema en una batidora y revuelva hasta que la parte sólida se haya partido por completo. Retirar y escurrir a través de un tamiz y luego lavar con agua fría, exprimiendo cualquier otro líquido. Pase el papel a prueba de grasa y colóquelo en la nevera.", "Para servir, una vez que la mantequilla se haya endurecido en la nevera, espolvoréela con un poco de sal y disfrútela con salmón en rodajas y pan integral con mantequilla."]}, {"isVegetarian": false, "title": "Encendedor 'pastel de cabaña' con puré de garbanzos", "url": "www_bbc_co_uk_food_recipes__cottage_pie_with_41660", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharaditas de aceite de colza", "1 cebolla mediana (100 g / 3½ oz de peso pelado), finamente picada", "2 dientes de ajo, aplastados", "75 g / 2½ oz de carne picada al 5% de grasa", "50 g / 1¾oz de zanahorias, cortadas en cubos pequeños", "150ml / 5fl oz de caldo de carne", "1 cucharadita de salsa Worcestershire", "75g / 2½ oz de garbanzos enlatados, peso escurrido", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite en una olla pequeña. Agregue la cebolla y cocine a fuego medio durante 3-4 minutos, o hasta que esté suave. Agregue el ajo y cocine por 1 minuto. Retire la mitad de la mezcla de la sartén y déjela a un lado.", "Agregue la carne picada y las zanahorias y cocine por 3-4 minutos. Agregue la mitad del caldo y toda la salsa Worcestershire y cocine a fuego lento durante 15 minutos, agregando más caldo si es necesario.", "Mientras tanto, coloque las cebollas y el ajo cocidos reservados en una olla pequeña. Agregue los garbanzos y el caldo restante y cocine a fuego lento durante 5 minutos. Una vez que los garbanzos estén suaves, machaquelos con un tenedor o un triturador de papas y sazone al gusto.", "Coloque la carne picada en un plato pequeño, cubra con el puré y sirva."]}, {"isVegetarian": false, "title": "Filete de carne stroganoff con riz pilaf", "url": "www_bbc_co_uk_food_recipes__fillet_of_beef_82682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g / 2oz de mantequilla", "Cebolla 50g / 2oz, picada", "250g / 9oz de arroz de grano largo", "500 ml / 18floz caldo de pollo caliente", "1 hoja de laurel", "sal y pimienta negra recién molida", "Filete de carne de res de cola de 450 g / 1 lb, cortado en tiras largas", "1 cucharadita de pimentón picante", "2 cucharaditas de pimentón dulce", "2 cucharadas de aceite vegetal", "30g / 1oz de mantequilla", "2 chalotes, finamente picados", "115g / 4 oz champiñones, en rodajas", "1 cucharadita de puré de tomate", "50ml / 2fl oz de vinagre de vino blanco", "75ml / 2½fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "115g / 4oz de pepinillo en juliana", "125ml / 4floz de crema agria", "1 cucharada de perejil de hoja plana, finamente picado", "1 pizca de pimentón dulce"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el arroz, precaliente el horno a 200C / 400F / Gas 6.", "Caliente una sartén para horno a fuego lento hasta que esté caliente, agregue la mitad de la mantequilla y la cebolla y cocine suavemente durante unos minutos hasta que se ablanden pero no se coloreen.", "Agregue el arroz y revuelva bien, fríalo suavemente por otro minuto, otra vez sin colorear, y agregue el caldo, el aderezo y la hoja de laurel.", "Llevar a ebullición, revolviendo con una cuchara de madera, luego cubrir con papel manteca con mantequilla y una tapa y colocar en el horno. Cocine por 15 minutos hasta que el arroz esté cocido pero firme.", "Retire la hoja de laurel, agregue lo último de la mantequilla y separe los granos de arroz con un tenedor. Sazonar con sal y pimienta recién molida, luego transferir a un plato limpio para calentar y mantener cubierto con un trozo de papel limpio a prueba de grasa hasta que esté listo para servir.", "Mientras tanto, haz el stroganoff. Espolvoree las tiras de carne con el pimentón y sazone con sal y pimienta negra recién molida.", "Caliente una sartén grande con aceite vegetal. Rápidamente freír con salmuera las tiras de carne, asegurándote de mantenerlas lo más raras posible, luego inclina la carne en un colador, reservando los jugos que se escurren.", "Usando la misma sartén, agregue la mantequilla, los chalotes y las setas en rodajas y cocine durante un minuto.", "Agregue el puré de tomate y cocine por unos minutos más, mezclando los ingredientes. Agregue el vinagre de vino blanco y cocine hasta que se evapore por completo.", "Agregue el vino blanco y cocine hasta que se reduzca a la mitad, luego vierta la crema doble, hierva y sazone con sal y pimienta negra recién molida.", "Agregue la carne de vaca chamuscada y el jugo reservado y cállelo suavemente, teniendo cuidado de no hervir o sobre cocinar la carne.", "Para servir, vierta el stroganoff en un plato grande para servir calentado y espolvoree con encurtido de eneldo. Rocíe la crema agria sobre la parte superior y espolvoree con perejil picado y polvo con pimentón dulce. Sirva con el arroz al lado."]}, {"isVegetarian": false, "title": "Col del rey, anguila ahumada, huevo frito", "url": "www_bbc_co_uk_food_recipes__king_cabbage_smoked_eel_02436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 de enero col de rey o Hispi", "2 hojas de nori", "dash oil", "aceite vegetal para freír", "sal", "guión de aceite vegetal", "50 g / 1¾oz de piel y huesos de una anguila ahumada (pregunta a tu pescadero)", "100ml / 3½fl oz crema doble UHT", "2 cucharaditas de salsa de soja blanca", "80g-120g / 3oz-4½oz de anguila ahumada, finamente picada", "dash oil", "1 cucharadita de dulse fermentado (opcional)", "4-6 huevos de gallinas camperas", "exprimir jugo de limón"], "serves": "Sirve 4-6", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para hacer la col de barbacoa, separe las hojas exteriores verdes del corazón de la col. Blanquee las hojas exteriores en una olla de agua hirviendo durante 1-2 minutos, luego drene y exprima la mayor cantidad de líquido posible. Ponga a un lado el corazón de repollo hasta más tarde.", "Seque estas hojas en un deshidratador o en el horno a la temperatura más baja, durante 3-6 horas o hasta que se sequen por completo. Aparta un par de hojas.", "Precalentar el horno a 170C / 150C Fan / Gas 3½. Tueste las hojas de nori en una bandeja para hornear en el horno durante 10 minutos. Combine las hojas de nori tostadas y las hojas de col deshidratadas en una licuadora pequeña o procesador de alimentos y mezcle hasta obtener un polvo fino.", "Corte a la mitad el corazón de la col y póngalo en agua con sal durante 1-3 horas.", "Caliente el aceite en una freidora a 160 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír las hojas de col deshidratada reservadas durante 1 minuto. Retire las \\\"patatas fritas\\\" del aceite y escurra sobre papel de cocina. Sazonar con una pizca de sal y romper en trozos al azar.", "Levante el corazón de repollo del agua con sal, drene y corte cada mitad en 2-3 cuñas. Caliente una barbacoa o parrilla en altura, cepille el lado cortado de las cuñas con aceite y carbón hasta que estén tiernas.", "Para hacer la crema de anguila ahumada, caliente el aceite vegetal en una sartén y agregue la piel y los huesos de la anguila. Freír suavemente durante unos 10 minutos hasta que se liberen el sabor y las grasas. Agregue la crema y deje que hierva, luego retírela del fuego e infúndala por 20 minutos. Cuele la crema y sazone con la salsa de soya blanca. Dejar enfriar a temperatura ambiente.", "Precalentar el horno a 140C / 120C Ventilador / Gas 1. Caliente la anguila en el horno durante 6 minutos. Retirar del horno y vestir con dulse fermentado, si se usa.", "Calentar el aceite en una sartén y freír los huevos a su gusto. Agregue una cucharada de crema de anguila a cada plato.", "Separe las cuñas de col y coloque una en cada plato. Esparce la anguila entre las hojas de col y condimenta con jugo de limón.", "Cubra cada plato con un huevo frito, espolvoree abundantemente con el polvo de repollo / nori y decore con las \\\"patatas fritas\\\"."]}, {"isVegetarian": false, "title": "Salmonete frito, albóndigas de albaricoque rosa cocido al horno, cangrejo y azafrán", "url": "www_bbc_co_uk_food_recipes__pan-fried_red_mullet_60833", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 papas de abeto rosa", "1 limón, solo jugo", "aceite de oliva, para lloviznar", "2 pinzas de cangrejo cocidas, carne recogido, conchas descartadas", "1 cucharada de perejil de mar finamente picado", "sal y pimienta negra recién molida", "huesos de salmonete, de 2 salmonetes rojos (pregunte a su pescadero)", "3 tomates sin semillas", "75 g / 2½ oz de mantequilla", "1 ramita de estragón", "150ml / 5fl oz de vino tinto", "400ml / 14fl oz de caldo de pollo", "2 yemas de huevo de gallinas camperas", "1 cucharada de mostaza inglesa", "25ml / 1fl oz de vinagre de vino blanco", "250ml / 9fl oz de aceite vegetal", "1 limón, solo jugo", "1 diente de ajo, aplastado", "pellizque el azafrán, empapado en agua tibia", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 filetes de salmonete, deshuesados", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Sazonar las papas con sal y pimienta y hornear en el horno durante 25 minutos, o hasta que estén bien cocidas. Deje que se enfríe, corte un crujiente en la parte superior de la papa, agregue el jugo de limón, rocíe con aceite de oliva y sazone con sal y pimienta. Cubra con la carne de cangrejo y espolvoree con perejil de mar.", "Para hacer la salsa, tueste los huesos de mújol en el horno durante 3-5 minutos. Transfiera a una cacerola, agregue el tomate, la mantequilla, el estragón, el vino y el caldo y llévelo a ebullición. Mezcle en un procesador de alimentos y luego pase a través de un tamiz fino en una sartén limpia. Llevar a ebullición y cocine a fuego lento de 5 a 8, hasta que el volumen del líquido se haya reducido a la mitad.", "Para hacer el alioli, coloca las yemas, la mostaza y el vinagre en el tazón de un procesador de alimentos limpio. Use el accesorio de batir para mezclar durante un minuto, luego agregue gradualmente el aceite. Sazone con jugo de limón, sal y pimienta. Agregue el ajo y el azafrán y mezcle bien.", "Para hacer el salmonete, caliente el aceite en una sartén y fría el salmonete con la piel hacia abajo durante 2 minutos. Voltee el pescado y cocine por un minuto más. Condimentar con sal y pimienta.", "Para servir, coloque la patata caliente en un plato, coloque los filetes de mújol a un lado, ponga un poco de alioli en el plato y termine con la salsa."]}, {"isVegetarian": false, "title": "Ostras escalfadas con guacamole y ensalada de brotes", "url": "www_bbc_co_uk_food_recipes__poached_oysters_with_88984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml / 9fl oz de vino blanco seco", "1 chalote, finamente picado", "125ml / 4fl oz de caldo de pescado", "12 ostras grandes, recién desconchadas, jugo y conchas reservadas", "Crema doble 250ml / 9fl oz", "2 cucharadas de crema", "1 yema de huevo de gallinas camperas", "12 coles de Bruselas, hojas recogidas", "1 cucharadita de aceite de oliva", "1 cucharadita de vinagre de vino tinto", "1 aguacate, pelado, piedra removida", "½ chile rojo, finamente picado", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la mitad del vino y la chalota en una cacerola con el caldo de pescado y el jugo de ostra. Llevar a ebullición y dejar que burbujee hasta que el volumen se reduzca a la mitad. Agregue la crema y cocine a fuego lento hasta que el volumen se haya reducido a la mitad nuevamente. Termine la salsa con la crème fraîche y la yema y mezcle con una batidora hasta que esté espumosa.", "Ponga las hojas de brotes en un vapor con un poco de agua y aceite. Cocine al vapor durante 3 minutos hasta o hasta que estén tiernos. Sazone con sal y pimienta y rocíe con el vinagre de vino tinto.", "Mash el aguacate y agregue el chalote restante, chile, jugo de limón y sazone con sal.", "Caliente el resto del vino en una cacerola y cocine las ostras durante 3 minutos.", "Vista las conchas de ostras con guacamole, cubra con una ostra y rocíe con la salsa de crema. Sirve con las hojas de brotes al vapor."]}, {"isVegetarian": true, "title": "torta de capa", "url": "www_bbc_co_uk_food_recipes__schichttorte_49934", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg", "ingredients": ["10 huevos grandes de gallinas camperas, separados", "100g / 3½oz de mantequilla sin sal", "150 g / 5½ oz de azúcar en polvo", "1 limón grande, solo cáscara", "1 cucharadita de pasta de frijoles de vainilla", "150 g / 5½ oz de harina común, tamizada", "65g / 2¼ oz de harina de maíz, tamizada", "aceite, para engrasar", "6 cucharadas de mermelada de albaricoque", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de jarabe de oro", "1 cucharada de ron", "1 cucharadita de pasta de frijoles de vainilla", "75g / 2½oz de chocolate puro (36% de sólidos de cacao), finamente picado", "250 g / 9 oz de azúcar glas", "1 cucharada de ron", "½ cucharadita de pasta de vainilla", "1-2 cucharadas de leche"], "serves": "Sirve 8-10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Batir las yemas de huevo en el tazón de un mezclador independiente a alta velocidad durante cinco minutos, hasta que estén pálidas, gruesas y cremosas.", "En otro recipiente, bata la mantequilla y el azúcar hasta que estén pálidos y cremosos. Agregue la ralladura de limón y la pasta de vainilla y mezcle bien. Agregue las yemas de huevo batidas y bata bien. Agregue la harina y la harina de maíz y mezcle.", "En un recipiente limpio y sin grasa, bata las claras de huevo hasta que se formen picos suaves cuando se quite el batidor. Revuelva un tercio de las claras de huevo en la mezcla para aflojar la consistencia. A continuación, doble suavemente las claras de huevo restantes en la mezcla de yema de huevo.", "Precalentar la parrilla a alto.", "Engrase una lata de springform redonda de 20cm / 8in con aceite y forre la base con papel pergamino.", "Coloque una porción del rebozado en la base de la lata de torta y extiéndalo uniformemente en el fondo. Dale a la lata un suave batido de lado a lado para igualar la parte superior de la mezcla. Colóquelo en un estante a 10 cm por debajo de la parrilla y cocínelo durante dos minutos, o hasta que esté dorado claro.", "Retire de la parrilla, agregue otra cucharada de masa, extienda con un pincel de pastelería, y colóquela debajo de la parrilla durante tres minutos o hasta que se dore. Continúe colocando capas y asando a la parrilla hasta que tenga 20 capas alternando en color desde dorado claro a marrón dorado oscuro. (O continúe hasta que haya usado toda la mezcla).", "Retire de la parrilla y deje enfriar en la lata durante cinco minutos. Con cuidado, suelte la lata y colóquela sobre una rejilla para que se enfríe.", "Derretir la mermelada de albaricoque en una sartén pequeña a fuego lento. Pase a través de un colador fino, luego cepille la parte superior y los lados del pastel con mermelada. Esto ayudará a que el esmalte se adhiera al pastel.", "Para el glaseado de chocolate, derrita la mantequilla en una olla pequeña con el jarabe dorado, el ron y la pasta de vainilla y deje que hierva. Retirar del fuego, dejar enfriar durante cinco minutos. Agregue el chocolate hasta que se derrita. Transfiera a un recipiente y deje enfriar a una consistencia de recubrimiento.", "Coloque una gran pieza de papel resistente a la grasa debajo de la rejilla de alambre que sostiene la torta. Vierta el glaseado uniformemente sobre la torta para cubrir completamente. Cualquier exceso de glaseado quedará atrapado en el papel resistente a la grasa y se podrá reutilizar para rellenar las áreas no esmaltadas de la torta.", "Para el glaseado de vainilla, tamice el azúcar glas en un tazón. Agregue el ron, la pasta de vainilla y la leche, revolviendo hasta que esté completamente suave. Rocíe sobre el glaseado de chocolate."]}, {"isVegetarian": false, "title": "2 horas de cena de Navidad", "url": "www_bbc_co_uk_food_recipes_2_hour_christmas_dinner_79341", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/2_hour_christmas_dinner_79341_16x9.jpg", "ingredients": ["Corona de pavo de 2.5kg / 5lb 8 oz (completamente descongelada si está congelada)", "6 lonchas de tocino rayado ahumado", "aceite de girasol, para engrasar", "gran perilla de mantequilla", "2 puerros medianos, cortados", "5 rebanadas gruesas de pan blanco", "1 paquete de 120 g mezcla de frutos secos y frutos secos (yo uso uno que contiene nueces de Brasil, nueces, almendras, pasas y arándanos secos)", "1 pequeño racimo de tomillo fresco, finamente picado", "1 limón grande sin cera, ralladura fina solamente", "Carne de salchicha de cerdo 450g / 1lb", "sal y pimienta negra recién molida", "Patatas de 1.2kg / 2lb y 12oz, preferiblemente Maris Piper o King Edward, peladas y cortadas en trozos grandes", "4 cucharadas de aceite de girasol o grasa de ganso derretida", "8-12 salchichas de chipolata, envueltas en tocino", "algunas ramitas de romero fresco (opcional)", "2 cucharadas de miel líquida", "750-900ml / 1⅓-1⅔ pinta de salsa de pollo preparada", "2 lonchas de tocino ahumado con raya o tocino, tostadas", "4 cucharadas de puerto de rubí o vino tinto", "2 cucharadas de salsa de arándanos", "½ cucharadita de salvia seca (opcional)", "2 paquetes de 40 g de salsa de pan", "500ml / 18fl de leche en oz", "4 cucharadas de crema doble", "25g / 1oz de mantequilla", "nuez moscada recién rallada, para servir (opcional)", "600g / 1lb 5 oz de zanahorias preparadas", "2 cucharadas de jugo de naranja (fresco o de un cartón)", "botón de mantequilla", "2 cucharadas de perejil congelado picado o 3 cucharadas de perejil recién picado", "2 buenas pizcas de azúcar en polvo", "25g / 1oz de mantequilla", "Tocino rayado ahumado sin corteza de 4 lonchas, cortado en piezas de 2cm / ¾in", "300 g / 10½ oz de brotes de Bruselas listos para cortar, cortados por la mitad", "200g / 7oz de castañas cocidas y peladas, empacadas al vacío o congeladas y descongeladas, reducidas a la mitad", "sal marina y pimienta negra recién molida"], "serves": "Sirve 6-8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para el pavo y el relleno, coloque la corona de pavo en una bandeja para hornear ligeramente engrasada y seque con papel de cocina. Sazonar con mucha pimienta negra molida. Cubra el pecho con lonchas de tocino, cubra el pavo con papel de aluminio ligeramente engrasado y tueste durante 1 hora.", "Mientras el pavo se está asando, prepare el relleno. Derrita la mantequilla en una sartén antiadherente grande. Corta finamente los puerros. Agregue a la sartén y cocine a fuego lento durante 3-4 minutos, o hasta que se ablanden, revolviendo regularmente.", "Incline los puerros en un plato grande y poco resistente al horno; un plato de lasaña funcionaría bien. Rompa el pan en cubos pequeños y no se preocupe por las cortezas, simplemente agréguelas también. Incline las nueces y la fruta en un tablero y corte las nueces grandes en mitades o cuartos, luego agregue el pan y los puerros. Agregue aproximadamente tres cuartas partes del tomillo a la mezcla de relleno y espolvoree la ralladura de limón en la parte superior. Agregue la salchicha y sazone con un poco de sal y mucha pimienta negra. Mezcle bien todos los ingredientes con las manos, dejándolas bastante gruesas. Extienda suelto sobre el plato y reserve.", "Cuando el pavo ha estado cocinando durante 1 hora, salga del horno y reduzca la temperatura a 200 ° C / 180 ° Ventilador / Gas 7. Saque la corona de pavo con cuidado de la bandeja y colóquela directamente encima del relleno. Coloque en el horno y tueste el pavo y el relleno durante 30 minutos, luego retire la lámina y cocine por otros 15 minutos, o hasta que el pavo esté completamente cocido y los jugos salgan limpios cuando la parte más gruesa se perfora con un pincho.", "Mientras tanto, para las papas asadas, ponga las papas en una cacerola grande o en una cazuela a prueba de fuego y cúbralas con agua fría. Coloque a fuego alto y lleve a ebullición. Reduzca el fuego ligeramente y cocine a fuego lento durante 3 minutos. Escurra las papas en un colador grande y vuelva a la cacerola. Agite vigorosamente para golpear las papas y arañar la superficie, esto las hará más crujientes cuando se tuesten.", "Vierta el aceite y mezcle bien. Esparce en una sola capa en una bandeja para hornear y tuesta durante una hora, o hasta que las papas estén doradas, crujientes y tiernas en el centro.", "Mientras tanto, para los cerdos en mantas, coloque una pequeña ramita de romero debajo del tocino en cada salchicha. Coloque en una bandeja para hornear ligeramente engrasada con las papas y rocíe con la miel. Asar durante 15-20 minutos, o hasta que estén ligeramente dorados y cocidos.", "Retire el pavo del horno, cúbralo con papel de cocina y un par de paños de cocina secos y déjelo reposar durante 15 minutos.", "Para la salsa de pan (si está haciendo), coloque la mezcla de salsa de pan en una olla antiadherente y agregue aproximadamente la cuarta parte de la leche. Mezcle hasta que esté bien combinado, luego agregue la leche restante y cocine a fuego lento. Cocine por 3-4 minutos, revolviendo regularmente, hasta que esté espeso y suave, luego agregue la crema y la mantequilla y cocine durante 1-2 minutos más. Vierta en un plato caliente, espolvoree un poco de nuez moscada y mantenga caliente hasta que esté listo para servir.", "Para las zanahorias, ponga las zanahorias en un plato para servir a prueba de microondas y vierta sobre el jugo de naranja, salpique con mantequilla, espolvoree con perejil, agregue azúcar y sazone con un poco de sal y mucha pimienta negra. Cubra con film transparente o un plato y cocine a temperatura alta durante 8 minutos, o hasta que esté tierno, revolviendo hasta la mitad de la cocción.", "Para los brotes, poner la mantequilla, el tocino, los brotes y las castañas en una sartén antiadherente grande o en una sartén y sazonar bien con pimienta negra. Agregue 200ml / 7fl oz de agua fría y deje que hierva. Cocine durante unos 5 minutos, revolviendo regularmente hasta que los brotes estén tiernos y el líquido se haya evaporado.", "Mientras tanto, para la salsa, ponga la salsa, el tocino, el bacalao, la salsa de arándano y la salvia seca, si está usando, en una cacerola mediana y deje que hierva a fuego lento. Reduzca el fuego y cocine suavemente durante 5 minutos, revolviendo ocasionalmente. Sazonar con pimienta negra y un poco de sal, si es necesario. Mantenga caliente hasta que esté listo para servir.", "Para servir, caliente sus platos de servir. Cuele la salsa en los barcos de salsa calentados y póngalos sobre la mesa junto con las papas asadas, los cerdos en mantas, las zanahorias y la salsa de pan (si se hace). Espolvoree el pavo con el tomillo restante y sirva en el plato para asar junto con el relleno. Tallar en la mesa."]}, {"isVegetarian": false, "title": "Mejillones rellenos", "url": "www_bbc_co_uk_food_recipes__stuffed_mussels_01612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["alrededor de 60 mejillones, fregados y rellenos", "150ml / 5fl oz de vino blanco o vermut", "1 gran ramita de perejil de perejil", "Pan rallado fino de 25g / 1oz", "25g / 1oz de queso duro y fundido, como el queso local corso, o una mezcla de gruyère y pecorino", "2 cucharadas de perejil de flatillo finamente picado", "1 cucharada de estragón picado", "1 cucharada de albahaca finamente picada", "3 dientes de ajo, finamente picados", "30ml / 1fl oz de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / Fan 180C / Gas 6.", "Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos.", "Coloque la ramita de vino y perejil en una olla o cazuela con tapa grande y deje que hierva.", "Agregue los mejillones y cubra con la tapa. Deje que hierva durante 4-5 minutos, o hasta que los mejillones se hayan abierto por completo. Deseche cualquier mejillón que permanezca cerrado.", "Retire los mejillones de la cazuela de a uno por vez. Retire la mitad de sus conchas y colóquelos, con cáscara, en una bandeja grande para hornear. Rocíe un poco del licor de cocción, luego deseche el resto.", "Para el relleno, mezcle todos los ingredientes. Divida el relleno entre los mejillones, colocándolo en la parte superior de la carne de mejillón. Hornee en el horno durante 5 minutos o hasta que estén ligeramente dorados. Servir a la vez"]}, {"isVegetarian": true, "title": "Pastel de pasqualina (pastel verde gigante)", "url": "www_bbc_co_uk_food_recipes__torta_pasqualina_giant_53102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 375 g / 13 oz, más extra para quitar el polvo", "1 cucharadita de sal", "4 cucharadas de aceite de oliva", "1.15kg / 2½lb greens (mezcla de acelgas, espinacas u otras verduras)", "2 cucharadas de aceite de oliva, más extra para cepillar", "1 kg / 2 libras de cebollas de 4 oz, más o menos picadas", "350g / 12oz de ricotta", "85g / 3oz de parmesano, finamente rallado", "nuez moscada rallada, al gusto", "9 huevos grandes de gallinas camperas, 4 golpeados, 5 restos enteros", "2 cucharaditas de azúcar en polvo (opcional)", "sal y pimienta negra recién molida"], "serves": "Sirve 10-12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Para hacer la masa, coloca la harina en un tazón grande. Mezcle 225 ml / 8 fl oz de agua, la sal y el aceite, luego vierta gradualmente sobre la harina, mezcle con las manos hasta que la masa se una en una bola áspera. Dé vuelta sobre una superficie de trabajo enharinada y amase durante 2-3 minutos, hasta que quede suave, agregando más harina si la masa está pegajosa. Envuelva la película adhesiva y déjela a un lado a temperatura ambiente. (Si lo hace con anticipación, refrigere durante la noche y lleve a temperatura ambiente antes de usar).", "Para hacer el relleno, ponga a hervir una olla grande de agua. Blanquee los greens en lotes, hasta que se marchiten. Escurrir y enfriar en un colador con agua corriente fría. Divida en cuatro bolas y exprima para eliminar la mayor cantidad de agua posible. Picar groseramente y apretar de nuevo.", "Caliente el aceite en una sartén grande a fuego medio. Agregue las cebollas y una pizca de sal y cocine durante 5 minutos, o hasta que estén blandos. Agregue las verduras cocidas, sazone generosamente con sal y pimienta y mezcle bien.", "Apague el fuego y agregue la ricotta, la mitad de parmesano y algunas rejillas de nuez moscada. Mezcle bien y revise el condimento. Agregue todo menos 3 cucharadas de huevo batido a la mezcla de verduras y mezcle bien. Dejar enfriar.", "Desenvuelve la masa, córtala en dos pedazos y forma bolas. Usando un rodillo, despliegue cada bola en un círculo muy delgado de 30cm / 12 pulgadas. Coloque un círculo de masa en una bandeja para pizza de 30 cm / 12 in o una bandeja grande para hornear forrada con papel de hornear y cepille ligeramente con aceite.", "Cuchara los greens uniformemente sobre el centro de la base para que tenga 5 cm de grosor, dejando un borde de 2,5 cm alrededor del borde. Alise la superficie con una cuchara y haga cinco sangrías en los greens. Rompe un huevo en cada sangría. Espolvorea con el queso parmesano restante.", "Coloque el segundo círculo de masa en la parte superior y recorte el exceso de masa. Doble los bordes y engarce para sellar el pastel. Cepille con el huevo batido reservado y espolvoree con azúcar (si se usa).", "Perfore dos o tres veces con un cuchillo afilado para que el vapor pueda escapar. Hornee durante 45 minutos o hasta que estén bien dorados. Deslice sobre una tabla de cortar y deje que se enfríe un poco antes de cortar. Servir caliente oa temperatura ambiente."]}, {"isVegetarian": false, "title": "Lomo de venado relleno de duraznos, manzanas y jengibre", "url": "www_bbc_co_uk_food_recipes__venison_loin_stuffed_07487", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["botón de mantequilla", "1 cucharada de aceite de girasol", "1 chalote de plátano, finamente picado", "2 dientes de ajo, aplastados", "1 manzana comiendo, pelada y picada", "Melocotones en cubitos de 75 g / 2½ oz", "50g / 1¾oz sultanas", "3 bolas de tallo de jengibre en almíbar, drenados y picados", "75g / 2½ oz de pan blanco fresco", "1 cucharadita de jengibre molido", "3 cucharadas de perejil de flatillo finamente picado", "1 cucharada de hojas de tomillo fresco finamente picado", "1 limón, ralladura y jugo", "1 cucharadita colmada de sal marina en copos, más extra para sazonar", "1 cucharada de jarabe de jengibre de tallo (del frasco)", "pimienta negra recién molida", "2 filetes de lomo de venado de 2 x 500 g / 1 lb 2 oz, recortados", "16 lonchas de tocino rayado ahumado y sin corteza, en rodajas finas", "aceite de girasol, para engrasar"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el relleno, derrita la mantequilla y el aceite en una sartén antiadherente grande a fuego medio. Suavemente fríe la chalota y el ajo durante cinco minutos, revolviendo regularmente hasta que estén suaves, pero no coloreados.", "Retire la sartén del fuego y agregue la manzana, melocotones, pasas, jengibre, pan rallado, jengibre molido, hierbas, ralladura de limón y jugo. Sazonar con sal y mucha pimienta y mezclar bien. Agregue el jarabe de jengibre y mezclar nuevamente hasta que el relleno se una. Dejar enfriar.", "Coloque uno de los filetes entre dos hojas de película adhesiva y golpee con un rodillo hasta aproximadamente 1 cm / ½ pulgadas de espesor. Reserve y repita con el otro.", "Coloque una hoja grande de película adhesiva en un tablero y coloque el tocino en longitudes ligeramente superpuestas en la parte superior; haciendo un rectángulo de aproximadamente 32x28cm / 13x11in. Si algunas de las tiras son un poco cortas, estíralas con la parte de atrás de un cuchillo.", "Coloque uno de los filetes en el centro del tocino y extiéndalo con el relleno. Cubra con el otro filete para emparedar el relleno. Coloque el tocino sobre la parte superior de la carne de venado para encerrarlo por completo, utilizando la película adhesiva para ayudarlo. Envuelva con fuerza en más película adhesiva y enfríe en la nevera durante la noche o al menos 1 hora.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Desenvuelva la carne de venado y colóquela en una bandeja para hornear ligeramente engrasada, con los extremos del tocino debajo. Asar durante 30 minutos o hasta que el tocino esté crujiente y el venado esté recién hecho.", "Retire del horno y transfiera a una tabla o fuente de servir caliente. Cubra con papel de aluminio y déjelo descansar.", "Tallar la carne de venado en rodajas y dividir entre seis platos calientes. Cuchara un poco de los jugos de descanso sobre la carne de venado."]}, {"isVegetarian": false, "title": "Venison massaman curry", "url": "www_bbc_co_uk_food_recipes__venison_massaman_curry_82057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharaditas de cilantro molido", "¼ cucharadita de clavo de olor molido", "1 cucharadita de canela molida", "2 cucharaditas de comino molido", "1 cucharadita de pasta de gambas, asada", "3 dientes de ajo, finamente picados", "1 cebolla mediana (alrededor de 150 g / 5½ oz), picada", "8 chiles rojos largos, sin semillas y picados", "1 tallo de limoncillo, recortado, parte blanca picada", "3cm / 1¼ en pieza de galanga fresca, pelada y picada", "Leche de coco de estaño 400ml", "2 cucharadas de aceite de oliva virgen extra (opcional)", "400-450g / 14oz-1lb ciervos de venado", "1 cucharadita de azúcar de palma (también conocida como azúcar moreno)", "40-60ml / 1½-2¼fl oz de salsa de pescado, al gusto", "60-100ml / 2¼-3½fl oz de puré de tamarindo, al gusto", "5 hojas de laurel", "5 vainas de cardamomo, tostadas", "1 camote grande, pelado y cortado en cubos de 2cm / ¾in", "arroz al vapor, para servir", "80g / 2¾oz de cacahuetes tostados sin sal, picados, para servir", "30 g / 1 oz de hojas de cilantro fresco, picado grueso, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la pasta, coloque las semillas de cilantro, el clavo, la canela y las semillas de comino en una sartén pequeña y cocine durante 1-2 minutos o hasta que las especias comiencen a liberar sus aceites. En un molinillo de especias o mortero, mezcle las especias tostadas, la pasta de camarones y una cucharada de agua fría hasta que quede suave (es posible que necesite agregar un poco más de agua). Agregue los ingredientes restantes, uno a la vez, mezclándolos bien después de cada adición hasta que la mezcla forme una pasta espesa.", "Precalentar el horno a 160C / 140C Fan / Gas 3.", "Coloque una cazuela grande a prueba de fuego a fuego medio-alto. Si la crema de coco sólido se ha elevado a la parte superior de la lata, úsela, o bien vierta 125 ml / 4 fl oz de leche de coco y cocine, revolviendo constantemente durante 3-5 minutos, hasta que se separe. (Si no se separa, agregue el aceite de oliva opcional). Agregue 60g / 2¼ oz de la pasta de curry y fría, revolviendo constantemente, hasta que esté fragante, alrededor de 1-2 minutos.", "Agregue el venado y fría por 2-3 minutos hasta que se dore por todas partes. Agregue la leche de coco restante, reservando 2 cucharadas para la guarnición. Aumenta el calor y lleva a ebullición. Agregue el azúcar de palma, la salsa de pescado, el puré de tamarindo, las hojas de laurel y el cardamomo y vuelva a hervir. Agregue 100 ml / 3½ fl oz de agua para cubrir casi la carne de venado y mantenerlo húmedo.", "Cocine en el horno durante una hora o hasta que el venado esté casi tierno. Agregue la batata, tape y vuelva al horno por una hora más, o hasta que la papa esté tierna.", "Sirva el curry con arroz al vapor cubierto con los cacahuetes tostados picados y el cilantro."]}, {"isVegetarian": false, "title": "Un popurrí de mariscos con verduras para bebés", "url": "www_bbc_co_uk_food_recipes_a_medley_of_shellfish_75055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g / 14oz de almejas, fregadas y cuidadas", "Mejillones de 400g / 14oz, lavados y despalillados (deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos)", "150ml / 5fl oz de vino blanco", "125g / 4½oz de mantequilla sin sal", "2 chalotes, finamente picados", "150ml / 5fl oz de caldo de pescado", "100ml / 3½ fl oz crema doble", "1 langosta cocida, sin carne", "8 langostinos cocidos, conchas eliminadas", "2 cucharadas de aceite de oliva", "8 vieiras, sin cáscara, limpiadas, huevas eliminadas", "3 cucharadas de perifollo fresco picado", "1 manojo de nabos bebé, recortado", "1 manojo de zanahorias baby, peladas y cortadas", "8 lanzas de espárragos, recortadas", "50 g / 1¾oz de mantequilla sin sal", "20g / ¾oz aster de mar", "1 puñado de verdolaga"], "serves": "", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los mariscos, caliente una cacerola grande con tapa a fuego alto. Agregue las almejas, los mejillones y el vino blanco. Coloque una tapa en la parte superior y cocine por 2-3 minutos, o hasta que las almejas y los mejillones se hayan abierto (deseche las almejas y los mejillones sin abrir). Mantenga el licor de cocina de los mariscos.", "Caliente una sartén a fuego medio y agregue 50 g / 1¾ oz de mantequilla. Una vez caliente y derretido, agregue los chalotes y cocine durante 1-2 minutos.", "Agregue el licor reservado del marisco y cocínelo hasta que el volumen del líquido se reduzca a la mitad. Agregue el caldo de pescado y reduzca nuevamente a la mitad. Baje el fuego y agregue la crema y la mantequilla restante.", "Para las verduras, llena una olla grande con agua hirviendo con sal y pula los nabos durante 3 minutos, las zanahorias durante 2 minutos y los espárragos durante un minuto. Escurrir y apartar.", "Caliente una sartén y agregue la mantequilla y las verduras. Cocine durante 1-2 minutos, luego agregue un par de cucharadas de agua y cocine hasta que las verduras estén tiernas.", "Justo antes de servir, agregue las langostinos y la langosta a la salsa para que se caliente. Luego agrega el perifollo fresco.", "Caliente una sartén grande a fuego alto y agregue el aceite. Una vez caliente, agregue las vieiras y cocine en cada lado durante 1-2 minutos. Agregue un poco de mantequilla a la sartén justo antes de que se terminen y esmalte las vieiras a medida que se derrita.", "Coloque los vegetales para bebés y todos los mariscos en un tazón para servir y decore con el aster de mar y la verdolaga marina."]}, {"isVegetarian": false, "title": "Ensalada simple en capas", "url": "www_bbc_co_uk_food_recipes_a_simple_layered_salad_21760", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/a_simple_layered_salad_21760_16x9.jpg", "ingredients": ["Papas para ensalada de 250 g / 9 oz, cortadas en cubitos", "½ cebolleta pequeña", "½ manzana, rallada o finamente picada", "rábano picante fresco (al gusto), pelado y finamente picado", "Anchoas de 25 g / 1oz o arenque encurtido", "media cabeza de lechuga, rallada", "2 zanahorias, ralladas", "4 remolachas cocidas medianas", "2 huevos de gallina, hervidos", "6 cornichons, finamente picados", "unas ramitas de eneldo, finamente picadas", "medio pepino grande, sin semillas y finamente picado", "sal y pimienta negra recién molida"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pon a hervir una olla de agua con sal y agrega las papas. Cocine hasta que esté suave, luego drene y deje enfriar. Cuando esté frío, ponga en un tazón con las cebolletas, manzana, rábano picante y anchoas y doble todos los ingredientes suavemente.", "Separe la yema de huevo de la clara de huevo y pique finamente ambos.", "Para armar la ensalada, coloque una capa de lechuga en el fondo de un tazón de vidrio grande. Cubra la lechuga con una capa de ensalada de papa (reserve una pequeña ensalada de papa), seguida de una capa de zanahorias, remolacha, pepino y una última capa de ensalada de papa. A medida que va acumulando las capas, espolvoree el eneldo y los cornichons en cada capa y sazone con un poco de sal y pimienta.", "Cubra la ensalada con el huevo picado y una última cucharada de eneldo."]}]