[{"ingredients": ["10-12 huevos", "1 cucharada de mostaza inglesa", "2 yemas de huevo", "1 cucharada de vinagre de vino blanco", "Una buena pizca de sal", "Algunas vueltas de molino de pimienta blanca", "300ml / ½ pinta de aceite de girasol"], "method": ["Hierva los huevos durante 8 minutos.", "Escurrir, cubrir con agua fría y dejar enfriar.", "Para hacer la mayonesa de mostaza, mezcle la mostaza, las yemas de huevo y el vinagre de vino blanco en un tazón.", "Muy gradualmente mezcle el aceite para hacer una mayonesa espesa y cremosa.", "Poner en una olla, cubrir y enfriar hasta que sea necesario. Sirva con los huevos duros pelados."], "url": "www_bbc_co_uk_food_recipes_hardboiledeggswithmu_377", "title": "Huevos duros con mayonesa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 bulbo de hinojo", "¼ pequeño apio nabo, pelado", "¼ col roja pequeña", "¼ col blanca pequeña", "1 remolacha, pelada", "1 cebolla española", "2 zanahorias grandes, peladas", "1 cucharada de semillas de hinojo, tostadas", "2 cucharadas de sal marina escamosa", "1 limón, ralladura solamente", "1 cucharadita de eneldo fresco picado", "1 cucharada de perifollo picado", "1 cucharada de perejil de flatleaf fresco picado", "5 dientes de ajo, rallados", "2 yemas de huevo de gallinas camperas", "4 cucharaditas de vinagre de vino blanco", "35 g / 1¼ oz de mostaza inglesa", "1 limón, solo jugo", "1 cucharada de anchoas saladas", "2 cucharaditas de azúcar en polvo", "350ml / 12fl oz de aceite vegetal", "sal", "pimienta de cayena, al gusto"], "method": ["Cortar finamente el hinojo, apio nabo, col lombarda, repollo blanco, remolacha, cebolla y zanahorias y colocar en un tazón grande. Agregue las semillas de hinojo y la sal. Mezcle completamente, luego déjelo reposar por 20 minutos para que las verduras se marchiten y curen en la sal.", "Para el aderezo de ajo, agregue el ajo, las yemas de huevo, el vinagre de vino blanco, la mostaza, el jugo de limón, las anchoas y el azúcar en un procesador de alimentos y mezcle hasta que quede suave. Mientras el procesador de alimentos sigue en funcionamiento, vierta lentamente el aceite vegetal en una corriente fina y uniforme hasta que la mayonesa se emulsione. Sazonar con sal y pimienta de cayena, al gusto. Pase a través de un tamiz fino para hacerlo realmente liso. Guárdelo en la nevera hasta que lo necesite.", "Enjuague las verduras con agua fría durante unos minutos. Coloque en una toalla de té limpia y exprima toda la humedad. Coloque las verduras en un recipiente para mezclar limpio y agregue la ralladura de limón y las hierbas picadas. Verifique y agregue aderezo si es necesario. Agregue tanta mayonesa como desee, puede que no lo necesite todo. Mezcle y sirva. La ensalada de col se mantendrá en la nevera por hasta una semana."], "url": "www_bbc_co_uk_food_recipes_hardcore_coleslaw_23307", "title": "Ensalada de col Hardcore", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hardcore_coleslaw_23307_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz pueden judías", "20g / ¾oz de cilantro fresco, picado", "15 g / ½ oz de menta, picada", "200g / 7oz de ricotta", "3 cucharadas de aceite de oliva"], "method": ["Triture ligeramente los frijoles con un triturador de papa en un tazón grande.", "Dobla los frijoles junto con las hierbas picadas y la ricota, sin mezclar demasiado.", "Escurrir sobre el aceite de oliva y servir."], "url": "www_bbc_co_uk_food_recipes_haricot_herb_and_ricotta_45585", "title": "Haricot, hierbas y salsa de ricotta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "500g / 1lb 2 oz de chuletas de cordero, con guarnición de grasa", "1 cebolla, finamente picada", "pellizcar el azafrán", "Dirígete a El Hanout", "½ cucharadita de jengibre molido", "½ cucharadita de pimienta blanca molida", "½ cucharadita de pimienta negra molida", "1 cubo de caldo de carne", "100g / 3½oz de lentejas marrones", "1.2 litros / 2 pintas de agua hirviendo", "2 cucharadas de puré de tomate", "400g de tomates cortados en lata", "400g pueden garbanzos, drenados y enjuagados", "1 cucharada de harina normal", "Fideos fideos 100 g / 3½ oz", "1 manojo de perejil fresco, finamente picado", "1 manojo de cilantro fresco, finamente picado"], "method": ["Caliente el aceite en una cacerola grande con tapa a fuego medio. Agregue las chuletas y cocine a cada lado hasta que se doren. Retire de la sartén y reserve.", "Agregue la cebolla a la sartén y cocínela durante 5 minutos, hasta que esté transparente. Agregue el azafrán, ras el hanout, el jengibre y los pimientos blancos y negros y revuelva en el cubo común, luego cocine durante 2 minutos.", "Regrese las chuletas a la sartén con las lentejas y el agua hirviendo. Cubra y cocine durante 30 minutos.", "Agregue el puré de tomate, los tomates y los garbanzos. Rellene con más agua para cubrir si es necesario, cubra con una tapa y cocine durante 30 minutos.", "Mezcle la harina con una cucharada de agua fría y revuelva en la sopa. Agregue los fideos y cocine durante 15 minutos, revolviendo con frecuencia.", "Retire del fuego y agregue el perejil y el cilantro. Servir."], "url": "www_bbc_co_uk_food_recipes_harira_soup_63128", "title": "Sopa Harira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tomates maduros medianos y grandes, descuartizados", "1 pimiento naranja o amarillo, sin grano y cortado en trozos de 2 cm", "aceite de cocina bajo en calorías", "75g / 2½oz de trigo bulgur", "20g / ¾oz piñones", "1 limón", "4 cebollas de primavera, en rodajas finas", "3 cucharadas colmadas de cilantro fresco tostado", "2 x 200 g / 7oz de filetes de pescado blanco sin piel, como el bacalao o el eglefino", "2 cucharaditas de pasta harissa", "pimienta negra recién molida", "Brócoli 160g / 6oz cortado en florecillas", "2 cucharadas de yogurt natural sin grasa, para servir"], "method": ["Precaliente el horno a 220C / 200C Ventilador / Gas 7. Coloque los tomates y la pimienta en una lata pequeña para asar, rocíe con un poco de aceite, sazone con pimienta negra y hornee durante 15 minutos.", "Mientras tanto, cocine el trigo bulgur en una olla pequeña de agua hirviendo durante cinco minutos, luego escurra bien en un colador.", "Tueste los piñones en una sartén pequeña y seca a fuego medio, volteándolos regularmente hasta que estén ligeramente dorados.", "Cortar el limón por la mitad y cortar cuatro rodajas finas de la mitad. Exprime el jugo de la otra mitad.", "Saca las verduras del horno. Agregue el trigo bulgur, cebolletas, piñones, dos cucharadas colmadas de cilantro y jugo de limón (reserve un poco de jugo de limón para servir). Sazone con mucha pimienta negra y mezcle ligeramente.", "Haga dos espacios en la mezcla de bulgur y acurruque el pez en ellos. Sazone el pescado al gusto, extiéndalo con la pasta Harissa y cubra con rodajas de limón. Hornee por 15 minutos o hasta que el pescado esté recién hecho.", "Cueza al vapor el brócoli hasta que esté cocido a su gusto.", "Divida la mezcla de pescado y bulgur entre dos platos y esparza con el cilantro restante. Exprima el resto del jugo de limón. Agregue brócoli a las placas y sirva con yogur."], "url": "www_bbc_co_uk_food_recipes_harissa_baked_fish_with_63091", "title": "Harissa horneó pescado con trigo bulgur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/harissa_baked_fish_with_63091_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas para bebé de 400 g / 14 oz, reducidas a la mitad", "150g / 5½oz de tomates cherry, cortados a la mitad", "6 cebolletas, cortadas y partidas a la mitad", "aceite de oliva, para lloviznar", "6 cucharadas de pasta harissa", "4 pequeños filetes de lubina, piel anotada", "sal y pimienta negra recién molida", "pequeñas hojas de menta picadas, finamente picadas", "3 cucharadas de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida", "5 pimientos mixtos grandes", "300g / 10½oz de masa fermentada, desgarrada en piezas ásperas y del tamaño de un bocado", "aceite de oliva, para lloviznar", "500g / 1lb 2oz de tomates cherry, cortados a la mitad", "½ pepino, pelado, sin semillas y cortado en cubitos", "½ cebolla roja, finamente rebanada", "4 rábanos, en rodajas finas", "Aceitunas negras 150g / 5½oz, picadas", "gran puñado de cilantro fresco, toscamente desgarrado", "gran puñado de perejil fresco, toscamente desgarrado", "1 pimiento rojo asado de un frasco, sin semillas", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre de vino tinto", "½ limón, solo jugo", "1 diente de ajo, finamente rallado", "1 cucharadita de semillas de comino, tostadas", "1 tsc zumaque", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque las papas, los tomates y las cebolletas en una lata grande para asar. Rocíe con aceite de oliva y salpique con 1 o 2 cucharadas de pasta Harissa. Sazonar con sal y pimienta y mezclar bien para cubrir las papas. Hornea por 35 minutos.", "Mientras tanto, para hacer la salsa, mezcle la menta con el aceite de oliva y el jugo de limón. Sazonar con sal y pimienta y reservar.", "Coloque los pimientos en una bandeja grande para hornear y hornéelos por 25 minutos, o hasta que estén carbonizados por todos lados. Retire los pimientos picantes del horno, colóquelos en un tazón grande y cubra con una película adhesiva. Cuando esté lo suficientemente frío como para manipularlo, quite las cáscaras y los núcleos de los pimientos y córtelos en pedazos de 2cm / 1in y déjelos a un lado.", "Coloque la masa madre en la bandeja para hornear en la que se cocinaron los pimientos, rocíe con aceite de oliva y sazone con sal y pimienta. Cocine en el horno durante 5-6 minutos, hasta que estén tostados. Dejar de lado.", "Para hacer la lubina al horno, reparta la harissa restante por todos los filetes de lubina. Cuando las papas hayan tenido 35 minutos, retire la bandeja del horno y coloque los filetes recubiertos en la parte superior, con la piel hacia arriba. Vuelva al horno por 10 minutos o hasta que el pescado esté bien cocido.", "Para hacer el aderezo, coloque los ingredientes en un procesador de alimentos y mezcle hasta que quede suave. Sazonar con sal y pimienta al gusto y dejar de lado.", "Para hacer la ensalada, coloque los pimientos, la masa madre tostada, los tomates, el pepino, la cebolla, los rábanos, las aceitunas y las hierbas en un tazón grande. Verter el aderezo y mezclar para cubrir bien.", "Rocíe la salsa de menta sobre cada filete de lubina y sirva con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_harissa_baked_sea_bass_91056", "title": "Harissa al horno lubina con papas bebé, salsa de menta y ensalada mediterránea", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de chiles rojos secos, empapados en agua fría, toscamente picados", "50g / 2oz de chiles rojos frescos, sin semillas, picados", "2 cucharaditas de comino molido", "2 cucharaditas de semillas de alcaravea molidas", "1 cucharada de pimentón dulce ahumado", "2 dientes de ajo", "2 cucharadas de puré de tomate", "3 cucharadas de vinagre de vino tinto", "4 cucharadas de aceite de oliva", "8 muslos de pollo", "2 cucharadas de aceite de oliva", "2 cebollas, en rodajas finas", "Papas de 400g / 14oz, peladas, cortadas en trozos", "1 x 400g / 14oz de tomates picados en lata", "500ml / 18fl oz de caldo de pollo", "1 limón, solo jugo", "3 cucharadas de perejil fresco de flatleaf recién picado,", "1 diente de ajo, aplastado", "1 cucharada de vinagre de vino tinto", "2 cucharaditas de miel", "½ limón, solo jugo", "3 cucharadas de aceite de oliva", "1 cebolla roja, finamente rebanada", "1 x 400 g / 14 oz de garbanzos de lata, escurridos, enjuagados", "75g / 3oz de pasas, remojadas en 50ml / 2floz de agua caliente", "3 cucharadas de perejil fresco de flatleaf recién picado", "3 cucharadas de cilantro fresco tostado", "3 cucharadas de menta fresca picada"], "method": ["Para el Harissa, coloque todos los ingredientes Harissa en un procesador de alimentos y mezcle hasta obtener una pasta homogénea. Ponga el Harissa en un tarro y guárdelo en la nevera hasta que esté listo para usar.", "Para el estofado, corta los muslos de pollo varias veces y luego colócalos en un tazón con tres cucharadas de pasta Harissa y mezcla hasta que estén bien combinados. Marinar en la nevera durante al menos dos horas.", "Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite de oliva en una cazuela a prueba de llamas hasta que esté caliente, agregue los muslos de pollo y cocine por 3-4 minutos, volteándolo regularmente, o hasta que se dore por todas partes. (Es posible que deba hacer esto en lotes). Retire los muslos de pollo de la sartén y déjelos a un lado.", "Agregue las cebollas a la sartén y cocínelas durante 3-4 minutos o hasta que se suavicen.", "Agregue dos cucharadas de la pasta Harissa y cocine por un minuto, luego agregue las papas y revuelva hasta cubrir la pasta. Agregue los tomates en lata y caliéntelos y deje que hiervan.", "Regrese el pollo a la sartén y vuelva a hervir a fuego lento.", "Coloque en el horno y cocine durante 45-55 minutos, o hasta que el pollo esté bien cocido y tierno y la salsa se reduzca ligeramente. Agregue el jugo de limón y el perejil y sazone, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada de pollo Herby, mezcle el ajo molido, el vinagre, la miel, el jugo de limón y el aceite en un tazón hasta que se emulsionen, luego sazone con un poco de sal y pimienta negra recién molida.", "Coloque los ingredientes restantes en un recipiente y mezcle. Agregue el aderezo y mezcle hasta que esté bien combinado.", "Para servir, espolvorea el guiso de pollo en los platos para servir y coloca una ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_harissa_chicken_and_92344", "title": "Harissa pollo y papas guisadas con ensalada de garbanzos herby", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de pierna magra de cordero de 600 g / 1 lb 5 oz, cortados en cubos del tamaño de un bocado", "1-2 cucharadas de pasta harissa", "400g de tomates cortados en lata con hierbas", "2 x 410 g de garbanzos, escurridos", "12 albaricoques secos (opcional)", "Cilantro fresco pequeño (aproximadamente 30 g / 1 oz), aproximadamente picado"], "method": ["Precalentar el horno a 170C / 150C Ventilador / Gas 3½", "Ponga el cordero en una cazuela mediana a prueba de horno y cubra uniformemente con la pasta Harissa.", "Vierta los tomates y 300 ml / 10 fl oz de agua. Llevar a ebullición a fuego medio y revolver bien.", "Cubra bien con papel de cocina y hornee durante 1 hora.", "Agregue los garbanzos y los albaricoques, si está usando, y hornee por 30-45 minutos, o hasta que el cordero esté tierno.", "Agregue el cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_harissa_lamb_with_92207", "title": "Harissa cordero con garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/harissa_lamb_with_92207_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de crema", "1 cucharada de harissa", "1 limón, solo jugo", "Filetes de rape de 600 g / 1 lb 5 oz", "Harina normal de 350g / 12oz", "1 cucharadita de sal", "2 cucharaditas de levadura fresca", "300ml / ½ pinta de agua tibia", "azúcar pizca", "120 ml / 4 oz de yogur natural", "150ml / ¼ pinta de aceite de oliva", "1 granada, semillas retiradas", "1 manojo de menta fresca", "1 manojo de cilantro fresco", "2 naranjas de sangre, segmentadas, jugo reservado", "2-3 tsp zumaque, al gusto", "2 cucharadas de melaza de granada", "3 cucharadas de aceite de oliva", "2 cucharaditas de semillas de sésamo", "2 cucharaditas de orégano seco", "2 cucharaditas de mejorana seca", "2 tsc sumac", "1 cucharadita de sal", "2 cucharaditas de comino", "3-4 cucharadas de aceite de oliva virgen extra"], "method": ["Para el rape, mezcle la crème fraîche, la harissa y el jugo de limón en un tazón lo suficientemente grande como para acomodar el rape. Extienda el adobo sobre el pescado, cubra y refrigere durante 2 horas.", "Para el pan plano, mezcle la harina y la sal en un tazón grande. Suavice la levadura en el agua tibia con el azúcar. Agregue a la harina junto con el yogur y el aceite de oliva. Amasar durante 15 minutos, o hasta que la masa esté suave y elástica. Cubra y descanse en un lugar cálido hasta que duplique su tamaño (esto tomará alrededor de una hora).", "Divida la masa en bolas aproximadamente del tamaño de pelotas de tenis. Cuando esté listo para usar, ruede en rondas planas.", "Cocine en una sartén seca y caliente hasta que se formen ampollas en ambos lados. Envuelva en paños de cocina y mantenga caliente en un horno bajo hasta que esté listo para servir.", "Precalentar el horno a 250 ° C / 230 ° Ventilador / Gas 9.", "Para el rape, raspe la mayor parte del adobo y coloque en una bandeja para hornear. Asar durante 6-8 minutos, dependiendo del grosor. Reservar para descansar", "Mientras el rape descansa, combine todos los ingredientes de la ensalada en un tazón.", "Para servir, mezcle los ingredientes zaatar junto con el aceite de oliva para hacer una pasta suelta. Extienda un poco de la mezcla de zaatar sobre los panes planos y colóquela en una porción de tablas o platos. Esparce la ensalada sobre la parte superior y corta el rape para que se disperse."], "url": "www_bbc_co_uk_food_recipes_harissa_roasted_monkfish_07705", "title": "Rábano asado con Harissa con naranja de sangre, zumaque, granada y pan plano za'atar", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "2 cucharadas de comino molido", "2 cucharadas de cilantro molido", "1 kg / 2 lb 4 oz de filete de cordero, cortado y cortado en trozos pequeños", "Jengibre fresco de la raíz de 2.5cm / 1in, finamente rallado", "2 cebollas, en rodajas finas", "250ml / 9fl oz de vino blanco seco", "400g de tomates cortados en lata", "2 cucharadas de puré de tomate", "2 cucharadas de miel clara", "1½ cucharada de pasta harissa (preferiblemente rosa)", "½ limón, jugo y corteza finamente rallada solamente", "400 g de frijoles cannellini de lata, escurridos y enjuagados", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente 2 cucharadas de aceite en una sartén honda a prueba de horno o en una cazuela a prueba de fuego. Espolvorea el comino y el cilantro sobre las piezas de cordero y freír en dos lotes en el aceite caliente durante unos 5 minutos o hasta que se dore. Retire con una espumadera y déjelo a un lado.", "Vierta el aceite restante en la sartén, agregue el jengibre y las cebollas y fría a fuego alto durante 10 minutos hasta que estén blandos. Verter el vino y hervir durante 2-3 minutos, revolviendo y raspando el fondo de la sartén para incorporar todos los trozos carnosos caramelizados.", "Agregue todos los ingredientes restantes, excepto los frijoles, y revuelva bien, luego devuelva el cordero a la sartén, sazone con sal y pimienta y deje que hierva.", "Cubra con una tapa y transfiéralo al horno para cocinar durante 1 hora y 15 minutos. Agregue los frijoles y vuelva al horno para cocinar durante 15 minutos, o hasta que el cordero esté tierno."], "url": "www_bbc_co_uk_food_recipes_harissa_spiced_lamb_with_59491", "title": "Harissa especiado cordero con frijoles cannellini", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/harissa_spiced_lamb_with_59491_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4lb 8oz pierna de cordero", "sal marina y pimienta negra recién molida", "200g / 7oz de yogur natural al estilo griego", "4 cucharaditas de semillas de alholva, asadas en seco y trituradas", "3 cucharadas de rose harissa", "3 hojas de lima kaffir", "2 cucharaditas de cúrcuma molida", "4 dientes grandes de ajo, aplastados", "1 lima, ralladura fina y jugo", "2 cucharadas de ghee o aceite vegetal", "2 cucharadas de semillas de comino", "aceite de ajo, para lloviznar", "Pimientos del padron 300g / 10½oz", "2 manojos de migas de pan finas, secas y naturales (no doradas)", "1 cucharada de zumaque", "1 limón sin cebar, ralladura fina solamente", "4 melocotones grandes, deshuesados ​​y cortados en 10 cuñas", "1 cebolla roja, finamente rebanada", "1 cucharada de pul biber de copos de chile", "½ limón, solo jugo", "aceite de oliva virgen extra", "200 g / 7 oz de queso feta, desmenuzado", "pequeño manojo de hojas de menta fresca, cortado en tiras finas"], "method": ["Con un cuchillo afilado, corte tres barras en la parte superior del cordero y dos en la parte inferior.", "Alinee una bandeja grande para hornear con papel de hornear. Mezcle todos los ingredientes del marinado (solo necesita la mitad del jugo de lima) en un tazón y sazone generosamente con sal y pimienta. Transfiere a una licuadora y blitz para formar una pasta suave.", "Coloque el cordero en la bandeja de hornear y masajee la pasta, especialmente en las barras y alrededor de las áreas de los huesos. Cubra y coloque en la nevera durante al menos 1 hora, o preferiblemente durante la noche.", "Precalentar el horno 220C / 200C Fan / Gas 7.", "Coloque el cordero en el horno e inmediatamente reduzca la temperatura a 190C / 170C Fan / Gas 5. Asar durante 1 hora. (Alternativamente, cubra el cordero con papel de cocina y cocine lentamente a 180C / 160C Fan / Gas 4 durante 4 horas).", "Mientras tanto, para hacer los pimientos, coloque una sartén grande a fuego alto. Agregue el comino y suficiente aceite de ajo para cubrir la base de la sartén. Agregue los pimientos de padron y saltee durante 2 minutos, asegurándose de que estén cubiertos con semillas de comino y aceite. Cubra con una tapa y sacuda la sartén. Cocine por 1 minuto o hasta que las pieles se doren y se formen ampollas. Transfiera a un plato de servir.", "Freír las migas de pan en la sartén a fuego medio-alto durante 30 segundos, o hasta que estén doradas y crujientes. Retirar del fuego y agregar el zumaque y la ralladura de limón, luego esparcirlo sobre los pimientos.", "Ponga los melocotones, cebolla roja, hojuelas de chile, jugo de limón y una buena llovizna de aceite de oliva en un tazón. Sazone generosamente con sal y pimienta y mezcle bien. Transfiera a un plato de servir y esparza sobre el queso feta y la menta.", "Cubra el cordero sin apretar con papel de cocina y deje reposar durante 10 minutos antes de servir.", "Cortar el cordero en rodajas gruesas y servir junto con los pimientos y la ensalada."], "url": "www_bbc_co_uk_food_recipes_harrissa_lamb_with_24616", "title": "Harissa cordero con pimientos comedron fritos y ensalada de melocotón, queso feta y menta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vodka de 50ml / 2fl oz", "jugo de naranja, para recargar", "1 cucharada de Galliano, o similar anís y licor con sabor a hierbas", "1 rodaja de naranja, para decorar", "1 cereza, para adornar"], "method": ["Vierta el vodka en un vaso alto y rellénelo con jugo de naranja.", "Con cuidado agregue el Galliano a la parte superior de la bebida para crear una capa separada.", "Servido con una rodaja de naranja y una cereza."], "url": "www_bbc_co_uk_food_recipes_harveywallbanger_86374", "title": "Harvey wallbanger", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo, golpeado", "4 papas medianas, peladas (como maris piper o king Edwards)", "1 cebolla mediana", "sal y pimienta", "aceite vegetal para freír"], "method": ["Rallar gruesamente las papas y la cebolla en una toalla de té limpia y luego exprimir el exceso de líquido girando la toalla. Coloque la mezcla en un tazón grande.", "Agregue el huevo, un buen par de pizcas de sal y pimienta negra recién molida. Mezcle bien los ingredientes. (Debe salar la mezcla bien, de lo contrario, los hash browns pueden ser bastante insulsos).", "Caliente un buen glug de aceite en una sartén de base pesada y cuando el aceite esté caliente (pero no humeando), agregue cucharadas de la mezcla de patata en la sartén y aplaste en empanadas de aproximadamente 1 cm de grosor. Voltee una vez dorado y crujiente - alrededor de 2-3 minutos por cada lado.", "Sirva caliente como plato de desayuno o cena. Especialmente bueno con tocino y huevos."], "url": "www_bbc_co_uk_food_recipes_hashbrowns_12454", "title": "Hash browns", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 tomates de ciruela", "sal marina", "pimienta negra recién molida", "8 lonchas finas de tocino sin corteza", "1 cucharadita de miel líquida", "6 papas medianas", "1 cebolla pequeña", "1 huevo grande de gallinas camperas, golpeado", "1 cucharada de harina normal", "2 cucharadas de hierbas picadas (por ejemplo, tomillo, romero o cebollín)", "1 cucharada de aceite de oliva", "3 cucharadas de aceite vegetal", "ramitas de romero"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cortar los tomates por la mitad a lo largo, sazonar con sal y pimienta, y colocar en una bandeja para hornear. Enrolle cada una de las lonchas de tocino en un rollo apretado y colóquelas en la misma bandeja. Rocíe los rollos de tocino con la miel y hornee durante 20 minutos o hasta que los tomates estén suaves y el tocino esté crujiente.", "Pele las papas y la cebolla, ralladuras gruesas, luego envuelva con un paño limpio y exprima el exceso de líquido. Coloque en un tazón, agregue el huevo batido, harina, hierbas picadas, una cucharadita de sal marina y aceite de oliva, y mezcle bien.", "Caliente una cucharadita de aceite vegetal en una sartén hasta que esté caliente, y luego agregue dos cucharadas colmadas de la mezcla de papa.", "Aplastarlos plana y freír suavemente en ambos lados hasta que estén dorados. Manténlos calientes en el horno mientras cocinas los hash browns restantes, agregando un poco de aceite adicional a la sartén cada vez.", "Sirva los hash browns con las mitades de tomate asadas, los rollos de tocino crujientes y el romero."], "url": "www_bbc_co_uk_food_recipes_hashbrownswithbaconr_72910", "title": "Hash browns con rollos de tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz pequeñas papas bebé", "Lonjas de tocino de 300 g / 10½ oz, cada una cortada en 3 tiras", "pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6", "Corte rebanadas estrechas en las papas, pero no hasta la base. Haz las rebanadas un poco más angostas que una moneda de una libra.", "Envuelva cada papa en la mitad de una loncha de tocino y colóquela en una bandeja para hornear. Hornee durante 30-40 minutos, o hasta que las papas estén cocidas."], "url": "www_bbc_co_uk_food_recipes_hasselback_bacon_61171", "title": "Hasselback patatas con tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hasselback_bacon_61171_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 patatas asadas medianas", "3 cucharadas de mantequilla, derretida", "pimienta de limón y sal al gusto", "gran puñado de queso parmesano (o un queso duro vegetariano similar), rallado", "2 cucharadas de pan rallado seco"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Pele las papas o deje la cáscara y frote bien.", "Haga pequeñas rodajas the del camino a través de cada patata, a lo largo de todo (si la papa se coloca en una cuchara grande, los bordes de la cuchara evitarán que corte en lonchas a través de la papa).", "Coloque las papas en un molde para hornear engrasado. Cepille la superficie de la papa con mantequilla derretida, rocíe con sal y pimienta.", "Hornee en el horno por 45 minutos.", "Retire del horno y espolvoree con queso parmesano y pan rallado.", "Regrese al horno y continúe horneando durante 15 minutos o hasta que las papas estén tiernas y la corteza esté ligeramente dorada. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_hasselbackpotatoes_72995", "title": "Papas Hasselback", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz cordero conjunta", "100ml / 3½fl oz de suero de leche", "2 dientes de ajo, ligeramente triturados", "1 ramita de romero, más o menos picada", "1 ramita de tomillo, toscamente picada", "2 cucharadas de aceite de oliva", "heno culinario, para fumar", "400g / 14oz brócoli que brota púrpura, para servir", "2 lechugas Little Gem, partidas a la mitad, para servir", "1 limón, cortado en cuñas, para servir", "Harina normal 225g / 8oz", "½ cucharadita de polvo de hornear", "225 g / 8 oz de puré de papa (sin mantequilla ni leche)", "Patatas de 225 g / 8 oz, ralladas y cualquier exceso de líquido exprimido", "350ml / 12fl oz de leche entera", "1 manojo de hojas de ajo silvestre picadas", "2-3 cucharadas de aceite de oliva, para freír", "sal y pimienta negra recién molida", "manojo de menta, picado", "pizca de sal", "1 cucharada de vinagre de vino tinto", "almidón espesante instantáneo, para espesar", "4½ cucharadas de whisky irlandés de malta", "1 cucharadita de miel", "1 pomo de mantequilla", "30g / 1oz de mantequilla", "55 g / 2 oz de avena", "1 ramita de romero, hojas recogidas y picadas"], "method": ["Coloque la rabadilla de cordero en una bolsa resellable o en un plato tapado. Agregue el suero de leche, el ajo, el romero, el tomillo y un poco de pimienta negra recién molida. Selle la bolsa o tape el plato y déjelo marinar en la nevera durante al menos 2 horas, o preferiblemente durante la noche.", "Para la caja, mezcle todos los ingredientes en un tazón. Calentar un poco de aceite en una sartén. Para verificar el condimento, cocine una pequeña cantidad de la mezcla por 2 minutos en cada lado. Sazone la mezcla restante con sal y pimienta, al gusto, y déle forma a las hamburguesas. Freír durante 2 minutos por cada lado y mantener caliente hasta que esté listo para servir.", "Para el gel de menta, coloque la menta y 100 ml / 3½ fl oz de agua en una licuadora. Blitz y luego colar. Agregue la sal, el vinagre y suficiente almidón para espesar. Dejar de lado.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para el cordero, coloque una cazuela a prueba de fuego a fuego alto y agregue el aceite. Una vez caliente, dore el cordero por todas partes. Transfiera al horno para asar durante 10 minutos y luego déjelo reposar.", "Mientras tanto, coloca una capa de heno en una sartén grande con tapa. Coloque a fuego alto durante 5-10 minutos, o hasta que el heno solo esté humeando. Coloque un trozo de papel de aluminio sobre el heno y coloque las chuletas de la lámpara encima. Cubra con una tapa y fume por un minuto. No dejes desatendido Coloque el cordero a un lado en un lugar cálido para descansar hasta que esté listo para servir.", "Para la salsa de whisky, combine el whisky y la miel en una olla pequeña. Cocine a fuego medio hasta que el volumen del líquido se reduzca a la mitad. Agregue la mantequilla y reserve.", "Para la harina de avena, derrita la mantequilla en una sartén, agregue la avena y la tostada durante 2 minutos o hasta que estén doradas. Agregue el romero y reserve.", "Cueza al vapor el brócoli hasta que esté tierno. Calentar un poco de aceite de oliva en una sartén plancha y freír el Little Gem con el lado del corte hacia abajo hasta que las líneas aparezcan en la superficie.", "Sirva el cordero con la boxty, gel de menta, salsa de whisky, harina de avena, brócoli, Little Gem y rodajas de limón para exprimir."], "url": "www_bbc_co_uk_food_recipes_hay-smoked_lamb_garlic_10482", "title": "Cordero ahumado, salsa de ajo y salsa de whisky", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de bayas de trigo", "300 ml / 10 fl oz caldo de hongos / caldo de verduras", "60g / 2¼ oz de queso azul ahumado, rallado", "1 limón sin cebar, solo cáscara", "1 cucharada de perejil fresco picado", "4 bebé apio nabo de 8cm / 3 pulgadas de diámetro, pelado, raíces removidas y lavadas", "120 g / 4½ oz de heno (limpia comer heno de la tienda de mascotas y no heno de cama)", "120g / 4½oz de mantequilla, derretida", "50 g / 1¾oz de hojuelas de levadura", "100ml / 3½fl oz de caldo / salsa de pollo reducido", "piel de 1 pollo grande", "300ml / 10fl oz de suero de leche", "50g / 1¾oz de crema doble", "50g / 1¾oz de mantequilla, cortada en cubos", "splash verjus", "sal y pimienta negra recién molida", "setas de trompeta negra", "brotes de berro", "mantequilla, para freír"], "method": ["Para hacer el pudín de grano de trigo, vierta agua hirviendo sobre las bayas de trigo para cubrir y deje reposar durante la noche.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer el apio nabo, coloque el heno en una bandeja para hornear y tueste en el horno durante 5-10 minutos. Vigílala en caso de que comience a arder. Dejar enfriar y humedecer con un poco de agua.", "Envuelva el apionabo en una capa uniforme del heno, colóquelo en una bandeja para hornear y cubra bien con papel de aluminio. Hornee durante 20 minutos, o hasta que el ablandante se guarde para enfriar, aún envuelto.", "Para hacer la mantequilla de heno, pique finamente 15 g / ½ onza del heno que se utilizó para hornear el apionabo y vierta la mantequilla derretida para infundir en un tazón. Cuele la mezcla a través de un colador y coloque la mantequilla en la nevera para enfriar, descartando el heno.", "Para hacer migas de pollo y levadura, coloque la piel de pollo entre dos bandejas planas para hornear y cocine en el horno durante 5-10 minutos. Retirar del horno, enfriar y cortar bruscamente la piel.", "Tueste las hojuelas de levadura en una sartén seca a fuego medio hasta que estén doradas. Deje que se enfríe, luego mezcle con la piel de pollo y reserve.", "Para hacer la salsa de suero de leche, cocine a fuego lento el suero de leche a fuego medio hasta que se reduzca en dos tercios. Agregue la crema y bata gradualmente la mantequilla. Pase a través de un colador, sazone con sal y pimienta y agregue el verjus. Mantener caliente", "Para terminar el pudín de grano de trigo, escurrir las bayas de trigo y cocinar en una cacerola con el caldo hasta que estén tiernas. Agregue el queso, la ralladura de limón y el perejil, revuelva y mantenga caliente hasta que esté listo para servir.", "Para terminar el apionabo, quítelo del heno, caliente la mantequilla infundida con heno en una sartén y dore el apionabo por todos lados hasta que se dore. Cepille cada apio con un caldo de pollo reducido y enrolle la miga de pollo y levadura.", "Freír los champiñones de trompeta y las raíces de apio nabo en un poco de mantequilla, sazonar con sal y pimienta y escurrir.", "Para servir, coloque un poco del pudín de trigo en cada plato y coloque un apionabo al costado, espolvoree un poco de salsa de suero de leche y espolvoréese con los champiñones, las raíces de apio y los brotes de berros."], "url": "www_bbc_co_uk_food_recipes_hay_baked_celeriac_with_25534", "title": "Palentón al horno con piel de pollo, suero de leche y pudín de grano de trigo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, deshuesadas y sin piel", "40 g / 1½ oz de avellanas sin cáscara", "25 g / 1 oz de queso parmesano, recién rallado, más extra para servir", "2 limones, zested luego cortados por la mitad", "2 ramitas de tomillo, solo hojas", "Pan rallado panko japonés 40g / 1½ oz", "Harina normal de 75g / 3oz", "sal marina y pimienta negra recién molida", "2 huevos de gallinas camperas, golpeados", "250g / 9oz de mantequilla", "2 cabezas de lechuga Little Gem, hojas separadas"], "method": ["Coloque el pollo entre dos pedazos de papel resistente a la grasa y aplánelo con un rodillo hasta aproximadamente 1 cm de grosor.", "Coloque las avellanas, el parmesano, la ralladura de limón y el tomillo en un procesador de alimentos y mezcle con las migas finas.", "Agregue las migas de pan y pulse rápidamente para romper las migajas y luego incline sobre un plato.", "Esparce la harina en un plato y sazone con sal y pimienta negra. Polvo de pollo en la harina.", "Pon los huevos batidos en un tazón. Sumerja el pollo en el huevo, luego en las migas de pan de avellana, asegurándose de cubrir cada lado a fondo.", "Calentar la mantequilla en una sartén grande, agregar las pechugas de pollo y freír hasta que estén doradas, unos cinco minutos por cada lado, rociando con la mantequilla sobre la marcha.", "Escurre sobre papel de cocina y luego termine con un poco más de queso parmesano.", "Para servir, coloque el escalope de pollo en cada plato y rocíe sobre la mantequilla restante en la sartén, luego termine con un chorrito de jugo de limón.", "Apila las hojas de ensalada junto con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_hazelnut_and_20767", "title": "Pollo con corteza de parmesano y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hazelnut_and_20767_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de avellanas blanqueadas", "5 claras de huevo grandes de gallinas camperas", "275 g / 9½ oz de azúcar en polvo", "½ cucharadita de extracto de vainilla", "2 cucharadas de harina de maíz", "100 g / 3% C2% BDoz% 20plain% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "Crema doble 450ml / 16fl oz", "1 cucharada de azúcar glas, tamizada, más extra para servir", "200ml / 7fl oz de crema fresca, revuelta", "Frambuesas frescas de 300g / 10½ oz"], "method": ["Para los merengues de avellana, fría las avellanas en una sartén a fuego medio durante 4-5 minutos, o hasta que estén tostadas y doradas, agitando la sartén con regularidad. Retirar del fuego y reservar para enfriar. Una vez que se haya enfriado, picar aproximadamente.", "Corta tres trozos de pergamino para hornear, cada uno lo suficientemente grande como para revestir una bandeja para hornear. Con un lápiz y un plato o tazón volteado con el tamaño adecuado, dibuje un círculo de 25 cm en el centro de dos de los pedazos de papel de hornear, y un círculo de 20 cm en el tercero.", "Engrase ligeramente tres bandejas para hornear con un poco de aceite y alinee con los pedazos de papel para hornear, con el lápiz hacia abajo. Debería poder ver los círculos a través del papel.", "Precalentar el horno a 150C / 300F / Gas 2.", "Batir las claras de huevo en un tazón grande hasta que se formen picos rígidos cuando se quite el batidor. (Las claras de huevo están listas cuando puedes girar el recipiente boca abajo sin que se caigan los huevos).", "Poco a poco agregue el azúcar, una cucharada a la vez, batiendo después de cada adición.", "Agregue el extracto de vainilla y la harina de maíz hasta que estén bien combinados. La mezcla de merengue ahora debería ser brillante y asemejarse a la espuma de afeitar. Dobla casi todas las avellanas picadas en la mezcla de merengue.", "Divida la mezcla de merengue entre las tres bandejas para hornear, vertiendo la mezcla dentro de los límites de los círculos y extendiéndola con una espátula para suavizar. Dejar de lado.", "Reduzca la temperatura del horno a 130 C / 270 F / Gas ½.", "Hornee los dos merengues más grandes, uno encima del otro, durante 1 hora y media, cambiando sus posiciones a la mitad de la cocción. (Reduzca la temperatura del horno si los merengues comienzan a dorarse demasiado.) Retire del horno y deje enfriar. Cocine el tercer merengue de la misma manera (si todos pueden caber en el horno a la vez, tanto mejor).", "Una vez que esté frío, cuidadosamente pele el papel de la parte inferior de cada merengue.", "Para el llenado, suspenda un recipiente resistente al calor sobre una bandeja con agua apenas hervida (no permita que la base del recipiente toque la superficie del agua). Agregue las piezas de chocolate al tazón y revuelva hasta que se derrita. Dejar enfriar por unos minutos.", "Mientras tanto, bate la crema con el azúcar glas hasta que se formen picos suaves cuando se quite el batidor. Dobla la crème fraiche hasta que esté bien combinada.", "Transfiera uno de los merengues grandes a un plato para servir o a un soporte para pasteles. Cuchara sobre un tercio de la mezcla de relleno. Con una cuchara de postre, rocíe el merengue y rellene con un poco del chocolate derretido y espolvoree un tercio de las frambuesas.", "Cubra el primer merengue con el segundo del mismo tamaño y repita el proceso de llenado. Finalmente, agregue el merengue más pequeño a la torre y llénelo como antes, rociando sobre el resto del chocolate y espolvoreando con las frambuesas y las avellanas tostadas reservadas. Polvo con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_hazelnut_and_chocolate_32339", "title": "Avellana y chocolate 'vacherin'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hazelnut_and_chocolate_32339_16x9.jpg", "isVegetarian": true, "recommendations": 0}]