[{"isVegetarian": false, "title": "Duck breast with calvados and apple", "url": "www_bbc_co_uk_food_recipes_duck_breast_with_52263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small duck breasts (about 140g/5oz each)", "1 tbsp oil", "knob of butter", "2 dessert apples, peeled, cored and cut into thin slivers", "100ml/3½fl oz calvados", "200ml/7fl oz apple juice, plus an extra tablespoon", "100ml/3½fl oz chicken stock", "1 rounded tsp cornflour", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the skin from the duck breasts and season well with salt and pepper on both sides. Heat the oil in a large frying pan and fry the breasts for four minutes on each side. Remove from the pan and set aside to rest. ", "Add a large knob of butter to the pan and add the apple slivers. Cook for 4–5 minutes, moving regularly, or until cooked through and golden-brown, but not mushy. Remove from the pan and set aside to rest.  ", "Deglaze the pan with the calvados and bring to the boil. Allow to bubble away until the volume of liquid has reduced by half. ", "Add the apple juice and stock and bubble to reduce the volume the liquid by half again. Pour in the resting juices from the duck.  ", "Add the cornflour to a bowl with a tablespoon of apple juice. Pour in a little hot liquid from the pan and stir until smooth. ", "Pour the cornflour mixture into the pan and stir until smooth. Bring to the boil to thicken slightly and season with salt and pepper. Return the apple slices to the pan to warm through and allow everything simmer away for 1 minute. ", "Divide the apple slices between four plates. Slice the duck breasts on the diagonal and place on top of the apple. Drizzle with the sauce and serve."]}, {"isVegetarian": false, "title": "Duck breast with confit duck cassoulet", "url": "www_bbc_co_uk_food_recipes_duck_breast_with_confit_69482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 confit duck legs", "2 tbsp fat from the confit duck", "2 garlic cloves, finely chopped", "1 large shallot, finely chopped", "2 tbsp roughly chopped fresh rosemary leaves", "50g/1¾oz pancetta lardons", "1 bay leaf", "400g tin cannellini beans, drained", "¼ hispi cabbage, thinly shredded", "275ml//9fl oz chicken stock", "100g/3½oz unsalted butter", "1 tbsp chopped fresh flat leaf parsley", "2 tbsp runny honey", "4 x small duck breasts, skin on, scored", "200ml/7fl oz duck jus, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Cut the duck legs in half. Shred the meat off from the top half and reserve.", "Heat a casserole dish and add the duck fat, once hot add the garlic, shallot and rosemary and cook for 2-3 minutes. ", "Add the pancetta and cook for a minute until crispy.", "Add the bay leaf, beans, cabbage and chicken stock, once hot add the butter and mix until you form an emulsion.", "Finish with the parsley and shredded duck leg meat.", "For the roasted duck breast, heat an ovenproof frying pan and place the duck skin side down and cook for 4-5 minutes until golden-brown and crisp, and turn over. ", "Transfer to the oven for 4-6 minutes.", "Allow to rest for at least 8 minutes before slicing and serving.", "Heat a small frying pan and add a little oil, once hot add the trimmed duck leg and the honey and cook for 1-2 minutes or until golden-brown. ", "To serve, place the confit duck cassoulet in the centre of a plate and top with the sliced duck breast and the honey-glazed duck leg. Dress the plate with the duck jus."]}, {"isVegetarian": false, "title": "Duck breasts with beetroot, apple and braised red cabbage", "url": "www_bbc_co_uk_food_recipes_duck_breasts_with_37538", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bunch baby heritage beetroots, cleaned and trimmed, leaves reserved", "200ml/7fl oz white wine vinegar", "75g/2½oz caster sugar", "1 tsp salt", "½ tsp black peppercorns", "75g/2½oz unsalted butter", "100g/3½oz unsalted butter", "1 red onion, finely chopped", "½ red cabbage, cored and finely sliced", "200ml/7fl oz red wine vinegar", "50g/1¾oz clear honey", "100g/3½oz demerara sugar", "1 bay leaf", "2 star anise", "1 cinnamon stick", "salt", "600g/1lb 5oz raw beetroot, peeled, cut into chunks", "1 onion, roughly chopped", "½ garlic clove, roughly chopped", "2 sprigs fresh thyme, leaves only", "2 cooking apples (preferably Bramley), peeled, cored and chopped", "50g/1¾oz butter", "2-4 tbsp caster sugar, to taste", "4 tbsp olive oil", "4 duck breasts, trimmed", "curly kale, wilted and buttered ", "jus or gravy"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the roasted beetroot, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut them in half. ", "Heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar is dissolved. Put the reserved beetroot leaves in a bowl and pour over the hot vinegar mixture. Mix together, coating the leaves. Set aside to pickle for at least an hour, but preferably 24 hours.", "For the braised red cabbage, heat a large frying pan and add the butter. Once hot, add the onion and cook for 2-3 minutes, then add the cabbage and cook for 2 minutes. Stir in the vinegar, honey, sugar and spices and season with salt. Turn down the heat and cook for 30-40 minutes, or until the cabbage is very tender.", "For the beetroot purée, place all of the ingredients into a food processor and blend to a purée.", "Transfer the purée to a frying pan set over a low heat. Cook for 30-40 minutes, stirring occasionally. Season with salt and pepper.", "For the apple purée, put the cooking apples, butter and 2-3 tbsp water in a saucepan. Cover and cook for 4-5 minutes, or until the apples have broken down. Stir and season with the sugar and a little salt. Set aside and keep warm.", "For the duck, preheat the oven to 200C/180C Fan/Gas 6. ", "Heat an ovenproof frying pan until very hot and add the oil. Add the duck breasts fat-side down and cook for 3-4 minutes, or until golden-brown. Turn over and cook for a further 1-2 minutes. Transfer to the oven for 8-10 minutes. Remove from the oven and set the duck aside to rest for 5 minutes.", "Meanwhile to finish the roasted beetroot, melt the butter in a frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.", "To serve, dress the plates with the beetroot and apple purée. Place the red cabbage on the plates with the duck breast, roasted beetroot, kale, beetroot leaves and drizzle with jus or gravy."]}, {"isVegetarian": false, "title": "Duck burger and chips", "url": "www_bbc_co_uk_food_recipes_duck_burger_and_chips_40267", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duck_burger_and_chips_40267_16x9.jpg", "ingredients": ["2 large duck breasts", "2 tbsp Vacherin cheese, scooped from the middle", "2 banana shallots, peeled and sliced into thin strips", "1 tbsp butter", "250g/9oz girolle mushrooms, cleaned", "2 brioche buns", "vegetable oil, for deep frying", "2 King Edward potatoes, cleaned and chipped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck burger, roughly remove about two-thirds of the fat from each duck breast and then chop them into chunks and pass through a mincer. Season the meat well and form into two balls using your hands.", "Take one ball of meat and push a scoop of Vacherin into the centre. Form the meat around the Vacherin and pat down a little to make a classic burger shape. Repeat with the remaining ball and scoop of cheese.", "Preheat the oil in a deep fat fryer to 160C/325F (CAUTION: hot oil can be dangerous: Do not leave unattended.)", "Rinse the chipped potatoes under cold running water to remove any excess starch. Dry thoroughly on a clean tea towel and then place into the hot oil to cook for about 8-10 minutes. The chips should begin to lightly colour on the outside and be soft enough to crush between your fingers.", "Carefully remove the chips from the oil with a slotted spoon and drain on a plate lined with kitchen paper. Increase the oil temperature to 180C/350F", "In the meantime, heat a griddle pan over a high heat. Once hot, add the burgers and fry for 3-4 minutes on each side until nicely cooked on each side and just cooked through in the middle. If you like your burger fully cooked through, place in a hot oven for a few minutes to finish. Otherwise, place the burgers on to a plate to rest.", "Place the sliced shallots onto the hot griddle to caramelise. Cook for about two minutes.", "Heat the butter in a separate pan over a high heat. Add the mushrooms and fry for 3-4 minutes, or until just softened.", "When you are ready to eat, add the chips to the hot oil and cook for 2-3 minutes, or until golden-brown and crisp. Remove and drain on a plate lined with kitchen paper. ", "Serve the duck burgers with the shallots and mushrooms in a brioche bun."]}, {"isVegetarian": false, "title": "Duck confit with smoked-duck salad, caramelised pecans and blue-cheese dressing", "url": "www_bbc_co_uk_food_recipes_duck_confit_with_85583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ready-made confit duck legs ", "1 head Romaine lettuce (or similar firm, crisp lettuce), root trimmed, leaves cut into 2.5cm/1in thick slices", "1 smoked duck breast, sliced", "75g/2¾oz soft light brown sugar", "pinch cayenne pepper", "100g/3½ oz pecans", "pinch salt", "75g/2¾oz gorgonzola, roughly chopped", "50g/1¾ozmild, creamy blue cheese such as St Agur, roughly chopped", "1 garlic clove, finely chopped", "2 tbsp honey", "50ml/2fl oz buttermilk", "60g/2¼oz crème fraîche", "1 lemon, juice only", "dash Tabasco", "2 dashes Worcestershire sauce", "1 tbsp red wine vinegar", "75g/2¾oz ready-made mayonnaise", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, preheat the oven to 200C/180C Fan/Gas 6.", "Place the confit duck legs on a baking tray in the oven for 10 minutes to heat through.", "Meanwhile, for the caramelised pecans, heat a frying pan over a high heat until hot. Add the sugar and cayenne pepper and cook without stirring until the sugar has melted (swirl the pan carefully from time to time if you think the sugar will start to burn). ", "When the sugar starts to melt, add 50ml/2fl oz of water and swirl the pan to combine (CAUTION: boiling sugar is extremely hot. Handle very carefully.).\r\n Continue to cook over a high heat until the sugar melts to a deep-coloured caramel, then add the pecans and salt and stir to coat them in the caramel. ", "Transfer the caramelised pecans to a roasting tray, then bake in the oven for 4-5 minutes.", "Meanwhile, for the blue-cheese salad, in a large mixing bowl, beat the gorgonzola and St Agur until slightly broken down, then whisk in the garlic, honey, buttermilk and crème fraîche until well combined.", "Whisk in the lemon juice, Tabasco, Worcestershire sauce, vinegar and mayonnaise until well combined, then season, to taste, with salt and freshly ground black pepper.", "When the confit duck legs have heated through, remove them and the caramelised pecans from the oven and set aside until cool enough to handle. Shred the duck meat from the bone.", "To serve, pile the sliced lettuce leaves onto a serving platter and drizzle over the blue-cheese dressing. Top with the shredded confit-duck leg, slices of smoked duck and the caramelised pecans."]}, {"isVegetarian": false, "title": "Duck eggs en cocotte with wild mushrooms and Gruyère", "url": "www_bbc_co_uk_food_recipes_duck_eggs_en_cocotte_68169", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "1 tbsp olive oil", "2 shallots, finely chopped", "1 sprig fresh thyme", "½ garlic clove, finely chopped", "1 bay leaf", "handful wild mushrooms, cut into 2cm/¾oz in pieces", "100ml/3½fl oz dry white wine", "150ml/5fl oz double cream", "2 duck eggs", "20g/¾oz Gruyère, finely grated", "sea salt and freshly ground black pepper", "6–10 truffle slices, to garnish (optional) ", "4g fresh yeast", "40g/1½oz plain yoghurt", "200g/7oz plain flour", "½ tsp baking powder", "½ tsp salt", "olive oil, for greasing"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the bread, put the yeast and yoghurt in a bowl, add 120g/4½oz room-temperature water and mix. Set aside for 10 minutes.", "In a separate larger bowl, mix the flour, baking powder and a teaspoon of salt together. Add the water mixture to the flour mixture and mix evenly. Knead for 5 minutes in the bowl; the dough should be wet. Cover with a damp cloth and leave for about 2 hours.", "Knock any air out of the dough and divide it into four 120g/4oz balls. Oil a large baking sheet, put the dough balls on it spaced apart and cover with a teatowel. Leave to prove for 10–15 minutes.", "Preheat the oven to 200C/Fan 180C/Gas 6. Pat the dough balls down slightly to form a flat surface about 15cm/6in in diameter. Bake for 12–15 minutes (if you prefer you can cook on a lightly oiled griddle pan over a medium heat for 2–3 minutes on each side). Set aside. ", "To cook the eggs en cocotte, reduce the oven temperature to 180C/Fan 160C/Gas 4. Butter two 100ml/31/2fl oz ramekins or individual cocottes. Heat the oil in a saucepan and cook the shallots, thyme, garlic and bay until softened. Add the mushrooms and cook for 5 minutes. Pour in the wine and simmer until reduced by three-quarters. Pour in the cream and cook until reduced by half. Season with salt and pepper.", "Spoon a quarter of the mushroom sauce into the bottom of each ramekin, remove the thyme and bay, then crack in a duck egg and top with the remaining sauce. Bake for 3 minutes, or until the whites have started to set. Sprinkle over the Gruyère and bake for a further 4–8 minutes, depending on how you like your eggs cooked.", "Cut the bread into soldiers and toast. Garnish the egg pots with the truffle, if using, and eat immediately with the soldiers."]}, {"isVegetarian": false, "title": "Duck leg Charlottes", "url": "www_bbc_co_uk_food_recipes_duck_leg_charlotte_12940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices white bread, crusts removed ", "2 confit duck legs, from a tin, 100g/3½oz fat reserved", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "125g/4½oz wild mushrooms, cleaned and sliced", "200ml/7fl oz port", "300ml/10fl oz reduced brown veal stock ", "55g/2oz unsalted butter", "300g/10½oz flower sprouts"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/190C Fan/Gas 7. Moisten the bread with some of the reserved fat from the confit. Use two of the slices to line two ramekin dishes, making sure the bread overlaps and is well pressed into the ramekins.", "Heat a little duck fat in a saucepan over a medium heat and gently fry the shallot and garlic for 3–5 minutes, or until softened. Add the mushrooms and cook for 2 minutes.", "Heat a small saucepan over a medium–high heat. Pour in the port and reduce by half. Add the stock and simmer until you have a sticky sauce.   ", "Remove the skin from the duck and flake the meat into the pan containing the mushrooms. Add just enough sticky sauce to bind and mix. Spoon the mixture into the ramekins and seal with the remaining two slices of bread. Bake for 20 minutes.", "For the sprout flowers, pour 100ml/3½fl oz water into a saucepan and heat. Add the butter and, once it has melted, add the flower sprouts. Cook for 2–3 minutes, or until wilted and hot.", "Turn the Charlottes out of the ramekins onto warmed dinner plates. Serve with the remaining sticky sauce and the flower sprouts.  "]}, {"isVegetarian": false, "title": "Duck salad with blue cheese dressing", "url": "www_bbc_co_uk_food_recipes_duck_salad_with_blue_19571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 confit duck legs", "75g/3oz soft light brown sugar", "1 pinch cayenne pepper", "100g/3½ oz pecan nuts", "pinch salt", "75g/2½oz gorgonzola, roughly chopped", "50g/1¾oz St Agur blue cheese, roughly chopped", "1 garlic clove, finely chopped", "2 tbsp honey", "50ml/2fl oz buttermilk", "60g/2¼oz crème fraîche", "1 lemon, juice only", "dash Tabasco", "2 dashes worcestershire sauce", "1 tbsp red wine vinegar", "75g/2½oz mayonnaise", "1 head Romaine lettuce, cut into 2.5cm/1in thick slices"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Put the duck legs onto a tray in the oven for 10 minutes to heat through.", "Meanwhile, heat a frying pan until hot, add the sugar and cayenne pepper. When the sugar stars to melt, add 50ml/2floz of water and swirl to combine.", "Cook over a high heat until the sugar turns into a deep-coloured caramel, then add the pecan nuts and salt and stir to coat. Tip out onto a roasting tray and place in the oven for five minutes while you make the dressing.", "Put the gorgonzola and St Agur into a bowl and whisk to break down the cheese slightly, then add the garlic, honey, buttermilk and crème fraîche and whisk well.", "Add the lemon juice, Tabasco, Worcestershire sauce, vinegar and mayonnaise and whisk well until combined, then season with salt and black pepper.", "Remove the duck and pecans from the oven and allow to cool enough to handle, then shred the duck from the bone.", "Toss the lettuce with some of the dressing, just enough to coat the leaves, then add the shredded duck and pecans and toss together.", "Pile into a large bowl and serve straight away."]}, {"isVegetarian": false, "title": "Duck spring rolls with dipping sauces", "url": "www_bbc_co_uk_food_recipes_duck_spring_rolls_with_84656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp groundnut oil", "1 tsp grated fresh root ginger", "50g/1¾oz fresh shiitake mushrooms or soaked porcini mushrooms, sliced, stalks removed", "50g/1¾oz tinned bamboo shoots, drained and cut into matchsticks", "25g/1oz tinned water chestnuts, drained, sliced into small strips", "1 tbsp light soy sauce", "½ tbsp Chinese five-spice powder", "30g/1oz beansprouts, must be very fresh", "1 large spring onion, sliced lengthways", "½ small carrot, cut into matchsticks", "2 confit duck legs, meat shredded", "1 tbsp of oyster sauce", "1 tsp toasted sesame oil", "25-30 large spring roll wrappers, 15x15cm/6x6in square shape", "1 medium free-range egg, lightly beaten ", "vegetable oil, for deep-frying ", "1 tbsp vegetable oil", "1 small onion, chopped", "2 garlic cloves, crushed", "1 red chilli, finely chopped", "1 tsp fennel seeds, crushed", "50g/1¾oz dark brown sugar", "50ml/2fl oz dark soy sauce", "300ml/10fl oz tomato ketchup", "salt and freshly ground black pepper", "150g/5½oz caster sugar", "150ml/5fl oz rice wine", "75ml/2½fl oz grapefruit juice", "4 tbsp soy sauce", "1 tsp chilli flakes", "10cm/4in piece fresh root ginger, finely grated", "2 tbsp chopped coriander", "4 spring onions, chopped", "1 red chilli, chopped into rings"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the filling for the spring rolls, heat a wok and add the oil. Once hot add the ginger, mushrooms, bamboo shoots and water chestnuts. Cook for a couple of minutes.", "Add the soy sauce, Chinese five-spice powder, beansprouts, spring onions and carrot. And cook for 1 minute.", "Add the duck meat, oyster sauce and finish with the toasted sesame oil. Transfer to a dish and let this mixture cool before using it.", "To assemble the spring rolls, arrange one spring roll wrapper so that the corners are pointing upwards, downwards and to the sides.", "Spoon 2 teaspoons of filling near the bottom corner about 2cm/¾in from the edge. (Make sure the filling is cool but not too wet – otherwise the spring roll will be soggy and you will break the spring roll wrapper.)", "Roll the wrapper over the filling, squeezing any air out as you roll away from you. As you reach the middle bring the 2 side corners to the middle, making sure they overlap. Continue to roll and tuck the top edge in and seal it with a little of the beaten egg. ", "Repeat with the remaining spring roll wrappers and filling.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C. (CAUTION: Hot oil can be dangerous. Don't leave unattended)", "Deep-fry the spring rolls in batches for 5-6 minutes swishing them in the fryer until golden-brown. Remove and drain on kitchen paper. ", "For the barbecue dipping sauce, fry the onion and garlic in the oil with the chilli, fennel seeds and sugar. Add the soy sauce and ketchup and season with salt and pepper. ", "Bring to the boil and simmer for a few minutes to combine the flavours. ", "For the sweet and sour dipping sauce, put all the ingredients in a pan and bring to a boil and cook until it thickens, 5-8 minutes.", "To serve, place the spring rolls on a serving board or slate and pour the 2 dipping sauces in separate bowls and serve alongside. Garnish with fresh coriander, spring onions and fresh red chilli."]}, {"isVegetarian": false, "title": "Duck three ways with roasted pears, shallots, wilted chard and a red wine reduction", "url": "www_bbc_co_uk_food_recipes_duck_three_ways_with_24881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck legs, separated into drumstick and thighs", "15g/½oz table salt per kilo of duck legs ", "2-3 sprigs fresh thyme, leaves only", "300g/10½oz duck fat", "5 tbsp roughly chopped flatleaf parsley", "salt and freshly ground black pepper", "2 star anise", "1 cinnamon sticks", "½ tsp black peppercorns", "4 cloves", "½ tsp cumin seeds", "4 duck breasts, skin scored", "knob of butter, for frying", "110ml/3½fl oz red wine", "250ml/9fl oz beef stock", "50g/1¾oz butter", "100g/3½oz unsalted butter", "1 tbsp olive oil", "2 shallots, whole", "1 pear, cut into wedges", "1 head chard, sliced"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the duck, weigh the duck legs and thighs and place them on a sheet of clingfilm. Sprinkle them with 15g/½oz of salt per kilo and the thyme. Wrap in clingfilm and place in the fridge overnight.", "The next day, heat a heavy saucepan until warm and add the duck legs and duck thighs and enough duck fat to cover the meat totally.", "Bring the fat to a gentle simmer and cook for about 2½ hours, or until very tender. Carefully remove the legs from the fat and place on a roasting tray, draining off and reserving any excess fat.", "Remove the skin from the duck legs and set aside.", "Remove the skin, bone and tendons from the thigh and discard. Place the thigh meat into a bowl and mash with a fork. Gradually add about half of the duck fat. Add the chopped parsley and season with salt and freshly ground black pepper.", "Lay a piece of clingfilm on a board and place the duck mix in a thick line, arrange into a sausage shape and roll up the clingfilm like a Christmas cracker. Twist the ends and place in the fridge for at least two hours.", "Preheat the oven to 200C/400F/Gas 6.", "Place the spices in a dry frying pan and heat until the spices start to smell and pop in the pan.", "Place in a spice grinder and grind until a powder is formed. Sprinkle the duck breast with the spice powder.", "Heat a large ovenproof frying pan until medium-hot, then add the duck breast, skin-side down and cook over a gentle heat for 4-5 minutes, or until the fat has rendered out of the breast. You may need to do the breasts in batches if the pan isn’t large enough.", "Turn the heat up and crisp for one minute, before turning over and placing in the oven for 6-8 minutes.", "Remove from the oven and leave to rest, covered and in a warm place, for five minutes.", "In the meantime take the duck mix out of the fridge and slice.", "Heat a large frying pan and add the butter, once hot add the slices of duck and the reserved confit legs and cook both sides until golden-brown.", "For the sauce, heat a saucepan, add the red wine and cook until the volume of liquid has reduced by half, then add the beef stock and return to the boil.", "Reduce the quantity of liquid by half again, then whisk in the butter and season with salt and freshly ground black pepper. Keep warm.", "For the roasted pears and shallots, preheat the oven to 220C/425F/Gas 7.", "Heat half the butter and all the oil in a clean, small, ovenproof frying pan. Add the shallots and pears, stir well, then transfer to the oven and roast for 15 minutes, or until cooked and tender.", "The other half of the butter add to a separate pan and add the chard add a little water and cook until wilted.", "To serve, place the wilted chard on the plates, carve the duck breast into slices on the diagonal and place on the chard. Place a roasted drumstick on the plate alongside along with the discs of duck. Pile the roasted pears and shallots next to the duck and drizzle with the red wine sauce."]}, {"isVegetarian": false, "title": "Duck tikka", "url": "www_bbc_co_uk_food_recipes_duck_tikka_94383", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp cumin seeds", "1 tbsp coriander seeds", "2 whole cloves", "½ tsp black peppercorns ", "½ tsp ground fenugreek ", "1½ tsp ground turmeric", "2 tsp paprika", "½ tsp hot chilli powder", "¼ tsp ground cinnamon", "1 tsp flaked sea salt", "2 garlic cloves, crushed", "20g/¾oz piece fresh root ginger, finely grated", "4 tbsp plain yoghurt", "4 duck breasts, skin removed ", "small salad of sliced red onion, fresh coriander and lime wedges, to serve"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put the cumin and coriander seeds, cloves and black peppercorns in a dry frying pan over a medium heat. Cook for 1-2 minutes, stirring regularly until lightly toasted – you know they are ready when you can smell the spices. ", "Tip the toasted spices into a pestle and mortar or an electric spice grinder. Add the fenugreek, turmeric, paprika, chilli powder, cinnamon and salt to the warm, whole spices and grind them all into a fine powder.", "Tip into a mixing bowl and stir in the garlic, ginger and yogurt. Mix thoroughly and leave to stand while the duck is prepared. Cut each of the duck breasts into 7-8 bite-sized pieces. Stir into the spiced yogurt, cover with cling film and put in the fridge to marinate for at least four hours, or ideally overnight. ", "Take the duck pieces from the fridge and skewer several chunks onto long metal skewers, keeping 1-2cm/½-¾in between each piece. You should be able to fit roughly five chunks of duck onto each skewer. (Chuck away any marinade that is not coating the duck.)", "Preheat the grill to its hottest setting and place the skewers on a rack over a grill pan lined with foil. Slide onto a shelf as close as possible to the heat and cook for three minutes. Turn each skewer, holding with an oven cloth, and cook on the other side for a further 2-3 minutes, or until the duck is lightly charred on the outside but hot and juicy in the centre.", "Hold the hot skewers with an oven cloth and use a fork to slide the duck tikka chunks off the skewers and divide among six plates. Add a salad garnish of fresh red onion rings and coriander. Serve with lime wedges for squeezing over the duck. "]}, {"isVegetarian": false, "title": "Duck, orange and spinach salad", "url": "www_bbc_co_uk_food_recipes_duckandorangespinach_79909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, fat trimmed and skin scored", "2 large handfuls spinach", "½ orange, peeled, segmented and chopped", "½ shallot, sliced into rings", "1 tsp sesame oil", "½ orange, juice only", "splash soy sauce", "1 red chilli, finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place a frying pan over a medium heat. Once hot, place the duck breast skin-side down into the pan. Cook for five minutes, until the skin is browned and crisp.", "Drain some of the fat released from the duck and then turn the breast over and cook for a further three minutes, until the flesh has browned and then transfer into the oven to roast for ten minutes, or until cooked through.", "Meanwhile place the salad ingredients into a large bowl and mix well. ", "To serve, slice the duck breast and place onto the salad."]}, {"isVegetarian": false, "title": "Duck and radish crostini with feta salad", "url": "www_bbc_co_uk_food_recipes_duckandradishcrostin_81164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, juice only ", "100g/3½oz radish, grated", "50g/2oz smoked duck, chopped", "2 tbsp fresh basil leaves, torn", "½ ciabatta loaf", "2 tbsp olive oil", "salt and freshly ground black pepper", "fresh parsley leaves, to garnish", "1 tbsp olive oil", "½ lemon, juice only", "5 Little Gem lettuce leaves", "100g/3½oz feta cheese, crumbled", "1 tbsp chopped chervil ", "50g/2oz smoked duck breast, shredded", "4 radishes", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the crostini, heat a small frying pan. Add the lemon juice and grated radish and sauté for 2 minutes. Add the duck and basil and cook for a further few minutes.", "Heat a griddle pan until smoking. Slice the ciabatta in half horizontally, drizzle with the oil and season with salt and freshly ground black pepper. Chargrill for 1 minute on each side, then place the warm radish mixture on the ciabatta slices and garnish with parsley.", "For the feta salad, mix together the olive oil and lemon juice in a large bowl. Toss in the lettuce, feta, chervil, duck and radishes. Season with salt and freshly ground black pepper.", "Serve the crostini on a plate with the salad."]}, {"isVegetarian": false, "title": "Duck and sweetcorn broth", "url": "www_bbc_co_uk_food_recipes_duckandsweetcornbrot_88150", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint hot chicken stock", "½ red onion, finely sliced", "½ duck breast, skinned, thinly sliced", "40g/1½oz baby sweetcorn, chopped", "salt and freshly ground black pepper", "small handful fresh coriander leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the hot chicken stock into a small saucepan, add the onion and duck breast and simmer for 3-4 minutes or until the onion has softened and the duck has cooked all the way through. ", "Add the baby sweetcorn and season, to taste, salt and freshly ground black pepper. Simmer for a further 2-3 minutes. ", "Pour into a serving bowl, add the coriander leaves and serve."]}, {"isVegetarian": false, "title": "Duck and puff pastry with wild mushroom and red wine sauce", "url": "www_bbc_co_uk_food_recipes_duckandpuffpastrywit_79908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, excess fat trimmed and skin scored ", "150g/5oz puff pastry, rolled out on a floured surface to the thickness of a pound coin", "1 free-range egg, beaten", "1 tbsp olive oil", "25g/1oz wild mushrooms, such as chanterelles, carefully cleaned", "1 shallot, finely sliced", "50ml/2fl oz red wine", "½ beef stock cube", "knob of butter", "2 handfuls spinach, wilted in a frying pan"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place a frying pan over a medium heat. Once hot, place the duck breast skin-side down into the pan. Cook for five minutes, until the skin is browned and crisp.", "Drain some of the fat released from the duck and then turn the breast over and cook for a further three minutes, until the flesh has browned and then transfer into the oven to roast for ten minutes, or until cooked through.", "Using a 10cm/4in pastry cutter, cut out a pastry round. Brush the pastry round with the beaten egg and place onto a baking sheet. Place into the oven and bake for ten minutes, or until risen and golden.", "For the sauce, place the oil into a pan over a medium to high heat. Add the mushrooms and shallots and sauté for three minutes.", "Add the red wine, stock cube and butter and simmer until the sauce has thickened.", "To serve, place the duck on a bed of wilted spinach, drizzle over the sauce and top with the puff pastry round."]}, {"isVegetarian": false, "title": "Duck au poivre with herb rice and Tenderstem broccoli", "url": "www_bbc_co_uk_food_recipes_duckaupoivrewithherb_88561", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ duck breast, skin scored with a sharp knife", "salt and freshly ground black pepper", "50ml/2fl oz red wine", "100ml/3½fl oz double cream", "1 tsp black peppercorns, crushed", "100g/3½oz basmati rice", "1 tbsp butter, melted", "1 tbsp finely chopped fresh parsley", "75g/2¾oz Tenderstem broccoli, blanched, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Season the duck well with salt and freshly ground black pepper and place skin-side down in a small ovenproof frying pan. Place over a medium heat and fry on both sides until browned.", "Transfer to the oven and roast for 8-10 minutes, or until cooked to your liking. Remove the duck from the pan and transfer to a board to rest.", "Return the pan to the heat and pour in the wine. Bring to a simmer, scraping up the bits from the bottom of the pan with a wooden spoon. Simmer until reduced by half, then stir in the cream and black pepper. Simmer gently until needed.", "For the herb rice, place the basmati rice into a small saucepan and cover with cold water. Bring to the boil and simmer for 8-10 minutes, or until tender. Drain off any excess liquid.", "Brush the inside of a deep ramekin dish with the melted butter. Place the chopped parsley into the ramekin and tip it around to coat the buttered sides with the parsley.", "Tip the excess herbs and butter into the drained rice and mix well, then pack the rice into the ramekin.", "To serve, slice the duck into four and arrange on a serving plate. Turn out the ramekin of herb rice onto the plate. Serve with broccoli and pour the sauce over the duck."]}, {"isVegetarian": false, "title": "Duck breasts in limoncello with carrot and celeriac mash", "url": "www_bbc_co_uk_food_recipes_duckbreastsinlimonce_71300", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless duck breasts", "2 large lemons or fruit relating to liqueur used", "250ml/8fl oz limoncello ", "50g/2oz butter", "2 tbsp olive oil", "salt ", "freshly ground black pepper", "4 carrots, peeled and chopped", "1 celeriac, peeled and chopped into chunks", "olive oil to taste", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pat the duck breasts dry and place them in a shallow dish.  ", "Peel the lemons with a potato peeler so you get ringlets of lemon zest, then squeeze the juice from them.  ", "Scatter the lemon ringlets over the duck pour over the juice and limoncello and leave to marinate for about 30 minutes.", "Remove the duck from the marinade, dry on kitchen paper and season well all over with salt and pepper.  Do not discard the marinade.", "Clarify the butter in a large frying pan by letting it melt, then when it begins to foam, carefully lifting off the foam with a tablespoon, leaving just the clear, golden liquid.  Add the olive oil.  ", "When it is hot, place the duck breasts in the pan, skin-side down, and seal well on both sides.  ", "Reduce the heat and cook for about 12 minutes, turning the duck over from time to time.  This will give you medium-cooked duck, which I think is ideal for this dish.  ", "Now turn the heat up high, pour in the marinade and let it evaporate, turning the duck over and giving the pan a shake from time to time - this will help the sauce thicken.", "As soon as the sauce has thickened, remove the pan from the heat and place the duck breasts on a chopping board.  Leave to rest for about five minutes, then cut them into slices, arrange on four plates or one serving dish and pour over the sauce.  ", "To make the carrot and celeriac mash, boil the vegetables and strain off the liquid using a piece of muslin. ", "Return to the pan, season with salt and pepper and a drizzle of olive oil, and puree with a hand blender. ", "Serve with the limoncello duck."]}, {"isVegetarian": false, "title": "Duck breasts with pepper cream sauce, wild mushrooms, spinach, chard and potatoes en cocotte", "url": "www_bbc_co_uk_food_recipes_duckbreastswithpeppe_91398", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "8 garlic cloves, skin on, left whole, crushed", "1kg/2lb 3¼oz Jersey Royal potatoes, or similar new potatoes", "75g/2½oz butter", "1 tbsp butter", "2 shallots, finely chopped", "100g/3½oz wild mushrooms, cleaned and roughly chopped", "25ml/1fl oz cognac", "250ml/8¾fl oz chicken stock", "200ml/7fl oz double cream", "2 tbsp crushed green peppercorns", "2 tbsp crushed black peppercorns", "4 duck breasts, fat scored in a criss-cross pattern with a sharp knife", "1 tbsp butter", "2 tbsp olive oil", "400g/14¼oz wild mushrooms", "1 bunch chard, tough stems removed, leaves blanched and refreshed in cold water", "250g/8¾oz baby spinach leaves, blanched and refreshed in cold water", "1 tbsp butter", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the potatoes, preheat the oven to 190C/375F/Gas 5. Pour the oil into a heavy-based roasting tray and heat in the oven for 8-10 minutes, or until smoking. ", "Add the garlic cloves and new potatoes to the hot oil and return to the oven. Roast for 18-20 minutes, or until the potatoes are tender. Dot the butter over the potatoes, then continue to roast for a further 4-5 minutes, or until the skins are golden-brown.", "Meanwhile, for the pepper cream sauce, heat the butter in a pan over a medium heat. When the butter is foaming, add the shallots and fry for 3-4 minutes, or until softened but not coloured. Increase the heat and add the wild mushrooms. Continue to fry for 2-3 minutes, or until the mushrooms have softened and are golden-brown.", "Add the cognac and continue to cook until it has almost all evaporated.", "Add the stock and bring to a simmer. Continue to simmer for 4-6 minutes, or until the volume of liquid has reduced by half. ", "Add the cream and simmer until the volume of liquid has reduced by half again.", "Strain the pepper sauce through a fine sieve. Add the crushed green and black peppercorns and stir to combine. Keep warm. ", "For the duck, increase the oven temperature to 200C/400F/Gas 6. ", "Place the duck breast, fat-side down, into a cold ovenproof frying pan. Turn the heat to maximum (the duck fat will slowly render, resulting in crisp, golden-brown skin). ", "When the pan is hot and the fat is sizzling, fry the duck breast for 6-8 minutes, or until the fat is crisp and golden-brown. Drain off any excess fat, then turn the breast over and continue to fry for 6-8 minutes, or until browned. ", "Transfer the pan to the oven and roast for a further 6-8 minutes (for medium) or longer if you prefer your meat well done.", "When the duck is cooked to your liking, set aside on a warm plate to rest for 4-5 minutes.", "Meanwhile, for the wild mushrooms, heat the butter and oil in a frying pan over a medium heat. When the butter is foaming, add the mushrooms (do this in batches if necessary). Fry for 4-5 minutes, or until softened and golden-brown, then remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm.", "Meanwhile, for the chard and spinach, heat the butter and olive oil in a frying pan. When the butter is foaming, add the blanched chard and spinach and stir to coat in the butter and oil. Heat until wilted, then remove from the heat and keep warm.", "To serve, divide the wilted spinach and chard mixture equally among four serving plates. Drizzle over a little of the pepper sauce. Place a duck breast on top of each portion. Sprinkle the fried mushrooms around the edge of the plates. Drizzle over the remaining pepper sauce."]}, {"isVegetarian": false, "title": "Duck breast with redcurrant and red wine sauce", "url": "www_bbc_co_uk_food_recipes_duckbreastwithredcur_67442", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck breasts", "2 shallots, finely chopped", "1 clove garlic, finely chopped", "pinch of fresh thyme, finely chopped", "5 cherry tomatoes, chopped in half", "2 tbsp balsamic vinegar", "¼ glass of red wine", "30g/1oz butter", "55g/2oz redcurrants (or 3 tbsp redcurrant jelly)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Slash the fat on the duck breast and then sear it on both sides in a very hot pan.", "Remove it from the pan and place in the oven at 180C/350F/Gas 4 for about 10 minutes.", "Meanwhile, drain off any excess fat from the frying pan.  Put in the shallots, garlic, thyme and tomatoes and cook for a minute or two.  ", "Deglaze the pan with the balsamic vinegar and red wine.  Add the butter and redcurrants and reduce the sauce for a couple of minutes.", "Remove the duck from the oven to rest, then slice on the diagonal.  Serve with the sauce drizzled over it and some crusty French bread."]}, {"isVegetarian": false, "title": "Duck breast with honey and sansho pepper, mango, shiso and daikon", "url": "www_bbc_co_uk_food_recipes_duckbreastwithhoneya_86320", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz clear honey", "1 tbsp umeboshi paste/plum paste (available from specialist Japanese grocers)", "½ tsp fresh ginger, finely chopped", "¼ tsp sansho pepper (available from specialist Japanese grocers)", "¼ tsp mild curry powder", "¼ tsp five spice powder", "¼ tsp ground ginger", "4 x 175g/6oz duck breasts", "110g/4oz daikon radish, finely julienned", "1 mango, peeled, stone removed, finely sliced", "50g/2oz lotus root, finely sliced and deep fried until crisp (available from Asian grocers)", "75g/3oz watercress", "1 punnet shiso leaves (also called perilla leaves)", "1 shallot, finely sliced ", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "Place the honey into a bowl along with the umeboshi paste and fresh ginger and mix well.", "Add the sansho pepper, curry powder, five spice powder and ground ginger and stir well.", "Heat an ovenproof frying pan until warm and add the duck breast, skin-side down, and cook gently for 3-4 minutes to render the fat out.", "Turn the duck over and baste with the honey and spice mixture, then transfer to the oven to roast for 5-6 minutes, or until cooked to your liking.", "Remove the duck from the oven, baste with the honey and spice mixture and allow to rest.", "To serve, roll a small handful of daikon into a ball. Repeat to create 28 such balls of daikon and place seven around the edge each of four plates.", "Place two thin slices of mango on top of each ball of daikon.", "Slice the duck into very thin slices and place two pieces on top of each pile of daikon and mango.", "Place a piece of fried lotus root to the side of each pile.", "Place any remaining daikon, the watercress, shiso leaves, shallot and lemon juice into a bowl and mix well. Place a small handful of this salad into the centre of each plate and serve."]}, {"isVegetarian": false, "title": "Duck confit with butter bean mash, tomato and butter bean compôte and red wine sauce", "url": "www_bbc_co_uk_food_recipes_duckconfitwithbutter_85813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck legs", "1 tbsp salt per kilo of duck legs", "2-3 sprigs fresh thyme, leaves stripped", "300g/11oz duck fat", "4 tbsp clear honey", "6 tbsp extra virgin olive oil", "600g/1lb 5oz King Edward potatoes, peeled and cut into chunks", "1 x 400g/14oz can butter beans, rinsed and drained", "2 tbsp extra virgin olive oil", "75ml/3fl oz milk", "salt", "freshly ground white pepper", "1 tbsp olive oil", "1 onion, chopped", "2 garlic cloves, chopped", "2 sprigs fresh thyme", "2 x 400g/14oz cans chopped tomatoes", "110ml/4fl oz white wine", "1 x 400g/14oz tinned butter beans, rinsed and drained", "salt and freshly ground black pepper ", "2 tbsp fresh flatleaf parsley, roughly chopped", "25g/1oz butter", "½ red onion, thickly sliced", "250ml/9fl oz red wine", "750ml/1pt 6fl oz fresh beef stock", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the duck confit, weigh the duck legs and sprinkle with one tablespoon of salt per kilo of duck. Place onto a tray and sprinkle with the thyme. Wrap with cling film and place in the fridge overnight.", "Heat a heavy pan and add the duck legs. Add the duck fat to completely cover the legs. Bring the fat to a gentle simmer and cook slowly for about two and a half hours, or until the duck meat is very tender.", "Meanwhile, preheat the oven to 180C/355F/Gas 4.", "Using a pair of tongs, remove the duck legs from the fat and place on a roasting tray, draining off any excess fat.", "Whisk the honey and oil together in a bowl, then smear generously over the duck legs.", "Transfer the duck legs to the oven to roast for 18-25 minutes, spooning more honey glaze over the legs 2-3 times during cooking. Remove from the oven and leave to rest.", "For the butter bean mash, place the potatoes and butter beans into a pan of water and bring to the boil. Reduce the heat and simmer for 15 minutes.", "Drain the potatoes and beans and place into a large bowl. Add the olive oil and milk and mash to a purée. Season, to taste, with salt and freshly ground white pepper.", "For the butter bean and tomato compote, heat a deep-sided frying pan until hot, then add the olive oil, onions and garlic and fry together for three minutes.", "Add the thyme, tomatoes and white wine and bring to the boil, then reduce the heat to simmer for 15-20 minutes, until the sauce has thickened.", "Add the butter beans and simmer for a further 15 minutes, then season, to taste, with salt and freshly ground black pepper and stir in the chopped parsley.", "For the red wine sauce, melt half of the butter in a frying pan and add the onions. Fry the onions until golden-brown, then add the stock and red wine.  Bring to the boil, then reduce the heat to simmer the sauce until it has reduced by half and slightly thickened. Pass through a sieve into a clean pan.", "Whisk in the remaining butter and season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the butter bean mash into the centre of four plates. Top with the duck confit and place a spoonful of the compote on the side. Spoon the red wine sauce around and serve."]}, {"isVegetarian": false, "title": "Duck in grappa sauce served with sweet mash potato", "url": "www_bbc_co_uk_food_recipes_duckingrappasauceser_72221", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 duck legs", "5 tbsp olive oil", "50g/1¾oz plain \"OO\" or strong flour", "1 small sachet of saffron powder or a few strands of saffron", "1 handful of white grapes, seedless", "1 shot of Grappa", "2 large sweet potatoes", "½ glass of full fat milk", "75g/2½oz taleggio cheese", "salt ", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Take a heavy backing tray, add olive oil and place directly on the hob to heat.", "Meanwhile, put the flour in a bowl, add the saffron and season.", "Take the duck legs and coat in the flour.", "Place the duck in the tray and sear until golden.", "Cover in foil and put the tray in the oven to roast for approximately 20-30 minutes, it will be medium/well done.", "After 15 minutes, remove the foil and continue to roast", "Remove the tray from the oven and place onto the hob. Add the grapes and then the grappa. Let it simmer for 30 seconds. Place to one side to rest.", "Prepare the sweet mash by boiling the potatoes until al denté. Keep an eye on them so that they don't overcook and break up. Mash in a pan.", "Place the pan over a low heat, season and then add the milk. Break in the cheese. Stir constantly allowing the cheese to melt and create a smooth, creamy texture.", "To serve, place a large spoonful of mash in the centre of the plate and then put a duck leg on top. Serve immediately."]}, {"isVegetarian": false, "title": "Duckling breast, duck 'straws' with spicy red cabbage, baby turnips and mead syrup", "url": "www_bbc_co_uk_food_recipes_ducklingbreastduckst_93932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ head red cabbage, finely sliced", "15g/1oz coarse sea salt", "100ml/3½fl oz sesame oil", "50g/2oz icing sugar", "50ml/2fl oz dry sherry", "50ml/2fl oz white wine vinegar", "10g/½oz fresh root ginger, finely grated", "1 red chilli, finely chopped", "25g/1oz duck fat", "2 duckling breasts, trimmed and skin scored", "2 confit duck legs, meat shredded", "40g/2oz duck fat", "18 green peppercorns, crushed", "pinch salt", "4 large spring roll wrappers (available in Asian grocers)", "50g/2oz plain flour", "50ml/2fl oz water", "vegetable oil, for deep frying", "4 baby turnips", "100ml/3½fl oz water", "40g/2oz butter", "pinch sugar", "25g/1oz butter", "1 shallot, peeled, finely sliced", "100g/3½oz button mushrooms, sliced", "200ml/7fl oz mead", "400ml/14fl oz chicken stock", "25g/1oz butter", "200ml/7fl oz mead"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the spicy red cabbage, place the red cabbage in a large bowl and sprinkle with the sea salt. Mix well to coat in the salt, then set aside for 4 hours. Rinse under cold water to wash the salt off, then set aside until needed. ", "Preheat the oven to 220C/425F/gas 7.", "For the duckling breast, heat an ovenproof frying pan until hot and add the duck fat. When the fat has melted, add the duckling breasts skin-side down and fry for 4-5 minutes, or until the skin is crisp and golden-brown. Drain off the fat, turn the duckling breast over and roast in the oven for 7-8 minutes, or until golden-brown all over but still slightly pink in the middle. Set aside to rest.", "For the duck 'straws', mix together the confit duck meat, duck fat, green peppercorns and salt in a bowl. ", "Lay the spring roll wrappers on a chopping board and cut each in half lengthways. Mix the flour in a bowl with the water to make a thick paste. Brush down the long side of one end of the sheet with the flour paste. ", "Spoon the duck mixture along the length of the wrapper and roll up, crimping the ends together to seal. Repeat with the remaining spring roll wrappers and duck mixture. ", "Half-fill a deep, heavy-based pan with vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended). Deep fry the duck 'straws' for 1-2 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. Set aside. ", "For the spicy red cabbage, heat the sesame oil in a large frying pan and add the drained shredded cabbage. Fry for 2 minutes, or until softened slightly but not coloured.", "Push the cabbage to one side of the pan and add the icing sugar to the other side. Once the sugar has melted and begins to caramelise, add the sherry, white wine vinegar, ginger and chilli and mix in the cabbage. Fry for a further 2-3 minutes, or until the cabbage is tender. Set aside.", "For the baby turnips, place all of the baby turnip ingredients into a pan and bring to the boil. Cook for 5-6 minutes, or until the turnips are tender but slightly crunchy. Drain and set aside. ", "For the duck sauce, melt the butter in a pan until foaming, then add the shallots and mushrooms and fry for 2-3 minutes, or until softened. Add the mead and cook until the volume of the liquid has reduced by two-thirds, then add the chicken stock and cook until the volume of the liquid has reduced by half. ", "Strain the sauce through a fine sieve, place back into the pan and whisk in the butter over a medium heat. Keep warm. ", "For the mead syrup, place the mead into a small saucepan and simmer gently over a medium heat until the liquid has reduced to about 50ml/2fl oz and is thick and syrupy. ", "To serve, divide the spicy red cabbage among 4 serving plates. Carve the duckling breasts in half lengthways and arrange a piece on top of each portion of cabbage. Lay two duck 'straws' against the duck and cabbage, spoon the baby turnips alongside and drizzle the duck sauce over the duck and around the plate. Finish by drizzling the mead syrup over the duck."]}, {"isVegetarian": false, "title": "Duck liver and basil pâté", "url": "www_bbc_co_uk_food_recipes_duckliverandbasilpat_84101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz duck livers, trimmed of fat and sinew", "3 tbsp cognac", "1 garlic clove, chopped", "handful fresh basil leaves", "175g/6oz unsalted butter, softened", "salt and freshly ground black pepper", "melba toast", "salad leaves"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Place the whole livers onto a baking sheet and pour over the cognac. Mix well so both sides of the liver absorb the cognac. Sprinkle over the garlic and basil, retaining a few leaves, and season, to taste, with salt and black pepper.", "Place in the oven for 6-8 minutes, or until just cooked. The livers should look slightly pink inside. Remove from the oven and place into a blender along with 110g/4oz of the butter and blend until smooth.", "Check the seasoning then spoon into ramekins.", "Place the remaining butter into a saucepan and heat until melted. Pour the clear butter over the surface of the  pâté, leaving the milk solids behind in the saucepan. Place remaining basil leaves on the surface of the  pâté, and place in the fridge to set.", "Serve pâté with melba toast and dressed salad leaves."]}, {"isVegetarian": false, "title": "Duck pancakes with hoisin sauce", "url": "www_bbc_co_uk_food_recipes_duckpancakeswithhois_67779", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duckpancakeswithhois_67779_16x9.jpg", "ingredients": ["4 duck breasts, about 175g/6oz each, skin removed", "½ tsp Chinese five spice", "freshly ground black pepper", "2 tbsp sesame oil", "100ml/3½fl oz hoisin sauce", "8-10 ready-made Chinese-style pancakes (or mini flour torillas), warmed ", "1 bunch spring onions, cut into matchsticks", "½ cucumber, halved, seeds removed and cut into matchsticks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the duck into thin strips and toss in the five spice and pepper. Heat the sesame oil in a frying pan or wok and add the duck. Stir-fry for 3-4 minutes until cooked through, then add the hoisin sauce. Continue to cook for about 1 minute, until the duck is thickly coated with the sauce.", "Transfer the duck to a warmed dish, arrange the spring onions and cucumber in a bowl, unwrap the warmed pancakes and allow everyone to dig in and help themselves. The pancakes should be topped with some duck, spring onions and cucumber, then rolled up to resemble the Chinese classic."]}, {"isVegetarian": false, "title": "Duck liver and orange pâté", "url": "www_bbc_co_uk_food_recipes_duckliverandorangepa_71658", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz unsalted butter, softened", "450g/1lb duck livers, trimmed and cleaned", "2 shallots, finely chopped", "2 cloves garlic, finely chopped", "2 tsp orange juice", "1 tbsp orange zest", "½ tsp freshly ground black pepper", "2 tbsp orange liqueur ", "55g/2oz clarified butter, melted"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat 15g/½oz of the butter in a frying pan until foaming. ", "Add half the livers and fry quickly on all sides until golden, but still pink in the middle, about 4-5 minutes. ", "Repeat with a second batch of butter and livers. ", "Place the livers and juices in a food processor. ", "In the same pan heat another 15g/½oz butter, add the shallot, garlic, and orange juice and zest and cook over a moderate heat until the shallot is soft but not coloured. ", "Add the orange liqueur and freshly ground black pepper, and scrape the bottom of the pan to release any coagulated juices. ", "Place everything in the food processor, including the remaining unsalted butter. Blend until smooth.", "If you want a very smooth pâté, pass the mixture through a fine sieve and put in a bowl. Cover with the cling film, cool then refrigerate. If not using within 48 hours, cover the top with clarified butter."]}, {"isVegetarian": false, "title": "Duck rillettes", "url": "www_bbc_co_uk_food_recipes_duckrillettes_83817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 legs duck confit", "150g-175g/5oz-6oz duck fat", "5 tbsp roughly chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Remove all of the meat from the duck legs, discarding skin, bone and tendons.", "Place the duck meat into a bowl and mash with a fork. ", "Gradually add the duck fat as you continue to mash.", "Add the chopped parsley and season with salt and freshly ground black pepper.", "Spoon the mixture into four small ramekins and place in the fridge to set.", "Remove from the fridge ten minutes before serving."]}, {"isVegetarian": false, "title": "Duck salad", "url": "www_bbc_co_uk_food_recipes_ducksalad_85724", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 carrots, cut into thin strips", "1 bunch spring onions, cut into thin strips", "½ cucumber, seeds removed, cut into thin strips", "1 crisp lettuce, such as cos or iceberg, sliced", "2 pre-cooked duck breasts, shredded into small slices", "hoisin sauce, from a jar, to taste", "handful sesame seeds"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all the prepared vegetables in a salad bowl.", "In a separate bowl, toss the cooked duck pieces in the hoisin sauce.", "Place the hoisin duck on top of the salad and sprinkle with sesame seeds. Serve at once."]}, {"isVegetarian": false, "title": "Duck stir-fry with baby corn, cashews and mangetout", "url": "www_bbc_co_uk_food_recipes_duckstirfrywithbabyc_89252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz mangetout, cut in half lengthways", "100g/3½oz baby sweetcorn, cut in half lengthways", "55g/2oz cashew nuts", "150g/5oz duck breast, thinly sliced", "1 tbsp honey", "2 tsp soy sauce", "½ tsp freshly ground black pepper", "2 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok until smoking. Add the mangetout, sweetcorn and cashew nuts and fry for 3-4 minutes, or until the vegetables are tender but retaining a bit of bite.", "Add the duck breast slices to the wok and stir fry for 1-2 minutes, then add the rest of the ingredients. Cook until the sauce is reduced and sticky, and the duck is cooked to your liking. ", "Pile the stir-fry onto a serving plate and serve."]}, {"isVegetarian": false, "title": "Duck teriyaki with pickled cucumber served with celery leaf tempura", "url": "www_bbc_co_uk_food_recipes_duckteriyakiwithpick_83001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ large cucumber ", "1 tsp Dijon mustard ", "½ tsp salt ", "1 tbsp sugar", "2 tbsp rice wine vinegar ", "4 duck breasts, boneless and skin removed", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "100ml/4fl oz soy sauce ", "100ml/4fl oz sake ", "3 tbsp sugar ", "vegetable oil, for deep frying", "1 free-range egg yolk ", "250ml/8fl oz iced water", "125g/4½oz plain flour, plus extra for dusting ", "8 sprigs pale celery leaves ", "salt"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pickled cucumber, peel and seed the cucumber and slice into 1cm/½in pieces. In a bowl, whisk together the mustard, salt, sugar and vinegar. Marinate the cucumber slices in the mixture for at least 15 minutes and up to one hour.", "For the duck, check the duck breasts and trim off any fat and sinew. Season with salt and freshly ground black pepper.", "Heat a large heavy frying pan over a high heat and sauté the duck breasts in the vegetable oil over a medium to high heat until well browned but still pink in the middle. This will take about four minutes on each side. ", "Remove the duck breasts. Add all the teriyaki glaze ingredients to the pan and boil the mixture until it becomes thick and syrupy. Add the duck to the glaze, and turn frequently for about one minute. When well glazed on both sides, place the breasts on a cutting board and slice into 4-5 pieces each.", "Meanwhile, for the celery tempura, heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "In a small bowl, beat the egg yolk with the water until just mixed. Add the flour and stir just five times with a fork and no more. The mixture will be very lumpy, and this is part of the secret to good tempura.", "Dip the celery leaves in the dusting flour, and then into the tempura batter. Fry in the hot oil for about three minutes until golden brown, turning the leaves in the oil to ensure even cooking. Remove with a slotted spoon and season lightly with salt.", "Serve the duck with the pickled cucumber and garnish with the celery leaf tempura."]}, {"isVegetarian": false, "title": "Duck with mango salsa", "url": "www_bbc_co_uk_food_recipes_duckwithmangosalsa_72997", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 small Barbary duck breasts", "salt, to taste", "freshly ground green peppercorns", "4 tbsp red onion, finely chopped", "2 ripe mangoes, peeled and cut into 1cm (½in) dice", "4 tbsp lime or lemon juice", "1-2 red chillies, finely diced", "1 tbsp sugar", "2 tbsp fresh mint, chopped", "½ tsp salt", "freshly ground green peppercorns", "flatleaf parsley, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Season the duck breasts with salt and freshly ground green peppercorns, then place them, skin-side down, on a heated griddle pan. ", "Turn the duck breasts. ", "Cook for a few minutes, skin-side up, then turn them again to crisp up the skin. ", "Continue this process until the duck is cooked to your taste.", "To make the salsa, first scald the red onion by pouring boiling water over it and draining it off immediately (this softens the raw flavour of the onion, which can slightly overpower the other ingredients). ", "Mix together with the remaining salsa ingredients and allow the flavours to combine for ½ an hour. ", "Taste the salsa, adding a little more lime, sugar or salt if desired.", "Garnish the duck breasts with parsley and serve with plenty of salsa on the side. Serve with Asian crispy noodles."]}, {"isVegetarian": false, "title": "Duck with noodles and bamboo shoots", "url": "www_bbc_co_uk_food_recipes_duckwithnoodlesandba_77705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, skin cut criss-cross", "salt and freshly ground black pepper ", "2 tbsp olive oil", "4 tbsp brown sugar", "4 whole tinned bamboo shoots", "100g/3½oz rice noodles, uncooked ", "250ml/8¾ fl oz vegetable oil, for frying"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6", "Place the duck skin-side down into a frying pan and season with salt and freshly ground black pepper.  Cook for 3-4 minutes.", "When the duck skin becomes golden, place into the preheated oven for five minutes and cook. Remove and leave to rest. ", "To make the bamboo shoots, in a small frying pan heat the olive oil with the brown sugar and add the bamboo shoots.", "Place into the preheated oven for five minutes. ", "To make the noodles, heat the oil in a heavy-bottomed saucepan (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)  Place the rice noodles into the hot oil.  They will puff immediately.  Remove and drain on kitchen paper.", "To serve place the duck breast on the plate.  Add the bamboo shoots around the duck and top with the noodles."]}, {"isVegetarian": false, "title": "Duck with plum sauce and crispy seaweed", "url": "www_bbc_co_uk_food_recipes_duckwithplumsauceand_4849", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["227g-283½g/8-10oz duck breast (or 2 smaller ones) ", "1 tbsp cumin", "2 tbsp clear honey", "1 tbsp corn oil", "salt and pepper", "bottle plum sauce", "packet of crispy seaweed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas6.", "Remove the tendon from the duck breast to prevent the meat shrinking during cooking. ", "Place cumin, honey and oil in a hot non-stick pan and heat until foaming and nut brown. ", "Place the pre-prepared duck, skin side down, into the pan and season well. Cook the breast until the skin is dark brown and crisp. It is important to colour the skin at this stage as it will not colour in the oven. It also removes some of the fat. ", "Turn the duck over in the pan, or remove to a baking tray, and place in the oven. Cook for 5-6 minutes for medium, 8-12 minutes for well done. ", "Remove the duck and let it rest. ", "While the duck is cooking, spoon about 6 tbspof plum sauce into the centre of a serving plate and scatter the crispy seaweed around the edge. ", "Slice the duck and lay it on the pool of sauce. Serve with rice or noodles."]}, {"isVegetarian": false, "title": "Duck wraps", "url": "www_bbc_co_uk_food_recipes_duckwraps_71806", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast, marinated in Hoisin sauce and five spice", "salt", "freshly ground black pepper", "2 tbsp oil", "2 spring onions", "2 Baby Gem, picked, washed and dried", "1 cucumber", "3 tbsp simple peanut sauce", "1 tbsp roasted and crushed peanuts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Season the duck breast with salt and pepper. Heat the oil in a pan over a high heat and sear the duck for a few minutes minutes.  ", "Transfer to the oven and cook until medium, 10-15 minutes. Allow to rest for ten minutes.", "Meanwhile, chop the spring onions into julienne and chop the cucumber into thin batons.", "Take the baby gem leaves and spread a little peanut sauce into each one.  ", "Slice the duck into nice thin slices.  Place two slices into each baby gem leaf and add a little spring onion and cucumber. ", "Sprinkle with peanuts and serve."]}, {"isVegetarian": false, "title": "Dukkah lamb cutlets with quinoa salad", "url": "www_bbc_co_uk_food_recipes_dukkah_lamb_cutlets_with_80089", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dukkah_lamb_cutlets_with_80089_16x9.jpg", "ingredients": ["200g/7oz quinoa, cooked according to the packet instructions", "handful fresh parsley, chopped", "1 tbsp chopped fresh mint", "1 red pepper, finely diced", "1 cucumber, finely diced", "1 red onion, finely diced", "2 tbsp extra virgin olive oil", "1 lemon, juice only", "salt and freshly ground black pepper", "½ tsp cloves", "1 tsp fennel seeds", "1 tsp coriander seeds", "1 tsp cumin seeds", "1 tsp paprika", "pinch turmeric", "½ tsp chilli flakes", "50g/2oz hazelnuts, chopped", "30g/1oz pistachios, chopped", "1 tbsp sesame seeds", "4 tbsp honey", "1 orange, juice only", "salt and freshly ground black pepper ", "4 tbsp olive oil", "12 lamb cutlets"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the quinoa salad, mix together the quinoa, herbs and vegetables in a bowl and dress with olive oil and lemon juice. Season, to taste, with salt and freshly ground black pepper. ", "For the dukkah, heat a frying pan and dry fry the cloves, fennel, coriander and cumin until fragrant. Place in a pestle and mortar and grind until smooth. ", "Combine the spices with the rest of the dukkah ingredients in a bowl and mix until well combined. ", "Rub each lamb cutlet with the dukkah and orange juice mixture and grill on a hot griddle, on a barbecue, or under a pre-heated grill, for 2-3 minutes on each side, or until cooked to your liking. ", "To serve place some of the quinoa salad onto four plates and place three lamb cutlets on top of each. "]}, {"isVegetarian": true, "title": "Dundee cake", "url": "www_bbc_co_uk_food_recipes_dundee_cake_22157", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dundee_cake_22157_16x9.jpg", "ingredients": ["175g/6oz softened butter, plus extra for greasing", "175g/6oz soft light brown sugar", "3 tbsp orange marmalade", "3 free-range eggs, beaten", "225g/8oz self-raising flour", "25g/oz ground almonds", "1 heaped tsp ground mixed spice", "400g/14oz mixed dried fruit", "75g/3oz glace cherries, halved ", "2 tbsp whisky or milk", "40g/1½oz blanched almonds to decorate", "1 tsp granulated or caster sugar, to decorate (optional)"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Grease and double-line a 20cm/8in loose-based deep cake tin with greaseproof paper. ", "Beat the butter and sugar in a food processor for 3-4 minutes, or until very light and fluffy.  ", "Add the marmalade and mix for a few seconds more. Slowly add the eggs, one at a time, beating well after each addition. ", "Add the flour, almonds and spices to the batter. Mix slowly until well combined, then stir in the mixed dried fruit and cherries with a large metal spoon. Add the whisky or milk and mix until well combined. ", "Spoon the mixture into the cake tin, smooth the surface and carefully arrange the blanched almonds in circles on top. ", "Bake for 1½-2 hours, or until well risen, firm and golden-brown.  (Test the cake by inserting a skewer into the centre. If the skewer comes out clean, the cake is done.)", "Leave the cake to cool for 10 minutes then remove from the tin, peel off the lining paper and set aside to cool on a wire rack. Sprinkle with granulated sugar. Store in a cake tin and eat within 4-5 days."]}, {"isVegetarian": true, "title": "Dulce and banana traybake", "url": "www_bbc_co_uk_food_recipes_dulce_and_banana_13248", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dulce_and_banana_13248_16x9.jpg", "ingredients": ["50g/2oz butter, plus extra for greasing", "50g/2oz soft light brown sugar", "150g/5½oz butter ", "175g/6oz soft light brown sugar", "4 medium free-range eggs", "½ vanilla pod, seeds only (or a couple of drops of vanilla extract)", "100g/3½oz self-raising flour", "75g/2½oz plain wholemeal flour", "1 tsp baking powder", "3 tsp ground ginger", "1 tsp ground cinnamon", "1 tbsp treacle", "handful pecan nuts (optional)", "pinch salt", "2 small firm bananas", "1 tbsp calvados (optional)", "softly whipped cream or ice cream, to serve"], "serves": "Makes 9 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Grease and line a 20cm/8in square tin with baking parchment and grease again. Preheat the oven to 180C/350F/Gas 4. ", "First make the sticky topping. Place the butter and soft light brown sugar in a small pan over a medium heat. Once the butter is melted, turn up the heat and let the mixture bubble away for a few minutes, until it begins to thicken slightly. Stir it frequently so it does not catch on the bottom. ", "Pour the mixture into the bottom of the lined tin and tip the tin back and forth to spread it out evenly. The mixture will eventually solidify in the tin so make sure to spread it out now.", "Next, tip the pecans (if using) onto a baking tray and toast in the oven for five minutes. Set aside to cool.", "Now make the sponge mixture. Cream together the butter and sugar in a large bowl (or food mixer) until light and fluffy. Add the eggs one at time, beating hard between each addition. Split the vanilla pod open, scrape the seeds out into the mixture (or add the vanilla extract). Then fold in both flours, the baking powder, ginger, cinnamon, treacle and salt and set aside.", "Slice the bananas into 5mm/¼in thick pieces. Arrange them in a single layer in the bottom of the tin. I line them up so they are nice and straight but of course it is fine to do them in any old order too. Pack them all in tight so they don’t move around once the cake mix goes over. Then drizzle over the calvados (if using). ", "Roughly chop the pecans and stir them through the cake mix. Now, carefully dollop the cake mix over the bananas and gently spread it out with the back of a spoon or palate knife, levelling the top. Pop it into the oven for about 45 minutes.", "After 35 minutes, remove the cake from the oven and insert a metal skewer or the blade of a small knife right into the centre (but not touching the bottom. It should come out completely clean. If there is some cakey gooeyness left on it just pop it back in the oven for another five minutes or so.", "Once the cake is cooked remove it from the oven and leave to cool in the tin for about 10 minutes. Then put a large flat plate over the top of the tin and holding the tin and the plate, flip the whole lot over so that the tin is now upside down. Gently remove the tin and carefully peel off the baking parchment.", "Cut into squares and serve warm or cold with your choice of crème anglaise, softly whipped cream or ice cream. "]}, {"isVegetarian": false, "title": "Duo of lamb with paloise sauce and crushed new potatoes and green beans", "url": "www_bbc_co_uk_food_recipes_duo_of_lamb_with_paloise_18894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter", "½ bunch fresh mint, plus 2-3 tbsp chopped fresh mint leaves ", "2 tbsp white wine vinegar", "50ml/2floz white wine", "1 tsp white peppercorns", "1 small banana shallot, finely diced", "4 free-range eggs, yolks only", "¼ lemon, juice only", "400g/14oz new potatoes", "200g/7oz French beans", "75g/2½ oz butter", "2 x 150-200g/5-7oz lamb fillets", "salt and freshly ground black pepper", "olive oil", "8 lamb chops, trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the paloise sauce, melt the butter in a medium saucepan on a gentle heat. Skim the white foam that floats to the top off the butter. Then pour the butter into a clean bowl, leaving behind any milk solids that have sunk to the bottom of the pan. Add the bunch of mint to the butter.", "Place the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Reduce the heat and simmer until the volume of the liquid has reduced by half.", "Remove the peppercorns, and then pour the mixture into a medium heat-proof bowl. Allow to cool slightly.", "Whisk the egg yolks into the white wine reduction.", "Place the bowl over a pan of simmering water (ensure the bottom of the bowl does not touch the water) and whisk the eggs together until thickened and light in colour.", "Strain the mint-flavoured butter through a sieve into the egg mixture, whisking constantly.", "Season with salt and freshly ground black pepper,  then add the lemon juice and chopped mint leaves.", "Turn off the heat and leave the bowl over the pan until ready to use.", "For the crushed new potatoes and green beans, place the potatoes in a medium saucepan and add cold water bring to the boil and cook for 10-15 minutes until the potatoes are cooked. Drain.", "Bring a medium saucepan of water to the boil and add the beans. Boil for one minute, then drain. ", "Heat a small frying pan and add half the butter. Add the blanched beans to the pan and cook for a minute.", "Crush the new potatoes slightly with a fork and add the remaining butter. Season with salt and pepper.", "Pre-heat the oven to 200C/400F/Gas 6.", "For the duo of lamb, heat a large frying pan and add the oil, season the fillets with salt and fry until browned all over. Transfer to the oven for 8-10 minutes. Remove from the oven and allow to rest.", "Meanwhile, heat a griddle pan until hot. Brush the chops with oil and season with salt and freshly ground black pepper. Place on the griddle and cook for a couple of minutes on each side. Set aside to rest for a few minutes.", "To serve, slice the lamb fillets and place onto a plate with a lamb chop, serve with the new potatoes, green beans alongside and sauce drizzled over."]}, {"isVegetarian": true, "title": "Earl Grey tea bread", "url": "www_bbc_co_uk_food_recipes_earl_grey_tea_bread_48452", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earl_grey_tea_bread_48452_16x9.jpg", "ingredients": ["175g/6oz currants", "175g/6oz sultanas", "300ml10fl oz strong hot Earl Grey tea", "275g/9¾oz self-raising flour", "225g/8oz light muscovado sugar", "1 large free-range egg, beaten", "butter, for greasing, plus extra to serve"], "serves": "Makes 1 loaf", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the currants and sultanas in a bowl and pour over the hot tea. Stir, cover and leave to soak overnight for the liquid to absorb.", "Preheat the oven to 150C/130C Fan/Gas 3½. Grease a 900g/2lb loaf tin and line with non-stick baking paper.", "Add the flour, sugar and egg to the bowl of soaked fruit (if there is a little excess liquid this is fine) and mix thoroughly.  ", "Spoon into the prepared tin and level the top. Bake for 1¾ hours, or until the cake is risen and just firm to the touch, but check it after 1¼ hours to see how it is doing. Leave to cool in the tin for about 10 minutes.  ", "Turn out the cake and remove the paper. To serve, cut into fairly thick slices and spread with butter to serve."]}, {"isVegetarian": true, "title": "Earl Grey martini", "url": "www_bbc_co_uk_food_recipes_earlgreymarteani_87394", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreymarteani_87394_16x9.jpg", "ingredients": ["50ml/2fl oz gin ", "35ml/1½fl oz strong cold Earl Grey tea ", "20ml/¾fl oz lemon juice ", "12.5ml/½fl oz sugar syrup (sold as 'gomme' syrup)", "½ free-range egg white ", "twist lemon peel, to garnish"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the gin, Earl Grey tea, lemon juice, sugar syrup and egg white into a cocktail shaker and shake well.", "Double strain the liquid into a Martini glass and garnish with a lemon twist."]}, {"isVegetarian": true, "title": "Earl Grey sorbet with pear, Earl Grey and cinnamon strudel", "url": "www_bbc_co_uk_food_recipes_earlgreysorbetwithpe_92106", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earlgreysorbetwithpe_92106_16x9.jpg", "ingredients": ["30g/1oz Earl Grey tea leaves  ", "300g/10oz caster sugar  ", "1 lemon, juice only ", "1 litre /1¾ pints boiling water ", "700g/1.5lb pears, peeled", "1 tbsp Earl Grey tea leaves", "3 tbsp caster sugar", "½ lemon, juice only", "150g/5½oz sultanas", "100g/3½oz flaked almonds, toasted", "100g/3½oz soft light brown sugar", "1½ tsp ground cinnamon", "275g/10oz ready-made filo pastry", "1 heaped tbsp icing sugar, plus extra for dusting", "100g/3½oz butter, melted", "2-3 rich tea biscuits, crumbled, to serve (optional)"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sorbet, mix together the tea leaves, caster sugar and lemon juice in a heatproof bowl. Pour over the boiling water and set aside to steep for at least 30 minutes.", "When the mixture has steeped, strain it through a fine sieve into an ice cream maker. Churn the mixture, according to the manufacturer's instructions, until almost frozen, then transfer to a freezable container and place in the freezer until set.", "(NB: To make the sorbet without an ice cream maker, freeze the mixture in a freezable container for one hour, then remove and stir to break up the ice crystals. Repeat the freezing and stirring process 2-3 times, until the sorbet is frozen solid.)", "Meanwhile, for the strudel, preheat the oven to 190C/375F/Gas 5.", "Stand the pears in the bottom of a saucepan. Add the tea leaves, caster sugar and lemon juice, then pour over enough cold water to just cover the pears. Bring the mixture to the boil, stirring carefully.", "When the liquid is boiling, reduce the heat until it is simmering. Poach the pears for 15-20 minutes, or until tender. Drain the pears, rinsing off any tea leaves that stick to them, then set aside to cool slightly.", "When the pears have cooled, cut them into quarters, remove the cores, then chop roughly.", "In a bowl, mix together the chopped poached pears, sultanas and almonds until well combined.", "Mix together the soft brown sugar and ground cinnamon, then fold the mixture into the pear mixture until well combined.", "Lay the filo pastry onto a work surface lightly dusted with icing sugar. Overlap the sheets of pastry slightly to form a rectangle about 40cm x 30cm/16in x 12in. As you layer the filo pastry sheets, brush each sheet all over with the melted butter.", "Continue to add the remaining filo pastry sheets in layers, brushing each sheet with more of the melted butter, until all the filo pastry and butter is used.", "Sprinkle the pear mixture onto the filo pastry rectangle, leaving a 2.5cm/1in free at the edges of the rectangle.", "Fold the free edges of the long sides of the rectangle back over the pear mixture. Starting at one end of the shorter sides of the rectangle, roll up the filo pastry and pear filling to form a swiss roll.", "Transfer the filo pastry roll to a baking tray and dust all over with the icing sugar. Bake in the oven for 40-45 minutes, or until the pastry is crisp and golden-brown.", "To serve, slice the cinnamon strudel and place one slice into the centre of each serving plate. Sprinkle some of the rich tea biscuits in a pile alongside the strudel. Place a scoop of the Earl Grey sorbet on top of the crumbled rich tea biscuits."]}, {"isVegetarian": true, "title": "Easter biscuits", "url": "www_bbc_co_uk_food_recipes_easter_biscuits_37686", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_biscuits_37686_16x9.jpg", "ingredients": ["200g/8oz softened butter", "150g/6oz caster sugar", "2 large free-range egg yolk", "400g/14oz plain flour, plus extra for flouring", "1 level tsp mixed spice", "1 level tsp ground cinnamon", "2-4 tbsp milk", "100g/4oz currants", "a little caster sugar, for sprinkling", "1-2 tsp lemon juice", "250g/9oz icing sugar", "about 2 tbsp cold water", "different coloured food colouring"], "serves": "Makes about 30 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Lightly grease two baking trays lined with baking parchment.", "Measure the butter and sugar into a bowl and beat together until light and fluffy. Beat in the egg yolk. Sieve in the flour and spices and add enough milk to give a fairly soft dough.  Bring together, using your hands, to make a soft dough.", "Halve the mixture and set half to one side. ", "For the traditional currant biscuits, add the currants to the remaining half of the mixture and knead it lightly on a lightly floured work surface. Roll out to a thickness of about 5mm/¼in. Cut into rounds using a circular cutter. Place on the prepared baking trays.  Sprinkle with caster sugar.", "Bake in the preheated oven for 15 minutes, or until pale golden-brown. Keep a careful eye on the biscuits - it doesn’t matter if you open the oven door to check. Sprinkle with caster sugar and lift onto a wire rack to cool. Store in an airtight container.", "For the iced biscuits, knead the remaining half of the biscuit dough mixture lightly on a lightly floured work surface. Roll out to a thickness of 5mm/¼in. Cut out Easter biscuits using an assortment of shaped cutters, such as bunnies, Easter eggs, chicks, spring flowers. ", "Lightly grease two baking trays lined with baking parchment.", "Place the biscuit shapes on the prepared baking trays and bake in the preheated oven for 10-15 minutes. Remove from the oven and lift on to a wire rack to cool.", "To make the icing, pass one teaspoon of lemon juice through a fine sieve, to remove any pips or bits. Mix the icing sugar with the lemon juice, and then add about two tablespoons of water, adding it little by little until you have a relatively stiff but smooth icing. Add a splash more sieved lemon juice if necessary.", "Divide the icing into separate bowls and mix in food colourings of your choice into the separate bowls of icing, until you achieve the desired shade.  ", "Spoon a little icing into a piping bag and pipe your decorations onto the biscuits. For a smooth finish, you can pipe the outline of your design in the firmer icing, then slacken it down a bit by mixing in a little more water, giving the icing more of a runny consistency, and use this to fill in the designs."]}, {"isVegetarian": false, "title": "Easter fruit cupcakes", "url": "www_bbc_co_uk_food_recipes_easter_fruit_cupcakes_75736", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_fruit_cupcakes_75736_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter", "2 tsp ground ginger", "2 tsp mixed spice", "250g/9oz caster sugar", "100ml/3½fl oz sunflower oil", "4 medium free-range eggs", "1-2 small dessert apples, about 100g/3½oz ", "100g/3½oz crystallised ginger", "100g/3½oz currants ", "100g/3½oz mixed dried fruit ", "300g/10½oz plain flour", "2 tsp baking powder", "half a batch of cream cheese frosting (see Top recipe tip below) ", "25g/1oz caster sugar", "25ml/1fl oz water"], "serves": "Makes about 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Line the pockets of a muffin tray with muffin cases or paper wraps, and preheat the oven to 180C/350F/Gas 4.", "Melt the butter with the spices in a small pan over a low heat, then pour this into a mixing bowl with the sugar and oil and stir well. Beat in the eggs until smooth.", "Peel the apples and grate them, discarding the core, and stir the apples into the other ingredients, followed by the crystallised ginger, currants and mixed dried fruit. Stir in the flour and baking powder evenly.", "Three-quarter fill each muffin paper with spoonfuls of the mixture and bake for about 25 minutes, or until a skewer poked in comes out almost clean.", "Make the syrup by boiling the sugar with the water in a small pan until dissolved, then leave to liquid to cool. Brush it over the warm cupcakes. ", "When cold, pipe crosses on the cupcakes with the cream cheese frosting before serving."]}, {"isVegetarian": false, "title": "Easter lamb with peas", "url": "www_bbc_co_uk_food_recipes_easter_lamb_with_peas_10766", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lamb_with_peas_10766_16x9.jpg", "ingredients": ["1kg/2lb 4oz boned lamb shoulder, cut into large chunks ", "150ml/5fl oz extra virgin olive oil ", "2 onions, roughly chopped", "1 large carrot, sliced ", "1 celery stalk, roughly chopped", "5 garlic cloves, crushed ", "½ x 50g/2oz tin anchovy fillets ", "handful thyme sprigs", "1 red chilli, sliced ", "250ml/9fl oz white wine ", "25ml/1fl oz white wine vinegar ", "250g/9oz fresh or frozen peas ", "400g/14oz potatoes, cut into quarters ", "200g/7oz cherry tomatoes, halved ", "salt and freshly ground black pepper ", "6 portions fresh bread, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Season the lamb chunks with salt and black pepper. Set aside. ", "Heat the olive oil in a large lidded pan and fry the onions, carrot and celery for 4–5 minutes, or until softened. Add the garlic, anchovies, thyme and chilli, and continue to cook, stirring, until the anchovies have almost dissolved into the oil. Add the lamb chunks and fry for a further 4–5 minutes, or until browned all over. ", "Stir in the wine and continue to cook until the volume of the liquid has reduced by half, then add the vinegar. Reduce the heat to low, cover and simmer gently for 20 minutes. ", "Add the peas, potatoes and tomatoes, cover again and continue to cook for about an hour, until the sauce has reduced by half. ", "Serve hot with plenty of bread to mop up the sauce."]}, {"isVegetarian": true, "title": "Easter lemon pavlova", "url": "www_bbc_co_uk_food_recipes_easter_lemon_pavlova_99601", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_lemon_pavlova_99601_16x9.jpg", "ingredients": ["6 free-range egg whites", "350g/12oz caster sugar", "2 tsp white wine vinegar ", "2 level tsp cornflour", "6 free-range egg yolks", "350g/12oz caster sugar", "4 lemons, juice only", "225g/8oz butter", "450ml/¾pint double cream", "30 chocolate mini-eggs", "100g/3½oz caster sugar, plus extra for coating the zest", "4 lemons, zest only (in long thin strips)"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Lay a piece of baking paper on a baking tray and draw a 25cm/10in circle on it.  ", "Put the egg whites into a bowl and whisk on the fastest speed with an electric hand-whisk or in a free-standing mixer until stiff.  Gradually, still whisking on maximum speed, add generous teaspoons of sugar until the mixture is stiff and shiny and stands in peaks.", "Blend the vinegar and cornflour together in a cup and mix until smooth.  Stir this into the meringue mixture.", "Spread half of the meringue mixture onto the paper to give a 25cm/10in circle. Fill a piping bag, fitted with a rose nozzle, with the rest of the meringue mixture. Carefully pipe about 10 separate little nests positioned equally around the edge of the circle. ", "Slide the meringue into the middle of the oven, turn the heat down to 150C/300F/Gas 2 and bake for 1½-2 hours (check after one hour), or until it easily comes off the paper.  The pavlova will be a pale creamy colour rather than white.  Turn off the oven and leave the pavlova in the oven to become cold.", "Meanwhile, make the lemon curd for the filling. Place a heatproof bowl over a pan of hot water, simmering gently on the stove. Add the egg yolks, sugar and lemon juice to the bowl and whisk. Gradually add the butter, whisking continually until it starts to thicken. It should coat the back of a spoon when it reaches the correct consistency. It will firm up further once cooled.", "Whisk the double cream in a large bowl until thickened, then swirl it through the cooled lemon curd. ", "Spoon the lemon curd and cream mixture into the middle of the pavlova and spread over the base of the meringue nest. Spoon a lemon filling into each of the mini nests. Decorate by placing three chocolate mini-eggs in each of the 10 mini-nests around the edge of the dessert.", "Put 100ml/3½fl oz water and the caster sugar in a pan. Bring to the boil, stirring. Add the zest and boil for 2-3 minutes, or until syrupy. Drain on parchment paper, roll in extra caster sugar and leave to dry in a warm place for a couple of hours, or overnight. Place a delicate mound of candied zest in the middle of the pavlova, and serve."]}, {"isVegetarian": true, "title": "Easter Men", "url": "www_bbc_co_uk_food_recipes_easter_men_31265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz milk. ", "900g/2lb strong white flour", "pinch salt", "14g/½oz fast-action yeast (2 sachets)", "30g/1oz butter", "oil, for greasing", "6 free-range eggs, plus 1 beaten egg for glazing", "18 currants "], "serves": "Makes 6 bread 'men'", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line 3 baking trays with non-stick baking paper.", "Gently heat the milk until tepid. Measure the flour into a large bowl, add the salt to one side of the bowl and the yeast on the opposite side. Rub in the butter using your fingertips. Pour in the tepid milk and mix to combine. Transfer the mixture to a freestanding mixer fitted with a dough hook. Knead until it leaves the side of the bowl and forms a ball of dough. Alternatively, tip out the mixture onto a floured work surface and knead the dough for 10 minutes, or until smooth and elastic to the touch. ", "Put the dough in a lightly oiled bowl and cover loosely with cling film. Set aside until doubled in size. This will take less than an hour in a warm place. ", "Once the dough has proved, carefully remove it from the bowl (expect the dough to collapse once touched). Place on a lightly floured surface and divide into 6 equal pieces. ", "Using your fingers, or a rolling pin, roll the dough to a flatter rectangle shape (about 2.5cm/1in thick). Place an egg (still in its shell) in the middle pressing down slightly. Imagine the dough as a clock, makes short slits at 2, 4, 6, 8 and 10 o’clock. Stretch out the dough to form the legs and arms and shape the top into a circle to form a head.  Pull the arms up and secure over the egg. Use the currants to make eyes and a smile. Glaze with beaten egg. Repeat with the remaining dough.", "Place each 'man' on the prepared baking tray (they will expand as they cook so it’s best to place 2 on each tray). Bake for 25 minutes, or until golden-brown.", "Serve warm. Remove the egg and break the shell to release the hard-boiled egg. Serve with a little butter."]}, {"isVegetarian": false, "title": "Easter simnel cake", "url": "www_bbc_co_uk_food_recipes_easter_simnel_cake_82449", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_cake_82449_16x9.jpg", "ingredients": ["100g/4oz glacé cherries", "225g/8oz  butter, softened", "225g/8oz light muscovado sugar", "4 large eggs", "225g/8oz self-raising flour", "225g/8oz sultanas", "100g/4oz currants", "50g/2oz chopped candied peel", "2 lemons, grated zest only ", "2 tsp ground mixed spice", "450g/1lb marzipan", "1-2 tbsp apricot jam, warmed"], "serves": "Makes One cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/280F/Gas 2. Grease and line a 20cm/ 8in cake tin. ", "Cut the cherries into quarters, put in a sieve and rinse under running water. Drain well then dry thoroughly on kitchen paper. ", "Place the cherries in a bowl with the butter, sugar, eggs, self-raising flour, sultanas, currants, candied peel, lemon zest and mixed spice and beat well until thoroughly mixed. Pour half the mixture into the prepared tin.", "Take one-third of the marzipan and roll it out to a circle the size of the tin and then place on top of the cake mixture. Spoon the remaining cake mixture on top and level the surface.", "Bake in the pre-heated oven for about 2½ hours, or until well risen, evenly brown and firm to the touch. Cover with aluminium foil after one hour if the top is browning too quickly. Leave to cool in the tin for 10 minutes then turn out, peel off the parchment and finish cooling on a wire rack.", "When the cake is cool, brush the top with a little warmed apricot jam and roll out half the remaining marzipan to fit the top. Press firmly on the top and crimp the edges to decorate. Mark a criss-cross pattern on the marzipan with a sharp knife. Form the remaining marzipan into 11 balls. ", "Brush the marzipan with beaten egg and arrange the marzipan balls around the edge of the cake. Brush the tops of the balls with beaten egg and then carefully place the cake under a hot grill until the top is lightly toasted."]}, {"isVegetarian": false, "title": "Spiced pork loin with black pudding sauce, asparagus, and spiced January King cabbage", "url": "www_bbc_co_uk_food_recipes_easter_spiced_pork_loin_42095", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp salt", "½-1 orange, zest only", "6 juniper berries, crushed", "1 stick cinnamon, crushed", "2 tsp Jamaican allspice", "pinch sugar", "700g/1lb 9oz pork loin", "1 large parsnip, peeled and cut into large dice", "600ml/21fl oz chicken stock, plus extra for the gravy", "1 tbsp icing sugar", "pinch fecule (potato flour)", "1 black pudding (2cm/¾in thick, 12cm/4½in long), diced", "knob of butter", "dash of cream", "2 tbsp chopped parsley ", "8 spears new season asparagus ", "4 pieces deep-fried pork rind, to garnish", "300g/11oz January King cabbage, thinly sliced", "30g/1oz salt", "50g/1¾oz smoked bacon lardons", "5g roasted garlic", "25ml/1fl oz rice vinegar", "2 pinches of cumin", "pinch salt, to taste"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork loin, mix together the salt, orange zest, juniper, cinnamon, Jamaican allspice and a pinch of sugar. Rub this all over the pork loin. Wrap tightly in clingfilm and leave to marinate in the fridge for three days.", "For the spicy cabbage, when you are ready to cook, mix the 30g/1oz of salt with the sliced cabbage and set aside for 30 minutes.", "Meanwhile, put the pork in a pressure cooker with the diced parsnip and stock and cook for 25 minutes.", "Remove the pork from the cooker. Allow it to rest for five minutes then sprinkle with icing sugar and glaze with a blow torch. ", "To make the sauce, pour off the excess cooking juices from the pork into a small pan, add a little more stock and bring to the boil, thicken lightly with fecule (potato starch) and pass through a fine sieve. Add the diced black pudding. Reserve.", "Remove the parsnips and crush with a fork, add a knob of butter and a few drops of cream. Mix in the parsley and reserve.", "Cook the asparagus spears in boiling water with a pinch of salt and sugar added.", "To cook the spicy cabbage, wash the cabbage thoroughly and dry well.", "In a heavy-bottomed pan, gently fry the bacon, add the roast garlic then the cabbage, rice vinegar and cumin. Mix well and season to taste with salt.", "Stir well and cook for two minutes, or until the cabbage is tender. Check the seasoning again and reserve.", "To serve, place the spicy cabbage in the center of the plate. Carve the pork into two slices per portion and place on top. Place the crushed parsnip to the right and garnish with asparagus. Spoon on the gravy and black pudding. Garnish with the pork rind and serve. "]}, {"isVegetarian": true, "title": "Easter simnel truffles", "url": "www_bbc_co_uk_food_recipes_easter_simnel_truffles_05358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easter_simnel_truffles_05358_16x9.jpg", "ingredients": ["200ml/7fl oz full-fat milk or double cream", "1 cinnamon stick, crushed", "half a nutmeg, grated", "75g/2¾oz muscovado sugar", "300g/10½oz dark chocolate (preferably with 62% or more cocoa solids), finely chopped", "5 tsp brandy", "100g/3½oz marzipan", "100g/3½oz cocoa powder", "100g/3½oz icing sugar", "25g/1oz ground cinnamon", "10g/¼oz ground nutmeg", "400g/14oz dark chocolate, melted and tempered"], "serves": "Makes approximately 30 truffles", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the ganache, put the milk or cream, spices and sugar into a saucepan and bring to a simmer. Place the chopped chocolate in a heatproof bowl. Remove the spiced milk from the heat and strain through a fine sieve onto the chopped chocolate. Whisk until smooth, then add the brandy and whisk again. Pour into a plastic container and refrigerate for an hour, or until set.", "Roll the marzipan into small balls the size of a hazelnut. Coat the marzipan balls in the set ganache and place on a tray.", "For the coating, place the cocoa powder, icing sugar, cinnamon and ground nutmeg into a bowl. ", "Melt and temper the dark chocolate by breaking the chocolate into small, even pieces and gently melting it in a bowl over a saucepan of hot, not boiling, water. Place a cook’s thermometer into the chocolate and continue to heat until it reaches 43C/110F. Remove from the heat and cool to 35C/95F. Now it is ready to use.", "Using your fingers, dip each truffle in the melted, tempered chocolate and drop into the cocoa powder mixture, rolling until the truffle is completely coated. Set aside to cool on a plate. ", "Eat the truffles at room temperature, so they are very soft inside."]}, {"isVegetarian": true, "title": "Easter garibaldi biscuits", "url": "www_bbc_co_uk_food_recipes_easterbiscuits_67742", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easterbiscuits_67742_16x9.jpg", "ingredients": ["110g/4oz caster sugar, plus extra for dusting", "110g/4oz butter, softened at room temperature", "1 free-range egg, separated", "225g/8oz plain flour, sieved", "good pinch mixed spice", "55g/2oz currants", "30g/1oz candied peel", "3 tbsp milk"], "serves": "Makes 20-25 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 160C/325F/Gas 3. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until light and fluffy. Beat in the egg yolk until well combined.", "Fold the flour into the mixture,  then stir in the mixed spice, currants and candied peel.  Stir in enough milk to form a stiff dough.", "Roll the dough out onto a floured surface and cut out the biscuits with a fluted cutter. Place onto the baking sheet and bake for 10 minutes.", "Remove the biscuits from the oven, brush with the reserved egg white, sprinkle with sugar and return to the oven for 5-10 minutes, or until pale golden-brown.", "Remove the biscuits from the tray and set aside to cool on a wire rack."]}]