[{"isVegetarian": true, "title": "Lime and coriander rice", "url": "www_bbc_co_uk_food_recipes_limeandcorianderrice_88154", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz basmati rice", "3 tbsp fresh chopped coriander", "1 lime, zest and juice", "salt and freshly ground black pepper", "dash of olive oil"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the rice according to the packet instructions and then stir in the coriander, lime zest and juice, salt and freshly ground black pepper and olive oil. ", "Spoon into a bowl and serve."]}, {"isVegetarian": true, "title": "Lime cheesecake with strawberries", "url": "www_bbc_co_uk_food_recipes_limecheesecakewithst_92316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 strawberries, hulled and sliced", "300ml/½ pint double cream", "3 tbsp Greek-style yoghurt", "4 tbsp condensed milk", "½ lime, zest and juice", "55g/2oz dark chocolate, melted"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put two 10cm/4in diameter chefs' rings on two plates. Line the edges with strawberry slices.", "Whisk the cream in a mixing bowl until it forms soft peaks. Stir in the Greek-style yoghurt, condensed milk and lime zest. Add the lime juice, to thicken the mixture.", "Spoon the cream mixture into the strawberry-lined rings and level off the top. Place in the fridge to set for 5-10 minutes, or longer if possible.", "Release the cheesecakes from the rings by heating carefully with a cook's blowtorch around the outside. Drizzle with the melted chocolate and serve."]}, {"isVegetarian": true, "title": "Lime and cranberry bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_limeandcranberrybrea_92670", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/limeandcranberrybrea_92670_16x9.jpg", "ingredients": ["8 limes, zest and juice", "85g/3oz chilled butter, cut into cubes", "225g/8oz caster sugar", "3 free-range eggs, lightly beaten", "300ml/10½fl oz full-fat milk", "300ml/10½fl oz double cream", "pinch salt", "3 free-range eggs", "100g/3½oz soft light brown sugar", "40g/1½oz unsalted butter, softened, plus extra for greasing", "4-6 soft white bread rolls, sliced", "100g/3½oz fresh cranberries", "50g/2oz dried cranberries", "3-4 tbsp rum (optional)", "8 tbsp ready-made redcurrant jelly, for glazing", "200ml/7fl oz double cream, whipped until stiff peaks form when the whisk is removed, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the lime curd, heat all of the lime curd ingredients in a heavy-based saucepan over a low heat for 10-12 minutes, stirring constantly, until the mixture thickens. Strain through a fine sieve and set aside to cool. Once cool, pour into sterilised jam jars.", "For the pudding, heat the milk and cream in a separate saucepan until just boiling, then remove the pan from the heat. In a separate bowl, whisk the eggs, salt and sugar together until well combined, then pour the milk and cream mixture over the egg and sugar mixture, whisking until smooth and well combined.", "Butter the bread slices and, using about 12 tablespoons of the lime curd, spread curd over both sides of each slice of bread.", "Cover the bottom of a greased ovenproof dish with a layer of the bread slices, overlapping the edges of the bread slightly. Sprinkle over some of the fresh and dried cranberries and 1-2 tablespoons of rum, if using. Repeat the layering process once more, or until all of the bread, cranberries and rum have been used up. (NB: You should have enough for two layers.)", "Pour the cream and egg mixture over the bread and set aside to soak for one hour. ", "Preheat the oven to 180C/365F/Gas 4.", "Place the pudding dish into a roasting tray. Carefully add enough boiling water to the tray to reach one third of the way up the sides of the pudding dish (this is called a bain-marie). Transfer to the oven and bake for 40-45 minutes, uncovered, or until the custard has set and the top of the pudding is pale golden-brown. (NB: Check the pudding occasionally during cooking, pushing any cranberries that float to the surface back under the custard as it sets, using a fork, to prevent the cranberries from burning.)", "Remove the pudding from the oven and from the bain-marie and set aside to cool for 8-10 minutes. ", "Meanwhile, heat the redcurrant jelly in a saucepan with two tablespoons of water, until the jelly has melted and the mixture forms a smooth sauce. Brush the top of the pudding all over with this mixture, then set aside to cool for a further 10 minutes.", "Serve with the whipped cream."]}, {"isVegetarian": false, "title": "Limed queen scallops flambéed in tequila", "url": "www_bbc_co_uk_food_recipes_limedqueenscallopsfl_79862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["generous glug olive oil ", "generous knob butter ", "4 small shallots, finely chopped", "1 lime, juice and zest only", "1 tsp sugar", "2 dozen queen scallops, trimmed and ready to cook", "generous glug good-quality tequila (you can drink the rest of the bottle over dinner!)", "1 handful chives finely chopped ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil and butter in a heavy-bottomed frying pan over a medium heat. Add the shallots and sweat gently - do not allow to brown.", "Add the lime juice and zest and cook for a minute or two.", "Add the sugar and stir continuously - it's important to keep the ingredients moving around the pan at this point to prevent the sugar from burning.", "Increase the heat to high then add the scallops. Fry for another minute.", "Add a big glug of tequila and the chopped chives and flambé - if cooking on gas carefully let the flame just catch the pan or if using an electric hob you might need to use a match to ignite the tequila (CAUTION: Take care when flambéing the scallops and keep your face well away from the pan. If you're not an experienced cook you must be aware that this method of cooking can create large flames). If the tequila doesn't light quickly then don't be tempted to keep the pan on the heat any longer as this will overcook the scallops.", "Serve the scallops hot from the pan and in warm tortilla wraps or with lemon butter rice."]}, {"isVegetarian": true, "title": "Lime, ginger and vanilla soufflé", "url": "www_bbc_co_uk_food_recipes_limegingerandvanilla_81308", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites", "100g/3½oz caster sugar", "100ml/3½fl oz milk", "25g/1oz unsalted butter, plus extra for greasing", "1 tsp cornflour", "½ tsp ground ginger", "¼ tsp vanilla extract", "2 limes, zest only", "icing sugar, for dusting"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and place a baking tray in the oven to heat.", "In a large bowl whisk the egg whites until stiff peaks form. Gradually add the sugar and continue whisking until light and fluffy. Stop when the mixture is thick enough to leave a ribbon-like trail when the whisk is lifted.", "Heat the milk in a small saucepan to scalding point. Add the 25g/1oz butter and allow it to melt, then add the cornflour, ground ginger and vanilla extract. Whisk until thick. Pour into a large bowl and mix in the lime zest. ", "Spoon a little of the egg white mixture into the lime and ginger mixture and mix well. Carefully fold in the rest of the egg white mixture, making sure to maintain the volume.", "Fill two greased ramekins with the mixture and place on the hot baking sheet and into the oven. Cook for 10 minutes until the soufflés have risen.", "To serve, place the soufflés on the centre of a plate and dust with icing sugar."]}, {"isVegetarian": false, "title": "Lime roasted salmon fillet on citrus coriander mushy peas", "url": "www_bbc_co_uk_food_recipes_limeroastedsalmonfil_90411", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5oz salmon fillet", "1 lime, peeled and sliced", "1 tsp brown sugar", "salt and freshly ground black pepper", "85g/3oz frozen peas", "25g/1oz butter", "1 lime, juice only", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the salmon, heat half of the olive oil in an ovenproof frying pan and fry the fish skin-side down for 2-3 minutes, or until crisp and golden-brown. Lay the lime slices over the fish, sprinkle with the sugar, season with salt and freshly ground black pepper and place into the oven to roast for 5-7 minutes, or until cooked through. ", "For the peas, cook the peas in boiling water for 2-3 minutes, or until tender. Drain, then mash with the butter and lime juice and season with salt and freshly ground black pepper. ", "To serve, spoon the mushy peas onto a serving plate and lay the salmon over the top."]}, {"isVegetarian": false, "title": "Lime syrup", "url": "www_bbc_co_uk_food_recipes_limesyrup_72368", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz caster sugar", "8 green cardamom pods, seeds removed and crushed", "150ml/5¼fl oz water", "150ml/5¼fl oz lime juice", "1 tbsp grated lime zest or to taste", "pineapple chunks or rings"], "serves": "Makes 4 Servings", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the caster sugar, cardamom pods and water in a pan. Stir over a gentle heat until the sugar has dissolved.", "Take off the heat and allow to cool before adding the lime zest. Mix and pour over the pineapple chunks or rings."]}, {"isVegetarian": true, "title": "Limoncello trifle", "url": "www_bbc_co_uk_food_recipes_limoncello_trifle_74838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs  ", "165g/6oz caster sugar", "2 free-range eggs, yolks only", "80g/3oz unsalted butter", "1 lemon, zest and juice only", "6-8  thick slices of Sicilian lemon and orange sweet bread (crusts off), quartered", "small glass of limoncello liqueur", "4 small meringue nests", "300ml/10fl oz fresh custard      ", "300ml/10fl oz double cream", "1 tbsp icing sugar", "¼ tsp vanilla extract", "handful toasted almond slivers", "candied lemon zest"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lemon curd, whisk the eggs, sugar and yolks together in a bowl. ", "In a heavy-based pan, over a very low heat, gently heat the butter, zest and juice, until the butter has melted. Add the egg mixture and stir constantly over a low heat until it’s thickened. This will take 10 minutes or more. Don’t rush it or you’ll get scrambled eggs. ", "Strain the lemon curd mixture into a bowl and cover with a circle of baking parchment, or use clingfilm in contact with the surface, to prevent a skin forming, and allow to cool.  If you are not using the curd immediately, strain into a sterilized jar, allow to cool and seal. ", "To assemble the trifle, line a 2 litre/3½ pint serving bowl with slices of Sicilian lemon and orange sweet bread, overlapping them slightly. ", "Drizzle the limoncello over the top and let it soak into the bread, then spread the lemon curd on top. ", "Break up the meringue nests and scatter them over the curd, followed by the custard generously spooned over the top. ", "Pour the cream into a bowl. Add the sugar and vanilla essence and whisk until it holds soft peaks when the whisk is removed. Spoon the cream over the top of the trifle in soft peaks. Scatter over the toasted almond and candied lemon zest. Chill until ready to serve."]}, {"isVegetarian": false, "title": "Limoncello-flavoured panna cotta with fresh strawberry sauce", "url": "www_bbc_co_uk_food_recipes_limoncelloflavouredp_11694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 gelatine leaves ", "250ml/8fl oz milk ", "250ml/8fl oz double cream ", "25g/1oz sugar ", "50ml/2oz limoncello liqueur    ", "knob of butter ", "50g/2oz sugar  ", "150g/5oz strawberries, quartered  ", "½ lemon, juice only", "To decorate:  ", "lemon slices dredged in icing sugar"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soften the gelatine leaves in cold water.  ", "In a heavy-based saucepan, mix the milk, cream, sugar and limoncello liqueur.  Gently simmer,  remove from the heat and add the gelatine leaves.", "Stir until the gelatine has dissolved and pour into dariole moulds.  Leave to cool, then place in the fridge to set.  ", "To make the sauce, place the butter and sugar in a saucepan over a gentle heat and allow the butter to melt and sugar dissolve.  ", "Add the chopped strawberries and lemon juice.  Remove from the heat and pass through a sieve. Allow to cool. ", "Turn the panna cotta out onto individual serving plates and spoon the strawberry sauce all around.  Decorate with a slice of lemon dipped in icing sugar.   "]}, {"isVegetarian": true, "title": "Lincolnshire plum bread", "url": "www_bbc_co_uk_food_recipes_lincolnshireplumbrea_92134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz prunes, pits removed, roughly chopped", "50g/2oz currants", "50g/2oz sultanas", "150ml/5fl oz Earl Grey tea", "450g/1lb strong plain flour, plus extra for flouring", "125ml/4½fl oz milk", "6 tbsp soft brown sugar", "110g/4oz butter, melted, plus extra butter for greasing", "2 free-range eggs, beaten", "1½ tsp ground cinnamon", "1½ tsp ground allspice", "½ tsp vanilla extract ", "¼ tsp salt", "15g/½oz dried yeast", "butter", "Lincolnshire cheese"], "serves": "Makes 1 loaf (6-8)", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the dried fruits into a bowl and pour over the Earl Grey tea. Mix well and set aside to soak for 10 minutes.", "Meanwhile, sift the flour into a large bowl. Prepare a large loaf tin by greasing and flouring the bottom and sides.", "In a separate bowl, whisk together the milk, sugar, melted butter and eggs until well combined.", "Add the spices, vanilla extract and salt and whisk again to combine. ", "Add the dried yeast and whisk again to combine.", "Add the sifted flour a little at a time and whisk until all of the flour has been incorporated into the mixture and the mixture comes together as a soft dough.", "Strain the soaked dried fruits and discard the tea. Add the soaked fruits to the dough and knead for 3-5 minutes, or until the dough is smooth and elastic and the fruits are well combined in the mixture. ", "Transfer the dough to a clean bowl, cover with a clean tea towel and set aside in a warm place for 1-2 hours, or until doubled in size (proved). ", "When the dough has doubled in size, turn it out onto a lightly floured work surface and knead briefly. Transfer the dough to a large loaf tin and set aside for a further hour to rise.", "Preheat the oven to 190C/375F/Gas 5.", "When the dough has risen, bake in the oven for 40-50 minutes, or until golden-brown. Set aside to cool in the tin. ", "Allow to cool before slicing.", "To serve, cut the plum bread into slices and serve with butter and cheese."]}, {"isVegetarian": true, "title": "Lincolnshire Poacher cheese and potato croquettes with tomato salad", "url": "www_bbc_co_uk_food_recipes_lincolnshirepoacherc_86700", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large baking potatoes", "salt and freshly ground black pepper ", "110g/4oz Lincolnshire Poacher cheese, cut into small cubes", "50g/2oz plain flour", "2 free-range eggs, beaten", "50g/2oz fresh breadcrumbs", "vegetable oil, for deep-frying", "4 plum tomatoes, roughly chopped", "1 red onion, finely chopped", "1 tbsp capers", "handful flatleaf parsley, roughly chopped", "2 tbsp red wine vinegar", "4 tbsp rapeseed oil", "salt and freshly ground black pepper ", "75g/3oz mixed salad leaves"], "serves": "Serves 2-4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the croquettes, prick the baking potatoes all over with a fork and place in the oven for an hour, or until tender.", "Scoop the potato flesh into a bowl, discarding the skins. Mash with a potato masher until smooth and season, to taste, with salt and freshly ground black pepper. Set aside to cool.", "Take a piece of cheese and mould a little of the potato around it, pressing firmly into a sausage shape. Repeat with the remaining cheese and potato.", "Dredge the potato 'sausages' in the flour, then dip into the beaten egg and then the breadcrumbs to coat. Place in the fridge to set for 30 minutes.", "Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Remove the croquettes from the fridge and carefully place into the hot oil. Deep fry for 2-3 minutes, or until golden-brown and crisp on the outside and melting inside. Remove from the oil with a slotted spoon and drain on kitchen paper.", "For the salad, place the tomatoes, red onion, capers and flatleaf parsley into a bowl and stir.", "In a small bowl, whisk the vinegar and oil together and season, to taste, with salt and freshly ground black pepper.", "Pour two thirds of the dressing over the tomato salad and mix well. In another bowl, toss the salad leaves with the remaining dressing.", "To serve, place the croquettes onto serving plates with the tomato and leaf salads."]}, {"isVegetarian": true, "title": "Muhallabi (almond milk pudding)", "url": "www_bbc_co_uk_food_recipes_lindas_muhallabi_milk_08578", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lindas_muhallabi_milk_08578_16x9.jpg", "ingredients": ["7 tbsp cornflour", "1 litre/1¾ pints almond milk (with no added sugar, if possible)", "5 tbsp caster sugar", "2 tsp vanilla essence", "2 tbsp rosewater", "2 whole cardamom pods", "2 tbsp pistachios or almonds, coarsely ground", "1 tbsp finely ground cardamom"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the cornflour with a little of the almond milk to a smooth paste. Set aside.", "In a saucepan, heat the remaining almond milk with the sugar, vanilla essence, rosewater and cardamom pods over a medium heat, stirring until mixed well.", "Once the mixture has heated through, discard the cardamom pods, then pour in the cornflour paste and whisk vigorously until the mixture is smooth and has thickened to an almost custard-like consistency; this will take 10-15 minutes. Be careful not to let the mixture stick to the bottom of the pan.", "Pour the mixture into individual dishes or a large serving bowl and decorate with a sprinkling of ground pistachios or almonds and the ground cardamom. Set aside to cool, then cover and chill in the fridge for at least 15 minutes. Serve chilled."]}, {"isVegetarian": false, "title": "Linguine with fresh crab", "url": "www_bbc_co_uk_food_recipes_linguine_with_fresh_crab_02642", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz '00' flour, plus extra for dusting", "5 free-range eggs, lightly beaten", "pinch salt", "2 tbsp extra virgin olive oil", "1–2 tbsp cold water", "4 whole live crabs (800–900g/1lb 12oz–2lb each)", "1 leek, halved", "few sprigs fresh parsley ", "500ml/18fl oz white wine", "5 whole garlic cloves ", "85g/3oz pesto", "4 tbsp olive oil", "3 garlic cloves, finely chopped", "1 tsp finely chopped red chilli", "4 courgettes, finely diced", "1 tbsp finely chopped fresh parsley", "400g/14oz linguine, from the recipe above"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the linguine, put the flour on a work surface, make a well in the centre and add the beaten eggs, salt and oil. Using your fingertips in a circular motion, slowly incorporate the flour into the egg mixture, adding a little water if necessary, to form a dough.", "Knead for 5 minutes, until the dough is elastic and springs back when gently pressed. Cover with cling film and allow to rest for at least 30 minutes in the fridge.", "Roll the pasta dough out in 4-6 batches using a pasta machine working from the thickest to the penultimate setting, allowing the sheets to dry for 10 minutes uncut. Pass the rolled sheets through the linguine cutter on the machine and hang the linguine over a coat hanger or similar to air while you cook the sauce. ", "For the sauce, put the leek, parsley sprigs, 300ml/10fl oz of the wine, 5 whole garlic cloves in a large stock pot with enough water to cover the crabs. Bring to the boil, add the crabs and cook for about 6 minutes.", "Remove the crabs from the hot water and place immediately into iced water. When the crabs are cold, remove the meat from each. Open the body, remove all the brown meat and set aside. Remove the white meat from the skinny legs but leave the claws. Mix the white and brown meat together. Crack the claws but leave whole. Place the claws in a baking dish, pour over the pesto and leave to marinate. Clean out the crab shells.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Heat the olive oil in a large saucepan, add the chopped garlic, chilli, brown and white crab meat, courgettes and chopped parsley. Fry for 1 minute then add the remaining wine. When the sauce has bubbled down and thickened, remove from the stove. ", "Bake the marinated crab claws in the oven for 2 minutes to heat through.", "Meanwhile, bring a large pan of salted water to the boil and cook the fresh linguine for 2–3 minutes, drain and add to the sauce. Mix together and serve immediately.", "Present the dish with the linguine and sauce in a warmed pasta plate with a crab claw on top."]}, {"isVegetarian": false, "title": "Linguine with prawns and mussels", "url": "www_bbc_co_uk_food_recipes_linguine_with_prawns_and_29068", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguine_with_prawns_and_29068_16x9.jpg", "ingredients": ["500g/1lb 2oz mussels", "250g/9oz whole raw prawns ", "6 tbsp olive oil", "1 garlic clove, crushed", "½ red chilli, finely sliced", "50ml/2fl oz white wine", "1 lemon, juice only", "small bunch flatleaf parsley, roughly chopped", "400g/14oz linguine", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels by scrubbing them in cold water, and removing the beards. If any remain open after tapping them against the side of the work surface, discard them. Peel the prawns, removing the heads but leaving the tails intact. ", "Heat the olive oil in a large lidded saucepan, and add the garlic and chilli. After a minute or two, add the mussels and the wine. Cover with the lid and continue cooking for 1-2 minutes, or until the mussels open. If any mussels remain closed at the end of cooking, discard them.", "Add the prawns and cook for a further 4–5 minutes, then squeeze in the lemon juice. Remove the pan from the heat and add the roughly chopped parsley. Season to taste with salt and freshly ground black pepper.", "Meanwhile, cook the linguine in lightly salted boiling water for 7-8 minutes, or until al dente. Add the pasta to the pan with the shellfish sauce, mix together well and serve immediately. "]}, {"isVegetarian": false, "title": "Linguine alla carbonara", "url": "www_bbc_co_uk_food_recipes_linguineallacarbonar_85503", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp butter", "4 bacon rashers, chopped", "1 garlic clove, finely chopped", "5 tbsp double cream", "100g/3½oz fresh linguine, cooked according to packet instructions and drained", "1 free-range egg yolk", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh basil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan and fry the bacon until golden-brown. Add the garlic and cook for one minute.", "Add the double cream and bring up to the boil.", "Remove from the heat and immediately add the warm linguine and the egg yolk. Stir to coat the pasta.", "To serve, sprinkle over the chopped herbs and place the pasta into a serving dish."]}, {"isVegetarian": true, "title": "Linguine omelette with goats' cheese and aubergine", "url": "www_bbc_co_uk_food_recipes_linguineomelettewith_89109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ aubergine, chopped", "3 free-range eggs, beaten", "100g/3½oz goats' cheese, crumbled", "3 tbsp chopped fresh parsley", "½ tsp chilli flakes", "salt and freshly ground black pepper", "150g/5½oz linguine, cooked according to packet instructions"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half of the oil in a frying pan and fry the chopped aubergine for 5-6 minutes, or until softened.", "In a large bowl, combine the beaten eggs, goats' cheese, chopped parsley, chilli flakes, salt and freshly ground black pepper then stir in the cooked pasta. Add the fried aubergine and mix well. ", "Heat the remaining oil in  small frying pan and tip in the pasta mixture. Allow to cook for 3-4 minutes, or until the bottom is golden-brown and set, then carefully turn the pasta omelette over to cook the other side for a further 3-4 minutes, or until golden-brown and set. ", "To serve, slide onto a serving plate and cut into wedges."]}, {"isVegetarian": true, "title": "Linguine with chilli, lemon and basil", "url": "www_bbc_co_uk_food_recipes_linguinewithchillile_85502", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["handful fresh basil leaves ", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 red chilli, finely chopped", "2 garlic cloves, finely chopped", "½ lemon, juice only", "small handful fresh basil leaves, chopped", "200g/7oz fresh linguine, cooked according to packet instructions and drained"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the basil paste, place the basil and olive oil into a small food processor, season with salt and freshly ground black pepper and blend until smooth.", "For the linguine, heat the oil in a pan and gently fry the chilli and garlic for 1-2 minutes.", "Add the lemon juice, chopped basil leaves and cooked linguine and stir well to coat the pasta.", "To serve, place the linguine into a serving dish and top with a dollop of basil paste."]}, {"isVegetarian": false, "title": "Linguine with chilli crab", "url": "www_bbc_co_uk_food_recipes_linguinewithchillicr_7294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried linguine", "15ml-1 tbsp chilli oil", "2 cloves garlic, chopped", "1 large red chilli, finely chopped", "2 tbsp flat leaf parsley, chopped", "170g/6oz tin white crab meat", "juice of 1 lemon", "30-45ml/2-3 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the linguine into a pan of boiling, salted water.", "Heat the chilli oil in a small pan, add the garlic, chilli, parsley and crab meat and cook gently for a couple of minutes.", "Stir in the lemon juice and olive oil.", "Drain the pasta and stir through the chilli crab sauce. Serve immediately."]}, {"isVegetarian": false, "title": "Linguine with pancetta, broccoli and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_linguinewithpancetta_86108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz pancetta or streaky bacon, chopped", "¼ onion, chopped", "½ head broccoli, cut into florets", "1 tsp chilli flakes", "5 tbsp white wine", "200g/7oz canned cherry tomatoes", "salt and freshly ground black pepper", "250g/9oz linguine, cooked according to packet instructions and drained"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a non-stick frying pan and fry the pancetta or bacon until crisp.", "Add the onion and fry until softened.", "Add the broccoli, chilli flakes and white wine and simmer until the wine has reduced by half.", "Add the cherry tomatoes and simmer for a further 3-4 minutes, or until the broccoli is tender and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Add the pasta to the pan and stir to coat in the sauce.", "To serve, place the pasta into serving dishes."]}, {"isVegetarian": true, "title": "Linguine with pesto", "url": "www_bbc_co_uk_food_recipes_linguinewithpesto_84898", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz linguine, cooked according to packet instructions", "2 tbsp olive oil", "1 clove garlic, chopped", "3 spring onions, chopped", "1 handful fresh mint leaves, very finely chopped", "1 handful fresh basil leaves, very finely chopped", "1 garlic clove, chopped", "50ml/1¾fl oz olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan over a medium heat. Add the garlic and spring onions and fry for three minutes, until softened.", "Add the cooked linguine and stir well to warm through.", "For the pesto, place the mint, basil, garlic and oil into a bowl and mix well. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the linguine onto a plate and spoon the pesto over."]}, {"isVegetarian": false, "title": "Linguine with roasted figs", "url": "www_bbc_co_uk_food_recipes_linguinewithroastedf_79285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large fresh figs", "8 slices prosciutto or speck bacon", "2 shallots, peeled and chopped", "2 garlic cloves, peeled and chopped ", "1 tbsp olive oi, plus extra for cooking pastal", "100ml/3fl oz white wine ", "200g/7oz dolcelatte cheese", "300ml/10fl oz double cream ", "salt and freshly ground black pepper", "2 large sprigs fresh mint, chopped", "15g/½oz fresh basil, chopped ", "15g/½oz fresh chives, chopped ", "40g/1oz parmesan cheese, shaved", "400g/14oz linguine"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/450F/Gas 8.", "Wrap each fig in two slices of prosciutto or speck bacon and secure with wooden cocktail sticks.", "Bake in the oven for about 5-6 minutes, until the bacon is nice and crisp.", "Meanwhile, sweat the shallots and garlic in one tablespoon of olive oil for a few minutes, then add the white wine.", "Boil to reduce by half, then add the dolcelatte cheese and cream.  Reduce until slightly thickened, but do not boil or the mixture will split because of the fat in the cheese.", "Season with salt and pepper and add the some of the herbs, reserving the rest of the herbs for later.", "Cook the pasta in a generous amount of boiling salted water, with a little olive oil in it, according to packet instructions (usually about 6-8 minutes for linguine). Drain it well.", "Combine the drained pasta with the sauce and divide between four serving plates.", "Remove the cocktail sticks from the wrapped figs and place one wrapped fig on top of each plate of pasta.", "Garnish with the shavings of parmesan and the remaining fresh herbs."]}, {"isVegetarian": true, "title": "Linguine with spicy tomatoes and broccoli", "url": "www_bbc_co_uk_food_recipes_linguinewithspicytom_88952", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 clove garlic, chopped", "1 tsp curry powder", "6 cherry tomatoes, halved", "½ head broccoli, cut into florets", "splash white wine", "splash boiling water", "salt and freshly ground black pepper ", "100g/3½oz linguine"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan, add the onion and fry for 2-3 minutes, or until softened but not coloured. Add the garlic and curry powder and fry for one minute, then stir in the cherry tomatoes and cook for 4-5 minutes, or until softened.", "Add the broccoli florets, a splash of white wine and a splash of boiling water and simmer for 3-4 minutes, or until the broccoli is just tender. Season with salt and freshly ground black pepper.", "Cook the linguine, according to packet instructions, then drain. Add the cooked linguine to the sauce and stir well to coat.", "Pile the linguine into a bowl and serve."]}, {"isVegetarian": false, "title": "Tuna pasta sauce with linguine", "url": "www_bbc_co_uk_food_recipes_linguinewithtunafish_70041", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/linguinewithtunafish_70041_16x9.jpg", "ingredients": ["375g/13oz dried linguine", "4 tbsp extra virgin olive oil", "3 tbsp finely chopped parsley", "2 garlic cloves, finely chopped", "1 small chilli pepper, finely chopped", "1cm/½in fresh ginger root, thinly sliced", "450g/1lb carton or bottle passata", "400g tin of tuna fish in oil, drained and roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta for 8-10 minutes or until al dente, and drain. ", "Meanwhile, heat the oil and gently fry 2 tablespoons of the parsley, the garlic, chilli and the ginger for a few minutes until slightly soft. Add the tomatoes and continue to cook for another few minutes. Stir in the tuna and salt.", "Toss the pasta with the sauce and serve sprinkled with the remaining parsley and freshly ground pepper."]}, {"isVegetarian": false, "title": "Linguini vongole with spinach", "url": "www_bbc_co_uk_food_recipes_linguinivongolewiths_81821", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz linguini", "1 tbsp olive oil", "1 clove garlic, finely chopped", "250g/9oz fresh clams, cleaned", "100ml/3½fl oz white wine", "100g/3½oz baby spinach leaves", "1 tbsp chopped fresh parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the linguini in salted boiling water until al dente. Drain and set aside.", "Heat the olive oil in a medium-sized saucepan, add the garlic and cook gently until softened. ", "Add the clams and white wine, cover with a lid and cook for two minutes. ", "Stir in the spinach and cook, covered, for one minute. ", "Add the linguini to the clams, stir well and serve in large bowls with chopped parsley to garnish."]}, {"isVegetarian": false, "title": "Linzer torte with crème fraîche", "url": "www_bbc_co_uk_food_recipes_linzer_torte_with_crme_27127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "pinch ground cinnamon", "pinch ground cloves", "40g/1½oz caster sugar", "115g/4oz unsalted butter, softened", "2 free-range egg yolks", "400g/14oz apricot jam", "400g/14oz raspberry jam", "½ lemon, zest and juice ", "8–12 whole blanched almonds", "1–2 tbsp icing sugar", "100g/3½oz crème fraîche"], "serves": "Makes 1 large torte", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put the flour, spices and sugar in a mixing bowl. Rub in the butter, then add the egg yolks and bring the dough together. Wrap in cling film and chill for an hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Set aside approximately a third of the chilled pastry to make a lattice top. On a lightly floured work surface, roll out the remaining pastry to the thickness of a pound coin and line a 23–25cm/9–10in tart tin. Make a lattice by rolling out the reserved pastry and cutting it into 25cm/10in ribbons. Weave the pastry ribbons together leaving equal spaces between each ribbon (so squares of jam will be visible between the pastry).", "Fill the pastry case with apricot jam and place the lattice on top. Trim the edges using a knife. ", "Mix the raspberry jam with the lemon zest and juice and transfer to a piping bag fitted with a plain nozzle (alternatively place in a small food bag and snip off one corner). Pipe the jam into alternate squares of the lattice top. Put an almond on top of each square filled with jam. ", "Bake for 25–30 minutes, or until the pastry is crisp and golden-brown. Leave to cool in the tin. ", "To serve, dust the torte with icing sugar, cut into slices and with a spoonful of crème fraîche alongside."]}]