[{"isVegetarian": false, "title": "Swedish meatballs with cream sauce", "url": "www_bbc_co_uk_food_recipes_swedish_meatballs_with_84586", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedish_meatballs_with_84586_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "600g/1lb 5oz wild boar or pork, minced", "4 anchovy fillets, finely chopped", "100g/3½oz breadcrumbs", "1 free-range egg", "50ml/2fl oz milk or single cream", "½ tsp allspice", "¼ tsp nutmeg", "salt and freshly ground pepper", "25g/1oz butter", "25g/1oz flour", "100ml/3½fl oz white wine", "500ml/18fl oz beef stock", "2 tbsp single cream", "1 tbsp lingonberry jam  or redcurrant jelly", "few sprigs of dill, finely chopped "], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the meatballs, heat the oil in a frying pan and sauté the onion until soft and translucent. Add the garlic and sauté for a further minute. Remove from the heat and leave to cool.", "Put all the meatball ingredients, including the cooked onion and garlic, into a large bowl and mix thoroughly with your hands. Shape the mixture into balls somewhere between the size of a walnut and a golf ball – they should be around 40g/1½oz in weight. You should end up with around 24 meatballs. Put the balls on a baking tray and bake for 12-15 minutes until cooked through.", "To make the gravy, melt the butter in a saucepan large enough to hold the meatballs. Add the flour and stir for 5-10 minutes until the flour and butter have combined into a roux and turned golden-brown. Add the white wine and stir vigorously until well incorporated, then gradually add all the beef stock, stirring thoroughly between each addition to avoid lumps, until you have a slightly thickened gravy. Add the cream and the jam, and mix to combine. Season with salt and pepper.", "Remove the meatballs from the oven and place in the gravy pan. Simmer gently for 5-10 minutes to allow the flavours to combine. Serve with a sprinkling of dill, more jam on the side and lots of mashed potato."]}, {"isVegetarian": true, "title": "Swedish Lucia rolls", "url": "www_bbc_co_uk_food_recipes_swedishluciarollsors_73214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedishluciarollsors_73214_16x9.jpg", "ingredients": ["1 tsp saffron threads", "250ml/9fl oz tepid milk", "500g/1lb 2oz strong white flour", "7g/¼oz sachet of fast-action dried yeast", "1 tsp salt", "50g/1¾oz golden caster sugar", "50g/1¾oz unsalted butter, melted", "100g/3½oz Quark cheese", "1 free-range egg yolk", "handful of raisins"], "serves": "Makes 12 rolls", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Grease a baking tray. Soak the saffron in the milk for 5-10 minutes.", "Combine the flour, yeast, salt and sugar in a mixing bowl and make a well in the centre. Stir the melted butter into the milk and saffron mixture and pour into the well. Add the Quark cheese.", "Stir together briefly, then bring together as a dough. Knead on a floured surface for 10 minutes, or until smooth. Place in an oiled bowl, cover with oiled clingfilm and leave in a warm place for 1½-2 hours until well risen. ", "Preheat the oven to 220C/425F/Gas 7.", "Knock back the dough and divide into 12 pieces. Roll each into a rectangle about 20cm/8in long. Twist each into an 'S' shape, as tight as possible. Place on the prepared baking sheet and cover loosely. Leave for 30-45 minutes or until puffed up.", "Brush the rolls with the egg yolk, then place one raisin in the centre of each circle (two raisins per roll). ", "Bake the rolls for 15 minutes, then remove from the oven and set aside to cool on a wire rack.\r\n"]}, {"isVegetarian": false, "title": "Swedish-style mini-meatballs", "url": "www_bbc_co_uk_food_recipes_swedishstyleminimeat_83684", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swedishstyleminimeat_83684_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 Spanish onion, finely chopped  ", "½ tsp dried oregano", "¼ tsp celery salt", "pinch cumin", "500g/1lb 2oz pork mince", "1 free-range egg yolk", "1 tbsp plain flour, plus extra for dusting", "1 tsp mustard ", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 clove fresh garlic, crushed to a paste in a pestle and mortar", "250ml/9fl oz passata (pressed and seived tomatoes)", "salt and freshly ground black pepper", "hard cheese (such as gruyère, emmental or cheddar), grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, place one tablespoon of the oil into a pan over a medium heat. Add the onions and fry for 2-3 minutes, until soft.", "Add the oregano, celery salt and cumin and stir well. Remove from the heat and allow to cool.", "Place the mince into a large bowl. Add the cooked spiced onions, egg yolk, flour and mustard. Mix together well with floured hands and season with salt and freshly ground black pepper.", "Dust a chopping board with flour. Roll the mince mixture into small walnut-sized balls.", "Heat another tablespoon of oil in a large pan. Add the meatballs and fry over a moderate heat for five minutes, turning over to brown evenly.", "Carefully cut open one meatball to check they are cooked through - the meat should be brown, not pink, all the way to the middle.", "Remove the meatballs from the pan, place onto a serving dish and keep warm.", "To make the tomato sauce, heat the olive oil in a saucepan over a low heat. Add the crushed garlic and fry for 1 minute to soften.", "Add the passata into the saucepan, increase the heat and bring to boil. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the sauce over the meatballs and finish with grated cheese of your choice."]}, {"isVegetarian": false, "title": "Sweet-and-sour turkey with egg-fried rice", "url": "www_bbc_co_uk_food_recipes_sweet-and-sour_turkey_59017", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp dry sherry", "1 tbsp light soy sauce", "1 tbsp sesame oil", "pinch salt", "450g/1lb cooked leftover turkey, cut into 2cm/¾in cubes", "vegetable oil, for frying", "1 free-range egg, beaten", "2 tbsp cornflour, plus extra for dusting", "150ml/¼ pint chicken stock", "1 tbsp dark soy sauce", "1 tbsp sesame oil", "1 tbsp cider vinegar", "2 tbsp tomato ketchup", "2 green peppers, stalk and seeds removed, cut into 2cm/¾in pieces", "4 spring onions, trimmed, cut into 2cm/¾in lengths", "1 tbsp juice from a satsuma", "1 tbsp cornflour", "2 tbsp vegetable oil", "300g/10½oz cooked basmati rice, cooled to room temperature", "2 free-range eggs, beaten", "4 spring onions, trimmed, chopped", "4 tbsp soy sauce"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the turkey, in a bowl, mix together the sherry, soy sauce, sesame oil and salt until well combined. Add the cooked turkey to the marinade, stir well to coat, then cover the bowl and set aside to marinate for at least 20 minutes.", "Heat the deep-fat fryer to 180C. Alternatively, heat the oil in a deep-sided, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it (CAUTION: hot oil can be dangerous. Do not leave unattended.).", "Meanwhile, in a bowl, beat the egg with the cornflour to form a smooth batter and set aside. Sprinkle a little cornflour on a plate. ", "Remove the turkey from its marinade, shaking off any excess. Dust the marinated turkey with the cornflour, shaking off any excess.", "Dip the marinated turkey in the batter, then carefully lower into the hot oil, in batches if necessary, and fry for 2-3 minutes, or until the batter is crisp and golden-brown. Remove the turkey from the oil using and set aside to drain on kitchen paper. Keep warm.", "For the sauce, bring the stock, soy sauce, sesame oil, vinegar and ketchup to the boil in a non-reactive saucepan. Add the peppers and spring onions and simmer for 2-3 minutes, or until the vegetables have softened slightly but still retain their crunch.", "Mix the satsuma juice with the cornflour to form a smooth paste. Pour into the sauce and bring to the boil. Then reduce and simmer for 1-2 minutes, stirring well, until the sauce has thickened. ", "Meanwhile, for the egg fried rice, heat the oil in a wok over a high heat. Add the rice and stir-fry for 2-3 minutes. Add the egg, spring onions and soy sauce and stir-fry for a further 2-3 minutes.", "Just before serving, stir the turkey into the sweet-and-sour sauce. ", "To serve, spoon the egg-fried rice into serving bowls and top with the sweet-and-sour turkey. "]}, {"isVegetarian": false, "title": "Sweet and sharp sea bass", "url": "www_bbc_co_uk_food_recipes_sweet_and_sharp_sea_bass_02350", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sharp_sea_bass_02350_16x9.jpg", "ingredients": ["3 passion fruit ", "2 limes", "1 orange", "1 vanilla pod", "4 fillets sea bass", "1 red chilli", "1 yellow chilli", "small handful chives", "small handful coriander "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Squeeze the juice of the passion fruit, seeds and all, limes and orange into a bowl. Scrape in the seeds of one vanilla pod and mix well.", "Cut the sea bass into thin slivers and arrange neatly on a large plate. Pour over the juice, almost submerging the fish. Scatter over slices of red and yellow chillies and cover the plate with a piece of kitchen film. The sea bass is actually going to be 'cooked' by the acidity in the dressing so leave in the fridge for at least an hour or even overnight.", "When you are ready to serve, add some finely chopped chives and pick some coriander leaves over to top to finish."]}, {"isVegetarian": false, "title": "Sweet and sour chicken", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_00397", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_chicken_00397_16x9.jpg", "ingredients": ["½ small pineapple", "2 boneless, skinless chicken breasts", "2 tbsp sunflower oil", "1 onion, cut into wedges", "1 red pepper, deseeded and chopped", "1 green pepper, deseeded and chopped", "1 tbsp cornflour", "4 spring onions, trimmed and finely diagonally sliced", "1 tbsp cornflour", "300ml/10fl oz fresh pineapple juice", "2 garlic cloves, crushed", "25g/1oz piece fresh root ginger, peeled and finely grated", "1 tbsp dark soy sauce", "2 tbsp white wine vinegar", "2 tbsp soft light brown sugar", "3 tbsp tomato ketchup", "1 pinch dried chilli flakes", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sauce, put the cornflour in a small bowl and stir in two tablespoons of the pineapple juice until smooth. Put the remaining pineapple juice in a separate bowl and stir in the garlic, ginger, soy, vinegar, sugar, ketchup and chilli flakes until thoroughly combined. Set aside.", "Put the pineapple on a board and cut off the skin. Quarter lengthways and remove the tough central core. Cut the pineapple into thick slices and set aside. Cut each chicken breast into 7-9 even pieces (depending on size). ", "Heat the oil in a large non-stick frying pan or wok and stir-fry the onion and peppers for three minutes over a high heat. Coat the chicken in the cornflour and add to the pan. Stir-fry for four minutes until very lightly coloured on all sides.", "Add the pineapple and sweet and sour sauce to the pan with the chicken and bring to a simmer over a medium heat. Cook for 4-5 minutes, stirring regularly until the chicken is cooked through and the pineapple is hot. ", "Stir in the cornflour and pineapple solution mixture and cook for 30-60 seconds until the sauce is thickened and glossy, turning the chicken and vegetables until nicely coated. Sprinkle with sliced spring onions and serve hot."]}, {"isVegetarian": false, "title": "Sweet and sour chicken", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_52908", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_chicken_52908_16x9.jpg", "ingredients": ["1 x 425g/15oz can pineapple chunks in natural juice", "2 tbsp cornflour", "2 tbsp dark soy sauce", "2 tbsp white wine vinegar", "2 tbsp soft light brown sugar", "2 tbsp tomato ketchup", "½ tsp dried chilli flakes", "2 boneless, skinless chicken breasts", "2 tbsp sunflower oil", "1 medium onion, cut into 12 wedges", "2 peppers, red, green, orange or yellow, deseeded and cut into chunks of about 3cm/1¼in", "1 x 225g/8oz can water chestnuts", "2 garlic cloves, peeled and crushed", "25g/1oz piece fresh root ginger, peeled and finely grated", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the sauce, drain the pineapple in a sieve over a bowl and keep all the juice – you should have about 150ml/5fl oz. Put the cornflour in a large bowl and stir in three tablespoons of the pineapple juice to make a smooth paste. Add the remaining juice and 150ml/5fl oz water, then stir in the soy sauce, vinegar, sugar, ketchup and chilli flakes until thoroughly combined. Set aside.", "Cut each chicken breast into eight or nine even pieces. Heat a tablespoon of the oil in a large non-stick frying pan or wok and stir-fry the onion and peppers for two minutes over a high heat. Drain the water chestnuts and cut them in half horizontally.", "Add the remaining oil and the chicken to the pan and stir-fry for two minutes until coloured on all sides. Add the garlic, ginger, pineapple chunks and water chestnuts and stir-fry for 30–60 seconds.", "Give the cornflour and pineapple mixture a good stir and add it to the pan with the chicken and vegetables. Stir well, season with some ground black pepper and bring to a simmer. Cook for 4–6 minutes until the sauce is thickened and glossy and the chicken is tender and cooked throughout, turning the chicken and vegetables a few times. Serve with a small portion of rice."]}, {"isVegetarian": false, "title": "Sweet and sour chicken with egg-fried rice", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_chicken_54545", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz chicken breast, skin removed \t", "sunflower oil, for frying", "1 heaped tsp salt", "1½ tsp white ground pepper", "1–2 tbsp fresh ginger juice", "1–2 tbsp cider or rice wine vinegar", "2-3 tbsp cornflour", "2–3 tbsp potato starch", "2 free-range eggs, depending on the batter you might need more", "2 tbsp oil", "2-3 spring onions, sliced diagonally", "1-2 green peppers, cut into small squares", "1 small carrot, thinly sliced diagonally", "1 tbsp fiely chopped fresh root ginger", "½ cucumber, cored, halved and sliced diagonally                                                          ", "2 slices canned pineapple, cut into pieces", "400ml/14fl oz chicken stock", "3 tbsp cornflour", "2-3 tbsp caster sugar", "100ml/3½fl oz cider or rice vinegar", "2 tbsp tomato purée", "1–2 onions, cut into small squares", "1–2 firm tomatoes, pulp removed and flesh cut into small squares", "handful fresh coriander leaves (optional)", "salt and freshly ground black pepper", "2 tbsp oil", "400g/14oz cooked and cooled basmati rice", "3 free-range eggs, beaten", "2 tbsp light soy sauce", "4 spring onions, chopped"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["First prepare the chicken, shred it thinly into 3–4mm thick pieces and place in a bowl (this is easier if you semi-freeze the chicken breast first). Alternatively, cut the chicken into 1cm/½in cubes.", "Heat the oil in a large wok. Mix the rest of the chicken ingredients with the chicken until the chicken is well coated with batter. When oil is hot, fry the chicken on a very high heat in batches to prevent the pieces clumping together. This will only take a minute or so if using cubes of chicken, even less if using shredded. Place the cooked chicken on a plate lined with kitchen paper and set aside.", "To make the sauce, heat the oil in a saucepan. When hot, add the spring onions, peppers, carrot and ginger, keeping the heat high and stirring slowly. When the peppers start to brown, mix in the cucumber and pineapple, then add the stock.", "Mix the cornflour with a little water to make a paste. When the stock boils, add the sugar, vinegar, tomato purée, onions and tomatoes. Once the liquid comes to the boil, gently pour in the cornflour batter and stir continuously until the liquid thickens. Check the seasoning again and remove from the heat. Add the coriander leaves, if using.", "For the rice, heat a wok and once hot add the oil. Add the rice and cook for 1–2 minutes. Add the eggs and soy sauce and cook for a further 3–4 minutes or until the rice is piping hot. Finish with salt and pepper, but remember not too much salt as the soy sauce will season the dish.", "To serve, mix the chicken into the sauce. Pile rice into a small bowl and turn out onto each serving plate to make a neat mound of rice. Arrange the curry around the outside and serve immediately."]}, {"isVegetarian": false, "title": "Sweet and sour monkfish with deep-fried cabbage", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_monkfish_38590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp cornflour", "1 monkfish tail, flesh removed and cut into 2cm/1in chunks", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "125g/4½oz pineapple chunks, in juice (drained)", "125ml/4fl oz pineapple juice", "2 tbsp light soy sauce", "3 limes, juice only", "25ml/1fl oz Shaoxing rice wine", "1 red chilli, chopped", "2cm/1in piece fresh ginger, grated", "4 spring onions, chopped", "6 outer leaves Savoy cabbage", "½ tsp soft brown sugar", "½ tsp sea salt", "8 dried scallop roes, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet and sour monkfish, place the cornflour in a bowl, add the monkfish and season with salt and pepper.", "Heat a wok and add one tablespoon of oil. Once hot, add the monkfish and cook until crisp on all sides. Remove and place on kitchen paper.", "Place the pineapple chunks, juice, soy, lime juice and rice wine in a small food processor and blend until smooth.", "Add the rest of the oil to the wok with the ginger and nearly all the chilli and spring onions and cook for 1-2 minutes.", "Add the blended pineapple mixture to the wok and cook for two minutes.", "Add the monkfish back into the pan and stir.", "For the deep fried cabbage, heat a deep fat fryer to 160C/320F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Remove the stems from the cabbage leaves and finely shred the leaves.", "Fry the shredded cabbage in the deep fat fryer for a minute, remove with a slotted spoon and drain on kitchen paper. Season with the sugar and salt.", "To serve, place the sweet and sour monkfish in a shallow serving bowl and the deep fried cabbage on top. Shave the dried scallop roe on top of the cabbage with some spring onions and chilli."]}, {"isVegetarian": false, "title": "Sweet and sour pork", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_17770", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb pork fillet, cut into 2cm/¾in cubes", "1 tbsp dry sherry", "1 tbsp light soy sauce", "1 tbsp sesame oil", "pinch Chinese five-spice", "vegetable oil, for deep-frying", "1 egg, beaten", "4 tbsp cornflour", "150ml/5fl oz chicken stock", "1 tbsp dark soy sauce", "1 tbsp sesame seed oil", "1 tbsp cider vinegar", "2 tbsp tomato ketchup", "1 red pepper, cut into 2cm/¾in cubes", "1 green pepper, cut into 2cm/¾in cubes", "4 spring onions, cut into 2cm/¾in sticks", "1 tbsp cornflour", "1 tbsp orange juice", "salt and freshly ground pepper", "2 bok choi, stalks removed, leaves finely shredded", "1 tsp sugar", "1 tsp salt", "cooked basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the pork with the dry sherry, soy sauce, sesame oil, five-spice and pinch of salt. Leave to marinade in the fridge for 20 minutes.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan half full with vegetable oil. Heat to 180C (until a breadcrumb sizzles and goes brown when dropped into the oil.). (CAUTION: Hot oil can be dangerous. Don't leave unattended.)", "In a shallow dish, mix the egg with 2 tablespoons cornflour. Put the remaining cornflour in a separate dish. Dip the pork into the dry cornflour, shake off excess, then coat in the egg batter. ", "Carefully lower into the hot oil. Take care not to fry too many at once. When golden-brown remove and drain on kitchen paper.", "For the sauce, put the stock, soy sauce, sesame oil, vinegar and ketchup in a pan and bring to the boil. Add the peppers and spring onions, simmer for 2 minutes.", "Mix the cornflour with the orange juice and add to the pan to thicken the sauce. Bring to the boil then simmer until thickened.", "Add the pork, mix well for one minute.", "For the seaweed, deep-fry the shredded leaves for 1-2 minutes until bright green and crispy. Drain on a plate with kitchen roll and season with sugar and salt.", "To serve, place the sweet and sour pork in a shallow serving dish with the crispy seaweed on the top and the rice in a separate serving bowl."]}, {"isVegetarian": true, "title": "Sweet and sour slaw", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_slaw_07245", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_and_sour_slaw_07245_16x9.jpg", "ingredients": ["1 red cabbage (approx. 800g/1lb 12oz), halved", "4 fat or 6 skinny spring onions, trimmed", "2 red peppers, membranes and seeds removed", "1 yellow pepper, membranes and seeds removed", "1 orange pepper, membranes and seeds removed", "1 red chilli, seeds removed", "large bunch (approx. 100g/3½oz) fresh coriander", "250ml/9fl oz pineapple juice, from a carton", "2 limes, preferably unwaxed", "1½ tbsp sea salt flakes, or to taste", "2 tsp toasted sesame oil", "2 tsp maple syrup"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Shred the cabbage thinly and put into the largest bowl you have. It may be easier to use a huge saucepan as you need to toss all the ingredients together later, and even my largest mixing bowl isn’t big enough.", "Slice the spring onions into batons and then cut each baton into thin slices lengthways, so that you, again, have shreds. Add to the cabbage.", "Cut the peppers into very thin slices. Add to the cabbage and spring onions.", "Finely chop the red chilli, and do the same with the coriander – stalks and leaves. Add the chilli and all but a tablespoon of the chopped coriander to the cabbage bowl.", "In a bowl or measuring jug, mix together the pineapple juice, the zest and juice of 1 lime and the juice of half of the second. Sprinkle in the salt, add the sesame oil and maple syrup, and whisk together before pouring over the prepared vegetables. Toss to mix, then leave to stand for at least 15 minutes, and up to 2 hours, before serving. Sprinkle the reserved tablespoonful of chopped coriander over the finished slaw."]}, {"isVegetarian": false, "title": "Sweet and sour salmon with mussels and clams", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_salmon_49760", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fennel bulb, cut into quarters", "1 red pepper, cut into thick slices", "1 large carrot, peeled and cut into thick slices", "2 tbsp olive oil", "2 garlic cloves", "1 red chilli, slit lengthways", "6 black olives, pitted, in half", "1 tbsp capers", "1 tbsp sugar", "5 tbsp white wine vinegar", "4 x 200g/7oz salmon fillets, skin on, pin boned", "4 sprigs fresh thyme", "250g/9oz mussels, beards removed, washed under cold running water", "250g/9oz clams, washed under cold running water", "3 tbsp olive oil", "1 garlic clove, thinly sliced", "½ red chilli, chopped", "1 tbsp finely chopped fresh parsley", "150ml/5fl oz white wine", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the fennel, pepper and carrots in a large pan of boiling water for three minutes.  Remove, drain and set aside.  ", "In a frying pan, heat some olive oil and gently fry the garlic and chilli. Add the olives, capers and the blanched vegetables and fry for a further couple of minutes.  Add the sugar and vinegar and cook until slightly caramelised.  Remove from heat and set aside.  ", "Season the salmon fillet on the skin side, place a few thyme sprigs onto the skin and drizzle with a little olive.  In a hot non-stick frying pan, seal the salmon on each side for about 2-3 minutes leaving the middle slightly raw, or cooked to your liking.  ", "For the mussels and clams, discard any mussels or clams that have broken shells and discard any open ones that do not close when given a sharp tap. ", "Heat a large saucepan and add the oil. Once hot, add the garlic and chilli and cook until softened. ", "Add the mussels, clams, parsley and wine and season with salt and pepper. Place a lid on top and cook until the mussels and clams have opened up. Discard any that do not open. Drain the shellfish reserving the cooking liquid. Set the shellfish aside and keep warm.", "Bring the shellfish cooking liquid to a boil then simmer until reduced to a sauce consistency.", "To serve, arrange the vegetables on serving plates with the salmon on top skin-side up. Place the shellfish around and pour over the reduced cooking liquid. Finish with a drizzle of olive oil.  "]}, {"isVegetarian": false, "title": "Sweet and sour pork and pineapple with rice omelette", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_and_29670", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 600g/1lb 5oz pork fillet, cut into thin slices", "2 tbsp light soy sauce", "2 tbsp Shaoxing rice wine or dry sherry", "1 tbsp sesame oil", "1 tbsp cornflour", "1 tbsp groundnut oil", "3 large garlic cloves, roughly chopped", "225g/8oz fresh or tinned pineapple in juice, cut into chunks", "2 tsp caster sugar", "5 spring onions, trimmed, finely chopped", "1 tbsp dark soy sauce", "2 tbsp chopped fresh coriander leaves", "3 free-range eggs, lightly beaten", "2 tsp sesame oil", "1 tsp groundnut or vegetable oil", "200g/7oz cooked long-grain rice, chilled (preferably overnight)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork, put the pork into a bowl and add the light soy sauce, rice wine or sherry, sesame oil and cornflour. Mix well to cover the pork in the marinade, then set aside.", "Heat the oil in a wok over a high heat. When the oil starts to smoke, add the garlic and stir-fry for 10 seconds, or until golden brown but not burned. Add the marinated pork, reserving the marinade in the bowl, and continue to stir-fry for 2-3 minutes.", "Add the pineapple, sugar, reserved marinade, three-quarters of the spring onions, and the dark soy sauce and continue to stir-fry for a further 2-3 minutes. Add the coriander, stir well and remove the wok from the heat. ", "Meanwhile, for the rice omelette, whisk together the eggs and sesame oil in a bowl.", "Heat the oil in a separate wok or large frying pan over a high heat. When the pan is hot, pour away the oil so that only a light coating remains in the wok.", "Pour the egg mixture into the pan and swirl the pan so that the mixture forms a thin omelette. When the eggs have just set, sprinkle the cooked rice over the omelette and cook for one minute. Carefully fold the edges of the omelette over the rice to cover, then transfer the omelette to a warm plate and cover with a clean tea towel to allow the rice to finish heating through.", "To serve, slice the omelette, divide the slices equally among four serving plates, then spoon the pork alongside. Garnish with the remaining spring onions."]}, {"isVegetarian": false, "title": "Sweet and sour pork with egg fried rice", "url": "www_bbc_co_uk_food_recipes_sweet_and_sour_pork_with_10851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz pork tenderloin fillet, cut into thin strips", "2 tbsp vegetable oil", "1 tsp salt", "8 tbsp rice flour or potato flour, or cornflour", "150g/5½oz caster sugar", "150ml/5fl oz rice wine", "75ml/3fl oz grapefruit juice", "4 tbsp soy sauce", "2 red chillies, finely diced", "2 tsp chilli flakes", "10cm/4in piece fresh root ginger, finely grated", "1 tbsp vegetable oil", "1 red onion, finely sliced", "1 red pepper, cut into triangles", "1 green pepper, cut into triangles", "½ small pineapple, cut into small pieces", "2 garlic cloves, finely sliced", "2 tbsp groundnut oil", "200g/7oz basmati rice, cooked and cooled", "2 free-range eggs, lightly beaten", "2 tsp sesame oil", "4 spring onions, finely sliced", "3 tbsp chopped coriander leaves", "¼ head spring cabbage, finely shredded", "½ tsp salt", "½ tsp soft brown sugar", "2 tsp dried scallop, grated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the pork, heat a deep fat fryer to 190C/375F, or alternatively heat vegetable oil in a deep-sided, heavy based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Toss the pork strips with the vegetable oil.", "Place the salt and rice/potato flour into a bowl, add the pork and toss to coat each piece thoroughly. ", "Lower the pork pieces carefully into the fat fryer a few at a time, and cook, in batches, for 2 minutes. Remove the pork pieces from the hot oil, and drain onto kitchen paper.", "For the sauce, heat a frying pan until hot, add the sugar and heat til it becomes a caramel, then carefully add the rice wine, grapefruit juice and soy sauce and bring to the boil. Add the chopped chillies, chilli flakes and ginger and cook for a few minutes until the sauce thickens a little.", "Heat a wok until hot, add the vegetable oil, onion, peppers and pineapple and stir fry for 3-4 minutes until just tender. Add the garlic and cooked pork to the sauce and cook for 1-2 minutes, tossing the pork so it gets a good covering of the sauce.", "For the egg fried rice, heat a wok until hot, add the oil and rice and stir fry for 2-3 minutes until hot through. Mix the eggs and sesame oil in a bowl with a fork. Add the eggs to the rice and continue to stir-fry for 2-3 minutes or until the eggs have set and the mixture is dry.", "Place the cabbage in the deep fat fryer for 2 minutes, drain and sprinkle with the salt and sugar and toss.", "Pile the fried rice onto a plate and spoon the pork alongside, spooning extra sauce over the top. Serve the crispy cabbage on top of the pork, with the grated scallop."]}, {"isVegetarian": true, "title": "Sweet banana and maple pancakes with blueberries and pecans", "url": "www_bbc_co_uk_food_recipes_sweet_banana_and_maple_14272", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_banana_and_maple_14272_16x9.jpg", "ingredients": ["65g/2¼oz rice flour", "65g/2¼oz tapioca flour", "½ very ripe banana", "300ml/10½fl oz almond milk", "rapeseed oil or coconut oil", "1½ bananas, sliced", "large handful blueberries", "30g/1oz pecans, toasted", "maple syrup "], "serves": "Makes 6 pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flours, banana and almond milk in a food processor and blitz until you have a smooth batter approximately the consistency of single cream.  Pour the mixture into a jug.", "Heat a 20-25cm/8-10in non-stick frying pan until hot and brush with a little oil.  Pour in a little of the batter and swirl it around the pan to make a full sized pancake.  Cook for 1-2 minutes, or until golden at the edges. Loosen and flip over with a spatula. Cook until golden on both sides. Repeat with the remaining batter.  You can keep the cooked pancakes warm by wrapping in foil and placing in a low temperature oven. ", "Put the pancakes on plates and top with the bananas, blueberries, pecans and maple syrup.  Serve immediately."]}, {"isVegetarian": true, "title": "Sweet chestnut and chocolate charlotte", "url": "www_bbc_co_uk_food_recipes_sweet_chestnut_and_60895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz caster sugar", "300ml/10½fl oz  water", "75g/3oz dried sour cherries  ", "75g/3oz dried cranberries", "390ml/13½fl oz orange liqueur", "300ml/10½fl oz stock syrup (see above)", "200g/7oz sponge fingers (also known as boudoir biscuits or ladies’ fingers)", "150g/5oz plain chocolate, minimum 70% cocoa solids", "175g/6oz unsalted butter", "175g/6oz caster sugar", "250g/9oz vanilla-flavoured chestnut purée (available from delicatessens)", "150g/5oz ground almonds", "300ml/10½fl oz double cream", "350g/12oz caster sugar", "3 tbsp water "], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the stock syrup, mix the sugar and water together in a small pan, then bring the mixture slowly to the boil until the sugar dissolves. Reduce the heat until the mixture is simmering and simmer for 4-5 minutes. Remove from heat and set aside to cool, then chill in the fridge overnight. ", "For the charlotte, place the dried sour cherries and the dried cranberries in a small bowl, pour over six tablespoons of the orange liqueur, cover the bowl with cling film and leave the fruit to soak for 12 hours, or at least overnight.", "When the fruit has soaked, grease and line a deep 22cm/9in loose-bottomed cake tin (or charlotte mould) with greaseproof paper.", "Pour the remaining orange liqueur and the stock syrup into a wide, shallow bowl.", "Dip the non-sugared sides of the sponge fingers into the syrup mixture one at a time and stand them up vertically next to each other to line the sides of the cake tin. Don’t leave them to soak for too long as they will fall apart.", "Bring a small amount of water to a gentle simmer in a saucepan. Suspend a heatproof bowl over the pan (do not allow the base of the bowl to touch the surface of the water). Add the chocolate to the bowl and stir until melted. Set aside.", "Using a hand-held electric whisk, cream the butter and sugar together in a bowl until pale and fluffy.", "Fold the chestnut purée into the creamed butter and sugar mixture until just combined, using a metal spoon. Pour in the melted chocolate, then add the soaked fruit and ground almonds. Mix until well combined.", "Pour the cream into a separate bowl and whisk until it is thick enough to leave a trail behind when the whisk is removed. Fold the whipped cream into the chocolate and fruit mixture until it gives a marbled effect. ", "Spoon the mixture into the cake tin, then cover the tin with cling film and chill in the fridge overnight.  ", "For the spun sugar, tip the sugar into a heavy-based saucepan. Add the water and stir until the sugar has dissolved. Gradually bring the mixture to a simmer over a gentle heat.", "Using a sugar thermometer, heat the mixture to a temperature of 155C/311F (this is known as the hard crack stage). Do not be tempted to stir the sugar mixture as this will cause the syrup to crystallise. (Caution: hot sugar syrup can burn. Do not leave unattended and do not taste or touch the syrup.)", "Fill an empty sink with cold water. As soon as the sugar mixture reaches the desired temperature, plunge the base of the pan into the water to stop the cooking process.", "Now work quickly: place the saucepan onto a heatproof surface. Turn two forks back to back and hold them in one hand. Hold a rolling pin in the other. Dip the forks into the sugar syrup and flick the caramel over the rolling pin to create long strands of sugar. Using your hands, gather the strands up into a large ball and mould together to form shapes. Continue to create sugar shapes until all of the sugar syrup has been used.", "When ready to serve the sweet chestnut and chocolate charlotte, turn the charlotte out onto a serving plate or cake stand. Garnish with the spun sugar shapes.  "]}, {"isVegetarian": true, "title": "Sweet chilli sauce", "url": "www_bbc_co_uk_food_recipes_sweet_chilli_sauce_65562", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4-6 skinned peppers", "100g/3½oz chillies", "1 tomato, seeds removed, chopped", "5 garlic cloves", "small knob fresh root ginger", "450g/1lb sugar", "350ml/12fl oz white wine vinegar", "2 tsp salt", "pinch black pepper", "1 tbsp balsamic vinegar"], "serves": "Makes 2 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the peppers, chilli, tomato, garlic and ginger in a blender or food processor. ", "Add the remaining ingredients to a saucepan and tip in the chilli mixture. Bring to a rolling boil and cook until the sauce thickens – about 15-20 minutes.", "Pour into sterilised jars."]}, {"isVegetarian": true, "title": "Sweet meringue", "url": "www_bbc_co_uk_food_recipes_sweet_meringue_89253", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_meringue_89253_16x9.jpg", "ingredients": ["2 tsp fresh lime", "2 tsp falernum", "25ml/1fl oz coconut water", "75ml/3fl oz dark rum", "1 tbsp apricot liqueur ", "slice fresh mango", "fresh mint sprig"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a cocktail shaker with a handful of ice and shake hard. ", "Strain the cocktail into a tumbler filled with ice and garnish with a slice of mango and a mint sprig."]}, {"isVegetarian": true, "title": "Sweet milk pudding with vermicelli (payasam)", "url": "www_bbc_co_uk_food_recipes_sweet_milk_pudding_with_68274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pint full-fat milk", "1 tsp ghee or butter", "50g/1¾oz vermicelli, broken into rough 4cm/1½in pieces", "4 tbsp sugar", "¼ tsp ground cardamom (or seeds from 8 pods)", "1 tbsp ghee or butter", "25g/1oz cashew nuts", "25g/1oz pistachio nuts", "25g/1oz sultanas"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Pour the milk into a large, deep-sided pan or karahi and place over a medium-high heat until it comes to the boil, then reduce the heat slightly and simmer for about 20 minutes until reduced in volume by a third.", "Meanwhile, heat the ghee (or butter) in a pan over a medium heat, add the vermicelli and fry for 1–2 minutes, or until lightly toasted but not browned.", "Once the milk has reduced, add the toasted vermicelli to the milk and simmer for a further 20 minutes, or until the vermicelli is soft and the milk reduced further.", "Stir in the sugar and cardamom, leave to cool slightly then pour into a serving dish, individual bowls or glasses.", "To decorate, heat the ghee (or butter) in a pan over a medium heat, add the cashew nuts and pistachio nuts and fry for 2-3 minutes, or until golden-brown, then stir in the sultanas. Spoon this decoration over the payasam, leave to cool, then transfer to the fridge to chill – overnight is best. Serve in small portions."]}, {"isVegetarian": false, "title": "Sweet onions with lentil stew", "url": "www_bbc_co_uk_food_recipes_sweet_onions_with_lentil_01078", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_onions_with_lentil_01078_16x9.jpg", "ingredients": ["a good handful, chopped unsmoked bacon or pancetta", "4 medium sized onions", "3 small carrots ", "½ tsp mild paprika", "½ tsp ground cinnamon", "½ nutmeg, for grating", "300g/10oz Puy lentils", "500ml/1pint stock", "a handful parsley", "knob of butter", "100g/4oz crème fraîche"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the bacon or pancetta in a deep pan over a moderate heat to let the fat slowly ooze out . Roughly chop two of the onions and add them to the pan. Cut the carrots into chunks and add to the pan. Cover and let it steam for a few minutes.  Add the paprika, cinnamon, then grate in ½ of the nutmeg. Add the lentils, stock and 500ml water, cover and leave for 30 minutes until the lentils have softened.", "While that is slowly cooking, slice the remaining two onions and, in another pan, cook them very slowly in butter until golden brown. Finish with a grate of nutmeg.", "The last thing to add to the lentils is a handful of chopped parsley. Serve with a dollop of crème fraiche and pile the caramelised onions on top."]}, {"isVegetarian": true, "title": "Sweet pepper frittata", "url": "www_bbc_co_uk_food_recipes_sweet_pepper_omelette_36973", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_pepper_omelette_36973_16x9.jpg", "ingredients": ["90ml/6 tbsp olive oil", "900g/2lb red and yellow peppers, cut into strips ", "3 garlic cloves, sliced", "2 tbsp white wine vinegar", "12 free-range eggs", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 5 tablespoons of the oil in a 25cm/10in frying pan and fry the pepper strips, stirring from time to time, until the edges of the strips are caramelised, this should take about 10 minutes. ", "Add the garlic and fry gently until it is cooked but not burnt. Add the vinegar, and cook until evaporated. Remove from the heat and set aside, leaving the peppers in the pan. ", "Beat the eggs in a bowl and season with salt and pepper. ", "Return the frying pan to the heat, add the remaining oil and pour in the egg mixture. Cook, stirring a little with a spatula, until there is a crust on the underside, this should take about five minutes. ", "Cover the pan with large plate or the lid of a large saucepan, and quickly turn it upside down to invert the omelette. Slide it back into the frying pan, crust-side up. Cook for a further 5 minutes, until the other side has browned. Cut into wedges and serve hot or cold with salad. "]}, {"isVegetarian": true, "title": "Sweet pierogi", "url": "www_bbc_co_uk_food_recipes_sweet_pierogi_22987", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_pierogi_22987_16x9.jpg", "ingredients": ["handful of large mint leaves, picked from their stems", "1 free-range egg white", "100g/3½oz caster sugar", "250g/7oz plain flour", "15g/½oz icing sugar", "pinch salt", "1 lemon, zest only", "1 free-range egg", "2 tbsp sour cream", "knob of butter", "200g/9oz fresh blueberries", "2 tbsp caster sugar, plus a little extra for cooking", "100ml/3½fl oz sour cream or crème fraiche", "1 tbsp icing sugar, plus more for sprinkling"], "serves": "Makes approx 20", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crystallised mint leaves, lightly beat the egg white. Sprinkle half the sugar over a lined baking tray. Dip the mint leaves in the egg white and place on the sugar. Sprinkle over the remaining sugar. Pick each mint leaf up from its tip and shake off any excess sugar. Put on a wire rack and leave to dry out for several hours, preferably overnight. Store in an airtight container to keep fresh. ", "To make the dough, sieve the flour and icing sugar into a large mixing bowl. Add a pinch of salt and the lemon zest.  Make a well in the middle. Lightly whisk the egg with the sour cream and two tablespoons water. Pour into the well.", "Using a fork, start working the flour into the wet ingredients, until you have a rough, floury dough. Turn the whole lot out on to a work surface and knead until the dough is smooth. It should not be sticky – if it is, add a little more flour.  Cover the dough with clingfilm and leave for 1 hour.", "When you are ready to make the pierogi, roll out the dough to a thickness of between 1-2mm. Cut out rounds of 8cm/3½in diameter, bring the offcuts of the dough together to make the remaining circles. ", "Toss the blueberries in the sugar just before you need to use them – you don’t want them to start to macerate and give out juices. Put 4-5 blueberries on each pastry round in a line, then bring the edges together to form a crescent shape. Crimp or pleat together with your fingers or use a fork to seal.", "Bring a large pot of water to the boil. Cook the pierogi a few at a time, they are ready when they float to the top, this should take about 2-3 minutes.", "Melt the knob of butter in a large frying pan and add one teaspoon caster sugar and a pinch of cinnamon. Once melted, add the pierogi, in batches, and fry for a couple of minutes on each side until starting to crisp up and brown.", "Sweeten the sour cream by whisking in the icing sugar. ", "Serve the dumplings with the sweetened sour cream, crystallised mint leaves and a sprinkling of icing sugar. "]}, {"isVegetarian": true, "title": "Sweet potato and chickpea curry", "url": "www_bbc_co_uk_food_recipes_sweet_potato_and_68565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_and_68565_16x9.jpg", "ingredients": ["1 tbsp oil ", "1 tbsp cumin seeds ", "1 onion, finely sliced", "salt and black pepper", "2 garlic cloves, crushed ", "½-1 tsp chilli flakes (to taste) ", "50g/1¾oz root ginger, peeled and grated ", "600g/1lb 5oz tinned chickpeas (undrained weight) ", "1 x 400g/14oz tin tomatoes ", "750g/1lb 10oz sweet potato, peeled and cut into bite-sized cubes ", "200g/7oz rice "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a medium heat and add the oil. Once hot, add the cumin seeds and fry for a minute, or until aromatic. Add the onion and a pinch of salt and cook for 5-6 minutes, or until the onion is soft and translucent. Add the garlic, chilli flakes and ginger and fry for a further three minutes.", "Drain and rinse the chickpeas.  Add to the pan with the tomatoes and sweet potato. Add enough water (approximately 500ml/18fl oz) to cover the chickpeas and sweet potatoes and bring to a simmer, stirring to mix everything together. ", "Cover with a lid and simmer over a medium low heat, stirring now and again, for 25-30 minutes, or until the potatoes are soft and beginning to break apart and the sauce has thickened.  Top up with a little more water during the cooking if needed. ", "Meanwhile, cook the rice according to the packet instructions. ", "Taste the curry and season to taste with salt and pepper. Serve immediately with the rice."]}, {"isVegetarian": true, "title": "Sweet potato and black bean burritos", "url": "www_bbc_co_uk_food_recipes_sweet_potato_and_black_27156", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_and_black_27156_16x9.jpg", "ingredients": ["700g/1lb 9oz sweet potatoes (3 medium) ", "2 x 400g/14oz tins black beans, rinsed and drained ", "50g/1¾oz walnuts, toasted ", "2 tsp hot smoked paprika ", "1 tsp dried Italian herb mix ", "1 tsp garlic powder ", "1 tsp onion powder ", "sea salt and freshly ground black pepper ", "2 tsp chipotle paste ", "100g/3½oz 0% fat Greek-style yoghurt, or similar dairy-free alternative", "4 large corn (or wheat) tortillas ", "100g/3½oz iceberg lettuce, shredded ", "200g/7oz carrots, peeled and grated ", "200g/7oz raw beetroot, peeled and grated ", "1 ripe, small avocado, peeled and quartered"], "serves": "4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Prick the sweet potatoes all over with a fork and put on a small baking tray. Bake for 50–60 minutes, or until soft all the way through. Remove from the oven and allow to cool. Turn off the oven. Scoop out the flesh from the sweet potatoes into a large bowl. ", "Put half of the black beans into a food processor with the walnuts and blend until smooth. Add to the sweet potato flesh, with the remaining black beans, paprika, dried herb mix, garlic powder and onion powder. Season with salt and pepper and mix well. ", "Line a baking tray with baking parchment. Divide the mixture into four portions and shape into logs, about 15 x 7 x 2cm/6 x 2¾ x ¾in on the lined tray. Flatten them slightly and chill in the fridge to firm up for 2 hours. ", "Heat the oven again to 200C/180C Fan/Gas 6. Cook the sweet potato patties on the middle shelf of the oven for 50 minutes. ", "Meanwhile, mix the chipotle paste and yoghurt together in a bowl. When the patties are cooked, place the tortillas in the oven for one minute until warm, but still pliable. ", "Spread each tortilla with a big spoonful of the chipotle yoghurt and place a sweet potato patty in the middle. Top with lettuce, carrot and beetroot. Slice an avocado quarter in half and lay both pieces on top, then roll the tortilla around the filling tightly. Slice in half and serve."]}, {"isVegetarian": true, "title": "Sweet potato fritters", "url": "www_bbc_co_uk_food_recipes_sweet_potato_fritters_13212", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 small onion, finely chopped", "2 garlic cloves, finely chopped", "50g/1¾oz plain flour", "1 tsp baking powder", "1 tsp Cajun seasoning", "1 lemon, zest only", "salt and freshly ground black pepper", "1 free-range egg", "2 tbsp single cream", "250g/9oz sweet potato, peeled and coarsely grated", "small bunch parsley (optional)", "oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan. Add the onion and cook until soft, translucent and starting to caramelise. Add the garlic and continue to cook for 2-3 minutes. Remove from the heat and leave to cool down. ", "Put the flour into a bowl and add the baking powder, Cajun seasoning, lemon zest and plenty of salt and pepper. Mix thoroughly. Break in the egg and mix until you have a thick, roux-like paste, then stir in the cream to loosen the batter. Add the onion, garlic, sweet potato and parsley if using.", "Use a scant amount of olive oil to coat the base of a large frying pan. Put heaped tablespoons of the batter onto the frying pan, smoothing out into flat rounds as you go. Cook for 3-4 minutes on each side until crisp and brown. ", "Remove from the pan and continue until you have used up all the batter. Drain onto kitchen towel and keep warm before serving."]}, {"isVegetarian": true, "title": "Sweet potato pancakes with chilli beans", "url": "www_bbc_co_uk_food_recipes_sweet_potato_pancake_71977", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_potato_pancake_71977_16x9.jpg", "ingredients": ["1 large sweet potato", "2 tsp vegetable oil", "1 medium onion, chopped", "400g/14oz tin of kidney beans, drained", "1 tsp chilli powder", "1 tsp cumin (optional)", "½ tsp chilli flakes (optional)", "400g/14oz tin of chopped tomatoes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the sweet potato and squeeze it dry in some kitchen roll.", " Put 2 teaspoons of oil in a frying pan over a medium heat, add a handful of the sweet potato to the hot oil, press it down with a spatula and fry over a medium heat for 4-5 minutes. Flip the pancake over and fry on the other side until it is dark brown and cooked through. Repeat this process to make 3 more pancakes. ", "Meanwhile, heat a little oil in a frying pan and fry the onion for 5 minutes, or until softened. Add the kidney beans, chilli powder, cumin, chilli flakes and chopped tomatoes. Season with salt and pepper. Cook until the sauce has thickened – this should take about 5-10 minutes.", "Divide the pancakes between 4 plates, top with the chilli and serve. "]}, {"isVegetarian": true, "title": "Sweet pumpkin pastries", "url": "www_bbc_co_uk_food_recipes_sweet_pumpkin_pastries_93247", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lbs 2oz pumpkin, peeled, roughly chopped", "about 500g/1lb caster sugar", "1x 300g/10½oz pack filo pastry", "vegetable oil, for frying", "50g/2oz icing sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Bake the pumpkin pieces for 30 minutes, or until tender.", "Weigh the cooked pumpkin and measure two-thirds of its weight in sugar (e.g. if the pumpkin weighs 750g/1lb 10oz, use 500g/1lb sugar). Place the pumpkin into a food processor and blend until smooth.", "Transfer the pumpkin into a saucepan with the sugar and cook over a low heat, stirring occasionally, for 30 minutes. Set aside to cool.", "Lay out two filo sheets on a lightly floured surface. Cut the sheets into rectangular pieces measuring 7.5cm x 15cm/6in x 3in.", "Place a spoonful of pumpkin purée at one end of the pastry sheet. Fold one corner of the pastry over the mixture so that it forms a triangle, then fold the remaining pastry over the top to continue the triangle pattern. Repeat until all of the pastry has been folded and you have a triangle-shaped pastry. Brush the end of the pastry with water and seal. Repeat with the remaining filling and pastry.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended).", "Carefully place the pastries into the hot oil and cook for 2-3 minutes or until just cooked through. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper.", "Dust with icing sugar and serve warm."]}, {"isVegetarian": true, "title": "Sweet ravioli with chocolate ganache and passion fruit sauce", "url": "www_bbc_co_uk_food_recipes_sweet_ravioli_with_11477", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz double cream", "half an orange, zest only", "2 tbsp orange liqueur", "15ml/1 tbsp glucose", "45g/1½oz butter", "185g/6½oz dark chocolate (53-55% cocoa solids)", "2 large oranges, juice only", "2 tsp arrowroot", "3 large passion fruit, seeds and pulp only", "100ml/3½fl oz orange liqueur", "50g/1¾oz sugar (optional)", "300g/10½oz ‘00’ flour ", "50g/1¾oz butter", "50g/1¾oz caster sugar", "1 orange, zest only", "1 tsp vanilla extract", "60ml/4 tbsp milk ", "vegetable oil, for deep frying", "caster sugar, for dusting", "cocoa, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the ganache, put the cream, orange zest, orange liqueur and glucose in a medium saucepan and heat until nearly boiling. Remove from the heat and stir in the butter.", "Melt the chocolate in a heatproof bowl set over a pan of gently simmering water. When melted, add to the cream mixture and stir until smooth. Pour the ganache into a small bowl and leave to set for at least two hours, preferably overnight.", "To make the passion fruit sauce, mix three tablespoons of orange juice with the arrowroot. Mix remaining ingredients in a pan and heat until simmering. Add the arrowroot and juice mix and stir until thick and glossy. Leave to cool until ready to serve.", "To make the ravioli, put the flour, butter, sugar, orange zest and vanilla extract into a food processor and blend until it forms a crumb. Gradually add the milk to form a ball. Remove from the food processor and, using your hands, bring together to form a dough. Knead briefly, wrap in cling film and set aside to rest.", "Divide the dough into four equal pieces. Either using a rolling pin or pasta machine, gradually roll each piece until you have four thin sheets of pasta (you might need to add extra flour to the machine to stop it sticking).", "Using a large circular pastry cutter, cut circles from the pasta sheets. Put a generous spoonful of ganache into the centre of each circle. Brush the edges with a little water (to seal) and fold over to create a neat semi-circular pocket. Using a fork, crimp the edges.", "Place on a floured baking tray.", "Once all the ravioli are made, pour a few inches of vegetable oil into a large pan set over a medium heat (take care – hot oil is dangerous. Do not leave unattended). Gently lower the ravioli into the hot oil and fry until golden on both sides (you may need to do this in batches). Use a slotted spoon to remove the ravioli then drain on a plate lined with absorbent kitchen paper.", "Serve the ravioli warm, dusted with icing sugar and cocoa powder and drizzled with the passion fruit sauce."]}, {"isVegetarian": true, "title": "Sweet scones with coconut cream and pink peppercorn pineapple jam", "url": "www_bbc_co_uk_food_recipes_sweet_scones_with_89116", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_scones_with_89116_16x9.jpg", "ingredients": ["280g/10oz tinned crushed pineapple, drained", "280g/10oz jam sugar", "9 dried kaffir lime leaves, crushed", "2 tsp pink peppercorns, crushed", "350g/12oz self-raising flour, plus extra for dusting", "3 tbsp caster sugar", "½ tsp baking powder", "½ tsp salt", "85g/3oz unsalted butter, chilled and cubed", "185ml/6fl oz whole milk, plus extra for glazing", "400g tin coconut milk, refrigerated", "1 tsp vanilla bean paste", "1 tbsp icing sugar"], "serves": "Makes 9", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a baking tray with baking paper.", "To make the jam, put all the ingredients in a large saucepan over a high heat. Bring to the boil, then reduce to a simmer for 15–20 minutes, until it reaches 105C – you can test it with a sugar thermometer or place a plate in the freezer in advance. Place a drop of the jam on the cold plate and leave for a few seconds, then push it with your finger and if it wrinkles the jam is ready. Transfer to a bowl to cool completely.", "To make the scones, put the flour, sugar, baking powder and salt into a large bowl and mix. Rub in the butter using your fingertips until the mixture resembles breadcrumbs. Make a well in the centre and add the milk. Mix with a palette knife, then gently bring the dough together using your hands.", "Turn the dough out on to a lightly dusted surface and roll out to a 15cm/6in square. Then cut into 5cm/2in squares. Place on lined the baking tray, brush the tops with milk and bake on the middle shelf for 12–15 minutes. Leave to cool completely on a wire rack.", "For the coconut cream, scoop out the solidified cream on top of the tin and place in a bowl, discarding the liquid underneath. Whisk the vanilla bean paste and icing sugar into the cream.", "Split the scones and enjoy with cream and jam, or jam and cream, in whichever order you prefer."]}, {"isVegetarian": true, "title": "Sweet red pepper and tomato soup", "url": "www_bbc_co_uk_food_recipes_sweet_red_pepper_and_25318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweet_red_pepper_and_25318_16x9.jpg", "ingredients": ["2 red peppers", "2 banana shallots, peeled, halved and trimmed", "500g/1lb 2oz plum tomatoes", "4 garlic cloves, unpeeled", "2 tbsp olive oil", "25g/1oz butter", "450ml/16fl oz chicken or vegetable stock, hot", "700ml/1¼ pint double cream", "100g/3½oz jarred roasted red peppers, chopped", "2 tbsp chopped fresh chives", "1 ciabatta loaf, cut into slices"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet red pepper and tomato soup, preheat the oven to 200C/400F/Gas 6.", "Place the peppers over an open gas flame until black all over. Place in a bowl, cover with cling film and leave to stand for 1-2 minutes.", "Remove the peppers from the bowl and peel off the black skin, rinse underneath a running tap to get the remainder of the skin off. Remove the seeds and set the pepper aside.", "Place the shallot halves (cut-side down) along with the plum tomatoes and garlic cloves onto a baking tray and drizzle with the olive oil. Bake at the top of your oven for 30 minutes or until the shallots are cooked", "Melt the butter in a large pan over a medium heat and add the roasted shallots, peppers and garlic.", "Add the hot stock and cook for five minutes.", "Blend with a stick blender until smooth and place back in the pan to warm through.", "For the sweet red pepper and chive butter, place the double cream in a food processor and whisk until the liquid buttermilk separates from the fat and a butter has formed.", "Remove the butter solids and place on a large piece of clean muslin. Rinse the butter under cold running water to remove any residual buttermilk. Hang the muslin over a bowl to catch any more liquid and leave for an hour.", "Once hung for one hour, remove from the muslin and mix in the peppers and chives.", "Form into a long log shape and roll in cling film.", "Heat a large griddle pan and drizzle a little olive oil over the cut ciabatta, and toast either side for 1-2 minutes or until bar marks appear.", "To serve, ladle the soup into serving bowls and serve the toasted ciabatta topped with the pepper and chive butter on the top.", "The soup can be served hot or cold."]}, {"isVegetarian": true, "title": "Sweet and sour cabbage soup with heather honey", "url": "www_bbc_co_uk_food_recipes_sweetandsourcabbages_84728", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small potato, peeled, chopped", "250ml/9fl oz hot vegetable stock", "½ green cabbage, shredded", "1 glass white wine", "½ tsp cumin seeds", "white wine vinegar", "1 tsp heather honey"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chopped potato and the vegetable stock into a large saucepan, bring to the boil and simmer for 3-5 minutes. ", "Add the cabbage and white wine to the pan and cook for a further 3-5 minutes, then add the cumin seeds and white wine vinegar and cook for another 6-7 minutes, or until the cabbage is tender but still retains some bite.", "To serve, pour the soup into a serving bowl and drizzle with the heather honey."]}, {"isVegetarian": false, "title": "Sweet and sour chicken balls", "url": "www_bbc_co_uk_food_recipes_sweetandsourchickenb_88893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz minced chicken", "4 spring onions, finely chopped ", "1 tbsp Chinese five-spice powder", "salt and freshly ground black pepper", "1 garlic clove, crushed to a paste with a little salt", "1 red chilli, finely chopped ", "1 tbsp light soy sauce", "cornflour, for dusting", "vegetable oil, for frying", "2 tbsp cornflour", "100ml/3½fl oz water", "60g/2oz soft light brown sugar", "50ml/2fl oz light soy sauce", "75ml/2½fl oz rice wine vinegar", "50ml/2fl oz tomato ketchup", "2 red peppers, finely sliced", "250g/9oz canned pineapple chunks, drained", "small bunch spring onions, sliced at an angle", "plain white rice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken balls, place the chicken, spring onions, Chinese five-spice powder, crushed garlic, red chilli and soy sauce into a bowl and mix to completely combine.", "Mould the mince mixture into golf ball-sized balls, then dredge in cornflour.", "Heat the vegetable oil in a deep-sided non-stick frying pan over a medium heat. Add the chicken balls and fry for 8-10 minutes, turning regularly, until golden-brown all over and completely cooked through. Remove from the pan and drain on kitchen paper.", "For the sauce, place the cornflour, water, sugar, soy sauce, vinegar and ketchup into a pan over a medium heat and mix well. Cook, stirring constantly, for 5-6 minutes, then add the peppers, pineapple chunks and spring onion and stir well.", "To serve, place a large spoonful of cooked white rice onto each plate and place 3-4 chicken balls on top. Pour the sauce over and serve."]}, {"isVegetarian": false, "title": "Sweet and sour chicken thighs", "url": "www_bbc_co_uk_food_recipes_sweetandsourchickent_88264", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 chicken thighs", "salt and freshly ground black pepper", "½ onion, chopped", "55g/2oz sun-dried tomatoes in oil, drained", "2 tbsp soy sauce", "1 tbsp white wine vinegar", "1 tbsp clear honey", "small handful fresh parsley, chopped", "2 sprigs fresh rosemary, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the chicken thighs and season well with salt and freshly ground black pepper. Fry over a low-medium heat until golden-brown on all sides.", "Add the onion and fry until softened. Add the sun-dried tomatoes, soy sauce, white wine vinegar and honey and simmer for 2-3 minutes, or until the chicken is completely cooked through - you can test this by piercing the thickest part with a skewer and checking that the juices run clear.", "Stir in the chopped parsley and then spoon onto a serving plate. Garnish with rosemary sprigs and serve."]}, {"isVegetarian": false, "title": "Sweet and sour lamb stir fry", "url": "www_bbc_co_uk_food_recipes_sweetandsourlambstir_85827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, sliced", "1 garlic clove, chopped", "150g/5½oz lamb chump chop, trimmed of fat, sliced ", "½ tsp chilli flakes", "1 tsp sesame oil", "1 tsp soy sauce", "1 tbsp tomato ketchup", "1 tbsp sesame seeds", "1 tbsp clear honey", "salt and freshly ground black pepper", "1 tbsp chopped fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat and fry the onion and garlic for 2-3 minutes, until softened.", "Add the lamb slices and stir-fry for 1-2 minutes.", "Add the chilli flakes, sesame oil, soy sauce, tomato ketchup, sesame seeds and honey. Stir-fry until the lamb is completely cooked through, then season, to taste, with salt and freshly ground black pepper.", "To serve, place the stir fry onto a plate and sprinkle with chives."]}, {"isVegetarian": false, "title": "Sweet and sour lamb with pineapple", "url": "www_bbc_co_uk_food_recipes_sweetandsourlambwith_79089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "¼ red pepper, diced ", "½ red onion, diced", "1 lamb chop, diced", "1 tbsp tomato purée", "2 tbsp balsamic vinegar ", "50g/2oz spinach ", "150ml/5fl oz hot water ", "75g/3oz pineapple, diced ", "1 tsp cornflour, mixed in 2 tbsp water", "75g/3oz couscous, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a sauté pan, heat the oil and add the red pepper and red onion. Fry for four minutes until soft.", "Turn up the heat and add the lamb. Fry until golden then add the tomato purée, balsamic vinegar and hot water and cook for five minutes.", "Add the pineapple and the cornflour in water and cook for one more minute. Finish by adding the spinach.", "To serve, place the sweet and sour lamb on a serving plate with the couscous on the side."]}, {"isVegetarian": false, "title": "Sweet and sour mushroom stir fry", "url": "www_bbc_co_uk_food_recipes_sweetandsourmushroom_85885", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp groundnut oil", "1 onion, chopped", "1 garlic clove, chopped", "450g/1lb mixed mushrooms, chopped", "300ml/½ pint chicken stock", "1 tbsp finely chopped fresh ginger ", "1 tbsp light soy sauce", "2 tbsp rice wine", "1 tbsp tomato purée", "2 tbsp rice wine vinegar", "2 tsp cornflour, blended to a paste with a little water", "2 tbsp sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan over a medium heat. Add the onion and garlic and cook for 3-4 minutes.", "Add the mushrooms and stir-fry for two minutes.", "Add the chicken stock and allow the mixture to simmer.", "Add the remaining ingredients and cook until the sauce has thickened. Serve in warmed bowls."]}, {"isVegetarian": false, "title": "Sweet and sour mussels with chilli", "url": "www_bbc_co_uk_food_recipes_sweetandsourmussells_73658", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz live mussels", "olive oil", "1 onion, thinly sliced", "2 garlic cloves, thinly sliced", "1 tbsp chopped fresh ginger", "4 red chillies, finely sliced, leaving seeds in ", "150ml/5½fl oz white wine vinegar", "6 tsp sugar ", "splash of Thai fish sauce", "1 lime, juice only", "handful of coriander, finely chopped", "small handful of chopped, fresh basil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the mussels. Heat a little water in a large pan, add the mussels and put the lid on. Steam for a few minutes until the mussells open. Discard any mussels that don't open. Put the mussels and their juices to one side.", "Heat a drizzle of olive oil in a frying pan and gently soften the onions, garlic, ginger and chillies.  ", "Add the vinegar and the sugar, stir well to dissolve, and taste to make sure you have got that sweet and sour balance. Add a little more vinegar or sugar if necessary. Season with a few drops of fish sauce and simmer for 2-3 minutes.", "Tip the mussels and their juices into the frying pan and stir well to create a sticky coating over the mussels.  ", "Squeeze in the lime juice, add the herbs and serve."]}, {"isVegetarian": false, "title": "Sweet and sour peppers", "url": "www_bbc_co_uk_food_recipes_sweetandsourpeppers_70346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tbsp extra virgin olive oil", "1 large yellow pepper, deseeded and cut into thick strips", "1 large red pepper, deseeded and cut into thick strips", "3 anchovy fillets", "2 garlic cloves, peeled but left whole", "6 black olives", "1 tbsp capers", "1 tbsp sugar", "4 tbsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large frying pan, add the peppers and cook until the skins are golden brown. Then add the anchovy fillets, garlic, olives and capers. Stir in the sugar, then add the vinegar and allow to evaporate. ", "Cook on a medium heat for about 5 minutes, or until the peppers are tender. Season to taste and serve hot or cold."]}, {"isVegetarian": false, "title": "Sweet and sour pork", "url": "www_bbc_co_uk_food_recipes_sweetandsourpork_89259", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp roasted peanuts", "ground black pepper (or ground white pepper)", "1 tsp crushed dried chillies ", "2 pork loin steaks, fat removed", "2 tbsp groundnut oil", "125g/4oz canned pineapple, in natural juice, juice reserved", "3 tbsp freshly squeezed lime juice", "light soy sauce", "splash of Shaoxing rice wine or dry sherry (optional)", "steamed rice", "choi sum (Chinese cabbage), or spinach, steamed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork, place the roasted peanuts, a few pinches of ground pepper and the dried chillies into a food processor and pulse until coarsely ground. Transfer to a shallow bowl and set aside. ", "Place the pork steaks in between two sheets of cling film and, using a meat mallet or rolling pin, bash the pork steaks until halved in thickness. Roll the steaks in the soya bean mixture until well-coated, then pat lightly to secure the mixture to the meat, shaking off any excess. ", "Heat a wok until smoking and add the groundnut oil, then add the pork steaks and cook for 2-3 minutes on both sides, or until golden-brown and cooked through. Remove the steaks from the wok transfer to a warm plate to rest.", "For the sweet and sour sauce, place all of the sauce ingredients into a food processor and blend to a smooth paste.", "Pour the sweet and sour sauce into the wok used to cook the pork and leave to simmer for 1-2 minutes, or until the sauce has reduced to a thick consistency. Season, to taste, with light soy sauce, rice wine and ground white pepper. ", "To serve, pour the sauce over the pork and serve with rice and choi sum."]}, {"isVegetarian": false, "title": "Sweet-and-sour pork medallions with spicy leeks", "url": "www_bbc_co_uk_food_recipes_sweetandsourporkmeda_90476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz pork fillet", "salt and freshly ground black pepper", "2 tbsp olive oil", "¼ leek, finely sliced", "¼ red pepper, finely chopped", "4-5 drops Tabasco sauce", "100ml/3½fl oz chicken stock", "½ red chilli, finely chopped", "1 garlic clove, finely chopped", "2 tbsp soy sauce", "1 tbsp olive oil", "1 tbsp honey", "fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pork, heat the oil in an ovenproof frying pan and season the meat with salt and freshly ground black pepper. Fry on all sides for 2-3 minutes, or until browned all over. Transfer to the oven to roast for 8-10 minutes, or until cooked through. Set aside on a warm plate to rest.", "For the leeks, heat the oil in a pan and fry the leeks and red pepper for 3-4 minutes, or until softened, then add the Tabasco sauce and stock and cook for a further 4-5 minutes.", "For the dressing, place all of the dressing ingredients into a pan and warm through for 4-5 minutes, mixing well to combine. ", "Spoon the leeks onto a serving plate, slice the pork into thick medallions and place on top of the leeks. Spoon the dressing over the pork and around the edges of the plate and garnish with fresh parsley."]}, {"isVegetarian": false, "title": "Sweet and sour pork served on chard leaves", "url": "www_bbc_co_uk_food_recipes_sweetandsourporkserv_79329", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "100g/3½oz diced pork", "3 prunes, chopped", "2 baby leeks, chopped", "1 tsp Tabasco sauce", "2 tbsp tomato sauce", "2 tbsp soy sauce", "2 tbsp honey", "3 orange segments", "1 tbsp fresh coriander, chopped", "5 raw chard leaves"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan. Add the pork and fry for three minutes on each side, until browned.", "Add the prunes, leek, Tabasco sauce, tomato sauce and soy sauce and cook for a further five minutes.", "Add the honey, orange segments and coriander and cook for a further two minutes.", "To serve, lay the chard leaves flat on the plate and top with the sweet and sour pork."]}, {"isVegetarian": false, "title": "Sweet and sour samphire, cucumber, cockles and dill salad", "url": "www_bbc_co_uk_food_recipes_sweetandsoursamphire_87150", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cucumber, cut into long ribbons", "55g/2oz samphire, blanched ", "2 tbsp chopped fresh dill", "2 tsp white wine vinegar", "1 tbsp olive oil", "1 tsp sugar ", "100g/3½oz cockles", "2 tbsp white wine"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cucumber ribbons, samphire, dill, vinegar, oil and sugar into a large bowl, stir well and leave for ten minutes for the flavours to infuse. ", "Place the cockles into a pan over a medium heat, add the wine, cover with a lid and leave for 2-3 minutes, or until all the shells have opened. ", "Discard any that havent opened or have broken shells.", "To serve, add the cockles to the salad and mix well."]}, {"isVegetarian": false, "title": "Sweet-and-sour red snapper", "url": "www_bbc_co_uk_food_recipes_sweetandsourredsnapp_92478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 tbsp vegetable oil", "10 spring onions, trimmed, sliced", "50cm/2in piece fresh root ginger, julienned", "1 red chilli, seeds removed, chopped", "1 garlic clove, peeled, crushed to a paste with the edge of a knife", "100ml/3½fl oz tomato ketchup", "30-40 cherry tomatoes", "dash fish sauce", "200ml/7fl oz fish stock or water", "salt and freshly ground black pepper", "plain flour, for dusting", "4 x 150g/3½oz red snapper fillets, cut into pieces", "steamed sticky rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 1-2 tablespoons of the oil in a wok over a high heat. Add the spring onions and ginger and stir-fry for 1-2 minutes, or until softened.", "Add the red chilli and garlic and stir-fry for a further 1-2 minutes, or until softened. ", "Add the tomato ketchup, tomatoes and fish sauce and stir well to combine.", "Add the stock (or water) and bring the mixture to the boil. Continue to boil until the cherry tomatoes 'burst' in the wok, about 4-5 minutes. Season, to taste, with salt and freshly ground black pepper. ", "Meanwhile, sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Dredge the fish pieces in the seasoned flour, shaking off any excess. ", "Heat the remaining oil in a frying pan over a medium heat. Add the coated fish pieces, in batches if necessary, and fry for 2-3 minutes on each side, or until crisp and golden-brown and cooked through. ", "Just before serving, add the fried fish pieces to the sweet-and-sour sauce and cook for 1-2 minutes, or until warmed through. ", "To serve, spoon the sticky rice into the centre of each of four serving plates. Spoon over the sweet-and-sour red snapper."]}, {"isVegetarian": false, "title": "Sweet and sour shrimp and pineapple soup", "url": "www_bbc_co_uk_food_recipes_sweetandsourshrimpan_88523", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken, preferably a stewing hen, whole or jointed", "1-1.5 litres/2-2½ pints water (to cover)", "1cm/½in piece fresh ginger, thinly sliced", "2 leeks, white part only, thickly sliced", "2-3 tbsp vegetable oil", "2 small tomatoes, preferably slightly unripe, peeled and quartered", "2 tbsp nam pla (fish sauce)", "2 tbsp lemon juice", "2 star fruit, preferably slightly unripe, thinly sliced", "1 small pineapple, preferably slightly unripe, peeled and cut into chunks", "½ tsp freshly ground black pepper", "2 tbsp tamarind paste ", "1-2 tsp sugar (to taste)", "500ml/18fl oz chicken stock (see above) or ready-made fresh chicken stock ", "3 spring onions, including green parts, sliced thinly", "1 kg/2lb 2oz raw king prawns, shelled and de-veined", "1 large handful fresh coriander leaves, roughly chopped", "1 fresh long red chilli, seeds removed, sliced thinly"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["If making your own chicken stock, rinse the chicken well under running water. Place into a large stockpot and add enough cold water to just cover the chicken. Bring to the boil, uncovered, skimming off any scum with a spoon.", "Add the ginger and leeks, reduce the heat to a simmer and cook for 1½-3 hours, until the broth has taken on the flavours of the ingredients. Strain into a clean bowl and leave to cool.", "For the soup, place a large saucepan on the heat and add the oil and one of the chopped tomatoes. Cook for three minutes until just softened.", "Add the fish sauce, lemon juice, star fruit and pineapple and stir well. Add the freshly ground black pepper, tamarind, and sugar, to taste.", "Add the chicken stock, spring onions and remaining chopped tomato and bring to a rolling boil. Boil for two minutes, then add the prawns and cook for a further minute, or until the prawns have turned pink and are cooked through.", "Remove from the heat and stir in the coriander leaves and chilli slices. Serve immediately."]}, {"isVegetarian": false, "title": "Sweet and sour soy pork buns", "url": "www_bbc_co_uk_food_recipes_sweetandsoursoyporkb_89269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, finely chopped", "2 tbsp yellow bean sauce (available from Asian grocers and some supermarkets)", "1 tbsp Shaoxing rice wine or dry sherry", "600g/1lb 5oz pork fillet, sliced", "2 tbsp groundnut oil", "2 tbsp light soy sauce", "2 tbsp Chinese black rice vinegar or balsamic vinegar", "1 tbsp brown sugar", "2 tbsp clear honey ", "pinch salt", "pinch ground white pepper ", "1 tbsp groundnut oil ", "3 red onions, sliced", "1 tbsp Chinese black rice vinegar or balsamic vinegar", "1 tbsp brown sugar", "8 large sesame seed buns, halved, grilled", "salad leaves, torn into small pieces", "4 tomatoes, sliced (optional)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinated pork, mix together the garlic, yellow bean sauce and Shaoxing rice wine in a bowl. Add the pork and stir well to coat.", "For the sweet and sour sauce marinade, mix together all of the sauce ingredients in a bowl and add to the pork. Mix well to combine, then cover with cling film and leave to marinate in the fridge for at least 24 hours. ", "To cook the pork, heat a wok until smoking and add the groundnut oil. Add the sliced pork (reserving the marinade) and stir-fry for 3-4 minutes, or until browned. Add the reserved marinade and bring to the boil. Reduce the heat to simmer for 3-4 minutes, or until the sauce is thick and sticky. ", "For the caramelised onions, heat the groundnut oil in a small wok or pan, add the red onions and stir-fry for 4-5 minutes, or until softened but not coloured. Add the black rice vinegar and the brown sugar, stirring well, and leave to cook for 2-3 minutes, or until caramelised.", "To serve, fill the buns with some salad leaves. Top with slices of the sticky pork, some caramelised onions and sliced tomatoes, if using. Serve immediately."]}, {"isVegetarian": false, "title": "Sweet and sour stir fry with honey squid and parsley oil", "url": "www_bbc_co_uk_food_recipes_sweetandsourstirfryw_79331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "½ romero pepper, finely chopped", "1 tbsp white wine vinegar", "2 tbsp tomato ketchup", "1 tbsp brown sugar", "½ tsp chilli, chopped", "1 squid tube, cleaned and chopped", "2 tbsp honey", "2 handfuls fresh parsley leaves", "55ml/2fl oz olive oil", "1 lime, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok to a high temperature.", "Add the oil and when smoking add the romero pepper, vinegar, tomato ketchup, brown sugar and chilli. Stir fry for five minutes.", "Add the squid and honey and cook for a further two minutes.", "For the parsley oil, place the parsley, olive oil and lime juice in a small food processor and blend until smooth.", "To serve, place the squid stir-fry on a plate and drizzle over the parsley oil."]}, {"isVegetarian": false, "title": "Sweet and sour stuffed aubergines", "url": "www_bbc_co_uk_food_recipes_sweetandsourstuffeda_85611", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetandsourstuffeda_85611_16x9.jpg", "ingredients": ["2 medium aubergines", "salt, for sprinkling", "4 tbsp tomato purée", "1 lemon, juice only", "2 tbsp caster sugar", "2 tbsp extra virgin olive oil, plus extra for greasing", "150ml/5fl oz water ", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil", "1 onion, chopped", "2 garlic cloves, chopped", "300g/11oz minced beef", "1 heaped tsp ground cinnamon", "1 heaped tsp ground cumin", "salt and freshly ground black pepper ", "2 tomatoes, deseeded and finely chopped", "water, to cover", "3 tbsp bulgur wheat", "30g/1oz pine nuts", "30g/1oz currants"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the aubergines, halve the aubergines lengthways and scoop out a little of the centre (you can use it in another dish, such as a soup or a stew). Season the aubergines with salt, then turn upside down on a wire rack to drain.", "For the filling, heat the olive oil in a large, heavy-bottomed pan and fry the onion until tender. Add the garlic and fry for a minute or so longer.", "Add the meat and fry until it has changed colour, breaking up the lumps. Sprinkle over the spices, season with salt and freshly ground black pepper and fry for another minute.", "Add the tomatoes and just enough water to cover and stir well. Simmer gently for 30 minutes until the meat is tender. Taste and adjust the seasoning.", "Add the bulgur wheat, pine nuts and currants and stir well.", "Preheat the oven to 170C/325F/Gas 3.", "Lightly oil an ovenproof dish and place the aubergine halves into the dish. Fill them with the spiced meat mixture.", "Place the tomato purée, lemon juice, sugar, olive oil and water into a bowl. Season with salt and freshly ground black pepper and mix well.", "Pour the tomato purée mixture over the aubergines. Cover with foil, transfer to the oven and bake for 45 minutes.", "Remove the foil, baste the aubergines in their juices and cook for a further 15-20 minutes. Serve hot or warm."]}, {"isVegetarian": false, "title": "Sweet and sour turkey stir-fry", "url": "www_bbc_co_uk_food_recipes_sweetandsourturkeyst_84747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz turkey breast, chopped", "2 tbsp soy sauce", "2 tbsp runny honey", "2 tbsp olive oil", "2 tbsp sesame seeds", "50g/1¾oz new potatoes, thinly sliced", "50g/1¾oz green beans, trimmed", "½ carrot, peeled, cut into ribbons", "1 tbsp olive oil", "1 tbsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the turkey, place the turkey pieces into a large bowl along with all of the other ingredients except the sesame seeds and mix well to combine.", "Heat a wok over a high heat, place the turkey into the wok and stir fry for 3-4 minutes. Add the sesame seeds to the wok and cook for a further minute.", "Meanwhile, for the vegetables, bring a medium saucepan of salted water to the boil, place the potatoes into the pan and boil for 3-4 minutes. ", "Add the beans to the pan and cook for 2-3 minutes, then add the carrots and cook for 1-2 minutes, or until all of the vegetables are tender. ", "Drain the vegetables and transfer to a bowl. Pour over the oils and mix well to coat the vegetables.", "To serve, place the vegetables onto a plate with the turkey stir-fry on top."]}, {"isVegetarian": false, "title": "Sweet and spicy chicken wings", "url": "www_bbc_co_uk_food_recipes_sweetandspicychicken_72317", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3¼oz chicken wings, cut in half through the joint and tips discarded", "1 tbsp Sichuan pepper corns, toasted and ground", "1 tbsp minced garlic", "3 tbsp minced fresh ginger", "3 tbsp finely grated orange zest", "4 spring onions cut into 2.5cm/1in pieces", "1 fresh red chilli, finely chopped", "2 tbsp liquid honey", "2 tbsp soy sauce", "450ml/16¼fl oz corn oil", "125ml/4½fl oz sesame oil", "salt ", "freshly ground black pepper", "1 tbsp finely grated orange zest", "2 tbsp chopped parsley", "2 tbsp snipped chives"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["In a pestle and mortar blend together the peppercorns, garlic, ginger, orange zest, spring onions and chilli until you have a paste.", "In a large bowl combine the honey, soy sauce and oils with the paste.  Season to taste.  Add the chicken wings, turn to coat, then allow to marinate for at least 4 hours or preferably overnight.", "Cook the chicken wings in a hot griddle pan or on a hot barbecue for 7-8 minutes each side or until thoroughly cooked and golden brown.", "Garnish the chicken with a mixture of orange zest, chopped parsley and chives."]}, {"isVegetarian": true, "title": "Sweet and spicy nuts and cherries", "url": "www_bbc_co_uk_food_recipes_sweetandspicynutsand_86262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp caster sugar", "pinch dried chilli flakes", "100g/3½oz brazil nuts, shells removed", "1 lime, juice only", "1 orange, juice only", "handful fresh mint, chopped", "50g/2oz canned black cherries, stones removed, drained", "1 orange, cut into wedges, to serve"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar into a frying pan and heat until melted and golden. Add the chilli flakes and the nuts and cook over a low heat, stirring occasionally, for 2-3 minutes.", "Add the lime and orange juice, the chopped mint and cherries and stir well to coat in the caramel.", "To serve, pour the sweet and spicy nuts and cherries into a bowl and garnish with the orange wedges."]}]