[{"ingredients": ["12 costillas de cerdo", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "2 x 400 g de tomates picados", "3 dientes de ajo, finamente picados", "50g / 2oz de azúcar mascabado ligero", "4 cucharadas de vinagre de malta", "3 cucharadas de salsa Worcestershire", "1 cucharada de puré de tomate", "2 cucharaditas de polvo chino de cinco especias", "1 cucharadita de comino molido", "sal y pimienta negra recién molida"], "method": ["Para hacer la salsa, caliente el aceite en una cacerola y agregue la cebolla. Freír durante 3-4 minutos, hasta que se ablanden, luego agregue el resto de los ingredientes. Mezclar bien y llevar a ebullición. Reduzca el fuego y cocine a fuego lento durante unos 30 minutos, revolviendo ocasionalmente, hasta que espese.", "Coloque las costillas en la barbacoa y cocine durante 10-15 minutos, dependiendo del grosor de la carne. Cepille las costillas abundantemente con la salsa de barbacoa cada pocos minutos, hasta que tengan una capa gruesa y pegajosa, y sírvalas."], "url": "www_bbc_co_uk_food_recipes_jennysbarbecuesparer_70172", "title": "Costillas a la barbacoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jennysbarbecuesparer_70172_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 muslos de pollo sin hueso, con la piel puesta (si es posible)", "5 chiles Scotnet bonnet, semillas retiradas", "1 manojo de cebollas en rodajas finas", "50g / 1¾oz de cilantro fresco, aproximadamente picado", "1 lima, solo jugo", "2 cucharadas de azúcar de palma o azúcar morena clara y suave", "1 cucharada de salsa de soja", "1 cucharada de pimienta de Jamaica molida", "5 dientes de ajo, picados", "1 cucharada de ron oscuro", "10-12 ramitas de tomillo fresco, solo hojas", "½ cucharada de canela molida", "2cm / ¾ en jengibre fresco de raíz, aproximadamente picado", "salpicar jugo de naranja fresco", "3 cucharadas de aceite vegetal, o suficiente para hacer una pasta suave", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla, ablandada, cortada en pedazos", "180ml / 6fl oz de leche entera", "300g / 10½ oz de harina natural, más extra para espolvorear", "aceite vegetal, para freír"], "method": ["Ponga los ingredientes de la pasta de tomate en un procesador de alimentos y mezcle hasta que quede suave, usando suficiente aceite y jugo de naranja para crear una pasta espesa. Sofoque el pollo en la pasta, cubra y deje en la nevera durante al menos 2 horas, o preferiblemente durante la noche.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para hacer los panes planos, bata la mantequilla y la leche en un bol. Mezcle lentamente la harina y ½ cucharadita de sal hasta que tenga una consistencia de masa.", "Amasar la masa sobre una superficie de trabajo ligeramente enharinada hasta que quede suave. Envuelva la película adherida y deje enfriar en la nevera durante 30 minutos.", "Mientras tanto, coloque un molde de plancha a prueba de horno a fuego alto y cocine el pollo en ambos lados hasta que se dore. Transfiera la sartén al horno y hornee durante 40 minutos.", "Coloque la masa descansada sobre una superficie de trabajo ligeramente enharinada y divídala en cuartos. Ruede cada cuarto a 3 mm de grosor.", "Con una sartén o sartén de base pesada, caliente un poco de aceite a fuego medio y agregue un pan plano. Cocine por 1-2 minutos en cada lado, o hasta que alcance el nivel deseado de crujiente. Sirva el pollo con los panes calientes."], "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_20341", "title": "Jerk pollo y panes planos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_chicken_and_20341_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla tierna, finamente picada", "1 cucharada de tomillo fresco finamente picado", "1 cucharadita de pimienta de Jamaica molida o pimiento molido", "1 cucharadita de miel", "1 cucharadita de salsa de soja", "1 cucharadita de aceite vegetal", "½ cucharadita de ajo fresco tostado", "2 cucharaditas de bonetes escoceses toscamente picados", "4 muslos de pollo deshuesados, piel sobre", "4 rotis confeccionados", "aceite de oliva, para frotar", "sal y pimienta negra recién molida", "½ lechuga iceberg, rallada", "gran puñado de cohetes", "1 x 198g de maíz dulce de hojalata, escurrido", "½ coco fresco, carne rallada", "15 tomates cherry, cortados a la mitad", "Frijoles de lata 200 g / 7 oz, escurridos", "75g / 2½oz de col roja, rallada", "Col blanca de 75 g / 2½ oz, rallada", "75g / 2½ oz zanahorias, peladas y ralladas", "1 cucharada de perejil de flatillo finamente picado", "4-5 cucharadas de puré de mango", "100ml / 3½fl oz de mayonesa"], "method": ["Para el pollo jerk, coloca la cebolla de primavera, el tomillo, la pimienta de Jamaica, la miel, la salsa de soja, el aceite vegetal, el ajo y el chile en un procesador de alimentos y mézclalo en una pasta espesa. Condimentar con sal y pimienta.", "Coloque los muslos de pollo en un tazón grande y frote generosamente con la pasta. Cubra y deje marinar en la nevera durante la noche.", "Precalentar una barbacoa o una sartén a fuego alto y frotar los muslos de pollo con un poco de aceite de oliva. Cocine los muslos durante 10-15 minutos en cada lado, hasta que estén dorados, ligeramente carbonizados y cocidos. Descanse el pollo durante 2-3 minutos y córtelo en rodajas.", "Mientras tanto mezcle los ingredientes de la ensalada en un tazón. Coloque los ingredientes de la ensalada de col en otro recipiente y mezcle para combinar. En un tercer tazón, mezcle el puré de mango y la mayonesa.", "Caliente los rotis en una sartén caliente o en la barbacoa, hasta que se coloreen y se hinchen por ambos lados.", "Coloque los rotis calientes en cuatro placas. Ponga un poco de ensalada y ensalada de col en el medio de cada roti. Cubra con el pollo tiritas, rocíe con la salsa de mango, envuelva y coma."], "url": "www_bbc_co_uk_food_recipes_jerk_chicken_and_salad_67570", "title": "Jerk chicken and salad wraps", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "1 cebolla tierna, finamente picada", "½ Scotch bonnet chilli, semillas removidas, finamente picadas", "2.5cm / 1 en pieza de jengibre raíz, rallado", "1 cucharadita de canela molida", "1 cucharadita de pimienta de Jamaica molida", "2 cucharaditas de hierbas mezcladas", "1 cucharadita de sal", "1 cucharadita de pimienta negra", "3 cucharadas de condimento para todo uso", "1 cucharadita de nuez moscada", "2 dientes de ajo, aplastados", "2 cucharadas de hojas de tomillo seco picado", "2 limas, solo jugo", "1 pollo entero, espolvoreado", "dash aceite de oliva", "50g / 1¾oz de mantequilla", "4 cebolletas, finamente picadas", "1 diente de ajo, pelado pero dejado entero", "¼ de chile en salsa de whisky, finamente cortado en cubitos", "2 ramitas de tomillo fresco", "Arroz risotto 250 g / 9 oz", "600 ml / 1 pinta de caldo de pollo", "200g / 7oz de guisantes frescos", "50 g / 1¾oz de queso parmesano, rallado", "2 cucharadas de aceite de oliva", "2 huevos medianos de granja, solo yemas", "1 cucharadita de mostaza Dijon", "2 cucharadas de vinagre de vino blanco", "300ml / 10½ fl oz de aceite de girasol", "1 apionabo, pelado y en rodajas finas", "2 zanahorias grandes, peladas y en rodajas finas", "1 limón, solo jugo", "1 cucharada de mostaza Dijon", "2 cucharadas de cebolletas frescas picadas"], "method": ["Para el pollo jerk, precaliente el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes para la mezcla de espelta en una licuadora y mezcle hasta que tenga una pasta áspera.", "Extiende la mezcla por todo el pollo y deja marinar durante al menos una hora.", "Caliente una sartén grande, rocíe un poco de aceite sobre el pollo y coloque el lado de la piel sobre la plancha. Cocine durante cinco minutos, voltee y coloque en el horno durante 40-45 minutos, o hasta que esté cocido.", "Para las tortas de arroz y guisantes, caliente una sartén grande y agregue la mantequilla. Agregue la cebolla, cocine por un par de minutos y luego agregue el ajo, el chile y el tomillo y cocine durante un minuto más.", "Agregue el arroz y revuelva para cubrir el arroz. Poco a poco agregue el caldo poco a poco hasta que todo el caldo se haya ido y tenga un cremoso risotto. Termine agregando los guisantes frescos y el parmesano.", "Dejar enfriar y dejar en el refrigerador.", "Para hacer las tortas de arroz y guisantes, caliente una sartén grande y agregue el aceite. Una vez caliente tome una cucharada de risotto frío y forme una pequeña torta del tamaño de una torta de pescado y fría por un par de minutos por cada lado.", "Para el repollo, agrega las yemas de huevo a un pequeño procesador de alimentos y agrega la mostaza y el vinagre. Arranque el motor en el procesador y gradualmente agregue el aceite un poco a la vez para hacer mayonesa.", "Coloque el apionabo y la zanahoria en rodajas en un tazón de vidrio grande y agregue la mayonesa, jugo de limón, mostaza y cebollín.", "Para servir, esculpir el pollo en porciones y colocarlo en un plato con arroz, pastel de guisantes y ensalada."], "url": "www_bbc_co_uk_food_recipes_jerk_chicken_rice_and_99370", "title": "Jerk pollo, arroz y pastel de guisantes y col", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz vientre de cerdo, corteza quitada", "1 cucharada de condimento seco jerk", "300 ml / 10 fl oz de sidra seca", "475ml / 17fl oz de caldo de pollo", "1 cebolla, cortada en anillos de 1cm / ½ en", "4 dientes de ajo, en rodajas", "4 ramitas de tomillo fresco", "sal marina y pimienta negra recién molida", "salsa de pimiento picante, para servir", "675g / 1lb 8oz de papas nuevas, raspadas o frotadas", "100ml / 3½fl oz de aceite de oliva virgen extra", "225g / 8oz de guisantes frescos desgranados"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Frote la barriga de cerdo con el condimento de tirón y colóquela en una sartén de base pesada, con la grasa hacia abajo. Cocine por unos minutos hasta que estén doradas y luego dore rápidamente por todos lados para sellar. Retire la sartén del fuego y déjela reposar durante unos cinco minutos.", "Vierta la sidra en una jarra grande con el caldo de pollo. Coloque los aros de cebolla en una lata para asar y esparza el ajo y el tomillo. Coloque el vientre de cerdo descansado en la parte superior, con la piel hacia arriba, y vierta la mezcla de sidra alrededor de la carne. Sazone al gusto con sal marina y pimienta negra recién molida. Cubra con papel de aluminio y cueza en el horno durante 2½-3 horas, o hasta que el cerdo esté tierno y completamente suave.", "Retire la lámina y encienda el horno a 230 ° C / 450 ° F / Gas 8. Ase la carne por otros 20-25 minutos hasta que quede ligeramente crujiente y dorada. Retire del horno y reserve para descansar.", "Mientras tanto, coloque las papas en una olla grande de agua con sal y deje hervir. Tape y cocine a fuego lento durante 12-15 minutos hasta que estén tiernos y luego escurra bien. Incline las papas escurridas en un tazón grande y aplaste suavemente cada patata con la parte trasera de un tenedor hasta que se rompa. Rocíe el aceite, sazone con sal marina y pimienta negra recién molida y mezcle cuidadosamente hasta que todo el aceite haya sido absorbido.", "Mientras tanto, cocine los guisantes en una sartén por separado de agua hirviendo con sal durante 3-4 minutos hasta que estén tiernos y luego escurra bien. Mezcle los guisantes con las papas molidas y sazone al gusto con sal marina y pimienta negra recién molida. Coloque el mash-up en platos con rebanadas de panza de cerdo. Sirve a la vez con salsa de pimiento picante."], "url": "www_bbc_co_uk_food_recipes_jerk_pork_belly_with_99669", "title": "Barriga de cerdo con puré de guisantes y patatas frescas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de pimienta de Jamaica", "½ cucharadita de sal", "2 dientes de ajo, aplastados", "1 chile con tapa de whisky escocés, sin semillas, finamente picado", "2 cucharaditas de hojas de tomillo fresco picado", "2 cucharaditas de pimienta negra recién molida", "½ cucharadita de canela molida", "¼ cucharadita de pimienta de cayena", "2 cucharadas de aceite vegetal", "2 filetes de cordero, completamente cortados", "4 cucharadas de aceite vegetal", "2 cebollas tiernas, finamente cortadas", "½ cucharadita de pimienta de Jamaica molida", "2 chiles verdes, sin semillas, finamente picados", "1 ramita de tomillo fresco, hojas recogidas", "Calabaza de 400g / 14oz, pelada, cortada en cubos de 1cm / ½ en cubitos", "1 cucharada de azúcar en polvo", "2 limas, solo jugo", "½ mango, pelado, finamente picado", "4 cucharadas de cilantro fresco picado", "4 cucharadas de menta fresca picada fresca", "sal y pimienta negra recién molida", "1 manzana crujiente, sin núcleo, muy finamente rebanada", "aceite vegetal, para freír poco", "sal", "1 cucharada de mostaza inglesa", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra", "1 cabeza de lechuga frisée, hojas amarillas interiores solamente, desgarradas en pedazos pequeños", "1 granada, solo semillas", "2 cucharadas de berro de coriandro", "2 cucharadas de berro de amaranto rojo"], "method": ["Para el cordero imbécil, mezcle todos los ingredientes, excepto el cordero, en un procesador de alimentos hasta obtener un puré.", "Extienda la mezcla sobre el cordero hasta que esté completamente cubierto y déjelo marinar en la nevera durante al menos cuatro horas. Retire el cordero de la nevera y deje que alcance la temperatura ambiente.", "Precalentar el horno a 200C / 400F / Gas 6.", "Calentar una sartén a prueba de horno hasta que esté caliente, agregar el cordero y freír en ambos lados hasta que se dore.", "Asar en el horno durante 10-12 minutos (para el medio), luego retirar y reservar para descansar durante 10 minutos.", "Para la calabaza de chile, calentar el aceite en una sartén con tapa y freír las cebollas tiernas, la pimienta, los chiles y el tomillo durante 1-2 minutos, o hasta que la cebolla se haya suavizado.", "Agregue la calabaza y fría por 4-5 minutos, o hasta que se dore.", "Cubra la olla con una tapa y continúe cocinando durante 3-4 minutos, o hasta que se suavice.", "Agregue el azúcar, el jugo de lima y el mango y cocine por otros 2-3 minutos, o hasta que estén tiernos y ligeramente pegajosos.", "Agregue el cilantro y la menta y sazone con sal y pimienta negra recién molida.", "Para la ensalada de manzana, caliente 1cm / ½ pulgada de aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para la ensalada de manzana, freír las rodajas de manzana en el aceite vegetal durante 1-2 minutos, o hasta que estén crujientes. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con un poco de sal. (Es posible que necesite cocinar las rebanadas de manzana en lotes).", "Batir la mostaza, el vinagre y el aceite de oliva juntos en un bol y sazonar con sal y pimienta negra recién molida.", "Mezcle las hojas de frisée, las semillas de granada y las rodajas de manzana juntas en un tazón. Agregue un poco del aderezo y revuelva hasta que esté bien combinado.", "Para servir, coloca la calabaza en el centro del plato. Cortar el cordero en rodajas gruesas y colocar unas rodajas sobre la calabaza. Coloque una pequeña ensalada sobre el cordero y termine con una dispersión de cilantro y berro de amaranto."], "url": "www_bbc_co_uk_food_recipes_jerk_lamb_with_chilli_14546", "title": "Jerk lamb con chile calabaza y ensalada de manzana", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["manojo de cebollas de primavera, más o menos picadas", "1-2 chiles de bonete escocés, dependiendo de qué tan caliente lo desee, semillas retiradas", "6 dientes de ajo", "Jengibre fresco de la raíz de los 5cm / 2in, tajado", "Tomillo de ramita grande, solo hojas", "2 cucharadas de vinagre de vino tinto", "2 cucharadas de aceite vegetal", "2 cucharadas de azúcar moreno oscuro", "1 cucharada de bayas de pimienta de Jamaica, aplastadas", "1 cucharadita de canela molida", "1 cucharadita de pimentón ahumado", "nuez moscada recién rallada", "1 cucharadita de pimienta negra recién molida", "4 chuletas de cerdo grandes (preferiblemente un corte graso en el hueso)", "1 cucharadita de sal", "1 cucharada de aceite vegetal o de coco", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 ramita de tomillo", "400g / 14oz de arroz de grano largo", "100ml / 3½ fl oz crema de coco", "200 g / 7oz de guisantes congelados"], "method": ["Para hacer el adobo, coloque todos los ingredientes del adobo en un procesador de alimentos o licuadora, excepto el cerdo y la sal, y mezcle hasta que tenga una pasta bastante líquida. Coloque las chuletas de cerdo en un tazón y sazone con la sal, luego vierta sobre el adobo. Cubra y deje durante al menos un par de horas, preferiblemente durante la noche. Si va a dejar la carne durante la noche, transfiérala a la nevera.", "Cuando esté listo para cocinar las chuletas, caliente la parrilla a fuego medio o prepare una barbacoa. Ase las chuletas a cada lado durante 3-5 minutos a cada lado, según su grosor, luego déjelos reposar durante unos minutos.", "Para el arroz y los guisantes, caliente el aceite en una cacerola grande o en una cacerola. Agregue la cebolla y fría hasta que esté suave y translúcida. Agregue el ajo, el tomillo y el arroz y revuelva hasta que el arroz se vea brillante.", "Agregue 700 ml / 1¼ de litro de agua y la crema de coco, junto con una generosa cantidad de condimentos. Llevar a ebullición, cubrir y reducir el fuego a fuego lento. Cocine por 10 minutos, luego mezcle los guisantes.", "Cocine por otros 5 minutos, luego retírelo del fuego y déjelo tapado por otros 10 minutos. Pelusa, y servir con la carne de cerdo."], "url": "www_bbc_co_uk_food_recipes_jerk_pork_chops_with_68968", "title": "Jerk chuletas de cerdo con arroz y guisantes", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de condimento tirón", "1½ cucharadita de miel líquida", "100ml / 3½fl oz de jugo de piña (de 227g de anillos de piña de lata)", "300 g / 10½ oz de solomillo de cerdo", "1 cucharadita de aceite de oliva", "1 x 350g / 12oz de camote, pelado y cortado en pedazos de 3cm / 1¼in", "2 anillos de piña enlatados (aproximadamente 100 g / 3½ oz), escurridos y finamente picados", "3 cebollas de primavera, en rodajas finas", "2 cucharadas de hoja de cilantro fresco tostado", "½ lima, solo jugo", "1 cucharadita de aceite de oliva", "½ chile rojo, sin semillas y finamente cortado en cubitos", "pizca de sal"], "method": ["Mezcle el condimento de tirón, la miel y el jugo de piña en un recipiente poco profundo lo suficientemente grande como para contener la carne de cerdo. Agregue el lomo de cerdo y colóquelo en la nevera, tapado, durante al menos 30 minutos o toda la noche, volteando la carne de cerdo un par de veces.", "Precaliente el horno a 200C / 180C Fan / Gas 6 y forre una bandeja para hornear con papel de cocina.", "Retire la carne del adobo, reserve el líquido y séquelo con papel de cocina. Calentar el aceite en una sartén a fuego alto. Dore la carne por un lado, voltee y dore por el otro lado.", "Coloque la carne en la bandeja para hornear, vierta sobre el adobo y asar durante 20-25 minutos, volteando la carne de cerdo después de 15 minutos. Corte en la parte más gruesa del filete para verificar que esté jugoso pero bien cocido.", "Mientras tanto, lleve una olla de agua ligeramente salada a ebullición y cocine a fuego lento la batata durante 15 minutos hasta que esté tierna. Escurrir, macerar y sazonar con sal y pimienta.", "Para hacer la salsa, mezcle la piña, la cebolleta, el cilantro, un chorrito de jugo de lima, aceite de oliva, chile y sal en un tazón y déjelos a un lado durante al menos 10 minutos.", "Voltee la carne en su adobo reducido y déjela reposar durante 5 minutos. Corte la carne de cerdo en rodajas de 2cm / ¾ de grosor y sirva con el puré y la salsa."], "url": "www_bbc_co_uk_food_recipes_jerk_pork_with_sweet_40784", "title": "Jerk de cerdo con puré de camote y salsa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerk_pork_with_sweet_40784_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 pechugas de pollo, o muslos de pollo, huesos retirados", "225g / 8oz de cebolla, descuartizado", "1-1½ capucha escocesa u otros chiles de acuerdo con el sabor, cortados a la mitad y sin semillas", "Jengibre de raíz 50g / 2oz, pelado y picado aproximadamente", "½ cucharadita de pimienta de Jamaica molida", "pequeño racimo de tomillo fresco, solo hojas", "1 cucharadita de pimienta negra recién molida", "120ml / 4fl oz de vinagre de vino blanco", "120ml / 4fl oz de salsa de soja oscura", "arroz y guisantes", "1 piña, pelada, sin corazón y cortada en cuñas", "4 limas, 3 cortes en rodajas, solo 1 jugo"], "method": ["Ponga todos los ingredientes para la salsa Jerk en un procesador de alimentos y hágala fluir hasta que quede suave.", "Coloque el pollo en un plato grande y poco profundo, vierta sobre la salsa, cubra y deje macerar en la nevera durante la noche.", "En una plancha caliente cocine el pollo durante 25-30 minutos, rociando de vez en cuando con la salsa sobrante. Mientras se cocina, la salsa espesa se pondrá bastante negra en algunos lugares, pero no se preocupe, ya que al caerse dejará una piel muy bien saborizada y crujiente, con una deliciosa carne húmeda y tierna debajo.", "Cepille la piña ligeramente con aceite y la parrilla hasta que estén doradas por todos lados. Exprime el jugo de una lima.", "Sirva el pollo tirón con el arroz y los guisantes, la piña y las rodajas de lima en el costado."], "url": "www_bbc_co_uk_food_recipes_jerkchicken_10680", "title": "Pelmazo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerkchicken_10680_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de cebolla tierna, en rodajas finas", "puñado de perejil", "1 cucharadita de hojuelas de chile", "1 lima, solo jugo", "1 cucharadita de especias mixtas", "2 pechugas de pollo, deshuesadas, sin piel, cortadas en rodajas", "2 cucharadas de aceite de oliva", "1 bolsa de hojas de ensalada", "1 cucharada de vinagre de vino blanco", "100 g / 3 oz mezclado semillas y nueces"], "method": ["Coloque la mitad de la cebolla de primavera en un recipiente con el perejil de flatleaf, hojuelas de chile, lima y especias mixtas. Usando una licuadora de mano, mezcle hasta que quede suave.", "Mezcle el pollo en el recipiente y revuelva para cubrir.", "Caliente una sartén hasta que esté caliente, luego agregue una cucharada de aceite de oliva y el pollo y saltee durante 2-3 minutos.", "Agregue el resto de las cebolletas y cocine por otros dos minutos.", "Mientras tanto, mezcle las hojas de ensalada con el aceite de oliva y el vinagre y colóquelas en un plato para servir.", "Agregue el pollo y esparza sobre las nueces. Servir."], "url": "www_bbc_co_uk_food_recipes_jerkchickensalad_83636", "title": "Ensalada de pollo Jerk", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas, con piel (sustituya las pechugas de pollo sin hueso si no están disponibles)", "½ cebolla grande, más o menos picada", "2 chiles con bonete escocés, toscamente picados", "40g / 1½ oz de jengibre, pelado y picado aproximadamente", "125ml / 4½fl oz de vinagre de malta", "½ cucharadita de clavo de olor molido", "½ cucharadita de canela molida", "¼ cucharadita de nuez moscada molida", "½ cucharadita de pimienta negra agrietada", "3 dientes de ajo, toscamente picados", "2 cucharaditas de hojas frescas de tomillo", "3 cucharadas de salsa de soja oscura", "200g / 7oz de arroz basmati", "1 granada, solo semillas", "1 pequeño perifollo de racimo de hojas", "4 cucharadas de cebollines, toscamente picados", "Lechuga frisée 50g / 2oz, más o menos picada", "1 lima, ralladura y jugo", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "2 limas, cortadas en cuñas"], "method": ["Para el pollo tirón, con un cuchillo afilado, hacer cortes profundos en la carne de pollo y colocar en un recipiente.", "Coloque los ingredientes restantes del pollo tirón en un procesador de alimentos y mezcle hasta obtener un puré. Vierta el adobo sobre el pollo y revuelva para cubrir todas las piezas. Coloque en la nevera durante al menos cuatro horas, pero preferiblemente durante la noche.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén hasta que esté muy caliente. Agregue las piezas de pollo y espere 2-3 minutos por cada lado, luego coloque en una bandeja para hornear.", "Vierta el adobo restante sobre el pollo y transfiéralo al horno para cocinar durante 20-25 minutos, o hasta que el pollo esté completamente cocido. Retire del horno y deje reposar por 2-3 minutos antes de servir.", "Para el arroz, coloque el arroz en una cacerola con 400 ml / 14 fl oz de agua fría. Cubra con una tapa y colóquelo a fuego alto. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que toda el agua haya sido absorbida y el arroz esté tierno (aproximadamente 10-15 minutos). Apague el fuego y deje que hierva durante 5-6 minutos.", "Coloque el arroz en un recipiente y agregue todos los ingredientes restantes de arroz y mezcle bien para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta un poco del arroz en cada plato y cubra con un trozo de pollo. Adorne con un par de rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_jerkchickenwithpomeg_88341", "title": "Jerk pollo con arroz de granada", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "12 patas de pollo", "Condimento tirón de buena calidad 200g / 7oz", "50ml / 2fl oz de aceite vegetal", "1 cebolla, finamente picada", "300g / 10½oz de arroz de grano largo", "400ml / 14fl oz de agua", "Leche de coco 400ml / 14fl oz", "Frijoles de hojalata de 400g / 14oz, enjuagados y escurridos", "3 cucharadas de tomillo fresco picado", "sal y pimienta negra recién molida", "hojas frescas de cilantro, para servir"], "method": ["Para el pollo tirón, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque las patas de pollo en un tazón grande y drague en el condimento tirón para cubrir todo. Con cuidado, colóquelo en el aceite caliente y fría, volteándolo de vez en cuando, durante aproximadamente 12 minutos, o hasta que estén dorados y completamente cocidos. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Mientras tanto, para el arroz y los guisantes, caliente el aceite en una sartén grande con tapa y fríe la cebolla hasta que se suavice pero no se coloree.", "Agregue el arroz y revuelva bien, luego agregue el agua y lleve a ebullición.", "Agregue la leche de coco, los frijoles y el tomillo, reduzca el fuego y cocine a fuego lento, cubierto, durante unos 20 minutos o hasta que el arroz esté cocido. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque una buena cucharada de arroz en una taza y luego colóquela en un plato para servir. Repita con cada porción y coloque 2-3 patas de pollo encima de cada montón de arroz. Espolvorear con cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_jerkchickenwithricea_86519", "title": "Jerk pollo con arroz y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 200 g / 7oz de pechugas de pollo sin piel con el hueso del ala retenido", "1 cucharada de aceite de oliva", "2 cucharadas de pasta condimento jerk", "3 dientes de ajo, triturados hasta formar una pasta", "200g / 7oz de mantequilla, suavizada", "2 chalotes, finamente cortados en cubitos", "2 cucharadas de perejil inglés finamente picado", "½ lima, solo jugo", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "4 huevos de gallinas camperas, golpeados", "Leche de 110 ml / 4 fl oz", "Harina común 110g / 4oz", "500g / 1lb 2oz de pan rallado japonés", "500 g / 1 lb 2 oz de ñame amarillos o blancos, pelados y cortados en trozos de 1 cm / ½ en", "4 cucharadas de aceite de oliva", "4 lonchas de tocino rayado ahumado, más o menos picadas", "110g / 4oz de setas silvestres surtidas", "sal y pimienta negra recién molida"], "method": ["Para Kiev, haga una incisión en la parte superior de cada una de las pechugas de pollo, luego mueva el cuchillo para crear un bolsillo. Dejar de lado.", "Calentar el aceite en una sartén, agregar la pasta de tiritas y el ajo y cocinar durante un minuto o hasta que esté fragante.", "Coloque la mantequilla en un recipiente, agregue la pasta cocida y el ajo, junto con los chalotes, el perejil y el jugo de lima. Batir juntos hasta que estén bien combinados. Sazonar con sal y pimienta negra recién molida, al gusto.", "Coloque la mezcla en una manga pastelera y póngala en los bolsillos creados en las pechugas de pollo.", "Coloque el pollo en un plato, cubra y coloque en el refrigerador durante 30 minutos hasta que la mantequilla dentro del pollo se haya puesto.", "Caliente el aceite vegetal en una cacerola profunda o en una freidora a 190 ° C o 375 ° F o hasta que la miga de pan chisporrotee y se ponga dorada cuando la deje caer (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión). Precalentar el horno a 200C / 390F / Gas 6.", "Batir los huevos y la leche juntos en un tazón pequeño; Incline la harina en un plato y el pan se desmenuce en otro plato.", "Sumerja cada pechuga de pollo en la harina, luego la mezcla de huevo y finalmente en las migas de pan para cubrir por completo.", "Coloque cada seno en la freidora y cocine durante dos minutos hasta que se dore.", "Retire con cuidado el pollo de la freidora con una espumadera y escurra sobre papel de cocina. Coloque en una bandeja de asar y tueste en el horno durante 5-8 minutos, o hasta que esté cocido.", "Para el yam forestière, ponga a hervir un sartén de agua con sal, agregue los ñames picados y cocine a fuego lento durante 2-3 minutos, o hasta que estén tiernos.", "Escurre los ñames y reserve.", "Calentar una sartén, agregar el aceite de oliva y el ñame y freír durante 3-4 minutos, o hasta que estén doradas por todos lados.", "Caliente una segunda sartén hasta que esté caliente, agregue el tocino. Agregue los champiñones y fríalos por 2-3 minutos, o hasta que estén cocidos.", "Agregue los ñames al tocino y los champiñones y mezcle bien para combinar. Sazonar con sal y pimienta negra recién molida, al gusto.", "Para servir, coloque la mezcla de ñame en el centro de cada una de las cuatro placas para servir. Cortar el Kiev por la mitad en la diagonal y organizar en la parte superior. Servir."], "url": "www_bbc_co_uk_food_recipes_jerkkievwithyamfores_90443", "title": "Jerk Kiev con ñame forestiere", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo de tomillo fresco, solo hojas", "2 palitos de canela, más o menos triturados", "2 cucharadas de cilantro fresco picado", "1 cucharadita de semillas de cilantro, trituradas", "2 cucharadas de granos de pimienta negra, aplastados", "1 cucharadita de nuez moscada recién rallada", "3 cucharaditas de pimienta de Jamaica, aplastadas", "6 dientes de ajo", "4 chiles Scotch Bonnet, semillas retiradas", "2 cucharaditas de jengibre fresco picado", "2 limas, ralladura de 1 lima, jugo de 2", "140ml / ¼ pinta de aceite de oliva"], "method": ["Coloque todos los ingredientes en una licuadora o procesador de alimentos y mezcle para hacer una pasta suave.", "Use la pasta como condimento para pollo, cerdo o pescado. Se mantendrá durante dos semanas si está cubierto y refrigerado."], "url": "www_bbc_co_uk_food_recipes_jerkseasoning_89190", "title": "Condimento jerk", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla sin sal", "70 g / 2½ oz cebollas, en rodajas", "250ml / 9fl oz de caldo de pollo", "400 g / 14 oz de alcachofas de Jerusalén, peladas y cortadas en trozos pequeños", "1 bouquet garni", "50g / 1¾oz de mantequilla", "algunas gotas de aceite de trufa", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Derrita la mantequilla en una cacerola, agregue las cebollas y una pizca de sal y cocine suavemente hasta que esté suave, sin colorear. Agregue 250ml / 9fl oz de agua, el caldo de pollo, las alcachofas y el bouquet garni y llévelo a ebullición. Cocine por unos 30 minutos. Una vez que las alcachofas estén suaves, quita el bouquet garni. Transfiera a una licuadora y mezcle hasta obtener un puré fino, luego pase a través de un colador fino si es necesario.", "Batir la mantequilla en la sopa, agregar unas gotas de aceite de trufa, y sazonar con sal y pimienta.", "Sirva con una pizca de cebolletas frescas."], "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_20395", "title": "Sopa de alcachofa de Jerusalén con aceite de trufa blanca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalem_artichoke_soup_20395_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1¼ litros / 2 pintas de caldo de pollo", "Papas Royal Jersey de 300g / 10½oz, limpiadas", "150g / 5½ oz cebollas perla, deja todo pero pelado", "16 tallos de espárragos, recortados", "600 g / 1 libra de almejas de 5 oz, fregadas y servidas", "75g / 2¾oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Coloque el caldo en una olla grande con tapa y deje que hierva. Agregue las papas y cocine durante 4-7 minutos, hasta que estén casi tiernas.", "Agregue las cebollas perla y cocine durante 2 minutos. Agregue los espárragos y cocine por otros 2 minutos o hasta que todos los vegetales estén tiernos. Retire las verduras con una espumadera y déjelas a un lado.", "Deseche cualquier almeja con caparazones rotos y cualquiera que se rehúse a cerrar cuando se golpea contra el costado del fregadero. Reduzca el stock en un tercio, luego agregue las almejas. Cubra y cocine durante 1-2 minutos, hasta que se abran. Deseche cualquier que permanezca cerrado.", "Agregue la mantequilla, luego devuelva las verduras a la sartén y caliente. Sazonar con sal, si es necesario, y pimienta negra.", "Divida el caldo y las almejas entre 4 tazones para servir y sírvalos con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_jersey_royal_asparagus_49654", "title": "Jersey Royal, caldo de espárragos y almejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash oil, para cocinar", "1 cebolla, en rodajas", "100 g / 3½ oz de crème fraîche, más extra para servir", "sal y pimienta", "2 cucharadas de cebollines picados", "4 huevos de pato al aire libre, batidos", "Jersey Royals de 200 g / 7 oz, lavados y lavados (sin pelar), precocidos y partidos a la mitad", "1 manojo de cebollas en rodajas", "70g / 2½oz Double Gloucester, rallado", "30ml / 1fl oz primera prensa de aceite de colza", "flores de cebollino"], "method": ["Calentar una pizca de aceite en una sartén y freír la cebolla hasta que se ablande.", "Batir la crème fraîche y cebollino en un bol. Sazonar con sal y pimienta negra y reservar.", "Coloque los huevos de pato, las papas, las cebolletas, las cebollas cocidas y el queso en un tazón y sazone con sal y pimienta.", "Agregue el aceite de colza a una sartén antiadherente, caliente y luego vierta la mezcla de tortilla.", "Con una espátula a prueba de calor, mezcle la mezcla de huevo hasta que vea que el huevo comienza a fraguar, luego déjelo reposar completamente en el lado de la presentación y coloree suavemente los lados alrededor de la tortilla para que quede lo más redonda posible", "Una vez que la tortilla se haya solidificado, use un soporte para pasteles para ayudar a voltearse la tortilla: coloque el soporte sobre la mezcla firme de huevo, luego gírelo al mismo tiempo para que la bandeja esté boca abajo y la base para pastel esté derecha. Levante la bandeja y debe tener una tortilla encantadora. Vuelva a colocar la tortilla en la sartén y termine de cocinar durante 2-4 minutos hasta que esté cocida a su gusto.", "Para servir, corte la tortilla en porciones y luego sirva con una cuchara de crème fraîche y flores de cebollino en la parte superior."], "url": "www_bbc_co_uk_food_recipes_jersey_royal_and_double_50135", "title": "Tortilla Jersey Royal y Double Gloucester", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla grande, picada", "sal y pimienta", "10-12 alcachofas de Jerusalén, peladas y colocadas en agua acidulada", "750ml / 1¼ pinta de caldo de pollo", "150ml / 5½fl oz de crema batida", "½ limón, solo jugo", "50ml / 2fl oz de aceite de oliva, más extra para servir", "1 cebolla, finamente picada", "Hígados de juegos de 200g / 7oz", "200 g / 7 oz de grasa de cerdo", "200 g / 7 oz de cerdo garganta o vientre", "Juego mixto de 200 g / 7 oz, como faisán, ánade real y urogallo", "50g / 1¾oz de albaricoques secos", "1-2 huevos de gallinas camperas", "200ml / 7fl oz crema", "200g / 7oz de pan rallado", "aceite vegetal, para freír", "4 alcachofas de Jerusalén, rebanadas longitudinalmente en una mandolina, piel en", "50g / 1¾oz de harina natural", "2 cucharadas de cebolletas frescas, cortadas en trozos de 2 mm, para adornar"], "method": ["Para la sopa de alcachofas de Jerusalén, caliente el aceite vegetal en una sartén grande y fría la cebolla y una pizca de sal durante 5-6 minutos o hasta que esté suave.", "Mientras tanto, corte las alcachofas en cubos de aproximadamente 2 cm / 1 in. Agrégalos a las cebollas y freír durante 3-4 minutos más. Vierta el caldo de pollo y la crema y cocine a fuego medio hasta que los vegetales estén suaves. Agregue el jugo de limón y cocine por cinco minutos más.", "Transfiera las verduras cocidas al procesador de alimentos y mezcle hasta obtener una sopa suave. Si es demasiado grueso, agregue un poco más de caldo o agua. Pruebe verificar el condimento y agregue sal y pimienta según sea necesario. Mantenga caliente hasta que esté listo para servir.", "Para la hamburguesa del juego, caliente una pizca de aceite de oliva en una sartén. Una vez caliente, agregue la cebolla y fríela suavemente hasta que esté suave y translúcida. Dejar de lado para enfriar.", "Coloque los hígados, la grasa de cerdo, la garganta (o barriga), el juego y los albaricoques en una picadora, o córtelos muy finamente (alternativamente, solicite a su carnicero que haga esto por usted). Agregue un huevo, la crema y el pan rallado y mezcle. Si la mezcla no se une, agrega el otro huevo. Sazonar con sal y pimienta o, para probar el condimento de la hamburguesa, enrollar una pequeña cantidad en una mini hamburguesa, freír y probar.", "Cuando esté satisfecho con el condimento, moldee la carne en hamburguesas y fría en una sartén grande con aceite de oliva durante 2-3 minutos por cada lado.", "Para las patatas fritas de Jerusalén, llene una freidora con aceite vegetal y precaliente a 180 ° C / 350 ° F. (PRECAUCIÓN: el calor puede ser peligroso. No lo deje desatendido).", "Seque las rebanadas de alcachofas con una toalla de té limpia y polvillo con harina. Freír durante dos minutos, o hasta que estén crujientes y doradas.", "Sirva la sopa de alcachofas de Jerusalén con la hamburguesa de caza en el centro de cada uno de los cuencos, adornada con las patatas fritas de alcachofa, el cebollín y un remolino de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_jerusalem_artichoke_soup_78921", "title": "Sopa de alcachofas de Jerusalén servida con una hamburguesa de caza y patatas fritas de Jerusalén", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla grande, partida a la mitad y en rodajas", "675 g / 1½ libra de alcachofas de Jerusalén, peladas, cortadas a la mitad y en rodajas", "2 cucharadas de aceite de oliva virgen extra", "4 ramitas de tomillo fresco", "1 hoja de laurel", "1 litro / 1¾ pintas de pollo caliente o caldo de verduras", "2 cucharadas de vinagre de vino blanco", "sal y pimienta negra recién molida", "2 cucharadas de perejil picado", "6 barras gruesas baguette (opcional)", "150g / 5oz solo Gloucester, queso cheddar maduro o gruyere, rallado grueso (opcional)"], "method": ["Coloque la cebolla, las alcachofas y el aceite en una sartén y agregue el tomillo y la hoja de laurel, atados con una cuerda. Cubre y suda a fuego lento durante unos 15 minutos, revolviendo ocasionalmente.", "Agregue el caldo y el vinagre, sazone bien con sal y pimienta negra recién molida y deje que hierva. Cocine a fuego lento durante diez minutos, luego pruebe y ajuste el condimento. Deseche el tomillo y la hoja de laurel y vierta en tazones para servir.", "Para servir, espolvoréalo con perejil. Si usa el pan y el queso, precaliente la parrilla a fuego medio. Tueste ligeramente la baguette en ambos lados debajo de la parrilla, luego, justo antes de servir, cubra con queso rallado y deslícela hacia atrás debajo de la parrilla para que se derrita. Flote una rebanada de queso sobre una tostada en cada plato de sopa mientras sirve."], "url": "www_bbc_co_uk_food_recipes_jerusalemartichokebr_85618", "title": "Caldo de alcachofa de Jerusalén", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/jerusalemartichokebr_85618_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "3 alcachofas de Jerusalén, peladas y en rodajas", "½ chalota, pelada y en rodajas", "30ml / 1fl oz de vino blanco", "100ml / 3½fl oz de caldo de verduras", "Crema doble 55ml / 2fl oz", "1 cucharada de aceite de oliva", "2 muslos de faisán", "2 cucharadas de aceite de oliva", "½ chalote, pelado y finamente cortado"], "method": ["Calentar el aceite en una olla mediana. Agregue las alcachofas y el chalote y saltee durante unos minutos, para suavizar.", "Agregue el vino blanco y caliente por otros dos minutos.", "Vierta el caldo de verduras, deje hervir y luego reduzca el fuego y cocine a fuego lento durante 10-15 minutos.", "Agregue la crema y luego, con una batidora de mano, mezcle hasta que quede suave.", "Mientras tanto, para la guarnición de faisán, caliente una cucharada de aceite de oliva en una sartén por separado. Agregue los muslos de faisán y cocínelos durante 4-5 minutos por cada lado, hasta que estén crujientes y bien cocidos.", "En una sartén por separado, agregue la chalota en rodajas y saltee durante 3-4 minutos hasta que estén doradas y crujientes.", "Para servir, ponga la sopa en un tazón. Coloque los muslos de faisán en el medio y esparza los chalotes crujientes en la parte superior."], "url": "www_bbc_co_uk_food_recipes_jerusalemartichokeso_79270", "title": "Sopa de alcachofas de Jerusalén con faisán y chalotes crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]