[{"ingredients": ["85g / 3oz de queso cheddar rallado", "55g / 2oz de chorizo, picado", "85 g / 2 oz de frijoles mezclados, machacados ligeramente con un tenedor", "puñado de cilantro fresco, picado, más extra para decorar", "sal y pimienta negra recién molida", "2 envolturas de tortilla mexicana", "2 cucharadas de aceite de oliva", "½ diente de ajo, pelado y picado", "2 tomates, picados", "6cm / 3in pedazo de pepino, picado"], "method": ["Mezcle el queso, el chorizo, los frijoles, el cilantro y la sal y la pimienta negra recién molida en un tazón.", "Extienda la mezcla en una de las tortillas y cubra con la otra.", "Calentar un poco de aceite en una sartén y freír la quesadilla durante 2-3 minutos por cada lado.", "Mientras tanto, para la ensalada, mezcle todos los ingredientes en un tazón y sazone con sal y pimienta. Adorne con más cilantro fresco.", "Para servir, transfiera la quesadilla a un plato y sirva la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_chorizoandbeanquesad_76375", "title": "Quesadilla de chorizo ​​y frijol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizoandbeanquesad_76375_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 pollo, articulado (puede pedirle a su carnicero que haga esto o comprar porciones de pollo si lo prefiere)", "570ml / 1 pinta de caldo de pollo caliente", "1 cebolla, pelada y descuartizada", "2 dientes", "1 zanahoria grande, partida en dos", "1 palito de apio, reducido a la mitad", "2 hojas de laurel", "algunas ramitas de tomillo fresco", "1 cucharadita de pimentón ahumado", "4 dientes de ajo, con la piel puesta, levemente magullados usando un rodillo", "1 cucharada de harina normal", "1 cucharada de mantequilla sin sal", "4 cucharadas de aguardiente", "110 g / 4oz de salchicha de chorizo ​​curada, finamente picada", "sal y pimienta negra recién molida", "Queso manchego de 110 g / 4 oz, rallado (use parmesano en cambio, si no está disponible)", "4 patatas de chaqueta, al horno", "225g / 8oz de judías verdes cocidas"], "method": ["Para el pollo, caliente el aceite en una sartén a fuego medio y cocine las porciones de pollo, volteándolo con frecuencia, durante aproximadamente 5-6 minutos, o hasta que se dore por todos lados.", "Mientras tanto, llevar el caldo a ebullición en una olla grande. Stud uno de los cuartos de cebolla con los dos dientes y agregar a la sartén junto con los cuartos de cebolla restante, el pollo, zanahoria, apio, hojas de laurel, tomillo, pimentón y ajo. Cocine a fuego lento con cuidado, sin tapar, durante 30-45 minutos, o hasta que el pollo comience a desmoronarse. Retire el pollo de la sartén y coloque en una lata de asar. Cuele el caldo a través de un colador en un recipiente.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para la salsa, devuelva el caldo colado a la sartén, lleve a ebullición y cocine a fuego lento hasta que el líquido se haya reducido a la mitad.", "En un tazón, para la salsa, mezcle la harina y la mantequilla para hacer una pasta (esto, en términos de chef, es una beurre manié). Batir esta pasta en el caldo junto con el brandy y cocinar a fuego lento durante 3-4 minutos, hasta que espese y suavice. Agregue el chorizo ​​y condimente, al gusto, con sal y pimienta negra recién molida.", "Vierta esta salsa sobre el pollo en la lata de asar y espolvoree sobre el queso rallado. Transfiera al horno y hornee durante 10-15 minutos, o hasta que el queso burbujee y se dore ligeramente.", "Para servir, coloque porciones del pollo en cuatro platos para servir y sirva con las patatas y las judías verdes."], "url": "www_bbc_co_uk_food_recipes_chorizoandbrandychic_86376", "title": "Chorizo ​​y brandy de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de chorizo, en rodajas", "85g / 3oz de papas nuevas, cocidas y en rodajas", "1 cebolleta, picada", "sal y pimienta negra recién molida", "1 huevo de gallina, escalfado, para servir"], "method": ["Calentar una sartén y freír el chorizo ​​durante 2-3 minutos, revolviendo con frecuencia.", "Agregue las papas cocidas en rodajas y la cebolla tierna y cocine suavemente, revolviendo ocasionalmente, durante cinco minutos.", "Triture un poco las papas con un tenedor y mezcle bien para combinar los ingredientes. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el chorizo ​​y el hash de papa en un plato para servir y cubra con un huevo escalfado."], "url": "www_bbc_co_uk_food_recipes_chorizoandpotatohash_86059", "title": "Chorizo ​​y papa hash con huevo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta 1½fl oz de agua, a temperatura ambiente", "2 x 7 g / ¼ onza de sachets de levadura seca de acción rápida", "1 cucharada de azúcar en polvo", "1 cucharada de aceite de oliva extra virgen", "1 kg / 2 lb 3¼ oz tipo harina '00', más extra para quitar el polvo", "½-1 cucharadita de sal", "puñado de aceitunas negras, hoyos eliminados, finamente picados", "2 cucharadas de aceite de oliva", "1 chorizo, finamente picado", "10 tomates de ciruela, picados", "3 dientes de ajo, aplastados hasta formar una pasta con el filo de un cuchillo", "hojas pequeñas de albahaca, finamente picadas", "1 cucharadita de azúcar en polvo", "¼ cucharadita de sal", "pimienta negra recién molida", "salsa de tomate recién hecha (ver arriba)", "200g / 7¼ oz de chile jalapeño, picado", "Corazones de alcachofa de 200 g / 7¼ oz, picados", "200g / 7¼oz de queso Roquefort, o queso azul fuerte similar, se desmenuzaron en pedazos grandes", "2 cucharadas de orégano fresco picado", "ensalada de cohetes, para servir"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Para las bases de pizzetta, en una jarra, mezcle el agua, la levadura, el azúcar y el aceite de oliva hasta que estén bien combinados (este es el iniciador).", "Tamiza la harina y la sal en un tazón grande. Haga un pozo en el centro, luego vierta la mezcla de inicio en el pozo y agregue las aceitunas picadas. Revuelva hasta que la mezcla se una como masa y esté bien combinada.", "Extienda la mezcla de masa en una superficie de trabajo ligeramente enharinada y amasar durante 3-4 minutos hasta que quede suave.", "Divida la masa en 20 porciones iguales y enrolle en bolas (cada porción debe ser del tamaño de una pelota de tenis). Coloque las bolas de masa en una bandeja para hornear y cúbralas con un paño húmedo, luego déjelas a un lado en un lugar cálido durante 18-20 minutos, o hasta que las bolas hayan doblado su tamaño.", "En una superficie de trabajo ligeramente enharinada, aplaste cada bola de masa con las manos para formar bases de pizzetta que tengan 2,5 cm de grosor y 5 cm de diámetro. Dejar de lado.", "Para la salsa de tomate, caliente el aceite en una sartén a fuego medio. Agregue el chorizo ​​picado y fría por 3-4 minutos, o hasta que el chorizo ​​esté fragante y crujiente.", "Agregue los tomates y el ajo, revuelva bien y traiga la mezcla a fuego lento. Continúe cocinando a fuego lento durante 25-30 minutos, o hasta que los tomates se hayan descompuesto. Agregue las hojas de albahaca y el azúcar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el aderezo, extender media cucharada de salsa de tomate en cada una de las bases pizzetta. Espolvorea los ingredientes superiores.", "Transfiera la pizzette a un horno caliente y hornee durante 8-10 minutos, o hasta que las bases estén crujientes y doradas, el queso se haya derretido y los ingredientes de cobertura se hayan suavizado y coloreado.", "Para servir, corte la pizzette y coloque un puñado de ensalada de rúcula al costado."], "url": "www_bbc_co_uk_food_recipes_chorizoartichokeandt_91279", "title": "Chori, Oh pollo d y tomate Pittsu", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "500g / 1lb 2oz muslos de pollo", "1 cebolla, en rodajas", "1 diente de ajo, en rodajas", "2 zanahorias picadas", "1 tallo de apio, picado", "1 chile rojo, sin semillas y picado", "salpicaduras de vino tinto", "275 g / 9½ oz de chorizo, picado", "100ml / 3½fl oz de jerez seco", "1 x 400 g / 14 oz pueden cortar tomates", "200ml / 7fl oz de caldo de pollo", "1 x 400 g / 14 oz pueden garbanzos, enjuagados y drenados", "sal y pimienta negra recién molida", "puñado de perejil fresco picado", "pan crujiente, para servir"], "method": ["Calienta la mitad del aceite vegetal en una sartén grande. Agregue los muslos de pollo y fríelos, volteándolos con frecuencia, hasta que estén ligeramente dorados. Sacar de la sartén y mantenga caliente.", "Agregue un poco más de aceite a la sartén, luego agregue la cebolla, el ajo, las zanahorias, el apio y el chile y cocine durante cinco minutos. Agregue un poco de vino tinto y cocine a fuego lento hasta que se reduzca a la mitad.", "En otra sartén, caliente el aceite restante y fría el chorizo ​​durante 2-3 minutos. Agregue el jerez y cocine hasta que el chorizo ​​esté crujiente. Dejar de lado.", "Agregue la lata de tomates picados a la sartén con las verduras y deje que hierva. Cocine por cinco minutos, luego agregue el caldo y vuelva a hervir.", "Agregue el pollo dorado, los garbanzos y el chorizo ​​crujiente y cocine a fuego lento durante 20-25 minutos, o hasta que el pollo esté completamente cocido. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Espolvorear con perejil picado y servir con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_chorizochickenandchi_87895", "title": "Chorizo, pollo y cazuela de garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizochickenandchi_87895_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 175 g / 6oz de pechugas de pollo sin hueso, sin piel", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 chalote de plátano, finamente picado", "175g / 6oz de chorizo, finamente picado", "2 cucharadas de perejil de flatleaf fresco picado", "1 limón, ralladura solamente", "300 g / 10 oz de chorizo ​​semicurado, picado", "450g1lb de patatas nuevas, cocidas y cortadas en cuartos", "250g / 8oz de tomates cherry, cortados por la mitad", "3 cucharadas de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla", "600g / 1lb 6oz de espinaca de hojas de bebé", "sal y pimienta negra recién molida"], "method": ["Para el pollo, precaliente el horno a 200C / 400F / Gas 6.", "Con un cuchillo, haga un corte profundo en el costado de cada pechuga de pollo para crear un bolsillo. Sazone cada pechuga de pollo, al gusto, con sal y pimienta negra recién molida.", "Caliente una cucharada de aceite de oliva en una sartén a fuego medio, agregue la chalota y fría por 1-2 minutos, o hasta que se suavice. Retire del fuego.", "En un tazón, mezcle la chalota, el chorizo, el perejil y la ralladura de limón hasta que estén bien combinados. Sazonar, al gusto, con pimienta negra recién molida.", "Llene cada pechuga de pollo con la mezcla de chorizo.", "Caliente el aceite de oliva restante en una sartén separada a prueba de horno a fuego alto, agregue las pechugas de pollo rellenas y fría por 1-2 minutos por cada lado, o hasta que estén doradas por ambos lados.", "Transfiera al horno y cocine por 15-18 minutos, o hasta que esté completamente cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho.) Retire las pechugas de pollo de la sartén y déjelas a un lado sobre un plato tibio para que descanse.", "Mientras tanto, para el chorizo ​​salteado y las papas, caliente una sartén por separado a fuego medio, agregue el chorizo ​​y fría por 2-3 minutos, o hasta que el aceite salga del chorizo.", "Agregue las papas y fríe durante 3-4 minutos, o hasta que estén crujientes y doradas.", "Agregue los tomates y fríalos durante 2-3 minutos más, o hasta que se ablanden.", "Agregue el perejil, luego sazone, al gusto, con sal y pimienta negra recién molida y revuelva bien para combinar.", "Para la espinaca, caliente la mantequilla en una sartén por separado a fuego medio hasta que se derrita, agregue las espinacas y fría por 1-2 minutos, o hasta que se marchite. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la espinaca por igual entre cuatro platos para servir. Talla el pollo diagonalmente en tres piezas y coloca las piezas sobre la espinaca. Cucharee el chorizo ​​salteado y las papas al lado. Rocíe sobre los jugos restantes del chorizo."], "url": "www_bbc_co_uk_food_recipes_chorizochickenwithsa_90360", "title": "Pollo al chorizo ​​con chorizo ​​salteado, patatas y espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 oz (150 g) de chorizo", "1 pimiento rojo pequeño", "1 cucharadita redondeada de pimentón caliente", "1 cebolla mediana", "10 oz (275 g) de patatas Desirée o King Edward", "4 cucharadas de aceite de oliva", "1 diente de ajo graso, pelado y aplastado", "2 huevos grandes y muy frescos", "sal y pimienta negra recién molida"], "method": ["Primero, la cebolla debe pelarse, rebanarse por la mitad y luego cada mitad cortar lo más finamente posible para que termines con formas de media luna. A continuación, divida a la mitad y elimine el pimiento rojo, córtelo en rodajas y córtelo en trozos de ½ pulgada (1 cm). Después de eso, quite la piel de la salchicha de chorizo ​​y córtela en trozos aproximadamente del mismo tamaño que la pimienta.", "Las papas deben lavarse y cortarse en cubos de ½ pulgada (1 cm), dejando la piel puesta. Luego colóquelos en una cacerola y vierta suficiente agua hirviendo del recipiente para cubrirlos casi por completo, luego agregue sal y una tapa y cocine a fuego lento durante 5 minutos antes de escurrirlos en un colador y cubrirlos con un paño limpio para absorber el vapor.", "Luego caliente 2 cucharadas de aceite en la sartén más grande y, cuando esté bastante caliente, agregue la cebolla, la pimienta y el ajo y cocínelos durante unos 6 minutos, hasta que estén suaves y teñidos de marrón en los bordes. A continuación, empuje estos a un lado de la sartén, agregue el chorizo ​​y, manteniendo el fuego bastante alto, cocine durante unos 2 minutos, de nuevo, hasta que se dore bien en los bordes. A continuación, agregue el pimentón y revuelva todo junto, luego retire todo el lote a un plato.", "Ahora agregue otra cucharada de aceite a la sartén y, manteniendo el fuego alto, agregue las papas y el condimento. Revuélvalos en la sartén caliente durante aproximadamente 3 minutos, manteniéndolos en movimiento, hasta que comiencen a dorarse y dorarse en los bordes, luego devuelva el chorizo, la cebolla y el pimiento a la sartén y, con una rebanada de sartén, siga volteando la mezcla. . Continúe cocinando todo durante 5-6 minutos, hasta que todo esté realmente marrón y crujiente. Luego baje la temperatura a su nivel más bajo y, en la otra sartén, fría los huevos con el aceite restante (consulte Cómo freír un huevo, a continuación). Sirva el hash dividido entre las dos placas calentadas con un huevo encima de cada una y tenga mucho ketchup de tomate sobre la mesa."], "url": "www_bbc_co_uk_food_recipes_chorizohashwithpeppe_67954", "title": "Hash de chorizo ​​con pimientos y pimentón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 médula grande, pelada", "100g / 3oz de cuscús", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "1 cebolla roja, finamente rebanada", "100g / 3oz de chorizo, cortado en trozos pequeños", "1 pimiento rojo asado, finamente cortado", "2 tomates maduros de vid, sin semillas y picados", "1 cucharada de perejil, aproximadamente picado", "1 cucharada de menta, más o menos picada", "1 cucharada de cilantro, más o menos picado", "sal y pimienta negra recién molida"], "method": ["Precalentar un horno a 200C / 390F / Gas 6.", "Para la médula rellena de chorizo, pimienta y cuscús, corte longitudinalmente la médula y saque todas las semillas, luego coloque en una bandeja de asar.", "Coloque el cuscús en un recipiente junto con el jugo de limón y suficiente agua hirviendo para cubrir.", "Cubra con una película adhesiva y déjela en remojo durante cinco minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente y luego agregue el aceite de oliva. Agregue la cebolla roja y saltee durante 3-4 minutos hasta que se suavice. Agregue el chorizo ​​y fría por otros dos minutos hasta que quede crujiente y se liberen los jugos. Agregue al cuscús, junto con la pimienta, los tomates y las hierbas.", "Mezcle bien y sazone al gusto con sal y pimienta negra. Cuchara en el centro de las dos mitades de la médula.", "Coloque en el horno durante 20 minutos y cocine hasta que esté caliente y la médula esté tierna.", "Para verificar si la médula está hecha, coloque la punta de un cuchillo en el costado, si ofrece solo un poco de resistencia, hágalo."], "url": "www_bbc_co_uk_food_recipes_chorizopepperandcous_75307", "title": "Chorizo ​​y cuscús rellenos de médula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizopepperandcous_75307_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 x 5cm / 2in tiras de hojaldre confeccionado", "1 salchicha de chorizo ​​de cocina, sin piel", "1 huevo, golpeado", "1 cucharada de aceite de oliva", "½ cebolla roja, finamente rebanada", "2 cucharadas de azúcar moreno", "1 cucharada de puré de tomate", "1 cucharada de vinagre de vino tinto"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Envuelva las tiras de masa alrededor del chorizo ​​y cepille con el huevo batido. Coloque en una bandeja para hornear y coloque en el horno para hornear durante 10 minutos, o hasta que la masa esté dorada.", "Para la mermelada, coloque el aceite en una cacerola a fuego medio. Agregue las cebollas y fría por tres minutos para ablandar. Agregue los ingredientes restantes y cocine durante 7-8 minutos, o hasta que espese.", "Para servir, corte el rollo de salchicha en tres pedazos y colóquelo en un plato con una cucharada de la mermelada al lado."], "url": "www_bbc_co_uk_food_recipes_chorizosausagerollwi_84082", "title": "Chorizo ​​de salchicha con mermelada de cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de chorizo, en rodajas", "1 diente de ajo, picado", "240g / 8½oz de tomates cherry enlatados, escurridos", "125g / 4½ oz de garbanzos enlatados, enjuagados y escurridos", "Aceitunas 50g / 2oz, piedras quitadas", "1 cucharada de aceite de oliva", "75g / 2½oz de patatas nuevas cocidas en conserva, reducidas a la mitad", "2 cucharadas de pan rallado fresco", "1 cucharada de perejil fresco picado"], "method": ["Calentar una olla grande y freír el chorizo ​​durante 2-3 minutos.", "Agregue el ajo y cocine por un minuto. Agregue los tomates cherry, los garbanzos y las aceitunas y cocine por 2-3 minutos.", "En una sartén separada, caliente el aceite de oliva, agregue las papas nuevas y saltee hasta que estén doradas por todos lados. Agregue las papas salteadas al guiso de tomate, luego vierta la mezcla en un plato resistente al horno.", "Precalentar la parrilla a mediano.", "Coloque las migas de pan y el perejil en un tazón pequeño y mezcle. Espolvoree la mezcla de migas de pan sobre el estofado, colóquela debajo de la parrilla y cocínela durante 2-3 minutos, o hasta que esté dorada en la parte superior. Sirve en el plato."], "url": "www_bbc_co_uk_food_recipes_chorizotomatoandchic_85891", "title": "Chorizo, tomate y guiso de garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, ablandada", "Harina normal de 65 g / 2¼ oz", "2 huevos grandes de gallinas camperas", "sal", "2 cebollas rojas grandes, en rodajas", "50 g / 1 oz de azúcar en polvo", "2 cucharadas de aceite de oliva", "1-2 cucharaditas de vinagre balsámico", "sal", "1 hoja de laurel", "½ cucharadita de hojuelas de chile seco", "120ml / 4fl oz de crema doble", "Queso de cabra suave de 200 g / 7 oz (de textura suave en lugar de cerosa)", "100g / 3½oz de nueces peladas, picadas y tostadas", "Cohete 50g / 1¾oz"], "method": ["Para los bollos choux, precaliente el horno a 220 ° C / horno de ventilador 200 ° C / 425 ° F / Gas 7. Engrase y forre una bandeja para hornear.", "Caliente 150 ml / 5 fl oz de agua en una olla. Agregue la mantequilla ablandada en trozos pequeños y deje que la mezcla hierva.", "Cuando la mantequilla se haya derretido, agregue la harina a la mezcla de una sola vez y bata continuamente hasta que la mezcla esté espesa y suave. Continúe batiendo hasta que la masa se desprenda limpiamente de los lados de la sartén.", "Retire la masa de la sartén y colóquela en un bol para que se enfríe.", "Cuando la masa esté fría, bata los huevos en un tazón limpio con un tenedor. Poco a poco agregue la mezcla de huevo batido a la masa, poco a poco, mezclando bien entre cada adición; la mezcla ahora debería estar en consistencia decreciente, pero aún lo suficientemente firme como para ser canalizada en una manga pastelera. (Puede que no necesite usar todo el huevo batido).", "Transfiera la mezcla a una manga pastelera equipada con una boquilla simple de 1 cm / ½ in. Pipe la pastelería en pequeños círculos de unos 5 cm en la bandeja de horno preparada.", "Hornee por 10-15 minutos y luego reduzca el calor a 190C / fan oven 170C / 375F / Gas 5 y cocine por otros 20-25 minutos, o hasta que estén doradas y secas. Retire del horno y transfiera a una rejilla para enfriar.", "Para las cebollas rojas caramelizadas, coloque todos los ingredientes en una sartén y cocine durante 20 minutos a fuego lento. Retirar del fuego y dejar enfriar.", "Para el relleno, mezcle la crema en el queso de cabra en un tazón. Coloque la mezcla en una manga pastelera equipada con una boquilla de estrella ancha.", "Corta cada bollo de choux por la mitad y coloca el queso de cabra encima de cada bollo de choux a la mitad. Agregue una cucharadita de cebolla y cubra con una nuez y un pequeño cohete."], "url": "www_bbc_co_uk_food_recipes_choux_buns_filled_with_18960", "title": "Bollos de choux llenos de savia", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace alrededor de 15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de fideos de huevo", "2 cucharadas de aceite de sésamo", "Pechuga de pollo 100g / 4oz, pelada", "2½ cucharadas de ajo finamente picado", "Mangetout 50g / 2oz, recortado", "50 g / 2 oz de jamón de Parma o jamón cocido, finamente triturado", "2 cucharaditas de salsa de soja ligera", "2 cucharaditas de salsa de soja oscura", "1 cucharada de vino de arroz Shaoxing o jerez seco", "½ cucharadita de sal", "½ cucharadita de pimienta blanca recién molida", "½ cucharadita de azúcar", "3 cucharadas de cebolletas finamente picadas", "2 cucharaditas de aceite de sésamo", "2 cucharaditas de salsa de soja ligera", "2 cucharaditas de vino de arroz Shaoxing o jerez seco", "1 cucharadita de aceite de sésamo", "½ cucharadita de sal", "½ cucharadita de pimienta blanca recién molida"], "method": ["Cocine los fideos hirviéndolos por 3-5 minutos en una olla con agua hirviendo. Escurrir y sumergir en agua fría, escurrir de nuevo y luego mezclar con un poco de aceite de sésamo.", "Con una cuchilla, corte las pechugas de pollo en trozos finos de aproximadamente 5 cm (2 pulgadas) de largo.", "Para marinar el pollo, combine el pollo con la salsa ligera de soja, el vino de arroz, el aceite de sésamo, la sal y la pimienta en un tazón pequeño.", "Mezcle bien y deje macerar durante 20 minutos.", "Calentar un wok hasta que esté muy caliente. Agregue una cucharada de aceite y, cuando esté muy caliente y ligeramente humeante, agregue trozos de pollo.", "Sofreír la mezcla durante unos dos minutos y luego transferirla a un plato.", "Vuelva a calentar el wok y agregue el aceite restante. Agregue el ajo y saltee por 10 segundos. Agregue el mangetout y el jamón y fría por un minuto.", "Agregue los fideos, la salsa de soja liviana, la salsa de soya oscura, el vino de arroz, la sal y la pimienta, el azúcar y las cebollas tiernas y continúe revolviendo por dos minutos.", "Regrese el pollo a la mezcla de fideos.", "Continúe freír durante 3-4 minutos, hasta que el pollo esté cocido.", "Agregue el aceite de sésamo y dé unas últimas sacudidas.", "Gire a la bandeja de servir caliente y sirva a la vez."], "url": "www_bbc_co_uk_food_recipes_chowmein_74002", "title": "Chow mein", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chowmein_74002_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 lonchas de tocino ahumado ahumado, sin corteza", "25g / 1oz de mantequilla", "500 g / 1 libra 2 oz de setas silvestres mezcladas (como ostra, shiitake o chanterelle), limpiadas, cortadas aproximadamente", "1 cucharada de aceite de oliva", "4 rebanadas de pan de masa fermentada", "1 cucharada de aceite vegetal", "4 huevos de pato infundidos con trufa", "1 cucharada de perejil fresco picado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las lonchas de tocino en una bandeja para hornear, luego coloque una segunda bandeja para hornear encima. Transfiera al horno y cocine durante 5-8 minutos, o hasta que las lonjas de tocino estén crujientes, doradas y cocidas. Dejar enfriar por 10 minutos.", "Calentar una sartén a fuego medio. Agregue la mantequilla y, cuando esté espumante, agregue los hongos mezclados picados y fría por 3-4 minutos, o hasta que estén dorados.", "Mientras tanto, caliente una sartén a fuego medio. Rocíe el aceite de oliva sobre el pan de masa fermentada. Ase las rebanadas de pan, en lotes, durante 1-2 minutos en cada lado, o hasta que aparezcan marcas doradas a ambos lados del pan. Repita el proceso con las rebanadas restantes de pan de masa fermentada. Mantener caliente", "Mientras tanto, caliente el aceite vegetal en una sartén pequeña a fuego alto. Cuando el aceite esté caliente, agriete los huevos de pato con trufa infundida en la sartén, en tandas si es necesario. Cocine por 1-2 minutos, o hasta que los blancos estén cocidos, pero la yema esté líquida. Retire de la sartén y reserve. Repita el proceso con los huevos de pato infundidos con trufa restantes.", "Para servir, coloque una pieza de pan de masa fermentada a la parrilla en el centro de cada uno de los cuatro platos. Coloque un huevo de pato trufado encima de cada rebanada de pan. Coloque dos lonchas de tocino crujiente a cada lado. Coloque los champiñones mezclados al lado y espolvoree sobre el perejil picado."], "url": "www_bbc_co_uk_food_recipes_chrisevansbigbreakfa_92550", "title": "Gran desayuno de Chris Evans", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4½fl oz de agua helada", "4 manzanas medianas de postre, peladas, cortadas a la mitad longitudinalmente y sin corazón", "Mantequilla 110g / 4oz, derretida", "75g / 3oz de azúcar en polvo", "Sultanas 110 g / 4oz", "50 g / 2 oz de azúcar moreno oscuro", "½ cucharadita de especias mixtas molidas", "½ cucharadita de canela molida", "115g / 4 oz de azúcar morena oscura", "115g / 4oz de mantequilla", "Crema doble 175ml / 6fl oz"], "method": ["Para la masa de hojaldre basta, ponga la harina en un montículo en la superficie de trabajo y haga un pozo en el centro. Coloque la mantequilla y la sal en el pocillo y trabaje con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano.", "Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, agregue gradualmente el agua helada y mezcle hasta que esté todo incorporado, pero no trabaje demasiado la masa.", "Enróllalo en una bola, envuélvelo en una película adhesiva y refrigéralo por 20 minutos.", "Enharine la superficie de trabajo y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas.", "Dóblalo en tres, doblando el tercio exterior de cada lado sobre la sección central, luego dale un cuarto de vuelta.", "Enrolle el bloque de masa en un rectángulo de 40 x 20 cm como antes y vuelva a doblarlo en tres.", "Estos son los primeros dos turnos. Envuelva el bloque en una película adhesiva y refrigere durante 30 minutos.", "Dale a la masa helada otras dos vueltas, rodando y doblando como antes. Esto hace un total de cuatro giros, y la masa ya está lista.", "Envuélvala en una película adhesiva y refrigérela durante al menos 30 minutos antes de usarla.", "Para las tartaletas, precaliente el horno a 200C / 400F / Gas 6.", "Sobre una superficie liviana enharinada, extienda la masa a un grosor de 3 mm / 1/8 pulgadas.", "Con un cortador de pasteles de 10 cm / 4 in, recorta seis discos y seis formas de hojas pequeñas.", "Cepille una bandeja para hornear con un poco de agua fría y levante la masa con una espátula. Refrigere por 20 minutos.", "Pincha los discos de hojaldre con un tenedor y marca las hojas con un cuchillo para formar las venas.", "Cepille las manzanas a la mitad con mantequilla, espolvoree un poco de azúcar en polvo y déjelas a un lado.", "Mezcle las sultaninas con el azúcar moreno oscuro, las especias y la mantequilla restante en un tazón, luego coloque la mezcla de sultana en el centro de la masa.", "Corta finamente las manzanas, manteniéndolas en su forma original, luego ponlas sobre la mezcla de sultana en la masa y presiona suavemente hacia un lado para que las rebanadas se separen, pero el relleno está cerrado.", "Coloque las formas de las hojas en el borde de la masa y cepille con mantequilla y azúcar. (Coloque en el congelador en esta etapa si lo desea y congele hasta que lo necesite).", "Hornee por 15 minutos, luego espolvoree generosamente con el azúcar impalpable y cocine por otros cinco minutos.", "Saque las tartaletas del horno e inmediatamente colóquelas en una rejilla con una espátula.", "Para la salsa de caramelo, caliente el azúcar y la mantequilla en una cacerola pequeña hasta que se derrita y se combine bien.", "Vierta la crema doble y cocine a fuego lento durante 3-5 minutos o hasta que la mezcla se espese un poco.", "Para servir, deslice la tarta en un plato y sirva con una cucharada de salsa de caramelo."], "url": "www_bbc_co_uk_food_recipes_christmas_apple_tarts_28037", "title": "Tartas de manzana de Navidad", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6 tartaletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jengibre fresco de raíz de 5cm / 2in en pieza, pelado y aproximadamente picado", "2 dientes de ajo, picados", "2 chiles verdes, más o menos picados", "1 cucharada de cilantro molido", "1 cucharada de comino molido", "1 x 160 ml de crema de coco y estaño", "2 limas, solo jugo más 2 limas, cortadas en rodajas, para adornar", "pequeño racimo de cilantro fresco, toscamente picado", "1 cebolla, más o menos picada", "8 gambas grandes de Madagascar, conchas dejados en", "Jengibre de 5cm / 2in, pelado y rallado", "1 cucharada de puré de tomate", "1 chile verde, finamente picado", "2 dientes de ajo", "1 cucharadita de cúrcuma molida", "1 cucharadita de chile rojo en polvo", "1 cucharadita de comino molido", "1 cucharadita de sal masala", "400 g / 14 oz de yogur de estilo griego", "2 limas, solo jugo", "4 pechugas de pollo sin piel deshuesadas, cortadas en trozos", "4 tomates maduros", "1 lima, solo jugo", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "pequeño racimo de cilantro fresco, toscamente picado", "pequeño manojo de menta fresca, solo hojas, más o menos picadas"], "method": ["Para los camarones de coco, mezcle todos los ingredientes de gambas de coco, a excepción de las gambas, hasta obtener una pasta homogénea en un procesador de alimentos.", "Pase los langostinos sobre 4 brochetas de metal grandes, colóquelos en una bandeja para hornear, luego coloque la mezcla de adobo sobre la parte superior y gírela para cubrir completamente las gambas. Cubra y marinado durante al menos 2 horas en la nevera.", "Para el pollo tikka, mezcle todos los ingredientes del pollo tikka, excepto el pollo, hasta obtener una pasta homogénea en un procesador de alimentos limpio.", "Coloque las piezas de pollo en un recipiente, vierta la mezcla sobre el marinado y revuelva para cubrir. Cubra y marinado durante al menos 2 horas en la nevera. Cuando esté marinado, pase las piezas de pollo por brochetas grandes de metal.", "Cuando esté listo para comenzar a cocinar, encienda su barbacoa. Permita que las llamas se enciendan y se apaguen, hasta que las brasas brillen de rojo y comiencen a ponerse blancas.", "Mientras la barbacoa se está calentando, bañe todos los ingredientes de inmersión con una salsa gruesa en un procesador de alimentos limpio.", "Cuando la barbacoa esté lista, coloque los pinchos de gambas sobre los carbones y cocínelos durante 5-8 minutos, volteándolos una vez, hasta que queden carbonizados por ambos lados. Cocine los pinchos de pollo al mismo tiempo, durante 12-15 minutos, o hasta que el pollo esté bien cocido. (El pollo se cuece cuando los jugos se limpian cuando se perfora la carne con un cuchillo y no queda rastro de restos rosados). Alternativamente, caliente una sartén hasta que esté caliente y cocine las gambas y el pollo hasta que estén bien cocidas.", "Para servir, deslice las gambas y el pollo de los pinchos sobre los platos y sirva con una cucharada de salsa al lado, adornada con mitades de lima."], "url": "www_bbc_co_uk_food_recipes_christmas_barbecued_39176", "title": "Gambas de coco a la barbacoa de Navidad y pollo tikka", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30ml / 1fl oz de aguardiente", "100g / 3½oz de arándanos secos", "300g / 10½oz de chocolate negro, roto en trozos", "200g / 7oz de mantequilla", "4 huevos de gallinas camperas", "300g / 10½oz de azúcar mascabado ligero", "Harina normal de 200g / 7oz", "1 cucharadita de especias mixtas", "Pacanas de 100 g / 3½ oz, más o menos picadas", "azúcar glas, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre una lata de 30 x 20 cm / 12 x 8 pulgadas con papel para hornear.", "Calienta suavemente el brandy, agrega los arándanos y déjalos en remojo mientras preparas la mezcla de brownie.", "Derrita el chocolate y la mantequilla en un tazón sobre una fuente de agua hirviendo o en el microondas. Revuelva suavemente hasta que esté suave, luego déjelo a un lado para que se enfríe un poco.", "En un tazón grande, mezcle los huevos y el azúcar hasta que estén pálidos y esponjosos.", "Batir la mezcla de chocolate y mantequilla en los huevos y doblar suavemente la harina, mezclar especias, nueces, arándanos y brandy hasta que esté completamente incorporado.", "Vierta en la lata preparada, alise la superficie y luego hornee en el horno durante 25-30 minutos, o hasta que el brownie esté firme al tacto.", "Dejar enfriar en la lata durante 10 minutos, luego colocar sobre una rejilla de alambre hasta que se enfríe por completo.", "Una vez frío, corta en cuadrados y espolvorea la parte superior con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_christmas_brownies_41164", "title": "Brownies de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_brownies_41164_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pastel de Navidad de 400 g / 14 onzas", "100 g / 3½ oz de chocolate negro", "100g / 3½ oz de chocolate blanco", "rocía, para decorar"], "method": ["Rompa la torta de Navidad en trozos y mezcle en el procesador de alimentos durante unos minutos para convertirla en migajas.", "Divida la mezcla en 12 y forme bolas. Coloque en el refrigerador por un par de horas para reafirmarse.", "Derrita los chocolates en recipientes separados, sobre fuentes de agua hirviendo o en un microondas.", "Haga un agujero en cada bola con una vara de polo, luego sumerja el extremo de la vara en el chocolate derretido y vuelva a colocarlo en el orificio. Repita con los otros palos y deje reposar durante aproximadamente 30 minutos.", "Vuelva a fundir el chocolate si es necesario, luego, con una cucharadita, vierta el chocolate sobre un pastel de pop, sosteniéndolo sobre el tazón. Trabaja rápido para obtener un acabado suave. Toque la torta emergente en el lado del tazón para deshacerse del exceso de chocolate, luego péguelo en un trozo de poliestireno o un colador al revés mientras cubre el resto de los estallidos.", "Una vez que el chocolate se haya endurecido un poco, pero aún esté pegajoso, cúbralo con salpicaduras y déjelo reposar por completo."], "url": "www_bbc_co_uk_food_recipes_christmas_cake_pops_03112", "title": "Pastel de Navidad aparece", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_pops_03112_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de frutas secas mezcladas, como sultanas, pasas y pasas de Corinto", "150g / 5½oz de arándanos secos", "150 g / 5½oz de ciruelas pasas sin hueso", "150g / 5½oz de fechas secas y deshuesadas", "150g / 5½oz de higos secos", "150ml / 5fl oz brandy, más extra opcional para 'alimentar' el pastel", "½ naranja, ralladura fina y jugo solamente", "150g / 5½oz de nueces enteras mezcladas", "150 g / 5½ onzas de mantequilla, suavizadas", "150g / 5½oz de azúcar moreno oscuro", "3 cucharadas de melaza negra o jarabe de fecha, opcional", "3 huevos de gallinas camperas (a temperatura ambiente), batidos", "150g / 5½ oz de harina de auto crianza", "3 cucharadas de especias mixtas molida", "4 cucharadas de mermelada de albaricoque", "750 g / 1 libra 10 oz listos para poner la pasta de azúcar", "Mazapán de 750 g / 1 lb 10 oz", "selección de cintas", "Etiquetas de regalo de pan de jengibre, opcional (ver receta en el enlace)"], "method": ["Coloque la mezcla de frutas secas y arándanos en un tazón. Con unas tijeras de cocina, corte las ciruelas pasas, las dátiles y los higos en trozos pequeños, quitando los tallos y colóquelos en el recipiente. Agregue el brandy y la ralladura de naranja y el jugo, y mezcle bien para combinar. Cubra el recipiente con un gorro de ducha, film transparente o placa y déjelo en un lugar fresco durante al menos 12 horas o, incluso mejor, 2 días.", "Cuando esté listo para hacer el pastel, engrase y forme una lata cuadrada de 20 cm / 8 pulgadas y precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4.", "Extienda las nueces en una bandeja para hornear y pan tostado, revise con frecuencia para asegurarse de que no se quemen, durante 5-10 minutos o hasta que estén fragantes (puede omitir el tostado, pero realmente resalta su sabor). Enfriar, luego cortar las nueces - Me gustan relativamente gruesas para contrastar con la fruta. Apague el horno a 140C / 120C Fan / Gas 1.", "Usando un batidor eléctrico de mano (es difícil batir esta pequeña cantidad en un mezclador independiente), bata la mantequilla y el azúcar durante 5-10 minutos o hasta que quede muy ligero y cremoso. Batir la melaza o jarabe, si se usa. Poco a poco agregue los huevos batidos a la mantequilla y la mezcla de azúcar, batiendo bien después de cada adición. Tamiza la harina y la especia en la mezcla y dóblala. Finalmente, revuelve a través de la fruta empapada, con cualquier líquido que quede en el tazón y las nueces picadas.", "Coloque la mezcla en la lata preparada y alise la superficie con el dorso de una cuchara humedecida en agua caliente. Hornee durante 2 ½ horas o hasta que la torta esté firme al tacto y una brocheta empujada hacia el centro salga limpia. Coloque la lata en una rejilla de alambre. Si desea \"alimentar\" el pastel, déjelo enfriar durante unos 15 minutos, luego pellizque la parte superior con un palillo de cóctel o un pincho, con una profundidad de aproximadamente 3 cm. Cepille alrededor de 1 cucharada de brandy. Déjalo en remojo mientras el pastel se está enfriando. Una vez que el pastel esté frío, quítelo de la lata y envuélvalo en un pergamino fresco para hornear, si lo desea, y luego en papel de aluminio antes de guardarlo en una lata hermética o en un recipiente durante al menos 5 días antes de comerlo. Puede repetir el proceso de alimentación semanalmente durante hasta 5 semanas.", "Cuando esté listo para terminar la torta, caliente suavemente la mermelada de albaricoque y extiéndala sobre la superficie de la torta. Estirar el mazapán hasta aproximadamente el grosor de una moneda de una libra y cubrir todo el pastel. Estire el glaseado de fondant con el mismo grosor y cubra completamente el pastel, presionando hacia abajo para suavizarlo.", "Una vez cubierto en mazapán y fondant. Decora tus pasteles con las cintas y adornos que elijas, colocando los extremos de las cintas debajo de la torta; el peso de la torta los asegurará, aunque se pueden usar alfileres. ¡No olvides quitarlos antes de comer! Si ha hecho etiquetas de regalo de jengibre, átelas a las cintas del pastel, usando cintas reales o cordones de fresa si las usa. Holly y mini bolas se pueden agregar junto o en lugar de las etiquetas, dependiendo del tamaño y el estilo del presente."], "url": "www_bbc_co_uk_food_recipes_christmas_cake_present_81563", "title": "Pastel de Navidad presente", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace pastel cuadrado de 20cm / 8in", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_present_81563_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de frutas secas mezcladas, como sultanas, pasas y pasas de Corinto", "150g / 5½oz de arándanos secos", "150 g / 5½oz de ciruelas pasas sin hueso", "150g / 5½oz de fechas secas y deshuesadas", "150g / 5½oz de higos secos", "150ml / 5fl oz brandy, más extra opcional para 'alimentar' el pastel", "ralladura finamente rallada y jugo de ½ naranja", "150g / 5½oz de nueces enteras mezcladas", "150 g / 5½ onzas de mantequilla, suavizadas", "150g / 5½oz de azúcar moreno oscuro", "3 cucharadas de melaza negra o jarabe de fecha, opcional", "3 huevos de gallinas camperas (a temperatura ambiente), batidos", "150g / 5½ oz de harina de auto crianza", "3 cucharadas de especias mixtas molida", "4 cucharadas de mermelada de albaricoque", "750 g / 1 libra 10 oz listos para poner la pasta de azúcar", "Mazapán de 1kg / 2lb 4 oz", "4 cucharadas de carne picada", "pequeña ramita acebo deja", "glace cerezas o arándanos"], "method": ["Coloque la mezcla de frutas secas y arándanos en un tazón. Con unas tijeras de cocina, corte las ciruelas pasas, las dátiles y los higos en trozos pequeños, quitando los tallos y colóquelos en el recipiente. Agregue el brandy y la ralladura de naranja y el jugo, y mezcle bien para combinar. Cubra el recipiente con un gorro de ducha, film transparente o placa y déjelo en un lugar fresco durante al menos 12 horas o, incluso mejor, 2 días.", "Cuando esté listo para hacer la torta, engrase y forre una lata redonda de fondo suelto de 20cm / 8 pulgadas y precaliente el horno a 180ºC / 160ºC Ventilador / Gas 4.", "Extienda las nueces en una bandeja para hornear y pan tostado, revise con frecuencia para asegurarse de que no se quemen, durante 5-10 minutos o hasta que estén fragantes (puede omitir el tostado, pero realmente resalta su sabor). Enfriar, luego cortar las nueces - Me gustan relativamente gruesas para contrastar con la fruta. Apague el horno a 140C / 120C Fan / Gas 1.", "Usando un batidor eléctrico de mano (es difícil batir esta pequeña cantidad en un mezclador independiente), bata la mantequilla y el azúcar durante 5-10 minutos o hasta que quede muy ligero y cremoso. Batir la melaza o jarabe, si se usa. Poco a poco agregue los huevos a la mezcla de mantequilla y azúcar, batiendo bien después de cada adición. Tamiza la harina y la especia en la mezcla y dóblala. Finalmente, revuelve a través de la fruta empapada, con cualquier líquido que quede en el tazón y las nueces picadas.", "Coloque la mezcla en la lata preparada y alise la superficie con el dorso de una cuchara humedecida en agua caliente. Hornee durante 2 ½ horas o hasta que la torta esté firme al tacto y una brocheta empujada hacia el centro salga limpia. Coloque la lata en una rejilla de alambre. Si desea \"alimentar\" el pastel, déjelo enfriar durante unos 15 minutos, luego pellizque la parte superior con un palillo de cóctel o un pincho, con una profundidad de aproximadamente 3 cm. Cepille alrededor de 1 cucharada de brandy. Déjalo en remojo mientras el pastel se está enfriando. Una vez que el pastel esté frío, quítelo de la lata y envuélvalo en un pergamino fresco para hornear, si lo desea, y luego en papel de aluminio antes de guardarlo en una lata hermética o en un recipiente durante al menos 5 días antes de comerlo. Puede repetir el proceso de alimentación semanalmente durante hasta 5 semanas.", "Cuando esté listo para terminar la torta, caliente suavemente la mermelada de albaricoque y extiéndala sobre la superficie de la torta. Estirar el mazapán hasta aproximadamente el grosor de una moneda de una libra y cubrir todo el pastel. Estire el glaseado de fondant con el mismo grosor y cubra completamente el pastel, presionando hacia abajo para suavizarlo.", "Coloque una plantilla redonda, un plato o una lata de torta redonda más pequeña que el diámetro de su pastel en la parte superior y córtela con un cuchillo o bisturí. Con cuidado, retire el círculo de fondant y mazapán para revelar el círculo interior de su pastel desnudo.", "Usando la plantilla que usaste antes para ayudarte, corta una forma de natilla simple del círculo de mazapán. Presione esto en la parte superior de su círculo recortado para crear el efecto de crema. Luego, con cuidado, ponga un poco de carne picada en el resto de la forma cortada para producir un pudín con aspecto regordete, o deje de lado por completo si lo desea. Finalmente coloque y coloque su acebo, cerezas o arándanos en la parte superior de la forma del pudín para terminar."], "url": "www_bbc_co_uk_food_recipes_christmas_cake_pudding_88064", "title": "Pastel de pudín de Navidad", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace pastel de 20 cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_cake_pudding_88064_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["9 zanahorias medianas, peladas, cubiertas y de cola", "250g / 9oz de mantequilla", "150 g / 5½ oz de azúcar", "3 cucharaditas de sal", "Anís de 4 estrellas"], "method": ["Use un estropajo limpio para suavizar las zanahorias y eliminar las marcas de cáscara (opcional).", "En una sartén combine 400 ml / 14 fl oz de agua, la mantequilla, el azúcar, la sal y el anís estrellado. Llevar a ebullición, luego reduzca el fuego a fuego lento y agregue las zanahorias. Cocine hasta que las zanahorias estén tiernas (aproximadamente 45 minutos) y el volumen del líquido se haya reducido a la mitad.", "Sirva las zanahorias como guarnición con el líquido de cocción reducido vertido."], "url": "www_bbc_co_uk_food_recipes_christmas_carrots_90489", "title": "Zanahorias de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_carrots_90489_16x9.jpg", "isVegetarian": true, "recommendations": 0}]