[{"ingredients": ["2.5cm / 1 en pieza de jengibre fresco, pelado, picado", "4 hojas de lima finamente picadas", "3 chiles rojos, finamente picados", "2 tallos de limoncillo, parte externa dura eliminada, parte interna blanda finamente picada", "440ml / 15½fl oz de leche de coco enlatada", "1 lima, solo jugo", "1 cucharada de salsa de pescado", "4 x 150 g / 6oz de filetes de pescado blanco (como bacalao, eglefino, merlán o abadejo), sin piel", "200 g / 7 oz de arroz jazmín, cocido de acuerdo con las instrucciones del paquete, para servir"], "method": ["Coloque el jengibre picado, las hojas de lima, los chiles y el limoncillo en un tazón. Vierta la leche de coco, el jugo de lima y la salsa de pescado y mezcle hasta que estén bien combinados. Agregue los filetes de pescado y mezcle con la mezcla de adobo hasta que esté completamente cubierto. Déjalo marinar durante al menos dos horas.", "Cuando el pescado se haya marinado, precaliente el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque cuatro hojas grandes de pergamino para hornear en una superficie de trabajo. Levante un filete de pescado marinado de la mezcla de adobo y sacuda el exceso de líquido. Colóquelo en el centro de una de las hojas del pergamino para hornear. Repita el proceso con los tres filetes de pescado restantes.", "Cuele la mezcla de adobo sobre un tazón. Con una cuchara, coloque los trozos de chile, hierba de limón, jengibre y lima sobre los filetes de pescado y deje a un lado el líquido recogido en el recipiente.", "Traiga los bordes de cada pedazo de pergamino para hornear alrededor del pescado y doble para sellar. Coloque los cuatro paquetes de pergamino para hornear en una bandeja de horno y transfiéralos al horno. Hornea por 15-20 minutos.", "Mientras tanto, llevar el líquido de adobo reservado a ebullición en una sartén. Continúe hirviendo durante 3-4 minutos, o hasta que la salsa se haya espesado ligeramente.", "Para servir, desenvuelva los paquetes de pergamino para hornear y transfiera cada filete de pescado cocido a un plato de servir. Coloque el arroz jazmín al lado. Cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_thaistylefishparcels_91471", "title": "Peces de estilo tailandés", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 chile rojo, picado", "1 diente de ajo, picado", "Jengibre de raíz de 2.5cm / 1in, pelado y rallado", "3 bulbos pequeños pak choi, hojas separadas", "2 cucharadas de salsa de soja", "2 cucharaditas de aceite de sésamo", "½ lima, solo jugo", "Fideos de huevo secos de 150g / 5½oz cocidos de acuerdo con las instrucciones del paquete", "cuñas de lima, para adornar"], "method": ["Caliente el aceite en un wok o en una sartén grande, agregue el chile, el ajo y el jengibre y saltee por un minuto.", "Agregue el pak choi y saltee durante 1-2 minutos, o hasta que comience a marchitarse.", "Agregue la salsa de soja, el aceite de sésamo y el jugo de lima y cocine a fuego lento durante 1-2 minutos.", "Agregue los fideos cocidos y revuelva bien.", "Para servir, coloque la ensalada en un recipiente para servir y adorne con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_thaistylenoodlesalad_86051", "title": "Ensalada de fideos de estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 cabezas y caparazones de langostinos tigre", "guión de aceite vegetal", "½ cebolla, finamente rebanada", "1 diente de ajo, picado", "1 tallo de limoncillo, capas externas eliminadas, finamente cortadas", "8 tomates cherry, cortados a la mitad", "300ml / ½ pinta de agua hirviendo", "2 cucharaditas de salsa de soja", "4 hongos shiitake, en rodajas", "5 gambas de tigre crudas", "2 cucharadas de cebolletas frescas picadas", "1 dedo de limón, solo semillas", "cilantro fresco picado, para adornar"], "method": ["Coloque las cabezas de gambas y las cáscaras en una cacerola, agregue el aceite y la cebolla y fría por 2-3 minutos.", "Agregue el lemongrass, la mitad de los tomates y toda el agua hirviendo. Cocine a fuego lento durante diez minutos.", "Colar a través de un colador en una sartén limpia. Agregue la salsa de soja, los champiñones, los tomates cherry restantes y las gambas y cocine a fuego lento durante tres minutos, o hasta que las gambas se hayan puesto rosadas.", "Agregue las cebolletas y las semillas de lima. Vierta en un recipiente para servir y decore con cilantro picado."], "url": "www_bbc_co_uk_food_recipes_thaistyleprawnshiita_87951", "title": "Gamba de estilo tailandés, hongos shiitake y caldo de hierba de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vinagre de vino de arroz de 200ml / 7fl oz", "2 cucharadas de azúcar en polvo", "1 chili verde pequeño, finamente cortado", "2 cebollas rojas grandes, finamente cortadas", "½ repollo puntiagudo, finamente cortado", "2 chiles rojos frescos, picados", "2 chiles rojos secos, picados", "Jengibre fresco de 2,5 cm / 1 onza, aproximadamente picado", "2 tallos de limoncillo, toscamente picados", "3 dientes de ajo, pelados", "3 chalotes tailandeses (o chalotes comunes), toscamente picados", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "2 hojas de lima, finamente picadas", "¼ cucharadita de pasta de camarones tailandeses", "½ lima, solo jugo", "2 cucharadas de aceite de maní", "4 caballas enteras, limpiadas y fileteadas"], "method": ["Para el repollo encurtido y las cebollas, coloque el vinagre y el azúcar en polvo en una olla no reactiva y deje que hierva.", "Coloque la guindilla, la cebolla y el repollo en un tazón, luego vierta sobre el vinagre caliente. Cubra el recipiente y déjelo a un lado durante 30 minutos.", "Precalentar la parrilla a alto.", "Para la caballa roja de estilo tailandés, coloque todos los ingredientes, excepto la caballa, en un mortero o procesador de alimentos y mezcle para obtener una pasta homogénea.", "Extienda la pasta sobre la carne de caballa y coloque los filetes con la piel hacia abajo sobre una bandeja para asar. Coloque debajo de la parrilla y cocine durante 3-4 minutos, o hasta que estén cocidos.", "Para servir, coloque los filetes de caballa en platos para servir con un montón de repollo encurtido y cebollas."], "url": "www_bbc_co_uk_food_recipes_thaistyleredmackerel_87483", "title": "Caballa roja de estilo tailandés con repollo en vinagre y cebollas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ chile rojo, finamente picado", "1 diente de ajo, picado", "½ cebolla, finamente picada", "½ cabeza de brócoli, cortada en florecillas, tallo cortado en pedazos", "2 limas, solo jugo", "150ml / ¼ pinta de caldo de pollo caliente", "2 cucharaditas de salsa de soja", "Salmón 55 g / 2 oz, cortado en cubos de 2 cm / 1 in", "Fideos de huevo mediano de 55 g / 2 oz, cocidos de acuerdo con las instrucciones del paquete y escurridos"], "method": ["Coloque todos los ingredientes excepto el salmón y los fideos en una sartén, agregue un poco de agua, si es necesario, para cubrir completamente los ingredientes. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 4-5 minutos.", "Agregue el salmón al caldo y cocine a fuego lento durante 3-4 minutos, o hasta que el salmón esté bien cocido y el brócoli esté tierno. Agregue los fideos y revuelva para mezclar.", "Para servir, vierta el caldo en un tazón."], "url": "www_bbc_co_uk_food_recipes_thaistylesalmonandno_85360", "title": "Caldo de salmón y fideos de estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 filete de lubina", "100g / 4oz de arroz fragante tailandés, cocinado según las instrucciones del paquete, mantenido caliente", "3 chalotes, en rodajas y fritos", "½ chili, picado", "puñado de cilantro fresco, picado", "1 cucharada de agua", "150 g / 5 oz espinacas, lavadas y picadas", "sal y pimienta negra recién molida", "1 cucharada de salsa de soja", "1 cucharadita de aceite de sésamo", "1 cucharadita de chile picado", "Zumo de 1 lima"], "method": ["Calentar una cucharada de aceite de oliva en una sartén. Agregue la lubina y el pan frito, con la piel hacia abajo, durante 2-3 minutos. Dé la vuelta al filete y cocine por otro minuto, luego déjelo a un lado.", "Mezcle el arroz tibio con los chalotes, el chile y el cilantro.", "Cocine las espinacas en una sartén caliente con una cucharada de agua hasta que estén completamente marchitas y tiernas. Escurrir y sazonar al gusto con sal y pimienta negra recién molida.", "Para preparar el aderezo, mezcle la salsa de soja, el aceite de sésamo, el chile picado y el jugo de lima.", "Sirva el arroz en el centro de un plato, cubra con la espinaca y el filete de lubina. Luego vierta sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_thaistyleseabass_78365", "title": "Lubina de estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de lubina", "1 cucharadita de aceite de oliva", "2 dientes de ajo, aplastados", "1 tallo de limoncillo, finamente picado", "1 cucharadita de hojas frescas de tomillo", "puñado de cilantro fresco, picado", "½ chili, picado", "1 cucharada de salsa de soja", "1 cucharadita de aceite de sésamo", "1 cucharadita de chile picado"], "method": ["Ponga a hervir una olla grande de agua y coloque un cocedor de vapor de bambú sobre la parte superior.", "Frote el filete de lubina con aceite de oliva, ajo, tomillo, hierba de limón, cilantro y chile. Coloque el filete en un pedazo de papel de aluminio y transfiéralo al vaporizador o al colador. Cubra y deje hervir durante 3-5 minutos o hasta que esté completamente cocido.", "Para el aderezo mezcle la soja, el aceite de sésamo y el chile juntos.", "Para servir, coloca la lubina en un plato y vierte sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_thaistylesteamedseab_78366", "title": "Lubina al vapor estilo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo", "Crema doble de 150 ml / 1/4 de pinta", "gran cilantro fresco puñado", "pizca de copos de chile", "½ zanahoria, cortada en bastones", "1 cucharada de aceite vegetal", "1 pak choi, descuartizado", "300ml / 10fl oz de aceite vegetal, para freír", "Fideos de huevo 125g / 4½ oz, blanqueados y drenados bien", "cilantro fresco, para adornar"], "method": ["Para el caldo, coloque el ajo, la crema, el cilantro y las hojuelas de chile en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Verter la mezcla en una sartén grande o wok y llevar a ebullición. Agregue los bastones de zanahoria y cocínelos durante 4-5 minutos, o hasta que estén tiernos.", "Caliente el aceite vegetal en una sartén separada, agregue el pak choi y fría por 1-2 minutos en cada lado. Coloque las piezas de pak choi en dos tazones para servir y vierta sobre el caldo.", "Mientras tanto, para los fideos crujientes fritos, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotea y se dore cuando se deja caer en él. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los fideos blanqueados en el aceite caliente y fría durante 1-2 minutos, o hasta que estén crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque los fideos crujientes encima del caldo en cada tazón y adorne con cilantro."], "url": "www_bbc_co_uk_food_recipes_thaistylevegetablebr_85660", "title": "Caldo de verduras de estilo tailandés con fideos fritos crujientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["10 papas grandes King Edward, peladas, cortadas en trozos grandes", "50 g / 1¾oz de manteca de cerdo, goteo o aceite vegetal", "2 pizcas de sal marina"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cocine a fuego lento las papas en una sartén grande con agua hirviendo con sal durante 4-5 minutos, o hasta que la parte exterior de las papas esté comenzando a ablandarse.", "Escurre bien las papas y agítelas brevemente en el colador o en la sartén para hacer ásperos los bordes.", "Derrita la manteca en una bandeja de asar a prueba de llamas a fuego alto y fría las papas de cada lado hasta que comiencen a dorarse.", "Espolvorear con sal, probar y tostar durante 30 minutos o hasta que comience a colorear.", "Voltee las papas y vuelva al horno durante otros 20-30 minutos, o hasta que estén doradas y crujientes."], "url": "www_bbc_co_uk_food_recipes_the_best_roast_potatoes_95083", "title": "Las mejores patatas asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/the_best_roast_potatoes_95083_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal", "280g / 10oz de azúcar morena mascabado", "4 huevos grandes de gallinas camperas", "1 cucharadita de aceite de naranja", "Harina de auto aumento 320g / 11¼ oz", "2 cucharaditas de bicarbonato de soda", "2 cucharaditas de canela molida", "½ cucharadita de nuez moscada molida", "2 cucharaditas de jengibre molido", "1 cucharadita de clavo de olor molido", "½ cucharadita de sal", "320g / 11¼ oz de zanahorias ralladas", "160g / 5¾oz sultanas", "Tuercas de pacanas 170g / 6oz, tostadas y picadas", "1 naranja, cáscara y jugo solamente", "1 naranja, solo jugo", "50 g / 1 oz de azúcar en polvo", "125g / 4½oz de mantequilla sin sal", "250 g / 9 oz de azúcar glas", "1 cucharadita de pasta de vainilla", "1 aceite anaranjado capful", "375g / 13oz de queso crema", "colorante de comida naranja", "colorante de comida verde", "12 nueces de nuez pecan"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forme la base de una lata de torta con forma de resorte de 23 cm / 9 pulg.", "Para la torta, derrita la mantequilla en una cacerola y luego mezcle el azúcar, los huevos y el aceite de naranja hasta que estén suaves y bien combinados.", "Tamiza la harina, el bicarbonato de soda y las especias molidas en un tazón grande. Agregue la sal. Dobla la mezcla de mantequilla en los ingredientes secos hasta que se combinen. Doble las zanahorias, pasas, nueces, ralladura de naranja y jugo. Vierta la mezcla en la lata preparada y hornee durante 1 hora, o hasta que una brocheta salga limpia cuando se inserte en el medio (verifique después de 45 minutos y cubra la parte superior de la torta con papel para hornear si la torta se está dorando demasiado). Dejar enfriar en la lata durante unos minutos y luego transferir a una rejilla para que se enfríe por completo.", "Para el glaseado, ponga el jugo de naranja y el azúcar en una cacerola y cocine hasta que el volumen del líquido se reduzca a un glaseado pegajoso. Cepille la parte superior de la torta con el glaseado mientras aún esté caliente.", "Para la formación de hielo, batir lentamente la mantequilla y el azúcar glas juntos con una batidora eléctrica. Cuando se combinan, agregue la pasta de vainilla y el aceite de naranja. Continúe mezclándolo por unos minutos más hasta que esté suave y esponjoso. Con la batidora a la velocidad más lenta, agregue el queso crema poco a poco hasta que se haya incorporado.", "Aparte un cuarto de la formación de hielo y agregue un poco de colorante para alimentos de color naranja, transfiéralo a una manga pastelera equipada con una boquilla de tejido de canasta. Ponga a un lado unas pocas cucharadas de glaseado, mezcle el colorante verde para alimentos y transfiéralo a una manga pastelera equipada con una boquilla pequeña y lisa. (Los glaseados de colores se usarán para hacer una forma de zanahoria en la parte superior de la torta).", "Corte el pastel enfriado por la mitad horizontalmente y extienda un tercio del glaseado simple en la capa inferior, luego vuelva a colocar la parte superior. Cuidadosamente cubra la parte superior y los lados del pastel con glaseado. Separe para permitir que la formación de hielo se convierta en una costra. Transfiera cualquier resto de glaseado liso restante a una manga pastelera equipada con una pequeña boquilla estrella.", "Para las decoraciones, vierta una zanahoria en la parte superior de la torta con los glaseados de naranja y verde. Pipe estrellas de la formación de hielo plana en la parte inferior de la torta. Decora los lados del pastel con las mitades de nuez, usando un poco de hielo adicional para ayudarlos a pegarse."], "url": "www_bbc_co_uk_food_recipes_the_colossal_curly_34564", "title": "Pastel de zanahoria colosal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 x 23 cm / 9 en pastel", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["20g / ¾oz hojas sueltas Earl Grey tea", "1 x 750 ml de ginebra", "40ml / 1½fl oz Earl Grey infusión ginebra", "30ml / 1fl onza de ginebra regular (no la ginebra infundida)", "30ml / 1fl oz de jugo de limón", "45ml / 1½ fl oz de flor de saúco cordial", "20ml / 1fl oz de jarabe de azúcar", "1 mermelada de lima tsp colmada"], "method": ["Infundir el té Earl Grey de hojas sueltas en la botella de ginebra, agitar y dejar durante exactamente 2 horas. Cuela y vuelve a la botella (no necesitarás toda la ginebra).", "Llenar una coctelera con hielo. Agregue la ginebra impregnada de Earl Grey, la ginebra estándar, el jugo de limón, el cordial de flor de saúco, el jarabe de azúcar y la mermelada de lima. Sacudir.", "Colar en una tetera llena de hielo y servir enfriado en tazas de té con una rodaja de limón fresco. Puede servir con cubitos de hielo en lugar de terrones de azúcar en un lado."], "url": "www_bbc_co_uk_food_recipes_the_earl_47756", "title": "El conde", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de carne de vacuno de 600 g / 1 lb 5 oz, cortado en cubos de 1 cm / ½ en", "25g / 1oz de mantequilla", "1 cebolla, finamente rebanada", "250g / 9 oz de champiñones, en rodajas finas", "1 cucharada de mostaza Dijon", "400ml / 14fl oz de caldo de carne", "1 cucharada de aceite vegetal", "2 cucharadas de crema agria o crème fraiche", "1 cucharada de brandy (opcional)", "perejil finamente picado, para servir", "sal y pimienta negra recién molida"], "method": ["Sazone los filetes de carne con sal y pimienta y déjelos a un lado.", "Calentar la mantequilla en una sartén grande. Agregue las cebollas y saltee durante 2 minutos, luego agregue las setas, cocine hasta que estén suaves. Agregue la mostaza y revuelva en las verduras, cubriéndola bien. Vierta sobre el caldo y deje cocer a fuego lento hasta que el líquido se haya reducido a la mitad. Agregue la crema fresca y reserve por unos minutos.", "En otra sartén grande caliente el aceite vegetal. Cuando esté humeando, agregue los cubos de carne. Revuelva constantemente, hasta que la carne esté dorada por todos lados. Solo quiere que se cocine durante 1 minuto como máximo.", "Si quieres flamear la carne, coloca el brandy en un cucharón y caliéntalo sobre el gas. Cuando comience a quemarse (verá los humos), incline con mucha suavidad hacia la llama y se encenderá (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas). Inmediatamente vierta esto sobre la carne y revuélvala rápidamente.", "Regrese la salsa de cebolla y champiñones al fuego y agregue la carne a la sartén. Sazonar al gusto, espolvorear sobre el perejil y servir."], "url": "www_bbc_co_uk_food_recipes_the_hairy_bikers_beef_14580", "title": "Stroganoff de la carne de los ciclistas de Hairy Bikers", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz hígado de cerdo, pulmones y corazón, cortados en cubitos", "500g / 1lb 2 oz de vientre de cerdo", "2 cebollas, cortadas en cubitos", "algunas hojas frescas de salvia picadas", "algunas ramitas de tomillo fresco, hojas recogidas", "2 dientes de ajo picados", "6 hojas frescas de laurel", "300g / 10½ oz de grasa de caul", "1 litro / 1¾pints de caldo de pollo oscuro"], "method": ["Ponga a hervir una olla grande de agua y agregue la carne picada. Vuelva a hervir, luego escurra la carne y déjela enfriar.", "Precalentar el horno a 150C / 300F / Gas 2.", "Pica la carne, agrégala a un bol y agrega la cebolla, las hierbas y el ajo hasta que estén bien combinados.", "Forme la mezcla en seis bolas, coloque una pequeña hoja de laurel en la parte superior y envuelva la grasa del caul.", "Siente los fagots en una bandeja de asar y vierta el caldo. Cocine los fagots en el horno durante una hora."], "url": "www_bbc_co_uk_food_recipes_the_great_british_faggot_22530", "title": "El gran marica británico", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de alforfón 55g / 2oz", "Harina normal 175g / 6oz", "1 cucharadita de sal", "7 g de levadura seca (una bolsita)", "200g / 7oz de crema fresca", "225ml / 8fl oz de leche entera", "2 claras de huevo grandes de gallinas camperas", "botón de mantequilla"], "method": ["Tamiza las harinas en un tazón grande y agrega la sal y la levadura. Caliente la crème fraiche y la leche en agua tibia en una cacerola. Agregue las yemas de huevo y luego agregue a la mezcla de harina.", "Mezcle bien y cubra con un paño de cocina. Deja crecer durante una hora en un lugar cálido.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos, doblar en la masa y dejar que se levante durante otra hora.", "Cuando esté listo para cocinar los blinis, derrita un poco de mantequilla en una sartén pequeña antiadherente caliente, coloque una mesa de sopa de blini mix en la sartén y luego agregue ½ cucharada más para hacer el medio más grueso. Gire cuando esté firme y cocine hasta que se dore. Dejar enfriar en la rejilla antes de servir."], "url": "www_bbc_co_uk_food_recipes_the_hairy_bikers_blinis_07632", "title": "Los blinis de los Hairy Bikers", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace aproximadamente 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 grandes filetes de trucha, trucha de mar o carbón ártico, deshuesados", "200ml / 7fl oz de leche entera", "2 cucharadas de almendras molidas", "2 cucharadas de harina, condimentada con sal y pimienta", "1 cucharada de aceite de oliva", "50g / 1¾oz de mantequilla", "2 cucharadas de almendras en copos", "2 cucharadas de perejil finamente picado", "1 cucharada de alcaparras picadas", "1 limón, jugo y ralladura"], "method": ["Seque los filetes de pescado con papel de cocina y reserve.", "Tome dos tazones, en uno agregue la leche, en el otro agregue la harina sazonada y las almendras molidas.", "Sumerja los filetes de pescado en la leche y luego presiona la mezcla de harina de almendras hasta que esté completamente recubierta.", "Calentar una sartén y agregar el aceite de oliva y la mitad de la mantequilla. Coloque el pescado en la sartén caliente con la piel hacia arriba y fría durante 2 minutos hasta que la superficie esté dorada y crujiente. Voltee el pescado y cocine en el lado de la piel durante 5 minutos, o hasta que esté bien cocido. Coloque el pescado en un plato caliente y reserve.", "Agregue la mantequilla restante a la sartén, deje que burbujee y luego agregue las almendras en copos y cocine durante unos minutos hasta que estén tostadas. Agregue el perejil, las alcaparras, la ralladura de limón y el jugo. Cálmate por unos 30 segundos.", "Coloque los filetes de pescado en un plato para servir y espolvoree sobre la mezcla de almendras en copos. Sirva con papas nuevas y judías verdes."], "url": "www_bbc_co_uk_food_recipes_the_hairy_bikers_trout_37066", "title": "La trucha almondine de los ciclistas de Hairy Bikers", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/the_hairy_bikers_trout_37066_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 300g / 10½ oz", "40 g / 1½ oz de cacao en polvo", "175g / 6oz de azúcar en polvo", "175g / 6oz de mantequilla sin sal, cortada en cubos", "2 cucharadas de leche", "250g / 9oz de chocolate negro de buena calidad, picado", "6 yemas de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "70g / 2½ oz de harina de maíz", "1 litro / 1¾ pintas de leche", "2 cucharadas de café expreso en polvo", "5 claras de huevo de gallinas camperas", "pizca de sal", "½ cucharadita de jugo de limón", "3 cucharadas de azúcar granulada", "15 g / ½ oz de clara de huevo en polvo", "Melaza 175ml / 6fl oz", "100 g / 3½ oz de azúcar en polvo", "100 ml / 3½ fl oz de agua"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una lata agria de 30cm / 12in.", "Para la masa, coloque la harina, el cacao en polvo y el azúcar en polvo en un procesador de alimentos, agregue la mantequilla y pulse hasta que la mezcla se asemeje a pan rallado. Agregue la leche y mezcle nuevamente hasta que la mezcla se una. Retire la masa del procesador de alimentos y presiónela en el fondo y los lados de la tarta de estaño.", "Alinee la caja para tarta con papel de aluminio, llénela con alubias y hornee a ciegas por 10 a 15 minutos. Retire los frijoles para hornear y papel de aluminio, cubra el borde de la caja de tarta con papel de aluminio para evitar que se queme, y vuelva al horno de 10 a 15 minutos. Retire la caja de tarta del horno y déjela a un lado para que se enfríe.", "Para el relleno de moca, derrita el chocolate en un microondas o en un recipiente suspendido sobre una sartén con agua apenas hirviendo. Batir las yemas de huevo, el azúcar y la harina de maíz hasta que estén pálidas y cremosas.", "Caliente la leche y el café en polvo hasta que hierva a fuego lento, luego mezcle con la mezcla de huevo hasta que estén bien combinados. Vierta la mezcla en la cacerola y cocine a fuego lento, revolviendo todo el tiempo, hasta que la mezcla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara. Batir el chocolate derretido, verter la mezcla en la caja de pastelería y transferir a la nevera durante 1-2 horas.", "Para el merengue, coloque las claras de huevo, la sal y el jugo de limón en el tazón de un mezclador de alimentos, bata lentamente hasta que estén espumosos, luego aumente la velocidad y bata hasta que la mezcla retiene los picos rígidos. Mezcle el azúcar granulado y el polvo de clara de huevo juntos y luego agregue gradualmente a las claras de huevo, batiendo todo el tiempo, hasta que la mezcla esté suave y brillante.", "Caliente la melaza, el azúcar y el agua en una olla pequeña a 110 ° C / 225 ° F y luego vierta en las claras de huevo en una corriente delgada, batiendo hasta que el recipiente esté frío y la mezcla de merengue esté tieso.", "Extienda una fina capa de merengue sobre la superficie del pastel para cubrir completamente el relleno y luego vierta el merengue restante en la parte superior. Usando un soplete, dore ligeramente el merengue y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_the_midnight_meringue_15793", "title": "El merengue de medianoche", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 patata mediana, pelada y cortada en cubos de 1cm / ½ en cubitos", "125 g / 4½ oz de mantequilla", "1 chalote, finamente cortado en cubitos", "2 dientes de ajo, finamente cortados en cubitos", "Puerros de 500 g / 1 libra y 2 onzas, lavados, cortados y rebanados", "100ml / 3½fl oz de vino blanco", "Crema doble 250ml / 9fl oz", "3 ramitas de tomillo fresco, solo hojas", "3 rebanadas de brioche, cortado en cubos de 1cm / ½ en", "Gruyère 50g / 2oz, finamente rallado", "4 filetes de grupa de buena calidad de 4 x 250 g / 9 oz", "1 cucharada de aceite de colza", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hervir los cubos de papa en una sartén de agua con sal durante 3-4 minutos. Escurrir bien y dejar reposar.", "Mientras tanto, derrita 50g / 1¾oz de la mantequilla en una sartén a fuego medio. Agregue la chalota, el ajo y los puerros y fría por 2-3 minutos, o hasta que estén blandos.", "Agregue los cubos de papa escurridos y revuelva cuidadosamente para combinar. Vierte el vino blanco y lleva la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego remueva la crema y las hojas de tomillo y continúe cocinando a fuego lento durante 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. Transfiera la mezcla de papa a un plato resistente al horno.", "Caliente otra mantequilla de 50g / 1¾oz en una sartén separada a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue los cubos de brioche y fría durante 1-2 minutos por todos lados, o hasta que estén dorados y crujientes. Esparce los cubos de brioche sobre la mezcla de papa, luego espolvorea sobre el Gruyère rallado. Hornee en el horno durante 5-10 minutos, o hasta que el queso esté dorado y la mezcla burbujee.", "Mientras tanto, caliente una sartén a fuego muy alto hasta que esté caliente. Frote los filetes con aceite de colza y cepille la sartén con un poco de aceite de colza también.", "Agregue los filetes a la sartén y fría durante 2 minutos, sin moverlos. Da los filetes un cuarto de vuelta y freír por otro 1 minuto. Sazonar el lado crudo con sal y pimienta negra recién molida.", "Voltee los filetes y fríalos durante 1-2 minutos en el otro lado (por el medio) o por más tiempo hasta que estén cocidos a su gusto. Transfiera los filetes a un plato calentado y déjelos reposar durante 5 minutos.", "Derretir la mantequilla restante en la sartén utilizada para freír el brioche, luego cepillar sobre los bistecs descansados, cucharear cualquier líquido que ha sido liberado de la carne de nuevo sobre los filetes. Sazonar una vez más, al gusto.", "Para servir, coloque un filete en cada plato y cuchara sobre los jugos de carne. Vierta a cucharadas el gratinado de patatas y puerros."], "url": "www_bbc_co_uk_food_recipes_the_perfect_chefs_rump_23034", "title": "El filete de grupa perfecto del chef", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["20ml / ¾fl oz de aceite de colza", "1 x 5kg / 11lb de buena calidad, pavo de corral, preferiblemente criado orgánicamente, sin espoleta extraída (pídale a su carnicero que quite las alas y el cuello y córtelos en trozos de 2.5cm / 1 en el plato)", "40 g / 1½ oz de mantequilla sin sal, suavizada a temperatura ambiente", "2 pellizcos de sal marina", "2 pizca de pimienta blanca recién molida", "200 ml / 7 fl oz de agua", "sal y pimienta negra recién molida", "1-2 cucharaditas de arrurruz de tierra (dependiendo de qué tan grueso te guste tu salsa), disuelto en 1 cucharada de agua fría", "patatas asadas y verduras de temporada al vapor, para servir"], "method": ["Retire el pavo del refrigerador y déjelo a temperatura ambiente, esto demorará al menos una hora.", "Cuando esté listo para cocinar, precaliente el horno a un ventilador de 230C / 220C / Gas 8.", "Caliente el aceite de colza en una bandeja para asar grande y de base pesada en la parte superior de la estufa. Agregue las alas de pavo picadas y el cuello y fría durante 8-10 minutos, volteando las piezas cada 2-3 minutos, o hasta que se doren uniformemente por todas partes.", "Mientras tanto, en un tazón pequeño, suavice la mantequilla con la parte posterior de una cuchara de postre, luego sazone con la sal y la pimienta blanca recién molida. Usando un cepillo de pastelería o sus manos, unte la mantequilla sazonada por todo el pavo. Agregue la mantequilla restante a la bandeja de asar una vez que las alas cortadas y el cuello se hayan dorado.", "Coloque el pavo encima de las piezas del ala y el cuello, luego tueste en el horno durante 30 minutos.", "Retire el pavo del horno y hilvanado todo con los jugos de cocción.", "Reduzca la temperatura del horno a 160C / 150C ventilador / Gas 3.", "Vierta el agua en la bandeja de asar, luego devuelva el pavo al horno y continúe cocinando durante 1 hora más, rociando el ave con los jugos de cocción cada 20 minutos (hágalo rápidamente para evitar que el calor se escape del horno).", "Al final del tiempo de cocción, compruebe que el pavo esté cocido insertando un pincho o un tenedor para asar en la parte más gruesa de su muslo; si los jugos son claros, la carne está cocida. Alternativamente, use un termómetro de carne; si está cocinado, la temperatura debe ser de 74 ° C o más. Si el pavo no está completamente cocinado, devuélvalo al horno por otros 20 minutos o hasta que los jugos salgan limpios.", "Retire el pavo del horno y transfiera el ave a una bandeja grande y profunda, reservando la bandeja de asar en la que se cocinó el pavo junto con los jugos de cocina. Coloque el pavo a un lado para descansar por un mínimo de 30 minutos y hasta 1½ horas.", "Mientras el pavo está en reposo, cocine las papas asadas y los platos de verduras.", "Cuando esté casi listo para servir la comida, devuelva la bandeja de tostado utilizada para cocinar el pavo a la parte superior de la estufa. Haga hervir los jugos de cocción a fuego medio, raspando los trozos quemados del fondo de la bandeja con una cuchara de madera.", "Recoge los jugos lanzados por el pavo mientras descansaba y agrégalos a la salsa. Sazonar, al gusto, con sal y pimienta negra recién molida, si es necesario.", "Reduzca el fuego hasta que la salsa esté hirviendo a fuego lento, luego agregue la raíz de flecha disuelta y cocine hasta que la salsa se espese.", "Cuele la salsa a través de un colador fino en una jarra calentada. Mantener caliente", "Para servir, traiga el pavo a la mesa y talle en rodajas. Sirve con las patatas asadas y las verduras. Vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_the_perfect_roast_turkey_01155", "title": "El perfecto pavo navideño", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/the_perfect_roast_turkey_01155_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 yemas de huevo de gallinas camperas, a temperatura ambiente", "1 cucharadita de mostaza Dijon", "25ml / 1fl oz de vinagre de vino blanco", "250ml / 9fl oz de aceite de girasol o aceite vegetal", "exprimir limón, más extra, si es necesario", "Ramitas de berros de 100 g / 3½ oz, enjuagados y cortados", "sal marina y pimienta negra recién molida", "4 jóvenes pechos grouse, desollados", "60g / 2¼ oz de harina común", "6 huevos de gallinas camperas", "1 cucharada de leche", "Pancho 100 g / 3½ oz o pan rallado seco", "aceite vegetal, para freír poco", "8 rebanadas de pudín negro", "4 rebanadas grandes de pan de masa fermentada", "mantequilla, para difundir", "ramitas de berro, para servir", "sal marina y pimienta negra recién molida"], "method": ["Para hacer la mayonesa, ponga las yemas de huevo en un tazón mediano con la mostaza de Dijon y el vinagre de vino blanco y agítelas hasta que se combinen uniformemente.", "Lentamente rocíe en el aceite, batiendo continuamente para emulsionar la mezcla. Una vez que se haya agregado todo el aceite, debe tener una mayonesa espesa y brillante. Sazonar con sal y un chorrito de jugo de limón.", "Coloque la mayonesa en una licuadora o procesador de alimentos y agregue el berro. Pulsa hasta que tengas una mayonesa lisa y verde. Sazonar con jugo de limón y sal y pimienta. Cubra y enfríe hasta que sea necesario.", "Coloque un pezón grouse entre 2 hojas de película adhesiva y use un mazo de carne o un rodillo para golpear ligeramente hasta que se aplaste. Repita con los senos restantes y seque.", "Ponga la harina en un recipiente poco profundo y sazone con sal y pimienta. Batir 2 de los huevos con la leche en un segundo recipiente poco profundo, y colocar las migas de pan en un tercer recipiente poco profundo. Uno por uno, sumerja los senos en la harina para cubrirlos por completo, acariciando el exceso. Sumérgete en los huevos y finalmente en las migas de pan, dando palmaditas en las migas bien hasta que estén cubiertas.", "Caliente un sartén grande bien sazonado o una sartén a fuego medio-alto y agregue una capa de aceite de 5 mm. Una vez caliente, agregue los senos y fríalos por 2-3 minutos en cada lado hasta que estén dorados y crujientes, cocinando en tandas, si es necesario. Como cada filete está cocido, transfiéralo al papel de cocina y escurre bien.", "Limpie la sartén, vuelva al fuego y agregue una pequeña cantidad de aceite. Agregue la morcilla y fría por 1-2 minutos en cada lado, o hasta que esté cocida y ligeramente crujiente. Reserve y manténgase caliente.", "Limpie la sartén otra vez, y regrese al fuego. Agregue un poco de aceite para cubrir ligeramente la superficie. Una vez caliente, agregue los 4 huevos restantes y fríalos hasta que estén cocidos a su gusto.", "Mientras tanto, tuesta el pan de masa fermentada en ambos lados.", "Para ensamblar, unte la tostada caliente y unte con mayonesa de berros. Agregue una pechuga de grouse a cada rebanada, cubra con dos rebanadas de pudin negro, muchas hojas de berros y un huevo frito con pimienta negra recién asperjada salpicada en la parte superior. Sirva inmediatamente con la mayonesa de berros restante en el lado."], "url": "www_bbc_co_uk_food_recipes_the_ultimate_11s_grouse_54659", "title": "El último sándwich grouse 11s", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30 g / 1 oz de levadura fresca", "1kg / 2lb 4 oz de harina de harvester (o harina de semilla blanca o malteada blanca)", "60g / 2¼ oz de mostaza integral", "30g / 1oz de azúcar moreno", "4 cucharadas de aceite de colza", "20g / ¾oz de sal"], "method": ["En un recipiente grande, mezcle 450 ml / 16 fl oz de agua tibia con 20 g / ¾ oz de la levadura. Agregue 500g / 1lb 2oz de la harina de la cosechadora y mezcle bien. Cubra con película adhesiva y déjela de lado durante seis a veinticuatro horas.", "Agregue otro 50ml / 2fl oz de agua tibia mezclada con la levadura fresca restante y la harina restante de la cosechadora. Agregue la mostaza, el azúcar moreno y el aceite de colza.", "Mezcle hasta que estén completamente combinados, luego dé vuelta a la superficie de trabajo y amasar durante aproximadamente cinco minutos. Espolvorea sobre la sal y continúa amasando hasta que la masa se vuelva elástica, unos 5-8 minutos más.", "Divida en dos si hace panes pequeños u ocho porciones pequeñas si hace los panecillos. Forme panes o rollos y colóquelos en bandejas para hornear, cúbralos y déjelos en un lugar cálido durante aproximadamente una hora.", "Precaliente el horno a 230 ° C / 450 ° F / Gas 8 y coloque una bandeja para hornear en el fondo del horno.", "Una vez que la masa esté lista, coloque en el horno caliente y agregue rápidamente una taza llena de agua a la bandeja de horno caliente en la parte inferior antes de cerrar la puerta. Esto creará vapor para darle al pan su corteza.", "Hornee durante diez minutos y luego abra la puerta para liberar el vapor. Hornee durante otros 15 minutos antes de retirar los panes del horno. Los panes están listos cuando suenan huecos cuando se golpean en la parte inferior. Para los rollos de pan, retírelo del horno después de diez minutos."], "url": "www_bbc_co_uk_food_recipes_the_tasty_seeded_18682", "title": "Pan de semillas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 2 panes de mazorca", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]