[{"ingredients": ["150 g / 5½ oz de zanahoria, finamente cortadas", "1 cucharadita de perejil fresco picado", "1 cucharadita de cebolletas frescas picadas", "1 cucharada de aceite de oliva", "50g / 2oz de jamón de Parma", "sal y pimienta negra recién molida"], "method": ["Coloque las zanahorias, las hierbas y el aceite en un recipiente. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar bien.", "Para servir, coloca el jamón de Parma en un plato y coloca la ensalada de zanahoria y hierbas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_carrotandherbsalad_84266", "title": "Ensalada de zanahoria y hierbas con jamón de Parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina común 115g / 4oz", "115g / 4oz de mantequilla sin sal, más extra para engrasar", "115 g / 4 oz de azúcar en polvo", "2 huevos de gallinas camperas", "100 g / 3½ oz de zanahoria, pelada y rallada"], "method": ["Para hacer la esponja, coloque la harina, la mantequilla, el azúcar y los huevos en un procesador de alimentos y mezcle con una masa espesa.", "Retire con cuidado la cuchilla del procesador de alimentos y luego mezcle la zanahoria rallada.", "Engrase un bol con leche o taza a prueba de calor con mantequilla y cuchara en la mezcla de esponja.", "Cubra con film transparente y microondas a máxima potencia durante ocho minutos, o hasta que estén cocidos. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_carrotcake_84164", "title": "Torta de zanahoria taza de microondas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "2 cucharaditas de polvo de hornear", "1 cucharadita de sal", "1 cucharadita de bicarbonato de soda", "150g / 6oz de azúcar moreno claro", "50g / 2oz nueces, conchas eliminadas", "220 g / 8oz de rodajas de piña enlatadas, picadas", "puñado de sultanas", "2 plátanos maduros, puré", "1 maracuyá, solo pulpa", "150 g / 5oz de zanahorias, ralladas", "150ml / 5fl oz de aceite de maíz", "3 huevos de gallinas camperas", "125g / 4oz de mantequilla, ablandada, más extra para engrasar", "225g / 8oz de queso crema", "450 g / 1 libra de azúcar glas", "1 cucharadita de extracto de vainilla", "100 g / 3½ oz de crema de coco, rallado", "Pacanas trituradas 50g / 2oz, para decorar"], "method": ["Precalentar el horno a 160C / 320F / Gas 2.", "Tamiza la harina, el polvo de hornear, la sal y el bicarbonato de soda en un bol y mezcle bien.", "Agregue el azúcar, nueces, piña, pasas, puré de plátano, pulpa de fruta de la pasión, zanahoria rallada, aceite y huevos y mezcle bien para combinar por completo.", "Vierta la mezcla de la torta en una lata de pastel engrasada de 22.5 cm / 9 in y colóquela en el horno para hornear durante 1-1¼ horas o hasta que esté bien cocida. Pruebe presionando un pincho en el centro del pastel. Si el pincho sale limpio, el pastel está listo.", "Si la parte superior de la torta se dora demasiado, cúbrala con un círculo de papel de cocina.", "Retire del horno cuando esté listo y permita que se enfríe en una rejilla de alambre.", "Para la guinda, bata la mantequilla y el queso juntos en un tazón limpio hasta que estén suaves y esponjosos.", "Agregue el azúcar y el extracto de vainilla y mezcle bien.", "Agregue el coco y mezcle de nuevo.", "Una vez que el pastel esté frío, quítelo de la fuente y esparza el glaseado por todo el pastel.", "Decora el pastel con unas nueces pecanas trituradas y sirve en rebanadas generosas."], "url": "www_bbc_co_uk_food_recipes_carrotcakewithcreamc_86392", "title": "Pastel de zanahoria con glaseado de queso crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotcakewithcreamc_86392_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / ¼ pinta de aceite de girasol", "100g / 4 oz de azúcar morena clara", "2 huevos, ligeramente batidos", "75g / 3oz de jarabe dorado", "Harina de autorregulación integral de 175g / 6oz", "1 cucharadita de canela molida de nivel", "½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de jengibre molido", "1 cucharadita de bicarbonato de soda", "Zanahorias ralladas finamente de 200g / 7oz", "75g / 3oz sultanas", "25g / 1oz de coco desecado", "2 cucharaditas de mermelada de naranja fina", "150g / 5oz de queso crema", "50ml / 2fl oz crema de coco", "Azúcar glas de 40g / 1½oz", "nuez moscada recién molida o rallada o canela molida, para terminar"], "method": ["Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Necesitará una lata de hornear redonda o cuadrada engrasada y forrada de 18 cm / 7 pulg.", "En un tazón grande o un mezclador eléctrico, mezcle el aceite, el azúcar, los huevos y el sirope dorado hasta que estén totalmente combinados. Mezcle los ingredientes restantes de la torta y vierta en la lata preparada.", "Hornee en el horno durante 45 minutos para un pastel redondo, o 30 minutos para el cuadrado, hasta que esté bien levantado y firme pero elástico cuando se lo presione ligeramente. Inserta un pincho en el centro si no estás seguro. Si sale limpio, el pastel está listo. Deja que la torta se enfríe en la lata durante 10 minutos antes de colocarla en una rejilla para que se enfríe por completo.", "Mientras la torta se está enfriando, haga la cobertura. Caliente la mermelada en un microondas o en una cacerola pequeña hasta que se derrita. Batir en el queso crema con la crema de coco y azúcar glas. Colóquelo en la nevera para reafirmarlo, y cuando se haya enfriado sobre la torta enfriada.", "Para un toque final, ralla algo de nuez moscada o polvo con canela molida. Debido a que la tarta de zanahoria se ha hecho con aceite, permanecerá húmeda durante unos días en un recipiente hermético si puede soportar no comerla de inmediato."], "url": "www_bbc_co_uk_food_recipes_carrotcake_70048", "title": "Pastel de zanahoria húmedo con crema de naranja de coco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 8-12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotcake_70048_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz azúcar morena oscura", "2 huevos grandes de gallinas camperas", "150ml / 5fl oz aceite de oliva (no aceite de oliva virgen extra)", "Harina de autorregulación integral de 200g / 7oz", "1 cucharada de especias mixtas molida", "1 cucharadita de bicarbonato de soda", "200 g / 7 oz de zanahorias, peladas, ralladas gruesas", "Nueces pecanas de 80g / 3oz, más o menos picadas, más extra para decorar", "1 limón, ralladura solamente", "Sultanas 110 g / 4oz", "25 g / 1oz de pasas", "50g / 2oz de coco desecado", "250 g / 9 oz de crema fresca de oro mascarpone", "Crema doble 250ml / 9fl oz", "2 cucharadas de azúcar glas", "Zanahorias baby de 300g / 10½oz, lavadas, con tallo verde de 2.5cm / 1in todavía encendido", "pizca de sal", "70 g / 2½ oz de azúcar en polvo, más un poco más", "50g / 1¾oz de mantequilla"], "method": ["Para la torta, precaliente el horno a 180C / 350F / Gas 4.", "Engrase ligeramente dos moldes para pasteles redondos de 20cm / 8in y forre las bases con papel para hornear.", "Batir el azúcar, los huevos y el aceite de oliva juntos en un tazón grande con un batidor de mano eléctrico durante 3-4 minutos hasta que la mezcla esté suave.", "Tamiza la harina, la mezcla de especias y el bicarbonato de soda en el cuenco, inclinando los granos que quedan en el tamiz. Mezcle suavemente. Doble la zanahoria rallada, las nueces de pecan, la ralladura de limón, las pasas sultanas, las pasas y el coco desecado en la mezcla.", "Vierta la mezcla por igual en las dos latas de torta y alise la superficie de cada una con una espátula. Hornee en el estante central del horno durante 35-40 minutos. Deben estar bien levantados y se sienten firmes y elásticos al tacto cuando se presionan ligeramente en el centro; si no, cocina un poco más antes de volver a probar. Cuando esté listo, deje enfriar durante cinco minutos antes de quitar los pasteles de la lata y enfriar completamente en una rejilla de alambre.", "Para la guinda, coloque todos los ingredientes de glaseado en un bol y bata juntos hasta que estén suaves y esponjosos. Cubra el tazón con film transparente y transfiéralo a la nevera durante 1-2 horas, hasta que esté listo para mojar el pastel.", "Para las zanahorias azucaradas, coloque las zanahorias en una olla y cubra con agua fría. Agregue la sal, el azúcar y la mantequilla. Coloque a fuego alto y lleve a ebullición. Hervir durante 5-6 minutos: las zanahorias se cocinarán a medida que el agua se evapore y se formará un esmalte en la base de la sartén. Mezcle las zanahorias cocidas en el glaseado y luego retírelas de la sartén a un plato con un poco más de azúcar en polvo. Enróllelos un poco más de azúcar y déjelos enfriar.", "Cuando los pasteles estén completamente fríos, extiende la guinda sobre la parte superior de cada pastel y aplástalos. Justo antes de servir, esparza unas nueces de nuez sobre la tarta y decore con las zanahorias azucaradas."], "url": "www_bbc_co_uk_food_recipes_carrotcakewithmascar_86002", "title": "Pastel de zanahoria con zanahorias confitadas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450ml / 14fl oz de aceite vegetal", "Harina simple 400g / 14oz", "2 cucharaditas de bicarbonato de soda", "570 g / 1 libra de azúcar 4 oz", "Huevos de 290g / 10oz", "pizca de sal", "12 g / ½ oz de canela en polvo", "530 g / 1 libra de zanahorias de 3 oz, peladas y ralladas", "Nueces 150g / 5oz, picadas", "200g / 7oz de queso crema", "150 g / 5 oz de azúcar", "100 g / 3½ oz de mantequilla", "1 litro / 1¾ pintas de leche", "150ml / 5fl oz de azúcar", "10 yemas de huevo", "400g / 14oz de chocolate blanco, derretido en un baño maría", "55 g / 2 oz de leche en polvo", "Crema doble de 200 ml / 7 fl oz"], "method": ["Mezcle todos los ingredientes de la torta en un procesador de alimentos durante 5 minutos. Verter en una lata de pastel de 26 cm / 10½ pulgadas de diámetro y hornear a 160 ° C / 325 ° F / Gas 3 durante 45 minutos.", "Verifique si la torta está cocinada, luego retírela del horno y déjela enfriar durante 10 minutos en la lata antes de retirarla y colocarla en una rejilla para enfriar.", "Para el relleno, coloque el queso crema, el azúcar y la mantequilla en un tazón y mezcle hasta que estén suaves y suaves. Extiende sobre el pastel con una espátula.", "Para el helado, unte las yemas de huevo y el azúcar hasta que estén blancos y tieso.", "En una sartén, combine la leche, la leche en polvo y la crema y deje que hierva. Vierta un poco de la leche en los huevos con crema y el azúcar, batiendo continuamente.", "Regrese la mezcla a la cacerola y cocine a fuego medio a 80C / 175F. Pase a través de un colador y luego vierta el chocolate blanco derretido. Entregue una máquina de helados. Retire y coloque en el congelador.", "Sirva cada porción de pastel con una bola de helado de chocolate blanco."], "url": "www_bbc_co_uk_food_recipes_carrotcakewithwhitec_13153", "title": "Pastel de zanahoria con helado de chocolate blanco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 12 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 zanahoria, picada", "1 diente de ajo, picado", "1 cucharadita de semillas de cilantro, tostadas", "½ coliflor, cortada en florecillas", "425 ml / ¾ pinta de pollo caliente o caldo de verduras", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una sartén, agregar la cebolla y la zanahoria y freír durante 4-5 minutos.", "Agregue las semillas de ajo y cilantro y fría por un minuto.", "Agregue las flósculos de coliflor, el caldo y la sal y la pimienta negra recién molida, al gusto, y cocine a fuego lento durante cinco minutos, o hasta que la coliflor esté tierna. Deje que la sopa se enfríe un poco antes de licuar.", "Mezcle la sopa con una batidora de mano hasta que quede suave. Vuelva a calentar a fuego medio si es necesario, luego divídalo entre dos tazones para servir."], "url": "www_bbc_co_uk_food_recipes_carrotcauliflowerand_87944", "title": "Sopa de zanahoria, coliflor y cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo finamente picado", "½ puerro, solo parte blanca, finamente picado", "pellizcar jengibre molido", "½ zanahoria, finamente picada", "300ml / 10fl oz de caldo de verduras calientes", "sal y pimienta negra recién molida", "25 g / 1 oz de manzana picada finamente"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue el ajo, el puerro y el jengibre molido y fría a fuego lento durante 2-3 minutos, hasta que los puerros se hayan ablandado.", "Agregue la zanahoria y el caldo, lleve a ebullición, luego reduzca el fuego a fuego lento durante diez minutos, o hasta que la zanahoria esté bien cocida.", "Coloque la sopa en un procesador de alimentos y mezcle hasta que quede suave, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la manzana en un recipiente tibio y vierta la sopa."], "url": "www_bbc_co_uk_food_recipes_carrotleekandgingers_80265", "title": "Sopa de zanahoria, puerro y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharaditas de huevo en polvo", "2 cucharadas de agua", "Harina de auto crianza 110g / 4oz", "pizca de sal", "290ml / ½ pinta de leche entera", "1 cucharada de aceite vegetal", "1 zanahoria, rallada", "1 zanahoria, rallada", "2 anillos de piña de una lata, finamente picados", "½ lima, solo jugo", "2 cucharaditas de miel líquida", "2 cucharaditas de vinagre de vino tinto", "1 cucharada de aceite de oliva", "pimienta negra recién molida, al gusto", "1 cucharada de hojas frescas de cilantro picado"], "method": ["Para hacer los panqueques, bata los huevos en polvo y el agua en un tazón hasta que quede suave.", "Agregue la harina y bata nuevamente para formar una pasta suave.", "Poco a poco agregue la leche y bata hasta que se forme una mezcla suave.", "Calentar el aceite en una sartén a fuego medio. Agregue la zanahoria rallada y fría por dos minutos.", "Agregue la mezcla y cocine durante dos minutos. Voltee el panqueque y cocine por otros dos minutos en el otro lado, hasta que se dore.", "Coloque la tortita en un plato grande y caliente y corte en tres.", "Para hacer la salsa de piña, coloque todos los ingredientes juntos en un tazón pequeño.", "Para servir, vierta la salsa alrededor de la tortita de zanahoria y adorne con las hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_carrotpancakeswithpi_81682", "title": "Crepes de zanahoria con salsa de piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de harina integral", "Harina 100g / 3½ oz de levante automático, más extra para quitar el polvo", "75g / 2¾oz azúcar moreno claro", "75g / 2¾oz de arándanos secos", "75g / 2¾oz de anacardos sin sal, crudos, picados", "1 cucharadita de bicarbonato de soda", "1 cucharadita de polvo de hornear", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas", "pizca de sal", "2 huevos de gallinas camperas", "1 vaina de vainilla, semillas raspadas o 1 cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a un ventilador de 170C / 150C / 325F / Gas 3. Cubra una bandeja de horno grande con papel para hornear.", "Mezcle las harinas en un tazón grande con el azúcar, los arándanos, los anacardos, el bicarbonato de soda, el polvo de hornear, la canela, la mezcla de especias y la sal.", "Haga un pozo en el centro y agregue los huevos, las semillas de vainilla (o extracto) y mezcle todo bien. Comenzará a agruparse, pero luego ponga las manos en su lugar y realmente arregló todo para formar una masa.", "Sobre una superficie ligeramente enharinada, enrolle la masa en forma de salchicha de aproximadamente 30 cm de largo y 5 cm de ancho. Con cuidado, levántelo y transfiéralo a la bandeja de horno preparada.", "Luego, presione hacia abajo suavemente para que llegue a 1,5 cm / 5/8 pulgadas de alto.", "Hornee durante 30 minutos, o hasta que esté firme y un cuchillo perforado en el centro salga limpio. Retire del horno y deje hasta que esté lo suficientemente frío como para manipularlo.", "Con cuidado, transfiera de la bandeja de hornear a un tablero. Con un cuchillo afilado y de borde serrado, corte treinta rebanadas ligeramente inclinadas de 1cm / ½ pulgadas. Algunos bits pueden derrumbarse un poco cuando corta, pero está bien. Simplemente corte lentamente sosteniendo el biscotti 'log' con la otra mano. ¡Cualquier parte que se caiga es una buena ventaja para el chef!", "Coloque las rebanadas de biscotti sobre la bandeja para hornear y colóquelas en el horno para hornear durante 40 minutos, volteándolas hasta la mitad. Retirar del horno y dejar enfriar por completo.", "Para mí, esto se sirve mejor sumergido en algo caliente."], "url": "www_bbc_co_uk_food_recipes_cashew_cranberry_and_33261", "title": "Bizcocho de anacardo, arándano y especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 30 biscotti", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo", "1 gran puñado de albahaca fresca", "1 gran puñado de perejil", "1 cucharada de pan rallado", "2 cucharadas de aceite de oliva", "sal", "1 puñado de anacardos", "tostada ciabatta, para servir"], "method": ["Coloque todos los ingredientes, excepto la chapata, en un procesador de alimentos y mezcle hasta que quede suave.", "Servir extendido en la tostada ciabatta."], "url": "www_bbc_co_uk_food_recipes_cashewnutpesto_80564", "title": "Pesto de anacardo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½kg / 1lb 1½ oz de yuca pelada fresca, centro fibroso eliminado", "200 g / 7¼ oz de queso feta", "4 huevos de gallinas camperas", "1 cucharada de perejil picado", "1 cucharada de cebolleta picada", "sal y pimienta negra recién molida, al gusto", "aceite, para freír"], "method": ["Hervir la yuca durante al menos 20 minutos, luego drenar y dejar reposar durante cinco minutos en el colador, para asegurarse de que esté completamente seco.", "Mash la yuca con un triturador de papa (no use un procesador de alimentos ya que lo hará demasiado pegajoso). Agregue todos los otros ingredientes, excepto el aceite, y mezcle bien.", "Caliente el aceite en una sartén hasta que esté muy caliente (PRECAUCIÓN: el aceite caliente es muy peligroso. No lo deje sin supervisión). Usando dos cucharas secas, dé forma a la masa en albóndigas.", "Coloque las albóndigas en el aceite caliente y fría por lo menos durante cinco minutos. Coloque cinco o seis albóndigas juntas y luego tome una primero para verificar si está lista. Todos los ingredientes ya están cocidos, por lo que el centro puede ser un poco blando.", "Sirva con salsa o prepare el día anterior y sirva en un tazón de sopa."], "url": "www_bbc_co_uk_food_recipes_cassavaandcheesefrit_73324", "title": "Cassava and cheese fritters (Galletas de mandioca y queso)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1lb de puré de patatas calientes (horneado al horno hasta que estén tiernos, pelados, pasados ​​a través de un ricer de patata)", "Harina normal de 10g / ¼ oz", "3 yemas de huevo de gallinas camperas", "½ cucharadita de sal marina", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "750ml / 1¼ pintas de leche", "1 chalote, pelado, rebanado grueso", "1 hoja de laurel fresca", "4 granos de pimienta negra", "1 diente", "1 cucharadita de aceite de oliva", "2 cucharadas de perifollo fresco picado", "15g / ½ oz de médula ósea", "30g / 1oz de mantequilla", "Pan rallado de brioche 150 g / 5 oz", "200g / 7oz de setas silvestres mezcladas", "sal y pimienta negra recién molida", "2 x 700 g / 1 libra 8oz cöte de boeuf (costilla de ternera con hueso)", "1 cucharadita de aceite de oliva", "1 cabeza cavolo nero, hojas solo", "50g / 2oz de mantequilla", "2 chalotes, pelados, finamente cortados"], "method": ["Para los gnocchi, mezcle todos los ingredientes de gnocchi hasta que estén bien combinados como una masa, usando sus manos. (No trabaje en exceso la mezcla).", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y extiéndala a un espesor de 0.5cm / ½ in. Corta la masa en pedazos de 1.5cm x 3cm / ½in x 1in.", "Poner a hervir una olla de agua con sal. Con cuidado, baje los ñoquis en la sartén, en lotes, luego blanquee durante 1-2 minutos.", "Escurrir bien y colocar en una bandeja para hornear ligeramente engrasada. Enfriar en la nevera hasta que sea necesario.", "Para la salsa blanca, precaliente la parrilla a su configuración más alta.", "Caliente la mantequilla en una cacerola a fuego medio bajo hasta que se derrita. Batir la harina hasta que esté suave y bien combinada. (Esto se llama roux.) Retirar del fuego y reservar para enfriar.", "Llevar la leche a ebullición en una sartén por separado. Agregue los ingredientes restantes de la salsa blanca excepto el perifollo, luego retire la sartén del fuego y déjela a un lado durante 20 minutos para infundirla.", "Cuando la leche se haya infundido, páselo por un colador fino en una olla limpia (deseche el contenido del tamiz). Batir el roux enfriado en la leche caliente y continuar calentando hasta que la mezcla esté hirviendo y espesada. Continúe hirviendo durante 1-2 minutos, luego retire la sartén del fuego.", "Mientras tanto, para la corteza de la médula ósea, caliente la médula ósea y la mantequilla en una cacerola a fuego medio hasta que se derrita y se combine bien. Retire del fuego, luego agregue las migas de brioche. Dejar de lado.", "Para los champiñones, caliente el aceite en una sartén a fuego medio. Agregue los champiñones y fríalos durante 1-2 minutos, o hasta que estén blandos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Transfiera los gnocchi a un plato refractario y vierta sobre la salsa blanca. Agregue los champiñones cocidos y el perifollo hasta que estén bien combinados. Cuchara sobre la corteza de médula ósea.", "Coloque el plato a prueba de horno en una bandeja de horno y la parrilla hasta que estén doradas y burbujeantes.", "Mientras tanto, para el cote de boeuf, precalentar el horno a 200C / 400F / Gas 6.", "Frote la carne con el aceite, luego sazone a ambos lados, al gusto, con sal y pimienta negra recién molida.", "Caliente una sartén a fuego alto hasta que esté muy caliente. Cuando la sartén esté caliente, agregue la carne de res y fría en ambos lados durante un minuto, o hasta que aparezcan marcas de dorado marrón a ambos lados de la carne.", "Transfiera la carne a la parrilla a una bandeja de asar y tueste en el horno durante 12 a 14 minutos (para raros), o hasta que esté cocida a su gusto. Retire de la bandeja de tostado y déjela a un lado en un plato caliente para que descanse durante al menos cinco minutos.", "Para el cavolo nero, blanquee el cavolo nero por 20-30 segundos en una sartén con agua salada y hirviendo. Escurrir bien.", "Calentar la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los chalotes y el cavolo nero escaldado y fríalos durante 1-2 minutos, o hasta que el cavolo nero se marchite y los chalotes se ablanden.", "Para servir, esculpe el cote de boeuf en rodajas gruesas y divídalos por igual entre cuatro platos para servir. Cucharee el gratinado de médula ósea y el cavolo nero al costado."], "url": "www_bbc_co_uk_food_recipes_casterbridgecotedebo_92951", "title": "Cote de boeuf con setas silvestres y gratinado de ñoquis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "1 cebolla grande española, picada", "2 bulbos de hinojo, picados", "150g / 5oz de chorizo, cortado en cubitos", "1 chile rojo, finamente picado", "1 cucharadita de semillas de hinojo, molido", "2 dientes de ajo nueva temporada, aplastados", "½ cucharadita de pimentón dulce en polvo", "1 cucharada de hojas frescas de tomillo", "1 cucharadita de hilos de azafrán (opcional)", "3 hojas frescas de laurel", "1 tomates de ciruela", "100 ml / 3½ fl oz de caldo de pescado o agua", "150ml / 5 fl oz de vino blanco", "Mejillones de 500 g / 1 lb 2 oz, limpios", "650 g / 1 lb 7 oz de pescado blanco firme (besugo, abadejo, bacalao, rape), fileteado, dragado en harina y frito en aceite de oliva", "100 g / 3½ onzas de almendras tostadas, molidas", "1 limón, cortado en cuñas", "papas al vapor y verduras de primavera"], "method": ["Calentar el aceite de oliva en una sartén grande y saltear las cebollas, el hinojo, el chorizo ​​en cubitos, el chile, las semillas de hinojo molido y el ajo durante unos minutos.", "Agregue el pimentón, el tomillo, el azafrán, las hojas de laurel y los tomates y cocine hasta que se reduzca a una salsa espesa.", "Agregue el caldo de pescado (o agua) y el vino blanco y cocine a fuego lento.", "Agregue los mejillones cocidos y cocine hasta que estén todos abiertos. Deseche cualquier que no se haya abierto.", "Coloque las piezas de pescado en el guiso y agregue las almendras.", "Caliente durante uno o dos minutos y sirva con verduras de temporada, papas al vapor y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_catalanfishstew_74501", "title": "Guiso de pescado catalán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/catalanfishstew_74501_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 dientes de ajo, pelados", "250ml / 9fl oz de aceite de oliva virgen extra", "1 cucharadita de sal", "1 cucharadita de vinagre de jerez", "2 cucharadas de aceite de oliva", "50g / 2oz de pan rallado", "3 cebollas rojas, peladas y finamente picadas", "4 dientes de ajo, picados", "Papas de 750 g / 1 lb 10 oz, sin pelar, cortadas en cubos grandes", "250ml / 9fl oz de caldo de verduras", "4 tomates, pelados, picados", "1 lata de frijoles cannellini, escurrida", "1 puñado de hojas de menta fresca", "1 cucharada de perejil fresco, picado", "75 g / 2½ oz de mantequilla", "½ limón, solo jugo"], "method": ["Precalentar el horno a 180C / 350F / gas 4.", "Para el aderezo de ajo, coloque el ajo en una fuente para hornear y rocíe sobre el aceite de oliva. Revuelva bien para cubrir, luego tueste en el horno por 25 minutos, o hasta que el ajo esté suave y dorado.", "Transfiera el ajo y el aceite a un procesador de alimentos, agregue la sal y el vinagre de jerez y mezcle hasta lograr un puré suave. Dejar de lado.", "Para el estofado de papa y frijoles, caliente el aceite de oliva en una sartén y fríe con cuidado las migas de pan durante 3-4 minutos, o hasta que estén blandos. Agregue las cebollas y el ajo y cocine durante 8-10 minutos, o hasta que las cebollas estén suaves y translúcidas.", "Agregue las papas y el caldo a la sartén, luego reduzca el fuego y deje hervir a fuego lento durante 10-12 minutos.", "Agregue los tomates y los frijoles y cocine a fuego lento durante otros 4-5 minutos, luego mezcle las hierbas, la mantequilla y el jugo de limón.", "Para servir, coloca el estofado en tazones para servir. Sirva la salsa de ajo al lado, o cuchara sobre el estofado."], "url": "www_bbc_co_uk_food_recipes_catalanpotatoandbean_89890", "title": "Guiso de patatas y judías catalanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, más o menos picada", "1 pimiento rojo, cortado en cuadrados de 2cm / ¾in", "2 dientes de ajo, finamente picados", "200g / 7oz de chorizo, cortado en medias lunas", "1 cucharadita de pimentón ahumado en caliente", "¼ cucharadita de azafrán", "Papas de 400g / 14oz, peladas, cortadas a la mitad a lo largo, luego cortadas en rodajas gruesas", "200g / 7oz de calamar, limpiado", "Pulpo de 300g / 11oz, limpiado", "1 x 400 g / 14 oz pueden cortar tomates", "250ml / 9fl oz de caldo de pescado", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatleaf tostado", "pan crujiente, para servir"], "method": ["Calentar una sartén hasta que esté caliente. Agregue el aceite de oliva, la cebolla y el pimiento rojo y fríe suavemente durante 3-4 minutos, hasta que se ablanden.", "Agregue el ajo, el chorizo, el pimentón y el azafrán. Freír durante 2-3 minutos, o hasta que el aceite comience a desprenderse del chorizo.", "Agregue las papas y mezcle para combinar.", "Retire los tentáculos del calamar y reserve. Corta el cuerpo en cuadrados del tamaño de un bocado. Corta el pulpo en 4cm / 1½ en pedazos.", "Agregue el calamar y el pulpo a la sartén y mezcle bien.", "Agregue los tomates y el caldo de pescado y deje que hierva. Reduzca el fuego a fuego lento y cocine por 30 minutos, o hasta que el calamar y el pulpo estén tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Espolvorear sobre el perejil y servir con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_catalanstylesquidand_87980", "title": "Calamar de estilo catalán y estofado de pulpo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "50g / 1¾oz de mantequilla", "200 g / 7 oz de cebolla, finamente rebanada", "Coliflor de 700 g / 1 libra y 9 onzas, muy finamente rebanada", "2 manzanas de Cox, sin corazón, peladas y cortadas en cubitos", "2 cubos de caldo de verduras", "750 ml / 1¼ de leche de pinta", "750 ml / 1¼ de agua de pinta", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva y la mantequilla en una cacerola grande, agregue la cebolla, cubra y fríe suavemente durante 3-4 minutos.", "Agregue la coliflor y continúe cocinando durante 2-3 minutos más.", "Agregue los ingredientes restantes y lleve a ebullición, reduzca a fuego lento y cocine durante cinco minutos, o hasta que la coliflor esté tierna.", "Pon la sopa en una licuadora y pulsa hasta que quede suave.", "Sazone al gusto con sal y pimienta negra recién molida y sirva."], "url": "www_bbc_co_uk_food_recipes_cauliflower_and_apple_97210", "title": "Sopa de coliflor y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de chorizo, finamente cortado en cubitos", "50g / 2oz de mantequilla", "2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "Arroz Arborio 250g / 9oz u otro arroz risotto italiano", "150ml / 5fl oz de vino blanco seco", "1 litro / 1¾ pinta de caldo de pollo", "1 cabeza de coliflor, cortada en pequeños floretes", "25g / 1oz de queso parmesano rallado (o queso vegetariano vegetariano alternativo)", "3 calamar mediano, limpio, cortado en triángulos", "½ limón, solo jugo", "4 cucharadas de berro de perejil, para servir", "4 cucharadas de berro de amaranto rojo, para servir"], "method": ["Caliente una sartén hasta que caliente y seque el chorizo ​​a fuego medio hasta que los aceites se hayan soltado y el chorizo ​​esté crujiente. Agregue la mitad de la mantequilla, el aceite de oliva, la cebolla y el ajo y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el risotto de arroz hasta que esté bien cubierto en los jugos de la sartén y cocine por 1-2 minutos, o hasta que los granos de arroz comiencen a ponerse translúcidos. Agregue el vino y cocine por 3-4 minutos, o hasta que casi todo el líquido se haya evaporado.", "Agregue un cucharón de caldo de pollo a la sartén y mezcle bien. Cocine durante 1-2 minutos, o hasta que se haya absorbido casi todo el caldo, luego agregue otro cucharón de caldo. Repite el proceso hasta que el arroz esté cocido pero aún al dente. Agregue la coliflor durante los últimos cinco minutos de cocción. Agregue el parmesano y sazone, al gusto, con sal y pimienta negra.", "Caliente otra sartén hasta que esté caliente, agregue la mantequilla restante y el calamar y cocine a fuego alto durante 1-2 minutos hasta que estén dorados y recién cocinados. Sazone con sal y pimienta negra y termine con un chorrito de limón.", "Para servir, espolvorear el risotto en tazones para servir, cubrir con el calamar y una dispersión de berro."], "url": "www_bbc_co_uk_food_recipes_cauliflower_and_chorizo_45104", "title": "Risotto de coliflor y chorizo ​​con calamar chamuscado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_and_chorizo_45104_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, más o menos picada", "Coliflor de 400 g / 14 oz, picada en trozos pequeños", "1 diente de ajo, finamente picado", "2 pequeños puñados de col rizada, tallos eliminados, toscamente picados", "1 cucharadita de pimentón ahumado", "½ cucharadita de pimienta de cayena", "pequeño puñado de perejil, toscamente picado", "Una pizca de sal marina", "2 yemas de huevo grandes de gallinas camperas", "150 g / 5½ oz de mantequilla, fría, cortada en cubos", "½ limón, solo jugo", "4 cucharadas de aceite de girasol", "2 huevos grandes de gallinas camperas", "pequeño puñado de cebollín, finamente picado"], "method": ["Para la coliflor y la col rizada, caliente una sartén con tapa pequeña a fuego alto, agregue el aceite y fría la cebolla y la coliflor durante 3 minutos, revolviendo muy poco hasta que queden ligeramente carbonizados.", "Agregue el ajo, la col rizada, el pimentón y la pimienta de cayena. Cuando la col rizada esté ligeramente marchita, agregue 3 cucharadas de agua y cubra, cocinando por 3-4 minutos hasta que la col rizada y la col rizada estén tiernas. Sazonar con sal marina y agregar el perejil.", "Para hacer la salsa holandesa, ponga las yemas de huevo en un tazón grande y resistente al calor sobre una fuente de agua hirviendo a fuego lento (asegurándose de que el recipiente no toque el agua). Batir las yemas y agregar lentamente la mantequilla, esperar hasta que cada pieza se derrita antes de agregar la siguiente, batiendo continuamente hasta que esté completamente combinada y la salsa se haya espesado. Agregue el jugo de limón y revuelva. Apague el fuego, pero mantenga la salsa caliente sobre la fuente de agua.", "Para los huevos fritos, caliente el aceite en una sartén hasta que esté caliente y chisporroteando. Grieta en los huevos. Después de un minuto, hilvana el huevo inclinando la sartén y echando una cucharada de aceite, vertiéndolo sobre el huevo. Hilvane aproximadamente cada minuto y cocine el huevo hasta que esté hecho a su gusto.", "Para servir, ponga el hash en dos platos para servir y cubra con un huevo frito, una generosa porción de salsa holandesa y una pizca de cebollín."], "url": "www_bbc_co_uk_food_recipes_cauliflower_and_kale_38572", "title": "Coliflor y kale hash con huevo frito y holandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de aceite de girasol", "4 huevos de gallinas camperas", "4 cucharadas de miel clara", "Harina normal 225g / 8oz", "2 cucharaditas de polvo de hornear", "½ cucharadita de bicarbonato de soda", "pizca de sal", "1 cucharadita de esencia de vainilla", "175g / 6oz de zanahorias ralladas", "mantequilla, para engrasar", "75g / 2½ oz de queso crema", "2 cucharadas de mantequilla", "340g / 12oz de azúcar glas, tamizado", "1 cucharadita de esencia de vainilla"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un recipiente, mezcle el aceite, los huevos y la miel hasta que estén bien combinados.", "Agregue la harina, el polvo de hornear, el bicarbonato de soda, la sal, la esencia de vainilla y las zanahorias ralladas y bata bien.", "Vierta la mezcla de pastel en una lata de torta engrasada de 23 cm / 9 pulgadas y transfiera al horno para hornear durante una hora hasta que salga limpio un pincho en el centro. Deje que se enfríe en una rejilla de alambre y retire con cuidado de la lata cuando esté frío.", "Para la guinda, bata el queso crema y la mantequilla en un bol hasta que estén suaves y esponjosos. Agregue el azúcar glas tamizado y la esencia de vainilla y revuelva hasta que se combinen.", "Una vez que el pastel esté frío, usando una espátula, extiende el glaseado sobre el pastel. Servido en rebanadas."], "url": "www_bbc_co_uk_food_recipes_carrotcake_85723", "title": "Pastel de zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]