[{"ingredients": ["1kg / 2lb 3 oz de mejillones frescos", "2 cucharadas de aceite de oliva", "1 chalote, finamente picado", "2 dientes de ajo picados", "150ml / 5fl oz de vino blanco", "2 ramitas de tomillo", "150ml / 5fl oz de crema doble", "perejil pequeño de hoja plana, picado", "pan crujiente, para servir"], "method": ["Limpia los mejillones frotándolos a fondo con abundante agua corriente, quitándolos y descartando las \"barbas\", los hilos fibrosos similares a las algas marinas. Deseche los mejillones rotos y cualquier mejillón que no se cierre herméticamente cuando los toque.", "Caliente el aceite de oliva en una sartén con una tapa hermética. Agregue la chalota y el ajo y cocine a fuego medio hasta que estén blandos, pero no coloreados.", "Agregue el vino y suba a fuego alto. Cuando el vino comience a hervir, agregue los mejillones y el tomillo limpios a la sartén. Baja el fuego a bajo", "Coloque la tapa en la sartén y deje que los mejillones hiervan. Cocine durante aproximadamente 4-5 minutos, levantando la tapa de vez en cuando para comprobar: sabrá que están cocidos cuando se hayan abierto los caparazones. Deseche cualquier mejillón que permanezca cerrado.", "Agregue la crema doble y cocine por un minuto más.", "Esparce el perejil picado y sirve en tazones hondos."], "url": "www_bbc_co_uk_food_recipes_mussels_marinere_00294", "title": "Mejillones Marinière", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "2 chalotes pequeños, finamente picados", "1 apio, pelado y picado", "Mejillones de 1kg / 2lb 4 oz, limpios y sin barba", "Pastillas de 30ml / 1fl oz", "200ml / 7fl oz de jerez seco", "200g / 7oz de espinaca", "10g / ¼ oz hojas de perejil fresco, picadas", "2 ramitas de estragón fresco, solo hojas", "2-3 gotas de Tabasco"], "method": ["Ponga a hervir una olla grande de agua con sal y pula la espinaca durante 30 segundos. Escurra las espinacas, enjuáguelas con agua fría, apriete y seque.", "Derrita la mantequilla en una olla grande y fría los chalotes y el apio hasta que se ablanden. Incline los mejillones, aumente el fuego hasta que el sonido del chisporroteo emane desde abajo, luego agregue el pastis y el jerez. Agite la olla una vez que aparezca el vapor, vuelva a colocarla sobre el fuego y continúe cocinando durante 1-2 minutos más.", "Una vez que todas las conchas estén completamente abiertas, colóquelas inmediatamente en un colador suspendido sobre un recipiente. Agite los mejillones para extraer los jugos y reserve.", "Vierta los jugos en una licuadora junto con la espinaca reservada y otros ingredientes restantes 'Rockefeller'. Licúe hasta que quede suave y devuelva la salsa verde a la olla de mejillón.", "Retire la media coraza vacía de todos los mejillones y agregue las mitades completas a la salsa verde. Brevemente recalentar y servir."], "url": "www_bbc_co_uk_food_recipes_mussels_rockefeller_21768", "title": "Mejillones estilo 'Rockefeller'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_rockefeller_21768_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, en cubos", "2 palitos de apio picados", "1 cebolla picada", "6 rebanadas de tocino ahumado, cortado en lardons", "1 diente de ajo, picado", "1 cucharadita de curry en polvo", "1 pizca de nuez moscada rallada entera", "75ml / 2½fl oz pastis", "Mejillones grandes de 500g / 1lb 2oz", "Crema doble de 200 ml / 7 fl oz", "1 limón, solo jugo", "1 cucharada de perejil fresco picado", "1 cucharada de cebolletas frescas picadas", "pan crujiente, para servir"], "method": ["Limpia los mejillones. Quítese las barbas y enjuague con abundante agua fría y corriente. Deseche cualquier abierto que no se cierre cuando se aprieta ligeramente.", "En una olla grande con tapa, caliente la mantequilla y fríe con cuidado el apio picado, la cebolla y los lardones. Agregue el ajo y las especias. Revuelva y cocine durante unos minutos y luego agregue los pastis.", "Agregue los mejillones y coloque la tapa en la sartén. Cueza al vapor los mejillones hasta que se abran teniendo cuidado de no cocinarlos demasiado. Retire los mejillones con una cuchara ranurada y colóquelos en un tazón para servir. Deseche cualquier mejillón que no se haya abierto.", "Suba el fuego y cocine para reducir la salsa a un tercio del volumen antes de agregar la crema. Llevar a ebullición, luego agregar el jugo de limón y verter sobre los mejillones.", "Para servir, coloque los mejillones en un tazón grande para servir y esparza sobre las hierbas frescas."], "url": "www_bbc_co_uk_food_recipes_mussels_with_bacon_and_43156", "title": "Mejillones con tocino y pastis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1.5kg / 3lb 5oz", "100 ml / 3½ fl oz de vino blanco seco", "50g / 1¾oz de mantequilla", "1 chalote, finamente picado", "75 g / 2½ oz de Bayona o jamón serrano, finamente picado", "1 diente de ajo, rallado o picado muy fino", "1 puñado de perejil mezclado de flatleaf, estragón, perifollo y cebollín, picado", "pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Limpia y debesard los mejillones. Si se abren algunos mejillones, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos.", "Agregue 2 cucharadas de vino a una olla grande con tapa. Agregue los mejillones, cubra con la tapa y cocine a fuego alto durante 3-4 minutos, agitando la sartén periódicamente hasta que se hayan abierto (deseche los que no se abren). Retire del fuego y cuele en un colador sobre un tazón grande. Reserve el licor de cocina y mantenga calientes los mejillones.", "En la misma sartén, derrita la mantequilla y cocine suavemente la chalota, el jamón y el ajo durante 4-5 minutos, hasta que se ablanden pero no se doren. Agregue el licor de cocina del mejillón y el vino restante. Llevar a ebullición y cocinar hasta que el volumen del líquido se haya reducido a la mitad. Agregue los mejillones y las hierbas y mezcle bien, luego sazone con pimienta negra.", "Sirva en tazones calientes con un poco de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_mussels_with_bayonne_ham_91522", "title": "Mejillones con jamón de Bayona y chalotas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussels_with_bayonne_ham_91522_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.75kg / 4lb (4 pintas) mejillones", "2 chalotes, picados", "1 bulbo de hinojo, finamente cortado", "300ml / ½ pinta de vino blanco espumoso inglés", "2 cucharadas de perejil fresco picado", "Crema doble de 150 ml / 1/4 pinta", "½ limón, solo jugo", "25 g / 1oz de mantequilla sin sal", "1 cucharada de hojas de hinojo (o eneldo) picadas", "sal y pimienta negra recién molida"], "method": ["Limpie los mejillones a fondo, quitando las barbas, y deseche los que estén rajados, o permanezca abierto después de golpearlos bruscamente contra el borde del fregadero. Transfiera a una sartén grande y de fondo grueso con tapa.", "Agregue los chalotes, el hinojo, el vino y la mitad del perejil. Cubra con una tapa y cocine a fuego fuerte durante 6-7 minutos, o hasta que todos los mejillones se hayan abierto.", "Levante los mejillones en un colador colocado sobre un recipiente. Con cuidado, cuele el licor de cocina a través de una toalla de té limpia en un recipiente limpio y separado, y déjelo reposar durante cinco minutos para que la arena se hunda en el fondo. Deseche las verduras.", "Vierta el licor en una sartén limpia, teniendo cuidado de no alterar la arena en la parte inferior. Agregue cualquier licor del cuenco debajo de los mejillones. Agregue la crema y el jugo de limón, y hierva para reducir a la mitad. Agregue la mantequilla y el perejil restante, y ajuste el condimento.", "Mientras tanto, descarta cualquier mejillón que permanezca cerrado. Divídalos entre cuatro platos de sopa, vierta la salsa, espolvoree con hojas de hinojo (o eneldo) y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mussels_with_sparkling_09137", "title": "Mejillones con vino espumoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb mejillones", "2 cucharadas de aceite de oliva", "media cebolla, finamente picada", "2 rebanadas gruesas o 5 rebanadas finas del jamón o del prosciutto, cortado en cuadritos", "100 ml / 3½ fl oz de vino blanco seco", "3 cucharadas de jerez"], "method": ["Frota bien los mejillones, luego saca las pequeñas barbas y deséchalas.", "Calentar el aceite en una sartén pesada y cocinar la cebolla durante cinco minutos hasta que esté suave.", "Agregue el jamón, el vino blanco y el jerez y deje que hierva. Agregue los mejillones y sujete la tapa con fuerza.", "Deje que hierva durante un minuto, luego agite bien la sartén, quite la tapa y use un par de tenazas para quitar los mejillones a medida que se abren. Cuando todos los mejillones se hayan abierto (deseche los que no estén), vuelva a colocarlos en la sartén y mezcle bien en la salsa y transfiera a un plato grande.", "Sirva caliente o a temperatura ambiente."], "url": "www_bbc_co_uk_food_recipes_musselsandjamonwiths_71469", "title": "Mejillones y jamón con jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "40g / 1½ oz chalotes, picados", "pellizco de hebras de azafrán", "1 hoja de laurel", "1 ramita de tomillo fresco", "1 ramita de estragón fresco", "200ml / 7fl oz de vino blanco", "100ml / 3½fl oz doble o crema batida", "200ml / 7fl oz de caldo de pescado", "Mejillones de 1.5kg / 3lb 5oz, lavados y limpios - deseche los que no se cierran cuando se golpean", "sal y pimienta negra recién molida, al gusto"], "method": ["En una sartén grande, derrita la mantequilla. Agregue los chalotes y cocine hasta que estén suaves y translúcidos. Agregue el azafrán, la hoja de laurel, el tomillo, el estragón y el vino blanco y deje que hierva.", "Una vez que la mezcla se haya reducido a la mitad, agregue la crema y el caldo de pescado a la sartén y vuelva a hervir. Agregue los mejillones y coloque una tapa sobre la sartén.", "Una vez que la mezcla haya vuelto a hervir y los mejillones se hayan abierto, cuele los mejillones en un colador sobre una sartén para recoger la salsa. Deseche cualquier mejillón que no se haya abierto.", "Suavemente caliente la salsa hasta que se haya reducido aún más y sazone con sal y pimienta negra recién molida.", "Para servir, coloque los mejillones en un recipiente y vierta la salsa reducida sobre ellos."], "url": "www_bbc_co_uk_food_recipes_musselsinasaffronwhi_86539", "title": "Mejillones en una salsa de vino blanco de azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "½ chile rojo, sin semillas y finamente picado", "1 tomate grande de vid, picado", "6 cucharadas de vino blanco seco", "sal y pimienta negra recién molida", "Mejillones de 110g / 4oz, barba eliminada (descartar los mejillones abiertos que no se cierran cuando se golpean firmemente)", "1 limón, cortado en 4 cuñas"], "method": ["Calentar el aceite en una cacerola y freír el ajo, el chile y el tomate durante dos minutos. Agregue el vino y cocine a fuego lento hasta que la salsa se haya reducido a la mitad. Sazonar con sal y pimienta negra recién molida.", "Agregue los mejillones y cubra con una tapa. Cocine a fuego lento en el líquido durante 3-4 minutos hasta que se hayan abierto las cáscaras. Deseche cualquier mejillón con conchas que no se hayan abierto. Exprime el jugo de una rodaja de limón.", "Levante los mejillones, coloque en un tazón poco profundo y cuchara sobre la salsa. Adorne con las rodajas de limón restantes para servir."], "url": "www_bbc_co_uk_food_recipes_musselsmarinara_86888", "title": "Mejillones marinara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1 kg / 2¼ lb, limpios, lavados y sin barba", "2 chalotes, finamente picados", "2 dientes de ajo, finamente picados", "1 manojo de albahaca, recogido", "200ml / 7fl oz de vino blanco seco", "50g / 2oz de mantequilla", "1 baguette grande o 2 piezas pequeñas horneadas", "2 tomates de ciruela, sin piel, sin semillas y cortados en cubitos", "30 rebanadas de obleas finas panceta (aproximadamente 175 g / 6 oz), cortado por la mitad", "Mozzarella 175g / 6oz, rallado", "pimienta negra para sazonar"], "method": ["Derrita la mantequilla en una olla grande.", "Agregue el ajo picado y los chalotes y saltee (sin color) durante un minuto.", "Agregue los mejillones escurridos (descarte los que ya estén abiertos), la mitad de la albahaca, el vino blanco y la pimienta negra recién molida.", "Llevar a ebullición a fuego alto y luego cubrir de inmediato y cocinar durante 4 minutos.", "Retire los mejillones de la sartén con una cuchara con ranura y cuele el líquido a través de un colador fino en una olla.", "Cocine a fuego lento este líquido durante 10 minutos a fuego lento.", "Después de 10 minutos, agregue el resto de la albahaca, picada y los tomates, déjelos en infusión a fuego lento durante otros 8 minutos, manténgalos calientes.", "Mientras tanto, quita los mejillones de sus caparazones, descarta los que no se hayan abierto.", "Coloque cada mejillón en una pieza de la panceta en rodajas y enrolle. Ensarte horizontalmente en un pincho de madera y repita hasta que tenga 10 mejillones en cada pincho.", "Coloque los mejillones ensartados en una bandeja para hornear.", "Tome las baguettes y corte en 6 x 8 cm / 3¼ en barriles. Retire con cuidado los centros de cada uno dejando ½ cm / ¼ en el perímetro alrededor de los lados y la base. Coloque en una bandeja para hornear y hornee como se indica en el paquete, reduciendo el tiempo de cocción en 3 minutos.", "Coloque los pinchos de mejillones debajo de una parrilla precalentada y cocine por 2 minutos a cada lado a fuego medio.", "Espolvoree con mozzarella y destelle debajo de la parrilla por un minuto más o hasta que el queso comience a derretirse.", "Retire el pan del horno y colóquelo en platos hondos para servir.", "Vierta el jugo de mejillón en el centro del barril derecho de pan y coloque una brocheta de mejillones en la parte superior. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_musselskewersonfrenc_10300", "title": "Pinchos de mejillones en barril de pan francés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Migajas de brioche de 150g / 5oz (puede hacer las suyas mezclando un brioche en un procesador de alimentos)", "100g / 3½oz de coco desecado, tostado en una sartén seca", "1 cucharada de cilantro fresco picado", "1 cucharada de mantequilla ablandada", "1 chile rojo, finamente picado", "1 diente de ajo, triturado hasta formar una pasta con una pizca de sal", "sal y pimienta negra recién molida", "12 mejillones labiales verdes, listos para cocinar, la mitad inferior del caparazón en", "1 pomelo rosado, pelado, segmentado", "1 lima, solo jugo", "1 chile rojo, finamente picado", "12 lichis de una lata, escurridos, picados", "splash salsa Tabasco"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque las migas de pan brioche, coco tostado, cilantro, mantequilla, chile, ajo y sal y pimienta negra recién molida en un bol y mezcle bien.", "Coloque los mejillones, con el lado abierto hacia arriba, en una bandeja para hornear. Coloque una cucharada de la mezcla de migas de pan en cada mejillón para cubrir completamente la carne de mejillón. Coloque debajo de la parrilla y cocine durante 5-6 minutos, o hasta que la cobertura esté dorada.", "Para la salsa, coloque los segmentos de pomelo, jugo de lima, chile, lichis picados y Tabasco en un tazón y mezcle bien.", "Para servir, coloque tres mejillones en cada plato y sirva una cucharada de salsa al lado."], "url": "www_bbc_co_uk_food_recipes_musselswithcoconutcr_88894", "title": "Mejillones con corteza de migas de coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "1 cebolla pequeña, finamente picada", "2-4 chiles verdes, enteros", "pulgar tamaño jengibre fresco, pelado y machacado en una pasta en un mortero", "4 dientes de ajo, pelados y machacados en una pasta en una mano de mortero", "sal al gusto", "½ cucharadita de cúrcuma molida", "1 cucharada de sal masala", "3 tomates, cortados en cubos grandes", "Mejillones de 1kg / 2¼lb, frotados y sin barba", "60g / 2oz de coco desecado", "puñado de hojas y tallos frescos de cilantro picados"], "method": ["Calentar el aceite vegetal en una sartén mediana antiadherente y freír la cebolla hasta que se dore.", "Agregue los chiles, el jengibre y las pastas de ajo, la sal, la cúrcuma, el garam masala y los tomates, y cocine hasta que los tomates se ablanden y comiencen a descomponerse.", "Mientras tanto, cocine los mejillones en una olla grande de agua hirviendo durante unos tres minutos, hasta que se hayan abierto. Retírelos con una espumadera y déjelos a un lado. Reserve el agua", "Agregue el coco, el cilantro y un poco de agua de cocción a las especias y los tomates y revuelva. La mezcla de especias debe ser lo suficientemente espesa para cubrir los mejillones e ingresar a las conchas.", "Retire algunos de los mejillones de sus caparazones y deje otros en sus caparazones, para un efecto dramático y apetitoso. Agregue los mejillones a la mezcla de especias y revuelva bien. Sirve con arroz basmati."], "url": "www_bbc_co_uk_food_recipes_musselswithdrycoconu_86738", "title": "Mejillones con coco seco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de alcachofas cocidas de un recipiente, escurridas", "50g / 1¾oz de harina", "500ml / 18fl oz de aceite vegetal", "50g / 1¾oz de mejillones cocidos, conchas eliminadas", "1 cucharada de aceite de oliva", "1 diente de ajo", "½ cucharadita de vinagre de vino blanco", "½ pizca de vino blanco", "sal y pimienta negra recién molida"], "method": ["Para hacer las alcachofas, mezcle las alcachofas con la harina y sacuda el exceso.", "Caliente el aceite en una bandeja de fondo grueso (PRECAUCIÓN: el aceite caliente puede ser peligroso, no lo deje desatendido). Cuando esté caliente agregue las alcachofas y fría hasta que estén crujientes y doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para hacer la vinagreta, coloque todos los ingredientes de la vinagreta en un tazón y mezcle.", "Para servir, coloque las alcachofas y los mejillones cocidos en un plato, sazone y espolvoree la vinagreta."], "url": "www_bbc_co_uk_food_recipes_musselswithfriedarti_84375", "title": "Mejillones con alcachofas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "½ chile rojo, picado", "100g / 3½oz de arroz de grano largo", "85ml / 3fl oz de vino blanco", "200ml / 7fl oz de caldo de verduras calientes", "85g / 3oz de tomates cherry, cortados a la mitad", "2 cucharadas de perejil fresco picado", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Mejillones de 100 g / 3½ onzas, limpiados: deseche los que no se cierran cuando se golpean ligeramente"], "method": ["Para el risotto, caliente el aceite en una cacerola grande de fondo grueso, agregue la cebolla y fría a fuego lento hasta que se ablanden pero no se coloreen.", "Agregue el ajo y el chile y fría por un minuto.", "Agregue el arroz y revuelva sobre fuego suave hasta que los granos de arroz se vuelvan translúcidos.", "Agregue el vino, suba el fuego y hierva hasta que casi todo el líquido haya desaparecido. Agregue el caldo de verduras, una cucharada a la vez, y revuelva constantemente hasta que todo el caldo haya sido absorbido y el arroz esté tierno.", "Agregue los tomates, el perejil y la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida. Quite el calor, cúbralo con una tapa y déjelo durante 3-4 minutos.", "Para los mejillones, caliente el aceite de oliva en una olla grande hasta que esté muy caliente, agregue los mejillones, cubra con una tapa y agite la sartén sobre el fuego hasta que las conchas de mejillón se hayan abierto. Deseche cualquier que esté agrietado o no se haya abierto.", "Para servir, vierta el risotto en un tazón para servir, cubra con los mejillones y sirva."], "url": "www_bbc_co_uk_food_recipes_musselswithparsleyan_88585", "title": "Mejillones con risotto de perejil y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 chalotes, en rodajas finas", "1 tallo de limoncillo, ligeramente triturado", "1 guindilla, finamente picada", "100ml / 3½fl oz de vino blanco", "Mejillones de 450g / 1lb, lavados y sin barba (deseche cualquier mejillón que permanezca abierto después del lavado)", "Leche de coco 440ml / 15½fl oz", "Lichis de 150g / 5oz (frescos o enlatados; pelarlos si los usa frescos)", "sal y pimienta negra recién molida", "1 cucharada de cilantro fresco picado, para servir", "cuñas de lima, para servir"], "method": ["Caliente el aceite de oliva en una sartén grande antiadherente con tapa. Agregue los chalotes, el tallo de la hierba de limón y el chile y fría hasta que estén suaves pero no coloreados.", "Agregue el vino blanco a la sartén y deje hervir.", "Agregue los mejillones, la leche de coco y los lichis. Cubra la olla con una tapa y agite bien.", "Después de 2-3 minutos, cuando los mejillones se hayan abierto, sazonar bien con sal y pimienta negra recién molida. Deseche cualquier mejillón que no se haya abierto.", "Para servir, coloque los mejillones en tazones y adorne con el cilantro espolvoreado sobre la parte superior y las rodajas de lima al lado."], "url": "www_bbc_co_uk_food_recipes_musselswithlycheeand_87249", "title": "Mejillones con lichi y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "25g / 1oz de hojas frescas de albahaca", "2 dientes de ajo", "1 cucharada de semillas de sésamo", "sal y pimienta negra recién molida", "Pasta de 150 g / 5½ oz de su elección, cocida de acuerdo con las instrucciones del paquete", "1 cucharada de aceite de oliva", "1 chalota, en rodajas", "50ml / 2fl oz de vino blanco", "Mejillones frescos de 200g / 7oz en sus conchas, barbas quitadas", "50g / 1¾oz de queso azul", "sal y pimienta negra recién molida"], "method": ["Precalentar la parrilla a su configuración más alta.", "Para hacer la pasta al pesto, coloque el aceite, la albahaca fresca, los dientes de ajo y las semillas de sésamo en el procesador de alimentos. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar hasta lograr una consistencia suave.", "Coloque el pesto en un recipiente grande, agregue la pasta cocida y revuelva para cubrir.", "Para los mejillones, caliente el aceite de oliva en una olla con tapa a fuego medio. Agregue el ajo y los chalotes y saltee durante dos minutos, hasta que se ablanden.", "Agregue los mejillones y el vino blanco, revuelva bien y coloque la tapa. Deje que los mejillones hiervan durante 3-4 minutos, luego quite la tapa y verifique que todos los mejillones estén cocidos y hayan abierto. Deseche cualquier que no se haya abierto.", "Seleccione 10 mejillones grandes, ábralos y deseche la mitad vacía del caparazón. Coloque los mejillones en una bandeja para hornear, revuelva sobre el queso azul, sazone con sal y pimienta negra recién molida y coloque debajo de la parrilla durante dos minutos, hasta que el queso se haya derretido.", "Para servir, coloque la pasta en el centro de un plato caliente y coloque los mejillones en sus conchas."], "url": "www_bbc_co_uk_food_recipes_musselswithpestopast_81621", "title": "Mejillones con pasta al pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "Mejillones de 400g / 14oz, limpios (descarte los que no se cierran al tocar ligeramente)", "½ chalota, finamente picada", "2 dientes de ajo, finamente picados", "150ml / ¼ de pinta de vino blanco", "½ limón, solo jugo", "2 cucharadas de eneldo fresco picado", "2 cucharadas de perejil fresco picado", "Espaguetis a 200 g / 7 oz, cocinados de acuerdo con las instrucciones del paquete y rociados con aceite de oliva"], "method": ["Caliente el aceite de oliva en una sartén grande hasta que esté humeante, agregue los mejillones y cocine, agitando la sartén con frecuencia, hasta que todas las conchas estén abiertas. Descarta cualquiera que no se abra.", "Agregue la chalota y el ajo, baje el fuego y cocine suavemente durante 1-2 minutos.", "Agregue el vino y cocine a fuego lento durante un minuto, luego agregue el jugo de limón y las hierbas y cocine por un minuto más.", "Agregue los espaguetis cocidos a la sartén y mezcle bien para cubrir.", "Para servir, colóquelo en tazones para servir."], "url": "www_bbc_co_uk_food_recipes_musselswithspaghetti_85894", "title": "Mejillones con espagueti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 salchichas de cerdo regordetas", "2 cucharadas de mostaza de grano", "una cucharada de mostaza Dijon suave", "3 cucharadas colmadas de miel", "2 cucharadas de jugo de limón", "750g / 1lb 10 zanahorias", "un gran botón de mantequilla"], "method": ["Coloque el horno a 200C / 400F / Gas 6.", "Coloque las salchichas en un molde para asar lo suficientemente grande como para tomarlas en una sola capa. Si se superponen, no se cocinarán correctamente.", "En un tazón mezcle las mostazas, la miel y el jugo de limón. Revuelva bien y vierta sobre todas las salchichas. Hornee por 25-30 minutos, enrolle las salchichas en la mezcla de miel y mostaza una o dos veces durante la cocción, para que eventualmente tomen una capa pegajosa y brillante.", "Mientras tanto, para hacer el puré, recortar y fregar las zanahorias, cortar en trozos y amontonar en un cesto de vapor o un colador de metal balanceado sobre una olla de agua hirviendo a fuego lento. Vapor, cubierto, durante 15-20 minutos o hasta que esté tierno.", "Retira las zanahorias del vaporizador y machaca con un generoso pomo de mantequilla. Divida el puré entre 4 platos y haga estallar las salchichas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_mustard_and_lemon_49577", "title": "Salchichas de mostaza y limón con puré de zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_and_lemon_49577_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 3oz mejillones", "rociar aceite de oliva", "1 chalote, finamente picado", "2 dientes de ajo, finamente picados", "75ml / 2½fl oz de vino blanco seco", "puñado de perejil fresco, picado", "pan crujiente, para servir"], "method": ["Limpia y debesard los mejillones. Si se abren algunos mejillones, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos.", "Caliente el aceite de oliva en una sartén ancha de base pesada. Agregue los chalotes y el ajo y cocine hasta que estén suaves, pero no dorados.", "Agregue el vino a la sartén y hierva por un minuto para quemar el alcohol.", "Agregue los mejillones a la sartén. Agregue la mayor parte del perejil picado, tape la olla con una tapa y cocine los mejillones durante aproximadamente 3-4 minutos, agitando la sartén de vez en cuando. Los mejillones se cocinan cuando se abren. Asegúrese de descartar cualquiera que no se abra.", "Espolvoree el perejil restante, luego coloque los mejillones en un tazón para servir. Verter sobre el líquido de cocción y servir con un poco de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_musselswithwineandpa_90229", "title": "Cómo cocinar mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4 como entrante", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/musselswithwineandpa_90229_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 250 g de corvejones de jamón ahumado", "1 cebolla, pelada", "8 dientes", "1 x 440 ml puede secar la sidra", "½ cucharadita de pimienta negra", "100g / 3½oz de azúcar moscatel marrón oscuro", "pellizcar clavos de tierra", "75g / 2½oz de mostaza inglesa", "30g/1oz pasilla chillies", "200 g / 7oz de azúcar mascabado", "50g / 1¾oz de pulpa de tamarindo", "100ml / 3½fl oz de vinagre de vino tinto", "4 cucharadas de puerto o brandy", "1 estrella de anís", "4 dientes", "200 g / 7 oz de pasas", "500g / 1lb 2oz de patatas harinas, cortadas en trozos pequeños", "Apio galopante de 1 kg / 2 lb 4 oz, cortado en trozos aproximadamente el doble del tamaño de la patata", "50g / 1¾oz de mantequilla", "100g / 3½ oz de crema", "sal y pimienta negra recién molida", "3 cucharadas de vinagre de vino tinto", "½ limón, solo jugo", "Yogur natural de 75g / 2½oz", "35 g / 1 g de mayonesa", "¼ cucharadita de mostaza integral", "¼ cucharadita de mostaza inglesa", "½ apio nabo (aproximadamente 350 g / 12 oz), muy finamente cortado", "2 manzanas Granny Smith, muy finamente cortadas", "perejil pequeño de hojaldre, toscamente picado"], "method": ["Para los corvejones de jamón, remoje los corvejones de jamón durante la noche en una olla grande de agua fría. Escurra al día siguiente para eliminar el exceso de sal (esto se aplica con un jamón no ahumado también), manteniendo el jamón en la sartén.", "Stud la cebolla con los dientes de ajo, luego agregue a la sartén con la sidra y los granos de pimienta. Agregue suficiente agua fría para cubrir el jamón, cubra con una tapa y lleve a ebullición. Una vez que esté hirviendo, reduzca el fuego a fuego lento y cocine por 2 horas hasta que el jamón esté tierno hasta la punta de un cuchillo, llenando con agua hirviendo para cubrir el jamón nuevamente si es necesario.", "Mientras tanto, para hacer el chutney. Calentar una sartén a fuego medio. Una vez caliente, agregue los chiles, revolviendo continuamente durante unos minutos hasta que huelan fragante y delicioso. ¡Trata de no quemarlos o pasarán de deliciosos a amargos! Transfiera a un recipiente y cúbralo con agua hirviendo del recipiente (al menos 100 ml / 3½ fl oz).", "Agregue el azúcar a una cacerola pequeña y derrita con la pulpa de tamarindo. Agregue el vinagre, el brandy, las especias y las pasas y déjelos hervir a fuego muy lento a fuego muy lento.", "Mientras tanto revisa los chiles. Cuando esté suave, use una batidora para mezclarlas hasta obtener una pasta homogénea. Agregue los chiles al resto de la salsa picante y cocine a fuego lento a fuego lento durante 10 minutos, sazonar generosamente con sal.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Levante los corvejones de la sartén en una rejilla de alambre en una lata de asar (reservar el licor de cocción). Cuando esté lo suficientemente frío como para manipularlo, quite la piel del jamón (no la grasa) con un cuchillo afilado. Deseche la piel (o guárdela para hacer crujir) y califique ligeramente la grasa en diamantes. Mezcle el azúcar mascabado, el clavo molido y la mostaza y frótelo sobre la grasa del jamón.", "Vierta 200ml / 7fl oz del licor de cocción de jamón en la lata de asar (para que la carne no se seque cuando se tuesta), y tueste los corvejones en una rejilla por 35 minutos hasta que la grasa esté dorada y glaseada. Retire del horno y deje reposar.", "Mientras tanto, para el puré de apio nabo, hierva o hierva la papa y el apio nabo juntos durante unos 15 minutos, hasta que estén tiernos. Luego, usando un montón de grasa en el codo, revuelva aproximadamente todo, revolviendo la mantequilla y la nata fresca sobre la marcha. Si prefiere un puré súper suave, use un batidor eléctrico. Sazone al gusto con sal y pimienta.", "Para la ensalada, mezcle todos los ingredientes excepto el apionabo, la manzana y el perejil, juntos en el fondo de un plato para servir. Mezcle el apionabo y la manzana en el aderezo con el perejil.", "Para servir, saque el jamón del hueso en trozos grandes y sirva con puré de apio, ensalada y salsa picante."], "url": "www_bbc_co_uk_food_recipes_mustard_and_muscovado_29561", "title": "Brochetas de jamón asado con puré de apionabos, apio nabo y ensalada de manzana y una pasas de uva pasas y chutney", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 lonchas de tocino rayado, sin corteza", "Harina de auto aumento de 450 g / 1 lb, más extra para quitar el polvo", "sal pizca generosa", "pizca de polvo de hornear", "1 cucharadita de mostaza inglesa en polvo", "110 g / 4¼ oz de mantequilla sin sal, cortada en cubitos", "1 huevo de gallinas camperas, ligeramente golpeado", "Crema doble 50ml / 2fl oz", "2 cucharadas de mermelada de cebolla preparada, más extra para servir", "200ml / 7fl oz de leche entera"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Precaliente la parrilla a un ajuste medio-alto. Cuando la parrilla esté caliente, ase el tocino durante 2-3 minutos por cada lado, o hasta que esté crujiente y dorado. Poner a un lado en un plato forrado con papel de cocina. Cuando se enfríen lo suficiente como para manipularlos, desmenuza en trozos pequeños. Dejar de lado hasta que sea necesario.", "Tamiza la harina, la sal y el polvo de hornear en un tazón grande. Agregue el polvo de mostaza.", "Agregue la mantequilla en cubos al tazón, luego frote la mantequilla en la mezcla de harina con la punta de los dedos hasta que la mezcla se asemeje a migajas de pan finas.", "Haga un pozo en el centro de la mezcla seca y agregue el huevo batido y la crema, dibujando gradualmente la mezcla seca en la mezcla húmeda con una cuchara de madera.", "Agregue la mermelada de cebolla y las piezas reservadas de tocino, luego agregue gradualmente suficiente leche para hacer que la mezcla se una como una masa suave. (La mezcla no debe ser pegajosa)", "Espolvoree una superficie de trabajo limpia con un poco de harina. Voltee la masa sobre la superficie de trabajo y extiéndala hasta un grosor de 2.5 cm / 1 pulg. Sello de 12 rondas de 5cm / 2in de la masa con un cortador de galletas, colocándolos en una bandeja para hornear antiadherente sobre la marcha.", "Hornee los bollos en el horno durante 15-20 minutos o hasta que estén dorados y dorados. Déjelo enfriar en una rejilla de alambre durante al menos 10 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_mustard_bacon_and_64379", "title": "Bollos de cebolla con mostaza, tocino y caramelizada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mustard_bacon_and_64379_16x9.jpg", "isVegetarian": false, "recommendations": 0}]