[{"isVegetarian": true, "title": "Mocha hazelnut cream horns", "url": "www_bbc_co_uk_food_recipes_mocha_hazelnut_cream_95152", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting ", "½ tsp salt ", "250g/9oz very cold unsalted butter, cut into cubes ", "1 free-range egg, beaten for egg wash ", "1 tbsp demerara sugar, for sprinkling", "50g/1¾oz mascarpone ", "25g/1oz icing sugar, plus extra for dusting", "200ml/7fl oz double cream ", "2 tbsp instant coffee, mixed with 1 tbsp boiling water to make a paste", "100g/3½oz dark chocolate (minimum 70% cocoa solids)", "50g/1¾oz roasted hazelnuts, chopped"], "serves": "Makes 12 cream horns", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, sift the flour and salt into a bowl. Add the butter and use your fingertips to break up the bits of butter so they form flakes throughout the flour. Add 125ml/4fl oz ice-cold water and mix using a spatula until the dough comes together. Briefly knead then cover and chill in the freezer for 15 minutes.", "Lightly dust a work surface with flour and roll out the dough into a rectangle about 4mm thick.  With a short side nearest, fold down the top third into the middle, then fold the bottom third up over. Turn the pastry by 90 degrees (a quarter turn). Roll out into a rectangle again and repeat the folding process. Wrap in cling film and chill in the freezer for 10 minutes. ", "Roll out the chilled pastry again and repeat the folding process. Give it another quarter turn and roll and fold as before. Chill in the freezer for another 15 minutes.", "Preheat the oven to 220C/200C Fan/Gas 7. ", "On a lightly floured work surface roll the dough out to about 3mm thick. Cut out 12 long strips, about 2cm/¾in wide and 30cm/12in long. Wrap the moulds in the strips of pastry starting at the tip (do not cover the tip as the pastry will expand as it cooks) and working upwards, half overlapping. Place the horns seam-side down on a baking tray lined with a silicone mat. Place the tray in the freezer for 5 minutes.", "Brush the chilled horns with beaten egg and sprinkle with demerara sugar.  Bake for 10-12 minutes, until the pastry is crisp and golden-brown. Leave to cool for a few minutes before removing the moulds and placing the horns on a wire rack to cool completely.", "For the cream filling, put the mascarpone in a bowl and beat it using a wooden spoon until softened. Sift in the icing sugar, mix through thoroughly.", "In a separate bowl whip the cream until soft peaks form when the whisk is removed. Fold the whipped cream into the mascarpone using a metal spoon. Gently stir in the cooled coffee mixture. Spoon the mixture into a piping bag fitted with a star nozzle.", "For the topping, melt the chocolate in the microwave or in a heatproof bowl set over a pan of gently simmering water. Place the chopped nuts in a bowl. ", "Once the pastry horns have cooled, brush the inside of each one with melted chocolate and tip upside down to drain out any excess. Dip the tops of the horns into the chocolate and then dip in the nuts. Chill until the chocolate is set.", "Fill the horns with the cream mixture and dust with icing sugar. Serve immediately."]}, {"isVegetarian": true, "title": "Mojito", "url": "www_bbc_co_uk_food_recipes_mojito_85338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mojito_85338_16x9.jpg", "ingredients": ["1½ limes, cut into wedges", "20 fresh mint leaves", "2½ tsp granulated sugar", "handful ice", "65ml/2½fl oz white rum", "splash soda water, to taste", "fresh mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the limes, mint and sugar into a sturdy highball glass and 'muddle' or mash with the end of a clean rolling pin, to bruise the mint and release the lime juice.", "Add the ice and pour over the rum.", "Add soda water to taste and stir well. Garnish with a mint sprig and serve."]}, {"isVegetarian": false, "title": "Mokatines", "url": "www_bbc_co_uk_food_recipes_mokatines_96500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mokatines_96500_16x9.jpg", "ingredients": ["40g/1½oz butter", "3 large free-range eggs", "75g/2½oz caster sugar", "65g/2¼oz self-raising flour", "1 tbsp cornflour", "50g/1¾oz butter", "1 tbsp instant coffee", "225g/8oz icing sugar, sifted", "40g/1½oz caster sugar", "1 large free-range egg yolk", "75g/2½oz softened butter", "2 tsp coffee essense", "4 tbsp apricot jam", "100g/3½oz chopped almonds, toasted ", "100g/3½oz white ready-to-roll fondant icing", "gel food colouring in dark brown"], "serves": "Serves 9", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a shallow 18cm/7in square cake tin and line the base with baking parchment.", "For the genoise, gently melt the butter in a pan, then set to one side to cool slightly. Measure the eggs and sugar into a large bowl and whisk at full speed until the mixture is pale, mousse-like and thick enough to leave a trail when the whisk is lifted from the mixture.", "Sift the flours together into a bowl. Carefully fold half the flour into the egg mixture, then gently pour half the cooled butter around the edge of the mixture and fold in. Repeat with the remaining flour and butter. Pour the mixture into the prepared tin.  ", "Bake for 35-40 minutes until well risen and the top of the cake springs back when lightly pressed with a finger. Leave to cool in the tin for a few minutes then turn out, peel off the parchment and finish cooling on a wire rack.", "To make the coffee icing, measure the butter into a small pan and gently heat until the butter is melted. Remove from the heat and stir in the coffee powder until dissolved. Add the icing sugar and beat until smooth and glossy. Set aside to thicken.", "For the crème au beurre moka, measure the sugar and 2 tablespoons water into a small heavy-based pan. Heat very gently until the sugar has dissolved.  Bring to the boil then boil steadily for 2-3 minutes or until the syrup is clear and forms a slim thread when pulled apart between 2 teaspoons.  (CAUTION: melted sugar is very hot. Take care not to burn yourself).", "Put the egg yolks into a small bowl and give them a quick whisk to break them up. Add the syrup in a thin stream over the yolks, whisking all the time until all the syrup is incorporated and the mixture is thick and cold (it’s easiest to do this in a freestanding mixer). ", "In another bowl, cream the butter until very soft and gradually beat in the egg yolk mixture. Stir in the coffee essence to flavour. Spoon into a piping bag fitted with a number 7 star nozzle.", "To assemble, cut the cold cake in half horizontally and sandwich the slices together with the coffee icing. Trim the edges and cut the cake into 9 equal squares.  ", "Heat the apricot jam in a pan, then pass through a sieve into a small bowl.  Brush the sides of the cakes with apricot jam and press the chopped almonds around the sides. ", "Pipe tiny rosettes of crème au beurre moka very close together around the top edge of the cakes (they should create a solid outline that can be filled with icing). Pipe tiny rosettes of crème au beurre moka around bottom edge of the cakes.   ", "For the fondant icing, knead the fondant icing until soft (if it’s really hard heat it in a microwave for a few seconds). Beat with a wooden spoon until smooth (alternatively you can do this in a food processor). Gradually beat in 4 tablespoons water and enough food colouring to make a coffee coloured glaze. Carefully spoon the glaze into the centre of the top of the cakes and leave to set. "]}, {"isVegetarian": true, "title": "Mojito mint tea", "url": "www_bbc_co_uk_food_recipes_mojitominttea_84409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 fresh mint leaves", "2 tsp brown sugar", "20ml/¾fl oz lime juice", "50ml/1¾fl oz white rum", "200ml/7fl oz hot water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mint and brown sugar into the bottom of a tall heatproof glass.", "Add the lime juice and mix (muddle) together with the end of a clean rolling pin or wooden spoon.", "Add the rum, then the hot water and serve."]}, {"isVegetarian": true, "title": "Molten chocolate pudding", "url": "www_bbc_co_uk_food_recipes_moltenchocolatepuddi_86227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4¼oz unsalted butter, plus extra for greasing", "150g/5oz chocolate (70 per cent cocoa solids)", "4 free-range eggs", "75g/2½oz caster sugar", "50g/2oz self-raising flour, plus extra for dusting", "1 tbsp cocoa powder, plus extra for dusting", "mascarpone, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the butter and chocolate into a heatproof bowl. Place the bowl over a pan of barely simmering water, and allow the chocolate and butter to melt.", "Once the chocolate and butter have melted, stir to combine, then set aside and allow to cool.", "Place the eggs and sugar into a clean bowl and whisk for 4-5 minutes, or until pale and light.", "Add the egg mixture to the chocolate mixture and gently fold together, taking care to maintain volume in the eggs.", "Add the flour and cocoa powder and fold in.", "Grease and flour six 200ml/7fl oz ramekins or dariole moulds.", "Divide the chocolate mixture among the ramekins. Place onto a baking tray and transfer to the oven to bake for 7-8 minutes, or until set, but still with some wobble in the centre.", "Loosen the puddings and very carefully turn each out onto plates.", "Dust the puddings with cocoa powder and serve with a dollop of mascarpone on top."]}, {"isVegetarian": false, "title": "Momma's meat jambalaya", "url": "www_bbc_co_uk_food_recipes_mommasmeatjambalaya_76386", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mommasmeatjambalaya_76386_16x9.jpg", "ingredients": ["8 tbsp olive oil", "1 onion, chopped", "3 mixed peppers, chopped", "2 tbsp garlic, crushed", "4 links chorizo sausage, chopped", "450g/1 lb chicken pieces, on or off the bone", "2 Scotch Bonnet or other hot chilli peppers, 1 red, 1 yellow, chopped", "500g/1 lb 1oz easy-cook American-style rice", "1 tsp chilli powder", "2 tbsp turmeric", "2 tbsp Cajun spices", "2 pints chicken stock or water", "mixed vegetables, such as carrots, peas, green beans, sprouts, courgettes, chopped (frozen vegetables will suffice)", "450g/1 lb king prawns or crayfish", "salt and freshly ground black pepper"], "serves": "4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large pan and add the onion, mixed peppers, garlic, chorizo and chicken pieces. Cook for about ten minutes.", "Add the chilli peppers. These are very hot so be careful how many you add. When handling them, take care if you have any cuts as they will really hurt.", "Add the rice and stir well. Add the chilli powder, turmeric and Cajun spices and mix in so the rice is well coated with the flavours.", "Add the chicken stock or water and bring to a simmer.", "Add the mixed vegetables and bring to the boil then turn the heat down to a simmer.", "Once the rice has swollen and is part-cooked, add the prawns or crayfish.", "Simmer for about 45 minutes to an hour. Taste for seasoning and add salt and freshly ground black pepper and more spices, depending on your personal taste.", "Serve."]}, {"isVegetarian": false, "title": "Monkfish Bourguignon", "url": "www_bbc_co_uk_food_recipes_monkfish_bourguignon_29096", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "1 fresh globe artichoke, heart only, quartered", "1 monkfish tail, filleted, skin removed, quartered, carcass reserved", "100g/3½ oz pancetta, chopped in 1 cm cubes", "8 small shallots ", "2 garlic cloves, 1 crushed, 1 finely sliced ", "150ml/5fl oz red wine", "200ml/7fl oz dark chicken stock", "8 chestnut mushrooms, quartered ", "4 sprigs thyme, leaves only", "25g/1oz unsalted butter", "4 sprigs parsley, leaves only, finely chopped"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pour 3 tablespoons olive oil into a heavy-based, lidded saucepan over a low heat and add the artichoke quarters. Cover with a lid and cook for 5–6 minutes. Remove from the heat and set aside.", "Put 1 tablespoon oil in a large frying pan over a high heat. Quarter the monkfish carcass and fry for 5–6 minutes on all sides. Reduce the heat and stir in half the pancetta, half the shallots and crushed garlic. Pour in the red wine and simmer until the liquid has reduced by half. Stir in the stock and reduce by half again. Strain through a fine sieve into a clean saucepan and place back onto the heat to reduce for a final time. Season.", "Meanwhile, season the monkfish meat with salt and pepper and place into a clean frying pan over a high heat with 1 tablespoon olive oil. Cook for 4–5 minutes on both sides.", "Add the cooked artichokes, mushrooms, sliced garlic, remaining pancetta, 4 shallots and the fish into the simmering sauce. Cover with a lid and cook for 1–2 minutes. Remove the fish from the pan and allow to rest.", "Add the thyme leaves to the sauce and reduce further if it needs to thicken slightly. Whisk in the butter.", "Slice the fish diagonally into nuggets and divide between 2 plates, pour over the sauce and finish with chopped parsley. "]}, {"isVegetarian": false, "title": "Monkfish blanquette with duchesse potatoes", "url": "www_bbc_co_uk_food_recipes_monkfish_blanquette_with_02834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large baking potatoes", "25g/1oz butter", "3 free-range eggs, yolks only", "salt and freshly ground black pepper", "1litre/1¾ pints fish stock ", "1kg/2lb 2oz monkfish fillet, cut into large chunks", "25g/1oz butter, plus extra for frying", "25g/1oz plain flour ", "110g/4oz baby onions peeled ", "110g/4oz button mushrooms, quartered ", "4 free-range eggs, yolks only", "250ml/9fl oz double cream ", "3 tbsp tarragon leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the potatoes, preheat the oven to 200C/400F/Gas 6.", "Bake the potatoes in the oven for about 1 hour 15 mins until tender when pierced by a knife.", "Remove and cool enough to handle then scoop out the flesh and pass through a fine sieve into a bowl.", "Beat to a smooth and fluffy purée then add the butter and egg yolks. Season to taste with salt and freshly ground black pepper.", "Spoon into a piping bag then pipe little pyramids onto a baking tray and place in the oven for 5-10 minutes until golden-brown.", "For the blanquette, put the fish stock into a large sauté pan and bring to a gentle simmer.", "Add the monkfish and return to a simmer, then poach for five minutes until just cooked through. Remove from the stock and set aside.", "Heat a heavy-based saucepan over a medium heat. Add the butter and melt, then add the flour and keep stirring until it is completely absorbed. ", "Gradually whisk in the fish stock, and keep stirring until all the stock has been added. ", "Heat a frying pan over a medium heat, add a little more of the butter and the onions and cook until coloured slightly then add the mushrooms and cook for a further two minutes then tip into the fish sauce.", "Return the monkfish to the sauce and bring to a simmer.", "Whisk the egg yolks and cream together in a bowl then gradually add to the fish sauce, whisking as you go. ", "Remove from the heat and continue to whisk for a couple of minutes. Stir in the tarragon and check the seasoning.", "To serve, place a couple duchess potatoes onto each plate. Spoon the blanquette alongside and finish with a little more tarragon."]}, {"isVegetarian": false, "title": "Mom’s meatloaf", "url": "www_bbc_co_uk_food_recipes_moms_hockey_puck_88058", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/moms_hockey_puck_88058_16x9.jpg", "ingredients": ["2 slices white bread", "1kg/2lb 4oz beef mince", "1 large red onion, chopped", "3 tbsp tomato ketchup", "1 free-range egg", "2 tbsp brown sauce", "1 tsp Worcestershire sauce", "70g/2½oz parmesan cheese, grated", "1 tbsp chopped fresh oregano", "1 tbsp chopped fresh parsley", "1 tbsp milk", "sea salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the bread in a food processor and pulse to make breadcrumbs.", "Mix the breadcrumbs with the remaining ingredients in a large bowl until the mixture pulls away from the sides of the bowl and forms a ball. ", "Form the mixture into a loaf shape and place in an ovenproof dish or loaf tin. Bake in the oven for 50–60 minutes, or until a skewer inserted into the centre comes out clean. "]}, {"isVegetarian": false, "title": "Monkfish cheeks and crisps with a ketchup dressing and tarragon mayonnaise", "url": "www_bbc_co_uk_food_recipes_monkfish_cheeks_and_74056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 monkfish cheeks, trimmed (ask your fishmonger to do this)", "1 tbsp fennel seeds, crushed", "1 tbsp coriander seeds, crushed", "1 lemon, zest and juice", "3 tbsp olive oil", "salt", "small bunch micro basil, to serve", "2 large shallots, roughly chopped", "20 small capers", "100ml/3½fl oz tomato ketchup", "1tbsp red wine vinegar", "50ml/1¾oz extra virgin olive oil", "2 tbsp Worcestershire sauce ", "5 small tomatoes, heirloom if possible, quartered", "small bunch basil, roughly chopped ", "small bunch parsley, roughly chopped", "salt and freshly ground black pepper", "3 large Maris Piper potatoes, peeled", "4 tbsp malt vinegar ", "fine sea salt, to taste", "300ml/10fl oz olive oil", "bunch tarragon", "1 free-range egg ", "1 free-range egg yolk ", "1 tbsp Dijon mustard ", "salt", "squeeze lemon juice "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the monkfish, fennel seeds, coriander seeds, lemon zest and olive oil in a sealable bag. Put in the fridge and marinate for 30 minutes.", "To make the dressing, mix together all the ingredients and season to taste.", "To make the crisps, heat a deep-fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended). Using a spiraliser, slice the potato into long thin strips. Deep-fry the strips until crispy, drain on kitchen paper and season with salt and vinegar.", "To make the mayonnaise, blend the olive oil and tarragon in a food processor to make a green oil. Remove from the blender and set aside. Put the whole egg, egg yolk, mustard and salt into the food processor and blend. Slowly add the green oil, while blending, until thick and creamy. Finish with a squeeze lemon.", "Heat the oil in a frying pan placed over a high heat. Cook the monkfish for 2–4 minutes on each side, until cooked through. Squeeze over half of the lemon juice before removing from the pan.", "To serve, divide the potato crisps and the monkfish cheeks between two plates. Drizzle with the dressing and scatter over the micro basil leaves. Serve the mayo on the side. "]}, {"isVegetarian": false, "title": "Monkfish, chorizo and chickpea salad with balsamic, tomato and lemon dressing", "url": "www_bbc_co_uk_food_recipes_monkfish_chorizo_and_98370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tail of monkfish, loins removed ", "1 tbsp olive oil", "pinch saffron", "1 tsp paprika", "200g/7oz chorizo, cut into 1cm/½in cubes", "1 x 400g/14oz tin chickpeas, drained", "1 tbsp aged balsamic vinegar", "100g/3½oz green olives, stoned, halved", "4 vine-ripened plum tomatoes, seeds removed and finely chopped", "1 small red onion, peeled and finely chopped", "150g/5½oz fresh shrimps peeled ", "1 lemon, juice only", "salt and freshly ground black pepper", "1 tbsp fresh chives, finely chopped", "1 frisée lettuce, central leaves removed"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the monkfish in a bowl and add the olive oil, saffron and paprika. Mix them together, cover in cling film and place in the fridge for two hours, but no longer, as the acidity will start to cook the fish. ", "Heat a large frying pan and add the chorizo. Once the oil has been released and it has started to crisp up, pour some of the oil from the pan into a bowl and set aside. Add the chickpeas to the frying pan and cook for a further 4-5 minutes.", "Remove from the heat, add the aged balsamic and green olives, and set aside.", "Place the tomatoes, red onion and shrimps in a bowl and mix. ", "Add the lemon juice to the chorizo oil, season with salt and pepper, and set aside.", "Heat a large frying pan, add the monkfish and seal all over, then cook for 5-8 minutes (depending on the size of the loin). Remove from the heat and set aside to rest for five minutes.", "To serve, add a couple of tablespoons of the chorizo dressing and chives to the shrimp salad and dot it around the plates. Put a spoonful of the chorizo and chickpea salad in a line in the centre of the plates. Slice the monkfish on an angle and place on top of the chickpeas. Top with some frisée lettuce and drizzle more dressing over the top."]}, {"isVegetarian": false, "title": "Monkfish, Israeli couscous, sea vegetables and chorizo", "url": "www_bbc_co_uk_food_recipes_monkfish_israeli_55616", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz couscous", "2g salt", "50ml/2fl oz olive oil", "squeeze lemon juice", "10g chopped roasted hazelnuts", "10g chopped roasted pistachios", "10g chopped parsley", "10g chopped chives", "100ml/3½fl oz olive oil", "4 x 120g/4oz monkfish fillets", "salt", "½ lemon, juice only", "2 small uncooked chorizos, halved lengthways", "50g/1¾oz sea aster", "50g/1¾oz sea fennel", "50g/1¾oz sea purslane", "50ml/2fl oz olive oil", "10g chopped parsley", "10g chopped chives", "10 green olives, stones removed, roughly chopped", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Israeli couscous, place your couscous into a pan with the salt, olive oil and 100ml/3½fl oz water. Bring to boil and then remove from the heat, cover with cling film and allow to steam for 10 minutes.", "Once the couscous is cooked, add few drops of lemon juice, nuts and chopped herbs and stir through. Cover again with cling film and keep warm.", "For the monkfish and chorizo, heat two non-stick pans with a little oil. Season the monkfish with a little salt, then place into the hot pan skin-side down and cook for 2-3 minutes, or until golden-brown. Turn over, add the lemon juice and leave in the pan for one minute to rest.", "At the same time, cook the chorizos in the other pan, placing them cut-side down, without any seasoning.", "For the sea vegetables, bring a small pan of unsalted water to the boil. Add the sea vegetables and cook for 30 seconds, then remove and drain.", "For the olive oil sauce, in a small pan gently warm the olive oil, parsley, chives, green olives and lemon juice. This will take about two minutes.", "To serve, put 3-4 tablespoons of the couscous into each serving bowl, place the monkfish on top and then sit a piece of chorizo on top of that. Arrange the sea vegetables around and over the fish. Spoon 2-3 tablespoons of the olive oil sauce over the fish and serve."]}, {"isVegetarian": false, "title": "Monkfish tail with blackened spices, purple sprouting broccoli and slightly spiced mussels", "url": "www_bbc_co_uk_food_recipes_monkfish_tail_with_39134", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 200g/7oz monkfish fillets, from a 1.5-2kg tail", "110g/4oz coarse sea salt  ", "110g/4oz blackened curry powder (available from specialist suppliers)", "6 stems purple sprouting broccoli", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "1 tbsp olive oil ", "2 shallots, finely sliced", "1 garlic clove, sliced ", "2 sprigs thyme", "2 sprigs marjoram", "2 bay leaves", "2 tsp cumin seeds", "6 dried apricots", "6 tbsp golden raisins", "1 tsp ras el hanout", "110g/4oz cracked wheat", "325ml/12floz white chicken stock, hot", "1 tbsp mint leaves, shredded", "1 tbsp coriander leaves, shredded", "½ red chilli, finely chopped", "olive oil, for fryiing", "1 shallot, finely sliced", "1 fennel bulb, finely sliced", "1 tsp curry powder", "1 tsp ras el hanout", "pinch saffron", "2 tsp tomato paste", "500ml/18floz mussel stock or fish stock", "250ml/9floz double cream", "250ml/9floz Greek yoghurt", "1 lemon, juice only", "16 large fresh mussels", "chopped coriander, to garnish"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the fish, cover the monkfish in coarse sea salt for four minutes, then wash thoroughly in cold water, wrap the fish in a clean kitchen cloth or kitchen towel, place in the fridge and leave to dry (normally for around 4-6 hours).", "Once the fish is dry, coat it in the blackened curry powder until you can no longer see any of the fish’s natural colour.  Set aside until ready to cook.", "For the cracked wheat, heat a sauté pan until medium hot, add half the olive oil, the shallots, garlic, thyme, marjoram, bay and cumin until soft.", "Add the apricots and raisins and cook for two minutes.", "Add the ras el hanout cook for two minutes. Add the cracked wheat and turn the heat up to high until the wheat turns slightly golden-brown.", "Add the hot chicken stock, stir well then remove from the heat. Cover with a lid or cling film and leave to rest in a warm place for 20 minutes. ", "Break up using a fork then place back onto the heat to warm through with a splash more olive oil.", "Add the mint, coriander and chilli and check the seasoning.", "For the mussels, heat a sauté pan until medium hot, add the olive oil, shallots, fennel and curry powder. Cook until the vegetables are soft then add the ras el hanout, saffron and tomato paste and cook for two more minutes.", "Add the stock, reserving a few tablespoons for cooking the mussels later, and cook until reduced in volume by half.", "Add the cream and boil for 3-4 minutes.", "Add the Greek yoghurt and bring to boil. Add the lemon juice and season to taste with salt and freshly ground black pepper. Pass through a sieve then set aside. ", "To cook the mussels, heat the reserved stock in a lidded saucepan until simmering. Discard any mussels that are cracked, or any open ones that do not close when given a sharp tap. ", "Add the mussels and put the lid on the pan. Leave to steam until the mussels have opened. Discard any that do not open after steaming. ", "Remove the mussels from their shells and add to the sauce. Finish with the chopped coriander.", "For the broccoli, bring a pan of salted water to the boil, add the broccoli and boil for 2-3 minutes until just tender.", "Drain and season with a little salt and black pepper.", "To cook the monkfish, preheat the oven to 200C/400F/Gas 6. Heat the vegetable oil in a frying pan and then add the monkfish and fry one minute on each side. Then place in the oven for four minutes. Remove from oven and leave to rest for four minutes before serving. ", "To serve, spoon the cracked wheat into the centre of serving bowls.", "Carve the monkfish into two equally sized pieces and sit on top of the cracked wheat", "Spoon the sauce around the edge of the fish, then finish with the broccoli. "]}, {"isVegetarian": false, "title": "Monkfish tikka masala with roti", "url": "www_bbc_co_uk_food_recipes_monkfish_tika_masala_19350", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 cardamom pods", "1 mace flower", "30g/1oz cashew nuts", "30g/1oz ground almonds", "5cm/2in piece root ginger", "3-4 garlic cloves", "150g/5oz Greek-style yoghurt", "150ml/5fl oz double cream", "1 tsp lime juice", "1 tsp salt", "2 tbsp vegetable oil", "300g/11oz monkfish, trimmed and cut into 2.5cm/1in pieces", "2 garlic cloves, finely chopped", "5cm/2in piece root ginger, peeled and roughly chopped", "1 green chilli, finely chopped", "1 red onion, finely chopped", "3 tomatoes, roughly chopped", "200ml/7fl oz double cream", "300g/11oz plain flour", "150ml/5fl oz water"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the monkfish, break the cardamom pods and the mace flower. Place them into a heavy-based frying pan and dry-fry over a low heat for 2-3 minutes.", "Place the cardamom, mace and the remaining ingredients, except the monkfish, into a food processor and blend until smooth.", "Place the monkfish into bowl and pour over the marinade. Cover with clingfilm and chill in the fridge for 6-8 hours, or overnight.", "For the roti, place the flour into a bowl and gradually add the water, beating well to form a firm dough. Tip the dough out onto a floured work surface and knead for a couple of minutes until smooth. Cover the dough with clingfilm and set aside to rest for two hours. ", "Tear off walnut-sized pieces of dough and roll them out thinly to a diameter of 12.5cm/5in.", "Heat a frying pan until very hot and fry the dough for 1-2 minutes on each side (or until bubbles appear on the surface).", "Remove the roti from the pan with a pair of tongs and carefully hold it over a gas flame until puffed up. Repeat with the remaining dough.", "For the sauce, heat a wok until hot, add the oil, garlic, ginger and chilli and fry for 1-2 minutes until just coloured.", "Add the onion and cook for 2-3 minutes stir in the tomatoes and cook for 4-5 minutes until softened. Add the cream and return to a simmer.", "Heat a griddle pan until very hot, add the monkfish and griddle on each side for one minute until just cooked through. Then add the monkfish to the sauce and season, to taste, with salt and freshly ground black pepper. Finally, stir in the coriander.", "Place the roti onto the plate then spoon over the monkfish and sauce."]}, {"isVegetarian": false, "title": "Monkfish, mussel and prawn stew with sourdough (cioppino)", "url": "www_bbc_co_uk_food_recipes_monkfish_mussel_and_90131", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/monkfish_mussel_and_90131_16x9.jpg", "ingredients": ["700ml/1¼ pints fish stock or salted water", "12 large raw prawns, heads and shells removed but reserved, tails on", "3 tbsp red wine vinegar", "1 tbsp caster sugar", "2 tbsp olive oil", "30g/1oz butter", "5 garlic cloves, roughly chopped", "½ onion, roughly chopped", "1 stick celery, roughly chopped", "1 green pepper, deseeded and roughly chopped", "100ml/3½fl oz dry white wine", "1 tsp salt", "10 turns black peppermill", "½–1 tsp dried red chilli flakes", "400g tin chopped tomatoes", "20 mussels, scrubbed and debearded", "250g/9oz monkfish, cut into 4cm/1½in pieces", "1 tsp dried oregano", "6 slices sourdough bread", "1 garlic clove, peeled and cut in half", "olive oil", "small handful flatleaf parsley, roughly chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the stock to a simmer, add the prawn heads and shells and simmer for 20 minutes. Strain the stock into a clean bowl and set aside.", "Bring the vinegar and sugar to the boil in a small saucepan and simmer until reduced by half. Set aside.", "Heat the oil and butter in a large lidded saucepan. Stir in the garlic, onion, celery and green pepper and cook for 6–8 minutes or until soft. Add the white wine, salt, pepper, chilli flakes, tomatoes, fish stock and vinegar reduction. Simmer for 30 minutes, adding the oregano for the last 5 minutes. ", "Discard any mussels with broken shells and any that refuse to close when tapped. Add the prawns, cod and mussels, cover the pan with a lid and cook for 5 minutes. ", "Meanwhile, toast the sourdough on both sides and carefully singe slightly over a gas flame. Rub the toast with the cut-side of the garlic and drizzle with olive oil. ", "Before serving, discard any mussels that remain closed. Place a slice of the toast in each bowl, ladle in some stew and sprinkle with parsley."]}, {"isVegetarian": false, "title": "Monkfish and mussels with tarragon and mustard sauce", "url": "www_bbc_co_uk_food_recipes_monkfishandmusselswi_90143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp curry powder", "½ tsp salt", "600g/1lb 5oz monkfish tail, cleaned and cut into 4 pieces", "salt and freshly ground black pepper", "1 tbsp olive oil", "50g/2oz unsalted butter", "½ lemon, juice only", "40g/1½oz shallots, chopped ", "1 bay leaf", "1 sprig fresh thyme", "1 sprig fresh tarragon", "½ tsp saffron strands ", "200ml/7fl oz white wine", "1.5kg/3lb 6oz mussels, beards removed", "110ml/4fl oz double cream ", "200ml/7fl oz hot fish stock ", "1 tsp wholegrain mustard", "2 tbsp chopped fresh tarragon"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "In a bowl, mix together the curry powder and the salt until well combined. Dredge the monkfish pieces in the powder, then season with freshly ground black pepper.", "Heat the oil in an ovenproof frying pan over a medium heat, add the monkfish pieces and fry for 3-4 minutes on each side, or until just golden-brown on both sides.", "Add half of the butter to the pan, then transfer to the oven and cook for a further 4-5 minutes, or until the monkfish is cooked through. Remove from the oven and squeeze over the lemon juice. ", "Heat the remaining butter in a large frying pan over a medium heat until foaming. Add the shallots and fry for 2-3 minutes, or until softened.", "Add the bay leaf, thyme, tarragon and saffron strands and stir well.", "Add the white wine, stir well and bring the mixture to the boil. Reduce the heat to a simmer and simmer until the volume of liquid has reduced by half.", "Add the cream and the fish stock and bring the mixture to the boil.", "Add the mussels, cover the pan with a lid and cook for 4-5 minutes, shaking the pan occasionally, until the mussels have opened. Discard any mussels that remain closed.", "Remove the mussels from the pan using a slotted spoon and set aside. Continue to simmer the cooking liquor until it has thickened slightly.", "Add the mustard and the chopped tarragon and stir until well combined. Season, to taste, with salt and freshly ground black pepper and continue to simmer the mixture for a further 1-2 minutes.", "To serve, slice each of the monkfish pieces into two medallions. Place two of the monkfish medallions into the centre of each of four serving bowls. Remove half of the mussels from their shells and divide them among the bowls. Divide the remaining mussels between the bowls. Spoon over the tarragon and mustard sauce and serve immediately."]}, {"isVegetarian": false, "title": "Monkfish curry with lemongrass and lime leaf", "url": "www_bbc_co_uk_food_recipes_monkfishcurrywithlem_93325", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "6 shallots (preferably Thai) peeled, finely sliced", "3 garlic cloves, peeled, crushed to a paste with a little salt", "40g/1½oz ginger, peeled, finely grated", "4 lemongrass stalks, tender part only, finely chopped", "6 lime leaves, shredded", "2-3 green chillies, seeded and finely chopped, to taste", "600ml/1pt coconut milk", "4 tbsp chopped fresh coriander", "600g/1lb 5oz monkfish tails, cut into large chunks", "200g/7oz tinned water chestnuts, drained", "2 tbsp Thai fish sauce", "1 lime, juice only", "4 tbsp Thai basil leaves (available from Asian grocers), torn, to serve", "250g/9oz Thai jasmine rice", "500ml/17½fl oz water", "1 lemongrass stalk, bruised"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the monkfish curry, heat the oil in a large wok until smoking and stir-fry the shallots, garlic, ginger, lemongrass, lime leaves and green chillies for 2-3 minutes. Stir in the coconut milk and continue to cook for 3-4 minutes, or until the volume of the liquid has reduced slightly.", "Add the coriander, monkfish and water chestnuts and continue to cook for 3-4 minutes, or until the fish is cooked through. Stir in the fish sauce and lime juice.", "Meanwhile, for the Thai jasmine rice, place the rice and lemongrass stalk into a saucepan, cover with the water and simmer gently for 12-15 minutes, or until the rice has absorbed all of the water and is tender. Remove the pan from the heat and set aside for 5 minutes. ", "To serve, spoon some of the Thai jasmine rice onto each of 4 serving plates. Spoon some monkfish curry on top and sprinkle over the Thai basil leaves."]}, {"isVegetarian": false, "title": "Monkfish, leek and tomato stew", "url": "www_bbc_co_uk_food_recipes_monkfishleekandtomat_88557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, roughly chopped", "1 garlic clove, finely chopped", "100g/3½oz baby leeks, sliced ", "85g/3oz new potatoes, chopped", "200ml/7fl oz fish stock", "½ lemon, zest only", "6 ripe cherry tomatoes, halved", "125g/4½oz monkfish tail, de-boned, trimmed and chopped into bite-sized pieces", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and gently fry the onion and garlic for 2-3 minutes.", "Add the leeks and potatoes and continue cooking for a further 3-4 minutes.", "Pour in the stock and bring to a simmer. Simmer for around eight minutes, or until the potatoes are still firm but nearly cooked through.", "Add the lemon zest, cherry tomatoes and chunks of fish and cook for 3-4 minutes, or until the fish and potatoes are cooked through.", "Stir in the chopped parsley and serve."]}, {"isVegetarian": false, "title": "Monkfish tail baked in a foil package with chilli, coconut milk, garlic and ginger", "url": "www_bbc_co_uk_food_recipes_monkfishtailbakedina_86538", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 2oz monkfish (cut into 4 pieces)", "4 garlic cloves, crushed", "2 chillies, sliced into 12 pieces", "4 sprigs fresh lemon thyme ", "20g/¾oz grated ginger", "1 stalk lemongrass, cut into 4 pieces", "12 tbsp coconut milk", "1 lime, quartered ", "salt, to taste"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat a barbecue until the coals are white hot. (Alternatively, cook in an oven preheated to 180C/350F/Gas 4.)", "Fold a large piece of aluminium foil in half. Place a smaller piece of baking paper on top of the foil. Place a piece of monkfish onto the paper with a garlic clove, three slices of chilli, a sprig of lemon thyme, a quarter of the grated ginger, a piece of lemongrass, three tablespoons of coconut milk and a pinch of salt. Repeat this for each piece of fish.", "Seal the parcels into a pasty-like shape, making sure the edges are sealed so that the juices can't escape during cooking. Place onto the barbecue (or in the oven) for 20 minutes.", "Remove from the barbecue and leave to stand for five minutes. To serve, place each foil package onto a plate. Open up the foil and season with a squeeze of lime juice."]}, {"isVegetarian": false, "title": "Monkfish tikka kebabs with yellow bean salad", "url": "www_bbc_co_uk_food_recipes_monkfishtikkakebabsw_84773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz Greek yoghurt", "50ml/2fl oz tomato ketchup", "1 tsp turmeric", "1 lime, juice only", "4 x 50g/1½oz chunks monkfish", "50g/1½oz yellow beans, trimmed, blanched", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the kebabs, place all of the ingredients into a bowl, mix well and leave the monkfish to marinate for 3-5 minutes.", "Heat an ovenproof griddle pan until smoking and chargrill the monkfish chunks for 2-3 minutes on each side. Transfer the pan to the oven and roast the monkfish for 3-5 minutes, or until completely cooked through.", "For the salad, place the beans and oil into a bowl, mix well and season with salt and freshly ground black pepper.", "To serve, place the beans onto a serving plate with the monkfish pieces on top."]}, {"isVegetarian": false, "title": "Monkfish with artichoke hearts", "url": "www_bbc_co_uk_food_recipes_monkfishwithartichok_84139", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz monkfish tails, trimmed", "200g/7oz flour, seasoned with sea salt, celery salt, white pepper and paprika", "150g/5¼oz butter", "1 lemon, juice only", "300g/10½oz new potatoes, cooked until tender, drained", "125g/4½oz cherry tomatoes ", "salt and freshly ground black pepper", "1 x 200g/7oz can artichoke hearts, halved", "1 lemon, juice only", "2 tbsp chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Cut the monkfish into chunks and then dredge in the seasoned flour.", "Melt the butter in a large ovenproof frying pan and, when foaming, add the fish. Fry for a couple of minutes on each side, until browned. ", "Squeeze the lemon juice over the fish, and move the fish to one side of the pan. ", "Add the potatoes to the pan and cook for two minutes. ", "Add the cherry tomatoes and cook for a further two minutes.", "Finally add the artichoke hearts to the pan and season, to taste, with salt and freshly ground black pepper.", "Distribute the potatoes and fish evenly in the pan, then transfer to the oven and cook for 3-4 minutes, or until the monkfish is cooked through.", "To serve, place the fish and potatoes onto a warm plate. Squeeze the remaining lemon over and garnish with fresh parsley."]}, {"isVegetarian": false, "title": "Monkfish with curried lentils", "url": "www_bbc_co_uk_food_recipes_monkfishwithcurriedl_93869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2cm/1in piece fresh root ginger, peeled, grated", "50ml/2fl oz olive oil", "1 carrot, peeled, finely diced", "1 celery stalk, finely diced", "1 leek, trimmed, finely diced", "1 garlic clove, peeled, finely chopped", "1 tsp mild curry paste", "200g/7¼oz Puy lentils, cooked according to packet instructions", "300ml/10½fl oz chicken stock", "3 tomatoes, peeled, seeds removed, diced", "2 tbsp chopped fresh coriander ", "2 tbsp crème fraîche", "200g/7¼oz monkfish, trimmed, thinly sliced", "salt and freshly ground black pepper", "1 lemon, juice only", "1 tbsp chopped fresh coriander, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the curried lentils, place the grated ginger in a clean towel or a piece of muslin, over a small bowl, and twist the cloth to extract the juice. Set aside.", "Heat the olive oil in a frying pan and fry the carrot, celery and leek 4-5 minutes, or until the softened. ", "Add the garlic and cook for a further minute. Stir in the curry paste, reserved ginger juice, lentils and chicken stock. Bring the mixture to the boil, reduce the heat and stir in the tomatoes, coriander and crème fraîche.", "For the monkfish, season the monkfish slices, to taste, with salt and freshly ground black pepper and pour over the lemon juice. ", "Carefully stir the monkfish slices into the curried lentils and heat gently for 2-3 minutes, or until the fish is cooked through.", "To serve, spoon the monkfish and curried lentils into each of 4 serving bowls. Sprinkle over the chopped coriander."]}, {"isVegetarian": false, "title": "Monkfish with pesto and warm mozzarella and tomato salad", "url": "www_bbc_co_uk_food_recipes_monkfishwithpestoand_91583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 balls buffalo mozzarella, thinly sliced", "4 large Oxheart tomatoes, thinly sliced", "4 sprigs fresh basil, leaves only, to serve", "freshly ground black pepper", "60g/2½oz fresh basil leaves", "50g/2oz pine nuts, toasted", "50g/2oz parmesan, grated", "2 cloves garlic, peeled", "125-175ml/4½-5fl oz extra virgin olive oil", "700g/1lb 9oz monkfish fillet, trimmed and cut into small chunks", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. ", "For the salad, lay the slices of mozzarella and tomato onto four serving plates, alternating the mozzarella and tomato slices in a circle around the edges. Place into the oven to warm through for five minutes.", "For the pesto, place the basil, pine nuts, parmesan and garlic into a food processor and blend to a fine purée. Add 125ml/4½fl oz of the olive oil and blend again until well combined. If the pesto is too thick, add the remaining olive oil to thin it out. (You may not need all of the olive oil.) Set aside.", "For the monkfish, heat the olive oil in a frying pan and fry the fish on all sides for 4-5 minutes, or until golden-brown and cooked through. Remove the pan from the heat and allow the fish to rest for a few minutes. ", "Drizzle 3-4 tablespoons of the pesto over the fish and mix well to coat. ", "To serve, carefully remove the plates of mozzarella and tomato from the oven using oven gloves. Spoon the monkfish onto the centre of the plates, then drizzle the remaining pesto around the mozzarella and tomato. Garnish with a few fresh basil leaves and season with some freshly ground black pepper."]}, {"isVegetarian": false, "title": "Monkfish with mustard and cucumber sauce", "url": "www_bbc_co_uk_food_recipes_monkfishwithmustarda_83980", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small cucumber", "1 tsp salt", "1 tbsp caster sugar", "1 tbsp white wine vinegar", "1 tsp freshly ground black pepper", "125ml/4fl oz fish stock or white wine", "1 tbsp crème fraîche", "1 tbsp wholegrain mustard", "50g/2oz unsalted butter", "1 tsp lemon juice", "4 x 200g/7oz monkfish tails", "25ml/1fl oz olive oil", "knob of butter", "1 tbsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cucumber, peel and thinly slice the cucumber and place in a colander. ", "Mix it with the salt and press for an hour. Place a small plate or lid on the cucumber and put a heavy jar or can on top of that and set colander over a bowl to drain.", "After a half-hour or so, squeeze as much liquid as possible from the cucumber and place in a bowl.", "In a separate bowl mix together the sugar, vinegar and black pepper. Toss the cucumber slices in the vinegar mixture, coating well. ", "For the sauce, heat the stock, crème fraîche and mustard together then whisk in the butter piece by piece. Finally add the lemon juice.", "For the monkfish, drizzle the monkfish fillets with olive oil. Heat a frying pan until hot, then add the fillets. ", "Add a knob of butter and continue to fry until the fish is cooked.", "Squeeze over the lemon juice on the cooked fish.", "Place the fish onto warmed serving plates along with the cucumber and sauce."]}, {"isVegetarian": false, "title": "Monkfish with prosciutto, artichokes, capers, parsley and Charlotte potatoes", "url": "www_bbc_co_uk_food_recipes_monkfishwithprosciut_91428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Roman (large globe) artichokes", "95ml/3½fl oz olive oil", "1 garlic clove, chopped", "3 tsp chopped fresh flatleaf parsley", "125ml/4½fl oz white wine", "2 x 175g/6oz monkfish fillets, trimmed", "300g/11oz Charlotte potatoes, boiled until tender, drained, sliced", "1 tbsp small capers, drained and rinsed", "90g/3½oz prosciutto slices", "½ lemon, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Trim the outer leaves from the artichokes, cut the tops off, then scoop out the hairy 'choke' with a teaspoon.", "Using a potato peeler, peel away the stem until the tender centre is exposed.", "Place the peeled artichokes, heads facing downwards, into a pan. Add 75ml/2¾fl oz of the olive oil, half of the chopped garlic, one teaspoon of the chopped parsley and all of the white wine. Cover the pan with a lid.", "Heat the mixture over a medium heat, then cook the artichokes for 20-25 minutes, or until a sharp knife can be easily inserted into their centres.", "When the artichokes are cooked, remove them from the pan using a slotted spoon and set aside to cool. When they have completely cooled, slice them lengthways into thin slices.", "Meanwhile, heat one teaspoon of the remaining oil in a large, heavy-based, ovenproof frying pan over a medium to high heat. When the oil is hot, add the monkfish fillets and cook for 2-3 minutes on each side, or until crisp and pale golden-brown on both sides. Remove from the pan and set aside. ", "Add the sliced, cooked potatoes to the pan the monkfish was cooked in. Fry on one side for 1-2 minutes over a medium heat, then turn over. ", "Return the monkfish fillets to the pan and lay them on top of the sliced potatoes. Add the sliced, cooked artichokes, capers, remaining chopped parsley and chopped garlic, arranging them in and around the monkfish fillets, on top of the potatoes. Cover the ingredients with the prosciutto slices. ", "Transfer the pan to the oven and roast for 6-10 minutes, or until the prosciutto slices are crisp and the monkfish fillets are cooked through (the monkfish fillets are cooked through when the flesh is opaque). ", "Remove the pan from the oven and squeeze the lemon juice into the pan and drizzle over the remaining 15ml/½fl oz of olive oil. ", "To serve, divide the sliced potatoes and artichokes equally between two serving plates. Place one monkfish fillet on top of each serving. Top with the crisp prosciutto slices."]}]