[{"ingredients": ["2 x 800 g / 1 libra de filetes de costilla de ternera de 12 oz (filetes de costilla con hueso)", "sal y pimienta negra recién molida", "90 g / 3½ oz de mantequilla", "3 cucharadas de aceite de oliva", "Queso Cheshire azul 75g / 3oz", "3 cucharadas de cebollines frescos finamente picados", "Patatas harinosas de 400g / 14oz, peladas, cortadas en cubos de 0.5cm / ½ in, blanqueadas", "Setas girolle 250 g / 9 oz, limpiadas bien", "2 cucharadas de perejil de flatleaf fresco picado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6. Sazonar los filetes con sal y pimienta negra recién molida.", "Caliente una sartén grande a prueba de horno a fuego alto hasta que esté muy caliente. Agregue un poco de la mantequilla y una cucharada de aceite. Cuando la mantequilla esté espumosa, agregue los filetes y fríalos durante 1-2 minutos en cada lado, o hasta que se doren por ambos lados.", "Transfiera los filetes al horno y tueste durante 8-10 minutos (para raros), 12-15 minutos (para medio), o hasta que se cocinen a su gusto.", "Retire los filetes del horno y déjelos reposar durante al menos 5 minutos.", "Mientras tanto, mezcle 75 g / 3 oz de la mantequilla y todo el queso azul en un procesador de alimentos hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mitad de las cebolletas y revuelva hasta que se combinen.", "Caliente una sartén a prueba de horno a fuego medio a alto hasta que esté caliente. Agregue la mantequilla restante y el aceite de oliva y fría las papas escaldadas durante 2-3 minutos, o hasta que estén doradas y crujientes. Agregue las setas girolle y fría por 2-3 minutos más.", "Sazonar la mezcla, al gusto, con sal y pimienta negra recién molida, luego remover el perejil y el resto del cebollín.", "Para servir, coloque una côte de boeuf en cada una de las dos placas de servir. Ponga un poco de mantequilla de queso en la parte superior, luego apile los champiñones y las papas."], "url": "www_bbc_co_uk_food_recipes_blue_cheese_cote_de_92417", "title": "Côte de boeuf con mantequilla de queso azul y champiñones girolle salteados y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de harina de tortilla de maíz azul (o harina de maíz si no está disponible)", "2 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada", "1 chile verde jalapeño, finamente picado o un buen pizca de chile seco en hojuelas", "1 diente de ajo, finamente picado", "Flores de calabacín de 250 g / 9 oz, acelgas o espinacas, lavadas y desmenuzadas", "Mozzarella 200 g / 7 oz, rallado", "150g / 5½oz de queso Lancashire, desmenuzado", "sal"], "method": ["Coloque la harina en un tazón grande con ½ cucharadita de sal y agregue 275ml / 9¾fl oz de agua tibia. Agregue más si la masa está demasiado seca (necesitará aproximadamente 350 ml / 12 fl oz de agua si usa harina normal de maíz). Amasar en una masa suave, suave pero no pegajosa. Cubra y descanse durante 20-30 minutos.", "Divida la mezcla en 12 bolas del tamaño de una pelota de golf. Coloque uno entre dos hojas de película adhesiva y ruede con un rodillo para hacer una tortilla de aproximadamente 15 cm de diámetro. Repita y apile las tortillas, separadas con papel de hornear para evitar que se peguen.", "Calentar una sartén seca a fuego medio. Cocine las tortillas, una o dos a la vez, hasta que cambien de color y comience a hincharse ligeramente; esto tomará aproximadamente 2 minutos. Déles la vuelta y repita en el otro lado. Dejar de lado.", "Calentar el aceite en una cacerola a fuego medio. Cocine la cebolla, el chile y el ajo hasta que estén suaves pero no coloreados. Agregue las flores de calabacín, acelgas o espinacas a la sartén y cocine hasta que se marchiten. Sazonar con sal.", "Coloque una tortilla en una sartén seca y espolvoree un poco de queso mozzarella y Lancashire. Agregue algunas flores de calabacín (o verduras) y doble la tortilla a la mitad para hacer un semicírculo. Una vez que el queso comience a derretirse, voltee la quesadilla y continúe cocinando hasta que el queso rezume. Retire la quesadilla de la sartén y manténgala caliente mientras hace el resto. Cortar en rodajas y servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_blue_corn_quesadillas_93464", "title": "Quesadillas de maíz azul y queso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "1 huevo de gallinas camperas", "100ml / 3½ fl oz de leche", "1 cucharadita de miel líquida", "½ cucharadita de extracto de vainilla", "½ cucharadita de ralladura de naranja (o ½ cucharadita de extracto de naranja)", "45g / 1¾oz de harina de auto crianza", "30 arándanos", "yogur natural, para servir"], "method": ["Precaliente el horno a 220 ° C / 450 ° F / Gas 7. Engrase un molde para muffins de seis hoyos con aceite vegetal usando un cepillo para pasteles.", "Batir el huevo junto con la leche en una jarra hasta que estén bien combinados. Agregue la miel, el extracto de vainilla y la ralladura de naranja y bata nuevamente.", "Pon la harina en un tazón y haz un pozo en el centro. Vierta la mitad de la mezcla de huevo, gradualmente llevando los bordes de la harina a la mezcla húmeda con un tenedor hasta que la mezcla esté suave y completamente combinada.", "Verter sobre la mezcla de huevo restante y mezclar de nuevo con el tenedor para formar una mezcla suave y fluida.", "Divida los arándanos por igual entre los seis agujeros en la bandeja del muffin. Coloque la cuchara en la masa (aproximadamente tres cucharadas de masa por hoyo).", "Hornee las magdalenas en el horno durante 10-15 minutos, o hasta que se hayan levantado y estén doradas, y una brocheta insertada en el centro de cada una salga limpia.", "Déjelo a un lado para que se enfríe un poco, luego retire los panecillos de la bandeja y déjelos a un lado para que se enfríen en una rejilla. Estos son deliciosos como se comen, o se sirven con yogur natural."], "url": "www_bbc_co_uk_food_recipes_blue_jewel_bake_50561", "title": "Blue joya hornear", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½ fl oz crema doble", "4-6 cucharadas de mantequilla de almendras", "4 cucharadas de conserva de arándanos", "4 panqueques, para servir"], "method": ["Batir la crema hasta que se formen picos suaves cuando se quite la batidora.", "Gotee la mantequilla de almendras y la conserva de arándanos sobre los panqueques. Cubra con cucharadas de crema batida y ¡disfrútelo!"], "url": "www_bbc_co_uk_food_recipes_blueberry_almond_butter_10881", "title": "Crema de arándanos, mantequilla de almendras y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_almond_butter_10881_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz mezcla de arándanos y grosellas negras", "½ limón", "50g / 1¾oz de mantequilla", "100 g / 3½ oz de azúcar en polvo", "2 huevos pequeños de gallinas camperas", "3 hojas de albahaca morada"], "method": ["Caliente los arándanos, las grosellas negras y una cucharada de agua en una sartén durante cinco minutos para liberar los jugos. Ponga a un lado mientras que la ralladura y el jugo del limón.", "Agregue la ralladura de limón y el jugo, la mantequilla y el azúcar a un recipiente resistente al calor colocado sobre una sartén llena de agua hirviendo a fuego lento hasta que el azúcar se haya disuelto, luego déjelo a un lado por un minuto más o menos.", "Batir bien los huevos en un recipiente aparte, verter a través de un colador en el recipiente colocado sobre el agua. Agregue la fruta y las hojas de albahaca. Siga revolviendo a fuego lento durante unos 25-30 minutos.", "Tamizar de nuevo en una jarra y luego verter en jarras esterilizadas para servir."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_basil_curd_56487", "title": "Cuajada de arándano, grosella negra y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace alrededor de 2 jarras", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "70 g / 2½ oz de azúcar en polvo", "1 cucharadita de extracto de vainilla", "2½ hojas de gelatina, remojadas en un recipiente de agua fría (o use una alternativa vegetariana)", "300ml / 10fl oz de suero de leche", "90 g / 3¼ oz de arándanos", "100 g / 3½ oz de azúcar en polvo", "1 estrella de anís", "100 g / 3½ oz de arándanos"], "method": ["Caliente la crema, el azúcar y la vainilla en una sartén hasta que el azúcar se haya disuelto y la crema empiece a hervir.", "Retire la sartén del fuego. Exprime la gelatina para eliminar el exceso de agua. Agrégalo a la sartén y revuelve hasta que se disuelva. Agregue el suero de leche y mezcle bien.", "Divida los arándanos entre cinco moldes. Vierta sobre la mezcla de crema para llenar los moldes.", "Colóquelo en el refrigerador para prepararlo; esto tomará al menos cuatro horas o lo dejará toda la noche.", "Para la salsa de arándanos, coloque el azúcar, 50 ml / 2 fl oz de agua y anís estrellado en una sartén. Llevar a ebullición para que el azúcar se disuelva y el jarabe espese un poco pero no cambie de color.", "Retire del fuego y agregue los arándanos. Deje que se enfríe y el almíbar se volverá de color rojo oscuro y los arándanos se ablandarán.", "Para servir, pasar un cuchillo alrededor de la panna cotta para aflojarlo. Incline hacia platos para servir y vierta un poco de la salsa de arándanos."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_buttermilk_71250", "title": "Panna cotta de arándanos y suero de leche", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Rinde 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_buttermilk_71250_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de arándanos", "2 cucharadas de yogur al estilo griego", "1 cucharadita de miel", "100 g / 3½ oz de arándanos", "1 limón, solo jugo", "1 cucharada de agua", "1 cucharada de azúcar glas", "3 cucharadas de azúcar en polvo", "55g / 2oz de almendras"], "method": ["Para los arándanos con yogur, coloque los arándanos en la base de un vaso alto, cuchara en el yogur y rocíe sobre la miel.", "Para el coulis de arándanos, coloque todos los ingredientes en el recipiente de un procesador de alimentos y procese hasta que quede suave.", "Revuelva algunos de los coulis en el yogur y la miel.", "Para las almendras caramelizadas, coloque el azúcar en una sartén pequeña y caliente suavemente. Cuando empiece a derretirse, incline las almendras y cocine durante 4-5 minutos, hasta que comiencen a dorarse y el azúcar se caramelice. Vierta sobre una hoja de papel de silicona o papel resistente a la grasa para que se enfríe.", "Cuando esté lo suficientemente frío como para manipularlo, rómpalo y adorne la parte superior del yogur, la miel y el coulis con trozos de almendras caramelizadas."], "url": "www_bbc_co_uk_food_recipes_blueberrieswithyoghu_88682", "title": "Arándanos con yogur, miel y almendras caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800g / 1lb12oz vientre magro de cerdo", "800ml / 1 pinta 8fl oz de caldo de pollo rico", "½ cucharadita de semillas de comino", "½ cucharadita de semillas de hinojo", "½ cucharadita de cardamomo triturado", "350 g / 12 oz de arándanos congelados, descongelados", "125ml / 4fl oz de agua", "2 cucharadas de azúcar en polvo o miel", "2 cucharadas de jugo de limón", "½ cucharadita de hojuelas de chile", "sal y pimienta negra recién molida", "55 g / 2 oz de queso feta, desmenuzado", "3 cucharadas de yogur natural", "½ cucharadita de comino molido", "2 lechugas Baby Gem, solo hojas", "¼ cucharadita de semillas de comino", "¼ cucharadita de semillas de sésamo negro"], "method": ["Para el vientre de cerdo, precaliente el horno a 150C / 300F / Gas 2.", "Coloque la barriga de cerdo en una lata honda para asar y vierta sobre el caldo de pollo, debe llegar a la mitad del vientre de cerdo.", "Dispersar sobre las especias, cubrir la lata con papel de aluminio y cocinar en el horno durante 2-4 horas, o hasta que estén tiernas.", "Retire del horno, drene el líquido y deje que la carne se enfríe por completo.", "Para la melaza de arándanos, coloque los arándanos y el agua en un procesador de alimentos o licuadora y mezcle hasta obtener un puré.", "Coloque el puré en una cacerola y agregue los copos de azúcar, limón y chile. Llevar a ebullición y cocine a fuego lento durante 40-60 minutos, o hasta que la mezcla se vuelva espesa y almibarada. Sazone con sal y pimienta negra recién molida agregando más chile si le gusta un poco más de especias.", "Precaliente el horno a 240C / 475F / Gas 9. Retire la capa gruesa de piel y grasa del vientre de cerdo y deséchela. Coloque la carne de cerdo en una lata de asar limpia y glasear la parte superior y lateral de la carne con la melaza de arándanos.", "Coloque la carne de cerdo en el horno durante 5-6 minutos, o hasta que la parte superior esté caramelizada y ligeramente crujiente.", "Para la ensalada, batir el queso feta, el yogur y el comino molido en un bol. Sazonar con sal y pimienta negra recién molida y luego colocar en un tazón limpio con las hojas de ensalada. Mezcle bien, luego espolvoree con el comino y las semillas de sésamo.", "Cortar el cerdo en cuadrados y servir con la ensalada."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_chilli_11759", "title": "Vinagre de cerdo con glaseado de melaza de arándanos y chile con ensalada de queso feta, yogur y comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 lb 2 oz manzanas de cocina (alrededor de 3)", "250 g / 9 oz de arándanos", "300ml / 10fl oz de jugo de manzana transparente", "1 naranja mediana, solo ralladura", "350 g / 12 oz de azúcar"], "method": ["Lave las manzanas, luego córtelas en trozos pequeños, no hay necesidad de pelarlas ni desgranarlas, y colóquelas en un recipiente para conservas.", "Lave los arándanos y coloque en la bandeja de conserva con las manzanas y el jugo de manzana.", "Agregue la ralladura de naranja.", "Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 20 minutos o hasta que las manzanas se hayan colapsado, revolviendo ocasionalmente.", "Cuele la mezcla a través de un colador fino, luego regrese la mezcla de arándanos y manzana a la sartén.", "Agregue el azúcar y regrese al fuego. Revuelva constantemente hasta que el azúcar se disuelva.", "Continúe cocinando hasta obtener una consistencia espesa y cremosa; esto puede demorar hasta una hora. Revuelva de vez en cuando.", "Vierta en frascos esterilizados. Cubra con una tapa y etiqueta."], "url": "www_bbc_co_uk_food_recipes_blueberry_butter_07052", "title": "Mantequilla de arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 3 jarras de 250 ml / 9 fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_butter_07052_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["115g / 4oz de azúcar glasé, más extra para quitar el polvo", "250g / 9oz de hojaldre comprado en la tienda", "200g / 7 oz (o 1 cestito) arándanos", "165ml / 5½fl oz de crema batida", "25g / 1oz de azúcar glas", "1 vaina de vainilla, solo semillas (o alternativamente 2 gotas de extracto de vainilla)", "1 limón, ralladura finamente rallada y un chorrito del jugo"], "method": ["Alinee una bandeja grande para hornear con papel resistente a la grasa. Espolvoree la superficie de trabajo con abundante azúcar glas y extienda la masa a un rectángulo de apenas 27 x 30 cm / 10 1/2 x 12 pulgadas, recortando los bordes en línea recta. Debe ser muy delgado, tan delgado como puedas conseguirlo, sin estirar la masa.", "Recorta 18 rectángulos de aproximadamente 9 cm / 3½ pulgadas de largo y 5 cm / 2 pulgadas de ancho y colócalos en la bandeja de horno preparada. Espolvoree con abundante azúcar glas y póngalo en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire la masa de la nevera y hornee en el horno durante cinco minutos, luego retírela del horno y espolvoree la masa con más azúcar glasé. Vuelve al horno y hornea por otros cinco minutos, o hasta que la masa se ponga dorada. Retire del horno y reserve.", "Para la crema endulzada, ponga la crema, el azúcar glas y la vainilla en un tazón grande y látigo hasta que se formen picos medio rigidos cuando se quita el batidor del tazón. Agregue la ralladura de limón y el jugo, al gusto, luego coloque la mezcla en una manga pastelera con una boquilla recta de 1 cm / ½ pulgada.", "Coloque uno de los bollos de masa en un plato para servir. Aplique gotas de crema sobre la masa y coloque los arándanos entre la crema, luego coloque otra masa fina encima y repita con una capa más. Espolvorea la capa superior con más azúcar glasé y repite hasta que todo el pastel y la crema estén gastados."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_lemon_03932", "title": "Millefeuille de arándanos y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_lemon_03932_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "1½ cucharadita de sal", "1 cucharada de miel líquida", "1 cucharada de aceite de oliva (no virgen extra), más extra para engrasar", "1 x 7 g de bolsita instantánea de levadura", "240ml / 9fl oz de agua tibia", "1 huevo mediano de granja, golpeado", "75g / 2¾oz de arándanos secos", "aceite, para engrasar", "1 huevo de gallinas camperas, ligeramente batido, para glasear", "100g / 3½oz de chocolate blanco, finamente rallado"], "method": ["Para la masa de bagel, coloque todos los ingredientes en un tazón grande para mezclar y mezcle con una masa dura. Dé vuelta a la encimera y amasar durante 10 minutos, o hasta que esté suave y elástica (alternativamente, utilice un mezclador eléctrico con un gancho de masa durante cinco minutos).", "Divida la masa en 12 porciones iguales, enrolle cada pieza en una bola limpia y colóquela sobre una tabla de cortar enharinada. Cubra con película adhesiva engrasada y reserve para probar durante 25 minutos.", "Cuando la masa duplique su tamaño, haga un agujero en el centro de cada bola con un mango de madera para la cuchara, estirando el agujero con los dedos para que no se vuelva a sellar. Cubra y reserve por 35 minutos para probar una segunda vez.", "Precaliente el horno a 230 ° C / 450 ° F / Gas 8. Ponga a hervir una olla grande de agua y agregue los bagels en tandas (teniendo cuidado de no saturar la sartén) y cocine por 1 ¼ minutos por cada lado. Saque los panecillos con una cuchara ranurada y colóquelos en una rejilla para que se sequen ligeramente, luego glasee con huevo.", "Alinee dos bandejas grandes para hornear con papel pergamino y engrase con aceite. Coloque los bagels escalfados en las bandejas alineadas con suficiente espacio entre ellos y hornee en el horno precalentado. Después de 10 minutos, intercambie las bandejas en el horno (de modo que los bagels que estaban en la parte superior estén ahora en la parte inferior y viceversa) y hornee por otros cinco minutos. Retire los bagels del horno y transfiéralos a un estante de enfriamiento.", "Para el relleno, coloque un recipiente resistente al calor sobre una fuente de agua hirviendo y agregue la mitad del chocolate. Caliente hasta que el chocolate llegue a 43 ° C / 110 ° F (use un termómetro eléctrico para esto), revolviendo continuamente con una espátula. Retire del fuego y espolvoree un tercio del chocolate reservado. Regrese el tazón a la fuente y permita que el chocolate se derrita por 30 segundos. Retire del fuego y agregue otro tercio del chocolate restante. Repita hasta que se use todo el chocolate.", "Coloque el chocolate derretido en una manga pastelera con una boquilla muy fina (alternativamente, recorte una pequeña esquina de una bolsa plástica para alimentos) y, con un movimiento fluido, coloque el chocolate sobre los bagels en zigzag."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_white_51475", "title": "Bagels de arándanos y chocolate blanco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 12 panecillos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de mantequilla, suavizada", "225 g / 8 oz de azúcar en polvo", "2 huevos de gallinas camperas", "Crema agria de 250 g / 9 oz", "1 limón, cáscara y jugo sin cera", "300g / 10½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "150 g / 5½ oz de arándanos", "50g / 2oz de mantequilla, ablandada", "300g / 10½oz de azúcar glas, tamizado, más extra para quitar el polvo", "200g / 7oz de queso crema", "1-2 cucharadas de jugo de limón", "50g / 2oz de arándanos"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee una lata rectangular para hornear (aproximadamente 26 cm x 20 cm / 10½ pulgadas x 8 pulgadas).", "Batir la mantequilla y el azúcar juntos en un bol hasta que estén suaves y esponjosos, luego batir en los huevos, uno a la vez, hasta que estén bien combinados. Agregue la crema agria, el jugo de limón y la ralladura, la harina y el polvo de hornear hasta que estén bien combinados, luego doble cuidadosamente los arándanos.", "Coloque la mezcla en la lata de la torta y hornee durante 40-45 minutos, o hasta que un pincho insertado en la torta salga limpio. Retire la torta del horno y déjela a un lado hasta que esté completamente fría.", "Mientras tanto, para el relleno de queso crema, bata la mantequilla y el azúcar glas juntos en un bol hasta que estén suaves y esponjosos. Batir el queso crema y el jugo de limón, luego extender sobre la parte superior de la torta. Espolvorea sobre los arándanos y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_blueberry_and_lemon_09039", "title": "Bandeja de arándanos y limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_and_lemon_09039_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10½fl oz de leche entera", "Crema doble de 200 ml / 7 fl oz", "75 g / 2½ oz de azúcar en polvo", "6 yemas de huevo de gallinas camperas", "3 barras de chocolate y maní, picadas", "Harina normal de 200g / 7oz, más extra para quitar el polvo", "150g / 5½oz de mantequilla sin sal, picada", "75 g / 2½ oz de azúcar en polvo", "2 yemas de huevo de gallinas camperas", "400 g / 14 oz de arándanos frescos", "1 vaina de vainilla, dividida por la mitad a lo largo, semillas raspadas", "2 cucharadas de harina de maíz", "1 limón, solo jugo", "2 cucharadas de azúcar demerara"], "method": ["Para el helado de chocolate instantáneo, caliente la leche y la crema en una cacerola hasta que esté hirviendo a fuego lento. Batir el azúcar impalpable y las yemas de huevo en un bol hasta que estén pálidas y esponjosas.", "Vierta lentamente la mezcla de crema caliente sobre la mezcla de huevo, batiendo continuamente.", "Regrese la mezcla a la cacerola y continúe cocinando a fuego lento, batiendo continuamente, hasta que se espese lo suficiente como para cubrir la parte posterior de una cuchara. Agregue las barras de chocolate picadas y revuelva hasta que se derrita. Dejar de lado para enfriar, luego enfriar en la nevera.", "Transfiera la crema congelada a una máquina de helados y revuelva hasta que se congele, luego congele hasta que se necesite en un recipiente hermético.", "Para las galettes, en un tazón, frote la harina, la mantequilla y 25 g / 1 oz del azúcar en polvo con las puntas de los dedos, hasta que la mezcla se asemeje a pan rallado.", "Agregue una de las yemas de huevo y mezcle la mezcla hasta que quede como una masa. Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar hasta que quede suave. Aplaste la masa en un disco de 2 cm / 1 pulgada de espesor, luego envuélvala en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Mientras tanto, en un tazón, mezcle los arándanos, las semillas de vainilla, la harina de maíz, el jugo de limón y el azúcar impalpable restante. Dejar de lado.", "Enrolle la masa fría en una superficie ligeramente enharinada hasta un grosor de 5 mm / ¼ in. Corta ocho discos de 12cm / 5 pulgadas de la masa y colócalos en una bandeja para hornear forrada con papel de hornear. Pellizca o dobla los bordes de cada disco de repostería para crear cajas de repostería, luego cepilla todo con la yema de huevo restante. Ponga una cuchara en los arándanos y espolvoree el azúcar demerara. Enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee las galettes en el horno durante 20-25 minutos, o hasta que estén crujientes y doradas.", "Para servir, coloque las galettes calientes en platos para servir y coloque una bola de helado encima de cada una."], "url": "www_bbc_co_uk_food_recipes_blueberry_galette_with_46523", "title": "Galette de arándanos con helado de chocolate y maní", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blueberry_galette_with_46523_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de arándanos", "Azúcar mermelada de 400g / 14oz", "250 g / 9 oz de azúcar glas", "Almendras molidas 210 g / 7½ oz", "40 g / 1½ oz de arándanos secos", "175g / 6oz de claras de huevo a campo abierto (equivalentes a alrededor de 5 claras de huevo)", "225 g / 8 oz de azúcar en polvo", "4 cucharadas de agua", "colorante de comida azul marino", "250 g / 9 oz de azúcar glas", "Almendras molidas 210 g / 7½ oz", "40g / 1½oz de coco desecado", "175g / 6oz de claras de huevo a campo abierto (equivalentes a alrededor de 5 claras de huevo)", "4 cucharadas de agua", "225 g / 8 oz de azúcar en polvo", "250 g / 9 oz de azúcar glas", "Almendras molidas 250 g / 9 oz", "175g / 6oz de claras de huevo a campo abierto (equivalentes a alrededor de 5 claras de huevo)", "4 cucharadas de agua", "225 g / 8 oz de azúcar en polvo", "pasta roja para colorear alimentos", "esencia de fresa", "284ml / 10fl oz de crema doble", "2 cucharadas de azúcar glas, cernida", "1 x 50g / 1¾oz bolsita de crema de coco", "6 fresas maduras grandes", "125g / 4½oz de mantequilla sin sal", "250g / 1lb 2oz de azúcar glas"], "method": ["Para hacer el relleno de gelatina de arándano, coloque los arándanos y el azúcar en una sartén pequeña, caliente sobre fuego suave hasta que el azúcar se haya disuelto y luego hierva a fuego alto durante 7 a 10 minutos. Vierta la gelatina a través de un colador fino en un plato grande y poco profundo y deje a un lado para que se enfríe por completo.", "Precalentar el horno a 170C / 325F / Gas 3. Línea 4 bandejas grandes para hornear con papel antigrasa.", "Para los macarrones de arándano, coloque el azúcar glas, almendras molidas y arándanos en un procesador de alimentos y pulse hasta que tenga un polvo fino. Tamiza la mezcla en un recipiente, desechando todo lo que quede en el tamiz, luego devuelve la mezcla al procesador de alimentos. Pese 85 g / 3 oz de las claras de huevo, agréguelas al procesador de alimentos y mezcle para hacer una pasta.", "Coloque el azúcar y el agua en una cacerola de base pesada y caliente hasta que el azúcar se haya disuelto y la mezcla esté almibarada.", "Batir las claras de huevo restantes en un mezclador de alimentos o con un batidor eléctrico hasta que formen picos suaves, luego agregue el colorante y mezcle gradualmente en el jarabe. Continúe batiendo hasta que la mezcla esté brillante y tieso y luego transfiéralo a un tazón limpio.", "Dobla la mezcla de almendras en las claras de huevo batidas con una cuchara de metal grande y luego coloca la mezcla en una bolsa para tubos con una boquilla de 1 cm / ½ pulgadas y círculos de tubos de aproximadamente 4 cm / 1½ pulgadas de diámetro en las bandejas de horneado. Dele a las bandejas para hornear un par de puntadas en la superficie de trabajo para aplanar los macarrones y luego hornee con la puerta del horno ligeramente entreabierta por 12-15 minutos o hasta que esté firme. Deje que se enfríe en las rejillas de alambre antes de llenar.", "Haga los macarrones de coco y fresa repitiendo los pasos 3 - 6, sustituyendo los arándanos secos por el coco desecado y agregando un poco de esencia de fresa y colorante rojo para los macarrones de fresa.", "Para el relleno de coco, azote la crema doble con el azúcar glas hasta que se formen picos duros, luego doble la crema de coco y la cuchara en una manga pastelera. Sandwich los macarons de coco junto con un poco de llenado por tubería.", "Para el relleno de fresa, corte las fresas y presione a través de un colador fino para hacer un puré. Bata la mantequilla hasta que esté suave y esponjosa, luego bata el azúcar glas y el puré de fresas con la cuchara en una manga pastelera. Sandwich los macarrones junto con un poco de llenado por tubería.", "Para armar los macarons de arándano, corte los círculos de la gelatina con un pequeño cortador de galletas ligeramente más pequeño que los macarrones. Sandwich los macarrones junto con los círculos de gelatina."], "url": "www_bbc_co_uk_food_recipes_blueberry_macaroons_89479", "title": "Macarrones de arándano, macarrones de coco y macarrones de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 60 macarrones", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "300ml / 10fl oz de leche entera", "1 vaina de vainilla, semillas retiradas y mantener la vaina", "100 g / 3½ oz de azúcar en polvo", "4 yemas de huevo", "200 g / 7 oz de arándanos frescos", "250g / 9oz de mantequilla sin sal ablandada", "250 g / 9 oz de azúcar en polvo", "4 huevos", "Harina de auto aumento 250g / 9 oz", "½ cucharadita de extracto de vainilla", "250 g / 9 oz de arándanos", "botón de mantequilla", "azúcar en polvo, para quitar el polvo", "250 g / 9 oz de arándanos", "100 g / 3½ oz de azúcar en polvo"], "method": ["Para el helado, coloque la crema, la leche y las semillas de vainilla y la vaina en una olla grande y deje hervir a fuego lento.", "Batir el azúcar y las yemas de huevo en un recipiente grande. Poco a poco agregue la crema tibia a los huevos y batir.", "Vierta la mezcla nuevamente en la cacerola y cocine a fuego medio hasta que espese y cubra la parte posterior de la cuchara.", "Vierta la mezcla en una máquina de helados. Justo cuando comienza a establecer agregue los arándanos y mezcle.", "Vierta en un recipiente a prueba de congelación, cubra la superficie con film transparente y congele hasta que esté duro.", "Mientras tanto, para el dolor de arándanos perdu, precaliente el horno a 180C / 160C Ventilador / Gas 4. Engrase una bandeja para hornear de 20x30x3cm / 8x12x1 con mantequilla y alinee con una hoja de papel para hornear.", "En un tazón, bata la mantequilla y el azúcar hasta que esté pálida y esponjosa. Agriete los huevos, uno a la vez, golpeando después de cada adición, hasta que estén bien combinados. Doble la harina con la mano, luego agregue los arándanos.", "Viértalo en la lata preparada y hornee por 30-40 minutos, hasta que esté cocido (un pincho insertado en el centro debe salir limpio). Déjelo enfriar en la lata. Cuando se haya enfriado, córtelo en 6 cuadrados, recortando los bordes si lo desea.", "Para los arándanos salteados, caliente los arándanos y el azúcar en una cacerola a fuego medio, revolviendo continuamente. Cocine hasta que los arándanos se hayan descompuesto, el azúcar se haya disuelto en los jugos y la mezcla se haya espesado.", "Justo antes de servir, caliente un poco de mantequilla en una sartén a fuego medio. Agregue las rebanadas de dolor perdu en lotes, y freír durante 2 minutos en cada lado hasta que estén doradas y calientes.", "Para servir, divida el dolor perdu rebanadas por igual entre 4-6 platos de servir. Cubra cada uno con una bola de helado, luego una cuchara de algunos de los arándanos salteados al lado. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_blueberry_pain_perdu_53274", "title": "Perdu de arándano azul con arándanos salteados y helado de arándano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal, ablandada, más extra para engrasar", "150g / 5½oz de jarabe dorado", "Arándanos 200g / 7oz", "175g / 6oz de azúcar en polvo de oro", "3 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "1 cucharadita de polvo de hornear", "pizca de sal", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz", "1 vaina de vainilla, dividida por la mitad longitudinalmente, semillas raspadas con un cuchillo afilado", "Azúcar en polvo 110g / 3¾oz", "6 yemas de huevo"], "method": ["Para el postre, engrase un plato de pudín a prueba de calor de 1.2 litros / 2 pinta con mantequilla. Vierta el almíbar dorado en el fondo y esparza los arándanos.", "Batir los ingredientes restantes del pudín en un bol hasta que estén suaves y esponjosos. Cuidadosamente cuchara la mezcla de pudín en el plato de budín.", "Cubra el plato de budín con un gran cuadrado de pergamino para hornear, luego cúbralo con un gran cuadrado de papel de aluminio. Ate las dos hojas firmemente en su lugar debajo del borde del cuenco con la cuerda de cocción, dejando los extremos largos del cordón sobrante para hacer una manija. Enrolle uno de los largos sobrantes sobre el cuenco del pudin y deslícelo debajo del hilo tenso, sosteniendo las sábanas en su lugar en el otro lado. Levante la cuerda y anude firmemente con la otra cuerda sobrante, para formar una manija segura para levantar y sacar el pudín del agua.", "Coloque una toalla de té limpia en el fondo de una olla grande de base pesada, luego coloque un platillo boca abajo o un plato pequeño encima. Llena a la mitad la sartén con agua.", "Siente el plato de budín envuelto encima del platillo, asegurándose de que el mango de la cuerda sea de fácil acceso. Cubra la olla con la tapa y deje hervir el agua. Reduzca el fuego hasta que el agua esté hirviendo a fuego lento y cocine el pudin durante 1½-2 horas.", "Mientras tanto, para la crema pastelera, lleve la leche, la crema, las vainas de vainilla y las semillas de vainilla a ebullición suavemente en una cacerola.", "Bata el azúcar y las yemas de huevo en un tazón hasta que estén pálidas y cremosas.", "Cuando la mezcla de leche esté a punto de hervir, viértala en la mezcla de huevo, batiendo continuamente hasta que se haya incorporado todo el líquido.", "Regrese la mezcla a la sartén y cocine a fuego lento, batiendo todo el tiempo, hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara de madera.", "Colar la crema pastelera en una sartén limpia y calentar muy suavemente.", "Cuando el budín se haya cocinado, sáquelo de la sartén con el mango de cadena. Desenvuelva el pudin y deseche el papel de aluminio y el pergamino para hornear. Coloque el pudín en un plato para servir, luego córtelo en rodajas y sirva con la crema pastelera."], "url": "www_bbc_co_uk_food_recipes_blueberry_steamed_sponge_48910", "title": "Pudín de esponja al vapor de arándano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "½ ramita de canela", "640 g / 1 lb 6½ oz de arándanos frescos", "1 cucharada de mantequilla sin sal", "125ml / 4¼fl oz de licor de melocotón", "50 g / 1¼ oz de muesli", "Harina normal de 70 g / 2½ oz", "85g / 3oz de azúcar moreno claro", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos", "1 cucharadita de miel clara", "1 cucharada de mascarpone"], "method": ["Para el relleno, caliente el azúcar, la rajita de canela, los arándanos y la mantequilla en una sartén, revolviendo continuamente, hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 3-4 minutos, o hasta que el azúcar se haya derretido y se haya dorado en algunos lugares y los arándanos se hayan descompuesto.", "Agregue el licor de melocotón y deje hervir durante un minuto, revolviendo bien. Retire la sartén del fuego y reserve.", "Para la cobertura de crumble, coloque el muesli, la harina, el azúcar moreno y la mantequilla en un tazón grande. Frote con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado.", "Transfiera la mezcla de crumble a una sartén seca y tueste a fuego medio hasta que se dore.", "Para el mascarpone meloso, mezcle la miel y el mascarpone hasta que estén suaves y bien combinados.", "Para servir, divida la mezcla de llenado por igual entre dos moldes. Espolvorea sobre la cobertura de crumble. Coloque los moldes en platos para servir y cuchara el mascarpone meloso al lado."], "url": "www_bbc_co_uk_food_recipes_blueberryalpinecrumb_91327", "title": "Crumble muesli arándano rápido", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de masa de copos de brisa lista", "225 g / 8 oz de arándanos", "225 g / 8 oz zarzamoras", "½ limón, jugo y ralladura", "½ cucharadita de canela molida", "25g / 1 oz de azúcar demerara", "1 huevo de gallinas camperas, ligeramente golpeado", "4 cucharadas de mermelada de albaricoque", "4 cucharadas de agua", "150g / 5oz de crema coagulada, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrasar y hornear cuatro moldes dariole.", "Estire la masa y cuidadosamente alinee cada uno de los moldes, reteniendo suficiente masa para una tapa para cada pastel.", "En un tazón, mezcle los arándanos, las moras, el jugo de limón y la ralladura, la canela y el azúcar. Llene los moldes con esta mezcla y colóquelos en una bandeja para hornear.", "Cubra y selle con la masa restante. Haz una hendidura en la parte superior de cada tarta para liberar vapor.", "Cepíllese con huevo y cocínelo por unos 20 a 30 minutos, hasta que la parte superior esté dorada.", "Una vez cocido, deje reposar, antes de sacarlo del molde.", "Hierva el atasco y el agua para hacer un glaseado. Usando un pincel de pastelería, unte el glaseado sobre cada pastel.", "Sirve con crema cuajada."], "url": "www_bbc_co_uk_food_recipes_blueberryandblackber_83914", "title": "Pastel de arándanos y moras con crema cuajada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4oz de arándanos", "½ limón, solo jugo", "3 cucharadas de cuajada de limón", "Crema doble de 200 ml / 7 fl oz", "200g / 7 oz de galletas de mantequilla precocinadas", "Avellanas tostadas 50 g / 2 oz, picadas", "50g / 2oz de mantequilla, derretida", "6 x 10cm / 4 en latas de tartaleta de fondo suelto", "25 g / 1 oz de arándanos", "½ limón, solo ralladura"], "method": ["Coloque los arándanos y el jugo de limón en una cacerola pequeña a fuego suave. Cocine hasta que los arándanos comiencen a reventar y se ablanden.", "Con una batidora de mano, mezcle los arándanos hasta lograr un puré suave y déjelos enfriar.", "Para hacer las cajas de tartas, coloque los bizcochos y avellanas en un procesador de alimentos y mezcle hasta obtener una consistencia de miga fina.", "Agregue la mantequilla derretida y mezcle hasta que esté bien mezclado. Extienda la mezcla en latas de tartaleta y presione en la base y los lados de las latas. Transferir a la nevera y enfriar durante una hora.", "Mientras tanto, en un tazón grande, bate la crema hasta que forme picos suaves.", "Coloque la crema de limón en un recipiente y agregue el puré de arándanos y mezcle bien.", "Agregue la mezcla de arándanos a la crema batida y dóblela suavemente, dejando un efecto veteado de 'arándano'.", "Con cuidado, gire las cajas de tarta de mantequilla cortada enfriada de sus latas en los platos y una cuchara de la crema de arándanos y limón en el interior.", "Para servir, esparza los arándanos adicionales y espolvoree con un poco de ralladura de limón para adornar."], "url": "www_bbc_co_uk_food_recipes_blueberryandlemonfoo_81865", "title": "Tartaletas de blueberry y lemon fool", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["paquete de hojaldre comprado en la tienda", "2 bañeras de mascarpone", "1 tina de miel clara", "arándanos frescos", "azúcar glasé al polvo"], "method": ["Estire la masa de hojaldre en un cuadrado grande y cocine de acuerdo con las instrucciones del paquete (aproximadamente 7 minutos). Una vez cocinado, deja enfriar la masa.", "Mezcle el mascarpone y la miel y extiéndalos sobre la masa fría.", "Decora con arándanos y una ligera capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_blueberryandmascarpo_4977", "title": "Tarta de arándanos y mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]