[{"isVegetarian": true, "title": "Maceta de manzana y canela", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_79023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g / 5½oz de yogur sin grasa de estilo griego", "1 cucharada de avena", "1 manzana pequeña, rallada", "25 g / 1 oz de arándanos", "pellizcar canela molida", "edulcorante bajo en calorías, al gusto (opcional)"], "serves": "Sirve 1", "time": {"preparation": "durante la noche", "cookingMins": 0, "cooking": "no se requiere cocinar", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mezcle el yogurt y la avena en un bol, cubra y refrigere toda la noche.", "Cuando esté listo para comer, mezcle la manzana, los arándanos, la canela y el edulcorante, si los está usando. Servir."]}, {"isVegetarian": true, "title": "Kugelhopf de manzana y canela con manzanas con miel", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_79794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60 g / 2¼ oz de mantequilla sin sal, suavizada, para engrasar", "60 g / 2¼ oz de almendras molidas, para quitar el polvo", "200ml / 7fl oz de leche entera", "85g / 3oz de azúcar en polvo", "85g / 3oz de mantequilla sin sal, ablandada", "Harina simple 400g / 14oz", "3 cucharaditas de canela molida", "1 cucharadita de sal marina fina", "2 limones, solo cáscara", "12 g de levadura de acción rápida", "2 huevos grandes de gallinas camperas", "2 manzanas Golden Delicious, peladas, sin corazón y cortadas en cubitos (aproximadamente 220 g / 8 oz después de pelarlas y descorazonarlas)", "75 g / 2½ oz de sultanas empapadas en calvados", "120 g / 4oz de mantequilla sin sal", "8 cucharadas de calvados", "½ cucharadita de canela molida", "½ cucharadita de pasta de vainilla", "240 g / 8½ oz de miel", "1 cucharadita de jugo de limón", "5 manzanas Golden Delicious, peladas, sin corazón y cortadas en cubitos", "30 almendras blanqueadas"], "serves": "Hace 1 torta grande", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Engrase completamente la lata de bundt con mantequilla y polvo con almendras molidas, asegurando que no se hayan perdido áreas. Precaliente un cajón calentador a 28 ° C / 82 ° F (si no tiene un cajón calentador, puede probar la masa junto a una ventana soleada o suspendida sobre un recipiente con agua caliente).", "Para la masa, coloque un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento. Agregue la leche y 25ml / 1fl de agua al tazón y caliente suavemente hasta que alcance 45C / 113F en un termómetro de cocción.", "Mientras tanto, en el tazón de una batidora independiente, mezcle el azúcar en polvo y la mantequilla ablandada hasta que esté pálida y esponjosa. Agregue la harina, la canela, la sal, la ralladura de limón y la levadura instantánea, asegurándose de que la levadura no toque la sal.", "Agregue la mezcla de leche tibia y los huevos. Mezcle lentamente usando el accesorio de paleta para juntar la mezcla, luego aumente la velocidad a medio y continúe mezclándolo durante cinco minutos. La masa será muy pegajosa y fibrosa.", "Doble las manzanas en cubos y las pasas, luego transfiera la masa al estaño preparado. Agite la lata para asegurarse de que la masa esté en todos los rincones y grietas. Cubra con un trozo grande de película adhesiva (o un gorro de ducha) y colóquelo en el cajón calentador durante 1 hora y 10 minutos, o hasta que la masa se haya duplicado y casi llegue a la parte superior de la lata.", "Precaliente el horno a 190C / 375F / Gas 5. Coloque un estante en el tercer estante del horno.", "Para las manzanas con miel, derrita 40 g / 1½ oz de la mantequilla en una sartén grande. Agregue los calvados, canela, vainilla, miel, jugo de limón y 120 ml / 4 fl oz de agua y deje hervir a fuego medio.", "Agregue las manzanas y reduzca el calor. Revuelva a menudo y cocine durante unos ocho minutos, o hasta que las manzanas estén tiernas y el líquido se haya espesado. Retire del fuego y agregue la mantequilla restante. Transfiera a un recipiente y déjelo enfriar.", "Cuando el pastel haya terminado de probarse, hornee durante 35-40 minutos. Compruébelo después de 30 minutos, está listo cuando una brocheta colocada en el centro sale limpia y la tarta se ha desprendido ligeramente de los lados de la lata. Retire la torta del horno y déjela enfriar en la lata durante unos cinco minutos.", "Para decorar, ponga las almendras blanqueadas en una bandeja para hornear y tueste en el horno hasta que estén doradas.", "Coloque la torta en el centro de un plato de servir y deje que se enfríe durante cinco minutos.", "Pinche la parte superior de la torta con un pincho y rocíe sobre la salsa de las manzanas con miel.", "Decora el pastel con las almendras tostadas. Coloque en un plato de servir y cuchara las manzanas con miel en y alrededor del pastel. Rocíe cualquier salsa restante de las manzanas con miel sobre el pastel y sirva."]}, {"isVegetarian": true, "title": "Pastel de pan con manzana y canela", "url": "www_bbc_co_uk_food_recipes_apple_and_cinnamon_loaf_75570", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_cinnamon_loaf_75570_16x9.jpg", "ingredients": ["75g / 2½oz de mantequilla, suavizada", "Harina de auto crianza de 200g / 7oz", "100g / 3½oz de azúcar mascabado ligero", "1 cucharadita de canela molida", "3 manzanas de postre, aproximadamente 350 g / 12 oz antes de pelar", "3 huevos de gallinas camperas, golpeados", "1-2 cucharadas de azúcar demerara, al gusto", "2 cucharadas de mermelada de albaricoque calentada y tamizada"], "serves": "Hace 2 panes de 450 g / 1 libra", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Ajuste el horno a 180C / 350F / Gas 4 (ventilador de 160C).", "Frote la mantequilla en la harina hasta que se asemeje a migas de pan finas (esto se puede hacer en un procesador de alimentos). Agregue el azúcar y la canela.", "Pele las manzanas, el corazón y los dados dos manzanas y media y revuelva en la mezcla de la torta con los huevos. Batir hasta que se combine.", "Divida la mezcla de la torta de manera uniforme entre las latas de la torta. Corta finamente la mitad restante de manzana y organiza en fila a lo largo del medio en la parte superior de cada pastel. Espolvorear con azúcar demerara y hornear durante 35-45 minutos, o hasta que estén doradas, elevadas, firmes al tacto en el centro y encogiéndose de los lados de la lata.", "Cepille la parte superior de los pasteles con la mermelada de albaricoque. Deje que se enfríe en las latas durante 10 minutos, luego gírelo y déjelo enfriar sobre una rejilla de alambre."]}, {"isVegetarian": true, "title": "Tarta de manzana y ciruela con salsa de caramelo de ron", "url": "www_bbc_co_uk_food_recipes_apple_and_plum_pudding_27042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_plum_pudding_27042_16x9.jpg", "ingredients": ["125g / 4oz de mantequilla sin sal, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar en polvo de oro", "1 huevo de gallinas camperas, ligeramente golpeado", "Harina normal 150g / 5oz", "1 cucharadita de polvo de hornear", "½ cucharadita de sal", "1 cucharadita de canela molida", "½ cucharadita de nuez moscada rallada", "Pacanas de 100g / 3½oz, más o menos picadas", "3 manzanas medianas (mezcla de granny smith y golden delicious), peladas, sin corazón, picadas en trozos pequeños", "5 ciruelas, piedra removida, cortada en pedazos pequeños", "2 cucharadas de jengibre de tallo finamente picado", "200 g / 7 oz de azúcar en polvo", "Crema batida 250ml / 8floz", "1-2 cucharadas de ron oscuro", "1 cucharadita de esencia de vainilla"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la manzana y la torta de ciruela, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata de pastel redonda de 23 cm / 9 pulgadas de profundidad.", "Batir la mantequilla y el azúcar juntos en un bol hasta que estén suaves y esponjosos. Agregue el huevo y dos cucharadas de harina y mezcle hasta que estén bien combinados.", "Batir la harina restante, sal, bicarbonato de sodio, canela y nuez moscada y hasta que se combinen.", "Remueva con los ingredientes restantes.", "Vierta la mezcla en la lata de la torta y hornee durante 35-45 minutos, o hasta que estén dorados y elásticos al tacto.", "Retire el pudín del horno y déjelo a un lado para que se enfríe un poco.", "Mientras tanto, para la salsa de caramelo de ron, caliente el azúcar en una cacerola durante 4-5 minutos, o hasta que se convierta en caramelo. Retire la sartén del fuego y deje a un lado para que se enfríe un poco.", "Caliente la crema en una cacerola a fuego medio, luego mezcle con el caramelo para formar una salsa suave. Agregue la vainilla y agregue el ron, al gusto.", "Para servir, corte el budín en trozos y sirva con la salsa de caramelo de ron."]}, {"isVegetarian": true, "title": "Cometas de manzana y limón", "url": "www_bbc_co_uk_food_recipes_apple_and_lemon_kites_00762", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["160g / 5¾oz de mantequilla sin sal, 120g / 4¼oz enfriada y 40g / 1½oz a temperatura ambiente", "250g / 9oz de harina blanca fuerte", "10 g / oz de leche en polvo", "30 g / 1 oz de azúcar en polvo", "7g de sal", "8,5 g de levadura seca de acción rápida", "30 g / 1 oz de azúcar en polvo", "30g / 1oz de azúcar glasé", "30 g / 1 oz de almendras molidas", "½ limón sin cebar, solo cáscara", "2 gotas de extracto de limón", "1 yema de huevo grande de granja, batida", "1 manzana de postre (idealmente Pink Lady o braeburn)", "1 cucharada de jugo de limón", "50ml / 1¾fl oz de jugo de limón", "50 g / 1 oz de azúcar en polvo", "3 cucharadas de azúcar glas", "1 huevo grande de gallinas camperas, golpeado"], "serves": "Hace 6 pasteles", "time": {"preparation": "más de 2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Prepare la mantequilla fría colocándola entre dos hojas de papel resistente a las grasas y golpeándola con un rodillo hasta que tenga un rectángulo de 8x15 cm / 3¼x6 pulgadas de 1 cm / ½ pulgadas de grosor. Pon esto de nuevo en la nevera.", "Coloque la mantequilla a temperatura ambiente, harina blanca fuerte, leche en polvo, azúcar impalpable, sal y 150 ml / 5 fl oz de agua en el cuenco de un mezclador independiente equipado con un gancho de masa. Mezcle en un ajuste bajo hasta que se combine. Vierta la levadura y continúe mezclando a baja velocidad durante cinco minutos, luego aumente la velocidad a medio y continúe mezclando durante otros 5-7 minutos.", "Incline la masa fuera del tazón y júntela en una bola suave, luego colóquela en un recipiente engrasado, no metálico y déjela a un lado, tapada, por 15 minutos.", "Transfiera el tazón al microondas y caliente a 100 vatios durante seis minutos, luego déjelo reposar por otros 10 minutos. Alternativamente, pruebe la masa en una habitación caliente por otros 45 minutos, o hasta que duplique su tamaño.", "Incline la masa hacia una encimera y luego extiéndala en un rectángulo de 18x25 cm / 7x10 pulgadas, de aproximadamente 1 cm / ½ pulgadas de grosor.", "Transfiera a una bandeja para hornear forrada con pergamino para hornear, cubra con película adhesiva y colóquela en el congelador durante 10 minutos.", "Retire la masa del congelador y coloque el bloque enrollado de mantequilla fría en el centro del rectángulo. Doble el tercio superior sobre la mantequilla y luego el tercio inferior hacia arriba sobre la parte superior. Estire hasta que tenga aproximadamente 1 cm / ½ pulgada de espesor nuevamente, gire la masa 90 grados y repita el proceso de doblado y laminado nuevamente.", "Dobla la masa en tres partes y colócala en el congelador por 15 minutos. Despliegue otra vez y esta vez pliegue en cuartos - doblando cada borde corto en el centro, luego cerrándolo como un libro. Estirar de nuevo, luego repetir este pliegue doble una vez más y congelar la masa por otros 15 minutos.", "Envuelva la masa en una película adhesiva y déjela en el refrigerador.", "Para el relleno de manzana y limón, coloque los azúcares, las almendras, la ralladura de limón y el extracto en un bol y mezcle. Agregue un poco de yema de huevo para unir los ingredientes secos y mezcle hasta lograr una pasta homogénea. Incline la pasta sobre la superficie de trabajo, luego gírela en seis bolas iguales y colóquela en el refrigerador.", "Corta la manzana de postre muy finamente, manteniendo la piel encendida, permitiendo cuatro rebanadas para cada cometa, es decir, 24 piezas. Coloque en un tazón con el jugo de limón para evitar que se pongan marrones.", "Estirar la masa fría en un rectángulo de 20x30 cm / 8x12 in y cortar en seis cuadrados iguales (aproximadamente 10 cm). Deje un borde de 1 cm / ½ pulgada, corte un cuadrado de 4 cm en el centro de cada cuadrado, cortando dos esquinas opuestas, pero dejando las otras dos esquinas conectadas a aproximadamente 1 cm por cada lado de los puntos de esquina (consulte el punto cuatro en el video de la técnica a continuación para mayor orientación). Cepille un poco de huevo batido en el centro, agregue una bola aplastada de almendras y relleno de limón y luego coloque cuatro rodajas de manzana en la parte superior. Doble los bordes de la esquina a los lados opuestos del cuadrado interno. Espolvorea azúcar impalpable sobre las manzanas y déjala durante una hora.", "Para hacer el glaseado de limón, ponga 25 ml / 1 fl oz de agua, la mitad del jugo de limón y el azúcar en una sartén a fuego lento. Cocine hasta que el azúcar se disuelva y luego hierva y continúe cocinando a fuego lento durante 5-10 minutos, o hasta que se forme un jarabe espeso. Dejar de lado para enfriar.", "Precalentar el horno a 220C / 425F / Gas 7.", "Cuando esté listo para hornear, cepille la parte superior de los pasteles (aunque no las rebanadas de manzana) con huevo batido y hornee durante 8-10 minutos, o hasta que estén dorados. Retire del horno, cepille con el glaseado de limón y déjelo enfriar durante cinco minutos en la bandeja antes de transferirlo a una rejilla de alambre. Deje que se enfríe completamente.", "Para hacer el glaseado de limón, mezcle el azúcar glas con una cucharadita de jugo de limón para formar un glaseado espeso. Coloque en una bolsa de comida con una esquina pequeña cortada.", "Una vez que las cometas estén completamente frías, rocíe con el glaseado de limón y sirva."]}, {"isVegetarian": true, "title": "Muffins de manzana y pasas de uva", "url": "www_bbc_co_uk_food_recipes_apple_and_raisin_muffins_04810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de miel líquida", "2 manzanas medianas Braeburn, peladas y cortadas en cubitos", "1 cucharadita de polvo chino de cinco especias", "1 cucharadita de especias mixtas molidas", "2 huevos grandes de gallinas camperas, golpeados", "3 cucharadas de aceite de sésamo tostado", "200 ml / 7 fl oz de leche semidesnatada", "2 plátanos pequeños, puré", "300g / 10½ oz de harina de auto crianza", "2-3 cucharaditas de edulcorante granulado", "1 cucharadita de bicarbonato de soda", "40 g / 1½ oz pasas", "1 cucharada de avena", "1 cucharada de azúcar moreno claro"], "serves": "Hace 12", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6 y alinee una bandeja para muffins de 12 orificios con fundas de muffin grandes.", "Coloque la miel en una cacerola pequeña antiadherente a fuego medio y caliente durante 2-3 minutos o hasta que se vuelva marrón dorado oscuro y comience a fumar.", "Agregue las manzanas y las especias y cocínelas durante 3-4 minutos, o hasta que estén ligeramente blandas. Retirar del fuego y reservar para enfriar.", "Batir los huevos, el aceite de sésamo y la leche en un bol. Mezcle los plátanos triturados.", "En un tazón grande, mezcle la harina, el edulcorante, el bicarbonato de soda y las pasas. Haz un pozo en el medio y vierte la mezcla de huevo. Agregue las manzanas y cualquier líquido de la sartén. Cuchara en los estuches de muffins.", "Mezcle la avena y el azúcar y espolvoree encima de cada panecillo.", "Hornee durante 20 minutos o hasta que un pincho presionado en el centro salga limpio. Enfriar sobre una rejilla de alambre y comer caliente o guardar en un recipiente hermético por hasta 3 días y calentar durante 5 minutos a 200C / 180C Ventilador / Gas 6."]}, {"isVegetarian": true, "title": "Gratinado de manzana y frambuesa con polenta crumble", "url": "www_bbc_co_uk_food_recipes_apple_and_raspberry_22932", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g / 1¾oz de almendras blanqueadas", "60 g / 2¼ oz de harina '00'", "Polenta de 40 g / 1½ oz", "2 gotas de extracto de vainilla", "350 g / 12 oz de azúcar en polvo, más extra para cocinar la fruta", "75g / 2¾oz de mantequilla, refrigerada y cortada en cubitos", "500ml / 18fl oz de leche entera, más una raya", "1 vaina de vainilla, dividida", "6 huevos de gallinas camperas, más 2 blancos", "Harina simple de 75g / 2¾oz", "2 manzanas Bramley, peladas y cortadas en cubitos", "1 limón, solo jugo", "2 manzanas de Cox, peladas y cortadas en cubitos", "Frambuesas 300g / 10½ oz"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Moler las almendras a una textura gruesa en un procesador de alimentos.", "Ponga las almendras molidas, la harina 00, la polenta, el extracto de vainilla y 50g / 1¾oz de azúcar en un tazón, luego frote la mantequilla aproximadamente. Extienda la mezcla en una bandeja para hornear, tapar y poner en la nevera durante 1 hora. Precalentar el horno a 180 C / Fan 160C / Gas 4.", "Hornee la migaja durante 10-20 minutos, pero revise de vez en cuando para asegurarse de que los bordes no estén encendidos. Dejar enfriar y luego romper en migajas.", "Mientras tanto, vierta la leche en una cacerola mediana de fondo grueso, agregue la vaina de vainilla y deje que hierva.", "Separe los huevos enteros y bata las seis yemas con 75g / 2¾oz de azúcar en un tazón grande y resistente al calor. Agregue la harina común para hacer una pasta. Verter sobre la leche caliente, batir bien, luego volver a la cacerola sobre el fuego. Reduzca el fuego y cocine suavemente durante 5 minutos, o hasta que espese. Vierta en un tazón, luego cubra y enfríe.", "Con una cuchara, vierta 4 cucharadas de crema fría en un tazón pequeño y agregue un chorrito de leche para bajarlo. Dejar de lado.", "Mientras tanto, cocine las manzanas Bramley en un poco de agua con un azúcar de 100 g / 3½ oz y la mitad del jugo de limón, hasta que se rompa en un puré. Cocine las manzanas de Cox en un poco de agua con 50 g / 1¾ oz de azúcar y el jugo de limón restante hasta que esté suave pero sosteniendo su peso.", "Vierta el puré de manzana en un plato, cúbralo con la manzana molida blanqueada, espolvoree las frambuesas y cubra con una cuchara la crema fría.", "Batir las ocho claras de huevo y el resto de 75g / 2¾oz de azúcar en un tazón de vidrio limpio hasta que espese. Agregue la crema reservada de 4 cucharadas.", "Vierta la mezcla de clara de huevo sobre la fruta y glasee con un soplete. Espolvorea sobre una mezcla de migajas y sirve."]}, {"isVegetarian": true, "title": "Magdalenas de manzana y ruibarbo", "url": "www_bbc_co_uk_food_recipes_apple_and_rhubarb_37109", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_rhubarb_37109_16x9.jpg", "ingredients": ["6 cucharadas de aceite de girasol", "200g / 7oz de azúcar morena suave", "1 huevo de gallinas camperas, golpeado", "250ml / 9fl oz de suero de leche", "1½ cucharadita de extracto de vainilla", "Ruibarbo 85 g / 3 oz, cortado en piezas de 1 cm / ½ pulgadas", "Manzana de 85g / 3oz, pelada, sin corazón y cortada en cubitos", "Nueces de 55 g / 2 oz, picadas", "1 cucharada de levadura en polvo", "Harina normal de 250 g / 9 oz, tamizada", "55 g / 1 oz de salvado de avena", "1 cucharada de azúcar demerara", "¼ cucharadita de canela molida", "¼ cucharadita de nuez moscada molida"], "serves": "Hace 12 muffins", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque 12 moldes para muffins con cajas de papel.", "En un tazón grande, mezcle el aceite, el azúcar moreno, el huevo, el suero de leche y la vainilla. Doble el ruibarbo, la manzana, las nueces, el polvo de hornear, la harina y el salvado de avena, luego vierta la mezcla en las cajas.", "Mezcle el azúcar demerara, la canela y la nuez moscada y espolvoree sobre los muffins. Hornee en el horno durante 20-25 minutos hasta que estén dorados y elásticos al tacto."]}, {"isVegetarian": false, "title": "Delia es cualquier tipo de salsa de queso", "url": "www_bbc_co_uk_food_recipes_anykindofcheesesauce_70007", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anykindofcheesesauce_70007_16x9.jpg", "ingredients": ["Cheddar maduro 2oz / 50g, rallado", "1 oz / 25 g de queso parmesano (Parmigiano Reggiano), finamente rallado", "1 pinta / leche de 570 ml", "Harina simple de 1½ oz / 40 g", "1½ oz / 40 g de mantequilla", "pizca de pimienta de cayena", "un poco de nuez moscada recién rallada", "sal y pimienta negra recién molida"], "serves": "Rinde 1 pinta / 570ml", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Todo lo que debes hacer es colocar la leche, la harina, la mantequilla y la pimienta de cayena en una olla mediana y colocarla sobre un fuego suave. Luego, usando un batidor de globo, comience a batir mientras lo lleva a fuego lento. Batir continuamente hasta que tenga una salsa suave y brillante, y cocine a fuego lento con cuidado durante 10 minutos. A continuación, agregue los quesos y bata de nuevo, permitiendo que se derritan. Luego sazone con sal, pimienta negra recién molida y un poco de nuez moscada recién rallada."]}, {"isVegetarian": true, "title": "Albóndigas de Apple y Stilton", "url": "www_bbc_co_uk_food_recipes_apple_and_stilton_23994", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cebollas rojas, cortadas en finos anillos", "3 cucharadas de vinagre de vino blanco", "2 limones, solo jugo", "1 cucharada de azúcar en polvo", "5 dientes", "1 ramita de canela", "100 g / 3½ oz de sultanas doradas", "3 comiendo manzanas, como Cox's Orange Pippin, peladas, sin núcleo, picadas", "1 limón, solo jugo", "320 g / 11¼ oz de hojaldre de mantequilla confeccionado", "harina común, para quitar el polvo", "160g / 5½oz Stilton", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de semillas de nigella"], "serves": "Rinde 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la salsa picante, caliente la cebolla, el vinagre, el jugo de limón, el azúcar, el clavo de olor y la canela en una cacerola no reactiva a fuego lento durante 15 minutos.", "Apaga el fuego y agrega las sultanas doradas. Reserve a un lado durante 30 minutos para permitir que las sultaninas se empapen.", "Precalentar el horno a un ventilador de 200C / 180C / Gas 6.", "Para las albóndigas, ponga las manzanas, el jugo de limón y 300 ml / 10½ fl oz de agua en una olla con tapa. Cubra la olla con la tapa y deje que la mezcla hierva a fuego lento. Guise las manzanas suavemente durante 18-20 minutos, revolviendo ocasionalmente. Cuando esté completamente ablandada, machaque la mezcla de manzana y transfiera a un recipiente para que se enfríe.", "Pase la hoja de hojaldre sobre una superficie de trabajo ligeramente enharinada hasta un cuadrado de 50 cm / 20 pulgadas. Con un cuchillo afilado, corte 16 cuadrados de 12 cm / 4½ pulgadas de la masa.", "Transfiere 8 de los cuadrados de repostería a una bandeja para hornear y coloca una porción generosa de la salsa de manzana enfriada en el centro de cada uno. Desmenuce alrededor de 20 g / ¾oz del Stilton sobre cada uno.", "Cepille los bordes de cada bollería con un poco del huevo batido. Coloque los 8 cuadrados de repostería restantes sobre los cuadrados de repostería llenos, prensando los bordes de cada uno para sellar. Cepille las partes superiores de los paquetes de repostería con más huevo batido, luego espolvoree sobre las semillas de nigella.", "Hornee durante 18-20 minutos, o hasta que la masa se haya levantado y esté dorada."]}, {"isVegetarian": true, "title": "Pudín al vapor de manzana y jarabe con compota de ciruela y manzana y flan casero", "url": "www_bbc_co_uk_food_recipes_apple_and_syrup_steamed_81727", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cucharadas de jarabe de oro", "1 manzana Bramley para cocinar, pelada y picada", "175g / 6oz de mantequilla, ablandada (más extra para engrasar)", "175g / 6oz azúcar morena oscura", "1 limón, ralladura solamente", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas", "4 huevos medianos de granja", "Harina de 175g / 6oz de auto crianza", "1 cucharadita de polvo de hornear", "2 cucharadas de mantequilla sin sal", "150 g / 5½ oz de azúcar en polvo", "Ciruelas 250 g / 9 oz, piedras quitadas", "150g / 5½oz de manzanas Bramley, peladas y picadas", "2 palitos de canela", "3-4 dientes", "1 cucharada de jengibre fresco y picado", "6 yemas de huevo de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "200ml / 7fl de leche en oz", "Crema doble de 200 ml / 7 fl oz", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el budín cocido al vapor, un tazón de 1,2 litre / 2 pinta resistente al calor y luego vierta el jarabe de oro en la parte inferior. Agregue la manzana y mezcle.", "Mezcle la mantequilla y el azúcar en un recipiente aparte hasta que estén suaves y esponjosos. Agregue la ralladura de limón y las semillas de vainilla. Batir los huevos uno por uno, batiendo bien entre cada adición. Doble la harina y el polvo de hornear y mezcle para formar una masa suave y espesa.", "Vierta la mezcla de esponja en el tazón con mantequilla. Corta una gran pieza de papel para hornear y un trozo de papel de aluminio a juego. Coloque la lámina en la parte superior y doble un pliegue por la mitad para permitir que el papel se expanda. Coloque sobre el pudin y asegure alrededor del borde con la cuerda de los cocineros. Doble un trozo grande de papel de aluminio en una tira larga y colóquelo debajo del tazón con leche para usarlo más adelante.", "Coloque un platillo o plato pequeño al revés en el fondo de una olla grande.", "Coloque el recipiente tapado en el platillo y vierta el agua en la sartén para alcanzar dos tercios del recipiente. Cubra la olla con una tapa y deje hervir. Reduzca el fuego y cocine a fuego lento durante 1-1½ horas.", "Para la compota de ciruela y pera, caliente una olla grande y agregue la mantequilla y el azúcar. Agregue las ciruelas, las manzanas, los palitos de canela, los clavos de olor y el jengibre y cocine a fuego lento durante 8-10 minutos. Cocine a fuego lento la salsa, revolviendo suavemente hasta que se espese.", "Para la crema pastelera, coloque las yemas de huevo y el azúcar en un tazón y mezcle hasta que estén bien mezclados. Coloque la leche, la crema, la vaina de vainilla y las semillas en una cacerola y llévela a ebullición. Cocine a fuego lento por un minuto, luego vierta en la mezcla de huevo y mezcle. Vuelva a la cacerola y caliente lentamente, o hasta que la natilla se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara. Colar a través de un colador en una sartén limpia.", "Para servir, retire el pudín de la cacerola usando la tira de papel aluminio para ayudarlo. Deseche el papel de aluminio y el pergamino para hornear. Coloque un plato sobre el pudin y voltee, volteando el pudin en el plato. Cortar el budín en rodajas y servir junto con la compota y la crema pastelera."]}, {"isVegetarian": true, "title": "Pastel de manzana y toffee crumble", "url": "www_bbc_co_uk_food_recipes_apple_and_toffee_crumble_76635", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_toffee_crumble_76635_16x9.jpg", "ingredients": ["aceite, para engrasar", "450 g / 1 libra de azúcar moreno oscuro", "5g / ¼oz de crema de tártaro", "100g / 3½ oz de jarabe dorado", "130g / 4½ oz de melaza negra", "225g / 8oz de mantequilla", "115g / 4 oz de azúcar", "1 yema de huevo de gallinas camperas", "Harina de 400g / 14oz, tamizada", "100 g / 3½ oz de mantequilla", "100g / 3½ oz de azúcar", "1 naranja, solo ralladura", "4 manzanas bramley, peladas y cortadas en cubitos", "1 ramita de canela", "4 comiendo manzanas (como Cox o Royal Gala), peladas y cortadas en cubitos", "Harina normal de 200g / 7oz", "100 g / 3½ oz de azúcar en polvo", "35 g / 1¼ oz de almendras molidas", "Almendras en copos de 10 g / ¼ oz", "Mantequilla 80g / 2½oz, ablandada", "flan, crème fraîche, helado o crema coagulada"], "serves": "Sirve 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Para hacer el caramelo, forre una bandeja con papel para hornear y engrase con aceite.", "En una sartén, ponga a hervir 125ml / 4fl de agua con el azúcar moreno oscuro. Cuando el azúcar esté disuelto, retíralo del fuego y agrega la crema de tártaro, el jarabe dorado y la melaza negra. Regrese al fuego y cocine hasta que alcance 140C / 284F en un termómetro de azúcar. (Esto tomará un tiempo, pero tenga paciencia y no lo deje desatendido, ¡puede arder muy fácilmente!) Una vez que alcanza los 140 ° C / 284 ° F, vierta la mezcla directamente en la lata forrada y déjela enfriar.", "Para la masa, precaliente el horno a 150C / 300F / Gas 2.", "Crema la mantequilla y el azúcar en una batidora eléctrica. Agregue la yema de huevo y luego la harina tamizada. Mezcle para combinar pero no trabaje demasiado.", "Envuelva la masa en una película adhesiva y déjela reposar en la nevera durante una hora.", "Después de descansar, extienda la masa sobre una superficie de trabajo ligeramente enharinada a aproximadamente 5 mm / ¼ de grosor. Forre un aro de tarta de 20cm / 8in con la masa y empuje suavemente en la base. Alinee con una película adhesiva y llénela con alubias o arroz (NB: No todos los tipos de película adhesiva son aptos para usar con todos los alimentos. Consulte la descripción en el envase para ver qué alimentos y con qué temperaturas puede usarse. Si no está seguro, use papel de aluminio o papel para hornear en su lugar). Coloque en el refrigerador por una hora para descansar nuevamente.", "Hornee en el horno precalentado durante 35 minutos, luego quite los frijoles para hornear y la película adhesiva y hornee durante otros 5-10 minutos, o hasta que estén completamente cocidos y tengan un color dorado claro. Retirar del horno y reservar para enfriar.", "Para el relleno, coloque la mantequilla, el azúcar y la ralladura de naranja en una sartén. Caliente hasta que la mantequilla y el azúcar se derritan.", "Agregue las manzanas bramley y la canela y cocine hasta que la manzana esté muy suave y se convierta en un puré. Agregue las manzanas que comen y cocine durante 1-2 minutos más, luego retírelas del fuego.", "Vierta la mezcla en un colador o colador para eliminar el exceso de líquido. Deseche la ramita de canela y deje enfriar las manzanas.", "Para el relleno de crumble, precaliente el horno a 180C / 350F / Gas 4.", "Mezcle la harina común, el azúcar impalpable, las almendras molidas, las almendras y la mantequilla junto con las manos, usando las yemas de los dedos para frotar los ingredientes secos en la mantequilla.", "Coloque esta mezcla en una bandeja para hornear y hornee durante aproximadamente 20 minutos, o hasta que estén dorados y desmenuzables. Revuelva el crumble cada cinco minutos para que se cocine de manera uniforme. Sacar del horno y dejar enfriar.", "Para armar el pastel, vierta la mezcla de manzana en la caja de pastelería cocida. Divide el caramelo en trozos y coloca algunos sobre la parte superior de la manzana (no necesitarás todo el caramelo). Cubra completamente la mezcla de manzana con el crumble tostado y el punto algunos trozos más de toffee en la parte superior.", "Hornee en el horno a 180 ° C / 350 ° F / Gas 4 durante 10-12 minutos, o hasta que el relleno esté burbujeando y el toffee se haya derretido.", "Sirva con flan, crema fresca, helado o crema cuajada ... ¡o los cuatro!"]}, {"isVegetarian": true, "title": "Chutney de manzana, mora y canela", "url": "www_bbc_co_uk_food_recipes_apple_blackberry__91830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Manzanas Bramley de 1kg / 2.2lb, peladas, sin corazón, cortadas en trozos grandes", "Cebollas de 300g / 10½oz, peladas, en rodajas finas", "275 g / 10 oz de azúcar granulada", "150ml / 5fl oz de vinagre balsámico", "2 cucharaditas de canela molida", "pimienta negra recién molida", "Moras 300g / 10½ oz"], "serves": "Hace 1.3kg / 3lb", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Esterilice los frascos poniéndolos en el lavavajillas en el ciclo más caliente para lavar y secar. Sáquelos cuando esté a punto de usarlos y no toque el interior de los frascos con las manos. (Alternativamente, ponga los frascos en una olla grande con agua hirviendo. También necesitará esterilizar el equipo que usa para sacar los frascos de la fuente).", "Coloque los frascos en el horno a baja temperatura hasta que esté completamente seco por dentro.", "Coloque las manzanas, las cebollas, el azúcar, el vinagre balsámico, la canela y la pimienta negra recién molida en una olla grande. Coloque a fuego medio y mezcle suavemente hasta que estén bien combinados.", "Una vez que la mezcla haya alcanzado el punto de ebullición, baje el fuego y deje hervir a fuego lento durante 45-55 minutos, revolviendo ocasionalmente. Las manzanas y las cebollas deben volverse hermosas y suaves, y el líquido debe ser espeso y almibarado.", "Agregue las moras y cocine por otros 10-12 minutos.", "Coloque la salsa picante en una jarra esterilizada y llene los frascos. Sella y almacena en un lugar oscuro. La salsa picante se mantendrá durante un máximo de cuatro meses."]}, {"isVegetarian": true, "title": "Tarta de manzana y Wensleydale", "url": "www_bbc_co_uk_food_recipes_apple_and_wensleydale_16189", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_wensleydale_16189_16x9.jpg", "ingredients": ["Harina normal de 350g / 12oz", "175g / 6oz de mantequilla sin sal fría, cortada en cubos de aproximadamente 1cm, más extra para engrasar", "500g / 1lb 2oz de manzanas para cocinar", "500g / 1lb 2oz comiendo manzanas", "100 g / 3½ oz de azúcar en polvo", "125g / 4½oz de queso Wensleydale, desmenuzado", "un poco de leche", "aproximadamente 1 cucharada de azúcar en polvo"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para hacer la masa, poner la harina en un tazón. Agregue la mantequilla y frótela ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a migas de pan finas. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Con un cuchillo de mesa, trabaje con suficiente agua fría (alrededor de 75 ml / 2½ fl oz) para unir la masa. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la masa en una película adhesiva y descanse en la nevera durante aproximadamente 30 minutos.", "Precalienta el horno a 200C / 400F / Gas 6. Ligeramente unta de mantequilla para hornear, alrededor de 26x20cm / 10½x8in y 3cm / 1¼in de profundidad.", "Para rellenar, pelar, cuartear y cortar todas las manzanas. Rebane en un tazón grande y mézclelos juntos.", "Una vez que la masa ha descansado, córtela en dos pedazos, aproximadamente un tercio y dos tercios del total. Empolva ligeramente una superficie de trabajo con harina. Estirar la pieza más grande de masa, por lo que es un buen centímetro más grande en todos los lados que la lata. Alinee la base y los lados de la lata con la masa, dejando el exceso colgando sobre los lados.", "Coloque un tercio de las rodajas de manzana en la lata cubierta de bollos y espolvoree con un tercio del azúcar. Repita con la manzana y el azúcar restantes. Ahora esparce el queso desmenuzado uniformemente sobre la fruta.", "Estirar los pasteles restantes para hacer una tapa. Cepille los bordes de la masa en la lata con leche y luego ponga la tapa de la pastelería en la parte superior. Selle los bordes con la yema de los dedos y recorte el exceso de masa pastelamente. Cepille la masa con leche y espolvoree un poco de azúcar. Haga dos ranuras en la parte superior para permitir que salga el vapor.", "Hornee durante 30-35 minutos, o hasta que la masa esté dorada. Deja por lo menos 15 minutos antes de cortar. El pastel es delicioso caliente o frío y no necesita acompañamiento."]}, {"isVegetarian": true, "title": "Apple charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_08809", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Azúcar en polvo 80g / 3oz", "25 g / 1oz de mantequilla sin sal, refrigerada", "500g / 1lb 2oz de manzanas Cox's Orange Pippin, peladas, sin corazón y cortadas en 8 cuñas", "150ml / 5fl oz de jugo de manzana fresca", "10 g de azúcar en polvo", "½ cucharadita de pectina de manzana", "250g / 9oz de manzanas Blenheim Orange (alrededor de 5), peladas y picadas", "½ cucharadita de puré de vainilla o extracto de vainilla de buena calidad", "50 g / 1¾oz de mantequilla sin sal, ablandada", "50 g / 1 oz de azúcar en polvo", "Pan integral de 200g / 7oz, cortado en 11 rebanadas; cada 5 mm / ¼ de grosor", "50 g / 1¾oz de mantequilla sin sal, ablandada"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para las manzanas caramelizadas, en una sartén grande o en una sartén a fuego medio-alto, caliente el azúcar en un caramelo dorado oscuro sin remover, luego agregue la mantequilla. El caramelo se emulsionará con la mantequilla y la mantequilla fría también detendrá la cocción del caramelo. Agregue las manzanas y cocine en el caramelo por 5 minutos, con la tapa puesta, hasta que se ablanden pero mantengan su forma (el centro aún estará un poco crudo). Retire del fuego.", "Para la compota, mezcle 50ml / 2fl oz del jugo de manzana con el azúcar y la pectina. Deslice la manzana picada en una cacerola mediana colocada a fuego medio. Agregue el jugo de manzana restante y cocine durante 10 minutos, tapado con una tapa, hasta que las manzanas se rompan. Agregue la mezcla de azúcar / pectina y el puré o extracto de vainilla, revuelva y cocine por otros 5 minutos para permitir que se evapore la humedad. Retire del fuego.", "Precaliente el horno a 210C / 190C Fan / Gas 6½.", "Para preparar el anillo para pastel, ligeramente unte con mantequilla el interior de un anillo de pastel de 15x6cm / 6x2½ pulgadas. Sumerja el anillo en azúcar para que el azúcar cubra el interior del anillo. Tóquelo ligeramente para asegurar un recubrimiento uniforme; toque cualquier exceso. Coloque un trozo de papel de aluminio de 25 cm / 10 in, luego cúbralo con el mismo tamaño de papel pergamino. Coloque el anillo de la torta en la parte superior y enrolle la lámina y el papel, de modo que la lámina se adhiera firmemente al borde inferior del anillo, esto evitará que se escape el jugo. Coloque el anillo en una bandeja para hornear.", "Para Charlotte, corte las rebanadas de pan en cuadrados de 6cm / 2½ pulgadas. Difunde ligeramente ambos lados del pan con la mantequilla y fría en una sartén grande a fuego medio-alto durante 20-30 segundos en un lado, hasta que estén uniformemente dorados. Transfiera el pan a un plato o bandeja y luego úselo para alinear el interior del anillo, con los lados dorados hacia afuera y superpuestos en 2 cm / ¾ pulg. Presione para asegurarse de que se adhieren a los lados.", "Para construir, mezcle la manzana caramelizada en la compota, luego vierta la mezcla en el centro del anillo para llenar el Charlotte. Se verá demasiado y habrá una pequeña cúpula, pero después de cocinar las manzanas colapsarán por su propio peso hasta que estén al nivel del borde del anillo. Coloque la manzana Charlotte en el horno durante 30 minutos. Retire del horno y deje enfriar por completo durante un mínimo de 3 horas. Esto permitirá que la pectina se establezca por completo y se fortalezca, lo que también hará que Charlotte sea más fácil de cortar. Una vez que esté fresco, dale la vuelta a Charlotte colocando un plato grande encima y volteándolo. Retire la lámina y el papel del anillo. Necesitarás calentar el anillo un poco para levantarlo suavemente; use un soplete o colóquelo en un horno calentado a 180 ° C / 160 ° Ventilador / Gas 4 por un minuto, luego desactívelo suavemente.", "Para servir, corte cuidadosamente el Charlotte en 6-8 piezas. Este hermoso postre se puede servir con helado de vainilla o crema Chantilly. También es perfecto con un vaso de tu mejor sidra."]}, {"isVegetarian": true, "title": "Apple Charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_12801", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g / 2lb de mantequilla sin sal", "600g / 1lb de azúcar en polvo de 5 oz", "5kg / 11lb manzanas Bramley, peladas, sin corazón y picadas", "60 rebanadas de pan blanco, sin costras"], "serves": "Para 40", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calienta 250 g / 9 oz de la mantequilla en una olla grande, agrega el azúcar y las manzanas y cocina durante 20 minutos o hasta que las manzanas se hayan descompuesto.", "Coloque la mantequilla restante en un plato apto para microondas y caliente durante 3-4 minutos, o hasta que se derrita.", "Corte cada rebanada de pan en cuatro tiras y sumérjala en la mantequilla derretida. Haga una línea de cinco cuencos de pudín de 1,2 litros / 2 pinta con el pan, superponiendo ligeramente las rebanadas, reservando un poco de pan para colocar en la parte superior.", "Llene los recipientes revestidos con la mezcla de manzana y cubra con el pan restante que se ha sumergido en mantequilla.", "Hornee en el horno y cocine durante 30 minutos o hasta que estén doradas en la parte superior."]}, {"isVegetarian": true, "title": "Apple Charlotte", "url": "www_bbc_co_uk_food_recipes_apple_charlotte_36737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 1¾oz de mantequilla ligeramente salada, ablandada", "50 g / 1 oz de azúcar en polvo", "1 rebanada de pan blanco en rebanadas medianas, sin costras", "300 g / 10½ oz de azúcar en polvo", "100g / 3½oz de mantequilla ligeramente salada", "Manzanas Cox de 2kg / 4lb 8oz, peladas, sin corazón y cortadas en 8 cuñas iguales", "500ml / 18fl oz de leche entera", "1 vaina de vainilla, semillas raspadas", "5 yemas de huevo de gallinas camperas", "30 g / 1 oz de azúcar en polvo"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalienta el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Mantee generosamente el interior del molde Charlotte con mantequilla y luego espolvorea con el azúcar.", "Usando un cortador de galletas redondo de 4 cm / 1½ pulgadas, corte rodajas de pan blanco y luego forre el molde en un patrón superpuesto, presionando hacia abajo para sellar a medida que avanza. Pon el pan restante a un lado. Transfiera el molde a la nevera mientras realiza el llenado.", "Para hacer el relleno, caliente el azúcar en una sartén grande a fuego medio hasta que alcance un color caramelo oscuro. Incline la mantequilla y deje que la mezcla burbujee durante unos segundos. Agregue las manzanas, mezcle para cubrir con el caramelo, luego cocine a fuego alto durante 5 minutos, revolviendo ocasionalmente.", "Vierta el relleno de manzana en el molde alineado, luego cubra con suficientes pedazos de pan para sellar. Sujete firmemente la tapa, o si está usando un recipiente para budines, cubra con papel de aluminio y apoye una bandeja para hornear pesada en la parte superior. Hornee por 30 minutos, luego retírelo del horno y déjelo reposar por 10 minutos. Ponlo en un plato caliente.", "Mientras tanto, para hacer la crema pastelera, combine la leche, la vaina de vainilla y las semillas en una olla y cocine a fuego lento. Mientras tanto, mezcle las yemas de huevo y el azúcar en un tazón grande y resistente al calor.", "Vierta la leche a través de un colador sobre la mezcla de yema de huevo, batiendo mientras vierte para combinar. Regrese la mezcla a la sartén a fuego lento y cocine suavemente durante 2-3 minutos, revolviendo constantemente, hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Tan pronto como la natilla esté cocida, vierta en una jarra de servir. Sirva junto a la manzana Charlotte. Vea las sugerencias de recetas a continuación."]}, {"isVegetarian": true, "title": "Tarta de manzana, cereza y mazapán", "url": "www_bbc_co_uk_food_recipes_apple_cherry_and_37920", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225 g / 8oz de mantequilla sin sal, en trozos", "Harina normal de 430 g / 15 oz, más extra para quitar el polvo", "50 g / 1 oz de azúcar en polvo", "pizca de sal", "1 limón, ralladura solamente", "pellizcar canela molida", "60g / 2¼ oz de azúcar en polvo", "4 cucharadas de harina de maíz", "3 manzanas Braeburn, peladas, sin corazón y cortadas en rodajas de 1cm / ½ in de espesor", "3 manzanas Cox, peladas, sin corazón y cortadas en rodajas gruesas de 1cm / ½ in", "Mazapán 200 g / 7 oz, cortado en cubos pequeños", "150g / 5½oz de guindas secas", "1 huevo de gallinas camperas, ligeramente batido con una pizca de sal"], "serves": "Sirve 8", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque la mantequilla y la harina en un tazón grande y, con las puntas de los dedos, frote la mantequilla en la harina hasta que se asemeje a migas de pan finas. Mezcle el azúcar y una pizca de sal. Mida cinco cucharadas de agua en una jarra y agréguela lentamente a la mezcla hasta que se junte para formar una masa (es posible que no necesite toda el agua). La masa debe ser firme pero no desmenuzable.", "Transfiera la masa a una superficie de trabajo ligeramente enharinada y amase muy brevemente solo para combinar. Envuelva la película adhesiva y transfiérala a la nevera para que se enfríe durante 20 minutos.", "Precaliente el horno a 190C / ventilador del horno 170C / 375F / Gas 5.", "Para el relleno, en un tazón grande combine la ralladura de limón, la canela, el azúcar impalpable y la harina de maíz. Agregue las manzanas y revuelva para cubrir.", "Enharine ligeramente una superficie de trabajo y un rodillo. Retire los pasteles del refrigerador y reserve un tercio para la tapa del pastel. Estirar los pasteles restantes hasta que queden lo suficientemente grandes como para que quepan generosamente. Utilice el rodillo para ayudarlo a levantar la masa dentro del plato de pastel y presiónelo suavemente hacia los lados, dejando cualquier exceso de hojaldre colgando sobre los lados. Coloque en el congelador para enfriar durante 10 minutos.", "Estirar el resto de la masa para formar la tapa de la pastelería. Use cualquier exceso para formar formas para decorar el pastel.", "Coloque una capa de rebanadas de manzana en el plato para pastel y espolvoree con cubos de mazapán y cerezas. Repita en capas hasta que el plato esté casi lleno en los bordes y apilado en el centro.", "Coloque la tapa de la pastelería encima y arrugue los bordes para sellar. Haz un agujero en el centro para permitir que la corriente escape. Coloque las formas decorativas en la parte superior y luego glasee con huevo batido.", "Hornee en el horno precalentado durante 40-45 minutos, o hasta que la masa esté dorada y crujiente. Revise después de 25 minutos y, si es necesario, cúbralo con papel de aluminio para evitar que se quemen los bordes de la pastelería."]}, {"isVegetarian": true, "title": "Croustade de manzana con crema de Armagnac", "url": "www_bbc_co_uk_food_recipes_apple_croustade_with_56799", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g / 6oz de azúcar en polvo", "75g / 3oz de mantequilla", "3 cucharadas de agua", "50g / 2oz de arándanos secos", "50g / 2oz sultanas", "50 g / 2oz de pasas", "1kg / 2lb 2oz de manzanas de postre, como Cox's Orange Pippin, peladas, sin corazón y descuartizadas", "200 g / 7 oz de pasta filo, cortado en tiras de 5 cm / 2 pulgadas de ancho", "½ cucharadita de canela molida", "1 clementina, solo ralladura", "1 limón, ralladura solamente", "75g / 3oz de mantequilla clarificada", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "2-3 cucharadas de armagnac"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la croustade, precalentar el horno a 200C / 400F / Gas 6.", "Caliente una sartén a prueba de horno de 24 cm / 9½ pulgadas o un plato de tatin hasta que esté caliente. Agregue 125 g / 4½ oz de azúcar en polvo y caliente hasta que el azúcar se derrita en un caramelo. Agregue la mantequilla y cocine durante 2-3 minutos más.", "Retire la sartén del fuego y agregue los arándanos secos, pasas y pasas.", "Agregue las manzanas hasta que estén completamente cubiertas en la mezcla de caramelo. Regrese la sartén al fuego y cocine por 3-4 minutos más. Dejar de lado.", "Mezcle las tiras de pasta filo, la canela, la ralladura de clementina y la ralladura de limón en un bol hasta que la cáscara y las especias cubran la masa, luego mezcle la mantequilla clarificada hasta que cubra la masa.", "Revuelva las tiras recubiertas de pasta filo en sus manos y colóquelas encima de la mezcla de caramelo en la sartén.", "Coloque la sartén en el horno durante 10-15 minutos, o hasta que la masa de filo esté crujiente y dorada.", "Mientras tanto, para la crema pastelera Armagnac, bata las yemas de huevo y el azúcar en un tazón hasta que estén bien combinados.", "Caliente la leche, la crema y el Armagnac en una cacerola hasta que hierva. Retire la sartén del fuego, luego bata lentamente la mezcla de crema caliente en la mezcla de huevo.", "Regrese la mezcla de crema a la cacerola y cocine a fuego lento durante 2-3 minutos, o hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Para servir, corte la croustade en trozos y sirva rociada con la crema pastelera Armagnac."]}, {"isVegetarian": true, "title": "migas de manzana", "url": "www_bbc_co_uk_food_recipes_apple_crumble_95357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["70 g / 2½ oz de mantequilla sin sal", "100g / 3½oz de azúcar moreno", "6-8 manzanas (una mezcla de variedades para cocinar y comer), peladas, sin corazón, cortadas en trozos de 2cm / ¾in", "Harina normal 300g / 10½ oz", "200g / 7oz de mantequilla fría, en cubos", "pellizcar canela molida", "150g / 5oz demerara azúcar", "100 g / 3½ oz de avena porridge"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 C / 160 Fan / Gas 4.", "Para el relleno, coloque una cazuela o plato para horno a prueba de fuego a fuego medio. Agregue la mantequilla y el azúcar y revuelva hasta que se derrita y se combine bien.", "Aumente el fuego y continúe cocinando hasta que la mezcla se oscurezca y comience a caramelizar (tenga cuidado de no quemar la mezcla o de que tenga un sabor amargo).", "Agregue las manzanas picadas y revuelva para cubrirlas en la mezcla. Continúe cocinando durante 6-8 minutos, o hasta que estén blandos, a fuego lento, luego vuelva a calentar a fuego medio y siga cocinando hasta que los trozos de manzana estén completamente tiernos. Deja las manzanas caramelizadas a un lado para que se enfríen mientras preparas el relleno.", "Para el relleno, ponga la harina en un tazón grande. Con las puntas de los dedos, frote la mantequilla fría en la harina hasta que la mezcla se asemeje a pan rallado. Revuelva suavemente los ingredientes restantes hasta que estén bien combinados.", "Espolvoree la mezcla de la migaja uniformemente sobre el relleno de manzana. Hornee en el horno durante 30-35 minutos, o hasta que el relleno esté bien caliente y el crumble esté dorado por todas partes. Sirve con natillas o crema."]}]