[{"isVegetarian": false, "title": "Coffee and walnut cake", "url": "www_bbc_co_uk_food_recipes_coffee_and_walnut_cake_03763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_and_walnut_cake_03763_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened, plus extra for greasing                                                                     ", "100g/3½oz caster sugar                                                                                                                                ", "2 large free-range eggs", "100g/3½oz self-raising flour", "1 level tsp baking powder", "50g/1¾oz chopped walnuts", "1 tbsp coffee essence", "75g/2¾oz unsalted butter, softened", "225g/8oz icing sugar, sifted", "2 tsp milk", "2 tsp coffee essence", "8 walnut halves, to decorate"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Lightly butter two loose-bottomed 18cm/7in sandwich tins and line the bases with baking paper.", "Put the butter, sugar, eggs, flour, baking powder, walnuts and coffee essence in a large mixing bowl and beat together (using an electric hand whisk if you have one) until well combined and smooth.  ", "Divide the mixture evenly between the tins. Level the surface using a spatula or the back of a spoon. ", "Bake for 20–25 minutes, or until an inserted skewer comes out clean. Leave the cakes to cool in the tins for 5 minutes, then run a small palette knife or rounded butter knife around the edge of the tins and carefully turn the cakes out onto a wire rack. Peel off the paper and leave to cool completely.", "For the filling and topping, beat the butter and gradually add the icing sugar. Add the milk and coffee essence and beat until smooth.", "Choose the cake with the best top, then put the other cake top-down onto a serving plate and spread with half the coffee icing. Sandwich together with the other half. Ice the top of the cake and decorate with the walnut pieces to serve."]}, {"isVegetarian": true, "title": "Coffee cake with coffee buttercream, coffee glacé icing and candied walnuts", "url": "www_bbc_co_uk_food_recipes_coffee_cake_with_coffee_65414", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter, softened, plus extra for greasing the tins", "200g/7oz caster sugar", "4 medium free-range eggs", "3 tbsp coffee essence, such as Camp", "250g/9oz self-raising flour", "100g/3½oz unsalted butter", "200g/7oz icing sugar", "2 tsp coffee granules", "1 tbsp boiling water", "2 tsp coffee granules", "1 tbsp boiling water", "100g/3½oz icing sugar", "110g/4oz caster sugar", "18 walnut halves", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the coffee cake, preheat the oven to 180C/350F/Gas 4. Grease and line a 23cm/9in loose-bottomed cake tin.", "Place the butter and sugar in a large bowl and beat until light and fluffy.", "Gradually add the eggs, continually beating, then the coffee essence. Sieve in the flour and fold in.", "Pour into the prepared cake tin and level off with a palette knife.", "Bake for 20-25 minutes, or until golden-brown and risen.", "Remove from the tin and allow to cool on a cooling rack.", "For the coffee buttercream, place the softened butter in a bowl and mix with a hand-held electric mixer. Add the sifted icing sugar and beat together. Dissolve the coffee in the water and add to the buttercream and stir. Set aside.", "For the glacé icing, place the coffee and boiling water into a bowl to dissolve, then add the icing sugar and beat until smooth. Add a little more boiling water if needed until the mixture comes to a spreadable consistency.", "For the candied walnuts, place the sugar and 110ml/3½fl oz water into a saucepan and bring to a simmer. Add the walnuts and cook for a couple of minutes, or until just tender. Drain and place onto a large sheet of greaseproof paper. ", "Heat 2.5cm/1in of vegetable oil in a saucepan until just shimmering. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully add the candied walnuts to the oil and cook for 1-2 minutes, or until just golden-brown.", "Lift out and drain on a fresh sheet of greaseproof paper. Leave until cool.", "To assemble the cake, cut the cake in half horizontally. Spread the buttercream over one half of the cake and place the other half on top. Spread the glacé icing over the top and decorate with candied walnuts."]}, {"isVegetarian": true, "title": "Coffee éclairs", "url": "www_bbc_co_uk_food_recipes_coffee_clairs_66851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "75g/2¾oz plain flour", "2 medium free-range eggs", "230g/8oz fondant icing sugar", "2 tbsp espresso, cooled", "75g/2½oz desiccated coconut", "425ml/15fl oz double cream", "1 tbsp icing sugar, sifted", "½ tsp vanilla extract", "4 passion fruit, seeds only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/400F/Gas 6. Line a baking tray with non-stick baking parchment.", "For the éclairs, place 125ml/4fl oz water and the butter into a saucepan and gently melt the butter. Bring to a rolling boil for a minute.", "Remove from the heat and add the flour all at once, beating well until the mixture is smooth and comes away from the sides of the pan.", "Return to the heat for a minute or two to cook through.", "Remove from the heat again and add the eggs, one at a time - beating well between the addition of each egg - until smooth and glossy.", "Spoon the dough into a piping bag and pipe 5cm/2in long éclairs onto the lined baking tray and bake for 20 minutes, or until golden-brown. Remove from the oven and set aside to cool on a wire rack.", "Once cooled, make a hole in one end of the éclair.", "For the icing, mix half the icing sugar with the coffee in a small bowl. The mixture should have a spreadable consistency, so add more icing sugar if necessary.", "In another bowl, place the remaining fondant icing with two tablespoons of water and mix until combined.", "To finish, heat a small frying pan and toast the coconut until golden brown.", "Whip the cream with the icing sugar and vanilla extract until soft peaks form when the whisk is removed.", "Transfer the whipped cream into a piping bag fitted with a 1cm/½in plain nozzle and pipe into the éclairs. ", "Dip half of one side of the éclairs in the coffee icing and the other in the plain icing. Sprinkle with toasted coconut. Serve the coconut éclairs with the passion fruit seeds."]}, {"isVegetarian": true, "title": "Coffee, chocolate and sherry cake", "url": "www_bbc_co_uk_food_recipes_coffee_chocolate_and_px_77531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz butter", "125g/4½oz caster sugar", "2 free-range eggs", "1 tsp bicarbonate of soda", "1 tsp vanilla extract ", "225g/8oz self-raising flour", "200ml/7fl oz Pedro Ximénez sherry ", "100g/3½oz butter", "200g/7oz icing sugar", "2–3 tbsp coffee essence ", "100ml/3½fl oz double cream ", "100g/3½oz good-quality dark chocolate, minimum 70% cocoa solids, broken into pieces", "A selection of chocolates and confectionary, to decorate "], "serves": "Makes 1 x 20cm/8in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a deep 20cm/8in, springform cake tin. ", "Beat the butter and sugar together until light and creamy. Beat in the eggs, bicarbonate of soda and vanilla extract. Fold in half of the flour. Pour in the sherry and stir in the rest of the flour. ", "Pour the mixture into the prepared tin and bake for 30–40 minutes.  ", "Meanwhile, to make the coffee buttercream, beat the butter in a bowl until soft, then gradually beat in the icing sugar. Add the coffee essence and mix until smooth. ", "Allow the cake to cool in the tin for a few minutes, then turn out onto a wire rack and leave to cool completely. ", "Slice the cake horizontally into three layers. Spread half the buttercream onto the bottom layer and top with the second layer. Repeat with the remaining buttercream. ", "For the chocolate ganache, heat the cream and chocolate in a heavy-based pan. Remove the pan from the heat and whisk the mixture until smooth and thickened. Set aside to cool slightly.", "Ladle over the chocolate ganache and let it run down the sides of the cake. ", "Garnish with the chocolates and serve. "]}, {"isVegetarian": true, "title": "Coffee crème caramels", "url": "www_bbc_co_uk_food_recipes_coffee_crme_caramels_75585", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_crme_caramels_75585_16x9.jpg", "ingredients": ["1 tbsp instant coffee granules", "75g/2½oz caster sugar", "600ml/20fl oz full-fat milk", "3 free-range eggs", "3 free-range egg yolks", "125g/4½oz caster sugar"], "serves": "Makes 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the oven to 150C/300F/Gas 2. Have ready four ovenproof ramekins.", "Put the coffee, caster sugar and milk in a saucepan and bring gently up to simmering point, stirring occasionally to dissolve the coffee. Do not boil. Remove from the heat and set aside while you make the caramel.", "For the caramel, put the sugar and 50ml/2fl oz of water in a heavy based-pan. Heat gently until the sugar has dissolved, then bring to the boil. Boil for a few minutes, or until the syrup has turned to a dark golden-brown caramel.", "As soon as the caramel has reached the right colour, pour it into the ramekins. Take care because it will be extremely hot. Leave to set (but do not put it in the fridge).", "Beat the eggs and egg yolks together in a bowl. Gently pour on the coffee-flavoured milk and whisk until well combined. Strain into a jug. Pour this mixture into the ramekins. Put the ramekins in a large, deep oven tray. Pour hot water into the tray so that it comes three-quarters of the way up the ramekins. Cover the tray with foil and place in the oven. Bake for 40-45 minutes, or until the custards are just set but still have a bit of wobble.", "Remove from the oven dish and leave to cool completely, then refrigerate for 24 hours.", "To turn out, first run a thin-bladed knife around the outside of the custard then put a plate over the top and invert the ramekin so that the custard and its lovely caramel juices come out onto the dish. Serve straight away."]}, {"isVegetarian": true, "title": "Coffee granita", "url": "www_bbc_co_uk_food_recipes_coffee_granita_02612", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_granita_02612_16x9.jpg", "ingredients": ["600ml/1 pint strong, hot espresso coffee ", "120g/4oz caster sugar", "300ml/10fl oz double cream", "1 vanilla pod, split lengthway, seeds scraped out", "1 tbsp icing sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Put a shallow baking dish (about 1litre/1¾ pints capacity) into the freezer. ", "Stir and dissolve the sugar into the coffee over a low heat. Set aside to cool. ", "Pour the coffee mixture into the dish and freeze for 40 minutes. Check to see if there are any ice crystals forming around the edge. If there is, gently bring them into the liquid centre using a fork. Place the granita back into the freezer ", "Have another look again in about 20 minutes and repeat the same process as step 3. Keep doing this until the entire mixture is a mass of coffee crystals with no remaining liquid parts. Once this has been achieved, tip the granita into a plastic, lidded box and store in the freezer until needed. ", "Place the cream, vanilla and icing sugar in a large bowl. Add a handful of crushed ice and whip the mixture until a dropping consistency.", "Serve the granita in pre-chilled glasses with the whipped cream mixture."]}, {"isVegetarian": true, "title": "Coffee and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_coffeeandchocolatesa_9813", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz unrefined sugar", "570ml/1 pint water", "40 coffee beans ", "180g/6oz cocoa powder", "pinch of salt", "60g/2oz of the best quality bitter chocolate you can find"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Place the sugar in a pan over a medium heat. Brush the sides of the pan with a pastry brush dipped in a mug of cold water. Continue this process until the sugar caramelises. (You will probably end up using a third of the water). ", "Add the rest of the water, coffee beans, cocoa powder, salt and chocolate. ", "Bring to the boil. ", "Pass through a very fine sieve and allow to cool.", "Serve cold."]}, {"isVegetarian": true, "title": "Coffee walnut whips", "url": "www_bbc_co_uk_food_recipes_coffee_walnut_whips_36317", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_walnut_whips_36317_16x9.jpg", "ingredients": ["350g/12oz milk chocolate, chopped", "2 tbsp coffee essence ", "½ tbsp soft light brown sugar", "11 walnuts"], "serves": "Makes 11 walnut whips", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Set aside 50g/1¾oz of the chocolate for later, and temper the remaining chocolate. To temper, melt the milk chocolate in a bowl set over a pan of gently simmering water. Don’t let the bowl touch the water or the chocolate will burn and don’t let any water into the chocolate or the chocolate will seize. ", "Continue to heat the chocolate until it measures 42C/107F on a chocolate thermometer. Then take it off the heat and let it cool to 31C/88F. ", "Use a clean, grease-free brush or teaspoon to coat and line each of the fluted cups in the mould with the chocolate. You need to do this quickly or the chocolate will start to set and be too thick to work with. ", "Use a spatula to scrape away any chocolate from the top of the mould. Save any chocolate that you haven’t used to use again later.", "Put the moulds in the fridge to set for around 20 minutes.", "To make the filling, put the coffee essence in a measuring jug and add enough cold water to make it up to 50ml/2fl oz. Pour into a pan, add the sugar and bring to the boil. Simmer for one minute.", "Put the reserved 50g/1¾oz of milk chocolate in a bowl. Add the coffee liquid and stir to help the chocolate melt, then leave until cold. Leave it to thicken up in the fridge for an hour or so before filling the moulds.", "Take the moulds out of the fridge. Spoon the chocolate and coffee mixture into the moulds and leave to set overnight. ", "To seal the walnut whips, temper the remaining milk chocolate, using up any chocolate leftover from earlier. ", "Using a teaspoon, spoon the chocolate over the filling to cover. ", "Top each with a walnut. Chill for at least 30 minutes until set, then carefully upturn the mould onto a board to release the walnut whips.", "Serve after dinner with coffee. "]}, {"isVegetarian": true, "title": "Coffee Swiss roll with caramel and nut filling", "url": "www_bbc_co_uk_food_recipes_coffee_swiss_roll_with_63858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large free-range eggs", "300g/10½oz caster sugar, plus extra for dusting", "75ml/2½fl oz coffee essence", "100g/3½oz self-raising flour", "50g/1¾oz blanched almonds", "50g/1¾oz pistachio nuts", "50g/1¾oz blanched hazelnuts ", "300ml/10½fl oz double cream", "25g/1oz icing sugar", "50g/1¾oz dulce de leche", "8-10 marrons glacés"], "serves": "Makes 1 Swiss roll", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease and line a 33x23cm/13x9in Swiss roll tin with baking parchment.", "Whisk the eggs and 100g/3½oz of the sugar in a bowl until the mixture becomes light and leaves a trail when you remove the whisk from the bowl. This will take about 10-15 minutes. Whisk in the coffee essence.", "Sieve the flour into the egg mixture and carefully fold it in. Pour the mixture into the tin and give it a shake to level it, so that it spreads evenly.", "Bake for 8-10 minutes, or until the cake turns golden-brown. Then set aside to cool in the tin.", "Place the remaining 200g/7oz sugar in a frying pan set over a medium heat. Melt the sugar, without stirring, until it forms a golden-brown caramel. (CAUTION: melted sugar is very hot. Take care not to burn yourself.) Remove from the heat and stir in the nuts. Pour the praline onto a large sheet of baking parchment or silicon paper and set aside until completely cool and hard. ", "In a food processor, blend the praline to a coarse powder. Set aside until you are ready to assemble the Swiss roll.", "Tip the still warm Swiss roll out onto a clean tea towel. Starting at one of the longest edges, roll up the Swiss roll and then set aside to cool completely. ", "While the cake is cooling, prepare the filling. Pour the cream into a large bowl and add the sugar. Whisk until soft peaks form when the whisk is removed from the bowl. Add the dulce de leche and mix well.", "Lay a tea towel on the work surface and sprinkle the blended praline over the tea towel in an even layer. ", "Carefully unroll the Swiss roll onto the blended praline, then spread the caramel cream over the cooled sponge, leaving a 2cm/1in gap around the edge.", "Using the tea towel to help you, roll the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the tea towel. The blended praline should stick to the outside of the cake, but any patches can be filled by pressing any excess praline onto the sponge.", "Decorate the Swiss roll with the marrons glacées and serve in slices."]}, {"isVegetarian": true, "title": "Coffee panna cotta with doughnuts and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_coffee_panna_cotta_with_85926", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz double cream", "1 vanilla pod, seeds scraped out", "100g/3½oz caster sugar", "2-3 gelatine leaves, soaked in cold water for a few minutes", "350ml/12fl oz buttermilk", "50ml/2fl oz espresso coffee", "300ml/10fl oz milk", "500g/1lb 2oz strong flour, plus extra for dusting", "75g/2½oz caster sugar, plus extra for dusting", "5g table salt", "7g fast action dried yeast", "1 free-range egg, beaten", "50g/1¾oz softened butter", "vegetable oil, for deep frying", "175g/6oz plain chocolate, broken into pieces", "50g/1¾oz caster sugar", "2 tbsp crushed blanched hazelnuts", "2 tbsp crushed blanched almonds", "4 tbsp fresh mint leaves"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the coffee panna cotta, chill a large jug or bowl in the freezer.", "Heat the double cream, vanilla pod and seeds and sugar in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk and whisk until well combined.", "Pass the mixture through a fine sieve into the chilled jug, and then stir in the coffee.", "Return the jug to the fridge and whisk the mixture every five minutes until it begins to set. ", "Pour the mixture into dariole moulds or ramekins, and chill in the fridge for at least two hours, or until completely set.", "For the doughnuts, warm the milk gently in a saucepan. Mix the flour, sugar, salt and yeast in a free-standing mixer. Add the warm milk and egg and mix to a sticky dough. Using a paddle attachment, knead for about 5 minutes until smooth and elastic.", "With the mixer running, gradually add the softened butter a little at a time kneading in between each addition. This will take about 10 minutes.", "Flour a work surface and turn out the dough. Continue to knead until smooth, shiny and no longer sticky. Place the dough in a large bowl, cover and leave in a warm place to rise for 2 hours, or until doubled in size. Mould the dough into small balls and place on a lined baking tray and leave to rise again for 20 minutes.", "Heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 190C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the doughnuts into the fat and fry for 3-4 minutes until golden-brown. Drain on kitchen paper. Transfer to a plate and dust with caster sugar.", "For the chocolate sauce, melt the chocolate in a bowl set over a pan of simmering water (make sure the bottom of the bowl does not touch the water). ", "Heat the sugar in a pan with 100ml/3½fl oz water, stirring until the sugar dissolves. Bring to the boil. ", "Stir the sugar syrup into the melted chocolate until smooth and shiny. ", "To serve, place the base of the dariole moulds in boiling water to loosen the panna cotta. Place on a serving plate alongside the doughnuts and chocolate sauce. Garnish with the crushed nuts and mint."]}, {"isVegetarian": true, "title": "Coffee and walnut cake", "url": "www_bbc_co_uk_food_recipes_coffeeandwalnutcake_83909", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffeeandwalnutcake_83909_16x9.jpg", "ingredients": ["175g/6oz butter", "175g/6oz golden caster sugar", "3 large free-range eggs", "175g/6oz flour", "1 tsp baking powder", "2 tsp instant coffee granules", "65g/2¾oz walnut pieces", "600ml/1 pint double cream", "1 tbsp instant coffee powder, dissolved in 2 tbsp boiling water"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Line the base of two 20cm (8in) loose-bottomed sponge tins with baking parchment.", "Beat the butter and caster sugar until light, pale and fluffy. You could do this by hand, but it is far easier with an electric mixer.", "Crack the eggs into a bowl, break them up with a fork, then add them a little at a time to the butter and sugar, beating well after each addition.", "Combine the flour and baking powder and gently mix into the butter and sugar, either with a hand-mixer on a slow speed or by hand, with a large metal spoon.   ", "Dissolve the coffee granules in a tablespoon of boiling water, then stir into the mixture.", "Chop the walnuts and fold them in gently", "Divide the cake mixture between the two tins, smooth the top lightly and bake for 20 to 25 minutes - the cake should be springy to the touch and a skewer inserted inside should come out clean. ", "Transfer to a wire rack to cool.", "For the topping and filling, whip the double cream and add the coffee mixture. ", "Spread half the coffee cream over one of the cake halves and sandwich the cakes together. Smooth the remaining coffee cream over the top."]}, {"isVegetarian": true, "title": "Coffee and walnut cake", "url": "www_bbc_co_uk_food_recipes_coffeeandwalnutcake_87248", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffeeandwalnutcake_87248_16x9.jpg", "ingredients": ["225g/8oz unsalted butter, plus extra for greasing", "225g/8oz caster sugar", "4 free-range eggs", "50ml/1¾fl oz strong espresso coffee", "225g/8oz self-raising flour", "75g/2½oz walnuts", "125g/4½oz unsalted butter", "200g/7oz icing sugar", "50ml/2fl oz strong espresso coffee", "12 walnut halves, to decorate"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a bowl, beat the butter and sugar together until very light and pale.", "Add the eggs one at a time to the butter and sugar mixture, beating well to completely incorporate each egg before adding the next egg.", "Add the espresso to the mixture and stir well.", "Add the flour and walnuts and stir well to completely combine.", "Spoon the cake mixture into two lined and greased 20cm/8in cake tins.", "Transfer to the oven to bake 25-30 minutes, or until a skewer inserted into the centre of the cake comes out clean and the cake is golden-brown.", "Remove the cakes from the oven and leave to cool on a wire rack.", "For the buttercream topping, beat the butter and icing sugar together in a small bowl until pale and light. ", "Add the espresso and mix well.", "Spread the buttercream over the top of each cake, then place one cake on top of the other.", "Decorate the top of the cake with the walnut halves and serve in generous slices."]}, {"isVegetarian": true, "title": "Coffee mushrooms", "url": "www_bbc_co_uk_food_recipes_coffeemushrooms_68104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["570ml/1 pint good quality coffee ice cream, slightly softened ", "255g/9oz dark chocolate, roughly grated ", "cocoa powder and icing sugar, for dusting ", "110g/4oz butter softened", "140g/5oz icing sugar ", "110g/4oz plain flour ", "3 eggs, whites only", "1 tbsp instant coffee granules ", "2 tbsp caster sugar ", "120ml/4fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "To make the stalks of the mushrooms, take four large and four small dariole mounds or vodka shot glasses, and line them with cling film. Fill with the slightly softened ice cream and re-freeze until set hard again. ", "To make the tuiles, cream the butter and sugar together.  Slowly add the egg whites to the mix, then fold in the flour.  Using one large and one small round template (margarine tub lids - cut a circle out of the lid and place on a baking tray, lipped side up and spread the tuile mix over the hole with a palette knife, then lift the template off to leave a perfect circle) - you will need 4 of each size.  Bake in the preheated oven for 2-3 minutes until lightly coloured at the edges.  Remove and place each disc of tuile over an egg cup or similar until cold.  The soft tuile will fold over into mushroom cap shapes and become crisp.", "Dissolving together the coffee and sugar with a very little boiling water to make a syrup. Stir the cooled coffee syrup into the double cream, making a coffee sauce. ", "To serve, scatter the gratings in a circle around the edges of four serving plates. Spoon some of the coffee sauce into the centre. Unmould the ice cream, removing the cling film, and stand the stalks upright on the pool of sauce, one of each size on each plate. ", "To make the mushroom caps turn the tuiles dome side up. Using a small sieve, dust the tuile domes with cocoa powder and icing sugar. Place the small caps on the small stalks and the large caps on the large stalks. Serve at once."]}, {"isVegetarian": false, "title": "Coffee parfait", "url": "www_bbc_co_uk_food_recipes_coffeeparfait_93225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range egg yolks", "100g/3½oz caster sugar", "250ml/9fl oz sweet, fruity dessert wine, such as Monbazillac or Beaume de Venice", "small pinch cayenne pepper", "1-2 tsp freshly squeezed lemon juice", "200ml/7fl oz whipping cream, whisked until soft peaks form when the whisk is removed", "50ml/2fl oz coffee essence or cooled strong coffee", "caramel sauce (optional)", "vanilla cream (optional)", "chopped roasted nuts", "cocoa powder, for dusting"], "serves": "Makes 1.4litres/2 pints 10fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Whisk the egg yolks, sugar and dessert wine together in a large heatproof bowl until pale and fluffy.", "Set the bowl over a pan of barely simmering water and continue to whisk for 3-4 minutes, or until the mixture is pale and has thickened (the temperature of the mixture should reach about 78-80C/175F).", "Remove from the heat, set the bowl in a larger bowl of iced water and whisk again until cool.", "Whisk in the cayenne pepper and lemon juice. Set aside until completely cold.", "Whisk one-third of the whipped cream into the cooled sabayon mixture, then carefully fold in the remaining cream until just combined.", "Fold the coffee essence carefully into the sabayon until combined.", "Spoon the mixture into a 1.2kg/2lb 10¼oz loaf tin, levelling the top with a palette knife. Chill in the freezer for at least 12 hours, or until solid.", "When ready to serve, remove the coffee parfait from the freezer and dip the loaf tin into hot water to loosen the parfait from the tin. Run a blunt knife around the parfait, then turn it out onto a long rectangular plate.", "To serve, slice the coffee parfait and serve with caramel sauce or vanilla cream, if using. Sprinkle with chopped roasted nuts and dust with cocoa powder."]}, {"isVegetarian": false, "title": "Colcannon", "url": "www_bbc_co_uk_food_recipes_colcannon_13802", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/colcannon_13802_16x9.jpg", "ingredients": ["500g/1lb2oz floury potatoes, cooked", "250g/9oz cabbage, shredded and lightly steamed", "2 tbsp cream (optional)", "salt and black pepper", "1 large or 2 small onions, sliced thinly ", "a little bacon fat, beef dripping or other oil, for frying"], "serves": "Serves 2 or 4 as a side dish", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sieve or mash the potatoes and mix with the cabbage and cream. Season well with salt and pepper.", "Fry the onion in the fat over a moderate heat until it is soft and beginning to brown.", "Using a spatula, press half the potato and cabbage mixture in an even layer on to the onion and fry for 4-5 minutes until it is well browned and crispy underneath.", "Cut the mixture into 4 quarters with the spatula or palette knife and turn them over carefully so that the crispy bit is uppermost. Press the remaining potato and cabbage mixture on to the first layer and after a few more minutes, cut and turn again.", "When the bottom is again browned, you will have a crispy top too, a crispy bottom, and a crispy layer in the middle. "]}, {"isVegetarian": true, "title": "Cointreau cream", "url": "www_bbc_co_uk_food_recipes_cointreaucream_70906", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz Cointreau", "1 orange, grated zest only", "2 tbsp freshly squeezed orange juice", "1 tsp sugar", "300ml/10fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the Cointreau in a small saucepan and bring to the boil. ", "Add in the orange zest and cook briskly until the Cointreau has reduced by half. ", "Stir in the orange juice, sugar and cream. Bring to the boil, reduce the heat and simmer for 2-3 minutes."]}, {"isVegetarian": false, "title": "Cold chicken and pepper risotto (risotto freddo di pollo)", "url": "www_bbc_co_uk_food_recipes_coldchickenandpepper_70263", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz Italian easy cook long grain rice", "2 medium breasts of chicken", "2 whole yellow peppers", "1 whole red pepper", "2 lemons ", "8 tbsp Italian extra virgin olive oil", "flatleaf parsley, chopped", "lettuce leave", "handful walnuts", "salt and freshly ground pepper to taste"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Boil the rice and allow to cool.", "Grill the chicken on each side until cooked and allow to cool. Slice into ½cm/¼in strips.", "Roast the peppers in the oven for approximately 20 minutes. Once cooled, peel the skin, take out the seeds and slice them into strips of approximately ½cm/¼in each.", "In a large bowl mix the chicken and peppers together.  Add the walnuts and salt and pepper to taste. Squeeze the two whole lemons and extra virgin and stir well. Lastly add the rice and allow to rest for 5 minutes before serving.", "Place a large lettuce leaf on a plate and add the risotto mixture in the middle, decorate with some parsley. Serve immediately."]}, {"isVegetarian": false, "title": "Cold lobster salad with tarragon vinaigrette", "url": "www_bbc_co_uk_food_recipes_cold_lobster_salad_with_50725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp Dijon mustard", "1 lemon, juice only", "8 tbsp olive oil ", "2 sprigs tarragon", "1 garlic clove, peeled ", "salt and freshly ground black pepper", "2 x 600g/1lb 5oz cooked lobsters", "1 bulb fennel, trimmed and finely chopped", "2 sticks celery, finely chopped", "1 onion, finely chopped", "lobster shells (from above)", "150ml/5fl oz white wine", "300ml/10fl oz chicken stock or water", "200ml/7fl oz cream", "8 cooked new potatoes, cooled and peeled", "4 Baby Gem leaves", "a mix of cress or micro leaves", "2 tomatoes, peeled and seeds removed, diced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the vinaigrette, whisk the mustard and lemon juice in a bowl.  Gradually whisk in 6 tablespoons of the olive oil.  Add the tarragon and garlic clove and leave to infuse.  Season, to taste, with salt and freshly ground black pepper. ", "Pick the meat from the lobsters and set aside in a bowl in the fridge, reserving the shells. ", "Heat a saucepan over a medium heat.  Add the remaining two tablespoons of  the oil, chopped fennel, celery and onion and fry until softened. Add the lobster shells and fry for 2-3 minutes.", "Add the white wine and bring to a simmer. Add the stock or water, return to a simmer for an hour, then strain the stock through a fine sieve. ", "Place the liquid back into a saucepan and add the cream.  Simmer for 30 minutes, or until the volume of the liquid has reduced by half and thickened. Season with salt and pepper and leave to cool. Chill the lobster cream in the fridge until ready to serve.", "Slice the new potatoes into thin rounds. Arrange the rounds in a chefs’ ring onto each serving plate to create a circular base. Remove the chefs’ ring.", "Place a Baby Gem leaf onto the potatoes. Lightly dress the lobster meat with a little of the tarragon vinaigrette, then spoon into the Baby Gem. Place a small handful of mixed cress on top of the lobster. Place the diced tomato around the edge of the plate then dress with a little of the cold lobster cream."]}, {"isVegetarian": true, "title": "Coleslaw cucumber sticks", "url": "www_bbc_co_uk_food_recipes_coleslaw_cucumber_sticks_70231", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ cucumber, sliced in half lengthways, seeds scraped out using a teaspoon", "20g/¾oz apple, grated ", "20g/¾oz carrot, grated ", "20g/¾oz cooked beetroot, grated", "30g/1¼oz cream cheese", "15g/½oz raisins"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the cucumber into four pieces.", "Mix the apple, carrot and beetroot together in a mixing bowl. Stir in the cream cheese until well combined.", "Fill each piece of cucumber with a little of the cream cheese mixture.", "Sprinkle each filled piece of cucumber with raisins. Wrap separately in cling film and chill in the fridge until needed."]}, {"isVegetarian": true, "title": "Coleslaw", "url": "www_bbc_co_uk_food_recipes_coleslaw_68108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coleslaw_68108_16x9.jpg", "ingredients": ["450g/1lb white cabbage", "1 small onion (optional)", "1 small carrot (optional) ", "30g/1oz sugar", "a pinch of cayenne or chilli powder ", "30g/1oz plain flour", "2 eggs, yolks only", "a good knob of butter ", "175ml/6fl oz whole milk", "55ml/2fl oz red wine vinegar ", "1-2 tsp English mustard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grate or shred the cabbage and carrots and onions (if you're using them). Put them in a big bowl and set aside.", "Mix the sugar, cayenne and flour in a bowl that will go into your double boiler. Season well with salt and pepper. Now whisk in all remaining ingredients except the mustard, in the order in which they are listed. In the meantime, heat the water in the bottom of the double boiler. ", "Put the bowl over the heat and start whisking. Do not stop for more than a few moments while the mixture is cooking. Cooking will take something like 15 minutes, and you will know that the sauce is done when it's thick enough to coat the back of a spoon. Strain into a clean bowl to eliminate any lumps, and whisk in the mustard. (Use the larger amount if you want a hotter result, the smaller if you want just a mustardy accent.)", "Toss the slaw with half the dressing and toss. If it needs more, add it in small doses till you've reached the desired consistency. Serve immediately or leave, covered, in the fridge, for 1-2 days with 1 or 2 tosses every day."]}, {"isVegetarian": false, "title": "Coley with tarragon sauce vierge", "url": "www_bbc_co_uk_food_recipes_coleywithtarragonsau_90925", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coleywithtarragonsau_90925_16x9.jpg", "ingredients": ["120ml/4fl oz extra virgin olive oil", "1 lemon, juice only", "2 tomatoes, skins and seeds removed, flesh diced", "1 shallot, peeled, finely chopped", "1 small garlic clove, peeled, finely chopped", "3 tbsp chopped fresh tarragon", "4 x 175g/6oz coley fillets", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil", "½ lemon, juice only", "lightly dressed green salad, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce vierge, pour the olive oil in a non-reactive pan. Whisk in the lemon juice until well-combined. Add the chopped tomatoes, shallot and garlic.", "Heat the pan over a medium heat until the sauce vierge mixture is just warmed through. Add the tarragon and season, to taste, with salt and freshly ground black pepper. Set aside.", "For the coley, season the coley fillet with salt and freshly ground black pepper.", "Heat the oil in a non-reactive frying pan over a medium heat. Add the seasoned coley fillets, skin-side down, and fry for 1-2 minutes until golden-brown.", "Turn the fillets over using a fish slice and cook for a further 1-2 minutes, or until just cooked through.", "Drizzle the lemon juice over the fish fillets and remove from the heat. ", "To serve, arrange the coley fillets into the centre of a serving plate. Drizzle over the tarragon sauce vierge (whisk the tarragon sauce vierge again before serving until well combined). Spoon the green salad alongside."]}, {"isVegetarian": false, "title": "Colonel Merrett's bucket of chicken", "url": "www_bbc_co_uk_food_recipes_colonelmerrettsbucke_91985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs", "4 chicken drumsticks", "garlic head (optional)", "fresh thyme sprigs (optional)", "100g/3½oz flour", "1 tsp ground cumin", "1 tsp cayenne pepper", "1 tsp celery salt", "½ tsp English mustard powder", "½ tsp salt", "300ml/10½fl oz milk", "1 litre/1¾ pints vegetable oil", "4 potatoes, baked until tender, then chilled in the fridge overnight", "½ Savoy cabbage, core removed, finely shredded", "1 large gherkin, trimmed, grated", "2 carrots, trimmed, peeled, grated", "1 red onion, peeled, cut in half, finely sliced", "100g/3½oz ready-made mayonnaise"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the chicken thighs and drumsticks, the head of garlic (if using) and thyme sprigs (if using) into a large pan and cover with cold water. ", "Bring the water to the boil, then reduce the heat until the water is simmering. Continue to simmer for 25-30 minutes, or until the chicken pieces are cooked through. ", "Remove the pan from the heat and set aside. When the chicken has cooled, in the stock, chill, covered, in the fridge until needed (but no longer than overnight). ", "In a bowl, mix together the flour, ground cumin, cayenne pepper, celery salt, mustard powder and salt until well combined.", "Remove the chilled chicken pieces from the stock using tongs and pat dry with kitchen paper. Remove the skin if desired. (The remaining cooking liquid can be reserved in the fridge for up to three days and used as stock in another recipe. Alternatively, it can be frozen until needed.)", "Dredge the chicken pieces in the spiced flour until coated. ", "Pour the milk into a bowl and dip each floured chicken piece into it until covered. ", "Dredge the chicken pieces in the spiced flour for a second time. (NB: Double-coating the chicken pieces will make them extra crisp.)", "Pour the vegetable oil into a large pan until it reaches 10cm/4in up the sides of the pan. (CAUTION: Do not over-fill the pan - the pan should only be half full with oil. Hot oil can be dangerous. Do not leave unattended.)", "Heat the oil to 170C (use a cooking thermometer to test the temperature - alternatively, heat the oil in a deep fat fryer). When a breadcrumb dropped into the oil sizzles and turns golden-brown, gently lower the chicken pieces, in batches, into the hot oil using a slotted spoon. ", "Fry for 4-5 minutes, or until crisp, golden-brown and completely cooked through. Remove the chicken pieces from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. ", "Repeat the process with the remaining chicken pieces. ", "Cut the chilled baked potatoes into wedges, pat dry with kitchen paper, then lower them, in batches, into the hot oil. Fry for 2-3 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. ", "Repeat the process with the remaining potato wedges. ", "Meanwhile, in a bowl, mix together all of the vegetables and the mayonnaise until the mixture is well combined and resembles coleslaw.", "Serve immediately."]}, {"isVegetarian": false, "title": "Comforting cottage pie", "url": "www_bbc_co_uk_food_recipes_comfortingcottagepie_14505", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/comfortingcottagepie_14505_16x9.jpg", "ingredients": ["1 tbsp oil ", "1 large onion chopped ", "2 medium carrots, chopped ", "560g/1¼ lb beef mince ", "400g/14oz can tomatoes ", "290ml/10fl oz beef stock ", "1 bay leaf ", "fresh thyme leaves from 1 sprig ", "2 tbsp tomato purée ", "salt and freshly ground black pepper ", "750g/1½ lb potatoes, peeled and chopped ", "225g/8oz parsnips, peeled and chopped ", "2 tsp creamed horseradish ", "75g/2½oz butter ", "55ml/2fl oz milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Heat the oil in a large pan. Add the onion and carrot and cook over a medium heat for five minutes until soft. ", "Add the minced beef and cook for three minutes to brown. ", "Add the tomatoes, purée, beef stock, bay leaf and thyme. ", "Cover and simmer for 30 minutes. Season. ", "Meanwhile, to make the topping, boil the potatoes and parsnips in water until soft. Drain and mash with the butter and milk. Stir in the horseradish and season with salt and pepper. ", "Spoon the meat into an ovenproof dish. Top with the mash and bake for 30 minutes until golden brown."]}, {"isVegetarian": true, "title": "Compôte of glazed shallots", "url": "www_bbc_co_uk_food_recipes_compoteofglazedshall_67193", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1½lb, approximately 24 small, even-sized shallots, peeled and left whole (ones that split into twins count as 2)", "55ml/2fl oz red wine vinegar", "400ml/14fl oz dry red wine", "1 tsp sugar", "salt"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Use a wide, shallow saucepan which will take the shallots in one layer, then simply place all the above ingredients except the sugar in it and bring everything up to simmering point. Then turn the heat down to its lowest setting and let the shallots simmer (just a few bubbles breaking the surface) for 1-1¼ hours. Turn the shallots over at half-time, and 10 minutes before the end of the cooking time sprinkle in the sugar. You should end up with tender shallots glistening with a lovely glaze. If your heat source is not low enough, you may need to use a diffuser. If it's more convenient you can cook the shallots in advance, and gently re-heat them before serving."]}, {"isVegetarian": false, "title": "Warm turkey potato salad with anchovies", "url": "www_bbc_co_uk_food_recipes_coldturkeywithpotato_14226", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["leftover turkey, chopped", "new (waxy) potatoes, ideally Pink Fir Apple or Ratte", "½-1 small can anchovies, chopped roughly (according to the amount of turkey you have and how much you like anchovies)", "½ clove garlic, crushed to a purée with a fork", "few spring onions, or 1 small red onion, sliced thinly", "olive oil", "lemon juice", "fresh parsley"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the anchovies with the garlic, 1 tbsp of olive oil and a squeeze of lemon.", "Toss this mixture with the turkey and onion and leave to macerate while you boil some new potatoes until tender.", "Slice the potatoes when still warm and toss immediately with the turkey and some chopped fresh parsley leaves."]}]