[{"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "100g / 3½oz de azúcar glasé", "100 g / 3½ oz de mantequilla, en cubos", "1 huevo de gallinas camperas", "Pasta de almendra 375g / 13oz o mazapán", "2 x 400 g / 14 oz latas de albaricoques a la mitad en jugo natural", "azúcar en polvo", "crema fresca de crema única"], "method": ["Para los pasteles ponga la harina, el azúcar glas y la mantequilla en un procesador de alimentos. Mezcle hasta que se asemeje a migas de pan. Agregue el huevo y mezcle hasta que la mezcla se mantenga unida. Incline sobre una superficie de trabajo enharinada y junte la masa en una bola. Envuelva con film transparente y deje enfriar en la nevera durante aproximadamente 15 minutos.", "Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja para hornear en el estante del medio para calentar. Alinee la base y los lados de una lata acanalada profunda de 23 cm / 9 pulg.", "Tome dos tercios de la masa fría de la nevera. Estirarlo finamente para hacer un círculo lo suficientemente grande como para alinear la base y los lados de la lata. Use un rodillo para levantar la masa en la lata.", "Use una bola pequeña de masa sobrante para presionar la masa enrollada en la base y los lados de la lata acanalada (esto ayudará a evitar que se formen agujeros en la masa). Asegúrese de que la lata esté completamente forrada, sin orificios.", "Rallar gruesas o picar finamente la pasta de almendras o el mazapán y espolvorear sobre la base de la tarta", "Escurra bien los albaricoques y seque con papel de cocina. Coloque los albaricoques sobre la base de la tarta cortada hacia abajo.", "Estirar la masa restante para formar la tapa. Humedece el borde de la base de pastelería en la lata. Levante la tapa de la repostería sobre la parte superior de la fruta y presione las dos capas de masa juntas alrededor del borde de la lata, aplicando un parche en los bordes si es necesario.", "Coloque la tarta en la bandeja de hornear precalentada y hornee en el centro del horno durante aproximadamente 30-35 minutos, o hasta que se dore.", "Para servir, espolvorear con azúcar glas y servir con crema fresca o crema."], "url": "www_bbc_co_uk_food_recipes_wobbly_apricot_tart_20144", "title": "Tarta tambaleante de albaricoque", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wobbly_apricot_tart_20144_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de vino tinto", "225g / 8oz de sal", "1 cabeza de ajo, cortada por la mitad", "150g / 5½oz de zanahorias picadas", "200g / 7oz de cebollas picadas", "2 ramitas de tomillo", "2 hojas de laurel", "1 ramita de romero", "20 granos de pimienta negra", "Pechuga de pavo sin piel, 400 g / 14 oz, sin nervios", "6 g de pimienta negra", "8g semillas de cilantro", "8 g de semillas de mostaza", "2g semillas de comino", "5 g de semillas de hinojo", "8g de sal de mar copos", "75g / 2½oz de sal", "Bayas de saúco verdes 500g / 1lb 2oz", "Vinagre balsámico blanco 400ml / 14fl oz", "40 g / 1½ oz de sal", "250 g / 9 oz de yemas de ajo silvestre", "3 puerros", "450 g / 1 libra de leche de búfala", "Crema doble de 80 g / 3 oz", "50 g / 1¾oz de leche de búfalo seca en polvo (disponible en línea en proveedores especializados)", "1.8 C si-si", "6 patatas Witchill, aproximadamente 40 g / 1½ oz cada una, restregadas", "50 g / 1¾oz de mantequilla sin sal", "4 g de ceniza de puerro (desde arriba)", "50g / 1¾oz de grasa de pato", "600 g / 1 libra de cebollas de 5 oz, finamente rebanadas", "30g / 1oz de mantequilla sin sal", "12 cebolletas cortadas a lápiz, recortadas", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida", "Bayas de saúco verdes en escabeche de 10g / ¼oz (desde arriba)", "Brotes de ajo salados 10g / ¼ oz (desde arriba)", "pamplina"], "method": ["Para la salmuera, combine todos los ingredientes, excepto el pavo, en una olla grande con 1 litro / 1¾ pintas de agua y deje que hierva. Cocine por cinco minutos. Retirar del fuego y dejar enfriar. Coloque el pavo en la salmuera, cubra y deje en la salmuera en el refrigerador durante 4-5 días.", "Para el recubrimiento de pavo, tueste todos los ingredientes, aparte de la sal marina, en una sartén seca hasta que las semillas comiencen a reventar y la mezcla huele a aromática. Retirar del fuego y dejar enfriar, luego moler en una licuadora, o en el molinillo de especias o en el molinillo de café limpio. Mezcle con la sal y guárdelo en un frasco sellado hasta que lo necesite.", "Para el prosciutto de pavo, escurra el pavo, enjuague brevemente y seque con un paño limpio. Enrolla el pavo en la mezcla de revestimiento especiado y luego enróllalo en una pieza de muselina. Ate ambos extremos con una cuerda, haciendo un lazo en un extremo. Cuelgue y deje secar al aire durante 1-2 semanas en un lugar fresco y aireado. Cuando sea necesario, retire la tela y corte lo más finamente posible. Necesitará 4-5 rebanadas por porción.", "Para las bayas de saúco verdes en escabeche, ponga la sal en 350ml / 12fl de agua en una cacerola mediana y lleve a ebullición para disolver la sal. Coloque a un lado y se enfríe.", "Revise las bayas de saúco en busca de cualquier error, luego coloque las bayas en un recipiente esterilizado que tenga una tapa ajustada. Vierta en la salmuera. Cubra el recipiente y manténgalo en un lugar fresco o en la nevera durante 2-3 semanas. Vigila las bayas, no quieres que se marchiten. Si empiezan a verse un poco arrugadas, escurra y enjuague rápidamente con agua corriente fría.", "Una vez que haya terminado el período de salado, drene la salmuera de las bayas y colóquelas en un recipiente limpio, esterilizado y tibio. Haga hervir el vinagre y luego vierta las bayas para cubrirlas por completo. Cubra inmediatamente con una tapa ajustada y deje que se enfríe. Guarde en el refrigerador. (Pueden almacenarse durante 6 a 8 meses).", "Para las yemas de ajo silvestre saladas, ponga la sal en 200 ml / 7 fl oz de agua en una olla pequeña y deje que hierva. Retirar del fuego y dejar enfriar.", "Asegúrese de que las yemas de ajo estén libres de tallos, luego enjuague bien. Colóquelos en un recipiente esterilizado, vierta sobre la solución de salmuera y cubra. Mantenga en un lugar fresco y oscuro durante 2-3 semanas antes de usar. Si desea mantenerlos más tiempo que esto, drene los brotes, coloque en otro recipiente esterilizado y cubra con aceite de oliva. Guárdelo en la nevera hasta que lo necesite.", "Para la ceniza de puerro, coloque una olla grande de agua con sal sobre el fuego y deje que hierva. Mientras tanto, corte los puerros por la mitad a lo largo, separe las capas y lávelas bien, quitando toda la arena. Desagüe. Escalde los puerros en agua hirviendo, luego escurra y refresque. Coloque sobre un paño para secar.", "Extienda el lote de puerros, en una sola capa, en una bandeja para hornear y ase a la parrilla hasta que estén negros y secos. Repita hasta que todas las capas de puerro hayan sido asadas. Coloque los puerros ennegrecidos y secos en una licuadora, o un molinillo de especias limpio o un molinillo de café, y mezcle hasta obtener un polvo. Pase el polvo a través de un tamiz fino, para terminar con un polvo fino uniforme sin grandes pedazos en él. Almacene en un recipiente hermético hasta que lo necesite (hasta un mes).", "Para la gelatina de leche de búfala, coloque todos los ingredientes en una cacerola de tamaño mediano y mezcle, luego déjelos reposar durante cinco minutos. Calentar la mezcla, batiendo de vez en cuando, y hervir durante dos minutos. Temporada. Cuele a través de un fino chino en una bandeja de acero inoxidable, de aproximadamente 15cmx3cmx½cm. Deje que se enfríe, luego cubra y deje en la nevera durante aproximadamente cuatro horas, hasta que se endurezca. Retire de la nevera 30 minutos antes de que sea necesario.", "Para las papas Witchill, ponga las papas en una olla grande, simplemente cúbralas con agua y agregue un poco de sal. Llevar a ebullición, luego cocine a fuego lento durante 10-15 minutos, o hasta que estén tiernos. Escurrir y dejar enfriar. Cuando sea necesario, corte cada patata en cuatro rebanadas iguales. Caliente la mantequilla en una sartén mediana, agregue las papas y revuelva en la mantequilla, luego agregue la ceniza de puerro. Gire las papas en la ceniza y la mantequilla hasta que estén cubiertas. Sazonar y mantener caliente hasta que sea necesario.", "Para el puré de cebolla caramelizada, caliente la grasa de pato en una olla grande, agregue las cebollas y revuelva bien, luego cubra con una tapa. Cocine durante unos cinco minutos, revolviendo de vez en cuando, hasta que las cebollas colapsen y se vuelvan translúcidas. Retire la tapa y cocine hasta que las cebollas tengan un delicioso color dorado oscuro, revolviendo bien para evitar que se enganchen. Transfiera las cebollas a una licuadora y mezcle hasta que quede suave. Agregue la mantequilla y mezcle de nuevo. Retire de la licuadora a una cacerola pequeña y sazone. Mantenga caliente hasta que sea necesario.", "Para las cebolletas, calienta una sartén grande. Mientras se está calentando, mezcle las cebolletas en el aceite y condimente. Colóquelos en la sartén y siga girando hasta que estén marchitos, dorados y cocidos.", "Para servir, haga un frotis de puré de cebolla en el centro de cada plato. Espolvorear con bayas de saúco verdes y brotes de ajo. Usando una cucharilla, coloque cuatro cucharadas de jalea de leche de búfalo en cada lugar, luego agregue las cebolletas. Ahora, agregue las papas, cuatro rebanadas por plato. Coloque 4-5 rebanadas de jamón de pavo en cada plato, doblándolas un poco. Finalmente, agregue la pamplina y espolvoree una banda de ceniza de puerro sobre el centro del plato."], "url": "www_bbc_co_uk_food_recipes_witchill_potatoes_56219", "title": "Patatas de Witchill, puré de cebolla caramelizada, leche de búfala y jamón de pavo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos largos, sin semillas, picados", "30g / 1oz de ajo triturado", "100 g / 3½ oz de jengibre fresco, cortado en cubitos", "50ml / 2fl oz de vinagre de vino de arroz", "50 g / 1 oz de azúcar en polvo", "2 cucharaditas de sal marina", "50g / 1¾oz sambal oelek", "2kg / 4lb 8oz de cangrejo real entero, cocido, carne blanca y marrón extraída", "puñado de hojas de curry", "aceite vegetal", "100ml / 3½fl oz de salsa de pescado", "pimienta negra recién molida", "2 chiles rojos largos, en juliana", "2 cebollas tiernas, en juliana", "puñado de cilantro, hojas recogidas", "puñado de hojas de menta fresca", "albahaca tailandesa", "50g / 1¾oz de chalotes fritos"], "method": ["En una licuadora, mezcle el chile, el ajo y la mitad del jengibre y mezcle hasta obtener una pasta. Agregue el vinagre de vino de arroz, el azúcar y la sal. Mezcle nuevamente y ajuste el aderezo si es necesario.", "Calentar un poco de aceite vegetal en un wok y sofreír el sambal oelek hasta que esté fragante. Agregue el jengibre restante y la carne de cangrejo. Mezcle la mayor parte de la pasta de chile, manteniendo un poco de vuelta para el final. Agregue las hojas de curry. Cubra con una tapa o un pedazo de papel de aluminio y vapor durante 5 minutos.", "Sazone al gusto con salsa de pescado y pimienta negra. Agregue la mitad de la guarnición y mezcle para liberar todos los aromas.", "Para servir, transfiéralo a un tazón y espolvorea con la pasta de chile restante y espárzala con la guarnición restante."], "url": "www_bbc_co_uk_food_recipes_wok-fried_singapore_32489", "title": "Cangrejo al estilo de Singapur frito al wok", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de venado tierna de 300g / 10½oz", "1 cucharada de vino de arroz Shaoxing", "2 cucharadas de harina de maíz", "1 cucharada de salsa de pescado", "Una pizca de sal marina", "pizca de pimienta negra molida", "pizca de azúcar en polvo", "1 cucharada de aceite vegetal", "1 lima, solo jugo", "3 dientes de ajo, pelados", "8 chalotes tailandeses", "2 chiles rojos o amarillos pequeños, sin semillas, picados", "4 chiles de cayena, sin semillas, picados", "2,5 cm / 1 en pieza galangal, pelado y aproximadamente picado (o pasta comprada en la tienda está bien)", "1 cm / ½ en pieza de cúrcuma fresca", "1 palo de limoncillo, hojas externas eliminadas, magulladas, finamente cortadas", "2 cucharadas de azúcar de palma", "1 cucharada de pasta de camarones", "Una pizca de sal marina", "¼ cucharadita de pimienta blanca", "2 cucharadas de aceite vegetal", "2 berenjenas púrpuras medianas, cortadas en 2cm / ¾ in", "500ml / 18fl oz de caldo de pollo", "2 hojas de lima Kaffir, espina quitada, triturada", "1 cucharada de salsa de pescado", "Leche de coco de la lata 400ml / 14fl oz", "200g / 7oz de judías verdes, lavadas, cortadas en rodajas de 1 cm / ½ en rodajas", "200 ml / 7 fl oz de agua", "350ml / 12fl oz de caldo de pollo", "300g / 10½oz de arroz jazmín tailandés, lavado bien", "1 palo de limon, magullado y rebanado", "1 hoja de lima kaffir", "1-2 chalotes tailandeses pequeños, pelados y finamente cortados en anillos", "1 cucharada de salsa de pescado", "3 cucharadas de jugo de lima", "1 cucharada de azúcar de palma", "400g / 14oz de chiles", "5 dientes de ajo, finamente picados", "50g / 1¾oz de jengibre fresco de raíz, pelado y finamente rallado", "2 tallos de hierba de limón, cáscara externa eliminada, magullada y finamente cortada", "100ml / 3½fl oz de vinagre de arroz", "5 cucharaditas de azúcar en polvo", "3 pizcas grandes de sal", "1 cucharada de ralladura de lima finamente rallada", "hojas de micro cilantro", "Chalotes fritos crujientes (opcional)", "1 hoja de plátano fresca", "1 hoja de bambú fresca", "rodajas de limón"], "method": ["Para hacer los chalotes tailandeses encurtidos, pele y corte la chalota y agregue a un tazón. Agregue la salsa de pescado, el jugo de lima y el azúcar de palma, cúbralo con una película adhesiva y déjelo en la nevera.", "Si prepara el sake oelek, mezcle el ajo, el jengibre, el chile y la hierba de limón y el vinagre en un procesador de alimentos o una mano de mortero hasta que se forme una pasta.", "Incline la pasta en un wok con el vinagre y deje que hierva. Agregue el azúcar y revuelva hasta que se disuelva. Sazone con sal y ralladura de limón. Poner aceite en la cuchara, enfriar y colocar en recipientes.", "Para hacer la pasta de curry de la jungla, coloque todos los ingredientes en un procesador de alimentos y licuadora hasta obtener una pasta áspera.", "Para hacer el curry, caliente un wok a fuego alto. Agregue el aceite vegetal, toda la pasta de curry y cocine hasta que tenga una pasta seca. Agregue las berenjenas y fría por unos minutos, cubriendo bien las berenjenas con la pasta. Agregue las hojas de lima, la salsa de pescado y el caldo de pollo y deje que hierva.", "Agregue la leche de coco y reduzca a fuego lento durante 20 minutos, hasta que las berenjenas estén muy suaves y el curry se espese. Agregue los frijoles franceses durante los últimos 3 minutos del tiempo de cocción.", "Cortar el venado en rodajas de ½ cm, sazonar con sal y pimienta y espolvorear con harina de maíz.", "Caliente un wok a fuego alto y agregue el aceite vegetal. Agregue las tiras de venado y espere entre 10 y 15 segundos en un lado, antes de voltear para dorar en el otro lado.", "Vierta el vino de arroz Shaohsing para desglasar la sartén y sazone con una salsa de pescado mezclada con azúcar y jugo de lima.", "Método para la hierba de limón y el arroz jazmín infundido con hojas de lima?", "Sirva la carne de venado con el curry de la jungla de berenjena y con un lado de hierba de limón y arroz infundido con lima, sambal oelek y chalotes bebé tailandeses encurtidos, cuña de lima, cilantro micro y chalotes fritos crujientes, si los usa."], "url": "www_bbc_co_uk_food_recipes_wok-fried_venison_and_21951", "title": "Venado y jengibre al curry con limón arroz tailandés", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de rape, sin membrana", "sal y pimienta blanca molida", "3 cucharadas de aceite de cacahuete", "4 dientes de ajo, finamente picados", "Jengibre fresco de raíz de 2.5cm / 1in, pelado, finamente picado", "1 guindilla roja, sin semillas, carne picada finamente", "1 cucharada de vino de arroz Shaoxing", "4-5 cucharadas de salsa de soja ligera", "2 cucharadas de aceite de sésamo tostado", "2 cebollas de primavera, cortadas en tiras finas (juliana)", "1 cucharada de cilantro fresco picado", "arroz al vapor o fideos de trigo integral", "espárragos al vapor", "brócoli cocido al vapor"], "method": ["Sazonar los filetes de rape con sal y pimienta blanca molida, luego cortar en seis pedazos de igual tamaño.", "Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete. Agregue el pescado, presionando ligeramente sobre los trozos de pescado mientras se cocinan. Cocine por 3-4 minutos en un lado, luego reduzca el fuego a medio.", "Voltee el pescado y espolvoree el ajo, el jengibre y el chile. Cocine por otros 3-4 minutos (dependiendo del tamaño del filete), o hasta que la carne se haya vuelto opaca y se desmenuce fácilmente cuando se la toque con un par de palillos o un tenedor.", "Sazone con la salsa de soja y el aceite de sésamo y ponga la salsa sobre el pescado. Agregue las tiras de cebolla de primavera y el cilantro picado y cocínelas durante 1-2 minutos, o hasta que las hierbas se hayan marchitado ligeramente.", "Para servir, transfiera el pescado a un plato de servir y adorne con las hierbas marchitas. Cuchara sobre los jugos de cocina de la sartén y sirva inmediatamente con arroz al vapor o fideos de trigo integral aliñados y espárragos al vapor y brócoli."], "url": "www_bbc_co_uk_food_recipes_wokcookedmonkfishwit_89274", "title": "Wok-cocido rape con salsa de soja de sésamo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 150-200 g / 5½-7 oz de chuletas de cerdo", "5 litros / 9 pintas de agua", "1kg / 2lb 4oz de sal fina", "10 dientes", "5 hojas de laurel", "aceite de oliva, para freír", "1 x 500 g / 1 libra de cuello de cerdo o hombro de 2 onzas, toda la grasa visible recortada", "1 cebolla, cortada en cubitos", "1 zanahoria, en cubitos", "1 apio, cortado en cubitos", "pequeño puñado de tomillo fresco", "1 ramita de salvia fresca", "2 cucharadas de aceite de oliva", "1 zanahoria, más o menos picada", "½ cebolla, más o menos picada", "2 palitos de apio, más o menos picados", "2 dientes de ajo, aplastados", "250 g / 9 oz de guarniciones de cerdo, grasa eliminada", "25g / 1oz de tomillo fresco", "25 g / 1 oz de salvia fresca", "½ x 75cl botella de vino blanco seco", "1 litro / 1¾ pintas de carne de ternera", "1 litro / 1¾ pintas de caldo de pollo", "2 cucharaditas de vinagre de Cabernet Sauvignon", "2 puñados de salvia fresca.", "aceite de girasol, para freír", "100 g / 3½ oz de mantequilla", "Pan rallado de 200 g / 7 oz panko", "200 g / 7 oz de piñones", "crepitar de cerdo, servir, opcional"], "method": ["Para la salmuera, ponga todos los ingredientes en una sartén grande y deje hervir hasta que la sal se haya disuelto. Retirar del fuego y dejar enfriar. Enfríe en el refrigerador hasta que esté listo para usar.", "Agregue el collar de cerdo a la salmuera, cubra y enfríe durante 4 horas. Retire el collar pero conserve la salmuera. Lave el collar con agua corriente fría durante 30 minutos y luego séquelo bien. Precalentar al horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Coloque una cazuela para horno a prueba de calor. Agregue el aceite y una vez caliente agregue el collar de cerdo y marrón en todos los lados. Transfiera la carne a una tabla y deje que la sartén se caliente nuevamente. Agregue las verduras y las hierbas y fría por 2-3 minutos, o hasta que estén coloreados. Regrese la carne de cerdo a la sartén y vierta el caldo de pollo. Hornee por 2-3 horas o hasta que estén cocidos.", "Mientras tanto, agregue las chuletas de cerdo a la salmuera retenida, tape y deje enfriar por 2 horas. Lave las chuletas con agua corriente fría durante 30 minutos, luego séquelas bien y déjelas a un lado.", "Para la salsa de cerdo, caliente la mitad del aceite en una sartén grande de base pesada. Agregue la cebolla, el ajo, el apio y las zanahorias y fríalos, revolviendo, hasta que estén caramelizados. Transfiera a un plato con una espumadera y déjelo a un lado. Caliente el aceite restante en la sartén y fría los restos de cerdo hasta que estén coloreados en todos los lados. Transfiere a otro plato.", "Desglaze la sartén con el vino, raspando todo el residuo del fondo de la sartén. Regrese las verduras y las guarniciones de cerdo a la sartén, luego agregue los caldos, el tomillo y la salvia. Llevar a ebullición, luego cocine a fuego lento durante 1 hora, rozando regularmente. Cuele el caldo en una sartén limpia y cocine a fuego lento hasta que se reduzca. Cuando tenga una consistencia similar a la salsa, cuela a través de la muselina.", "Para la miga de salvia y piñones, precaliente una freidora a 180 ° C. Freír a fuego lento las hojas de salvia en aceite de girasol, luego escurrir bien sobre papel de cocina. Derretir la mantequilla en una sartén de fondo grueso. Agregue las migas de pan y los piñones y fría, revolviendo, hasta que estén dorados. Dejar de lado. Cuando las hojas de salvia estén frías, páselas aproximadamente y añádalas a la mezcla de piñones. Sazonar con sal.", "Para servir, precalentar una sartén grande. Aceite las chuletas de cerdo, luego cocine durante 3-6 minutos por cada lado, hasta que estén cocidas. Esto dependerá del tamaño de tus chuletas.", "Cortar el collar de cerdo en porciones y chargrill por todos lados durante 2-3 minutos. Transfiera a una sartén y esmalte con la salsa de cerdo. Termine con el vinagre de Cabernet Sauvignon.", "Coloque la chuleta de cerdo y el collar en un plato para servir y rocíe con la salsa. Cubra con las migas de piñones y sirva con el crujiente de cerdo."], "url": "www_bbc_co_uk_food_recipes_wood-fired_pork_collar_72424", "title": "Collar de cerdo a la leña y crujiente con migas de salvia y piñones", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla", "2 peras, peladas, sin núcleo, cortadas a la mitad", "sal y pimienta negra recién molida", "1 cucharada de azúcar demerara", "2 cucharaditas de aceite vegetal", "4 pechos de paloma, piel quitada", "1 cucharada de hojas de tomillo fresco picado", "1 cucharada de lardons de tocino ahumado, fritos hasta que estén crujientes y dorados", "4 rebanadas finas de baguette, a la parrilla hasta que estén crujientes y doradas", "4 pequeños puñados de hojas de berro de bebé"], "method": ["Caliente la mitad de la mantequilla en una sartén a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue las peras. Sazonar, al gusto, con sal y pimienta negra recién molida, luego revuelva bien para cubrir las peras en la mantequilla.", "Agregue el azúcar y revuelva hasta que el azúcar se haya disuelto y se haya caramelizado y haya cubierto las peras.", "Mientras tanto, caliente el aceite y la mantequilla restante en una sartén separada. Cuando la mantequilla esté espumosa, agregue las pechugas de paloma y fría por 1-2 minutos en cada lado. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue el tomillo y el tocino cocido y continúe cocinando por otros 2-3 minutos, o hasta que los senos de paloma estén dorados por todos lados y cocinados a su gusto, y el tocino se haya calentado.", "Para servir, coloque una rebanada de baguette a la parrilla en el centro de cada uno de los cuatro platos. Coloque un puñado de hojas de berro de bebé encima de cada una. Cuchara sobre algunas de las peras, luego la mezcla de paloma y tocino."], "url": "www_bbc_co_uk_food_recipes_woodpigeonbruschetta_92781", "title": "Bruschetta Paloma de madera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pimienta negra recién molida", "hojas de albahaca picadas", "1 bola de mozzarella fresca", "2 rebanadas de jamón", "aceite de oliva, para lloviznar"], "method": ["Esparce la pimienta negra recién molida y las hojas de albahaca picadas en la bola de mozzarella.", "Envuelva la bola sazonada en las rodajas de jamón.", "Calentar un poco de aceite de oliva en una sartén antiadherente y freír la mozzarella envuelta durante unos minutos, hasta que el jamón esté crujiente y dorado.", "Servir."], "url": "www_bbc_co_uk_food_recipes_wrappedmozzarella_82617", "title": "Mozzarella envuelto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 higos", "55 g / 2 oz de Camembert, cortado en trozos", "8 rebanadas de tocino", "puerto de salpicadura", "llovizna vinagre balsámico", "pocas hojas frescas de tomillo o albahaca"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Dividir abrir los higos y cada uno con un trozo de Camembert.", "Envuelve cada higo con dos rebanadas de pancetta. Coloque en una bandeja para hornear y cocine en el horno durante 5-6 minutos, o hasta que la panceta esté dorada y el queso derretido.", "Retire los higos del horno y rocíe con un poco de oporto y vinagre balsámico.", "Espolvorea con tomillo o hojas de albahaca, para servir."], "url": "www_bbc_co_uk_food_recipes_wrappedfigswithcamem_79057", "title": "Higos envueltos con camembert", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x filetes de cola de rape (aproximadamente 150 g / 5 oz cada uno)", "Mota de 8 rebanadas (o jamón de Parma)", "1 cucharada de perejil", "1 cucharada de orégano", "6 cucharadas de aceite de oliva", "6 hojas de salvia", "1 chalota", "1 cucharada de vinagre de vino tinto", "1 vaso de vino tinto", "300ml / ½ pinta de caldo de verduras", "sal y pimienta negra recién molida"], "method": ["Comience cortando finamente el perejil y el orégano, luego mezcle con el aceite de oliva para hacer el adobo, agregando sal y pimienta al gusto.", "Piel las colas de rape, teniendo mucho cuidado de eliminar toda la membrana, o los peces adquieren una textura gomosa cuando se cocinan. Coloque el rape en un recipiente y cubra con el adobo, déjelo por 20 minutos.", "Coloque 4 rebanadas de la mota (o jamón de Parma) una al lado de la otra en una superficie de trabajo y coloque 3 de las hojas de salvia en el centro. Coloque uno de los filetes marinados en el jamón y enrolle los lados para encerrar al pescado. Repita con el otro filete y el resto del jamón, y colóquelo en una bandeja para hornear. Cocine en un horno a 200C / 400F / Gas6 por 12-15 minutos.", "Para la salsa, picar finamente la chalota y freír en un poco de aceite hasta que esté suave. Agregue el vinagre y hierva hasta que esté casi seco, luego agregue el vino tinto y reduzca a aproximadamente una cuarta parte. Agregue el stock y reduzca a la mitad. Colar a través de un colador y sazonar al gusto.", "Para servir, corte el filete cocido, coloque las rebanadas en el plato y rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_wrappedmonkfish_4754", "title": "Rape envuelto", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "50g / 1¾oz de mantequilla", "2 chalotes, picados", "1 bulbo de hinojo, finamente picado", "1 cucharada de puré de tomate", "500g / 1lb 2 oz de cáscaras de cangrejo, tomadas de las colas de cangrejo fresco (abajo)", "2 cucharadas de aguardiente", "1 litro / 1¾ pintas de caldo de pescado", "2 hojas de laurel", "2 ramitas de perejil fresco de hoja plana", "sal y pimienta negra recién molida", "3-4 bulbos de hinojo, picados", "40 g / 1½ oz de mantequilla sin sal", "2 cucharadas de aceite de oliva extra virgen de sabor suave", "3 cucharadas de crema", "55 g / 2 oz de mantequilla", "6 colas de cangrejo, blanqueadas", "2 filetes de pez naufragio (o lubina), con piel, espinas", "1 cucharadita de polen de hinojo (o semillas de hinojo molido)", "50g / 1¾oz de verdolaga", "50 g / 1¾oz de remolacha"], "method": ["Para la sopa de cangrejo de río, caliente el aceite y la mantequilla en una sartén grande y fría los chalotes y el hinojo por 2-3 minutos. Agregue el puré de tomate y cocine, revolviendo, durante un minuto más. Agregue las cáscaras de cangrejo y el brandy y cocine por un minuto más.", "Agregue el caldo de pescado, las hojas de laurel y el perejil y cocine a fuego lento. Cocine por 20-25 minutos, o hasta que el volumen del líquido se haya reducido en un tercio. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la mezcla en un procesador de alimentos y mezcle hasta obtener un puré fino.", "Pasar el puré a través de un colador en una cacerola limpia y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el puré de hinojo, coloque el hinojo picado en una sartén grande y cúbralo con agua fría. Agregue una abundante cantidad de sal, coloque a fuego medio y deje hervir. Una vez que hierva, reduzca el fuego ligeramente y cocine a fuego lento hasta que esté muy tierno.", "Escurrir en un colador y colocar el hinojo en una licuadora. Agregue la mantequilla, el aceite de oliva y la crème fraîche y puré hasta que quede suave. Sazone con sal y pimienta negro.", "Para los restos fritos y cangrejos de río, caliente una sartén grande y agregue la mantequilla. Una vez caliente, agregue los filetes de pez naufragio y las colas de cangrejo de río y cocine durante dos minutos por cada lado.", "Para servir, ponga un poco de puré en los platos para servir y cubra con el pez frito y el cangrejo fritos y ponga la sopa sobre la parte superior. Adorne con polen de hinojo, verdolaga y remolacha."], "url": "www_bbc_co_uk_food_recipes_wreck_fish_and_crayfish_51233", "title": "Naufragio de peces y cigalas con puré de hinojo y sopa de cangrejos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "50g / 1¾oz de mantequilla", "2 chalotes, picados", "1 bulbo de hinojo, finamente picado", "1 cucharada de puré de tomate", "500g / 1lb 2 oz de cáscaras de cangrejo, tomadas de las colas de cangrejo fresco (abajo)", "2 cucharadas de aguardiente", "1 litro / 1¾ pintas de caldo de pescado", "2 hojas de laurel", "2 ramitas de perejil fresco de hoja plana", "sal y pimienta negra recién molida", "200g / 7oz de alforfón", "100g / 3½oz de mantequilla sin sal", "4 bombillas de hinojo bebé", "100 g / 3½ oz de samphire", "dash aceite de oliva", "55g / 2oz de mantequilla sin sal", "100 g / 3½ oz de espinaca", "1 cucharadita de polen de hinojo (o semillas de hinojo molido)", "4 cucharadas de tapas de hinojo picadas", "55 g / 2 oz de mantequilla", "2 filetes de pez naufragio (o lubina), con piel, espinas", "6 colas de cangrejo, blanqueadas"], "method": ["Para la sopa de cangrejo de río, caliente el aceite y la mantequilla en una sartén grande y fría los chalotes y el hinojo por 2-3 minutos. Agregue el puré de tomate y cocine, revolviendo, durante un minuto más. Agregue las cáscaras de cangrejo y el brandy y cocine por un minuto más.", "Agregue el caldo de pescado, las hojas de laurel y el perejil y cocine a fuego lento. Cocine por 20-25 minutos, o hasta que el volumen del líquido se haya reducido en un tercio. Retirar del fuego y dejar enfriar ligeramente.", "Vierta la mezcla en un procesador de alimentos y mezcle hasta obtener un puré fino. Pase el puré a través de un colador en una olla limpia y sazone con sal y pimienta.", "Cocine el alforfón según las instrucciones del paquete. Caliente una sartén grande y agregue la mantequilla, una vez que haya dorado, agregue el alforfón cocido y saltee durante 2 minutos hasta que esté cubierto con mantequilla y caliente.", "Blanquee el hinojo bebé en agua hirviendo durante 2 minutos y revuelva en agua helada. Una vez frío, séquelo. Haz lo mismo con el samphire.", "Calentar una sartén de plancha. Engrase el hinojo seco del bebé y colóquelo en la sartén de la plancha. Cocine cada lado durante 1-2 minutos o hasta que aparezcan las marcas.", "Caliente una sartén grande y agregue la mantequilla, una vez caliente agregue la espinaca y el hinojo y cocine hasta que la espinaca se marchite.", "Para el pescado, caliente una sartén grande y agregue la mantequilla. Una vez caliente, agregue los filetes de pez naufragio y las colas de cangrejo de río y cocínelas durante 2 minutos por cada lado.", "Para servir, ponga un poco de trigo sarraceno en los platos para servir y cubra con el hinojo y la espinaca, luego el pez naufragado y el cangrejo de río y vierta la sopa en la parte superior. Adorne con el hinojo bebé, polen de hinojo y tapas de hinojo."], "url": "www_bbc_co_uk_food_recipes_wreck_fish_with_beurre_16464", "title": "Pez naufragado con alforfón beurre noisette, colas de cangrejo y hinojo bebé a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["un aceite vegetal de llovizna, para engrasar", "400 g / 14 oz tipo harina 00, más extra para quitar el polvo", "Harina de sémola 100 g / 3½ oz", "1½ cucharadita de azúcar en polvo", "½ cucharadita de sal marina en copos", "7 g de levadura de acción rápida", "325ml / 11fl oz de agua tibia", "1 cucharada de aceite vegetal", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "1 cucharada de mezcla de especias baharat molidas", "500 g / 1lb 2 oz de carne picada de pollo", "75g / 21 / 2oz sultanas", "300ml / 10fl oz de caldo de pollo", "sal y pimienta negra recién molida", "250g / 9oz de yogurt natural", "4 cucharadas de hojas de menta fresca", "4 cucharadas de hojas frescas de cilantro", "2 chiles verdes, finamente picados", "2 muslos de pollo, con hueso, con la piel abierta", "1 cucharada de melaza de granada", "1 cucharada de miel líquida", "3 cucharadas de aceite de oliva", "2 cabezas bebé gema lechuga, hojas trituradas", "1 aguacate, sin hueso y en rodajas", "1 granada, solo semillas", "1 cucharada de cilantro fresco desgarrado", "1 cucharada de menta fresca desgarrada", "3 cucharadas de aceite de oliva", "1 cucharada de jugo de limón", "1 cucharadita de miel líquida"], "method": ["Prepare la masa de pan plano el día antes de que desee cocinar los panes. Engrase ligeramente una bandeja de horno con el aceite. Mezcle la harina común, la harina de sémola, el azúcar y la sal en un tazón grande. Mezcle la levadura con un poco de agua tibia en una jarra hasta que tenga una pasta, luego agregue el agua restante hasta que la levadura se haya disuelto. Haga un pozo en el centro de la mezcla de harina y vierta el agua con levadura. Lentamente coloque la harina en el agua hasta que se incorpore todo y tenga una masa suave.", "Rocíe ligeramente una superficie de trabajo con harina normal. Amasar la masa en la superficie hasta que quede suave y elástica. Divida la masa en cuatro pedazos de igual tamaño y enrolle cada uno en una bola. Coloque las bolas en la bandeja para hornear preparada, cúbralas con una hoja suelta de película adhesiva o una toalla de té limpia, y déjelas en la nevera durante 24 horas o hasta que dupliquen su tamaño.", "Cuando esté listo para cocinar, comience con la ensalada. Precalienta el horno a 180 ° C / Fan 160 / Gas 4. Coloca los muslos de pollo en una bandeja profunda para hornear. Mezcle la melaza, la miel y el aceite de oliva en un recipiente, luego rocíe sobre los muslos. Hornee durante 15-20 minutos o hasta que estén cocidos. Retire del horno y deje hasta que esté lo suficientemente frío como para manipularlo, luego pula el pollo, tritúrelo en tiras y póngalo en un tazón grande. Enciende el horno a su configuración más alta.", "Mientras el pollo se cocina, prepare el pan plano. Calentar el aceite en una sartén a fuego medio. Agregue la chalota, el ajo y las especias y fría por 1-2 minutos, o hasta que estén blandos. Agregue la carne picada de pollo, aumente el fuego a fuego alto y fríe durante 4-5 minutos, rompiendo la carne picada con una cuchara y revolviendo a menudo, hasta que se dore por todas partes. Agregue las pasas sultanas y ponga a hervir, luego reduzca el fuego a fuego lento y cocine durante 18-20 minutos, o hasta que el pollo esté cocido y tierno, y el líquido se haya evaporado casi por completo. Sazonar al gusto con sal y pimienta, luego retirar del fuego y dejar enfriar por completo.", "Coloque una bandeja para hornear pesada o una piedra para pizza en el horno para calentar. Empolva ligeramente una superficie de trabajo con harina. Haga rodar cada pieza de masa sobre la superficie en un óvalo de aproximadamente 20x15 cm / 8x6 pulgadas y alrededor de 0.5 cm / ¼ pulgadas de espesor.", "Extienda la mezcla de pollo sobre las bases de la masa y transfiera los panes planos, en lotes si es necesario, a la bandeja para hornear o a la piedra para pizza. Cocine por 5-10 minutos, o hasta que las bases estén doradas y crujientes.", "Mientras tanto, termina la ensalada. Agregue la lechuga, el aguacate, las semillas de granada y las hierbas al tazón con el pollo. En un tazón pequeño separado, mezcle el aceite de oliva, el jugo de limón y la miel. Justo antes de servir, agregue el aderezo a la ensalada.", "Rocíe los panes planos con el yogur y espolvoree con las hierbas y el chile. Sirve con la ensalada."], "url": "www_bbc_co_uk_food_recipes_xxxxx_36916", "title": "Flatbread de pollo con especias y ensalada de pollo libanesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "900g / 2lb de cordero guisado (o cordero)", "2 cebollas grandes, picadas", "1 pimiento Scotch Chili Pepper, picado", "3 cubos de caldo de carne", "½ gran ñame", "450 g / 1 libra de calabaza", "3 papas grandes", "570ml / 1 pinta de sopa de fideos de pollo comprada en la tienda", "1 manojo de cebollas en rodajas", "tomar el tomillo, hojas solo", "albóndigas, para servir (opcional)"], "method": ["Calienta el aceite en una sartén grande. Agregue el cordero (o cordero) y cocine hasta que se dore por todos lados.", "Agregue las cebollas y el chile a la sartén y cocine hasta que se ablanden.", "Mientras tanto, prepare una jarra de caldo con los tres cubos de caldo de carne y aproximadamente 900 ml / 1 pinta 12 fll de agua hirviendo, según el gusto. Agregue el caldo a la sartén y cocine a fuego lento durante 40 minutos hasta que la carne esté tierna.", "Mientras la sopa hierve a fuego lento, pique el ñame, la calabaza y la patata en pedazos.", "Caliente la sopa de fideos de pollo en una sartén por separado, agregue el ñame, la calabaza y las papas. Cocine las verduras hasta que estén tiernas. Cuando estén cocidos completamente, escurra y reserve el líquido.", "Una vez que la carne esté tierna, agregue las verduras a la primera sartén y agregue un poco de la sopa de pollo con fideos líquido si es necesario.", "Esparce las cebolletas sobre la sopa junto con las hojas de tomillo.", "Sirva caliente con albóndigas si lo desea."], "url": "www_bbc_co_uk_food_recipes_yamandbutternutsquas_85916", "title": "Sopa de cordero, ñame y calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mitades de nuez 250 g / 9 oz", "2 cubitos de hielo", "125ml / 4½fl oz de melaza de granada, más extra a gusto", "1 cucharada de puré de tomate concentrado", "¼ cucharadita de canela molida", "2 cucharadas de azúcar en polvo, más extra para el gusto", "2 cucharaditas de sal", "1 cucharadita de pimienta negra recién molida", "800 g / 1¾lb de muslos de pollo, con hueso, sin piel", "semillas de granada, para adornar (opcional)", "arroz al vapor, para servir"], "method": ["Moler las nueces lo más finamente posible en un procesador de alimentos hasta que tengan la consistencia de la mantequilla de maní y las migas de nueces se empiezan a unir como una masa.", "Transfiera las nueces molidas en una cazuela con tapa grande y vierta más de 1 litro / 1¾ pintas de agua fría. Llevar la mezcla a ebullición durante 4-5 minutos, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Cocine a fuego lento la mezcla de nueces, medio cubierta con la tapa de la cazuela, durante 2 horas, agregando los 200 ml / 7 fl oz restantes de agua fría y 2 cubitos de hielo después de una hora. Revuelva ocasionalmente para asegurarse de que las nueces no se peguen al fondo de la cazuela. Después de 2 horas, la salsa de nueces debe espesarse y oscurecerse.", "Agregue la melaza de granada, puré de tomate, canela, azúcar, sal y pimienta hasta que estén bien combinados. Regrese la mezcla a fuego lento.", "Agregue los muslos de pollo, vuelva la mezcla a fuego lento, luego coloque la tapa en el plato y cocine a fuego lento durante 1 hora. Retire la tapa durante los últimos 10 minutos de cocción para permitir que la salsa se espese. Sazonar, al gusto, con más azúcar (por dulce) o melaza de granada (por ácido).", "Adorne el plato con un puñado de semillas de granada, si se usa, y sirva con arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_yasmins_fesenjoon_91487", "title": "Fesenjoon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yasmins_fesenjoon_91487_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 cucharaditas de aceite", "400g / 14oz de arroz basmati", "750m / 1¼ pinta de agua hirviendo", "2 cucharaditas de sal", "pizca de azafrán empapado en un poco de agua tibia", "30 g / 1 / oz de pasas remojadas (opcional)"], "method": ["Caliente la mantequilla y el aceite en una cacerola profunda hasta que comiencen a formar espuma. Agregue el arroz y revuelva hasta que todos los granos estén cubiertos. Vierta el agua hirviendo y revuelva. Agrega la sal y el azafrán. Haga que el agua vuelva a hervir. Agrega las pasas.", "Reduzca el fuego a fuego lento a fuego lento y cubra la sartén con una tapa ajustada. Cocine hasta que toda el agua haya sido absorbida (aproximadamente 20 minutos). Apague el fuego y deje reposar el arroz durante 5 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_yellowrice_4614", "title": "Arroz amarillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Avena de avena 150 g / 5½ oz", "50g / 1¾oz de copos de cebada o de centeno", "Sultanas de 25g / 1oz", "50g / 1¾oz de albaricoques secos listos para comer", "150g / 5½oz de yogurt sin grasa de estilo griego por porción, para servir"], "method": ["Mezcle todos los ingredientes, aparte del yogur, en un tazón.", "Sirva un octavo del muesli con el yogur encima. Guarde el resto del muesli en un recipiente hermético hasta por dos semanas."], "url": "www_bbc_co_uk_food_recipes_yoghurt_and_muesli_61842", "title": "Yogurt y muesli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 pechugas de pollo", "280ml / 10fl oz de yogurt natural", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de sal", "½ cucharadita de cúrcuma", "1 cucharadita de semillas de fenogreco", "1 cucharadita de jengibre molido", "1 cucharadita de cebolla en polvo", "½ cucharadita de clavo de olor molido", "¼ cucharadita de chile en polvo", "4 cestones de tomates cherry, cortados por la mitad", "220ml / 8fl oz de vinagre de vino blanco", "4 cucharadas de azúcar en polvo", "½ cucharadita de hojuelas de chile seco"], "method": ["Para el adobo, mezcle todos los ingredientes.", "Corta cada pechuga de pollo en cinco tiras y agrégalas al adobo. Revuelva para combinar y deje macerar durante al menos una hora (más tiempo si es posible).", "Retira de la nevera e inserta las tiras de pollo en los pinchos de madera.", "Caliente una sartén grande hasta que esté caliente, luego agregue los pinchos de pollo.", "Cocine por tres minutos en cada lado hasta que se dore y se cocine completamente.", "Para la mermelada, coloque todos los ingredientes en una cacerola y llévelos a ebullición.", "Reduzca el fuego y cocine a fuego lento durante hasta una hora hasta que parezca un atasco. Enfriar y servir con los pinchos de pollo."], "url": "www_bbc_co_uk_food_recipes_yoghurtspicedchicken_74830", "title": "Pinchos de pollo con especias de yogur", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yoghurtspicedchicken_74830_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 150g / 5½ oz", "2 cucharadas de azúcar glas", "75g / 2½oz de mantequilla fría sin sal, cortada en cubos de aproximadamente 1cm / ½ en cubitos", "1 yema de huevo de gallinas camperas", "½ cucharadita de jugo de limón", "50 g / 1 oz de azúcar en polvo", "225g / 8oz cuajada de queso", "2 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "1 limón, ralladura solamente", "1 cucharadita de agua de rosas", "25 g / 1oz de mantequilla sin sal, derretida", "50g / 1¾oz pasas de Corinto", "½ cucharadita de nuez moscada recién rallada"], "method": ["Para la masa, mezcle la harina y el azúcar glas juntos en un tazón. Agregue la mantequilla y frótela ligeramente con los dedos hasta que la mezcla se vea como pan rallado fino. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Mezcle el huevo con el jugo de limón y una cucharada de agua. Haga un pozo en el centro de la mezcla de harina y vierta la mezcla de huevo. Usando un cuchillo de mesa, coloque el líquido en la harina para unir la masa. Si parece demasiado seco, agrega un poco más de agua. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la película adhesiva y descanse en la nevera durante al menos 15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie ligeramente enharinada hasta un grosor de aproximadamente 3 mm (aproximadamente el grosor de una moneda de una libra) y úsela para revestir la lata de tarta, dejando el exceso de hojaldre colgando sobre el borde. Mantenga un poco de pasta cruda en caso de que necesite parchear las grietas más tarde.", "Alinee la caja de repostería con papel de hornear o papel de aluminio, y luego rellene con alubias, arroz crudo o lentejas. Hornee la persiana por 15 minutos, luego quite el pergamino y los frijoles para hornear y devuelva la masa al horno durante aproximadamente ocho minutos o hasta que la masa se vea seca y ligeramente coloreada.", "Use un cuchillo pequeño y afilado para recortar el exceso de masa del borde. Use un poquito de la masa cruda reservada para parchear las grietas o agujeros si es necesario.", "Baje el horno a 180C / 350F / Gas 4.", "Para hacer el relleno, bata el azúcar y el queso cuajado hasta que quede suave, luego bata los huevos y las yemas de huevo, la ralladura de limón, el agua de rosas y la mantequilla derretida. Agregue las grosellas.", "Vierta el relleno en la caja de repostería y ralle un poco de nuez moscada sobre la superficie. Hornee por unos 20 minutos, hasta que el relleno esté listo. Deje que se enfríe completamente en la lata antes de cortar."], "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_20002", "title": "Tarta de cuajada de Yorkshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshire_curd_tart_20002_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,2 litros / 2 pintas de leche entera", "4 cucharadas de jugo de limón", "½ limón, solo ralladura", "Mantequilla de 65g / 2½oz, ablandada", "Azúcar en polvo de 65 g / 2½ oz", "1 huevo de gallinas camperas, golpeado", "¼ cucharadita de nuez moscada rallada finamente", "50g / 2oz de fruta seca mixta", "Harina normal de 175g / 6oz, más extra para enrollar", "100g / 3½oz de mantequilla fría, en cubos", "2 cucharaditas de azúcar en polvo", "1 huevo de gallinas camperas, golpeado"], "method": ["Para hacer el relleno, caliente la leche en una cacerola grande a fuego lento y cocine a fuego lento. Retire del fuego. Vierta el jugo de limón y revuelva dos veces a medida que se forman las cuajadas. Dejar de lado para enfriar durante una hora.", "Alinee un tamiz con muselina y coloque sobre un tazón grande. Vierta la cuajada y el suero en el tamiz y deje drenar en la nevera durante al menos seis horas, preferiblemente durante la noche.", "Para hacer la masa, coloque la harina, la mantequilla y el azúcar en un procesador de alimentos y mezcle la configuración del pulso hasta que la mezcla se asemeje a migas de pan finas. Con el motor en marcha, agregue lentamente el huevo y mezcle hasta que la mezcla se una y comience a formar una bola. Retire con cuidado y la forma en una ronda aplanada listo para rodar.", "Ruede los pasteles en una superficie ligeramente enharinada. Usando el rodillo, levante la masa con cuidado y alinee el plato de pastel, presionando hacia abajo bien en la base y los lados de la lata. Corte cualquier exceso de hojaldre y pellizque ligeramente la base de la tarta y déjela a un lado.", "Precalentar el horno a 180C / 350F / Gas 4.", "Coloque una bandeja para hornear en el horno para calentar. Con un batidor eléctrico, unte la mantequilla y el azúcar hasta que estén suaves y esponjosos. Gradualmente golpee el huevo, poco a poco, latiendo bien entre cada adición. Agregue el queso cuajado, la ralladura de limón, la nuez moscada y la fruta. Mezcle hasta que esté bien combinado.", "Coloque la cuajada en la base de la masa y extiéndala a los lados. Hornee por 30-35 minutos, o hasta que la masa esté dorada y el relleno se asiente. Dejar enfriar en la lata durante al menos 30 minutos antes de servir. Sirva a temperatura ambiente o enfríelo antes de cortar."], "url": "www_bbc_co_uk_food_recipes_yorkshire_curd_tart_23874", "title": "Tarta de cuajada de Yorkshire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]