[{"isVegetarian": false, "title": "Yorkshire curd pie", "url": "www_bbc_co_uk_food_recipes_yorkshirecurdpie_86473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 litres/3 pints whole milk", "1 lemon, juice only", "400g/14oz plain flour, plus extra for dusting", "pinch salt", "110g/4oz butter, cut into pieces", "110g/4oz lard, cut into pieces", "3-4 tbsp cold water", "110g/4oz butter, softened", "1 tbsp rosewater", "2 free-range eggs, beaten", "110g/4oz currants"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Begin the day before you want to make the pie. For the curds, bring the milk to the boil in a pan. Add the lemon juice and stir well - the mixture will curdle quite quickly. Remove from the heat and allow to cool, then pour into a muslin-lined sieve placed over a bowl and leave overnight to strain until solid. Refrigerate the solid curds once separated - discard any liquid.", "The next day, for the pastry, sift the flour and salt into a mixing bowl. Add the butter and lard and rub together until the mixture resembles fine breadcrumbs. Add the water and stir until the mixture comes together, then turn out onto a lightly floured work surface and knead briefly until smooth. Wrap the dough in cling film and place in the fridge for 30 minutes to rest.", "Remove the dough from the fridge and roll out to 0.5cm/¼in thick. Line a deep 20cm/8in loose-bottomed tart tin with the pastry, prick the base all over with a fork and place into the fridge to rest for ten minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Line the pastry case with baking paper and fill with rice or baking beans. Transfer to the oven and bake for 15 minutes. Remove the baking paper and rice or beans and return to the oven for five minutes, or until lightly golden.", "To make the pie, place the softened butter into a bowl, add the rosewater and mix well. Add the solid curds and the beaten eggs to the bowl and stir well. Add the currants and mix thoroughly.", "Pour the mixture into the pastry case and bake for 20-30 minutes, or until the filling is set and lightly golden. Remove from the oven and leave to cool.", "To serve, remove the pie from the tin, cut into wedges and place onto serving plates."]}, {"isVegetarian": false, "title": "Yorkshire fillet steak with fries and béarnaise sauce", "url": "www_bbc_co_uk_food_recipes_yorkshire_wagyu_fillet_50959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for deep frying", "3 tbsp tarragon vinegar", "3 tbsp white wine", "¼ tsp white peppercorns", "½ small banana shallot, finely chopped", "125g/4½oz butter", "2 free-range egg yolks", "sea salt and freshly ground black pepper", "½ lemon, juice only", "1 tbsp chopped tarragon leaves ", "1 tbsp olive oil", "1 x 200g/7oz good-quality fillet steak", "100g/3½oz frozen chips"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Preheat a deep-fat fryer to 180C/350F. Alternatively fill a large heavy-based pan with oil and heat, using a cooking thermometer to check the temperature. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Put the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Simmer until the volume of liquid has reduced to about one tablespoon. Strain the liquid into a bowl and then set aside to cool. ", "Meanwhile, melt 100g/3½oz of the butter in a small saucepan set over a medium heat. ", "Put the egg yolks in a bowl set over a pan of simmering water and whisk until thickened and light in colour. Gradually add the melted butter, whisking constantly.", "Season with salt and black pepper, add the cooled shallot reduction and the chopped tarragon leaves and mix well.", "Turn off the heat and leave the bowl over the pan until ready to use.", "Heat a frying pan until searing hot. Add the olive oil and steak and cook on one side for 2-3 minutes, before turning over and placing in the oven for 2-3 minutes.", "While the steaks are in the oven, carefully lower the chips into the deep-fat fryer and cook for 3-4 minutes, or until golden-brown and cooked through.", "Remove the steak from the oven and add the remaining butter to the pan. Spoon the melted butter over the steak repeatedly for at least 2-3 minutes while the steak rests – this will give a lovely shine and add to the flavour. ", "To serve, place the steak on a plate, pile the chips alongside and then finish with a dollop of béarnaise sauce."]}, {"isVegetarian": true, "title": "Yorkshire parkin", "url": "www_bbc_co_uk_food_recipes_yorkshireparkin_83745", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz medium oatmeal", "175g/6oz self-raising flour", "2 tsp ground ginger", "175g/6oz soft brown sugar", "175g/6oz butter", "250g/9fl oz golden syrup", "50g/2oz black treacle", "2 free-range eggs", "110ml/4oz milk"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2 and line a small, deep baking tray with parchment paper. Combine the oatmeal, flour and ginger in a large mixing bowl.", "Melt the sugar, butter, syrup and treacle in a bowl in the microwave or in a saucepan over a low heat. Pour the melted ingredients into the flour with the eggs and milk and stir well.", "Pour the mixture into the prepared baking tray.", "Bake for 45 minutes until golden brown, but still soft and sticky on top. Reduce the oven to 130C/250F/Gas 1 and bake for a further 30 minutes until firm to the touch.", "Allow to cool, before tightly wrapping in cling film. Store for at least three to five days to mature."]}, {"isVegetarian": false, "title": "Classic Yorkshire pudding", "url": "www_bbc_co_uk_food_recipes_yorkshirepudding_81824", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 free-range eggs", "600ml/1 pint milk", "55g/2oz dripping"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the flour and a little salt and freshly ground black pepper into a bowl.  Add the eggs, mixing in with a whisk, then gradually pour in the milk, mixing slowly to prevent lumps forming.", "Cover the bowl with clingfilm and chill in the fridge overnight.", "Preheat the oven to 220C/425F/Gas 7.  ", "Put a little of the dripping in four non-stick Yorkshire pudding tins. Place the tins in the oven until smoking hot. ", "Remove from the oven and quickly fill the moulds with the batter. Return to the oven and cook for 20-25 minutes.", "Turn the oven down to 190C/375F/Gas 5 and cook for a further 10 minutes to set the bottom of the puddings.  ", "Remove from the oven and serve."]}, {"isVegetarian": false, "title": "Yorkshire pudding", "url": "www_bbc_co_uk_food_recipes_yorkshirepudding_93848", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshirepudding_93848_16x9.jpg", "ingredients": ["3 eggs ", "115g/4oz flour", "275ml/½ pint milk", "beef dripping", "salt"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Mix together the eggs, flour and a pinch of salt. ", "Add the milk, stirring constantly, until you have a runny batter. ", "Leave this to rest, covered, in the refrigerator for up to 12 hours.", "Place 1cm/½in of beef dripping in the bottom of each pudding mould, or if you are using a rectangular roasting tray, place 1cm/½in of beef dripping across the bottom. ", "Heat the dripping in the oven (at 240C/460F/Gas 8) for about ten minutes, until it is piping hot. ", "Remove the roasting tray from the oven, pour in the batter, and immediately return to the oven. Bake for 25 minutes, until golden brown and crispy, making sure not to open the oven door for the first 20 minutes."]}, {"isVegetarian": false, "title": "Yorkshire puddings", "url": "www_bbc_co_uk_food_recipes_yorkshirepuddings_86010", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yorkshirepuddings_86010_16x9.jpg", "ingredients": ["100g/3½oz plain flour ", "½ teaspoon salt ", "pinch white pepper ", "1 tablespoon shredded suet (optional) ", "2 free-range eggs", "200ml/7fl oz milk", "50ml/2fl oz water", "oil or beef fat, for cooking"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Sift the flour into a bowl. Add the salt, pepper, suet (if using) and eggs and beat with a fork to combine.", "Mix the milk and water in a jug, then gradually add to the flour and egg mixture, stirring constantly, to create a smooth and creamy batter. ", "Leave the batter to stand for ten minutes.", "Pour two tablespoons of oil or beef fat into each of the cups of a muffin tray. Place the muffin tray into the hot oven and leave for 5-10 minutes, until the fat is smoking hot.", "Carefully remove the muffin tray from the oven. Pour approximately 30ml/1fl oz of batter into each muffin cup, then carefully return to the oven to bake for 10-15 minutes, until risen and golden-brown. Resist the urge to open the oven and check on the puddings for at least ten minutes, as this will hamper their progress.", "Remove from the oven and serve with the roast of your choice."]}, {"isVegetarian": false, "title": "Yorkshire puddings with black pudding and beer and onion gravy", "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingswit_92145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 3oz beef bones (such as rib, short rib, knuckle or thigh bones)", "1-2 tbsp sea salt flakes", "2 large onions, peeled, cut into quarters", "2 carrots, peeled, chopped", "2 celery stalks, trimmed, cut in half", "350ml/13fl oz light beer, preferably from North Yorkshire", "1 bouquet garni (1 sprig each of parsley, bay leaves and thyme, tied together with cooking string)", "10 black peppercorns", "4 whole garlic cloves, unpeeled", "1 tsp tomato purée", "2 bay leaves", "1.5 litres/2 pints 12¾fl oz water", "4 heaped tbsp plain flour", "½ tsp salt", "2 free-range eggs, beaten", "275ml/10fl oz full-fat milk", "2 tbsp vegetable oil or sunflower oil, plus extra for greasing", "50g/2oz beef fat, sliced into thin strips (ask your butcher for this)", "1-2 tbsp sea salt flakes", "2 onions, peeled, finely chopped", "1.5 litres/2 pints 12¾fl oz beef stock (see above)", "1 tbsp redcurrant jelly", "175ml/6fl oz beer (ale), preferably from Yorkshire", "2 tsp plain flour", "2 tsp water", "", "12 individual black pudding sausages (or 12 slices from a large black pudding), fried until crisp"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the beef stock, preheat the oven to 230C/450F/Gas 8.", "Place the beef bones into a roasting tray and sprinkle over the salt flakes. Roast in the oven for 25-30 minutes, or until well browned.", "Add the onions, carrots and celery to the roasting tray and return to the oven for a further 12-15 minutes, or until the vegetables have browned.", "Transfer the bones and vegetables to a large stock pot.", "Add the light beer to the roasting tray and bring to a simmer, scraping up any browned bits up from the bottom of the tray using a wooden spoon to deglaze. Add the mixture to the pan.", "Add the bouquet garni, peppercorns, garlic cloves, tomato purée and bay leaves to the pan and stir well. Add the water and bring the mixture slowly to the boil. Reduce the heat until the mixture is simmering, then continue to simmer gently for two hours, skimming off any fat that rises to the surface of the liquid at regular intervals.", "Strain the stock into a clean pan and set aside to cool (skim off any remaining fat before using).", "For the Yorkshire pudding, decrease the oven temperature to 220C/425F/Gas 7.", "Sift the flour with the salt into a bowl and make a well in the centre.", "Gradually add the beaten eggs to the well and work it into the centre of the flour mixture a little at a time. Gradually whisk in the milk a little at a time until the batter has the consistency of single cream. Set aside for at least an hour to rest.", "When the batter has rested for one hour, drizzle a little oil into each of the wells of a 12-hole Yorkshire pudding tray.", "Heat the oil in the oven until smoking hot, then quickly three-quarters fill each well with some of the Yorkshire pudding batter using a ladle and return to the oven. Bake for 25-30 minutes, or until the Yorkshire puddings have risen and are golden-brown.", "Meanwhile, for the gravy, place the sliced beef fat into a large frying pan over a medium to high heat and sprinkle over the salt. Fry for 2-3 minutes, or until the fat begins to melt. (Remove any strips of fat that haven't melted from the pan and discard).", "Add the onions to the hot fat and fry for 4-5 minutes, or until softened. Add the beef stock and beer and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 15 minutes, or for longer if you prefer thicker gravy.", "Add the redcurrant jelly and stir well until dissolved. Continue to simmer for a further 4-5 minutes. Season, to taste, with salt and freshly ground black pepper. (NB: The leftover beef stock can be set aside to cool, then frozen in ice cube trays and kept for up to six months.)", "To serve, place two Yorkshire puddings onto the centre of each of four serving plates. Arrange three of the black pudding sausages between the Yorkshire puddings. Drizzle over the gravy."]}, {"isVegetarian": false, "title": "Yorkshire pudding (via Punjab!)", "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingviap_9974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz flour", "½ tsp salt", "¼ tsp ground coriander seeds", "1 egg (beaten)", "300ml/10fl oz milk", "cold water", "2 tbsp dripping", "You will need Yorkshire pudding tins for this recipe."], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Sieve the flour, salt and coriander powder into a bowl.", "Add the beaten eggs and half the milk. Beat well for 5 minutes or until the batter is smooth.", "Beat in remaining milk and enough cold water to give thick creamy consistency.", "Leave the batter to stand for 30 minutes.", "Heat dripping in Yorkshire pudding tins until very hot. The fat should be so hot that when the batter is poured in it sizzles.", "Sprinkle a few drops of cold water into the batter and pour into the hot fat (this creates steam helping the batter to rise). ", "Cook for 15-20 minutes in a preheated oven 220C/425F/Gas 7, until puffed and golden with a soft centre. ", "Remove from oven and serve immediately."]}, {"isVegetarian": false, "title": "Yorkshire pudding with red onion gravy", "url": "www_bbc_co_uk_food_recipes_yorkshirepuddingwith_83703", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/10oz plain flour", "8 medium free-range eggs", "salt and freshly ground black pepper", "500ml/1 pint full fat milk", "100g/4oz beef dripping", "30g/1¼oz butter", "2 red onions, thinly sliced", "2 cloves garlic, grated", "200ml/7fl oz red wine", "1 litre/2 pints fresh beef stock", "2 sprigs thyme", "2 tbsp balsamic vinegar"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 220C/430F/Gas 8. ", "Place the flour, eggs and seasoning into a food processor.", "Turn on and blend to a paste before adding the milk. Continue to process until a smooth batter is formed.", "Pour into a jug and place in the fridge to rest. This works best if you are able to leave it overnight.", "Place the Yorkshire tins on a baking tray, then put the beef dripping into the tins and place in the oven. Heat for 5-10 minutes until smoking hot.", "Pour the batter into the tins and bake for 10-15 minutes until golden brown and risen around the edges.", "Meanwhile, heat a sauté pan until hot then add the butter, sliced onions and garlic and cook for 8-10 minutes until tender but not coloured.", "Add the red wine and reduce by half.", "Add the beef stock and bring to the boil.", "Reduce the heat to a simmer, add the balsamic vinegar and thyme and cook for 10-15 minutes.", "Season with salt and black pepper.", "Serve poured over the Yorkshire Pudding."]}, {"isVegetarian": false, "title": "Yucatán chicken tacos", "url": "www_bbc_co_uk_food_recipes_yucatn_chicken_tacos_97105", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yucatn_chicken_tacos_97105_16x9.jpg", "ingredients": ["2 garlic cloves, crushed or finely grated", "1 orange, zest and juice only ", "2 large limes, zest and juice only ", "2 tbsp Mexican hot chilli sauce", "2 tbsp tomato purée", "1 tsp dried oregano", "1 tsp ground cumin", "1 tsp flaked sea salt or ½ tsp fine salt", "1 tsp freshly ground black pepper", "6 boneless, skinless chicken thigh fillets, fat trimmed", "4 corn tortillas, warmed, to serve", "2 Little Gem lettuces, leaves separated, rinsed and dried, to serve", "1 ripe avocado (about 150g/5½oz), stoned, peeled and sliced, to serve", "soured cream or reduced-fat crème fraîche, to serve", "1 red onion, finely sliced ", "1 tbsp white or red wine vinegar", "1 tbsp caster sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the marinade, place all the ingredients into a large bowl and mix well. Add the chicken and turn several times until well coated. Cover the bowl and put in the fridge to marinate for 30–60 minutes. ", "Preheat the oven to 220C/200C Fan/Gas 7. Line a large baking tray with baking paper. Place the marinated chicken on the prepared tray. ", "Brush the chicken generously with more of the marinade. Roast in the preheated oven for 20–25 minutes, or until the chicken is tender and cooked through and the marinade is slightly charred in places. The chicken is cooked through when the juices run clear with no trace of pink when the thickest part of the fillet is pierced with a skewer.", "Meanwhile, make the pickled red onion. Put the onion in a heatproof bowl. Cover with just-boiled water and leave to stand for 10 minutes. Drain well and then stir in the vinegar and caster sugar. Leave to stand for at least 10 minutes before draining and serving. ", "Transfer the chicken to a board and tear into pieces with two forks. To serve, place the chicken on the warmed tortillas and top with the lettuce, avocado, pickled onions and soured cream. "]}, {"isVegetarian": true, "title": "Yule log", "url": "www_bbc_co_uk_food_recipes_yule_log_15656", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/yule_log_15656_16x9.jpg", "ingredients": ["4 large free-range eggs", "100g/3½oz caster sugar", "65g/2½oz self-raising flour", "40g/1½oz cocoa powder", "300ml/½ pint double cream ", "300g/10½oz dark chocolate (around 35-40% cocoa solids), broken into small pieces", "300ml/½ pint double cream, whipped ", "icing sugar, for dusting", "a toy robin or sprig of holly"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Lightly grease a 33x23cm/13x9in Swiss roll tin, and line with non-stick paper or baking parchment, pushing it into the corners. ", "For the sponge, in a large bowl whisk the eggs and sugar using an electric hand whisk until the mixture is pale in colour, light and frothy. Sift the flour and cocoa powder into the bowl and carefully cut and fold together, using a spatula, until all the cocoa and flour are incorporated into the egg mixture. (Be careful not to beat any of the air out of the mixture).", "Pour the mixture into the lined tin and spread evenly out into the corners. Bake in the middle of the preheated oven for 8–10 minutes, or until well risen and firm to the touch and the sides are shrinking away from the edge of the tin. ", "Place a piece of baking parchment bigger than the Swiss roll tin on the work surface. Dust with icing sugar generously. Carefully invert the cake onto the paper and remove the bottom lining piece of paper. ", "Cut a score mark 2.5cm/1in in along one of the longer edges. Starting with this edge, begin to tightly roll up the sponge using the paper. Roll with the paper inside and sit the roll on top of its outside edge to cool completely. ", "While the cake is cooling, make the ganache topping. Heat the cream in a pan, just so as you can keep your finger in it. Remove from the heat and add the chocolate, stirring until it is melted.  Cool to room temperature, then put into the fridge to firm up (this icing needs to be very thick for piping). ", "Uncurl the cold Swiss roll and remove the paper. Spread the whipped cream on top, and re-roll tightly. Cut a quarter of the cake off from the end on the diagonal. Transfer the large piece of cake to a serving plate and angle the cut end in to the middle of the large cake to make a branch. ", "Put the chocolate icing into a piping bag fitted with a star nozzle. Pipe long thick lines along the cake, covering the cake completely so it looks like the bark of a tree. Cover each end with icing or, if you wish to see the cream, leave un-iced.  Alternatively, just use a palette knife to spread on the icing and create rough bark texture with a fork.", "Dust with icing sugar and garnish with fresh holly or a little robin to serve. "]}, {"isVegetarian": false, "title": "Yule logs", "url": "www_bbc_co_uk_food_recipes_yule_logs_06457", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "4 large free-range eggs, separated", "100g/3½oz caster sugar", "2 oranges, finely grated zest only", "70g/2½oz self-raising flour", "30g/1oz cocoa powder", "50g/1¾oz caster sugar", "2 tbsp orange-flavoured liqueur", "100ml/3½fl oz double cream", "100g/3½oz dark chocolate, chopped", "15g/½oz unsalted butter", "2 drops orange extract", "200g/7oz mascarpone ", "300ml/10fl oz double cream", "2 tbsp caster sugar", "10 cardamom pods, seeds removed and crushed", "100g/3½oz, hazelnuts, chopped and toasted", "gold dust "], "serves": "", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line two 33x22cm/13x9in Swiss roll tins.", "For the cake, put the egg yolks in a bowl and beat using an electric handheld whisk for 2 minutes. Sprinkle over the sugar and whisk for 3–5 minutes, or until pale, creamy and tripled in size. Add the orange zest and sieve over the flour and cocoa, then very carefully fold it all in. ", "Put the egg whites in a clean, glass bowl and whisk using an electric handheld whisk until stiff peaks form. Fold the whites into the cake batter. ", "Spread the mix into the prepared tins and bake for 12–15 minutes. Cut each cake in half lengthways and turn out onto a piece of baking paper. Roll each one up using a tea towel and leave to cool.", "For the syrup, put the sugar and 50ml/2fl oz water in a saucepan over high heat and cook until the sugar has dissolved. Add the orange liqueur and set aside to cool. ", "For the ganache, heat the cream in a saucepan until just hot enough to melt the chocolate. Put the chocolate in a heatproof bowl and pour the cream over it. Mix until the chocolate has melted. Mix in the butter and orange extract. Cover and chill in the fridge until set. ", "For the cream filling, whisk the mascarpone, cream, sugar and cardamom together until soft peaks form. Set aside.", "To assemble, unroll each cake half and cut into three 7½x5½cm/3x2in pieces. Brush the syrup over the pieces. Spread the cream on each piece, pipe a layer of ganache along the middle and roll up the cakes. Cover the top of the cakes with more cream.", "In a bowl mix the hazelnuts and gold dust and give it a good shake. Sprinkle these over the cakes and slice the ends of each one for a neat finish."]}, {"isVegetarian": false, "title": "Yunnanese seared beef with mint, fermented chilli bean, lime and lemongrass dressing", "url": "www_bbc_co_uk_food_recipes_yunnanese_seared_beef_63361", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz well-marbled, dry-aged rib-eye beef", "1 tbsp vegetable oil", "100g/3½oz butter", "5cm/2in piece cucumber, peeled and chopped into bite-sized pieces", "12 mint leaves, deep-fried, plus 8 fresh mint leaves to garnish", "salt and white pepper", "2 tbsp white rice vinegar", "2 tbsp clear honey", "1 tsp chopped lemongrass", "pinch salt", "pinch white pepper", "1 tbsp lime juice", "1 tsp fermented chilli bean paste"], "serves": "Serves 2 as a main or 4 as a starter", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a dry, heavy-based frying pan until extremely hot. Rub the beef with the oil, season with salt and pepper and sear on both sides until you have a brown crust. Add the butter to the pan and baste the beef with the melted butter for 1-5 minutes, depending on how well-done you like your beef. Remove the beef from the pan and leave to rest for 10 minutes.", "For the dressing, combine all the ingredients in a saucepan and warm gently.", "Slice the beef into thin slices and pour over the dressing, then scatter over the cucumber pieces and the deep fried mint leaves. To finish, scrunch up the fresh mint leaves in your hand to release the aroma and scatter them over the beef."]}, {"isVegetarian": false, "title": "Yusheng smoked salmon ‘prosperity’ salad", "url": "www_bbc_co_uk_food_recipes_yusheng_smoked_salmon_03937", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 stick cinnamon ", "1 star anise", "2 ripe plums, stones removed, quartered", "2 tbsp demerara sugar ", "2 limes, juice only", "50g/1¾oz mung bean or rice vermicelli noodles ", "1 tsp toasted sesame oil ", "4 pickled beetroots, grated ", "1 medium carrot, spiralized into noodles", "1 cucumber, spiralized into noodles ", "1 daikon or white turnip, spiralized into noodles", "1 pomelo (or 1 pink grapefruit), peeled and separated into segments", "2 spring onions, sliced into long strips, dipped in ice water for spring onion curls (optional) ", "4 slices smoked salmon", "1 handful peanuts, toasted ", "5 wonton wrappers, deep-fried, seasoned with salt and ground white pepper"], "serves": "Serves 2-3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["In a small pan, add all the ingredients for the plum sauce with 200ml/7fl oz water. Cook until the liquid has turned syrupy and pink. Sieve the liquid and set aside to cool. Stir in the lime juice and store in the fridge until ready to serve.", "For the salad, cook the mung bean noodles according to the packet instructions. Drain, dress with the toasted sesame oil and keep chilled in the fridge. ", "Prepare all the other salad ingredients and keep them chilled in the fridge until ready to serve. ", "To assemble the dish, divide the salad ingredients between serving plates, separated out, not mixed. Layer the smoked salmon slices to resemble a rose decoration in the centre. ", "Before serving, drizzle the plum sauce over the top and sprinkle with peanuts. Let everyone toss the ingredients as high as possible with chopsticks, without it falling off the plate, saying aloud auspicious phrases for prosperity! Break over the wonton wrappers and serve immediately."]}, {"isVegetarian": false, "title": "Yuzu mayonnaise with chicken goujons", "url": "www_bbc_co_uk_food_recipes_yuzu_mayonnaise_with_25805", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs, yolks only", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "500ml/18fl oz rapeseed or light olive oil", "1-2 tsp yuzu juice, to taste", "2 tbsp chilli dipping sauce", "salt and freshly ground black pepper", "4 boneless and skinless chicken breasts, cut into strips", "50g/2oz plain flour", "3 free-range eggs, beaten", "125g/4½oz fresh fine breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the egg yolks, vinegar and mustard into a food processor. Blend to combine then, with the motor still running, gradually add the oil.", "Continue blending until all the oil has been added and the mayonnaise has thickened. Season with the yuzu juice, chilli dipping sauce, salt and freshly ground black pepper.", "Heat a deep-fat fryer to 190C/375F, or heat 1 litre/1¾ pints vegetable oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Don't leave unattended).  \r\nSet up three bowls, one containing the flour, another the beaten eggs and the third, breadcrumbs. Place a few chicken strips at at time first into the flour, coat them and pat off the excess, then dip them into the egg. Coat thoroughly in egg, then put into the breadcrumbs. Coat thoroughly again. Do this in batches, making sure the chicken is well coated in each.", "Place a few of the goujons in the fryer and cook for about 2-3 minutes, until crisp and golden-brown. Drain on kitchen paper and repeat until all the goujons are cooked.", "To serve, pile the chicken goujons on to the plate and finish with a dollop of yuzu mayonnaise."]}, {"isVegetarian": false, "title": "Za’atar chicken with chickpeas and garlic yoghurt", "url": "www_bbc_co_uk_food_recipes_zaatar_chicken_with_26334", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/zaatar_chicken_with_26334_16x9.jpg", "ingredients": ["3 tbsp za’atar", "6 tbsp olive oil", "4 chicken thighs ", "2 tbsp sesame seeds", "2 x 400g tins chickpeas, drained and rinsed", "6 garlic cloves, peeled", "250ml/9fl oz thick plain yoghurt ", "20 small mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Mix the za’atar with the oil in a small bowl.", "Put the chicken in a deep roasting tray, brush with the za’atar glaze and scatter over the sesame seeds. Add the chickpeas and garlic and bake for 30–40 minutes.", "Remove the tray from the oven, take the garlic out and set aside. Brush the chicken with the za’atar oil that has gathered at the bottom of the tray.", "Return the chicken to the oven for a further 15–20 minutes.", "Pound the roasted garlic into a paste using a mortar and pestle. Scrape the garlic paste into a bowl, then mix in the yoghurt.", "Serve the chicken on bed of chickpeas, with the garlic yoghurt drizzled over and the mint leaves scattered on top."]}, {"isVegetarian": false, "title": "Za’atar cod with relish", "url": "www_bbc_co_uk_food_recipes_zaatar_cod_with_relish_98478", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/zaatar_cod_with_relish_98478_16x9.jpg", "ingredients": ["2 heaped tbsp Za’atar ", "4 tbsp olive oil, plus extra for frying", "400g/14oz prime cod fillet or loin (or a different firm white fish), cut in to 4 pieces", "sea salt", "24 Kalamata olives, stones removed", "6 preserved lemons, halved and roughly chopped", "8 pickled chillies, thinly sliced", "1 small bunch of coriander, roughly chopped", "olive oil "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the za’atar with the olive oil in a small bowl to create a paste. Smear this paste over the cod pieces, ensuring they are well coated. Season each piece of fish with a pinch of salt. Place in a non-reactive container and leave to marinade in the fridge for 30 minutes.", "For the relish, place all the ingredients in a bowl and mix well. Do not season the mixture with salt as it will already have a salty taste. ", "Heat a large frying pan over a medium heat, then drizzle in a generous amount of olive oil. ", "Fry the cod for about 8 minutes on one side and 3-4 minutes on the other side. The cod should be golden-brown with a nice spice crusting. ", "Serve the cod with a generous helping of the relish."]}, {"isVegetarian": true, "title": "Zabaglione al Prosecco", "url": "www_bbc_co_uk_food_recipes_zabaglionealprosecco_88982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 free-range egg yolks", "100g/3½oz caster sugar", "175ml/6fl oz Prosecco"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a heatproof bowl over a pan of barely simmering water and place the egg yolks and sugar into it. Make sure the base of the bowl does not touch the simmering water.", "Using an electric whisk, start whisking the egg yolks and sugar in the bowl over the simmering water. The mixture will become pale and thick like whipped double cream, and it should triple in volume and be very frothy. This could take up to 15 minutes but it's worth the wait.", "Continue whisking and slowly pour in the Prosecco.", "Pour the zabaglione into eight dessert glasses and serve immediately."]}, {"isVegetarian": false, "title": "Zanzibar chicken", "url": "www_bbc_co_uk_food_recipes_zanzibarchicken_85461", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp groundnut oil", "1 large chicken, jointed into 8 pieces, skin on", "2 onions, finely chopped", "3 garlic cloves, crushed ", "2 green chillies, chopped", "3 green or red tomatoes, finely chopped", "½ tsp ground turmeric", "½ tsp cumin seeds", "½ tsp coriander seeds", "4 green cardamom pods", "2 limes, juice only", "275ml/½ pint chicken stock", "2 x 400ml/14fl oz cans coconut milk", "1 bunch basil", "cooked basmati rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep-sided frying pan until hot and add the oil and then the chicken.", "Fry on each side for about one minute, until the meat is browned all over. Remove the meat from the pan and set aside on a plate.", "Add the onions, garlic, one of the chillies and the green (or red) tomatoes and cook for about five minutes.", "Meanwhile, place the turmeric, cumin seeds, coriander seeds and cardamom pods into a pestle and mortar and grind until fine.", "Add the ground spices to the onion and tomato mixture. Add the lime juice.", "Add the chicken stock and coconut milk to the pan and bring to the boil.", "Return the chicken to the pan and simmer for 20 minutes, until the chicken is cooked through.", "Place the remaining chilli and the basil into the pestle and mortar and grind to a paste.", "Add the chilli and basil paste to the chicken at the last minute and season to taste. ", "Serve hot with basmati rice."]}, {"isVegetarian": true, "title": "Zesty mango salsa with Italian poached meringue", "url": "www_bbc_co_uk_food_recipes_zesty_mango_salsa_with_10570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large mango (firm but ripe), peeled, stone removed, flesh cut in half lengthways", "2 limes, juice and zest", "1 small bunch fresh mint leaves, finely chopped (reserve a few small whole leaves to garnish)", "1 vanilla pod, seeds only (see below)", "200g/7oz caster sugar", "200ml/7fl oz cold water", "2 tbsp liquid glucose", "5 free-range egg whites", "400ml/14fl oz milk", "1 vanilla pod, pod only (see above)", "jalebi sweets, to serve (available from Indian supermarkets, optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Roughly chop one half of the mango and blend to a purée with the lime juice in a food processor.", "Finely dice the remaining mango half and place into a mixing bowl. Add the chopped mint, lime zest and vanilla seeds and mix well. Pour over the mango purée and mix again.", "For the poached meringue, in a small pan, dissolve the sugar in the water and liquid glucose, then gradually bring to the boil. As soon as the mixture is boiling, reduce the heat to low.", "Pass a clean pastry brush around the insides of the pan to remove any sugar crystals that have formed.", "Heat the sugar mixture to 115C/239F using a sugar thermometer (this is called the softball stage and should take 10-15 minutes). (Caution: do not overheat the sugar mixture and do not leave it unattended.)", "Meanwhile, whisk the egg whites in a clean, grease-free bowl until soft peaks form when the whisk is removed.", "Increase the speed of the beaters and, with the motor constantly running, pour a thin stream of the hot sugar mixture into the whisked egg whites, whisking as you pour. Once all of the sugar mixture has been added to the egg whites, continue to whisk the meringue mixture for 10-15 minutes, until it is thick, glossy and cold.", "Bring the milk and the vanilla pod to the boil in a saucepan, then reduce the heat to a gentle simmer.", "Make a quenelle of meringue mixture by creating a ball of meringue using two dessert spoons to smooth it into shape.", "Lower the quenelle of meringue into the simmering milk and poach gently for 2-3 minutes. Turn over and poach the other side for a further 1-2 minutes, then remove the poached meringue from the milk using a slotted spoon and set aside. Keep warm. Repeat the process with the remaining meringue mixture, cooking the quenelles in batches.", "To serve, divide the mango salsa among four dessert dishes. Float the poached merigues on top. Garnish with a jalebi sweet, if using."]}, {"isVegetarian": false, "title": "Zesty chilli tiger prawns", "url": "www_bbc_co_uk_food_recipes_zestychillitigerpraw_89289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp groundnut oil or vegetable oil", "5 garlic cloves, finely chopped", "1 red chilli, finely chopped", "200g/7oz raw tiger prawns, shelled and de-veined ", "1 tbsp Shaoxing rice wine or dry sherry", "1 lime, juice only", "75g/3oz French beans, topped and tailed, chopped into 1cm/½in pieces", "pinch sea salt", "1 tsp dried chilli flakes"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add the groundnut oil, then add the garlic and chilli and stir fry for a few seconds. Add the prawns, rice wine and lime juice and stir fry for 2-3 minutes, or until the prawns start to turn pink. ", "Add the French beans and stir fry for another 2-3 minutes, or until the prawns are cooked through. Season, to taste, with the salt and chilli flakes.", "Pile the chilli prawns onto a serving plate and serve immediately."]}, {"isVegetarian": true, "title": "Zesty tofu cheesecake", "url": "www_bbc_co_uk_food_recipes_zesty_tofu_cheesecake_84103", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/zesty_tofu_cheesecake_84103_16x9.jpg", "ingredients": ["200g/7oz digestive biscuits, crushed", "75g/3oz butter or vegan margarine, melted", "1 lemon, zest and juice ", "200ml/7fl oz limoncello liqueur", "3 tbsp agar-agar ", "400g/14oz firm tofu", "1 tbsp vegan cream cheese", "400g/14oz coconut cream", "few drops vanilla essence", "115g/4oz caster sugar", "fresh berries or berry sauce, to serve"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix the crushed biscuits with the butter or margarine. Press the mixture into the base of a 20cm/8in round springform cake tin.", "In a pan set over a very low heat, add the lemon juice, limoncello, a splash of water and the agar-agar. Stir until the agar-agar has dissolved.", "In a food processor, combine the tofu, cream cheese, coconut cream, a splash of vanilla essence, sugar and lemon zest. Blend until smooth.", "Pour the tofu mixture over the biscuit base and smooth the surface. Chill in the fridge for an hour until set. Serve with fresh berries or a berry sauce."]}, {"isVegetarian": true, "title": "Zingy citrus Madeira cake", "url": "www_bbc_co_uk_food_recipes_zingy_citrus_madeira_11462", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "150g/5½oz unsalted butter, plus extra for greasing ", "3 free-range eggs", "200g/7oz self-raising flour, plus extra for dusting ", "pinch salt", "2 oranges, finely grated zest only", "1 large unwaxed lemon, finely grated zest only", "1 large orange, rind and juice only", "1 large unwaxed lemon, rind and juice only", "75g/2½oz caster sugar", "150g/5½oz icing sugar"], "serves": "Makes 1 large loaf cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/165C Fan/Gas 4. Grease a 900g/2lb loaf tin with butter and line with baking parchment. ", "In a bowl, cream the sugar and butter until pale and fluffy.  Add eggs one at a time, beating between each addition. Fold in the flour, a pinch of salt and the citrus zests. ", "Pour the batter into the prepared tin, smooth the surface and bake for 1 hour. Check the cake after 40 minutes, if it is starting to brown too much cover with aluminium foil for the remaining cooking time. The cake is cooked when a skewer inserted into the centre comes out clean.", "Leave the cake to cool in the tin while you make the sugar syrup.", "To decorate, cut the lemon and orange rind into very thin strips. Add 100ml/3½fl oz water and the caster sugar to a saucepan over a low heat, stir gently until the sugar is dissolved. Bring to the boil then add the rind to the pan, reserve a few strips of rind for decoration. Cook for about 5 minutes until a syrup forms and the rind is translucent. ", "Brush the syrup over the still-warm cake and set aside to cool completely. When the cake is completely cold, remove it from the tin. ", "To make the icing, mix the citrus juices. Mix the icing sugar with enough juice to make a thin icing. Drizzle the icing over the cooled cake and finish with a few thin strips of citrus rind."]}, {"isVegetarian": false, "title": "Zoe’s jollof", "url": "www_bbc_co_uk_food_recipes_zoes_jollof_43216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 bone-in chicken thighs or drumsticks", "1 large onion, roughly chopped", "1 Scotch bonnet chilli, de-seeded, finely chopped", "1 tbsp fresh or dried thyme leaves", "2 tbsp crayfish powder (available from online specialists)", "6 Guinea peppers (also known as grains of paradise), crushed", "6 large tomatoes, roughly chopped", "200g/7oz tomato purée", "1 tsp salt", "4 tbsp peanut oil or sunflower oil ", "1 large onion, finely chopped", "2 garlic cloves, crushed", "1 tsp ground hot chilli powder", "300g/10½oz long-grain white rice, washed and drained", "handful chopped fresh parsley and coriander, to garnish "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C fan/Gas 4.", "For the broth, heat a deep-sided, heavy-based casserole or saucepan over a low heat. Add all of the broth ingredients, then pour in just enough water to cover them and bring to the boil. Reduce the heat until the mixture is simmering, then simmer for 18-20 minutes, or until the chicken is tender and cooked through. (The chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part and no traces of pink remain.)", "Remove the cooked chicken from the casserole and transfer to a baking tray. Cover with aluminium foil and keep warm.", "Strain the broth, collecting the strained liquid in a large jug. Set aside and keep warm.", "For the tomato sauce, blend the chopped tomatoes, tomato purée and salt to a smooth purée in a food processor. Set aside.", "For the jollof sauce, heat the oil in a lidded saucepan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened. ", "Add the garlic and chilli powder and continue to fry for a further 4-5 minutes, stirring well. Stir in the tomato sauce and the reserved broth until well combined.", "Add the rice and stir to coat it in the sauce. Reduce the heat until the mixture is just simmering, cover the pan with a sheet of aluminium foil, then place the lid on top. Simmer for 30 minutes, or until the rice is tender and has absorbed all the liquid. ", "Halfway through cooking the jollof rice, finish the chicken. Remove the foil from the chicken and roast in the oven for 15 minutes, or until browned and sticky. ", "Serve the jollof rice with the chicken, garnished with a sprinkling of chopped parsley and coriander."]}, {"isVegetarian": true, "title": "Zombie punch", "url": "www_bbc_co_uk_food_recipes_zombiepunch_84334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 tbsp dark brown sugar", "300ml/10½fl oz lemon juice", "300ml/10½fl oz white rum ", "300ml/10½fl oz gold rum ", "300ml/10½fl oz demerara rum (preferably 151 proof) ", "300ml/10½fl oz pineapple juice", "300ml/10½fl oz lime juice ", "300ml/10½fl oz passion fruit syrup ", "8-10 dashes bitters", "1 pineapple", "1 large pumpkin, top removed and flesh and seeds carved out and discarded, optional", "1 lemon, cut into eight pieces", "1 lime, cut into eight pieces"], "serves": "Makes  3 litres", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the brown sugar and the lemon juice into a jug and stir to dissolve. ", "Place the lemon mixture and all the other ingredients into a large bowl and stir well. ", "Either serve the punch in the bowl or pour into the hollowed-out pumpkin. Add the lemon and lime pieces and serve."]}]