[{"ingredients": ["250g / 9oz de harina blanca fuerte", "25 g / 1 oz de azúcar en polvo, más 75 g / 2½ oz para quitar el polvo", "pizca de sal", "25g / 1oz de mantequilla, ablandada", "Levadura seca de acción rápida de 14 g / ½ oz", "aceite, para freír", "75 g / 2½ oz de azúcar en polvo", "2 cucharadas de aguardiente", "1 naranja, solo jugo", "½ x 400 g / 12 oz de durazno en rodajas de durazno, escurrido", "Almendras en copos de 25g / 1oz", "25 g / 1 oz de pistachos", "Frambuesas 100g / 3½ oz", "500 g / 1 libra de helado de vainilla de 2 onzas"], "method": ["Para las donas, coloca la harina, el azúcar, la sal y la mantequilla en un tazón. Coloque la levadura en una jarra y mezcle con 150 ml / 5 fl oz de agua hasta que quede suave, luego vierta en la mezcla de harina.", "Mezcle bien, luego amase hasta que se forme una masa suave.", "Guarde en un tazón, cúbralo y descanse durante una hora hasta que duplique su tamaño.", "Cuando la masa haya demostrado, caliente el aceite en una freidora a 150 ° C / 300 ° F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Tome pedazos del tamaño de una pelota de golf de la masa y ruede en bolas.", "Con cuidado, baje las bolas de masa en el aceite caliente en lotes y fría durante 3-4 minutos, o hasta que estén doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Rodar en el azúcar reservado.", "Para la salsa, caliente una sartén hasta que esté caliente, agregue el azúcar en polvo y caliente hasta que se forme un caramelo, girando ocasionalmente para combinar el azúcar con el azúcar derretida.", "Agregue el brandy y flambeando al encender la mezcla. Deje que las llamas se enciendan y luego se apaguen. (PRECAUCIÓN: asegúrese de que no haya materiales inflamables por encima de la sartén cuando llamea). Agregue el jugo de naranja y agite para combinar.", "Agregue los duraznos en lata, las almendras en copos, las nueces de pistacho y las frambuesas y caliéntelas durante dos minutos solamente; no desea dejar que las frambuesas se rompan.", "Para servir, coloque dos bolas de helado en cada uno de los cuatro cuencos, agregue unas rosquillas y luego vierta la salsa sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_peach_melba_with_sugar_32731", "title": "Melba de melocotón con donas tostadas con azúcar y helado de vainilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 melocotones maduros", "2 cucharadas de aguardiente", "2 cucharadas de azúcar mascabado ligero", "300 ml / 10 fl oz doble crema", "75g / 2½fl oz de azúcar en polvo", "1 limón grande sin cera, ralladura fina y jugo solamente", "borraja o hojas de menta, para decorar"], "method": ["Coloque los melocotones en un recipiente con agua hirviendo durante 30 segundos, o hasta que la piel comience a desprenderse. Retire con cuidado del recipiente y sumerja de inmediato en agua fría. Seca y despega la piel.", "Cortar la carne de durazno en 5 mm / ¼ en cubos. Poner en un bol y agregar el brandy y el azúcar mascabado ligero. Mezcle bien, luego divídalo entre ocho vasos pequeños o vasos de agua bonitos.", "Mientras tanto, agregue la crema en una cacerola de fondo grueso, agregue el azúcar impalpable, la ralladura de limón y el jugo y caliente a fuego medio, revolviendo hasta que el azúcar se haya disuelto. Cocine a fuego lento durante 2 minutos mientras revuelve, luego vierta en una jarra y deje enfriar hasta que esté tibio.", "Vierta la crema de limón en los vasos sobre la fruta. Transfiera al refrigerador para establecer por lo menos 4 horas, o idealmente durante la noche.", "Decorar con flores de borraja o menta."], "url": "www_bbc_co_uk_food_recipes_peach_posset_80865", "title": "melocotón podía", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Rinde 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peach_posset_80865_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de azúcar moreno claro y suave", "Melocotones de 200 g / 9 oz, sin piedras, picados", "Albaricoques de 150g / 5oz, piedras removidas, picadas", "1 vaina de vainilla, partido, semillas raspadas", "1 cucharada de mantequilla", "250 g / 9 oz de hojaldre laminado", "1 huevo de gallinas camperas, ligeramente golpeado", "100 g / 3½ oz de azúcar en polvo, para rociar", "salsa de caramelo lista para usar", "nata", "frambuesas frescas"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Coloque el azúcar en una sartén antiadherente a fuego medio-bajo. Deje que se derrita (evite remover el azúcar hasta que lo haya hecho), luego cuando el azúcar comience a caramelizar y se ponga dorado, agregue la fruta, las semillas de vainilla y la mantequilla. Revuelva y cocine durante 1-2 minutos más, luego retírelo del fuego.", "Coloque la masa de hojaldre en una superficie de trabajo limpia y corte círculos de 15 cm en un cortador (la masa producirá alrededor de 4 a 6 círculos). Coloque una cucharada de la mezcla de fruta en la mitad de cada círculo, luego cepille los bordes con el huevo batido y doble la otra mitad de la masa. Selle los bordes, luego cepille todo el paquete con el huevo batido. Prensar los bordes con un tenedor y espolvorear con azúcar. Coloque los paquetes de repostería en una bandeja de horno.", "Hornee las hojaldres en el horno durante 13-15 minutos, o hasta que estén doradas.", "Para servir, coloque los bocaditos de melocotón y albaricoque en los platos para servir y una cucharada de crema coagulada al lado. Rocíe con salsa de caramelo y adorne el plato con algunas frambuesas."], "url": "www_bbc_co_uk_food_recipes_peachandapricotpuffs_91845", "title": "Melocotones y albaricoques", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 hojas de gelatina de hoja", "agua fría, para cubrir", "1 botella de 750ml / 1¼ pinta de botella de champán", "1 limón, solo jugo", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de hojas de albahaca fresca en rodajas finas", "Melocotones 400g / 14oz, picados", "8 ramitas de albahaca fresca", "8 fresas pequeñas"], "method": ["Coloque las hojas de gelatina en un recipiente y cúbralas con agua fría.", "Mientras tanto, vierta 150ml / 5fl oz del champán en una sartén con el jugo de limón y el azúcar y caliente suavemente, revolviendo frecuentemente para disolver el azúcar.", "Retire la gelatina del agua fría, exprimiendo el exceso de agua, luego agregue a la sartén y bata hasta que se disuelva. Pase la mezcla a través de un colador en un recipiente y deje que se enfríe un poco.", "Agregue el champán restante y la albahaca a la mezcla y revuelva. Deja hasta que la gelatina esté fría y justo en el punto de ajuste.", "Para servir, divida los melocotones picados por igual entre ocho copas de champán y vierta cuidadosamente la gelatina de fijación. Cubra cada gelatina con una ramita de albahaca fresca y una fresa."], "url": "www_bbc_co_uk_food_recipes_peachandchampagnejel_86313", "title": "Melocotón y jalea de champán", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla", "½ melocotón, pelado y picado", "1 tomate, sin semillas y picado", "1 chalote, finamente picado", "2 cucharadas de vinagre de vino blanco", "1 cucharada de vino blanco", "1 cucharada de miel"], "method": ["En una cacerola pequeña caliente la mantequilla.", "Agregue el melocotón y el tomate y cocínelos durante 2-3 minutos o hasta que empiecen a ablandarse. Agregue el vinagre de vino blanco, el vino blanco y la miel y cocine rápidamente por otros cinco minutos.", "La salsa picante está lista, una vez que las frutas se han roto un poco y el líquido se ha reducido."], "url": "www_bbc_co_uk_food_recipes_peachandtomatochutne_75792", "title": "Chutney de melocotón y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2 oz de mermelada de azúcar", "1 limón, solo jugo", "1 kg / 2 lb 4 oz melocotones frescos, pieles y piedras retiradas, cortadas en trozos", "Harina de 175gm / 6oz", "25 g / 1 oz de azúcar en polvo", "85g / 3oz de sebo triturado", "125-150 ml / 4-5 fl oz de agua", "Mermelada de durazno 150 g / 5 oz", "Frambuesas 75g / 3oz", "85g / 3oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "4 cucharadas de almendras en copos, tostadas", "helado de vainilla"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Coloque dos tarros de mermelada limpios en el horno para calentar y esterilizar.", "Para la mermelada, coloque el azúcar y el jugo de limón en una sartén grande a fuego lento y caliente hasta que el azúcar se haya derretido.", "Agregue los melocotones y revuelva suavemente. Aumente el fuego para llevar a ebullición y cocine durante diez minutos. Verifique la temperatura con un termómetro de azúcar: debería alcanzar los 105 ° C / 220 ° F.", "Deje que se enfríe un poco, quitando cualquier espuma con una cuchara limpia, para evitar que el atasco se vuelva turbio.", "Retire con cuidado las jarras de atasco de calor del horno. Coloque la mermelada en los frascos estériles, selle y etiquete con la fecha. Deberían quedarse durante unos meses en un lugar fresco y oscuro.", "Para el roly-poly, coloque la harina, el azúcar y el sebo en un recipiente y mezcle bien. Haga un pozo en el centro de la mezcla y gradualmente agregue suficiente agua, mezclando desde el centro, hasta que se forme una masa suave.", "Convierta la masa en una superficie de trabajo enharinada y amasar ligeramente hasta que quede suave. Ruede la masa en una forma oblonga de aproximadamente 1 cm / ½ pulgada de grosor.", "Deslice la masa en una hoja de papel resistente a la grasa.", "Extienda la mermelada de melocotón en la masa, dejando un borde de 2,5 cm en todo alrededor, luego agregue las frambuesas uniformemente a través del atasco.", "Enrolle la masa en un molinillo, manteniendo el papel antigrasa en el exterior, hasta que todos los pasteles estén encerrados. Enrosque los extremos del papel resistente a la grasa.", "Coloque el paquete en un barco de vapor de bambú o metal, luego colóquelo sobre una fuente grande de agua hirviendo. Reduzca el calor y el vapor durante una hora, o hasta que la masa esté completamente cocida.", "Para servir, coloque el azúcar y el agua en una cacerola a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento hasta que el azúcar se haya derretido y el líquido se haya vuelto de color caramelo claro.", "Rocíe el caramelo sobre cada plato y cubra con una cucharada de helado y una dispersión de almendras tostadas.", "Corte el roly-poly en rebanadas gruesas y colóquelo junto a cada porción de helado."], "url": "www_bbc_co_uk_food_recipes_peachandraspberryrol_86416", "title": "Melcocha y frambuesa roly-poly con helado de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de harina normal", "4 yemas de huevo de gallinas camperas", "600 ml / 1 litro de leche", "4-6 cucharadas de azúcar en polvo", "harina, para quitar el polvo", "450 g / 1 libra de hojaldre confeccionado", "1 huevo de gallinas camperas, golpeado", "8 melocotones frescos, en rodajas", "50g / 2oz de mantequilla, derretida, más extra para engrasar", "50g / 2oz de mantequilla", "Azúcar demerara 50 g / 2 oz", "Harina normal de 100 g / 3½ oz", "helado de vainilla listo para usar", "ramitas de menta fresca"], "method": ["Para la crème patissière, coloque la harina y las yemas de huevo en un tazón grande y bata hasta que quede suave.", "Calentar la leche y el azúcar en una sartén y llevar lentamente a ebullición.", "Vierta la mezcla de leche en la mezcla de yema de huevo, revolviendo constantemente. Mezcle bien, luego devuelva la mezcla a la sartén.", "Revuelva a fuego lento hasta que la mezcla se espese, luego retire del fuego y reserve.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para las tartas, extienda la masa en una superficie ligeramente enharinada, luego pellizque ligeramente con un tenedor. Recorta 4 rondas de 15cm / 6in y colócalas en la nevera para que descansen de 10 a 15 minutos.", "Retire los panecillos de la nevera. Engrase ligeramente una bandeja para hornear antiadherente y coloque los discos de pastelería en la bandeja para hornear.", "Ligeramente cepille los bordes de las rondas de repostería con el huevo batido y esparza una cucharada de la crema pastelera en el medio de cada disco.", "Coloque los melocotones en rodajas encima de la crema pastelera y rocíe sobre la mantequilla derretida.", "Transfiera las tartas al horno y hornee durante 8-10 minutos.", "Mientras tanto, para la cobertura de crumble, coloque todos los ingredientes de la migaja en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Retire las tartas del horno y espolvoree sobre la mezcla de crumble. Regrese al horno por 10-15 minutos o hasta que se dore.", "Para servir, retire las tartas del horno y colóquelas en cuatro platos para servir, adornadas con una cucharada de helado y una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_peachcrumbletartwith_85165", "title": "Tartas de crumble de melocotón con helado de vainilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de yogur griego", "100ml / 3½ fl oz de leche", "Azúcar en polvo de 65 g / 2½ oz", "Azúcar en polvo de 65 g / 2½ oz", "75g / 3oz de mantequilla", "65 g / 2½ oz de harina", "25g / 1 oz de harina de maíz", "20 g / 1 oz de almendra molida (opcional)", "1 kg / 2¼ lb de fresas", "100g / 3½ oz de azúcar", "Gelatina 6g / ¼ oz", "melocotones (suficiente para ½ por persona)", "nectarinas (suficiente para ½ por persona)", "80g / 3oz de pistacho toscamente picado", "azúcar de vainilla"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Para el sorbete de yogur, mezcle todos los ingredientes y revuelva en una máquina para hacer helados.", "Para hacer la masa de crumble, mezcle todos los ingredientes y divida la mezcla en trozos del tamaño de una pepita. Ponga una bandeja para hornear y ponga en el horno durante 8-10 minutos.", "Para la gelatina, ponga las fresas y el azúcar en un baño María y caliente suavemente durante 2 horas.", "Deje que el jugo se cuele a través de una tela de muselina en un recipiente durante 2 horas.", "Derretir la gelatina y agregar al jugo. Déjalo en la nevera.", "Lave la fruta, córtela en trozos pequeños y espolvoree con azúcar de vainilla. Agregue los pistachos, el crumble y la mermelada de fresa. Cubra con sorbete."], "url": "www_bbc_co_uk_food_recipes_peachesandnectarines_13612", "title": "Melocotones y nectarinas crumble con sorbete de yogur", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cabezas de lavanda frescas sin pulverizar, enjuagadas", "1 limón no encerado, cáscara pelada de la fruta en tiras largas", "8 duraznos maduros y firmes, pelados, sin piedras, rebanados", "375ml / 13fl oz Sauternes, o vino de postre dulce similar, refrigerado", "crema fresca, para servir (opcional)"], "method": ["Coloque las rebanadas de melocotón en el fondo de un plato de servir grande. Espolvorea sobre las cabezas de lavanda y agrega las tiras de corteza de limón.", "Vierta suficiente vino de postre para cubrir los melocotones. Dé vuelta las rodajas de melocotón un par de veces para cubrirlas con el líquido, cubra el plato y enfríe la mezcla en la nevera durante al menos cuatro horas, o preferiblemente durante la noche.", "Para servir, vierta una porción de melocotones en Sauternes en cada uno de los seis tazones para servir. Sirva con una cucharada de crème fraîche, si está usando."], "url": "www_bbc_co_uk_food_recipes_peachesinsauternes_91630", "title": "Melocotones en Sauternes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 limones", "400 g / 14 oz de azúcar en polvo", "200ml / 7fl oz de agua caliente, de un hervidor de agua", "4 dedos de esponja, rotos en pedazos", "100g / 3½ oz de mascarpone", "1 limón, ralladura y jugo adicionales", "75ml / 2½ fl oz crema doble", "1 cucharada de azúcar glas, tamizada", "1 melocotón, pelado y en rodajas"], "method": ["Corta uno de los limones en cuartos y zumo los otros limones. Coloque el limón en cuartos y el jugo de limón, azúcar y agua caliente en una olla no reactiva y deje que hierva. Hierva hasta que la mezcla esté espesa y almibarada, luego retírela del fuego y deje que se enfríe.", "Sumerja los dedos de la esponja en el jarabe de azúcar y colóquelos en la base de un plato de servir de vidrio. (Habrá jarabe de azúcar sobrante para usar en otra ocasión).", "Mezcle el mascarpone, la ralladura de limón y un chorrito de jugo de limón del limón adicional, la crema doble y el azúcar glas juntos.", "Coloque un tercio de las rodajas de melocotón en la parte superior de la base del dedo de la esponja y luego cubra con la mitad de la mezcla de crema.", "Coloque otro tercio de las rodajas de durazno encima de la crema y cubra con el resto de la mezcla de crema.", "Decorar con el resto de los melocotones y servir."], "url": "www_bbc_co_uk_food_recipes_peachlemonandmascarp_87176", "title": "Durazno de melocotón, limón y mascarpone", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 17½ oz de hojaldre laminado", "4 melocotones, pelados, piedras removidas, rebanadas", "250g / 9oz de queso crema con alto contenido de grasa", "1 cucharada de azúcar moreno claro", "Frambuesas 125g / 4oz", "1 huevo de gallinas camperas, batido para lavar huevos", "200 g / 7 oz de azúcar en polvo de oro", "150ml / 5fl oz de agua", "100ml / 3½fl oz Pedro Jimenez PX (o similar) jerez", "helado de vainilla de buena calidad"], "method": ["Precalentar el horno a 180C / 355F / Gas mark 4.", "Recorta seis círculos de 20cm / 8in del pastel listo para usar.", "Mezcle suavemente los melocotones y el queso crema en un bol.", "Divida la mezcla de melocotón y queso crema entre los seis círculos de repostería, colocando la mezcla en solo la mitad de cada círculo.", "Espolvoree el azúcar de manera uniforme sobre cada porción de relleno de melocotón y queso crema y agregue la misma cantidad de frambuesas a cada una.", "Dobla la mitad limpia de cada círculo de repostería sobre el relleno para crear semicírculos.", "Cepille los bordes de la masa con el lavado de huevo y presione hacia abajo para sellar.", "Prensar los bordes de los pasteles con un tenedor y un cepillo por todas partes con la colada de huevo.", "Transfiera los pasteles a una bandeja para hornear grande y colóquelos en el horno durante 12-15 minutos, o hasta que la masa esté dorada y cocida.", "Para la salsa, coloque el azúcar, el agua y el jerez en una sartén a fuego medio. Llevar a ebullición y cocinar hasta que la mezcla se espese a un jarabe.", "Para servir, coloque una rotación en cada plato y rocíe con la salsa. Agregue una porción de helado al lado y sirva."], "url": "www_bbc_co_uk_food_recipes_peachmelbaturnovers_89334", "title": "Las pérdidas de Melocotón Melba", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ melocotón, pelado y finamente picado", "½ naranja, solo jugo", "Crema doble de 150 ml / 5 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "½ cucharadita de canela en polvo", "1 cucharada de azúcar glas", "1 cucharadita de cacao en polvo", "1 cucharada de yogur griego", "1 ramita de menta fresca"], "method": ["Para la mousse, coloque el melocotón y el jugo de naranja en un procesador de alimentos y mezcle hasta que quede suave.", "En un tazón grande, mezcle la crema, la canela y el azúcar glas, luego doble la mezcla de durazno. Coloque esta mezcla en un vaso alto.", "Para servir, espolvorear con cacao en polvo, cubrir con yogur griego y decorar con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_peachmousse_84900", "title": "Mousse de durazno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ melocotón, pelado y finamente picado", "½ naranja, solo jugo", "2 claras de huevo de gallinas camperas", "2 cucharadas de azúcar en polvo", "1 cucharada de azúcar glas"], "method": ["Precalentar el horno 200C / 400F / Gas 6.", "Coloque el melocotón y el jugo de naranja en un procesador de alimentos y mezcle hasta que quede suave.", "En un tazón grande bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar impalpable y bata de nuevo.", "Doble la mezcla de melocotón en la mezcla de clara de huevo y la cuchara en un molde.", "Transfiera al horno y hornee por 7-8 minutos, o hasta que se levante.", "Servir en un plato con una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_peachsouffle_84901", "title": "Melocotón soplado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 claras de huevo de gallinas camperas", "Melocotones en conserva de 200g / 7oz / ½tin", "1 cucharadita de azúcar"], "method": ["Caliente el horno a 250C / 500F / Gas 9.", "Batir las claras de huevo en el estadio pico rígido.", "Mezcle los melocotones en un procesador de alimentos y agregue el azúcar.", "Dobla el coulis de melocotón en las claras de huevo y hornea en el horno durante diez minutos o hasta que se eleve."], "url": "www_bbc_co_uk_food_recipes_peachsouffle_78168", "title": "Melocotón soplado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de harina de pan blanco fuerte, más extra para espolvorear", "75 g / 2½ oz de azúcar en polvo", "gran pizca de sal", "3 cucharaditas de levadura de acción rápida", "Leche entera de 220ml / 8fl oz, calentada a la temperatura de la sangre", "½ cucharadita de extracto de almendra", "7 huevos grandes de gallinas camperas", "375g / 13oz de mantequilla sin sal, ablandada", "algunas gotas de esencia de melocotón natural", "175g / 6oz de azúcar glasé, más extra para quitar el polvo", "175gr / 6 oz de almendras molidas", "1 huevo grande de gallinas camperas", "algunas gotas de extracto de almendra", "4 duraznos maduros grandes, pelados, a la mitad de la piedra eliminados", "azúcar de vainilla, para quitar el polvo", "Polvo de polvo comestible de color rosa oscuro", "Polvo de polvo comestible amarillo", "2 piezas grandes de tiras de angélica confitada, cortadas en 12 formas de hojas", "Pacanas de 150 g / 5½ oz, finamente picadas", "150ml / 5fl oz de jarabe de arce", "2 cucharadas de mantequilla de avellana", "2 cucharaditas de pasta de vainilla", "75g / 2½oz de avellanas tostadas, picadas", "2-3 cucharadas de azúcar perla gruesa (también conocida como azúcar de punta)", "50 g / 1 oz de azúcar en polvo"], "method": ["Para la masa, coloque la harina, el azúcar, la sal y la levadura en el cuenco de un mezclador independiente equipado con un gancho de masa.", "Agregue la leche, el extracto de almendras y los huevos y mezcle lentamente durante un par de minutos, luego aumente la velocidad y continúe mezclándolo durante otros cinco minutos más o menos, o hasta que la masa se haya unido y sea suave y elástica.", "Agregue la mantequilla ablandada y continúe mezclándola por otros cinco minutos, asegurándose de que toda la mantequilla esté incorporada.", "Transfiera la mitad de la masa a otro recipiente, cúbrala con una película adhesiva untada con aceite y colóquela en la nevera durante la noche. (Esta es la masa para los bollos de nueces pecanas alemanas).", "Para los bollos color melocotón, agregue unas gotas de esencia de melocotón a la masa restante y déle una mezcla final, antes de cubrirla y ponerla en la nevera durante la noche.", "Haga un poco de mazapán mezclando el azúcar glas y las almendras molidas en un tazón, luego mezcle el huevo. Agregue unas gotas de extracto de almendra. Amasar sobre una superficie espolvoreada con azúcar impalpable hasta que quede suave, luego envolver con una película adhesiva y enfriar en la nevera hasta que lo necesite.", "Incline la masa de bollo color melocotón sobre una superficie enharinada y golpéela suavemente. Divida la masa en 12 piezas iguales que pesen aproximadamente 60 g / 2¼ oz.", "Usando una bola de melón, haz 12 bolas de melocotón.", "Divide el mazapán en 12 pedazos iguales y rueda en bolas. Aplane cada uno en un disco. Necesitarás que cada disco de mazapán sea al menos dos veces más grande que la bola de melocotón para que lo cubra por completo. Básicamente, estás creando una pequeña bolsa de mazapán por cada bola de melocotón, un poco como un wonton.", "Con las manos enharinadas, aplaste las 12 piezas de masa y coloque una bola de melocotón cubierto de mazapán en el centro. Envuelva suavemente la masa alrededor del mazapán y el melocotón.", "Coloque cada panecillo, con la punta hacia abajo, en el orificio de una bandeja para muffins de 12 tazas, dejando cada taza para muffins alternativamente vacía. (Debe tener seis bollos en cada bandeja de 12 hoyos, con espacios vacíos entre ellos). Cubra con una toalla de té limpia y deje probar durante aproximadamente una hora.", "Precaliente el horno a 190C / ventilador del horno 170C / 375F / Gas 5.", "Tome doce cucharadas de metal resistentes y coloque sus mangos en cada moño, con los cuencos de las cucharas descansando en los agujeros vacíos de las bandejas de panecillos. Esto reproducirá la hendidura natural de un melocotón mientras los bollos se hornean. Hornee los bollos durante unos 20-25 minutos, luego transfiéralos a una rejilla para que se enfríen.", "Cuando los bollos estén fríos, espolvoréelos con el azúcar de vainilla, aplique suavemente un \"colorete\" de polvo comestible rosado y amarillo con un cepillo y use la angélica para crear \"hojas\". (Debido a que es confitada, la angélica ya está un poco pegajosa, así que puedes colocar las hojas en el hoyuelo de los panecillos. Sin embargo, también puedes empujar suavemente un extremo puntiagudo de la forma de la hoja hasta la superficie del moño para asegurarte no se moverá.)", "Para los bollos de nuez pecanas alemanas, mezcle las pacanas con el jarabe de arce, mantequilla de avellana, pasta de frijoles de vainilla y avellanas en un bol para formar una pasta áspera.", "Incline la masa sobre una superficie enharinada y golpéela suavemente. Ruede y dé forma a la masa para formar un rectángulo de aproximadamente 25 x 35 cm / 10 x 14 pulgadas de largo.", "Extienda la pasta de pecan sobre la masa, y luego enrolle cuidadosamente, primero el lado largo, en forma de salchicha.", "Pon en orden el rollo cortando y descartando las dos piezas del extremo y luego corta el rollo en 12 rebanadas iguales. Con cuidado, transfiera los bollos a dos bandejas forradas, dejando suficiente espacio entre ellas. Cubra con una toalla de té limpia y deje probar durante aproximadamente una hora.", "Precaliente el horno a 180 ° C / horno de ventilador 160 ° C / 350 ° F / Gas 4.", "Cuando se haya levantado, espolvoree los panecillos con azúcar perlado y hornee durante aproximadamente 25 minutos.", "Mientras los bollos se hornean, haz un glaseado. Combine el azúcar impalpable y 50 ml / 2 fl oz de agua en una olla y caliente, revuelva, hasta que el azúcar se disuelva.", "Cuando los panecillos estén listos, retírelos del horno y cepíllese con el glaseado. Transfiera a una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_peachy_buns_and_german_49575", "title": "Bollos amelocotados y bollos de pacana pegadizas alemanas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Rinde 12 de cada panecillo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Guisantes congelados de 50 g / 2 oz, descongelados", "50 g / 2 oz de yogur de soja", "pizca de copos de chile", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco crujiente, rociado con aceite de oliva y a la parrilla a ambos lados, para servir"], "method": ["Coloque los guisantes, el yogur de soja, los copos de chile y el condimento en una mini licuadora y blitz hasta que estén casi lisos.", "Para servir, vierta la cuchara en un tazón con el pan a la plancha en un lado."], "url": "www_bbc_co_uk_food_recipes_peaguacamolebruschet_82105", "title": "Bruschetta de guisante 'guacamole'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "15g / ½ oz de mantequilla", "½ cebolla, finamente picada", "1 tomate, picado", "Guisantes congelados de 200g / 7oz, descongelados", "sal y pimienta negra recién molida", "Cheddar de 55 g / 2 oz, rallado", "pequeño puñado de hojas de menta fresca, picada", "3 huevos de gallinas camperas, ligeramente batidos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una sartén antiadherente pequeña y antiadherente, caliente el aceite de oliva y la mantequilla y saltee la cebolla hasta que quede suave, pero no coloreada.", "Agregue el tomate y los guisantes y sazone con sal y pimienta negra recién molida.", "Vierta sobre los huevos y el queso y cocine a fuego medio bajo hasta que la base esté lista.", "Transfiera al horno por 8-10 minutos, o hasta que esté cocido.", "Para servir, esparza con menta."], "url": "www_bbc_co_uk_food_recipes_peamintandcheddarfri_86863", "title": "Tortilla de guisantes, menta y queso cheddar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peamintandcheddarfri_86863_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo blanco de corral", "75g / 2½oz de azúcar moscovado oscuro o liviano", "1 cucharadita de canela molida", "1 cucharadita de polvo chino de cinco especias", "½ cucharadita de chile en polvo", "200 g / 7 oz de almendras", "Anacardos 200 g / 7 oz", "2 cucharadas de salsa de soja", "1 cucharada de ron", "1½ cucharadita de harina de maíz", "800g / 1lb 12oz sin hueso, sin piel, muslos de pollo, cortados en cubos de 2.5cm", "1 cucharada de aceite de maní", "1 cucharada de vinagre de arroz negro chino o vinagre balsámico de buena calidad", "100g / 3½ oz de mantequilla de maní crujiente", "1 cucharadita de salsa de soja", "2 cucharadas de aceite de sésamo", "1 cucharadita de granos de pimienta de Sichuan, tostados y luego molidos", "2 cucharadas de aceite de maní", "8-10 pequeños chiles rojos secos", "6 cebollas de primavera, partes blancas y verdes separadas, en rodajas finas", "6 dientes de ajo, aplastados", "Jengibre fresco de raíz de 5cm / 2in, pelado y finamente picado o rallado", "50 g / 1¾oz de cacahuetes tostados secos sin sal", "arroz al vapor, para servir"], "method": ["Para las nueces con especias de caramelo, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y cubra una bandeja para hornear con papel para hornear.", "Coloque la clara de huevo en un tazón grande y bata hasta que esté espumoso. Agregue el resto de los ingredientes y mezcle. Vierta sobre la bandeja de hornear preparada y hornee durante 15-20 minutos, o hasta que las nueces estén crujientes. Dejar de lado para enfriar antes de servir.", "Para los muslos de pollo con mantequilla de maní, mezcle la salsa de soya, el ron y la harina de maíz en un tazón. Agregue el pollo y mezcle bien para asegurarse de que todo el pollo esté cubierto en el adobo. Dejar reposar a temperatura ambiente durante 10 minutos.", "Para la salsa, en un tazón, mezcle el vinagre, la mantequilla de maní, la salsa de soja, el aceite de sésamo y los granos de pimienta de Sichuan y mezcle hasta que quede suave.", "Caliente un wok o una sartén grande de base pesada a fuego alto. Agregue el aceite de maní y agite para cubrir la base. Agregue los chiles y saltee por unos 30 segundos, o hasta que los chiles comiencen a ennegrecerse y el aceite sea ligeramente fragante.", "Agregue el pollo marinado y saltee hasta que esté opaco y cocido - aproximadamente tres minutos.", "Agregue las partes blancas de las cebolletas, el ajo y el jengibre y saltee por unos 30 segundos. Vierta la mezcla de mantequilla de maní y cubra los demás ingredientes. Agregue los cacahuetes y cocine por otros 1-2 minutos.", "Sirva el pollo y la salsa en platos con arroz al vapor, espolvoreando sobre las partes verdes de la cebolla de primavera y las nueces con especias al final."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_chicken_63146", "title": "Muslos de pollo con mantequilla de maní con nueces caramelizadas y arroz al vapor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo mediano, golpeado", "3 yemas de huevo medianas", "45 g / 1½ oz de azúcar en polvo", "1 cucharada de harina de maíz", "420ml / ¾ de pinta de leche entera", "1 cucharadita de pasta de vainilla de buena calidad", "100 g / 3½ oz de mantequilla de maní suave", "Harina común 110g / 4oz", "40 g / 1½ oz de cacao en polvo", "4 huevos grandes de gallinas camperas", "50ml / 2fl oz de leche entera", "100g / 4oz de mantequilla sin sal ablandada", "¼ cucharadita de sal marina fina", "Fresas de 150g / 5oz, descascaradas", "1 cucharada de jugo de limón", "Azúcar de mermelada de 150g / 5oz", "botón de mantequilla sin sal", "75 g / 2½ oz de azúcar en polvo", "75g / 2½oz de cacahuetes salados", "Fresas de 200g / 7oz, descascaradas y en rodajas finas", "250g / 8oz de glaseado de fondant listo para usar", "pasta roja para colorear alimentos"], "method": ["Para la crème pâtissière, coloque los huevos, las yemas de huevo y el azúcar en un tazón grande y bata hasta que estén pálidos y suaves. Agregue la harina de maíz y bata hasta incorporar y suavizar.", "Coloque la leche y la pasta de vainilla en una olla grande y deje que hierva. Vierta sobre la mezcla de huevo lentamente batiendo todo el tiempo hasta que quede suave.", "Vuelva a colocar toda la mezcla en la sartén y cocine a fuego lento. Cocine por tres minutos, batiendo todo el tiempo. Vierta en un tazón grande y mezcle en la mantequilla de maní hasta que esté bien incorporado.", "Cubra con una película adhesiva tocando la mezcla para evitar que se forme la piel. Dejar de lado para enfriar.", "Para la masa de chocolate choux, precaliente el horno a 190C / 375F / Gas 5.", "En un tazón, combine la harina y el cacao en polvo. Coloque los huevos en otro recipiente y bata.", "Poner 110 ml / 4 fl oz de agua, la leche, la mantequilla y la sal en una olla grande y llevar a ebullición. Retire del fuego y mezcle rápidamente la mezcla de harina hasta que esté bien combinada.", "Vuelva a colocar a fuego medio y cocine durante dos minutos, revolviendo todo el tiempo. Retire del fuego y bata los huevos poco a poco hasta que la mezcla alcance una consistencia espesa.", "Coloque la mezcla en una tubería grande con una boquilla de 15 mm y déjela enfriar un poco.", "Corte dos pedazos de pergamino antiadherente para hornear en las bandejas de cocción. Marque cada trozo de pergamino horneado con seis líneas largas de 15cm / 6 pulgadas, separadas para permitir que la masa se expanda mientras se cocina. Voltee el papel para que pueda ver las líneas a través del pergamino.", "Pase pequeños trozos de la mezcla de choux en cada esquina de las bandejas de hornear y pegue el pergamino para hornear. Pipe 12 éclairs en las líneas y rocíe ligeramente con aceite de girasol. Coloque en el centro del horno durante 25-30 minutos, o hasta que esté bien levantado, dorado y crujiente. Es posible que deba cambiar las bandejas para asegurarse de que los éclairs se cocinen uniformemente.", "Para la mermelada de fresa, coloque las fresas en un pequeño procesador de alimentos y mezcle con un puré. Transfiera a una cacerola grande con el jugo de limón y el azúcar mermelada. Llevar a ebullición revolviendo todo el tiempo. Agregue un poco de mantequilla y hierva durante cuatro minutos. Vierta en un recipiente resistente al calor y deje enfriar.", "Para el quebradizo de cacahuete salado, coloque el azúcar en una cacerola a fuego medio y cocine hasta que se forme un caramelo. Agregue los cacahuetes salados y vierta la mezcla en un trozo grande de papel para hornear antiadherente y deje enfriar y fraguar. (PRECAUCIÓN: el azúcar se calienta mucho. Tenga cuidado de no quemarse).", "Para ensamblar, corte los éclairs de chocolate cuidadosamente por la mitad a lo largo. Vierta la mermelada de fresa en una manga pastelera equipada con una boquilla redonda de 5 mm y pise una línea de mermelada en la base de cada éclair.", "Coloque la crème pâtissière en una manga pastelera equipada con una boquilla de estrella de 15 mm y llene cada base de éclair sobre la parte superior de la mermelada.", "Para el relleno, coloque rebanadas de fresas en una fila encima del relleno y ponga las tapas en los éclairs.", "Ponga el fondant en una cacerola grande con cuatro cucharaditas de agua y suficiente colorante de pasta roja para darle un color rojo intenso (solo necesitará una pequeña cantidad). Calienta suavemente hasta que alcance 38C / 100F en un termómetro de cocción, revolviendo todo el tiempo.", "Coloque el glaseado en una manga larga con una boquilla de cinta de 15 mm de ancho y una línea de fondant en la parte superior de cada éclair. Rompa el quebradizo de cacahuate salado en trozos pequeños usando un rodillo y esparza las piezas en la parte superior de cada éclair mientras el fondant todavía está húmedo."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_clairs_72663", "title": "Eclairs de mantequilla de maní", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 relámpagos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 plátanos maduros", "100ml / 3½fl oz de yogur griego natural", "salpicar leche", "2 cucharadas de miel", "Margarina 75g / 2¾oz", "100 g / 3½ oz de azúcar en polvo de oro", "1 huevo grande de gallinas camperas", "Harina normal de 100 g / 3½ oz", "1 cucharada de jarabe de oro", "100g / 3½ oz de mantequilla de maní crujiente", "1 cucharadita de bicarbonato de soda", "50g / 1¾oz de cacahuetes salados"], "method": ["Para hacer el helado, pele las bananas, divídalas en trozos pequeños y colóquelas en un tazón grande. Con un tenedor, machaque los plátanos hasta que quede suave. Agregue los ingredientes restantes y bata juntos. Vierta la mezcla en un recipiente de plástico, cúbralo con una tapa y colóquelo en el congelador.", "Después de media hora, saque la mezcla del congelador y use un tenedor para romper los cristales de hielo que se forman alrededor de los bordes. Regrese al congelador y repita este proceso una o dos veces hasta que el helado esté congelado (cuanto más se bate la mezcla durante la congelación, más suave será el helado terminado). Esto tomará aproximadamente 4 horas en total.", "Mientras tanto, haga las galletas, precaliente el horno a 175C / 155C Fan / Gas 4 y alinee dos bandejas planas para hornear con papel antigrasa.", "Crema la margarina y el azúcar con una cuchara de madera hasta que esté pálida. Batir el huevo, un poco de la harina, el sirope dorado y la mantequilla de maní. Agregue la harina restante y el bicarbonato de soda y revuelva finalmente a través de los cacahuetes.", "Deja caer cucharadas de la mezcla sobre las bandejas de hornear preparadas. Deje suficiente espacio entre ellos ya que las galletas se extenderán durante la cocción. Aplane cada una con el dorso de una cuchara y hornee durante 10 minutos. Retire del horno, deje enfriar durante 10 minutos en las bandejas y luego transfiéralo a una rejilla para que se enfríe completamente.", "Para servir, cubra una galleta con una cucharada de helado y sándwich junto con una segunda galleta."], "url": "www_bbc_co_uk_food_recipes_peanut_butter_cookies_02578", "title": "Galletas de mantequilla de maní con helado de plátano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peanut_butter_cookies_02578_16x9.jpg", "isVegetarian": true, "recommendations": 0}]