[{"ingredients": ["1 x 350 g / 12 oz de suela de limón", "200g / 7oz de mantequilla, cortada en cubos de 1cm / ½in", "sal marina y pimienta negra recién molida", "2 limones, solo jugo", "1 bulbo de hinojo, en rodajas finas, tapas de hinojo reservadas para más tarde", "1 chalote de plátano, finamente picado", "250ml / 9fl oz de vino blanco seco, preferiblemente Sauvignon Blanc", "Mejillones de 200g / 7oz, limpios", "200 g / 7 oz almejas", "50ml / 2fl oz Pernod"], "method": ["Recorte las aletas y la cola de la suela.", "Barra la parte superior del pez tres veces diagonalmente en cada lado.", "Caliente una sartén grande hasta que esté caliente, luego agregue 50 g / 1¾ oz de la mantequilla.", "Cuando se ponga marrón, vierta el pescado en la mantequilla y cocine a fuego medio durante cinco minutos.", "Apunte la parte superior del pescado con otros 50 g / 1¾ oz de mantequilla y espolvoree con sal marina, pimienta negra y un chorrito de limón.", "Coloque debajo de una parrilla caliente durante seis minutos.", "Mientras tanto, en una sartén profunda, agregue otros 50 g / 1¾ oz de mantequilla, el hinojo en rodajas y la chalota.", "Saltee durante tres minutos, luego agregue el vino blanco y los mariscos.", "Enciende la tapa y cocina durante dos minutos.", "Coloque la suela en un plato para servir, luego levante el hinojo y los mariscos y colóquelos alrededor de la suela.", "Para finalizar, suba el fuego en la sartén y agregue el Pernod, luego mezcle con el resto de la mantequilla, permitiendo que la salsa se emulsione.", "Vierta la salsa sobre el pescado y decore con las tapas reservadas de hinojo para servir."], "url": "www_bbc_co_uk_food_recipes_lemonsolewithfennelm_74802", "title": "Suela de limón con hinojo, mejillones y almejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["170ml / 6fl oz de suero de leche", "2 yemas de huevo", "2 cucharadas de jugo de limón", "3 cucharaditas de ralladura de limón rallado", "1 cucharadita de esencia de vainilla", "25g / 1oz de mantequilla sin sal, derretida, más extra para cocinar", "Harina normal de 90g / 3¼ oz", "1 cucharadita de polvo de hornear", "3 cucharadas de azúcar en polvo", "sal", "2 claras de huevo", "Fresas de 200g / 7oz, partidas por la mitad", "1 cucharada de miel", "azúcar en polvo"], "method": ["Coloque el suero de leche, las yemas de huevo, el jugo de limón, la ralladura y la esencia de vainilla en un bol y revuelva hasta que se combinen. Agregue la mantequilla derretida y mezcle bien.", "Tamiza la harina, el polvo de hornear, el azúcar impalpable y la sal en un tazón grande. Haga un pozo en el centro y mezcle gradualmente la mezcla de suero de leche hasta que los ingredientes secos se humedezcan, teniendo cuidado de no mezclar demasiado.", "Coloque las claras de huevo en un recipiente seco y limpio y bata hasta que se formen picos suaves. Doble suavemente las claras de huevo en la mezcla con una cuchara grande de metal.", "Derrita una porción pequeña de mantequilla en una sartén antiadherente a fuego medio y vierta dos cucharadas de masa por torta en la sartén.", "Cocine la torta hasta que se dore por la parte inferior y parezca seca en los bordes, luego voltee y cocine por el otro lado.", "Transfiera a un plato y manténgalo caliente mientras cocina la masa restante.", "Mezcle las fresas frescas con la miel y una ligera capa de azúcar glas.", "Espolvorea las tortas de soufflé de limón con azúcar glas adicional y sírvelas con las fresas."], "url": "www_bbc_co_uk_food_recipes_lemonsoufflecakes_76705", "title": "Tortas de soufflé de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de leche entera", "1 vaina de vainilla, dividida", "1 limón, ralladura solamente", "50 g / 2 oz de mantequilla, más extra para engrasar", "Harina normal de 30g / 1oz", "100 g / 3½ oz de azúcar en polvo (más extra para rociar)", "½ limón, solo jugo", "3 huevos de gallinas camperas, separados", "100 g / 3½ oz de azúcar en polvo", "1 cucharadita de agua de rosas", "100 ml / 3½ fl oz de agua", "50ml / 2fl oz de vino blanco", "Frambuesas 200 g / 7 oz"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la leche, la vaina de vainilla, la ralladura de limón y la mitad del azúcar en una sartén a fuego medio, y hágalo casi hervir, luego retírelo del fuego.", "En una sartén por separado, derrita la mantequilla, luego agregue la harina y revuelva para combinar.", "Cuele la mezcla de leche caliente y agregue gradualmente a la mantequilla y la mezcla de harina, revolviendo constantemente, hasta que espese.", "Mientras tanto, con un batidor eléctrico, bata el jugo de limón y las yemas de huevo en un bol, hasta que estén muy pálidos y esponjosos, alrededor de 3-5 minutos.", "Agregue la mezcla de leche caliente y batir bien para combinar como una crema suave.", "En un recipiente aparte, bata los blancos y la otra mitad del azúcar, hasta que se formen picos rígidos cuando se quite el batidor.", "Doble una cucharada de la mezcla de clara de huevo en la mezcla de crema, luego doble suavemente las claras de huevo restantes, hasta que se combinen.", "Engrase dos moldes con mantequilla y espolvoréelos con un poco de azúcar para cubrir el interior.", "Vierta la mezcla de soufflé en ambos moldes para que llegue casi a la cima.", "Pase el dedo pulgar, o el mango de una cucharilla, por el borde para hacer una pequeña muesca (esto ayudará al suflé a levantarse).", "Coloque los moldes en una bandeja para hornear y coloque en el horno para hornear durante 10-12 minutos, o hasta que se levante y luz dorado.", "Para la salsa, coloque el azúcar, agua de rosas, agua y vino en una sartén a fuego medio y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos, o hasta que espese.", "Agregue las frambuesas y revuelva por un minuto.", "Mezcle la salsa con una licuadora de mano y luego pase la salsa por un colador.", "Retire los souffés del horno y colóquelos en los platos. Use una cuchara para cortar un pequeño agujero en la parte superior de cada soufflé y vierta un poco de salsa de frambuesa. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lemonsouffleswithras_89687", "title": "Soufflés de limón con salsa de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceite de coco virgen 120g / 4½oz o margarina sin lácteos", "150g / 5½oz de banana pelada, puré", "1 limón grande, jugo y corteza solo", "120 g / 4½ oz de avena enrollada, pulverizada en un procesador de alimentos", "2 huevos grandes más ½ cucharadita de polvo de hornear sin trigo y sin gluten, O si no puede comer huevos, 2 cucharaditas colmadas de polvo de hornear libre de trigo y gluten", "25g / ¾oz de harina de patata o harina de maíz", "100 g / 3½ oz de sultanas"], "method": ["Caliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una lata de torta de fondo suelto de 15 cm / 6 pulgadas con papel resistente a la grasa.", "Suavice el aceite de coco o la margarina en un microondas y bátalo con el puré de plátano.", "Batir la cáscara de limón y el jugo, luego la avena.", "Si está usando los huevos, remuévalos con la papa o la harina de maíz.", "Si no está usando huevos, tamice el polvo de hornear con la patata o harina de maíz y revuelva bien en la mezcla.", "Finalmente, agregue las sultaninas y mezcle bien.", "Coloque la mezcla en la lata de la torta y hornee durante 30-35 minutos.", "Pruebe con un pincho para asegurarse de que esté cocido (el pincho saldrá limpio cuando se inserte en el medio) y luego deje que se enfríe en la lata antes de quitarlo."], "url": "www_bbc_co_uk_food_recipes_lemonsultanacake_77310", "title": "Pastel de sultana de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonsultanacake_77310_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275g / 9¾oz de azúcar en polvo", "3 limones, cáscara y jugo solamente", "275 ml / 9¾ fl oz de jerez o vino", "150 ml / 5¼fl oz de brandy", "725 ml / 1 pinta 6fl oz crema doble", "150g / 5¼ oz de harina de auto crianza", "½ cucharadita de bicarbonato de sodio", "½ cucharadita de canela", "½ cucharadita de jengibre", "¼ cucharadita de clavo de olor", "110g / 4oz de azúcar morena suave", "100g / 4oz de mantequilla, suavizada", "½ huevo batido", "40 g / 1½ oz de jarabe dorado", "azúcar granulada, para recubrimiento"], "method": ["Mezcle el azúcar impalpable con el jugo de limón; agregue la corteza, el jerez o el vino y el brandy.", "Caliente un poco en un recipiente sobre agua caliente (baño maría) para disolver el azúcar y mezclar los sabores. No sobrecaliente la mezcla.", "Batir la crema en suaves picos y doblar en el líquido.", "Vierta en vasos altos y deje que la mezcla descanse y se separe.", "Para preparar los bizcochos, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Combine la harina, el bicarbonato de sodio y las especias en un recipiente y déjelos a un lado.", "Ahora crema el azúcar y la mantequilla. Una vez combinado, bata el huevo y el jarabe dorado hasta que esté suave y esponjoso.", "Agregue la mezcla de harina y combine. Con una cucharadita, vierta pequeñas cantidades de la mezcla en una bandeja para hornear ligeramente engrasada a unos 5 cm de separación. Ligeramente aplanar y espolvorear con azúcar.", "Hornee en el horno durante 8-10 minutos. Sirve con el syllabub."], "url": "www_bbc_co_uk_food_recipes_lemonsyllabub_72381", "title": "Syllabub de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 limones", "100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "200g / 6oz de azúcar de vainilla o azúcar impalpable", "4 huevos medianos de granja, separados", "Harina normal de 75g / 3oz", "500ml / 17fl de leche en oz"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Unte con mantequilla un plato de horno poco profundo de 2 litros / 3½ pinta.", "Ralla la ralladura de dos de los limones, luego exprime el jugo de los tres.", "Bata la mantequilla con el azúcar y la ralladura de limón. Batir las yemas de huevo uno por uno. No entre en pánico si la mezcla se cuaja.", "Luego bata la harina una cucharada a la vez, alternando con sorbos de leche y jugo de limón.", "Una vez que todo esté dentro, bata las claras de huevo hasta que formen picos rígidos, y dobla ligeramente en la masa de limón.", "Vierta la mezcla en la fuente para hornear, luego coloque el plato en una lata para asar.", "Vierta suficiente agua hirviendo alrededor del plato para llegar a la mitad de los lados.", "Hornee en el horno durante 40-45 minutos hasta que el pudín esté dorado.", "Servir caliente o tibio, con o sin crema."], "url": "www_bbc_co_uk_food_recipes_lemonsurprisepudding_82708", "title": "Pudín sorpresa de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 solomillo de limón, sin piel, cortado por la mitad a lo largo", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "Almendras en copos de 25g / 1oz", "Pan rallado de 25 g / 1 oz", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Doble los trozos de solomillo de limón por la mitad y meta los extremos debajo para formar dos paquetes.", "Caliente el aceite y la mitad de la mantequilla en una sartén a prueba de horno a fuego medio. Agregue el pescado, los bordes doblados hacia abajo, y freír durante 1-2 minutos, cucharando el aceite y la mantequilla sobre la parte superior. Transfiera al horno y cocine por otros 5-7 minutos, o hasta que el pescado esté cocido y opaco.", "Regrese la sartén a la placa y agregue los ingredientes restantes. Continúe freír durante 2-3 minutos, revolviendo bien, o hasta que la mezcla se ponga dorada.", "Sirva las parcelas de limón en un plato con la salsa de almendras."], "url": "www_bbc_co_uk_food_recipes_lemonsolewithalmondb_92732", "title": "Suela de limón con salsa de mantequilla de almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 galletitas de limón", "110ml / 4fl oz de vermut dulce", "Crema doble 250ml / 9fl oz", "4 cucharadas de azúcar glas", "8 cucharadas de cuajada de limón", "2 cucharadas de almendras en copos, tostadas", "2 ramitas de menta fresca"], "method": ["Desmenuce una galleta en la parte inferior de cada uno de los cuatro vasos de helado. Rocíe con una cucharada de vermut dulce en cada vaso.", "Vierta la crema en un recipiente y agregue el azúcar glas. Batir la crema hasta que se formen picos suaves. Dobla el vermut dulce restante. Agregue la cuajada de limón y dóblela ligeramente, dejando un efecto marmoleado.", "Coloque la mezcla de crema en cada una de las copas. Cubra con las almendras copos y una ramita de menta. Servir frío."], "url": "www_bbc_co_uk_food_recipes_lemonsyllabub_83848", "title": "Syllabub de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonsyllabub_83848_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de semillas de comino", "2 cucharaditas de semillas de cilantro", "1 cucharadita de semillas de hinojo", "1 cucharada de hojas frescas de tomillo", "1 limón, ralladura y jugo", "1 diente de ajo, finamente picado", "2 cucharadas de aceite de oliva", "800 g / 1 libra de rape de 12 oz, cortado en trozos", "Selección de verduras de 400 g / 14 oz (como cebolla roja, calabacines, berenjenas y pimientos) cortadas en trozos.", "150ml / 5fl oz yogur griego", "1 diente de ajo, finamente picado", "1 cucharada de menta fresca finamente picada", "1 cucharadita de salsa de menta"], "method": ["Remoje el azafrán en un recipiente con agua tibia durante 10 minutos. Escurrir y apartar.", "Mientras tanto, coloca las semillas en un mortero y machaca y tritura. Incline en un recipiente grande de vidrio junto con el tomillo, la ralladura de limón y el jugo, el ajo, el aceite de oliva y sazone con sal y pimienta. Agregue el pescado y marinado durante al menos 30 minutos.", "Precalentar una barbacoa o parrilla a su configuración más alta.", "Ensamble los kebabs alternar trozos de pescado con las verduras y ensartar en los pinchos.", "Cocine en la barbacoa o debajo de la parrilla durante 3-4 minutos en cada lado o hasta que el pescado esté bien cocido.", "Coloque todos los ingredientes restantes en un recipiente de vidrio pequeño, mezcle y sirva junto con los kebabs."], "url": "www_bbc_co_uk_food_recipes_lemony_monkfish_kebabs_22658", "title": "Kebabs de rape limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Harina de 250g / 10oz de levante, más extra para enrollar", "50g / 2oz de pan blanco fresco", "150g / 5oz de sebo triturado", "1 cucharada de azúcar demerara", "1 naranja, ralladura y jugo", "1 limón, en rodajas finas", "175g / 6oz demerara azúcar", "175g / 6oz de mantequilla fría, cortada en cubos de 2cm / ¾in"], "method": ["Engrase un recipiente para pudines de 900 ml / 1 pinta y forre la base con papel antigrasa.", "Para la masa, coloque la harina, el pan rallado, el sebo, la ralladura de naranja y el azúcar en un tazón grande y mezcle ligeramente. Vierta el jugo de naranja en una jarra y agregue suficiente agua fría hasta llegar a 200 ml / 7 fl oz.", "Vierta el líquido sobre la mezcla de sebo y revuelva con una cuchara de madera hasta que la masa se una y forme una bola. Amasar muy ligeramente sobre la superficie enharinada durante unos segundos hasta que quede muy suave y flexible.", "Rompa aproximadamente dos tercios de la masa y forme una bola. Estirar un círculo de 5 mm / ¼ de grosor. Use la masa para revestir el interior del lavabo, dejando el exceso sobresaliendo por los lados. Mantenga el tercio restante de la masa para la tapa.", "Espolvoree dos cucharadas de azúcar en el recipiente revestido y salpique con 4-5 cubos de mantequilla. Cubra con dos de las rodajas de limón. Repita las capas hasta que todos los ingredientes se usen, agregando un poco de más a cada capa a medida que el lavabo se ensancha.", "Estirar la masa reservada en una superficie ligeramente enharinada. Cepillar con agua y colocar sobre el pudin. Presione los bordes de la masa juntos firmemente para sellar la masa en el recipiente del pudin. Recorte cualquier exceso de pastelería.", "Cubra con papel plisado a prueba de grasa y papel de aluminio. Ate el flan con fuerza alrededor del borde con un largo trozo de cuerda.", "Colóquelo en un salvamanteles o platillo revuelto en una cacerola muy grande y agregue suficiente agua recién hervida para que se eleve hasta la mitad de los lados del lavabo. Cubra y lleve a ebullición. Reduzca el fuego a fuego lento y cocine por 3 ½ horas, completando el agua cuando sea necesario.", "Retire el recipiente cuidadosamente del agua y párese durante tres minutos. Retire la cuerda, papel de aluminio y papel. Afloja los lados del budín con un cuchillo de hoja redonda. Invierta el pudín en un plato (El budín se verá ligeramente hundido en la parte superior y la masa deberá estar dorada). Sirva con trinquetes de crema doble o helado."], "url": "www_bbc_co_uk_food_recipes_lemony_pond_pudding_23282", "title": "Pudín de estanque de lemony", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemony_pond_pudding_23282_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de tomillo finamente picado", "2 dientes de ajo, finamente picados", "2 limones, ralladura finamente rallada", "½ cucharadita de pimienta negra recién molida", "½ cucharadita de orégano", "4 escalopes de cerdo, 2 cm / 1 pulgada de espesor con un poco de grasa sobre la carne", "350g / 12oz de judías verdes, de cola, escaldadas y refrescadas", "Habas de mantequilla enlatadas 150g / 5½oz, escurridas y enjuagadas", "1 cebolla roja mediana, finamente picada", "1½ puñados de hojas de albahaca flojas, desgarradas", "2 cucharadas de perejil de flatillo picado", "2½ cucharadas de aceite de oliva", "2 limones, solo jugo", "sal", "pimienta negra recién molida", "100g / 3½oz de cohete salvaje sin apretar"], "method": ["Para hacer el adobo seco, combine el tomillo, el ajo, la ralladura, la pimienta negra y el orégano.", "Espolvorea sobre la carne de cerdo y deja reposar durante 15 minutos.", "Para hacer la ensalada, hierva los frijoles durante 2-3 minutos, cuele y deje correr bajo agua fría hasta que se enfríe.", "Combine con los frijoles, la cebolla, la albahaca y el perejil.", "Para preparar el aderezo, mezcle dos cucharadas de aceite de oliva con la mitad del jugo de limón y sazone al gusto con sal y pimienta.", "Vierta la mitad sobre la ensalada y mezcle ligeramente. Vierta la mitad restante sobre las hojas del cohete y revuelva para cubrir.", "Cepille un plato de parrilla precalentado con aceite y ase la carne de cerdo, aproximadamente un minuto por cada lado.", "Retire de la parrilla y exprima con el jugo de limón restante.", "Coloque la ensalada de frijoles en el centro de cuatro platos para servir.", "Cubra con un escalope de cerdo, luego esparza el cohete sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_lemonyporkescalopesw_71453", "title": "Lemony de cerdo con judías verdes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite vegetal", "1 cebolla roja muy pequeña (50 g / 1¾oz de peso pelado), finamente picada", "20g / ¾oz de jengibre fresco, pelado y finamente picado", "½ chile rojo pequeño, sin semillas, finamente picado (o pizca de chile en polvo)", "1 diente de ajo, finamente picado", "50g / 1¾oz de lentejas rojas", "½ cucharadita de curry en polvo", "8 tomates cherry, cortados a la mitad", "200ml / 7fl oz de caldo de verduras", "40 g / 1½ oz de espinaca baby", "sal y pimienta negra recién molida", "1 cucharada de cilantro fresco picado, para decorar"], "method": ["Caliente el aceite en una olla pequeña a fuego lento. Agregue la cebolla, el jengibre, el chile y el ajo y cocínelos durante 3-4 minutos.", "Agregue las lentejas, el polvo de curry y los tomates cherry y cocine durante 1-2 minutos.", "Vierta en el caldo, hierva, reduzca el fuego y cocine a fuego lento durante 15-20 minutos, o hasta que las lentejas estén cocidas, agregando más caldo si es necesario.", "Agregue la espinaca y sazone al gusto.", "Adorne con cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_lentil_and_cherry_tomato_15292", "title": "Encendedor de espinacas y tomate cherry dal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentil_and_cherry_tomato_15292_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de colza", "1 cebolla pequeña (75 g / 2½ oz de peso pelado), finamente picada", "1 diente de ajo, finamente picado", "Lentejas rojas 30g / 1oz", "200g / 7oz de tomates picados en lata", "100ml / 3½fl oz de caldo de verduras", "pizca ahumada pizca (opcional)", "pimienta negra recién molida, al gusto"], "method": ["Caliente el aceite en una cacerola pequeña a fuego medio. Agregue la cebolla y el ajo y cocine por 2-3 minutos.", "Agregue el resto de los ingredientes, incluida la pimienta negra al gusto, y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20 minutos.", "Sirva inmediatamente o deje enfriar y guárdelo en el refrigerador o congelador para los almuerzos."], "url": "www_bbc_co_uk_food_recipes_lentil_and_tomato_soup_19393", "title": "Sopa de lentejas y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentil_and_tomato_soup_19393_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de lentejas Puy", "100 g / 3½ oz cocidas, puré de camote", "1 cucharada de hierbas mezcladas secas", "Pan rallado de 25 g / 1 oz", "1 cucharadita de nuez moscada rallada", "1 yema de huevo de gallinas camperas", "100 g / 3½ oz de harina natural, más extra para espolvorear", "1 huevo de gallinas camperas, golpeado", "Polenta de 150 g / 5½ oz", "aceite vegetal, para freír", "200 g / 7 oz de yogur", "1 cucharada de menta fresca picada", "1 lima, jugo y ralladura"], "method": ["Para las croquetas, cocine las lentejas Puy según las instrucciones del paquete. Desagüe.", "Mezcle las lentejas de Puy, la batata, las hierbas mixtas, el pan rallado, la nuez moscada y la yema de huevo en un tazón hasta que estén bien combinados.", "Para el recubrimiento, espolvorear la harina en un plato, batir los huevos en un recipiente y espolvorear la polenta en un plato por separado.", "Con las manos enharinadas, moldee pequeñas cantidades de la mezcla en cilindros de 7.5cm / 3 pulgadas.", "Dragar las croquetas en la harina, sumergir en el huevo batido y finalmente sumergir en la polenta para cubrir por completo.", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las croquetas durante 2-3 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina.", "Para la raita, mezcle el yogur, la menta, la ralladura de lima y el jugo en un tazón.", "Sirva las croquetas con la salsa de raita al costado."], "url": "www_bbc_co_uk_food_recipes_lentil_croquettes_75719", "title": "Croquetas de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de lentejas marrones o verdes en lata, escurridas y enjuagadas", "50g / 1¾oz de pepino, cortado en cubitos", "4 tomates cherry, cortados por la mitad", "2 cebollas tiernas, finamente picadas", "2 cucharaditas de aderezo sin grasa (ver consejo)", "1 cucharada de menta fresca picada (opcional)", "40 g / 1½ oz de queso feta bajo en grasa, desmenuzado"], "method": ["Combine las lentejas, el pepino, los tomates cherry, las cebolletas, el aderezo y la menta, si está usando, en un tazón pequeño y poco profundo. Desmenuce el queso feta en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_lentil_cherry_tomato_and_02234", "title": "Ensalada de lentejas, tomate cherry y queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentil_cherry_tomato_and_02234_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 lata de lentejas, enjuagada y escurrida", "100ml / 4fl oz de vino tinto", "150ml / 6fl oz de agua", "puñado de perejil fresco, picado", "1 cucharadita de semillas de comino", "100 ml / 4 fl oz crema doble", "manojo de albahaca fresca, solo hojas", "3 cucharadas de aceite de oliva", "cucharada de yogur", "espolvorear de cebolletas picadas, para servir", "llovizna de aceite, para servir"], "method": ["Caliente las lentejas, el vino tinto, el agua, el perejil y las semillas de comino en una cacerola a fuego medio y cocine a fuego lento durante cinco minutos. Sazonar con sal marina y pimienta negra recién molida.", "Agregue la crema y suba el fuego para que la mezcla hierva. Transfiera a un procesador de alimentos y mezcle hasta que quede suave.", "Para el pesto, coloque las hojas de albahaca y el aceite en el tazón de un procesador de alimentos y mezcle hasta que quede suave y combinado.", "Transfiera la sopa a un recipiente para servir y revuelva cuidadosamente parte del pesto.", "Para servir, cubrir con una cucharada de yogur y espolvorear sobre cebollino picado y aceite."], "url": "www_bbc_co_uk_food_recipes_lentilandcuminsoup_84462", "title": "Sopa de lentejas y comino con pesto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5oz brote superior, triturado", "150 g / 5 oz de coles de Bruselas, cortadas en cuartos o mini brotes cortados por la mitad", "110g / 4oz de lentejas moong partidas, estas serán de color amarillo a medida que se descascaren", "1 cucharadita de semillas de comino entero", "2 dientes de ajo, aplastados", "Jengibre 5cm / 2in, aplastado", "2 chiles verdes, aplastados", "½ cucharadita de cúrcuma", "1 cucharada de aceite de oliva", "½ cucharadita de sal, ajustar al gusto", "400ml / 13½fl oz de agua tibia", "1 tomate pequeño, finamente cortado en cubitos", "cilantro, para adornar"], "method": ["Remoje las lentejas entre 4 y 8 horas en agua hirviendo. Cuando esté listo para cocinar, enjuague las lentejas con agua tibia y escurra.", "Calentar el aceite en una sartén mediana, agregar las semillas de comino y cocinar durante aproximadamente un minuto o hasta que se dore.", "Retire la sartén del fuego y agregue el ajo, el jengibre y los chiles. Revuelva esto muy rápido, ya que no desea que se queme, agregue lentejas, cúrcuma, sal y 300 ml / 10 fl oz de agua tibia. Llevar a ebullición, cubrir y cocinar durante 10 minutos a fuego lento. No permita que el agua se reduzca en más de un tercio de la cantidad original, si agrega más agua tibia.", "Verifique que las lentejas estén cocidas, sacando algunas con una cuchara y aplastándolas con los dedos. Solo debe aplicar un poco de presión para que la lenteja se aplane, una vez cocida agregue todas las verduras y 100 ml / 3½ fl oz de agua tibia.", "Revuelva y revise el condimento, tape y cocine durante 5 minutos a fuego medio, revolviendo ocasionalmente. Las verduras todavía deben tener un poco de crujido cuando el plato esté cocido, servir y espolvorear con tomates picados y cilantro."], "url": "www_bbc_co_uk_food_recipes_lentilandsproutcurry_65670", "title": "Lentejas y brotes de curry", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 ensalada de cebolla, en rodajas", "2 dientes de ajo picados", "½ cucharadita de polvo de cúrcuma", "½ cucharadita de semillas de comino", "½ cucharadita de polvo de curry suave", "2 vainas de cardamomo verde", "1 cucharada de puré de tomate", "100 g / 3½ oz de lentejas enlatadas, enjuagadas y escurridas", "50ml / 2fl oz de caldo de verduras calientes", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "2 chapatis listos para usar"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio. Agregue las cebollas y el ajo y fría por dos minutos, hasta que estén suaves.", "Agregue las especias y cocine durante dos minutos más.", "Agregue el puré de tomate, las lentejas y el caldo de verduras. Llevar a ebullición, luego reduzca el fuego a fuego lento durante cinco minutos.", "Agregue la crema y sazone con sal y pimienta negra recién molida.", "Para servir, vierta el lentejillo de curry en un recipiente tibio con los chipattis calientes servidos en un plato al lado."], "url": "www_bbc_co_uk_food_recipes_lentilcurry_83629", "title": "Curry de lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentilcurry_83629_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de lentejas verdes pequeñas, como puy", "1 diente de ajo, aplastado", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "20 g / 1 oz de albahaca fresca, aproximadamente desgarrada", "75g / 3oz de queso de cabra", "sal y pimienta negra recién molida"], "method": ["Coloque las lentejas en una olla pequeña, cubra con agua aproximadamente 6 cm / 2½ pulgadas y agregue el ajo. Llevar a ebullición, baje el fuego y cocine a fuego lento durante 20 minutos, o hasta que esté tierno.", "Escurra las lentejas y colóquelas en un tazón. Agregue un chorrito de jugo de limón, el aceite y tres cuartas partes de la albahaca, luego sazone.", "Desmenuce el queso de las cabras y espárzalo sobre el resto de la albahaca."], "url": "www_bbc_co_uk_food_recipes_lentils_and_goats_cheese_09590", "title": "Lentejas y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lentils_and_goats_cheese_09590_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cucharada de vinagre balsámico", "100 g / 3½ oz de lentejas enlatadas, enjuagadas y escurridas", "50g / 1¾oz de judías verdes frescas, escaldadas y picadas", "50g / 1¾oz cada perejil fresco, cilantro, cebollín", "sal y pimienta negra recién molida", "100g / 3½oz de carne de salchicha en forma de patty", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la ensalada de lentejas, mezcle todos los ingredientes de la ensalada en un tazón y sazone con sal y pimienta negra recién molida.", "Para la salchicha de Toulouse, frote la hamburguesa con el aceite de oliva y fríe en la sartén durante dos minutos por cada lado, hasta que esté ligeramente dorado.", "Sirva la ensalada de lentejas en un plato para servir con la hamburguesa en la parte superior."], "url": "www_bbc_co_uk_food_recipes_lentilsaladwithherbs_85820", "title": "Ensalada de lentejas con hierbas y salchicha de Toulouse", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]