[{"ingredients": ["165 g / 5¾oz de mantequilla sin sal, ablandada", "Azúcar en polvo 135g / 5oz", "Harina normal 330g / 11½oz, más extra para amasar", "75g / 2½ oz de harina de maíz", "6 cucharadas de levadura en polvo", "75 g / 2½ oz de cacao en polvo", "5 cucharadas de jarabe de oro", "4 naranjas grandes, solo cáscara", "600g / 1lb 5oz de azúcar glas real", "1 naranja grande, solo jugo", "colorante de alimentos en gel en verde, naranja, rojo y amarillo"], "method": ["En un tazón grande, bata la mantequilla y el azúcar con una cuchara de madera hasta que se combinen.", "En un recipiente aparte, tamice la harina, la harina de maíz, el polvo de hornear y el cacao en polvo. Mezcle bien y agregue a la mezcla de mantequilla. Agregue el jarabe dorado y la ralladura de naranja. Mezcle hasta que se incorpore y luego, con las manos, amase suavemente hasta que todo esté completamente combinado. Envuelva la masa en una película adhesiva y refrigere durante 15 minutos.", "Precaliente el horno a 185C / 165C Fan / Gas 4½ y forre una bandeja grande para hornear con papel de hornear.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta que tenga aproximadamente 5 mm / ¼ de grosor. Usando una plantilla, recorte formas para parecerse a un ramo de flores. Coloque en la bandeja preparada y coloque en el congelador durante 10 minutos o la nevera durante 30 minutos.", "Después de enfriar, hornee los bizcochos por aproximadamente 17 minutos. Deje que los bizcochos se enfríen en la bandeja durante 10 minutos, luego transfiéralos a los estantes de enfriamiento.", "Mientras tanto, haz la guinda. Ponga el azúcar glas en un tazón grande o en un mezclador independiente. Agregue la mitad del jugo de naranja y mezcle a velocidad media-alta durante 5 minutos: la textura debe ser espesa pero con suficiente líquido para pasarla a la tubería, agregue jugo extra si es demasiado espesa.", "Coloque una sexta parte del glaseado en una bolsa de plástico con una boquilla pequeña y lisa. Pase una línea de glaseado alrededor del borde de los bizcochos para formar un contorno, asegurándose de que no haya huecos (esto se rellenará con una capa de hielo más delgada usando una técnica de \"inundación\"). Reserve a un lado durante 15 minutos para permitir que se forme la guinda. Cualquier resto de formación de hielo se puede devolver al tazón principal.", "Coloque la mitad del resto del glaseado en un recipiente aparte y mezcle suficiente jugo de naranja para obtener una consistencia vertible (debe ser lo suficientemente fina para que se escurra lentamente una cucharadita). Para rellenar el contorno entubado en la capa de hielo más gruesa, use una cucharilla para echar la fina capa de hielo en el centro de la galleta y empujar suavemente hacia los bordes. Agite suavemente la galleta para alisar la superficie y asegúrese de que la formación de hielo llene por completo el contorno. Repita con los bizcochos restantes y déjelos a un lado durante 20-30 minutos, o hasta que se haya establecido el glaseado.", "Para decorar, divide el resto del glaseado más grueso entre 4 tazones. Use colorante de gel para hacer glaseado verde, naranja, rosa y amarillo. Con una cuchara, coloque los glaseados de colores en bolsas de plástico con pequeñas boquillas sencillas.", "Decora cada galleta colocando un pequeño ramo de flores, usando el verde para hacer tallos y los otros colores como cabezas de flores. Separe para secar antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_56288", "title": "Galletas heladas de chocolate y naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_56288_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol o vegetal, para engrasar", "1 litro / 1¾pints vertiendo crema doble", "200 g / 8 oz% 20plain% 20chocolate,% 20finely% 20chopped% 20 (50% 20cocoa% 20solids% 20is% 20fine)", "7 naranjas", "100 g / 3½ oz de azúcar en polvo", "4 hojas de gelatina de grado platino o 9 hojas de gelatina regular, empapados en agua durante 10 minutos."], "method": ["Muy ligeramente aceite las cuencas de pudín o moldes.", "Caliente la crema doble en una sartén pequeña hasta que hierva. Retire del fuego, revuelva en el chocolate y revuelva continuamente hasta que el chocolate se haya derretido completamente.", "Ralla la ralladura de cuatro naranjas y agrégala a la crema de chocolate. Exprime el jugo de dos naranjas y agrega ocho cucharadas de jugo a la mezcla de chocolate con el azúcar. Guarde todas las naranjas restantes.", "Cuando la gelatina se haya ablandado, retírela del agua, sacuda el exceso de agua y coloque la gelatina en la mezcla de chocolate caliente - revuelva hasta que se disuelva.", "Cuele la mezcla a través de un colador y luego divídala en partes iguales entre las cuencas de budines engrasados", "Coloque en la nevera y deje que la panna cotta se ponga durante la noche o durante al menos seis horas.", "Mientras tanto, prepara los segmentos de naranja. Con un cuchillo de sierra, corte toda la cáscara y la médula blanca de las naranjas restantes (incluida la que haya zested), trabajando sobre un recipiente para atrapar los jugos. Corte entre las membranas de color naranja para eliminar los segmentos. Coloque los segmentos de naranja en el jugo y enfríe en la nevera con panna cottas.", "Para terminar, llene un recipiente con agua hirviendo, luego sumerja los moldes por solo un segundo en el agua hirviendo, ya no más o la mezcla se derretirá demasiado. Invierta los moldes en un plato para servir, con algunos segmentos de naranja en cada plato."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_61942", "title": "Panna cotta de chocolate y naranja", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, suavizada, más 15 g / ½ onza de mantequilla, derretida", "200g / 7oz de azúcar glasé", "200 g / 7oz de claras de huevo pasteurizadas", "Harina normal 220g / 8oz", "colorante de comida naranja", "180 g / 6oz de claras de huevo pasteurizadas, a temperatura ambiente", "25g / 1 oz de azúcar granulada", "225gr / 8 oz de almendras molidas", "225g / 8oz de azúcar glas, cernida", "6 huevos de gallinas camperas", "Harina normal de 40 g / 1½ oz", "40 g / 1½ oz de cacao en polvo", "85 g / 3 oz de mantequilla clarificada, derretida", "1 naranja, ralladura y jugo", "1 cucharadita de gelatina en polvo", "Chocolate normal de buena calidad de 175g / 6oz, roto en pedazos", "2 huevos de gallinas camperas, separados", "Crema doble de 300 ml / ½ pinta, llevada a los picos suaves", "300ml / ½ litro de jugo de naranja", "5 cucharaditas de arrurruz", "Crema doble de 300 ml / ½ pinta, llevada a los picos suaves", "3 naranjas", "polvo de cacao"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Coloque dos bandejas para hornear de 45cm x 30cm / 18in x 12in con papel antigrasa y cepille con la mantequilla derretida. Alinee la base y los lados de una lata de torta Springform de 25 cm / 10 in con papel resistente a la grasa.", "Para hacer que la joconde se pegue, bata la mantequilla y el azúcar hasta que esté suave y esponjoso, luego agregue las claras de huevo, batiendo continuamente. Doble la harina tamizada y luego agregue el colorante para alimentos. Coloque la mezcla en una bolsa para tubos con una boquilla simple de 5 mm / ¼ in. Pipe la mezcla en las bandejas de la hornada en un patrón de remolino.", "Para hacer la esponja joconde, bata las claras de huevo hasta que se formen picos suaves cuando se quite la batidora. Agregue el azúcar granulada y continúe batiendo hasta que se formen picos rígidos. Cubra con película adhesiva para evitar el colapso del merengue.", "Batir las almendras, el azúcar glas y los huevos en un bol hasta que la mezcla esté suave y esponjosa. Mezcle la harina y el cacao en polvo.", "Doble suavemente la mezcla de merengue con una espátula grande. Mezcle una taza de la pasta de esponja en la mantequilla clarificada, luego doble esto en la masa restante.", "Retire las bandejas de hornear con las hojas decoradas de papel resistente a la grasa del congelador. Divida la mezcla de manera uniforme entre las dos bandejas para hornear, extendiéndola suavemente sobre las decoraciones y asegurándose de que esté nivelada.", "Hornee durante 5-7 minutos o hasta que las esponjas estén ligeramente doradas. Cubra cada esponja con una hoja de papel resistente a la grasa y luego voltee las bandejas de horneado sobre la superficie de trabajo y despegue el papel para revelar el patrón.", "Corta tiras de esponja para alinear los lados de la lata de la torta, asegurándote de que el patrón quede hacia afuera, luego corta un círculo de esponja para alinear la base. Corta un segundo círculo para hacer la parte superior del pastel.", "Para la mousse, vierta el jugo de naranja a través de un colador fino en un tazón pequeño y espolvoree sobre la gelatina. Deje la mezcla a un lado durante tres minutos, luego coloque el recipiente sobre una olla pequeña de agua hirviendo a fuego lento, teniendo cuidado de que el fondo del recipiente no toque el agua, y revuelva suavemente hasta que la gelatina se haya disuelto.", "Mientras tanto, coloca el chocolate en un tazón grande y derrítalo en el microondas, revolviendo cada 45 segundos. Mezcle la ralladura de naranja y las yemas de huevo en el chocolate derretido, luego agregue la mezcla de gelatina y agregue la crema batida.", "Batir las claras de huevo hasta que formen picos rígidos y doblar suavemente en la mezcla de chocolate. Vierta la mousse en la lata de la torta, coloque el círculo de la esponja en la parte superior y enfríe en la nevera durante al menos dos horas.", "Para el gelée de naranja, mezcle el arrurruz con un poco de jugo de naranja y mezcle con el resto del jugo. Caliente en una cacerola hasta que la mezcla se espese y aclare, luego retírela del fuego y déjela enfriar. Retire con cuidado la torta de la lata y colóquela en un plato para servir. Corte tiras finas de cáscara de las naranjas y ráscelas alrededor de una pajita. Vierta el gelée enfriado sobre la torta de mousse, decore con crema batida y rizos de naranja y polvo con cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_84539", "title": "Pastel de mousse de chocolate y naranja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700g / 1lb 9 oz de harina de auto aumento", "150 g / 5½ oz de mantequilla", "150 g / 5½ oz de azúcar en polvo", "2 naranjas grandes, ralladura finamente rallada de ambos y jugo de una naranja", "150 g / 5½ oz de gotas de chocolate", "200ml / 7fl oz de leche entera, más extra para cepillar", "nata", "2 satsumas"], "method": ["Precaliente el horno a 210C / 400F / Gas 6. Ligeramente unte con mantequilla dos bandejas para hornear.", "Tamiza la harina en un tazón. Frote la mantequilla con las manos hasta que la mezcla se asemeje a migas de pan finas. Agregue el azúcar, las gotas de chocolate y la ralladura de naranja.", "En una jarra medidora, mezcle la leche con el jugo de una naranja. Agregue a la mezcla de harina gradualmente hasta que la masa se una. Puede que no necesites todo el líquido. Tenga cuidado de no trabajar demasiado la masa del bollo.", "Extienda la masa a aproximadamente 2 cm / 1 pulgada de grosor y corte los bollos con un cortador de 5-6 cm / 2-2½ pulgadas.", "Transfiera los bollos a las bandejas para hornear untadas con mantequilla, cepille las partes superiores con leche y hornee en el centro del horno durante 10-12 minutos, o hasta que estén doradas.", "Retire del horno y deje enfriar en la rejilla. Servir con crema coagulada y satsumas."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_orange_87739", "title": "Bollos de chocolate y naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 14 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_orange_87739_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de chocolate negro", "4 huevos de gallinas camperas, separados", "125g / 4½ oz de azúcar en polvo, más extra para quitar el polvo", "2 cucharadas de cacao en polvo, tamizado", "Azúcar glas de 325g / 11½oz, tamizada", "100 g / 3½ oz de mantequilla, ablandada", "2 cucharadas de leche", "3-4 gotas de aceite de sabor a menta", "2 cucharadas de trocitos de chocolate negro"], "method": ["Cubra una lata de rollo suizo de 24x35cm / 9½x14in con papel resistente a la grasa y precaliente el horno a 180C / 350F / Gas 4.", "Derretir el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo.", "Batir las yemas de huevo con el azúcar en un tazón. Agregue el polvo de cacao, revuelva para combinar hasta que la mezcla se haya espesado, esté pálida y aumente de volumen.", "Batir las claras de huevo en un recipiente aparte hasta que estén firmes.", "Vierta el chocolate derretido en la yema de huevo y la mezcla de azúcar. Revuelva hasta que el chocolate esté completamente incorporado.", "Doble suavemente las claras de huevo.", "Vierta la mezcla en la lata preparada. Inclina la lata para que la mezcla se extienda a las esquinas.", "Hornee por 18-20 minutos, o hasta que esté firme y elástico para tocar.", "Una vez cocinado, coloque el rollo sobre un trozo de papel resistente a la grasa espolvoreado con azúcar en polvo.", "Retire suavemente el papel de revestimiento y cubra con una toalla de té húmeda. Deje que se enfríe completamente.", "Para el relleno, agregue gradualmente el azúcar glas a la mantequilla ablandada. Batir hasta que se incorpore todo el azúcar glas. Agregue el aceite de menta comestible a la leche y luego revuelva en la crema de mantequilla.", "Extienda el relleno en el rollo enfriado, dejando un espacio de 1.5cm / ¾in en cada borde. Espolvorea sobre las chispas de chocolate.", "Usando el papel resistente a la grasa para ayudarlo, enrolle el rollo desde uno de los extremos cortos. No te preocupes si se agrieta un poco. Transfiera a un plato de servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_peppermint_25149", "title": "Rollo de chocolate y menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_peppermint_25149_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 90g / 3¼ oz", "1 cucharadita de polvo de hornear", "55g / 2 oz de azúcar", "35 g / 1¼ oz de pistachos", "25 g / 1 oz de chocolate negro", "1 yema de huevo de gallinas camperas", "½ cucharadita de pasta de vainilla"], "method": ["Precalentar el horno a 160 ° C / 350 ° F / Gas 4.", "Combine todos los ingredientes secos en un bol, agregue la yema de huevo y la vainilla y mezcle bien para formar una masa.", "Amase ligeramente la masa en una superficie de trabajo enharinada hasta que esté suave, luego forme un tronco y colóquelo en una bandeja para hornear forrada con pergamino.", "Hornee durante 25 minutos, deje enfriar y luego corte en rodajas de aproximadamente 1 cm / ½ pulgadas de espesor. Coloque rebanadas en la bandeja de hornear y hornee de nuevo durante 5-10 minutos."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_pistachio_53327", "title": "Biscotti de chocolate y pistacho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 biscotti", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Ciruelas listas para consumir de 150 g / 5½ oz (idealmente de Agen), cortadas en cuartos", "1 cucharada de aguardiente", "1 cucharadita de extracto de vainilla", "50ml / 2fl oz de agua hirviendo", "75 g / 2½ oz de chocolate negro, partidos en trozos pequeños", "125ml / 4fl oz de crema doble", "200 g / 7 oz de mascarpone", "2 huevos medianos de rango libre, golpeados", "Harina normal 175g / 6oz", "2 cucharadas de azúcar glas", "2 cucharadas de cacao en polvo", "100 g / 3½ oz de mantequilla sin sal fría, cortada en aproximadamente 1 cm / ½ en dados", "1 huevo de gallinas camperas, solo yema", "1 cucharadita de jugo de limón", "2 cucharadas de agua fría"], "method": ["Para el relleno, ponga las ciruelas pasas, el brandy y la vainilla en un bol. Vierta sobre el agua hirviendo y deje en remojo durante varias horas o toda la noche.", "Para hacer la masa, tamice la harina, el azúcar glas y el cacao. Agregue la mantequilla en cubitos y frótela ligeramente con los dedos hasta que la mezcla se vea como pan rallado fino. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Mezcle la yema de huevo con el jugo de limón y agua. Use un cuchillo de mesa para trabajar el líquido en la harina. Agregue un poco más de agua si lo necesita. Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la masa en una película adhesiva y colóquela en la nevera para que repose durante al menos 15 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie ligeramente enharinada lo suficientemente grande como para forrar una lata agria de base suelta de 23cm / 9 pulgadas, de 3.5cm / 1½ pulgadas de profundidad, dejando el exceso de hojaldre colgando sobre el borde. Mantenga un poco de pasta cruda en caso de que necesite parchear las grietas más tarde. Cubra la masa con papel de hornear o papel de aluminio, y luego rellene con alubias, arroz crudo o lentejas.", "Hornee a ciegas durante 15 minutos, luego quite el pergamino y los frijoles para hornear y vuelva al horno durante unos ocho minutos, o hasta que la masa parezca seca.", "Use un cuchillo pequeño y afilado para recortar el exceso de masa del borde. Use un poquito de la masa cruda reservada para parchear las grietas o agujeros si es necesario. Baje el horno a 180C / 350F / Gas 4.", "Para el relleno, coloque el chocolate y la crema en un recipiente sobre una fuente de agua hirviendo, sin dejar que el recipiente toque el agua. Déjalo hasta que el chocolate se haya derretido, revolviendo de vez en cuando. Quítelo del fuego y déjelo enfriar por tres minutos, luego bata el mascarpone y los huevos. Use un batidor de globo para eliminar los grumos. Agregue las ciruelas pasas y los jugos en remojo.", "Vierta la mezcla de chocolate y ciruela en la caja de tarta. Hornee durante 20-25 minutos, o hasta que estén casi listos, con un poco de bamboleo en el centro. Deja en la lata para enfriar por completo.", "Sirva a temperatura ambiente, con crema batida doble."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_prune_tart_06797", "title": "Tarta de chocolate y ciruela", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_prune_tart_06797_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte, más extra para espolvorear", "sal hg", "25 g / 1 oz de azúcar en polvo, más extra para enrollar", "5 g de levadura instantánea", "70ml / 2⅓fl oz de leche entera descremada, calentada", "2 huevos grandes de gallinas camperas", "125g / 4½oz de mantequilla sin sal, ablandada", "9 frambuesas grandes", "100 g / 3% C2% BDoz% 20plain% 20chocolate% 20 (36%% 20cocoa% 20solids),% 20broken% 20into% 209% 20squares", "aceite de girasol, para freír en grasa", "50g / 1¾oz de chocolate blanco, derretido", "50g / 1¾oz de chocolate negro, derretido"], "method": ["Para las donas, ponga la harina en el cuenco de un mezclador independiente equipado con un gancho de masa. Agregue la sal y el azúcar a un lado del tazón y la levadura al otro. Agregue la leche y los huevos y mezcle a baja velocidad durante dos minutos, luego a velocidad media durante 6-8 minutos más, hasta que tenga una masa suave, brillante y elástica.", "Agregue la mantequilla ablandada a la masa y continúe mezclándola a velocidad media durante 4-5 minutos más, raspando los lados del recipiente de vez en cuando para asegurarse de que la mantequilla esté incorporada. La masa será muy suave.", "Coloque la masa en un recipiente de plástico, cubra con una película adhesiva y colóquela en el refrigerador durante la noche (o durante al menos siete horas), hasta que se haya endurecido y pueda darle forma.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amasarla un par de veces.", "Divida la masa en 18 porciones iguales (aproximadamente 30 g / 1 oz cada una) y alise cada porción ligeramente. Coloque un pedazo de chocolate o una frambuesa en el centro de cada pieza de masa. Luego dobla suavemente la masa sobre la frambuesa o el chocolate y dale forma de bola a cada porción. Mantenga los dos sabores separados y colóquelos en una bandeja grande para hornear en una bolsa de plástico y déjelos durante 20 minutos.", "Precaliente una freidora con grasa, llena de aceite de girasol, a 170C / 340F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Baje las rosquillas de chocolate con cuidado en la freidora, cocinando cada lado durante unos tres minutos, o hasta que estén doradas. Con una cuchara ranurada, retire con cuidado las rosquillas de la freidora y déjelas a un lado para drenarlas en el papel de cocina y deje que se enfríen completamente.", "Baje las rosquillas de frambuesa con cuidado en la freidora, cocinando cada lado durante unos tres minutos, o hasta que estén doradas. Retira del aceite con una cuchara ranurada e inmediatamente coloca el azúcar impalpable para que la grasa caliente ayude a que el azúcar se adhiera a los lados. Dejar de lado y dejar enfriar.", "Para decorar las rosquillas de chocolate, espolvoree el chocolate blanco y negro derretido en dos bolsas pequeñas y desechables. Corta los extremos y haz un patrón en zigzag de chocolate negro, luego de chocolate blanco, sobre cada rosquilla de chocolate. Deja para establecer. Una vez configurado, servir y disfrutar."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_raspberry_74498", "title": "Donuts de chocolate y frambuesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 18 donas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_and_raspberry_74498_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Frambuesas 300g / 10½ oz", "150 g / 5½ oz de azúcar en polvo", "¼ limón, solo jugo", "50ml / 2fl oz de vodka de frambuesa", "6 claras de huevo de gallinas camperas", "25g / 1 oz de azúcar granulada", "225gr / 8 oz de almendras molidas", "225g / 8oz de azúcar glas, cernida", "6 huevos de gallinas camperas", "Harina normal de 40 g / 1½ oz", "40 g / 1½ oz de cacao en polvo, tamizado", "85g / 3oz de mantequilla, derretida", "3 yemas de huevo de gallinas camperas, temperatura ambiente", "Azúcar en polvo de 55 g / 2 oz", "2 cucharadas de agua", "225g / 8oz de mantequilla sin sal, en cubos, ablandada", "1 cucharadita de esencia de vainilla", "125g / 4½oz de chocolate blanco, derretido", "Frambuesas 300g / 10½ oz", "115g / 4oz de mantequilla sin sal ablandada", "115g / 4oz de azúcar glas", "115 g / 4 oz% 20plain% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids),% 20melted", "Licor de frambuesa 30-50ml / 1-2fl oz", "250 g / 9 oz% 20plain% 20chocolate% 20 (% 2070% 20cocoa% 20solids mínimo)", "125ml / 4fl oz de jarabe de oro", "125ml / 4fl oz de crema doble"], "method": ["Para el jarabe de frambuesa, precaliente el horno a su configuración más baja.", "Coloque las frambuesas en un recipiente a prueba de horno, cubra con el azúcar y colóquelas en el horno durante una hora.", "Presione la fruta ablandada con una cuchara para liberar el jugo. Mezcle la mezcla hasta que el jugo y el azúcar estén bien combinados, luego presione la mezcla a través de un colador.", "Agregue el zumo de limón y el vodka de frambuesa, déjelo enfriar y colóquelo en el refrigerador.", "Para la esponja joconde, precaliente el horno a 220C / 425F / Gas 7. Engrase y forme dos bandejas para hornear de 46cm x 33cm / 18in x 13in.", "Batir la clara de huevo en un tazón limpio hasta que se formen picos suaves cuando se quita la batidora. Bata lentamente el azúcar y continúa batiendo hasta que se formen picos fuertes. Cubra el tazón con film transparente y déjelo a un lado.", "Batir las almendras, el azúcar glas y los huevos juntos en un tazón por separado durante 3-5 minutos, o hasta que la mezcla haya duplicado su volumen. Doble la harina y el cacao en polvo.", "Doble suavemente las claras de huevo batidas en la mezcla.", "Ponga un poco de la mezcla en la mantequilla derretida y mezcle hasta que esté bien combinada.", "Incline la mezcla de mantequilla en la mezcla de torta y dóblese hasta que se combinen.", "Divida la mezcla de manera uniforme entre las dos latas, extendiéndola suavemente, especialmente en las esquinas.", "Hornee durante 5-7 minutos, o hasta que estén pálidas doradas y cocidas. Retire las tortas del horno, cubra con un pedazo grande de papel resistente a la grasa y cumpla con cuidado las tortas. Despegue el papel antigrasa del fondo de la lata. Corta cada pastel por la mitad y déjalo a un lado para que se enfríe por completo.", "Mientras tanto, para la crema de mantequilla francesa, bata las yemas de huevo durante cinco minutos en un tazón, o hasta que estén pálidas y espumosas.", "Caliente el azúcar y el agua en una cacerola hasta que alcance los 120 ° C / 250 ° F (use un termómetro de azúcar para verificar esto).", "Mientras bate las yemas de huevo, vierta lentamente el almíbar por los lados del tazón. Continúe batiendo por otros cinco minutos o hasta que el recipiente ya no esté caliente al tacto.", "Batir la mantequilla en la mezcla, una pieza a la vez, luego agregar la esencia de vainilla y el chocolate derretido. Doble suavemente las frambuesas en la crema de mantequilla. Dejar de lado.", "Para la crema de mantequilla de chocolate, bata la mantequilla y el azúcar glas juntos en un bol hasta que estén pálidos y esponjosos. Batir el chocolate derretido y el licor.", "Para la ganache de chocolate, divide el chocolate en trozos pequeños y colócalos en un bol.", "Caliente el jarabe dorado y la crema doble en una cacerola hasta que hierva. Vierta la mezcla de crema en el chocolate y déjela a un lado durante dos minutos.", "Batir el ganache hasta que quede suave, luego mezcle con suficiente agua caliente para aflojar la ganache en una consistencia vertida.", "Para armar el pastel, coloque un cuadro de pastel en un plato de servir y cepille generosamente con jarabe de frambuesa. Extienda más de la mitad de la crema de mantequilla francesa.", "Cubra con otro pastel cuadrado y generosamente cepille con más jarabe de frambuesa. Extendido sobre la crema de mantequilla de chocolate. Coloque otro pastel en la parte superior y cepille generosamente con el jarabe de frambuesa. Extendido sobre la mayor parte de la crema de mantequilla francesa restante (reservando tres cucharadas para la parte superior).", "Cubra con la torta final y broche generosamente con el jarabe de frambuesa. Extienda con la crema de mantequilla francesa restante.", "Finalmente, extiende la ganache de chocolate sobre la parte superior de la torta, hasta los bordes.", "Deje la torta para enfriar en la nevera durante 30 minutos, o hasta que la formación de hielo se haya endurecido, luego recorte los bordes con un cuchillo afilado."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_raspberry_84016", "title": "Tarta de ópera de dos niveles de chocolate y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de queso crema con toda su grasa", "100 ml / 3½ fl oz crema fresca", "1 vaina de vainilla, partida por la mitad y semillas raspadas", "Crema doble 75ml / 3fl oz", "50g/1¾oz dulce de leche", "½ cucharadita de sal marina", "40 g / 1½ oz de azúcar en polvo", "1 banana, pelada, termina recortada", "25g / 1oz de mantequilla", "1 galleta digestiva de chocolate", "25g / 1oz% 20dark% 20chocolate,% 2070 %% 20cocoa,% 20grated"], "method": ["Para la crema de caramelo, coloca el queso crema, la crema fresca, las semillas de vainilla y 50 ml / 2 fl oz de la crema doble en un tazón y bate hasta que estén bien combinados.", "Pon el dulce de leche y la sal en un tazón pequeño y mezcla. Doble ligeramente en la mezcla de crema hasta que quede todo veteado. Dejar de lado.", "Caliente el azúcar en una sartén hasta que esté dorado y líquido. Agregue el plátano y el abrigo en el caramelo.", "Retire el plátano, bata la mantequilla y el resto de la crema en el caramelo en la sartén, luego vuelva a colocar el plátano y cubra una vez más.", "Para servir, desmenuce la galleta en un plato de servir, coloque el plátano recubierto de caramelo en la parte superior, rocíe con la salsa de caramelo de la sartén en la que cocinó el plátano. Termine con una cucharada de crema de caramelo. Finalmente, espolvorea el chocolate rallado sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_salted_32364", "title": "Tarta de queso banoffee con caramelo salado y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Almendras en copos de 25g / 1oz", "spray de liberación de pastel", "1 cucharada de cacao en polvo, para quitar el polvo", "1 cucharada de jarabe de oro", "Azúcar en polvo de 65 g / 2¼ oz", "Crema doble de 80ml / 3oz", "¼ cucharadita de sal gema", "55 g / 2 oz de mantequilla, sin sal", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids),% 20broken% 20into% 20pieces% 20", "Harina normal de 30g / 1oz, tamizada", "3 huevos grandes de gallinas camperas", "30 g / 1 oz de azúcar en polvo", "35g / 1¼ oz de azúcar moreno oscuro", "pizca de sal", "100ml / 3½ fl oz crema doble", "50g / 1¾oz de azúcar glas", "1 vaina de vainilla, dividida por la mitad a lo largo y semillas raspadas"], "method": ["Tueste ligeramente las almendras en copos en una sartén seca a fuego lento. Cuando el marrón dorado pálido los deje a un lado para que se enfríen.", "Rocíe los moldes de pudín con spray de liberación de pastel y luego divida las almendras en copos entre los moldes. Usando un pequeño tamiz, espolvoree generosamente el interior de los moldes con cacao en polvo. Coloque en el congelador.", "Para el caramelo salado, coloca el jarabe dorado, el azúcar impalpable y cuatro cucharadas de agua en una sartén pequeña. Calienta suavemente hasta que el azúcar se disuelva.", "Usando un termómetro de azúcar, verifique la temperatura del caramelo. Cuando llegue a 160 ° C / 320 ° F retírelo del fuego y agregue la crema y la sal. Con cuidado, vierta el caramelo en una bandeja de cubitos de hielo. Deje que se enfríe y luego colóquelo en el congelador durante aproximadamente 30 minutos.", "Para los postres, derrita la mantequilla en una cacerola grande a fuego lento. Retirar del fuego y agregar el chocolate. Reserve para dejar que el chocolate se derrita en la mantequilla caliente, revolviendo ocasionalmente. Una vez que esté frío (pero aún líquido) agregue la harina tamizada y revuelva hasta que se incorpore y suavice.", "Rompa los huevos en un tazón grande y resistente al calor. Coloque el recipiente sobre una fuente de agua hirviendo a fuego lento (no permita que el agua toque el recipiente). Batiendo los huevos todo el tiempo, agregue gradualmente los azúcares hasta que la mezcla esté pálida, ligera y esponjosa (aproximadamente siete minutos con un mezclador manual). Retire la mezcla del fuego y doble en la mezcla de chocolate y una pizca de sal.", "Tome los moldes del congelador y llénelos uniformemente con la mezcla. Coloque los moldes en la nevera y deje enfriar durante al menos 30 minutos.", "Para la crema de vainilla, bata la crema hasta que comience a espesar, luego dobla el azúcar y las semillas de vainilla. Ponga una cuchara en una manga pastelera y póngala en la nevera.", "Para los postres, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Seleccione una bandeja para hornear lo suficientemente grande como para caber los moldes de pudín.", "Trabajando rápidamente, retire los moldes del refrigerador y colóquelos en la bandeja de hornear. Retire el caramelo salado del congelador y saque el contenido con una cucharilla y empuje en la mezcla de pudín, asegurándose de que los caramelos estén encerrados en la mezcla de pudín.", "Hornee durante 12 minutos, o hasta que los lados se vean cocidos, pero el centro todavía esté un poco tambaleante. Retirar del horno y dejar reposar los postres en sus moldes durante tres minutos.", "Deslice una pequeña cuchilla de paleta alrededor de los bordes interiores de los moldes y con cuidado los convierten en platos de servir. Ponga un poco de crema de vainilla al lado de cada pudín y sirva."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_salted_33158", "title": "Postres fundidos de chocolate y caramelo salado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 4 postres individuales", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de fresas frescas", "200 g / 7 oz conservando mermelada de azúcar", "1 lima, cáscara y 1 cucharada solo de jugo", "400g / 14oz de crema de coco con toda su grasa", "1½ cucharadas de gránulos de café instantáneo", "50 g / 1 oz de azúcar en polvo", "1½ cucharada de cacao en polvo", "¼ de cucharadita de sal de mesa", "1 TSP If-If", "2 huevos grandes de gallinas camperas", "200g / 7oz de crema de coco", "3 cucharadas de néctar de agave", "6 g de fresas liofilizadas", "2 cucharadas de mermelada de fresa (del atasco enfriado arriba)", "50 g / 1¾oz de fresas, machacadas", "1 TSP If-If", "1 lima, ralladura solamente", "1 clara de huevo grande de gallinas camperas", "Harina normal de 40 g / 1½ oz", "30 g / 1 oz de azúcar en polvo", "30 g / 1 oz de mantequilla sin lácteos (soja), más extra para engrasar", "rosa colorante de comida rosa", "4 huevos grandes de gallinas camperas", "100 g / 3½ oz de azúcar en polvo, extra para quitar el polvo", "100g / 3½ oz de harina de auto crianza", "200 g / 7 oz de fresas frescas, cascadas", "100g / 3½oz de chocolate negro sin lácteos", "50g / 1¾oz de chocolate blanco sin lácteos", "fresas deshidratadas"], "method": ["Para la mermelada, coloque las fresas en una sartén y use un triturador de patatas para aplastar las fresas. Agrega el azúcar Cocine a fuego medio hasta que el atasco alcance los 105 ° C o compruebe si hay arrugas en un plato frío para verificar si el atasco está listo. Agregue la ralladura de limón y el jugo y deje enfriar. Una vez que se haya enfriado, mezcle con una batidora de mano para eliminar los grumos. Dejar de lado.", "Para el helado de chocolate, asegúrese de que los componentes de congelación de su máquina para hacer helados estén en el congelador y congelados.", "Caliente la crema de coco en la sartén con cuidado, no hierva. Una vez caliente, agregue los gránulos de café.", "En un recipiente, mezcle el azúcar, el cacao, la sal y el agar-agar. Añadir los huevos y mezclar bien. Agregue la crema de coco calentada gradualmente, batiendo todo el tiempo. Transfiera la mezcla a la sartén y revuelva durante 8-10 minutos, o hasta que la mezcla se espese. Una vez que esté espeso, transfiéralo a una bandeja poco profunda y déjelo en el congelador para que la mezcla se enfríe. Una vez que se haya enfriado, batir en la máquina para hacer helados por al menos 45 minutos. Coloque el helado en el congelador.", "Para el helado de mousse de fresa y lima, bata la crema de coco en un bol hasta que esté suave y esponjosa. Agregue el néctar de agave, fresas secas, 2 cucharadas de mermelada de fresa, fresas, agar-agar y ralladura de limón y mezcle bien. Batir hasta que la mezcla esté ligera y esponjosa y bien incorporada. Transfiera a una máquina para hacer helados y revuelva hasta que quede suave. Colóquelo en una manga pastelera y pise una línea de aproximadamente 2.5 cm / 1 pulgada de ancho y mientras su suizo ruede lata (aproximadamente 33 cm). Envuelva la línea de tubería en una película adhesiva en forma de salchicha. Deja en el congelador para establecer por completo.", "Para la pasta decorativa, mezcle todos los ingredientes, excepto el colorante de alimentos, junto con una pasta suave. Agregue el colorante de alimentos para hacer un color rosa vibrante. Coloque el pegamento en bolsas de tubería con un acoplador de boquilla y punta de escritura unida (idealmente Wilton 2).", "Dibuje una plantilla de Paisley en una hoja de pergamino para hornear. Alinee un rollo de papel suizo con el papel y engrase ligeramente. Pipe el diseño con la pasta decorativa. Coloque la bandeja en el congelador durante 10 minutos.", "Para la esponja sin grasa, precalentar el horno a 200C / 180C Ventilador / Gas 6. Batir los huevos y el azúcar en un bol hasta que lleguen a la etapa de cinta (esto significa que la mezcla mantiene su forma durante unos segundos cuando se rocía el mezcla de nuevo sobre sí mismo). Tamiza la harina y dóblala con una cuchara de metal. Extiende la mezcla sobre el diseño y hornea durante 8-10 minutos en el estante del medio.", "Retire la esponja del horno y déjela sobre una hoja de pergamino para hornear en una rejilla para enfriar. Presione la esponja hacia abajo y recorte para adelgazar si es necesario. Darle la vuelta para que el lado del dibujo quede hacia abajo, enrollar suavemente y dejar enfriar en una toalla de té limpia.", "Para las fresas bañadas, rompa el chocolate en pedazos y derrita en tazones separados sobre una fuente de agua hirviendo. Coloque puntos de chocolate blanco en el chocolate negro y arrastre un pincho para rellenarlo. Sumerja las fresas en el chocolate con plumas y déjelo reposar en la nevera.", "Para ensamblar, vierta el helado de chocolate ablandado en una hoja de película adherida en un rectángulo, siempre que el rodillo suizo ruede y tenga aproximadamente 12.5cm de ancho. Coloque la mousse de fresa congelada en la parte superior. Envuélvela en una película adhesiva envolviendo la mousse de fresa en el helado de chocolate. Enrolle la película adhesiva y déjela en el congelador para reafirmarla. Desenrolle la esponja y la capa con una ligera extensión del atasco.", "Coloque el rollo de helado firme en la parte superior y enrolle. Corta los extremos irregulares, vuelve a envolver en papel resistente a las grasas y regresa al congelador para congelarlo.", "Aprieta para hacer que todo se adhiera. Desenvuelva y coloque en un plato de servir. Coloque las fresas bañadas en la parte superior. Esparce sobre algunas fresas deshidratadas y sirve."], "url": "www_bbc_co_uk_food_recipes_chocolate_and_strawberry_83139", "title": "Rollo de helado de chocolate y fresa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 rollo grande de helado", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 plátano maduro pelado pequeño, picado, congelado", "3 cucharadas de cacao en polvo", "2 cucharaditas de aceite de coco", "1 aguacate maduro", "1 cucharadita de extracto de vainilla", "1-2 cucharadas de miel, preferiblemente miel cruda, al gusto", "pequeña pizca de sal"], "method": ["Mezcle todos los ingredientes y 750 ml / 1 pinta de 6 fl oz de agua fría juntas en un procesador de alimentos hasta que quede suave. Agregue más agua para aflojar, si es necesario.", "Para servir, vierta en vasos pequeños."], "url": "www_bbc_co_uk_food_recipes_chocolate_avocado_shake_50246", "title": "Batido de chocolate y aguacate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_avocado_shake_50246_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "25 g / 1 oz de cacao en polvo", "1 cucharadita de polvo de hornear", "¼ cucharadita de bicarbonato de soda", "pizca de sal", "200 g / 7 oz de azúcar en polvo de oro", "2 plátanos muy maduros, pelados, puré", "2 huevos de gallinas camperas, golpeados", "125g / 4½ mantequilla, derretida", "100g / 3½oz de chocolate blanco de buena calidad, picado", "50g / 2oz de avellanas picadas tostadas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de pan.", "Tamice la harina común, el cacao en polvo, el polvo de hornear, el bicarbonato de soda, la sal y el azúcar en un tazón grande y mezcle hasta que estén bien combinados.", "Aplaste los plátanos en un recipiente aparte, agregue los huevos y la mantequilla derretida.", "Dobla la mezcla de plátano en la mezcla de harina hasta que se combine. Dobla el chocolate y las nueces y coloca la mezcla en la lata del pan.", "Hornee durante 50-60 minutos, o hasta que la torta se haya levantado y un pincho insertado en el centro salga limpio. Retire la torta del horno, deje enfriar en una rejilla de alambre durante 10 minutos, luego retire la torta de la lata. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_chocolate_banana_cake_06955", "title": "Pastel de plátano y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_banana_cake_06955_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina blanca fuerte, más extra para quitar el polvo", "2½ cucharadas de especias mixtas molida", "¼ cucharadita de sal", "8g levadura de acción rápida", "33g / 1¼ oz de mantequilla sin sal, suavizada", "66g / 2½ oz de azúcar en polvo de oro", "200 ml / 7 fl oz de leche semidesnatada", "1 huevo grande de gallinas camperas", "100g / 3½oz de fruta seca mixta", "30g / 1oz de cáscara confitada mixta", "100g / 3½oz de chips belgas de chocolate con leche", "1 cucharada de aceite de girasol, para engrasar", "1 cucharada de azúcar en polvo", "50ml / 2fl oz de agua hirviendo", "50g / 1¾oz de chocolate negro, finamente picado", "50g / 1¾oz de chocolate blanco, finamente picado"], "method": ["Para el pan, forre una bandeja para hornear con papel de horno y aspire generosamente con harina.", "Tamiza la harina, mezcla las especias y la sal en un tazón grande. Agregue la levadura en el lado opuesto a la sal. Agregue la mantequilla y el azúcar. Mezcle usando su mano en posición de garra hasta que esté bien combinado.", "Suavemente caliente la leche hasta que esté tibia al tacto, luego bata el huevo.", "Haga un pozo en el medio de la mezcla seca y vierta la mezcla de leche en él. Espolvorea tus manos con harina y mezcla con tu mano como antes, hasta que la masa se una. Formará una masa muy húmeda. Amasar la masa durante 10-15 minutos en el tazón (use un raspador de masa si tiene uno), o hasta que la masa comience a tensarse (aunque seguirá siendo pegajosa). Raspe regularmente cualquier masa pegada a sus manos.", "Harina la superficie de trabajo y sus manos. Extienda la masa en un rectángulo áspero y agregue la fruta seca, la cáscara confitada y el chocolate en el centro de la masa. Amasar durante otros 2 minutos para incorporar.", "Coloque la masa en la bandeja preparada y déle forma a un óvalo. Espolvorear ligeramente con harina y cubrir con una película adhesiva engrasada. Deje en un lugar cálido para probar durante una hora o hasta que duplique su tamaño.", "Precalentar el horno a 195C / 175C Fan / Gas 5.", "Una vez que se prueba la masa, retire la película adhesiva y barra una vez longitudinalmente en la parte superior con un cuchillo afilado. Hornee durante 40 minutos en el estante inferior del horno, girando la bandeja hasta la mitad de la cocción para asegurarse de obtener una costra homogénea (el pan debe ser de color marrón oscuro). Si los bordes inferiores se doran demasiado temprano, envuelva una tira de papel de aluminio alrededor del pan.", "Justo antes de que el pan esté cocido, haga el glaseado. Mezcle el azúcar con el agua hirviendo en un tazón pequeño hasta que el azúcar se disuelva.", "Coloque el pan en una rejilla de alambre y, mientras todavía esté caliente, cepille generosamente el esmalte sobre la costra.", "Para decorar, derrita suavemente el chocolate negro en un microondas o baño María. Dejar enfriar durante 5 minutos y luego verter generosamente sobre el pan. Repite con el chocolate blanco."], "url": "www_bbc_co_uk_food_recipes_chocolate_barmbrack_09509", "title": "Pan de chocolate barmbrack", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_barmbrack_09509_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de chocolate negro de buena calidad toscamente picado", "200g / 7oz de mantequilla sin sal, ablandada, más extra para engrasar", "250g / 8¾oz de azúcar glasé", "3 huevos de gallinas camperas", "Harina común 110g / 4oz", "4 claras de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "½ cucharadita de crema de tártaro", "100 g / 3½ oz de avellanas, asadas, picadas", "300ml / 10½ fl oz crema batida", "100g // 3½oz de azúcar glasé", "Frambuesas 200 g / 7 oz", "", "puñado de avellanas, picadas", "puñado de pistachos picados"], "method": ["Precaliente el horno a 190C / 375F / Gas 5. Engrase y alinee dos latas de emparedado de 23cm / 9in", "Para la base de brownie, derrita 180g / 6¼oz del chocolate en un tazón sobre una sartén sobre agua hirviendo a fuego lento. Picar el chocolate restante y reservar.", "Mientras tanto, unte la mantequilla y el azúcar glas en un tazón aparte hasta que estén suaves, cremosos y esponjosos. Batir lentamente los huevos, uno a la vez, hasta que estén bien combinados.", "Poco a poco bata la harina hasta que la mezcla esté muy suave. Vierta lentamente el chocolate derretido y dóblelo en la mezcla, luego vierta el chocolate picado.", "Vierta la mezcla de brownie en las latas sandwich preparadas y hornee durante 10-12 minutos. Reduzca la temperatura del horno a 170 C / 325 F / Gas 3.", "Mientras tanto, para el relleno de merengue, bata las claras de huevo y la crema de tártaro en un bol hasta que se formen picos suaves cuando se quite el batidor. Bata lentamente el azúcar hasta que quede suave y brillante, luego dobla las avellanas picadas con una cuchara de metal.", "Coloque el relleno de merengue en la base de brownie cocida. Use una espátula para alisar la mezcla de merengue en una lata de sándwich y use un pincho para hacer picos en la mezcla de merengue en la otra lata.", "Devuelva las latas de sándwich al horno por otros 30 minutos o hasta que el merengue esté dorado. Retirar del horno y reservar para enfriar. Retire con cuidado los pasteles de la lata y déjelos a un lado para que se enfríen completamente en una rejilla de alambre.", "Para el relleno, batir la crema y el azúcar glas juntos en un bol hasta que se formen picos rígidos cuando se quite el batidor. Doble las frambuesas.", "Para ensamblar, coloque el merengue plano de brownie, el lado del merengue sobre un soporte de pastel o un plato grande, cubra la crema de frambuesa y cubra con la torta restante, con el lado del brownie hacia abajo. Espolvorea sobre las avellanas picadas y los pistachos."], "url": "www_bbc_co_uk_food_recipes_chocolate_brownie_64092", "title": "Pastel de merengue brownie de chocolate con crema de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownie_64092_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Propagación de girasol bajo en grasa 125 g / 4½ oz", "2 huevos de gallinas camperas", "125g / 4½oz de azúcar morena suave", "Harina de auto crianza de 75g / 2¾oz", "50 g / 1¾oz de cacao en polvo, tamizado, más extra para decorar", "50g / 1¾oz de chocolate negro liso, picado", "1 cucharadita de extracto de chocolate", "pizca de sal"], "method": ["Precaliente el horno a 190C / 170C Ventilador / Gas 5. Engrase y forre una lata de torta cuadrada de 18cm / 7in de profundidad.", "Batir la extensión de girasol, los huevos y el azúcar. Agregue la harina y el cacao en polvo, luego agregue el chocolate y el extracto de chocolate. Agregue 1 cucharadita de agua hirviendo y una pizca de sal.", "Transfiera la mezcla al molde preparado y hornee durante 30 minutos, o hasta que un pincho salga limpio cuando se inserte en el centro.", "Dejar enfriar en la lata y luego cortar en 9 cuadrados. Polvo con un poco de cacao en polvo y servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_brownies_32438", "title": "Brownies de chocolate bajos en grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 9 brownies", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_brownies_32438_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1% C2% BEoz% 20buena calidad% 20dark% 20chocolate% 20 (% mínimo 2070%% 20cocoa% 20solids)", "100g / 3½oz de mantequilla sin sal, ablandada", "200g / 7oz de azúcar glasé", "1 cucharadita de extracto de vainilla", "leche, para aflojar"], "method": ["Derrita el chocolate en un tazón sobre una fuente de agua hirviendo. (No permita que la base del recipiente toque la superficie del agua). Deje que se enfríe hasta que el chocolate ya no se sienta caliente al tacto.", "Batir la mantequilla en un bol hasta que esté suave, luego gradualmente batir en el azúcar glas. Agregue el extracto de vainilla y bata nuevamente.", "Dobla el chocolate derretido hasta que esté completamente incorporado (agrega unas gotas de leche si la mezcla está un poco tieso).", "Esta formación de hielo se puede mantener en la nevera durante unos días. Llevar a temperatura ambiente y batir de nuevo hasta que quede suave antes de glasear tu pastel."], "url": "www_bbc_co_uk_food_recipes_chocolate_buttercream_11918", "title": "Glaseado de mantequilla de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace suficiente para llenar y cubrir un pastel de 20cm / 8 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_buttercream_11918_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120ml / 3¾fl oz de leche entera", "50 g / 1 oz de azúcar en polvo", "1½ cucharadita de levadura de acción rápida", "1 huevo grande de gallinas camperas", "Harina blanca fuerte 280g / 10oz, más extra para quitar el polvo", "½ cucharadita de sal", "1 cucharadita de semillas de cardamomo verde molido", "60 g / 2¼ oz de mantequilla sin sal, suavizada, más extra para engrasar", "60 g / 2 oz de chocolate negro, picado en trozos pequeños", "15g / ½ oz de chocolate blanco, picado en trozos pequeños", "Avellanas de 25 g / 1 oz, picadas en trozos pequeños", "1 yema de huevo grande de gallinas camperas", "130 g / 4 oz de azúcar en polvo"], "method": ["Para la masa, combine la leche, la mitad del azúcar y la levadura en una jarra. Agregue el huevo y bata ligeramente para combinar.", "En un tazón grande, mezcle la harina, la sal, el cardamomo y el azúcar restante hasta que estén bien combinados. Agregue la mezcla de leche y combine. Amasa en el bol hasta que tengas una masa suave.", "Frote aproximadamente 10 g / ¼ oz de la mantequilla en una superficie de trabajo limpia. Incline la masa y amasar en otra mantequilla de 20g / ¾oz hasta que esté bien combinada y la masa forme una bola suave. Transfiera la masa a un bol ligeramente untado con mantequilla y cubra con una película adhesiva. Pruébelo en un lugar cálido hasta que duplique su tamaño.", "Para el glaseado, caliente el azúcar impalpable y 112ml / 3¾fl oz de agua en una olla. Cuando el azúcar se haya disuelto, déjelo a un lado para que se enfríe.", "Incline la masa sobre la superficie de trabajo y extiéndala en un rectángulo de aproximadamente 26x35 cm / 10½x14 pulgadas.", "Extienda la mantequilla restante sobre la masa y espolvoree sobre el chocolate y las avellanas. Enróllalo como una salchicha y pellizca los bordes para sellar. Con un cuchillo afilado, corte la masa longitudinalmente para hacer dos hebras. Pellizca las dos piezas juntas en un extremo y luego trenza bien juntas. Transfiera a una lata de pan, cúbralo con una bolsa de prueba y póngalo en un lugar cálido para probar hasta que duplique su tamaño.", "Precaliente el horno a 190C / 170C Fan / Gas 5.", "Batir la yema de huevo con 2 cucharaditas de agua y luego aplicar sobre el pan probado.", "Hornee por 27 minutos, o hasta que estén doradas. Deje que se enfríe un poco en la lata, luego cepille el jarabe de azúcar en el pan. Retire de la lata y deje enfriar completamente en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_chocolate_cardamom_and_62885", "title": "Babka de chocolate, cardamomo y avellana", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_cardamom_and_62885_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de mantequilla, más 2 cucharaditas, ablandadas", "50 g / 2 oz de almendras molidas, más 1 cucharada para quitar el polvo", "150 g / 5½ oz de chocolate negro, roto en pedazos", "150g / 5½oz de azúcar glas, tamizado", "4 huevos, separados", "125g / 4½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "125 g / 4½ oz de chocolate negro", "40 g / 1½ oz de mantequilla", "1 cucharada de jarabe de oro", "15-20 g / ¾oz de almendras en copos o en rodajas", "cristales de azúcar (opcional)"], "method": ["Para el pastel, engrase la lata del pastel con las dos cucharaditas de mantequilla. Espolvoree la cucharada de almendras en la lata y agite hasta que el interior de la lata esté completamente cubierto con una ligera capa de almendras.", "Derretir el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo. Retire el tazón del fuego y mezcle el chocolate hasta que quede suave, luego déjelo enfriar durante al menos 15 minutos.", "Precalentar el horno a 190 ° C / 375F / Gas 5.", "Pon la mantequilla y el azúcar glas en un tazón grande y pégalos juntos hasta que estén suaves y livianos. Agregue las yemas de huevo, una por una, batiendo bien entre cada adición. Batir el chocolate enfriado, luego los 50 g / 2 oz de almendras molidas, harina y polvo de hornear.", "Batir las claras de huevo en un tazón grande y limpio con un batidor de mano eléctrico hasta que estén rígidas, pero no secas. Mezcle alrededor de dos cucharadas colmadas de claras de huevo en la mezcla de chocolate para aflojarlo, luego doble suavemente el resto con una cuchara de metal.", "Vierta la mezcla en el molde de la torta y hornee en el centro del horno durante 35-40 minutos, hasta que esté bien levantado y empezando a contraerse de los lados de la lata. Deje reposar la torta durante 2 o 3 minutos, luego pase suavemente un cuchillo por los lados y apáguela sobre una rejilla para que se enfríe.", "Para hacer la guinda, derrita el chocolate con la mantequilla y el almíbar en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento. Retire del fuego y revuelva hasta que quede suave, luego deje enfriar durante 5 minutos.", "Lentamente rocíe el glaseado sobre la torta y permita que se deslice lentamente por los lados. Si la formación de hielo se mueve demasiado rápido o no cubre la torta correctamente, déjela enfriar unos minutos más y vuelva a intentarlo. Trabaja despacio para obtener la mejor cobertura. Deja reposar la torta helada durante 10 minutos, luego espárzala con las almendras y los cristales de azúcar si la estás usando.", "Déjelo a un lado durante aproximadamente una hora hasta que la formación de hielo esté lista antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolate_cake_20610", "title": "Pastel de chocolate (Pastel de chocolate)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]