[{"ingredients": ["1 chile pasilla grande o 4 cucharaditas de pasilla molida", "Crema doble de 200 ml / 7 fl oz", "pizca de sal", "1 cucharadita de pimienta de cayena (opcional)", "200g / 7oz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids),% 20finely% 20chopped", "6 cucharadas de cacao en polvo", "Harina normal de 120 g / 4¼ oz", "1½ cucharada de azúcar en polvo", "1 cucharadita de polvo de hornear", "pizca de sal", "1 huevo de gallinas camperas", "100 ml / 3½ fl oz de agua helada o leche (el agua produce una capa de rebozado más crujiente)", "1 litro / 1¾ pintas de aceite de maíz, para freír", "crema batida o coagulada", "250 g / 9 oz pequeñas fresas o frambuesas"], "method": ["Para hacer las trufas, si usa un chile entero, tueste en una sartén seca a fuego medio y luego mezcle con un polvo en un molinillo de especias. (Omita este paso si usa tierra pasilla)", "Caliente la crema, la pasilla molida, la sal y la cayena, si está usando, en una cacerola a fuego medio. Cuando la crema esté caliente pero no hirviendo, retírela del fuego y agregue el chocolate hasta que se derrita. Déjelo enfriar y colóquelo en el refrigerador hasta que esté lo suficientemente firme como para formar bolitas.", "Cubra una bandeja para hornear con papel de hornear y coloque el polvo de cacao en un tazón pequeño. Usando dos cucharaditas, dé forma al chocolate en 15-18 óvalos pequeños. Sumérgete en el cacao y luego, con tus manos, trabaja rápidamente para formar bolas, espolvoreando con cacao sobre la marcha. Coloque sobre el papel para hornear y congélelo durante al menos 3 horas, preferiblemente durante la noche (consulte la sugerencia solo si prepara las trufas). Una vez congelados, se pueden conservar durante una semana o dos. Guárdelos en capas con pergamino para hornear en una caja de plástico con tapa.", "Para hacer la mezcla, tamiza la harina, el azúcar, el polvo de hornear y la sal en un tazón. Haz un pozo en el centro y agrega el huevo. Batir el huevo, dibujando gradualmente la harina desde los lados para hacer una pasta. Agregue el agua o la leche un poco a la vez hasta que tenga una masa suave y espesa.", "Caliente el aceite a 175 ° C en una olla grande (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). En tandas, sacude el exceso de coco de las trufas y luego sumérgelas en la mezcla y cuidadosamente bájalas en el aceite caliente durante un par de minutos hasta que estén doradas. Coloque cada lote a un lado en papel de cocina para drenar. Recorte los bordes irregulares con tijeras y polvo con cacao en polvo.", "Servir inmediatamente con crema batida o coagulada y bayas rojas frescas."], "url": "www_bbc_co_uk_food_recipes_chilli_chocolate_53849", "title": "Chilli chocolate truffles (Trufas de chocolate y chile pasilla)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 15-18", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_chocolate_53849_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "500 g / 1lb 2 oz de carne de vacuno de buena calidad", "2 cebollas, cortadas en cubitos", "2 dientes de ajo, aplastados", "2 zanahorias, cortadas en cubitos", "2 tallos de apio, cortados en cubitos", "2 pimientos rojos, cortados en cubitos", "1 chile en polvo de cucharadita colmada", "1 cucharadita de comino molido", "1 cucharada de canela molida", "sal y pimienta negra recién molida", "1 x 400 g / 14 oz pueden frijoles rojos, drenados", "2 x 400 g / 14 onzas de latas de tomates picados", "crema agria", "hojas de cilantro fresco picado", "rodajas de limón", "nachos"], "method": ["Caliente dos cucharadas de aceite en una sartén grande a fuego medio. Agregue la carne picada y freír hasta que se dore por todas partes.", "Mientras tanto, caliente el aceite restante en una cacerola a fuego medio a alto. Agregue las cebollas, el ajo, las zanahorias, el apio y los pimientos y fría hasta que se ablanden.", "Agregue el chile en polvo, el comino y la canela y sazone al gusto con sal y pimienta negra recién molida. Freír durante 4-5 minutos más, revolviendo bien.", "Retire la carne picada de la sartén con una espumadera y agregue a la mezcla de vegetales.", "Agregue los frijoles rojos drenados y los tomates en conserva picados y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cubra a medias la sartén con una tapa y cocine a fuego lento durante aproximadamente una hora, revolviendo de vez en cuando para evitar que se enganche en el fondo de la sartén.", "Para servir, cuela el chile en cuatro tazones para servir. Rocíe sobre la crema agria. Espolvorear con el cilantro picado. Adorne con las rodajas de lima y sirva con nachos al costado."], "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_08985", "title": "Chili con carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Coliflor 150 g / 5½ oz", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharadita de aceite de colza", "½ cebolla mediana (60 g / 2¼ oz de peso pelado), finamente picada", "1 diente de ajo, aplastado", "% 20% 20% grasa 20% 20% 20% 20%", "200g / 7oz de tomates picados en lata", "1 cucharada de puré de tomate", "pizca de chile en polvo", "25g / 1oz escurrido y enjuagado estañado frijoles rojos"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer el 'arroz', coloque la coliflor en un procesador de alimentos y pulse durante 30 segundos, o hasta que tenga la textura del arroz. Agregue el aceite de oliva y sazone. Extiende el \"arroz\" en una bandeja para hornear y hornea por 15 minutos.", "Mientras tanto, para hacer el chile con carne, caliente el aceite de colza en una cacerola pequeña a fuego medio. Agregue la cebolla y cocine por 3 minutos. Agregue el ajo y la carne picada y cocine durante 4 minutos. Mezcle los tomates, el puré de tomate y el chile en polvo. Sazone y cocine a fuego lento durante 15 minutos. Agregue los frijoles y cocine durante 2 minutos más.", "Sirve el chile con la coliflor 'arroz'."], "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_with_35538", "title": "Enfriamiento de chile con carne con coliflor 'arroz'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_con_carne_with_35538_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, cortada en cubitos", "2 dientes de ajo picados", "Carne picada de carne 250 g / 9 oz", "½ -1 cucharadita de hojuelas de chile, al gusto", "400g de tomates cortados en lata", "500ml / 18fl oz de caldo, hecho de un cubo común (idealmente de res, pero el pollo está bien)", "½ cucharadita de hierbas secas mezcladas", "2 x 400 g de alubias rojas, escurridas y enjuagadas", "200g / 7oz de arroz de grano largo", "200g / 7oz de yogurt natural", "sal y pimienta"], "method": ["Caliente una cacerola grande a fuego medio. Agregue el aceite de oliva y, una vez caliente, fría la cebolla con una pizca de sal durante 5 minutos o hasta que esté suave y translúcida. Una vez suave, agregue el ajo y cocine durante 2 minutos.", "Agregue la carne picada, junto con una buena pizca de sal y pimienta. Mezcle bien y cocine por 5-6 minutos, o hasta que no haya pedazos crudos de carne. Agregue las hojuelas de chile, los tomates, el caldo y las hierbas secas mezcladas. Revuelva para mezclar bien y cocine a fuego lento.", "Vierta los frijoles rojos drenados y cocine a fuego lento durante 30 minutos, o hasta que el chile con carne esté espeso y rico. Pruebe y ajuste el condimento según sea necesario.", "Mientras tanto, cocine el arroz de acuerdo con las instrucciones del paquete.", "Sirva el chile con carne encima del arroz con una o dos cucharadas de yogur encima de cada porción. Come mientras está caliente."], "url": "www_bbc_co_uk_food_recipes_chilli_con_carne_with_75631", "title": "Chili con carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_con_carne_with_75631_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de vientre de cerdo", "1 estrella de anís", "1 ramita de canela", "2 hojas de laurel", "1 cucharada de semillas de hinojo", "2 dientes", "500ml-1litre / 18fl oz-1¾ pintas de agua hirviendo", "2 cucharadas de aceite vegetal", "80g / 3oz de frijoles enanos franceses, recortados", "2 dientes de ajo, finamente picados", "½ cebolleta, más o menos picada", "½ cebolla, finamente rebanada", "50 g / 1¾oz de pimientos rojos dulces, en rodajas finas", "50g / 1¾oz de hoja china, finamente cortada", "½ cucharada de salsa de soja ligera", "1 cucharadita de aceite de sésamo", "½ cucharadita de azúcar", "1 cucharadita de harina de maíz", "1 cucharadita de aceite de chile", "1 cucharada de salsa hoisin", "½ cucharada de salsa de soja ligera", "1 cucharada de vino de arroz Shaoxing", "½ cucharadita de salsa de soja oscura", "100 ml / 3½ fl oz de caldo de pollo fresco"], "method": ["Para hacer la barriga de cerdo, coloque la carne en una olla con los otros ingredientes y cocine a fuego lento a fuego medio bajo durante 45 minutos. Escurrir a través de un tamiz y dejar enfriar. Cubra con film transparente y colóquelo en la nevera durante la noche o durante al menos 1 hora.", "Blanquee los frijoles en agua hirviendo durante 2 minutos. Refresque en agua fría y reserve.", "Cortar la carne de cerdo en rodajas de 2-3 mm de espesor y colocar en un tazón pequeño. Agregue los ingredientes del adobo y masajee el cerdo con sus manos.", "Para hacer la salsa sofrita, mezcle los ingredientes en una cazuela o en un tazón pequeño.", "Calentar el aceite en un wok colocado a fuego alto. Cuando el aceite esté humeando, agregue el cerdo adobado y dore bien en ambos lados durante 1 minuto. Retire la carne de cerdo y reserve.", "Agregue el ajo, la cebolleta y las cebollas al wok caliente y saltee por 30 segundos o hasta que las cebollas estén ligeramente doradas. Agregue los pimientos rojos, la hoja china y los frijoles a intervalos de 30 segundos.", "Regrese la carne de cerdo al wok con la salsa para freír y hierva por 30-60 segundos revolviendo bien. Incline sobre un plato grande y sirva."], "url": "www_bbc_co_uk_food_recipes_chilli_hoisin_pork_and_69239", "title": "Chili hoisin de cerdo y vegetales salteados", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pinta de suero de leche", "100g / 3½oz de sal", "1kg / 2lb 4oz alas de pollo, articuladas", "125g / 4½oz de harina de arroz", "125g / 4½oz de harina de papa", "125g / 4½oz de harina natural", "1 cucharadita de pimienta negra recién molida", "aceite vegetal, para freír", "1 cucharada de salsa de pescado", "1 guindilla roja, finamente picada", "75g / 2½ oz de azúcar de palma", "2 cucharadas de pasta de tamarindo", "600g / 1lb 5oz de sandía, cortada en cubos de 1cm / ½ en", "1 cucharada de azúcar de palma", "2 cucharadas de salsa de pescado", "1 lima, solo jugo", "½ diente de ajo, aplastado", "½ chile rojo tailandés", "puñado de hojas frescas de cilantro", "puñado de hojas de menta fresca", "puñado de cacahuetes tostados", "1 cucharadita de hojas de cilantro fresco finamente picado", "½ cucharadita de hojas de albahaca tailandesa fresca finamente picada", "1 cucharadita de hojas de menta fresca finamente picadas", "1 cucharadita de ajo crujiente", "1 cucharadita de chalotes crujientes", "1 cucharadita de chiles rojos encurtidos", "1 huevo de gallinas camperas, frito"], "method": ["Para las alitas de pollo, en un tazón grande, mezcle la mantequilla y todo menos 1 cucharadita de sal. Agregue el pollo y mezcle bien. Cubra y marine en el refrigerador por 24 horas.", "Para la ensalada, ponga la sandía en un tazón grande, cubra y deje enfriar en el refrigerador por 3 horas.", "Mientras tanto, cocine a fuego lento todos los ingredientes de la salsa de chile picante con 1 cucharada de agua en una cacerola a fuego lento durante 2 minutos. Dejar de lado para enfriar.", "Para el aderezo de ensalada, coloque el azúcar de palma, la salsa de pescado, el jugo de lima, el ajo y el chile rojo tailandés en un procesador de alimentos y mezcle hasta que quede suave. Mezcle con la sandía fría en un recipiente muy frío, luego agregue las hierbas y los cacahuetes.", "Mezcle las harinas, la pimienta negra y la sal restante en un tazón grande. Cubra bien el pollo con la harina sazonada y listo para freír.", "Caliente la freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las alas en lotes durante 7 minutos. Hasta que estén cocidas, doradas y crujientes. Escurrir sobre papel de cocina y dejar a un lado para que se enfríe un poco. Cubra las alas con la salsa de chile pegajoso.", "Mezcle todos los ingredientes de guarnición. Coloque las alitas de pollo en un tazón para servir, coloque el huevo frito encima y sirva con la ensalada, adornada con la mezcla de hierbas y especias."], "url": "www_bbc_co_uk_food_recipes_chilli_fish_caramel_85265", "title": "Alitas de pollo picante con ensalada de sandía en escabeche tailandesa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de almendras molidas", "75g / 2¾oz de azúcar glasé", "25g / 1oz de clara de huevo de gallinas camperas", "colorante verde para alimentos, preferiblemente en polvo", "75g / 2¾oz de almendras molidas", "75g / 2¾oz de azúcar glasé", "25g / 1oz de clara de huevo de gallinas camperas", "½ pimiento fresco muy suave, como anaheim o poblano", "50g / 1¾oz de azúcar", "1 cucharada de colorante líquido rojo para alimentos", "60 g / 2¼ oz de claras de huevo de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "75g / 2¾oz de agua", "350g / 12oz de chocolate blanco", "Crema doble de 40 g / 1½ oz", "100 g / 3½ oz de jugo de lima (aproximadamente cinco limas)", "50g / 1¾oz de mantequilla", "Frambuesas frescas de 300g / 10½ oz", "50g / 1¾oz de azúcar", "exprimir jugo de limón", "2 sobres de 8g de pectina"], "method": ["Para los macarrones, coloque dos tazones de mezcla, cada uno con almendras molidas, azúcar glasé y clara de huevo. Agregue el colorante de comida verde a un tazón. Dejar de lado.", "Para el merengue italiano, bata las claras de huevo de 60 g / 2¼ oz en un bol hasta que se formen picos suaves cuando se quite el batidor del bol. Caliente el azúcar y 75g / 2¾oz de agua en una sartén pequeña hasta 118C / 245F. Lentamente bata el jarabe caliente en las claras de huevo batidas.", "Divide el merengue italiano entre los dos cuencos de mezcla preparados para los macarrones, y dóblalo.", "Con una cuchara, coloque la mezcla verde de macarrones en una manga pastelera con una boquilla pequeña y lisa. Con una cuchara, coloque la mezcla de macarrón blanco en una bolsa de tubos separada, también con una boquilla pequeña y lisa (los macarrones blancos se colorearán de rojo después de descansar).", "Línea dos bandejas para hornear con pergamino para hornear, uno para cada color. Pase los macarons verdes en una bandeja en rondas de 2cm / onto en el pergamino. Repita con los macarons blancos en la otra bandeja. Coloque ambas bandejas a un lado para descansar durante al menos 30 minutos antes de hornear.", "Mientras tanto, para los macarons rojos, corta el chile rojo, agrégalo al azúcar y colorea los alimentos rojos. Espolvoree la mezcla de chile sobre los macarons blancos antes de hornear.", "Precalentar el horno a 180C / 350F / Gas 4.", "Hornee los macarons descansados ​​durante 12 minutos, abriendo la puerta del horno dos veces durante el proceso: una vez después de tres minutos, y otra vez después de ocho minutos.", "Retire del horno, retire del pergamino para hornear y transfiéralo a la nevera para que se enfríe.", "Para obtener la ganache de lima, mezcle suavemente el chocolate y la crema en un tazón sobre una fuente de agua hirviendo. Agregue el jugo de lima gradualmente a la mezcla. Luego, agregue gradualmente la mantequilla e incorpórela completamente. Retirar del fuego, cubrir y enfriar en la nevera.", "Para el coulis de frambuesa, empuja las frambuesas a través de un colador y recoge el jugo en una sartén pequeña. Agregue el azúcar y el jugo de limón y lleve la mezcla a ebullición. Una vez que hierva, agregue la pectina y bata durante 2-3 minutos. Retirar del fuego y dejar enfriar.", "Transfiera el ganache a una manga pastelera, y arme los macarons: macarrones verdes en la parte inferior, ganache entubado en el medio, coronado con coulis de frambuesa emparedado con el macaron rojo."], "url": "www_bbc_co_uk_food_recipes_chilli_lime_and_92370", "title": "Macarrones de chile, lima y frambuesa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "50g / 2oz de mantequilla", "2 dientes de ajo, finamente picados", "2 chalotes, finamente picados", "2 tallos de limoncillo, finamente picados", "2 chiles verdes, finamente picados", "4 hojas de lima Kaffir, finamente trituradas", "200ml / 7fl oz de vino blanco", "400 ml / 14 fl oz crema doble", "2 x 750g / 1lb 10 oz de langosta cocida, sin cáscara y cortada en trozos", "2 limas, solo jugo", "3 cucharadas de cilantro fresco picado", "Espagueti 300 g / 10 oz"], "method": ["Caliente una sartén grande hasta que esté caliente. Agregue el aceite de oliva y la mantequilla y luego agregue el ajo, los chalotes, el limoncillo, los chiles y las hojas de lima ralladas. Freír por 1-2 minutos.", "Vierta el vino blanco y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema y cocine a fuego lento. Cocine hasta que espese y luego agregue la langosta. Exprima el jugo de lima y sazone al gusto con sal y pimienta negra recién molida. Finalmente, agregue el cilantro.", "Mientras tanto, cocine los espaguetis de acuerdo con las instrucciones del paquete y luego escurra. Mezcle los espaguetis con la salsa de langosta hasta que estén bien combinados.", "Para servir, amontone los espaguetis en platos y termine con otro chorrito de jugo de lima."], "url": "www_bbc_co_uk_food_recipes_chilli_lobster_spaghetti_50196", "title": "Espagueti de langosta de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 cucharadas de jugo de lima", "2 dientes de ajo, aplastados", "1 chile rojo, sin grano y finamente picado", "Filete de cerdo 300 g / 10½ oz, en cubos", "200g / 7oz de arroz fragante tailandés", "6 cebollas de primavera, en rodajas finas", "200g / 7oz de piña, pelada y cortada en cubitos", "½ cebolla roja, cortada en cuñas", "1 lima, cortada en cuñas", "salsa de chile dulce lista para servir", "sal y pimienta negra recién molida"], "method": ["Remoje 8 pinchos de madera en agua tibia.", "Mezcle el aceite, el jugo de lima, el ajo, el chile con una pizca de sal y pimienta en un bol, agregue el cerdo y revuelva para cubrir. Cubra y refrigere durante al menos 1 hora.", "Mientras tanto, cocine el arroz en agua hirviendo ligeramente salada durante 12-15 minutos, hasta que esté suave. Escurrir y revolver a través de las cebolletas y la piña.", "Precalentar la parrilla a un ajuste caliente.", "Pase la carne de cerdo a los pinchos, alternando con cebolla y rodajas de limón, y cocine debajo de la parrilla durante unos 10 minutos, voltee con frecuencia y hilvane con el resto del adobo, hasta que la carne de cerdo esté cocida.", "Coloque los pinchos y el arroz en un plato con la salsa de chili dulce y sirva."], "url": "www_bbc_co_uk_food_recipes_chilli_pork_with_82478", "title": "Chilli de cerdo con arroz de piña", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_pork_with_82478_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10% C2% BDoz% 20lean% 20beef% 20mince% 20 (menos% 20than% 2010 %% 20fat)", "1 cebolla pequeña, finamente picada", "2 dientes de ajo, pelados y triturados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de chile en polvo", "2 cucharadas de puré de tomate", "½ cucharadita de azúcar en polvo", "300 ml / ½ pinta de caldo de carne de vacuno, hecho con 1 cubo de carne de vacuno", "4 tortillas de harina grandes", "1 cucharadita de aceite de girasol", "1 lechuga romana o 3 lechugas gemelas bebé, hojas densamente trituradas", "3 tomates de vid maduros, en rodajas", "Pepino de 15cm / 6 en pieza, rebanado", "4 cebolletas, cortadas y cortadas", "½ lima, solo jugo", "40g / 1½ oz de queso cheddar maduro", "4 cucharadas de crema semidescremada", "4 cucharadas de salsa de tomate fresco", "sal marina copos", "pimienta negra recién molida"], "method": ["Ponga la carne picada, la cebolla y el ajo en una cacerola antiadherente mediana y cocine a fuego alto durante cinco minutos, revolviendo con dos cucharas de madera para romper los grumos de carne. Agregue el comino, el cilantro y el chile y cocine durante dos minutos más, revolviendo constantemente. Agregue el puré de tomate, el azúcar y el caldo de carne y cocine a fuego lento. Cubra la sartén y deje hervir a fuego lento a fuego lento durante 30 minutos. Retire la tapa y mezcle la mezcla de chile de vez en cuando.", "Mientras la carne se cocina, prepare los tazones de tortilla. Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Tome una hoja de papel de aluminio de aproximadamente 1 metro / 40 pulgadas de largo y aplástelo formando una bola de unos 10 cm de diámetro. Colóquelo en el centro de una bandeja grande para hornear.", "Tome una tortilla y cepille el centro de un lado con un poco de aceite, esto ayudará a evitar que se pegue a la lámina. Coloque la tortilla sobre la bola de papel de aluminio, con el lado del aceite hacia abajo, pellizcándola y plisándola sin apretar para crear una forma de tazón. Hornee durante cinco minutos hasta que la forma del recipiente esté lista y la tortilla esté ligeramente crujiente.", "Saca la tortilla del horno y retírala con cuidado de la lámina: debe ser lo suficientemente fría como para manipularla. Coloque la tortilla en un vaso volteado hacia arriba y presione para crear una base plana sobre la cual girar la tortilla una vez que esté fría. La tortilla todavía debe estar lo suficientemente caliente como para moldear la forma del vaso. Deje que se enfríe mientras prepara el siguiente tazón de la misma manera. Coloque cada tortilla vuelta hacia arriba en un plato tan pronto como esté lista.", "Retire la tapa de la sartén de carne y suba el fuego. Cocine por otros 4-5 minutos, revolviendo constantemente, hasta que la mayoría del líquido se haya evaporado y la carne se vea bastante seca. Saca la sartén del fuego.", "Mezcle la lechuga con los tomates, el pepino, las cebolletas y el jugo de lima. Divida la ensalada entre los tazones de tortilla y sazone con pimienta negra, luego cubra con la carne molida caliente. Rejilla toscamente un poco de queso cheddar sobre cada porción y agregue un poco de crema y salsa. Métalo mientras la carne está caliente."], "url": "www_bbc_co_uk_food_recipes_chilli_salad_bowls_22404", "title": "Ensaladeras de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_salad_bowls_22404_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 1½ oz de tomates en rama maduros", "½ cebolla, piel en", "2 dientes de ajo sin pelar", "4 chiles pasilla, semillas y tallos eliminados", "8 chiles guajillo, semillas y tallos eliminados", "150ml / 5fl oz de cola", "1 cucharada de aceite de girasol", "½ cucharadita de orégano seco", "puñado de tallos de cilantro, finamente picado", "pimienta negra recién molida", "¼ cucharadita de clavo de olor molido", "1 cucharadita de semillas de comino, tostadas y molidas en un almirez y mortero", "sal al gusto", "1 naranja, solo jugo", "1 cucharadita de vinagre de sidra", "¼ cucharadita de cacao en polvo"], "method": ["Piel de los tomates haciendo un entrecruzamiento en la parte inferior de cada uno y luego sumergiéndolos en una olla de agua hirviendo durante un par de minutos. Retirar con una cuchara ranurada y transferir para refrescar en un recipiente con agua helada. Una vez que esté frío, quita cuidadosamente la piel.", "Saque las semillas de los tomates sobre un colador para recolectar los jugos, y rasgue la carne en trozos pequeños. Reservar en un tazón.", "En una sartén bien caliente, coloque la cebolla, córtela con los dientes de ajo sin pelar y cocine hasta que esté chamuscada. Gire hacia el otro lado durante unos minutos, luego quite y pele el ajo y la cebolla, luego pique finamente. Aparte el ajo y la cebolla por separado.", "Seque los chiles en un sartén caliente durante aproximadamente 4-5 minutos, volteándolos con frecuencia para que no se quemen; deben aclararse en color cuando terminen.", "Agregue los chiles a un tazón con la cola y un chorrito de agua y déjelos reposar durante unos 15 minutos.", "En una sartén, fríe la cebolla picada en el aceite de girasol con el orégano, los tallos de cilantro, la pimienta negra y un chorro de agua hasta que las cebollas estén blandas, pero no coloreadas.", "Agregue el ajo, los tomates y su jugo, los dientes de ajo y el comino molido y cocine a fuego lento durante unos 10 minutos. Sazonar con sal.", "Agregue el jugo de naranja, el vinagre y los chiles rehidratados a la sartén y, con una batidora, mezcle hasta que quede suave.", "Pasar a través de un colador en una olla limpia y llevar a ebullición. Cocine suavemente durante unos 30 minutos, luego agregue el cacao en polvo y cocine por otros 10-15 minutos, o hasta que la mezcla tenga la consistencia de una salsa para colar.", "Agregue más cola, jugo de naranja, condimentos y especias al gusto si es necesario.", "Vierta en botellas esterilizadas y selle."], "url": "www_bbc_co_uk_food_recipes_chilli_sauce_09570", "title": "Salsa de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 2 botellas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800 g / 1lb12 oz de harina italiana '00'", "Harina de sémola de 200g / 7oz, más extra para quitar el polvo", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "14 g / ½ oz de levadura seca", "2 x 400 g / 14 oz latas de tomates San Marzano", "2 bolas grandes de mozzarella, rotas aproximadamente", "50 g / 1¾oz de queso pecorino, finamente rallado", "3 cucharadas de aceite vegetal", "1 gran puñado de hojas de albahaca", "2 chiles, finamente cortados", "1 pequeña langosta cocida, carne extraída y cortada en trozos", "1 cucharada de salsa de chile de mango", "sal y pimienta negra recién molida"], "method": ["Para la masa de pizza, coloque las harinas, sal, azúcar y levadura en un tazón grande y revuelva.", "Haga un pozo en el centro de la harina y vierta gradualmente 650 ml / 22 fl oz de agua, mezclando gradualmente en la harina para formar una masa suave.", "Incline y amase la masa sobre una superficie de trabajo hasta que quede suave y elástica.", "Divida en cuatro y enrolle en bolas, luego colóquelas en una bandeja, cubra y deje que se levanten durante 24 horas.", "Cuando esté listo para cocinar las pizzas, precaliente el horno a 240C / 475F / Gas 9 (o tan alto como sea posible).", "Coloque una bandeja para hornear pesada o piedra para pizza en el horno para calentar.", "Estirar las piezas de masa hasta aproximadamente 5 mm de espesor y colocarlas en una bandeja enharinada hacia arriba.", "Coloque los tomates enlatados en un procesador de alimentos y mezcle con un puré.", "Vierta el puré de tomate sobre las dos pizzas, solo hasta los bordes.", "Esparce más de la mitad de la mozzarella y el pecorino. Dispersar sobre el chile, luego rociar sobre la mitad del aceite de maní.", "Termine con unas hojas de albahaca y sazone con sal y pimienta negra.", "Transfiera al horno, empujando la pizza en la bandeja de pizza calentada o en la piedra y cocine de 5 a 8 minutos, o hasta que esté bien cocida y burbujeando.", "Para el calzone, cubra la mitad de cada una de las otras dos bases de pizza con la salsa de tomate, luego cubra con los pedazos de langosta y el resto de la mozzarella y el pecorino. Rocíe la salsa de chile de mango y el resto del aceite de maní junto con una dispersión de albahaca y sazone con sal y pimienta negra.", "Doble la otra mitad de la pizza sobre la parte superior, luego doble los bordes y coloque sobre la piedra calentada para pizza o en la bandeja.", "Cocine por 5-10 minutos hasta que estén doradas y crujientes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chilli_tomato_pizza_and_84481", "title": "Chili pizza de tomate y langosta calzone", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110g / 4oz de espagueti fresco", "1 bulbo de hinojo, cortado en rodajas de 1¼cm / ½ en rodajas", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "½ cebolla, finamente picada", "1 diente de ajo, aplastado", "½ cucharadita de harissa", "6 cucharadas de vino tinto", "puñado de hojas de albahaca, desgarrado"], "method": ["Cocine los espaguetis de acuerdo con las instrucciones del paquete. Escurrir y mantener caliente.", "Rocíe el hinojo con una cucharada de aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la plancha y fría el hinojo durante 4-6 minutos, o hasta que se ablande.", "Caliente la restante cucharada de aceite en una sartén por separado y fría la cebolla hasta que esté suave pero no coloreada. Agregue el ajo y cocine por un minuto.", "Agregue la harissa y el vino tinto y cocine a fuego medio, hasta reducir a tres cucharadas de líquido.", "Mezcle los espaguetis cocidos a través de la salsa y agregue las hojas de albahaca.", "Sirve los espaguetis colocados en una cama del hinojo a la parrilla."], "url": "www_bbc_co_uk_food_recipes_chilliandbasilpastaw_85478", "title": "Pasta de chile y albahaca con hinojo a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de chocolate negro, mínimo 70% de sólidos de cacao", "200 g / 7 oz de mantequilla sin sal, más extra para engrasar", "10 huevos de gallinas camperas", "3 cucharadas de crema agria", "300 g / 10½ oz de azúcar en polvo", "1 vaina de vainilla, partido, semillas raspadas", "Harina normal de 200g / 7oz", "1 cucharadita de canela molida", "½ cucharadita de polvo de hornear", "2 chiles rojos, sin semillas, finamente picados", "250ml / 9fl oz de crema batida", "60g / 2oz de mantequilla sin sal", "100 g / 3½ oz de cacao en polvo", "100 g / 3½ oz de azúcar en polvo", "100g / 3½oz de azúcar morena oscura", "½ cucharadita de canela molida", "100 g / 3½ oz de fresas", "crema batida"], "method": ["Precalentar el horno a 160 ° C / 320 ° F / Gas 3.", "Derrita el chocolate y la mantequilla juntos en un recipiente resistente al calor colocado sobre una fuente de agua apenas hervida, asegúrese de que el agua no toque la base del recipiente.", "Coloque un recipiente separado a prueba de calor sobre una segunda olla con agua apenas hervida - asegúrese de que el agua no toque la base del recipiente. Agregue los huevos, el azúcar, la crema agria y las semillas de vainilla al bol y bata constantemente durante 5-6 minutos, hasta que la mezcla esté esponjosa y duplique su volumen.", "Agregue la mezcla derretida de chocolate y mantequilla a la mezcla de crema agria y revuelva para combinar.", "Tamiza la harina, la canela y el polvo de hornear en un recipiente aparte, luego dobla la mezcla en la mezcla derretida de chocolate.", "Agregue los chiles picados y revuelva suavemente.", "Cubra un plato grande a prueba de horno o una bandeja honda para hornear con papel de cocina engrasado y vierta la mezcla en el plato.", "Hornee en el horno durante 50-60 minutos, o hasta que estén cocidos.", "Para la salsa, coloque la crema, la mantequilla, el cacao en polvo, el azúcar impalpable, el azúcar morena y la canela en una sartén a fuego lento y revuelva durante 4-5 minutos, hasta que los ingredientes se derritan y combinen como una salsa espesa.", "Para servir, corte rebanadas de pudín de chocolate y colóquelas en los platos. Rocíe con la salsa y sirva con fresas y crema batida."], "url": "www_bbc_co_uk_food_recipes_chilliandchocolatefu_89932", "title": "Pudín de dulce de chile y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de pan rallado fresco", "2 cucharaditas de sal", "2 cucharaditas de copos de chile seco", "1 pechuga de pollo, aplanada con una malleta de carne cortada en 2 pedazos iguales", "1 cucharada de harina normal", "1 huevo de gallinas camperas, golpeado", "1 cucharada de mantequilla derretida", "250g / 9oz de polenta instantánea", "300 ml / ½ de agua hirviendo, con una pizca de sal añadida", "1 cucharada de mantequilla", "1 cucharada de aceite de oliva, más extra para engrasar", "1/2 calabaza, hervida por 5 minutos y escurrida, cortada en pedazos", "sal y pimienta negra recién molida"], "method": ["Para el chile y el pollo a la pimienta negra, mezcle las migas de pan, sal y escamas de chile en un tazón.", "Sumerja el pollo en harina común, sacuda el exceso, luego sumerja el huevo batido y luego sumérjalo en la mezcla de migas de pan. Golpea suavemente con un cuchillo para hacer que las migas de pan se peguen.", "Calentar la mantequilla en una sartén y freír el pollo durante cinco minutos en cada lado o hasta que esté dorado y cocido. Mantener caliente", "Para hacer los buñuelos de polenta, coloque la polenta en una sartén con agua hirviendo con sal y cocine, revolviendo frecuentemente, a fuego lento hasta que toda el agua haya sido absorbida.", "Engrase una bandeja para hornear y vierta la polenta en la bandeja. Refrigere hasta que esté listo.", "Use un cortador circular de 6 cm para cortar dos círculos de la polenta. Calentar la mantequilla en una sartén y freír durante dos minutos por cada lado.", "Para hacer la calabaza a la plancha, cepille las piezas con aceite de oliva y sazone bien con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y cocínela durante 3 minutos por cada lado, hasta que esté tierna.", "Para servir, coloque los buñuelos de polenta en un plato grande, coloque el pollo encima y sirva con la calabaza a la sartén a los lados."], "url": "www_bbc_co_uk_food_recipes_chilliandblackpepper_82106", "title": "Pollo con chile y pimienta negra con buñuelos de polenta y calabaza a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "10 gambas cocidas", "1 guindilla Scotch Bonnet, finamente picada", "espárrago pequeño racimo, blanqueado", "pequeño cilantro fresco puñado, picado", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite de oliva en un wok, agregue las gambas y el chile y fría por un minuto.", "Agregue los espárragos blanqueados al wok y saltee durante 1-2 minutos. Agregue el cilantro y el jugo de lima y sazone bien con sal y pimienta negra recién molida. Servir inmediatamente"], "url": "www_bbc_co_uk_food_recipes_chilliandcorianderst_87970", "title": "Chiles y cilantro salteados langostinos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 gambas grandes, cabeza y cola dejadas, cuerpo pelado, desvenado", "4 cucharadas de chile listo y salsa de ajo", "150ml / 5fl oz de aceite de oliva", "2cm / 1 en jengibre fresco de raíz, pelado y finamente picado", "3 dientes de ajo, pelados y triturados", "90ml / 3fl oz de aceite de oliva", "2 cucharadas de vinagre balsámico", "1 cucharadita de azúcar en polvo", "2 racimos de hierbas mezcladas (como perifollo, perejil, eneldo, menta, estragón y albahaca)"], "method": ["Para las gambas, cubra las gambas crudas con el chile y la salsa de ajo en un plato poco reactivo. Cubra y deje marinar durante hasta una hora.", "Caliente el aceite de oliva en una sartén hasta que fume. Agregue las gambas y cocine hasta que estén bien coloreadas (alrededor de tres minutos por cada lado).", "Coloque las gambas a un lado en un lugar cálido mientras prepara la ensalada y el aderezo.", "Para la ensalada de hierbas, combine el jengibre y el ajo con el aceite de oliva en una sartén y caliente suavemente. Una vez calentado, retirar del fuego y dejar que se infunda.", "Mezcle el vinagre balsámico, el aceite de oliva infundido y el azúcar impalpable en un tazón pequeño para hacer una emulsión suave.", "Mezcle ligeramente todas las hierbas juntas en un recipiente aparte. Agregue el aderezo, poco a poco, hasta que las hierbas estén cubiertas.", "Para servir, coloque un poco de la ensalada en cada uno de los cuatro platos y sirva con los langostinos inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chilliandgarlicprawn_91276", "title": "Chilli y gambas al ajillo con ensalada de hierbas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2kg / 4½ libras de manzanas bramley", "agua fría para cubrir", "aproximadamente 1.5kg / 3lb conservando azúcar", "10-15 g / 2-3 cucharaditas de hojuelas de chile"], "method": ["Cortar las manzanas aproximadamente y colocarlas en una sartén, pepitas, núcleo y todo. Agregue suficiente agua fría para cubrir. Llevar a ebullición, reducir el fuego y dejar hervir a fuego lento durante 30-40 minutos, o hasta que la fruta esté carnosa.", "Vierta la fruta y el líquido en una bolsa de gelatina esterilizada y deje que se drene en un recipiente grande hasta que deje de gotear, aproximadamente 3-4 horas.", "Mida el jugo y deje 450 g / 1 libra de azúcar y 5 g / 1 cucharadita de hojuelas de chile por cada 500 ml / 17 fl oz de jugo. Coloque el jugo, el azúcar y las hojuelas de chile en una sartén limpia. Llevar a ebullición, revolviendo hasta que el azúcar se haya disuelto. Reduzca el calor y cuidadosamente elimine cualquier residuo de la superficie. Regrese a ebullición y hierva vigorosamente durante 15-20 minutos o hasta que se alcance el punto de ajuste, rozando regularmente. Usando un termómetro de azúcar, el punto de ajuste se alcanzará a 105 ° C / 220 ° F.", "Retire la sartén del fuego y deje reposar durante unos minutos. Skim la superficie una vez más. Vierta la gelatina líquida a través de un embudo de boca ancha en frascos que han sido esterilizados (poner en el horno a 90 ° C / 200 ° F / Gas =). Selle cada tarro con una tapa. Esta jalea se mantendrá durante 2 años, sin abrir."], "url": "www_bbc_co_uk_food_recipes_chilliapplejelly_7293", "title": "Gelatina de manzana picante", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "1.5l / 3 pintas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "½ chile rojo, sin semillas y finamente picado", "2 cucharadas de ketchup de tomate", "400 g / 14 oz pueden frijoles cannellini, escurridos y enjuagados", "1 rebanada de chapata, rociada con aceite de oliva", "4 rebanadas de tocino rayado"], "method": ["Calentar el aceite en una olla pequeña. Agregue la cebolla, el ajo y el chile y cocine por 2-3 minutos o hasta que las cebollas se hayan suavizado. Agregue el ketchup y los frijoles y cocine por otros cinco minutos.", "Caliente una sartén hasta que esté caliente. Agregue la chapata y el tocino y fría, volteando una vez, hasta que el pan esté en forma de cuadritos en ambos lados y el tocino esté crujiente. Escurra el tocino en papel de cocina.", "Para servir, coloque la chapata a la plancha en un plato limpio, coloque los frijoles encima y espolvoree el tocino encima."], "url": "www_bbc_co_uk_food_recipes_chillibakedbeanswith_84608", "title": "Chili frijoles al horno con tocino crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 tomates de ciruela", "1½ cucharada de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "3 ramitas de tomillo fresco, recogido y picado", "4 x 175 g / 6 oz de filetes de salmón, piel en", "sal y pimienta negra recién molida", "1 limón, solo jugo", "½ cucharadita de copos de chile", "1 cucharada de aceite de oliva", "2 cabezas de hinojo, en rodajas finas", "400 g / 14 oz de latas de flageolet, drenados y enjuagados", "1 cebolla roja, finamente rebanada", "2 chiles rojos, en rodajas finas", "pequeño puñado de perejil fresco de flatleaf", "2 cucharadas de jugo de limón", "sal y pimienta negra recién molida", "2 cucharadas de salsa de soja", "1½ cucharada de aceite de oliva virgen extra", "1 cucharada de aceite de trufa", "2 cucharadas de jugo de limón"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Alinee una bandeja para hornear con un pergamino para hornear.", "Corte los tomates por la mitad a lo largo y colóquelos en la bandeja alineada, con el lado cortado hacia arriba.", "Rocíe con aceite de oliva, sazone ligeramente con sal y pimienta negra recién molida. Espolvoree con las hojas de tomillo y coloque en el horno para asar durante aproximadamente 1 ½ horas, hasta que se coloreen y encojan un poco (si después de una hora los tomates comienzan a dar color demasiado, cúbralos con papel de aluminio).", "Aumente la temperatura del horno a 200C / 400F / Gas 6.", "Sazonar los filetes de salmón con sal y pimienta negra recién molida, las hojuelas de chile y el jugo de limón.", "Coloque una sartén a prueba de horno a fuego alto y agregue el aceite de oliva. Cuando esté muy caliente, coloque el salmón en la sartén, con la piel hacia abajo, y fría por 2-3 minutos, hasta que la piel esté crujiente y dorada.", "Voltee el salmón y transfiéralo al horno para hornear durante 5-8 minutos, o hasta que el salmón esté completamente cocido.", "Para hacer la ensalada, coloque el hinojo en agua helada para que quede crujiente.", "Mezcle los frijoles con la cebolla en rodajas, el chile, las hojas de perejil y el jugo de limón y sazone ligeramente con sal y pimienta negra recién molida.", "Para el aderezo, mezcle la salsa de soja, el aceite de oliva, el aceite de trufa y el jugo de limón en un tazón grande.", "Escurrir el hinojo y agregar al aderezo. Mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Divida la ensalada de frijoles entre cuatro platos y coloque las mitades de tomate encima. Coloque el salmón sobre los tomates y coloque una cucharada de ensalada de hinojo encima."], "url": "www_bbc_co_uk_food_recipes_chilliandlemonroaste_83847", "title": "Chili y salmón asado con limón con tomates de ciruela asados ​​y ensalada de chile e hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]