[{"ingredients": ["40 g / 1½ oz de mantequilla ablandada, más extra para untar", "Harina normal de 40 g / 1½ oz, más extra para la elaboración", "350 ml / 12 fl oz de leche", "125g / 4½oz de queso duro (como Old Winchester o Lincolnshire furtivo), rallado", "1 cucharadita de mostaza Dijon", "3 huevos de gallinas camperas, separados", "sal y pimienta negra", "Crema doble 250ml / 9fl oz", "4 cucharadas de kirsch", "100g / 3½oz de queso duro (como Old Winchester o Lincolnshire furtivo), rallado", "Azúcar en polvo de 110 g / 4 oz", "Mitades de nogal 110g / 4oz", "aceite vegetal, para freír", "50g / 1¾oz hojas de diente de león", "50g / 1¾oz de hojas de cohete", "cebollino pequeño, picado", "3 cucharadas de aderezo francés"], "method": ["Para los soufflés, precaliente el horno a 180C / 160C Ventilador / Gas 4. Frote el interior de los moldes con un poco de mantequilla, luego espolvoréelo con harina y colóquelo en una bandeja de horno de lados altos.", "Derrita la mantequilla en una cacerola grande a fuego medio, luego agregue la harina y mezcle bien. Cocine a fuego lento durante 2-3 minutos, revolviendo con una cuchara de madera. Poco a poco bata la leche, poco a poco, revolviendo constantemente para evitar que se formen grumos. Continúe hasta que toda la leche haya sido utilizada, luego reduzca el fuego a muy bajo y cocine durante 2-3 minutos más. Agregue el queso y la mostaza, luego bata las yemas de huevo en la mezcla y sazone con sal y pimienta negra.", "En un tazón limpio y seco, bata las claras de huevo hasta que mantengan los picos firmes cuando se quite la batidora del cuenco, luego dóblalas en la mezcla de soufflé. Divida la mezcla entre los platos soufflé. Vierta suficiente agua caliente en la bandeja del horno para llegar a la mitad de los lados de los platos.", "Hornee los suflés durante 15-20 minutos, o hasta que estén bien dorados.", "Retire los platos de la lata y déjelos a un lado durante unos minutos. Pase un cuchillo por los bordes de los suflés y colóquelos en platos individuales a prueba de horno.", "Para el glaseado, precaliente la parrilla a fuego medio-alto. Batir la crema y kirsch hasta que estén combinados. Cubra la parte superior de los soufflés con la crema, luego esparza sobre el queso y colóquelo debajo de la parrilla hasta que las partes superiores estén doradas.", "Para la ensalada, ponga 110ml / 3¾fl oz de agua y el azúcar en una cacerola y lleve a ebullición. Cocine a fuego lento hasta que el azúcar se haya disuelto y el jarabe espese ligeramente. Agregue las nueces y cocine por 2-3 minutos. Escurra las nueces en papel de cocina.", "Caliente una freidora a 180 ° C o vierta suficiente aceite vegetal en una sartén grande para cubrir el fondo por 2 cm / pulgada y caliente hasta que brille. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Con cuidado, coloque las nueces unas cuantas veces al aceite caliente durante unos minutos o hasta que estén doradas. Retire con una espumadera y transfiera a un plato forrado con papel de cocina. Dejar enfriar un poco.", "Coloque las hojas de diente de león, el cohete y el cebollino en un recipiente, luego agregue un poco de aderezo y mezcle para cubrir.", "Para servir, apile la ensalada encima del soufflé y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_old_winchester_45701", "title": "Soufflé doblemente horneado con ensalada de diente de león y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rodaja gruesa de cáscara de naranja", "1 cereza marrasquino, con tallo", "1 cucharadita de jarabe de azúcar (también se vende como jarabe Gomme)", "2-3 gotas de whisky amargo", "cubitos de hielo, según sea necesario", "50ml / 2fl oz de whisky escocés o bourbon", "giro de la cáscara de limón, para adornar"], "method": ["Tome la cáscara de naranja y apriétela con los dedos. Frote la cáscara en el interior de un vaso de whisky, luego coloque en el vaso. Agregue la cereza, el jarabe de azúcar y los bitters, junto con tres cubitos de hielo.", "Agregue la mitad del whisky escocés o bourbon y revuelva durante unos diez segundos. Agregue más hielo y el resto de whisky escocés o bourbon y revuelva nuevamente durante 10-15 segundos.", "Para servir, decorar con piel de limón."], "url": "www_bbc_co_uk_food_recipes_oldfashionedwhiskyco_89238", "title": "Cóctel de whisky a la antigua", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oldfashionedwhiskyco_89238_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón, hervido durante 1 hora hasta que esté suave, dejado enfriar", "100g / 3½oz de uva", "100 g / 3½ oz de sultanas", "½ manzana Bramley o manzana de cocina grande similar, pelada y picada", "100g / 3½oz de fruta seca", "Cáscara mezclada 75g / 2½oz", "100g / 3½oz Estacio", "100g / 3½oz de azúcar moscatel marrón oscuro", "100 g / 3½ oz de grosella", "½ cucharadita de canela molida", "¼ cucharadita de nuez moscada recién rallada", "1 cucharadita de especias mixtas", "¼ cucharadita de jengibre molido", "50ml / 2fl oz de brandy", "50ml / 2fl oz de jerez", "Harina simple de 450g / 1lb", "1 cucharadita de polvo de hornear", "240 g / 8oz de mantequilla sin sal, más extra para engrasar", "1 cucharada de azúcar en polvo", "140ml / 5fl oz de jugo de naranja", "2 naranjas, solo cáscara", "1 huevo de gallinas camperas, golpeado", "crema batida, mantequilla de brandy o helado, para servir"], "method": ["Para la carne picada, corte el limón hervido y enfriado por la mitad y deseche las pepitas.", "Mezcle el limón, las pasas, las pasas, la manzana picada, la fruta mezclada y la cáscara mixta en un procesador de alimentos hasta obtener una pasta.", "Transfiera la mezcla de limón a un tazón grande y agregue el sebo, el azúcar muscavado, las grosellas, la canela, la nuez moscada, las especias mixtas, el jengibre molido, el brandy y el jerez. Mezcle hasta que esté bien combinado, luego déjelo a un lado durante la noche.", "Para la repostería de naranja, engrase una lata de mollete grande o dos pequeñas con mantequilla. (Necesitarás una lata con 15-18 pozos).", "Mezcle la harina, el polvo de hornear, la mantequilla y el azúcar en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Agregue la ralladura de naranja y mezcle hasta que estén bien combinados, luego agregue gradualmente el jugo de naranja, mezclándolo continuamente, hasta que la mezcla se una como masa. (Es posible que necesite un poco de agua fría adicional).", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada, amase ligeramente hasta que quede suave, luego envuelva con una película adhesiva y deje enfriar en la nevera durante una hora.", "Precalentar el horno a 200C / 400F / Gas 6.", "Corte la masa fría a la mitad. Extienda la mitad de la masa sobre una superficie de trabajo ligeramente enharinada a un espesor de ½ cm / ¼. Con un cortador de pasteles de 7 cm / 2½ pulgadas, corte 15-18 discos (según lo permita la mezcla) y coloque uno en cada uno de los pocillos de estaño para muffins.", "Coloque una cucharada de la mezcla de carne picada en cada una de las cajas de pastel de carne picada y cepille el borde de cada caja de pastelería con un poco de huevo batido.", "Extienda la masa restante sobre una superficie de trabajo ligeramente enharinada a un espesor de ½ cm / ¼ de pulgada. Con un cortador de pasteles de 5 cm / 2 pulgadas, corte 15-18 discos y coloque uno encima de cada pastel de carne picada. Presione juntos los bordes de la masa para sellar.", "Cepille el huevo batido restante sobre la parte superior de los pasteles de carne picada. Con un cuchillo, haga un pequeño orificio de vapor en la parte superior de cada pastel.", "Transfiera los pasteles de carne al horno y hornee por 20-25 minutos, o hasta que estén pálidos dorados.", "Sirva caliente o frío con crema batida, mantequilla de brandy o helado."], "url": "www_bbc_co_uk_food_recipes_oldfashionedsweetmin_90635", "title": "Pasteles de carne picada dulces a la antigua", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 12-15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de harina blanca fuerte", "1 cucharadita de sal", "½ cucharadita de azúcar en polvo", "1 cucharadita de levadura instantánea", "6 aceitunas, piedras quitadas, picadas", "ramita de romero fresco, solo hojas, finamente picado", "1 cucharada de aceite de oliva, más extra para engrasar"], "method": ["Coloque la harina, la sal, el azúcar y la levadura en un bol y mezcle con un tenedor. Agregue las aceitunas y el romero.", "Haga un pozo en el centro de la mezcla y agregue 150ml / 5½fl oz de agua tibia y el aceite. Revuelva la mezcla hasta que se junte en una bola.", "Incline la masa sobre una superficie de trabajo y amase la masa estirándola, doblándola y repitiéndola. Siga amasando la masa hasta que se vea y se sienta suave. Espolvoree con un poco de harina si se siente pegajosa.", "Vuelva a colocar la masa en el recipiente, cúbrala con un paño de cocina y póngala a un lado en un lugar cálido durante 45 minutos, 1 hora o hasta que la masa duplique su tamaño.", "Precaliente el horno a 230 ° C / 450 ° F / Gas 8. Engrase una bandeja para hornear.", "Divida la masa en ocho pedazos, enrolle cada pieza en una bola y colóquela en una bandeja para hornear.", "Hornee en el horno durante 8-10 minutos, o hasta que se levante y dore."], "url": "www_bbc_co_uk_food_recipes_olive_bread_rolls_98178", "title": "Rollos de pan de oliva", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 8 rollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de hechizos", "aceite vegetal, para freír y freír", "2 filetes de atún de 200 g / 7 oz", "3 cucharadas de aceitunas negras y verdes, picadas y picadas", "2 cucharadas de perejil plano de hojas picadas", "75ml / 2½ fl oz de leche", "Harina de 75g / 2½oz", "2 chalotes de plátano, cortados en rodajas finas", "3 chiles secos enteros", "4 dientes de ajo, en rodajas finas", "400ml / 14fl oz de caldo de verduras", "puñado de brócoli tenderstem, recortado", "2 claras de huevo de gallinas camperas", "1 cucharada de pasta de aceitunas negras", "2 hojas sabias", "2 filetes de anchoa, cortados en tiras", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una cacerola mediana de agua con sal y cocine la espelta según las instrucciones del paquete. Escurra, enjuague con agua fría y reserve.", "Calentar un poco de aceite en una sartén grande a fuego medio y freír el atún hasta que se dore por todos lados. Descanse, luego corte en pedazos de 2 cm / 1 in y reserve.", "Mezcle la espelta cocida con las aceitunas y el perejil en un recipiente y reserve.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso con aceite dos tercios lleno. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Vierta la leche en un recipiente y coloque la harina en otro recipiente. Sumerja los anillos de chalote en la leche, luego la harina y fría hasta que estén dorados. Escurrir sobre papel de cocina y reservar. Deje la freidora encendida.", "Calentar un poco de aceite de oliva en una olla pequeña y freír los chiles secos y el ajo hasta que estén dorados y crujientes. Escurrir sobre papel de cocina, cortar los chiles en trozos pequeños y dejarlos a un lado.", "Ponga a hervir el caldo de verduras y cocine el brócoli durante 2 minutos. Cuele el caldo en una cacerola y manténgalo caliente para usar más tarde y mantenga caliente el brócoli.", "Batir las claras de huevo en un bol limpio hasta que se formen picos suaves. Extienda un poco de pasta de aceitunas en cada hoja de salvia y coloque una tira de anchoa en la parte superior. Dobla cada hoja de salvia por la mitad y sumérgete en las claras de huevo, luego freír hasta que estén doradas. Escurrir sobre papel de cocina.", "Para servir, divida la mezcla de espelta y oliva entre dos tazones y cocine sobre el caldo tibio. Agregue los trozos de atún y el brócoli y espolvoree sobre los anillos de chalote, el ajo y el chile. Cubra cada plato con una hoja de salvia disecada."], "url": "www_bbc_co_uk_food_recipes_olive_and_spelt_broth_15172", "title": "Caldo de oliva y espelta con atún", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "20g / ¾oz de sal", "20 g / ¾oz de levadura instantánea", "800ml / 1½ pintas de agua tibia", "4 cucharadas de aceite de oliva, más extra para engrasar", "1 x 1kg / 2lb 2 oz tarro aceitunas verdes en salmuera, escurrido", "sémola fina, para quitar el polvo (opcional)"], "method": ["Engrase dos recipientes de plástico cuadrado de 2-3 litros / 3½-5¼ pintas.", "Ponga la harina en el tazón de un mezclador equipado con un gancho de masa. Agregue la sal a un lado del tazón y la levadura al otro. Agregue tres cuartos del agua y comience a mezclar a baja velocidad. A medida que la masa comienza a juntarse, gradualmente agregue el agua restante.", "Mezcle por otros 5-8 minutos a velocidad media. La masa ahora debe estar húmeda y estirar fácilmente cuando se tira. Agregue el aceite de oliva y mezcle por otros dos minutos. Agregue las aceitunas y mezcle hasta que estén bien distribuidas.", "Coloque la masa en los envases engrasados ​​y déjela hasta que se hayan triplicado por lo menos durante aproximadamente una hora.", "Alinee cuatro bandejas para hornear con pergamino para hornear o papel de silicona y precaliente el horno a 220C / 425F / Gas 7.", "Polvo la superficie de trabajo con harina - agregue algo de sémola también, si tiene alguna. Cuidadosamente incline la masa sobre la superficie. Será muy flexible y fluido, pero no te preocupes. En lugar de derribarlo, manipúlelo suavemente para que mantenga la mayor cantidad posible de aire en la masa.", "Espolvorea la parte superior de la masa con harina y luego estírala suavemente hasta obtener un rectángulo áspero. Comenzando en un borde largo, corte la masa en aproximadamente 36 tiras. Estire cada pieza hasta 20-25cm / 8-10 pulgadas de largo. Coloque seis tiras en cada una de las bandejas de hornear preparadas, separándolas.", "Hornea los palitos de masa por 10-15 minutos. Dejar enfriar sobre una rejilla de alambre"], "url": "www_bbc_co_uk_food_recipes_olive_breadsticks_79125", "title": "Palitos de oliva", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 36 palitos de pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/olive_breadsticks_79125_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal", "1 x paquete de 270 g / 9½ oz congelado filo pastelería, descongelado", "200-250g / 7-9oz queso feta", "2 cucharaditas de parmesano rallado (o queso duro vegetariano alternativo)", "2 cucharaditas de hojas frescas de tomillo o 1 cucharadita seca", "2 huevos grandes de gallinas camperas", "150ml / 5fl oz de leche entera", "1 cucharada de semillas de sésamo", "1 jarra de miel clara de buena calidad (como miel de tomillo griego o miel de azahar)"], "method": ["Derrita la mantequilla en una olla pequeña, luego retírela del fuego.", "Cubra una lata cuadrada de 20 cm / 8 pulgadas con una capa de filo, asegurándose de que sobresalga por los lados; necesitarás usar más de una hoja. Luego vierta 1 cucharada de mantequilla derretida sobre la masa.", "Usando un tercio de las hojas de filo restantes, rasgue y arrugue las hojas y colóquelas sin apretar en la lata. Luego mézclese por la mitad del queso feta, espolvoree con 1 cucharadita de queso parmesano y poco menos de ½ cucharadita de hojas de tomillo (o ¼ cucharadita de tomillo seco) y vierta un tercio de la mantequilla derretida restante sobre la parte superior.", "Repita, para que use todo menos mantequilla y una pequeña cantidad de tomillo. Para la última capa, puedes usar pedazos más grandes de \"trapos\" de filo (como es la tapa), llenando la lata un poco más apretadamente, pero aún frotándolos.", "Doblar los bordes del filo colgante sobre ellos mismos, y verter la mantequilla restante en la parte superior. Con la punta afilada de un cuchillo, realice 2 cortes hacia abajo y dos cortes en la lata llena de filo, de canto a borde para crear 9 secciones. Es importante que no uses un cuchillo sin punta, ya que no quieres arrastrar el filo ni presionarlo hacia abajo.", "Batir los huevos con la leche, luego verter sobre el contenido de la lata. Espolvoree el último trozo de tomillo junto con las semillas de sésamo en la parte superior. Deje reposar durante al menos 30 minutos en un lugar fresco antes de hornear. Si 2 horas es más fácil para su horario, entonces colóquelo en el refrigerador. Y puede hacerlo por adelantado (consulte los consejos de recetas principales).", "Caliente el horno a 200C / 180C Fan / Gas 6 y hornee el pastel durante 30 minutos. Cuando esté listo, la masa estará dorada e hinchada, y el conjunto interior. Déjelo reposar durante 10 minutos, luego coloque 1 cucharada de miel sobre la parte superior.", "Cortar en rebanadas o losas con un cuchillo de sierra y una acción de aserrar para evitar aplastar demasiado el filo y luego empujar el cuchillo hacia abajo para cortar. Sirva el pastel directamente de la lata y coloque el tarro de miel con una cuchara (o puede verterlo en una jarra) sobre la mesa para que las personas agreguen más mientras comen."], "url": "www_bbc_co_uk_food_recipes_old_rag_pie_54402", "title": "Pastel de trapo viejo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 9 generosas losas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/old_rag_pie_54402_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["375g / 13oz de harina blanca fuerte, más extra para espolvorear", "250g / 9oz de masa fermentada", "7g de sal", "130-175ml / 4-6fl oz de agua tibia", "aceite de oliva, para amasar", "harina de sémola, para quitar el polvo", "100g / 3½ oz de aceitunas negras sin hueso", "100g / 3½oz de aceitunas verdes sin hueso", "1 cucharada de orégano seco"], "method": ["Combine la harina, el entrante y la sal en un tazón grande. Agregue el agua, poco a poco (puede que no lo necesite todo) y mezcle con las manos, hasta que haya hecho una masa suave.", "Incline la masa sobre una superficie ligeramente engrasada y amasar la masa durante 10-15 minutos, o hasta que la masa esté suave, elástica y lisa. La masa formará una piel suave y lisa cuando esté lista.", "Incline la masa en un recipiente ligeramente engrasado lo suficientemente grande como para dejar espacio para que se eleve, y cubra con una película adhesiva un paño de cocina. Deje que se levante en un lugar cálido (22-24 ° C / 71-75 ° F) durante seis horas, o hasta que al menos duplique su tamaño.", "Mezcle harina blanca y harina de sémola en cantidades iguales y úsela para quitar el polvo de la superficie de trabajo. Incline la masa sobre la superficie y agregue las aceitunas y el orégano y amasarlos, eliminando el aire de la masa a medida que lo hace.", "Divida la mezcla en dos pedazos y dé forma a cada uno en una fougasse. Para hacer esto, coloque la masa en una bandeja para hornear engrasada y use sus manos o un rodillo para hacer que cada pieza se convierta en un rectángulo básico. Use un cuchillo afilado para hacer 3-4 cortes diagonales en cada mitad de cada rectángulo, creando agujeros en la masa. Saque con cuidado la masa para estirarla y abrir los agujeros. Cúbralo sin apretar con un paño de cocina o film transparente aceitado y déjelo reposar en un lugar cálido durante cuatro horas. Debería volver al tacto cuando esté listo.", "Cuando esté listo para hornear, llene la mitad de una lata de asar con agua y colóquela en el estante inferior del horno, y precaliente el horno a 220 ° C / 425 ° F / Gas 7. Esto generará vapor que ayudará a formar una buena costra.", "Hornee los panes durante 20 minutos hasta que estén dorados y crujientes. Dejar enfriar sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_olive_sourdough_fougasse_26097", "title": "Fougasse de masa madre de oliva", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/olive_sourdough_fougasse_26097_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Aceitunas negras de 100 g / 3½ oz, hoyos eliminados", "1 diente de ajo, finamente picado", "½ limón, jugo y ralladura", "3 cucharadas de aceite de oliva", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "3 rebanadas de pan de ciabatta", "3 cucharadas de aceite de oliva", "8 aceitunas negras enteras, hoyos eliminados", "Rodajas de limón"], "method": ["Para tapenade, coloque todos los ingredientes tapenade en un pequeño procesador de alimentos y procese hasta que quede suave y combinado.", "Para la bruschetta, caliente una sartén hasta que esté caliente. Rocíe las rebanadas de pan con el aceite y el carbón hasta que estén doradas por ambos lados.", "Sirva la tapenade untada sobre la bruschetta y espolvoree sobre las aceitunas y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_oliveandlemontapenad_88516", "title": "Tapenade de aceituna y limón sobre bruschetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de pasta de aceitunas negras", "4 rebanadas de pan blanco de un día", "2 claras de huevo de gallinas camperas", "sal y pimienta negra recién molida", "1,5kg / 3lb 4oz cordero, cortado de grasa y tendones", "1 cucharada de aceite de oliva", "botón de mantequilla", "1 berenjena", "sal", "1 cucharada de aceite de oliva", "1 apio en barra, cortado en cuadrados de 2cm / ¾", "1 pimiento rojo, picado en cuadrados de 2cm / ¾en", "200g / 7oz de tomates picados en conserva, escurridos", "2 cucharadas de miel clara", "100ml / 3½fl oz de vinagre de vino tinto", "1 cucharada de alcaparras", "50 g / 1¼ oz de sultanas", "50 g / 1 / oz de piñones, tostados", "3 cebolletas, finamente picadas", "6 hojas de albahaca", "puñado de cohetes", "150ml / 5¼ oz de aceite de oliva", "1 cucharada de vinagre de vino tinto"], "method": ["Precaliente el horno a 200C / 390F / Gas 6. Coloque la pasta y el pan de aceitunas negras en un procesador de alimentos y mezcle por un minuto. Extiende la mezcla de migas de pan en una bandeja para hornear.", "Transfiera al estante del medio del horno y hornee las migas durante diez minutos, o hasta que estén ligeramente tostados y secos. Tenga cuidado de no dejarlos quemar.", "Batir ligeramente las claras de huevo en un tazón pequeño. Sazonar el cordero con sal y pimienta negra recién molida. Sumerja el cordero en la clara de huevo y luego en las migas de oliva. Elimine cualquier exceso de migas.", "Coloque el aceite de oliva y la mantequilla en una sartén para horno. Cuando la mantequilla se haya derretido, agregue el cordero a la sartén y fría por un minuto. Voltee el cordero y colóquelo en el horno. Asar durante 20-25 minutos, o hasta que estén tiernos y dorados. Retirar del horno, cubrir con papel de aluminio y dejar reposar en un lugar cálido.", "Para la berenjena agridulce, picar la berenjena en cubos de 2cm / ¾in y espolvorear con sal. Deja la berenjena por 15 minutos. La sal liberará líquido de la berenjena, por lo que deberá secarlo con papel de cocina.", "Agregue el aceite de oliva a una sartén. Cuando la sartén esté caliente, agregue la berenjena y fría por dos minutos, antes de agregar el apio y el pimiento rojo. Freír por tres minutos.", "Agregue el tomate picado, la miel y el vinagre y cocine a fuego lento durante otros diez minutos.", "Agregue las alcaparras, pasas, piñones, cebolletas picadas y albahaca a la sartén y retire del fuego.", "Para el aderezo del cohete, coloque el cohete, el aceite de oliva y el vinagre en una licuadora o procesador de alimentos. Mezclar hasta que esté suave.", "Para servir, corte el cordero y vierta la berenjena agridulce en dos platos para servir. Sirva las rodajas de cordero en la parte superior de la berenjena y rocíe alrededor del aderezo."], "url": "www_bbc_co_uk_food_recipes_olivecrustedlambwith_87823", "title": "Cordero verde oliva con berenjena agridulce", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Aceitunas kalamata 150 g / 5½ oz, piedras quitadas", "1 diente de ajo, pelado", "3 cucharadas de aceite de oliva, más extra para lloviznar", "sal y pimienta negra recién molida", "3 rebanadas de baguette", "pequeño puñado de cohetes"], "method": ["Coloque las aceitunas kalamata, el ajo y la mitad del aceite de oliva en un mini procesador de alimentos y mezcle hasta obtener una pasta gruesa. Poco a poco agregue el aceite de oliva restante hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Rocíe un poco de aceite de oliva en las rebanadas de baguette. Caliente una sartén de plancha y pásele las rebanadas de baguette durante 2-3 minutos en cada lado.", "Extienda cada rebanada de baguette con la tapenade de oliva y colóquela en un plato para servir.", "En un tazón, rocíe el cohete con un poco de aceite de oliva y sazone con sal y pimienta negra recién molida. Coloque en el plato y sirva."], "url": "www_bbc_co_uk_food_recipes_olivetapenadebrusche_87999", "title": "Bruschetta tapenade de oliva con ensalada de rúcula salvaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 ml de cal calcial", "60ml flor de saúco cordial", "3 gotas de agua de azahar", "250ml de agua de soda helada"], "method": ["Vierta todos los ingredientes en una jarra y revuelva. Sirva en copas de champán para mezclarse en una fiesta."], "url": "www_bbc_co_uk_food_recipes_olys_sham-pagne_59307", "title": "El simulacro de Olli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/olys_sham-pagne_59307_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800g / 1lb% 2012oz% 205 %% 20fat% 20beef% 20mince", "1 cucharada de aceite de oliva light", "2 cebollas grandes, finamente picadas", "4 dientes de ajo rallados", "2 zanahorias, finamente picadas", "2 palitos de apio, finamente picados", "1 cucharada de semillas de alcaravea", "3 cucharadas de puré de tomate", "700ml / 1¼ pinta de caldo de res fresco", "400g de tomates cortados en lata", "1 cubo de caldo de carne", "1 cucharada de orégano seco", "2 ramitas de romero, hojas recogidas y finamente picadas", "200g / 7 oz de champiñones, reducido a la mitad", "2 calabacines grandes, finamente cortados en ángulo", "2 tomates de carne de vacuno, en rodajas en 12", "250g / 9oz de ricotta", "1 mozzarella de bolas, rallado (125 g / 4½ oz)", "Parmesano rallado 10g / ⅓oz", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Extienda la carne en una bandeja para hornear forrada con papel de hornear. Hornee en el estante superior durante 40 minutos, separándolo cada 10 minutos. Debe ser un color marrón oscuro y uniforme. Eliminar y reservar. Mantenga el horno encendido.", "Caliente el aceite en una sartén antiadherente grande a fuego medio. Cocine las cebollas por 10 minutos, o hasta que estén blandas, agregando un chorrito de agua si empiezan a pegarse.", "Agregue el ajo y cocine por 1 minuto. Agregue las zanahorias y el apio y cocine durante 5 minutos, luego agregue las semillas de alcaravea, agitando durante 30 segundos. Revuelva a través del puré de tomate y cocine durante 1 minuto.", "Agregue la carne picada, el caldo, los tomates enlatados, el cubo común, las hierbas y los champiñones. Llevar a ebullición, luego baje el fuego a fuego lento y cocine durante 25-30 minutos, o hasta que la salsa se espese a un rico ragu.", "Vierta el ragu en un plato resistente al horno, de aproximadamente 23x33 cm / 9x13 pulgadas y 5 cm / 2 pulgadas de profundidad. Cubra los calabacines con los tomates encima, condimentando cada capa con sal y pimienta. Sazone la ricotta con sal y pimienta y salpique uniformemente sobre los tomates.", "Esparce sobre la mozzarella y el parmesano y hornea por 35 minutos, o hasta que la cobertura esté dorada."], "url": "www_bbc_co_uk_food_recipes_one-layer_lasagne_53097", "title": "Lasaña de una sola capa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/one-layer_lasagne_53097_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "175g / 6oz de leche condensada", "2 cucharadas de polvo instantáneo de espresso", "2 cucharadas de licor de expreso (o licor de café)"], "method": ["Batir todos los ingredientes hasta que se formen picos suaves, y se obtiene una magnífica mezcla airosa de color caffè-latte, y luego llenar un recipiente hermético y congelar durante seis horas o toda la noche."], "url": "www_bbc_co_uk_food_recipes_one-step_no-churn_coffee_88525", "title": "Helado de café sin batido en un solo paso", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Hace 1 litro", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/one-step_no-churn_coffee_88525_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva light", "8% 20x% 2010 %% 20fat% 20pork% 20sausage,% 20cut% 20into% 20chunks", "6 cebolletas, finamente picadas", "Setas de 200 g / 7 oz, en rodajas finas", "2 dientes de ajo, aplastados", "400g / 14oz de tomates cherry, cortados a la mitad", "400g de judías cocidas al horno", "4 huevos grandes de gallinas camperas", "¼ cucharadita de pimentón dulce ahumado", "Feta de 40 g / 1½ oz", "2 cucharadas de perejil de hoja plana finamente picado, para adornar"], "method": ["Caliente el aceite en una sartén grande y ancha. Dore las salchichas por 2-3 minutos, luego retírelas de la sartén y déjelas a un lado.", "Agregue las cebolletas y los champiñones a la sartén y cocine a fuego medio durante 3-4 minutos, o hasta que estén blandos. Agregue el ajo y fría por 1 minuto. Agregue los tomates, los frijoles y las salchichas y cocine a fuego lento durante 20 minutos o hasta que las salchichas estén cocidas.", "Haga cuatro pozos en la mezcla y agriete los huevos en ellos. Cubra la sartén y deje hervir durante 6-8 minutos, o hasta que los blancos estén cocidos o cocinados a su gusto.", "Espolvoree un poco de pimentón sobre cada huevo, revuelva sobre el queso feta y la cuchara en los cuencos. Adorne con el perejil y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_one_pan_breakfast_bowl_47359", "title": "Desayuno de una sola taza durante todo el día", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/one_pan_breakfast_bowl_47359_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero pequeño", "2 cucharadas de jengibre recién rallado", "1 cucharada de comino molido", "30ml / 2 cucharadas de aceite vegetal", "½ cucharada de tomillo seco (si usa fresco, deje 1 cucharada de hojas de tomillo)", "sal y pimienta negra", "1 calabacín, rebanado grueso en la diagonal", "1 pimiento rojo, sin semillas y cortado en rodajas", "200 g / 7 oz de arroz de grano largo", "1 canela grande", "1 hoja de laurel", "3 vainas de cardamomo", "125 g / 4½ oz de pasas verdes", "1 limón, ralladura y jugo", "1 lima, ralladura y jugo", "100g / 3½oz de nueces de mono, sin cáscara, ligeramente tostadas y picadas", "1 cucharada de cebollas de primavera en rodajas finas", "1 cucharada de cilantro fresco picado (opcional)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Junta el pollo quitando los pechos, las piernas y las alas. Coloque la carcasa restante en una olla grande y cúbrala con agua para hacer una reserva. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 30 minutos.", "En un tazón pequeño, mezcle el jengibre rallado y el comino con el aceite, el tomillo y una pizca de sal y pimienta para hacer una pasta. Coloque las piezas de pollo en una bandeja grande para asar y cubra uniformemente con la pasta.", "Coloque el calabacín y los pimientos alrededor de las piezas de pollo, luego tueste durante 30-40 minutos en el estante superior del horno, o hasta que el pollo esté cocido y dorado.", "Cuele el caldo de pollo y deseche el cadáver, sazone al gusto con sal y pimienta.", "Cubra el arroz con 500 ml / 18 fl oz de caldo (de la carcasa del pollo) y agregue la ramita de canela, laurel y cardamomo. Cocine con la tapa a fuego alto durante 15 minutos. Hacia los últimos cinco minutos de tiempo de cocción, agregue las pasas.", "Verifique que el arroz esté cocido, escurra el exceso de líquido y elimine la hoja de laurel y las especias. Agregue la ralladura y el jugo del limón y la lima. Mezcle y sazone al gusto con sal y pimienta.", "Sirva los trozos de pollo asado y las verduras asadas sobre una cama de arroz con especias. Adorne con una pizca de nueces tostadas picadas y cebollas cortadas en rodajas. Termine con un poco de cilantro picado si lo desea."], "url": "www_bbc_co_uk_food_recipes_one_pot_chicken_with_05336", "title": "Pollo con arroz picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/one_pot_chicken_with_05336_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cerdo 200 g / 7 oz, cortado en 6 diagonalmente", "6 hojas de salvia", "6 rebanadas de jamón", "Harina normal de 25g / 1oz", "1 cucharada de aceite de oliva", "sal marina y pimienta negra", "1 diente de ajo, aplastado", "150g / 5½oz de tomates cherry, cortados a la mitad", "200g / 7oz de frijoles franceses", "50ml / 2fl oz de vino blanco"], "method": ["Coloque cada rebanada plana de carne de cerdo en una tabla de cortar y golpee suavemente con un martillo para carne o rodillo hasta aproximadamente 5 mm / ¼ de espesor.", "Cubra cada rebanada con una hoja de salvia, sazone con sal y pimienta y envuelva en una rebanada de jamón.", "Coloque la harina en un plato ancho y cubra bien cada rebanada, acariciando cualquier exceso.", "Caliente una sartén grande a fuego medio y agregue el aceite. Cocine las rebanadas durante 2-4 minutos en cada lado, o hasta que el cerdo se haya cocinado y el jamón esté crujiente. Retire de la sartén y reserve.", "Agregue el ajo a la sartén por un minuto antes de agregar los tomates cherry, las judías verdes y el vino blanco. Cocine durante 4-5 minutos, o hasta que los frijoles estén tiernos (es posible que necesite un chorrito de agua para unirlos).", "Sirve el saltimbocca con las verduras."], "url": "www_bbc_co_uk_food_recipes_one_pan_saltimbocca_alla_71615", "title": "Una sartén saltimbocca alla Romana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Leche de 850ml / 1½pint", "2 filetes de eglefino ahumado de buena calidad", "30g / 1oz de mantequilla", "15g / ½ oz de harina natural", "10 huevos grandes de gallinas camperas", "150 g / 5½ oz parmesano, rallado", "1 manojo de cebollín, picado", "2 yemas de huevo grandes de gallinas camperas", "150 g / 5½ oz de crema", "sal y pimienta negra, al gusto"], "method": ["En una cacerola grande, ponga la leche a hervir. Coloque el abadejo ahumado en la leche y apague el fuego. Coloque una tapa en la sartén y déjela reposar suavemente en la leche durante aproximadamente 8-10 minutos.", "Retire el eglefino de la sartén y cubra con papel de aluminio para mantener el calor. Retire todos los huesos y deseche la piel. Pase la leche furtiva a través de un tamiz fino en una jarra.", "En una sartén, derrita la mitad de la mantequilla y luego agrega la harina. Mezcle para formar una pasta suave. Poco a poco agregue la mitad de la leche de caza furtiva en lotes, revolviendo todo el tiempo, para hacer una salsa blanca.", "Batir los huevos enteros en un recipiente y sazonar con sal y pimienta. En una sartén antiadherente grande, derrita la mantequilla restante a fuego lento. Vierta los huevos batidos en la sartén y cocine lentamente. Cuando esté recién cocinado, retirar del fuego y cubrir con parmesano rallado. Agregue las cebolletas picadas y coloque hojuelas de abadejo ahumado sobre la parte superior.", "Precalentar la parrilla a la temperatura más alta.", "En un tazón, mezcle las yemas de huevo y la crema fresca con seis cucharadas de salsa blanca. Coloque esta mezcla sobre la tortilla y colóquela debajo de la parrilla precalentada para hacer un glaseado (alternativamente, use un soplete)."], "url": "www_bbc_co_uk_food_recipes_one_pan_smoked_haddock_53745", "title": "Abadejo ahumado, parmesano y tortilla de crema fresca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla grande", "1 diente de ajo", "2 cucharadas de aceite de oliva", "500 g / 1 libra de carne picada 2 oz", "Mezcla de aderezo de chile con paquete de 30g / 1oz", "500ml / 18fl oz de caldo de carne (de un cubo en existencia)", "1 cucharada de puré de tomate", "400g de tomates cortados en lata", "2 cucharadas de ketchup de tomate", "400 g de frijoles de lata, escurridos y enjuagados", "sal y pimienta", "350g / 12oz de arroz integral o blanco"], "method": ["Pelar y cortar la cebolla, pelar y rallar finamente el ajo. Caliente el aceite en una cacerola de base pesada a fuego medio-alto, agregue las cebollas y el ajo y fría durante 5 minutos hasta que estén suaves.", "Agregue la carne a la sartén y fría durante 5 minutos hasta que se dore. Agregue la mezcla de condimentos de chile y un poco de caldo, fría durante 1 minuto, luego agregue el puré de tomate y freíelos por un minuto más. Agregue los tomates picados y el caldo y revuelva para combinar, luego agregue el ketchup. Cocine a fuego lento suavemente destapado durante 30 minutos, revolviendo ocasionalmente.", "Mientras tanto, ponga a hervir un sartén grande de agua con sal, agregue el arroz y cocínelo durante 25 minutos o de acuerdo con las instrucciones del paquete.", "Agregue los frijoles a la guindilla y cocine por otros 2 minutos, hasta que se caliente. Sazonar con sal y pimienta y servir con el arroz."], "url": "www_bbc_co_uk_food_recipes_one_pot_chilli_con_carne_17422", "title": "Una olla de chile con carne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/one_pot_chilli_con_carne_17422_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de abadejo de 140 g / 5 oz, huesos extraídos", "Harina normal de 25g / 1oz, para quitar el polvo", "1 cucharada de aceite vegetal, para freír", "1 x 400 g / 14 oz puede butterbeans, enjuagado y escurrido", "½ chorizo ​​de cocina español, cortado en tiras", "200ml / 7fl oz de caldo de pollo", "500 g / 1 libra de espinaca bebé 2 oz", "100g / 3½oz de queso de cabra", "2 cucharaditas de mantequilla sin sal", "pan crujiente, como bloomer o baguette francés, para servir"], "method": ["Dragar los filetes de pescado en la harina, sacudiendo cualquier exceso.", "Caliente una sartén antiadherente hasta que esté caliente, agregue el aceite vegetal y fría los filetes de pescado durante 3-4 minutos o hasta que estén dorados. Cuidadosamente voltee el pescado y fríalo por 1-2 minutos más, o hasta que se dore por todas partes y recién cocido (el pescado debe ser opaco durante todo el proceso).", "Agregue los butterbeans y el chorizo ​​a la sartén, agregue el caldo y cocínelos durante 1-2 minutos para que se caliente.", "Agregue la espinaca, el queso de cabra y la mantequilla a la sartén y cocine hasta que el queso se derrita.", "Para servir, coloque un filete de pescado en cuatro cuencos para servir poco profundos y espolvoree la mezcla de queso de mantequilla, chorizo, espinacas y cabras. Servir con un poco de pan crujiente."], "url": "www_bbc_co_uk_food_recipes_onepotpollockwithcho_92367", "title": "Pollock de una sola olla con chorizo, queso de cabra y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]