[{"ingredients": ["2 cebollas grandes de primavera, más o menos picadas", "2 tomates, toscamente picados", "1 manojo de cebollín, picado", "1 manojo de menta", "1 manojo de orégano", "1 hombro cordero de marisma", "100ml / 3½fl oz de aceite de oliva", "1 botella de vino blanco seco", "sal y pimienta negra recién molida", "3 cucharadas de miel", "1 manojo de tomillo, hojas recogidas", "Papas de 500g / 1lb 2oz, peladas y cortadas en cubos de 2cm / ¾in", "Apioalerio de 500 g / 1 lb 2 oz, pelado y cortado en cubos de 4 cm / 1½ pulgadas", "100g / 3½oz de mantequilla ligeramente salada, cortada en cubitos", "100g / 3½ oz de queso ahumado, rallado", "sal y pimienta negra recién molida", "salpicadura de crema individual", "pizca de nuez moscada, recién rallado"], "method": ["Para el cordero, precaliente el horno a 140C / 275F / Gas 1.", "Coloque las cebolletas, los tomates picados, el cebollín, la menta y el orégano en una lata honda. Coloque el cordero en la parte superior y rocíe con aceite de oliva y el vino blanco. Sazone al gusto con sal y pimienta negra recién molida. Cubra bien con papel de aluminio.", "Coloque en el horno y cocine por 3-4 horas, o hasta que la carne esté tierna. Una vez cocido, retire el cordero de la lata y déjelo enfriar. Deje las verduras y hierbas en la bandeja para enfriar.", "Para el puré de apio nabo, hierva una sartén de agua con sal. Agregue las papas y el apionabo y cocine durante 15-20 minutos, o hasta que estén tiernos. Escurrir y macerar hasta que quede suave utilizando un ricer de patata o trituradora. Agregue la mantequilla y el queso, sazone con sal y pimienta negra recién molida, luego bata un poco de crema. Rallar en una pizca de nuez moscada. Guarde en un lugar cálido hasta que esté listo para servir.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero, haz una salsa. Retire la mayoría de las hierbas de la parte inferior de la lata de asar. Coloque el contenido restante de la lata de tostado en una licuadora, raspando cualquier trozo del fondo de la lata. Mezcle hasta obtener un puré y manténgalo caliente.", "Mezcle la miel y las tres cuartas partes del tomillo juntas. Cepilla el cordero. Corte el cordero en trozos del tamaño de un bocado y espolvoree un poco más de tomillo. Coloque en una bandeja para hornear y cocine en el horno caliente durante 10 minutos o hasta que estén doradas.", "Para servir, recalentar la salsa y macerar (si es necesario). Coloque una cucharada de puré en cada plato y cubra con el cordero. Rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_honey_glazed_lamb_and_27790", "title": "Miel glaseada de cordero y apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["320ml / 11fl de leche en oz", "4 huevos de gallinas camperas, solo yemas", "100 g / 3½ oz de azúcar en polvo", "60g / 2¼ oz de miel", "2½ hojas de gelatina", "Crema doble de 250 ml / 9 fl oz, batida a picos rígidos", "Azúcar 90 g / 3 oz", "90ml / 3fl oz puerto", "2 hojas de gelatina", "higos frescos, cortados en cuartos"], "method": ["Llevar la leche a fuego lento en una cacerola. Batir las yemas de huevo y el azúcar impalpable en un bol hasta que estén pálidos y espumosos, luego agregar la miel y batir lentamente en la leche tibia. Coloque el recipiente sobre una fuente de agua hirviendo (asegúrese de que el recipiente no toque el agua) y cocine suavemente, batiendo continuamente hasta que espese y la mezcla cubra la parte posterior de una cuchara.", "Ablande las hojas de gelatina en un poco de agua fría durante cinco minutos, escurra el exceso de agua y mezcle la gelatina en la crema pastelera hasta que se disuelva. Pasar la crema pastelera a través de un colador fino en un recipiente limpio y enfriar en el refrigerador. Cuando la natilla esté casi lista (alrededor de una hora) doble la crema batida.", "Para la gelatina de puerto, mezcle el azúcar y el puerto en una cacerola y hierva hasta que el azúcar se haya disuelto. Suavice las hojas de gelatina en un poco de agua durante cinco minutos, escúrralas y mezcle la gelatina en el líquido caliente hasta que se disuelva. Pasar la gelatina a través de un tamiz fino en un recipiente y dejar enfriar pero no fijar.", "Para ensamblar, selle la parte inferior de los seis moldes de anillo con film transparente. Coloque la mousse en los moldes, dejando espacio en la parte superior para agregar la gelatina de puerto. Refrigere hasta que esté listo (al menos 1½ horas). Vierta la gelatina en la parte superior de la mousse. Refrigere hasta que esté listo (aproximadamente una hora).", "Para servir, suspenda los moldes en agua caliente durante 30 segundos y luego retire cuidadosamente la película adhesiva. Coloque cada mousse en un plato. Coloque unas frambuesas encima de la mousse y rocíe un poco de miel en la parte superior. Arregle las rebanadas de higo alrededor de la mousse."], "url": "www_bbc_co_uk_food_recipes_honey_mousse_with_port_51340", "title": "Mousse de miel con gelatina de puerto y frambuesas frescas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_mousse_with_port_51340_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo grande (aproximadamente 1.8kg / 4lb)", "4 dientes de ajo, en rodajas finas", "2 cucharaditas de aceite de girasol", "sal marina escamada y pimienta negra recién molida", "4 cucharadas de mostaza Dijon", "2 picos limpian miel (al gusto)", "½ cucharadita de chile en polvo", "algunas ramitas de tomillo fresco, hojas recogidas y picadas, más ramitas adicionales para adornar", "1 kg / 2 libras 4 oz de batatas (o patatas), peladas y cortadas en trozos grandes", "25 g / 1oz de mantequilla sin sal", "1 manojo de cebollas de primavera, cortado y finamente cortado", "½ manojo de menta, hojas recogidas y aproximadamente desgarradas", "3 cucharadas de harina común", "½ vaso de vino blanco (aproximadamente 75-100 ml / 2½-3½ fl oz)", "500ml / 18fl oz buen caldo de pollo líquido"], "method": ["Precaliente el horno a 240C / 450F / Gas 8 (ventilador de 220C).", "Coloque el pollo con la pechuga hacia abajo sobre una tabla de cortar y corte con un buen par de tijeras a lo largo de cada lado de la columna vertebral para quitarlo, cortando las costillas a medida que avanza. Luego dale la vuelta y aplana el pecho con la palma de la mano. Habrá una pequeña grieta que significa que el ave será agradable y plana. Luego coloque el ave con la pechuga hacia arriba en una lata de asar.", "Use la punta de un pequeño cuchillo afilado para colocar suficientes hendiduras en todo el pecho y las piernas, ya que hay rodajas de ajo y luego empuje las rodajas de ajo en ellos. Rocíe con el aceite, sazone bien con sal y pimienta y luego revuelva en el horno durante 30 minutos para obtener un poco de color en la piel.", "Mientras tanto, mezcle la mostaza, la miel, el chile en polvo y las hojas de tomillo en un tazón pequeño y déjelos a un lado.", "Después de 30 minutos de cocción, saque el pájaro del horno y reduzca la temperatura del horno a 200 ° C / 400 ° F / Gas 6 (ventilador de 180 ° C). Para ayudar a enfriar el horno rápidamente, puede abrir la puerta del horno y una vez que la luz roja del termostato vuelva a encenderse, ciérrelo. Mientras tanto, unte el pollo con la mezcla de mostaza con el dorso de una cuchara. Una vez que la temperatura es correcta, vuelva a colocar el pollo en el horno por otros 15 minutos.", "Mientras tanto, para el puré de batatas y menta, hierva las batatas durante aproximadamente ocho minutos más o menos (dependiendo del tamaño de los trozos), o hasta que las papas estén tiernas pero no demasiado suaves. Un par de minutos antes de que estén listos, derrita la mantequilla en una sartén pequeña a fuego medio y cocine las cebolletas durante dos minutos, revolviendo hasta que se ablanden. Escurra bien las papas cocidas y luego machaque bien con un triturador. Agregue la cebolleta y la mantequilla y sazone bien con sal y pimienta. Presiona una tapa para mantener el calor.", "Para verificar que el pollo esté cocido, inserte un cuchillo afilado en la parte más gruesa de la pierna, luego presione el cuchillo un poco hacia abajo. Si los jugos son claros y no son rosados, entonces el pollo está cocido. Una vez cocinado, levante el pollo de la bandeja y colóquelo en un plato o placa calentados y cubra con papel de aluminio para mantener el calor.", "Para la salsa, sosteniendo la lata de asar con un paño de horno, inclínelo hacia arriba hasta que toda la grasa y los jugos corran a una esquina. Retire la mayor cantidad de grasa posible y deséchela. Deberías quedarte con alrededor de tres cucharadas de jugos en el fondo de la lata. Ponlo en el fogón a fuego lento y agrega la harina hasta que esté bien mezclado. Agregue el vino y el caldo un poco a la vez, revolviendo todo el tiempo para que no se ensucie. Una vez que se haya agregado todo el líquido, ponga la mezcla a ebullición y cocine por 2-3 minutos, o hasta que espese, revolviendo regularmente. Vierta a través de un colador fino en una jarra calentada y sazone al gusto con sal y pimienta.", "Esculpe el pollo, coloque las rebanadas en un plato grande para servir y adorne con ramitas de tomillo frescas. Coloque el puré de batata en un recipiente y esparza la menta. Sirve a la vez con la salsa caliente."], "url": "www_bbc_co_uk_food_recipes_honey_mustard_and_garlic_02558", "title": "Honey mustard y ajo spatchcock pollo con batata y puré de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_mustard_and_garlic_02558_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo grandes sin piel y sin hueso", "6 cucharadas de mostaza integral", "2 cucharadas de miel clara", "2 limones, solo jugo", "pimienta negra recién molida", "2 cucharadas de aceite de colza", "8 panes calientes de pitta", "2 aguacates maduros grandes, apedreados, pelados y cortados en cubitos (1cm / ½ en cubos)", "1 lima, solo jugo", "2 chalotes, finamente picados", "8 tomates cherry, descuartizados", "1 chile rojo grande, sin semillas, finamente picado", "1 diente de ajo, finamente picado", "azúcar pizca", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida", "410 g / 14 oz pueden garbanzos, drenados y enjuagados", "4 cucharadas de pasta de tahini", "2 dientes de ajo, picados", "1 limón, solo jugo", "8 cucharadas de aceite de oliva virgen extra", "3 cucharadas de yogur griego", "sal y pimienta negra recién molida"], "method": ["Para el pollo, corte las pechugas de pollo en tiras de longitud de dedo.", "En un tazón, combine la mostaza, la miel y el jugo de limón. Agregue las tiras de pollo a la mezcla y sazone con pimienta negra.", "Caliente el aceite de colza en un wok o en una sartén grande hasta que esté muy caliente. Agregue las tiras de pollo y saltee durante 5-6 minutos, o hasta que estén doradas y cocidas.", "Para la salsa de aguacate y tomate, coloca el aguacate cortado en dados en un tazón y exprime el jugo de lima.", "Agregue el resto de los ingredientes al recipiente y sazone con un poco de sal y mucha pimienta negra recién molida.", "Para la salsa de humus, coloque los garbanzos, la pasta de tahini y el ajo en un procesador de alimentos y mezcle hasta que quede suave. Agregue el jugo de limón, el aceite de oliva y dos cucharadas de agua.", "Mezcle de nuevo hasta que esté suave. Agregue el yogur y sazone generosamente con sal y pimienta.", "Sirva el pollo con los calientes panes pitta, salsa de aguacate y tomate y salsa de hummus."], "url": "www_bbc_co_uk_food_recipes_honey_mustard_chicken_09043", "title": "Pollo de mostaza y miel con salsa de aguacate y tomate y salsa de hummus", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla sin sal, más 1 cucharada de mantequilla derretida para cepillar", "2 cucharadas de miel", "2 huevos grandes de gallinas camperas", "Azúcar en polvo de 55 g / 2 oz", "2 cucharaditas de azúcar morena suave", "1 vaina de vainilla, solo semillas", "pizca de sal", "Harina blanca normal de 85g / 3oz, más extra para espolvorear", "½ cucharadita de polvo de hornear", "55 g / 2 oz de mantequilla", "2 peras, peladas y cortadas en dados pequeños", "2 cucharadas de miel", "150ml / 5fl oz de vino blanco dulce"], "method": ["En una cacerola de base pesada, derrita suavemente la mantequilla de 85g / 3oz y 2 cucharadas de miel, luego déjela a un lado.", "Pon los huevos en un tazón grande, luego agrega el azúcar impalpable, el azúcar moreno, las semillas de vainilla y la sal. Batir hasta que duplique su tamaño.", "Tamizar juntos la harina y el polvo de hornear. Con cuidado, dobla la harina en la mezcla de huevo con una cuchara grande de metal.", "Con cuidado, vierta la mantequilla derretida y la miel en un lado del tazón y dóblela cuidadosamente. Cubra con una película adhesiva y deje enfriar en la nevera durante 30 minutos.", "Mientras tanto, precalentar el horno a 220 ° C / 425 ° F / Gas 7. Cepillar 12 moldes de magdalenas con un poco de mantequilla derretida y luego espolvorearlos con harina.", "Coloque la mezcla en una manga pastelera con una boquilla plana de 1,5 cm / ½ pulgada. Pase una línea gruesa y sólida por el centro de cada molde, teniendo cuidado de no llenarlo en exceso.", "Hornee por 5-8 minutos, dependiendo del tamaño, hasta que estén doradas. Manténgalos vigilados mientras se cocinan rápidamente. Retire las magdalenas de los moldes inmediatamente y déjelas a un lado para que se enfríen en una rejilla.", "Mientras tanto, para las peras, derrita la mantequilla en una cacerola, agregue las peras y luego la miel y el vino. Cueza al vapor durante 5-10 minutos, o hasta que las peras estén recién cocidas, luego retírelas de la sartén con una espumadera y colóquelas a un lado.", "Aumente el calor y reduzca el licor de cocción en volumen hasta que se convierta en un almíbar. Regrese las peras a la sartén para cubrirlas con el jarabe. Sirve las peras con las magdalenas."], "url": "www_bbc_co_uk_food_recipes_honey_pears_and_91279", "title": "Miel, peras y magdalenas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12 magdalenas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de miel clara", "100g / 3½oz de feta", "2-3 ramitas de tomillo, hojas recogidas", "4 panqueques, para servir"], "method": ["Pon los panqueques en platos para servir y desmorona sobre el queso feta.", "Rocíe con miel y esparza las hojas de tomillo sobre la parte superior.", "Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_honey_feta_and_thyme_77232", "title": "Panqueques de miel, feta y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_feta_and_thyme_77232_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 remolachas cocidas grandes, descuartizadas", "2 buenos puñados de eneldo fresco, toscamente picados", "6 cucharadas de sal marina", "2 cucharadas de pimienta negra recién molida", "Azúcar en polvo 140g / 5oz", "1 cucharada de miel líquida", "1 cucharada de mostaza integral", "2 x 200 g / 7 oz de filetes de salmón", "Pan crujiente sueco, para servir", "ramitas de berro, para servir", "ramitas de eneldo frescas, para servir", "2 cucharadas de azúcar en polvo", "2 cucharadas de vinagre de sidra", "½ cucharadita de sal marina", "½ chalota pequeña, muy finamente rebanada", "½ pepino, en rodajas finas", "200g / 7oz de crema fresca", "buen puñado de eneldo fresco, finamente picado", "½ limón, solo jugo", "pimienta negra recién molida"], "method": ["Coloque la remolacha en un procesador de alimentos y mezcle hasta lograr un puré suave. Inclínala en un recipiente, luego agrega el eneldo, la sal marina, la pimienta, el azúcar, la miel y la mostaza y mezcla bien.", "Coloque una gran pieza de película adhesiva y espolvoree con un tercio de la mezcla de remolacha. Coloque una pieza de salmón, con la piel hacia abajo, sobre la mezcla. Cubra con la mitad de la mezcla restante, luego coloque el segundo filete de salmón encima, con la carne hacia abajo. Espolvorea con la mezcla restante. Envuelve el salmón con la película adhesiva.", "Coloque el paquete envuelto en un plato alto y péselo con un plato y algunas latas llenas de comida. Deje que el salmón se cure en el refrigerador durante cinco días, volteándolo a la mitad.", "El día antes de servir, prepare el pepinillo. Pon el azúcar y el vinagre en un tazón y revuelve hasta que el azúcar se haya disuelto. Mezcle la sal y la chalota, luego el pepino. Cubra con película adhesiva y enfríe en la nevera durante 2 horas, o durante la noche si tiene tiempo.", "Para el eneldo crème fraîche, ponga la crème fraîche, eneldo, jugo de limón y pimienta negra en un tazón y mezcle bien. Cubra con film transparente y deje enfriar en la nevera durante al menos 2 horas o durante la noche.", "Cuando esté listo para servir, desenvuelva el salmón y límpielo. Separe los lados y corte en rodajas finas con un cuchillo grande y afilado. Coloque el pan crujiente sueco en un plato para servir y cubra con las rodajas de salmón y las cucharadas de eneldo con crema de pepino y una pequeña cantidad de pepinillo encurtido. Adorne con berros y eneldo para servir."], "url": "www_bbc_co_uk_food_recipes_honey_mustard_beetroot_96264", "title": "Miel de remolacha mostaza gravad laxa", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo de 1.2kg / 2lb 10oz", "6 cucharadas de miel", "50 g / 1¾oz de jengibre fresco en raíz, picado", "1 cucharadita de cúrcuma", "1 cucharadita de canela molida", "3 cucharadas de salsa de soja ligera", "2 cucharadas de jugo de lima", "3 cucharadas de colza o aceite de oliva prensados ​​en frío", "sal y pimienta negra recién molida", "1-1.2kg / 2lb 4oz-2lb 10oz de patatas harinas, peladas y cortadas aproximadamente en trozos de 5cm / 2in", "100ml / 3½fl oz de aceite de colza o aceite vegetal", "2 cucharaditas de salvia seca", "1 cucharadita de chile en polvo", "1 cucharadita de caldo de caldo vegetal", "¼ cucharadita de ajo en polvo (opcional)"], "method": ["En una licuadora o mini procesadora de alimentos, mezcle todos los ingredientes del adobo para obtener una pasta fina. Pruebe y ajuste el condimento al gusto.", "Pat el pollo seco con papel de cocina. Póngalo en un plato y frote el adobo por todas partes y si el tiempo lo permite, déjelo reposar durante una hora más o menos en la nevera.", "Precalentar un horno a 180C / 350F / Gas 4.", "Pon el pollo en una lata para asar y hilvana con el adobo, reservando cualquier extra. Hornea el pollo por una hora. Cubra el pollo sin apretar con papel de aluminio después de los primeros 10-15 minutos o la miel en el adobo se quemará. Hilvane el pollo unas cuantas veces durante la cocción, agregando algo del adobo reservado si comienza a parecer seco.", "Para cocinar las papas, precaliente un horno a 220C / 425F / Gas 7. Coloque las papas preparadas en una sartén de agua con sal, deje que hierva, luego reduzca el fuego y cocine a fuego lento durante siete minutos. Mientras tanto, vierta el aceite en una lata grande para asar y ponga en el horno durante cinco minutos hasta que esté caliente.", "Escurra bien las papas, deje que hiervan, luego vuelva a la sartén en la que se cocinaron. Cubra la sartén y sacuda las papas - usted desea golpear sus bordes pero no romperlos. Gentilmente transfiéralos a la lata caliente para asar, revuélvelos en aceite caliente y espolvoréalos con sal. Asar en el estante superior durante 30 minutos, luego girarlos y tostar durante 20-30 minutos o hasta que estén crujientes y dorados.", "Después de que el pollo se haya asado durante una hora, verifique si está cocinado. (La carne se cocina cuando un pincho delgado o una aguja gruesa insertada en la articulación del muslo produce un líquido transparente.) Transfiera a un plato para servir, cubra el pollo con papel de aluminio y déjelo reposar durante cinco minutos antes de tallarlo.", "Mientras tanto, cuele el líquido de la lata de tostado en una sartén pequeña, ajuste el condimento al gusto y manténgalo caliente.", "Mezcle el salvia, el chile en polvo, el polvo de caldo y el ajo en polvo, si los usa, para hacer una mezcla de especias. Retire las papas del horno, colóquelas en un plato forrado con papel de cocina y espolvoree sobre la mezcla de especias.", "Junte y sirva el pollo asado junto con las papas asadas, rociadas con los jugos de la bandeja de asar."], "url": "www_bbc_co_uk_food_recipes_honey_roast_chicken_with_00451", "title": "Pollo asado con excelentes roasties", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1 libra 2 pastillas de chirivía, peladas y cortadas en cuartos a lo largo", "4 cucharadas de jerez", "4 cucharadas de miel clara", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque las chirivías, el jerez y la miel en una bandeja para hornear y mezcle para cubrir las chirivías. Sazonar con sal y pimienta negra recién molida.", "Asar en el horno durante 20 minutos, volteando hasta la mitad, hasta que la pastinaca esté tierna y dorada."], "url": "www_bbc_co_uk_food_recipes_honey_roast_parsnips_80898", "title": "Chirivías asadas con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve de 6 a 8 como parte de una cena de asado, o de 4 como acompañamiento independiente", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_roast_parsnips_80898_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 cucharadas de miel espesa", "3 cucharadas de salsa de ostras", "¼ cucharadita de copos de chile", "4 anís estrellado", "¼ cucharadita de sal", "¼ cucharadita de pimienta negra", "4 dientes de ajo", "1.5kg / 3lb 5oz costillas de cerdo con carne"], "method": ["Para hacer el adobo, vierta la salsa de miel y de ostra en una fuente para hornear o lata para asar. Agregue los copos de chile, el anís estrellado y la sal. Moler los granos de pimienta y agregarlos al adobo.", "Mezcle las costillas en el adobo y coloque los dientes de ajo enteros entre las costillas, luego déjelos a un lado durante al menos 2 horas. No estaría mal si se quedan allí toda la noche.", "Ase las costillas a 160 ° C / 325 ° F / Gas 3 durante 90 minutos, volteándolas en su salsa de vez en cuando.", "Luego, suba el fuego a 200ºC durante 15 minutos, vigílelos, ya que a veces se queman fácilmente. Están listos cuando la carne está tierna, aunque lejos de caerse del hueso, y las costillas están pegajosas y casi carbonizadas."], "url": "www_bbc_co_uk_food_recipes_honey_roast_ribs_with_64823", "title": "Miel de costillas asadas con anís", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honey_roast_ribs_with_64823_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Canales de pato de 1kg / 2lb 4oz, cortados en trozos pequeños", "5g polvo chino de cinco especias", "1 cebolla grande, cortada en anillas gruesas", "½ bulbo de ajo", "15g / ½ oz de hojas frescas de tomillo", "700ml / 1¼ pinta de caldo de pollo", "100 g / 3½ oz de miel clara", "50ml / 1¾fl oz de vinagre de jerez", "300ml / 10½fl oz de caldo de ternera", "5g de granos de pimienta blanca", "50ml / 1¾fl oz crema", "2g de sal", "4 pechugas de pato de 180g / 6oz, refrigeradas en el refrigerador", "sal y pimienta", "aceite vegetal, para freír", "12 dientes de ajo, pelados y dejados enteros", "2 cucharadas de miel clara mezclada con una pizca de polvo chino de cinco especias", "1 cucharada de mantequilla", "½ apionabo, pelado, finamente picado y blanqueado", "Repollo savoy de 350g / 12oz, rebanado", "4g de chalotes finamente picados", "40 g / 1½ oz de mantequilla sin sal", "40 g / 1½ oz de tocino ahumado, picado", "20g / ¾oz de puré de ajo", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "80g / 3¾oz de hongos girolle"], "method": ["Precalentar el horno a 200C / 400F / Gas 4.", "Para la salsa de pato, coloque las carcasas de pato en una bandeja de asar y cocine en el horno durante 20-30 minutos. Justo antes de que terminen de asar, espolvorea los huesos con las cinco especias chinas.", "Retire las carcasas del horno y coloque a fuego lento sobre la placa. Agregue las cebollas y el ajo. Cocine hasta que las cebollas sean translúcidas y empiecen a colorear. Agrega el tomillo.", "Retire los huesos y déjelos a un lado para que se enfríen. Desglasar la lata de asar con el caldo de pollo. Dejar de lado", "En una sartén, hierva la miel hasta que hierva y cocine durante tres minutos (tenga cuidado de no quemar la miel ya que la hará amarga). Agregue el vinagre y cocine hasta que el volumen del líquido se haya reducido en un tercio.", "Agregue las canales de pato enfriadas y el caldo de pollo a la sartén, junto con el caldo de ternera, los granos de pimienta y la crema. Llevar a ebullición y quitar la espuma de la superficie. Reduzca el fuego a fuego lento y cocine por 30 minutos.", "Cuele la salsa a través de un colador y luego pase a través de un colador fino para eliminar cualquier fragmento de hueso. Regrese a la sartén, lleve a ebullición y cocine hasta que se reduzca a una consistencia de salsa. Sazonar con sal.", "Para las mamas de pato, con un cuchillo afilado, puntúe la piel grasa de la pechuga de pato en un patrón entrecruzado, pero tenga cuidado de no cortar la carne. Condimentar con sal y pimienta.", "Caliente un poco de aceite en una sartén de fondo grueso y agregue los pechugas de pato con la piel hacia abajo. Cocine a una temperatura bastante alta para que la piel elimine la grasa, pero tenga cuidado de no quemar la piel.", "Cuando la piel esté dorada y crujiente, voltee la pechuga y cocine el otro lado por un minuto antes de volver a ponerlo en el lado de la piel. Crujiente la piel un poco más antes de volver a poner el pecho en su otro lado y terminar de cocinar a su gusto.", "Mientras tanto, ponga los dientes de ajo en una olla con agua fría y deje que hierva, revierta en agua fría y repita dos veces más.", "Una vez que el pato esté cocido, quítelo de la sartén y cepille la miel y cinco especias sobre la piel crujiente. Reserve en un lugar cálido para descansar antes de servir.", "Coloque los dientes de ajo en una sartén de fondo grueso con un poco de mantequilla y sazone con sal y pimienta. Cocine lentamente hasta que esté suave y ligeramente dorado, luego agregue el apio nabo blanqueado en la sartén para calentarlo.", "Para el repollo savoy, agregue el repollo a una olla con agua salada hirviendo y cocine hasta que esté tierno (alrededor de 3-4 minutos). Refresque en agua helada. Escurra bien y seque.", "En una sartén, fríe los chalotes finamente picados en la mantequilla hasta que estén transparentes, luego agrega el tocino ahumado. Agregue la col cocinada y cocine hasta que se seque y el tocino esté crujiente. Agregue el puré de ajo y sazone, al gusto, con sal y pimienta.", "Para servir, caliente la pequeña sartén con mantequilla y, una vez caliente, agregue los champiñones y fríelos suavemente por un minuto.", "Si es necesario, vuelva a calentar el pato en un horno bajo durante unos minutos, y luego corte en rodajas finas. Coloque la col en el medio de los platos de servir y coloque el pato encima. Agregue el apio y el ajo alrededor del pato y luego vierta sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_honey_roast_duck_with_20554", "title": "Pato asado de miel con repollo, tocino ahumado, ajo asado, champiñones girolle y jus con especias", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½oz de sal marina", "2 cucharaditas de hojas de tomillo finamente picadas", "2 dientes de ajo, finamente picados", "4 patas de pato", "600ml / 20fl oz de grasa de pato", "2 hojas de laurel", "2 cucharadas de aceite de oliva", "4 cucharadas de miel", "4 cucharadas de hojas de apio, para adornar", "2 cucharadas de aceite de colza", "100g / 3½oz de panceta, picada", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "1 zanahoria pequeña, finamente picada", "1 apio en barra, finamente picado", "¼ de puerro, finamente picado", "300g / 10½oz de lentejas Puy", "175ml / 6fl oz de vino tinto", "450 ml / 16 fl oz oz ternera jus o stock", "2 cucharadas de vinagre de Jerez de buena calidad", "2 cucharadas de perejil fresco picado", "1kg / 2lb 4oz de patatas harinas, peladas y cortadas en trozos", "125 g / 4½ oz de mantequilla", "125ml / 4fl oz de crema doble"], "method": ["Precaliente el horno a 140C / 120C Fan / Gas 1.", "Mezcle la sal, el tomillo y el ajo en un tazón grande. Cubra las patas de pato con la mezcla y coloque en una bandeja con la mezcla restante en la parte superior y debajo. Refrigere por 24 horas. Enjuague las patas de pato con agua corriente fría para lavar la mezcla de sal.", "Coloque el pato en una cazuela a prueba de llamas con una tapa y agregue la grasa de pato y las hojas de laurel. Traiga a fuego lento, luego ponga la tapa y cocine en el horno durante 2 horas y media. Retire el pato de la grasa y reserve. Descarta la grasa", "Para las lentejas Puy, caliente el aceite en una sartén o en una sartén grande. Una vez caliente, agregue la panceta y la chalota y cocine durante 2 minutos. Agregue el ajo, la zanahoria, el apio y el puerro y cocine por otros 2 minutos.", "Agregue las lentejas y el vino tinto y deje que hierva. Cocine hasta que el volumen de líquido se haya reducido a la mitad. Agregue el caldo y cocine por 25-30 minutos. Cuando las lentejas estén blandas, agregue el vinagre de jerez y el perejil.", "Coloque las papas en una sartén grande con agua con sal y deje que hiervan. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Escurra y devuelva las papas a la sartén. Coloque sobre el fuego durante un minuto para eliminar el exceso de humedad. Pase a través de un ricer de patata o machaque bien hasta que esté suave. Agregue la mantequilla y la crema, batiendo hasta que quede suave.", "Para terminar el confit de pato, caliente el aceite de oliva en una sartén. Una vez caliente, agrega la miel y las patas de pato. Cocine el pato durante 2 minutos en cada lado, rociándolo todo el tiempo.", "Divida las lentejas y el puré de papas entre los platos para servir. Sirva las patas de pato encima de las lentejas de Puy y adorne con hojas de apio."], "url": "www_bbc_co_uk_food_recipes_honey_roasted_duck_49176", "title": "Confit de pato asado a la miel con lentejas Puy, puré de papas y hojas de apio", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "100g / 3½oz de fruta seca mixta", "70ml / 2¾fl oz de té descafeinado, enfriado hasta tibio", "1 cucharadita colmada de miel", "1 huevo de gallinas camperas, golpeado", "Harina normal 150g / 5oz", "1 cucharadita de polvo de hornear", "½ cucharadita de especias mezcladas"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase una lata de pan con aceite vegetal.", "Coloque la fruta seca en un tazón grande y vierta sobre el té caliente. Revuelva en la miel", "Batir el huevo y batirlo en la mezcla de té con un tenedor. (Asegúrese de que el té no esté demasiado caliente para que el huevo no cuaje).", "En otro recipiente, mezcle la harina, el polvo de hornear y la mezcla de especias.", "Agregue los ingredientes secos a los ingredientes húmedos y bata hasta que la mezcla esté espesa, pegajosa y bien combinada.", "Vierta la mezcla de la torta en la lata de pan preparada y coloque la lata en una bandeja para hornear. Hornee el pan del té en el horno durante 20-25 minutos, o hasta que un pincho insertado en el centro salga limpio.", "Coloque la barra de té a un lado para enfriar en la lata, luego corte en rodajas gruesas."], "url": "www_bbc_co_uk_food_recipes_honey_tea_loaf_48060", "title": "Pan de té de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / ¼ de pinta de vino tinto", "2 cucharadas de vinagre balsámico", "1 cucharada de aceite de oliva", "85 g / 3 oz bistec, en rodajas finas", "100 g / 3½ oz de judías verdes, recortadas", "½ zanahoria, pelada y cortada en cerillas", "2 cucharaditas de salsa de soja", "1 cucharada de miel clara", "1 cucharadita de vinagre balsámico", "1 cucharadita de semillas de sésamo"], "method": ["Para la salsa, caliente el vino y el vinagre en una cacerola pequeña y cocine a fuego lento hasta que el volumen se haya reducido a la mitad y la mezcla se haya vuelto pegajosa. Reservar para mantener el calor", "Para sofreír, caliente el aceite de oliva en un wok y fría el bistec durante 2-3 minutos, o hasta que se dore.", "Agregue las judías verdes y la zanahoria al wok y saltee durante dos minutos.", "Agregue la salsa de soja, la miel y el vinagre balsámico al wok y saltee durante otros 1-2 minutos, o hasta que los vegetales estén tiernos.", "Agregue las semillas de sésamo.", "Para servir, amontone los sofritos en un plato para servir y rocíe sobre el vino tinto y la salsa de vinagre balsámico."], "url": "www_bbc_co_uk_food_recipes_honeyandbalsamicglaz_87023", "title": "Miel y bistec balsámico salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 costillar de cerdo de 3 costillas", "Agua para cubrir", "1 ramita de romero fresco", "1 ramita de tomillo fresco", "1 diente de ajo, sin pelar", "1 cucharadita de aceite de sésamo", "2 cucharadas de miel", "Jengibre de raíz de 2.5cm / 1in, pelado y rallado", "2 cucharadas de salsa de soja", "1 naranja, solo jugo", "1 chile rojo, picado", "2 cucharadas de semillas de sésamo, para rociar", "300ml / ½ pinta de aceite vegetal, para freír", "pequeño puñado de hielo", "150g / 5½ oz de harina de auto crianza", "85ml / 3fl oz de agua con gas", "2 bombillas pequeñas pak choi", "½ mango, pelado, removido de piedra, finamente picado", "2 cucharadas de cilantro fresco picado, más extra, para adornar", "1 cucharada de vinagre balsámico", "2 cucharadas de aceite de oliva", "1 cucharadita de semillas de sésamo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las costillas, coloque las costillas en una olla pequeña y cubra con agua hirviendo. Agregue el romero, el tomillo y el diente de ajo sin pelar y deje que hierva. Hierva por diez minutos, luego drene y deseche el agua y las hierbas.", "Para el glaseado, coloque el aceite de sésamo, miel, jengibre, salsa de soja, jugo de naranja y chile en una sartén pequeña y cocine a fuego lento durante cinco minutos, o hasta que esté reducido y pegajoso.", "Coloque las costillas blanqueadas en una bandeja para hornear y cepille con el esmalte.", "Transfiera al horno y hornee por 10-12 minutos, o hasta que el cerdo esté completamente cocido.", "Coloque las costillas en un plato para servir, vierta sobre el glaseado restante y espolvoree con las semillas de sésamo.", "Mientras tanto, para el pak choi tempura, coloca el aceite vegetal en una olla profunda de fondo grueso y calienta hasta que un pequeño cubo de pan chisporrotea y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque el hielo y la harina en un tazón grande y bata gradualmente en el agua con gas para hacer una masa con la consistencia de crema doble.", "Sumerja el pak choi en la mezcla para cubrir, sacudiendo cualquier exceso, luego coloque cuidadosamente en el aceite caliente. Freír a fuego lento durante 4-5 minutos, o hasta que estén crujientes y doradas. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la salsa de mango, coloque todos los ingredientes de salsa de mango en un tazón pequeño y revuelva para combinar.", "Para servir, coloque el pak choi tempura en el plato con las costillas. Espolvorea sobre el cilantro y sirve la salsa de mango en un tazón al lado."], "url": "www_bbc_co_uk_food_recipes_honeyandgingerglazed_86053", "title": "Miel y jengibre, costillas glaseadas con pak choi tempura y salsa de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ paquete de tofu firme, secado y cortado en tres rebanadas de 1cm / ½ en rebanadas", "1 lima, ralladura y jugo", "2 cucharaditas de miel", "1 diente de ajo, en rodajas", "aceite de oliva, a llovizna", "1 maní puñado", "pan tostado, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque el tofu en un plato resistente al horno y luego rocíe sobre los demás ingredientes.", "Coloque en el horno para hornear durante cinco minutos, o hasta que estén cocidos.", "Sirve con pan tostado."], "url": "www_bbc_co_uk_food_recipes_honeyandlimetofu_80570", "title": "Tofu de miel y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6kg / 13lb 3½ oz conjunta gammon", "jugo de naranja fresco, para cubrir", "Agua para cubrir", "8 dientes, más extra para tachonar el gammon", "2 cebollas, peladas, cortadas a la mitad", "4 hojas de laurel grandes", "120g / 4oz de azúcar morena suave", "3 naranjas, cáscara de tres, jugo de dos", "3 cucharadas de miel clara", "3 mermelada de naranja tbsp colmada", "3 cucharadas de mostaza integral", "compota de manzana", "repollo rojo encurtido"], "method": ["Para el gammon, coloca el jamón en una sartén grande y profunda y cúbrelo con agua. Llevar a ebullición, luego retirar del fuego y escurrir.", "Regrese el jamón a la sartén, luego vierta suficiente jugo de naranja para cubrir la mitad del gammon. Vierta suficiente agua fría para cubrir el gammon por completo.", "Empuja dos clavos de olor en cada mitad de cebolla y agrega a la sartén junto con las hojas de laurel. Cubra con una tapa y deje que hierva, luego reduzca el fuego a fuego lento. Cocine suavemente durante tres horas, agregando más agua caliente a la sartén según sea necesario.", "Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Retire el jamón de la sartén y coloque en una lata de asar. Retire la piel, dejando una fina capa de grasa. Puntuación del gammon en un patrón de diamantes con la punta de un cuchillo afilado. Stud el centro de cada diamante con un clavo de olor.", "Para el glaseado, mezcle todos los ingredientes del glaseado en un recipiente hasta que estén bien combinados. Cuchara el glaseado uniformemente sobre el gammon.", "Asar el jamón en el horno durante 45 minutos, rociando frecuentemente con los jugos de glaseado y sartén, hasta que el jamón esté cocido y dorado por todas partes.", "Reserve para descansar, luego talle en rodajas gruesas para servir. Alternativamente, el jamón se puede comer frío. Sirva con compota de manzana y col roja en escabeche."], "url": "www_bbc_co_uk_food_recipes_honeyandmarmaladegla_93186", "title": "Gammonía glaseada con miel y mermelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve al menos 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/honeyandmarmaladegla_93186_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mostaza francesa", "1 cucharada de miel", "1 diente de ajo, pelado y aplastado", "1 cucharadita de vinagre balsámico", "2 cucharadas de vinagre de sidra", "6 cucharadas de aceite de girasol", "sal y pimienta para probar"], "method": ["Ponga la mostaza, la miel, el ajo, el vinagre balsámico y el vinagre de sidra en un procesador de alimentos y láncese juntos.", "Con el motor todavía en funcionamiento, vierta el aceite a través de un embudo.", "Sazone con sal y pimienta y servir."], "url": "www_bbc_co_uk_food_recipes_honeyandmustarddress_1317", "title": "Aderezo de miel y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo grande, pelada y cortada en tiras", "2 cucharadas de miel clara", "2 cucharaditas de mostaza de grano", "140g / 5oz de queso de cabra", "110g / 4oz de piñones tostados", "montón de cohetes", "vinagre balsámico", "aceite de oliva", "sal y pimienta recién molida"], "method": ["Mezcle la miel y la mostaza en un bol, agregue las tiras de pollo sin piel y cortadas, y asegúrese de que el pollo esté bien cubierto.", "Coloque las tiras de pollo en una sartén caliente a la parrilla y cocine durante 3-4 minutos a cada lado.", "Mezcle una parte de vinagre balsámico, con 2 partes de aceite de oliva y un poco de sal y pimienta, y cubra las hojas del cohete con el aderezo.", "Coloque el cohete en el centro del plato.", "Apila las tiras de pollo en la parte superior de las hojas de ensalada, desmenuce el queso de cabra por encima y espolvorea con piñones tostados.", "Rocíe un poco de miel alrededor de la ensalada y sirva."], "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_67765", "title": "Ensalada de pollo con miel y mostaza glaseada con piñones y queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 patata, cortada en cuñas", "½ cucharadita de pimienta de cayena", "½ cucharadita de copos de chile", "1 cucharada de aceite de oliva", "1 pechuga de pollo, sin piel", "1 cucharadita de vinagre balsámico", "1 cucharadita de mostaza integral", "1 cucharadita de miel", "ramita de perejil fresco, para adornar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las cuñas de papa, caliente el aceite en una sartén a prueba de horno, agregue las rodajas de papa y espolvoree sobre las especias. Freír las cuñas, revolviendo con frecuencia, hasta que estén ligeramente doradas por todos lados.", "Transfiera al horno y hornee durante 15 minutos, o hasta que estén dorados y tiernos.", "Mientras tanto, para el pollo, caliente el aceite en otra sartén a prueba de horno y fría el pollo durante 2-3 minutos en cada lado. Agregue el vinagre balsámico, la mostaza y la miel y revuelva para cubrir el pollo.", "Transfiera al horno y hornee durante 8-10 minutos, o hasta que el pollo esté completamente cocido.", "Para servir, coloque el pollo en un plato para servir con los trozos de papa y adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_honeyandmustardglaze_86102", "title": "Miel y pollo glaseado con mostaza y cuñas de papa picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]