[{"isVegetarian": false, "title": "Pandhi curry (Coorg-style pork stir fry) with apple and fennel raita", "url": "www_bbc_co_uk_food_recipes_pandhicurrycoorgpork_91467", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1½lb pork shoulder or pork belly, cut into 2.5cm/1in cubes", "2 tbsp ginger and garlic paste (made from 1cm/½in garlic, 1cm/½in ginger and ½-1 tsp vegetable oil, blended to a paste) ", "1 tsp ground turmeric", "2 tsp salt", "8-10 whole black peppercorns", "3 bay leaves", "2 star anise", "4 tbsp clear honey", "3 tbsp soy sauce", "10 kokum (cocum) pods, soaked in 110ml/4floz hot water to soften (available from some Asian grocers)", "1 Granny Smith apple, or similar sharp green eating apple, core removed, flesh finely chopped", "2 heads baby fennel, finely chopped", "1 tsp fennel seeds, lightly toasted in a dry pan", "200g/7oz Greek-style yoghurt", "½ tsp salt", "1 tsp caster sugar", "2 tbsp vegetable oil", "4 dried red chillies", "10 curry leaves (available from some Asian grocers)", "2 fresh green chillies, split", "2 medium red onions, sliced", "salt and freshly ground black pepper ", "½ lime, juice only", "small bunch coriander cress, or other micro-leaves, to serve"], "serves": "4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the pork, place the cubes of pork into a large dish. Add the remaining pork ingredients, cover, then marinate overnight in the fridge.", "When the pork cubes have marinated, transfer them and the marinade to a large, heavy-based pan. Add just enough water to cover the pork cubes and cook, covered, over a very low heat for 1-1½ hours, or until the meat is falling apart. ", "Meanwhile, for the apple and fennel raita, mix together all of the apple and fennel raita ingredients in a bowl until well combined. Chill in the fridge until needed. ", "Drain the cooked pork and set aside (reserve the cooking liquid).", "For the stir fry, heat the oil in a wok over a high heat. When the oil is smoking, add the dried red chillies and stir fry until they have darkened and are fragrant. ", "Add the curry leaves and stir fry for 30 seconds, or until crisp and fragrant. ", "Add the split green chillies and red onion slices and stir fry for 2-3 minutes until softened.", "Add the cooked pork cubes and fry, stirring continuously, for 3-4 minutes, or until golden-brown. (If the meat looks dry, add 1-2 tablespoons of the reserved cooking liquid and continue to cook until it has evaporated - this will glaze the pork cubes.) Season, to taste, with salt and freshly ground black pepper, then squeeze in the lime juice and stir to combine. ", "To serve, spoon some curry into the centre of each of four serving plates. Spoon a portion of apple and fennel raita alongside each serving. Sprinkle over the coriander cress leaves."]}, {"isVegetarian": false, "title": "Pancetta wrapped hake with new potatoes and beurre blanc", "url": "www_bbc_co_uk_food_recipes_pancettawrappedhakew_76449", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 hake fillet", "4 slices pancetta", "30g/1oz unsalted butter, plus more if necessary", "1 garlic clove, peeled and crushed", "4 spring onions, finely chopped", "splash white wine", "1 tsp fresh chives, chopped", "salt and freshly ground black pepper", "150g/5¼oz new potatoes, cooked"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the fish, heat the oil in a non-stick frying pan. Wrap the hake in the pancetta slices and then pan fry for 2-3 minutes on each side, or until the pancetta is golden brown.", "For the potatoes, gently melt the butter in a pan and sauté the garlic and spring onion for two minutes, to soften. Stir in the wine, chives and salt and freshly ground black pepper.  Over a gentle heat whisk in a little more butter to make a sauce.", "Add the new potatoes to the pan to warm through.", "To serve, transfer the buttery potatoes to a serving plate and serve the wrapped fish alongside."]}, {"isVegetarian": true, "title": "Pandoro", "url": "www_bbc_co_uk_food_recipes_pandoro_93030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "5g salt", "125g/4½oz caster sugar", "10g fast-action yeast", "1 orange, finely grated zest only", "1 lemon, finely grated zest only", "150g/5½oz softened butter, plus extra for greasing", "2 medium free-range eggs (preferably Burford Brown or other dark yolked varieties)", "2 free-range egg yolks (preferably Burford Brown or other dark yolked varieties)", "2 tsp vanilla paste", "100ml/3½fl oz milk, warmed", "icing sugar, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Place the flour in the bowl of a freestanding mixer fitted with a dough hook. Add the salt and caster sugar to one side of the bowl and the yeast to the other side. Add the orange and lemon zest, softened butter, eggs, egg yolks, vanilla and milk. Start on a slow speed and mix together to form a wet sticky dough.", "Increase the speed on the mixer and mix for 10 minutes. The dough should now be a thicker consistency and adhere to the dough hook. If the dough is dropping from the dough hook mix for a further 5 minutes, or until the correct consistency is achieved.", "Lightly dust a work surface with flour, tip out the dough and gently knead to form a ball. Place the dough in a lightly greased bowl, cover and leave to prove until doubled in size. This can take 4 hours, but for best results leave overnight.", "Grease a 500g/1lb 2oz pandoro mould with butter. Tip the risen dough out onto a lightly floured work surface and fold in on its self a few times to knock out the air. Shape into a ball and place in the prepared tin, gently pressing into the corners of the tin. Cover and leave to rise until it comes to the top of the tin, this will take 1½-2 hours.", "Preheat the oven to 190C/170C Fan/Gas 5. Uncover the pandora and bake for 35–40 minutes. To test to see the pandoro is cooked through insert a skewer into the middle, if it comes out clean it is cooked. Leave to cool in the tin for 5 minutes then turn out and cool on a wire rack", "Before serving, trim the base so it will sit flat on a serving plate. Slice into thick horizontal slices and rotate the slices. Dust heavily with icing sugar and serve. "]}, {"isVegetarian": true, "title": "Paneer", "url": "www_bbc_co_uk_food_recipes_paneer_86451", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 litres/3½ pints whole milk ", "200-250ml/7-8¾fl oz fresh 'live' yoghurt, or 2 tbsp lemon juice"], "serves": "Makes 250g", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the milk to the boil in a heavy-based saucepan. ", "Once the milk starts to boil and rise up, stir in the yoghurt or lemon juice. Keeping the milk on the heat, stir gently to help the milk curdle; it should only take about a minute. If it does not separate, add the rest of the yoghurt and keep stirring. The curds will coagulate and separate from the watery whey.", "Remove from the heat.", "Line a large sieve with muslin or cheesecloth and place over a large bowl or saucepan. Strain the cheese into the sieve and run some cold water through it. Discard the whey or use for another purpose.", "Wrap the cheese in the cloth and hang from the kitchen tap over the sink to allow the excess water to drain for 20 minutes. Then, keeping it fairly tight, put the paneer onto a clean work surface. Place a heavy weight on top for 30-40 minutes, or until it is flattened into a firm block. (You can refill the same saucepan with water and place it on top as a weight). Then cut into cubes or crumble, depending on how you want to use it.", "Store any unused pieces in the refrigerator in water and cover. You can also freeze the paneer in an airtight container. Defrost thoroughly before use. It is delicious when served with a sprinkling of sea salt, freshly ground pepper and a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Pancetta with monkfish and garlic oil and sweet potato mash", "url": "www_bbc_co_uk_food_recipes_pancettawithmonkfish_76068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz piece monkfish", "2 tbsp fresh rosemary, chopped ", "salt and freshly ground black pepper", "2 pieces pancetta", "2 tbsp olive oil", "½ chilli, chopped", "2 garlic cloves, kept whole", "½ onion, peeled and cut into wedges", "1 sweet potato, peeled and diced", "30g/1oz unsalted butter", "2 cloves garlic, peeled and roasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and cook the potato for 10-12 minutes, until tender.", "For the monkfish, heat the oil in a pan.  ", "Sprinkle the rosemary and salt and freshly ground black pepper on the monkfish and wrap in the pancetta. ", "Sear the wrapped pancetta in the pan for 4-5 minutes, or until cooked through.", "To make the garlic oil, heat the olive oil in a pan and add the chilli, garlic and onion wedges. Heat for 8-10 minutes.", "Drain the potatoes and transfer to a blender with the butter, seasoning and garlic. Blend until smooth.", "To serve, spoon the mash onto a serving plate and top with the wrapped monkfish. Serve the garlic chilli oil alongside."]}, {"isVegetarian": true, "title": "Paneer and vegetable skewers", "url": "www_bbc_co_uk_food_recipes_paneerandvegetablesk_86440", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerandvegetablesk_86440_16x9.jpg", "ingredients": ["125ml/4½fl oz Greek-style yoghurt", "small knob fresh ginger, peeled and roughly chopped", "2-3 garlic cloves, peeled and finely chopped", "salt, to taste", "½ tsp chilli powder, or to taste", "1 tsp garam masala", "2 tbsp lemon juice, or to taste", "2 tbsp vegetable oil", "1 tbsp gram flour (chickpea flour)", "1 tsp cumin powder", "seeds of 6 green cardamom, ground", "300g/10½oz paneer, cut into 2.5cm/1in cubes ", "1 large onion, cut into 2.5cm/1in cubes", "1 green and 1 red capsicum pepper, cored and cut into 2.5cm/1in cubes", "oil, for greasing", "6 wooden skewers, soaked for an hour", "2 tbsp butter, melted, for drizzling", "chaat masala (a dried spice mixture available from Asian grocers), to sprinkle"], "serves": "Makes 6 skewers", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the marinade, mix together all the marinade ingredients in a bowl and add the paneer, onion and peppers. Cover with cling film and allow the paneer and vegetables to marinate for 30-40 minutes, or longer, in the fridge.", "Preheat the oven to 200C/400F/Gas 6 and oil a baking sheet. ", "Thread the vegetables and paneer alternately onto the skewers. Bake in the oven for seven minutes, drizzle over the melted butter, turn and cook for another 5-7 minutes or until charred at the edges.", "Sprinkle with chaat masala and serve. They are also great served with a green chutney."]}, {"isVegetarian": true, "title": "Paneer and potato curry", "url": "www_bbc_co_uk_food_recipes_paneer_and_potato_curry_63584", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil ", "220g/8oz paneer, cubed ", "2 onions, finely sliced ", "salt and black pepper ", "2 garlic cloves, crushed ", "½-1 tsp chilli flakes ", "1 tbsp mild curry powder  ", "250g/9oz floury potatoes, peeled and cut into small cubes ", "200g/7oz tinned tomatoes ", "500ml/18fl oz vegetable stock (made from stock cube) ", "200g/7oz rice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a saucepan or large (lidded) frying pan over a medium heat. Add the oil and once hot fry the paneer for two minutes on each side, or until the cubes are coloured. Remove from the pan and set aside. ", "Now add the onions with a pinch of salt and gently fry until golden-brown. Once golden, add the garlic, chilli flakes, curry powder and two tablespoons of water. Gently fry for a further two minutes over a low heat. Stir in the potato.", "Pour in the tomatoes and the stock, bring to a simmer, cover with a lid and simmer gently for 15 minutes, or until the potatoes are completely soft and the sauce has thickened. ", "Meanwhile, cook the rice according to packet instructions.", "Add the paneer to the curry and stir through, making sure it is well coated in sauce. Heat through for 3-4 minutes then serve with the rice."]}, {"isVegetarian": true, "title": "Paneer, mushroom and spinach wrap", "url": "www_bbc_co_uk_food_recipes_paneermushroomandspi_86563", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz baby spinach leaves, washed ", "45g/1¾oz fresh coriander, leaves and stalks", "6 large garlic cloves, peeled  ", "5cm/2in piece fresh ginger, peeled and roughly chopped", "6 tbsp roasted and salted peanuts", "2-3 tbsp lemon juice, or to taste", "1 tbsp vegetable oil", "salt and freshly ground black pepper ", "1-3 green chillies, seeds removed, roughly chopped (optional)", "75ml/2½fl oz Greek-style yoghurt", "1 tsp each garam masala, ground cumin, ground fennel seeds and green cardamom powder", "2 tsp crushed garlic", "1 rounded tsp grated ginger", "2 tsp gram flour", "salt, to taste", "2 tsp lemon juice", "¼-½ tsp red chilli powder, or to taste", "2 tsp vegetable oil", "2 tbsp water", "200g/7oz Portobello mushrooms, cleaned, boiled for 15 minutes, cooled and thickly sliced", "2 tbsp vegetable oil", "100ml/3½fl oz water", "300-350g/10-12oz paneer, cut into 2.5cm/1in cubes", "½ small onion, thinly sliced", "5 ready-made flour tortillas, wrapped in foil and placed in the oven for the last five minutes of cooking", "You'll need 5-6 wooden skewers, soaked in water for half an hour"], "serves": "Serves 5", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the spinach paste, place all the spinach paste ingredients into a blender and blend until smooth.", "For the tandoori mushrooms, place all the ingredients except the mushrooms into a blender and blend to a smooth paste. Add the mushrooms to the paste and leave to marinate for 20 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "For the paneer, heat the oil in a large non-stick pan. Add the spinach paste and the water and cook over a medium heat for 8-10 minutes, or until the paste starts to thicken. Add the paneer and the onion and cook for another minute, or until the onion just starts to soften.", "Meanwhile, thread the marinated mushrooms onto skewers, place onto an oiled baking sheet and transfer to the oven. Bake for 20 minutes, turning halfway through the cooking time. Once cooked, add the mushrooms to the paneer mixture.", "To serve, divide the filling into five portions and place each portion onto a warmed tortilla. Roll up and cut on the diagonal."]}, {"isVegetarian": true, "title": "Paneer-stuffed peppers", "url": "www_bbc_co_uk_food_recipes_paneerstuffedpeppers_90032", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerstuffedpeppers_90032_16x9.jpg", "ingredients": ["4 large red or green peppers, stalks removed, flesh cut in half, seeds scooped out ", "4 tbsp vegetable oil", "1¼ tsp cumin seeds", "1 onion, chopped ", "3 large tomatoes, chopped ", "2 tsp finely chopped ginger", "2 handfuls frozen peas", "70g/2½oz green beans, chopped ", "salt, to taste", "½ tsp ground turmeric", "½ tsp red chilli powder", "2 tsp ground coriander", "1½ tsp garam masala ", "250g/9oz fresh paneer, crumbled", "100ml/3½fl oz water ", "5 tbsp double cream", "handful fresh chopped coriander", "200g/7oz basmati rice, cooked according to packet instructions, to serve"], "serves": "Serves 4-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Place the pepper halves onto a baking tray, drizzle with one tablespoon of the oil and bake in the oven for 20-25 minutes, or until softened. Once the peppers are cooked, remove them from the oven and set aside. ", "Meanwhile, heat the remaining oil in a non-stick pan. Add the cumin seeds and fry for 20-30 seconds, or until fragrant. ", "Add the chopped onion and cook for 3-4 minutes, or until golden-brown. ", "Add the tomatoes, ginger, peas, beans, salt and spices and simmer for 10-12 minutes, or until the tomatoes have softened and reduced to a pulp.", "Add the crumbled paneer and the water and stir until well combined. Bring the mixture to a simmer and simmer for 2-3 minutes. ", "Add the double cream and season well with freshly ground black pepper. Simmer until heated through. ", "Add the chopped coriander and continue to simmer the mixture for 4-5 minutes, adding tablespoons of water as necessary to stop the sauce from drying out as the paneer absorbs the liquid.", "Preheat the grill to its highest setting. While the grill is heating up, fill each of the baked pepper halves with the paneer mixture. When the grill is hot, grill the stuffed peppers until the paneer mixture is golden-brown. ", "To serve, place one or two stuffed pepper halves onto each serving plate. Spoon a portion of basmati rice alongside each."]}, {"isVegetarian": false, "title": "Paneer with spinach", "url": "www_bbc_co_uk_food_recipes_paneerwithspinach_86756", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paneerwithspinach_86756_16x9.jpg", "ingredients": ["750g/1½lb baby spinach, washed", "3 tbsp vegetable oil", "1 tsp cumin seeds", "1 large onion, chopped", "thumb-sized piece of fresh ginger, peeled and sliced into long julienne", "1½ tbsp chopped garlic", "1-2 green chillies, whole ", "2 tsp ground coriander", "salt, to taste", "250g/8¾oz ready-made paneer (available from some supermarkets and Asian grocers), cut into cubes", "½-1 tsp garam masala", "6 tbsp whole milk, or 4 tbsp double cream", "1-2 tsp lemon juice, or to taste"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the spinach in hot water for three minutes or until wilted. Drain into a colander and run cold water over it until cool. In a food processor or blender, blend to a smooth paste and set aside.", "Heat the oil in a large non-stick pan. Add the cumin and fry for about 30 seconds, until fragrant, then add the onion and fry over a low heat for about six minutes, until soft. Add the ginger, garlic and chillies and cook for a further minute. ", "Add the ground coriander and salt to taste. Cook for another 30 seconds then add the spinach and a splash of water if necessary. The mixture should be loose but not watery. Bring to a boil and then simmer for three minutes. ", "Add the paneer cubes, garam masala and milk or cream. Stir and cook for a few minutes or until the spinach is nice and creamy. Stir in the lemon juice to taste. Serve with pilaff rice or naan bread."]}, {"isVegetarian": true, "title": "Pane Toscana", "url": "www_bbc_co_uk_food_recipes_panetoscana_82391", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp fresh yeast or 7g/¼oz sachet dried yeast", "200ml/7fl oz tepid water", "250g/9oz strong white bread flour", "2 tbsp fresh yeast or 1 tbsp dried", "300ml/10fl oz tepid water", "1kg/2¼lb strong white flour, plus extra for dusting", "2 tsp salt"], "serves": "Makes 1 large loaf", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the starter, mix the yeast and water together in a bowl. Add the 250g/9oz flour and stir until it forms a thick paste. Cover with a tea towel and leave overnight at room temperature.", "To make the dough, mix the yeast with 2 tablespoons of tepid water. ", "Pour the 1kg/2¼lb flour into a mound on a flat surface, then mix the salt in. ", "Make a well in the centre of the mound. Pour the yeast mixture and the starter into the well. Gradually add the remaining water and slowly combine into a dough using your hands.", "Knead the dough for about 10 minutes, adding more flour or water if necessary, until it is soft but firm and elastic. The dough is ready when it springs back to shape when you push it with your finger.", "Divide the dough into two and shape each half into a round loaf. Place on a baking tray, cut a cross in the top of each loaf and dust lightly with flour. Leave to rise in a warm place for about 1½ hours until double in size.", "Preheat the oven to 200C/400F/Gas 6.", "Bake the loaves in the oven for one hour or until the loaves sound hollow when tapped underneath."]}, {"isVegetarian": true, "title": "Panettone", "url": "www_bbc_co_uk_food_recipes_panettone_16322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panettone_16322_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour\t\t\t", "7g salt\t\t\t\t", "50g/2oz caster sugar\t\t\t\t", "2 x 7g sachets instant yeast\t\t\t\t", "140ml/5fl oz warm milk\t\t\t\t", "5 free-range eggs, at room temperature, plus extra for egg wash", "250g/9oz unsalted butter, softened, plus extra for greasing", "120g/4½oz dried cherries", "120g/4½oz dried sultanas", "120g/4½oz dried currants", "100g/3½oz whole blanched almonds"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the flour, salt, sugar, yeast, milk and the eggs into the bowl of a free-standing mixer fitted with a dough hook.", "Mix slowly for two minutes, then increase the speed to medium and mix for a further 6-8 minutes until you have a soft dough. ", "Add the softened butter and mix for another 5-8 minutes. Remember to scrape down the bowl periodically to ensure that the dough mixes well. It will be very soft.", "Add the dried fruit and nuts. Mix until all is incorporated. ", "Tip the dough into a bowl, cover with clingfilm and chill overnight until the dough has firmed up enough for you to able to shape it.", "Prepare a 18cm/7in panettone tin by brushing the inside generously with melted butter. ", "Remove the panettone dough from the fridge.", "Knock back the dough, shape into a ball and place into the tin.", "Leave to prove at room temperature for a further 2-3 hours, until the dough just starts to dome over the top of the tin.", "Preheat the oven to 180C/350F/Gas 4. ", "Brush the top of the panettone with egg wash and bake for about 25 minutes. Reduce the temperature to 150C/300F/Gas 2 and bake for a further 35 minutes, or until a skewer comes out clean. Check the panettone periodically in case of oven hot spots. Bear in mind that the sugar and butter in the dough could brown too much before it is actually fully baked. ", "Remove the panettone from the tin immediately and allow to cool. "]}, {"isVegetarian": false, "title": "Pan-fried bacon and potato rosti with a fried egg", "url": "www_bbc_co_uk_food_recipes_panfriedbaconandpota_89412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz smoked bacon, fat removed, chopped", "½ baking potato, peeled and grated", "1 tbsp olive oil", "1 free-range egg", "sprinkling freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bacon and potato rösti, heat the oil in a frying pan over a medium heat and fry the bacon pieces for 5-6 minutes, or until crisp and golden-brown. ", "Put the grated potato into a clean tea towel and bring the edges of the tea towels together to form a parcel. Wring the grated potato in the tea towel until as much moisture as possible has been extracted.", "Add the grated potato to the frying pan with the bacon, and mix well to combine. ", "Press the potato mixture down into the pan with a spatula or fish slice. Fry over a medium heat for 5-6 minutes on each side, until golden-brown and crisp on both sides.", "For the fried egg, heat the oil in a frying pan over a high heat, add the egg and fry until it has just set. Sprinkle the freshly ground black pepper over the egg."]}, {"isVegetarian": true, "title": "Panettone bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_panettone_bread_and_46908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz panettone, cut into 1cm/½in slices ", "200g/7oz unsalted butter ", "300ml/10fl oz blackberry compôte ", "4 free-range eggs", "2 egg yolks ", "400ml/14fl oz full-fat milk ", "400ml/14fl oz cream ", "120g/4¼oz caster sugar", "icing sugar, for dusting", "250ml/9fl oz pouring cream (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Liberally spread the sliced pannetone with the butter and then the blackberry compôte. ", "Lay the pannetone in a 20x30cm/8x12in baking tin or ovenproof dish in any order that makes you happy – in a symmetrical pattern or higgledy-piggledy, it’s entirely up to you! ", "Whisk together the whole eggs, egg yolks, milk, cream and caster sugar in a large mixing bowl.", "Pour some of the egg mixture over the slices of pannetone and allow to rest for five minutes. Repeat the process a couple more times, until all the mixture is used up.", "Bake for 25–30 minutes, or until brown on top, but still a little wobbly.", "Serve the pudding in serving bowls, dusted with icing sugar and with a little pouring cream, if liked."]}, {"isVegetarian": false, "title": "Pan-fried bacon-wrapped chicken breast with cheesy butternut squash mash", "url": "www_bbc_co_uk_food_recipes_panfriedbaconwrapped_81281", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz chicken breast", "25g/1oz Stilton", "2 slices smoked back bacon", "1 tbsp olive oil", "salt and freshly ground black pepper", "½ butternut squash, peeled, seeds removed, chopped, boiled until soft and drained", "50g/1¾oz Stilton", "50ml/2fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, make an incision to the chicken breast lengthways to create a pocket. ", "Place the Stilton into the pocket then wrap the breast with the bacon rashers.", "Rub the bacon-wrapped breast with the olive oil and season both sides with salt and freshly ground black pepper.", "Heat an ovenproof frying pan over a high heat. Add the bacon-wrapped chicken and pan fry for one minute on each side until browned.", "Transfer to the oven and roast for 12-15 minutes, or until the chicken is completely cooked through.", "To make the mash, mash the cooked butternut squash using a potato masher or a ricer.", "Add the cream and Stilton, mix together well and season, to taste, with salt and freshly ground black pepper.", "To serve, place the mashed butternut squash in the middle of a large warmed plate and place the chicken on top."]}, {"isVegetarian": false, "title": "Pan-fried balsamic and honey glazed salmon with cheese and rocket mash", "url": "www_bbc_co_uk_food_recipes_panfriedbalsamicandh_84491", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1x110g/4oz thin salmon fillet, skin on", "1 tbsp balsamic vinegar", "2 tsp clear honey", "2 tsp sesame seeds", "1 small potato, peeled and diced", "25g/1oz butter", "2 tbsp double cream", "2 tbsp cheddar cheese, grated", "35g/1¼oz rocket, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salmon, heat the oil in a frying pan over a high heat. When hot add the salmon and pan fry for 1-2 minutes on each side.", "Keeping the salmon in the pan, drain the oil from the pan and add the balsamic vinegar and cook for two minutes. ", "Finally add the honey and the sesame seeds. Remove the salmon from the pan. To make a sauce, add one tablespoon of hot water to the frying pan and stir well to remove the sticky bits from the bottom of the pan.", "For the mash, bring a saucepan of salted water to the boil. Boil the potatoes for ten minutes.", "Drain the potatoes and place into a bowl with the butter, cream, cheese and rocket and mash together. ", "To serve, place the mash onto a serving plate with the salmon on top. Drizzle with the sauce."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with a three pepper stir-fry", "url": "www_bbc_co_uk_food_recipes_panfriedbasswithathr_67270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2x200g/7oz fillet of sea bass", "1½ tbsp vegetable oil", "½ tbsp olive oil", "2 red peppers, very neatly and finely sliced", "2 yellow peppers,  very neatly and finely sliced", "2 garlic cloves, finely chopped", "5cm/2in piece of ginger, sliced and cut into fine julienne", "1.2 litres/2 pints light chicken stock, hot", "1 orange, zest and juice  ", "1 lime, zest and juice ", "1 lemon, zest and juice", "1 tbsp caster sugar", "2 red chillies, cut at an angle to form long rings and seeds removed", "2 green chillies, cut at an angle to form long rings and seeds removed", "2 tbsp fresh coriander finely chopped", "1 tbsp vegetable oil", "a large handful of baby spinach, blanched in boiling water for 1-2 minutes (this is for the fish to sit on in the centre of the plate)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Score the fillets of sea bass on the skin side - to prevent the fish from curling when it's pan-fried.", "In a frying pan, heat the olive and ½ tbsp vegetable oil and place the fish skin side down in the hot oil and leave to fry for a couple of minutes", "Meanwhile, heat the remaining 1 tbsp vegetable oil in a hot wok and add the peppers, and chillies and stir-fry for a minute or two.", "Check the fish and if the skin is crispy turn the fish over and cook the other side for a couple of minutes.", "To the peppers and chillies now add the garlic and ginger and stir.", "Add the chicken stock, the juice of the citrus fruits and allow to bubble.", "Add the sugar and the citrus zests.", "Finally add the fresh coriander and it's ready to serve.", "To serve, place the blanched spinach in the centre of the serving plate and place the fish on top, skin side up. Ladle the peppers and broth over the fish until the broth is at a level with the fish and eat immediately. Garnish the fish with a bit of citrus zest - optional."]}, {"isVegetarian": false, "title": "Pan-fried calves' liver with dry-cured bacon and balsamic caramelised onions, served with root vegetable and rocket purée", "url": "www_bbc_co_uk_food_recipes_panfriedcalfsliverwi_71185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "1 large onion, halved and thinly sliced", "pinch of sugar", "1½ tsp balsamic vinegar", "6 rashers of thinly sliced dry-cured streaky bacon, rind removed", "275-350g/10-12oz calves' liver, very thinly sliced", "15g/½oz seasoned flour for dusting", "1 tbsp sunflower oil", "salt ", "freshly ground black pepper", "225g/8oz swede, peeled and cut into chunks", "225g/8oz carrots, peeled and cut into chunks", "225g/8oz potatoes, peeled and cut into chunks", "25g/¾oz butter", "handful of rocket", "salt ", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the grill to high. Melt the butter in a large frying pan and fry the onions and sugar over a medium heat, stirring frequently, for 7-8 minutes until nicely browned. ", "Season with salt and pepper, add the balsamic vinegar and leave it to bubble up for a few seconds. Keep warm.", "Grill the bacon until beginning to crisp at the edges. Keep warm.", "Season the liver on both sides with salt and pepper and then coat lightly in the seasoned flour. Pat off the excess.", "Heat another large frying pan over a high heat. Add the oil and then the slices of liver and cook them over a high heat for 30 seconds on each side, the object being to have the liver nicely browned on the outside, yet still pink and juicy on the inside.", "To make the root vegetable and rocket purée, cook the swede, carrots and potatoes in boiling salted water for 20 minutes, until tender. Then drain, place in a blender with the butter and blitz into a smooth purée. ", "Finally, return the purée to the pan and leave on a gentle heat, until the mixture has dried out. Add the rocket, salt and pepper and serve with the pan-fried-liver, bacon and caramelised balsamic onions."]}, {"isVegetarian": false, "title": "Pan-fried calf's liver with port and sage", "url": "www_bbc_co_uk_food_recipes_panfriedcalvesliverw_71474", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 tbsp olive oil", "250g/9oz calf's liver, thinly sliced and cut in half lengthways ", "4 tbsp port or Madeira", "2 tsp red wine vinegar", "100ml/3½fl oz fresh beef or chicken stock (you can buy this ready-made in a tub)", "250g/9oz fresh, or 200g/7oz dried, ribbon pasta", "½ tbsp chopped fresh sage or a good pinch dried sage", "1 tsbp crème fraïche (optional)", "sea salt", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large pan of lightly salted water until boiling for the pasta", "Meanwhile, heat half the butter with the oil in a frying pan until no longer foaming and feeling hot. Add the liver and  fry for 1-2 minutes on each side until well-browned and just firm when pressed with the back of a fork. Season in the pan,  then remove to a warmed plate and keep warm.", "Add the port or Madeira to the pan, bring to the boil and allow to bubble until reduced by half. Add the vinegar and cook  for a few seconds. Pour in the stock and bring to the boil, stirring. Continue to boil until reduced by half.", "Meanwhile, add the pasta to the pan of boiling water and cook for 2-3 minutes for fresh pasta, or according to the packet instructions for dried pasta, until just tender. Drain, and then toss with the remaining butter and the fresh or dried sage.", "Season the pasta well and divide between two warmed serving plates. Lay the liver over the top (you may want to slice this  into attractive pieces). Whisk the crème fraïche into the sauce in the pan, if using, check the seasoning and  spoon over the liver. ", "Serve immediately."]}, {"isVegetarian": false, "title": "Pan-fried calf's liver with bacon, lemon and cavalo nero", "url": "www_bbc_co_uk_food_recipes_panfriedcalvesliverw_85716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter", "2 slices calf's liver (1cm/½in thick)", "110ml/4fl oz red wine", "250ml/4fl oz beef stock", "6 slices dry-cured streaky bacon, sliced into lardons", "1 cavalo nero cabbage, sliced", "1 lemon, juice only", "50g/2oz crème fraîche"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot and add 25g/1oz butter.", "Season the liver with salt and freshly ground black pepper and add to the frying pan. Fry on each side for 2-3 minutes, until cooked to your liking. Remove from the pan and set aside.", "Add the red wine to the pan and bring to the boil, scraping to release the sticky, caramelised cooking juices from the base of the pan.", "Reduce the liquid by half, then add the beef stock and boil for a further 5-6 minutes.", "Add 25g/1oz butter and stir in. Remove from the heat.", "Heat a deep-sided frying pan until hot then add the remaining 25g/1oz butter and the bacon pieces. Fry until crispy then add the cavelo nero and stir-fry for 3-4 minutes, until wilted.", "Add the lemon juice and season well with salt and freshly ground black pepper.", "To serve, place the cabbage in the centre of two plates. Top each with the liver and a spoonful of crème fraîche. Spoon over the red wine gravy."]}, {"isVegetarian": false, "title": "Pan-fried chicken breast with Jerusalem artichoke risotto and roasted vegetables", "url": "www_bbc_co_uk_food_recipes_panfriedchickenbreas_84846", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 Label Anglaise chicken, legs removed", "1 garlic bulb", "1 handful fresh thyme", "salt and freshly ground black pepper", "2 litres/3pt 10fl oz chicken stock", "2 tbsp olive oil", "25g/1oz slightly salted butter", "250g/9oz risotto rice", "300g/11oz Jerusalem artichokes, sliced thinly", "50g/2oz butter", "50ml/2fl oz double cream", "4 tbsp parmesan, freshly grated", "1 handful fresh chives, finely chopped", "200g/7oz baby carrots", "200g/7oz baby turnips", "1 handful fresh rosemary", "3 garlic cloves", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil, plus extra for drizzling", "2 tbsp clear honey ", "2 tbsp sherry vinegar", "1 small punnet pea shoots"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Method for chicken, place the garlic bulb and a several of the sprigs of thyme into the cavity of the chicken.", "Season the chicken with salt and black pepper then place it into a large lidded pan or stockpot. Add the chicken stock to the pan and cover the pan with a lid.", "Bring the mixture to the boil, then reduce the heat and gently poach the chicken for 25 minutes.", "Remove the pan from the heat and allow the chicken to cool in the stock.  Then remove the chicken from the pan and pat dry with kitchen paper.  Reserve the chicken stock for later.", "Remove the breast from the chicken and season with salt and freshly ground black pepper.", "Heat a frying pan until hot.  Add the olive oil and place the chicken breast in the pan, skin-side down.", "Fry the breast until the skin becomes golden brown then turn over onto the other side.  Add the butter and fry until the chicken is completely cooked through.", "For the risotto, place 500ml/18fl oz of the chicken stock that the chicken was poached in, into a clean saucepan and bring to the boil.", "Add the risotto rice to the pan and allow the mixture to simmer for 4-5 minutes, until the rice becomes slightly tender.  Drain the excess stock from the rice, and allow the rice to cool in the saucepan.", "Place the artichokes and half the butter into a clean saucepan and heat at a low temperature until the artichokes become tender.", "Add the cream and 175ml/6fl oz of the poached chicken stock and bring to the boil.", "Pour the stock and the artichokes into the bowl of a food processor and blend the mixture until a purée is formed.", "Place the saucepan of rice back onto the heat and gradually add a ladle at a time of the remaining poached chicken stock to the pan (allow the rice to absorb the stock before adding each ladle of stock).  Continue to add the stock to the rice until the rice is tender.", "Add a large spoonful of the artichoke purée, the remaining butter and the parmesan to the saucepan and stir until the ingredients have combined.", "Add the chives to the risotto and mix well.", "For the roasted vegetables, place the carrots, turnips, rosemary and two of the garlic cloves into a clean saucepan and fill the saucepan with water until the vegetables are covered.  Season the vegetables with salt and freshly ground black pepper and bring the pan to the boil.  Drain the excess water from the vegetables.", "Heat a clean frying pan until it is smoking hot then add the olive oil, a little more rosemary and another garlic clove.", "Add the honey to the pan and deglaze with the sherry vinegar.  Mix the ingredients well.", "To serve, spoon some of the risotto onto the side of a clean plate and place the chicken on top.  Arrange the vegetables on the other side of the plate and place the pea shoots on top. Drizzle the olive oil over the top of the plate."]}, {"isVegetarian": false, "title": "Pan-fried chicken breast, wild garlic and wild mushrooms with boiled new potatoes", "url": "www_bbc_co_uk_food_recipes_panfriedchickenbreas_86038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 organic boneless chicken breasts, skin on", "salt and freshly ground black pepper", "1 tbsp olive oil", "6 baby onions, peeled and halved", "½ tsp caster sugar", "6 new potatoes, halved lengthwise", "1 bunch fresh chives, finely chopped", "salt and freshly ground black pepper", "50g/2oz butter", "200g/7oz pied de mouton mushrooms (or other wild mushrooms), cleaned and trimmed", "salt and freshly ground black pepper", "4 shallots, finely chopped", "200ml/7fl oz single cream", "12 wild garlic leaves, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 3.", "For the chicken, season both of the chicken breasts with salt and freshly ground black pepper, then place, skin-side down, into a hot ovenproof frying pan over a medium heat. Cook until the skin is golden-brown, then add the baby onions and sugar to the pan.", "Turn the chicken breasts over and transfer to the oven to cook for a further 7-8 minutes, or until the chicken is completely cooked through. Remove from the oven and leave to rest for five minutes.", "For the potatoes, place the potatoes into a saucepan of water, add salt and bring to the boil. Reduce the heat and simmer for ten minutes, or until tender, then drain off the liquid.", "Add the chives and season, to taste, with salt and freshly ground black pepper and leave to stand.", "For the mushrooms, heat a non-stick frying pan until hot and add the butter to the pan. When the butter is foaming, add the mushrooms, season with salt and freshly ground black pepper and leave to fry for 1-2 minutes.", "Add the chopped shallots and cook for a further two minutes.", "Reduce the heat and add the single cream. Gently heat to bring to the boil, and, once boiling, reduce the heat and add the wild garlic leaves. Stir well and season, to taste, with salt and freshly ground black pepper.", "To serve, pour the mushroom mixture into two serving bowls and place the chicken breasts on top. Place the baby onions around the plate and serve the new potatoes on the side."]}, {"isVegetarian": false, "title": "Pan-fried chicken with chilli beans, fennel and pancetta", "url": "www_bbc_co_uk_food_recipes_panfriedchickenwithc_73603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp. extra virgin olive oil, plus extra for drizzling", "4 skinless, boneless chicken breasts about 150g/5½oz each", "2 shallots, chopped", "4 garlic cloves, chopped", "1 large fresh red chilli, de-seeded and chopped", "1 small bulb of fennel, thinly sliced", "400g/14oz can flageolet beans, rinsed and drained", "1 lemon, juice and grated zest only", "3 tbsp chopped mixed fresh herbs, e.g. parsley, mint or basil", "8 thin slices of pancetta", "sea salt and freshly ground black pepper", "green leaf salad", "crusty bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large heavy-based non-stick frying pan until you feel a good heat rising.", "Add approximately one tablespoon of the oil, then add the chicken breasts and pan-fry for about five minutes on each side until firm when pressed with the back of a fork.", "Season well and set aside in the pan. They will keep warm without extra heating.", "Heat the remaining tablespoon of oil in a separate pan, add the shallots, garlic, chilli and fennel and stir-fry for about five minutes until softened.", "Add the beans and seasoning to taste, and then heat through until piping hot.", "Stir in the lemon zest and juice and fresh herbs.", "Meanwhile, heat the grill until hot and grill the pancetta until crispy.", "Remove the pancetta from the grill then drain on kitchen paper.", "Divide the bean and fennel mixture between four warmed serving plates.", "Slice the chicken breasts into medallions and arrange on top, then add two slices of pancetta to each plate, which you can either crumble or leave whole.", "Drizzle over any chicken pan juices with a little extra oil.", "Serve warm with the crusty bread and green leaf salad."]}, {"isVegetarian": false, "title": "Pan-fried chicken with Dolcelatte cream sauce and minted pea and potato purée", "url": "www_bbc_co_uk_food_recipes_panfriedchickenwithd_90707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ chicken breast fillet, sliced into strips", "50ml/2fl oz white wine", "100ml/3½fl oz double cream", "55g/2oz Dolcelatte cheese", "15g/½oz butter", "2 tbsp chopped fresh parsley", "1 Desirée potato, peeled and chopped", "55g/2oz peas", "2 tbsp olive oil", "6 fresh mint leaves, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, heat the olive oil in a pan and fry the strips of chicken for 3-5 minutes, or until golden-brown and just cooked through.", "Add the wine to the pan to deglaze, reduce the heat to a simmer and cook for 2-3 more minutes, or until the liquid has reduced by half in volume. ", "For the sauce, add the cream and cheese to the pan with the chicken and bring to a simmer, stirring until the cheese has melted. Finally, stir in the butter and parsley.", "For the pea and potato purée, cook the potato in a pan of boiling water for 7-9 minutes, or until tender, adding the peas for the last 2-3 minutes of cooking time. Drain and place the peas and potato into a food processor with the olive oil and mint. Blend to a smooth purée, then season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the pea and potato purée onto a serving plate and place the chicken strips on top. Drizzle the cream sauce around the edges of the plate."]}, {"isVegetarian": false, "title": "Pan-fried cod on a bed of pea purée with smoked bacon and shallot cream sauce", "url": "www_bbc_co_uk_food_recipes_panfriedcodonabedofp_13152", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4x200g/7oz cod steak", "chopped chives", "500g/1lb2oz frozen peas", "50g/2oz butter", "salt and freshly ground black pepper ", "250g/9oz shallots sliced", "290ml/½ pint fish stock", "200g/7oz smoked bacon trimmings", "50ml/1½fl oz cream", "250ml/8fl oz milk", "70g/3oz butter", "1 bay leaf", "1 large sprig of thyme ", "12 shallots peeled ", "50g/2oz butter ", "salt and freshly ground black pepper ", "sherry vinegar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pea purée: cook off the peas in boiling salted water until soft. Remove from the water using a spider or holey spoon and refresh in iced water. Once cool, remove from the water and leave the peas to drain for a little while. ", "Place 400g/14oz of the peas into a food processor and blend to a purée. Pass the purée through a sieve to remove the outer skins and place the purée into a sauce pan. ", "Warm and mix in the butter and season with salt and pepper. At the last minute add the remaining peas and you are ready to serve.", "To make the shallot and bacon velouté: Place the bacon trimmings and the milk together in a saucepan and bring to the boil. ", "Separately, sweat the shallots with butter and a pinch of salt, do not colour. Add the thyme and bay leaf and continue to sweat for a further 2 minutes.", "Add the fish stock, cream and the infused milk with the bacon trimmings. Bring to the boil and slowly cook out for 20 minutes. ", "Remove the bacon trimmings, thyme and bay leaf and pour the liquid and shallots in the blender and blend until very smooth, then pass through a chinois. ", "Season with salt and pepper, add a knob of butter and using a hand blender create a cappuccino effect and serve. ", "To make the roasted shallots: make sure they are peeled to an even size and that you don't cut off the root. Place them into a saucepan and cover with water, add a pinch of salt to twist and bring to the boil. ", "Cook for about 5 minutes then pass off the shallots from the cooking liquid and refresh under running cold water. ", "Add the butter to a frying pan, heat slowly and add the shallots, season with salt and pepper then slowly colour the shallots. ", "Place into a preheated oven at 180C/350F/Gas 4 for 5 minutes then turn them and continue cooking until golden brown and soft. ", "Deglaze the pan with a splash of vinegar and drain in a sieve to remove excess fat. Reserve for later use. ", "To make the pan-fried cod: season with salt and pepper on both sides. Using a non-stick pan, heat with some olive oil and place the cod into the hot oil, skin side up. ", "Place into a preheated oven at 200C/400F/Gas 6 for 2 minutes and then flip over and continue to cook for a further 3 to 4 minutes, being careful not to over cook. ", "Remove from the oven and squeeze lemon juice over the fish. In the middle of each plate, place a spoonful of pea purée and dress three shallots around. Using a fish slice place the cod on top of the pea purée and then heat and froth the sauce using a hand blender and spoon around the fish."]}]