[{"ingredients": ["4 x 200 g / 7 oz de chuletas de cerdo", "4 cucharaditas de copos de sal marina", "2 cucharadas de aceite de oliva", "2 cebollas, peladas, finamente picadas", "Tocino ahumado de 150g / 5oz, picado", "1 bouquet garni (apio, perejil, hojas de laurel y tomillo)", "300g / 10½ oz champiñones", "300g / 10½ oz de chalotes, pelados, cocidos durante diez minutos, luego escurridos y refrescados en agua fría", "4 manzanas de Cox, peladas, sin núcleo, descuartizadas", "4 cucharadas de azúcar mascabado", "500 ml / 17½ fl oz de sidra de Suffolk", "4 cucharaditas de mostaza Suffolk", "400 ml / 14 fl oz crema doble", "zanahorias cocidas, para servir", "puré de patatas, para servir"], "method": ["Ruede los lados gordos de las chuletas de cerdo en los copos de sal.", "Caliente una sartén hasta que fume. Pinche el lado gordo de las chuletas de cerdo en la sartén durante 1-2 minutos, utilizando pinzas para mantener las chuletas de cerdo en posición vertical en la sartén. Cuando la grasa esté dorada y crujiente, ponga las chuletas de cerdo planas y fríe durante 3-4 minutos en ambos lados, o hasta que la chuleta de cerdo tenga marcas profundas en la plancha. Dejar de lado.", "Mientras tanto, caliente el aceite de oliva en una sartén grande y fríe la cebolla y el tocino juntos durante 4-5 minutos, o hasta que la cebolla comience a colorear. Agregue el bouquet garni, champiñones y chalotes a la sartén y cocine a fuego medio-bajo durante 3-4 minutos.", "Vierta la sidra en la sartén y desgálelo raspando cualquier trozo dorado del fondo de la sartén con una cuchara de madera, luego lleve a ebullición. Agregue las chuletas de cerdo y cocínelas durante 10-15 minutos, o hasta que la carne de cerdo esté cocida (los jugos deben quedar limpios cuando se perfora la carne de cerdo en la parte más gruesa).", "Mientras tanto, desempolve las piezas de manzana con el azúcar mascabado. Coloque la sartén de la plancha utilizada para cocinar la carne de cerdo sobre el fuego, luego agregue las manzanas y cocine durante 8-10 minutos, o hasta que las manzanas estén doradas y caramelizadas.", "Retire las chuletas de cerdo de la sartén y déjelo a un lado para que descanse. Regrese la sartén al fuego y hierva rápidamente, agregue la mostaza y la crema y cocine por 4-5 minutos, o hasta que el líquido se haya reducido a una consistencia de salsa.", "Para servir, espolvorea las manzanas caramelizadas en platos para servir y coloca una chuleta de cerdo junto a las manzanas, junto con las zanahorias cocidas y el puré de patatas. Cuchara sobre la salsa y servir."], "url": "www_bbc_co_uk_food_recipes_suffolkporkchopswith_91979", "title": "Suffolk chuletas de cerdo con sidra y manzanas caramelizadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite, para engrasar", "Harina de auto crianza de 200g / 7oz", "50 g / 1¾oz de cacao en polvo, tamizado", "1 cucharadita de bicarbonato de soda", "100 g / 3½ oz de mantequilla, en cubos", "100 ml / 3½ fl oz leche semidesnatada", "3 huevos grandes de gallinas camperas, golpeados", "250g / 9 oz de camote, finamente rallado", "1 banana grande sobremadurada (aproximadamente 125 g / 4½ oz de peso pelado), machacada con un tenedor"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase y forme la base y los lados de una lata cuadrada de pastel de 23cm / 9 pulgadas con pergamino para hornear.", "Mezcle la harina, el cacao y el bicarbonato de soda en un tazón grande. Haz un bien en el centro.", "Coloque la mantequilla en una cacerola mediana y derrita a fuego lento, revolviendo regularmente. Retire la sartén del fuego y mezcle la leche con la mantequilla derretida. Agregue los huevos, la batata y el plátano, revolviendo vigorosamente.", "Vierta lentamente en la mezcla de harina, revolviendo constantemente con una cuchara de madera para formar una masa espesa. Vierta en la lata preparada.", "Hornee en el centro del horno durante 30-35 minutos, o hasta que la torta se haya levantado y firme al tacto.", "Sirva caliente o deje enfriar en la lata antes de cortar en cuadrados."], "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_90899", "title": "Brownies de chocolate sin azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 cuadrados", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sugar-free_chocolate_90899_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de avellanas blanqueadas enteras", "10g% 20insweetened% 20100 %% 20pure% 20cacao% 20 (de% 20a% 20block)"], "method": ["Ponga las avellanas en un procesador de alimentos - una pequeña es la mejor para este trabajo - y rellene con la cuchilla de metal durante 8-10 minutos, o hasta que las tuercas primero se conviertan en un polvo y luego una pasta brillante. Detenga la máquina y empuje las tuercas hacia abajo cada 3-4 minutos hasta que se alcance la consistencia correcta. La pasta de avellana debe parecerse a una mantequilla de maní que gotea.", "Raspe la pasta de avellana en una olla pequeña. Rallar finamente el cacao del bloque sobre una tabla. Es más fácil rallar y luego pesar el cacao en lugar de cortarlo al principio.", "Incline el cacao rallado en la sartén con la pasta de nuez y caliente muy suavemente durante unos segundos, revolviendo constantemente hasta que el cacao se derrita. Transfiera a un tazón pequeño y sirva.", "Coloque el producto en un recipiente con tapa. La extensión se mantendrá en la nevera, cubierta, durante tres días."], "url": "www_bbc_co_uk_food_recipes_sugar-free_chocolate_and_54033", "title": "Extensión de chocolate y avellanas sin azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "20g / ½oz de mantequilla sin sal", "60g / 2¼ oz de harina de auto crianza", "1 cucharadita de especias mixtas", "3 ciruelas, cortadas a la mitad, picadas y picadas", "licor de naranja, como Grand Marnier", "150g / 5½oz de chocolate puro", "1 clara de huevo grande de gallinas camperas", "60g / 2¼ oz de azúcar en polvo", "80 g / 2¾oz de mantequilla ligeramente salada, ablandada", "1 cucharadita de licor de naranja, como Grand Marnier", "½ cucharadita de extracto de naranja", "brillo de oro comestible"], "method": ["Para los pasteles de hadas de génoise, alinee una bandeja de mini muffins con 12 cajas de pastel de hadas y precaliente el horno a 170C / 150C (ventilador) / Gas 5.", "Caliente el recipiente de una batidora de pie vertiendo un poco de agua hirviendo y secándola con un paño de cocina.", "Coloque el azúcar y los huevos en el recipiente calentado y bata a velocidad máxima durante varios minutos, o hasta que la mezcla esté pálida y doble en volumen.", "Mientras la mezcla bate, derrita la mantequilla en una olla pequeña. Tamiza la harina y la especia mezclada en un tazón.", "Con cuidado, agregue la mantequilla derretida alrededor del borde de la mezcla mientras sigue batiendo.", "Retire el recipiente de la batidora y colóquelo en una toalla de té, luego tamice y doble suavemente la harina y mezcle la especia en dos tandas.", "Transfiera la mezcla a una manga pastelera y pinte con cuidado en las cajas de pasteles. Hornee durante 10-12 minutos, o hasta que estén dorados y elásticos al tacto.", "Retire los pasteles de las latas y deje enfriar sobre una rejilla de alambre. Pele las cajas de papel de las tortas cuando se enfríe.", "Para las ciruelas, marinar las ciruelas picadas en el licor de naranja en un tazón pequeño. Dejar de lado.", "Para las cajas de pasteles de hadas comestibles, derrita el chocolate en un recipiente resistente al calor colocado sobre una fuente de agua hirviendo. Coloque 12 más cajas de pasteles de hadas en las latas de mini muffins.", "Una vez derretido, pinta el chocolate dentro de las cajas de hadas y presiona las tortas de hadas de genoise refrigeradas en cada una, para que el chocolate forme y cubra el lado de las tortas. Deje que fragüe por completo, luego retírelo de las latas y retire los papeles de las tortas recubiertas de chocolate.", "Para la crema de mantequilla de merengue francesa, combine la clara de huevo y el azúcar en un tazón resistente al calor de tamaño mediano colocado sobre una bandeja de agua apenas hirviendo a fuego lento.", "Batir continuamente con un batidor de mano eléctrico hasta que la mezcla esté espesa y brillante y todo el azúcar se haya disuelto.", "Retire del fuego y continúe batiendo hasta que la mezcla se haya enfriado y sea lo suficientemente gruesa como para mantener su forma.", "Batir la mantequilla hasta obtener una consistencia suave y comenzar a agregar pequeños trozos de ella al merengue, poco a poco, batiendo bien después de cada adición.", "Batir el licor de naranja, el extracto de naranja y la ralladura. Transfiera la crema de mantequilla de merengue a una manga pastelera equipada con una boquilla redonda y póngala en los cupcakes.", "Escurrir las ciruelas de su licor y cubrir cuidadosamente cada pastel de hadas con una pieza de ciruela y una pizca de brillo de oro comestible."], "url": "www_bbc_co_uk_food_recipes_sugar_plum_fairy_cakes_92523", "title": "Pasteles de hadas de ciruela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12 pasteles de hadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb de azúcar de mermelada 2 oz", "Fresas de 500 g / 1 libra y 2 onzas, mondadas y cortadas por la mitad solo si son grandes", "½ limón, solo jugo", "450 g / 1 libra de harina blanca fuerte, más extra para quitar el polvo", "5 cucharaditas de polvo de hornear", "pizca de sal", "75g / 3oz de mantequilla sin sal, más extra para engrasar", "75g / 3oz de azúcar en polvo", "150g / 5oz sultanas", "2 huevos de gallinas camperas, ligeramente batidos, más 2 huevos para glasear", "Leche 250ml / 9fl oz", "400g / 14oz de crema coagulada, para servir"], "method": ["Para la mermelada, caliente el azúcar, las fresas y el jugo de limón en una cacerola grande a fuego medio hasta que el azúcar se haya derretido.", "Llevar la mezcla a ebullición y cocinar durante 3-4 minutos (o hasta 10 minutos si prefieres un atasco de estilo más grueso). Verifique la temperatura con un termómetro de azúcar; debería alcanzar 105C / 220F.", "Deje que la mermelada se enfríe un poco y quite la espuma con una cuchara limpia. Coloque la mermelada en tarros de mermelada, sello y etiqueta estériles.", "Para los bollos, precaliente el horno a 220C / 450F / Gas 7. Engrase una bandeja grande para hornear.", "Tamiza la harina, el polvo de hornear y la sal en un tazón, luego frota la mantequilla hasta que la mezcla se asemeje a pan rallado.", "Agregue el azúcar, pasas y huevos.", "Agregue la leche con una cuchara de madera, poco a poco, para formar una masa suave.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada a un espesor de 2 cm / ¾ pulg.", "Sumerja un cortador de pasteles de 5 cm / 2 pulgadas en una pequeña harina y corte los bollos (tenga cuidado de no torcer el cortador, ya que los bollos se levantarán de manera irregular).", "Batir los dos huevos restantes en un tazón y cepillar cuidadosamente la parte superior de los bollos, teniendo cuidado de que nadie corra por el borde.", "Coloque los bollos en la bandeja de hornear y hornee en el horno durante 10-12 minutos, o hasta que estén dorados.", "Retire los bollos del horno y deje que se enfríen un poco. Sirve los bollos calientes con mermelada de fresa y crema cuajada."], "url": "www_bbc_co_uk_food_recipes_sultana_scones_with_98294", "title": "Bollos Sultana con mermelada de fresa y crema cuajada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear, más extra para quitar el polvo", "pizca de sal", "25 g / 1 oz de azúcar en polvo", "50g / 2oz de mantequilla sin sal, suavizada, más extra para quitar el polvo", "100 g / 3½ oz de sultanas", "150ml / ¼ litro de leche", "1 huevo de gallinas camperas, batido, para cepillar, o harina normal de 25 g / 1 oz, para quitar el polvo", "400g / 14oz de crema coagulada", "550g / 1lb de azúcar de mermelada 4 oz", "1 limón, cáscara y jugo solamente", "3 cucharadas de agua", "1 kg / 2lb 2 oz de fresas frescas, mondadas y cortadas por la mitad (si son grandes)", "1 cucharada de pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para los bollos, mezcle la harina, el polvo de hornear y la sal en un bol.", "Agregue el azúcar, agregue la mantequilla y, con las manos limpias, frote rápidamente en la harina, creando una consistencia de migas finas. Agrega las sultanas.", "Agregue la leche, poco a poco, trabajando con las manos para crear una masa suave. Deje reposar durante 10-15 minutos antes de rodar.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada hasta 2 cm / 1 pulgada de espesor.", "Con un cortador de pasteles de 5 cm / 2 pulgadas, corte la masa, utilizando un golpecito fuerte y sin retorcer la masa mientras corta (al girar la mezcla de scones, el bizcocho se elevará de manera irregular).", "Una vez cortados, los bollos pueden cepillarse con el huevo batido para obtener un glaseado brillante o espolvorearse con la harina para obtener un acabado mate una vez cocido.", "Coloque los bollos en una bandeja de horno engrasada y hornee en el horno durante 10-12 minutos, hasta que estén dorados.", "Deje que se enfríe un poco, y sirva mientras aún está caliente con mermelada y crema.", "Para la mermelada, coloque el azúcar, la ralladura de limón y el jugo y el agua en una sartén grande a fuego lento y caliente hasta que el azúcar se haya disuelto.", "Agregue las fresas y la pimienta negra y revuelva suavemente.", "Ponga la sartén a hervir y cocine durante 3-4 minutos, o hasta diez minutos si prefiere un atasco más espeso. Verifique la temperatura con un termómetro de azúcar: debería alcanzar los 105 ° C / 220 ° F.", "Deje que se enfríe un poco, quitando cualquier espuma con una cuchara limpia para evitar que el atasco se enturbie.", "Coloque la mermelada en tarros de mermelada estériles, selle y etiquete con la fecha."], "url": "www_bbc_co_uk_food_recipes_sultanasconeswithbla_86378", "title": "Bollos Sultana con pimienta negra y mermelada de fresa y crema cuajada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de harina de levante", "pizca de sal", "55 g / 2 oz de mantequilla", "Sultanas de 25g / 1oz", "25 g / 1 oz de azúcar en polvo", "150ml / 5fl de leche en oz"], "method": ["Caliente el horno a 220C / 425F / Gas 7. Engrase ligeramente una bandeja para hornear.", "Mezcle la harina y la sal y frote la mantequilla.", "Agregue las sultaninas, el azúcar y luego la leche para obtener una masa suave.", "Encienda una superficie de trabajo enharinada y amasar muy ligeramente. Pat a una ronda de 2 cm / ¾ de espesor. Use un cortador de 5 cm / 2 in para sellar rondas y colocar en una bandeja para hornear. Amasar ligeramente el resto de la masa y sellar más bollos para usarlo todo.", "Cepille la parte superior de los bollos con un poco de leche. Hornea de 12 a 15 minutos hasta que esté bien dorado.", "Enfriar sobre una rejilla de alambre y servir con mantequilla y buena mermelada y tal vez un poco de crema coagulada."], "url": "www_bbc_co_uk_food_recipes_sultanascones_1286", "title": "Scones de Sultana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8-12 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "3 cucharadas de aceite de oliva", "Paletilla o pierna de cordero de 1.8kg / 4lb, cortada, cortada en cubos de 2.5cm / 1in", "1 cebolla", "5 dientes de ajo, aplastados", "2 cucharadas de pasta de tomate", "½ cucharadita de tomillo seco", "1 cucharadita de orégano seco", "¼ cucharadita de clavo de olor", "½ cucharadita de pimienta de Jamaica", "1 cucharadita de comino molido", "285ml / 10fl oz de caldo de cordero", "sal y pimienta negra recién molida", "perejil de hoja plana, para adornar", "4 berenjenas grandes", "Leche 250ml / 9fl oz", "2 cucharadas de crema doble", "55 g / 2 oz de mantequilla", "1 cucharada de harina normal", "Queso Kasseri de 110g / 4oz (hará el cheddar), rallado", "1 cucharadita de hojuelas de chile seco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el cordero, caliente la mantequilla y el aceite en una cacerola pesada y dore el cordero durante unos 5 minutos, revolviendo con frecuencia.", "Agregue la cebolla, el ajo y el sudor durante unos minutos. Agregue la pasta de tomate, tomillo, orégano, clavo de olor, pimienta de Jamaica, comino, caldo y sal y pimienta negra recién molida. Llevar a ebullición y hervir a fuego lento con la tapa durante aproximadamente una hora hasta que el estofado sea espeso y la carne tierna.", "Para la berenjena, hornee las berenjenas en el horno durante aproximadamente 40 minutos o hasta que se ablanden y se ablanden. Dejar enfriar un poco.", "Pele las berenjenas y coloque la pulpa a un lado.", "En una cacerola calentar la leche y la crema. En otra sartén, derrita la mantequilla, luego trabaje en la harina. Poco a poco agregue la leche tibia y la crema a la mantequilla y la harina y revuelva para hacer una salsa blanca espesa.", "Agregue el puré de berenjena, el queso, los copos de chile, la sal y la pimienta negra recién molida. Cocine por unos 5 minutos.", "Pon un montón de puré de berenjena en el medio del plato y rodea con el cordero. Adorne con perejil."], "url": "www_bbc_co_uk_food_recipes_sultansdelightwithcr_81428", "title": "La delicia del sultán con berenjena a la crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de papas, cortadas en cubos de 2cm / 1in", "4 cucharadas de aceite de oliva", "2 cebollas grandes, en rodajas finas (aproximadamente 400 g / 14 oz)", "¼ cucharadita de sal fina", "1 cucharadita de azúcar moreno claro", "8 chuletas de cordero grandes", "5 cucharadas de aceite de oliva", "1 cucharadita de sal", "2-3 tbsp sumac"], "method": ["Hervir las papas en agua ligeramente salada durante 1-2 minutos, o hasta que estén tiernas. Escurrir y apartar.", "Para las chuletas de cordero, bash la carne con un mazo o un rodillo para adelgazar. Coloque las chuletas en un plato, rocíe con aceite y sazone bien con sal.", "Freír las chuletas a fuego alto durante 3 minutos por cada lado. Colóquelos en una bandeja para hornear y espolvoree ambos lados con el zumaque. Cubra con papel de cocina y manténgalas calientes.", "Para hacer las papas, limpie cualquier trozo quemado de la sartén, luego agregue el aceite y coloque a fuego medio. Agregue las cebollas, la sal y el azúcar y cocínelos durante 15 minutos, o hasta que estén dorados, caramelizados y suaves.", "Aplastar las patatas ligeramente con la parte posterior de un tenedor y agregar a las cebollas. Mezclar, cocinar de 10 a 15 minutos o hasta que los bordes estén crujientes. Sirve con las chuletas."], "url": "www_bbc_co_uk_food_recipes_sumac_lamb_chops_with_87399", "title": "Chuletas de cordero asado con papas de cebolla caramelizadas machacadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sumac_lamb_chops_with_87399_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7-10 hojas de algas marinas secas (llamadas konbu, disponibles en los supermercados japoneses)", "8g de copos de bonito seco (llamado katsuobushi, disponible en los supermercados japoneses)", "puñado de hojas frescas de espinaca", "Aburaage de 200 g / 7oz (tofu frito en rodajas finas, disponible en los supermercados japoneses), triturado en 1cm / ½ en longitudes", "1½ cucharada de pasta de miso blanco"], "method": ["Para el dashi, coloca el konbu en una olla profunda y cúbrelo con 500 ml / 18 fl oz de agua. Dejar de lado para remojar durante 30 minutos.", "Una vez remojado, caliente el contenido de la sartén hasta que hierva, quitando el konbu con una cuchara con ranura justo antes de que el agua comience a hervir.", "Agregue los copos de bonito al agua y hierva durante 1 minuto, luego retire la sartén del fuego y deje que el caldo se enfríe durante 4-5 minutos. Colar el dashi a través de un colador fino en una olla limpia y reservar. Mantener caliente", "Para la sopa de miso, cocine las espinacas en una cacerola con agua hirviendo hasta que se marchiten, luego retírelas del agua con una espumadera y déjelas a un lado en un recipiente para que se enfríen. Una vez que las espinacas estén lo suficientemente frías para manipularlas, exprime el exceso de humedad de las hojas con las manos. Dejar de lado.", "Agregue el aburaage al agua de espinacas y hierva durante 1-2 minutos para eliminar la grasa. Escurrir bien.", "Empuja la pasta de miso a través de un tamiz fino en el dashi y calienta hasta que se disuelva. Agregue el tofu y la espinaca escurridos y caliente. Sirve inmediatamente en tazones."], "url": "www_bbc_co_uk_food_recipes_sumikos_miso_soup_47124", "title": "Sopa de miso de Sumiko", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 claras de huevo de gallinas camperas", "275g / 9¾oz de azúcar en polvo, más extra para espolvorear", "50g / 1¾oz de almendras en copos", "Crema doble 600ml / 20fl oz", "Frambuesas 100g / 3½ oz", "2 cucharadas de miel de brezo", "50 g / 1¾oz de fresas cortadas por la mitad", "50g / 1¾oz zarzamoras", "50g / 1¾oz frambuesas", "1 cucharada de miel de brezo", "ramitas de brezo, para decorar (opcional)", "azúcar en polvo, para quitar el polvo"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4 y coloca una lata de rollo suizo de 23 x 33 cm / 9 x 13 pulgadas con papel de hornear.", "En un tazón grande, bata las claras de huevo con un batidor de mano eléctrico hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco agregue el azúcar, una cucharada a la vez. Batir hasta que esté muy tieso y brillante y se haya agregado todo el azúcar.", "Coloque la mezcla en la lata preparada y alise la superficie. Espolvorear con almendras. Coloque la lata en el horno precalentado y hornee durante ocho minutos, o hasta que estén doradas. Baje la temperatura a 160 ° C / 325 ° F / Gas 3 y hornee por otros 15 minutos o hasta que estén crujientes.", "Saque del horno y dé vuelta, con la cara de almendra hacia abajo, sobre una hoja de papel para hornear antiadherente espolvoreado con azúcar en polvo. Retire el pergamino para hornear de la base del merengue cocido y deje enfriar.", "Para el relleno, coloque la crema y las frambuesas en un bol y lúcelas ligeramente. Extiéndalo uniformemente sobre el merengue y espolvoree la miel de brezo y la mayoría de las moras y las fresas. Comenzando en el extremo largo, enrolle el merengue usando el papel para ayudarlo.", "Decora la parte superior del pastel con las bayas reservadas, miel de brezo, ramitas de brezo (si se usa) y una capa de azúcar glas."], "url": "www_bbc_co_uk_food_recipes_summer_berry_and_heather_67533", "title": "Summer baya y brezo miel merengue roulade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_and_heather_67533_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 175g / 6oz, más extra para espolvorear", "100 g / 3½ oz de mantequilla sin sal, refrigerada, cortada en trozos, más extra para engrasar", "¼ cucharadita de sal marina fina", "40g / 1½oz de coco desecado", "2 cucharadas de azúcar en polvo de oro", "1 yema de huevo de gallinas camperas (reserva el blanco para el pastel)", "½ cucharadita de extracto de vainilla", "50g / 1¾oz frambuesas", "50g / 1¾oz de mermelada de azúcar", "175g / 6oz de mantequilla sin sal", "150 g / 5½ oz de yogur natural", "3 huevos de gallinas camperas", "Harina normal 150g / 5½ oz", "¼ cucharadita de sal marina fina", "2 cucharaditas de polvo de hornear", "175g / 6oz de azúcar en polvo de oro", "100g / 3½oz de coco desecado", "Frambuesas 75g / 2½ oz", "75 g / 2½ oz de arándanos", "100g / 3½oz de almendras en copos"], "method": ["Precalentar el horno a 180 ° C / 160 ° C Ventilador / Gas 6. Ligeramente unte mantequilla y cubra una lata cuadrada de 23 cm / 9 pulgadas con papel de hornear.", "Para la base de galletas, poner la harina, la mantequilla y la sal en un procesador de alimentos y pulsar hasta obtener una miga fina. Agregue el coco y el azúcar y vuelva a pulsar. Batir la yema de huevo con la vainilla y 1-2 cucharadas de agua fría y agregar al procesador de alimentos con el motor en marcha, para hacer una masa suave. Presione en la lata preparada y aplanar con la parte posterior de una cuchara, empujando la mezcla de manera uniforme en todas las esquinas. Pinchar la base con un tenedor, luego cubrir y enfriar en la nevera durante 10 minutos.", "Mientras tanto, para la mermelada, ponga las frambuesas y el azúcar en una cacerola y caliente hasta que el azúcar se haya disuelto. Llevar a ebullición durante 5 minutos o hasta que llegue al punto de ajuste.", "Hornee la base de galletas por 15 minutos, o hasta que esté pálida dorada. Dejar enfriar durante 2 minutos y luego extender con el atasco.", "Para la torta, derrita la mantequilla en una cacerola de fondo grueso. Retire del fuego y use un tenedor para batir en el yogur, luego los huevos y la clara de huevo reservada.", "Tamiza la harina, la sal y el polvo de hornear en un tazón grande y agrega el azúcar y el coco.", "Vierta los ingredientes de la torta húmeda en los ingredientes secos y mezcle bien. Vierta sobre la base de mermelada, nivele la parte superior con la parte posterior de una cuchara y espolvoree con las bayas y las almendras en copos. Hornee durante 40-45 minutos, o hasta que un pincho insertado en el centro salga limpio. Dejar enfriar en la lata, luego girar y cortar en barras."], "url": "www_bbc_co_uk_food_recipes_summer_berry_shortbread_93106", "title": "Torta de torta de baya de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_berry_shortbread_93106_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de moras frescas", "225g / 8oz de frambuesas frescas", "225 g / 8 oz de arándanos frescos", "1 plátano mediano recién maduro, roto en pedazos", "150ml / ¼ de pinta de yogur natural natural", "150ml / ¼ litro de leche", "1 cucharada de azúcar glas (opcional)"], "method": ["Mida todos los ingredientes en un procesador de alimentos y gírelo hasta que quede suave. Alternativamente, use una licuadora de mano.", "Verter en un vaso alto y fresco y disfrutar."], "url": "www_bbc_co_uk_food_recipes_summer_fruit_smoothie_22742", "title": "Batido de frutas de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_fruit_smoothie_22742_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de crema pastelera en polvo", "60g / 2¼ oz de azúcar", "2,4 litros / 3 pintas 4 fl oz de leche", "5 x 135g / 4¾ oz de gelatina de fresa", "Rollo suizo con mermelada ready-made de 850 g / 1 libra 14 oz", "Fresas de 1.5kg / 3lb 5oz, mondadas y partidas por la mitad", "50g / 1¾ onza de almendras en copos", "1.5 litros / 2 pintas 14 fl oz crema doble"], "method": ["Coloque el polvo de crema y el azúcar en un tazón grande y agregue un poco de la leche, revuelva hasta que tenga una pasta suave.", "Caliente la leche restante en una cacerola grande hasta que casi alcance el punto de ebullición y vierta la mezcla de crema en polvo.", "Revuelva continuamente a fuego lento hasta que la crema se espese y luego deje enfriar.", "Para hacer la gelatina, siga las instrucciones del paquete, pero no la coloque en la nevera para prepararla.", "Corte los rollos suizos en rodajas iguales y colóquelos sobre las bases de dos bandejas grandes para hornear.", "Esparce las fresas sobre la esponja. Vierta la gelatina preparada sobre la fruta. Cubra las bandejas con film transparente y déjelo reposar en la nevera durante aproximadamente una hora y media.", "Cuando la crema se haya enfriado, vierta suavemente encima de la gelatina.", "Cubra con una película adhesiva y devuelva las bandejas a la nevera durante otros 30 minutos o hasta que la crema esté ligeramente colocada.", "Para el aderezo, tueste ligeramente las almendras en una sartén seca a fuego lento durante 2-3 minutos, o hasta que estén doradas, manteniendo las almendras moviéndose alrededor de la sartén con frecuencia para evitar que se quemen. Dejar de lado para enfriar.", "Batir la crema hasta que forme picos suaves. Pon la crema batida sobre la crema pastelera. Esparce las almendras en la parte superior, cúbrelas y regresa a la nevera hasta que estén listas para servir."], "url": "www_bbc_co_uk_food_recipes_summer_berry_trifle_59969", "title": "Bagatela de verano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175 g / 6¼ oz de mantequilla sin sal", "175g / 6¼ oz de azúcar en polvo", "175g / 6¼ oz de harina común", "pellizcar canela molida", "200g / 7¼ oz de azúcar glasé", "50ml / 1¾fl oz de brandy", "300ml / 10½fl oz de vino tinto", "400 g / 14¼ oz de fresas", "Crema doble de 500ml / 17½ fl oz", "100g / 3½oz de azúcar glas, cernida", "200ml / 7¼fl oz de leche de coco", "100 g / 4 oz moras", "Frambuesas de 150g / 5¼ oz", "150 g / 5¼ oz de arándanos", "6 ramitas de grosellas rojas", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja para hornear con papel antigrasa o pergamino para hornear.", "Para la cobertura de crumble, frote la mantequilla, el azúcar y la harina en un bol hasta que la mezcla se asemeje a finas migas de pan.", "Espolvorea la mezcla en la bandeja de horno forrada, luego hornea en el horno durante 12-15 minutos, o hasta que esté crujiente y dorado. Retirar del horno y reservar para enfriar.", "Para la salsa, caliente el azúcar, el brandy y el vino en una sartén hasta que el azúcar se haya disuelto y la mezcla se parezca al jarabe. Dejar de lado para enfriar.", "Mezcle las fresas con un puré en un procesador de alimentos. Cuele las fresas mezcladas a través de un colador, luego doble el puré colado en el jarabe hasta que se combinen.", "Para la crema de coco, bata la crema doble y el azúcar glas en un tazón grande hasta que se espese un poco.", "Agregue la leche de coco y continúe batiendo hasta que se formen picos suaves cuando se quite la batidora. Agregue azúcar glasé adicional, al gusto, para endulzar la mezcla.", "Para servir, coloque una mezcla de moras, frambuesas y arándanos en el centro de cada uno de los seis platos que sirven. Coloque la salsa encima, luego la crema de coco. Espolvorea sobre el crumble de canela. Adorne con las ramitas de grosellas y el polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_summer_fruit_soup_with_97459", "title": "Sopa de frutas de verano con crema de coco y cobertura de crumble", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos", "250 g / 9 oz de azúcar en polvo", "Harina de auto aumento 250g / 9 oz", "100 g / 3½ oz de mantequilla, derretida y enfriada, más extra para engrasar", "Crema doble de 900ml / 1½ pintas", "Frambuesas 400 g / 14 oz", "300 g / 10½ oz de arándanos", "Moras 300g / 10½ oz", "azúcar en polvo, para quitar el polvo"], "method": ["Esta receta se inicia mejor el día antes de que desee servirla. Necesitará dos latas redondas de pastel de 23 cm / 9 pulgadas con lados de 5 cm / 2 pulgadas. Precaliente el horno a 180C / 160C Fan / Gas 4, luego engrase las latas con mantequilla y forre las bases con papel de hornear.", "Para hacer las esponjas, coloque cuatro de los huevos y la mitad del azúcar impalpable en un tazón y, con un batidor eléctrico o un mezclador de alimentos, bata hasta que estén gruesos, pálidos y esponjosos. Cuando levante el batidor, la masa que cae debe dejar un rastro en la mezcla de abajo.", "Tamiza la mitad de la harina en la mezcla y dóblala suavemente para combinarla. Rocíe la mitad de la mantequilla derretida enfriada en el exterior de la mezcla y dóblela con cuidado antes de verterla en una de las latas de torta preparadas.", "Para hacer la segunda esponja, simplemente repita los pasos dos y tres, y vierta en la segunda lata.", "Hornee ambas esponjas al mismo tiempo en el horno durante aproximadamente 30 minutos, o hasta que estén pálidas doradas, firmes en el centro y encogiéndose lejos de los lados de la lata. Si no está horneando en el mismo estante, es posible que tenga que cambiar las latas a la mitad para asegurarse de obtener una cocción pareja.", "Retire del horno y, después de 10 minutos, suelte las latas y déjelas a un lado para que se enfríen completamente en una rejilla. Retire el papel de revestimiento y, con un cuchillo de pan, corte cada esponja por la mitad horizontalmente para dar cuatro capas en total.", "Batir la crema en un bol hasta que forme picos firmes. Reserve 4 cucharadas para decorar la parte superior de la torta, y luego divida la crema batida restante en tres. Divida una mezcla de las tres bayas diferentes en tres pilas, reservando un puñado de cada una para la parte superior de la torta.", "Coloque una capa de esponja en un plato grande, luego unte con un tercio de la crema batida, esparza más de un tercio de las bayas mezcladas, asegurándose de que toquen el borde de la crema, para que puedan verse. Agregue otra capa de esponja en la parte superior y repita hasta que tenga tres capas, coronadas con una capa final de esponja.", "Para decorar la parte superior, extiende la crema reservada en un pequeño círculo en el centro de la esponja y coloca las bayas restantes en la parte superior. Cubre cuidadosamente con film transparente y colócalo en la nevera para que se asiente - durante unas horas, pero de la noche a la mañana si es posible. Cuando esté listo para servir, espolvoree el glaseado con azúcar glas y córtelo en rodajas."], "url": "www_bbc_co_uk_food_recipes_summer_party_gateau_61495", "title": "Fiesta de pastel de verano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_party_gateau_61495_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 4 oz bayas de verano mixtas: arándanos, frambuesas, moras, grosellas rojas, grosellas negras", "250 g / 9 oz de azúcar en polvo", "1 pan blanco grande sin cortar en rebanadas o pan blanco de rebanadas gruesas (preferiblemente ligeramente rancio)"], "method": ["Alinee una lata de pan de 450 g / 1 lb con una capa doble de película adhesiva.", "Prepare la fruta quitando las hojas y los tallos. Coloque los arándanos, las grosellas rojas y las grosellas negras en una sartén con el azúcar y un par de cucharadas de agua y deje que hiervan. Cocine por 2-3 minutos, o hasta que las bayas se hayan ablandado y estallen (no lo cocine en exceso). No es necesario que cocines las frambuesas o las moras, así que solo agrégalas a la sartén al final.", "Con un cuchillo afilado, corte las cortezas de todos los lados del pan, luego corte el pan en rebanadas de espesor medio a lo largo del pan, para que tenga rebanadas largas en lugar de rebanadas cuadradas.", "Coloque una rebanada de pan en la base de la lata, recortando para que quepa. Coloque una rebanada de pan a cada lado del interior de la lata y corte las rebanadas para que quepan en ambos extremos de la lata.", "Ponga un poco de jugo de las bayas cocidas en la base para asegurarse de que todo el pan esté bien empapado en jugo. Agregue la fruta gradualmente, asegurándose de que el pan absorba todos los jugos y se vuelva rojo. Cuando la lata esté llena de fruta, cubra con pan otra rebanada de pan para sellarla. Cuchara sobre un par de cucharadas de jugo de las bayas que quedan en la sartén. Debería tener aproximadamente la mitad de la cantidad de restos de fruta, lo cual es agradable para servir junto a cada rebanada.", "Cubra la parte superior con película adhesiva y coloque el pudín en la nevera durante la noche. Coloque un peso, como una lata de frijoles horneados, encima del budín para presionar la mezcla hacia abajo, esto asegurará que la mezcla se empape en el pan y que el pudín sea lo suficientemente firme para cortar.", "Para salir, retire la película adhesiva, luego voltee el pudín sobre un plato y quite la película adhesiva. Cortar en rodajas y servir con las bayas y el jugo restante."], "url": "www_bbc_co_uk_food_recipes_summer_pudding_loaf_92270", "title": "Pan de pudín de verano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/summer_pudding_loaf_92270_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de frambuesas frescas", "350 g / 12 oz zarzamoras", "1 cucharada de albahaca finamente triturada", "aceite vegetal, para engrasar", "6 rebanadas finas de pan blanco", "4 cucharadas de crema coagulada", "100 g / 3½ oz de azúcar en polvo, para decoración"], "method": ["Reserve 100 g / 3½ oz de frambuesas y moras para decorar. Mezcle las bayas restantes. Frote 200 g / 7 oz de las bayas restantes con un tenedor y revuelva a través de la albahaca. Dejar de lado.", "Aplastar las bayas restantes y pasar a través de un tamiz fino. Reserve el jugo y deseche la pulpa.", "Engrase 2 moldes dariole con un poco de aceite y alinee con una película adhesiva (deje suficiente saliente para cubrir la parte superior más adelante).", "Retire las cortezas del pan y deseche. Recorta 2 círculos para que quepan en el fondo de los moldes y 2 círculos para que quepan en la parte superior de los moldes. Corta el resto en rectángulos para alinear los lados de los moldes.", "Sumerja los pequeños círculos de pan en el jugo reservado y empuje hacia el fondo de los moldes, sumerja los rectángulos en el jugo y presione firmemente alrededor de los bordes, teniendo cuidado de no dejar huecos.", "Llene la mitad de los moldes con las bayas trituradas, agregue una cucharada de crema y cubra con las bayas restantes. Sumerja el círculo más grande en el jugo y colóquelo en la parte superior. Cubra la película adherida y presione firmemente. Enfriar hasta que esté listo para servir.", "Para hacer un caramelo, caliente el azúcar en una sartén grande antiadherente hasta que se dore. Use una cuchara para rociar rápidamente el caramelo sobre un acero para afilar cuchillos (PRECAUCIÓN: el azúcar se calienta mucho). Junta las hebras de caramelo para formar una bola de azúcar. Repita para hacer una segunda bola de azúcar.", "Saque los budines de verano de los moldes, quite la película adhesiva y colóquelos en los platos. Cuchara sobre el jugo restante, decorar con las bayas reservadas y servir con una cucharada de crema coagulada y una bola de azúcar."], "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_89427", "title": "Pudín de verano con crema coagulada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frambuesas de 450g / 1lb", "350 g / 12oz de bayas mezcladas", "150 g / 5½ oz de azúcar en polvo", "un pequeño vaso de frambuesa de jerez (licor de frambuesa)", "botón de mantequilla", "8-10 rebanadas de pan de chocolate blanco y frambuesa, cortezas eliminadas (u otro pan dulce)", "100g / 3½ oz de chocolate blanco", "250ml / 9fl oz de crema doble, ligeramente azotada", "250g / 9oz de mascarpone", "1 cucharada de azúcar glasé, más extra para decorar"], "method": ["Combine la fruta, el azúcar y el licor en una olla y cocine suavemente durante 5-8 minutos, o hasta que el líquido se haya reducido un poco. Retire del fuego.", "Ligeramente un cuenco con leche de 1 litro / 1¾ de mantequilla.", "Alinee el cuenco con cuidado con la mayor parte del pan con trozos pequeños para cubrir cualquier orificio en el costado o en el fondo, luego vierta casi toda la fruta (deje un poquito a un lado para decorar). Cubra con una tapa de pan y luego use un plato o tapa para presionar firmemente (podría usar dos platos para obtener algo de peso). Dejar en la nevera durante la noche.", "Derrita el chocolate blanco suavemente en un baño maría o en un recipiente suspendido sobre una olla de agua hirviendo a fuego lento (no permita que el fondo del recipiente toque el agua). Deje que se enfríe un poco y luego agregue la crema. Agregue el mascarpone y mezcle el azúcar glas.", "Convierta el pudín en un plato, rocíe con la fruta sobrante y sirva con la crema de chocolate blanco."], "url": "www_bbc_co_uk_food_recipes_summer_pudding_with_98588", "title": "Pudín de verano con bayas y crema de chocolate blanco", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 calabacín para bebé, recortado, en juliana", "2 zanahorias, peladas, en juliana", "3 tallos de apio, recortados, en juliana", "1 pimiento rojo, sin semillas, en juliana", "1 pimiento amarillo, sin semillas, en juliana", "½ remolacha (preferiblemente Chioggia), pelada, en juliana", "2 pepinos de bebé, recortados, en juliana", "1 baby sweetcorn, julienned", "2 cebolletas, cortadas, en rodajas finas", "algunas ramitas de cilantro fresco, finamente picado", "sal y pimienta negra recién molida", "1 diente de ajo, aplastado", "1 chile rojo, sin semillas, finamente picado", "1 cucharada de salsa de pescado tailandesa", "1 cucharada de vinagre de vino de arroz", "1 cucharadita de azúcar demerara", "2 cucharadas de jugo de limón recién exprimido", "1 cucharada de aceite de oliva extra virgen", "500ml / 18fl oz de aceite vegetal", "2-3 calabacines grandes, cortados, en rodajas finas usando una mandolina", "1-2 cucharadas de azúcar demerara", "1 cebolla pequeña, finamente cortada usando una mandolina"], "method": ["Para la ensalada, mezcle todas las verduras y hierbas en un recipiente y sazone con sal y pimienta.", "Para el aderezo, mezcle todos los ingredientes con 1 cucharada de agua hasta que el azúcar se disuelva.", "Rocíe el aderezo sobre la ensalada y mezcle para cubrir las verduras.", "Caliente el aceite en una cacerola profunda de fondo grueso a 135 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvoree las rodajas de calabacín con azúcar demerara y fría, en lotes si es necesario, durante 1-2 minutos, o hasta que estén doradas por cada lado. Transfiera al papel de cocina para drenar.", "Con cuidado, baje las rodajas de cebolla en el aceite caliente y fría por 1 minuto, o hasta que estén crujientes y doradas. Transfiera al papel de cocina para drenar. Espolvorea con sal.", "Para servir, cubrir cada trozo de calabacín frito con una cucharadita de ensalada, luego cubrir la ensalada con una pizca de las rodajas de cebolla frita."], "url": "www_bbc_co_uk_food_recipes_summer_salad_with_72489", "title": "Canapés de ensalada de verano con aliño de estilo asiático", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]