[{"ingredients": ["1 huevo de gallinas camperas", "4 yemas de huevo de gallinas camperas", "180g / 6oz 00 harina de pasta, más extra para espolvorear", "1 cucharada de aceite de oliva", "aceite de colza, para freír", "200g / 7oz de panceta, cortada en cubos de 1cm / ½ en", "1 calabaza pequeña, pelada y cortada en cubos de 1cm / ½ en cubitos", "1 cebolla roja, finamente picada", "2 dientes de ajo, finamente picados", "1 chile rojo grande, finamente picado", "2 cucharadas de salvia fresca finamente picada", "Queso de cabra de 250 g / 9 oz, sin corteza", "sal y pimienta negra recién molida", "100ml / 3½ fl oz crema doble", "150g / 5½oz de hojas pequeñas de espinaca, lavadas y escurridas", "150g / 5½oz de guisantes recién preparados, cocinados y refrescados en agua fría", "150 g / 5½oz de habas recientemente envasadas, cocinadas, peladas y refrescadas en agua fría", "½ limón, solo jugo", "aceite de colza virgen extra"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Para hacer la pasta, coloque todos los ingredientes en un recipiente y, con las manos, mezcle suavemente hasta que formen una masa. Envuelva la película adhesiva y refrigere durante al menos 15 minutos.", "Para el relleno, caliente un poco de aceite en una sartén antiadherente y agregue la panceta. Cocine a fuego medio durante 2-3 minutos, o hasta que la grasa de panceta comience a derretirse, y luego agregue la calabaza. Cocine por un minuto más y luego agregue la cebolla, el ajo, el chile y la salvia. Cubra la olla con una tapa y cocine durante 8-10 minutos, o hasta que la calabaza esté tierna. Drene cualquier exceso de aceite de la sartén. Cubra y refrigere.", "Retire la masa de pasta del refrigerador y córtela a la mitad. Enrolla la masa en 2 hojas usando una máquina de pasta. Harina una superficie de trabajo y los rodillos de la máquina de pasta. Aplanar la masa en un rectángulo. Establezca los rodillos en su configuración más amplia. Ruede la pasta a través de los rodillos. Reduzca los rodillos cambiando la configuración de la máquina por una muesca, luego pase la pasta enrollada a través de los rodillos nuevamente. Polvo la pasta enrollada con harina. Repita el proceso hasta que haya pasado a través de la configuración más estrecha de la máquina.", "Blanquee cada hoja durante 1 minuto en agua hirviendo con sal, antes de refrescar en agua fría. Retirar del agua y secar con una toalla de té.", "Sobre una superficie limpia y plana, coloque dos pedazos grandes de película adhesiva uno al lado del otro con un borde corto cerca de usted, superponiendo cada longitud para que el área de superficie sea el doble del tamaño combinado de las dos hojas de pasta. Coloque las hojas de pasta en la película adhesiva en la dirección opuesta, superponiéndose en el medio para hacer una hoja grande.", "Combine el relleno con el queso y sazone con sal y pimienta. Cuidadosamente, distribuya la mezcla de manera uniforme sobre la pasta, dejando un espacio de 2cm / 1in en la parte inferior y un espacio de 4-5cm / 1½-2in en la parte superior. Usando la película adhesiva debajo de la pasta para ayudarlo, enrolle la pasta como si fuera un rollo suizo, manteniendo apretado el rollo. Una vez enrollado, envuelva la película adhesiva alrededor de la pasta y coloque los extremos debajo del rollo para sellar.", "Caliente una sartén antiadherente a fuego medio con un poco de aceite de colza. Con cuidado, corte la pasta rotollo en cuatro rodajas gruesas (3-4cm / 1½-1¾in), dejando la película adherida. Ligeramente la harina de los lados cortados, retire la película adhesiva y cuidadosamente coloque las piezas en la sartén. Colorea a cada lado hasta que se doren, luego transfiéralo al horno por 5 minutos, para terminar.", "Para la salsa de crema, en una cacerola mediana, llevar la crema a ebullición y luego agregar la espinaca, los guisantes y las habas. Sazone con sal, pimienta y un chorrito de jugo de limón.", "Divida la salsa de crema entre cuatro tazones para servir y coloque el rotolo encima. Rocíe un poco de aceite de colza virgen extra en la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_butternut_19608", "title": "Queso de cabra, calabaza, panceta y sabio rotolo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_butternut_19608_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas digestivas de 175g / 6oz", "85g / 3oz de mantequilla", "300g / 10½oz de queso de cabra suave", "125 g / 4½ oz de miel líquida, más 4 cucharadas para servir", "1 vaina de vainilla, solo semillas", "½ cucharadita de canela molida", "1 cucharadita de especias mixtas", "pellizcar nuez moscada recién molida", "175g / 6oz de crema fresca", "3 huevos de gallinas camperas, golpeados", "Ruibarbo de 700 g / 1 lb 9 oz, cortado en piezas de 3-4 cm / 1½ pulgadas", "400 g / 14 oz de azúcar en polvo", "Nueces 100g / 3½oz, rotas en pedazos", "100g / 3½oz de avellanas, picadas"], "method": ["Precalentar el horno 170C / 150C Fan / Gas 3½. Pon los bizcochos en un procesador de alimentos y blitz a finas migas.", "Derretir la mantequilla en una olla pequeña. Agregue las migas de galletas y mezcle. Incline en una lata agria de fondo suelto de 18-20 cm / 7-8 pulgadas y presione hacia abajo. Cubra y ponga en la nevera.", "Coloque el queso de cabra, la miel, las semillas de vainilla, las especias, la crema fresca y los huevos en un tazón grande y mezcle.", "Vierta la mezcla en la base de la galleta y alise con una espátula. Hornee durante 40 minutos, o hasta que el relleno esté listo, pero todavía hay un poco de bamboleo. Deje que se enfríe completamente antes de colocar en la nevera durante al menos 4 horas.", "Cuando esté listo para servir la tarta de queso, precaliente el horno a 160C / 140C Fan / Gas 3. Mezcle el ruibarbo con el azúcar, cubra con 400ml / 14fl de agua y hornee durante 10 minutos.", "Caliente una sartén pequeña a fuego medio y cocine la miel y las nueces durante 2-3 minutos.", "Retire la tarta de queso de la lata y corte en rodajas. Esparza las nueces sobre la parte superior y sirva con el ruibarbo escalfado."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_cheesecake_54122", "title": "Tarta de queso de cabra con ruibarbo escalfado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Gelatina de grosella negra 250 g / 9 oz", "250ml / 9fl oz de vinagre de vino tinto", "4 dientes", "75g / 2¾oz de mostaza Dijon", "500g / 1lb 2oz de sal marina fina", "3 huevos de gallinas camperas, solo para blancos", "1 apio nabo medio", "Queso de cabra suave 200 g / 7 oz, desmenuzado", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "4 rebanadas de pan de brioche, 1cm / ½ pulgada de espesor", "Queso de cabra firme 110 g / 4 oz, desmenuzado", "1 puñado de lechuga rizada", "1 puñado de lechuga", "1 cucharadita de vinagre", "3 cucharaditas de aceite de oliva", "½ limón, solo jugo"], "method": ["Para el aderezo, coloque la mermelada de grosella, el vinagre y los clavos de olor en una olla y cocine hasta que se reduzca su volumen hasta un esmalte lo suficientemente grueso como para cubrir la parte posterior de una cuchara.", "Pase la mezcla a través de un colador en un recipiente limpio, mezcle con la mostaza y déjela a un lado.", "Para la ensalada, precaliente el horno a 200C / 400F / Gas 6.", "Batir las claras de huevo hasta picos suaves y luego doblar en la sal.", "Coloque una cucharada en una bandeja para hornear, coloque el apionabo encima y cubra con el resto de la sal.", "Coloque en el horno y hornee durante 45 minutos y luego déjelo reposar durante cinco minutos.", "Romper la capa de huevo y eliminar el apionabo, descartando la sal.", "Pelar el apionabo y cortar en rodajas finas, luego sellar los discos con una cuchilla y reservar.", "Coloque el queso de cabra desmenuzado en un tazón con la crema doble y látigo hasta que se suavice y se combine.", "Sazonar con un poco de sal y mucha pimienta negra.", "Tueste el brioche hasta que se coloree un color marrón dorado claro.", "Mezcle las hojas de lechuga con el queso firme de cabra en un tazón.", "Batir el vinagre, el aceite de oliva y el jugo de limón juntos y luego, vestir las hojas de ensalada ligeramente con el aderezo.", "Para servir, coloque los discos de apio nabo en el aderezo de grosella roja y revuelva para combinar. Coloque algunos discos en el centro del plato.", "Cubra con la tostada brioche y una quenelle de la crema y la mezcla de queso de cabra.", "Termine con una pequeña torre de ensalada y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_on_brioche_20753", "title": "Queso de cabra en brioche con apio a la sal y aderezo de grosella roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de queso de cabra suave", "sal y pimienta negra recién molida", "1 cucharada de menta fresca picada", "1 cucharadita de hojuelas de chile", "1 huevo de gallinas camperas, golpeado", "6 bollos", "1 cucharada de semillas de sésamo", "1-2 cucharadas de miel", "Chutney de mango a 200 g / 7 oz", "1 papaya, pelada, sin semillas, carne picada", "1 cucharada de menta recién picada", "½ naranja, solo jugo", "1 cucharada de cilantro fresco picado", "ensalada de bebé deja para servir"], "method": ["Precalentar la parrilla a mediano.", "Batir el queso de cabra con la sal y la pimienta negra recién molida en un bol. Agregue la menta fresca, los copos de chile y el huevo, y mezcle hasta que estén bien combinados.", "Tueste los bollos debajo de la parrilla hasta que se doren, luego extiéndalos con la mezcla de queso. Vuelva a colocar los bollos debajo de la parrilla y cocine hasta que el queso esté burbujeante y dorado pálido. Retirar de la parrilla, espolvorear con las semillas de sésamo y rociar sobre la miel.", "Mientras tanto, para la mermelada, mezcle la chutney de mango, la papaya, la menta, el jugo de naranja y el cilantro hasta que estén bien combinados.", "Sirva los bollos en la parte superior de una ensalada de hojas de bebé con la mermelada de mango."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_crumpets_25508", "title": "Bocadillos de queso de cabra con mermelada de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "500g / 1lb 2oz de queso de cabra", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "100g / 3½oz de pan rallado", "400g / 14oz de guisantes frescos", "50g / 1¾oz de brotes de guisantes", "3 rábanos de desayuno, finamente cortados en una mandolina", "puñado de hojas de menta, picadas", "2 limones, ralladura y jugo", "aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Calienta el aceite en una freidora a 180 ° C / 350 ° F o calienta el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se vierte en el aceite. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Suavice un poco el queso de cabra golpeándolo con una cuchara. Dale forma de quenelles usando dos cucharadas y enrollalas en harina.", "Mézclalos en el huevo batido y luego arrástralos en pan rallado para cubrirlos.", "Freír a fuego lento durante unos minutos o hasta que las migas estén doradas.", "Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina.", "Para la ensalada, cocine los guisantes en una sartén con agua hirviendo durante unos 30 segundos, lo suficiente para blanquearlos. (También puede incluir algunas vainas completas si lo desea). Escurra y coloque en un recipiente con agua helada.", "Refresque los brotes de guisantes sumergiéndolos en agua fría. Escurrirlos y poner en un recipiente junto con los guisantes secos, el rábano, la menta y la ralladura de limón.", "En una jarra, mezcle un poco de aceite de oliva con un gran chorrito de jugo de limón y mezcle con sal y pimienta para hacer un aderezo.", "Para servir, viste la ensalada y coloca las quenelles de queso de cabra en la parte superior."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_quenelles_85303", "title": "Quesos de cabra quenelles con ensalada de guisantes, menta y rábano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_quenelles_85303_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente rebanada", "4 cabezas de radicchio, recortadas y cortadas en cuñas, manteniendo la raíz así se mantiene unida", "2 melocotones, deshuesados ​​y cortados en cuñas delgadas", "puñado de hojas de ensalada verde, como el berro o cohete", "1 cucharada de avellanas tostadas", "100g / 3½oz de queso fresco de cabra, desmenuzado en trozos", "1 chile rojo pequeño, finamente picado", "puñado de hojas de menta fresca", "1 cucharada de aceite de oliva", "½ cucharadita de mostaza Dijon", "¼ cucharadita de miel", "1 cucharadita de vinagre de sidra"], "method": ["Para hacer la ensalada, coloque la cebolla roja en un recipiente con agua con sal y fría, y déjela reposar durante unos minutos para suavizar el sabor. Escurrir y apartar.", "Precalienta una barbacoa o parrilla a altura y cocina las rodajas de achicoria y durazno durante 2-3 minutos por cada lado hasta que estén ligeramente marchitas y carbonizadas.", "Para hacer el aderezo, mezcle todos los ingredientes en un tazón pequeño y déjelos a un lado.", "Para ensamblar, esparza las hojas, achicoria cocida, melocotones, cebolla, avellanas y queso de cabra en un plato grande. Adorne con el chile picado y las hojas de menta fresca. Rocíe con el aderezo justo antes de servir. Sirve con otros platos de barbacoa."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_peach_and_25629", "title": "Ensalada de queso de cabra, melocotón y radicchio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_peach_and_25629_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 cebollas grandes, en rodajas", "1 cucharada de azúcar", "1 cucharada de vinagre balsámico", "sal marina y pimienta negra recién molida", "3 pimientos rojos", "aceite de oliva", "Hojaldre de mantequilla de 325g / 11½oz", "2 x 150 g / 5½ oz tinas de queso de cabra suave", "2 cucharadas de tomillo fresco de hojas anchas", "1 huevo, golpeado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja de horno pesada en el horno para calentar.", "Para hacer la mermelada de cebolla, caliente el aceite en una sartén antiadherente a fuego alto. Agregue la cebolla y fría por unos minutos. Espolvoree el azúcar y el vinagre y sazone con sal marina y pimienta negra recién molida. Cubra y baje el fuego por unos 20 minutos o hasta que esté suave. Si la mezcla se ve húmeda, retire la tapa y deje que el líquido se evapore. Deja la mermelada a un lado para enfriar.", "Para las galettes, corte cada pimiento por la mitad, quite el tallo y las semillas y coloque el lado cortado en otra bandeja para hornear. Rocíe con un poco de aceite y tueste en el horno por unos 20 minutos o hasta que las pieles estén negras. Transfiera a una bolsa de plástico y selle. Cuando esté frío, despegue la piel y corte en tiras finas.", "Ruede la masa sobre una superficie de trabajo enharinada en un rectángulo y recorte los bordes. Corta la masa por la mitad y pincha con un tenedor. Transfiera a un trozo grande de papel resistente a la grasa y distribuya el queso de cabra en cada pedazo de masa, dejando un borde alrededor del borde. Cuchara sobre la mermelada de cebolla, esparza sobre el jugo y coloca las tiras de pimiento en la parte superior.", "Cepille el borde de la masa con el huevo batido y hornee en el horno durante 20-25 minutos, o hasta que la masa esté crujiente."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_pepper_and_18098", "title": "Queso de cabra, pimienta y galettes de tomillo con mermelada de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de codorniz", "500g / 1lb 2oz '00' de harina, más extra para quitar el polvo", "4 yemas de huevo de gallinas camperas", "2 cucharadas de aceite de oliva, más extra para cocinar", "1 huevo de gallinas camperas, golpeado", "225g / 8oz de queso de cabra suave, roto", "3 cucharadas de aceite de oliva", "pellizcar el comino molido", "pizca de cúrcuma molida", "1 cabeza de coliflor, rota en florecillas", "1 cabeza de coliflor morada, rota en florecillas", "1 ramita de tomillo", "1 hoja de laurel", "sal y pimienta negra recién molida", "1 cucharadita de mostaza Dijon", "1 cucharadita de vinagre de vino blanco", "3 cucharadas de aceite de colza virgen extra", "8 alcaparras, más o menos picadas", "20 g / ¾oz de pasas doradas, empapadas en agua tibia y escurridas", "½ cucharada de perejil de flatillo finamente picado.", "hojas y flores de capuchina, para adornar", "hojas de berro, para adornar"], "method": ["Cocine los huevos de codorniz en agua hirviendo con sal durante 3 minutos. Sumérgete en un recipiente con agua helada durante 3 minutos. Pelar y reservar.", "Para hacer los raviolis, coloque la harina sobre una superficie de trabajo y haga un pozo en el centro. Agregue las yemas de huevo y el aceite al pozo e incorpore gradualmente la harina para hacer una masa. Amasar hasta que quede suave y envolver en una película adhesiva. Permita descansar por 1 hora.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para hacer la coliflor, mezcle el aceite con el comino, la cúrcuma, la sal y la pimienta, luego frote la mezcla por toda la coliflor. Coloque los floretes en una gran pieza cuadrada de papel de cocina. Agregue el tomillo, la bahía y 50 ml / 2 fl oz de agua.", "Dobla la lámina en un paquete doblando las longitudes largas juntas y arrugando los extremos. Hornea de 20 a 25 minutos o hasta que la coliflor esté recién hecha. Abra el paquete y permita que la coliflor se enfríe, reservando los jugos de cocción.", "Regresa a los ravioles. Sobre una superficie de trabajo ligeramente enharinada, separe la pasta en dos pedazos y enrolle cada pieza en un rectángulo muy fino. Cepille un rectángulo con el huevo batido.", "Esparza el queso sobre la hoja de pasta recubierta de huevo en cuatro montones, dejando espacio igual entre cada montón. Cubra con la segunda hoja de pasta y presione hacia abajo los bordes y entre el queso para sellar. Corta cuatro raviolis con un cortador acanalado.", "Llevar una sartén con agua salada con un chorro de aceite a ebullición y cocinar los raviolis durante 2 minutos, hasta que todo esté seco.", "Para hacer el aderezo, mezcle la mostaza, el vinagre, el aceite, las alcaparras, la sal, la pimienta y un chorrito de agua. Agregue las sultanas y el perejil.", "Sirva los raviolis con la coliflor, con aderezo rociado, adornado con huevos, hojas de capuchina y flores y hojas de berros."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_ravioli_25344", "title": "Ravioles de queso de cabra, coliflor especiada y huevos de codorniz con una alcaparra y aderezo de sultana", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para amasar", "75g / 2½oz de mantequilla fría, cortada en cubos", "75 g / 2½oz manteca de cerdo refrigerada o vegetal, cortada en cubos", "sal", "1-2 cucharadas de aceite de colza o aceite vegetal", "85g / 3oz de mantequilla sin sal", "450 g / 1 libra de cebollas rojas, finamente rebanadas", "sal y pimienta negra recién molida", "1 cucharada de azúcar morena suave, o más al gusto", "1 cucharada de semillas de alcaravea, tostadas en una sartén seca", "aproximadamente 80ml / 2¾fl oz de vinagre balsámico, al gusto", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas", "Crema doble de 200 ml / 7 fl oz", "200g / 7oz de queso de cabra, en rodajas", "sal y pimienta negra recién molida", "estragón fresco y cilantro, use solo hojas, para adornar (opcional)"], "method": ["Para hacer la masa de copos, coloque la harina y una pizca de sal en un procesador de alimentos. Agregue la mantequilla y la manteca de cerdo, y mezcle a la consistencia de migajas de pan fino. Transfiera esto a un tazón para mezclar. (Si no tiene un procesador de alimentos, mezcle la manteca y la manteca de cerdo en la harina con las yemas de los dedos en un tazón). Agregue 3-4 cucharadas de agua fría, lo suficiente como para poder unir la mezcla una bola.", "Dé vuelta a una superficie de trabajo ligeramente enharinada y amasar brevemente hasta que quede suave. Estirar la masa a un tamaño que forrará la base y los lados de una lata de flan con fondo suelto de 25 cm / 10 pulgadas. Presiona bien la masa en el pliegue entre la base y los lados, pincha la base de la pasta con un tenedor y colócala en la nevera para que se enfríe durante 30 minutos.", "Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Alinee la caja para tarta con papel para hornear y llénela con alubias para hornear. Ciega a fuego lento durante 15 minutos, luego retira los frijoles y el pergamino y devuelve la masa al horno por otros 10 minutos o hasta que la base esté dorada. Retire del horno y reserve.", "Para hacer la mermelada de cebolla, caliente una sartén grande, agregue el aceite y la mantequilla y caliente hasta que empiece a formar espuma. Agregue las cebollas, sazone con sal y pimienta y cocine durante cinco minutos a fuego medio a bajo, revolviendo regularmente. Agregue las semillas de azúcar y alcaravea y cubra la sartén, luego cocine por otros 10-15 minutos hasta que los jugos hayan salido de las cebollas. Pruebe y agregue más azúcar si lo desea.", "Destape la sartén e incremente el fuego, y continúe cocinando durante aproximadamente 20 minutos para reducir todos los jugos. Mientras se reducen los jugos, precaliente el horno a 200C / 400F / Gas 6.", "Cuando la mezcla alcance la consistencia de la mermelada, retire la sartén del fuego y agregue el vinagre. Ajuste el condimento al gusto.", "Para hacer el relleno, bata los huevos con la crema en una jarra o tazón. Mezcle la mermelada de cebolla y vierta en la caja de pastelería ciega. Arregle el queso de cabra encima. Hornee en el horno precalentado durante 30-35 minutos, o hasta que estén dorados y ligeramente dorados en la parte superior.", "Retire del horno y deje enfriar un poco. Adorne con una dispersión de estragón y hojas de cilantro si lo desea."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_red_onion_69475", "title": "Queso de cabra, cebolla roja y tarta de semillas de alcaravea", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente picada", "3-4 ramitas de estragón, hojas recogidas y finamente picadas", "1 cucharada de vinagre de vino blanco de buena calidad (preferiblemente vinagre de Moscatel)", "3 cucharadas de aceite de oliva virgen extra", "aceite vegetal, para freír", "2 lonchas de tocino rayado, cortado en cubitos", "2 rebanadas de pan de masa fermentada de buena calidad", "2 porciones de queso de cabra (crottins individuales o rodajas de un tronco más grande)", "1 puñado de avellanas tostadas, ligeramente trituradas", "200g / 7oz de buena calidad hojas de ensalada mixtas", "sal y pimienta negra recién molida"], "method": ["En una ensaladera, mezcle la cebolla roja, el estragón, el vinagre y el aceite de oliva. Sazonar con sal y pimienta y reservar.", "Calentar un poco de aceite en una sartén, agregar el tocino y freír hasta que estén crujientes. Escurrir sobre papel de cocina.", "Calienta la parrilla a fuego alto. Tueste el pan en ambos lados y ase a la parrilla el queso de cabra hasta que se dore y burbujee.", "Agregue las avellanas, el tocino y las hojas de ensalada al tazón.", "Coloque el queso de cabra en la tostada y mezcle la ensalada asegurándose de que esté bien cubierta con aderezo.", "Arregle en un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_salad_96364", "title": "Ensalada de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_salad_96364_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Registro de queso de cabra 300g / 10½oz, refrigerado", "sal marina y pimienta negra recién molida", "1 cucharada de miel", "2 cucharaditas de pimienta rosa picado", "1 cucharadita de semillas de sésamo", "½ cucharadita de pimentón", "1 cucharada de queso parmesano rallado", "1 cucharada de cebollines frescos finamente picados", "1 cucharada de avellanas tostadas y finamente picadas"], "method": ["Coloque el queso de cabra en un tazón. Sazonar con sal marina y pimienta negra recién molida. Mezcle hasta que esté suave y bien combinado.", "Rompa los pedazos pequeños (aproximadamente una cucharadita) del queso, ruede en una bola y colóquelo en un plato.", "Para cubrir las trufas, coloque cada una de las coberturas sugeridas en pequeños cuencos.", "Mezcle la miel con unas gotas de agua para aflojarla un poco y cepillarla sobre una trufa.", "Colóquelo en un recipiente con topping y agítelo hasta que esté uniformemente cubierto. Acomode en un plato de servir y repita hasta que todas las bolas estén cubiertas."], "url": "www_bbc_co_uk_food_recipes_goats_cheese_truffles_80378", "title": "Trufas de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 18-20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Linguini 200 g / 7oz", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "Crema doble 75ml / 3fl oz", "50g / 2oz de hojas de espinaca baby", "sal y pimienta negra recién molida", "75g / 3oz de queso de cabra, en rodajas", "pizca de pimentón"], "method": ["Precalentar la parrilla a su configuración más alta.", "Cocine el linguini en agua hirviendo con sal hasta que esté al dente. Escurrir y apartar.", "Caliente el aceite de oliva en una sartén de tamaño mediano y sude la chalota y el ajo durante dos minutos o hasta que estén blandos, pero no coloreados.", "Agregue el linguini cocido, crema doble, espinaca, sal y pimienta negra recién molida y revuelva bien. Vierta en un pequeño plato gratinado.", "Coloque las rodajas de queso de cabra encima, espolvoree pimentón y colóquelo debajo de la parrilla durante cinco minutos o hasta que burbujee y el queso de cabra se dore un poco. Servir."], "url": "www_bbc_co_uk_food_recipes_goatscheeseandmushro_81822", "title": "Queso gratinado de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla salada", "Bastidor de cabra de 600 g / 21 oz y sillín corto (de 2 semanas de edad), recortado", "2 alcachofas, cortadas, estranguladas, cortadas en cuartos", "50 g / 1¾oz de hongos de morel, más o menos picados", "sal y pimienta negra", "1 cucharadita de ajo perezoso (1 diente de ajo mezclado con 1 cucharadita de aceite de oliva)", "3 cucharaditas de vinagre de jerez", "150ml / 5fl oz de salsa", "150g / 5oz de ajo silvestre, aproximadamente picado"], "method": ["Calentar la mantequilla en una sartén hasta hacer espuma. Coloque la cabra con la mantequilla y fría durante 6-10 minutos, hilvanando todo el tiempo: cocine la carne por más tiempo, si prefiere que la carne esté bien hecha. Después de unos minutos, agregue las alcachofas. Retire y coloque en un plato de talla, cubriendo holgadamente con papel de aluminio, y descanse durante al menos seis minutos.", "Blanquee las setas morel durante diez segundos en una sartén de agua hirviendo con sal. Escurrir bien y agregar las colmenillas a la sartén que se usa para cocinar la cabra y cocinar durante tres minutos.", "Agregue el ajo perezoso, cocínelo por 15-20 segundos, o hasta que esté fragante, y luego dele brillo con el vinagre de jerez. Una vez que el vinagre se haya evaporado, agregue la salsa y deje que hierva.", "Agregue el ajo silvestre y sazone al gusto con sal y pimienta. Sirva la carne en rodajas con las colmenillas y ajo silvestre en el lateral."], "url": "www_bbc_co_uk_food_recipes_goats_saddle_with_45211", "title": "Silla de cabra con alcachofas, colmenillas y ajo silvestre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "2 cucharaditas de azúcar en polvo", "2 ramitas de tomillo", "3 chalotes de plátano, pelados y cortados longitudinalmente", "250 g / 9 oz de hojaldre confeccionado, laminado a 5 mm / ¼ de espesor", "75g / 3oz de queso de cabra suave", "Queso de cabra firme de 200g / 7oz", "25 g / 1 oz de miel clara", "2 cucharadas de aceite de trufa", "1 cucharada de aceite de oliva extra virgen", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 centavo de berro o berro de mostaza", "50 g / 2 oz de lechuga de cordero"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el queso de cabra y la tarta tatin de chalote, caliente dos bandejas blindadas pequeñas hasta que estén calientes. Divida la mantequilla y el azúcar impalpable entre las dos ollas y caliente hasta que el azúcar y la mantequilla se hayan derretido y la mezcla haya comenzado a caramelizarse y ponerse dorada.", "Coloque una ramita de tomillo en cada sartén y agregue los chalotes a las dos sartenes.", "Cocine por 3-4 minutos hasta que los chalotes comiencen a dorarse.", "Mientras tanto, coloque la masa prelaminada sobre una superficie limpia y enharinada y desmenuce el queso de cabra suave sobre la mitad de la masa.", "Doble la masa a la mitad para cubrir el queso de cabra y vuelva a extender hasta 5 mm / ¼ de grosor.", "Con un cuchillo afilado, corta dos círculos de masa para que sean un poco más grandes que la circunferencia de las bandejas blini.", "Cubra cada bandeja con una ronda de repostería y coloque los bordes dentro de la sartén y alrededor de las chalotas.", "Transfiera al horno y hornee durante 15-20 minutos, hasta que la masa esté dorada y cocida. Retire y deje que se enfríe un poco.", "Para la ensalada, coloque la miel y los aceites en un tazón pequeño y bata para combinar. Agregue el jugo de limón y sazone con sal y pimienta negra recién molida. Coloque el berro o el berro de mostaza y la lechuga de cordero en un tazón grande y agregue el aderezo a las hojas de la ensalada, reservándolas para más adelante. Mezclar bien.", "Para terminar la tarta tatin, precaliente la parrilla a alto. Rebane el queso firme de cabra por la mitad, colóquelo en una bandeja para asar y cocine bajo la parrilla durante dos minutos hasta que se dore.", "Para servir, voltee cada tarta tatin de su blini pan en el centro de un plato de servir, con la masa hacia abajo, tenga cuidado, ya que estará muy caliente. Cubra con el queso de cabra firme a la plancha y un puñado de ensalada vestida. Coloque el aderezo restante alrededor del borde de cada plato."], "url": "www_bbc_co_uk_food_recipes_goatscheeseandshallo_86207", "title": "Queso de cabra y tarta tatin de chalota con ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva, más extra para la grasa", "Queso redondo de cabra de 100 g / 3½ onzas, cortado por la mitad", "½ cucharadita de pimienta negra agrietada", "pequeño manojo de albahaca fresca", "pequeño racimo de cilantro fresco", "55g / 2oz de tomates bañados por el sol, picados", "½ cucharadita de vinagre balsámico"], "method": ["Caliente una sartén hasta que fume, luego cepille con el aceite.", "Coloque el queso en la plancha y cocine durante dos minutos en cada lado.", "Mientras tanto mezcle los ingredientes restantes en un tazón, luego colóquelos en un plato para servir.", "Para servir, coloque el queso de cabra a la plancha encima de la ensalada."], "url": "www_bbc_co_uk_food_recipes_goatscheeseandsunblu_84043", "title": "Queso de cabra y ensalada de tomate enrojecida por el sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de tomates cherry, cortados a la mitad", "125ml / 4fl oz de aceite de oliva virgen extra", "1 cucharada de hojas frescas de tomillo", "sal y pimienta negra recién molida", "Ricotta 400 g / 14 oz", "100g / 3½oz de queso de cabra", "30 g / 1 oz de parmesano (o una alternativa vegetariana), rallado", "200 g / 7 oz espinaca bebé", "2 dientes de ajo, aplastados", "12 x 12cm / 5in x 10cm / 4in hojas de pasta fresca", "virutas de parmesano", "hojas de ensalada verde, vestidas con aceite de oliva y vinagre balsámico"], "method": ["Precalentar el horno a 180C / 365F / Gas 4.", "Coloque los tomates en un tazón y rocíe con el aceite de oliva. Agregue el tomillo y sazone bien con sal y pimienta negra recién molida.", "Coloque la ricota, el queso de cabra y el queso parmesano en un recipiente limpio y mezcle bien.", "Agregue la espinaca y el ajo y sazone bien con sal y pimienta negra recién molida.", "Coloque las hojas de pasta sobre una superficie de trabajo limpia. Coloque una línea de la mezcla de queso y espinacas a lo largo del borde más largo de cada hoja de pasta, luego enrolle como un cigarro.", "Rocíe los rollos de canelones con un poco del aceite en el que los tomates han estado sentados, luego vierta el aceite restante en el fondo de un plato resistente al horno que contendrá los 12 canelones.", "Coloque los tubos de canelones en el plato y coloque los tomates de manera uniforme sobre la parte superior.", "Transfiera al horno para hornear por 15 minutos, o hasta que esté cocido.", "Para servir, coloca tres canelones en cada uno de los cuatro platos. Espolvoree con virutas de parmesano y coloque una cucharada de hojas de ensalada mixta verde al lado."], "url": "www_bbc_co_uk_food_recipes_goatscheesecannellon_86639", "title": "Canelones de queso de cabra con tomates cherry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goatscheesecannellon_86639_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "½ cebolla, finamente rebanada", "1 diente de ajo, finamente picado", "Arroz risotto 150g / 5½ oz", "50ml / 2fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo caliente", "50g / 1½oz de queso de cabra", "Crema doble 50ml / 2fl oz", "1 limón, ralladura solamente", "1 cucharadita de cebolletas frescas picadas", "1 cucharadita de perejil fresco picado", "1 cucharada de perifollo fresco picado", "pimienta negra recién molida"], "method": ["Derrita la mantequilla con el aceite en una olla. Coloque la cebolla y el ajo en la sartén y cocine suavemente durante 2-3 minutos.", "Agregue el arroz y el vino a la sartén, lleve a ebullición y cocine hasta que el vino sea absorbido.", "Agregue el caldo caliente a la sartén y cocine a fuego lento durante 8-10 minutos.", "Agregue el queso de cabra, la crema, la ralladura de limón y las hierbas a la sartén, mezcle bien y sazone con pimienta solamente. Cocine por otros 2-3 minutos, o hasta que el arroz esté al dente.", "Para servir, transfiera el risotto a un recipiente para servir calentado."], "url": "www_bbc_co_uk_food_recipes_goatscheeselemonandh_84763", "title": "Risotto de queso de cabra, limón y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla, más extra, derretido, para engrasar", "Nueces 50g / 2oz, finamente picadas", "Harina normal de 40 g / 1½ oz (aquellos con intolerancia al trigo pueden sustituir a la harina sin trigo)", "275 ml / 10 fl oz de leche", "175 g / 6 onzas de queso de cabra en bruto, o queso de cabra en forma de tronco de leña, similar, finamente picado", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas, separados, blancos batidos hasta que se forman picos rígidos cuando se quita el batidor", "Queso Ogleshield de 75g / 3oz o queso de leche de vaca desmenuzable similar, finamente rallado", "4 cucharadas de crema doble", "50g / 2oz de mantequilla", "12 lanzas de espárragos, extremos leñosos recortados, pelados", "8 rebanadas finas de panceta, cortadas en tiras de 2cm / ¾in", "Mitades de nogal 110g / 4oz", "110g / 4oz de hojas de ensalada mixtas", "1 cucharadita de mostaza Dijon", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de oliva virgen extra"], "method": ["Para los suflés, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cepille el interior de cuatro moldes con mantequilla derretida. Agregue algunas de las nueces finamente picadas a cada molde, gírelo para cubrir los lados y el fondo, luego sacuda el exceso. Dejar de lado.", "Calentar la mantequilla en una sartén a fuego medio hasta que se derrita. Agregue la harina, revuelva continuamente, luego continúe cocinando durante 1-2 minutos o hasta que la mezcla forme una pasta espesa. Retire del fuego.", "Poco a poco agregue la leche a la sartén y mezcle hasta que la mezcla esté suave y bien combinada.", "Regrese la mezcla al fuego y continúe cocinando por 1-2 minutos, o hasta que espese. Agregue el queso de cabra y revuelva hasta que se haya derretido y la mezcla esté suave y bien combinada. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Retire la sartén del fuego, bata las yemas de huevo de a una por vez, batiendo a fondo después de cada adición, hasta que estén bien combinadas, luego déjelas a un lado.", "Batir un tercio de las claras de huevo endurecidas en la salsa hasta que estén bien combinadas, luego doblar cuidadosamente las claras de huevo restantes con una cuchara de metal.", "Con una cuchara, la mezcla en los moldes preparados, golpeando los lados suavemente para eliminar cualquier burbuja de aire grande.", "Coloque los moldes en una bandeja de asar. Con cuidado, vierta suficiente agua hirviendo en la bandeja de asar para llegar a la mitad de los lados de los moldes (esto se llama baño maría).", "Transfiera el baño maría al horno y hornee durante 20-25 minutos, o hasta que los soufflés se hayan levantado y estén dorados y dorados (los suflés se cocinan cuando se introduce un pincho en el centro del soufflé. ) Retire los soufflés del baño María y déjelos a un lado para que se enfríen un poco.", "Precalentar la parrilla a su configuración más alta.", "Con cuidado, saca cada soufflé de su molde y colócalo en una bandeja para hornear.", "Espolvorea sobre el queso Ogleshield y rocía sobre la crema.", "Ase los suflés durante 2-3 minutos, o hasta que el queso esté dorado y burbujeante y los soufflés se hayan calentado.", "Mientras tanto, para la ensalada de nueces, caliente 25 g / 1 oz de la mantequilla en una sartén a fuego medio hasta que se derrita. Agregue las espárragos, vierta solo el agua caliente suficiente para cubrirlos y deje hervir a fuego lento. Continúe cocinando a fuego lento durante 2-3 minutos, o hasta que las espárragos estén tiernas. Escurrir bien y dejar reposar.", "Caliente una sartén por separado hasta que esté caliente, agregue la mantequilla restante y las tiras de panceta y fríe durante 2-3 minutos, o hasta que estén crujientes.", "Agregue las mitades de nueces y las espárragos cocidos y fríalos durante 1-2 minutos, o hasta que estén dorados, luego retírelos de la sartén y póngalos a un lado para escurrirlos sobre papel de cocina.", "Agregue las mitades fritas de nuez, tiras de panceta y espárragos en las hojas de ensalada y mezcle bien para combinar.", "En un tazón, bata la mostaza de Dijon, el vinagre y el aceite de oliva hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, rocíe dos tercios del aderezo sobre la ensalada y mezcle bien para cubrir las hojas. Divida las hojas de ensalada vestidas por igual entre cuatro platos para servir. Coloque un soufflé horneado dos veces junto a cada porción. Rocíe el aderezo restante alrededor del borde de cada plato."], "url": "www_bbc_co_uk_food_recipes_goatscheesedoublebak_91369", "title": "Soufflé doble de queso de cabra con ensalada de nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cabezas de ajo", "aceite de oliva, para lloviznar", "2-3 ramitas de tomillo fresco", "sal y pimienta negra recién molida", "1 queso de cabra redondo", "1 ciabatta o baguette", "hojas de lechuga, para servir", "prosciutto, para servir (opcional)"], "method": ["Precalentar el horno a 120 ° C / 250 ° F / Gas 4.", "Coloque las cabezas enteras de ajo cómodamente en un plato de horno. Rocíe con aceite de oliva y sazone con tomillo, sal y pimienta negra recién molida. Asar en el horno durante aproximadamente una hora, o hasta que el ajo se ablande.", "Exprime el ajo suave de sus pieles en un plato pequeño o tazón. Agregue suficiente aceite de oliva para hacer una pasta espesa y condimente, al gusto, con sal y pimienta negra recién molida. Rebana un poco de queso de cabra fino. Corte la chapata por la mitad y colóquela debajo de la parrilla para brindar, luego extienda las rebanadas con la pasta de ajo. Coloque el queso de cabra en la parte superior y vuelva a asomar debajo de la parrilla hasta que el queso se haya derretido.", "Sirva con un lecho de hojas frescas y crujientes de lechuga. A menudo agrego un par de rebanadas de jamón, también."], "url": "www_bbc_co_uk_food_recipes_goatscheeseongarlict_92228", "title": "Queso de cabra sobre pan de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 queso de cabra", "aceite de oliva", "mezcla de hierbas picadas", "pan crujiente"], "method": ["Coloque el queso, el aceite y las hierbas en un recipiente y revuelva.", "Extender generosamente sobre el pan crujiente y servir."], "url": "www_bbc_co_uk_food_recipes_goatscheesepacirctea_65619", "title": "Paté de queso de cabra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]