[{"isVegetarian": false, "title": "Cheese and cherry tomato muffins", "url": "www_bbc_co_uk_food_recipes_cheeseandcherrytomat_84142", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandcherrytomat_84142_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "100g/3½oz courgette, grated", "salt and freshly ground black pepper", "100g/3½oz mature cheddar, grated", "175ml/6fl oz milk", "1 free-range egg", "55ml/2fl oz olive oil", "10 cherry tomatoes", "crisp grilled bacon", "scrambled egg"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "In a mixing bowl, combine the flour, courgette, salt, freshly ground black pepper and cheddar and mix well.", "In a separate bowl, mix together the milk, egg and olive oil. Add this mixture to the dry ingredients and mix well.", "Grease ten muffin moulds and half-fill each with the mix.", "Prick each cherry tomato - this stops them popping when they cook - and press one tomato into the top of each spoonful of mix. ", "Spoon the remaining mixture over each muffin to conceal the tomato. Cook for about 20 minutes until golden brown."]}, {"isVegetarian": true, "title": "Cheese and chive soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandchivesouffl_84979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint double cream", "100g/3½oz cheddar cheese, grated", "2 free-range eggs, separated", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper", "butter, for greasing"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and place a baking sheet into the oven.", "Pour the cream into a small saucepan over a low heat. Stir in the cheese and egg yolks and whisk together until slightly thickened. Remove from the heat and leave to cool for five minutes.", "In a separate, clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Fold the egg whites into the cream mixture. Stir in the chives and season well with salt and freshly ground black pepper.", "Grease two small ramekins and pour in the soufflé mixture until the ramekins are three-quarters full.", "Place the ramekins onto the preheated baking tray, transfer to the oven and bake for 8-10 minutes, or until well risen and golden-brown on top. Serve immediately in the ramekins."]}, {"isVegetarian": false, "title": "Cheese and ham croque monsieur", "url": "www_bbc_co_uk_food_recipes_cheeseandhamcroquemo_88066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices white crusty bread", "100g/3½oz Brie, sliced", "2 slices ham", "2 free-range eggs, beaten", "1 tbsp olive oil", "15g/½oz butter", "oakleaf and lamb's lettuce leaves", "drizzle olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Take one slice of bread, lay the slices of Brie on top and then cover with the ham. Place the second slice of bread on top, then dip the sandwich into the beaten egg, coating well. ", "Heat the oil and butter in a frying pan and fry the sandwich until golden-brown on both sides. ", "To serve, cut in half and arrange on a serving plate. Garnish with lettuce leaves and drizzle with olive oil."]}, {"isVegetarian": true, "title": "Cheese and lentil pancake", "url": "www_bbc_co_uk_food_recipes_cheeseandlentilcanne_85050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1½oz plain flour", "2 free-range eggs ", "50ml/2fl oz whole milk", "1 tbsp olive oil", "50g/1½oz cooked lentils", "50g/1½oz cheddar cheese, grated", "salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancake, place the flour, eggs and milk into a bowl and mix well to make a smooth batter.", "Heat the oil in a frying pan and pour in the batter, swirling the pan to coat the base. Fry the pancake for two minutes.", "Place the lentils and cheese onto the middle of the pancake and fold in half to enclose the mixture. Fry for a further 2-3 minutes.", "For the herb oil, place the oil and parsley into a bowl, mix well and season with salt and freshly ground black pepper.", "To serve, place the pancake onto a plate and drizzle over the herb oil."]}, {"isVegetarian": false, "title": "Cheese and herb-crusted chicken breast with warm chickpeas and chorizo", "url": "www_bbc_co_uk_food_recipes_cheeseandherbcrusted_92403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 chicken breast, skin removed", "salt and freshly ground black pepper", "1 fresh rosemary sprig", "2 garlic cloves, peeled, left whole, slightly crushed with the side of a knife", "2 tbsp garlic-and-herb cream cheese", "100g/3½oz chorizo, sliced", "½ onion, peeled, finely sliced", "2 garlic cloves, peeled, finely chopped", "1 sprig fresh rosemary", "85g/3oz canned chickpeas, drained and rinsed", "salt and freshly ground black pepper", "2 tbsp balsamic vinegar", "4 tbsp extra virgin olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in an ovenproof frying pan and brown the chicken breast for 2-3 minutes on each side. Add the rosemary and garlic to the frying pan. ", "Transfer the pan to the oven and cook the chicken for 10-12 minutes.", "Spread the garlic-and-herb cream cheese over the top of the chicken. Keep warm.", "Meanwhile, for the chickpeas and chorizo, roast the chorizo in the oven in a roasting tray for 3-4 minutes, or until crisp. Season, to taste, with salt and freshly ground black pepper. ", "Stir the onion, garlic, rosemary and chickpeas into the chorizo and roast for a further 5-7 minutes. Stir in the balsamic vinegar and extra virgin olive oil.", "To serve, spoon the chickpeas and chorizo onto a plate. Cut the chicken breast into three pieces and place on top."]}, {"isVegetarian": true, "title": "Cheese and onion pasties", "url": "www_bbc_co_uk_food_recipes_cheeseandonionpastie_13551", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb shortcrust pastry", "450g/1lb onions, peeled and sliced", "450g/1lb mature cheddar, grated", "2 tbsp vegetable oil", "salt and pepper", "beaten egg for glazing"], "serves": "Makes 6 pasties", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Roll out the pastry and cut out circles 20cm/8in in diameter. ", "Heat the oil and cook the onions in it until starting to soften. ", "Take off the heat and cool. Stir in the grated cheese and season well. ", "Divide the mixture between the 6 circles and crimp the edges together. Brush with a little of the beaten egg. ", "Put on a baking sheet and bake in the oven for 20-30 minutes until the pastry is golden. Serve hot or cold."]}, {"isVegetarian": true, "title": "Cheese and onion pie", "url": "www_bbc_co_uk_food_recipes_cheeseandonionpie_89625", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheeseandonionpie_89625_16x9.jpg", "ingredients": ["450g/1lb plain flour, plus extra for dusting", "2 tsp baking powder", "½ tsp salt ", "120g/4½oz unsalted butter, plus extra for greasing", "1 free-range egg yolk", "50g/2oz parmesan cheese (or a similar vegetarian hard cheese), grated", "120ml/4fl oz water", "1 free-range egg, beaten, for glazing", "1 medium potato, peeled and cut into cubes", "2 onions, finely sliced", "1 tbsp plain flour", "50ml/2oz whole milk", "50ml/2oz double cream", "150g/5½oz mature cheddar cheese, grated", "½ tsp English mustard", "½ tsp cayenne pepper", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. Add the grated parmesan and stir until well combined.", "Gradually add the water, a tablespoon at a time, mixing continuously until the mixture just comes together as a dough. (You may not need to use all of the water.) Roll the dough into a ball, then wrap it in cling film and chill in the fridge for an hour. ", "Meanwhile, for the filling, bring a saucepan of salted water to the boil. Add the potato pieces to the pan and cook for 10-15 minutes, or until tender, then drain well and set aside. ", "Bring a separate large saucepan of water to the boil, add the sliced onions and cook for 2-3 minutes, or until softened. Drain well and return the cooked onions to the saucepan.", "Sprinkle the onions with the flour and stir well to coat. Add the milk and cream and heat the mixture over a medium heat for 3-4 minutes, stirring continuously, until the liquid is smooth and has thickened slightly. Add the cooked potato pieces, grated cheese, mustard and cayenne pepper and stir well. Season to taste with salt and freshly ground black pepper, stir well, then set the filling mixture aside.", "Preheat the oven to 180C/350F/Gas 4. Grease a deep 20cm/8in pie tin with butter. Add a small amount of flour, turn the tin to coat the base and sides of the tin, then shake out any excess. ", "When the pastry has chilled, roll out two thirds of it onto a clean, floured work surface, until it is almost twice as wide as the diameter of the pie tin. Using the rolling pin, lift the pastry and lay it over the pie tin to line the base and sides. Gently press the pastry into the corners of the tin, trimming off any excess, then prick the base of the pastry case several times with a fork. ", "Cover the pastry with a sheet of greaseproof paper and fill it with rice or dried beans. Bake in the oven for 10-15 minutes, or until the pastry is pale golden-brown. Remove from the oven, discard the beans and greaseproof paper and set the pastry aside to cool. When cool, pour the pie filling into the pastry case.", "Roll the remaining one third of the pastry out onto a clean, floured work surface until it is slightly larger than the diameter of the pie tin. Brush the rim of the cooked pastry case with some of the beaten egg and place the pastry lid on top of the pie. Trim off any excess pastry. Seal the pastry lid to the pastry case by crimping the edges of the pastry lid with a fork.", "With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry lid with the remaining beaten egg, then transfer to the oven and bake for 25-30 mins, or until golden-brown."]}, {"isVegetarian": true, "title": "Cheese and potato pasty", "url": "www_bbc_co_uk_food_recipes_cheeseandpotatopasty_84404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "100g/3½oz butter", "1 free-range egg", "salt and freshly ground black pepper", "80g/3oz walnuts, crushed finely", "milk, to bind (if necessary)", "400g/14oz new potatoes, cut into cubes and boiled until tender", "400g/14oz smoked cheese, cut into cubes", "handful baby spinach", "2 red onions, cut into wedges, roasted for 30 minutes", "salt and freshly ground black pepper", "1 free-range egg, beaten, for egg wash", "1 tbsp olive oil", "1 onion, sliced", "1 garlic clove, finely sliced", "1 chilli, finely chopped ", "thumb-sized piece fresh ginger, sliced into matchsticks", "450g/1lb carrots, grated", "splash green ginger wine", "150g/5oz demerara sugar", "150ml/5fl oz white wine vinegar", "1 tsp ground cloves", "1 tsp ground cinnamon"], "serves": "1", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry place the plain flour, butter, egg, seasoning and walnuts into a food processor and pulse until combined into a dough. Add a splash or two of milk if necessary to bring the dough together. Remove and roll the dough into a ball, then cover with cling film and place into the fridge to chill for two hours.", "Remove the dough from the fridge and cling film. Roll out on a clean floured surface to 2cm/1in thickness and cut out a round using a 15cm/6in plate as a guide.", "For the filling, place the new potatoes, cheese, spinach and red onions into a bowl. Season with salt and freshly ground black pepper and mix well. ", "Now place the potato mixture onto one half of the pastry. Fold over the other half to cover, crimp the edges to seal and brush with the egg wash. Place onto a baking sheet and place into the oven to bake for 20 minutes, or until crisp and golden.", "For the chutney, heat the oil in a frying pan over a medium heat. Add the onion, garlic, chilli and ginger and fry until soft. ", "Add the carrot and cook for ten minutes.", "Add the ginger wine and boil to reduce, until nearly all of the liquid has evaporated.", "Add the sugar, vinegar, cloves and cinnamon and simmer for 15-25 minutes, or until the liquid has reduced and the mixture is thickened.", "To serve, place the pasty on a plate with the chutney spooned alongside."]}, {"isVegetarian": false, "title": "Cheese and potato cakes with crisp parma ham, poached egg and tomato salsa", "url": "www_bbc_co_uk_food_recipes_cheeseandpotatocakes_85966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ready-made mashed potato", "100g/3½oz gruyère cheese, grated ", "50g/2oz self-raising flour", "1 free-range egg", "salt and freshly ground black pepper ", "1 tbsp olive oil", "25g/1oz butter", "1 beef tomato, seeds removed, chopped", "1 lime, juice and zest", "1 tbsp olive oil", "2 tbsp chopped fresh coriander", "salt and freshly ground black pepper", "3 slices parma ham, fried until crisp", "1 free-range egg, poached"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato cakes, place the mashed potato into a bowl with the cheese, flour and egg and mix well. Season with salt and freshly ground black pepper, then shape the mixture into three patties.", "Heat the oil and butter in a frying pan and fry the potato cakes for 3-4 minutes on each side, or until golden-brown.", "For the tomato salsa, place all of the salsa ingredients into a bowl and stir to combine.", "To serve, place the potato cakes onto a serving plate with the crisp parma ham and poached egg on top and the salsa spooned around the plate."]}, {"isVegetarian": true, "title": "Spinach mash", "url": "www_bbc_co_uk_food_recipes_cheeseandspinachmash_90409", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 handfuls fresh spinach", "2 garlic cloves, chopped", "200g/7oz ready-made mashed potato"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and add the spinach and garlic. Cook for 2-3 minutes, or until the spinach has wilted. ", "Stir in the cooked mashed potato and cook for a further 3-4 minutes, or until warmed through. Serve."]}, {"isVegetarian": true, "title": "Cheese and spinach soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandspinachsouf_78027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "25g/1oz plain flour", "150ml/5fl oz milk", "100g/1¾oz Edam, grated", "100g/3½oz spinach ", "3 free-range egg yolks", "3 free-range egg whites"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter in a saucepan over a medium heat. Stir in the flour and cook for 30 seconds. Remove from the heat and gradually whisk in the milk.", "Bring to the boil and stir in the spinach and most of the cheese.", "Allow to cool slightly. Beat in the egg yolks and season well.", "In a large bowl whisk the egg whites to medium peak.", "Mix two large spoonfuls of egg to the milk mixture to slacken. Fold in the remaining egg whites and sprinkle with the Edam.", "Transfer to an oven-proof frying pan. Place in the oven and cook for 10 minutes.", "Serve the soufflé in the frying pan."]}, {"isVegetarian": true, "title": "Cheese and tarragon soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandtarragonsou_89196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["melted butter, for greasing", "4 tbsp finely grated parmesan cheese", "300ml/10fl oz milk", "1 bay leaf", "50g/2 oz butter", "50g/2 oz plain flour", "5 free-range eggs, separated", "1 tsp Dijon mustard", "2 tbsp chopped fresh tarragon leaves ", "100g/3½oz Gruyère cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6. ", "Brush the inside of a large soufflé dish with the melted butter and dust with the grated parmesan, shaking out any excess cheese.", "Bring the milk to the boil in a saucepan with the bay leaf, then remove from the heat and set aside.   ", "Melt the butter in a heavy-based saucepan and stir in the flour. Cook for 2-3 minutes, until the mixture turns a deep ivory colour and thickens. Pour in the warm milk, stirring or whisking until you have a smooth sauce that is free of lumps. Simmer gently, stirring from time to time, for about ten minutes.", "Remove the sauce from the heat and remove the bay leaf. Whisk in the egg yolks, one at a time, and stir in the mustard and tarragon leaves. Season with salt and freshly ground black pepper. Gently stir in the Gruyère, until melted and well combined.", "Beat the egg whites until soft peaks form when the whisk is removed from the bowl. Gently fold the egg whites into the cheese sauce with a large metal spoon, until just combined.", "Gently spoon the mixture into the buttered soufflé dish and bake in the oven for 25-30 minutes, until the soufflé has risen and is golden-brown on top.   ", "Remove from the oven and serve immediately."]}, {"isVegetarian": false, "title": "Cheese soufflé", "url": "www_bbc_co_uk_food_recipes_cheeseandtomatosouff_75726", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp melted butter", "¼ red onion, chopped", "1 tbsp fresh chives, chopped", "1 tbsp fresh parsley, chopped", "3 tbsp butter", "1 tsp cornflour", "2tbsp plain flour", "100ml/3 ½oz milk", "35g/1¼oz Stilton cheese", "3 free-range egg yolks", "3 free-range egg whites"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven 200C/400F/Gas 6.", "For the soufflé mixture, place the melted butter in a pan with the red onion and cook for two minutes.", "Remove from the heat and add the chopped herbs and allow to cool for three minutes.", "For the white sauce, melt the butter and add the cornflour, plain flour, milk, cheese, salt and pepper and the egg yolks.", "Take off the heat and allow to cool for two minutes.", "For the egg whites, whisk the egg whites in a large bowl until they form stiff peaks.", "Fold the white sauce into the egg whites and add the onion mixture. Do not over mix.", "Grease two ramekin dishes and spoon the mixture into these.", "Place on a tray in the pre-heated oven for eight minutes.", "Serve the soufflés in the dishes straight away."]}, {"isVegetarian": true, "title": "Cheese, apple and sage tarts", "url": "www_bbc_co_uk_food_recipes_cheeseappleandsageta_85559", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour, plus extra for dusting", "100g/3½oz unsalted butter", "1 free-range egg", "2 tbsp water ", "1 tbsp olive oil", "½ onion, finely sliced", "1 tsp brown sugar", "50g/1½oz cheddar, grated ", "1 apple, cored and sliced", "4 fresh sage leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg and pulse again to combine. Add enough water to make the mixture come together into a dough.", "Turn the dough out onto a floured surface and lightly knead. Roll the dough out to ½cm/¼in thick and cut out two 18cm/7in circles.", "For the filling, heat the oil in a pan and gently fry the onion with the sugar until softened and slightly caramelised.", "Sprinkle the onion mixture over the tart bases, along with the grated cheese and the apple slices. Top with the sage leaves.", "Place the tarts onto a baking sheet and bake in the oven for ten minutes, or until golden-brown.", "To serve, place the warm tarts onto plates."]}, {"isVegetarian": true, "title": "Cheese, aubergine and olive enchiladas", "url": "www_bbc_co_uk_food_recipes_cheeseaubergineandol_85280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, peeled, chopped", "4 baby aubergines, finely chopped", "100g/3½oz tinned kidney beans, drained", "150g/5½oz tinned cherry tomatoes", "75g/2½oz kalamata olives, pitted, chopped", "1 flour tortilla, warmed", "50g/1¾oz cheddar cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan, add the onion and aubergine and gently fry for two minutes. Add the kidney beans, tomatoes and olives and cook for three minutes.", "Lay a tortilla wrap out flat, fill with the kidney bean mix and roll up. Sprinkle with grated cheese and use a mini-blowtorch to \"grill\" the cheese until it has melted. (Alternatively, place the wrapped tortilla on a baking tray and place under a perheated grill, until the cheese has melted. Serve."]}, {"isVegetarian": true, "title": "Cheese baked with thyme", "url": "www_bbc_co_uk_food_recipes_cheesebakedwiththyme_79269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cheese in a box (such as Pont l'Évêque)", "1 tbsp fresh thyme leaves", "½ tbsp olive oil", "salt and freshly ground black pepper", "½ red romero pepper, seeds removed and chopped", "rustic white bread, broken up, to serve"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the cheese in a box on a baking sheet and sprinkle with the thyme leaves.", "Drizzle with olive oil and sprinkle with salt and freshly ground black pepper.", "Place in the oven and bake for 10-12 minutes, or until just beginning to melt.", "Remove from the oven and serve on a plate with the chopped pepper pieces and rustic bread pieces beside."]}, {"isVegetarian": false, "title": "Cheese-breaded turkey escalope with fried potatoes and sweet pepper sauce", "url": "www_bbc_co_uk_food_recipes_cheesebreadedturkeye_89182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice white bread, crusts removed", "1 small handful fresh basil leaves", "55g/2oz mature cheddar, grated", "salt and freshly ground black pepper", "1 turkey escalope", "2 tbsp plain flour", "1 free-range egg, beaten", "1 tbsp olive oil", "25g/1oz butter", "25g/1oz butter", "1 tbsp olive oil", "150g/5½oz new potatoes, cooked, sliced", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 red pepper, finely chopped", "1 clove garlic, chopped", "1 tbsp honey", "25g/1oz butter", "splash water", "1 tbsp chopped fresh parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the breaded turkey, place the bread, basil, cheddar, salt and freshly ground black pepper into a mini food processor and blend to fine breadcrumbs.", "Dredge the turkey escalope in the plain flour and shake off the excess, then dip into the beaten egg and finally into the breadcrumb mix. Pat gently to secure the breadcrumbs to the escalope, then shake off any excess. ", "Heat the olive oil and butter in a frying pan, add the turkey escalope and fry for 3-4 minutes on both sides, or until golden-brown all over and cooked through.", "For the fried new potatoes, melt the butter and oil in a frying pan, add the potatoes and season with salt and freshly ground black pepper. Fry for 2-3 minutes on both sides, or until golden-brown on all sides.", "For the sweet pepper sauce, heat the olive oil in a saucepan, add the pepper and garlic and lightly fry for 3-4 minutes, or until the pepper has softened. Stir in the honey, butter and a splash of water, then transfer to a mini food processor and blend until smooth.", "To serve, pile the fried new potatoes onto a serving plate, top with the breaded turkey escalope and drizzle around the sweet pepper sauce. Garnish with chopped fresh parsley and serve."]}, {"isVegetarian": false, "title": "Cheeseburger and fries", "url": "www_bbc_co_uk_food_recipes_cheeseburger_and_fries_06202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz beef steak mince", "2 tbsp vegetable oil", "25g/1oz beer mustard", "100g/3½oz mayonnaise", "8 gherkins, sliced", "4 beef tomatoes, sliced", "½ round lettuce, leaves separated", "1 red onion, sliced", "200g/7oz Monterey Jack cheese, grated or in slices", "4 brioche rolls", "500g/1lb 2oz chipping potatoes", "vegetable oil, for deep-fat frying", "1 vanilla pod, seeds removed", "500ml/18fl oz full-fat milk", "200g/7oz vanilla ice cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the cheeseburger, put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into four burger-shaped patties. Wrap the patties in cling film and place in the fridge for an hour.", "Heat a large frying pan and add the oil. Once hot, add the burgers and cook each side for 2-3 minutes. When cooked, set aside to rest.", "In a small bowl, mix the mustard with the mayonnaise.", "For the fries, preheat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Fry the chips for 3-4 minutes, then drain on kitchen paper and season with salt.", "For the vanilla milkshake, place all the ingredients in a blender and blend until smooth. ", "Just before serving, pour the milkshake into glasses.", "To assemble the burger, place each patty in a brioche roll topped with the gherkins, sliced tomato, lettuce, a few onion slices, cheese and beer mustard mayonnaise.", "Place the burgers on serving plates and secure with a wooden skewer. Place the fries alongside and serve with the milkshakes. "]}, {"isVegetarian": true, "title": "Cheesecake with salted caramel popcorn, blackberry curd and gingernut crumble", "url": "www_bbc_co_uk_food_recipes_cheesecake_with_salted_18348", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz mascarpone cheese", "125ml/4fl oz double cream", "125ml/4fl oz plain yoghurt", "1 lemon, zest and juice ", "100g/3½oz blackberries", "1 large free-range egg", "1 lemon, zest and juice ", "1 tbsp caster sugar", "50g/1¾oz butter", "35g unsalted butter", "1 tbsp soft brown sugar", "35g/1¼oz plain flour", "½ tsp baking powder", "1 tsp ground ginger", "¾ tbsp golden syrup", "1 ball stem ginger in syrup, finely chopped", "50g/1¾oz caster sugar", "10g/1/3oz unsalted butter", "½ tsp sea salt", "½ tsp vanilla extract", "knob of butter", "drop rapeseed oil", "1 tbsp popcorn kernels"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the cheesecake, whisk together the mascarpone, cream, yoghurt, half of the lemon juice and all the zest. Spread into a dish and place in the fridge.", "Meanwhile, to make the blackberry curd, mash the blackberries in a bowl with a fork, and push through a sieve into a large saucepan. Add the egg, lemon zest, juice, sugar and butter. Place the pan over a medium heat. Stir until thick and then remove from the heat. Transfer to a clean bowl and place in the fridge.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with greaseproof paper.", "To make the ginger nut crumble, cream together the butter and sugar in a large bowl. Add the remaining ingredients and mix well. Place 12 heaped teaspoons of the mixture on the lined baking tray, allowing room for them to spread. Bake for 10 minutes and then leave to cool. Break into crumbs in a bowl.", "To make the salted caramel, place the sugar and 100ml/3½fl oz water in a saucepan placed over a high heat. Bring up to a temperature of 185C without stirring. (You can do this by eye – when the caramel has reached a lovely golden-brown colour, it is ready.)  Remove from the heat and carefully add the butter, salt and vanilla extract (the hot sugar will spatter and could burn you). Keep stirring until the caramel stops bubbling and spitting.", "To make the popcorn, heat the knob of butter and drop of oil in a large pan over a medium heat, add the popcorn kernels, cover with a lid and leave to pop. When the popcorn has finished popping; stir in the salted caramel.", "Layer the cheesecake mix in serving glasses with the blackberry curd on top. Decorate with the crumbled ginger nut and popcorn and serve."]}, {"isVegetarian": true, "title": "Cheesecake brownies", "url": "www_bbc_co_uk_food_recipes_cheesecake_brownies_01372", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesecake_brownies_01372_16x9.jpg", "ingredients": ["225g/8oz dark chocolate (minimum 70% cocoa solids)", "150g/5½oz unsalted butter", "3 free-range eggs", "225g/8oz caster sugar", "100ml/3½fl oz strong espresso", "100g/3½oz plain flour", "150g/5½oz full fat cream cheese", "50g/1¾oz caster sugar", "1 free-range egg", "½ orange, zest only"], "serves": "Makes 16 brownies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Grease and line a 8in/20cm square cake tin.", "For the brownies, melt the chocolate and butter in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.) Remove the bowl from the pan and set aside to cool slightly.", "Whisk the eggs, caster sugar and coffee in a bowl until well combined. Sift in the flour and chocolate mixture and mix until well combined.", "For the cheesecake, beat the cream cheese, caster sugar, egg and orange zest until smooth.", "Spoon the brownie mixture into the cake tin then spoon the cheesecake mixture on top and use a knife to cut lines into the mixture to create a marble effect.", "Bake in the oven for 25-30 minutes, or until just set. Remove the tin from the oven, set aside to cool completely, then cut into squares"]}, {"isVegetarian": false, "title": "Cheese-crusted razor clams with garlic, chilli and lemon thyme", "url": "www_bbc_co_uk_food_recipes_cheesecrustedrazorcl_87656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5oz butter ", "1 tbsp fresh lemon thyme leaves", "2 leeks, finely chopped, trimmings reserved", "2 fennel bulbs, finely chopped, trimmings reserved", "1 red chilli, finely chopped", "3 garlic cloves, lightly crushed", "300ml/10½fl oz white wine", "1kg/2lb 2oz fresh razor clams, washed and drained", "110g/4oz fresh sourdough breadcrumbs", "20g/¾oz Pecorino cheese", "lime wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat a heavy-based frying pan until hot. Add 75g/2½oz of the butter, the lemon thyme, leeks, fennel, chilli and garlic and fry over a low heat until the vegetables are softened, but not browned.", "Heat a deep-sided frying pan with a lid and add the remaining 75g/2½oz of butter and the leek and fennel trimmings and fry for 2-3 minutes.", "Add the white wine, bring to the boil and cook to reduce by half the original volume.", "Add the razor clams. Cover with the lid and cook for 4-5 minutes, or until the clams are open and just cooked (discard any clams that haven't opened). Pour the contents of the pan into a sieve over a heatproof bowl. Reserve the cooked razor clams and discard the remaining sieve contents.", "Add 200ml/7fl oz of the cooking juices to the softened fennel, leek and chilli mixture and boil to reduce the liquid by half.", "Meanwhile remove the clam flesh from the shells. Slice the clam meat on an angle into 1cm/½in pieces, then add to the pan of reduced vegetable mixture.", "Wash the razor clam shells and place onto a baking sheet, then spoon the clam and vegetable mixture into the shells.", "Place the sourdough breadcrumbs and Pecorino into a food processor and blend to combine.", "Sprinkle the breadcrumb and cheese mixture over the filled shells then place under the grill and cook until the topping is golden-brown.", "Serve on plates with wedges of lime."]}, {"isVegetarian": true, "title": "Cheese, fennel and herb soup", "url": "www_bbc_co_uk_food_recipes_cheesefennelandherbs_85354", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "½ onion, chopped", "½ potato, peeled, cut into 1cm/½in cubes", "1 bulb fennel, finely sliced", "150ml/¼ pint hot chicken stock (vegetarians can substitute vegetable stock)", "small handful fresh parsley, chopped", "1 free-range egg yolk", "4 tbsp double cream", "55g/2oz Lancashire cheese, grated"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a saucepan and gently fry the onion until softened but not coloured.", "Add the potato, fennel and chicken stock and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until the potato and fennel are tender. Remove from the heat and allow to cool slightly.", "Pour the soup into a blender along with the parsley, egg yolk, cream and cheese and blend until smooth. If necessary, return the soup to the saucepan and gently warm through.", "To serve, pour the soup into bowls."]}, {"isVegetarian": true, "title": "Cheese galette with balsamic gravy", "url": "www_bbc_co_uk_food_recipes_cheesegallettewithba_78830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz plain flour ", "2 tsp baking powder", "2 tbsp olive oil", "½ pint full-fat milk ", "150g/5½oz blue cheese", "2 tbsp white wine", "100ml/3½fl oz red wine", "55ml/2fl oz balsamic vinegar"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Place the flour, baking powder and oil into a food processor and blend together. ", "Add the milk and blend to form a smooth dough.", "Using a rolling pin on a floured surface, roll the pastry out to 2.5cm/1in thickness. Using a plate as a guide, cut out a 20cm/8in circle and place onto a non-stick baking sheet. Reserve some of the dough for later.", "Using the excess dough, roll eight small balls and place evenly around the outside of the dough circle to decorate.", "Crumble the blue cheese into the circle and drizzle with the white wine.", "Place into the preheated oven for 15 minutes, or until golden and cooked through. Remove from the oven and place on a large warm plate.", "Meanwhile, for the balsamic sauce, place the red wine and balsamic vinegar in a saucepan over a medium heat. Bring to the boil then simmer until the sauce becomes thick and glossy.", "To serve, pour the balsamic sauce around the cheese galette."]}, {"isVegetarian": true, "title": "Cheese fondue with tomato dippers", "url": "www_bbc_co_uk_food_recipes_cheesefonduewithtoma_80850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic clove, thinly sliced", "100g/3½oz blue cheese", "100ml/3½fl oz white wine", "100ml/3½fl oz double cream", "1 tsp Dijon mustard", "1 tsp fresh thyme leaves", "12 cherry tomatoes", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the garlic, blue cheese, white wine and double cream into a pan over a medium heat. Heat for four minutes, until the cheese has melted, then add the Dijon mustard and thyme.", "Heat a griddle pan until smoking.", "For the tomato dippers, thread four cherry tomatoes onto a skewer and brush with olive oil. Repeat with two more skewers and then place onto the griddle pan to chargrill for two minutes on each side.", "To serve, place the cheese fondue in a bowl with the tomato dippers on the side."]}, {"isVegetarian": false, "title": "Cheese-glazed beef fillet Provençal", "url": "www_bbc_co_uk_food_recipes_cheeseglazedbeeffill_79565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 100g/3½oz beef fillet ", "2 tbsp olive oil", "1 garlic clove ", "sprig fresh thyme", "2 bay leaves ", "3 sprigs fresh chevril ", "2 sprigs fresh flatleaf parsley", "salt and freshly ground black pepper ", "2 Portobello mushrooms", "pinch ground cumin", "salt and cracked white pepper ", "1 tbsp olive oil ", "160g/5½oz baby spinach leaves", "3 tbsp vegetable stock", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 fresh plum tomatoes, de-seeded and finely chopped", "1 garlic clove, finely chopped", "100g/3½oz gruyere cheese, grated"], "serves": "Serves 2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Roll up the beef fillets to form two cylinder shapes, then wrap them tightly in cling film to hold the shape. Place in the fridge for 1-2 hours.", "Remove the beef from the fridge and take off the cling film, taking care to keep the beef in a cylinder.", "Heat an ovenproof frying pan and add two tablespoons of the olive oil and add the garlic and herbs.", "Season the beef with salt and freshly ground black pepper, then place in the hot pan of garlic and herbs and sear on the top and bottom, until coloured.", "Transfer the pan to the oven and cook for 6-8 minutes, or until cooked to your liking. Remove from the oven and leave to rest, retaining the pan juices for later.", "Meanwhile, for the mushrooms, peel the Portobello mushrooms and place them in a small roasting tin. Season with the cumin, salt and cracked white pepper, then place in the oven to cook for ten minutes. ", "Meanwhile, for the spinach, heat another frying pan and add one tablespoon of olive oil, the spinach and the vegetable stock, and cook until the spinach has just wilted. Season with salt and freshly ground black pepper.", "For the tomatoes, heat a frying pan with the remaining one tablespoon of olive oil. Add the plum tomatoes and garlic and cook for 1-2 minutes. Season with salt and freshly ground black pepper.", "Preheat the grill to high.", "To serve, place one mushroom on each of two plates, topped with beef fillet, spinach, tomato and finishing with the gruyere.  Place under the grill for 30 seconds until the cheese is just melted. Drizzle the juices from the steak pan around."]}]