[{"isVegetarian": false, "title": "Fiery prawn and tomato pasta", "url": "www_bbc_co_uk_food_recipes_fiery_prawn_and_tomato_46263", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fiery_prawn_and_tomato_46263_16x9.jpg", "ingredients": ["125g/4½oz dried spaghetti or linguine", "150g/5½oz broccoli, cut into small florets", "100g/3½oz cherry tomatoes, halved", "150g/5½oz large cold water prawns, such as North Atlantic or Canadian, completely thawed and drained", "1 tbsp extra virgin olive oil", "½ tsp dried chilli flakes, to taste", "sea salt and freshly ground black pepper", "lemon wedges, for squeezing (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a large, non-stick saucepan with water and bring to the boil. Add the pasta to the boiling water, return to the boil and cook for 8 minutes, stirring occasionally. Add the broccoli to the pan and cook for 2 minutes more. ", "Drain the pasta and broccoli. Return to the pan and add the tomatoes, prawns, oil, chilli flakes and season well. Cook for 2–3 minutes, tossing with two wooden spoons until the spaghetti is evenly coated with the spices from the pan and the prawns and tomatoes are hot. ", "Squeeze over a little lemon juice, if using, and serve immediately. "]}, {"isVegetarian": true, "title": "Fig cake with a dried fig chutney and cheddar cheese", "url": "www_bbc_co_uk_food_recipes_fig_cake_with_a_dried_24786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz ground almonds ", "50g/1¾oz caster sugar, plus 2 tbsp for sprinkling", "30g/1oz plain flour", "1 tsp baking powder", "½ tsp ground cinnamon", "pinch of salt", "3 free-range eggs, lightly beaten", "4 tbsp butter, melted and cooled, plus extra for greasing", "½ tsp almond extract", "8 fresh figs, stems removed, cut in half", "1 tbsp vegetable oil", "2 shallots, finely diced", "1 tsp finely chopped fresh rosemary", "100g/3½oz sultanas", "50g/1¾oz raisins", "50g/1¾oz dark brown sugar", "200ml/7fl oz cider vinegar", "50g/1¾oz crystallised ginger, finely sliced", "310g/11oz dried figs, cut in half", "1 tsp ground allspice", "400g/14oz cheddar cheese, sliced"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5 and lightly grease a 23cm/9in fluted flan tin or cake tin that's 4cm/1½in deep.", "In one bowl, mix together the ground almonds, sugar, plain flour, baking powder, cinnamon, and salt.", "In another bowl, whisk together the eggs, butter, and almond extract.", "Stir the dry ingredients into the wet, and whisk until just mixed.", "Pour the batter into the prepared tin.", "Arrange the figs cut-side up over the batter, pushing the figs gently into the batter.", "Sprinkle the remaining two tablespoons of sugar over the figs, then bake for about 30 minutes, or until the cake is set in the centre.", "Let the cake cool for ten minutes then turn it out of the tin onto a wire rack. Allow it to cool to room temperature before serving.", "For the dried fig chutney, heat the oil in a saucepan. Once hot, add the shallots and gently fry for 2-3 minutes. Add the rosemary, sultanas, raisins and sugar and fry until the fruit begins to caramelise. Add the rest of the ingredients, bring to the boil, reduce the heat and simmer for 5-10 minutes.", "Serve a slice of the cake on a plate with the chutney and slices of cheddar cheese."]}, {"isVegetarian": true, "title": "Fig, cream cheese and mint tart", "url": "www_bbc_co_uk_food_recipes_fig_cream_cheese_and_65349", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fig_cream_cheese_and_65349_16x9.jpg", "ingredients": ["250g/9oz plain flour ", "125g/4½oz cold butter, cubed ", "2 free-range egg yolks ", "large pinch salt ", "1-4 tbsp water, if needed ", "plain flour, for dusting ", "260ml/9½fl oz whipping cream ", "165g/5½oz cream cheese ", "3 big squidges of honey ", "1 tbsp Marsala (optional) ", "12–16 figs, each cut into 6 pieces ", "handful green shelled pistachios, walnuts or pecans, halved ", "1 bunch fresh mint, ripped or roughly torn "], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour and butter in a food processor and pulse to make breadcrumbs. ", "Alternatively use your hands and rub the butter and flour together in a bowl until the mixture resembles fine breadcrumbs. ", "Add the egg yolks and a pinch of salt, and stir together with a knife. Press the mixture together into a ball. If the pastry feels very dry, add a little water, but try to avoid adding water if you can. ", "Once the pastry is all pressed together, wrap in cling film and pop it in the fridge to rest for 30 minutes. ", "After 30 minutes, remove the pastry from the fridge and set it aside to warm up a little (if you use it straight from the fridge and try to roll it out, the pastry will just be a hopeless crumbly mess). ", "Preheat the oven to 180C/350F/Gas 4. ", "Roll the pastry out on a floured work surface to the thickness of half a £1 coin and use it to carefully line a 20 x 30cm/8 x 12in rectangular fluted tin. Homemade pastry is often quite crumbly. Don’t be alarmed by this, you can always patch it together in the tin. ", "Take a small ball of the pastry (the size of a £1 coin) and use it to gently ease the dough down into the tin. Press the handle of a wooden spoon against the pastry all round the edges to coax it into the fluted grooves. Trim off the excess around the top and run a thin knife around between the pastry and the edge of the tin to loosen. Put in the fridge for about 15 minutes, or until firm. ", "Remove the tart from the fridge. Take a piece of baking paper slightly larger than the tin and scrunch it up, then unscrunch it and line the tin with it. Fill it with baking beans or dried beans and ‘blind bake’ in the oven for 20–25 minutes, or until the pastry feels sandy to the touch. Remove from the oven and set aside. ", "Put the cream in a bowl and whip until beginning to thicken. Put the cream cheese into a separate bowl and fold the cream into the cream cheese. Mix with the honey and Marsala, if using. Put the filling in the tart case, then arrange the figs on top and scatter over the nuts and mint. "]}, {"isVegetarian": true, "title": "Fig Dutch baby", "url": "www_bbc_co_uk_food_recipes_fig_dutch_baby_01111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz ground almonds", "1 free-range egg white", "120g/4½oz caster sugar", "1 orange, zest and juice", "125g/4½oz flour", "125ml/4fl oz milk", "3 free-range eggs", "pinch cinnamon", "pinch salt", "30g/1oz butter", "25g/1oz salted butter", "pinch caster sugar", "6–8 figs ", "few thyme sprigs, leaves picked", "100ml/3½fl oz masala wine", "100g/3½oz mascarpone", "50g/1¾oz flaked almonds", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "To make the almond butter, mix together the ground almonds, egg white, caster sugar and orange zest in a bowl. Place on some cling film and roll into a log. Wrap up well and place in the fridge. ", "To make the batter, whisk together the flour, milk, eggs, cinnamon and salt in a bowl. ", "Heat the butter in a 25cm/10in cast iron frying pan or 28x21x4cm/11x8x2in roasting tray. Pour in the batter and bake for 20–25 minutes or until risen and golden brown at the edges. ", "Meanwhile, to make the caramelised figs, melt the butter in a large frying pan over a medium heat. Add the sugar and mix together to make a caramel. Add the figs and caramelise for 5 minutes. Add the masala and the orange juice and simmer until the volume of the liquid is reduced by half. Remove from the heat and mix through a few thyme leaves. Set aside.  ", "To serve, fill the risen batter with the caramelised figs and dot with the almond butter. Serve with mascarpone, flaked almonds and a sprinkling of icing sugar. "]}, {"isVegetarian": false, "title": "Fig flapjacks", "url": "www_bbc_co_uk_food_recipes_fig_flapjacks_60233", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fig_flapjacks_60233_16x9.jpg", "ingredients": ["150g/5½oz butter", "100g/3½oz golden caster sugar", "175ml/6fl oz maple syrup, plus extra for drizzling", "200g/7oz rolled oats", "100g/3½oz sultanas", "10 dried apricots, chopped", "2 tbsp ground almonds", "5 figs"], "serves": "Makes 8 flapjacks", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a large pan melt the butter, sugar and maple syrup. When melted add the oats, sultanas and chopped apricots. Sprinkle over the ground almonds. Stir well.", "Tip the contents of the pan into a lined baking tray. Press down so the mixture is evenly distributed. Thinly slice the figs and scatter over the top of the mixture.", "Trickle a little maple syrup over the top and bake for 25-30 minutes."]}, {"isVegetarian": true, "title": "Fig, prosciutto and gorgonzola pizza", "url": "www_bbc_co_uk_food_recipes_fig_prosciutto_and_90004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour, plus extra for flouring", "5g/¼oz salt", "30ml/1fl oz olive oil", "5g/¼oz fast-action yeast", "180ml/6fl oz water", "semolina, for dusting (optional)", "1 small onion, sliced thinly and lightly fried in oil until caramelised", "75-100g/2½oz-3½oz gorgonzola (or a similar vegetarian blue cheese)", "4 slices prosciutto", "2 ripe figs, cut into quarters", "small handful grated pecorino", "drizzle olive oil", "dash of good-quality balsamic vinegar", "salt and freshly ground black pepper", "handful of rocket"], "serves": "Makes 3", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza dough, mix the flour, salt, olive oil, yeast and water together in a bowl. ", "Turn the dough out onto an oiled work surface and knead for 5-10 minutes, or until the dough is smooth and elastic. Cut off a small piece of the dough and stretch part of it as thinly as you can. If you can see the shadow of your fingers through the dough - the light should shine through the dough like a window pane - without the dough tearing, it is ready to prove. ", "Shape the dough into a ball and tip into a bowl. ", "Cover with a damp tea towel and leave to rise for an hour.", "Divide the mix into three balls. Roll out on a floured surface into circles. Place each circle on a flat baking tray or a plastic chopping board dusted with semolina (so the pizza can be easily transferred to the oven later).", "Place a pizza stone or an upturned baking tray into the oven and heat the oven to 220C/425F/Gas 7 (in a non-fan oven).", "For the topping, cover the bases with the onion slices and sprinkle on the crumbled gorgonzola.  Lay the ham and fig quarters on top and dust with the pecorino. ", "Drizzle over a little olive oil and a sprinkle of balsamic vinegar. Season with salt and freshly ground black pepper. ", "When ready to bake, slide the pizza directly onto the hot pizza stone or baking tray and bake in the oven for 8-10 minutes, or until the base is golden-brown and the topping is bubbling.", "Serve with rocket leaves on top. "]}, {"isVegetarian": false, "title": "Fig tart tatin with honey-glazed confit duck and Puy lentils", "url": "www_bbc_co_uk_food_recipes_fig_tart_tatin_with_10491", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g table salt per kilo of duck legs", "2 tsp thyme leaves", "2 tsp rosemary, finely chopped", "2 garlic cloves, peeled and finely chopped", "4 duck legs", "600ml/20fl oz duck fat", "2 bay leaves", "250g/9oz plain flour", "½ tsp salt", "250g/9oz cold butter, cut into small cubes", "125ml/4fl oz ice-cold water", "110g/4oz caster sugar", "110g/4oz butter", "4 figs, peeled, cores removed, cut in half", "50g/1¾oz unsalted butter", "2 tbsp olive oil", "150g/5½oz bacon lardons", "1 onion, finely chopped", "1 clove garlic, finely sliced", "1 small carrot, finely chopped", "1 stick celery, finely chopped", "¼ leek, finely chopped", "300g/10½oz dried Puy lentils", "175ml/6fl oz red wine", "450ml/16fl oz beef stock", "2 tbsp good sherry vinegar", "2 tbsp fresh coriander", "50g/1¾oz butter", "4 tbsp clear honey", "200ml/7fl oz veal jus, or reduced beef stock"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the confit of duck, preheat the oven to 140C/120C Fan/Gas 1.", "Mix the salt, herbs and garlic in a bowl. Add the duck legs, cover them in the mixture. Cover the bowl and leave in the fridge for 24 hours.", "Rinse the salt mixture from the duck legs. Put them in an ovenproof saucepan with the duck fat and bay leaves. Bring the pan up to a simmer, cover and place in the oven for 2½ hours. Remove from the oven, lift the duck legs out of the fat and set aside.", "For the rough puff pastry, place the flour and salt into a large mixing bowl. Add the butter and use your hands to rub the butter into the flour.", "When the flour and butter mixture resembles breadcrumbs, add the cold water. Mix it in with a round-tipped knife to keep the mixture cool. When the mixture comes together to form a dough, turn it out onto a clean, floured work surface and knead briefly until just smooth.", "Form the dough into a rectangular block (this will make it easier to roll out later), wrap in cling film and refrigerate for 20 minutes.", "Roll the dough out on a clean, floured work surface into a rectangle approximately 40x20cm/16x8in.", "Take one of the short edges of the pastry and fold one-third of the dough into the centre, then fold the other third over that. Turn the pastry by 90 degrees and repeat the rolling and folding.", "Wrap the pastry in cling film, refrigerate for 20 minutes, and then repeat the rolling and folding.", "Wrap the pastry block in cling film and refrigerate for 30 minutes more before using.", "For the fig tart, preheat the oven to 200C/180C Fan/Gas 6.", "Heat the sugar in a 24cm/9½in ovenproof frying pan over a low heat until it has caramelised. Add the butter and heat gently until the mixture forms a smooth caramel. Turn off the heat and carefully place the figs in the hot caramel, cut-side up.", "Roll the chilled pastry out onto a floured work surface to a 5mm/¼in thickness. Cut the pastry into a circle slightly larger than the frying pan.", "Place the pastry circle over the figs. Tuck the edges of the pastry inside the pan to surround the figs.", "Transfer to the oven and bake for 20-25 minutes, or until the pastry is risen, golden-brown and cooked through. Remove from the oven and set aside to cool for 5-10 minutes.", "For the lentils, heat a pan and add the butter and oil. Once hot, add the bacon lardons and cook until lightly browned then add the onion and cook for 2 minutes, Add the garlic, carrot, celery and leek and cook for a further 2 minutes.", "Add the lentils and red wine and bring to the boil. Cook until the wine has reduced in volume by half then add the stock and cook for 25-30 minutes. Finish with the sherry vinegar and fresh coriander.", "When you are ready to serve, heat a medium frying pan and add the butter, once hot add the duck and colour on both sides and add the honey and glaze.", "Loosen the edges of the tart and place a large serving plate or board on top of the frying pan. Very carefully, but quickly, turn it over, using a folded dry tea towel to help you hold it, and allow the tarte tatin to drop gently onto the serving plate. ", "Put the cooked lentils in a serving bowl and place the duck on top. Finish with the jus or stock."]}, {"isVegetarian": true, "title": "Dark chocolate and fresh fig tarts", "url": "www_bbc_co_uk_food_recipes_figandchocolatetarts_84848", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz unsalted butter, plus extra for greasing", "225g/8oz plain flour, plus extra for flouring", "pinch salt", "2 tbsp caster sugar", "2 tbsp ground almonds", "1 free-range egg, lightly beaten", "2-3 tsp cold water", "275g/10oz dark chocolate, min 70% cocoa solids", "3 medium free-range eggs", "40g/1½ oz caster sugar", "60ml/2½ fl oz double cream", "8 fresh figs", "250g/9oz raspberries", "2 tbsp icing sugar", "1 tbsp lemon juice", "ready-made white chocolate ice cream", "fresh mint sprigs, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the butter, flour, salt, caster sugar and ground almonds into a food processor and blend until the mixture resembles fine breadcrumbs.", "Add the beaten egg and 2-3 tsp cold water and blend until a dough is formed.", "With floured hands, turn the dough out of the food processor and knead very gently to bring together. Flatten the dough slightly, cover in cling film and place in the fridge to rest for at least 30 minutes, preferably 1-2 hours.", "Preheat the oven to 190C/375F/Gas 5.", "Lightly grease 4 x 10cm/4in fluted tart cases with butter.", "Lightly flour the work surface and divide the pastry into four. Roll out each piece of pastry so that it is slightly bigger than the tart cases. ", "Place the pastry into each tart case and push into the edges, leaving the excess pastry hanging over the top. Place a sheet of baking parchment into each case and fill with baking beans or rice.", "Place the tart cases onto a baking sheet, transfer to the oven and bake for 15 minutes, or until just golden-brown. Remove from the oven, remove the baking parchment and beans and return to the oven for another five minutes. ", "Remove from the oven, trim the excess pastry from the top of the tart to give a clean edge and set aside.", "For the filling, place the chocolate into a bowl over a saucepan of simmering water and heat until melted.", "Place the eggs and sugar into a clean bowl and whisk together until pale.", "Pour the melted chocolate into the eggs along with the cream and mix well to combine.", "Scoop the flesh from four of the figs and add to the chocolate mix, stirring carefully.", "Spoon the chocolate mixture into each of the four pastry cases. Slice the remaining figs and place three slices on top of each of the chocolate tarts.", "Place the tarts onto a baking sheet, transfer to the oven and bake for 10-15 minutes, or until just set.", "Meanwhile, for the raspberry sauce, place the raspberries, sugar and lemon juice into a food processor and blend until smooth, then pass the mixture through a sieve to remove the raspberry pips.", "To serve, place a spoonful of raspberry sauce in the centre of four serving plates. Place a warm fig and chocolate tart on top of the sauce with a scoop of white chocolate ice cream and a sprig of mint, to garnish."]}, {"isVegetarian": true, "title": "Fig and date scones", "url": "www_bbc_co_uk_food_recipes_figanddatescones_66042", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour", "85g/3oz sugar", "30g/1oz baking powder", "85g/3oz butter", "2 eggs", "225ml/8fl oz milk", "55g/2oz dates", "55g/2oz figs"], "serves": "Makes 10-12 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Put all the ingredients in a bowl except the dates and figs, gently bring the mixture together until you have a soft dough-like texture.", "Add the dates and figs and roll the dough out using a rolling pin to about 4cm/1½\" deep.", "Cut out scone shapes with a round cutter and place them on a baking sheet.", "Brush with egg wash and bake for 20 minutes until golden brown."]}, {"isVegetarian": false, "title": "Fig and pancetta tart with dolcelatte", "url": "www_bbc_co_uk_food_recipes_figandpancettatartwi_68030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz puff pastry", "8 fresh ripe figs, quartered", "140g/5oz dolcelatte cheese, diced", "6 fine slices pancetta", "salt and freshly ground pepper", "1 tbsp olive oil", "beaten egg, for glazing", "110ml/4fl oz double cream", "half a handful of coriander leaves", "1 tsp fresh coriander sprigs", "1 tsp fresh mint sprigs", "110g/4oz baby spinach", "extra virgin olive oil", "balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Roll out the puff pastry into a round or square, about 25cm/10in across, and place on a greased baking sheet. ", "Place the figs on the pastry, leaving a 1cm/½in gap around the edge of the tart. ", "Dot the dolcelatte over the figs, then top with the pancetta. Season with salt and freshly ground pepper. Drizzle over the olive oil. ", "Brush the edges of the tart with a little of the beaten egg. ", "Bake the tart for 10 minutes. ", "Remove the tart from the oven and pour over the double cream. Sprinkle with the coriander leaves. ", "Return the tart to the oven and bake for a further 6-8 minutes. ", "Meanwhile, make the salad. Toss together the coriander, mint and baby spinach. Dress with a little olive oil and balsamic vinegar. ", "Serve the tart warm from the oven with the salad on the side."]}, {"isVegetarian": true, "title": "Fig and strawberry tempura with lemon verbena crème brûlée and strawberry sauce", "url": "www_bbc_co_uk_food_recipes_figandstrawberrytemp_87458", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "50g/2oz plain flour", "50g/2oz cornflour", "pinch salt", "75-110ml/3-4fl oz ginger ale", "4 figs, halved lengthways", "75-110ml/3-4fl oz sparkling water", "12 strawberries", "125ml/4½fl oz milk", "3 sprigs fresh lemon verbena", "5 free-range egg yolks", "75g/3oz caster sugar", "375ml/13fl oz double cream", "25g/1oz demerara sugar", "250g/9oz strawberries, hulled and chopped ", "1-2 tbsp icing sugar"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the tempura, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place half of the flour, cornflour and salt into a bowl and gradually stir in enough ginger ale to make a batter. Don't over-mix - it doesn't matter if a few lumps remain.", "Dip the figs into the batter to coat completely. Place into the hot oil and deep fry until golden-brown and crisp. Remove from the pan with a slotted spoon and drain on kitchen paper.", "Place the remaining flour, cornflour and salt into another bowl and gradually stir in enough sparkling water to form a batter.", "Dip the strawberries into the batter to coat completely. Place into the hot oil and deep fry until golden-brown and crisp. Remove from the pan with a slotted spoon and drain on kitchen paper.", "Preheat the oven to 150C/300F/Gas 2.", "For the crème brûlée, place the milk into a saucepan, add the lemon verbena and bring to the boil. Remove from the heat and allow to cool and infuse for a few minutes.", "Place the egg yolks into a large bowl with the sugar and whisk until combined.", "Pour the milk mixture into the bowl along with the cream and whisk thoroughly.", "Place four ramekins into a roasting tin and pass the cream mixture through a sieve into the ramekins. Pour in enough boiling water to come halfway up the sides of the ramekins.", "Transfer to the oven and bake for an hour, or until just set. Remove the ramekins from the tin and allow to cool.", "Once cooled, place the ramekins into the freezer until the custards are solid.", "Use a knife to loosen around the edges of the ramekins and carefully tip the custards out of their ramekins onto a board. Using a pastry cutter, cut out a circle from each custard to make cylinders slightly smaller in diameter than the ramekins. Place onto serving plates and leave to soften for five minutes.", "For the strawberry sauce, place the strawberries and icing sugar into a small food processor and blend until smooth. Pass the mixture through a sieve into a bowl to remove the seeds. Taste to check the sweetness and add more sugar if necessary.", "To serve, sprinkle the demerara sugar over the top of the crème brûlées and caramelise with a mini-blowtorch. Place two fig halves and three strawberries onto each plate and drizzle over the strawberry sauce."]}, {"isVegetarian": true, "title": "Fig compote", "url": "www_bbc_co_uk_food_recipes_figcompote_11593", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz white wine vinegar", "400ml/14fl oz water", "1 small cinnamon stick", "2 cloves", "4 cardamom pods, crushed", "1 red chilli, sliced", "1 thumbs ginger, peeled and roughly chopped", "140g/5oz caster sugar", "1 tsp sea salt", "20 dried figs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place everything in a saucepan and boil gently, uncovered, for 5 minutes. ", "Allow to cool before refrigerating"]}, {"isVegetarian": true, "title": "Fig fritters with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_figfritterswithvanil_81001", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "2 tbsp cornflour", "fizzy cold water", "vegetable oil, for frying", "8 figs", "vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Make the batter by sieving the plain flour and cornflour together into a large bowl. Whisk in enough fizzy cold water to make a batter the consistency of double cream.", "Heat the oil in a deep heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip each fig into the batter, then carefully place into the hot oil. Deep fry for 2-3 minutes until crisp and golden brown. Remove using a slotted spoon and drain on kitchen towel.", "Serve at once with scoops of vanilla ice cream."]}, {"isVegetarian": false, "title": "Figgy dowdy pudding with custard", "url": "www_bbc_co_uk_food_recipes_figgy_dowdy_pudding_with_81941", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["115g/4oz raisins", "115g/4oz sultanas", "5 tbsp rum", "1 tsp ground ginger", "½ tsp mixed spice", "450g/1lb plain flour", "115g/4oz shredded suet", "115g/4oz caster sugar", "4 free-range eggs, yolks only", "40g/1½oz caster sugar", "150ml/5fl oz milk", "150ml/5fl oz double cream"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pudding, place the raisins and sultanas into a bowl with the rum and 200ml/7fl oz water and mix to combine. Set aside for at least four hours, preferably overnight.", "Place the remaining ingredients into a bowl and mix to combine. Add the soaked fruit and any residual liquid and mix to a make a soft dough.", "Lay a large piece of aluminium foil onto a work surface then spoon the dough onto it, forming it into a log shape. Roll the dough up in the foil, twisting the ends to secure. Wrap the roll in a piece of muslin or, as was traditional, in a shirt sleeve, and tie the ends with kitchen string.", "Place the roll onto a heatproof plate in a large pan, then pour over enough water to cover the plate. Cover the pan with a lid and place over a medium heat on the hob. Bring to a boil, then reduce the heat to a gentle simmer and cook for two hours or until cooked through. Top up the water as necessary as the pudding cooks.", "Remove from the pan and leave to rest for five minutes then remove the muslin – or shirt sleeve - and the foil.", "Meanwhile, make the custard. Place the egg yolks and sugar in a bowl and whisk until thick and pale.", "Place the milk and cream into a saucepan and bring to the boil. Pour onto the egg mixture, whisk well then return the mixture to the pan and heat slowly, until the custard has thickened enough to coat the back of the spoon.", "To serve, slice the pudding into thick slices and ladle the custard over the top."]}, {"isVegetarian": false, "title": "Fig roly poly pudding", "url": "www_bbc_co_uk_food_recipes_figgy_roly_poly_pudding_92371", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar ", "200g/7oz shelled, chopped walnuts ", "397g/14oz can condensed milk", "50g/1¾oz thyme honey", "50g/1¾oz soft mild goats’ cheese (without rind)", "600ml/20fl oz double cream ", "1 x 250g/9oz pack semi-dried figs, tops trimmed ", "1 lemon, juice and zest only", "40g/1½oz thyme honey ", "1 tbsp lemon thyme", "175g/6oz self-raising flour, plus extra for dusting", "pinch salt", "100g/3½oz shredded suet", "75g/2½oz ground almonds", "1 lemon, zest only", "100g/3½oz full-fat milk, plus extra for brushing", "2 free-range egg yolks, plus 1 free-range egg, beaten, to glaze", "50g/1¾oz thyme honey", "1 tsp vanilla extract", "vanilla-infused sugar for sprinkling, to taste", "about 2 tbsp thyme honey, to taste", "3 fresh figs (optional)", "1 lemon wedge (optional)", "fresh lemon thyme (optional)", "vanilla pods, scrapped (optional)"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the caramelised walnut and honey ice cream, start with the caramelised walnuts. Place the caster sugar in a small heavy-based saucepan and heat over a medium heat until all the granules have melted and a caramel forms. Lay the walnuts on a sheet of foil and pour the caramel over the walnuts. Leave to set and cool. ", "Beat together the condensed milk, honey and goats’ cheese in a bowl until smooth. Whip the cream in a separate bowl until soft peaks form when the whisk is removed from the bowl and fold through the condensed milk, honey and goats’ cheese. Break up half of the caramelised walnuts and stir them through the mixture. Set aside the remaining caramelised walnuts.", "Transfer the mixture to a freezer-proof container and place in the freezer - alternatively place in an ice cream maker and freeze according to manufacturer’s instructions.", "For the fig filling, combine all the ingredients in a medium heavy-based saucepan with one tablespoon of water. Place over a low heat, stirring well until everything is well combined. Simmer and stir occasionally for about 10 minutes, or until the mixture is thick and the liquid has evaporated. Remove the pan from the heat and blend with a hand-held blender.  Set aside for 10 minutes to cool slightly. ", "For the suet pastry, preheat the oven to 180C/fan oven 160C/350F/Gas 4.", "Place the flour, salt, suet, ground almonds and lemon zest in a large bowl and stir together until well combined. Measure the milk into a jug and beat in the egg yolks, honey and vanilla extract. Slowly add the wet mixture to the bowl of dry ingredients and mix to a soft, but not sticky dough. Tip the dough out onto a floured surface and roll out to a 20 x 30cm/8 x12in rectangle. ", "Spread the fig filling onto the dough, leaving a 1cm/½in border all the way round. Gently roll the dough up from the short end, brushing with milk and transfer to a greaseproof paper-lined baking tray, seam-side down. Brush with a little beaten egg and sprinkle with vanilla sugar. ", "Bake for about 40 minutes, or until golden-brown, covering with a sheet of foil should the top and sides appear to be browning too much.", "Remove from the oven and leave to cool slightly. Drizzle over the thyme honey to taste and place the remaining caramelised walnuts over the top of the roll. Serve with the ice cream. ", "You could also decorate with fresh figs (one cut in half, the other two with a cross on the top and the flesh opened slightly), plus a lemon wedge, fresh thyme and scraped vanilla pods around the pudding to reference the ingredients inside."]}, {"isVegetarian": true, "title": "Fig and hazelnut tart with spicy wine syrup", "url": "www_bbc_co_uk_food_recipes_fighazelnuttartwiths_84357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm x 12cm/2in x 5in rectangle", "puff pastry, plus extra rectangle cut into a lattice pattern", "2 whole figs, cut into 0.5cm/¼in slices", "2 tbsp caster sugar", "½ tsp vanilla extract", "2 tbsp hazelnuts, chopped", "1 free-range whole egg, beaten to use as a glaze", "100ml/3½fl oz red wine", "1 tsp mixed spice", "50g/1¾oz caster sugar", "1 vanilla pod, seeds only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tart, place the pastry rectangle onto a baking sheet.", "Place the sliced figs onto the pastry, and sprinkle over the sugar, vanilla extract and hazelnuts.", "Carefully place the pastry lattice on top of the figs then brush with the egg.", "Transfer into the oven for 10 minutes until golden.", "Remove from the oven, and cut the fig tart into slices.", "For the spicy wine syrup, heat all the ingredients in a saucepan over a medium heat and gently cook to dissolve the sugar. ", "When the sugar has dissolved, turn up the heat to high and rapidly boil the liquid to reduce until thick and syrupy.", "To serve, place the fig tart slices one on top of the other and drizzle over the syrup."]}, {"isVegetarian": true, "title": "Baked figs with honey and thyme and Sauternes sabayon", "url": "www_bbc_co_uk_food_recipes_fighoneyandthymegrat_87363", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fresh figs", "2 tbsp clear honey", "30g/1oz butter, cubed", "2 sprigs fresh thyme", "2 free-range egg yolks", "30g/1oz caster sugar", "75ml/2½fl oz Sauternes wine", "1 sprig fresh thyme"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the baked figs, cut a cross into the top of each fig and squeeze the bottom slightly to open it out. Place in a gratin dish, drizzle over the honey, butter and thyme and bake for 6-7 minutes. Remove from the oven and set aside to cool slightly.", "For the sabayon, place the egg yolks, sugar and auternes into a bowl that fits snugly over a pan of gently simmering water and whisk constantly until the mixture  thickenRemove from the heat and continue to whisk for a couple of minutes, or until cooled slightly. ", "To serve, place the figs on a serving plate. Pour the sabayon over the figs. Using a blowtorch, carefully caramelise the top of the figs. (Alternatively, you could place in under the grill until caramelised.) Garnish with the sprig of thyme."]}, {"isVegetarian": false, "title": "Figs wrapped in pancetta with watercress salad", "url": "www_bbc_co_uk_food_recipes_figswrappedinpancett_89373", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 fresh figs, halved", "6 sliced pancetta", "2 tbsp balsamic vinegar", "3 tbsp olive oil", "salt and freshly ground black pepper", "½ bunch watercress, leaves only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the figs, wrap each fig half in a slice of pancetta. Heat a frying pan, then add the figs and fry over a medium heat for 2-3 minutes on each side, or until the pancetta has turned golden-brown and crisp.", "For the salad, whisk the balsamic vinegar and olive oil in a bowl and combine. Season to taste with salt and freshly ground black pepper.", "Pour the dressing over the watercress and mix gently to coat the leaves. ", "To serve, place the salad into the centre of a serving plate with the figs arranged around the edge, and drizzle over any remaining dressing."]}, {"isVegetarian": true, "title": "Fig rolls", "url": "www_bbc_co_uk_food_recipes_figrolls_92754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dried figs, finely chopped", "1 tbsp brandy", "1 tbsp rosewater", "300ml/10½fl oz water", "75g/2¾oz wholemeal flour", "75g/2¾oz plain flour, plus extra for dusting", "75g/2¾oz butter, plus extra for greasing", "50g/2oz caster sugar", "pinch salt", "30-50ml/1-2fl oz water"], "serves": "Makes 12-15", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, bring the figs, brandy, rosewater and water to a simmer in a pan, stirring well until combined. Continue to simmer for 15-20 minutes, or until the fruit has softened and most of the liquid has evaporated (the mixture should resemble jam).", "Remove the pan from the heat and set aside for 10 minutes to cool slightly. Transfer the mixture to a food processor and blend until smooth.", "Preheat the oven to 180C/350F/Gas 4. Grease a baking tray with butter.", "For the pastry, blend the wholemeal flour, plain flour, butter, sugar and salt in a food processor until the mixture resembles breadcrumbs.", "With the motor still running, gradually add the water in a thin stream until the mixture comes together as a dough (you may not need to use all of the water).", "Turn out the dough onto a lightly floured work surface and wrap in cling film. Chill in the fridge for 20 minutes. ", "When the dough has chilled, roll it out onto a lightly floured work surface to a 40cm x 12cm/16in x 5in rectangle. ", "Spread the filling mixture lengthways down the centre of the pastry rectangle. Fold one of the edges of the pastry over the filling mixture, then cover with the other edge of the pastry.", "Slice the filled pastry into 12-15 7.5cm/3in slices and place each slice onto the prepared baking tray, folded edge down. Press the flat of a wet fork into the top of each fig roll to create a ridged effect. Bake in the oven for 18-20 minutes, or until crisp and golden-brown. Remove from the oven and transfer to a wire rack to cool."]}, {"isVegetarian": false, "title": "Figs wrapped with crispy bacon", "url": "www_bbc_co_uk_food_recipes_figswrappedwithcrisp_84211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 figs", "50g/3½oz Camembert, cut into 3 pieces", "salt and freshly ground black pepper", "1 tsp butter", "3 rashers streaky bacon"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Make a criss-cross in the top of each fig, pinch the base to expand the opening at the top, and stuff each with a Camembert piece. Season, to taste, with salt and freshly ground black pepper.", "Heat the butter in a small ovenproof frying pan and fry the figs for one minute. Place the pan into the oven and roast for six minutes, or until the cheeseis melted and golden. ", "In a separate pan, fry the bacon on both sides for 4-5 minutes, or until crisp. Remove the figs from the oven and wrap each one with a rasher of bacon. ", "To serve, place the bacon-wrapped figs onto a plate."]}, {"isVegetarian": true, "title": "Fig tatin", "url": "www_bbc_co_uk_food_recipes_figtatin_78667", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ pack ready-rolled puff pastry", "2 figs, cut in half", "25g/1oz butter", "2tbsp caster sugar", "2 tbsp Greek yoghurt"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Using a very small, oven-proof frying-pan as a guide, cut a round from a sheet of ready-rolled puff pastry, leaving an extra inch width around.", "Place the small, oven-proof frying-pan over a medium heat and add the butter and sugar.", "Add the figs cut side down and cook for four minutes allowing the sugar to caramelise.", "Place the pastry round over the frying pan and cut a small air hole in the centre. Transfer to the oven and bake for ten minutes, or until the pastry is golden. ", "To serve, turn the tatin onto a service plate and serve with two tablespoons of Greek yoghurt."]}, {"isVegetarian": false, "title": "Fillet of beef Prince Albert", "url": "www_bbc_co_uk_food_recipes_fillet_of_beef_prince_42045", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fillet_of_beef_prince_42045_16x9.jpg", "ingredients": ["3 tbsp sunflower oil", "1 onion, sliced", "1 garlic clove, finely chopped", "2 carrots, diced", "2 celery stalks, thinly sliced", "1kg/2lb 4oz beef fillet, trimmed", "75g/3oz duck liver pâté (parfait)", "sea salt and freshly ground black pepper", "½ tsp truffle oil (optional)", "6-8 rindless streaky bacon rashers", "3-4 fresh bay leaves", "100ml/3½fl oz cognac", "200ml/7fl oz Madeira", "150ml/5fl oz fresh beef stock", "handful chopped fresh parsley", "creamed potatoes", "green beans "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a frying pan. Fry the onion, garlic, carrots and celery for 10-12 minutes, or until softened and golden-brown. (You may need to increase the heat toward the end of the cooking time to encourage the vegetables to brown.) Spoon the cooked vegetables into a casserole dish. ", "Place the beef fillet onto a chopping board. Cut a pocket in the side of the fillet, leaving a 2cm/1in gap at each end. (Make sure that you only make an incision halfway into the meat and that you don’t cut the meat into two pieces). ", "Cut the pâté into 1.5cm/½inwide strips, place them inside the pocket and drizzle with the truffle oil, if using. Close the pocket to encase the filling. Season the beef all over with sea salt and plenty of freshly ground black pepper. ", "Wrap the beef in the bacon rashers and secure with kitchen string. Place a bay leaf between the bacon and string every other rasher. Set aside.", "Preheat the oven to 180C/350F/Gas 4. ", "Heat the frying pan and add the remaining oil and brown the beef fillet in the frying pan for 10-12 minutes, or until the bacon is crisp and golden-brown. Place the beef fillet on top of the vegetables.", "Remove all but two tablespoons of fat from the frying pan and stir in the flour. Slowly add the cognac, stirring constantly. Once the mixture is boiling, add the Madeira, followed by the beef stock. Bring the liquid to a simmer then pour immediately around the beef. Cook the beef in the oven for 30-35 minutes for rare beef, or 40 minutes for medium-rare.", "Carefully remove the beef onto a chopping board, cover with a piece of foil and two tea towels. Return the casserole to the hob and simmer for 2-3 minutes, or until the liquid thickens slightly.  Strain through a fine sieve into a warmed jug. Carve the beef into thick pieces.", "Pour some of the sauce into six deep plates. Place the beef on top and garnish with fresh parsley and serve with creamed potatoes and green beans. "]}, {"isVegetarian": false, "title": "Fillet of beef, with potato and beetroot rosti, baby beets and Madeira sauce", "url": "www_bbc_co_uk_food_recipes_fillet_of_beef_with_14742", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "4 x 200g/7oz middle-cut beef fillet", "180g/6½oz unsalted butter", "200g/7oz salsify, peeled and cut into 2cm/1in batons (keep in a bowl of citrus water to prevent browning)", "1 banana shallot, thinly sliced", "100ml/3½fl oz Madeira", "175ml/6fl oz veal jus or stock (alternatively you can use beef stock)", "2 tbsp finely chopped fresh chervil", "salt and freshly ground black pepper", "4 large Maris Piper potatoes, scrubbed, not peeled, coarsely grated", "2 beetroots, peeled, coarsely grated", "75g/2½oz crème fraîche", "1 free-range egg, yolk only", "1 tbsp finely chopped fresh parsley", "70g/2½oz butter", "1 bunch baby beetroots", "1 bunch heritage or candied beetroot"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Heat the oil in a medium frying pan. Once hot add the beef and cook on each side for 2-3 minutes.", "Add 75g/2¾oz butter to the pan and place in the oven for 4-5 minutes depending on the weight of your fillet steak. Leave to rest. ", "Add 75g/2¾oz butter to a hot pan. Add the salsify and and stir-fry for 3-4 minutes, or until tender and golden-brown.", "In a clean pan, heat the remaining butter until foaming then add the shallot. Fry for 3-4 minutes, or until golden-brown.", "Add the Madeira and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight. Cook until the liquid has reduced in volume by three-quarters. Add the veal stock, stirring well, and cook for 3-4 minutes, or until reduced in volume by half. Season, to taste, with salt and black pepper. Stir in the chervil.", "For the rosti, put the potatoes in a clean tea towel inside a bowl and squeeze out any excess water. Transfer the potato and beetroot into a clean bowl along with the crème fraîche, egg, parsley, salt and pepper. Stir until well combined.", "Heat 35g/1¼oz butter in an ovenproof frying pan over a medium heat and place 2 x 7.5cm/3in chefs' rings in the pan. Spoon the potato mixture into the rings, press down well using a spoon, and cook for 3-4 minutes, or until golden-brown. Remove the rings, turn the rosti, press the mixture down and cook for a further 3-4 minutes. Transfer the pan to the oven for 5-10 minutes, or until tender and cooked through.", "Meanwhile, boil the baby beetroots in their skins for 10-15 minutes. Run under cold water and rub off the skins. Heat a medium frying pan and add the remaining butter, add the baby beetroots and cook for 1-2 minutes. Peel the heritage beetroots and cut using a mandolin.", "To serve, place the rosti in the centre of the plate and place the beef on top. Put the salsify and beetroot around the rosti and pour over the sauce. "]}, {"isVegetarian": false, "title": "Fillet of John Dory with black rice, langoustine claws, sweetcorn and tarragon", "url": "www_bbc_co_uk_food_recipes_fillet_of_john_dory_with_47202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["John Dory heads (from below), gills and eyeballs removed ", "8 chicken drumsticks", "50ml/1¾fl oz grapeseed oil", "25g/1oz unsalted butter", "2 shallots, sliced", "10 button mushrooms, quartered", "1 bay leaf", "sprig thyme", "50ml/1¾fl oz sherry vinegar", "200ml/7fl oz Madeira wine", "1 litre/1¾ pint brown chicken stock", "100ml/4fl oz white chicken stock", "50ml/1¾fl oz veal stock", "100g/3½oz unsalted butter", "500g/1lb 2oz shallots, finely sliced", "salt", "250ml/9fl oz whipping cream", "250g/9oz black rice", "800ml/1⅓ pint chicken stock", "salt and freshly ground black pepper", "1 corn on the cob", "25g/1oz unsalted butter", "1 small white onion, diced", "2 field mushrooms, peeled and diced", "8 large langoustine claws (or 8 peeled, raw prawn tails), meat removed from shell", "75g/2½oz plain flour", "1 free-range egg, beaten", "100g/3½oz panko breadcrumbs", "20g/¾oz unsalted butter", "125g/4½oz cooked langoustine claw meat, chopped (alternatively use cooked white crab meat)", "1 tbsp chopped tarragon", "1litre/1¾ pint vegetable oil, for deep frying", "2 lemon wedges", "230ml/8fl oz black rice cooking liquor (reserved from above)", "salt and freshly ground black pepper", "3g lecithin powder", "4 x 550g/1lb 4oz John Dory fish, filleted and cut into 8 110g/4oz portions (ask your fishmonger to do this and give you the heads)", "4 tbsp grapeseed oil", "salt and freshly ground black pepper", "40g/1½oz butter "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, using a meat cleaver, chop the John Dory heads in half and the chicken drumsticks into three pieces. ", "Place a large, heavy-based pan over a high heat and leave for two minutes. Add the grapeseed oil, swiftly followed by the fish heads and drumsticks, and leave to colour for 1-2 minutes. When golden-brown, season lightly with salt, turn over and colour the other side. ", "Add the butter, stir and continue cooking until all the pieces are golden-brown – you will have to scrape away at the bottom of the pan to achieve this. Stir in the shallots, mushrooms, bay leaf and thyme. ", "Add vinegar and cook until it has completely evaporated. Add the Madeira and cook until all but a teaspoon has evaporated.", "Add the stocks, bring to the boil and gently simmer for 30 minutes. Remove from the heat and set aside to rest for 10 minutes. ", "Drain through a colander and then pass the sauce though a fine sieve into a medium saucepan. ", "Return the sauce to the heat, bring to the boil and gently simmer until it has reduced enough to coat the back of a spoon. Check the seasoning and set aside to cool. (It should be a rich, sweet and sour mix of stock and fat in the approximate ratio of 2 to 1. Skim off any fat in excess of this.) Transfer to the fridge.", "For the shallot purée, preheat the oven to 170C/325F/Gas 3. ", "Place a heavy-based casserole over a medium heat and leave for a minute. Add the butter, allow it to melt, then add the shallots and a generous pinch of salt. Cook for five minutes, stirring frequently. ", "Reduce the heat and continue to cook over a gentle heat for 15-20 minutes, still stirring frequently, until the shallots are completely soft and have a light-golden colour. ", "Add the cream, bring to the boil, then cover the casserole and transfer to the oven for ten minutes. ", "Remove from the oven, transfer to a food processor and blend to a smooth purée. Pass through a fine sieve into a bowl, check the seasoning and set aside to cool slightly before transferring to the fridge.", "For the black rice, rinse the rice under cold running water. Place in a heavy-based saucepan, cover with the chicken stock, season with a pinch of salt and place over a medium heat. Bring to the boil and gently simmer for 20 minutes, or until tender. ", "Remove from the heat, leave to sit for five minutes, then drain, reserving 230ml/8fl oz of the cooking liquor. Set both the rice and the reserved cooking liquor aside to cool to room temperature.", "Place the corn in a saucepan, cover with water, bring to the boil and simmer for about 15 minutes, or until tender. ", "Drain and refresh under cold running water for five minutes. Hold the corn upright on a board and use a sharp knife to cut the kernels away. ", "Place a heavy-based saucepan over a medium heat and leave for a minute. Add the butter, followed by the onion and a pinch of salt. Cook for five minutes, stirring frequently, until soft and translucent.  Add the mushrooms and cook for a further 2-3 minutes. Add the corn kernels and mix thoroughly. Season to taste with salt and freshly ground black pepper. Set aside to cool. ", "For the langoustine claw beignet, coat the claw meat (or prawns) by first dipping them in the flour, then the egg and finally the breadcrumbs, ensuring you get one thin, even coating of crumbs. Cover and transfer to the fridge. ", "To serve, reheat the shallot purée and set aside. ", "Melt 20g/½oz of the butter in a pan, add the rice and the sweetcorn mix and heat through. Add the cooked langoustine claw meat (or crab meat) and the tarragon and fry for two minutes. Remove from the heat and keep warm. ", "Reheat the sauce and set aside.", "For the John Dory, preheat the oven to 170C/325F/Gas 3.", "Place two large, heavy-based, non-stick frying pans over a high heat and leave for a minute. Divide the grapeseed oil between the frying pans. Season the John Dory fillets with salt and freshly ground black pepper. Add the fillets to the frying pans skin side down and cook for 1-2 minutes, or until golden. ", "Divide the butter between the pans, turn the fish over and cook for 30 seconds. Transfer the fish to a roasting tray, tip the oil and butter over the top and place in the preheated oven for five minutes. Remove and set aside to rest for two minutes. ", "To serve, transfer one tablespoon of the juices from the roasting tray to the sauce and stir briefly.", "Fill a deep-fat fryer (or deep saucepan) with vegetable oil and heat to 180C/350F. ", "Deep fry the langoustine claw beignets until golden-brown. Remove and drain on a dish lined with kitchen paper. Then squeeze the lemon wedges over them. ", "Reheat 230ml/8fl oz of the reserved black rice cooking liquor. Season with salt and freshly ground black pepper, add the lecithin and blend with a hand blender – it should froth up but will only do this if the liquid is hot but not boiling. ", "Place four small spoonfuls of shallot purée on each plate. In the centre of each plate, put a small heap of black rice mix and sit a fillet of John Dory on top. Spoon a generous tablespoon of sauce over the fish and surround it with the black rice froth. Garnish with a beignet and serve immediately. "]}, {"isVegetarian": false, "title": "Fillet of lemon sole with kale and crab butter sauce", "url": "www_bbc_co_uk_food_recipes_fillet_of_lemon_sole_29298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 shallots, finely sliced", "1 tbsp white wine vinegar", "4 tbsp white wine ", "225g/8oz butter, cut into cubes", "salt and freshly ground black pepper", "100g/3½oz white crab meat", "2 tomatoes, peeled, seeds removed and cut into small dice", "4 tbsp chopped chives", "1 lemon, juice only", "300g/10oz curly kale", "50g/1¾oz unsalted butter", "1 lemon, juice only", "2 lemon sole, filleted and skin removed", "50g/1¾oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab butter sauce, in a saucepan, bring the finely sliced shallots, white wine vinegar and white wine to the boil (don’t use an aluminium saucepan as it could react with the acid). Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan.", "Add a tablespoon of cold water and continue to simmer until the volume of liquid remaining in the pan is about one tablespoon.", "Reduce the heat to low, then gradually whisk in the butter, 25g/1oz at a time, waiting until all of the butter has melted and incorporated into the mixture before adding more.", "Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the crab, tomatoes, chives and finish with the lemon juice. Set aside at room temperature until needed.", "For the kale, heat a large saucepan of boiling water and plunge in the kale. Cook for a couple of minutes, then drain. Plunge the kale into ice cold water, then drain again and dry on kitchen roll.", "Melt the butter in a large frying pan, then add the kale, stirring for a few minutes until wilted.", "Finish the kale with the lemon juice and season with salt and pepper.", "For the fillet of lemon sole, season the sole with salt and freshly ground black pepper.", "Heat a frying pan until hot and add the butter to the pan. Once melted, cook the fish for two minutes on each side..", "To serve, place the kale in the centre of the plate and put two fillets on top, pour the crab butter sauce over and around the plate."]}]