[{"ingredients": ["½ melón Galia, semillas retiradas", "1 naranja, solo jugo", "2 cucharadas de menta fresca picada"], "method": ["Saque la pulpa del melón, pásela en rodajas y coloque en un procesador de alimentos junto con el jugo de naranja y la menta. Reserve la cáscara de melón.", "Licúe hasta que quede suave, luego voltéese a la cáscara de melón y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_melonsoup_90686", "title": "Sopa de melón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ melón de cantalope, pelado y rebanado", "2 rebanadas de jamón serrano", "pimienta negra recién molida", "hoja de perejil hoja plana, para adornar"], "method": ["Coloque las rodajas de melón en un plato y cubra las lonchas de jamón Serrano.", "Moler sobre un poco de pimienta negra y decorar con la hoja de perejil."], "url": "www_bbc_co_uk_food_recipes_melonwithserannoham_83622", "title": "Melón con jamón Serrano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ Melón cantalupo, semillas y piel eliminadas, descuartizadas", "8 hojas frescas de albahaca, más una ramita extra, para adornar", "4 rebanadas de jamón de Parma"], "method": ["Coloque dos hojas de albahaca encima de cada pieza de melón.", "Envuelva una porción de jamón de Parma alrededor de cada pedazo de melón.", "Para servir, coloque el melón envuelto en jamón parma en un plato de servir y adorne con una ramita de albahaca."], "url": "www_bbc_co_uk_food_recipes_melonwithparmaham_86017", "title": "Melón con jamón de Parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 oz (110 g) Fontina o Gruyère", "12 oz (350 g) de champiñones mixtos", "1 cucharada de aceite de oliva", "8 huevos grandes", "sal y pimienta negra recién molida"], "method": ["Primero corte los hongos en trozos de aproximadamente 1 pulgada (2,5 cm); parecerá una enorme cantidad en esta etapa, pero perderán aproximadamente la mitad de su volumen en la cocción inicial. Ahora caliente una cucharadita de aceite de oliva en una sartén y, cuando esté caliente, eche los champiñones y agítelos agitando la sartén. No se preocupe de que haya tan poco aceite, porque los champiñones emiten grandes cantidades de jugo una vez que les llega el calor. Sazone con sal y pimienta, luego reduzca el fuego a muy bajo y simplemente deje que los champiñones se cocinen suavemente, sin tapar, para que todo el jugo se evapore y el sabor de los champiñones se vuelva más concentrado. Déjalos así por 30 minutos, revolviéndolos una o dos veces.", "Mientras están cocinando, corte dos tercios del queso en cubos de ¼ de pulgada (5 mm) y ralle el otro tercio en la cuchilla gruesa del rallador. Después de eso, rompe los huevos en un tazón grande, bate ligeramente con un tenedor y sazona bien con sal y pimienta. A continuación, agregue tres cuartas partes de los champiñones cocidos a los huevos, junto con el queso en cubos. Coloque el resto de los champiñones en un recipiente cubierto con papel de aluminio y manténgalos calientes en el horno, junto con los platos.", "Ahora limpie la sartén con papel de cocina y colóquela a fuego medio, agregue el resto del aceite de oliva y, cuando esté caliente, agítelo alrededor de la sartén. Baje la temperatura a su nivel más bajo y vierta la mezcla de huevo en la sartén, esparciendo el queso rallado por toda la superficie. Ahora todo lo que tiene que hacer es dejarlo solo y poner un temporizador durante minutos.", "Cuando hayan transcurrido 15 minutos, encienda la parrilla en su configuración más alta y vea cómo se cocina la tortilla: probablemente le tomará unos 20 minutos en total para cocinar, pero todavía quedará un 10% de huevo líquido en la parte superior. . En esa etapa, transfiera la sartén a la parrilla, no demasiado cerca, y cocine brevemente para permitir que se fije el huevo líquido. Esto llevará de 20 a 30 segundos. Esparce los champiñones cocidos restantes sobre la parte superior de la frittata y córtelos en cuatro cuñas. Transfiera las cuñas a platos calientes y sirva inmediatamente, porque el huevo continuará cocinando aunque la frita ya no esté en contacto con el calor. Me gusta servir esto con dos ensaladas: una ensalada de lechuga verde y una ensalada de tomate y albahaca."], "url": "www_bbc_co_uk_food_recipes_meltedcheesefrittata_67960", "title": "Frittata de queso fundido con cuatro tipos de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de azúcar en polvo", "150g / 6oz de mantequilla, picada, más extra para engrasar", "150g / 6oz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids),% 20roughly% 20chopped", "3 yemas de huevo de gallinas camperas", "3 huevos enteros de gallinas camperas", "1 cucharada de harina normal", "crema doble, para servir (opcional)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase 4 moldes dariole pequeños o cuencos con budines individuales.", "Coloque el azúcar, la mantequilla y el chocolate en un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento.", "Caliente muy suavemente hasta que la mantequilla y el chocolate se hayan derretido, luego retírelos del fuego.", "Batir juntos hasta que estén combinados.", "Agregue las yemas de huevo y los huevos enteros y bata bien.", "Dobla la harina.", "Vierta en los moldes dariole o cuencos de budín y coloque en la nevera para enfriar durante al menos 20-25 minutos.", "Retire de la nevera y coloque en una bandeja para hornear. Poner directamente en el horno y cocinar durante 8-9 minutos.", "Deje reposar durante un minuto o dos, luego colóquelo en platos individuales.", "Sirve con una cucharada de crema doble, si quieres."], "url": "www_bbc_co_uk_food_recipes_meltedchocolatefonda_77527", "title": "Postres de fondant de chocolate pegajosos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meltedchocolatefonda_77527_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, suavizada", "100 g / 3½ oz de azúcar en polvo", "1 huevo de gallinas camperas, golpeado", "1 cucharadita de extracto de vainilla", "Harina de auto aumento 250g / 9 oz", "140g / 5oz de avena"], "method": ["Precaliente el horno a 180 ° C / 200 ° F / Gas 4. Cubra una bandeja para hornear con papel resistente a la grasa.", "Bata la mantequilla y el azúcar en un tazón hasta que estén suaves y esponjosos.", "Batir el huevo hasta que esté bien combinado. Agregue la vainilla y la harina hasta que estén bien combinados.", "Divida la masa en 12 piezas iguales y enrolle cada pieza en una bola.", "Espolvoree la avena en un plato, enrolle las bolas en la avena y colóquelas en la bandeja para hornear. Aplaste las bolas ligeramente con sus manos.", "Hornee los bizcochos por 12-15 minutos, o hasta que estén pálidos dorados."], "url": "www_bbc_co_uk_food_recipes_melting_moments_59381", "title": "Momentos de fusión", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12-15 galletas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 champiñones grandes de tapa abierta o de Portobello, de aproximadamente el mismo tamaño", "4 cucharadas de vermut o vino blanco", "2 dientes de ajo picados", "2 cucharaditas de hojas frescas de tomillo", "sal", "pimienta negra recién molida", "100-125 g / 3½-4½ oz de queso gruyere, u otro queso derretido, rallado", "aceite de oliva virgen extra", "pan crujiente fresco, para servir"], "method": ["Precaliente la barbacoa.", "Corte el tallo de los champiñones, luego marque con un cuchillo sobre las parrillas, sin cortar al otro lado.", "Elija pares de igual tamaño. Coloque una de cada par con la rejilla hacia arriba sobre una superficie de trabajo, luego sazone al gusto con sal y pimienta negra.", "Agregue una cucharada de vermut o vino blanco, seguido de un poco de ajo y tomillo, y termine con queso rallado.", "Coloque otro hongo en la parte superior y conduzca un palillo de cóctel o pincho desde la parte superior para asegurar juntos.", "Cepilla todo con aceite de oliva.", "Cocine sobre brasas calientes, volteándolas con frecuencia y con cuidado, hasta que estén muy suaves, jugosas y derritiéndose por dentro.", "Sirve con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_meltingmushrooms_71049", "title": "Melting hongos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Manteca de 150 g / 7oz", "50ml / 2fl de leche en oz", "50 ml / 2 fl oz de agua", "Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "sal y pimienta negra recién molida", "1 huevo de gallina, golpeado, para cepillar", "900g / 2lb huesos de cerdo", "2 trotones de cerdo", "2 zanahorias grandes, picadas", "1 cebolla, pelada, picada", "2 palitos de apio, picados", "1 bouquet garni (laurel, tomillo, perejil, atado con una cuerda)", "½ cucharada de pimienta negra", "Paletilla de cerdo 400 g / 14 oz, finamente picada", "Vientre de cerdo de 55 g / 2 oz, sin piel, picada", "Tocino magra 55g / 2oz, finamente picado", "½ cucharadita de pimienta de Jamaica molida", "½ cucharadita de nuez moscada recién rallada", "sal y pimienta negra recién molida", "piccalilli o chutney"], "method": ["Para la masa, coloque la manteca, la leche y el agua en una olla pequeña y caliéntela suavemente hasta que la manteca se haya derretido.", "Tamice la harina en un tazón grande y sazone con sal y pimienta negra recién molida y mezcle bien.", "Haga un pozo en la harina y vierta la mezcla de manteca caliente. Mezcle bien para combinar, hasta que la mezcla se una para formar una masa. Amasar durante unos minutos, luego formar una pelota y reservar.", "Para la jalea de cerdo, coloque todos los ingredientes de la jalea de cerdo en una sartén grande y vierta suficiente agua para cubrir. Llevar lentamente a ebullición, luego reduzca el fuego a fuego lento. Cocine durante tres horas a fuego lento, rozando cualquier espuma que se eleva a la superficie, luego cuele el material a través de un tamiz fino y deseche los sólidos.", "Vierta el caldo tamizado en un recipiente limpio y cocine a fuego lento a fuego medio hasta que el líquido se haya reducido a aproximadamente 500 ml / 1 pinta.", "Para el relleno del pastel, coloque todos los ingredientes de relleno del pastel en un tazón grande y mezcle bien con las manos. Sazonar con sal y pimienta negra recién molida.", "Precalentar el horno a 180C / 350F / Gas 4.", "Alinee un carrito de carne de cerdo (o un tarro de mermelada) con una película adhesiva para evitar que la pastelería se pegue.", "Pellizque un cuarto de la masa y reserve. En una superficie de trabajo enharinada, extienda las tres cuartas partes restantes de la masa en un disco redondo de aproximadamente 3 cm de grosor. Coloque el carrito de pastel en el centro del círculo de repostería y dibuje los bordes de la masa hacia arriba alrededor de los laterales de la plataforma para crear la caja de pastel. Con cuidado, retire la plataforma rodante de la masa una vez que se forme su caja de pastel.", "Enrolle el relleno de la empanada de carne de cerdo en una bola y coloque con cuidado en el fondo de la caja de pastelería.", "Estirar la pieza restante de masa en un círculo lo suficientemente grande como para cubrir la caja de pastelería como una tapa.", "Cepille las partes internas superiores de la cubierta de repostería con un poco de huevo batido y coloque el círculo de masa en la parte superior. Pellizca los bordes de la masa para sellar el pastel. Cepille la parte superior del pastel con el resto del huevo batido, luego cocine en el horno durante 45 minutos a una hora, o hasta que el pastel esté dorado por todas partes.", "Retire el pastel del horno y déjelo enfriar. Corta dos pequeños agujeros en la parte superior de la tarta de cerdo y vierte la mezcla de jalea de cerdo (es posible que tengas que calentarla suavemente para aflojar la mezcla y verterla). Enfríe en la nevera hasta que la gelatina esté lista.", "Para servir, corte la tarta en rodajas y sirva con piccalilli o chutney."], "url": "www_bbc_co_uk_food_recipes_meltonmowbrayporkpie_92224", "title": "Pastel de cerdo Melton Mowbray", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 calabaza mediana, pelada, sin semillas y cortada en cubos pequeños", "1½ cucharadas de aceite de oliva", "250g / 9 oz de pasta de pasta de mejor calidad", "harina común, para quitar el polvo", "200g / 7oz Stilton, desmenuzado", "70g/2½oz membrillo (quince paste), cut into 1cm/½in dice", "3 huevos de gallinas camperas", "150ml / 5fl oz de crema doble", "150ml / 5fl oz crema fresca", "sal y pimienta negra recién molida", "100 g / 3½ oz de azúcar en polvo", "2 palitos de canela", "Anís de 5 estrellas", "3 cucharadas de jugo de limón", "1 pomelo (aproximadamente 900 g / 2 lb)", "600 g / 1 lb 5 oz de coles de Bruselas, recortadas", "Chalotes de 250 g / 9 oz", "5 cucharadas de aceite de oliva", "2 cucharadas de hojas de cilantro picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mezcle la calabaza en un bol con el aceite, una pizca de sal y pimienta negra. Extiéndalos en una bandeja para hornear y tueste durante 30 minutos, o hasta que estén dorados, volteándolos una vez. Dejar de lado para enfriar.", "Extienda la masa en una superficie de trabajo enharinada, de aproximadamente 3 mm de grosor, y transfiérala a una lata de quiche de 24 cm / 9½ pulgadas. Cuando forro, deje algunos pasteles colgando sobre el borde. Pinche la base de la masa con un tenedor y deje enfriar en la nevera durante 20 minutos.", "Reduzca la temperatura del horno a 160 ° C / 140 ° Ventilador / Gas 3. Cubra la caja de pastelería con papel para hornear, llénela con alubias y cocine durante 30-35 minutos. Retire los frijoles y el papel, y cocine por otros 10 minutos, o hasta que la masa esté dorada. Aumente la temperatura del horno a 180 C / 160 Fan / Gas 4.", "Extienda la calabaza sobre la base de la masa, salpique el Stilton y espolvoree todo el membrillo.", "Coloque los huevos, la crema y la crème fraîche en un tazón con una pizca de sal y un poco de pimienta negra. Batir y verter sobre la calabaza, dejando algo del relleno expuesto. Coloque en el horno durante aproximadamente 40 minutos, o hasta que la mezcla de huevo se haya solidificado. Deje descansar, luego retírelo de la lata y manténgalo caliente o déjelo enfriar a temperatura ambiente.", "Mientras tanto, para el pomelo, coloca el azúcar, la canela y el anís estrellado en una cacerola pequeña con 100 ml / 3½ fl oz de agua y déjalo cocer a fuego lento. Cocine por 1 minuto, revolviendo hasta que el azúcar se disuelva. Retire del fuego, agregue 1 cucharada de jugo de limón y deje enfriar.", "Pele la piel gruesa del pomelo. Segmente la fruta, asegurándose de eliminar toda la membrana blanca. Rompe las piezas del tamaño de un bocado y ponlas en un recipiente poco profundo. Vierta el jarabe de azúcar sobre el pomelo y deje macerar durante al menos una hora, revolviendo ocasionalmente. Retire la canela y el anís estrellado y cuele el pomelo que reserva los jugos.", "Para los brotes, aumente el horno a 220C / 200C Fan / Gas Mark 7. Reduce a la mitad los brotes y corta los chalotes para que tengan un tamaño similar al de los brotes. Ponga en una bandeja para hornear con 3 cucharadas de aceite, ½ cucharada de sal y un poco de pimienta negra. Asar durante unos 20 minutos, o hasta que los brotes estén dorados, pero aun así retienen una mordida. Dejar de lado para enfriar.", "Justo antes de servir, ponga las chalotas, los brotes, el pomelo y el cilantro en un tazón grande. Agregue el aceite de oliva restante y el jugo de limón, más 1 cucharada de jarabe de pomelo reservado y ¼ de cucharada de sal. Mezcle suavemente, sazone al gusto, es posible que desee agregar otra cucharada de jarabe de pomelo.", "Cortar la quiche y servir junto a las coles de Bruselas."], "url": "www_bbc_co_uk_food_recipes_membrillo_and_stilton_28987", "title": "Butternut squash y Stilton quiche con brotes asados", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/membrillo_and_stilton_28987_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 bastidores completos con costillitas", "2 cucharadas de pimienta negra agrietada", "1 cucharada de sal marina fina", "1 cucharada de azúcar demerara", "1 cucharada de pimentón", "200ml / 7fl oz de jugo de manzana", "100 ml / 3½ fl oz de bourbon Tennessee o whisky de centeno", "75ml / 2½fl oz de aceite vegetal", "1 cucharada de pimentón", "1 cucharada de azúcar demerara"], "method": ["Retire las costillas de la nevera media hora antes de cocinar y precaliente la barbacoa para cocinar indirectamente.", "Moler los ingredientes del rubor hasta obtener un polvo fino en una mano de mortero. Coloque las costillas en una lata de asar grande y cubra uniformemente en el rub. Coloque las costillas en la barbacoa con la carne hacia arriba y cocine durante dos horas.", "Después de dos horas, comience el proceso de trapeado. Combine todos los ingredientes de la fregona en una jarra y use un cepillo grande para aplicar generosamente la fregona a la superficie de ambos bastidores.", "Continúe cocinando por otras dos horas, trapeando cada media hora. Para probar que las costillas están hechas, dale al extremo de uno de los bastidores un suave giro; si la carne se da fácilmente y se siente tierna, están listos."], "url": "www_bbc_co_uk_food_recipes_memphis_ribs_58449", "title": "Memphis costillas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 2 bastidores completos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "2 cucharaditas de pasta harissa", "1 limón, jugo y ralladura solamente", "1 x 400 g / 14½ oz pueden garbanzos, drenados y enjuagados", "150ml / 5¼fl oz de caldo de pollo", "1 cucharada de perejil fresco picado", "4 piezas de pan de masa fermentada", "dash aceite de oliva", "8 salchichas merguez a la plancha, cocidas y mantenidas calientes"], "method": ["Calentar el aceite de oliva en una sartén y agregar la cebolla. Freír la cebolla durante cinco minutos más o menos hasta que se suavice, pero no se dore.", "Agregue el ajo, la harissa, el jugo de limón y la ralladura de limón y cocine por otros tres minutos.", "Agregue los garbanzos y el caldo, lleve a ebullición suavemente y cocine a fuego lento durante cinco minutos. Espolvorea sobre el perejil picado.", "Mientras tanto, para la tostada, caliente una sartén hasta que esté caliente. Cepille el pan con aceite de oliva y la plancha durante dos minutos por cada lado.", "Sirva los garbanzos en el pan a la plancha, con las salchichas merguez dispuestas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_merguezsausageswithc_88136", "title": "Merguez salchichas con garbanzos en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 salchichas merguez", "1 limón, jugo y ralladura", "150g / 5oz de cuscús", "1 cebolla roja, finamente picada", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "4 cucharadas de hojas de cilantro fresco picado", "2 yemas de huevo de gallinas camperas", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "300ml / 10fl oz de aceite vegetal", "15 g / ½ oz de chiles rojos secos, remojados en agua fría y picados", "50g / 2oz de chiles rojos frescos, sin semillas, picados", "2 cucharaditas de comino molido", "2 cucharaditas de semillas de alcaravea molidas", "1 cucharada de pimentón dulce ahumado", "2 dientes de ajo", "2 cucharadas de puré de tomate", "3 cucharadas de vinagre de vino tinto", "4 cucharadas de aceite de oliva", "4 rollos blancos crujientes (opcional)"], "method": ["Caliente una sartén hasta que esté caliente. Cocine las salchichas merguez en la plancha caliente durante 2-3 minutos en todos los lados, volteándolas regularmente, hasta que las salchichas estén cocidas. Exprima un poco del jugo de limón.", "Coloque el cuscús en un recipiente con la ralladura de limón, el jugo de limón restante, la cebolla roja y el aceite de oliva. Vierta suficiente agua hirviendo para cubrir el cuscús en 1 cm / ½ pulg. Cubra con una película adhesiva y déjela a un lado durante cinco minutos, o hasta que el cuscús haya absorbido el líquido. Espolvorear el cuscús con un tenedor y sazonar al gusto con sal y pimienta negra recién molida. Agregue el cilantro y mezcle bien.", "Para la mayonesa, coloque las yemas de huevo, el vinagre y la mostaza en el recipiente de un procesador de alimentos y mezcle hasta que quede pálido y cremoso. Con el motor en marcha, vierta suficiente aceite vegetal, en un flujo constante, para formar una mayonesa espesa.", "Para el Harissa, coloque todos los ingredientes Harissa en un procesador de alimentos limpio y mezcle para formar una pasta suave.", "Para la mayonesa Harissa, agregue 1-2 cucharadas de harissa a la mayonesa (o más, al gusto). Revuelva hasta que esté bien combinado.", "Sirva las salchichas merguez en un panecillo o con el cuscús, con una cucharada o dos de mayonesa Harissa al lado."], "url": "www_bbc_co_uk_food_recipes_merguezsausageswithh_91465", "title": "Salchichas de Merguez con mayonesa de Harissa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 claras de huevo medianas", "Azúcar en polvo 90g / 3¾oz", "90g / 3¾oz de azúcar glas, tamizado", "1 caso grande de flan de esponja, cortado por la mitad a la mitad de aproximadamente 5 mm / ¼ de grosor", "4 cucharadas de licor de fruta de la pasión", "500ml / 18 fl oz de helado de vainilla", "50ml / 2floz de agua", "50 g / 1 oz de azúcar en polvo", "200ml / 7fl oz de puré de maracuyá", "½ cucharadita de arrurruz", "2 maracuyá, reducido a la mitad"], "method": ["Batir las claras de huevo con el azúcar impalpable en un tazón limpio hasta que la mezcla forme picos rígidos.", "Agregue el azúcar glas y bata de nuevo hasta que la mezcla forme picos rígidos y sea lisa y brillante.", "Con un cortador de galletas de 7,5 cm / 3 in, recorta cuatro discos de esponja.", "Coloque las esponjas en los platos de servir y cuchara sobre el licor de fruta de la pasión.", "Cubra cada una con una gran bola de helado.", "Transfiera la mezcla de merengue a una manga pastelera y pinte el merengue alrededor del helado, cubriéndolo de arriba a abajo.", "Esmaltar el merengue con un soplete, o brevemente en un horno caliente.", "Para la salsa de maracuyá, coloque el agua y el azúcar impalpable en una olla y caliente hasta que el azúcar se haya derretido y la mezcla esté hirviendo a fuego lento.", "Agregue el puré de fruta de la pasión y mezcle bien, bata en el arrurruz y cocine hasta que espese.", "Retire del fuego y mezcle las semillas de la fruta de la pasión a la mitad.", "Para servir, coloca la salsa de maracuyá alrededor del borde de cada horneado de Alaska."], "url": "www_bbc_co_uk_food_recipes_meringue_baked_alaska_38214", "title": "Alaska al horno con fruta de la pasión", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10½ fl oz crema doble", "30g / 1oz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids,% 20minimo)", "1 cucharada de Elisir San Marzano (o licor de café y / o ron)", "8 nidos de merengue", "Crema doble 250ml / 9fl oz", "125 g / 4% C2% BDoz% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids,% 20minimum),% 20finely% 20chopped% 20or% 20in% 20buttons% 20made% 20for% 20melting", "2 cucharadas de Elisir San Marzano (o licor de café y / o ron)", "250 g / 9 oz de frambuesas, para servir"], "method": ["Alinee una lata de pan de 450 g / 1 lb con película adhesiva, asegurándose de tener suficiente saliente para cubrir la parte superior más adelante.", "Batir la crema hasta que quede espesa pero aún suave.", "Picar el chocolate muy finamente para que tenga una pila de astillas oscuras, y doblarlas en la crema, junto con el licor.", "Ahora, usando la fuerza bruta, desmenuce los nidos de merengue y dóblelos también.", "Empaque esta mezcla en la lata de pan preparada, presionándola hacia abajo con una espátula sobre la marcha, y levante la película adhesiva una y otra vez para sellar la parte superior, luego saque más película adhesiva para envolver toda la lata. Congele hasta que esté sólido, lo que debería tomar alrededor de ocho horas o toda la noche.", "Aproximadamente una hora antes de servir, prepare la salsa de chocolate. Vierta la crema en una cacerola y agregue los pedacitos de chocolate. Ponga un poco de calor y bate mientras el chocolate se derrite, quitando la sartén del fuego una vez que el chocolate esté casi completamente derretido. Si la mezcla se calienta demasiado, el chocolate se agarrará, mientras que felizmente continuará derritiéndose en la crema caliente del calor.", "Agregue el licor, aún sin calentar, y mezcle de nuevo para amalgamar la salsa completamente. Vierta en una jarra, batiendo de vez en cuando hasta que se enfríe a la temperatura deseada. Si siente que la salsa se ha espesado demasiado, coloque la jarra en un recipiente con agua tibia durante unos minutos, batiendo frecuentemente, antes de verterla. O le doy un trago, aproximadamente dos cucharadas, de espresso caliente.", "Para servir la torta de gelato, desenvuelva la capa externa de película adhesiva, luego suelte la parte superior y utilice estos trozos de envoltura sobresaliente para levantar el bloque de helado. Desenvuelva y desmolde en un tablero y, utilizando un cuchillo filoso y pesado (sumergido en agua caliente entre cada rebanada) corte el pastel de merengue congelado en las losas para servir. Me gusta zigzaguear un poco de salsa de chocolate sobre cada rebanada y rociar algunas frambuesas en cada plato."], "url": "www_bbc_co_uk_food_recipes_meringue_gelato_cake_38183", "title": "Torta de gelato de merengue con salsa de chocolate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringue_gelato_cake_38183_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "300 ml / ½ pinta vertiendo crema doble", "200g / 7fl oz yogur griego completo en grasa", "Frambuesas y arándanos de 900g / 2lb", "azúcar glas, al polvo"], "method": ["Precalentar el horno a 120C / 250F / Gas ½. Alinee una bandeja grande para hornear con un pergamino para hornear antiadherente. Marque con un lápiz dos rectángulos de 12x40cm / 4½x16 pulgadas de largo en el pergamino y voltee el papel.", "Coloque las claras de huevo en un tazón impecablemente limpio y bata con un batidor eléctrico hasta que formen picos rígidos cuando retire el batidor del tazón. Continúe batiendo mientras agrega el azúcar, una cucharadita a la vez, hasta que se incorpore todo el azúcar. El merengue se volverá brillante y mantendrá los picos rígidos cuando se levante el batidor del tazón.", "Coloque la mezcla en una bolsa de plástico grande y corte 1 cm / ½ pulgada del extremo. Introduce el merengue en las formas del rectángulo en el papel, luego coloca pequeñas gotas en los lados largos en la parte superior para formar un borde. O si te gusta, extiende el merengue en las formas rectangulares.", "Hornee por 1½-2 horas, o hasta que el merengue pueda levantarse fácilmente del papel sin pegarse. Apague el horno, deje la puerta entreabierta y salga hasta que los merengues estén fríos.", "Justo antes de servir, bate la crema en un bol hasta que solo conserve su forma. Dobla en el yogur. Extienda la mezcla de crema sobre los merengues y cubra con frambuesas y arándanos alternativos. Polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_meringue_tranche_with_82125", "title": "Tramo de merengue con bayas y crema", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringue_tranche_with_82125_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos, solo blancos", "225 g / 8 oz de azúcar en polvo", "55g / 2oz de coco rallado o almendras", "1 centavo de frambuesas", "570ml / 1 pinta de crema doble, refrigerada", "2 limones, jugo y ralladura", "1 naranja, jugo y ralladura", "3-5 cucharadas de miel clara", "2 cucharadas de brandy o jerez (opcional)"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Cubra una bandeja para hornear con papel de silicona antiadherente.", "En un tazón limpio bata la clara de huevo hasta que esté muy tieso. Esto se hace mejor con un mezclador eléctrico independiente.", "Ahora agregue el azúcar un tercio a la vez, batiendo bien entre cada lote.", "Una vez que el azúcar se haya agregado, continúe batiendo hasta que la mezcla esté muy espesa y brillante.", "Extienda sobre la bandeja para hornear preparada, luego espolvoree abundantemente con el coco o las almendras.", "Hornee en el horno por 15-20 minutos o hasta que estén dorados y firmes al tacto.", "Retire del horno y enseguida encienda un trozo de papel impermeable o una toalla de té limpia.", "Deje actuar durante 15 minutos y luego retire el papel de respaldo.", "Haz el syllabub mientras el merengue se está cocinando. Mezcle la ralladura, el jugo y la miel, revolviendo hasta que la miel se haya disuelto.", "Coloque esta mezcla con la crema refrigerada en un tazón grande y luego bata hasta disolver.", "Cuando el merengue esté frío, extiende el syllabub, coloca las frambuesas encima y arrástralas. Enfríe hasta que sea necesario."], "url": "www_bbc_co_uk_food_recipes_meringuerouladewithr_67265", "title": "Rollo de merengue con frambuesas y relleno de syllabub de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 huevos de gallinas camperas, solo blancos", "200 g / 7 oz de azúcar en polvo blanco", "400 ml / 14 fl oz crema doble", "2 cucharadas de azúcar glas", "Fresas de 250g / 9oz, descascadas y descuartizadas"], "method": ["Para el merengue, precaliente el horno a 100C / 200F / Gas ¾. Alinee una bandeja para hornear con un pergamino para hornear. Puede dibujar círculos en el papel para ayudar a mantener sus merengues del mismo tamaño.", "Coloque las claras de huevo en un recipiente limpio de vidrio o metal y bata hasta que se formen picos suaves cuando se quite el batidor.", "Poco a poco agregue el azúcar y continúe batiendo hasta que se formen picos rígidos cuando se quite la batidora.", "Coloque la cuchara en una manga pastelera equipada con una llanura grande o una boquilla de estrella.", "Pipe en 16 rondas pequeñas en la bandeja de horno preparada.", "Coloque en el horno y hornee durante 20 minutos.", "Apague el horno pero deje los merengues en el horno durante al menos dos horas.", "Cuando esté crujiente, retirar del horno", "Para el relleno, mezcle la crema y el azúcar glas juntos hasta que se formen picos suaves cuando se quite la batidora. Dobla por la mitad las fresas.", "Coloque un merengue en un plato de servir. Extienda la crema batida ligeramente sobre el merengue para cubrirla por completo y cubra con más fresas. Coloque otro merengue encima de las fresas."], "url": "www_bbc_co_uk_food_recipes_meringues_with_48499", "title": "Merengues con fresas y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo, a temperatura ambiente", "Azúcar en polvo 350g / 12oz", "300ml / ½ pinta de crema coagulada", "Fresas pequeñas frescas de 900g / 2lb"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Coloque las claras de huevo en un tazón limpio grande y bata para formar picos suaves. Agregue 110 g / 4 oz del azúcar y continúe batiendo.", "Poco a poco agregue otros 110 g / 4 oz de azúcar, una cucharada a la vez, hasta que la mezcla forme picos rígidos.", "Doble suavemente el resto del azúcar.", "Forme 20 cucharadas grandes de merengue en 2 bandejas forradas con papel de hornear antiadherente y hornee en el horno durante 15 minutos.", "Baje la temperatura del horno a 110C / 225F / Gas ¼ y cocine por 2-3 horas más hasta que esté muy seco y crujiente.", "Dejar enfriar, luego guardar en una lata hermética.", "Sirva con la crema y las fresas coaguladas"], "url": "www_bbc_co_uk_food_recipes_meringueswithclotted_516", "title": "Merengues con crema coagulada y fresas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 10 merengues", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringueswithclotted_516_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "2 cebollas, en rodajas finas", "6 dientes de ajo, en rodajas", "2 cucharaditas de pimentón", "70g / 3oz de chorizo, cortado en cubos", "100g / 4oz padron pimientos u otros pimientos verdes pequeños, en rodajas (o 1 pimiento grande, cortado en cubitos)", "Patatas en grano de 900g / 2lb, raspadas y cortadas a la mitad a lo largo", "85ml / 3fl oz de vino blanco seco", "300 ml / 10 fl oz de agua", "8 x 100 g / 4oz o 4 x 225 g / 8oz de filetes de merluza", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en una cazuela de terracota o en una cazuela poco llamativa e insoportable.", "Agregue las cebollas y el ajo y cocine suavemente hasta que estén suaves.", "Agregue el pimentón y freír durante 2-3 minutos, luego agregue la salchicha chorizo ​​y los pimientos verdes y fría por otros 3-4 minutos.", "Agregue las papas, vierta el vino y el agua, sazone con sal y pimienta y cocine a fuego lento durante unos 10 minutos, hasta que las papas estén tiernas y el líquido se haya reducido un poco.", "Sazone los filetes de merluza bien en ambos lados. Póngalos encima de las papas, tapar y cocine a fuego lento durante 8-10 minutos, hasta que la merluza esté bien cocida."], "url": "www_bbc_co_uk_food_recipes_merluzaalagallega_11637", "title": "Hake with chorizo and potatoes (Merluza à la Gallega)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/merluzaalagallega_11637_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 claras de huevo de gallinas camperas", "pizca de sal", "225 g / 8 oz de azúcar en polvo", "4 cucharaditas de harina de maíz", "2 cucharaditas de vinagre de frambuesa", "½ cucharadita de extracto de vainilla", "300ml / 10½ fl oz crema doble", "frutas y bayas mixtas de verano, al gusto"], "method": ["Precalentar el horno a 130 ° C / 275 ° F / Gas 1.", "Batir las claras de huevo y la sal juntas en un bol hasta que se formen picos suaves cuando se quite el batidor.", "Agregue el azúcar una cucharada a la vez, batiendo constantemente, hasta que se incorpore todo el azúcar y se formen picos rígidos cuando se quite la batidora.", "Agregue la harina de maíz, el vinagre de frambuesa y el extracto de vainilla y bata para combinar.", "Ponga cucharadas de la mezcla de merengue en pequeños montones sobre una bandeja para hornear engrasada, horneada y envuelta en pergamino y transfiérala al horno para hornear durante 1-1¼ horas, o hasta que la parte exterior de los merengues esté crujiente y el interior en forma de malvavisco.", "Para servir, coloque uno o dos merengues en cada plato y cubra con crema batida y las bayas de verano de su elección."], "url": "www_bbc_co_uk_food_recipes_meringueswithsummerb_89162", "title": "Merengues con bayas de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/meringueswithsummerb_89162_16x9.jpg", "isVegetarian": true, "recommendations": 0}]