[{"isVegetarian": false, "title": "Whole roasted sea bass with harissa paste, steamed potatoes and oregano", "url": "www_bbc_co_uk_food_recipes_whole_roasted_sea_bass_45008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole sea bass, gutted ", "4 sprigs oregano", "6 potatoes, cut into 1cm/½ in slices", "1 red chilli, seeds removed, roughly chopped", "2 tsp ground cumin", "2 tsp ground caraway seeds", "1 tbsp sweet smoked paprika", "2 garlic cloves, peeled", "2 tbsp tomato purée", "3 tbsp red wine vinegar", "4 tbsp olive oil, plus extra for greasing"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 190C/375F/Gas 5.", "Trim the sea bass by removing the fins with scissors and scoring the flesh in a crisscross pattern. ", "For the harissa paste, place all the ingredients into a small food processor and blend until smooth.", "Rub the harissa paste all over the fish and stuff the cavity of the fish with oregano.", "Take two large pieces of aluminium foil big enough to wrap each fish with room to spare. Place an equally-sized piece of greaseproof paper on top of each one, then lightly grease with oil. ", "Divide the potatoes between the pieces of greaseproof paper and place a fish on top. Wrap the greaseproof paper and aluminium foil around the fish like a Cornish pasty, using the foil to seal the join.", "Roast in the oven for 20-25 minutes.", "To serve, remove the fish from the oven and carefully open the wrapping. Use a fish slice lift the fish out and place on a serving platter. Place the potatoes around the fish and spoon over any juices that are left in the bag."]}, {"isVegetarian": false, "title": "Whole roasted duck with purple sprouting broccoli, duck-fat potatoes and bordelaise sauce", "url": "www_bbc_co_uk_food_recipes_whole_roasted_duck_with_88418", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole duck, trimmed and wings removed", "salt and freshly ground black pepper", "2 large potatoes, peeled and diced into 1cm/½in cubes", "100g/3½oz duck fat (trimmed from the whole duck)", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "2 sprigs thyme, leaves picked", "1 bay leaf", "5 black peppercorns", "200ml/7fl oz red wine", "300ml/10½fl oz veal jus, warmed (available from some large supermarkets)", "pinch sugar", "400g/14oz purple sprouting broccoli", "75g/2½oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the whole roasted duck, use a small sharp knife to pierce the skin of the duck all over, but be careful not to tear holes in the skin. Season the duck with salt and black pepper and place on a wire rack sat in a roasting tin. Roast for 25 minutes.", "Remove the duck from the oven and pour any excess fat from the roasting tin into a jug. Reduce the oven temperature to 120C/250F/Gas ½. ", "When the oven reaches 120C/250F/Gas ½, return the duck to the oven and cook for a further 1¼ hours - basting with the reserved fat every 20 minutes. Once cooked allow the duck to rest for 30 minutes.", "For the duck fat potatoes, heat a large frying pan and add the duck fat. Once hot and melted, add the diced potatoes and cook for 6-8 minutes, or until golden-brown and tender.", "For the bordelaise sauce, heat a medium saucepan and add the butter. Once hot, add the shallot and cook for 2-3 minutes. Add the thyme, bay leaf and peppercorns and cook for a few minutes.", "Add the red wine and cook until the volume of liquid has reduced by half. Pour in the warm veal jus and reduce by half again. Season with a little sugar, to taste. Pass through a fine sieve and set aside in a warm place until ready to serve.", "For the purple sprouting broccoli, bring a large pan of salted water to the boil. Add the broccoli and cook for 2-3 minutes. Remove from the water and refresh in ice-cold water.", "Melt the butter in a large frying pan. Add the broccoli and gently fry for 1-2 minutes.", "To serve, remove the duck breasts from the roasted duck and cut into pieces. Divide the meat between serving plates. Serve the potatoes and broccoli next to the duck with a spoonful of the sauce."]}, {"isVegetarian": false, "title": "Whole roasted masala chicken and potatoes", "url": "www_bbc_co_uk_food_recipes_whole_roasted_masala_77631", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_roasted_masala_77631_16x9.jpg", "ingredients": ["4 tbsp lemon juice\t\t ", "2 tbsp peeled, finely chopped root ginger\t", "2 tbsp finely chopped or crushed garlic\t\t ", "3 hot green chillies, finely chopped", "½ tsp salt", "1 tsp ground coriander", "1 tsp garam masala", "1.75kg (3lb 14oz) whole chicken, skin removed", "½ tsp chilli powder", "½ tsp freshly ground black pepper", "2 tbsp olive or sunflower oil", "5 medium potatoes, peeled, halved lengthways, and cut into 5x4cm/2x1½in chunks", "½ tsp of salt", "¾ tsp freshly ground black pepper", "1 tsp ground coriander ", "1 tsp ground cumin", "½ tsp turmeric", "1 tsp Kashmiri (mild) chilli powder"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place all the marinade ingredients into a blender and process to a paste.", "Using a sharp knife, make two deep, diagonal cuts into each breast of the chicken, going all the way down to the bone. Make two equally deep slashes in the thighs and two in the drumsticks as well. ", "Place the chicken, breast side up, on a roasting tray lined with enough foil to cover the bird completely. ", "Pour the marinade paste over the chicken, rubbing it well into all the cuts. Set aside for 30 minutes. ", "Sprinkle the chilli powder and black pepper over the chicken evenly. Wrap up the chicken in the foil so it is completely covered, with the tightly closed seam at the top. ", "Bake in the middle of the hot oven for one hour. ", "Unwrap, without letting the juices run out, and cook, uncovered, for 15 minutes, basting two or three times with the juices. ", "Check the chicken is cooked by inserting a skewer into the thickest part of the thigh, between the leg and the body. If the juices run clear with no trace of pink, it is cooked. Continue to cook for a little longer if needed.", "Preheat the oven to 180C/350F/Gas 4.", "Meanwhile, for the roasted masala potatoes, pour the oil into a large bowl. Add the potatoes and sprinkle in the salt and pepper. Ensure the potatoes are well coated, then transfer to a baking tray in a single layer. ", "Place in the middle of the oven and roast for 20 mins.", "Spoon the coriander, cumin, turmeric and chilli powder on to a plate and mix well. ", "Remove the potatoes from the oven. Using tongs, roll the potatoes in the spice mix, making sure all sides are covered. ", "Return them to the oven for a further 20 minutes, or until lightly browned and tender all the way through when pierced with a knife.", "Set the chicken in a warm place to rest for 10-15 minutes, then carve and serve with the roasted masala potatoes."]}, {"isVegetarian": false, "title": "Whole roasted sea bass with beetroot salad", "url": "www_bbc_co_uk_food_recipes_whole_roasted_seabass_96858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp honey", "the leaves from the heritage beetroot (from below)", "100ml/3½fl oz rice wine vinegar", "1 shallot, peeled and sliced", "pinch salt ", "1 whole wild sea bass or 2 farmed, fins removed and cleaned", "1 bunch heritage beetroots and leaves", "2 tsp olive oil", "1 sprig fresh thyme", "1 head chicory, leaves separated", "1 small red onion", "100g/3¼oz walnut halves", "3 tbsp walnut oil", "1 tsp Dijon mustard", "1 tbsp sherry vinegar"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pickle, place the ingredients in a medium saucepan with 100ml water and heat un-til the honey has dissolved. Pour into a bowl and leave to cool.", "Add the beetroot leaves to the pickle and leave for at least 2 hours.", "For the salad, preheat the oven to 200C/180C Fan/Gas 4.", "Put the beetroot onto tin foil, season with salt and freshly ground black pepper, drizzle with oil and top with the thyme. Wrap the foil into a parcel and seal the top. Bake for 20-40 minutes. Remove from the oven and set aside to cool.", "For the sea bass, preheat the oven to 180C/160C Fan/Gas 5. Place the sea bass on a baking tray lined with foil. Cover the fish with another sheet of foil. Cook in the oven for 10 minutes then remove the top foil to uncover the fish and cook for a further 10-15 minutes.", "Heat a griddle pan and drizzle the chicory with the oil and place on the griddle for 2-3 minutes, or until charred all over. ", "Put the chicory in a large bowl, add the onion and walnuts. Peel the cooled beetroot, cut into pieces and add to the bowl. Mix to combine.", "Whisk the walnut oil, Dijon mustard, vinegar, salt and pepper together in a small bowl. Just before serving pour the dressing over the salad and mix.", "To serve, place the salad on the plate with the flaked sea bass fillet and garnish with the beetroot leaves."]}, {"isVegetarian": false, "title": "Whole roasted sea bass on a bed of tomatoes and black oilves, with crab croquettes", "url": "www_bbc_co_uk_food_recipes_whole_roasted_seabass_on_29102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large baking potatoes", "75g/2½oz white crab meat", "25g/1oz brown crab meat", "1 tbsp finely chopped parsley", "½ lemon, zest only", "salt and pepper", "50g/1¾oz plain flour", "2 free-range eggs, beaten", "100g/3½oz flaked almonds, finely chopped", "sunflower oil, for deep-fat frying", "1kg/2lb 4oz heritage tomatoes, sliced", "100g/3½oz pitted black olives", "6 garlic cloves, skin on, smashed", "4 tbsp olive oil", "1 whole wild sea bass, gutted and scaled, skin scored", "2 tbsp chopped dill", "2 tbsp chopped marjoram", "2 tbsp chopped chervil", "1 head frisée lettuce", "4 tbsp chopped parsley", "2 tbsp chives, cut into 1cm/½in lengths", "4 tbsp olive oil", "1 red onion, cut into thin wedges, root end left on", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab croquettes, preheat the oven to 200C/400F/Gas 6. Bake the potatoes for one hour, then take them out of the oven and let them stand until cool enough to handle.\r\n", "Scoop out the warm potato and mash in a bowl. Add the crab meat, parsley and lemon zest. Season with salt and pepper and mix.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the chopped almonds onto another plate.", "Shape the crab mixture into small balls or cylinder shapes. Dredge each croquette in the flour, dip in the egg, then roll in the almonds until completely coated. Leave to chill in the fridge for at least an hour to rest.", "To cook the sea bass, preheat the oven to 190C/375F/Gas 5.", "Place the sliced tomatoes, olives and garlic in the bottom of a baking tray and drizzle over two tablespoons of the olive oil.", "Stuff the cavity of the sea bass with the herbs and place the fish on top of the tomatoes and olives.", "Drizzle over the remaining olive oil and place some aluminium foil over the fish. Bake in the oven for about 20 minutes, until cooked through, depending on the size of your sea bass. Remove the foil for the last 10 minutes.", "To cook the crab croquettes, heat a deep, heavy-bottomed saucepan half-filled with sunflower oil, or heat a deep-fat fryer to 160C/325F.", "Carefully lower the croquettes into the hot oil, in batches if necessary, and fry for 2-3 minutes, or until golden-brown and hot inside.", "Remove the croquettes from the oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. ", "To make the salad, heat a griddle pan on a high heat and drizzle one tablespoon of oil over the onion wedges. Place on the griddle for 2-3 minutes on each side until bar marks appear.", "Place the frisée leaves and herbs in a large serving bowl and add the onion wedges.", "In a small bowl whisk the remaining oil with the lemon juice. Pour the dressing over the salad just before serving.", "To serve, place a section of the sea bass on each serving plate with the tomatoes and olives, croquettes and salad."]}, {"isVegetarian": false, "title": "Roasted shoulder of pork with thyme and lemon salt, mash, spring greens and apple sauce", "url": "www_bbc_co_uk_food_recipes_whole_roasted_shoulder_98339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3.5kg/7lb 10oz boned pork shoulder", "6-8 tbsp olive oil", "4 tbsp sea salt", "4 sprigs thyme, leaves picked ", "1 lemon, zest only", "2 onions, sliced", "4 Bramley apples, peeled and roughly chopped", "50g/1¾oz butter", "2-4 tbsp caster sugar, to taste", "700g/1lb 9oz King Edward potatoes, peeled and cut into chunks", "100g/3½oz butter", "200ml/7fl oz double cream", "1 spring cabbage, sliced", "salt and freshly ground black pepper", "300ml/10fl oz pork gravy "], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3.", "For the pork, using a sharp knife, score the skin of the pork in strips. Rub the skin all over with olive oil then rub in the salt, thyme and lemon zest. Place the onions in a deep-sided roasting tin, put the pork on top and roast for 5 hours.", "For the apple sauce, put the apples in a saucepan with 3 tablespoons water, the butter and 2 tablespoons sugar. Cover and place over a medium heat until soft and fluffy, stirring occasionally. Taste and add more sugar if desired. Set aside.", "For the pork, after 5 hours, increase the oven temperature to 230C/210C Fan/Gas 8 and roast the pork for a further 40-45 minutes, or until the crackling is crisp.", "For the mash, cook the potatoes in a saucepan of boiling salted water for 10-15 minutes, or until tender. ", "Drain the potatoes, then return to the pan to the heat and gently warm to remove any excess moisture. Remove from the heat and mash the potatoes with the butter and cream until smooth. Season, to taste, with salt and freshly ground black pepper. Set aside and keep warm until ready to serve.", "For the spring greens, heat a frying pan until hot, add the butter and, when melted, add the cabbage and a splash of water. Cook for a few minutes, or until the cabbage is tender and most of the water evaporated. Season with salt and black pepper.", "To serve, carve the pork into thick slices and place on plates. Spoon the potatoes alongside with a large dollop of apple sauce and the cabbage. Drizzle over the gravy."]}, {"isVegetarian": false, "title": "Whole sea bass baked on anchovy and garlic potatoes with a pickled pumpkin and walnut salad", "url": "www_bbc_co_uk_food_recipes_whole_sea_bass_baked_on_19811", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_sea_bass_baked_on_19811_16x9.jpg", "ingredients": ["500g/1lb 2oz small, young delica pumpkin (or other young pumpkin), quartered and deseeded but not peeled, very thinly sliced on a mandoline", "200ml/7fl oz cider vinegar", "50g/1¾oz caster sugar", "2 tsp coriander seeds", "good pinch chilli flakes", "few sprigs fresh thyme, leaves picked", "4 generous handfuls wild rocket", "30g/1oz toasted flaked (or chopped) walnuts", "150g/5½oz curd cheese, to serve ", "extra virgin olive oil, to drizzle", "8 tbsp extra virgin olive oil", "3 tbsp lemon juice", "1½ tsp salt", "3 tbsp chopped fresh oregano (or marjoram)", "1.5kg/3lb 5oz large waxy potatoes, such as Desiree or Charlotte, cut into into 8–10mm thick slices", "4 fat garlic cloves, thinly sliced", "8 anchovy fillets in olive oil, drained and sliced", "1.75kg/4lb whole sea bass (or red snapper), gutted and scaled", "1 unwaxed lemon, thinly sliced", "3 bay leaves", "3 lemon leaves (if you can get them)", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, arrange the pumpkin in a shallow ovenproof dish. In a saucepan, mix together the vinegar, sugar, coriander seeds and 200ml/7fl oz water, then bring to the boil. Pour this mixture over the pumpkin, add the chilli flakes and thyme, cover and leave to pickle for at least 1 hour.  ", "Preheat the oven to 200C/180C Fan/Gas 6. ", "For the dressing, whisk together the oil, lemon juice, salt and some pepper, then stir in the oregano.", "For the sea bass, put the potatoes in a large roasting tin in which the fish can lay either lengthways or diagonally. Add 6 tablespoons of the dressing, the garlic and anchovies. Toss well, spread out in an even layer and roast for 30–35 minutes.", "Meanwhile, slash the flesh of the fish 5–6 times on each side. Season the cavity with salt and pepper, then stuff it with the lemon, bay and lemon leaves, if using.", "Remove the potatoes from the oven and release them from the bottom of the tin if they have stuck. Brush the outside of the fish with a little of the remaining dressing and season with salt and pepper. Put it on top of the potatoes and pour any remaining dressing into the cavity. Return to the oven for 35 minutes, or until the fish is cooked through and the potatoes are tender.", "When ready to serve, divide the pumpkin between four plates and add generous helpings of rocket. Scatter with walnuts and cheese, drizzle with oil and season with salt and pepper. Serve immediately with the fish and potatoes."]}, {"isVegetarian": false, "title": "Whole roasted trout with salsa verde, roasted new potatoes and lemons", "url": "www_bbc_co_uk_food_recipes_whole_roasted_trout_with_75575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large shallot, roughly chopped", "6 anchovies, roughly chopped", "1 tsp Dijon mustard", "2 tbsp roughly chopped mint leaves, stalks reserved", "2 tbsp roughly chopped dill, stalks reserved", "2 tbsp roughly chopped tarragon, stalks reserved", "2 tbsp roughly chopped flatleaf parsley, stalks reserved", "2 tbsp roughly chopped watercress, stalks reserved", "2 tbsp torn fresh basil", "4 tbsp extra virgin olive oil, plus extra for drizzling", "2 tbsp capers, drained", "3 lemons, halved", "1.5kg/3lb 5oz whole trout, cleaned and gutted", "400g/14oz new potatoes, par boiled", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/425F/Gas 7 or use a very hot pizza oven.", "Place the shallot, anchovies, mustard and all the chopped herbs into a food processor with a pinch of salt and pepper and blend to a fine purée. Add the olive oil and blend once more.", "Add the capers and the juice of half a lemon. Pulse for a few seconds until still slightly chunky.", "Put the trout onto a large roasting tray along with the halved lemons and par boiled potatoes.", "Put a couple of spoonfuls of the salsa verde into the cavity of the trout along with the reserved herb stalks. Drizzle with olive oil and season well with salt and black pepper.", "Place in the oven and roast for 15-20 minutes, or until just cooked through.", "Serve the trout with the roasted new potatoes, lemon and a drizzle of the remaining salsa verde."]}, {"isVegetarian": false, "title": "Whole sea bass with warmed tomato and citrus salsa", "url": "www_bbc_co_uk_food_recipes_whole_sea_bass_with_38333", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_sea_bass_with_38333_16x9.jpg", "ingredients": ["butter, for greasing", "1.5kg/3lb 5oz whole sea bass, cleaned, gutted, scales removed, head on", "1 small bunch fresh coriander, finely chopped, stalks reserved", "salt and freshly ground black pepper", "half cucumber, deseeded and finely diced", "1 green chilli, finely chopped", "6 large tomatoes", "1 pink grapefruit", "1 lime, juice and finely grated zest", "2 tsp freshly grated ginger", "3 tbsp olive oil", "3 heaped tbsp mango chutney", "handful of chopped coriander"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a large piece of foil with butter.", "Using a sharp knife make three slashes along each side of the fish, and push a little chopped coriander into the slashes. Place the coriander stalks into the cavity of the fish. Season all over with salt and pepper. Wrap the fish in foil to make a parcel. Make sure the seam of the parcel is to the side, so you can turn the fish upside down. Bake for about 30 minutes, turning over after 15 minutes, until cooked through.  ", "To make the salsa, chop all the ingredients. Put them all into a bowl, apart from the coriander, and mix together. Season with salt and pepper.", "Remove the foil, serve the sea bass on a large platter and carefully remove the skin.  Heat the salsa gently in a pan, add the coriander and pour over the top or serve alongside."]}, {"isVegetarian": false, "title": "Whole steamed sea bream with ginger, citrus and chilli and sticky rice", "url": "www_bbc_co_uk_food_recipes_whole_steamed_sea_bream_67892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 600g/1lb 5oz whole sea bream, scaled, gutted and gills removed", "1 tbsp fish sauce", "2 tbsp shaoxing rice wine", "1 tbsp oyster sauce", "1 tbsp fresh ginger, grated", "2 red chillies, sliced", "1 orange, juice only ", "2 limes, zested and segmented", "2 tbsp chopped garlic chives, or Asian chives", "6 kaffir lime leaves", "2 spring onions, sliced", "1 tsp ground Sichuan peppercorns", "1 lemongrass stalk, trimmed and finely chopped ", "400g/14oz sticky Asian rice, soaked for at least three hour, then rinsed", "2 tbsp caster sugar", "1 handful coriander cress", "1 tbsp toasted sesame seeds", "2 tsp sesame oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First prepare the fish. Using scissors, remove all fins and trim the tail, then use a sharp knife to make a few neat diagonal slashes along each side of the fish. Remove the head of the fish if you wish.", "Take a bowl and mix together the fish sauce, wine, oyster sauce, half of the ginger, half the chillies, the orange juice, lime zest, and half the garlic chives to make the marinade.", "In another bowl, rip up the kaffir lime leaves and add the remaining ginger, garlic chives and the white parts of the spring onion. Mix together then pack the mixture inside the belly cavity of the fish.", "Set two large saucepans on the hob with about 5cm/2in water in the bottom of each and bring the water to a simmer. Place a bamboo steamer with a lightly oiled deep plate inside on one pan. Place a colander lined with a muslin cloth on top of the other pan.", "Put the fish on the oiled plate and drizzle over the marinade ingredients. Sprinkle over the Sichuan peppercorns and lemongrass then cover with a lid and steam gently for around 20 minutes or until the fish is just cooked through.", "Meanwhile, take the soaked, rinsed rice and put it into the muslin-lined colander. Cover with a lid and cook for 20-30 minutes or until the rice is just tender. Halfway through cooking, stir the rice with a fork. ", "Check the steamers as you cook the rice and fish and top up with a little boiling water as required.", "While the fish and rice are steaming, place the sugar in a small pan, cover with about a cup of water and bring to a boil. Pour the syrup over the lime segments and set aside.", "Check the fish is just cooked through by sliding a skewer or chopstick into the fleshy part of the back of the fish.", "Carefully remove the whole fish and arrange on serving platter. Pour over the cooking juices and scatter over sliced green parts of the spring onions, the sweet and sour lime segments, coriander cress and sesame seeds.", "Finish with a drizzle of sesame oil and serve the rice alongside."]}, {"isVegetarian": true, "title": "Whole strawberry and vanilla preserve", "url": "www_bbc_co_uk_food_recipes_whole_strawberry_and_05215", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_strawberry_and_05215_16x9.jpg", "ingredients": ["325g/11½oz (about 2) very hard pears", "500g/1lb 2oz firm strawberries, hulled", "400g/14oz granulated or caster sugar", "1 small lemon, juice only", "1 vanilla pod, seeds only"], "serves": "Makes 600ml/20fl oz (about 2 jam jars)", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel and grate the pears, minus the core and pips, into a large saucepan. Cover with 500ml/18fl oz water, bring to the boil and cook for about 15 minutes, or until the pear strands are tender and the water has almost evaporated.", "Add the strawberries, and boil for another five minutes, or until the berries are very tender and the liquid has almost evaporated again.", "Add the sugar and lemon juice, bring to the boil and cook until the mixture reads 105C/220F on a sugar thermometer. Stir frequently to check the mixture isn’t sticking on the bottom of the saucepan.", "Stir in the vanilla seeds, then leave to cool for 2-3 minutes. Spoon the jam into hot, clean jars while the jam is hot, and seal immediately.", "Leave the jam for a day before eating, and after opening store it in the refrigerator."]}, {"isVegetarian": true, "title": "Wholegrain mustard mash", "url": "www_bbc_co_uk_food_recipes_wholegrain_mustard_mash_74962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 5oz floury potatoes (such as Desiree, King Edward or Maris Piper), peeled", "50g/1¾oz butter", "100ml/3½fl oz milk", "salt and pepper", "2 tbsp wholegrain mustard"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the potatoes into even-sized small cubes and put them into a pan of cold, salted water. Bring to the boil and cook until really tender (the length of cooking depends on the size you cut them up).", "Drain and return the potato cubes to the pan. Add the butter and milk. Mash using a potato masher, and season with salt and pepper.  Stir in the wholegrain mustard.", "Serve hot."]}, {"isVegetarian": false, "title": "Whole poached salmon", "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmon_11557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3kg/6½lb  whole salmon, gutted and scaled", "1 tbsp whole peppercorns", "2 bay leaves", "1 lemon", "salt", "water", "1 whole cucumber, sliced thinly", "200ml/7fl oz mayonnaise", "1 lemon, juice only", "5g dill, chopped", "seasoning", "200ml/7fl oz mayonnaise\t", "40g/1½oz wild rocket, roughly torn", "2 tbsp sesame seeds", "2 fresh limes, halved", "smoked paprika"], "serves": "Serves 7-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the salmon into a large deep sided pan. Add the whole peppercorns, bay leaves, lemon juice, whole lemon and a good pinch of salt. ", "Fill the pan with cold water until just covering the salmon. Cover the pan with tin foil, bring to the boil, turn off the heat and allow to cool. ", "Remove the skin from half way up the side of the salmon. Layer the cucumber like scales on the salmon flesh and serve with the mayonnaise dips and the limes dipped in the smoked paprika. "]}, {"isVegetarian": true, "title": "Wholemeal cheese scones", "url": "www_bbc_co_uk_food_recipes_wholemeal_cheese_scones_12017", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholemeal_cheese_scones_12017_16x9.jpg", "ingredients": ["250g/9oz wholemeal flour ", "250g/9oz plain flour ", "2 tsp baking powder ", "½ tsp salt", "200g/7oz grated cheddar", "100g/4oz grated Parmesan, or similar vegetarian hard cheese", "400ml/14fl oz milk ", "1 free-range egg, beaten "], "serves": "Makes about 15 scones", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 220C/425F/Gas 7.  Line a baking tray with parchment paper.", "Place both flours, baking powder, salt, cheddar and half the parmesan into a large bowl and mix to combine.  Add the milk and bring the ingredients together with your hands or a wooden spoon.  The mixture will be sticky at this point.", "Tip the mixture onto a lightly floured surface. Fold and knead to form a soft dough. ", "Flatten or lightly roll the dough to 2.5cm/1in thick.  Dredge a 6cm/2½in cutter in flour to ensure a precise cut and cut out 15 scones. Place them onto the baking tray – you may need to do this in two batches. Brush the tops of the scones with the beaten egg and sprinkle with the remaining parmesan. ", "Cook for 15-17 minutes until the scones are risen and golden-brown.  Serve warm with butter. "]}, {"isVegetarian": false, "title": "Whole poached salmon and lemon", "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmonan_74098", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholepoachedsalmonan_74098_16x9.jpg", "ingredients": ["1 whole salmon 2.5-2.75kg/4lb 15¼oz-6lb 1oz", "1 onion, chopped", "2 bay leaves", "4 tbsp white wine vinegar", "1 lemon, quartered", "sea salt", "cracked black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the salmon in a fish kettle. If you haven't got one a large roasting tin will do fine.  ", "Add enough cold water to cover the fish (it must be covered). Add the onion, bay leaves, vinegar and lemon and a good pinch of salt and a little black pepper.", "Cover with a lid, or tin foil, and bring to the boil on the stove.  It is easier and quicker to put two rings on underneath the fish.  Once it is boiling, turn off the heat and allow the fish to stand in the water until cool.", "Carefully remove the salmon and place onto a board.  Carefully scrape off the skin and place on a large flat serving dish. Serve with a bowl of lemon wedges and a bowl of hollandaise."]}, {"isVegetarian": false, "title": "Whole poached salmon with cucumber 'scales'", "url": "www_bbc_co_uk_food_recipes_wholepoachedsalmonwi_93188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2.5kg/5lb 6oz whole salmon, scaled and gutted", "1 lemon, halved ", "2 tsp black peppercorns", "2 bay leaves", "2 cucumbers", "a few handfuls salad leaves", "mayonnaise, for piping"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the salmon into a large roasting tin or a fish kettle and cover with water. Squeeze in the lemon juice and add the rinds to the tin, then add the peppercorns and bay leaves.", "Bring to the boil, then remove from the heat immediately. Set aside for the salmon to slowly poach in the residual heat for about 30 minutes, or until cooked through (the flesh should be opaque all the way through). ", "Using a fish slice, carefully remove the salmon from the tin and place onto a large serving platter. Remove the skin from the presentation side, from behind the gills to the tail. ", "Thinly slice the cucumbers, then halve each slice into little semi-circles. Layer the cucumber slices over the exposed salmon flesh in a pattern to mimic fish scales. ", "Surround the salmon with salad leaves. ", "To serve, pipe the mayonnaise over and around the salmon as desired."]}, {"isVegetarian": false, "title": "Whole poached wild salmon and duck egg dressing with wheaten bread and country butter", "url": "www_bbc_co_uk_food_recipes_wholepoachedwildsalm_86183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "10g/¼oz salt", "10g/¼oz bicarbonate of soda", "250g/9oz wholemeal flour", "150g/5½oz jumbo oat flakes", "2 tsp clear honey", "1 tsp black treacle", "375ml/13fl oz buttermilk", "125ml/4fl oz whole milk", "1 cucumber, peeled, deseeded and finely sliced", "salt", "100ml/3½fl oz white wine vinegar", "25g/1oz caster sugar", "½ tbsp mustard seeds", "handful dill, chopped", "1 bottle (75cl) dry white wine", "bunch of flatleaf parsley", "2 small leeks, sliced", "2 celery sticks, sliced", "2 onions, sliced", "1 tbsp sea salt", "6 black peppercorns ", "2 bay leaves", "1 whole wild salmon, 3-3.5kg/6lb 8oz-7lb, gutted and scaled", "salt and freshly ground black pepper", "150g/5½oz good-quality organic unsalted butter", "4 free-range duck eggs", "4 tbsp capers, rinsed", "small handful flatleaf parsley, chopped", "2 tbsp chopped chives", "lemon juice, to taste", "salt and freshly ground black pepper ", "good-quality butter"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the wheaten bread, preheat the oven to 200C/390F/Gas 6. Line a baking sheet with baking parchment. ", "Sift the plain flour, salt and bicarbonate of soda into a large bowl and mix in the wholemeal flour and oat flakes. Mix the honey and treacle into the buttermilk, then quickly and lightly fold the buttermilk and milk into the dry ingredients. Mix the ingredients together using your hands, taking care not to overwork - when the ingredients are heavy, the action should be light.", "Divide the dough into quarters with floured hands, then mould each into a round and place on the baking sheet. Dust lightly with plain flour and mark a cross in the top of each loaf with a knife. Bake for 20-30 minutes or until the loaves sound hollow when tapped on the base. Transfer to a wire rack, drape a damp cloth over the loaves and leave to cool. (Wheaten bread should be eaten the same day, or toasted the next. This makes four loaves, but the bread freezes well.) Turn the oven down to 100C/210F/Gas ¼. ", "While the bread is baking, make the cucumber salad. For the cucumber salad, sprinkle the cucumber slices with salt and leave to stand. Put the wine vinegar in a heavy pan with 100ml/3½fl oz water, the sugar and mustard seeds. Heat gently until the sugar has dissolved, then boil to reduce by half. Remove from the heat. Rinse and drain the cucumber, then mix into the pickling liquid with the dill. Set aside.", "Put all the ingredients for the court-bouillon in a large fish kettle with 6 litres/10½ pints cold water. Bring to the boil and simmer for 20 minutes.", "Lower the salmon into the court-bouillon. Bring back to the boil, then cover the kettle tightly so no steam can escape. Transfer to the oven and poach for 25 minutes with the oven door ajar. ", "Meanwhile, make the dressing. For the dressing, melt the butter and keep warm. Lower the duck eggs into a pan of boiling water and simmer for four minutes. Lift the eggs out of the water using a slotted spoon and cool a little under running cold water, then carefully peel off the shells. Mash the eggs in a bowl with a fork, then mix in the capers, herbs and warm melted butter. Season with lemon juice, salt and freshly ground black pepper to taste. Mix well and keep the dressing warm.", "Remove the fish from the court-bouillon as soon as the poaching time is up. Cut into 6-8 pieces and serve with the cucumber salad and warm dressing on each plate, with wheaten bread and good-quality butter on the side."]}, {"isVegetarian": false, "title": "Whole roast chicken, potato and bacon rosti and glazed vegetables", "url": "www_bbc_co_uk_food_recipes_wholeroastchickenpot_13472", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 poussins", "100g/3½oz button mushrooms", "200g/7oz shallots ", "50g/2oz garlic ", "50g/2oz thyme,  finely chopped ", "3 tsp breadcrumbs", "100g/3½oz butter", "25g/1oz pancetta", "2 slices of pancetta for wrapping", "100g/3½oz flat leaf parsley", "2 cloves garlic", "50g/2oz butter", "salt and pepper to taste", "1kg/2¼lb potatoes eg. Jersey Royals", "100g/3½oz pancetta, fried off and diced", "2 tsp cornflour", "picked thyme", "1 bunch baby carrots", "1 bunch baby turnips", "1 bunch baby leeks", "100g/3½oz green beans"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To prepare the poussin, take off the legs, cut off the carcass to leave the breast on the crown. Scrape away the wishbone and trim away the wing bone.", "Take the thigh bones out of the legs and trim off the knuckle of the drumstick (you can leave the bone in, but it won t leave you much room for the stuffing).", "Leave in the fridge until ready to fill with the mushroom farce. ", "For the mushroom farce, finely chop the mushrooms, shallots, pancetta and garlic.", "Fry the pancetta until the fat starts to run out on the bacon. Add the butter, garlic and shallots, cook for a few minutes and then add the mushrooms and thyme.", "Cook the mushrooms until they are soft, add the breadcrumbs and season.", "When cool fill the chicken legs. Note: The consistency should be pliable and not too crumbly and dry.", "Re-shape the legs then wrap in pancetta and secure with cocktail sticks.", "For the herb butter, blend all the ingredients together in a blender until you have a brilliant green colour.", "Lift the breast skin off the poussin and fill with the butter. Pull the skin down, season and wrap in tin foil.", "Roast the legs and breast in a moderate oven (200C/400F/Gas 6) for 20 minutes, or until cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove from the oven and set aside to rest.", "For the rösti, peel and grate the potatoes, squeeze out any excess water, then add the bacon, thyme and cornflour. Season with salt and pepper.", "In a small frying pan heat up a little oil and add the potato mix. Fry on both sides to give colour. ", "For the vegetable garnish, make the emulsion by adding butter to a pan with water, heat up until the butter has melted, put to one side.  ", "Scrub clean all the vegetables, blanch and re-fresh in iced water.", "Top and tail the beans, blanch and re-fresh in iced water.", "Any green vegetables should be put into boiling water and then cooked.  Other vegetables can be put into cold water and then brought to the boil.", "To serve, warm the chicken in the oven, eat up the vegetables in a little melted butter and warm through the rosti. Arrange neatly on the plate and garnish with watercress."]}, {"isVegetarian": false, "title": "Whole tandoori chicken with coriander chutney", "url": "www_bbc_co_uk_food_recipes_wholetandoorichicken_74790", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wholetandoorichicken_74790_16x9.jpg", "ingredients": ["1.5kg/3½lb whole chicken", "4 tbsp natural unsweetened yoghurt", "1 tsp garam masala", "4 tbsp single cream", "2 tbsp medium-hot paprika", "1 tsp medium-hot chilli powder", "1 tsp ground cumin", "2 tbsp lemon juice", "2 tbsp vegetable oil", "1 tsp salt", "½ tsp turmeric", "1 tbsp tomato purée", "4 garlic cloves, crushed ", "2 tsp peeled and finely grated root ginger", "100g/4oz coriander leaves, roughly chopped", "3 green finger chillies, roughly chopped", "1 garlic clove, roughly chopped (optional)", "½ tsp salt", "1 tsp lemon juice", "1 tsp demerara sugar"], "serves": "Serves 2-3", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Prick the chicken all over and make a few slits about 2cm/¾in long on the skin.", "Mix all the remaining chicken ingredients into a smooth paste and rub the marinade generously all over the chicken skin. Cover and refrigerate for eight hours or overnight.", "Preheat the oven to 180C/350F/Gas 4.", "Place the chicken in a roasting tin and cover with foil. Roast in the centre of the oven for 1½ hours. Halfway through cooking, baste with a little of the marinade.", "Remove chicken from the oven and leave in a warm place to rest for 20 minutes.", "Meanwhile, for the coriander chutney, place all the ingredients in a blender and blend until the mixture become a coarse paste. Add 4-5 tablespoons of cold water to ease blending. Alternatively, use a pestle and mortar.  This chutney can be stored in an airtight, non-metallic container for up to four days in the refrigerator."]}, {"isVegetarian": false, "title": "Wild boar fillet with beetroot and cumin seeds", "url": "www_bbc_co_uk_food_recipes_wild_boar_fillet_with_80335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb small heritage beetroot, trimmed", "3 tbsp rapeseed oil", "900g/2lb boar fillet", "salt and freshly ground black pepper", "55g/2oz butter", "1 tbsp cumin seeds", "2 tbsp chopped chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beetroot in boiling salted water for about 30 minutes (depending on size) until just cooked. Remove from the water and leave to cool. ", "In another pan, heat two tablespoons of oil and fry the boar fillets for about 10 minutes, turning frequently.", "Season with salt and pepper, then take out and leave to rest for 10 minutes. Reserve the pan juices.", "While the meat is resting, slip the skins off the beetroot and cut them into wedges.", "Heat the remaining oil and the butter in a frying pan and add the beetroot wedges. Fry for about five minutes then season with salt and pepper and add the cumin seeds. Stir, then take off the heat.", "To serve, lay the beetroot on a serving dish. Slice the boar fillets and arrange the meat on top of the beetroot. Pour over the pan juices and sprinkle with chopped chives."]}, {"isVegetarian": false, "title": "Wild boar loin and sausage parcel, sour winter slaw and poached quince", "url": "www_bbc_co_uk_food_recipes_wild_boar_loin_and_87384", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb white cabbage, shredded", "200g/7oz red cabbage, shredded", "4 carrots, coarsely grated", "2 candy beetroot, coarsely grated ", "2 yellow beetroot, coarsely grated", "1 quince, coarsely grated", "4 tsp salt\t", "1 bay leaf", "5 all spice berries", "5g caraway seeds", "300ml/10fl oz boiled and cooled water", "300g/10½oz sour slaw base (from above)", "3 tbsp olive oil", "1 pinch freshly ground black pepper", "2 pinch salt", "1 pinch caster sugar", "10g chopped parsley, plus extra for garnish", "2 spring onions sliced, green only, plus extra for garnish", "300g/10½oz wild boar loin, cleaned form fat and sinews", "40ml/1½fl oz  quince liquor", "5g salt", "1 pinch freshly ground black pepper", "10g wholegrain mustard", "100g smoked lardo, diced", "300g mixed wild mushrooms", "1 tsp lemon juice", "salt and freshly ground black pepper", "350g/12oz wild boar sausages (about 6)", "3g chopped fresh marjoram, (or 1g dried)", "1 egg, beaten", "5 sage leaves", "100g/3½oz pork caul, soaked in salted water till white and dried on a cloth (alternatively use streaky bacon)", "vegetable oil, for frying", "400ml/14fl oz white wine", "100ml/3½fl oz quince liquor", "150g/5½oz caster sugar, plus extra for the quince peices", "3 tbsp lemon juice", "1 vanilla pod, cut and seeds scraped out", "2 star anise", "3 green cardamom pods", "6 all spice berries", "10 juniper berries, lightly crushed", "1 cinnamon stick", "2 bay leaves", "2 cloves", "5 strips orange zest", "3 quinces, flesh cut into chunks, cores discarded"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the sour winter slaw base, place all ingredients in a bowl and mix well.", "Bash everything with the end of a rolling pin till bruised and juice is released.", "Put the mixture into a sterilised 2 litre preserving jar, press it a little and top up with cooled water to cover. (Make sure there is some space to the top of the jar, but vegetables are fully covered.)", "Place jar on a tray or deep plate and leave in warm place for 3 days. (in the first 24 hours some juice may come up through the lid). After 3 days put in the fridge or a cold larder. The slaw is ready to eat. If you like it to be more sour leave it out for up to a week.  ", "To finish the slaw, combine all the ingredients for the slaw mix together with the base just before serving.", "For the wild boar and sausage parcel, marinate the wild boar loin in all the ingredients for 2 to 4 hours in the fridge.", "When marinated quickly seal the loin on all sides, by cooking in a frying pan of hot oil. ", "Add the marinade and heat to reduce in volume to a sticky glaze. (Take care as the alcohol may catch fire.) Cool and set aside in the fridge. ", "For the sausage meat, first cook the mushrooms. Heat the lardo in a frying pan until melted then add the mushrooms. Fry quickly, season with lemon juice, salt and pepper.", "Set aside two thirds of the mushrooms and warm up before serving.", "Chop the rest of the cooked mushrooms and add them to the wild boar sausage meat, egg and marjoram and mix well to combine.", "To make the parcel, on cling film flatten the sausage meat into an even rectangle the width of the loin and long enough to wrap around the loin.", "Place the loin on top of the sausage meat and wrap the sausage meat around it. Roll and shape it into a smooth even sausage, wrapped in cling film.", "Chill in the fridge to set.", "When cold place sage leaves in a line on top of the roll.", "Wrap in pork caul, to create a nice tight parcel (you can use streaky bacon instead).", "To cook the parcel, preheat the oven to 180C/160C Fan/Gas 4. \t", "Heat the vegetable oil in an ovenproof frying pan big enough to hold the parcel.", "Place the parcel in the pan with the sage leaves down and quickly seal all over until golden-brown. Transfer the pan to the oven and cook for 15 minutes. Take out and rest in a warm place for 10 minutes (this is very important).", "For the poached quince, place all ingredients except the quince in a pan. Add 500ml/18fl oz of water and bring to the boil. Add the quince and simmer for about 15 minutes until soft, but not mushy. Then strain, reserving the cooking liquid.", "Take half the quince pieces and put in a blender. Add enough cooking liquid to cover and blend to a smooth, thick purée (add some more cooking liquid if necessary)", "Toss the remaining quince pieces in caster sugar and cook in a hot frying pan until caramelised.", "To serve, pour the warm purée onto a serving plate and arrange the caramelised quince pieces around the plate. Carve the wild boar parcel into 1cm/½in thick slices, and season lightly with sea salt. Arrange 3 slices per person. Add a high pile of sour winter slaw, scatter around the reheated wild mushrooms, sprinkle with chopped parsley and spring onions. "]}, {"isVegetarian": false, "title": "Wild boar ragù with fresh pasta", "url": "www_bbc_co_uk_food_recipes_wild_boar_rag_with_fresh_39141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_boar_rag_with_fresh_39141_16x9.jpg", "ingredients": ["olive oil, for frying", "1 onion, peeled and finely chopped", "2 carrots, peeled and finely diced", "2 sticks celery, finely diced", "2 garlic cloves, peeled and finely sliced", "flour, for dusting", "salt and freshly ground black pepper", "750g/1lb 10oz wild boar neck or shoulder, chopped into 3cm/1in cubes", "100g/3½oz pancetta", "1 bay leaf", "5cm/2in strip of orange rind", "375ml/13fl oz red wine, preferably Italian ", "2 tbsp tomato purée", "4 sprigs oregano, leaves picked and roughly chopped", "300g/10oz tipo 00 flour", "½ tsp salt ", "3 free-range eggs", "semolina, for dusting", "250g/9oz fresh porcini mushrooms, halved lengthways", "olive oil, for frying", "fresh parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Heat the oil in an ovenproof, heavy-based pan or casserole set over a low-medium heat. Add the onion, carrot, celery, garlic and bay leaf. ", "Season the flour with salt and pepper. Lightly coat the wild boar in the seasoned flour. Add some olive oil to a separate pan set over a high heat and add the wild boar pieces. Fry until the meat is golden-brown on all over - this may have to be done in batches to avoid crowding the pan. ", "When the vegetables have softened, add the pancetta, bay leaf and orange rind to the pan. Cook for about five minutes until much of the pancetta fat has rendered and the vegetables have browned a little around the edges. ", "Add the browned boar meat to the vegetables. Pour the red wine into the frying pan used to brown the meat. Cook over a medium heat, scraping the bottom of the pan to loosen any charred bits of meat.", "Add the tomato purée to the ragú and stir it through. Cook for two minutes stirring regularly to avoid burning.", "Pour the warm wine into the ragú, add 200ml/7fl oz water and bring to a simmer. Add the oregano leaves and stir through.", "Put the lid on the pan and place in the preheated oven for 1½ hours, or until the meat is meltingly tender and the liquid reduced. Check once or twice in this time and stir to prevent the meat on the surface drying out. ", "In the meantime make the pasta. Tip out the flour on to a clean surface and create a small well in the middle. Sprinkle over the salt. ", "Crack the eggs into the well and, using a fork, begin whisking the eggs, slowly working in the flour. Once most of the flour has been incorporated, use your hands to knead the dough for about five minutes. The dough should be smooth and pliable. If not keep kneading until it is.", "Wrap the pasta in cling film and set aside to rest for 5-10 minutes.", "Halve the dough and pass one half through each stage of a pasta machine twice, starting at the widest setting and working down until you have passed it through the thinnest setting. Coat the pasta with a little semolina flour to stop it sticking and set aside for a few minutes to dry slightly. Repeat with the remaining pasta.", "Cut the pasta sheets using the tagliatelle cutter or, if cutting by hand, take one of the short ends of the pasta and fold over a 5cm/2in strip. Keep folding until you have a parcel of pasta, then slice the parcel into 1cm/½in wide strips – cutting from the short end to produce long strips of pasta. Coat the strips in a little more semolina flour to prevent them sticking together.", "When ready to cook, bring a large pot of water to the boil and add a generous amount of salt. Drop your pasta in and cook for about three minutes before draining. Dress with a little olive oil if not eating immediately. ", "Before serving, add a little olive oil to a pan over a medium-high heat. Once smoking, add the halved mushrooms and sauté for 2-3 minutes. ", "To serve, tip the pasta into the finished ragù and serve in portions topped with freshly grated parmesan and fried mushrooms."]}, {"isVegetarian": false, "title": "Wild boar ragù", "url": "www_bbc_co_uk_food_recipes_wild_boar_rag_76073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1lb 9oz boneless wild boar shoulder ", "4-5 tbsp sunflower oil", "4 rashers rindless smoked streaky bacon or pancetta, cut into 1cm/½in slices", "1 large onion, finely chopped", "4 garlic cloves, crushed", "75g/2½oz pitted black olives, rinsed, drained and sliced", "2 tsp juniper berries, lightly crushed in a pestle and mortar", "500ml/18fl oz red wine", "400g/14oz can chopped tomatoes", "2 tbsp tomato purée", "1 beef stock cube", "2 large bay leaves", "3 bushy sprigs thyme", "1 rosemary stalk, around 12cm/4½in long, leaves finely chopped", "2 tsp caster sugar", "flaked sea salt and freshly ground black pepper", "freshly cooked pappardelle pasta, to serve", "parmesan shavings, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the boar into chunky pieces, each around 2.5cm/1in. Trim off any really hard fat or sinew as you go. Season the meat really well with salt and pepper. Heat two tablespoons of the oil in a large frying pan.", "Fry the boar in two batches over a medium-high heat until nicely browned on all sides, turning every now and then and adding more oil if necessary. As soon as the boar is browned, transfer to a large flameproof casserole or large saucepan. ", "Pour a little more oil into the pan in which the boar was browned and fry the bacon for 2-3 minutes, or until the fat crisps and browns. Scatter over the meat. Add a touch more oil to the frying pan and fry the chopped onion over a low heat for five minutes, stirring often until beginning to soften. ", "Stir the garlic, olives and crushed juniper berries into the pan and cook for two minutes more, stirring. Add to the flame-proof casserole with the meat and pour over the wine. ", "Stir in the tomatoes, tomato purée and 500ml/18fl oz cold water. Crumble over the stock cube, add all the herbs and the sugar and bring to a simmer. ", "Stir well, cover loosely with a lid, reduce the heat to low and leave to simmer very gently for 2½ hours, or until the boar is completely tender and falling apart. ", "Remove the lid every now and then and stir. If the liquid reduces too much, add a little extra water. The sauce should be fairly thick when you are finished, but not at all dry. Remove the thyme and rosemary stalks and bay leaves.  Season to taste with salt and pepper.", "Toss the ragù with freshly cooked pappardelle pasta and sprinkle with a few parmesan shavings to serve."]}, {"isVegetarian": false, "title": "Wild duck with orange juice and savoy cabbage with smoked bacon", "url": "www_bbc_co_uk_food_recipes_wild_duck_with_orange_75399", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 Seville oranges", "2 wild ducks", "salt and freshly ground black pepper", "50ml/2fl oz orange liqueur", "200ml/7fl oz white wine", "20g/¾oz butter", "1.5kg/3¼lb savoy cabbage", "50ml/2fl oz vegetable oil", "3 carrots, diced", "2 garlic cloves, crushed and very finely chopped", "350g/12oz smoked bacon rashers, halved", "200g/7oz celeriac, peeled and diced", "salt and freshly ground black pepper", "2 Seville oranges, peeled and divided into segments"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, preheat the oven to 230C/450F/Gas 8. ", "Squeeze the Seville oranges, reserve the juice and stuff the ducks with the skins. Truss the ducks and season the skin with salt and pepper. Place on a rack sat in a roasting tray.", "Roast the ducks in the hot oven for 45 minutes to an hour - they should be slightly underdone. Pour off the fat from the roasting pan. Pour the orange liqueur over the ducks and set alight to flame the duck. Place them on a dish, breast-side down, and keep in a warm place.", "Drain any remaining fat from the roasting pan, then pour in the wine, deglaze the pan by scraping off the juices from the bottom. Heat and reduce in volume to a thick sauce. Add the orange juice, heat again to reduce in volume by half, then beat in the butter and check the seasoning. ", "For the savoy cabbage with smoked bacon, discard the tough dark green outer cabbage leaves. Stack the leaves in threes and remove the large middle veins with a sharp knife. Chop coarsely. ", "Heat half the oil in a large frying pan. Put in the carrots and cook until tender, then stir in the garlic and cook for a few minutes, stirring continuously. Transfer the vegetables to a bowl, using a slotted spoon.", "Fry the bacon in the same pan until brown and crisp, then lift it out with the slotted spoon and put with the carrot. ", "Cook the celeriac in the bacon fat until lightly brown and tender and put with the carrots and bacon.", "Add the remaining vegetable oil to the pan. When hot, cook the cabbage, season with salt and stir well so the cabbage does not burn. ", "Cover with a tight fitting lid and cook over a high heat, shaking the pan briskly. The heat will make the cabbage shrink and loose volume. ", "Cook until tender, then mix in the bacon and the other vegetables. Check the seasoning.", "To serve, carve the ducks, arrange them on a serving dish with the orange segments and coat with the sauce. Pile the cabbage alongside."]}, {"isVegetarian": false, "title": "Wild duck with blackcurrant and cassis sauce", "url": "www_bbc_co_uk_food_recipes_wild_duck_with_63250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 wild duck", "5cm/2in square pork back fat", "sea salt and freshly ground black pepper", "50g/1¾oz butter", "3 shallots, finely diced", "1 sprig thyme", "splash of red wine vinegar", "150ml/5fl oz port", "150ml/5fl oz red wine ", "50ml/2fl oz cassis", "50ml/2fl oz blackcurrant juice", "1 tbsp blackcurrants"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Truss the duck and lay the square of back fat over the breast. Place the bird in a roasting tin and put it in the oven. After 10 minutes, remove the fat to allow the breast to brown. ", "Cook for a further 40 minutes, basting the bird from time to time, then remove from the oven and let it rest in a warm place.", "In a saucepan, melt half the butter and gently cook the shallots with the thyme for 10 minutes. Add the vinegar and let it bubble for 30 seconds then pour in the port, wine and cassis. Reduce to a thin syrup then add the blackcurrant juice and simmer for five minutes. ", "Add the blackcurrants, warm through gently then whisk in the remaining butter and remove the pan from the heat.", "Carve the rested duck, arrange slices on warm plates then spoon the sauce around the duck. Serve with game chips and watercress."]}]