[{"ingredients": ["un poco de aceite de girasol, para engrasar", "225g / 8oz de mantequilla, ablandada", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "Harina de levante 225g / 8oz", "200g / 7oz de chocolate blanco", "200g / 7oz de mantequilla, suavizada", "400g / 14oz de azúcar glasé", "2 limones, ralladura fina solamente", "1 lima, ralladura fina solamente", "Mango de 250 g / 9 oz, cortado en cubitos (aproximadamente 2 mangos medianos)", "2 cucharaditas de coco desecado, tostado", "1 lima, ralladura finamente rallada solamente (opcional)"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 (ventilador de 160 ° C). Engrase dos latas cuadradas de sándwich cuadrado de 18cm / 7 pulg con un poco de aceite y luego forre con pergamino para hornear. Siéntate en una bandeja para hornear y deja a un lado.", "Ahora haz la esponja. Es más fácil usar un mezclador de alimentos con un accesorio batidor para esto, pero también puede hacerlo a mano. Crema la mantequilla y el azúcar hasta que estén bien combinados. Agregue los huevos, uno a la vez, batiendo bien entre cada adición. Luego doble la harina hasta que la mezcla esté uniforme y suave. Divida la mezcla de manera uniforme entre las latas, extendiéndola suavemente con el dorso de una cuchara. Hornea por 18-20 minutos.", "Mientras tanto, prepara los fragmentos de chocolate. Recorta un pedazo de pergamino para hornear de 28x33cm / 11x13 pulgadas y colócalo en una bandeja para hornear. Derrita el chocolate en un recipiente sobre una fuente de agua hirviendo (no permita que el recipiente toque el agua) o en explosivos de 30 segundos en el microondas, removiendo entre cada intento. Una vez derretido, revuelva el chocolate hasta que esté suave y luego viértalo en el centro del pergamino de hornear preparado. Coloca un pequeño punto de chocolate derretido debajo de cada esquina del papel para pegarlo en la bandeja e impedir que se mueva. Con una espátula, extiende el chocolate por todo el papel hasta los bordes en una capa lisa y uniforme. Pop en la nevera durante 30 minutos, o hasta que esté firme.", "Mientras tanto, prepara la guinda. (De nuevo, esto se puede hacer en un mezclador de alimentos con el accesorio batidor o con la mano). Dele a la mantequilla un golpe rápido para aflojarlo y luego agregue el azúcar glas y las ralladuras de limón y lima. Batir hasta que esté completamente combinado, suave y cremoso en la textura. Dejar de lado hasta que esté listo para usar.", "Para comprobar que los pasteles estén cocidos, inserte un pincho en el centro de los pasteles; si están cocidos saldrá limpio. Una vez horneado, retíralo del horno y déjalo a un lado para que se enfríe por completo.", "Retire el chocolate del refrigerador una vez que esté firme. Sumerja un cuchillo largo y afilado en agua muy caliente y seque. Pase el cuchillo por debajo del papel para soltarlo de la bandeja y luego corte el chocolate en doce rectángulos de 11x7 cm / 4¼x2¾in. Con cuidado pele cada una del papel de respaldo y coloque sobre una tabla limpia. Recorta los bordes irregulares para limpiar los fragmentos. Luego haga un corte en la diagonal de aproximadamente 3 cm / 1¼ en un lado largo para obtener un acabado decorativo agradable. Si los fragmentos se sienten demasiado blandos en algún momento, devuélvalos a la nevera brevemente hasta que se endurezcan. Del mismo modo, si se rompen durante el corte, significa que son demasiado duros y quebradizos, por lo que deben calentarse a temperatura ambiente antes de continuar. Devuelva los fragmentos preparados al refrigerador hasta que sea necesario.", "Una vez que se haya enfriado, retire los pasteles de las latas y retire el papel. Extienda un pequeño punto de glaseado de crema de mantequilla en el centro de un plato para servir o un soporte para pasteles. Siéntate un pastel medio encima para pegarlo y luego extiende la parte superior de este uniformemente con un tercio (aproximadamente 200 g / 7 oz) del glaseado de crema de mantequilla. Siente la torta restante en la parte superior para emparedar el relleno y luego extiende el resto del glaseado de mantequilla por toda la parte superior y los lados del pastel de manera uniforme. No tiene que verse perfecto ya que todo el pastel pronto estará cubierto con trozos de chocolate y fruta.", "Para decorar, pegue un fragmento, con la punta hacia arriba y el lado más bonito hacia afuera, contra el costado del pastel, empezando por un borde. Luego agrega otro, superponiéndolo un poco sobre el primero. Luego agrega un tercero de la misma manera para completar un lado. Repita para usar todos los fragmentos y cubrir todos los lados de la torta.", "Esparce las piezas de mango en una sola capa por todo el pastel. Espolvorea sobre la ralladura de coco y lima (si se usa) y está listo para servir. Si no se sirve de inmediato, es mejor guardarlo en el refrigerador para evitar que los fragmentos se derritan. Se puede preparar hasta con un día de anticipación."], "url": "www_bbc_co_uk_food_recipes_mango_and_white_61987", "title": "Mango y pastel de chocolate blanco con coco tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mango_and_white_61987_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de azúcar mascabado ligero", "125g / 4½oz de mantequilla sin sal", "125g / 4½oz de harina natural", "90 g / 3¼ oz de avena", "1 huevo de gallinas camperas, batido para lavar huevos", "Puré de mango 175g / 6oz", "1 cucharada de jugo de lima", "100 g / 3½ oz de azúcar en polvo", "500g / 1lb 2oz mascarpone", "160g / 5oz de crema fresca", "4 huevos medianos de granja", "60 g / 2¼ oz de yema de huevo de corral (de aproximadamente 3 huevos medianos)", "Azúcar granulada 150 g / 5½ oz", "Avellanas blanqueadas 150 g / 5½ oz, tostadas", "200g / 7oz de crema fresca", "300 g / 10½ oz de mascarpone", "2 huevos medianos de granja", "1 yema de huevo de rango medio", "1 cucharada de jugo de limón", "3 cucharaditas de hojas de romero picadas", "Crema de 75g / 2½ oz", "210g / 7½oz mascarpone", "2 huevos medianos de granja", "75 g / 2½ oz de miel clara", "Avellanas de 40 g / 1½ oz, tostadas", "150 g / 5½ oz de azúcar en polvo", "flores comestibles, como violetas y pensamientos", "manojo de romero (idealmente en flor)"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la base de galletas de granola, mezcle el azúcar, la mantequilla y la harina en un procesador de alimentos. Agregue la avena y el pulso para mezclar.", "Alinee los lados y la base de las 3 latas de pastel con papel de hornear. Presione la mezcla de galletas en las bases de los moldes para pasteles y hornee durante 10 minutos hasta que se doren. Cepille la superficie de las galletas con huevo lavado, luego hornee por otros 5 minutos. Dejar de lado para enfriar.", "Reduzca la temperatura del horno a 160 ° C / 140 ° Ventilador / Gas 3. Envuelva la parte exterior de todas las latas de torta en una doble capa de papel de aluminio. Llena un hervidor con agua y ponlo a hervir.", "Para la tarta de queso de mango, bata todos los ingredientes juntos en un tazón grande hasta que quede suave. Vierta la mezcla en la lata para pastel de 20 cm / 8 in y colóquela en un plato hondo lo suficientemente grande como para acomodar la lata.", "Agregue suficiente agua hirviendo al plato de tostado para llegar hasta la mitad del lado de la lata de la torta. Hornee durante aproximadamente 1 hora, o hasta que se establezca con un ligero bamboleo.", "Para la tarta de queso de praliné de avellana, caliente el azúcar en una sartén con suficiente agua para disolver el azúcar (unas cucharadas soperas). Cocine hasta que se convierta en un caramelo marrón oscuro, luego retírelo del fuego e incline las avellanas. Dale la vuelta a una bandeja de metal para hornear forrada con pergamino para hornear. Transfiera a un congelador para enfriar el praliné rápidamente. Cuando esté listo, divida el bombón en trozos grandes, transfiéralo a un procesador de alimentos y divídalo en migajas.", "Caliente la crème fraîche y el mascarpone en una cacerola a fuego medio-bajo. Agregue las migas de praliné y caliente suavemente hasta que el praliné se haya disuelto en la mezcla. Agregue los ingredientes restantes para la tarta de queso de praliné de avellana y caliente con cuidado.", "Vierta la mezcla en la lata de pastel de 15 cm / 6 pulgadas y coloque la lata de pastel en un plato hondo profundo. Llene el plato con suficiente agua hirviendo para llegar a la mitad de los lados de la lata de la torta. Hornee durante aproximadamente 45 minutos, o hasta que el relleno esté configurado con un ligero bamboleo.", "Para la tarta de miel y romero, agregue el romero, la crema fresca y la mitad del mascarpone en una cacerola. Llevar a ebullición, luego reduzca el fuego para permitir que el romero se infunda por unos minutos. Pase la mezcla a través de un tamiz de malla fina para eliminar el romero.", "Mezcle la mezcla filtrada con los ingredientes restantes de la tarta de queso y caliente suavemente. Transfiera a la lata de pastel de 10 cm / 4 in y colóquelo en un plato de asar. Llene el plato con suficiente agua hirviendo para llegar a la mitad de los lados de la lata de la torta. Hornee durante aproximadamente 30 minutos, o hasta que el relleno esté listo con un leve bamboleo.", "Una vez que todas las tartas de queso estén cocidas, colóquelas a un lado en sus latas para que se enfríen por completo (puede hacer esto si está congelado si tiene poco tiempo).", "Para la decoración, inserte los palitos de cóctel en las avellanas. En una sartén, disuelva el azúcar impalpable con unas cucharadas de agua hasta que se forme un caramelo.", "Coloque algunas capas de periódicos viejos en el piso cerca del borde de una encimera o mesa (las avellanas cubiertas de caramelo colgarán sobre el borde para que el caramelo se extienda).", "Teniendo cuidado de no quemarte, sumerge las avellanas en el caramelo. Colóquelo en el borde de una mesa con las avellanas colgando sobre el borde y los palitos de cóctel pesados ​​por algo pesado. Deja hasta que el caramelo se haya puesto.", "Cuando los pasteles estén completamente fríos, quítelos de sus latas y colóquelos en tablones para pasteles.", "Inserte 5 tacos en la tarta de queso de 20 cm / 8 pulgadas y corte a la altura de la tarta de queso. Haz lo mismo con la tarta de queso de 15 cm / 6 pulgadas pero con 4 tacos. Apila las tartas de queso en un plato de servir.", "Coloque los fragmentos de avellana en la parte superior de la torta de mango que rodea el pastel de avellanas. Coloque flores comestibles alrededor de la parte inferior de la tarta de queso de mango. Inserte unas ramitas de romero en la tarta de queso superior."], "url": "www_bbc_co_uk_food_recipes_mango_hazelnut_and_82943", "title": "Trío de tortas de mango, avellana y romero", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace una tarta de queso de 3 niveles", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 rebanadas de tocino", "1 cucharadita de aceite de sésamo", "5 tallos choi suma", "1 cucharadita de salsa de soja", "½ mango, en rodajas finas", "1 cucharada de cilantro fresco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una bandeja para hornear, coloque la panceta plana y colóquela en un horno caliente durante cuatro minutos hasta que quede crujiente.", "Escurrir sobre papel de cocina.", "En un wok caliente, agregue el aceite de sésamo y la suma de choi, y saltee durante dos minutos. Luego agrega la salsa de soja y luego quita el fuego.", "Coloque la suma de choi en un recipiente y mezcle con el mango y el cilantro.", "Sirva en un plato y cubra con la panceta crujiente."], "url": "www_bbc_co_uk_food_recipes_mangoandbaconsalad_76147", "title": "Ensalada de mango y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble de 200 ml / 7 fl oz", "2 cucharadas de queso mascarpone", "1 cucharada de azúcar en polvo", "75g / 2¾oz de almendras en copos", "100g / 3½oz de coco desecado", "100g / 3½oz de almendras en copos", "100g / 3½oz de coco desecado", "55 g / 2 oz de mantequilla, derretida", "½ mango, pelado y finamente picado", "1 cucharada de miel", "pequeños copos de chile pizca"], "method": ["Para la tarta de queso, bata la crema con un batidor de mano eléctrico hasta que queden cintas cuando levantes el batidor de la crema. Agregue el mascarpone, el azúcar, las almendras copos y el coco desecado y póngalo en la nevera para que se enfríe.", "Mientras tanto, para la base, combine los ingredientes de la base en un tazón y mezcle bien para romper las almendras ligeramente. Presione en la base de dos anillos de 10cm / 4in chefs.", "Retire la mezcla de tarta de queso de la nevera y úsela casi para llenar los anillos de los chefs, dejando un espacio de 1 cm / ½ pulgada en la parte superior.", "Para el relleno de mango, mezcle el mango, la miel y el chile en un tazón y una cuchara en la parte superior de los pasteles de queso. Nivele las partes superiores con una espátula y relájese en la nevera durante diez minutos.", "Para servir, retire las tartas de queso de la nevera. Sosteniendo el exterior de los anillos con un paño caliente, coloque los pasteles de queso en platos para servir y deslice los anillos."], "url": "www_bbc_co_uk_food_recipes_mangoandcoconutchees_88602", "title": "Tartas de queso de mango y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 palitos de limoncillo", "280 ml / 10 fl oz; leche de pinta", "2 mangos maduros, despellejados y sin piedras", "2 cucharadas de yogurt griego", "2 cucharadas de helado de vainilla"], "method": ["Desmenuce la hierba de limón en un almirez y mortero hasta que se liberen sus aromas.", "Hervir la mitad de la leche y agregar el lemongrass. Cuando la leche infundida se haya enfriado a temperatura ambiente, retire la hierba de limón y deséchela.", "Coloque la leche en una licuadora, junto con los demás ingredientes y la leche fría restante. Guste hasta que esté suave.", "Vierta en un vaso alto para servir."], "url": "www_bbc_co_uk_food_recipes_mangoandlemongrassmi_83645", "title": "Batido de mango y limoncillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango, piel y piedra eliminados, picados", "150ml / 5¼fl oz de crema doble, ligeramente azotada", "1 cucharada de miel, más extra para lloviznar", "½ lima, jugo y ralladura solamente", "rodajas de limón y ramitas de menta fresca, para adornar"], "method": ["En un tazón pequeño, mezcle el mango picado, la crema batida, la miel, el jugo de limón y la ralladura y la cuchara en un vaso para servir. Adorne con una llovizna extra de miel, rodajas de limón y ramitas de menta."], "url": "www_bbc_co_uk_food_recipes_mangoandlimefool_88796", "title": "Tonto de mango y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 100 g / 3½ oz de levante automático, más extra para la elaboración", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos", "50 g / 2 oz de azúcar en polvo", "50ml / 2fl de leche en oz", "50 g / 2 oz de azúcar en polvo", "1 mango, pelado y toscamente picado", "1 lima, jugo y ralladura", "50 g / 2 oz de azúcar en polvo", "50g / 2oz de azúcar morena suave", "100 g / 3½ oz de mantequilla", "½ naranja, solo jugo", "200 ml / 7 fl oz crema doble, más extra, batida, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la harina y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue el azúcar impalpable y vuelva a pulsar. Agregue la leche y el pulso hasta que la mezcla se una como masa.", "Convierta la masa en una superficie enharinada y amase ligeramente. Haga rodar la masa hasta ½ cm / ¼ de grosor y recorte un círculo para que se ajuste al tamaño de una sartén pequeña a prueba de horno.", "Para el relleno, caliente el azúcar en la misma sartén a prueba de horno hasta que se derrita, luego agregue los trozos de mango, el jugo de limón y la ralladura y cocine hasta que esté caramelizado.", "Coloque la masa sobre la mezcla de relleno en la sartén y presione hacia abajo alrededor de los bordes.", "Transfiera al horno y hornee durante 8-10 minutos, o hasta que estén doradas.", "Para la salsa de caramelo, caliente los azúcares y la mantequilla en una sartén pequeña hasta que la mezcla se derrita y se combine bien y se torne de color caramelo. Agregue el jugo de naranja y la crema y revuelva hasta que quede suave.", "Para servir, voltea la tarta tatin en un plato y vierte sobre la salsa de caramelo. Sirva con una cucharada de crema batida."], "url": "www_bbc_co_uk_food_recipes_mangoandlimetartetat_85594", "title": "Tarta tatin de mango y lima con salsa de caramelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de fideos cocidos (comprados en la tienda, cocinados están bien; de lo contrario, use fideos finos de arroz)", "2 mangos, muy firmes", "Mangetout 175g / 6oz, triturado longitudinalmente", "6 cebollas de primavera, muy finamente cortadas", "puñado de cilantro fresco (los tallos están bien aquí)", "puñado de menta fresca", "2 limas, jugo y ralladura", "2 cucharadas de miel clara", "2 cucharaditas de jengibre recién rallado", "1 cucharada de salsa de pescado o salsa de soja (opcional)", "6 cucharadas de aceite de girasol", "1 cucharada de aceite de sésamo tostado", "3 cucharadas de semilla de sésamo tostado", "pimienta negra recién molida"], "method": ["Pele los mangos y luego corte en finas tiras. Incline en un recipiente con el mangetout, cebolletas y fideos cocidos.", "Vierta el jugo de limón y la ralladura, la miel, el jengibre y la salsa de pescado (si está usando) en una licuadora, agregue el cilantro y la menta y mezcle hasta obtener una pasta homogénea.", "A continuación, agregue lentamente el aceite de girasol a través del alimentador, con el motor en marcha, para formar una emulsión suave. Finalmente agregue el aceite de sésamo.", "Mezcle la ensalada con el aderezo y espolvoree con las semillas de sésamo justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_mangoandmangetoutnoo_70351", "title": "Ensalada de fideos de mango y mangetout", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 mangos grandes, pelados, apedreados y en rodajas", "sal", "4 dientes de ajo, pelados y triturados", "450 g / 1lb de azúcar en polvo", "2 manzanas para hornear, peladas, sin corazón y picadas", "1 cucharada de mostaza inglesa en polvo", "1 cucharada de jengibre fresco rallado", "Vinagre de vino blanco 600ml / 1 pinta", "1 cucharada de pimienta de cayena"], "method": ["Coloque las rebanadas de mango en un tazón grande y espolvoree sal. Deja toda la noche. En la mañana, escurra el jugo y enjuague la fruta.", "Ponga el ajo, el azúcar, las manzanas, la mostaza, el jengibre, el vinagre y la pimienta de cayena en una sartén y, a fuego lento, disuelva el azúcar.", "Llevar a ebullición y agregar los mangos. Cocine a fuego lento durante 30 minutos hasta que la salsa picante esté espesa y almibarada. Cuchara en frascos y sello esterilizados."], "url": "www_bbc_co_uk_food_recipes_mangochutney_1319", "title": "Chutney de mango", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 2 jarras de 250 ml / 9 onzas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangochutney_1319_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de agua mineral embotellada", "5 g de alginato o polvo de algina (disponible en tiendas especializadas en línea)", "100 ml / 3½ fl oz crema batida", "1 ramita de canela", "4 dientes", "1 estrella de anís", "3 huevos medianos de granja, golpeados", "100g / 3½oz de azúcar morena suave", "4 rebanadas de brioche, rodajas cortadas en discos con un cortador de galletas de 7 cm / 3 in", "1 cucharada de aceite vegetal", "30 g / 1¼ oz de mantequilla sin sal", "20g / ¾oz de azúcar glasé", "1 g de polvo de gluco o iones de calcio comestibles similares (disponibles en tiendas especializadas en línea)", "Puré de mango de 150 g / 5 oz (o 1 mango entero, pelado, sin hueso, carne picada, mezclado para obtener un puré suave en un procesador de alimentos con 30 ml / 1 g de agua)", "50ml / 2fl oz de yogur al estilo griego", "Cristales de craquelado, para servir (opcional) (disponible en tiendas especializadas en línea)"], "method": ["Para el baño de alginato, mezcle el agua mineral embotellada y el polvo de algin en un procesador de alimentos durante 5-10 minutos, o hasta que estén bien combinados.", "Cuele la mezcla a través de un tamiz fino, luego vierta el líquido filtrado en una bandeja grande para hornear de al menos 5 cm / 2 pulgadas de profundidad. Enfriar en la nevera durante 24 horas (esto elimina el aire del líquido).", "Mientras tanto, para el brioche, ponga a hervir la nata, la canela, el clavo de olor y el anís estrellado. Retirar del fuego y reservar para enfriar.", "Cuando la mezcla de crema se haya enfriado, deseche la canela, el clavo de olor y el anís estrellado. Batir la crema en el huevo batido. Agregue el azúcar y bata de nuevo hasta que estén bien combinados. Sumerja los discos de brioche en la mezcla de huevo para remojar, luego enfríe, cubra, en la nevera durante la noche.", "Para el \"huevo\" de mango, agregue el polvo de gluco al puré de mango. Mezcle en un procesador de alimentos hasta que esté bien combinado, luego transfiera a un tazón limpio. Cubra y enfríe en la nevera durante la noche.", "Con una cuchara pequeña o una cucharilla, toma cuatro porciones pequeñas del puré de mango frío de la mezcla y rueda en bolas, con tus manos o dos cucharaditas.", "Cuando todas las bolas de mango hayan sido preparadas, retire el baño de alginato del refrigerador. Con cuidado, baje las bolas de puré de mango en la mezcla de alginato, déjelas durante 30 segundos o hasta que se forme una capa en el exterior de las bolas, luego retírela del líquido con una espumadera y transfiérala a un recipiente con agua (esto enjuagará cualquier alginato restante del huevo).", "Con una cucharada de helado o una cuchara de postre redonda, toma cuatro bolas de yogur al estilo griego. Con cuidado, baje las bolas en la mezcla de alginato.", "Escurra las 'yemas' del agua y regréselas a la mezcla de alginato, colocando una encima de cada bola de yogur al estilo griego, en el centro para que parezca un huevo frito. Deja durante 30 segundos o hasta que se forme una piel en el \"huevo\".", "Retírelo de la mezcla de alginato con una espumadera y transfiéralo a un recipiente nuevo de agua limpia (esto enjuagará cualquier alginato restante del huevo).", "Cuando esté listo para comer, caliente el aceite vegetal en una sartén antiadherente a fuego medio. Agregue los discos de brioche empapados a la sartén y fría por 2-3 minutos en cada lado, o hasta que estén dorados por ambos lados. Agregue la mantequilla y el azúcar glas a la sartén y continúe cocinando el brioche hasta que la mantequilla se haya derretido, el azúcar glas se haya disuelto y los discos de brioche estén caramelizados.", "Para servir, pinte un poco de puré de mango en el centro de cada uno de los cuatro platos. Coloque un disco de brioche en el centro de cada plato. Coloque un \"huevo\" de mango encima de cada disco brioche. Adorne con una pizca de cristales de craquelado, si se usa."], "url": "www_bbc_co_uk_food_recipes_mangoeggwithtoastedb_92671", "title": "Mango 'huevo' con brioche tostado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ mango, cortado", "2 cucharadas de azúcar en polvo", "1 lima, cáscara y jugo solamente, (manténgase separado)", "300ml / 10½ fl oz crema doble", "menta fresca, para adornar"], "method": ["Puré el mango en una licuadora con el azúcar impalpable y el jugo de lima.", "Batir la crema doble con la ralladura de lima.", "Tome un vaso alto y empiece por capas con el puré de mango y la crema de lima. Repita este proceso y termine con el puré de mango en la parte superior.", "Adorne con la menta para servir."], "url": "www_bbc_co_uk_food_recipes_mangofool_76149", "title": "Tonto de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango, piedra removida, pelada y rebanada", "50ml / 2fl oz crema batida", "100ml / 4fl oz de yogur griego", "25g / 1oz de azúcar glas", "ramita de menta fresca", "125 g / 4½ oz de azúcar en polvo", "agua fría, para cubrir"], "method": ["Para el tonto, forra la parte inferior de un vaso alto con la mitad del mango rebanado.", "Coloque la crema, el yogur y el azúcar glas en un bol y mezcle bien.", "Vierta la mezcla de crema en el vaso y cubra con el mango restante.", "Para el azúcar hilado, coloque el azúcar y suficiente agua para cubrir en una cacerola y coloque a fuego alto. Deja hasta que el azúcar se haya disuelto y el líquido se haya vuelto de color caramelo claro. Retire del fuego y coloque la cacerola en una sartén que contenga agua fría.", "Con un tenedor, saque con cuidado los hilos de azúcar de la bandeja y dé forma alrededor de un acero limpio engrasado u otro implemento de metal en un patrón retorcido.", "Para servir, coloque los hilos de azúcar encima del vaso de budín junto con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_mangofoolwithspunsug_84036", "title": "Tonto de mango con azúcar hilado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango, piel dejada en", "½ pizca de chile en polvo", "25g / 1oz de azúcar glas", "5 cucharadas de yogur al estilo griego", "1 cucharada de miel"], "method": ["Precalentar la parrilla a alto.", "Corta la carne de mango en un patrón entrecruzado en la parte superior. Doble el mango hacia dentro, presionando la piel hacia adentro. Esto debería verse como un erizo.", "Coloque el erizo de mango en una hoja a prueba de horno y espolvoree con la guindilla y el polvo con el azúcar glas.", "Coloque debajo de la parrilla caliente durante cuatro minutos hasta que el mango esté ligeramente dorado.", "Mezcle el yogur y la miel juntos.", "Transfiera el erizo de la parrilla a un plato y sirva con la mezcla de yogur con miel."], "url": "www_bbc_co_uk_food_recipes_mangohedgehogwithchi_77885", "title": "Erizo de mango con chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 yemas de huevo de gallinas camperas", "75ml / 3fl oz de agua", "200 g / 7 oz de azúcar en polvo", "Carne de mango de 250 g / 9 oz, picada", "Crema doble 250ml / 9fl oz", "75ml / 3fl oz de claras de huevo de gallinas camperas", "2 claras de huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "Crema doble 175ml / 6fl oz, ligeramente batida", "3 maracuyá, carne extraída", "2 cucharadas de azúcar glas", "½ mango, finamente cortado"], "method": ["Para el parfait de mango, coloque las yemas de huevo, el agua y la mitad del azúcar en una cacerola y bata para combinar. Coloque a fuego lento y cocine suavemente, revolviendo ocasionalmente, durante unos diez minutos, hasta que la mezcla se espese.", "Retirar del fuego y verter en un recipiente para mezclar. Batir hasta que la mezcla se enfríe y esté ligera y esponjosa.", "Mientras tanto, coloca la carne de mango en una licuadora y licúa hasta que quede suave. Pasar a través de un tamiz en un recipiente.", "Agregue la crema a la mezcla de mango y bata hasta que la mezcla forme picos suaves cuando se quite la batidora. Dobla la mezcla de yema de huevo enfriada.", "Coloque las claras de huevo en un recipiente y bata hasta que se formen picos suaves cuando se quite el batidor. Agregue gradualmente el azúcar impalpable restante, y continúe batiendo hasta que esté tieso y brillante.", "Dobla la mezcla de clara de huevo en la mezcla de crema hasta que esté bien combinada.", "Vierta la mezcla en seis moldes individuales de budín con película adhesiva. Coloque en el congelador durante 1-2 horas hasta que esté completamente firme.", "Precalentar el horno a 100C / 200F / Gas ¾.", "Para la pila de merengue, coloque las claras de huevo en un recipiente y bata hasta que se formen picos suaves cuando se quite la batidora.", "Poco a poco agregue el azúcar y continúe batiendo hasta que esté tieso y brillante.", "Coloque la mezcla en una bolsa de plástico con una boquilla pequeña y lisa. Dibuja 18 círculos de 7,5 cm / 3 pulg. De diámetro en un pergamino para hornear y colócalos en una bandeja para hornear. Pipe el merengue en espiral para llenar cada círculo.", "Transfiera al horno y cocine durante 20 minutos, luego apague el horno pero deje los merengues allí durante al menos dos horas. Cuando estén crujientes, retírelos del horno y déjelos enfriar por completo.", "Retire el parfait del congelador cinco minutos antes de servir.", "Para servir, coloque un disco de merengue en cada una de las seis placas de servir. Extiende un poco de crema batida sobre ellos, luego rocía con la carne de maracuyá. Cubra con otro merengue y la crema y maracuyá restantes, luego termine con un tercer merengue.", "Convierte los parfaits en los platos con los merengues. Polvo el merengue apila con azúcar glas y encima con unas rodajas de mango."], "url": "www_bbc_co_uk_food_recipes_mangoparfaitwithpass_87048", "title": "Parfait de mango con fruta de la pasión y pilas de merengue", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 ml / 3½ fl oz de crema individual", "200ml / 7fl oz de leche entera descremada", "400ml / 14fl oz yogur natural sin endulzar", "Pulpa de mango de 400ml / 14fl oz", "4 cucharaditas de azúcar en polvo"], "method": ["Mezcle los ingredientes y sirva con hielo. ¡Fácil!"], "url": "www_bbc_co_uk_food_recipes_mangolassi_74038", "title": "Mango Lassi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Cartón de 200 g / 7 oz yogur griego", "1 cucharada de miel clara", "1 mango pequeño, pelado y cortado en cubos", "2 fruta de la pasión", "menta fresca, para adornar"], "method": ["Mezcle la miel y el yogur en un tazón pequeño. Usando una cucharilla, recoja las semillas y la carne de la fruta de la pasión en un tazón y mezcle con la mezcla de yogur.", "Divida la mezcla de mango y yogur por la mitad y colóquela en dos vasos con tallo. Enfríe por hasta 8 horas. Sirva a temperatura ambiente y adorne con menta fresca."], "url": "www_bbc_co_uk_food_recipes_mangopassionwithhone_67097", "title": "Pasión de mango con miel y yogur", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangopassionwithhone_67097_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 mangos indios Alfonso, en temporada de abril (o usar mangos puré enlatados)", "250-300ml / 9-10½ fl oz leche fría", "½-1 cucharadita de miel líquida, o al gusto, de acuerdo con el tamaño y la dulzura de los mangos", "cubitos de hielo, para servir"], "method": ["Coloque uno de los mangos en posición vertical con el extremo angosto hacia usted. Rebane las \"mejillas\" a cada lado de la piedra y corte éstas por la mitad a lo largo.", "Corte alrededor de la piedra para quitar tanta carne como sea posible, capturando todos los jugos corrientes en un tazón.", "Retire la piel pelando o cortando la fruta con cuidado. Repite con el otro mango. Deseche la piel y licúe la carne y el jugo en un procesador de alimentos o licuadora.", "Agregue la leche y la miel y combine hasta que se convierta en una masa lisa y espesa. Enfríe hasta que esté listo para beber. Agregue los cubitos de hielo y sirva directamente de la nevera. Un poco vale mucho, así que sirva en vasos pequeños."], "url": "www_bbc_co_uk_food_recipes_mangosmoothie_86438", "title": "Batido de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mangosmoothie_86438_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 mango maduro", "1 plátano maduro", "3 cucharadas colmadas de yogur al estilo griego", "300ml / 10½ fl oz de leche", "cubitos de hielo (opcional)"], "method": ["Mezcle todos los ingredientes en un procesador de alimentos hasta que esté suave y bien combinado.", "Para servir, vierta en dos vasos altos."], "url": "www_bbc_co_uk_food_recipes_mangosmoothie_92192", "title": "Batido de mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "2 cucharadas de azúcar en polvo", "55 g / 2 oz de mantequilla", "1 yema de huevo de gallinas camperas", "30g / 1oz de mantequilla", "1 cucharada de azúcar moreno", "½ mango, pelado y rebanado", "½ lima, solo jugo", "crema doble, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, coloque la harina, el azúcar y la mantequilla en un procesador de alimentos. Pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue la yema de huevo y el pulso hasta que la mezcla se una como masa.", "Convierta la masa en una superficie ligeramente enharinada y extiéndala para hacer una ronda ligeramente más grande que una sartén pequeña a prueba de horno.", "Para el relleno, caliente la mantequilla en una sartén pequeña a prueba de horno. Agregue el azúcar moreno y las rodajas de mango y freír hasta que el mango esté comenzando a caramelizar. Exprima el jugo de lima y elimine del fuego.", "Coloque la masa sobre el mango en la sartén y empuje hacia abajo alrededor de los bordes para sellar el relleno.", "Transfiera la sartén al horno y hornee por 12-15 minutos, o hasta que la masa esté dorada y crujiente.", "Con cuidado, gire la tarta en un plato para que el mango esté en la parte superior y corte en rodajas. Sirve con crema doble."], "url": "www_bbc_co_uk_food_recipes_mangotartetatin_87711", "title": "Mango tarte tatin", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mango", "½ chili, finamente picado", "½ cucharadita de especias mixtas", "1 cucharada de miel líquida"], "method": ["Precalentar la parrilla a alto.", "Entrecruza la carne del mango, luego gira la mitad del mango hacia dentro para hacer una forma de 'erizo'.", "Espolvorea sobre el chile picado, mezcla de especias y miel.", "Coloque el mango en una bandeja para hornear y colóquelo debajo de la parrilla durante 2-3 minutos.", "Para servir, coloca el mango en un plato."], "url": "www_bbc_co_uk_food_recipes_mangowithchilli_85020", "title": "Mango con chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]