[{"ingredients": ["4 pechugas de pollo deshuesadas y sin hueso bastante pequeñas (aproximadamente 600 g / 1 lb 5 oz)", "pimienta negra recién molida", "25 g / 1 oz de yogur natural bajo en grasa", "1 cucharada de aceite de girasol", "2 cebollas grandes, picadas (400 g / 14 oz de peso preparado)", "4 dientes de ajo, pelados y en rodajas", "Jengibre fresco de la raíz 20g / ¾oz, pelado y rallado fino", "12 vainas de cardamomo, semillas trituradas", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "½ cucharada de cúrcuma molida", "¼ cucharadita de chile en polvo", "1 hoja de laurel", "4 dientes enteros", "1 cucharada de harina normal", "pequeño azafrán", "2 cucharaditas de azúcar en polvo", "½ cucharadita de sal marina fina, más extra para sazonar", "3 cucharadas de crema doble", "cilantro fresco, toscamente desgarrado, para adornar (opcional)"], "method": ["Corte cada pechuga de pollo en ocho o nueve pedazos del tamaño de un bocado, sazone con pimienta negra y póngalos en un recipiente no metálico. Agregue el yogur, cubra con film transparente y deje enfriar por un mínimo de 30 minutos, pero idealmente de 2 a 6 horas.", "Caliente el aceite en una olla grande y antiadherente y agregue la cebolla, el ajo y el jengibre. Cubra y cocine a fuego lento durante 15 minutos hasta que estén muy suaves y ligeramente coloreados. Revuelva las cebollas de vez en cuando para que no comiencen a pegarse.", "Una vez que las cebollas estén blandas, mezcle las semillas de cardamomo trituradas, el comino, el cilantro, la cúrcuma, el chile en polvo y la hoja de laurel. Pellizca los extremos de los clavos en la sartén y tira los tallos. Cocine las especias con las cebollas durante cinco minutos, revolviendo constantemente.", "Agregue la harina, el azafrán, el azúcar y ½ cucharadita de sal, luego vierta lentamente 300 ml / ½ cucharadita de agua fría en la sartén, revolviendo constantemente.", "Llevar a fuego lento a fuego lento, luego cubrir y cocinar durante 10 minutos, revolviendo de vez en cuando.", "Retire la sartén del fuego, saque la hoja de laurel y mezcle la mezcla de cebolla con una batidora hasta que esté lo más suave posible. Puedes hacerlo en un procesador de alimentos si lo prefieres, pero deja que la mezcla se enfríe un poco primero.", "La salsa ahora puede usarse de inmediato o enfriarse, cubrirse y enfriarse hasta 10 minutos antes de servir.", "Escurra el pollo en un colador sobre el fregadero y sacúdalo un par de veces; desea que la carne tenga solo una ligera capa de yogur.", "Coloque una sartén antiadherente sobre el fuego, agregue la salsa y cocine a fuego lento.", "Agregue las piezas de pollo y la crema y cocine por unos 10 minutos o hasta que el pollo esté tierno y cocido, revolviendo regularmente. El tiempo exacto que toma el pollo dependerá del tamaño de las piezas, por lo tanto, verifique una pieza después de ocho minutos; no debe quedar ninguna rosa.", "Ajuste el condimento al gusto, ponga la cuchara en un plato para servir calentado y sirva adornado con cilantro fresco si lo desea."], "url": "www_bbc_co_uk_food_recipes_chicken_korma_16352", "title": "Curry de pollo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_korma_16352_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["270g / 9½oz de mantequilla sin sal", "2 pechugas de pollo deshuesadas, sin piel y alimentadas con maíz (aproximadamente 180 g / 6¼ oz cada una), cortadas en cubos de 2cm / ¾in", "2 limones, 1 solo para zumos y jugos, 1 entero", "2 cucharadas de yogurt griego", "2 cucharaditas de hojas de estragón finamente picadas", "1 puerro pequeño y joven, solo parte verde, cortado por la mitad a lo largo y en rodajas", "200g / 7oz de setas silvestres o shiitake mezcladas", "1 cucharada de aceite de girasol", "2 paquetes de 270 g de pasta de filo recién preparada", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de vinagre de jerez", "200ml / 7fl oz de caldo de pollo", "200ml / 7fl oz crema batida", "2 cabezas grandes de achicoria, cortadas a la mitad longitudinalmente y hojas separadas", "12 rábanos, en rodajas finas", "3 cucharadas de hojas de perejil picado", "1 cucharada de vinagre Chardonnay (alternativamente use vinagre de vino blanco)", "3 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida"], "method": ["Para los paquetes de pollo, primero aclare la mantequilla. Ponga 250 g / 9 oz de la mantequilla en una cacerola a fuego muy lento. Deja durante 30 minutos hasta que la mantequilla se haya derretido y los sólidos hayan caído al fondo. Retire del fuego y no moleste la sartén.", "Mezcle el pollo, la ralladura de limón y el jugo, el yogur y la mitad del estragón en un tazón. Cubra y marinado en la nevera durante 30 minutos.", "Ponga a hervir una olla con agua, agregue el puerro, vuelva a hervir y blanquee durante 1 minuto. Levante con una cuchara ranurada y revuelva en agua helada. Transfiera a un plato y seque con papel de cocina. Agregue los champiñones al agua hirviendo, blanquee durante 1 minuto, luego retírelos, renuévelos y séquelos.", "Caliente una sartén grande y antiadherente a fuego alto. Agregue la mantequilla restante y el aceite de girasol. Cuando la mantequilla esté espumosa, agregue los champiñones y fría por 2 minutos. Agregue el puerro y el pollo y fría por 2 minutos, o hasta que comience a colorear. Retire de la sartén y deje enfriar a temperatura ambiente. No lave la sartén, ya que la necesitará más adelante.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Corta el filo en 16 rectángulos de 16x22cm / 6¼x8½ pulgadas y cúbrelo con una toalla de té limpia y húmeda para evitar que se sequen. Para cada pastel de filo, trabajando rápidamente, pieza por pieza, coloque una hoja de filo en la superficie de trabajo y cepille ligeramente con mantequilla clarificada, luego ralle un poco de ralladura de limón del limón entero sobre la parte superior. Coloque una segunda hoja sobre la parte superior y cepille con mantequilla como antes, luego sazone con un poco de sal. Coloque otra hoja en la parte superior, cepille con mantequilla de nuevo y ralle sobre un poco de ralladura de limón. Termina con una cuarta hoja, luego un poco de pimienta.", "Batir el huevo y 1 cucharada de agua para hacer un lavado de huevos. Cepille los bordes de la masa con la colada de huevo, luego coloque una cuarta parte de la mezcla de pollo en la mitad inferior de la masa. Doble suavemente la masa sobre el relleno, presione los bordes y métalos para sellar y formar un pequeño paquete. Transfiera a una bandeja para hornear y refriégrela mientras hace las 3 parcelas restantes.", "Cepille la parte exterior de las parcelas terminadas con la mantequilla clarificada y hornee durante 20-25 minutos hasta que estén doradas y crujientes.", "Mientras tanto, para la ensalada de achicoria y rábano, mezcle las hojas de achicoria, los rábanos y el perejil en un bol. En un tazón pequeño, mezcle el vinagre y el aceite y sazone con sal y pimienta. Justo antes de servir, vierta el aderezo sobre las hojas y revuelva para cubrir.", "Regrese la sartén a fuego medio, agregue el vinagre de jerez y el glaseado agitando para eliminar cualquier trozo de caramelo pegado al fondo. Agregue el caldo y la crema, baje la temperatura a fuego lento y cocine a fuego lento durante 10-12 minutos hasta que el volumen del líquido se haya reducido a la mitad y la salsa sea lo suficientemente espesa para cubrir la parte posterior de la cuchara. Agregue el estragón restante y sazone con sal y pimienta, al gusto.", "Para servir, coloca la salsa sobre las parcelas y coloca la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_leek_and_wild_27527", "title": "Paquetes de pollo, puerro y setas silvestres con una ensalada de achicoria y rábano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 puerros, cortados a la mitad y en rodajas finas", "6 ramitas de tomillo frescas", "4 dientes de ajo, aplastados", "Paquete de 2 x 250 g de lentejas puy empacadas al vacío", "200g / 7oz de rábanos, cortados a la mitad", "4 pechugas de pollo de corral", "4 cucharaditas de mostaza", "Pan rallado panko de 40g / 1½ oz", "20g / ¾oz de perejil fresco de hoja plana, finamente picado", "1½ cucharadas de aceite de oliva", "300ml / 10fl oz de caldo de pollo caliente", "4 cucharadas de crema fresca", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque el puerro, el tomillo, el ajo, las lentejas y los rábanos en una lata para asar, revuelva para combinar y haga cuatro hendiduras en la mezcla. Coloque las pechugas de pollo en las hendiduras y cubra cada pecho con una cucharadita de mostaza.", "Mezcle las migas de pan, el perejil, el aceite de oliva y la sal marina en un tazón pequeño. Dispersar uniformemente sobre la mostaza en cada pechuga de pollo.", "Con cuidado, vierta el caldo en la lata, cubriendo las verduras y alrededor de las pechugas de pollo. Tenga cuidado de no obtener stock en las migas de pan.", "Asar durante 35-40 minutos, o hasta que el pollo esté bien cocido y las migas de pan crujientes y doradas. El pollo se cocina cuando los jugos salen limpios sin ningún rastro de color rosa cuando la parte más gruesa del pecho se perfora con un pincho. Deje reposar el plato durante 10 minutos.", "Agregue la crème fraîche y sazone con sal y pimienta. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_lentil_and_leek_58385", "title": "Pollo, lentejas y puerro horneado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_lentil_and_leek_58385_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "Hígados de pollo de 500 g / 1 lb 2oz, recortados", "1 diente de ajo, picado", "2 ramitas de tomillo, solo hojas", "3 cucharadas de vino de Madeira", "sal y pimienta negra recién molida", "200g / 7 oz de mantequilla clarificada", "2 cucharaditas de cebollino picado, para decorar", "50g / 1¾oz de mantequilla", "8 chalotes de plátano, pelados y cortados en anillos", "75g / 2½ oz de azúcar moreno oscuro", "2 ramitas de tomillo fresco, solo hojas", "200ml / 7fl oz de vinagre balsámico", "8 rebanadas de pan blanco, sin costras", "4 cucharadas de berro de albahaca"], "method": ["Para el parfait de hígado de pollo, forrar una lata de pan con film transparente.", "Caliente una cucharada de mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los hígados de pollo. Freír por 1-2 minutos o hasta que estén doradas.", "Agregue el ajo, el tomillo y Madeira. Freír los hígados de pollo en la mezcla durante 1-2 minutos más.", "Transfiera la mezcla a un procesador de alimentos, agregue la mantequilla restante y mezcle hasta obtener una pasta homogénea. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Con una cuchara, coloque la mezcla de parfait en la lata de hogaza, vierta sobre la mantequilla clarificada y cubra con la cebolleta. Enfríe en la nevera durante al menos tres horas o hasta que esté listo.", "Para la salsa picante de chalota, coloque la mantequilla en una sartén grande y caliente hasta que se derrita. Agregue los chalotes, cubra y cocine a fuego lento hasta que los chalotes se hayan suavizado y se hayan caramelizado.", "Agregue el azúcar, el tomillo y el vinagre y cocine por otros 10 minutos.", "Para la tostada Melba, precaliente la parrilla a su mejor configuración.", "Coloque cuatro de las rebanadas de pan en una bandeja para hornear y tueste durante 1-2 minutos en cada lado, o hasta que estén crujientes y doradas en ambos lados.", "Corta la tostada horizontalmente y devuelve la tostada a la bandeja para hornear, con los lados suaves hacia arriba. Grill durante 1-2 minutos, o hasta que estén crujientes y doradas.", "Repita el proceso con las cuatro rebanadas de pan restantes. Corte cada rebanada de tostada Melba en cuatro triángulos.", "Para servir, coloque una quenelle (o una rebanada) de parfait en cada una de las cuatro placas y sirva con la tostada chutney y melba. Adorne con berro de albahaca."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_29225", "title": "Parfait de hígado de pollo con salsa picante de chalota y melba", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hígados de pollo fresco de 400g / 14oz, de campo libre u orgánicos, tendones y vesículas biliares removidos", "500ml / 18fl de leche en oz", "4 cucharaditas de sal", "100 ml / 4 fl oz seco de Madeira", "100 ml / 4 fl oz oz ruby ​​port", "Chalotes de 60 g / 2½ oz, finamente picados", "2 ramitas de tomillo, solo hojas, finamente picadas", "1 diente de ajo, pelado y aplastado", "50ml / 2fl oz de coñac", "5 huevos medianos de granja", "400g / 14oz de mantequilla sin sal, derretida y mantenida caliente", "2 pizcas de pimienta negra recién molida", "75g / 3oz de mantequilla ablandada", "75g / 3oz de manteca ablandada"], "method": ["Remoje los hígados de pollo en la leche, 500 ml / 18 fl oz de agua y dos cucharaditas de sal en un plato poco profundo durante una hora. Esto extraerá la mayor parte de la sangre, lo que puede hacer que los hígados sean amargos, dando al parfait un sabor más delicado. Enjuague y drene bien los hígados.", "Precalentar el horno a 130 ° C / 270 ° F / Gas 1/2.", "Ponga el Madeira, el puerto, los chalotes, el tomillo, el ajo y el coñac en una cacerola pequeña y déjelos hervir. Deje que la mezcla burbujee hasta que se reduzca en un tercio y luego retire la sartén del fuego. La amargura del alcohol se habrá evaporado y los sabores de las hierbas se infundirán en el líquido.", "Coloque los hígados de pollo drenados y el contenido de la sartén en una licuadora o procesador de alimentos y procese, agregue un huevo a la vez, durante 3-4 minutos, o hasta que la textura esté suave como la seda.", "Poco a poco agregue la mantequilla derretida (si la agrega demasiado rápido, el parfait se puede dividir), la sal restante y la pimienta. Pruebe la mezcla y corrija el condimento si es necesario.", "Cubra la base y los lados de una lata de terrina de 23cm x 9cm x 8cm / 9in x 3½in x 3in con papel resistente a la grasa, dejando una superposición de 3cm / 1in sobre la parte superior de la lata. El papel protegerá el parfait del calor directo y evitará que se decolore y endurezca.", "Usando la parte posterior de un cucharón, presione la mezcla de parfait a través de un tamiz fino en un tazón grande y luego vierta en la lata de terrina y cúbralo con otro trozo de papel a prueba de grasa para caber.", "Coloque la terrina en una bandeja honda para hornear y vierta en agua hirviendo hasta que llegue a dos tercios del camino hasta los lados de la lata. Este método de cocción de baño María permite que el calor del horno penetre a través del agua y cocine el parfait muy suavemente para que se cueza de manera uniforme.", "Cubra la bandeja flojamente con una hoja de papel de aluminio perforado y colóquela en el horno. Verifique la temperatura del parfait con una sonda de temperatura después de 40 minutos: el parfait se cocina cuando el medio ha alcanzado 65C-70C / 150F-158F. No cocine demasiado o se dividirá y perderá su textura fina.", "Cuando el parfait esté cocido, retire la lata de terrina de la bandeja de hornear, deje que se enfríe durante 30 minutos a temperatura ambiente y luego refrigere.", "Deseche el papel resistente a la grasa de la parte superior del parfait y luego sumerja la lata en una bandeja profunda de agua caliente. Deslice un cuchillo caliente entre los lados de la lata y el forro a prueba de grasa, luego sostenga los bordes del forro y cuidadosamente levante el parfait de la lata sobre una tabla de cortar.", "Despegue el papel resistente a las grasas de los lados del postre helado. Caliente una espátula en agua caliente y alise la parte superior y los lados del parfait, eliminando cualquier decoloración en la parte superior. Regrese el parfait a la nevera por al menos 30 minutos para que se firme, o colóquelo en el congelador por 15 minutos.", "Para finalizar, bata la manteca y la manteca blandas juntas y extiende una fina capa sobre el parfait con una espátula.", "Alinee una bandeja de horno plana con una hoja de papel limpio y resistente a las grasas. Voltee el parfait en la bandeja y esparza la mezcla restante de mantequilla / manteca sobre los lados y lo que ahora se ha convertido en la parte superior. Cubrir todas las superficies del parfait con esta mezcla evitará que se oxide y decolore.", "Regrese el parfait a la nevera y deje enfriar por al menos un día antes de servir; dos días es ideal.", "Para servir, sumerja un cuchillo en agua caliente y corte el parfait en rodajas gruesas. Sirva con chutneys, encurtidos y pan de masa fermentada tostada, o extienda en crostini para servir como canapés. Red Burgundy es el vino perfecto."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_53623", "title": "Perfecto hígado de pollo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de Madeira", "1 cucharada de puerto", "1 chalote, picado", "1 cucharada de aguardiente", "tomillo de ramita", "1 diente de ajo, aplastado", "Hígados de pollo con 250 g / 9 oz (peso recortado)", "2 huevos de gallinas camperas", "250g / 9oz de mantequilla sin sal", "50 g / 2 oz de azúcar", "50ml / 2fl oz de vinagre de vino tinto", "2 remolachas frescas grandes, 1 en rodajas finas, 1 en jugo", "sal y pimienta", "pequeño manojo de menta fresca, hojas recogidas y en rodajas finas", "1 hoja de gelatina", "pan de masa fermentada, para servir"], "method": ["Precalentar el horno a 120C / 250F / Gas ½.", "Ponga el Madeira, el bacalao, el chalote, el brandy, el tomillo y el ajo en una sartén y cocine a fuego lento hasta que las cebollas estén blandas. Agregue los hígados de pollo y cocine por 2-3 minutos.", "Transfiera el hígado y su líquido de cocción a un procesador de alimentos y mezcle hasta que quede suave. Con el motor todavía en funcionamiento, agregue gradualmente los huevos y luego la mantequilla. Mezcle hasta que esté bien combinado y completamente liso. Pase el parfait a través de un colador fino en un recipiente.", "Divida el postre helado entre cuatro moldes. Coloque los moldes en una lata grande para asar y vierta agua hirviendo en la lata para alcanzar la mitad de los moldes. Cubra la lata con papel de aluminio y colóquela cuidadosamente en el horno durante 20-25 minutos.", "Mientras tanto, caliente el azúcar y el vinagre en una sartén hasta que el azúcar se disuelva. Agregue la remolacha finamente rebanada a la mezcla y cocine a fuego lento durante 1-2 minutos. Escurra el exceso de líquido y sazone al gusto con sal y pimienta negra recién molida. Mezcle con la menta finamente cortada y reserve.", "Una vez que los parfaits se hayan cocinado, retíralos del horno para enfriarlos.", "Remoje la hoja de gelatina en un tazón de agua fría hasta que esté suave, luego exprima el exceso de agua y agregue al jugo de remolacha 50ml / 1¾fl oz de agua hirviendo. Revuelva hasta que la gelatina se haya disuelto.", "Vierta la mezcla de gelatina sobre el parfait para formar una capa fina y refrigere hasta que se endurezca.", "Sirva con masa fermentada tostada y una cucharada de remolacha en escabeche."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_parfait_98548", "title": "Parfait de hígado de pollo con remolacha en escabeche y masa fermentada tostada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15g / ½ oz de mantequilla", "½ cebolla pequeña o una chalota, finamente picada", "1 ramita de tomillo fresco, hojas recogidas y finamente picadas", "Hígados de pollo a 400g / 14oz, más o menos picados", "1 cucharadita de pimienta blanca finamente molida", "3 bayas de pimienta de Jamaica molidas finamente (disponibles en línea y en algunos supermercados)", "50 ml / 2 fl oz de jerez o brandy", "sal al gusto"], "method": ["Derretir la mantequilla en una sartén. Cuando solo esté espumante, agregue la cebolla y el tomillo. Saltee hasta que la cebolla esté suave y translúcida, luego agregue los hígados de pollo y las especias.", "Suba el fuego y fría hasta que los hígados estén recién hechos, esto tomará entre 3 y 5 minutos. Para probar si el pollo está cocido, retire un trozo de hígado y córtelo para abrirlo; debe estar húmedo pero no con sangre, un poco de rosa está bien. Transfiera la mezcla a un recipiente y deje enfriar.", "Regrese la sartén al fuego y vierta el jerez. Permita que burbujee y reduzca a la mitad, revuelva y arrastre cualquier sedimento del fondo de la sartén a medida que avanza, retírela del fuego y déjela enfriar.", "Coloque la mezcla de pollo en un procesador de alimentos. Vierta el jerez reducido. Pulse el procesador de alimentos hasta que el paté esté liso. Para hacer el paté extra suave, pásalo por un tamiz grueso. Sazonar con sal al gusto.", "Coloque el paté en un plato de terrina o en una olla y deje enfriar en la nevera durante aproximadamente 2 horas. Si desea conservar el paté durante unos días, cúbralo con mantequilla clarificada."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_06158", "title": "Paté de hígado de pollo con pimienta de Jamaica", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_liver_pt_06158_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla fría, más extra para engrasar", "Hígados de pollo de 500 g / 1 lb 2oz, limpios", "1 cucharada de mejorana fresca o hojas de tomillo", "5 cucharadas de aguardiente", "75g / 3oz de ghee o mantequilla clarificada", "8 rebanadas de pan blanco, sin costras", "sal y pimienta negra recién molida", "200 g / 7 oz de azúcar morena suave", "2 chalotes, finamente picados", "Albaricoques secos de 90 g / 3¼ oz, finamente picados", "300ml / 10½fl oz de vinagre de sidra", "450 g / 1 libra de manzanas Bramley, peladas, sin corazón y picadas", "1 cucharadita de canela molida", "1 pizca de clavo de olor", "125g / 4½oz de mitades de nuez, aproximadamente picadas"], "method": ["Precaliente el horno a 230 ° C / 210 ° Ventilador / Gas 8. Engrase una terrina o lata de pan con mantequilla, luego alinee con 2 capas de película adhesiva, dejando un voladizo generoso en los bordes.", "Coloque los hígados de pollo en una sola capa en una bandeja grande para asar, espolvoree la mejorana o el tomillo y rocíe sobre el brandy. Sazone con sal y pimienta, luego tueste durante 4-5 minutos, o hasta que los hígados estén cocidos por fuera pero aún rosado en el centro.", "Transfiera el contenido de la bandeja de tostado a un procesador de alimentos y mezcle hasta obtener un puré fino con la mantequilla fría. Sazonar de nuevo, al gusto.", "Coloque la mezcla en la terrina preparada y alise la parte superior con una espátula. Cubra la parte superior con la película adhesiva que sobresale. Enfriar en la nevera durante 30 minutos, luego cubrir con la mantequilla clarificada y enfriar durante 2 horas más, hasta que se endurezca.", "Mientras tanto, para la salsa picante, caliente el azúcar en una sartén grande de base pesada a fuego medio, hasta que se derrita y caramelice, luego agregue los chalotes y los albaricoques. La mezcla se convertirá en grumos, pero mantenga la sartén en el fuego y continúe cocinando.", "Agregue el vinagre de sidra y cocine hasta que se incorpore a la mezcla, luego agregue las manzanas Bramley, canela y clavo de olor y cocine durante 10 minutos, revolviendo bien, hasta que las manzanas estén tiernas y la salsa picante se haya espesado.", "Retire la sartén del fuego y agregue las nueces, luego sazone, a gusto, con sal y pimienta. Transfiera a un frasco esterilizado y selle, o sirva inmediatamente.", "Justo antes de servir, prepare la tostada Melba. Precaliente la parrilla a fuego medio, tueste las rebanadas de pan hasta que queden doradas por ambos lados, luego corte cada rebanada de pan por la mitad horizontalmente para crear 2 rodajas más finas, con un lado tostado y otro tostado. Elimine cualquier exceso de masa del lado sin tostar; el objetivo es hacer las rodajas lo más delgadas posible para que cada miga se tueste bien. Cortar las rebanadas en triángulos y luego a la parrilla los lados sin tostar hasta que estén doradas.", "Para servir, pele la película adherida de la superficie del paté, levante la terrina en un plato, levante la terrina y retire la película adhesiva. Rebane y sirva con el chutney y Melba Brindis."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_04850", "title": "Paté de hígado de pollo con salsa picante de manzana y nueces", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Hígados de pollo de 500 g / 1 lb 2oz, recortados", "300 g / 10½ onzas de mantequilla", "75ml / 2½fl oz Madeira", "2 cucharadas de hojas de estragón fresco picado", "sal y pimienta negra recién molida", "1 hoja de laurel", "2 ramitas de tomillo fresco", "2 cebollino", "75ml / 2½fl oz de mantequilla clarificada", "1 cucharada de aceite de oliva", "1 pan de chapata, en rodajas finas", "1 cucharada de aceite vegetal", "2 chalotes, finamente cortados en cubitos", "1 cucharadita de romero fresco, finamente picado", "100 g / 3½ oz de sultanas", "50 g / 2oz de pasas", "Azúcar demerara 50 g / 2 oz", "200ml / 7fl oz de vinagre de sidra", "Jengibre cristalizado 50g / 2oz, finamente rebanado", "Higos secos de 325 g / 11½ onzas, cortados por la mitad", "½ cucharadita de nuez moscada fresca", "1 cucharadita de pimienta de Jamaica molida", "Ensalada de hojas mixtas de 150g / 5½ oz", "8 higos frescos, cortados en cuartos", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de sidra", "1 par de mostaza Dijon"], "method": ["Para el paté de hígado de pollo precaliente el horno a 200C / 400F / Gas 6.", "Coloque los hígados de pollo en una bandeja grande para tostar en una sola capa. Punto con 50 g / 2 oz de la mantequilla. Verter sobre el Madeira y espolvorear sobre las hojas de estragón. Asar en el horno durante 4 a 5 minutos, o hasta que los hígados estén cocidos por fuera pero rosados ​​por dentro.", "Mezcle los hígados de pollo en un procesador de alimentos con la mantequilla restante de 250 g / 9 oz para un puré suave.", "Sazonar con sal y pimienta negra recién molida, luego picar el paté en una lata de pan de 23 x 12 cm / 9 x 4½ pulgadas forrada con película adhesiva y alisar la parte superior con una espátula.", "Coloque la hoja de laurel, las ramitas de tomillo y el cebollino en la parte superior del paté, luego vierta sobre la mantequilla clarificada. Toque los lados del plato suavemente para asegurarse de que la superficie del paté esté uniformemente cubierta con mantequilla clarificada y que se liberen las burbujas de aire. Enfríe en la nevera durante dos horas o hasta que esté listo.", "Retire el paté de la nevera 20 minutos antes de servir.", "Para la salsa picante, caliente el aceite en una sartén mediana. Una vez caliente, agrega la chalota y fríela suavemente durante 2-3 minutos. Agregue el romero, la sultana, las pasas y el azúcar y fría hasta que la fruta comience a caramelizar. Agregue el resto de los ingredientes, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante 5-10 minutos.", "Para la ensalada, coloca las hojas y corta los higos en un tazón. Batir el aceite, el vinagre y la mostaza en un tazón pequeño para combinar.", "Para servir, caliente la parrilla hasta que esté caliente y rocíe el aceite sobre el pan. Tueste el pan por 1-2 minutos en cada lado.", "Retire el paté de la lata filmada y pele la película adhesiva.", "Toma dos cucharadas y dale forma al paté en una quenelle. Coloque el paté en el plato. Coloque la salsa picante al costado y la chapata al lado. Viste la ensalada y colócala en el plato."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_01703", "title": "Paté de hígado de pollo con higos, chutney y pan ciabatta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 hinojo pequeño, en rodajas finas", "1 cebolla roja, finamente rebanada", "12-15 hojas de menta fresca, finamente trituradas", "1 chile verde, finamente picado", "1 tomate, cortado en cuatro y rebanado", "½ lima, solo jugo", "1 cucharadita de vinagre de sidra", "sal al gusto", "1 mango, pelado, piedra removida, carne picada", "Hígados de pollo 225 g / 8 oz, recortados", "1 x 2.5cm / 1 en pieza de jengibre fresco, pelado y finamente picado", "5-6 dientes de ajo, pelados y finamente picados", "1 chile verde, finamente picado", "¼ cucharadita de cúrcuma", "½ cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ lima, solo jugo", "1-2 cucharadas de aceite de girasol", "2 cucharadas de cilantro fresco picado", "1 cucharada de menta fresca picada", "sal al gusto", "4 huevos medianos de granja", "1 cebolla roja mediana, finamente picada", "1-2 chiles verdes finos, finamente picados", "1 tomate, solo carne, finamente picado", "1 cucharada colmada de cilantro fresco finamente picado", "2 cucharadas de aceite", "1 cebolla marrón, en rodajas", "sal y pimienta negra recién molida"], "method": ["Para la ensalada de hinojo y cebolla roja, mezcle todos los ingredientes y déjelos a un lado hasta que estén listos para servir.", "Limpie los hígados de pollo, teniendo cuidado de eliminar todas las membranas. Córtalos en trozos pequeños y colócalos en un tazón.", "Mezcle el jengibre, el ajo, el chile, la cúrcuma, el comino, el cilantro y el jugo de lima con los hígados. Puede dejar esto a un lado en el refrigerador por unas horas si lo desea.", "Poner el aceite en una sartén de fondo grueso a fuego alto. Cuando el aceite comience a humear, agregue los hígados, extiéndalos y no agite la sartén. Después de unos segundos agite la sartén o revuélvalos, luego déjelos reposar de nuevo. (La sartén tiene que estar muy caliente para evitar que los hígados liberen demasiado líquido y pierdan su textura y sabor. Demasiada agitación introduce aire más frío en la base de la sartén, por lo que se enfría). Si la sartén permanece lo suficientemente caliente los hígados se cocinarán en 2 minutos. Para verificar que los hígados estén cocidos, retire un trozo de hígado de la sartén y córtelo; debe estar húmedo pero no más sangriento (un poco de rosa está bien).", "Sazonar, al gusto, con sal. Mezcle la mitad del cilantro y la menta (reserve el resto para la guarnición). Inmediatamente transfiéralo a un colador colocado sobre un recipiente para evitar cualquier cocción adicional y para evitar que la tortilla se empape de los jugos del hígado.", "Para la tortilla especiada, rompe los huevos en un bol y bate. Agregue la cebolla roja, los chiles, los tomates y el cilantro. Sazonar con sal y pimienta y batir nuevamente.", "Calienta dos sartenes pequeñas y agrega una cucharada de aceite a cada una. Cuando el aceite esté caliente, agregue la mitad de la mezcla de huevo a cada bandeja. Cocine hasta que se dore por un lado y se cueza bien. Retire del fuego. Divida la mezcla de hígado entre las dos tortillas, espolvoree la cebolla rebanada en la parte superior y adorne con el cilantro reservado y la menta. Enrolle las tortillas.", "Cortar las tortillas en dos y servir con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_livers_wrapped_23520", "title": "Hígados de pollo envueltos en una tortilla especiada con ensalada de hinojo y cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 remolachas enteras, más o menos picadas", "100ml / 3½fl oz de vinagre de vino tinto", "25 g / 1 oz de azúcar", "sal y pimienta negra recién molida", "2 hojas de gelatina, empapadas en agua fría durante 10 minutos", "4 chalotes, en rodajas finas", "100ml / 3½fl oz de brandy", "100 ml / 3½ fl oz en Madeira", "Puerto de 100 ml / 3½ fl oz", "ramita de tomillo fresco", "1 hoja de laurel", "1 diente de ajo, rallado", "Hígados de pollo de 500 g / 1 lb 2 oz, a temperatura ambiente", "4 huevos de gallinas camperas, a temperatura ambiente", "300g / 10½oz de mantequilla, derretida", "3 patas de pollo, escalfadas durante 20 minutos en caldo de pollo", "6 bebe remolachas doradas, cocidas y peladas"], "method": ["Precalentar el horno a 100 ° C / 225 ° F / Gas ¼.", "Para hacer la gelatina de remolacha, en un procesador de alimentos mezcle la remolacha, el vinagre de vino tinto y el azúcar para hacer un puré. Sazone al gusto con sal y pimienta negra recién molida.", "Alinee un tamiz con muselina y colóquelo sobre un recipiente. Vierta el puré de remolacha en el tamiz y déjelo a un lado para permitir que el jugo entre en el bol.", "Caliente el jugo de remolacha y luego exprima el exceso de agua de la gelatina empapada antes de agregarlos al jugo de remolacha. Revuelva para disolver. Dejar de lado para enfriar, pero no establecer.", "Para hacer el paté, en una sartén combine las chalotas, todo el alcohol, el tomillo, la hoja de laurel y el ajo. Llevar a ebullición y hervir a fuego lento hasta que el líquido se haya evaporado.", "Retire el tomillo y la hoja de laurel y luego colóquelo en una licuadora. Agregue los hígados de pollo y el pulso.", "Poco a poco agregue los huevos seguidos de la mantequilla. Sazonar con sal y pimienta negra recién molida y luego pasar por un chino. Divida la mezcla entre seis frascos esterilizados, llenándolos dos tercios llenos.", "Coloque las jarras en un plato a prueba de horno con un paño debajo. Llene el plato con agua hirviendo hasta la mitad del lado de los frascos. Coloque el plato en el horno durante 30 minutos.", "Retire los frascos del horno y transfiéralo a la nevera para enfriar. Aumente la temperatura del horno a 180C / 350F / Gas 4.", "Para la guarnición, quite la piel de pollo de las patas. Coloque la piel entre dos bandejas para hornear y hornéelas en el horno por 25 minutos o hasta que estén crujientes.", "Cuando el paté esté firme, vierta cuidadosamente una capa delgada de gelatina en la parte superior (aproximadamente 5 mm / ¼ de profundidad). Vuelve a la nevera para poner.", "Para servir, divide a la mitad la remolacha dorada y coloca cuidadosamente sobre la gelatina. Coloque la piel de pollo en el lado."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_78899", "title": "Paté de hígado de pollo con gelatina de remolacha", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Hígados de pollo de 450 g / 1 lb (empapados durante la noche en leche para eliminar el amargor)", "1 diente de ajo, rallado", "2 cucharadas de jalea de grosella roja, derretida en una sartén a fuego lento", "150ml / ¼ litro de caldo de pollo, calentado", "sal y pimienta negra recién molida", "pizca de nuez moscada recién rallada", "2 huevos de gallinas camperas, golpeados", "570ml / 1 pinta de crema doble", "¼ de pinta madeira", "1 cucharada de caldo de pollo", "2 hojas de gelatina, suavizadas en agua fría durante 10 minutos", "3 huevos de codorniz", "1 mandarina, segmentada"], "method": ["Precaliente el horno a 150C / 300F / Gas 2. Engrase un molde de terrina de 25x25x7.5cm / 10x10x3 en una lata de pan con mantequilla y enlínea con papel de alta calidad a prueba de grasa.", "Escurra los hígados de pollo y colóquelos en el tazón de un procesador de alimentos, junto con el ajo y la jalea de grosella. Vierte el caldo, la sal, la pimienta y la nuez moscada, luego licúa hasta que quede suave.", "Cuando la mezcla esté realmente suave, agregue los huevos batidos y la crema doble. Sazone con un poco de nuez moscada rallada y mucha sal y pimienta.", "Empuje la mezcla a través de un tamiz fino en una jarra y luego vierta en el molde de terrina engrasado y alineado. Cubra la parte superior con papel resistente a la grasa. Coloque la terrina en una bandeja para asar medio llena de agua hirviendo. Colóquelo en el centro del horno y cocínelo durante aproximadamente una hora, o hasta que el paté parezca recién puesto. Retire del horno y deje enfriar antes de colocarlo en el refrigerador hasta que esté listo para servir.", "Mientras tanto, para la gelatina de Madeira, pon la madeira en una cacerola y calienta para reducir el volumen en dos tercios. Agregue el caldo de pollo y las hojas de gelatina suavizadas al líquido madeira caliente y luego déjelo enfriar.", "Para servir, hierva los huevos de codorniz. Coloque los segmentos de mandarina y los huevos de codorniz a la mitad sobre el paté y luego vierta sobre la gelatina."], "url": "www_bbc_co_uk_food_recipes_chicken_liver_pt_with_49398", "title": "Paté de hígado de pollo con gelatina de Madeira", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo mediano, unido en 8 piezas", "1 cucharadita de harina común", "75 g / 2½ oz de mantequilla", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "5 cucharadas de Madeira", "500ml / 18fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "4 ramitas de tomillo fresco, solo hojas, picadas", "250 g / 9 oz de champiñones castaños, cortados en cuartos", "100g / 3½oz de champiñones, limpios", "2 cucharadas de perejil fresco de flatleaf", "sal marina y pimienta negra recién molida", "1kg / 2lb 4oz de papas harinosas, como King Edward, peladas y cortadas en trozos", "150 g / 5½ oz de mantequilla", "150ml / 5fl oz de crema doble"], "method": ["Para la cazuela, condimente los trozos de pollo con sal y pimienta negra recién molida, y luego séquelos en la harina para cubrirlos.", "Calienta dos tercios de la mantequilla en una sartén a fuego medio. Cuando haga espuma, agregue las piezas de pollo, en lotes si es necesario, y fríe durante 2-3 minutos, o hasta que estén doradas en cada lado. (No sobrecargue la sartén). Retire las piezas de pollo de la sartén y transfiéralas a una cazuela o una cacerola grande de base pesada.", "Coloque la cazuela a fuego medio. Agregue la cebolla, ajo, Madeira, caldo de pollo, crema y tomillo, revuelva bien y ponga la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento de 12 a 15 minutos.", "Agregue las setas y continúe cocinando a fuego lento por otros 12-15 minutos, o hasta que las piezas de pollo estén cocidas y la salsa se haya espesado un poco. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un cuchillo, y no queda ningún resto de color rosa.) Sazonar, al gusto, con sal y pimienta negra recién molida, luego incorporar la mantequilla restante y el perejil.", "Mientras tanto, para el puré, hierva las papas en una sartén con agua con sal, luego reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que estén tiernas. Escurrir bien y volver a la sartén, luego colocar a fuego lento durante un par de minutos para secarlos ligeramente.", "Mash o arroz las patatas hasta que esté suave, luego agregue la mantequilla y la crema hasta que esté suave y bien combinado, y sazone al gusto.", "Sirva la cazuela con una cucharada de puré."], "url": "www_bbc_co_uk_food_recipes_chicken_madeira_and_30640", "title": "Cazuela de pollo, madeira y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo picado 200 g / 7 oz", "1 hoja de lima, triturada", "1 tallo de limoncillo, hojas externas duras descartadas, centro interior blando finamente picado", "1 cucharada colmada de harina de maíz", "1 cucharada de aceite vegetal", "1 litro / 1¾ pintas de caldo de pollo", "1 cucharada de salsa de pescado tailandés (nam pla)", "Anís de 2 estrellas", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado y rebanado fino", "50g / 2oz de huevo fino o fideos de arroz", "4 cebollas de primavera, en rodajas finas", "1 guindilla roja, en rodajas, más extra para decorar", "8 hojas de albahaca tailandesa, picadas", "aceite de sésamo tostado, al gusto", "salsa de soja, al gusto", "1 cilantro fresco de racimo pequeño, picado", "pequeñas hojas de menta picadas, picadas", "1 lima, solo jugo"], "method": ["Para las albóndigas, mezcle todos los ingredientes de la albóndiga, aparte del aceite, en un tazón grande y luego dé forma a la mezcla en pequeñas bolas del tamaño de una nuez. Caliente el aceite en una sartén grande a fuego medio y fría las albóndigas durante 4-5 minutos, volteándolas regularmente, o hasta que se doren por todas partes.", "Para el caldo, ponga el caldo a hervir en un wok o una sartén grande, luego agregue la salsa de pescado, el anís estrellado y el jengibre y baje la temperatura a fuego lento. Agregue los fideos y cocine por un minuto, luego agregue las cebolletas, el chile y las albóndigas de pollo doradas. Cocine a fuego lento durante 2-3 minutos, o hasta que las albóndigas estén completamente cocidas.", "Agregue la albahaca tailandesa y agregue el aceite de sésamo y la salsa de soja, al gusto.", "Para servir, transfiera los fideos a dos tazones calientes usando pinzas. Coloque las albóndigas encima y vierta sobre el caldo. Adorne con el cilantro picado y la menta, las rodajas de chile y un chorrito de lima."], "url": "www_bbc_co_uk_food_recipes_chicken_meatballs_in_27036", "title": "Albóndigas de pollo en caldo de fideos de estilo asiático", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla pequeña, finamente picada", "2 dientes de ajo, triturados o rallados", "Pollo picado de 750 g / 1 lb 19 oz", "50g / 1¾oz de tocino, finamente picado", "1 cucharadita de orégano molido", "1 cucharadita de ralladura de limón", "1 cucharadita de mostaza Dijon", "1 cucharadita de salsa Worcestershire", "Crema doble 50ml / 2fl oz", "100g / 3½oz de pan rallado", "2 claras de huevo de gallinas camperas", "Gruyère 100 g / 3½ oz, rallado", "5 rebanadas de tocino rayado sin corteza", "100 ml / 3½ fl oz de ketchup", "1 cucharadita de salsa Worcestershire", "1 cucharada de mostaza Dijon", "1 cucharada de jarabe de arce", "1 cucharada de vinagre de sidra"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Calentar el aceite de oliva en una sartén. Agregue la cebolla y saltee durante unos minutos hasta que esté suave y empiece a tomar un poco de color. Agregue el ajo y cocine por un minuto más. Retirar del fuego y dejar enfriar.", "Ponga el pollo en un tazón grande y sazone con sal y pimienta. Agregue el tocino picado, orégano, ralladura, mostaza, crema y pan rallado, seguido de la cebolla y el ajo enfriados. Agregue el huevo y mezcle todo a fondo.", "Toma un trocito de la mezcla y fríalo. Pruebe y ajuste el condimento y cualquier otro sabor en consecuencia.", "Para el glaseado, coloque todos los ingredientes en una cacerola y sazone con sal y pimienta. Caliéntelo suavemente y déjelo a un lado.", "Tome la mitad de la mezcla de pollo y mézclela en una bandeja para hornear, usando el tamaño de una bandeja de pan como guía y haciéndola lo más uniforme posible. Coloque el queso en el centro, asegurándose de dejar un borde en toda su extensión, luego cubra con la mezcla de pollo restante, apretándola alrededor de los lados y asegurándose de que esté bien sellada, ya que no quiere que el queso se filtre. Deberías terminar con un pan ligeramente abovedado. Cepille algunos de los vidriados.", "Corta las rebanadas de tocino por la mitad y estíralas con la parte trasera de un cuchillo. Cada rebanada debe llegar desde la base de un lado, arriba y abajo del otro lado. Cepíllese con un poco más del esmalte.", "Hornee por 30 minutos, luego quite y cepille con el glaseado restante. Hornee durante otros 30 minutos, momento en el cual el pastel de carne se debe cocinar con tocino bien crujiente. Servir en rodajas gruesas."], "url": "www_bbc_co_uk_food_recipes_chicken_meatloaf_53803", "title": "Pastel de carne de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5½oz de frijoles borlotti", "1 cebolla", "1 palo de apio", "½ cabeza de ajo, clavos divididos y pelados", "3 ramitas de tomillo", "2 pechugas de pollo, con mariposa (cortadas en el centro y abiertas en plano)", "Harina normal de 100 g / 3½ oz", "1 yema de huevo de gallinas camperas, golpeada", "Pan rallado de 100 g / 3½ oz panko", "2 cucharadas de aceite de oliva", "75 g / 2¾oz de mantequilla sin sal, cortada en cubitos", "1 cucharada de ajedrea fresca cortada en trozos", "¼ limón, solo jugo", "sal marina y pimienta negra recién molida", "½ manojo de perejil fresco de flatleaf", "½ manojo de menta fresca", "½ grupo de cebolletas frescas", "125ml / 4fl oz de aceite de oliva virgen extra", "1 cucharadita de alcaparras", "2 anchoas", "½ limón, solo jugo"], "method": ["Para los frijoles, ponga todos los ingredientes en una cacerola y cocine a fuego medio durante 10-15 minutos, o hasta que los frijoles estén tiernos. Dejar enfriar en el licor de cocción y luego escurrir los frijoles, descartando los vegetales, las hierbas y el ajo. Dejar de lado.", "Para la milanesa de pollo, coloque una capa doble de película adhesiva y coloque una pechuga de pollo en la parte superior, con el lado cortado hacia arriba. Coloque otra capa doble de película adhesiva sobre el pollo. Aplanar el pollo de manera uniforme con un bate de carne especializado o la parte posterior de una sartén hasta que tenga aproximadamente 1 cm / ½ pulgada de grosor. Repita con el otro seno. Coloque la harina en un plato y sazone con sal y pimienta. Pon el huevo en un bol y las migas de pan en un plato aparte. Dragar las pechugas de pollo en la harina, seguido por el huevo y luego las migas de pan. Asegúrese de que los senos estén completamente cubiertos y sazone con sal y pimienta.", "Calentar el aceite en una sartén grande y antiadherente y freír el pollo durante 5-7 minutos por cada lado, hasta que esté dorado y cocido sin dejar rastros de color rosa. Agregue la mantequilla y el ajedrea a la sartén y cocine hasta que haga espuma, mientras hilvana el pollo. El ajedrea debe crujir ligeramente. Retire el pollo y la ajedrea usando una cuchara con ranura y transfiéralo al papel de cocina para drenar. Exprime el jugo de limón.", "Para la salsa verde, coloca las hierbas, el aceite, las alcaparras y las anchoas en una licuadora. Blitz a un puré áspero y luego sazone con la sal, la pimienta y el jugo de limón.", "Coloque el pollo en platos calientes y póngalo sobre la parte superior. Adorne con la salsa crujiente y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_milanese_with_29631", "title": "Pollo a la milanesa con frijoles y salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 mulatos o chiles anchos (aproximadamente 200 g / 7 oz), limpios, semillas retiradas y retenidas", "4 chiles pasilla, limpios, semillas retiradas y retenidas", "Baguette rancio 30g / 1oz o pan blanco (aproximadamente 1 rebanada)", "50 g / 1¾oz de semillas de sésamo", "120 g / 4½ oz de almendras blanqueadas", "1 cucharada de semillas de cilantro", "6 granos de pimienta negra", "5cm / 2in canela en rama", "4 cucharadas de aceite de maíz", "1 plátano maduro pequeño o plátano verde, pelado y rebanado grueso", "130 g / 4¾oz pasas o pasas de Corinto", "1 cebolla, finamente rebanada", "1 diente de ajo, aproximadamente picado", "pellizcar clavos de tierra", "1 cucharadita de orégano", "1 litro / 1¾ pintas de caldo de pollo", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20 (70% E2% 80% 9385 %% 20cocoa% 20solids),% 20roughly% 20chopped", "4-5 pechugas de pollo sin piel", "2 cucharadas de semillas de sésamo", "sal", "puñado de hojas de lechuga", "4 tortillas de maíz, calentadas"], "method": ["Tueste los chiles en una sartén a fuego alto durante unos 20 segundos hasta que estén fragantes pero no quemados. Colóquelos en un recipiente y cúbralos con agua hirviendo durante 20 minutos. Escurrir y apartar.", "Coloque la misma sartén a fuego medio y tueste el pan, 1 cucharadita de las semillas de ají reservadas, semillas de sésamo, almendras, semillas de cilantro, granos de pimienta y canela hasta que estén fragantes, pero no quemadas. Déjelos a un lado y mezcle hasta obtener un polvo cuando esté frío.", "Caliente 2 cucharadas de aceite de maíz en una sartén por separado y fría el plátano (o plátano). Agregue las pasas (o grosellas), las cebollas y el ajo y fría hasta que estén suaves y dulces. Incline a un procesador de alimentos con los chiles drenados, las especias en polvo, el clavo, el orégano y 350 ml / 12 fl oz del caldo de pollo. Mezcle en una salsa suave.", "Vierta la salsa en una olla limpia con el caldo restante y el chocolate. Caliéntelo suavemente durante 15-20 minutos hasta que el chocolate se haya derretido y la salsa se asemeje a una \"salsa\" espesa y oscura. No permita que hierva. Si la mezcla es demasiado espesa, agregue un chorrito de agua. Pruebe el condimento y agregue un poco de sal si es necesario.", "Cubra las pechugas de pollo con las 2 cucharadas restantes de aceite de maíz y sazone con sal. Coloque en una sartén a fuego medio y dore en ambos lados. Reduzca el fuego y continúe cocinando por 10-15 minutos hasta que esté cocido y los jugos estén limpios.", "Mientras tanto, tuesta las semillas de sésamo en una sartén seca hasta que estén doradas.", "Cortar las pechugas de pollo en diagonal y servir un pecho por persona, con la salsa con cuchara. Espolvorear con semillas de sésamo tostadas."], "url": "www_bbc_co_uk_food_recipes_chicken_mole_55992", "title": "Pollo mole poblano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_mole_55992_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite en aerosol bajo en calorías", "Jengibre fresco de la raíz de los 5cm / 2in, tajado", "3 dientes de ajo, aplastados", "pizca de chiles triturados", "3 cucharadas de pasta de miso", "2 cucharadas de jugo de lima", "Fideos de huevo finos de 200g / 7oz", "2 pechugas de pollo, 125 g / 4½ oz cada una, en rodajas finas", "125 g / 4½ oz de champiñones shiitake, en rodajas", "70 g / 2½ oz de maíz dulce, picado", "200g / 7oz de guisantes azucarados, cortados a la mitad", "85g / 3oz de berro, tallos resistentes eliminados", "salsa de soja, para servir"], "method": ["Rocíe una olla grande con aceite y caliente a fuego medio. Agregue el jengibre, el ajo y los chiles y saltee durante 1 minuto.", "Agregue 1,7 litros / 3 pintas de agua hirviendo y deje hervir a fuego lento. Agregue la pasta de miso, el jugo de lima y los fideos y cocine durante 1 minuto. Cubra y reserve.", "Rocíe un wok grande o una sartén con aceite y saltee el pollo, los champiñones y el maíz dulce por 2-3 minutos. Agregue los guisantes y cocine por 2 minutos, o hasta que el pollo esté bien cocido.", "Transfiera la sopa a 4 tazones, espolvoree las verduras y el pollo. Cubra con berros y sirva con salsa de soja en el lado."], "url": "www_bbc_co_uk_food_recipes_chicken_noodle_miso_soup_29043", "title": "Sopa de miso de fideos con pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_noodle_miso_soup_29043_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["70 g / 2½ oz de fideos de huevo medianos", "50 g / 1¾oz de frijoles de soja congelados o guisantes congelados", "1 zanahoria, pelada", "½ pimiento rojo pequeño, sin semillas, en rodajas", "Mangetout de 75g / 2¾oz, recortado y reducido a la mitad a lo largo", "1 pechuga de pollo cocida sin piel y sin piel (alrededor de 125 g / 4½ oz)", "4 cebolletas, cortadas y finamente cortadas", "1 guindilla roja larga, finamente cortada (sin semillas si se prefiere)", "15g / ½ oz de hojas frescas de cilantro", "10 g / ⅓oz de hojas de menta fresca", "Anacardos asados ​​15g / ½oz, más o menos picados", "3 cucharadas de agua", "3 cucharaditas de azúcar en polvo", "½-1 cucharadita de hojuelas de chile seco, al gusto", "4 cucharaditas de salsa de soja oscura", "1 cucharadita de aceite de sésamo tostado"], "method": ["Para hacer el aderezo, coloque el agua, el azúcar y las hojuelas de chile en una cacerola pequeña a fuego lento y caliente hasta que el azúcar se disuelva. Llevar a ebullición y cocinar durante 30 segundos, revolviendo. Quite el fuego y agregue la salsa de soja y el aceite de sésamo. Deja enfriar.", "Llene a la mitad una olla con agua y deje que hierva. Agregue los fideos y cocine durante 3-4 minutos, o de acuerdo con las instrucciones del paquete, hasta que estén tiernos. Revuelva ocasionalmente para separar los hilos. Agregue los frijoles de soja o los guisantes a los fideos, revuelva bien y luego drene inmediatamente en un colador. Enjuague los fideos y los frijoles con agua fría hasta que la mezcla esté completamente fría. Incline en un tazón grande.", "Con cuidado, pele la zanahoria en cintas largas y anchas o córtela en tiras largas y delgadas. Agregue la zanahoria, la pimienta y el mangetout a la ensalada de fideos. Cortar el pollo en rodajas finas y colocar en el recipiente.", "Vierta el aderezo en el recipiente y revuelva para que todo esté bien mezclado. Agregue las cebolletas, el chile rojo, las hierbas frescas y las nueces al bol y mezcle ligeramente antes de servir."], "url": "www_bbc_co_uk_food_recipes_chicken_noodle_salad_67466", "title": "Ensalada de fideos con pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_noodle_salad_67466_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 yemas de huevo de gallinas camperas", "1 cucharada de vinagre de vino blanco", "1 cucharada de mostaza Dijon", "1 limón, solo jugo", "10 filetes de anchoa con sal", "1 cucharada de pimentón ahumado", "500ml / 18fl oz de aceite vegetal", "aceite vegetal o de girasol, para freír", "Harina de sémola de 200g / 7oz, más extra para quitar el polvo", "Harina de tapioca 100g / 3½ oz (disponible en línea o de especialistas en alimentos saludables)", "½ cucharadita de bicarbonato de soda", "330 ml / 11 fl oz de agua con gas", "4 pechugas de pollo sin piel, cortadas en trozos del tamaño de una pepita", "pizca de cayena", "pellizcar copos de sal marina"], "method": ["Para la mayonesa, mezcle las yemas de huevo, el vinagre de vino blanco, la mostaza de Dijon, el jugo de limón, los filetes de anchoa y el pimentón en una pasta lisa en un procesador de alimentos.", "Con el motor todavía en funcionamiento, agregue gradualmente el aceite en una corriente delgada, hasta que la mezcla espese hasta obtener una mayonesa suave.", "Para los nuggets de pollo, caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un tazón grande, mezcle las harinas y el bicarbonato de soda.", "Poco a poco vierta el agua con gas en una corriente delgada, batiendo bien hasta que la mezcla se una como una masa suelta y suave.", "Espolvorea un poco de harina de sémola en un plato. Espolvorea las piezas de pollo en la harina y luego sumérgelas en la masa.", "Con cuidado, baje las pepitas de pollo en el aceite caliente, en tandas si es necesario, y freír hasta que la masa se ponga crujiente y dorada, y las pepitas floten en la superficie del aceite (aproximadamente 3-4 minutos). Retire del aceite con una espumadera y déjelo a un lado para drenar el papel de cocina. Justo antes de servir, espolvorea los nuggets de pollo con pimienta de cayena y espolvorea sobre los copos de sal marina.", "Para servir, coloque cantidades iguales de nuggets de pollo en recipientes para servir con una cucharada de mayonesa al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_nuggets_with_43012", "title": "Nuggets de pollo con pimentón ahumado y anchoa de mayo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 12-16", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_nuggets_with_43012_16x9.jpg", "isVegetarian": false, "recommendations": 0}]