[{"ingredients": ["3 cucharadas de aceite de oliva", "1 limón, solo jugo", "2 cucharadas de perejil fresco picado", "2 cucharadas de albahaca fresca picada", "2 cucharadas de cebolletas frescas picadas", "3 langostinos tigre, pelados y desvelados, cabezas y colas dejados en", "1 espinaca bebé puñado", "1 pimiento rojo", "3 cucharadas de aceite de oliva", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Remoje un pincho de madera en agua fría durante diez minutos.", "Para las gambas, mezcle el aceite de oliva, el jugo de limón y las hierbas en un bol y agregue las gambas. Revuelva para cubrir, luego déjelo marinar durante 5-10 minutos.", "Ensarte las gambas en el pincho y cocine en un molde caliente durante 1-2 minutos en ambos lados, o hasta que las gambas estén rosadas y cocidas.", "Para la ensalada, coloque la espinaca en el centro de un plato para servir.", "Para el aderezo de pimiento rojo, coloque el pimiento rojo debajo de la configuración más alta de la unidad de grill. Gire de vez en cuando, hasta que se ennegrezca por completo. Deje que se enfríe antes de despegar la piel, luego corte la carne y colóquela en un procesador de alimentos junto con los ingredientes restantes del aderezo. Mezclar hasta que esté suave.", "Para servir, coloca el pincho de gambas sobre la espinaca y coloca el aderezo alrededor de los bordes del plato."], "url": "www_bbc_co_uk_food_recipes_grilledtigerprawnsan_90111", "title": "Ensalada de espinacas y gambas tigre a la plancha con aderezo de pimiento rojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14¼oz de queso halloumi, cortado en trozos", "1 pimiento rojo, sin semillas, cortado en trozos", "1 pimiento verde, sin semillas, cortado en trozos", "1 pimiento amarillo, sin semillas, cortado en trozos", "1 cebolla roja, cortada en cuñas", "1 calabacín, cortado en trozos", "2 cucharadas de aceite de oliva", "½ manojo de perejil fresco", "½ manojo de estragón fresco", "½ manojo de perifollo fresco", "2 cucharadas de alcaparras, escurridas", "2 dientes de ajo, picados", "150ml / 5¼fl oz de aceite de oliva", "hojas de ensalada mixta"], "method": ["Para los pinchos, ensarta trozos alternos de halloumi, pimiento, cebolla y calabacín en ocho pinchos de madera. Cepille con aceite de oliva y caliente una sartén hasta que fume. Cocine los pinchos en la plancha caliente durante unos dos minutos en cada lado.", "Para la salsa verde, coloca el perejil, el estragón, el perifollo, las alcaparras, el ajo y el aceite de oliva en un pequeño procesador de alimentos. Mezclar hasta que esté suave.", "Coloque dos pinchos por persona en cada uno de los cuatro platos. Rocíe parte de la salsa verde en cada uno y sirva con hojas de ensalada mixtas."], "url": "www_bbc_co_uk_food_recipes_grilledvegetableswit_91417", "title": "Brochetas de vegetales y halloumi a la plancha con salsa caliente verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 grouse, preparado y envuelto en tocino", "1 cucharada de aceite vegetal", "50 g / 2 oz de apionabos, picados en dados de 1 cm / ½ pulgadas", "50 g / 2 oz de zanahorias, picadas en dados de 1 cm / ½ pulgadas", "50g / 2oz de apio, picado en dados de 1cm / ½in", "10 cebollas bebé", "2 ramitas de tomillo fresco", "1 cucharada de aguardiente", "250ml / 9fl oz de caldo de pollo", "sal marina y pimienta negra recién molida", "2 remolachas, peladas y cortadas en cuartos", "sal marina y pimienta negra recién molida", "4 alcachofas de Jerusalén", "½ limón, solo jugo", "1 kg / 2lb 2 oz de calabaza, pelada, sin semillas", "aceite de oliva, para freír", "Avellanas 50g / 2oz, aproximadamente picadas", "2 chalotes, finamente picados", "1 cucharada de cebollino picado", "50 ml / 2 fl oz de aceite de avellana", "1 cucharadita de vinagre de Jerez, o al gusto", "puñado de ramitas de berro"], "method": ["Saque el urogallo de la nevera para que puedan alcanzar la temperatura ambiente antes de comenzar a cocinar.", "Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite vegetal en una lata grande para asar de fondo pesado. Sazonar bien el urogallo, por dentro y por fuera, luego dorarlos en la lata hasta que estén dorados por todas partes.", "Agregue los vegetales cortados en cubitos, cebollines y ramitas de tomillo a la lata.", "Coloque el urogallo en un pecho y tueste en el horno caliente durante 3-4 minutos.", "Voltee las aves sobre el otro pecho y tueste por otros tres minutos.", "Vierta brandy en la cavidad de ambos pájaros y colóquelos sobre su espalda para terminar de tostar, otros cinco minutos.", "Retire la lata del horno y deje que el urogallo repose durante 10 minutos, sacándolo de la lata, hacia arriba para que los jugos se distribuyan uniformemente. Retire las verduras con una cuchara ranurada para un uso posterior, y aparte todos los jugos de la sartén.", "Vuelva a colocar la lata de asar sobre el fuego en la parte superior de la estufa y comience a reducir los jugos de cocción.", "Agregue el caldo de pollo, lleve a ebullición y deje que la salsa se reduzca y espese.", "Quítese el fuego y pase a través de un colador fino; manténgalo caliente hasta que esté listo para servir.", "Para las verduras asadas, caliente el horno a 180 ° C / 350 ° F / Gas 4.", "Coloque los cuartos de remolacha en una olla y vierta suficiente agua para cubrir. Agregar sal y llevar a ebullición.", "Cocine a fuego lento durante 30 minutos o hasta que la remolacha esté casi cocinada. Escurrir y apartar.", "Mientras tanto, pele las alcachofas de Jerusalén, córtelas por la mitad y sumérjalas en un tazón de agua fría con el jugo de limón agregado para evitar que se decoloren.", "Corta la calabaza en rodajas gruesas en forma de luna.", "Caliente una sartén antiadherente grande a prueba de horno (o una sartén de hierro fundido) a fuego medio-alto y agregue un chorrito de aceite de oliva.", "Coloque la calabaza y las alcachofas de Jerusalén en la sartén, sazone con sal y cocine durante 3-4 minutos, hasta que comiencen a colorear.", "Transfiera toda la sartén al horno y tueste durante 15 minutos.", "Cortar la remolacha cocida en trozos, agregar a la sartén y cocinar en el horno durante otros cinco minutos.", "Mientras tanto, haz el aderezo. Combine las avellanas picadas, chalotes, cebolletas y aceite de avellana en un tazón. Agregue un poco de vinagre de jerez y sazone con sal y pimienta al gusto.", "Para servir, una vez que el urogallo haya descansado, talle las patas y la carne de pechuga en un plato y espolvoree los jugos de la sartén.", "Sirva las verduras asadas junto con el aderezo y el berro en la parte superior."], "url": "www_bbc_co_uk_food_recipes_grouse_with_roasted_45527", "title": "Urogallo con calabaza asada, alcachofa de Jerusalén y remolacha", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ papa grande, muy finamente rebanada", "1 diente de ajo, muy finamente cortado", "Crema doble de 200 ml / 7 fl oz", "50ml / 2fl de leche en oz", "Queso Gruyère 55 g / 2 oz, rallado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la papa, el ajo, la crema y la leche en una olla y caliéntela suavemente durante cinco minutos.", "Verter en un plato gratinado y espolvorear sobre el Gruyère. Coloque en el horno y hornee durante 12 minutos, retírelo del horno y déjelo reposar de cinco a diez minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_gruyeredauphinoise_83967", "title": "Gruyère dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500ml / 18fl de leche en oz", "2 ramitas de tomillo fresco", "1 hoja de laurel", "1 nuez moscada molida molida", "1 cucharada de aceite de oliva", "Tocino de 150g / 5oz fuertemente curado, finamente picado", "65 g / 2½ oz de mantequilla, más extra para engrasar", "Harina normal de 55g / 2oz", "pizca de mostaza inglesa en polvo", "5 huevos de gallinas camperas, separados", "sal y pimienta negra recién molida", "2 cucharadas de cebolletas frescas picadas", "Crema doble de 300ml / 11oz", "Queso gruyere 110g / 4oz, muy finamente rallado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 (modo de convección) y engrase generosamente seis moldes de 7cm x 4cm / 2¾in x 1½in.", "Coloque la leche en una cacerola, agregue el tomillo, la hoja de laurel y la nuez moscada, y cocine a fuego lento.", "Apague el fuego y deje que se infunda durante unos minutos.", "Caliente una sartén hasta que esté caliente, agregue el aceite de oliva y el tocino y cocínelos hasta que estén crujientes. Retire y coloque en un plato forrado con papel de cocina.", "Derrita la mantequilla en una cacerola y agregue la harina y la mostaza. Cocine por un par de minutos hasta que se libere un aroma a nuez.", "Colar la leche y agregarla a la cacerola que contiene la harina y la mostaza. Batir continuamente hasta que espese, luego batir en las yemas de huevo y sazonar con sal y pimienta negra recién molida. Deje que se enfríe un poco.", "Batir las claras de huevo en un recipiente limpio hasta que estén firmes, agregando una pizca de sal.", "Agregue un tercio de la clara de huevo a la mezcla de base de soufflé y agregue. Agregue las cebolletas y luego doble cuidadosamente las claras de huevo restantes. Vierta la mezcla en los moldes con mantequilla y hornee durante 5-7 minutos, o hasta que las partes superiores comiencen a dorarse.", "Para servir, precaliente la parrilla a alto.", "Caliente la crema en una cacerola y sazone con sal y pimienta negra recién molida. Aumente la temperatura y cocine hasta que el volumen del líquido se haya reducido en un tercio.", "Agregue el tocino crujiente y mezcle bien, luego agregue sal y pimienta, al gusto. Vierta la crema en seis tazones para servir y coloque los suflés en la crema.", "Cubra los soufflés con el queso gruyère rallado y colóquelos bajo la parrilla. Una vez dorado y burbujeante, retírelo de la parrilla y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gruyre_and_bacon_souffl_24627", "title": "Gruyère y tocino hinchado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "1 cucharadita de polvo de hornear", "Calabacín de 100 g / 3½ oz, rallado", "sal y pimienta negra recién molida", "75g / 2¾oz Gruyère, rallado", "175ml / 6fl oz de leche entera", "1 huevo de gallinas camperas, golpeado", "75ml / 2¾fl oz aceite de oliva, más extra para engrasar", "1 cucharada de romero fresco picado", "mantequilla, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase 5 de los agujeros en una bandeja para muffins de 12 hoyos con aceite de oliva.", "Mezcle la harina, el polvo de hornear, el calabacín, el aderezo y 50g / 1¾oz del queso en un tazón.", "En un recipiente aparte, mezcle la leche, el huevo y el aceite de oliva hasta que estén bien combinados. Agregue la mezcla líquida y el romero a los ingredientes secos y mezcle hasta que estén bien combinados.", "Divida la mezcla entre los agujeros del panecillo y hornee durante 10 minutos en el horno, luego espolvoree sobre el queso restante. Hornea por 10-15 más, o hasta que se levante y dore.", "Sirve los muffins calientes, con mantequilla."], "url": "www_bbc_co_uk_food_recipes_gruyere_and_courgette_61507", "title": "Gruyère y muffins de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 5 muffins grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gruyere_and_courgette_61507_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200 g / 7 oz, tamizada", "pizca de sal", "125g / 4½oz de mantequilla fría, en cubos", "1 huevo mediano de granja, golpeado", "1 cucharada de aceite de oliva", "Tocino rayado de 175g / 6oz, cortado en 1cm / ½ en lardons", "100 g / 3½ oz cebollas picadas", "2 huevos de gallinas camperas", "2 yemas de huevo de gallinas camperas", "Crema doble de 300 ml / ½ pinta", "1 cucharada de perejil picado", "2 cucharaditas de cebolletas picadas", "1 cucharadita de tomillo picado", "50g / 2oz de queso cheddar rallado", "50g / 2oz Gruyère, rallado", "sal y pimienta negra recién molida", "pequeñas flores de cebollino, para adornar (opcional)"], "method": ["Para la masa, coloque la harina, la sal y la mantequilla en un procesador de alimentos y pulse brevemente. Agregue la mitad del huevo batido y continúe pulsando. Puede agregar un poco más de huevo, pero no demasiado, ya que la mezcla debe estar lo suficientemente húmeda como para unirse.", "Si lo hace a mano, frote la mantequilla en la harina hasta que se asemeje a migas de pan gruesas y luego, con las manos, agregue el huevo batido suficiente para unirlo.", "Con las manos, aplana la bola de masa hasta que tenga unos 2 cm / ¾ de grueso, luego envuélvela en una película adhesiva o colócala en una bolsa de plástico y déjala en la nevera durante al menos 30 minutos o, si te piden tiempo, entra el congelador por 10-15 minutos.", "Retire la masa de la nevera y colóquela entre dos hojas de película adhesiva (más grande que su tarta de estaño). Usando un rodillo, enrolle los pasteles a un grosor no superior a 5 mm / ¼ in o incluso más delgado para las latas pequeñas de tartaleta. Si la lata es redonda, asegúrese de mantener la masa en forma redonda y también lo suficientemente grande como para forrar la base y los lados de la lata.", "Quite la película adhesiva y colóquela en una lata de quiche de 18 cm / 7 pulgadas (con lados altos de 3 cm / 1¼) Si lo desea, conserve la capa superior de película adhesiva para ayudarlo a darle forma a la masa. Presione la masa en los bordes y, con el pulgar, corte la masa a lo largo del borde de la lata para obtener un acabado limpio. Retire la película adhesiva, si se utiliza, pinche sobre la base con un tenedor y enfríe la masa en la nevera durante 30 minutos o en el congelador durante 10 minutos. (O cúbralo nuevamente y manténgalo en el congelador por algunas semanas).", "Precalentar el horno a 180C / 350F / Gas 4.", "Cubra la masa con papel de aluminio, a prueba de grasa o pergamino, dejando suficiente para que salga por los lados. Rellene con frijoles para hornear o legumbres secas. Coloque en el horno y hornee durante 15-20 minutos, o hasta que la masa se sienta seca.", "Para el relleno, caliente el aceite en una sartén y cocine el tocino hasta que esté crujiente. Retire y reserve para drenar en papel de cocina. Freír las cebollas suavemente en el mismo aceite por otros 10 minutos. Mientras tanto, bata los huevos en un tazón mediano, agrega la crema, las hierbas, los quesos, el tocino y la cebolla. Mezcle bien y agregue sal y pimienta negra recién molida.", "Retire la masa del horno y retire el papel y los frijoles, vierta el relleno en la base de la masa y vuelva al horno durante 30-40 minutos, o hasta que el centro se haya puesto. Servir caliente, adornado con flores de cebollino."], "url": "www_bbc_co_uk_food_recipes_gruyre_and_chive_flower_97220", "title": "Quiche Lorraine con Gruyère y flores de cebollino", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 lonchas de panceta en rodajas finas", "2 cucharadas de jarabe de arce", "8 rebanadas de brioche", "4 rebanadas grandes Gruyère", "2 huevos de gallinas camperas, ligeramente golpeados", "1 cucharadita de azúcar en polvo", "150ml / 5fl oz de leche entera", "50g / 2oz de mantequilla sin sal", "sal y pimienta negra recién molida"], "method": ["Calentar una sartén a fuego alto. Cuando la sartén esté humeando, agregue la panceta y fría por 1-2 minutos por cada lado, o hasta que esté crujiente y cocido. Rocíe el jarabe de arce y transfiera la panceta a un plato caliente.", "Coloque cuatro rebanadas de brioche en una tabla de cortar y cubra cada una con una rebanada de Gruyère y tres rebanadas de la panceta. Rocíe sobre los jugos de la sartén, luego cubra con las rebanadas restantes de brioche.", "Batir los huevos, el azúcar y la leche en un recipiente poco profundo y ancho hasta que estén bien combinados, luego sazonar al gusto, con sal y pimienta negra recién molida.", "Sumerja cada sándwich en la mezcla de huevo, permitiendo que las rodajas de brioche se remojen por unos segundos en cada lado.", "Calienta la mitad de la mantequilla en una sartén grande a fuego medio. Cuando la mantequilla esté espumosa, agregue dos de los sándwiches empapados y fríalos suavemente durante 4-5 minutos por cada lado, o hasta que estén dorados por ambos lados y calientes. Mantener caliente Repita el proceso con la mantequilla restante y los dos sándwiches restantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gruyre_and_pancetta_42737", "title": "Sándwich de brioche Gruyère y pancetta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gruyre_and_pancetta_42737_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "300 g / 10½ oz de azúcar en polvo", "Crema doble 500ml / 18fl oz", "250g / 9oz de puré de castañas endulzado", "1 vaina de vainilla, partida por la mitad y semillas raspadas con un cuchillo afilado", "8-10 castañas dulces (disponibles en delicatessen), picadas", "50g / 1¾oz de chocolate puro", "1 castaña fresca, pelada, para adornar"], "method": ["Para el merengue, precaliente el horno a 100C / 80C Fan / Gas ½. Cubra una bandeja para hornear grande con silicona o papel para hornear.", "Suspenda un recipiente a prueba de calor sobre una fuente de agua apenas hirviendo, asegurándose de que la base del recipiente no toque la superficie del agua. Agregue las claras de huevo y el azúcar al tazón y comience a batirlos inmediatamente con un batidor eléctrico, hasta que el azúcar se haya disuelto y la mezcla haya alcanzado unos 60 ° C / 140 ° F.", "Transfiera la mezcla a un mezclador de alimentos independiente. Continúe batiendo hasta que esté suave y brillante, pero aún ligeramente tibio, alrededor de 2-3 minutos.", "Coloque la mezcla de merengue en la bandeja de hornear preparada, haciendo un disco grande con bordes elevados. Hornee en el horno durante 2 horas y media o hasta que esté firme, luego retírelo del horno y déjelo enfriar.", "En un tazón, bata la crema doble con el puré de castañas y las semillas de vainilla hasta que se formen picos suaves cuando se quite el batidor. Enfríe, cubierto, hasta que sea necesario.", "Cuando esté listo para servir, ponga la crema sobre el merengue frío y decore la parte superior con los marrons glacés. Rallar sobre el chocolate y decorar con la castaña fresca."], "url": "www_bbc_co_uk_food_recipes_gteau_mont_blanc_89256", "title": "Pastel Mont Blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 calamares que pesan aproximadamente 250 g / 9 oz cada uno, limpios", "1 limón, ralladura solamente", "buen comino pinch", "Una pizca de sal marina", "aceite de oliva", "1 diente de ajo, pegado", "½ puñado de cilantro fresco, picado"], "method": ["Tome el calamar preparado, haga un corte en un lado del tubo del cuerpo y ábralo. Si ha tenido que usar trozos de un calamar grande, simplemente marque ligeramente el interior de la carne, lo que ayudará a ablandarlo.", "Mezcle la ralladura de limón, el comino, la sal marina, el ajo y el aceite de oliva y frote en el calamar y deje macerar durante un mínimo de dos horas en la nevera.", "Calienta la placa de la parrilla hasta que comiencen a aparecer manchas blancas.", "Retire el calamar del adobo y ase a la parrilla por los lados durante no más de dos minutos para asegurarse de que tenga esas preciosas líneas negras de parrilla a través de la carne.", "Empuja el calamar hacia abajo con la parte posterior de una rebanada de pescado y haz lo mismo con los tentáculos.", "Saque el calamar de la parrilla caliente y sirva en un plato con una pizca de sal marina, jugo de limón y espolvoreo de cilantro fresco picado. Sirve con una ensalada verde mixta."], "url": "www_bbc_co_uk_food_recipes_grilledsquidwithlemo_70508", "title": "Calamar a la plancha con limón, ajo y comino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsquidwithlemo_70508_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl de leche en oz", "100 g / 3½ oz de mantequilla, cortada en trozos pequeños, más extra para engrasar", "3g de sal fina", "5 g de azúcar en polvo", "150 g / 5½ oz de harina común, tamizada", "4 huevos medianos de granja", "1 cantidad de pasta choux (ver arriba)", "300 ml / 10 fl oz doble crema", "1 vaina de vainilla, solo semillas", "200ml / 7fl oz de crema fresca", "100 g / 3½ oz de azúcar en polvo", "Licor de naranja 50ml / 2fl oz", "10-12 pequeñas rosas blancas y rosadas", "pequeñas ramas retorcidas"], "method": ["Para la pasta choux, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con papel pergamino. Coloque un anillo de metal de 23cm / 9in en una de las bandejas forradas.", "Ponga 125ml / 4fl oz de agua, la leche, la mantequilla, la sal y el azúcar impalpable en una cacerola a fuego alto durante un minuto, revolviendo con una espátula. Apague el fuego y, revolviendo todo el tiempo, agregue rápidamente la harina hasta que la mezcla esté muy suave.", "Cuando la mezcla esté suave, regrese la sartén al fuego y revuelva con la espátula durante un minuto. La pasta comenzará a pochar y parte del agua se evaporará. No permita que el pegamento se seque demasiado o se rajará durante la cocción. Retire inmediatamente del fuego y agregue los huevos, uno a la vez, mezclando con una espátula entre cada adición.", "Revuelva bien con la espátula hasta que los huevos estén completamente combinados y la pasta tenga una textura muy suave. Ahora está listo para usar.", "Con cuidado, coloque la mezcla en una bolsa grande con una boquilla simple de 1 cm / ½ pulgadas.", "Para el gâteau Saint Honoré, use la mitad de la pasta choux para ensartar 12 bollos pequeños en una de las bandejas preparadas para hornear. Pipe la pasta choux restante en el anillo de metal en la otra bandeja de horno. Transfiera las bandejas para hornear al horno y cocine durante 10-15 minutos, o hasta que estén doradas. Dejar de lado para enfriar.", "Batir la crema doble en un recipiente hasta que esté firme, dividir la vaina de vainilla y agregar las semillas a la crema. Doble la crema en la crema junto con dos cucharadas de azúcar y una pizca de licor de naranja. Dejar de lado.", "Caliente el azúcar restante en una sartén antiadherente a fuego medio y derrita para formar un caramelo. Engrase una bandeja para hornear con mantequilla.", "Con cuidado sumerja cada bollo de choux en el caramelo y luego colóquelo en la bandeja engrasada para que se enfríe. Si el caramelo comienza a solidificarse, caliéntelo suavemente.", "Retire el anillo de la base de la repostería y vierta el licor restante sobre el medio. Usando una cucharada de helado o una cucharada calentada en agua caliente, coloque la mitad de la crema y la mezcla de crema en el centro de la base.", "Llene una manga pastelera equipada con una pequeña boquilla simple con la mezcla de crema restante. Use un cuchillo pequeño y afilado para cortar pequeños agujeros en la parte inferior de los bollos choux y llénelos con la mezcla de crema. Coloque los panecillos alrededor del borde del flan. Adorne un lado con rosas y ramitas y sirva."], "url": "www_bbc_co_uk_food_recipes_gteau_saint_honor_39706", "title": "Pastel de Saint Honoré", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de harina natural, más extra para espolvorear", "200g / 7oz de mantequilla salada, cortada en cubitos", "150ml / 5fl oz de agua helada", "exprimir jugo de limón", "1 huevo de gallinas camperas, solo blanco, ligeramente golpeado", "110g / 4oz de mantequilla, picada", "157g / 5½ oz de harina común", "4 huevos grandes de gallinas camperas", "1 cucharada de aceite sin sabor, para engrasar", "2 cucharaditas de azúcar", "4 huevos grandes de gallinas camperas, solo yemas", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, solo semillas", "50g / 1¾oz de harina de maíz", "500ml / 17fl oz de leche entera", "25 g / 1oz de mantequilla sin sal", "12 maracuyá, pulpa raspada", "150 g / 5¼ oz de azúcar en polvo de oro", "2 huevos grandes de gallinas camperas", "2 yemas de huevo grandes de gallinas camperas", "100 g / 3½ oz de mantequilla sin sal, picada", "Crema doble 500ml / 17fl oz", "1 vaina de vainilla, solo semillas", "6 cucharadas de azúcar glas", "200 g / 7 oz de azúcar en polvo", "100g / 3½oz de chocolate con leche", "50g / 1¾oz de crema doble", "Fresas de 400g / 14oz, descascadas y partidas por la mitad", "150 g / 5½ oz de azúcar en polvo", "2 hojas de pan de oro"], "method": ["Para hacer la masa de hojaldre áspera, tamiza la harina en un tazón grande y agrega la mantequilla. Mezcle la mantequilla alrededor para cubrirla de harina (pare antes de que comience a parecer pan rallado ya que quiere que se vean trozos aplastados de mantequilla en la mezcla). Mezcle el agua y el jugo de limón en una jarra y viértalo en la mezcla de harina y mantequilla.", "Pica la mantequilla en la harina, hasta que la masa se una. Cuando la masa haya formado un bulto suelto, colócalo en una superficie de trabajo ligeramente enharinada y dale forma de rectángulo grueso. Saca la masa, dobla un tercio de la masa hacia el centro, y dobla el otro tercio sobre eso. Voltee la masa nuevamente a las mismas proporciones que antes y dóblela de la misma manera que antes. Gire la masa un cuarto de vuelta y repita el laminado y doblado. Continúa por otras 3-4 veces más. Envuelva la masa en una película adhesiva y coloque en la nevera para enfriar durante varias horas.", "Precaliente el horno a 200C / 400F / Gas 6 y engrase ligeramente una bandeja para hornear con aceite sin sabor.", "Para hacer la masa de choux, en una sartén grande, hierva la mantequilla y 300 ml / 10 fl oz de agua. Agregue la harina, retire del fuego y mezcle bien antes de golpear los huevos uno por uno. Reserve a un lado mientras enrolla la masa de hojaldre.", "Rocíe ligeramente una superficie de trabajo limpia con harina. Retire la masa de la nevera y extiéndala hasta que tenga el grosor de una moneda de una libra. Use un anillo de flan de 30 cm / 12 pulgadas para cortar la masa en forma. Usando una boquilla circular grande, coloque unos bollos choux grandes alrededor del borde de la masa de hojaldre (aproximadamente 10). En la bandeja de hornear engrasada, saque aproximadamente 20 bollos de choux pequeños. Coloque los bollos de hojaldre y choux en el horno durante 25 minutos.", "Para la crème pâtissière, mezcle las yemas de huevo y el azúcar en un tazón hasta que estén pálidos y claros, luego agregue las semillas de vainilla y la harina de maíz. Llevar la leche a ebullición en una cacerola pequeña y luego batirla gradualmente en la mezcla de huevo. Vierta la mezcla en una sartén limpia y déjela hervir lentamente hasta que se espese. Agregue la mantequilla y cocine a fuego lento durante un minuto y luego retire la sartén del fuego.", "Para la cuajada de maracuyá, en un procesador de alimentos mezcle la pulpa de maracuyá y el tamiz en un tazón resistente al calor. Si está usando un microondas, bata los huevos enteros, las yemas de huevo y el azúcar. Agregue la mantequilla y coloque el recipiente en un microondas a temperatura media durante dos minutos. Batir, luego volver al microondas por dos minutos más. Batir de nuevo, luego regrese al microondas por un minuto final. Por ahora, la cuajada debe ser gruesa y suave. Si no tienes un microondas, bate los huevos, las yemas de huevo y el azúcar juntos en un tazón. Derrita la mantequilla a fuego lento en una sartén de base pesada y agregue la mezcla de huevo y la fruta de la pasión mezclada. Cocine suavemente, revolviendo constantemente hasta que espese. Viértalo en un recipiente poco profundo, cúbralo con una película adhesiva y colóquelo en la nevera para que se enfríe.", "Cuando la masa de hojaldre esté cocida, retírela del horno y cepille con la clara de huevo. Cocine por un minuto más y luego deje enfriar.", "Para los bollos de choux pequeños, pinchar la parte inferior con la punta de un cuchillo afilado y coloque de nuevo en el horno durante cinco minutos para crujir. Retire y reserve para enfriar.", "Para hacer la crema Chantilly, bate la crema hasta que espese con un batidor eléctrico de mano y agrega las semillas de vainilla y el azúcar glas. Coloque en el refrigerador en un tazón grande.", "Con una cuchara, coloque la crema Chantilly en una manga pastelera equipada con la boquilla estrella grande. Pipe en los bollos choux insertando la boquilla en el corte hecho anteriormente.", "Una vez que los bollos de choux estén llenos, haz el caramelo. En una sartén mediana colocada a fuego alto, agregue el azúcar y 100 ml / 3½ fl oz de agua y derretir a un caramelo de color ámbar. Retirar del fuego y, usando pinzas, sumergir los bollos de choux en el caramelo y colocar los bollos de choux en el medio del castillo, asegurándose de que quede algo de espacio para que la crema, el ganache de chocolate y la cuajada pasen a la parte superior.", "Para hacer el ganache, en una jarra a prueba de calor derretir el chocolate y la crema en un microondas en un entorno bajo. Deje que se enfríe un poco, luego viértalo en el centro del gâteau. Extiende la cuajada de maracuyá por la parte superior.", "Para decorar, vierta la crema Chantilly en el centro del castillo, y en cualquier espacio entre los bollos choux. Coloque las fresas en un anillo alrededor del borde de la crema.", "Para hacer las decoraciones de azúcar hiladas, en una sartén colocada a fuego medio, derrita el azúcar con dos cucharadas de agua hasta que se forme un caramelo (tendrá un color ámbar intenso). Retire del fuego y deje que el caramelo se enfríe un poco. Alinee una bandeja con papel pergamino. Con una cuchara, rocíe cuidadosamente el caramelo en formas en el papel pergamino. Tenga cuidado de no quemarse ya que el azúcar se calienta mucho. Aparta para enfriar y endurecer.", "Spike las formas de azúcar en la crema entre los bollos choux y decorar con una pizca de la hoja de oro."], "url": "www_bbc_co_uk_food_recipes_gteau_saint_honor_a_la_52768", "title": "Pastel de Saint Honoré con pasión", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10-12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125ml / 4½fl oz de leche entera", "100 g / 3½ oz de mantequilla sin sal, cortada en cubos pequeños", "1 cucharadita de azúcar en polvo", "Harina normal 175g / 6oz", "4 huevos de gallinas camperas", "200ml / 7fl oz de natillas de vainilla", "300ml / 10½ fl oz crema doble", "Licor de naranja 50ml / 2fl oz", "100 g / 3½ oz de azúcar en polvo", "200g / 7oz de frutas suaves mezcladas, como fresas, frambuesas, moras y grosellas negras", "2 pequeñas ramitas de sauce trenzadas, para decorar (opcional)"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Coloque dos bandejas para hornear con tapetes de silicona o papel para hornear.", "Caliente la leche, la mantequilla, el azúcar y 125 ml / 4½ fl oz de agua en una cacerola a fuego alto hasta que la mantequilla se haya derretido (no hierva).", "Agregue la harina de una sola vez y bata firme y rápidamente con una espátula o cuchara de madera, manteniendo la sartén sobre el fuego. Cocine la mezcla durante un minuto, luego transfiera a la taza de un mezclador de alimentos y bata durante 1-2 minutos más, o hasta que se enfríe un poco (puede hacerlo a mano si lo prefiere).", "Agregue los huevos uno a la vez, batiendo bien después de cada adición, hasta que la mezcla esté suave y brillante.", "Transfiera la masa a una manga pastelera equipada con una boquilla grande y plana y pinte una espiral grande, de aproximadamente 24 cm / 10 pulgadas de diámetro y 1 cm / ½ pulgadas de profundidad, en una de las bandejas preparadas para hornear.", "Pase bolas pequeñas, de tamaño uniforme, de la masa choux restante a la segunda bandeja para hornear. Con un dedo mojado, alisa suavemente cualquier pico puntiagudo en la parte superior de las bolas.", "Hornee la pasta choux en el horno durante 20-25 minutos, o hasta que estén doradas y cocidas. Déjelo a un lado para que se enfríe un poco, luego pise los lados de los bollos pequeños una vez con un cuchillo pequeño y afilado para dejar salir el vapor. Haga lo mismo con la gran base de pastelería.", "Para el relleno, bata la crema pastelera con la crema doble hasta que se formen picos suaves cuando se quite la batidora. Agregue el licor de naranja y bata hasta que se formen picos firmes cuando se quite la batidora. Ponga un tercio de la mezcla en una bolsa de plástico equipada con una boquilla pequeña.", "Pierce las bases planas de 16 de los bollos choux pequeños con un cuchillo, inserta la boquilla de la manga pastelera, y llena cada uno con un poco de la mezcla de crema.", "Caliente el azúcar en una sartén a fuego alto hasta que se derrita y comience a caramelizar a un color dorado claro; agitar la sartén, pero no revuelva. (PRECAUCIÓN: el azúcar derretido está muy caliente. Tenga cuidado de no quemarse). Trabajando rápidamente, sumerja la parte superior de cada bollo relleno de choux en el caramelo para cubrir, luego regréselos a la bandeja hasta que el caramelo se haya solidificado.", "Para servir, coloque la base de pasta choux en un plato de servir. Cubra la base de repostería con quenelles de la mezcla de crema restante. Coloque los bollos choux con tapa de caramelo en el borde de la base de la repostería, luego llene el centro con las frutas suaves y las ramitas de sauce trenzadas, si las usa."], "url": "www_bbc_co_uk_food_recipes_gteau_st_honor_27070", "title": "Pastel de St Honoré", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina lisa fuerte de 250g / 9oz", "1 cucharadita de sal fina", "250g / 9oz de mantequilla, cortada en cubitos", "125ml / 4fl oz de leche entera", "100 g / 3½ oz de mantequilla", "½ cucharadita de sal", "1½ cucharadita de azúcar en polvo", "Harina normal 150g / 5½ oz", "4 huevos grandes de gallinas camperas", "1 huevo de gallinas camperas, batido, para lavar huevos", "9 huevos de gallinas camperas, solo yemas", "180g / 6¼ oz de azúcar en polvo", "60g / 2¼ oz de harina común", "750ml / 25fl oz de leche entera", "1¼ cucharadita de pasta de vainilla", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (aproximadamente% 2060 %% 20solids),% 20broken% 20into% 20pieces", "150ml / 5½fl oz crema batida, frío", "500 ml / 18 fl oz crema doble, frío", "60g / 2¼ oz de azúcar glas", "1 cucharadita de extracto de vainilla", "200 g / 7 oz de azúcar en polvo", "200g / 7oz% 20dark% 20chocolate% 20 (aproximadamente% 2060 %% 20solids)"], "method": ["Para la pasta de hojaldre basta, tamice la harina y la sal en un tazón grande. Frote la mantequilla en la harina con los dedos hasta que le queden pequeños trozos de mantequilla (deténgase antes de que empiece a tener el aspecto de pan rallado, ya que los trozos de mantequilla aplastados se mostrarán en la mezcla). Agregue 150ml / 5fl oz de agua, o lo suficiente para unir la mezcla (puede que no necesite toda el agua).", "Enharina la superficie de trabajo y extender la masa hasta un rectángulo ordenado que sea aproximadamente tres veces más largo que su ancho. Dobla un tercio de la masa hacia el centro y cúbrelo con el tercio restante. Cubra y deje reposar en la nevera durante 20 minutos. Ruede los pasteles de nuevo a la longitud y el ancho anteriores, y doblar en tercios como antes. Cúbralo y déjelo descansar nuevamente durante al menos 20 minutos en el refrigerador (o si tiene tiempo por hora).", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y forre una bandeja para hornear con papel pergamino.", "Para la pastelería choux, en una sartén de tamaño medio a fuego lento, hierva la leche a fuego lento. Agregue la mantequilla, 124ml / 4fl oz de agua, sal y azúcar y lleve al punto de ebullición. Agregue la harina y mezcle con una cuchara de madera. Cocine durante aproximadamente un minuto hasta que la pasta salga de los lados de la sartén. Transfiera al tazón de una batidora eléctrica y déjela enfriar un poco antes de agregar los huevos de a uno por vez, batiendo constantemente. La pasta se volverá lisa y brillante.", "Para hacer los bollos choux pequeños, usando una manga pastelera y una boquilla simple, coloque 16 bollos de choux pequeños en la bandeja de hornear forrada. Ponga a un lado la masa restante de choux. Cepille cada bollo choux con un lavado de huevo y hornee en el estante del medio durante 15-20 minutos. Apague el horno y deje los bollos de choux en el calor residual durante 10 minutos para que se sequen. Retire los panecillos del horno y luego regrese el horno a 180C / 350F / Gas 4.", "Corta un disco de 27 cm / 10 pulgadas de la masa de hojaldre y colócalo en una bandeja de horno forrada. Pase una espiral de pasta choux comenzando desde el centro del disco, deteniéndose cuando dos tercios del disco estén cubiertos. Ahora vierta un borde de pasta choux alrededor del borde dejando un espacio de 5 mm / ¼ pulgada en el borde exterior de la base de la masa (el anillo choux se expandirá para alcanzarlo). Cepille con un lavado de huevo y hornee a 180 C / 350 F / Gas 4 durante 25-35 minutos. Apague el horno y déjelo en el calor residual durante 10 minutos para permitir que la masa de choux quede crujiente. Transfiera a un estante de enfriamiento.", "Para la crème pâtissière, bata las yemas de huevo y un tercio del azúcar en un tazón hasta obtener un color claro y esponjoso. Agregue la harina y mezcle bien. En una sartén grande, caliente la leche, la pasta de vainilla y el resto del azúcar. Cuando se trata de hervir, verter sobre la mezcla de yema de huevo y mezclar. Transfiera a una cacerola limpia, llévela de nuevo a ebullición - batiendo continuamente - y cocine durante unos minutos hasta que espese. Pase a través de un colador en un recipiente y coloque un poco de película adhesiva directamente sobre la superficie para evitar que se forme la piel. Transferir a la nevera para enfriar.", "Cuando la crème pâtissière se haya enfriado, échela en una bolsa con una boquilla circular mediana unida y póngala en el pequeño choux y sobre la base de la repostería.", "Para la crema Chantilly, derrita el chocolate en el microondas y déjelo enfriar. En un recipiente frío, combine ambas cremas con el azúcar glas y el extracto de vainilla. Batir hasta que espese lo suficiente como para cañer, pero no exagerar (debe ser una consistencia ligera). Transfiera la mitad de la crema a otro recipiente y agregue el chocolate derretido y frío. Doble cuidadosamente (no lo bata) y luego póngalo en una bolsa con una boquilla grande y redonda.", "En otra manga con la misma boquilla unida, agregue la crema lisa Chantilly. Pipe alterna filas de ambas cremas para cubrir la crème pâtissière por completo.", "Haga un caramelo derritiendo el azúcar y 50 ml / 2 fl oz de agua en una sartén de base pesada. Caliente hasta que el caramelo tenga un color ámbar profundo, luego retírelo del fuego y sumerja la base de la fuente en agua fría para evitar que se queme el caramelo restante.", "Alinee una bandeja para hornear con papel pergamino. Con cuidado sumerja cada choux en el caramelo y transfiéralo a la bandeja para hornear, con el caramelo hacia abajo. Cuando el caramelo se haya enfriado y puesto, coloque los bollos choux alrededor del anillo choux con el caramelo (caliéntelo un poco para ablandarlo si es necesario). Deje un espacio de 1½cm / ½ en cada choux.", "Para decorar, haga rizos de chocolate raspando un pelador de verduras por el borde del bloque de chocolate. Pipe la crema Chantilly entre cada choux y coloque un rizo de chocolate en la parte superior."], "url": "www_bbc_co_uk_food_recipes_gteau_st_honor_85590", "title": "Pastel de St Honoré", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 tortillas de harina listas para usar, cortadas en tiras", "2 cucharaditas de aceite de oliva", "½ aguacate, pelado, piedra removida", "1 chile, reducido a la mitad, sin semillas", "1 lima, solo jugo", "2 cucharadas de yogurt griego", "ramita de perejil fresco, para adornar"], "method": ["Caliente una sartén hasta que fume. Rocíe las tiras de tortilla con aceite de oliva y coloque en la sartén de la plancha. Cocine por 1-2 minutos en cada lado, hasta que estén crujientes.", "Coloque todos los ingredientes restantes, excepto la ramita de perejil, en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, coloque el guacamole en un recipiente para servir y adorne con el perejil. Coloque las tiras crujientes de tortilla en un plato al lado."], "url": "www_bbc_co_uk_food_recipes_guacamoleandtortilla_84510", "title": "Guacamole y tiras de tortilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "1 chile chipotle ahumado, picado (disponible en algunos supermercados y proveedores en línea)", "½ aguacate, pelado y piedra removida", "1 lima, solo jugo", "puñado de cilantro fresco, picado", "sal y pimienta negra recién molida", "500ml / 18fl oz de aceite vegetal, para freír", "4 tortillas de harina listas para ser cortadas en 8 cuñas"], "method": ["Para el guacamole, coloque todos los ingredientes de guacamole en un procesador de alimentos y mezcle hasta que quede suave.", "Para las tortillas, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque cuidadosamente las cuñas de tortilla en el aceite caliente y fría hasta que estén doradas y crujientes. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina.", "Para servir, coloque las tortillas fritas en un plato con el guacamole en un tazón pequeño al lado."], "url": "www_bbc_co_uk_food_recipes_guacamolewithfriedto_85935", "title": "Guacamole con tortillas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ aguacate, pelado, picado", "2 cucharadas de yogur natural", "exprimir jugo de limón", "1 diente de ajo, picado", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "6 mini pittas listos, divididos", "3 tomates tomados por el sol", "½ aguacate, en rodajas, para adornar"], "method": ["Para el guacamole, coloque todos los ingredientes de guacamole en una licuadora y pulse hasta que estén combinados, pero aún ligeramente gruesos.", "Caliente una sartén y cocine los pittas durante 1-2 minutos en cada lado, hasta que estén calientes.", "Para servir, coloca el guacamole en un tazón para servir. Cubra con los tomates tomados por el sol y el aguacate en rodajas y coloque los panes Pitta al lado."], "url": "www_bbc_co_uk_food_recipes_guacamolewithgriddle_85064", "title": "Guacamole con pan de pitta a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350ml / 12fl oz de leche entera", "150ml / 5fl oz de crema doble", "125 / 4fl oz de leche condensada", "50 g / 2 oz de leche en polvo", "25 g / 1 oz de azúcar en polvo", "½ cucharadita de nuez moscada recién rallada", "Guayabas maduras de piel amarilla de 800g / 2lb, cortadas y cortadas a la mitad", "100 ml / 3 fl oz de agua", "500 g / 1 libra de 4 oz de fruta fresca preparada, una combinación de mango de Alphonso, piña, lichi, sandía, caqui y carambola que funciona especialmente bien", "2 maracuyá, pulpa y semillas raspadas", "1 lima, jugo y ralladura solamente", "azúcar en polvo, al gusto"], "method": ["Para el kulfi, coloque la leche, la crema, la leche condensada, la leche en polvo, el azúcar y la nuez moscada en una sartén antiadherente y deje que hierva rápidamente. Baje el fuego y cocine a fuego lento durante 15 minutos. Retirar del fuego y dejar enfriar.", "Mientras tanto, coloca las guayabas en una licuadora con el agua y licúa para hacer un puré. Empuja el puré a través de un colador con el dorso de una cuchara y descarta las semillas. Deberías quedarte con 500 ml / ½ litro de puré.", "Agregue el puré de guayaba a la mezcla de leche y mezcle bien.", "Con una cuchara, mezcle en seis moldes de kulfi individuales, moldes de gelatina o recipientes de yogurt y congele durante la noche.", "Justo antes de servir el kulfi, prepare la ensalada de frutas. Coloque la fruta preparada en un tazón con la pulpa de la fruta de la pasión y las semillas, el jugo de limón y la ralladura y el azúcar y revuelva para cubrir la fruta.", "Para servir, saca el kulfi de sus moldes en platos para servir y sírvelo con la ensalada de frutas."], "url": "www_bbc_co_uk_food_recipes_guavakulfiwithtropic_86120", "title": "Guayaba kulfi con ensalada de frutas tropicales", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fechas de 225g / 8oz, picadas y picadas", "200ml / 7fl oz de agua hirviendo", "100ml / 3½oz de leche de arroz", "90 g / 3¼ oz de mantequilla sin lácteos (como la extensión de girasol)", "150g / 5½oz de azúcar de palma de coco", "3 huevos de gallinas camperas", "2 cucharadas de jarabe de fecha", "Harina de arroz o harina sin gluten de 180g / 6oz, más extra para enharinar los moldes", "1 cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "1 cucharadita de extracto de vainilla", "Una pizca de sal marina", "100 g / 3½ oz de mantequilla sin lácteos (como la extensión de girasol)", "Azúcar de palma de coco 175g / 6oz", "1 cucharada de melaza blackstrap", "100ml / 3½ oz de jarabe de arce", "Crema de soja 230ml / 8oz, más extra para servir", "½ cucharadita de extracto de vainilla", "pizca de sal marina"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y hierva los moldes, luego forre las bases con un disco de papel pergamino engrasado.", "Para hacer el budín, empape las fechas en el agua hirviendo durante cinco minutos, luego mezcle en un procesador de alimentos hasta que quede suave. Agregue los ingredientes restantes y mezcle de nuevo hasta que estén bien combinados.", "Coloque la mezcla en los moldes preparados (pero no en la parte superior, ya que se elevan bastante) y hornee en el horno precalentado durante 20 minutos o hasta que estén firmes y firmes. (Puede verificar que estén cocidos insertando un pincho en el centro; si sale limpio, el pudin está listo).", "Diez minutos antes de que los postres estén listos, prepare la salsa de caramelo. Derrita la mantequilla, el azúcar de palma de coco, la melaza negra y el jarabe de arce en una cacerola a fuego lento, luego cocine a fuego lento durante unos minutos. Revuelva gradualmente la crema de soja, el extracto de vainilla y la sal y deje que hierva durante 1-2 minutos, o hasta que se espese un poco. Mantenga caliente hasta que esté listo para servir.", "Deje que los budines se enfríen en sus moldes durante unos minutos, luego colóquelos en platos para servir. Vierta una cucharada de salsa de caramelo con un poco de crema extra de soja para colmo."], "url": "www_bbc_co_uk_food_recipes_guilt-free_gourmet_20918", "title": "'Pudín pegajoso de caramelo toffee gourmet' sin culpa '", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/guilt-free_gourmet_20918_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chalotes de 900g / 2lb, extremos cortados", "120ml / 4fl oz de aceite de oliva", "1 ramita de tomillo fresco", "botón de mantequilla", "6 cucharadas de crema doble", "sal y pimienta negra recién molida", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "1 chalote de plátano, picado", "500g / 1lb 2 oz de champiñones castaños, finamente picados", "4 patas de gallina de Guinea, deshuesadas y picadas", "200g / 7 oz de hongos duxelles (ver arriba)", "1 cucharadita de mostaza Dijon", "1 cucharada de cebolletas frescas cortadas", "1 cucharada de perejil fresco picado", "1 cucharada de estragón fresco picado", "6 hojas de col de hispi, tallos eliminados", "75g / 2¾oz de mantequilla sin sal", "200g / 7oz girolles champiñones, limpios", "2 patatas grandes, peladas y en espiral", "400ml / 14fl oz de salsa o jus"], "method": ["Para el puré, precaliente el horno a 180C / 160C Fan / Gas 4.", "Coloque dos hojas grandes de papel de aluminio una sobre otra sobre una superficie de trabajo. Coloque las chalotas en el centro de la lámina, vierta sobre el aceite, agregue el tomillo y sazone bien. Dibuje los lados de la lámina hasta el centro y arrugue los bordes para sellar y formar un paquete. Poner en una bandeja para hornear y hornear durante 1 hora y media, o hasta que los chalotes son muy suaves.", "Retire las pieles de los chalotes y poner la carne en una licuadora con la mantequilla y la crema. Blitz bien, luego transfiera a un tazón y sazone.", "Para los hongos duxelles, caliente una sartén mediana y agregue el aceite y la mantequilla, agregue los chalotes y cocine durante 3-4 minutos. Agregue los champiñones y cocine por otros 8-10 minutos o hasta que toda el agua haya salido de los champiñones. Dejar de lado.", "Para la gallina de Guinea, ponga la carne picada, duxelles, mostaza, cebollín, perejil y estragón en un tazón grande y mezcle. Enrolla la mezcla en seis bolas.", "Escalde la col en agua ligeramente salada durante 3-4 minutos, luego sumérjala en agua helada. Escurrir sobre papel de cocina.", "Coloque una hoja de película adhesiva y coloque una hoja de repollo sobre ella. Coloca una bola de gallina de Guinea en el centro y envuelve la hoja. Lleva la película adhesiva alrededor de la hoja y ata como un globo. Repita con las hojas restantes y las bolas de gallina de Guinea.", "Llevar una fuente de agua a 90C. Pochar las bolas durante 15 minutos. Eliminar y reservar.", "Caliente una sartén mediana y agregue la mitad de la mantequilla. Una vez caliente y derretido, agregue los champiñones y cocine por 2-3 minutos.", "Caliente la mantequilla restante en una sartén por separado, agregue la papa espirulizada y cocine hasta que esté crujiente.", "Sirva la gallina de Guinea con el puré de chalota, girolles salteados, papas crujientes y salsa."], "url": "www_bbc_co_uk_food_recipes_guinea_fowl_choux_farci_32334", "title": "Gallina de Guinea choux farci", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]