[{"ingredients": ["2 naranjas, peladas con un cuchillo y cortadas en segmentos sin dientes, empapadas", "1 cucharada de Grand Marnier, o similar", "Crema doble de 590ml / 1pint", "1 vaina de vainilla, cortada a la mitad y raspada", "6 huevos, solo yemas", "50 g de azúcar en polvo, más 4 cucharadas para rociar"], "method": ["Caliente el horno a 140C / 275F / Gas1.", "Divida los segmentos de naranja entre cada plato de terracota. Pon la crema y la vaina de vainilla en una olla y calienta hasta el punto de ebullición. Cubra y permita infundir durante 10 minutos.", "Batir las yemas de huevo y el azúcar hasta que estén pálidos y espesos y agregar la crema. Revuelva bien, cuele y vierta sobre los segmentos de naranja.", "Cocine en un baño de agua durante aproximadamente 20 minutos, hasta que esté listo. Dejar enfriar durante la noche si el tiempo lo permite o durante al menos 2-3 horas.", "Espolvoree el azúcar fina y uniformemente sobre cada plato y caramelice con un soplete (o debajo de una parrilla muy caliente), repita este proceso hasta que esté dorado.", "Dejar enfriar y servir en 2 horas.", ""], "url": "www_bbc_co_uk_food_recipes_orangecataloniancreg_7101", "title": "Naranja catalana crème brûlée", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 1 x 125 g / 4½ oz de gelatina de naranja lista para usar", "Botones de chocolate de 30g / 1 oz", "85g / 3oz de fresas frescas", "1 cucharada de azúcar glas", "1 cucharadita de vinagre balsámico", "Crema doble de 100ml / 3½oz", "1 vaina de vainilla, semillas retiradas", "ramita de menta fresca, para adornar"], "method": ["Coloque la gelatina de naranja en el medio de un plato de servir.", "Ralla el chocolate alrededor de la gelatina.", "Coloque 55 g / 2 oz de las fresas en un procesador de alimentos pequeño con el azúcar glas y el vinagre balsámico y mezcle en una consistencia suave. Vierta en un tazón pequeño.", "Cortar las fresas restantes y colocar en el plato, alrededor de la gelatina. Cuchara el coulis sobre las fresas.", "Batir la crema en un bol hasta que se formen picos suaves cuando se quite el batidor y mezclar las semillas de vainilla. Coloque la crema de vainilla encima de la gelatina. Adorne con una ramita de menta fresca."], "url": "www_bbc_co_uk_food_recipes_orangejellywithstraw_87443", "title": "Jalea de naranja con coulis de fresa y crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, pelado y finamente picado", "1 naranja, ralladura solamente", "¼ cucharadita de copos de chile", "Aceitunas negras 110g / 4oz, picadas", "semillas de comino, para servir"], "method": ["Vierta el aceite de oliva en un tazón y agregue la ralladura de ajo y naranja.", "Agregue las hojuelas de chile y luego agregue las aceitunas negras. Mezcle nuevamente para cubrir el aceite.", "Transfiera las aceitunas a un plato para servir y espolvoree con algunas semillas de comino para servir."], "url": "www_bbc_co_uk_food_recipes_orangeolives_79055", "title": "Aceitunas naranjas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "3 cucharadas de azúcar en polvo, más extra para rociar", "2 cubos de azúcar grandes", "1 naranja", "250ml / 8 fl oz de leche", "1 vaina de vainilla, dividida", "Harina normal de 25g / 1oz", "4 huevos de gallinas camperas, separados", "4 cucharadas de licor de naranja", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Unte con mantequilla el interior de un plato de pudín grande a prueba de horno y quite el polvo con una rueda para recubrir el interior uniformemente con azúcar.", "Frote los cubos de azúcar sobre la piel de la naranja para extraer el aceite, luego triture los terrones de azúcar en un almirez y mortero.", "Rallar la cáscara de naranja para eliminar la ralladura de naranja (no rallar la médula blanca) y reservar la ralladura.", "Vierta la leche en una sartén a fuego lento y agregue la vaina de vainilla, los cubitos de azúcar y la ralladura de naranja. Llevar a ebullición, revolviendo ocasionalmente, luego cubrir y retirar del fuego. Deja enfriar y luego retira la vaina de vainilla.", "Coloque la harina en una cacerola limpia y agregue un chorrito de la vainilla enfriada y la leche infundida con naranja. Agregue el azúcar impalpable y mezcle bien. Coloque a fuego lento y mezcle gradualmente la infusión de leche restante, mezcle bien para evitar grumos. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 30 segundos, revolviendo continuamente, hasta que quede suave y espeso. Retirar del fuego y remover bien por un par de minutos.", "Batir las yemas de huevo en la salsa fría de a una por vez, luego cubrir la mezcla con una película adhesiva y dejar enfriar.", "Cuando la mezcla esté fría, agregue el licor de naranja.", "Coloque las claras de huevo en un recipiente limpio y bata hasta que se formen picos suaves cuando se quite el batidor.", "Doble las claras de huevo batidas en la mezcla de leche y yema de huevo.", "Transfiera la mezcla de soufflé al plato de budín preparado y pase el mango de una cuchara por el interior del borde del plato para hacer un canal poco profundo en la mezcla.", "Coloque el soufflé en el horno para hornear durante 15-20 minutos.", "Retirar del horno y espolvorear la superficie del soufflé con azúcar glas, luego volver al horno para cocinar durante otros 5-10 minutos, o hasta que se haya levantado y dorado.", "Servir inmediatamente en la mesa del plato."], "url": "www_bbc_co_uk_food_recipes_orangesouffle_89078", "title": "Naranja soplada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharaditas de azúcar en polvo", "Harina normal 150g / 5½ oz", "½ cucharadita de copos de sal marina", "1 x 7g / ¼ oz de levadura seca de fácil mezcla", "3 huevos grandes de gallinas camperas, ligeramente golpeados", "75g / 2¾oz de mantequilla, ligeramente ablandada, cortada en cubos, más extra para engrasar", "500 g / 1 lb 2 oz de azúcar en polvo", "1 naranja, corteza solamente, corte de corteza en 4 tiras largas", "500ml / 17fl oz de agua fría", "100 g / 3½ oz de miel clara", "4 cucharadas de licor de naranja", "½ cucharadita de agua de naranja y flor (opcional)", "crema batida, para servir"], "method": ["Engrase los pocillos de una bandeja para muffins de 12 hoyos con mantequilla.", "Mezcle el azúcar, la harina, la sal y la levadura en un tazón grande hasta que estén bien combinados. Agregue la mitad de los huevos batidos, luego bata con un batidor eléctrico hasta que la mezcla esté bien combinada y forme una pasta pegajosa.", "Poco a poco mezcle un poco del huevo batido restante. Cuando el huevo esté completamente incorporado a la mezcla, agregue 1-2 cubos de mantequilla y bata hasta incorporarlo completamente en la mezcla.", "Bate el huevo batido restante y los cubos restantes de mantequilla en la mezcla en turnos alternos, hasta que la mezcla se una como una masa blanda. Usando una cuchara de madera, bata la masa hasta que quede suave.", "Divida la mezcla de masa por igual entre los pocillos en la bandeja de muffins preparada. Déjelo a un lado en un lugar cálido durante aproximadamente una hora, o hasta que las porciones de la masa hayan demostrado (es decir, que hayan duplicado su tamaño y llenen los pocillos de la bandeja).", "Mientras tanto, precalentar el horno a 220C / 425F / Gas 7.", "Cuando la masa haya probado, hornee los bollos en el horno durante 12-15 minutos o hasta que estén bien dorados y dorados. Dejar de lado para enfriar en una rejilla de alambre.", "Mientras tanto, para el almíbar, caliente el azúcar, la cáscara de naranja y el agua fría en una sartén a fuego lento, revolviendo bien. Cuando el azúcar se haya disuelto, ponga la mezcla a ebullición y continúe hirviendo durante tres minutos, o hasta que la mezcla se haya espesado y se asemeje al jarabe.", "Retire la sartén del fuego y agregue la miel, el licor de naranja y el agua de naranja, si se usa, hasta que estén bien combinados. Dejar de lado hasta que se enfríe un poco.", "Sumerja seis de los panecillos en el sirope enfriado y sirva directamente sobre los platos con una cucharada de crema batida.", "Empaque los bollos restantes en un frasco esterilizado de 1 litro / 1 ¾. Vierta el resto del almíbar y déjelo a un lado durante 20 minutos, luego cubra el frasco y cierre herméticamente. Los bollos se pueden guardar en la nevera por hasta un mes."], "url": "www_bbc_co_uk_food_recipes_orangeyhoneybuns_91684", "title": "Bollos de miel Orangey", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de cebollín", "50g / 1¾oz de puerros", "50g / 1¾oz cebolleta de primavera", "300 ml / 10 fl oz de aceite de girasol", "pizca de sal", "100ml / 3½fl oz de vinagre de vino blanco", "75g / 2¾oz de azúcar en polvo", "1 cucharadita de sal", "1 nabo, pelado y rebanado", "400ml / 14fl oz de aceite de oliva virgen extra", "4 ramitas de tomillo", "10 bayas de enebro", "10 semillas de cilantro", "4 ramitas de pino", "4 lanzas de brócoli brotación púrpura, blanqueadas y asadas", "4 florecillas de coliflor, blanqueadas y tostadas", "4 cucharadas de caldo de pollo", "4 x 150 g / 5½ oz de filetes de salmón orgánico", "2 cabezas de brócoli, tallos eliminados y rotos en floretes", "sal al gusto", "½ repollo rojo, en jugo, para producir 250 g de jugo de repollo", "5 cucharaditas de salsa de soja", "5 cucharaditas", "½ cucharadita de agar agar"], "method": ["Para el aceite de cebolla, mezcle todos los ingredientes, excepto el caldo de pollo, en un procesador de alimentos durante cinco minutos. Vierta la mezcla en una estopilla sobre un tazón limpio y déjela escurrir durante la noche. Sazone el aceite con sal y guárdelo en un recipiente hermético hasta que lo necesite.", "Para el nabo en vinagre, coloca el vinagre, el azúcar y la sal en una cacerola y llévalo a ebullición. Deje que se enfríe y luego coloque las rodajas de nabo en un recipiente o recipiente conservador y vierta el líquido sobre la parte superior. Deje marinar durante al menos una hora.", "Para el salmón, coloque el aceite de oliva virgen extra, el tomillo, el enebro, el cilantro y el pino en una cacerola y caliente a 80 ° C / 175 ° F. Dejar enfriar.", "Cuando esté listo para cocinar el salmón, caliente el aceite infundido en una sartén ancha a 46 ° C / 115 ° F. Coloque el salmón, retire la sartén del fuego y déjelo durante 30 minutos.", "Para el puré de brócoli, ponga a hervir un sartén grande de agua salada, agregue los floretes de brócoli y blanquee durante 90 segundos. Drene bien, reservando el líquido, luego coloque el brócoli en un procesador de alimentos y mezcle hasta que quede suave; si la mezcla parece un poco espesa, agregue un poco de agua de cocción. Sazone el puré con un poco de sal y pase a través de un colador fino en un recipiente colocado sobre un baño de hielo.", "Para el puré de repollo rojo, mezcle el jugo de repollo con la soja y el mirin en una cacerola. Sazonar con un poco de sal, si es necesario, luego batir en agar agar. Haga hervir, deje que la mezcla burbujee durante 10 segundos, luego retírela del fuego y vierta en un recipiente colocado sobre un baño de hielo. Cuando estén fríos y listos, mezcle la mezcla hasta obtener un puré suave, pase a través de un colador fino y enfríe en la nevera hasta que sea necesario.", "Para servir, cuando el salmón está a unos minutos de cocinarse, comience a vestir el plato. Coloque el puré de repollo rojo en el centro del plato. Dispersar sobre algunas de las flores de coliflor y luego cubrir con el salmón. Coloque el brócoli brote púrpura junto con una cucharada de puré de brócoli. Apila el nabo en vinagre en el borde del salmón. Batir el caldo de pollo en tres cucharadas de aceite de cebolla y calentar rápidamente en una cacerola. Rocíe el aceite calentado alrededor del borde de la comida y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_organic_salmon_and_58694", "title": "Salmón orgánico y brassicas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pierna de cordero orgánico de nueva temporada, deshuesado y con mantequilla (puedes pedirle a tu carnicero local que haga esto por ti)", "1 jarra pequeña zucchero rosato (mermelada de pétalos de rosa)", "3 cucharadas de mostaza Dijon", "2 limones no encerados, ralladura rallada solamente", "generoso racimo de romero fresco, tallos eliminados y hojas toscamente picadas", "2 cucharadas de aceite de oliva virgen extra", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 180 ° C / 356 ° F / Gas 4.", "Para el recubrimiento de rosa, mezcle todos los ingredientes en un bol, agregando el aceite de oliva al último.", "Sazonar el cordero generosamente con sal marina y pimienta negra recién molida y extender el recubrimiento de rosa por toda la piel, usándolo todo.", "Coloque el cordero en el horno precalentado durante 35 minutos.", "Retire del horno y deje reposar durante 20 minutos antes de cortar y servir."], "url": "www_bbc_co_uk_food_recipes_organicnewseasonlamb_74899", "title": "Cordero orgánico de nueva temporada con romero, limón y zucchero rosato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Jengibre fresco de 5cm / 2in, pelado, finamente rallado", "4 dientes de ajo, pelados", "3 cucharadas de salsa de soja", "2 cucharadas de salsa de soja dulce", "2 cucharadas de salsa de ciruela agridulce lista para usar", "2 cucharadas de mirin", "2 cucharadas de aceite de sésamo", "aceite de oliva virgen extra", "6 x 160-180 g / 5-6oz grupas de cordero"], "method": ["Para el adobo, mezcle todos los ingredientes del adobo, excepto el aceite de oliva, hasta obtener una pasta homogénea en un procesador de alimentos (alternativamente, muela hasta obtener una pasta en un mortero). Agregue gradualmente una llovizna de aceite de oliva para aflojar la mezcla del adobo según sea necesario. .", "Para el cordero, transfiera el adobo a una bolsa de congelador con cierre hermético y agregue las costillas de cordero. Selle la bolsa, eliminando la mayor cantidad de aire posible mientras lo hace, luego masajee la mezcla en la carne y déjela a un lado en el refrigerador para marinar durante entre 2 horas y 24 horas.", "Cuando la carne se haya marinado, precaliente el horno a 190 ° C / 375 ° F / Gas 5 o prepare una barbacoa.", "Retire las rabadillas de cordero marinado de la bolsa del congelador y sacuda el exceso de adobo. Coloque las paletas de cordero marinado en una bandeja de asar y tueste en el horno durante 20-25 minutos (para mediano, dependiendo del tamaño de las grupas), o hasta que se cocinen a su gusto. Alternativamente, cocine las costillas de cordero en la barbacoa caliente."], "url": "www_bbc_co_uk_food_recipes_oriental-style_marinated_79700", "title": "Costillar de cordero marinado al estilo oriental", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de 150g / 5½oz de bacalao o eglefino, sin espinas", "1 cucharada de salsa de soja", "1 cucharada de mirin", "1 cucharadita de vinagre de arroz", "2 cucharaditas de aceite de girasol", "½ pimiento rojo (60 g / 2¼ oz), en rodajas finas", "1 zanahoria pequeña (50 g / 1¾oz), en rodajas finas", "50g / 1¾oz mangetout, en rodajas finas", "1 cucharadita de semillas de sésamo tostadas", "algunas ramitas de cilantro fresco (opcional)"], "method": ["Coloque el pescado en una bolsa de plástico para alimentos, agregue la soja, el mirin y el vinagre de arroz. Dale un buen batido y refrigera o congela hasta que esté listo para cocinar.", "Precaliente la parrilla a su temperatura más alta y forre una lata pequeña para asar con papel de aluminio. Escurre el pescado, reservando el adobo. Coloque el pescado en la lámina y ase a la parrilla durante 5 minutos o hasta que esté cocido.", "Mientras tanto, caliente un wok pequeño o una sartén a fuego alto y agregue el aceite. Agregue las verduras y saltee por 30 segundos. Agregue 2 cucharadas de agua y el adobo reservado y cocine durante 1-2 minutos, o hasta que estén calientes.", "Coloque las verduras en un plato caliente y cubra con el pescado. Dispersar sobre las semillas de sésamo y el cilantro, si se usa."], "url": "www_bbc_co_uk_food_recipes_oriental_cod_with_stir_72954", "title": "Bacalao de inspiración asiática con salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_cod_with_stir_72954_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fideos de arroz extrafinos secos 200 g / 7 oz", "½ pepino, reducido a la mitad longitudinalmente", "Colas de cangrejo cocidas y peladas 150 g / 5½oz", "1 pimiento rojo, sin semillas y en rodajas finas", "150g / 5½oz de brotes de soja", "6 cebollas de primavera, finamente cortadas en diagonal", "1 zanahoria pequeña, cortada en fósforos finos", "½-1 chile rojo fresco, sin semillas y finamente picado", "1 cilantro fresco de racimo pequeño, picado", "1 pequeño manojo de menta fresca, picado", "Jengibre fresco de la raíz de 3cm / 1¼inin, pelado y rallado fino", "1 diente de ajo, aplastado", "Cacahuetes salados 30g / 1oz, picados, para servir (opcional)", "sal y pimienta negra recién molida", "3 cucharadas de salsa de pescado tailandesa", "3 cucharadas de jugo de lima (1-2 limas)", "3 cucharadas de azúcar mascabado ligero", "1 cucharada de aceite de sésamo"], "method": ["Cocine los fideos de arroz en agua hirviendo de acuerdo con las instrucciones del paquete, o hasta que estén al dente, luego drene y renueve en agua fría. Drene de nuevo y corte en longitudes más cortas.", "Con una cucharadita, saca las semillas de pepino a la mitad del medio y deséchalas. Corta finamente el pepino en la diagonal y la punta en una ensaladera grande.", "Agregue todos los ingredientes restantes de la ensalada, incluidos los fideos cocidos, sazone con sal y pimienta y mezcle.", "Para el aderezo, mezcle todos los ingredientes en un tazón pequeño. Justo antes de servir, vierta el aderezo sobre la ensalada y revuelva. Dispersa con los cacahuetes, si los estás usando."], "url": "www_bbc_co_uk_food_recipes_oriental_vegetable_99308", "title": "Ensalada de fideos y cangrejo de estilo vietnamita", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oriental_vegetable_99308_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de sésamo", "1 diente de ajo, picado", "½ stick lemongrass, hojas exteriores descartadas, finamente picadas", "300ml / 10½fl oz de caldo de verduras calientes", "Filete de salmón 100g / 3½ oz, en cubos", "Fideos de arroz delgados listos para cocinar de 55g / 2oz, cocidos de acuerdo con las instrucciones del paquete", "2 cuñas de lima"], "method": ["Caliente el aceite de sésamo en un wok a fuego lento. Agregue el ajo y la hierba de limón y fría por 3-5 minutos.", "Agregue el caldo de verduras y las piezas de salmón. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 5-10 minutos, o hasta que el salmón esté cocido.", "Agregue los fideos y revuelva bien.", "Para servir, vierta el caldo en un recipiente y agregue las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_orientalbroth_84531", "title": "Caldo de salmón oriental", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5¼ oz de harina común", "2 huevos de gallinas camperas", "25ml / 1oz de agua", "500ml / 17fl oz de caldo de pollo o vegetal", "1 cucharada de salsa de soja", "½ cucharadita de copos de chile", "1 lima, solo jugo", "2 cucharadas de cilantro, picado"], "method": ["Mezcle la harina común con los huevos y el agua y mezcle para formar una masa suave.", "Usando una máquina de pasta, coloque la masa de fideos en la configuración de fideos finos. Crea tus fideos al alimentar la pasta lentamente.", "Para hacer el caldo, coloque el caldo de pollo o vegetal en una cacerola honda con la soja, los copos de chile, el jugo de lima y el cilantro. Cocine a fuego lento durante cinco minutos y luego agregue los fideos. Cocine por otros tres minutos y sirva en un tazón grande."], "url": "www_bbc_co_uk_food_recipes_orientalbrothwithnoo_77710", "title": "Caldo oriental con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "¼ de cebolla picada", "1 diente de ajo, picado", "1 chile rojo, en rodajas", "150ml / 5fl oz de caldo de pollo caliente", "Pechuga de pollo de 75 g / 2½ oz, cortada en tiras", "Fideos de huevo listos para usar de 50g / 1oz, cocidos de acuerdo con las instrucciones del paquete", "2 cebollas de primavera, picadas", "puñado de brotes de soja", "sal y pimienta negra recién molida", "1 cucharada de semillas de sésamo"], "method": ["Caliente el aceite de oliva en una cacerola mediana a fuego medio. Agregue la cebolla y cocine por 2-3 minutos, hasta que se ablande.", "Agregue el ajo y el chile y cocine por otro minuto.", "Agregue el caldo de pollo y la pechuga de pollo. Llevar a ebullición, luego reduzca el fuego a fuego lento durante cuatro minutos, o hasta que el pollo esté completamente cocido.", "Agregue los fideos, cebollas tiernas y brotes de frijoles y sazone al gusto con sal y pimienta negra recién molida.", "Para servir, vierta en un recipiente y espolvoree con semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_orientalchickennoodl_84515", "title": "Caldo de pollo oriental con fideos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 hongos shiitake frescos o secos", "½ pollo asado o escalfado", "4 chalotes, o 1 cebolla pequeña", "2 cucharadas de aceite vegetal", "1 cucharada de harina normal", "110ml / 4fl oz de caldo de pollo", "1 cucharada de salsa de soja", "1 cucharada de salsa de ostras", "1 cucharada de hoi sin o salsa de ciruela", "2 cucharadas de hojas de cilantro", "Paquete de 500g / 1lb 2oz de hojaldre congelado", "1 huevo, solo yema, batido con", "1 cucharada de leche", "110g / 4oz muchos tout, julienned"], "method": ["Remoje los champiñones secos en agua caliente durante 30 minutos.", "Caliente el horno a 200C / 400F / Gas 6.", "Triture la carne del pollo y pique finamente.", "Cortar finamente los chalotes o la cebolla. Escurrir los champiñones secos, cortar los tallos y cortar finamente. Corte y corte finamente las setas frescas si las usa.", "Calentar el aceite y cocinar las chalotas suavemente hasta que estén suaves. Espolvoree con la harina y cocine, revolviendo constantemente, durante 2 minutos, luego agregue gradualmente el caldo de pollo, revolviendo.", "Agregue los champiñones y la salsa de soja, las salsas de ostras y hoi y cocine a fuego lento durante 5 minutos. Retire del fuego, agregue las hojas de pollo y cilantro, y deje enfriar.", "Descongele la masa, despliegue y corte en cuadrados de 8x15 cm. Ponga 1 cucharada abundante de la mezcla en cuatro de los cuadrados, cubra con los cuadrados restantes y presione hacia abajo alrededor del relleno. Coloque un vaso grande o un tazón pequeño chino sobre la parte superior y recorte en un círculo.", "Cepillar con la yema de huevo, cortar una pequeña barra en la parte superior y hornear durante 20 minutos o hasta que estén dorados.", "Servir con sarna juliana tout en el lateral."], "url": "www_bbc_co_uk_food_recipes_orientalchickenpie_67963", "title": "Pastel de pollo oriental", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo deshuesadas y sin piel", "4 cucharadas de miel clara", "2 cucharadas de vinagre de arroz", "2 cucharadas de salsa de soja", "1 cucharada de aceite de sésamo", "1 diente de ajo, aplastado", "Jengibre fresco de 2.5cm / 1in, pelado y rallado", "2 cucharadas de semillas de sésamo, tostadas", "pequeño racimo de cilantro fresco, toscamente picado", "1 zanahoria grande, cortada en fósforos finos", "1 manojo de cebollas de primavera, rallado", "½ pepino, pelado, cortado a la mitad, sin semillas y cortado en cerillas", "½ lechuga china, finamente triturada"], "method": ["Corte el pollo en tiras finas y mezcle con la miel, el vinagre y la salsa de soja. Dejar macerar en un recipiente no metálico durante aproximadamente 30 minutos.", "Caliente el aceite de sésamo en una sartén y cocine el pollo a fuego alto con cualquier adobo durante unos 5 minutos hasta que el pollo esté bien cocido, dejando algo de adobo cocido en la sartén para usar como aderezo de ensalada.", "Para servir caliente, mezcle en un tazón grande con los ingredientes restantes y coma de inmediato. Para servir frío, deje enfriar el pollo cocido y la marinada y mezcle con el resto de los ingredientes."], "url": "www_bbc_co_uk_food_recipes_orientalchickensalad_68063", "title": "Ensalada de pollo oriental", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalchickensalad_68063_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de judías verdes, recortadas", "1 cucharada de aceite de oliva", "1 diente de ajo, aplastado", "½ cebolla, finamente rebanada", "¼ cucharadita de azúcar en polvo", "½ cucharadita de copos de chile", "2 chuletas de cordero", "½ cucharadita de copos de chile", "2 cucharadas de salsa de soja", "1 cucharada de miel clara", "½ lima, solo jugo", "½ naranja, solo jugo", "ramita perifollo fresco, para adornar"], "method": ["Para la ensalada, ponga a hervir una sartén de agua con sal y pula las judías verdes durante dos minutos. Desagüe.", "Caliente el aceite de oliva en una sartén antiadherente y agregue el ajo, la cebolla, el azúcar y las hojuelas de chile y saltee hasta que la cebolla esté suave pero no coloreada.", "Agregue las judías verdes escurridas a la sartén y fría por un minuto más. Reservar para mantener el calor", "Para las chuletas de cordero orientales, caliente una pequeña sartén antiadherente y coloque las chuletas de cordero, con la grasa hacia abajo, en la sartén hasta que la grasa se haya derretido y esté crujiente y dorada. Dé vuelta las chuletas de cordero y dore del otro lado, hasta que el cordero esté casi cocido.", "Agregue el resto de los ingredientes a la cacerola, revuelva bien y fría el cordero durante dos minutos más en cada lado hasta que los jugos se hayan reducido a la mitad del volumen.", "Para servir, coloque las chuletas de cordero en una cama de los frijoles calientes y adornar con perifollo."], "url": "www_bbc_co_uk_food_recipes_orientallambcutletsw_87032", "title": "Chuletas de cordero orientales con soja, miel y chile en ensalada de frijoles calientes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de cacahuete", "4 cucharadas de jerez pálido o vino de arroz", "2 cucharadas de salsa de soja ligera", "2 dientes de ajo, aplastados", "Jengibre fresco de 2,5 cm, finamente rallado", "pimienta negra recién molida"], "method": ["Combina todos los ingredientes. Cubra la carne, las aves de corral, el pescado o los mariscos y déjelos durante 2-3 horas."], "url": "www_bbc_co_uk_food_recipes_orientalmarinade_5313", "title": "Oriental marinade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 175ml / 6fl oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de salsa de soja", "3 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "100 g / 3½ oz de champiñones shiitake, en rodajas", "2 hojas de choy sum, más o menos picadas"], "method": ["Batir ligeramente los huevos y la salsa de soja en un bol.", "Caliente el aceite de oliva en una sartén antiadherente y saltee los champiñones hasta que estén tiernos.", "Agregue las hojas de choy sum y cocine durante un minuto, hasta que se marchiten.", "Vierta la mezcla de huevo y cocine suavemente hasta que la base se endurezca, luego voltee y cocine por un minuto más. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_orientalomelettewith_86859", "title": "Tortilla de estilo oriental con setas shiitake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 muslos de pollo, preferiblemente de campo abierto", "6 alitas de pollo, preferiblemente de campo abierto", "2 cucharadas de miel clara", "3cm / 1¼ en pieza de jengibre fresco, pelado y rallado", "1 diente de ajo, aplastado", "1½ cucharadita de cinco especias chinas", "2 cucharaditas de salsa de soja", "3 cucharadas de mermelada de naranja", "½ cucharadita de ralladura de naranja rallada", "1 cucharada de aceite de sésamo"], "method": ["Corta los muslos de pollo de tres a cuatro veces con un cuchillo afilado y colócalos en un recipiente no metálico con las alitas de pollo. Mezcle todos los ingredientes del marinado y vierta sobre el pollo. Deje marinar durante al menos 2 horas, o durante la noche si puede, volteándolas de vez en cuando.", "Una vez que se haya marinado, coloque el pollo en la barbacoa sobre carbones de fuego medio y cocine durante unos 20 minutos, cepillándolo con cualquier adobo que quede en el plato mientras se cocina. Si se está coloreando demasiado rápido, muévase a una parte más fría de la barbacoa para cocinar más suavemente. Es importante que cocines el pollo todo el tiempo.", "Si no está seguro, perfore una baqueta con un pincho: si los jugos aún son rosados, continúe cocinando. Coma tan pronto como esté lo suficientemente frío como para manejarlo, con la salsa pegajosa alrededor de la boca y los dedos. ¿No es eso de lo que se trata la barbacoa?", "El pollo también se puede cocinar en el horno para una comida de picnic perfecta. Precalentar el horno a 200C / 400F / Gas 6.", "Transfiera el pollo a una bandeja para asar con un par de cucharadas de adobo. Colóquelo en el horno durante aproximadamente 50 minutos, volteándolo de vez en cuando y rociándolo con el adobo y los jugos hasta que esté completamente pegajoso y dorado, agregando marinado extra a la bandeja si es necesario. Una vez que las piezas de pollo estén cocidas, cómalas cuando estén frescas y calientes, o déjalas enfriar antes de empacar para un picnic o un almuerzo para llevar."], "url": "www_bbc_co_uk_food_recipes_orientalstickychicke_67594", "title": "Alas de pollo barbacoa pegajosa y baquetas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/orientalstickychicke_67594_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de garbanzos en conserva, enjuagados y escurridos", "100g / 3½oz de salmón cocido en copos", "1 cucharada de cebolletas frescas picadas", "1 cucharada de cilantro fresco picado", "1 cucharada de menta fresca picada", "½ cucharadita de copos de chile", "1 cucharada de salsa de soja", "1 lima, cáscara y jugo solamente", "1 cucharadita de miel", "1 cucharada de semillas de sésamo", "1 cucharada de aceite de sésamo", "4 hojas enteras de lechuga iceberg", "1 naranja, cortada en cuñas", "1 cucharada de hojas de perejil fresco picado"], "method": ["Mezcle todos los ingredientes en un bol y revuelva hasta que estén bien combinados.", "Divida la mezcla de manera uniforme y métala en cuatro tazas de lechuga colocadas en un plato para servir. Adorne con las rodajas de naranja y espolvoree sobre el perejil."], "url": "www_bbc_co_uk_food_recipes_orientalsaladcups_88819", "title": "Tazas de ensalada orientales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]