[{"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_cidertoddy_90492", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidertoddy_90492_16x9.jpg", "ingredients": ["4 cardamom pods, lightly crushed", "1 clementine, sliced into wedges, spiked with 8 cloves", "1 lemon, sliced into wedges, spiked with 8 cloves", "100ml/4fl oz whisky ", "100ml/4fl oz orange liqueur", "3 tbsp clear honey", "1 litre/1 pint 15¼fl oz cider ", "4 cinnamon stick", "freshly grated nutmeg, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat all of the cider toddy ingredients over a low heat until warmed through.", "Pour the cider toddy into 4 latte glasses or other heatproof glasses.", "Finish with a little freshly grated nutmeg."]}, {"isVegetarian": true, "title": "Cinder toffee", "url": "www_bbc_co_uk_food_recipes_cinder_toffee_33877", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinder_toffee_33877_16x9.jpg", "ingredients": ["vegetable oil, for greasing", "75g/2½oz granulated sugar ", "100g/4oz liquid glucose ", "25g/1oz of golden syrup", "15g/½oz bicarbonate of soda"], "serves": "Makes About 30 lumps of toffee", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Use the oil to grease a 23cm/9in square baking tin that’s 4cm/1½in deep. Line it with baking parchment, then grease again with a little oil.", "Place the sugar, liquid glucose, golden syrup and a tablespoon of water into a deep, heavy-bottomed pan. (Make sure the pan is very deep as the mixture will bubble up later.) Heat gently to dissolve the sugar, then increase the heat very slightly, until the mixture has turned into a syrup.", "Watch the pan very carefully from this point on, boiling it steadily at a fairly low heat, until the mixture turns amber. It should be the colour of marmalade. This will take approximately 15 minutes.", "Turn the heat off and get a balloon whisk to hand. Add the bicarbonate of soda and whisk it all together. It will bubble up right to the top of the pan, so take care not to burn yourself as the caramel will be very hot.", "Immediately pour the toffee into the prepared tin and leave to cool completely (about two hours). ", "When cold, prise the toffee out of the tin using a flat knife and break it up into chunks. If it is difficult to release from the tin, hit it with a hammer."]}, {"isVegetarian": false, "title": "Cinnamon and apple iced buns and toffee and marmalade iced buns", "url": "www_bbc_co_uk_food_recipes_cinnamon_and_apple_iced_95601", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz full-fat milk", "2 medium free-range eggs, lightly beaten ", "735g/1lb 9½oz very strong bread flour, plus extra for dusting ", "80g/2¾oz caster sugar", "1¼ tsp salt", "3 tsp fast-action dried yeast ", "80g/2¾oz unsalted butter, softened ", "200g/7oz caster sugar", "20g/¾oz liquid glucose", "180ml/6½fl oz full-fat milk", "180ml/6½fl oz double cream", "4 large free-range egg yolks", "3 tbsp cornflour", "6 clementines, juice and peel only (250ml/9fl oz juice required), peel sliced into thin strips", "300ml/10fl oz blood orange juice", "175ml/6fl oz lemon juice (about 6 lemons)", "225g/8oz caster sugar", "6 tbsp apple pectin", "500g/1lb 2oz Bramley apples, peeled, cored and grated", "125g/4½oz caster sugar", "75ml/2½fl oz cloudy apple juice", "1 tsp ground cinnamon", "pinch ground cloves", "400ml/14oz double cream", "2 tsp vanilla paste", "60g/2¼oz icing sugar", "250g/9oz fondant icing sugar", "green food colouring", "orange food colouring"], "serves": "Makes 16 iced buns", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the milk with 175ml/6fl oz boiling water in a jug, then beat in the eggs.", "Add the dry ingredients to a bowl of a freestanding mixer fitted with a dough hook and mix briefly to combine. Add the butter and the egg mixture, and mix for 5 minutes.", "Turn the dough out onto a lightly floured work surface and knead by hand for another few minutes. Transfer to a large bowl and cover with cling film. Prove the dough in a warm place for about an hour, or until doubled in size.", "Once proved, divide the dough into 16 pieces. Roll into sausage shapes and place on 2 baking trays lined with non-stick baking paper. Prove again for about an hour or until doubled in size. ", "Preheat the oven to 210C/190C Fan/Gas 6.", "Once proved, bake the dough for 9 minutes, then swap the trays around in the oven and bake for another 4 minutes (this is to ensure the colour is even). Set aside to cool. ", "To make the toffee crème pâtisserie, line a large roasting tin with non-stick baking paper. ", "Add the sugar, glucose and 4 tablespoons water to a saucepan. Heat gently until the sugar melts, then increase the heat and boil until it turns a deep caramel colour. (CAUTION: Boiling sugar is very hot. Do not leave unattended.) Carefully pour into the prepared roasting tin and set aside to cool. When the caramel is cool and hard, break it into chunks and transfer a food processor. Pulse until you have a coarse powder. ", "In a large saucepan, mix the milk, cream, egg yolks, cornflour and 135g/5oz of the powdered caramel over a medium heat. Cook until the mixture is thick (or until it measures 85C on a kitchen thermometer). Set aside to cool, covering the surface with cling film to stop a skin forming. When cooled spoon into a piping bag fitted with a large plain nozzle.", "For the marmalade, add all the ingredients to a large, deep saucepan and cook on a low-medium heat for 1½ hours, or until the mixture reaches 104C on a sugar thermometer and the peel has softened. Set aside to cool.", "For the spiced apple compôte, mix all the ingredients together in a large saucepan and cook on a low heat for about 20 minutes, or until the apple has softened and most of the liquid has evaporated.", "For the crème Chantilly, put all the ingredients in a large bowl and whip until stiff peaks form when the whisk is removed. Transfer to a piping bag fitted with a large plain nozzle.", "To assemble the iced buns, slice all the buns in half lengthways. Spread a layer of marmalade on 8 of the rolls and then pipe the crème pâtisserie on top. Place the other half of the roll on top.", "Spread a layer of apple compôte on the remaining rolls and then pipe the crème Chantilly on top. Place the other half of the roll on top.", "For the royal icing, beat the icing sugar with 2-3 tablespoons water using a wooden spoon until smooth and thick. Put half the icing in a separate bowl and add the green food colouring. Add the orange food colouring to the remaining icing. Transfer to separate piping bags fitted with wide flat-tipped nozzles. Pipe the green icing on top of the spiced apple buns and the orange icing on the marmalade buns. Serve once the icing has set."]}, {"isVegetarian": true, "title": "Cinnamon and soft cheese rolls with a maple and whisky glaze", "url": "www_bbc_co_uk_food_recipes_cinnamon_and_soft_cheese_54104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["625g/1lb 6oz strong white bread flour, plus extra for dusting", "75g/2½oz caster sugar", "1 pinch salt", "20g/¾oz dried yeast", "500g/1lb 2oz chilled butter, cut into 1cm/½in-thick slices, plus extra for greasing", "300g/10½oz full-fat cream cheese", "1 vanilla pod, split in half lengthways, seeds scraped out using a sharp knife", "1 tsp ground cinnamon", "2 egg yolks, lightly beaten, for egg wash", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz bourbon whiskey"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, grease a round 23cm/9in springform cake tin with butter and line with baking parchment. ", "Mix the flour, sugar, salt and yeast in a bowl until well combined. Make a well in the centre, then slowly pour in 450ml/16fl oz of tepid water, stirring well and bringing the edges of the dry ingredients towards the water as you mix. (You may not need to use all of the water - keep adding the water until the dough starts sticking to the edge of the mixing bowl and feels elastic.) Alternatively, mix the dough using a free-standing mixer fitted with a dough hook. ", "Cover the bowl with a clean tea towel and set the dough aside to prove for 18-20 minutes, or until it has doubled in size. ", "When the dough has risen, turn it out onto a lightly floured work surface and knock it back. Roll the dough out to a rectangle measuring 60x30cm/24x12in. ", "Cover half of the dough with the slabs of butter, then fold the other half of the dough over the butter, pressing down lightly at the edges to seal. ", "Dust the work surface with flour again. Beat the dough with a rolling pin to flatten it, then roll it out to another rectangle measuring 60x30cm/24x12in rectangle again. ", "Fold the short sides of the rectangle inwards so that the edges of the rectangle meet in the middle. Fold again, lengthways.", "Repeat the beating, folding and rolling process twice more, then wrap the dough in cling film and chill in the fridge for 1 hour. ", "Roll the chilled dough out onto a lightly floured work surface to a rectangle measuring 30x45cm/12x8in with a thickness of approximately 1cm/½in. ", "For the filling, in a bowl, mix together the cream cheese, vanilla seeds and cinnamon until well combined.", "Spread the filling mixture all over the dough rectangle, then, starting with a long edge, roll the dough like a Swiss roll. Cut the roll into 9 slices, each about 5cm/2in thick. ", "Turn the Swiss roll slices onto their sides so that the swirl faces upwards. Place one swirl into the centre of the prepared cake tin, then arrange the remaining swirls around the edge, making sure they are not too tightly packed. Set aside to prove for 35-40 minutes, or until the swirls have doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Brush the dough all over with the egg wash, then bake in the oven for 45 minutes, or until the rolls are golden-brown and have expanded and joined together.", "Meanwhile, for the glaze, in a bowl, mix together the icing sugar, maple syrup and bourbon until smooth and well combined. ", "To serve, remove the edge of the cake tin, separate the rolls and place them onto a serving plate. Drizzle the glaze over the top of each, moving back and forth so that the rolls are covered in criss-cross lines of glaze. Serve warm."]}, {"isVegetarian": true, "title": "Cinnamon apple overnight oats with date butter", "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_overnight_75730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_overnight_75730_16x9.jpg", "ingredients": ["40g/1½oz porridge oats", "½ apple, grated or finely chopped", "small handful pecans, chopped", "150ml/5fl oz milk or soya milk", "¼ tsp ground cinnamon", "1 tbsp date butter (see below)", "100g/3½oz dates, finely chopped", "3 tbsp boiling water", "pinch ground cinnamon"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["For the date butter, put the dates in a heatproof bowl and slowly add the boiling water. Mash the dates using a fork to make a creamy paste. Stir in the cinnamon. Set aside to cool.", "For the overnight oats, put all the ingredients in a jar, stir, put the lid on and store in the fridge overnight. If you prefer your oats warmed, microwave the mixture for 30 seconds to release the aromas and flavours."]}, {"isVegetarian": true, "title": "Cinnamon, apple and custard Danish", "url": "www_bbc_co_uk_food_recipes_cinnamon_apple_and_25914", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_apple_and_25914_16x9.jpg", "ingredients": ["200ml/7fl oz full-fat milk", "50ml/2fl oz single cream", "½ tsp vanilla bean paste ", "50g/1¾oz golden caster sugar ", "2 medium free-range egg yolks", "20g/¾oz cornflour", "1 orange, juice and zest", "100g/3½oz sultanas", "3 red apples, cored, quartered and cut into paper-thin slices", "1 lemon, juice only", "4 tbsp soft light brown sugar ", "½ tsp ground cinnamon", "½ tsp vanilla paste ", "knob unsalted butter", "500g/1lb 2oz strong white flour, plus extra for dusting ", "10g/¼ oz fast-action yeast ", "10g/¼oz salt ", "80g/2¾oz caster sugar", "2 medium free-range eggs", "125ml/4fl oz full-fat milk, heated until tepid", "250g/9oz unsalted butter, chilled", "olive oil, for greasing ", "50g/1¾oz apricot preserve ", "almond liqueur, to taste ", "100g/3½oz icing sugar", "¼ tsp cinnamon", "¼ tsp vanilla bean paste", "fresh mint leaves, to garnish "], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the crème pâtissière, in a large heavy-based saucepan combine the milk, cream and vanilla. Bring to the boil.", "Meanwhile, add the sugar, egg yolks and cornflour to a large bowl and beat until smooth. As soon as the milk mixture comes to the boil, remove it from the heat and pour about a quarter over the egg mixture. Whisk until combined, then pour it into the pan and whisk continuously over a low heat until smooth and thick. Pass through a sieve into a clean bowl. Cover the surface of the custard with cling film to prevent a skin forming. Leave to cool then place in fridge.", "For the apple filling, mix the orange juice and zest with the sultanas and set aside to soak.", "In a large bowl combine the apple slices with lemon juice, brown sugar, cinnamon, vanilla and butter. Cover and cook in the microwave on medium power for about 4 minutes, or until the apples have softened but still hold their shape. Set aside to cool. Roll up the sliced apples so they resemble roses and secure with a cocktail stick. Set aside in the fridge.", "To make the pastry, set up a freestanding mixer with a dough hook attachment. Add the flour, then put the yeast to one side of the bowl and the salt and sugar on the opposite side. ", "In a jug, mix the eggs, milk and 4 tablespoons water. Pour into the flour mixture and mix on a low speed for 2 minutes (you may need to push to dough down the hook occasionally). Increase the speed to medium and mix for a further 6 minutes.", "Transfer to a large, lightly oiled bowl and cover either with a clean tea towel or oiled cling film. Leave to prove for an hour or until doubled in size. ", "Meanwhile, place the block of butter between two sheets of baking paper and bash with a rolling pin to flatten the butter into a rectangle about 1cm/½in thick. Store in the fridge until needed. ", "Turn the risen dough out onto a lightly floured work surface. Flatten it and roll it out to a rectangle about 40x15cm/16x6in and about 1cm/½in thick. Arrange the dough with one of the short edges nearest to you. Lay the butter in the middle of the dough, fold the dough up and down over the butter in the middle to make a neat rectangle. Pinch the edges to seal the butter in the dough. Place in a plastic food bag and chill in the freezer for 10 minutes.", "Place the chilled dough on a lightly floured work surface with one of the short edges nearest you. Roll out the dough into a 40x15cm/16x6in rectangle and fold into equal thirds like folding a letter for a business envelope. Place in a plastic bag in the freezer for 10 minutes. ", "Repeat the rolling and folding as before, then return to the freezer for another 10 minutes. Repeat the rolling and folding one final time, then chill the dough for 30 minutes in a plastic bag in the fridge.", "On a lightly floured work surface, roll out the dough into a 5mm/¼in thick rectangle, 30x40cm/12x16in. Using a sharp knife, cut into twelve 10cm/4in squares.", "To shape the pastries, fold each corner in a bit towards the middle and push down firmly (you should now have a hexagon shape). Transfer to a baking tray (you will need 2-3 baking trays). Cover the trays with cling film or a damp tea towel and leave to rest at cool room temperature for 30–60 minutes until risen slightly.", "Preheat the oven to 210C/190C Fan/Gas 6½.", "On each pastry square spread some of the cooled crème pâtissière and then place an apple ‘rose’ in the centre and press it down to keep it in place. ", "For the glaze, put all the ingredients, except the mint, in a small saucepan and gently warm until runny. Brush the pastries with the glaze then sprinkle over the soaked sultanas.", "Bake for 15–20 minutes, or until golden-brown and crisp. Place on cooling racks. When completely cool, place two mint leaves either side of the apple roses to resemble leaves."]}, {"isVegetarian": true, "title": "Cinnamon, banana and blueberry muffins", "url": "www_bbc_co_uk_food_recipes_cinnamon_banana_and_80291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_banana_and_80291_16x9.jpg", "ingredients": ["250g/9oz plain flour", "2 tsp baking powder ", "1 tsp ground cinnamon, plus ½ tsp extra for the topping", "pinch of salt", "2 ripe bananas, mashed ", "150g/5oz blueberries", "3 tbsp honey ", "3 tbsp vegetable oil ", "1 large free-range egg", "185ml/6fl oz milk", "50g/2oz caster sugar"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line eight holes of a muffin tin with paper muffin cases.", "Sift the flour, baking powder, cinnamon and salt into a large mixing bowl. Add the banana and blueberries and, using a fork, lightly toss the fruit through the flour. ", "In a separate bowl, lightly whisk together the honey, vegetable oil, egg and milk.", "Add the liquid ingredients to the dry ingredients and stir until just combined (don't over-mix or your muffins won't be as light in texture). Spoon the batter into the individual muffin cases. ", "Mix the extra half a teaspoon of cinnamon and the caster sugar together and sprinkle on top of the batter.  ", "Bake in the oven for 20 minutes, until risen and lightly golden. Serve warm from the oven."]}, {"isVegetarian": true, "title": "Cinnamon cream cheese swirls with bourbon glaze", "url": "www_bbc_co_uk_food_recipes_cinnamon_cream_cheese_48034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["650g/1lb 7oz strong white flour, plus extra for dusting", "12g salt", "75g/2½oz caster sugar", "20g/¾oz dried yeast, crumbled", "500g/1lb 2oz cold butter", "300g/10½oz cream cheese", "1 vanilla pod, seeds scraped out", "2 tsp ground cinnamon", "1 free-range egg, lightly beaten (egg wash)", "25g/1oz sugar", "25ml/1fl oz maple syrup", "25ml/1fl oz bourbon whiskey", "200g/7oz icing sugar"], "serves": "Makes 8 buns", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/180C fan/Gas 6.", "Place the flour, salt, sugar and crumbled yeast into a free-standing mixer fitted with a dough hook and slowly mix in about 450ml/16fl oz of lukewarm water, a little at a time. You may not need all the liquid, or you may need a little more. Mix until the dough is soft and starts sticking to the edge of the mixing bowl.", "Remove the bowl from the mixer and cover with clingfilm. Set aside.", "Let the dough rise for about 20 minutes, or until it doubles in size. When the dough has risen, knock the air out of it and roll out onto a floured surface into a rectangular shape measuring 60cm x 30cm/24in x 12in.", "Slice the butter into rectangles about 1cm/½in thick and lay them down end-to-end on the dough, covering two thirds of the surface. Leave a margin large enough to fold the shorter edges of the dough over the butter so that the two edges meet in the middle. The dough will look like the pages of an open book.", "Fold the dough in half again as though you are closing the book.", "Place the dough onto a well-floured surface. Knock and roll the dough out into a 60cm x 30cm/24in x 12in rectangular size again. Repeat the knocking, folding and rolling process three times. Wrap the dough in cling film and leave to rest in the fridge overnight.", "After the dough has rested, roll the out into a square approximately 5mm/¼in  thick.", "For the filling, mix together the cream cheese and vanilla seeds in a bowl. Cover the bottom twothirds of the dough in the cream cheese mixture and sprinkle with cinnamon. Roll the dough up and cut into slices 4cm/1½in thick.", "Grease and line a round 23cm/9in springform tin. Place the buns around the edge and one in the middle, making sure they are not too tightly packed. Leave to prove until double in size.", "Brush the buns with egg wash and bake in the oven for 20 minutes.", "For the glaze, while the cake is cooling, add sugar and maple syrup, plus 25ml/1fl oz water to a pan and heat gently, stirring until the sugar dissolves. Add the bourbon and simmer until the glaze is reduced and sticky. Generously brush the glaze mixture all over the cake.", "Mix together the icing sugar and one tablespoon of water in a bowl until the mixture forms a runny icing. (You may need a little bit more water.) Put into a piping bag and drizzle the cake with the icing.", "Undo the spring catch and transfer the buns to a bread board or plate. Tear and share, preferably with a strong cup of tea or coffee."]}, {"isVegetarian": true, "title": "Cinnamon doughnuts with apple filling, maple glaze and vanilla créme Anglaise", "url": "www_bbc_co_uk_food_recipes_cinnamon_doughnuts_with_48492", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting ", "40g/1½oz caster sugar ", "2 tsp fine sea salt ", "20g/¾oz fresh yeast or 10g/¼oz fast-action dried yeast ", "140ml/4½fl oz whole full-fat milk, slightly warmed", "5 large egg yolks ", "90g/3¼oz unsalted butter, cut into cubes, softened, ", "groundnut or vegetable oil, for deep-frying", "½ lemon, juice only ", "750g/1lb 10oz Bramley apples", "225g/8oz caster sugar ", "25g/1oz unsalted butter ", "4 tsp maple syrup ", "100g/3½oz icing sugar, sifted ", "100g/3½oz caster sugar ", "1 tsp ground cinnamon", "250ml/9fl oz double cream", "½ vanilla pod, split in half lengthways and seeds scraped out", "65g/2½oz caster sugar", "3 large egg yolks"], "serves": "Makes 30 doughnuts", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the doughnuts, put the flour, sugar and salt in the bowl of an electric mixer fitted with a dough hook (if using dried yeast, add it to the bowl now). Stir to mix, then make a well in the middle. ", "In a small bowl, stir the fresh yeast with a little milk until creamy, then set aside for a few minutes until foamy. Add to the well in the flour along with the egg yolks and remaining milk. Mix on low speed to combine, then increase the speed slightly and continue to mix until a dough forms. ", "Reduce the speed a little before adding the butter, a little at a time, and continue mixing until it is fully incorporated. If the dough seems too wet, mix in a little more flour, a tablespoonful at a time. Increase the speed and knead the dough for a couple of minutes until it is smooth and elastic. Cover the bowl with cling film and leave the dough to rise in a warm spot for 1-2 hours or until doubled in size. ", "Meanwhile, make the apple filling. Add the lemon juice to a large bowl of water. Peel, core and roughly chop the apples. As you chop them, immediately put them into the bowl of acidulated water to prevent them from browning. ", "Drain the apples and pat dry with a kitchen towel, then tip into a heavy-based pan and add the sugar and butter. Cook over low heat, stirring occasionally, for about 30 minutes or until the apples are very soft. If there seems to be too much liquid, continue to cook over a low heat until the mixture has thickened. Transfer the stewed apples to a food processor and blend until smooth, stopping the machine to scrape down the sides once or twice. Pass the apple purée through a sieve into a bowl and leave to cool completely, then spoon into a plastic squeezy bottle with a long tip (or a piping bag fitted with a long, thin nozzle). Set aside. ", "Knock back the risen dough and lightly knead it on a floured surface. Roll out the dough to a 1cm/½in thick square or rectangular shape. Line two baking sheets with baking parchment. Put the dough on one of the baking sheets and chill in the freezer for about 30 minutes or until the dough is semi-frozen (this will make it easier to cut). ", "Using a sharp knife, cut the dough into 4cm/1½in squares. Arrange them, spaced slightly apart, on the lined baking sheets. Cover with lightly greased cling film and leave in a warm spot for about an hour or until the dough is one-and-a-half times the original size. ", "Meanwhile make the maple glaze, combine the ingredients in a bowl with a tablespoon water and whisk until smooth. If the glaze seems too thick, add a little more water, a tiny splash at a time, and stir well until you get the desired consistency. ", "For the cinnamon sugar, mix the caster sugar and cinnamon together on a plate. ", "For the crème Anglaise, heat the cream with the vanilla seeds and pod in a saucepan until it begins to boil. Remove from the heat and let the vanilla infuse the cream as it cools. Meanwhile, beat the sugar and egg yolks together in a large bowl. When the vanilla cream has cooled, fish out the pod, then mix the cream with the sugary yolks. Pour the mixture through a fine sieve into a clean saucepan. Set over a low heat and cook, stirring constantly with a wooden spoon, until the mixture thickens into a thin custard that will lightly coat the back of the spoon.", "Heat 4-5cm/1½-2in of oil in a deep heavy-bottomed pan, or a deep-fat fryer, to 170C. Deep-fry the doughnuts, in small batches, for about 2 minutes or until golden-brown all over. Remove with a slotted spoon and drain on a tray lined with several layers of kitchen paper. While the doughnuts are still warm, pipe the apple filling into the centre of each, then roll in the cinnamon sugar. ", "Once all the doughnuts have been deep­ fried, filled and sugared, glaze them in several batches. Place a few in a single layer on a wire rack set over a large baking tray. Drizzle the maple glaze over them and leave to set slightly before transferring them to a serving plate. Serve warm or at room temperature with the vanilla crème Anglaise."]}, {"isVegetarian": false, "title": "Cinnamon, ginger and red chilli wings", "url": "www_bbc_co_uk_food_recipes_cinnamon_ginger_and_red_42146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 head garlic", "1 bunch fresh thyme, roughly chopped", "3 tbsp grated ginger, including its skin", "6 dried red chillies, roughly broken", "4 tbsp sea salt", "12 chicken wings, skin on", "2 x 4cm/1½in cinnamon sticks", "500-700ml/17fl oz-1¼ pints vegetable oil or rapeseed oil", "3 tsp rubbed sage or crushed dried sage", "1 tbsp garlic powder (optional)", "1 tbsp vegetable bouillon powder", "1 tsp chilli powder", "1 tsp dried thyme", "½ tbsp sea salt", "coleslaw, such as Hairy Bikers' Asian slaw"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cure, cut the head of garlic several times across the width and discard as much of the papery skin as you can. Put the garlic in a large shallow dish and add all of the remaining cure ingredients. With a pestle, gently bruise the mixture to release the flavours. Add the chicken wings and massage the cure into them. Cover and refrigerate for at least six hours, overnight if possible.", "When ready to cook the chicken, preheat the oven to 150C/300F/Gas 2. Remove the chicken wings from the fridge, wipe off the cure with kitchen paper and pat as dry as possible. Place them in a deep ovenproof pot with a tightly fitting lid, add the cinnamon sticks and enough oil to cover the wings. Cover with the lid and cook in the preheated oven for three hours; there is no need to disturb the dish during this time.", "Remove the pot from the oven and leave the chicken to cool slightly in the oil while you make the dusting. The chicken will need one final quick cook in the oven, so if you want to serve them immediately, increase the temperature to 220C/425F/Gas 7.", "Blend together the ingredients for the dusting in a food-processor and set aside.", "When the chicken wings have cooled, line a dish with a double layer of kitchen paper. With a slotted spoon, remove the chicken wings from the oil (carefully as they will be very tender) and place on the kitchen paper for a few minutes. Carefully transfer the wings to a roasting tin, and roast  for 12 minutes or so or until crisp.", "Remove the wings from the oven and pat with kitchen paper again. Shake over the dusting mixture and serve, allowing three chicken wings per person. Serve any extra dusting alongside in case you want to add even more!"]}, {"isVegetarian": true, "title": "Cinnamon madeleines with winter caramel sauce", "url": "www_bbc_co_uk_food_recipes_cinnamon_madeleines_with_16096", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, plus extra for greasing", "1 vanilla pod", "250g/9oz sugar, plus 75g/2½oz for dusting", "250g/9oz plain flour", "2 tbsp clear honey", "3 free-range eggs", "½ tsp ground cinnamon, for dusting", "100g/3½oz caster sugar", "350ml/12fl oz double cream", "1 star anise", "½ cinnamon stick", "25g/1oz butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the madeleines, preheat the oven to 170C/325F/Gas 5 and butter the madeline tins.", "Heat the butter until just melted. ", "Split the vanilla pods and scrape out the seeds, reserving the pod.", "Place the sugar and flour into a bowl then add the vanilla seeds, honey and eggs then whisk in the melted butter until you have a nice smooth batter.", "Spoon the batter into the tins, only half filling each indent.", "Bake for 12-15 minutes or until golden-brown. (Depending on the size of the madeleines, small ones may take only 8-10 minutes.)", "Mix the ground cinnamon and sugar for dusting on a plate, then roll the madeleines quickly in the sugar to coat them thoroughly.", "For the winter caramel sauce, heat the sugar in a pan until it turns a light golden-brown. Pour in half the cream and bring to the boil, stirring well.", "Add the star anise, cinnamon, reserved vanilla pod and butter and the rest of the cream. Cook for 2-3 minutes until thickened and smooth.", "Strain through a fine sieve into a serving bowl.", "Serve the madeleines with the sauce. They can be kept in an airtight container for up to a week."]}, {"isVegetarian": true, "title": "Cinnamon porridge with grated pear", "url": "www_bbc_co_uk_food_recipes_cinnamon_porridge_with_53154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cinnamon_porridge_with_53154_16x9.jpg", "ingredients": ["60g/2¼oz jumbo porridge oats", "¼ tsp ground cinnamon, plus a little to sprinkle", "300ml/10fl oz semi-skimmed milk", "1 ripe medium pear", "1 wedge lemon"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the oats and cinnamon in a non-stick saucepan with the milk and cook over a low-medium heat for 4-5 minutes, stirring constantly until rich and creamy. Pour into two deep bowls.", "Coarsely grate the pear, and place on top of the porridge. Squeeze over the lemon juice and sprinkle with a tiny pinch of ground cinnamon."]}, {"isVegetarian": true, "title": "Cinnamon rolls", "url": "www_bbc_co_uk_food_recipes_cinnamon_rolls_67339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["625g/1lb 6oz strong white flour, plus extra for dusting", "75g/2½oz caster sugar", "1 pinch sea salt", "20g/¾oz dried yeast", "500g/1lb 2oz cold butter", "300g/11oz full fat cream cheese", "1 vanilla pod, seeds scraped", "1 tsp ground cinnamon", "2 free-range egg yolks, lightly beaten for egg wash", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz bourbon whisky"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough place the flour, sugar, salt and yeast into a mixer fitted with a dough hook and slowly mix in 450ml/16fl oz water, adding more or less as needed, until the dough starts sticking to the edge of the mixing bowl and feels elastic. ", "Cover the bowl with a clean tea towel and let the dough rise for about 20 minutes, or until it doubles in size. ", "When the dough has risen, knock the air out of it and roll out onto a floured surface into a rectangular shape measuring 60x30cm/24x12in. ", "Slice the butter into rectangles about 1cm/½in thick and lay in two strips covering half of the dough. Fold the dough over and press down lightly at the edges to seal. ", "On a well-floured surface beat the dough with the rolling pin then roll into a 60x30cm/24x12in rectangle again. Fold either end in to meet in the middle, then fold together and repeat the beating, folding and rolling process twice more. Wrap the dough in cling film and leave to rest in the fridge for one hour. ", "Roll the dough out into a rectangle approximately 1cm/½in thick. The rectangle should be 30 x 45cm/12 x 8in long.", "For the filling, mix together the cream cheese, vanilla seeds and cinnamon in a bowl.", "Cover the dough with the filling mixture, then roll up from the longer side to form a Swiss roll 45cm/18in long. Cut into nine slices each 5cm/2in long. ", "Grease and line a round 23cm/9in spring form tin. Place the circles around the edge, standing upright, and one in the middle, making sure they are not too tightly packed. Leave to prove for about 40 minutes, or until doubled in size.", "Preheat the oven to 200C/400F/Gas 6.", "When you’re ready to bake, brush the dough with egg wash and bake for 45 minutes, or until golden-brown. The rolls will expand and join together.", "For the glaze, while the rolls are cooling, mix the icing sugar, maple syrup and bourbon together in a bowl until smooth.", "Lift the rolls out of the tin and put on a serving plate. Drizzle the glaze over the top, back and forth. Tear the rolls apart to separate them and serve warm."]}, {"isVegetarian": false, "title": "Cinnamon and apple pork belly with mulled cider cabbage and roast almonds", "url": "www_bbc_co_uk_food_recipes_cinnamonandapplepork_93116", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz belly pork, fat scored with a sharp knife", "1 tbsp sea salt flakes", "3 cinnamon sticks", "6 cloves", "2 Granny Smith apples, peeled, cored and sliced", "2 large Navel oranges, thickly sliced", "200ml/7fl oz organic medium cider, plus extra for basting", "25g/1oz butter", "1 onion, peeled, finely sliced", "1 cinnamon stick", "¼ tsp freshly grated nutmeg", "2 star anise", "1 bay leaf", "500g/1lb 2oz red cabbage, core removed, finely sliced", "125ml/4½fl oz organic medium cider", "2 tbsp light muscovado sugar", "salt and freshly ground black pepper", "2 tbsp redcurrant jelly", "110g/4oz blanched almonds", "2 tsp groundnut oil"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork belly, boil a kettle and pour the boiling water over the pork skin, discarding the water.", "Pat the pork belly dry, using kitchen paper, then rub the salt over the skin, pressing them into the score marks.", "Place the cinnamon sticks, cloves, sliced apples, oranges and cider into the bottom of a roasting tin. Place the pork belly on top and roast for one hour in the middle of the oven. Then, reduce the temperature to 140C/275F/Gas 1 and cook for 2 hours. Add more cider to the bottom of the roasting tin if all the liquid evaporates.", "Once cooked, remove the pork belly from the oven and set aside to rest for 15 minutes.", "Meanwhile, for the mulled cider cabbage, melt the butter in a lidded pan over a medium heat and fry the onion for 4-5 minutes, or until softened. Add the cinnamon stick, nutmeg, star anise and bay leaf and continue to cook for another 1-2 minutes. Stir in the cabbage, cider and sugar until well combined and the sugar has dissolved. Season, to taste, with salt and freshly ground black pepper.", "Bring the mixture to the boil and reduce the heat until the mixture is simmering. Cover the pan with a lid and simmer over a low heat, stirring occasionally, for 1-1½ hours, or until the cabbage is tender and the liquid has evaporated. Remove the star anise and cinnamon stick and stir in the redcurrant jelly.", "For the salted almonds, mix the almonds and oil in a bowl and season, to taste, with salt and freshly ground black pepper. Transfer to a baking tray and roast in the oven for 10 minutes, or until golden-brown. Remove from the oven and set aside to cool.", "To serve, carve the pork belly into squares. Spoon some mulled cider cabbage into the centre of each of 8 serving plates, top with a piece of pork belly and spoon over some cooking juices. Garnish with the roast almonds."]}, {"isVegetarian": true, "title": "Cinnamon and apple turnover", "url": "www_bbc_co_uk_food_recipes_cinnamonandappleturn_84027", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz soft brown sugar", "25g/1oz butter", "1 apple, cored, halved, thinly sliced ", "25g/1oz raisins", "½ tsp ground cinnamon", "4 sheets ready-made filo pastry", "1 free-range egg, beaten", "1 tbsp icing sugar", "ready-made custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the sugar and butter in a frying pan and melt together over a medium heat. Add the apple, raisins and cinnamon and stir well to coat. ", "Meanwhile, lay out two sheets of filo pastry to cover on a baking tray. The two filo sheets across with the other two sheets. To create pointed star and brush all over with beaten egg.", "Spoon the apple mixture into the centre of the pastry and fold over all the ends, into the centre covering the apple.", "Brush the top of the pastry with egg. Place into the oven and bake for ten minutes, or until the pastry is golden brown.", "To serve, dust the apple turnover with icing sugar and serve with a dollop of the custard."]}, {"isVegetarian": true, "title": "Cinnamon and pistachio apple cake with vanilla ice cream", "url": "www_bbc_co_uk_food_recipes_cinnamonandpistachio_91062", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz green sultanas", "1.2kg/2lb 10¼oz mixed dessert apples, peeled, cored, cut into chunks", "100g/3½oz soft brown sugar", "50g/1¾oz unsalted pistachios, shells removed, chopped, plus extra to sprinkle on top", "1 tsp ground cinnamon", "200g/7¼oz caster sugar", "200g/7¼oz unsalted butter", "3 free-range eggs", "200g/7¼oz ground almonds", "5 tbsp flaked almonds", "vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Soak the sultanas in a small bowl of warm water for 30 minutes. ", "Place the apples in a medium saucepan with the brown sugar and cook over a low heat until soft. Drain the sultanas and add them to the pan, then add the chopped pistachios and cinnamon. Set aside.", "In a large bowl, beat together the butter and sugar until pale and fluffy. Beat in the eggs one by one and then fold in the ground almonds. Lightly stir to make a smooth batter.", "Place the apples in a baking dish and spread the creamed mixture over the top. Cook in the oven for 30 minutes, then sprinkle with the flaked almonds and reserved pistachios. Return to the oven and cook for a further 10 minutes.", "Serve a wedge of cake with scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Cinnamon doughnuts with cinnamon ice cream and chocolate sauce", "url": "www_bbc_co_uk_food_recipes_cinnamondoughnutswit_91336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong white flour", "pinch salt", "1½ tsp ground cinnamon", "115g/4¼oz caster sugar", "25g/1oz butter, softened", "150ml/5fl oz water", "20g/¾oz easy-blend yeast", "vegetable oil, for deep frying", "300ml/½ pint full-fat milk", "2 cinnamon sticks", "1 tsp ground cinnamon", "1 vanilla pod, split, seeds scraped out using a knife", "6 free-range egg yolks ", "110g/4oz caster sugar", "300ml/10½fl oz double cream, whipped until soft peaks form when the whisk is removed", "75g/3oz caster sugar", "110ml/4fl oz water", "200g/7oz dark chocolate, roughly chopped"], "serves": "Makes 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the cinnamon doughnuts, in a large bowl, mix together the flour, salt, half a teaspoon of the ground cinnamon, 40g/1½oz of the caster sugar and all of the butter, water and yeast until well combined. Keep mixing for 4-5 minutes, or until the mixture comes together as a smooth dough. Cover with cling film and set aside for one hour to prove.", "When the doughnut dough has doubled in size, divide it into eight equal portions and roll each into a ball.", "Line a tray with baking parchment and space out the dough balls onto it, leaving plenty of room between each ball. Set aside in a warm place to rise for a further 20 minutes.", "Heat the oil in a deep fat fryer to 150C/320F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the dough balls into the hot oil in batches and deep fry for 6-8 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "When the excess oil has drained off the doughnuts, mix together the remaining tablespoon of ground cinnamon and the remaining 75g/2¾oz of sugar and sprinkle onto a plate. Dredge the doughnuts in the mixture until completely coated.", "For the cinnamon ice cream, bring the milk, cinnamon sticks, ground cinnamon, vanilla pod and vanilla seeds to a simmer in a pan, stirring regularly. When the milk is simmering, remove the vanilla pod and cinnamon sticks and discard (they can be cleaned well and reused in another recipe).", "Meanwhile, whisk the egg yolks and sugar together in a bowl until pale and fluffy.", "Pour the milk mixture over the egg and sugar mixture, whisking continuously until well combined. Return the mixture to the saucepan and continue to cook for 2-3 minutes over a medium heat, or until thickened. Remove from the heat and leave to cool slightly.", "When the ice cream mixture has cooled slightly, strain it through a fine sieve over the whipped cream. Whisk until smooth and well combined, then pour the mixture into an ice cream maker. Churn for 40-50 minutes, or until almost solid, then transfer to a freezeable container and chill in the freezer.", "For the chocolate sauce, bring the sugar and water to a simmer in a pan. Simmer for 1-2 minutes, stirring continuously, until all of the sugar has dissolved.", "Add the chocolate pieces and whisk until the chocolate has melted and the mixture is smooth. Remove from the heat and set aside.", "To serve, place two cinnamon doughnuts into the centre of each of four serving plates. Serve a scoop of cinnamon ice cream alongside and drizzle over the chocolate sauce."]}, {"isVegetarian": true, "title": "Cinnamon French toast with peaches", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_84863", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz milk", "1 free-range egg", "pinch ground cinnamon", "1 soda farl, cut in half", "30g/1oz butter", "50g/1¾oz caster sugar ", "1 vanilla pod, cut in half ", "100ml/3½fl oz white wine ", "1 peach, cut into wedges", "honey, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the French toast, place the milk, egg and cinnamon into a bowl and mix well. ", "Dip the soda farl halves into the egg mixture until soaked.", "Heat the butter in a frying pan and cook the soda farls for 2-3 minutes on each side, or until golden-brown. Set aside and keep warm.", "For the peaches, place the caster sugar, split vanilla pod and white wine into a saucepan and bring to the boil. Add the peach pieces to the pan and simmer for 4-5 minutes, or until the peach is tender.", "To serve, place the French toast onto a serving plate. Remove the peaches from the syrup with a slotted spoon and place on top of the toast, drizzled with honey."]}, {"isVegetarian": true, "title": "Cinnamon French toast with Chantilly cream and redcurrant sauce", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90386", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "100ml/3½fl oz double cream", "100ml/3½fl oz milk", "1 tbsp icing sugar", "½ tsp ground cinnamon", "2 slices white bread", "25g/1oz butter", "150ml/5fl oz double cream", "1 tbsp icing sugar", "85g/3oz redcurrants", "50ml/2fl oz red wine", "1 tbsp icing sugar", "sprig redcurrants", "fresh mint sprig"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the French toast, whisk the eggs in a bowl together with the cream, milk, icing sugar and cinnamon until well combined. Soak the bread slices in the mixture. ", "Melt the butter in a frying pan and fry the soaked bread for 2-3 minutes on both sides, or until golden-brown and crisp. Remove the fried bread from the pan and drain on kitchen paper.", "For the cream, lightly whip the cream with the icing sugar until soft peaks form when the whisk is removed from the bowl. ", "For the redcurrant sauce, place the redcurrants, wine and icing sugar in a food processor and blend until smooth. Push the mixture through a sieve to remove any pips. ", "To serve, place the French toast on a plate, top with the cream and spoon around the redcurrant sauce. Garnish with the redcurrant sprig and mint."]}, {"isVegetarian": true, "title": "Cinnamon French toast with honey, cream and orange", "url": "www_bbc_co_uk_food_recipes_cinnamonfrenchtoastw_90685", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg", "150ml/5fl oz milk", "1 tbsp caster sugar", "½ tsp ground cinnamon", "2 slices white bread", "25g/1oz butter", "1 orange, peeled and sliced", "icing sugar, for dusting", "2 tbsp clear honey", "3 tbsp double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg, milk, sugar and cinnamon together in a bowl until well combined, then soak the bread slices in the mixture.", "Melt the butter in a frying pan, add the bread slices and fry for 1-2 minutes on both sides, or until golden-brown all over. ", "To serve, arrange the orange slices on a serving plate, place the toast on top and dust with icing sugar. Drizzle over the honey and cream."]}, {"isVegetarian": true, "title": "Cinnamon oranges with baked meringue", "url": "www_bbc_co_uk_food_recipes_cinnamonorangeswithb_87126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 oranges, peeled and segmented", "¼ tsp ground cinnamon", "3 free-range egg whites", "100g/3½oz caster sugar", "icing sugar, to dust", "fresh mint sprigs, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Divide the oranges between two large dessert glasses and sprinkle over the cinnamon.", "In a large clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed.", "Gradually add the caster sugar, whisking continuously until the mixture is thick and glossy.", "Pipe or spoon the meringue mixture into the glasses to cover the oranges. Use a mini-blowtorch to brown the meringue all over.", "To serve, dust with icing sugar and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Cinnamon puff with caramelised oranges", "url": "www_bbc_co_uk_food_recipes_cinnamonpuffwithcara_84454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz ready-rolled puff pastry", "1 tsp ground cinnamon", "2½ tbsp caster sugar", "150ml/¼pt double cream", "squeeze orange juice", "2 tsp icing sugar", "½ vanilla pod, seeds scraped out", "1 orange, peeled and segmented"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut a 6in triangle out of the ready-rolled puff pastry. Place onto a baking sheet and sprinkle with the cinnamon and half a tablespoon of the caster sugar. Place into the oven to cook for ten minutes.", "Place the cream, orange juice, icing sugar and vanilla seeds into a bowl, and whisk until the mixture forms soft peaks when the whisk is removed.", "Place the orange segments onto a baking sheet, sprinkle with the rest of the sugar and using a mini-blow torch,caramalise the sugar for two minutes, or until golden. ", "To serve, place the oranges onto a serving plate, place some cream on top and then the cooked cinnamon pastry."]}, {"isVegetarian": true, "title": "Cinnamon-spiced pear tatin", "url": "www_bbc_co_uk_food_recipes_cinnamonspicedpearta_93210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "½ tsp salt", "250g/9oz cold butter, cut into small cubes", "125ml/4½fl oz ice-cold water", "4 pears, peeled, cores removed, cut in half", "110g/4oz caster sugar", "1 lemon, zest only", "2 vanilla pods, split, seeds scraped out (seeds only)", "110g/4oz butter", "150ml/5fl oz double cream", "2 star anise", "½ tsp ground cinnamon", "500ml/18fl oz vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour and salt into a large mixing bowl. Add the butter and use your hands to rub the butter into the flour. ", "When the flour and butter mixture resembles breadcrumbs, add the cold water. Mix it in with a palette knife to keep the mixture cool. When the mixture comes together to form a dough, turn it out onto a clean, floured surface and knead briefly until just smooth.", "Form the dough into a rectangular block (this will make it easier to roll out later), wrap in cling film and refrigerate for 20 minutes.", "Roll the chilled dough out onto a clean, floured surface into a rectangle about 40x20cm/16inx8in. Fold one-third of the dough into the centre, then fold the other third over that.", "Give the pastry a quarter turn and repeat step 4.", "Wrap the pastry block in cling film, refrigerate for 20 minutes then repeat steps 4 and 5.", "Wrap the pastry block in cling film and refrigerate for 30 minutes before using.", "Meanwhile, for the pear tatin, preheat the oven to 200C/400F/Gas 6.", "Place the pears, 25g/1oz of the sugar and all of the lemon zest and vanilla seeds into a saucepan. Fill the saucepan with enough water to just cover the pears. Heat the pears over a gentle heat until the mixture is simmering. Simmer for 15 minutes, or until the pears are just tender. Drain the pears and pat dry.", "Heat the remaining 85g/3oz of sugar in a 24cm/9½in ovenproof frying pan over a low heat until is has caramelised. Add the butter, cream, star anise and cinnamon to the pan and heat gently until the mixture forms a smooth caramel. Discard the star anise.", "Place the pears into the caramel, cut-side up. ", "Roll the chilled pastry out onto a floured surface to a 0.5cm/¼in thickness. Cut the pastry into a circle slightly larger than the frying pan.", "Place the pastry circle over the pears, tucking the edges of the pastry inside the pan to surround the pears.", "Transfer to the oven to bake for 20-25 minutes, or until the pastry is risen and golden-brown and cooked through. Once cooked, remove the pear tatin from the oven and set aside to cool for 5-10 minutes.", "To serve, invert the tarte tatin onto a serving plate. Slice the tatin into wedges and place a slice onto each of 4 serving plates. Top each slice with a scoop of vanilla ice cream."]}, {"isVegetarian": true, "title": "Cinnamon sponge pudding with perry custard", "url": "www_bbc_co_uk_food_recipes_cinnamonspongepuddin_81026", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz butter, softened, plus extra for greasing", "110g/4oz caster sugar", "2 large free-range eggs, beaten", "110g/4oz self-raising flour", "3 tbsp milk", "salt", "1 tsp ground cinnamon", "3 tbsp golden syrup", "250ml/8¾fl oz milk", "250ml/8¾fl oz double cream", "100ml/3½fl oz perry", "1 vanilla pod, split", "8 free-range egg yolks", "75g/2½oz caster sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a clean bowl, cream together the butter and sugar until pale and fluffy, then gradually beat in the eggs one by one.", "Sift the flour and fold it into the creamed mixture with the milk, salt and cinnamon.", "Grease a 1-litre/1¾-pint pudding basin and spoon in the golden syrup.", "Pour the batter mixture on top of the syrup and cover with buttered greaseproof and foil and tie with string. Place on a trivet in a large pot with water to steam. Steam for 1½ hours.", "While this is steaming make the perry custard.", "Heat the milk with the cream, perry and vanilla pod and bring slowly to the boil. Remove from the heat.", "Beat the yolks in a separate clean bowl with the heated cream mixture and add the sugar until well blended. As the egg yolks warm, the cream will thicken to create custard. Keep stirring until the custard is thick enough to coat the back of a spoon.", "Once the sponge pudding has steamed, turn it upside down on a plate and shake gently. Serve with the custard."]}, {"isVegetarian": false, "title": "Summer berry cheesecake", "url": "www_bbc_co_uk_food_recipes_citrus_and_ginger_58132", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrus_and_ginger_58132_16x9.jpg", "ingredients": ["100g/3½oz butter, melted, plus extra for greasing", "300g/10½oz gingernut biscuits", "3 sheets leaf gelatine", "500g/1lb 2oz mascarpone", "1 lemon, zest and juice", "200ml/7fl oz double cream, lightly whipped", "175g/6oz golden caster sugar", "2 tbsp cold water", "4 tbsp ready-made lemon curd", "450g/1lb summer berries", "few mint sprigs", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Grease the base and sides of a 23cm/9in spring-form cake tin with a little melted butter and line with greaseproof paper.", "Chop the gingernuts in a food processor until they resemble breadcrumbs (alternatively, place them into a resealable freezer bag and bash with a rolling pin).", "Transfer the biscuit crumbs to a bowl and stir in the melted butter until well combined. Spoon the mixture into the prepared cake tin and press down into an even layer using the back of a wooden spoon. Chill in the fridge until needed.", "Meanwhile, soak the gelatine leaves in a bowl of cold water until pliant, about 10 minutes.", "Fold the mascarpone, lemon zest, lightly whipped double cream and caster sugar together in a mixing bowl until just combined.", "Heat the lemon juice and two tablespoons of water in a non-reactive saucepan over a low heat. Once pliant, squeeze any excess water from the gelatine leaves and add them to the warm lemon juice, stirring to dissolve.", "Fold the lemon and gelatine mixture into the mascarpone mixture until well combined. Marble through the lemon curd, a spoonful at a time.", "Pour the mixture on top of the cheesecake base, smoothing the top with a palette knife. Cover with cling film and chill in the fridge until set, preferably overnight.", "To serve, carefully remove the cling film and spring-form surround from the cheesecake and place onto a serving plate or cake stand. Top with a few summer berries, garnish with mint sprigs and dust lightly with icing sugar. Serve immediately."]}, {"isVegetarian": true, "title": "Citrus meringue pie", "url": "www_bbc_co_uk_food_recipes_citrus_meringue_11337", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "50g/1¾oz cocoa powder", "50g/1¾oz icing sugar", "150g/5½oz butter, chilled and diced", "1 free-range egg yolk", "pinch salt", "chilled water", "3 large oranges, zest and juice", "1 pink grapefruit, zest and juice", "75g/2½oz cornflour ", "500ml/18 fl oz freshly boiled water", "4 free-range egg yolks", "150g/5½oz caster sugar", "5 free-range egg whites ", "225g/7oz caster sugar", "½ tsp cream of tartar", "100g/3½oz shelled hazelnuts, toasted and lightly crushed or broken up"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry case, preheat the oven to 190C/170C Fan/Gas 5. Either blend the flour, cocoa, icing sugar and butter in a food processor or rub in by hand until the mixture resembles fine breadcrumbs. ", "Add the egg yolk and a pinch of salt. You might find that the mixture already clumps together – if so, you will not need to add any water. If it still seems a bit dry when you squeeze some between your fingers, add up to a tablespoon of water. Form into a ball, wrap in cling film and chill for at least half an hour.", "To make the filling, zest one of the oranges and the grapefruit. Put in a bowl, then add all the juice from the oranges and grapefruit, along with the cornflour. Whisk the cornflour into the juice until you have a very thin paste. Bring the water back to the boil in a saucepan, then whisk in the citrus and cornflour mixture. ", "Stir over a medium heat until it has the consistency of a thick custard. Remove from the heat and cool slightly. Beat the egg yolks and sugar together, then add this to the citrus mixture. Stir to combine, then cover with clingfilm, making sure the clingfilm touches the custard to stop a skin forming, then chill in the fridge.", "Roll out the pastry and use to line a 23-24cm/8½-9½ in tart case. Prick all over with a fork, then line with baking parchment and fill with baking beans. Bake in the preheated oven for 15 minutes, then remove the beans and bake for a further 5 minutes. Reduce the oven temperature to 180C/160C Fan/Gas 4.", "When the filling is completely chilled, scrape it into the pastry case. Whisk the egg whites until they are just starting to form stiff peaks, then continue to whisk, adding the sugar a tablespoon at a time. When it is stiff and glossy, add the remaining sugar and the cream of tartar. Finally, fold in the toasted hazelnuts. Pipe or pile the meringue over the filling.", "Bake in the oven for around 20 minutes, or until the meringue is a dappled golden-brown. Cool before eating."]}, {"isVegetarian": false, "title": "Citrus jerk chicken with cornmeal waffles", "url": "www_bbc_co_uk_food_recipes_citrus_jerk_chicken_with_93427", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": [" 2 onions, finely chopped", " 6 garlic cloves, crushed ", " 5cm/2in piece fresh ginger, peeled and grated", "handful fresh parsley, finely chopped", "handful fresh coriander finely chopped", " 2 limes, juice only", " 2 lemons, juice only", " 2 oranges, juice only", " 1 scotch bonnet chilli pepper, finely chopped", " 4 tbsp soy or tamari sauce", " 1 tsp ground nutmeg", "handful fresh thyme, leaves picked and finely chopped", " 1 tbsp English mustard", " 1 tsp ground allspice", " 5 tbsp rum", " 1tbsp freshly ground black pepper", " 1tbsp ground sea salt", " 2tbsp olive oil", " 10 chicken pieces, thighs and drumsticks", " 150g/5½oz runny honey", "2 tbsp baking powder", "1 tbsp vinegar", "500g/1lb 2oz plain four", "500g/1lb 2oz finely ground cornmeal", "6 tsp sugar", "3 free-range eggs, beaten", "500ml/18fl oz whole milk", "handful lamb’s lettuce", "1 orange, peeled and segmented"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the citrus jerk chicken, place all the ingredients, except the chicken pieces, into a large bowl and mix well. Place the chicken pieces into the marinade and cover with cling film. Leave to marinate in the fridge for at least an hour, preferably overnight. ", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Transfer the chicken to a large baking tray and sit skin-side up. Roast the chicken in the middle of the oven for around 30–40 minutes; check it after 15–20 minutes and turn the pieces to make sure it’s cooking evenly. When the chicken is golden, and the juices are running clear, it is cooked. Drizzle the honey over the chicken pieces and roast for a further 10 minutes.", "To make the cornmeal waffles, preheat a waffle maker and mix the baking powder and vinegar to a smooth paste. ", "Whisk the flour, cornmeal, sugar, eggs and milk together in a bowl and stir in the vinegar and baking powder mixture. Pour the mix into the hot waffle maker and cook for around 6 minutes, or until golden-brown. Alternatively, heat a heavy-bottomed frying pan over a medium heat, add a splash of oil and fry the batter in batches, like pancakes. ", "To serve, divide the chicken between four plates and serve a waffle with each. Garnish with some lamb’s lettuce and orange segments. "]}, {"isVegetarian": true, "title": "Citrus and honey microwave sponge", "url": "www_bbc_co_uk_food_recipes_citrusandhoneysponge_84015", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, zest peeled and flesh finely sliced", "1 orange, zest peeled and flesh finely sliced", "110g/4oz caster sugar", "110g/4oz self-raising flour", "125g/4½oz soft butter, plus extra to grease", "1 free-range egg", "2 tbsp honey, plus 1 tbsp extra"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the orange and lemon zests, sugar, flour, butter, egg and honey into a food processor and blend until a smooth sponge batter is formed. ", "Grease a small oven proof bowl with butter and brush with the extra honey. Line the bowl with the orange and lemon slices.", "Pour the sponge batter into the lined bowl and cover with cling film.", "Place the bowl in a microwave and cook on full power for five minutes, or until the sponge is cooked through."]}, {"isVegetarian": false, "title": "Citrus spiced salmon", "url": "www_bbc_co_uk_food_recipes_citrus_spiced_salmon_69209", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrus_spiced_salmon_69209_16x9.jpg", "ingredients": ["4 tbsp dried edible rose petals, finely ground", "2 tsp sumac", "1 tsp dried lime powder", "1 tsp ground cumin ", "½ tsp ground cinnamon ", "1 orange, zest only", "1 lime, zest only", "3–6 tbsp olive oil", "4 x 150g/5oz skinless salmon fillets", "sea salt and freshly ground black pepper", "1 lemon cut into 6 wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking paper. ", "Combine the ground rose petals, spices, orange zest and lime zest in a small bowl. Add the olive oil and stir well to form a wet marinade for the salmon. ", "Rub each salmon fillet well with the marinade and place on the tray. (At this stage you can cover with clingfilm and leave overnight in the refrigerator to marinate, if you wish). Once all the fillets are well coated in the marinade, season generously with sea salt and black pepper.", "Bake for 10-12 minutes, or until the fish is cooked through. Serve with lemon wedges.    "]}, {"isVegetarian": false, "title": "Citrus-crusted chicken breasts with potato latkes", "url": "www_bbc_co_uk_food_recipes_citruscrustedchicken_93143", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lime, zest and juice only, plus zest of 1 extra lime", "2 tsp cracked black pepper", "2 garlic cloves, crushed to a paste with the edge of a knife", "1 tsp sea salt flakes", "2 tsp thyme leaves", "6 tbsp olive oil", "100g/3½oz smoked streaky bacon, chopped", "6 chicken breasts, skin scored three to four times", "1kg/2lb 3oz floury potatoes, such as King Edward or Maris Piper, peeled", "2 onions, peeled, chopped", "2 large free-range eggs, beaten", "2 tsp salt", "1 tsp freshly ground black pepper", "1-2 tbsp vegetable oil, for shallow frying", "green salad"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the citrus-crusted chicken breasts, place the lime zest, black pepper, garlic, sea salt and thyme into a mortar and pound to a paste with a pestle. Add four tablespoons of the olive oil and all of the lime juice. Mix well and set aside.", "Heat the remaining two tablespoons of olive oil in a frying pan over a medium heat. Add the chopped bacon and fry until the fat is released. ", "Add the chicken breasts and fry for 2-3 minutes on each side, or until browned on both sides. (When the chicken has browned, discard the cooked bacon or reserve it for another recipe. In this recipe it is only used as cooking fat, for flavour.)", "Transfer the browned chicken breasts to a roasting tray, skin-side up, then brush each all over with the citrus paste.", "Roast the chicken breasts in the oven for 18-20 minutes, basting frequently with the cooking juices and any remaining citrus paste, until cooked through. (NB: The chicken is cooked through when the juices run clear when the chicken breasts are pierced in the thickest part with a skewer.) ", "Remove the citrus-crusted chicken breasts from the oven and set aside to rest for 10 minutes before serving. ", "Meanwhile, for the potato latkes, grate the potatoes and onions into a clean tea towel. Gather up the edges of the tea towel, then squeeze any excess moisture from the potatoes and onions.", "Place the potato and onion mixture into a bowl and add the beaten eggs, salt and freshly ground black pepper. Mix well. ", "Heat the vegetable oil in a frying pan over a medium heat. Place a large spoonful of the potato and onion mixture into the pan and spread it out into a round approximately 6cm/2.5in in diameter. Cook for 4-5 minutes on each side, or until golden-brown and crisp all over. ", "To serve, place one citrus-crusted chicken breast onto each of six serving plates and spoon the potato latkes alongside. Serve with a lightly dressed green salad."]}, {"isVegetarian": true, "title": "Citrus and pomegranate salad with chilli-honey dressing", "url": "www_bbc_co_uk_food_recipes_citrusandpomegranate_92667", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrusandpomegranate_92667_16x9.jpg", "ingredients": ["5 tsp white wine vinegar", "4 tsp clear honey", "salt and freshly ground black pepper", "5 tbsp extra virgin olive oil", "1 small red chilli, cut in half, seeds removed, finely chopped", "4 small oranges, peeled, pith removed, segmented", "2 ruby grapefruit, peeled, pith removed, segmented", "1 plain grapefruit, peeled, pith removed, segmented", "1 small red onion, peeled, very finely sliced", "bunch fresh mint leaves, torn", "1 pomegranate, seeds only, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli-honey dressing, mix together the vinegar and honey in a shallow serving bowl until well combined. Season, to taste, with salt and freshly ground black pepper. Gradually whisk in the oil, using a fork, then add the chilli and whisk again. Add more vinegar or oil, to taste.", "For the salad, arrange the segmented fruit in a broad shallow bowl.", "Sprinkle over the onion and mint, then pour over the chilli-honey dressing and mix well until it coats the salad.", "Just before serving, sprinkle the pomegranate seeds over the salad."]}, {"isVegetarian": true, "title": "Citrus sizzler frisée - lettuce, watercress, cucumber and orange segments", "url": "www_bbc_co_uk_food_recipes_citrussizzlerfrissel_6546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 frisée lettuce leaves", "2.5cm/1in piece of cucumber, sliced", "4-5 orange segments", "mayonnaise (check it uses free range eggs or is egg free) or a drizzle of", "sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Toss salad ingredients together and fill roll. ", "Add dressing."]}, {"isVegetarian": true, "title": "Citrus sponge with apricots poached in cardamom syrup", "url": "www_bbc_co_uk_food_recipes_citrusspongewithapri_88901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "150g/5½oz butter, plus extra for greasing", "150g/5½oz self-raising flour", "½ tsp baking powder", "3 free-range eggs", "1 lemon, zest only", "100g/3½oz caster sugar", "100ml/3½fl oz white wine", "4 cardamom pods, lightly crushed", "1 vanilla pod, split", "55g/3oz dried apricots"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the citrus sponge, place the sugar and butter into a food processor and blend until combined.", "Add the flour and baking powder and blend again.", "Add the eggs and lemon zest and blend until smooth.", "Spoon equal quantities of the cake batter into two greased microwave-safe ramekins (to half-fill) and cover with cling film before microwaving at full power for 3½ minutes, or until risen and cooked through.", "For the syrup, place the sugar and wine into a small pan over a medium heat and bring to the boil.", "Add the cardamom, vanilla pod and apricots and reduce the heat to simmer for 5-6 minutes, or until the liquid has reduced and is slightly syrupy.", "To serve, turn the sponges out onto serving plates. Spoon the apricots and syrup over the sponges."]}, {"isVegetarian": false, "title": "Citrus syrup-glazed duck breast with fragrant rice salad", "url": "www_bbc_co_uk_food_recipes_citrussyrupglazedduc_90447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ duck breast", "salt and freshly ground black pepper", "1 orange, juice only", "1 lime, juice only", "1 tbsp soy sauce", "2 tbsp golden syrup", "85g/3oz long grain rice", "400ml/14fl oz vegetable stock", "25g/1oz green beans, trimmed and chopped", "¼ red pepper, chopped", "salt and freshly ground black pepper", "fresh coriander leaves", "1 slice orange"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, trim the edges of the fat and score the skin with the tip of a sharp knife. Season well with salt and freshly ground black pepper. Heat a frying pan until smoking then add the duck, skin-side down, and fry for 3-4 minutes to render some of the fat. Turn the duck over.", "In a bowl, mix together the remaining duck ingredients and pour over the duck. Cook for 2-3 minutes, or until the liquid is thick and glossy. ", "For the rice, place the rice into a pan with the stock, green beans and red pepper. Bring to the boil and cook for 10-12 minutes, or until the rice is tender. Drain, season with salt and freshly ground black pepper and pack into a small greased glass bowl, then turn out onto a serving plate. ", "Slice the duck, arrange next to the rice and drizzle over the juices from the pan. Garnish with fresh coriander and orange to serve."]}, {"isVegetarian": true, "title": "Citrus tart with rich shortcrust pastry", "url": "www_bbc_co_uk_food_recipes_citrustartwithrichsh_90187", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/citrustartwithrichsh_90187_16x9.jpg", "ingredients": ["2 free-range eggs", "2-3 tbsp cold water", "225g/8oz plain flour, plus extra for flouring", "110g/4oz unsalted cold butter, diced", "pinch salt", "4 large free-range eggs", "1 free-range egg yolk", "200g/7oz caster sugar", "2 lemons (preferably unwaxed), grated zest and juice", "1 lime (preferably unwaxed), grated zest and juice", "200ml/7fl oz double cream", "icing sugar, for dusting", "fresh raspberries", "thick cream"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, separate the eggs. Add 2-3 tbsp cold water to the egg yolks and stir with a fork. (You can use the egg whites for another dish or freeze them.)", "Place the flour into the bowl of a food processor, followed by the cold butter and the salt.", "Turn the processor on and pulse several times until the mixture resembles fine breadcrumbs.", "Add two-thirds of the egg yolk/water mixture and pulse again. If the mixture is still too dry, add the remaining egg and water mixture (you may not need to use all of it). Be careful not to overwork the pastry. Stop pulsing when the mixture has the consistency of chunky breadcrumbs.", "Turn the pastry out onto a clean, floured work surface and, with floured hands, bring together to make a smooth dough, but don't knead.", "Shape into a flattened ball, wrap in cling film and refrigerate for about 10-15 minutes. You can keep the pastry at this stage for 2-3 days if not using it immediately.", "Remove the pastry from the fridge. On a clean, floured work surface, roll it out with a floured rolling pin until it's slightly larger than the flan ring. Using the rolling pin, lift the pastry and lay it over the flan ring.", "With your fingers, lightly press the pastry into the sides of the ring. Run a rolling pin over the top of the ring and pull away the excess pastry at the edges. Using your fingers, gently press the pastry up to slightly build up the height of the pastry at the edges. Prick the base of the pastry with a fork.", "Make a cartouche (a circle of greaseproof paper) slightly larger than the base of the flan tin and line the pastry case with it. Place some ceramic baking beans inside to weigh the pastry down. Place in the fridge to relax for about 20 minutes.", "Preheat the oven to 200C/400F/Gas 6. Place the pastry in the oven and bake blind for about 20 minutes. Remove the paper cartouche and baking beans for the final five minutes to crisp up the pastry.", "Make the filling by whisking the eggs, egg yolk and sugar together until smooth and foaming, with a hand whisk or with an electric whisk. This will take 5-10 minutes.", "Zest and juice the lemons and lime. Put the juice and zest into a bowl and mix together well. Whisk the cream into the egg and sugar mixture, then pour the lemon and lime juice and zest into the cream mixture. The acidity in the citrus will thicken the cream. Mix gently.", "Using a jug, pour the filling mixture into the prepared pastry case, while it's still on the oven rack. Reduce the temperature to 150C/300F/Gas 2 and bake for about 50 minutes, or until just set.", "Remove the tart from the oven and allow to cool completely before chilling in the fridge. Carefully remove the flan ring. Dust with icing sugar just before serving.", "Serve with fresh raspberries and thick cream."]}, {"isVegetarian": true, "title": "Éclairs", "url": "www_bbc_co_uk_food_recipes_clairs_18413", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz plain flour or strong white flour", "pinch salt", "75g/2½oz butter ", "4 free-range eggs", "200g/7oz icing sugar", "25g/1oz cocoa powder", "50g/1¾oz icing sugar, sifted", "1 tsp vanilla extract", "400ml/14fl oz whipped cream, whipped volume (about 200ml/7fl oz unwhipped double cream)"], "serves": "Makes 25 éclairs", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, sift the flour and a pinch of salt into a large bowl and set aside. ", "Put 150ml/5½fl oz water and the butter into a saucepan set over a medium-high heat and stir until the butter melts. Allow the mixture to come to a rolling boil, then immediately remove the pan from the heat. ", "Add the flour and salt and beat very well with a wooden spoon until the mixture comes together. ", "Reduce the heat to medium and replace the saucepan over the heat. Stir for a minute until the mixture starts to slightly stick to the base of the pan. Remove from the heat and allow to cool for a minute. ", "Beat three eggs together and pour about one-quarter of the beaten egg into the pan. Using the wooden spoon, beat very well until incorporated. Add a little more egg and beat well again until the mixture comes back together. Continue to add the egg, beating vigorously all the time, until the mixture has softened, is nice and shiny and has a dropping consistency. You may not need to add all the egg or you may need a little extra. If the mixture is too stiff (not enough egg) then the choux pastries will be too heavy, but if the mixture is too wet (too much egg), they will not hold their shape when spooned onto baking paper. ", "Preheat the oven to 220C/425F/Gas 7. Line a baking tray with parchment paper (not greaseproof paper, as the éclairs may stick when cooked).", "Place the dough into a piping bag fitted with the 5-8mm/¼ - 3/8in nozzle and pipe into lengths approximately 10cm/4in long onto the prepared baking tray, spaced about 4cm/1½in apart to allow for expansion. Use a small wet knife to stop the dough coming out when you have finished piping each éclair.", "Beat the remaining egg and gently brush it over the éclairs. Bake in the oven for ten minutes, then reduce the oven temperature to 200C/400F/Gas 6 and continue to cook for a further 15–20 minutes, or until the éclairs are puffed up, golden-brown and crisp.", "Remove the éclairs from the oven and, using a skewer or the tip of a small sharp knife, make a hole in the side or the base of each éclair. Return to the oven and bake for a further five minutes to allow the steam to escape. Transfer the éclairs to a wire rack to cool.", "For the chocolate glacé icing, sift the icing sugar and cocoa powder into a bowl. Add 1-2 tablespoons of boiling water and stir to mix, adding a little more boiling water if necessary until the icing is spreadable but not too watery.", "For the crème Chantilly filling, fold the sifted icing sugar and vanilla extract into the whipped cream. Chill in the fridge until you are ready to use it.", "When the éclairs are cool, spoon the crème chantilly into a clean piping bag fitted with the small, plain nozzle and pipe the cream into the éclairs through the hole made during cooking until they are well filled.", "Using a small palette knife or table knife that has been standing in a jug of hot water (to make spreading the icing easier), spread the icing over the top of each éclair, dipping the knife into the hot water between each éclair. Serve."]}, {"isVegetarian": false, "title": "Clam chowder in sourdough bowls", "url": "www_bbc_co_uk_food_recipes_clam_chowder_in_26359", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 sourdough rolls or crusty rolls (roughly12cm/4½in diameter), tops removed, dough scooped out and discarded", "1kg/2lb 4oz fresh clams, scrubbed", "225g/8oz waxy potatoes, peeled and diced into 1.5cm/⅝in cubes", "40g/1½oz unsalted butter", "75g/2¾oz smoked streaky bacon, finely chopped", "1 small onion or banana shallot, finely chopped", "1 leek, cleaned, halved lengthways and finely chopped", "2 sticks celery, roughly chopped", "30g/1oz plain flour", "500ml/18fl oz whole milk", "200ml/7fl oz double cream", "1 bay leaf", "200g/7oz cod fillet (or other white fish), skin removed, cut into 2cm/¾in pieces", "1 tsp salt", "10 turns black peppermill", "pinch freshly grated nutmeg", "small handful flat-leaf parsley or chives, roughly chopped, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Bring 250ml/9fl oz water to the boil in a large, shallow pan. Add the clams, place a lid on and allow steam for 3 –4 minutes until they open. Set a colander over a large bowl and drain the clams, reserving the cooking liquor. When the clams are cool enough to handle, remove the meat from the shells and set aside. ", "Bring a saucepan of salted water to the boil and cook the potatoes for 5–10 minutes until tender. Drain and set aside. ", "Melt the butter in a large saucepan over a medium heat and fry the bacon, onion or shallot, leek and celery until soft. Stir in the plain flour and cook for 1 minute. Add the clam cooking liquor and stir until thickened. Add the milk, cream, bay leaf, potatoes and cod. Bring to the boil then turn the heat down and simmer for 5 minutes until the cod is cooked. Add the clam meat and season with the salt, pepper and nutmeg. ", "Spoon the chowder into the hollowed-out bread rolls and garnish with chopped parsley or chives."]}, {"isVegetarian": false, "title": "Clam udon with dashi", "url": "www_bbc_co_uk_food_recipes_clam_udon_with_dashi_35620", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sheet kombu seaweed (about 100g/3½oz in weight) ", "10g dried shiitake mushrooms ", "250g/9oz smoked bacon, such as pancetta, skin on ", "3 tbsp mirin, or to taste", "2 tbsp sake, or to taste", "2 tbsp soy sauce, or to taste", "10g bonito flakes (available online)", "salt", "100ml/3½fl oz rice vinegar ", "50g/1¾oz caster sugar", "1 tsp coriander seeds ", "50g/1¾oz samphire", "50g/1¾oz sea aster ", "500g/1lb 2oz palourde clams, washed", "1 tbsp vegetable oil", "1 garlic clove, finely diced", "2 banana shallots, finely diced", "125ml/4fl oz dry white wine", "1 tbsp unsalted butter", "2 packs (about 600g/1lb 5oz) fresh udon noodles", "500g/1lb 2oz palourde clams, washed", "1 tbsp vegetable oil", "1 garlic clove, finely diced", "2 banana shallots, finely diced", "125ml/4fl oz dry white wine", "1 tbsp unsalted butter", "2 packs (about 600g/1lb 5oz) fresh udon noodles", "edible flowers"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the dashi, put the kombu and shiitake mushrooms in a medium saucepan with about 800ml/1⅓ pint cold water. Bring to a gentle simmer for 30 minutes. Remove the kombu and add the bacon and simmer for 30 minutes. Season the dashi with mirin, sake, soy sauce, and salt to taste. Set aside, keep warm and add the bonito flakes just before serving. ", "For the pickled vegetables, put the vinegar, sugar, coriander seeds and 200ml/7fl oz water in a saucepan and bring to the boil. Cook until the sugar has dissolved then chill. Put the sea vegetables in a sterilised jar, pour in the pickling liquor and set aside until picked, around 5–10minutes. ", "For the clams, discard any open shells that don’t close after a good tap. ", "Heat the oil in a saucepan over medium heat, sweat the garlic and shallots until they turn translucent. Increase the heat and quickly add the clams. Add the wine and cover. Give it a couple of shakes to spread the clams around and help them open. Once the clams have opened, about 2–3 minutes, scoop them out with a slotted spoon and set aside. Continue to cook until the liquid has reduced by half. Add the butter and mix. ", "Add the udon to the sauce and cook for 2–3 minutes, add the clams and mix. Season with salt.", "Divide the udon and clams between bowls, sprinkled over the togarashi and top with the pickled sea vegetables. Pour the dashi gently over the udon, garnish with edible flowers and serve. "]}, {"isVegetarian": false, "title": "Clam chowder and potatoes", "url": "www_bbc_co_uk_food_recipes_clamchowderandpotato_75308", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 8oz fresh live clams", "2 tbsp onion, chopped", "2 tbsp leek, chopped", "2 tbsp carrot, chopped", "sprig of fresh parsley", "sprig of fresh thyme", "180ml/6fl oz white wine", "1 medium onion, finely chopped", "2 tbsp unsalted butter", "2 large potatoes peeled and roughly diced", "250ml/9fl oz water, fish stock, or light chicken stock", "200ml/7fl oz double cream", "cream, whipped", "1 tbsp fresh parsley, chopped"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the clams under cold running water. ", "Put the aromatics - chopped onion, leek, carrot, parsley and thyme into a large pot, add 400ml/14fl oz of water and simmer for 10 minutes to infuse the flavour. Add the wine, and bring to a boil.", "Add the clams, cover and cook, boiling quickly until the clams open, this just takes a minute or two.  Drain them into a colander, being sure to catch the cooking liquid in a bowl underneath.  This will be used in the chowder.  ", "Set aside while you pull the clams from their shells. Discard the shells, and the sprigs of parsley and thyme. Keep the clams and the chopped vegetables, the aromatics, and place them in to the reserved broth.", "To make the chowder, sauté the onion in two tablespoons of unsalted butter, over medium heat in a large pot until it is soft and transparent.  Add the water or stock and bring to a simmer.  ", "Add the potatoes to the pot, and simmer gently until the potatoes are cooked.", "Take half of this potato mixture and blend in a food blender, or food processor. This will give you a thick, creamy soup which will thicken the whole chowder.", "Combine the two potato mixtures, the clams in their juices and cooking broth, and the cream, and bring to a simmer. ", "Taste for seasoning, and serve at once, garnishing with the chopped parsley, and if desired, a dollop of whipped cream."]}, {"isVegetarian": false, "title": "Clam chowder", "url": "www_bbc_co_uk_food_recipes_clamchowder_87459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz clams ", "75ml/3fl oz water", "25g/1oz butter", "50g/2oz thickly sliced bacon, chopped", "110g/4oz onions, chopped", "225g/8oz potatoes, chopped ", "300ml/10fl oz milk", "125ml/4½fl oz double cream", "1 bay leaf", "pinch grated nutmeg", "salt and freshly ground white pepper", "1 tbsp roughly chopped fresh flatleaf parsley ", "sourdough bread, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clean the clams and discard any which do not close when tapped.", "Heat a large lidded frying pan until hot, add the clams and the water and bring to the boil. Cover with a lid and cook for 2-3 minutes, or until all the clams have opened - discard any which remain closed.", "Strain the clams, reserving the cooking liquour. Remove all the clams from their shells and set aside, discarding the shells.", "Heat the butter in another deep frying pan, add the bacon and fry for 2-3 minutes, or until browned.", "Add the onions and cook for another 2-3 minutes until just softened.", "Add the potatoes along with the milk, cream, bay leaf, nutmeg and cooking liquor from the clams. Bring to the boil, then reduce the heat and simmer gently until the potatoes are cooked but still just firm.", "Stir in the clams and season, to taste, with salt and freshly ground white pepper.", "To serve, divide the chowder among four serving bowls, sprinkle over the parsley and serve with sourdough bread."]}, {"isVegetarian": false, "title": "Clams and mussels with an asparagus, pea and broad bean nage", "url": "www_bbc_co_uk_food_recipes_clams_and_mussels_with_60911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz clams, scrubbed and debearded", "400g/14oz mussels, scrubbed and debearded (Discard any mussels with broken shells and any that refuse to close when tapped)", "2 shallots, finely chopped", "150ml/5fl oz white wine", "1 tbsp chopped fresh parsley", "8 asparagus spears, trimmed", "1 bunch baby carrots, peeled and trimmed", "100g/3½oz fresh peas", "100g/3½oz fresh broad beans", "100g/3½oz samphire", "20g/¾oz sea aster", "1 handful sea purslane", "75g/2¾oz butter", "5 tbsp double cream", "2 tbsp olive oil", "8 scallops, shelled, cleaned, roe removed", "150g/5½oz Jerseys Royal potatoes, cooked and cut into quarters", "3 tbsp chopped fresh chervil or parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large lidded saucepan and add the clams, mussels, half of the shallots, white wine and parsley. Cook for 2-3 minutes, or until the clams and mussels have opened, discard any clams and mussels that remain closed. Drain the shellfish and reserve the cooking liquid. Pick some of the meat out of the cooked shellfish and keep some in their shells for presentation. ", "Bring a pan of water to the boil and cook the asparagus, baby carrots, peas and broad beans for 2 minutes. Add the samphire, sea aster and sea purslane for the final minute. Drain and pat dry. Set aside.", "Heat a frying pan until hot, add half the butter, once hot add the remaining shallot and cook for 1-2 minutes. Add the reserved cooking liquid and boil until the volume of liquid has reduced by half. Finish with the cream and allow to reduce by half once more. Add the meat removed from the clams and mussels to the pan.", "Heat a frying pan and add the olive oil, once hot add the scallops, cook on each side for 1-2 minutes (depending on how large they are - take care not to overcook them). Add a little butter at the end. ", "In a frying pan, add the remaining butter and fry the asparagus, baby carrots, peas, broad beans, samphire, sea aster, sea purslane and Jersey royals for about 1-2 minutes.", "To serve, spoon the vegetables onto a large serving plate and top with the scallops. Pour the sauce over and garnish with the clams and mussels in their shells and the chopped chervil."]}, {"isVegetarian": false, "title": "Clams, crab, chorizo and chilli", "url": "www_bbc_co_uk_food_recipes_clams_crab_chorizo_and_75639", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 garlic cloves, grated", "1 red chilli, chopped", "600–800g/1lb 5oz–1lb 12oz clams ", "125ml/4fl oz white wine or oloroso sherry", "2 heads pak choi, shredded", "6 large razor clams", "2 chorizo sausages, cut into strips lengthways ", "vegetable oil, for deep-frying", "100g/3½oz fine rice flour or cornflour ", "2 tsp sea salt", "1 tsp chilli flakes", "150–200ml/5–7fl oz sparkling water", "2 soft shell crabs, cut in half giving 4 pieces", "1 aubergine, cut into thin strips", "handful fresh basil leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the clams with garlic and chilli, clean the clams in cold water. Discard any open shells that do not close when given a sharp tap. Heat the oil in a large sauté pan with a lid. Cook the garlic and chilli until just starting to colour, then add the clams and wine. Cook with the lid on for a few minutes until the clams have opened. Add the pak choi, season and reserve. Discard any clams that have not opened.", "Heat the grill to high. Grill the chorizo strips alongside the razor clams for 2 minutes, until the shells have opened.", "For the soft shell crab, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Mix the flour with the salt and chilli flakes. Gradually add the sparkling water until you have a batter. Dip the crab pieces in the batter to coat them. Deep-fry for a few minutes until golden. Set aside to drain on kitchen paper.", "Coat the aubergine in batter and deep-fry until golden. Add the basil leaves to the oil and fry until crisp. Drain on kitchen paper. ", "To serve, tip the small clams, pak choi and juice into a large oval serving dish, cut the grilled chorizo into chunks on an angle and scatter about. Add the razor clams and finally the pieces of soft shell crab and aubergine and garnish with the basil."]}, {"isVegetarian": false, "title": "Clam, smoked bacon and cider broth", "url": "www_bbc_co_uk_food_recipes_clamsmokedbaconandci_93397", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "150g/5oz smoked bacon rashers, chopped", "1 dried anchovy fillet", "1 sprig fresh thyme ", "1 carrot, peeled, finely chopped", "1 stick celery, trimmed, finely chopped", "1 small leek, trimmed, finely chopped", "1 onion, peeled, finely chopped", "2kg/4lb 4oz medium clams, cleaned, (discard any clams that remain open after rinsing)", "300ml/11fl oz good-quality dry cider", "handful chopped fresh flatleaf parsley", "4 slices white crusty bread", "½ tsp sea salt", "1 garlic clove, peeled"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the oil in a lidded frying pan over a medium heat. Fry the bacon and anchovy for 2-3 minutes, or until the fat is released from the bacon.", "Add the thyme, carrot, celery, leek and onion and cook for 2-3 minutes, or until softened.", "Stir in the clams and cider and cover the pan with a lid. Bring the mixture to a simmer, then steam the clams for 2-3 minutes, or until all of the clams have opened. (Discard any clams that have not opened during cooking.) Stir in the parsley.", "Meanwhile, drizzle the remaining olive oil over the slices of bread and sprinkle over the sea salt.", "Heat a griddle pan until hot and grill the slices of bread for 1-2 minutes on each side, or until golden-brown char marks appear on both sides. Rub each slice of toast with the garlic clove.", "To serve, press a slice of charred bread into the bottom of each of 4 large serving bowls and ladle over the clam broth."]}, {"isVegetarian": false, "title": "Clam soup", "url": "www_bbc_co_uk_food_recipes_clamsoup_85476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "1 onion, finely chopped", "½ fennel bulb, finely chopped", "150ml/¼pint vegetable stock", "4 tbsp double cream", "handful dill, chopped", "100g/3½oz canned clams, drained"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan.", "Sweat the onion until soft, but not coloured. Add the fennel bulb and cook for two minutes.", "Add the vegetable stock and bring to the boil. Simmer for 6-8 minutes or until the fennel is cooked.", "Stir in the double cream and cook until the sauce has thickened slightly. Season to taste and stir in the dill.", "Place the clams in the base of a bowl and pour over the soup to serve."]}, {"isVegetarian": false, "title": "Classic beef Wellington with a Madeira jus", "url": "www_bbc_co_uk_food_recipes_classic_beef_wellington_11495", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "pinch salt", "300g/10½oz chilled unsalted butter, 50g/1¾oz cut into cubes, the rest left in a block", "1 tsp olive oil", "1kg/2lb 4oz beef fillet (ask your butcher for the middle section)", "50-100g/1¾-3½oz butter", "4 Portobello mushrooms, cleaned and very finely chopped", "2 tbsp fresh tarragon", "150g/5½oz baby spinach leaves", "2 free-range eggs, plus 3 free-range egg yolks", "60g/2¼oz plain flour", "200ml/7fl oz milk", "150g/5½oz chicken liver pâté", "500g/1lb 2oz puff pastry, as made above", "50g/1¾ unsalted butter", "1 shallot, chopped", "50ml/2fl oz Madeira", "300ml/10fl oz concentrated beef stock (boil 568ml/1 pint beef stock until the volume has reduced by half)", "salt and freshly ground black pepper", "2 tbsp olive oil", "150g/5½oz cep mushrooms, sliced"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the flour and salt into a large bowl, add the cubes of butter and rub the butter into the flour using your fingertips, until the mixture resembles breadcrumbs.", "Gradually stir in 150ml/5fl oz cold water, until the mixture comes together as a soft dough (you may not need all the water). Use your hands to pat the dough into a 2cm/¾in thick rectangular block.", "Roll out the dough onto a lightly floured work surface to a rectangle measuring about 30x20cm/12x8in. Sandwich the remaining block of butter between two pieces of greaseproof paper. Using a rolling pin, roll or bash it out to a rectangle measuring about 15x20cm/6x8in.", "Place the flattened butter into the centre of the rolled pastry. Fold one edge of the pastry over the butter to half-cover it, then fold the other edge of the pastry over the butter to cover the other half, so that the two edges of pastry meet. Pinch together the top and bottom edges of the pastry to seal the butter inside. ", "Fold the pastry in half lengthways, then turn the pastry 90 degrees to the right (a quarter-turn). Roll out the pastry again to a rectangle measuring about 30x20cm/12x8in. ", "Fold the pastry as before, bringing each edge into the centre so that the edges meet, then folding in half lengthways, before giving the pastry a quarter-turn.", "Repeat the rolling and folding process once more, then wrap the pastry in cling film and chill in the fridge for 1 hour.", "For the beef Wellington, preheat the oven to 100C/80C Fan/Gas ½.", "Heat the oil in frying pan over a high heat. Quickly fry the beef fillet, turning it every few seconds, until browned on all sides.", "Cut 4 large pieces of aluminium foil big enough to roll the beef fillet in, and place them on top of each other. Place the beef fillet in the centre and wrap it very tightly to form a cylinder, twisting the ends to secure. Place the wrapped beef fillet on a baking tray and roast for 1 hour. Remove the beef from the oven, set aside until cooled to room temperature, then chill in the fridge until completely cold.", "Meanwhile, heat a knob of butter in a frying pan over a medium heat. When the butter is foaming, add the chopped mushrooms and tarragon and fry for 1-2 minutes, or until all of the liquid has evaporated and the mushrooms have softened. Transfer the mushrooms to a bowl and wipe the pan with a piece of kitchen roll.", "Add a little more butter to the pan and fry the spinach for 1 minute, or until just starting to wilt. Remove the pan from the heat and continue to stir the spinach until completely wilted. Transfer to a bowl and set aside.", "Next, make the pancakes. Place the 2 whole eggs and the flour in a bowl and whisk together until well combined. Gradually whisk in the milk until the mixture forms a smooth batter that is thick enough to coat the back of a spoon.", "Heat a knob of butter in a frying over a high heat. When the butter is foaming and starting to smoke, add a ladleful of the pancake batter and swirl the pan to evenly coat the base. Fry for 1-2 minutes, or until the underside of the pancake is golden-brown. Flip the pancake over and cook for a further minute, or until the pancake is cooked through and golden-brown all over. Slide the pancake out onto a plate lined with greaseproof paper, then cover it with another layer of greaseproof paper. Repeat the process with the remaining butter and pancake batter.", "Place the chicken liver pâté in a bowl and beat until smooth and soft.", "Increase the oven temperature to 230C/210C Fan/Gas 8.", "Roll out the puff pastry on a lightly floured work surface to a rectangle measuring 40x50cm/16x20in with a thickness of 2-3mm (it needs to be large enough to wrap the beef fillet).", "Arrange the pancakes all over the pastry, overlapping the edges slightly and leaving a 2½cm/1in border free at the edge. Trim the overlapping edges of the pancakes using a sharp knife so they sit in one even layer.", "Spread the softened pâté in an even layer all over the pancakes. Arrange a layer of wilted spinach on top. Spread the cooked mushrooms on top of the spinach. Season with salt and pepper. Finally, peel the foil from the beef fillet and place it in the centre.", "Whisk the egg yolks in a bowl, then brush them around the pastry border. Tightly roll the beef fillet in the pastry, ensuring the seal sits at the bottom of the Wellington. Tuck the ends underneath the Wellington without trimming them. Transfer the Wellington to a baking tray lined with baking paper and brush all over with the remaining beaten egg yolks. If desired, decorate with pastry trimmings.", "Bake the beef Wellington for 20-25 minutes (for medium beef), or until the pastry has risen and is golden-brown. Leave to rest before serving. ", "Meanwhile for the Madeira jus, heat a saucepan, once hot add the butter, once melted add the shallot and cook for 2-3 minutes. Deglaze with the Madeira and then add the stock. Cook until reduced by half.", "For the ceps, heat a large griddle pan until hot. Drizzle the oil over the mushrooms and place on the griddle pan. Cook on each side for 1-2 minutes.", "To serve, carve the beef Wellington into thick slices and place each into the centre of a serving plate. Drizzle the Madeira sauce around the edge of the plates and garnish with the ceps."]}, {"isVegetarian": false, "title": "Tarragon chicken blanquette", "url": "www_bbc_co_uk_food_recipes_classic_blanquette_du_93443", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 2oz chicken, cut into 8 pieces", "1 carrot, peeled, halved", "1 small onion, peeled, halved", "1 garlic clove", "1 large sprig thyme ", "25g/1oz butter, plus extra for frying", "25g/1oz plain flour ", "1 litre/1¾ pints chicken cooking liquor (from above)", "115g/4oz baby onions, peeled ", "115g/4oz button mushrooms, quartered ", "4 eggs, yolks only", "110ml/3¾fl oz double cream ", "2 tbsp tarragon leaves, picked", "25g/1oz butter", "2 tbsp olive oil", "400g/14oz potatoes, peeled, diced", "2 garlic cloves, finely chopped", "2 tbsp roughly chopped flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, place the chicken into a large saucepan and cover with 2.2 litres/3½ pints water. ", "Add the carrot, onion, garlic, and thyme and bring to a gentle boil, then turn down to a simmer and cook for 1¼ hours. ", "When the chicken is tender turn off the heat.  Set up a large sieve or colander over a large bowl. Strain the contents of the pan through the sieve. The bowl will collect the cooking liquor. Measure out 1 litre/1¾ pints of the liquor for the sauce and set aside. ", "Let the chicken cool slightly, until cool enough to handle, and using forks, pick the chicken meat from the bones. Set the chicken aside until needed. Discard the strained onion, carrot, garlic and thyme in the sieve.", "For the sauce, heat a thick based saucepan over a medium heat, melt the butter, then add the flour and keep stirring until the butter has been completely absorbed. ", "Gradually whisk in the reserved chicken liquor and keep stirring until all the liquor has been added. ", "Remove the pan from the heat, and allow to cool for a minute. ", "Whisk the egg yolks and cream together in a bowl then gradually add to the sauce, mixing well as you pour. Make sure the pan is off the heat at this point, otherwise the eggs will cook too quickly and curdle the sauce. ", "Heat another frying pan over a medium heat, add a little more butter and the onions and cook until coloured slightly. Then add the mushrooms and cook for a further two minutes. ", "Tip the fried onions and mushrooms into the sauce, still off the heat. Stir in the tarragon then add the chicken. Check the seasoning, adding salt and freshly ground black pepper, to taste. ", "For the potatoes, heat a frying pan until medium hot, add the butter and oil and heat until foaming.", "Add the potatoes and cook for 10 - 12 minutes until golden brown on all sides and just tender.", "Add the garlic and cook for another 30 seconds then season with salt and black pepper. Stir the parsley through the potatoes.", "To serve, place a couple of pieces of chicken onto each serving plate and spoon over the sauce. Pile some potatoes alongside."]}, {"isVegetarian": false, "title": "Classic bolognese ragù", "url": "www_bbc_co_uk_food_recipes_classic_bolognese_rag_17689", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp extra virgin olive oil ", "30g/1oz butter ", "1 onion, finely chopped ", "1 celery stalk, finely chopped ", "1 carrot, finely chopped", "150g/5½oz pancetta, cubed ", "200g/7oz beef mince", "200g/7oz pork mince", "200ml/7fl oz red wine ", "1½ tbsp tomato purée", "200ml/7fl oz beef stock ", "100ml/3½ fl oz full-fat milk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil and butter in a large saucepan, add the onion, celery, carrot and pancetta and cook on a gentle heat for about 10 minutes, until the onion has softened.  ", "Add the mince and brown all over. Increase the heat, add the wine and cook until evaporated. Dilute the tomato purée in a little of the stock and stir into the meat.  Reduce the heat to low, cover with a lid and cook on a gentle heat for 2 hours, checking and adding a little extra stock from time to time to prevent the sauce from drying out.  ", "About 10 minutes before the end of cooking time, stir in the milk. Serve with freshly cooked tagliatelle. ", "For a slow cooker, cook the vegetables and pancetta, and brown the meat as above.  Add the wine and allow to evaporate. Then dilute the tomato purée in 350ml/12fl oz of stock and add to the meat. Bring to the boil and transfer to a medium slow cooker pot.  Cover and cook on a low setting for 8–9 hours. Stir in the milk and cook for 10 minutes before serving. For a large slow cooker pot, you can make double the quantity, but cooking times remain the same."]}, {"isVegetarian": false, "title": "The Biker burger", "url": "www_bbc_co_uk_food_recipes_classic_burgers_58632", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_burgers_58632_16x9.jpg", "ingredients": ["800g/1lb 12oz chuck steak, trimmed of any gristle or hard pieces of fat, chilled  ", "50g/1¾oz bone marrow, finely diced (optional)", "4 burger buns, split", "flaked sea salt and freshly ground black pepper", "100g/3½oz mayonnaise", "2 tbsp tomato ketchup", "squeeze of lemon juice", "1 large gherkin, finely chopped", "1 tsp garlic powder", "½ tsp chipotle paste or other hot sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Make sure the meat is well chilled – if you freeze it, then let it thaw partially, you’ll find it much easier to cut. Put it through a coarse mincer, or chop it very finely by hand. It should be fine enough to stick together when you squeeze a handful. Add the bone marrow, if using.", "Season the steak with salt and a little black pepper, then divide the mixture into four and shape each one into a round pattie 2–2.5cm/¾–1in thick. The mincing and chopping will help bring the meat to room temperature, but if it’s still cold, leave the burgers to stand for a while.", "For the burger sauce, mix together all the ingredients in a bowl.", "Heat a frying pan or your barbecue. When too hot to hold your hand over, add the burgers – there’s no need for oil, as some fat will render out of the meat. Cook for 4 minutes, or until the burgers are well seared and have a thick crust. Flip them and cook for another 3 minutes for rare meat, 4 minutes for medium-rare, 5 for medium and up to 6 for well done. Serve with the burger sauce."]}, {"isVegetarian": true, "title": "Classic carrot cake", "url": "www_bbc_co_uk_food_recipes_classic_carrot_cake_08513", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_carrot_cake_08513_16x9.jpg", "ingredients": ["450ml/16fl oz vegetable oil", "400g/14oz plain flour ", "2 tsp bicarbonate of soda", "550g/1lb 4oz sugar", "5 free-range eggs", "½ tsp salt", "2½ tsp ground cinnamon", "525g/1lb 3oz carrots, grated", "150g/5½oz shelled walnuts, chopped", "200g/7oz cream cheese ", "150g/5½oz caster sugar ", "100g/3½oz butter, softened"], "serves": "Makes 1 x 26cm/10in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the carrot cake, preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 26cm/10in springform cake tin.", "Mix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts. ", "Spoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack.", "Meanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife."]}, {"isVegetarian": false, "title": "Classic chicken Kiev with spring vegetables", "url": "www_bbc_co_uk_food_recipes_classic_chicken_kiev_16620", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_chicken_kiev_16620_16x9.jpg", "ingredients": ["225g/8oz unsalted butter, softened", "1 garlic bulb, cloves peeled and crushed", "4 tbsp chopped fresh flatleaf parsley leaves", "vegetable oil, for deep-frying", "4 skinless chicken breasts, wing bone left in (ask your butcher to do this for you)", "75g/2¾oz plain flour", "3 free-range eggs, lightly beaten", "90g/3¼oz Japanese panko breadcrumbs", "125g/4½oz runner beans, trimmed, cut into 4cm/1½in pieces", "125g/4½oz fresh or frozen peas", "4 spring onions, trimmed, white part roughly chopped", "125g/4½oz broad beans, double podded", "6 blanched garlic scapes (the long stalks from fresh garlic), cut into 4cm/1½in pieces (optional)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a bowl, mix together 175g/6oz of the butter, all but one clove of garlic and half of the parsley. Season, to taste, with salt and freshly ground black pepper. ", "Place a sheet of cling film on a clean work surface. Spoon the garlic butter onto the cling film, then pull the edge of the cling film on top of the butter and mould the butter into a log shape. Twist the ends of the cling film to seal and chill in the fridge for at least an hour, or until needed.", "Heat the oil in a deep-fat fryer to 160C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "While the oil is heating, carefully cut a deep pocket in each of the chicken breasts, inserting the knife into the bone end, just under the bone. ", "Remove the cling film from the chilled garlic butter and slice it into 1cm/½in slices. Stuff each chicken breast with a few slices of garlic butter, pushing them into the chicken as far as possible.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Scatter the breadcrumbs onto another plate. Dust each chicken breast first in the flour, then dip into the beaten egg, then roll in the breadcrumbs until completely coated. ", "Carefully lower the chicken Kievs into the hot oil, two at a time, and fry for 8-10 minutes, or until the breadcrumbs are golden-brown and the chicken is cooked through. (To check that the chicken is cooked through, remove one breast from the oil using a slotted spoon and pierce in the thickest part with a skewer; the juices should run clear. Take care not to pierce the chicken too deeply in case the melted butter escapes!) Set the chicken Kievs aside on a plate lined with kitchen paper to drain and keep warm. Repeat the process with the remaining two chicken Kievs.", "Meanwhile, place the runner beans, peas, spring onions, broad beans, the remaining clove of garlic and 25g/1oz of the remaining butter in a small saucepan. Cover with 275ml/½ pint water and bring to the boil. Reduce the heat until the water is simmering, then simmer for 3-4 minutes, or until the vegetables are tender. Drain well and return the vegetables to the pan. ", "Add the remaining 25g/1oz of butter, the remaining parsley and the garlic scapes, if using, to the pan and heat through until the butter has melted. Season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the spring vegetables into the centre of four serving plates. Top each portion with a chicken Kiev."]}]