[{"isVegetarian": true, "title": "Tikka paneer cheese with sweet chilli dip", "url": "www_bbc_co_uk_food_recipes_tikkapaneercheesewit_84774", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp plain flour", "1 tsp turmeric", "1 tsp curry powder ", "200g/7oz paneer cheese, cubed", "1 tbsp vegetable oil", "salt and freshly ground black pepper ", "small handful fresh coriander, chopped, to garnish", "50ml/2fl oz white wine", "1 tbsp white wine vinegar", "pinch chilli flakes", "2 spring onions, finely chopped ", "2 tbsp runny honey", "salt and freshly ground black pepper ", "2 tbsp chopped fresh coriander"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the paneer, place the flour, turmeric and curry powder into a bowl, add the paneer to the bowl and mix until coated.", "Heat the oil in a frying pan and fry the cheese until golden-brown and crisp. Drain the cheese on kitchen paper and season with salt and freshly ground black pepper.", "For the dip, place all of the ingredients except the coriander into a saucepan and heat through for 5-6 minutes, then add the coriander and stir to mix.", "To serve, place the paneer onto a plate along with the dip in a small bowl. Sprinkle with the coriander, to garnish."]}, {"isVegetarian": false, "title": "Tilapia fish salad with orange and fennel", "url": "www_bbc_co_uk_food_recipes_tilapiafishsaladwith_90172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾fl oz sugar", "75ml/2¾fl oz white wine vinegar", "1 orange, zest reserved, peeled and segmented ", "1 fennel bulb, trimmed, very finely sliced", "75ml/2¾fl oz olive oil, plus 2 tsp extra for frying", "1 tbsp pitted black olives", "4 x 100g/3½oz tilapia fillets", "salt and freshly ground black pepper ", "knob of butter", "1 tbsp chopped fresh tarragon", "handful watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar and vinegar into a non-reactive pan over a medium heat. Bring to the boil and cook for 3-4 minutes, or until the mixture is syrupy.", "Add the orange zest and the peeled orange segments, the fennel, olive oil and olives, then remove from the heat and leave to cool.", "Meanwhile, season the tilapia fillets with salt and freshly ground black pepper.", "Heat the extra two teaspoons of oil in a frying pan over medium heat. Fry the tilapia fillets skin-side down for two minutes.", "Turn the fillets over and add the butter. Fry for a further minute, or until the fish is just cooked through, basting regularly.", "To finish the salad, place the tarragon and watercress into a bowl. Add the fennel and orange mixture and mix well.", "To serve, place equal portions of the salad onto each plate and top each with a tilapia fillet."]}, {"isVegetarian": true, "title": "Timbales of spicy rice with sweet red pepper dressing", "url": "www_bbc_co_uk_food_recipes_timbalesofspicyricew_85187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "pinch ground mixed spice", "½ tsp ground turmeric", "pinch dried oregano", "½ tsp dried chilli flakes", "1 tsp coriander seeds, crushed", "2 tsp sesame seeds", "150g/5½oz long grain rice", "300ml/12fl oz hot chicken stock (vegetarians can substitute with vegetable stock)", "vegetable oil, for greasing", "½ orange, cut into wedges, to garnish", "chopped fresh parsley, to garnish", "1 tbsp olive oil", "1 red pepper, chopped", "1 garlic clove, chopped", "50ml/2fl oz boiling water", "50ml/2fl oz white wine", "2 tbsp soft brown sugar", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the spicy rice, heat the oil in a medium pan, add all the spices and the sesame seeds and cook gently for 1-2 minutes.", "Add the rice and stir well to coat all the grains. ", "Add the chicken stock, bring to the boil and boil for 8-10 minutes, or until the rice is tender.", "Lightly grease two cups or timbales with the vegetable oil and press the rice into them. Turn the rice out onto serving plates.", "For the dressing, heat the olive oil in a small pan over a medium heat and fry the red pepper for 3-4 minutes. Add the garlic and cook for a further minute. Add the water, wine and sugar, season with salt and freshly ground black pepper and simmer for 3-4 minutes. Add the parsley, then blend the mixture with a hand blender until almost smooth.", "To serve, pour the red pepper dressing around the rice timbales and garnish with orange wedges and parsley."]}, {"isVegetarian": true, "title": "Tiramisini", "url": "www_bbc_co_uk_food_recipes_tiramisini_69286", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisini_69286_16x9.jpg", "ingredients": ["100ml/3½fl oz espresso or strong instant coffee", "2 tbsp coffee liqueur", "4 Savoiardi biscuits (fine sponge ‘ladyfinger’ biscuits)", "2 free-range egg whites", "250g/9oz mascarpone", "2 tbsp honey", "2 tbsp Marsala", "1 tsp cocoa powder"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Make your espresso and pour it into a heatproof jug, adding the coffee liqueur, then leave it to cool - I find ten minutes outside the window on a cool day does it!", "Break each Savoiardi sponge finger into about four and drop the pieces into four small martini glasses, then pour the cooled espresso mixture over them. Press down gently, making sure the biscuits are soaked all over.", "Using an electric hand-held whisk for ease, beat the egg whites in a bowl until they form soft peaks when the whisk is removed, and set aside for a moment.", "Scrape the mascarpone into another bowl, adding the honey: I love the way its mellow sweetness marries with the Marsala (though sugar would be fine, too). Beat with the whisk (no need to clean it out first) and, when smooth, slowly beat in the Marsala.", "Fold in the egg whites, a third at a time, then dollop this mixture over the soused Savoiardi in each glass, using a spoon to whirl it into an elegant peak at the top.", "Let these stand in the fridge for at least 20 minutes and up to 24 hours, then dust with cocoa, pushing it through a fine-mesh strainer, just before serving."]}, {"isVegetarian": true, "title": "Tiramisu", "url": "www_bbc_co_uk_food_recipes_tiramisu_82373", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisu_82373_16x9.jpg", "ingredients": ["6 large free-range eggs, separated", "200g/7oz caster sugar", "250g/9oz mascarpone", "250ml/9fl oz double cream", "250ml/9fl oz espresso coffee", "170ml/6fl oz Marsala wine", "30-40 Savoyard biscuits (or sponge finger biscuits)", "cocoa powder, for dusting"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["In a large bowl, whisk the egg yolks and sugar together with an electric whisk until pale and creamy. Mix the mascarpone into the egg mixture until well combined.", "In a separate bowl, whip the double cream until soft peaks form when the whisk is removed. With a metal spoon, fold the whipped cream into the mascarpone, egg and sugar mixture. ", "In another very clean bowl, whip the egg whites until soft peaks form when the whisk is removed. Fold lightly into the mascarpone, cream and egg mixture.", "Spoon a third of the mascarpone, egg and cream mixture into a large dish of about 23cm x 33cm (9in x 13in).", "Mix the espresso and Marsala together in a shallow bowl. Dip half of the biscuits into the espresso and Marsala mixture, then lay them on top of the mascarpone and cream mixture in the dish. (Repeat the soaking and layering individually as you go or the biscuits will become too soggy to handle.)", "Spoon over the next third of the mascarpone and cream mixture, followed by another layer of biscuits. Spoon over the final layer of mascarpone and cream. Cover and chill in the fridge for 24 hours. ", "Dust with cocoa powder before serving."]}, {"isVegetarian": true, "title": "Tiramisu", "url": "www_bbc_co_uk_food_recipes_tiramisu_82592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz cantuccini biscuits", "150ml/5fl oz strong espresso coffee", "250ml/9fl oz double cream, whipped ", "2 tbsp icing sugar", "1 tsp cocoa powder, to garnish", "1 strawberry, thinly sliced, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cantuccini biscuits into the base of a glass dessert dish. Pour over 100ml/3½oz of the coffee and allow the biscuits to soak for one minute.", "In a bowl mix the whipped double cream with the remaining coffee and the icing sugar.", "Spoon the cream mixture over the biscuits.", "To serve, sprinkle over the cocoa powder and garnish with the strawberry."]}, {"isVegetarian": true, "title": "Tiramisu cake", "url": "www_bbc_co_uk_food_recipes_tiramisu_cake_13686", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tiramisu_cake_13686_16x9.jpg", "ingredients": ["a little softened butter, for greasing", "4 large free-range eggs ", "100g/3½oz caster sugar", "100g/3½oz self-raising flour", "1 tbsp instant coffee granules", "150ml/5½fl oz boiling water", "100ml/3½fl oz brandy", "3 x 250g/9oz tubs full-fat mascarpone cheese", "300ml/10½fl oz double cream ", "3 tbsp icing sugar, sifted", "65g/2¼oz dark chocolate (36% cocoa solids), grated", "100g/3½oz dark chocolate, (70% cocoa solids), finely chopped", "2 tbsp cocoa powder"], "serves": "Serves 9", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C(fan)/350F/Gas 4. Grease a 35x25cm/14x10in Swiss roll tin and line with baking parchment. ", "For the sponge, place the eggs and sugar in a large bowl and, using an electric hand-held mixer, whisk together for about five minutes, or until the mixture is very pale and thick. The mixture should leave a light trail on the surface when the whisk is lifted. ", "Sift over the flour and fold in gently using a metal spoon or spatula, taking care not to over mix.", "Pour the mixture into the prepared cake tin and tilt the tin to level the surface. ", "Bake for 20 minutes, or until risen, golden-brown and springy to the touch. Cool in the tin for five minutes then turn out onto a wire rack and leave to cool completely. ", "For the filling, dissolve the coffee in the boiling water and add the brandy. Set aside to cool.", "When the sponge is cold, carefully slice the cake in half horizontally, so you have two thin sponges of equal depth.  ", "Using the loose base of a square cake tin as a guide, cut two 18cm/7in squares from each sponge. Discard the sponge trimmings (or keep for cake pops or a sneaky single-serving trifle).  ", "Line the base and sides of the square tin with long rectangles of baking parchment; there should be plenty of excess parchment which you can use to help lift the cake from the tin later. ", "Place the mascarpone cheese in a large bowl and beat until smooth. Gradually beat in the cream and icing sugar to make a creamy, spreadable frosting.", "Place one layer of sponge in the base of the lined cake tin. Spoon over one-quarter of the coffee brandy mixture. Then spread one-quarter of the mascarpone frosting over the soaked sponge. Scatter over one-third of the grated chocolate. ", "Place the second sponge on top, spoon over another quarter of the coffee mixture then spread another quarter of the frosting over the soaked sponge. Scatter over another one third of the grated chocolate. Repeat with the third sponge and another one-quarter of the coffee mixture and frosting and the remaining grated chocolate. ", "Place the fourth sponge on top and spoon over the remaining coffee mixture. Using a palette knife spread a very thin layer of the remaining frosting over the top of the cake – this is called a ‘crumb coat’ and will seal in any loose crumbs of sponge. ", "Wipe the palette knife and spread the rest of the frosting in a thicker layer over the cake. Chill for at least one hour in the fridge before turning out.", "While the cake is chilling, melt half of the chopped chocolate in a small bowl set over a pan of gently simmering water. (Do not let the bottom of the bowl touch the water.) Gently stir the chocolate until it reaches a melting temperature of 53C/127F.  ", "Remove the bowl from the heat and add the remaining half of chopped chocolate and continuing stirring gently until the chocolate cools to 31C/88F or lower and is thick enough to pipe.  ", "Place a sheet of baking parchment on the work surface. Use another sheet to make a paper piping bag.", "Spoon the melted chocolate into the paper piping bag. Snip off the end and pipe decorative shapes onto the baking parchment. Leave to set until required.", "Dust the chilled tiramisu cake with the cocoa powder before turning out onto a serving plate, using the parchment paper to help lift out of the tin. Decorate with the chocolate shapes. "]}, {"isVegetarian": true, "title": "Tiramisu cheesecake", "url": "www_bbc_co_uk_food_recipes_tiramisu_cheesecake_66814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz chocolate sandwich biscuits, such as Oreos", "140g/5oz butter, melted", "6 free-range egg yolks, beaten", "125g/4½oz caster sugar", "1 tsp vanilla extract", "150ml/5fl oz double cream ", "150ml/5fl oz mascarpone", "30ml/1fl ozl espressso", "30ml/1fl oz coffee liqueur", "30ml/1fl oz spiced rum ", "30ml/1fl oz warm water", "200g/7oz sponge fingers ", "30g/1oz good-quality cocoa powder ", "200ml/7fl oz double cream ", "pinch sea salt", "250g/9oz dark chocolate", "30ml/1fl oz spiced rum", "50g/1¾oz unsalted butter", "cocoa powder, for dusting"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["To make the base, blend the biscuits in a food processor and mix with the melted butter. Press into the bottom of the tin and leave to set in the fridge for at least an hour.", "Combine the beaten egg yolks and sugar in a bowl sat over simmering water. Make sure the base of the bowl doesn’t touch the water. Stir constantly until the mixture thickens and becomes a light lemony colour. Allow to cool before adding the mascarpone and beat until fully combined. ", "Whisk the cream to soft peaks then fold gently into the mascarpone mixture. ", "Mix the espresso, coffee liqueur and rum together and pour over the sponge fingers.", "Arrange one layer of sponge on top of the set biscuit base, then cover with the mascarpone mixture. Repeat with another layer of sponge and a final layer of mascarpone. Smooth the top with a flat knife and place in the fridge for at least 4 hours or overnight.  ", "Meanwhile, to make the truffles, gently heat the cream and salt in a pan over a low–medium heat. Add the chocolate, rum and butter and continue to warm through, stirring until smooth. Allow to cool, then leave in the fridge for 2 hours.", "Using a teaspoon, take out scoops of the truffle mix and roll into little balls. Roll the balls in cocoa powder and transfer to a plate in the fridge, until the cheesecake is set. ", "When ready to serve, dust the top of the cheesecake with the cocoa powder and release from the tin. Decorate with the chocolate truffles and serve in slices. "]}, {"isVegetarian": true, "title": "Tiramisù Natalizio", "url": "www_bbc_co_uk_food_recipes_tiramisu_natalizio_26228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs, separated", "3 tbsp caster sugar", "350g/12oz mascarpone", "½ lemon, juice only", "350g/12oz marrons glacés", "6 Madeleines", "5 tbsp white rum", "5 tbsp whole milk"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["First make the mascarpone cream.  In a bowl, whisk the egg yolks with the sugar until pale and mousse-like. Fold in the mascarpone, a tablespoon at a time, then whisk briefly. Mix in the lemon juice.", "Whisk the egg whites in a large, clean glass bowl until stiff peaks form. Gradually fold them into the mascarpone cream. Add a little more sugar or lemon juice, or both, if needed.", "Set aside three or four marrons glacés for decoration. Chop the rest and mix them into the mascarpone cream. ", "Cut the Madeleines in half horizontally. Mix the rum with the milk and soak the Madeleines in the mixture. Lay six Madeleine halves in a rectangular dish, cover with half the mascarpone cream and then with the remaining six Madeleine halves.  Spread the rest of the mascarpone cream over the top and decorate with the whole marrons glacés. Cover and chill for about six hours before serving."]}, {"isVegetarian": true, "title": "Tiramisu roulade cake", "url": "www_bbc_co_uk_food_recipes_tiramisu_roulade_cake_03599", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 medium free-range egg whites", "350g/12oz caster sugar", "55g/2oz ground almonds", "2 tbsp plain flour", "3 tbsp coffee essence", "50g/1¾oz ground coffee", "100ml/3½fl oz Marsala wine", "350g/12oz mascarpone", "50g/1¾oz icing sugar", "125ml/4fl oz double cream", "150g/5½ oz dark chocolate", "25g/1oz butter", "1 tbsp fine coffee powder", "1 tbsp cocoa powder"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 160C/140C Fan/Gas 2 and line a 20cm/8in roulade tin with baking paper.", "Whisk the egg whites and sugar until it forms stiff peaks using an electric whisk or a free standing mixer with a whisk attachment. Stir in the almonds, flour, coffee essence and ground coffee. Pour the mix into the lined tray and bake for 25 minutes or until set. ", "Remove from the oven, let it cool and then sprinkle with the Marsala.", "Meanwhile, beat the mascarpone and icing sugar together until soft. Spread the mixture over the meringue rectangle, and then carefully roll the rectangle into a Swiss roll shape, using the long side. ", "For the topping, bring the cream to the boil in a small pan, remove from the heat. Add the chocolate and butter, and mix. When cooled slightly drizzle over the Swiss roll.", "Sprinkle over the coffee and cocoa powder, serve."]}, {"isVegetarian": false, "title": "Tiramisu torte with espresso crema inglese", "url": "www_bbc_co_uk_food_recipes_tiramisu_torte_with_47596", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 medium free-range eggs, separated", "110g/4oz caster sugar", "50g/1¾oz cocoa powder", "400ml/14fl oz double cream ", "200ml/7fl oz whole milk", "4 free-range egg yolks ", "100g/3½oz caster sugar", "300ml/½ pint espresso coffee", "250g/9oz dark chocolate (minimum 70% cocoa solids)", "75g/2½oz caster sugar", "5 free-range egg yolks", "425ml/15fl oz double cream", "50ml/1¾fl oz amaretto", "300ml/½ pint double cream", "50g/1¾oz dark chocolate, grated"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and grease a 20cm/8in diameter springform cake tin.", "For the torte, place the egg yolks in one glass bowl and the egg whites in another. Put the sugar in with the egg yolks and whisk until the mixture leaves a trail when you remove the whisk (it is called the ribbon stage). ", "Sieve in the cocoa powder and gently stir it into the egg yolk mixture. ", "Whisk the egg whites until stiff peaks form when you remove the whisk. Fold into the chocolate yolk mix. Place in the prepared cake tin and bake for 20 minutes.", "Remove from the oven and allow to cool in the tin. Once cooled, cut the sponge in half horizontally and set aside.", "Meanwhile make the crema inglese. Place the cream and milk in a large saucepan and place over a low heat to warm. Put the egg yolks in a large glass bowl, add the sugar and whisk. Add the warm cream and milk slowly to the eggs, whisking all the time.", "Put the mixture back in a pan, add the coffee and heat until smooth and thickened.", "To make the torte filling, pulse the chocolate in a food processor to break it up. Put the sugar and 100ml/3½fl oz water in a pan, bring to the boil and wait until the sugar has dissolved but has no colour.", "Slowly add the sugar and water to the chocolate in the food processor while the motor is running. Add the egg yolks and blend until smooth.", "In a separate bowl, whip the cream until stiff peaks form when the whisk is removed. Then fold in the chocolate mixture and mix until smooth.", "To construct the torte, place one of the sponges in the bottom of the cake tin and pour over half the amaretto. Smooth over half the torte filling. Top with the other sponge and drizzle with the remaining amaretto. Smooth over the rest of the torte filling using a palette knife to get a neat finish.", "Whip the cream for the topping and pipe on top. Sprinkle the grated chocolate over the on top.", "To serve, cut a slice of the torte and pour the crema inglese around the torte."]}, {"isVegetarian": true, "title": "Tiramisu ice cream cake with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_tiramisuicecreamcake_91472", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz espresso coffee", "75ml/2¾fl oz Marsala wine", "250g/9oz ready-made sponge fingers", "200g/7oz ready-made coffee ice cream", "200g/7oz ready-made vanilla ice cream", "cocoa powder, for dusting ", "65g/2oz plain chocolate, minimum 70 per cent cocoa solids, broken into pieces", "65ml/2fl oz double cream", "½ tbsp unsalted butter", "75g/2½oz plain chocolate, grated, to serve"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the ice cream cake, pour the espresso coffee and Marsala wine into a bowl. Dip half of the sponge fingers into the coffee and wine mixture (do this quickly so they don't disintegrate). Arrange the soaked sponge fingers in a layer at the bottom of a square freezable dish.", "Place the coffee and vanilla ice creams into two separate bowls. Beat each with a wooden spoon until soft, smooth and spreadable.", "Spread the coffee ice cream over the soaked sponge fingers. ", "Dip the remaining sponge fingers in the coffee and wine mixture, as before, then spread over the softened vanilla ice cream.", "Dust the surface of the ice cream cake all over with cocoa powder. Place in the freezer to chill for 20 minutes.", "Meanwhile, for the chocolate sauce, bring a little water to a simmer in a pan. Suspend a heatproof bowl over the pan (do not allow the base of the bowl to touch the water). Add the plain chocolate pieces and double cream to the bowl and stir until all of the chocolate pieces have melted and the mixture is completely smooth and well combined. ", "Add the butter and stir until it has melted and the mixture is glossy. Keep warm.", "To serve, place a square of the chilled tiramisu ice cream cake into the centre of each of four serving plates. Sprinkle over the grated plain chocolate and drizzle over the hot chocolate sauce."]}, {"isVegetarian": true, "title": "Tiramisu with almond brittle", "url": "www_bbc_co_uk_food_recipes_tiramisuwithalmondbr_87985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs, separated", "3 tbsp icing sugar", "100ml/3½fl oz double cream, softly whipped", "125g/4½oz mascarpone", "2 tbsp coffee liqueur", "6 ready-made sponge fingers", "150ml/5½fl oz strong fresh coffee, chilled", "2 tsp cocoa powder", "1 tbsp grated white chocolate", "100g/3½oz caster sugar", "100g/3½oz blanched almonds"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the tiramisu, place the egg yolks and icing sugar into a large bowl and whisk with an electric hand whisk until pale and frothy. ", "Add the softly whipped cream and mascarpone and a dash of the coffee liqueur, and stir well. ", "In a separate bowl, whisk the egg whites until stiff peaks form when the whisk is removed. Fold into the cream mixture.", "Mix the rest of the coffee liqueur with the chilled coffee in a shallow dish.", "Dip half of the sponge fingers into the coffee mixture. Place in the base of a large dessert glass, then spoon over half of the cream mixture. Dip the rest of the sponge fingers into the coffee mixture, then place on top of the cream mixture in the glass. Finish with the remaining cream mixture. ", "Dust with cocoa powder and grated white chocolate and chill for 30 minutes, if time permits.", "For the almond brittle, place the caster sugar into a frying pan and melt over a gentle heat until it turns a caramel colour.", "Add the almonds and stir to coat. Pour onto a baking sheet lined with baking paper and leave to cool.", "When cold, break the brittle into pieces and use to decorate the top of the tiramisu. Serve."]}, {"isVegetarian": true, "title": "Tiramisu with pears and stem ginger", "url": "www_bbc_co_uk_food_recipes_tiramisuwithpearsand_14575", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 can of pears, sliced ", "2 bits of stem ginger ", "1 tbsp ginger syrup ", "250ml/9fl oz mascarpone ", "250ml/9fl oz crème frâiche ", "200g/7oz ladies fingers biscuits ", "cocoa powder ", "large glass of extra strong coffee ", "Marsala or sweet sherry"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Lay the biscuits on the bottom of a large dish. Pour over the coffee and the Marsala. Make sure all the biscuits are soaked. ", "Mix together the crème fraîche and mascarpone and add the chopped stem ginger and some of the syrup. How much depends on the strength you like. ", "Lay the pears over the biscuits. Spoon the cream mix over the top and sprinkle liberally with chocolate. Chill for 2 hours before serving."]}, {"isVegetarian": false, "title": "Toad in the hole for a crowd", "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_41928", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 free-range eggs", "1.25kg/2lb 12oz plain flour", "500ml/18fl oz whole milk", "1.5 litres/2 pints 14fl oz cold water", "sea salt and freshly ground black pepper", "300g/10½oz lard", "40 pork sausages"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the eggs, flour, milk, water and seasoning in a large mixer and whisk until you have a smooth batter. Place in the fridge to rest for 30 minutes.", "Put the lard in two large roasting tins and place in the oven for 5-8 minutes or until it is smoking.", "Carefully pour in the batter - it will sizzle softly in the hot fat - then arrange the sausages in the batter.", "Transfer the tins back to the oven and bake for 25-30 minutes until puffed and golden-brown. "]}, {"isVegetarian": false, "title": "Toad in the hole with onion gravy and garlic cabbage", "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_with_86283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toad_in_the_hole_with_86283_16x9.jpg", "ingredients": ["225g/8oz plain flour ", "salt and black pepper", "3 free-range eggs ", "300ml/10fl oz milk ", "2 tbsp olive oil", "8 sausages ", "1 tbsp olive oil ", "2 onions, finely sliced ", "½ tsp English mustard ", "500ml/18fl oz stock (from a stock cube, ideally beef although chicken or vegetable is fine) ", "1 Savoy cabbage, shredded, core discarded", "½ tbsp olive oil ", "2 garlic, peeled and finely chopped "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the batter, sieve the flour into a bowl and season with salt and pepper. Make a well in the middle and break in the eggs. Whisk the eggs slowly into the flour. Once combined, pour in the milk while you whisk so that you have a smooth, lump-free batter the consistency of double cream (if the batter is too thick then add a little water). Cover the batter and rest in the fridge for one hour.", "Preheat the oven to 200C/180C Fan/Gas 6.", "For the onion gravy, heat a heavy-based frying pan over a low heat. Add the oil, onions and a pinch of salt. Cook gently for 15–20 minutes, or until completely collapsed and dark golden-brown in colour. If the onions are cooking too quickly, then cover with a lid while they cook.", "Once the onions are completely softened and dark golden-brown, stir in the mustard and a pinch of pepper and then add the stock. Bring the mixture to the boil, reduce to a simmer and simmer for 10–15 minutes, or until the volume of liquid has reduced by half. Taste and adjust the seasoning as necessary.", "Put a roasting tray (about 30x20x6cm/12x8x2½in) into the preheated oven. Once really hot, add the olive oil and the sausages. Brown the sausages in the hot oven, turning now and again until coloured on all sides (they don’t need to be cooked through).", "Whisk the rested batter and pour it into the hot tin over the browned sausages. Return to the oven and cook for a further 30–35 minutes, or until the batter is risen and golden-brown all over.", "While the toad in the hole is cooking, prepare the cabbage. Wilt the shredded cabbage in a high sided frying pan or shallow saucepan with 3–4 tablespoons of water over a medium high heat for 6–8 minutes, stirring occasionally. Once the cabbage is tender pour off any excess water (or add it to the gravy) and then add the oil to the pan along with the garlic. Fry over a medium high heat for 2–3 minutes, or until the garlic is softened and aromatic. Season the cabbage with salt and pepper and keep warm.", "Reheat the onion gravy and serve the cooked toad in the hole in wedges with the cabbage alongside."]}, {"isVegetarian": false, "title": "Tiny toad in the hole", "url": "www_bbc_co_uk_food_recipes_toad_in_the_hole_84460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "1 free-range egg", "100ml/3½fl oz milk", "50g/2oz plain flour", "1 tsp wholegrain mustard", "2 chipolata sausages", "4 cherry tomatoes"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease a small ovenproof dish.", "Whisk the egg in a bowl, then whisk in the milk. ", "Put the flour in a separate bowl, then slowly whisk in the egg mixture. Whisk in the mustard.", "Put the sausges and tomatoes into the dish and pour over the batter.", "Bake in the oven for 15-20 minutes, or until the batter is puffed up and golden-brown."]}, {"isVegetarian": true, "title": "Toad in the hole", "url": "www_bbc_co_uk_food_recipes_toadinthehole_3354", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toadinthehole_3354_16x9.jpg", "ingredients": ["115g/4oz plain flour ", "large pinch of salt ", "freshly ground black pepper ", "4 large free-range eggs ", "300ml/½ pint milk ", "2 tbsp/30g fresh thyme leaves", "8 good quality pork, beef or vegetarian sausages ", "2 tbsp/30g Dijon mustard", "2 tbsp/30g of beef dripping or white vegetable fat for vegetarians", "knob of butter, to serve"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the batter, sift the flour into a large bowl. Add the salt and pepper. ", "Make a well in the centre of the flour and crack in the eggs. Using a wooden spoon, gradually beat the eggs into the flour then slowly beat in the milk until the batter is the consistency of double cream. ", "Strain and push any remaining lumps through a sieve. Stir in the thyme. Cover and leave to stand for 30 minutes, or ideally 3-4 hours. ", "Preheat the oven to 200C/400F/Gas 6.", "Heat a large non-stick pan and cook the sausages over a medium heat until golden-brown all over. (If you do not have a non-stick pan add a little oil.) Turn off the heat and brush the sausages with the mustard. Set aside. ", "Place the dripping or white vegetable fat into an ovenproof dish and heat in the oven for five minutes or until the dripping is hot and hazy. ", "Add the sausages to the hot dish and pour in the batter. Immediately return the dish to the oven and cook for 35-40 minutes until well-risen and golden-brown. ", "Serve seasoned with black pepper and a large knob of butter."]}, {"isVegetarian": false, "title": "Toad-in-the-hole", "url": "www_bbc_co_uk_food_recipes_toadinthehole_85707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "200g/7oz pork mince", "pinch dried oregano", "salt and freshly ground black pepper", "110g/4oz plain flour", "pinch salt", "2 free-range eggs, beaten", "290ml/½ pint milk"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a small ovenproof frying pan. Place the mince and oregano into a large bowl, season with salt and freshly ground black pepper and mix well. Roll the mixture into golfball-sized balls. Place the meatballs into the pan and fry until golden-brown on all sides.", "Meanwhile, for the batter, place the flour and salt into a large bowl, make a well in the middle and gradually whisk in the eggs and milk to make a thick, smooth batter. Leave to rest for five minutes.", "Heat the frying pan, with the meatballs in, until very hot and pour the batter over the meatballs.", "Transfer to the oven and cook for 10-12 minutes, or until the batter is well-risen and golden-brown on top and the meatballs are completely cooked through.", "To serve, transfer to a serving plate."]}, {"isVegetarian": false, "title": "Toad in the hole", "url": "www_bbc_co_uk_food_recipes_toadinthehole_83871", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toadinthehole_83871_16x9.jpg", "ingredients": ["2 free-range eggs", "125g/4½oz plain flour", "150ml/5fl oz milk mixed with 150ml cold water", "1 level tbsp grain mustard", "salt and freshly ground black pepper", "6 fat, herby pork sausages", "100g/3½oz thinly sliced prosciutto, pancetta, Serrano ham or thin streaky bacon", "3 tbsp dripping or lard", "brown onion and madeira gravy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk together the eggs, flour, milk, mustard and seasoning, beating out any little lumps of flour. The consistency should be about that of ordinary double cream, but no thinner. Rest for 15 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Carefully remove the skin from each of the sausages. Wrap each piece of skinned sausage meat in a piece of cured ham.", "Put the dripping or lard in a roasting tin and leave it in the oven until it is smoking.", "Pour in the batter - it will sizzle softly in the hot fat - then arrange the sausages in the batter.", "Transfer the tin back into the oven and bake for 25-30 minutes until puffed and golden. Serve with brown onion and madeira gravy."]}, {"isVegetarian": false, "title": "Toad in the hole with roasted-onion gravy", "url": "www_bbc_co_uk_food_recipes_toadintheholewithroa_70008", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 good-quality pork sausages - about 14oz/400g ", "1 tbsp groundnut or other flavourless oil (if necessary) ", "3oz/75g plain flour ", "1 large egg ", "3fl oz/75ml semi-skimmed milk ", "salt and freshly milled black pepper ", "8oz/225g onions, peeled and sliced ", "2 tsp groundnut or other flavourless oil ", "1 level tsp golden caster sugar ", "2 tsp Worcestershire sauce ", "1 level tsp mustard powder ", "15fl oz/425ml vegetable stock ", "2 rounded tsp plain flour ", "salt and freshly milled black pepper "], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Begin by making the batter, and to do this sieve the flour into a large bowl, holding the sieve up high to give the flour a good airing. Now, with the back of a spoon, make a well in the centre, break the egg into it and add some salt and pepper. Now, measure the milk and 2fl oz/55ml water in a measuring jug, then, using an electric hand whisk on a slow speed, begin to whisk the egg into the flour - as you whisk, the flour around the edges will slowly be incorporated. Then add the liquid gradually, stopping to scrape the flour into the mixture. Whisk until the batter is smooth. Now the batter is ready for use, and although it's been rumoured that batter left to stand is better, I have never found this, so just make it whenever it's convenient.", "Now place the sliced onions in a bowl, add one teaspoon of the oil and the sugar and toss the onions around to get the lightest coating, then spread them on the baking tray. Next arrange the sausages in the roasting tin, then place the onions on a high shelf in the oven, with the sausages on a lower shelf, and set a timer for 10 minutes. When the timer goes off, remove the sausages from the oven but leave the onions in for a further 4-5 minutes - they need to be nicely blackened round the edges. When they are ready, remove them and leave to one side.", "Now place the roasting tin containing the sausages over direct heat turned to medium and, if the sausages haven't released much fat, add the tablespoon of oil. When the tin is really hot and the oil is beginning to shimmer - it must be searing hot - quickly pour the batter in all around the sausages. Immediately return the roasting tin to the oven, this time on the highest shelf, and cook the whole thing for 30 minutes.", "Now for the gravy. First add the Worcestershire sauce and mustard powder to the stock, then add the onions from the baking tray to a medium-sized pan. Now add the second teaspoon of oil, then, using a wooden spoon, stir in the plain flour. Stir all this together over a medium heat and then switch to a whisk, then gradually add the stock to the pan, whisking all the time, until it's all in. Then bring it up to simmering point and gently simmer for 5 minutes. Taste to check the seasoning, then pour into a warmed serving jug. ", "When the toad is ready, it should be puffed brown and crisp and the centre should look cooked and not too squidgy. Serve it immediately with the gravy, and it's absolutely wonderful with mashed potato."]}, {"isVegetarian": false, "title": "Toast with ham and cheese", "url": "www_bbc_co_uk_food_recipes_toast_with_ham_and_11297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz slice wholemeal or granary bread", "30g/1oz light soft cheese", "30g/1oz slice ready-to-eat ham", "1 small apple"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the bread and spread with the soft cheese. Place the ham on top of the cheese and serve with an apple."]}, {"isVegetarian": true, "title": "Toast with mashed banana and yoghurt", "url": "www_bbc_co_uk_food_recipes_toast_with_mashed_banana_95514", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz slice wholemeal or granary bread", "1 small banana (75g/2½oz peeled weight), mashed", "1 small pot low-fat, sugar-free yoghurt (65 kcal or fewer)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the bread. Spread the mashed banana over the toast and serve with the yoghurt."]}, {"isVegetarian": true, "title": "Toasted coconut and lime roti", "url": "www_bbc_co_uk_food_recipes_toasted_coconut_and_lime_30529", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz sweetened coconut (available online or, alternatively, add sugar to desiccated coconut)", "225g/8oz self-raising flour, plus extra for dusting", "½ tsp sea salt", "½ lime, zest only", "1 tbsp vegetable oil, plus extra for folding and cooking"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the coconut in a dry frying pan over a medium heat until golden brown and set aside to cool. ", "Sift the flour and salt into a large bowl. Add the toasted coconut and the lime zest then drizzle over the vegetable oil.  Add 150ml/5fl oz water and combine to make a soft dough.  ", "Tip the dough out onto a lightly floured surface and knead for approximately five minutes.  Cover and rest the dough for 20 minutes.", "Divide the dough into six equally sized balls. Flatten the dough balls in your hand, turning them round as you do so, to make disks.  Using a rolling pin, roll each one out as thinly as possible.", "Brush the bottom third of the roti with a little bit of vegetable oil and fold it up until it meets the middle, then fold the top down.  Turn the dough a quarter turn round and fold in the same way.  Repeat with the remaining five roti and then set aside until ready to cook.", "Put a frying pan on a medium/high heat and add a little oil. Roll out one of the roti thinly and fry in the pan until it puffs up and has golden brown patches. Flip over and repeat on the other side.  When all the roti are cooked, stack them up and place inside a tea towel.  Wrap the towel in a large piece of foil.  Seal the foil so that it traps the heat and moisture inside and keep in a warm place until ready to use."]}, {"isVegetarian": true, "title": "Toasted crumpets and warm spiced berries with yoghurt and honey", "url": "www_bbc_co_uk_food_recipes_toasted_crumpets_and_99702", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/toasted_crumpets_and_99702_16x9.jpg", "ingredients": ["4 crumpets", "100g/3½oz fat-free Greek yoghurt", "150g/5½oz ripe strawberries, hulled and sliced", "50g/2oz raspberries", "50g/2oz blueberries", "2 big pinches ground mixed spice", "2 tsp runny honey, for drizzling"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the crumpets in a toaster, or under the grill, until lightly browned.", "Put the yoghurt in a bowl and stir until it looks glossy.", "Place a non-stick frying pan over a medium-high heat and add all the fruit. Sprinkle with two good pinches of ground mixed spice and cook for just a minute, tossing regularly until the fruit is softened but still holding its shape. This will bring out the sweetness without the need to add extra sugar.", "Divide the hot, toasted crumpets between two plates. Spoon the fruit over the top and allow some of it to tumble on to the plates. Spoon the yoghurt on top and drizzle with a little honey."]}]