[{"isVegetarian": false, "title": "Chicken and mushroom pie", "url": "www_bbc_co_uk_food_recipes_chicken_and_mushroom_pie_48270", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["550g/1lb 4oz lard, plus extra for greasing", "1.15kg/3lb 5oz plain flour, plus extra for dusting", "1½ tsp salt", "300ml/½ pint water", "300ml/½ pint sunflower oil", "4kg/9lb chicken thighs, boned and skin removed, flesh cut into pieces", "100g/3½oz chopped fresh thyme", "1kg/2lb 4oz mushrooms, roughly chopped", "100g/3½oz chopped fresh tarragon", "500ml/18fl oz soured cream", "milk, to glaze", "salt and freshly ground black pepper"], "serves": "Serves 40", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease five large pie dishes with lard. Add a small amount of flour, then turn the tin to coat the base and sides, shaking out any excess. ", "For the pastry, pulse the flour, salt, and lard in a large food processor until the mixture resembles breadcrumbs. Add the water, mix until just combined, then tip onto a work surface and knead until smooth. Place the pastry in the fridge for 30 minutes. (This makes a lot of pastry, so you may need to make it in batches.)", "Meanwhile, for the filling, heat half of the oil in a large saucepan over a medium heat, add the chicken pieces and cook for 4-5 minutes, or until browned (you may need to do this in batches). Add 1.5 litre/2¾ pints water and the thyme, and season, to taste, with salt and freshly ground black pepper. Bring the mixture to the boil, reduce the heat, and simmer for 15-20 minutes, or until the volume of liquid has reduced by a third and the chicken is cooked through. ", "Heat the remaining oil in a separate frying pan over a medium heat, add the mushrooms, and cook for 4-5 minutes, or until golden-brown, then season, to taste, with salt and freshly ground black pepper. (It is best not to overcrowd the pan, so you may need to do this in batches.)", "Add the mushrooms to the chicken mixture along with the tarragon, then stir in the soured cream until well combined. If the mixture is looking dry add a little hot water or stock. Divide the mixture among the pie dishes and set aside.", "Divide the pastry into five pieces and roll each piece of pastry out on a clean, floured work surface until it is a little bit larger than the diameter of the pie dish.", "Place the pastry lid on top of the pie and trim off any excess pastry. With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry with a little milk.", "Repeat with the remaining pastry.", "Bake the pies in the oven for 30-35 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Christmas pâté with pistachios", "url": "www_bbc_co_uk_food_recipes_chicken_and_pork_pt_with_77226", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 corn fed chicken breasts, skin removed", "100g/3½oz chicken livers", "180g/6oz pork belly, minced ", "1 tsp salt", "2 tsp freshly ground black pepper", "1 unwaxed lemon, zest only", "2 shallots, finely sliced", "2 sprigs lemon thyme, leaves picked", "50g/1¾oz pistachios, blanched", "20 thin slices streaky bacon "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cut each chicken breast into three big slices and set aside. ", "Mix the chicken livers into the minced pork and season with the salt and pepper. Add the lemon zest, shallots, thyme leaves and pistachios. ", "Line a terrine mould or loaf tin with the bacon, leaving enough overhanging to cover the top when filled. Press in the mince and chicken pieces and cover completely with the bacon.", "Place the mould in a roasting tin filled with enough water to reach half way up the side of the mould. ", "Bake in the preheated oven for 1 hour 15 minutes.", "Allow to cool for 24 hours in the fridge then slice. Serve with pickled onions or gherkins, toast and salad leaves."]}, {"isVegetarian": false, "title": "Chicken and prawn croquettes with cashew relish", "url": "www_bbc_co_uk_food_recipes_chicken_and_prawn_99165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz chicken mince", "300g/10½oz raw prawns, deveined and finely chopped", "2 garlic cloves, grated", "2cm/1in piece fresh root ginger, grated ", "1 red chilli, roughly chopped", "1 lemongrass stick, outer leaves removed, roughly chopped", "2 lime leaves", "1 tsp sesame oil", "1 tsp soy sauce", "vegetable oil, for frying", "handful mangetout", "2 Little Gem lettuce, leaves separated", "1 bunch fresh coriander, leaves picked", "1 bunch fresh mint, leaves picked", "1 bunch fresh dill, roughly chopped", "1 red onion, thinly sliced into half moons", "1 cucumber, finely chopped", "¼ pineapple, finely chopped", "1 green chilli, finely chopped", "150g/5½oz cashew nuts, toasted and chopped", "2 limes, juice only", "2 tbsp fish sauce", "2 tsp caster sugar"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the croquettes, place the ingredients apart from the oil in a food processor and blend until smooth. Shape into croquettes and place in the fridge for 1 hour to set. ", "To make the salad, blanch the mangetout in boiling water for 1 minute. Refresh in cold water and thinly slice. Mix the mangetout with the lettuce, herbs and onion in a bowl and set aside. ", "To make the cashew relish, mix the ingredients together in a bowl and set aside. ", "Heat some vegetable oil in a frying pan over a medium heat and fry the croquettes in batches for 8–10 minutes, until golden brown and cooked through. ", "Serve the croquettes with the salad and relish on the side. "]}, {"isVegetarian": false, "title": "Chicken and roasted vegetable layered loaf with pesto and a seasonal salad", "url": "www_bbc_co_uk_food_recipes_chicken_and_roasted_70570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz basil leaves", "50g/1¾oz toasted pine nuts", "50g/1¾oz parmesan, grated", "2 garlic cloves", "75ml-125ml/2½-4fl oz extra virgin olive oil", "2 red peppers", "2 yellow peppers", "2 chicken breasts, cut into strips", "2 tbsp olive oil", "1 large red onion, peeled and cut into wedges", "2 courgettes, sliced lengthways", "1 large round loaf 23cm/9in wide", "2 balls buffalo mozzarella, torn", "1 beef tomato, thinly sliced", "3 tbsp extra virgin olive oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard", "50g/1¾oz rocket leaves", "2 heads Little Gem lettuce"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, place all the ingredients except the oil in a food processor and blend. Gradually add the oil until you have a thick paste, and set aside.", "For the chicken and roasted vegetable layered loaf, place the red and yellow peppers directly on a gas flame and keep turning until black all over. Remove from the hob and place in a glass bowl with cling film over, and set aside. Once cool enough to handle, peel the black skin off and cut the flesh into quarters, removing the seeds.", "Heat a large griddle pan and place the chicken strips in a bowl. Add the oil and season with salt and pepper, then toss to coat.", "Place the chicken on the hot griddle along with the red onion and courgettes and cook for 2-3 minutes.", "Slice off the top of the loaf of bread. Hollow out the loaf by scooping out the soft bread, leaving 3cm/1¼in of bread around the edge.", "Fill the hollow loaf with layers of the peppers, chicken, red onion, courgettes, mozzarella, tomatoes and pesto, seasoning between each layer.", "Place the lid of the loaf back on and push down, you can wrap it in cling film and leave overnight or slice straight away.", "For the seasonal salad, whisk together the oil, vinegar and mustard in a small bowl. Place the salad leaves in a large bowl, pour over the dressing and mix.", "To serve, slice the loaf and place on serving plates with the dressed salad."]}, {"isVegetarian": false, "title": "Chicken and rosewater biryani", "url": "www_bbc_co_uk_food_recipes_chicken_and_rosewater_70042", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_rosewater_70042_16x9.jpg", "ingredients": ["250ml/9fl oz natural yogurt", "6 garlic cloves, finely crushed", "6cm/2½in (30g/1oz) piece ginger, finely grated", "3 green chillies, finely chopped, with seeds", "1 tsp Kashmiri chilli powder", "1 tsp ground coriander", "½ tsp ground turmeric", "500g/1lb 2oz skinless, boneless chicken thighs, cut in half", "300ml/10fl oz vegetable oil", "3 medium onions, thinly sliced", "10 whole cloves", "6cm/2½in piece cinnamon stick", "5 green cardamom pods, bruised with a rolling pin", "2 Indian bay leaves", "1 tsp cumin seeds", "2 medium tomatoes, chopped", "1 tsp salt", "600g/1lb 5oz basmati rice, soaked in cold water for an hour", "1 tsp salt per 1 litre/1¾ pint of cooking water", "100g/3½fl oz ghee", "pinch saffron soaked in 4 tbsp warm milk for 15 minutes", "2 tsp rosewater", "20g/½oz cashew nuts and 20g/½oz shelled pistachios, dry-roasted in a hot pan until golden-brown", "raita, to serve"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["In a shallow bowl large enough to contain all the chicken pieces, combine all the marinade ingredients. Toss to coat well and then set aside to marinate for an hour.", "For the crisp fried onions, heat the vegetable oil in a sturdy pan or karahi over a medium heat until hot but not smoking (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the onions and fry for 10–15 minutes, or until deep golden-brown. Remove with a slotted spoon and drain on a plate lined with kitchen paper. Set aside. Pour off all but about three tablespoons of the oil from the pan. (You can pour the oil off into a jug and set aside for another use.)", "Add the whole spices to the pan and fry for one minute. Add the chicken and its marinade, bring to a simmer, then stir in the tomatoes and salt. Simmer over a medium heat for 20 minutes, or until the chicken is cooked through and the sauce is clinging to the chicken (add a splash of water to the pan if it catches on the bottom). It’s important that the sauce is almost dry by this stage and just coating the chicken. Keep it warm on a low heat while you cook the rice.", "For the rice, drain the soaked rice and tip into a large pan of boiling, salted (at a rate of one teaspoon per litre of water) water for 5-7 minutes, or until the rice is just tender but still firm. Drain well. Test that the rice is cooked by squeezing a grain between your fingers – it should be soft and break up at the edges, but stay firm in the middle.", "Assemble the biryani straight away while the rice is still hot – you are aiming for five layers: rice, chicken, rice, chicken, rice. First pour about three tablespoons of water and half of the ghee into a deep, heavy-based cooking pot or casserole, then spoon in a third of the rice. Sprinkle over about a third of the saffron milk and rosewater, then spread with half of the chicken mixture and a third of the fried onions. ", "Add another third of the rice and repeat as above, using the rest of the chicken. Top with the remaining rice and splash with the remaining saffron milk and rosewater. Set the remaining fried onions aside for now. Drizzle the remaining ghee around the edges of the rice so that it drips down the inside of the pan.", "Cover with a well-fitting lid. Put over a high heat to get the ghee hot and some steam going – lift up the lid to check. As soon as you see steam rising, turn down to a very low heat and cook for 30 minutes.", "Spoon out onto a large serving platter and scatter with the rest of the crisp onions and toasted cashews and pistachios. Serve with raita."]}, {"isVegetarian": false, "title": "Chicken and serrano ham croquetas with padrón peppers", "url": "www_bbc_co_uk_food_recipes_chicken_and_serrano_ham_49020", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz butter", "150g/5½oz plain flour", "450ml/16fl oz milk", "75g/2¾oz serrano ham, roughly chopped", "75g/2¾oz cooked chicken, chopped", "1 small bunch fresh parsley, leaves roughly chopped", "25g/1oz flaked toasted almonds", "2 free-range eggs", "75g/2¾oz fresh breadcrumbs", "vegetable oil, for deep frying", "4 tbsp olive oil", "200g/7oz padrón peppers (available from Spanish delicatessens)", "½ tsp sea salt flakes", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Melt the butter in a large saucepan over a medium heat. Whisk in half of the flour to form a smooth paste, then cook the mixture for 30 seconds. ", "Slowly whisk in the milk, allowing each addition of milk to be absorbed into the mixture and the sauce to thicken, until you have a very thick sauce – almost with the consistency of mashed potato. Season, to taste, with salt and freshly ground black pepper.", "Scrape the mixture into a large bowl, then stir in the serrano ham, cooked chicken and parsley. Season again with salt and freshly ground black pepper, then stir in the flaked almonds. Set the mixture aside to cool completely. Chill in the fridge, covered, for at least 10 minutes, or overnight, until it has firmed up.", "Take spoonfuls of the chilled mixture and, using wet hands, roll them into balls or cylinder shapes.", "Sprinkle the remaining flour onto a plate and season with salt and freshly ground black pepper. Beat the eggs in a bowl. Add the breadcrumbs to another bowl. ", "Dust each croqueta first in the flour, then dip into the beaten egg, then roll in the breadcrumbs to cover. ", "Meanwhile, heat the vegetable oil in a deep-fat fryer to 170C, or heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.)", "Lower the croquetas into the hot oil in batches and fry for 3-4 minutes, or until golden-brown and hot all the way through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining croquetas.", "While the croquetas are frying, heat the olive oil in a separate frying pan over a high heat. Add the padrón peppers and sprinkle with half the salt. Fry for 2-3 minutes, or until just golden-brown on both sides and softened. Transfer to a serving bowl and sprinkle with the remaining salt.", "Serve the croquetas with the padrón peppers."]}, {"isVegetarian": false, "title": "Chicken and tarragon pie", "url": "www_bbc_co_uk_food_recipes_chicken_and_tarragon_pie_93074", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb plain flour", "125g/4oz unsalted butter ", "125g/4oz lard", "pinch salt", "1 tsp white wine vinegar", "1 egg, beaten", "75g/3oz unsalted butter", "50g/2oz plain flour", "350ml/12fl oz whole milk, warmed", "salt and freshly ground black pepper", "2 x 150g/5oz chicken breasts, cut into chunks", "125g/4oz good-quality ham, cut into strips", "2 large leeks", "5 tbsp chopped fresh tarragon "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large bowl and rub the butter and lard into the flour until it resembles breadcrumbs.", "Add the vinegar and enough cold water to bring the mixture together into a smooth dough.", "Divide the dough into two pieces, wrap in cling film and chill in the fridge for 30 minutes.", "Meanwhile, for the filling heat 25g/1oz of the butter in a frying pan and cook the chicken for 5-6 minutes, then add the leeks and continue to cook for a further 3-4 minutes, or until just soft. Transfer the mixture to a large bowl, then season and set aside.", "Melt the remaining butter in a saucepan, then add the flour and whisk to a smooth paste. Cook for a minute or two then remove from the heat and slowly whisk in the milk. Return the sauce to the heat and cook over a gentle heat until smooth and thick (do not boil). ", "Stir in the chicken mixture, ham and tarragon. ", "Preheat the oven to 180C/350F/gas 4.", "Roll one of the pieces of pastry thinly and use it to line a 25cm/10in pie plate. Trim the edges. Spoon in the chicken mixture and brush the edges of the pastry with the beaten egg. ", "Roll the second piece of pastry out thinly and cover the pie. Seal and crimp the edges.  Cut a hole in the top of the pie and brush the top with the beaten egg.", "Bake in the oven for 35-40 minutes."]}, {"isVegetarian": false, "title": "Chicken and tomato smiles", "url": "www_bbc_co_uk_food_recipes_chicken_and_tomato_06581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cherry tomatoes, chopped", "50g/2oz cooked leftover chicken, torn into small pieces", "2 pinches sweet paprika", "250g/9oz ready-made savoury shortcrust pastry", "plain flour, for dusting"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a bowl, mix together the tomatoes, chicken and paprika.", "Roll out the pastry onto a lightly floured work surface to a thickness of about 0.5cm/¼in. Cut four circles from the pastry using a cookie cutter. ", "Using a pastry brush, dab water around the edges of each pastry circle.", "Divide the filling mixture equally among the four pastry circles. ", "Fold each pastry circle over itself to create four parcels, pinching the edges together to seal. Place each parcel onto a baking tray and dab with a little more water. Prick each parcel with a fork.", "Bake the chicken and tomato smiles in the oven for 12-15 minutes, or until the pastry is golden-brown and the filling is piping hot. Set aside to cool slightly before serving. "]}, {"isVegetarian": false, "title": "Chicken and tarragon omelette", "url": "www_bbc_co_uk_food_recipes_chicken_and_tarragon_88286", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_tarragon_88286_16x9.jpg", "ingredients": ["1 leek, thinly sliced", "2 tbsp vegetable or chicken stock", "4 tbsp fat-free quark or fat-free natural cottage cheese", "1 tbsp finely chopped fresh tarragon", "1 cooked chicken breast, skin removed, cut into small dice", "low-calorie cooking spray", "4 large free-range eggs, beaten", "salt and freshly ground black pepper", "4 plum tomatoes, halved", "½ cucumber, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C Fan/Gas ¼ .", "Put the leeks and stock in a small saucepan and cover. Cook for 5–6 minutes, or until tender and all the liquids have been absorbed. Season and stir in the quark, tarragon and chicken.", "Spray a 20cm/8in frying pan with low-calorie cooking spray and place over a high heat. ", "Season the eggs, then add half to the pan and cook, pushing the cooked egg into the centre of the pan and allowing the runny egg to flow into its place until no runny egg is left.", "Spoon half the chicken mixture into the middle of the omelette. Flip one side on top of the chicken, then the other side over to encase the filling. Roll the omelette onto a plate and keep warm while you cook the second one.", "Meanwhile, toss together the tomatoes and cucumber. Serve the omelettes with the cucumber salad."]}, {"isVegetarian": false, "title": "Chicken and vegetable balti", "url": "www_bbc_co_uk_food_recipes_chicken_and_vegetable_65850", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_vegetable_65850_16x9.jpg", "ingredients": ["calorie controlled cooking oil spray", "1 medium onion, thinly sliced", "4 chicken thighs, boned and skinned", "1 red pepper, deseeded and cut into 3cm/1in chunks", "1 yellow pepper, deseeded and cut into 3cm/1in chunks", "1 tbsp cornflour", "150g/5½oz fat-free natural yogurt", "1 tbsp medium or mild curry powder", "2 garlic cloves, thinly sliced", "227g/8oz tin chopped tomatoes", "3 heaped tbsp finely chopped fresh coriander, plus extra to garnish", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Spray a large, deep, non-stick frying pan or wok with oil and place over a medium heat. Add the onion and cook for five minutes, stirring regularly until well softened and lightly browned.", "Meanwhile, trim all the visible fat off the chicken thighs, cut each one into four pieces and season with black pepper.", "Add the chicken and peppers into the pan with the onion and cook for three minutes, turning occasionally.", "Meanwhile, in a small bowl, mix the cornflour with 2 tablespoons cold water and stir in the yoghurt until thoroughly mixed.", "Sprinkle the curry powder over the chicken and vegetables, add the garlic and cook for 30 seconds.", "Tip the tomatoes into the pan, add the yoghurt mixture, 150ml/3½fl oz of water and coriander.", "Bring to a gentle simmer and cook for 20-25 minutes, stirring occasionally until the chicken is tender and the sauce is thick. Season with freshly ground black pepper to taste and garnish with coriander."]}, {"isVegetarian": false, "title": "Chicken and wild mushroom pie with carrots and peas", "url": "www_bbc_co_uk_food_recipes_chicken_and_wild_04700", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "½ tsp salt", "45g/1½oz butter, diced", "50g/1¾oz lard, diced", "1.5kg/3lb 5oz whole chicken", "2 onions, finely chopped", "1 bay leaf", "salt and black pepper", "1 tbsp olive oil", "75g/2½oz unsalted butter", "2 tbsp plain flour", "350g/12oz wild mushrooms such as chanterelle, ceps, tompette, girolles", "150ml/5fl oz white wine", "150ml/5fl oz double cream", "4 sprigs fresh tarragon, leaves only", "1 free-range egg, lightly beaten", "75g/2½oz butter", "1 tsp caster sugar", "1 bunch baby carrots, washed and trimmed", "200g/7oz frozen peas"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the shortcrust pastry, put the flour and salt in a large bowl and add the cubes of butter and lard.", "Use your fingertips to rub the butter into the flour until you have a mixture that resembles coarse breadcrumbs with no large lumps of butter remaining. Try to work quickly so that it does not become greasy.", "Measure out four tablespoons of cold water. Using a knife, stir in just enough of the cold water to bind the dough together.", "Wrap the dough in cling film and chill in the fridge for 10-15 minutes before using.", "Alternatively using a food processor, put the flour, butter and salt in the food processor and pulse until the fat is rubbed into the flour. With the motor running, gradually add the water through the funnel until the dough comes together. Only add enough water to bind it and then stop. Wrap the dough in cling film as before and chill for 10-15 minutes before using.", "For the pie, preheat the oven to 220C/425F/Gas 7.", "Place the chicken in a large, deep pan with half of the onions and the bay leaf. Season with a little salt and pepper and cover with water. Bring to the boil, then reduce the heat and simmer for 45 minutes, or until the chicken is cooked through. ", "Remove the chicken from the pan and set aside to cool. Return the pan to the hob and cook the liquid on a rapid boil for a further 30 minutes, or until it has reduced in volume by half. Meanwhile, remove the meat from the chicken legs, thighs and carcass, then place in a 20x30cm/8x12in pie dish. ", "Heat the olive oil and butter in a large frying pan. Add the remaining onions and cook over a low-medium heat, without browning, for about five minutes, or until softened, then add the flour. Turn up the heat and then add the mushrooms and cook for a further 3-4 minutes. ", "Strain the reduced stock, then add it to the mushrooms and cook for one minute. Pour in the wine and cream, then bring to the boil, reduce the heat and simmer for five minutes, or until nicely thickened. Season, then pour it over the chicken and sprinkle tarragon leaves over the top. ", "Roll out a rectangle of pastry 2cm/¾in wider than the pie dish. Brush the edges of the dish with beaten egg and lay the pastry on top, crimping the edges with a fork or your fingertips. Trim away any excess pastry and brush the top of the pie with the remaining egg. Place on a baking tray and bake for 30-35 minutes, or until the pastry is crisp and golden-brown. ", "For the carrots and peas, heat a frying pan until hot. Add the butter, sugar and five tablespoons of water and cook until the volume of liquid has reduced slightly. Add the carrots and cook for a couple of minutes, then add the peas and continue to cook until they are tender and the liquid has reduced to a glaze.", "To serve, remove the pie from the oven and allow to cool slightly before serving with the carrots and peas."]}, {"isVegetarian": false, "title": "Chicken and truffle tortellini with a cream and chive sauce", "url": "www_bbc_co_uk_food_recipes_chicken_and_truffle_55068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz 00 pasta flour, plus extra for dusting", "3 free-range eggs", "½ chicken breast, roughly chopped", "100-200ml/3½-7fl oz double cream", "fresh truffle, to taste", "salt and freshly ground pepper", "2 tbsp unsalted butter, plus extra to finish", "1 shallot, finely chopped", "1 garlic clove, chopped", "150ml/5fl oz white wine", "150ml/5fl oz chicken stock", "2 tbsp unsalted butter", "2 tbsp fresh chives, chopped", "fresh truffle shavings, to taste", "1 head kale, leaves shredded", "2 tbsp unsalted butter"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pasta, put the flour and 2 of the eggs in a food processor and pulse until the mixture resembles breadcrumbs. Turn the mixture out onto a floured work surface and gently work the mixture together to form a dough.", "Lightly knead the dough for 2-3 minutes, or until it is smooth and elastic. Roll into a ball, cover with cling film and chill in the fridge for at least 20 minutes.", "Remove the dough from the fridge and discard the cling film. Lightly flour your pasta machine to prevent the dough from sticking. Flatten the dough ball slightly with a rolling pin, then starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process, flouring the machine and changing the setting down each time, until you reach the thinnest setting. You can cut the pasta into smaller individual sheets and work on them individually, keeping the remaining unused dough covered under cling film to prevent them from drying out.", "Place the chicken, half the cream, truffle shavings and salt and pepper into a food processor and blend unto smooth. Add more cream until you have a spoonable texture.", "Beat the remaining egg in a bowl. Cut out circles from the pasta sheets using a 4-5cm/1.5-2in pastry cutter, then brush each circle with the beaten egg. Place a heaped teaspoon of the chicken and truffle filling onto one half of each circle, then fold the other half of the pasta over, so that it forms a half-moon shape. Press together to seal. Bring the bottom two corners of the half-moon together to create a circle and pinch to seal. Repeat with the remaining pasta, placing each completed tortellini on a tray lined with greaseproof paper. Set aside.", "For the cream and chive sauce, heat the butter in a saucepan until melted. Add the shallot and cook for 2 minutes, then add the garlic and cook for a further minute. Pour in the white wine and cook until the volume of liquid is reduced by half. Pour in the stock and reduce by half again. Pass through a fine sieve and pour into a clean pan, heat and add a touch of butter. ", "To finish, put a pan of boiling salted water on the hob and blanch the kale for a minute. Drain well. Melt the butter in a large frying pan and add the kale. Fry gently until tender.", "Cook the tortellini in a large pan of boiling salted water for 2-3 minutes. Drain well then add the tortellini and chives to the sauce and mix. Cut open one of the tortellini to check the chicken is cooked through, if not, continue to heat them in the pan.", "Place the wilted kale in the centre of serving bowls, top with the tortellini and freshly grated truffle."]}, {"isVegetarian": false, "title": "Chicken and wild mushroom pie", "url": "www_bbc_co_uk_food_recipes_chicken_and_wild_04860", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_wild_04860_16x9.jpg", "ingredients": ["250g/9oz plain flour", "250g/9oz very cold butter, cut into small cubes", "½ tsp salt", "125ml/4fl oz ice-cold water", "25g/1oz butter", "1 banana shallot, finely chopped", "1 garlic clove, finely sliced", "2 large boneless and skinless chicken breasts, cut into 1cm/½in thick slices", "150g/5½oz mixed mushrooms, such as chanterelle, girolles and chestnut mushrooms, chestnuts cut into quarters, rest left whole", "50ml/2fl oz Madeira", "150ml/5fl oz chicken stock", "2 tbsp chopped tarragon leaves", "200ml/7fl oz double cream", "2 free-range egg yolks, lightly beaten", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, place the flour in a mound on a clean work surface and make a well in the centre. Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand.", "When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in completely.", "Roll the mixture into a 2.5cm/1in-thick rectangle, wrap in cling film and refrigerate for 20 minutes.", "When the pastry is chilled, flour the work surface and roll out the pastry into a 40x20cm/16x8in rectangle.", "Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn.", "Roll the block of pastry into a 40x20cm/16x8in rectangle as before, and fold it into three again. These are the first two turns. Rest the pastry in the fridge for at least 20 minutes between turns. Repeat two more times to make four turns.", "Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.", "For the pie, preheat the oven to 200C/180C Fan/Gas 6.", "Heat a large ovenproof frying pan until hot, add the butter and when the butter is foaming, add, the shallot and garlic and fry for a minute. Add the chicken and fry until just coloured.", "Add the mushrooms and fry over a high heat for 2-3 minutes, or until just softened. Add the Madeira and flambé by tipping the pan towards the flame or  carefully lighting using cooks' matches. (CAUTION: make sure there are no flammable materials above the pan when flaming.)", "Add the chicken stock and bring to a simmer, then add the tarragon and cream and simmer for five minutes. Add salt and pepper to taste and then set aside to cool.", "Roll out the pastry until it is 5cm/2in wider than the ovenproof frying pan and about 4-5mm thick. Brush the edges of the frying pan with beaten egg and then lay the pastry over the top of the pie filling and crimp at the edges. Trim away any excess pastry and brush the top of the pie with the remaining egg. Use any pastry trimmings to make leaves to decorate the top of the pie.", "Bake for 25 minutes, or until the pastry is crisp and golden-brown and the filling bubbling."]}, {"isVegetarian": false, "title": "Chicken 'ayam sioh'", "url": "www_bbc_co_uk_food_recipes_chicken_ayam_sioh_02588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2kg/4lb 8oz chicken", "chicken stock, enough to cover the chicken", "1 sheet palm sugar", "80ml/3fl oz light soy sauce", "460g/1lb 1oz tamarind", "25g/1oz coriander seeds, bashed and wrapped in muslin", "240g/8½oz shallots, diced and bashed with a pestle and mortar ", "135ml/4½fl oz rice vinegar", "1kg/2lb 4oz cockles, cleaned and drained (discard any cockles that remain open after cleaning)", "1.5kg/3lb 5oz turnip tops, discard the large outer leaves, keeping just the hearts", "100g/3½oz butter", "200ml/7fl oz chicken stock", "4 large banana shallots, halved", "100g/3½oz butter", "25g/1oz sugar", "2 sprigs thyme", "200ml/7fl oz chicken stock", "2kg/4lb 8oz chicken wings, each wing chopped into 3 pieces", "4 tbsp olive oil", "reserved cockle meat (from above)", "2 shallots, sliced", "1 sprig thyme", "1 tsp black peppercorns", "50g/1¾oz butter", "500ml/18fl oz reserved cockle cooking liquor (from above)", "200ml/7fl oz brown chicken stock", "oyster leaf (available online)", "oil infused with coriander"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken, bring the stock to the boil in a large pan. Add the chicken and make sure it is well covered with the stock. Simmer to poach until cooked through, this should take about 50 minutes to 1 hour. ", "For the tamarind paste, melt the palm sugar with the soy sauce in a pan. Add the tamarind, coriander seeds, and shallots to different pan. Once the palm sugar has melted add it to the shallot pan. Cook on a low heat for around 6 hours until thick and reduced in volume. Add the rice vinegar. Cook for a further 20 minutes then leave to cool.", "Add the cockles and 300ml/10fl oz water to a large lidded pan. Cover and steam the cockles until they have opened. Drain the cockles reserving the cooking liquor. Discard any cockles that have not opened. Pass the cooking liquor through a fine sieve and set aside. Remove the cockle meat from the shells, cool over iced water and set aside. ", "For the vegetables, add the butter and stock to a large pan and mix well. Add the turnips and cook until tender. ", "For the shallots, add the shallots, butter, sugar, thyme and chicken stock to a large pan and cook over a low heat until the shallots are caramelised. This will take about 25 minutes. ", "For the sauce, place the chicken wings in a large roasting tray with the olive oil and cook over a high heat for 2-4 minutes until golden-brown. ", "Add the cockle meat, shallots, thyme and black peppercorns to the chicken wings. ", "When the shallots have caramelised, add the butter and reserved cockle cooking liquor and scrape the pan to de-glaze. When the sauce is reduced to a syrup, add the brown chicken stock and cook for 20 minutes. Pass through a chinois (fine sieve), return to the pan and cook until the volume of liquid has reduced by half. ", "Just before serving, portion the chicken and fry it in a little butter.", "To serve, place the chicken on a large plate along with the tamarind paste, shallots and sauce. Garnish with the turnip tops and oyster leaves. Drizzle with the coriander infused oil."]}, {"isVegetarian": false, "title": "Chicken, avocado and bacon salad", "url": "www_bbc_co_uk_food_recipes_chicken_avocado_and_08446", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_avocado_and_08446_16x9.jpg", "ingredients": ["300ml/10fl oz natural yoghurt", "½ lemon, juice only", "1 tbsp chopped tarragon leaves ", "2 small spring onions, finely sliced", "1 tbsp Dijon mustard ", "1 tsp caster sugar ", "2 tsp white wine vinegar", "salt and freshly ground black pepper", "1 cooked chicken, skin removed and meat sliced into pieces", "6 rashers smoked streaky bacon", "2 Little Gem, leaves separated", "50g/1¾oz rocket ", "2 small avocados, sliced", "25g/1oz pumpkin seeds, toasted", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["To make the yoghurt and tarragon dressing, measure all of the ingredients into a bowl. Season with salt and pepper. Add the cooked chicken to the dressing and coat in the mixture. Cover and leave to marinate in the fridge for 2 hours, or overnight.", "Cook the bacon under the grill or in a pan until crisp and golden-brown. Set aside on a piece of kitchen paper. Once cold, snip into little pieces. ", "Arrange two or three lettuce leaves closely together to make a cup shape on a large platter. Top with some rocket leaves. Repeat, so that you have six cups of lettuce arranged in a circle to look like a wreath.", "Spoon the chicken salad on top. Arrange the avocado on top of the chicken. Sprinkle with pumpkin seeds and bacon pieces. Season with salt and pepper and serve."]}, {"isVegetarian": false, "title": "Chicken, bacon and butternut squash pie", "url": "www_bbc_co_uk_food_recipes_chicken_bacon_butternut_06664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp ground turmeric", "400g/14oz plain flour, plus 2 tbsp flour, for dusting", "1 tsp salt", "2 tbsp olive oil", "cornflour, for dusting", "250g/9oz unsalted butter melted", "1 cinnamon stick", "1 tsp black peppercorns", "1 tsp coriander seeds", "1 tsp cumin seeds", "1 tsp green cardamom pods", "½ nutmeg, freshly grated ", "½ tsp ground allspice", "1 tsp ground ginger", "1 tsp ground turmeric", "2 whole cloves", "2 blades mace ", "½ tsp nigella seeds", "½ tsp ground cayenne pepper", "1 tbsp rose petals ", "salt, to taste", "600g/1lb 5oz butternut squash, peeled and cut into 3cm/1¼in cubes", "3 tbsp olive oil", "3 large red onions, sliced into half rings", "knob of butter", "150g/5½oz smoked lardons ", "900g/2lb chicken thighs with skin removed and reserved, meat chopped into bite-sized pieces ", "100g/3½oz pine nuts, toasted in a dry pan", "20g/¾oz pork scratchings ", "10g fresh coriander, leaves chopped ", "2 tbsp pine nuts, toasted in a dry pan", "2 tsp grains of paradise (West African spice available from specialist spice suppliers)", "handful baby spinach leaves", "¼ pomegranate, seeds only"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, combine the turmeric, flour and salt in a large bowl and add enough water to bring the dough together (approximately 330ml/11fl oz water). Add the olive oil and knead until the dough is pliable. Divide into 30g/1oz balls and place on a baking tray. Cover with cling film and set aside to rest for two hours in a cool place (ideally 15C/60F).", "For the ras-el-hanout, toast the cinnamon, peppercorns, coriander seeds, cumin seeds and cardamom pods in a dry frying pan. Blend the toasted spices in a spice grinder with the remaining spice mix ingredients. ", "For the filling, preheat the oven to 180C/160C(fan)/Gas 4. Toss the butternut squash in a little of the oil on a roasting tin and bake until just tender (about 30 minutes). In a frying pan, heat the butter and remaining olive oil. When hot, fry the onions until caramelised. In a separate pan, fry the lardons until crisp. Add the chicken and fry for a further five minutes, or until just cooked. Remove from the heat and stir into the onion mixture along with the ras-el-hanout. Set aside to cool. ", "When the butternut squash is cooked, remove from the oven and set aside to cool. Mix the toasted pine nuts into the filling.", "Keep the oven at 200C/fan oven 180C/400F/Gas 6.", "For the pastry, cover a table with a clean, cotton sheet dusted with cornflour. Using your hands, gently begin to stretch the dough until it is very thin and translucent. Place your hands underneath the dough and stretch and pull the dough thinner using the backs of your hands. Dust very lightly with flour and set aside for at least 30 minutes to dry out slightly. ", "When ready to assemble, dab the dough with melted butter and cut out 30cm/12in squares of pastry. Arrange the pastry squares in a well-greased savarin mould, so that they overlap and cover the whole ring of the mould with lots left hanging over the outside edges. Pack the cooled filling round inside the ring. Lift up the edges of the pastry and fold over to cover the filling. Press to seal any joins in the pastry. Cover with a well-greased baking tray and turn the whole lot upside down. Remove the savarin mould. Brush the outside of the pastry with butter.", "Bake for 20-25 minutes, or until the pastry is golden-brown and crisp. ", "To decorate, fry the reserved chicken skin in a pan until crisp, set aside to cool and then tear into small pieces. Just before serving, combine the chicken skin with the remaining ingredients apart from the spinach and pomegranate. ", "To serve, sprinkle over the chicken skin mixture and fill the centre with baby spinach and sprinkle with pomegranate seeds."]}, {"isVegetarian": false, "title": "Chicken bastilla", "url": "www_bbc_co_uk_food_recipes_chicken_bastilla_07910", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_bastilla_07910_16x9.jpg", "ingredients": ["1 tbsp olive oil", "4–6 large chicken thighs (around 750g/1lb 10oz), boneless", "10g/½oz butter", "2 onions, finely chopped", "2 garlic cloves, finely chopped", "1 tsp ground ginger", "½ tsp ground cinnamon", "½ tsp ground turmeric", "pinch of saffron", "500ml/18fl oz chicken stock or water", "3 large free-range eggs, beaten", "75g/2½oz ground almonds or pistachios", "75g/2½oz dried dates, finely chopped", "1 tbsp orange blossom water", "1 tsp finely grated orange zest", "4 tbsp finely chopped fresh parsley", "30g/1oz butter, melted", "6 large sheets filo pastry", "1 egg, beaten, to glaze", "salt and freshly ground black pepper", "1 tbsp icing sugar, to garnish", "pinch of ground cinnamon, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan. Add the chicken and fry, skin side-down for 2 minutes, or until crispy and brown. Turn over and cook for 2 minutes more, then transfer to a plate. Add the butter to the pan and, when it has melted, add the onions and sauté until soft. Add the garlic and spices (no need to soak the saffron) and fry for a couple more minutes. ", "Return the chicken to the pan. pour over the stock and season to taste. Simmer, covered, for 30 minutes, or until the chicken is cooked through and tender. ", "Remove the chicken again and set aside. When it is cool enough to handle, finely chop it. Meanwhile, reduce the cooking liquid by half. ", "Add the eggs to the cooking liquid and cook over a low heat until it resembles loose-textured scrambled eggs. Add the almonds and stir, then stir in the dates, orange blossom water, orange zest, chicken and finally the parsley. Remove from the heat and leave to cool.", "Preheat the oven to 180C/160C Fan/Gas 4. To assemble the pie, use a 28cm/11in round ovenproof dish – you can use a ceramic quiche or flan dish or a metal tart tin. ", "Brush a sheet of filo with melted butter. Drape it over the dish, gently pushing it into the corners without tearing it. Repeat with another sheet of filo, placing it at right angles to the first. Repeat with a further 2 sheets of filo, placing them on a diagonal angle. ", "Spread the filling over the pastry. Fold over the overhanging filo, in reverse order – the filling should be just about covered by the filo. Cut the remaining 2 sheets of filo to fit the dish. Brush with melted butter, then cover the pie with the pastry, tucking under any corners. Bake for 30 minutes, or until crisp and brown. Leave to cool a little before dusting it with the icing sugar and cinnamon."]}, {"isVegetarian": false, "title": "Chicken blanquette with roasted shallots and fresh garden peas", "url": "www_bbc_co_uk_food_recipes_chicken_blanquette_with_65245", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 kg/2lb 4oz chicken, cut into 8 pieces", "1 carrot, halved", "1 small onion, halved", "1 leek, quartered", "1 garlic clove, crushed", "1 large sprig of thyme ", "1 bay leaf", "25g/1oz butter, plus extra for frying", "25g/1oz plain flour ", "1 litre/1¾ pints chicken cooking liquor (from above)", "110g/4oz baby onions", "110g/4oz button mushrooms, quartered ", "4 free-range egg yolks ", "110ml/4fl oz double cream ", "3 tbsp tarragon leaves, picked", "4 banana shallots, halved", "2 tbsp olive oil", "400g/14oz fresh garden peas, podded", "50g/1¾oz butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To poach the chicken, place the chicken pieces in a large saucepan and cover with 2 litres/3½ pints of water. ", "Add the carrot, onion, leek, garlic, thyme and bay leaf. Bring to a gentle boil then turn down to a simmer and cook for 1¼ hours. ", "When the meat is tender, remove from the heat. Drain the chicken, reserving 1 litre/1¾ pints of the cooking liquor for making the sauce. Set aside. ", "To make the sauce, heat a heavy based saucepan over a medium heat, add the butter. When melted, add the flour and keep stirring until it is completely absorbed. ", "Gradually whisk in the reserved poaching liquor, stirring until all the liquor has been incorporated. ", "Drain the meat again and discard any remaining liquor along with the carrot, onion, bay leaf, clove and thyme. ", "Place the meat into the sauce.", "Heat a frying pan over a medium heat, add a little more of the butter and the baby onions. Cook until slightly coloured  then add the mushrooms and cook for a further two minutes. ", "Tip the onions and mushrooms into the chicken and sauce.", "Whisk the egg yolks and cream together in a bowl then gradually add to the pan, whisking as you go. ", "Remove from the heat and continue to whisk for a couple of minutes. ", "Stir in the tarragon and season to taste with salt and pepper. Keep warm until ready to serve.", "For the roasted shallots and fresh garden peas, preheat the oven to 200C/400F/Gas 6.", "Heat a large griddle pan and drizzle the oil over the cut side of the shallots. Place on the griddle pan cut-side down and cook for 2-3 minutes, or until coloured and charred. Turnover and cook for a few more minutes, then place in the oven for 15-20 minutes.", "Meanwhile heat a saucepan of boiling water and season with salt. Once boiling, add the peas and cook for 3-4 minutes then drain.", "Heat a frying pan and add the butter and peas, season with salt and pepper and cook gently for a few minutes.", "To serve, place a couple of pieces of chicken on each plate and spoon over the sauce. Place the roasted shallots and peas next to the chicken."]}, {"isVegetarian": false, "title": "Chicken braised in cider and chorizo", "url": "www_bbc_co_uk_food_recipes_chicken_braised_in_cider_22812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_braised_in_cider_22812_16x9.jpg", "ingredients": ["2 tbsp olive oil", "4 whole chicken legs (drumstick and thigh separated)", "225g/8oz chorizo, diced", "6 shallots, peeled, finely chopped", "2 tbsp plain flour", "600ml/1 pint dry cider", "150ml/¼ pint chicken stock", "1 heaped tbsp Dijon mustard", "salt and freshly ground black pepper", "3 tbsp double cream", "1 celeriac, peeled, chopped", "squeeze fresh lemon juice", "25g/1oz butter", "1-2 tbsp single cream", "salt and freshly ground white pepper", "steamed green beans, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chicken, preheat the oven to 190C/375F/Gas 5. Heat the oil in a large ovenproof frying pan and add all the chicken pieces to the pan. Cook for 10-12 minutes turning frequently until evenly browned. Remove with a slotted spoon and set aside.", "Add the chorizo and shallots to the pan and fry, stirring frequently for five minutes, or until softened and the fat is beginning to run from the chorizo. Sprinkle in the flour and stir to coat. ", "Gradually pour in the cider and stock, stirring continuously until boiling and thickened slightly. Stir in the mustard, season well with salt and pepper and return the chicken to the frying pan.", "Cover the frying pan with aluminium foil and cook in the oven for 35-40 minutes, or until the chicken’s juices run clear when pierced with a skewer. ", "For the celeriac mash, place the celeriac in a saucepan and cover with water and a squeeze of lemon juice. Bring to the boil, then reduce the heat, cover and simmer for about 15 minutes, or until tender. ", "Drain the celeriac well and tip it back into the pan. Mash over a low heat with the butter and single cream. Season with salt and white pepper. ", "To serve, stir the double cream into the chicken liquor and serve the chicken and sauce with the celeriac mash and steamed green beans."]}, {"isVegetarian": false, "title": "Very posh chicken breast fricassée with lemony artichokes and mushrooms", "url": "www_bbc_co_uk_food_recipes_chicken_breast_served_18110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180g/6oz sea salt", "180g/6oz caster sugar", "4 chicken breasts", "plain flour, for dusting", "25g/1oz butter", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 globe artichokes", "1 unwaxed lemon, zest and juice", "25g/1oz butter", "1 tbsp olive oil", "1 shallot, finely chopped", "2 garlic cloves, crushed", "200g/7oz mushrooms, sliced", "200ml/7fl oz dry white wine ", "1 bunch fresh basil, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To brine the chicken, dissolve the salt and sugar in 1.4litres/2½pints lukewarm water. Add the chicken, cover and transfer to the fridge. Leave to brine for at least 2 hours. ", "To prepare the artichokes, cut off the stalk about 1cm/½in from the globe. Peel off the outer leaves, brushing the white heart with lemon juice as you go to prevent it going black. When you have reached the heart, cut off the top about a third of the way up from the base and discard the top two-thirds. Scrape the hairy choke from the centre of the artichoke using a spoon.", "Using a small knife, carve off the outer skin of the heart, applying lemon juice liberally as you go. Cut into about six slices and simmer in boiling water for 5 minutes, or until cooked through. Cover and set aside. ", "Discard the brine and blot the chicken dry using kitchen paper. Place between two pieces of cling film and, using a rolling pin, beat the chicken breasts until they are all an even thickness. Season well with salt and pepper and coat in the flour. ", "In a lidded sauté pan, melt the butter and olive oil over a medium heat. Add the chicken and cook for 2 minutes on each side, or until golden-brown. Place the lid on and cook gently for ten minutes. Lift the chicken from the pan, wrap in aluminium foil and set aside to rest for 10 minutes.  ", "To finish the artichokes, add the olive oil and butter to the sauté pan. Over a medium heat, gently cook the shallot until soft and translucent. Add the garlic and cook for a further minute. Stir the artichokes and mushrooms in and cook until they just start to colour. ", "Add the wine and any remaining lemon juice and cook until the volume of liquid has reduced by half. Remove from the heat and fold through the lemon zest and basil. To serve, place the veggies in the middle of four plates, top with a chicken breast and a drizzle of the resting juices.  "]}, {"isVegetarian": false, "title": "Chicken burritos with pico de gallo", "url": "www_bbc_co_uk_food_recipes_chicken_burritos_with_11821", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_burritos_with_11821_16x9.jpg", "ingredients": ["2 limes, juice only", "2 garlic cloves, crushed", "4 tbsp olive oil", "1 heaped tsp dried oregano", "1 tsp chilli flakes", "1 tsp brown sugar", "4 chicken thighs, boneless, skin removed", "flaked sea salt and freshly ground black pepper", "2 chipotles en adobo, finely chopped ", "2 tbsp soured cream", "2 tbsp mayonnaise ", "1 lime, juice only", "2 large ripe tomatoes, deseeded and finely chopped", "½ onion, finely chopped", "handful fresh coriander, roughly chopped", "1 green serrano or jalapeno chilli, finely chopped", "1 lime, juice only", "1 green jalapeno or serrano chilli, deseeded and finely chopped", "½ small onion, finely chopped", "1 large ripe avocado, stone and skin removed", "1 lime, juice only", "small handful fresh coriander, roughly chopped", "150g/5½oz long-grain white rice ", "4 large flour tortillas ", "4 tbsp freshly grated mozzarella", "4 tbsp soured cream", "½ Little Gem lettuce, shredded"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the chicken, mix the lime juice, garlic, oil, oregano, chilli, sugar and salt and pepper together in a large bowl. Add the chicken, cover and place in the fridge for at least 2 hours. ", "Meanwhile, to make the chipotle crema, mix the chipotles en adobo, soured cream and mayonnaise with a squeeze of lemon juice and a pinch of salt and set aside. ", "To make the pico de gallo, mix all the ingredients together with ½ teaspoon of salt in a bowl and set aside.", "To make the guacamole, pound the chilli in a pestle and mortar with the onion and ¼ teaspoon of salt, into a lumpy paste. Add the avocado and break up the flesh roughly with a fork. The result should be lumpy not smooth. Stir in the lime juice, to taste, and the chopped coriander.", "Place a frying pan over a high heat and cook the chicken thighs, without the marinade, until browned and sealed. Add the marinade to the pan, cover with a lid and cook for 10–15 minutes, or until the chicken is cooked through as the juices run clear. Slice the chicken into strips. ", "Meanwhile, cook the rice according to packet instructions.", "Divide the tortillas between four plates and top with the rice, chicken, sauces, mozzarella and lettuce. Fold up the bottom of each tortilla, then fold the sides in and roll to contain the filling. Cut in half to serve."]}, {"isVegetarian": false, "title": "Chicken, buttermilk and wild garlic pie", "url": "www_bbc_co_uk_food_recipes_chicken_buttermilk_and_11923", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "8 boneless, skinless chicken thighs", "30g/1oz unsalted butter", "2 leeks, finely sliced into rounds", "30g/1oz plain flour", "175ml/6fl oz dry white wine", "500ml/18fl oz fresh chicken stock", "250ml/9fl oz buttermilk", "1 bunch wild garlic, (about 10 leaves)", "pinch freshly grated nutmeg", "salt and freshly ground black pepper", "420g/15oz plain flour, plus extra for dusting", "250g/9oz ice cold unsalted butter, cut into cubes", "60g/2¼oz parmesan, grated", "1 tsp salt ", "1 tsp cayenne pepper", "1-2 tsp ice cold water", "1 free-range egg, beaten"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the filling, heat the oil over a high heat in a frying pan with a lid. Fry the chicken thighs for 5–10 minutes, until they are deep golden-brown on both sides. You may need to do this in two batches. Remove from the pan and set aside.  ", "Turn the heat down to low and add the butter to the pan along with the leeks and gently fry for 10 minutes, covered, until softened but not browned. Add the flour and cook for a couple of minutes. Add the white wine and allow to bubble for a minute, stirring, then add the chicken stock. Add the chicken back into the pan, cover and simmer for about 20 minutes. Add the buttermilk and continue to cook for a further 20 minutes, until the meat is very tender and the sauce is well thickened. ", "Meanwhile, put the wild garlic into a food processor and blend to a fine purée.", "Remove the pie filling from the heat, stir through the wild garlic purée, and season well with nutmeg, salt and pepper. Transfer the filling to a bowl and allow to cool completely. Refrigerate for at least an hour, but overnight is preferable. ", "For the pastry, add the flour, butter, parmesan, cayenne and salt to a food processor and quickly pulse to a breadcrumb consistency. Add a teaspoon of cold water at a time until the pastry just comes together. Be careful not to make the pastry too wet or it will be tough. Tip out onto a floured surface and bring together lightly into a ball. Cut one-third of the pastry off for the pie top. Wrap both pieces in cling film and place in the fridge for at least 30 minutes. ", "To assemble the pie, dust your work surface lightly with flour, then roll out the larger portion of pastry until it is the thickness of a pound coin. Dust your rolling pin with flour, and carefully drape the pastry over it. Transfer the pastry from the pin into a 23cm/9in pie dish. Carefully line the base of your dish, pressing down into the corners. Leave the edges untrimmed at this stage. ", "Fill the lined pie dish with the cold filling and brush the edges of the pastry with the beaten egg. Roll out the smaller portion of pastry to make the top. Use the rolling pin as before to transfer the pastry to the top of the pie. With a sharp knife, trim off the excess pastry to make a neat edge. You can push down the edges with a fork to seal them tight, or crimp them.  Push the pastry down towards the outside of the dish with one finger. Pinch the pastry around that finger with the finger and thumb of your other hand to create a scallop. Repeat all along the edge. ", "Roll out any excess pastry and using a cutter of your choice, (I went for hearts), make some decoration for the lid of the pie. Brush with the beaten egg and return to the fridge for 30 minutes. ", "Preheat the oven to 190C/170C Fan/Gas 5. ", "Glaze the top of the pie once more, then bake for 35–40 minutes, or until the pastry is golden brown and cooked all the way though. Delicious served with buttery mash and spring greens. "]}, {"isVegetarian": false, "title": "Mediterranean chicken with potatoes", "url": "www_bbc_co_uk_food_recipes_chicken_cacciatore_with_54620", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cacciatore_with_54620_16x9.jpg", "ingredients": ["1 tbsp olive oil ", "400–500g/14oz-1lb 2oz chicken thighs, skin on and bone in", "1 onion, diced ", "1 carrot, finely diced ", "2 garlic cloves, sliced", "400g tin tomatoes ", "250ml/9fl oz chicken stock", "1 tsp dried mixed herbs ", "600g/1lb 5oz potatoes, cut into bite-sized pieces", "salt and pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a medium heat. Add the oil and, once hot, add the chicken thighs, skin side down. Brown the chicken on each side for 3-4 minutes, or until nicely golden-brown all over. Remove the thighs from the pan and set to one side.", "Add the onion and carrot with a pinch of salt to the saucepan and stir over the heat. Fry for 6-7 minutes, or until the onions are soft and translucent. Add the garlic and continue to cook for two more minutes.", "Add the browned chicken back to the pan along with any juices from the meat. Pour over the tomatoes, stock and mixed herbs and mix well to make sure everything is evenly distributed. Season with a little salt and pepper, cover with a lid and gently simmer for 20 minutes, or until the chicken is cooked through and the sauce thickened slightly.", "Meanwhile boil the potatoes in a saucepan of boiling water for 10-12 minutes, or until tender and cooked through. Drain and serve alongside the cooked chicken."]}, {"isVegetarian": false, "title": "Chicken cacciatore with white bean mash and garlic green beans", "url": "www_bbc_co_uk_food_recipes_chicken_cacciatori_with_31318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cacciatori_with_31318_16x9.jpg", "ingredients": ["4 chicken legs (alternatively use thighs or drumsticks)", "15g/½oz plain flour", "2 tbsp olive oil", "70g/2½oz pancetta, diced", "1 onion, finely chopped", "1 carrot, finely chopped", "1 celery stick, finely chopped", "2 garlic cloves, finely chopped", "2 fresh rosemary sprigs ", "200g/7oz mixed wild mushrooms, sliced", "200ml/7fl oz red wine, preferably chianti", "2 tbsp tomato purée", "400–500ml/16–18fl oz fresh chicken stock", "2 dried chillies", "1 tbsp baby capers", "100g/3½oz black olives, pitted", "salt and freshly ground black pepper", "handful fresh flat-leaf parsley, chopped, to serve", "4 tbsp olive oil", "2 garlic cloves, crushed", "1 fresh rosemary sprig ", "1 unwaxed lemon, finely grated zest only", "2 x 400g tins butter, cannellini or haricot beans, drained and rinsed", "extra-virgin olive oil, for drizzling", "300g/10½oz green beans", "30g/1oz butter", "1 garlic clove, thinly sliced", "pinch chilli flakes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Season the chicken with salt and pepper and dust with flour. Heat the olive oil in an ovenproof casserole over a medium heat and colour the chicken on all sides. Transfer to a plate and set aside.", "Add the pancetta, onion, carrot, celery, garlic and rosemary to the pan and gently fry, allowing the veg to soften in the fat released from the pancetta. Add the mushrooms and fry for 5 minutes, or until brown and softened. ", "Pour in the wine and simmer until it has reduced by two-thirds. Add the tomato purée and stock, then return the chicken to the pan along with the dried chillies, capers and olives. Season and bring to the boil. Cover with a lid and bake for 45–50 minutes, or until the chicken is cooked through. Remove the lid for last 10 minutes if the liquid is too saucy. ", "Meanwhile, to make the white bean mash, heat the olive oil in a saucepan over a low heat. Add the garlic, rosemary and lemon zest and cook for 2–3 minutes. Remove the rosemary and place to one side. Add the beans to the pan and warm through, stirring and squishing using a wide, flat spoon so they become a bumpy mash. Season, garnish with the saved rosemary and drizzle with extra-virgin olive oil.", "To make the green beans, bring a large saucepan of salted water to the boil and blanch the beans for 3 minutes. Drain and dry. Melt the butter in a pan over a low heat and add the garlic. Tip in the beans and toss with salt and a pinch of chilli flakes.", "Serve the chicken in its sauce, scattered with parsley, alongside the bean mash and garlic green beans. "]}, {"isVegetarian": false, "title": "Chicken caesar salad with crunchy grapes, spicy pecans and rosemary croutons", "url": "www_bbc_co_uk_food_recipes_chicken_caesar_salad_61098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices spelt loaf bread, sliced into thin croûtons", "2 tbsp olive oil", "2 sprigs rosemary, leaves picked and roughly chopped", "125g/4½oz butter", "150g/5½oz brown sugar", "two pinches cayenne pepper", "300g/10½oz pecans", "50g/1¾oz egg white, beaten until frothy", "1 whole chicken", "1 carrot, cut into chunks", "1 celery stick, cut into chunks", "1 onion, peeled and cut into chunks", "1 sprig thyme", "1 sprig rosemary", "2 garlic cloves, peeled and smashed", "1 Cos lettuce, roughly chopped ", "1 Little Gem lettuce, roughly chopped", "1 bulb of garlic, top cut off", "1 sprig of rosemary", "1 tbsp olive oil", "2 free-range egg yolks", "1 tsp Dijon mustard", "2 tsp white wine vinegar", "300ml/10fl oz rapeseed oil", "salt and freshly ground black pepper", "2 tbsp buttermilk", "2 tbsp crème fraîche", "2 tbsp honey", "50ml/2fl oz rapeseed oil", "10g black sesame seeds", "10g fennel seeds", "10g sunflower seeds", "10g wasabi peas", "20g/¾oz puffed rice cereal", "10g shelled pistachios", "50g/1¾oz sugar", "100g/3½oz red seedless grapes", "100g/3½oz green seedless grapes"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the rosemary croûtons, preheat the oven to its lowest setting.", "Place the sliced bread on a baking sheet and drizzle over the oil and sprinkle over the rosemary. Place in the oven for 1-3 hours, or until golden-brown and crisp.", "For the spicy pecans, preheat the oven to 160C/325F/Gas 3", "In a large ovenproof frying pan, melt the butter with the sugar to make a caramel. Add the cayenne pepper then fold in the pecans. Gently fold in the whisked egg whites until all the nuts are coated.", "Transfer the pan to the oven and cook for 25 minutes, stirring two or three times, or until the nuts are crunchy.", "For the chicken Caesar salad, in a large pan add the chicken, carrot, celery, onion, thyme, rosemary, garlic and enough water to cover the chicken. Bring to a simmer on the hob and cook on a medium heat for 50 minutes to an hour.", "Leave to cool in the liquid. Once cool enough to handle, tear the meat from the carcass and set aside.", "To make the dressing preheat the oven to 200C/400F/Gas 6. Place the whole bulb of garlic in aluminium foil with a sprig of rosemary and cover. Place in the oven for 15-20 minutes.", "Place the egg yolks, mustard and white wine vinegar in a food processor and blend. Gradually add the rapeseed oil until you have a smooth mayonnaise then season with salt and pepper.", "For the crunchy grapes, crush together the seeds, wasabi peas, puffed rice cereal and pistachios. Put the sugar in a hot pan and when it dissolves, add the fresh grapes and the seed mixture. Stir it quickly to coat the grapes then set aside.", "To finish the dressing, in a bowl add the buttermilk, crème fraiche, honey and cooked garlic pulp. Whisk in a little oil and add the mayonnaise.", "To serve, in a large glass bowl add the Cos and baby gem lettuce, spicy pecans, crunchy grapes, croûtons, chicken and mix. ", "Pour over the dressing and toss to coat."]}]