[{"ingredients": ["150 g / 5½ oz de mantequilla", "75 g / 2½ oz de chocolate negro", "700g / 1lb 9oz shortbread biscuits", "Chocolate blanco de 900g / 2lb, roto en pedazos", "1,2 kg / 2 libras 12 onzas de queso crema con toda su grasa", "6 huevos de gallinas camperas", "450ml / 16fl oz de crema agria", "1 cucharada de extracto de vainilla", "450 g / 1 libra de frambuesas frescas", "Frambuesas 200 g / 7 oz", "1 cucharadita de azúcar glas, más extra para quitar el polvo", "300 ml / 10 fl oz doble crema", "50g / 1¾oz de chocolate blanco"], "method": ["Precaliente el horno a 170 ° C / 150 ° Ventilador / Gas 3. Engrase y forme la base y los lados de una lata de pastel de 13 cm / 5 pulg., 18 cm / 7 pulg. Y 23 cm / 9 pulg. De profundidad con papel para hornear antiadherente.", "Derrita la mantequilla y el chocolate en una cacerola a fuego lento. Agregue las galletas trituradas y divida entre las 3 latas. Presione uniformemente sobre la base de las latas y enfríe en la nevera mientras realiza el llenado. (Asegúrese de que la base cubra hasta el borde, o la capa superior podría filtrarse a través de la unión en el fondo suelto.)", "Para el relleno, rompa el chocolate blanco en un tazón y derrita muy suavemente sobre una olla de agua caliente (no permita que el chocolate se caliente demasiado), revuelva ocasionalmente con una cuchara hasta que se moje y suavice.", "Batir el queso crema y los huevos juntos en un tazón grande hasta que quede suave, agregar la crema agria y la vainilla y batir de nuevo hasta que esté completamente suave y sin grumos. Agregue el chocolate derretido y mezcle.", "Divide la mitad de la mezcla entre las 3 bases refrigeradas. Esparce las frambuesas sobre la mezcla en cada lata y cúbrelas con la mezcla restante, extendiéndolas uniformemente.", "Hornee en el horno precalentado durante 30-35 minutos para la tarta de queso de 13cm / 5in, 35-40 minutos para la tarta de queso de 18cm / 7in y 40-45 minutos para la 23cm / 9in, hasta que estén firmes alrededor del borde y simplemente coloque la mitad. Retire del horno, y luego deje enfriar a temperatura ambiente antes de transferir a la nevera para enfriar.", "Para la decoración, pulse 50 g / 1¾ oz de las frambuesas con el azúcar glas en un procesador de alimentos para hacer un puré. Pasa a través de un tamiz y descarta las semillas.", "Aparta las tartas de queso de sus latas y coloca la tarta de queso de 23 cm en un plato. Coloque las tortas de queso de 18cm / 7in y 13cm / 5in en tablones de pastel de 3 mm de grosor. Cortar un taco de pastel o un pilar de pastel invisible a la misma altura que la tarta de queso más grande. Presione hacia abajo en el medio de la tarta de queso y coloque la tarta de queso de 18 cm en la parte superior. Repite el proceso con la tarta de queso de 18 cm / 7 pulgadas y coloca la tarta de queso de 13 cm en la parte superior. El pilar o pilar invisible ayuda a soportar las tartas de queso y evita que las capas inferiores sean aplastadas.", "Batir la crema hasta que se formen picos suaves cuando se quite la batidora. Coloque la cuchara en una manga pastelera equipada con una boquilla de estrella mediana. Coloca rosetones de crema muy juntos alrededor del borde superior de los 3 pasteles de queso y cubre cada roseta de crema con una frambuesa. Vierta el coulis de frambuesa en el nivel superior: la crema entubada debe evitar que gotee por los lados.", "Para hacer rizos de chocolate blanco, coloque la barra de chocolate de costado y arrastre la cuchilla de un cuchillo largo y afilado en un ángulo leve hacia usted (para rizos más fáciles, pero más cortos, use un pelador de verduras). Organiza los rizos en el nivel superior."], "url": "www_bbc_co_uk_food_recipes_three-tier_white_23088", "title": "Tarta de queso de tres niveles de chocolate blanco y frambuesa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 24-30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-tier_white_23088_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo blanco de corral", "4 cucharadas de aceite vegetal", "3-4 cucharadas de leche", "125g / 4½oz de harina natural", "1 cucharadita de polvo de hornear", "pizca de mostaza inglesa en polvo", "berro pequeño ensalada de manojo", "15g / ½ oz de queso cheddar rallado", "15 g / ½ oz de queso feta, desmenuzado", "15 g / ½ onza de parmesano rallado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Alinee un molde de muffin mini con cajas de papel.", "Batir la clara de huevo en un bol hasta que esté espumosa, luego mezcle el aceite y la leche. Sazonar con pimienta recién molida negro.", "Mezcle la harina, el polvo de hornear y la mostaza en polvo en un bol.", "Agregue la mezcla de huevo, berros, queso cheddar, queso feta y parmesano hasta que se combinen.", "Coloque la mezcla en el molde para hornear y hornee durante 12-15 minutos, o hasta que las magdalenas estén doradas."], "url": "www_bbc_co_uk_food_recipes_three_cheese_and_cress_14627", "title": "Tres muffins de queso y berros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["800 g / 1¾lb '00' de harina", "Harina de sémola de 200g / 7oz, más extra para quitar el polvo", "1 cucharadita de sal", "1 cucharada de azúcar en polvo", "14 g / ½ oz de levadura seca", "4 cucharadas de aceite de oliva virgen extra", "2 x 400 g / 14 oz latas de tomates San Marzano", "200 g / 7oz de queso mozzarella", "150 g / 5½ oz de queso dolcelatte", "100 g / 3½ oz de queso pecorino (o un queso duro vegetariano similar)", "3 cucharadas de aceite de oliva", "sal marina y pimienta negra recién molida", "puñado de hojas de albahaca", "Cohete de 2 manojos", "75g / 2½ oz de queso parmesano, afeitado (o un queso duro vegetariano similar)", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico"], "method": ["Precalentar el horno a 450F / 220C / Gas 7.", "Para la masa de pizza, coloque las harinas, sal, azúcar y levadura en un tazón grande y revuelva. Haga un pozo en el centro de la harina y vierta en 650 ml / 1 pinta 2 fl oz de agua y el aceite, mezcle gradualmente en la harina para formar una masa suave.", "Incline y amasar sobre una superficie de trabajo engrasada durante aproximadamente 10 minutos o hasta que la masa esté suave y elástica. Colóquelo en un recipiente, cúbralo y déjelo reposar durante dos horas.", "Coloque una bandeja para hornear pesada o piedra para pizza en el estante superior del horno para calentar.", "Cuando la masa haya demostrado, retírela del bol y amasarla durante unos minutos, luego divídala en 6-8 piezas según la cantidad de pizzas que desee preparar. Permita que descanse durante cinco minutos, luego estire cada pieza sobre sus manos para formar un disco de aproximadamente 5 mm / ¼ de grosor.", "Coloque los círculos de masa en bandejas para hornear enharinadas hacia arriba o una cáscara de pizza si tiene uno.", "Para el relleno, coloque los tomates enlatados en un procesador de alimentos y mezcle con un puré. Vierta el puré de tomate sobre las pizzas, espolvoree sobre los quesos y luego vierta sobre el aceite. Sazonar con sal marina y pimienta negra recién molida.", "Deslice una pizza de la bandeja de hornear directamente sobre la bandeja de horno calentada o piedra de pizza en el horno y cocine durante 5-10 minutos, o hasta que estén doradas y crujientes. Repita para cocinar las pizzas restantes.", "Para la ensalada de rúcula y parmesano, coloque el cohete en un bol. Vierte el aceite y el vinagre balsámico en un tazón pequeño y bate. Mezcle el cohete en el aderezo y mezcle el parmesano justo antes de servir.", "Para servir, esparza las hojas de albahaca sobre la pizza y rocíe con un poco más de aceite de oliva. Sirve con la ensalada."], "url": "www_bbc_co_uk_food_recipes_three_cheese_pizza_with_11842", "title": "Tres pizza de queso con ensalada de rúcula y parmesano", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2½oz de mantequilla sin sal, temperatura ambiente", "75 g / 2½ oz manteca de cerdo, temperatura ambiente", "Harina normal de 200g / 7oz", "½ cucharadita de sal", "½ cucharada de vinagre de vino blanco", "aproximadamente 150ml / 5fl oz de agua helada", "30g / 1oz de mantequilla", "280g / 10oz de cebollas, peladas, en rodajas finas", "1 cucharadita de sal", "2 cucharadas de azúcar en polvo", "930 g / 2lb 1 oz papas, preferiblemente variedad Marabel, peladas, finamente cortadas", "140g / 5oz de crema fresca", "4 cucharadas de crema doble", "100g / 3½ oz de queso cheddar maduro, rallado", "100g / 3½oz Stilton, desmenuzado", "100 g / 3½ oz de Gruyère, rallado", "pimienta negra recién molida", "1 cucharadita de nuez moscada rallada", "1 huevo de gallinas camperas, golpeado"], "method": ["Para hacer la masa, coloca la mantequilla y la manteca de cerdo en un tazón y machaca con un tenedor hasta que quede suave y cremoso. Divida la mezcla en cuatro porciones iguales.", "Coloque la harina en un recipiente y agregue la sal. Tome una porción de la mezcla de mantequilla / manteca de cerdo y frote en la harina hasta que la mezcla se asemeje a pan rallado. Agregue el vinagre de vino blanco y mezcle con un cuchillo sin filo. Agregue suficiente agua fría para formar una masa y luego aplíquela sobre una superficie de trabajo enharinada.", "Forme la masa en un rectángulo y extiéndala hasta un grosor de aproximadamente 1 cm / ½ pulg. Suavemente levante la masa con los dedos y permita que retroceda un poco.", "Corte otra porción de la mezcla de mantequilla / manteca de cerdo en trozos pequeños con una espátula y puntee sobre la masa, teniendo cuidado de no acercarla demasiado a los bordes. Doble la masa en tres partes, frotando el exceso de harina a medida que lo hace, cubra con una película adhesiva y colóquelo en la nevera durante cinco minutos.", "Toma la masa de la nevera. Repita los pasos 3 y 4 con la mezcla restante de manteca / manteca. Si se ve algo de grasa en la masa, esparza un poco más de harina.", "Retire la masa de la nevera, gire una vez más en un rectángulo de aproximadamente 1 cm / ½ pulgadas de espesor, dóblela en tercios y vuelva a la nevera durante 30 minutos.", "Mientras tanto, haz el relleno. Caliente la mantequilla en una sartén ancha y agregue las cebollas, la sal y el azúcar. Freír a fuego lento, revolviendo ocasionalmente, durante 5-6 minutos, o hasta que las cebollas estén ligeramente caramelizadas. Retire la sartén del fuego y reserve.", "Cocine las papas en una olla grande con agua salada hirviendo durante ocho minutos, escurra bien y déjelas a un lado.", "Precaliente el horno a 220C / 425F / Gas 7, con un estante justo encima del medio del horno y una bandeja de horno debajo para atrapar cualquier relleno que pueda escapar durante la cocción.", "Mezcle la crème fraîche, la crema y el queso cheddar en un tazón pequeño. Mezcle el Stilton y Gruyère en un recipiente aparte.", "Coloque una cuarta parte de las papas, un tercio de las cebollas y un tercio de la mezcla de Stilton / Gruyère en el fondo de un plato grande. Espolvorear con un poco de pimienta negra recién molida y nuez moscada rallada.", "Repita el paso 11, trabajando desde el exterior del plato para pastel en el medio para lograr un efecto de cúpula, sazonándolo a medida que avanza, luego vierta más de la mitad de la mezcla de crema / queso cheddar. Repita este paso y cubra el relleno con la papa restante, asegurándose de que no quede nada de la mezcla de crema.", "Saque los pasteles del refrigerador y colóquelos en una superficie de trabajo enharinada. Estire en una dirección solamente, gire 45 grados y gire de nuevo hasta que tenga una pieza de masa que sea un poco más grande que el plato de tarta. Levante la masa con los dedos para permitir que retroceda un poco.", "Corte tiras finas de cada borde de la masa y use un poco de huevo para unir cada una al borde del plato para pastel. Cepille cada tira con huevo batido y coloque cuidadosamente la masa sobre el relleno, presionándola sobre las tiras de masa para hacer un buen sellado.", "Tome un tenedor y presione suavemente alrededor de los bordes del pastel. Use cualquier trozo de hojaldre para decorar el pastel y luego cepille la parte superior con el resto de la colada de huevo. Corta una pequeña cruz en la parte superior del pastel para que escape el vapor.", "Transfiera el pastel al horno y hornee durante 30 minutos, luego reduzca el horno a 180 ° C / 350 ° F / Gas 4 y hornee el pastel durante una hora o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_three_cheese_potato_and_30007", "title": "Pastel de tres quesos, patatas y cebolla caramelizada", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4 a 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz patatas de cultivo principal peladas, en cubos", "botón de mantequilla", "un poco de leche", "sal y pimienta", "50g / 1¾oz queso Gruyère, rallado", "75g / 3oz de mantequilla", "2 puerros, en rodajas", "Harina simple de 75g / 2¾oz", "150ml / 5fl oz de vino blanco", "568ml / 1 litro de leche", "2 cucharadas de perejil picado", "750g / 1lb Mezcla de 10oz de salmón, abadejo ahumado y eglefino fresco, despellejado y cortado en cubos", "6 huevos de gallinas camperas, hervidos, pelados y descuartizados"], "method": ["Precaliente el horno a 200C / 400F / Gas 6 (ventilador de 180C).", "Coloque las papas en una olla de agua fría con sal. Llevar a ebullición y cocine a fuego lento hasta que esté completamente tierno. Escurrir bien y luego machacar con la mantequilla y la leche. Agregue pimienta y gusto para verificar el condimento. Agregue sal y más pimienta si es necesario.", "Para el relleno de pescado, derrita la mantequilla en una cacerola, agregue los puerros y revuelva sobre el fuego. Cubra con una tapa y cocine a fuego lento durante 10 minutos, o hasta que esté suave. Mida la harina en un tazón pequeño. Agregue el vino y bata juntos hasta que quede suave.", "Agregue la leche a los puerros, lleve a ebullición y luego agregue la mezcla de vino. Revuelva enérgicamente hasta que espese. Sazonar y agregar el perejil y el pescado. Revuelva sobre el fuego por dos minutos, luego la cuchara en una cazuela a prueba de horno. Dispersión sobre los huevos. Deje enfriar hasta que esté firme.", "Vierta el puré de papas sobre la mezcla de pescado y marque con un tenedor. Espolvorea con queso", "Hornee durante 30-40 minutos, o hasta que esté ligeramente dorado en la parte superior y burbujee alrededor de los bordes."], "url": "www_bbc_co_uk_food_recipes_three_fish_pie_58875", "title": "Pastel de tres pescados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three_fish_pie_58875_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 400 g de garbanzos de hojalata, frijoles, frijoles pinto o borlotti (sin sal añadida), enjuagados y escurridos", "1 cucharada de tahini (opcional - para hacer hummus)", "½ diente de ajo, aplastado", "1 cucharadita de aceite de oliva", "1 cucharadita de jugo de limón, más extra, al gusto", "sal y pimienta para probar", "½ pepino", "150ml / 5fl oz de yogur natural (o una alternativa sin lácteos)", "1 cucharadita de jugo de limón", "racimo pequeño de hierbas frescas como la menta, el cilantro o el perejil (opcional)", "10 tomates cherry (o 3 tomates más grandes)", "1-2 cebollas de primavera, picadas finamente con tijeras", "½ pepino, picado", "½ mango, cáscara extraída por un adulto, picada", "puñado de maíz dulce (fresco, estañado o congelado y descongelado)", "hierbas pequeñas, como menta, cilantro o perejil, picadas (opcional)", "1 cucharadita de aceite de oliva", "exprimir jugo de limón"], "method": ["El trabajo de los niños: para la salsa, coloca los garbanzos o los frijoles en un tazón o en un procesador de alimentos. Licúa o machaca con un tenedor o un triturador (o el extremo de un rodillo) hasta que los frijoles estén crujientes. Algunos frijoles se mezclarán más fácilmente que otros. Puedes dejarlos gruesos o seguir hasta que estén suaves. Agregue el ajo triturado y el tahini (si está usando) y mezcle bien. Para obtener la consistencia correcta \"dippable\", agregue una cucharadita de agua, aceite de oliva y jugo de limón y mezcle bien. Sigue añadiendo agua, aceite y limón hasta que la salsa tenga la textura y el sabor que deseas. Agregue un poco de sal y pimienta, al gusto.", "El trabajo de los niños: para el yogur de pepino, ralla el pepino con un rallador rotatorio o un rallador de cajas (un adulto debe supervisar esto). Agregar a un bol con el yogur, jugo de limón, aceite de oliva. Agregue cualquier hierba, si lo desea, picada con tijeras. Revuelva bien y luego pruebe: agregue más limón o sazone según sea necesario.", "El trabajo de los niños: para la salsa afrutada, pique con cuidado los tomates cherry o los tomates grandes en trozos pequeños usando un cuchillo de ensalada (un adulto debe supervisar esto) revuelva los tomates picados junto con las cebollas picadas, el pepino, el mango y el maíz dulce. Mezcle las hierbas picadas que desee agregar, con una cucharadita de aceite de oliva y pruebe. Es posible que desee agregar un chorrito de limón o una pizca de azúcar.", "Sirva las salsas con pan crujiente, tiras de pan pitta para mojar o use como aderezo para envolturas y sándwiches."], "url": "www_bbc_co_uk_food_recipes_three_easy_dips_for_kids_08808", "title": "Tres baños sencillos para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 3 inmersiones", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three_easy_dips_for_kids_08808_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de condimento de caballeros", "2 cucharaditas de crema doble", "275g / 9¾oz de hojaldre listo para untar con mantequilla", "1 huevo de gallinas camperas, golpeado", "275g / 9¾oz de hojaldre listo para untar con mantequilla", "Pesto de albahaca 125g / 4½ oz", "Bolas de mozzarella para bebé de 200 g / 7 oz", "Tomates de bebé 180g / 6oz en la vid", "1 manojo de albahaca fresca, solo hojas", "275g / 9¾oz de hojaldre listo para untar con mantequilla", "100 g / 3½ oz de queso parmesano, finamente rallado", "100g / 3½ oz emmental, rallado"], "method": ["Para las palmeras de anchoa, precaliente el horno a 200C / 400F / Gas 6.", "En un tazón pequeño, mezcle el condimento con la crema.", "Coloque la masa de hojaldre en una superficie de trabajo limpia.", "Extiende la mezcla por todo el pastel, dejando un borde de 2 cm / ¾ pulg alrededor del borde.", "Comenzando en un extremo de la masa, enrolle la masa hacia el centro.", "Voltea la masa y gira el otro lado hacia el centro para dejar dos rollos iguales de masa pastelera en el centro.", "Cortar la masa enrollada en rebanadas de 1cm / ½ de espesor. Coloque cada rebanada plana en la superficie de trabajo y aplanar ligeramente con un rodillo.", "Coloque las piezas de pastelería en una bandeja de horno. Pincelar con el huevo batido.", "Transfiera las piezas de pastelería al horno y hornee por 12-15 minutos, o hasta que estén doradas y crujientes. Sacar del horno y dejar enfriar.", "Para las tartas de tomate y mozzarella, forrar una bandeja para hornear con pergamino para hornear.", "Con un cortador de 5 cm / 2 pulgadas, corte ocho círculos de la masa de hojaldre y colóquelos en la bandeja de horno revestida.", "Coloque una cucharadita de pesto en el centro de los círculos, dejando un borde de 1 cm / ½ pulgada.", "Coloque una bola de mozzarella en la parte superior y coloque un tomate cherry sobre eso. Cepillo con lavado de huevo alrededor de los bordes.", "Coloque en el horno durante 12-15 minutos. Una vez cocido, retire y decore con hojas de albahaca fresca.", "Para las pajitas de queso, coloque la masa de hojaldre en una superficie de trabajo y cepille toda la hoja de hojaldre con un lavado de huevos.", "Dejando un borde de 2cm / ¾ en el borde, espolvorea la masa con los dos quesos.", "Corta la masa en tiras de 2cm / ¾ de ancho, gira cada una y colócala en una bandeja de hornear engrasada.", "Coloque en el horno para cocinar durante 8-10 minutos, o hasta que estén doradas.", "Para servir, coloque las palmeras, tartas y pajitas de queso en un plato y sirva."], "url": "www_bbc_co_uk_food_recipes_three_ways_with_puff_29378", "title": "Tres formas con la masa de hojaldre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 375g / 13oz", "125g / 4oz de harina de arroz blanco", "375g / 13oz de mantequilla ligeramente salada", "125g / 4oz de azúcar en polvo"], "method": ["Bata la mantequilla y el azúcar hasta que estén pálidos y esponjosos.", "Trabaja tamizado la harina y la harina de arroz en la mezcla de crema hasta que se forme una pasta firme.", "Amasar ligeramente en una tabla bien enharinada.", "Estirar hasta que quede muy delgado (0,5 cm de grosor) y cortar formas de galletas con el cortador de su elección.", "Con una espátula, levante los bizcochos en una bandeja para hornear bien untada con mantequilla y pinche con un tenedor.", "Hornee en el estante central de un horno moderado, 190C / 375F / Gas 5, hasta que tenga un color dorado pálido.", "Retire del horno y espolvoree generosamente con azúcar en polvo mientras aún esté caliente. Levante la bandeja de alambre para enfriar y reafirmar. Almacenar en una lata hermética."], "url": "www_bbc_co_uk_food_recipes_threechimneysshortbr_11894", "title": "Pan dulce de tres chimeneas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 g / 10½ oz de galletas de avena o jengibre", "60 g / 2¼ oz de mantequilla", "450 g / 1lb jar dulce de leche, disponible en delicatessen españolas y algunos supermercados", "3 plátanos maduros grandes, pelados, en rodajas", "350ml / 12¼ fl oz crema doble", "1 cucharada de azúcar glas", "100 g / 3½ oz de chocolate negro, rallado, para servir"], "method": ["Coloque los bizcochos en una bolsa de congelador y aplaste con un rodillo hasta que se asemejen a pan rallado.", "Derrita la mantequilla en una olla pequeña a fuego medio o bajo.", "Mezcle los bizcochos machacados y la mantequilla derretida en un bol hasta que estén bien combinados. Coloque la mezcla en el fondo de una lata de tarta y presione hacia abajo para formar una capa uniforme.", "Extiende el dulce de leche en forma pareja sobre la base de la galleta.", "Coloque las bananas en rodajas en una capa pareja sobre el dulce de leche. Cubra la lata de tarta con película adhesiva y enfríe en la nevera durante una hora.", "Cuando la base de banoffee se haya enfriado, batir la crema y el azúcar glas hasta que se formen picos suaves cuando se quite la batidora. Extienda la crema batida sobre los plátanos.", "Justo antes de servir, espolvorea sobre el chocolate rallado."], "url": "www_bbc_co_uk_food_recipes_throwtogetherbanoffe_92446", "title": "Lanzar la tarta banoffee", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/throwtogetherbanoffe_92446_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ pequeño sueco, pelado y cortado en cubos pequeños", "½ papa para hornear, pelada y cortada en cubos pequeños", "2 dientes de ajo, pelados, picados", "ramita de romero fresco", "3 ramitas de tomillo fresco", "puñado floretes de brócoli", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén a prueba de horno y fríe con cuidado el colinabo, la patata, el ajo y las hierbas durante 6-8 minutos, revolviendo regularmente.", "Agregue los brotes de brócoli, condimente al gusto, con sal y pimienta negra recién molida, luego transfiéralos al horno para cocinar por otros 8-10 minutos, o hasta que los vegetales estén tiernos."], "url": "www_bbc_co_uk_food_recipes_thymeandgarlicroaste_92892", "title": "Tomillo y verduras asadas al ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, pelada y finamente picada", "1 cucharada de aceite vegetal", "2 cucharaditas de perejil fresco picado", "2 cucharaditas de hojas de tomillo fresco picado", "85g / 3oz de pan blanco fresco", "sal y pimienta negra recién molida", "1 huevo, golpeado"], "method": ["Sudor la cebolla en el aceite hasta que esté suave pero no coloreado.", "Mezcle la cebolla con los pan rallado y las hierbas y sazone bien. Agregue suficiente huevo para unir.", "Úselo para rellenar carnes o aves, o enrolle en bolas de relleno individuales: cocínelas en la lata de asar con la carne durante 30 minutos al final del tiempo de cocción."], "url": "www_bbc_co_uk_food_recipes_thymeandparsleystuff_13559", "title": "Tomillo y relleno de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "1 porcion", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 ml / 7 fl oz de verduras o caldo de pollo", "¼ repollo rallado", "100ml / 3½ fl oz crema doble", "2 cucharadas de tomillo fresco picado", "25g / 1oz de mantequilla, picada"], "method": ["Ponga a hervir el caldo en una cacerola, luego agregue el repollo. Reduzca a fuego lento y cocine por 5-7 minutos, o hasta que se ablanden, luego agregue la crema y el tomillo.", "Cocine por otros 2-3 minutos, o hasta que el repollo esté completamente ablandado, luego agregue la mantequilla. Servir."], "url": "www_bbc_co_uk_food_recipes_thymebutteredcabbage_90385", "title": "Repollo con mantequilla de tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thymebutteredcabbage_90385_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de mantequilla fría sin sal, en cubos y dejada para ablandar levemente", "Harina normal de 500 g / 1 libra 2 oz de buena calidad", "2 cucharaditas de sal", "2 huevos de gallinas camperas, solo yemas", "100 ml / 3½ fl oz de agua helada", "1 calamar pequeño (500 g / 1 lb 2 oz), limpiado, tentáculos reservados y calamar en rodajas finas", "½ tallo de apio, en rodajas", "2 cebollas pequeñas, finamente picadas", "3 dientes de ajo, finamente picados", "40ml / 1½fl oz de aceite de oliva", "75ml / 2½fl oz de vino blanco seco", "Tomates de 500 g / 1 libra y 2 onzas, escaldados y frescos, sin piel ni semillas, con carne picada", "25g / 1oz de aceitunas negras picadas, picadas", "¾ cucharada de azúcar morena", "sal y pimienta negra recién molida", "1½ cucharadita de pimentón", "1 huevo de gallinas camperas, solo yema", "2 bulbos de hinojo, en rodajas finas", "½ manojo de menta fresca, hojas recogidas", "1 limón, ralladura y jugo", "3 cucharadas de aceite de oliva"], "method": ["Para la masa, combine la harina y la sal en una superficie de trabajo, agregue la mantequilla y trabaje la masa con los dedos hasta que la mezcla tenga una textura similar a la arena o se asemeje a pan rallado.", "Haga un pozo en la mezcla, coloque las yemas de huevo y el agua en el centro y mezcle con una mano comenzando desde el centro del pozo.", "Junta la masa en una bola suave.", "Déjelo reposar en el refrigerador, cubierto con una envoltura de plástico, durante 30 minutos antes de usarlo. (Se mantendrá en el refrigerador por una semana cubierto con una envoltura de plástico).", "En una sartén de base pesada, freír suavemente el calamar, el apio, la cebolla y el ajo en tres cuartas partes del aceite de oliva durante 2-3 minutos sin colorear el calamar. Agregue el vino blanco, los tomates, las aceitunas negras y el azúcar. Cocine a fuego lento durante una hora (la mezcla debe cocerse bien). Dejar enfriar y sazonar al gusto con sal y pimienta negra recién molida.", "Combina el pimentón con el aceite de oliva restante y reserva.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y alinee una bandeja de horno con papel de hornear.", "De la pastelería, salen dos círculos de unos 20 cm / 8 pulgadas de ancho y unos 3 mm / 1/8 de pulgada de grosor. Coloque una pieza de hojaldre en la bandeja preparada. Extienda la mezcla de calamar sobre la masa y deje un borde de 1 cm / ½ pulgada alrededor. Esmalte los bordes con la yema de huevo. Cubra con la segunda pieza de hojaldre y selle las dos rondas de masa de hojaldre juntando los bordes, y luego gírelos hacia adentro para que se peguen.", "Cepille la tielle con el aceite de pimentón y hornee durante 30 minutos.", "Para la ensalada de hinojo y menta, coloque el hinojo rebanado y las hojas de menta en un tazón.", "Ponga la ralladura de limón y el jugo en un tazón pequeño de vidrio junto con el aceite y el batidor.", "Vierta el aderezo sobre el hinojo y la menta y mezcle.", "Para servir, coloque el tielle sétoise en una tabla de servir y apile la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_tielle_setoise_42164", "title": "Tiel Sète (pastel de calamar y tomate)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 chile rojo finamente cortado en cubitos", "100ml / 3½fl oz de aceite de oliva", "4 pechugas de pollo", "Mantequilla", "Aceite de oliva", "¼ de cebolla picada", "3 cucharadas de vinagre balsámico", "150 ml de vino tinto (opcional)", "700ml / 1 pt y 5 ¼fl oz de caldo de pollo", "300 g / 14 oz de setas silvestres de su elección", "Puñado de perejil de flatleaf, picado", "Ramita de tomillo", "Sal y pimienta negra", "Puré de patatas", "Guisantes"], "method": ["Prepare el aceite de chile para los guisantes azucarados simplemente infundiendo la guindilla en el aceite caliente. Dejar de lado.", "Fríe las pechugas de pollo en mantequilla y aceite de oliva.", "Mientras tanto, saltee las cebollas en un poco de mantequilla hasta que estén bien coloreadas. De glasear la sartén con el vino tinto y / o vinagre balsámico. Agregue el caldo de pollo y reduzca a la mitad.", "Prepare los champiñones (no los lave, se anegarán) simplemente límpielos con un paño húmedo para eliminar la suciedad y limpie los restos con un cepillo de dientes. Cortar y saltear los champiñones en una sartén muy caliente con un poco de mantequilla y aceite. El calor debe ser muy alto para expulsar cualquier líquido, no quiere que se cocinen.", "Una vez que el pollo esté cocido y el caldo reducido, cuele el líquido, agregue los champiñones cocidos y termine con el perejil picado. Sazonar al gusto, agregando un poco de mantequilla si la salsa sabe demasiado fuerte.", "Para servir, agregue un poco de aceite de oliva al puré y revuelva bien, coloque un poco de la papa en el centro de un plato para servir. Cortar cada pechuga de pollo por la mitad en diagonal y colocar en la parte superior de la patata. Vierta la salsa y sirva con los chícharos como se prepara a continuación. Cocine los guisantes de azúcar brevemente para que conserven su color y textura. Rocíe el aceite de chile y sirva en un tazón junto al pollo."], "url": "www_bbc_co_uk_food_recipes_thymeflavouredchicke_8357", "title": "Pechuga de pollo con sabor a tomillo con salsa de champiñones silvestres y puré de aceite de oliva", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz chalotes, en rodajas", "300g // 10½oz de pimientos rojos asados ​​de un tarro, en rodajas", "70 g / 2½ oz de ajo, en rodajas finas", "½ cucharadita de pimienta de cayena", "100ml / 3½fl oz de aceite de oliva", "8 grandes langostinos tigre", "250 g / 9 oz de yogur griego sin grasa", "2 dientes de ajo, triturados o finamente picados", "1 chalote grande, muy finamente picado", "2 cucharadas de vinagre de vino blanco", "2 cucharadas de jugo de limón", "2 cucharadas de perejil de flatleaf recién picado", "2 cucharadas de cebolletas frescas picadas", "1 cucharada de menta fresca picada", "5 cucharadas de aceite de oliva virgen extra", "copos de sal marina", "5 puñados generosos hojas verdes mezcladas", "5 rábanos, en rodajas finas", "1 bulbo de hinojo, en rodajas finas", "sal marina y pimienta negra recién molida"], "method": ["Coloque todos los ingredientes de la salsa, a excepción de los langostinos, en una cacerola, cocínelos suavemente hasta que los chalotes estén blandos y luego llévelos a ebullición. Transfiera la mezcla a una licuadora y mezcle hasta que quede suave. Pase la salsa a través de un colador en un recipiente. Agregue las gambas a la salsa por 10 minutos.", "Para el aderezo, combine el yogur, 125ml / 4fl oz de agua fría, ajo, chalota, vinagre, jugo de limón, perejil, cebollín y menta. Agregue el aceite de oliva y sazone con sal, al gusto.", "Para cocinar las gambas, caliente una sartén plana hasta que esté muy caliente. Empuje las gambas en dos brochetas y cocine en cada lado durante 3-4 minutos.", "Mientras tanto, para la ensalada, coloque los verdes, los rábanos y el hinojo en agua helada durante unos minutos para que estén crujientes. Retire, escurra y seque.", "Combine en una ensaladera y aplaste los aderezos a los lados. Mezcle la ensalada con las manos, tirando del aderezo de los lados del tazón como lo hace. Condimentar con sal y pimienta.", "Sirve los langostinos en la parte superior de la ensalada."], "url": "www_bbc_co_uk_food_recipes_tiger_prawns_red_pepper_43041", "title": "Gambas tigre, salsa de pimiento rojo y aderezo de yogur", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite de oliva", "6 lonjas de tocino", "4 salchichas, cocinadas", "1 cebolla grande o un par de cebollas grandes de primavera", "4 papas pequeñas o 2 grandes", "1 puñado de verduras brillantes, como repollo", "1 gran puñado de perejil fresco, picado"], "method": ["Calienta un poco de aceite de oliva en una sartén antiadherente. Cortar aproximadamente el tocino, las salchichas y la cebolla y agregar al aceite. Agregue las papas sin pelar, si lo desea, para que las pieles se pongan crujientes. Mantenga a fuego lento. No revuelva demasiado para que los jugos tengan la oportunidad de caramelizar un poco.", "Corta los greens y hiérvelos suavemente en una sartén por separado, solo un par de minutos por lo general. Escurra los greens y agréguelos a la sartén. Cubra con perejil picado. Revuelva suavemente todos los ingredientes y aumente el fuego hasta que la carne esté un poco crujiente. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tidyfridaypanfry_92229", "title": "Tidy Friday pan frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "2 dientes de ajo, finamente picados", "6-8 langostinos cocidos (u otras gambas grandes)", "1 cucharadita de vino de arroz Shaoxing", "150 g / 5 oz de hinojo fresco, tallos leñosos eliminados, o marisma de hinojo, conservados en salmuera", "Puerros de bebé 150g / 5oz, arreglados", "2 cebolletas, cortadas y cortadas en piezas de 4cm / 2in", "1 cucharadita de salsa de soja ligera", "sal marina, al gusto"], "method": ["Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete. Agregue el ajo y saltee por unos segundos.", "Agregue los langostinos de la bahía de Dublín y saltee durante 1-2 minutos, luego agregue el vino de arroz Shaoxing y cocine por unos segundos. Agregue el hinojo fresco, luego agregue los puerros y las cebolletas. Revuelva freír durante un minuto, luego sazone, al gusto, con la salsa de soja ligera y la sal marina.", "Para servir, cuchara sobre un plato de servir y rocíe sobre los jugos restantes del wok."], "url": "www_bbc_co_uk_food_recipes_tigerprawnandsamphir_89272", "title": "Langoustine y samphire salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tigerprawnandsamphir_89272_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 langostinos tigre con caparazón", "200ml / 7fl oz de agua hirviendo", "3 cucharadas de aceite de oliva, más extra para lloviznar", "4 dientes de ajo, enteros", "85g / 3oz de tomates baby ciruela, picados", "1 cucharada de puré de tomate", "½ cubo de caldo de pescado", "½ limón, solo jugo", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida", "200 g / 7 oz de linguini seco, cocido de acuerdo con las instrucciones del paquete"], "method": ["Desenvuelve las gambas, luego quita las conchas y las cabezas y reserva. Coloque las conchas y las cabezas en una sartén con el agua hirviendo y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento durante 5-10 minutos. Cuele el líquido a través de un colador y reserve el licor. Deseche las cabezas y las cáscaras.", "En una sartén por separado, caliente el aceite a fuego lento y agregue el ajo, cocinando suavemente durante 3-4 minutos. Retire el ajo del aceite, suba el fuego y agregue las gambas. Cocine durante 1-2 minutos, o hasta que las gambas estén comenzando a ponerse rosadas, luego mezcle los tomates picados y agregue el puré de tomate.", "Disuelva el cubo de caldo en el caldo de gambas y vierta en la sartén con las gambas. Cocine por 3-4 minutos, luego agregue el jugo de limón, el perejil y sazone con sal y pimienta negra recién molida. Agregue el linguini cocido.", "Sirva el linguini con un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_tigerprawnlinguinewi_90112", "title": "Linguine de gambas tigre con tomates y hierbas frescas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 gambas de tigre crudas, con cáscara, frescas o congeladas, o puedes usar gambas cocidas del Mediterráneo en sus conchas", "Salchicha de chorizo ​​de 4oz / 110g, pelada y cortada en trozos de 3/4 de pulgada (2 cm)", "1-2 cucharadas de aceite de oliva", "1 cebolla mediana, pelada y cortada en rodajas de 1/2 pulgada (1 cm)", "2 dientes de ajo, pelados y triturados", "2 ramas de apio, cortadas y cortadas en trozos de 1/2 pulgada (1 cm) en diagonal", "1 chile verde, sin semillas y finamente picado", "1 pimiento amarillo, sin semillas y cortado en rodajas de 1/2 pulgada (1 cm)", "6fl oz / 175ml de arroz basmati blanco", "1 cucharadita de salsa Tabasco", "3 tomates medianos, vertidos en agua hirviendo durante 1 minuto, luego pelados y picados", "1 hoja de laurel", "1 cucharada de perejil de hoja plana aproximadamente picado, para adornar", "2 cebollas de primavera, cortadas y finamente cortadas, para adornar", "sal y pimienta negra recién molida"], "method": ["Comience por llevar una bandeja con 1 pinta (570 ml) de agua hasta el punto de cocción lenta. Si usa gambas crudas, colóquelas en el agua por 3 minutos. Después de eso, quítelos con una cuchara de drenaje, reservando el líquido de cocción. (Las gambas cocidas no necesitarán esta precocción). Ahora reserve dos gambas enteras y cáscara el resto. Para hacer esto, simplemente quita las cabezas dándoles un fuerte tirón, luego simplemente quita el resto, que sale muy fácilmente, pero deja las colas intactas, ya que esto las hace lucir más bonitas. Ahora quite la veta negra de la parte posterior de cada gamba, que se desprenderá fácilmente con la punta de un cuchillo afilado. Luego coloque las cáscaras en la fuente de agua y cocine a fuego lento durante 30 minutos, sin tapa, para hacer un buen caldo con sabor a gambas, luego drene y deseche las cáscaras. Vierta el caldo caliente en una jarra y cubra con un plato para mantener el calor.", "Ahora caliente la sartén a fuego alto y dore los trozos de chorizo, sin agregar grasa, luego retírelos de la sartén a un plato y déjelos a un lado. A continuación, agregue una cucharada de aceite y, cuando esté caliente, fría las cebollas durante 2-3 minutos para dorarlas un poco en los bordes, luego devuelva el chorizo ​​a la sartén y agregue el ajo, el apio, el chile y el pimiento en rodajas. Continúe freír durante 4-5 minutos, hasta que el apio y la pimienta también estén suaves y ligeramente teñidos de color marrón en los bordes, agregando un poco más de aceite si es necesario.", "Ahora mezcle el arroz para obtener una buena capa de aceite, luego mida 12 fl oz (340 ml) del caldo reservado y agréguele el Tabasco. A continuación, agregue los tomates picados y la hoja de laurel a la sartén, luego vierta el caldo. Sazone con sal y pimienta negra recién molida, revuelva todo y presione el arroz en el líquido. Ahora apague el fuego, ponga una tapa y deje que hierva a fuego lento durante 20 minutos.", "Luego, compruebe que el arroz esté cocido y devuelva el pan sin cáscara y los dos camarones con cáscara reservados a la sartén, añadiendo un poco más de caldo si es necesario. Cubra con una tapa por 5 minutos más, luego sirva adornado con el perejil picado y las cebolletas."], "url": "www_bbc_co_uk_food_recipes_tigerprawnjambalaya_68037", "title": "Tiger gamba jambalaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350ml / 12¼fl oz de botella de cerveza", "8 grandes langostinos tigre salvajes, conchas en", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "12 tallos de espárragos", "125g / 4½oz de mantequilla, derretida", "2 cucharaditas de jugo de limón", "2 cucharaditas de vinagre de vino blanco", "2 yemas de huevo grandes de gallinas camperas"], "method": ["Vierta la cerveza en la base de un barco de vapor.", "Coloque las gambas en un recipiente, sazone con sal y pimienta negra recién molida y rocíe con un poco de aceite de oliva.", "Coloque las gambas en la canasta de vapor en la parte superior de la olla a vapor con la tapa puesta y cocine durante 5-6 minutos hasta que estén recién cocidas. Mientras tanto, caliente una sartén hasta que esté caliente.", "Mezcle los espárragos en el aceite de oliva restante y sazone con sal y pimienta negra recién molida.", "Coloque en la sartén de la plancha y ase a la parrilla durante 3-4 minutos hasta que estén tiernos.", "Para el holandés, coloque la mantequilla en una olla y cocine a fuego lento.", "Coloque el jugo de limón y el vinagre en una olla pequeña separada y caliente hasta que hierva.", "Coloque las yemas de huevo en un procesador de alimentos con una pizca de sal y enciéndalo.", "Con el motor en marcha, agregue el limón caliente y el vinagre. Luego, lentamente, agregue la mantequilla derretida hasta que esté todo incorporado. Retire del procesador y sazone con un poco de sal y pimienta negra.", "Sirve dos gambas grandes, cada una con tres lanzas de espárragos y una llovizna de salsa holandesa."], "url": "www_bbc_co_uk_food_recipes_tigerprawnssteamedin_83694", "title": "Langostinos al vapor en cerveza con salsa holandesa y espárragos a la plancha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]