[{"ingredients": ["2 polluelos", "6 -8 vainas de cardamomo, agrietadas abiertas y semillas trituradas", "1 cucharadita de semillas de hinojo", "semillas grandes de cilantro pellizcado, tostadas", "gran pizca de pimienta negra recién molida", "2 cucharaditas de curry en polvo suave", "cúrcuma molida", "sal", "2 dientes de ajo, finamente picados", "½ zumo de limón", "2 cucharadas de aceite vegetal", "50 g / 1¾oz de mantequilla sin sal", "almendras copos tostadas, al gusto"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Con un cuchillo grande o unas tijeras de cocina, corta los poussins por la mitad siguiendo la línea de la columna vertebral y el esternón. Aplanar ambas mitades, alejando las piernas del pecho y colocarlas en un plato. Marca la carne de las piernas hasta el hueso.", "Coloque las semillas de cardamomo, semillas de hinojo, semillas de cilantro, pimienta negra, polvo de curry, cúrcuma y sal en un mortero. Aplastar juntos a un polvo grueso.", "Agregue los ajos finamente picados y mezcle todo junto.", "Transfiera la mezcla a un recipiente, agregue el jugo de limón y el aceite y mezcle bien.", "Trabaja la mezcla en los poussins asegurándote de que entra en los cortes. Deja los poussins para marinar durante hasta una hora.", "Derrita un poco de mantequilla en una sartén y fríe los poussins a fuego lento. Tenga cuidado de no quemar las especias. Use una cuchara para cubrir los poussins con las especias y la mantequilla.", "Transfiera a la bandeja del horno y colóquelo en el horno para cocinar por 10-12 minutos. Las aves se cocinan cuando los jugos se aclaran cuando la pierna se ensarta en la parte más gruesa.", "Una vez cocinado, espolvorear con almendras tostadas y servir con panes planos y raita."], "url": "www_bbc_co_uk_food_recipes_curry_poussins_05740", "title": "Pollos de curry", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite vegetal", "2 dientes de ajo, finamente picados", "1 chalote, finamente picado", "Jengibre fresco de la raíz de los 2.5cm / 1in, finamente tajado", "1 cucharada de pasta de curry penang", "1 x 400 g de leche de coco de hojalata", "1 cucharada de salsa de pescado tailandesa", "Fideos de huevo 250 g / 9 oz", "250 g / 9 oz de almejas crudas, limpiadas", "100g / 3½oz de brotes de soja", "1 chile rojo, en rodajas, para servir", "4 cebollas de primavera, en rodajas, para servir"], "method": ["Caliente el aceite en una sartén grande a fuego medio. Agregue el ajo, el chalote y el jengibre y fría hasta que estén suaves, pero no coloreados.", "Agregue la pasta de curry y mezcle bien, asegurándose de que no se coagule o entre en grumos.", "Freír suavemente durante 10-20 segundos y luego agregar la leche de coco. Llevar a ebullición y cocine a fuego lento hasta que el líquido se haya espesado un poco.", "Mientras tanto, cocina los fideos de huevo de acuerdo con las instrucciones del paquete y reserva.", "Agregue las almejas a la salsa de curry y cocine durante 2 minutos, o hasta que todas las almejas estén abiertas, revolviendo con frecuencia (deseche las almejas que no se abran). Agregue los brotes de soja y mezcle bien para combinar. Sirva en tazones grandes con los fideos de huevo cocidos y adornado con el chile y las cebolletas."], "url": "www_bbc_co_uk_food_recipes_curry_mee_04345", "title": "Curry mee", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3.4kg / 7lb 5oz cordero en el hueso, picado", "2 ramitas de tomillo de limón, picadas", "pequeño cilantro puñado, picado", "2 pizcas de pimienta negra recién molida", "3 dientes de ajo, aplastados", "1 cebolla, finamente picada", "2 chiles pequeños: 1 bonete escocés, 1 ojo de pájaro verde (o al gusto), ambos picados", "400ml / 14fl oz de vino tinto", "aceite de oliva, para freír", "3 dientes", "1 pieza de corteza de canela", "4-5 vainas de cardamomo, aplastadas", "1 cucharadita de comino molido", "1 cucharadita de tomillo picado", "½ chile rojo, o al gusto", "½ chile verde, o al gusto", "1-2 hojas de laurel", "1 cucharadita de chile en polvo", "3-4 cucharadita de polvo de curry suave", "2 cucharadas de sal masala", "1 litro / 1¾ pintas de cordero o carne de res", "40g / 1% C2% BDoz% 20 calidad buena% 20dark% 20cooking% 20chocolate% 20 (70 %% 20cocoa% 20solids)", "1½ cucharadas de melaza de granada (opcional)"], "method": ["Para el primer adobo, combine todos los ingredientes para el adobo en un tazón. Agregue el cordero picado. Cúbralo con una película adhesiva y déjelo reposar en la nevera durante una hora o toda la noche, si es posible.", "Para la fritura de especias secas, caliente un chorrito de aceite de oliva en una cacerola honda muy grande.", "Poco a poco agregue todos los ingredientes para el fríjol de especias secas, excepto el chocolate, la melaza de granada y el caldo, al aceite de oliva.", "Revuelva los ingredientes en el aceite durante unos minutos hasta que liberen su aroma, luego agregue el cordero marinado.", "Permita que la carne chisporrotee en la cacerola (tenga cuidado, puede salpicar) durante unos minutos y luego vierta el líquido del adobo y el caldo.", "Rallar el chocolate en la parte superior y agregar la melaza de granada (si se usa).", "Cubra la cacerola y deje que se cocine a fuego muy lento durante aproximadamente 3-4 horas. El curry está cocido y listo para servir cuando la carne es suave y se cae del hueso."], "url": "www_bbc_co_uk_food_recipes_currymutton_86347", "title": "Curry de cordero", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "I cebolla pequeña, pelada y finamente picada", "1 diente de ajo, pelado y aplastado", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "2.5ml / ½ cucharadita de cúrcuma molida", "2cm / ¾ en pieza de jengibre raíz, pelado y finamente rallado", "1 cucharadita de chile en polvo", "3-4 pods de cardamomo, aplastados", "Crema doble de 210 ml / 7 fl oz", "sal", "jugo de medio limón"], "method": ["Calentar el aceite y cocinar la cebolla hasta que esté suave.", "Agregue el ajo y cocine por otros 2 minutos.", "Agregue las especias y cocine por 2-3 minutos a fuego lento para liberar todos los aromas y sabores.", "Agregue la crema doble y deje que hierva.", "Agregue sal y jugo de limón al gusto."], "url": "www_bbc_co_uk_food_recipes_currysauce_1305", "title": "salsa de curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1/4 pinta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta de leche entera", "1 vaina de vainilla", "3 huevos, solo yemas", "2 cucharadas de harina de maíz", "25 g / 1 oz de azúcar en polvo"], "method": ["Caliente la leche con la vaina de vainilla hasta que hierva.", "Mezcle las yemas de huevo, el azúcar y la harina de maíz para obtener una pasta suave.", "Vierta sobre la leche y revuelva bien. Retire, lave y seque la vaina de vainilla para volver a utilizarla en otra receta.", "Vuelva a colar la mezcla en una cacerola limpia y, revolviendo constantemente, cocine suavemente hasta que la crema se espese."], "url": "www_bbc_co_uk_food_recipes_custard_1293", "title": "lactoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 225g / 8oz, más extra para quitar el polvo", "½ cucharadita de sal", "200g / 7oz de mantequilla, enfriada y cortada en cubos de 1cm / ½ in", "140-160ml / 5-5½fl oz de agua", "500ml / 18fl de leche en oz", "1 vaina de vainilla, dividida por el medio y semillas raspadas", "100 g / 3½ oz de azúcar en polvo", "4 huevos de gallinas camperas, solo yemas", "40 g / 1½ oz de harina de maíz", "40 g / 1½ oz de mantequilla", "200g / 7oz de azúcar glasé", "5 cucharaditas de agua", "50 g / 2 oz de chocolate negro, derretido"], "method": ["En un tazón grande mezcle la harina y la sal juntas. Frote un tercio de la mantequilla hasta que la mezcla se asemeje a migas de pan finas. A continuación, frote aproximadamente la mantequilla restante, dejando grumos grandes.", "Agregue el agua un poco a la vez hasta que la masa se una (puede que no necesite toda el agua).", "Incline la masa sobre una superficie de trabajo enharinada. Enrolle en un rectángulo estrecho de aproximadamente 2.5 cm / 1 pulg. De grosor.", "Con la masa verticalmente delante de usted, doble el tercio inferior de la masa hacia el tercio medio y luego el tercio superior hacia abajo sobre los otros tercios. Esto se llama un giro.", "Envuelva la masa en una película adhesiva y colóquela en el refrigerador para enfriar durante 10 minutos", "Saque del refrigerador y, con un rodillo, despliegue nuevamente en un rectángulo estrecho y repita el giro como antes.", "Vuelva a enfriarse y repita el rodaje y volteando una vez más, por lo que un total de tres veces. Envuelva la masa en una película adhesiva y regrese a la nevera para descansar.", "Mientras la masa está en reposo, prepare la crème pâtissière. Vierta la leche en una sartén y agregue la vaina de vainilla y sus semillas. Ponga a hervir la mezcla de leche y luego retírela del fuego.", "Batir el azúcar, las yemas de huevo y la harina de maíz en un tazón grande.", "Vierta un poco de la leche caliente en la mezcla de huevo, batiendo continuamente. Agregue el resto de la leche caliente hasta que esté bien combinada, luego vuelva a la sartén.", "Cocine la mezcla a fuego lento, revolviendo continuamente, hasta que la mezcla se espese. Simplemente llegará a ebullición.", "Retire del fuego y pase la mezcla a través de un colador en un recipiente limpio. Agregue la mantequilla y revuelva hasta que se derrita y se combine por completo.", "Dejar enfriar, cubrir con film transparente y luego enfriar antes de usar.", "Precaliente el horno a 220C / 425F / Gas 7. Coloque dos bandejas para hornear con papel para hornear.", "Divida la masa en dos partes iguales y extienda ambas piezas a 20 cm / 8 pulgadas cuadradas y 5 mm / ¼ pulgadas de grosor. Luego coloque cada hoja de hojaldre en las bandejas de hornear forradas, y enfríe durante 10-15 minutos.", "Hornee las hojas de hojaldre durante 10-15 minutos o hasta que estén doradas y crujientes. Dejar de lado para enfriar.", "Mientras la pastelería se hornea, forre una bandeja para hornear cuadrada profunda de 23 cm / 9 pulgadas con papel de aluminio con abundante papel de aluminio adicional a los lados. La lámina extra le permite levantar las rebanadas ensambladas.", "Coloque una hoja de hojaldre en la parte inferior de la bandeja de horno forrada. (Reserve la pieza más bonita para la parte superior).", "Extienda la crema pastelera uniformemente sobre la masa en la bandeja de hornear antes de colocar otra pieza de masa en la parte superior. Refrigere mientras prepara la guinda.", "Para la formación de hielo, tamice el azúcar glas en un tazón. Agregue el agua fría hasta que esté bien combinada y reservada.", "Transfiera el chocolate derretido a una manga pastelera equipada con una boquilla pequeña y lisa, y déjelo a un lado para que se solidifique ligeramente.", "Tome la rebanada de crema de la nevera y extender la guinda sobre la capa superior de la masa.", "Usando la manga pastelera, dibuje diez líneas paralelas a lo largo de la parte superior de la formación de hielo en una dirección. Con un punzón para dientes, tire líneas paralelas de aproximadamente 2.5 cm por el chocolate derretido y la formación de hielo en direcciones alternas para crear un efecto de pluma.", "Coloque la rebanada de nuevo en la nevera para establecer.", "Corta la rebanada de vainilla terminada en ocho pedazos.", "Con la lámina levante cuidadosamente las rebanadas de vainilla en porciones de la bandeja y colóquelas en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_custard_slice_58534", "title": "Rebanada de natillas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 8 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/custard_slice_58534_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "50 g / 1 oz de azúcar en polvo", "125g / 4½oz de mantequilla, ligeramente suavizada", "1 vaina de vainilla, semillas raspadas", "1 huevo de gallinas camperas", "Crema batida de 750ml / 1¼ pinta", "12 yemas de huevo", "115 g / 4 oz de azúcar en polvo", "½ cucharadita de pimienta de Jamaica molida", "Crema doble de 200 ml / 7 fl oz", "1 cucharada de miel clara", "Nueces 100 g / 3½ oz, conchas eliminadas, picadas", "100 g / 3½ oz de azúcar en polvo", "Mitades de nuez 100g / 3½ oz", "aceite de colza", "caramelo", "bálsamo de limón hojas"], "method": ["Para la masa, coloque la harina, el azúcar, la mantequilla y las semillas de vainilla en un tazón y frótelas con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. (Alternativamente, pulso en un procesador de alimentos).", "Batir ligeramente el huevo entero y verterlo en la mezcla de harina. Mezcle la mezcla hasta que se forme grumos, luego junte con las manos para formar una masa. Envuelva con film transparente y descanse en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Extienda la masa y forre una lata de flan de fondo suelto de 30 cm / 12 pulgadas, dejando cualquier exceso de hojuelas colgando sobre el borde - no corte hasta que la pasta esté cocida. Cubra con papel de hornear y rellene con alubias o arroz crudo. Hornea por 8-10 minutos. Retire el papel de hornear y los frijoles para hornear. Reduzca la temperatura del horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Para el relleno de natillas, caliente la crema en una olla sin dejar que hierva.", "En un tazón, batir las yemas de huevo y el azúcar impalpable durante 3-4 minutos hasta que estén pálidos y espesos. Poco a poco bata la crema caliente en la mezcla, teniendo cuidado de no cuajar las yemas de huevo. Vierta la mezcla en la caja de pastelería cocida. Espolvorea con la pimienta de Jamaica.", "Hornee durante 50 minutos o hasta que la crema esté lista. Retire del horno, recorte los bordes de la pastelería con cuidado y déjelo enfriar.", "Para el helado, batir la crema hasta que se formen picos suaves cuando se quite la batidora. Coloque la crema en un tazón grande y doble la miel y las nueces. Vierta la mezcla en un recipiente y coloque en el congelador para establecer durante unos 15 minutos.", "Para las nueces, haga un jarabe calentando el azúcar con 100 ml / 3½ fl oz de agua hasta que el azúcar se disuelva. Llevar a ebullición y agregar las mitades de nuez. Retirar del fuego y reservar para enfriar.", "Escurra las nueces y deseche el jarabe. En una sartén honda o sartén, caliente un poco de aceite de colza hasta que esté caliente. Poco a poco freír las nueces hasta que estén crujientes (aproximadamente 30 segundos), luego escurrir sobre papel de cocina.", "Pinte una raya de caramelo en los platos para servir y cubra con una tajada de tarta de crema. Agregue una cucharada de helado de nuez. Adorne con nueces confitadas azucaradas y bálsamo de limón."], "url": "www_bbc_co_uk_food_recipes_custard_tart_with_53199", "title": "Tarta de natillas con nueces azucaradas, helado y caramelo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Ruibarbo 400g / 14oz", "250 g / 9 oz de azúcar en polvo", "3 piezas de tallo de jengibre en almíbar, más o menos picadas", "1 naranja, solo ralladura, pelada en tiras grandes", "125ml / 4fl oz de vino blanco dulce", "2 naranjas de sangre, solo jugo", "500 g / 1 libra de bloques de pasta brisa lista para usar", "harina, para quitar el polvo", "Crema doble de 1 litro / 1¾ pinta", "2 vainas de vainilla, divididas longitudinalmente y semillas raspadas", "10 huevos de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "½ nuez moscada entera, rallada"], "method": ["Para la fruta, coloca el ruibarbo en una fuente para hornear y agrega el azúcar, la ralladura de naranja y el jengibre. Dejar macerar durante la noche.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la tarta, extienda la masa en una superficie ligeramente enharinada. Cubra una tarta de 30cm / 12in con la masa. Pinche la base de la masa con un tenedor y forre la caja de la masa con un círculo de papel para hornear o papel de aluminio y rellene con alubias para hornear.", "Cuela la caja de repostería durante 15-20 minutos, o hasta que esté ligeramente dorada, luego retira el papel y los frijoles y devuelve la tarta al horno para que se cocine durante otros 5-10 minutos, o hasta que esté pálida dorada y seca fuera.", "Reduzca la temperatura del horno a 110C / 90C Fan / Gas ¼.", "Vierta la crema en una cacerola y agregue las semillas y las vainas de vainilla. Llevar a ebullición.", "Mientras tanto, batir los huevos y el azúcar en un recipiente resistente al calor. Vierta sobre la crema caliente. Agregue la nuez moscada, retire las vainas de vainilla y mezcle hasta que quede suave. Pase a través de un tamiz y vierta en la caja de pastelería.", "Hornee durante una hora, o hasta que la crema esté lista, pero todavía un poco tambaleante. Deje que se enfríe durante unas horas antes de cortar.", "Para cocinar la fruta, caliente el vino y el jugo de naranja en una lata para asar. Vierta sobre el ruibarbo. Cubra con dos capas de papel de aluminio y hornee hasta que estén suaves, no hierva. Dejar que se enfríe antes de servir.", "Para servir, corte una porción de la tarta y sirva el ruibarbo y el jengibre al lado."], "url": "www_bbc_co_uk_food_recipes_custard_tart_with_56942", "title": "Tarta de natillas y nuez moscada con ruibarbo y jengibre", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 1 tarta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1lb 10 oz de harina común", "1 huevo de gallinas camperas, más 2 yemas de huevo de gallinas camperas", "225g / 8oz de mantequilla sin sal", "150 g / 5½ oz de azúcar en polvo", "500ml / 18fl oz de leche entera", "1 vaina de vainilla fresca, dividida y semillas raspadas", "5 yemas de huevo de gallinas camperas", "80g / 3oz de azúcar en polvo de oro", "50 g / 1 oz de azúcar en polvo", "2 bolsitas de té Earl Grey", "Ciruelas pasas 150 g / 5½ oz"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase una lata de flan de 22 cm / 9 pulg.", "Para la masa, mezcle la harina, el huevo y las yemas, la mantequilla y el azúcar en un procesador de alimentos para formar una masa suave. Forme la masa en un disco grueso, envuélvala en una película adhesiva y colóquela en el refrigerador hasta que esté firme. (Unos 20 minutos.)", "Estirar la masa en una forma lo suficientemente grande como para cubrir la lata. Presione la masa en la lata y cúbrala con un trozo de pergamino para hornear. Rellene con frijoles para hornear y hornear a ciegas durante 15 minutos, o hasta que la pasta esté comenzando a colorear. Dejar de lado para enfriar.", "Vierta la leche entera en una cacerola de base pesada. Agregue la vaina de vainilla y las semillas. Llevar a ebullición, luego retire del fuego.", "Coloque las yemas de huevo en un tazón grande con azúcar en polvo y bata hasta que estén gruesas y pálidas.", "Lentamente vierta la leche infundida en vainilla a través de un colador sobre la mezcla de huevo, revolviendo constantemente. Deseche la vaina y deje la natilla a un lado para que se enfríe un poco.", "Reduzca la temperatura del horno a 100C / 225F / Gas ¼.", "Vierta la crema pastelera en la lata de pastelería y hornee durante 45 minutos más.", "Mientras tanto, para las ciruelas pasas, combine 150 ml / 5 fl oz de agua y el azúcar en una sartén. Calienta suavemente, revolviendo, hasta que el azúcar se haya disuelto. Agregue las bolsitas de té y deje que hierva.", "Agregue las ciruelas pasas y deje a un lado para permitir que las ciruelas pasas absorban el té. Cuando esté frío, retire las bolsas de té.", "Una vez que la tarta se haya cocinado (debe haber un ligero bamboleo en el centro de la tarta cuando se agite ligeramente), retírela del horno y déjela enfriar.", "Para servir, recalentar las ciruelas pasas y servir junto con las rodajas de la tarta de crema."], "url": "www_bbc_co_uk_food_recipes_custard_tart_with_earl_25616", "title": "Tarta de flan con ciruelas escalfados Earl Grey", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Caja de repostería brisa de 22cm / 9 pulgadas", "300ml / 10 fl oz de leche entera", "200ml / 7 fl oz doble crema", "2 huevos grandes de gallinas camperas", "2 yemas de huevo de gallinas camperas", "Azúcar en polvo 80g / 3oz", "pellizcar nuez moscada molida"], "method": ["Precalentar el horno a 190C / 375 / Gas 5.", "Hornee la caja de repostería durante 15 minutos hasta que esté firme y ligeramente dorado.", "Retire la carcasa y baje el horno a 160C / 325F / Gas 3.", "En una olla mediana, ponga la leche y la crema a punto de hervir.", "Batir los huevos, las yemas y el azúcar juntos en un tazón.", "Verter la leche caliente sobre ellos y batir suavemente. Vierta la mezcla en la caja de repostería y ralle un poco de nuez moscada encima.", "Hornee durante 40 minutos hasta que se haya establecido. Retire del horno y deje enfriar antes de servir."], "url": "www_bbc_co_uk_food_recipes_custardtart_83910", "title": "Tarta de crema pastelera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/custardtart_83910_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, derretida en una olla", "100g / 3½oz de azúcar glas, cernida", "Harina normal de 100 g / 3½ oz", "100 g / 3½ oz de clara de huevo", "200g / 7oz pasas de Corinto", "225 g / 8 oz de harina, más extra para quitar el polvo", "pizca de sal", "1 limón, ralladura solamente", "150 g / 5½ oz de mantequilla", "75g / 3oz de azúcar en polvo", "1 yema de huevo de gallinas camperas", "1 huevo de gallinas camperas", "9 yemas de huevo de gallinas camperas", "75g / 3oz de azúcar en polvo", "500 ml / 17 fl oz de crema batida", "nuez moscada recién rallada"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Primero, haz las galletas. Mezcle la mantequilla, el azúcar glas y la harina hasta que quede suave. Agregue lentamente las claras de huevo, revolviendo, hasta que estén completamente incorporadas, luego doble las grosellas. La masa estará bastante húmeda. Coloque en un tazón pequeño y relájese durante al menos una hora.", "Cubra una bandeja para hornear con papel resistente a la grasa y extienda la mezcla. Enfriar en la nevera durante 30 minutos.", "Hornee los bizcochos por 25-30 minutos o hasta que estén dorados. Mientras se corta en rodajas con un cuchillo afilado. Dejar enfriar, luego mantener en una lata hermética.", "Para la masa, frote la harina, la sal, la ralladura de limón y la mantequilla hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar, luego bata juntos la yema de huevo y el huevo entero y lentamente agregue estos, mezclando hasta que la masa forme una bola. Envuelva firmemente en una película adhesiva y refrigere durante dos horas.", "Apague el horno a 170C / 325F / Gas 3.", "Extienda la masa sobre una superficie ligeramente enharinada a 2 mm / un octavo de grosor. Úselo para revestir un anillo para flan de 18 cm / 7 pulgadas colocado en una bandeja para hornear. Cubra con papel resistente a la grasa y llene con alubias para hornear, luego hornee a ciegas durante unos 10 minutos o hasta que la masa esté comenzando a dorarse. Retire el papel y los frijoles, y deje enfriar.", "Baje el horno a 130C / 250F / Gas1.", "Para el relleno, mezcle las yemas y el azúcar. Agregue la crema y mezcle bien. Pasar la mezcla a través de un colador fino en una olla y calentar a la temperatura de la sangre.", "Llene la caja de pastelería con la crema, hasta 5 mm / ¼ pulgada desde la parte superior. Coloque con cuidado en el medio del horno y hornee durante 30-40 minutos o hasta que la crema parezca fija pero no demasiado firme. Retire del horno y cubra la superficie abundantemente con nuez moscada rallada. Dejar enfriar a temperatura ambiente.", "Antes de servir, caliente los bizcochos en el horno durante 5 minutos. Cortar la tarta con un cuchillo afilado y servir con los bizcochos."], "url": "www_bbc_co_uk_food_recipes_custardtartwithgarib_81804", "title": "Tarta de crema con galletas Garibaldi", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 yemas de huevo de gallinas camperas", "75 g / 2½ oz de azúcar en polvo", "2 ramitas de tomillo fresco", "300 ml / 10 fl oz de leche", "300 ml / 10 fl oz doble crema"], "method": ["Batir las yemas de huevo y el azúcar en un tazón hasta que estén bien mezclados.", "Picar el tomillo fresco finamente y colocar en una sartén, junto con la leche y la crema. Llevar a ebullición.", "Una vez que la leche y la crema hayan alcanzado el punto de ebullición, quítese el fuego. Vierta un poco de leche y crema en los huevos y el azúcar y mezcle bien. Vierta nuevamente en la sartén. Regrese al fuego y, con un batidor, revuelva ligeramente para espesar. No hiervas", "A medida que las yemas de huevo se calientan, la crema se espesará hasta obtener una crema pastelera. Sigue revolviendo con una cuchara de madera hasta que cubra la parte posterior de una cuchara. Retirar del fuego y pasar a través de un colador en una olla limpia, descartando las hojas de tomillo. Deje que se enfríe, revolviendo ocasionalmente hasta que se enfríe completamente. La crema puede servirse fría o caliente."], "url": "www_bbc_co_uk_food_recipes_custardwiththyme_86000", "title": "Natillas con tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 750ml", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 sepias, cuerpo, tentáculos y alas separadas, tentáculos y alas finamente picadas, para producir 500 g / 1 lb 2 oz", "Chalote 50g / 2oz, finamente picado", "80g / 3oz de ajo, finamente picado", "pequeño bouquet garni", "25 g / 1 oz de perejil de flatleaf, finamente picado, más 1 cucharada para servir", "20g / ¾ oz de puré de tomate", "50ml / 2fl oz de brandy", "150ml / 5fl oz de vino blanco", "pizca de copos de chile", "75g / 3oz de mantequilla, ablandada", "25 g / 1 oz de queso parmesano, rallado"], "method": ["Para preparar la sepia, cortar los tentáculos y las alas de las setas hasta que estén muy finas. Cortar los cuerpos de sepia por la mitad a lo largo y apilar una mitad sobre la otra en bolsas de envasado al vacío y sellar. Congele los cuerpos de sepia en las bolsas, durante al menos dos horas, hasta que queden sólidas.", "Caliente una sartén hasta que esté caliente, agregue los tentáculos picados y las alitas y cocínelos a fuego medio hasta que salga todo el líquido. Escurrir la carne picada de jibia, descartando el líquido.", "En una sartén separada, agregue el aceite de oliva y fríe con cuidado la chalota y el ajo con el bouquet garni, hasta que se ablanden.", "Agregue la jibia picada cocida, el perejil y el puré de tomate a la sartén y cocine durante 5-10 minutos.", "Agregue el brandy y cocine hasta que haya reducido el volumen, agregue el vino y reduzca el volumen nuevamente, a la mitad.", "Agregue las hojuelas de chile y reponga la sartén con agua, hasta cubrir el contenido de la sartén. Ponga la sartén a ebullición, luego reduzca el fuego a fuego lento y cocine por 15 minutos hasta que la jibia esté tierna, y el volumen de líquido se haya reducido. Compruebe el condimento y agregue sal y pimienta negra recién molida al gusto.", "Justo antes de servir, ponga a hervir un recipiente con agua. Saca los cuerpos de sepia congelados del congelador y retíralos de las bolsas de la aspiradora. Cortar finamente los cuerpos de sepia congelados, en rodajas de 2 mm / ⅛. Coloque las rodajas de sepia en el agua hirviendo y cocine durante 10-15 segundos.", "Escurrir bien y mezclar con la mantequilla suavizada, sal y pimienta negra recién molida.", "Para servir, espolvorea las rodajas de sepia en tazones para servir y coloca el ragú de jibia encima. Termine con un poco de parmesano rallado y perejil picado."], "url": "www_bbc_co_uk_food_recipes_cuttlefish_bolognaise_88647", "title": "Jibia de sepia", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 hojas de menta fresca", "50ml / 2fl oz de vinagre Chardonnay", "2 cucharadas de aceite de oliva light", "¼ de sandía, pelada, sin semillas y cortada en cubos de 2.5cm / 1in", "8g de copos de chile", "2 g de pimienta negra", "2g semillas de comino", "2 g de semillas de cilantro", "2g semillas de alholva", "2g sal de roca", "1 limón sin cebar, solo ralladura, más 1 cucharadita de jugo de limón", "10 g / ¼ oz de azúcar en polvo", "perilla pequeña mantequilla sin sal", "50g / 2oz de almendras copos tostadas", "8 rábanos, con hojas (preferiblemente desayuno francés)", "1 sepia, limpiada y preparada (pídale a su pescadero que haga esto por usted), cortada en tiras de 3 mm / ⅛ pulgadas", "flores comestibles picantes (como la capuchina)", "2 almendras peladas enteras, ralladas"], "method": ["Limpia y lava la sepia. Retire el hueso y abra el cuerpo. Retire el saco de tinta y deséchelo o utilícelo para otra receta. Retire las tripas y la piel. Lave y seque la carne blanca y luego córtela en tiras gruesas de 3 mm / ⅛ pulgadas.", "Corta finamente la menta y quita la gruesa vena central. Mezcle con el vinagre y agregue el aceite de oliva. Dejar de lado.", "Caliente una sartén a la plancha y ase a la parrilla el melón hasta que esté coloreado.", "Con un molinillo de especias o un pequeño procesador de alimentos, mezcle las especias y la sal juntas. Agregue la ralladura de limón.", "Ponga el azúcar en una sartén de base pesada y caliente hasta que se forme un caramelo dorado claro. Agregue la mezcla de especias, la mantequilla y las almendras en copos. Revuelva bien y rocíe con una cucharadita de jugo de limón. Viértalo en una bandeja y déjelo enfriar. Una vez frío, picar bruscamente.", "Elige y reserva las hojas de rábano. Lave y corte los rábanos y colóquelos en agua helada hasta que estén listos para servir.", "Calienta una sartén antiadherente. Viste a la sepia con aderezo de menta y luego fríe en la sartén hasta que esté ligeramente coloreada. Una vez cocinado, devuelva la jibia al aderezo.", "Para servir, coloca la sepia en platos para servir. Agregue el melón, los rábanos y las almendras caramelizadas. Adorne con flores comestibles, hojas de rábano y almendras recién ralladas."], "url": "www_bbc_co_uk_food_recipes_cuttlefish_in_a_mint_55577", "title": "Sepia con sandía a la plancha, almendras y ensalada de rábano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 sepia grande (alrededor de 1kg / 2lb 4oz) o 1kg / 2lb 4 oz de calamar", "2 cucharadas de aceite de oliva", "1 cebolla grande, finamente picada", "3 dientes de ajo, finamente picados", "200ml / 7fl oz de vino blanco", "Tomates de 400g / 14oz, desollados y picado (idealmente frescos, pero alternativamente tomates enlatados)", "gran ramita de tomillo", "2 hojas de laurel", "1 cucharadita de semillas de hinojo", "algunas hojas de albahaca"], "method": ["Primero prepare la jibia (o el calamar - se hacen más o menos de la misma manera). Si está entero y sin limpiar, hágalo en el fregadero, ya que la tinta negra puede hacer que todo el proceso sea muy complicado.", "Corta o retira los tentáculos del cuerpo, cortando el pico que estará en el centro de los tentáculos. Retire con cuidado las entrañas y el saco de tinta del cuerpo principal. Saque la jibia (o la pluma de calamar), luego enjuague bien la sepia o el calamar, quitándole las membranas. Cortar en rodajas bastante gruesas y secar lo más minuciosamente posible.", "Caliente el aceite de oliva en una cazuela grande o una cacerola a fuego medio-alto. Agregue la jibia o el calamar, y cocine rápidamente durante 2-3 minutos, o hasta que estén ligeramente coloreados. Baje el fuego y luego agregue la cebolla. Continúe cocinando, revolviendo regularmente durante 10 minutos, o hasta que la cebolla se haya suavizado.", "Vierta el vino blanco y deje que hierva. Deje burbujear furiosamente por un par de minutos, luego agregue los tomates, hierbas y semillas de hinojo. Condimentar con sal y pimienta. Cubra y cocine a fuego lento durante aproximadamente una hora y media, hasta que la sepia o el calamar estén tiernos.", "Retire la tapa y cocine a fuego lento destapado por unos minutos más para reducir ligeramente la salsa. Sirva adornado con hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_cuttlefish_or_squid_stew_49211", "title": "Guiso de sepia o calamar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225 g / 8 oz moong dal (lentejas amarillas)", "750ml / 1pt 7fl oz de agua", "2-3 cucharadas de girasol o aceite vegetal", "1 cucharadita de semillas de mostaza negra", "¼ cucharadita de cúrcuma molida", "¼ cucharadita de comino molido", "¼ cucharadita de asafoetida o semillas de hinojo", "2 cucharadas de jengibre fresco rallado", "2 chiles verdes, sin semillas y picados", "8 hojas de curry", "100 g / 3½ oz de espinaca", "2 cebolletas, cortadas y picadas"], "method": ["Coloque el daal en una cacerola de base pesada, vierta en 750ml / 1pt 7 fl oz de agua y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento durante aproximadamente una hora, o hasta que las lentejas estén realmente suaves.", "Calienta el aceite en una sartén grande. Agregue las semillas de mostaza, cúrcuma, comino, asafétida o semillas de hinojo, jengibre, chiles y hojas de curry y fría durante 2-3 minutos.", "cuando el daal esté cocido, agrégalo a la sartén y mezcla las espinacas y las cebolletas.", "Caliente por otros dos minutos, sazone y luego sirva."], "url": "www_bbc_co_uk_food_recipes_daalsaag_74848", "title": "Dal Saag", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/daalsaag_74848_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 rollos suizos de frambuesa listos para usar, cortados en rodajas de 4cm / 1½ pulgadas", "6 cucharadas de jerez dulce", "1 x 135g / 5oz bloque de gelatina de grosella negra", "polvo de flan", "500ml / 17fl de leche en oz", "2 plátanos maduros, pelados y picados", "600ml / 1¼ pintas de crema doble", "100g / 3½oz de almendras en copos", "200 g / 7oz de cerezas glacé, en rodajas", "50g / 2oz de angélica confitada"], "method": ["Coloque las rebanadas de rollo suizo en el fondo de un plato grande. Remoje generosamente las piezas suizas con el jerez.", "Prepare la gelatina de acuerdo con las instrucciones del paquete, usando agua para disolverla. Vierta la gelatina disuelta sobre los panecillos suizos, luego déjela enfriar. Enfríe en el refrigerador hasta que la gelatina se haya solidificado.", "Prepare la crema en polvo de acuerdo con las instrucciones del paquete usando la leche. Agregue los plátanos picados y deje enfriar.", "Cuando la natilla se haya enfriado, viértala sobre la gelatina y luego déjela enfriar. Regrese a la nevera y deje enfriar durante 30 minutos o hasta que lo necesite.", "Batir la crema doble hasta que se formen picos rígidos cuando se quite la batidora, luego untarla sobre la crema pastelera.", "Tueste las almendras en copos en una sartén seca a fuego medio hasta que estén ligeramente coloreadas. Dispóngalos encima de la bagatela.", "Decora la parte superior de la bagatela con las cerezas glaseadas en rodajas y la angélica confitada justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_dads_banana_custard_00581", "title": "Bagatela de plátano de papá", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dads_banana_custard_00581_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 450 g / 1 lb, más extra para quitar el polvo", "2 cucharaditas de levadura seca de acción rápida", "1 cucharadita de polvo de hornear", "1 huevo de gallinas camperas", "1 cucharadita de azúcar en polvo", "Una pizca de sal marina", "150g / 5oz de yogurt natural", "150ml / 5fl de leche en oz", "50g / 2oz de mantequilla, derretida", "4 cucharadas de aceite vegetal", "2 chiles rojos secos enteros, desgarrados o picados, sin semillas", "2 chiles verdes largos, finamente picados", "2 cebollas, finamente picadas", "1 cucharada de hojas frescas de curry picado", "Jengibre fresco de la raíz de los 5cm / 2in, pelado, cortado fino", "6 dientes de ajo, finamente picados", "1 cucharadita de chile rojo en polvo caliente", "1 cucharadita de comino molido", "2 cucharaditas de cilantro molido", "1 cucharadita de cúrcuma", "300ml / 10½fl oz de caldo de pollo", "Lentejas rojas 250g / 9oz, enjuagadas, luego remojadas en 250ml / 9fl oz de agua por 15 minutos", "1 cucharadita de sal", "40 g / 2½ oz de mantequilla", "6 muslos de pollo deshuesados ​​y sin piel, cortados en trozos", "1 x 200 g de tomates de hojalata", "1 cucharada de pasta de tamarindo", "1 cucharada de azúcar moreno oscuro", "1 cilantro fresco pequeño, tostado, más extra para servir", "2 cucharadas de hojas de menta fresca picadas", "aceite vegetal, para freír poco", "450 g / 1 libra de paneer, cortado en tiras finas de aproximadamente 1 cm / ½ pulgada de ancho 3 cm / 1¼ pulgada de largo", "50g / 2oz de piñones", "4 chiles verdes largos, en rodajas finas", "8 dientes de ajo, finamente cortados en cubitos", "Jengibre de raíz fresco de 5cm / 2in en pieza, pelado y cortado en cubitos finos", "1 cebolla roja, finamente rebanada", "1 pimiento verde, finamente cortado", "1 pimiento rojo largo, finamente cortado", "50ml / 2fl oz de vinagre de vino blanco", "75ml / 2¾fl oz de salsa de soja ligera", "250ml / 9fl oz de caldo de pollo", "3 cebollas de primavera, cortadas, finamente cortadas", "1 cucharada de harina de maíz, mezclada en una pasta con 3 cucharadas de agua fría"], "method": ["Para el naan, coloque la harina, la levadura y el polvo de hornear en una batidora de pie equipada con un gancho de masa, o use un tazón grande y un batidor de mano eléctrico equipado con un gancho de masa.", "Agregue el huevo, el azúcar y la sal y mezcle bien para combinar. Agregue el yogur y la leche y continúe mezclando hasta que la mezcla se una como una masa suave.", "Coloque la masa a un lado, en el tazón, durante 1 hora, o hasta que se haya levantado, luego dé vuelta sobre una superficie de trabajo ligeramente enharinada y amasar brevemente hasta que quede suave y elástica. Dejar de lado hasta que sea necesario.", "Divida la masa en 6 bolas del mismo tamaño, colóquelas en una bandeja enharinada, cúbralas con una toalla de té limpia y déjelas aparte una vez más a temperatura ambiente durante 1 hora más.", "Mientras tanto, para el pollo dálmata, caliente la mitad del aceite vegetal en una sartén grande y de base pesada a fuego alto. Agregue los chiles secos y fría por 1 minuto, luego agregue los chiles verdes y la cebolla y fría por 3-4 minutos, o hasta que estén ligeramente coloreados. Agregue las hojas de curry, el jengibre y el ajo y continúe freír.", "En un tazón, mezcle el chile en polvo, el comino molido, el cilantro y la cúrcuma con 150 ml / 5 fl oz del caldo de pollo para formar una pasta. Agregue la pasta a la sartén y cocine hasta que vea el aceite separado de la mezcla, unos 2-3 minutos.", "Agregue las lentejas y su agua de remojo a la sartén y lleve la mezcla a ebullición, revolviendo bien. Sazonar, al gusto, con la sal, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra la sartén con la tapa y cocine a fuego lento durante 4-5 minutos.", "Agregue la mantequilla a la sartén, cubra una vez más y continúe cocinando a fuego lento mientras cocina el pollo.", "Caliente el aceite restante en una cacerola aparte a fuego medio. Freír el pollo durante 3-4 minutos, o hasta que esté dorado por ambos lados y casi cocido.", "Transfiera la mezcla de lentejas a la sartén que contiene el pollo, luego agregue los tomates enlatados y el caldo de pollo restante. Regrese la mezcla a fuego lento y cocine a fuego lento durante otros 5-10 minutos, o hasta que el pollo esté cocido sin dejar rastros de color rosa y las lentejas estén blandas.", "Agregue la pasta de tamarindo, el azúcar moreno, el cilantro y la menta y sazone nuevamente, al gusto. Afloje la mezcla con un poco más de stock si es demasiado grueso.", "Para el chili paneer, caliente un wok a fuego alto, luego agregue suficiente aceite para alcanzar los 2.5 cm por los lados. Cuando el aceite esté reluciente, baje con cuidado el paneer en la sartén por lotes y fría hasta que se dore por todas partes. Transfiera cada lote a un tamiz suspendido sobre un recipiente.", "Deseche la mayor parte del aceite, dejando suficiente para cubrir el fondo del wok.", "Agregue los piñones, el chile, el jengibre y el ajo al wok y saltee durante 1-2 minutos.", "Agregue la cebolla roja y los pimientos y saltee durante otros 1-2 minutos, luego agregue el vinagre, la salsa de soya y el caldo de pollo y lleve a la mezcla a fuego lento.", "Agregue las cebolletas y continúe cocinando a fuego lento durante 1-2 minutos, luego bata la pasta de harina de maíz y continúe cocinando hasta que la salsa se haya espesado. Agregue el paneer drenado. Adorne con cilantro.", "Precalentar el horno a su configuración más alta. Coloque una bandeja de horno de base pesada o piedra para pizza en el horno a medida que se calienta.", "Estire cada bola de masa en una forma ovalada plana con sus manos. Hornee los naans en el horno durante 4 a 5 minutos, o hasta que estén ligeramente dorados, y luego manténgalos calientes. Justo antes de servir, cepille sus superficies con mantequilla derretida.", "Para servir, transfiere el dal de pollo a un tazón de servir grande. Apila los naans en un plato al lado. Con una cuchara, coloca el ají paneer en un plato aparte. Deja que todos se ayuden a sí mismos."], "url": "www_bbc_co_uk_food_recipes_dahl_chicken_with_chilli_24406", "title": "Pollo Dal con ají paneer y naan", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte, más extra para espolvorear", "100 g / 3½ oz de azúcar en polvo", "7 g de levadura de acción rápida", "150ml / 5fl oz de leche entera, calentada", "2 huevos grandes de gallinas camperas, ligeramente golpeados", "70 g / 2½ oz de mantequilla sin sal, derretida", "1 limón, ralladura finamente rallada solamente", "aceite vegetal, para engrasar", "4 ciruelas maduras, picadas y sin hueso", "1 naranja mediana, solo jugo", "50g / 1¾oz demerara azúcar", "pellizcar canela molida", "150ml / 5fl oz de leche entera", "150ml / 5fl oz de crema doble", "3 yemas de huevo grandes de gallinas camperas", "½ cucharadita de pasta de vainilla", "2 cucharaditas de harina común", "50 g / 1 oz de azúcar en polvo", "25 g / 1oz de mantequilla sin sal", "150ml / 5fl oz de leche entera", "25 g / 1 oz de azúcar en polvo"], "method": ["Para el dampfnudel, incline la harina en un tazón grande. Agregue el azúcar a un lado del tazón y la levadura al otro. Agregue la leche, los huevos y la mantequilla y revuelva la mezcla con los dedos hasta que tenga una masa áspera y haya recogido toda la harina de los lados del recipiente.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase durante 5-10 minutos. Trabaja en la etapa húmeda inicial hasta que la masa comience a formar una piel suave y lisa. Esparza la ralladura de limón sobre la masa y amasar hasta que esté uniformemente incorporada.", "Coloque la masa en un recipiente ligeramente engrasado, cubra con una película adhesiva engrasada y deje crecer durante al menos 1 hora hasta que duplique su tamaño.", "Mientras tanto, para la salsa de ciruela, incline las ciruelas y el jugo de naranja en una olla grande. Espolvorea sobre el azúcar y cocina a fuego lento hasta que el azúcar se disuelva.", "Aumente el fuego y hierva durante 10 minutos, aplastando las ciruelas con una cuchara de madera. Retire del fuego y agregue la canela. Deje que se enfríe un poco, luego mezcle hasta obtener una salsa espesa. Dejar de lado.", "Para la salsa de vainilla, caliente la leche y la crema en una cacerola de base pesada a fuego medio hasta justo por debajo del punto de ebullición y luego retírelo del fuego. En un tazón grande, mezcle las yemas de huevo, la pasta de vainilla, la harina y el azúcar hasta que estén pálidos y esponjosos. Vierta sobre la leche calentada, batiendo continuamente. Vierta la mezcla de nuevo en la sartén y cocine a fuego muy lento durante 3-4 minutos revolviendo continuamente hasta que quede suave y lo suficientemente grueso como para cubrir la parte posterior de una cuchara. Sáquelo del fuego y apártelo. Cubra la superficie de la salsa con film transparente, para evitar que se forme la piel.", "Convierta la masa levantada en una superficie ligeramente enharinada. Gire hacia adentro repetidamente hasta que todo el aire se caiga. Divide la masa en 12 pedazos y rueda en bolas.", "Para el líquido que caza furtivamente, caliente la mantequilla, la leche y el azúcar en una sartén grande con una tapa ajustada a fuego medio durante 5 minutos o hasta que el azúcar se disuelva. Retire del fuego y, teniendo cuidado de no quemarse, agregue las bolas de masa, asegurándose de que estén todas sentadas en la base de la sartén. Deje reposar durante 15 minutos hasta que duplique su tamaño.", "Reduzca a fuego lento y cocine, tapado, durante 25-30 minutos (vigílelos ya que se quemarán fácilmente, por lo tanto, revíselos al final del tiempo de cocción y agregue un poco de leche si comienzan a atrapar). Retire la tapa y cocine a fuego lento durante otros 5-10 minutos hasta que las bases estén doradas y caramelizadas.", "Mientras tanto, vuelva a calentar suavemente las salsas de ciruela y vainilla.", "Retire los humedecidos del calor y levante cuidadosamente de la sartén. Sirva con la corteza dorada hacia arriba, con las salsas cálidas de ciruela y vainilla al lado."], "url": "www_bbc_co_uk_food_recipes_dampfnudel_36590", "title": "Dampfnudel", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12 humedales húmedos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dampfnudel_36590_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Damsons de 900g / 2lb, lavados y sin tallos", "100 g / 4 oz de azúcar en polvo", "Harina de levante 225g / 8oz", "2 cucharaditas de polvo de hornear", "75g / 3oz de mantequilla fría, cortada en cubitos", "100 g / 4 oz de azúcar en polvo, más 1 cucharada", "una pizca de sal", "1 huevo mediano", "100ml / 4fl oz de suero de leche", "15g / 1 / 2oz de almendras en copos"], "method": ["Extienda los damsons sobre la base de un plato refractario de 2 litros / 3½ pinta de poca profundidad y espolvoree con azúcar en polvo. Precalentar el horno a 190C / 375F / Gas 5.", "Tamiza la harina, el polvo de hornear, los 100 g / 4 oz de azúcar en polvo y una pizca de sal en un recipiente o un procesador de alimentos, agrega la mantequilla y trabaja juntos hasta que la mezcla se vea como pan rallado fino.", "Rompe el huevo en el suero de leche y bate bien juntos. Agregue a los ingredientes secos y mezcle ligeramente en una masa suave y pegajosa. Deje caer cucharadas de la mezcla por encima de los damsons, dejando un pequeño espacio entre cada una, luego espolvoree con las almendras en copos y las 1 cucharadas restantes de azúcar.", "Hornee en el horno durante 30-35 minutos hasta que estén dorados y burbujeantes, cubriéndolo holgadamente con una hoja de papel de aluminio si se dora demasiado rápido. Se realiza cuando un pincho, empujado en el centro de la cubierta del zapatero, sale limpio. Deje que se enfríe brevemente antes de servir con crema pastelera, crema doble o crema fresca."], "url": "www_bbc_co_uk_food_recipes_damsoncobbler_70309", "title": "Zapatero Damson", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/damsoncobbler_70309_16x9.jpg", "isVegetarian": true, "recommendations": 0}]