[{"isVegetarian": true, "title": "Travelling pancake", "url": "www_bbc_co_uk_food_recipes_travelling_pancake_78989", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp self-raising flour", "2 tsp caster sugar", "3 tbsp milk", "1 tsp runny honey, plus extra to serve", "1½ tsp vegetable oil", "1 tbsp blueberries, plus a few to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour and sugar in the jar and stir. Lightly beat in the milk, honey and oil until the mixture is a little doughy. Gently stir in the blueberries, being careful not to squash them.", "Microwave for 1 minute in an 800W microwave. Leave to stand for 2 minutes.", "Remove from the microwave with a tea towel (Caution: the jar may be still be hot). To serve, drizzle with honey and sprinkle over the blueberries."]}, {"isVegetarian": false, "title": "Treacle-cured beef with Yorkshire puddings and roast potatoes", "url": "www_bbc_co_uk_food_recipes_treacle_cured_beef_with_35837", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacle_cured_beef_with_35837_16x9.jpg", "ingredients": ["200g/7oz black treacle", "1 x 800g/1lb 12oz fillet of beef (a middle cut such as rib or loin), at room temperature", "salt and black pepper", "3-4 tbsp vegetable oil", "2 knobs of butter", "8 potatoes (such as Maris Piper), peeled and cut into large chunks ", "500g/1lb 2oz spinach, washed", "500ml/18fl oz red wine sauce or gravy, to serve ", "4 free-range eggs", "350ml/12fl oz milk", "225g/8oz plain flour"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To marinate the beef, mix the treacle with 100ml/3½fl oz of water. Put the beef in a container and cover with the treacle mixture. Leave to marinate for 24 hours, turning occasionally.", "After 24 hours, remove the beef from the marinade and pat dry. Place the marinade in a pan and heat gently until the volume of liquid has reduced by half. Season with salt and pepper.", "For the Yorkshire puddings, mix the eggs and milk together in a jug. Put the flour in a bowl and then slowly and gently whisk in the milk and egg mix. Don’t over whisk - lumps are okay. Rest the mixture at room temperature for at least four hours.", "To cook the beef, preheat the oven to 55C/130F/Gas ¼ (or the lowest possible setting on your oven).", "Heat a little oil in a large pan set over a high heat. When hot, add a knob of butter and fry the beef all over. Place the beef in a roasting tin and transfer to the bottom shelf of the oven for 45 minutes (or longer if you prefer your meat well cooked).", "Remove the beef from the oven and brush with the reduced marinade. Cover and set aside to rest.", "To make the roast potatoes, bring a large pan of salted water to the boil. Add the potatoes and cook until soft on the outside. Drain and let them steam dry on a wire rack placed over a roasting tin.", "Preheat the oven to 200C/400F/Gas 6.", "Add a little oil to a roasting tin and place in the oven to heat. When the oil is hot, add the dry potatoes and stir gently to coat in oil. Roast for 40 minutes, turning occasionally, until crisp and brown. ", "For the Yorkshire puddings, Add a little vegetable oil to each hole of a muffin tin or Yorkshire pudding tin and place in the oven (still at 200C/400F/Gas 6) to heat. ", "When the oil is hot and the Yorkshire pudding batter is rested, fill each hole of the muffin tin and cook in the oven for 15-20 minutes, or until risen and golden-brown. ", "Just before serving, wilt the spinach in a saucepan with a knob of butter. Season with salt and freshly ground black pepper.", "To serve, heat the red wine sauce or gravy. Slice the beef and add to serving plates with the sauce, spinach, roasted potatoes and Yorkshire puddings."]}, {"isVegetarian": true, "title": "Treacle pudding", "url": "www_bbc_co_uk_food_recipes_treacle_pudding_80920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacle_pudding_80920_16x9.jpg", "ingredients": ["180g/6oz unsalted butter, softened, plus extra for greasing", "3 tbsp golden syrup", "180g/6oz plain flour", "3 tsp baking powder", "3 free-range eggs", "180g/6oz demerara sugar", "1 tbsp black treacle"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1litre/1¾ pints pudding basin with butter. Put the golden syrup in to the bottom of the basin.", "In a separate bowl, using an electric hand whisk, mix the flour, baking powder, butter, eggs, sugar and treacle until well combined.", "Pour the mixture into the basin and cover with a piece of greaseproof paper.", "Take a piece of tin foil and make a pleat down the middle, then place this over the top of pudding basin and tie it in place like a lid. The pleat allows the foil to expand during cooking.", "Place an upturned saucer or a ramekin in a deep saucepan and sit the pudding on top. Add boiling water until it comes half-way up the basin. Place a lid on the pan and simmer gently to stream the pudding for about 2¼ hours, topping up the water as necessary.", "To check if the pudding is cooked, insert a metal skewer into the pudding. If it comes out clean it is ready.", "Carefully remove the pudding from the pan. Loosen the edges by running a table knife around the pudding and turn out onto a plate."]}, {"isVegetarian": true, "title": "Treacle pudding with nutmeg, lemon and lime", "url": "www_bbc_co_uk_food_recipes_treacle_pudding_with_38249", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter, well softened, plus extra for greasing", "115g/4oz caster sugar", "2 free-range eggs, lightly beaten ", "1 nutmeg, grated, plus extra for serving", "1 lime, grated zest only", "1 lemon, grated zest only", "140g/5oz self-raising flour, sifted, plus extra for dusting", "1 tsp baking powder ", "1 tbsp milk, or more if needed", "55g/2oz treacle toffee (if not available, use butterscotch or fudge), chopped into small pieces", "3 tbsp treacle or golden syrup", "custard"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, cream the butter and sugar together with an electric hand-held mixer until pale and fluffy.", "Add half of the beaten eggs and continue to beat for 1–2 minutes. Stop, scrape the sides of the bowl, then add the remaining beaten egg and continue beating for 1–2 minutes. Scrape the sides again. Add the nutmeg, lime and lemon zest, and beat for a few seconds more.", "With a metal spoon, gradually fold the sifted flour and baking powder into the mixture as lightly as you can, keeping to a dropping consistency by adding milk, if needed. Fold in the toffee or fudge pieces.", "Bring a large pan of water to the boil and place a steamer with a lid on top.", "Butter and lightly flour a 1.2 litre/2 pint pudding basin. Spoon the treacle (or golden syrup) into the bottom of the basin, then add the pudding mixture. Secure the lid and steam gently for three hours, adding more water to the pan if necessary – keep a close eye on the pan so it doesn’t boil dry. The pudding is cooked when a skewer inserted into it comes out clean. ", "Serve with custard and extra nutmeg grated over."]}, {"isVegetarian": false, "title": "Treacle marinated lamb fillet with caraway creamed carrots", "url": "www_bbc_co_uk_food_recipes_treaclemarinatedlamb_74708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1 pint 15fl oz water", "50g/2oz salt", "50g/2oz sugar", "½ tbsp black treacle", "½ tsp ground allspice berries", "5 juniper berries", "½ tsp black peppercorns", "2 sage leaves", "2 bay leaves", "1 garlic head, halved ", "2 shallots, peeled and sliced", "1 sprig of thyme", "4 lamb fillets", "2 tbsp vegetable oil", "4 carrots, cut into 1cm/½in cubes", "150ml/5fl oz double cream", "1 tsp caraway seeds", "salt and freshly ground black pepper", "1 tsp unsalted butter", "½ lemon, juice only", "sprig of chervil", "250ml/9fl oz chicken stock", "125ml/4½fl oz balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the marinade, place all the ingredients into a pan and bring to the boil. ", "Remove from the heat and allow to cool.", "Add the lamb to the marinade, cover, and leave overnight in the fridge.", "Preheat oven to 180C/355F/Gas 4.", "For the carrots, place the carrots in a pan and cover with cold water. Bring to the boil and simmer until tender.", "Drain off the water, leaving two tablespoons behind.", "Pour double cream in and mix well.", "Heat a separate dry pan and add the caraway seeds. Cook for 1-2 minutes. ", "Mix the seed with the carrot and add the butter.", "For the sauce, reduce the stock and the vinegar until thickened to the consistency of treacle.", "Remove the meat from the marinade and pat dry on kitchen towels.", "Heat a pan with a drizzle of oil until hot and add the lamb. Sear on all sides.", "Transfer to an ovenproof dish and place in the oven to cook for a further 15-20 minutes.", "Remove and serve with the carrots and the sauce on an oblong serving dish."]}, {"isVegetarian": true, "title": "Treacle tart for a crowd", "url": "www_bbc_co_uk_food_recipes_treacle_tart_36254", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3kg/6lb 8oz plain flour", "1.25kg/2lb 12oz butter, diced", "10 free-range eggs, beaten", "2 litres/3½ pints golden syrup", "625g/1lb 6oz fresh breadcrumbs", "10 free-range eggs, lightly beaten", "5 lemons, zest and juice"], "serves": "Serves 40", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, rub the butter into the flour until the mixture resembles breadcrumbs. Gradually add the beaten egg and mix together to make a dough. You may need to add a little cold water. ", "Wrap the dough in cling film and place in the fridge for at least 30 minutes. If you are making five tarts, divide the mixture into five portions of equal weight and wrap them separately.", "Preheat the oven to 180C/350F/Gas 4. Lightly grease five 25cm/10in loose-bottomed tart tins, or two 40cm x 30cm/16in x 12in baking trays. ", "On a lightly floured surface, roll out the pastry and use to line the tart cases or the baking trays.", "Cover the pastry case with cling film and place in the fridge to rest for 15 minutes.", "Remove the pastry from the fridge and remove the cling film. Line the pastry cases with greaseproof paper and fill with baking beans.", "Transfer to the oven and blind bake for 10-15 minutes.", "Remove the pastry cases from the oven and remove the greaseproof paper and baking beans. Return to the oven for a further 3-5 minutes.", "Remove the pastry cases from the oven and lower the oven temperature to 140C/275F/Gas 1.", "For the filling, place the golden syrup, breadcrumbs, beaten eggs and lemon juice and zest into a large bowl and mix well.", "Pour the filling mixture into the pastry cases, transfer to the oven and bake for about 50 minutes or until golden-brown. Remove from the oven and allow to cool slightly."]}, {"isVegetarian": true, "title": "Treacle tart", "url": "www_bbc_co_uk_food_recipes_treacletart_67656", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/treacletart_67656_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "110g/4oz butter, chilled, diced", "1 medium free-range egg, lightly beaten", "450g/1lb golden syrup", "85g/3oz fresh breadcrumbs", "generous pinch ground ginger", "1 lemon, zest, finely grated and 2 tbsp of the juice", "clotted cream or double cream"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["In a bowl, rub the butter into the flour with your fingers until it resembles fine breadcrumbs.", "Mix in the egg with a knife, then knead on a clean, lightly dusted work surface to form a smooth dough.", "Use the dough to line a 23cm/9in loose-bottomed tart tin, prick the base all over with a fork and leave to rest in the fridge for about 30 minutes.", "Preheat the oven to 190C/375F/Gas 5.", "Line the pastry with parchment paper and weigh down with rice or ceramic baking beans. Bake the pastry blind for 10-15 minutes, remove the paper and rice or beans and return the pastry case to the oven for a few minutes more, until light golden-brown.", "For the filling, mix together the filling ingredients in a bowl and pour into the pastry case. Return to the oven and bake for about 30 minutes. Serve hot or cold with clotted cream or double cream."]}, {"isVegetarian": true, "title": "Treacle sponge pudding with spiced pears", "url": "www_bbc_co_uk_food_recipes_treacle_sponge_pudding_64578", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz golden syrup", "1 pear, peeled, thinly sliced from top to bottom", "175g/6oz caster sugar", "175g/6oz softened butter, plus extra for greasing", "3 free-range eggs", "175g/6oz self-raising flour", "500ml/18fl oz sweet white wine", "3 star anise", "½ tsp cloves", "1 cinnamon stick, broken into pieces", "4 pears, peeled and cut into quarters from top to bottom", "1 orange, pared zest only", "1 lemon, pared zest only", "250ml/9fl oz full-fat milk", "250ml/9fl oz double cream", "1 vanilla pod, split in half, seeds scraped out using a sharp knife", "110g/4oz caster sugar", "6 free-range egg yolks"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Grease a 1kg/2lb 4oz rectangular terrine mould or loaf tin with butter. ", "Pour the golden syrup into the terrine mould, then arrange the pear slices on top in a single layer, overlapping the slices slightly.", "Beat the sugar and butter until pale and fluffy. Beat in the eggs one at a time until well combined, then fold in the flour.", "Spoon the sponge mixture into the terrine and smooth the top. ", "Cut a large rectangle of greaseproof paper and place it on top of the pudding. Fold a rectangle of aluminium foil in half to form a double layer, then crimp that around the top of the terrine and secure with cook's string. ", "Place the terrine into a large saucepan and add enough water to reach halfway up the sides of the terrine.", "Cover the pan with a lid, bring the water to the boil, then reduce the heat until simmering. Steam the sponge pudding for 1½ hours, or until a skewer inserted into the centre of the sponge comes out clean. Checking the water level halfway through cooking.", "Meanwhile, for the spiced pears, bring the sweet wine to the boil in a saucepan with the star anise, cloves, cinnamon stick, pears, orange and lemon zests. Reduce the heat and simmer for 12-15 minutes, or until the pears are tender. Set aside.", "For the custard, heat the milk, cream and vanilla seeds in a saucepan over a medium heat. Bring to the boil.", "Whisk the sugar and egg yolks in a bowl until pale and thick. When the milk is boiling, pour it onto the egg mixture, whisking all the time, until well combined, then return the whole mixture to the pan and cook over a gentle heat, whisking occasionally, until it has thickened enough to coat the back of a wooden spoon. Strain the custard if desired.", "When the sponge pudding is cooked, turn the heat off and allow to cool slightly before removing it from the pan. Unwrap the pudding and remove the greaseproof paper. Place a plate on top of the pudding and flip it over, holding the plate firmly in place. Set aside for 1-2 minutes, then remove the terrine mould – the pudding should just slide out.", "To serve, pile the pears into a serving bowl with the cooking liquid and pour the custard into a jug. Serve with the sliced sponge pudding."]}, {"isVegetarian": true, "title": "Classic treacle tart", "url": "www_bbc_co_uk_food_recipes_treacletart_85741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain white flour", "150g/5oz unsalted butter, chilled, cut into cubes", "1 free-range egg yolk", "1 tbsp caster sugar", "2 tbsp cold water (add more or less as required)", "700g/1lb 8½oz golden syrup", "175g/6oz fresh white breadcrumbs", "3 lemons, zest only", "2 free-range eggs, lightly beaten"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the egg yolk, sugar and about two tablespoons of cold water and pulse until a firm dough is formed.", "Remove from the processor and place onto a lightly floured surface. Knead lightly, then wrap in cling film and transfer to the fridge to chill for 30 minutes.", "Preheat the oven to 180C/355F/Gas 4.", "Remove and unwrap the pastry and roll out the pastry on a lightly floured surface. Line a 25cm/10in shallow, fluted loose-based flan tin. Press the pastry into the sides and prick the base all over with a fork. (Save any spare pastry for decoration.)", "For the filling, gently heat the golden syrup in a pan until melted down and runny. Remove from the heat and mix with the breadcrumbs and lemon zest.", "Add the eggs and stir well.", "Pour the treacle mixture into the pastry case. Use any spare pastry to decorate the top with lattice strips. Transfer to the oven to bake for 45-50 minutes, or until the filling is lightly set and golden. Allow to cool slightly before removing from the flan ring and serving."]}, {"isVegetarian": true, "title": "Perfect treacle tart", "url": "www_bbc_co_uk_food_recipes_treacletart_92048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, sifted, plus extra for dusting ", "175g/6oz butter, plus extra (melted) for greasing", "75g/2¾oz icing sugar", "2 free-range egg yolks", "1 tbsp cold water", "150g/5oz day-old brown or white bread, crusts removed", "650g/1lb 7oz golden syrup", "150g/5½oz unsalted butter", "1 free-range egg", "50ml/2fl oz double cream", "2 lemons, zest only", "large pinch salt", "clotted cream or double cream, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweet pastry, in a bowl, rub together the flour and butter using your fingertips, until the mixture resembles breadcrumbs.", "Add the icing sugar, egg yolks and cold water and mix until the mixture comes together as a dough. ", "Wrap the dough in cling film, then chill in the fridge for two hours, to rest.", "Grease a 23cm/9½in loose-bottomed tart case with melted butter, then dust with flour, gently knocking out any excess. ", "Meanwhile, line a baking tray with greaseproof paper and place the prepared tart case on top. ", "Once the pastry has rested, discard the cling film and roll the pastry out onto a lightly floured work surface to a 4-5mm thickness. ", "Lift the rolled pastry by rolling it loosely around the rolling pin, then lower it into the prepared tart case and press into the tart case to mould it to the sides and bottom. Trim off any excess pastry using a sharp knife. Chill the tart case in the fridge for a further 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "When the tart case has rested, remove it from the fridge and prick the base several times using a fork.", "Line the base and sides of the tart case with greaseproof paper, then fill it with baking beans. Transfer to the oven and bake for 30-35 minutes, or until crisp and pale golden-brown. Discard the greaseproof paper and baking beans.", "For the filling, blend the bread in a food processor until it has formed breadcrumbs. Set aside.", "Heat the golden syrup and butter in a pan over a low to medium heat until the syrup and the butter has melted. Set aside to cool slightly. ", "In a separate bowl, whisk together the egg and cream until well combined. Pour in the syrup and butter mixture and stir to combine. ", "Stir in the breadcrumbs, lemon zest and salt until well combined.", "Pour the filling mixture into the cooked pastry case, then return the tart to the oven and cook for a further 40-45 minutes, or until the filling is dark golden-brown.", "Remove from the oven and set aside for 15 minutes before serving to allow to cool slightly. Serve warm, with clotted cream or whipped cream."]}, {"isVegetarian": true, "title": "Treasure chest tart", "url": "www_bbc_co_uk_food_recipes_treasure_chest_tart_67063", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cherry tomatoes ", "4 basil leaves ", "pinch paprika ", "1 spring onion", "1 tsp olive oil ", "¼ fresh green pepper ", "1 dessertspoon sweetcorn ", "125g/4½ oz (¼ block) all-butter puff pastry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Preheat the oven to 220C/425F/Gas 7. Line a baking tray with baking paper and brush it generously with vegetable oil.  ", "Add the tomatoes to a mixing bowl then cut them into pieces with the scissors. ", "Tear up the basil leaves and add them to the bowl.  Add a pinch of paprika.", "Cut off the roots and the dark green top of the spring onion with the scissors and throw them away. Then chop up the spring onion into small pieces and add it to the tomatoes along with the olive oil.", "Pop open the pepper by putting your thumbs on the stalk and pressing inwards, and tear about a quarter of it into bite-sized pieces and add this to the other ingredients.  Next add the tinned sweetcorn.", "Roll out the pastry onto a lightly floured surface. ", "Trim the pastry into an even rectangle with the knife. Then use the tip of the knife to draw a border around the rectangle - like a picture frame - not cutting through the pastry completely. ", "Put the pastry onto the paper-lined baking tray - you need to do this now as it’s much harder to move once the topping is on. ", "Pile your vegetable filling into the central part of your pastry base and spread to the edges of the border. Bake for 15-20 minutes until the pastry is golden and risen. Serve your tart with carrot batons."]}, {"isVegetarian": false, "title": "Trencher with pink peppercorn and garlic lamb", "url": "www_bbc_co_uk_food_recipes_trencher_with_pink_07402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong wholemeal flour", "100g/3½oz rye flour", "150g/5½oz strong white flour", "2g instant yeast ", "10g salt", "340ml/11¾fl oz water", "oil, for greasing", "1 sprig fresh rosemary, finely chopped", "3 garlic cloves, crushed", "1 lemon, zest only", "1 tbsp olive oil", "4 boneless lamb leg steaks", "2 tbsp pink peppercorns, crushed ", "salt, to taste", "3 tbsp crème fraîche", "½ lemon, juice only", "1 heaped tsp English mustard", "150g/5½oz watercress", "175g/6oz green beans, trimmed and blanched", "8 spring onions, trimmed and sliced", "12 radishes, washed and halved"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flours, yeast and salt in a bowl. Add 255ml/9fl oz of water and, using your hands, mix to form a dough. Add a splash of the remaining water and continue to add it until all the flour has been incorporated and the edges of the bowl are clean (you may not need it all).", "Knead for 5-10 minutes, tip the dough into a clean oiled bowl, cover with a tea towel and leave in a warm place until it at least doubles in size. This will take around three hours.", "Once the dough has risen, tip out onto an oiled work surface. Using your hands push the dough out into a rectangular shape that is quite flat, like a pizza base. Using your fingers tips, push the surface of the dough to make dimples.  Line a baking tray with parchment paper and transfer the dough to the tray. Prick the middle area of the dough with a docker or fork, leaving a rim untouched round the outside.", "Leave in a warm place to prove for an hour.", "Preheat the oven to 220C/425F/Gas 7. Bake the dough for approximately 30 minutes, or until golden-brown and cooked through.", "For the lamb, in a large bowl mix the rosemary, garlic, lemon zest and oil.  Add the lamb and coat each steak in the marinade. Leave in the fridge for a minimum of 30 minutes, but up to overnight.", "For the dressing, in a bowl mix the dressing ingredients and season to taste.", "Place a griddle pan on a high heat. Remove the lamb from the marinade and sprinkle over the crushed peppercorns.  Season with a little salt. Fry the lamb in the hot pan for 2-3 minutes each side, or until cooked to your liking. Remove and leave to rest.", "To serve, take a large serving board or plate. Place the trencher in the centre. Scatter the watercress, beans, spring onions and radishes over the top.", "Slice the lamb on a slant and lay the pieces on top of the salad. Finally top with a little of the mustard dressing and serve at once."]}, {"isVegetarian": false, "title": "Trio of beer-battered fish fingers with pea purée and parsley oil", "url": "www_bbc_co_uk_food_recipes_trioofbeerbatteredfi_87862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "2 free-range eggs, separated", "150g/5oz plain flour", "salt and freshly ground black pepper ", "250ml/9fl oz British beer", "1 monkfish fillet, membrane removed, cut into four strips", "250g/9oz cod fillet, skin removed, cut into four strips ", "250g/9oz halibut fillet, skin removed, cut into four strips", "25g/1oz butter", "2 large shallots, finely chopped", "450g/1lb frozen peas, defrosted", "125ml/4½fl oz double cream", "4 tbsp chopped fresh mint leaves", "salt and freshly ground black pepper ", "½ lemon, juice only", "10g/½oz fresh flatleaf parsley leaves", "75ml/3fl oz extra virgin olive oil", "handful pea shoots, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish fingers, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it, or preheat a deep fat fryer to 190C/375F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the egg yolks, flour, salt and freshly ground black pepper into a bowl and whisk together.", "Pour in the beer and whisk to make a smooth batter.", "Place the egg whites into a separate bowl and whisk until stiff peaks form when the whisk is removed.", "Beat half the whisked egg whites into the batter, then gently fold in the remaining half.", "Dip each piece of fish into the batter to coat thoroughly, shaking off any excess.", "Carefully place the fish into the hot oil in batches and deep fry for 3-4 minutes, or until golden-brown and cooked through. Remove from the oil with a slotted spoon and drain on kitchen paper.", "Once all the fish is cooked, drop several pieces at a time back into the oil for 30-45 seconds - this helps to make them really crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "Meanwhile, for the pea purée, heat the butter in a pan and gently fry the shallots for 1-2 minutes.", "Add the peas and warm through gently, then add the cream and mint leaves and cook for a further minute.", "Transfer the mixture to a food processor and blend to a purée. Season, to taste, with salt and freshly ground black pepper and add a squeeze of lemon juice.", "For the parsley oil, place the parsley and olive oil into a small food processor and blend to a purée. Pour the mixture into a sieve lined with muslin or a clean kitchen cloth and leave to drip into a bowl.", "To serve, spoon the pea purée onto four serving plates and top with some pea shoots. Place three fish fingers onto each plate and drizzle over the parsley oil."]}, {"isVegetarian": true, "title": "Trio of crème brûlées with palmiers", "url": "www_bbc_co_uk_food_recipes_trioofcremebruleeswi_86159", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz caster sugar", "5 free-range egg yolks", "250ml/10½fl oz milk", "250ml/10½fl oz double cream", "40g/1½oz dark chocolate, finely chopped", "½ lemon, zest and juice only", "1 small bunch mint leaves, picked and roughly chopped ", "¼ tsp peppermint essence, plus a few drops extra", "4 tbsp demerara sugar", "250g/10½oz ready-made puff pastry", "2 tsp caster sugar", "½ tsp freshly grated nutmeg", "4 sprigs fresh mint", "4 twists lemon peel", "4 shards dark chocolate"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/285F/Gas 1", "For the crème brûlées, lightly butter 12 very small ramekins.", "Place the sugar and egg yolks into a bowl and whisk together.", "Place the milk and cream into a pan over a low heat and bring to the boil.", "Gradually pour the hot milk and cream mixture onto the eggs, whisking constantly to combine.", "Place the chocolate into a clean bowl. Pour a third of the custard onto the chocolate and whisk well until all the chocolate has melted.", "Strain the chocolate custard into four of the ramekins.", "Pour half of the remaining custard into a clean bowl. Add the lemon zest and juice, stir to combine, then pour into four of the clean ramekins.", "Add the mint and peppermint essence to the remaining custard and leave to infuse for five minutes. Place a stick blender into the mint-infused custard and blend to combine.", "Pass through a sieve and pour into the remaining four clean ramekins.", "Place the ramekins into a roasting tray. Pour water into the roasting tray to half-fill with water, then transfer to the oven to bake for 30 minutes, or until the custards are just set.", "Remove the crème brûlées from the oven and the roasting tin. Leave to cool, then place into the fridge to chill.", "For the palmiers, preheat the oven to 200C/400F/Gas 6.", "On a clean flat surface, roll the puff pastry out to ½cm/¼in thick.", "Sprinkle with three-quarters of the caster sugar and three-quarters of the grated nutmeg.", "Starting at one end of the pastry, roll the pastry up towards the middle of the pastry.", "Turn the pastry around and roll the other side up towards the middle to leave two even rolls of pastry meeting in the middle.", "Cut the rolled up pastry into 1cm/½ thick slices. Place each slice flat onto a work surface and flatten out slightly with a rolling pin.", "Place the pastry pieces onto a baking sheet and dust with the remaining sugar and nutmeg.", "Transfer to the oven and bake for 12-15 minutes, until golden and crisp. Remove from the oven and allow to cool.", "To serve, when the crème brûlées are cold and fully set, slide a knife gently around the edge of each of the custards and turn each onto a large serving plate.", "Place one third of the demerara sugar into a clean bowl with a little drop of the peppermint essence. Sprinkle on top of the mint crème brûlées.", "Top the lemon and chocolate brûlées with the remaining demerara sugar.", "Using a mini-blowtorch, heat the sugar topping of each crème brûlée, until the sugar melts and caramelises.", "When the caramel has cooled, garnish each mint crème brûlée with a sprig of mint; garnish the lemon crème brûlées with a twist of lemon peel; and garnish the chocolate crème brûlées with some shards of chocolate.", "Add several palmiers to the plate and serve."]}, {"isVegetarian": false, "title": "Triple-crown roast of lamb with a jewelled fruit stuffing and minted red wine sauce", "url": "www_bbc_co_uk_food_recipes_triple-crown_roast_of_08690", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/triple-crown_roast_of_08690_16x9.jpg", "ingredients": ["3 x racks of lamb (best end), French trimmed (ask your butcher to do this)", "3 tbsp olive oil", "1 onion, finely chopped", "50g/2oz flaked almonds", "1 tsp ground cumin", "1 tsp ground coriander", "¼ tsp cayenne pepper", "½ tsp ground cinnamon", "1 pear, peeled, cored and chopped ", "2 garlic cloves, crushed", "150g/6oz dried apricots, quartered", "75g/3oz sultanas", "75g/3oz dried sweetened cranberries", "1 orange, zest only", "1 lemon, zest only", "bunch fresh parsley, chopped ", "1 tbsp chopped fresh thyme", "sea salt and freshly ground black pepper", "2 tsp plain flour", "150ml/5fl oz red wine", "150ml/5fl oz lamb stock or water", "2 tsp redcurrant jelly", "1 tbsp chopped fresh mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the stuffing, heat the oil in a large heavy-based frying pan. Add the onion and fry gently for five minutes, stirring occasionally until softened. Stir in the almonds and cook for 1-2 minutes until lightly toasted.  ", "Sprinkle the spices over the onion and almonds and cook for one minute. Scatter the pear pieces into the pan and add the garlic, apricots, sultanas, cranberries, orange and lemon zest. Stir together over a medium heat for 1-2 minutes. Add all the herbs and season with salt and freshly ground black pepper. Cook for a further minute, remove from the heat and set aside to cool.", "Season the racks of lamb with salt and freshly ground black pepper.  ", "Place the ribs onto a large, sturdy roasting tin with the eye of the meat at the bottom. Using six long pieces of kitchen string, tie the ribs together at three points. ", "Spoon the stuffing into the centre of the ribs and cover the surface with aluminium foil. Cover the ends of all the bones with foil to avoid burning.  ", "Roast the crown for 45 minutes for pink and an extra 15 minutes if you prefer your lamb medium. Remove the aluminium foil five minutes before the end of the cooking time.", "Remove the baking tin from the oven and carefully transfer the lamb and stuffing to a serving platter. Cover with aluminium foil and tea towels. Set aside for 10-15 minutes. ", "Reserve1-2 tsp of fat in the roasting tin, but discard the remainder. Heat the tin and remove the meaty trimmings with a spatula and discard. ", "Sprinkle the flour into the tin and cook for a few seconds. Slowly pour in the red wine and allow to bubble for 20 seconds, stirring vigorously with a wooden spoon. Stir in the water, add the mint and return to a simmer. Cook for 2-3 minutes, or until slightly thickened. Strain though a sieve into a heatproof jug. ", "Take the lamb to the table and cut through the bones to serve. Depending on the size of your racks, 2-3 chops should make one serving when accompanied by the fruity stuffing. Spoon over a little of the sauce and serve."]}, {"isVegetarian": true, "title": "Triple chocolate brownies", "url": "www_bbc_co_uk_food_recipes_triplechocolatebrown_7685", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/triplechocolatebrown_7685_16x9.jpg", "ingredients": ["275g/10oz plain chocolate (70% cocoa solids)", "275g/10oz unsalted butter", "85g/3oz pecans, broken into pieces ", "85g/3oz milk chocolate, cut into large chunks", "85g/3oz white chocolate, cut into large chunks", "175g/6oz plain flour ", "1 tsp baking powder", "4 large eggs, lightly beaten", "1 tsp vanilla essence", "325g/12oz caster sugar"], "serves": "Makes 20-24 squares", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas3. Line a 30x20x3.5cm/12x8x1½in tin with lightly buttered greaseproof paper or foil.", "Put the plain chocolate and butter in a large bowl, place over a pan of simmering water and allow to melt.", "Sieve the flour and baking powder into a bowl and set aside. Remove the melted chocolate from the heat and stir in the sugar. Add the eggs and vanilla essence. Fold in the flour, nuts and chocolate.", "Pour the chocolate mixture into the prepared cake tin. Place in the oven and bake for 20-25 minutes. The top should be firm but the inside should feel soft when cooked. Allow to cool in the tin. Remove the brownies from the tin and cut into squares."]}, {"isVegetarian": false, "title": "Tropical churros", "url": "www_bbc_co_uk_food_recipes_tropical_churros_98806", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tropical_churros_98806_16x9.jpg", "ingredients": ["½ very ripe mango, chopped", "1 tbsp lemon juice", "4 passion fruits, halved", "1 large free-range egg", "1 large free-range egg yolk", "75g/2½oz caster sugar", "60g/2¼oz unsalted butter, softened and cut into cubes", "50ml/2fl oz double cream", "130g/4½oz desiccated coconut", "60g/2¼oz caster sugar", "180ml/6fl oz full-fat milk", "½ tsp flaked sea salt", "25g/1oz unsalted butter", "1½ tsp vanilla bean paste ", "8 drops of coconut flavouring (optional)", "2 tbsp extra virgin coconut oil ", "180g/6oz plain flour", "sunflower oil, for frying"], "serves": "Makes 18-20 churros", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the dipping sauce, blend the mango and lemon juice to a purée using a food processor.", "Set a large, heatproof bowl over a pan of gently simmering water. Scrape the seeds and pulp out of the passion fruits and push through a sieve into the bowl. Discard the seeds. Add the mango purée, egg, egg yolk and sugar to the bowl. Stir frequently until the mixture is thick enough to coat the back of a spoon. Remove from the heat and stir in the butter one piece at a time. Set aside to cool.", "Once cool, lightly whip the double cream in a separate bowl. Gently fold it into the passion fruit and mango mixture.  Set aside", "For the churros, in a shallow dish, mix together 30g/1oz desiccated coconut and 50g/1¾oz caster sugar. Set aside.", "Put the remaining 100g/3½oz desiccated coconut in a spice grinder and blend to a fine powder. Transfer to a frying pan and lightly toast.", "In a large saucepan, combine 300ml/10fl oz water with the remaining sugar, the milk, salt, butter, vanilla paste, coconut flavouring, if using, and coconut oil. Bring to the boil.", "In a separate bowl, mix together the flour and toasted coconut. Add this to the boiling sugar mixture and mix well using a wooden spoon until the dough comes together in a ball and pulls away from the sides of the pan. Let the dough cool slightly, then transfer the mixture to a large piping bag fitted with a large star nozzle.", "Line two large baking trays with greaseproof paper. Pipe 18 churros in teardrop shapes, then cover and chill them for 10 minutes.", "Heat the sunflower oil in a deep-fat fryer or a large heavy-based pan until it reaches 190C on a cook’s thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully lower the chilled churros into the hot oil and fry for 2–3 minutes, or until golden-brown, turning once during frying. Don’t overcrowd the pan or the oil will get too cold and the churros won’t cook properly. (CAUTION: do not allow the oil to get too hot as this may cause the churros to explode. Protect yourself from splashes of hot oil and keep your face away from the pan.) ", "Remove the churros from the oil using a slotted spoon and drain on a plate lined with kitchen paper. Coat the churros in the coconut and sugar mixture. Serve immediately with the dipping sauce."]}, {"isVegetarian": true, "title": "Hummingbird cake", "url": "www_bbc_co_uk_food_recipes_tropical_fruit_cake_01471", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tropical_fruit_cake_01471_16x9.jpg", "ingredients": ["250g/8¾oz plain flour", "250g/8¾oz caster sugar", "1 tsp ground cinnamon", "1 tsp bicarbonate of soda", "3 free-range eggs, beaten", "200ml/7fl oz sunflower oil, plus extra for greasing", "50g/1¾oz pecan nuts, roughly chopped", "50g/1¾oz walnuts, roughly chopped", "2 bananas, mashed", "1 large mango, peeled, stoned removed, flesh mashed", "2 passion fruit, pulp only", "85g/3oz tinned pineapple, mashed", "1 orange, zest only", "200g/7oz full-fat soft cheese", "50g/1¾oz unsalted butter, softened", "1 orange, zest only", "400g/14oz icing sugar"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4. Grease and line three 20cm/8in cake tins.  ", "Sift the flour, caster sugar, ground cinnamon and bicarbonate of soda together in a bowl.", "Stir in the eggs, sunflower oil, nuts, fruit and orange zest until well combined.", "Divide the cake batter among the three cake tins and bake in the oven for 30-35 minutes, or until risen and golden-brown.", "Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tins to loosen the cakes. Remove the cakes from their tins and transfer to a wire rack to cool completely.  ", "Meanwhile, for the cream cheese icing, blend the cheese and butter together with an electric whisk until thick and creamy. Add the orange zest and sift in the icing sugar. Stir gently until well combined, then chill in the fridge until needed. ", "Once the cakes are cool, spread cream cheese icing on top of each cake. Stack the cakes to make one three-tiered cake."]}, {"isVegetarian": true, "title": "Tropical Manchester tart", "url": "www_bbc_co_uk_food_recipes_tropical_manchester_tart_55667", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["220g/8oz plain flour, plus extra for dusting", "30g/1oz icing sugar", "90g/3¼oz cold unsalted butter, cut into 5mm cubes", "2 medium free-range egg yolks", "1 medium free-range egg, beaten, for egg wash", "6 medium free-range eggs ", "2 oranges, zest of three and juice of two", "2 limes, zest only ", "250g/9oz caster sugar", "1 large ripe mango, peeled, stone removed", "3 passionfruits", "1½ tbsp spiced rum", "200ml/7fl oz double cream", "4 tbsp desiccated coconut ", "100g/3½oz physalis (Cape gooseberries), leaves removed"], "serves": "Makes 1 x 23cm/9in tart", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Grease and line a 23cm/9in tart tin. ", "For the pastry, put the flour and icing sugar in the bowl of a food processor and pulse briefly to mix. Add the butter and pulse until the mixture resembles fine breadcrumbs. ", "Tip the mixture out into a large mixing bowl and add the egg yolks and two tablespoons of cold water. Mix with your hands until the mixture comes together.", "On a lightly floured work surface, briefly knead the dough to bring the pastry together. Flatten to a thick circle, wrap in cling film and chill in the fridge for 20 minutes.", "On a generously floured work surface roll out the pastry to a circle about 3mm thick and big enough to line the tart tin with some excess. ", "Line the tart tin with the pastry, using a rolling pin to help you lift the pastry. Gently push the pastry into the edges and leave any excess overhanging the tin. Place the tart tin on a baking tray.", "Prick the base of the pastry all over with a fork. Rest the pastry case in the fridge for 10 minutes. ", "When the pastry is chilled, line it with four sheets of cling film or a scrunched up piece of baking parchment. Completely fill with baking beans (or dry pulses) and blind bake for 20 minutes on the middle shelf of the oven. ", "Remove from oven and lift out the baking beans using the cling film or baking parchment. Brush the pastry case with egg wash.", "Return to the oven for eight minutes, or until the pastry looks dry and golden-brown. ", "Lower the oven temperature to 140C/275F/Gas 1.", "For the filling, in a large heatproof bowl add the eggs, orange zest, lime zest and 150g/5½oz of the caster sugar. Stir gently until the sugar is dissolved - try to avoid getting too much air into the mixture. ", "In a food processor, blend half of the mango to a purée. Pass through a sieve to remove any fibres and measure out 50g/1¾oz of purée (any leftover purée can be stored in the fridge for 2-3 days and used in smoothies, sorbets or as a sauce for desserts).", "Cut the passionfruits in half and pass the pulp through a sieve into a measuring jug. Add orange juice to make 100ml/3½fl oz of passionfruit and juice combined. Pour into the egg mixture along with the rum, mango purée and double cream. Stir gently until well mixed. Set aside. ", "For the pastry, trim the excess pastry from the sides using a sharp knife.", "Meanwhile, place the bowl of filling over a pan of gently simmering water (do not let the water touch the bowl). Stir continuously until the mixture reaches 55C/130F on a cook’s thermometer.", "Pour the filling in the warmed tart case and bake for 25 minutes, until just set but with a wobble in the centre. (When cooked, the filling should be 70C/160F in the centre.) ", "Remove from the oven and set aside to cool for 10 minutes. Remove the tin and place the tart on a cooling rack. When it is completely cool, put the tart on a serving plate. ", "For the decoration, scatter the desiccated coconut in a pattern in the middle of the tart. Neatly slice the remaining mango and arrange the slices around the edge of the tart. Finish with the physalis placed evenly around the tart."]}, {"isVegetarian": false, "title": "Stuffed trout and purple sprouting broccoli", "url": "www_bbc_co_uk_food_recipes_troteripieneelegates_86355", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz hazelnuts", "50g/2oz almonds", "50g/2oz pine nuts", "8 canned anchovy fillets in oil, drained", "1 garlic clove, finely chopped", "2 tbsp capers in brine, drained", "2 free-range eggs, beaten", "50g/2oz grissini (Italian breadsticks), crushed", "handful fresh mint, finely chopped", "75g/3oz parmesan cheese, finely grated ", "1 lemon, zest only", "salt and freshly ground black pepper", "4 whole trout, each about 450g/16oz, scaled, gutted, gills removed", "110g/4oz butter", "salt and freshly ground black pepper", "300g/10½oz purple sprouting broccoli", "1 tbsp olive oil", "12 cloves garlic (or to taste), finely sliced", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the hazelnuts, almonds, pine nuts, anchovies, garlic and capers into a food processor and blend.", "Transfer the nut mixture to a bowl. Add the eggs, crushed grissini, mint, parmesan, lemon zest, salt and freshly ground black pepper and stir well to create a paste. If it appears a little wet, add some more crushed grissini.", "Place the trout on a chopping board and stuff the cavities with the paste.", "Tie each trout in three places with raffia or kitchen string to wrap the fish closed around the stuffing.", "Heat the butter in a large frying pan big enough to fit all four trout; alternatively divide the butter between two frying pans.", "When the butter has melted, add the fish and fry for 3-5 minutes on each side, or until just cooked through.", "Bring a pan of water to the boil over a high heat. Add a pinch of salt and the purple sprouting broccoli and cook for 2-3 minutes. Drain and set aside.", "Heat a frying pan until hot and add the olive oil and garlic, stir fry for 30 seconds before adding the drained broccoli. Stir-fry for one minute, then add the lemon juice and season, to taste, with salt and freshly ground black pepper.", "To serve, place each trout onto a serving plate and place equal amounts of the broccoli alongside."]}, {"isVegetarian": false, "title": "Trout ballottine with crayfish and girolles", "url": "www_bbc_co_uk_food_recipes_trout_ballottine_with_91468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 gelatine leaves ", "bunch chervil, finely chopped ", "bunch dill, finely chopped", "bunch chives, finely chopped", "bunch tarragon, finely chopped", "small handful flatleaf parsley, finely chopped", "1 large trout, filleted, pin-boned, skin removed", "12 crayfish, shell on blanched", "1 Savoy cabbage, dark green leaves only, finely shredded", "handful small girolles, cleaned", "125ml/4fl oz white wine ", "splash white wine vinegar", "1 small banana shallot, finely chopped ", "150g/5½oz unsalted butter, plus extra for frying", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the gelatine in cold water until soft.", "Lay two sheets of cling film on a clean surface and sprinkle the centre with half of the chopped herbs.", "Press one trout fillet over the herbs. Place the gelatine leaves on top of the fish evenly. Place the second fillet on top, in the reverse direction (head to tail). Cover with the remaining herbs, press down firmly and roll the ballottine, starting from the tail, using the cling film to wrap it tightly. Twist the ends to make a sausage shape. Cover tightly with foil and refrigerate overnight.", "Bring a large saucepan of water to the boil and weigh the ballottine. Add the ballottine to the water, still in its foil, for 3 minutes per 450g/1lb. Turn the heat off and leave in the water for 1 hour. Remove from the water and allow too cool. Put in the fridge overnight.", "To make the beure blanc, place the wine, vinegar and chopped shallot into a small saucepan over a medium heat and reduce the liquid down by three quarters. Slowly add the butter, seasoning and lemon juice. Set aside.", "Blanch the crayfish for 3–5 minutes or until they are cooked through and have turned bright red.", "Meanwhile, blanch the shredded dark green cabbage for 1 minute and refresh under cold running water.", "In a frying pan over a medium heat, sauté the crayfish with the girolles in a knob of butter. Add the shredded cabbage for 1–2 minutes.", "Place the cabbage, crayfish and girolles between four plates. Slice the ballottine into four and place on top. Spoon around some of the butter sauce and serve. "]}, {"isVegetarian": false, "title": "Trout picnic pie", "url": "www_bbc_co_uk_food_recipes_trout_picnic_pie_26682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 red Romano peppers, chopped", "4 sweet potatoes, cut into chunks", "5 tbsp olive oil", "1 lemon, zest only", "100g/3½oz basmati rice", "½ tbsp ground turmeric", "3 bay leaves", "1 tsp vegetable bouillon powder", "few knobs of butter", "300g/10½oz asparagus tips", "4 shallots, chopped\t", "2 garlic cloves, finely chopped", "50g/1¾oz pine nuts, toasted", "400g/14oz cooked beetroot, grated", "1 tbsp brown sugar", "3 tbsp balsamic vinegar", "salt and black pepper", "handful fresh dill, chopped ", "handful fresh parsley, chopped ", "handful fresh mint, chopped ", "½ lemon juice, juice only", "1 tbsp white wine vinegar", "salt and black pepper", "500g/1lb 2oz rainbow trout fillets, boned, skinned", "120g/4¼oz smoked trout", "For the herb butter", "50g/1¾oz butter, softened", "1 garlic clove, crushed", "½ lemon, zest only", "handful dill and parsley, chopped", "80ml/2½fl oz ice-cold water", "1 tbsp lemon juice", "500g/1lb 2oz plain flour, plus extra for dusting", "1 tsp salt", "250g/9oz unsalted butter, cubed", "1 free-range egg, plus 1 yolk", "1 free-range egg, beaten with pinch of salt, to glaze", "120ml/4fl oz sunflower oil", "1½ tbsp rapeseed oil", "1 free-range egg, yolk only", "pinch saffron strands, soaked in 1 tbsp lemon juice for 15 minutes", "pinch salt", "½ tbsp English mustard", "½ tbsp lemon juice", "200g/7oz mixed salad", "70g/2½oz lamb's lettuce and wild rocket", "300g/10½oz cherry tomatoes"], "serves": "Serves 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the filling, preheat the oven to 220C/425F/Gas 7. Place the chopped peppers and sweet potatoes in roasting trays, coat them lightly in a little of the olive oil and roast for 20-30 minutes.", "Place the lemon zest and rice in a saucepan with a little olive oil to coat. Add the turmeric and bay leaves. Mix the vegetable bouillon with hot water (double the volume of water to rice). Cover the rice with bouillon and simmer for 10-15 minutes, or until the rice is cooked. Drain thoroughly, add a knob of butter and set aside. ", "For the pastry, mix the cold water with the lemon juice. Put the flour and salt in a bowl and, using your fingertips, rub the butter into the flour until the mixture resembles fine breadcrumbs. Make a well in the centre of the mixture and add the whole egg and egg yolk. Bring the pastry together with your hands, gradually adding the water and lemon juice liquid until you have a smooth dough.", "Transfer the pastry to a lightly floured work surface and gently knead it into a ball. Flatten to create a disc shape, wrap in cling film and place in the fridge to rest for at least 10 minutes.", "Meanwhile for the filling, cook the asparagus in a pan of salted boiling water until just tender, then transfer to a bowl of cold water to cool.", "Gently fry the shallots in a pan with a knob of butter and a little olive oil. When the shallots are translucent, add the garlic and cook for a few minutes to soften. Add the shallots to the cooked rice and stir through the toasted pine nuts.", "Fry the beetroot in the same pan you cooked the shallots in. Cook gently for a few minutes until just tender. Add the brown sugar and balsamic vinegar and season with salt and pepper. Transfer to a dish to cool.", "Add the chopped dill, parsley and mint to a bowl with the lemon juice, a tablespoon of olive oil and the white wine vinegar. Season to taste with salt and pepper, then toss through the cooled asparagus.", "In a bowl, mix together the butter, garlic, lemon zest and chopped herbs. Cover the rainbow trout fillets with the herb butter. ", "Preheat the oven to 180C/350F/Gas 4 and line a large loaf tin with aluminium foil and then baking parchment (to make removing the pie easier once cooked).", "Remove the chilled pastry from the fridge. Divide into two and roll out one half on a lightly floured work surface until it is large enough to line the loaf tin. Line the tin with the pastry, leaving a slight overhang around the edge.", "Start to layer the pie filling, seasoning every layer as you go with salt and pepper.  Start with a layer of rice, then peppers, a rainbow trout fillet, some smoked trout, asparagus, beetroot and sweet potato. Repeat until the pastry case is full and all the ingredients have been used.", "Roll out the remaining pastry to form a pie lid. Brush the edges of the pastry case with a little beaten egg, lift the lid into place and press down to seal.", "Use any pastry trimmings to decorate the top of the pie. Weave strips of pastry in a lattice to represent a picnic hamper. Top with a pastry bow, a picnic hamper fastening and some flowers. Neatly crimp the edges of the pie and cut out a small square in the centre of the pie to allow steam to escape. Brush the surface of the pie with egg wash and then bake for approximately 50 minutes, or until dark golden-brown (check after 30 minutes - if the pastry is browning too quickly cover the edges with foil to stop it burning).", "While the pie is baking make the saffron mayonnaise. Stir together the sunflower and rapeseed oil in a measuring jug. In a bowl beat the egg yolk, soaked saffron, salt, mustard and lemon juice. Slowly add the oil in a thin stream, whisking all the time until you have a thick mayonnaise. Transfer to a small pot and chill until ready to serve.", "To serve, toss the salad leaves and cherry tomatoes together in a bowl. Serve the pie hot with the salad and mayonnaise alongside."]}, {"isVegetarian": false, "title": "Trout with mussel and chorizo salsa", "url": "www_bbc_co_uk_food_recipes_trout_with_mussel_and_72428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz mussels, scrubbed and debearded", "100ml/3½fl oz dry white wine", "4 thyme sprigs", "2 tbsp olive oil", "200g/7oz cooking chorizo, chopped", "1 onion, chopped", "2 garlic cloves, chopped", "1 x 400g tin chopped tomatoes", "2 tbsp chopped fresh flatleaf parsley", "2 trout fillets, pin-boned and skin on", "salt and freshly ground black pepper", "crusty bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Discard any mussels with broken shells and any that refuse to close when tapped. Place the mussels, wine and 2 thyme sprigs in a large saucepan. Cover with a lid and cook for 3–4 minutes. Discard any mussels that remain closed and set aside the rest. ", "Heat a tablespoon of the oil in a frying pan and add the chorizo. Cook for 2–3 minutes, or until crisp. Remove from the pan and set aside.", "Add the onion, garlic and the remaining thyme to the pan and cook for 4–5 minutes, or until soft. Return the chorizo to the pan and pour in the tomatoes. Cook until the volume of liquid has reduced by half. Stir in the mussels and parsley and season with salt and pepper.", "Heat the remaining oil in a frying pan. Once hot, add the trout and fry on each side for 2 minutes, or until cooked through. ", "Divide the sauce between two warmed plates and top with a trout fillet. Serve immediately with the crusty bread. "]}, {"isVegetarian": false, "title": "Trout beurre noisette", "url": "www_bbc_co_uk_food_recipes_troutbuerrenoisette_78167", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1 trout fillet", "1 tsp sesame seeds", "juice of half a lemon"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the butter in a frying pan. Add the trout, skin-side down, and cook for one to two minutes. ", "Carefully turn the fillet over and finish cooking on the other side for a further two minutes. Remove the trout from the pan and set aside on a warm plate.", "Add the remaining butter. When it begins to foam add in the sesame seeds.", "When the seeds start to take on colour, squeeze in the lemon juice.", "Serve the trout with the beurre noisette sauce poured over the top."]}, {"isVegetarian": false, "title": "Trout with scallop mousseline, beurre noisette and almonds", "url": "www_bbc_co_uk_food_recipes_trout_with_scallop_29710", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 rainbow trout, cleaned, gutted and butterflied (ask your fishmonger to do this)", "salt and freshly ground black pepper ", "4 scallops, cleaned", "150ml/5fl oz double cream", "½ lemon, juiced", "50g/2oz butter", "110g/4oz unsalted butter", "½ lemon, juice only", "4 tbsp toasted flaked almonds", "2 tbsp flat leaf parsley, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the trout, season the inside of the trout with salt and freshly ground black pepper.", "Place the scallops into a food processor and blend to a purée. Add the double cream and lemon juice and pulse until thickened.", "Season the scallop mixture with salt and black pepper then spoon or pipe into the cavity of the trout. Press the trout down gently to close.", "Heat the butter in a frying pan over a medium to high heat. When the butter is foaming, add the trout and fry for 1-2 minutes on each side.", "Transfer the trout to a baking tray and bake for another 4-5 minutes to finish cooking through. ", "Remove and set aside to rest for one minute then peel off the skin, leaving the head on.", "For the beurre noisette, heat a frying pan until hot, add the butter and heat until it turns a nut-brown colour.", "Add the lemon juice, toasted almonds, parsley and a pinch of salt and freshly ground black pepper and then remove from the heat.", "To serve, place each trout onto a plate and spoon over the beurre noisette. "]}, {"isVegetarian": false, "title": "Trout croquettes", "url": "www_bbc_co_uk_food_recipes_troutcroquettes_91864", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutcroquettes_91864_16x9.jpg", "ingredients": ["1 x 450g/1lb fresh brown or rainbow trout, guts and gills removed", "25g/1oz butter", "½ small onion, peeled, finely chopped", "40g/1½oz plain flour, plus three tablespoons for dredging", "250ml/9fl oz full-fat milk", "1 tsp tomato purée", "2 tsp finely chopped fresh tarragon leaves", "1 tsp Dijon mustard", "3 tbsp double cream", "salt and freshly ground black pepper", "2 large free-range eggs, beaten", "100g/3½oz fine white breadcrumbs (made from toasted stale bread blended in a food processor)", "8 tbsp ground almonds", "sunflower oil, for deep frying", "1 lemon, cut into wedges"], "serves": "Makes 15", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Line a baking tray with aluminium foil and grease lightly with oil. Place the trout onto the prepared tray and cover with a second sheet of aluminium foil. Bake in the oven for 12-15 minutes, or until the fish is cooked through. (NB: The fish is cooked through when the flesh nearest the bone at the thickest part is opaque.)", "When the trout is cooked through, set aside to cool. When it is cool enough to handle, remove the skin and discard. Flake the fish into a sieve suspended over a bowl, discarding any bones. ", "Meanwhile, melt the butter in a large pan over a medium heat. When the butter is foaming, add the onion and fry for 2-3 minutes, or until starting to colour. ", "Stir in the flour and continue to heat for 30 seconds, stirring continuously. ", "Add the milk and continue to cook, stirring continuously, for 4-5 minutes, or until the mixture has thickened. ", "Remove the pan from the heat and beat in the tomato purèe, tarragon, Dijon mustard and cream until well combined. Season, to taste, with salt and freshly ground black pepper. Cover the pan with cling film and set aside to cool slightly. ", "When the mixture is tepid, stir in the trout flakes until well combined. Cover again and set aside until completely cooled, then chill in the fridge for a minimum of five hours, or until solid.", "When the trout mixture has cooled, make quenelles or balls of the mixture using two large spoons to form croquettes. ", "Pour the beaten eggs into a shallow bowl. Sprinkle half of the breadcrumbs and half of the ground almonds into another shallow bowl. Sprinkle the three tablespoons of flour into a third bowl.", "Dredge each croquette lightly in the flour, then dip it into the beaten egg, then roll in the breadcrumb mixture until completely coated. Place the prepared croquette onto a baking tray. Repeat the process until you have prepared eight croquettes.", "When eight of the croquettes have been prepared, discard the breadcrumb mixture and replace it with the remaining breadcrumbs and almonds. Repeat the process with the remaining croquette mixture until you have 12-16 croquettes. ", "Chill the croquettes in the fridge for at least 30 minutes.", "Half-fill a large pan with sunflower oil and heat to 180C (use a cooking thermometer to check the temperature). ", "When the oil is hot, carefully lower the croquettes, in batches, into the pan using a slotted spoon. Fry for 2-3 minutes, turning once during cooking, or until the breadcrumbs are crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt and keep warm. ", "Repeat the process with the remaining batches of croquettes. ", "To serve, pile the croquettes into the centre of a serving plate and squeeze over the juice from the lemon wedges."]}, {"isVegetarian": false, "title": "Trout en papillote", "url": "www_bbc_co_uk_food_recipes_troutenpapilotte_78165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red pepper, sliced", "½ red onion, sliced", "1 trout fillet", "1 lemon, sliced", "½ chilli, chopped", "1 tbsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. ", "Heat the oil in a wok and when hot add the red onion and red pepper. Stir fry for one to two minutes or until softened. ", "Spread out a large piece of baking parchment and place the stir fried vegetables onto the middle.", "Top with the trout fillet and place the lemon slices and chopped chilli on top. Pour over the soy sauce.", "Fold the parchment around the trout fillet and seal tightly. ", "Lay on a baking sheet and cook in a hot oven (220C) for ten minutes."]}, {"isVegetarian": false, "title": "Trout en papillote with white wine, dill and lemon", "url": "www_bbc_co_uk_food_recipes_troutenpapillotewith_88055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fillet rainbow trout, skin on", "50g/1¾oz fresh spinach leaves, washed", "½ lemon, sliced", "small bunch fresh dill", "2 tbsp white wine", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Using a sharp knife, score the skin of the trout diagonally at 2cm/½in intervals.", "Cut a sheet of foil about 30cm/12in square and lay a square of baking parchment of the same size on top. Place the pile of spinach in the centre of the baking parchment, followed by the trout fillet, the lemon slices, dill and white wine. Season with salt and freshly ground black pepper. ", "Bring the sides of the foil together over the fish and secure. Scrunch the two open ends together to make a 'tent' for the fish. Place on a baking tray and cook for 8-10 minutes, or until cooked through.", "To serve, place the foil parcel onto a serving plate and open it up."]}, {"isVegetarian": false, "title": "Trout fillet with pine nut crust, herb rice and spicy tomato sauce", "url": "www_bbc_co_uk_food_recipes_troutfilletwithpinen_88058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz pine nuts", "1 fillet rainbow trout, halved", "1 tbsp olive oil", "15g/½oz butter", "½ lemon, juice only", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped ", "200g/7oz long grain rice", "200ml/7fl oz hot vegetable stock", "salt and freshly ground black pepper ", "2 tbsp chopped fresh dill, plus a sprig for garnish", "2 tbsp chopped fresh flatleaf parsley", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped ", "1 fresh green chilli, chopped", "3 fresh tomatoes, chopped", "salt and freshly ground black pepper ", "2 tbsp white wine", "1 handful fresh basil, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the trout with pine nut crust, place the pine nuts in a food processor or mini blender and pulse until roughly chopped. Spread out on a tray and roll the trout fillet pieces in the nuts to coat.", "Heat the oil and butter in a small frying pan and fry the trout for about four minutes on each side, or until golden-brown and crisp. Add the lemon juice at the end, allowing it to slightly reduce in the pan.", "For the herb rice, heat the oil in an ovenproof pan and gently fry the onion and garlic until soft. Add the rice and fry for 1-2 minutes. Add the hot vegetable stock, season, to taste, with salt and freshly ground black pepper and stir. Cook on the hob for about 7-8 minutes, then put a lid on the pan and place in the oven for a further 8-10 minutes, stirring once during cooking and adding more hot water if more liquid is required.", "Remove from the oven and stir in the chopped dill and parsley.", "For the spicy tomato sauce, heat the oil in a saucepan and gently fry the onion and garlic until soft. Add the chilli and fry for a further 1-2 minutes. Add the chopped tomatoes, season, to taste, with salt and freshly ground black pepper and turn up the heat until the tomatoes are cooking down and the sauce is bubbling. Add the white wine and cook for a further two minutes. Reduce the heat and put a lid on the pan. Cook for a further five minutes, or until the tomatoes are cooked down. Finally stir in the torn basil leaves.", "Using a hand blender, process the sauce until smooth, adding more salt and freshly ground black pepper if required.", "To serve, place a spoonful of the rice onto a serving plate, arrange the trout halves on top and spoon over the sauce. Garnish with a sprig of dill."]}, {"isVegetarian": false, "title": "Trout with samphire and beurre blanc", "url": "www_bbc_co_uk_food_recipes_troutwithsamphireand_91865", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutwithsamphireand_91865_16x9.jpg", "ingredients": ["140g/5oz chilled unsalted butter, cut into small cubes ", "2 medium shallots, peeled, thinly sliced", "½ garlic clove, peeled, thinly sliced", "1 sprig fresh thyme", "1 small bay leaf", "3 black peppercorns, crushed", "150ml/5fl oz dry white wine", "1 tsp white wine vinegar", "sea salt flakes ", "1-2 tbsp freshly squeezed lemon juice", "2-3 tbsp plain flour", "salt and freshly ground black pepper", "2-3 tbsp sunflower oil", "2 x 200g/7oz thick-cut brown or rainbow trout fillets", "2 handfuls marsh samphire, rinsed thoroughly, tough stems removed, broken up into small pieces", "1 tbsp butter", "1-2 tbsp freshly squeezed lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beurre blanc, heat one tablespoon of the butter in a non-reactive pan over a medium heat. When the butter has melted, add the shallots, garlic, thyme, bay leaf and peppercorns and fry for 2-3 minutes, or until the shallots have softened but not coloured. ", "Add the white wine and wine vinegar and bring the mixture to the boil. Continue to boil until most of the liquid has evaporated, then gradually whisk in the chilled butter cubes, one at a time, until all of the butter has been incorporated into the mixture and the sauce has thickened and is glossy. ", "Strain the beurre blanc through a fine sieve into a warmed bowl, then season, to taste, with salt and pour over the lemon juice. Keep warm. (NB: Do not leave the beurre blanc in too warm a place or the sauce may split.) ", "For the trout, heat a large frying pan over a high heat. Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Pat the fish fillets fry with kitchen paper. ", "Dredge the trout fillets, skin-sides down, in the seasoned flour, then shake off any excess flour. Dip the floured sides of the trout fillets in the sunflower oil. ", "When the pan is hot, add the trout fillets, floured-sides down, and fry for 3-4 minutes, or until more than half of the trout flesh has turned opaque and the skin is crisp and golden-brown. (NB: The skin needs to be flat against the pan to crisp up all over, so press the trout fillets down with a fish slice if the heat makes them arch up.) ", "Turn the trout fillets over carefully and continue to fry for a further minute, or until the trout fillets are almost cooked through but are still slightly rare in the centre.", "Meanwhile, for the samphire, add the samphire to a pan of boiling water (do not add salt) and cook for 2-3 minutes, or until tender. Drain well, then return the samphire to the pan, add the butter and lemon juice and season, to taste, with freshly ground black pepper. ", "To serve, divide the samphire between two warmed plates. Place the trout on top and spoon over the beurre blanc."]}, {"isVegetarian": false, "title": "Trout Orleans", "url": "www_bbc_co_uk_food_recipes_troutorleans_11571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 eggs", "5 tbsp clarified butter", "plain flour, to coat", "2 sea trout fillets, skin on", "55g/2oz fresh breadcrumbs ", "2 bananas", "2 lemons, 1 juiced, 1 thinly sliced", "55g/2oz butter", "2 egg yolks", "2 tomatoes, thinly sliced", "salt and white pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to warm. In a shallow dish, whisk the eggs with 2 tbsp of the clarified butter.", "Put a good handful of flour on a plate and season lightly with white pepper and salt.", "Take the sea trout fillets and coat them with the seasoned flour, then dip them in the egg mixture and finally toss them in breadcrumbs until they are completely covered.", "Heat a frying pan until very hot then add 2 tbsp of the clarified butter. Place the breaded fillets in the pan, skin side up for 2 minutes. Turn the fillets over and cook for a further 3 minutes, or until golden brown. Leave the pan on the heat, transfer fillets to a heat-resistant plate, skin side down and place under the grill for 5 minutes.", "Halve the bananas, lengthways. Add the remaining clarified butter to the hot pan and place the banana halves in the pan for 5 minutes, turning occassionally to stop them burning.", "In a heatproof bowl sitting over a pan of hot water, whisk the lemon juice, butter and egg yolks to a creamy sauce. Season with salt and pepper to taste.", "Take the fillets from under the grill and place tomato and lemon slices over the flesh side, alternately and overlapping so they cover most of the fish. Turn the grill up to full and cook the fillets for a further minute.", "Serve the trout and bananas together on a plate, covered with sauce."]}, {"isVegetarian": false, "title": "Truffle-baked bream", "url": "www_bbc_co_uk_food_recipes_truffle-baked_bream_39834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sea bream fillets, around 150g-200g/5½oz-7oz per fillet, skin on", "1 unwaxed lemon, very thinly sliced", "2 sprigs fresh rosemary", "5 tbsp olive oil", "1 x 400g tin chopped tomatoes", "2 tbsp torn basil", "1 garlic clove, finely chopped", "150ml/5fl oz lobster bisque (from a tin is fine) ", "25g/1oz black truffle butter (or unsalted butter plus a splash of truffle oil)", "handful dried porcini", "handful chopped fresh chervil or tarragon, or other fresh herbs ", "flaked sea salt and freshly ground black pepper", "300g/10½oz strong white flour", "pinch salt", "knob of butter, melted, for brushing", "sprig fresh rosemary, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/Fan 200C/Gas 7. ", "Season the flesh side of each bream fillet, then sandwich them together so the skin is on the outside. Put three lemon slices followed by a sprig of rosemary on top. Tie the fish up with two or three pieces of string, then set aside. ", "For the bread crust, put the flour in a large bowl and season with salt. Slowly mix in enough water to make a soft, malleable dough. ", "Heat 4 tablespoons of olive oil in a saucepan. Once hot add the chopped tomatoes, basil, season with salt and pepper and cook for 10-15 minutes to make a tomato sauce.", "Heat a little more oil in a casserole dish. Add the garlic and cook for a few seconds. Add the tomato sauce and cook for 1–2 minutes. Pour in the lobster bisque and bring to the boil. Whisk in the truffle butter. Add the porcini.", "Bring the sauce back to a simmer, then remove from the heat. Season to taste, stir in the herbs and add the fish – it should not be completely submerged. ", "Roll out the bread dough and cover the casserole dish until it is sealed. You need plenty of dough overlapping the sides of the casserole. Tuck it through the handles of the casserole to secure it well, then make a small hole in the top to allow the steam to escape ", "Return the casserole to the heat until you see a plume of steam coming through the hole in the dough. Transfer to the oven and bake for 10 minutes.", "Brush the crust generously with the melted butter, then bake for a further 2 minutes. Sprinkle the crust with sea salt and the chopped rosemary. Bake for 2 minutes more, then serve. "]}, {"isVegetarian": false, "title": "Truffle-stuffed roast chicken with vegetables and cream sauce", "url": "www_bbc_co_uk_food_recipes_truffle-stuffed_roast_27864", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole chicken, legs and wings removed but kept", "200g/7oz salted butter, softened", "1 truffle, sliced", "salt and freshly ground black pepper", "4 carrots, peeled and cut into batons", "2 tbsp rapeseed oil", "1 onion, roughly chopped", "2 small carrots, peeled and chopped", "1 small leek, chopped", "2 bay leaves", "2 sprigs fresh thyme", "50g/1¾oz unsalted butter", "2 shallots, chopped", "2 garlic cloves, chopped", "150ml/5fl oz white wine", "300ml/10fl oz double cream", "¼ bunch fresh chervil, finely chopped", "75g/2½oz unsalted butter", "1 head kale, finely chopped, tough stalks removed", "300g/10½oz frozen peas, blanched"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8.", "Put the legs and wings in a deep roasting tray and roast in the oven for 15-20 minutes, then set aside.", "Reduce the oven temperature to 180C/160C Fan/Gas 4.", "Place the butter in a large bowl, add half the truffle, a little salt and pepper and mix.", "Lift the skin away from the chicken crown (leaving the skin intact) and push the butter underneath the skin.", "Place in a deep roasting tray and roast for 1-1½ hours, or until cooked through. When you think there is 30 minutes left add the carrot batons.", "For the sauce, heat a large saucepan and add the oil. Once hot add the onions, carrots, leeks, bay leaves and thyme and cook for 3-4 minutes.", "Add the legs and wings and cook for 2-3 minutes. Add 2 litres/3½ pints of water and cook for at least 1 hour. ", "Strain and keep the liquid, but discard the vegetables. You will need 500ml/18fl oz of this chicken stock.", "Heat a sauté pan and melt the butter. Add the shallots and cook for 1-2 minutes. Add the garlic and cook for 1-2 minutes.", "Add the white wine and cook until reduced in volume by half then add the chicken stock and reduce by half again. Finish with the cream and chervil.", "For the kale and peas, heat a large sauté pan and melt the butter. Add the kale and peas and cook for 2-3 minutes, or until the kale has wilted.", "Put the roasted carrots, kale and peas in the centre of the plate. Remove the chicken breast, cut into slices and fan over the vegetables. Spoon over the creamy sauce, garnish with remaining truffle and serve."]}, {"isVegetarian": true, "title": "Truffle gnudi with broad beans, grilled Gem lettuce and pea purée", "url": "www_bbc_co_uk_food_recipes_truffle_gnudi_with_bread_54708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz Parmesan (or alternative vegetarian hard cheese), grated", "450g/1lb ricotta cheese, drained ", "12.5g jar black truffle, finely chopped", "white truffle oil, for drizzling", "500g/1lb 2oz semolina flour ", "375g frozen peas", "handful fresh peas", "handful podded broad beans, outer skins removed", "25g/1oz butter", "2 fresh thyme sprigs", "2 Little Gem lettuce hearts, halved", "olive oil, for drizzling", "salt and freshly ground black pepper", "pea shoots, snipped, to garnish", "bunch chives, snipped, to garnish"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Line a baking tray with baking paper. ", "To make the gnudi, mix 25g/1oz of the Parmesan with the ricotta. Add the truffle and a drizzle of truffle oil and season. Spoon into a piping bag. ", "Dust a work surface with the semolina flour and pipe out a long sausage shape. Chop it into 2.5cm/1in pieces and transfer them to the baking tray. Cover and refrigerate overnight, until a skin has formed.", "When almost ready to serve, tip the frozen peas into a blender and blitz with some salt until smooth. Pass them through a sieve.", "Blanch the fresh peas and beans in boiling water for 2 minutes, then drain. ", "Melt the butter in a wide saucepan and sauté the fresh peas, broad beans and thyme.", "Preheat the grill to high. Lightly drizzle the lettuce hearts with olive oil and season with salt and pepper. Grill, cut side-up, until charred. Set aside.", "Blanch the gnudi in salted boiling water for a few minutes, then drain. Toss with the peas and broad beans and tip onto a serving dish. Add the lettuce and pea purée, garnish with the pea shoots, chives and remaining Parmesan and serve. "]}, {"isVegetarian": true, "title": "Tsoureki bread (Greek Easter bread)", "url": "www_bbc_co_uk_food_recipes_tsoureki_bread_greek_90667", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "7g fast-action yeast", "10g salt", "60g/2½oz butter, softened", "75g/3oz caster sugar", "pinch gum mastic powder", "pinch mahlab (also called mechlebe or mahlepi, available from specialist delicatessens or online)", "pinch ground cinnamon", "1 orange, zest only", "150ml/5fl oz warm water", "150ml/5fl oz milk", "handful sultanas", "3 free-range eggs, hardboiled in their shells with red food colouring", "1 free-range egg, beaten for egg wash"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, yeast, salt, butter and sugar into a large bowl. Add the mastic powder, mahlab  and cinnamon, then the orange zest. Pour in half the water and milk and mix together briefly, then keep adding the liquid and mixing until you have a soft glutinous dough.", "Mix the sultanas through the dough, then tip out onto a lightly floured surface and knead until you have a pliable dough. Shape into a ball and rest for at least an hour, or overnight in the fridge, until doubled in size. ", "Line a baking tray with baking parchment. Divide the dough into three and roll into three strands. Plait the strips together, place on the baking tray and leave to rise for another hour, or until doubled in size.", "Preheat the oven to 210C/400F/Gas 6. Brush the top of the bread with egg wash and push the coloured eggs into the bread. Bake for 20-25 minutes, then transfer to a wire rack to cool."]}, {"isVegetarian": true, "title": "Tuiles with chocolate mousse", "url": "www_bbc_co_uk_food_recipes_tuiles_with_chocolate_64665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuiles_with_chocolate_64665_16x9.jpg", "ingredients": ["200g/7oz dark chocolate ", "300ml/10½fl oz double cream", "1 large free-range egg, white only", "50g/1¾oz caster sugar", "200g/7oz butter, softened", "175g/6oz icing sugar", "1 tsp vanilla extract ", "6 large free-range eggs, whites only, lightly beaten", "200g/7oz plain flour", "3 tsp cocoa powder", "50g/1¾oz plain chocolate, melted"], "serves": "Makes 18 curved tuiles, cigars or baskets", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the chocolate mousse, break the chocolate into small pieces and set aside. In a small saucepan, heat half of the cream until just simmering.  Remove from the heat, add the chocolate pieces and stir until the chocolate has melted and the mixture is smooth.", "Pour the mixture into a bowl and leave to cool for 15 minutes.  Add the remaining cream and using a hand-held electric whisk, beat the mixture until soft peaks form when the whisk is removed. ", "In a clean bowl, whisk the egg white until stiff peaks form when the whisk is removed. Add the sugar, a tablespoon at a time, and continue whisking to make a soft meringue mixture. Carefully fold the meringue through the chocolate mixture. Put the mousse in the fridge and leave until set. ", "To make the tuiles mixture, use a hand-held electric mixer to mix the butter, sugar and vanilla extract into a paste.  Gradually add the egg whites, whisking all the time.  Fold in the flour a little at a time beating with a wooden spoon between each addition. ", "Transfer one-sixth of the mixture into a small bowl and add the cocoa. Beat until well mixed. You now have two bowls of tuile paste, one plain and one chocolate. Cover both bowls with cling film and leave to rest for 30 minutes.", "To bake the tuiles, preheat the oven to 180C/350F/Gas 4. Line a baking tray with parchment or a silicone sheet and place the tuile template in position.", "Spread some of the plain tuile paste over the cut out shapes of the template using a palette knife. Draw the blade across the template to remove any surplus paste. Remove the template by peeling away from the tray, leaving you with paste shapes on the baking tray. You should be able to make nine tuiles. Reserve the remaining plain tuile paste.", "Spoon the chocolate paste into a small piping bag fitted with a writing nozzle.  Pipe patterns (concentric circles, dots, straight lines, squiggles, wavy lines) onto the tuiles.  ", "Cook for 5-6 minutes, or until just turning golden-brown around the edge. Remove from the oven and, working very quickly, drape the tuiles over a rolling pin while still warm, so that they cool in a curved shape.", "If the cooked tuiles start to harden before you have chance to shape them all, return them to the oven for 30 seconds to one minute to soften. ", "For the tuile cigars, make a further nine plain tuiles using the template as before. Bake for 5-6 minutes, or until pale golden-brown. Reserve the remaining plain paste. Remove from the oven and, working very quickly, bend the warm tuiles around wooden spoon handles to make cigar shapes. Dip the cigar tuiles in the melted plain chocolate.  Leave aside to set. ", "For the tuile basket, drop a spoonful of the remaining plain paste onto a silicone sheet and flatten with the back of a spoon to an uneven circle approximately 8cm/3¼in in diameter. Cook for 5-6 minutes, or until a pale golden-brown colour.  Remove from the oven and lift off the baking tray. Mould immediately over a muffin cup or ramekin to make a basket shape. Leave them to cool.", "Use a tablespoon dipped in cold water to place scoops of the chocolate mousse into the basket. Serve with the cigar-shaped and curved tuiles."]}, {"isVegetarian": false, "title": "Tubetti pasta with clams, mussels and rocket", "url": "www_bbc_co_uk_food_recipes_tubetti_pasta_with_clams_90088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz clams ", "500g/1lb 2oz mussels ", "320g/12oz tubetti pasta ", "150ml/5fl oz white wine ", "1 garlic clove", "4 tbsp extra virgin olive oil, plus extra for drizzling ", "handful parsley, roughly chopped", "1g sachet powdered saffron ", "4 plum tomatoes, deseeded and chopped", "1 red chilli, finely chopped", "handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Rinse the clams and mussels under cold running water. Place in a bowl of salted cold water and leave for about an hour. You will notice the shells opening slightly. Rinse under cold water again. ", "Meanwhile bring a saucepan of slightly salted water to the boil. Add the pasta and cook until al dente. Drain and set aside.", "Place the rinsed clams and mussels in a large saucepan together with the wine, garlic, oil and parsley. Cover with a lid and cook on a high heat for three minutes, until all the shells have opened. ", "Remove the clams from the heat. Immediately discard any unopened shells. Remove two-thirds of the clams and mussels from their shells, leaving the rest intact. Set aside. ", "Strain the cooking liquor through a fine sieve to remove any impurities. Return the cooking liquor to the pan with the shelled clams and mussels and cook on a medium heat until it reduces slightly.", " Stir in the saffron, tomato and chilli then season to taste with salt and freshly ground black pepper.", "Add the drained pasta to the sauce.", "Mix in the rocket and season with salt and freshly ground black pepper.", "Remove from the heat and stir in the clams and mussels in the shell. Drizzle with oil and serve immediately."]}, {"isVegetarian": true, "title": "Truffle egg toast", "url": "www_bbc_co_uk_food_recipes_truffle_egg_toast_40065", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 3cm/1¼in thick slice of square white bread", "80g/2¾oz fontina cheese, grated", "2 medium free-range egg yolks", "1 tsp truffle oil", "flaky sea salt and black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Lightly toast the bread on both sides.", "Put the bread on a tray. Use a very sharp knife to carefully cut a shallow well into the centre of the bread, about a 5cm/2in square. To do this cut the edges and push down the centre. Remember this is a well not a hole. It is important that you don’t cut all the way through!", "Distribute the fontina evenly around the rim of the well.  ", "Mix the yolks together with the truffle oil and pour them into the well then bake for 3-5 minutes until the cheese melts.", "Take the toast out and give the yolk a little stir then sprinkle with salt and pepper. Eat immediately."]}, {"isVegetarian": true, "title": "Truffles", "url": "www_bbc_co_uk_food_recipes_truffles_67741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dark chocolate, broken into pieces ", "175ml/6fl oz double cream", "5 tbsp brandy, rum or other spirit of your choice (optional)", "cocoa, icing sugar or finely crushed nuts, to finish"], "serves": "Makes 12-15 truffles", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Cover a baking tray tightly with two layers of cling film to put the truffles on to set.", "Tip the chocolate pieces into a bowl.  ", "Pour the cream into a pan and bring to a rolling boil.  ", "Pour over the chocolate and stir until all the chocolate is melted.  If you want to add booze, mix it in at this point.", "Allow the mixture to cool at room temperature - this will take about 1½ hours - by which time it should be set.", "Using a melon baller or teaspoon, scoop out bite-sized pieces.  Dust your hands with icing sugar to stop them sticking and roll the pieces into balls.", "Roll in sifted icing sugar, cocoa or crushed nuts and place them on the prepared tray.", "Once they are set you can store them in an airtight container in the fridge for about a week."]}, {"isVegetarian": true, "title": "Tumbet", "url": "www_bbc_co_uk_food_recipes_tumbet_98868", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tumbet_98868_16x9.jpg", "ingredients": ["2 medium aubergines, cut into 1.5cm/⅝in rounds", "up to 200ml/7fl oz olive oil", "2 medium courgettes, cut into 2cm/¾in slices", "500g/1lb 2oz large waxy potatoes (such as Charlotte), thinly sliced (around 3mm/⅛in)", "2 roasted red peppers (from a jar), cut into strips", "small bunch fresh oregano", "small bunch fresh basil", "2 tbsp olive oil", "4 garlic cloves, crushed", "400g/14oz ripe tomatoes, peeled and chopped", "1 tsp dried thyme ", "salt and freshly ground black pepper", "pinch sugar (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/Fan 180C/Gas 6. ", "Arrange the aubergine slices on a large baking tray and brush with olive oil. Season with salt. Roast for 20–25 minutes, or until softened and lightly browned. Remove from the oven and allow to cool.", "Pour a 5mm/¼in thick layer of olive oil in the base of a large, heavy-based frying pan. Fry the courgettes on a medium heat, for a couple of minutes on each side, then remove and drain onto kitchen towel. Season lightly with salt. ", "Add the potato slices to the frying pan and fry on both sides until they are softened all the way through and a very light golden colour around the edges. This will take up to 10 minutes. Drain on a plate lined with kitchen paper.", "To make the sauce, put the olive oil in a saucepan and add the garlic. Cook for 3–4 minutes on a low–medium heat until soft and aromatic, then add the tomatoes and thyme. Season with salt and pepper. ", "Bring to the boil, then reduce the heat and cook gently, uncovered, until well reduced – around 25 minutes. Taste after 10 minutes – if the sauce tastes acidic, add a pinch of sugar. ", "Reduce the oven to 180C/160C Fan/Gas 4. ", "To assemble, spread a couple of tablespoons of tomato sauce in the base of an oven dish. Sprinkle over some fresh oregano and basil leaves. Top with all the aubergines. ", "Add more tomato sauce, then sprinkle with more herbs and add the courgettes. Repeat with more tomato sauce, more herbs and the peppers, then finish with the last of the tomato sauce and herbs, and top with the potatoes. ", "Sprinkle over more salt and pepper and drizzle with a little more olive oil. Bake in the oven for 25–30 minutes, or until the potatoes are crisp and browned and the vegetables underneath are tender."]}, {"isVegetarian": true, "title": "Tuna and red pepper sandwich", "url": "www_bbc_co_uk_food_recipes_tuna_and_red_pepper_28066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g tin tuna in water, drained", "1 spring onion, thinly sliced", "½ small red pepper (40g/1½oz), cut into small dice", "2 tsp light mayonnaise", "2 x 30g/1oz slices wholemeal or granary bread", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the tuna, spring onion, red pepper and mayonnaise in a bowl. Season lightly with salt and pepper. Spread over one slice of bread and top with the second to make a sandwich."]}, {"isVegetarian": false, "title": "Tuna and broccoli pasta bake", "url": "www_bbc_co_uk_food_recipes_tuna_and_broccoli_pasta_25783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_broccoli_pasta_25783_16x9.jpg", "ingredients": ["200g/7oz dried short pasta shapes, such as fusilli or penne ", "250g/9oz small frozen broccoli florets", "40g/1½oz butter", "40g/1½oz plain flour", "600ml/20fl oz semi-skimmed milk", "75g/2½oz mature cheddar", "salt and freshly ground black pepper ", "1 x 185g tin tuna chunks in water or brine, drained ", "2 firm, ripe tomatoes, sliced (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a large saucepan with water and bring it to the boil. Add the pasta, return the water to the boil and cook according to the packet instructions until just tender. Just before the end of the cooking time, add the frozen broccoli florets to the pan and cook with the pasta for the final 2-3 minutes, until just tender. ", "Meanwhile, heat the butter, flour and milk in a saucepan over a medium heat until the mixture is just bubbling, whisking constantly with a balloon whisk until smooth and thickened to a roux. ", "Continue to cook the roux for a further 2-3 minutes, stirring constantly until it has thickened enough to coat the back of a spoon. Stir in half of the cheese until melted, then season, to taste, with salt and freshly ground black pepper. ", "Preheat the grill to its highest setting.", "Drain the pasta and broccoli in a large colander and transfer to a pre-warmed shallow ovenproof dish (a lasagne dish is ideal). Flake the tuna on top of the pasta and broccoli. ", "Pour the cheese sauce over the pasta mixture, then top with the sliced tomatoes, if using. Sprinkle over the remaining cheese. ", "Place the pasta bake under the hot grill for 4-5 minutes, or until the cheese melts and starts to turn golden-brown. Serve immediately."]}, {"isVegetarian": true, "title": "Tumbet (layered pepper and Manchego bake)", "url": "www_bbc_co_uk_food_recipes_tumbetlayeredpeppera_88137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14½oz canned chopped tomatoes", "1 tsp fresh oregano, plus extra for serving", "3 garlic cloves, sliced", "50ml/1¾fl oz extra virgin olive oil", "dash olive oil", "knob butter ", "500g/1lb 1½oz baking potatoes, peeled and finely sliced ", "500g/1lb 1½oz aubergine, sliced", "1 red pepper", "1 green pepper", "salt and freshly ground black pepper", "4 slices Manchego cheese"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, place the canned tomatoes, oregano, garlic and olive oil in a pan and simmer for 25 minutes.", "Meanwhile, for the tumbet, preheat the oven to 180C/350F/Gas 4. Heat the oil and butter in a large frying pan. Add the potatoes and fry for about 3-4 minutes until coloured. Remove with a slotted spoon and drain on kitchen paper.", "Repeat with the aubergine, also draining on kitchen paper.", "Slice the two peppers in half, scrape out and discard the seeds, then fry for two minutes until slightly blackened. Transfer to a plate lined with kitchen paper.", "In an ovenproof dish, divide the potatoes into four piles. Top each with some aubergine, a pepper half and a slice of cheese. Secure with a cocktail stick.", "To finish the sauce, cool slightly before blending until smooth (using a hand-blender). You can pass the sauce through a fine metal sieve for a really smooth finish. ", "Spoon the sauce over the tumbet and bake in the oven for 20 minutes.", "Serve in wedges scattered with more oregano."]}, {"isVegetarian": false, "title": "Tuna and bean salad", "url": "www_bbc_co_uk_food_recipes_tuna_and_bean_salad_93054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz green beans, halved", "160g tin tuna in water, drained", "50g/1¾oz red pepper, cut into dice", " 1 tbsp fat-free dressing"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a saucepan of boiling water for 5 minutes, or until tender. Drain and place in a bowl of cold water. When they are cool, drain off the cold water and mix the beans with the tuna, pepper and dressing in a bowl. Serve."]}, {"isVegetarian": false, "title": "Tuna bean salad", "url": "www_bbc_co_uk_food_recipes_tuna_bean_salad_54783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_bean_salad_54783_16x9.jpg", "ingredients": ["100g/3½oz green beans, halved", "2 free-range eggs", "400g tin mixed beans in water, drained and rinsed", "100g/3½oz cherry tomatoes, halved", "4 spring onions, thinly sliced", "160g tin tuna steak in water, drained", "1 tbsp extra virgin olive oil", "1 tsp red wine vinegar", "1 tsp Dijon mustard", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the green beans in a pan of boiling water for 4 minutes. Plunge them into a bowl of very cold water. ", "Cook the eggs in a pan of boiling water for 8 minutes. Drain in a sieve under cold running water until cold. Peel and cut the eggs into quarters.", "For the dressing, whisk the oil, vinegar and mustard in a large bowl until thick. Season with black pepper.", "Add the green beans, mixed beans, cherry tomatoes and spring onions to the dressing and mix. Flake the tuna on top and add the hard-boiled eggs. Season with black pepper."]}, {"isVegetarian": false, "title": "Tuna carpaccio with sourdough and tuna tartare", "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_25315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz very fresh tuna loin, trimmed", "2 tbsp olive oil", "1 loaf sourdough bread, sliced", "1 shallot, finely diced", "pinch Dijon mustard", "½ lemon, juice only", "4 tbsp chives, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a piece of cling film on the work surface and place ¾ of the tuna on top. Place another piece of cling film on top and, using a rolling pin, hit the tuna until it is very thin.", "Remove the top piece of cling film. Place a 20cm/8in diameter plate over the tuna and cut round it. Flip everything upside down so the plate is on the bottom.", "Heat a frying pan and add the oil, once hot add the sliced bread and cook on each side until crisp.", "Remove the remaining cling film and lay the toasted sourdough over the tuna.", "Place a serving plate on top, upside down. Flip the plates over, so the tuna is on top of the bread, on the serving plate.", "For the tuna tartare, finely dice the rest of the tuna and place in the bowl with the shallot, mustard, lemon juice and half of the chives.", "To serve, garnish the tuna carpaccio with the tuna tartare and the rest of the chives."]}, {"isVegetarian": false, "title": "Tuna Niçoise", "url": "www_bbc_co_uk_food_recipes_tuna_nicoise_87874", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz anchovies in oil", "400g/14oz pitted black olives", "75g/2½oz capers, drained and rinsed", "2-3 garlic cloves", "1 tsp Dijon mustard", "2 tsp lemon juice", "2 tbsp good-quality olive oil", "handful fresh basil, chopped", "fresh black pepper", "2 tsp Dijon mustard", "1 tbsp white wine vinegar", "100ml/3½oz extra virgin olive oil", "½ lemon, juice only", "pinch of salt and pepper", "4 Baby Gem lettuce ", "200g/7oz green beans, topped, tailed and blanched", "4 tsp capers, drained and rinsed", "200g/7oz cooked new potatoes", "24 baby plum tomatoes, cut in half", "4 tuna steaks, approximately 175g/6oz each", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 soft-boiled medium eggs, peeled and halved", "1 tbsp chopped chives", "1 loaf olive sourdough fougasse   "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tapenade, combine everything except half of the basil and the black pepper in a food processor and blend until roughly chopped up, but not puréed. Pour into a dish and garnish with black pepper and the remaining basil leaves.  ", "To make the dressing, place all ingredients in a clean jam jar. Put the lid on and shake well until the dressing has emulsified.", "To make the salad, tear the Baby Gem leaves and place in a bowl with the remaining salad ingredients.", "To make the tuna, heat a griddle pan until hot. Rub a little olive oil on both sides of the tuna steaks and season with salt and freshly ground black pepper.", "Fry the tuna in a hot pan for two minutes on each side, or until cooked to your liking. ", "To serve, drizzle two tablespoons of dressing over the salad. Very gently, using your hands, mix the salad so that it’s coated in the dressing. Arrange the salad on a large platter or board. Place the eggs around the salad.", "Slice the tuna on the diagonal and lay slices on top of the salad. Sprinkle over the chives. Pour any remaining dressing in a jug leave on the table next to the salad. Serve with the fougasse and tapenade."]}, {"isVegetarian": false, "title": "Tuna and sweetcorn pasta salad", "url": "www_bbc_co_uk_food_recipes_tuna_and_sweetcorn_pasta_75779", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_sweetcorn_pasta_75779_16x9.jpg", "ingredients": ["150g/5oz whole wheat pasta, cooked according to packet instructions", "150g/5oz frozen or tinned sweetcorn ", "150g/5½oz tinned tuna in spring water, drained", "2 tbsp plain yoghurt", "1 tbsp mayonnaise", "freshly ground black pepper", "squeeze lemon (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together until thoroughly combined. Transfer to a sealed plastic tub and keep in the fridge. "]}, {"isVegetarian": false, "title": "Tuna carpaccio with caramelised watermelon", "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_42630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ watermelon, peeled, flesh cut into 1cm/½in-thick slices", "2 thin slices sourdough bread", "4 x 50-75g/2-3oz fresh tuna loin steaks (ask the fishmonger for sushi-grade tuna)", "1 lemon, juice only", "2 tbsp very finely chopped fresh chives, plus extra to serve", "1 shallot, very finely chopped, plus extra to serve", "knob of butter", "sea salt and freshly ground black pepper", "2 tbsp extra virgin olive oil, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Scoop all of the watermelon slices into a re-sealable food bag. Add a pinch of salt and chill in the fridge for 2-3 days.", "When the watermelon is ready, preheat the oven to 150C/130C Fan/Gas 4.", "Toast the bread, then slice each in half widthways to create four slices, each with one toasted side and one untoasted side. Sandwich them between 2 clean baking trays. Bake in the oven for 5 minutes, or until hard and crisp. Remove the trays from the oven and set the bread aside to cool, still sandwiched between the trays.", "Lay a sheet of cling film onto a clean work surface. Place the tuna steaks on top and cover with a second sheet of cling film. Flatten the tuna steaks to a thickness of 2mm using a meat mallet or rolling pin. (Do this one steak at a time if it is easier.)", "Trim each piece of flattened tuna into a circle, using an upturned bowl as a guide. Set aside.", "Chop the tuna trimmings very finely and place them into a bowl. Squeeze over half of the lemon juice and add the chives and shallots. Season, to taste, with salt and freshly ground black pepper, then mix well.", "Heat the butter in a frying pan over a high heat until it starts to brown. Chop the watermelon slices into small pieces and add them to the pan in batches, frying for 1-2 minutes on each side, or until caramelised and heated through. Season with a pinch of salt. Remove from the pan and set aside on a warmed plate while you fry the remaining watermelon.", "To serve, spoon some of the tuna tartare onto each piece of toast. Place onto the serving plates and top with a piece of cooked watermelon. Turn over each circle of flattened tuna carpaccio, discarding the cling film, and place one circle alongside each toast. Brush each circle of tuna carpaccio with a little of the extra virgin olive oil, then sprinkle over the shallot and chives, squeeze over the lemon juice, and season, to taste, with freshly ground black pepper."]}, {"isVegetarian": false, "title": "Tuna Niçoise wrap", "url": "www_bbc_co_uk_food_recipes_tuna_nioise_wrap_20414", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_nioise_wrap_20414_16x9.jpg", "ingredients": ["50g/2oz green beans, trimmed", "1 free-range egg (fridge cold)", "2 tbsp light mayonnaise", "1 tbsp baby capers, drained", "4 baby gherkins, drained and sliced", "¼ tsp dried mixed herbs", "1 x 185g/6½oz can tuna in spring water", "2 large flour tortillas or wraps (white, wholemeal or a combination)", "small handful baby spinach leaves", "1 large ripe tomato, cut into 8 pieces", "20g/¾oz pitted black olives in brine, drained", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil, add the beans and cook for four minutes. ", "Lift the beans out with a slotted spoon and dunk them into a large bowl of cold water. Alternatively, tip the beans into a sieve and rinse them under running water until cold. Drain.", "To boil the egg, put the pan with the hot water back on the heat, add the egg and bring the water back to the boil. Cook for eight minutes, then put the egg in a sieve under running water until cold. Leave the egg in cold water while you prepare the rest of the filling.", "Mix the mayonnaise, capers, gherkins, herbs and a few twists of ground black pepper in a bowl. Add the tuna and stir everything lightly, without mashing the tuna too much. ", "Peel the egg, then slice it into quarters, lengthwise.", "Place the tortillas on a board and cover each one with a layer of spinach leaves, leaving a gap of about 5cm/2in at the top and bottom of the tortilla. Add the green beans, all heading in one direction.", "Divide the tuna mixture between the tortillas, then the egg and tomato pieces. Sprinkle with the olives, pressing each one lightly between your thumb and finger to flatten them slightly.", "Fold the top and bottom of each wrap inwards to cover most of the filling and then roll up fairly tightly. Wrap them in foil – no need do this if eating immediately – then chill the wrapped tortillas until ready to eat. Eat within 24 hours and transport with an ice pack if serving as a packed lunch. Unwrap the foil as you eat the wrap.", "If you are taking your wrap to work, don’t forget to use a cool bag and ice pack to keep it chilled and in tip-top condition until you are ready to eat."]}]