[{"isVegetarian": true, "title": "Lemon curd and champagne syllabub", "url": "www_bbc_co_uk_food_recipes_lemoncurdandchampagn_81036", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 ginger biscuits", "100ml/3½fl oz champagne or sparkling wine", "284ml/10fl oz double cream", "4 tbsp icing sugar", "8 tbsp lemon curd", "2 tbsp flaked almonds, toasted", "fresh strawberries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Crumble the biscuits into the bottom of a glass dish and moisten with half of the champagne or sparkling wine.", "Begin whipping the cream with the sugar and when it reaches soft peaks, fold in the remaining champagne and swirl in the lemon curd, leaving a marbling of yellow through the cream.", "Spoon the mixture into the glass dish and scatter with the toasted almonds and strawberries."]}, {"isVegetarian": true, "title": "Lemon curd pancakes", "url": "www_bbc_co_uk_food_recipes_lemoncurdpancakes_67267", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp ricotta", "4 tbsp lemon curd", "caster sugar, to dust", "knob of butter", "4 ready-made crêpes"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to a medium setting.", "Place 1 tbsp of ricotta cheese and 1 tbsp lemon curd in the center of each of four ready- made crêpes.", "Fold up to make triangular packets open at the top.", "Place these in an ovenproof dish and spinkle on a little caster sugar. Dot with butter and cook under a medium grill, until the butter melts and the sugar crisps. Serve at once."]}, {"isVegetarian": true, "title": "Lemon curd meringue tart with blackberry compôte", "url": "www_bbc_co_uk_food_recipes_lemoncurdmeringuetar_90798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10oz sweet shortcrust pastry", "plain flour, for dusting ", "4 lemons, zest and juice only", "4 free-range eggs, beaten", "350g/12oz caster sugar", "110g/4oz butter", "2 free-range egg whites, whisked until soft peaks form when the whisk is removed", "150g/5oz caster sugar", "50ml/2fl oz crème de mure", "75g/3oz caster sugar", "250g/9oz blackberries", "4 sprigs fresh mint, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lemon curd tarts, on a lightly floured work surface, roll out the pastry to a 0.5cm/¼in thickness. Cut out four 12cm/5in discs from the pastry and line each of four 10cm/4in shallow tart cases with one of the pastry discs. Chill in the fridge for 30 minutes.", "Meanwhile, in a bowl, beat together the lemon zest and juice, eggs and caster sugar until well combined. ", "Transfer the mixture to a saucepan and bring to a simmer over a medium heat, then add the butter and whisk until well combined.", "Continue to simmer for 4-5 minutes, stirring constantly, until the mixture has thickened, then pass the mixture through a fine sieve into a clean bowl. Set the sieved lemon curd mixture aside to cool.", "When the tart cases have chilled, line each with a disc of greaseproof paper or aluminium foil and fill with rice or baking beans. Place the four tart cases onto a baking tray and bake in the oven for 12-15 minutes.", "Remove the greaseproof paper and baking beans and return the tart cases to the oven for a further 4-5 minutes. Remove from the oven and set aside to cool slightly.", "When the tart cases have cooled, divide the lemon curd mixture equally among the pastry cases.", "For the meringue topping, sprinkle the caster sugar onto a baking tray and bake in the oven for 4-5 minutes, or until the sugar is hot but has not melted.", "In a large bowl, gradually add the hot sugar, a third at a time, to the whisked egg whites, whisking constantly, until stiff peaks form when the whisk is removed and the mixture is glossy.", "Spoon the whisked egg mixture into a piping bag.", "Starting from the middle and working outwards, pipe spirals of the meringue mixture onto all four tarts until it covers the lemon curd.", "Using a mini blow torch, heat the meringue until pale golden-brown. (Alternatively, preheat the grill to its highest setting and heat the meringue for 2-3 minutes, or until pale golden-brown.)", "For the blackberry compote, in a pan, bring the caster sugar and crème de mure to a simmer.", "Continue to simmer for 1-2 minutes, then add the blackberries and simmer for a further 2-3 minutes, or until the blackberries are tender and the mixture has just thickened.", "To serve, place a tart onto each of four serving plates. Spoon a little blackberry compote alongside each tart. Garnish each with a sprig of mint."]}, {"isVegetarian": true, "title": "Lemon curd tart", "url": "www_bbc_co_uk_food_recipes_lemoncurdtart_67268", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet ready-rolled puff pastry", "egg wash", "lemon curd"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Take a packet of ready rolled puff pastry and cut in half (reserve the other half for another recipe). Using one half score a line about 2.5cm/1in inside the edge all round the pastry. ", "Using a fork prick the pastry inside the line all over.", "Brush the pastry outside the line with egg wash and then bake the pie case in the hot oven  for 15-20 minutes until well coloured.", "Allow to cool, then spread over the lemon curd."]}, {"isVegetarian": true, "title": "Lemon layer cake", "url": "www_bbc_co_uk_food_recipes_lemondrizzlecake_91004", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlecake_91004_16x9.jpg", "ingredients": ["4 lemons, juice only", "75g/2¾oz caster sugar", "200g/7oz caster sugar", "200g/7oz unsalted butter, plus extra for greasing", "2 lemons, zest only", "3 free-range eggs, beaten", "200g/7oz self-raising flour, plus extra for dusting", "2 free-range egg yolks", "75g/2¾oz caster sugar", "50g/1¾oz unsalted butter", "2 lemons, juice and zest ", "100g/3½oz mascarpone"], "serves": "Serves 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 20cm/8in springform cake tin with butter, then add a small amount of flour, turn the cake tin to coat the sides and bottom and shake out any excess.", "For the lemon drizzle, in a bowl, mix together the lemon juice and sugar until the mixture is well combined and the sugar has melted. Set aside.", "For the sponge, beat the sugar, butter and lemon zest in a mixing bowl until pale and fluffy, using an electric whisk. ", "Gradually add the eggs, whisking after each addition until the egg is completely incorporated into the mixture before adding the next. Carefully fold in the flour using a metal spoon.", "Pour the cake batter into the prepared cake tin and bake in the oven for 30-40 minutes, or until the sponge has risen and is cooked through. (The sponge is cooked through when a skewer inserted into the centre of the cake comes out clean.) ", "As soon as the cake is cooked, remove it from the springform cake tin and prick the top all over with a cocktail stick. Pour over the lemon drizzle mixture to soak the sponge, then set aside to cool on a wire rack.", "For the filling, whisk the egg yolks and sugar together in a pan over a low to medium heat until the sugar has melted. ", "Add the butter, lemon juice and zest, and continue to cook, whisking continuously, for 4-5 minutes, or until the mixture has thickened and is smooth and well combined. Set aside to cool completely. ", "Using a metal spoon, carefully fold the mascarpone into the cooled lemon curd mixture to create a marbled effect. ", "When the sponge has cooled, cut the cake in half horizontally to create two thinner cakes. Spread the lemon filling all over the lower half of the cake, then place the top half (the half that was pricked and soaked in the lemon drizzle) on top."]}, {"isVegetarian": false, "title": "Lemongrass and coconut panna cotta with coconut meringue and mango", "url": "www_bbc_co_uk_food_recipes_lemongrass_and_coconut_49054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml/20fl oz double cream", "2 lemongrass stems, chopped", "75g/3oz caster sugar", "3 leaves gelatine, soaked in water", "50ml/2fl oz coconut milk ", "75ml/3fl oz coconut liqueur", "1 mango, peeled and roughly chopped", "3 eggs, whites only", "150g/5oz caster sugar", "25g/1oz desiccated coconut, toasted "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the panna cotta, heat 400ml/14fl oz of the cream with the lemongrass and sugar in a saucepan.", "Bring to a boil, stirring occasionally until all the sugar has dissolved, then reduce the heat and simmer until the volume of the liquid has reduced by half.", "Remove from the heat and allow to cool. Once cooled, pour the lemongrass cream through a fine sieve into a bowl.", "Heat the coconut milk in a separate saucepan until just simmering, then remove from the heat.", "Drain the gelatine leaves and add to the warm coconut milk. Stir until dissolved then pour through a sieve into the lemongrass cream. Allow to cool.", "Whisk the remaining cream and coconut liqueur in a bowl  until soft peaks are formed when the whisk is removed. Fold into the cooled cream until totally incorporated and pour into four ramekins or moulds. Set asid in the fridge for at least two hours until set.", "Meanwhile, blend the mango pieces to a fine purée in a small blender. Pass the mango purée through a sieve into a bowl. Set aside until serving.", "For the coconut meringue, preheat the oven to 100C/200F/Gas ¼. ", "Place the egg whites into a clean glass bowl and whisk until soft peaks form when the whisk is removed.", "Whisk in the caster sugar a spoonful at a time until the mixture is glossy and stiff peaks form when the whisk is removed.", "Line a baking tray with parchment paper, or use a silicone mat, and place eight spoonfuls of meringue mixture onto it. Scatter the toasted coconut over the top.", "Bake in the oven and for 1 ½ hours.", "Remove the meringues from the oven and set aside to completely cool.", "To serve, dip the panna cotta into a bowl of hot water briefly or slide a knife around the outside edge carefully. Spoon the mango purée onto the plate. Turn the panna cotta out onto the purée and set the meringue alongside."]}, {"isVegetarian": false, "title": "Lemongrass and ginger mussels", "url": "www_bbc_co_uk_food_recipes_lemongrass_and_ginger_63752", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemongrass_and_ginger_63752_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter", "2 shallots, finely chopped", "2 lemongrass stalks, tough outer leaves discarded, soft core finely chopped", "2 garlic cloves, finely chopped", "10cm/4in piece fresh root ginger, peeled, finely chopped", "1-2 red chillies (depending on their heat), finely sliced", "200ml/7oz white wine", "330ml/11fl oz coconut water", "160ml/5½fl oz coconut cream", "2kg/4lb 8oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when tapped firmly)", "2 tbsp olive oil", "1 loaf sourdough bread, thickly sliced", "2 tbsp roughly chopped fresh coriander leaves", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a heavy-based, lidded pan over a medium heat. Add the shallots, lemongrass, garlic, ginger and chilli(es) and fry for 4-5 minutes, or until softened but not coloured.", "Increase the heat to high, then pour in the wine, coconut water and coconut cream and bring to the boil. Add the mussels and cover the pan with the lid. Cook for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).", "Meanwhile, heat a griddle pan over a high heat. When the pan is hot, drizzle the olive oil over the bread slices and grill the bread for 30 seconds on each side, or until chargrill marks appear on both sides.", "When the mussels have cooked, stir in the coriander leaves, then season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the mussels, and the cooking liquor, into four bowls. Serve the bread alongside."]}, {"isVegetarian": true, "title": "Lemon drizzle muffins", "url": "www_bbc_co_uk_food_recipes_lemondrizzlemuffins_10460", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemondrizzlemuffins_10460_16x9.jpg", "ingredients": ["2 eggs, beaten", "85g/3oz caster sugar", "240ml/8fl oz milk", "100ml/3½fl oz vegetable oil", "300g/10oz plain flour", "3 tsp baking powder", "½ tsp salt", "4 lemons, zest only", "50g/2oz icing sugar", "1 lemon, juice only", "sprigs lemon thyme, to garnish (optional)"], "serves": "Makes 8-10 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a muffin tin with paper cases. Mix the egg, sugar, milk and oil in a large bowl. Sift in the flour, baking powder, salt and then add the lemon. Roughly mix.", "Spoon the mixture into the pre-prepared muffin cases.", "Bake for 30-35 minutes until well risen and golden. Cool on a wire rack.", "Make the lemon drizzle topping by mixing together the sugar and lemon juice.", "Spoon the lemon drizzle mixture over the cooled muffins. If desired, decorate the muffins with sprigs of lemon thyme."]}, {"isVegetarian": false, "title": "Lemongrass chicken and aubergine", "url": "www_bbc_co_uk_food_recipes_lemongrass_chicken_and_25172", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken thighs, skinless and boneless", "4 tbsp chopped lemongrass (very finely chop the bottom part of the lemongrass)", "2 tbsp vegetable oil", "1 tsp fish sauce", "35g/1¼oz dark palm sugar", "2 tbsp fish sauce", "1 Japanese long aubergine", "10g/⅓oz finely chopped shallot", "1 tbsp chopped spring onion (green part only)", "1 shallot, sliced into rings", "sea salt", "75g/2½oz pickling liqueur (equal quantities of caster sugar and water, flavoured with a smashed garlic clove)", "75g/2½oz Vietnamese chilli paste", "2 lime leaves, thinly sliced ", "jasmine rice, to serve"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the chicken thighs, put the chicken in a bowl and add half the lemongrass and oil, and all the fish sauce. Leave to marinade for 20 minutes, or longer if convenient.", "Preheat the oven to 200C/400F/Gas 6.", "For the fish caramel sauce, heat a flameproof casserole. Add a tablespoon of water and the palm sugar. Cook over a low heat until the sugar has dissolved and the mixture has a syrup-like consistency.", "Set aside to cool for two minutes, then add the fish sauce and marinated chicken. Return to the heat and cook for 5-8 minutes. Transfer to the oven to finish. ", "For the smokey aubergine, heat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Pierce the aubergine all over with a fork and place over an open flame until it is blistered and burnt all over and tender inside. Set aside to cool a little.", "Meanwhile, for the spring onion vinaigrette place all the ingredients in a pan with 460ml/16fl oz water. Heat gently.", "For the smoky aubergine, add the finely chopped shallot and spring onions to the spring onion vinaigrette.", "Place the shallot rings in the deep fat fryer and deep fry until crisp. Drain and place onto a plate lined with kitchen roll to drain.", "To finish, top and tail the aubergine then slice it down the middle lengthways. Scoop out the tender flesh from the burnt skin and divide between serving plates. Use scissors to cut it into bite-sized pieces.", "Take the spring onions out of the vinaigrette and drain them, reserving the vinaigrette for dressing.", "Garnish with the blanched spring onions, crisp shallots and lime leaves. Dress with the vinaigrette. Serve the chicken in the casserole with jasmine rice."]}, {"isVegetarian": true, "title": "Lemongrass parfait with honeycomb and lemongrass toffee apple bananas", "url": "www_bbc_co_uk_food_recipes_lemongrassparfaitwit_92905", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450ml/16fl oz double cream", "3 lemongrass stalks, cut lengthways, crushed lightly", "3 free-range eggs, separated", "150g/5oz caster sugar", "200g/7oz caster sugar", "50ml/2fl oz runny honey", "1 tbsp liquid glucose", "50ml/2fl oz water", "¾ tsp bicarbonate of soda", "vegetable oil, for greasing", "6 apple bananas, peeled and split lengthways (you can substitute with small unripe bananas)", "50g/2oz butter", "75g/3oz light soft brown sugar", "1 lemongrass stalk, cut lengthways, crushed lightly", "150ml/5fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the lemongrass parfait, place 150ml/5fl oz of the double cream into a small saucepan with the lemongrass and bring to a simmer. Set aside to infuse for at least one hour. Once infused, blend the mixture in a food processor to a fine purée. Pass the mixture through a fine sieve and chill in the fridge until cold.", "Meanwhile, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Whisk the egg yolks and 75g/3oz of the sugar together in the bowl until pale and fluffy.", "Continue cooking, whisking continuously, for 5-6 minutes, or until the mixture thickens. ", "Remove the egg and sugar mixture from the heat and whisk in the cold lemongrass mixture. Whisk until the mixture has cooked and is pale and fluffy. Chill in the fridge for 1-2 hours until cold.", "Whisk the egg whites in a bowl, until soft peaks form when the whisk is removed. Slowly whisk in the remaining sugar until the egg whites are glossy.", "Fold the meringue mixture into the lemongrass mixture.", "Whisk the remaining 300ml/10½oz of double cream in a bowl until stiff peaks form when the whisk is removed. Fold into the lemongrass mixture.", "Place six small chefs' rings onto a baking tray lined with greasproof paper and pour the lemongrass mixture into the rings. Tap the side of the rings gently to remove any air, then chill in the freezer for two hours, or until just solid.", "For the honeycomb, place the sugar, honey, liquid glucose and water into a saucepan and bring to the boil. Continue to cook until the temperature reaches 160C (use a sugar thermometer to check this), remove from the heat and whisk in the bicarbonate of soda. ", "Pour the mixture onto a baking tray lined with greasproof paper. Set aside until the mixture becomes hard, then break into very small pieces using a toffee hammer.", "For the toffee apple bananas, heat a frying pan until hot. Add the bananas, cut-side down, and fry for 1-2 minutes, or until caramelised. Remove from the pan and set aside. Add the butter to the pan and heat until the butter foams, then add the brown sugar and cook until the mixture is a caramel colour.", "Add the lemongrass and the cream, bring to the boil, then reduce the heat until the mixture is simmering and simmer for 2-3 minutes, or until golden-brown. Return the bananas to the pan and heat through. discard the lemongrass.", "To serve, dip the top and bottom of each parfait into the honeycomb pieces.", "Using a warm cloth or a chefs' blowtorch, heat the sides of each chefs' ring to loosen the parfait and turn them out onto the centre of six serving plates. Place a couple of pieces of banana on the side of each parfait then spoon the lemongrass toffee sauce over the top."]}, {"isVegetarian": true, "title": "Potato and carrot gratin", "url": "www_bbc_co_uk_food_recipes_lemongratindauphinoi_88899", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz double cream", "150ml/5fl oz milk", "1 lemon, zest only", "salt and freshly ground black pepper", "1 potato, peeled and sliced finely on a mandoline", "3 baby carrots, peeled, cut in half lengthways"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the cream and milk in a medium sized saucepan over a low heat and bring to a simmer.", "Add the lemon zest and season with salt and freshly ground black pepper.", "Add the sliced potato and halved baby carrots and bring to the boil. Transfer to an ovenproof dish and place into the oven to cook for 15-20 minutes, or until cooked and golden-brown on top."]}, {"isVegetarian": false, "title": "Lemongrass poussin with red-cabbage salad", "url": "www_bbc_co_uk_food_recipes_lemongrass_poussin_with_17288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lemongrass stalks, outer leaves removed, inner core finely chopped", "2 tbsp roughly chopped fresh coriander leaves", "4 garlic cloves, finely chopped", "2 red chillies, finely chopped", "5cm/2in piece fresh root ginger, peeled and grated", "2 limes, juice only", "300ml/11fl oz vegetable oil", "4 poussins", "1 free-range egg yolk", "2 tsp Dijon mustard", "2 tsp walnut vinegar", "sea salt and freshly ground black pepper", "1 small red cabbage, root removed, leaves very finely sliced"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak a large, unvarnished wooden stick suitable for cooking in cold water, preferably overnight. ", "Light the barbecue and allow the flames to flare up and die down, until the coals are glowing red and starting to turn white.", "In a bowl, mix together the lemongrass, coriander, garlic, chillies, ginger and lime juice until well combined. Stir in 50ml/2fl oz of the vegetable oil, then add the poussin and turn to coat them in the marinade, scooping some inside each, too. ", "When the barbecue is ready, slide the poussins onto the stick, securing them with string. ", "Set the stick about 30cm/12in above the barbecue coals and cook for 30-35 minutes (depending on their size), turning every so often, until the poussins are completely cooked through and no trace of pink remains when the thigh meat is pierced in its thickest part with a skewer.", "To make the dressingwhisk the egg yolk, Dijon mustard, walnut vinegar and 250ml/9fl oz water together in a bowl until combined. Gradually whisk in the remaining vegetable oil, whisking all the time, until emulsified. Season, to taste, with salt and freshly ground black pepper.", "Place the red cabbage into a large bowl, then pour over 100ml/3½fl oz of the dressing and mix well. ", "Serve the poussins whole with a pile of the red-cabbage salad alongside. "]}, {"isVegetarian": true, "title": "Lemon, lime and orange polenta cake with orange caramel sauce", "url": "www_bbc_co_uk_food_recipes_lemonlimeandorangepo_86188", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb unsalted butter, plus extra for greasing ", "450g/1lb caster sugar", "450g/1lb ground almonds", "6 free-range eggs", "dash vanilla essence", "½ lime, juice only", "½ lemon, juice only", "squeeze orange juice", "2 lemons, zest only", "1 orange, zest only", "1 lime, zest only ", "225g/8oz polenta", "pinch salt", "1 heaped tsp baking powder", "flour, for dusting", "100g/3½oz unsalted butter", "150g/5oz light brown sugar", "1 tsp orange blossom water", "2 oranges, juice only", "mascarpone cheese, to serve"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Beat the butter and sugar together in a bowl until pale and fluffy.", "Add the almonds and mix together well.", "Add the eggs, one at a time, beating to combine well before adding the next egg.", "Add the vanilla essence and the fruit juices and zests and mix well.", "Add the polenta, salt and baking powder and stir well to combine.", "Spoon the cake mixture into a 30cm/12in greased and floured cake tin and transfer to the oven to bake for 45-55 minutes, or until golden and firm. If the top begins to brown too soon, cover with baking paper to protect the top from burning while the rest of the cake cooks. Remove from the oven and allow to cool.", "For the sauce, place the butter and sugar into a pan over high heat and cook until they melt and begin to caramelise.", "Add the orange blossom water and orange juice and stir well. Simmer for four minutes, until combined.", "To serve, slice a piece of cake and place onto a plate. Add a dollop of mascarpone and drizzle the sauce around."]}, {"isVegetarian": true, "title": "Lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_lemonmeringuepie_86114", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonmeringuepie_86114_16x9.jpg", "ingredients": ["225g/8oz plain white flour", "pinch salt", "110g/4oz cold unsalted butter, cubed", "2 tsp caster sugar", "1 medium free-range egg yolk", "100g/3½oz caster sugar", "7 tbsp cornflour ", "4 large lemons, zest and juice only", "6 free-range egg yolks ", "100g/3½oz unsalted butter, melted", "6 medium free-range egg whites", "300g/10½oz caster sugar"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Sift the flour and salt into a mixing bowl.", "Add the butter to the flour and then rub between your fingertips until a fine breadcrumb consistency is achieved.", "Add the sugar to the flour and butter. Using your hands, mix to a firm dough with the egg yolk and a splash of cold water.", "Wrap the dough in cling film and allow to rest in the refrigerator for 30 minutes before using.", "Preheat the oven to 190C/375F/Gas 5 and grease a 22cm/9in fluted loose-bottomed tin. Place the tin onto a baking tray.", "Roll out the pastry until it's big enough to generously fit the tin, leaving excess pastry falling over the sides of the tin onto the baking tray underneath the tin - don't trim at this stage.", "Line the pastry with greaseproof paper and fill with baking beans. Now trim the excess pastry using a sharp knife. Bake the pastry case blind for about 15-20 minutes or until the pastry is pale golden and dried out - remove the paper and beans for the last five minutes. Lower the oven heat to 150C/300F/Gas 2.", "Meanwhile, for the lemon curd, mix together the sugar, cornflour and enough water to make a paste, in a large bowl.", "Bring 50ml/2fl oz water and the lemon zest to the boil in a small pan.", "Gradually pour the hot liquid onto the cornflour and sugar, whisking all the time until smooth.", "Beat in the egg yolks, lemon juice and butter. Return to the pan.", "Cook over a low heat, stirring all the time, until thickened. Pour into the baked blind pastry case and leave to cool slightly.", "For the meringue, whisk the egg whites in a large bowl with an electric whisk until they form stiff peaks. Whisk in the caster sugar, a spoonful at a time, whisking well and at a high speed between each addition. Transfer the meringue into a piping bag (with a plain nozzle) and pipe the meringue on top of the lemon curd. ", "Bake for about 35-45 minutes until the meringue is crisp on the outside and soft and marshmallow-like underneath. ", "Serve warm or cold in slices."]}, {"isVegetarian": true, "title": "Lemon meringue pie", "url": "www_bbc_co_uk_food_recipes_lemonmeringuepie_89144", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "½ tsp baking powder", "1 tsp caster sugar", "175g/6oz unsalted butter", "pinch salt", "1 free-range egg", "190g/6¾oz caster sugar", "2 lemons, zest and juice only", "1 free-range egg, yolk only, beaten", "1 tbsp cornflour, dissolved in a little milk", "175ml/6fl oz boiling water", "2 free-range eggs, whites only", "pinch salt", "80g/3oz caster sugar"], "serves": "6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Sieve the flour and the baking powder into a bowl and add the sugar and salt. Cut the butter into small pieces and rub into the flour until the mixture resembles fine breadcrumbs.", "Add the egg and mix until a ball of pastry forms. Wrap in cling film and place into the fridge to chill for half an hour.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the pastry from the fridge and unwrap it. Roll out the pastry on a floured work surface to fit a 20cm/8in tart tin.", "Line the tin with the pastry, pushing it well up the sides. Prick the base with a fork, then place a circle of baking parchment over the base of the pastry and cover with ceramic baking beans (or uncooked rice).", "Transfer to the oven and bake blind for 18-20 minutes. Remove from the oven, remove the baking beans or rice and the baking parchment.", "Reduce the temperature of the oven to 150C/300F/Gas 2.", "Meanwhile, for the filling, place the sugar and the zest and juice of the lemons into a small pan.", "Mix the beaten egg yolk with the cornflour mixture in a clean bowl, then add to the pan of lemon and sugar.", "Add boiling water, then simmer over a low heat, stirring constantly, until thickened. Remove from the heat and allow to cool.", "Once the filling mixture has cooled, pour it into the pastry base in its tin.", "For the meringue topping, whisk the egg whites until stiff peaks form when the whisk is removed.", "Whisk in one tablespoon of caster sugar, then add the remaining caster sugar, one tablespoon at a time, whisking constantly.", "Spread the meringue topping over the pie filling and place into the oven to bake for 45-50 minutes, or until the meringue is light golden-brown and crisp on the outside, but soft underneath.", "Remove from the oven and allow to cool. Serve either warm or cold."]}, {"isVegetarian": false, "title": "Lemon mousse", "url": "www_bbc_co_uk_food_recipes_lemonmousse_88962", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonmousse_88962_16x9.jpg", "ingredients": ["4 medium free-range eggs, separated", "250g/8oz caster sugar", "3 lemons, zest and juice only", "5 tbsp cold water", "15g/½oz powdered gelatine ", "300ml/½ pint double cream", "small handful blanched toasted almonds, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using an electric whisk, whisk together the egg yolks, sugar, lemon zest and juice until the sugar has dissolved and the mixture has thickened a little. (If you do not have an electric whisk, whisk by hand in a glass bowl set over a pan of hot water. When the mixture has thickened, remove the bowl from the pan and whisk until cool.)", "Place the cold water into a heavy-based saucepan, sprinkle in the gelatine and place over a gentle heat, without stirring, until the gelatine has melted. Remove from the heat and leave to cool slightly. ", "In a separate bowl, lightly whip the cream until soft peaks form when the whisk is removed. Stir the melted gelatine into the cream and fold into the egg yolk mixture.   ", "Whisk the egg whites in a separate bowl with an electric hand-whisk until soft peaks form when the whisk isremoved. ", "Place the bowl with the egg yolks inside a bigger bowl filled with ice-cold water. Gently fold the whipped egg whites into the egg yolk mixture with a metal spoon. Stir the mixture until it begins to thicken, then pour into a glass bowl and refrigerate for one hour, or until set. ", "Sprinkle the toasted chopped almonds over the top of the mousse and serve."]}, {"isVegetarian": true, "title": "Lemon pancakes with strawberry compôte and vanilla cream", "url": "www_bbc_co_uk_food_recipes_lemonpancakeswithstr_82590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour", "2 free-range eggs", "300ml/10fl oz milk", "1 lemon, zest only", "1 tbsp vegetable oil", "100g/3½oz strawberries, chopped", "½ orange, zest and juice", "1 tsp caster sugar", "50ml/2fl oz champagne ", "50g/2oz clotted cream", "1 tsp icing sugar", "1 vanilla pod, split and seeds scraped out", "mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pancakes, in a large bowl whisk together all of the pancake ingredients, except for the oil, to form a thick batter.", "Heat the oil in a crepe pan, then ladle spoonfuls of the mixture into the frying pan.", "Fry the pancakes for one minute on both sides until coloured, then pile up on a warm plate.", "To make the strawberry compote, in a frying pan heat the strawberries with the orange zest and juice and the sugar.", "Add the champagne and cook down until the liquid volume is reduced by half.", "To make the vanilla cream, mix the clotted cream with the sugar and vanilla seeds.", "Serve the pancakes on a warm plate with the strawberry compote spooned around. Garnish with a spoonful of the vanilla cream and a sprig of mint on top."]}, {"isVegetarian": true, "title": "Lemon posset with lemon shortbread", "url": "www_bbc_co_uk_food_recipes_lemonpossetwithlemon_85812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonpossetwithlemon_85812_16x9.jpg", "ingredients": ["600ml/21fl oz double cream", "150g/5oz caster sugar", "2 large lemons, zest and juice only", "90g/3½oz icing sugar", "185g/6½oz plain flour", "60g/2½oz cornflour", "30g/1oz ground almonds", "250g/9oz butter, cut into cubes, plus extra for greasing", "2 drops almond essence", "75g/3oz lemon curd", "icing sugar, for dusting"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the posset, place the double cream and the sugar into a large pan over a low heat and bring to the boil slowly. Boil for three minutes, then remove from the heat and allow to cool.", "Add the lemon juice and zest and whisk well.", "Pour the lemon cream mixture into six large serving glasses and refrigerate for three hours.", "Preheat the oven to 180C/355F/Gas 4. ", "For the shortbread, sift the icing sugar, flour and cornflour together into a bowl and add the ground almonds.", "Transfer the flour mixture to a food processor. Add the butter and pulse until there are no visible lumps of butter.", "Add the almond essence. Pulse again, then turn the mixture out onto a lightly floured surface and bring together to form a smooth dough.", "Grease a muffin tray with butter.", "Divide the dough up and roll into small balls. Place the balls into the muffin cups, flattening the tops slightly with your fingers. The dough should come about one third of the way up the side of each muffin cup to give a nice proportion to the finished biscuit.", "Transfer to the oven and bake the shortbreads for 8-12 minutes, until they are a light golden colour.", "Remove from the oven, allow to cool slightly, then, using your thumb, make a small indentation into the top of each biscuit. ", "Let the shortbreads cool for a few minutes, then turn the mould over and tap the shortbreads out. (Be gentle, as the biscuits are fragile while they are still warm.)", "When all the shortbreads are baked and cooled, dust the tops with icing sugar.", "Fill the indentations in the biscuits with lemon curd. ", "To serve, place the lemon possets onto plates with a shortbread alongside. Sprinkle a little lemon zest on top, if you want."]}, {"isVegetarian": false, "title": "Lemon, pancetta and rosemary chicken", "url": "www_bbc_co_uk_food_recipes_lemonpancettarosemar_78339", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2kg/4lb 6oz oven-ready chicken, thawed if frozen, giblets removed", "1 small bunch fresh rosemary", "1 small bunch fresh thyme ", "2 lemons, finely zested ", "80g/3oz pancetta, chopped", "150g/5¼oz mascarpone", "salt and freshly ground black pepper", "2 onions, thickly sliced", "1 tbsp flour ", "100ml/3½fl oz white wine ", "600ml/1pt chicken stock ", "stuffing balls wrapped in bacon"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Wash the chicken and pat dry.  ", "Strip the leaves from half the rosemary and thyme stalks and finely chop.", "In a bowl, combine the lemon zest, chopped rosemary and thyme, pancetta and mascarpone.  Season to taste with salt and freshly ground black pepper.", "Halve the zested lemons and stuff into the chicken's cavity, along with the remaining herb sprigs.  ", "Use your hand to loosen the skin lying over the breast of the chicken, to create a pocket.  Push the mascarpone mixture under the breast skin to create a thick, even layer.", "Put the onion slices into a large, flameproof roasting tin. Place the chicken on top and cover loosely with foil.", "Cook for 1½-2 hours, basting every 30 minutes, until the juices of the bird run clear when the thigh is pierced with a skewer. If necessary, uncover for the last 30 minutes to brown the bird.", "When cooked, take the chicken from the oven, remove from the roasting tin and leave to rest on a platter, covered loosely with foil, for 30 minutes.", "To make the gravy, pour away any excess fat from the roasting tin and discard the onion slices. ", "Set in the roasting tin over a medium heat, then sprinkle over the flour.  Stir through and cook for two minutes.  ", "Slowly whisk in the wine and stock. ", "Bring to the boil, scraping the bits from the bottom of the roasting tin, then simmer over a low heat for 15 minutes.", "Serve the gravy with the chicken and stuffing balls wrapped in bacon."]}, {"isVegetarian": false, "title": "Lemon poached chicken with tomato salsa", "url": "www_bbc_co_uk_food_recipes_lemonpoachedchickenw_71671", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts", "1 stock cube", "1 red onion", "3 cloves garlic", "olive oil", "200g/7oz ripe cherry tomatoes (ideally a mix of red and yellow)", "small bunch of basil", "1 tbsp chopped thyme", "1 tbsp chopped sage", "2 lemons"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Poach the chicken breasts in boiling water with a stock cube and half a lemon for ten minutes. Leave in the hot stock until ready to serve.", "Meanwhile soften the red onion and two chopped cloves of garlic together in a little olive oil. ", "Add the tomatoes and cook for six or seven minutes. ", "When the tomatoes are warmed through, add another glug of olive oil, seasoning, and a small handful of shredded basil. ", "Make the marinade. Place the thyme, sage, the last clove of garlic and a few basil leaves into a blender with the juice of a lemon and equal amounts of olive oil.  Pulse for a few seconds.", "Just before serving, slice the hot chicken into five or six pieces, without cutting all the way through. Drain the poaching liquor and place the semi-sliced chicken back into the dry pan.  ", "Pour the lemon and herb marinade over the chicken and make sure it coats the chicken evenly.  Heat through.", "To serve, spoon the tomato sauce on the bottom of a dish, finish slicing the chicken and place on top.  Drizzle over the remaining marinade and sprinkle on some chopped basil."]}, {"isVegetarian": true, "title": "Lemon potatoes and asparagus", "url": "www_bbc_co_uk_food_recipes_lemonpotatoesandaspa_79828", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz new potatoes, bashed with rolling pin", "1 tbsp olive oil", "splash white wine", "1 tsp cumin seeds", "2 tbsp lemon juice", "1 bunch asparagus, ends trimmed", "1 free-range egg yolk", "2 tsp lemon juice", "25g/1oz butter, melted", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the potatoes, heat the oil in a pan over a high heat. Add the potatoes and sauté for five minutes, until browned.", "Add the wine, cumin seeds and lemon juice and simmer for two minutes.", "Cover with a lid and allow to cook through for 10-15 minutes.", "For the asparagus, heat a griddle pan until smoking. Add the asparagus and char-grill for 4-5 minutes, until cooked through.", "Place the egg yolk and the lemon juice in a bowl and whisk together. Add the melted butter and whisk together well, seasoning, to taste, with salt and freshly ground black pepper.", "To serve, place the potatoes into a serving bowl. Place the asparagus on a plate and drizzle with the hollandaise dressing."]}, {"isVegetarian": true, "title": "Lemon rice", "url": "www_bbc_co_uk_food_recipes_lemonrice_86737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonrice_86737_16x9.jpg", "ingredients": ["2½ tbsp vegetable oil", "½ tsp mustard seeds", "pinch fenugreek seeds", "1 tsp split chana dal (also called Bengal gram lentils)", "1 tsp split black gram (also called urad dal or black lentil)", "2-3 dried red chillies, left whole ", "1 rounded tsp chopped fresh ginger", "¼ tsp ground turmeric", "4 tbsp roasted peanuts", "10 curry leaves, torn in half", "salt, to taste", "3 tbsp lemon juice, or to taste", "350g/12oz freshly cooked basmati rice"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick frying pan and add the mustard and fenugreek seeds, the chana dal, black gram and the chillies and stir fry until lightly browned.", "Add the ginger, ground turmeric, peanuts, curry leaves and salt, to taste, and cook for about 40 seconds.", "Stir in the lemon juice and cook for another minute before adding the rice. Stir fry to heat through, being careful not to break up the grains too much.", "To serve, place the rice onto serving plates."]}, {"isVegetarian": true, "title": "Lemon, ricotta and potato cake", "url": "www_bbc_co_uk_food_recipes_lemonricottaandpotat_92836", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, plus extra for greasing", "350g/12¼oz caster sugar ", "250g/9oz mashed potato", "250g/9oz ricotta", "4 free-range eggs", "125g/4½oz flour", "1 tsp baking powder", "2 lemons, juice and grated zest", "pinch ground cinnamon", "1 tbsp poppy seeds", "crème fraîche, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 5. Grease a 24-26cm/9-10in loose-bottomed cake tin with butter. ", "Cream the butter and sugar together in a bowl until pale and fluffy.", "Whisk in the mashed potato and ricotta using an electric whisk for 4-5 minutes, or until very fluffy.", "Crack in the eggs, one at a time, and whisk again until fully incorporated into the mixture.", "Sift the flour and baking powder together, then fold the mixture into the cake batter until well combined.", "Fold in the lemon juice, lemon zest, cinnamon and poppy seeds until well combined.", "Spoon the cake batter into the prepared cake tin. Bake for 1-1¼ hours, checking regularly, until a skewer inserted into the centre of the cake comes out clean. (If the top of the cake starts to darken too much during cooking, cover it loosely with aluminium foil.)", "Set the cake aside to cool slightly, then serve with crème fraîche."]}, {"isVegetarian": false, "title": "Lemon roasted pork chops with a warm aubergine and potato salad", "url": "www_bbc_co_uk_food_recipes_lemonroastedporkchop_70890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp fennel seeds", "1 bulb fennel", "2 Cox's apples, finely chopped", "12 sage leaves, finely chopped", "juice and fruit of 1 lemon", "8 tbsp olive oil", "salt ", "freshly ground black pepper", "2 pork chops", "2 lemons cut into quarters", "2 tsp demerara sugar", "pinch of salt", "2 tsp olive oil", "2 aubergines, cut into wedges", "2 red or Maris Piper potatoes, cubed", "2 red onions", "2 small bunches basil", "2 red chillies", "2 cloves garlic", "2 tbsp red wine vinegar", "8 tbsp olive oil", "8 cherry tomatoes", "salt ", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Grind the fennel seeds. ", "Mix with finely chopped fennel, apple, sage, lemon and lemon juice. ", "Add oil, salt and freshly ground black pepper.", "Heat the oil. Add the wedges of aubergine. ", "Cook slowly, approximately four minutes.  ", "Place the cubed potatoes into a pan of boiling water and cook until soft, approximately eight minutes, and drain.", "Add chilli, garlic and onion to the aubergine, cook for three minutes and take off the heat. Place the hot potatoes in a mixing bowl with the vinegar, olive oil, basil and squashed cherry tomatoes. Pour over the aubergines and their juices. Mix.", "Grill the pork on both sides and then roast at 180C/350F/Gas 4 for ten minutes with the lemons.", "Serve with the salsa and the warm salad."]}, {"isVegetarian": false, "title": "Lemon sole goujons with mushy peas and sweet potato chips", "url": "www_bbc_co_uk_food_recipes_lemonsolegoujonswith_92441", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemonsolegoujonswith_92441_16x9.jpg", "ingredients": ["2 sweet potatoes, skin on, cut into wedges", "2 tbsp olive oil", "50g/1¾oz plain flour", "2 free-range eggs", "100g/3½oz fresh breadcrumbs", "½ tsp cayenne pepper", "½ lemon, zest only", "4 fillets lemon sole, skin removed, cut into 1cm/½in strips", "salt and freshly ground black pepper", "4 tbsp olive oil", "200g/7¼oz peas", "1 tbsp crème fraîche", "½ tsp ready-made mint sauce (or 1 tsp chopped fresh mint leaves)", "salt and freshly ground black pepper", "squeeze lemon juice, to taste", "3 tbsp ready-made mayonnaise", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the sweet potato wedges, place the sweet potato wedges into a large roasting tin, then drizzle over the oil, turning the sweet potato wedges to coat them all over. Roast in the oven for 25-30 minutes, turning halfway through cooking, until the sweet potato wedges are crisp and golden-brown and cooked through.", "Meanwhile, for the lemon sole goujons, sprinkle the flour onto a plate. Beat the eggs in a bowl. Mix together the breadcrumbs, cayenne pepper and lemon zest until well combined, then sprinkle the mixture onto a separate plate.", "Season the fish pieces, to taste, with salt and freshly ground black pepper. Dredge each piece of fish first in the flour, then dip it into the beaten egg, then roll it in the breadcrumbs until completely coated.", "Heat the oil in a frying pan over a medium heat until a breadcrumb sizzles and turns golden-brown when dipped into it. Add the coated fish pieces to the pan, in batches, and fry for 2-3 minutes each side until crisp, golden and cooked through. Remove the fried fish pieces from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining fish pieces. ", "Meanwhile, for the mushy peas, cook the peas in a pan of boiling, salted water for 3-4 minutes, or until just tender. Drain well and crush using a fork or potato masher.", "Stir the crème fraîche and mint sauce (or fresh mint) into the crushed peas and season, to taste, with salt and freshly ground black pepper. ", "For the lemon mayonnaise, stir the lemon juice into the mayonnaise until well combined. Season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the fried fish goujons equally among four serving plates. Spoon a dollop of lemon mayonnaise on top of each portion. Spoon the sweet potato wedges and mushy peas alongside."]}]