[{"ingredients": ["1 calabacín", "1 pimiento rojo Peppadew", "1 puñado de cilantro fresco, picado", "1 puñado de frijoles mezclados en lata, enjuagados y escurridos", "jugo de ½ limón", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "cucharadita de aceite de oliva", "3 rebanadas de queso halloumi"], "method": ["Usando un pelador, pele el calabacín en finas \"cintas\" para la ensalada. Coloque en un tazón.", "Agregue el cilantro, los frijoles mezclados, el jugo de limón y el aceite de oliva y mezcle bien. Sazone al gusto con sal y pimienta negra recién molida.", "En una sartén pequeña con un poco de aceite agregue las rebanadas de halloumi y cocine por 20 segundos en cada lado.", "Sirva la ensalada de calabacín y frijoles en un plato y coloque el halloumi frito en la parte superior."], "url": "www_bbc_co_uk_food_recipes_friedhalloumiwithcou_78478", "title": "Halloumi frito con ensalada de calabacín y frijol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de 30g / 1oz", "2 filetes de halibut, alrededor de 2.5 cm / 1 pulgada de espesor", "jugo de 1 limón", "aceite de oliva, para freír", "perejil picado", "cuñas de limón, para servir"], "method": ["Distribuye una gruesa capa de harina en un plato. Sumerja los filetes de halibut en el jugo de limón, luego en la harina en ambos lados.", "Freír el pescado hasta que esté firme y cocido, aproximadamente cinco minutos de cada lado.", "Servir caliente, esparcido con perejil y servido con grandes trozos de limón."], "url": "www_bbc_co_uk_food_recipes_friedhalibutsteaks_83811", "title": "Filetes de fletán frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "3 cebollas de ensalada", "sal y pimienta negra recién molida", "2 cucharadas de aceite de sésamo", "1 diente de ajo, picado", "pizca de copos de chile seco", "2 cebollas para ensaladas, finamente picadas", "2 berenjenas para bebés, en rodajas", "1 puñado de espinacas", "3 langostinos, picados", "Fideos de huevo de 150 g / 5½ onzas, cocidos de acuerdo con las instrucciones del paquete", "2 cucharadas de salsa de soja", "1 cucharada de semillas de sésamo"], "method": ["Para las cebollas para ensaladas, coloque las cebollas para ensaladas y el aceite de oliva en un tazón. Sazonar, al gusto, con sal y pimienta negra recién molida y mezclar.", "Caliente una sartén hasta que fume. Agregue las cebollas para ensaladas y la parrilla a la parrilla por dos minutos en cada lado, de modo que se formen marcas marrones en la plancha. Sáquelo del fuego y apártelo.", "Para los fideos, caliente el aceite de sésamo en un wok grande a fuego alto. Agregue el ajo, el chile, las cebollas de ensalada y la berenjena y saltee durante un minuto.", "Agregue las espinacas y las gambas y cocine por otros dos minutos, girando las gambas hasta la mitad de la cocción.", "Agregue los fideos, rocíe sobre la salsa de soja y mezcle.", "Para servir, coloque los fideos en un plato grande y caliente y espolvoree con semillas de sésamo. Coloque las cebollas de ensalada a la parrilla en la parte superior."], "url": "www_bbc_co_uk_food_recipes_friednoodlesprawnsan_80162", "title": "Fideos fritos, gambas y cebollas de ensalada a la parrilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin hueso, con hueso de ala", "6 cucharadas de hojas frescas de perifollo", "6 cucharadas de perejil de hojaldre, solo hojas", "3 cucharadas de queso parmesano recién rallado", "1 diente de ajo", "1 cucharadita de sal", "½ cucharadita de pimienta negra", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "75g / 3oz de mantequilla", "1 cucharada de aceite de oliva", "200ml / 7fl oz de vino tinto", "300ml / 11fl oz de caldo de pollo", "75g / 3oz de mantequilla", "1 chalote de plátano, finamente picado", "1 diente de ajo, finamente cortado en cubitos", "4 lonchas de tocino, cortadas en lardons", "Repollo acentuado de 400 g / 14oz, finamente triturado", "150g / 5oz de castañas cocidas, más o menos picadas", "200 ml / 7 fl oz de agua", "4 ramitas de perifollo fresco, para adornar"], "method": ["Precalentar el horno a 190C / 325F / Gas 5.", "Para el pollo, corte la carne alrededor del extremo del hueso del ala y empuje hacia el pecho, exponiendo el hueso. Con mucho cuidado, usando el talón del cuchillo, corte el pequeño nudillo en el extremo del hueso para dejar un hueso limpio y recto. Levante con cuidado la piel alejándola de la carne de la pechuga, comenzando por el extremo más alejado del hueso, pero dejándola intacta y aún unida en el extremo del hueso.", "Coloque el perifollo, el perejil, el parmesano, el ajo, la sal y los granos de pimienta en un mortero y machaque hasta que queden grumos. Agregue el aceite de oliva virgen extra y libra una vez más hasta lograr una pasta homogénea. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque la mezcla de hierbas en las pechugas de pollo, luego alise la piel para cubrir las hierbas.", "Caliente la mitad de la mantequilla y el aceite de oliva en una sartén a prueba de horno, agregue las pechugas de pollo, con la piel hacia abajo y fría durante dos minutos, hasta que la piel esté crujiente y dorada, luego voltéela y cocine por otro minuto. Transfiera al horno por 15 minutos, hasta que el pollo esté dorado y cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho). Retire y descanse durante cinco minutos.", "Caliente una sartén hasta que esté caliente, agregue el vino tinto y cocine hasta que el volumen del líquido se haya reducido en un tercio, luego agregue el caldo de pollo y cocínelo hasta que el volumen del líquido se haya reducido a la mitad. Agregue los jugos de pollo del pollo descansado, sazone al gusto con sal y pimienta negra recién molida y agregue la mantequilla restante.", "Para el repollo, caliente una sartén de lados profundos hasta que esté caliente, agregue la mitad de la mantequilla, la chalota y el ajo y el sudor durante 1-2 minutos. Agregue el tocino y cocine durante dos minutos hasta que comience a crujir. Agregue el repollo y las castañas, saltee durante 1 minuto y luego agregue el resto de la mantequilla y el agua. Llevar a ebullición, baje el fuego y cocine a fuego lento durante 4-5 minutos hasta que el repollo esté tierno y la salsa reducida un poco. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque la col en el centro de cada plato, corte cada pechuga de pollo en tres rebanadas y colóquelas en la parte superior del repollo. Coloque la salsa en el borde y adorne con una ramita de perifollo."], "url": "www_bbc_co_uk_food_recipes_friedherbstuffedchic_92613", "title": "Pollo relleno de hierbas fritas con repollo y castañas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, en rodajas", "150g / 5½ oz de chorizo, picado", "pequeño puñado de perejil, picado", "sal y pimienta negra recién molida", "2 rebanadas de ciabatta", "1 cucharada de aceite de oliva", "2 huevos de gallinas camperas, fritos"], "method": ["Caliente el aceite en una sartén pequeña a fuego medio. Agregue la cebolla y el chorizo ​​y fría por cuatro minutos, hasta que los jugos comiencen a correr desde el chorizo. Agregue el perejil y sazone con pimienta negra recién molida.", "Caliente una sartén a fuego alto. Rocíe la chapata con el aceite de oliva y la plancha en ambos lados durante dos minutos o hasta que estén dorados.", "Para servir, coloque la chapata a la parrilla en un plato de servir. Coloque el chorizo ​​y la cebolla en la parte superior, y luego cubra con los huevos fritos."], "url": "www_bbc_co_uk_food_recipes_friedonionchorizoand_84497", "title": "Cebolla frita, chorizo ​​y huevo sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de girasol, para engrasar", "100 g / 3½ oz de patatas hervidas, refrigeradas y trituradas", "2 espárragos frescos, cortados, picados", "1 cebolleta, cortada, picada", "2 tbsp colgados guisantes congelados", "5 hojas de menta fresca, rasgadas", "2 cucharadas de queso parmesano rallado", "2 huevos de gallinas camperas, golpeados", "pizca de pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6. Engrasar un plato a prueba de horno con un poco de aceite de girasol.", "En un tazón, mezcle los espárragos, la cebolla tierna y los guisantes. Agregue las hojas de menta y el parmesano hasta que estén bien combinados.", "Incline los huevos batidos en el recipiente y mezcle con cuidado. Sazonar con pimienta negra recién molida y mezclar nuevamente.", "Coloque la mezcla de frittata en el plato preparado a prueba de horno. Coloque el plato en una bandeja para hornear, luego transfiéralo al horno y hornee durante 15-20 minutos, o hasta que los huevos se hayan fraguado por completo y una brocheta insertada en el centro de la frittata salga limpia.", "Sirve con tomates cherry."], "url": "www_bbc_co_uk_food_recipes_frittata_34910", "title": "frittata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pequeño manojo de hojas de albahaca fresca", "2 cucharadas de piñones", "1 diente de ajo, pelado", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 cucharadas de puré de tomate", "100 ml / 3½ fl oz de caldo de pollo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 filete de lubina", "5 puerros bebé", "300 ml / ½ pinta de caldo de pollo", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para el pesto, mezcle todos los ingredientes del pesto en un procesador de alimentos con una pasta áspera. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa de tomate, caliente el puré de tomate en una cacerola hasta que se coloree. Agregue el caldo, lleve la mezcla a fuego lento y continúe cocinando a fuego lento hasta que la mezcla esté bien combinada y espesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la lubina, caliente el aceite de oliva en una sartén a fuego medio. Freír la lubina, con la piel hacia abajo, durante 3-4 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida. Voltee el filete de lubina y fríe por 3-4 minutos más, o hasta que la piel esté crujiente y dorada y el pescado esté bien cocido. Retire de la sartén y déjela reposar en un plato para servir.", "Para los puerros, ponga todos los ingredientes a ebullición en una cacerola. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y pique los puerros durante 8-10 minutos, o hasta que estén tiernos. Escurrir los puerros y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la salsa de tomate sobre la lubina frita. Sirva los puerros escalfados junto con una cucharada de pesto."], "url": "www_bbc_co_uk_food_recipes_friedseabasswithpoac_92839", "title": "Lubina frita con puerros escalfados, pesto y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "150 g / 5½ oz de harina de arroz", "Harina normal 150g / 5½ oz", "15g / ½ oz de pimentón ahumado", "Calamar preparado 400 g / 14 oz, limpiado", "400 g / 14oz de langostinos preparados, pelados y desvelados", "200g / 7oz prepararon mejillones, fregados y rellenos", "cuñas de limón, para servir", "sal y pimienta negra recién molida", "1 lima, ralladura solamente", "2 dientes de ajo, aplastados", "1 chile verde grande, sin semillas y finamente picado", "½ manojo de perejil fresco de flatleaf, finamente picado", "200g / 7oz de trigo bulgur, cocido en stock", "200g / 7oz de quinua, cocida en stock", "100 g / 3½ oz de lentejas negras, cocidas en stock", "55 g / 2 oz de soja, cocidos en stock", "85g / 3oz de col rizada, sin tallo y desmenuzado", "25 g / 1 oz de semillas de girasol", "1 cucharada de puré de ajo", "1 lima, solo jugo", "2 cucharaditas de tahini", "Cebollas de primavera 25g / 1oz, picadas", "25 g / 1 oz de perejil fresco de flatleaf, picado", "100ml / 3½fl oz de aceite de colza prensado en frío"], "method": ["Para el fritto misto, precaliente el aceite en una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un tazón grande, combine las harinas, el pimentón, la sal y la pimienta en un plato. Mezcle los mariscos en la mezcla de harina y colóquelos cuidadosamente en la freidora. Freír hasta que estén dorados, luego retirar cuidadosamente con una cuchara ranurada y escurrir sobre papel de cocina.", "Para la gremolata, mezcle todos los ingredientes en un tazón pequeño.", "Para la ensalada de súper alimento, combine todos los ingredientes en un tazón grande. Para el aderezo, rellene todos los ingredientes en una licuadora y revuelva bien a través de la ensalada.", "Sirve el fritto misto con las rodajas de limón, gremolata y ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_frito_misto_with_94137", "title": "Frito mezclado con chile-lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de oliva", "¼ de patata, en rodajas", "½ puerro, picado", "2 huevos de gallinas camperas, golpeados", "puñado de hojas de albahaca fresca"], "method": ["Calentar el aceite de oliva en una sartén. Agregue las papas y los puerros y saltee durante 4-5 minutos o hasta que estén blandos.", "Agregue los huevos y la albahaca y revuelva suavemente alrededor de la olla hasta que los huevos comiencen a asentarse.", "Con cuidado, voltee la frittata y cocine por un minuto más, o hasta que esté bien cocida.", "Transfiera a un plato calentado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_frittata_79389", "title": "Tortilla de patatas y puerros", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "1 cucharada de leche entera", "1 cucharada de crema doble", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva"], "method": ["En un tazón mezcle los huevos, la leche y la crema, luego sazone con sal y pimienta negra recién molida.", "Calentar el aceite en una sartén y verter la mezcla de huevo. Después de un minuto, dobla la tortilla desde un lado hacia el centro. Luego doble el borde superior hacia abajo.", "Para servir, coloca inmediatamente la tortilla en un plato."], "url": "www_bbc_co_uk_food_recipes_frittataomelette_84222", "title": "Tortilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de cilantro fresco picado", "150 g / 5¼ oz de garbanzos enlatados, enjuagados y escurridos", "75 g / 2½ oz de salmón ahumado en caliente", "1 diente de ajo, picado", "4 huevos de gallinas camperas, golpeados", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 tomates frescos, cortados a la mitad", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Vinagre de vino blanco 50ml / 2floz", "1 cucharadita de azúcar en polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Para la frittata, mezcle todos los ingredientes frittata, excepto el aceite de oliva, en un tazón y sazone con sal y pimienta negra recién molida.", "Caliente una cucharada de aceite de oliva en una sartén y agregue la mezcla de frittata. Cocine por dos minutos, o hasta que la mezcla se dore por debajo ..", "Calentar otra sartén, engrasada con el aceite de oliva restante, del mismo tamaño y colocar la sartén caliente para que quede encima del otro.", "Voltee la frittata de una bandeja a la otra para que el lado coloreado mire hacia arriba. Cocine por otros dos minutos, o hasta que estén dorados y cocidos.", "Para los tomates asados, coloque los tomates frescos a la mitad en una bandeja para hornear y sazone con sal y pimienta negra recién molida.", "Rocíe el aceite de oliva y el vinagre de vino blanco y espolvoree el azúcar sobre los tomates.", "Coloque en el horno y hornee durante cinco minutos.", "Sirva la frittata en un plato con los tomates asados ​​colocados encima."], "url": "www_bbc_co_uk_food_recipes_frittatawithroastedt_85847", "title": "Frittata con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "100 g / 3½ oz de patatas Anya, en rodajas finas a lo largo", "½ cebolla, pelada, finamente rebanada", "½ puerro, finamente cortado", "2 zanahorias baby, en rodajas", "4 yemas de huevo de gallinas camperas", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "gran cohete puñado, finamente picado", "1 diente de ajo, finamente picado", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida"], "method": ["Para la frittata, caliente el aceite de oliva en una sartén, agregue las papas y fría por 3-4 minutos. Agregue la cebolla, el puerro y la zanahoria y fría por 3-4 minutos o hasta que estén cocidos pero firmes.", "Batir las yemas de huevo con la crema doble y sazonar con sal y pimienta negra recién molida. Vierta sobre las verduras en la sartén y cocine hasta que la base esté lista. Voltee y cocine en el otro lado durante 2-3 minutos o hasta que se dore. Deslice en un plato y corte en cuñas.", "Para el pesto de rúcula, mezcle el cohete, el ajo, el aceite de oliva y el condimento en un tazón pequeño. Vierta el pesto sobre las rodajas de frittata. Servir."], "url": "www_bbc_co_uk_food_recipes_frittatawithrusticro_85276", "title": "Frittata con pesto rústico de rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza 110g / 4oz", "1 cucharada de bicarbonato de soda", "1 cucharada de hojuelas de chile", "agua con gas", "1 cucharada de aceite", "30 g / 1 oz de azúcar en polvo", "2 cucharadas de agua", "½ cucharadita de copos de chile", "3 cebollas tiernas, en rodajas finas", "1 cucharada de vinagre de vino blanco", "1 cucharada de cilantro molido"], "method": ["Para los buñuelos, coloque los ingredientes secos en un tazón y mezcle. Agregue suficiente agua con gas para hacer una masa espesa para panqueques.", "Caliente el aceite en una sartén a fuego alto, vierta cucharadas de la mezcla de buñuelos en la sartén y cocínelos durante 1-2 minutos por cada lado, hasta que estén dorados.", "Para la mermelada, derrita el azúcar en una olla pequeña con agua y guindilla, a fuego medio y cocine hasta que esté dorado.", "Agregue las cebollas de primavera, el vinagre y el cilantro y cocine a fuego lento durante dos minutos.", "Para servir, coloque los buñuelos en un plato para servir, y coloque la mermelada de chile en un costado."], "url": "www_bbc_co_uk_food_recipes_fritterswithchillian_84473", "title": "Buñuelos con chile y mermelada de cebolla de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón, solo jugo", "3 alcachofas violetas con tallos largos", "1 berenjena grande, finamente cortada", "1 manojo de espárragos, extremos leñosos eliminados", "2 cebollas dulces (como las cebolletas), en rodajas finas", "2 hongos portobello, cortados en rodajas de 1cm / ½", "6 pequeños calabacines con sus flores adjuntas, en rodajas", "aceite de girasol, para freír", "4 pequeñas hojas de acelga suiza", "6 hojas grandes de salvia", "sal marina y pimienta negra recién molida", "Harina de 300g / 10½oz tipo '00'", "4 cucharadas de aceite de oliva virgen extra", "250ml / 9fl oz de agua tibia", "1 huevo blanco de corral", "1 chile rojo, semillas retiradas y picadas", "2 cucharadas de menta fresca picada", "2-4 cucharadas de vinagre de Jerez", "1 limón, cáscara y jugo solamente", "Rodajas de limón"], "method": ["Llene un recipiente grande con agua y agregue el jugo de limón. Prepare las alcachofas de a una por vez. Retire las hojas exteriores duras para revelar el corazón interior pálido. Abra el corazón y, usando una cucharilla, saque el estrangulador peludo. Pela el tallo para quitar el duro exterior, dejando solo el núcleo sensible. Cortar el corazón de alcachofa verticalmente por la mitad, luego cortar el corazón y cortar en rodajas. Inmediatamente sumerja la alcachofa en el agua de limón para evitar que se ponga marrón.", "Para la mezcla, ponga la harina en un tazón grande y haga un pozo en el medio. Vierta el aceite en el pozo, luego mezcle con la harina mientras agrega lentamente el agua tibia. Mezcle hasta que la mezcla esté suave con la consistencia de crema doble.", "Coloque una sartén profunda que contenga aceite de girasol en el fuego hasta que el aceite esté a 180 ° C o, alternativamente, use una freidora de grasa. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Precaliente el horno a su configuración más baja.", "Escurra las alcachofas y séquelas con papel de cocina.", "En un recipiente de vidrio limpio y separado, bata la clara de huevo hasta obtener picos suaves. Con cuidado, dóblelo en la masa.", "Freír las verduras en tandas, cada tipo por separado (cocinar la acelga y las hojas de salvia juntas). Para hacer esto, sumerja las verduras en la mezcla y sacuda el exceso, luego fríelas en aceite caliente durante 3-4 minutos, o hasta que estén crujientes y doradas por todas partes. Escurra sobre papel de cocina y manténgalo caliente en el horno mientras cocina el próximo lote.", "Mezcle todos los ingredientes del aderezo en un tazón pequeño.", "Para servir, sazone las verduras fritas con sal y pimienta, rocíe el aderezo sobre la parte superior y sirva con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_fritto_misto_di_verdure_14523", "title": "Verduras mixtas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de grosellas negras congeladas", "100 g / 3½ oz de moras congeladas", "75 g / 2½ oz de azúcar en polvo", "2 cucharadas de crème de cassis", "3 hojas de gelatina, empapadas en agua fría hasta que se suavicen, luego escurridas", "500 g / 1 libra 2 oz de bayas mixtas congeladas", "3 cucharadas de crème de cassis", "4 hojas de gelatina, empapadas en agua fría hasta que se suavicen, luego escurridas", "150 g / 5½ oz de azúcar en polvo", "2 claras de huevo de gallinas camperas", "300ml / 10½ fl oz crema doble", "23cm / 9en caja de esponja lista para usar", "2 higos maduros, cortados en cuartos", "pequeñas frambuesas frescas", "pequeñas ramitas de menta fresca"], "method": ["Para la gelatina, caliente las grosellas negras, las moras, el azúcar, 50 ml / 2 fl oz de agua y la crema de cassis en una sartén hasta que hierva. Reduzca el fuego hasta que hierva a fuego lento, luego cocine a fuego lento durante 1-2 minutos sin remover.", "Cuele la mezcla a través de un colador forrado con muselina, cogiendo el jugo colado en una sartén limpia. Incline la fruta cocida nuevamente dentro de la olla original.", "Caliente el jugo filtrado a fuego medio, luego mezcle la gelatina hasta que se derrita. Dejar de lado para enfriar.", "Para la mousse de grosella negra, agregue las bayas mixtas congeladas a la sartén de bayas cocidas, vierta más de 50 ml / 2 fl oz de agua y lleve la mezcla a ebullición. Cocine por 2-3 minutos, machacando la fruta en la sartén mientras se cocina. Agregue 2 cucharadas de casis.", "Transfiera la mezcla a un procesador de alimentos y mezcle hasta obtener un puré fino. Cuele el puré a través de un colador fino en una olla limpia, presionando la fruta a través del colador con el dorso de una cuchara.", "Regrese la mezcla colada al fuego y agregue la gelatina hasta que se disuelva. Dejar de lado hasta que esté completamente frío, luego enfríe en la nevera, tapado, hasta que se necesite.", "Caliente el azúcar y 50 ml / 2 fl oz de agua en una sartén hasta que el azúcar se haya disuelto y la mezcla esté hirviendo. Continúe hirviendo el jarabe hasta que su temperatura alcance 118C / 235F (esto se llama etapa de bola blanda). Use un termómetro de azúcar para probar la temperatura.", "Batir las claras de huevo hasta que se formen picos suaves cuando se quita el batidor. Poco a poco vierta el jarabe de azúcar caliente sobre las claras de huevo en una corriente fina pero constante, batiendo continuamente, hasta que se haya incorporado todo el jarabe (asegúrese de que el jarabe no golpee los batidores ya que puede salpicarlo). Continúe batiendo durante 1-2 minutos más, para enfriar la mezcla ligeramente.", "En un recipiente aparte, bata la crema doble hasta que se formen picos suaves cuando se quite la batidora.", "Batir el puré de fruta en la mezcla de clara de huevo, luego batir con la crema doble.", "Use un anillo de metal para cocineros de 20-22 cm / 8-8½ pulgadas para cortar el centro de la caja de flan. Corta la esponja por la mitad horizontalmente para crear dos discos de esponja más delgados. Reserve o congele uno para usar en otra receta.", "Coloque el anillo de los chefs en un plato para servir o en un soporte para pasteles y coloque un disco de esponja dentro. Rocíe sobre la cassis restante, luego vierta la mezcla de mousse de grosella negra en el interior, casi pero no del todo hasta la parte superior. Enfriar en la nevera durante al menos 1 hora, o hasta que la espuma se haya fijado lo suficiente como para soportar una capa de gelatina.", "Vierta la gelatina en la parte superior de la torta para formar una capa delgada. Regrese a la nevera por otras 2 horas hasta que esté firme.", "Decora la parte superior de la torta con higos, frambuesas y ramitas de menta. Cuando esté listo para servir, pase una toalla caliente o sople brevemente la antorcha alrededor del borde del anillo de los chefs para aflojarlo, luego retírelo."], "url": "www_bbc_co_uk_food_recipes_frozen_berry_delice_42196", "title": "Festive baya delice", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_berry_delice_42196_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 4 oz mezcla de bayas (por ejemplo, fresas, frambuesas, arándanos, grosellas negras), castrado, más extra para decorar", "400 g / 14 oz de azúcar en polvo", "1 limón, solo jugo", "4 claras de huevo de gallinas camperas", "80ml / 3fl oz crema batida"], "method": ["Mezcle las bayas con 150 g / 5½ oz del azúcar en una licuadora, luego pase a través de un colador fino y agregue el jugo de limón al gusto.", "Prepare 10 x 9x6cm / 3½x2⅓ en platos de soufflé individuales atando un trozo de papel antigrasa alrededor de los bordes para formar un collar que se encuentra a 5cm / 2 pulgadas por encima del borde.", "Disuelva los 250 g / 9 oz restantes de azúcar en 250 ml / 9 fl oz de agua en una cacerola a fuego lento. Cuando el azúcar se haya disuelto por completo, hágalo hervir, quite la espuma y cocínelo a 120 ° C, testeándolo con un termómetro de azúcar.", "Batir las claras de huevo hasta que estén espumosas en un mezclador de pie, luego verter el azúcar caliente directamente sobre los blancos mientras se bate, evitando los batidores. Continúa batiendo hasta que el merengue esté bien.", "Batir la crema hasta que se formen picos suaves. Dóblalo en el merengue junto con el puré de bayas. Cuchara en los platos soufflé preparados. Cubra y congele durante 12 horas.", "Retire los collares y decore con bayas frescas para servir."], "url": "www_bbc_co_uk_food_recipes_frozen_berry_souffl_73644", "title": "Soufflé de bayas congeladas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275g / 9¾oz de mantequilla sin sal, ablandada", "275g / 9¾oz azúcar moreno claro", "225g / 8oz de azúcar granulada", "2 huevos grandes de gallinas camperas", "1 cucharada de extracto de vainilla", "475g / 1lb 1 oz de harina común", "2 cucharaditas de polvo de hornear", "300 g / 10½ oz de chocolate con leche de buena calidad, picado en trozos", "sal marina"], "method": ["Pon la mantequilla y azúcares en un tazón grande. Batir con un batidor de mano eléctrico hasta que quede suave y de color claro.", "Rompa los huevos de a uno por vez, mezclándolos a medida que rompe en cada huevo. Una vez que los huevos se combinan, agregue el extracto de vainilla.", "Tamice la harina y el polvo de hornear y mezcle con una cuchara de madera hasta que esté completamente incorporado. Agregue los trozos de chocolate y mezcle hasta que estén bien combinados. Divide la masa por la mitad.", "Coloque cada mitad en una hoja grande de película adhesiva. Enrolla la masa en forma de salchicha ancha y envuelve la película adhesiva, girando los extremos para sellar. Cada salchicha hará nueve galletas grandes (pero puedes hacerlas más pequeñas y hacer más). Las salchichas de masa se pueden congelar en este punto. Sin embargo, si desea hornearlos de inmediato, deje enfriar la masa en la nevera durante 30 minutos antes de usar.", "Una vez que esté listo para usar la masa para galletas, retírela del congelador y deje que se caliente lo suficiente para cortarla. Precalentar el horno a 180C / 350F / Gas 4.", "Corte la salchicha de masa en nueve discos y colóquela en una bandeja para hornear antiadherente o en una bandeja que haya sido forrada con papel para hornear.", "Espolvoree cada galleta con una pizca de sal y hornee en el horno precalentado durante 20 minutos, o hasta que estén doradas en el borde y ligeramente más pálidas en el centro.", "Retire del horno y transfiera a una rejilla de alambre para que se enfríe antes de servir."], "url": "www_bbc_co_uk_food_recipes_frozen_chocolate_chip_95194", "title": "Galletas de chocolate congeladas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 18 galletas muy grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_chocolate_chip_95194_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 plátanos congelados en rodajas", "1 puñado de menta fresca", "250g / 9oz de guisantes congelados", "½ lima, solo jugo", "2 cucharadas de jarabe de agave", "5 gotas de esencia de regaliz, o una pizca de regaliz en polvo"], "method": ["Mezcle todos los ingredientes en un procesador de alimentos hasta que quede suave.", "Servir inmediatamente en vasos o cuencos."], "url": "www_bbc_co_uk_food_recipes_frozen_pea_ice_cream_30393", "title": "Helado de guisantes congelado con plátanos y menta", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150ml / ¼ de pinta vertiendo crema doble", "150ml / ¼ de pinta de flor de saúco cordial", "bayas de verano, para servir", "un polvo de azúcar glas"], "method": ["Coloque la crema en un tazón y bátalo hasta que forme picos suaves, luego vierta gradualmente el cordial de flor de saúco, batiendo hasta que se combinen.", "Congele en una tina de plástico hasta que esté completamente congelado. Coja en un procesador de alimentos y mezcle para eliminar los cristales de hielo", "Transfiera a vasos de postre muy pequeños o vasos de Martini durante al menos tres horas o durante la noche en el congelador.", "Para servir, colóquelo en el refrigerador por 15-20 minutos para que se ablande un poco, luego sirva cada vaso con algunas bayas de verano y decore con un poco de azúcar en polvo."], "url": "www_bbc_co_uk_food_recipes_frozen_elderflower_07251", "title": "Posset congelado de flor de saúco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/frozen_elderflower_07251_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fresas de 450g / 14oz (mis favoritos son Buddy, Gariguette, Royal Sovereign o Mara des Bois), sin tallos", "1 cucharadita de stevia en polvo", "una pizca de jugo de limón", "Fresas de 200g / 7oz (Buddy, Gariguette, Royal Sovereign o Mara des Bois), cortadas en dados pequeños", "gran pizca de polvo de stevia", "100 g / 3½ oz crema batida", "gran pizca de polvo de stevia", "½ cucharadita de puré de vainilla o extracto de vainilla de buena calidad", "50g / 1¾oz de merengues en miniatura, aplastar 4-6 de ellos", "100 g / 3½ oz de mermelada de fresa baja en azúcar", "4 ramitas de menta", "6 fresas, cortadas a la mitad"], "method": ["Tome cuatro anillos de repostería de 7,5 cm / 3 pulgadas y estire firmemente la película adhesiva sobre la parte superior de cada uno, luego délos vuelta; estos se convertirán en los marcos para las tartas. Cubra una bandeja con papel antigrasa, coloque los anillos de repostería en la bandeja con la película adhesiva en la parte inferior, cubra el interior con el plástico de acetato y transfiéralo al congelador.", "Para el sorbete, en un tazón grande macerar las fresas con la stevia y el jugo de limón durante 30 minutos. Macerar las fresas dará al sorbete mucho más sabor.", "Mezcle las fresas con un puré. Reserve 150 g / 5 oz del puré y vierta el resto en una botella de plástico. Exprime el puré en la parte inferior de cada anillo de pastelería congelado hasta que tengas una capa de 5 mm que cubra la parte inferior. Regrese la bandeja al congelador y congélela durante 30 minutos o hasta que se solidifique.", "Retire del congelador y coloque un anillo de repostería de 6 cm / 2½ en el centro de la parte superior de cada círculo de puré congelado. Presione suavemente hacia abajo para que solo sangre la base. Exprime más puré en el espacio entre los dos anillos, para crear una pared de 2cm / ¾ de alto.", "Vuelva a colocar en el congelador y deje que se congele durante al menos 2 horas o hasta que se solidifique. (Los pasos hasta esta etapa se pueden hacer unos días antes). Coloque 4 platos para servir en el congelador 1 hora antes de servirlos.", "Para el relleno de tarta, en un recipiente macerar las fresas con la stevia durante 30 minutos.", "Mientras tanto, haga la crema Chantilly batiendo la crema con la stevia y el puré o extracto de vainilla, hasta que se formen picos firmes cuando se quite la batidora. (¡Cuidado, si sobrepasas la crema, se separará y crearás mantequilla!)", "Mezcle 100 g / 3½ oz del puré reservado con las fresas maceradas. Dobla la mitad de las fresas maceradas a través de la crema de Chantilly. Reserve la otra mitad para decorar.", "Saque un sorbete del congelador. Retire el anillo de repostería interior frotando con los dedos alrededor del interior para suavizar ligeramente el sorbete que está detrás y permita levantar suavemente el anillo. Ahora levante el anillo exterior de repostería y retire suavemente el acetato que rodea el sorbete. Regrese cada caja de sorbete a una bandeja para hornear en el congelador mientras repite este proceso para los sorbetes restantes.", "Cuando esté listo para servir, quite las placas del congelador y coloque una pequeña cantidad del merengue aplastado en el centro de cada plato para evitar que las tartas se deslicen, luego cubra con una caja de sorbete congelada.", "Coloque una cucharada de mermelada en el fondo de cada caja de sorbete, seguido de la mezcla de crema de fresa y Chantilly. Termine cada tarta con una cucharada de las fresas maceradas reservadas, seguidas de algunos merengues enteros y hojas de menta. Rocíe el puré reservado restante alrededor de cada tarta, coloque algunas fresas a la mitad en los platos y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_frozen_strawberry_60846", "title": "Tartaletas de fresas congeladas con crema batida de vainilla y merengue", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]