[{"isVegetarian": false, "title": "Tea-smoked haddock with herb gnocchi", "url": "www_bbc_co_uk_food_recipes_teasmokedhaddockwith_84034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tea bags, split, tea removed, bags discarded", "55g/2oz soft brown sugar", "55g/2oz long grain rice", "300g/11oz undyed haddock", "75g/3oz butter", "75ml/3fl oz water", "110g/4oz plain flour", "55g/2oz runner beans, blanched and very finely chopped", "2 free-range eggs", "1 tbsp roughly chopped, fresh basil", "1 tbsp roughly chopped, fresh parsley", "1 tbsp chopped, fresh chives", "150ml/6fl oz fish stock", "75ml/3fl oz double cream", "55g/2oz green beans, blanched and chopped", "1 tomato, finely chopped", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock, mix together the tea, sugar and rice in a bowl.", "Line a large, wide, deep saucepan with foil and add the rice mixture.", "Place another sheet of foil over the tea mixture and place the fish on top. Put a lid on the saucepan. Place on a high heat and cook for ten minutes, until cooked through. NB: Tea-smoking gnerates a lot of smoke. Be sure that you open the windows and get as much ventilation as you can. ", "For the gnocchi, place the butter and water into a saucepan and bring to the boil, then add the flour, beating with a wooden spoon until smooth, then remove from the heat.", "Transfer the gnocchi mixture to a clean bowl and add the eggs, herbs and beans, stiring throughly to combine.", "Spoon the gnocchi mixture into a piping bag and pipe out onto a clean, floured surface into a  long sausage. Then cut into 5cm/2in pieces..", "Fill a saucepan with boiling water and add some salt. Once the water is boiling add the gnocchi and cook for five minutes, or until it is floating on the surface, then remove with a slotted spoon, and drain on kitchen paper.", "Meanwhile, for the sauce, mix the stock and cream together in a saucepan and simmer till the liquid has reduced by half. Add the chopped beans and diced tomato to the sauce, to taste, and season with salt and freshly ground black pepper.", "To serve, stir the gnocchi into the sauce and pour onto a serving plate. Carefully remove the haddock and place on top."]}, {"isVegetarian": false, "title": "Tempura squid and prawns with coriander salsa", "url": "www_bbc_co_uk_food_recipes_tempura_squid_and_prawns_97646", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for deep-fat frying", "500g/1lb 2oz squid, cleaned, cut into strips", "500g/1lb 2oz raw king prawns, shelled", "2 tbsp light soy sauce", "2 tbsp Shaoxing rice wine or dry sherry", "2 tbsp sesame oil", "2 limes", "100g/3½ oz cornflour", "3 spring onions, finely sliced", "1 long red chilli, roughly chopped", "1 small handful coriander leaves, roughly chopped", "1 small handful mint leaves, roughly chopped", "1 garlic clove, sliced", "1 long red chilli, sliced", "2 tbsp palm sugar", "1 tbsp fish sauce", "1 tbsp soy sauce", "1 tbsp sesame oil", "1 tbsp Shaoxing rice wine or dry sherry", "1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep heavy-bottomed pan until a breadcrumb sizzles and turns brown when dropped into it. Alternatively use a deep-fat fryer and heat to 180C/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Put the squid and prawns into a bowl and mix them well with the soy sauce, Shaoxing rice wine (or dry sherry), sesame oil and the juice of one lime,  then set aside while you make the salsa.", "For the salsa, put half the herbs and all the other ingredients for the salsa into a small food processor and blend to a fine purée.", "To make the tempura batter, add the cornflour to the squid and prawns and mix well to coat – it will be very sticky.", "Carefully place the seafood into the fat in batches and fry for two minutes, or until just cooked through and crisp. Remove with a slotted spoon and drain on a plate lined with kitchen paper.", "To serve, put the fried tempura onto a platter then drizzle over the dressing, scatter over the reserved herbs and finish with the spring onions and chopped chilli.", "Cut the remaining lime into wedges and place alongside."]}, {"isVegetarian": false, "title": "Tempura tiger prawns with velvety chilli and ginger-infused bisque", "url": "www_bbc_co_uk_food_recipes_tempura_tiger_prawns_73225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for frying", "2 carrots, chopped", "1 leek, chopped", "2 sticks celery, chopped", "1 red chilli, sliced", "5cm/2in piece fresh root ginger, peeled and sliced", "2 tbsp tomato purée", "few sprigs fresh thyme", "2 bay leaves", "few sprigs fresh tarragon", "prawn shells and heads (reserved from prawns listed below)", "1kg/2lb 4oz fish bones, cleaned", "splash of cognac", "400ml/14fl oz white wine", "400-600ml/14-20fl oz cream (to taste)", "salt and freshly ground black pepper", "100g/3½oz plain flour", "50g/1¾oz cornflour", "pinch salt", "sparkling water", "small handful ice ", "8 whole tiger prawns (peeled, shells and head reserved for the bisque, then butterflied)", "vegetable oil, for deep-fat frying", "handful sliced spring onion, placed in a bowl of iced water to curl ", "chopped coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the bisque, heat two tablespoons of vegetable oil in a large pan and fry the carrots, leek and celery for a few minutes to soften. ", "Add the chilli and ginger and stir in the tomato purée, thyme, bay and tarragon and continue to cook for 1-2 minutes. ", "Add the prawn shells and heads and cook in the pan until golden-brown. Add the fish bones and then pour in the cognac and white wine and stir to deglaze. ", "Pour in enough water to cover the bones, bring to the boil and then reduce the heat and allow to simmer gently for an hour. ", "Allow the bisque to cool slightly, then blend using a hand blender. Strain into a clean pan. Cook to reduce the volume of liquid for a further 30 minutes, or until reduced by a third. ", "Stir in the cream to taste and season to taste with salt and freshly ground black pepper. ", "To make the tempura, mix the flour, cornflour and salt in a large bowl. Gradually whisk in the sparkling water to form a smooth batter. Set aside for 20-30 minutes. ", "Heat a deep-fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) ", "Dip the prawns into the batter and then deep fry in the hot oil for 1-2 minutes, or until golden-brown and cooked through.", "To serve, arrange the prawns on serving plates and garnish with slices of spring onion. Spoon the bisque into a serving dishes alongside and serve scattered with chopped coriander. "]}, {"isVegetarian": true, "title": "Tempura vegetables with yuzu dressing", "url": "www_bbc_co_uk_food_recipes_tempura_vegetables_with_43426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾ plain flour", "50g/1¾ cornflour", "pinch salt", "150ml/5fl oz sparkling water", "1 courgette, cut into 8cm/3¾in batons", "100g/3½oz purple sprouting broccoli, cut into florets ", "1 red onion, peeled and cut into petals", "100g/3½oz mangetout", "1 carrot, cut into chunks and blanched", "4 free-range egg yolks", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "500ml/18fl oz rapeseed or light olive oil", "1-2 tsp yuzu juice, to taste", "2 tbsp chilli dipping sauce", "salt and freshly ground black pepper", "4 spring onions, thinly sliced", "1 red chilli, cut into julienne", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tempura vegetables, heat a deep fat fryer to 180C/350F. (CAUTION: hot oil can be dangerous do not leave unattended.)", "Mix the flour, cornflour and salt in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all of the water).", "Dip the vegetables into the batter and carefully lower into the hot oil. Fry for 1-2 minutes on each side, or until crisp and golden-brown on both sides. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper.", "For the yuzu dressing, place the egg yolks, vinegar and mustard into a food processor. Blend to combine then, with the motor still running, gradually add the oil.", "Continue blending until all the oil has been added and the mayonnaise has thickened. Season with the yuzu juice, chilli dipping sauce, salt and freshly ground black pepper, to taste.", "To serve, place the vegetables on a serving plate with the yuzu dressing in a dipping bowl. Garnish the vegetables with spring onions, chilli and coriander cress."]}, {"isVegetarian": false, "title": "Tempura chicken and courgettes with tomato chilli dip", "url": "www_bbc_co_uk_food_recipes_tempurachickenandcou_89136", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 ice cubes", "150g/5½oz self-raising flour", "200ml/7fl oz cold sparkling water", "salt and freshly ground black pepper", "300ml/10½fl oz vegetable oil, for deep-frying", "½ chicken breast, skin removed, thinly sliced", "1 courgette, cut into batons", "200ml/7fl oz passata", "1 tsp dried chilli flakes", "1 tsp caster sugar", "1 tbsp lime juice", "small handful fresh basil, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the tempura, place the ice cubes and flour into a large bowl and then gently whisk in enough water to make a thick batter with the consistency of double cream. (You may not need all of the water.) Season with salt and freshly ground black pepper. ", "Pour the vegetable oil into a large saucepan or deep-fat fryer and heat until a small cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the chicken pieces and courgette batons into the batter, then carefully lower into the hot oil in small batches. Deep-fry for 3-4 minutes, or until golden-brown and the chicken is cooked through. Remove with a slotted spoon and drain on kitchen paper.", "For the dip, place all of the dip ingredients into a small saucepan and simmer gently for 4-5 minutes, stirring occasionally, or until thickened slightly. Pour into a small bowl for dipping.", "To serve, pile the tempura onto a serving plate and serve with the tomato chilli dip on the side."]}, {"isVegetarian": true, "title": "Tempura bananas with white and dark chocolate mousse and Space Dust", "url": "www_bbc_co_uk_food_recipes_tempurabananaswithwh_86294", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "25g/1oz plain flour", "25g/1oz cornflour", "pinch sugar", "75-110ml/3-4fl oz sparkling water", "4 bananas, peeled and split lengthways ", "200g/7oz dark chocolate, roughly chopped", "400g/14oz white chocolate, roughly chopped", "570ml/1 pint double cream", "4 tbsp hazelnuts, shelled, finely chopped", "4 tbsp Space Dust, or similar confectionery"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tempura bananas, pour in enough vegetable oil to come two-thirds of the way up the sides of a deep, heavy-bottomed frying pan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the flour, cornflour and sugar into a bowl and gently whisk in enough sparkling water to make a thick batter - it doesn't matter if it isn't completely smooth.", "Dip the bananas into the batter to coat completely, shaking off any excess, then place into the hot oil. Fry the bananas until golden-brown and crisp. Remove from the pan with a slotted spoon and drain on kitchen paper.", "For the mousse, place the dark chocolate and white chocolate into separate heatproof bowls set over pans of gently simmering water and heat, stirring occasionally, until smooth and melted.", "Meanwhile, lightly whip the cream until soft peaks form when the whisk is removed.", "Gently fold two-thirds of the cream into the melted dark chocolate until well combined, then spoon into a piping bag and set aside.", "Repeat with the remaining cream and the white chocolate and spoon into another piping bag.", "Place four 5cm/2in chefs' rings onto a large plate lined with greaseproof paper. Pipe a layer of the dark chocolate mixture, followed by the white chocolate mixture into each ring. Repeat until the rings are full, then smooth the tops using a palette knife. Place into the fridge to set for 1-2 hours.", "To serve, remove the mousses from the fridge and remove the greaseproof paper. Press the base of each ring into the chopped hazelnuts to coat, then place onto serving plates. Carefully lift off the chefs' rings and place two pieces of banana onto each plate. Sprinkle the Space Dust over the top of each mousse."]}, {"isVegetarian": false, "title": "Tempura prawns with mango, pepper and chilli salsa", "url": "www_bbc_co_uk_food_recipes_tempuraprawnswithman_88647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "115g/4oz plain flour", "125ml/4fl oz beer", "4 ice cubes", "4 king prawns, shells removed, de-veined", "½ mango, finely chopped", "½ red pepper, finely chopped", "4 spring onions, finely chopped", "1 lime, juice only", "1 tsp caster sugar", "½ tsp chilli flakes", "2 tbsp chopped fresh mint", "2 tbsp chopped fresh coriander", "chopped fresh coriander", "lime wedges"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the tempura prawns, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the flour and beer into a bowl and whisk well until the batter is the consistency of single cream, adding more or less beer as necessary. Add the ice cubes and stir well.", "Dip the prawns in the batter and then carefully place into the hot oil. Deep fry until golden-brown and cooked through. Remove with a slotted spoon and drain on kitchen paper.", "For the mango salsa, place all the salsa ingredients into a bowl and mix well.", "Serve the prawns on a plate with a bowl of the mango salsa to the side. Garnish with fresh coriander and lime wedges."]}, {"isVegetarian": true, "title": "Ten-minute tomato soup", "url": "www_bbc_co_uk_food_recipes_ten-minute_tomato_soup_10252", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ten-minute_tomato_soup_10252_16x9.jpg", "ingredients": ["6 sun-dried tomatoes in oil", "2 garlic cloves, crushed ", "3 x 400g tin chopped tomatoes", "500ml/18fl oz chicken or vegetable stock", "1 tbsp caster sugar", "150ml/5fl oz full-fat milk", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "3–4 tsp basil pesto, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Set a large, deep pan over a medium heat and add 1 tablespoon of oil from the sun-dried tomatoes. Add the garlic and stir-fry for a few seconds, or until it just starts to colour.", "Add the sun-dried and tinned tomatoes, stock and sugar and bring to the boil, stirring constantly. Season with salt and freshly ground black pepper, then cover with a lid, reduce the heat and simmer for 10 minutes.", "Remove from the heat and, using a hand blender, blend the soup in the pan. Stir in the milk and cream and season with salt and freshly ground black pepper before heating through on the hob.", "Serve hot with ½ teaspoon basil pesto swirled on the top of each bowl of soup."]}, {"isVegetarian": true, "title": "Tequila chillies", "url": "www_bbc_co_uk_food_recipes_tequila_chillies_40712", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tequila_chillies_40712_16x9.jpg", "ingredients": ["8 mild or spicy green chillies", "3 tbsp silver tequila ", "1 tbsp double cream", "350g/12oz white chocolate, chopped", "½ lime, zest and a squeeze of juice only", "25g/1oz unsalted butter, chopped", "1 tsp flaked sea salt"], "serves": "Makes 8 chocolate-filled chillies", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Cut a slit lengthways down the middle of each chilli and carefully take out the seeds. (You may want to wear rubber gloves for this.) ", "Put the chillies in a sealable container and add two tablespoons of the tequila. Leave to soak for 48 hours. The soaking takes the sting out of the chillies.", "Heat 5cm/2in water in a pan. Put a heatproof bowl on top of the pan, making sure the bottom of the bowl is not touching the water. Place the cream and 50g/1¾oz white chocolate in the bowl. Place over a gentle heat to allow the chocolate to melt. ", "Take the bowl off the heat and add the remaining tablespoon of tequila, the lime zest and juice and the butter. Whisk everything until it becomes a smooth ganache, pour into a sealable container, then chill overnight to set. ", "When you are ready to fill the chillies, take a teaspoon and scoop up about half a teaspoon of ganache and stuff it into the chillies. Put them into the fridge to chill. ", "To temper the remaining white chocolate, put the chocolate in a bowl set over a pan of gently simmering water, ensuring the base of the bowl doesn’t touch the water or the chocolate will burn. Take care also to not let any water into the chocolate or the chocolate will seize. Using a chocolate thermometer bring it up to 42C/107F, then take the bowl off the heat and allow to cool down to 27C/81F.", "Dip each chilli in the chocolate to cover, then sprinkle each with a little sea salt. Set them aside on a baking sheet covered with baking parchment, and leave in the fridge to set. Serve them whole or cut into slices."]}, {"isVegetarian": true, "title": "Tequila sunrise", "url": "www_bbc_co_uk_food_recipes_tequilasunrise_86526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz tequila ", "fresh orange juice, to top up ", "1 tbsp grenadine ", "orange slice ", "1 maraschino cherry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the tequila into a highball glass filled with ice and top up with fresh orange juice. Pour the grenadine in down the side of the glass so that it sinks to the bottom.", "To serve, garnish with an orange slice and a maraschino cherry."]}, {"isVegetarian": false, "title": "Tennis cake", "url": "www_bbc_co_uk_food_recipes_tennis_cake_09325", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tennis_cake_09325_16x9.jpg", "ingredients": ["350g/12oz red or natural glacé cherries, cut into quarters", "1 x 225g tin pineapple in natural juice, drained and roughly chopped", "350g/12oz ready-to-eat dried apricots, chopped", "100g/3½oz blanched almonds, roughly chopped ", "350g/12oz sultanas", "2 lemons, finely grated zest only", "250g/9oz unsalted butter, softened ", "250g/9oz caster sugar", "5 large free-range eggs, lightly beaten", "250g/9oz self-raising flour", "75g/2½oz ground almonds", "250g/9oz ground almonds", "150g/5½oz caster sugar", "150g/5½oz icing sugar, sifted, plus extra for rolling", "1 free-range egg (preferably pasteurised)", "1 tsp almond essence", "3 egg whites (preferably pasteurised)", "675g/1lb 8oz icing sugar, sifted", "gel food colouring in dusky pink and autumn leaf", "4 leaves gelatine", "4 tbsp liquid glucose", "1½ tsp glycerine", "500g/1lb 2oz icing sugar", "gel food colouring in mint green "], "serves": "Makes 1 large cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Grease a 23x15cm/9x6in rectangular cake tin. Line the base and sides with a double layer of baking parchment.", "Put the cherries in a sieve and rinse under running water then drain well. Dry the pineapple and cherries very thoroughly using kitchen paper. ", "Place all the fruits and nuts in a bowl with the lemon zest and gently mix together.", "In a separate bowl, cream the butter and sugar together until pale and fluffy. Beat in the eggs one at a time, with a spoonful of flour to prevent the mixture curdling. Fold in the remaining flour and ground almonds. Lightly fold in the fruit and nuts then pour the mixture into the prepared cake tin. Level the surface.", "Bake for 2 hours, or until golden-brown and a skewer inserted into the centre of the cake comes out clean. Cover the cake loosely with aluminum foil after 1 hour to prevent the top becoming too dark.", "Leave to cool in the tin for 15 minutes then turn out, peel off the parchment and finish cooling on a wire rack. ", "For the almond paste, mix the ground almonds, caster sugar and icing sugar in a bowl. Stir in the egg and almond essence. Knead in the bowl to form a stiff paste but don’t over-knead as this will make the paste oily. Wrap in cling film and set aside.", "For the royal icing, whisk the egg whites in a large bowl until they become frothy. Mix in the sifted icing sugar a tablespoonful at a time. You can do this with a hand-held electric whisk but keep the speed low. Beat the icing until it is very stiff and white and stands up in peaks. Cover the surface of the icing with cling film.  ", "For the fondant, place the gelatine, 2 tablespoons water, glucose and glycerine in a bowl set over a pan of gently simmering water and heat until the gelatine has dissolved (do not allow the water to boil or the gelatine to get too hot). Remove from the heat. ", "Sieve half of the icing sugar into a large bowl. Make a well in the centre, add the gelatine mixture and using a wooden spoon mix together. Sieve the remaining sugar onto the work surface and tip the mixture onto it. Knead together until the fondant is smooth and pliable. Reserve a thumb size piece of the white fondant and wrap in clingfilm.  Little by little, add mint green food colouring to the remaining fondant and knead to a pale pistachio green colour. Wrap in clingfilm to prevent it drying out.", "Roll out the almond paste on a work surface lightly dusted with icing sugar, to a rectangle slightly larger than the cake. Neatly cut out a 23x15cm/9x6in rectangle and place on silicon sheet dusted with icing sugar (this will enable you to slip the almond paste on top of the cake, once the cake has cooled). ", "Roll out the green fondant on a surface lightly dusted with icing sugar, to a rectangle slightly larger than the cake. Neatly cut out a 23x15cm/9x6in rectangle and carefully place on top of the almond paste. ", "Divide the royal icing equally between 3 bowls. Colour one bowl pale dusky pink and colour the second bowl a light gold colour, using the autumn leaf colouring. Leave the third bowl white.  ", "Spoon most of the white royal icing into a piping bag fitted with a number 3 writing nozzle. Pipe the outline of a tennis court on top of the green fondant, leaving a 2cm/¾in gap around the edge.", "On a sheet of greaseproof paper or a silicon mat, pipe the outline of 2 small tennis rackets (approx. 5cm/2½in long) and a tennis net about 12x3cm/4½x1¼in (it should be the same width as the court you piped onto the cake). Spoon the remaining white icing into a piping bag fitted with a number 2 plain nozzle and pipe the strings of the tennis racket within the tennis racket outline and the strings of the net within the outline of the net. Leave to dry until you can peel them off the paper.  ", "Spoon the pink icing into a piping bag fitted with the number 8 star nozzle and spoon the gold icing into a piping bag fitted with the number 7 star nozzle. Using the pink and the gold icing, pipe a decorative border around the edge of the fondant.  ", "When the cake has cooled, gently lift the decorative iced layer of almond paste and fondant onto the cake.", "Pipe a line of white icing across the middle of the tennis court. Peel the net off the greaseproof paper and stick it on the line of icing, so it stands up on top of the cake. Lay the iced tennis rackets on either end of the court and finally roll a small tennis ball from the reserved fondant.  "]}, {"isVegetarian": false, "title": "Teriyaki glazed salmon with sweet and sour peppers and wasabi hollandaise", "url": "www_bbc_co_uk_food_recipes_teriyaki_glazed_salmon_24085", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz salt", "110ml/4fl oz teriyaki marinade sauce", "450g/1lb salmon fillet, in a piece, pin-bones and skin removed", "250g/9oz caster sugar", "250ml/9fl oz white wine vinegar", "1 red chilli, split lengthways ", "2 red peppers, seeds and core removed, thinly sliced", "2 yellow peppers, seeds and core removed, thinly sliced", "250g/9oz unsalted butter", "110ml/4fl oz freshly squeezed lime juice", "1 free-range egg ", "75g/3oz egg yolk (about 4 yolks)", "75ml/3fl oz whipping cream", "30g/1oz wasabi paste", "150ml/5fl oz teriyaki marinade sauce", "110ml/4fl oz freshly squeezed lime juice", "50g/2oz wasabi paste", "sesame oil, for brushing", "2 heads baby pak choi, leaves separated", "1 tbsp sesame oil", "2 tbsp coriander cress", "1 tbsp sesame seeds, toasted"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the teriyaki brine, place the salt and two litres water into a pan. It is very important to weigh the salt accurately. Bring to the boil with a lid on to avoid any evaporation.", "Remove from the heat, allow to cool, then chill.  Stir in the teriyaki marinade sauce.", "Place the salmon in a deep plastic or stainless steel tray and pour over the teriyaki brine. Ensure the salmon is completely submerged. ", "Cover and set aside in the refrigerator for 24 hours. Remove the salmon from the brine and pat dry with kitchen paper. Cut the salmon into four portions.", "For the sweet and sour peppers, place the sugar, white wine vinegar and the red chilli in a saucepan, bring to the boil then remove and discard the chilli. ", "Add the sliced peppers to the boiling sweet and sour liquid. ", "Remove from the heat and allow to cool in the liquid. The peppers and liquid can be stored in the refrigerator at this stage until required. ", "When serving, drain all excess liquid from the peppers.", "For wasabi hollandaise, melt the butter in a saucepan and set aside to cool slightly. ", "Place the lime juice, whole egg and egg yolks into a mixing bowl. ", "Place the bowl over a pan of boiling water (ensure that the bowl does not touch the water). Whisk continuously until the mixture is warm, thick and light (the temperature of the eggs should be about 80C). ", "Remove the bowl from the heat and whisk in the melted butter, cream and wasabi. Season with salt to taste.", "Place a square of cheesecloth in a clean mixing bowl. Sieve the finished hollandaise sauce through the cheesecloth. ", "Pour the sieved hollandaise sauce into a 500ml/18fl oz whipped cream canister suitable for warm preparations.", "Charge the cream whipper with two gas chargers. Shake vigorously and leave at room temperature until required. ", "For the teriyaki glaze, mix the teriyaki marinade sauce, lime juice and wasabi paste together. ", "Heat a griddle pan until hot. Lightly brush the salmon with a touch of sesame oil. ", "Griddle the salmon on its unbrined sides for three minutes per side. Remove from the griddle pan and generously brush with teriyaki glaze.", "Wilt the pak choi leaves in a warm pan with the sesame oil and a little water. Season with salt to taste.", "To serve, divide the sweet and sour peppers among four serving plates, piling them in the centre. Place the wilted pak choi leaves around the plate. ", "Place a piece of the teriyaki salmon on top of the peppers. ", "Sprinkle the coriander cress and toasted sesame seeds on top of the salmon. ", "Spoon a little of the teriyaki glaze around the plate. ", "Vigorously shake the hollandaise in the whipped cream canister and squirt three dollops of hollandaise on each plate. Serve immediately."]}, {"isVegetarian": false, "title": "Teriyaki mushroom risotto with red mullet and lime leaf foam", "url": "www_bbc_co_uk_food_recipes_teriyaki_mushroom_42335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz mixed oyster and shitake mushrooms", "600ml/20fl oz chicken stock ", "25g/1oz butter", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "100g/3½oz risotto rice", "100ml/3½fl oz white wine", "2 tbsp olive oil", "4 tbsp teriyaki sauce", "2 tbsp mascarpone", "2 tbsp freshly grated parmesan", "200ml/7fl oz full-fat milk", "4 lime leaves, finely chopped", "1 tsp lecithin", "sea salt and freshly ground black pepper", "4 red mullet fillets"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the mushrooms by brushing off any dirt, trimming the stems and tearing any large ones in half. ", "Pour the stock into a saucepan with the trimmings/stalks from the mushrooms and warm through.", "Heat a large frying pan or sauté pan until medium-hot. Add a knob of butter, the shallots and garlic and gently fry for a couple of minutes before adding the rice. Stir well, then add the wine and cook until the liquid has been absorbed.", "Add a couple of ladlefuls of stock at a time, simmering between each addition until the rice has absorbed all the stock. Repeat until all the stock has been used and the rice is tender - it should take about 12-15 minutes.", "While the rice cooks, heat a non-stick frying pan until hot. Add the remaining butter and a tablespoon of olive oil, add the mushrooms and cook over a high heat until just golden-brown and tender.", "Add the mushrooms to the risotto and stir through, then stir in the teriyaki sauce, mascarpone and parmesan. ", "Pour the milk into a saucepan with the lime leaves and lecithin and bring just to a simmer. Blend with a stick blender to create a foam.", "Wipe the pan out, return it to the heat and add the last of the olive oil. Cook the red mullet skin-side down for a minute before turning over and cooking for another 30 seconds on the flesh side.", "Spoon the risotto into serving bowls, top with a fillet of red mullet, skin-side up, and finish with a spoonful of lime leaf foam."]}, {"isVegetarian": false, "title": "Teriyaki prawns, prawn and pork dim sum and prawn toasts", "url": "www_bbc_co_uk_food_recipes_teriyaki_prawns_prawn_05624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/11fl oz teriyaki sauce", "12 raw king prawns, shell removed, but head left on", "175g/6oz raw king prawns, peeled", "75g/3oz pork mince", "1 tbsp sesame oil", "1 tbsp dry sherry or rice wine ", "¼ tsp ground white pepper", "1 tsp caster sugar", "1 tsp salt", "16 gyoza wrappers (available from Asian supermarkets)", "vegetable oil, for deep-frying", "4 slices white bread", "200g/7oz raw king prawns, peeled", "1 free-range egg white", "50g/2oz sesame seeds", "125ml/4½fl oz rice vinegar", "25g/1oz sugar", "pinch salt", "2 red chillies, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the teriyaki prawns, heat a frying pan until hot, add the teriyaki sauce and cook until reduced by half then stir in the prawns and continue to cook for 1-2 minutes, or until the prawns are cooked through.", "For the prawn dim sum, blend the prawns and pork in a small food processor to a purée.", "Transfer the mixture to a bowl, add the remaining ingredients, except the wrappers, and mix until well combined.", "To assemble the dim sum, place a small spoonful of prawn mixture into the middle of a gyoza, then fold in half and seal the edges with wet fingers. Crimp to form a wavy edge.", "Steam the dim sum for 4-5 minutes, or until cooked through. ", "For the prawn toasts, heat 2.5cm/1in vegetable oil in a deep, heavy-bottomed saucepan until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Preheat the grill to high.", "Toast the slices of bread on one side and set aside.", "Blend the prawns and egg white in a food processor to a fine purée.", "Spread the mixture over the untoasted side of the bread, then scatter over the sesame seeds and press down lightly.", "Place the bread, prawn-side down, into the oil and cook for 1-2 minutes then flip over and cook for a further minute. Remove from the pan and set aside to drain on kitchen paper.", "Heat the rice vinegar, sugar, salt and chilli in a saucepan until the sugar dissolves.", "Spoon the teriyaki prawns, dim sum and prawn toasts onto separate serving plates and serve the dip alongside."]}, {"isVegetarian": false, "title": "Teriyaki salmon with coriander salad and coriander mayo", "url": "www_bbc_co_uk_food_recipes_teriyaki_salmon_with_07180", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz Shaoxing rice wine", "125ml/4fl oz sake", "125ml/4fl oz mirin", "125ml/4fl oz soy sauce", "3 tbsp caster sugar", "4 x 175g/6oz salmon fillets, skinned and pin boned", "5cm/2in piece fresh root ginger, peeled and finely julienned", "2 garlic cloves, finely sliced", "2 long red chillies, finely sliced", "2 red peppers, finely julienned", "1 small tin bamboo shoots, drained", "110g/4oz Chinese cabbage, finely shredded", "3 tbsp fresh coriander leaves", "1 tbsp coriander cress", "3 tbsp palm sugar", "2 tbsp soy sauce", "2 tsp fish sauce", "1 lime, juice only", "vegetable oil, for deep frying", "12 very fine slices lotus root", "2 handfuls coriander, roughly chopped", "200ml/7floz rapeseed or light olive oil", "2 free-range eggs, yolks only", "1 tsp white wine vinegar", "½ tsp powdered mustard", "1 tsp salt ", "1 lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the teriyaki salmon, heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer.", "Simmer for 1-2 minutes, or until the mixture has just thickened.", "Remove from the heat and allow to cool down to room temperature.", "Place the salmon into a shallow tray and pour over half of the teriyaki mixture, turn to coat the salmon in the sauce and then place in the fridge to marinate for at least an hour.", "Remove the salmon from the fridge, heat a frying pan until hot, then add the salmon, presentation side-down and fry for 1-2 minutes, then flip over.", "Pour over the remaining teriyaki sauce and use to glaze the salmon while it continues to cook for another 2-3 minutes, or until just cooked through.", "Remove the pan from the heat and rest the salmon for a couple of minutes.", "For the coriander salad, place the ginger, garlic, chillies, red peppers, bamboo shoots, cabbage, coriander leaves and cress into a bowl and toss together.", "Mix the palm sugar, soy and fish sauce and lime juice together until just combined, pour over the salad and toss to coat.", "Heat a separate wok with about 2.5cm/1in of vegetable oil until just shimmering. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Add the lotus root and fry until just golden-brown and then drain immediately onto kitchen paper.", "Season with salt and a little black pepper.", "For the coriander mayo, bring a pan of water to the boil, add the coriander and cook for one minute.", "Drain and refresh in a bowl of iced water and then squeeze out the excess liquid.", "Place into a blender with the oil and blend until green and a fine purée.", "Place the egg yolks, vinegar, mustard, salt and lemon juice into a clean food processor.", "Blend to combine, then with the motor still running, gradually add the coriander oil.", "Continue until all the oil has been added and the mayonnaise has thickened. You may not need all the oil to achieve the correct consistency.", "Season with salt and black pepper.", "To serve, spoon the mayonnaise onto the plate and top with a pile of salad.", "Lay the teriyaki salmon on top and finish with a few lotus crisps."]}, {"isVegetarian": false, "title": "Teriyaki salmon with cabbage salad", "url": "www_bbc_co_uk_food_recipes_teriyaki_salmon_with_25244", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz Shaoxing rice wine", "125ml/4fl oz sake", "125ml/4fl oz mirin", "125ml/4fl oz soy sauce", "3 tbsp caster sugar", "4 x 175g/6oz salmon fillets, skinned and pin boned", "75g/3oz curly kale, picked and shredded", "½ cucumber, peeled and finely sliced", "50g/2oz mizuna leaves", "4 tbsp shredded mint leaves", "1 red chilli, finely shredded", "2 limes, juice only", "1 tbsp palm sugar", "2 tbsp sesame oil", "1 tbsp soy sauce", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the teriyaki salmon, heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer.", "Simmer for 1-2 minutes, or until the mixture has just thickened.", "Remove from the heat and allow to cool down to room temperature.", "Place the salmon into a shallow tray and pour over half the teriyaki, turn to coat the salmon in the sauce then place in the fridge to marinate for at least an hour.", "Remove the salmon from the fridge, heat a frying pan until hot, then add the salmon, presentation side down and sear for 1-2 minutes then flip over.", "Pour over the remaining teriyaki sauce and use to glaze the salmon whilst it continues to cook for another 2-3 minutes until just cooked through, glazing frequently.", "Remove the pan from the heat and rest the salmon for a couple of minutes.", "For the cabbage salad, bring a pan of salted water to the boil, add the shredded curly kale and blanch for two minutes then drain and refresh.", "Press dry then place in a bowl with the cucumber, mizuna, and mint leaves and chilli and toss lightly to combine.", "Whisk the lime juice, palm sugar, sesame oil and soy sauce together and season with a little salt and freshly ground black pepper.", "Drizzle over the salad and toss to combine. ", "To serve, pile the salad onto the plate and place the salmon alongside. Spoon over the extra teriyaki sauce."]}, {"isVegetarian": false, "title": "Teriyaki steak with Asian bean salad", "url": "www_bbc_co_uk_food_recipes_teriyaki_steak_with_35460", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz Shaoxing rice wine", "125ml/4fl oz sake", "125ml/4fl oz mirin", "125ml/4fl oz soy sauce", "3 tbsp caster sugar", "4 x 150-200g/5½-7oz pieces of fillet steak", "2 tbsp rapeseed oil", "5cm/2in piece fresh root ginger, finely julienned", "2 garlic cloves, thinly sliced", "2 long red chillies, thinly sliced", "3 tbsp fresh coriander leaves", "3 tbsp fresh mint", "3 tbsp palm sugar", "2 tbsp soy sauce", "2 tsp fish sauce", "1 lime, juice only", "100g/3½oz French beans, left whole", "100g/3½oz mangetout, halved", "100g/3½oz edamame beans, podded", "100g/3½oz fresh peas, podded", "1 red onion, thinly sliced", "½ bunch fresh watercress"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer. Simmer for 1-2 minutes, or until the mixture has just thickened. Remove from the heat and leave to cool to room temperature.", "Put the steak in a shallow tray and pour over half of the teriyaki mixture, turn to coat the steak in the sauce. Place in the fridge to marinate for at least an hour. Pour the remaining teriyaki sauce into the serving bowl. ", "Heat a frying pan until hot, slice the steak and fry for 1-2 minutes.", "For the salad, put the ginger, garlic, chillies, coriander, mint, palm sugar, soy sauce, fish sauce and lime juice in a pestle and mortar. Pound until you have s smooth dressing.", "Put the French beans, mangetout, edamame beans, peas, onion and watercress in a large bowl and mix to combine. Just before serving add the dressing and stir.", "Place the steak on serving plates with the salad alongside and serve with the remaining teriyaki sauce. "]}, {"isVegetarian": false, "title": "Teriyaki chicken", "url": "www_bbc_co_uk_food_recipes_teriyakichicken_85358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/teriyakichicken_85358_16x9.jpg", "ingredients": ["2 tsp Tabasco sauce (optional)", "2 tbsp clear honey", "2 tbsp sesame oil", "2 tbsp soy sauce", "4 chicken thighs, bone removed, sliced", "1 tbsp vegetable oil", "boiled rice, to serve", "steamed bok choi, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the Tabasco sauce (if using), honey, sesame oil and soy sauce in a bowl and mix well. Put the chicken slices into the bowl, stir well to coat and leave to marinate for 5 minutes.", "Heat the vegetable oil in a frying pan. Remove the chicken slices from the marinade, reserving the marinade, and fry for 3-4 minutes on each side, or until completely cooked through. Remove the chicken from the pan and set aside, keep warm.", "Pour the marinade into the pan and boil rapidly for a few minutes until slightly reduced. ", "To serve, put the chicken slices on a plate and pour over the sauce. Serve with rice and steamed bok choi. "]}, {"isVegetarian": false, "title": "Teriyaki chicken on a bed of griddled spring onions", "url": "www_bbc_co_uk_food_recipes_teriyakichickenonabe_66005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 chicken fillets", "1 tbsp vegetable oil", "1 tsp sesame oil ", "2 tsp clear honey", "1 tbsp soy sauce", "1 lime, juice only", "splash of water", "6 spring onions", "2 tsp sesame seeds"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a medium frying pan.", "Fry the chicken fillets for 2-3 minutes.", "Stir in ½ tsp sesame oil, the honey and soy and cook until the chicken caramelises.", "Place a griddle pan on the heat.", "Griddle the spring onions on both sides until well charred.", "Add the lime juice and water to the chicken. Remove the pan from the heat.", "Drizzle the remaining sesame oil over the spring onions, then sprinkle over the sesame seeds.", "Serve the teriyaki chicken on a bed of griddled spring onions."]}, {"isVegetarian": true, "title": "Teriyaki mushrooms", "url": "www_bbc_co_uk_food_recipes_teriyakimushrooms_80611", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sesame oil ", "2 tbsp soy sauce ", "2 tbsp honey", "12 button mushrooms, stems removed", "1 Savoy cabbage leaf, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sesame oil, honey and soy sauce into a bowl and mix together. ", "Add the mushrooms and leave to marinate for ten minutes.", "Heat a griddle pan until smoking. Thread the mushrooms onto skewers and place onto the griddle to cook for two minutes on each side.", "To serve, place a Savoy cabbage leaf on the base of a plate and top with the mushroom skewers."]}, {"isVegetarian": false, "title": "Teriyaki skewers with stir-fried vegetables", "url": "www_bbc_co_uk_food_recipes_teriyakiskewerswiths_75727", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5 ¼oz beef steak", "1 tbsp soy sauce ", "1 tbsp honey", "1 tbsp lime juice", "2 small wooden skewers", "175g/6oz of broccoli, cut into bite-sized pieces", "1 clove garlic, finely chopped", "½ tsp ground ginger", "¼ red onion, finely sliced ", "½ tomato, chopped", "1 tsp sesame oil ", "2 tbsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the teriyaki skewers, cube the beef into bite-sized pieces.", "Place the beef onto the wooden skewers.", "Heat a griddle pan on a medium heat and add a splash of oil.", "Place the skewers into the grddle pan and turn once browned.", "Place the rest of the teriyaki ingredients into a bowl to make the sauce.", "Brush the teriyaki sauce onto the skewers and cook for 3-4 minutes.", "Take off the heat and allow to rest for one minute.", "For the stir fry, blanch the broccoli in hot water for one minute.", "Heat a medium-sized wok until it is almost smoking and add all of the stir-fry ingredients except the broccoli.", "Cook for two minutes. Add the broccoli and cook for a further minute.", "To serve, place the stir fry onto a plate and add the skewers on top."]}, {"isVegetarian": false, "title": "Teriyaki salmon", "url": "www_bbc_co_uk_food_recipes_teriyakisalmon_66107", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/teriyakisalmon_66107_16x9.jpg", "ingredients": ["2 salmon fillets", "4-5 tbsp dark soy sauce", "1 lime, zest and juice", "1 small chilli", "2 tbsp maple syrup", "1 fat garlic clove, finely chopped ", "1 chunk of ginger, finely chopped ", "1 sheet of egg noodles", "bunch of coriander, chopped", "1 tbsp sesame oil", "extra lime juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat some olive oil in a pan and fry the ginger, garlic and chopped chilli.  ", "Add the zest and juice of the lime and pour in the soy sauce.  Add the maple syrup and cook for 1 minute or until reduced and sticky.  ", "Meanwhile, pan-fry the two pieces of salmon for 2 minutes each side in a hot griddle pan.  ", "When the sauce is reduced add the salmon to the teriyaki sauce frying pan.  ", "Cook and drain the noodles, adding the sesame oil, seasoning and coriander and a squeeze of lime.  Serve the salmon on a bed of noodles with more chopped coriander."]}, {"isVegetarian": false, "title": "Terrine of Capricorn goats' cheese, apples and celery and a salad of  toasted walnuts and raisins", "url": "www_bbc_co_uk_food_recipes_terrineofcapricorngo_81701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz raisins ", "100ml/3½fl oz Down St Mary sparkling wine, or other sparkling wine ", "300g/10½oz  Capricorn goats' cheese, or other similar mild but mature goats' cheese that is not too soft", "200g/7oz plain Greek yoghurt ", "200ml/7fl oz whipping or double cream", "4 gelatine leaves, soaked in cold water for at least 10 minutes ", "60g/2½oz celery, finely chopped ", "60g/2½oz apple, finely chopped ", "salt and freshly ground white pepper", "100g/3½oz plain goats' cheese log, cut into long lengths ", "100ml/3½fl oz walnut oil", "75ml/3fl oz groundnut oil ", "50ml/2fl oz Champagne vinegar or white wine vinegar ", "salt and freshly ground black pepper", "80g/3oz walnut halves", "milk", "1 Cox's apple, peeled and sliced and cut into thin batons and placed in acidulated water to prevent browning", "mixed salad leaves, including wild rocket, chervil, red chard, frisée and oakleaf"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["First put the raisins to soak in the wine for 24 hours.", "To make the terrine, place the 300g/10½oz goats' cheese in a food processor and blend until smooth. Blend in the yoghurt, then remove from the processor and place in a bowl. ", "Heat the cream until hot but not boiling. Gently squeeze the softened gelatine dry, then add to the hot cream and stir until melted. Cool slightly, then whisk this into the yoghurt and goats' cheese mixture. Add the celery and apple, and season with a little salt and freshly ground white pepper.", "Line a terrine mould or small loaf tin with clingfilm (or you can use individual moulds), then fill halfway with the cheese and yoghurt mixture, spreading it evenly into the corners.", "Place the 100g/3½oz goats' cheese log down the middle. Top with the remaining cheese and yoghurt mixture, smoothing the surface flat. Tap the terrine on the work surface to ensure there are no air pockets. Cover and leave to set in the fridge for one hour. ", "For the walnut vinaigrette, mix all the ingredients for the vinaigrette together, with salt and freshly ground black pepper to taste, and place in a bottle or plastic pourer. Before using the vinaigrette, shake it well.  ", "Now make the salad. To prepare the walnuts, put them in a small pan and cover with a mixture of half water and half milk. Bring to the boil, then remove from the heat and leave to soak for a few minutes.", "Drain and peel off the thin brown skins, using a small paring knife. Toast the walnuts in a dry pan, then set aside.", "Drain some of the raisins from the wine and place in a bowl with some of the walnuts. Add the apple and a little of the vinaigrette and toss to coat. ", "Combine the salad leaves with the remaining drained raisins and toasted walnuts in another bowl and dress with the vinaigrette. ", "Turn the terrine out of the mould and slice using a hot knife.", "To assemble, place the terrine at one end of each plate (ideally use long or oval plates). Pile the salad at the other end of the plate. Put the raisins and walnuts into the middle and place the apple batons on top, or sprinkle them around the terrine."]}, {"isVegetarian": false, "title": "Teryaki seared tuna with crispy noodles", "url": "www_bbc_co_uk_food_recipes_teryakisearedtunawit_81381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz tuna steak ", "1 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp soy sauce", "2 tbsp honey", "1 tsp sesame seeds", "50g/1¾oz rice noodles", "500ml/18fl oz vegetable oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tuna, rub the tuna steak with the oil and season both sides with salt and freshly ground black pepper.", "Heat a frying pan until very hot. Add the tuna steak and sear for two minutes on each side, until browned and cooked through.", "Pour over the soy and honey and allow to cook and caramelise for 30 seconds. Remove from the heat, sprinkle with sesame seeds and set aside.", "To make the noodles, heat the vegetable oil in a deep, heavy bottomed saucepan until a breadcrumb sizzles and turns brown when added to it. (CAUTION: hot oil can be dangerous, do not leave unattended.)", "Carefully add the rice noodles to the hot oil. They will puff up and cook in a few seconds, then carefully remove and drain on kitchen towels.", "To serve, place the tuna on a small warm plate and place the crispy noodles in a bowl alongside."]}, {"isVegetarian": false, "title": "Tex-Mex brick chicken", "url": "www_bbc_co_uk_food_recipes_tex-mex_brick_chicken_47381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 dried chipotle chillies", "¼-½ habanero chilli, to taste", "generous pinch sea salt flakes", "4 tbsp olive oil", "1 orange, juice only", "2 tsp fresh oregano leaves", "2 garlic cloves, roughly chopped", "1 large whole chicken, spatchcocked and de-boned, only wing bones left in (ask your butcher to do this for you)", "large knob of butter", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "½ bunch fresh coriander, stalks chopped, leaves reserved for garnish", "2 x 400g tins good-quality Mexican black beans", "1 small red chilli, finely chopped, to garnish", "4-8 soft tacos", "handful grated Mexican-style firm cheese, such as Oaxaca (available from specialist cheese shops or online; alternatively, use firm grated mozzarella)", "4-8 tbsp ready-made tomato salsa", "2 handfuls crisp lettuce such as Iceberg or Romaine lettuce, shredded"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the chicken, heat a frying pan over a high heat. When the pan is hot, add the chipotle and habanero chillies and dry-fry, turning regularly, until the skins are almost completely blackened and blistered all over. Transfer the chillies to a bowl and cover them with warm water (from a kettle). Set aside to soak for 15-20 minutes, or until soft. ", "When the chillies are soft, carefully drain away the water and remove the stalks, seeds and skins using your fingers. (CAUTION: Wash your hands thoroughly after skinning and de-seeding the chillies, and don’t touch your eyes during the process.) Roughly chop the chilli flesh, then transfer it to a pestle and mortar and add the salt and olive oil. Pound the chillies to a smooth paste.", "Stir the orange juice, oregano and garlic into the chilli paste until well combined. ", "Lay the spatchcocked chicken out onto a clean work surface. Spread the chilli marinade all over it. Set aside to marinate for at least 30 minutes, or preferably overnight (covered and chilled).", "Meanwhile, for the frijoles, melt the butter in a large saucepan over a high heat. When the butter is foaming, add the onion and garlic and fry for 6-8 minutes, or until softened but not coloured. ", "Add the chopped coriander stalks to the mixture and continue to fry for a further 3-4 minutes, stirring well. ", "Stir the black beans and all of the tin contents (see tip) into the mixture. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 12-15 minutes, stirring regularly, until the beans are very soft and the sauce has thickened. (Garnish with the coriander leaves and chopped chilli just before serving.)", "When the chicken has marinated, heat a large, heavy-based griddle pan or frying pan over a medium to high heat. When the pan is hot, add the marinated chicken, skin-side down. ", "Wrap a brick in aluminium foil (see tip). Place the brick on top of the chicken and continue to griddle, without moving or turning it, for 20-25 minutes, or until the chicken is completely cooked through (the chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part of the meat and no trace of pink remains).", "Remove the brick(s) from the chicken, remove the chicken from the pan and set aside to rest before carving into slices. ", "To serve, divide the chicken, frijoles, cheese, tomato salsa and lettuce equally among the tacos, or let people make their own tacos."]}, {"isVegetarian": true, "title": "'Tex-Mex' chilli beans", "url": "www_bbc_co_uk_food_recipes_texmexchillibeans_79386", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz tin of baked beans", "1 tsp brown sugar", "½ tsp cumin", "½ tsp chilli powder", "1 tsp balsamic vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Strain the beans and place in a saucepan over a medium heat.", "Add the sugar, spices, vinegar and water. Heat through for five minutes and pour into a bowl to serve."]}, {"isVegetarian": false, "title": "Textured potato salad", "url": "www_bbc_co_uk_food_recipes_texturedpotatosalad_72996", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["675g/1½lb floury potatoes, peeled and cut into 2.5cm (1in) cubes", "6 rashers smoked, streaky bacon, cooked until crisp", "2 large dill cucumbers, diced", "2 hard-boiled eggs, chopped", "4 spring onions, chopped", "salt and freshly ground black pepper", "1 tbsp lemon juice", "1 tbsp chopped dill", "1 tbsp snipped chives", "1 tbsp mayonnaise", "3 tbsp soured cream"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the potatoes in salted water until soft, then drain and return to the heat to dry out. It is important that the potatoes are thoroughly cooked.", "Combine the potatoes with the crumbled crispy bacon, the diced cucumber, eggs and spring onions. Season.", "Combine the remaining ingredients to make the dressing.", "Fold enough of the dressing into the salad to make it creamy.", "Try to fold everything together while the potatoes are still warm, and allow the potatoes to break down a little in the mixing.", "Serve."]}, {"isVegetarian": false, "title": "Thai-style baked seabass with bok choi and a rice noodle salad", "url": "www_bbc_co_uk_food_recipes_thai-style_baked_seabass_00022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm/2in fresh ginger, peeled and very finely chopped", "2 garlic cloves, crushed", "1 lime, juice only", "3 tbsp Thai fish sauce (nam pla)", "4 baby bok choi, shredded", "1 large sea bass, gutted and cleaned", "6 spring onions, finely chopped", "1 red chilli, seeds removed, thinly sliced", "250g/9oz rice vermicelli noodles", "3 Baby Gem lettuce, leaves separated", "2 large carrots, thinly sliced", "½ cucumber, peeled lengthways into ribbons", "6 spring onions, trimmed and finely chopped", "60g/2¼oz salted roasted peanuts, roughly chopped", "large handful coriander leaves", "large handful mint leaves", "large handful basil leaves", "1 lime, juice only", "1 tbsp caster sugar", "3 tbsp Thai fish sauce (nam pla)", "1 red chilli, seeds removed, thinly sliced", "1 garlic clove, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Whisk together the ginger, garlic, lime juice and fish sauce.", "Arrange the bok choi on a large sheet of baking parchment and add the seabass to one side along with some spring onion and chilli. Spoon the garlic and fish sauce mixture over the fish. Fold the parchment paper over the fish and seal the corners with metal paper clips.", "Place on a baking tray and cook in the oven for about 20-30 minutes.", "For the rice noddle salad, soak the noodles in a bowl of boiling water according to the packet instructions until they are tender. Drain the noodles, rinse under cold water and set aside.", "For the dressing, whisk together the lime juice and caster sugar in a large mixing bowl until the sugar has dissolved. Add the fish sauce, chilli and garlic and mix through.", "Then add the noodles, lettuce, vegetables, peanuts and fresh herbs. Mix to combine.", "Serve the sea bass straight to the table, allowing your guests to tear open the paper to reveal the steaming sea bass. Serve the noodles alongside."]}, {"isVegetarian": false, "title": "Thai-style crab cakes with quick chilli jam", "url": "www_bbc_co_uk_food_recipes_thai-style_crab_cakes_03454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz jam sugar with added pectin", "3 tbsp red wine vinegar", "2-3 long red chillies, seeds removed, finely chopped", "2 garlic cloves, finely chopped", "15g/½oz chunk fresh root ginger, finely chopped", "100g/3½oz white crabmeat ", "100g/3½oz brown crabmeat ", "200g/7oz raw peeled king prawns (or other peeled raw prawns)", "1 tbsp Thai green curry paste", "1 tbsp cornflour, plus 1 tbsp extra for dusting", "6 spring onions, finely sliced", "25g/1oz fresh coriander, leaves finely chopped", "6 tbsp sunflower oil, for frying", "flaked sea salt", "freshly ground black pepper", "lime wedges and fresh coriander, to serve"], "serves": "Makes 12 crab cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the chilli jam dipping sauce, put the sugar, vinegar and 100ml/3½fl oz water in a small saucepan and gently heat until the sugar dissolves, stirring constantly. Add the chilli, garlic and ginger and bring to the boil. Cook for three minutes. Remove from the heat and pour into two heatproof serving bowls. It will thicken as it cools. (Any leftover chilli jam can be covered and kept in the fridge for up to two weeks.)", "To make the crab cakes, put the crab meat, prawns, curry paste, cornflour and a couple of really good pinches of flaked sea salt and a few twists of ground black pepper into a food processor. Blend until well combined. You may need to remove the lid and push the mixture down a couple of times with a rubber spatula. Don’t allow the mixture to become too thin or smooth or it will be difficult to shape into crab cakes.", "Remove the blade and transfer the mixture to a large bowl. Stir in the spring onions and coriander until evenly mixed. Sprinkle a small tray or platter with the extra tablespoon of cornflour.", "Wet your hands under the cold tap to stop the crab cakes from sticking. Take a small handful of the mixture – about the size of a golfball. Roll into a neat ball then flatten until around 1.5cm/¾in thick and 6cm/2½in in diameter. Place on the cornflour-dusted tray. Continue rolling and flattening the mixture until you have made 12 crab cakes.", "Pour the oil into a large non-stick frying pan and place over a medium heat. When the oil is hot, add six of the crab cakes and cook for two minutes on each side or until lightly browned and cooked throughout. Transfer to a warmed plate while the rest are cooked.", "Divide the crab cakes between two large plates or small platters. Add a dish of the chilli jam to each one and garnish with lime wedges and sprigs of fresh coriander to serve."]}, {"isVegetarian": false, "title": "Thai-style chicken and cucumber salad", "url": "www_bbc_co_uk_food_recipes_thai-style_cucumber_08091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chicken breasts, skin removed, finely diced", "75ml/3fl oz Thai fish sauce (nam pla)", "2 limes, juice only", "1 tbsp gochujang (a Korean fermented chilli paste available from Asian supermarkets)", "4 cucumbers, 3 shaved into ribbons using a potato peeler, 1 cut into 7.5cm/3in batons", "75ml/3fl oz Japanese rice wine vinegar", "8 birds’-eye chillies, chopped", "½ head of broccoli, florets sliced into thin slices", "5 spring onions, sliced into 1.5cm/½in slices on the diagonal", "6 shallots, preferably Thai, chopped ", "handful fresh mint leaves, chopped", "handful fresh coriander, chopped"], "serves": "2", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the chicken into a bowl and pour over half of the Thai fish sauce, the juice of one lime and the Korean chilli paste. Mix until well combined, then chill in the fridge for at least two hours, to marinate.", "Cover all of the cucumber with the remaining fish sauce, the rice wine vinegar, the juice of half a lime and all of the chopped chillies. Mix well and set aside for two hours, to marinate. ", "Add the broccoli, spring onions and shallots to the marinated chicken and marinate for a further 30 minutes. ", "Place the marinated cucumber mixture into a sieve placed over a bowl. Strain and reserve the marinating liquid. ", "Heat a frying pan or heavy-based wok over a high heat. When the pan is hot, add the marinated chicken mixture and stir-fry until cooked through.", "Add the cooked chicken and vegetables to the marinated cucumber mixture. Add the chopped herbs and mix until well combined. ", "Taste the mixture and add tablespoonfuls of the reserved marinade, to taste, if necessary. Squeeze over the remaining lime juice and taste again. ", "Divide the salad between two serving plates and serve."]}, {"isVegetarian": false, "title": "Thai beef and mixed pepper stir-fry", "url": "www_bbc_co_uk_food_recipes_thai_beef__mixed_pepper_58157", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_beef__mixed_pepper_58157_16x9.jpg", "ingredients": ["300g/10½oz basmati rice", "500g/1lb 2oz lean beef fillet", "1 tbsp sesame oil", "1 garlic clove, finely chopped", "1 lemongrass stalk, finely shredded", "2.5cm/1in piece of fresh root ginger, finely chopped", "1 red pepper, cored, deseeded and thickly sliced", "1 green pepper, cored, deseeded and thickly sliced", "1 onion, thickly sliced", "2 tbsp lime juice", "freshly ground black pepper", "coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rice in a lidded pot, cover with water and bring to the boil. Place the lid on the pot and reduce the heat. Simmer for around 10 minutes, or until the rice is soft. ", "Cut the beef across the grain into long, thin strips.", "Heat the oil in a wok or large frying pan over a high heat. Add the garlic and stir-fry for 1 minute. Add the beef and stir-fry for a further 2-3 minutes, or until lightly coloured. Stir in the lemongrass and ginger and remove the pan from the heat. Remove the beef from the pan and set aside.", "Return the pan to the heat. Add the peppers and onion to the pan and stir-fry for 2-3 minutes, or until the onions begin to brown and soften.", "Return the beef to the pan, stir in the lime juice and season to taste with black pepper. Garnish with the coriander and serve. "]}, {"isVegetarian": false, "title": "Thai-style fishcakes with sweet and sour cucumbers", "url": "www_bbc_co_uk_food_recipes_thai-style_fishcakes_68632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz white fish, such as whiting or pollock", "1 tbsp fish sauce", "1 tbsp red curry paste", "1 strip lime zest ", "1 tbsp chopped fresh coriander ", "1 free-range egg", "1 tbsp muscovado sugar", "60g/2¼oz fine beans, chopped", "½ tsp salt", "70ml/2½fl oz water", "150ml/5fl oz rice wine vinegar ", "150g/5½oz caster sugar", "1½ tsp Thai fish sauce", "3 red chillies, chopped ", "1 carrot, finely chopped", "¼ onion, finely chopped", "1 cucumber, cut into strips"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fishcakes, blend together the fish, fish sauce, red curry paste and lime zest in a food processor or blender.", "Add the chopped coriander, eggs, muscovado sugar, fine beans and salt. ", "Using wet hands, mould the mixture into patties and place on a baking tray. Transfer to the fridge to set.", "Preheat the oven to 180C/350F/Gas 4.", "When ready to cook, warm an ovenproof pan over a medium heat and place the patties in the pan to colour on each side, then bake in the oven for five minutes until cooked.", "For the sweet and sour cucumber, pour the water, vinegar, sugar and fish sauce into a small pan and bring to a simmer. ", "Stir in the remaining ingredients and remove from the heat to settle and cool.", "Serve the fishcakes with the sweet and sour cucumbers in a serving bowl on the side."]}, {"isVegetarian": false, "title": "Thai beef and mango salad", "url": "www_bbc_co_uk_food_recipes_thai_beef_and_mango_98996", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_beef_and_mango_98996_16x9.jpg", "ingredients": ["2 beef frying steaks ", "1 tbsp vegetable oil ", "1 tbsp soy sauce", "2 small carrots", "5 spring onions", "1 ripe mango", "2 baby gem lettuces or 1 small lettuce", "handful of salted peanuts (about 40g/1½oz ), optional", "1 garlic clove", "1 lime, juice only", "1 tbsp caster sugar", "1 tsp chilli flakes"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the steaks in a shallow bowl. Pour on the oil and soy sauce and rub them into the meat so it's coated all over. Set aside to marinate while you prepare the vegetables. (Wash your hands after handling raw meat.)", "Peel the carrots then use the peeler to make thin ribbons. Separate the lettuce leaves, wash the leaves and drain in a colander. Finely slice the spring onions then peel, stone and thinly slice the mango. Combine the vegetables in a large bowl.", "Heat a large frying pan over a high heat, add the steaks and cook for 1 minute on each side for medium rare or cook for an extra minute on each side for medium.  Remove the steaks from the pan and transfer to a plate to rest.", "While the steaks are resting, prepare the dressing. Peel and grate the garlic then put it into a bowl with the lime juice, sugar and chilli flakes and stir them together. Pour the dressing over the prepared vegetables and add the peanuts.  Slice the beef thinly, add to the bowl along with any resting juices and toss to combine. Serve immediately."]}, {"isVegetarian": false, "title": "Thai chicken curry", "url": "www_bbc_co_uk_food_recipes_thai_chicken_curry_06763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_chicken_curry_06763_16x9.jpg", "ingredients": ["6 skinless and boneless chicken breasts", "3 tbsp Thai red curry paste", "3 tbsp sunflower oil", "2 onions, sliced", "4cm/1½in knob of fresh root ginger, peeled and finely grated ", "1 tbsp plain flour", "2 x 400g tins full-fat coconut milk", "1 tbsp Thai fish sauce", "1 tbsp light muscovado sugar", "1 lemon grass stalk, bashed (see tip)", "4 Kaffir lime leaves", "250g/9oz sugar snap peas, cut in half lengthways", "½ lime, zest and juice", "1 x 225g tin water chestnuts, drained, halved and quartered if large", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the chicken breasts in half and then into long thin slices. Tip into a bowl and add 1 tablespoon of the Thai curry paste, season with salt and freshly ground black pepper and mix.", "Heat 1 tablespoon of the sunflower oil in a deep frying pan, add the chicken slices and fry over a high heat for 5 minutes until just cooked through – you may need to do this in batches. Transfer the cooked chicken slices to a plate.", "Add the remaining oil to the pan and fry the onions for 3 minutes. Cover with a lid, lower the heat and cook for another 10 minutes to soften.", "Increase the heat and add the ginger with the remaining Thai curry paste and fry for a minute. Sprinkle in the flour and blend in the coconut milk with the fish sauce and sugar, adding a little at a time. Stir the mixture and bring to the boil. Add the lemon grass and lime leaves and season with salt and freshly ground black pepper. Return the chicken to the pan, bring back up to the boil and then cover, reduce the heat and simmer for about 5 minutes, or until piping hot.", "Meanwhile, cook the sugar snap peas in boiling salted water for 2 minutes, drain and refresh in cold water.", "Remove the lemon grass and lime leaves from the curry and discard. Add the lime zest and juice, water chestnuts and sugar snap peas. Bring to the boil, then remove from the heat and serve with rice."]}, {"isVegetarian": false, "title": "Thai beef stir fry", "url": "www_bbc_co_uk_food_recipes_thai_beef_stir_fry_28048", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 coriander roots, chopped", "4 garlic cloves ", "5 chillies, finely chopped (seeds optional)", "1 tbsp oyster sauce", "1 tbsp rice wine vinegar", "2 tbsp soy sauce", "2 tbsp Thai fish sauce", "½ lime, juice only", "4 birds’-eye chillies, chopped", "4 garlic cloves, roughly chopped", "½ tsp coarse sea salt ", "vegetable oil, for frying", "10 Thai shallots, finely sliced", "700g/1lb 9oz beef (either sirloin or rib), coarsely chopped (as if making a steak tartar - you can ask your butcher to coarsely mince it)", "1 small red pepper, finely diced", "4 free-range eggs ", "2 tbsp Thai fish sauce ", "1 tbsp oyster sauce", "2 tbsp soy sauce", "1½ tbsp palm sugar", "a good handful of Thai basil and a smaller handful of holy basil (optional)", "freshly cooked rice, for serving"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, put the coriander roots, garlic and chillies into a pestle and mortar and crush lightly. Add the remaining ingredients for the sauce to the mortar and give it a good grind to infuse the flavours. Put into a serving bowl or dipping bowls.", "For the beef, in the same pestle and mortar (don't worry about washing it up), put the chillies, garlic cloves and sea salt. Grind until you have a paste.", "Heat a wok with three tablespoons of vegetable oil, add the chopped shallots and fry for 3-4 minutes. Turn down the heat and then add the pounded chilli and garlic paste until slightly brown (about one minute), stirring continuously on a low heat so that the garlic doesn’t burn. Turn the heat up and add the beef and red peppers, and cook until the beef is nearly cooked - this will only take 4-5 minutes.", "In the meantime while the beef is cooking, heat a medium frying pan with two tablespoons of vegetable oil.  Fry four eggs until crisp on the outside, but the yolks are still runny ", "Add the fish sauce, oyster sauce, soy sauce and palm sugar and a good handful of basil leaves and fold through the cooked beef. Divide into onto suitable serving bowls and serve with the rice and sauce on the side."]}, {"isVegetarian": false, "title": "Thai chicken pie", "url": "www_bbc_co_uk_food_recipes_thai_chicken_pie_20300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_chicken_pie_20300_16x9.jpg", "ingredients": ["2 skinless, boneless chicken thighs (about 150g/5½oz)", "2 skinless, boneless chicken breasts (about 300g/10½oz)", "2 tbsp vegetable oil", "2 banana shallots, chopped", "2 garlic cloves, finely chopped", "1 red chilli, seeds removed, finely chopped", "1 tsp finely grated root ginger", "2 tsp Thai green curry paste", "200ml/7fl oz coconut cream", "150ml/5fl oz chicken stock", "2 lime leaves, torn", "1 stem lemongrass, bruised", "1 small sweet potato (about 175g/6oz), peeled and cut into 1cm/½in cubes ", "1 tsp cornflour, mixed with a splash of water", "black pepper", "splash of Thai fish sauce", "150g/5½oz plain flour", "pinch fine salt", "40g/1½oz unsalted butter, chilled, cut into roughly 1cm/½in cubes", "35g/1¼oz lard, chilled, cut into roughly 1cm/½in cubes", "1 tsp lemon juice (optional)", "1 free-range egg, beaten, to glaze"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the filling, cut all the chicken into 15mm/5/8in chunks. Heat the oil in a sauté pan or a wide saucepan over a medium-low heat. Add the shallots, garlic, chilli and ginger and fry gently for a few minutes, or until soft but not coloured.", "Stir in the curry paste and cook for a minute or two. Add the chicken pieces, increase the heat a little and cook, stirring all the time, until the chicken has lost its raw look. Add the coconut cream, chicken stock, lime leaves, lemongrass and sweet potato. Simmer for 12–15 minutes, or until the sweet potato is tender.", "Add the cornflour, bring to a simmer and stir until the sauce begins to thicken. Take off the heat and season, to taste, with black pepper and a little fish sauce. Leave to cool. Remove the lemongrass and lime leaves and transfer to a 1.2 litre/2 pint pie dish. ", "To make the shortcrust pastry, put the flour and salt in a bowl. Add the butter and lard and rub in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Using a table knife, work in two tablespoons of cold water and the lemon juice (if using) until the pastry comes together. Add a little extra water if needed. ", "When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and put in the fridge to rest for about 30 minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Roll out the pastry on a lightly floured work surface. Cut a long 2cm/¾in wide strip of pastry, dampen the edge of the pie dish with water and press the pastry strip to it. Use a lattice cutter to cut a pattern in the remaining pastry. Pull the pastry very gently to open up the lattice, then place over the pie. Press the edges down to seal, then trim away any excess pastry. Brush the top of the pie with beaten egg. ", "Bake for approximately 30 minutes, or until the pastry is golden-brown. Leave the pie to sit in the tin for five minutes before serving."]}, {"isVegetarian": false, "title": "Thai coconut-chilli prawns", "url": "www_bbc_co_uk_food_recipes_thai_coconut-chilli_60337", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_coconut-chilli_60337_16x9.jpg", "ingredients": ["4cm/1½in piece fresh galangal, peeled, chopped", "2.5cm/1in piece fresh ginger, peeled, chopped", "2 stalks lemongrass, outer leaves removed, inner core chopped", "2 garlic cloves, peeled", "1 red chilli, stalk removed", "2 limes, zest and juice", "3 tbsp soy sauce", "small bunch fresh coriander, roots and leaves chopped separately", "1 x 100g/3½oz block dried coconut", "24 large prawns, peeled, heads removed", "½ fresh coconut, flesh only", "½ lime, cut into wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Blend the galangal, ginger, lemongrass, garlic, chilli, zest and juice of the limes, soy sauce, coriander roots and dried coconut in a food processor until well combined as a thick, rough paste.", "Transfer the paste to a resealable freezer bag and add the prawns. Seal the bag, removing as much air as possible as you do so, then massage the mixture into the prawns and set aside in the fridge to marinate for 1-2 hours, or overnight, if possible.", "Heat a frying pan over a medium heat. Using a potato peeler, shave the fresh coconut into the pan, then dry-roast the coconut shavings until lightly toasted.  Set aside.", "When the prawns have marinated, heat a griddle pan over a medium to high heat. When the pan is hot, shake any excess marinade from the prawns, then put them on the griddle, in batches if necessary, and grill for 2-3 minutes, or until pink and opaque.", "To serve, divide the coconut-chilli prawns equally among four serving plates. Sprinkle over the coriander leaves, coconut shavings and garnish with a wedge of lime. "]}, {"isVegetarian": false, "title": "Thai fish cakes with a honey and cucumber dip", "url": "www_bbc_co_uk_food_recipes_thai_fish_cakes_with_a_37638", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_fish_cakes_with_a_37638_16x9.jpg", "ingredients": ["500g/1lb 2oz skinned and pin-boned halibut fillet, chopped ", "1 tbsp Thai fish sauce", "1 dessertspoon Thai red curry paste ", "1 kaffir lime leaf, finely sliced", "1 thumb-sized piece galangal, chopped finely", "1 stick lemongrass (the soft bit only), finely sliced", "1 coriander root and leaves, chopped ", "1 free-range egg", "1 tsp grated palm sugar", "50g/1¾oz snake beans, sliced thinly (alternatively use French beans)", "½ lime, juice only", "plain flour, for dusting ", "3 tbsp groundnut oil, for shallow frying", "2 tbsp rice wine vinegar", "2 tbsp clear honey", "½ lime, juice only", "1 tbsp Thai fish sauce", "100g/3½oz cucumber, skinned, cored and diced", "50g/1¾oz carrot, finely diced", "1 shallot, finely diced", "2 birds’-eye chillies, seeds removed (if liked), sliced thinly ", "banana leaves ", "lamb’s lettuce"], "serves": "Makes 18-20", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish cakes, place the fish, fish sauce, red curry paste, lime leaf, galangal, lemongrass, coriander root, egg, palm sugar, beans, and lime juice in a food processor and blend to a paste. Alternatively this can be done in a pestle and mortar – pound the ingredients to a jelly-like paste.", "Remove and, with damp hands, take a piece about the size of a walnut. Roll it into a ball and then flatten it to a thin disc. Lay on a floured plate. Repeat until all the mixture has been used. Refrigerate until ready to cook.", "For the dip, beat together the vinegar, honey, two tablespoons of water, the lime juice and fish sauce. Taste and adjust the honey and lime juice to get it sweeter or sourer, however you want it. Add the cucumber, carrot, shallot and chilli. Leave for 30 minutes to an hour for the flavours to develop.", "Heat the groundnut oil in a frying pan and cook the fish cakes until golden-brown all over – this should take a couple of minutes on either side. ", "Serve on a banana leaf with the sauce in a dish to one side. Garnish with the lamb’s lettuce. "]}, {"isVegetarian": false, "title": "Thai crab risotto with lemongrass and kaffir lime", "url": "www_bbc_co_uk_food_recipes_thai_crab_risotto_with_18400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 crab shell, broken up", "300ml/10fl oz chicken stock ", "1 lemongrass stalk, finely chopped", "2 kaffir lime leaves, finely shredded", "1 long red chilli, roughly chopped", "2 shallots, 1 roughly chopped, 1 finely chopped", "1 tbsp tomato purée ", "300ml/10fl oz vegetable oil", "50g/1¾oz butter", "75g/3oz arborio rice", "1 tsp Thai green curry paste", "5 tbsp Muscat wine", "1 tbsp roughly chopped coriander", "1 green chilli, finely chopped", "50ml/2fl oz double cream", "50g/1¾oz picked brown crab meat", "110g/4oz picked white crab meat ", "2 tbsp freshly grated parmesan", "1 tbsp mascarpone", "1 lime, juice only", "1 tbsp coriander cress"], "serves": "Serves 2-3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make a stock, place half of the crab shell in a saucepan. Add the chicken stock, lemongrass and one kaffir lime leaf and gently heat.", "Place the rest of the crab shell on a roasting tin with the red chilli, the roughly chopped shallot and tomato purée. Pour over all the vegetable oil, then place in the oven for 30 minutes. ", "Remove the crab from the oven, mix well then carefully strain the oil into a sterilised jar and set aside.", "Heat a large frying pan or sauté pan until medium-hot. Add the butter, the finely chopped shallot and the remaining kaffir lime leaf. ", "Add the rice and stir well to coat in the buttery mixture, then add the Thai green curry paste and wine and cook until the liquid has been absorbed and the rice is nearly dry.", "Strain the warm crab stock and add it to the rice a little at a time. Cook for 15-20 minutes, or until the rice is tender and most of the stock absorbed.", "When the rice is tender, stir in the chopped coriander, green chilli, cream and fold in the picked crab.", "Add the parmesan, mascarpone and the lime juice. Check the seasoning and add more salt and pepper as required.", "Spoon onto serving plates then scatter with a little coriander cress and finish with a drizzle of the crab oil."]}, {"isVegetarian": false, "title": "Thai fish cakes with a crunchy cucumber and carrot salad", "url": "www_bbc_co_uk_food_recipes_thai_fish_cakes_with_a_57303", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb skinless white fish fillets (such as ling, haddock or cod), bones removed ", "1 tbsp fish sauce ", "1 large free-range egg ", "good handful of fresh coriander, roughly chopped", "1 tbsp red curry paste", "1 red chilli, deseeded and finely chopped", "2 garlic cloves, finely chopped", "1 thumb-sized piece of fresh root ginger, peeled and finely chopped", "1 lime, zest and juice ", "75g/2½oz green beans, finely chopped", "6 spring onions, roughly chopped ", "200g/7oz sesame seeds", "4 tbsp sunflower oil", "sweet chilli dipping sauce, to serve", "1 tsp caster sugar", "1 lime, zest and juice", "3 tbsp fish sauce", "½ red chilli, finely chopped", "large handful peanuts, toasted", "1 carrot, peeled and sliced into spaghetti-like strands using a julienne peeler or spiraliser", "1 cucumber, sliced into spaghetti-like strands using a julienne peeler or spiraliser", "3-4 shallots, finely sliced", "1 red chilli, finely sliced", "large handful beansprouts", "good handful mint leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish cakes, place the fish in a food processor and blend for 3 seconds until smooth. Add the fish sauce, egg, coriander, curry paste, chilli, garlic, ginger, lime zest and juice and blend again until everything is combined.", "Remove the blade from the food processor and stir through the green beans and half the spring onions. With damp hands, form the mixture into 12 balls and flatten to make fish cakes. Coat each fish cake with the sesame seeds. ", "Heat the oil in a large frying pan and fry the fishcakes in batches for about 2 minutes on each side. Remove with a fish slice and drain on a plate lined with kitchen paper. ", "Meanwhile, for the dressing, whisk the caster sugar, lime zest and juice and fish sauce until the caster sugar has dissolved. Whisk in the red chilli.", "For the salad, toast the peanuts in a dry frying pan until golden-brown, remove from the pan and bash roughly in a pestle and mortar. ", "Put all the rest of the salad ingredients in a large mixing bowl. Pour over the dressing and give it a good mix to combine.", "Garnish the fish cakes with the remaining spring onions and serve straight away with the salad and some sweet chilli dipping sauce."]}, {"isVegetarian": false, "title": "Thai fragrant mussels", "url": "www_bbc_co_uk_food_recipes_thai_fragrant_mussels_59021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz mussels, scrubbed and debearded", "4 spring onions, roughly chopped", "4 garlic cloves, finely chopped", "15g/½oz fresh ginger, peeled and roughly chopped", "1 lemongrass stick, bruised ", "4 fresh or dried kaffir lime leaves", "1 tbsp Thai green curry paste", "1 400ml tin coconut milk", "1 tbsp Thai fish sauce", "4 tbsp sunflower oil", "1 green chilli, finely sliced", "1 banana shallot, thinly sliced", "small bunch coriander, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with a large piece of kitchen foil. ", "Discard any mussels with broken shells and any that refuse to close when tapped.", "Place the mussels, spring onions, garlic, ginger, lemongrass and lime leaves on one half of the foil. Dot the mussels with the Thai curry paste and drizzle with some of the coconut milk and the fish sauce. Seal the foil around the edges to make a pasty-shaped bag and bake in the oven for 5–10 minutes.", "To make the garnish, heat the oil in a small frying pan and add the chilli and shallots and cook for 3–4 minutes or until crispy. Drain on kitchen paper once.", "Remove the mussels from the oven and open the parcel. Discard any mussels that remain closed., then garnish with fried chilli and shallots and a sprinkling of fresh coriander."]}, {"isVegetarian": false, "title": "Thai green curry with scallops", "url": "www_bbc_co_uk_food_recipes_thai_green_curry_with_67823", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 lemongrass stalks, chopped", "4 green bird's-eye chillies, seeds removed, chopped", "4 lime leaves, chopped", "1 lime, zest and juice only", "1 banana shallot, chopped", "2cm/¾in knob galangal (or fresh root ginger)", "2 garlic cloves, peeled and chopped", "4 tbsp coriander root", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp crushed black peppercorns", "2 tbsp Thai fish sauce", "1 tsp palm sugar", "2 tbsp vegetable oil", "400ml/14fl oz coconut milk", "125g/4½oz pea aubergines", "2 limes, juice only", "12 hand-dived scallops, scallop removed and roe discarded", "2 tbsp chopped coriander leaves ", "2 tbsp Thai basil, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the paste, place all the ingredients in a blender and blend until smooth.", "For the curry, heat a wok and add a tablespoon of oil and the paste. Cook for a couple of minutes and then add the coconut milk, pea aubergines and lime juice.", "Meanwhile, heat a large frying pan and add the remaining oil. Once hot, add the scallops. Cook for a couple of minutes on each side.", "To serve, place the scallops on serving plates and pour over the sauce, or drop the scallops in the sauce just before serving. Garnish with the coriander and Thai basil."]}, {"isVegetarian": false, "title": "Thai green curry with sticky rice", "url": "www_bbc_co_uk_food_recipes_thai_green_curry_with_89282", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 lemongrass stalks, chopped", "4 green bird's-eye chillies, seeds removed and chopped", "4 lime leaves, chopped", "1 lime, zest and juice only", "1 banana shallot, chopped", "2cm/¾in knob galangal (or fresh root ginger)", "4 tbsp chopped coriander stalks", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp crushed black peppercorns", "2 tbsp Thai fish sauce", "1 tsp palm sugar", "2 tbsp vegetable oil", "8 chicken thighs, skinned, boned and chopped", "400ml/14fl oz coconut milk", "125g/4½oz pea aubergines", "2 limes, juice only", "2 tbsp chopped coriander leaves", "2 tbsp Thai basil, torn", "400g/14oz sticky rice", "150ml/5fl oz coconut milk", "1 tsp salt", "1 head broccoli or 250g/9oz purple sprouting broccoli", "300g/10½oz sugar snap peas", "1 shallot, sliced", "2 tbsp vegetable oil", "4 tbsp fresh coriander", "75g/2¾oz salted peanuts, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients for the paste in a blender and blend until smooth.", "Heat a wok and add 1 tbsp of the oil. Add the paste and the chicken and cook for a couple of minutes. Then stir in the coconut milk, pea aubergines and lime juice. Cover with a lid and simmer gently for 10-15 minutes, or until the chicken is completely cooked through. ", "For the sticky rice, rinse the rice 3 times and drain. Put the rice in a saucepan and cover with coconut milk and water to about 1cm/½in above the rice. Add the salt and cover with a lid. Place on the heat and bring to the boil. Boil for 5 minutes, then without opening the lid, turn the heat off and steam for 20 minutes.", "Heat a steamer and cook the broccoli and peas for 2-3 minutes.", "For the garnish, heat a small frying pan and add the oil. Once hot, add the shallots and fry until golden-brown, drain on kitchen paper. ", "Place the sticky rice and curry in serving bowls and garnish with the fresh coriander, peanuts and fried shallots. Serve the steamed vegetables on the side."]}, {"isVegetarian": false, "title": "Thai green turkey meatballs", "url": "www_bbc_co_uk_food_recipes_thai_green_turkey_balls_28079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "75g/3oz cooked turkey mince", "90g/3¼oz breadcrumbs, divided", "1 tsp Thai green curry paste", "2 tbsp plain flour"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Beat one of the eggs in a bowl. Stir in the turkey mince, 30g/1oz breadcrumbs and Thai green curry paste until well combined. Divide the mixture into four portions and roll each into a ball.", "Beat the remaining egg in a bowl, sprinkle the flour and remaining breadcrumbs onto separate plates. Roll the meatballs in the flour, then dip in the beaten egg and roll in the breadcrumbs. ", "Transfer to a baking tray and bake in the oven for 15-20 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Thai jungle curry", "url": "www_bbc_co_uk_food_recipes_thai_jungle_curry_13331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 Thai shallots, finely chopped", "3 large garlic cloves, finely chopped", "thumb-sized piece galangal, coarsely grated", "5 Thai green chillies, finely chopped", "12cm/5in stalk lemongrass, outer leaves removed and white part thinly sliced", "6 coriander roots, washed and chopped", "½ tsp shrimp paste", "3 kaffir lime leaves, finely chopped", "1 tsp white peppercorns, crushed", "3 tbsp vegetable oil", "500g/1lb 2oz pork tenderloin, chopped", "5 Thai green aubergines, cut into quarters", "400g/14oz chicken stock", "2 small red chillies pierced for extra heat, chopped, with or without seeds ", "2 tbsp Thai fish sauce", "4 kaffir lime leaves ", "25g/1oz krachai, thinly sliced (a milder version of galangal and ginger, from the same family)", "1 tbsp palm sugar", "400g/14oz butternut squash, diced", "40g/1½oz pea aubergines, available in jars at large supermarkets or fresh at Asian supermarkets", "1 stem fresh green peppercorns (optional), alternatively use ½ tsp brined green peppercorns from a jar", "7 Chinese long beans, cut into 2.5cm/1in slices, alternatively use French beans", "1 large handful holy basil, torn", "steamed or boiled rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the paste, either place all the ingredients in a small blender with two tablespoons of water and blend, or finely chop and grind in a pestle and mortar.", "For the curry, place a large wok over a medium heat, add the vegetable oil and then add the paste. Stir occasionally for 3-4 minutes to cook through.", "Add the pork and stir fry to brown the meat on all sides. Add the quarters of Thai green aubergine, the hot stock, chilli and fish sauce. Bring to the boil and then reduce the heat to a simmer and cook for 5-8 minutes. ", "Add the lime leaves, kracthai, palm sugar, butternut squash, pea aubergines and fresh green peppercorns (or brined peppercorns). ", "Cook for a further 10 minutes, or until the butternut squash and green aubergines are just about cooked.", "Finally add the chopped long beans and simmer for four minutes. Stir through the holy basil just before serving. Serve with steamed or boiled rice."]}, {"isVegetarian": false, "title": "Thai lamb salad with spicy dressing", "url": "www_bbc_co_uk_food_recipes_thai_lamb_salad_with_26133", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_lamb_salad_with_26133_16x9.jpg", "ingredients": ["2 red chillies, 1 chopped, 1 finely sliced (for garnish)", "4 garlic cloves, crushed", "90g/3¼oz root ginger, roughly chopped", "2 tbsp palm sugar (or light brown sugar)", "6 tbsp soy sauce", "4 tbsp fish sauce", "300g/10½oz cooked leftover lamb, fat left on, cut into thick slices", "½ cucumber, cut in half lengthways, thinly sliced on the diagonal", "100g/3½oz fresh peas", "100g/3½oz sugarsnap peas, sliced lengthways", "75g/3oz beansprouts", "6 spring onions, trimmed, sliced on the diagonal", "3 tbsp roughly chopped fresh mint leaves", "small handful coriander sprigs", "2 limes, juice only", "25g/1oz pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the chopped chilli, garlic, ginger and palm sugar to a fine paste in a food processor. Add the soy and fish sauces and blend again. Taste and adjust the seasoning if necessary.", "Heat a frying pan over a medium to high heat. Add the lamb slices and fry for 2-3 minutes, or until crisp on one side. Add half of the chilli-and-ginger dressing and continue to cook until the lamb slices are coated in it and it is heated through. Remove the sticky lamb from the pan and set aside.", "In a bowl, mix together the cucumber, peas, sugarsnap peas, beansprouts, spring onions, mint leaves and coriander until well combined. Add enough of the remaining dressing to coat the ingredients, then gradually drizzle in the lime juice, tasting regularly. Add the pea shoots and mix well.", "To serve, divide the salad equally among four serving plates. Top each serving with some of the lamb. Drizzle over a little more of the dressing, then sprinkle with the finely sliced chilli and serve immediately."]}, {"isVegetarian": false, "title": "Thai massaman chicken curry", "url": "www_bbc_co_uk_food_recipes_thai_massaman_chicken_82428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cardamom pods, seeds only", "1 tsp cumin seeds", "5 cloves", "1½ star anise", "1 tsp whole white peppercorns", "½ tsp ground cinnamon", "2 tsp dried chilli flakes", "2 tbsp groundnut oil", "25g/1oz peanuts", "5 garlic cloves, peeled and roughly chopped", "5 lime leaves, finely sliced", "3.5cm/1½in piece fresh galangal, peeled and roughly chopped", "2 sticks lemongrass, outer leaves removed, inner core finely chopped", "1 tsp shrimp paste", "2 tbsp fish sauce", "½ tsp grated or ground nutmeg", "2 tbsp palm sugar", "2 tbsp cold water", "2 tbsp vegetable oil", "2 red onions, sliced", "500g/1lb 2oz chicken breast, cut into 1.5cm/½in strips", "1 large potato, peeled and cut into 1.5cm/½in cubes", "2 bird’s-eye red chillies, cut almost in half lengthways (or more, to taste)", "250ml/9fl oz good-quality chicken stock, preferably homemade", "200ml/7fl oz coconut milk", "2 tomatoes, skins removed, flesh roughly chopped", "6 lime leaves", "2 tbsp fish sauce", "1½ tbsp palm sugar", "2 tbsp soy sauce", "1 lime, juice only", "small handful sweet Thai basil (or normal basil), plus extra sprigs to serve", "25g/1oz roasted peanuts, roughly chopped", "steamed sticky rice", "1 large red chilli, sliced diagonally"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the massaman curry paste, heat a small frying pan over a medium heat. When the pan is hot, add the cardamom seeds, cumin seeds and cloves and dry-fry for 1-2 minutes, or until fragrant.  ", "Transfer the spices to a spice grinder or pestle and mortar and grind to a powder.", "Blend the ground spices with all of the remaining massaman curry paste ingredients in a food processor, until smooth and well combined. (Alternatively, pound the paste until smooth in a pestle and mortar.) Chill until needed, covered.  ", "To make the chicken curry, heat the oil in a medium-sized, flameproof, lidded casserole. Add the onions and fry for 8-10 minutes, or until softened and light golden-brown.", "Increase the heat, push the onions to one side of the casserole, then add the chicken strips to the other side and fry for 2-3 minutes on all sides, or until sealed all over. ", "Add half of the massaman curry paste to the casserole (see tip). Stir well to coat the chicken and onions in the paste. Fry the mixture for 1-2 minutes, or until fragrant. ", "Add the potatoes, chillies, chicken stock, coconut milk, tomatoes, lime leaves, fish sauce, palm sugar and soy sauce to the casserole. Stir well and bring the mixture to the boil, then cover the casserole with the lid and reduce the heat until the mixture is simmering. Continue to simmer for 12-15 minutes, or until the chicken is cooked through (do not overcook the chicken as it will become dry). Season, to taste, with a little more fish sauce or some lime juice.", "Just before serving, stir in the basil leaves and half of the peanuts.", "To serve, spoon the Thai massaman curry into bowls and garnish with the extra Thai basil leaves, the sliced red chilli, and the remaining peanuts. Serve with steamed sticky rice."]}, {"isVegetarian": false, "title": "Thai noodle and pork soup", "url": "www_bbc_co_uk_food_recipes_thai_noodle_and_pork_29741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz dried wholewheat noodles", "200g/7oz pork mince", "2 tbsp olive oil", "2 tbsp Thai green curry paste", "700ml/1¼ pints hot good vegetable stock", "salt and freshly ground black pepper", "big bunch fresh coriander, chopped, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the noodles in salted water according to the packet instructions.  ", "Put the pork mince in a bowl and season with salt and pepper. Roll into eight balls using the palms of your hands.  ", "Heat half the oil in a heavy-based frying pan. Fry the meatballs, turning regularly, for 6–8 minutes, or until browned on all sides and cooked through.   ", "Heat the remaining oil in a heavy-based saucepan. Add the curry paste and cook, stirring, for 1 minute. Pour in the stock and simmer for 5 minutes. ", "Divide the noodles between two bowls. Pour in the Thai stock. Drop in the meatballs and stir in the coriander, if using. "]}, {"isVegetarian": false, "title": "Thai noodles with cinnamon and prawns", "url": "www_bbc_co_uk_food_recipes_thai_noodles_with_72276", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_noodles_with_72276_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "2 garlic cloves, roughly chopped", "3cm/1¼in piece fresh root ginger, peeled and cut into fine matchsticks", "1 star anise", "½ long or 1 short stick cinnamon, broken into shards", "2–3 leafy stems from the top of 1 stick celery, stems cut into short lengths, leaves roughly chopped", "1½ tbsp light soy sauce", "1 tbsp dark soy sauce", "1 tbsp oyster sauce", "¼ tsp ground white pepper", "1 tsp chicken stock concentrate", "1 tbsp ketjap manis (or 1 tbsp dark soy sauce mixed with 1 tbsp soft dark brown sugar)", "10 raw peeled king prawns, thawed if frozen", "80g/2¾oz mung bean (glass) noodles or rice vermicelli, soaked and drained as per packet instructions", "fat pinch ground cinnamon", "fat pinch ground cloves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["On a high heat, heat the oil in a large wok. Add the garlic, ginger, star anise, cinnamon and the sliced leafy stems of celery, reserve the celery leaves for a garnish. Cook, stirring, for 1 minute. Stir in both soy sauces and leave to simmer for 30 seconds, then stir in the oyster sauce and ground pepper.", "Add 100ml/3½fl oz cold water, followed by the chicken stock concentrate and the ketjap manis (or the mixture of dark soy sauce with soft brown sugar), stir until everything’s well combined and bring to the boil.", "Add the king prawns, immersing them in the liquid. Simmer until the prawns are cooked through. Finally, add the drained noodles and stir well – I find a couple of pasta forks, one in each hand, best for this – so that everything is combined, and most of the dark liquid is absorbed. Add the pinches of ground cinnamon and cloves, stir again, and if you’re not serving straight from the wok, pour into a serving bowl, and sprinkle with the reserved chopped celery leaves."]}, {"isVegetarian": false, "title": "Thai massaman prawn curry with Jersey Royal potatoes", "url": "www_bbc_co_uk_food_recipes_thai_massaman_prawn_09170", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 cardamom pods, cracked and seeds reserved", "1 tsp cumin seeds", "5 cloves", "1½ star anise", "1 tsp white peppercorns", "½ tsp ground cinnamon", "2 tsp dried chilli flakes", "2 tbsp groundnut oil", "5g peanuts", "5 garlic cloves, roughly chopped", "5 lime leaves, finely sliced", "30g/1oz galangal, peeled and roughly chopped", "2 lemongrass stalks, peeled and finely chopped", "1 tsp dried shrimp paste", "2 tbsp Thai fish sauce", "½ tsp freshly grated nutmeg", "2 tbsp grated palm sugar", "2 tbsp groundnut oil", "2 red onions sliced", "250g/9oz Jersey Royals, halved or quartered depending on size", "2 red bird’s-eye chillies, slashed", "250ml/9fl oz chicken stock", "250ml/9fl oz low-fat coconut milk", "2 tomatoes, skinned and finely chopped", "6 kaffir lime leaves", "1½ tsp grated palm sugar", "2 tbsp soy sauce", "2 tbsp Thai fish sauce, plus extra to taste", "500g/1lb 2oz king prawns, veins removed", "1 lime, juice only", "handful of Thai basil", "25g/1oz toasted peanuts, roughly chopped", "1 large red chilli, deseeded and sliced on an angle", "steamed sticky rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the curry paste, in a small, dry frying pan toast the cardamom, cumin seeds, cloves and star anise. Tip into a small blender or spice grinder, or pestle and mortar, and work to a powder. Add all the other ingredients along with 2 tablespoons water and blend to a paste. Set aside.", "For the curry, heat the oil in a large frying pan and cook the onions for a few minutes until soft and golden-brown. Add half the curry paste and cook for a minute or so. Add the potatoes, slashed bird’s-eye chillies, stock, coconut milk, chopped tomatoes, lime leaves, palm sugar, soy sauce and fish sauce. Simmer for about 15 minutes until the potatoes are tender and the wonderful flavours have developed.", "Add the prawns and cook for a couple of minutes until cooked just through. ", "Check the seasoning, add a little more fish sauce if necessary, and stir in the lime juice and basil, keeping a few leaves back for garnish. Add half the chopped peanuts. ", "To serve, spoon into bowls and garnish with the reserved basil, peanuts and top it off with the red chilli. Serve with some steamed sticky rice."]}]