[{"isVegetarian": false, "title": "Turkey meatballs with spaghetti and tomato sauce", "url": "www_bbc_co_uk_food_recipes_carolinesturkeymeatb_82302", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carolinesturkeymeatb_82302_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 medium onion, chopped ", "40g/1½oz white breadcrumbs ", "50ml/2fl oz milk", "250g/9oz turkey mince", "1 small apple, peeled and grated", "1 tsp fresh thyme leaves ", "½ tsp salt and freshly ground black pepper", "1 tbsp flour, for dusting", "2 tbsp sunflower oil", "1 tbsp olive oil", "1 medium onion, chopped ", "1 clove garlic, crushed", "400g/14oz tin chopped tomatoes ", "100ml/3½fl oz water", "1 tbsp tomato purée ", "2 tsp sugar ", "¼ tsp dried oregano ", "pinch dried chilli flakes", "salt and freshly ground black pepper", "250g/9oz dried spaghetti", "chopped fresh parsley or basil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the meatballs, heat the oil in a pan and fry the onion for about 10 minutes until softened. ", "Meanwhile, soak the breadcrumbs in the milk for 10 minutes in a large bowl.", "For the sauce, heat the oil in a pan and fry the onion for about 10 minutes until softened. Add the crushed garlic and sauté for one minute.", "Add all the remaining ingredients and simmer, covered, for seven minutes. ", "For the meatballs, add the turkey mince, grated apple, thyme, sautéed onions, salt and freshly ground black pepper to the soaked breadcrumbs and mix together. ", "Using floured hands, form teaspoons of the turkey mixture into small balls.", "Heat the sunflower oil in a frying pan and brown the meatballs. Transfer the meatballs to the pan of tomato sauce and simmer, uncovered, for 8-10 minutes.", "Cook the spaghetti according to the instructions on the packet. Drain and toss with the sauce. Sprinkle with a little chopped parsley or basil and serve."]}, {"isVegetarian": true, "title": "Carol's bran muffins", "url": "www_bbc_co_uk_food_recipes_carolsbranmuffins_91964", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["240g/8½oz bran cereal sticks", "100g/3½oz butter, softened", "200g/7oz caster sugar", "2 ripe bananas, peeled, mashed", "2 free-range eggs, beaten", "1 lemon, juice only", "450ml/16fl oz milk", "300g/10½oz plain flour", "2½ tsp baking powder", "½ tsp fine sea salt", "220g/½ lb raisins or sultanas"], "serves": "Makes 20-24", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Pour half of the bran sticks into a large mixing bowl. Pour over 200ml/7fl oz boiling water. Set aside until the bran sticks have softened and absorbed most of the water and the water has cooled. ", "In a separate mixing bowl, cream together the butter and sugar. Add portions of the mashed banana and beaten egg a little at a time, beating well after each addition, until the mixture is smooth and well combined. ", "Mix together the lemon juice and milk, then add the mixture to the muffin batter a little at a time, beating after each addition, until all of the liquid has been incorporated into the batter. ", "Add the cooled, softened bran mixture to the batter and stir well to combine. (NB: At this point, the mixture will look as if it has curdled, but don't worry.)", "Sift the flour and baking powder into the batter mixture and stir until combined. ", "Add the salt, then stir in the raisins or sultanas and the remaining bran sticks until well combined.", "Place one paper muffin case or one large square of greaseproof paper into each well of a 24-hole muffin tin. Divide the muffin batter equally among the muffin cases. ", "Transfer the muffins to the oven and bake for 25-30 minutes, or until risen, golden-brown and cooked through. (NB: The muffins are cooked through when a skewer inserted into the centre comes out clean.)"]}, {"isVegetarian": false, "title": "Carpaccio of tuna and tomato with lime and sesame", "url": "www_bbc_co_uk_food_recipes_carpacchiooftunaandt_84780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 lemon, juice only", "1 lime, juice only", "1 tbsp balsamic vinegar", "100g/3½oz very fresh raw tuna, thinly sliced", "2 tomatoes, thinly sliced", "1 tbsp chopped fresh parsley", "1 tbsp sesame seeds", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the olive oil, lemon and lime juice and balsamic vinegar into a bowl and mix well.", "Add the tuna to the bowl and let the fish marinate in the bowl for ten minutes.", "To serve, arrange the tomato slices on a clean plate and place the tuna on top of the tomato. Sprinkle the fresh parsley and sesame seeds over the top and season with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Carpaccio of beef with pickled baby beetroots and salsa verde", "url": "www_bbc_co_uk_food_recipes_carpaccio_of_beef_with_48203", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz beef fillet, trimmed", "1 tbsp olive oil", "salt and freshly ground black pepper", "200g/7oz caster sugar", "200ml/7fl oz white wine vinegar", "pinch salt", "1 bunch baby heritage beetroots, sliced on a mandoline", "1 banana shallot, finely chopped", "3 tbsp roughly chopped fresh mint", "3 tbsp torn fresh basil", "3 tbsp roughly chopped flat leaf parsley", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 unwaxed lemon, zest only", "2 tbsp capers, drained ", "4 anchovies, roughly chopped", "3 tbsp extra virgin olive oil", "½ small loaf sourdough, sliced", "1 garlic clove, peeled and left whole", "2 tbsp olive oil", "10g/½oz bull's blood leaves", "5g baby bull's blood leaves", "½ bunch watercress", "½ red onion, finely diced ", "1-2 tbsp extra virgin olive oil"], "serves": "Serves 2-3", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the beef, season the beef fillet with salt and freshly ground black pepper. Heat a frying pan until smoking, add the olive oil and sear the beef for 2-3 minutes on all sides, until golden-brown.", "Remove the beef from the pan and cover in cling film and roll into a barrel shape, twisting tightly at both ends to seal. Refrigerate for 1 hour, or until firm.", "For the pickles, put the sugar, vinegar, salt and 400ml/14fl oz water into a non-reactive pan and bring to the boil. Pour half the pickling liquor into a separate pan. Add the beetroot to one pan and the shallot to the other, then remove from the heat and set aside to cool. Drain well. ", "For the salsa verde, put all the ingredients in a pestle and mortar and pound until you have a thick paste.", "Heat a griddle pan until hot. Rub the sliced sourdough with the garlic and drizzle with some of the olive oil. Toast the bread in the pan for 1-2 minutes on each side, or until charred.", "To serve, slice the beef and lay it on a large serving plate in a fan shape. Dot salsa verde around the plate and garnish with the bull's blood and watercress leaves and red onion. Drizzle with the extra virgin olive oil and serve with the pickles and bread. "]}, {"isVegetarian": false, "title": "Carpaccio of salmon with a soy dressing and sesame seeds", "url": "www_bbc_co_uk_food_recipes_carpaccioofsalmonwit_92459", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sesame oil", "1 tbsp soy sauce", "½ lime, juice only", "85g/3oz salmon fillet, skin removed, thinly sliced", "1 tbsp chopped fresh coriander leaves", "1 tsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the sesame oil, soy sauce and lime juice in a bowl to make a soy dressing. ", "Arrange the thinly sliced salmon onto a plate and pour over the soy dressing.", "Set the salmon aside to marinate in the dressing for 5-10 minutes.", "To serve, garnish the salmon with the coriander leaves and sesame seeds."]}, {"isVegetarian": false, "title": "Carrot and coriander soup with crab beignets", "url": "www_bbc_co_uk_food_recipes_carrot_and_coriander_40102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "1 onion, thinly sliced", "400g/14oz carrots, roughly chopped", "1 tbsp ground coriander", "500ml/18fl oz vegetable stock", "2 tbsp roughly chopped coriander leaves", "salt and freshly ground black pepper", "vegetable oil, for frying", "50g/1¾oz butter, diced", "75g/2¾oz plain flour", "½ tsp cayenne pepper", "2 free-range eggs", "75g/2¾oz white crabmeat", "30g/1oz brown crabmeat", "drizzle of olive oil", "2 tbsp baby coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the olive oil and the butter in a large lidded saucepan. Add the onion, cover and fry for 3-4 minutes. Add the carrots and ground coriander and gently fry for a further 2-3 minutes.", "Add the stock and bring to the boil. Reduce to a simmer and cook for 5 minutes, or until the carrots are tender. Add the chopped coriander then put the soup in a blender and pulse until smooth. Season with salt and pepper.", "Heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. ", "Heat the butter and 125ml/4fl oz water in a saucepan until boiling, then boil for 1 minute. Remove the pan from the heat and beat in the flour and cayenne pepper using a wooden spoon until smooth, or until the mixture comes away from the side of the pan. Return the pan to the heat and cook for 1-2 minutes, stirring continuously.", "Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the second egg.", "Stir in the white and brown crabmeat and mix until well combined, then season with salt and pepper.", "Spoon the mixture into a piping bag fitted with a large plain nozzle. Carefully pipe 1½cm/½in long sections into the hot oil and fry for 1-2 minutes or until golden-brown and crisp. Remove the beignets from the pan using a slotted spoon, drain on kitchen paper and season with salt. ", "To serve, ladle the soup into bowls, scatter over some crab beignets. Drizzle with olive oil and garnish with the baby coriander."]}, {"isVegetarian": false, "title": "Carpet bag steak with potatoes and black olives", "url": "www_bbc_co_uk_food_recipes_carpetbagsteakwithpo_70663", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 7oz fillet steaks", "8 slices of pancetta or streaky bacon", "8 oysters, water reserved", "butter for frying", "300ml/½ pint/1¼ cups of olive oil", "400g/13oz new potatoes scrubbed and cut into 1in/2.5cm chunks", "200g/7oz tomatoes cut into 2cm/¾in chunks", "200g/7oz small onions, halved top to bottom", "2 garlic cloves, finely chopped", "2 sprigs thyme", "2 sprigs sage", "sea salt", "freshly ground black pepper", "60g/2oz/½ cup pitted black olives", "60g/2oz flat leaf parsley, stems removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Slit the steaks to make a pouch, stuff with a couple of wet oysters and then wrap around two pieces of pancetta or streaky bacon.", "Heat 50g/1¾oz of butter in a heavy frying pan, over a medium heat and put in the steaks.", "For medium-rare, cook for roughly 3 minutes on each side, then remove from the pan. ", "Take the pan off the heat, pour in the reserved oyster water and scrape any bits from the bottom to the surface.", "Finally, pour the resulting liquid over the steaks.", "To make the potatoes pre heat the oven to 190C/375F/ Gas 5. ", "Warm the olive oil in a heavy casserole dish over a medium heat.", "Add the potatoes, tomatoes, onions, garlic cloves, thyme and sage and bring to the boil.", "Season well and simmer for 8-10 minutes, then cover and cook in the oven for half an hour, or until the potatoes are cooked through (do not stir as this will break up the vegetables). ", "Allow to cool slightly, then add the olives and parsley. Finally, serve with the carpet bag steaks."]}, {"isVegetarian": true, "title": "Carrot and coriander falafel", "url": "www_bbc_co_uk_food_recipes_carrot_and_coriander_72724", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_coriander_72724_16x9.jpg", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds", "2 x 400g/14oz cans chickpeas, drained", "salt and freshly ground black pepper", "1½ tsp baking powder", "1 tbsp plain flour", "100g/3½oz carrot, finely grated (moisture squeezed out)", "1 red chilli, finely chopped", "1 tbsp chopped fresh coriander", "1 garlic clove, crushed", "2 tbsp chopped  fresh parsley", "1 lemon, zest only", "vegetable oil, for frying", "sesame seeds, to garnish", "100ml/3½fl oz Greek yoghurt ", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint", "1 lime, juice only", "1 tbsp tahini", "toasted pitta breads"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the falafels, toast the cumin and coriander seeds in a dry frying pan for 1-2 minutes, or until fragrant. Grind the seeds in a pestle and mortar.", "Blend the toasted spices together with the remaining falafel ingredients in food processor until well combined.", "Shape spoonfuls of the falafel mixture into balls and set aside on a plate.", "Meanwhile, heat 1cm/½in vegetable oil in a frying pan and fry the falafels for 1-2 minutes on each side. Remove the falafel from the pan with a slotted spoon and set aside to drain on kitchen paper. Sprinkle with the sesame seeds.", "For the yoghurt dip, blend the Greek yoghurt, coriander, mint, lime and tahini in a food processor until smooth.", "Serve the falafels with toasted pitta breads and the yoghurt dressing alongside."]}, {"isVegetarian": true, "title": "Carrot and courgette muffins", "url": "www_bbc_co_uk_food_recipes_carrot_and_courgette_63594", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_courgette_63594_16x9.jpg", "ingredients": ["1 free-range egg", "¼ courgette (about 20g/¾oz), trimmed, grated", "¼ carrot (about 20g/¾oz), peeled, grated", "1 heaped tbsp raisins", "2 tbsp milk", "1 tbsp sunflower oil", "75g/3oz plain flour", "15g/½oz light soft brown sugar", "1 tsp baking powder"], "serves": "Makes 9", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Line a nine-hole mini-muffin tray with muffin cases.", "Beat the egg in a bowl, then stir in the grated courgette, grated carrot, raisins, milk and sunflower oil. ", "In a separate bowl, mix together the flour, sugar and baking powder. ", "Gradually stir the wet mixture into the dry mixture until sticky and well combined.", "Divide the cake mixture among the muffins cases in the muffin tray. Bake in the oven for 12–15 minutes, or until a skewer inserted into the centre of the muffins comes out clean. Remove each muffin from the tray and set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Carrot and pistachio baklava", "url": "www_bbc_co_uk_food_recipes_carrot_and_pistachio_18331", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["9 medium carrots, peeled, coarsely grated", "2 tsp sea salt flakes", "125g/4½oz peeled pistachios, roughly chopped", "1 tsp ground cinnamon ", "½ orange, juice and zest", "½ lemon, juice and zest", "3 tbsp ground almonds ", "3 star anise", "150g/5oz clear honey", "250g/9oz caster sugar", "150g/5oz unsalted butter, melted ", "500g/1lb 2oz ready-made filo pastry "], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Gather the grated carrot into a clean tea towel, sprinkle with the salt and set aside for at least an hour, or ideally overnight, so that the salt can absorb the moisture from the carrots.", "Squeeze the carrots in the tea towel to remove any excess moisture, then transfer the carrot to a bowl and stir in the pistachios, ground cinnamon, orange and lemon zest and ground almonds until well combined. Set aside. ", "Heat the star anise, honey and sugar in a heavy-based saucepan until the sugar is dissolved and the mixture is just coming up to the boil. ", "Add the lemon and orange juices, and 200ml/7fl oz water, stir well, then remove the pan from the heat and set aside to cool completely. ", "Strain the cooled syrup through a fine sieve into a bowl, then cover and chill in the fridge until needed.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Grease the inside of the baking tin with a little of the melted butter. Working quickly, brush each sheet of filo pastry all over with melted butter. Arrange one-third of the filo sheets in layers at the bottom of the baking tin.", "Spread half of the carrot mixture in an even layer on top of the filo pastry. Arrange half of the remaining buttered filo sheets on top of the carrot mixture. ", "Repeat the process with the remaining carrot mixture and top with the remaining sheets of buttered filo pastry. Trim the edges of the pastry block using a sharp knife.", "Cut the baklava into equally sized diamond shapes, about 5cm/2in across, then transfer the baking tin to the oven and bake the baklava for 35-40 minutes, or until the pastry is crisp, puffed up and golden-brown. ", "Remove the baklava from the oven and pour over half of the chilled syrup. Set aside for 5 minutes to soak, then pour over the remaining syrup. Set aside to cool slightly, then serve."]}, {"isVegetarian": true, "title": "Carrot and ginger soup", "url": "www_bbc_co_uk_food_recipes_carrot_and_ginger_soup_64093", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_ginger_soup_64093_16x9.jpg", "ingredients": ["1 tsp rapeseed oil", "1 small onion (75g/2½oz peeled weight), finely chopped ", "1 garlic clove, finely chopped", "20g/¾oz fresh root ginger, peeled and finely chopped ", "200g/7oz carrots, roughly chopped", "300ml/10fl oz vegetable stock", "freshly ground black pepper", "1 spring onion, finely chopped, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in small saucepan over a medium heat. Add the onion and cook for 2–3 minutes. Add the garlic, ginger and carrots and cook for 5 minutes, stirring occasionally. ", "Add the stock and season with pepper to taste. Bring to the boil, then reduce the heat, cover and simmer for 20 minutes, or until the carrots are soft.", "Pour the soup into a food processor and blend until smooth. Return to the pan and reheat gently. ", "To serve, pour the soup into a warm serving bowl and garnish with the spring onions. "]}, {"isVegetarian": true, "title": "Carrot and poppyseed salad", "url": "www_bbc_co_uk_food_recipes_carrot_and_poppyseed_72665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_poppyseed_72665_16x9.jpg", "ingredients": ["6 medium carrots, peeled, grated (see tip)", "1 small lemon, juice only", "4 tbsp olive oil", "1 tsp caster sugar", "1 tsp poppy seeds"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all of the ingredients in a bowl, season with salt and pepper and mix well."]}, {"isVegetarian": true, "title": "Carrot and sultana cake with creamy orange frosting", "url": "www_bbc_co_uk_food_recipes_carrot_and_sultana_cake_49411", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_sultana_cake_49411_16x9.jpg", "ingredients": ["200g/7oz self-raising flour", "75g/3oz sultanas", "75g/3oz pecans, broken into rough pieces", "½ large orange, zest only", "1 tsp ground cinnamon", "½ whole nutmeg, finely grated", "1 tsp baking powder", "½ tsp bicarbonate of soda", "pinch fine sea salt", "3 free-range eggs", "175ml/6fl oz sunflower oil, plus extra for greasing", "175g/6oz soft light brown sugar", "200g/7oz carrots, grated", "100g/3½oz icing sugar", "100g/3½oz unsalted butter, softened", "1 tsp fresh orange juice", "200g/7oz full-fat cream cheese", "½ orange, zest only", "25g/1oz pecan nuts, roughly broken"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C (fan)/Gas 4. Grease and line a 20cm/8in square loose-bottomed cake tin.", "Place the flour, sultanas, pecans, orange zest, cinnamon, grated nutmeg, baking powder, bicarbonate of soda and salt in a large bowl and mix until well combined.", "Beat the eggs until smooth.  Add the sunflower oil and sugar and whisk until well combined. ", "Make a well in the centre of the flour mixture and beat in the egg mixture until smooth. Stir in the carrots. Pour the mixture into the prepared cake tin and smooth the surface. Bake in the centre of the oven for 35-40 minutes, until the cake is well risen and feels springy to the touch. (Test the cake by inserting a skewer into the centre. If the skewer comes out clean, the cake is done.)", "Remove the cake from the oven and set aside to cool in the tin for five minutes. Remove the cake from the tin and set aside to cool on a wire rack.", "For the icing, sift the icing sugar into a large bowl and add the butter and orange juice. Beat together with a large wooden spoon until light and creamy.  Add the cream cheese and orange zest and beat until smooth. Cover and chill in the fridge for 30 minutes or until firm enough to spread. ", "Spread the icing over the cake and sprinkle with the pecans. Cut into squares to serve. "]}, {"isVegetarian": true, "title": "Carrot and walnut cake", "url": "www_bbc_co_uk_food_recipes_carrot_and_walnut_cake_50535", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "200g/7oz light brown sugar", "pinch salt", "85g/3oz vegetable oil, plus extra for greasing", "250g/9oz carrots, grated ", "35g/1¼oz walnuts, chopped ", "125g/4½ oz strong flour, sifted", "½ tsp baking powder", "½ tsp bicarbonate of soda", "1 tsp ground cinnamon", "200g/7oz cream cheese", "100g/3½oz caster sugar ", "50g/1¾oz pistachio paste (available online)", "few drops green food colouring", "250g/9oz marzipan", "few drops orange food colouring", "few drops red food colouring", "20g/¾oz cocoa powder", "6 tbsp cocoa nibs"], "serves": "Makes 6 small cakes", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and grease six 10x5cm/4x2in disposable rectangular moulds or a six cup muffin tin.", "To make the cake, whisk the eggs, sugar, salt and oil together in a large bowl. Add the carrots, walnuts, flour, baking powder, bicarbonate of soda and cinnamon and fold in to combine.  ", "Spoon the batter into the moulds or muffin tin and bake for 25 minutes.", "Meanwhile, make the topping. In a bowl combine the cream cheese, sugar and pistachio paste. Add green food colouring, stirring through a drop at a time, until you get an even light-green colour. Set aside until ready to use.", "When cooked, remove the cakes from the oven and set aside to cool. When completely cool, spread the topping over the cakes.", "To decorate, massage the marzipan to soften. Set aside a third of the marzipan. Knead in the orange and a little red food colouring into the remaining marzipan until you have bright-orange ‘carrot’ colour. Mould into mini carrots. Knead the green food colouring into the reserved marzipan, mould it into carrots tops and attach them to the orange ‘carrots’.", "Place them on top of the cake and dust with cocoa powder.", "Along the top of each cake, sprinkle a line of cocoa nibs to look like soil with the green tops of the carrots sticking out."]}, {"isVegetarian": true, "title": "Carrot cake", "url": "www_bbc_co_uk_food_recipes_carrot_cake_29800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140ml/4¾fl oz vegetable oil, plus extra for greasing", "2 free-range eggs", "200g/7oz light brown sugar", "300g/10½oz grated carrots, (grated weight)", "100g/3½oz raisins", "75g/2½oz pecans or walnuts, chopped (optional)", "180g/6oz self-raising flour", "1 pinches salt", "½ tsp bicarbonate of soda", "1 tsp ground cinnamon", "½ tsp freshly grated nutmeg", "½ tsp mixed spice", "250g/9oz cream cheese, chilled", "50g/1¾oz butter, at room temperature", "1 tsp vanilla extract", "275g/9¾oz icing sugar, sifted", "1 orange, zest only"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Oil and line a 13 x 23cm/5 x 9in loaf tin with greaseproof paper.", "For the carrot cake, beat the eggs in a large bowl, then add the oil, brown sugar, grated carrot, raisins and chopped nuts.", "Sift in the rest of the dry ingredients and bring the mixture together using a wooden or large metal spoon until well combined.", "Pour the mixture into the prepared loaf tin, smooth the surface and bake in the oven for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean.", "Remove from the oven and allow the cake to cool in the tin for about five minutes before removing. Cool completely on a wire rack before serving.", "For the icing, beat the cream cheese and butter together in a bowl until well combined. Add the vanilla extract, icing sugar and orange zest and mix until the icing is smooth and thick. Using a palette knife, spread the icing evenly over the cooled cake, dipping the knife into a bowl of hot water if the icing is hard to spread out. Cut into slices to serve."]}, {"isVegetarian": true, "title": "Carrot cake muffins", "url": "www_bbc_co_uk_food_recipes_carrot_cake_muffins_57211", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_cake_muffins_57211_16x9.jpg", "ingredients": ["75g/2½oz shredded bran cereal", "225ml/8fl oz milk", "1 medium orange, zest only", "120g/4oz cream cheese", "1 tbsp caster sugar", "3 large carrots, peeled ", "125g/4½oz light-brown muscovado sugar", "200g/7oz self-raising flour", "1 tsp baking powder", "1½ tsp ground cinnamon", "1tsp ground ginger", "2 free-range eggs", "4 tbsp sunflower oil"], "serves": "Makes 12 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the bran cereal and milk in a large mixing bowl and stir just to mix. Leave to soak for 15 minutes. Meanwhile, preheat the oven to 220C/425F/Gas 7. Line a 12-hole muffin tray with paper muffin cases.", "Add half the zest to the cereal and milk and put to one side. In a small bowl, add the cream cheese and caster sugar to the remaining zest and mix well – this will be your filling. ", "Using the coarse-hole side of a grater, grate the carrots onto a board. Weigh out 150g/5½oz grated carrot and add to the large bowl. (Save any leftover carrots for a salad.)", "By now the cereal will be very mushy. Add the brown sugar and mix well with a wooden spoon. Sift in the flour, baking powder, cinnamon and ginger but don’t mix them in just yet.  ", "Break the eggs into another bowl and add the oil. Beat with a fork just until the egg yolks are broken up and mixed with the whites. Tip into the large bowl and mix everything together with the wooden spoon. ", "Using a medium-sized spoon, drop a dollop of the carrot mixture into each paper muffin case in the tray. Drop a small spoonful of the cream cheese filling into the middle. ", "Cover the filling with the rest of the carrot mixture, dividing it evenly among the cases. Place in the heated oven and bake for about 20 minutes until golden-brown. Check the muffins are cooked by gently pressing the centre of a muffin with your finger – if it springs back then it’s ready.", "Remove the tray from the oven and leave for five minutes, then carefully transfer the muffins to a wire rack to cool. Store in an airtight container and eat within 24 hours."]}, {"isVegetarian": true, "title": "Carrot cake overnight oats", "url": "www_bbc_co_uk_food_recipes_carrot_cake_overnight_28085", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz porridge oats or rolled oats", "40g/1½oz carrot, finely grated", "½ apple, finely grated", "small handful raisins", "½ tsp mixed spice", "1 tsp brown sugar", "150ml/5fl oz milk or soya milk"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place all the ingredients in a jar, stir, put the lid on and store in the fridge overnight. "]}, {"isVegetarian": true, "title": "Carrot, cumin and barley summer stew", "url": "www_bbc_co_uk_food_recipes_carrot_cumin_and_barley_69308", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_cumin_and_barley_69308_16x9.jpg", "ingredients": ["500ml/18fl oz carrot juice ", "large pinch of sea salt ", "1 tsp ground cumin ", "6 carrots (ideally Early Nantes), skin on, scrubbed, halved lengthways then cut into 1cm/½in slices at an angle ", "2 tbsp rapeseed oil ", "80g/2¾oz white onion (about ½ a medium onion), chopped ", "2 Pasilla Bajio chillies, deseeded and finely chopped ", "150g/5½oz pearl barley ", "1 tsp ground cumin ", "1 corn cob, cooked in boiling water for 20 minutes, covered ", "4 rainbow chard leaves, rolled and chopped; stems cut into 3cm/1¼in pieces ", "3 spring onions, finely sliced ", "small bunch coriander, chopped ", "½ lemon, juice only ", "salt and freshly ground black pepper", "1½ tbsp rapeseed oil ", "micro coriander (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the carrots, in a large saucepan over a medium heat, bring the carrot juice and 100ml/3½fl oz water to the boil, then add the salt and cumin. Add the carrots and simmer gently for 10 minutes, or until they are cooked through. Remove from the heat, remove the carrots and reserve the cooking liquor. ", "For the barley, in a medium, lidded saucepan over a medium heat, heat the oil and gently fry the onions and chillies for 5 minutes, covered with a lid, until softened. Stir in the barley and cumin and continue to fry for a minute. Add 500ml/18fl oz of the carrot cooking liquor to the pan. Bring to a gentle simmer, then cover with the lid and cook for 50–55 minutes, stirring from time to time, until the barley swells and is firm with a good bite. Check the texture, taste and season with salt and pepper. Cook for a few minutes more, if necessary. Set aside in the pan. ", "To finish the barley risotto, using a long knife, carefully cut the kernels off the corn cob by running a knife along the central core. Keep 4 of the biggest lengths intact to use as garnish. Set these aside then release the kernels from the rest. Add the chard stems and leaves, spring onions and loose corn kernels to the barley pan and stir. Place the pan back on a medium heat and cook for 12 minutes. Add the coriander and cook for a further minute until wilted. Finally, taste and adjust the seasoning if required, then add the lemon juice to sharpen the flavour. ", "To finish, in a frying pan over a medium heat, fry the cooked carrot pieces in the rapeseed oil for 6–7 minutes, until caramelised. Add the reserved pieces of sliced corn to the pan and cook for 3 minutes, or until they begin to brown. ", "To serve, remove the caramelised carrots, add them to the barley risotto and divide the risotto evenly between four plates. Finish with a length of sliced corn and micro coriander, if using. Serve immediately."]}, {"isVegetarian": true, "title": "Carrot, parmesan and chilli fries", "url": "www_bbc_co_uk_food_recipes_carrot_parmesan_and_88443", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_parmesan_and_88443_16x9.jpg", "ingredients": ["2 large carrots, trimmed, cut into long, thin batons (these should resemble French fries in size and shape)", "salt, to taste", "50g/2oz ground almonds                      ", "30g/1¼oz parmesan, grated                                   ", "1⁄2 tsp dried oregano ", "small pinch cayenne pepper", "1 free-range egg, beaten "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 250C/220C Fan/Gas 9.", "Season the carrot batons with salt.", "In a large bowl, mix together the ground almonds, parmesan, oregano and cayenne pepper until well combined.", "Dip each baton into the beaten egg, then dredge in the herb-and-spice mixture until evenly coated.", "Arrange the carrot fries in a single layer on a baking tray. Bake for 10-12 minutes, turning during cooking, until tender and golden-brown all over. Serve hot.  "]}, {"isVegetarian": true, "title": "Carrot and apple salad", "url": "www_bbc_co_uk_food_recipes_carrotandapplesalad_80267", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tsp white wine vinegar", "½ apple, core removed, cut into thin strips", "½ carrot peeled and sliced into thin strips", "25g/1oz leek, white part only, finely sliced", "25g/1oz finely chopped mixed herbs (parsley, chives, dill)", "salt and freshly ground black pepper", "1 tbsp cheddar, finely chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oil and vinegar into a large bowl and whisk together.", "Add the apple, carrot and leek and toss together to coat in the dressing.", "Sprinkle over the mixed herbs and season, to taste, with salt and freshly ground black pepper.", "To serve, place onto a plate and sprinkle over the cheddar pieces."]}, {"isVegetarian": true, "title": "Carrot cake cupcakes with cream cheese frosting", "url": "www_bbc_co_uk_food_recipes_carrot_spelt_cupcakes_72408", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_spelt_cupcakes_72408_16x9.jpg", "ingredients": ["275g/9¾oz caster sugar", "200ml/7fl oz sunflower oil", "4 medium free-range eggs", "about 300g/10½oz grated carrot, a little more or less is fine ", "up to 150g/5½oz nuts or dried fruit (optional) ", "225g/8oz spelt or wholemeal flour", "2 tsp baking powder", "1 tsp ground cinnamon", "1 tsp mixed spice", "1 tbsp cocoa powder", "125g/4½oz unsalted butter, softened", "125g/4½oz full-fat cream cheese", "275g/9¾oz icing sugar", "edible decorations (such as sugar-paste carrots or mini-chocolate Easter eggs), to finish"], "serves": "Makes about 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 and line the pockets of a muffin tray with muffin cases.", "Beat the sugar, oil and eggs in mixing bowl until smooth, then stir in the grated carrot and, if you like, up to 150g/5½oz chopped nuts, dried fruit, or a mixture of both.", "In a separate bowl combine the flour, baking powder, spices and cocoa so that they're evenly mixed, then tip this into the carrot mixture and stir well.", "Fill the muffin papers to about two-thirds full, then bake for about 25 minutes, or until a skewer poked in comes out almost clean.", "For the frosting, make sure the butter is soft, then, using a whisk or electric mixer, beat it with the cream cheese in a bowl until smooth and light. ", "Stir in the icing sugar with a spoon until it begins to come together, then whisk again briefly until light and smooth. Pipe or spoon blobs of the frosting on each cold cupcake. Decorate with sugar-paste carrots or, say for Easter, with mini chocolate Easter eggs."]}, {"isVegetarian": true, "title": "Carrot and coriander fritters", "url": "www_bbc_co_uk_food_recipes_carrotandcorianderfr_92488", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotandcorianderfr_92488_16x9.jpg", "ingredients": ["a good handful carrots, about 6, trimmed and washed", "3-4 spring onions, both green and white parts, sliced", "a good handful fresh coriander, roughly chopped, plus extra to serve", "2 large free-range eggs, beaten ", "1 tbsp or so plain flour", "1 handful freshly grated parmesan cheese (or alternative vegetarian cheese)", "a few glugs double cream", "salt and freshly ground black pepper", "a few good glugs fruity olive oil"], "serves": "2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Grate the carrots in a food processor, then place into a large bowl with the spring onions and as much coriander as you like. ", "Add in the eggs and the flour to bind everything together, followed by the parmesan cheese (it will melt and again will help to hold the fritter together) and, for a touch of luxury, some cream and stir well, seasoning to taste with salt and freshly ground black pepper. ", "Just before you fry it's worth just squeezing some of the mixture together in your hands to ensure it won't fall apart when cooking. If you think it will, just add either a little more beaten egg or flour, only just enough to stick them together.", "Heat a large frying pan, add in the oil and form the mixture into thin fritters, so they will cook quickly. Fry for 4-6 minutes until golden-brown on both sides. Remember the golden rule of frying - don't play with the food too much, let the fritters form a crust before you turn them over. Serve straightaway scattered with more coriander."]}, {"isVegetarian": true, "title": "Carrot and coriander soup", "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_1919", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrotandcorianderso_1919_16x9.jpg", "ingredients": ["1 tbsp vegetable oil", "1 onion, sliced", "450g/1lb carrots, sliced", "1 tsp ground coriander", "1.2 litresl/2 pints vegetable stock", "large bunch fresh coriander, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan and add the onions and the carrots. Cook for 3-4 minutes until starting to soften.", "Stir in the ground coriander and season well. Cook for 1 minute.", "Add the vegetable stock and bring to the boil. Simmer until the vegetables are tender.", "Whizz with a hand blender or in a blender until smooth. Reheat in a clean pan, stir in the fresh coriander and serve."]}, {"isVegetarian": true, "title": "Low-fat carrot and coriander soup", "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_81122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["drizzle olive oil ", "1 onion, finely chopped", "1 leek, finely chopped ", "6 carrots, finely chopped  ", "568ml/1 pint vegetable stock", "¼ pint semi-skimmed milk ", "handful fresh coriander leaves,  chopped", "salt and freshly ground black pepper", "3 crusty rolls, to serve"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan over a medium heat. Add the onion and fry gently until transparent and softened. ", "Add the leek and place a lid on the pan. Reduce the heat and cook for 2-3 minutes, or until the leek is softened.", "Add the carrots and the stock. Increase the heat to bring to the boil, then reduce the heat to simmer for 20 minutes. ", "Add the milk and simmer for a further five minutes.", "Transfer to a food processor. Blend until smooth. ", "Allow to cool slightly and add the chopped coriander and season, to taste, with salt and freshly ground black pepper.", "To serve, pour the soup into three bowls and serve with a crusty roll alongside."]}, {"isVegetarian": true, "title": "Carrot and coriander soup", "url": "www_bbc_co_uk_food_recipes_carrotandcorianderso_83322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 clove garlic", "½ onion finely, chopped", "100g/3½oz carrots, chopped", "25g/1oz fresh coriander, chopped", "200ml/7oz hot chicken stock (vegetarians may substitute vegetable stock)", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "fresh coriander leaf, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a saucepan over a medium heat. Add the garlic and onions and fry for 2-3 minutes, until softened.", "Add the carrots and fresh coriander and cook for five minutes.", "Add the stock and simmer for five minutes.", "Add the cream, season to taste with salt and freshly ground black pepper and mix until smooth with a hand blender.", "To serve, pour into a warm bowl and garnish with the fresh coriander leaf."]}]