[{"isVegetarian": false, "title": "Fillet steak with red wine sauce", "url": "www_bbc_co_uk_food_recipes_filletsteakwithredwi_78674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz beef fillet steak", "2 asparagus spears", "1 tsp olive oil", "salt and freshly ground black pepper", "55ml/2fl oz red wine", "1 tbsp Worcestershire sauce", "1 tsp Dijon mustard", "55ml/2fl oz double cream", "½tsp freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut a pocket into the fillet steak and stuff with the asparagus spears. Rub the steak with olive oil, salt and freshly ground black pepper, to taste.", "Heat a small frying-pan over a high heat. Add the steak and fry for two minutes on each side (or longer, according to taste) and set aside on a warm plate.", "Meanwhile, to make the sauce, place the wine, Worcestershire sauce, mustard, cream and pepper in a small saucepan. Bring to the boil and reduce for five minutes, or until thick.", "Serve the steak with the sauce poured over."]}, {"isVegetarian": false, "title": "Fillet steak with Stilton rarebit", "url": "www_bbc_co_uk_food_recipes_filletsteakwithstilt_73601", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz fillet steaks", "salt and freshly ground pepper", "3 tbsp olive oil", "400ml/14fl oz red wine", "600ml/1 pint fresh beef stock", "20g/¾oz cold butter, diced", "2 tbsp pesto", "2 egg yolks", "1 tsp mustard", "2 tbsp fresh breadcrumbs", "Worcestershire sauce", "Tabasco sauce", "100ml/3½fl oz milk", "100ml/3½fl oz beer ", "115g/4oz Stilton cheese"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season steaks and place in a hot frying pan with olive oil. Cook on both sides for a total of 5 -6 minutes, remove from pan and keep warm.", "Keep pan on full heat and add wine. Boil to reduce by half then add the beef stock and reduce.", "For the rarebit, place egg yolks, mustard and breadcrumbs in a bowl along with a bit of Worcestershire sauce and a dash of Tabasco. Stir in milk and beer and season. Grate Stilton cheese and fold in. mix everything together until a very thick paste has formed.", "Preheat the grill to a high heat. Top steaks with rarebit and place under grill until golden brown on top. Remove from grill and place on four plates. ", "Season the reduced sauce and add butter to give a glaze. To finish, add pesto to the sauce, pour in around the steaks and serve."]}, {"isVegetarian": false, "title": "Filo baked salmon with peas, cream and mustard", "url": "www_bbc_co_uk_food_recipes_filobakedsalmonwithp_88146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets filo pastry", "2 tbsp olive oil", "100g/3½oz salmon fillet, skinned, chopped", "1 tsp capers, drained", "½ lemon, zest only", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper ", "1 tbsp sesame seeds", "25g/1oz butter", "½ onion, finely chopped", "2 tsp Dijon mustard", "55g/2oz fresh or frozen (defrosted) peas", "½ lemon, juice only", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "fresh parsley, chopped, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Brush the filo sheets with a little of the olive oil and layer them on top of each other on a baking sheet. ", "Mix together the salmon, capers, lemon zest and half of the parsley in a small bowl. Season with salt and freshly ground black pepper, to taste, and spoon the mixture down the middle of the filo sheets. Roll the pastry around the filling to form a sausage shape and trim the ends of the pastry. Brush with a little more olive oil and scatter with sesame seeds. Place in the oven for ten minutes or until the pastry is golden-brown and the salmon is cooked through.", "For the peas, melt the butter in a small saucepan. Add the onion and fry gently for 3-4 minutes or until softened but not browned. ", "Add the mustard, peas, lemon juice and cream, and saeson, to taste, with salt and freshly ground black pepper. Bring to the boil and simmer for five minutes or until the peas are cooked and the liquid has reduced by half.", "To serve, spoon the peas onto a serving plate and top with the salmon parcel. ", "Garnish with chopped fresh parsley and serve."]}, {"isVegetarian": true, "title": "Filo fruit croustade", "url": "www_bbc_co_uk_food_recipes_filofruitcroustade_84440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp caster sugar", "15g/½oz butter", "1 peach, cut into 6 wedges", "4 sheets ready-made filo pastry", "melted butter, for brushing"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Melt the butter and sugar in an ovenproof frying pan over a medium heat.", "Add the peach wedges, cut-side down, and cook for five minutes.", "Brush a sheet of the pastry with the melted butter and screw up into a ball. Repeat with the remaining three sheets of filo and place the pastry balls on top of the peaches.", "Transfer the pan into the oven and bake for 10 minutes, or until the pastry is crisp and golden."]}, {"isVegetarian": true, "title": "Filo strudel with port wine sauce", "url": "www_bbc_co_uk_food_recipes_filostrudelwithportw_73185", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/filostrudelwithportw_73185_16x9.jpg", "ingredients": ["Olive oil, for frying", "Knob of butter", "150g/5¼oz chestnut mushrooms", "1 garlic clove", "Salt and freshly ground black pepper", "150g/5¼oz leeks, trimmed, well washed, drained and roughly chopped", "250g/9oz ricotta cheese", "250g/9oz full-fat cream cheese", "5 tomatoes, skinned, de-seeded and chopped", "18 pieces filo pastry (23cm x 15cm/ 9in x 6in)", "2 tbsp olive oil", "1 large onion, sliced", "75g/3oz chestnut mushrooms, sliced", "2 garlic cloves, crushed", "100ml/3½fl oz vegetable stock", "200ml/7¼fl oz red wine", "Good glug of port", "25g/1oz cold butter, cubed"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Heat some olive oil in a pan, add the butter, and when it's melted and foaming, fry the mushrooms with the garlic and seasoning for a couple of minutes. Drain well in a large colander.", "Repeat the first step with the leeks, once you have trimmed and washed them. Drain them for as long as you can - this makes the filling good and solid.", "Mix the cheeses together in a large bowl with a good amount of seasoning until smooth (it helps to warm cheese in a microwave to soften it).", "Fold in the mushrooms, leeks and tomatoes, then chill for two hours.", "Preheat the oven to 200C/400F/Gas 6.", "Lay out six pieces of pastry on a lightly floured surface, and brush with lots of melted butter, then cover with another layer and brush again. Add a final layer, but this time only brush the edges of the pastry.", "Divide the chilled filling among the six rectangles and place it in a sausage shape towards the bottom edge of the pastry.", "Fold the bottom edge over the filling, tuck in the sides then roll up into a tight parcel and brush with butter.", "Put the strudels on a baking tray and cook in the oven for 25 minutes.", "To make the sauce, heat the oil in a pan and cook the onion, mushrooms and garlic with seasoning until soft.", "Add the stock and reduce down to nearly nothing.", "Add the wine and port and reduce by at least half.", "Just before serving, whisk in the butter to give it a really great shine.", "To serve, pour a little sauce on each plate and sit a strudel on top."]}, {"isVegetarian": true, "title": "Find-the-filling buns", "url": "www_bbc_co_uk_food_recipes_find-the-filling_buns_43954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz strong white bread flour, plus extra for dusting", "125g/4½oz strong wholemeal bread flour", "½ tsp salt", "½ tsp sugar", "1 tsp fast-action dried yeast", "170ml/6fl oz warm boiled water", "varied fillings of your choice, such as dried apple, raisins, chopped fresh herbs, chopped garlic, seeds or chopped sun-dried tomatoes "], "serves": "Makes 6 buns", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix together the white and wholemeal flours. Add the salt, sugar and yeast and mix again until well combined.", "Make a well in the centre of the dry ingredients. Gradually pour the warm water into the centre, bringing the dry ingredients into the pool of water using a fork. Keep stirring until the mixture comes together as a dough. You may not need to use all of the water - try not to allow the dough to become too sticky. ", "Turn the dough out onto a lightly floured work surface and knead well until smooth and elastic, for about 10 minutes.", "Divide the dough into three equal-sized pieces and roll each into a ball. Knead one type of filling into each of the dough balls, so that each dough ball will be a different flavour and the flavours are hidden. Then tear each ball in two to make six buns in total. ", "Arrange the buns onto a lightly greased baking tray so that they are almost touching. Put the baking tray into a cold oven, then switch on the oven to 230C/450F/Gas 8 and bake the buns for 15-20 minutes, or until they have risen and are golden-brown. Set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Fine egg custard flan", "url": "www_bbc_co_uk_food_recipes_fineeggcustardflan_77070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets ready-made filo pastry", "butter, melted ", "2 free-range eggs", "30ml/1¼fl oz cream ", "30ml/1¼fl oz milk", "85g/3oz sugar", "vanilla essence, few drops"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat oven to 220C/425F/Gas 7.", "Line a crepe pan with filo pastry and butter the pastry.  Add another sheet and so on to make a flan case.", "Mix the eggs, cream, milk, sugar and vanilla together and pour into the flan case.", "Bake in the oven for 5-8 minutes or until golden."]}, {"isVegetarian": true, "title": "Finnish pancakes", "url": "www_bbc_co_uk_food_recipes_finnish_pancakes_26537", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/finnish_pancakes_26537_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "1 tsp baking powder", "2 tbsp caster sugar", "pinch of salt", "4 large free-range eggs", "600ml/20fl oz milk", "25g/1oz butter, melted", "icing sugar, for dusting", "fruit compôte", "crème fraîche or sour cream "], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the flour, baking powder, sugar and salt in a large bowl. Make a well in the centre and break in the eggs. Using a whisk, gradually work in all the flour until you have a thick batter. Then gradually pour in all the milk, whisking as you go, until it is all incorporated.", "Leave the batter to stand for at least half an hour – you will find it thickens slightly.", "About 10 minutes before you are ready to cook the pancake, preheat the oven to 200C/180C Fan/Gas 6.", "Coat a roasting tray or baking dish with the melted butter and pour in the batter. Bake for around 30 minutes. It is ready when it is well risen and starting to turn a golden-brown, but still doughy underneath.", "To serve, dust with icing sugar, cut into 6 pieces and top each piece with fruit compôte and crème fraîche."]}, {"isVegetarian": false, "title": "Finnish pea soup", "url": "www_bbc_co_uk_food_recipes_finnish_pea_soup_71758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz split peas ", "pinch bicarbonate of soda", "1 small ham hock", "2 onions, one left whole with 2 cloves stuck in and one diced", "1 blade of mace", "2 bay leaves", "1 carrot, diced", "1 tbsp hot mustard", "100ml/3½fl oz double cream (optional)", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Put the split peas in a bowl with the bicarbonate of soda. Cover with cold water and leave to soak overnight. ", "Put the ham hock in a large saucepan, cover it with 1½-2 litres/2½-3½ pints cold water and bring to the boil. As soon as it has reached boiling point remove from the heat. Drain, wash the ham hock and the pan to get rid of any starchy foam.", "Put the ham back in the pan and cover with water again. Add the whole onion studded with cloves, mace and bay leaves to the pan. Bring to the boil, then simmer for 1 hour.", "Rinse the split peas and put in a saucepan, bring to the boil and boil for 10 minutes. Drain the peas and add to the ham hock pan along with the diced onion and carrot. Simmer until the peas are tender, this should take between 45 minutes to 1 hour. Top up with more water if needed. ", "Remove the ham hock, whole onion, bay and mace. Break up the ham hock, discarding the skin and bone and pull the meat into pieces.", "Add the mustard to the soup and season with salt and pepper. Use a stick blender to blend to a rough purée, add the ham hock meat back into the soup and warm through.", "Lightly whip the cream if using and fold gently into the soup. Serve with chunky bread."]}, {"isVegetarian": true, "title": "Fior di latte pizza", "url": "www_bbc_co_uk_food_recipes_fior_di_latte_pizza_90653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz type1 or 00 flour", "80g/3oz sourdough starter, refreshed", "240ml/9fl oz water, at room temperature", "10g/⅓oz fine salt", "280g/10oz dough, from above", "100g/3½oz tomatoes, peeled and crushed", "80g/3oz fior di latte or mozarella", "few fresh basil leaves", "1 tsp extra virgin olive oil", "squeeze lemon juice", "salt", "280g/10oz dough, from above", "100g/3½oz pak choi", "80g/3oz fior di latte or mozzarella", "30g/1oz smoked ricotta (available online), grated ", "1 tsp extra virgin olive oil", "1 fresh red or green chilli, thinly sliced", "salt"], "serves": "Makes 2 pizzas", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the dough, tip the flour into a large bowl and make a well in the middle. Add the sourdough starter and water, mix to bring together, adding the salt just before it is fully mixed. Turn the dough out onto a clean work surface and knead until it becomes smooth. ", "Roll the dough into a ball and place in a lightly greased bowl. Cover with cling film and leave at room temperature for 5 hours or until it has doubled in size. ", "2 hours before cooking, move the dough onto a large, oiled baking tray, keeping it the same way up. Cover with cling film and leave to prove for another 2 hours.", "Preheat the oven to 220C/200C Fan/Gas 7 and grease two baking trays with oil. ", "To make the tomato-based pizza, stretch half the dough with your hands to a 28cm/11in disk and place on a greased baking tray. Spread it with 1 tablespoon of the crushed tomatoes and cook for 10 minutes. Tear over the fior di latte and cook for a further 3–5 minutes. ", "Put the basil leaves in a small bowl with the oil, lemon juice and salt.", "Scatter the dressed basil leaves over the cooked pizza, cut into 8 and serve.", "To make the white-based pizza, stretch half the dough with your hands to a 28cm/11in disk and place on a greased baking tray. Tear over the fior di latte and cook for 10 minutes.", "Meanwhile, preheat the grill to its highest setting and grill the pak choi for 2 minutes on each side. Dress with a little olive oil and salt. ", "When the pizza is cooked, top with the pak choi, smoked ricotta and chilli. Cut into 8 slices and serve."]}, {"isVegetarian": false, "title": "Firecracker prawns with stir-fried greens", "url": "www_bbc_co_uk_food_recipes_firecracker_prawns_with_47781", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/firecracker_prawns_with_47781_16x9.jpg", "ingredients": ["1 tsp fennel seeds", "2 tsp cumin seeds", "4 spring onions, thinly sliced", "2 red chillies, finely chopped (remove seeds for less heat)", "3 tbsp finely chopped fresh coriander leaves and stalks", "2 limes, juice only", "2 tbsp oyster sauce", "¼ tsp ground star anise", "1 tbsp cider vinegar", "1 tbsp dark soy sauce", "600g/1lb 5oz raw tiger prawns, peeled, defrosted if frozen", "1 tsp light olive oil", "3 pak choi, roughly chopped", "1 tsp grated fresh root ginger", "1 tbsp light soy sauce", "¼ tsp toasted sesame oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Toast the fennel and cumin seeds in a small frying pan for 1–2 minutes, or until fragrant. Crush with a pestle and mortar and tip into a mixing bowl. Add the spring onions, chillies, coriander, lime juice, oyster sauce, star anise, vinegar and soy sauce. Stir in the prawns and marinate for 10 minutes.", "Preheat the grill to its highest setting. ", "Spread the prawns on a grill rack and grill for 3–4 minutes, or until pink and cooked through. Keep warm.", "To make the stir-fried greens, heat the oil in a wide, non-stick frying pan over a high heat. Add the pak choi, ginger and soy sauce and cook for 4–5 minutes, or until just wilted. Stir in the sesame oil.", "Serve the greens with the prawns immediately."]}, {"isVegetarian": false, "title": "'Firecracker' prawns", "url": "www_bbc_co_uk_food_recipes_firecrackershrimp_89800", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large prawns, in the shell", "¼ tsp garlic salt", "2-3 large carrots cut into 24 very thin batons, each 1cm/¼in longer than the prawns ", "700ml/1¼ pint buttermilk", "vegetable oil, for deep frying", "175g/6oz plain flour", "50g/2oz polenta", "1 tbsp chilli powder", "2-3 tsp sea salt", "pinch black pepper", "85ml/3fl oz mayonnaise", "2 tsp hot chilli sauce, or to taste"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Remove the shells from the prawns, leaving the tail intact. Make an incision with a sharp knife down the back of each prawn. Rinse out the vein from the prawn. With a sharp skewer, make a hole through the centre of the prawn, from top to tail.", "Sprinkle the prawns with the garlic salt.", "Thread two carrot batons through the hole you have made in the back of the prawns. (The carrot strips should be poking out of the top end of the prawns.)", "Place the prawns and the buttermilk into a bowl and leave to soak for 30 minutes, stirring occasionally.", "Heat the oil in a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Meanwhile, sieve the flour, polenta, chilli powder, salt and freshly ground black pepper onto a large plate.", "Remove a prawn from the buttermilk (make sure there's lots of buttermilk on it).", "Dredge the prawn in the spiced flour and polenta mixture to coat. Don't shake off the excess.", "Repeat with five more prawns, then place the coated prawns carefully into the hot oil. Deep-fry for about 2-4 minutes, turning the prawns occasionally to keep them moving, until crisp and golden-brown all over, then remove with a slotted spoon and drain onto kitchen paper.", "Repeat this process of dredging and deep-frying the remaining six prawns. (The tail of the shrimp should be protruding from one end and the carrot from the other - to resemble a firecracker.)", "For the dipping sauce, mix the mayonnaise and hot chilli sauce together in a bowl.", "To serve, place the bowl of dipping sauce into the centre of a large serving plate. Arrange the 'firecracker' prawns around the bowl and serve."]}, {"isVegetarian": false, "title": "Perry-battered fish and chips with wasabi mushy peas", "url": "www_bbc_co_uk_food_recipes_fish_and_chips_69749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz plain flour", "175ml/6fl oz perry (pear cider)", "2 tbsp rapeseed oil", "1 free-range egg white, beaten to stiff peaks", "6 large Maris Piper potatoes, cut into chips", "salt, to taste", "5 tbsp rapeseed oil", "400g/14oz fresh or frozen peas", "50g/1¾oz butter", "2 tbsp wasabi paste", "2 litres/3½ pints sunflower oil, for frying", "1 pollock fillet, cut into pieces "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the batter, whisk together all of the batter ingredients apart from the egg white. Leave to rest in the fridge for 20 minutes.", "Slice the potatoes into your favourite chip shape. Boil for 10 minutes in a pan of salted water, or until the potatoes are soft to the point of a knife. Drain and transfer to an oven dish once completely dry. Season with salt and toss with the rapeseed oil. Bake for 25-30 minutes, or until golden-brown and crisp.", "For the wasabi mashed peas, add the peas, butter and 300ml/10fl oz of water to a pan and cook over a moderate heat until the water has evaporated. Add the wasabi paste and mash the peas with a fork. Keep them warm until you're ready to serve.", "To finish the batter, whisk the egg white in a bowl until stiff peaks form when the whisk is removed from the bowl. Fold it into the batter.", "Half fill a pan with the sunflower oil and bring to a temperature of 180C/350F, which you can check using a sugar thermometer, or use a deep fat fryer set to the same temperature.", "Flip the pieces of pollock in the batter and then carefully lower them into the hot oil, one at a time. Fry individually until golden-brown. Rest the fish on kitchen paper to remove excess oil and the serve with the chips and peas."]}, {"isVegetarian": false, "title": "Fish and chips with tartare sauce", "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_02619", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_and_chips_with_02619_16x9.jpg", "ingredients": ["2 egg yolks", "1 tbsp Dijon mustard", "3 tbsp white wine vinegar", "200ml/7fl oz vegetable oil, plus extra for deep-frying", "squeeze lemon juice", "½ red onion, chopped ", "1 tbsp gherkins, roughly chopped", "1 tbsp capers, roughly chopped", "small handful parsley, finely chopped", "4–5 green olives, chopped", "12 tbsp plain flour", "6 tbsp cornflour", "200ml/7fl oz ale ", "pinch salt", "8 large Maris Piper potatoes, peeled and cut into chunky chips", "4 x 150g/5½oz cod (or haddock) fillets"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["First make the tartare sauce. Whisk together the egg yolks, mustard and vinegar and gradually pour in the oil in a steady stream until you have a thick, creamy mayonnaise.  Season to taste and add a squeeze of lemon. ", "Stir in the onion, gherkins, capers, parsley and olives.  The sauce should be quite piquant and chunky and have the consistency of very thick double cream.", "To make the batter, mix the flours together and whisk in the ale until you have a double cream consistency. Add a pinch of salt. ", "Heat the oil in a deep-fat fryer to 140C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Cook the chips for 8–9 minutes and set aside on kitchen paper.", "Increase the heat to 190C. In batches, dip the fish fillets in the batter and drop carefully into the hot oil. Shake the basket gently so the fillets don’t stick, and cook for about 3–5 minutes. Don’t overload the basket or the oil will cool and you’ll get soggy batter. Remove and drain on kitchen paper.", "Return the chips to the deep-fat fryer a further 2–3 minutes and drain on kitchen paper. Serve with the battered fish and the tartare sauce."]}, {"isVegetarian": false, "title": "Fish and chips with crushed garden peas", "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_26404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "15g/½oz fresh yeast", "pinch sugar", "300ml/10fl oz beer ", "1 tsp cider vinegar", "200g/7oz plain flour", "pinch salt", "1 large plaice or lemon sole, skinned, pin-boned and cut into strips", "300g/10½oz floury potatoes (such as Maris Piper), peeled, cut into 1cm/½in thick chips and rinsed in cold water", "½ lemon, cut into wedges, for serving", "50g/1¾oz frozen peas, defrosted", "50g/1¾oz natural yoghurt", "pinch chilli flakes", "1 tbsp chopped fresh mint", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish and chips, heat the oil in a deep-fat fryer to 190C, or half fill a deep heavy pan with oil and heat until a breadcrumb sizzles and turns brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Sprinkle the yeast and sugar into a mixing bowl. Pour over the beer and vinegar and whisk in the flour and salt. Leave to ferment. It is ready to use when the mixture starts to bubble. ", "Dip the fish in the batter and deep-fry until golden-brown and cooked through (about 3-4 minutes). Remove with a slotted spoon and drain on kitchen paper.", "Add the potatoes to the deep-fat fryer and fry for 3-4 minutes, or until golden-brown and crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "For the peas, place the peas, yoghurt, chilli flakes, salt and pepper into a blender and blend until almost smooth. ", "Mix in the mint just before serving and serve immediately with the fish and chips."]}, {"isVegetarian": false, "title": "Fish and chips with tartare sauce and pea purée", "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_39006", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg yolks", "3 tsp Dijon mustard", "4 tsp white wine vinegar", "500ml/18fl oz vegetable oil", "3 free-range eggs, hard boiled and grated", "4 banana shallots, finely chopped", "75g/2½oz gherkins, chopped ", "100g/3½oz capers, drained", "50g/1¾oz flatleaf parsley", "1 shallot, finely chopped", "25g/1oz butter", "½ tsp sea salt", "400g/14oz frozen peas (defrosted)", "3 tsp sugar", "100ml/3½fl oz chicken stock, boiling hot", "10 fresh mint leaves ", "8 large potatoes", "vegetable oil, for deep frying", "salt", "2 free-range egg whites", "350g/12oz self-raising flour, plus extra for dusting", "large pinch bicarbonate of soda", "340ml/12fl oz sparkling water (or, if you prefer, beer)", "1 whole brill (alternatively use turbot or flounder), filleted, skinned and cut into portions"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tartare sauce, make a mayonnaise by mixing the egg yolks, Dijon and vinegar to a paste. Slowly add the vegetable oil in a thin stream, whisking all the time.  When emulsified, mix in the rest of the ingredients. Set aside.", "For the pea purée, gently fry the shallot in the butter and salt in a pan. Add the peas and sugar, then pour in the chicken stock. Bring to the boil and cook until the peas are tender.  Strain, reserving the cooking liquor in a jug. Transfer the peas and shallots to a blender, add the mint and a few tablespoons of the cooking liquor. Blend to a purée, adding more cooking liquor as required. Season to taste with salt and pepper. Keep warm.", "For the chips, top and tail the potatoes and cut into chips using an apple corer (alternatively cut into chunky wedges).", "Bring a pan of salted water to the boil and blanch the chips until soft, but still holding their shape.", "Remove the chips with a slotted spoon and drain them on a perforated tray (alternatively use plates lined with kitchen paper).", "Fill a deep-fat fryer with vegetable oil and preheat to 140C/284F (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Cook the chips for approximately 8–10 minutes, or until the oil stops bubbling (which means that the moisture has been removed). You will need to do this in batches unless you have a large fryer. Remove the chips using a slotted spoon and drain the chips on a perforated tray or plates lined with kitchen paper.", "For the battered fish, beat the egg whites until very soft peaks form when the whisk is removed. ", "In a separate bowl mix the flour, bicarbonate of soda and sparkling water together. Stir in the egg white mixture. Mix to just combine, but don’t over work (a few lumps are fine). Set aside to rest for 20 minutes.", "Preheat the deep-fat fryer to 180C/350F. Deep fry the chips for a second time until crisp and golden-brown. ", "Meanwhile, sprinkle some flour onto a shallow plate. Dust the fish pieces with the flour, dip in the batter and deep fry until the batter is golden-brown and crisp (you may need to do this in batches). ", "Season the chips, to taste, with salt and serve immediately with the fish, pea purée and tartare sauce."]}, {"isVegetarian": false, "title": "Fish cakes with dill tartar sauce", "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_dill_90632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz cold mashed potato", "500g/1lb 2oz poached salmon", "100g/3½oz hot smoked salmon", "1 lemon, zest only", "small bunch dill", "salt and freshly ground black pepper", "plain flour", "2 free-range eggs", "100g/3½oz panko breadcrumbs", "1 free-range egg yolk", "pinch salt", "1 tsp Dijon mustard", "250ml/9fl oz neutral-tasting oil, such as sunflower or groundnut", "4 tbsp cornichons, drained, finely chopped", "3 tbsp capers, drained, finely chopped", "few snips chives", "small bunch dill, finely chopped", "1 lemon, juice only", "2 tbsp olive oil", "large knob of butter", "salmon caviar, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish cakes, put the mashed potato in a bowl and break up with a fork. Flake in the salmon, then season well with salt and pepper and add the lemon zest and dill. Stir well to combine – you can use your hands for this, then shape into eight fish cakes. Chill in the freezer for 10 minutes if possible, just to firm up before you coat them.", "To coat, divide the plain flour, one of the eggs and half the breadcrumbs over three plates. Dip the fish cakes in each plate, in that order, shaking off excess as you go. This does get messy, so do it in two batches. If you have time, chill the coated fishcakes to firm up – this time in the fridge and for at least 20 minutes, preferably longer.", "To fry, heat the oil and butter in a large frying pan. Fry the fish cakes on each side for a few minutes until they have developed a good golden-brown crust and the centres are hot. ", "To make the tartare sauce, put the egg yolk in a bowl or food processor with a generous pinch of salt and the mustard. Whisk or pulse briefly, then very gradually start adding the oil. When you have an emulsion, you can start adding the oil in a steady, slightly faster stream until it is all incorporated and you have a thick mayonnaise. Stir through the remaining ingredients.", "Serve the fish cakes with a dollop of salmon caviar and the tartare sauce on the side."]}, {"isVegetarian": false, "title": "Fish cakes with parsley sauce", "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_parsley_61919", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz medium potatoes (preferably Maris Piper)", "flaked sea salt and freshly ground black pepper", "250g/9oz thick cod fillet, unskinned", "250g/9oz thick salmon fillet, unskinned", "100g/3½oz smoked haddock fillet, unskinned", "500ml/18fl oz whole milk", "1 bay leaf", "½ well-scrubbed lemon, finely grated zest", "6 spring onions, trimmed and finely sliced", "25g/1oz plain flour, for dusting", "2 large free-range eggs", "100g/3½oz fresh white breadcrumbs ", "75ml/2½fl oz sunflower oil", "lemon wedges, for serving", "25g/1oz butter", "25g/1oz plain flour", "reserved milk from cooking the fish", "25g/1oz bunch curly leaf parsley, tough stalks removed and leaves finely chopped "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the potatoes and cut into roughly 3cm/1¼in chunks. Put the potatoes in a large saucepan and cover with cold water. Bring the water to the boil and then reduce the heat slightly and simmer for 12-15 minutes, or until the potatoes are soft but not falling apart. ", "Drain the potatoes in a colander and return to the pan. Mash the potatoes until smooth or pass through a potato ricer. Season well with sea salt and freshly ground black pepper, then spread out onto a cold plate and leave to cool. ", "Place the fish fillets in a large saucepan, with the thicker fillets on the bottom of the pan. Pour the milk into the pan, add the bay leaf and season with a little salt and some freshly ground black pepper. ", "Cover the pan with a tight fitting lid and gently bring to a simmer. Immediately, take the pan off the heat and leave to stand for 10 minutes. This will finish cooking the fish and infuse the milk with flavour.", "After the time is up, carefully remove the fish from the milk using a slotted spoon and transfer to a plate. Reserve the milk to make the parsley sauce. Break the fish into large chunks, discarding the skin as you go. Leave the fish to cool completely. ", "Place the cooled mash in a large bowl and stir in the lemon zest and spring onions. Tip the cooled fish into the mash and use a wooden spoon to mix it into the mash, without breaking up the fish too much. ", "Divide the mixture into six balls. Flatten each ball until roughly 3cm/1¼in thick and place on a baking tray lined with baking parchment. Place the tray in the freezer for about 20 minutes to firm up. (Alternatively, put in the fridge for 45 minutes.)", "To coat the fishcakes, sprinkle the flour for dusting over a plate. Beat the eggs together in a shallow bowl and spread half of the breadcrumbs over a large plate. ", "Dip one of the fishcakes into the flour, coating well on all sides. Gently pat off any excess flour before dipping the fishcake into the egg, coating all sides. Allow any excess egg to drip off of the fishcake and then place in the breadcrumbs. Turn the fishcake in the crumbs and press them firmly and evenly onto all the sides. ", "Place the fishcake on a tray lined with baking parchment. Repeat the process with the remaining fishcakes, replacing the used crumbs with the reserved breadcrumbs for the final three fishcakes. (These fishcakes can be chilled in the fridge until you need them but should be used within 24 hours.)", "To cook the fishcakes, preheat the oven to 200C/400F/Gas 6. Heat the oil in a large non-stick frying pan. Using a metal spatula, carefully place three of the fishcakes in the pan and fry over a medium high heat for three minutes on each side. Turn carefully to avoid breaking them. ", "Transfer the first three fishcakes to a baking tray and fry the remaining fishcakes in exactly the same way, adding a little more oil to the pan if necessary. Finish cooking all the fishcakes in the oven on the tray for 8-10 minutes, or until hot throughout. ", "While the fishcakes are in the oven, make the parsley sauce. Melt the butter in a small non-stick saucepan. Gradually add the flour, stirring with a wooden spoon until it comes away from the sides of the pan. Slowly add the reserved milk, stirring constantly with a wooden spoon to ensure it is lump-free. ", "Bring the sauce to a simmer and cook for three minutes, or until the sauce is thickened and smooth. Remove the pan from the heat and stir in the parsley. Season with salt and pepper to taste. Divide the fishcakes between six warmed plates, pour the sauce over and serve with fresh lemon wedges for squeezing. "]}, {"isVegetarian": false, "title": "Fish cakes with chive beurre blanc", "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_chive_82130", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz floury potatoes, diced", "1 lemon, thickly sliced, plus a squeeze of lemon juice", "1 bay leaf", "1 onion, thickly sliced", "300g/10½oz boneless, skinless salmon fillet", "300g/10½oz boneless, skinless smoked haddock", "200g/7oz raw tiger prawns, peeled and de-veined", "1 tbsp finely chopped fresh dill", "4 spring onions, trimmed, finely sliced ", "50g/1¾oz butter", "300g/10½oz rainbow chard, larger stalks removed ", "1 large shallot, peeled, finely sliced", "200ml/7fl oz white wine", "250g/9oz chilled butter, cut into cubes", "squeeze lemon juice", "2 tbsp finely chopped fresh chives", "sea salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in a saucepan of salted water for 12-15 minutes, or until very tender, then drain and return to the pan. Return to the heat for a couple of minutes to drive off any excess moisture. Set aside until cool.", "Pour enough water into a saucepan to reach 5cm/2in up the sides. Add the lemon, bay leaf and onion and bring to the boil. Add the fish and prawns and simmer for 3-4 minutes, or until just cooked through, then remove from the heat and leave the fish to cool in the cooking liquid.", "Meanwhile, for the beurre blanc, heat the shallot and white wine in a saucepan until bubbling. Reduce the heat and simmer until there is only about 50ml/2fl oz liquid left in the pan.", "Whisk in the butter, a little at a time, waiting until most of the butter has melted and incorporated into the mixture before adding more.", "Once all of the butter has been added, add a squeeze of lemon juice and strain the mixture into a clean saucepan. Stir in the chives and season, to taste, with salt and freshly ground black pepper. Cover with cling film and set aside at room temperature until needed.", "When the fish and potatoes are cool, flake the fish into a large bowl, discarding any skin and bones. Roughly chop the prawns and add them to the bowl. Add the chopped dill and spring onions and season with a squeeze of lemon juice. ", "Add the potatoes and season, to taste, with salt and freshly ground black pepper. Carefully combine the mixture with your hands, taking care not to break up the fish too much.", "Form the mixture into 6 equal-sized patties. Chill in the fridge on a plate for 5 minutes.", "Meanwhile, heat half of the butter in a frying pan over a medium heat until foaming. Add the chard and sauté for 3-4 minutes until wilted, then season, to taste, with salt and freshly ground black pepper. Drain onto kitchen paper then clean the pan with a piece of kitchen paper and return it to the heat.", "Add the remaining butter to the pan. When foaming, add the fish cakes, in batches if necessary, and fry for 2-3 minutes on each side, or until golden-brown on both sides and piping hot throughout.", "Just before serving, remove the cling film from the beurre blanc and heat through.", "To serve, spoon the chard onto serving plates, top each portion with a fish cake and spoon the chive beurre blanc around the edge."]}, {"isVegetarian": false, "title": "Fish cakes with sweet potato fries", "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_sweet_04563", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_cakes_with_sweet_04563_16x9.jpg", "ingredients": ["100g/3½oz light cream cheese ", "400g/14oz potatoes", "2 x 160g tins of tuna or salmon, or 320g/11½oz smoked mackerel", "½ tsp dried mixed herbs", "50g/1¾oz puffed rice cereal (such as Rice Krispies)", "1 free-range egg", "2 tbsp plain flour", "oil", "salt and pepper", "750g/1lb 10oz sweet potatoes, scrubbed clean"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C/Gas 6. Take the cream cheese out of the fridge and put to one side so that it reaches room temperature.", "Peel the potatoes and then chop them in to pieces that are all the same size.  Bring a saucepan of water to the boil and add the potatoes, boil until tender then drain. Tip back in to the saucepan and leave off the heat to steam dry for 5 minutes. Once dry, roughly mash the potatoes until completely broken up but not completely smooth.  Leave to cool.", "Drain the tins of fish and add the contents to the mashed potatoes along with the dried herbs and cream cheese. Season with salt and pepper.  ", "Shape the mixture into 4 large balls, or 8 smaller balls. Flatten these balls into fish cake shapes, cover and put in the fridge while you prepare the sweet potato fries. (They can be stored in the fridge for up to 2 days at this point if you want to prepare them in advance.)", "To make the fries, slice the sweet potatoes into chip shapes about 1cm/½in thick and as long as the sweet potato is long. Put in a bowl and toss with 1 tablespoon of oil.", "Put the sweet potato fries on a baking tray and bake for 10 minutes while you prepare the fishcakes.", "Put the rice cereal into a freezer bag and scrunch it up to make breadcrumb-sized pieces. You might find it easiest to use a rolling pin to roll over the bag, breaking up the cereal inside.", "Put the egg into a shallow bowl and beat. Add the flour to a separate shallow bowl and the broken up rice cereal to one more shallow bowl. Take the fish cakes out of the fridge and dip them, one by one, into the flour, shake off any excess then dip into the egg, making sure all the sides are coated. Finally dip into the crushed cereal, pressing the cereal crumbs against the fish cakes and making sure all sides are completely covered. ", "Grease the bottom of a baking tray with a little oil and put the fish cakes on the tray.  Gently turn them in the oil so that both sides are coated.", "Put the tray of fishcakes in the oven after the fries have been in there for 10 minutes. Bake them all together for 10 more minutes then carefully turn the fishcakes and fries over. Bake for a final 10 minutes or until the fishcakes are crisp, golden-brown and hot all the way through.", "Serve the fishcakes warm with the sweet potato fries on the side."]}, {"isVegetarian": false, "title": "Fish cakes with tomato sauce (Machchi na cutless)", "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_tomato_22086", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 tbsp sunflower or rapeseed oil", "2 x 2.5cm/1in piece cinnamon stick", "2 large whole dried red chillies, broken into three or four pieces (seeded, if liked)", "3-4 cloves (optional)", "2 smallish onions, finely chopped", "1 heaped tbsp ginger and garlic paste (or 4 garlic cloves, crushed and 2 tsp grated fresh ginger)", "4-5 tomatoes, chopped (or a 400g/14oz can chopped tomatoes)", "1 tbsp malt vinegar", "1 tbsp jaggery or muscovado sugar", "½ tsp tamarind paste (optional)", "salt, to taste", "250g/9oz white fish fillet, skinned", "1 large green chilli, finely chopped ", "2.5cm/1in piece fresh ginger, finely chopped", "6-8 garlic cloves, finely chopped", "2 tbsp chopped coriander leaves", "1 tsp salt, or to taste", "1 tbsp lemon juice", "1 free-range egg", "2 slices white bread, soaked briefly in water and squeezed out", "salt and pepper", "100g/3½oz plain flour ", "2-3 free-range eggs", "oil, for shallow-frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato sauce, heat the oil in a heavy-based saucepan or a flameproof casserole, over a medium heat. Add the cinnamon sticks and fry until deep brown in colour and swollen, but not burnt. Add the red chillies and cloves (if using) and, after about 20 seconds, add the chopped onions. Fry gently for 3-4 minutes, or until they are soft but not brown. Add the ginger and garlic paste and fry for a further minute or so.", "Stir in the tomatoes, vinegar, jaggery (or muscovado sugar) and tamarind, if using. Part-cover and simmer over a low heat for 15-20 minutes, stirring occasionally, until pulpy. Season to taste with salt, remove from the heat and set aside. ", "For the fishcakes, if you have a mincer (grinder) or food processor at home, then mincing the fish is easy. If not then you can chop up the fillets and with a cleaver or a large knife. Chop repeatedly as if chopping parsley until you get a fine mince. ", "In a food processor, blend the chilli, ginger, garlic and coriander with the fish and mix to a rough paste.", "Add the salt, lemon juice and the egg and mix well. Finally work in the well-squeezed bread. The bread is to stabilise the mixture and if you find it is too soft, soak and squeeze another slice or two until you have a mix that is firm enough to form into balls without sticking to you palms. ", "To check the seasoning, fry a tiny piece fry of the mixture and taste. Season with salt and pepper, to taste. When you are happy with it, divide the mixture into even-sized balls depending on the size you prefer. You may like them large if eating as a main dish or small if serving as a snack. ", "Heat about 5mm/¼in oil in a deep frying pan. Spread the flour out in a flat tray big enough to take all the balls at one time and beat the eggs in a shallow dish.", "Flatten each ball until about 1cm/½ in thick. Smooth the edges so that they are not jagged or uneven. Coat in the flour and then the beaten eggs, draining off any excess. If the egg is well-beaten you will get a nice frilly texture.", "Fry the cakes in batches for 2-3 minutes on each side, or until golden-brown. Drain on a plate lined with kitchen paper. Remove the cinnamon and cloves (if using) from the sauce and reheat, if serving hot. ", "Serve the fishcakes hot or cold with the sauce. "]}, {"isVegetarian": false, "title": "Fish, chips and curry sauce", "url": "www_bbc_co_uk_food_recipes_fish_chips_and_curry_07304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 large onion, finely sliced", "2 bird’s-eye chillies, finely sliced", "1 tsp plain flour", "2 tbsp curry powder", "150ml/5fl oz double cream", "200ml/7fl oz chicken stock", "4 tbsp finely chopped fresh coriander leaves", "½ lemon, juice only", "vegetable oil, for deep frying", "15g/½oz fresh yeast", "pinch sugar", "300ml/10fl oz beer ", "1 tsp cider vinegar", "200g/7oz plain flour", "pinch salt", "1 x 400g/14oz whole Dover sole, filleted", "300g/10½oz chipping potatoes, peeled and cut unto 1cm/½in sticks", "½ lemon, cut into wedges, for serving"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the curry sauce, heat a large frying pan until hot, add the butter, onion and chillies and cook for 10 minutes, or until golden-brown and softened.", "Add the plain flour and curry powder and cook for a couple of minutes.", "Add the cream and chicken stock, return to a simmer and cook for 5-10 minutes.", "Season, to taste, with salt and freshly ground black pepper. Stir through the coriander and finish with the lemon juice.", "For the fish and chips, preheat a deep-fat fryer to 190C/375F. (CAUTION: Hot oil can be dangerous. Do not leave unattended).", "Meanwhile, sprinkle the yeast and sugar into a mixing bowl. Pour over the beer and vinegar and whisk in the flour and salt. Leave to ferment – it is ready to use when the mixture starts to bubble. ", "Dip the sole fillets into the batter and deep fry until golden-brown and cooked through – about 3-4 minutes. Remove with a slotted spoon and drain on kitchen paper.", "Add the potatoes to the deep-fat fryer and fry for 3-4 minutes, or until golden-brown and crisp. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with a little salt.", "Serve the fish and chips on serving plates with the curry sauce in a jug. Pour the sauce over the fish and chips just before serving."]}, {"isVegetarian": false, "title": "Fish cloud with green mango salad (Yum pla foo)", "url": "www_bbc_co_uk_food_recipes_fish_cloud_with_green_87926", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz hake or pollock fillets ", "1 tbsp fish sauce", "pinch of caster sugar", "pinch white pepper", "1 thin slice of galangal", "pinch of kaffir lime zest", "2 coriander root (not stalk)", "2 garlic cloves, peeled", "4 bird's-eye red chillies", "1 long red chilli", "3 tbsp lime juice", "1 tbsp palm sugar", "2 tbsp fish sauce ", "1 mandarin, juice only", "1 green mango, peeled, stone removed and thinly sliced", "2 tbsp Thai shallots, peeled and chopped", "large pinch sliced lemongrass", "pinch finely sliced Kaffir lime leaves", "large pinch chopped mint leaves", "large pinch chopped coriander leaves", "1 tbsp roasted peanuts, with skin on"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the fish clouds, preheat the grill to medium and preheat the oven to 100C/80C Fan/Gas 1.", "Rub the fish fillets generously with fish sauce, sprinkle with sugar and a small pinch of pepper. Grill for 10-12 minutes, until cooked through.", "Remove the skin and crumble the cooked fish over an oven tray. Bake, fluffing and turning regularly, until fluffy and somewhat dried. This will take around 1 hour.", "Pulse the fish in a food processor until quite fine.", "Preheat a deep-fat fryer to 170C (CAUTION: do not leave unattended. Hot oil can be dangerous).  Deep-fry handfuls of the fish, using a slotted spoon to pull them together into four clouds (you might need to do this in batches). Cook until golden-brown in colour, this will take 1 minute. Drain on kitchen paper and keep warm until ready to serve.", "For the dressing, pound the galangal and kaffir zest in a pestle and mortar, then add the coriander root, garlic cloves, chillies and lime juice. Continue to pound then mix in the sugar, fish sauce and mandarin juice. It should taste hot, sour, sweet and salty. To check the balance is correct, taste it with the green mango (for the salad) and tweak the ingredients if necessary. ", "For the salad, mix all the ingredients in a large bowl. Mix with the dressing.", "To serve, in four bowls, break a fish cloud in half and stack it on top of itself. Place some dressed salad over the fish cloud. Pour any remaining dressing into the bottom of the bowls."]}, {"isVegetarian": false, "title": "Fish, chips, mushy peas and tartare sauce", "url": "www_bbc_co_uk_food_recipes_fish_chips_mushy_peas_33132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz dried marrowfat peas ", "1 tsp bicarbonate of soda ", "35g/1¼oz butter", "salt and freshly ground black pepper", "3 free-range egg yolks", "1 tbsp Dijon mustard", "2 tbsp cider vinegar", "300ml/10½fl oz rapeseed oil", "50g/1¾oz capers", "100g/3½oz gherkins, chopped", "½ shallot, finely chopped", "1 small bunch fresh dill, chopped", "2 tbsp chopped fresh flatleaf parsley", "½ lemon, juice only", "vegetable oil, for deep frying", "15g/½oz fresh yeast", "pinch sugar", "300ml/10½fl oz beer ", "1 tsp cider vinegar", "200g/7oz plain flour", "pinch salt", "1 whole fillet of cod, cut in two", "300g/10½oz chipping potatoes, peeled and cut unto 2cm/½in sticks", "½ lemon, cut into wedges, for serving"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the mushy peas, soak the peas for at least four hours in a large bowl with three times their volume of water and the bicarbonate of soda, or, if you have the time, overnight. ", "Drain the peas, rinse under cold running water and place in a large, lidded pan. Cover with water (about 2.5cm/1in above the peas), cover with a lid and bring to the boil. Reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid off until they dry out a little. Beat in the butter and season with salt and freshly ground black pepper.", "For the tartare sauce, whisk the egg yolks, mustard and vinegar together in a bowl.", "Continue to whisk the mixture and slowly pour in the rapeseed oil until all of the oil is incorporated and mixture is thick and light.", "Stir in the capers, gherkins, shallot and herbs. Season, to taste, with salt and freshly ground black pepper and a squeeze of lemon juice. Keep in the fridge until ready to serve.", "For the fish and chips, preheat a deep-fat fryer to 190C/375F. Meanwhile, sprinkle the yeast and sugar into a mixing bowl. Pour over the beer and vinegar and whisk in the flour and salt. Leave to ferment – it is ready to use when the mixture starts to bubble.", "Place a steamer on the hob and place the chopped potatoes in the steamer and cook for 4-5 minutes. Remove and allow to dry out.", "Dip the cod fillets into the batter and deep fry until golden-brown and cooked through – about 3-4 minutes. Remove with a slotted spoon and drain on kitchen paper.", "Add the potatoes to the deep-fat fryer and fry for 3-4 minutes, or until golden-brown and crisp. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with a little salt.", "Serve the fish and chips with the tartare sauce and mushy peas."]}, {"isVegetarian": false, "title": "Fish curry", "url": "www_bbc_co_uk_food_recipes_fish_curry_98168", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_curry_98168_16x9.jpg", "ingredients": ["3 tbsp sunflower oil ", "2 large onions, finely chopped", "4 garlic cloves, crushed ", "4cm/1½in fresh root ginger, finely grated ", "1 tsp ground coriander ", "2 tsp garam masala ", "10 curry leaves ", "2–3 tbsp palm sugar (available from Asian grocers) or light brown sugar", "400g tin coconut milk ", "3 limes, juice only", "5 vine-ripened tomatoes, chopped and blended", "700g/1lb 9oz skinless salmon fillet, cut into 2cm/¾in-wide finger-length pieces", "3 tbsp grated creamed coconut, to garnish ", "handful fresh coriander, chopped, to garnish ", "freshly steamed basmati rice, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a heavy-bottomed saucepan over a low heat. Add the onions and fry for 15 minutes, or until soft and starting to turn golden. ", "Add the garlic, ginger, ground coriander, garam masala and curry leaves and cook for 1 minute. Add the palm sugar, coconut milk, lime juice and blended tomatoes and cook for 10–15 minutes, or until slightly reduced. ", "Add the salmon and gently poach for 5–6 minutes. ", "Serve with steamed basmati rice if desired, garnished with coconut cream and fresh coriander."]}]