[{"isVegetarian": true, "title": "Parkin with cider and golden syrup sauce", "url": "www_bbc_co_uk_food_recipes_parkin_with_cider_and_65702", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parkin_with_cider_and_65702_16x9.jpg", "ingredients": ["110g/4oz self-raising flour", "pinch salt", "2 tbsp ground ginger", "½ tsp ground nutmeg", "½ tsp mixed spice", "75g/2½oz oat flakes", "175g/6oz golden syrup", "50g/1¾oz black treacle", "110g/4oz unsalted butter", "110g/4oz soft brown sugar", "1 free-range egg, beaten", "2 tsp milk", "200g/7oz golden syrup", "50ml/2fl oz apple juice", "1 tsp mixed spice", "50ml/2fl oz cider", "ice cream, to serve"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the parkin, preheat the oven to 140C/275F/Gas 1 and butter a 20cm/8in square cake tin. ", "Sieve the flour, salt, ginger, nutmeg and mixed spice together into a large bowl. Mix in the oat flakes.", "Put the syrup, treacle, butter and sugar into a small saucepan and melt over a gentle heat. Bring up to a simmer but do not boil. When the butter and sugar have melted, pour into the flour mixture and stir to combine.", "Mix in the beaten egg and milk to create a soft, almost pouring consistency batter. ", "Pour into the buttered tin and bake for 50 minutes, or until firm in the centre. ", "Remove from the oven and leave to cool in the tin for 5-10 minutes before turning out and cutting into squares.", "For the sauce, place all the ingredients in a saucepan, bring to the boil and simmer until a syrup consistency is formed.", "Serve a square of parkin on each plate, then spoon over the syrup. Finish with a scoop of ice cream."]}, {"isVegetarian": false, "title": "Parma ham and spinach salad with croûtons and balsamic dressing", "url": "www_bbc_co_uk_food_recipes_parmahamandspinachsa_84882", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "3 slices parma ham", "4 thin slices ciabatta", "200g/7oz baby spinach, washed", "½ beef tomato, seeds removed, chopped", "1 tbsp chopped fresh chives", "1 tbsp balsamic vinegar", "1 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, heat one tablespoon of the oil in a large non-stick frying pan and fry the parma ham for one minute on each side, or until golden-brown. Remove from the pan and drain on kitchen paper.", "In the same pan, heat the remaining oil, place the ciabatta slices into the pan and cook until golden-brown.", "Place the spinach and tomato into a large bowl. Place the dressing ingredients into a small bowl, mix together well and pour over the salad. Mix well to combine.", "Transfer the salad to a large plate and top with the croutons and parma ham."]}, {"isVegetarian": false, "title": "Parma ham, camembert and mozzarella pizza", "url": "www_bbc_co_uk_food_recipes_parmahamcamembertand_86322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong flour", "1 tsp salt", "30g/1oz fresh yeast", "200ml/7fl oz tepid water", "3-6 tbsp olive oil, plus extra for greasing", "25g/1oz butter", "400g/14oz baby spinach leaves", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper ", "250g/9oz camembert, roughly chopped", "1 ball fresh buffalo mozzarella, torn into large pieces", "16 slices Parma ham", "4 tbsp double cream", "1 small bunch fresh coriander, chopped ", "75g/3oz Parma ham", "1 small ciabatta, cut into 2cm/1in cubes", "3 tbsp olive oil", "salt and freshly ground black pepper ", "50g/2oz mizuna leaves", "50g/2oz baby spinach leaves", "25g/1oz parmesan, shaved", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pizza, place the flour, salt and yeast into a large bowl and add the water and three tablespoons the olive oil and mix together to form a dough.", "Knead the dough for at least five minutes, until elastic. Add more oil if necessary.", "Cover the dough with cling film, then set aside and allow to prove for one hour.", "Divide the dough into four equal pieces and roll each piece into a ball, then roll out onto a floured work surface until about 5mm/¼in thick.", "Place onto a greased baking tray and set aside to prove for 30 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Heat a frying pan until hot and add the butter, spinach and garlic and stir-fry until the spinach has wilted down. Remove from the heat, allow to cool, then squeeze out any excess liquid. Season, to taste, with salt and freshly ground black pepper and divide among the four circles of dough.", "Place the camembert, mozzarella and the Parma ham on top of the spinach. Season well with salt and freshly ground black pepper.", "Place the pizzas into the oven to bake for ten minutes, then remove and spoon over the double cream and scatter over the coriander leaves. Return the pizzas to the oven for a further five minutes until the pizzas are cooked through.", "For the salad, place the Parma ham onto a baking tray and place into the oven for 3-4 minutes, or until crisp.", "Place the ciabatta cubes into a bowl and drizzle with the olive oil and season with salt and freshly ground black pepper. Place onto a separate baking tray and place into the oven to bake for five minutes, or until golden and crisp.", "Remove the ciabatta pieces from the oven place into a clean bowl with the mizuna and spinach leaves.", "Crumble the crisp Parma ham over and sprinkle with the parmesan.", "Add the lemon juice and toss once more.", "To serve, place a pizza onto each of four plates and place a small portion of salad alongside."]}, {"isVegetarian": false, "title": "Parma ham, red onion and gorgonzola tart", "url": "www_bbc_co_uk_food_recipes_parmahamredonionandg_86218", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets ready-made filo pastry", "50g/2oz butter, melted", "1 tbsp olive oil", "½ red onion, thinly sliced", "2 slices parma ham, chopped", "75g/2½oz gorgonzola, cubed", "handful fresh basil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Brush the filo sheets with melted butter and then layer into a small tart tin on a baking sheet. Place in the oven and bake for five minutes, or until crisp and golden. Remove from the oven and set aside.", "Heat the olive oil in a frying pan, add the onion and fry for four minutes, then spoon into the prepared flan. Top with the parma ham, gorgonzola and basil and bake in the oven for six minutes, or until the cheese has melted.", "Slide onto a plate and serve."]}, {"isVegetarian": false, "title": "Parma ham and rocket rolls", "url": "www_bbc_co_uk_food_recipes_parmahamrocketrolls_78031", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz rocket leaves", "2 slices Parma ham", "1tbsp olive oil", "½ lemon, juiced", "3 sun-dried tomatoes", "salt and freshly ground black pepper, to taste"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Separate the rocket into two equal bunches.", "Lay the Parma ham slices flat on a clean surface.", "Wrap the rocket in the Parma ham.", "Drizzle over with the oil and lemon juice.", "To serve lay the wraps across each other in the centre of the plate. Place the tomatoes around and season to taste."]}, {"isVegetarian": false, "title": "Parmesan-stuffed sardines with tomato salad", "url": "www_bbc_co_uk_food_recipes_parmesan-stuffed_18531", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium slices soft white bread, crusts cut off", "large splash milk\t", "large handful fresh basil", "large handful fresh flat-leaf parsley", "1 tbsp extra-virgin olive oil", "30g/1oz breadcrumbs", "20g/¾oz parmesan, freshly grated", "1 garlic clove, peeled, chopped", "salt and freshly ground black pepper", "4 tbsp extra virgin olive oil", "6 tbsp white wine vinegar", "salt and freshly ground black pepper", "8 small, vine-ripened tomatoes", "12 small or 8 large sardines, scaled, gutted, backbone removed, butterflied, heads attached (ask your fishmonger to do this for you)", "salt and freshly ground black pepper", "2 tbsp olive oil", "3 large handfuls rocket", "15-20 black olives, stones removed, halved", "small bunch fresh chives, cut into short lengths, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the stuffing, put the slices of bread into a bowl and pour over enough milk to completely wet them through. Place the wet bread into a fine sieve and set aside to drain for 4-5 hours, or preferably overnight, until the bread is moist but not wet. Squeeze out any excess milk before using.", "Once the bread has drained, prepare the tomatoes. Make a small cross in the bottom of each tomato using a sharp knife. Prepare a large pan of boiling water and a large bowl of iced water. Add the tomatoes to the boiling water and blanch for 1-2 minutes. Drain and immediately add them to the bowl of iced water. When the skins of the tomatoes have loosened, remove the tomatoes from the water and peel away the skins. Cut each skinned tomato into quarters and remove the seeds. ", "For the vinaigrette, whisk all of the vinaigrette ingredients together until well combined. Season, to taste, with salt and freshly ground black pepper.", "Sprinkle the quartered tomatoes with four tablespoons of the vinaigrette and set aside to marinate for at least 30 minutes.", "Continue with the stuffing: blend the basil and parsley in a food processor with the olive oil until the herbs are finely chopped. Add the breadcrumbs, soaked bread, parmesan and garlic and pulse until the mixture comes together as a paste. Season, to taste, with salt and freshly ground black pepper.", "To stuff the sardines begin by dividing the stuffing into 8 or 12 equal balls. ", "Place one filleted sardine onto a chopping, place one stuffing ball at the head end of the fish, and secure the fillets on either side of the stuffing ball using cocktail sticks so that the stuffing is inside the sardine. Smooth the stuffing that is still visible at the top and bottom of the fish using your fingertips. Repeat the process with the remaining sardines and stuffing balls.", "Season the sardines with a little salt and freshly ground black pepper.", "To cook the sardines, heat half of the olive oil in a large, non-stick frying pan over a medium to high heat. Fry half of the stuffed sardines until browned on one side, about 1–2 minutes. ", "Turn the fish over and fry for a further 1-2 minutes on the other side, or until the sardines are cooked through and golden-brown on both sides. Make sure the stuffing is heated through by inserting a sharp knife into the centre of the stuffing and testing the heat of the knife tip carefully with your fingertip. ", "Remove the sardines from the pan and set aside on a warm plate or in a warm oven.", "Repeat the frying process with the remaining oil and stuffed sardines. When cooked, gently remove the cocktail sticks from the sardines. ", "Just before serving, drizzle two tablespoons of the vinaigrette over the rocket leaves and combine to coat the leaves. Arrange the marinated tomato quarters and the olives alternately around the edge of each of four serving plates.", "To serve, place a handful of the dressed rocket into the centre of each of four serving plates. Divide the sardines equally among the four plates, stacking them on top of the rocket. Sprinkle with the chives. Spoon over the remaining vinaigrette."]}, {"isVegetarian": false, "title": "Parma ham-wrapped chicken with spicy pomegranate dip", "url": "www_bbc_co_uk_food_recipes_parmahamwrappedchick_85038", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cooked chicken fillets", "2 slices parma ham", "½ pomegranate, seeds only", "2 tbsp caster sugar", "1 tbsp white wine vinegar", "pinch dried chilli flakes", "2 tsp vegetable oil", "1 tbsp water", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint", "fresh coriander, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, wrap the chicken fillets in the parma ham and place onto a baking sheet. Transfer to the oven and bake for five minutes, or until hot all the way through.", "To make the pomegranate dip, place the pomegranate seeds, sugar, vinegar, chilli flakes and oil into a small saucepan and simmer for 3-4 minutes. Remove from the heat, stir in the remaining dip ingredients and pour into a small dipping bowl.", "To serve, place the chicken fillets onto a serving plate with the dipping sauce alongside and garnish with coriander."]}, {"isVegetarian": false, "title": "Parmesan and poppy seed biscuits with a chorizo and red wine chutney", "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_32812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 stalk rosemary, leaves removed and chopped finely", "280g/10oz plain flour", "60g/2¼oz Parmesan, grated", "210g/7½oz unsalted butter, softened", "½ tsp salt", "black pepper", "3 tbsp poppy seeds", "1 red onion, chopped", "250g/9oz cooking chorizo, diced", "1 red chilli, seeds removed, finely chopped", "1½ tbsp tomato purée", "100ml/3½fl oz apple juice", "pinch salt and pepper", "pinch herbes de Provence", "5 tbsp red wine", "2½ tbsp dark brown sugar", "½ tsp balsamic vinegar"], "serves": "Makes 25-30 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Parmesan and poppy seed biscuits, using your hands, lightly work all the ingredients together (except the poppy seeds) into a dough. You can also pulse all the ingredients together in a food processor. Shape the dough into a log about 3cm/1¼in diameter.", "Gently spread out the poppy seeds on a chopping board and roll the dough log in the poppy seeds.Wrap in cling film and place in the fridge for at least 30 minutes.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Remove the dough from the fridge and slice into rounds the thickness of a pound coin. Press the edges gently with your fingers to create a dome in the middle.", "Lay the biscuits onto a baking tray lined with baking paper and leave in the fridge to chill for a further 20 minutes minimum. You may need two trays to fit all the biscuits.", "Bake in the preheated oven for 10-12 minutes, or until golden. Leave to cool.", "For the chorizo and red wine chutney, bring all the ingredient to a simmer over a medium heat. Cook until the liquid has evaporated and the chutney is a thick but spreadable consistency. ", "To serve, place the biscuits on a serving board and the chutney in a serving bowl on the side."]}, {"isVegetarian": true, "title": "Parmesan and poppy seed lollipops", "url": "www_bbc_co_uk_food_recipes_parmesan_and_poppy_seed_44968", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_and_poppy_seed_44968_16x9.jpg", "ingredients": ["butter, for greasing ", "80g/3oz parmesan, finely grated (or similar alternative vegetarian hard cheese)", "1 tsp poppy seeds ", "1 tsp sesame seeds "], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7, line two large baking trays with baking paper and grease them with butter.", "Toss the cheese and seeds together in a small bowl. Sit a 9cm/3½in chefs’ ring or cookie cutter on one of the baking trays and sprinkle a small handful of the cheese mixture into it, in a thin layer. Carefully lift the ring off to reveal a neat-edged disc of parmesan and lay a lollipop stick on top, with the tip of the stick touching the middle of the disc. ", "Repeat with the remaining cheese and sticks to make 10 in total (leaving about 3cm/1¼in spaces between them to allow for any spreading during cooking).", "You should have a little parmesan left over, so use it to cover up the part of the lollipop stick resting on the disc. ", "Bake in the oven for five minutes, swapping the lollipops to a different shelf halfway through. The cheese should be lightly golden-brown and bubbling. ", "Remove from the oven and slide the paper off the baking trays and onto a rack to help speed up cooling. Leave to cool for 1–2 minutes, or until the lollipops have become crisp. Very carefully remove each one with a palette knife. I like to serve these stuck upright into a box with holes in the top. "]}, {"isVegetarian": false, "title": "Parma ham wrapped mozzarella with plum chutney", "url": "www_bbc_co_uk_food_recipes_parma_ham_wrapped_91632", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz caster sugar", "500g/1lb 2oz plums, stoned and roughly chopped", "1 onion, diced", "50ml/2fl oz malt vinegar", "1 star anise", "½ tsp ground cinnamon ", "salt and freshly ground black pepper", "8 slices Parma ham, cut in half lengthways", "4 balls buffalo mozzarella, drained and cut into quarters", "3 tbsp olive oil", "2 tsp sesame seeds", "8 slices ciabatta"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the plum chutney, heat a frying pan until hot, add the caster sugar and cook until melted and a light golden-brown colour.", "Add the chopped plums, onion, vinegar, star anise and cinnamon and cook for 5-8 minutes, or until the plums are tender and slightly pulpy.", "Season with a little salt and freshly ground black pepper and set aside to cool. If making in advance, store the chutney in an air-tight container in the fridge.", "For the mozzarella, wrap the slices of Parma ham around the mozzarella and set aside.", "Heat a large frying pan until hot, add one tablespoon of the olive oil and fry the parcels on each side until just crisp and the mozzarella is just starting to ooze.", "Sprinkle over the sesame seeds.", "Heat a griddle pan until searing hot, then drizzle the rest of the olive oil over the ciabatta and place onto the griddle.", "Char-grill on each side for 1-2 minutes, or until golden-brown. ", "To serve, spoon some chutney onto each of four plates, lay the wedges of mozzarella alongside and serve with the bread."]}, {"isVegetarian": true, "title": "Parmesan biscuits", "url": "www_bbc_co_uk_food_recipes_parmesan_biscuits_54963", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_biscuits_54963_16x9.jpg", "ingredients": ["100g/3½ oz cold unsalted butter, cut into chunks", "100g/3½ oz plain flour, plus extra for flouring", "pinch salt", "pinch cayenne pepper", "1 heaped tsp mustard powder", "50g/1¾ oz  finely grated mature cheddar", "50g/1¾ oz finely grated parmesan, or similar vegetarian hard cheese, plus a little extra", "1 egg, beaten"], "serves": "Makes about 25-30 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the butter and flour into the bowl of a food processor with the salt, cayenne, mustard powder and cheeses. Process together to begin with, and then finely pulse the mixture in short spurts as you notice the mixture coming together - it will eventually bind without the need for egg or water. Wrap in cling film and leave to chill in the fridge for at least 30 minutes.", "Lightly flour a work surface and gently roll out the pastry to about the thickness of two pound coins. Cut out the biscuits to the size and shape you wish - anything between 3cm/1¼in and 5cm/2in, depending on the occasion. Lay them out on a greased baking tray about 2cm/¾in apart - it may take two lots of baking to use up the entire mixture.", "Carefully brush the surface of each biscuit with the egg and sprinkle over a little finely grated parmesan. Bake for 10 minutes, or until they are a gorgeous golden-brown colour; the superb smell will also inform you that they are ready.", "Carefully lift the biscuits off the tray using a palette knife and place on a rack to cool. Although the biscuits will keep well in a sealed container for a few days, I have never known this to happen!"]}, {"isVegetarian": false, "title": "Parmesan chicken with red cabbage and kale salad", "url": "www_bbc_co_uk_food_recipes_parmesan_chicken_with_95119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 chicken breasts, skin removed", "130g/4½oz Parmesan, grated", "1 ball mozzarella, cut into 12 strips", "4 slices prosciutto or Parma ham, each cut into 3 strips", "75g/2¾oz plain flour", "4 free-range eggs", "70g/2½oz dried breadcrumbs", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 free-range egg yolk", "2 tsp Dijon mustard", "2 tsp red wine vinegar or raspberry vinegar", "2 tbsp vegetable oil", "1 small red cabbage, root removed, leaves very thinly sliced", "75g/2¾oz kale, stalked removed, leaves thinly sliced", "1 tsp cumin seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Cut a large pouch in each of the chicken breasts, using a small sharp knife.", "Divide 100g/3½oz of the Parmesan and the mozzarella into 4. Pile the Parmesan on top of the mozzarella and wrap each pile with the prosciutto pieces. Stuff each chicken breast with the prosciutto-wrapped cheese and press down the edges of the breast so the pouch is sealed (you can use a cocktail stick to help secure it).", "Sprinkle the flour onto a plate and season with salt and pepper. Beat the eggs in a bowl and sprinkle the breadcrumbs and remaining Parmesan on a separate plate. Dredge each cutlet in the flour, then dip into the eggs and coat in the cheese and breadcrumbs.", "Heat a frying pan until hot, add the olive oil and fry the chicken for 2-3 minutes on each side, or until golden-brown. Transfer to a roasting tray and roast in the oven for 15-20 minutes until cooked through. ", "Meanwhile for the salads, to make the dressing whisk the egg yolk, Dijon mustard, red wine vinegar and 250ml/9fl oz water together in a bowl until combined. Gradually whisk in 1 tablespoon of the vegetable oil, whisking all the time, until emulsified. Season with salt and pepper. Place the red cabbage into a large bowl, then pour over 100ml/3½fl oz of the dressing and mix well.", "Place the kale in a large bowl. Heat a small frying pan and add the remaining tablespoon of oil. Once hot add the cumin seeds. Once they start to jump remove from the heat and pour over the raw kale.", "Put the chicken on serving plates and place the red cabbage and kale salads alongside."]}, {"isVegetarian": false, "title": "Parmesan crusted chicken escalope with slow roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_parmesan_crusted_chicken_56186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tomatoes on the vine, halved widthways", "4 tbsp olive oil", "6 sprigs thyme, leaves picked", "salt and freshly ground black pepper", "60g/2½oz Japanese panko breadcrumbs", "25g/1oz parmesan cheese, freshly grated", "1 lemon, zest only", "4 chicken breasts, boneless and skinless", "75g/3oz plain flour", "2 free-range eggs, beaten", "50g/2oz butter", "1 bunch watercress, leaves picked", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 1.", "Place the tomatoes, cut side up onto a roasting tray and drizzle with the olive oil.", "Season with salt and black pepper then scatter half the thyme leaves over the top.", "Place in the oven and roast for 4-6 hours until slightly dried out. Turn the oven off and allow to cool, preferably overnight in the oven.", "For the chicken, place the breadcrumbs, parmesan, lemon zest and remaining thyme leaves into a food processor and blitz to fine crumbs.", "Butterfly the chicken breasts (Place the chicken onto what would have been the skin side, then cut down the centre line to half the way through. Turn the knife sideways and cut horizontally almost to the side of the breast to open it out, then repeat with the other side so you have a chicken breast, twice the size it was and half the thickness.)", "Season the flour with salt and black pepper then dust the chicken in the flour.", "Dip into the egg then into the breadcrumbs, making sure to coat each side thoroughly.", "Heat the olive oil and the butter in a large frying pan then add the chicken breasts, one at a time, and fry until golden-brown, about two minutes on each side. Place onto kitchen paper to drain.", "To serve, pile some tomatoes onto the plate, add the chicken and a handful of watercress then finish with a wedge of lemon."]}, {"isVegetarian": false, "title": "Parmesan French toast", "url": "www_bbc_co_uk_food_recipes_parmesan_french_toast_87497", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_french_toast_87497_16x9.jpg", "ingredients": ["1 large free-range egg ", "3 tbsp finely grated Parmesan ", "¼ tsp paprika ", "1 tsp Dijon mustard ", "½ tsp Worcestershire sauce ", "3 tbsp full-fat milk ", "2 slices white sourdough bread (see recipe tip)", "1 tbsp unsalted butter ", "½ tsp olive oil ", "flatleaf parsley, for sprinkling (optional)", "1 spring onion, thinly sliced, for garnishing (optional)"], "serves": "Serves 1–2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the egg, Parmesan, paprika, mustard, Worcestershire sauce and milk together in a shallow dish that the slices of bread will fit in. ", "Sit the bread in this mixture for about 2 minutes each side, pressing down on it every now and again. You want the slices to be soaked through and softened, but not falling to pieces. Spoon any remaining egg mixture over. ", "When the bread is soaked, warm the butter and oil in a frying pan over a medium heat. Once the butter is beginning to bubble, fry the bread for about 2 minutes each side – keep a good eye on it – until it is cooked through with patches of golden-brown on the surface. ", "Remove from the pan, and eat just as it is, or sprinkle with chopped parsley and thinly sliced spring onion, if desired."]}, {"isVegetarian": false, "title": "Parmesan roast parsnips and carrots", "url": "www_bbc_co_uk_food_recipes_parmesan_roast_parsnips_63627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["7-8 carrots, peeled and trimmed", "7-8 parsnips, peeled and trimmed", "3 tbsp olive oil ", "30g/1oz Parmesan, grated", "salt and freshly ground black pepper"], "serves": "Serves 7-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Cut the carrots and parsnips in half lengthways and cut any particularly large pieces in half again. Bring a large saucepan of water to the boil and add the vegetables. Boil for 3 minutes, or until the vegetables are just beginning to soften (you want them to keep their shape while roasting).", "Drain well and divide between 2 roasting trays (if the tray is crowded the vegetables won’t crisp up as well). Add the oil and mix to coat the vegetables. Season with salt and pepper and top with the Parmesan. ", "Roast for 25 minutes or until the carrots and parsnips are golden-brown at the edges. "]}, {"isVegetarian": true, "title": "Parmesan shortbreads", "url": "www_bbc_co_uk_food_recipes_parmesan_shortbreads_86971", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesan_shortbreads_86971_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "75g/2¾oz parmesan (or similar vegetarian hard cheese), grated", "100g/3½oz unsalted butter, softened", "1 free-range egg yolk"], "serves": "Makes 35-40", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together – using bowl and spoon, electric mixer or food processor as wished – until a golden dough begins to form a clump.", "Turn it out onto a surface and knead for about 30 seconds until smooth, then divide into two.", "Take the first half and, using your hands, roll it into a cylinder, as uniform as possible without stressing over it, about 3cm/1¼in diameter. Make sure the ends are flat, too, so that the cylinder resembles a roll of coins. Now wrap this up in a piece of cling film, twisting the cling film at the ends, like a Christmas cracker, and put the roll in the fridge, then proceed in the same way with the remaining half of the dough.", "Preheat the oven to 180C/375F/Gas 4 while the dough rests in the fridge for about 45 minutes, by which time you should be able to cut them into thick slices easily; aim for about 1cm, think fat pound coins or similar.", "Arrange on a baking sheet lined with baking parchment and put in the oven for 15-20 minutes, when they should be just beginning to turn a pale gold at the edges.", "Remove from the oven, then leave to cool (if you can) before eating."]}, {"isVegetarian": false, "title": "Parmesan and Parma ham crusted lamb chops with leek and mint purée", "url": "www_bbc_co_uk_food_recipes_parmesanandparmahamc_83101", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz fresh white breadcrumbs", "50/2oz Parma ham, very finely chopped", "4 tbsp freshly grated Parmesan", "1 tbsp chopped fresh flatleaf parsley ", "salt and freshly ground black pepper", "4 boneless lamb chops or 8 lamb cutlets ", "1 free-range egg ", "4 tbsp light olive oil", "25g/1oz butter", "4 tbsp vegetable stock ", "4 leeks, finely sliced", "salt and freshly ground black pepper", "6 tbsp double cream", "2 tbsp fresh mint leaves (optional)", "1 tsp white pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the chops, tip the breadcrumbs into a bowl and mix in the Parma ham, parmesan and parsley. Season generously with freshly ground black pepper.  ", "Trim any excess fat off the chops or cutlets, then beat out a little bit with a meat tenderizer or a rolling pin (a frying pan would also do the job).", "Beat the egg in a separate dish and season generously with salt and freshly ground black pepper, then use to coat the chops or cutlets. ", "Cover with the breadcrumb mixture, ensuring they are evenly coated.  Leave to chill and set in the fridge for one hour. Remove half an hour before cooking to allow the meat to come back to room temperature.", "Heat the olive oil in a large heavy-based frying pan. Add the chops or cutlets and cook for 3-4 minutes each side for large chops and 1-2 minutes each side if using cutlets.  They should be crisp on the outside but still pink in the middle. Drain on kitchen towel.", "For the leek purée, bring the butter and stock to the boil in a pan with a lid until it thickens to form an emulsion.", "Add the leeks with a good pinch of salt, cover and cook for 3-4 minutes until just tender but still vibrant green in colour, shaking the pan occasionally and stirring once or twice. ", "Transfer to a food processor or liquidiser, then add the cream and mint (if using) with the white pepper. ", "Blend to a smooth purée and season to taste with salt and freshly ground black pepper. Transfer to a clean pan.", "Gently reheat the leek purée and divide among warmed serving plates. Arrange a crisp chop on top of each one to serve."]}, {"isVegetarian": true, "title": "Parmesan biscuits", "url": "www_bbc_co_uk_food_recipes_parmesanbiscuits_609", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz chilled butter, cubed", "125g/4½oz plain flour", "25g/1oz freshly grated parmesan (or vegetarian alternative)", "salt and freshly ground black pepper", "pinch cayenne pepper"], "serves": "Makes 30 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Rub the butter into the flour, by hand or in a food processor, until the mixture looks like fine breadcrumbs.", "Stir in the parmesan, seasoning and cayenne pepper.", "Work the mixture together into a ball and then knead briefly on a work surface lightly dusted with flour until smooth.", "Cut the dough in half, flatten each piece slightly, then roll out thinly between 2 large sheets of cling film.", "Lift off the top piece of cling film and cut into 5cm/2in biscuits. ", "Carefully lift them onto a lightly buttered baking sheet, then knead together and re-roll the trimmings to make more biscuits. You should make about 30 biscuits in total.", "Bake the biscuits for 8-10 minutes until crisp and golden. Leave to cool on the baking sheets. Store in an airtight tin."]}, {"isVegetarian": false, "title": "Parmesan-crusted halibut, sag aloo and lime emulsion", "url": "www_bbc_co_uk_food_recipes_parmesancrustedhalib_91767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz parmesan, finely grated", "½ tsp mild Madras curry powder", "¼ tsp garam masala", "¼ tsp ground turmeric", "½ tsp sea salt flakes", "500g/1lb halibut fillet, cut into 16 equal-sized cubes ", "2 limes, juice and zest, plus 1 lime, juice only", "25g/1oz butter", "25g/1oz sugar", "2 tbsp vegetable oil", "1 banana shallot, finely chopped", "1 garlic clove, grated", "1 heaped tsp garam masala", "1 heaped tsp mild Madras curry powder", "¼ tsp ground turmeric", "500g/1lb 2oz new potatoes, cut into quarters, boiled for 8-10 minutes until just tender", "50g/2oz baby spinach leaves", "salt, to taste", "1 x 20g/¾oz punnet coriander cress, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parmesan-crusted halibut, in a bowl, mix together the parmesan, curry powder, garam masala, turmeric and salt until well combined.", "Dredge one side of each cube of halibut in the parmesan mixture until thickly coated. ", "Heat a heavy, non-stick frying pan over a low to medium heat. When the pan is warm, add the halibut cubes, parmesan-coated sides down, and dry fry for 4-5 minutes, or until the parmesan crusts are crisp and golden-brown.", "Season the halibut cubes, to taste, with salt, then turn them over and remove the pan from the heat. (NB: The residual heat from the pan will cook the other sides of the halibut cubes.) ", "For the lime emulsion, immediately add all of the lime emulsion ingredients to the pan containing the halibut cubes and set aside for 2-3 minutes.", "Meanwhile, for the sag aloo, heat the oil in a large frying pan over a high heat. Add the shallot and garlic and cook for 2-3 minutes, or until softened.", "Add the spices and continue to fry for 1-2 minutes, or until fragrant. ", "Add the cooked new potatoes and continue to cook for a further minute, or until warmed through. ", "Remove the pan from the heat and add the baby spinach. Stir well until the spinach has wilted, then season, to taste, with salt.", "To serve, divide the sag aloo equally among each of four serving plates. Place four cubes of parmesan-crusted halibut on top of each portion of sag aloo. Transfer the lime emulsion mixture from the pan to a bowl and whisk until well combined, then drizzle it over the halibut cubes and around the edge of the plates. Garnish with the coriander cress."]}, {"isVegetarian": false, "title": "Parmesan-crusted passata mussels", "url": "www_bbc_co_uk_food_recipes_parmesancrustedpassa_90478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz live mussels, debearded, cleaned and rinsed", "2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "175ml/6fl oz white wine", "2 tbsp olive oil", "¼ onion, finely chopped", "2 tomatoes, seeds removed and chopped", "1 tbsp tomato purée", "100ml/3½fl oz white wine", "6 fresh basil leaves, torn", "55g/2oz parmesan, grated", "crusty white bread"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the mussels, tap the mussels against a hard surface and discard any that do not close. ", "Heat the oil in a pan and gently fry the onions and garlic for 5-6 minutes, or until softened. Pour in the white wine and bring to a simmer, then add the mussels and cover with a lid for 4-5 minutes, or until the mussels have opened. Strain through a sieve, reserving the cooking liquor and discarding any unopened mussels. ", "For the passata sauce, heat the oil in a pan and gently fry the onions for 3-4 minutes, or until softened. Add the tomatoes, tomato purée and wine. Measure out 100ml/3½fl oz of the mussel cooking liquor and add to the passata. Cook for a further 3-4 minutes, then stir in the basil and cooked mussels.", "Spoon the mussels into a gratin dish, sprinkle over the parmesan and bake for 4-5 minutes, or until golden-brown and bubbling on top. Serve with crusty white bread."]}, {"isVegetarian": false, "title": "Parmesan-crusted pork chops with roasted red peppers", "url": "www_bbc_co_uk_food_recipes_parmesancrustedporkc_74758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 red peppers, cut into thin strips", "1 tbsp parsley, roughly chopped", "2 tbsp extra virgin olive oil", "60g/2¼oz fresh breadcrumbs", "30g/1¼oz parmesan cheese", "4 x 100g/3½oz escalopes of pork", "25g/1oz plain flour", "3 free-range eggs, beaten", "1 tbsp olive oil", "30g/1¼oz butter", "50g/1¾oz extra fine capers ", "1 lemon, segmented ", "4 large baking potatoes (peeled, diced and boiled)", "6 leaves savoy cabbage (blanched, refreshed and cut into strips)", "3 spring onions, finely chopped ", "200ml/7¼fl oz milk", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To roast the red peppers, preheat oven to 220C/430F/Gas 7. ", "Place the red peppers in a hot pan with a little olive oil and warm over a low heat. ", "Once they are warm, place them in the hot oven and turn every five minutes for 15-20 minutes.", "Remove peppers, place in a bowl and cover with cling film for approximately 20 minutes. This will make them easy to peel.", "Once the peppers are cool, remove the skin and seeds and cut them into strips. ", "Mix together the extra virgin olive oil and parsley and warm gently on stove while you cook the escalopes.", "For the potatoes, place the potatoes, savoy cabbage and spring onions in a small saucepan.", "Warm gently and slowly add milk as required. ", "Season and keep warm. ", "For the pork, mix the breadcrumbs and the parmesan together in a small bowl.", "Dip the pork escalopes into flour, then into the beaten egg and finally into the parmesan and breadcrumbs. ", "In a large non-stick frying pan, cook the pork escalopes over a medium heat in the olive oil and butter, until golden brown.", "Turn pork escalopes and cook on the other side, turning as necessary until thoroughly cooked.", "Transfer the pork onto kitchen paper and drain. ", "Return to the pan and add the warmed oil and parsley and the lemon segments and capers.", "To serve, place a pile of the peppers on each plate and place a pork escalope on top of the peppers. ", "Drizzle a little of the capers, lemon and butter mixture around the plate to serve."]}, {"isVegetarian": false, "title": "Parmesan crusted salmon", "url": "www_bbc_co_uk_food_recipes_parmesancrustedsalmo_77131", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1¼oz breadcrumbs", "30g/1¼oz parmesan cheese", "handful fresh parsley, chopped", "2 garlic cloves, crushed", "150g/5¼oz salmon steak", "150g/5¼oz broccoli, cut into florets"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the breadcrumbs, cheese, parsley and garlic in a food processor and blend until combined. The mixture should form fine crumbs.", "Coat the top of the salmon with the crumbs and bake in the oven for ten minutes or until the salmon is cooked through and the crumb is golden and crisp.", "Meanwhile, boil a saucepan full of salted water and drop in the broccoli.", "Cook the broccoli for four minutes or until just tender. Drain.", "Serve on a plate topped with the salmon."]}, {"isVegetarian": false, "title": "Parmesan gnocchi with tomato and basil sauce and pan-fried lemon sole", "url": "www_bbc_co_uk_food_recipes_parmesangnocchiwitht_87581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra virgin olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "500g/1lb 2oz fresh tomatoes, roughly chopped", "400g/14 oz can chopped tomatoes", "1 tbsp sun-dried tomato paste", "12 basil leaves", "salt and freshly ground black pepper ", "600g/1lb 5oz King Edward potatoes, peeled and cut into chunks", "pinch salt", "110g/4oz plain flour", "75g/3oz parmesan cheese, finely grated", "3 tbsp olive oil", "salt and freshly ground black pepper ", "2 fillets lemon sole, skinned and split lengthways into 2", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the tomato sauce, heat a large pan until hot and add the olive oil, onion and garlic and fry for 4-5 minutes until softened. ", "Add the fresh tomatoes, canned tomatoes and sun-dried tomato paste and bring to the boil.", "Reduce the heat and simmer for 10-15 minutes.", "Halfway through the cooking time, add the basil leaves. ", "Season with salt and freshly ground black pepper to taste. Leave to cool slightly before transferring to a food processor or blender. Blend until smooth and set aside.", "For the gnocchi, place the potatoes into a pan and cover with water. Add a pinch of salt and bring to the boil.", "Simmer for 10-15 minutes or until the potatoes are tender.", "Drain and return to the pan then place back over a low heat for a few seconds to remove any excess moisture.", "Pass the boiled potato through a potato ricer or sieve into a mixing bowl to make a very fine mash.", "Add the flour, parmesan and one tablespoon of the olive oil and beat together until smooth. Season with salt and freshly ground black pepper.", "Place a large nozzle into a piping bag and then add the potato dough to the bag.", "Bring a large pan of water to the boil. Take the bag of dough and hold it above the boiling water. As you squeeze the back of the bag with your right hand, hold a small sharp knife in your left hand and cut off 2.5cm/1in lengths of dough, allowing the gnocchi to drop into the pot. Pipe in about 12 gnocchi per batch. ", "The gnocchi will sink when it hits the water. As soon as it floats to the top, poach for a further 1-2 minutes.", "Remove the gnocchi from the water with a slotted spoon and drain on kitchen paper. Repeat the process with any remaining dough.", "Heat a frying pan until hot then add the remaining olive oil. Add the gnocchi and fry until golden-brown. Set the pan aside in a warm place.", "For the lemon sole, season the sole with salt and freshly ground black pepper.", "Heat a frying pan until hot and add the olive oil.", "Add the lemon sole to the pan and cook for 2-3 minutes until golden-brown.", "Carefully turn the lemon sole and cook for a further minute on the other side.", "To serve, add the tomato sauce to the gnocchi pan, enough to just coat the gnocchi, and heat slightly.", "Spoon the gnocchi into the centre of each of four plates and top each with half a fillet of lemon sole. Serve at once."]}, {"isVegetarian": true, "title": "Parmesan polenta crostini with caramelised onions", "url": "www_bbc_co_uk_food_recipes_parmesanpolentacrost_82322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["190g/7oz instant quick cook polenta", "750ml/1 pint 7fl oz boiling water mixed with 3 tsp vegetable stock powder", "75g/3oz Parmesan (or a similar vegetarian hard cheese), grated", "salt and freshly ground black pepper", "2 large red onions, peeled and thinly sliced", "2 tbsp olive oil", "2 tsp fresh thyme leaves, plus extra for garnishing", "2 tbsp balsamic vinegar", "1 tbsp brown sugar", "160g/5oz Taleggio cheese (or a vegetarian alternative), cut into cubes"], "serves": "Makes 20 canapés", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Bring the stock to the boil in a large pan.  Gradually add the polenta in a thin stream, whisking continuously. Reduce the heat to medium and stir with a wooden spoon until the polenta is very thick (this should take about four minutes).  ", "Remove from the heat, stir in the Parmesan and season well with salt and freshly ground black pepper.  You should season generously as the flavour tends to become less strong as the polenta cools.  Using a palette knife spread the polenta onto an oiled baking tray to a thickness of about 1cm/0.5in. When cool, place the baking tray in the fridge for about one hour for the polenta to firm up.  You can place the baking tray in the freezer before you spread out the polenta to speed up the cooling process. The cheesy polenta base can be made up to three days in advance.", "For the onion topping, sauté the onions in the olive oil together with the fresh thyme leaves in a large frying pan over a low heat for about 30 minutes, or until softened. ", "Add the balsamic vinegar and brown sugar.  Turn up the heat to medium and cook for about five minutes or until the vinegar has evaporated.  Season with salt and freshly ground black pepper.", "Heat the grill. Cut out 20 circles from the polenta using a 5cm fluted pastry cutter and place these on two oiled baking sheets.", "Spoon about one teaspoon of the red onion mixture on top of each polenta base and arrange the cubes of Taleggio on top.  ", "Place under the grill for 3-4 minutes until the cheese has melted and is turning golden brown.  Transfer onto serving plates and decorate with sprigs of thyme."]}, {"isVegetarian": false, "title": "Mini parmesan, mascarpone and cranberry scones", "url": "www_bbc_co_uk_food_recipes_parmesansconeswithma_92587", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/parmesansconeswithma_92587_16x9.jpg", "ingredients": ["200g/7¼oz self-raising flour, sifted with 1 tsp salt, plus extra for dusting", "50g/1¾oz parmesan, grated", "50g/1¾oz caster sugar ", "2 tsp baking powder ", "50g/1¾oz butter", "125ml/4½fl oz tepid milk, plus extra for glazing", "110g/4oz dried cranberries (reserve 24 cranberries for garnish)", "250g/8¾oz tub mascarpone", "24 small fresh basil leaves"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the parmesan scones, place all of the scone ingredients, apart from the milk and cranberries, into a bowl. Work the ingredients together with your fingertips until the mixture resembles breadcrumbs. ", "Add the dried cranberries and the milk, a bit at a time (you may not need all of the milk). Using floured hands, knead the mixture into dough and place on a floured work surface. Roll out to a thickness of about 1cm/½in. Using a cutter, cut into 5cm/2in rounds and place on a baking tray lined with greaseproof paper. Brush with a little milk (you can also use beaten egg).", "Transfer to the oven and bake for 15 minutes, or until risen and golden-brown. Transfer to a wire rack and leave to cool", "To serve, spread a thin layer of mascarpone on the top of each scone and top with a small basil leaf. Using a piping bag with a star-shaped nozzle, pipe a swirl of mascarpone on top of the basil leaf. Decorate with a cranberry."]}]