[{"isVegetarian": true, "title": "Pear tart", "url": "www_bbc_co_uk_food_recipes_peartart_87097", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "50g/2oz caster sugar", "4 pears, peeled and halved", "225g/8oz plain flour", "100g/3½oz unsalted butter", "25g/1oz caster sugar", "1 free-range egg", "1 tbsp milk, to bind, if required", "225g/8oz unsalted butter", "225g/8oz caster sugar", "4 free-range eggs", "1 lemon, zest only, finely grated ", "50g/2oz plain flour", "175g/6¼oz ground almonds", "100g/3½oz butter", "100g/3½oz caster sugar", "100g/3½oz dark chocolate", "1 tbsp cocoa powder", "½ tsp vanilla extract", "125ml/4fl oz water", "double cream"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter with the sugar in a large frying pan and cook until the sugar has dissolved and the mixture has become a golden-brown caramel.", "Add the pear halves and cook, turning once, until caramelised all over. Remove from the heat and set aside.", "For the pastry, place the plain flour, butter and sugar into a food processor and pulse together until the mixture resembles breadcrumbs.", "Add the egg and pulse until the mixture just comes together as a dough. Add a little milk if required. ", "Remove the dough from the food processor and roll to form a ball. Wrap in cling film and chill in the fridge for 40 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Remove the dough from the fridge and unwrap. Roll the pastry out on a clean, floured work surface to line a 20cm/8in tart tin. Transfer to the oven to bake for ten minutes, or until golden-brown.", "For the filling, mix the butter and sugar together in a bowl until light and fluffy.", "Add one egg at a time to the butter mixture and mix well, before adding the next (this can be done in a food mixer) until all the eggs are mixed into the butter and sugar.", "Add the lemon zest, plain flour and ground almonds and mix well to combine.", "Spoon the filling into the baked pastry tin and press the caramelised pear halves into the filling, so that they are half-submerged.", "Transfer to the oven and bake for 30 minutes, or until the filling is cooked through.", "For the chocolate sauce, place the butter, sugar, chocolate, cocoa powder, vanilla extract and water into a clean pan over a medium heat. Bring to the boil and simmer for 15 minutes, stirring regularly, until the sauce is thick and glossy.", "To serve, cut a piece of tart and place on a serving plate, top with the chocolate sauce and drizzle over the double cream."]}, {"isVegetarian": true, "title": "Pear tarts with Poire William cream", "url": "www_bbc_co_uk_food_recipes_peartartswithpoirewi_85533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz ready-made puff pastry, rolled out to 5mm/¼in thick", "3 small pears, peeled and halved", "1 lemon, zest and juice only", "50g/2oz caster sugar", "6 tbsp apricot jam", "1 vanilla pod, split, seeds scraped out", "300ml/½ pint whole milk", "2 free-range egg yolks", "75g/3oz caster sugar", "20g/¾oz cornflour", "3 tbsp sweet pear liqueur, such as Poire William", "300ml/11fl oz double cream", "6 fresh mint sprigs"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the tarts, cut out the puff pastry to fit six 10cm/4in tart cases. Line the cases with the puff pastry and place into the fridge for 30 minutes to chill.", "Prick the base of the pastry in each tart case with a knife, then line with baking paper and baking beans or rice and place onto a baking sheet. Transfer to the oven and bake blind for 15 minutes.", "Remove the baking paper and baking beans from the tart cases and return the tarts to the oven to bake for a further 5-8 minutes, until cooked through and golden. Remove from the oven and cool on a wire rack.", "Meanwhile, place the pears, lemon zest and juice and sugar into a pan and cover with water. Bring to the boil, then reduce the heat and simmer for 10-12 minutes, or until the pears are cooked and tender. Remove from the heat and allow to cool.", "For the cream, place the vanilla seeds and milk into a pan and bring to the boil.", "Meanwhile, place the egg yolks, sugar and cornflower into a bowl and mix well.", "Once the milk is boiling, pour onto the egg mixture and whisk vigorously. Pour the custard mixture back into the pan and bring back to the boil, stirring constantly.", "Once the mixture has reached boiling point, take the pan off the heat and allow to cool.", "Meanwhile, pour the pear liqueur into the cream and whip until soft peaks are formed when the whisk is removed.", "Fold the cream mixture into the custard gently, so as not to lose too much volume.", "Place the apricot jam into a saucepan with a teaspoon of water and warm through.", "Fill the cooled pastry cases with the pear liqueur cream.", "Place a poached pear half onto a board and cut into slices. Fan the pear slices slightly and gently place onto the cream.", "Pour the warm apricot sauce over the pears.", "To serve, place each tart onto a dessert plate and garnish with a sprig of mint."]}, {"isVegetarian": true, "title": "Peas à la français with poached eggs and toasts", "url": "www_bbc_co_uk_food_recipes_peas_a_la_franais_with_03769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz vegetable stock ", "50g/1¾oz butter ", "300g/10½oz frozen peas ", "2 Little Gem lettuce, 1 shredded, 1 cut into quarters lengthways ", "3 sprigs tarragon ", "salt and pepper ", "1 small baguette or baton, cut into 12 slices ", "4 eggs ", "1 tsp white wine vinegar "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the stock and butter in a large frying pan until simmering, stirring to mix. Add the peas and cook for two minutes, then add the Little Gem lettuce and two of the tarragon sprigs. Cook for 3-4 minutes, or until the lettuce has wilted, taste and season with salt and pepper to taste. Remove from the heat.", "Meanwhile toast the slices of bread either on a griddle pan, under a hot grill or in the toaster. Season with a pinch of salt and pepper on both sides.", "Heat a large, wide shallow pan of water. Break an egg in a teacup or ramekin. Whisk the vinegar and a pinch of salt into the water and gently drop the egg into the swirling water. Poach for 3-4 minutes or until the white is set and the yolk still runny (or until cooked to your liking). Remove with a slotted spoon and pat dry. repeat with the remaining eggs.", "Remove the tarragon sprigs from the peas.  Serve the peas on the toasts with a poached egg on top. Season the egg with a pinch of salt and pepper and garnish everything with roughly torn leaves from the remaining sprig of tarragon. Serve immediately. "]}, {"isVegetarian": false, "title": "Peas, mint, girolles and seared scallops", "url": "www_bbc_co_uk_food_recipes_peas_mint_girolles_and_53451", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz chicken stock ", "50g/1¾oz butter, plus extra for frying the scallops ", "sea salt", "black pepper", "150g/5½oz fresh peas ", "100g/3½oz girolles (chanterelle mushrooms)", "200ml/7fl oz double cream", "2 free-range egg yolks", "10 leaves fresh mint, chopped ", "4 large scallops (with or without roes, as preferred)", "1 banana shallot, finely sliced ", "olive oil, to taste ", "lemon juice, to taste ", "pinch sugar  ", "large handful pea shoots "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a pan, bring the stock and butter to the boil. Season with salt and pepper, add the peas and mushrooms and cook for 2-3 minutes, or until tender. ", "Remove the peas and mushrooms from the pan. Pour half the cream into the pan and bring to the boil. Cook until the volume of liquid has reduced to a sauce consistency. ", "Preheat the grill to hot.", "Put the egg yolks in a bowl and whisk in the reduced cream. Whisk the remaining cream until soft peaks form when the whisk is removed. Add the peas, mushrooms and the mint to the sauce, then add a spoonful of the whipped cream.", "Pour the mixture into a heatproof bowl and place under the grill for a few minutes, or until the vegetables are glazed and the sauce is bubbling.", "Heat a knob of butter in a frying pan until foaming. Place the prepared scallops in the hot pan and cook for a minute and a half on both sides, or until golden-brown and just cooked.", "In a bowl, mix the shallot with a little olive oil, lemon juice and a pinch of sugar. ", "To serve, divide the glazed peas and mushrooms between the serving plates. Place the scallops on top and put the shallot mix on top. Dress the plates with the pea shoots. "]}, {"isVegetarian": true, "title": "Pea, salted yoghurt and mint salad", "url": "www_bbc_co_uk_food_recipes_peasaltedyoghurtandm_91778", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peasaltedyoghurtandm_91778_16x9.jpg", "ingredients": ["200g/7oz peas, out of their pods", "1 long red chilli, seeds removed, finely chopped", "1 garlic clove, peeled, finely chopped", "½ lemon, juice only", "½ tbsp extra virgin olive oil", "sea salt flakes and freshly ground black pepper", "100g/3½oz firm, salted, strained yoghurt or fresh soft goats' cheese", "small handful fresh mint leaves, torn"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the peas in a pan of boiling, salted water for 1-2 minutes, or until tender. Drain well, then refresh in cold water until cold. ", "In a large bowl, mix together the cooled, cooked peas, chilli, garlic, lemon juice and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper.", "Break up the strained yoghurt or goats' cheese into bite-sized pieces and sprinkle over the pea mixture. Sprinkle over the mint leaves and mix lightly to combine. ", "Serve immediately."]}, {"isVegetarian": true, "title": "Pea soup", "url": "www_bbc_co_uk_food_recipes_peasoup_81686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, finely chopped", "75g/2½oz fresh peas", "150ml/5fl oz hot vegetable stock", "50ml double cream, plus 1 tsp extra, to serve", "salt and freshly ground black pepper", "fresh mint sprig, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a small saucepan over a medium heat. Add the onions and gently fry for three minutes, until softened. ", "Add the peas and stock, bring to the boil, then reduce the heat to simmer for 10 minutes.", "Add the double cream, salt and pepper and heat through for one minute. Pour into a food processor and blend until smooth.", "To serve, pour into a bowl and garnish with a swirl of double cream and a sprig of mint."]}, {"isVegetarian": false, "title": "Pea soup with blue cheese scones", "url": "www_bbc_co_uk_food_recipes_peasoupwithbluechees_81624", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz self-raising flour", "1 tsp baking powder", "50g/1¾oz unsalted butter", "50g/1¾oz blue cheese", "1 free-range egg", "50ml/2fl oz milk", "1 tbsp olive oil", "1 garlic clove, chopped", "1 banana shallot, chopped", "200g/7oz peas", "300ml/10½fl oz hot chicken stock", "50g/1¾oz blue cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the blue cheese scones, place the flour, baking powder and butter into a food processor and blend.", "Add the cheese, egg and milk and blend again, until the mixture is just coming together.", "Bring the dough together with floured hands and roll onto a floured surface to 1cm/½in thickness.", "Using a 5cm/2in chefs' ring, cut five rounds out of the pastry, then brush them with milk.", "Place the rounds onto a baking sheet and place into the oven to bake for 15 minutes, or until risen and golden.", "To make the pea soup, heat the olive oil in a saucepan over a medium heat. Add the garlic and shallot and fry for two minutes to soften.", "Add the peas and cook for five minutes.", "Add the stock and blue cheese, bring to the boil, then reduce the heat to simmer for 10 minutes.", "Season, to taste, with salt and freshly ground black pepper, then blend with a hand blender until smooth.", "To serve, pour into a large cappuccino cup or small bowl and place onto a large plate with the scones piled alongside."]}, {"isVegetarian": true, "title": "Pea soup with croûtons", "url": "www_bbc_co_uk_food_recipes_peasoupwithcroutons_88481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "100g/3½oz fresh peas, podded", "300ml/10fl oz vegetable stock", "salt and freshly ground black pepper", "50ml/2fl oz double cream", "50g/2oz butter", "1 thick slice white bread, cubed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablepsoon of the olive oil in a saucepan and gently fry the onion for around 4-5 minutes, until turning translucent.", "Add the peas and stock, bring to a simmer and cook for about five minutes, or until the peas are tender. Season, to taste, with salt and freshly ground black pepper and stir in the cream.", "Allow to cool slightly then, using a hand blender, process the soup until smooth.", "Heat the remaining tablespoon of olive oil and the butter in a frying pan and fry the bread cubes, until golden-brown and crisp all over.", "Reheat the soup if necessary and serve in a bowl, with the croûtons scattered over the top."]}, {"isVegetarian": true, "title": "Pea soup with mint cream", "url": "www_bbc_co_uk_food_recipes_peasoupwithmintcream_88716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "2 banana shallots, finely chopped", "400g/14oz peas", "350ml/12fl oz chicken stock or vegetable stock", "150ml/5fl oz double cream", "salt and freshly ground  black pepper ", "1 lime, zest only", "2 tbsp mint, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a pan until hot, then add the butter and shallots and fry over a low heat for 2-3 minutes, until the shallots have softened but not coloured.", "Add the peas and stock and bring to the boil. Reduce the heat and simmer for 2-3 minutes.", "Allow the soup to cool for a few minutes, then carefully pour into a food processor and blend to a smooth purée. Return the soup to the saucepan.", "Add 110ml/4fl oz of the cream, and season well with salt and freshly ground  black pepper.", "Place the remaining cream into a bowl and whisk until soft peaks form when the whisk is removed.", "Fold in the lime zest and mint.", "Spoon the soup into serving bowls and add a spoonful of the lime and mint cream to the middle."]}, {"isVegetarian": true, "title": "Pecan and maple pinwheels", "url": "www_bbc_co_uk_food_recipes_pecan_and_maple_63294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_and_maple_63294_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "10g/¼ oz fine sea salt", "50g/1¾oz caster sugar", "9g/⅓oz fast-action yeast ", "1 large free-range egg, plus one yolk, lightly beaten", "150ml/5fl oz full-fat milk, heated to 43C", "vegetable oil, for greasing", "250g/9oz unsalted butter, chilled ", "150g/5½oz pecans ", "85g/3oz light muscovado sugar, ", "2 tbsp maple syrup ", "30g/1oz unsalted butter, softened ", "1 large free-range egg beaten with 2 tbsp milk", "50g/1¾oz apricot jam", "2 tsp lemon juice", "150g/5½oz icing sugar, sifted", "2 tbsp boiling water", "½ tsp vanilla extract"], "serves": "Makes 12 large Danish pastries", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry dough, put the flour, salt and sugar on one side of a mixing bowl and the yeast on the opposite side. Add the eggs, egg yolk, warm milk and 80ml/2½fl oz water and mix for one minute using a fork until combined. Add a little more water if needed to form a firm dough.", "Dust a work surface with flour and turn out the dough. Dust with a little flour and knead for 5 minutes, then shape into a ball.", "Lightly oil a mixing bowl and a large piece of cling film. Put the dough in the bowl and cover with the cling film. Set aside in a warm place to prove for an hour, or until almost doubled in size. ", "For the filling, in a food processor, pulse 100g/3½oz of the pecans until fine. Transfer to a bowl and stir in the sugar, maple syrup and butter. Cover and leave at room temperature. Roughly chop the remaining pecans to use as a garnish.", "To make the pastry, sandwich the chilled butter between the open wrapper and a piece of cling film. Using a rolling pin, beat the butter until it is flattened to roughly 1.5cm/⅝in. Roll out the dough on a lightly floured work surface until 1cm/½in thick and roughly double the size of the butter. ", "Arrange the dough with a short edge nearest you and put the butter in the middle. Fold the top and bottom of the pastry over the butter so it is just overlapping. Press all the edges and sides together to ensure the butter is sealed within the pastry. Using a rolling pin, tap the dough from the middle upwards and from the middle downwards. This ensures the butter is evenly distributed.", "Roll out the pastry to a large rectangle approximately 1cm/½in thick. Turn dough so you have a long edge nearest you, then fold the right third into the middle and cover with the left third. Chill in the fridge for 30 minutes. Do this turning, folding and chilling three more times.", "Preheat the oven to 200C/180C Fan/Gas 6. Line two large baking trays with non-stick baking paper. ", "Roll out the dough to a 30x40cm/12x16in rectangle.  Using a pizza cutter or a sharp knife, cut the dough into 12 equal squares.", "To shape the pastry, cut a line from every corner almost into the middle of the square. Brush the tip of each corner with a little of the egg and milk mixture, and fold the alternate corners into the middle pressing down firmly, creating a pinwheel. ", "Transfer the pastries to the prepared trays. Using your finger, press down to create a hollow in the middle of the pastry for the filling.  Put 1 teaspoon of the ground pecan mixture into the centre of each pastry and scatter with a few chopped pecans to decorate. Cover the baking trays with cling film and set aside in a warm place to rise for 10 minutes.", "To finish, brush each pastry with egg wash and bake for 15–20 minutes, or until the pastry is crisp and golden-brown. ", "Meanwhile, for the apricot glaze, combine the apricot jam and lemon juice with 2 tablespoons water in a small saucepan. Slowly heat the mixture, stirring gently, until runny. Pass through a sieve and set aside. While the pastries are still warm brush them with the apricot glaze. ", "For the icing, mix the icing sugar, boiling water and vanilla extract together until smooth. Transfer to a piping bag fitted with a small plain nozzle and pipe lines across the cooled pastries to finish. "]}, {"isVegetarian": true, "title": "Sweet potato pecan pie", "url": "www_bbc_co_uk_food_recipes_pecan_pie_82855", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour", "150g/6oz salted butter", "120g/4oz icing sugar", "3 free-range egg yolks", "1 tbsp whole milk ", "100g/3½oz pecans, finely chopped", "1kg/2lb 4oz peeled sweet potatoes, roughly chopped (about two large sweet potatoes) ", "170g/6oz caster sugar ", "1½ tsp ground cinnamon ", "1 whole nutmeg, grated ", "3 free-range eggs ", "6 tbsp condensed milk ", "¾ tsp vanilla extract ", "30g/1oz melted butter ", "300g/10½ oz  pecans "], "serves": "Makes 1 pie", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, lightly grease a 28cm/11in fluted loose-bottomed flan tin. Combine the flour, butter and icing sugar in a food processor and pulse until the mixture resembles fine breadcrumbs. Add the egg yolks and a splash of milk and pulse until the pastry just comes together. Bring the dough into a ball and wrap in cling film. Freeze for 10 minutes, then place in the fridge for a further 20 minutes.", "Bring a pan of salted water to the boil and add the sweet potatoes. Cook for ten minutes or until very tender. Drain and allow to cool slightly.", "When the pastry has chilled, roll it out to a thickness of ½cm/¼in, then transfer it to the greased tin, leaving a little pastry dangling over the edge. Use any leftover pastry to patch-up any holes. Press the chopped pecans into the pastry. Prick the base with a fork and chill in the fridge for 20 minutes.", "Preheat oven to 170C/375F/Gas 5.", "Cover the pastry case with baking parchment and fill with baking beans. Bake blind for 10 minutes, then remove the paper and beans and bake for a further 15 minutes. Cool the pastry case in the tin on a wire rack.", "Mash the cooked sweet potato very roughly. Stir in the sugar, eggs and spices. Then add the condensed milk, vanilla and butter and mix thoroughly.", "Pour the filling into the cooled case. Arrange the pecan halves on the top of the filling and sprinkle with ground cinnamon.", "Bake for 25 minutes, or until the filling is set. Leave to cool for 10 minutes, before removing the pie from the tin. Aloow the pie to reach room temperature before transferring to the fridge to chill."]}, {"isVegetarian": true, "title": "Mincemeat strudel", "url": "www_bbc_co_uk_food_recipes_pecanandmincemeatstr_87725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 sheets ready-made filo pastry ", "1 free-range egg, beaten with a pinch of salt added", "1 jar ready-made mincemeat", "pinch ground mixed spice", "single cream, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place a sheet of the filo on a large baking sheet and brush all over with the beaten egg. Place a second sheet of filo on top of the first and brush with egg, then top with the final filo sheet and brush with beaten egg. ", "Spoon the mincemeat along one edge of the layered filo sheets, then roll up the filo into a large sausage shape. Seal the edges securely, brushing with more beaten egg and dust lightly with the mixed spice.", "Bake for about 8-10 minutes until the pastry is cooked through and golden-brown. ", "To serve, transfer to a serving plate and serve at the table with a jug of pouring cream alongside."]}, {"isVegetarian": true, "title": "Pecan pie", "url": "www_bbc_co_uk_food_recipes_pecanpie_86028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecanpie_86028_16x9.jpg", "ingredients": ["110g/4oz unsalted butter", "110g/4oz golden syrup", "1 tsp vanilla extract", "225g/8oz brown sugar", "3 free-range eggs, beaten", "1 x 245g/8½oz shop-bought shortcrust pastry case", "285g/10oz pecan nuts, halved"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the butter, golden syrup, vanilla extract and sugar into a heavy-based saucepan over a low heat.", "When the butter has melted, remove the pan from the heat and leave to cool for 5-10 minutes.", "Add the beaten eggs to the mixture and stir well.", "Set aside a small handful of the pecan nuts. Arrange the remaining pecan halves evenly in the pastry case and carefully pour over the syrup mixture.  ", "Place into the preheated oven and bake for 40-50 minutes - the pie will be golden-brown, but the filling should still be slightly soft. ", "Leave the pie to cool on a wire tray. As the pie begins to set, decorate the top with the reserved pecan halves. Serve in slices."]}, {"isVegetarian": true, "title": "Pecan toffee cheesecake", "url": "www_bbc_co_uk_food_recipes_pecan_toffee_cheesecake_22876", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pecan_toffee_cheesecake_22876_16x9.jpg", "ingredients": ["100g/3½oz pecans", "150g/5oz chocolate digestive biscuits, roughly broken", "75g/3oz butter", "375g/13oz caster sugar", "4 tbsp cold water", "150g/5oz white chocolate, broken into squares", "600g/1lb 5oz full-fat cream cheese", "150ml/5fl oz double cream", "2 free-range egg yolks", "4 free-range eggs", "300ml/10fl oz double cream"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Line a baking tray with greaseproof paper and lightly oil a 23cm/9in springform cake tin.", "Put the pecans and biscuits into a food processor and blend to a coarse powder. Melt the butter in a small pan and pour into the food processor with the motor running. Blend until the biscuits and butter are thoroughly combined. ", "Place the crumb mixture into the cake tin. Spread evenly over the base and press down lightly with the back of a spoon. Place the tin in the fridge and leave the base to set while you make the filling.", "For the filling, put 200g/7oz of the caster sugar in a saucepan with the cold water and heat gently until the sugar dissolves, stirring occasionally. Bring the liquid to the boil and cook for 4-5 minutes without stirring until the sugar syrup turns a deep golden brown. Swirl the caramel around the pan gently as it bubbles.", "As soon as the caramel is the colour of toffee, remove from the heat and carefully pour onto the lined baking tray. Tilt the tin so the caramel covers the base evenly. Leave to cool and set. ", "Melt the chocolate in a heatproof bowl over a pan of simmering water. Take off the heat and leave to cool for 20 minutes, but do not allow to set. ", "Preheat the oven to 180C/160C (fan)/Gas 4 and boil a kettle of water.", "Put the cheese, cream, remaining sugar, egg yolks and eggs in a food processor and blend until smooth. Gradually add the cooled chocolate with the motor running and blend until just mixed. ", "Crush the hardened caramel into small shards using the end of a rolling pin. Fold half of the caramel into the cheese mixture and pour gently on to the biscuit base. (Keep the rest on the tray, lightly covered with clingfilm in a cool place. Do not put in the fridge or the moisture will cause the caramel to soften.)", "Put a large piece of aluminium foil on the work surface. Place the tin in the centre of the foil and bring up the sides to create a foil bowl around the cheesecake.  ", "Place in a medium-sized roasting tin and add enough just-boiled water to rise 2cm/¾in up the sides of the tin. Carefully place the roasting tin in the centre of the oven and bake for 45-50 minutes. The cheesecake is ready when it is almost, but not fully, set. ", "When the cheesecake is ready, turn off the oven but leave the cheesecake inside for a further 30 minutes. (This will help prevent the surface cracking as the cheesecake cools.)", "Lift the cake tin from the water and peel off the foil. Put the cheesecake in the fridge, cover and chill for at least two hours before serving. ", "To serve, carefully release the tin and slide the cheesecake onto a flat serving plate or cake stand, using a palette knife to help you. Whip the cream until soft peaks form and spoon in big fluffy clouds over the cheesecake. Scatter the remaining shards of caramel on top. Serve in wedges. "]}, {"isVegetarian": true, "title": "Pecan pie with cardamom ginger ice cream", "url": "www_bbc_co_uk_food_recipes_pecanpiewithcardamom_67749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz muscovado sugar", "110g/4oz butter", "110ml/4fl oz honey", "140g/5oz pecans (65g/2½oz finely chopped, remainder left whole)", "1 egg, beaten ", "a pinch of ground cinnamon", "4 small deep sweet pastry tartlet cases, baked blind", "pecan halves, to decorate", "maple syrup, to decorate", "225g/8oz caster sugar", "4 eggs, yolk only", "170ml/6oz semi-skimmed milk", "170ml/6oz full-fat milk", "340ml/12fl oz double cream", "2 tsp vanilla extract", "1 heaped tbsp chopped stem ginger", "6-8 cardamom seeds, finely ground"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["First make the ice cream. In a mixing bowl, combine the caster sugar and egg yolks together. Beat the mixture until it is a thick yellow paste and set it aside. ", "Bring the semi-skimmed and the whole milk to a simmer in a heavy-based, medium-sized saucepan. Slowly beat the hot semi skimmed and whole milk mixture into the egg and sugar mixture. This mixture should be hot, but not boiling. ", "Return the mixture to the saucepan and simmer very gently, stirring constantly, for a few minutes until it thickens to a custard-like consistency. Strain the mixture into a large bowl, cool and chill overnight in a refrigerator. ", "The next day, stir in the double cream, vanilla, ginger and ground cardamom. Churn in an ice cream maker, following manufacturer's instructions, until frozen. Cover and freeze until required. ", "Preheat the oven to 170C/325F/Gas 3. ", "Make the pecan pies. In a saucepan, melt together the muscovado sugar and butter. Remove from the heat and stir in the honey, finely chopped pecans, beaten egg and cinnamon. Mix together thoroughly. ", "Pour the pecan mixture into the tartlet cases and top with the whole pecans. ", "Bake the pecan tarts for 20 minutes. ", "Serve the tarts warm from the oven topped with a scoop of the cardamom ginger ice cream. Decorate the serving plates with pecans and a drizzle of maple syrup."]}, {"isVegetarian": true, "title": "Peking-style vegetable dumplings", "url": "www_bbc_co_uk_food_recipes_pekingvegetabledumpl_91214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pekingvegetabledumpl_91214_16x9.jpg", "ingredients": ["4 tbsp vegetable oil", "50g/1¾oz morning glory, finely sliced (available in some Asian markets; substitute spinach if unavailable)", "50g/1¾oz pak choi, finely sliced", "50g/1¾oz fresh shiitake mushrooms, finely sliced", "1 small red onion, finely sliced", "25g/1oz bamboo shoots, finely sliced", "50g/1¾oz bean sprouts", "small handful fresh coriander, finely chopped", "1 red chilli, seeds removed, finely chopped", "salt and freshly ground black pepper ", "8 circular wonton wrappers (for vegan versions, look for egg-free wrappers)", "1 tsp cornflour, mixed to a paste with 1 tsp water", "vegetable oil, to shallow fry", "ready-made hot and sour sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half a tablespoon of the oil in a wok over a high heat. Add the morning glory, pak choi, shiitake mushrooms, red onion, bamboo shoots and bean sprouts and stir fry for 2-3 minutes, or until the vegetables have softened slightly. ", "Remove from the heat and add the coriander and chilli. Season with salt and freshly ground black pepper and allow to cool.", "Lay the wonton wrappers on a clean surface. Place one tablespoon of the fried vegetables in the centre of each wrapper. Using a pastry brush, brush the edges of each wrapper with the cornflour paste. Fold the sides together to create a semi-circular wonton shape.", "Place the wontons in a steamer over boiling water, and steam for six minutes. Remove and allow to cool.", "Heat the rest of the oil in a shallow pan until hot. Place the steamed wontons one by one into the hot oil and cook on one side until golden-brown. Remove with a slotted spoon and drain on kitchen paper before serving.", "Serve with hot and sour sauce."]}, {"isVegetarian": false, "title": "Peking-style duck with udon noodle soup", "url": "www_bbc_co_uk_food_recipes_pekingstyleduckwithu_83641", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp Chinese five-spice powder", "1 tbsp sesame oil", "3 tbsp hoi sin sauce", "3 tbsp brown sugar", "3 tbsp water", "1 tbsp dark soy sauce", "2 x 175g/6 oz duck fillets, skin on ", "1 litre/35fl oz chicken stock", "2 dried shiitake mushrooms, soaked in 200ml hot water for 20 minutes", "100g/4oz Chinese leaf, shredded", "1  tbsp light soy sauce", "1  tbsp rice wine", "1  tbsp rice vinegar", "200g/8oz flat udon noodles, cooked ", "3 spring onions, sliced on the diagonal", "40g/2oz bean sprouts", "1 large handful coriander, roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Place all of the marinade ingredients into a shallow bowl and mix well to coat the duck. Marinate for as long as you can - preferably overnight, but anything more than 20 minutes will do.", "Heat a dry frying pan until just warm. Place the duck skin-side down and cook for 8-10 minutes, until golden brown.", "Turn up the heat, turn over the duck and cook for a further minute until crisp.", "Transfer to the oven and cook for 10-15 minutes.", "Remove from the oven and rest for five minutes, before slicing.", "For the noodle soup, pour the chicken stock into a saucepan and bring to a gentle simmer. Add the shiitake mushrooms and their soaking liquid, and the Chinese leaf.", "Add the light soy sauce, rice wine, rice vinegar and udon noodles to the pan. Bring to the boil.", "Scatter over the chopped spring onions, bean sprouts and coriander. Season to taste.", "To serve, ladle some of the noodle soup into a bowl, place the duck breast on top and serve straightaway."]}, {"isVegetarian": false, "title": "Pembrokeshire seafood", "url": "www_bbc_co_uk_food_recipes_pembrokeshire_seafood_29704", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pembrokeshire_seafood_29704_16x9.jpg", "ingredients": ["500g/1lb 2oz clams", "250g/9oz mussels, cleaned", "500g/1lb 2oz razor clams", "150ml/5fl oz white wine", "25g/1oz dulse butter (alternatively use salted butter)", "100g/3½oz samphire", "black pepper", "1 shallot, finely chopped", "1 garlic clove, crushed ", "100ml/3½fl oz cream", "2 tomatoes, skin and seeds removed, cut into 1cm/½in cubes ", "1 lemon, juice only", "10g red seaweed"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the shellfish by cleaning the shells and removing any beards from the mussels. Discard any with open shells that do not close when given a sharp tap.", "Place all the seafood in a large, hot pan. Add the white wine, cover with a lid and cook for 2-3 minutes. Discard any shells that have not opened.", "Strain and reserve the cooking liquor. Remove all the flesh from the shells and chop the white meat from the razor clams into 2cm/1in pieces. Place the razor clam shells onto a serving plate or flat stone.", "In the same pan, melt half of the butter and add the samphire. Season generously with pepper and cook for 1-2 minutes. Spoon the cooked samphire into the razor clam shells. ", "Add the remaining butter to the pan along with the shallot and garlic. Gently fry for 1-2 minutes, then add the reserved cooking liquor (taking care not add the dregs from the bottom of the bowl). Stir in the cream and simmer until the volume of liquid is reduced by half and the sauce is thick enough to coat the back of a spoon.", "To finish, add the seafood and tomatoes to the sauce and gently warm through. Season to taste with salt and pepper then add the lemon juice. ", "Spoon the sauce over the samphire and top with red seaweed to serve."]}, {"isVegetarian": false, "title": "Penang fish curry", "url": "www_bbc_co_uk_food_recipes_penang_fish_curry_70583", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp sunflower oil", "15 Thai shallots (or 8 ordinary shallots), peeled and finely sliced", "2 x 160g/5¾oz cans coconut cream", "4 tbsp Thai yellow or red curry paste", "400g/14oz can coconut milk ", "2 lemongrass stalks", "8 fresh kaffir lime leaves, rinsed", "1-2 tbsp Thai fish sauce (nam pla) ", "2 tbsp palm sugar or soft light brown sugar", "150g/5½oz pea aubergines, washed well (or 150g/5½oz green beans, cut into short lengths)", "1 large red pepper and 1 large yellow pepper, seeds removed, cut into 3cm/1¼ chunks", "1kg/2lb 4oz skinless mixed fresh white fish fillets, such as hake, pollack and whiting", "200g/7oz mangetout, trimmed and rinsed", "handful coriander, leaves picked ", "handful Thai basil (or normal basil), roughly torn", "cooked rice, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place a large non-stick wok or wide frying pan or over a medium-high heat. Add the oil and stir-fry the sliced shallots for 5-8 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "Return the pan to a low heat, add the coconut cream and the curry paste and cook for one minute, stirring constantly. Pour over the coconut milk and stir in 100ml/3½fl oz water. Bring to a gentle simmer.", "Put the lemongrass on a board and cut in half. Bash with a rolling pin to bruise and flatten the stalks – this will allow their flavour to escape more easily into your curry. Add the lemongrass, lime leaves, nam pla and sugar to the pan and cook for 1-2 minutes more, or until the sugar dissolves, stirring.", "Add the pea aubergines and simmer gently for eight minutes, stirring occasionally until almost tender. (If using green beans, cook for three minutes instead.) Stir in the peppers and cook for five minutes more, stirring regularly. The coconut curry sauce needs to be bubbling gently but constantly to cook the vegetables. ", "When the aubergines are tender, taste the curry sauce and add more Thai fish sauce if necessary. It needs to have a good balance of hot, salty, sour and sweet. At this point the curry sauce can be removed from the heat and left to stand before the fish is ready to be cooked.", "Cut the fish pieces into 3cm/1¼in chunks and season with ground black pepper. Stir the fish and mangetout into the curry and cook for a further five minutes. Turn the fish in the sauce every now and then at the beginning of the cooking time, but stop as soon as you see it beginning to flake. ", "The fish should look opaque rather than translucent when cooked and the curry should be thick and creamy but not so thick that it begins to burn on the bottom of the pan. If it does reduce too far, simply add a little extra water.", "Scatter the crisp shallots, coriander leaves and roughly torn Thai basil on the curry and serve immediately with cooked rice."]}, {"isVegetarian": false, "title": "Penne and sausage pasta bake", "url": "www_bbc_co_uk_food_recipes_penne_and_sausage_pasta_30949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_and_sausage_pasta_30949_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, diced", "2 garlic cloves, chopped", "8 thick pork sausages, skin removed, meat crumbled ", "400g tin chopped tomatoes", "300ml/10½fl oz vegetable stock", "50g/1¾oz butter", "50g/1¾oz plain flour", "500ml/18fl oz milk", "400g/14oz penne pasta", "salt and pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6", "Heat a large frying pan over a medium heat. Add the oil and gently cook the onion with a pinch of salt for 4-5 minutes or until soft and translucent. Add the garlic and continue to cook for 2 minutes.", "Crumble in the sausagemeat and fry until coloured on all sides. Add the tomatoes and vegetable stock, season with a pinch of salt and pepper and turn down the heat. Gently simmer for 10 minutes while you make the white sauce.", "Melt the butter in a saucepan. Add the flour and stir to mix. Cook over a medium heat for 2-3 minutes, or until the mixture has taken on a biscuit-coloured appearance. Slowly add the milk, bit by bit, whisking as you add to prevent any lumps from forming. Season with salt and pepper and bring to a simmer. Cook for 5 minutes to thicken slightly then remove from the heat.", "Meanwhile cook the penne in a pan of salted boiling water according to the packet instructions. Once cooked, drain and pour into the pan with the sausage and tomato mixture. Mix well. Pour this into a medium-sized ovenproof baking dish. Pour over the white sauce and bake for 15-20 minutes, or until bubbling and golden."]}, {"isVegetarian": false, "title": "Penne carbonara", "url": "www_bbc_co_uk_food_recipes_penne_carbonara_98193", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp extra virgin olive oil", "300g/11oz pancetta, sliced", "3 free-range egg yolks", "50g/1¾oz parmesan, grated, plus extra for serving", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "350g/12oz fresh penne pasta", "3 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot. Add the olive oil and pancetta and cook for 3-5 minutes, or until crisp. Remove the pancetta from the pan and set aside to drain on kitchen paper.", "Whisk the egg yolks, parmesan and cream in a bowl and season, to taste, with salt and freshly ground black pepper.", "Cook the penne according to pack instructions in a pan of salted boiling water.", "Drain the pasta and add it to the cream mixture, stirring continuously until smooth. Add the pancetta and parsley and stir until well combined.", "To serve, spoon pasta into warmed bowls and sprinkle with a little extra parmesan."]}, {"isVegetarian": true, "title": "Penne pasta with tomato fondant and roasted vegetables", "url": "www_bbc_co_uk_food_recipes_penne_pasta_with_87725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ butternut squash, peeled and cut into 3cm/1¼in chunks", "½ aubergine, cut into 3cm/1¼in chunks ", "1 large sweet potato, peeled and cut into 3cm/1¼in chunks", "1 courgette, cut into 3cm/1¼in chunks", "3 tbsp olive oil, plus extra for frying", "1 onion, finely chopped", "1 garlic clove, finely chopped", "400g/14oz tinned chopped tomatoes", "400g/14oz penne pasta", "100g/3½oz fine green beans, cut into 2cm/1in lengths, blanched", "2 tbsp roughly chopped flatleaf parsley", "100g/3½oz fresh breadcrumbs", "150g/5½oz strong cheddar cheese, grated"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the squash, aubergine, sweet potato and courgette in a large roasting tin and drizzle with with the olive oil. Roast in the oven for 20 minutes, or until soft and golden-brown.", "Heat a medium frying pan and add a little oil. Once hot, add the onion and garlic. Cook for 3-4 minutes until soft.", "Add the tinned tomatoes and cook for a further 15 minutes, or until reduced in volume by half.", "Meanwhile, place a large saucepan of water on the hob and add a pinch of salt. Once boiling, add the penne pasta and cook according to packet instructions. Once cooked drain and stir in the tomato sauce, roasted vegetables, green beans and parsley. Transfer to an ovenproof dish.", "Mix the breadcrumbs and cheese in a small mixing bowl, then sprinkle over the pasta.", "Bake in the oven for 15-20 minutes, or until golden-brown."]}, {"isVegetarian": false, "title": "Penne with anchovy, broccoli, chilli and garlic", "url": "www_bbc_co_uk_food_recipes_penne_with_anchovy_19322", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_anchovy_19322_16x9.jpg", "ingredients": ["400g/14oz dried penne pasta ", "1 x 50g/1¾oz tin anchovies in olive oil, oil reserved ", "2 garlic cloves, finely sliced ", "1 tsp chilli flakes (use half if you prefer less heat) ", "1 head of broccoli (about 350g/12oz), chopped into very small florets ", "salt and black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the pasta according to packet instructions in a large saucepan of salted boiling water.", "Heat a large frying pan over a medium heat. Pour 1½ tablespoons (or as much as there is in the tin if it doesn’t make 1½ tablespoons) of the anchovy oil into the pan and, once hot, add the anchovies and the garlic, breaking the anchovies up with a wooden spoon as they cook. Cook gently until the anchovies have melted into a paste. Add the chilli flakes and mix well. Reduce the heat to low until the pasta is ready.", "When the pasta is two minutes away from being ready, add the broccoli to the pan with the pasta. Continue to cook for two minutes and then drain, reserving a cup of the cooking water. Tip the pasta and broccoli into the pan with the anchovies and stir well to coat everything in the anchovy sauce. If the anchovies are too thick or the pasta a little sticky, then add a dash of the pasta water, stir and continue to add until all the pasta is coated with the sauce.", "Taste and adjust the seasoning as necessary. Serve."]}, {"isVegetarian": true, "title": "Penne with peas and beans", "url": "www_bbc_co_uk_food_recipes_penne_with_peas_and_44307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penne_with_peas_and_44307_16x9.jpg", "ingredients": ["350g/12oz wholewheat penne", "1 tbsp extra virgin rapeseed oil or olive oil", "2 spring onions, finely chopped", "200g/7oz reduced-fat mascarpone cheese", "4 tbsp lemon juice", "400g/14oz frozen peas, thawed", "400g/14oz frozen baby broad beans, thawed", "1 small bunch of basil, roughly chopped, a few leaves reserved for garnish", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne in a large saucepan of boiling water for 10-12 minutes, or until al dente.", "Meanwhile, heat the oil in a large frying pan over a medium-low heat, add the spring onions and fry for 1-2 minutes or until softened. Stir in the mascarpone, lemon juice, peas, broad beans and basil. Season with salt and freshly ground black pepper and stir for 1-2 minutes or until bubbling.", "Drain the penne, reserving a little  of the cooking water. Stir the pasta into the peas and beans. Add a little of the pasta cooking water, if needed, to loosen the mixture. Garnish with basil and serve."]}, {"isVegetarian": true, "title": "Penne with roasted vegetable and tomato sauce", "url": "www_bbc_co_uk_food_recipes_penne_with_roasted_77840", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz penne", "400g tin chopped tomatoes", "2 tbsp extra virgin olive oil", "pinch onion powder", "pinch garlic granules", "½ tsp chipotle sauce, or to taste ", "250g/9oz frozen roasted Mediterranean vegetables", "freshly ground black pepper", "4 tbsp freshly grated Parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of salted water to the boil. Add the penne and cook according to the packet instructions, normally 10–12 minutes.", "Meanwhile, tip the tomatoes into a large saucepan. Add the oil, onion powder, garlic granules and chipotle sauce, stir well, then bring to the boil over a medium heat. Simmer for 2 minutes.", "Remove from the heat and blend until smooth using a stick blender. Return to the heat, stir in the roasted vegetables and cook for 2–3 minutes, or until bubbling.", "Drain the penne, reserving a little of the water, then tip the pasta into the sauce and stir. Add a couple of spoonfuls of pasta water to the pan, then season well with black pepper. ", "Serve sprinkled with grated Parmesan."]}]