[{"isVegetarian": true, "title": "Pasteles de espárragos y champiñones", "url": "www_bbc_co_uk_food_recipes_asparagusandmushroom_71984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manojo de espárragos, tallos recortados", "375g / 13oz listo enrollado hojaldre", "1 cucharada de aceite de oliva", "pequeño cubo de mantequilla", "1 cebolla roja grande, finamente rebanada", "1 diente de ajo, picado", "1 cucharada de vinagre balsámico", "2 cucharadas de azúcar de caña", "400g / 14oz de hongos variados", "4 huevos de gallinas camperas"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Cocine los espárragos en agua con sal o vapor durante 2-3 minutos hasta que estén tiernos. Luego drene y sumerja en agua fría, para enfriar.", "Coloque la hoja de hojaldre en una bandeja de horno engrasada, cepille con huevo batido y divídalo en cuatro. Haga un corte superficial en cada hojaldre, 1 cm por cada borde del borde.", "Cocine la cebolla y el ajo en la mantequilla y el aceite de oliva durante 20 a 30 minutos, a fuego lento, hasta que estén caramelizados.", "Agregue los champiñones, el vinagre balsámico y el azúcar y cocine por un par de minutos.", "Coloque la mezcla de cebolla y champiñones en el centro de cada masa, dejando los bordes despejados.", "Hornee de 15 a 20 minutos hasta que estén dorados, luego retírelos del horno, espolvoréelos con espárragos y cocíqueles un huevo.", "Hornea por otros ocho minutos, luego deja que se enfríe un poco antes de servir con sal y pimienta negra recién molida."]}, {"isVegetarian": true, "title": "Vinagreta de espárragos y cebolla", "url": "www_bbc_co_uk_food_recipes_asparagusandonionvin_76847", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 lanzas de espárragos", "2 cucharaditas de vinagre de vino blanco", "gran chorrito de vino blanco", "½ cebolla roja, pelada y finamente picada", "sal y pimienta negra recién molida", "pocas hojas de tomillo", "llovizna de aceite de oliva virgen extra"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Ponga a hervir una olla de agua y cocine las espárragos durante 2-3 minutos. Desagüe.", "Mientras tanto, coloca el vinagre, el vino y la cebolla roja en una olla pequeña y calienta suavemente durante 5-6 minutos, para reducir. Agregue las hojas de condimento y tomillo a la sartén y caliente por otros 2 minutos.", "Para servir, transfiera los espárragos a un plato de servir. Rocíe la vinagreta sobre los espárragos y termine con un chorrito de aceite de oliva."]}, {"isVegetarian": false, "title": "Espárragos y envolturas de jamón de Parma", "url": "www_bbc_co_uk_food_recipes_asparagusandparmaham_78789", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 lanzas de espárragos escaldadas durante dos minutos en agua hirviendo", "1 cucharada de aceite de oliva", "2 rebanadas de jamón de Parma", "3 lanzas de espárragos, escaldadas durante dos minutos en agua hirviendo y picadas", "1 cucharada de vinagre de vino blanco", "jugo de ½ limón"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Envuelva los espárragos con el jamón de Parma en paquetes de tres.", "Calentar una sartén con el aceite. Agregue los paquetes y fría para colorear por un minuto en cada lado. Retire de la sartén y reserve.", "En la misma sartén, agregue los espárragos picados y los ingredientes restantes y fría por dos minutos.", "Para servir, coloque las envolturas en un plato y vierta sobre la salsa."]}, {"isVegetarian": true, "title": "Sopa de capuchino de espárragos", "url": "www_bbc_co_uk_food_recipes_asparaguscappuccinos_87220", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "100g / 3½oz de espárragos picados", "250ml / 9fl oz de caldo de verduras calientes", "sal y pimienta negra recién molida", "2 cucharadas de crema doble", "2 rebanadas finas de ciabatta, tostadas, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite de oliva en una olla mediana, agregar la cebolla y freír suavemente durante cinco minutos, o hasta que esté suave.", "Agregue el ajo y cocine por un minuto.", "Agregue los espárragos y cocínelos durante tres minutos, o hasta que se ablanden.", "Agregue el caldo, sazone con sal y pimienta negra recién molida y deje que hierva. Reduzca el fuego y cocine a fuego lento durante cinco minutos, luego agregue la crema.", "Use una licuadora para mezclar la sopa hasta que quede suave.", "Para servir, vierta la sopa en una taza de capuchino y sirva con pan ciabatta tostado."]}, {"isVegetarian": true, "title": "Sopa de capuchino de espárragos", "url": "www_bbc_co_uk_food_recipes_asparaguscappuccinos_87234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "2 cucharaditas de hojas de Romero fresco picado", "puñado de espárragos picados", "4 cucharadas de leche", "2 cucharadas de perejil fresco picado", "sal y pimienta negra recién molida", "1 cucharadita de cebolletas frescas picadas, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una cacerola y fría la cebolla hasta que se suavice pero no se coloree.", "Agregue el romero y los espárragos picados y cocínelos durante 3-4 minutos. Deje que se enfríe un poco.", "Transfiera la mezcla a una licuadora y agregue la leche y el perejil. Sazonar, al gusto, con sal y pimienta negra recién molida y licuar hasta que quede suave.", "Para servir, vuelva a calentar la sopa si es necesario, luego viértala en una taza de capuchino y decore con cebolletas."]}, {"isVegetarian": false, "title": "Espárragos con jamón curado, huevo de pato escalfado y salsa holandesa", "url": "www_bbc_co_uk_food_recipes_asparagus_with_cured_ham_54730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de vinagre de vino blanco", "4 huevos de pato", "16 lanzas de espárragos, tallos pelados y recortados", "8 rebanadas de jamón curado al aire, idealmente británico (alternativamente, use serrano o jamón de Parma)", "125g / 4½oz de mantequilla sin sal", "50ml / 2fl oz de vinagre de vino blanco", "1 chalote, finamente picado", "½ cucharadita de granos de pimienta negros enteros", "2 yemas de huevo grandes", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Para los espárragos, el jamón y los huevos, prepare un recipiente con agua helada.", "Llevar a ebullición una sartén ancha de agua con sal y agregar el vinagre. Reduzca el fuego hasta que el agua hierva a fuego lento. Rompe un huevo de pato en un tazón pequeño. Mezcle el agua con el extremo de una cuchara de madera para crear un remolino, luego vierta cuidadosamente el huevo de pato en el vórtice y cocine a fuego lento durante 3-4 minutos, o hasta que esté cocido a su gusto.", "Retire el huevo del agua con una cuchara ranurada y cuidadosamente baje al agua helada.", "Cueza los huevos de pato restantes de la misma manera. Ponga a un lado la sartén utilizada para pochar los huevos y el agua de caza furtiva.", "Para la salsa holandesa, derrita la mantequilla en una cacerola, luego retírela del fuego y déjela enfriar por completo.", "En una cacerola aparte, caliente el vinagre, el chalote y la pimienta en grano hasta que hierva, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad (aproximadamente 2 minutos).", "Batir las yemas de huevo con una pizca de sal en un recipiente con un batidor eléctrico. Con el batidor en marcha, agregue lentamente la mantequilla derretida, gota a gota, al principio, hasta que todo se haya incorporado a las yemas de huevo.", "Cuele la mezcla de vinagre a través de un tamiz fino en la mezcla de huevo, batiendo hasta que se combinen. (Deseche la chalota y los granos de pimienta.) Sazone la salsa, al gusto, con sal y pimienta negra recién molida, luego cubra y mantenga caliente en un recipiente suspendido sobre una fuente de agua caliente.", "Trabajando rápidamente, devuelva la olla de agua utilizada para cocer los huevos al fuego y llevar a ebullición. Agregue las espárragos y hierva durante 3-4 minutos, o hasta que los tallos estén tiernos cuando se perfora con la punta de un cuchillo. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Regrese los huevos escalfados al agua de cocción furtiva y vuelva a calentar durante 20-30 segundos, luego retírelos de la sartén con una espumadera y déjelos a un costado para escurrirlos sobre papel de cocina.", "Para servir, divida las lanzas de espárragos por igual entre cuatro platos para servir. Cubra cada porción con un huevo de pato escalfado y unas rodajas de jamón. Cuchara sobre la salsa holandesa caliente. Espolvoree todo con sal y pimienta negra recién molida, luego sirva."]}, {"isVegetarian": false, "title": "Quiche de espárragos con salmón ahumado", "url": "www_bbc_co_uk_food_recipes_asparagusquichewiths_84794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharadita de aceite de oliva, para cepillar", "1 gran hoja de hojaldre filo, cortado en 6 cuadrados", "1 huevo de gallinas camperas, golpeado", "75g / 2¾oz de queso crema", "1 huevo de gallinas camperas, golpeado", "1 rebanada de salmón ahumado", "1 lanza de espárragos grande, finamente picada", "1 cucharada de cebolletas frescas picadas, más extra, para adornar", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la masa, ligeramente aceite una lata de muffins. Presione un filo cuadrado en la lata, luego cepille ligeramente con huevo batido y coloque el siguiente cuadrado en la parte superior. Repita con todos los cuadrados de filo.", "Para el relleno, coloque todos los ingredientes en un recipiente, reserve algunos cebollines picados para la guarnición y mezcle bien.", "Vierta la mezcla de relleno en la caja de pastelería, transfiérala al horno y hornee durante 10-12 minutos, o hasta que se dore.", "Para servir, coloque la quiche en un plato pequeño y espolvoree el cebollín."]}, {"isVegetarian": false, "title": "Ensalada de espárragos, guisantes, queso feta y menta", "url": "www_bbc_co_uk_food_recipes_asparagus_pea_feta_and_41658", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_pea_feta_and_41658_16x9.jpg", "ingredients": ["3 puñados de guisantes recién envainados", "1 manojo de espárragos flacos, blanqueados", "100 g / 3½ oz de queso feta", "puñado de hojas de menta picadas", "jugo de limón, al gusto", "aceite de oliva, al gusto", "sal y pimienta negra recién molida", "semillas de cebolla negra, al gusto"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle todos los ingredientes aparte de las semillas de cebolla negra.", "Pruebe verificar el condimento y agregue sal y pimienta según sea necesario. Espolvorea las semillas de cebolla en la parte superior."]}, {"isVegetarian": true, "title": "Risotto de esparragos", "url": "www_bbc_co_uk_food_recipes_asparagusrisotto_85593", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagusrisotto_85593_16x9.jpg", "ingredients": ["6 lanzas de espárragos, extremos leñosos eliminados", "1 cucharada de aceite de oliva", "1 chalote, picado", "1 diente de ajo, picado", "Arroz risotto 200 g / 7 oz (por ejemplo carnaroli o arborio)", "250ml / 9fl oz de vino blanco", "500ml / 18fl oz de caldo de verduras calientes", "25 g / 1oz de mantequilla sin sal", "75g / 2¾oz de queso parmesano (o un queso duro vegetariano similar), rallado", "sal y pimienta negra recién molida", "120g / 4¼oz de parmesano (o un queso duro vegetariano similar)"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine los espárragos en agua hirviendo durante unos minutos hasta que estén tiernos. Escúrralos y déjelos enfriar, luego corte en trozos pequeños y déjelos a un lado.", "Para el risotto, caliente el aceite en una sartén y fríe con cuidado la chalota y el ajo hasta que estén suaves pero no coloreados. Agregue el arroz y fría por un minuto, revolviendo con frecuencia, hasta cubrir el aceite. Agregue el vino y cocine a fuego lento hasta que el arroz lo absorba.", "Agregue el caldo de verduras calientes a cucharadas a la vez, revolviendo entre cada adición para permitir que el líquido se absorba completamente, hasta que el arroz esté cocido y el caldo haya sido absorbido (es posible que no necesite todo el caldo). Agregue los espárragos, la mantequilla y el parmesano, sazone al gusto, con sal y pimienta negra recién molida y mezcle bien.", "Para las patatas fritas parmesano, precaliente el horno a 170C / 150C ventilador / Gas 3 y alinee una bandeja de horno con papel de hornear. Divida el queso en seis pilas pequeñas, dejando suficiente espacio entre ellas, ya que el parmesano se extenderá. Presione las pilas de queso parmesano hacia abajo para aplanarlas, luego transfiéralas al horno y hornee por 6-8 minutos, hasta que estén doradas. Retire del horno y deje enfriar y fraguar.", "Para servir, divida el risotto por partes iguales entre dos platos para servir y cubra con las patatas fritas parmesano."]}, {"isVegetarian": true, "title": "Caldo de espárragos, guisantes y perejil con espárragos salteados y huevo cocido", "url": "www_bbc_co_uk_food_recipes_asparagus_pea_and_00682", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Hojas de perejil de hoja plana de 50g / 2oz, recogidas", "50g / 2oz de mantequilla", "1 chalote, finamente picado", "250g / 9oz de guisantes congelados", "Recortes de espárragos 150 g / 5 oz", "500ml / 18fl oz de caldo de verduras", "Crema doble 75ml / 3fl oz", "2 cucharadas de berro de perejil", "2 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre de vino blanco", "4 huevos", "4 cucharadas de aceite de oliva", "200 g / 7 oz de salsifí, pelado y cortado en bastones de 2 cm / 1 in, conservado en agua acidulada", "Lanzas de espárragos de 300g / 11oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el caldo, ponga a hervir un sartén con agua con sal, agregue el perejil y blanquee durante 30 segundos, escurra y vuelva a llenarlo con agua helada.", "Escurrir el perejil blanqueado, exprimir y luego cortar y reservar.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla y la cebolla y freír suavemente durante unos minutos hasta que se ablande.", "Agregue los guisantes, los espárragos y el caldo y deje que hierva. Agregue el perejil escaldado picado.", "Vierte el caldo, en tandas, en una licuadora y mézclalo en un caldo fino.", "Cuele a través de un colador fino en una cacerola limpia y vuelva a calentar hasta que hierva a fuego lento - revise el condimento y agregue sal y pimienta recién molida al gusto.", "Para la guarnición, ponga a hervir una olla grande de agua. Agregue el vinagre y una pizca de sal. Coloque un recipiente con agua helada al lado.", "Hierva los huevos en el agua por cinco minutos exactamente, luego retírelos de la sartén con una espumadera y déjelos enfriar brevemente con agua helada.", "Retire los huevos del agua helada, uno por uno, agriete suavemente la cáscara y con cuidado pele el huevo, quitando todo el caparazón.", "Calentar una sartén hasta que esté medio caliente, agregar la mitad del aceite de oliva y el salsifí y saltear durante 3-4 minutos hasta que estén tiernos y dorados.", "Ponga a hervir una olla de agua con sal, agregue las lanzas de espárragos y blanquee durante 2 minutos.", "Escurra las lanzas de espárragos y mezcle con un poco de aceite de oliva.", "Caliente una sartén hasta que esté caliente, agregue los espárragos y el carbón por cada lado durante unos minutos.", "Para servir, amontone los espárragos y salsifíquelos en el centro de un plato sopero y luego vierta el caldo alrededor.", "Coloque con cuidado el huevo en el centro de la pila de espárragos y córtelo.", "Adorne con el berro de perejil y un chorrito de aceite de oliva."]}, {"isVegetarian": true, "title": "Espárragos con huevo escalfado y salsa holandesa", "url": "www_bbc_co_uk_food_recipes_asparagussoldiersand_72297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 espárragos espárragos, recortados", "sal", "1 cucharada de vinagre de vino blanco", "2 huevos", "4 rebanadas de brioche, tostado", "1 yema de huevo", "1 limón, solo jugo", "1 cucharada de agua", "110 g / 4 oz de mantequilla clarificada, calentada", "pimienta de cayena y sal, para sazonar"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cueza al vapor los espárragos sobre abundante agua hirviendo durante 3-5 minutos (dependiendo del grosor de las lanzas).", "Ponga a hervir una olla de agua con sal y agregue el vinagre. Batir para hacer un remolino. Una vez que esté listo, rompe un huevo en el medio. Cocine a fuego lento durante 2-3 minutos, retírelo y manténgalo caliente. Repita con los otros huevos.", "Haga el holandés colocando la yema de huevo, el jugo de limón y el agua en una licuadora. Encienda la máquina y luego lentamente vierta la mantequilla calentada a través de la tapa. Sazone con pimienta de cayena y sal.", "Apile 5-6 lanzas de espárragos en cada brioche tostado. Cubra con un huevo escalfado. Cuchara en la salsa holandesa y servir."]}, {"isVegetarian": true, "title": "Sopa de espárragos", "url": "www_bbc_co_uk_food_recipes_asparagussoup_83241", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagussoup_83241_16x9.jpg", "ingredients": ["2 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "400g / 14oz de espárragos, finamente picados", "500ml / 18fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida", "4 cucharadas de crema doble"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de oliva en una cacerola a fuego medio. Agregue la cebolla y fría por cuatro minutos, hasta que se ablande.", "Agregue los espárragos y cocine por otros dos minutos.", "Añadir el caldo y hervirlo. Sazonar, al gusto, con sal y pimienta negra recién molida y reducir el fuego a fuego lento durante 5-7 minutos, hasta que los espárragos estén cocidos.", "Agregue la crema y mezcle con una batidora de mano hasta que quede suave."]}, {"isVegetarian": true, "title": "Sopa de espárragos con puntas de espárragos, patatas Royal Jersey y berros", "url": "www_bbc_co_uk_food_recipes_asparagussoupwithasp_86323", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g / 2oz de mantequilla", "2 chalotes, picados", "2 ramitas de tomillo fresco", "Espárragos de 450 g / 1 libra, tallos picados en trozos pequeños, pinzas para el salteado", "125ml / 4½fl oz de vino blanco", "450 ml / 16 fl oz de caldo de pollo (los vegetarianos pueden sustituirlo con caldo de verduras)", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "Patatas Royal Jersey de 110g / 4oz, cocidas y cortadas en cubos", "1 cucharada de aceite de oliva", "60g / 2½oz de berro, solo hojas", "1 pequeño manojo de cebollín fresco, picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la sopa, caliente una sartén hasta que esté caliente y agregue la mantequilla, los chalotes y el tomillo y cocínelos durante dos minutos.", "Agregue los tallos de espárragos, reservando las puntas para la ensalada y cocine por un minuto.", "Agregue el vino blanco, hierva y cocine hasta que el líquido se reduzca a la mitad.", "Agregue el caldo de pollo y llévelo a ebullición. Reduzca el fuego y cocine a fuego lento durante 7-8 minutos, hasta que los espárragos estén tiernos.", "Retirar del fuego y mezclar con una batidora manual o colocar en un procesador de alimentos (dejar enfriar durante 3-4 minutos) y licuar hasta que quede suave.", "Regrese la sopa a la sartén a fuego medio y agregue la crema. Revuelva bien y condimente, al gusto, con sal y pimienta negra recién molida.", "Para sofreír, caliente una sartén hasta que esté caliente y agregue las papas y el aceite de oliva y fría por 2-3 minutos, o hasta que comience a colorear.", "Agregue las puntas de espárragos reservadas y saltee durante 2-3 minutos, o hasta que los espárragos estén cocidos.", "Retirar del fuego y agregar el berro y el cebollín. Mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la patata y los espárragos salteados por igual en el centro de los cuencos de sopa poco profundos y ponga la sopa alrededor de cada uno."]}, {"isVegetarian": false, "title": "Espárragos con fettuccine y tocino ahumado", "url": "www_bbc_co_uk_food_recipes_asparaguswithfettucc_88830", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparaguswithfettucc_88830_16x9.jpg", "ingredients": ["Fettuccine 500 g / 1 libra 2 oz", "2 cucharadas de aceite vegetal", "Tocino ahumado 300 g / 11oz o panceta, cortado en bastones", "1 cucharadita de pimienta negra recién molida", "12 lanzas de espárragos blanqueados", "3 huevos grandes de gallinas camperas", "1 cucharada de aceite de oliva", "110 g / 4 oz de parmesano, recién rallado, más extra, para servir", "puñado de perejil fresco, picado"], "serves": "6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Ponga a hervir una olla grande de agua. Agregue el fetuccini y cocine de acuerdo con las instrucciones del paquete.", "Mientras la pasta se cocina, caliente una sartén grande a fuego alto y agregue el aceite vegetal. Agregue el tocino y fría por 3-4 minutos, hasta que se dore. Sazonar con pimienta recién molida negro.", "Cortar los espárragos en trozos de 3cm / 1in y agregar a la sartén con el tocino. Cocine por 1-2 minutos, solo para calentar.", "Rompe los huevos en un bol y rompe las yemas con un tenedor.", "Escurra la pasta cocida y vuelva a la sartén en la que se cocinó. Retenga un poco del agua en la que se cocinó la pasta.", "Agregue la mezcla de tocino y espárragos, incluidos los aceites de cocina de la sartén. Mezcle bien para combinar a fuego lento. Cocine por un minuto, luego agregue el huevo, el queso parmesano y el agua de cocción reservada y cocine durante 30 segundos a un minuto, revolviendo constantemente, hasta que el huevo esté recién cocido.", "Agregue el perejil picado y la cuchara en porciones iguales en seis tazones. Rallar un poco más de parmesano y servir."]}, {"isVegetarian": false, "title": "Espárragos con huevo escalfado y tocino", "url": "www_bbc_co_uk_food_recipes_asparaguswithpoached_86393", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 tallos de espárrago inglés", "12 lonchas de tocino rayado curado en seco", "ramita de estragón fresco", "1 limón, solo jugo", "2 cucharaditas de vinagre de vino blanco", "2 yemas de huevo de gallinas camperas", "250 g / 9 oz de mantequilla, clarificada", "sal y pimienta negra recién molida", "4 huevos de gallinas camperas, escalfados según tus preferencias", "1 cucharadita de pimentón ahumado (opcional)"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a su configuración más alta. Caliente una sartén hasta que fume.", "Recorte los tallos de espárragos y blanquee durante un minuto en agua hirviendo. Retire y escurra sobre papel de cocina.", "Coloque los espárragos en la sartén de la plancha y cocínelos, volteándolos de vez en cuando hasta que estén carbonizados por completo.", "Coloque el tocino debajo de la parrilla y cocínelo, volteándolo una vez, hasta que esté crujiente.", "Para el aderezo, coloque el jugo de limón, el estragón y el vinagre en una sartén no reactiva a fuego lento hasta que esté tibia. Retire la ramita de estragón.", "Coloque las yemas de huevo en un bol y mezcle ligeramente. Agregue la mezcla de limón y vinagre y continúe batiendo.", "Batiendo constantemente, agregue gradualmente la mantequilla clarificada, batiendo para emulsionar y crear una consistencia suelta de mayonesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque tres lanzas de espárragos en cada plato y sazón, para saborear con sal y pimienta negra recién molida.", "Coloque un huevo encima de los espárragos y coloque tres lonchas de tocino al costado.", "Coloque una cucharada del aderezo en cada huevo y polvo con pimentón ahumado."]}, {"isVegetarian": true, "title": "Cazuela de berenjena y frijoles", "url": "www_bbc_co_uk_food_recipes_aubergine_and_bean_82086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_bean_82086_16x9.jpg", "ingredients": ["1 cucharada de aceite vegetal", "2 cebollas, descuartizadas", "1 diente de ajo, aplastado", "250 g / 9 oz de champiñones castaños, reducido a la mitad", "2 berenjenas, cortadas en trozos grandes", "2 x 400 g / 14 oz pueden borlotti o judías verdes", "75g / 3oz de azúcar moreno", "1 cucharadita de pimentón ahumado", "100ml / 3½fl oz de caldo de verduras", "75 g / 3 oz de melaza", "2 cucharadas de ketchup de tomate", "1 cucharada de mostaza Dijon", "30ml / 1¼fl oz de vinagre de jerez", "1 cucharada de perejil fresco picado", "pan plano"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una sartén de base pesada. Freír las cebollas y el ajo a fuego medio durante cinco minutos o hasta que se doren y ablanden.", "Agregue los champiñones y las berenjenas y cocine durante 10 minutos.", "Agregue los frijoles borlotti, el azúcar mascabado, el pimentón, el caldo de verduras, la melaza, el ketchup de tomate, la mostaza, el vinagre de jerez y el perejil y deje que hierva. Cubra y cocine a fuego lento durante 45 minutos.", "Sirve con panes planos."]}, {"isVegetarian": true, "title": "Berenjena y mozzarella horneado", "url": "www_bbc_co_uk_food_recipes_aubergine_and_mozzarella_51464", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_mozzarella_51464_16x9.jpg", "ingredients": ["3 cucharadas de aceite de oliva", "1 cebolla, finamente picada", "3 dientes de ajo, aplastados", "2 x 400g / 14oz latas de tomates picados", "sal y pimienta", "2 berenjenas medianas a grandes", "1 bola de mozzarella, escurrida y rasgada en pedazos"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una cacerola a fuego medio. Agregue una cucharada de aceite de oliva y, una vez caliente, agregue la cebolla y una pizca de sal. Freír la cebolla durante 4-5 minutos, o hasta que se ablande. Agregue el ajo y continúe cocinando durante dos minutos.", "Vierta los tomates y mezcle bien, rompiendo cualquier trozo más grande con la parte posterior de la cuchara. Sazone con una pizca de sal y pimienta y cocine a fuego lento. Reduzca el fuego y cocine a fuego lento durante 20-30 minutos, o hasta que la salsa de tomate esté espesa y sabrosa.", "Mientras tanto, corte las berenjenas longitudinalmente en rodajas de 5 mm / ¼ de grosor. Cepille las rodajas de berenjena con aceite de oliva y sazone bien con sal y pimienta en ambos lados. Caliente la sartén de la plancha hasta que esté caliente y, a continuación, cocine en lotes durante 2 o 3 minutos en cada lado, o hasta que todas las rebanadas estén doradas. Alternativamente, caliente la parrilla a altura, coloque la mitad de las rodajas de berenjena en una bandeja para hornear y ase de 3 a 4 minutos por cada lado. Continúe con el resto de las rebanadas hasta que estén doradas. Retirar y dejar a un lado una vez cocinado.", "Agregue una cucharada de salsa de tomate al fondo de una fuente de horno de tamaño mediano (a unos 28x22cm / 11x8½ pulgadas) y distribuya uniformemente. Cubra con un tercio de las rodajas de berenjena.", "Siga con un tercio de la salsa de tomate restante y cubra con un tercio de la mozzarella. Repita el proceso para otras dos capas terminando con salsa de tomate y la mozzarella. Coloque en el horno precalentado y hornee durante 25-30 minutos, o hasta que el plato esté burbujeante y la mozzarella derretida y dorada en la parte superior."]}, {"isVegetarian": true, "title": "Canelones de berenjena y champiñones", "url": "www_bbc_co_uk_food_recipes_aubergine_and_mushroom_37196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 chalotes de plátano, toscamente picados", "aceite de oliva, para freír", "250 g / 9 oz de champiñones mezclados, limpios y finamente picados", "Crema doble de 60 ml / 2 fl oz", "1 berenjena, cortada longitudinalmente alrededor de 3 mm de grosor", "100g / 3½oz de queso azul", "6 tomates de ciruela", "3 cucharadas de vinagre de sidra de manzana", "1 cucharada de azúcar moreno", "2 dientes de ajo, finamente picados", "pizca de copos de chile", "1 cucharadita de puré de tomate", "1 manojo de cilantro, más o menos picado", "sal y pimienta recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sudor una chalota en un poco de aceite de oliva, luego agregue los champiñones y sazone. Freír durante unos minutos hasta que la humedad se libere de los champiñones. Agregue la crema y hierva a fuego lento hasta que espese.", "Seque las rodajas de berenjena a fuego medio hasta que estén suaves y chamuscadas.", "Precalentar la parrilla a su configuración más alta.", "Coloque un poco de la mezcla de champiñones en rodajas de berenjena y enrolle como canelones. Poner en un plato a prueba de horno, cubrir con queso azul y colocar debajo de una parrilla caliente hasta que se derrita.", "Ponga a hervir una olla de agua y vierta cuidadosamente los tomates. Retire después de 30 segundos, o cuando la piel se pela, y colóquelo en un recipiente con agua helada. Cuando esté frío, quítele la piel, saque las pepitas y pique la carne.", "En una olla pequeña, cocine a fuego lento el vinagre, el azúcar, el ajo y la chalota restante. Agregue un poco de sal y chile al gusto. Cuando esté cocido y almibarado, agregue el puré de tomate y los tomates frescos. Cocine a fuego lento durante unos minutos y luego agregue el cilantro.", "Para servir, coloca los canelones de berenjena entre dos platos y cúbrelos con la salsa de tomate."]}, {"isVegetarian": false, "title": "Caponata de berenjena y okra con panceta de cerdo a la brasa", "url": "www_bbc_co_uk_food_recipes_aubergine_and_okra_10739", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["botón de mantequilla", "aceite de oliva, para lloviznar", "1 cebolla grande, finamente picada", "8 dientes de ajo, finamente picados", "2 berenjenas medianas, cortadas en dados de 1cm / ¼ en dados", "10 okra coronado, cola y reducido a la mitad", "8g / ¼ oz de alcaparras", "2 cucharaditas de vinagre de vino tinto", "salpicaduras de vino tinto", "6 tomates de ciruela medianos, finamente picados", "80g / 3oz de aceitunas negras enteras, sin piedras", "sal y pimienta negra recién molida", "puñado de albahaca fresca y hojas de perejil, para servir", "4 rebanadas de panza de cerdo", "10g / 1 / 3oz semillas de hinojo", "aceite de oliva, para cocinar", "sal y pimienta negra recién molida", "150 g / 5½ oz de harina de arroz", "100 g / 3½ oz de harina de maíz", "800ml / 28fl oz de agua con gas", "salpicaduras de vinagre de sidra", "6 okras coronadas y con cola", "aceite vegetal, para freír"], "serves": "Sirve 2-4", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer la caponata, fríe con cuidado la cebolla y el ajo en una sartén pequeña con un poco de mantequilla y aceite de oliva. Cuando esté tierno y dorado, retírelo del fuego y déjelo a un lado.", "Mientras tanto, caliente un poco más del aceite en otra sartén y fría la berenjena hasta que se dore. Agregue la mitad de la quimbombó y ablande levemente. Agregue las alcaparras, las cebollas cocidas y el ajo, un chorro de aceite y el vinagre a la sartén y cocine a fuego lento durante un minuto o dos.", "Agregue los tomates y el vino y cocine a fuego lento durante unos 15 minutos. Sazonar con sal y pimienta, echar la albahaca y el perejil y cubrir con un poco de aceite de oliva para servir.", "Para hacer el vientre de cerdo a la brasa, sazone el cerdo con sal, pimienta y las semillas de hinojo. Calentar un chorrito de aceite de oliva en una sartén grande a fuego medio-alto y freír las rebanadas de pan de cerdo durante unos 5 minutos por cada lado o hasta que estén profundamente caramelizadas y cocidas. Descansa por 10 minutos.", "Para hacer la okra frita, llena una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con el aceite. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido", "Mezcle las harinas juntas en un recipiente y transfiera 30 g / 1 oz a otro recipiente. Agregue el agua con gas al recipiente principal y mezcle bien. Sumerja el quimbombó en la harina reservada, luego en la mezcla y fríalos hasta que estén crujientes y dorados. Escurrir sobre papel de cocina.", "Para servir, cuchara una caponata en cada plato y cubra con la panceta de cerdo y la okra frita."]}, {"isVegetarian": true, "title": "Caviar de berenjena y nuez", "url": "www_bbc_co_uk_food_recipes_aubergine_and_walnut_45265", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_walnut_45265_16x9.jpg", "ingredients": ["2 berenjenas grandes", "4 dientes de ajo, 2 rebanadas finas y 2 aplastadas", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "2 cucharadas de perejil finamente picado", "2 cucharadas de menta finamente picada", "50g / 1¾oz de nueces, finamente picadas", "blinis", "cCrea agria", "semillas de granada"], "serves": "", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Corta ranuras profundas en las berenjenas a intervalos regulares y en todos los lados. Rellene con el ajo en rodajas. Ponga en una bandeja de horno y tueste en el horno durante 45 - 60 minutos. Cuando las berenjenas estén listas, deben ser suaves, arrugadas y de color marrón / negro.", "Poner las berenjenas en un colador y dejar enfriar un poco. Cuando estén lo suficientemente fríos para manipularse, despegue la piel. Aprieta suavemente para eliminar la mayor cantidad de líquido posible. Picar las berenjenas finamente.", "Coloque las berenjenas en un recipiente y agregue todos los ingredientes restantes. Mezcle bien. Si desea una textura ligeramente más suave, puede usar una batidora o un procesador de alimentos.", "Sirva con blinis y crema agria, con algunas semillas de granada salpicadas."]}]