[{"isVegetarian": false, "title": "Herb and lemon-encrusted lamb with leeks and borlotti beans", "url": "www_bbc_co_uk_food_recipes_herbandlemonencruste_84877", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz ciabatta, roughly torn ", "40g/1½oz lemon rind, grated", "40g/1½oz capers, rinsed", "40g/1½oz anchovies", "40g/1½oz onions, roughly chopped", "40g/1½oz black olives, pitted and roughly chopped", "1 bunch fresh parsley", "1 bunch fresh basil", "2 x 4-bone racks of lamb, bones removed", "salt and freshly ground black pepper ", "1 tbsp olive oil", "3 tsp Dijon mustard", "50g/2oz butter", "2 large leeks, finely sliced", "400g/14oz can borlotti beans, rinsed and drained ", "1 small bunch fresh flatleaf parsley, leaves only", "salt and freshly ground black pepper ", "150ml/5fl oz red wine", "110ml/4fl oz chicken stock", "25g/1oz butter", "salt and freshly ground black pepper", "mashed potato"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas ½.", "For the herb crust, lay the ciabatta, lemon rind, capers, anchovies, onions and olives onto a baking sheet. Place into the oven for two hours to dry out.", "Transfer the dried mixture to a food processor, add the parsley and basil and blend until fine breadcrumbs form. Spread the mixture onto a large plate or clean tray.", "Turn the oven up to 180C/355F/Gas 4.", "Season the lamb with salt and freshly ground black pepper.", "Heat a frying pan until hot and add the olive oil. Add the lamb racks and fry on each side until browned.", "Remove from the pan and brush the lamb racks with mustard so that they are completely covered and then roll them in the herb crust to completely coat.", "Place the coated lamb racks into an ovenproof dish and transfer to the oven to bake for 12-14 minutes, until medium rare, or longer according to your taste. Turn the meat over halfway through. Remove from the oven and leave to rest.", "For leeks and beans, heat a frying pan until hot, then add the butter and leeks. Gently fry the leeks for 4-5 minutes until softened, but not browned.", "Add the beans and cook for a further 2-3 minutes.", "Add the parsley and season, to taste, with salt and freshly ground black pepper.", "For the red wine sauce, place the red wine into a shallow pan over a high heat and bring to the boil. Cook to reduce the wine by half, then add the chicken stock and continue boiling to reduce the liquid volume by half again.", "Add the butter, season with salt and freshly ground black pepper.", "To serve, place a spoonful of mashed potato onto each of four plates and place a spoonful of the leeks alongside. Slice the lamb in half and place on top of the leeks, then spoon the red wine sauce around."]}, {"isVegetarian": false, "title": "Herb and pepper chicken with roasted vine tomatoes", "url": "www_bbc_co_uk_food_recipes_herbandpepperchicken_89342", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast, cut in half lengthways", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley", "1 tbsp chopped fresh rosemary, leaves only", "1 tbsp olive oil", "85g/3oz cherry vine tomatoes, whole", "2 tbsp olive oil", "1 tbsp balsamic vinegar", "1 tsp caster sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, mix the seasoning and herbs in a bowl, and press the chicken pieces into the mixture, turning them until each piece is completely coated.", "Heat the oil in a frying pan over a medium heat. Add the chicken and fry for 8-10 minutes, turning halfway through cooking, until cooked through, golden-brown and crisp on both sides.", "For the tomatoes, place the tomatoes in a small, ovenproof frying pan. Drizzle the oil and vinegar over the tomatoes, and sprinkle them evenly with sugar. Place in the oven to roast for 5-10 minutes. ", "To serve, place the chicken on a plate with the balsamic tomatoes on the side."]}, {"isVegetarian": true, "title": "Herb and tomato couscous with green beans", "url": "www_bbc_co_uk_food_recipes_herbandtomatocouscou_85748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz couscous", "150ml/¼ pint hot vegetable stock", "2 tbsp olive oil", "250g/9oz green beans, trimmed, blanched and chopped", "2 tomatoes, seeds removed and chopped", "1 lemon, juice only", "2 tbsp chopped fresh flatleaf parsley", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the couscous into a heatproof bowl, pour over the hot stock and olive oil and cover with cling film. Leave to stand for five minutes.", "Add the beans, tomatoes, lemon juice and parsley to the couscous. Season, to taste, with salt and freshly ground black pepper and stir well.", "To serve, place the couscous onto serving plates."]}, {"isVegetarian": false, "title": "Herb broth with spicy pan-fried prawns", "url": "www_bbc_co_uk_food_recipes_herbbrothwithspicypa_83621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp turmeric powder", "1 tsp cardamom pods, split open", "1 tsp coriander seeds", "100ml/3½fl oz chicken stock", "100ml/3½fl oz double cream", "25g/1oz fresh coriander, chopped, to garnish", "1 tsp cayenne pepper", "1 tsp paprika", "1 tbsp olive oil", "½ lemon, juice only", "2 cardamom pods, split open, seeds removed", "3 large prawns, cut in half lengthways", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the herb broth, place the turmeric, cardamom and coriander seeds in a frying pan and dry fry for two minutes, to release the flavours.", "Add the chicken stock and double cream. Bring to the boil, then reduce the heat to simmer for five minutes.", "To make the prawns, place the cayenne, paprika, olive oil, lemon juice and cardamom seeds into a bowl and mix well.", "Add the prawns and leave to marinate for ten minutes.", "Heat a griddle pan until smoking. Add the prawns and chargrill for two minutes each side, or until cooked through, and season with salt and freshly ground black pepper.", "To serve, pour the broth into a warm bowl and serve the prawns on top."]}, {"isVegetarian": true, "title": "Herb butters", "url": "www_bbc_co_uk_food_recipes_herbbutters_8631", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz butter, softened", "6 leaves of sage, finely chopped", "1 eating apple, grated", "seasoning ", "200g/7oz butter", "handful each of common, lemon, and orange thyme leaves stripped from the stalks and finely chopped", "seasoning"], "serves": "Makes  2x200g/7oz rolls", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Make the sage and apple butter: mash all the ingredients together (you need to taste the sage before including it in the butter as its strength varies dramatically).", "Pack into an ice cube tray or lay on cling film and roll to make a neat sausage shape and chill or freeze until needed.", "Make the three thyme butter: mash all the ingredients together.", "Pack into an ice cube tray or lay on cling film and roll to make a neat sausage shape and chill or freeze until needed. "]}, {"isVegetarian": false, "title": "Herb-crumbed veal, potato rosti, chargrilled leeks, cabbage 'confit' and poached egg", "url": "www_bbc_co_uk_food_recipes_herbcrumbedvealpotat_80186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz breadcrumbs", "1 tbsp finely chopped fresh parsley ", "1 tbsp finely chopped fresh chives ", "2 free-range eggs, beaten", "150g/5½oz veal escalope", "100g/3½oz flour, seasoned with salt and freshly ground black pepper", "1 tbsp olive oil", "50g/1¾oz butter", "100g/3½oz new potatoes, grated", "1 tbsp olive oil", "½ red cabbage, shredded", "50ml/2fl oz red wine", "100g/3½oz caster sugar", "100ml/3½fl oz hot chicken stock", "1 free-range egg", "200ml/10fl oz boiling water", "25ml/1fl oz white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the herb-crumbed veal, place the herbs and breadcrumbs into a food processor and blend together, then place into a bowl. Place the beaten eggs in a separate bowl.", "Dredge the veal in seasoned flour and pat off any excess. Dip the veal in the beaten egg until coated all over, then dip again into the herbed breadcrumbs to coat.", "Repeat the egg and herb breadcrumb coating process.", "Heat the oil in a medium ovenproof frying pan over a medium heat. Add the breadcrumbed veal and fry for two minutes on each side, to brown all over.", "Transfer to the oven and roast for five minutes, or until the veal is cooked through. Remove from the oven and leave to rest.", "To make the potato rösti, heat half of the butter in a small frying pan over a medium heat. Add the grated potatoes, seasoning well with salt and freshly ground black pepper. Sauté, without turning, until golden.", "Add the other half of the butter to the pan and carefully turn over the rösti and cook the other side until golden.", "To make the cabbage, heat the oil in a large saucepan over a medium heat. Add the shredded cabbage and red wine and cook for three minutes. ", "Add the sugar and cook, stirring well, for two minutes.", "Add the chicken stock, bring to the boil and reduce the heat to a simmer. Simmer for 5-6 minutes, or until the cabbage has softened.", "To make the poached egg, place the water and vinegar in a saucepan and heat to maintain a gentle simmer. Swirl the water with a spoon to create a whirlpool effect. Gently add the egg and poach for three minutes, or until cooked to your liking. Remove with a slotted spoon and rinse with hot water.", "To serve, place the rösti in the centre of a warm plate, place the breadcrumbed veal on top. Serve some of the cabbage alongside and top with the poached egg."]}, {"isVegetarian": false, "title": "Herb-crusted beef with borlotti bean salad", "url": "www_bbc_co_uk_food_recipes_herbcrustedbeefwithb_85109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 100g/3½oz beef fillet", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp chopped fresh chervil", "1 tbsp chopped fresh parsley", "50g/1½oz fresh breadcrumbs", "1 tbsp olive oil", "½ lemon, zest and juice only", "75g/2¾oz tinned borlotti beans, drained", "handful fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the herb-crusted beef, rub the beef with a little of the oil and season well with salt and freshly ground black pepper.", "Place the herbs and breadcrumbs into a bowl and mix well, then coat the beef in the breadcrumb mixture.", "Heat the remaining oil in an ovenproof frying pan and fry the beef for 3-4 minutes on each side.", "Transfer the pan to the oven and cook for 4-5 minutes, or until golden-brown and cooked to your liking. Remove from the oven and allow to rest.", "For the borlotti bean salad, place the oil and lemon zest and juice into a bowl and mix well. Add the beans and parsley, mix well and season with salt and freshly ground black pepper.", "To serve, place the herb-crusted beef onto a plate with the salad alongside."]}, {"isVegetarian": false, "title": "Herb-crusted lamb cutlets", "url": "www_bbc_co_uk_food_recipes_herbcrustedlambcutle_86950", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 lamb cutlets, flattened with the base of a saucepan or meat tenderiser", "4 tbsp fresh breadcrumbs", "1 tbsp finely chopped fresh mint", "30g/1oz Wensleydale cheese with cranberries", "1 tbsp butter, softened", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "In a hot griddle pan, fry the lamb cutlets for 30 seconds on both sides, until browned.", "In a small bowl, mix the breadcrumbs, mint, Wensleydale cheese and butter together to make a rough paste. Season with salt and freshly ground black pepper.", "Carefully remove the lamb cutlets from the griddle pan and press the breadcrumb mixture onto the cutlets. ", "Transfer the lamb cutlets to a baking sheet and roast for five minutes, or until cooked to your liking.", "Set aside to rest for five minutes before serving."]}, {"isVegetarian": false, "title": "Herb-crusted plaice with Jersey Royal and spring green broth", "url": "www_bbc_co_uk_food_recipes_herbcrustedplaicewit_94023", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275g/10oz breadcrumbs", "110g/4oz fresh flatleaf parsley leaves ", "2 garlic cloves, peeled ", "4 tbsp olive oil ", "salt and white pepper", "110-150ml/4-5fl oz water", "4 fillets plaice, skin removed", "25g/1oz butter", "1 shallot, peeled, finely diced", "50g/1¾oz pancetta, finely diced", "200g/7¼oz Jersey Royal potatoes, finely diced", "100g/3½oz canned flageolet beans, drained and rinsed", "100g/3½oz spring greens, finely sliced", "150ml/5¼fl oz chicken stock", "50g/1¾oz butter", "2 tbsp chopped fresh chervil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the herb-crusted plaice, preheat the oven to 200C/400F/Gas 6.", "Blend the breadcrumbs, parsley and garlic in a food processor until the mixture resembles fine breadcrumbs.", "Add the olive oil and season, to taste, with salt and white pepper. Blend again until the mixture resembles a smooth paste, adding water as necessary.", "Place the mixture onto a large sheet of greaseproof paper, cover with another sheet of greaseproof paper and, using a rolling pin, roll the mixture out to the size of the four fillets. Set aside.", "Arrange a sheet of greaseproof paper on a baking tray and put the fish fillets on top. Cut the pressed mixture into rectangles to make a crust for each fillet. Top each fish fillet with the crust and bake for 8-10 minutes, or untilt the fish is cooked through.", "For the Jersey Royal potatoes and spring green broth, heat a large frying pan and add the butter. Once melted, add the ", "shallots and pancetta and fry for 2-3 minutes until the pancetta is crisp. ", "Add the potatoes and flageolet beans and cook for a further two minutes.", "Add the spring greens and stock and cook for 2-3 minutes, or until the volume of stock has reduced slightly. ", "Stir in the butter to thicken the sauce and sprinkle over the chervil.", "To serve, spoon the Jersey Royal and spring green broth onto each of four plates and place the fish on top."]}, {"isVegetarian": false, "title": "Herb-crusted lamb steak with aubergine, tomato and chickpea stew", "url": "www_bbc_co_uk_food_recipes_herbcrustedlambsteak_87004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice rye bread", "2 sprigs fresh thyme, chopped", "small handful fresh parsley, chopped", "salt and freshly ground black pepper", "175g/6oz lamb leg steak", "1 tbsp olive oil", "1 tbsp hummus", "2 tbsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "½ aubergine, cut into cubes", "200g/7oz canned cherry tomatoes, drained", "100g/3½oz canned chickpeas, drained", "handful fresh parsley, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the herb-crusted lamb steak, place the rye bread, thyme, parsley, salt and freshly ground black pepper into a small food processor and pulse until it forms crumbs. ", "Heat a griddle pan until hot. Rub the lamb steak in the olive oil, season with salt and freshly ground black pepper and place in the hot griddle pan. Fry the lamb on both sides for three minutes. Remove from the heat and set aside to rest for three minutes. ", "Spread the hummus on one side of the griddled lamb, press the herb crumb mixture on top and transfer the lamb steak to a non-stick baking sheet. Place in the oven for 4-5 minutes, or until the crust is golden-brown and the lamb is cooked to your liking. Remove from the oven and set aside to rest for 2-3 minutes before serving.", "To make the stew, heat one tablespoon of the olive oil in a medium-sized saucepan and add the onion. Sauté until softened but not coloured. ", "Add the garlic to the saucepan and sauté gently for a further one minute. ", "In a separate pan, heat the remaining one tablespoon of olive oil and add the aubergine. Fry for five minutes, or until golden-brown on all sides. ", "Add the aubergine to the onions and garlic, then add the drained cherry tomatoes and chickpeas and cook for a further three minutes. ", "Stir in the chopped parsley to the pan and season well with salt and freshly ground black pepper.", "To serve, spoon the stew onto a plate and top with the herb-crusted lamb steak."]}, {"isVegetarian": false, "title": "Herb-crusted rack of lamb", "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_71980", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/8oz ciabatta, roughly torn", "40g/2oz lemon rind, grated", "40g/2oz capers, rinsed", "40g/2oz anchovies", "40g/2oz onions, roughly chopped", "40g/2oz black olives, pitted and roughly chopped", "1 bunch parsley", "1 bunch basil", "2 racks of lamb (8 bones in each)", "vegetable oil for frying", "2 tsp Dijon Mustard", "50g/2oz pancetta strips", "2 artichokes, cut into wedges", "125g/5oz courgettes, cubed and sautéed", "50g/2oz fava beans, peeled, blanched for 1 minute, then plunged into cold water", "4 mint leaves", "200ml/7fl oz beef stock, boiled to reduce by half", "sea salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas 1.", "Make the herb crust. Lay the ciabatta, lemon rind, capers, anchovies, onions and olives on a baking sheet. Place them in the oven to dry out for two hours.", "Transfer the mixture to the bowl of a food processor fitted with the metal blade and whiz with the herbs until fine breadcrumbs form, about two minutes.", "Turn the oven up to 180c/355F/Gas 4. Season the lamb and then warm a large heavy based frying pan. Add enough oil to cover the base and seal the lamb on the side with the fat, about two minutes.", "Brush the lamb with mustard so that it is completely covered and then roll it in the herb crust. Place the meat in a shallow baking dish and bake in the oven until medium rare, about 12 minutes, turning halfway through.", "Remove from the oven and leave to rest.", "While the lamb is cooking, warm a frying pan and add the pancetta and then the artichoke wedges. Season well.", "Stir in the courgettes, fava beans and mint leaves and add a little warmed beef stock to bring the mixture together. Keep warm.", "To serve, cut the lamb rack into cutlets. On each plate arrange a few cutlets on a bed of the vegetable mixture. ", "Drizzle beef stock around the outside of each plate and serve."]}, {"isVegetarian": false, "title": "Herb-crusted pork fillet with apple and mustard Puy lentils", "url": "www_bbc_co_uk_food_recipes_herbcrustedporkfille_73665", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz pork fillet (tenderloin)", "1 tbsp fresh thyme, finely chopped", "1 tbsp fresh rosemary, finely chopped", "1 tbsp fresh oregano, finely chopped", "2 cloves garlic, finely chopped", "2 tbsp olive oil", "1 tsp honey", "50g/2oz butter", "1 red onion, finely chopped", "1 eating apple, peeled and finely chopped", "100g/3½oz Puy lentils, freshly cooked ", "150ml/5fl oz farmhouse cider", "1 tbsp honey", "1 tbsp wholegrain mustard", "1 tbsp flatleaf parsley", "25g/1oz  butter", "200g/7oz creamy, well-seasoned mashed potato, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "To make the herb crust, mix together the herbs, garlic, olive oil and honey. Roll the pork fillet in the mixture to coat well.", "Heat a pan until it's red-hot. Add the herb-crusted pork and sear for one minute on each side. Transfer to the oven and cook for a further ten minutes. Remove the pork and leave to rest for at least five minutes before serving.  ", "In a clean pan, heat the butter until it foams. Add the onion and apple and cook them together for two minutes. Add the lentils and cider, and give them a few seconds of cooking time before you add the honey and mustard. Let the lentils warm for 2-3 minutes, then season and add the parsley. The idea is to leave enough 'cidery' liquid in the lentils to provide a sauce.", "At the last minute, stir in the butter to thicken the sauce.", "Carve the pork into 1cm (0.5in) thick chunks. Lay the pork slices onto the mash and spoon the lentils and liquor all around."]}, {"isVegetarian": false, "title": "Herb-crusted rack of lamb with roast butternut squash with lemon and mustard", "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_73595", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7¼oz ciabatta, roughly torn ", "40g/1½oz lemon rind, grated", "40g/1½oz capers, rinsed", "40g/1½oz anchovies", "40g/1½oz onions, roughly chopped", "40g/1½oz black olives, pitted and roughly chopped", "1 bunch parsley", "1 bunch basil", "2 racks of lamb, 8 bones in each", "vegetable oil, for frying", "2 tsp Dijon mustard", "sea salt and freshly ground black pepper", "2 butternut squash (about 650g/1lb 7oz each)", "2 garlic cloves, crushed", "2 lemons, zest and juice only", "1 tbsp olive oil", "100g/3½oz butter, 70g/2½oz melted and the rest chilled", "1 sprig fresh thyme, leaves only", "2-3 tbsp course-grained mustard", "5 tbsp double cream", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Firstly, make the herb crust. Preheat the oven to 120/C248F/Gas 1. Lay the ciabatta, lemon rind, capers, anchovies, onions and olives on a baking sheet, and place them in the oven to dry out for two hours.", "Transfer the mixture to the bowl of a food processor fitted with a metal blade and blend until fine breadcrumbs form (about two minutes).", "Preheat the oven to 180C/356F/Gas 4. Season the lamb and then warm a large heavy-based frying pan. Add enough oil to cover the base and seal the lamb on each side with the fat (about two minutes).", "Brush the lamb with mustard so that it is completely covered and then roll it in the herb crust. Place the meat in a shallow baking dish and bake in the oven until medium rare, about 12 minutes, turning halfway through.", "Remove from the oven and leave to rest.", "For the butternut squash, heat the oven to 190C/375F/Gas 5. Cut the squash in half, scoop out the seeds, then peel and chop the flesh into even-sized chunks. Place in a bowl and add the garlic, lemon zest and juice, olive oil and half the melted butter.", "Toss the ingredients together then spread out in a roasting pan. Scatter over the thyme leaves and roast in the oven for about 20 minutes, until the squash feels tender when pierced with the tip of a knife.", "Scoop the roasted squash into a food processor or blender with the remaining butter, mustard, cream and seasoning. Blend to a smooth purée and serve.", "To serve, cut the lamb racks into cutlets. On each plate, arrange a few cutlets on a bed of butternut squash mixture."]}, {"isVegetarian": false, "title": "Herb-crusted rack of lamb", "url": "www_bbc_co_uk_food_recipes_herbcrustedrackoflam_81034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/8oz ciabatta, roughly torn ", "40g/2oz lemon zest ", "40g/2oz capers, rinsed", "40g/2oz anchovies", "½ onion, roughly chopped", "40g/2oz black olives, pitted and roughly chopped", "1 bunch parsley", "1 bunch basil", "2 racks of lamb (8 bones in each)", "vegetable oil for frying", "2 tsp Dijon mustard", "200ml/7fl oz beef stock", "red wine ", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 130C/250F/Gas 1.", "To make the herb crust, lay the ciabatta, lemon zest, capers, anchovies, onions and olives on a baking sheet. Place them in the oven to dry out for 1½ hours.", "Transfer the mixture to the bowl of a food processor fitted with the metal blade and blend with the basil and parsley until fine breadcrumbs form (about two minutes).", "Turn the oven up to 210C/410F/Gas 7-8. Heat a large heavy based frying pan, and sear the lamb on all sides until brown, starting on the side with the fat.", "Brush the fat side of the lamb with mustard so that it is well covered and then roll it in the breadcrumb mixture to form the herb crust. Place the meat in a shallow roasting dish and bake in the oven until medium rare, about 15-20 minutes.", "Remove from the oven and leave the meat to rest. Add the beef stock and a splash of red wine to the roasting tin to deglaze it and create a sauce. Season to taste with salt and freshly ground black pepper.", "To serve, cut the lamb rack into cutlets. ", "Drizzle the sauce around the outside of each plate and serve."]}, {"isVegetarian": false, "title": "Herb-crusted red snapper with pan-fried ackee and tomato and okra chutney", "url": "www_bbc_co_uk_food_recipes_herbcrustedredsnappe_85773", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red snapper fillet, skinned", "55g/2oz cashew nuts", "small handful fresh flatleaf parsley", "small piece fresh coconut, flesh only", "1 tbsp vegetable oil", "salt and freshly ground black pepper ", "1 tbsp Dijon mustard", "1 tbsp vegetable oil", "¼ onion, chopped", "1 garlic clove, chopped", "150g/5½oz canned ackee, drained", "salt and freshly ground black pepper ", "1 tsp vegetable oil", "55g/2oz okra, sliced lengthways", "1 tbsp tomato purée", "2 tbsp white wine", "2 tbsp white wine vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the herb-crusted red snapper, place the snapper fillet onto a non-stick baking sheet.", "Place the cashews, parsley, coconut and vegetable oil in a food processor and pulse to combine. Season with salt and freshly ground black pepper.", "Spread the mustard over the fish and press the crust mixture on top.", "Transfer to the oven and bake for 8-10 minutes, or until the crust is golden-brown and the fish is cooked through.", "For the pan-fried ackee, heat the vegetable oil in a pan over a medium heat, add the onion and fry until soft. Add the garlic and ackee and fry until crisp. Season, to taste, with salt and freshly ground black pepper.", "For the chutney, heat the oil in a pan over a medium heat, add the okra, tomato purée, wine and vinegar and simmer until the liquid is reduced by half and the the okra is tender.", "To serve, spoon the chutney into the centre of a plate and top with the fried ackee and the red snapper."]}, {"isVegetarian": false, "title": "Herb-crust salmon with butter beans", "url": "www_bbc_co_uk_food_recipes_herbcrustedsalmonwit_79945", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz chopped mixed fresh herbs (rosemary, chervil, basil)", "75g/2¾oz fresh breadcrumbs ", "55g/2oz butter, melted ", "150g/5½oz fresh salmon fillet or steak", "1 tbsp olive oil ", "1 tbsp olive oil ", "1 garlic clove, chopped", "100g/3½oz tinned butter beans, rinsed and drained", "50ml whole milk", "1 tbsp chopped fresh parsley", "1 tbsp olive oil ", "1 garlic clove, chopped ", "pinch chilli flakes", "150g/5½oz spinach"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the chopped fresh herbs, breadcrumbs and butter into a food processor and pulse to mix.", "Heat a small frying pan. Add the oil and the salmon and cook for two minutes on each side to brown. Remove from the heat and spoon over the herb mixture.", "Transfer the salmon to the oven and bake for five minutes.", "For the butter beans, place the oil in a pan over a medium heat. Add the garlic and sauté for two minutes.", "Add the butter beans and the milk, bring to the boil and reduce the heat to simmer for four minutes. Blend with a hand blender until smooth and add the parsley.", "For the spinach, heat the oil in a pan. Add the garlic and chilli flakes and fry for one minute. ", "Add the spinach and cook for one minute, until wilted down.", "To serve, place the wilted spinach in the centre of a plate and top with the herb-crusted salmon with the butterbean purée on the side."]}, {"isVegetarian": false, "title": "Herb crusted salmon with sautéed garlic potatoes", "url": "www_bbc_co_uk_food_recipes_herbcrustedsalmonwit_84490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾ oz fresh breadcrumbs", "1 tsp each chopped chervil, dill, parsley", "salt and freshly ground black pepper", "1 garlic clove, chopped", "1x110g/4oz thin salmon fillet, skin on", "1 free-range egg, beaten", "1 tbsp olive oil", "1 tbsp olive oil", "3 garlic cloves, chopped", "2 sprigs rosemary, leaves picked", "1 small potato, peeled, sliced and boiled for 5 minutes"], "serves": "Serves 1", "time": {"preparation": "", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the salmon, place the breadcrumbs, herbs, garlic and salt and freshly ground black pepper into a bowl and mix together. ", "Dip the salmon into the beaten egg and then dip into the breadcrumb mixture.", "Heat the oil in a frying pan over a high heat and fry the salmon on both sides for 2-3 minutes or until golden brown and cooked through.", "For the sautéed potatoes, in a separate frying pan, heat the olive oil over a medium heat. Add the garlic, rosemary and potato slices and sauté for five minutes until golden.", "To serve, place the sautéed potatoes onto a serving plate and place the salmon on top."]}, {"isVegetarian": false, "title": "Herb-crust pork with garlic mushrooms", "url": "www_bbc_co_uk_food_recipes_herbcrustporkwithgar_84315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz pork loin, batted out flat with a meat mallet or rolling pin.", "1 tbsp fresh parsley, chopped", "1 tbsp fresh chives, chopped", "1 tbsp fresh coriander, chopped", "100g/3½oz white breadcrumbs", "50g/1¾oz flour, seasoned with salt and freshly ground black pepper", "2 whole free-range eggs, beaten", "2 tbsp olive oil", "1 tbsp olive oil", "25g/1oz unsalted butter", "1 clove garlic, finely chopped", "frac12;onion, finely chopped", "100g/3½oz chestnut mushrooms", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pork, place the fresh herbs and breadcrumbs into a bowl and mix together.", "Place the flour into a bowl and dredge the pork loin in the flour. Dip the floured pork loin into the eggs then roll in the herbed breadcrumb mixture to coat.", "Dip into the egg and herbed breadcrumbs once more.", "Heat the oil in an ovenproof frying pan over a high heat. Add the pork and fry for two minutes on each side until crisp and golden. Transfer into the oven and roast for five minutes, or until completely cooked through.", "For the mushrooms, heat the oil and butter in a saucepan over a medium heat. Add the garlic and onion and fry until soft.", "Add the mushrooms and cook until soft, then season, to taste, with salt and freshly ground black pepper.", "To serve, arrange the mushrooms onto the middle of a serving plate and place the pork on top."]}, {"isVegetarian": false, "title": "Herbed leg of lamb", "url": "www_bbc_co_uk_food_recipes_herbed_leg_of_lamb_63592", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbed_leg_of_lamb_63592_16x9.jpg", "ingredients": ["1 x 2kg/4lb 8oz leg of lamb ", "small bunch oregano, leaves picked ", "1 tbsp rosemary leaves ", "4 garlic cloves, halved ", "1 lemon, zest and juice ", "1 orange, zest and juice ", "2 tbsp olive oil ", "2 tsp sea salt flakes "], "serves": "Serves 6–8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Sit the lamb in a large roasting tin, skin-side up, and use the tip of a sharp knife to make many incisions all over the skin. ", "Put the oregano, rosemary, garlic, lemon and orange zest, 2 tablespoons of lemon juice, 2 tablespoons orange juice, olive oil and salt in a bowl and blend using a stick blender (alternatively, use a small food processor). Spoon this over the lamb and rub in well. Leave at room temperature for 45 minutes. ", "Pour ½cm freshly boiled water into the bottom of the roasting tin and roast for 1 hour 40 minutes. Check after an hour to add more water if needed and cover with foil if the meat is beginning to catch. Just before the time is up, remove the lamb from the oven and check it is done to your liking, either using a probe and the temperatures listed in the tips below or piercing with a knife and taking a peek. ", "Remove the cooked lamb from the oven, cover loosely with foil, and rest for 15–30 minutes, checking every now and again, before transferring to a board to carve. "]}, {"isVegetarian": false, "title": "Herbed venison cutlets with skordalia and beetroot and jalapeno relish", "url": "www_bbc_co_uk_food_recipes_herbed_venison_cutlets_61572", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tsp olive oil ", "4 small beetroot, cooked, peeled and roughly chopped", "1 small shallot, roughly chopped ", "1 jalapeno pepper, roughly chopped", "2 stalks flatleaf parsley, roughly chopped ", "2 stalks coriander, roughly chopped ", "50g/1¾oz shelled walnuts, roughly chopped", "2 tsp sherry vinegar", "2 tsp caster sugar", "250g/9oz potatoes, peeled", "2 garlic cloves, peeled          ", "100ml/3½fl oz milk", "100ml/3½fl oz olive oil ", "salt and white pepper ", "1 lemon, juice only ", "handful flatleaf parsley, roughly chopped", "100g/3½oz plain flour", "salt and freshly ground black pepper", "200g/7oz fine dried breadcrumbs", "small handful chopped tarragon, flatleaf parsley, sage and chervil", "2 free-range eggs, beaten with a little milk", "12 venison cutlets (from the centre of the rack) ", "vegetable oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the relish, heat the oil in a frying pan and cook the chopped ingredients over a low heat for 15 minutes. Add the sherry vinegar and sugar and cook for a few minutes until glossy. Add 50ml/2fl oz water and continue to cook until the vegetables are tender. ", "Transfer to a food processor and blend to a smooth purée. Set aside until ready to serve.", "For the skordalia, place the potatoes in a heavy-based pan with the garlic, milk and olive oil, and season to taste with salt and pepper. Place over a medium heat, bring to the boil and cook for 15-20 minutes, or until the potatoes are soft. ", "Remove from the heat and drain the potatoes, reserving the cooking liquor. Place the potatoes in a food processor and blend with the lemon juice and half of the cooking liquid. Return to the saucepan and fold in the parsley. ", "For the venison cutlets, put the flour in a bowl and season generously with salt and pepper. Spread the breadcrumbs on a plate and mix in the chopped herbs. ", "Place the beaten egg in a shallow bowl. Place the flour, beaten egg and breadcrumbs in a line ready for coating the cutlets. Roll the venison cutlets in the flour (including the bone), dip in the egg and coat with the breadcrumbs. Make sure the cutlets are evenly coated all over and the crumbs patted down (to help them stick to the cutlets). ", "Preheat the oven to 150C/300F/Gas 2. ", "Set a large heavy-based pan over a medium heat. Add two tablespoons of oil and, once the oil is hot, add the cutlets (you should fit six in a pan, but cook in smaller batches if necessary). Fry for 2-3 minutes each side, or until golden-brown and cooked to your liking. Once cooked place in the oven to keep warm while you cook the remaining cutlets. ", "To serve, reheat the skordalia and, when warm, divide among serving plates. Place three cutlets on top and serve with a quenelle of relish."]}, {"isVegetarian": false, "title": "Herbed orange couscous, seared lamb and chilli honey glaze", "url": "www_bbc_co_uk_food_recipes_herbedorangecouscous_89355", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz couscous", "250ml/9fl oz hot chicken stock", "1 orange, zest and juice only", "1 tsp coriander seeds, crushed", "25g/1oz raisins", "freshly ground black pepper", "2 tbsp chopped fresh mint", "1 tbsp chopped fresh tarragon", "4 spring onions, sliced", "¼ red pepper, chopped", "1 lime, juice only", "150g/5½oz lamb fillet", "3 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp honey", "½ tsp chilli flakes", "1 orange, juice only", "1 vanilla pod, seeds only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the couscous, place the couscous into a large bowl with the stock, orange zest, coriander seeds, raisins and black pepper. Cover with a plate and leave for five minutes.", "Fluff the couscous with a fork, then add the orange juice and stir. Add the mint, tarragon, spring onions, red pepper and lime juice, and fluff again with a fork to combine. ", "For the lamb, rub the meat with a tablespoon of the oil and season with the salt and pepper. ", "Heat the remaining oil over a medium heat in an ovenproof frying pan. Add the lamb and cook until it is browned on all sides. ", "Drizzle the lamb with the honey and sprinkle it with the chilli flakes, then put it into the oven to roast for 7-8 minutes. Remove from the oven, set the lamb aside to rest, and retain the juices in the pan.", "Squeeze the orange juice into the same frying pan, then add the vanilla seeds. Simmer the juice over a medium heat for 3-4 minutes, until it has reduced and thickened slightly, to form a glaze.", "To serve, spoon a helping of the couscous onto a serving plate. Cut the lamb into three slices, and place it on top of the couscous. Drizzle with the honey chilli glaze."]}, {"isVegetarian": false, "title": "Herbed tuna carpaccio with pickled cucumber and bean salad", "url": "www_bbc_co_uk_food_recipes_herbedtunacarpacciow_89241", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbedtunacarpacciow_89241_16x9.jpg", "ingredients": ["500g/1lb 2oz very fresh tuna loin, trimmed", "1 lime, juice only", "4 tbsp roughly chopped flatleaf parsley", "4 tbsp roughly chopped chervil", "4 tbsp roughly chopped chives", "4 tbsp roughly chopped dill", "1 cucumber, halved lengthways, seeds removed, finely sliced", "150ml/5fl oz rice wine vinegar", "2 tbsp caster sugar", "1 red chilli, seeded and finely sliced", "1 red onion, finely sliced", "½ x 400g/7oz canned mixed beans, such as borlotti beans, butter beans and cannellini, rinsed and drained", "2 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper", "50g/2oz mizuna leaves, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Rub the tuna with the lime juice.", "Mix the herbs together and place onto a sheet of cling film on a flat surface.", "Place the tuna on top and roll in the herbs, to cover completely.", "Roll the cling film up tightly around the herb-coated tuna to form a tight cylinder, twisting the ends to seal. Place into the freezer for two hours.", "For the salad, place the cucumber into a frying pan and place over a low heat. Warm the cucumber until the excess water evaporates.", "Add the vinegar, sugar and chilli and bring to a simmer, then remove from the heat.", "Place the onion into a bowl and pour the cucumber mixture over the top. Stir well, then set aside to cool.", "When the cucumber and onion mixture is cool, add the beans and parsley and mix well to combine. Season, to taste, with salt and freshly ground black pepper.", "To serve, remove the tuna from the freezer. Using a sharp knife, slice the tuna very thinly and place onto a serving plate in a circle.", "Place some mizuna leaves into the centre (if using) and top with a spoonful of the cucumber and bean salad. "]}, {"isVegetarian": true, "title": "Herbed roasted sprouts", "url": "www_bbc_co_uk_food_recipes_herbedroastedsprouts_88180", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz Brussels sprouts, trimmed", "2 tbsp olive oil", "2 sprigs fresh rosemary, chopped", "3 sprigs fresh thyme, chopped", "2 garlic cloves, roughly chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Boil the sprouts in salted water for about 3-4 minutes, then drain.", "Heat the oil in an ovenproof frying pan and fry the sprouts along with the herbs and garlic for 1-2 minutes. Transfer the pan to the oven and continue to cook for 10-12 minutes, or until the sprouts are tender.", "Serve in a gratin dish."]}, {"isVegetarian": false, "title": "Herb fritters with crisp trout, soy and lemon dipping sauce", "url": "www_bbc_co_uk_food_recipes_herbfritterswithcris_89974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp cornflour", "100g/3½oz plain flour", "1 free-range egg", "sparkling water, to bind", "vegetable oil, for deep frying", "3 sprigs fresh parsley ", "3 sprigs fresh coriander", "1 tbsp olive oil", "1 tbsp butter", "85g/3oz sea trout", "salt and freshly ground black pepper", "3 tbsp soy sauce", "½ lemon, juice only", "1 tbsp sesame oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritters, combine the cornflour, flour and egg in a bowl and add enough sparkling water to make a light batter the consistency of double cream. ", "Heat the oil in a deep heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip the sprigs of parsley and coriander in the batter and deep fry in the oil for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper.", "For the crisp trout, heat the olive oil and butter in a frying pan and season the fish with salt and freshly ground black pepper. Fry the fish for 2-3 minutes on both sides, or until golden-brown and cooked through.", "For the dipping sauce, combine all of the dipping sauce ingredients in a small serving bowl. ", "Place the trout on a serving plate and arrange the herb fritters alongside. Serve with the dipping sauce to the side."]}, {"isVegetarian": false, "title": "Herb-roasted chicken thighs with ratatouille and olive and red wine sauce", "url": "www_bbc_co_uk_food_recipes_herbroastedchickenth_88810", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 boneless chicken thighs", "1 tbsp chopped fresh thyme", "1 tbsp chopped fresh parsley ", "salt and freshly ground black pepper", "½ onion, finely chopped", "1 clove garlic, crushed", "1 tbsp olive oil", "½ courgette, chopped", "½ aubergine, chopped", "1 vine tomato, de-seeded and chopped", "1 tbsp tomato purée", "50ml/2fl oz hot water", "25g/1oz pitted black olives, chopped", "6 fresh basil leaves, torn", "200ml/7fl oz red wine", "½ chicken stock cube", "50ml/2fl oz hot water", "25g/1oz pitted black olives, halved"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the chicken, lightly oil the chicken thighs with one tablespoon of the oil, then roll in the chopped herbs to coat. Season well with salt and freshly ground black pepper. ", "Heat the remaining oil in an ovenproof frying pan and place the chicken in skin-side down. Press down on the chicken with a spatula and fry for 4-5 minutes, or until the skin is crisp. Turn over and fry for another 3-4 minutes, then transfer to the oven to roast for 8-10 minutes, or until the chicken is cooked through. The juices should run clear when the chicken is pierced at its thickest point.", "For the ratatouille, in a another pan gently fry the onion and garlic in the oil over a medium heat until softened, about 3-4 minutes. Add the courgette and aubergine and fry until they start to take on some colour, about five minutes. Stir in the chopped tomato, tomato purée, water and olives. Reduce the heat and simmer for 2-3 minutes before stirring through the fresh basil.", "For the olive and red wine sauce, bring the wine in a pan to the boil and crumble in the stock cube, stirring until the cube has dissolved. Add the hot water, then reduce the heat and simmer for 4-5 minutes before stirring in the olives.", "To serve, place the chicken thighs on a serving plate and spoon the ratatouille on the side. Drizzle the olive red wine sauce around the edge of the plate and serve."]}]