[{"ingredients": ["Crema doble 600ml / 20fl oz", "150 g / 5½ oz de azúcar en polvo", "2 limones grandes, cáscara y jugo solamente", "4 claras de huevo de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "150g / 5½oz de azúcar moreno claro y suave", "150 g / 5½ oz de mantequilla ablandada, más extra para engrasar", "Jarabe de oro de 250 g / 9 oz", "75g / 2½ oz de melaza negra", "125g / 4½oz de copos de avena", "Harina de 175g / 6oz de auto crianza", "3 cucharadas de jengibre molido", "1 cucharadita de nuez moscada molida", "1 cucharadita de polvo de especias mezclado", "pizca de sal", "2 huevos de gallinas camperas, golpeados", "25 ml / 1 fl oz de leche", "4 ramitas de bálsamo de limón fresco", "4 cucharadas de sorbete de limón listo (opcional)"], "method": ["Para el posset de limón, lentamente lleve la crema doble y el azúcar a ebullición en una cacerola grande a fuego lento, revolviendo bien para disolver el azúcar en la crema. Hervir durante 3 minutos, luego retirar del fuego y reservar para enfriar.", "Una vez que la mezcla de crema se haya enfriado, mezcle el jugo y la ralladura de limón. Vierta la mezcla pospuesta en 6 tazones para servir de vidrio y deje enfriar en la nevera durante al menos 3 horas.", "Para los fragmentos de merengue, precaliente el horno a 65C / 50C Fan / Gas ¼ (o al ajuste más bajo en su horno). Alinee una bandeja para hornear con una estera de silicona o una hoja de pergamino para hornear.", "Batir las claras de huevo en un recipiente limpio hasta que se formen picos rígidos cuando se quite el batidor. Poco a poco bata el azúcar un poco a la vez, hasta que la mezcla de merengue esté brillante.", "Extiende el merengue en una capa delgada y uniforme en toda la bandeja de horno con una espátula. Hornee en el horno durante 3-4 horas o hasta que se seque completamente (esto tomará menos tiempo si la temperatura de su horno es más alta que la sugerida anteriormente).", "Dobla la estera de silicona o el papel de revestimiento para romper el merengue en fragmentos. Retire los fragmentos de merengue de la estera de silicona con una espátula y déjelos enfriar.", "Para el pan de jengibre jamaicano, aumente la temperatura del horno a 140 ° C / 120 ° C Ventilador / Gas 1. Engrase una lata de pastel de 30x20 cm en mantequilla.", "Derrita el azúcar, la mantequilla, el jarabe y la melaza en una cacerola pequeña a fuego lento, revolviendo bien para combinar.", "En un tazón, mezcle la avena, la harina, el jengibre, la nuez moscada, la mezcla de especias y la sal hasta que estén bien combinados. Agregue los huevos y la leche, vierta sobre la mezcla de sirope derretido, luego mezcle lentamente hasta que esté bien combinado.", "Vierta la mezcla de pan de jengibre en la lata de pastel preparada y hornee durante 1 ¼ horas, o hasta que un pincho insertado en el centro de la torta salga limpio.", "Para servir, desmorona un poco del pan de jengibre en la parte superior de cada posset, luego adornar con una ramita de bálsamo de limón. Coloque los platos de servir en platos pequeños. Decora las placas con los fragmentos de merengue y unas rodajas finas del pan de jengibre restante. Coloque una cucharada de sorbete de limón al lado, si lo desea."], "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_89572", "title": "Posset de limón con fragmentos de merengue y pan de jengibre de Jamaica", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble 600ml / 20fl oz", "150 g / 5½ oz de azúcar en polvo", "2 limones grandes, ralladura y jugo", "8 fresas maduras", "2 higos frescos maduros, cortados en cuñas", "1 puñado de pequeñas ramitas de menta fresca, para adornar", "Harina normal 175g / 6oz", "90g / 3¼ oz de azúcar glas", "60 g / 2½ oz de almendras molidas", "25g / 1 oz de harina de maíz", "250g / 9oz de mantequilla fría, cortada en cubos", "200 g / 7 oz de mermelada de fresa"], "method": ["Para el posset, llevar la crema y el azúcar a ebullición en una cacerola. Retire la sartén del fuego, luego mezcle la ralladura de limón y el jugo, y agregue la mayor cantidad posible de aire a la mezcla.", "Vierta la mezcla pospuesta en moldes y enfríe en la nevera durante 1 hora o hasta que se endurezca. Una vez establecido, decorar las tapas con fresas, higos y ramitas de menta.", "Para las galletas de mantequilla, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Mezcle la harina común, azúcar glas, almendras molidas y harina de maíz en un bol. Frote la mantequilla en los ingredientes secos hasta que la mezcla se asemeje a pan rallado, luego suavemente junte la mezcla como una masa.", "Divida la masa en 24 bolas pequeñas del mismo tamaño y presione una en cada pocillo de un molde de pastel de hadas de silicona de 24 hoyos (o dos de 12 hoyos). Alternativamente, extienda la masa a aproximadamente 1 cm / ½ pulgadas de espesor y use un pequeño cortador de galletas para cortar las formas.", "Hornee las tortas en el horno durante 10-12 minutos, o hasta que estén pálidas doradas.", "Mientras hornean las tortas, hierva el mermelada en una cacerola con 50 ml / 2 fl oz de agua. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos, o hasta que la mezcla se asemeje a un jarabe espeso.", "Retire las galletas dulces del horno y, cuando estén lo suficientemente frías como para manipularlas pero aún maleables, haga una pequeña abolladura en el centro de cada una con su dedo.", "Con una cuchara ponga el jarabe de fresa caliente en la abolladura de cada shortbread, luego quítelos de los moldes y déjelos a un lado para que se enfríen en una rejilla de alambre. Sirva el shortbread junto con los possets de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_posset_with_grans_18007", "title": "Postre de limón con mantecada de gran", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "100 g / 3½ oz de mantequilla muy fría, cortada en cubos pequeños, más extra para engrasar", "60 g / 2¼ oz de almendras molidas", "60g / 2¼ oz de azúcar glas, cernida", "½ limón, solo ralladura", "pizca de sal", "1 yema de huevo grande de gallinas camperas", "1 cucharadita de extracto de vainilla", "300g / 10½oz de queso ricotta", "100g / 3½ oz de mascarpone", "100 ml / 3½ fl oz crema", "½ limón, solo ralladura", "3 cucharadas de jugo de limón", "5 cucharadas de miel líquida", "6 huevos grandes de gallinas camperas, separados", "150 g / 5½ oz de piñones", "azúcar en polvo, para quitar el polvo", "200g / 7oz de crema fresca"], "method": ["Para hacer la masa, frote la mantequilla en la harina hasta que la mezcla se vea como pan rallado. Mezcle las almendras molidas, el azúcar glas, la ralladura de limón y la sal.", "Haga un pozo en el centro e incorpore 3 cucharadas de agua helada un poco a la vez, amasando suavemente. Justo cuando la masa comienza a juntarse, mezcle la yema de huevo y el extracto de vainilla.", "Coloque la mezcla sobre una superficie de trabajo limpia y amasar ligeramente hasta que se forme una bola. Presiona en un círculo plano, envuelve la película adhesiva y refrigera por 30 minutos.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase un pastel de 20 cm / 8 pulgadas o una lata de tarta, aproximadamente 4 cm / 1½ pulgadas de profundidad, y espolvoree con harina.", "Polvore una superficie de trabajo limpia con harina y extienda la masa en un círculo de aproximadamente 5 mm / ¼ de grosor. Presione la masa en la lata, concentrándose en los lados. Recorte la mayor parte del exceso de masa, dejando algo alrededor del borde para permitir el encogimiento. Refrigere por 10-15 minutos.", "Pinche la base de la masa con un tenedor, alinee el papel con grasa y vierta los frijoles para hornear. Hornee por 15 minutos, quite el papel y los frijoles a prueba de grasa y cocine por otros 5 minutos hasta que estén ligeramente dorados. Recorte cualquier exceso de masa y déjelo a un lado en una rejilla para enfriar cables.", "Mientras tanto, haz el relleno. En un tazón grande, bata la ricotta, el mascarpone, la crema, el jugo de limón y la ralladura, la miel y las yemas de huevo hasta que estén suaves.", "En otro recipiente, bata las claras de huevo hasta que se formen picos. Dobla las claras de huevo en la mezcla de ricotta una cucharada a la vez.", "Vierta la mezcla en la caja de repostería y espolvoree sobre los piñones. Cocine por 30-35 minutos, o hasta que se asiente un poco a los lados, pero aún tambaleante en el medio. Dejar enfriar sobre una rejilla de alambre durante al menos una hora.", "Polvo con azúcar glas y servir en rebanadas generosas con una cucharada de crème fraîche."], "url": "www_bbc_co_uk_food_recipes_lemon_ricotta_and_pine_38427", "title": "Tarta de limón, ricotta y piñones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.375kg / 3lb 1 oz de harina de auto aumento", "200 g / 7 oz de azúcar en polvo", "550g / 1lb 4oz de leche desmenuzada", "5 limones, solo ralladura", "aproximadamente 700ml / 1¼ de pinta de agua", "375 g / 13 oz de cuajada de limón", "50ml / 2fl oz de leche entera"], "method": ["Precalentar el horno a 200C / 400F / Gas mark 6.", "Coloque la ralladura de harina, azúcar, sebo y limón en un tazón grande y mezcle bien.", "Haga un pozo en el centro de la mezcla y agregue gradualmente suficiente agua para hacer una masa suave. Amasar ligeramente hasta que quede suave y dividir en cinco porciones.", "Ruede cada porción de masa sobre una superficie enharinada en un rectángulo de aproximadamente 1 cm / ½ pulgada de grosor. Extienda la masa de limón sobre la masa dejando un borde de 1cm / ½ pulgada.", "Enrolle desde el lado corto en un molinete, selle bien los extremos con un poco de agua y colóquelos en las bandejas para hornear engrasadas. Cepilla con la leche.", "Coloque en el horno durante 35-40 minutos, o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_lemon_roly-poly_72099", "title": "Limón roly-poly", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 solomillos de limón pequeños, cortados y lavados", "500 g / 1 lb 2 oz berberechos en vivo", "Savia de 300 g / 10½ oz", "Habas de 200g / 7oz, blanqueadas, refrescadas y envasadas", "1 cucharada de perejil de flatillo picado", "2 cucharadas de aceite de oliva", "sal y pimienta", "Papas al horno de 300 g / 10½ oz, cocidas y enfriadas, carne empujada a través de un ricer o tamiz", "1 bulbo de ajo, asado entero, dientes suaves pelados y empujados a través de un tamiz", "1½ cucharada de queso parmesano rallado", "1 yema de huevo", "75 g / 2⅔ oz harina 00", "2 cucharaditas de aceite de limón", "3 cucharadas de perejil de flatillo picado", "1 yema de huevo", "1 limón, ralladura y jugo", "200ml / 7fl oz de aceite de oliva ligero", "Crema doble 50ml / 2fl oz", "110ml / 4fl oz de caldo de pescado"], "method": ["Precaliente la parrilla a fuego medio y coloque el pescado en una bandeja para hornear y sazone. Coloque el pescado debajo de la parrilla y cocine durante aproximadamente 10 minutos, o hasta que la carne se desprenda del hueso.", "Mientras tanto, coloque una olla con tapa sobre la estufa y cuando la sartén esté caliente agregue los berberechos. Agregue 110ml / 4fl oz de agua e inmediatamente cubra con la tapa. Cueza al vapor los berberechos durante un minuto y luego escurra. Deseche cualquier berberecho que no se haya abierto. Cuando se enfríe lo suficiente como para manejarlos, retire los berberechos de sus caparazones.", "Para las albóndigas, traiga una olla grande de agua a fuego lento. Agregue una cucharadita de aceite de oliva y una pizca de sal.", "Coloque la papa, el ajo, el queso parmesano y la yema de huevo en un bol y dóblelos juntos (no trabaje demasiado). Doble la harina, el aceite de limón y el perejil. Sazonar y colocar en una superficie de trabajo limpia.", "Divida la masa en pequeñas bolas y blanche en el agua hirviendo hasta que las albóndigas salgan a la superficie. Sumérgete en agua helada y, cuando esté frío, transfiéralo a un paño de cocina para secarlo.", "Caliente una sartén antiadherente hasta que esté caliente. Agregue el aceite restante y las albóndigas y fría hasta que estén doradas. Escurrir sobre papel de cocina.", "Para la salsa de limón, coloque la yema de huevo, el jugo de limón y la ralladura en un bol y agítelos. Poco a poco agregue el aceite en una corriente delgada, batiendo todo el tiempo, para hacer una mayonesa.", "Batir la crema en la mayonesa y agregar suficiente caldo de pescado para diluir la mayonesa hasta obtener una consistencia de salsa (no necesitará todo el caldo). Coloque la salsa en una sartén y cálida suavemente.", "Poner a hervir una olla de agua con sal. Justo antes de servir, sumerja la salmonete en el agua y cocine durante dos minutos.", "Para servir, agregue los berberechos cocidos, el hinojo, las habas y el perejil a la salsa y ponga a fuego lento.", "Coloque el pescado cocido en platos para servir y apile las albóndigas al lado. Usa una cuchara ranurada para quitar los berberechos, el hinojo y las habas de la salsa y sirve al lado del pescado. Pase la salsa por un colador y espolvoree el pescado."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_cockles_and_99774", "title": "Suela de limón, berberechos y samphire con albóndigas de perejil al ajo y salsa de limón", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lenguado grande de limón, fileteado y despellejado", "50g / 1¾oz de harina natural, condimentada con sal y pimienta", "50g / 1¾oz pan rallado panko japonés", "3 huevos enteros de granja, batidos", "aceite vegetal, para freír en grasa", "sal marina, al gusto", "20 g / oz de mantequilla", "1 chalote de plátano grande, cortado en cubitos", "30 g / 1 oz de menta, separados en hojas y tallos, tallos atados con cuerdas de cocinero", "200g / 7oz de guisantes frescos, escaldados en una sartén de agua hirviendo y refrescados en un tazón con agua fría", "10 g de azúcar", "5g de vinagre de malta", "40g / 1½ oz de salsa de tomate", "60 g / 2¼ oz de mayonesa", "2 salpicaduras Tabasco", "½ zumo de limón", "2 salsas salsa Worcestershire", "brandy de bienvenida (opcional)", "pizca de cayena"], "method": ["Para los goujons de suela de limón, corta el pescado en tiras gruesas con un cuchillo afilado. Prepare un plato de la harina sazonada, un plato de migas de pan y un plato de huevos poco profundo.", "Sumerja el pescado en la harina sazonada, seque cualquier exceso, cubra con la colada de huevo, deje que el exceso gotee, luego agregue el pescado al pan rallado, asegurándose de que todo el pescado esté cubierto.", "Caliente el aceite en una freidora a 180 ° C / 350 ° F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue los goujons únicos a la freidora y fríalos hasta que estén dorados, retírelos con una espumadera, transfiéralos a un plato forrado con papel de cocina y sazone con sal marina.", "Para los guisantes molidos triturados, caliente la mantequilla en una sartén y fría los chalotes hasta que se ablanden. Agregue 30 ml / 1 fl oz de agua y hierva rápidamente con los tallos de menta y el azúcar. Agregue los guisantes y hierva por 20 segundos y luego drene.", "Retire los tallos y coloque los guisantes en un procesador de alimentos con las hojas de menta. Pulse durante 10 segundos para obtener una textura de guisante triturado y verifique que no tenga condimentos, agregue sal y pimienta al gusto. Agregue el vinagre de malta.", "Para la salsa de marie-rose, mezcle el ketchup, la mayonesa, el tabasco, el jugo de limón, la salsa Worcestershire, el brandy (si se usa) y la pimienta de cayena.", "Sirva los goujons con los guisantes molidos triturados y la salsa Marie-rose."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_goujons_mary_00757", "title": "Goujons de limón, salsa de marie-rose y guisantes molidos triturados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "60g / 2¾oz de harina de maíz", "300ml / 10½ fl oz de cerveza espumosa", "300ml / 10½fl oz de agua de soda", "100 g / 3½ oz de mayonesa lista para usar", "2 cucharadas de alcaparras escurridas, picadas", "4 pepinillos, escurridos, picados", "1 cucharada de perejil de flatillo picado", "sal y pimienta negra recién molida, al gusto", "aceite vegetal, para freír en grasa", "6 filetes medianos de lenguado de limón, cortados en tiras", "harina común, para quitar el polvo de pescado", "gran manojo de berros frescos"], "method": ["Para la mezcla, tamice la harina común y la harina de maíz en un bol.", "Batir en la cerveza y el agua de soda hasta que la mezcla esté suave y bien combinada. Reserve para descansar por 10 minutos, luego bata de nuevo por 30 segundos.", "Mientras tanto, para la salsa tártara, mezcle todos los ingredientes de la salsa tartare hasta que estén bien combinados. Enfriar en la nevera hasta que sea necesario.", "Para cocinar el pescado, vierta suficiente aceite vegetal en una sartén profunda de base pesada para llenarlo en aproximadamente dos tercios. Caliente el aceite hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvoree un poco de harina en un plato y presione ambos lados de cada una de las tiras de limón en la harina hasta que esté completamente cubierto.", "Sumerja las tiras de limón enharinado en la masa, luego bájelas suavemente en el aceite caliente y fría hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para servir, coloque unos goujons de limón en cada uno de los cuatro platos de servir. Coloque una cucharada de salsa tártara al lado de cada porción. Adorne con un puñado de hojas de berros."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_goujons_with_95881", "title": "Goujons de limón con berros y salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 puerros, piezas recortadas y blancas cortadas en piezas de 10cm / 4in", "50ml / 2fl oz de vino blanco", "75 g / 2½ oz de mantequilla", "1 ramita de tomillo", "aceite vegetal o de girasol, para freír", "Suela de limón entera 165g / 5¾oz, limpiada y fileteada", "2 cucharadas de aceite de oliva", "25g / 1oz de camarones marrones", "10g / ¼ oz de alcaparras", "100g / 3½oz de mantequilla sin sal", "2 limones, jugo de 1 y 1 segmentado", "pequeño puñado de perejil fresco de flatleaf, picado", "sal y pimienta negra"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½.", "Coloque los puerros en un pedazo de papel de aluminio, sazone con sal y pimienta y levante los bordes del papel aluminio para encerrar los puerros dejando la parte superior abierta. Vierta sobre el vino blanco y agregue la mantequilla y el tomillo, luego selle la lámina para hacer un paquete. Hornea de 10 a 15 minutos o hasta que los puerros estén suaves.", "Mientras tanto, precaliente una freidora a 180 ° C, o llene una olla grande y profunda, dos tercios llena con aceite y calor hasta que un pedazo pequeño de pan se ponga crujiente y dorado en menos de un minuto después de agregarlo al aceite.", "Sazone los solos filetes con sal y pimienta. Calentar el aceite de oliva en una sartén grande. Una vez caliente, agregue el pescado y cocine por 3 minutos en cada lado.", "Mientras tanto, coloque las gambas en la freidora y cocine por 1-2 minutos hasta que estén doradas y crujientes. Una vez que esté cocido, retírelo de la freidora con una espumadera y escurra sobre un plato forrado con un rollo de cocina. Agregue las alcaparras y freír durante 1 minuto. Retire con una espumadera y déjelo a un lado.", "En una sartén, derrita la mantequilla hasta que adquiera un color marrón claro, luego agregue el jugo de limón y déjela enfriar. Agregue el camarón marrón, los segmentos de limón y el perejil.", "Para servir, coloque los filetes de lenguado en platos para servir. Agregue el puerro y luego vierta la mantequilla sobre la suela, luego termine con las alcaparras fritas."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_slow-cooked_00010", "title": "Suela de limón, puerros cocidos a fuego lento, camarones marrones y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["120 g / 4¼ oz de mantequilla sin sal", "2 ramitas de tomillo fresco de limón", "2 ramitas de romero", "100 ml / 3½ fl oz de maní o aceite vegetal", "1 pierna de pavo, deshuesada, cortada en dados grandes", "1 cebolla pequeña, cortada en anillos", "1 bulbo de ajo, reducido a la mitad", "5 ramitas de tomillo fresco", "500ml / 18fl oz de caldo de pollo", "60 g / 2¼ oz de mantequilla sin sal", "½ cebolla grande, en rodajas", "1 ramita de tomillo fresco, hojas solo, picadas", "aceite vegetal, para freír, más 4 cucharaditas para freír poco", "Patatas harinosas de 400g / 14oz, preferiblemente Desiree, Maris Piper o King Edward, cortadas en dados de 1cm / ½ en dados", "4 cucharaditas de mostaza integral", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "agua con hielo", "6 tomates", "60 g / 2¼ oz de mantequilla sin sal", "4 x 160 g / 5¾oz piezas de suela de limón, sin piel, con espinas", "espolvorear con jugo de limón", "120g / 4¼oz de camarones marrones", "Segmentos de limón pelados de 40 g / 1½ oz cortados en trozos pequeños", "Alcaparras para bebés de 40g / 1½oz", "40 g / 1½ oz de tomate concasse", "20g / ¾oz de chalotes, finamente picados", "1 cucharada de perejil fresco picado", "75g / 2¾oz de guisantes congelados"], "method": ["Para la beurre noissette, caliente dos sartenes pequeñas y divida la mantequilla entre ellas. Agregue el tomillo de limón a una cacerola y agregue el romero al otro, esto le dará dos mantequillas quemadas diferentes. Cocine hasta que la mantequilla se ponga dorada, retírela del fuego.", "Precalentar el horno a 220C / 200C Fan / Gas 6.", "Para el jus de pavo, caliente una bandeja de asar en el horno y agregue el aceite. Agregue la carne de pavo y tueste hasta que esté dorado y cocido, revolviendo de vez en cuando, esto demorará unos 15 minutos. Retire la bandeja de asar del horno y coloque la placa a fuego medio-bajo.", "Agregue la cebolla y el ajo, con la carne hacia abajo, y cocine suavemente hasta que estén ligeramente coloreados. Agregue el tomillo y desglasifique la bandeja de asar con 500 ml / 18 fl oz de agua.", "Transfiera a una cacerola grande y agregue el caldo de pollo. Llevar a ebullición, luego reducir a fuego lento y cocinar durante 3 horas, eliminando cualquier espuma y exceso de grasa. Colar en un colador y pasar a través de un tamiz fino, luego poner de nuevo en la sartén y reducir a 500 ml / 18 fl oz. Dejar de lado.", "Para las papas Lyonnaise, derrita 40 g / 1½ oz de mantequilla en una cacerola de base pesada. Agregue la cebolla y el tomillo y sazone con sal y pimienta. Cocine, revolviendo de vez en cuando, hasta que esté suave y transparente.", "Mientras tanto, caliente el aceite en una freidora de grasa profunda o una sartén de fondo grueso y pesada a 140 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje si no está vigilada). Blanquee las papas en el aceite hasta que estén suaves y ligeramente coloreadas. Escurrir sobre papel de cocina y dejar enfriar.", "Caliente las 4 cucharaditas restantes de aceite en una sartén con la mantequilla restante. Agregue las papas blanqueadas y cocine hasta que estén doradas. Escurra el exceso de mantequilla y agregue la cebolla cocida y la mostaza a las papas. Mezcle bien, luego agregue el perejil y sazone con sal y pimienta.", "Para el tomate concasse, medio llenar un recipiente con agua helada. Retire los tallos de los tomates y corte lo que queda del área del tallo. Con un cuchillo afilado, corte la parte superior de cada tomate. Sumerja cada tomate en agua hirviendo durante 10 segundos y revuelva en agua helada. Pelar los tomates, cortar en cuartos y eliminar las semillas. Cortar los cuartos de tomate en tiras, luego en dados pequeños.", "Para hacer una salsa para la planta de limón, tome el tomillo beurre noisette y cuele a través de un colador, agregue el jus de pavo y cocine a fuego lento hasta que se haya reducido en dos tercios, luego sazone con sal y pimienta y reserve.", "Para la suela de limón, precaliente el horno a 200C / 180C Fan / Gas 6. Sazone el pescado con sal y pimienta. Caliente la mantequilla restante y una gota de aceite en una sartén a prueba de horno a fuego medio. Antes de que la mantequilla se ponga dorada, agregue el pescado grueso hacia abajo. Una vez que el pescado comience a colorear, coloque la sartén en el horno durante 5 minutos, luego gire el pescado para cocinar por otros 4 minutos. Cocine en tandas si es necesario.", "Para la guarnición, pon tu romero beurre noisette en una sartén. Agregue el camarón café y caliente suavemente. Agregue los segmentos de limón, alcaparras, tomate concasse, chalotes, perejil y guisantes. Sazonar con sal y pimienta, mantener caliente.", "Espolvorea el pescado con jugo de limón. Deje reposar durante 1 minuto mientras coloca algunas de las papas Lyonnaise en el medio de cada plato de servir. Coloque el pescado encima de las papas y espolvoree con el romero. Vierta sobre la salsa de limón y sirva."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_with_16617", "title": "Suela de limón con patatas Lyonnaise", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 puerro, hojas externas eliminadas, cortadas en trozos de 10cm / 4in", "50ml / 2fl oz de vino blanco seco", "botón de mantequilla", "1 ramita de tomillo fresco", "Suela de limón entera de 165 g / 5¾oz, sin cabeza, eviscerada y desollada en ambos lados", "2 cucharaditas de alcaparras de lilliput", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "1 limón, jugo y segmentos", "25g / 1oz de camarones marrones", "puñado de perejil fresco de flatleaf, picado"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½.", "Coloque los puerros en una hoja grande de papel de aluminio. Sazonar con sal y pimienta y llevar el lado de la lámina para hacer un paquete. Agregue el vino, la mantequilla y el tomillo, luego cierre la lámina. Coloque el paquete en una bandeja para hornear y cocine de 10 a 15 minutos hasta que el puerro esté suave.", "Sazone la lengua de limón con sal y pimienta. Caliente una sartén a fuego medio, agregue la planta de limón y cocine por 3 minutos en cada lado.", "Caliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Agregue las alcaparras y cocine durante 30 segundos, o hasta que estén abiertas y crujientes. Retire y escurra sobre papel de cocina.", "Para hacer la salsa, derrita la mantequilla en una olla pequeña hasta que esté dorada, luego agregue el jugo de limón. Retirar del fuego y dejar enfriar. Agregue el camarón marrón, los segmentos de limón y el perejil.", "Para servir, ponga la planta del limón en un plato hondo y agregue los puerros. Vierta sobre la mantequilla y cubra con las alcaparras."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_with_slow_24057", "title": "Suela de limón con puerro cocido a fuego lento, camarones marrones y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "1 chalota, más o menos picada", "1 palito de apio, picado", "4 ramitas de tomillo fresco", "12 colas de langostinos, escaldadas, carne retirada, conchas reservadas", "5 cucharadas de vino blanco", "300ml / 10fl oz de caldo de pescado", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "100ml / 3½ fl oz de vermut seco", "200 ml / 7 fl oz existencias (desde arriba)", "1 hoja de laurel", "150ml / 5fl oz de crema doble", "150 g / 5½ oz de uvas verdes, peladas y cortadas por la mitad", "¼ de pepino, en forma de bola usando una primicia parisina", "75g / 2½oz de mantequilla sin sal", "2 x solomillos de limón, despellejados, filetes cortados a la mitad y enrollados", "2 cucharadas de perifollo fresco", "selección de flores comestibles"], "method": ["Para el caldo, caliente la mantequilla en una cacerola y agregue la chalota, el apio y el tomillo. Cocine por 2-3 minutos. Agregue las cáscaras de langostinos e incremente el calor. Agregue el caldo de vino blanco y pescado y cocine por 5 minutos.", "Retirar del fuego y colocar en un procesador de alimentos grande. Mezcle todo junto, incluidas las conchas. Pasar a través de un tamiz y reservar.", "Para la salsa, caliente una sartén grande y agregue la mantequilla. Una vez derretido agregue la chalota y cocine durante 1 minuto. Agregue el vermut, el caldo y la hoja de laurel y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema y reduzca a la mitad nuevamente. Pasar a través de un tamiz en una sartén limpia. Agregue las uvas y las bolas de pepino y cocine por 1 minuto.", "Para cocinar la suela, caliente una sartén grande y agregue la mantequilla. Una vez caliente agregue la suela. Cocine a cada lado hasta que estén dorados y cocidos. Agregue la carne de langostino y caliente.", "Coloque los filetes de lenguado en un plato grande y cubra con los langostinos. Vierta la salsa alrededor del plato y adorne con el perifollo fresco y las flores comestibles."], "url": "www_bbc_co_uk_food_recipes_lemon_sole_vronique_12672", "title": "Suela de limón Véronique", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla, ablandada", "4 cucharadas de azúcar en polvo", "4 claras de huevo de gallinas camperas", "175ml / 6fl oz de crema de vainilla lista para usar", "3 limones, cáscara y jugo de 2", "200 g / 7 oz de azúcar en polvo", "Frambuesas de 500 g / 1 lb 2 oz", "1 cucharadita de jugo de limón", "1-2 cucharadas de azúcar glas, al gusto"], "method": ["Para el soufflé, precaliente el horno a 220C / 425F / Gas 7.", "Engrase ligeramente cuatro moldes grandes con la mantequilla y luego espolvoree con la mitad del azúcar impalpable.", "Batir las claras de huevo en un tazón limpio grande hasta que se formen picos suaves cuando se quita el batidor. Bata lentamente el azúcar impalpable restante y continúa batiendo hasta que se formen picos fuertes.", "Doble suavemente la crema de vainilla, la ralladura de limón y el jugo hasta que se combinen.", "Coloque la mezcla con cuidado en los moldes preparados y coloque en una bandeja para hornear.", "Hornee en el horno durante 7-8 minutos, luego retírelo del horno y sirva inmediatamente.", "Mientras tanto, para el azúcar hilado, derrita el azúcar en una sartén a fuego medio y cuando se convierta en un color dorado profundo, retírelo del fuego y use un tenedor para mover hacia adelante y hacia atrás sobre la parte posterior de un cucharón para formar un jaula. Poner a un lado para enfriar y endurecer, luego cuidadosamente retuerza la jaula de la cuchara y colócala en el plato.", "Coloque 300 g / 11 oz de las frambuesas y el jugo de limón en un procesador de alimentos y mezcle hasta obtener un puré suave. Pruebe la mezcla y agregue azúcar glas, al gusto. Pase la mezcla a través de un tamiz fino en un recipiente.", "Coloque el soufflé en el plato. Llene la jaula con unas frambuesas y luego rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_lemon_souffl_with_spun_53293", "title": "Soufflé de limón con azúcar hilado y frambuesas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos medianos de granja", "115 g / 4 oz de azúcar en polvo, más extra para quitar el polvo", "1 vaina de vainilla, cortada a la mitad a lo largo y semillas raspadas", "Harina de auto crianza de 75g / 2½ oz", "1 limón, ralladura solamente", "100ml / 3½ fl oz crema doble", "1 cucharadita de extracto de vainilla", "100g / 3½oz de queso crema", "6 maracuyá, semillas eliminadas", "1 limón, en rodajas", "100 g / 3½ oz de azúcar en polvo", "Frambuesas o fresas de 100 g / 3½ oz", "50g / 1¾oz de azúcar glas", "1 limón, ralladura y jugo", "150g / 5½oz de azúcar glas"], "method": ["Precalentar el horno a 190 ° C / 375 ° F / Gas 5. Cubra una lata de rollo suizo de 23 x 33 cm / 9 x 13 pulgadas con papel de hornear.", "Coloque los huevos, el azúcar y las semillas de vainilla en un tazón grande y bata hasta que quede muy liviano, esponjoso y espeso. Tamizar la harina sobre la mezcla, agregar la ralladura de limón y doblar suavemente.", "Vierta la mezcla en la lata forrada y use una espátula para alisar la superficie. Hornee la esponja durante 10-12 minutos, o hasta que esté firme al tacto.", "Coloque un trozo de pergamino para hornear que sea un poco más grande que la lata de rollo suizo en la superficie de trabajo y espolvoréelo con azúcar en polvo. Con cuidado, voltea la esponja caliente sobre el pergamino para hornear y quita el pergamino de la parte inferior de la esponja. Dejar enfriar un poco.", "Para la guarnición, coloque el azúcar impalpable y 100 ml / 3½ fl oz de agua en una olla y deje que hierva. Cuando el azúcar se disuelva, agregue el limón en rodajas y cocine a fuego lento durante unos 20 minutos o hasta que los limones estén suaves. Deja enfriar.", "Para la crema de maracuyá, en un tazón grande, bate la crema doble con el extracto de vainilla hasta que se formen picos suaves cuando se quite la batidora. Agregue el queso crema.", "Para ensamblar el rollo suizo, extienda la crema batida y el queso crema sobre la parte superior de la esponja y luego espolvoree las semillas de maracuyá. Tome uno de los bordes cortos, luego use el papel pergamino debajo para comenzar, enrolle la esponja con fuerza, asegurándose de que el relleno permanezca adentro. Ruede la esponja del pergamino.", "Para el glaseado, agregue todo el ingrediente a un recipiente pequeño. Caliente la mezcla hasta que el azúcar se disuelva.", "Vierta el almíbar uniformemente sobre el panecillo suizo, espolvoree con azúcar glasé y adorne con las bayas y confíe las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_lemon_swiss_roll_with_37413", "title": "Rollo suizo de limón con crema de maracuyá y glaseado de limón y llovizna", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "100 g / 3½ oz de mantequilla fría, más extra para engrasar", "25g / 1oz de azúcar glasé, más extra para quitar el polvo", "1 pizca de sal", "1 huevo de gallinas camperas", "14 huevos de gallinas camperas, más 1 huevo batido para glasear", "550 g / 1 libra de azúcar en polvo 4 oz", "700ml / 1¼ pinta de crema doble", "10 limones grandes, cáscara y jugo solamente", "500g / 1lb 2oz crème fraîche, para servir"], "method": ["Para la masa, coloque la harina, la mantequilla, el azúcar glas y la sal en un tazón y frote con la yema de los dedos hasta que se asemeje a la textura de las migas de pan finas.", "Agregue el huevo y mezcle hasta que se forme una masa, luego amasar ligeramente en una superficie de trabajo hasta que quede suave.", "Enróllate, luego aplástate un poco, envuélvete en una película adhesiva y ponlo en la nevera para que descanse durante 30 minutos.", "Para la tarta, precalentar el horno a 170 ° C / 340 ° F / Gas 3½ y un anillo de tarta de 25 cm / 10 pulgadas (aproximadamente 4,5 cm / 1 \"de profundidad).", "Rompa los huevos en un tazón, agregue el azúcar, la crema, la ralladura de limón y el jugo y mezcle con suavidad. Ponlo en la nevera para enfriar.", "Extienda la masa en una superficie de trabajo ligeramente espolvoreada con harina hasta un grosor de aproximadamente 3 mm. Siga girando la pastelería un cuarto de vuelta cada vez que la enrolle para que termine con un círculo perfecto de masa.", "Coloque el anillo tarta con mantequilla sobre una bandeja para hornear plana y luego colóquelo con la masa, levante con cuidado la masa y luego presiónela en la base del anillo, dejando cualquier exceso colgando sobre el borde.", "Alinee con varias hojas de película adhesiva para cubrir la masa y cuélguela en 10 cm / 4 pulgadas y luego rellene la tarta con harina, arroz crudo o alubias. Doble la película adhesiva sobre la harina / arroz y hornee durante 15 minutos. No toda la película adherida es adecuada para usar en el horno, pero si se prefiere puede usarse papel de aluminio o pergamino para hornear.", "Retire la película adhesiva y la harina / arroz, cepille el interior de la tarta con el huevo batido y vuelva al horno durante otros 3-4 minutos, o hasta que estén dorados.", "Reduzca la temperatura del horno a 150C / 300F / Gas 2.", "Elimine cualquier burbuja de la parte superior de la crema de limón y deséchela.", "Vierta la mitad de la crema de limón en la caja de pastelería, luego transfiérala al horno antes de agregar el resto del relleno (esto evita cualquier derrame y da un acabado limpio).", "Hornee por una hora, o hasta que el relleno esté listo, pero todavía balanceándose en el centro. Dejar enfriar a temperatura ambiente.", "Para servir, corte la tarta en rodajas y polvo con azúcar glas. Glasee colocando la tarta debajo de una parrilla caliente o usando un soplete. Servir con una quenelle de crème fraîche."], "url": "www_bbc_co_uk_food_recipes_lemon_tart_38623", "title": "Tarta de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "1½ cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "¼ cucharadita de sal marina fina", "150ml / 5fl oz de aceite vegetal, más extra para engrasar", "150 g / 5½ oz de azúcar en polvo", "275ml / 9½fl oz de leche de coco", "2 limones, ralladura y jugo", "1 cucharadita de extracto de vainilla", "150 g / 5½ oz de arándanos", "1 jugo de limón, solo jugo", "1 cucharada de azúcar en polvo", "1½ cucharadita de harina de maíz", "250 g / 9 oz de yogur de leche de coco", "1 cucharadita de extracto de vainilla", "2½ cucharaditas de azúcar glas"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase los lados y forre la base de una lata de torta con forma de resorte de 20 cm / 8 pulg con papel de hornear.", "Para hacer la torta, combine la harina, el polvo de hornear, el bicarbonato de soda y la sal en un tazón grande.", "Batir el aceite, el azúcar y la leche de coco juntos en una jarra, seguido de la ralladura de limón y 3 cucharadas de jugo y el extracto de vainilla.", "Vierta la jarra de ingredientes líquidos en el bol de ingredientes secos, batiendo para mezclar, luego vierta en la lata preparada y hornee durante 30-35 minutos, momento en el que la parte superior será de color marrón dorado, los lados se encogen lejos de la lata y una el probador de torta debe salir limpio. Transfiera a una rejilla y deje que la torta se enfríe completamente en su lata. Puede hundirse ligeramente a medida que se enfría.", "Para preparar la compota, ponga los arándanos, 1 cucharada de jugo de limón, azúcar impalpable y 50 ml / 2 fl oz de agua fría en una cacerola y deje que hierva, luego baje el fuego y cocine a fuego lento, revolviendo suavemente de vez en cuando, para un par de minutos hasta que los arándanos se hayan suavizado. Retire la sartén del fuego.", "Mezcle 1½ cucharaditas de agua fría con la harina de maíz en una taza pequeña y mezcle la pasta en la compota. Coloque la sartén sobre el fuego y revuelva suavemente durante unos 30 segundos hasta que burbujee y espese. Si sientes que se ha vuelto demasiado pegajoso y espeso, simplemente agrega un poco más de agua y revuélvelo con el calor. Vierta la compota en un tazón o jarra a prueba de calor para enfriar y preparar.", "Justo antes de servir, retire la torta fría de la lata y colóquela en un soporte para pasteles o en un plato.", "Mezcle el yogur de leche de coco y la vainilla, vierta el azúcar glasé en un colador de té, luego crítelo sobre el yogur y revuelva antes de esparcirlo y agitar esta suave mezcla sobre la parte superior del pastel. Afloje un poco la compota de arándanos con un tenedor y con cuidado coloque una cuchara encima, dejando un marco blanco reluciente. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_lemon_tendercake_with_52994", "title": "Pastel de limón con compota de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_tendercake_with_52994_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["5 claras de huevo", "275g / 9¾oz de azúcar en polvo", "puñado de pequeñas hojas de verbena de limón", "1 cucharadita de azúcar glas, para quitar el polvo", "Fresas de 350g / 12oz, mondadas y partidas a la mitad según el tamaño", "400 ml / 14 fl oz crema doble", "1 vaina de vainilla, cortada a la mitad a lo largo y semillas raspadas"], "method": ["Para los merengues, precaliente el horno a 180 ° C / 160 ° Fan / Gas 4. Cubra una bandeja para hornear grande con papel de hornear antiadherente o una estera de silicona.", "Batir las claras de huevo en un recipiente de vidrio limpio con un batidor de mano eléctrico hasta que se formen picos rígidos cuando se levante el batidor. Poco a poco agregue el azúcar, una cucharada a la vez, y mezcle bien entre cada adición. Batir hasta que esté muy tieso y brillante y se haya agregado todo el azúcar.", "Coloque la mezcla en la bandeja para hornear forrada, creando un rectángulo de 35x25 cm / 14x10 pulgadas, y alise la superficie. Espolvoree con la mayor parte de la hierba luisa. Hornee por 8 minutos o hasta que estén doradas. Reduzca la temperatura a 170 C / Fan 150C / Gas 3 y hornee por otros 12 minutos o hasta que estén crujientes.", "Espolvoree ligeramente una hoja de papel para hornear con azúcar en polvo. Deje que el merengue se enfríe un poco antes de ponerlo sobre el papel de hornear, con la verbena de limón hacia abajo. Deja enfriar.", "Para el relleno, ponga fresas de 200g / 7oz en una licuadora y mezcle hasta que quede suave. Pasar la mezcla a través de un colador en un recipiente para eliminar las semillas.", "Batir ligeramente la crema en un tazón grande. Agregue la salsa de fresa y 100 g / 3½ oz de las fresas restantes. Extienda la crema de fresa uniformemente sobre el merengue. Comenzando en el extremo largo, enrolle el rollo usando el papel para ayudarlo.", "Decora la parte superior del pastel con las fresas restantes y las hojas de verbena de limón y el polvo con el azúcar glas."], "url": "www_bbc_co_uk_food_recipes_lemon_verbena_meringues_29213", "title": "Rollo de merengue de fresa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / 10½fl oz de leche entera", "300ml / 10½ fl oz crema doble", "4 ramitas de tomillo de limón", "6 yemas de huevo de gallinas camperas", "50g / 1¾oz de azúcar", "200ml / 7fl oz de crema doble, batida", "aceite vegetal para freír", "1 huevo blanco de corral", "Harina de 175g / 6oz de auto crianza", "pellizcar bicarbonato de soda", "160ml / 5½fl oz de agua con gas", "50g / 1¾oz de azúcar glas", "200g / 7oz de frambuesas frescas"], "method": ["Para la crema de limón y tomillo, coloque la leche y la crema en una cacerola grande y agregue el tomillo de limón. Calor por un par de minutos. Mientras tanto, coloca las yemas de huevo y el azúcar en un tazón grande y bate.", "Tamiza la leche y la crema para eliminar el tomillo. Poco a poco vierta el líquido sobre el huevo y el azúcar y siga batiendo para evitar que los huevos revolviendo.", "Vierta la mezcla en la olla y cocine hasta que cubra la parte posterior de la cuchara.", "Permita que la crema se enfríe. Una vez que esté frío, agrega la crema batida y mézclalo.", "Para los restos dulces, caliente el aceite en una freidora a 170 ° C / 340 ° F, o caliente el aceite en una sartén profunda y pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer (Precaución: el aceite caliente puede ser peligroso. No dejes desatendido.)", "Coloque la clara de huevo, la harina y el bicarbonato de soda en un tazón grande y bata. Poco a poco agregue el agua con gas, batiendo todo el tiempo.", "Rocíe la mezcla en la freidora y cocine durante 1-2 minutos para hacer sobras. Retirar con una cuchara ranurada, escurrir sobre un plato forrado con papel de cocina y espolvorear con azúcar glas.", "Para servir, coloca la crema de tomillo limón y las frambuesas frescas en un vaso para servir. Adorne con los restos dulces y algunas frambuesas más."], "url": "www_bbc_co_uk_food_recipes_lemon_thyme_custard_with_16395", "title": "Crema de tomillo de limón con frambuesas y restos dulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 300 ml / ½ pinta", "300 ml / ½ litro de yogur natural entero en grasa", "2 limones, ralladura finamente rallada y jugo", "Azúcar en polvo 350g / 12oz", "300 ml / ½ litro de leche"], "method": ["Batir la crema en un bol hasta que se formen picos suaves cuando se quita la batidora. Agregue el yogur, la ralladura de limón y el jugo, el azúcar y la leche. Batir hasta que esté bien combinado.", "Vierta en un recipiente de plástico poco profundo de 1,5 litros / 2½ pinta, cubra con una tapa y congélelo durante al menos seis horas, preferiblemente durante la noche, hasta que esté firme.", "Retire el helado del congelador, córtelo en trozos y mezcle en un procesador hasta que quede suave y cremoso. Vuelva al recipiente de plástico, cúbralo con la tapa y vuelva al congelador hasta que lo necesite."], "url": "www_bbc_co_uk_food_recipes_lemon_yoghurt_ice_cream_79279", "title": "Helado de yogurt sin manteca y limón", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lemon_yoghurt_ice_cream_79279_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de salmón de 100 g / 3½ oz, sin piel", "1 cucharadita de azúcar en polvo", "½ limón, solo jugo", "pequeño puñado de eneldo fresco, finamente picado", "rociar aceite de oliva", "pequeño puñado cada cebollino fresco, perejil, albahaca, menta, picada", "exprimir jugo de limón", "1 cucharada de aceite de oliva extra virgen"], "method": ["Coloque todos los ingredientes de salmón en un tazón y revuelva para cubrir bien el salmón. Cubra con una película adhesiva y déjelo marinar durante diez minutos. Cortar finamente.", "Para hacer la ensalada de hierbas, coloca las hierbas en un tazón grande y exprime el jugo de limón y el aceite de oliva. Mezcle hasta que las hierbas estén bien cubiertas.", "Para servir, ponga la ensalada de hierbas en un plato y cubra con las rebanadas de salmón marinado."], "url": "www_bbc_co_uk_food_recipes_lemonanddillmarinate_84941", "title": "Salmón al limón y marinado en eneldo con ensalada de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de azúcar en polvo", "6 limones, jugo y corteza rallada", "1 tallo de hierba de limón, más o menos aplanado con un rodillo", "450 ml / ¾ de litro de agua de soda"], "method": ["Coloque el azúcar, corteza de limón y jugo, tallo de hierba de limón en una sartén con 150 ml / ¼ de agua.", "Calentar suavemente, revolviendo hasta que el azúcar se disuelva, cocine a fuego lento durante cinco minutos y luego deje enfriar.", "Cuele el líquido en un recipiente rígido y luego agregue el agua de soda.", "Transfiera al congelador durante al menos dos horas, batiendo cada 20 minutos para detener la formación de cristales.", "Servir en anteojos."], "url": "www_bbc_co_uk_food_recipes_lemonadegranita_70981", "title": "Granito limonada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]