[{"isVegetarian": true, "title": "Classic chocolate éclair", "url": "www_bbc_co_uk_food_recipes_classic_chocolate_clair_21075", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter", "1 tsp caster sugar", "pinch salt", "150g/5oz strong flour", "4 eggs", "100g/3½oz dark chocolate", "150g/5½ oz fondant icing sugar", "4 tbsp cocoa powder", "1.2 litres/2 pints double cream", "2 vanilla pods, seeds only"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a baking sheet with baking paper, and line a tray with baking paper.", "Put 250ml/9floz water into a pan with the salt, sugar and butter and bring to the boil. Add the flour in one go and cook for a few minutes, beating all the time, until the mixture comes away from the sides of the pan cleanly and is smooth. It will sound like bacon frying in a pan when it’s ready!", "Tip out onto the lined tray and leave to cool in the fridge for 5 minutes.", "Transfer to a kitchen mixer or large bowl and beat in the eggs, one at a time, then continue to beat until the mixture is rich and smooth.", "Spoon the mixture into a piping bag fitted with a large, plain nozzle, then pipe 8 to 12 strips, to make long éclair shapes, onto the prepared baking sheet. Smooth out any bumps with the tip of a wet finger then sprinkle them with a little water.", "Bake in the oven for 25-30 minutes until golden-brown and crisp. ", "Remove from the oven and transfer the éclairs from the baking tray to a wire rack to cool.", "Meanwhile, put the chocolate in a bowl set over a pan of water and simmer until the chocolate has melted.", "Remove from the heat and add the icing sugar and cocoa and beat together. Add 2 tablespoons of hot water from the saucepan and beat until smooth then add 3-4 more tablespoons, a little at a time, until you have a smooth shiny pourable icing. Place back over the pan of water, off the heat, to keep warm until ready to use. ", "Whip the double cream until soft peaks form when the whisk is removed and spoon into a piping bag.", "Using the end of a clean, ink free biro, make a hole on the top of the éclair at either end. Carefully insert the nozzle into the holes, and fill with the cream.", "Dip the éclairs into the fondant chocolate to cover the top evenly and leave to set before serving."]}, {"isVegetarian": true, "title": "Classic chocolate éclair", "url": "www_bbc_co_uk_food_recipes_classic_chocolate_clair_72793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/9fl oz water", "115g/4oz butter", "200g/7oz plain flour", "1 tsp caster sugar", "pinch salt", "4 free-range eggs", "50g/2oz dark chocolate, chopped", "150g/5½oz fondant icing sugar", "2 tbsp dark cocoa powder", "450ml/16fl oz double cream"], "serves": "Makes 8-12 éclairs", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with greaseproof paper.", "Heat the water and butter in a saucepan until the butter has melted.  ", "Beat in the flour, sugar and salt until the mixture is smooth, then continue to cook for 2-3 minutes. Remove the pan from the heat and beat in the eggs, one at a time, until smooth and glossy. ", "Set aside to cool, then spoon the dough into a piping bag fitted with a medium size nozzle.", "Pipe 12.5cm/5in lines onto the baking tray and bake in the oven for 20-25 minutes, or until golden-brown and crisp.", "Remove the éclairs from the oven and set aside to cool on a wire rack.", "Meanwhile, heat the dark chocolate and two tablespoons of water in a saucepan until the chocolate has melted.", "Sieve the icing sugar and cocoa into a bowl, then add the melted chocolate and water and beat until the mixture is smooth and thickened.", "Spoon the mixture into a piping bag.", "Whip the double cream in a bowl until stiff peaks just form when the whisk is removed. Spoon the mixture into a piping bag fitted with a small nozzle. Carefully insert the nozzle into the base of the éclairs and fill with cream. ", "Pipe the fondant chocolate on top of the éclairs and set aside until set."]}, {"isVegetarian": true, "title": "Mary Berry's classic Christmas cake", "url": "www_bbc_co_uk_food_recipes_classic_christmas_cake_04076", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_christmas_cake_04076_16x9.jpg", "ingredients": ["175g/6oz raisins", "350g/12oz natural glacé cherries, halved, rinsed, and thoroughly dried ", "500g/1lb 2oz currants", "350g/12oz sultanas", "150ml/¼pt brandy or sherry, plus extra for feeding", "2 oranges, zest only", "250g/9oz butter, softened", "250g/9oz light muscovado sugar", "4 free-range eggs, at room temperature", "1 tbsp black treacle", "75g/3oz blanched almonds, chopped", "250g/9oz plain flour", "1½ tsp mixed spice", "about 3 tbsp apricot jam, warmed and sieved", "icing sugar", "675g/1lb 8oz marzipan ", "3 free-range eggs, whites only", "675g/1½lb icing sugar, sifted", "3 tsp lemon juice", "1½ tsp glycerine"], "serves": "Serves 10-12", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, place all the dried fruit, including the cherries, into a large mixing bowl, pour over the brandy and stir in the orange zest. Cover with clingfilm and leave to soak for three days, stirring daily.", "Grease and line a 23cm/9in deep, round tin with a double layer of greased greaseproof paper. Preheat the oven to 140C/275F/Gas 1.", "Measure the butter, sugar, eggs, treacle and almonds into a very large bowl and beat well (preferably with an electric free-standing mixer). Add the flour and ground spice and mix thoroughly until blended. Stir in the soaked fruit. Spoon into the prepared cake tin and level the surface. ", "Bake in the centre of the preheated oven for about 4-4½ hours, or until the cake feels firm to the touch and is a rich golden brown. Check after two hours, and if the cake is a perfect colour, cover with foil. A skewer inserted into the centre of the cake should come out clean. Leave the cake to cool in the tin.", "When cool, pierce the cake at intervals with a fine skewer and feed with a little extra brandy. Wrap the completely cold cake in a double layer of greaseproof paper and again in foil and store in a cool place for up to three months, feeding at intervals with more brandy. (Don’t remove the lining paper when storing as this helps to keep the cake moist.)", "The week before you want to serve, begin covering the cake.", "For the covering, stand the cake upside down, flat side uppermost, on a cake board which is 5cm/2in larger than the size of the cake.", "Brush the sides and the top of the cake with the warm apricot jam. ", "Liberally dust a work surface with icing sugar and then roll out the marzipan to about 5cm/2in larger than the surface of the cake. Keep moving the marzipan as you roll, checking that it is not sticking to the work surface. Dust the work surface with more icing sugar as necessary. ", "Carefully lift the marzipan over the cake using a rolling pin. Gently level and smooth the top of the paste with the rolling pin, then ease the marzipan down the sides of the cake, smoothing it at the same time. If you are careful, you should be able to cover the cake with no excess marzipan to trim but, if necessary, neatly trim excess marzipan from the base of the cake with a small sharp knife. Cover the cake loosely with baking parchment and leave for a few days to dry out before adding the royal icing. ", "For the royal icing, whisk the egg whites in a large bowl until they become frothy. Mix in the sifted icing sugar a tablespoonful at a time. You can do this with a hand-held electric whisk, but keep the speed low.", "Stir in the lemon juice and glycerine and beat the icing until it is very stiff and white and stands up in peaks.", "Cover the surface of the icing tightly with clingfilm and keep in a cool place until needed. ", "To ice the cake, place all the icing onto the top of the cake. Spread evenly over the top and sides of the cake with a palette knife. For a snow-peak effect, use a smaller palette knife to rough up the icing. ", "Leave the cake loosely covered overnight for the icing to harden a little, then wrap or store in an airtight container in a cool place until needed. "]}, {"isVegetarian": false, "title": "Classic coq au vin", "url": "www_bbc_co_uk_food_recipes_classic_coq_au_vin_52046", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp plain flour", "1 x 2kg/4lb 8oz good-quality chicken, jointed into 10 pieces", "175g/6oz butter", "1 white onion, roughly chopped", "225g/8oz smoked streaky bacon, cut into lardons", "500ml/17fl oz red wine", "50ml/2fl oz brandy", "2 garlic cloves, lightly crushed", "3 bay leaves", "4 sprigs fresh thyme", "1kg/2lb 4oz King Edward potatoes", "200ml/7fl oz double cream", "100g/3½oz silverskin onions, left whole", "200g/7oz baby button mushrooms", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sprinkle the flour onto a plate and dredge the chicken pieces in the flour to coat thoroughly.", "Heat 50g/2oz of the butter in a large ovenproof casserole over a high heat. When the butter is foaming, add the chicken pieces, in batches, skin-side down, and fry for 2-3 minutes, or until browned on each side. Remove the chicken from the pan, then add the chopped white onion and fry for 1-2 minutes.", "Return the chicken to the pan, add the bacon lardons and fry for a further 1-2 minutes, or until just starting to crisp. ", "Pour in the red wine and brandy, add the garlic, bay leaf and thyme, then bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 1 hour, or until the chicken is tender and cooked through to the bone, with no trace of pink remaining.", "While the chicken cooks, bring the potatoes to the boil in a pan of cold, salted water. Reduce the heat and simmer the potatoes for 12-15 minutes, or until tender. Drain well and return to the pan, then place the pan over a low heat for a couple of minutes to dry the potatoes slightly.", "Mash the potatoes through a ricer until very smooth, then beat in 100g/3½oz of the remaining butter and all of the cream. Season, to taste, with salt and freshly ground black pepper. Keep warm.", "When the chicken is tender, heat the remaining butter in a frying pan over a medium heat. Add the silverskin onions and button mushrooms and fry until golden-brown, then stir them into the coq au vin and season again.", "To serve,ladle the coq au vin onto serving plates with a dollop of mashed potatoes alongside."]}, {"isVegetarian": false, "title": "Classic Cornish pasty", "url": "www_bbc_co_uk_food_recipes_classic_cornish_pasty_67037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_cornish_pasty_67037_16x9.jpg", "ingredients": ["500g/1lb 1oz strong bread flour ", "120g/4oz vegetable shortening or suet", "1 tsp salt ", "25g/1oz margarine or butter", "175ml/6fl oz cold water ", "1 free-range egg, beaten with a little salt (for glazing)", "350g/12oz good-quality beef skirt, rump steak or braising steak ", "350g/12oz waxy potatoes", "200g/7oz swede", "175g/6oz onions", "salt and freshly ground black pepper", "knob of butter or margarine"], "serves": "Makes 4 large pasties", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Tip the flour into the bowl and add the shortening, a pinch of salt, the margarine or butter and all of the water.", "Use a spoon to gently combine the ingredients. Then use your hands to crush everything together, bringing the ingredients together as a fairly dry dough. ", "Turn out the dough onto a clean work surface (there’s no need to put flour or oil onto the surface because it’s a tight rather than sticky dough).", "Knead the dough to combine the ingredients properly. Use the heel of your hand to stretch the dough. Roll it back up into a ball, then turn it, stretch and roll it up again. Repeat this process for about 5-6 minutes. The dough will start to become smooth as the shortening breaks down. If the dough feels grainy, keep working it until it’s smooth and glossy. Don’t be afraid to be rough – you’ll need to use lots of pressure and work the dough vigorously to get the best results.", "When the dough is smooth, wrap it in cling film and put it in the fridge to rest for 30–60 minutes.", "While the dough is resting, peel and cut the potato, swede and onion into cubes about 1cm/½in square. Cut the beef into similar sized chunks. Put all four ingredients into a bowl and mix. Season well with salt and some freshly ground black pepper, then put the filling to one side until the dough is ready.", "Lightly grease a baking tray with margarine (or butter) and line with baking or silicone paper (not greaseproof).", "Preheat the oven to 170C (150C fan assisted)/325F/Gas 3. ", "Once the dough has had time to relax, take it out of the fridge. The margarine or butter will have chilled, giving you a tight dough. Divide the dough into four equal-sized pieces. Shape each piece into a ball and use a rolling pin to roll each ball into a disc roughly 25cm/10in wide (roughly the same size as a dinner plate).", "Spoon a quarter of the filling onto each disc. Spread the filling on one half of the disc, leaving the other half clear. Put a knob of butter or margarine on top of the filling.", "Carefully fold the pastry over, join the edges and push with your fingers to seal. Crimp the edge to make sure the filling is held inside – either by using a fork, or by making small twists along the sealed edge. Traditionally Cornish pasties have around 20 crimps. When you’ve crimped along the edge, fold the end corners underneath.", "Put the pasties onto the baking tray and brush the top of each pasty with the egg and salt mixture. Bake on the middle shelf of the oven for about 45 minutes or until the pasties are golden-brown. If your pasties aren't browning, increase the oven temperature by 10C/25F for the last 10 minutes of cooking time."]}, {"isVegetarian": true, "title": "Classic crème caramel", "url": "www_bbc_co_uk_food_recipes_classic_crme_caramel_44792", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_crme_caramel_44792_16x9.jpg", "ingredients": ["160g/6oz sugar", "unsalted butter, for greasing the ramekins", "4 free-range eggs", "1 tsp vanilla extract", "25g/1oz caster sugar", "600ml/1 pint full-fat milk", "pouring cream, to serve"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat oven 150C/300F/Gas 2.  Warm the ramekins in the oven, so they are warm when the caramel is poured in.", "First make the caramel. Pour the sugar and six tablespoons of water into a clean stainless steel pan.", "Dissolve the sugar slowly, stirring with a wooden spoon over a low heat.  ", "When there are no sugar granules left, stop stirring and boil until the sugar turns a dark copper colour. ", "Remove immediately from the heat to ensure the caramel does not burn.  Quickly pour the caramel into the warmed ramekins.  ", "Set aside to cool and become hard.  (Do not put in the fridge because the sugar will absorb moisture and go soft and tacky).", "Once hard, butter the sides of the ramekins above the level of the caramel.", "For the custard, whisk the eggs, vanilla extract and caster sugar together in a bowl until well mixed.", "Pour the milk into a saucepan, gently heat over a low heat until you can still just dip your finger in for a moment, then strain the milk through a fine sieve onto the egg mixture in the bowl.  ", "Whisk together until smooth, then pour the mixture into the prepared ramekins.", "Stand the ramekins in a roasting tin and fill the tin half-way with boiling water from a kettle.  ", "Cook in the oven for about 20-30 minutes or until the custard has set.  Do not overcook the custard – check around the edges of the dishes, to make sure no bubbles are appearing.", "Take the crème caramels out of the oven, remove the ramekins from the tray and set on a cooling rack.  When cool, transfer to the fridge overnight so that the caramel is absorbed into the custard.", "To serve, loosen the sides of the custard by tipping the ramekin and loosen with a small palette knife round the edges.  Place a serving dish on top of the ramekin and turn upside down.  Serve with pouring cream."]}, {"isVegetarian": false, "title": "Classic fish pie with peas", "url": "www_bbc_co_uk_food_recipes_classic_fish_pie_with_86482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 medium baking potatoes", "1 tbsp vegetable oil", "handful rock salt", "1 onion, thinly sliced", "½ tsp black peppercorns", "2 bay leaves", "500g/1lb 2oz boneless, skinless smoked haddock", "400g/14oz haddock, bones and skin removed", "400g/14oz cod, bones and skin removed", "200g/7oz butter", "3 heaped tablespoons plain flour", "475ml/17fl oz milk", "1 lemon, zest and juice", "small bunch flatleaf parsley, leaves roughly chopped", "250g/9oz cooked peeled prawns", "grated cheese, for topping", "200g/7oz peas", "sea salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Prick the potatoes all over with a fork, then rub each one with a little of the oil. Sprinkle a roasting tray with the rock salt and place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Meanwhile, half-fill a large frying pan with water and bring to a simmer. Add the onion, black peppercorns, bay leaves and all of the fish, poach for 3-4 minutes. Lift the fish from the pan using a slotted spoon, and set aside. Strain the fish stock through a sieve suspended over a large bowl. Reserve the strained stock and discard the onion, bay leaves and peppercorns.", "Melt 100g/3½oz of the butter in a saucepan over a medium heat. Whisk in the flour to form a smooth paste, then cook for a further 1-2 minutes. ", "Whisk in 50ml/2fl oz of the milk until it is fully incorporated into the roux. Continue to add 350ml/12fl oz of the remaining milk to the roux little by little, whisking after each addition, until the sauce is smooth and thick.", "Pour 750ml/25fl oz of the fish stock to the roux sauce, stir well and cook for 4-5 minutes, or until the sauce is smooth and just thick enough to coat the back of a spoon. Any remaining fish stock can be chilled and frozen for use in another dish.", "Stir in the lemon zest and juice, and the parsley, then season with salt and pepper. Remove from the heat. Stir the prawns into the sauce, then flake in the poached fish, keeping it in reasonably large pieces. Transfer the pie filling to a large ovenproof dish.", "When the potatoes are cooked, remove them from the oven and increase the oven temperature to 220C/200C Fan/Gas 7.", "When the potatoes are just cool enough to handle, slice them in half, scoop out the flesh and pass it through a potato ricer into a pan set over a medium heat. Add 75g/2¾oz of the butter and the remaining of milk to the potatoes and beat over the heat until the mash is smooth and thick and not too soft. ", "Spoon the mash into a piping bag with a large star-shaped nozzle and pipe the mashed potato all over the fish pie filling. Sprinkle over the grated cheese. Alternatively, just spread the mashed potato onto the filling using a palette knife.", "Place the ovenproof dish onto a baking sheet and cook in the oven for 5-10 minutes, or until the cheese and potatoes are golden-brown and the pie is heated through.", "While the fish pie heats through, bring a pan of salted water to the boil, add the peas and cook for 2-3 minutes, until tender. Drain well and return to the pan, then stir in the remaining butter and season with salt and pepper. Serve the fish pie with the peas alongside."]}, {"isVegetarian": false, "title": "Classic lasagne", "url": "www_bbc_co_uk_food_recipes_classic_lasagne_07638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp extra virgin olive oil ", "300g/10½oz beef mince", "300g/10½oz pork mince ", "1 large glass red wine", "1 small onion, finely chopped ", "2 carrots, finely chopped ", "1 stick celery, finely chopped", "salt and freshly ground black pepper", "1 x 400g/14oz tin chopped plum tomatoes ", "40g/1½oz butter ", "40g/1½oz plain flour ", "500ml/18fl oz milk ", "salt and pepper ", "100g/3½oz grated parmesan cheese ", "8-10 sheets fresh egg lasagne  ", "1 ball mozzarella "], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the ragù sauce, in a large pan, heat the olive oil, add the mince and brown well. Add the red wine to deglaze the pan and cook until it has almost evaporated. ", "Tip in the onion, carrots and celery and fry for a couple of minutes. Season with salt and pepper, then add the chopped tomatoes and rinse the tin out with water and add the water from the tin to the pan. Lower the heat, cover with a lid and gently simmer for two hours, stirring from time to time.  ", "Preheat the oven to 200C/400F/Gas 6.  ", "For the white sauce, melt the butter in a small pan on a medium heat, stir in the flour with either a wooden spoon or small hand whisk (this will avoid lumps from forming) to form a paste and stir in a little of the milk.  ", "Add the remaining milk, stirring all the time until it begins to thicken to a creamy consistency.  Remove from the heat, add salt and pepper and stir in 20g/¾oz of the grated parmesan cheese.    ", "Line an ovenproof rectangular dish of about 22 x 26cm/8½ x 10½in with a little of the ragù sauce, arrange sheets of lasagne over followed by ragù sauce, dots of mozzarella and white sauce and a sprinkling of grated parmesan. Continue to make layers like this until you have finished all the ingredients, ending with a topping of white sauce. Hold back some of the ragù to dot over the top and sprinkle with parmesan cheese.  ", "Cover with foil and bake for 35-40 minutes, or until golden-brown.  Remove the foil for the last five minutes of cooking.  Allow to rest for a couple of minutes before serving.  "]}, {"isVegetarian": true, "title": "Classic rum baba", "url": "www_bbc_co_uk_food_recipes_classic_rum_baba_38141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz self-raising flour", "10g salt ", "100g/3½oz caster sugar", "20g/¾oz fast-action dried yeast", "6 free-range eggs", "2 tsp warm milk", "150g/5½oz unsalted butter, softened", "100ml/3½fl oz dark rum ", "200g/7oz caster sugar ", "150ml/5fl oz thick vanilla cream, to taste", "dark rum, to taste"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the flour, salt and sugar in a large mixing bowl. ", "Mix the yeast with 150ml/5fl oz warm water in a small bowl to dissolve the yeast.", "Beat the eggs and milk together with a whisk. Add to a medium saucepan and bring to a simmer. Remove and cool immediately.", "Using a free-standing electric mixer, tip the yeast into the flour mixture and gradually add the eggs and milk, beating all the time, to make a batter. Gradually add the soft butter to make a dough. Place in a bowl and cover for one hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Knock back the dough and kneed for a few minutes. Leave in a non-stick 20cm/8in savarin tin to rise for 20 minutes or so, covered. ", "Bake for 30 minutes or more - depending on the tin depth - until risen and golden. Leave to cool for 10 minutes before turning out of the tin.", "For the glaze, heat the rum, 300ml/10fl oz water and the sugar in a saucepan until reduced to a thick glaze.", "To serve, pour over the glaze over the baba. Serve with thick vanilla cream and more neat rum."]}, {"isVegetarian": true, "title": "Classic sourdough", "url": "www_bbc_co_uk_food_recipes_classic_sourdough_21029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_sourdough_21029_16x9.jpg", "ingredients": ["375g/13oz strong white flour, plus extra for dusting", "250g/9oz sourdough starter", "7.5g salt", "130-175ml/4-6fl oz tepid water", "olive oil, for kneading"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Combine the flour, starter and salt in a large mixing bowl. Add the water, a little at a time, and mix with your hands to make a soft dough (you may not need all of the water).", "Coat a chopping board or work surface with olive oil, then tip the dough onto it and knead the dough for 10-15 minutes, or until the dough forms is smooth and elastic. ", "Tip the dough into a lightly oiled bowl and cover with cling film. Leave to rise in a warm place for five hours, or until at least doubled in size. ", "Knead the dough until it’s smooth, knocking the air out. Roll into a ball and dust with flour. ", "Tip the dough into a well-floured round banneton or proving basket and leave to rise for 4-8 hours.", "Put a tray half filled with water on the bottom oven shelf and preheat the oven to 220C/425F/Gas 7. ", "Gently tip the risen dough onto a lined baking tray.  Bake the loaf for 30 minutes at this heat, then reduce the heat to 200C/400F/Gas 6 and bake for a further 15-20 minutes. Cool on a cooling rack.  "]}, {"isVegetarian": true, "title": "Chocolate and ginger oat biscuits", "url": "www_bbc_co_uk_food_recipes_classic_stem_ginger_83286", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_stem_ginger_83286_16x9.jpg", "ingredients": ["225g/8oz unsalted butter", "100g/3½oz golden syrup", "200g/7oz soft brown sugar", "150g/3½oz plain flour", "2 tsp baking powder", "1 tsp sea salt flakes ", "4 tsp ground ginger", "2 tsp ground cinnamon", "400g/14oz rolled oats", "2 free-range eggs, beaten", "50g/1¾oz stem ginger, chopped", "115g/4oz good quality dark chocolate"], "serves": "Makes 24 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line two baking trays with non-stick parchment. Melt the butter and the golden syrup in a pan over a low heat. Set aside to cool slightly.  ", "Combine the sugar, flour, baking powder, salt and spices and mix well to combine. Stir in the rolled oats and mix thoroughly. Pour in the melted butter and syrup and stir until well combined. Then stir in the beaten eggs and the stem ginger.", "Spoon in even, heaped teaspoons onto the lined baking trays, leaving room for them to spread. Bake in the oven for 8-10 minutes. Remove the biscuits from the oven and set aside to cool completely.", "Melt the chocolate in a bowl suspended over a pan of barely simmering water (do not let the bottom of the bowl touch the water). Dip the biscuits in the melted chocolate and place on a cooling rack until the chocolate has set."]}, {"isVegetarian": false, "title": "Classic toad in the hole", "url": "www_bbc_co_uk_food_recipes_classic_toad_in_the_hole_67862", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "8 free-range eggs", "1 tbsp wholegrain mustard", "570ml/1 pint milk", "75g/2¾oz beef dripping (or lard)", "6 good quality sausages", "200ml/7fl oz good quality veal jus/stock (alternatively use beef jus)", "salt and freshly ground black pepper", "50g/1¾oz butter", "pinch salt", "pinch sugar", "1 bunch baby carrots, trimmed", "300g/10½oz garden peas"], "serves": "", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Put the flour in a bowl and make a well in the centre. Whisk in the eggs and mustard and continue to whisk until just smooth. Gradually add the milk and a pinch of salt and whisk to a smooth batter. Place in the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 220C/200C Fan/Gas 7.", "Pour three-quarters of the beef dripping in a roasting tin and heat in the oven. Heat a frying pan and add the remaining dripping. When it’s melted, add the sausages and fry on each side until browned.", "Remove the batter from the fridge and whisk once more to combine.", "Put the sausages in the roasting tin and pour over the batter. Place in the oven for 30 minutes. Briefly open the oven door to allow the steam to escape and cook for a further 10 minutes.", "Meanwhile for the vegetables, put the butter, salt, sugar and 200ml/7fl oz of water in a deep sauté pan. When the butter has melted add the carrots and cook for 3-4 minutes.", "Bring a large pot of salted water to the boil, add the peas and cook for 2-3 minutes. Drain the peas and add a little butter.", "Heat the veal jus and season with salt and pepper.", "Cut a section of the toad in the hole and place on a plate, pour over the jus and serve the vegetables alongside. "]}, {"isVegetarian": true, "title": "Classic Victoria sponge cake", "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_45518", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["oil, for greasing", "200g/7oz butter", "200g/7oz caster sugar", "½ tsp vanilla essence", "4 free-range eggs", "200g/7oz self-raising flour, sifted", "½ jar raspberry jam", "175ml/6fl oz double cream, whipped", "250g/9oz raspberries", "2-3 tbsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/350F/Gas 5. Grease and line 2 x 20cm/8in sandwich tins.", "Mix the butter, sugar and vanilla essence in a bowl or food processor until well combined. ", "Slowly beat in the eggs one by one. Fold in the sifted flour and carefully pour the mixture into the prepared tins. ", "Bake for 20-25 minutes until golden-brown. Test by pushing a skewer into the centre of the cake. If the skewer comes out clean the cake is ready.", "Turn the cake out onto a wire rack and set aside to cool. ", "Spread one cake with the raspberry jam, followed by a layer of whipped cream. Cover with the raspberries and place the other cake on top.", "To serve, dust with icing sugar and cut the cake into slices."]}, {"isVegetarian": true, "title": "Classic victoria sponge cake with strawberry jam", "url": "www_bbc_co_uk_food_recipes_classic_victoria_sponge_54621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz jam sugar", "1 lemon, zest and juice", "500g/1lb 2oz fresh strawberries, hulled, cut in half only if large", "oil, for greasing the tins", "flour, for dusting the tins", "250g/9oz butter", "250g/9oz caster sugar", "½ tsp vanilla essence", "4 free-range eggs", "250g/9oz self-raising flour, sifted", "175ml/6fl oz double cream, whipped", "250g/9oz strawberries", "2-3 tbsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jam, heat the sugar, lemon juice and zest and three tablespoons water in a large pan, slowly, until the sugar has melted.", "Add the strawberries and stir gently. ", "Bring the jam up to the boil and cook for 3-4 minutes, or up to 10 minutes if you prefer a thicker jam.", "Check the temperature with a sugar thermometer – it should reach 105C/220F.", "Remove the jam from the heat and leave to cool slightly. Skim off any froth with a clean spoon, to stop the jam from going cloudy.", "Spoon the jam into a sterile jam jar, seal and label.", "For the cake, preheat the oven to 190C/375F/Gas 5. ", "Grease and flour two 20cm/8in sandwich tins. ", "Combine the butter, sugar and vanilla essence in a bowl or food processor, and mix well to a creamy consistency. ", "Slowly beat in the eggs one by one. ", "Fold in the sifted flour then pour the mixture into the prepared tins. ", "Bake for 20-25 minutes until the sponge is well-risen, golden-brown and springs back when pressed. ", "Remove the cakes from the oven, turn them out of their tins onto a wire rack and leave to cool. ", "Spread one cake with strawberry jam, followed by a layer of whipped cream.", "Layer on the fresh strawberries then place the other cake on top.", "Dust with icing sugar to finish."]}, {"isVegetarian": true, "title": "Deep-dish Bakewell tart with cream", "url": "www_bbc_co_uk_food_recipes_classicbakewelltart_92618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz sweet shortcrust pastry ", "3 tbsp icing sugar, plus extra for dusting", "175g/6oz butter, softened", "175g/6oz caster sugar", "4 free-range eggs", "175g/6oz ground almonds", "300g/11oz ready-made raspberry jam", "40g/1½oz flaked toasted almonds", "200g/7oz clotted cream", "250ml/9fl oz double cream"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Roll the sweet shortcrust pastry out onto a lightly dusted work surface to a 0.5cm/¼in thickness.", "Carefully line a 23cm/9in, deep-sided tart tin with the pastry, pressing the pastry into the edges of the tin.", "Line the pastry case with greaseproof paper and fill with baking beans or rice.", "Place the tart tin onto a baking tray, then bake in the oven for 15 minutes.", "Remove the greaseproof paper and baking beans or rice, then return the tart case to the oven and bake for a further 8-10 minutes, or until the pastry is crisp and pale golden-brown. Remove from the oven and set aside to cool slightly.", "Meanwhile, beat the butter and sugar together in a bowl until pale and fluffy.", "Crack in the eggs, one at a time, beating well after each addition, until all of the eggs have been fully incorporated into the mixture.", "Fold in the ground almonds until well combined.", "When the pastry case has cooled, spread the raspberry jam in an even layer all over the bottom of the tart.", "Spoon in the almond mixture and smooth the surface with a palette knife.", "Dust the top of the tart with icing sugar, then sprinkle over the flaked almonds.", "Return the tart to the oven and continue to cook for 25-30 minutes, or until the filling has risen and is cooked through and the surface is pale golden-brown. (NB: The filling is cooked through when a skewer inserted into the centre comes out clean.)", "Remove the tart from the oven and set aside to cool slightly before serving.", "To serve, place one slice of Bakewell tart into the centre of each of 10-12 serving plates. Place a spoonful of clotted cream on top of each slice. Drizzle the double cream around the edge of each plate."]}, {"isVegetarian": false, "title": "Classic champagne cocktail", "url": "www_bbc_co_uk_food_recipes_classicchampagnecock_84499", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicchampagnecock_84499_16x9.jpg", "ingredients": ["1 white sugar cube", "2 dashes bitters", "20ml/¾fl oz cognac", "enough champagne to fill the glass"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sugar cube onto a spoon and add the bitters.", "Drop the soaked sugar cube into a champagne flute and add the cognac.", "Top up the glass with champagne and serve."]}, {"isVegetarian": false, "title": "Classic chicken Caesar salad", "url": "www_bbc_co_uk_food_recipes_classicchickencaesar_86187", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x chicken breasts, skin and knuckle bone still attached", "salt and freshly ground black pepper", "1 tbsp olive oil ", "150ml/5fl oz chicken stock", "200g/7oz white bread, cut into small cubes ", "pinch salt", "80ml/3fl oz olive oil", "150g/5oz parmesan, grated ", "2 tbsp white wine vinegar", "250g/10½oz ready-made mayonnaise", "3 tbsp Dijon mustard", "2 anchovy fillets, rinsed", "pinch salt", "1 garlic clove, crushed", "50ml/2fl oz olive oil", "1 cos lettuce, torn up", "12 anchovies (stored in vinegar) ", "50g/2oz parmesan shavings"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the salad, season the chicken well with salt and freshly ground black pepper.", "Heat the oil in a frying pan over a medium heat and add the chicken breasts, skin-side down. Fry for 4-5 minutes, until the skin is crisp and golden-brown.", "Turn the breasts over and fry for 1-2 minutes.", "Transfer the breasts, skin-side up, to an ovenproof dish and pour the stock around the meat. Try not to pour the stock over the meat.", "Place into the oven to cook for 20 minutes, or until completely cooked through. Test the meat with a skewer at the thickest part- the juices should run clear. Remove from the oven and allow to cool slightly.", "Meanwhile, for the croutons, place the cubes of bread onto a baking tray, sprinkle with salt and drizzle with the oil.", "Place into the bottom of the oven and bake for 5-6 minutes, or until the croutons are golden-brown.", "For the dressing, place the parmesan and vinegar into a food processor and blend until very smooth.", "Add the mayonnaise, mustard, anchovy fillets, salt, garlic and olive oil and blend again until smooth.", "To serve, place the lettuce into a large bowl, pour on some dressing and gently turn the leaves to coat.", "Add the croutons and transfer the salad to four separate bowls.", "Add three anchovies to each bowl and drizzle over a little more dressing.", "Carve each chicken breast into thick slices and place half of the chicken over each bowl of salad.", "Sprinkle with parmesan shavings and serve."]}, {"isVegetarian": false, "title": "Classic cottage pie", "url": "www_bbc_co_uk_food_recipes_classiccottagepie_90765", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "650g/1lb 7oz minced beef", "3-4 banana shallots or 7-8 small round shallots, finely chopped", "4 sprigs fresh thyme, leaves only", "2 tbsp tomato purée", "1 tbsp plain flour", "150ml/5fl oz red wine", "400ml/14fl oz beef stock", "salt and freshly ground black pepper ", "Worcestershire sauce, to taste", "900g/2lb King Edward potatoes, peeled and chopped", "115g/4oz butter", "125ml/4½fl oz double cream", "salt and freshly ground black pepper", "150g/5½oz frozen peas", "50g/1¾oz butter"], "serves": "2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until smoking, add half of the olive oil and fry the minced beef, in batches, for 4-5 minutes, or until browned all over. ", "Heat a separate pan over a gentle heat, add the remaining olive oil and fry the shallots and thyme for 2-3 minutes, or until just softened. Stir in the tomato purée and flour and cook for a further minute, then add the cooked beef.", "Deglaze the frying pan used to cook the beef with the red wine, scrapingup any caramelised bits with a wooden spoon. Cook for 3-4 minutes, or until the wine has reduced by half, then pour the wine into the pan with the beef. ", "Add the stock to the pan and leave to simmer for 45 minutes, or until the beef is tender and the mixture is thickened. Season, to taste, with salt, freshly ground black pepper and a few dashes of Worcestershire sauce. Keep warm over a very low heat.", "Preheat the grill to high.", "For the mash, place the potatoes into a pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender. ", "Drain and return the potatoes to the pan, then place over the heat for about one minute to drive off any excess moisture. Mash well with a potato masher or ricer, then add the butter and milk, beating to form a smooth mash. Season, to taste, with salt and freshly ground black pepper. Spoon the mash into a piping bag.", "Place the mince mixture into a baking dish and pipe the mash over the top. Place under the grill for 8-10 minutes, or until the top is golden-brown. Serve spooned onto serving plates.", "Place the peas in water in a small saucepan and cook for 3-4 minutes, drain and add the butter.", "To serve, serve a spoonful of the cottage pie on plates with the peas alongside. "]}, {"isVegetarian": true, "title": "Classic crêpes suzette", "url": "www_bbc_co_uk_food_recipes_classiccrepessuzette_66236", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiccrepessuzette_66236_16x9.jpg", "ingredients": ["110g/4oz plain flour, sifted", "pinch of salt", "2 eggs", "200ml/7fl oz milk mixed with 75ml/3fl oz water", "50g/2oz butter", "1 medium orange, grated zest only", "1 tbsp caster sugar ", "150ml/5fl oz orange juice (from 3-4 medium oranges)", "1 medium orange, grated zest only", "1 small lemon, grated rind and juice", "1 tbsp caster sugar", "3 tbsp Grand Marnier, Cointreau or brandy", "50g/2oz unsalted butter", "a little extra Grand Marnier, for flaming"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl with a sieve held high above the bowl so the flour gets an airing. Now make a well in the centre of the flour and break the eggs into it. Then begin whisking the eggs - any sort of whisk or even a fork will do - incorporating any bits of flour from around the edge of the bowl as you do so.", "Next gradually add small quantities of the milk and water mixture, still whisking (don't worry about any lumps as they will eventually disappear as you whisk). When all the liquid has been added, use a rubber spatula to scrape any elusive bits of flour from around the edge into the centre, then whisk once more until the batter is smooth, with the consistency of thin cream. Now melt the 50g/2oz of butter in a pan. Spoon 2 tbsp of it into the batter and whisk it in, then pour the rest into a bowl and use it to lubricate the pan, using a wodge of kitchen paper to smear it round before you make each pancake. Stir the orange zest and caster sugar into the batter.", "Now get the pan really hot, then turn the heat down to medium and, to start with, do a test pancake to see if you're using the correct amount of batter. These little crêpes should be thinner than the basic pancakes, so when you're making them, use ½ tbsp of batter at a time in a 18cm/7in pan. It's also helpful if you spoon the batter into a ladle so it can be poured into the hot pan in one go. As soon as the batter hits the hot pan, tip it around from side to side to get the base evenly coated with batter. It should take only half a minute or so to cook; you can lift the edge with a palette knife to see if it's tinged gold as it should be. Flip the pancake over with a pan slice or palette knife - the other side will need a few seconds only - then simply slide it out of the pan onto a plate. If the pancakes look a little bit ragged in the pan, no matter because they are going to be folded anyway. You should end up with 15-16 crêpes.", "Stack the pancakes as you make them between sheets of greaseproof paper on a plate fitted over simmering water, to keep them warm while you make the rest.", "For the sauce, mix all the ingredients - with the exception of the butter - in a bowl. At the same time warm the plates on which the crêpes are going to be served. Now melt the butter in the frying pan, pour in the sauce and allow it to heat very gently. Then place the first crêpes in the pan and give it time to warm through before folding it in half and then in half again to make a triangular shape. Slide this onto the very edge of the pan, tilt the pan slightly so the sauce runs back into the centre, then add the next crêpe. Continue like this until they're all re-heated, folded and well soaked with the sauce.", "You can flame them at this point if you like. Heat a ladle by holding it over a gas flame or by resting it on the edge of a hotplate, then, away from the heat, pour a little liqueur or brandy into it, return it to the heat to warm the spirit, then set light to it. Carry the flaming ladle to the table over the pan and pour the flames over the crêpes before serving on the warmed plates."]}, {"isVegetarian": true, "title": "Classic Daiquiri", "url": "www_bbc_co_uk_food_recipes_classicdiaquari_86314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz white rum ", "35ml/1½fl oz fresh lime juice ", "4 tsp sugar syrup (often sold as 'gomme' syrup)", "1 wedge lime"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rum, lime juice and sugar syrup into a cocktail shaker and shake well to combine.", "Pour into a Martini glass and serve garnished with a wedge of lime."]}, {"isVegetarian": true, "title": "Classic mojito", "url": "www_bbc_co_uk_food_recipes_classicmojito_72225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20ml/¾fl oz fresh lime juice (or 1-2 limes, chopped)", "1 tbsp caster sugar", "2-3 tbsp fresh mint leaves, left whole", "50ml/1¾fl oz Cuban (or other) rum  ", "plenty of crushed ice", "330ml/12fl oz glass", "fresh mint sprig to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the lime juice into the glass.", "Add the sugar and stir until it dissolves in the lime juice. (If using freshly chopped limes instead of lime juice, crush them with the sugar using a pestle until the sugar dissolves.)", "Throw in the whole mint leaves, letting them fall where they may, even letting them stick to the sides of the glass.  The glass should be loosely full of mint. ", "Pour crushed ice over the mint leaves to fill the glass.", "Using a spoon, stir the ice with the mint and lime until the mint starts to break.  Do not break the mint until this point.", "Top with 50ml of rum and stir until evenly mixed and the ice is slightly slushy. ", "Serve with a sprig of mint on top."]}, {"isVegetarian": true, "title": "Classic mayonnaise", "url": "www_bbc_co_uk_food_recipes_classicmayonnaise_81725", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp white wine vinegar", "1 tbsp parsley stalks, roughly chopped", "1 tbsp chervil, chopped", "2 free-range egg yolks", "1 tsp English mustard powder", "150ml/5fl oz light olive oil", "150ml/5fl oz vegetable oil", "salt and freshly ground black pepper", "squeeze lemon juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vinegar, parsley stalks and chervil into a small saucepan and bring to the boil. Simmer until the volume is reduced to one tablespoon of liquid. ", "Strain the liquid through a sieve and discard the parsley and chervil.", "Place the egg yolks, mustard powder and infused vinegar into a food processor and blend.", "With the blender still running, gradually add the oils. Continue to blend the mixture until all the oil has been incorporated and the mixture has thickened.", "Season with salt and freshly ground black pepper and add a squeeze of lemon juice.", "Spoon into a small serving bowl and serve."]}, {"isVegetarian": true, "title": "Classic Margarita", "url": "www_bbc_co_uk_food_recipes_classicmargarita_84327", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classicmargarita_84327_16x9.jpg", "ingredients": ["35ml/1¼fl oz Reposado Tequila", "20ml/¾fl oz Cointreau", "35ml/1¼fl oz fresh lime juice", "handful ice cubes", "lime wedge, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the Tequila, Cointreau and lime juice into a cocktail shaker.", "Add a handful of ice cubes and shake vigorously for 10-15 seconds.", "Strain into a Martini glass with half the rim damped with water, then dipped in salt.", "Add a lime wedge on the rim by way of garnish."]}, {"isVegetarian": true, "title": "Classic lemon tart", "url": "www_bbc_co_uk_food_recipes_classiclemontart_86198", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classiclemontart_86198_16x9.jpg", "ingredients": ["5 free-range eggs", "190g/6¾oz caster sugar", "250ml/9fl oz double cream", "4 lemons, juice and zest", "butter, for greasing", "flour, for dusting", "225g/8oz ready-made sweet shortcrust pastry", "icing sugar, for dusting", "110g/4oz mild goats' cheese", "50ml/2fl oz double cream", "2 tbsp icing sugar"], "serves": "Serves 6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the lemon tart, crack the eggs into a bowl and whisk gently to break up the yolks. Add the sugar and mix well. Add the cream and the lemon juice and stir. Pass the mixture through a sieve, then add the lemon zest and set aside.  ", "Grease a 20cm/8in flan ring with butter. Roll out the pastry on a lightly floured surface to make a circle large enough to fit over the flan ring. Using the rolling pin, carefully lift the pastry over the ring and gently press into the ring. Allow the pastry to overhang the edges of the ring slightly. Line with a circle of greaseproof paper and fill with rice or baking beans.", "Transfer to the oven and bake for about 15 minutes. Remove from the oven and remove the beans and greaseproof paper, then return to the oven for five minutes, or until the tart case is lightly browned.", "Turn the oven down to 150C/300F/Gas 2 and pour the lemon mixture into the tart case. Bake in the oven for about an hour, or until the filling is just set and the pastry is golden-brown.", "Remove the tart from the oven and trim off the edges of the pastry. Leave to cool completely, then place in the fridge to chill for about two hours.", "Preheat the grill to medium.", "Dust the top of the tart generously with icing sugar then place under the grill until caramelised.", "For the goats' cheese cream, place the goats' cheese into a bowl with the cream and icing sugar and mix well.", "To serve, cut the tart into wedges and serve with a spoonful of the goats' cheese cream."]}, {"isVegetarian": false, "title": "Classic moules marinières", "url": "www_bbc_co_uk_food_recipes_classicmoulesmarinie_90477", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "175ml/6fl oz white wine", "250g/9oz live mussels, debearded, cleaned and rinsed", "3 tbsp double cream", "2 tbsp chopped fresh parsley", "crusty white bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Tap the mussels against a hard surface and discard any that do not close.", "Heat the oil in a pan and gently fry the onions and garlic for 3-4 minutes, or until softened. Pour in the white wine and bring to a simmer, then add the mussels and cover with a lid for 4-5 minutes, or until the mussels have opened.  Discard any unopened mussels.", "Stir in the cream and parsley and spoon into a serving bowl. Serve immediately with the bread to mop up the juices."]}]