[{"ingredients": ["Hojaldre ligero listo para alisar 280 g / 10 oz", "Calabacines para bebés de 200g / 7oz, cortados en rodajas de 15mm / ⅝in", "1 pimiento rojo grande, sin corazón, sin semillas, cortado en trozos de 2cm / ¾in", "1 pimiento amarillo grande, sin corazón, sin semillas, cortado en trozos de 2cm / ¾in", "1 cebolla roja, cortada en trozos de 2cm / ¾in", "4 dientes de ajo, en rodajas", "2 ramitas de romero, hojas recogidas y finamente picadas", "4 ramitas de tomillo, hojas recogidas", "aceite de oliva en aerosol", "1 cucharada de leche semidesnatada", "100g / 3½oz de tomates cherry, cortados por la mitad", "75 g / 2¾oz de queso de cabra, desmenuzado", "sal marina y pimienta negra recién molida"], "method": ["Con un cuchillo afilado, corte la hoja de hojaldre a 25 x 28 cm / 10 x 11 pulgadas. Colócalo en una bandeja para hornear forrada con pergamino para hornear y marca un borde de 2 cm desde el borde hasta el final. Pinche la masa dentro del margen, usando un tenedor. Deje reposar en la nevera durante aproximadamente una hora. Mientras tanto, precalentar el horno a 240C / 220C Fan / Gas 9.", "Pon los calabacines, la pimienta y la cebolla roja en un tazón grande. Agregue el ajo y las hierbas y sazone generosamente con sal y pimienta. Alinee una bandeja grande para hornear con un pergamino para hornear, ponga las verduras sobre ella y rocíe de 15 a 20 veces con aceite.", "Cepille la masa de hojaldre con la leche y espolvoree un poco de sal. Cocine en el estante del medio del horno, con la bandeja de verduras en el estante superior, durante 15 minutos, girando ambas bandejas hasta la mitad para garantizar un color uniforme. Retire ambas bandejas del horno y reduzca la temperatura a 160 ° C / 140 ° Ventilador / Gas 3. Deje las verduras a un lado.", "Presione el interior de la masa y vuelva al horno por 25 minutos para obtener una base súper crujiente.", "Saque la caja de tarta del horno y aumente la temperatura a 200 ° C / 180 ° Ventilador / Gas 6. Incline los vegetales tostados en la caja de tarta, espolvoree sobre los tomates cherry y el queso de cabra y sazone con sal y pimienta.", "Hornee durante 20-25 minutos hasta que las verduras estén cocidas y el queso se suavice y coloree en los bordes. Cortar la tarta en cuartos y servir."], "url": "www_bbc_co_uk_food_recipes_mediterranean_puff_50963", "title": "Tarta de hojaldre del Mediterráneo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterranean_puff_50963_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 225g / 9oz de pasta de filo lista para usar, fresca o congelada (necesitará aproximadamente diez hojas que midan aproximadamente 34 cm x 30 cm / 13 pulgadas x 12 pulgadas o más grandes)", "85g / 3oz de mantequilla, derretida, para cepillar", "2 cucharadas de aceite de oliva", "1 cebolla roja grande, cortada a la mitad y cortada finamente", "600 g / 1 libra de espinaca de hojas de bebé de 5 oz", "nuez moscada recién rallada, al gusto", "sal y pimienta negra recién molida", "55g / 2oz sultanas", "85g / 3oz de piñones, tostados", "225 g / 8oz de feta", "3 huevos medianos de granja", "ensalada de rúcula"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Retire las hojas de hojaldre de su paquete y colóquelas sobre una superficie de trabajo limpia. Manténlos cubiertos con un paño limpio y húmedo mientras trabajas para evitar que la pastelería se seque.", "Para el relleno, caliente la mitad del aceite de oliva en una sartén. Agregue la cebolla rebanada y fríela suavemente durante 5-6 minutos a fuego medio, hasta que se dore ligeramente y se ablande.", "Caliente el aceite de oliva restante en una sartén grande de fondo grueso. Agregue las espinacas y cocine, sin tapa, durante unos minutos, hasta que se marchite. Cuando la espinaca esté cocida, colócala en un colador sobre un recipiente para drenar y enfriar. Deseche cualquier líquido que salga.", "Retire las cebollas fritas de la sartén y colóquelas en un plato para que se enfríen.", "Con un cuchillo afilado, corte las hojas de hojaldre a un tamaño apenas más pequeño que su bandeja para hornear. Coloque una hoja de hojaldre en la bandeja para hornear y cepille con un poco de mantequilla derretida, usando un cepillo de pastelería. Repita con cuatro hojas de filo más, cepillando con mantequilla sobre la marcha. Esta será la base del pastel. Cubra las cinco hojas restantes de filo pastelería con un paño limpio.", "Cuando la espinaca se haya enfriado, colócala en un tazón grande. Rallar con nuez moscada fresca y sazonar con sal y pimienta negra recién molida. Agregue las sultanas, las cebollas enfriadas y los piñones.", "Desmenuce el queso feta en la mezcla y mezcle bien. Batir los huevos juntos en un tazón limpio. Agregue un poco de la mezcla de huevo a la mezcla de espinacas. Agregue lo suficiente para que la mezcla esté húmeda pero no líquida (no puede usar todo el huevo batido).", "Para ensamblar el pastel, espolvoree la mezcla de espinacas y queso feta en la base de pasta filo preparada. Deje un \"marco\" vacío alrededor del borde de aproximadamente 4 cm / 1½ pulgadas a cada lado.", "Doble los cuatro bordes de la masa hacia adentro para encerrar el relleno.", "Para hacer la parte superior del pastel, recorte las cinco hojas restantes de pasta filo con el tamaño de la base con los bordes doblados. Cepille una de las hojas de filo con un poco de la mantequilla derretida restante y colóquela encima de la mezcla de espinacas y queso. Repita con las cuatro hojas restantes, cepillando con mantequilla derretida sobre la marcha.", "Cepille la capa superior de pasta filo con la última mantequilla derretida. Marque ligeramente la parte superior del pastel con un cuchillo afilado. Hornee en el horno precalentado durante 45-50 minutos, o hasta que la masa de la pasta filo tenga un color dorado intenso.", "Sirva rebanadas del pastel con una ensalada de rúcula."], "url": "www_bbc_co_uk_food_recipes_mediterraneanfilopas_90227", "title": "Pastel de filo mediterráneo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanfilopas_90227_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo sin hueso de corral, sin piel", "4 rebanadas finas de panceta", "12 hojas de albahaca fresca", "Queso Dolcelatte 110g / 4oz, cortado en 12 tiras", "4 tomates baby ciruela, cortados por la mitad", "2 cucharadas de aceite de oliva", "10 g / ½ oz de hongos porcini secos, empapados en agua hirviendo", "2 cucharadas de aceite de oliva", "1 cebolla pequeña, finamente picada", "1 diente de ajo, aplastado", "110 g / 4 oz de champiñones castaños, finamente picados", "Pasta de cebada 250 g / 9 oz", "500ml / 18fl oz de caldo de pollo", "1 cucharada de tomillo de limón fresco picado", "1 cucharada de jugo de limón", "50g / 2oz de queso parmesano, finamente rallado", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "1 bolsa de hojas de cohete, lavadas", "4 cucharadas de virutas de queso parmesano", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el rollo de pollo del Mediterráneo, corte una parte del camino a través de cada pechuga de pollo, luego abra cada pecho. Empareda cada uno entre dos hojas de película adhesiva y bate con un rodillo o similar hasta que tengan 5 mm de grosor.", "Coloque una rodaja de panceta sobre una superficie de trabajo limpia y coloque una de las pechugas de pollo encima.", "Coloque tres de las hojas de albahaca en el centro del pollo, luego cubra con tres rebanadas de Dolcelatte.", "Coloque una mitad de tomate ciruela en cada uno de los dos espacios entre el queso. Sazonar con sal y pimienta negra recién molida.", "Haga rodar el rollo de pollo por un extremo para formar un cilindro, asegurando con un palillo de cóctel si es necesario.", "Repita el proceso para cada una de las tres pechugas de pollo restantes.", "Caliente el aceite de oliva en una sartén a prueba de horno hasta que esté caliente, luego agregue los rollos de pollo y cocine por un minuto en cada lado, o hasta que estén doradas.", "Transfiera al horno por 15-20 minutos hasta que el queso burbujee y el pollo esté bien cocido. (El pollo se cuece cuando los jugos se vuelven transparentes cuando se perfora con un pincho).", "Para el champiñón orzo, escurra los champiñones y pique finamente.", "Calentar el aceite de oliva en una sartén hasta que esté caliente, luego agregar la cebolla y cocinar durante un minuto, hasta que se ablande.", "Agregue el ajo, los champiñones castaños y los hongos porcini y cocine durante un minuto más.", "Agregue la pasta orzo y mezcle hasta que esté bien combinada. Agregue el caldo de pollo, hierva a fuego lento, cubra con una tapa y cocine durante 5-8 minutos hasta que la pasta orzo haya absorbido el líquido y esté tierna.", "Retire la tapa, agregue el tomillo de limón, el jugo de limón y el parmesano y revuelva bien. Sazone al gusto con sal y pimienta negra recién molida.", "Para la ensalada de rúcula, mezcle el aceite de oliva y el vinagre balsámico en un tazón. Coloque las hojas del cohete en un recipiente para servir y vierta el aderezo sobre ellas. Espolvorear con virutas de parmesano y sazonar al gusto con sal y pimienta negra recién molida. Mezcle la ensalada de cohetes hasta que se combinen.", "Para servir, amontonar un poco de ensalada en cada plato de servir y espolvorear un poco de orzo de setas al lado. Cortar los rollos de pollo en rodajas gruesas y colocarlos en la parte superior del orzo."], "url": "www_bbc_co_uk_food_recipes_mediterraneanchicken_89440", "title": "Matambre de pollo mediterráneo con ensalada de rúcula y orzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chuletas de cordero magras o chuletas", "1 cucharada, menta fresca", "1 cucharada, romero fresco", "2 dientes de ajo", "2 cucharadas de aceite de oliva", "1 berenjena pequeña, en rodajas", "1 calabacín en rodajas", "1 pimiento rojo o amarillo, cortado en trozos grandes", "50g / 2oz de queso feta, desmenuzado", "250g / 9oz de tomates cherry"], "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 5.", "Con un mortero o una cuchara de madera y un tazón, machaca la menta fresca, el romero fresco y el ajo, luego mezcla con 1 cucharada de aceite de oliva. Unte más de cuatro chuletas de cordero o chuletas.", "Coloque la berenjena, el calabacín y la pimienta roja o amarilla en una bandeja para hornear. Rocíe con 1 cucharada de aceite de oliva y coloque las chuletas de cordero en la parte superior. Hornee en el horno durante 20-25 minutos.", "Cubra las chuletas con queso feta y agregue los tomates cherry a la sartén. Cocine por otros 10 minutos hasta que el queso empiece a dorarse.", "Sirva las chuletas con verduras asadas, pan de chapata tostado y ensalada de hojas mixtas."], "url": "www_bbc_co_uk_food_recipes_mediterraneanlambcho_14373", "title": "Chuletas de cordero mediterráneo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanlambcho_14373_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de oliva", "1 cebolla picada", "1 tallo de apio, finamente picado", "2 dientes de ajo picados", "2 cucharadas de puré de tomate", "2 x 400g / 14fl oz de latas de tomates picados", "1 ramita de canela", "100 ml / 3½ fl oz de caldo de pollo", "100 ml / 3½ fl oz de vino tinto", "sal y pimienta recién molida", "1 cucharada de aceite de oliva", "1 cebolla picada", "5 dientes de ajo picados", "450 g / 1 lb de carne de cerdo picada", "1 cucharada de albahaca fresca picada", "1 cucharadita de canela molida", "sal y pimienta recién molida", "aceite vegetal, para cepillar", "espagueti, cocinado de acuerdo con las instrucciones del paquete, para servir"], "method": ["Para la salsa de tomate, caliente el aceite en una sartén grande a fuego lento. Agregue la cebolla, el apio y el ajo y fría hasta que estén suaves, pero no coloreados.", "Agregue el puré de tomate y cocine durante unos minutos, luego agregue los tomates enlatados, canela, caldo y vino.", "Sazonar, al gusto, con sal y pimienta negra recién molida y llevar a ebullición, luego baje la temperatura muy baja.", "Cubra a medias la sartén con una tapa y deje la salsa a fuego lento durante una hora, revolviendo ocasionalmente.", "Si desea una salsa suave, transfiérala a un procesador de alimentos y mezcle la salsa, luego páselo por un colador fino antes de usar. De lo contrario, usar tal como es.", "Mientras tanto, para las albóndigas, caliente el aceite en una sartén a fuego medio.", "Agregue la cebolla y el ajo y fría hasta que se ablanden. Retirar del fuego y dejar enfriar ligeramente.", "Precalentar la parrilla a su configuración más alta.", "Coloque la carne picada de cerdo, la albahaca y la canela en un recipiente y agregue la cebolla cocida y el ajo. Sazone generosamente con sal y pimienta negra recién molida y mezcle bien.", "Enrolle pequeñas cantidades de la mezcla de carne picada en bolas. Esta cantidad de mezcla debe hacer 12-16 albóndigas, dependiendo del tamaño.", "Cepille las albóndigas con un poco de aceite y colóquelas en una bandeja para hornear.", "Coloque debajo de la parrilla para cocinar durante 6-8 minutos, volteándolos ocasionalmente y cepillándolos con un poco de aceite mientras se doran.", "Para servir, revuelva los espaguetis cocidos a través de la salsa y coloque sobre los platos con tres o cuatro albóndigas colocadas encima."], "url": "www_bbc_co_uk_food_recipes_mediterraneanporkmea_85971", "title": "Albóndigas de cerdo mediterráneas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla pequeña, finamente picada", "2 dientes de ajo pequeños, finamente picados", "2 x 400 g / 14 onzas de latas de tomates picados", "1 cucharada de pasta de tomate secada al sol", "1 hoja de laurel", "1 cucharadita de tomillo seco", "1 cucharadita de albahaca seca", "1 cucharadita de orégano seco", "1 cucharadita de perejil seco", "½ cucharadita de sal, o al gusto", "½ cucharadita de azúcar moreno", "pimienta negra recién molida", "1 berenjena", "2 calabacines", "2 pimientos rojos, sin semillas", "2 dientes de ajo, pelados", "2-3 cucharadas de aceite de oliva", "12 tomates maduros pequeños", "Formas de pasta de 500 g / 1 lb 1 oz, como lirios, caracoles o caracoles", "Queso parmesano 100 g / 3½ oz (opcional)"], "method": ["Para la salsa, caliente el aceite en una sartén. Agregue las cebollas y fría hasta que estén suaves pero no doradas. Agregue el ajo y fría por un minuto.", "Agregue los ingredientes restantes de la salsa y deje que hierva. Reduzca el fuego y cocine a fuego lento durante aproximadamente una hora. Verifique el condimento y agregue más sal y pimienta negra recién molida, si es necesario.", "Para las verduras, precaliente el horno a 180C / 355F / Gas 4.", "Picar la berenjena, los calabacines y los pimientos rojos en trozos de 2,5 cm / 1 in y colocar en una lata de asar con los dientes de ajo enteros. Rocíe con el aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida. Mezcle las verduras para cubrir en el aceite de oliva. Asar en el horno, revolviendo ocasionalmente, durante 45 minutos, o hasta que se torne suave dorado. Agregue los tomates a la lata de asar durante los últimos 20 minutos de tiempo de cocción.", "Cuando esté listo para servir, cocine la pasta de acuerdo con las instrucciones del paquete. Escurra bien la pasta y remueva la salsa.", "Divida uniformemente entre cuatro platos para servir y cubra con los vegetales tostados. Rallar sobre el queso parmesano y servir con pan crujiente o bruschetta en el lateral."], "url": "www_bbc_co_uk_food_recipes_mediterraneanpasta_88410", "title": "Pasta mediterránea", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de menta fresca picada", "1 cucharadita de romero fresco finamente picado", "3 dientes de ajo", "2 cucharadas de aceite de oliva", "4 chuletas de cordero magras o chuletas", "1 berenjena, en rodajas", "4 calabacines en rodajas", "2 pimientos rojos, cortados en trozos grandes", "2 pimientos amarillos, cortados en trozos grandes", "85g / 3oz de queso feta, desmenuzado", "250g / 9oz de tomates cherry", "ensalada de hojas mixtas"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Usando un mortero o un procesador de alimentos, mezcle la menta, el romero y el ajo, luego agregue una cucharada de aceite de oliva. Unte la mezcla de hierbas sobre las chuletas de cordero.", "Coloque la berenjena, el calabacín y los pimientos en una bandeja para hornear. Rocíe con el aceite de oliva restante y coloque las chuletas de cordero en la parte superior. Coloque en el horno para asar durante 20-25 minutos.", "Retira del horno y completa las chuletas con el queso feta y agrega los tomates cherry a la bandeja. Vuelva al horno por otros 10 minutos hasta que el queso empiece a dorarse y las chuletas de cordero estén recién cocidas.", "Sirva las chuletas con las verduras asadas y la ensalada de hojas mixtas."], "url": "www_bbc_co_uk_food_recipes_mediterraneanstylela_83720", "title": "Chuletas de cordero de estilo mediterráneo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mediterraneanstylela_83720_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "¼ de cebolla roja picada", "4 tomates tomados por el sol, picados", "100 g / 3½ oz de alcachofas asadas (de un tarro), escurridas y picadas", "2 cucharadas de aceitunas negras, hoyos eliminados", "pequeño puñado de hojas frescas de salvia picadas", "sal y pimienta negra recién molida", "125g / 4½oz de tallarines frescos", "parmesano rallado (o un queso duro vegetariano similar), para servir"], "method": ["Calentar el aceite de oliva en una olla pequeña, agregar la cebolla y freír suavemente durante cuatro minutos, o hasta que esté blanda pero no coloreada. Agregue los tomates tomados por el sol, las alcachofas asadas y las aceitunas negras y fría por 1-2 minutos. Agregue las hojas de salvia y sazone, al gusto, con sal y pimienta negra recién molida.", "Cocine los tallarines de acuerdo con las instrucciones del paquete y escurra, dejando un poco del líquido de cocción en el fondo de la sartén. Regrese a la sartén, agregue la salsa y revuelva para cubrir.", "Poner en un bol y servir con queso parmesano rallado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_mediterraneanstylepa_88356", "title": "Pasta de estilo mediterráneo con tomates al sol, alcachofas y aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ calabacín amarillo, en rodajas", "½ berenjena, en rodajas", "sal y pimienta negra recién molida", "125g / 4½oz de polenta de cocción rápida", "250ml / 9fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "pizca de copos de chile seco", "2 cucharaditas de Romero fresco picado", "sal y pimienta negra recién molida", "aceite de oliva, para lloviznar", "2 cucharadas de aceite de oliva", "1 tomate, picado", "pequeño puñado de albahaca fresca, picada", "sal y pimienta negra recién molida", "exprimir jugo de limón"], "method": ["Para la pila de verduras, frote el calabacín y las rodajas de berenjena con el aceite de oliva y sazone con sal y pimienta negra recién molida. Caliente una sartén hasta que esté caliente y pique al calabacín y las rebanadas de berenjena durante 2-3 minutos por cada lado, o hasta que estén blandos y ligeramente carbonizados. Apartar y mantener caliente.", "Para la polenta a la brasa, coloca la polenta y el caldo en una olla pequeña. Agregue los copos de chile, el romero y el condimento y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos, o hasta que todo el caldo haya sido absorbido y la polenta ya no tenga granos.", "Engrase ligeramente una pequeña lata para asar y vierta la polenta. Dejar enfriar, luego colocar en la nevera para enfriar y configurar. Cuando esté listo, corte la polenta en tres cuadrados de igual tamaño.", "Frote los cuadrados con aceite de oliva, caliente la sartén de la plancha y cocine los cuadrados de la polenta durante 1-2 minutos en cada lado, hasta que queden ligeramente carbonizados.", "Para la salsa vierge, coloque todos los ingredientes vierge de salsa en un tazón y mezcle bien.", "Para servir, coloque un cuadro de polenta a la brasa en un plato para servir y cubra con las rodajas de calabacín a la parrilla. Coloque otra capa de polenta en la parte superior, luego las rodajas de berenjena, seguido del cuadrado final de la polenta. Vierta la salsa vierge alrededor del plato."], "url": "www_bbc_co_uk_food_recipes_mediterraneanvegetab_86234", "title": "Pila de verduras mediterráneas con polenta a la brasa y salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo, picado", "50g / 1¾oz de aceitunas negras, piedras removidas", "2 cucharadas de aceite de oliva", "2 tomates, picados", "1 puñado de perejil fresco", "1 puñado de albahaca fresca, desgarrada", "1 cucharadita de vinagre balsámico", "1 cucharada de aceite de oliva"], "method": ["Para la tapenade, coloque el ajo, las aceitunas y el aceite en un mini procesador de alimentos y mezcle hasta que quede suave.", "Para la ensalada de estilo mediterráneo, coloque todos los ingredientes de la ensalada en un tazón y mezcle bien.", "Para servir, coloque la ensalada en un plato con la tapenade rociada."], "url": "www_bbc_co_uk_food_recipes_mediterraneanstylesa_85106", "title": "Ensalada de estilo mediterráneo con tapenade", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra 2 onzas de naranjas de Sevilla", "50ml / 2 fl oz jugo de limón", "1kg / 2lb 4 oz de azúcar blanco: regular, no con pectina añadida", "azúcar morena oscura, opcional"], "method": ["Pese las naranjas y tome nota del peso, ya que esto le indicará la cantidad de otros ingredientes que necesitará para asegurarse de que la mermelada se prepare bien. Mi relación básica es: tanto el azúcar como el líquido filtrado de las naranjas rebanadas y hervidas a fuego lento deben ser aproximadamente el doble del peso de las naranjas enteras crudas. Entonces, si comienzas con 500 g / 1 lb 2 onzas de naranjas enteras, después de cocinar quieres quedarte con un litro / 1 ¼ de líquido una vez que las cáscaras se hayan filtrado, y necesitas 1 kg / 2 lb 4 oz de azúcar.", "Corte las naranjas por la mitad y exprima el jugo, ya que esto hace que cortar la cáscara sea menos complicado. Retire las pepitas del jugo, saque las pepitas restantes de la cáscara, colóquelas en una taza de té y cúbralas con agua. A continuación, corta la cáscara en trozos de aproximadamente 0,25 cm / ⅛ pulgadas de ancho y colócalos en un bol con el jugo y cúbrelos con agua. Deja ambos durante la noche, ya que esto ayudará a que la mermelada se prepare bien.", "Al día siguiente, coloque la cáscara y el agua en una olla. Tamiza las pepitas, coloca el agua de remojo (que se habrá gelatinizado ligeramente) en la cacerola, luego ata las pepitas en muselina y colócalas en la olla. Llevar a ebullición a fuego lento durante 2-3 horas, rellenando con agua para que la fruta quede bien cubierta, hasta que la cáscara esté suave cuando se aplasta entre los dedos. Alternativamente, cocine en una olla a presión durante aproximadamente 30 minutos.", "Saca el jugo de la cáscara y mídelo. Cualquiera que sea el peso original de la fruta al principio, usted quiere aproximadamente el doble que en el líquido para cocinar. Por lo tanto, si comenzó con 500g / 1lb de 2 oz de fruta, intente obtener aproximadamente un litro / 1¾ pinta (es decir, 1000 ml o 1000 g) de líquido de cocción. Si tiene más, hiérvalo en una sartén para intensificarlo. Si tiene menos, rellénelo con agua para diluirlo.", "A continuación, agregue el azúcar (el doble del peso de las naranjas), más 1-2 cucharadas de azúcar moreno si desea que el color sea más oscuro. Agregue la cáscara colada, más 50 ml / 2 onzas líquidas de jugo de limón por cada 500 g / 1 libra de naranjas enteras sin cocer de 2 onzas utilizadas. Llevar a ebullición, quitar toda la espuma blanca y las pepitas que suban a la superficie, y luego hervir hasta que la temperatura alcance 105 ° C / 220 ° F.", "Mientras tanto, esterilice suficientes jarras en el horno y tenga las tapas lavadas y listas. Cuando la mermelada alcance los 105 ° C / 220 ° F, apague el fuego y déjelo actuar durante 10 minutos. Vierte la mermelada en una jarra y luego vierte esto cuidadosamente en los frascos, dejando solo un espacio vacío de 0.5cm / ¼ en la parte superior. Enrosque la tapa con fuerza y ​​deje sin tocar hasta que esté completamente fría."], "url": "www_bbc_co_uk_food_recipes_medium-cut_seville_70291", "title": "Mermelada de naranja de Sevilla de corte medio", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 3-4 frascos de 450g / 1lb", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medium-cut_seville_70291_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina de auto crianza tamizada, más extra para enharinar", "100g / 3½oz de mantequilla, a temperatura ambiente, cortada en pequeños cuadrados, más extra para engrasar", "40 g / 1½ oz de azúcar en polvo", "pizca de sal marina copos", "300ml / 10fl oz de leche entera", "1 cucharada de crema", "Fechas Medjool, cortadas en trozos (al gusto)", "nueces, tostadas y picadas (al gusto)", "Mermelada de fresa", "nata"], "method": ["Precaliente el horno a 220 ° C / 425 ° F / Gas 6 y engrase y caliente una bandeja para hornear.", "Ponga la harina en un tazón grande, agregue la mantequilla y frótela en la harina para hacer migas de pan. Agregue el azúcar y la sal y mezcle.", "Vierta la leche gradualmente y mezcle, reservando algunas cucharadas para un glaseado. Mezcle la crème fraîche hasta que esté bien combinada.", "Agregue las fechas y las nueces, al gusto, asegurándose de que estén uniformemente dispersas.", "Llenar ligeramente una superficie de trabajo limpia y extender la masa de bollo a un grosor de 2,5 cm / 1 pulgada y utilizar un cortador de pastel redondo para cortar seis bollos. Vuelva a enrollar los recortes para hacer más bollos, pero tenga cuidado de no sobrecargar la masa.", "Coloque los bollos en la bandeja de horneado preparada y hornee por 15-20 minutos, o hasta que estén dorados y dorados.", "Sirva con mermelada de fresa de buena calidad y crema cuajada."], "url": "www_bbc_co_uk_food_recipes_medjool_date_and_walnut_11732", "title": "Medjool date y scones de nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6 bollos grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ onzas de mantequilla, suavizadas", "120 g / 4½ oz de azúcar en polvo de oro", "2 yemas de huevo de gallinas camperas", "½ naranja grande, ralladura fina solamente", "½ limón no encerado, ralladura fina únicamente", "Harina normal de 250g / 9oz, más extra para espolvorear", "½ cucharadita de especias mixtas", "¼ cucharadita de jengibre molido", "¼ cucharadita de canela molida", "¼ naranja, ralladura fina solamente", "¼ lima, ralladura finamente rallada solamente", "¼ de limón sin cebar, ralladura finamente rallada solamente", "50 g / 1 oz de azúcar en polvo", "Frambuesas 150g / 5½ oz", "100 g / 3½ oz de azúcar en polvo", "1 limón, solo jugo", "1 clementina, segmentada", "½ piña, bola con una cuchara parisina", "50g / 1¾oz de moras, cortadas a la mitad", "50g / 1¾oz de semillas de maracuyá", "50g / 1¾oz de uvas negras sin semillas, cortadas a la mitad", "50g / 1¾oz de semillas de granada", "1 pera, pelada y en forma de bola usando una primicia parisina", "champán", "pequeñas hojas de menta fresca, para decorar"], "method": ["Para hacer los bizcochos, precaliente el horno a 200C / 180C Fan / Gas 6.", "Batir la mantequilla y el azúcar en un bol hasta que estén pálidos y cremosos. Poco a poco, bata las yemas de huevo hasta que estén completamente incorporadas, luego bate en el resto de los ingredientes.", "Estirar la masa sobre una superficie ligeramente enharinada hasta aproximadamente 5 mm / ¼ de grosor. Corta los bizcochos con un cortador de 6cm / 2in y colócalos en una bandeja para hornear antiadherente, volviendo a enrollar y cortando cualquier recorte. Transfiera los bizcochos a la nevera hasta que estén firmes.", "Para hacer el azúcar cítrico, mezcle las zests con el azúcar en un tazón pequeño hasta que se combinen.", "Hornee los bizcochos por 8-10 minutos o hasta que comiencen a dorarse. Espolvoree los bizcochos calientes con el azúcar cítrico y déjelos enfriar sobre una rejilla de alambre.", "Para hacer la mezcla de frutas, mezcle las frambuesas con el azúcar y el jugo de limón en un procesador de alimentos, luego páselos por un colador.", "Divida el puré entre cuatro vasos para servir, cubra con una mezcla de las frutas y decore con hojas de menta.", "Delante de los invitados, abren el Champagne y vierten sobre la parte superior del plato. Sirva con los bizcochos con especias de cítricos."], "url": "www_bbc_co_uk_food_recipes_medley_of_fruit_with_82189", "title": "Mezcla de frutas con galletas con especias cítricas y Champagne", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pescados y mariscos mixtos de 550 g / 19½ oz (como el bacalao, el salmón y las gambas)", "40 g / 1½ oz de mantequilla", "½ cucharada de ajo picado", "4 cucharadas de cebollas de primavera, finamente picadas", "120ml / 4½fl oz de vino blanco seco", "1 cucharadita de ralladura de limón", "½ cucharadita de sal", "1 x 400 g / 14¼ oz puede cortar tomates, con los jugos", "algunas gotas de salsa Tabasco (opcional) o salsa de chile", "1 cucharada de perejil picado", "1 cucharada de cebollino picado", "1 cucharada de eneldo picado", "unas ramitas de varias hierbas, para adornar"], "method": ["Lave el pescado y córtelo en pedazos de 5cm. Lave las gambas y quite las conchas.", "Derrita 20 g (¾oz) de mantequilla en una sartén grande. Agregue el ajo y fría hasta que comience a colorear.", "Agregue los mariscos, las cebolletas, el vino blanco y la ralladura de limón.", "Cubra y cocine a fuego lento durante dos minutos.", "Retire la tapa y agregue los tomates, la salsa de Tabasco y las hierbas.", "Cocine a fuego lento por solo dos minutos más.", "Apague el fuego y agregue la mantequilla restante.", "Sirva inmediatamente en cuencos calientes, adornado con unas ramitas de hierbas."], "url": "www_bbc_co_uk_food_recipes_medleyofseafoodwithh_72992", "title": "Mariscos con hierbas y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "200 g / 7 oz de mantequilla, cortada en cubos pequeños", "100g / 3½oz de azúcar glasé", "pizca de sal", "2 yemas de huevo de gallinas camperas", "4 cucharadas de mermelada de frambuesa", "4 cucharadas de mermelada de albaricoque"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Coloque la harina, la mantequilla, el azúcar glas y la sal en un tazón. Con las puntas de los dedos, frote los ingredientes hasta que la mezcla se asemeje a pan rallado.", "Agregue las yemas de huevo y mezcle hasta que se forme una masa. Dé vuelta a una superficie de trabajo ligeramente enharinada y extiéndala a un espesor de aproximadamente 0.5 cm / ¼ in. Recorte las formas con un cortador de 4 cm / 1½ pulgadas.", "Divida los sables por la mitad. Con un cortador acanalado de 2 cm / 1 in, haga un agujero en el medio de la mitad de los bizcochos de sable y deseche la masa. Coloque todos los sables en una bandeja para hornear.", "Hornee los sables por 10-12 minutos o hasta que estén dorados y crujientes. Retire y transfiera a una rejilla para enfriar.", "Usando una cucharilla, coloque una pequeña cucharada de mermelada de frambuesa sobre un sable entero. Coloque un sable (con un agujero) sobre toda la galleta de marta. Repita hasta que la mitad de los sables estén hechos con mermelada de frambuesa, luego repita el proceso, usando mermelada de albaricoque, para los sables restantes."], "url": "www_bbc_co_uk_food_recipes_medley_of_mini_sables_84193", "title": "Galletas de mantequilla rellenas de mermelada (sables)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/medley_of_mini_sables_84193_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 dientes de ajo", "3 chiles verdes con los dedos", "Jengibre de raíz de 5cm / 2in, pelado", "3 cucharadas de aceite de cacahuete", "1 cebolla pequeña, finamente rebanada", "5-6 hojas de curry", "¼ cucharadita de cúrcuma molida", "¼ cucharadita de sal", "200ml / 7fl oz de leche de coco", "155ml / 6fl oz de agua hirviendo", "Filetes de abadejo de 500 g / 1 lb 2 oz, cortados en piezas de 4 cm / 2 pulgadas de ancho", "2 tomates medianos, picado grueso", "arroz basmati"], "method": ["Coloque el ajo, los chiles y el jengibre juntos en un procesador de alimentos y procese hasta que quede suave.", "Calentar el aceite en una sartén o wok y freír la cebolla con las hojas de curry durante cuatro minutos a fuego medio.", "Agregue la mezcla de ajo, chile y jengibre con la cúrcuma y la sal. Freír durante dos minutos, luego agregar 100ml / 3½fl oz de leche de coco con 155ml / 6fl oz de agua hirviendo.", "Cocine a fuego lento durante dos minutos y luego agregue las piezas de pescado y cocine a fuego lento durante 5-6 minutos.", "Agregue la mitad del tomate y la leche de coco restante y cocine a fuego lento durante 3-4 minutos.", "Adorne con el resto del tomate picado.", "Sirve con arroz basmati."], "url": "www_bbc_co_uk_food_recipes_meenmoleefishcurryco_77185", "title": "Meen molee (curry de pescado cocinado en coco)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 450g / 16oz de suela de gallo o de Cornualles", "Harina común 110g / 4oz", "sal y pimienta negra recién molida", "50ml / 2fl oz de aceite vegetal", "botón de mantequilla", "Col rizada de 150g / 5oz, cortada en bastones de 5cm / 2in", "2 limones", "125 g / 4½ oz de mantequilla", "Chalote de 60 g / 2 oz, finamente picado", "1 cucharadita de macis", "½ cucharadita de pimienta de cayena", "2 cucharaditas de condimentos para caballeros", "Camarones marrones 90 g / 3½ oz", "sal y pimienta negra recién molida", "exprimir jugo de limón", "1 brotes de guisantes, para adornar"], "method": ["Para la suela, precalentar el horno a 230C / 450F / Gas 8.", "Pídele a tu pescadero que quite la piel oscura del gallo. Puedes hacerlo tú mismo cortando la cola del pez en ángulo y raspando suavemente la piel. Con una toalla de cocina seca, tire de la piel desde la cola hacia la cabeza, y todo debe alejarse.", "Corta la cabeza y usa unas tijeras afiladas, corta el borde del pez y quita las aletas. Lave el pescado y seque.", "Espolvoree la harina en un plato y sazone con sal y pimienta negra recién molida.", "Polvo de pescado en la harina en cada lado.", "Caliente una sartén antiadherente a prueba de horno a fuego alto y vierta el aceite vegetal.", "Coloque el pescado en la sartén, con la piel blanca hacia abajo, y fría por 2-3 minutos, o hasta que esté pálido dorado. Dale la vuelta al pescado con una espátula.", "Agregue un pomo de mantequilla y colóquelo en el horno para cocinar por 6-7 minutos.", "Mientras tanto, para la mantequilla de camarón, cocine la col rizada en una sartén de agua hirviendo con sal durante 2-3 minutos, o hasta que esté tierna. Drene y renueve en agua helada, luego drene una vez más y seque.", "Pele el limón, quite la médula raspando suavemente con un cuchillo (intente no perforar la carne del limón) y corte en rondas (estas son sus flores de limón).", "Calentar una sartén hasta que esté caliente, agregar la mantequilla y la chalota y freír durante 2-3 minutos. Agregue la maza, la pimienta de cayena y el condimento de los caballeros y revuelva hasta que estén bien combinados. Agregue las gambas y la col rizada, retire la sartén del fuego y manténgala caliente.", "Sazonar con sal y pimienta negra recién molida y un chorrito de jugo de limón.", "Para servir, coloque la suela en el centro de un plato de servir grande. Cuchara sobre la mezcla de camarones, cruzando los bastones de la col rizada de mar sobre la parte superior de los peces. Exprime dos rodajas de limón y luego espolvorea con brotes de guisantes."], "url": "www_bbc_co_uk_food_recipes_megrim_sole_with_shrimp_07093", "title": "Megrim único con mantequilla de camarón, col rizada y flores de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 berenjenas grandes o 3 pequeñas, cortadas en rodajas de 5 mm / ¼ de pulgada", "4 cucharadas de aceite de oliva", "6-7 hojas de lasaña seca", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla, más extra para engrasar", "50g / 1¾oz de harina natural", "568ml / 1 pinta de leche, calentada", "1 cucharadita de mostaza Dijon", "100g / 3½ oz de parmesano (o una alternativa vegetariana similar), rallado", "2 dientes de ajo, aplastados", "1 x 400 g de tomate picado", "Pase de 500ml / 18fl oz", "1 manojo de albahaca, picado", "2 cucharaditas de azúcar en polvo"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase un plato a prueba de horno de 2,5 litros / 4½ pinta con mantequilla y alinee dos bandejas para hornear con papel de hornear antiadherente.", "Coloque las rodajas de berenjena en una sola capa en las bandejas preparadas. Rocíe el aceite y sazone con sal y pimienta. Asar durante 20-25 minutos girando las rebanadas a la mitad del tiempo de cocción. Dejar de lado.", "Coloque las hojas de pasta en un plato y cúbralas con agua caliente durante 10 minutos para ablandarlas.", "Para hacer la salsa bechamel, caliente la mantequilla en una olla. Una vez derretido, espolvorear en la harina y batir durante unos minutos a fuego alto para formar un roux. Vierta la leche caliente en el roux y bata. Llevar a ebullición, batiendo durante unos minutos hasta que quede suave. Agregue la mostaza y dos tercios del parmesano. Sazone con sal y pimienta y revuelva. Dejar de lado.", "Para hacer la salsa de tomate, ponga todos los ingredientes en un tazón. Condimentar con sal y pimienta.", "Para ensamblar, vierta un tercio de la salsa de tomate en la base del plato preparado, cubra con un tercio de la bechamel. Disponga un tercio de las berenjenas en la parte superior y 3-3½ hojas de lasaña (puede que necesite romper la lasaña en trozos para que quepa en una capa uniforme). Repita para que tenga tres capas de salsa y dos capas de pasta, espolvoree con el queso parmesano restante.", "Deje reposar durante 1 hora antes de cocinar o durante la noche.", "Hornee durante 35-45 minutos hasta que estén dorados y burbujeantes. De pie por 5 minutos antes de servir. Servir caliente con pan de ajo."], "url": "www_bbc_co_uk_food_recipes_melanzane_pasta_59215", "title": "Pasta de berenjena", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/melanzane_pasta_59215_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ melón, sin semillas y cortado en trozos pequeños", "50g / 1¾oz de hojas de cohete", "2 hojas de escarola, cortadas en julianas delgadas", "1 cucharada de aceite de oliva", "3 tomates secados al sol", "2 rebanadas de jamón de Parma", "4 hojas de escarola, cortadas en formas de media longitud", "1 cucharadita de vinagre balsámico", "sal y pimienta negra recién molida, al gusto"], "method": ["En un tazón grande mezcle el melón, el cohete y la endibia en el aceite de oliva.", "Transfiera a un plato y agregue los tomates secados al sol y el jamón de Parma.", "Coloque las ocho mitades de hojas de endibia alrededor de la ensalada, apuntando hacia afuera.", "Rocíe con el vinagre balsámico y sazone al gusto."], "url": "www_bbc_co_uk_food_recipes_melonandparmahamsala_78028", "title": "Ensalada de jamón y parma", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ lima, solo jugo", "1 cucharada de miel líquida", "1 cucharada de hojas de menta fresca", "½ melón cantalope, pequeñas rondas cortadas con un melón baller, la piel dejada como un \"tazón\" completo", "50g / 1¾oz de nueces enteras", "sal y pimienta negra recién molida"], "method": ["Coloque el jugo de lima, la miel y la menta en un procesador de alimentos pequeño y mezcle hasta que quede suave.", "Vierta la mezcla en un bol, agregue las bolas de melón y las nueces y mezcle bien para cubrir.", "Para servir, vierta la mezcla en el cuenco vacío de la cáscara de melón."], "url": "www_bbc_co_uk_food_recipes_meloncocktail_83623", "title": "Cóctel de melón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]