[{"isVegetarian": false, "title": "Venison alla Milanese with roasted butternut squash and herb pesto", "url": "www_bbc_co_uk_food_recipes_venisonallamilanesew_89977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp fresh white breadcrumbs", "2 tbsp chopped fresh parsley", "1 tbsp chopped fresh thyme leaves", "pinch chilli flakes", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 tbsp butter", "85g/3oz venison, flattened out with a meat mallet or rolling pin", "1 free-range egg, beaten", "½ butternut squash, peeled and chopped", "3 tbsp olive oil", "salt and freshly ground black pepper", "4 tbsp olive oil", "2 tbsp chopped fresh parsley", "2 tbsp chopped fresh basil ", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the venison alla Milanese, place the breadcrumbs, herbs, chilli flakes and salt and freshly ground black pepper into a food processor and pulse until just combined. ", "Heat the olive oil and butter in a frying pan. Dip the venison into the beaten egg, then coat in the breadcrumb mixture and fry for 3-4 minutes on each side, or until golden-brown and cooked through.  ", "For the roasted squash, blanch the squash in a pan of boiling salted water for 4-5 minutes, then drain. Transfer to a roasting tin, drizzle over the olive oil and season well with salt and freshly ground black pepper. Place into the oven to roast for 10-12 minutes, or until golden and tender.", "For the herb pesto, place all of the pesto ingredients into a food processor and blend until smooth.", "To serve, place the venison on a serving plate and spoon the roasted squash alongside. Drizzle the herb pesto around the edges of the plate to garnish."]}, {"isVegetarian": false, "title": "Venison and glazed onion pies with balsamic gravy", "url": "www_bbc_co_uk_food_recipes_venisonandglazedonio_85858", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz flour, plus extra for dusting", "100g/3½oz butter", "2 free-range eggs, plus one extra, beaten, for brushing", "2 tbsp water", "1 tbsp olive oil", "½ red onion, chopped", "1 garlic clove, chopped", "200g/7oz venison fillet, cut into bite-sized pieces", "6 tbsp red wine", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper ", "1 tbsp dark chocolate, grated", "sprigs fresh rosemary, to garnish"], "serves": "Makes 2 small pies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the pastry, place the flour, butter, two of the eggs and the water into a food processor and pulse until the mixture comes together to form a dough.", "On a lightly floured surface, roll out the dough to 0.5cm/¼in thick and cut out two circles to fit over a small ovenproof dish.", "Place the discs onto a non-stick baking sheet and brush with beaten egg. Transfer to the oven and bake for 8-10 minutes, or until lightly golden-brown.", "For the filling, heat the oil in a frying pan and gently fry the onion until softened but not coloured. Add the garlic and cook for one minute.", "Add the venison and cook, stirring frequently, until browned all over.", "Add the wine and vinegar and simmer until reduced by half. Season with salt and freshly ground black pepper, add the chocolate and stir until melted.", "Divide the filling between two small ovenproof dishes and top each one with a pastry disc.", "Transfer to the oven and bake for ten minutes, or until the pastry is crisp and golden-brown and the filling is cooked through.", "To serve, place the pies onto plates and garnish with a sprig of rosemary."]}, {"isVegetarian": false, "title": "Venison casserole", "url": "www_bbc_co_uk_food_recipes_venisoncasserole_83746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/venisoncasserole_83746_16x9.jpg", "ingredients": ["1 tbsp olive oil", "25g/1oz butter", "2 onions, diced", "4 garlic cloves, crushed", "4 rashers smoked bacon, chopped", "500g/1Ib 2oz chestnut mushrooms, halved", "2.5kg/5½lb haunch or shoulder of venison, diced", "½ bottle red wine", "400ml/14fl oz water", "2 beef stock cubes, crumbled", "3 tbsp redcurrant jelly", "salt and freshly ground black pepper, to taste", "50g/2oz cornflour", "punnet redcurrants, to decorate", "6 sprigs rosemary or thyme, to decorate", "new potatoes ", "wilted spinach"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "On the hob, heat the olive oil and butter in a large lidded casserole dish. Add the onions and cook until softened, but not browned. ", "Add the garlic, bacon and mushrooms and cook for a further minute. ", "In a frying pan, brown the venison a handful at a time and add to the casserole. When all the meat is browned, add the red wine, water, stock cubes, redcurrant jelly and salt and pepper.", "Bring to the boil and stir well. Put the lid on the casserole and place in the middle of the oven - cook for 90 minutes.", "Remove from the oven. Make a paste with the cornflour and two tablespoons of water. Add as much of the paste to the casserole as is needed to thicken the sauce - add a little at a time if you are not sure how much you will need.", "Transfer the casserole to the hob, and, on a low heat, cook until the gravy has thickened - this will take about five minutes.", "Serve with new potatoes and wilted spinach. Decorate each plate with a sprig of rosemary or thyme and a bunch of fresh redcurrants."]}, {"isVegetarian": false, "title": "Venison chilli", "url": "www_bbc_co_uk_food_recipes_venisonchilli_86999", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "450g/1lb venison shoulder, trimmed and cut into large pieces", "1 onion, finely chopped", "1 red pepper, chopped", "1 green pepper, chopped", "1 stick celery, chopped", "8-10 red chillies, chopped", "250g/8½oz mushrooms, sliced", "1 garlic clove, crushed", "1 tbsp tomato purée", "pinch ground cumin", "pinch ground paprika", "150ml/5fl oz game or beef stock", "125ml/4½fl oz red wine", "400g/14oz canned chopped tomatoes", "salt and freshly ground black pepper", "50g/1¾oz dark chocolate, grated", "plain rice, cooked according to packet instructions", "4 soft flour tortillas"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a non-stick frying pan until hot and add the venison. Fry the meat for a few minutes on each side, until golden-brown all over. Remove the venison from the pan and set aside to keep warm.", "In the same frying pan, add the onions, red and green peppers, celery, red chillies, mushrooms and garlic and fry until the vegetables are soft but not coloured.", "Add the tomato purée to the pan, then turn down the heat and gently fry for a further ten minutes. ", "Add the spices, stock, red wine and canned chopped tomatoes to the pan and bring to the boil. ", "Return the venison to the pan and add the grated chocolate. Reduce the heat to very low and simmer for one hour, or until the venison is tender.", "To serve, place the venison chilli onto plates. Spoon some plain rice alongside and serve with the soft flour tortillas."]}, {"isVegetarian": false, "title": "Venison kebabs", "url": "www_bbc_co_uk_food_recipes_venisonkebabs_79138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 venison sausages, skin removed", "6 prunes", "3 wooden skewers ", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6.", "Start by rolling the venison meat into nine small balls. ", "Take a skewer and alternately place a venison ball then a prune; each skewer should have three venison balls and two prunes.", "Heat a frying pan add the oil and gently brown the kebabs.", "Place into the preheated oven for six minutes and serve."]}, {"isVegetarian": false, "title": "Venison meatballs", "url": "www_bbc_co_uk_food_recipes_venisonmeatballs_89798", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "125ml/4fl oz milk", "450g/1lb minced venison steak", "200g/7oz breadcrumbs", "75g/3oz parmesan, grated ", "1 garlic clove, finely chopped", "1 tbsp vegetable oil", "1 tbsp vegetable oil", "1 onion, finely chopped", "1 carrot, finely chopped", "1 stick celery, finely chopped", "4 garlic cloves, finely chopped", "150g/5oz tomato purée", "450ml/¾ pint red wine", "450ml/¾ pint chicken stock", "2 sprigs fresh rosemary", "spaghetti, cooked according to packet instructions", "parmesan, freshly grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the meatballs, beat the eggs and milk together in a bowl. Add the minced venison, breadcrumbs, parmesan and garlic and mix well.", "Mould the meatball mixture into balls, each the size of a golf ball.", "Place the meatballs onto a plate or tray and chill in the fridge for 20 minutes.", "Heat the oil in a frying pan over a medium heat.", "Remove the meatballs from the fridge and place into a hot frying pan. Fry for 8-10 minutes, or until golden-brown all over.", "For the ragu, heat the oil in a separate frying pan. Fry the onion, carrot, celery and garlic for 5-6 minutes, or until softened. ", "Add the tomato purée and cook for a further 7-8 minutes, until the sauce is thick and deep red in colour.", "Add the wine, chicken stock and rosemary and bring to boil. Reduce the heat and simmer for 45 minutes to an hour. ", "Add the meatballs to the sauce and simmer for 5-6 minutes, until the meatballs are completely cooked through.", "To serve, place a generous portion of cooked spaghetti into each serving bowl. Spoon over equal amounts of the meatballs and sauce, and finish with grated parmesan."]}, {"isVegetarian": false, "title": "Venison with blueberries", "url": "www_bbc_co_uk_food_recipes_venisonwithblueberri_86030", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz blueberries", "3 tbsp white wine or sherry", "pinch sugar", "½ tbsp balsamic vinegar", "2 tbsp orange juice", "salt and freshly ground black pepper", "1 tsp butter", "knob butter ", "1 tsp olive oil", "2 venison steaks"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, set aside 4-6 blueberries for garnish and place the remaining blueberries in a small heavy-based pan with the wine or sherry and sugar. ", "Simmer over a low heat for about ten minutes, until the blueberries reach a mushy consistency. Add the vinegar, orange juice and salt and freshly ground black pepper to taste. Stir in the butter and keep the sauce warm.", "While the sauce is simmering, prepare the venison. In a frying pan, melt the butter and oil over a medium heat and add the venison to the pan. Fry the venison for 3-5 minutes on each side, until cooked to your liking. Leave the venison to rest in a warm place for at least five minutes before serving.", "Place the venison steaks on two plates, spoon over the sauce and garnish with the remaining blueberries. Serve straightaway."]}, {"isVegetarian": true, "title": "Versatile vegetable stew", "url": "www_bbc_co_uk_food_recipes_versatile_vegetable_stew_50136", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/versatile_vegetable_stew_50136_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, finely diced", "2 leeks, split lengthways up to the root several times, washed under running cold water then sliced thickly", "2 carrots, cut into 1cm/½in dice", "2 garlic cloves, finely diced", "1 tsp sweet smoked paprika", "½ tsp dried thyme", "2 potatoes, peeled, cut into 1cm/½in dice", "600ml/21fl oz vegetable stock", "½ head cauliflower, cut into small florets", "200g/7oz fine green beans, cut into 2cm/¾in pieces", "1 x 400g/14oz tin baked beans", "2 tbsp roughly chopped flatleaf parsley", "crusty bread, to serve", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan or saucepan until medium hot, add the olive oil, onion and leeks and cook gently for 5 minutes until just softened.", "Add the carrots, garlic, paprika and thyme and stir to combine. Cook for 5 minutes.", "Add the potatoes and vegetable stock and bring to the boil. Turn the heat down and simmer for 5 minutes until the potatoes are just softening then add the cauliflower and simmer for another 5 minutes.", "By now, all the vegetables should be nearly cooked. Add the green beans and baked beans and cook for 3 minutes then stir in the chopped parsley and season well with salt and pepper.", "Serve with plenty of crusty bread."]}, {"isVegetarian": true, "title": "Very summery summer pudding", "url": "www_bbc_co_uk_food_recipes_very_summery_summer_11544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strawberries, hulled and quartered", "500g/1lb 2oz raspberries", "175g/6oz caster sugar", "250ml/9fl oz Pimm’s", "1 large white sandwich loaf, crusts removed and cut into 16 slices then halved diagonally", "1 tbsp finely chopped fresh mint", "250g/9oz strawberries, hulled and halved", "75g/2½oz redcurrant jelly ", "200ml/7fl oz clotted cream ", "200g/7oz strawberries", "mint sprigs, to garnish (optional)"], "serves": "Serves 8–10", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the berries, sugar and Pimm’s in a medium saucepan and bring to a gentle simmer, stirring occasionally until the sugar dissolves. Cook for 2 minutes, then remove the pan from the heat and set aside to cool. Strain the berries over a large bowl, reserve the syrup and set the berries aside.", "Brush one side of each bread piece with the syrup. Position 24 of the bread slices, syrup-side down, around the base and sides of the pudding basin, overlapping as you go. Set aside the remaining 8 slices of bread. ", "Stir the mint through the reserved berry mixture and spoon into the basin. Arrange the reserved bread slices on top and cover with cling film. Place a small plate on top of the pudding, weigh down with tins or other weights, and refrigerate overnight.", "Place the remaining syrup, strawberries and redcurrant jelly in a small saucepan. Bring to the boil and simmer, uncovered, for 5 minutes, or until the syrup has thickened slightly. Allow to cool and refrigerate until needed.", "Turn the pudding on to a serving plate and brush with the syrup. ", "To serve, cut the pudding into thick wedges and serve with the remaining syrup, the clotted cream, extra fresh berries and a sprig of mint, if using.  "]}, {"isVegetarian": false, "title": "Vermicelli-wrapped prawns with lemon basil mayonnaise", "url": "www_bbc_co_uk_food_recipes_vermicelli-wrapped_87793", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/4oz vermicelli pasta", "2 tbsp olive oil", "12 raw tiger prawns, shelled", "1 large bunch basil, leaves only", "salt and freshly ground black pepper", "1 lemon, zest and juice", "2 handfuls fresh basil leaves", "2 free-range egg yolks", "1 tsp white wine vinegar", "1 tsp Dijon mustard", "200ml/7floz rapeseed or light olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the prawns, preheat a deep-fat fryer to 180C/350F.", "Cook the vermicelli in boiling water for 2-3 minutes, or until just softened. Drain and refresh in iced water, then drain once more. Pat dry with kitchen paper and mix with a little of the olive oil.", "Wrap each prawn in a basil leaf, then wrap with 4-5 vermicelli strands.", "Carefully lower the prawns into the deep-fat fryer and cook for 2-3 minutes, or until the prawn is cooked through and the pasta is crisp and golden-brown. Repeat with the remaining prawns.", "Remove the prawns from the deep-fat fryer, set aside to drain on kitchen paper and season with a little salt and freshly ground black pepper.", "For the lemon basil mayonnaise, blend the lemon zest, basil leaves, egg yolks, vinegar and mustard in a food processor until smooth. While the motor is still running, slowly add the oil until the mixture has emulsified and all of the oil has been added.  Season with the lemon juice, salt and freshly ground black pepper.", "To serve, spoon the mayonnaise into the centre of the serving plates. Place three prawns onto each plate, then scatter over the remaining basil leaves and drizzle with olive oil."]}, {"isVegetarian": false, "title": "Venison with juniper berries, sour cherry sauce and pumpkin mash", "url": "www_bbc_co_uk_food_recipes_venisonwithjuniperbe_84738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 x 150g/5oz venison medallions, cut from the loin", "200ml/7fl oz red wine", "4-6 sprigs fresh thyme", "4-6 sprigs fresh rosemary", "1 garlic clove, peeled and crushed", "1 small shallot, finely chopped", "1 small carrot, finely chopped", "1 celery stalk, finely chopped", "8 white peppercorns", "10 juniper berries, crushed", "2 tbsp grapeseed oil", "salt and freshly ground black pepper", "20g/¾oz butter", "300g/10½oz fresh or frozen cherries, stones removed ", "2 tsp redcurrant jelly ", "½ tsp chopped fresh thyme", "110ml/4fl oz good chicken stock ", "600g/1lb 5oz King Edward potatoes (or similar floury potatoes), peeled and chopped ", "600g/1lb 5oz butternut squash, peeled and chopped", "5 tbsp extra virgin olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the venison, place all of the venison ingredients, except the grapeseed oil and the salt and freshly ground black pepper, into a large bowl, mix well, and place into the fridge to marinate overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Remove the venison from the marinade, and pat dry with kitchen paper. Reserve the marinade.", "Lightly brush the venison with one tablespoon of the grapeseed oil, and season with salt and freshly ground black pepper.", "Heat an ovenproof frying pan until hot, then add the remaining tablespoon of grapeseed oil and the venison. Cook for 1-2 minutes on each side, then transfer into the oven to roast for 10-12 minutes for rare, or longer if you like it medium to well done. Remove the venison when cooked to your liking and leave to rest in a warm place.", "For the sauce, return the pan that the venison was cooked in to the heat and add the butter. Strain out the vegetables from the marinade, reserving the liquid, and add to the pan to fry for 4-5 minutes.", "Add the cherries, redcurrant jelly, thyme, the stock and half of the marinade liquid. Bring to the boil and cook to reduce the liquid by half, then pass through a fine sieve into a bowl. Remove the cherries from the sieve and return them to the strained liquid.", "For the mash, place the potato and pumpkin into a large saucepan over a high heat and cover with water. Bring to the boil, add a pinch of salt, then reduce the heat and simmer for 15 minutes, or until the vegetables are tender.", "Drain the potatoes and butternut squash, then return to the pan on the heat for one minute, to drive off the extra moisture.", "Add the olive oil and mash the potato and butternut squash until smooth. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the mashed potato and butternut squash into the centre of each of six plates. Slice each venison medallion into three pieces and place three slices on top of each pile of mash, then spoon the sour cherry sauce over."]}, {"isVegetarian": false, "title": "Venison pie with red onion marmalade", "url": "www_bbc_co_uk_food_recipes_venisonpiewithredoni_89186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb plain flour", "1 tsp salt", "200g/7oz lard", "225ml/8fl oz milk", "225ml/8fl oz water", "dash olive oil", "2 banana shallots, finely sliced", "1 garlic clove, finely chopped", "450g/1lb minced venison", "2 free-range eggs, beaten", "1 tsp ground juniper berries", "½ tsp ground cloves", "1 tbsp thyme leaves", "1 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper ", "450g/1lb venison steak, thinly sliced", "12g leaf gelatine", "500ml/18fl oz chicken stock", "1 bay leaf", "10 peppercorns", "50g/2oz butter", "500g/1lb 2oz red onion, finely sliced", "1 garlic clove, roughly chopped", "50g/2oz caster sugar", "1 tsp thyme leaves, picked", "150ml/5fl oz red wine", "75ml/3fl oz good red wine vinegar"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the flour and salt into a bowl and make a well in the centre.", "Place the lard into a pan, along with the milk and water and bring to the boil.", "Pour the lard and water into the flour. Stir with a wooden spoon until thickened and all the flour is incorporated. ", "Knead the pastry on a floured work surface until smooth and elastic. Shape the pastry into a ball, wrap in cling film and place in the fridge, while you prepare the pie.", "For the pie, preheat the oven to 170C/340F/Gas 3.", "Heat a frying pan until hot, add the olive oil, shallots and garlic and fry for 2-3 minutes until softened and just turning golden-brown. Remove from the heat and cool.", "Place the minced venison, half of the egg, the ground juniper berries, ground cloves, thyme and parsley into a bowl and mix thoroughly, using your hands.", "Add the cooled shallots, season with salt and freshly ground black pepper and mix once more. Set aside.", "Remove the pastry from the fridge, roll it out with a rolling pin and press two-thirds of it into a game pie dish, reserving the remainder for the lid.", "Place a quarter of the mince mixture into the base of the lined dish, smoothing to the edges. Place one-third of the sliced venison on top and season with salt and freshly ground black pepper. Repeat with the remaining mince and steak, layering up to finish with a layer of mince.", "Place the remaining pastry on top and use your fingers and thumb to crimp the edges. Brush with beaten egg, reserving some of the egg, and make a hole in the centre of the pie with a sharp knife.", "Place in the oven to bake for 1½ hours. Remove and cool for 30 minutes.", "Increase the oven temperature to 190C/380F/Gas 5. Carefully remove the pie from the mould and place the pie onto a baking tray. Brush again with beaten egg, covering all sides. Return the pie to the oven for a further 20 minutes. Remove and cool.", "For the jelly, soak the gelatine leaf in a bowl of cold water until softened. Place the chicken stock, bay leaf and peppercorns into a saucepan and bring to a simmer.", "Add the gelatine leaf and simmer a little more until the gelatine has dissolved. Strain into a jug and then pour into the pie through the hole on the top, slowly, allowing the liquid to seep into the pie all the way through.", "Place in the fridge for at least one hour to cool completely. ", "For the red onion marmalade, heat a frying pan until hot, add the butter, chopped red onion and garlic and fry for 3-4 minutes, until just soft.", "Add the sugar and thyme, and cook slowly over a low heat for 20 minutes, or until soft and caramelised. Turn the heat up and add the red wine and red wine vinegar. Bring to a simmer and cook for a further 10-15 minutes until the liquid has evaporated. Season with salt and freshly ground black pepper. Leave to cool.", "To serve, slice the pie and serve it with the onion marmalade."]}, {"isVegetarian": false, "title": "Chicken breast with glazed carrots", "url": "www_bbc_co_uk_food_recipes_vichyglazedcarrotswi_83903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/1¾fl oz olive oil", "50g/2oz butter", "salt and freshly ground black pepper", "4 chicken breasts with skin", "500ml/17½fl oz mineral water ", "25g/1oz sugar", "1 tsp salt", "500g/1lb 2oz baby carrots ", "50g/2oz butter", "25g/1oz flatleaf parsley, chopped", "25g/1oz chopped chervil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Heat a frying pan until hot and add the olive oil and butter.", "Season the chicken and place in the pan skin side down.", "Fry for three minutes until golden then turn over and place in the oven.", "Roast for eight minutes until tender then remove and rest for five minutes.", "In a saucepan put the water, sugar, salt and butter then the carrots, bring to the boil and turn down to a  simmer.", "The carrots should have only a small amount of liquid left.  Remove the lid and allow to reduce until it's the consistency of a thick syrup on a high heat, then add the chopped herbs and serve with the chicken."]}, {"isVegetarian": true, "title": "Vichyssoise soup", "url": "www_bbc_co_uk_food_recipes_vichysoissesoup_83872", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "1 onion, chopped", "300g/10½oz leek, finely sliced", "splash white wine", "110g/4oz potatoes, peeled and sliced", "290ml/10fl oz/½pint vegetable stock", "salt and freshly ground black pepper", "290ml/10fl oz/½pint milk", "2 tbsp cream", "handful snipped chives", "small handful chopped parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a medium saucepan. Add the onion and leek and cook until softened - about 10-15 minutes on a low heat. ", "Add a splash of white wine, the potatoes, stock and seasoning and simmer until the potatoes are tender.", "Liquidise using a hand-held blender, or transfer to a liquidiser. Pass through a sieve before adding the milk and cream.", "Chill in the fridge until ready to serve.", "Sprinkle with chives and parsley just before serving."]}, {"isVegetarian": true, "title": "Victoria sandwich shortbread", "url": "www_bbc_co_uk_food_recipes_victoria_sandwich_11498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["420g/15oz butter, softened", "160g/5¾oz  caster sugar, plus extra for sprinkling", "2 tsp vanilla extract", "420g/15oz plain flour, plus extra for dusting", "210g/7½oz  cornflour or rice flour", "230g/8¼oz unsalted butter, softened", "4 tbsp milk", "2 tsp vanilla extract", "450g/1lb icing sugar", "1kg/2lb 4oz small strawberries, hulled", "850g/1lb 14oz jam or preserving sugar", "1 lemon, juice only", "30 strawberries, hulled, thinly sliced"], "serves": "Makes 24 shortbread", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/160C Fan/Gas 3. Grease two baking trays and line with parchment.  ", "Cream the butter and sugar together in a bowl until pale and fluffy. Stir in the vanilla extract. ", "Sift and fold the flour and cornflour gradually until it binds together. Gently knead until just smooth (be careful not to over-work it). Wrap in cling film and place in the fridge for 30 minutes.", "Flour a work surface and roll out the dough to 5mm/¼in thick. Use a large cookie cutter to cut into 48 circles. Transfer to the prepared baking trays and bake for 15–20 minutes, or until pale golden-brown. ", "Sprinkle with the remaining caster sugar and leave to cool for 10 minutes. Carefully transfer to a wire rack.", "For the buttercream, put the butter, half the milk and all the vanilla extract in a large mixing bowl. Beat until smooth using an electric mixer. Sift over the icing sugar and, with the mixer on a low speed, continue mixing until smooth. Add a little more milk if required.", "For the jam, set aside a small handful of strawberries and mash the rest to a rough pulp. Pour the pulp into a wide, heavy-bottomed pan. Add the jam sugar and lemon juice and bring to the boil. Add the remaining strawberries and boil for about 5 minutes, see the tip section for how to check if the jam has set. Remove from the heat and skim off the pink scum. Leave to cool. ", "Put a layer of cream, then a layer of jam onto a shortbread and use another round to make a ‘sandwich’.  Fan the sliced strawberries on top. Repeat the process with the remaining shortbread, buttercream, jam and strawberries to make 24 sandwiches. "]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_36175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz butter, softened", "225g/8oz caster sugar", "4 free-range eggs", "225g/8oz self-raising flour", "2 tbsp lemon juice", "1 punnet blackberries", "1 tbsp caster sugar", "1 tbsp blackberry liqueur, such as crème de mure (optional)", "250ml/9fl oz double or whipping cream", "2 tbsp icing sugar", "½ tsp ground cardamom", "¼ tsp ground allspice", "¼ tsp ground cinnamon", "¼ tsp ground mace"], "serves": "Makes 10-12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Butter and line 2 x 20cm/8in sandwich tins. Using a hand-held electric whisk or a stand mixer, cream the butter and sugar together until very light and fluffy – it should be almost mousse-like. This should take a good 5 minutes. ", "Add the eggs, one at a time, with a tablespoon of the flour, mixing lightly between each addition, then add the remaining flour. Add as much lemon juice as necessary to give a dropping consistency, then divide the mixture between the two tins. ", "Bake in the oven for between 20–25 minutes, or until the sponge has shrunk away from the sides slightly, is springy to touch and a very light golden-brown. Leave to cool in the tins for at least 10 minutes, then turn out onto a cooling rack.", "For the filling, put the blackberries in a bowl and sprinkle over the caster sugar and blackberry liqueur, if using. Leave to marinate for a short while – they will give out some juices.", "For the spiced cream, whip the cream in a bowl, then fold in the icing sugar and spices – the cream needs to be just beyond the soft peak stage. ", "To assemble, pile the spiced cream onto one of the sponges. Top with the blackberries and pour over any juices. Place the remaining sponge on top. Dust with icing sugar or caster sugar and serve."]}, {"isVegetarian": true, "title": "Victoria sponge cake with strawberry compôte, fresh cream and caramel dipped strawberries", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_cake_11622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz butter, at room temperature, plus extra for greasing", "250g/9oz caster sugar", "pinch salt", "5 free-range eggs", "250g/9oz self-raising flour, plus extra for dusting", "500g/1lb 2oz strawberries, hulled and cut in half if large", "500g/1lb 2oz jam sugar", "½ lemon, juice only", "100g/3½oz sugar", "150g/5½oz strawberries, stems left on ", "400ml/14fl oz double cream, whipped", "icing sugar, for dusting"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the Victoria sponge, preheat the oven to 190C/375F/Gas 5. Lightly grease and flour two 20cm/8in loose-bottomed sponge tins, at least 4cm/1½in deep, and line the bases with baking parchment.", "Beat together the butter, sugar and a pinch of salt until pale and well creamed. Gently whisk the eggs in a small bowl and then add them, a little at a time, to the creamed butter mixture. Fold in the flour and divide the mixture between the two lined tins.", "Bake for 25-30 minutes or until well-risen and golden-brown on top. Remove from the oven and turn the cakes out onto a wire cooling rack. Peel off the baking parchment and leave to cool completely.", "For the strawberry compôte, tip the strawberries, sugar and lemon juice into a large pan and stir over a moderate heat for 2-3 minutes, or until the sugar has dissolved. Turn up the heat and boil for five minutes – this is an “instant jam” so you don’t have to check for setting point. Remove from the heat, pour into a tray and set aside to cool.", "For the caramel dipped strawberries, heat the sugar in a small pan over a moderate heat until it starts to turn a pale caramel colour. Remove from the heat and, holding the stems, carefully dip the strawberries into the caramel. (CAUTION: sugar gets very hot. Take care not to burn yourself.) Set aside on a non-stick mat or greaseproof paper to cool.", "To serve, put the whipped cream in a piping bag. Place one of the sponges on a plate or cake stand and spread with the jam and pipe the cream on top of the strawberry jam. Place the second sponge on top and dust with icing sugar. Finish by arranging the caramel-dipped strawberries on top of the cake."]}, {"isVegetarian": true, "title": "Victoria sponge with mixed berries", "url": "www_bbc_co_uk_food_recipes_victoria_sponge_with_18011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz butter, plus extra for greasing", "350g/12oz caster sugar", "4 large free-range eggs", "½ tsp vanilla bean paste", "200g/7oz self-raising flour, plus extra for dusting", "375g/13oz ripe strawberries, hulled and cut into quarters", "300g/10½oz fresh raspberries", "300g/10½oz fresh blackberries", "150g/5½oz fresh redcurrants, stems removed", "500ml/18fl oz double cream, very lightly whipped", "1-2 tsp icing sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease 2 x 20cm/8in springform cake tins with butter and dust with flour.", "In a bowl, beat the butter and 200g/7oz of the sugar together using an electric whisk until pale and fluffy. ", "Beat in the eggs one at a time, making sure each is fully incorporated into the mixture before adding the next. Add a little flour to the mixture if it starts to curdle.", "Beat in the vanilla bean paste, then fold in the flour until just combined. ", "Divide the mixture equally between the prepared cake tins and smooth the tops.", "Bake the cakes in the oven for 20-25 minutes, or until golden-brown and risen. A skewer inserted into the centre of the cakes should come out clean; if it doesn’t, return them to the oven for a further 5 minutes and check again. ", "Turn the cakes out onto a tea towel-lined wire rack and set aside to cool.", "Meanwhile, dissolve the remaining 150g/5½oz caster sugar in 150ml/5fl oz water in a saucepan. Bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 5 minutes, or until it resembles a light syrup. ", "Mix the berries and redcurrants together in a bowl, then stir all but a handful into the syrup, until they have softened but not broken down and the mixture resembles a compôte. Remove from the heat and set aside to cool.", "When the cake and compote have both cooled, place one cake on a serving plate. Spread compôte over it, followed by the whipped cream, then spoon a little more compôte on top.", "Gently set the second cake on top of the filling and dust the surface with icing sugar. Garnish the cake with the remaining berries. Serve immediately."]}, {"isVegetarian": false, "title": "Victoria's crown", "url": "www_bbc_co_uk_food_recipes_victorias_crown_99544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large free-range eggs, separated", "300g/10½oz golden caster sugar ", "3 tsp vanilla paste", "270g/9¾oz plain flour", "50g/1¾oz icing sugar", "400g/14oz rhubarb, trimmed and roughly chopped", "4 pieces stem ginger in syrup, finely chopped", "120g/4¼oz caster sugar", "5 sheets leaf gelatine", "400g/14oz rhubarb, trimmed and roughly chopped", "250g/9oz caster sugar", "270ml/9½fl oz full-fat milk", "5 tsp vanilla paste", "800ml/1⅓ pint double cream", "10 large egg yolks", "15 sheets gelatine", "reserved juice from roasted rhubarb", "red food colouring", "1 bag of ice", "110g/4oz fresh ginger, thinly sliced", "160g/5¾oz golden granulated sugar", "4-5 lemon verbena leaves ", "5 sheets gelatine", "50g/1¾oz caster sugar ", "50g/1¾oz fondant icing sugar ", "edible gold spray", "edible silver balls", "2 large clear edible diamonds, 2cm/¾in diameter (optional)", "24 clear edible diamonds, 1cm/½in diameter (optional)"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": [" Line 4 large baking trays and a 23cm/9in springform cake tin with baking parchment. On one tray draw a 15cm/6in circle and 2 matching semicircles, 1 with a cross attached to the top. Draw 4 matching quarter circles. On 2 baking trays draw 35-40 9cm/3½in long lines spaced well apart. Finally draw a 23cm/9in circle on the remaining tray.", "For the savoiardi, beat the egg whites until stiff peaks form when the whisk is removed. Gradually add 200g/7oz caster sugar, beating all the time. Beat for a couple of minutes until thick and well combined.", "In a separate bowl, beat the egg yolks with the remaining caster sugar and the vanilla paste until pale and doubled in volume. Carefully fold the yolk mixture into the egg whites. Sift in the flour and carefully fold in.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Spoon the mixture into a large piping bag fitted with a 12mm/½in plain nozzle. Start piping the shapes onto the templates. For the 23cm/9in circle pipe a spiral starting from the outside into the middle so it is entirely covered in batter (this will make the base).  Pipe the outline of the other shapes and then pipe out at least 35 fingers making some of them a bit thinner than most. ", "Dust all the fingers and shapes with icing sugar and bake for approximately 20 minutes. Once cooked, carefully remove from the trays and set aside to cool on wire racks. ", "For the compôte, mix the rhubarb, stem ginger and caster sugar together on a baking tray. ", "For the bavarois cream, put the rhubarb on a baking tray and cover it with 150g/5½oz caster sugar. Roast both the trays of rhubarb for 15 minutes.", "Put the milk, vanilla paste, the remaining 100g/3½oz caster sugar and half the cream in a large saucepan and bring to a simmer. Meanwhile, put the egg yolks in a mixing bowl and beat until doubled in volume and pale. Soak the gelatine in a dish of water.", "Pour half the hot milk mixture onto the egg yolks, whisking all the time. Return all the mixture back to the pan and gently heat until thick enough to coat the back of a wooden spoon.", "Squeeze out any excess water from the gelatine, then add it to the custard and mix thoroughly until dissolved.", "Transfer the roasted rhubarb for the bavarois to a blender and pulse until smooth. Put the purée in a sieve and push through into the custard. Stir well and add a few drops of red food dye so it becomes a pale pink colour.", "Whip the remaining 400ml/14fl oz double cream until soft peaks form when the whisk is removed. Gently stir into the custard. Put the ice in a large bowl of cold water. Put the saucepan in the iced water to reduce the temperature as quickly as possible. Once cold, put in the fridge until almost set.", "For the compôte, soak the gelatine in cold water. Put the roasted rhubarb in a saucepan and gently warm through. Squeeze any excess water from the gelatine then add it to the pan. Stir until the gelatine is dissolved then set aside to cool.", "To assemble the russe, line the collar of a 23cm/9in springform tin with baking parchment. Place the large circle of savoiardi on a serving plate and put the collar on top. Trim one end of the savoiardi fingers so they are all the same length.", "Make a syrup by gently warming the caster sugar in 50ml/2fl oz water. Keep heating until the sugar is dissolved.", "Dip each side of the savoiardi fingers in the syrup. Place the fingers cut-end down around the edge of the springform tin. They should be tightly packed so they remain upright without support.  Pour half of the compôte into the bottom of the tin and put it in the fridge until set (alternatively freeze it for 30 minutes to speed up the process).", "To assemble the crown that sits on top of the finished russe. Mix up the fondant icing sugar with a dribble of water to make a thick paste. Use this paste to 'glue' together the remaining savoiardi. First stick the quarter-circles together back to back, then stick the two semi-circles together in the same way (with the cross at the top). Allow to set. ", "When set, use the circle as the base of the crown and balance the semi-circle across the top with the two quarter-circles propping it up up – trim the tops and bottoms of the semi circles and quarter circles if need be. Use the icing to ‘glue’ the pieces into place and allow to set. Cover the paste with cling film. ", "When set, spray the crown with edible gold spray. Pipe a thin line of fondant along the seams the semi-circles and quarter-circles and top with silver balls.", "When the bavarois cream is almost set, pour half of it on top of the compôte (in the ring savoiardi fingers) and put in the fridge or freezer until fully set.", "For the ginger jelly, place the ginger in a pan with 400ml/14fl oz water and the sugar. Boil for approximately 5 minutes, then remove from the heat and add the lemon verbena. Set aside to cool slightly.", "Soak the gelatine in a bowl of cold water for about 5 minutes. Pass the ginger syrup through a fine sieve. Squeeze any excess moisture from the gelatine then add to the ginger syrup. Chill until needed.", "Once the layer of custard is set, put the remaining compôte on top and chill again until set. ", "When the compôte is set,  put two-thirds of the remaining bavarois cream on top and chill to set.", "Take the reserved bavarois cream and add a small amount of red food dye. Put it in a piping bag fitted with a small star nozzle and pipe a pattern on top of the custard. Chill to set.", "When the ginger jelly is semi set, pour it on top of the layer of set custard. Gently smooth the surface.", "To decorate the crown, stick the 2 large 'diamonds' on the centre of each side of the cross using the royal icing to glue them in place. Then use small diamonds to further decorate. Put the russe on a serving plate and remove the springform collar. Place the crown on top. ", "Put the remaining bavarois cream in a piping bag fitted with star nozzle and pipe stars around the base of the savoiardi fingers."]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoriasandwich_89617", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz unsalted butter, plus extra for greasing", "250g/9oz golden caster sugar", "4 free-range eggs", "1 tsp vanilla extract", "250g/9oz self-raising flour ", "250g/9oz icing sugar", "125g/4oz unsalted butter, softened", "2 tsp hot water", "1 tsp ground cinnamon", "250g/9oz good raspberry jam", "icing sugar, for dusting"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "For the cake, grease two 23cm/9in spring-form cake tins and line with baking parchment.", "Whisk the butter and the sugar in a bowl, using an electric whisk, until light and creamy for about five minutes(the mixture should be almost white in colour).", "Add the eggs, one at a time, beating constantly until completely combined before adding the next egg. If the mixture starts to curdle you can rescue it by sprinkling in a tablespoon or so of the flour.", "Add the vanilla extract and fold in the flour.", "Divide the mixture between the two cake tins and place into the oven to bake for 25-30 minutes, or until completely cooked through. Test the cake is cooked by inserting a metal skewer into the centre of the cake. If it comes out clean the cake is cooked.", "Remove from the oven and leave to cool for five minutes, then remove the cakes from the tins and leave to cool on a wire rack.", "Meanwhile, for the butter cream, place the icing sugar, softened butter and hot water into a clean bowl. Mix well until completely combined and creamy. ", "Add the cinnamon and mix well.", "To serve, trim the top off one of the cakes to make a level surface.", "Spread the raspberry jam over the top of the levelled cake surface, then cover the jam with a layer of the butter cream.", "Sandwich the second cake on the top and press down lightly.", "Dust the top of the cake with icing sugar and serve in generous slices."]}, {"isVegetarian": true, "title": "Victoria sponge", "url": "www_bbc_co_uk_food_recipes_victoriasponge_13555", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriasponge_13555_16x9.jpg", "ingredients": ["225g/8oz butter or margarine, softened at room temperature", "225g/8oz caster sugar", "4 medium free-range eggs", "2 tsp vanilla extract", "225g/8oz self raising flour", "milk, to loosen", "200ml/7fl oz double cream", "250g/9oz mixed berries", "icing sugar, for dusting"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Grease and line 2 x 18cm/7in cake tins with baking paper. ", "Cream the butter and the sugar together in a bowl until pale and fluffy. ", "Beat in the eggs, a little at a time, and stir in the vanilla extract. ", "Fold in the flour using a large metal spoon, adding a little extra milk if necessary, to create a batter with a soft dropping consistency.", "Divide the mixture between the cake tins and gently spread out with a spatula. ", "Bake for 20-25 minutes, or until golden-brown on top and a skewer inserted into the middle comes out clean.", "Remove from the oven and set aside for 5 minutes, then remove from the tin and peel off the paper. Place onto a wire rack.", "Whip the cream with a whisk or electric handheld mixer until it forms soft peaks when the whisk is removed. ", "Sandwich the cakes together the whipped cream and berries. Dust with icing sugar."]}, {"isVegetarian": true, "title": "Victoria sponge with fresh cream and jam", "url": "www_bbc_co_uk_food_recipes_victoriaspongewithfr_89029", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["220g/8oz caster sugar", "220g/8oz butter, plus extra for greasing", "4 free-range eggs, beaten", "220g/8oz self-raising flour", "1 tsp vanilla extract", "4 tbsp strawberry or raspberry jam", "600ml/1 pint 2fl oz double cream, whipped", "icing sugar, to dust"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Grease and line two 23cm/9in cake tins. ", "Beat the sugar and butter together in a bowl until pale and creamy, then gradually add the eggs, alternating with a tablespoon of flour. Gently fold in the rest of the flour and vanilla extract, then divide equally between the two cake tins.", "Bake in the oven for 25-30 minutes, or until cooked through and lightly golden. Remove from the oven and turn out onto a wire rack to cool.", "When cool, spread one cake with jam and whipped double cream, then place the other cake on top. Dust with icing sugar and serve in slices."]}, {"isVegetarian": true, "title": "Victoria sponge with strawberry jam", "url": "www_bbc_co_uk_food_recipes_victoriaspongewithst_90309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/victoriaspongewithst_90309_16x9.jpg", "ingredients": ["knob of butter, melted", "225g/8oz butter, softened", "225g/8oz caster sugar", "4 large free-range eggs", "225g/8oz self-raising flour, sifted (you may need a bit extra)", "6 tbsp good-quality strawberry jam", "300ml/10½ fl oz double cream, lightly whipped", "icing sugar, for dusting"], "serves": "8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Gently heat the knob of butter in a pan and brush two 6in-7in/15cm-17.5cm cake tins with the melted butter. Line the bottom of the two cake tins with a circle of greaseproof paper.", "In a large bowl, cream together the butter and sugar until pale and creamy, using an electric whisk or a wooden spoon. Beat well to get lots of air into the mixture (this should take a couple of minutes).", "Beat in the eggs one at a time. Add a tablespoon of flour if the mixture curdles.", "Fold in the flour using a large metal spoon. Be careful not to over-mix it.", "Pour the mixture equally between the two cake tins and level off the top with a spatula. Make a slight dip in the centre with the tip of the spatula if you don't want them to be pointed in the middle.", "Place in the oven and bake for about 20 minutes, or until the cakes spring back when pressed gently with a finger and are pale golden in colour.", "Remove from the oven and take them out of the tins after about 5-10 minutes. Place them on a wire rack to cool completely (for about half an hour).", "Spread the sponge with the jam and the whipped cream, then carefully sandwich together.", "Dust with icing sugar and serve."]}, {"isVegetarian": false, "title": "Viennese gulasch", "url": "www_bbc_co_uk_food_recipes_viennese_gulasch_96419", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_gulasch_96419_16x9.jpg", "ingredients": ["100g/3½oz lard", "1.25kg/2lb 12oz onions, sliced", "2 garlic cloves, grated or finely chopped", "1 tbsp tomato purée", "2 tbsp sweet paprika", "1½ tbsp hot paprika, to taste", "½ tsp caraway seeds, crushed in a pestle and mortar", "1 tsp brown sugar", "1½ tsp salt", "12 turns of the black pepper mill", "2 tsp cider vinegar", "1.5kg/3lb 5oz shin of beef, cut into 3cm/1in pieces", "1 tbsp chopped flat leaf parsley"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the lard in a large pot and fry the onions until they are deep golden brown. Add the garlic, cook for a minute, then add the tomato purée, paprikas, crushed caraway seeds, sugar, salt, pepper and vinegar and cover with 1 litre/1¾ pints of water. ", "Bring to a boil, then add the beef. Turn down to a gentle simmer and cook for 2½  hours. Check the pan fairly frequently and stir, adding more water to cover the meat if necessary. Check the meat for tenderness, if not tender add a little more water and cook for a little longer. Remove the meat when done and, if needed, continue to cook the liquid to thicken the sauce.", "Serve sprinkled with a little chopped parsley with new potatoes, spatzle or dark rye bread."]}, {"isVegetarian": true, "title": "Viennese whirl biscuits", "url": "www_bbc_co_uk_food_recipes_viennese_whirls_78348", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/viennese_whirls_78348_16x9.jpg", "ingredients": ["250g/9oz very soft butter", "50g/2oz icing sugar, plus extra to decorate", "250g/9oz plain flour", "50g/2oz cornflour", "½ tsp pure vanilla extract", "100g/3½oz soft butter", "200g/7oz icing sugar, plus ½ tsp for dusting", "½ tsp pure vanilla extract", "75g/3oz seedless raspberry jam"], "serves": "Makes 32-36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C (fan)/Gas 5. Line a baking sheet with greaseproof paper.", "Put the butter, icing sugar, plain flour, cornflour and vanilla extract in a food processor and blend until smooth. You may need to scrape the mixture down a couple of times with a rubber spatula.  ", "Spoon the dough into a piping bag fitted with a large star nozzle. Pipe 16-18 x 6cm/2½in rosettes of the dough, spacing well apart. ", "Bake in the centre of the oven for 13-15 minutes or until pale golden-brown and firm. Cool on the baking tray for five minutes then transfer to a cooling rack. Repeat with the remaining dough to make 32-36 biscuits.", "For the filling, put the butter in a bowl and sift the icing sugar on top. Add the vanilla extract and beat with a wooden spoon or an electric whisk until very light and smooth. Spoon into a clean piping bag fitted with a large star nozzle. Put the jam in a bowl and stir until smooth. ", "Spoon a little jam onto the flat side of 16 of the biscuits and place jam-side up on the cooling rack. Pipe the buttercream icing onto the remaining biscuits and sandwich with the jam. Put on a serving plate and dust with sifted icing sugar. Serve."]}]