[{"isVegetarian": true, "title": "Kidney bean curry (rajma)", "url": "www_bbc_co_uk_food_recipes_kidney_bean_curry_rajma_57839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kidney_bean_curry_rajma_57839_16x9.jpg", "ingredients": ["350g/12oz dried red kidney beans, soaked overnight with cold water to cover", "1 tsp ground turmeric", "50ml/2fl oz vegetable oil", "3 medium onions, chopped", "4 garlic cloves, finely chopped", "75g/2½oz fresh root ginger, finely chopped or grated", "1 tsp salt", "1 tsp Kashmiri chilli powder", "1 tsp garam masala ", "125ml/4fl oz thick Greek-style yogurt", "boiled basmati rice ", "lime wedges"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Drain the soaked beans, put them in a heavy casserole pot, cover with fresh water and sprinkle in the turmeric. Place over a medium heat, bring to a simmer, then lower the heat and simmer uncovered for 1-1½ hours, or until the beans are tender, topping up with water if the pot starts to look dry. ", "Heat the oil in a large pan or karahi over a medium heat and fry the onions, garlic and ginger for 10 minutes or until tinged golden-brown. Add the salt, chilli powder and garam masala and fry for 30 seconds, then stir in the yogurt and cook for five minutes.", "Add the drained cooked beans to the onion mixture, along with enough of the cooking liquid to just cover the beans (topping up with water if necessary) and simmer for 10 minutes, mashing a few beans against the side of the pan with the back of a spoon to thicken the gravy. Serve with basmati rice and wedges of lime."]}, {"isVegetarian": true, "title": "Kids’ any-fruit cobbler", "url": "www_bbc_co_uk_food_recipes_kids_any-fruit_cobbler_81271", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_any-fruit_cobbler_81271_16x9.jpg", "ingredients": ["600g/1lb 5oz fresh, tinned (drained weight) or frozen fruit, such as apples, pears, ripe peaches or plums (peeled and cores removed) or berries such as blackberries, raspberries, cherries or blueberries, or a mixture", "1 small orange, juice only", "2 tbsp soft brown sugar", "175g/6oz self-raising flour (white or wholemeal)", "100g/3½oz unsalted butter, softened", "25g/1oz porridge oats", "50g/1¾oz soft brown sugar ", "½ tsp ground cinnamon or mixed spice", "4 tbsp yoghurt (natural or flavoured)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Adults job: preheat the oven to 200C/400F/Gas 6.", "Kid’s job: Chop the fruit into chunks. Don’t worry about the size being perfect, it is good to have a variety of chunks! (An adult should supervise this.)", "Kid’s job: Place the fruit into an ovenproof dish and pour over the orange juice and the brown sugar.", "Kid’s job: Place the flour into a mixing bowl and chop the butter into small lumps. They can then rub in the butter roughly using their fingertips. This doesn’t have to be perfect, a few lumps are fine.", "Kid’s job: Stir in the oats, sugar and spices to the cobbler mix and stir it through with a spoon or your hands.", "Kid’s job: Add the yoghurt one spoonful at a time. You may need to mix with your hands to form a rough dough. ", "Kid’s job: Form the cobbler mix into small balls, about the size of a ping pong ball and arrange them over the top of the fruit.", "Adult’s job: Place in the oven for 30-40 minutes or until the cobbler is golden-brown on top with the fruit bubbling up around the edges. Leave to cool before serving as the fruit filling will be very hot. Serve warm with ice cream, yoghurt or custard."]}, {"isVegetarian": true, "title": "Kids’ cheese and vegetable frittata", "url": "www_bbc_co_uk_food_recipes_kids_cheese_and_79582", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_cheese_and_79582_16x9.jpg", "ingredients": ["2 tsp olive, sunflower or vegetable oil, for greasing", "4 large free-range eggs", "50ml/2fl oz milk or cream", "handful grated cheddar or crumbled feta", "freshly ground black pepper", "1 tbsp chopped fresh herbs such as parsley or chives (optional)", "10 cherry tomatoes (can be left whole or halved)", "1 red pepper, chopped", "handful frozen peas, defrosted", "50g/1¾oz broccoli, chopped into small florets"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Adult’s job: preheat the oven to 180C/350F/Gas 4.", "Kid’s job: Rub the oil over the inside of a 20cm/8in square oven-proof dish or 6-hole muffin tin with a bit of kitchen roll or a pastry brush.", "Kid’s job: Break the eggs one by one into a small bowl so you can check if there is any egg shell in the bowl. If there is you can fish it out with a spoon. Tip each egg into a big bowl when you have checked for shell. Wash your hands after handling eggs.", "Kid’s job: Add the milk or cream to the eggs. Whisk the eggs with a fork or metal whisk until it is light and fluffy.", "Kid’s job: Add half of the grated cheese and a little ground black pepper. You can also add herbs if you like.", "Kid’s job: Put the vegetables you want to use into the oven proof dish. If you are using a muffin tin you can choose which vegetables go in each of the holes. Pour the egg and cheese mixture onto the vegetables and sprinkle the rest of the cheese on top. ", "Adult’s job: Place the tin or dish in the oven for 20 minutes so that the frittata is golden-brown and set. Check that it is cooked in the middle by poking in a sharp knife. If it is still loose return the dish to the oven until set. Leave to cool a little before removing from the tin with a heatproof spatula. You can eat it warm or cold."]}, {"isVegetarian": true, "title": "Kid’s customised couscous salad", "url": "www_bbc_co_uk_food_recipes_kids_customised_couscous_17817", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_customised_couscous_17817_16x9.jpg", "ingredients": ["¼ cucumber", "10 cherry tomatoes or 3 larger tomatoes", "1 pepper, any colour", "2 spring onions", "100g/3½oz sweetcorn, frozen or tinned (drained weight)", "150g/5½oz couscous", "small lemon, juice only (you can also use orange)", "1 tbsp olive oil", "200ml/7fl oz boiling water", "small bunch herbs, such as parsley and coriander", "small handful nuts, such as flaked almonds, pine nuts, or pistachios ", "small handful olives, chopped", "small handful dried fruits such as raisins, sultanas, chopped dried apricots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Kids job: Chop all of the vegetables into really small pieces. Kids need to be helped with chopping - use a knife which doesn’t have a pointy end. You can buy plastic salad knives for very little money which are ideal for kids to use. They can also use smooth edged table knives (not serrated which cuts fingers easily), but may need help chopping hard vegetables. It is good to chop alongside the kids with a sharp knife so they can see how it is done. Show them how to curl their fingers away from the knife like a claw, keeping your fingernails flat on the vegetable you are chopping.", "Kid’s job: Place the couscous in a large heat proof bowl and then squeeze in the lemon or orange juice and a drizzle of olive oil.", "Adult’s job: Pour the boiling water onto the couscous, cover with cling film, then set it aside to stand for five minutes.", "Kid’s job: Use a fork to stir up the couscous until it looks fluffy.", "Kid’s job: Add the chopped vegetables and stir well. If you want to add herbs, nuts, olives or dried fruits, stir these in, too. Serve with falafel, grilled chicken, or a few slices of griddled halloumi."]}, {"isVegetarian": false, "title": "Kids’ minestrone soup", "url": "www_bbc_co_uk_food_recipes_kids_minestrone_soup_40496", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_minestrone_soup_40496_16x9.jpg", "ingredients": ["1 tsp olive oil or butter, for frying", "2 spring onions or a small leek ", "1 carrot ", "handful peas (frozen or fresh) ", "small handful green beans (frozen or fresh)", "couple of cabbage leaves (any type of cabbage, kale, spinach or greens will do)", "1 garlic clove, finely chopped by an adult ", "1 tsp dried oregano, basil or thyme or mixed dried herbs ", "1 tsp tomato purée", "1 x 400g/14oz tin chopped tomatoes", "1 x 400g/14oz tin cannellini beans", "2 rashers cooked back bacon or ham, chopped (optional)", "600ml/20fl oz reduced-salt vegetable stock", "30g/1oz dried small pasta such as orzo, stars, alphabet shapes or broken dried spaghetti", "small bunch fresh basil or parsley, chopped", "lemon juice, to taste", "sugar, to taste", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Kid’s job: Chop all of the vegetables into tiny pieces, as small as you can (you can leave the peas whole). You can use your fingers, or a salad knife (with an adults help) or use clean child-friendly scissors to chop the herbs, cabbage and spring onions.", "Adult’s job: Heat a large saucepan and add a teaspoon of olive oil or butter. Gently fry the spring onion or leek for five minutes, stirring often.", "Adult’s job: Add the garlic, the rest of the vegetables, dried herbs and tomato puree and stir for a minute.", "Adult’s job: Add the tinned tomatoes and stock and bring to the boil.", "Adult’s job: Add the pasta and any meat or beans you want to use and cook for 8 more minutes.", "Kid’s job:Get your grown up to spoon a little of the soup into a small bowl for you and let it cool a little. Have a taste and see what you think…if you like you can add a squeeze of lemon juice, a little sugar or some black pepper. ", "Adult’s job: spoon into bowls to serve. You can either sprinkle herbs on top or put them in a small bowl on the table for the kids to taste first. The soup is great served with chunky bread."]}, {"isVegetarian": true, "title": "Kids’ veggie slaw", "url": "www_bbc_co_uk_food_recipes_kids_veggie_slaw_73791", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kids_veggie_slaw_73791_16x9.jpg", "ingredients": ["2 carrots", "½ celeriac or kohlrabi (these are very strange-looking vegetables that kids love to explore)", "2 raw beetroot (this can be very messy but is fun!)\t", "2 apples ", "1 tbsp olive oil", "1 orange, juice only (or use lemon juice if you prefer)", "freshly ground black pepper", "1 tbsp sunflower, sesame or pumpkin seeds, or a mixture", "1 spoonful Greek yoghurt and/or a mixture of yoghurt and mayonnaise (optional)", "handful fresh herbs such as chives, parsley (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Kid’s job: wash the vegetables and then either grate them, with help, or use a grating attachment on a food processor.", "Kid’s job: Place all of the grated vegetables in a bowl with the oil and orange juice (or a couple of teaspoons of lemon juice) and stir well so that all of the colours mix together. ", "Kid’s job: Have a taste -you may like the salad as it is but you can add more orange or lemon juice to taste and also herbs and seeds if you have them.", "Kid’s job: If you are using them add the mayonnaise or yoghurt a teaspoon at a time, stirring it in well and tasting until you have a flavour that you like.", "Keep the salad in the fridge. It will keep for up to three days in a sealed plastic tub."]}, {"isVegetarian": false, "title": "King crab, asparagus, garlic and hazelnuts", "url": "www_bbc_co_uk_food_recipes_king_crab_asparagus_12453", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 carrots, finely diced", "2 onion, finely diced", "2 celery sticks, finely diced", "1 leek, finely diced", "pinch salt", "400ml/14fl oz vegetable stock (see above)", "pinch salt", "1 tsp lemon juice", "100ml/3½fl oz olive oil", "40ml/1½fl oz bonito vinegar (available from specialist Japanese suppliers)", "10g/¼oz new season garlic, blanched and chopped", "10 wild garlic leaves, blanched and chopped", "½ tsp finely chopped parsley", "½ tsp finely chopped chives", "10g/¼oz shelled roasted hazelnuts, chopped roughly", "pinch salt ", "lemon juice, to taste", "dash olive oil", "240g/8½oz fresh crabmeat or king crabmeat ", "8 spears asparagus, chopped", "8 new season garlic cloves, peeled and blanched until soft and tender", "8 wild garlic leaves"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the vegetable stock, place all ingredients into a saucepan and cover with 400ml/14fl oz of water. Bring to a boil and simmer for 10 minutes. Allow to cool then strain.", "For the vegetable broth, place all ingredients into a saucepan and set aside.", "For the bonito and garlic dressing, place all ingredients into a bowl.", "For the crab, place a frying pan over a medium heat with a little olive oil and bring the saucepan of vegetable bonito broth to the boil.", "Put the crab in the frying pan and gently fry for about two minutes, or until cooked.", "Place the chopped asparagus in the broth and cook for 30-40 seconds. Add the blanched garlic cloves and wild garlic leaves and set aside.", "Once the crab is cooked, place the crab into a bowl with the bonito and garlic dressing and mix together.", "To serve, place the asparagus, wild garlic cloves and leaves into serving bowls with a little bonito broth. Place the dressed crab into separate bowls and serve."]}, {"isVegetarian": false, "title": "King prawn and scallop stir fry", "url": "www_bbc_co_uk_food_recipes_king_prawn_and_scallop_49681", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/king_prawn_and_scallop_49681_16x9.jpg", "ingredients": ["2 tbsp groundnut oil ", "1 garlic clove, thinly sliced", "10g fresh root ginger, cut into matchsticks", "6 king prawns, peeled and deveined ", "3 scallops, each cut in half to make 2 discs (6 discs in total) ", "sea salt flakes and pepper, to taste", "1-1½ tbsp Shaoxing rice wine, to taste", "1 spring onion, cut into strips", "4 sprigs choi sum, or other Chinese greens", "1 pak choi, cut into 4", "30g/1oz mangetout, cut in half lengthways on an angle", "½ red chilli, thinly sliced on an angle", "1-2 tbsp light soy sauce, to taste", "1 tsp sesame oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the groundnut oil in a wok until smoking.", "When hot, add the garlic and ginger cook for one minute, or until soft. ", "Add the prawns to the garlic and ginger, fry for one minute, tossing the wok or stirring the prawns with a spoon a couple of times.", "Season the scallops with salt and pepper. Lay the scallops round the edge of the hot wok, to get a little colour on the sides.", "Toss the wok or gently turn the seafood over, then add the rice wine.", "Add all the prepared vegetables and gently toss until the choi sum and pak choi have slightly wilted - this will take a further couple of minutes ", "Add the red chilli and light soy sauce, to taste.", "Divide the mixture into two bowls and drizzle half a teaspoon of sesame oil over each portion. Serve at once."]}, {"isVegetarian": false, "title": "King prawns, egg and Chinese chive water dumplings", "url": "www_bbc_co_uk_food_recipes_king_prawns_egg_and_00032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "100ml/3½fl oz lukewarm water", "200g/7oz king prawns, 2/3 roughly chopped and 1/3 finely chopped", "2 free-range eggs, lightly beaten with ½ tsp salt", "20g/1oz Chinese chives (also known as garlic chives)", "small piece ginger, finely chopped", "pinch white pepper", "1 tbsp of Shaoxing wine (or substitute dry sherry or rice vinegar)", "1 tbsp vegetable oil", "1 tbsp sesame oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the dumpling dough, place the flour in a large bowl and add the lukewarm water a little at a time, mixing between additions until you have a soft dough. Turn the dough out onto a lightly floured surface and knead until it becomes smooth. This takes 7-10 minutes by hand.  The dough should be soft but not wet to the touch - a bit like freshly made pasta.  Cover and leave to rest for thirty minutes. ", "For the filling, put all the ingredients in a large bowl.  Use a spoon to mix until smooth. ", "Uncover the dough and place on a flat, floured work surface.  Sprinkle flour on the dough and cut into four equally sized pieces.  Take one piece and roll into a sausage about 2cm/1in wide.  Put the other three pieces back into the bowl and cover so that their surface doesn't go hard.", "Cut off a thumb-sized piece of dough from the 'sausage'.  Sprinkle with flour, so that it doesn't stick, then roll into a small disc about the thickness of a 50 pence piece. Make the middle of the dough disc slightly thicker to hold the weight of the filling.", "Hold the disc in the palm of your hand and put a spoonful of the prawn filling in the centre of the disc.  With your finger and thumb, nip the sides together, making a crescent shaped dumpling.   There are many different ways to seal the dumpling, this is the easiest. Repeat with the rest of the dough and prawn mixture.  Finished dumplings should be placed on a well-floured tray and kept covered with clingfilm.", "Place the dumplings in a deep pot of boiling water and cook for 8-10 minutes, like cooking little ravioli.  Small dumplings will take less time to boil.  After three minutes, add 100ml cold water into the boiling pot, then the same again after another three minutes boiling.  Boil for two minutes more, then drain and serve."]}, {"isVegetarian": false, "title": "King prawns in coconut curry sauce", "url": "www_bbc_co_uk_food_recipes_king_prawns_in_coconut_61536", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz basmati rice ", "1 tbsp ghee", "pinch smoked salt", "½ tsp ground turmeric", "1 tsp salt", "400g/14oz freshwater prawns, peeled and de-veined (the largest size you can find)", "90ml/3fl oz vegetable oil", "2 bay leaves", "3 medium red onions, blended to a fine paste", "1 tbsp ground cumin", "1 tsp ground turmeric", "2 tbsp ginger and garlic paste", "1 tsp salt", "2 green chillies, slit lengthways ", "75ml/2½fl oz coconut milk", "shellfish stock, if needed", "½ tsp sugar (optional)", "½ tsp ground green cardamom", "1 tbsp chopped fresh coriander", "½ lime, juice only"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the boiled basmati rice, add 600ml20fl oz of water to the saucepan, then add the rice and salt. Cook on a low heat until all the water has disappeared. Place a lid on top and set aside for 20 minutes.", "For the prawns, marinate the prawns with the turmeric and salt in a shallow dish in a cool place for 30 minutes to an hour.", "Heat 60ml/2fl oz of the oil in a pan and add the bay leaves and onion paste. Fry gently for 6-8 minutes on medium heat, or until very light brown.", "Meanwhile heat the remaining oil in a non-stick frying pan and fry the prawns briefly for a minute or two. Set aside.", "Mix the ground cumin, turmeric and ginger-garlic paste in 75ml/2½fl oz of water and add to the onions, reduce the heat and cook for 2-3 minutes stirring regularly. ", "Add salt, green chillies and the prawns and stir for one minute. Mix in the coconut milk and simmer for 2-3 minutes, or just until the prawns are cooked, adding a little shellfish stock if necessary. ", "Season to taste with sugar. Sprinkle over the cardamom powder and coriander and a squeeze of lime. Stir the ghee and smoked salt into the rice and serve immediately."]}, {"isVegetarian": false, "title": "King prawn and shiitake mushroom skewers with spicy spinach salad", "url": "www_bbc_co_uk_food_recipes_kingprawnandshiitake_85578", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 shiitake mushrooms", "5 raw king prawns", "1 tbsp olive oil", "1 tbsp honey", "½ lemon, juice only", "salt and freshly ground black pepper ", "100g/3½oz spinach", "2 tbsp olive oil", "1 tsp chilli flakes", "1 lemon"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the king prawn and shiitake mushroom skewers, thread the shiitake mushrooms and king prawns alternately onto two skewers and drizzle with olive oil.", "Heat a griddle pan until hot and griddle the skewers for 3-4 minutes on each side. Add the honey and lemon juice, season with salt and freshly ground black pepper and griddle for a further 1-2 minutes on each side, or until the mushrooms are tender and the prawns are completely cooked through.", "For the spicy spinach salad, place the spinach into a bowl with the olive oil, chilli flakes and the juice of half the lemon and stir well.", "To serve, place the spicy spinach salad onto a serving plate, top with the skewers and garnish with the remaining lemon half, cut into wedges."]}, {"isVegetarian": false, "title": "King prawn brochette on a spicy sweet salad", "url": "www_bbc_co_uk_food_recipes_kingprawnbrochetteon_67272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20 raw king prawns, heads removed and shelled - butterfly them to ", "remove waste", "wooden skewers (soaked to stop them burning when barbequed or griddled)", "1 red chilli", "1 thumb-sized piece of ginger , peeled", "1  garlic clove", "a little lime juice ", "1 tsp vegetable oil", "½ fresh pineapple, cut into 1cm/½in dice", "110g/4oz mooli (daikon radish), cut into fine batons (julienne) 7.5cm/3in long", "200g/7oz mangetout, cut on an angle finely", "2 carrots, cut into fine batons (julienne) 7.5cm/3in long", "1 red onion, finely sliced", "1 heaped tbsp coriander, coarsely chopped ", "2 red chillies, finely diced", "½ thumb-sized piece of ginger, finely diced", "110ml/4fl oz rice wine vinegar", "2 limes, zest and juice ", "2 tbsp caster sugar"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["In a pestle and mortar pound the marinade ingredients (the chilli, ginger, garlic, lime juice and oil) and add the prawns, allowing them to marinate for 1 hour.", "Once the prawns have marinated, skewer them on to the wooden skewers - about four per skewer depending on the size of the prawns.", "On a hot griddle pan place the prawn skewers and cook for a couple of minutes on each side (the prawns will turn pink).", "Meanwhile prepare the salad ingredients and mix the dressing in well - almost bruising the vegetables.", "Serve the salad in the middle of a plate and place two skewers on top and eat immediately."]}, {"isVegetarian": false, "title": "King prawn curry with noodles", "url": "www_bbc_co_uk_food_recipes_kingprawncurrywithno_81304", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz rice noodles ", "1 tbsp olive oil", "salt and freshly ground black pepper ", "1 tbsp vegetable oil", "1 clove garlic, finely chopped", "1 fresh chilli, finely chopped", "½ onion, finely chopped", "1 tsp curry powder", "100ml/3½fl oz double cream", "5 king prawns, peeled, taisl left on", "½ lime, juice only", "1 tbsp chopped basil", "1 tsp chopped coriander, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the rice noodles in a large bowl and cover with boiling water. Leave for 5 minutes to cook, then drain and toss with the olive oil. Season with salt and freshly ground black pepper.", "For the curry, heat the oil in a large frying pan. Add the garlic, chilli and onion and fry until softened.", "Stir in the curry powder and fry for a further minute. Pour in the double cream and bring to a simmer.", "Add the king prawns and cook for 5 minutes, then add the lime juice, the cooked noodles and the chopped basil and stir together.", "Serve on a large warm plate and sprinkle with chopped coriander."]}, {"isVegetarian": false, "title": "King prawn pad Thai", "url": "www_bbc_co_uk_food_recipes_kingprawnpadthai_86372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz vegetable oil", "1 garlic clove, sliced", "20 king prawns, shells removed", "2 free-range eggs, lightly beaten", "1 tbsp shrimp paste (blachan)", "75g/2½oz roasted peanuts", "½ tsp chilli flakes", "250g/9oz fine rice noodles, soaked in warm water for 20 minutes, then drained", "150g/5oz bean sprouts", "1 tsp sugar", "2 tbsp soy sauce", "2 tbsp fish sauce (nam pla)", "handful fresh coriander leaves, to garnish", "1 lime, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok over a high heat. Add the garlic and prawns and stir-fry for two minutes, then remove and set aside.", "Add the eggs and spread out around the wok to form an omelette shape. Once cooked through, break up the egg into chunks, then set aside with the prawns and garlic.", "Add the shrimp paste, nuts and chilli and stir-fry for 30 seconds. ", "Add the noodles, bean sprouts, sugar, soy sauce and fish sauce and stir-fry just long enough to warm everything through.", "Return the egg and prawns to the wok and stir to combine.", "To serve, evenly divide the pad Thai among four bowls. Sprinkle with coriander and a squeeze of lime."]}, {"isVegetarian": false, "title": "King prawn salad", "url": "www_bbc_co_uk_food_recipes_kingprawnsalad_66106", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil", "small jar of mayonnaise", "1 lemon, juice only", "2 garlic cloves", "2-3 anchovies", "capers,  deep-fried as a garnish", "bread, for croutons, 1 slice per person", "1 sprig of thyme ", "1 garlic clove", "110g/4oz lardons, fried until crispy", "young cos or romaine, 1 small lettuce per person", "king prawns, 3 per person", "1 lime, juice only", "2 rashers fried bacon, for garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Combine the dressing ingredients to make the caesar sauce.", "Shred the lettuce.", "Toss in the dressing.", "Add the anchovies and crispy lardons.", "Griddle the prawns and add the lime juice.", "Make the croutons by cutting up and  frying the bread with the thyme and garlic.", "Serve the dressed salad with the croutons and prawns, garnish with two rashers of bacon on top."]}, {"isVegetarian": false, "title": "Kipper kedgeree", "url": "www_bbc_co_uk_food_recipes_kipper_kedgeree_26508", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "1 onion, finely diced", "salt and pepper ", "1 tsp curry powder ", "300g/10oz rice ", "500ml/18fl oz vegetable stock, made from a stock cube ", "4 eggs ", "160g/5½oz kippers ", "200g/7oz frozen peas, defrosted "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter over a medium heat in a high-sided frying pan with a lid or a wide, shallow saucepan with a lid. Once melted, add the onion along with a pinch of salt and fry gently for 5-6 minutes, or until softened. Stir in the curry powder and cook for 1-2 minutes, or until aromatic.", "Add the rice and stir to coat in the onion mixture. Season with a pinch of salt and pepper then add the stock and bring to a simmer. Reduce the heat to the lowest setting and cover with a lid. Cook for 12 minutes, or until the rice is tender.", "While the rice is cooking boil the eggs. Heat a pan of water and, once boiling, add the eggs and boil for eight minutes. Once boiled, drain and run them under cold water to cool them down. Peel and slice into quarters lengthways. ", "Bring some water to the boil in a large shallow pan, add the kippers and cook for four minutes until just cooked. Transfer the fish to a plate and set aside until cool enough to handle, then break the flesh into large flakes discarding the bones and skin.", "Once the rice is cooked, stir in the defrosted peas and flaked kippers. Cook gently for 3-4 minutes to warm everything through. Taste and season with salt and pepper to taste. Serve with the egg quarters dotted around the kedgeree. Eat hot."]}, {"isVegetarian": false, "title": "Kipper fishcakes with tartare sauce and watercress salad", "url": "www_bbc_co_uk_food_recipes_kipperfishcakeswitht_92672", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 kipper fillets", "400ml/14fl oz whole milk", "450g/1lb floury potatoes (such as King Edward or Maris Piper), peeled, cut into equal-sized pieces, boiled until tender", "2 tbsp chopped fresh parsley", "1 free-range egg yolk", "salt and freshly ground black pepper", "200g/7oz plain flour", "3 free-range eggs, beaten", "200g/7oz Japanese panko breadcrumbs (available from specialist websites and some Asian supermarkets)", "2 tbsp olive oil", "2 free-range egg yolks ", "1 tsp white wine vinegar", "½ tsp Dijon mustard", "1 tsp salt ", "275ml/10fl oz rapeseed oil", "2 cornichons, drained, finely chopped ", "2 tsp capers, drained, finely chopped ", "1 tbsp chopped fresh parsley ", "1 tsp chopped fresh chives ", "1 lemon, juice only", "salt and freshly ground black pepper", "2 bunches watercress leaves, washed", "1 tbsp extra virgin olive oil", "Salt and freshly ground black pepper", "lemon wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the kipper fishcakes, place the kippers and milk into a saucepan and bring to the boil. Remove from the heat and set aside to cool. Once cool, drain and flake the fish, removing as many bones as possible, and set aside. (Discard the milk.)", "Mash the cooked potatoes in a large bowl until smooth, then add the parsley, egg yolk and kippers. Season, to taste, with salt and freshly ground black pepper. Stir until well combined.", "Shape the mixture into four equal-sized patties, then chill in the fridge for two hours.", "Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the Japanese panko breadcrumbs onto a separate plate. Once the fishcakes have chilled, dredge each in the flour, then dip in the egg and finally roll in the breadcrumbs.", "Heat the olive oil in a frying pan over a medium heat and fry the fishcakes for three minutes on each side, or until golden-brown on each side. Keep warm in the oven.", "For the tartare sauce, blend the egg yolks, white wine vinegar, Dijon mustard and salt in a food processor. While the motor is running, gradually pour the oil into the food processor in a steady stream until the mixture thickens. Stir in the cornichons, capers, parsley, chives and lemon juice. Season, to taste, with salt and freshly ground black pepper.", "For the watercress salad, place the watercress in a bowl, add the oil and season, to taste, with salt and freshly ground black pepper. Mix together until well combined.", "To serve, spoon the tartare sauce into a four small bowls and place one onto each of four serving plates, along with a kipper fishcake. Divide the watercress salad among the plates and garnish with the lemon wedges."]}, {"isVegetarian": false, "title": "Kipper kedgeree", "url": "www_bbc_co_uk_food_recipes_kipperkedgeree_87265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 smoked undyed kippers (preferably Whitby, Isle of Man or Scottish)", "450ml/16fl oz boiling water", "25g/1oz butter", "1 onion, finely chopped", "1 tsp hot curry powder", "225g/8oz basmati rice", "110ml/4fl oz double cream", "½ lemon, juice only", "salt and freshly ground black pepper", "3 eggs, hard-boiled, peeled, roughly chopped", "3 tbsp roughly chopped fresh flatleaf parsley"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the kippers into a deep baking dish and pour over the boiling water.", "Leave the kippers in the water for five minutes, then remove and set aside, reserving the soaking liquid.", "Carefully remove the meat from the fish, taking care to remove all the bones. Place the kipper meat into a bowl and set aside.", "Meanwhile, heat a deep frying pan with a lid until hot then add the butter. Once the butter has melted, add the onions and fry for 3-4 minutes, until just softened but not coloured.", "Add the curry powder and cook for a further minute.", "Add the rice and stir to coat well in the butter and onions.", "Add the reserved kipper soaking liquid and heat to a gentle simmer, then cover with the lid and cook for 12-15 minutes, until the rice is tender and all the liquid has been absorbed.", "Stir in the double cream and lemon juice.", "Season, to taste, with salt and freshly ground black pepper, then add the kipper meat, eggs and parsley. Stir gently to combine without breaking up the kipper meat too much.", "To serve, spoon into warmed bowls."]}, {"isVegetarian": false, "title": "Kipper pâté with bruschetta, beetroot salsa and caper dressing", "url": "www_bbc_co_uk_food_recipes_kipperpatewithbrusce_80190", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "100g/3½oz cream cheese ", "2 spring onions, finely chopped", "1 kipper, skin removed and chopped", "50g/1¾oz Greek yoghurt", "1 lime, juice only", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper", "50g/1¾oz capers", "50ml/2fl oz olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "½ lemon, juice only", "1 cooked beetroot, finely chopped", "1 tbsp red onion, finely chopped", "1 tbsp finely chopped fresh chervil ", "1 tbsp chopped fresh dill", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 slice ready-made soda farl"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the kipper pâté, place all of the pâté ingredients into a food processor, season with salt and freshly ground black pepper and blend to a smooth paste.", "To make the dressing, place the capers and olive oil into a clean food processor. Season, to taste, with salt and freshly ground black pepper and blend together until smooth. ", "To make the salsa, whisk together the lemon juice and olive oil in a large bowl.", "Add the beetroot, onion and herbs, season, to taste, with salt and freshly ground black pepper and toss together to coat the beetroot.", "To make the bruschetta, heat a griddle pan until smoking. Drizzle the soda farl with olive oil, season, to taste, with salt and freshly ground black pepper and place onto the griddle pan to char-grill for two minutes on each side. Remove from the griddle and cut the farl into even slices.", "To serve, spoon the pâté into the centre of a plate. Drizzle the dressing and the beetroot salsa around the plate and serve the soda farl bruschetta alongside."]}, {"isVegetarian": false, "title": "Kippers cooked in a jug with cider and lime butter", "url": "www_bbc_co_uk_food_recipes_kipperscookedinajugw_83916", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 fresh kippers", "100g/4oz butter, softened (not melted)", "3 tbsp fresh flatleaf parsley, chopped", "¼ apple, grated", "50ml/2floz cider", "1 lime, juice and zest only", "sliced bread, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the kippers in a tall jug with the tails sticking out of the top. Pour boiling water carefully into the jug, right up to the top. Leave to stand.  ", "Meanwhile, mix the butter and chopped parsley together in a mixing bowl. Gradually add the grated apple and cider and set aside.", "After the kippers have been in the water for about 2-3 minutes, drain well and transfer the kippers to a plate.", "Spoon the butter over the kippers and garnish with the lime juice and zest. ", "Serve with sliced bread."]}, {"isVegetarian": false, "title": "Kipper, spinach, bacon and new potato salad", "url": "www_bbc_co_uk_food_recipes_kipperspinachbaconan_86151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/kipperspinachbaconan_86151_16x9.jpg", "ingredients": ["6 rashers streaky bacon, fried until crisp", "500g/1lb 2oz new potatoes, cooked and halved", "350g/12oz spinach, washed and dried", "3 kipper fillet, bones removed, flaked", "3 tbsp olive oil ", "1 tbsp white wine vinegar", "1 garlic clove, chopped", "2 tsp wholegrain mustard", "salt and freshly ground black pepper", "4 free-range egg, poached, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place all of the salad ingredients into a large bowl and gently stir.", "For the dressing, place all of the dressing ingredients into a bowl and mix well. Pour the dressing over the salad and stir to coat the salad ingredients.", "To serve, place the salad into a serving dish and top with the poached egg."]}, {"isVegetarian": true, "title": "Knickerbocker glory", "url": "www_bbc_co_uk_food_recipes_knickerbocker_glory_59895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/knickerbocker_glory_59895_16x9.jpg", "ingredients": ["450g/1lb fresh raspberries", "2 tbsp icing sugar", "1 ripe mango, peeled, stone removed, diced", "150g/5½oz fresh blueberries", "12 scoops vanilla ice cream", "25g/1oz pistachios, coarsely chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the raspberry coulis, measure 250g/9oz of the raspberries into a food processor, add the icing sugar and pulse until smooth.", "Tip the raspberry purée into a sieve set over a bowl. Use a metal spoon to push the fruit pulp through the sieve. Discard the seeds.", "Divide half the diced mango between six sundae glasses. Divide half the blueberries between the glasses, placing on top of the mango. Sit one scoop of ice cream on top of each blueberry layer, drizzle over half the raspberry coulis and half the whole raspberries. Repeat the layering again to use the remaining ingredients and top with the chopped pistachios."]}, {"isVegetarian": true, "title": "Knickerbocker glory", "url": "www_bbc_co_uk_food_recipes_knickerbockerglory_9379", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/knickerbockerglory_9379_16x9.jpg", "ingredients": ["570ml/1 pint double cream", "300ml/½ pint whole milk", "2 egg yolks", "100g/4oz caster sugar", "100g/4oz Christmas pudding", "4 oranges, 1 zested, 4 juiced", "175g/7oz unsalted butter, diced", "4 egg yolks", "100g/4oz caster sugar", "1 can condensed milk, label removed", "100g/4oz honey", "125g/5oz glucose syrup", "300g/12oz caster sugar", "90ml/3fl oz water", "1 tbsp bicarbonate of soda", "100g/4oz 70% cocoa chocolate, broken into pieces", "15-20 cherries, all but 6 stoned, stalk removed and halved", "15 red grapes, halved and deseeded", "15 raspberries, halved", "15 blueberries, halved", "290ml/½ pint double cream, lightly whipped"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the honeycomb, line a small but deep roasting tray with baking parchment. Place the honey, glucose syrup, sugar and water in a large pan and carefully take the mixture to 150C/300F. Add the bicarbonate of soda and stir in quickly. Carefully watch the mixture foam up and increase in volume for 1 minute and then quickly pour into the lined tin. The honeycombe will set very quickly. When cool, shatter into pieces. Fold through the whipped cream on serving.", "For the basis of both ice creams, gently warm the milk and cream together in a medium pan until just coming to the boil. Whisk the egg yolks and sugar together in a large bowl until light and fluffy and doubled in size. Gradually add a little of the warmed mixture to the egg and sugar mix, stirring all the time until all has been incorporated. Return the mixture to the pan and gently warm through, stirring all the time, until it thickens enough to coat the back of the spoon. Leave to cool slightly.", "Divide the mixture in two and churn each half separately in an ice cream machine (operated according to manufacturers instructions) for the required time. When the first batch is almost ready, stir the Christmas pudding through to combine and freeze in suitable container. ", "As the second batch is churning prepare the orange curd. Reduce the orange juice and zest by half. Whisk the butter in to melt. Whisk the egg yolks and sugar together until pale and fluffy and doubled in volume. Gradually add a little of the orange mix to the egg and sugar mix, stirring all the time until all has been incorporated. Return the mixture to the pan and gently warm through, stirring all the time, until it thickens enough to coat the back of the spoon. Leave to cool slightly. Stir the orange curd into the ice cream a few minutes before the end of churning time. Freeze.", "For the toffee sauce, simply place the can in a heavy based saucepan and cover with water. Cover with a tight fitting lid, bring to the boil and reduce to simmer for about 3 hours. Remove and leave to cool slightly Carefully open the can with an opener and scoop the toffee sauce out.", "Melt the chocolate in a bowl set over a pan of simmering water.", "Toss the fruit together, reserving the 6 whole cherries.", "To serve, alternatively layer each of the components in 6 tall (about 25.5cm/10in) knickerbockerglory glasses so the layers can be clearly identified. Finish with some of the honeycomb cream and top each one with a reserved cherry. Serve at once."]}, {"isVegetarian": false, "title": "Kofta hara masala (Indian meatballs in a green sauce)", "url": "www_bbc_co_uk_food_recipes_koftaharamasalaindia_77145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1 lb minced lamb", "2 or 3 spring onions, finely chopped", "2 green chillies, finely chopped", "1 tbsp fresh coriander, chopped", "1 tsp ground allspice", "1 tsp ground cinnamon", "1 tsp garam masala", "1 tsp freshly ground black pepper", "1 tsp garlic paste", "1 tsp ginger paste", "salt to taste", "75ml/2½fl oz vegetable oil", "2 large onions, finely sliced", "150ml/5fl oz plain yoghurt", "3 green chillies", "1 small bunch fresh coriander", "1 tbsp fresh mint, chopped", "1 tsp garlic paste", "1 tsp ginger paste", "1 tsp ground cumin seeds", "1 tsp garam masala", "1 tsp ground fennel seeds", "½ tsp freshly ground black pepper", "¼ tsp ground turmeric", "1 tsp lemon juice", "salt to taste", "800ml/2 pints hot water", "handful toasted flaked almonds", "1 tbsp fried onions (reserved from onions fried for green sauce)", "2 tbsp single cream", "1 tbsp freshly chopped mint", "400g/14oz basmati rice", "2 lemons, juice from both and zest of 1 only", "1cm/½in piece root ginger, finely sliced into julienne strips", "pinch salt", "1 tsp ghee (clarified butter)", "800ml/1 pint 9fl oz water", "pinch turmeric"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the koftas, mix all the kofta ingredients together in a mixing bowl and combine thoroughly. ", "Shape into golf ball sizes.", "For the green sauce, heat the oil in a non-stick saucepan. Add the sliced onions and fry until they are golden-brown. Remove and keep to one side, reserving the oil in the pan.", "Place all the other green sauce ingredients, except for the reserved oil and water, into a food processor or blender. Add all but one tablespoon of the fried onions (which you will use for the garnish) and blend to form a smooth paste. ", "Using the same saucepan in which the onions have been fried, reheat the reserved oil and add the spice paste to the pan. Fry for at least 2-5 minutes.", "Add the hot water to the pan and bring to the boil. Make sure that the sauce is bubbling, then add the koftas. Bring back to the boil and simmer for at least 30-45 minutes, partially covered, to allow the sauce to thicken and reduce.", "Once the oil starts to separate from the sauce, the koftas should be ready.", "For the lemon and ginger rice, wash the rice in hot water then rinse several times in cold water to remove as much starch as possible. Cover the rice in plenty of cold water, add a little salt and soak for at least half an hour, then drain.", "Place the lemon juice and zest, half of the ginger julienne, salt and a teaspoon of ghee into a large, heavy-bottomed pan. Add the water and bring to the boil. Allow the ginger to soften slightly then add the drained rice and turmeric. Stir twice and cook the rice until the liquid is reduced.", "When the liquid starts to bubble, you will notice that the rice will form craters. As soon as this happens, reduce the heat to a simmer. Place a dry cloth over the pot then cover with a lid. Leave to simmer for at least 10 minutes. Do not open the lid during this stage.", "After 10 minutes remove from heat.", "To serve, garnish the koftas with the reserved fried onions, toasted flaked almonds, cream and fresh mint and serve with the lemon and ginger rice."]}, {"isVegetarian": false, "title": "Koli ishtew (chicken stew)", "url": "www_bbc_co_uk_food_recipes_koliishtewchickenste_87479", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/koliishtewchickenste_87479_16x9.jpg", "ingredients": ["3 tbsp vegetable oil", "2 boneless chicken breast, cut into four pieces, dusted with little flour, salt, freshly ground black pepper and ground cinnamon", "2 star anise", "2.5cm/1in cinnamon stick", "2-3 green cardamom pods, lightly crushed", "4 cloves", "4-6 black peppercorns", "1 blade mace", "1 green chilli, slit open", "20g/¾oz fresh ginger, peeled, sliced into matchsticks", "2 medium onions, thinly sliced", "8-10 fresh curry leaves", "1 tsp ground turmeric", "2 tsp ground coriander", "½ tsp ground black pepper", "¼ tsp ground cinnamon", "400ml/14fl oz coconut milk", "10-12 baby plum or cherry tomatoes", "steamed rice", "chopped celery leaves", "shiso cress (or punnet cress if unavailable)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of the vegetable oil in a large pan over a low heat. When the oil is hot, add the chicken breast pieces and fry gently, but do not allow to colour. When the chicken pieces are almost cooked through, remove from the pan and set aside until required.", "Heat the remaining two tablespoons of vegetable oil and add the cinnamon stick, cardamom pods, cloves, peppercorns and mace. Fry until the spices start to crackle, then add the chilli, ginger, onions and curry leaves.", "Fry the spices and onions for 4-5 minutes, or until onions are translucent.", "Add the turmeric, coriander, black pepper and cinnamon powder and continue to fry for 2-3 minutes.", "Add the coconut milk and heat to a gentle simmer.  ", "Add the cooked chicken pieces and the tomatoes and simmer for 3-4 minutes, or until the chicken is completely cooked through (no pink should remain when the chicken is cut into).", "To serve, place a spoonful of steamed rice onto each plate and then place a spoonful of the chicken stew alongside. Garnish with celery and shisho cress."]}]