[{"ingredients": ["200g / 7oz de médula ósea de vaca", "250ml / 9fl oz de vino de Burdeos", "4 chalotes, finamente picados", "½ cucharadita de granos de pimienta blanca, aplastados", "1 hoja de laurel", "2 ramitas de tomillo", "1 diente de ajo, finamente picado", "300 ml / 10 fl oz de caldo de ternera oscura", "25g / 1oz de mantequilla", "500g / 1lb 2oz de patatas Maris Piper, peladas y cortadas en chips", "2 filetes de rib eye de 2 x 250 g / 9 onzas, con hueso", "vinagre de malta, para servir", "½ manojo de berros, para servir", "sal marina y pimienta negra recién molida"], "method": ["Cubra la médula ósea con agua, cubra y remoje en la nevera durante la noche. En la mañana, drene y corte en pedazos de 2.5cm / 1in.", "Para hacer la salsa, ponga el vino, los chalotes, los granos de pimienta, las hierbas y el ajo en una cacerola grande a fuego alto. Llevar a ebullición y cocine a fuego lento hasta que el volumen del líquido se haya reducido en un tercio.", "Agregue el caldo, vuelva a hervir y cocine a fuego lento hasta que el volumen del líquido se haya reducido a la mitad o hasta que cubra la parte posterior de una cuchara.", "Coloque la médula ósea en una olla con un poco de agua. Llevar a ebullición y cocinar durante 30 segundos, luego drenar. Batir la médula ósea y la mantequilla en la salsa reducida y sazonar con sal y pimienta. Mantener caliente", "Escalde las papas fritas en agua hirviendo durante 5-8 minutos hasta que estén blandas pero no cocidas. Escurrir y extender en una bandeja para hornear y enfriar en la nevera.", "Precaliente una freidora a 130C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Cocine las patatas fritas durante 5 minutos, o hasta que estén cocidas, pero no coloreadas. Escurrir, extender en la bandeja de hornear y dejar enfriar.", "Encienda la freidora a 180 ° C. Cocine las fichas durante 4-5 minutos hasta que estén crujientes y doradas. Escurrir sobre papel de cocina y espolvorear con sal y vinagre de malta.", "Precaliente la parrilla a su nivel más alto y cocine los filetes durante 4 minutos en cada lado o a su gusto.", "Sirve con la salsa derramada y las patatas fritas en el lado. Adorne con el berro."], "url": "www_bbc_co_uk_food_recipes_tomahawk_steak_30844", "title": "Bistec, patatas fritas triples y salsa Bordelaise", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["650g / 1lb 7oz de tomates maduros, despellejados, picados", "2 chalotes, finamente picados", "2 dientes de ajo, aplastados", "½ chile rojo, sin semillas, finamente picado", "½ limón, ralladura y jugo", "1 cucharada de vinagre balsámico", "½ cucharadita de pectina", "225 g / 8 oz de azúcar en polvo", "1 cucharada de hojas de albahaca fresca finamente picada"], "method": ["Coloque los tomates, los chalotes, el ajo, el chile, la ralladura de limón y el jugo, el vinagre y la pectina en una cacerola y deje que hiervan.", "Agregue el azúcar, luego continúe hirviendo hasta que la mezcla alcance 103C (use un termómetro de azúcar para esto, debería tomar alrededor de 20 minutos). (PRECAUCIÓN: el azúcar caliente puede ser peligroso. Manténgase atento a la olla en todo momento).", "Retire la sartén del fuego y agregue la albahaca. Dejar enfriar por 20 minutos.", "Vierta la mermelada en frascos esterilizados, selle y deje de lado hasta que esté completamente fría.", "Esta mermelada se mantendrá durante hasta 6 meses."], "url": "www_bbc_co_uk_food_recipes_tomato_and_basil_savoury_46330", "title": "Mermelada de tomate y albahaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 350 ml / 12 fl oz mermelada", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de hojaldre listo para el uso de 2 oz", "40 tomates cherry madurados en la vid", "2 cucharadas de aceite vegetal", "Una pizca de sal marina", "pimienta negra recién molida", "2 cucharaditas de miel", "2 cucharadas de pan rallado", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, ligeramente golpeado", "pequeño manojo de albahaca fresca", "2 cucharadas de aceite de oliva extra virgen"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los tomates en una sartén a prueba de horno de 20cm / 8in con aceite vegetal, sal y pimienta y miel. Arreglen juntos lo más apretadamente posible y espolvorear con las migas de pan.", "En una superficie de trabajo bien enharinada, despliegue un círculo de hojaldre del mismo tamaño que la parte superior de la sartén. Coloque la masa de hojaldre sobre los tomates y colóquelos alrededor para que los tomates queden en su lugar.", "Cepille la masa con el huevo ligeramente batido solo en la parte superior. (Parece un poco sin sentido ya que será debajo de la tarta, pero me gusta ese poco de crujido adicional que se agrega a la masa y se ve mucho más presentable por ese minuto antes de ponerlo boca abajo).", "Hornee en el horno durante 20 minutos, o hasta que la masa de hojaldre esté bien inflada y dorada. Retírelo del horno y déjelo reposar durante unos minutos, luego eche el exceso de líquido (si corresponde) y coloque un plato grande boca abajo sobre la sartén. Con los guantes del horno, presione la placa hacia abajo con fuerza y ​​luego voltee rápidamente todo para que la sartén quede boca abajo y la placa quede abajo. (¡Hago esto sobre el fregadero porque generalmente hay alguna fuga!)", "Retire la sartén. Una vez que la tarta esté fría, raspe algunas hojas de menta o de albahaca y rocíe con aceite de oliva virgen extra. Agregue sal y pimienta negra recién molida al gusto.", "Para servir, organice la tarta en un plato o plato grande con embutidos, quesos, aceitunas o ensaladas."], "url": "www_bbc_co_uk_food_recipes_tomato_and_basil_tarte_33340", "title": "Tarta tatin de tomate y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_and_basil_tarte_33340_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas rojas, finamente picadas", "400g / 14oz de tomates cherry maduros, cortados a la mitad", "400g / 14oz de tomates de ciruela maduros, descuartizados", "3 chiles rojos grandes y suaves, sin semillas, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, rallado", "1 estrella de anís", "250ml / 9fl oz de vinagre de vino blanco", "300g / 10½oz de azúcar moreno claro y suave", "2 cucharaditas de salsa de pescado (salsa de soja sustituta para vegetarianos)"], "method": ["Esteriliza los frascos. Lave con agua muy caliente o en el ciclo caliente de un lavaplatos. Precaliente el horno a 160 ° C / 325 ° F / Gas 3. Coloque las jarras boca abajo en una bandeja para hornear y seque en el horno durante 10 a 15 minutos.", "Caliente la cebolla morada y los tomates picados en una cacerola grande a fuego lento.", "Agregue los chiles, el jengibre, el anís estrellado, el vinagre y el azúcar. Ponga la mezcla a ebullición, cocine a fuego lento durante unos 30 minutos, o hasta que esté muy espesa, y puede dibujar una cuchara de madera en la base de la sartén para que deje un canal detrás que no se llene de líquido inmediatamente.", "Agregue la salsa de pescado y cocine durante 2-3 minutos más, luego la cuchara en frascos esterilizados."], "url": "www_bbc_co_uk_food_recipes_tomato_and_chilli_jam_20031", "title": "Mermelada de tomate y chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 4 tarros de 250 g / 9 oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_and_chilli_jam_20031_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "100g / 3½ oz de tofu orgánico, en cubos", "1 cucharada de aceite de oliva", "pizca de copos de chile", "½ pimiento rojo, sin semillas y en rodajas", "100 g / 3½ oz de hojas de espinaca", "4 setas, en rodajas"], "method": ["Calentar una sartén profunda de fondo grueso, un tercio llena de aceite vegetal, hasta que la miga de pan chisporrotee suavemente en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "Con cuidado agregue los cubos de tofu al aceite y fríalos por 2-3 minutos o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre los paños de cocina.", "Caliente el aceite de oliva en una sartén antiadherente grande. Agregue las hojuelas de chile y fría por 1-2 minutos.", "Agregue el pimiento rojo y saltee durante 2-3 minutos para ablandarlo.", "Agregue las hojas de espinaca y los champiñones y cocine suavemente hasta que la espinaca se haya marchitado.", "Agregue el tofu frito y cocine hasta que se caliente.", "Transfiera el tofu salteado a un recipiente tibio y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_tofustirfry_79249", "title": "Tofu salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12 bolas de masa preparadas", "un poco de mantequilla suave", "Tarrina de cabra suave de 150g / 5½ oz", "1 cucharada de pesto rojo", "¼ cucharadita de hojas de tomillo picadas", "12 tomates cherry", "sal y pimienta negra recién molida", "25 g / 1 oz de parmesano (o alternativa vegetariana), finamente rallado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta las bolas de masa por la mitad y luego corta una rodaja delgada del lado redondeado para que ambas mitades tengan una base plana sobre la que pararse. Unte con mantequilla la parte superior y coloque en una bandeja para hornear forrada con papel de hornear.", "Mezcle el queso de cabra, el pesto y el tomillo en un tazón pequeño. Extienda esto en el lado con mantequilla de las bolas de masa, asegurándose de que se extienda hasta los bordes.", "Cortar los tomates en rodajas gruesas y poner una rodaja en la parte superior de cada mitad de la bola de masa. Sazonar con sal y pimienta negra recién molida y luego espolvorear sobre el queso parmesano.", "Hornee durante 10 minutos, o hasta que estén crujientes y ligeramente doradas. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_tomato_and_goats_cheese_46597", "title": "Bolas de masa de queso de cabra y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 canapés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cucharaditas de azúcar", "Tomates pequeños de 300 g / 10½ oz (no cereza), cortados a la mitad", "sal y pimienta", "1 cucharadita de hierbas mezcladas secas", "375g / 13oz de hojaldre listo para enrollar", "1 huevo, golpeado", "1 ronda de lechuga, hojas rotas", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza inglesa", "5 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Agregue una cucharada de aceite de oliva a una sartén grande a prueba de horno (aproximadamente 25 cm / 10 pulgadas). Espolvorea el azúcar en una capa uniforme sobre la base. Coloque los tomates bien cortados en la sartén. Sazonar bien con sal y pimienta y esparcir sobre las hierbas secas mezcladas. Cocine a fuego medio durante 10 minutos, o hasta que los tomates comiencen a caramelizar y colorear en sus lados cortados y ablande ligeramente alrededor de los bordes. Retire del fuego.", "Cortar la masa en un círculo de 3 cm / 1½ pulgadas más grande que la parte superior de la sartén.", "Coloque la masa de hojaldre sobre los tomates, colóquela alrededor de los tomates y por los lados de la sartén para que los tomates estén en su lugar. Cepille la parte superior de la masa con el huevo batido.", "Hornee en el horno precalentado durante 20 minutos, o hasta que la masa de hojaldre esté hinchada y dorada.", "Mientras tanto, haz el aderezo para la lechuga. Batir el vinagre, la mostaza y una pizca de sal y pimienta en un bol. Poco a poco agregue cuatro cucharadas de aceite, batiendo sobre la marcha hasta que esté todo incorporado. Pruebe y agregue sal y pimienta según sea necesario.", "Retire la tarta del horno y déjela a un lado durante unos minutos. Luego vierta el exceso de líquido, si hay alguno, y coloque un plato grande boca abajo sobre la parte superior de la sartén. Con los guantes del horno, presione la placa hacia abajo con fuerza y ​​luego voltee rápidamente todo para que la placa quede en la parte inferior y la sartén en la parte superior.", "Coloque el plato en un mostrador y retire la sartén. Viste la lechuga desgarrada con la vinagreta. Sirva la tarta en rebanadas calientes o frías, con la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_tomato_and_herb_tarte_84464", "title": "Tarta Tatin de tomate y hierbas con ensalada verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "110g / 4oz de hojas de cohete", "½ diente de ajo", "1 cucharada de piñones, tostados", "8 cucharadas de aceite de oliva", "Masa de hojaldre de 275 g / 9½ oz (desde arriba)", "200 g / 7 oz de mozzarella, en rodajas", "150g / 5½ oz de tomates frescos, en rodajas", "25ml / 1fl oz de aceite de oliva", "1 yema de huevo de gallinas camperas, golpeada", "puñado de albahaca fresca, para servir"], "method": ["Para la pasta de hojaldre basta, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo profundo en el centro con los dedos.", "Coloque los cubos de mantequilla y la sal en el pocillo y, con las yemas de los dedos de una mano, mezcle los ingredientes y, gradualmente, introduzca más harina en el pocillo con la otra mano. Trabaja en la harina hasta que la mezcla esté suelta pero bien combinada y aún con trozos de mantequilla visibles.", "Poco a poco agregue el agua helada y mezcle hasta que tenga una masa áspera. (Es posible que no necesite toda el agua. Tenga cuidado de no trabajar en exceso la mezcla).", "Enrolle la masa en una bola, envuélvala en una película adhesiva y déjela enfriar durante 20 minutos en la nevera.", "Cuando la masa se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada en un rectángulo de 40x20cm / 16x8 pulgadas. Dobla el rectángulo en tres y dale un cuarto de vuelta.", "Repita el proceso, dando la masa doblada otro cuarto de vuelta.", "Envuelva la masa en una película adhesiva y déjela enfriar por otros 30 minutos.", "Cuando la masa se haya enfriado, extiéndala, como antes, sobre una superficie de trabajo ligeramente enharinada en un rectángulo de 40x20cm / 16x8 pulgadas. Dobla el rectángulo en tres y dale un cuarto de vuelta.", "Repita el proceso, como antes, dando la masa doblada otro cuarto de vuelta (haciendo un total de cuatro vueltas).", "Envuelva la masa en una película adhesiva y déjela enfriar durante al menos 30 minutos.", "Para el pesto de rúcula, coloque todos los ingredientes en una licuadora y mezcle hasta obtener un puré fino.", "Para las tartas de tomate y mozzarella, precalentar el horno a 400F / 200C / Gas 6.", "Ruede la masa de hojaldre sobre una superficie ligeramente enharinada hasta obtener un grosor de 2 mm / 1/8 pulgadas. Recorte seis discos con un cortador de pasteles de 12 cm / 5 pulgadas.", "Alinee una bandeja para hornear con papel de hornear y cepille con un poco de agua fría. Transfiera cada uno de los discos de pastelería a la bandeja con una espátula.", "Coloque dos cucharaditas de pesto en el centro de cada círculo de repostería, dejando un borde de 1 cm / ½ pulgada.", "Coloque los pedazos de mozzarella en la parte superior y coloque los tomates encima. Rocíe con aceite de oliva y cepille la masa con la yema de huevo por los bordes.", "Hornee en el horno por 12-15 minutos, o hasta que la masa esté dorada.", "Para servir, decorar las tartas con un poco más de pesto y algunas hojas de albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_tomato_and_mozzarella_57847", "title": "Tartas de tomate y mozzarella con pesto de rúcula", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Pasta de brisa lista para repostar 250 g / 8 oz", "1 cucharada de aceite de oliva", "125g / 4oz de tomates cherry, cortados a la mitad", "1 cucharada de hojas frescas de tomillo", "1 hoja de laurel fresca", "1 diente de ajo, sin pelar, cortado a la mitad", "1 cucharadita de pimienta negra molida", "8 tomates secados al sol", "50g / 2oz de aceitunas negras sin hueso", "2 cucharadas de albahaca fresca picada", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ruede los pasteles a un grosor de 0.25cm / ⅛in y corte 24 círculos con un cortador de pasteles de 5cm / 2in.", "Coloque los círculos en una bandeja para hornear y pinche todo con un tenedor.", "Hornee en el horno durante 10-12 minutos, o hasta que esté cocido y dorado. Retirar del horno y reservar para enfriar.", "Mientras tanto, caliente el aceite de oliva en una sartén a fuego medio y agregue los tomates, hojas de tomillo, laurel, ajo y granos de pimienta molidos. Freír suavemente durante 4-5 minutos, luego retirar del fuego y reservar para enfriar. Retire la hoja de laurel y el ajo.", "Mezcle los tomates secos y las aceitunas en una pasta en un procesador de alimentos, luego mezcle la albahaca y sazone, al gusto, con sal y pimienta negra recién molida.", "Para armar los canapés, unte un poco de pasta de aceitunas en cada círculo de repostería y cubra con una cucharada de confit de tomate."], "url": "www_bbc_co_uk_food_recipes_tomato_confit_canapes_28293", "title": "Canapés de tomate confitado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 24 canapés", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_confit_canapes_28293_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 tomates de ciruela, cortados por la mitad", "1 naranja, solo ralladura", "2 cucharadas de tallos y hojas de albahaca finamente picados", "250ml / 3½fl oz de aceite de oliva", "4 dientes de ajo, finamente picados", "1 limón sin cebar, solo cáscara", "sal y pimienta negra recién molida", "1 cucharada de aceitunas verdes, picadas y picadas", "100g / 3½oz de queso de cabra", "1 cucharadita de albahaca picada", "50g / 1¾oz de queso parmesano, rallado", "2 pequeñas flores de calabacín", "1 manojo de albahaca", "30 g / 1 oz de queso parmesano, finamente rallado", "3 cucharadas de piñones", "1 diente de ajo", "150ml / 5fl oz de aceite de oliva", "1 cucharada de harina de auto crianza", "1 cucharada de polenta", "1 cucharadita de pimienta de cayena", "1 huevo de gallinas camperas, golpeado", "1 tomate verde, en rodajas", "puñado de tomates cherry verdes, descuartizado", "rociar aceite de oliva", "llovizna jerez vinagre", "hojas de albahaca bebé"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½.", "Para hacer confitado el tomate, coloque los tomates de ciruela en una bandeja de asar con el resto de los ingredientes. Mezcle bien y sazone con sal y pimienta. Asar durante 4 horas o hasta que esté suave.", "Mientras tanto, para hacer las flores de calabacín al vapor, mezcle las aceitunas con el queso de cabra, la albahaca y el parmesano. Sazonar con sal y pimienta y rellenar las flores del calabacín. Gire las puntas para contener el relleno y el vapor durante 6 minutos.", "Para hacer los tomates fritos con salsa de albahaca, en un procesador de alimentos, mezcle la albahaca, el parmesano, los piñones y el ajo con 100 ml / 3½ fl oz de aceite de oliva para formar una salsa.", "Coloque la harina, la polenta y la pimienta de cayena en un recipiente pequeño y mezcle bien. Pon el huevo batido en un recipiente aparte.", "Sumerja cada rodaja de tomate en el huevo, cubra bien, luego sumérjalo en la mezcla de harina y polenta, volteándolo para cubrirlo.", "Calentar el aceite de oliva restante en una sartén grande a fuego medio y freír las rodajas de tomate durante unos minutos en cada lado.", "Para servir, mezcle los tomates cherry partidos en dos con un poco de aceite de oliva y vinagre de jerez, ponga unos tomates confitados en cada plato, agregue una flor al vapor y unas rodajas de tomate fritas. Rocíe con la salsa de albahaca y esparza sobre algunas hojas de albahaca bebé."], "url": "www_bbc_co_uk_food_recipes_tomato_confit_with_90711", "title": "Confitado de tomate con flores de calabacín al vapor, tomates fritos y salsa de albahaca", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2kg / 4lb 6oz de tomates rojos maduros, picados", "2 chalotes, toscamente picados", "½ cucharadita de salsa Tabasco", "1 cucharada de salsa Worcestershire", "pequeñas hojas de albahaca fresca, más hojas más pequeñas, para servir", "copos de sal marina", "dash aceite de oliva virgen extra", "12 tomates de herencia mixta, cortados en mitades o cuartos"], "method": ["Mezcle los tomates rojos picados, los chalotes, la salsa Tabasco, la salsa Worcestershire y las hojas de albahaca en un procesador de alimentos durante 8-10 segundos hasta que se rompa pero no se prepare, debe parecerse al gazpacho. Sazone, al gusto, con sal, y luego vuelva a pulsar.", "Alinee un colador con una gran pieza de tela de muselina, luego colóquelo sobre un tazón grande. Cuele la mezcla de tomate en la muselina y selle con clavijas o cuerda, luego coloque todo el tazón en la nevera para gotear durante al menos 4 horas o durante la noche, sin presionar o apretar en absoluto.", "Retire el tazón de la nevera y levante el colador y la bolsa de muselina. Agregue un poco de aceite de oliva al líquido filtrado, luego cocine a fuego lento en una cacerola por 12-15 minutos. Sazonar, al gusto, con sal, salsa Worcestershire extra y salsa Tabasco adicional, luego tapar y reservar hasta que esté frío. Enfríe en el refrigerador hasta que esté listo para servir.", "Para servir, vierta el consomé de tomate en tazones y adorne con algunas piezas de los tomates y las pequeñas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_tomato_consomm_86259", "title": "Tomate consumido", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos grandes de gallinas camperas", "1 cucharada de perejil de hoja plana finamente picado o cebollino (opcional)", "2 x 70 g / 2½ oz rebanadas de pan de trigo integral", "1 cucharadita de puré de tomate", "½ cucharadita de salsa Worcestershire", "1 cucharadita de aceite de oliva", "2 tomates, cada uno cortado en cuatro rebanadas gruesas", "sal y pimienta negra recién molida"], "method": ["Agriete los huevos en un tazón ancho y poco profundo, sazone y agregue las hierbas, si las usa. Batir con un tenedor.", "Extienda un lado de cada rebanada de pan con el puré de tomate y espolvoree la salsa Worcestershire.", "Coloque las rebanadas de pan en la mezcla de huevo y remoje durante 5 minutos, dando tres vueltas.", "Calentar el aceite en una sartén a fuego medio. Freír los tomates y el pan empapado en huevo durante 3-4 minutos, volteando hasta la mitad, o hasta que estén ligeramente dorados por ambos lados. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tomato_eggy_bread_36998", "title": "Pan de egipto de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_eggy_bread_36998_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tomate maduro", "1 cucharada de aceite de oliva", "sal y pimienta negra recién agrietada", "1 rebanada de masa fermentada, tostada"], "method": ["Corta el tomate por la mitad y frota la carne en la tostada. Sazonar con sal y pimienta y rociar con aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_tomato_rubbed_toast_65992", "title": "Tomate frotó la tostada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tomato_rubbed_toast_65992_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2kg / 4lb 4oz de tomates maduros mezclados, toscamente picados", "3 dientes de ajo, toscamente picados", "1 puñado de hojas de albahaca fresca, más extra para servir", "1 cucharada de puré de tomate", "4 cucharadas de aceite de oliva, más extra para servir", "1 litro / 1¾ pintas de caldo de verduras calientes", "sal y pimienta negra recién molida", "2-3 cucharadas de azúcar en polvo, al gusto", "150ml / 5fl oz doble crema, más extra para servir", "1 pan de ciabatta, rebanado grueso, para servir"], "method": ["Caliente una cacerola grande de base pesada a fuego medio a alto. Cuando la sartén esté caliente, agregue los tomates y fría por 4-5 minutos, o hasta que hayan comenzado a descomponerse.", "Agregue el ajo, la albahaca, el puré de tomate y dos cucharadas de aceite de oliva. Continúe cocinando durante 1-2 minutos más.", "Vierte el caldo de verduras, lleva la mezcla a ebullición y luego reduce el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 3-4 minutos.", "Transfiera la mezcla de sopa a un procesador de alimentos y mezcle con un puré.", "Regrese la sopa mezclada a la sartén y sazone, al gusto, con sal, pimienta negra recién molida y azúcar.", "Vierta la crema y vuelva a hervir a fuego lento. Continúe cocinando a fuego lento durante 1-2 minutos más.", "Mientras tanto, cepille las rodajas de ciabatta con las dos cucharadas restantes de aceite de oliva.", "Caliente una sartén hasta que esté caliente, agregue las rebanadas de pan ciabatta, en lotes si es necesario, y cocine durante 1-2 minutos en cada lado, o hasta que aparezcan marcas doradas a ambos lados de la ciabatta.", "Para servir, cuela la sopa en cuatro tazones para servir. Rocíe un remolino de crema doble en cada tazón, luego un remolino de aceite de oliva, para adornar. Espolvorea sobre unas hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_tomato_soup_56817", "title": "Sopa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de hojaldre listo para usar", "4 cucharaditas de puré de tomate", "30g / 1oz de queso cheddar rallado", "4 hojas de albahaca fresca, trituradas"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja de hornear con papel resistente a la grasa.", "Haga rodar la masa sobre una superficie enharinada trabajada a un grosor de 3 mm / ⅛ pulg.", "Extiende el puré de tomate por toda la masa. Espolvoreado sobre el cheddar y la albahaca.", "Enrolla bien la masa, luego córtala en 12 rebanadas. Coloque las rebanadas, con el lado cortado hacia arriba en la bandeja de hornear y hornee durante 12-15 minutos o hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_tomato_spirals_39679", "title": "Espirales de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 tomates (300 g / 10½ oz), cortados aproximadamente", "1 cucharadita de aceite de oliva", "½ cebolla (50 g / 1¾oz de peso pelado), finamente picada", "pizca de hojuelas de chile o chile rojo fresco finamente picado", "pizca de sal y pimienta negra recién molida", "15g / ½ oz de cilantro fresco, picado (opcional)"], "method": ["Mezcla todos los ingredientes juntos. Sirve o almacena por hasta tres días."], "url": "www_bbc_co_uk_food_recipes_tomato_salsa_58260", "title": "Salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "2 chalotes de plátano, picados", "1 diente de ajo grande, aplastado", "1 cucharadita de pimienta negra", "1 cucharadita de sal", "2 cucharaditas de comino molido", "1 cucharada de vinagre de vino blanco", "5 tomates realmente maduros, cortados a la mitad", "2 hojas de hojaldre laminado", "8 tomates de ciruela, cortados en rodajas gruesas", "1 huevo de gallina, batido con una pizca de sal", "2 dientes de ajo, aplastados", "100ml / 3½fl oz de aceite de oliva", "racimo pequeño de albahaca fresca, hojas recogidas, tallos reservados", "pequeño manojo de estragón fresco, hojas recogidas, tallos reservados", "2 puñados de berros frescos, hojas recogidas", "sal y pimienta negra", "200g / 7oz de aceitunas Kalamata sin hueso", "3 cucharadas de alcaparras, enjuagadas", "Anchoas de 15 g / ½ onza en aceite (peso escurrido)", "2 cucharadas de perejil de flatillo finamente picado", "Brandy de 25ml / 1oz", "sal y pimienta negra", "llovizna de aceite de oliva"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para el gusto, caliente el aceite de oliva en una olla y fríe con cuidado la chalota y el ajo. Sazonar con pimienta negra, sal y comino molido. Agregue el vinagre de vino blanco y cocine a fuego lento hasta que el volumen de líquido se haya reducido un poco. Agregue los tomates, cubra con una tapa y cocine a fuego lento durante 45-50 minutos, o hasta que tenga una consistencia espesa.", "Para la tarta, forra una bandeja para hornear plana con papel para hornear.", "Recorta cuatro rondas de 16cm / 6¼ pulgadas de las hojas de hojaldre (utiliza un recipiente con 1 litro / 1¾ de pinta como guía). Marque un borde de 15 mm / ¾ pulg en los círculos de repostería (utilice un recipiente de 500 ml / 18 fl oz como guía). Coloque la masa en la bandeja para hornear preparada y pinche los centros con un tenedor.", "Ponga un poco del condimento cocido en el centro de los círculos de repostería. Coloque las rodajas de tomate de ciruela en la parte superior y cepille el borde con huevo batido, asegurándose de no cepillar el borde cortado ya que esto evitará que la masa se levante. Hornee en el horno durante 20 minutos, hasta que la masa se haya levantado y dorado.", "Mientras tanto, haz que la hierba engrase. En una sartén, caliente suavemente el ajo en el aceite de oliva con los tallos de albahaca y los tallos de estragón. Retire del fuego después de 10 minutos y sazone con sal y pimienta.", "Coloque un puñado de hojas de albahaca, hojas de estragón y hojas de berros en un procesador de alimentos pequeño (reserve el resto para la ensalada). Vierta sobre agua hirviendo para marchitar las hojas. Escurra el agua del procesador de alimentos y mezcle las hojas hasta obtener una pasta. Vierta el aceite de hierbas y mezcle nuevamente hasta que quede suave.", "Haga una ensalada con el berro restante, hojas de albahaca y estragón. Sazonar con sal.", "Para hacer la tapenade, mezcle las aceitunas, las alcaparras, las anchoas, el perejil, el brandy y la pimienta negra en un procesador de alimentos pequeño. Aflojar con un poco de aceite de oliva y licuar para hacer una pasta.", "Sirva las tartas cocidas con una pequeña quenelle de tapenade y ensalada de hierbas. Rocíe con el aceite de hierbas."], "url": "www_bbc_co_uk_food_recipes_tomato_tart_with_herb_32067", "title": "Tarta de tomate con aceite de hierbas, tapenade y ensalada de berros y estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250ml / 9fl oz de agua tibia", "1 cucharadita de azúcar en polvo", "1 x 7g / ¼ oz de fácil mezcla de levadura seca", "300g / 10½oz de harina de pan blanco fuerte, más extra para espolvorear", "1 cucharadita de sal", "1-2 cucharadas de aceite de oliva, para engrasar", "Tomates maduros de 425 g / 15 oz, tallos cortados, corte transversal en el fondo de cada", "3 cucharadas de aceite de oliva", "1 chile rojo caliente, sin semillas, finamente picado", "4 dientes de ajo, pelados, finamente picados", "½ cucharadita de sal marina en copos", "½ cucharadita de azúcar en polvo", "10-12 filetes de anchoa, en aceite, escurrido", "2 pizcas grandes de orégano seco", "aceite de oliva virgen extra, para lloviznar"], "method": ["Para la masa de pizza, vierta el agua en un tazón grande y mezcle suavemente el azúcar y la levadura. Déjelo a un lado durante 10 minutos o hasta que el agua tenga una gruesa espuma beige flotando en la parte superior.", "Agregue la mitad de la harina y revuelva suavemente con una cuchara de madera hasta que se incorpore al agua.", "Poco a poco agregue la mitad de la harina restante, revolviendo continuamente, hasta que se haya incorporado al agua.", "Agregue la harina restante y la sal y, con las manos limpias, mezcle hasta que la mezcla se una como una masa suave y esponjosa.", "Inmediatamente, coloque la masa sobre una superficie de trabajo ligeramente enharinada y amasar durante 10 minutos o hasta que quede suave y elástica.", "Engrase un recipiente grande con aceite y coloque la masa en el recipiente. Cepille una lámina de película adhesiva ligeramente con aceite y cubra la masa con ella. Guarde en un lugar cálido durante 45-60 minutos, o hasta que la masa se haya duplicado (probada).", "Precalentar el horno a 240C / 475F / Gas 9.", "Cuando la masa haya demostrado, colóquela sobre una superficie de trabajo ligeramente enharinada y retírela durante 1-2 minutos.", "Divida la masa en dos piezas y extiéndalas hasta que tengan 25 cm de diámetro.", "Coloque cada base de pizza en una bandeja para hornear ligeramente engrasada. Cepille las bases de pizza con un poco más de aceite y cubra ligeramente con otra pieza de película adhesiva ligeramente engrasada. Reserve en un lugar cálido durante 20 minutos, o hasta que se haya duplicado en tamaño nuevamente.", "Transfiera las bases de pizza al horno y hornee por 12-15 minutos o hasta que estén doradas.", "Mientras tanto, para el relleno de pizza, coloque los tomates en un recipiente y cubra con agua hirviendo. Déjelo a un lado durante 30 segundos, luego drene los tomates y retire las cáscaras.", "Cortar los tomates pelados en cuartos, dejando las semillas a un lado en un recipiente aparte. Picar la carne de tomate aproximadamente.", "Calentar el aceite en una sartén a fuego medio. Agregue la guindilla y fría hasta que se haya ablandado.", "Agregue el ajo y continúe freír por no más de 30 segundos.", "Agregue la carne de tomate, la sal y el azúcar y revuelva bien para combinar.", "Transfiera las semillas de tomate reservadas a un colador y, con una cuchara de madera, empuje el jugo de las semillas a través del tamiz en la sartén. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Continúe cocinando a fuego lento la salsa durante 15-20 minutos, o hasta que los tomates se hayan descompuesto y la salsa se haya espesado. Retirar del fuego y reservar para enfriar un poco.", "Cuando la salsa se haya enfriado, extienda una capa delgada sobre las bases de pizza (la salsa restante puede congelarse y cocinarse con pasta). Coloque los filetes de anchoa en forma de reloj encima de la pizza. Espolvorea sobre el orégano seco y rocía sobre el aceite de oliva. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tomatoandanchovypizz_91866", "title": "Pizza de tomate y anchoa", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ manojo de espárragos, extremos recortados", "1 cucharada de vinagre balsámico", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de alcaparras picadas", "150 g / 5½ oz de tomates, cortados a la mitad", "2 cucharadas de perejil picado", "2 cucharadas de albahaca picada"], "method": ["Pon a hervir una olla de agua. Baje los espárragos en el agua hirviendo para hervir durante 2-3 minutos, luego sumerja en un recipiente con agua fría durante un minuto. Desagüe.", "Coloque el vinagre balsámico y el aceite de oliva en un bol y mezcle. Sazone con sal y pimienta negra recién molida, luego agregue las alcaparras.", "Para servir, coloque los espárragos y los tomates juntos en un tazón para servir, vierta sobre la vinagreta y espolvoree sobre las hierbas."], "url": "www_bbc_co_uk_food_recipes_tomatoandasparagussa_84479", "title": "Ensalada de tomate y espárragos con vinagreta de alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["570ml / 1 pinta de vinagre de malta", "450 g / 1 libra de azúcar morena", "Sultanas 300 g / 11oz", "2kg / 4lb 4oz de tomates rojos maduros, cortados en 6 u 8 piezas", "500 g / 1 lb 2 oz manzanas verdes, peladas y picadas", "Chalotes de 400g / 14oz, pelados y toscamente picados", "4 chiles rojos, picados", "1 cucharada de raíz de jengibre, finamente picado", "sal marina y pimienta negra recién molida"], "method": ["Coloque el vinagre y el azúcar en una olla grande y deje que hierva. Cocine por tres o cuatro minutos hasta que el azúcar se haya derretido.", "Agregue las sultanas y cocine hasta que se reduzca.", "Agregue todos los demás ingredientes, lleve a ebullición y cocine durante aproximadamente 20 a 30 minutos, revolviendo con frecuencia.", "Deje la salsa picante con una textura gruesa y no demasiado cocida ya que eso hará que sea un puré.", "Enfríe la salsa picante, colóquela en frascos esterilizados y guárdela durante dos o tres semanas en la nevera."], "url": "www_bbc_co_uk_food_recipes_tomatoandapplechutne_83979", "title": "Chutney de tomate y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 3-4 tarros de mermelada llenos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]