[{"ingredients": ["Harina normal de 375g / 13oz", "Mantequilla 250g / 9oz, ablandada", "125g / 4 oz de azúcar en polvo, más extra para rociar", "1 huevo mediano de gallinas camperas", "2 x 400 g / 14 oz frasco de carne picada", "2 mandarinas, ralladura de ralladura y carne picada", "1 manzana, finamente picada"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Para hacer la masa dulce, frote la harina, la mantequilla, el azúcar y el huevo con un chorrito de agua fría hasta que quede como una masa. No trabaje demasiado la masa. Envuelva la masa en una película adhesiva y déjela a un lado para enfriarla en la nevera mientras realiza el relleno.", "Para hacer el relleno, coloque la carne picada en un bol, ralle la ralladura de las mandarinas en la carne picada, luego pele y corte la fruta. Eche los trozos de mandarina y manzana en el tazón y mezcle con la mano.", "Estirar la masa a un espesor de 3 mm / 1 / 8in. Con un cortador de hojaldre redondo, recorta 6 x 9 cm / 3½ en discos de hojaldre. Presione la masa dentro de los moldes para muffins y llene cada uno con una buena ración de la mezcla de carne picado, de modo que llegue a tres cuartas partes del borde de la taza forrada de repostería.", "Con un cortador de hojaldre acanalado, recorte 6 x 8 cm / 3¼ en círculos de repostería para las tapas (un poco más grandes que la parte superior de las copas para muffins). Coloque una tapa en la parte superior de cada pastel y presione suavemente hacia abajo. Espolvorear con azúcar en polvo.", "Hornee por 20 minutos, luego transfiera a una rejilla para enfriar. Polvo con azúcar glas y servir caliente con crema fresca."], "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_mince_04604", "title": "Tartaletas de Paul Hollywood", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12 pasteles", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_mince_04604_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 1 oz de harina blanca fuerte, más un poco extra para extender", "80g / 3oz de mantequilla suavizada, más un poco más para engrasar la bandeja de hornear", "Azúcar en polvo 80g / 3oz", "2 huevos de gallinas camperas", "5 cucharaditas de polvo de hornear", "250ml / 8½ fl oz de leche", "1 huevo de gallinas camperas, batido con un poco de sal (para glasear)", "mantequilla", "mermelada de fresa o frambuesa de buena calidad", "nata"], "method": ["Precaliente el horno a 220C (asistido por ventilador de 200C) / 425F / Gas 7.", "Engrase ligeramente una bandeja para hornear con mantequilla y cúbrala con papel para hornear o silicona (no a prueba de grasa).", "Ponga 450 g / 15½ oz de la harina en un tazón grande y agregue la mantequilla. Frote la harina y la mantequilla con los dedos para crear una mezcla de pan rallado.", "Agregue el azúcar, los huevos y el polvo de hornear y use una cuchara de madera para girar la mezcla suavemente. Asegúrate de mezclar hasta el fondo e incorporar todos los ingredientes.", "Ahora agregue la mitad de la leche y siga girando la mezcla suavemente con la cuchara para combinar. Luego agregue la leche restante un poco a la vez y junte todo para formar una masa muy suave y húmeda. (Es posible que no necesite agregar toda la leche).", "Espolvoree la mayor parte de la harina restante sobre una superficie de trabajo limpia. Incline la masa suave sobre la superficie de trabajo y espolvoree el resto de la harina encima. La mezcla estará húmeda y pegajosa.", "Use sus manos para doblar la masa por la mitad, luego gire la masa 90 grados y repita. Doblando y girando la mezcla de esta manera (llamado 'rozamiento'), incorporas lo último de la harina y agregas aire. Hazlo varias veces hasta que hayas formado una masa suave. Si la mezcla se vuelve demasiado pegajosa, usa un poco de harina adicional para cubrir la mezcla o tus manos para que sea más manejable. Tenga cuidado de no sobrecargar su masa.", "A continuación, saque la masa: espolvoree la harina sobre la superficie de trabajo y la parte superior de la masa, luego use el rodillo para enrollar desde el centro y luego hacia abajo desde el centro. Gire la masa 90 grados y continúe rodando hasta que tenga aproximadamente 2.5 cm / 1 pulgada de grosor. \"Relaje\" la masa ligeramente levantando los bordes y permitiendo que la masa vuelva a caer sobre la superficie de trabajo.", "Usando un cortador de pasteles, selle las rondas de la masa y colóquelas en la bandeja para hornear. Sumerja el borde del cortador de pasta en harina para que sea más fácil cortar los bollos sin que se peguen. No tuerza el cortador, simplemente presione firmemente, luego levántelo y empuje la masa hacia afuera.", "Una vez que haya cortado 4 o 5 rondas, puede volver a trabajar y volver a enrollar la masa para que sea más fácil cortar las rondas restantes. Cualquier masa sobrante puede ser trabajada y enrollada nuevamente, pero los bollos resultantes no serán tan esponjosos.", "Coloque los bollos en la bandeja de hornear y déjelos reposar durante unos minutos para que el polvo de hornear funcione. Luego use un pincel de pastelería (o su dedo si no tiene un cepillo) para glasear con el batido de huevo y la mezcla de sal. Tenga cuidado de mantener el glaseado en la parte superior de los bollos. (Si corre por los lados, los detendrá aumentando uniformemente).", "Hornee los bollos en el medio del horno durante 15 minutos o hasta que los bollos estén dorados.", "Deje que los bollos se enfríen, luego divídalos por la mitad y agregue mantequilla, mermelada y crema cuajada para servir."], "url": "www_bbc_co_uk_food_recipes_paul_hollywoods_scones_70005", "title": "Bollos de Paul Hollywood", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8 bollos grandes o 15 pequeños", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paul_hollywoods_scones_70005_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 65 g / 2½ oz, tamizada", "pizca de sal", "50 g / 2 oz de mantequilla sin sal, picada en cubitos, más extra para engrasar", "2 huevos de gallinas camperas, golpeados", "200ml / 7fl oz crema batida", "5 cucharaditas de azúcar glas, cernida", "1 cucharadita de extracto de vainilla", "100g / 3½oz de chocolate con leche, picado"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase generosamente una bandeja para hornear con mantequilla.", "Tamiza la harina en una hoja de papel resistente a la grasa.", "Ponga 120ml / 4fl de agua en una sartén de tamaño mediano con la sal y la mantequilla y caliéntelo suavemente hasta que la mantequilla se haya derretido por completo, no deje que el agua hierva y comience a evaporarse. Rápidamente lleve la mezcla a ebullición e incline toda la harina de una sola vez. Retire la sartén del fuego y bata con fuerza con una cuchara de madera. No se preocupe, la mezcla se verá desordenada al principio, pero pronto se unirán para hacer una masa lisa y pesada.", "Vuelva a colocar la sartén a fuego lento y bata la masa durante aproximadamente un minuto para que la masa se cocine ligeramente; debe salir de los lados de la sartén para formar una bola lisa y brillante. Incline la masa en un tazón grande y déjela enfriar hasta que esté tibia.", "Batir los huevos en un tazón hasta que se combinen, luego poco a poco batirlos en la masa con un batidor eléctrico o batidora, o una cuchara de madera, batiendo bien después de cada adición. (Puede que no necesite todo el huevo.) La masa debe ser muy brillante y pegajosa, y caer de una cuchara cuando se agita ligeramente.", "Coloque la masa en una bolsa de plástico con una boquilla lisa de 1,25 cm / ½ pulgadas y una longitud de 12 x 10 cm en la bandeja de horno engrasada.", "Espolvorea la bandeja, no la masa, con unas gotas de agua y hornea en el horno durante 15 minutos. Luego, sin abrir la puerta, reduzca la temperatura del horno a 170 ° C / 325 ° F / Gas 3 y hornee durante 10 minutos, o hasta que estén dorados y crujientes.", "Retire la bandeja del horno y haga un pequeño agujero en el costado de cada éclair para permitir que salga el vapor. Regrese al horno y hornee durante otros cinco minutos o hasta que la masa esté completamente crujiente. Retire del horno y transfiera a una rejilla para enfriar.", "Para el relleno, batir la crema con el azúcar y el extracto de vainilla en un bol hasta que esté tieso.", "Una vez que los éclairs se hayan enfriado, corte la longitud de un lado de cada éclair y pinte en la crema batida.", "Derrita el chocolate sobre una caldera doble o un recipiente suspendido sobre una olla de agua hirviendo (no permita que el fondo del recipiente toque el agua) y deje que se enfríe un poco. Sumerja la parte superior de los éclairs en el chocolate y deje que el chocolate se asiente antes de servir."], "url": "www_bbc_co_uk_food_recipes_pauls_chocolate_clairs_59944", "title": "Eclairs de chocolate de Paul", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de queso pecorino romano (o una alternativa vegetariana)", "250g / 9oz de queso halloumi", "Harina normal de 75 g / 2½ oz", "90g / 3¼ oz de sémola fina", "7g de levadura instantánea", "2 cucharaditas de menta seca", "100 g / 3½ oz de sultanas", "4 huevos grandes de gallinas camperas", "4 cucharadas de leche", "1 cucharadita de polvo de hornear", "750g / 1lb 10 oz de harina llana fuerte, más extra para la elaboración", "1 cucharadita de polvo de masilla (una resina de planta utilizada en la cocción, disponible en tiendas especializadas en línea)", "2 cucharaditas de mahlepi molido, también conocido como mahleb (una especia griega hecha de la piedra molida de la cereza St Lucie)", "1 cucharadita de azúcar en polvo", "1 cucharadita de sal", "7g de levadura instantánea", "60 g / 2¼ oz de mantequilla sin sal, ablandada", "450ml / 16fl oz de leche entera", "200 g / 7 oz de semillas de sésamo", "pizca de vinagre de vino blanco", "3 yemas de huevo de gallinas camperas, ligeramente batidas"], "method": ["Para el relleno, ralle el pecorino romana y el halloumi en un tazón grande. En un recipiente aparte, mezcle la harina común, la sémola, la levadura, la menta seca y las sultanas juntas. Batir los huevos y la leche juntos en una jarra.", "Incline la mezcla de harina sobre el queso y vierta sobre la mezcla de huevo. Mezcle con sus manos. Cubre y deja reposar mientras preparas la masa.", "Para la masa, incline la harina, el polvo de masilla y mahlepi en un tazón. Agregue el azúcar y la sal a un lado del tazón y la levadura al otro. Agregue la mantequilla en el centro de la harina con 350 ml / 12 fl oz de la leche. Combina los ingredientes para formar una masa suave. Poco a poco agregue la leche restante, puede que no lo necesite todo.", "Coloque sobre una superficie enharinada y amasar hasta que quede suave. Vuelva a colocar en el recipiente, cubra y deje reposar durante 1 hora.", "Para el glaseado, coloque las semillas de sésamo, el vinagre y suficiente agua para cubrir en una olla pequeña y llevar a ebullición. Escurra bien y esparza las semillas sobre una toalla de té limpia para que se sequen.", "Precalentar el horno a 200C / 180C Fan / Gas 6. Línea 3 bandejas para hornear con pergamino para hornear antiadherente.", "Divida la masa en trozos grandes y extiéndala en una superficie de trabajo ligeramente enharinada hasta obtener un grosor aproximado de 3 mm / ⅛. Usando un platillo como plantilla, corte en rondas de 12 x 15 cm / 6 pulgadas. Presione firmemente un lado de las rondas de repostería en las semillas de sésamo para cubrirlas.", "Para finalizar el llenado, agregue el polvo de hornear a la mezcla de relleno y divida el relleno en 12. Coloque una porción del relleno en el centro de cada círculo de masa y doble en 3 lados para formar un triángulo redondeado, dejando un espacio en el centro con el relleno expuesto", "Coloque los flaounes en las bandejas para hornear, cepille las partes superiores con la yema de huevo batida y hornee durante 15 minutos. Reduzca la temperatura del horno a 180 ° C / 160 ° C Ventilador / Gas 4 y hornee por otros 15 minutos, o hasta que se dore y se hinche. Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_pauls_flaounas_89782", "title": "Flaunes", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_flaounas_89782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de mantequilla sin sal, derretida", "250ml / 9fl oz de leche entera, calentada", "450g / 1lb de harina de pan integral fuerte, más extra para quitar el polvo", "1 cucharadita de cardamomo molido", "5g de sal", "Paquete de 7 g de levadura instantánea", "40 g / 1½ oz de azúcar en polvo", "½ huevo de corral, batido (aproximadamente 1½ cucharada)", "75g / 2¾oz de mantequilla sin sal, ablandada", "1 cucharadita de pasta de vainilla", "1 cucharada de canela molida", "75g / 2¾oz de azúcar en polvo", "½ huevo de corral, batido (aproximadamente 1½ cda), para cepillar", "100 g / 3½ oz de azúcar en polvo", "150g / 5½oz de azúcar glas", "1 satsuma, ralladura fina solamente"], "method": ["Derrita la mantequilla y caliente suavemente la leche en una cacerola.", "Incline la harina y el cardamomo en un tazón grande para mezclar y agregue la sal a un lado del tazón y la levadura al otro. Agregue la mantequilla, la leche, el azúcar y el huevo y revuelva la mezcla con los dedos. Continúa mezclando hasta que hayas recogido toda la harina de los lados del recipiente. Use la mezcla para limpiar el interior del tazón y continúe hasta que tenga una masa suave.", "Incline la masa sobre una superficie ligeramente enharinada y comience a amasar. Sigue amasando durante 10-12 minutos. Trabaja en la etapa húmeda inicial hasta que la masa comience a formar una piel suave y lisa. Cuando la masa se siente suave y sedosa, colócala en un bol ligeramente engrasado. Cubra y deje que se levante durante 30-40 minutos, hasta que duplique su tamaño.", "Mientras la masa está subiendo, haga el relleno. Ponga la mantequilla y la pasta de vainilla juntas en un recipiente hasta que estén suaves y se puedan untar. En un recipiente aparte, mezcle la canela y el azúcar juntos.", "Cubra una bandeja para hornear con papel de hornear. Convierta la masa en una superficie ligeramente enharinada y retírela. Estirar la masa en un rectángulo, aproximadamente 25x35cm / 10x14in. Gire la masa 90 grados si es necesario, para que tenga un borde largo hacia usted. Fije el borde posterior a la superficie de trabajo, empujando hacia abajo con los dedos, pegando la masa a la superficie de trabajo.", "Extienda la mezcla de mantequilla uniformemente sobre la masa y espolvoree con azúcar de canela. Enrolle la masa con fuerza como un rollo suizo, usando el borde con punta para crear tensión. Coloque en la bandeja preparada.", "Con unas tijeras afiladas limpias, corte el rollo en 15 rebanadas (aproximadamente 2 cm / in en cada una) casi hasta el final. Tira de cada rebanada hacia lados alternos y presiona suavemente con las manos. Coloque la bandeja dentro de una bolsa de plástico limpia y déjela durante 20-25 minutos, o hasta que la masa salte hacia atrás si la pincha ligeramente con el dedo. No más de probar.", "Para el jarabe de azúcar, incline el azúcar y 100 ml / 3 ½ oz de agua en una olla pequeña y deje hervir hasta que el azúcar se derrita. Hierva hasta que se reduzca a la mitad.", "Precaliente el horno a 220C / 200C Ventilador / Gas 6. Cepille la hogaza con huevo batido y hornee por 20-25 minutos hasta que se levante y se dore. Cubra con papel de aluminio después de 10 minutos si se dora demasiado rápido.", "Para la formación de hielo, mezcle el azúcar glas con suficiente agua para hacer un glaseado fino, luego mezcle la satsuma.", "Coloque el pan en una rejilla para enfriar. Cepille con el jarabe de azúcar y luego rocíe sobre la guinda. Deje que se enfríe completamente."], "url": "www_bbc_co_uk_food_recipes_pauls_kanellngd_49838", "title": "Longitud del canal de Paul", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_kanellngd_49838_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz de almendras molidas", "500g / 1lb 2oz de azúcar glas, cernida", "4 claras de huevo de gallinas camperas, ligeramente batidas", "1 cucharadita de extracto de almendra", "aceite vegetal, para engrasar", "sémola, para quitar el polvo", "harina común, para quitar el polvo", "3 claras de huevo de gallinas camperas", "600g / 1lb 5oz de azúcar glas, tamizado", "algunas gotas de colorante de comida roja, o pasta de colorante roja de comida de tamaño de guisante", "Brillo comestible rojo, verde y plateado (disponible en línea o en tiendas especializadas)"], "method": ["Coloque las almendras molidas y el azúcar glas en una batidora eléctrica grande. Agregue las claras de huevo y el extracto de almendras y mezcle con un gancho de masa. Esto podría hacerse a mano, pero es más fácil con un mezclador debido a las grandes cantidades. Cubra el tazón con film transparente y deje enfriar en la nevera durante un mínimo de dos horas, o preferiblemente durante la noche.", "Precalentar el horno a 200C / 400G / Gas 6.", "Cepille ligeramente el interior de los moldes kransekake con aceite vegetal. Espolvoree un poco de sémola en cada molde e incline los moldes para distribuir la sémola uniformemente por el interior, sacudiendo cualquier exceso.", "Divida la masa refrigerada en seis piezas de igual tamaño.", "Divida una de las piezas de masa en tres piezas de diferentes tamaños: una pequeña, una mediana y una grande. Polvore una superficie de trabajo ligeramente con harina y enrolle cada pieza en longitudes de ancho de dedo que sean lo suficientemente largas como para envolver los moldes kransekake.", "Coloque la pieza más larga de masa dentro del anillo kransekake más grande, presionando los extremos juntos para sellar. Haga lo mismo con las piezas de masa de tamaño mediano y más pequeño. Repite este proceso con las cinco piezas de masa restantes.", "Hornee los kransekakes en el horno durante 8-10 minutos, o hasta que estén dorados, luego retírelos del horno y déjelos a un lado para que se enfríen en sus moldes hasta que estén endurecidos. Transfiera a una rejilla para que se enfríe completamente.", "Mientras tanto, para la guinda, bata las claras de huevo en un tazón grande hasta que queden espumosas. Poco a poco bata el azúcar glas una cucharada por vez, hasta que se formen picos fuertes y brillantes cuando se quite la batidora.", "Vierta la mitad del glaseado en un recipiente aparte y agregue el colorante rojo para alimentos. Batir hasta que el glaseado sea de color rojo brillante, luego coloque el glaseado en una bolsa de plástico con una pequeña boquilla para escribir. Con una cuchara, coloque el glaseado blanco en una bolsa de tubos separada con una pequeña boquilla para escribir.", "Para ensamblar el kransekake, clasifique los anillos cocidos en orden de tamaño.", "Vierte unos puntos de glaseado blanco en la base del anillo más grande y pégalo en un plato grande.", "Realice un patrón de zig-zag en el anillo más grande usando primero el blanco, luego el rojo, superponiéndose a los dos. Espolvorear con brillo comestible rojo, verde y plateado.", "Coloque el segundo anillo más grande en la parte superior del anillo más grande y repita el proceso de formación de hielo y decoración.", "Continúa apilando los anillos en orden de tamaño decreciente hasta que tengas una torre de 18 anillos escarchados y brillantes. Deje que se forme la formación de hielo (esto pegará los anillos entre sí) y luego sirva."], "url": "www_bbc_co_uk_food_recipes_pauls_kransekake_83354", "title": "Pastel de guirnalda de Paul", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 tarta grande de corona", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_kransekake_83354_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de harina de pan blanco, más extra para quitar el polvo", "5g de sal", "8g de levadura instantánea", "50 g / 1¾oz de mantequilla sin sal, ablandada, más extra para engrasar", "135ml / 4½fl oz de leche entera", "1 huevo de gallinas camperas, ligeramente golpeado", "90g / 3¼ oz de azúcar en polvo", "Azúcar glas de 140g / 5oz, más extra para quitar el polvo", "220 g / 7¾oz de almendras molidas", "1 naranja, ralladura fina solamente", "1 huevo de gallinas camperas, golpeado", "400 g / 14 oz de carne picada lista para usar", "50g / 1¾oz de mermelada de albaricoque", "200g / 7oz de azúcar glasé", "50 g / 1¾oz de pistachos cortados en astillas", "25g / 1oz de cerezas glacé, más o menos picadas"], "method": ["Para el couronne, incline la harina en un tazón grande para mezclar, luego agregue la sal a un lado del tazón y la levadura a la otra. Agregue la mantequilla, la leche y el huevo y revuelva la mezcla con los dedos hasta que se junte como una masa. Continúe mezclando hasta que los lados del recipiente estén limpios y la masa esté suave.", "Extienda la masa sobre una superficie ligeramente enharinada y amase durante 5-6 minutos, o hasta que la masa deje de ser pegajosa y tenga un exterior liso y sedoso. Regrese la masa al tazón, cúbrala con una película adhesiva y déjela a un lado para comprobar que está en una habitación calurosa durante al menos 30 minutos y hasta una hora.", "Para el mazapán, mezcle el azúcar impalpable, el azúcar glas y las almendras molidas en un tazón grande, agregue la ralladura de naranja y el huevo batido y vuelva a mezclar hasta que los ingredientes estén bien combinados y se hayan unido como una pasta espesa.", "Coloque la pasta sobre una superficie de trabajo ligeramente espolvoreada con azúcar glasé, luego amasar hasta que quede suave. Haga rodar el mazapán en forma de bola, luego envuélvala en una película adhesiva y déjela enfriar hasta que la necesite.", "Cuando la masa de couronne haya duplicado su tamaño, colóquelo en una superficie ligeramente enharinada. Sin tirar hacia atrás, extender la masa en un rectángulo de 33x25 cm / 13x10 pulgadas de tamaño.", "Gire el rectángulo de masa de modo que el borde largo quede hacia usted. Extender una capa uniforme de carne picada por toda la masa.", "Coloque el mazapán en una superficie de trabajo ligeramente enharinada y extiéndalo en un rectángulo de tamaño similar a la masa. Coloque el mazapán sobre la carne picada.", "Ruede la masa con fuerza como un rollo suizo, luego corte el rollo casi por la mitad a lo largo, todo el camino. Gira las dos longitudes de masa juntas formando una espiral, luego une los extremos para formar un anillo.", "Cubra una bandeja para hornear con un pergamino para hornear, luego coloque el couronne sobre el mismo y déjelo a un lado para probar nuevamente durante otros 30-60 minutos, o hasta que la masa retroceda rápidamente cuando se toque ligeramente.", "Cuando el couronne haya probado, precaliente el horno a 210C / 425F / Gas 7.", "Hornee el couronne probado durante 20-25 minutos, o hasta que se levante y dore. Transfiera a una rejilla para enfriar.", "Mientras el couronne se está enfriando, caliente la mermelada de albaricoque con un chorrito de agua en una sartén pequeña a fuego medio hasta que gotee. Pase a través de un tamiz para eliminar cualquier trozo de fruta, luego cepille la mermelada tamizada en toda la couronne caliente para glasear. Dejar de lado para enfriar por completo.", "Justo antes de servir, en un tazón mezcle el azúcar glas con suficiente agua para formar una capa fina y líquida (1-2 cucharadas de agua). Rocíe o roce la guinda sobre el couronne, luego espolvoree sobre las rodajas de pistacho y las cerezas picadas."], "url": "www_bbc_co_uk_food_recipes_pauls_mincemeat_and_33176", "title": "Carne picada y corona de mazapán", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mincemeat_and_33176_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Margarina de 110g / 4oz, más extra para engrasar", "Azúcar en polvo de 110 g / 4 oz", "110g / 4 oz de jarabe de oro", "225g / 8oz de harina autoacabada, más extra para quitar el polvo", "2 cucharaditas de jengibre molido"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase una bandeja para hornear.", "Derrita la margarina, el azúcar impalpable y el jarabe dorado suavemente en una sartén a fuego medio. Una vez derretido, retirar del fuego y enfriar un poco. Agregue todos los ingredientes secos a la sartén para hacer una masa.", "Una vez que esté lo suficientemente frío como para manejarlo, con las manos enharinadas, enrolle la masa en bolas de tamaño 50p. Coloque estas bolas individuales en la bandeja de hornear engrasada con suficiente espacio entre cada galleta para permitir que se extiendan durante la cocción. Marque la parte superior de cada bola con un tenedor. La masa debe hacer aproximadamente 30 galletas.", "Coloque la bandeja para hornear en el horno durante aproximadamente 10 minutos, o hasta que los bizcochos estén dorados.", "Retire del horno, deje que se enfríe un poco y transfiéralo a una rejilla para que se enfríe completamente."], "url": "www_bbc_co_uk_food_recipes_pauls_mums_ginger_72428", "title": "Galletas de jengibre de la madre de Paul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 40 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mums_ginger_72428_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz de mantequilla sin sal o margarina", "Harina autoelevante de 170 g / 6 oz, más extra para quitar el polvo", "20 cucharadita de mermelada, o al gusto"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Frote la mantequilla o la margarina con la harina en un bol hasta que se asemeje a pan rallado. Agregue unas cucharadas de agua para formar una masa.", "Despliegue sobre una superficie ligeramente enharinada. Use un cortador de pasteles para cortar alrededor de 15 formas circulares.", "Coloque cada caja de repostería en una bandeja individual de magdalenas. Agregue una cucharadita de mermelada a cada caso, no demasiado o va a supurar en todas partes.", "Si queda alguna masa sobrante, vuelva a enrollarla y corte formas más pequeñas, ya sean círculos o estrellas, y coloque el atasco para que actúe como las tapas.", "Coloque la bandeja de tartas en el horno y cocine durante unos 30 minutos, o hasta que la masa se haya puesto pálida (verifique las tartas después de 20 minutos)."], "url": "www_bbc_co_uk_food_recipes_pauls_mums_jam_tarts_68845", "title": "Tartas de mermelada de Paul", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_mums_jam_tarts_68845_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "½ cucharadita de sal", "200g / 7oz de mantequilla, refrigerada y en cubos", "180ml / 6fl oz de agua helada", "½ limón, solo jugo", "2 cebollas en rodajas", "2 cucharadas de azúcar en polvo", "2 cucharadas de vinagre balsámico", "600g / 1lb 5oz de carne de salchicha", "1 cucharada de tomillo fresco picado", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado"], "method": ["Tamiza la harina y la sal en un tazón grande y agrega la mantequilla. Mezcle la mantequilla con una cuchara grande de metal para cubrirla de harina. Tenga cuidado de mantener la mantequilla en trozos.", "Mezcle el agua y el jugo de limón en una jarra y viértalo gradualmente en la mezcla de harina y mantequilla.", "Con un cuchillo de punta redonda, corte el contenido del tazón varias veces, girando el tazón continuamente mientras corta la mantequilla en la harina, hasta que la masa se una. La masa está muy húmeda en este punto.", "Inclínala en una superficie de trabajo ligeramente enharinada y rápidamente dale forma a un rectángulo de unos 30cmx20cm / 12inx8in. Con la masa verticalmente en el tablero, doble el tercio inferior de la masa hacia el tercio central, luego el tercio superior hacia abajo sobre los otros tercios. Envuelva la película adhesiva y déjela enfriar durante 10 minutos.", "Saque los pasteles de la nevera y con el borde doblado hacia los lados, vuelva a enrollar la masa en las mismas proporciones que el rectángulo estrecho original y vuelva a doblar de la misma manera. Relajarse de nuevo Repite esto dos veces más. Después de la última etapa de doblado, envuelva la masa con una película adhesiva y déjela enfriar en la nevera durante dos horas.", "Para la salsa picante de cebolla, coloque las cebollas, el azúcar impalpable y el vinagre balsámico en una cacerola mediana. Cocine suavemente, a fuego lento, revolviendo ocasionalmente, durante 15 - 20 minutos o hasta que las cebollas estén suaves, translúcidas y ligeramente caramelizadas.", "Coloque la carne de salchicha, el tomillo picado, la sal y la pimienta negra recién molida en un tazón grande y mezcle bien.", "Cuando la masa esté lista para usar, si es muy firme, deje que se caliente en la habitación durante unos minutos.", "Precaliente el horno a 220 ° C / 425 ° F / Gas 7. Cubra una bandeja para hornear grande con papel para hornear.", "Coloque la masa en una tabla ligeramente enharinada y extiéndala en un rectángulo de 36cmx30cm / 15inx12in. Cortar en 6 rectángulos pares que miden aproximadamente 12cmx15cm / 5inx6in.", "En el lado corto de cada pequeño rectángulo, coloque un cilindro de carne de salchicha sazonada que pesa aproximadamente 100 g / 3½ oz. Extiende un poco de salsa picante de cebolla en la masa restante.", "Moje el borde corto de la masa con un poco de agua y enrolle la salchicha en la masa. Coloque en la bandeja para hornear forrada con la costura debajo. Repita con la salchicha y la masa restante.", "Esmalte cada rollo de salchicha con el huevo batido. En diagonal, recorta cada rollo de salchicha en la parte superior siete veces.", "Cocine durante 30 - 35 minutos o hasta que la masa esté dorada y la salchicha esté bien cocida. Coma caliente o frío."], "url": "www_bbc_co_uk_food_recipes_pauls_sausage_rolls_55041", "title": "Rollos de salchicha de Paul", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 6 rollos de salchicha", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Leche 250ml / 9fl oz", "1 cucharadita de hilos de azafrán", "50 g / 1¾oz de mantequilla sin sal", "500g / 1lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "1 cucharadita de sal", "1 x 7 g de bolsita instantánea de levadura", "50 g / 1 oz de azúcar en polvo", "Queso quark 100g / 3½oz", "aceite vegetal, para engrasar (opcional)", "1 yema de huevo de gallinas camperas, para glaseado", "24 pasas"], "method": ["Caliente la leche en una cacerola pequeña a fuego lento hasta que hierva suavemente. Retire la sartén del fuego, agregue los hilos de azafrán y la mantequilla y déjela a un lado durante 10 minutos, o hasta que el azafrán haya infundido la leche y la leche se haya enfriado un poco.", "Incline la harina en un tazón grande para mezclar, luego agregue la sal a un lado del tazón y la levadura al otro. Agrega el azúcar", "Cuele la leche infundida con azafrán sobre el tazón de harina, luego agregue el quark. Mezcle la mezcla con los dedos hasta que se una como una masa suave y los lados del recipiente estén limpios.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amase durante 5-6 minutos, o hasta que la masa ya no sea pegajosa y tenga un exterior liso y sedoso. Transfiera la masa a un tazón ligeramente engrasado, cubra el tazón con film transparente y déjelo a un lado en un lugar cálido durante 1½-2 horas, o hasta que la masa duplique su tamaño.", "Cepille dos bandejas para hornear con aceite vegetal o polvo con harina.", "Cuando la masa ha demostrado, derribarla, luego dividir en 12 piezas de igual tamaño. Ruede los pedazos de masa en formas de salchichas de 30 cm / 12 pulgadas de largo.", "Doble cuatro de los pedazos de masa en forma de S, enrollando cada extremo de la forma de S con fuerza como un rollo. Coloque en una de las bandejas de hornear preparadas.", "Forma otras cuatro piezas de masa en forma de S, pero esta vez simplemente coloca los extremos de las S-shapes sobre sí mismos en lugar de enrollarlos con fuerza. Coloque dos de las S-shapes en una de las bandejas para hornear preparadas, y coloque las otras dos encima de ellas para crear formas cruzadas.", "Las piezas restantes de masa se pueden modelar en formas de animales tradicionales, como bueyes, gatos y pájaros; alternativamente, doblarlas en forma de S como antes.", "Cubra las formas de masa sin apretar con una película adhesiva y déjelas a un lado para probar nuevamente durante 30-45 minutos, o hasta que hayan duplicado su tamaño.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Cepille las formas de masa con un poco de la yema de huevo batida, luego decore cada forma con dos pasas (para los panecillos en forma de S, coloque las pasas en el centro de cada rollo de masa).", "Hornee los panecillos en el horno durante 12-15 minutos, o hasta que estén ligeramente dorados y cocidos. Dejar de lado para enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_pauls_st_lucia_buns_04825", "title": "Bollos de Santa Lucía", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pauls_st_lucia_buns_04825_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filetes de salmón de 200 g / 7 oz, desollados y deshuesados, cortados en trozos", "pizca de sal", "1 clara de huevo de gallinas camperas pequeñas", "155ml / 5fl oz de crema doble", "pizca de cayena", "½ limón no encerado, ralladura fina únicamente", "1 cucharada de cebollines frescos finamente picados", "1 cucharada de perejil de flatleaf fresco finamente picado", "3 filetes de lenguado de Dover, deshuesado", "250ml / 9fl oz de caldo de pescado", "50ml / 2fl oz de vino blanco seco", "½ chalota, finamente picada", "botón de mantequilla", "50g / 1¾oz de setas, preferiblemente níscalos, desgarrados si son grandes", "micro berros", "sal y pimienta negra recién molida", "3 cucharadas de crema doble", "80 g / 2¾oz de mantequilla sin sal, cortada en trozos", "1 cucharada de perejil de flatleaf fresco picado", "1 cucharada de cebolletas frescas picadas", "jugo de limón, al gusto"], "method": ["Mezcle el salmón con la sal en un procesador de alimentos durante 1-2 minutos, deshaciéndose por los lados con frecuencia. Agregue la clara de huevo y mezcle durante 20 segundos. Agregue la mitad de la crema gradualmente, mezclando todo el tiempo, hasta que tenga una mousse suave. Poner en un bol y colocar sobre hielo. Mezcle la crema restante, la pimienta de cayena, la ralladura de limón y las hierbas. Refrigere por 10 minutos.", "Aplane los filetes de la suela ligeramente. Puntuación del lado de la carne varias veces con un cuchillo afilado. Sazone y extienda la mousse por todo, luego enrolle y asegure con palillos de dientes. Refrigerar al menos una hora.", "Precalentar el horno a 160C / 140C Fan / Gas 3.", "Coloque los rollitos de pescado en una sartén a prueba de horno con el caldo, el vino y la chalota. Lleve a fuego lento a fuego lento, luego cubra con una tapa o papel grasoso con mantequilla. Hornee durante 7-8 minutos, retírelo y déjelo reposar en un lugar cálido durante 4-5 minutos.", "Para la salsa, cuele el líquido de cocción en una olla limpia y cocine a fuego alto hasta que se reduzca a una consistencia de salsa. Agregue la crema doble y bata gradualmente la mantequilla. Agregue las hierbas y el jugo de limón al gusto. Mantener caliente", "Calentar un poco de mantequilla en una sartén. Cuando haga espuma, agregue los champiñones y cocine rápidamente, luego drene.", "Divida los filetes de lenguado entre los platos tibios, espolvoree los champiñones y vierta sobre la salsa. Cubra con el berro y sirva."], "url": "www_bbc_co_uk_food_recipes_paupiette_of_sole_with_48945", "title": "Paupiette de lenguado con setas y salsa de hierbas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 claras de huevo grandes (a temperatura ambiente)", "pizca de sal", "Azúcar en polvo 350g / 12oz", "2 cucharaditas / 10g de harina de maíz", "pizca de crema de tártaro", "1 cucharadita / 5ml de vinagre de vino blanco", "4 gotas de esencia de vainilla", "Crema doble de 300 ml / ½ pinta, firmemente batida", "selección de frutas tropicales preparadas, p. mango, piña, fruta de la pasión."], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja de hornear con papel antigrasa. Dibuja un círculo de 20 cm / 8 pulgadas en el papel.", "Batir las claras de huevo con la mitad del azúcar y la sal en un tazón limpio hasta que se formen picos suaves. Continúa batiendo mientras agregas el azúcar restante hasta que esté tieso y brillante. Espolvorea sobre la harina de maíz, la crema de tártaro, el vinagre y la esencia de vainilla y dóblala suavemente con una cuchara de metal.", "Moldee la mezcla de clara de huevo en el papel dentro del círculo. Aplane la parte superior y alise los lados. Coloque en el horno e inmediatamente reduzca el calor a 150C / 300F / Gas 2 y cocine durante 1¼ horas.", "Apague el horno, deje la puerta entreabierta y deje que se enfríe por completo. Invierta 'Pav' en un plato, empuje suavemente hacia abajo el merengue, luego apile la crema y vístase con la fruta tropical."], "url": "www_bbc_co_uk_food_recipes_pavlova_2949", "title": "Pavlova tropical", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pavlova_2949_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 claras de huevo grandes de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "½ cucharadita de extracto de vainilla", "1 cucharada de harina de maíz", "400 ml / 14 fl oz crema doble", "Fresas de 400g / 14oz, sin casco, reducidas a la mitad si son grandes", "Frambuesas 200 g / 7 oz", "150g / 5oz de arándanos", "3 maracuyá (opcional)", "Grosellas de cabo (opcional)", "ramitas de menta, para decorar", "tamizado azúcar glas, para decorar"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Coloque un plato de 25 cm / 10 in en una hoja de papel para hornear y dibuje alrededor de él. Dé la vuelta al papel y déjelo a un lado.", "Coloque las claras de huevo en un tazón grande y limpio y bata con un batidor eléctrico hasta que estén firmes pero no secos. Están listos cuando puedes girar el recipiente boca abajo sin que se caigan los huevos.", "Poco a poco mezcle el azúcar, una cucharada a la vez, batiendo durante unos segundos entre cada adición. Agregar el azúcar lentamente ayuda a acumular volumen en el merengue y hacerlo rígido y brillante. Finalmente, bata el extracto de vainilla y la harina de maíz hasta que estén bien combinados.", "Pon una pequeña cantidad del merengue en las esquinas de una bandeja o bandeja grande y resistente. Coloque el pergamino para hornear, con el lado dibujado hacia abajo, en la bandeja para hornear, usando los toques de merengue para asegurarlo en la bandeja. Debería poder ver el círculo a través del papel.", "Coloca el merengue en el círculo y dale forma con la parte posterior de una cuchara para servir o una espátula de goma para crear un gran nido de merengue, con suaves picos que se elevan por todos lados. Coloque en el centro del horno y hornee durante 1 hora hasta que quede ligeramente coloreado y crujiente por fuera. (Si el merengue parece estar demasiado marrón, reduzca la temperatura del horno). Después de 1 hora, apague el horno y deje el merengue por una hora más.", "Retirar del horno y dejar enfriar por completo.", "Hasta 2 horas antes de servir, cuidadosamente suelte el merengue del pergamino para hornear, usando una espátula si es necesario, y colóquelo en un plato grande para servir. Batir la crema hasta que se formen picos suaves y cuchara en el centro del merengue. Cubra con las fresas, frambuesas y arándanos, y las grosellas si las usa. Corta la fruta de la pasión y raspa la pulpa.", "Decorar con ramitas de menta y polvo con azúcar glas tamizada para servir."], "url": "www_bbc_co_uk_food_recipes_pavlova_53849", "title": "Pavlova", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pavlova_53849_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro de caldo de verduras (hecho con un cubo común)", "50g / 1¾oz de mantequilla", "1 cebolla, finamente picada", "300g / 10oz de arroz risotto", "Guisantes congelados de 200g / 7oz, descongelados", "125g / 4½oz de queso de cabra suave", "sal y pimienta negra"], "method": ["Mantenga el caldo caliente en una sartén a fuego lento mientras prepara el resto del risotto.", "Caliente una cacerola grande a fuego medio. Agregue la mantequilla y, una vez derretida, agregue la cebolla junto con una pizca de sal. Cocine suavemente hasta que la cebolla esté suave y translúcida. Suba un poco el fuego e incorpore el risotto de arroz, asegurándose de que cada grano esté cubierto con la mantequilla derretida. Cocine el arroz por 1-2 minutos, o hasta que los granos se vuelvan translúcidos en los bordes externos.", "Vierta una cucharada de caldo y revuelva para mezclar con el arroz. Reduzca el calor levemente a medio. Una vez que el material se haya absorbido, agregue otro cucharón y repita, esperando que el material se absorba antes de agregar más. Revuelva continuamente.", "Una vez que se hayan incorporado las tres cuartas partes de las existencias, pruebe y controle el arroz. Debería ser suave pero conservando un ligero mordisco. Continúe agregando la reserva restante si no está completamente cocida. Una vez listo, agregue los guisantes descongelados y reduzca el fuego a bajo. Mezcle bien y deje reposar por 2-3 minutos para calentar los guisantes. Pruebe y ajuste el condimento según sea necesario.", "Justo antes de servir, salpique el risotto con tres cuartas partes del queso de cabra, revolviéndolo para mezclar ligeramente el queso. Servir caliente con el queso de cabra restante salpicado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_pea_and_goats_cheese_26536", "title": "Risotto de queso de guisantes y cabras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "2 chalotes de plátano, pelados y finamente picados", "1 diente de ajo, finamente cortado en cubitos", "Guisantes congelados de 400g / 14oz", "350 ml / 12 fl oz existencias de jamón", "150ml / 5fl oz de crema doble", "sal y pimienta negra recién molida", "Corcho de jamón triturado 125g / 4½oz", "4 cucharadas de crema fresca", "pequeño puñado de berros de bebé", "pequeños brotes de guisantes puñados", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Caliente una cacerola hasta que esté caliente. Agregue la mantequilla, los chalotes y el ajo y fría a fuego lento durante dos minutos, o hasta que los chalotes se hayan suavizado. Agregue los guisantes y el caldo y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 2-3 minutos.", "Enfríe ligeramente y luego transfiéralo a una licuadora. Agregue la crema y mezcle hasta obtener un puré. Regrese la mezcla a la cacerola para calentar, luego sazone al gusto con sal y pimienta negra recién molida.", "Para servir, vierta la sopa en tazones para servir y cubra con una cucharada de jamón picado y crème fraîche. Cubra con algunos berros de bebé y brotes de guisantes y termine con un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_pea_and_ham_soup_55777", "title": "Sopa de guisantes y jamón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de caldo de pollo", "500 g / 1 libra de guisantes congelados 2 oz", "10g / ½ oz de hojas frescas de estragón", "pizca de sal", "4 rebanadas muy finas de panceta (cortadas en la configuración más fina posible)"], "method": ["Caliente el caldo de pollo en una cacerola hasta que esté hirviendo a fuego lento. Agregue los guisantes y cocine a fuego lento durante 2 minutos, o hasta que estén tiernos. Agregue el estragón y la sal.", "Transfiera la mezcla a un procesador de alimentos y mezcle por unas pocas ráfagas cortas con una sopa de textura rugosa. Regrese la sopa a la cacerola y manténgala caliente a fuego lento.", "Con un par de pinzas, caliente cada rebanada de panceta sobre la llama de gas de su cocina por unos segundos hasta que se ablande. (Alternativamente, precaliente la parrilla a su configuración máxima, coloque las rebanadas de panceta en una bandeja para hornear y ase a la parrilla durante 1-2 minutos, o hasta que estén crujientes).", "Para servir, ponga la sopa en cuencos. Rompa la panceta crujiente en trozos y espolvoree encima de la sopa."], "url": "www_bbc_co_uk_food_recipes_pea_and_pancetta_soup_82240", "title": "Sopa de guisantes y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pea_and_pancetta_soup_82240_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de guisantes frescos", "2 cucharadas de tahini", "1-2 cucharadas de jugo de limón recién exprimido", "¼ cucharadita de comino molido", "pizca de sal, o al gusto", "2 cucharadas de cilantro fresco picado", "1-2 cebollas de primavera, cortadas, finamente picadas", "patatas fritas vegetales o totopos, para servir"], "method": ["Hervir los guisantes en una sartén de agua ligeramente salada durante 2-3 minutos o hasta que estén tiernos. Drene bien, luego enjuague con agua corriente fría.", "Amasar la mitad de los guisantes y mezclar los restantes en un puré suave utilizando una licuadora de mano.", "Mezcle los guisantes triturados y en puré en un tazón, luego mezcle el tahini, el jugo de lima, el comino y la sal, al gusto. Agregue el cilantro y cebollas tiernas.", "Sirve con patatas fritas o chips de tortilla."], "url": "www_bbc_co_uk_food_recipes_pea_hummus_74694", "title": "Hummus de guisante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 huevos de gallinas camperas", "50g / 1¾oz de harina natural", "Pan rallado Panko de 100g / 3½ oz", "aceite vegetal, para freír", "500 g / 1 libra de guisantes congelados 2 oz, descongelados", "cucharón caldo de jamón caliente, de la cocina o de un cubo", "puñado de guisantes frescos", "10 mangetout", "Corcho de jamón cocido 300g / 10½oz, rallado", "Brotes de guisantes de 75 g / 2½ oz", "2 ramitas de menta fresca, hojas recogidas", "25 g / 1 oz de virutas de parmesano", "3 cucharadas de aceite de oliva", "½ limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Cocine dos huevos en una olla con agua hirviendo durante 4 minutos, hasta que estén cocidos. Enfriar en agua fría y pelar con cuidado.", "Batir el huevo restante en un recipiente poco profundo. Ponga la harina en un segundo tazón poco profundo y sazone. Coloque las migas de pan en un tercer tazón poco profundo. Enrolle cada huevo hervido en la harina, luego el huevo batido y luego el pan rallado.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso dos tercios llena con aceite vegetal. Caliente a 180 ° C (un cubo de pan debe dorarse en un minuto cuando lo deje caer). PRECAUCIÓN: El aceite caliente puede ser peligroso. No dejes desatendido Freír los huevos durante 3-4 minutos, hasta que estén dorados", "Mientras tanto, mezcle los guisantes descongelados con el caldo de jamón caliente en un procesador de alimentos. Pase el puré por un colador fino. Debe tener la consistencia de crema doble.", "Escalde los guisantes frescos y el mangetout en agua hirviendo durante 30 segundos. Escurrir y refrescar en agua fría.", "En un tazón, mezcle los guisantes blanqueados y el mangetout, el jamón, los brotes de guisantes, la menta y el parmesano. Vístase con el aceite de oliva y un chorrito de jugo de limón. Verifica el condimento.", "Para servir, espolvorea el puré de guisantes en el fondo de los cuatro platos para servir. Apile la ensalada de jamón y cubra con los huevos crujientes."], "url": "www_bbc_co_uk_food_recipes_pea_ham_and_mint_salad_30019", "title": "Ensalada de guisantes, jamón y menta con un huevo crujiente", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "Harina de auto aumento de 150g / 5oz", "1 cucharadita de polvo de hornear", "50ml / 2fl oz crema", "Guisantes congelados de 100 g / 4 oz, descongelados", "sal y pimienta negra recién molida"], "method": ["Calentar una sartén profunda de fondo grueso, un tercio llena de aceite vegetal, hasta que la miga de pan chisporrotee suavemente en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "Mientras tanto, coloque la harina y el polvo de hornear en un bol. Agregue la crema y bata bien para hacer una masa espesa.", "Agregue los guisantes y revuelva. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Con cuidado, coloque cucharadas de la mezcla en el aceite caliente y cocine durante 1-2 minutos, hasta que estén doradas. Retirar con una cuchara ranurada y escurrir sobre papel de cocina y servir caliente."], "url": "www_bbc_co_uk_food_recipes_peaandbriefritters_79903", "title": "Buñuelos de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]