[{"isVegetarian": false, "title": "Risotto al horno", "url": "www_bbc_co_uk_food_recipes_baked_risotto_72566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "50g / 2oz de arroz arborio risotto", "½ pimiento rojo, tallo y semillas retirados, picados", "1 cebolla de primavera, cortada, rebanada", "1 cucharada colmada de guisantes congelados", "2 champiñones pequeños, pelados, picados o rotos", "50g / 2oz de pollo sobrante cocido, picado", "125-150 ml de agua hirviendo", "gran acción de pellizco o polvo de caldo"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Engrase un plato tapado para horno con un poco de aceite y vierta el arroz. Agregue el pimiento rojo, la cebolla tierna, los guisantes, los champiñones y el pollo y revuelva hasta que estén bien combinados.", "Vierta el agua hirviendo y agregue el caldo en polvo o caldo. Cubra el plato con la tapa.", "Transfiera el plato al horno y hornee durante 15 minutos o hasta que el arroz esté tierno. Dejar enfriar un poco antes de servir."]}, {"isVegetarian": false, "title": "Salmón al horno con arroz al chorizo", "url": "www_bbc_co_uk_food_recipes_baked_salmon_with_00771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_salmon_with_00771_16x9.jpg", "ingredients": ["100g/3½oz chorizo", "1 cebolla, en rodajas", "1 diente de ajo, en rodajas", "200g / 7oz de arroz de grano corto como el arroz arborio", "4 tomates, toscamente picados", "50g / 2oz de mantequilla", "1 cucharada de perejil", "600ml / 20fl oz de caldo de pollo", "sal y pimienta negra recién molida", "4 x 150 g / 5 oz de filetes de salmón, desollados", "Salmón ahumado 250 g / 9 oz", "1 limón, solo jugo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente una sartén de base pesada a fuego medio y fría el chorizo ​​durante 3-4 minutos, o hasta que esté crujiente. Retire el chorizo ​​de la sartén con una espumadera y déjelo a un lado.", "Freír la cebolla y el ajo en el aceite restante durante 3-4 minutos o hasta que estén suaves.", "Coloque el chorizo, la cebolla, el ajo, el arroz, los tomates, la mantequilla y el perejil en una cacerola bien untada. Sazonar con sal y pimienta negra recién molida.", "Verter sobre el caldo de pollo, cubrir con una tapa hermética y hornear en el horno durante unos 25-30 minutos, o hasta que el arroz esté cocido.", "Mientras tanto, envuelva cada filete de salmón en salmón ahumado y recorte el exceso de carne. Sazonar con sal y pimienta negra recién molida y exprimir con el jugo de limón.", "Ase las piezas de salmón en el horno durante 6-8 minutos o hasta que estén bien cocidas.", "Sirva el salmón encima del arroz con chorizo."]}, {"isVegetarian": true, "title": "Samosas al horno", "url": "www_bbc_co_uk_food_recipes_baked_samosas_69255", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_samosas_69255_16x9.jpg", "ingredients": ["Papas 100g / 4oz, peladas", "Zanahorias 100g / 4oz, picadas", "Guisantes 100g / 4oz", "2 cucharadas de aceite de oliva", "¼ cucharadita de semillas de comino", "1 cebolla picada", "2 chiles verdes, finamente picados", "¼ cucharadita de sal", "¼ cucharadita de cilantro molido", "pizca sal masala", "puñado de hojas de cilantro, picadas", "Harina integral de 300g / 11oz, más un poco adicional para la \\\"pasta similar al pegamento\\\" y un poco más para enharinar", "2 cucharaditas de aceite de oliva", "pizca de sal", "salsa picante de tomate o salsa de tomate, para servir"], "serves": "Hace aproximadamente 12 samosas pequeñas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el relleno, hierva las papas en una sartén con agua salada hirviendo durante aproximadamente 10-15 minutos, o hasta que estén tiernas. Escurra, revuelva aproximadamente las papas y déjelas a un lado.", "Mientras tanto, ponga a hervir otra olla de agua y cocine las zanahorias durante unos minutos, escurra y reserve. Ponga a hervir una tercera olla de agua y cocine los guisantes por unos minutos, escurra y reserve.", "Para el relleno, caliente el aceite de oliva en una sartén, agregue las semillas de comino y, cuando empiecen a chisporrotear, agregue la cebolla y los chiles. Freír durante 6-7 minutos, o hasta que se ablanden.", "Mezcle la sal, el cilantro y el garam masala, y saltee por un minuto. Agregue las zanahorias y los guisantes y fría por un par de minutos.", "Agregue el puré de papa y las hojas de cilantro, y mezcle bien hasta que todos los ingredientes se mezclen.", "Para la masa, coloque la harina, el aceite, la sal y 6-7 cucharadas de agua en un tazón.", "Usando sus manos, amasar en una masa durante 5-8 minutos.", "Mezcle un poco de harina y agua en un tazón pequeño para hacer una pasta similar al pegamento. Coloque esta mezcla a un lado.", "Divida la masa en trozos del tamaño de una pelota de golf y, en una superficie enharinada, extiéndalos en círculos delgados de unos 7,5 cm / 5 pulg. De diámetro y 3 mm de grosor, luego corte cada círculo por la mitad.", "Aplica el \\\"pegamento\\\" en el borde recto de un semicírculo. Dóblalo para hacer una forma de cono, sellando el borde recto pegado, luego levanta el cono con el extremo cónico en la parte inferior y llénalo con aproximadamente una cucharada de la mezcla de vegetales. Selle la samosa con un poco más de pegamento, presionando los bordes firmemente juntos. Repite el proceso hasta que todos los pasteles se hayan agotado.", "Coloque las samosas en una bandeja para hornear y colóquelas en el centro del horno. Hornee por 25-30 minutos, volteándolos una vez hasta la mitad de la cocción hasta que estén ligeramente dorados.", "Servir caliente con salsa picante de tomate o ketchup."]}, {"isVegetarian": false, "title": "Lubina al horno, mayonesa de perejil y pesto de trufa de nueces", "url": "www_bbc_co_uk_food_recipes_baked_sea_bass_parsley_49527", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["manojo de perejil fresco de flatleaf, solo hojas", "700ml / 1pint 4fl oz de aceite vegetal", "2 yemas de huevo de gallinas camperas", "Vinagre de vino blanco 110ml / 3½fl oz", "1 cucharada de mostaza inglesa", "1 limón, solo jugo", "150ml / 4½fl oz de aceite de oliva virgen extra", "Nueces 250g / 9oz", "1 diente de ajo", "2 ramitas de tomillo fresco, hojas recogidas", "15g / ½ oz de trufa negra fresca", "10g / ¼ oz de parmesano rallado", "2 cucharaditas de aceite de trufa blanca", "4 filetes de lubina, huesos de alfiler eliminados", "1 limón, ralladura solamente", "2 cucharadas de aceite de oliva virgen extra", "2 escarola roja, hojas separadas y colocadas en agua helada", "Micro berro de perejil 10g / ½ oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la mayonesa de perejil, mezcle el perejil y el aceite vegetal en una licuadora hasta que quede suave. (Esto llevará de 1 a 2 minutos)", "Mezcle las yemas de huevo, vinagre y mostaza en un procesador de alimentos hasta que estén bien combinados. Con el motor en marcha, agregue lentamente el aceite de perejil para formar una mayonesa espesa.", "Sazonar con sal, pimienta negra recién molida y un chorrito de jugo de limón.", "Para el pesto de trufa de nueces, caliente el aceite de oliva y las nueces en una sartén a fuego medio durante 4-5 minutos o hasta que estén doradas. Dejar de lado para enfriar.", "Mezcle las nueces refrigeradas y el aceite de oliva, tomillo, ajo, trufa, parmesano y aceite de trufa blanca en un procesador de alimentos hasta que quede suave.", "Para la lubina, precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja de horno grande en el horno. Recorte cuatro cuadrados de papel resistente a la grasa de 10cm / 4 in.", "Cortar los filetes de lubina en un ángulo en rodajas gruesas de 0.5cm / ¼. Divida las rebanadas entre los cuadrados de papel antigrasa, superponiendo cada rebanada ligeramente.", "Sazone con sal y ralladura de limón y rocíe sobre el aceite de oliva.", "Coloque las rodajas de lubina sobre la bandeja de horneado precalentado y tueste durante 2-3 minutos.", "Escurra las hojas de endivias, seque y mezcle con el pesto de trufa.", "Para servir, coloque la lubina en el centro de los platos para servir y rocíe un poco de mayonesa de perejil en la parte superior. Coloque las hojas de escarola alrededor del borde y esparza sobre el berro de perejil."]}, {"isVegetarian": false, "title": "Besugo al horno Rota-style", "url": "www_bbc_co_uk_food_recipes_baked_sea_bream_28386", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sea_bream_28386_16x9.jpg", "ingredients": ["3 papas cerosas grandes, peladas y cortadas en rodajas gruesas", "5 cucharadas de aceite de oliva", "1 cebolla grande, en rodajas", "1 diente de ajo, picado", "1 pimiento verde grande, sin semillas, en rodajas", "Tomates de 300 g / 10½ oz, desollados y picados", "1 hoja de laurel", "2 x 400 g / 14 oz de dorada entera, a escala y eviscerado", "½ limón, solo jugo", "4 cucharadas de jerez seco", "pequeño puñado de perejil flatleaf, hojas picadas, para servir", "sal y pimienta negra recién molida", "pequeño puñado de perejil, picado", "2 dientes grandes de ajo, toscamente picados", "½ cucharadita de sal marina"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque las papas en un plato resistente al horno lo suficientemente grande como para dar cabida al besugo. Sazonar con sal y pimienta y rociar con 2 cucharadas de aceite. Hornea por 20 minutos.", "En una sartén con tapa, caliente 2 cucharadas de aceite a fuego medio-bajo. Freír la cebolla, el ajo y la pimienta durante 10-15 minutos o hasta que estén suaves. Agregue los tomates, la hoja de laurel y un poco de agua, cubra con una tapa y cocine durante 15 minutos.", "Sazonar el pescado con ½ cucharadita de sal y 10 vueltas del peppermill negro. Coloque encima de la papa cocida.", "Para hacer que la picada, usando un mortero y una mano, muela el perejil, el ajo y la sal juntos, luego sepárelo sobre el pescado.", "Agregue 4 cucharadas de agua y el jugo de limón al plato, luego vierta la mezcla de tomate sobre todo. Rocíe el aceite restante y el jerez y hornee durante 20-25 minutos. Esparce el perejil sobre la parte superior y sirve inmediatamente."]}, {"isVegetarian": false, "title": "Cangrejo araña cocido al horno", "url": "www_bbc_co_uk_food_recipes_baked_spider_crab_97729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250 g / 9 oz recogido de carne de cangrejo araña, caparazón reservado", "aceite de oliva", "3 dientes de ajo, en rodajas", "1 chalote de plátano, muy finamente picado", "Vino de txakoli para deglazing (o use un vino blanco espumoso seco)", "50ml / 2fl oz de brandy", "250g / 9oz de tomates cherry", "1 masa madre pequeña, solo adentro (descarte la corteza), rota en migas de pan finas", "1-2 cucharadas de salsa picante de sriracha, al gusto", "50g / 1¾oz de mantequilla", "pequeño puñado de perejil fresco picado", "Una pizca de sal marina", "500g / 1lb 2oz secreto Iberico (un corte de cerdo, tomado de entre el omóplato y el lomo)", "1 huevo de gallinas camperas, frito, para servir", "puñado de hojas de remolacha, para decorar"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "En un wok caliente, cocine el caparazón de cangrejo con un poco de aceite de oliva durante unos minutos. Retire la cáscara y luego agregue el ajo y la chalota a la sartén, con más aceite si es necesario. Cocine hasta que se ablande. Desglaze la sartén con el vino y el brandy. Incline la sartén a la llama para que flamee (PRECAUCIÓN: Mantenga la cara y el cabello alejados de las llamas. No los deje solos). Agregue los tomates cherry y cocine hasta que se descompongan.", "Agregue la carne de cangrejo araña, pan rallado, salsa picante y sazone con sal. Calentar hasta que esté tibia y agregar la mantequilla y el perejil.", "Vuelva a colocar en la cáscara y hornee hasta que esté dorado en la parte superior.", "En una sartén cocine el secreto ibérico en una gota de aceite hasta que se dore y sea medio raro.", "Para servir coloque el caparazón de cangrejo en el plato y cubra con el huevo. Corte la carne de cerdo en tiras y colóquela junto al cangrejo con las hojas de remolacha."]}, {"isVegetarian": true, "title": "Manzanas rellenas al horno en sidra", "url": "www_bbc_co_uk_food_recipes_baked_stuffed_apples_in_20729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 manzanas Bramley o Granny Smith", "4 cucharadas de pasas", "2 cucharadas de carne picada", "2 cucharadas de almendras molidas", "570ml / 1 pinta de sidra", "225 g / 8 oz de azúcar en polvo", "Crema doble 175ml / 6fl oz", "55 g / 2 oz de mantequilla"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180 ° C / 350 ° F / Gas 4. Recorte la base de cada manzana y, utilizando un descorazonador, saque los núcleos. Corta una pequeña ranura en el centro de cada manzana horizontalmente.", "Mezcle las pasas, la carne picada y las almendras molidas y empaquételas en los núcleos de las manzanas.", "Coloque las manzanas en una fuente para hornear y vierta más de 450 ml / 16 fl oz de sidra.", "Hornee durante 25-30 minutos, luego déjelos reposar durante 10 minutos.", "Vierta la sidra del plato en una cacerola y caliéntela para reducirla en volumen hasta que esté ligeramente almibarada. Use el jarabe para glasear las manzanas.", "En una sartén, caliente el azúcar y la sidra restante y cocine a ebullición. Reduzca el fuego y cocine hasta que esté caramelizado en un color dorado, luego déjelo enfriar un poco.", "Mientras tanto, en una sartén por separado, llevar la crema a ebullición. Vierta la crema en el almíbar, agregue la mantequilla y mezcle bien.", "Sirva las manzanas horneadas con el jarabe de crema."]}, {"isVegetarian": false, "title": "Spaghetti horneado", "url": "www_bbc_co_uk_food_recipes_baked_spaghetti_07628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cebolla de primavera, cortada, rebanada", "2 tomates secados al sol, finamente picados", "3 aceitunas negras, picadas, picadas", "1 tocino lonchas, cocinado hasta que esté crujiente, picado", "Espagueti de 50g / 2oz", "100ml / 3½fl oz de agua hirviendo", "200g / 7oz de tomates picados enlatados", "pizca de caldo en polvo", "pizca de pimentón", "queso rallado, para servir"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 450F / Gas 7.", "Coloque las cebolletas, los tomates secados al sol, el tocino y las aceitunas en un plato con tapa para horno.", "Ajustar los espaguetis hasta que los hilos sean lo suficientemente cortos como para caber dentro de la fuente del horno. Agregue los filamentos de spaghetti al plato y vierta sobre el agua hirviendo y los tomates cortados. Revuelva bien y espolvoree el caldo en polvo y el pimentón.", "Cubra la fuente del horno con la tapa y transfiérala al horno durante 25 minutos, o hasta que los espaguetis estén cocidos.", "Guarde para enfriar un poco, luego sirva espolvoreado con un poco de queso rallado."]}, {"isVegetarian": true, "title": "Batata al horno con frijoles negros fáciles y ensalada de col morada", "url": "www_bbc_co_uk_food_recipes_baked_sweet_potato_with_28134", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sweet_potato_with_28134_16x9.jpg", "ingredients": ["1 camote mediano (aproximadamente 350g / 12oz), lavado y secado", "2 cucharadas de aceite de oliva", "½ cebolla pequeña, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de semillas de comino", "pizca de hojuelas de chile, al gusto", "400g de frijoles negros de hojalata, escurridos", "100ml / 3½fl oz de caldo de verduras, de un cubo", "sal y pimienta negra recién molida", "25g / 1oz de queso cheddar, rallado, para servir", "¼ repollo rojo pequeño, en rodajas finas", "5 rábanos, en rodajas finas", "½ cebolla roja, finamente rebanada", "algunas ramitas de cilantro, más o menos picadas", "½ lima, solo jugo", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y coloque una hoja de papel de cocina en el estante del medio.", "Frote la batata con media cucharadita de aceite de oliva y un poco de sal. Perfore la piel varias veces con un cuchillo afilado y colóquela directamente en el estante superior del horno y hornee durante 1 hora.", "Mientras tanto, caliente el aceite de oliva restante en una cacerola pequeña a fuego medio y fría la cebolla y el ajo durante 2 minutos. Agregue los copos de comino y chile y fría por otros 2 minutos hasta que estén suaves y fragantes. Agregue los frijoles negros y el caldo y cocine a fuego lento durante 20-30 minutos o hasta que el líquido se haya evaporado y los granos estén suaves y comenzando a desintegrarse. Sazonar con sal y pimienta y reservar.", "Para el repollo morado, mezcle el repollo, los rábanos, la cebolla, el cilantro y el jugo de lima en un recipiente y sazone con sal y pimienta.", "Verifique que la papa esté cocida perforando con un cuchillo sin filo. Cuando termine, apague el horno y deje la papa por 15 minutos mientras recalienta los frijoles.", "Para servir, romper la papa abierta y esponjar la carne con un tenedor. Coloque una cucharada sobre una generosa ración de frijoles y cubra con el queso. Sirve con la col en el lado."]}, {"isVegetarian": true, "title": "Batata al horno con verduras asadas y trigo bulgur", "url": "www_bbc_co_uk_food_recipes_baked_sweet_potato_with_42313", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_sweet_potato_with_42313_16x9.jpg", "ingredients": ["1 camote mediano (aproximadamente 350g / 12oz), lavado y secado", "2 cucharadas de aceite de oliva", "½ bulbo de hinojo, en rodajas finas", "½ pimiento rojo, cortado en cubos de 2cm / ¾in", "½ cebolla roja, cortada en cuñas", "pequeño puñado de tomates cherry", "50g / 1¾oz de trigo bulgur", "2 ramitas de eneldo, más o menos picadas", "sal y pimienta negra recién molida", "2 cucharadas de yogur natural, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 y coloque una hoja de papel de cocina en el estante del medio.", "Frote la batata con media cucharadita de aceite de oliva y un poco de sal. Perfore la piel varias veces con un cuchillo afilado, colóquela directamente en el estante superior del horno y hornee durante 1 hora.", "Mientras tanto, coloque las verduras en una bandeja de tostado de tamaño mediano, rocíe con el aceite de oliva restante y mezcle bien. Sazone con sal y pimienta y tueste durante 20-25 minutos o hasta que esté suave y comenzando a dorarse en los bordes.", "Coloque el trigo bulgur en un tazón resistente al calor y vierta suficiente agua hirviendo como para cubrirlo, envuélvalo bien con una película adhesiva y déjelo reposar durante 30 minutos.", "Verifique que la papa esté cocida perforando con un cuchillo sin filo. Cuando termine, apague el horno y deje la papa por 15 minutos mientras ensambla el relleno.", "Pelusa el trigo bulgur con un tenedor, luego inclínelo en la bandeja con las verduras asadas y mezcle bien para combinar. Agregue el eneldo y mezcle de nuevo.", "Para servir, rompa la papa abierta y esponje el interior con un tenedor, cubra con el trigo bulgur y la mezcla de vegetales y una cucharada de yogurt natural."]}, {"isVegetarian": true, "title": "Tarta de vainilla al horno con ciruelas Earl Grey", "url": "www_bbc_co_uk_food_recipes_baked_vanilla_tart_with_20763", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_vanilla_tart_with_20763_16x9.jpg", "ingredients": ["125g / 4½ oz de ciruelas pasas", "500ml / 17fl oz de té Earl Grey caliente (use 4 bolsitas de té)", "Harina normal de 250g / 9oz, más extra para espolvorear", "45g / 1¾oz de azúcar glas", "pizca de sal", "75g / 2¾oz de mantequilla sin sal refrigerada, picada en cubitos, más extra para engrasar", "2 yemas de huevo de gallinas camperas, batidas", "Almendras molidas 15 g / ½ oz", "750ml / 1¼ pintas de crema doble", "2 vainas de vainilla o 2 cucharaditas de extracto de vainilla", "12 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo"], "serves": "Sirve 8-10", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para las ciruelas empapadas en Earl Grey, coloca las ciruelas pasas en un tazón y vierte sobre el té caliente. Cubra y reserve hasta que las ciruelas pasas hayan absorbido el líquido (aproximadamente una hora).", "Para la masa, tamice la harina, el azúcar glas y la sal en un tazón grande. Agregue la mantequilla y frótelo en la mezcla de harina con las puntas de los dedos, hasta que la mezcla se asemeje a pan rallado. (Alternativamente, mezcle hasta obtener una consistencia similar a la miga en un procesador de alimentos).", "Agregue las yemas de huevo batidas (reservando un poco para el glaseado) y almendras molidas y mezcle o mezcle con las manos hasta que la mezcla se una como masa. Trata de no sobrecargar la masa. Envuelva la masa en una película adhesiva y enfríe en la nevera durante al menos 30 minutos y hasta una hora.", "Precaliente el horno a 160C / 325F / Gas 3. Engrase una lata agria de fondo suelto de 28cm / 11in con mantequilla y polvo con harina.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada hasta un grosor de aproximadamente 2 mm, teniendo cuidado de no rasgarla. Con cuidado, enrolle la masa alrededor del rodillo y forre la lata de tarta preparada con ella, presionando ligeramente la masa en la base y los lados (deje cualquier exceso de saliente).", "Alinee la caja de repostería con papel de hornear y luego rellene con arroz crudo o alubias para hornear. Hornee la caja de tarta en el horno durante 10 minutos, luego quite el papel de hornear y hornear los frijoles y cepille la base con la yema de huevo batida. Regrese la caja agria al horno para hornear por otros 5-10 minutos, o hasta que estén crujientes y doradas. Poner a un lado para enfriar, luego recortar cualquier pastel colgante.", "Para el relleno de vainilla, caliente la crema y las vainas de vainilla o extraiga en una cacerola a fuego medio hasta que empiece a hervir. Batir los huevos y el azúcar en un bol hasta que estén pálidos y esponjosos.", "Poco a poco vierta la crema caliente sobre la mezcla de huevo, batiendo bien para combinar, luego regrese la mezcla a la cacerola y cocine a fuego lento hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara.", "Vierta el relleno de vainilla en la caja de pastelería y hornee en el horno durante 20-25 minutos, o hasta que se haya establecido el llenado.", "Para servir, corte la tarta y cubra cada porción con las ciruelas empapadas en Earl Grey."]}, {"isVegetarian": false, "title": "Pastel de queso al horno galés", "url": "www_bbc_co_uk_food_recipes_baked_welsh_cake_68115", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_welsh_cake_68115_16x9.jpg", "ingredients": ["Harina de auto aumento de 450 g / 1 lb, más extra para quitar el polvo", "pizca de sal", "120 g / 4½ oz de manteca de cerdo", "120g / 4½oz de mantequilla", "120 g / 4½ oz de azúcar en polvo, más extra para rociar", "50g / 1¾oz de gotas de chocolate blanco", "75g / 2½ oz de arándanos secos, picados", "2 huevos de gallinas camperas, golpeados", "1-2 cucharadas de leche, si es necesario", "12-14 galletas digestivas, o 15 pequeñas tortas", "50g / 1¾oz de mantequilla, más extra para engrasar", "½ cucharadita de canela molida", "½ cucharadita de nuez moscada molida", "600g / 1lb 5oz de queso crema", "2 cucharadas de harina normal", "175g / 6oz de azúcar en polvo", "3 gotas de esencia de vainilla", "2 huevos de gallinas camperas", "1 yema de huevo de gallinas camperas", "Crema agria de 142g / 5oz"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para las tortas galesas, incline la harina en un tazón grande y agregue la sal. Frota la manteca y la mantequilla en la harina hasta que la mezcla se asemeje a pan rallado. Agregue el azúcar impalpable, luego agregue el chocolate blanco y los arándanos y mezcle hasta que estén bien combinados. Agregue los huevos y mezcle con las manos hasta que la mezcla se una en una masa suave, agregando leche si es necesario para aflojar la masa. Enrolle la mezcla sobre una superficie de trabajo enharinada a un espesor de 6 mm / ¼ in.", "Corta los círculos de la masa con un cortador de pasteles de 5 cm / 2 pulgadas; esta mezcla debe producir aproximadamente 50.", "Engrase una sartén con mantequilla y caliente a fuego alto. Una vez caliente, reduzca el fuego, coloque unas cuantas tortas galesas en la sartén caliente y cocine durante 1-2 minutos en cada lado, o hasta que estén doradas. Vigile el calor, aumente o disminuya según sea necesario. Si la sartén está demasiado fría, las tortas galesas se extenderán, si están demasiado calientes, se quemarán en el exterior.", "Una vez que los pasteles galeses estén cocidos, colóquelos en un papel resistente a las grasas espolvoreado con azúcar en polvo. Espolvorear con azúcar en polvo y reservar para enfriar. Repita con los pasteles restantes de Gales.", "Para la tarta de queso, precalentar el horno a 180 ° C / 350 ° F / Gas 4. Poner los bizcochos digestivos en una bolsa de congelador y aplastarlos suavemente con un rodillo. Derrita la mantequilla en una sartén y mezcle los bizcochos y especias triturados. Presione esta mezcla en una lata springform de 23cm / 9in y hornee por 5-10 minutos, luego déjela enfriar.", "Batir el queso crema, la harina, el azúcar, la esencia de vainilla, los huevos, la yema de huevo y la crema agria en un bol hasta que estén bien combinados.", "Corte cuatro o cinco de los pasteles de Gales en trozos gruesos y dóblelos suavemente en la mezcla. Coloque algunas de las tortas galesas restantes sobre la base de galletas hasta que estén cubiertas y luego vierta la mezcla de queso crema encima. Hornee por 35-40 minutos o hasta que la tarta de queso se tambalee levemente en el centro pero pueda mantener su forma.", "Dejar enfriar en la lata y servir en rodajas, tibias o frías."]}, {"isVegetarian": false, "title": "Trucha entera al horno con berro salsa verde", "url": "www_bbc_co_uk_food_recipes_baked_whole_trout_with_a_74289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 trucha entera, escamada y eviscerada", "½ manojo de estragón", "1 limón, en rodajas", "Hojas de berro de 150g / 5½oz", "3 cucharadas de perejil de flatleaf fresco picado", "2 cebollas grandes de primavera, más o menos picadas", "1 diente de ajo, aproximadamente picado", "1 limón, ralladura solamente", "2 cucharadas de alcaparras, enjuagadas y escurridas", "2 cucharadas de pan rallado seco", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rellene la cavidad del pescado con estragón y rodajas de limón. Coloque en el horno durante 20-30 minutos (dependiendo del tamaño del pescado), o hasta que estén cocidos.", "Mientras tanto, trae una olla pequeña de agua con sal a ebullición. Agregue las hojas de berros y cocine por un minuto. Escurrir y refrescar el berro en agua helada.", "Transfiera el berro a un procesador de alimentos, agregue los ingredientes restantes y procese a un puré. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloca la trucha entera en un plato grande y despega la piel. Vierta sobre la salsa verde."]}, {"isVegetarian": true, "title": "Manzana al horno Alaska", "url": "www_bbc_co_uk_food_recipes_bakedapplealaska_86907", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml / ¼ de pinta de vino tinto", "55g / 2oz de azúcar moreno", "1 vaina de vainilla, división y semillas raspadas", "½ manzana, sin corazón, pelada y rebanada densamente", "4 claras de huevo de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "1 cucharada de miel"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el vino tinto en una olla pequeña y cocine a fuego lento hasta que su volumen se reduzca a la mitad.", "Agregue el azúcar, la vaina de vainilla y las semillas y las rodajas de manzana y cocine a fuego lento durante 4-5 minutos, o hasta que la manzana se ablande, pero aún mantiene su forma. Cuchara en un tazón de postre.", "Batir las claras de huevo en un tazón limpio hasta que se formen picos rígidos cuando se quite el batidor.", "Batir el azúcar en polvo gradualmente hasta que la mezcla esté espesa y brillante.", "Vierta la mezcla de clara de huevo sobre el cuenco para cubrir completamente la mezcla de manzana, luego rocíe sobre la miel.", "Use un mini soplete para dorar el merengue por todas partes. Servir inmediatamente."]}, {"isVegetarian": true, "title": "Manzanas al horno", "url": "www_bbc_co_uk_food_recipes_bakedapples_84332", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedapples_84332_16x9.jpg", "ingredients": ["80g / 3oz de frutas secas exóticas mezcladas (como mango, papaya, plátano, higo, pasas doradas), picadas", "55ml / 2fl oz de aguardiente", "30g / 1 oz de azúcar morena clara", "½ cucharadita de pimienta de Jamaica", "100 g / 3½ oz de mantequilla, más extra para difundir", "6 comiendo manzanas, sin corazón", "200 g / 7 oz de yogur griego, para servir"], "serves": "Para 6", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Coloque la fruta seca mezclada y el brandy en un recipiente y déjelos en remojo durante al menos dos horas, pero idealmente durante la noche.", "Después de remojar, agregue el azúcar, la pimienta de Jamaica y la mantequilla a la fruta empapada en brandy.", "Con una cuchara, vierta la mezcla de fruta en los agujeros de las manzanas sin corazón, presionando para llenar bien y extender un poco más de mantequilla sobre las manzanas.", "Coloque las manzanas rellenas en un plato resistente al horno, cubra con papel de aluminio y transfiéralo al horno para hornear durante 40 minutos.", "Retire la lámina y cocine de 15 a 20 minutos más, hasta que las manzanas estén suaves, pero sin colapsar.", "Coloque en platos y sirva con una cucharada de yogurt griego."]}, {"isVegetarian": true, "title": "Manzanas al horno con salsa Calvados", "url": "www_bbc_co_uk_food_recipes_bakedappleswithcalva_93269", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bakedappleswithcalva_93269_16x9.jpg", "ingredients": ["4 manzanas Reines des Reinettes, o manzanas rojas similares, lavadas, secas", "60 g / 2½ oz de mantequilla sin sal, derretida", "4 cucharadas de azúcar en polvo", "50 g / 2 oz de azúcar en polvo", "20 g / ¾oz de mantequilla sin sal", "Manzana Braeburn 40g / 1½oz, pelada, cortada en dados de 0.5cm / ¼in", "80ml / 3¼ oz de jugo de manzana", "½ cucharadita de arrurruz, diluido en un poco de agua", "1 cucharadita Calvados", "15 g / ½ onza de pan, en cubos", "15 g / ½ onza de azúcar glasé", "15 g / ½ oz de pistachos", "10g / ¼ oz de almendras enteras", "5g de almendras en copos", "1-2 cucharaditas Calvados"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las manzanas horneadas, precaliente el horno a 170C / 350F / Gas 4.", "Corte las bases de las manzanas que no estén planas, asegurándose de no quitar demasiado la base. Retire los núcleos de las manzanas, utilizando un descorazonador de manzana o un cuchillo pequeño y afilado.", "Cepille un plato de horno poco profundo con un poco de la mantequilla derretida y espolvoree un poco de azúcar. Cepille cada manzana con la mantequilla derretida restante, luego enróllelas con el azúcar impalpable restante. Coloque las manzanas en el plato a prueba de horno y hornee en el horno durante 30 minutos. Si es posible, cocine las manzanas sin calor asistido por ventilador ya que es demasiado intenso y reventará la piel de la manzana antes de que se cocine.", "Para la salsa Calvados, caliente el azúcar en una cacerola pequeña a fuego medio hasta que alcance un caramelo dorado oscuro.", "Agregue la mantequilla y agregue las manzanas en cubos, cocínelas durante 30 segundos, sin mover la sartén (use una cuchara para cubrir las manzanas en la mezcla de caramelo).", "Agregue el jugo de manzana y deje que hierva.", "Agregue el arrurruz diluido poco a poco, hasta que se haya espesado un poco, luego retírelo del fuego y agregue Calvados.", "Para la guarnición, mezcle los cubos de pan y la mitad del azúcar glas. Espolvorea la mezcla sobre una bandeja para hornear.", "Mezcle los pistachos, las almendras enteras y en copos, Calvados y el resto del azúcar glas juntos hasta que estén bien combinados. Extiende la mezcla en la misma bandeja de hornear.", "Hornee en el horno durante 8-10 minutos, o hasta que las nueces y los cubos de pan estén dorados. Dejar de lado para enfriar.", "Para servir, coloque una manzana horneada en el centro de cada una de las cuatro placas para servir. Coloque la salsa Calvados en el centro y espolvoree los aderezos tostados."]}, {"isVegetarian": false, "title": "Manzana al horno con pasas y crema pastelera", "url": "www_bbc_co_uk_food_recipes_bakedappleswithraisi_84469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de azúcar morena suave", "30g / 1oz de mantequilla", "20g / ¾oz de uva", "cariño, llovizna", "½ manzana, sin corazón", "150ml / 6fl de leche en oz", "Crema doble 150ml / 6fl oz", "40 g / 1½ oz de azúcar en polvo", "1 cucharadita de esencia de vainilla", "2 yemas de huevo de gallinas camperas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la mantequilla, las pasas, el azúcar moreno y la miel en un tazón y mezcle.", "Coloque la manzana en una bandeja para hornear y rellene con la mezcla de mantequilla.", "Cocine en el horno durante ocho minutos.", "Para la crema pastelera, caliente la leche y la crema en una cacerola a fuego medio.", "Coloque el azúcar, la vainilla y los huevos en un recipiente y mezcle bien. Mientras revuelve, agregue gradualmente la creama y ordeñe a fuego lento. Revuelva constantemente, hasta que la crema se espese un poco.", "Para servir, coloque la manzana en un plato para servir y vierta la crema caliente alrededor."]}, {"isVegetarian": true, "title": "Manzana al horno con calvados sabayon", "url": "www_bbc_co_uk_food_recipes_bakedapplewithcalvad_84613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manzana Bramley pequeña, partida en dos, sin núcleo", "50g / 1¾oz de mantequilla", "1 cucharada de azúcar morena suave", "1 cucharadita calvados", "4 huevos de gallinas camperas", "1 cucharada de azúcar en polvo", "1 cucharadita calvados", "2 cucharaditas de agua caliente"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la manzana horneada, corte una fina rebanada del fondo de cada mitad de manzana para que la manzana pueda quedar nivelada en un plato.", "Caliente la mantequilla en una sartén pequeña a prueba de horno hasta que se derrita. Agregue las mitades de manzana y cocine, volteándolas una vez hasta que estén doradas en ambos lados.", "Agregue el azúcar y los calvados y revuelva hasta que el azúcar se derrita y cocine por un minuto. Transfiera la sartén al horno y cocine durante ocho minutos.", "Para el sabayon, coloque los huevos, el azúcar, los calvados y el agua en un recipiente que se ajuste cómodamente sobre una olla con agua hirviendo. (Nota: El agua hirviendo en la sartén no debe tocar el fondo del tazón). Batir los ingredientes continuamente hasta que la mezcla espese hasta obtener una consistencia en la que los picos suaves estén casi formados cuando se quite la batidora.", "Para servir, coloque las manzanas en un plato limpio y cubra con el sabayon."]}, {"isVegetarian": true, "title": "Manzana al horno con crema pastelera", "url": "www_bbc_co_uk_food_recipes_bakedapplewithcustar_85400", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55 g / 2oz de pasas", "30g / 1oz de mantequilla", "1 cucharada de miel clara", "1 naranja, solo ralladura", "1 manzana, sin corazón", "5 cucharadas de leche", "5 cucharadas de crema doble", "2 cucharadas de azúcar en polvo", "1 huevo de gallinas camperas", "1 yema de huevo de gallinas camperas"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la manzana asada, coloque las pasas, la mantequilla, la miel y la ralladura de naranja en un tazón pequeño y mezcle bien.", "Coloque la manzana en un plato a prueba de microondas y rellene la mezcla de pasas en el orificio que queda al quitar el núcleo.", "Cocine en el microondas a fuego alto durante 3½ minutos, o hasta que se ablanden.", "Para la crema pastelera, coloque la leche y la crema en una cacerola y deje que hierva. Retirar del fuego y dejar enfriar ligeramente.", "Coloque el huevo, la yema de huevo y el azúcar en un bol y mezcle bien. Poco a poco vierta la leche y la crema sobre la mezcla de huevo, luego regrese la mezcla a la sartén con un poco de calor. Revuelva constantemente hasta que la crema empiece a espesarse. Cuando cubre la parte posterior de una cuchara, retírela del fuego y vierta a través de un tamiz en una jarra o tazón.", "Para servir, coloque la manzana horneada en un plato y vierta sobre la crema pastelera."]}, {"isVegetarian": true, "title": "Pudín de toffee pegajoso al horno con salsa de caramelo", "url": "www_bbc_co_uk_food_recipes_baked_sticky_toffee_28166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50 g / 1¾oz de mantequilla sin sal, más extra para engrasar", "150g / 5½oz azúcar demerara marrón oscuro suave", "175g / 6oz de fechas secas picadas", "1 cucharada de jarabe de oro", "2 cucharadas de melaza negra", "1 cucharada de pasta de frijoles de vainilla", "2 huevos de gallinas camperas", "Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "1 cucharada de bicarbonato de soda", "Crema doble de 200 ml / 7 fl oz", "80 g / 2½ oz de mantequilla", "100g / 3½oz de azúcar morena oscura", "1 cucharada de melaza negra", "1 cucharada de jarabe de oro"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 2000C / 180C Fan / Gas 6. Engrase una lata cuadrada de 20cm / 8in con mantequilla y polvo con harina.", "Mezcle la mantequilla y el azúcar en una batidora independiente con un accesorio de batir o con un batidor de mano hasta que quede esponjoso.", "Ponga las fechas y 300ml / 10fl oz de agua en una olla y llévela a ebullición.", "Poco a poco agregue el jarabe de oro, melaza, vainilla y huevos a la mezcla de mantequilla y mezcle bien. Baje la batidora a baja velocidad y agregue la harina. Una vez que todos los ingredientes se combinan, apague el mezclador.", "Purifique la mezcla de agua y dátiles y agregue el bicarbonato de soda. Revuelva rápidamente esto en la masa mientras todavía esté caliente.", "Una vez que la mezcla esté combinada, viértala en la lata de torta enmantequillada y enharinada y hornea durante 40-45 minutos hasta que la parte superior esté firme al tacto. Deje que el pudín se enfríe en la lata.", "Mientras tanto, para hacer la salsa, coloque la crema en una cacerola y agregue la mantequilla y el azúcar y derrita. Agregue el jarabe y la melaza.", "Para servir, corte el pudín en cuadrados y sirva con la salsa de caramelo."]}]