[{"ingredients": ["5 huevos de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "25g / 1oz de mantequilla, derretida, más extra para engrasar las latas", "Harina común 115g / 4oz", "40 g / 1½ oz de cacao en polvo, tamizado", "400 ml / 14 fl oz crema doble", "3 cucharadas de kirsch", "2 cucharadas de azúcar glas", "200g / 7 oz de confitura de cerezas", "250 g / 9 oz de azúcar en polvo", "5 huevos de gallinas camperas, solo para blancos", "exprimir jugo de limón", "150 g / 5½ onzas de mantequilla, suavizadas", "150 g / 5½ oz de chocolate negro, derretido", "8 cerezas frescas, tallos en", "4 cucharadas de chispas de chocolate"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrase ligeramente y forme las bases de dos moldes para pasteles de 23cm / 9 pulgadas.", "Coloque los huevos, el azúcar y la mantequilla derretida en un bol y bata durante 4-5 minutos, hasta que estén espesos y muy pálidos: cuando se saca el batidor del tazón, se debe dejar un rastro.", "Tamizar la harina y el cacao en polvo y doblar suavemente.", "Vierta la mezcla en las dos latas de torta, dividiéndolas uniformemente, luego toque para asentarse.", "Coloque las latas en una bandeja para hornear en el horno durante 12-15 minutos hasta que se levanten y solo firmes al tacto: no desea sobre cocinar una esponja genoise, ya que se secará.", "Retire del horno y deje enfriar brevemente antes de verter en una rejilla para que se enfríe por completo.", "Para el relleno, batir la crema a los picos suaves y doblar en la kirsch y azúcar glas.", "Para el relleno, coloque el azúcar con 125ml / 4fl de agua en una sartén y deje que hierva lentamente hasta que el almíbar alcance 121C / 250F en un termómetro de azúcar, luego retire la sartén del fuego.", "Mientras tanto, coloque las claras de huevo en un recipiente limpio con un chorrito de jugo de limón, y mezcle hasta que se formen picos firmes.", "Con el batidor a su velocidad más baja, vierta el jarabe de azúcar, en un flujo constante, asegurándose de que esté limpio de los batidores.", "Continúa latiendo durante unos cinco minutos, hasta que el merengue esté tibia.", "Agregue la mantequilla y continúe batiendo hasta que esté todo incorporado. Luego bate en el chocolate y asegúrate de que esté todo incorporado.", "Para servir, corte las esponjas por la mitad horizontalmente para que tenga cuatro capas delgadas de esponja.", "Coloque una pieza de esponja en el plato y extienda un tercio de la mermelada de cerezas, y luego un tercio de la crema de kirsch.", "Repita con las otras esponjas y el resto de mermelada y crema hasta que tenga una pila de cuatro esponjas con tres capas de mermelada y crema.", "Extienda la cobertura de chocolate sobre el pastel para cubrir completamente.", "Decore con las cerezas frescas y las chispas de chocolate."], "url": "www_bbc_co_uk_food_recipes_cherry_and_chocolate_17711", "title": "Pastel de cereza y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "75 g / 2½ oz de azúcar en polvo", "1 cucharada de harina normal", "75ml / 2½ fl oz crema doble", "50 g / 1¾oz de almendras en copos, ligeramente tostadas", "50 g / 1¾oz corte cáscara mixta", "2 cucharadas de jengibre de tallo, finamente picado", "1 naranja, solo ralladura", "25 g / 1 oz de cerezas glace, picadas", "100 g / 3½ oz de chocolate negro"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la mantequilla en una cacerola mediana a fuego medio. Una vez derretido, agregue el azúcar y la harina y bata continuamente hasta que todo esté combinado y tenga una pasta suave y pálida. Vierta la crema y revuelva mientras vierte hasta que esté completamente incorporada. La mezcla debe ser suave.", "Apague el fuego, agregue las almendras, la cáscara mixta, el tallo de jengibre, la ralladura de naranja y las cerezas. Mezcle con una cuchara de madera hasta que se combinen y reserve para enfriar.", "Cubra una bandeja para hornear con papel pergamino y coloque cucharaditas de la mezcla florentina en la bandeja, dejando 3 cm / 1 in entre ellas, ya que se extenderán durante la cocción. Puede necesitar hacer esto en lotes, o usar dos bandejas.", "Coloque la bandeja en el horno y hornee por 12-15 minutos, o hasta que estén doradas. Retire del horno y permita que se enfríe durante dos minutos antes de transferirlo rápidamente a un estante de enfriamiento para que se enfríe completamente.", "Mientras los florentinos se están enfriando, derrita el chocolate en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento. (Asegúrese de que la base del recipiente no toque el agua).", "Rocíe las florentinas enfriadas con el chocolate derretido. Permitir configurar y servir. O almacene en un recipiente hermético por hasta tres días."], "url": "www_bbc_co_uk_food_recipes_cherry_and_ginger_69469", "title": "Florentinos de cereza y jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_and_ginger_69469_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Margarina 150 g / 5½ oz", "150 g / 5½ oz de azúcar en polvo", "100g / 3½ oz de harina de auto crianza", "3 huevos de gallinas camperas, a temperatura ambiente", "1 cucharadita de polvo de hornear", "60 g / 2¼ oz de almendras molidas", "1 cucharada de leche", "90g / 3¼ oz de mermelada de frambuesa", "250 g / 9 oz de azúcar glas", "3 cucharadas de jugo de limón fresco", "12 cerezas heladas sin teñir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una lata de muffin de 12 hoyos con cajas de papel.", "Para los cupcakes, bata la margarina en un bol hasta que esté suave y esponjosa. Agregue los ingredientes restantes, excepto el atasco de frambuesa, y mezcle hasta que estén bien combinados.", "Coloca la mezcla en las cajas y hornea por 15-20 minutos, o hasta que se levante y dore, y una brocheta insertada en el centro salga limpia. Retire del horno y deje enfriar por 10 minutos.", "Para la formación de hielo, mezcle el azúcar glas y el jugo de limón en un tazón hasta que quede suave.", "Usando un descorazonador de manzana, retire cuidadosamente el centro de los cupcakes. Rellene los agujeros con el atasco de frambuesa.", "Con cuidado, coloque la guinda en la parte superior de cada pastel hasta que el glaseado llegue a los lados de la caja de la torta y cubra con una cereza."], "url": "www_bbc_co_uk_food_recipes_cherry_bakewell_cupcakes_24953", "title": "Magdalenas de Cherry Bakewell", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_bakewell_cupcakes_24953_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 jar cerezas marrasquino", "aproximadamente ¼ botella de kirsch cherry licor, para remojar las cerezas", "450 g / 1 libra de chocolate negro, roto en pequeños trozos", "Crema doble de 200 ml / 7 fl oz", "25 g / 1oz de mantequilla sin sal", "pintura de oro comestible (opcional)"], "method": ["Una semana antes de que quieras cocinar, comienza a remojar las cerezas. Vacíe el líquido del tarro de cereza y llénelo directamente hasta la parte superior con kirsch. Vuelva a colocar la tapa y déjela en la nevera.", "Después de una semana, escurra las cerezas, reservando el líquido de kirsch.", "Cubra una bandeja para hornear de 40x35 cm / 16x14 pulgadas con papel para hornear.", "Ponga 200 g / 7 oz del chocolate roto en un bol.", "Caliente la crema y la mantequilla en una cacerola hasta que hierva a fuego lento, sin dejar que hierva. Tenga cuidado de que no se quema ni se enganche en el fondo de la sartén.", "Saque la olla del fuego, vierta la mezcla sobre el chocolate y revuelva vigorosamente. Reserve a un lado, pero revísela para asegurarse de que todo el chocolate se haya derretido. Revísalo para ayudarlo si es necesario. Agregue dos cucharadas de kirsch reservado y revuelva.", "Enfríe la mezcla durante aproximadamente una hora, o hasta que una cucharadita mantenga su forma. Ponga cucharadas pequeñas de mezcla (aproximadamente del tamaño de una moneda) en la bandeja para hornear. Una vez que tenga 20, regrese y coloque otra cucharada de mezcla encima del original. Intenta hacerlos bastante altos.", "Coloque una cereza en la parte superior de cada montón, presionándola ligeramente hacia abajo. Coloque en la nevera para enfriar durante 15 minutos.", "Temple el chocolate restante. Pon el chocolate en un tazón sobre una fuente de agua hirviendo. No permita que el recipiente toque el agua o el chocolate se quemará y no permita que entre agua en el chocolate o el chocolate se agarrotará. Coloque un termómetro de chocolate en el tazón y lleve el chocolate hasta 42C / 107F, luego quite el fuego y enfríelo a 32C / 90F.", "Usando dos tenedores, con cuidado sumerja cada montículo de chocolate con cereza en el chocolate negro derretido hasta cubrir todo. Coloque en la bandeja de horno forrada. Deje las clavijas de los sombreros recubiertos en un lugar fresco para que se enfríen por completo y configure.", "Puntee la parte superior de cada uno con un destello de pintura dorada comestible (si lo desea)."], "url": "www_bbc_co_uk_food_recipes_cherry_chapel_hat_pegs_61298", "title": "Clavijas de sombrero de capilla de cereza", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Hace 20 chocolates", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_chapel_hat_pegs_61298_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de almendras molidas", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de azúcar glas, tamizado, más extra si la mezcla está demasiado húmeda y al polvo", "1 huevo de gallinas camperas", "½ cucharadita de extracto de almendra", "75 g / 2½ oz de mantequilla sin sal, derretida, más extra para engrasar estaño", "5 huevos de gallinas camperas, a temperatura ambiente", "1 cucharadita de extracto de almendra", "1 limón sin cebar, ralladura fina solamente", "150 g / 5½ oz de azúcar en polvo de oro", "Harina normal 150g / 5½ oz", "1kg / 2lb 4oz de glaseado de fondant blanco listo para usar", "1 limón, solo jugo", "gel de color violeta para alimentos", "150g / 5½oz de mantequilla sin sal, suavizada", "225g / 8oz de azúcar glas, cernida", "Almendras molidas 15 g / ½ oz", "1 cucharadita de extracto de almendra", "gel de color violeta para alimentos", "100g / 3½oz de conserva de cereza negra", "1 cucharada de licor de almendras", "200 g / 7 oz de cerezas frescas, piedras removidas, reducidas a la mitad", "brillo comestible (opcional)"], "method": ["Para el mazapán, combine las almendras, el azúcar impalpable y el azúcar glas en un tazón grande. Crea un pozo en el medio y agrega el extracto de huevo y almendra. Revuelva hasta que esté combinado. Amasar brevemente hasta que el mazapán esté suave, agregando más azúcar glas si la mezcla está demasiado húmeda. Envuelva la película adhesiva y colóquela en el refrigerador hasta que sea necesario.", "Para la esponja, precaliente el horno a 180C / 160C ventilador / Gas 4. Engrase y forre una bandeja para hornear de 23cm / 9pulg. De profundidad con mantequilla y papel para hornear.", "En el cuenco de un mezclador independiente equipado con el accesorio de batido, agregue los huevos, el extracto de almendras, la ralladura de limón y el azúcar. Batir a alta velocidad durante 7-10 minutos, o hasta que la mezcla sea gruesa, lisa y triplicada en tamaño y el batidor deja rastros que se asienten en la superficie de la mezcla cuando se levanta.", "Tamiza un tercio de la harina sobre la superficie y dobla suavemente en la mezcla con una cuchara grande de metal hasta que se combinen. Repita este proceso una vez más, luego vierta la mantequilla fría derretida alrededor del borde del tazón y dóblela con el último tercio de harina. Asegúrese de que la mantequilla y la harina estén completamente dobladas, pero tenga cuidado de mantener la mayor cantidad posible de aire en la mezcla.", "Vierta la mezcla en la lata preparada y hornee por 30 minutos hasta que se dore y salga de los bordes. Deje que se enfríe en la lata durante 5 minutos antes de transferirla a un estante de enfriamiento para que se enfríe por completo. Envuelva la película adhesiva y colóquela en el congelador.", "Para el glaseado de fondant, rasgue el fondant en trozos pequeños en el cuenco de un mezclador independiente equipado con un accesorio de paleta. Agregue 100 ml / 3½ fl oz de agua y el jugo de limón gradualmente (puede que no lo necesite todo) batiendo a velocidad media hasta obtener una consistencia gruesa y fluible. Agregue una gota de color al fondant, mezclándolo bien, hasta que tenga un color lila pálido. Transfiera a un tazón, cúbralo con una película adhesiva y déjelo a un lado.", "Para la crema de mantequilla de almendras, bata la mantequilla en un mezclador independiente equipado con un accesorio de paleta hasta que quede suave. Poco a poco agregue el azúcar glas y almendras y bata hasta que esté suave y liviano. Agregue el extracto de almendras, al gusto. Cubra y deje en un lugar fresco.", "Para el relleno, mezcle la conserva de cereza con el licor de almendras.", "Retire la esponja del congelador y recorte cuidadosamente los bordes para enderezar. Mida la torta y marque una cuadrícula de 5 columnas y filas iguales en la superficie de la torta (que se cortará más tarde para hacer 25 cuadrados de pastel). Con un cuchillo pequeño, corte un chapuzón en el medio de cada cuadrado, pero tenga cuidado de no cortar hasta el fondo. Llene cada hoyo con una pequeña conserva de cereza.", "Sobre una superficie espolvoreada con azúcar impalpable, extienda el mazapán en un cuadrado un poco más grande que la torta y cúbralo, recortando los bordes para que cubra la parte superior cuidadosamente. Coloque en el congelador durante 10 minutos para establecer. Vuelva a medir la cuadrícula de 5 x 5 como antes y corte la torta en fantasías individuales con un cuchillo de sierra.", "Usando una espátula, alise una capa de crema de mantequilla alrededor de cada esponja. Coloque en el congelador para enfriar por un minuto. Es posible que desee hacer una segunda capa para hacer bordes muy limpios.", "Coloque una rejilla de refrigeración grande sobre una hoja de periódico. Sumerja las tortas frías en el fondant lila para cubrir las esponjas. Coloque los fondants en el estante para que se sequen por goteo.", "Coloque la crema de mantequilla restante en una manga pastelera equipada con una boquilla de estrella media. Una vez que el fondant esté ligeramente colocado, vierta un pequeño remolino de crema de mantequilla sobre cada fondant de fantasía. Coloque la mitad de una cereza fresca encima de cada remolino. Espolvoree cada cereza con un poco de brillo, si lo usa."], "url": "www_bbc_co_uk_food_recipes_cherry_bakewell_fondant_20118", "title": "Fantasías de fondant Cherry Bakewell", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 25 fantasías fondant", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_bakewell_fondant_20118_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450g / 1lb de cerezas maduras, lo mejor que puedes encontrar, piedras removidas", "3 cucharadas de azúcar en polvo, más extra para rociar", "3 cucharadas de kirsch (opcional)", "20 g / ¾oz de mantequilla sin sal, más extra para engrasar", "2 huevos de gallinas camperas", "3 cucharadas de azúcar en polvo, más extra para rociar", "½ cucharadita de extracto de vainilla", "1 cucharada de harina normal", "50g / 1¾fl oz de leche entera", "75g / 2¼fl oz de crema batida", "Una pizca de sal marina"], "method": ["Mezcle suavemente las cerezas, el azúcar y el kirsch y deje macerar durante dos horas. (El azúcar impregnará lentamente las cerezas e intensificará su sabor).", "Precalentar el horno a 180 ° C / 350 ° F / Gas 4. Engrasar una fuente para hornear con mantequilla y espolvorear con azúcar. Agite el azúcar alrededor del plato para que esté uniformemente cubierto, luego apunte cualquier exceso.", "Para la mezcla, caliente la mantequilla en una sartén pequeña hasta que tome un color avellana pálido, esto se llama un noisette beurre. No permita que la mantequilla se queme o se volverá amarga y cancerígena. Retire la sartén del fuego y déjela en un lugar cálido.", "En un tazón grande mezcle los huevos, el azúcar y la vainilla hasta que estén cremosos.", "Agregue la harina, bata hasta que quede suave, luego incorpore lentamente la leche, crema, sal y beurre noisette.", "Mezcle las cerezas maceradas y su jugo en la mezcla y viértalo en la fuente para hornear preparada.", "Hornee en el horno durante 30-35 minutos, o hasta que la parte superior esté ligeramente abovedada y la hoja de un cuchillo insertada en el centro salga limpia.", "Para finalizar, espolvorea con azúcar en polvo y sirve caliente."], "url": "www_bbc_co_uk_food_recipes_cherry_clafoutis_18623", "title": "Cherry clafoutis", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_clafoutis_18623_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "75g / 2¾oz de azúcar en polvo, más extra para quitar el polvo", "Harina normal de 40 g / 1½ oz", "100 ml / 3½ fl oz crema doble o crema", "100ml / 3½ fl oz de leche", "mantequilla, para engrasar", "225 g / 8 oz de cerezas, apedreado", "150ml / 5fl oz de crema doble", "25 g / 1 oz de formación de hielo o azúcar en polvo", "semillas de 1 vaina de vainilla"], "method": ["Para los clafoutis, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque los huevos y el azúcar en un tazón grande y agítelos. Tamiza la harina y bate bien, luego agrega la crema o la crema fresca y la leche. Déjalo reposar por 10 minutos.", "Ligeramente un plato grande para hornear y espolvorear con azúcar para cubrir. Esparce las cerezas en el plato y vierte suavemente sobre la masa de clafoutis. Hornee durante 20-25 minutos o hasta que la masa esté firme al tacto. Si es demasiado suave en el centro, hornea por otros cinco minutos. Retirar del horno y dejar enfriar un poco antes de servir.", "Batir la crema, el azúcar y las semillas de vainilla en los picos suaves y una cuchara sobre los clafoutis."], "url": "www_bbc_co_uk_food_recipes_cherry_clafoutis_with_18549", "title": "Clafoutis de cereza con crema batida de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "310g / 11oz de cerezas maduras, sin piedras", "3 claras de huevo de gallinas camperas", "90g / 3¼ oz de azúcar en polvo", "90g / 3¼ oz de azúcar glas, tamizado", "400 ml / 14 fl oz crema doble", "1 vaina de vainilla, solo semillas", "500 g / 1 lb 2 oz cerezas oscuras, sin hueso", "500g / 1lb de azúcar de mermelada 2 oz", "2 limones, solo jugo"], "method": ["Para los merengues de cereza, coloque el azúcar y 150ml / 5½ fl oz de agua en una sartén y hierva hasta que el azúcar se haya disuelto y se forme un jarabe. Agregue las cerezas al jarabe hirviendo y cocine por 1-2 minutos (dependiendo de qué tan maduras estén las cerezas), o hasta que estén suaves. Transfiera a un recipiente para enfriar.", "Precaliente el horno a 110C / 225F / Gas ¼ y forre una bandeja para hornear con papel para hornear.", "En un recipiente limpio, bata las claras de huevo con el azúcar impalpable hasta que se formen picos rígidos cuando se quite el batidor. Agregue el azúcar glas y continúe batiendo durante 4-6 minutos, o hasta que la mezcla esté suave y brillante.", "Escurra las cerezas en papel de cocina para eliminar la mayor cantidad de jarabe posible. Usando una cuchara de metal grande, doble suavemente las cerezas en la mezcla de merengue. Usando otra cuchara grande, saque una cucharada grande del merengue y moldee en una quenelle (forma de pelota de rugby) y colóquela en la bandeja para hornear forrada. Repite el proceso para hacer tres merengues más grandes. Cocine en el horno por dos horas.", "Una vez cocinado, retíralo del horno y déjalo enfriar ligeramente. Luego, use una espátula para quitar los merengues de la bandeja de hornear. Transfiera a un estante de enfriamiento para que se enfríe por completo.", "Para la compota de cereza, coloque las cerezas, el azúcar y el jugo de limón en una cacerola grande y cocine durante 5-6 minutos.", "Para terminar los merengues de cereza, coloque la crema y las semillas de vainilla en un tazón grande y látigo hasta que se formen picos rígidos cuando se quite el batidor.", "Una vez que los merengues se hayan enfriado, coloque un poco de crema en el lado plano y coloque otro medio merengue en el otro lado.", "Coloque los merengues de cereza en un plato y sirva con la compota de cereza."], "url": "www_bbc_co_uk_food_recipes_cherry_meringues_with_51276", "title": "Merengues de cereza con compota de cereza y crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 2 sándwiches de merengue muy grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pieza grande de panza de cerdo (aproximadamente 500g / 1lb 2oz)", "Azúcar de roca roja 300 g / 10½ oz (disponible en tiendas especializadas de China)", "2 cucharadas de aceite vegetal", "2 cucharadas de salsa de soja oscura", "300g / 10½oz de arroz integral", "Batatas de 400g / 14oz, sin pelar, cortadas en trozos de 1.5cm / ¾in", "150g / 5½oz de arándanos frescos o congelados", "50ml / 2fl oz de jugo de naranja", "2 cucharadas de aceite de cacahuete", "2 dientes de ajo, aplastados", "Jengibre fresco de la raíz 2.5cm / 1in, rallado fino", "2 chiles rojos secos enteros, desgarrados", "180g / 6 oz de tocino ahumado lardons, finamente cortados en cubitos", "2 cucharadas de vino de arroz Shaoxing, o jerez seco", "1 zanahoria roja grande, cortada en cuartos a lo largo, luego cortada en trozos de 5cm / 2in en ángulo", "Brócoli Tenderstem de 200g / 7oz, cortado en piezas de 2.5cm / 1in", "2 cucharadas de vinagre de arroz negro Chinkiang", "1 cucharada de salsa de soja ligera baja en sodio"], "method": ["Para la carne de cerdo cereza, en una olla grande de agua hervir el cerdo durante 30 minutos, luego drenar y dejar enfriar. Cortar en pedazos de 2.5cm / 1in.", "Coloque el azúcar de roca roja en una sartén con aproximadamente 1 litro / 1¾ pintas de agua y cocine a fuego alto hasta reducir su volumen a un jarabe de caramelo rojo-marrón.", "Caliente un wok a fuego alto y agregue el aceite vegetal. Agregue los trozos de cerdo, la salsa de soya oscura y el jarabe de azúcar rojo y saltee a fuego medio durante un minuto, o hasta que se doren, revolviendo constantemente para que el azúcar no se caramelice.", "Vierta 1 litro / 1¾ pintas de agua hirviendo, cubra el wok y cocine a fuego lento durante 2 horas con un audífono mediano, o hasta que el cerdo esté tierno.", "Para el arroz integral de batata, lava bien el arroz hasta que el agua salga clara. Agregue a una sartén con 700ml / 1¼ de agua y los trozos de boniato. Llevar a ebullición. Una vez hervida, reduzca el fuego a fuego lento y coloque una tapa en la sartén. Cocine a fuego lento durante otros 20-25 minutos, o hasta que toda el agua se haya evaporado, la batata esté tierna y el arroz cocido. Mientras el arroz se cocina, prepare la salsa de arándanos y el brócoli picante.", "Para la salsa de arándanos, coloque los arándanos y el jugo de naranja en una olla y deje hervir, baje y cocine a fuego lento durante 5-8 minutos.", "Para el brócoli picante, caliente un wok a fuego alto y agregue el aceite de cacahuete. Agregue el ajo y el jengibre, luego las piezas de chile seco, y mezcle por unos segundos. A continuación, agregue rápidamente los lardons de tocino y saltee por un minuto hasta que se doren.", "Agregue el vino de arroz Shaoxing o el jerez seco. A continuación, agregue la zanahoria y los pedazos de brócoli Tenderstem y cocínelos durante un minuto. Sazonar con vinagre de arroz negro Chinkiang. Cocine por un minuto más hasta que las verduras estén crujientes y luego agregue la salsa de soja ligera.", "Cinco minutos antes de servir, mezcle la salsa de arándanos en el cerdo. Retire el arroz dulce de camote del fuego, esponje el arroz y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cherry_pork_with_spicy_20767", "title": "Cerdo de cereza con brócoli con tocino picante y arroz integral de camote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500 g / 1lb 2 oz de hojaldre", "450g / 1lb de cerezas frescas, cortadas a la mitad y apedreadas", "1 naranja, solo ralladura", "4 cucharadas de aguardiente de cereza", "1 cucharada de miel clara", "1 cucharadita de harina de maíz, para espesar", "Crema doble de 570 ml / 1 pinta batida", "azúcar glas, al polvo"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Cubra una bandeja de horno con un pergamino y tenga preparada otra bandeja y una hoja de pergamino.", "Extienda la masa a 5 mm / 1/4 de pulgada de grosor y corte para que quepa en la bandeja de horno forrada. Pinchar todo con un tenedor. Necesita suficiente masa cocida para poder cortar tres cuadrados de 15x15 cm / 6x6 pulgadas.", "Coloque la masa en la bandeja revestida. Coloque otro trozo de pergamino encima y coloque la segunda bandeja sobre eso.", "Hornee durante 20 minutos o hasta que estén dorados. Deje que se enfríe, luego recorte en tres cuadrados pares.", "Para hacer la compota de cereza, ponga las cerezas en una sartén con la ralladura de naranja, el brandy de cereza y la miel. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante unos cinco minutos, hasta que las cerezas se hayan suavizado pero aún mantengan su forma. Cuele los jugos y vuélvalos a la sartén. Pon las cerezas a un lado.", "Mezcle la harina de maíz con un poco de agua para hacer una pasta líquida, luego agregue al líquido en la sartén. Batir a fuego alto hasta que el líquido espese. Regrese las cerezas a la sartén y mezcle. Deja enfriar.", "Cuando esté listo para armar la torta, batir la crema hasta que se formen picos firmes cuando se levante la batidora. Ponga cuatro cucharadas en un tazón para más tarde.", "Doble suavemente dos tercios de la compota de cereza en la crema. Coloque uno de los cuadrados de repostería en un tablero. Cubra con la mitad de la mezcla de crema de cereza. Coloca un segundo cuadrado de masa en la parte superior, luego la otra mitad de la mezcla, luego completa con la última hoja de masa. Enfriar en la nevera durante al menos una hora para establecer.", "Para servir, coloca el pastel en un plato de servir. Cubra los lados del pastel con la crema restante. Dragar la parte superior con azúcar glas. Calienta con cuidado un pincho en una llama de gas, luego quema una línea en la superficie de la torta, repitiendo para crear un patrón entrecruzado. Decora con la compota restante."], "url": "www_bbc_co_uk_food_recipes_cherry_slice_34744", "title": "Porción de cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb4oz de cerezas frescas", "1 ramita de canela", "½ vaina de vainilla", "150ml / 5fl oz kirsch", "100 g / 3½ oz de azúcar en polvo", "10 g de mantequilla", "85g / 3oz de guindas, empapadas en agua caliente", "500ml / 18fl de leche en oz", "½ vaina de vainilla", "Harina de sémola 70 g / 2½ oz", "85g / 3oz de azúcar en polvo", "4 huevos de gallinas camperas, separados", "¼ limón, solo jugo", "azúcar glas, para decorar"], "method": ["Para la salsa, coloque las cerezas frescas, canela, vainilla, kirsch y azúcar en un tazón pequeño y deje cocer hasta que estén suaves. Retire las cerezas del líquido y saque sus piedras, reservando el licor de caza furtiva y tres cerezas con tallos para la guarnición.", "Blitz la mitad de las cerezas en un procesador de alimentos o licuadora y presione la mezcla a través de un colador. Agregue un poco del licor de caza furtiva hasta que tenga la consistencia de una salsa. Dejar de lado.", "Para el soufflé, precaliente el horno a 200C / 180C Fan / Gas 4. Engrase una fuente para hornear con la mantequilla. Línea con papel de horno y una cuchara en las cerezas restantes y las guindas", "Caliente la leche con la vaina de vainilla, la sémola y 65g / 2¼ oz del azúcar impalpable. Cocine por 10 minutos, o hasta que la mezcla se espese.", "Batir las claras de huevo con el azúcar restante y el jugo de limón hasta que forme picos rígidos.", "Revuelva las yemas de huevo en la mezcla de sémola y agregue un tercio de las claras de huevo. Con cuidado, dobla el resto de las claras de huevo y la cuchara en la fuente para hornear. Coloca las cerezas reservadas con tallos en la parte superior y hornea por 20-25 minutos.", "Retirar del horno y espolvorear con azúcar glas. Vierta sobre la salsa de cereza y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cherry_souffl_63574", "title": "Cherry soplado", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 75g / 2¾oz", "75g / 2¾oz demerara azúcar", "1 cucharadita de canela molida", "75g / 2¾oz de mantequilla sin sal", "2 huevos de gallinas camperas", "150 g / 5½ oz de mantequilla sin sal, más extra para engrasar", "125 g / 4½ oz de azúcar en polvo", "Crema agria de 125 g / 4½ oz", "Harina normal de 250g / 9oz", "1 cucharadita de canela molida", "1 cucharadita de polvo de hornear", "1 cucharadita de bicarbonato de soda", "Cerezas de 200g / 7oz, piedras removidas", "125g / 4½oz de azúcar glasé", "2-3 cucharadas de leche"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de torta con forma de resorte de 20 cm / 8 pulg.", "Para el relleno, coloque la harina, el azúcar, la canela y la mantequilla en un tazón y, con las yemas de los dedos, frote la mezcla hasta que se asemeje a pan rallado. Dejar de lado.", "Para la torta, bata los huevos, la mantequilla y el azúcar en un tazón durante cinco minutos con un batidor eléctrico.", "Agregue la crema agria, luego agregue la harina, la canela, el polvo de hornear y el bicarbonato de soda hasta que estén bien combinados y suaves.", "Vierta la mitad de la mezcla en la lata de la torta, cubra con las cerezas y luego la mezcla de la torta restante. Espolvorea sobre el topping.", "Hornee en el horno durante 40-45 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Retire la torta del horno y déjela enfriar por 5 minutos.", "Para el glaseado, mezcle el azúcar glas y dos cucharadas de leche juntas en un tazón. (Agregue un poco de leche extra si la mezcla es demasiado espesa).", "Coloque el glaseado sobre la torta y déjelo a un lado durante 10 minutos, o hasta que el glaseado se endurezca."], "url": "www_bbc_co_uk_food_recipes_cherry_streusel_cake_11969", "title": "Pastel de cereza streusel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9 oz pequeños tomates maduros en la vid", "Perlas de mozzarella 250 g / 9 oz", "alrededor de 8 hojas de albahaca, finamente picadas", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "sal y pimienta"], "method": ["Corta los tomates por la mitad y colócalos en un bol con el resto de los ingredientes.", "Sazonar bien con sal y pimienta, cubrir y enfriar hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_cherry_tomato_and_74745", "title": "Ensalada de tomate cherry y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_tomato_and_74745_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "1.5kg / 3lb 5oz cerezas, apedreado", "Brandy de cereza 100ml / 3½fl oz", "2 litros / 3½ pintas de crema doble, batida", "Flan de vainilla fresca de 600 ml / 20 fl oz, refrigerado", "2 pasteles de Madeira, en rodajas", "50g / 1¾oz de chocolate blanco rallado", "100 g / 3½ oz de azúcar en polvo", "12-20 cerezas en tallos, para decorar"], "method": ["Haga un jarabe de azúcar calentando el azúcar impalpable con 100 ml / 3½ fl oz de agua hasta que el azúcar se haya disuelto por completo. Dejar enfriar un poco.", "Ponga las cerezas en una sartén grande con 50 ml / 2 onzas líquidas del jarabe de azúcar y la mitad del brandy de cereza. Cocine por 5-10 minutos, luego déjelo enfriar.", "Batir la mitad de la crema y toda la crema.", "Remoje las rebanadas de pastel en el brandy restante y el jarabe de azúcar 50ml / 2fl oz.", "En una fuente grande, crea las capas. Primero agregue las cerezas, luego la torta remojada y cubra con la mezcla de nata y crema.", "Coloque la crema batida restante en una manga pastelera y la tubería se arremolina en la parte superior de la bagatela. Cubra con el chocolate rallado.", "Para decorar, derrita el azúcar en una sartén antiadherente a fuego medio. Mantenga el calentamiento hasta que se forme un caramelo de color marrón oscuro (PRECAUCIÓN: no lo deje desatendido), luego vuelva a mojar la olla en agua fría para evitar que se queme el caramelo.", "Con cuidado sumerja las cerezas en el caramelo y colóquelas en una estera de silicona o en un pergamino antiadherente para que se enfríen por completo. Cuando es cool decorar la bagatela con ellos."], "url": "www_bbc_co_uk_food_recipes_cherry_trifle_23466", "title": "Bagatela de cereza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 12-14", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_trifle_23466_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3 oz de chocolate negro, derretido, más extra para servir", "50g / 2oz de mantequilla sin sal, derretida", "2 huevos enteros de granja, golpeados", "50 g / 2 oz de azúcar en polvo", "Harina normal de 50g / 2oz", "50 g / 2 oz de cerezas sin hueso de una lata, picadas, 2 cucharadas de jugo reservado", "mantequilla, para engrasar"], "method": ["Coloque el chocolate, la mantequilla, los huevos y el azúcar en un tazón y mezcle bien.", "Agregue la harina, las cerezas y el jugo de cereza y dóblese hasta que quede suave.", "Engrase dos moldes con mantequilla, luego mezcle la mezcla en cada uno hasta llenar tres cuartas partes. Cubra cada uno con una película adhesiva, colóquela en el microondas y cocine a máxima potencia durante cuatro minutos, o hasta que se haya levantado y cocinado completamente.", "Para servir, voltea los budines en platos y rocía con el chocolate derretido."], "url": "www_bbc_co_uk_food_recipes_cherryandchocolateca_84273", "title": "Tarta de cereza y chocolate con salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1lb2oz de cerezas", "8 yemas de huevo", "Crema doble 500ml / 17fl oz", "2 vainas de vainilla, solo semillas", "100g / 3½ oz de azúcar", "500ml / 17fl de leche en oz", "25 g / 1oz de mantequilla sin sal, derretida", "30g / 1¼ oz de azúcar glas", "1 clara de huevo", "25g / 1oz de harina blanda", "15 g / ½ oz de pistachos picados"], "method": ["Para la crème brulee, quita las piedras de las cerezas. Coloque en una sartén con 100 ml / 3½ fl oz de agua y deje que hierva, cocine durante 5 minutos. Picar aproximadamente y colocar en el fondo de los platos de brulee. Coloque los platos en un baño maría (es decir, un baño de agua. Puede usar una lata de asar profunda medio llena de agua).", "Coloque las yemas de huevo, las semillas de las vainas de vainilla y el azúcar en un tazón y bata, luego agregue la leche y la crema doble y vierta sobre la mezcla de cerezas en los platos.", "Cocine a 105C / 200F durante 60 minutos. Cuando esté cocido, deje reposar durante 24 horas.", "Para los bizcochos de pistacho, derrita la mantequilla y mezcle el azúcar glas. Batir ligeramente la clara de huevo y agregar la harina. Agregue los pistachos a la mezcla de mantequilla derretida y mezcle hasta lograr una pasta homogénea. Dejar enfriar por 1 hora.", "Cortar en forma de galletas, descansar durante 10 minutos. Ponga en una bandeja y cocine a 180C / 350F / Gas 4 por 5 a 10 minutos.", "Sacar del horno y dejar enfriar.", "para servir, coloque un poco de azúcar sobre la parte superior del brulie y glasee debajo de la parrilla. Coloque en un plato y adorne con las galletas y algunas cerezas."], "url": "www_bbc_co_uk_food_recipes_cherrybruleewithpist_13471", "title": "Cereza quemada con galletas de pistacho", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Mermelada de cereza negra de buena calidad 150g / 5oz", "100 ml / 3½ fl oz de agua", "1 cucharada de arrurruz molida, mezclada para untar con 2 cucharadas de agua", "750g / 1½lb de cerezas rojas frescas, tallos y piedras removidos", "Harina normal de 250g / 9oz, más extra para espolvorear", "175g / 6oz de mantequilla fría sin sal, cortada en cubos", "1 cucharada de azúcar en polvo, más 2 cucharaditas de topping", "1 huevo grande de gallinas camperas, golpeado", "1 cucharada de agua fría"], "method": ["Para el relleno del pastel, caliente el atasco de cereza y el agua en una sartén a fuego lento, revolviendo continuamente, hasta que el atasco se haya derretido y comience a burbujear.", "Agregue la mezcla de arrurruz y revuelva para combinar. Continúe cocinando a fuego lento hasta que la salsa esté muy espesa y suave.", "Agregue las cerezas y mezcle con cuidado para cubrirlas en la mezcla de mermelada caliente. Transfiera la mezcla de relleno a un plato para pastel de 1 litro / 1¾ de pinta (deben llegar justo por encima del borde del plato). Dejar de lado para enfriar.", "Para la masa, pulse la harina, la mantequilla y el azúcar juntos en un procesador de alimentos hasta que la mezcla se asemeje a migas de pan finas.", "Mezcle el huevo batido y el agua. Guarde una cucharada de esta mezcla para usar como glaseado. Con el motor todavía en funcionamiento, agregue gradualmente la mezcla restante de huevo y agua al cuenco del procesador de alimentos, poco a poco, hasta que la mezcla se una como masa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada hasta que tenga 7 cm / 2 pulgadas de diámetro más grande que el plato para pastel. Corta dos o tres tiras largas de los bordes de la masa (2,5 cm / 1 pulgada de ancho).", "Cepille el borde del plato para pastel con un poco del huevo batido reservado. Coloque las tiras de hojaldre en el borde del plato para pastel, superponiendo las tiras ligeramente en las uniones. (Esto creará un borde más grueso para prensar.) Cepille el borde de la pastelería con más huevo batido.", "Levante suavemente la masa enrollada, usando el rodillo, y colóquela encima del relleno de cereza. Presione la masa hacia abajo en los bordes para sellar las capas de masa juntas. Recorte cualquier exceso de hojaldre, luego ribetee los bordes con los dedos.", "Transfiera el plato de tarta a una bandeja para hornear y deje enfriar en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Cuando el pastel se haya enfriado, cepille la tapa de la masa con el huevo batido restante y espolvoree las dos cucharaditas restantes de azúcar. Con un cuchillo afilado, corte una cruz pequeña en el centro de la tapa del pastel.", "Hornee el pastel en el horno durante 25-30 minutos, luego reduzca la temperatura del horno a 180C / 350F / Gas 4 y continúe cocinando por otros 15-20 minutos, o hasta que la masa esté dorada y el relleno del pastel esté burbujeante. .", "Sirva caliente con crema pastelera o crema."], "url": "www_bbc_co_uk_food_recipes_cherrypie_91973", "title": "pastel de cerezas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherrypie_91973_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 150g / 5½ oz, más extra para quitar el polvo", "2 cucharaditas de polvo de hornear", "85 g / 3 oz de mantequilla, en cubos", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de leche", "2 puñados de hojas de espinaca, rasgados", "6 tomates cherry", "2 cucharadas de aceite de oliva"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque la harina, el polvo de hornear, la mantequilla y la sal y la pimienta negra recién molida en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado. Agregue el huevo batido y la leche para unir la mezcla, agregue más harina o leche según sea necesario, luego vuelva a pulsar para formar una masa. Agregue las hojas rotas de espinaca al procesador de alimentos y pulse hasta que se combinen aproximadamente.", "Amasar la masa en una superficie enharinada, luego dar forma a una ronda y transferirla a una bandeja para hornear. Con las puntas de los dedos, haga seis indentaciones, lo suficientemente grandes como para contener los tomates cherry en la parte superior de la masa. Presione los tomates cherry en las hendiduras, rocíe sobre el aceite de oliva y hornee en el horno durante 10-12 minutos, o hasta que estén dorados y cocidos.", "Sirva caliente, en rodajas, con mantequilla para untar."], "url": "www_bbc_co_uk_food_recipes_cherrytomatoandspina_89248", "title": "Tomate cherry y pan de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de feta (suficiente para hacer 40 cuadrados)", "120ml / 4fl oz de aceite de oliva virgen extra", "1 limón sin cebar, solo cáscara", "2 cucharaditas de orégano recién picado", "1 cucharadita de pimienta negra agrietada", "40 tomates cherry", "gran manojo de albahaca", "40 pinchos largos"], "method": ["Corta el queso feta en 40 cuadrados pares y colócalos en un tazón. Vierta sobre el aceite de oliva; agregue la ralladura de limón, el orégano y la pimienta negra agrietada. Deje marinar durante al menos 2 horas o preferiblemente durante la noche.", "Para armar, toma un pincho y coloca primero un tomate cherry, sigue con un cubo de queso feta. Podrías preparar los pinchos en esta etapa de antemano, solo mantente refrigerado.", "Termina cada una con una hoja de albahaca. Ensarte una punta de la hoja y luego la otra para que parezca una pequeña vela. Repite hasta que tengas cuarenta pinchos."], "url": "www_bbc_co_uk_food_recipes_cherrytomatomarinate_68101", "title": "Tomate cherry, feta marinada y pinchos de albahaca", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 40", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherrytomatomarinate_68101_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de cerezas congeladas", "1 cucharadita de miel líquida o jarabe de agave", "pequeñas almendras picadas", "Avena de avena 40g / 1½ oz o avena tostada (use avena sin gluten si es necesario)", "150ml / 5fl oz de leche de almendras", "3 gotas de extracto de almendra (opcional)"], "method": ["Coloque todos los ingredientes en un recipiente, revuelva, coloque la tapa y guárdelos en la nevera durante la noche. Si prefieres tu avena calentada, coloca la mezcla en el microondas durante 30 segundos para liberar los aromas y sabores."], "url": "www_bbc_co_uk_food_recipes_cherry_bakewell_98122", "title": "Avena de la noche de Cherry Bakewell", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_bakewell_98122_16x9.jpg", "isVegetarian": true, "recommendations": 0}]