[{"ingredients": ["25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "2 cebollas grandes, finamente cortadas", "750g / 1½lb Patatas de abeto rosado, peladas, sancochadas y cortadas en trozos de 1cm / ½ en trozos", "250 g / 8oz de espinacas frescas, cocidas y picadas", "10 huevos de gallinas camperas, ligeramente golpeados", "sal y pimienta recién molida"], "method": ["En una sartén grande y de base pesada, caliente la mantequilla y el aceite. Cocine las cebollas lentamente hasta que estén transparentes y suaves.", "Agregue las rodajas de papa y fríaselas suavemente durante dos minutos.", "Agregue la espinaca.", "Sazonar los huevos con sal y pimienta negra recién molida y verter sobre el contenido de la sartén.", "Cocine a fuego bajo a medio: puede tomar hasta diez minutos hasta que el huevo esté lo suficientemente listo para voltear la tortilla, y si el calor es demasiado alto, la parte inferior se quemará antes de que se establezca el medio.", "Una vez que el fondo está bien dorado y el centro se ha establecido, es hora de darle la vuelta. Esto se hace con una doble vuelta: coloque una placa (o el fondo de una lata tarta) sobre la sartén y voltéela una vez, de modo que la superficie cocida de la tortilla esté en la parte inferior. Tome otro plato y voltéelo de nuevo para que la superficie cocida esté en la parte superior. Luego coloque la sartén sobre la placa de tortilla y voltee una vez más, para que la broca sin cocer esté en contacto con la base de la sartén.", "Vuelva a colocar la sartén a fuego lento hasta que la tortilla esté cocida.", "Sirva caliente, caliente o frío, cortado en rodajas o cubos."], "url": "www_bbc_co_uk_food_recipes_tortilla_11230", "title": "Tortilla de estilo español", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_11230_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla, finamente picada", "1 pimiento rojo o naranja, sin grano y cortado en anillos", "50g / 1¾oz de champiñones, finamente rebanados", "Papas 400 g / 14 oz", "50g / 1¾oz de guisantes congelados", "4 huevos grandes de gallinas camperas", "1 cucharadita de mostaza en grano (opcional)", "pimienta negra (opcional)", "30g / 1oz de queso Cheddar maduro bajo en grasa", "pan crujiente, para servir"], "method": ["Coloque la cebolla, el pimiento y los champiñones en un recipiente apto para microondas, cúbralos con una tapa o película adhesiva, deje un área pequeña y cocínelos a plena potencia durante cuatro minutos.", "Mientras tanto, pele las papas (o simplemente frótelas si las pieles son buenas) y corte.", "Saca el plato del microondas, retira las verduras y ponlas a un lado en un tazón pequeño.", "Coloque las papas en un recipiente apto para microondas, cubra con una tapa o película adhesiva, dejando un área pequeña abierta, y cocine a máxima potencia durante seis minutos. Deje reposar por dos minutos, luego verifique que las rebanadas estén suaves. Si no lo son, cocine a máxima potencia por otro minuto.", "Coloque los guisantes en un colador y vierta un poco de agua hirviendo sobre ellos para ablandarlos, luego drene.", "Agriete los huevos en un bol, mezcle bien con la mostaza y la pimienta negra (si está usando) hasta que estén espumosos.", "Mezcle las papas, la mezcla de verduras y los guisantes juntos suavemente en el plato apto para microondas y vierta sobre los huevos.", "Rallar el queso y espolvorearlo en el plato sobre el huevo.", "Cocine a plena potencia durante dos minutos, luego retire el plato y revuelva las partes externas de la mezcla en el centro y aplaste con una cuchara.", "Cocine por otros dos minutos y repita como en el paso 9.", "Cocine por otros dos minutos y retire el plato del microondas, cubra con una película adhesiva y déjelo reposar durante dos minutos para terminar de cocinar. Si el huevo todavía está un poco líquido, cocine por otro minuto a máxima potencia.", "Cortar en trozos y servir con una ensalada de tomate y pan crujiente."], "url": "www_bbc_co_uk_food_recipes_tortilla_28732", "title": "Tortilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharaditas de sal de apio", "1 cucharada de orégano seco", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de sal de ajo", "2 cucharaditas de comino molido", "1 cucharadita de pimentón ahumado", "2 limas, cáscara y jugo solamente", "6 muslos de pollo, sin piel", "6 tomates, cortados a la mitad", "1 cebolla roja grande, cortada en cuñas", "2 chiles rojos o verdes grasos", "1 chili chipotle seco", "4 dientes de ajo, pelados", "1 cilantro pequeño racimo", "2 limas, solo jugo", "sal y pimienta", "3 aguacates maduros", "3 cucharadas de crema agria", "½ lima, ralladura y jugo", "½ limón, ralladura y jugo", "1 cucharada de aceite de oliva", "sal y pimienta", "12-18 tortillas de maíz o tortillas de harina (3 por persona)", "crema agria, al gusto", "200 g / 7 oz Monterey Jack o queso cheddar fuerte, rallado", "1 manojo de cebolletas, finamente picado", "1 manojo de cilantro, finamente picado"], "method": ["Para el pollo picado picado, precaliente el horno a 180C / 350F / Gas 4.", "Agregue todos los ingredientes secos y la ralladura de limón a una bolsa de plástico para alimentos. Agite la bolsa para que todas las especias se mezclen.", "Seque los muslos de pollo con papel de cocina y luego exprima el jugo de lima sobre la carne de pollo. Coloca uno por uno los muslos de pollo en la bolsa y cúbrelos con la mezcla de especias. La lima es para dar sabor, pero también ayuda a que las especias se mezclen.", "Deje el pollo marinado durante aproximadamente una hora. Retire el pollo de la bolsa, coloque los muslos cubiertos en un plato para asar y cocine durante 35 minutos, o hasta que estén cocidos.", "Mientras tanto, prepara la salsa de tomate asado. Precalentar la parrilla a alto. Coloque los tomates, las rodajas de cebolla roja, los chiles y el ajo en una bandeja para hornear. Cepille ligeramente con aceite.", "Coloque debajo de la parrilla caliente y cocine hasta que las pieles de tomate estén ennegrecidas, aproximadamente 10 minutos.", "Coloque todos los ingredientes carbonizados en un procesador de alimentos con el chile chipotle, el cilantro y el jugo de lima. Pulse hasta lograr una consistencia gruesa. Sazone al gusto con sal y pimienta negra recién molida. Ponga a un lado hasta que esté listo para servir.", "Para el guacamole, corte los aguacates por la mitad y retire la piedra. Retire la carne de la piel y corte aproximadamente.", "Coloque en un recipiente y aplaste ligeramente con un tenedor. Agregue la crema agria, el jugo de limón y lima y la ralladura. Sazone al gusto con sal y pimienta negra recién molida y termine con un chorrito de aceite de oliva. Ponga a un lado hasta que esté listo para servir.", "Para el pollo picante rallado, una vez que el pollo esté cocido, deje enfriar. Cuando esté lo suficientemente frío como para manipularlo, retire la carne del hueso y triture.", "Para construir las torres de tortilla, coloque una cucharada de guacamole en el centro de cada plato y coloque una tortilla en la parte superior.", "Agregue una capa de guacamole, luego pollo, salsa, crema agria y queso. Agregue otra tortilla y repita nuevamente. Termine con una ramita de cilantro y una pizca de cebolletas."], "url": "www_bbc_co_uk_food_recipes_tortilla_towers_65545", "title": "Torres de tortilla", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortilla_towers_65545_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite vegetal, para freír", "2 tortillas de harina cortadas en triángulos", "55g / 2oz de frijoles mezclados de estaño", "2 dientes de ajo, pelados y toscamente picados", "3-4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "¼ tomates de hojalata picados", "2 cucharadas de salsa de tomate", "pizca de chile en polvo", "Yogur de estilo griego", "Puñado de cilantro fresco, picado"], "method": ["Caliente una olla un tercio llena de aceite vegetal para freír, hasta que una miga chisporrotee suavemente. (PRECAUCIÓN: El aceite caliente puede ser muy peligroso. No lo deje sin supervisión).", "Freír los triángulos de tortilla durante 30 segundos a un minuto, o hasta que estén dorados, y luego retirar cuidadosamente y escurrir sobre papel de cocina.", "Para la salsa de frijoles, mezcle los frijoles, el ajo, el aceite de oliva y el aderezo en un procesador de alimentos hasta que quede suave. Transfiere a un plato.", "Para la salsa de tomate, mezcle el tomate en lata, la salsa de tomate y el chile en polvo en un procesador de alimentos hasta que quede suave. Transfiere a un plato.", "Sirva los chips de tortilla junto a los salsas y sirva cada uno con el yogur espolvoreado con cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_tortillachipswithdip_76376", "title": "Tortilla chips con inmersiones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "4 tortillas de harina cortadas en triángulos", "sal marina, para rociar", "2 cucharaditas de chiles chipotle picados", "200ml / 7fl oz de yogur al estilo griego", "exprimir jugo de lima", "¼ de pimiento rojo, finamente picado", "pellizcar el condimento Cajun spice", "sal y pimienta negra recién molida", "dash aceite de oliva", "1 maíz en la mazorca, solo granos", "¼ de cebolla, finamente picada", "1 diente de ajo, finamente picado", "¼ de pimiento rojo, finamente picado", "¼ de pimiento amarillo, finamente picado", "¼ de pimiento verde, finamente picado", "1 cucharadita de chiles chipotle picados", "pellizcar el condimento Cajun spice", "sal y pimienta negra recién molida", "2 cucharadas de cilantro fresco picado"], "method": ["Para los chips de tortilla, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se ponga dorado cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque con cuidado los triángulos de tortilla en el aceite caliente y fríalos durante 3-4 minutos o hasta que estén dorados y crujientes. Retire con una espumadera y escurra sobre papel de cocina. Dispersar con sal marina.", "Para la salsa de yogur picante, coloque todos los ingredientes de inmersión en una mini licuadora y mezcle hasta obtener un puré grueso. Cuchara en un tazón pequeño.", "Para la salsa de maíz, caliente el aceite de oliva en una sartén mediana, agregue los granos de maíz y fría por 2-3 minutos. Agregue la cebolla picada y fría por dos minutos. Agregue el ajo y fría por un minuto.", "Agregue los pimientos finamente picados y fría por dos minutos. Agregue los chiles chipotle, la especia cajún, la sal y la pimienta negra recién molida y mezcle bien a fuego lento durante un minuto. Agregue el cilantro picado.", "Para servir, coloca la salsa en un plato para servir. Coloque el tazón pequeño de salsa de yogur en el medio del plato de servir y luego coloque las tortillas crujientes alrededor del borde. Sirve mientras las tortillas aún estén tibias."], "url": "www_bbc_co_uk_food_recipes_tortillachipswithspi_88038", "title": "Tortilla chips con salsa de yogurt picante y salsa de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cebolla mediana, aproximadamente 4 oz (110 g)", "275 g / 10 oz pequeñas patatas Desirée", "3 cucharadas de aceite de oliva", "5 huevos grandes", "sal y pimienta negra recién molida"], "method": ["Primero algunos puntos a tener en cuenta. El tamaño de la sartén es importante: una medida base de 20 cm / 8 pulgadas de diámetro es ideal para dos o tres personas. Si usa una sartén más grande para más personas, no debería ser demasiado pesada porque necesita apagar la tortilla con ambas manos. Use una sartén antiadherente si no tiene una sartén bien sazonada. Una gran ventaja aquí es una tapa de cacerola plana o un plato grande que se adapta a la sartén.", "En primer lugar, pele y corte la cebolla por la mitad, luego corte finamente cada mitad y separe las capas en formas de media luna. Ahora corta las papas con un pelador de patatas y córtalas en rodajas finas. Tienes que trabajar muy rápido aquí porque no quieres que las rodajas se doren. Cuando estén en rodajas, frótelas en un paño limpio para que estén lo más seco posible.", "A continuación, caliente 2 cucharadas de aceite de oliva en la sartén y, cuando esté humeando, agregue las papas y las cebollas. Mezcle en el aceite para obtener una buena capa, luego baje el fuego a su nivel más bajo, agregue una abundante cantidad de sal y pimienta, tape la sartén y deje que las cebollas y las patatas se cocinen suavemente durante 20 minutos. , o hasta que esté tierno. Déles la vuelta hasta la mitad y agite la sartén de vez en cuando, ya que se supone que no deben dorarse mucho, sino que simplemente cuezan en el aceite.", "Mientras tanto, rompe los huevos en un tazón grande y, con un tenedor, batlos ligeramente - es importante no sobrepasarlos. Finalmente, agregue un poco de condimento. Cuando las cebollas y las papas estén cocidas, transfiéralas rápidamente a los huevos en el tazón.", "Vuelva a colocar la sartén sobre el fuego, agregue el resto del aceite y vuelva a calentar el fuego a la mitad. Luego mezcle la papa y los huevos a fondo antes de verter todo en la sartén y baje la temperatura a su nivel más bajo inmediatamente. Ahora olvídate de las tortillas francesas y ten paciencia, porque tomará entre 20 y 25 minutos cocinar lentamente, sin cubrir.", "De vez en cuando, dibuja el borde suavemente con una espátula, ya que esto le dará un hermoso borde redondeado. Cuando prácticamente no queda huevo líquido en la superficie de la tortilla, voltéelo para cocinar el otro lado. Para hacer esto, coloque una tapa o placa plana sobre la bandeja, invierta cuidadosamente ambos para que la tortilla quede en la tapa o en la placa. Vuelva a colocar la sartén sobre el fuego y use la cuchilla de paleta para volver a colocar la tortilla con cuidado. Déle unos 2 minutos más, luego apague el fuego y déjelo por otros 5 minutos para que se asiente. Luego debe cocinarse pero aún húmedo en el centro. Servir caliente o frío, cortado en trozos, con ensalada y vaso de Rioja, es brillante."], "url": "www_bbc_co_uk_food_recipes_tortillaspanishomele_67957", "title": "tortilla española", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tortillaspanishomele_67957_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de acelga suiza", "50ml / 2fl oz de aceite vegetal", "12 chalotes de plátano, pelados", "115g / 4oz de mantequilla", "2 hojas de laurel", "tomillo de ramita", "sal marina", "2 x 680 g / 1 libra de filetes de hueso en forma de T de 8 oz, gruesos", "pimienta negra recién molida", "250ml / 9fl oz de carne de vaca o ternera", "60g / 2¼oz de anchoas, picadas", "2 cucharadas de alcaparras", "1 limón, solo jugo"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Pele las hojas de la acelga, lávelas y colóquelas a un lado. Recorte los tallos de las imperfecciones y corte en palos de aproximadamente 5 cm de largo y 2 cm de ancho. Poner a hervir una olla de agua con sal, echar los tallos de acelga y volver a hervir. Escurrir, sumergir los tallos en agua helada, drenar nuevamente y dejar de lado.", "Calentar el aceite en una sartén, agregar los chalotes y colorearlos a fuego alto. Cuando estén coloreados, drene y deseche el aceite. Agregue 50 g / 1¾ oz de la mantequilla, las hojas de laurel, el tomillo y la sal a la sartén y cocine durante cinco minutos, sacudiendo la sartén de vez en cuando, teniendo cuidado de no quemar la mantequilla.", "Agregue suficiente material para cubrir el fondo de la sartén y permita que el líquido se reduzca antes de agregar más caldo a la sartén. Continúe con el caldo restante hasta que los chalotes estén muy suaves y tengan un espeso y mantecoso glaseado.", "Mientras tanto, caliente una plancha o una sartén a prueba de horno y sazone bien la carne. Anota un poco la grasa y coloca los filetes con la grasa hacia abajo sobre la plancha. La grasa comenzará a derretirse y sazonar el exterior de la carne.", "Una vez que la grasa se derrita y comience a carbonizarse, deje que la carne se cocine durante cuatro minutos. Dé vuelta y cocine por otros cuatro minutos. Gire de nuevo para cocinar en su lado más estrecho durante dos minutos, sujételo con pinzas, gire una vez más para cocinar el otro lado más angosto durante dos minutos, luego retírelo del fuego y transfiéralo al horno durante unos seis minutos para un filete mediano . Déjalo reposar durante cinco minutos antes de servir.", "Mientras el bistec está en el horno, caliente una sartén a fuego alto y derrita la mantequilla restante. Agregue los tallos de acelga blanqueados, cocine durante tres minutos y luego agregue las hojas de acelga, revolviendo hasta que se marchiten. Sazone con sal marina y pimienta negra recién molida, agregue las anchoas, las alcaparras y el jugo de limón y cocine durante dos minutos más.", "Con una cuchara ranurada, escurra la acelga y colóquela en platos grandes y calientes, reservando la salsa. Coloque los filetes encima de la acelga, vierta sobre la salsa y sirva con los chalotes caramelizados."], "url": "www_bbc_co_uk_food_recipes_toscano_t-bone_steaks_81056", "title": "Filetes de Toscano T-bone con chalotes carbonizados y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "200ml / 7fl oz de yogur al estilo griego", "4 nidos de merengue comprados en tiendas", "1 mango maduro, piel y piedra retiradas, carne cortada en trozos de 1cm / ½ en trozos", "3 frutas de la pasión, cortadas a la mitad", "4 ramitas de menta fresca, para decorar (opcional)"], "method": ["Suavemente batir la crema en un tazón grande hasta que se formen picos suaves.", "Dobla el yogur a través de la crema, teniendo cuidado de no mezclar demasiado.", "Rompe los merengues en el tazón y revuelve suavemente para combinar. Debería ser una mezcla bastante dura.", "Coloque una capa de la mezcla de merengue en la base de cuatro vasos para servir. Espolvorear sobre un puñado de trozos de mango y rociar con semillas de maracuyá. Repita hasta que se agote toda la mezcla de merengue y la fruta.", "Decorar con ramitas de menta, si se usan) y comer de inmediato."], "url": "www_bbc_co_uk_food_recipes_totally_tropical_eton_10141", "title": "Lío totalmente tropical de Eton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/totally_tropical_eton_10141_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de hojaldre listo para el uso de 2 oz", "harina común, para quitar el polvo", "1 huevo de gallinas camperas, golpeado", "8 salchichas herby (lo mejor que puedes pagar), cortadas en dos", "sal y pimienta negra recién molida", "pequeñas hojas de tomillo fresco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Ruede los pasteles en una superficie enharinada a un rectángulo de aproximadamente 48x32cm / 19x12½ pulgadas y golpee la masa un poco con el rodillo. La hojaldre está hecha de capas finas y normalmente tienes que ser muy delicado con ella. Para los rollos de salchichas, la masa debe estar ligeramente hinchada, pero no demasiado, por lo que golpearla con un rodillo reduce la cantidad que hincha.", "Corta el rectángulo grande por la mitad a lo largo, luego corta ambos rectángulos más pequeños en ocho secciones iguales. Ahora tiene 16 rectángulos en total. Cepille un extremo de cada rectángulo con un poco del huevo batido, coloque un trozo de salchicha en el otro extremo, sazone la salchicha con sal y pimienta negra recién molida y espolvoree con hojas de tomillo. Enrolla la salchicha en la masa para encerrar y repetir con todas las salchichas. Coloque los rollos de salchicha en la nevera durante 20 minutos para que la masa se endurezca.", "Una vez que la masa es dura, retire los rollos de salchichas de la nevera y golpee las partes superiores con un cuchillo afilado para decorar, o pique con un tenedor. Cepíllese bien con el resto del huevo batido y hornéelos en el horno durante 25-30 minutos, o hasta que la masa se ponga dorada y se vea crujiente. Retire del horno y deje enfriar un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_totally_lazy_mini_98499", "title": "Mini rollos de salchicha totalmente perezosos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 16 rollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/totally_lazy_mini_98499_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "Zanahorias de 150g / 5½oz, cortadas en bastones de 7cm / 2¾", "4 dientes de ajo, aplastados", "Tocino de tocino 150 g / 5½ oz", "25 g / 1 oz de grasa de pato", "Apioalerio de 150 g / 5½ oz, pelado y cortado en bastones de 7 cm / 2¾", "1 repollo savoy, hojas externas oscuras eliminadas, sin corazón y cortadas en rodajas de 5 mm / ¼", "100ml / 3½ fl oz crema doble", "1 cucharadita de aceite vegetal", "1 cucharadita de chalote finamente picado", "25ml / 1fl oz de vinagre de frambuesa", "500ml / 18fl oz de vino tinto", "150ml / ¼ litro de carne de ternera", "50g / 1¾oz de chocolate negro (70% de sólidos de cacao), roto en pedazos", "30g / 1oz de mantequilla sin sal", "4 piezas de lomo de venado (aproximadamente 150 g / 5½ oz cada uno)", "50 g / 1¾oz de mantequilla sin sal", "sal y pimienta negra recién molida"], "method": ["Para el repollo, caliente 25 g / 1 oz de la mantequilla en una cacerola mediana a fuego medio. Agregue las zanahorias y un poco de aderezo y sude hasta que estén tiernas, luego agregue el ajo y cocine por unos minutos, revolviendo constantemente.", "Transfiera las zanahorias a un recipiente con una cuchara ranurada, luego agregue el tocino a la sartén. Freír durante unos 5 minutos, hasta que estén crujientes, luego colocar en el bol con las zanahorias. Agregue la grasa de pato y el apionabo a la misma olla y cocine el apionabo lentamente, a fuego lento, agregando una gota de agua si es necesario para evitar que se enganche y queme. Cocine por unos 10 minutos o hasta que esté ligeramente dorado y tierno. Use la cuchara con ranura para transferirlo al tazón de zanahorias y tocino.", "Agregue otro 25 g / 1 oz de mantequilla a la sartén y cuando esté caliente, agregue el repollo, sazone y cubra con una tapa ajustada. Cocine la col a fuego alto, agitando la sartén de vez en cuando para evitar que se enganche. Cocine hasta que estén tiernos, luego mezcle las zanahorias, el tocino y el apionabo, junto con la crema. Sazonar con sal y pimienta y reservar, mantener caliente.", "Para la salsa, agregue el aceite a una sartén y sude las chalotas a fuego medio durante 5 minutos o hasta que estén suaves. Agregue el vinagre y permita que se evapore por completo. Agregue el vino y reduzca a aproximadamente un cuarto de su volumen original (debe quedar con 125 ml / 4 fl oz), luego agregue el caldo y el chocolate. Cuando el chocolate se haya derretido, bata la mantequilla. Cúbralo y manténgalo caliente", "Para la carne de venado, sazone bien los lomos con sal y pimienta, luego caliente la mantequilla en otra sartén a fuego medio y cocine las piezas de venado durante 4-5 minutos por cada lado para raras. El tiempo de cocción dependerá del grosor de la carne, por lo que cocínelo según su gusto. Retire de la sartén y descanse en un plato, cubierto con papel de aluminio, durante 7 minutos.", "Para servir, corte cada pedazo de venado y sirva con la salsa y el repollo al costado."], "url": "www_bbc_co_uk_food_recipes_tournedos_of_venison_87389", "title": "Venado con salsa de frambuesa y chocolate amargo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 papa grande, pelada y toscamente rallada, jugos exprimidos", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "botón de mantequilla", "1 cucharada de aceite de oliva", "125g / 4½oz de gambas de tigre peladas crudas, descongeladas si están congeladas", "½ lima", "2 cucharaditas de eneldo fresco picado", "sal y pimienta negra recién molida", "1 cucharada de yogur al estilo griego", "1 cucharada de crema doble", "1 cucharada de mostaza integral", "1 cucharada de miel clara", "½ limón, ralladura fina únicamente", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "puñado de hierbas frescas, como el eneldo, el cebollín, el perejil y la albahaca", "½ cucharadita de vinagre balsámico", "1 cucharadita de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para los röstis, caliente una sartén de base pesada.", "Coloque la papa rallada en un recipiente y sazone bien con sal y pimienta negra recién molida. Divida en cuatro porciones.", "Coloque el aceite y la mantequilla en la sartén calentada, luego agregue las empanadas de patata. Cocine por 3-4 minutos en cada lado, presionando hacia abajo firmemente con una lonja de pescado, hasta que esté cocido y dorado.", "Mientras tanto, para las gambas, calienta otra sartén. Agregue el aceite de oliva y la punta en los langostinos. Freír a fuego medio durante aproximadamente un minuto, hasta que las gambas se hayan puesto rosadas y estén cocidas.", "Exprima el jugo de lima y espolvoree sobre el eneldo. Sazonar, al gusto, con sal y pimienta negra recién molida y remover bien.", "Para la crema agria de mostaza, coloque el yogur en un tazón pequeño con la crema, la mostaza, la miel, la ralladura de limón y el aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida y remover bien.", "Para la ensalada de hierbas, coloque las hierbas en un recipiente y rocíe sobre el vinagre y el aceite. Sazonar, al gusto, con sal y pimienta negra recién molida y revuelva para cubrir las hojas.", "Para servir, coloque uno de los röstis de papa en un plato calentado y coloque algunas de las gambas en la parte superior. Rocíe un poco de la crema agria de mostaza. Repita estas capas hasta que todos los ingredientes hayan sido agotados. Adorne con la ensalada de hierbas vestida y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_towerofbutteredprawn_87813", "title": "Torre de gambas con mantequilla rostis con crema agria de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de fruta mixta seca (use una mezcla de pasas sultanas, pasas y albaricoques cortados)", "1 manzana pequeña para cocinar, pelada, sin corazón y picada", "1 naranja, corteza finamente rallada y jugo", "3 cucharadas de brandy, jerez o ron, más extra para flamear", "75g / 3oz de mantequilla, ablandada, más extra para engrasar", "100g / 3½oz de azúcar mascabado ligero", "2 huevos de gallinas camperas", "100g / 4oz de harina de auto crianza", "1 cucharadita de especias mixtas", "40g / 1½ oz de pan blanco fresco", "40 g / 1½ oz de almendras peladas enteras, aproximadamente picadas", "100g / 3½oz de mantequilla sin sal, ablandada", "225g / 8oz de azúcar glas, tamizado", "3 cucharadas de brandy, ron o coñac", "4 cucharadas de brandy o ron"], "method": ["Mida las pasas, las pasas, los albaricoques y la manzana en un tazón con el jugo de naranja. Agregue el brandy medido (ron o jerez), revuelva y deje macerar por aproximadamente una hora.", "Ponga la mantequilla medida, el azúcar y la cáscara de naranja rallada en un tazón grande y crema junto con una cuchara de madera o un batidor de mano hasta que esté suave y esponjosa. Poco a poco golpee los huevos, agregue un poco de la harina medida si la mezcla comienza a cuajar.", "Tamizar la harina y la mezcla de especias, luego doblar en la mezcla de crema con las migas de pan y las nueces. Agregue las frutas secas empapadas con su líquido de remojo y mezcle bien.", "Mantene generosamente un recipiente de pudín de 1,4 litros / 2 ½ pinta. Corta un pequeño disco de papel de aluminio o pergamino para hornear y presiona en la base del lavabo.", "Cuchara en el cuenco de budín preparado y presione la mezcla con el dorso de una cuchara. Cubra el budín con una capa de papel de hornear y papel de aluminio, ambos plisados ​​en el medio para permitir la expansión. Ate firmemente con una cuerda y recorte el exceso de papel y papel de aluminio con unas tijeras.", "Para cocer al vapor, ponga el budín en la parte superior de un vapor lleno de agua hirviendo a fuego lento, cúbralo con una tapa y deje que se caliente durante ocho horas, llenando el agua según sea necesario.", "Para hervir el budín, coloque una tapa de jarra de metal o una tapa metálica en la base de una sartén grande para hacer las veces de trébedes. Coloque una tira larga y doblada de papel de aluminio en la sartén, entre el salvamanteles y el recipiente de budín, asegurándose de que los extremos de la tira se alcen y cuelguen de los bordes de la sartén. Esto lo ayudará a levantar el pesado recipiente de budín de la fuente de agua caliente cuando haya terminado de cocinar.", "Baje el budín en el salvamanteles y vierta suficiente agua hirviendo para llegar a la mitad del recipiente. Cubra con una tapa, vuelva a hervir el agua y cocine a fuego lento durante aproximadamente siete horas, hasta que el pudín tenga un glorioso color marrón oscuro, llenando el agua según sea necesario.", "Para la mantequilla de brandy, coloque la mantequilla en un tazón y bata con una cuchara de madera hasta que quede liviana y esponjosa, o para usar con velocidad, una batidora eléctrica. Batir el azúcar impalpable tamizado hasta que quede suave, luego agregar el brandy, el ron o el coñac, al gusto. Ponga la cuchara en un plato para servir, cúbrala y déjela en el refrigerador.", "Cuando esté bien cocido, retire el pudin de la sartén y deje enfriar por completo. Deseche el papel y la lámina y reemplácelos con frescos. Guardar en un lugar fresco y seco.", "Para servir, en el día de Navidad, cocine al vapor o hierva el budín durante aproximadamente dos horas para recalentar. Convierte el pudín en un plato de servir. Para flamear, caliente el brandy o el ron en una sartén pequeña, viértalo sobre el pudín caliente y enciéndalo. Sirve con mantequilla de brandy."], "url": "www_bbc_co_uk_food_recipes_traditional_christmas_38771", "title": "Pudín de Navidad tradicional con mantequilla de brandy", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_christmas_38771_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de cordero de 1,5 kg / 3 lb 5 oz, cortado en piezas de 2,5 cm / 1 in", "sal marina y pimienta negra recién molida", "1 cucharada de aceite vegetal", "75g / 2¾oz de mantequilla", "6 riñones de cordero, cortados, desollados y picados", "2 cebollas grandes, gruesas en rodajas", "2 ramitas de romero fresco, solo hojas, picadas", "3 dientes de ajo, toscamente picados", "2 cucharadas de harina normal", "150ml / 5fl oz de vino tinto", "500ml / 18fl oz de caldo de carne", "2 cucharadas de salsa Worcestershire", "1 hoja de laurel", "2 ramitas de tomillo fresco", "1,5 kg / 3lb 5 oz patatas harinosas, peladas y cortadas en rodajas gruesas de 5 mm / 1/4 pulgadas", "50 g / 1¾oz de mantequilla sin sal, derretida", "1 coliflor grande, cortada en florecillas", "50g / 1¾oz de mantequilla, más extra para engrasar", "50g / 1¾oz de harina natural", "450ml / 16fl de leche en oz", "2 yemas de huevo de gallinas camperas", "1 cucharadita de mostaza inglesa", "200g / 7oz Lincolnshire Poacher (o queso cheddar fuerte), rallado"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 4. Sazonar el cordero con sal marina y pimienta.", "Caliente una cacerola grande a prueba de horno hasta que esté caliente, luego agregue el aceite y la mantequilla y dore el cordero hasta que se dore por todas partes. Tendrá que hacer esto en lotes.", "Coloque el cordero a un lado, luego brevemente los riñones de los corderos en la misma sartén. Agregue las cebollas y el romero añadiendo un poco más de mantequilla a la sartén si es necesario, y cocínelos durante aproximadamente 10 minutos hasta que se pongan marrones en los bordes.", "Agregue la harina y cocine por un minuto, agregue el vino tinto y reduzca a la mitad, luego agregue el caldo y la salsa Worcestershire. Batir hasta que la harina y el líquido se mezclen sin problemas. Sazonar con sal marina y pimienta y llevar al punto de cocción lenta. Regrese el cordero a la sartén y luego agregue la hoja de laurel y el tomillo.", "Coloque las rodajas de papa encima de la carne, superponiéndose entre sí. Sazone las papas con sal marina y pimienta, luego cepille con un poco de mantequilla derretida.", "Cubra con una tapa ajustada y hornee por 1½ horas. Retire la tapa y encienda el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cocine por otros 20-30 minutos hasta que las papas estén doradas y crujientes.", "Mientras tanto, para el queso de coliflor, precaliente la agalla en alto.", "Llevar a ebullición una sartén grande de agua salada, luego agregar las flores de coliflor y cocinar durante 2 minutos. Escurrir y colocar la coliflor en un plato a prueba de horno con mantequilla.", "Coloque la mantequilla y la harina en una cacerola y caliente para derretir la mantequilla. Cocine, revolviendo por 1-2 minutos hasta que esté ligeramente dorado. Retire la sartén del fuego y bata gradualmente en la leche para formar una salsa suave. Regrese la salsa al fuego y cocine a fuego lento durante 2-3 minutos. Retire del fuego y bata las yemas de huevo, la mostaza y la mitad del queso. Sazone con sal y pimienta, vierta sobre la coliflor y cubra con el queso restante. Coloque debajo de la parrilla y cocine hasta que estén doradas.", "Coloque las cucharadas del caldo y el queso de coliflor sobre los platos calientes y sirva."], "url": "www_bbc_co_uk_food_recipes_traditional_lancashire_24992", "title": "Estofado de cordero con queso de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-4kg / 4lb 8oz-9lb articulación gammon sin hueso sin apelmazar, atado", "2 cebollas, cortadas a la mitad", "2 zanahorias, peladas, cortadas en 5 cm / 2 en pedazos", "2 tallos de apio, cortados en trozos de 5cm / 2in", "4 hojas de laurel", "12 granos de pimienta negra", "pequeños dientes de ajo", "4 cucharadas de miel líquida", "4 cucharadas de mostaza inglesa"], "method": ["Coloque la unión gammon en una olla grande con tapa, cubra con agua fría y deje hervir a fuego alto. Escurra el agua de la cacerola, agregue agua fría fresca, agregue las cebollas, zanahorias, apio, hojas de laurel y granos de pimienta y deje hervir una vez más. Reduzca el fuego, cubra con una tapa y cocine a fuego lento el jamón y las verduras suavemente durante 20 minutos por cada 500 g / 1 lb 2 oz. (Si su sartén no es lo suficientemente grande como para cubrir la junta por completo, cambie el jamón a la mitad del tiempo de cocción).", "Retire el jamón del agua y déjelo enfriar durante 15 minutos. (El líquido para cocinar se puede filtrar y reservar para hacer sopa en otro momento).", "Precaliente el horno a 200C / 400F / Gas 6 y forre una lata grande para asar con papel de aluminio.", "Use un cuchillo pequeño para quitar la corteza de la junta gammon, dejando la mayor cantidad de grasa intacta como sea posible. Anota la grasa en un patrón de diamante y coloca un diente en el centro de cada 'X'.", "Coloque el jamón en la bandeja de asar forrada con papel de aluminio, asegurándose de que los lados de la lámina lleguen a la mitad de la junta para contener los jugos de tostación.", "Para el glaseado, mezcle la miel y la mostaza juntas y cepille la mitad uniformemente sobre el jamón, incluyendo un lado de la junta. Asar en el centro del horno durante diez minutos, luego sacar la articulación y cepillar la parte superior y el resto del lado con el resto del glaseado. Regrese el jamón al horno por otros 10-15 minutos, girando la lata para que el lado opuesto del jamón quede hacia la parte posterior del horno.", "El gammon está listo cuando la grasa en la parte superior es brillante y dorada. Cúbralo ligeramente con papel de aluminio si la parte superior comienza a verse demasiado marrón. Retire el jamón del horno y déjelo reposar durante 15 minutos antes de tallar.", "Vierta los jugos que se hayan recogido en el papel de aluminio en una sartén pequeña, y caliente suavemente.", "Tallar el jamón, servir en un plato grande y cuchara sobre los jugos calientes."], "url": "www_bbc_co_uk_food_recipes_traditional_honey-glazed_52289", "title": "Gammon glaseado con miel tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve de 10 a 20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_honey-glazed_52289_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700ml / 1 ¼ de vinagre de malta", "2 cucharadas de semillas de cilantro", "pizca de sal", "Coliflor de 500g / 1lb 2oz, rota en florecillas de 3cm / 1¼", "2 cebollas picadas", "3 cucharadas de mostaza inglesa en polvo", "3 cucharadas de harina común", "1 cucharada de cúrcuma molida", "2 cucharaditas de jengibre molido", "50ml / 2fl oz de vinagre de sidra", "Frijoles franceses de 100g / 3½oz, cortados y cortados en rodajas de 1cm / ½ en rebanadas", "2 dientes de ajo, en rodajas", "200g / 7oz de azúcar granulada"], "method": ["Ponga el vinagre de malta, las semillas de cilantro y una pizca de sal en una sartén grande y deje que hierva. Agregue la coliflor y la cebolla y cocine a fuego lento durante cinco minutos, o hasta que esté ligeramente ablandada, pero aún crujiente.", "Mientras tanto, ponga la mostaza, la harina, la cúrcuma y el jengibre en un tazón pequeño y bata gradualmente el vinagre de sidra hasta que esté suave. Dejar de lado.", "Agregue las judías verdes, el ajo y el azúcar a la sartén y revuelva sobre el fuego durante 2-3 minutos, o hasta que el azúcar se haya disuelto. Escurra sobre un tazón grande para recoger el vinagre.", "Vuelva a poner la mezcla de mostaza y el vinagre en la sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 10 minutos, o hasta que sea lo suficientemente grueso como para cubrir la parte posterior de la cuchara, agregando más sal al gusto.", "Regrese las verduras drenadas a la sartén y agregue más azúcar y agua si es necesario y luego quite el fuego.", "Cuchara en tarros esterilizados calientes, sellados y frescos.", "Almacene por tres meses en un lugar fresco y oscuro antes de comer."], "url": "www_bbc_co_uk_food_recipes_traditional_piccalilli_48187", "title": "Piccalilli tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 3-4 jarras", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla picada", "2 dientes de ajo, finamente picados", "Filete de carne picada de 450 g / 1lb o picadillo de ternera", "1 cucharadita de mostaza inglesa", "1 cucharada de puré de tomate", "1 cubo de caldo de carne", "aceite vegetal", "150ml / 5fl oz brown ale", "100ml / 3½fl oz de caldo de carne", "2 cucharadas de harina normal", "sal y pimienta negra recién molida", "Harina de auto aumento de 350g / 12oz, más extra para quitar el polvo", "225 g / 8 oz de sebo de carne", "gran perilla de mantequilla, ablandada, para engrasar", "450 g / 1 libra de pasta brisa lista para usar, para la parte superior del pastel", "1 yema de huevo de gallinas camperas, ligeramente batida", "2 patatas grandes (preferiblemente gallo o Nadine), peladas, cortadas en trozos", "100ml / 3½fl oz de leche caliente", "botón de mantequilla", "rociar aceite de chile (opcional)", "50g / 2oz de mantequilla", "50g / 2 oz de harina de maíz", "500ml / 18fl oz de caldo de pollo", "generoso racimo de perejil, solo hojas, picado", "1-2 dientes de ajo, asados ​​y puré, al gusto", "anguilas en gelatina"], "method": ["Para el relleno, caliente el aceite de oliva en una sartén grande a fuego medio y fría la cebolla y el ajo durante cinco minutos o hasta que se ablanden. Agregue la carne picada y cocine durante cinco minutos, revolviendo ocasionalmente, o hasta que se dore y se cocine completamente.", "Agregue el resto de los ingredientes de relleno, sazone con sal y pimienta negra recién molida y deje enfriar.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para la pasta de sebo, tamice la harina en un tazón con el sebo y sazone con sal y pimienta negra recién molida. Poco a poco mezcle aproximadamente cuatro cucharadas de agua fría, o hasta que tenga una masa húmeda pero firme.", "En una superficie de trabajo ligeramente enharinada, enrolle la masa hasta obtener un grosor de 2 mm.", "Cocina generosamente dos platos de tarta individuales y luego recubre con la pasta de sebo, de modo que cubra por completo la base y los lados. Divida la mezcla de relleno entre los dos platos.", "Para la masa del pastel, extienda la masa de pasta en una superficie de trabajo ligeramente enharinada a un espesor de 2 mm y úsela para cubrir los dos pasteles, empujando hacia abajo los bordes para sellar. Cepille generosamente con la yema de huevo y haga un agujero en el medio de la tapa para permitir que salga el vapor.", "Coloque los platos de tarta en una lata de horno de paredes profundas y vierta suficiente agua hirviendo para llegar hasta la mitad de los lados de los platos de tarta, teniendo cuidado de no poner agua en la masa. Transfiera al horno y cocine durante 20-30 minutos, o hasta que la masa esté crujiente y dorada y el relleno humeante.", "Mientras tanto, para el puré de papas, vapor (o hervir) las papas durante 20 minutos o hasta que estén tiernas. Escaldar la leche y luego machacar las papas con la leche caliente, la mantequilla y mucha sal y pimienta negra recién molida hasta que quede suave. Rocíe con un poco de aceite de chile, si usa, y manténgalo caliente.", "Para el licor de perejil, derrita la mantequilla en una cacerola a fuego medio y mezcle con la harina de maíz para hacer una pasta. Poco a poco agregue el caldo, cocine a fuego lento, luego mezcle el perejil y el ajo y revuelva hasta que espese y suavice.", "Sirva los pasteles calientes con puré, licor de perejil y anguilas en gelatina en el lateral."], "url": "www_bbc_co_uk_food_recipes_traditional_pie_n_mash_76469", "title": "Pastel tradicional 'n' mash con licor de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7 litros / 12½ pintas de leche entera", "1kg / 2lb 4oz de arroz con leche", "500 g / 1 lb 2 oz de azúcar en polvo", "4 hojas de laurel", "6 pizca de nuez moscada recién molida", "3 cucharaditas de esencia de vainilla", "500g / 1lb 2oz de mermelada de fresa o frambuesa, para servir"], "method": ["Precalentar el horno a 160 ° C / 300 ° F / Gas 2.", "Revuelva todos los ingredientes, excepto el atasco, juntos en un tazón grande. vierta la mezcla en los platos de hornear.", "Cubra los platos con una tapa o una hoja de papel de aluminio y cocine en el horno durante 1 hora y media. Retire la tapa o papel de aluminio y cocine por otros 20 minutos, o hasta que el arroz esté tierno y la parte superior ligeramente dorada y haya formado una capa.", "Con una cuchara, coloca el arroz con leche en tazones para servir y sírvelo con cucharadas de mermelada."], "url": "www_bbc_co_uk_food_recipes_traditional_rice_pudding_34305", "title": "Arroz con leche tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60g / 2¼ oz de arroz con leche", "600ml / 20fl oz de leche entera", "1 cucharada de leche desnatada en polvo", "2 cucharadas de azúcar en polvo", "1 fina corteza de limón", "nuez moscada recién rallada, al gusto", "15 g / ½ oz de mantequilla sin sal, cortada en cubos pequeños", "jam, para servir"], "method": ["Precaliente su horno a 150C / 300F / Gas 2.", "Lave el arroz y el desagüe en un colador, luego colóquelo en un plato ancho para horno, de al menos 1 litro / 1¾ de capacidad para pintar. Vierta la leche. Agregue la leche en polvo, el azúcar en polvo y la cáscara de limón y mezcle. Rallar un poco de nuez moscada por encima y salpicar con la mantequilla.", "Poner en el horno y hornear durante 2-2½ horas, o hasta que el pudín tenga una piel dorada y el arroz esté tierno y cremoso (cuanto más tiempo lo leas, más espeso y pegajoso se volverá).", "Sirve caliente, con un poco de tu mermelada favorita en la parte superior."], "url": "www_bbc_co_uk_food_recipes_traditional_rice_pudding_76281", "title": "Arroz con leche tradicional", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de zanahorias Chantenay, peladas y dejadas enteras", "4 chirivías pequeñas, picadas", "1 calabaza pequeña, pelada, sin pepitas y picada", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 perdiz entera", "4 hojas grandes de salvia", "4 rebanadas de tocino rayado", "75 g / 2½ oz de mantequilla", "200 g / 7 oz de pan blanco fresco", "2 cucharadas de jerez seco medio", "1 cucharada de perejil fresco picado", "1 cebolla grande", "1 cucharada de clavo de olor", "1 hoja de laurel", "500ml / 18fl oz de leche entera", "8 granos de pimienta negra", "75 g / 2½ oz de mantequilla", "110g / 4oz de pan rallado blanco recién hecho", "2 cucharadas de crema doble, opcional", "pequeño racimo de berros"], "method": ["Para las verduras, precaliente el horno a 200C / 180C Fan / Gas 6.", "Coloque las verduras en una bandeja grande y profunda para asar. Rocíe con aceite y sazone con sal y pimienta. Mezcle para combinar. Asar durante una hora o hasta que quede crujiente por fuera y suave y en el medio.", "Para la perdiz, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una lata de asar con papel de aluminio.", "Coloque las hojas de salvia en el pecho de la perdiz y coloque un trozo de tocino encima. Ponga la lata preparada y tuesta durante 15-20 minutos.", "Para las migajas del juego, caliente la mantequilla en una sartén y una vez derretida agregue las migas de pan y cocine hasta que estén tostadas y doradas. Agrega el jerez. Cocine hasta que se evapore y termine con el perejil fresco. Ponga a un lado hasta que esté listo para servir.", "Para la salsa de pan, espolvoree la cebolla con los dientes y hierva a fuego lento en una sartén pequeña con la hoja de laurel, la leche, los granos de pimienta y la mantequilla durante 15-20 minutos. Cuele el líquido y vuelva a la sartén, agregue el pan rallado y sazone. Regrese al fuego y cocine a fuego lento por otros 10 minutos. Agregue la crema, si se usa, y manténgala caliente hasta que la sirva.", "Para servir, corte los senos de las perdices, o déjelos enteros, y sírvalos con las verduras, las migas de caza y la salsa de pan. Adorne con berros frescos."], "url": "www_bbc_co_uk_food_recipes_traditional_roast_36962", "title": "Perdiz asada tradicional, con migas de caza, salsa de pan y verduras asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4 oz de glaseado de pasta de azúcar blanca", "500g / 1lb 2oz de glaseado de pasta de azúcar amarilla", "pegamento comestible", "550 g / 1 libra de mantequilla 4 oz", "225g / 8oz de azúcar morena suave", "150 g / 5½ oz de azúcar en polvo", "12 huevos de gallinas camperas, ligeramente golpeados", "475g / 1lb 1 oz de harina común", "475g / 1lb 1 oz de almendras molidas", "2 cucharadas de cacao en polvo", "1 cucharadita de nuez moscada molida", "1 cucharadita de especias mixtas", "1 cucharadita de sal", "2 naranjas, solo cáscara", "2 limones, solo cáscara", "2 cucharaditas de esencia de vainilla", "475g / 1lb 1oz pasas de Corinto", "450 g / 1 libra de cerezas heladas", "Sultanas 350 g / 12oz", "225 g / 8 oz de arándanos secos", "450 g / 1 libra de albaricoques secos, picados", "Almendras enteras blanqueadas de 225g / 8oz, aproximadamente picadas (opcional)", "Brandy 350ml / 12fl oz", "225g / 8oz pasas de Corinto", "200g / 7oz de cerezas heladas", "175g / 6oz sultanas", "115g / 4oz de arándanos secos", "Albaricoques secos 225 g / 8 oz, picados", "115g / 4oz de almendras enteras blanqueadas, aproximadamente picadas (opcional)", "Brandy 175ml / 6fl oz", "250g / 9oz de mantequilla", "100g / 3½oz de azúcar morena suave", "150 g / 5½ oz de azúcar en polvo", "6 huevos de gallinas camperas, ligeramente golpeados", "Harina normal 225g / 8oz", "225gr / 8 oz de almendras molidas", "1 cucharada de cacao en polvo", "½ cucharadita de nuez moscada molida", "½ cucharadita de especias mixtas", "½ cucharadita de sal", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "1 cucharadita de esencia de vainilla", "115g / 4oz pasas de Corinto", "100g / 3½oz de cerezas heladas", "85g / 3oz sultanas", "60g / 2oz de arándanos secos", "Albaricoques secos 110 g / 4 oz, picados", "50g / 2oz de almendras enteras blanqueadas, aproximadamente picadas (opcional)", "Brandy 85ml / 3fl oz", "125 g / 4½ oz de mantequilla", "50g / 2oz de azúcar morena suave", "75g / 2¾oz de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "Harina común 115g / 4oz", "115gr / 4 oz de almendras molidas", "½ cucharada de cacao en polvo", "¼ cucharadita de nuez moscada molida", "¼ cucharadita de especias mixtas", "¼ cucharadita de sal", "½ naranja, solo ralladura", "½ limón, solo ralladura", "½ cucharadita de esencia de vainilla", "1 x 340 g / 12 oz de mermelada de albaricoque", "azúcar en polvo, para quitar el polvo", "Mazapán de 3.5kg / 7lb 11oz", "5.15kg / 11lb 6oz de glaseado blanco listo para enrollar"], "method": ["Para las flores de azúcar, amase la pasta de azúcar amarilla hasta que esté suave y flexible y estírela hasta que tenga 5 mm / ¼ de grosor. Presione la pasta de azúcar en los moldes de flores, luego retírela y déjela a un lado para que se seque. Repita con la pasta de azúcar blanca. (Las flores pueden prepararse con hasta un mes de anticipación y almacenarse en un recipiente hermético).", "Precaliente el horno a 150 ° C / 300 ° F / Gas 2. Engrase y cubra la lata redonda de 15 cm / 6 pulgadas, 23 cm / 9 pulgadas y 30 cm / 12 pulgadas.", "Coloque una tira ancha de papel marrón alrededor de la parte exterior de la lata de la torta y átela con una cuerda.", "Para el nivel de 30 cm / 12 pulgadas, bata la mantequilla y los azúcares hasta que estén suaves y esponjosos. (Esto toma alrededor de cinco minutos.) Agregue los huevos, poco a poco, hasta que estén bien combinados. Agregue los ingredientes secos, las especias, la ralladura, las frutas secas, las nueces (si se usan) y el brandy. Coloque la mezcla en la lata preparada y alise la parte superior con una espátula.", "Hornee en el horno durante cuatro horas y 10 minutos, o hasta que una brocheta insertada en el medio salga limpia.", "Repita los pasos 3 y 4 para el nivel de 23 cm / 9 pulgadas y hornee en el horno durante tres horas y 20 minutos, o hasta que un pincho insertado en el centro salga limpio.", "Repita los pasos 3 y 4 para el nivel de 15 cm / 6 pulgadas y hornee en el horno durante 1 hora y 45 minutos, o hasta que una brocheta insertada en el centro salga limpia.", "Cuando los pasteles estén cocidos, retírelos del horno y déjelos a un lado para que se enfríen durante 15 minutos. Retírelos de la lata y déjelos a un lado para que se enfríen completamente.", "Para helar los pasteles, caliente la mermelada de albaricoque en una cacerola, luego páselos por un colador.", "Nivele la parte superior de la tarta de fruta de 15 cm / 6 in cortando la parte superior con un cuchillo de sierra, pinte la parte superior con un poco de mermelada de albaricoque, y luego colóquela boca abajo sobre la tablita fina de 15 cm / 6 pulgadas. Con un trozo de cuerda, mida la parte superior y los lados de la torta de fruta (esto es para que enrolle el mazapán al tamaño correcto). Pintar el pastel de frutas con la mermelada de albaricoque.", "Polvore una superficie de trabajo con azúcar glas y enrolle 500 g / 1lb 2oz del mazapán hasta que sea lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (use la cuerda como guía). Con cuidado, levante el mazapán en la torta y alisarlo con las manos. Recorte cualquier exceso de mazapán, asegurándose de que el tablero de la torta también esté cubierto.", "Pinte el pastel con agua hervida y fría. Amasar 500 g / 1lb 2 oz de glaseado blanco hasta que esté suave y flexible y extenderlo hasta que tenga 5 mm / ¼ de grosor y lo suficientemente grande como para cubrir la parte superior y los lados de la torta de fruta (utilice la cuerda como guía). Con cuidado, levante la guinda del pastel y aliméntelo con sus manos. Recorte cualquier exceso de formación de hielo.", "Repita los pasos 10, 11 y 12 para el pastel de 23 cm / 9 en 1 kg / 2 lb 4 oz cada uno de mazapán y glaseado.", "Repita los pasos 10, 11 y 12 para la torta de 30 cm / 12 in usando 2 kg / 4 lb 8 oz cada uno de mazapán y glaseado. Deje los pasteles durante la noche para que la formación de hielo se seque (no guarde los pasteles en el refrigerador).", "Una vez que el glaseado se haya secado, aplique una fina línea de pegamento comestible alrededor del borde inferior de cada pastel y pegue cuidadosamente una cinta alrededor de la torta, asegurando la unión con un poco de pegamento adicional.", "Para insertar las varillas de sujeción, sostenga una varilla de sujeción al costado de la torta de 23cm / 9 pulgadas y marque con un lápiz donde se encuentra la guinda. Corta la varilla y otros tres con la misma longitud. Empuje las varillas en la torta a unos 5 cm / 2 pulgadas de distancia de los lados, para formar las cuatro esquinas de un cuadrado en el centro de la torta. Mida, corte e inserte las barras de la misma manera para la torta de 30cm / 12in.", "Para cubrir la tarta gruesa de 38cm / 15in, amase 750g / 1lb 10oz de la formación de hielo hasta que esté suave y flexible y estírela hasta que tenga 5mm / ¼ de grosor y sea lo suficientemente grande para cubrir la tarta. Extienda un poco de pegamento sobre el tablero, luego levante con cuidado el glaseado sobre el tablero de la torta, alisándolo hasta que quede plano. Recorta los bordes. Aplique una fina línea de pegamento alrededor del borde de la tarta y cuidadosamente pegue la cinta alrededor de la torta, atándola con un lazo en la parte delantera.", "Si transporta los pasteles a un lugar, es mejor transportarlos por separado y armar el pastel en el lugar. Para armar las tortas, primero pegue la tarta de 30cm / 12in en la tarta de pastel de 38cm / 15in cubierta de glaseado: agregue un poco de pegamento en el medio de la tarta de 35cm / 14in, luego coloque la tarta de 30cm / 12in en el medio. Coloque cuatro de los pilares en la parte superior de la torta más grande, colocando cada uno sobre una varilla de sujeción. Cubra con la torta de 23cm / 9 pulgadas, luego coloque los cuatro pilares restantes en la parte superior y termine con la torta de 15cm / 6 pulgadas. Usando el pegamento comestible, coloque las flores de azúcar en la parte superior de la torta y alrededor del lado de la torta de 23 cm / 9 pulgadas y 30 cm / 12 pulgadas."], "url": "www_bbc_co_uk_food_recipes_traditional_spring_67057", "title": "Pastel de bodas tradicional de primavera", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/traditional_spring_67057_16x9.jpg", "isVegetarian": true, "recommendations": 0}]