[{"ingredients": ["125g / 4½oz de pan rallado fresco", "½ cucharadita de pimienta de cayena", "Suela de lenguado o limón de 450 g / 1 lb, pelada", "aceite de girasol, para freír", "Harina normal de 50g / 2oz", "3 huevos de gallinas camperas, golpeados", "2 limones, cortados en cuñas", "Mayonesa 100 g / 4 oz", "2 cucharadas de alcaparras picadas", "4 pepinillos picados", "1 cucharada de perejil de flatleaf", "sal y pimienta negra recién molida", "1 limón, solo jugo", "4 cucharadas de aceite de oliva", "1 bolsa de hojas de ensalada mixtas"], "method": ["Mezcle las migas de pan con la pimienta de cayena y déjela a un lado.", "Corte cada suela de limón o lenguado en tiras en diagonal de aproximadamente 1 cm / ½ pulgada de grosor.", "Caliente el aceite en una freidora a 190C / 375F.", "Cubra el pescado en harina, luego el huevo batido y finalmente las migas; algunas piezas a la vez, asegurándose de que todo el pescado esté bien colado.", "Coloque algunos de los goujons en la freidora a la vez y cocine durante aproximadamente un minuto, hasta que estén crujientes y dorados. Repita hasta que todos los goujons estén cocidos.", "Una vez cocinado, remueve sobre papel de cocina para absorber el exceso de aceite.", "Para la salsa tártara mezcle la mayonesa, las alcaparras, los pepinillos y el perejil y la temporada.", "Para hacer el aderezo para ensaladas mezcle el jugo de limón y el aceite de oliva. Viste las hojas de ensalada mixta con él.", "Amontonar los goujons en un plato o en platos, y servir con las rodajas de limón, salsa tártara y ensalada."], "url": "www_bbc_co_uk_food_recipes_goujonsofsolewithlem_83893", "title": "Goujons de lenguado con limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla blanca dulce grande, cortada en anillos de 1 cm / ½ en", "1 litro / 1¾ pintas de suero de leche", "Harina normal 175g / 6oz, tamizada", "50g / 2oz de polenta", "1½ cucharada de sal marina", "pimienta negra recién molida", "1 cucharada de chile en polvo", "aceite vegetal, para freír", "vinagre balsámico, para servir", "600 g / 1 libra de carne picada de 5 oz", "sal y pimienta negra recién molida", "50ml / 2fl oz de aceite de oliva", "4 x bollos focaccia cebolla, en rodajas, a la parrilla hasta que esté ligeramente carbonizado", "mayonesa lista para usar, al gusto", "1 tomate grande de ternera, en rodajas", "2 pepinillos grandes, en rodajas", "puñado de cohetes hojas"], "method": ["Para los aros de cebolla, caliente el aceite vegetal en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque los anillos separados de cebolla en rodajas en un tazón grande con el suero de leche para remojar durante 30 minutos, revolviendo ocasionalmente.", "Coloque la harina, la polenta, la sal, la pimienta negra recién molida y el chile en polvo en un tazón limpio y mezcle bien. Transfiera la mezcla a un plato grande.", "Tome anillos de cebolla individuales del suero de leche, asegurándose de que haya un montón de suero de leche pegado a la cebolla.", "Separe cada anillo de la mezcla de harina y polenta y déjelo a un lado, teniendo cuidado de no sacudir el exceso de harina y la capa de polenta.", "Con cuidado, agregue los anillos recubiertos al aceite caliente en lotes de seis y fría, revolviendo ocasionalmente, durante 3-4 minutos, o hasta que estén crujientes y dorados. (Los anillos pueden hundirse al principio al principio, pero luego flotarán hacia la parte superior mientras se cocinan).", "Retire con cuidado los anillos con una espumadera y escurra sobre papel de cocina. Repita el proceso de freír hasta que todos los aros de cebolla estén cocidos.", "Para la hamburguesa, coloque la carne picada en un recipiente y sazone bien con sal y pimienta negra recién molida.", "Divida la carne picada en cuatro y moldee cada pieza en forma de patty.", "Cepille cada empanada con el aceite de oliva y coloque en una sartén caliente. Cocine por cuatro minutos en cada lado, o hasta que esté completamente cocido.", "Coloque una hamburguesa dentro de cada bollo de focaccia. Cuchara sobre mayonesa, al gusto y decorar con lechuga, tomate y pepinillos.", "Para servir, coloca los aros de cebolla en un tazón grande y espolvorea con sal. Coloque un tazón pequeño de vinagre balsámico al lado para sumergir en.", "Coloque las hamburguesas y los bollos en los platos y sirva con los aros de cebolla."], "url": "www_bbc_co_uk_food_recipes_gourmetburgerandunbe_86229", "title": "Hamburguesa gourmet e increíbles aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 lb 5 oz Patatas King Edward o Maris Piper", "1 ramita de romero", "1 ramita de tomillo", "5-6 dientes de ajo, tostados", "1 hoja de laurel", "½ cucharada de granos de pimienta negros enteros", "6 cucharadas de grasa de ganso", "sal marina"], "method": ["Pelar y cortar a la mitad las papas (un cuarto de las grandes, todas las piezas deben ser del mismo tamaño). Coloque las papas en una olla grande junto con el romero, el ajo, el laurel y los granos de pimienta. Cubra con agua fría y lleve a ebullición. Reduzca el fuego ligeramente y cocine a fuego lento durante 5-7 minutos.", "Escurra las papas y déjelas en el colador hasta que se sequen al vapor durante 5-10 minutos.", "Mientras tanto precalentar el horno a 220C / 425F / Gas 7. Ponga la grasa de ganso en una lata grande para asar y ponga en el horno por 3-5 minutos, o hasta que esté muy caliente.", "Con cuidado, incline las papas (así como los compuestos aromáticos con los que fueron cocidas) en la grasa de ganso caliente, agite suavemente para moverse y asóquelas durante 35-40 minutos, volteándolas una o dos veces.", "Después de 20 minutos en el horno, quite y aplane suavemente las papas un poco para crear más área de superficie para que queden más crujientes. Regrese al horno y cocine por otros 15-20 minutos, o hasta que estén crujientes y doradas.", "Deseche los aromáticos y sazone las papas con sal. Servir."], "url": "www_bbc_co_uk_food_recipes_goose_fat_roast_potatoes_24965", "title": "Cómo asar patatas en grasa de oca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goose_fat_roast_potatoes_24965_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, ablandada, más extra para engrasar", "200 g / 7 oz de azúcar morena clara", "½ vaina de vainilla, semillas raspadas o 2 gotas de extracto de vainilla", "4 huevos de gallinas camperas, ligeramente golpeados", "Harina de auto crianza de 200g / 7oz", "200g / 7oz de azúcar granulada", "200ml / 7oz de agua", "Mantequilla 400g / 14oz, ablandada", "½ vaina de vainilla, semillas raspadas o 2 gotas de extracto de vainilla", "800g / 1lb 12oz de azúcar glas", "250g / 9 oz de azúcar granulada", "130 ml / 4½ fl oz de jarabe dorado o glucosa líquida", "125ml / 4fl oz de agua", "algunas gotas colorante de alimentos", "algunas gotas de extracto de vainilla"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos moldes para pasteles de 20 cm / 8 in.", "Bata la mantequilla y el azúcar en un tazón hasta que estén suaves y esponjosos. Agregue la vainilla y un poco de huevo batido y bata hasta que estén bien combinados. Agregue la mitad de los huevos restantes y dos cucharadas de harina y mezcle hasta que estén bien combinados. A continuación, agregue los huevos restantes, otras dos cucharadas de harina y mezcle hasta que estén bien combinados. Agregue el resto de la harina y mezcle hasta que esté bien combinado.", "Divida la mezcla entre las dos latas, alise la mezcla y hornee en el horno durante 25-30 minutos, o hasta que un pincho insertado en el centro de uno de los pasteles salga limpio.", "Mientras tanto, para el jarabe de azúcar, caliente el azúcar y el agua en una cacerola pequeña a fuego medio bajo hasta que el azúcar se disuelva. Aumente el fuego y deje hervir la mezcla durante dos minutos. Retire la sartén del fuego y reserve.", "Retire las tortas del horno y cepille las partes superiores generosamente con jarabe de azúcar. Una vez frío, coloque las esponjas en el congelador durante 20 minutos. (Esto los hará más fáciles de congelar).", "Para la crema de mantequilla, coloca la mantequilla y la vainilla en un tazón grande y bate bien con una cuchara de madera hasta que quede suave y cremosa. Agregue el azúcar glas gradualmente, y bata hasta que esté bien combinado.", "Ponga un poco de buttercream en el medio del tarta. Coloque uno de los pasteles en la parte superior. Extienda la torta con crema de mantequilla y coloque la esponja restante en la parte superior.", "Extienda la crema de mantequilla en la parte superior y lateral del pastel. (Extiéndalo bastante liberalmente al principio, luego alise los bordes y sobre la parte superior, eliminando cualquier exceso, para dar una primera capa limpia). Enfríe la torta en el refrigerador durante 1-2 horas, o hasta que esté firme. Retire la torta de la nevera y extender sobre otra capa de crema de mantequilla.", "Para el graffiti, caliente el azúcar, el jarabe dorado (o glucosa líquida) y el agua en una cacerola de base pesada a fuego medio. Agita la sartén suavemente. Una vez que el azúcar se haya disuelto, aumenta el fuego y lleva la mezcla a ebullición. Si hay algo de azúcar pegado al costado de la sartén, cepíllelo con un cepillo de pastelería húmedo. Cocine el caramelo por 10-15 minutos o hasta que alcance 150C / 300F (la etapa de 'crack duro'). Retire la sartén del fuego.", "Para comprobar si el caramelo está listo: retire una pequeña porción de la mezcla de azúcar con una cucharadita y colóquelo en una taza de agua fría. Déjalo allí por un minuto más o menos para que se enfríe. Sienta la mezcla de azúcar en el extremo de la cuchara: debe ser dura y formar hilos duros y quebradizos que se rompen al doblarse.", "Agregue el colorante y el saborizante y agite suavemente la sartén hasta que esté bien combinada. Vierta el caramelo en una jarra resistente al calor. (PRECAUCIÓN: el caramelo estará extremadamente caliente en este punto) y déjelo a un lado para que se enfríe un poco durante 1-2 minutos.", "Coloque una pieza ancha de 65cm / 25in de papel antigrasa en la superficie de trabajo en el sentido de las agujas del reloj. Rocíe círculos superpuestos del caramelo a todo lo ancho del papel (deben tener la misma altura en el pastel). Repita el proceso para que tenga una banda gruesa de caramelo.", "Retire la torta de la nevera. Cuando el \"graffiti\" sea firme pero aún flexible, quite con cuidado la parte posterior del papel resistente a la grasa y péguelo alrededor de la torta. Cortar cualquier exceso con tijeras."], "url": "www_bbc_co_uk_food_recipes_graffiti_cake_96777", "title": "Pastel de graffiti", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["235 g / 8½ oz de harina de auto crianza", "255 g / 9 oz de azúcar en polvo", "20 g / oz de cacao en polvo", "1½ cucharadita de polvo de hornear", "4½ huevos medianos de granja, golpeados", "255g / 9oz de margarina para hornear", "2 cucharadas de leche semidesnatada", "225 g / 8 oz de azúcar en polvo", "225 g / 8oz de leche evaporada", "240g / 8¾oz de chocolate puro, finamente picado", "115g / 4oz de mantequilla salada", "Frambuesas 75g / 2½ oz", "30g / 1oz de avellanas picadas rostizadas", "50g / 1¾oz de chocolate negro", "50g / 1¾oz de chocolate blanco"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase y forre tres latas de emparedado de 18cm / 7in con papel de hornear.", "Para la torta, tamice la harina, el azúcar, el cacao en polvo y el polvo de hornear en un tazón grande. Agregue los huevos y la margarina y bata a alta velocidad durante 10 segundos con una batidora eléctrica. Raspe los lados para asegurarse de que todo esté incorporado. Agregue la leche y mezcle durante otros 10 segundos a fuego alto hasta que estén bien combinados.", "Divida la mezcla de manera uniforme entre las tres latas de sándwich y hornee en el estante del medio del horno durante 15-20 minutos o hasta que el contacto sea elástico y comience a alejarse de los bordes de las latas. Retirar de las latas y colocar en una rejilla para enfriar.", "Para la formación de hielo, agregue el azúcar y la leche evaporada a una olla grande a fuego medio. Revuelva hasta que comience a hervir a fuego lento, luego deje de remover y deje que burbujee durante 6 minutos. Retirar del fuego y reservar para enfriar un poco. Agregue el chocolate y la mantequilla a la mezcla tibia y revuelva hasta que se derrita e incorpore. Enfriar hasta que alcance una consistencia extensible. Transfiera la formación de hielo a una manga pastelera grande equipada con una gran boquilla estrella cerrada.", "Para decorar, apile las tres capas de pastel con 3-4 anillos entubados de glaseado entre cada capa. Cubra la parte superior con pequeños remolinos de glaseado, luego agregue las frambuesas y espolvoree las avellanas picadas rostizadas sobre el pastel.", "En dos cuencos separados, derrita tres cuartas partes del chocolate blanco y chocolate negro. Una vez derretido y enfriado un poco, agregue el cuarto restante de cada chocolate y revuelva hasta que se combinen. Cuando el chocolate derretido se vuelva pegajoso, extienda el chocolate negro en una capa delgada sobre un pedazo grande de papel antiadherente, acetato o una estera de silicona. Rocíe líneas del chocolate blanco en la oscuridad. Déjalo fraguar por completo y luego córtalo en fragmentos. Usa los fragmentos para decorar la parte superior del pastel."], "url": "www_bbc_co_uk_food_recipes_grandmas_chocolate_cake_60838", "title": "Pastel de chocolate de la abuela", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 torta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grandmas_chocolate_cake_60838_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 rebanadas de tocino seco curado", "50g / 1¾oz de mantequilla salada, ablandada", "1 tomate, cortado en cuartos", "2 rebanadas de pan blanco espeso y fresco"], "method": ["Pon el tocino en una sartén fría, luego sube la temperatura y cocina por unos minutos antes de agregar un poco de mantequilla y los tomates descuartizados.", "Cocine hasta que el tocino esté dorado en los bordes y cocido y los tomates se ablanden, aproximadamente 5-6 minutos.", "Unte el pan con la mantequilla ablandada y coloque los tomates en una rebanada del pan y presione ligeramente hacia abajo, luego agregue el tocino y cubra con la segunda rebanada de pan.", "Presiona ligeramente hacia abajo para aplastarlo todo, luego córtalo por la mitad y come, limpiando la mantequilla derramada y los jugos con el sándwich sobre la marcha."], "url": "www_bbc_co_uk_food_recipes_grannys_bacon_sarnie_55935", "title": "Sarnie de tocino de la abuela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de auto aumento de 450g / 1lb", "125g / 4oz de azúcar en polvo", "1 cucharadita de polvo de hornear", "1 cucharadita de especias mixtas", "pizca de sal", "125g / 4oz de mantequilla sin sal", "450g / 1lb de fruta y cáscara mezcladas", "1 cucharadita de bicarbonato de soda", "Leche 250ml / 9fl oz"], "method": ["Precaliente el horno a gas 150C / 300F / Gas 2. Engrase y forre una lata de pan de 1,4 kg / 3 lb.", "En un recipiente, tamice la harina, el azúcar, el polvo de hornear, la mezcla de especias y la sal.", "Frota la mantequilla y luego dobla la fruta mezclada.", "Revuelva el bicarbonato de soda en la leche y luego agregue a la mezcla y revuelva hasta que esté bien combinado.", "Coloque la mezcla en la lata de pan y colóquela en el horno durante 1 hora y 45 minutos. Vigila el pastel y cúbrelo con una hoja de papel de aluminio si está demasiado oscuro.", "Dejar enfriar un poco y luego salir. Servir en rodajas con mucha mantequilla."], "url": "www_bbc_co_uk_food_recipes_grannys_cake_88424", "title": "Pastel de la abuela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grannys_cake_88424_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "8 huevos de gallinas camperas", "1 cucharada de mostaza integral", "570ml / 1 litro de leche", "pizca de sal", "75 g / 2¾oz de goteo de carne (o manteca de cerdo)", "6 salchichas de buena calidad", "2 cebollas, finamente cortadas", "1-2 cucharadas de extracto de levadura", "75ml / 2½fl oz de vino tinto", "1 cucharada de gránulos de salsa", "200ml / 7fl oz de caldo de carne", "guisantes con mantequilla, para servir", "botón de mantequilla", "sal y pimienta negra recién molida"], "method": ["Coloque la harina en un bol y haga un pozo en el centro.", "Agregue los huevos y la mostaza y continúe batiendo hasta que quede suave, agregue gradualmente la leche y la sal y mezcle con una batidora suave.", "Coloque en el refrigerador durante al menos cuatro horas, pero preferiblemente durante la noche.", "Precalentar el horno a 220C / 425F / Gas 7.", "Coloque tres cuartas partes de la carne goteando en una lata de asar y caliente en el horno.", "Caliente una sartén hasta que esté caliente, luego agregue el resto del goteo. Cuando esté derretido, agregue las salchichas y fría en cada lado hasta que se dore.", "Retire la mezcla de la nevera y mezcle una vez más.", "Coloque las salchichas en la lata de asar y vierta sobre la mezcla.", "Coloque en el horno durante 30 minutos, luego abra brevemente la puerta del horno para permitir que salga el vapor y cocine por otros 10 minutos.", "Haga la salsa con la misma sartén en la que se cocinaron las salchichas.", "Coloque la sartén a fuego alto, luego agregue la cebolla y fría por 10 minutos, o hasta que se suavice y se dore.", "Agregue el extracto de levadura y cocine por un minuto, luego agregue el vino tinto y cocine hasta que el volumen del líquido se haya reducido a la mitad.", "Batir los gránulos de salsa con un poco de agua hasta que quede suave, luego agregar 250 ml / 9 fl oz de agua y batir una vez más. Agregue a la sartén y cocine durante unos minutos, luego agregue el caldo de carne y cocine a fuego lento durante cinco minutos. Agregue un poco de mantequilla y sazone, al gusto, con sal y pimienta.", "Retire el sapo del agujero del horno y déjelo a un lado durante unos minutos.", "Sirva una cucharada grande de sapo con un cucharón de salsa y algunos guisantes con mantequilla."], "url": "www_bbc_co_uk_food_recipes_grannys_toad_in_the_hole_98879", "title": "El sapo de la abuela en el hoyo con la salsa de cebolla de mi madre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "65g / 2⅓oz de azúcar glas", "½ cucharadita de sal", "3 cucharaditas de jengibre molido", "½ cucharadita de canela molida", "125 g / 4½ oz de mantequilla, refrigerada y en cubos", "2 yemas de huevo grandes de gallinas camperas", "1 huevo pequeño de granja, golpeado", "2 pomelo rosado, jugo y ralladura solamente", "3 pomelo blanco, jugo y ralladura", "1 pomelo rojo, jugo y ralladura", "70 g / 2½ oz de raíz de jengibre fresco, pelado y en rodajas", "5 yemas de huevo grandes de gallinas camperas", "3 huevos grandes de gallinas camperas", "60g / 2¼ oz de azúcar en polvo", "2 cucharadas de harina de maíz", "pizca de sal", "70 g / 2½ oz de mantequilla sin sal, en cubos", "300 g / 10½ oz de azúcar en polvo", "2 cucharaditas de jugo de limón", "140 g / 5 oz de claras de huevo, a temperatura ambiente"], "method": ["Para la masa, tamice la harina, el azúcar, la sal, el jengibre y la canela en un tazón grande. Agregue la mantequilla y, trabajando rápidamente, frote la mezcla entre los dedos pulgar e índice hasta que la mezcla se asemeje a pan rallado grueso.", "Agregue las yemas y 3 cucharadas de agua. Usando sus manos, mezcle para formar una masa.", "Dale vuelta a una superficie de trabajo ligeramente enharinada. Suave y rápidamente amasar la masa hasta que se suavice. Aplana la masa en un disco y envuélvela en una película adhesiva. Refrigere por 30 minutos o congele por 10 minutos.", "Una vez que la masa se haya enfriado, extiéndala finamente sobre una superficie ligeramente enharinada. Levante la masa en la tarta de estaño y presione en los bordes. Deje cualquier exceso que sobresalga por los lados de la lata de tarta. Pinchar la base con un tenedor y alinear con papel de hornear. Rellene con frijoles para hornear o arroz sin cocer y vuelva a enfriar durante 10 minutos.", "Precalentar el horno a 180 ° C / 170 ° Ventilador / Gas 4.", "Para el relleno, agregue el jugo y la ralladura de los pomelos a una cacerola grande. Agregue el jengibre y deje que hierva. Cocine a fuego lento durante 10 minutos, luego colar para eliminar el jengibre y dejar el jugo a un lado para que se enfríe.", "En un recipiente separado a prueba de calor, agregue las yemas, los huevos, el azúcar, la harina de maíz y la sal. Batir para combinar y luego colocar el recipiente sobre una fuente de agua hirviendo a fuego lento (no permita que el agua toque el recipiente). Vierta el jugo de pomelo y bata la mezcla durante unos 15 minutos o hasta que empiece a espesarse. Agregue la mantequilla pieza por pieza, batiendo todo el tiempo durante unos 15 minutos, o hasta que la mezcla esté muy espesa. (Si la mezcla tarda demasiado en espesar, transfiera la mezcla a una sartén y caliéntela suavemente hasta que espese). Coloque una película adhesiva sobre la superficie de la cuajada para evitar que se forme y separe la piel.", "Retire la masa de la nevera, coloque la lata en una bandeja para hornear y hornee durante 15 minutos. Retire los frijoles para hornear y el papel resistente a las grasas. Cepille bien la base con huevo batido y hornee durante otros 7-10 minutos, o hasta que la masa esté seca y dorada pálida. Poner a un lado para enfriar en la lata, luego con un cuchillo afilado cortar el borde sobresaliente.", "Para el merengue italiano, agregue el azúcar y 180ml / 6¼fl oz de agua en una cacerola mediana y deje que hierva.", "Mientras se calienta el azúcar y el agua, use una toalla de papel para frotar el interior de la taza de una batidora independiente con el jugo de limón (esto eliminará cualquier rastro de grasa que pueda hacer que los merengues fallen). Agregue las claras de huevo al tazón y bata a velocidad media hasta que se formen picos rígidos cuando se quite el batidor.", "Una vez que el jarabe de azúcar ha alcanzado 113C en un termómetro de azúcar, retírelo del fuego. Con el motor funcionando en la mezcladora, vierta el jarabe lentamente por el costado de la taza. Una vez que se ha agregado el almíbar, aumente la velocidad a alta velocidad y bata durante aproximadamente 7-9 minutos, o hasta que el recipiente esté frío al tacto y el merengue tenga picos rígidos.", "Para ensamblar la tarta, retire la película adhesiva de la cuajada y vuelva a calentar suavemente, si es necesario. Una vez que la cuajada está caliente, vierta en la caja de pastelería y alise la superficie.", "Coloque el merengue en una bolsa grande con una boquilla de estrella abierta. Pipe el merengue en remolinos en la parte superior de la cuajada y luego termine dorando el merengue con un soplete de chef.", "Sirva mientras el relleno aún esté caliente."], "url": "www_bbc_co_uk_food_recipes_grapefruit_and_ginger_59169", "title": "Pastel de merengue de pomelo y jengibre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 1 pie de 23cm / 9 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grapefruit_and_ginger_59169_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pomelo, cáscara y zumo no encerados", "1 huevo de gallinas camperas más 1 yema de huevo", "100g / 3½ oz de azúcar", "pizca de sal", "1 cucharada colmada de harina de maíz", "50 g / 1¾oz de mantequilla suave, en cubos", "75g / 2¾oz de mantequilla, muy suave pero no derretida", "Azúcar 75g / 2¾oz", "una generosa pizca de sal", "½ limón sin cebar, solo cáscara", "2 yemas de huevo", "Harina normal de 100 g / 3½ oz", "2 cucharaditas de polvo de hornear", "100g / 3½ oz de azúcar", "2 claras de huevo (aproximadamente 60 g / 2¼ oz)", "pizca de sal", "½ cucharadita de pimienta"], "method": ["Para hacer que la toronja cuaje, mida 90ml / 6 cucharadas de jugo de toronja en una sartén y mezcle con la ralladura, el azúcar, la sal y los huevos a fuego suave. Tamice la harina de maíz y continúe batiendo. No deje de batir en cualquier punto, de lo contrario los huevos se cuajarán.", "Una vez que la cuajada es tan gruesa como los tomates en puré y ha lanzado una o dos burbujas, sáquela del fuego y bata la mantequilla en un cubo por vez. Vierta en un recipiente y cubra con film transparente, colocándolo en contacto directo con la cuajada para evitar que se forme la piel. Refrigere durante al menos una hora (mejor durante la noche).", "Para hacer la base de galleta, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y mantequilla seis anillos de postre de metal de 8 x 5 cm / 3 x 2.", "Batir la mantequilla y el azúcar con la sal y la ralladura de limón hasta obtener un color esponjoso y pálido. Agregue las yemas de huevo y continúe latiendo.", "Tamizar la harina y el polvo de hornear juntos, agregar a la mezcla de crema y continuar batiendo hasta que la masa se una como una pasta suave.", "Coloque la masa en una manga pastelera equipada con una boquilla redonda de 1 cm.", "Pase la masa dentro de los anillos en espiral desde el exterior hacia el centro hasta que la base esté completamente cubierta por una capa de 3-4 mm, luego coloque un anillo alrededor del borde para crear un pequeño baño para que la cuajada se asiente. Hornee para 12-15 minutos o hasta que esté dorado (pero no demasiado oscuro).", "Retire la base de galletas del horno y deje que se enfríe durante unos minutos antes de pasar un pequeño cuchillo filoso por el interior de cada anillo para soltar la galleta. Transfiera los bizcochos a una rejilla de alambre (tenga cuidado ya que son frágiles) y déjelos enfriar.", "Para hacer el merengue, ponga el azúcar en una sartén con 40 ml / 1 onza de agua y colóquelo a fuego alto. Lleve a la etapa de bola blanda (118C en un termómetro de azúcar) que tomará aproximadamente 10 minutos. Para probar sin un termómetro, vierta un poquito de jarabe de azúcar en un recipiente con agua muy fría. Cuando se forma una pelota suave y pegajosa, está lista.", "Mientras espera el jarabe de azúcar, comience batiendo las claras de huevo con la sal en un recipiente limpio de vidrio o metal. Batir hasta que se forme una ligera espuma, deteniéndose antes de que se formen los picos suaves. Una vez que el jarabe de azúcar ha alcanzado la etapa de bola blanda, bata las claras de huevo al mismo tiempo que vierte el jarabe sobre ellas en una corriente delgada. (No vierta el jarabe sobre la batidora, sino hacia un lado del bol). Agregue la pimienta y continúe batiendo durante 10 minutos o hasta que las claras de huevo estén brillantes y firmes.", "Para ensamblar, coloque una cucharada generosa de la cuajada de pomelo en la parte superior de los bizcochos, seguido por el merengue. O coloque debajo de una parrilla muy caliente por un par de minutos o use un soplete para dorar."], "url": "www_bbc_co_uk_food_recipes_grapefruit_and_pepper_36188", "title": "Tartaletas de merengue de pomelo y pimienta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 3oz de mantequilla sin sal", "Azúcar 80 g / 3 oz", "3 huevos grandes de gallinas camperas", "125ml / 4fl oz de jugo de toronja (alrededor de 2½ pomelos)", "1 pomelo, solo ralladura", "1 pomelo", "75 g / 2½ oz de azúcar en polvo, más extra para el recubrimiento", "200 g / 7 oz de azúcar en polvo", "200 g / 7 oz de extensión para hornear", "210g / 7½ oz de harina de auto crianza", "4 huevos grandes de gallinas camperas", "25 g / 1 oz de almendras molidas", "1 pomelo, ralladura de ralladura y la mitad del jugo", "75ml / 2½fl oz de jugo de toronja (alrededor de 1½ pomelos)", "75 g / 2½ oz de azúcar en polvo", "100g / 3½ oz de mascarpone", "200g / 7oz de crema doble", "50g / 1¾oz de azúcar glas, tamizado"], "method": ["Para la cuajada de pomelo, coloque un recipiente a prueba de calor sobre una olla de agua hirviendo a fuego lento. Derrita la mantequilla en el recipiente antes de agregar todos los demás ingredientes y bata con una batidora eléctrica eléctrica hasta que se espese. Retire del fuego y enfríe a temperatura ambiente antes de colocarlo en la nevera para establecer más. (Harás más cuajada de pomelo de la que necesitas para el pastel. Refrigera el resto y come dentro de una semana).", "Para la cáscara de pomelo confitada, pele la toronja y corte la cáscara al largo y ancho deseados. Coloque en una cacerola pequeña, cúbralo con agua y llévelo a ebullición. Hierva por 10-15 segundos y luego drene la cáscara. Regrese la cáscara a la misma cacerola y agregue el azúcar con 75ml / 2½fl oz de agua. Llevar a ebullición y cocinar por 8-10 minutos, o hasta que el líquido esté almibarado. Escurra la cáscara y la capa con más azúcar en polvo antes de dejar que se enfríe y seque en una rejilla de alambre.", "Precalentar el horno a 180 ° C / 160 ° C (ventilador) / Gas 4. Engrasar y alinear 2 latas de sandwich de 20 x 20 cm.", "Para el pastel, mezcle todos los ingredientes en una batidora eléctrica. Divida la mezcla por igual entre las dos latas y hornee en el estante del medio del horno durante 25-30 minutos. Permita que se enfríe en las latas por cinco minutos, luego déjelo en una rejilla.", "Mientras tanto, para el jarabe de azúcar de toronja, coloque el jugo de toronja y el azúcar en una olla pequeña y deje que hierva. Hierva por unos cinco minutos, o hasta que el jarabe comience a espesarse. Retirar del fuego y enfriar un poco.", "Mientras los pasteles todavía estén calientes, perfora la superficie con un palito de cóctel por todas partes. Rocíe el almíbar uniformemente sobre ambos pasteles. Deje que se enfríe completamente.", "Para la crema de mascarpone, mezcle los ingredientes hasta que estén gruesos y aireados, pero no demasiado rígidos.", "Para decorar la torta, coloque la capa inferior de la torta en un plato de servir.", "Transfiera una cuarta parte de la crema de mascarpone en una manga pastelera con una boquilla plana de 1 cm / ½ pulgada, y déjela a un lado. Luego extiende la mitad de la crema de mascarpone restante sobre el pastel. Ponga una cucharada sobre una cantidad generosa de la cuajada de pomelo, algo de cuajada se puede derramar sobre los bordes, pero no se preocupe por esto.", "Coloca la otra torta encima y extiende la crema restante encima de la torta, alisándola para que esté uniformemente distribuida.", "Usando la manga pastelera, coloque bolas de glaseado alrededor de los bordes y en el centro de la torta. Coloque unas tiras de la cáscara confitada en cada bola de glaseado. Sirva de inmediato, o refrigere hasta que esté listo para ser devorado."], "url": "www_bbc_co_uk_food_recipes_grapefruit_sandwich_cake_53862", "title": "Pastel de sándwich de pomelo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["180-200g / 6½-7oz de uvas maduras", "2 cucharadas de flor de saúco cordial", "8 cubitos de hielo, más extra para servir", "150ml / 5fl oz de vino blanco", "4 hojas de menta", "salpicar agua con gas, para servir"], "method": ["Mezcle todos los ingredientes excepto el agua con gas en un procesador de alimentos hasta que esté suave y bien combinado.", "Para servir, medio llenar dos vasos altos con cubitos de hielo. Vierta sobre la mezcla de uva. Rellene cada vaso con el agua con gas."], "url": "www_bbc_co_uk_food_recipes_grapespritzer_92194", "title": "Salpicaduras de uva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cebollas rojas, cortadas en cuartos y luego cortadas longitudinalmente de nuevo", "1 berenjena grande (la variedad púrpura italiana es la mejor), más o menos picada", "2 pimientos amarillos, sin semillas y picados", "2 pimientos rojos, sin semillas y picados", "3 calabacines, más o menos picados", "1 bombilla de hinojo pequeña, picada", "275ml / ½ pinta de aceite de oliva", "1 diente de ajo, pelado y más o menos picado", "pimienta negra y sal marina molida gruesa", "600g / 1lb 5oz pequeñas patatas nuevas", "450g / 1lb bebé vid tomates", "25 g / 1 oz de albahaca, picada o desgarrada", "Frijoles rojos de hojalata de 400g / 14oz, enjuagados y escurridos", "Queso cheddar maduro 200 g / 7 oz, rallado"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "En un tazón grande, mezcle las cebollas, la berenjena, los pimientos, los calabacines y el hinojo. Vierta sobre el aceite de oliva, agregue el ajo y mezcle bien con las manos.", "Transfiera las verduras a una lata de asar. Untar uniformemente y sazonar al gusto con sal y pimienta.", "Llena una sartén grande con agua hirviendo con sal. Agregue las papas nuevas y cocine hasta que estén tiernas. Escurra las papas y agréguelas a las verduras mixtas.", "Coloque en el horno caliente y una vez que las verduras hayan comenzado a colorear, agregue los tomates, la albahaca y los frijoles. Mezcle bien y vuelva al horno por otros 20 minutos, o hasta que las verduras estén coloreadas, pero aún tengan una textura razonablemente crujiente.", "Pruebe y agregue más sal y pimienta, si lo desea. Sirva caliente o frío con queso rallado esparcido."], "url": "www_bbc_co_uk_food_recipes_gratin_of_roasted_11753", "title": "Gratén de vegetales mediterráneos tostados con queso cheddar maduro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "2 chalotes, pelados, finamente picados", "12 vieiras zambullidas a mano, en sus conchas, cortadas a la mitad para crear dos escalopas más finas (huevas y adornos reservados, mitades redondeadas de conchas lavadas y reservadas)", "200ml / 7fl oz de vino blanco", "300ml / 10½fl oz de caldo de pescado", "Crema doble 225ml / 8fl oz", "2 cucharaditas de mostaza Dijon", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "1 zanahoria grande, pelada, en juliana", "1 gran calabacín, en juliana", "2 x 750 g / 1 libra de langostas cocidas de 10½oz, sin cáscara, carne picada", "25g / 1oz de pan rallado fresco", "Gruyère 25g / 1oz, finamente rallado"], "method": ["Precalentar la parrilla a fuego medio.", "Calienta la mitad de la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los chalotes picados y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue las huevas de vieiras y los aderezos y el vino, y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego continúe cocinando a fuego lento hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo de pescado y devuelva la mezcla a ebullición. Regrese la mezcla a fuego lento y cocine a fuego lento durante 1-2 minutos.", "Agregue la crema y la mostaza, revuelva bien, y cocine a fuego lento durante un minuto más, o hasta que la crema se haya calentado.", "Cuele la mezcla en una sartén limpia (deseche los sólidos), espolvoree sobre la cebolleta y sazone al gusto con sal y pimienta negra recién molida.", "Sazonar las vieiras, al gusto, con sal y pimienta negra recién molida.", "Calentar una sartén a fuego medio a alto. Cuando la sartén esté caliente, agregue la mantequilla restante.", "Cuando la mantequilla esté espumosa, agregue las vieiras, en lotes si es necesario, y fría por 15-20 segundos en cada lado, o hasta que estén recién cocidas. Retire de la sartén y reserve.", "Mezcle la zanahoria y el calabacín en juliana. Coloque pequeñas pilas de verduras en juliana en las conchas de vieiras lavadas.", "Coloque capas de vieiras y carne de langosta alternativamente en cada una de las conchas, arreglando las capas de mariscos en forma de abanico. Cuchara sobre la salsa de crema filtrada.", "Mezcle las migas de pan y rallado Gruyère juntos, luego espolvoree la mezcla generosamente sobre cada concha de vieiras.", "Transfiera las conchas de vieiras a la parrilla precalentada y ase a la parrilla durante 2-3 minutos, o hasta que las migas estén doradas y el queso burbujee. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_gratinatedscallopand_92456", "title": "Escalopes y langosta gratinados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, aplastado", "mantequilla", "Papas cerosas de 450 g / 1 libra, en rodajas finas (como Desirée, Golden Wonder o King Edward)", "Crema doble de 300 ml / ½ pinta", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Frote abundantemente un plato gratinado con el ajo y la mantequilla.", "Coloque las papas en el plato, asegurándose de que cada capa esté sazonada.", "Verter sobre la crema y cocinar en el horno durante 1 ¼ horas.", "Suba la calefacción a 200C / 400F / Gas 6 y cocine por otros 15 minutos hasta que la parte superior esté dorada. Servir."], "url": "www_bbc_co_uk_food_recipes_gratindauphinoise_72994", "title": "Gratén dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Coles de Bruselas 900g / 2lb, recortadas", "20 g / oz de mantequilla", "4 cucharaditas de aceite de girasol", "150g / 5 oz de tocino lardons (o tocino trasero sin corteza, cortado en tiras cortas de grasa)", "20g / ¾oz de almendras en copos", "400 ml / 14 fl oz crema doble", "2½ cucharaditas de jugo de limón", "5 cucharadas de pan rallado blanco fresco", "4 cucharadas de parmesano recién rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los brotes en una olla de agua con sal a fuego lento y cocine durante 4-5 minutos, hasta que casi, pero no del todo, cocinado. Escurrir bien, dejar enfriar un poco, luego cortar a la mitad.", "Coloque la mantequilla y el aceite en una sartén grande a fuego medio. Agregue los lardons y las almendras de tocino y fríe con cuidado durante 3-4 minutos, hasta que estén ligeramente dorados.", "Agregue los brotes y fría por 2-3 minutos más, revolviendo constantemente.", "Agregue la crema y lleve la mezcla a ebullición. Hervir durante 2-4 minutos, hasta que la crema se reduzca a una salsa rica. Sazone al gusto con sal y pimienta negra recién molida.", "Retire del fuego, agregue el jugo de limón y la cuchara en un plato gratinado para horno.", "Mezcle las migas de pan y el queso parmesano en un tazón, luego espolvoree uniformemente sobre la parte superior de la mezcla de brotes.", "Coloque en el horno y hornee durante 20 minutos, hasta que la parte superior esté dorada y la crema hirviendo visiblemente.", "Retire del horno y sirva en el plato gratinado (cuando el plato se haya enfriado un poco)."], "url": "www_bbc_co_uk_food_recipes_gratinofbrusselsspro_87597", "title": "Coles de Bruselas gratinadas con tocino, crema y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gratinofbrusselsspro_87597_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de aceite de oliva, más extra para engrasar", "450 g / 1 libra de rubí o acelga, tallos y costillas anchas cortadas en trozos de 1 cm / ½ pulgadas, hojas finamente cortadas", "sal y pimienta negra recién molida", "Aceitunas negras de 60g / 2oz, piedras quitadas", "2 filetes de anchoa enlatados, picados", "2 tomates secados al sol, picados", "½ cucharada de alcaparras, enjuagadas y escurridas", "1 cucharada de perejil fresco picado", "400g / 14oz de patatas nuevas, fregadas, hervidas hasta que estén tiernas, escurridas y cortadas", "Queso gruyere 60 g / 2 oz, rallado", "30 g / 1 oz de queso parmesano, recién rallado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Caliente dos cucharadas de aceite de oliva en una bandeja ancha con tapa y agregue las costillas de acelga picado. Revuelva, cubra y cocine a fuego lento durante cuatro minutos, revolviendo ocasionalmente.", "Agregue las hojas, revuelva, luego cubra nuevamente y cocine por otros cinco minutos, o hasta que estén tiernas. Sazonar con sal y pimienta negra recién molida y dejar de lado.", "Coloque las aceitunas, las anchoas, los tomates secados al sol, las alcaparras, el perejil y dos cucharadas de aceite de oliva en un procesador de alimentos y mezcle para hacer una pasta suave.", "Engrase ligeramente un plato a prueba de horno de 30cm / 12in. Coloque una capa de la acelga, junto con los jugos de cocina, y una capa de patatas cocidas en el plato. Extender un poco de la pasta de aceitunas sobre la acelga y las patatas y condimentar con pimienta negra recién molida. Continúa colocando capas sobre la acelga y la papa, separando más pasta de oliva entre cada capa y terminando con una capa de acelga.", "Mezcle el gruyère y el parmesano en un bol y espolvoree sobre la parte superior del gratinado. Rocíe sobre la cucharada restante de aceite de oliva.", "Transfiera al horno y hornee durante aproximadamente 25-30 minutos, hasta que el queso esté dorado y burbujeante. Sirve caliente o tibia"], "url": "www_bbc_co_uk_food_recipes_gratinofchardandnewp_85609", "title": "Gratinado de acelgas y patatas nuevas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gratinofchardandnewp_85609_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de sal marina", "150 g / 5 oz de azúcar en polvo", "2 vainas de vainilla, divididas longitudinalmente, semillas raspadas", "2 filetes de salmón gruesos de x 900 g / 2lb, con piel, escala, huesos de alfiler eliminados", "2 cucharadas de mostaza Dijon", "2 manojos grandes de eneldo fresco, picados", "2 cucharadas de vinagre de vino blanco", "5 huevos de gallinas camperas", "Harina común 110g / 4oz", "200g / 7oz de pan rallado fresco", "aceite vegetal, para freír", "1 cucharada de vinagre de vino tinto", "1 cucharadita de miel", "½ limón, solo jugo", "3 cucharadas de aceite de oliva", "1 aguacate, pelado, apedreado, finamente picado", "1 cabeza frisee, centro deja solo, recogido", "2 puntas de brotes de guisantes", "3 cucharadas de berro de coriandro", "3 cucharadas de cebollines, finamente en rodajas", "3 cucharadas de perifollo, más o menos picadas", "Queso de cabra suave 110 g / 4 oz, desgarrado en trozos pequeños", "4 cucharadas de croutons"], "method": ["Para el gravadlax, coloque la sal, el azúcar, las semillas de vainilla y las vainas en el procesador de alimentos y mezcle durante 30 segundos.", "Alinee un plato grande, poco profundo, rectangular, con película adhesiva. Espolvoree un tercio de la mezcla de curado sobre la base, luego agregue el pescado, con la piel hacia abajo y cubra con otro tercio de la mezcla, luego cubra con la segunda pieza de salmón, con la piel hacia arriba. Extienda la mezcla de curación restante sobre el filete y envuélvala en una película adhesiva. Dejar enfriar en la nevera durante ocho horas.", "Enjuague la sal de curado de la palmadita de pescado y seque con papel de cocina. Extienda la mostaza sobre el lado de la carne del salmón, luego espolvoree el eneldo sobre la parte superior. Rodar muy apretado con clingfilm de nuevo y dejar enfriar en la nevera por otras seis horas.", "Talla rebanadas delgadas del salmón en un ángulo de 45 grados.", "Para el huevo frito, ponga a hervir una olla grande de agua, agregue el vinagre y una pizca de sal. Hervir cuatro de los huevos durante cinco minutos. Retire los huevos de la cacerola con una espumadera y déjelos enfriar en un recipiente con agua helada.", "Agriete el huevo restante en un bol - bata y agregue una pizca de sal y pimienta negra recién molida.", "Pelar los huevos duros. Prepare un plato de harina poco profundo y un plato aparte de pan rallado. Dragar los huevos duros en la harina, sumergir en el huevo y rodar en las migas de pan. Poner a un lado en una bandeja en la nevera hasta que sea necesario.", "Caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, vierta el aceite en una sartén profunda de base pesada a una profundidad de 2 cm / ¾ pulgada y lleve la misma temperatura a la placa de cocción, verificando con un termómetro de azúcar. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los huevos hasta que estén dorados. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y sazonar con sal.", "Para la ensalada de aguacate, mezcle el vinagre, la miel, el jugo de limón y el aceite de oliva en un bol hasta que estén bien combinados.", "Mezcle el resto de los ingredientes en un recipiente y rocíe sobre el aderezo. Revuelva ligeramente para cubrir los ingredientes de la ensalada con el aderezo.", "Coloque rodajas de gravadlax en un plato. Agregue una porción de ensalada al lado y coloque un huevo frito en la parte superior."], "url": "www_bbc_co_uk_food_recipes_gravadlax_with_20643", "title": "Gravad lax con ensalada de aguacate y huevo frito", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 salmón entero, preferiblemente silvestre u orgánico (o trucha de mar o trucha grande) de aproximadamente 2-4 kg / 4½-9 lb", "2-3 racimos grandes de eneldo fresco", "Cristales de sal marina gruesa 125g / 4oz", "Azúcar en polvo 250g / 8oz", "30 g / 1 oz de pimienta negra recién molida", "1 cucharada de eneldo fresco picado", "1 cucharada de mostaza inglesa", "1 cucharadita de azúcar en polvo", "1 cucharada de aceite de girasol", "2 cucharadas de crema", "1 cucharada de vinagre de vino"], "method": ["Limpie y limpie el salmón y luego tome dos filetes grandes de cada lado, lo más cerca posible de la columna vertebral (use el cuerpo para caldo o sopa).", "Se corta el eneldo y se mezcla bien en un bol con sal, azúcar y pimienta. Coloque una hoja de papel de aluminio o una película adhesiva alrededor de cuatro veces el ancho de un filete de salmón. Extienda un cuarto de la mezcla de decapado sobre un área del tamaño de un filete en un lado de la lámina con un buen margen de 15cm / 6 pulgadas para doblar.", "Coloque un filete, con la piel hacia abajo, encima de la mezcla de pepinillos y cubra con un poco más de la mitad de lo que queda. Coloque el segundo filete en la parte superior, con la piel hacia arriba, para hacer un sándwich. Esparce la mezcla restante de salmuera sobre la piel.", "Envuelva el paquete con fuerza, metiendo los extremos y los bordes debajo del pez.", "Coloque el paquete en la bandeja y coloque una bandeja de tamaño similar o una tabla de madera en la parte superior. Ajústalo, con un ladrillo o dos o cualquier otra cosa a mano (¿el contenido del refrigerador?). Da la vuelta al paquete diariamente durante al menos cinco días, y no más de ocho. No deseche el líquido decapante que emana del paquete a menos que amenace con derramarse sobre el costado de la bandeja.", "Al menos una hora antes de que desee servir el pescado, combine todos los ingredientes para el aderezo en un recipiente y agite bien. Deje reposar y agite de nuevo para emulsionar antes de servir.", "Para servir, desenvuelva el gravadlax y limpie cualquier exceso de líquido decapante. Sin embargo, no es necesario raspar las piezas de eneldo, como sugieren algunas recetas. Rebane bastante (pero no demasiado) y sirva con la salsa y el pan moreno con mantequilla. (El gravadlax no utilizado se puede volver a envolver en una película adhesiva limpia o papel de aluminio y se puede guardar en la nevera durante hasta cinco días)."], "url": "www_bbc_co_uk_food_recipes_gravadlaxandgravadse_8838", "title": "Salmón cavado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Hace 1 pescado entero", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Sal de roca gruesa de 100g / 4oz", "75g / 3oz de azúcar en polvo", "1 cucharada de granos de pimienta blanca, aplastados", "2 grandes racimos de eneldo fresco, finamente picado", "2 filetes de salmón de 900 g / 2lb de grosor, piel sobre, escamas y espinas", "pan de centeno, para servir", "2 cucharadas de mostaza Dijon", "1 cucharada de azúcar en polvo", "1 cucharada de vinagre de vino blanco", "1 yema de huevo", "150ml / ¼ de pinta de maní o aceite vegetal", "1 cucharada de eneldo fresco picado", "sal y pimienta negra recién molida"], "method": ["Para hacer la mezcla de curado para el salmón, coloque la sal, el azúcar y los granos de pimienta blanca triturados en un tazón.", "Agregue la mitad del eneldo y revuelva para combinar.", "Use una película adhesiva para revestir un plato rectangular grande y poco profundo que se adapte al salmón cómodamente.", "Espolvoree un cuarto de la mezcla de curado sobre la base del plato y coloque uno de los filetes de salmón encima, con la piel hacia abajo.", "Espolvoree la mitad de la mezcla de curado en la parte superior y cubra con el otro filete de salmón, con la piel hacia arriba.", "Espolvoree la mezcla de curación restante en la parte superior y envuelva el salmón en una película adhesiva.", "Pese el salmón con pesas o latas para ayudar a exprimir cualquier exceso de líquido o humedad. Coloque en la nevera durante 2-3 días, volteando el salmón cada 6 horas o más, reemplazando los pesos después de girar.", "Después de 2-3 días, desenvuelva el salmón. Enjuague la mezcla de curado del gravadlax con agua fría y seque el pescado seco con papel de cocina.", "Coloque una gran pieza de película adhesiva en la superficie de trabajo y coloque uno de los filetes en la parte superior, con la piel hacia abajo. Cubra con el eneldo fresco restante y coloque el otro filete de salmón encima, con la piel hacia arriba. Envuélvelo bien en la película adhesiva y relájate durante seis horas.", "Mientras tanto, para hacer la salsa, coloque la mostaza, el azúcar, el vinagre y la yema de huevo en un tazón grande y bata para combinar.", "Agregue el aceite gota a gota para comenzar, luego en una corriente constante, batiendo constantemente, hasta que la salsa se vuelva gruesa y suave.", "Agregue el eneldo y sazone al gusto.", "Para servir, corte el gravadlax en rodajas finas con un cuchillo afilado, dejando la piel atrás. Gravadlax se sirve tradicionalmente cortado en rodajas más grueso que el salmón ahumado.", "Coloque tres o rebanadas de harina en cada plato de servir y agregue una cucharada de salsa a un lado.", "Sirve de inmediato con pan de centeno."], "url": "www_bbc_co_uk_food_recipes_gravadlaxwithsweetmu_74504", "title": "Gravad lax con salsa dulce de mostaza y eneldo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve de 10 a 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]