[{"ingredients": ["6 tomates cherry", "1 satsuma, pelado, segmentado", "70g / 2½oz de pescado blanco, cortado en 6 piezas", "6 pequeñas hojas frescas de salvia", "2 cucharaditas de aceite de oliva", "pizca de pimentón"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Empapa dos pinchos de madera en agua durante 10 minutos.", "Ensarta un tomate en uno de los pinchos de madera y luego agrega un trozo de pescado, seguido de una hoja de salvia. Luego agrega algunos segmentos de satsuma. Repita el proceso, luego inserte los ingredientes restantes en otro pincho de madera.", "Coloque los kebabs en una bandeja para hornear y rocíe con el aceite, luego espolvoree sobre el pimentón.", "Hornee en el horno por 15-20 minutos o hasta que los kebabs estén cocidos."], "url": "www_bbc_co_uk_food_recipes_sun_and_sea_kebabs_62733", "title": "Kebabs de sol y mar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4fl oz de agua helada", "60g / 2¼oz de hojas frescas de albahaca", "50g / 2oz de piñones, tostados", "50g / 2oz de queso parmesano, rallado", "2 dientes de ajo, pelados", "125-175ml / 4-6fl oz de aceite de oliva virgen extra", "Masa de hojaldre de 275g / 10oz (desde arriba)", "2 cucharadas de mostaza integral", "Queso emmental 200g / 7oz, rallado", "100 g / 4 oz de tomates frescos, en rodajas", "75g / 2¾oz de tomates secados al sol, cortados en cubitos", "2 cucharadas de aceite de oliva", "1 yema de huevo, batida", "puñado de hojas de cohete, para servir"], "method": ["Para la pasta de hojaldre basta, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo profundo en el centro con los dedos. Coloque los cubos de mantequilla y la sal en el pocillo y, con las yemas de los dedos de una mano, mezcle los ingredientes y, gradualmente, introduzca más harina en el pocillo con la otra mano. Trabaja en la harina hasta que la mezcla esté suelta pero bien combinada y aún con trozos de mantequilla visibles.", "Poco a poco agregue el agua helada y mezcle hasta que tenga una masa áspera. (Puede que no necesite toda el agua. Tenga cuidado de no trabajar en exceso la mezcla). Haga rodar la masa en forma de bola, envuélvala en una película adhesiva y déjela enfriar durante 20 minutos en la nevera.", "Cuando la masa se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada en un rectángulo de 40x20cm / 16x8 pulgadas. Dobla el rectángulo en tres y dale un cuarto de vuelta. Repita el proceso, dando la masa doblada otro cuarto de vuelta. Envuelva la masa en una película adhesiva y déjela enfriar por otros 30 minutos. Una vez frío, repita el proceso de rodar, doblar y girar dos veces más, haciendo un total de cuatro giros. Envuelva la masa en una película adhesiva y colóquela en la nevera durante al menos 30 minutos.", "Para el pesto, coloque la albahaca, los piñones, el parmesano y el ajo en un almirez y mortero y muela, mientras agrega gradualmente el aceite de oliva virgen extra hasta que se forme una pasta.", "Para las tartas, precaliente el horno a 200C / 180C Fan / Gas 6.", "Ruede los pasteles en una superficie ligeramente enharinada a un espesor de 2 mm / 1 / 8in. Recorte seis discos con un cortador de pasteles de 12 cm / 5 pulgadas. Puntuación alrededor del borde del círculo a unos 2 cm del borde. Alinee una bandeja para hornear con papel de hornear y cepille con un poco de agua fría. Transfiera cada uno de los discos de pastelería a la bandeja con una espátula.", "Cepille el anillo interior de las tartas con la mostaza, espolvoree sobre el queso y cubra con los dos tipos de tomates. Rocíe con aceite de oliva y cepille la masa con la yema de huevo por los bordes.", "Hornee en el horno por 12-15 minutos, o hasta que la masa esté dorada.", "Para servir, adornar que comienza con el pesto y un poco de cohete fresco."], "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_04502", "title": "Tartas de hojaldre secadas al sol, queso emmental y hojaldre de pesto", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 375 g / 13 oz, más extra para quitar el polvo", "1 cucharadita de sal", "125g / 4½oz de mantequilla sin sal, ablandada", "2 huevos medianos de granja", "2 cucharadas de semillas de amapola", "40 g / 1½ oz de queso parmesano, rallado (o un queso duro vegetariano similar)", "1 cucharada de pasta de tomate secada al sol", "1 cucharada de semillas de sésamo"], "method": ["Ponga la harina, la sal, la mantequilla, uno de los huevos y 40 ml / 1 ½ oz de agua en un tazón y mezcle bien durante cinco minutos hasta que tenga una masa suave. Divide la masa por la mitad.", "En una superficie de trabajo ligeramente enharinada, amase las semillas de amapola en la mitad de la masa y el parmesano y la pasta de tomate secada al sol en la otra.", "Usando un rodillo, despliegue cada pieza de masa sobre una superficie de trabajo ligeramente enharinada de aproximadamente 3 mm de grosor. Coloque cada pieza de masa en una bandeja para hornear, cubra con una película adhesiva y refrigere durante 30 minutos.", "Precaliente el horno a 200C / 180C (ventilador) / Gas 6. Espolvoree dos bandejas grandes para hornear con harina.", "Usando un cortador redondo de 7cm / 2¾cm corte 18 rondas de cada mitad de la masa, volviendo a enrollar si es necesario. Coloque las rondas en la bandeja de horno.", "Cepille los bizcochos con huevo batido y espolvoree parmesano y tomate con semillas de sésamo.", "Hornee por 10-15 minutos hasta que estén doradas. Retire del horno y transfiera a una rejilla para enfriar. Sirve caliente o frío."], "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_86934", "title": "Galletas saladas secadas al sol con tomate y semillas de amapola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 36 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_86934_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de hojaldre listo para el uso de 2 oz", "harina común, para quitar el polvo", "1 x 280 g / 10 oz de tomates secados al sol, drenados y finamente picados", "algunas ramitas de romero fresco, solo hojas, finamente picadas", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Coloque la masa de hojaldre sobre una superficie bien enharinada y golpéela con un rodillo. Por lo general, debe ser bastante delicado con la masa de hojaldre ya que necesita hincharse mucho, pero para las palmeras solo necesita hincharse un poco. Ruede los pasteles en un rectángulo de aproximadamente 30 x 35 cm / 12 x 14 pulgadas y el grosor de una moneda de 1 £. Extienda los tomates sobre la masa de hojaldre y espolvoree sobre el romero.", "Con el extremo más corto hacia usted, tome ambos bordes largos de la masa y gírelos uno hacia el otro para encontrarse en el medio. Cepille un pequeño huevo en el centro para unir las dos mitades. Levante con cuidado en una bandeja grande para hornear (asegurándose de que se ajuste primero a su refrigerador) y colóquela en la nevera por al menos 30 minutos para enfriarla y endurecerla.", "Precalentar el horno a 200C / 400F / Gas 6.", "Retire el rollo de la nevera y, con un cuchillo muy afilado, córtelo en trozos de 1cm / ½ en piezas gruesas. Coloque cada pieza en la bandeja de hornear, con el lado del corte hacia arriba, y cepille bien con el huevo batido, luego hornee en el horno durante 10-15 minutos hasta que quede hinchado, crujiente y dorado.", "Retire las palmeras del horno y deje que se enfríen en la bandeja de hornear.", "Para servir, apilarlos en un plato alto. Estos son pequeños canapés para los invitados que esperan."], "url": "www_bbc_co_uk_food_recipes_sun-dried_tomato_and_97049", "title": "Palmeras de romero y tomate secadas al sol", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 25-30 palmiers", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sun-dried_tomato_and_97049_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ chalota, finamente picada", "1 diente de ajo, finamente picado", "125g / 4½oz de tomates bañados por el sol, picados", "salpicar vino blanco", "puñado cada cebollino fresco, perejil, albahaca, picado", "½ limón, solo jugo", "250 g / 9 oz de espagueti fresco, cocinado", "1 limón, cortado en cuñas, para adornar"], "method": ["Calentar el aceite de oliva en una sartén grande, agregar la chalota y freír suavemente durante dos minutos. Agregue el ajo y cocine por un minuto. Agregue los tomates y el vino y cocine por cuatro minutos, o hasta que se ablanden. Agregue las hierbas, el jugo de limón y los espaguetis cocidos.", "Mezcle bien para cubrir la pasta y la cuchara en un tazón para servir.", "Para servir, decorar con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_sunblushedtomatoands_85986", "title": "Spaghetti con tomate al sol y chalote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["gran puñado de perejil flatleaf, solo hojas", "¼ cebolla roja, finamente rebanada", "50g / 2oz de queso manchego, afeitado con un pelador de verduras", "50g / 2oz de tomates bañados por el sol", "Aceitunas negras de 30g / 1oz, piedras quitadas", "2 cucharadas de aceite de oliva", "2 cucharaditas de vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Coloque todos los ingredientes en un tazón grande y revuelva bien para combinar.", "Para servir, coloque en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_sunblushedtomatoblac_86246", "title": "Tomate iluminado por el sol, aceituna negra y ensalada Manchego afeitada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ mozzarella de búfala bola, en rodajas", "8 tomates tomados por el sol", "puñado de albahaca fresca, apenas rasgada", "1-2 cucharadas de aceite de oliva", "½ trufa, finamente afeitada (disponible en fruterías especializadas y algunas delicatessen)", "300ml / ½ pinta de aceite vegetal, para freír", "2 chalotes de plátano, piel eliminada, cortada en anillos", "Harina normal de 85g / 3oz, condimentada con sal y pimienta negra recién molida", "150g / 5½ oz de harina de auto crianza", "75ml / 2½fl oz de agua con gas", "pizca de sal"], "method": ["Para la ensalada, coloque todos los ingredientes de la ensalada en un tazón y mezcle bien. Coloque la ensalada en un plato de servir.", "Para los aros de cebolla, coloque el aceite vegetal en una olla profunda de fondo grueso y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Dragar los aros de cebolla en la harina común sazonada.", "Coloque la harina de auto crianza en un tazón grande, agregue el agua con gas y sal y bate para hacer una masa espesa. Agregue más agua con gas si es necesario.", "Sumerja los aros de cebolla enharinados en la mezcla, luego colóquelos cuidadosamente en el aceite caliente. Freír a fuego lento durante 3-4 minutos, o hasta que estén dorados y crujientes.", "Retire los aros de cebolla con una espumadera, escurra sobre papel de cocina y espolvoree con sal.", "Para servir, cubra la ensalada con los aros de cebolla."], "url": "www_bbc_co_uk_food_recipes_sunblushedtomatomozz_85983", "title": "Ensalada de tomates, mozzarella y trufas al sol, con aros de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "15g / ½ oz de sal", "55ml / 2fl oz de aceite de oliva", "20 g / oz de levadura fresca", "275ml / 9fl oz de agua", "170 g / 6 oz de aceitunas griegas negras, picadas y picadas", "55g / 2oz de tomates secados al sol"], "method": ["Mezcle todos los ingredientes, aparte de las aceitunas y los tomates, en un tazón grande. Tenga cuidado de no poner la levadura en contacto directo con la sal cuando se agregan por primera vez al recipiente.", "Amasar bien con las manos y los nudillos hasta que la masa sea elástica, lisa y brillante. Cubra con una película adhesiva y deje que se levante durante una hora.", "Divida la masa en dos y agregue la mitad de las aceitunas y los tomates secados al sol en cada una.", "Moldee las masas en formas redondas y rugosas y presione firmemente hacia abajo. Espolvoree harina blanca ligeramente sobre la parte superior y márquelos con una cruz.", "Colóquelos en una bandeja para hornear forrada con papel de hornear (papel de silicona) y demuestre durante una hora en un lugar cálido.", "Hornee a 220C / 425F / Gas 7 durante 30 minutos hasta que estén doradas. Retire del horno y deje enfriar en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_sundriedtomatoandoli_66043", "title": "Tomate secado al sol y pan de aceitunas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 2 panes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sundriedtomatoandoli_66043_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3% C2% BDoz% 20dark% 20chocolate,% 2070 %% 20cocoa% 20solids,% 20roughly% 20chopped", "100 g / 3½ oz de mantequilla sin sal, ablandada y cortada en cubos, más extra para engrasar", "4 huevos grandes de gallinas camperas, a temperatura ambiente", "125 g / 4½ oz de azúcar en polvo", "75g / 2½ oz de almendras molidas", "2 cucharadas de cacao en polvo, más 1 cucharadita de polvo", "3 cucharadas de licor de amaretto", "Crema doble 250ml / 9fl oz", "1 cucharada de licor de amaretto", "4 galletas amaretti, desmenuzadas"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4 y engrase ligeramente los lados y forre la base de la lata de torta en forma de resorte con papel de hornear.", "Derrita el chocolate y la mantequilla en un recipiente resistente al calor, ya sea sobre una fuente de agua hirviendo, asegurándose de que el recipiente no toque el agua o en el microondas. Vierta en una jarra y deje enfriar un poco.", "Batir los huevos y el azúcar hasta que estén espesos, húmedos y doblados, si no triplicados, en volumen. Esto tomará de 2 a 3 minutos, usando un mezclador independiente, o de 4 a 5 minutos con un batidor de mano eléctrico.", "Mezcle las almendras y el cacao en un tazón pequeño. Baje la velocidad de la batidora y bata suavemente los huevos y el azúcar, cucharada de una cucharada.", "Revuelva el licor de amaretto en el chocolate derretido y la mantequilla ligeramente enfriados, luego vierta esta mezcla brillante en una corriente lenta y constante en la masa de la torta, batiendo todo el tiempo; se verá como una fabulosa mousse de chocolate. Dale un doblez final a mano para asegurarte de que todo esté combinado.", "Verter y raspar la mezcla en la lata preparada. Hornea durante 20-25 minutos hasta que la torta comience a desprenderse por los bordes, la parte superior tiene una corteza ligeramente agrietada y burbujeante del color del chocolate con leche pálido, el pastel será oscuro y tierno por debajo, y viene un probador de pasteles. con solo unas pocas migas húmedas que se unen a ella.", "Retire a una rejilla de alambre, cubra con una toalla de té limpia sobre la lata y deje enfriar. A medida que se enfría, la parte superior del pastel se agrietará un poco más, y se hundirá ligeramente, dejando un borde con volantes. Una vez que el pastel esté frío, suelta la lata, y levanta suavemente la torta - retira la base solo si eres muy valiente - en un soporte para pasteles o en un plato. Espolvorea la cucharadita de cacao a través de un colador de té en la parte superior, como el recubrimiento de una trufa de chocolate.", "Justo antes de servir, batir la crema y el amaretto juntos, hasta que las ondulaciones comiencen a aparecer en la superficie y se espese, pero aún lo suficientemente suave como para dorar junto con la torta. Doble muy suavemente la mayoría de las galletas amaretti desmenuzadas en la crema, lo que la espesará un poco más. Decantar en un tazón pequeño y espolvorear el resto de las migas de amaretti en la parte superior."], "url": "www_bbc_co_uk_food_recipes_sunken_chocolate_42872", "title": "Pastel de amaretto de chocolate hundido con crema de amaretti desmenuzado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 10-12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sunken_chocolate_42872_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal, más algunos para engrasar", "1 huevo", "60g / 2oz de harina auto crianza", "60g / 2oz de azúcar en polvo", "40g / 1½ oz de zanahoria", "30g / 1oz de piña triturada en lata (escurrida)", "Nueces picadas 20g / 1oz (opcional)"], "method": ["Antes de cocinar, lávese las manos y colóquese un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 5.", "Cepille un poco de aceite dentro de una lata pequeña (500g) de pan. Alinee la parte inferior de la lata con papel para hornear (pergamino).", "Rompe el huevo en un tazón. Agregue el aceite y bata ligeramente con el tenedor hasta que estén bien combinados.", "Pon la harina y el azúcar en otro tazón. Revuelva con el tenedor. Este es el tazón \"seco\".", "Rallar la zanahoria y mezclar en la mezcla de huevo. A continuación, agregue la piña y las nueces. Este es el cuenco \"mojado\".", "Vierta el contenido del tazón húmedo en el recipiente seco y mezcle bien con la cuchara de madera.", "Tendrá que pedirle a un adulto que lo ayude con esta parte. Vierta la mezcla en la lata de pan, colóquela en una bandeja para hornear y pida a un adulto que la ponga en el horno durante 25-30 minutos.", "Deje que la torta se enfríe antes de verter y servir en rodajas."], "url": "www_bbc_co_uk_food_recipes_sunny_carrot_cake_34344", "title": "Pastel de zanahoria soleado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pimiento amarillo, sin semillas, cortado en trozos de 1cm / ½ en trozos", "Zanahorias de 150g / 5½oz, recortadas, cortadas en piezas de 1cm / ½ pulgadas", "300 g / 10 oz de calabaza, peladas, sin semillas, carne cortada en trozos de 1cm / ½ en trozos", "Jengibre fresco de la raíz de los 5cm / 2in, pelado, rallado", "4 cucharadas de hojas de cilantro fresco picado", "4 cebolletas, cortadas, finamente picadas", "200g / 7oz de granos de maíz dulce enlatados, escurridos y enjuagados", "Queso doble Gloucester 100 g / 3½ oz, rallado", "2-4 cucharaditas de sal", "Harina normal de 225g / 8oz, más extra para quitar el polvo", "1½ cucharadita de cúrcuma molida", "pizca de sal", "115g / 4oz de mantequilla fría, cortada en cubos pequeños", "4-5 cucharadas de agua fría", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el relleno, coloque los trozos de pimiento, zanahorias y calabaza en una sartén profunda con tapa. Agregue suficiente agua hirviendo para cubrir las verduras. Cubra la olla con la tapa y vuelva a hervir. Hierva por cuatro minutos, o hasta que los vegetales estén tiernos, luego drene bien.", "Transfiera las verduras drenadas a un tazón grande y agregue los ingredientes de relleno restantes. Mezcle hasta que estén bien combinados, luego déjelos a un lado hasta que estén completamente fríos.", "Para las hamburguesas, en un tazón, mezcle la harina, la cúrcuma molida y la sal en un bol hasta que estén bien combinados.", "Agregue los cubos de mantequilla y frótelos en la harina con la punta de los dedos hasta que la mezcla se asemeje a las migas de pan.", "Agregue el agua, una cucharada a la vez, revolviendo la mezcla con una cuchara, hasta que se junte como una masa. (NB: Puede que no necesite usar toda el agua.) Enrolle la masa en una bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Cuando la pastelería se haya enfriado, extiéndala sobre una superficie de trabajo ligeramente enharinada a un espesor de 0.5cm / ¼ in. Corta de seis a ocho discos de 7.5cm / 3 pulgadas de la masa usando un cortador de galletas o una taza volteada.", "Divida la mezcla de llenado por igual entre los discos de hojaldre, cubriendo solo la mitad de cada disco y dejando un borde de 1 cm / ½ pulgada en el borde de cada uno.", "Cepille ligeramente los bordes de los discos de pastelería con algo del huevo batido, luego doble la mitad libre de cada disco sobre la mitad llena y presione los bordes para sellar con un tenedor.", "Cepille las partes superiores de las hamburguesas con el huevo batido restante. Cubra una bandeja para hornear con papel resistente a la grasa y coloque las hamburguesas sobre ella. Hornee las hamburguesas en el horno durante 20-25 minutos, o hasta que la masa esté dorada."], "url": "www_bbc_co_uk_food_recipes_sunnyvegetablepattie_91709", "title": "Empanadas de vegetales soleados", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sunnyvegetablepattie_91709_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "125ml / 4fl oz de yogurt natural", "2 cucharadas de aceite vegetal", "150g / 5oz llano de harina integral", "2 cucharadas de gachas de avena", "1 cucharada de azúcar morena oscura", "1½ cucharadita de especias mixtas", "2 cucharaditas de polvo de hornear", "Mango de 200g / 7oz, picado en trozos pequeños", "2 cucharadas de semillas de calabaza"], "method": ["Precaliente el horno a 220C / 425F / Gas 7. Haga una línea de seis orificios de una bandeja para muffins con cajas de muffin de papel.", "Batir el huevo en una jarra, luego batir en el yogur y aceite vegetal.", "Mezcle la harina, la avena, el azúcar, la mezcla de especias y el polvo de hornear en un tazón. Agregue el mango y la mezcla de huevo y mezcle hasta que se combinen.", "Divida la mezcla entre las seis cajas de muffins y espolvoree sobre las semillas de calabaza, empujándolas ligeramente.", "Hornee en el horno por 20-25 minutos, o hasta que se levante y dorado, y un probador de pastel insertado en el centro salga limpio."], "url": "www_bbc_co_uk_food_recipes_sunshine_muffins_52272", "title": "Muffins de sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ pepino", "1 cucharadita de jengibre rallado", "400ml / 14fl oz de jugo de manzana", "½ lima, solo jugo"], "method": ["Ralla el pepino en un bol, asegurándote de atrapar todo el jugo.", "Agregue el jengibre, el jugo de manzana y el jugo de lima.", "Tamiza la mezcla en una jarra, presionando la pulpa para extraer la mayor cantidad de jugo posible.", "Vierta en dos vasos altos."], "url": "www_bbc_co_uk_food_recipes_super_green_dream_drink_87254", "title": "Súper bebida verde sueño", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de cúrcuma molida", "1 cucharada de comino molido", "1 pollo grande de corral (aproximadamente 1.8 kg / 4 lb)", "Cacahuetes sin sal 250g / 9oz, asados", "2 tallos de hierba de limón, finamente picados", "Pieza de 5cm / 2in de galangal, rallado", "3 dientes de ajo, rallados", "Leche de coco 400ml / 14fl oz", "4 cucharadas de ketjap manis (salsa de soja indonesia dulce disponible en la mayoría de los supermercados chinos)", "2 cucharadas de copos de chile seco", "1 lima, ralladura solamente", "2 pimientos rojos picados", "4 chiles rojos, picados", "3 dientes de ajo, rallados", "75 g / 2½ oz de azúcar en polvo", "100ml / 3½fl oz de vinagre de vino blanco", "1 cucharada de harina de maíz, mezclada con 2 cucharaditas de agua", "2 limas, solo jugo", "gran pizca de sal", "1 cucharadita de hojuelas de chile", "2 racimos de cebollas de primavera, cortadas en piezas de 2cm / ¾in", "Cacahuetes sin sal de 150g / 5½oz, tostados y toscamente picados", "1-2 chiles verdes, en rodajas finas", "½ pepino, en rodajas", "1 manojo de cilantro, hojas recogidas y tallos finamente picados", "2 cucharadas de miel clara", "4 cucharadas de salsa de soja", "3 cucharadas de aceite de sésamo", "2 limas, solo jugo"], "method": ["Mezcle la cúrcuma y el comino, agregue un poco de agua fría para hacer una pasta y frótelo sobre el pollo. Cubra el pollo con film transparente, colóquelo en el refrigerador y déjelo toda la noche.", "Pulse los cacahuetes en un procesador de alimentos (deben ser una mezcla de piezas finas y gruesas) y déjelos a un lado. Coloque el lemongrass, galangal y ajo en el procesador de alimentos y mezcle hasta obtener una pasta fina. Transfiera a un tazón, agregue la leche de coco, ketjap manis, hojuelas de chile secas, cáscara de limón y cacahuates picados. Cubra y reserve durante la noche.", "Al día siguiente, precaliente el horno a 120 ° C / 250 ° F / Gas 1/2.", "Coloque el pollo en una bandeja de asar y vierta el adobo. Asar muy lentamente durante dos horas, rociando con la salsa hasta la mitad. Después de este tiempo, suba el horno a 200C / 400F / Gas 6 y continúe cocinando durante 20 minutos más. Tenga cuidado de no quemar el pollo, si es necesario, puede agregar un chorrito o dos de agua mientras cocina. Retirar del horno, hilvanar y dejar reposar durante 20 minutos.", "Mientras tanto, para hacer la salsa de chile, coloque los pimientos rojos, los chiles, el ajo, el azúcar y el vinagre de vino blanco en un procesador de alimentos y mezcle hasta obtener un puré áspero. Vierta la mezcla en una cacerola y deje que hierva. Cocine por alrededor de tres minutos, mezcle la mezcla de harina de maíz y cocine hasta que la salsa se espese. Termine con el jugo de lima, sal y escamas de chile. Dejar de lado para enfriar.", "Para la ensalada, coloque las cebolletas, los cacahuetes, los chiles verdes, el pepino y el cilantro en un bol. Mezcle la miel, la salsa de soya, el aceite de sésamo y el jugo de lima, vierta sobre la ensalada y mezcle bien. Sirva con la salsa de pollo y chile."], "url": "www_bbc_co_uk_food_recipes_super_satay_chicken_06986", "title": "Pollo Súper satay", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/super_satay_chicken_06986_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 patatas Royal Jersey", "10 lanzas de espárragos verdes, cortadas en ángulo", "Habas jóvenes de 150g / 5½oz, envasadas", "150g / 5½oz guisantes, envasadas", "150 g / 5½ oz de soja fresca o congelada", "3 cebollas de primavera, cortadas en ángulo", "llovizna de aceite de oliva", "4 lanzas de espárragos púrpuras, cortadas con un pelador", "1 limón, solo jugo", "2 chalotes, cortados en anillos", "15 hojas de menta, 10 rotas, 5 trituradas", "pequeño racimo de perifollo", "puñado de berros", "cestito de brotes de guisantes", "sal marina y pimienta negra recién molida", "1 cucharada de mostaza Dijon", "5 cucharadas de vinagre de vino tinto", "1 cucharadita de aceite de nuez", "300ml / 10½oz de aceite de oliva virgen extra"], "method": ["Ponga a hervir una olla grande de agua y blanquee las papas, escurra y cuidadosamente corte a la mitad.", "Pon a hervir una olla grande de agua con sal. Suelta el espárrago verde, las habas, los guisantes, los frijoles de soya y las cebolletas y cocínalos por un par de minutos. Escurra y corra bajo agua fría para evitar que se cocinen pero no para enfriarlos.", "Extiende en una bandeja con las papas. Espolvorear con un poco de aceite de oliva y sazonar con sal y pimienta.", "Coloque los espárragos morados en un recipiente y espolvoree con jugo de limón y sal para curar y suavizar.", "Para el aderezo, mezcle la mostaza y el vinagre en un bol, agregando lentamente los aceites. Debe tener una consistencia espesa, como una salsa. Sazonar con una buena cantidad de sal y pimienta negra.", "Mezcle todas las verduras con los chalotes, la menta, el perifollo, el berro y los brotes de guisantes y vierta sobre el aderezo.", "Divida entre cuatro placas y cave adentro."], "url": "www_bbc_co_uk_food_recipes_super_spring_salad_91355", "title": "Ensalada de primavera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/super_spring_salad_91355_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de quinoa, enjuagada", "300-350 ml / 18fl oz de caldo de pollo", "2 x 250-300 g / 7-10½ oz de filetes de carne de cerdo, idealmente Secreto Ibérico", "aceite de oliva, para cepillar", "50g / 1¾oz de col rizada, triturada", "100g / 3½oz de garbanzos enlatados, escurridos", "75g / 2½oz de avellanas blanqueadas", "75g / 2½oz de almendras blanqueadas", "3 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados", "2 cucharadas de orégano fresco, hojas removidas y finamente picadas", "¼ cucharadita de mostaza en polvo inglesa", "pizca de cilantro molido", "200 gramos de arroz Pison puro", "1 cucharada de jerez o vinagre de vino tinto", "Semillas de girasol 40g / 1½oz", "20 g / ¾oz de semillas de sésamo", "40 g / 1½ oz de semillas de calabaza"], "method": ["Coloque la quinua y el caldo en una cacerola grande y cocine según las instrucciones del paquete. Escurrir y dejar enfriar.", "Caliente una sartén a fuego medio. Cepille los filetes de cerdo con el aceite y la plancha en la sartén caliente durante 8-10 minutos en cada lado, dependiendo del grosor, o hasta que estén cocidos. Dejar enfriar antes de cortar.", "Agregue la col rizada, los garbanzos y las nueces a la quinua cocida y mezcle bien.", "Para hacer el aderezo, caliente el aceite en una cacerola mediana y cocine el ajo durante 1-2 minutos. Agregue el orégano, la mostaza en polvo, el cilantro, la salsa de piri-piri y el jerez y cocine por un minuto más.", "Para servir, tueste las semillas en una sartén caliente y seca por 2-3 minutos, revolviendo continuamente.", "Coloque la quinua en un plato para servir y cubra con la carne de cerdo en rodajas. Rocíe con el aderezo y espolvoree con las semillas."], "url": "www_bbc_co_uk_food_recipes_superfood_salad_with_a_40560", "title": "Ensalada Superfood con aderezo piri-piri", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de aceite de girasol", "100g / 3½oz de azúcar morena oscura", "1 huevo de gallinas camperas, golpeado", "½ cucharadita de esencia de vainilla", "Harina normal de 200g / 7oz, más extra para quitar el polvo", "½ cucharadita de sal", "½ cucharadita de polvo de hornear", "100 g / 3½ oz de guindas secas, empapadas en agua", "2 cucharadas de aguardiente de cereza", "40g / 1½oz de almendras en copos", "75g / 2½oz de avellanas tostadas, picadas", "100 g / 3½ oz de chocolate blanco, roto en pequeños trozos", "100 g / 3½ oz de chocolate negro, partidos en trozos pequeños"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque la mantequilla y el azúcar impalpable en un bol y bata hasta que estén suaves y cremosos. Agregue el aceite de girasol y el azúcar moreno y doble hasta combinar. Agregue la esencia de huevo y vainilla y mezcle bien.", "En otro recipiente, mezcle la harina, la sal y el polvo de hornear.", "Agregue la harina a la mantequilla y la mezcla de azúcar y mezcle bien para formar una masa. Dobla las cerezas escurridas, brandy, almendras, avellanas y las piezas de chocolate blanco y negro. .", "En una superficie de trabajo enharinada, extender con cuidado la masa a 1 cm / ½ pulgada de grosor. Usando el cortador de galletas de su elección, recorte de 8 a 16 galletas (dependiendo del tamaño del cortador).", "Coloque las galletas en una bandeja para hornear engrasada (no muy juntas ya que se extenderán). Coloque en el horno para hornear durante 15 minutos o hasta que estén dorados y cocidos.", "Retire del horno y deje enfriar en las bandejas durante 8-10 minutos, luego transfiera a un estante de enfriamiento para que se enfríe completamente."], "url": "www_bbc_co_uk_food_recipes_superposhchewycookie_89623", "title": "Galletas masticables superpuestas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6-12 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/superposhchewycookie_89623_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de chocolate puro fuerte", "100g / 3½oz de mantequilla sin sal", "150 g / 5 oz de azúcar en polvo", "150ml / 5fl oz de agua", "4 huevos grandes, solo yemas", "Crema doble 500ml / 17fl oz"], "method": ["Divida el chocolate y coloque con la mantequilla sin sal en un horno tibio durante aproximadamente 15 minutos. Retire y revuelva hasta que se derrita y mezcle.", "A fuego lento, disuelva el azúcar en el agua, suba el fuego y hierva rápidamente durante unos minutos para obtener un almíbar ligero. Está listo antes de que el jarabe tome cualquier color, cuando se deja caer un poco en un plato frío forma un hilo cuando se estira entre el dedo y el pulgar. Deje que la mezcla se enfríe por solo un minuto.", "Coloque las yemas de huevo en un recipiente y comience a batir (idealmente con un batidor eléctrico), goteando en el almíbar caliente a medida que avanza. Continúe batiendo hasta que la mezcla esté espesa y parecida a un mousse. Batir en la crema. Luego dobla el chocolate derretido y la mantequilla hasta que esté bien mezclado. Luego vierta la mezcla en una máquina de helados y revuelva hasta que se congele."], "url": "www_bbc_co_uk_food_recipes_superrichchocolateic_14295", "title": "Helado de chocolate súper rico", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/superrichchocolateic_14295_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 x 500 g / 1 lbs 2 oz langostas cocidas", "Filetes de solomillo de 4 x 175 g / 6oz", "75g / 3oz de mantequilla", "2 cucharadas de aceite de oliva", "1 limón, solo jugo", "250 g / 9 oz de espinacas", "250g / 9oz de berros, hojas recogidas", "50g / 2oz de mantequilla", "2 chalotes, finamente cortados en cubitos", "150ml / 5fl oz de vino blanco", "300 ml / 10 fl oz doble crema", "2 cucharadas de mostaza de grano", "2 tomates, desollados, sin semillas, picados", "2 cucharadas de cebollín, finamente picado"], "method": ["Agriete las pinzas de la langosta, extrayendo la carne en una pieza completa si es posible. Corte la cola por la mitad a lo largo, levante la carne y reserve tanto la carne como el caparazón.", "Sazone el bistec con sal y pimienta negra recién molida. Calentar una sartén hasta que esté caliente, agregar un poco de la mantequilla y el aceite y freír el bistec en cada lado durante 2-3 minutos (para el medio), rociando con la mantequilla mientras se cocina.", "Retire la sartén del fuego y déjela reposar durante 2 o 3 minutos, voltee la carne y descanse por otros 2 o 3 minutos.", "Mientras tanto, caliente un poco de mantequilla en una segunda sartén y caliente la carne de la langosta, rociándola con los jugos de la sartén. Sazonar con sal, pimienta negra recién molida y jugo de limón.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla y el aceite restante y freír las espinacas y el berro hasta que se marchiten.", "Para la salsa, derrita la mantequilla en una cacerola y fría la chalota por 2-3 minutos, o hasta que se ablande. Agregue el vino y cocine hasta que el volumen del líquido se haya reducido a la mitad. Agregue la crema y reduzca a la mitad nuevamente.", "Agregue la mostaza en grano, los tomates y el cebollín y caliente. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, coloque las cáscaras de langosta en un plato y coloque la carne de langosta dentro de las cáscaras. Coloque el filete al costado y la pinza de langosta en la parte superior. Finalmente, agregue un poco de espinaca y berros y rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_surf_and_turf_with_46844", "title": "Surf y césped con espinacas marchitas, berros y salsa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de coco o aceite de girasol", "5cm / 2in canela en rama", "6 dientes", "4 vainas de cardamomo verde", "4 dientes de ajo, en rodajas finas", "Jengibre fresco de raíz de 5cm / 2in en pieza, pelado y cortado en pequeños cerillos", "2 cebollas rojas, finamente cortadas", "8 chiles verdes, hendidura longitudinal", "15 hojas de curry", "1kg-1.3kg / 2lb 4oz-2lb 14oz de pollo, unidas en 8 piezas, u 8 piezas de pollo, sin piel", "2 cucharaditas de sal", "1 cucharada de granos de pimienta negra, aplastados", "590ml / 19fl oz de leche de coco", "5 cucharadas de vodka toddy (de palma) (o vinagre de jerez o vinagre dulce de vino blanco), para servir", "1 cucharadita de masa garam masala, para servir", "240g / 8½oz de arroz basmati, enjuagado con agua corriente", "4 cucharadas de aceite vegetal", "Anís de 2 estrellas", "4 vainas de cardamomo verde", "2 hojas de laurel", "1 cebolla, finamente rebanada", "10 hojas de curry", "1½ cucharadita de sal", "1½ cucharadita de azúcar en polvo", "4 cucharadas de vinagre de vino blanco", "160ml / 5½fl oz de leche de coco"], "method": ["Para el estofado de pollo, caliente el aceite en una sartén grande con tapa o saltee la sartén. Agregue la canela, el clavo y el cardamomo, seguidos del ajo, el jengibre, la cebolla, los chiles y las hojas de curry. Cocine a fuego medio hasta que las cebollas estén suaves.", "Agregue el pollo, sal y pimienta y revuelva por un minuto. Vierta la leche de coco y 125 ml / 4 fl oz de agua. Reduzca el fuego a bajo y cocine a fuego lento, tapado, durante 45 minutos o hasta que el pollo esté bien cocido.", "Mientras tanto, remoje el arroz en agua fría durante 20 minutos, luego drene bien. Caliente el aceite en una olla grande con tapa. Agregue el anís estrellado, cardamomo y laurel y cocine, revolviendo, durante 30 segundos. Agregue la cebolla, las hojas de curry, la sal y el azúcar y cocine hasta que la cebolla esté suave y translúcida. Agregue el vinagre, la leche de coco, 300 ml / 10 fl oz de agua y luego el arroz. Mezcle bien, luego cocine a fuego lento, revolviendo, durante 5 minutos. Reduzca el fuego a medio, cubra con una tapa ajustada y cocine por 7-8 minutos. Todo el líquido debe ser absorbido.", "Quítate el fuego y revuelve. Cubra nuevamente con la tapa y déjela a un lado durante 10 minutos para que el arroz termine de cocinar en su vapor.", "Para servir, agregue el vinagre al guiso, espolvoree sobre el garam masala y mezcle bien. Retirar del fuego y servir con el arroz agridulce."], "url": "www_bbc_co_uk_food_recipes_suriani_home-style_57083", "title": "Suriani pollo al estilo casero curry ('ishtu')", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/suriani_home-style_57083_16x9.jpg", "isVegetarian": false, "recommendations": 0}]