[{"ingredients": ["3 yemas de huevo de gallinas camperas", "3 cucharaditas de mostaza Dijon", "4 cucharaditas de vinagre de vino blanco", "500ml / 18fl oz de aceite vegetal", "3 huevos de gallinas camperas, hervidos y rallados", "4 chalotes de plátano, finamente picados", "75 g / 2½ oz de pepinillos, picados", "Alcaparras 100 g / 3½ oz, escurridas", "50g / 1¾oz de flatleaf perejil", "1 chalote, finamente picado", "25g / 1oz de mantequilla", "½ cucharadita de sal marina", "Guisantes congelados de 400 g / 14 oz (descongelados)", "3 cucharaditas de azúcar", "100 ml / 3½ fl oz de caldo de pollo, hirviendo", "10 hojas de menta fresca", "8 papas grandes", "aceite vegetal, para freír", "sal", "2 claras de huevo de gallinas camperas", "Harina de auto aumento de 350g / 12oz, más extra para quitar el polvo", "gran pizca de bicarbonato de soda", "340 ml / 12 fl oz de agua con gas (o, si lo prefiere, cerveza)", "1 lomo entero (alternativamente use rodaballo o lenguado), fileteado, pelado y cortado en porciones"], "method": ["Para la salsa tártara, hacer una mayonesa mezclando las yemas de huevo, Dijon y vinagre en una pasta. Poco a poco agregue el aceite vegetal en una corriente delgada, batiendo todo el tiempo. Cuando esté emulsionado, mezcle el resto de los ingredientes. Dejar de lado.", "Para el puré de guisantes, fríe con cuidado la chalota en la mantequilla y la sal en una sartén. Agregue los guisantes y el azúcar, luego vierta el caldo de pollo. Llevar a ebullición y cocinar hasta que los guisantes estén tiernos. Colar, reservar el licor de cocción en una jarra. Transfiera los guisantes y los chalotes a una licuadora, agregue la menta y algunas cucharadas de licor de cocción. Licúe hasta obtener un puré y agregue más licor de cocción según sea necesario. Sazone al gusto con sal y pimienta. Mantener caliente", "Para las patatas fritas, cubra y corte las patatas y córtelas con un sacaleche de manzana (cortado alternativamente en trozos gruesos).", "Poner a hervir una olla de agua con sal y escaldar las virutas hasta que estén blandas, pero manteniendo su forma.", "Retire las virutas con una cuchara ranurada y drene en una bandeja perforada (alternativamente, utilice platos forrados con papel de cocina).", "Llene una freidora con aceite vegetal y precaliéntela a 140C / 284F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Cocine las virutas durante aproximadamente 8-10 minutos, o hasta que el aceite deje de burbujear (lo que significa que se ha eliminado la humedad). Tendrá que hacer esto en lotes a menos que tenga una freidora grande. Retire las virutas con una cuchara ranurada y drene las virutas en una bandeja perforada o platos forrados con papel de cocina.", "Para el pescado machacado, bata las claras de huevo hasta que se formen picos muy suaves cuando se quite el batidor.", "En un recipiente aparte, mezcle la harina, el bicarbonato de sodio y el agua con gas juntos. Agregue la mezcla de clara de huevo. Mezcle para combinar, pero no trabaje demasiado (algunos grumos están bien). Reserve para descansar durante 20 minutos.", "Precaliente la freidora a 180C / 350F. Freír las virutas por segunda vez hasta que estén crujientes y doradas.", "Mientras tanto, espolvoree un poco de harina en un plato poco profundo. Espolvorea las piezas de pescado con la harina, sumérgelas en la masa y fríelas hasta que la masa esté dorada y crujiente (es posible que tengas que hacer esto en tandas).", "Sazone las patatas fritas, al gusto, con sal y sirva inmediatamente con el pescado, el puré de guisantes y la salsa tártara."], "url": "www_bbc_co_uk_food_recipes_fish_and_chips_with_39006", "title": "Pescado y patatas fritas con salsa tártara y puré de guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz de puré de papa frío", "500g / 1lb 2 oz de salmón escalfado", "100 g / 3½ oz de salmón ahumado en caliente", "1 limón, ralladura solamente", "eneldo pequeño racimo", "sal y pimienta negra recién molida", "harina común", "2 huevos de gallinas camperas", "Pan rallado de 100 g / 3½ oz panko", "1 yema de huevo de gallinas camperas", "pizca de sal", "1 cucharadita de mostaza Dijon", "250ml / 9fl oz de aceite de sabor neutro, como girasol o maní", "4 cucharadas de cornichons, escurridos, finamente picados", "3 cucharadas de alcaparras, escurridas, finamente picadas", "algunos recortes de cebollino", "eneldo pequeño, finamente picado", "1 limón, solo jugo", "2 cucharadas de aceite de oliva", "gran perilla de mantequilla", "caviar de salmón, para servir (opcional)"], "method": ["Para las tortas de pescado, ponga el puré de patatas en un bol y rómpalo con un tenedor. Escama en el salmón, luego sazone bien con sal y pimienta y agregue la ralladura de limón y el eneldo. Revuelva bien para combinar: puede usar las manos para esto y luego darle forma de ocho pasteles de pescado. Enfríe en el congelador durante 10 minutos si es posible, solo para reafirmarse antes de cubrirlos.", "Para cubrir, divida la harina común, uno de los huevos y la mitad del pan rallado sobre tres platos. Sumerja las tortas de pescado en cada plato, en ese orden, sacudiendo el exceso sobre la marcha. Esto se vuelve complicado, hazlo en dos lotes. Si tiene tiempo, deje enfriar las croquetas de pescado cubiertas, esta vez en la nevera y durante al menos 20 minutos, preferiblemente más tiempo.", "Para freír, caliente el aceite y la mantequilla en una sartén grande. Freír los pasteles de pescado en cada lado durante unos minutos hasta que hayan desarrollado una buena corteza marrón dorada y los centros estén calientes.", "Para hacer la salsa tártara, ponga la yema de huevo en un tazón o procesador de alimentos con una generosa pizca de sal y la mostaza. Batir o pulso brevemente, luego muy gradualmente comience a agregar el aceite. Cuando tenga una emulsión, puede comenzar a agregar el aceite en una corriente constante, ligeramente más rápida hasta que esté todo incorporado y tenga una mayonesa espesa. Revuelva a través de los ingredientes restantes.", "Sirva los pasteles de pescado con una cucharada de caviar de salmón y la salsa tártara en el lateral."], "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_dill_90632", "title": "Tortas de pescado con salsa tártara de eneldo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600 g / 1 libra de papas medianas de 5 oz (preferiblemente Maris Piper)", "sal marina escamada y pimienta negra recién molida", "Filete de bacalao de 250 g / 9 oz de espesor, sin piel", "Filete de salmón grueso de 250 g / 9oz, sin piel", "Filete de abadejo ahumado 100g / 3½ oz, sin piel", "500ml / 18fl oz de leche entera", "1 hoja de laurel", "½ limón bien fregado, ralladura finamente rallada", "6 cebolletas, cortadas y finamente rebanadas", "Harina normal de 25g / 1oz, para quitar el polvo", "2 huevos grandes de gallinas camperas", "100g / 3½ oz de pan blanco fresco", "75ml / 2½ fl oz de aceite de girasol", "cuñas de limón, para servir", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "leche reservada de cocinar el pescado", "25g / 1oz manojo de hojas rizadas de perejil, tallos resistentes eliminados y hojas finamente picadas"], "method": ["Pele las papas y córtelas en trozos de aproximadamente 3cm / 1¼ pulgadas. Coloque las papas en una olla grande y cúbralas con agua fría. Ponga a hervir el agua y luego reduzca ligeramente el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén suaves pero no se caigan.", "Escurra las papas en un colador y vuelva a la sartén. Aplaste las papas hasta que estén suaves o pase por un ricer de papa. Sazonar bien con sal marina y pimienta negra recién molida, luego extender sobre un plato frío y dejar enfriar.", "Coloque los filetes de pescado en una cacerola grande, con los filetes más gruesos en el fondo de la sartén. Vierta la leche en la sartén, agregue la hoja de laurel y sazone con un poco de sal y un poco de pimienta negra molida.", "Cubra la bandeja con una tapa ajustada y cocine a fuego lento. Inmediatamente, retire la sartén del fuego y déjela reposar durante 10 minutos. Esto terminará de cocinar el pescado e infundir la leche con sabor.", "Después de que se acabe el tiempo, retire con cuidado el pescado de la leche con una espumadera y transfiéralo a un plato. Reserve la leche para hacer la salsa de perejil. Rompe el pescado en trozos grandes, descartando la piel sobre la marcha. Deje que el pescado se enfríe por completo.", "Coloque el puré enfriado en un tazón grande y agregue la ralladura de limón y las cebolletas. Incline el pescado enfriado en el puré y use una cuchara de madera para mezclarlo en el puré, sin romper demasiado el pescado.", "Divida la mezcla en seis bolas. Aplane cada bola hasta aproximadamente 3 cm / 1¼ de grosor y colóquela en una bandeja para hornear forrada con papel de hornear. Coloque la bandeja en el congelador durante aproximadamente 20 minutos para reafirmarla. (Alternativamente, colóquelo en la nevera durante 45 minutos).", "Para cubrir las croquetas de pescado, rocíe la harina para quitar el polvo de un plato. Batir los huevos juntos en un recipiente poco profundo y extender la mitad de las migas de pan sobre un plato grande.", "Sumerja una de las croquetas de pescado en la harina, cubriéndola bien por todos lados. Suavemente toque cualquier exceso de harina antes de mojar la torta de pescado en el huevo, cubriendo todos los lados. Permita que cualquier exceso de huevo gotee fuera de la torta de pescado y luego coloque en el pan rallado. Gire la torta de pescado en las migas y presiónelas firmemente y uniformemente en todos los lados.", "Coloque la torta de pescado en una bandeja llena de pergamino para hornear. Repita el proceso con las croquetas de pescado restantes, reemplazando las migas usadas con las migas de pan reservadas para las tres últimas croquetas de pescado. (Estas croquetas se pueden enfriar en el refrigerador hasta que las necesite, pero se deben usar en 24 horas).", "Para cocinar las croquetas de pescado, precaliente el horno a 200C / 400F / Gas 6. Caliente el aceite en una sartén antiadherente grande. Usando una espátula de metal, coloque con cuidado tres de las croquetas de pescado en la sartén y fría a fuego medio durante tres minutos por cada lado. Gire con cuidado para evitar romperlos.", "Transfiera las primeras tres croquetas de pescado a una bandeja para hornear y fríe las croquetas de pescado restantes exactamente de la misma manera, agregando un poco más de aceite a la sartén si es necesario. Termine de cocinar todas las croquetas de pescado en el horno en la bandeja durante 8-10 minutos o hasta que estén calientes.", "Mientras los pasteles de pescado están en el horno, prepare la salsa de perejil. Derrita la mantequilla en una olla pequeña antiadherente. Poco a poco agregue la harina, revolviendo con una cuchara de madera hasta que se desprenda de los lados de la sartén. Lentamente agregue la leche reservada, revolviendo constantemente con una cuchara de madera para asegurarse de que no tenga grumos.", "Llevar la salsa a fuego lento y cocinar durante tres minutos, o hasta que la salsa se espese y suavice. Retire la sartén del fuego y agregue el perejil. Sazonar con sal y pimienta al gusto. Divida los pasteles de pescado entre seis platos calentados, vierta la salsa y sirva con rodajas de limón para apretar."], "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_parsley_61919", "title": "Pastel de pescado con salsa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400g / 14oz de patatas harinas, cortadas en cubitos", "1 limón, rebanadas gruesas, más un chorrito de jugo de limón", "1 hoja de laurel", "1 cebolla, rebanada gruesa", "300g / 10½oz de filete de salmón deshuesado y sin piel", "300g / 10½oz de abadejo ahumado deshuesado y sin piel", "Gambas tigre crudo de 200 g / 7 oz, pelado y sin piel", "1 cucharada de eneldo fresco finamente picado", "4 cebollas de primavera, cortadas, finamente cortadas", "50g / 1¾oz de mantequilla", "300 g / 10½ oz de acelga arco iris, tallos más grandes eliminados", "1 chalote grande, pelado, finamente cortado", "200ml / 7fl oz de vino blanco", "250g / 9oz de mantequilla fría, cortada en cubos", "exprimir jugo de limón", "2 cucharadas de cebollines frescos finamente picados", "sal marina y pimienta negra recién molida"], "method": ["Hervir las papas en una olla de agua con sal durante 12-15 minutos, o hasta que estén muy tiernas, luego escurrirlas y volver a colocarlas en la sartén. Regrese al fuego por un par de minutos para eliminar el exceso de humedad. Dejar de lado hasta que se enfríe.", "Vierta suficiente agua en una olla para alcanzar los 5 cm por los lados. Agregue el limón, la hoja de laurel y la cebolla y deje que hierva. Agregue los pescados y las gambas y cocine a fuego lento durante 3-4 minutos, o hasta que estén recién cocidos, luego retírelos del fuego y deje que el pescado se enfríe en el líquido de cocción.", "Mientras tanto, para la beurre blanc, caliente la chalota y el vino blanco en una cacerola hasta que burbujee. Reduzca el fuego y cocine a fuego lento hasta que solo quede aproximadamente 50 ml / 2 fl oz líquidas en la sartén.", "Batir la mantequilla, poco a poco, esperando a que la mayor parte de la mantequilla se derrita e incorpore a la mezcla antes de agregar más.", "Una vez que se haya agregado toda la mantequilla, agregue un chorrito de jugo de limón y cuele la mezcla en una olla limpia. Agregue el cebollín y condimente, al gusto, con sal y pimienta negra recién molida. Cubra con film transparente y déjelo a temperatura ambiente hasta que lo necesite.", "Cuando el pescado y las papas estén fríos, vierta el pescado en un tazón grande y descarte la piel y los huesos. Cortar los langostinos y agregarlos al bol. Agregue el eneldo picado y cebollas de primavera y sazone con un chorrito de jugo de limón.", "Agregue las papas y sazone, al gusto, con sal y pimienta negra recién molida. Combine cuidadosamente la mezcla con las manos, teniendo cuidado de no romper demasiado el pescado.", "Forme la mezcla en 6 hamburguesas del mismo tamaño. Enfriar en la nevera en un plato durante 5 minutos.", "Mientras tanto, caliente la mitad de la mantequilla en una sartén a fuego medio hasta que forme espuma. Agregue la acelga y saltee durante 3-4 minutos hasta que se marchite, luego condimente, al gusto, con sal y pimienta negra recién molida. Escurra sobre papel de cocina y luego limpie la sartén con un trozo de papel de cocina y vuelva a ponerlo en el fuego.", "Agregue la mantequilla restante a la sartén. Cuando haga espuma, agregue las tortas de pescado, en lotes si es necesario, y freír durante 2-3 minutos en cada lado, o hasta que estén doradas por ambos lados y calientes por completo.", "Justo antes de servir, retire la película adhesiva de la beurre blanc y caliente.", "Para servir, coloque la acelga en platos para servir, cubra cada porción con una torta de pescado y póngala alrededor del borde."], "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_chive_82130", "title": "Pastel de pescado con cebolleta beurre blanc", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de queso crema claro", "Papas 400 g / 14 oz", "2 x 160 g de latas de atún o salmón, o 320 g / 11½ oz de caballa ahumada", "½ cucharadita de hierbas secas mezcladas", "50g / 1¾oz de cereal de arroz inflado (como Rice Krispies)", "1 huevo de gallinas camperas", "2 cucharadas de harina normal", "petróleo", "sal y pimienta", "750 g / 1 libra de batatas de 10 onzas, limpias"], "method": ["Precalienta el horno a 200C / 180C / Gas 6. Saca el queso crema del refrigerador y ponlo a un lado para que alcance la temperatura ambiente.", "Pele las papas y luego córtelas en trozos del mismo tamaño. Ponga a hervir una olla de agua y agregue las papas, hierva hasta que estén tiernas y luego escurra. Regrese a la cacerola y deje de calentar para que se seque al vapor durante 5 minutos. Una vez seco, machaque las papas hasta que se rompan por completo pero no completamente lisas. Deja enfriar.", "Escurrir las latas de pescado y agregar el contenido al puré de patatas junto con las hierbas secas y el queso crema. Condimentar con sal y pimienta.", "Forme la mezcla en 4 bolas grandes u 8 bolas más pequeñas. Aplaste estas bolas en formas de pastel de pescado, cúbralas y colóquelas en la nevera mientras prepara las batatas fritas. (Pueden almacenarse en el refrigerador hasta por 2 días en este punto si desea prepararlos con anticipación).", "Para hacer las papas fritas, corte las batatas en forma de chips de aproximadamente 1 cm / ½ pulgadas de grosor y siempre que la batata sea larga. Poner en un recipiente y echar con 1 cucharada de aceite.", "Coloque las batatas fritas en una bandeja para hornear y hornee durante 10 minutos mientras prepara las croquetas de pescado.", "Pon el cereal de arroz en una bolsa de congelador y aplástalo para hacer trozos de pan de migas. Es posible que le resulte más fácil usar un rodillo para enrollar la bolsa, rompiendo el cereal en su interior.", "Pon el huevo en un recipiente poco profundo y bate. Agregue la harina a un recipiente poco profundo separado y el cereal de arroz desmenuzado a un recipiente más superficial. Saque los pasteles de pescado de la nevera y sumérjalos, uno por uno, en la harina, sacuda el exceso y sumérjalo en el huevo, asegurándose de que todos los lados estén cubiertos. Finalmente sumerja en el cereal triturado, presionando las migas de cereal contra las tortas de pescado y asegurándose de que todos los lados estén completamente cubiertos.", "Engrase el fondo de una bandeja para hornear con un poco de aceite y coloque las tortas de pescado en la bandeja. Suavemente gírelos en el aceite para que ambos lados estén cubiertos.", "Coloque la bandeja de pasteles de pescado en el horno después de que las papas fritas hayan estado ahí por 10 minutos. Hornea todos juntos por 10 minutos más y luego gira cuidadosamente las croquetas de pescado y las papas fritas. Hornee durante 10 minutos o hasta que las crocantes estén crujientes, doradas y calientes hasta el final.", "Sirve los pasteles de pescado calientes con las batatas fritas a los lados."], "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_sweet_04563", "title": "Tortas de pescado con batatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_cakes_with_sweet_04563_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de girasol o aceite de colza", "2 x 2.5cm / 1in pieza canela en rama", "2 chiles rojos secos enteros grandes, partidos en tres o cuatro pedazos (sin semillas, si le gusta)", "3-4 clavos de olor (opcional)", "2 cebollas pequeñas, finamente picadas", "1 cucharada colmada de jengibre y pasta de ajo (o 4 dientes de ajo, triturados y 2 cucharaditas de jengibre fresco rallado)", "4-5 tomates picados (o un 400g / 14oz de tomates picados)", "1 cucharada de vinagre de malta", "1 cucharada de azúcar morena o azúcar mascabado", "½ cucharadita de pasta de tamarindo (opcional)", "sal al gusto", "Filete de pescado blanco 250g / 9oz, pelado", "1 chile verde grande, finamente picado", "Jengibre fresco de 2.5cm / 1 en pieza, finamente picado", "6-8 dientes de ajo, finamente picados", "2 cucharadas de hojas de cilantro picado", "1 cucharadita de sal, o al gusto", "1 cucharada de jugo de limón", "1 huevo de gallinas camperas", "2 rebanadas de pan blanco, remojado brevemente en agua y exprimido", "sal y pimienta", "Harina normal de 100 g / 3½ oz", "2-3 huevos de gallinas camperas", "aceite, para freír poco"], "method": ["Para la salsa de tomate, caliente el aceite en una cacerola de base pesada o en una cazuela a prueba de fuego, a fuego medio. Agregue los palitos de canela y fría hasta que estén de color marrón oscuro e hinchados, pero no quemados. Agregue los chiles rojos y los clavos de olor (si los está usando) y, después de unos 20 segundos, agregue las cebollas picadas. Freír suavemente durante 3-4 minutos o hasta que estén suaves pero no dorados. Agregue el jengibre y la pasta de ajo y freír durante un minuto más o menos.", "Agregue los tomates, el vinagre, el azúcar morena (o el azúcar mascabado) y el tamarindo, si los está usando. Cubra parcialmente y cocine a fuego lento durante 15-20 minutos, revolviendo de vez en cuando, hasta que quede pulposo. Sazone al gusto con sal, retire del fuego y reserve.", "Para las croquetas de pescado, si tiene una picadora de carne o un procesador de alimentos en casa, es fácil picar el pescado. Si no, entonces puede cortar los filetes y con una cuchilla o un cuchillo grande. Pica varias veces como si estuvieras cortando perejil hasta obtener una picadita fina.", "En un procesador de alimentos, mezcle el chile, el jengibre, el ajo y el cilantro con el pescado y mezcle hasta obtener una pasta áspera.", "Agregue la sal, el jugo de limón y el huevo y mezcle bien. Finalmente trabaje en el pan bien exprimido. El pan es para estabilizar la mezcla y si encuentra que es demasiado suave, remoje y exprima otra o dos rebanadas hasta que tenga una mezcla lo suficientemente firme como para formar bolas sin pegarse a sus palmas.", "Para verificar el condimento, freír una pieza pequeña de la mezcla y el sabor. Sazonar con sal y pimienta, al gusto. Cuando esté contento con él, divida la mezcla en bolas de tamaño uniforme dependiendo del tamaño que prefiera. Es posible que les gusten grandes si comen como plato principal o pequeños si sirven como refrigerio.", "Calienta aproximadamente 5 mm / ¼ en aceite en una sartén honda. Extiende la harina en una bandeja plana lo suficientemente grande como para tomar todas las bolas a la vez y batir los huevos en un plato poco profundo.", "Aplane cada bola hasta aproximadamente 1 cm / ½ de espesor. Alise los bordes para que no sean dentados o desiguales. Cubra la harina y los huevos batidos, drenando cualquier exceso. Si el huevo está bien batido, obtendrás una buena textura con volantes.", "Freír las tortas en lotes durante 2-3 minutos en cada lado, o hasta que estén doradas. Escurrir en un plato forrado con papel de cocina. Retire la canela y los clavos de olor (si los usa) de la salsa y recaliéntelos, si los sirve en caliente.", "Sirva los pasteles de pescado calientes o fríos con la salsa."], "url": "www_bbc_co_uk_food_recipes_fish_cakes_with_tomato_22086", "title": "Pastel de pescado con salsa de tomate (Machchi na cutlass)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cebolla grande, finamente rebanada", "2 chiles con ojos de ave, cortados en rodajas finas", "1 cucharadita de harina común", "2 cucharadas de curry en polvo", "150ml / 5fl oz de crema doble", "200ml / 7fl oz de caldo de pollo", "4 cucharadas de hojas de cilantro fresco finamente picado", "½ limón, solo jugo", "aceite vegetal, para freír", "15 g / ½ oz de levadura fresca", "azúcar pizca", "300ml / 10fl oz de cerveza", "1 cucharadita de vinagre de sidra", "Harina normal de 200g / 7oz", "pizca de sal", "1 x 400 g / 14 oz enteros de Dover, fileteados", "Patatas fritas de 300g / 10½oz, peladas y cortadas en palos de 1cm / ½ in", "½ limón, cortado en trozos, para servir"], "method": ["Para la salsa de curry, caliente una sartén grande hasta que esté caliente, agregue la mantequilla, la cebolla y los chiles y cocine por 10 minutos, o hasta que estén dorados y suaves.", "Agregue la harina común y el polvo de curry y cocine por un par de minutos.", "Agregue la crema y el caldo de pollo, vuelva a hervir a fuego lento y cocine durante 5-10 minutos.", "Sazonar, al gusto, con sal y pimienta negra recién molida. Revuelva a través del cilantro y termine con el jugo de limón.", "Para el pescado y las patatas fritas, precaliente una freidora a 190C / 375F. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Mientras tanto, espolvorea la levadura y el azúcar en un tazón. Vierta la cerveza y el vinagre y mezcle la harina y la sal. Dejar fermentar - está listo para usar cuando la mezcla comience a burbujear.", "Sumerja los filetes de lenguado en la masa y fríalos hasta que estén dorados y cocidos - aproximadamente 3-4 minutos. Retire con una espumadera y escurra sobre papel de cocina.", "Agregue las papas a la freidora y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina. Sazonar con un poco de sal.", "Sirva el pescado y las patatas fritas en platos para servir con la salsa de curry en una jarra. Vierta la salsa sobre el pescado y las patatas fritas justo antes de servir."], "url": "www_bbc_co_uk_food_recipes_fish_chips_and_curry_07304", "title": "Pescado, patatas fritas y salsa de curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de merluza o abadejo de 500 g / 1 lb 2 oz", "1 cucharada de salsa de pescado", "pizca de azúcar en polvo", "pizca de pimienta blanca", "1 rodaja fina de galangal", "pizca de cáscara de lima kaffir", "2 raíz de cilantro (no tallo)", "2 dientes de ajo, pelados", "4 chiles rojos a la vista de pájaro", "1 chile rojo largo", "3 cucharadas de jugo de lima", "1 cucharada de azúcar de palma", "2 cucharadas de salsa de pescado", "1 mandarina, solo jugo", "1 mango verde, pelado, sin hueso y en rodajas finas", "2 cucharadas de chalotes tailandeses, pelados y picados", "gran pizca cortada lemongrass", "pellizcar hojas de lima kaffir finamente cortadas", "gran pizca de hojas de menta picadas", "gran pizca hojas de cilantro picado", "1 cucharada de maní tostado, con la piel puesta"], "method": ["Para las nubes de pescado, precaliente la parrilla a temperatura media y precaliente el horno a 100 ° C / 80 ° Ventilador / Gas 1.", "Frote los filetes de pescado generosamente con salsa de pescado, espolvoree con azúcar y una pizca de pimienta. Grill durante 10-12 minutos, hasta que esté cocido.", "Retire la piel y desmenuce el pescado cocido sobre la bandeja del horno. Hornee, esponje y revuelva regularmente, hasta que estén esponjosos y algo secos. Esto tomará alrededor de 1 hora.", "Pulse el pescado en un procesador de alimentos hasta bastante fino.", "Precaliente una freidora a 170 ° C (PRECAUCIÓN: no lo deje sin supervisión. El aceite caliente puede ser peligroso). Freír los puñados del pescado con una cuchara ranurada para unirlos en cuatro nubes (es posible que tenga que hacerlo por lotes). Cocine hasta que se dore en color, esto tomará 1 minuto. Escurra sobre papel de cocina y manténgalo caliente hasta que esté listo para servir.", "Para el aderezo, machaque la galanga y la ralladura de kaffir en un almirez y mortero, luego agregue la raíz de cilantro, los dientes de ajo, los chiles y el jugo de lima. Continúa golpeando y mezcla el azúcar, la salsa de pescado y el jugo de mandarina. Debe saber caliente, agrio, dulce y salado. Para comprobar que el equilibrio es correcto, pruébalo con el mango verde (para la ensalada) y modifica los ingredientes si es necesario.", "Para la ensalada, mezcle todos los ingredientes en un tazón grande. Mezcle con el aderezo.", "Para servir, en cuatro cuencos, divide una nube de peces por la mitad y apílala sobre sí misma. Coloque una ensalada vestida sobre la nube de pescado. Vierta cualquier aderezo restante en el fondo de los tazones."], "url": "www_bbc_co_uk_food_recipes_fish_cloud_with_green_87926", "title": "Nube de pescado con ensalada de mango verde (Yum pla foo)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "35 g / 1¼ oz de mantequilla", "sal y pimienta negra recién molida", "3 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de sidra", "300ml / 10½ fl oz aceite de colza", "50g / 1¾oz de alcaparras", "100g / 3½ oz de pepinillos, picados", "½ chalota, finamente picada", "1 manojo pequeño de eneldo fresco, picado", "2 cucharadas de perejil de flatleaf fresco picado", "½ limón, solo jugo", "aceite vegetal, para freír", "15 g / ½ oz de levadura fresca", "azúcar pizca", "300ml / 10½fl oz de cerveza", "1 cucharadita de vinagre de sidra", "Harina normal de 200g / 7oz", "pizca de sal", "1 filete entero de bacalao, cortado en dos", "Patatas fritas de 300g / 10½oz, peladas y cortadas en palitos de 2cm / ½ in", "½ limón, cortado en trozos, para servir"], "method": ["Para los guisantes blandos, remoje los guisantes durante al menos cuatro horas en un recipiente grande con tres veces su volumen de agua y el bicarbonato de soda, o, si tiene tiempo, toda la noche.", "Escurra los guisantes, enjuague con agua fría y colóquelos en una sartén grande con tapa. Cubra con agua (aproximadamente 2,5 cm / 1 pulgada por encima de los guisantes), cubra con una tapa y deje que hierva. Reduzca el fuego y cocine a fuego lento los guisantes durante 1½-2 horas, revolviendo de vez en cuando. Los guisantes deben ser suaves y de textura blanda pero no demasiado secos. Si están mojados, continúe cocinando sobre el fuego con la tapa apagada hasta que se sequen un poco. Batir la mantequilla y sazonar con sal y pimienta negra recién molida.", "Para la salsa tártara, mezcle las yemas de huevo, la mostaza y el vinagre en un bol.", "Continúe batiendo la mezcla y vierta lentamente el aceite de colza hasta que se incorpore todo el aceite y la mezcla sea espesa y ligera.", "Agregue las alcaparras, pepinillos, chalotes y hierbas. Sazonar, al gusto, con sal y pimienta negra recién molida y un chorrito de jugo de limón. Guarde en el refrigerador hasta que esté listo para servir.", "Para el pescado y las patatas fritas, precaliente una freidora a 190C / 375F. Mientras tanto, espolvorea la levadura y el azúcar en un tazón. Vierta la cerveza y el vinagre y mezcle la harina y la sal. Dejar fermentar - está listo para usar cuando la mezcla comience a burbujear.", "Coloque un recipiente de vapor en la cocina y coloque las papas picadas en el horno a vapor y cocine durante 4-5 minutos. Retire y deje secar.", "Sumerja los filetes de bacalao en la mezcla y fríalos hasta que estén dorados y cocidos - aproximadamente 3-4 minutos. Retire con una espumadera y escurra sobre papel de cocina.", "Agregue las papas a la freidora y fríe durante 3-4 minutos, o hasta que estén doradas y crujientes. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina. Sazonar con un poco de sal.", "Sirve el pescado y las patatas fritas con la salsa tártara y los guisantes blandos."], "url": "www_bbc_co_uk_food_recipes_fish_chips_mushy_peas_33132", "title": "Pescado, patatas fritas, guisantes blandos y salsa tártara", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de girasol", "2 cebollas grandes, finamente picadas", "4 dientes de ajo, aplastados", "4cm / 1½en raíz fresca de jengibre, finamente rallada", "1 cucharadita de cilantro molido", "2 cucharaditas de sal masala", "10 hojas de curry", "2-3 cucharadas de azúcar de palma (disponible en comestibles asiáticos) o azúcar moreno claro", "400 g de leche de coco con estaño", "3 limas, solo jugo", "5 tomates madurados en la vid, picados y mezclados", "Filete de salmón sin piel de 700g / 1lb 9oz, cortado en pedazos de 2 cm / ¾ pulgadas de ancho de los dedos", "3 cucharadas de coco cremoso rallado, para adornar", "puñado de cilantro fresco, picado, para adornar", "arroz basmati recién cocido al vapor, para servir (opcional)"], "method": ["Caliente el aceite en una cacerola de fondo grueso a fuego lento. Agregue las cebollas y fría por 15 minutos, o hasta que estén suaves y empiecen a dorarse.", "Agregue el ajo, jengibre, cilantro molido, garam masala y hojas de curry y cocine por 1 minuto. Agregue el azúcar de palma, la leche de coco, el jugo de lima y los tomates mezclados y cocínelos durante 10-15 minutos o hasta que estén ligeramente reducidos.", "Agregue el salmón y cocine suavemente durante 5-6 minutos.", "Sirva con arroz basmati cocido al vapor si lo desea, adornado con crema de coco y cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_fish_curry_98168", "title": "Pescado al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_curry_98168_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["240g / 9oz de cuscús", "1 cucharada de mantequilla", "½ cucharadita de sal", "1 limón, ralladura solamente", "700g / 1lb 9 oz de tilapia sin piel o filetes de pescado blanco, descongelados si se congelan, cortados en trozos grandes", "1 cucharadita de pimentón", "1 cucharadita de cúrcuma molida", "3 cucharadas de aceite de oliva", "3 dientes de ajo, aplastados", "1 cebolla pequeña, pelada y finamente picada", "1 chile verde pequeño, finamente picado (sin semillas si quieres menos calor)", "½ cucharadita de sal", "½ cucharadita de comino molido", "1 cucharadita de cilantro molido", "85g / 3oz de berros, finamente picados", "gran puñado de brotes de guisante o micro hierbas, para adornar", "1 limón, cortado en cuñas"], "method": ["Para hacer el cuscús de limón, ponga el cuscús en un tazón grande y cúbralo con agua hirviendo a 1 cm / ½ pulgada por encima del nivel de cuscús. Agregue la mantequilla, luego cubra bien con film transparente y déjelo a un lado durante 20 minutos.", "Para hacer el curry, coloque el pescado en un tazón y espolvoree sobre el pimentón y ½ cucharadita de cúrcuma. Agregue una pizca de sal y mezcle bien para cubrir el pescado.", "Calentar el aceite en una sartén antiadherente con tapa grande a fuego medio-alto y freír el pescado durante 3-4 minutos en cada lado, hasta que esté completamente dorado y dorado. Retire el pescado de la sartén y déjelo a un lado para mantenerlo caliente.", "Agregue el ajo, la cebolla, el chile y la sal en la misma sartén y cocínelos durante 5 minutos a fuego medio o bajo, hasta que la cebolla se haya suavizado. Agregue la cúrcuma, el comino y el cilantro y cocine por unos minutos más. Agregue 200ml / 7fl oz de agua y deje cocinar suavemente a fuego lento por unos minutos más. Agregue el berro, luego cubra la olla y cocine por 2 minutos, hasta que se haya marchitado. Regrese el pescado y los jugos de reposo a la sartén y mezcle suavemente, lo suficiente como para calentar al pescado.", "Mientras tanto, retire la película adhesiva del cuscús y esponje con un tenedor. Agregue la ralladura de limón y la sal y mezcle bien.", "Sirva el curry con el cuscús en un lado, adornado con brotes de guisantes o micro hierbas y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_fish_curry_with_84873", "title": "Pescado al curry con berros y cuscús de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dedos de pez", "Tomates 150g / 5½ oz, picados", "½ cucharadita de aceite de oliva", "¼ de cebolla (25g / 1oz de peso pelado), finamente picada", "pellizcar copos de chile rojo seco", "sal y pimienta negra recién molida, al gusto", "cilantro fresco, finamente picado (opcional)"], "method": ["Precalentar la parrilla a fuego medio. Ase los dedos de pescado de acuerdo con las instrucciones del paquete.", "Mientras tanto, mezcle todos los ingredientes de la salsa en un tazón y sirva junto con los dedos de pescado."], "url": "www_bbc_co_uk_food_recipes_fish_fingers_with_tomato_13687", "title": "Dedos de pescado con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 solla de lenguado o limón, fileteada, pelada y cortada en tiras", "Harina normal de 75 g / 2½ oz", "2 huevos de gallinas camperas", "Pan rallado de 150 g / 5½ oz panko", "3 yemas de huevo de gallinas camperas", "2 cucharadas de vinagre de sidra", "300ml / 10 fl oz aceite de colza", "110g / 4oz alcaparras", "150 g / 5½ oz de pepinillos, picados", "½ chalota, finamente picada", "1 manojo pequeño de eneldo fresco, picado", "2 cucharadas de perejil de flatleaf fresco picado", "1 limón, cortado en cuñas, para servir", "sal y pimienta negra recién molida"], "method": ["Para el pescado, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena de aceite vegetal. Caliente el aceite a 190 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando la deje caer (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvorea la harina en un plato. Batir los huevos en un tazón. Espolvorear las migas de pan panko en un plato separado. Se draga el pescado en harina, se desempolva cualquier exceso, luego se sumerge en el huevo, luego se rueda en el pan rallado hasta que se cubra.", "Cocine en la freidora por 2-3 minutos hasta que se doren.", "Para la salsa tártara, mezcle las yemas de huevo y el vinagre en un tazón.", "Continúe batiendo la mezcla y vierta lentamente el aceite de colza hasta que se incorpore todo el aceite y la mezcla sea espesa y ligera.", "Agregue las alcaparras, pepinillos, chalotes y hierbas. Sazonar, al gusto, con sal y pimienta y un chorrito de jugo de limón.", "Sirva los goujons de pescado con salsa tártara y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_fish_goujons_and_tartare_10220", "title": "Tacos de pescado y salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["375g / 13oz de mantequilla sin sal", "Harina normal de 375g / 13oz", "3 litros / 5¼ pintas de leche entera", "gran manojo de perejil rizado fresco, finamente picado", "sal marina y pimienta negra recién molida", "Filetes de lingotes de 6 kg / 13 lb, piel en"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Hacer la salsa de perejil, derretir la mantequilla en una olla grande. Agregue la harina, cocine por 2-3 minutos y luego agregue lentamente la leche a la sartén, batiendo continuamente, hasta que tenga una salsa blanca espesa.", "Agregue el perejil y cocine por otros cinco minutos. Sazonar con sal y pimienta negra recién molida.", "Mientras tanto, coloque el pescado en bandejas grandes para hornear forradas con papel resistente a la grasa. Sazonar con sal y pimienta negra recién molida y poner en el horno durante 7-10 minutos o hasta que el pescado esté bien cocido. (Puede que tenga que hacer esto en lotes).", "Para servir, coloque el pescado en el plato y vierta sobre la salsa de perejil."], "url": "www_bbc_co_uk_food_recipes_fish_in_parsley_sauce_44734", "title": "Pescado en salsa de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas en grano de 900g / 2lb, peladas y cortadas en trozos", "100 g / 3½ oz de mantequilla", "100ml / 3½ fl oz de leche", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas", "600ml / 21fl de leche en oz", "1 hoja de laurel", "1 puerro, finamente picado", "Filete de abadejo ahumado 100 g / 3½ oz, pelado", "Filete de salmón 200g / 7oz, desollado", "50g / 1¾oz de mantequilla", "50g / 1¾oz de harina natural", "2 filetes de anchoa", "1 caballa entera ahumada, en copos", "300g / 10½oz de gambas cocidas", "4 vieiras, limpias, huevas eliminadas", "Queso Edam 100 g / 3½ oz, rallado"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer el puré, hervir las papas en una olla grande de agua con sal hasta que estén tiernas. Escurra, devuelva las papas a la sartén y revuelva con la mantequilla y la leche. Temporada.", "Para hacer el relleno, cocine los huevos en agua hirviendo durante 10 minutos. Enfriar con agua corriente, luego pelar y trinchar.", "Caliente la leche, la bahía y el puerro en una sartén ancha. Agregue el eglefino y el salmón y cocine a fuego lento suavemente durante 5 minutos y luego retire, reservando la leche infundida.", "Derrita la mantequilla en una sartén y gradualmente agregue la harina, revolviendo, hasta que tenga una pasta. Vierta la leche infundida, batiendo constantemente, hasta que tenga una salsa suave. Agregue la anchoa y la temporada.", "Escamas en el salmón, el eglefino y la caballa. Agregue los langostinos y las vieiras y transfiera a un plato de tarta. Coloca los cuartos del huevo sobre la parte superior.", "Cubra con puré de patatas, esparza con el queso Edam y hornee por 20 minutos, o hasta que estén doradas y burbujeantes."], "url": "www_bbc_co_uk_food_recipes_fish_pie_27557", "title": "Pastel de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de papas harinosas, cortadas en trozos", "300 g / 10½ oz Gruyère, rallado", "sal y pimienta negra recién molida", "2 huevos de gallinas camperas", "Filete de abadejo ahumado de 300 g / 10½ oz, despellejado y deshuesado", "150g / 5½oz de gambas crudas, conchas eliminadas", "6 cangrejos cocidos, conchas eliminadas", "3 sardinas, evisceradas y limpiadas", "1 cola pequeña de rape, sin lomo", "500ml / 18fl oz de leche entera", "1 cebolla, partida por la mitad", "1 hoja de laurel", "30g / 1oz de mantequilla sin sal", "2 chalotes de plátano, finamente picados", "50ml / 2fl oz de vermut", "Harina normal de 30g / 1oz", "½ manojo de eneldo fresco, aproximadamente picado", "½ manojo de perejil fresco, más o menos picado", "½ manojo de cebollín fresco, cortado"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Para hacer el relleno, cocine las papas en agua hirviendo con sal durante 15-20 minutos o hasta que estén cocidas. Escurrir bien y macerar.", "Para hacer el relleno, pon los huevos en una olla de agua y lleva a ebullición. Baje la temperatura y hierva por 8 minutos. Retire de la sartén con una espumadera y déjelo enfriar. Pelar y cortar por la mitad.", "Mientras tanto, ponga el eglefino ahumado, las gambas, el cangrejo de río, las sardinas, el rape, la leche, la cebolla y la bahía en una sartén y cocine a fuego lento. Cueza el pescado por unos minutos. Sácala con una espumadera y divide el eglefino y el rape en trozos grandes, luego aparta. Colar la leche en una jarra y reservar.", "Añadir suficiente de la leche furtiva a las patatas para hacer un puré grueso. Mezcle en el Gruyère. Sazonar y apartar.", "Para hacer la salsa, caliente una sartén mediana, agregue la mantequilla y caliente hasta que se derrita. Agregue los chalotes y cocine hasta que estén blandos. Vierta el vermut y reduzca a la mitad. Incline la harina, mezcle bien y cocine por un minuto. Agregue la mayor parte de la leche de caza furtiva reservada y cocine a fuego lento durante unos minutos. Retire del fuego y agregue el eglefino ahumado, el rape y las hierbas.", "Coloque las gambas y la mitad de los cangrejos en un molde para hornear a prueba de horno de 23 cm / 9 pulgadas. Cubra con los huevos, luego la salsa y el pescado blanco. Finalmente, cuchara sobre el puré y pega el resto del cangrejo de río y las sardinas en la parte superior, mostrando las cabezas y las colas.", "Hornee durante 20-30 minutos, o hasta que estén dorados y burbujeantes. Servir."], "url": "www_bbc_co_uk_food_recipes_fish_pie_84774", "title": "Pastel de pescado", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5-6 papas para hornear grandes", "1 cucharada de aceite vegetal", "puñado de sal de roca", "Mejillones 200g / 7oz", "150ml / 5fl oz de vino blanco", "1 cebolla, finamente rebanada", "½ cucharadita de pimienta negra", "2 hojas de laurel", "500g / 1lb 2oz de eglefino ahumado deshuesado y sin piel", "Salmón 400g / 14oz, huesos y piel eliminados", "Bacalao de 400g / 14oz, huesos y piel eliminados", "200g / 7oz de mantequilla", "3 cucharadas de harina normal", "475 ml / 17 fl oz de leche", "1 limón, ralladura y jugo", "4 cucharadas de perejil plano de hojas picadas", "250g / 9oz de gambas peladas cocidas", "1 langosta cocida, sin carne", "150g / 5½oz de queso cheddar fuerte, rallado", "Guisantes 200 g / 7 oz", "50g / 1¾ de mantequilla sin sal", "sal y pimienta"], "method": ["Para el pastel de pescado, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Pinche las papas con un tenedor y frote con un poco de aceite. Espolvoree una bandeja de asar con la sal de roca y coloque las papas encima. Hornee durante 1-1½ horas o hasta que estén tiernas.", "Limpia los mejillones en agua corriente. Deseche cualquier mejillón abierto que no se cierre cuando se le da un golpecito fuerte. Pon una cacerola grande a fuego alto. Agregue los mejillones y el vino blanco, cubra con una tapa y cocine por 2-3 minutos, o hasta que los mejillones se hayan abierto. Cuele y deseche los mejillones que no se hayan abierto (mantenga el licor de cocción). Elige los mejillones de sus conchas.", "Mientras tanto, llene a medias una sartén grande con agua y cocine a fuego lento. Agregue la cebolla, los granos de pimienta negra, las hojas de laurel y todos los pescados. Cueza durante 3-4 minutos, luego levante el pescado de la sartén con una espumadera y déjelo a un lado. Cuele el caldo de pescado a través de un tamiz suspendido sobre un recipiente grande. Reserve el caldo colado y deseche la cebolla, las hojas de laurel y los granos de pimienta.", "Derretir 100 g / 3½ oz de la mantequilla en una cacerola a fuego medio. Batir la harina para formar una pasta suave, luego cocinar por 1-2 minutos más.", "Batir en 50 ml / 2 fl oz de la leche hasta que se incorpore por completo en la salsa. Continúe agregando 350 ml / 12 fl oz de la leche restante poco a poco, batiendo después de cada adición, hasta que la salsa esté suave y espesa. Agregue 500ml / 18fl oz del caldo de pescado y el licor de los mejillones, revuelva bien y cocine durante 4-5 minutos, o hasta que la salsa esté suave y lo suficientemente gruesa como para cubrir la parte posterior de una cuchara. (Cualquier reserva de pescado restante puede enfriarse y congelarse para usar en otro plato).", "Agregue la ralladura de limón, el jugo y el perejil, luego sazone con sal y pimienta. Retire del fuego. Revuelva las gambas y la carne de langosta en la salsa, luego vierta en el pescado escalfado, manteniéndolo en pedazos bastante grandes. Transfiera el relleno del pastel a un plato grande a prueba de horno.", "Cuando las papas estén cocidas, quítelas del horno y aumente la temperatura del horno a 220 C / 200 C Fan / Gas 7.", "Cortar las papas por la mitad, sacar la carne y pasarla a través de un ricer de patata en una sartén a fuego medio. Agregue 75 g / 2½ oz de la mantequilla y el resto de leche de 75 ml / 2½ fl oz a las patatas y bata el fuego hasta que el puré esté suave, espeso y no demasiado blando.", "Con una cuchara, coloca el puré en una manga pastelera con una gran boquilla en forma de estrella y coloca el puré de patatas sobre el relleno de la empanada de pescado. (Alternativamente, simplemente extienda el puré de patatas sobre el relleno). Espolvoree sobre el queso rallado.", "Coloque el plato a prueba de horno en una bandeja para hornear y hornee por 5-10 minutos, o hasta que el queso y las papas estén doradas y el pastel esté bien caliente.", "Mientras tanto, ponga a hervir un sartén con agua con sal, agregue los guisantes y cocine por 2-3 minutos hasta que estén tiernos. Escurra bien y regrese a la sartén, agregue la mantequilla y sazone con sal y pimienta. Sirve el pastel de pescado con los guisantes al lado."], "url": "www_bbc_co_uk_food_recipes_fish_pie_with_garden_36257", "title": "Pastel de pescado con guisantes de jardín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, más extra para engrasar", "1 puerro, en rodajas finas o picado", "50g / 1¾oz de harina", "600ml / 20fl oz de leche caliente", "2 cucharadas de eneldo fresco picado", "2 cucharadas de jugo de limón", "Eglefino fresco de 350g / 12oz, desollado y cortado en cubos de igual tamaño", "Eglefino ahumado sin teñir 350g / 12oz, pelado y cortado en cubos de igual tamaño", "3 huevos duros, cada uno cortado en 4 u 8 cuñas", "1 pan blanco pequeño (400g / 14oz) de pan (alrededor de 2-3 días de antigüedad)", "50g / 1¾oz de queso crema con alto contenido de grasa", "75 g / 2½ oz de mantequilla", "Cheddar maduro de 75 g / 2½ oz, rallado", "1 clara de huevo grande de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Engrase un plato a prueba de horno de base ancha de 1.5 litros / 2½ pinta con mantequilla.", "Para hacer la tarta de pescado, derrita la mantequilla en una cacerola, agregue los puerros y ablande suavemente a fuego lento hasta que esté completamente tierna pero no coloreada.", "Espolvorea la harina y revuelve a fuego alto durante un minuto. Poco a poco vierta la leche caliente, revolviendo todo el tiempo hasta que la salsa esté suave, espesa y haya llegado a ebullición. Retire del fuego y agregue el eneldo picado, jugo de limón, pescado y sazone con sal y pimienta. Cocine por dos minutos, revolviendo. Retire del fuego.", "Cuchara en un plato a prueba de horno de base ancha de 1.5 litros / 2½ pinta. Coloque los huevos encima de la salsa y presione suavemente. Nivela la parte superior y deja de lado hasta que esté frío. Cubra con film transparente y deje enfriar en la nevera durante aproximadamente una hora o hasta que esté firme.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer el soufflé relleno, quite las cortezas del pan y deseche. Cortar en cinco rebanadas y luego cortar cada rebanada en cubos pequeños (alrededor de 1,5 cm / across pulgadas de ancho). Necesitará 150 g / 5½ oz de cubos de pan.", "Agregue el queso crema, la mantequilla y el queso cheddar a una cacerola, derrita a fuego lento hasta que se vuelva líquido (la mezcla puede parecer cuajada, pero no se preocupe). Dejar de lado por un momento.", "En un tazón impecablemente limpio, bata la clara de huevo hasta que se formen picos rígidos cuando se quite la batidora. Dobla los huevos blancos en la mezcla de queso. Sazonar con sal y pimienta y revolver cuidadosamente. Agregue los cubos de pan para que queden todos cubiertos en la mezcla. Cuchara sobre la mezcla de pescado refrigerado para que los cubos estén en una sola capa.", "Hornee en el horno durante 25-30 minutos hasta que estén dorados y burbujeantes. Si se está poniendo demasiado marrón, cúbralo con papel de aluminio y continúe horneando.", "Deje reposar durante cinco minutos y luego sirva con ensalada o vegetales verdes."], "url": "www_bbc_co_uk_food_recipes_fish_pie_with_souffl_57249", "title": "Pastel de pescado con relleno de cuscurrón soufflé", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_pie_with_souffl_57249_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 kg / 4 lb 8 oz filetes de pescado fresco y mariscos, como salmonetes, lenguado, perca, rape, lubina, pulpo bebé, langostinos, mejillones, calamar o vieiras", "8 cucharadas de aceite de oliva, más extra para lloviznar", "1 cebolla grande, finamente rebanada", "2 dientes de ajo, finamente picados, más un diente extra para la tostada", "1 kg / 2 lb 4 oz tomates maduros, desollados y picados, o 2x400 g / 14 oz latas de tomates picados", "125ml / 4fl oz de vino tinto", "chile fresco picado, al gusto", "3 cucharadas de perejil de flatillo finamente picado", "½ cucharadita de semillas de hinojo", "sal y pimienta negra recién molida", "6-8 rebanadas de pan bueno, ligeramente rancio o tostado"], "method": ["Si su pescadero aún no lo ha hecho, limpie y prepare los pescados y mariscos elegidos. Corte los filetes de pescado en trozos grandes y mariscos en trozos manejables.", "Pon el aceite, la cebolla y el ajo en una sartén grande y freír brevemente.", "Agregue los tomates, el vino, el chile, el perejil y las semillas de hinojo y sazone con sal y pimienta. Cocine por 15 minutos.", "Comience por agregar grandes trozos de pescado a la salsa primero y los que le tomarán más tiempo para cocinar, como el rape, luego agregue los pescados más tiernos, como el salmonete o el lenguado, y los mariscos, que terminan con los mejillones si los usa. Cocine durante cinco o más minutos, o hasta que el pescado esté cocido y los mejillones se hayan abierto. (Deseche cualquier mejillón que no se haya abierto).", "Frote el pan con ajo, rocíe con aceite de oliva, y ponga cada rebanada en el fondo de un plato hondo. Vierta sobre la sopa y sirva."], "url": "www_bbc_co_uk_food_recipes_fish_soup-stew_79327", "title": "Guiso de sopa de pescado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup-stew_79327_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla, pelada, más o menos picada", "2 chalotes de plátano, pelados, más o menos picados", "1 bulbo de hinojo, cortado, toscamente picado", "4 dientes de ajo", "Huesos de pescado de 2 kg / 4 lb 4 oz (si utiliza cabezas de pescado, pídale a su pescadero que quite las branquias)", "300g / 10½oz gambas y cabezas de gambas", "2 cucharadas de puré de tomate secado al sol", "400g / 14oz de tomates picados enlatados", "500g / 1lb 2oz pasado", "2 cucharadas de hierbas mezcladas secas", "1,5 litros / 2½ pintas de pollo o verduras", "1 cucharada de azúcar en polvo", "sal y pimienta negra recién molida", "1 cangrejo pequeño vestido (opcional)", "Crema doble 250ml / 9fl oz", "1 ciabatta pequeño sin hornear, cortado en 6-8 rebanadas delgadas", "salpicar aceite de oliva", "sal y pimienta negra recién molida", "2 dientes de ajo", "2 yemas de huevo de gallinas camperas", "75ml / 3fl oz de aceite de oliva virgen extra", "75ml / 3fl oz de aceite vegetal", "gran pizca de cayena", "3 cucharadas de puré de tomate", "Jugo de limón recién exprimido, al gusto", "6-8 huevos de gallo (disponibles en tiendas de granja)", "salpicaduras de vinagre de vino blanco", "Gruyère 75g / 3oz, rallado", "ramitas de perejil o perifollo, para adornar"], "method": ["Para la sopa de pescado, caliente el aceite en una sartén a fuego medio. Freír la cebolla, los chalotes y el hinojo durante 8-10 minutos, o hasta que se ablanden, luego agregar el ajo y continuar freír durante 1-2 minutos más, revolviendo bien.", "Agregue los huesos de pescado y fría por otros 4-5 minutos, revolviendo bien.", "Agregue las cáscaras y las cabezas de gambas, el puré de tomate, los tomates picados, la passata, las hierbas mixtas, el caldo y el azúcar impalpable y revuelva hasta que estén bien combinados. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 30 minutos. Una vez cocinado, reservar para que se enfríe un poco.", "Mientras tanto, para el crostini cubierto de rouille, coloque las rebanadas de pan ciabatta en una bandeja para hornear. Cepille cada rebanada con un poco de aceite de oliva y sazone, al gusto, con sal y pimienta negra recién molida. Hornee en el horno durante 5-6 minutos, o hasta que estén crujientes y doradas. Dejar de lado.", "Para hacer el rouille, mezcle el ajo y las yemas de huevo en un procesador de alimentos con una pizca de sal.", "Mezcle la verdura y el aceite de oliva virgen extra. Con el motor todavía funcionando, agregue gradualmente los aceites a la mezcla de huevos en una corriente delgada hasta que la mezcla se vuelva gruesa y suave.", "Agregue la pimienta de cayena, el puré de tomate y el jugo de limón y mezcle hasta que quede suave. Dejar de lado.", "Una vez que la sopa de pescado se haya enfriado, mezcle la mezcla hasta obtener un puré suave usando una licuadora manual, luego cuele a través de un tamiz fino en un recipiente limpio, ayudando a la mezcla a través del colador con el dorso de una cuchara de madera. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Justo antes de servir, vuelva a calentar la sopa de pescado con cuidado, agregue la carne de cangrejo (si está usando) y la crema.", "Mientras tanto, poach los huevos de gallo. Ponga a hervir una olla de agua, agregue los huevos (aún en sus cáscaras) y hierva por 20 segundos. Retire los huevos del agua.", "Agregue un poco de vinagre de vino blanco al agua hirviendo y revuelva para formar un vórtice. Agriete uno de los huevos en el centro del vórtice y cocine por 2-3 minutos, o hasta que el huevo esté cocido a su gusto. Retire el huevo escalfado de la sartén con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina. Mantener caliente Repita el proceso con los huevos restantes.", "Cubra cada crostini con una cucharadita de rouille y un gruyère rallado. Cubra cada uno con un huevo de gallo escalfado y adorne con una ramita de perejil o perifollo.", "Cuando la sopa se haya calentado, colóquela en cuencos. Sirva el crostini cubierto de rouille al costado, o flote sobre la sopa."], "url": "www_bbc_co_uk_food_recipes_fish_soup_with_27076", "title": "Sopa de pescado con crostini cubierto de rouille", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fish_soup_with_27076_16x9.jpg", "isVegetarian": false, "recommendations": 0}]