[{"ingredients": ["225g / 8oz de chocolate puro, roto en pedazos", "2 cucharadas de jarabe de oro", "50g / 2oz de mantequilla", "75g / 3oz de copos de maíz", "36 mini huevos de chocolate"], "method": ["Cubra una lata de pastel de hadas de 12 hoyos con cajas de papel.", "Derrita el chocolate, el jarabe dorado y la mantequilla en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Revuelva la mezcla hasta que quede suave.", "Retire el recipiente del fuego y mezcle suavemente los copos de maíz hasta que todo el cereal esté cubierto con el chocolate.", "Divida la mezcla entre las cajas de papel y presione 3 huevos de chocolate en el centro de cada nido. Enfríe en la nevera durante 1 hora, o hasta que esté completamente preparado."], "url": "www_bbc_co_uk_food_recipes_eastereggnests_93841", "title": "Tortas de nido de huevos de Pascua de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eastereggnests_93841_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 cucharadas de aceite de girasol", "2 cebollas, peladas, cortadas en cubitos", "2 tallos de apio, cortados, cortados en cubitos", "2 zanahorias, peladas, cortadas, cortadas en cubitos", "3 dientes de ajo, pelados, picados", "pomo de jengibre fresco, pelado, rallado", "1 cucharadita de canela molida", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "½ cucharadita de cúrcuma molida", "1 cucharadita de semillas de mostaza", "500 g / 1 libra de cordero asado sobrante, finamente cortado en cuadritos", "½ naranja, solo ralladura", "1 cucharada de harina normal", "250ml / 9fl oz de caldo de cordero caliente", "1 cucharadita de miel clara", "1 cucharada de salsa Worcestershire", "4 higos secos, picados", "sal y pimienta negra recién molida", "Patatas harineras de 400g / 14oz, como Maris Piper, peladas, cortadas en cubitos", "2 cucharadas de aceite de girasol", "1 cucharadita de semillas de mostaza", "3 pellizcos grandes de polvo de curry suave", "½ cucharadita de semillas de comino"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén grande con una tapa bien ajustada a fuego medio. Agregue las cebollas, el apio, las zanahorias, el ajo, el jengibre y las especias, revuelva bien y freír durante 8-10 minutos, o hasta que las verduras se hayan suavizado un poco. Aumente el fuego y añada el resto del cordero y la ralladura de naranja. Continúe cocinando por otros cinco minutos.", "Espolvorea sobre la harina y revuelve para incorporar, luego vierte sobre el caldo. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y agregue la miel, la salsa Worcestershire y las higos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cubra la olla con la tapa y cocine a fuego lento durante 12-15 minutos. Retirar del fuego y reservar para enfriar un poco.", "Precalentar el horno a 180C / 350F / Gas 4.", "Para el puré de patatas de Bombay, cocine las papas en una olla grande de agua hirviendo con sal durante 12-15 minutos, o hasta que estén tiernas. Escurrir bien y macerar hasta que esté completamente suave.", "Mientras las papas hierven, caliente el aceite en una sartén pequeña. Agregue las semillas de mostaza, el polvo de curry y las semillas de comino y fríalos suavemente hasta que las semillas comiencen a reventar. (Precaución: mantenga sus ojos y cara lejos de la sartén). Retire la sartén del fuego y déjela a un lado.", "Revuelva la mezcla de especias en el puré de papa y sazone bien con sal y pimienta negra recién molida.", "Coloque el relleno en un plato a prueba de horno de tamaño adecuado (o dos más pequeños si es necesario). Cubra con puré de patatas de Bombay, alisado en una capa uniforme con una espátula. Arrastre un tenedor a través de la cubierta para decorar.", "Hornee el pastel de pasto en el horno durante 15-20 minutos, o hasta que el relleno esté burbujeante y el puré de papa esté crujiente y dorado."], "url": "www_bbc_co_uk_food_recipes_eastern-spiced_shepherds_80973", "title": "Pastel de pastor con especias orientales y cobertura de papa Bombay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eastern-spiced_shepherds_80973_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de yogur griego", "2 cucharadas de mayonesa", "1 cucharada colmada de rábano picante batido", "2 cucharaditas de cilantro molido", "1 cucharadita de canela molida", "1 semillas tsp nigella apiladas", "generoso puñado de pasas doradas", "½ repollo blanco, finamente rallado", "¼ de coliflor, sin tallo, florecillas cortadas en rodajas finas", "1 gran bulbo de hinojo, descuartizado y en rodajas finas, frondas picadas", "1 cebolla roja, muy finamente cortada en medias lunas", "2 manzanas (de su elección), descuartizadas, sin corazón y en rodajas finas", "20g / ¾oz de hojas de menta, más o menos picadas", "20g / ¾oz de eneldo, frondas y tallos toscamente picados", "copos de sal marina y pimienta negra recién molida"], "method": ["Ponga el yogur, la mayonesa, el rábano picante, el cilantro, la canela y las semillas de nigella en un tazón pequeño y mezcle bien. Agregue las pasas y sazone generosamente con sal y pimienta. Mezclar bien.", "Coloque las verduras y las manzanas en un tazón grande y vierta sobre la salsa. Use sus manos para asegurarse de que todo esté bien cubierto y uniformemente mezclado. Agregue las hierbas frescas, mezcle bien de nuevo hasta que los ingredientes se combinen uniformemente."], "url": "www_bbc_co_uk_food_recipes_eastern_slaw_89338", "title": "Ensalada de repollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 pechuga de pollo grande, deshuesada y sin piel, cortada en tiras finas y sazonadas", "2 cucharaditas de miel clara", "4 cebolletas, finamente cortadas", "1 pimiento rojo, finamente cortado", "Mangetout 100 g / 4 oz, recortado y cortado en diagonal", "110g / 4oz botón champiñones castaños, dejó todo", "100g / 4oz de pak choi, rebanadas gruesas manteniendo separadas las partes blanca y verde", "sal y pimienta negra recién molida", "1 cucharada de salsa de soja", "½ cucharadita de harina de maíz", "1 cucharada de hoi sin salsa", "25g / 1oz de anacardos salados"], "method": ["Caliente el aceite en un wok o una sartén honda a fuego alto y agregue el pollo. Vierta más de 1 cucharadita de miel y dore el pollo rápidamente. Retire de la sartén con una espumadera y déjelo a un lado.", "Agregue la cebolla de primavera a la sartén y agregue un poco más de aceite si es necesario. Vierta sobre la cucharadita restante de miel y deje cocer durante unos minutos. Agregue pimientos rojos, mangetout, champiñones y las partes blancas de pak choi y mezcle a fuego alto.", "Pinte juntos la salsa de soya, la salsa de soya y la salsa hoi sin y mezcle bien. Regrese el pollo a la sartén, agregue las partes verdes de pak choi, la mezcla de soja y los anacardos y cocine hasta que la salsa burbujee y espese. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_easternchickenstirfr_67096", "title": "Pollo oriental salteado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Tocino en cubos de 150g / 5oz", "1 cebolla, finamente picada", "2 dientes de ajo, aplastados", "½ cucharadita de pimentón picante", "1 cucharada de mostaza inglesa", "1 cucharadita de melaza", "splash salsa Worcestershire", "300g / 10oz de tomates cherry enlatados", "1 cucharadita de azúcar moreno", "1 cucharadita de puré de tomate", "1 x 400 g / 14 oz puede alubias, drenado, enjuagado", "1 cucharada de perejil de flatleaf fresco picado, para adornar", "2 salchichas de cerdo de buena calidad", "1 cucharada de aceite de oliva", "Papas desirée 350g / 12oz, peladas", "2 cebollas tiernas, finamente cortadas", "1 cucharada grande de harina común", "1 granillo de mantequilla", "2 cucharadas de aceite de oliva"], "method": ["Para los frijoles, caliente el aceite de oliva en una sartén ancha de base pesada a fuego medio-alto. Agregue la panceta y fría por 1-2 minutos, o hasta que comience a crujir en los bordes, luego agregue la cebolla y el ajo.", "Freír durante 2-3 minutos, hasta que la cebolla esté transparente, luego agregue el pimentón, la mostaza, la melaza, la salsa Worcestershire, al gusto, los tomates, el azúcar, el puré de tomate y las judías. Llevar a ebullición y cocinar durante diez minutos, o hasta que el líquido se haya reducido a una consistencia espesa. Sazonar con sal marina y pimienta negra recién molida", "Mientras tanto, para las albóndigas, quite la carcasa de las salchichas y enrolle la carne de salchicha en trozos del tamaño de una pelota de golf. Calentar el aceite de oliva en una sartén a fuego medio y freír durante diez minutos, volteándolo regularmente, o hasta que esté dorado y cocido.", "Para las tortas de patata, hierva las papas enteras durante cinco minutos o hasta que estén tiernas. Drene y, cuando esté lo suficientemente frío para manipular, ralle en forma gruesa en un recipiente para mezclar. Agregue las cebollas de primavera, la harina y la mitad de la mantequilla. Sazonar con sal y pimienta negra recién molida y mezclar bien. Divídelo en cuatro bolas iguales y pat en rondas planas.", "Caliente el aceite y la mantequilla restante en una sartén antiadherente grande a fuego medio y fría los panes fritos durante 2-3 minutos por cada lado, o hasta que estén dorados y cocidos.", "Para servir, ponga los frijoles sobre las tortas de papa y las albóndigas y adorne con el perejil."], "url": "www_bbc_co_uk_food_recipes_easy_boston_baked_beans_26627", "title": "Easy Boston frijoles horneados con tortas de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla grande, pelada", "6 dientes", "1 hoja de laurel", "6 granos de pimienta negra", "570 ml / 1 pinta de leche entera", "Pan rallado blanco fresco de 110g / 4oz", "40 g / 1½ oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para la salsa de pan, adornar la cebolla con los dientes, colocar en una olla junto con la hoja de laurel, granos de pimienta y leche. Ponga a hervir la mezcla, retire la sartén del fuego y déjela enfriar durante 15 minutos.", "Retire la cebolla, la hoja de laurel y los granos de pimienta, luego agregue las migas de pan.", "Regrese la sartén al fuego y cocine muy suavemente durante 5-10 minutos, revolviendo ocasionalmente hasta que las migas de pan hayan absorbido todo el líquido y la salsa tenga la consistencia deseada.", "Agregue la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_easy_bread_sauce_26387", "title": "Salsa de pan fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_bread_sauce_26387_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva suave o aceite de girasol", "1 cebolla, cortada por la mitad, rallada groseramente", "2 dientes de ajo rallados", "Arroz risotto arborio 250 g / 9 oz", "100 ml / 3½ fl oz de vino blanco, vermut seco o agua", "Cubo de caldo de pollo de 1 litro / 1¾ pintas, hecho con 1 cubo de caldo", "Pollo sobrante cocido de 250g / 9oz, sin piel, cortado en trozos pequeños", "200g / 7oz de guisantes congelados", "75g / 2¾oz de Grana Padano u otro queso duro de estilo italiano, finamente rallado", "25g / 1oz de mantequilla", "pimienta negra recién molida"], "method": ["Caliente el aceite en una cacerola grande y antiadherente a fuego medio. Agregue la cebolla y el ajo y fría por 2-3 minutos, revolviendo ocasionalmente, hasta que se ablanden y comiencen a colorear.", "Agregue el risotto de arroz a la sartén y mezcle bien durante 30-40 segundos, hasta que el aceite haya cubierto los granos de arroz.", "Verter en la mitad del vino y dejar que burbujee durante 30-40 segundos, luego agregar todo el caldo y llevar a ebullición, revolviendo bien. Reduzca el fuego y cocine a fuego lento, sin tapar, durante 8-10 minutos, revolviendo con frecuencia, hasta que el arroz esté casi tierno y el risotto tenga una apariencia cremosa.", "Agregue el vino restante, el pollo y los guisantes congelados, luego continúe cocinando, revolviendo constantemente, por otros 4-5 minutos, o hasta que el pollo y los guisantes se hayan calentado y el arroz esté tierno con un ligero mordisco.", "Retire la sartén del fuego y agregue la mantequilla y el queso. Sazonar con pimienta negra. Cubra la olla con una tapa y déjela a un lado durante 5 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_easy_chicken_and_pea_31687", "title": "Risotto de pollo y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chicken_and_pea_31687_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo cocido de 300g / 10½oz, cortado en trozos del tamaño de un bocado", "½ limón, solo ralladura", "5 ramitas de tomillo, hojas recogidas y finamente picadas", "pequeño racimo de perejil fresco, hojas recogidas y finamente picadas", "4 cucharadas de crema fresca colmada", "Hojaldre en bloque de 500 g / 1 lb 2 oz", "1 huevo de gallina, batido ligeramente", "sal y pimienta negra recién molida"], "method": ["Coloque el pollo en un tazón grande y agregue la ralladura de limón, el tomillo y el perejil. Agregue suficiente crème fraîche para cubrir los ingredientes. Condimentar con sal y pimienta.", "Corte el bloque de hojaldre en tres piezas iguales y extienda cada una en un rectángulo de aproximadamente 33 cm / 13 pulgadas x 13 cm / 5 pulgadas. Corta cada rectángulo por la mitad horizontalmente para hacer seis pedazos de masa del mismo tamaño.", "Cepille los rectángulos alrededor de los bordes con un poco de huevo batido. Coloque una cucharada colmada del relleno de pollo a un lado del rectángulo y doble sobre la masa restante para formar un paquete. Presione los bordes juntos y selle presionando las puntas de un tenedor a lo largo de los tres bordes sellados. Haga 3 pequeñas ranuras en la parte superior.", "Cepille todo el paquete con un poco de huevo batido y colóquelo en una bandeja para hornear bien engrasada. Repite con las otras piezas de masa. Coloque la bandeja para hornear en la nevera durante aproximadamente 20 minutos para que los pasteles se vuelvan firmes.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hornee las empanadas durante aproximadamente 20-30 minutos, hasta que las empanadas estén doradas y doradas por todas partes."], "url": "www_bbc_co_uk_food_recipes_easy_chicken_pasties_37125", "title": "Pasteles de pollo fáciles", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 6 empanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal", "Echador de 250g / 9oz o azúcar moreno", "50ml / 2fl oz de aceite de girasol", "25 g / 1 oz de cacao en polvo", "2 cucharaditas de extracto de vainilla", "4 huevos medianos de granja", "80ml / 2½ fl oz de leche", "100ml / 3½ fl oz crema doble", "Harina normal 300g / 10½ oz", "3 cucharaditas de polvo de hornear", "25 g / 1 oz de cacao en polvo", "300g / 10½oz de azúcar glas", "50g / 1¾oz de mantequilla", "Crema doble 50ml / 2fl oz", "Crema doble de 250 ml / 9 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "150 g / 5½ oz de mermelada"], "method": ["Para la torta, forre la base de una lata honda de 20 cm / 9 pulgadas con papel antiadherente y precaliente el horno a 180 ° C / 350 F / Gas 4.", "Derrita la mantequilla a fuego lento en una olla pequeña, viértala en un bol con el azúcar, el aceite, el cacao en polvo y la vainilla. Batir bien hasta que quede suave, luego batir los huevos, seguido de la leche y la crema.", "Tamizar la harina y el polvo de hornear en la mezcla de mantequilla y batir hasta que quede suave, luego cuchara en la lata preparada y cubrir la parte superior de la lata con papel de aluminio.", "Hornee durante 30 minutos, luego quite la lámina y hornee por otros 20 minutos, o la parte superior es elástica y una brocheta insertada en el centro sale limpia.", "Retire la torta del horno y déjela enfriar por completo.", "Mientras tanto haga el glaseado de cacao, mezcle el cacao en polvo y el azúcar glas en un tazón. Derrita la mantequilla durante unos segundos en el microondas o en una sartén pequeña a fuego lento. Mezcle la mantequilla derretida y la crema en el azúcar y el cacao, y revuelva hasta que quede suave.", "Para armar la torta, retire la torta de la lata, recorte la parte superior de la torta para que quede plana, luego corte la torta por la mitad horizontalmente. Coloque la mitad inferior de la torta en un plato de servir y unte con la crema batida. Arriba con el atasco.", "Extienda el glaseado de cacao en la parte superior de la torta y agítelo con una cuchara, luego colóquelo con cuidado en la mitad inferior de la torta."], "url": "www_bbc_co_uk_food_recipes_easy_chocolate_birthday_90089", "title": "Torta de cumpleaños de chocolate fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chocolate_birthday_90089_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "350 g / 12½ oz de azúcar en polvo", "85g / 3oz de cacao en polvo", "1½ cucharadita de polvo de hornear", "1½ cucharadita de bicarbonato de soda", "2 huevos de gallinas camperas", "Leche 250ml / 9fl oz", "125ml / 4½fl oz de aceite vegetal", "2 cucharaditas de extracto de vainilla", "250ml / 9fl oz de agua hirviendo", "200g / 7oz de chocolate puro", "Crema doble de 200 ml / 7 fl oz"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y alinee dos latas de emparedado de 20 cm / 8 in.", "Para la torta, coloque todos los ingredientes de la torta, excepto el agua hirviendo, en un tazón grande. Con una cuchara de madera o un batidor eléctrico, bata la mezcla hasta que esté suave y bien combinada.", "Agregue el agua hirviendo a la mezcla, poco a poco, hasta que quede suave. (La mezcla de la torta ahora será muy líquida.)", "Divida la masa de la torta entre las latas de sándwich y hornee en el horno durante 25-35 minutos, o hasta que la parte superior esté firme al tacto y una broche insertada en el centro de la tarta salga limpia.", "Retire las tortas del horno y deje que se enfríen completamente, aún en sus latas, antes de la formación de hielo.", "Para el glaseado de chocolate, caliente el chocolate y la crema en una cacerola a fuego lento hasta que el chocolate se derrita. Retire la sartén del fuego y bata la mezcla hasta que quede suave, brillante y espesa. Déjelo enfriar durante 1-2 horas, o hasta que se espese lo suficiente como para extenderlo sobre la torta.", "Para armar la torta, pase un cuchillo de hoja redonda por el interior de la torta para aflojar los pasteles. Retire con cuidado los pasteles de las latas.", "Extienda un poco de glaseado de chocolate en la parte superior de uno de los pasteles de chocolate, luego cuélelo cuidadosamente con el otro pastel.", "Transfiera la torta a un plato de servir y cubra todo el pastel con glaseado de chocolate con una espátula."], "url": "www_bbc_co_uk_food_recipes_easy_chocolate_cake_31070", "title": "Torta de chocolate fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chocolate_cake_31070_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de cacao en polvo", "6 cucharadas de agua hirviendo", "100g / 3½oz de mantequilla sin sal", "275g / 9¾oz de azúcar en polvo de oro", "3 huevos grandes de gallinas camperas", "125ml / 4fl oz de leche entera", "150g / 5½ oz de harina de auto crianza", "25 g / 1 oz de almendras molidas", "1 cucharadita de polvo de hornear", "50 g / 1 oz de leche malteada en polvo", "4 cucharadas de mermelada de fresa", "Crema doble de 200 ml / 7 fl oz", "Chocolate blanco de 400g / 14oz, finamente picado"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 5. Engrase una bandeja de bandeja de 30x23 cm / 12x9 in y tape con un pergamino para hornear.", "Ponga el cacao y el agua hirviendo en un tazón grande y mezcle. Agregue la mantequilla y mezcle hasta que quede suave. Agregue los ingredientes restantes de la esponja y mezcle hasta que estén completamente incorporados.", "Vierta en la lata y hornee durante 30-35 minutos, o hasta que la bandeja baje hacia atrás cuando se presione ligeramente con un dedo en el centro y empiece a encogerse lejos de los lados de la lata.", "Dejar enfriar en la lata durante 10 minutos, luego girar, retirar cuidadosamente el pergamino y colocar sobre una rejilla para que se enfríe por completo.", "Para hacer el glaseado, caliente suavemente la crema en una cacerola pequeña de fondo grueso. Agregue el chocolate blanco y revuelva hasta que quede suave. Deja enfriar.", "Vierta el glaseado sobre el traybake en una capa uniforme."], "url": "www_bbc_co_uk_food_recipes_easy_chocolate_traybake_12742", "title": "Easy chocolate traybake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 20 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Fideos de huevo secos de 200g / 7oz (o fideos de arroz o soba)", "1 zanahoria grande", "2 cebollas de primavera", "50g / 1¾oz de judías verdes, guisantes o mangetout (frescos o congelados)", "puñado de brotes de soja, hojas de col, pimiento en rodajas, flósculos de brócoli o champiñones (opcional)", "2 cucharaditas de aceite vegetal o de girasol", "1 diente de ajo, finamente picado por un adulto o aplastado en una prensa de ajo", "puñado de carne cocida triturada, langostinos o tofu (opcional)", "1 cucharada de salsa de soja (versión baja en sal si es posible)", "2 cucharaditas de miel", "1 cucharadita de ketchup de tomate", "medio limón, solo jugo"], "method": ["Trabajo para adultos: coloque los fideos secos en un recipiente resistente al calor y agregue agua hirviendo del hervidor de agua. Le tomarán aproximadamente cinco minutos cocinar y esto es divertido para que los niños lo miren, pero tenga cuidado con el agua caliente. Cuando los fideos estén cocidos, escúrralos en un colador y enjuaga los fideos con agua fría.", "El trabajo de un niño: Pelar y rallar la zanahoria. Esto lo pueden hacer los niños, pero tenga cuidado al usar ralladores y peladores ya que pueden ser muy filosos. Los niños pueden cortar cualquier otra verdura que desee incluir. Todo debería cortarse finamente si es posible.", "El trabajo de los niños: en un tazón pequeño mezcle la soja, la miel, el ketchup y el jugo de limón. Pruébalo, debe ser fuerte pero dulce. Puede agregar un poco más de los ingredientes según sea necesario.", "Trabajo para adultos: caliente una sartén grande o wok y agregue el aceite. Agregue el ajo y sofría por unos segundos, luego agregue las zanahorias ralladas, las cebolletas y los frijoles o guisantes (crudos o congelados) y cualquier otra carne cruda o cocida que desee agregar.", "Trabajo de un adulto: sofríelo durante dos minutos a fuego alto antes de agregar la salsa y un chorrito de agua. Sabor (los niños pueden hacer esto). Es posible que necesite más miel, limón o salsa de soja.", "Trabajo de un adulto: agrega los fideos cocidos a los ingredientes salteados junto con los brotes de soja si los estás usando. Mezcle el chow mein por un par de minutos a fuego alto para terminar el plato. Sirva en un tazón - ¡pruebe con los palillos!"], "url": "www_bbc_co_uk_food_recipes_easy_chow_mein_for_kids_81406", "title": "Easy chow mein para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chow_mein_for_kids_81406_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "10g / ⅓oz de sal", "10 g / ⅓oz de levadura instantánea", "sémola fina, para quitar el polvo"], "method": ["Ponga la harina, la sal y la levadura con 330 ml / 11 fl oz de agua fría en un mezclador independiente equipado con un gancho para masa (no coloque la sal directamente sobre la levadura). Comience a mezclar a baja velocidad.", "A medida que la masa comienza a juntarse, con el motor en marcha, agregue lentamente otros 110 ml / 3⅓ fl oz de agua fría, gotee por goteo. Mezcle por otros 5-8 minutos a velocidad media hasta que la masa esté suave y elástica.", "Engrase ligeramente un recipiente de plástico cuadrado de 3 litros / 5 litros con una tapa. (Es importante usar una tina cuadrada ya que ayuda a dar forma a la masa).", "Incline la masa en el recipiente engrasado y selle con la tapa. Déjalo durante 1½ a 1¾ hora a temperatura ambiente, o hasta al menos el doble, incluso triplicado en tamaño (es importante que la masa sea lenta, de lo contrario se colapsará y tus panes estarán planos).", "Espolvorea dos bandejas grandes para hornear con harina y sémola.", "Espolvorea la superficie de trabajo con harina y sémola y, con cuidado, inclina la masa (estará muy húmeda), tratando de mantener una forma cuadrada áspera.", "En lugar de derribarlo, manipúlelo suavemente para que pueda mantener la mayor cantidad posible de aire en la masa. Cubra la parte superior de la masa con más harina y / o sémola.", "Cortar la masa longitudinalmente, dividir en cuatro panes de igual tamaño. Estire un poco cada trozo de masa un poco y colóquelo en las bandejas de hornear preparadas. Deja la ciabatta para descansar por otros 30-45 minutos.", "Precaliente el horno a 220 ° C / 425 ° F / Gas 8 (ventilador de 200 ° C) y hornee durante 25 minutos, o hasta que los panes estén dorados y suenen huecos al golpearlos en la base. Deje que se enfríe completamente en una rejilla de alambre antes de servir."], "url": "www_bbc_co_uk_food_recipes_easy_ciabatta_98431", "title": "Ciabatta de Paul Hollywood", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 4 panes pequeños", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 yemas de huevo grandes de gallinas camperas", "2 cucharadas de harina de maíz", "25 g / 1 oz de azúcar en polvo", "1 vaina de vainilla, dividida longitudinalmente, o ½ cucharadita de extracto de vainilla de buena calidad", "250ml / 9fl oz de leche entera", "Crema doble 250ml / 9fl oz"], "method": ["Coloque las yemas de huevo en una olla mediana con la harina de maíz y el azúcar. Raspe las semillas de vainilla en la sartén, o agregue el extracto de vainilla, y use un batidor de metal para combinar todos los ingredientes.", "Poco a poco mezcle la leche y la crema, coloque la sartén a fuego lento y cocine suavemente durante 6-8 minutos, batiendo constantemente, hasta que quede suave y espesa. (No permita que la crema hierva)."], "url": "www_bbc_co_uk_food_recipes_easy_creamy_vanilla_20376", "title": "Crema cremosa de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 papas medianas (o batatas)", "200g / 7oz de pescado cocinado: use caballa ahumada o una lata de atún o salmón", "un pequeño limón, solo jugo", "pimienta negra recién molida", "100 g / 3½ oz de galletas en crema o galletas saladas similares (o migas de pan si las tiene)", "1 cucharada de aceite vegetal o de girasol", "2 cebollas de primavera, picadas", "1 cucharada de cebollino picado o perejil", "1 cucharada de queso cheddar rallado", "1 cucharadita de mostaza integral"], "method": ["Trabajo para adultos: precaliente el horno a 220C / 425F / Gas 7.", "El trabajo de un niño: lave las papas y luego un adulto puede hervir las papas enteras con sus pieles puestas. Después de 20-30 minutos las papas deben sentirse suaves cuando un adulto empuja un cuchillo pequeño, de lo contrario, cocínelas por unos minutos más y luego enjuáguelas y déjelas enfriar.", "El trabajo de los niños: una vez que las papas se hayan enfriado, los niños pueden pelar la piel de las papas con los dedos y aplastar la carne en un tazón. Mash la papa con un triturador, tenedor o dedos limpios.", "El trabajo de los niños: agregue el pescado y mezcle bien. Agregue el limón, un poco de pimienta y cualquiera de los extras opcionales que desee. Pruebe: puede agregar más pimienta o limón, si lo desea. ¡Todos los ingredientes se cocinan en este momento por lo que es seguro probar!", "El trabajo de los niños: Coloque las galletas en una bolsa de sándwich y envuélvala en una toalla de té limpia o en capas de papel de cocina. Aplasta las galletas con un rodillo. ¡Es más seguro volcar las galletas en lugar de golpearlas! Vierta las migas de galleta en un plato. Tenga un recipiente listo con un poco de agua para mojar las manos.", "El trabajo de los niños: moja un poco las manos y haz rodar pequeñas bolitas de la mezcla de pastel de pescado. No te preocupes demasiado por hacer bolas perfectas: puedes aplanarlas para hacer hamburguesas. Vuelve a humedecer las croquetas y colócalas en el cuenco de galletas molidas. Quieres una capa ligera de migas por todas las croquetas.", "El trabajo de los niños: vierta el aceite sobre el fondo de una bandeja para hornear y coloque las croquetas de pescado encima. Déles la vuelta una vez para que tengan un poco de aceite en cada lado. Un adulto puede colocar la bandeja de horno en el horno precalentado.", "El trabajo de un adulto: hornee las croquetas de pescado por 10 minutos en un lado y luego voltee las croquetas de pescado antes de colocarlas nuevamente en el horno por otros 10 minutos o hasta que las croquetas de pescado estén doradas. Retire con cuidado del horno y deje que se enfríe un poco antes de servir."], "url": "www_bbc_co_uk_food_recipes_easy_kids_fishcakes_70996", "title": "Tortas de pescado fáciles para niños", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_kids_fishcakes_70996_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 muslos de pollo, deshuesados, sin piel, cortados en piezas de 2½ cm / 1 in", "75 g / 2½ oz de salchicha ahumada (como kobanos), en rodajas", "1 cebolla pequeña, finamente picada", "1 apio, finamente picado", "1 diente de ajo, finamente picado", "1 pimiento rojo, en rodajas finas", "200g de tomates cortados en lata", "½ cucharadita de pimienta de cayena, o al gusto", "150g / 5½oz de arroz basmati", "200ml / 7fl oz de caldo de pollo (hecho de ½ cubo de reserva)", "sal y pimienta negra recién molida", "puñado de perejil fresco, finamente picado, opcional"], "method": ["Calentar el aceite en una olla mediana con una tapa hermética y freír el pollo y la salchicha durante 3 minutos.", "Agregue la cebolla y el apio, sazone bien y fría por 5 minutos, o hasta que se ablanden. Agregue el ajo y la pimienta y cocine por un minuto más. Agregue los tomates y la cayena y cocine por 2 minutos, luego agregue el arroz y revuelva bien.", "Verter sobre el caldo, llevar a ebullición, poner la tapa, bajar la temperatura lo más bajo posible y cocinar durante 12 minutos.", "Apague el fuego y deje reposar el arroz durante 12 minutos. Quite la tapa, esponje el arroz y sirva inmediatamente, adornado con el perejil, si se usa."], "url": "www_bbc_co_uk_food_recipes_easy_jambalaya_77952", "title": "Fácil jambalaya", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_jambalaya_77952_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Galletas digestivas 200 g / 7 oz", "75g / 2½ oz de mantequilla sin sal", "400 g / 14 oz de queso crema con grasa, a temperatura ambiente", "300 g / 10½ oz de mascarpone, a temperatura ambiente", "200g / 7oz de azúcar glas, tamizado", "1 cucharadita de extracto de vainilla", "Bolas de leche malteada 100 g / 3½ oz (opcional)"], "method": ["Coloque las galletas digestivas en una bolsa de congelación sellable. Empuje todo el aire y selle la bolsa. Aplastar las galletas con un rodillo, teniendo cuidado de no romper los agujeros en la bolsa.", "Derrita la mantequilla en una olla grande. Incline las migas de galleta en la mantequilla y mezcle bien hasta que estén bien combinadas. Presione las migas de mantequilla en la parte inferior de un springform de 23cm / 9in o estaño de fondo suelto. Enfríe en el refrigerador mientras hace la cobertura.", "Combine el queso crema y el mascarpone en un tazón grande. Usando una batidora de mano eléctrica, mezcle los quesos juntos hasta que estén suaves y esponjosos. Agregue el azúcar glas un poco a la vez y mezcle para incorporar. Finalmente, mezcle la vainilla. La mezcla debe ser muy ligera y esponjosa.", "Coloque las bolas de leche malteadas en la bolsa del congelador sellable y cierre. Golpea las bolas de leche malteadas con un rodillo para separarlas. Dobla la mitad de las bolas de leche malteada trituradas en la mezcla de queso crema hasta que estén bien combinadas.", "Extienda la mezcla de queso crema sobre la base de galletas y alise la parte superior con una espátula o espátula. Cubra con film transparente y enfríe en la nevera durante al menos cuatro horas.", "Cuando esté listo para servir, espolvoree las bolas restantes de leche malteada triturada sobre la tarta de queso. Libere la captura de la lata Springform con cuidado, luego corte y sirva."], "url": "www_bbc_co_uk_food_recipes_easy_no-cook_cheesecake_89811", "title": "Tarta de queso fácil de cocinar", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_no-cook_cheesecake_89811_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 zanahorias, cortadas en trozos", "2 tallos de apio, cortados, cortados en trozos", "1 cebolla, cortada en seis", "1 x 2 kg / 4½ lb de pollo entero", "½ limón, cortado en cuartos", "pequeño racimo de hierbas frescas mezcladas (salvia, tomillo y romero)", "guión de aceite vegetal", "sal y pimienta negra recién molida", "patatas y verduras asadas, para servir", "275ml / ½ pinta de caldo de pollo", "30 g / 1¼ oz de mantequilla", "1 cucharada de harina normal"], "method": ["Precaliente el horno a 140C / 120C Fan / Gas 1.", "Coloque las zanahorias, el apio y la cebolla en una bandeja para hornear y coloque el pollo encima. Rellene la cavidad del pollo con el limón y las hierbas, luego rocíe con el aceite y frótelo en la piel. Sazonar, al gusto, con sal y pimienta.", "Ase el pollo durante 3 horas, rociando la piel con los jugos hasta la mitad. Aumente la temperatura del horno a su nivel más alto y continúe rostizando el pollo durante 5-10 minutos para que la piel quede crujiente. Quítelo de la bandeja de asar y compruebe que esté bien cocido (vea las puntas), luego déjelo a un lado en un plato para que descanse durante 10-15 minutos. Reserve las verduras y los jugos de cocina en la bandeja de asar.", "Mientras tanto, para la salsa, cuela las verduras reservadas y los jugos de cocción a través de un colador fino en una cacerola, exprimiendo las verduras con el dorso de una cuchara de madera para extraer el máximo sabor. Agregue el caldo al sartén y llévelo a ebullición.", "Coloque la bandeja de asar a fuego lento y agregue la mantequilla. A medida que la mantequilla se derrita, extraiga los trozos quemados del fondo de la bandeja con una cuchara de madera. Batir la harina hasta que se forme una pasta.", "Poco a poco, vierta los jugos y caldos de tostación en la bandeja de tostado, batiendo después de cada adición, hasta que todo el líquido se incorpore y la salsa se espese. Sazonar con un poco de sal. Caliente hasta que burbujee, luego continúe cocinando la salsa, revolviendo bien, durante 5 minutos. Sazonar con una pizca de sal.", "Cuele la salsa a través de un tamiz en una jarra de servir. Mantener caliente Justo antes de servir, revuelva todos los jugos liberados por el pollo descansado en la salsa.", "Para servir, esculpe el pollo asado en la mesa y sirva con verduras asadas y papas. Rocíe con la salsa."], "url": "www_bbc_co_uk_food_recipes_easy_roast_chicken_with_29774", "title": "Fácil pollo asado con salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_roast_chicken_with_29774_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tortillas grandes de maíz o trigo", "180g / 6oz de tomates picados en lata", "1 cucharada de puré de tomate", "2 ramitas de orégano, hojas recogidas, finamente picadas", "1 diente de ajo, rallado", "sal marina y pimienta negra recién molida", "2 hongos, en rodajas finas", "2 calabacines pequeños, muy finos en rodajas", "30g / 1oz de aceitunas negras sin hueso, cortadas a la mitad", "3 anchoas saladas, finamente picadas", "2 cucharaditas de alcaparras para bebés", "6 tomates tomados por el sol, cortados por la mitad", "3 rebanadas de jamón de Parma (45 g / 1½ oz en total), aproximadamente desgarradas", "Salami con 4 rebanadas de grasa reducida (20 g / ¾oz en total), reducido a la mitad", "Mozzarella semicama 100 g / 3½ oz, rallada", "10g / ⅓oz de queso parmesano, recién rallado", "pequeñas hojas de albahaca, para servir", "pequeño cohete, para servir"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Coloque las tortillas en dos bandejas para hornear y hornee por 5 minutos, o hasta que estén crujientes, pero no coloreadas. Retire las tortillas del horno y aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6.", "Mezcle los tomates en lata, el puré de tomate, el orégano y el ajo. Sazone al gusto y revuelva bien. Extienda la mitad de la mezcla de tomate uniformemente sobre cada tortilla, dejando un margen de 1 cm / ½ pulgadas. Divida los ingredientes entre las tortillas, terminando con la mozzarella y una dispersión final de queso parmesano.", "Hornee durante 10-12 minutos, o hasta que el queso se haya derretido y comience a dorarse. Cortar las pizzas en trozos y esparcir sobre la albahaca y las hojas de rúcula para servir."], "url": "www_bbc_co_uk_food_recipes_easy_pizza_with_parma_02334", "title": "Pizza fácil con jamón de Parma y mozzarella", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_pizza_with_parma_02334_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "400 g / 14 oz de carne picada", "1 cebolla, cortada en cubitos", "2 dientes de ajo picados", "100 g / 3½ oz de zanahoria rallada", "2 x 400 g de tomate picado", "400ml / 14fl oz stock (hecho de stock cubo. Idealmente carne, pero cualquiera lo hará)", "400g / 14oz de espagueti seco", "sal y pimienta"], "method": ["Caliente una cacerola grande a fuego medio. Agregue una cucharada de aceite de oliva y una vez caliente agregue la carne picada y una pizca de sal y pimienta. Cocine la carne picada hasta que se dore bien a fuego medio-alto (tenga cuidado de no quemar la carne picada. Solo tiene que ser de color marrón oscuro). Una vez dorado, transfiera la carne picada a un recipiente y reserve.", "Agregue otra cucharada de aceite a la cacerola en la que dore la carne picada y cambie el fuego a medio. Agregue las cebollas y una pizca de sal y fría con cuidado durante 5-6 minutos, o hasta que estén suaves y translúcidos. Agregue el ajo y cocine por otros 2 minutos. Agregue la zanahoria rallada y luego vierta la carne picada y los jugos en el tazón de nuevo en la cacerola.", "Agregue los tomates a la sartén y mezcle bien para mezclar. Vierta la mezcla, cocine a fuego lento y luego reduzca la temperatura a fuego lento durante 45 minutos o hasta que la salsa esté espesa y rica. Pruebe y ajuste el condimento según sea necesario.", "Cuando esté listo para cocinar los espaguetis, caliente una olla grande de agua y agregue una pizca de sal. Cocine según las instrucciones del paquete. Una vez que los espaguetis estén cocidos, escurrirlos y agregarlos a la sartén con la salsa boloñesa. Mezcle bien y sirva."], "url": "www_bbc_co_uk_food_recipes_easy_spaghetti_bolognese_93639", "title": "Espagueti boloñesa fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spaghetti_bolognese_93639_16x9.jpg", "isVegetarian": false, "recommendations": 0}]