[{"isVegetarian": false, "title": "Baby scallops with a breadcrumb crust", "url": "www_bbc_co_uk_food_recipes_babyscallopswithabre_83814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 baby scallops, in their shells", "55g/2oz breadcrumbs", "1 garlic clove, peeled and crushed", "handful flatleaf parsley, chopped", "zest of 1 lemon", "salt and freshly ground black pepper", "dash olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "Place the baby scallops on a baking tray.", "In a food processor, mix together the breadcrumbs, garlic, parsley and lemon zest.", "Season the mix with salt and freshly ground black pepper, and sprinkle it over the scallops.", "Drizzle a little oil over the scallops and cook under the grill for a couple of minutes until crisp on top and scallops are cooked through."]}, {"isVegetarian": false, "title": "Baby squid and sweet potato salad", "url": "www_bbc_co_uk_food_recipes_babysquidandsweetpot_91736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil ", "400g/14oz baby squid, cleaned, sliced into thick rings", "salt and freshly ground black pepper", "250g/9oz fine egg noodles, cooked according to packet instructions", "250g/9oz golden sweet potato, peeled, cut into cubes, cooked until tender", "4 spring onions, finely chopped", "1 tbsp pumpkin seeds", "1 tsp black onion (nigella) seeds", "2 sun-blushed tomatoes, chopped", "1 red chilli, finely chopped", "25ml/1fl oz fresh ginger juice (grate fresh root ginger and squeeze in a clean cloth to extract the juice)", "2 limes, juice only", "1 tbsp sesame oil", "2 tbsp sherry vinegar", "150ml/5½fl oz olive oil", "1 tbsp chopped fresh mint", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baby squid and sweet potato salad, heat the vegetable oil in a pan and fry the squid rings for 2-3 minutes, or until just opaque. Season well with salt and freshly ground black pepper and set aside. ", "Cut the noodles into 5-7cm/2-2.75in pieces and then add to a large bowl along with the sweet potato cubes, spring onions, pumpkin seeds, onion seeds and sun-blushed tomatoes. Stir well to combine. ", "For the dressing, place all of the dressing ingredients into a jar and shake until well combined. Season, to taste, with salt and freshly ground black pepper. Drizzle the dressing over the salad and toss well to coat. Stir in the chopped mint.", "To serve, divide the salad among six serving plates and top each salad with a portion of squid."]}, {"isVegetarian": false, "title": "Baby squid stuffed with chorizo and feta", "url": "www_bbc_co_uk_food_recipes_babysquidstuffedwith_89940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz uncooked chorizo sausages", "150ml/5fl oz white wine", "200g/7oz feta or feta-style cheese", "20 baby squid, cleaned, tubes and tentacles only", "vegetable oil, for frying", "2 fennel bulbs, thinly sliced", "1 tbsp good quality extra virgin olive oil, plus extra to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4.", "Place the chorizo into a pan with the white wine (the wine should cover the chorizo). Bring to boil, then turn down the heat and simmer for 15 minutes. Remove from the heat and allow the chorizo to cool down in the pan. When cool, remove the chorizo, peel off their skins and chop into small cubes. Place into a bowl.", "Chop the feta into similar-sized cubes as the chorizo and mix in the bowl with the chorizo.", "Carefully spoon the chorizo and feta mixture into the squid tubes to three-quarters fill the tubes. Fasten the opening closed with a cocktail stick", "Prepare a baking dish.", "Heat the oil in a frying pan over a high heat. When very hot, add the squid and cook in batches, searing them for one minute on each side. As each batch of squid is cooked, transfer to the dish. When the last squid is cooked, place the dish into the oven to cook for two minutes.", "Meanwhile, add the squid tentacles to the frying pan and fry for 1-2 minutes, or until just cooked through.", "Bring a pan of salted water to the boil. Add the fennel and boil for one minute. Drain the fennel and place into a bowl. Drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper.", "To serve, place equal portions of the fennel into the centre of each plate. Top each with five stuffed squid tubes and a few tentacles. Drizzle with a little olive oil and serve."]}, {"isVegetarian": false, "title": "Bacon-vodka infused cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_bacon-vodka_infused_21884", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 slices smoked streaky bacon (around 150g/5½ oz)", "500ml/18fl oz vodka", "250g/8oz cherry tomatoes", "1 tbsp sugar", "dash Worcestershire sauce (optional)", "hot sauce (optional)", "celery salt or lemon pepper seasoning (see Tip), to serve (optional)"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["To make the bacon vodka, fry the bacon slowly in a pan so that it cooks in its own fat and renders out as much as possible – do this without the bacon taking on too much colour as a dark, close-to-charred bacon will spoil the flavour.", "Put the bacon and all the fat from the pan into a container and cover with the vodka. You don’t really need the bacon as most of the flavour will come from the fat, but it won’t hurt. Leave for several hours to infuse – at least six, preferably 12 – then put into the freezer for about half an hour or until the bacon fat has solidified.", "Line a sieve with cheesecloth or muslin – alternatively use coffee filters. Strain the vodka through the cheesecloth – it will catch all the still frozen solids. Strain once more, then bottle.", "To make the bacon-vodka infused cherry tomatoes, prick the tomatoes lightly all over with a cocktail stick. Put into a jar, cover with the bacon vodka and sprinkle in the sugar. Add Worcestershire sauce and hot sauce, to taste, if liked. ", "Leave to infuse in the fridge until you are ready to eat them – at least for two hours, but for as long as you like, giving a shake every so often. ", "Drain and serve on cocktail sticks with optional celery salt or lemon pepper seasoning."]}, {"isVegetarian": false, "title": "Bacon and egg pie", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_pie_06890", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_pie_06890_16x9.jpg", "ingredients": ["275g/9¾oz plain flour", "pinch of fine salt", "135g/4½oz cold unsalted butter, cubed", "1 medium free-range egg, beaten", "1 tsp lemon juice", "1 tbsp vegetable oil", "1 large onion, finely chopped", "1 garlic clove, crushed", "200g/7oz unsmoked streaky bacon, cut into cubes", "200g/7oz pork loin, cut into roughly 1.5cm/½in cubes", "5 medium free-range eggs", "100g/3½oz cream cheese", "100g/3½oz mature cheddar, grated", "1 tbsp chopped chives", "1 free-range egg, beaten, to glaze", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, put the flour and salt in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl.", "Mix the egg with the lemon juice and three tablespoons of water. Make a well in the centre of the mixture and pour some of the egg mix. Using a table knife, work in just enough liquid to bring the pastry together. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and put in the fridge to rest for about 30 minutes.", "For the filling, heat the oil in a large frying pan over a medium-low heat and add the onion and garlic. Cook gently for about eight minutes, or until soft.", "Add the bacon and pork, increase the heat a little, and cook for about 10 minutes, until any liquid from the meat has been driven off. Leave to cool completely.", "Preheat the oven to 200C/400F/Gas 6.", "Beat two of the eggs with the cream cheese until smooth. Add the cheddar and chives and season with salt and pepper. Stir in the cooled bacon mixture.", "When you are ready to assemble the pie, roll out two-thirds of the pastry and use it to line the cake tin. Roll out the remaining pastry ready to form the lid.", "Put the filling mix into the pastry case. Make three evenly spaced depressions in the filling and crack the remaining eggs into them.", "Brush the rim of the pastry with beaten egg and place the lid on top. Press the edges to seal and trim off the excess neatly. Brush the top of the pie with more beaten egg and make a steam hole in the centre.", "Bake in the oven for 50-55 minutes, until golden-brown. Leave the pie to settle for at least 15 minutes before cutting. It is delicious hot or cold."]}, {"isVegetarian": false, "title": "Bacon and egg bites", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_bites_26820", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_bites_26820_16x9.jpg", "ingredients": ["12 bacon medallions", "12 free-range eggs", "12 small cherry tomatoes, halved", "freshly ground black pepper", "6 slices of bread, to serve", "knob of butter, to spread"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 8 and lightly grease a 12-hole muffin tin. ", "Put the bacon medallions between two sheets of cling film and roll out using a rolling pin. Put them into the muffin tin, creating a case shape.", "Crack the eggs into the centre of each bacon case, season with black pepper and top with two tomato halves.", "Bake in the oven for 10 minutes until the bacon is cooked and the egg just cooked on the inside. If you like your egg well done, cook for 15 minutes.", "Toast the bread to your liking and then butter lightly. Serve two egg bites with one piece of toast per person."]}, {"isVegetarian": false, "title": "Bacon and egg canapés", "url": "www_bbc_co_uk_food_recipes_bacon_and_egg_canapes_11283", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_canapes_11283_16x9.jpg", "ingredients": ["150g/5½oz plain flour", "100g/3½oz cold butter, cut into cubes", "1 free-range egg, beaten", "2 tbsp sunflower oil", "4 thin rashers rindless streaky bacon, cut into 5cm/2in strips", "2 free-range eggs, hard boiled, peeled", "4 tbsp mayonnaise", "salt and fresh ground black pepper", "6 quails’ eggs, hard boiled, peeled", "fresh rocket leaves"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry pulse the flour and butter in a food processor until the mixture resembles breadcrumbs. ", "With the motor running, add the beaten egg and blend until the mixture starts to come together in a ball. Shape the dough into a ball and flatten slightly.", "Roll the pastry out on a floured work surface, and using a 7.5cm/3in cutter, cut out 12 rounds.  Use them to line a 12 hole muffin tin. ", "Prick the base of the pastry with a fork, and freeze for one hour. ", "Preheat the oven to 200C/400F/Gas 6.", "Bake the pastry cases for 15-18 minutes or until lightly browned and cooked through. Remove from the oven and transfer to a wire rack to cool. ", "For the bacon and egg filling, heat the oil in a small non-stick frying pan and fry the bacon over a medium heat for 1-2 minutes on each side until crisp.   Drain on kitchen paper.", "Mash the hens’ eggs with the mayonnaise, adding salt and freshly ground black pepper to taste.", "Spoon the mixture into the pastry cases.", "Cut the quails’ eggs in half and place on top.  Add a strip of bacon to each one and garnish the canapés with rocket leaves."]}, {"isVegetarian": false, "title": "Bacon and mature cheddar straws", "url": "www_bbc_co_uk_food_recipes_bacon_and_mature_cheddar_58920", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mature_cheddar_58920_16x9.jpg", "ingredients": ["1 x 375g/13oz puff pastry", "plain flour, for dusting", "1 tbsp English mustard", "100g/3½oz mature cheddar, grated", "freshly ground black pepper", "14 slices good-quality streaky bacon", "1 free-range egg, lightly beaten"], "serves": "Makes 14", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Line a baking tray with greaseproof paper.", "Roll the pastry out on a lightly floured work surface to a large rectangle of 0.5cm/¼in thickness. ", "Turn the pastry so that the longest side is facing you, spread over the mustard, sprinkle with the cheese and season with freshly ground black pepper. Place the pieces of bacon onto the pastry, leaving a small gap between each piece. ", "Cut the pastry between each slice of bacon. Carefully twist each piece of pastry 4-5 times so it looks like a curly straw, then place on the baking tray.", "Repeat the process until all of the bacon has been used up. Chill the pastry twists in the fridge for 15-20 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Remove the twists from the fridge and brush with the beaten egg. ", "Reduce the oven to 200C/400F/Gas 6 and bake the twists for 20-25 minutes, or until the pastry is well risen and golden-brown. Remove from the oven and set aside to cool."]}, {"isVegetarian": false, "title": "Bacon and mushroom frittata", "url": "www_bbc_co_uk_food_recipes_bacon_and_mushroom_61984", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mushroom_61984_16x9.jpg", "ingredients": ["8 Portobello or flat chestnut mushrooms, about 500g/1lb 2oz in total", "1 garlic clove, finely chopped", "low-calorie cooking spray", "4 lean smoked back bacon rashers", "6 large free-range eggs", "1 tbsp chopped chives, plus extra to garnish", "1 tbsp wholegrain mustard", "knob of butter", "4 large slices of sourdough bread", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Put the mushrooms on a foil-lined baking sheet and scatter over the garlic. Spray with a little oil and season with salt and freshly ground black pepper. Bake in the oven for 18-20 minutes or until softened. Leave until cool enough to handle.", "Meanwhile, preheat the grill to medium-hot. Lay the bacon rashers on a foil-lined grill pan and cook for 5-6 minutes, or until slightly crispy. Cool slightly, then slice thickly. Leave the grill on for the frittata. ", "Put the eggs, chives and mustard in a bowl, beat together lightly and season with freshly ground black pepper.", "Heat a large, nonstick frying pan with an ovenproof handle over a medium heat. Add the butter, when the butter is foaming pour in the egg mixture and cook for 1-2 minutes, then add the bacon and whole mushrooms, stalk side up. Cook for a further 2-3 minutes or until almost set. Place the pan under the grill and cook the frittata for 2-3 minutes, or until set. Allow to cool slightly.", "Toast the bread and arrange on serving plates. Cut the frittata into wedges and serve on the toasted sourdough. Garnish with chives and serve. "]}, {"isVegetarian": false, "title": "Bacon and white bean soup", "url": "www_bbc_co_uk_food_recipes_bacon_and_white_bean_06748", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_white_bean_06748_16x9.jpg", "ingredients": ["1 tsp olive oil", "2 lean smoked bacon rashers, chopped", "2 garlic cloves, crushed", "1 onion, chopped", "3 thyme sprigs", "2 x 400g cans cannellini beans, drained and rinsed", "850ml/1½ pints vegetable stock ", "2 tbsp chopped parsley", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large saucepan over a medium heat. Add the bacon, garlic and onion and fry for 3-4 minutes, or until the bacon begins to brown and the onion softens.", "Add the thyme and fry for a further minute. Add the beans and stock to the pan and bring to the boil, then reduce the heat and simmer for 10 minutes.", "Transfer the soup to a blender or food processor and blend with the parsley and pepper until smooth.", "Return the soup to the pan and heat through, then ladle into 4 bowls and serve immediately."]}, {"isVegetarian": false, "title": "Bacon baked in a paper bag with carrots and creamed onions", "url": "www_bbc_co_uk_food_recipes_bacon_baked_in_a_paper_48335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 400g/14oz pieces unsmoked streaky bacon, skin on", "1-2 litres/1¾-3½ pints chicken stock", "750g/1lb 10oz carrots, peeled", "8 stalks celery", "1 bunch fresh thyme", "500ml/18fl oz ale", "50g/2oz butter", "300g/11oz baby onions, peeled, cut in half ", "110ml/4fl oz double cream ", "1 pinch freshly ground nutmeg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas1.", "Place the bacon pieces into a large saucepan, cover with the chicken stock and bring to the boil. Remove the bacon pieces and pat dry with kitchen paper. ", "Divide the carrots, celery and thyme among four large paper bags. Add a splash of beer to each bag, place the bacon on top, then roll the tops of the bags down to seal. ", "Roast in the oven for 2-3 hours, or until the bacon is very tender. Remove the bacon and set aside to rest for 30 minutes. ", "Meanwhile, melt the butter in a frying pan and add the baby onions and a pinch of salt. Fry for 1-2 minutes, without colouring, then add another splash of beer.", "Continue to cook until the beer has reduced completely, then stir in the cream and cook for another 30 seconds.", "To serve, place a spoonful of onions onto serving plates, and sprinkle over the nutmeg. Carve the bacon into thick slices and place a slice alongside the onions. Top with the carrots. "]}, {"isVegetarian": false, "title": "Bacon chop with apple and parsnip hash", "url": "www_bbc_co_uk_food_recipes_bacon_chop_with_apple_85819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["handful of leftover roast potatoes (or 1 large potato, chopped and roasted)", "25g/1oz butter ", "1 shallot, finely chopped ", "1 parsnip, grated ", "1 apple, peeled, cored and cut into 1cm/½in cubes", "olive oil, for frying", "2 bacon chops", "2 free-range eggs ", "5–6 fresh chopped sage leaves", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the roast potatoes into 2cm/¾in cubes, or thereabouts. Melt half the butter in a frying pan set over a medium heat. Gently fry the potatoes for about 6–8 minutes, or until they start to brown.", "Add the shallot and continue to fry gently for 3–4 minutes, it’s fine if they become a little coloured. Add the parsnip and apples. Allow everything to cook together over a low heat, tossing every 2 minutes or so, for 10–12 minutes. Season with salt and pepper. ", "Meanwhile, heat a a griddle pan over a medium heat. ", "Lightly rub some olive oil into the bacon chops and season with salt and pepper. Cook the chops on the griddle pan for 3–4 minutes on each side until cooked and hot through, then set aside to rest on a wire rack.", "Melt the remaining butter in another frying pan and fry the eggs to your liking.", "To serve, finish the hash with a scattering of the sage, then divide between two serving plates. Put a chop on each and top with a fried egg.  "]}, {"isVegetarian": false, "title": "Bacon or crackling scones (pogácsa)", "url": "www_bbc_co_uk_food_recipes_bacon_or_crackling_75198", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60ml /4 tbsp milk", "1 tsp dried yeast", "250g/9oz streaky bacon, chopped", "500g/1lb 2oz plain flour, plus extra for dusting", "1 tsp baking powder", "½ tsp salt", "2 tbsp parmesan, grated", "1 tbsp caraway seeds", "120g/4½ oz unsalted butter", "120ml/4fl oz soured cream", "2 eggs, beaten", "beaten egg and a drop of water, to glaze"], "serves": "Makes 12", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Gently heat the milk in a pan until it is lukewarm, then pour it into a jug and stir in the yeast. Leave it for 15 minutes or so to get working and froth up. ", "Meanwhile, heat a heavy-based pan and fry the bacon bits until crisp and golden. Remove them from the pan and leave to cool.", "Sift the flour into a bowl and mix with the baking powder and salt. Stir in the parmesan and caraway seeds. ", "Put the butter in a small pan over a gentle heat and allow it to melt until it is just liquid. Take the pan off the heat, stir in the soured cream and add the beaten eggs – make sure the butter isn’t too hot or the eggs will scramble. Add the cooled crispy bacon and stir in the yeasty milk.", "Pour the buttery egg and bacon mixture into a large bowl, then add the flour and other dry ingredients, a little at a time, until everything is combined. ", "Turn the dough out onto a floured work surface and knead for 5 minutes or so until elastic. You can do this with a mixer and a dough hook if you like. Put the dough in a lightly oiled bowl, cover with oiled cling film and leave it in a draught-free place for about an 1½ hours until it has doubled in size.", "Turn the dough out again and knock it back with your knuckles. Dust the dough with flour and roll it out to about 4 cm/1½ in thick. Cut out rounds with a pastry cutter and place them on a sheet of silicone baking parchment on a baking tray. Using a sharp knife, cut a criss-cross pattern on the top of each one, then leave to rest for another 30 minutes. ", "Preheat the oven to 200C/400F/Gas 6.", "Brush the scones with the beaten egg and water to glaze and bake them for 25–30 minutes until golden. ", "Eat them warm, split in half and spread with butter. Perfect with beef goulash soup."]}, {"isVegetarian": false, "title": "Bacon chops with whole roasted broccoli and three-cheese sauce", "url": "www_bbc_co_uk_food_recipes_bacon_chops_with_whole_45650", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole broccoli", "6 garlic cloves, grated, mixed with a little oil", "1 bunch fresh thyme, leaves and stalks separated", "100g/3½oz butter, diced", "pinch freshly grated nutmeg", "30g/1oz plain white flour", "30g/1oz butter", "285ml/10fl oz milk", "55g/2oz Stinking Bishop cheese, diced", "55g/2oz Gruyère cheese, grated", "55g/2oz strong cheese of your choice, grated", "salt and freshly ground black pepper", "1 tbsp English mustard", "1 tbsp crème fraîche", "75g/2½oz butter", "2 x 250g/9oz bacon chops", "1 tbsp chopped parsley", "300g/11oz new potatoes, boiled", "1 tbsp vegetable oil", "1 onion, finely sliced", "1 tsp smoked paprika", "1 tbsp chopped fresh parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted broccoli, preheat the oven to 180C/350F/Gas 4.", "Remove the stalk from the broccoli and cut it in half lengthways. Peel the hard woody bits from it. Set it to one side.", "Rub the grated garlic onto the broccoli head and place it in a deep roasting tray. Sprinkle over with the thyme stalks and top with the butter. ", "Roast for 35-45 minutes until just cooked. Baste in the butter 3-4 times whilst roasting. ", "Season with fresh nutmeg and set to one side.", "For the three-cheese sauce, melt the butter in a saucepan and then stir in the flour and cook for 1-2 minutes. Take the pan off the heat and gradually stir in the milk until you have a smooth sauce. Return to the heat and, stirring all the time, bring to the boil.", "When the sauce is smooth, stir in the cheeses until they are melted. Season with salt and pepper and pass through a sieve. Stir in the mustard and crème fraîche and set to one side.", "For the bacon chops, put the butter in a pan with 100ml/3½fl oz of water and bring to the boil. Add the broccoli stalk halves and bacon chops and cook until the stalks are tender and the bacon is cooked through. You may need to add a little more water. Drain and add the chopped parsley. ", "Heat the oil in a clean pan and gently fry the onion and cooked new potatoes together until golden-brown and hot through. Season with the smoked paprika. ", "Serve the bacon, broccoli stems, roasted broccoli and potatoes with the sauce."]}, {"isVegetarian": false, "title": "Bacon eggy bread", "url": "www_bbc_co_uk_food_recipes_bacon_eggy_bread_22406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_eggy_bread_22406_16x9.jpg", "ingredients": ["1 free-range egg", "3 tbsp milk", "2 slices crusty white bread, buttered", "15g/½oz smoked pancetta or bacon, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Break the egg into a mug, add a pinch of salt and pepper and beat well. Beat in the milk. Tear the bread into pieces and push into the eggy milk. Allow to stand for 5 minutes (or overnight).", "Scatter the pancetta over the top and season with more pepper.", "Microwave on high power for 2 minutes. Allow to stand for 30 seconds, then microwave for another minute. Leave to cool for 1 minute and it’s ready to eat!"]}, {"isVegetarian": false, "title": "Bacon, egg and cheese muffins", "url": "www_bbc_co_uk_food_recipes_bacon_egg_and_cheese_08419", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_egg_and_cheese_08419_16x9.jpg", "ingredients": ["4-6 bacon rashers bacon", "4 free-range eggs", "4 tbsp full-fat probiotic yoghurt (or ready-made apple sauce) ", "4 tbsp coconut flour", "40g/1½oz mature Cheddar, grated", "2 spring onions, trimmed, finely sliced", "small handful kale, tough stems removed, leaves finely sliced", "¼ tsp baking powder ", "¼ tsp salt", "large pinch freshly ground black pepper"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 6. Line 4 of the holes of a large muffin tin with baking paper.", "Heat a non-stick frying pan over a medium to high heat. Add the bacon in batches and dry-fry until crisp. Allow to cool, then chop into pieces and set aside.", "Beat the eggs and the yoghurt together until smooth and aerated, then stir in the remaining ingredients until well combined.", "Divide the muffin batter equally among 4 of the holes of the prepared muffin tin, or until the mixture reaches three-quarters of the way up the sides.", "Bake for 18-20 minutes, or until the tops of the muffins are golden-brown and a skewer inserted into the centre of the muffins comes out clean."]}, {"isVegetarian": false, "title": "Bacon rarebit with apple chutney", "url": "www_bbc_co_uk_food_recipes_bacon_rarebit_with_apple_45531", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_rarebit_with_apple_45531_16x9.jpg", "ingredients": ["150g/5½oz soft light brown sugar", "100g/3½oz sultanas", "125ml/4½fl oz malt vinegar", "2 eating apples, cored and roughly chopped", "3 tomatoes, roughly chopped", "1 onion, finely chopped", "8 slices dry-cured back bacon", "350g/12oz mature cheddar cheese, grated", "50ml/2fl oz beer", "1 tsp English mustard ", "3-4 dashes Tabasco sauce", "1 tsp Worcestershire sauce", "2 tbsp plain flour", "sea salt and freshly ground black pepper", "4 slices thickly sliced white bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat a large frying pan until hot. Add the brown sugar and sultanas and heat until the sugar is just melting. Add the vinegar and cook until totally dissolved and starting to caramelise.", "Stir in the apples, tomatoes and onion and cook for 10 minutes, or until the apple is tender and the mixture thickened. Remove from the heat and decant into a sterilised jar. ", "For the rarebit, preheat the grill to high.", "Place the bacon onto an oven tray and grill for 4-6 minutes, or until golden-brown at the edges and just cooked through.", "Place the cheese and beer in a frying pan and heat gently until the cheese is melted, bubbling and smooth, then stir in the mustard, Tabasco and Worcestershire sauce. Stir in the flour and cook until just thickened. Season, to taste, with salt and black pepper.", "Meanwhile, toast the bread on each side and then lay in an ovenproof dish. Top with two pieces of the cooked bacon and spoon the rarebit mixture over the top.", "Grill for 2-3 minutes, or until the topping is golden-brown and bubbling. Serve with a dollop of chutney."]}, {"isVegetarian": false, "title": "Bacon strata", "url": "www_bbc_co_uk_food_recipes_bacon_strata_83356", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range eggs", "500ml/18fl oz full-fat milk", "250g/1lb 5½oz ricotta cheese", "125g/4½oz sourdough bread, ripped into small pieces", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "1 onion, finely sliced", "200g/7oz smoked bacon lardons", "175g/6oz roasted butternut squash, chopped", "150g/5½oz buffalo mozzarella, chopped", "1 tbsp chopped fresh sage", "75g/2¾oz freshly grated parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Beat the eggs and milk together in a bowl. Add the cheese and bread and mix until well combined. Season with salt and freshly ground black pepper.", "Heat the oil in a frying pan and fry the onion until soft.  Add the bacon and cook until golden-brown and crisp. Stir in the butternut squash, mozzarella and sage", "Spoon half the eggy bread mixture onto the base of a 25cm/10in ovenproof dish. Add half of the squash mixture.", "Repeat the layering process in point 4. Finish by sprinkling over with parmesan and bake in the oven for 30 minutes, or until the mixture has set and the cheese is bubbling on top.", "Serve the bacon strata with green vegetables and garlic bread."]}, {"isVegetarian": false, "title": "Bacon and cheese-wrapped sausages", "url": "www_bbc_co_uk_food_recipes_baconandcheesewrappe_78526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sausages", "2 tsp vegetable oil", "55g/2oz mature cheddar, in chunks", "2 slices of back bacon, stretched with the back of a knife"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan over a medium heat. Add the sausages and cook them for about 5 minutes, so that all the sides are brown and cooked through.", "Remove from the sausages from the pan and cool. Once cool enough to handle make slits lengthways down each sausage.", "Stuff the cheese inside the slits, then wrap up with the bacon.", "Place in the oven for 5-10 minutes, or until the bacon is nice and crispy and the sausages are cooked through.", "Remove from the oven and serve on a warm plate."]}, {"isVegetarian": false, "title": "Bacon waffles with poached eggs and hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_bacon_waffles_with_50318", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour", "1 tsp baking powder", "1 tsp salt", "1 tbsp caster sugar", "3 free-range eggs", "425ml/15fl oz whole milk", "115g/4oz unsalted butter, melted", "8 slices cooked American-style bacon (or rindless smoked streaky bacon), chopped", "1 shallot, finely diced", "3 peppercorns", "1 bay leaf", "2 tbsp white wine vinegar", "2 large free-range egg yolks", "125g/4½oz butter, melted", "sea salt and freshly ground black pepper", "2 tbsp white wine vinegar", "4 free-range eggs", "12 slices streaky bacon", "2-3 tbsp finely chopped chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a waffle maker to the medium setting. Preheat the oven to 135C/275F/Gas 1.", "In a large mixing bowl mix the flour, baking powder, salt and sugar. Whisk in the eggs, milk and melted butter until well combined. Stir in the cooked bacon.", "Pour a ladleful of the batter into each well of the waffle maker, close the lid and cook for five minutes, or until golden-brown and crisp. Repeat the process until the batter is used up, keeping the cooked waffles warm on a wire rack in the oven.", "For the hollandaise, place the shallot, peppercorns, bay leaf, white wine vinegar and two tablespoons of water in pan and cook until the volume of liquid has reduced by half. Strain into a large bowl and cool slightly.", "Add the egg yolks into the vinegar mixture with a pinch of salt. In a steady stream, gradually add the melted butter until it is all incorporated. Season the sauce with sea salt and freshly ground black pepper.", "For the eggs and bacon, bring a pan of salted water to the boil and add the vinegar. Reduce the heat to a simmer and whisk the water to create a whirlpool. Once settled, carefully crack an egg into the water. Simmer gently for 2-3 minutes, remove the poached egg with a slotted spoon and place on a plate to drain. Repeat the process with the remaining eggs.", "Heat a frying pan until hot, add the bacon and cook until crisp on both sides. Drain the bacon on kitchen paper.", "To serve, place the waffles onto serving plates, top with the poached eggs and bacon. Finish with a drizzle of hollandaise sauce and the chopped chives."]}, {"isVegetarian": false, "title": "Bacon and chilli cornbread", "url": "www_bbc_co_uk_food_recipes_baconandchillicornbr_72338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp corn oil", "350g/12¼oz smoked streaky bacon, diced", "2 spring onions, finely chopped", "115g/4¼oz corn kernels", "½ tsp dried chilli flakes", "300g/10½oz polenta", "350g/12¼oz plain flour", "1 tbsp caster sugar", "1 tsp baking powder", "½ tsp baking soda", "½ tsp salt", "375ml/13½fl oz buttermilk ", "2 eggs, lightly beaten", "1 tbsp maple syrup", "½ tsp ground black pepper", "2 tbsp unsalted butter, melted"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6. Lightly butter a cake tin.", "Heat the oil in a frying pan and fry the bacon until it is crisp and releases its fat.  Add the spring onions and cook for five minutes, then add the corn kernels and chilli flakes and stir to combine.  Allow to cool slightly.", "Combine the polenta, flour, sugar, baking powder, baking soda, and salt.  Add the bacon mixture, the buttermilk, eggs, maple syrup, black pepper and half the melted butter.  Mix well.", "Pour the batter into the prepared cake tin and brush the top with the remaining melted butter.  Bake until golden (about 20-25 minutes).  Serve warm."]}, {"isVegetarian": false, "title": "Bacon and lentils", "url": "www_bbc_co_uk_food_recipes_baconandlentils_14547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["560g/1½lb bacon joint ", "12 button onions ", "1 tbsp oil ", "450g/1lb puy lentils ", "1 carrot, halved ", "1 stick celery ", "1 bay leaf ", "1 sprig thyme ", "2 cloves garlic, crushed ", "1 knob of butter ", "3 hard boiled egg ", "2 tbsp chopped parsley"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Put the bacon into a pan and cover with cold water. Bring to the boil. Drain and rinse in cold water and pat dry with kitchen paper. ", "Heat the oil in a deep casserole pan and add the bacon and onions. Cook until the onions begin to brown. ", "Add the lentils, carrot, celery, herbs and garlic. Cover with water and put on a lid. Cook very slowly for about 2 hours. ", "When the lentils are cooked remove the bacon, herbs and carrot. Strain the lentils. ", "Spoon the lentils onto a serving dish and stir in the butter. Slice the bacon and place around the dish. Garnish with chopped parsley and halved, hard boiled eggs."]}, {"isVegetarian": false, "title": "Bacon and mushroom salad", "url": "www_bbc_co_uk_food_recipes_baconandmushroomsala_77657", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 field mushroom, sliced", "½ red onion, sliced", "1 orange, zest only", "1 slice bacon, fried and sliced", "85g/3oz Stilton, crumbled", "2 handfuls fresh flatleaf parsley", "2 tbsp olive oil", "1 tbsp balsamic vinegar", "3 cloves garlic, sliced and fried", "1 slice bread, cut into a thick round"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl mix together the mushrooms, red onion, orange zest, bacon, Stilton, parsley, olive oil and balsamic vinegar. ", "Heat a griddle pan and griddle the bread for two minutes on each side.", "Serve the salad on top of the grilled bread, topped with the garlic."]}, {"isVegetarian": false, "title": "Bacon and Brussels sprout salad", "url": "www_bbc_co_uk_food_recipes_baconbutteredbrussel_84617", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baconbutteredbrussel_84617_16x9.jpg", "ingredients": ["1 tbsp olive oil", "100g/3½oz smoked bacon lardons", "500g/1lb 2oz Brussels sprouts, trimmed", "50g/1¾oz dried cranberries", "bag mixed leaves", "100ml/3½fl oz marsala or sherry ", "50g/1¾oz pecans, lightly toasted", "3 tbsp walnut oil", "2 tbsp sherry vinegar", "½ tsp honey", "½ tsp mustard (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large sauté pan. Add the bacon and cook until very crisp and the fat has rendered off. Remove with a slotted spoon and drain on kitchen paper.", "Thinly slice the Brussels sprouts and add to the pan. Cook on a high heat until the sprouts are starting to brown around the edges. Add 100ml/3½fl oz water and continue to cook, stirring regularly, until the water has evaporated off and the Brussels are just cooked – they should have wilted a little but still be a very fresh looking green. Keep warm.", "Meanwhile, put the cranberries in a small saucepan and cover with the marsala. Bring to the boil and simmer until all the liquid has been absorbed by the cranberries – they will be glossy and plump.", "Whisk the walnut oil and sherry vinegar together with the honey and mustard, if using. Season with salt and pepper. ", "To assemble the salad, arrange the leaves in a bowl or serving platter. Add the Brussels sprouts and most of the dressing and toss gently. Sprinkle over the bacon, pecans and cranberries and serve."]}, {"isVegetarian": false, "title": "Bacon butty with mustard mayo", "url": "www_bbc_co_uk_food_recipes_baconbuttywithmustar_88034", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 rashers streaky bacon", "2 slices ciabatta", "drizzle olive oil", "150ml/¼ pint Greek-style yoghurt", "1 tbsp double cream", "2 tsp wholegrain mustard", "squeeze lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the bacon butty, heat a griddle pan, add the streaky bacon and cook until crisp. Set aside.", "Drizzle two slices of ciabatta with olive oil and then chargrill on both sides in the same pan in which you cooked the bacon.", "For the mustard mayo, mix together the yoghurt, cream, mustard, lemon juice, salt and freshly ground black pepper in a bowl.", "To serve, pile the bacon onto the griddled ciabatta. Spoon over a generous dollop of mayo and place the other slice of griddled bread on top."]}]