[{"isVegetarian": false, "title": "Hot smoked trout with peas and fresh mint", "url": "www_bbc_co_uk_food_recipes_hotsmokedtroutwithpe_91173", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 tsp rapeseed oil", "4 x 150g-175g/5-6oz scaled trout fillets, skin on", "salt and freshly ground black pepper", "1 large handful wood chippings (ideally made from alder)", "4 tbsp first pressed rapeseed oil", "4 tsp white wine vinegar ", "1 shallot, finely chopped", "salt and freshly ground black pepper", "200g/7oz fresh or frozen garden peas", "1 small bunch fresh mint, finely chopped", "1 punnet pea shoots, to serve", "300g/11oz frozen small peas", "110ml/4fl oz double cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the trout, place the wood chippings on the bottom of a metal old tray fitted with a grill rack. Lightly oil the rack and place it on top of the tray, so that (it is should be 4-5cm/1½-2in from the bottom of the tray).", "Rub the trout fillets with oil and lightly season with salt and freshly ground black pepper. Place them on the rack skin-side down.", "Cover the entire tray with a double layer of heavy-duty aluminium foil and seal very tightly around the edges, making sure that the foil is not touching the trout.", "To cook, first ensure that you're working in a well-ventilated area. Place the tray on a very high gas flame to cook for two minutes; then carefully cut a little hole in the top of the foil with a pair of kitchen scissors (for the smoke to escape). Remove the tray from the heat and leave to rest (ideally outside) while you prepare the salad and pea purée. ", "For the salad, combine the oil, vinegar, shallot and a pinch of salt and freshly ground black pepper in a small saucepan. Cook gently on the stove for a few minutes so that all the vinegar is absorbed by the shallots.  ", "Bring a pan of salted water to the boil, add the garden peas and cook until tender. Drain the peas and add to the shallots. Mix to combine; then add the chopped mint.", "For the pea purée, cook the frozen peas in large pan of boiling water until tender. While the peas are cooking, pour the cream into a pan large enough to accommodate the peas as well. ", "Bring the cream to the boil, then reduce the heat and keep it warm.", "When the peas are cooked, drain them and add to the cream. Cook for a couple more minutes.", "Place the peas and cream in a blender or food processor and blend to a smooth purée. Pass the mixture through a fine sieve and season with salt and black pepper, to taste. ", "To serve, place a spoonful of pea purée onto the centre of each serving plate. Place a fillet of smoked trout on top and spoon the salad around. Garnish with pea shoots."]}, {"isVegetarian": true, "title": "Hot spiced fruit with ice cream", "url": "www_bbc_co_uk_food_recipes_hotspicedfruitwithic_92530", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["punnet of English plums, stalks removed", "good sprinkling of unrefined caster or granulated sugar", "good sprinkling of light muscovado sugar ", "few whole cloves", "1 cinnamon stick", "1 fresh bay leaf", "good quality vanilla ice cream, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the whole plums into a large shallow pan over a medium heat and sprinkle over both types  of sugar, adding more or less depending on the sweetness of the fruit and how sweet your tooth  is. ", "Add enough water to cover the fruit halfway up, then drop the cloves, cinnamon stick and bay leaf into the pan. Bring to a simmer, then cover the pan with a lid and reduce the heat. Cook for 6-7 minutes, until the  plums have collapsed a  little bit and the juices have mixed with the sugar. ", "Serve the very cold ice cream in bowls, spoon over the hot plums and some of the cooking juices and serve immediately."]}, {"isVegetarian": true, "title": "Hot sweet and sour strawberries with vanilla cream", "url": "www_bbc_co_uk_food_recipes_hotsweetandsourstraw_85805", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 tbsp caster sugar", "1 tbsp red wine vinegar", "1 tbsp red wine", "½ vanilla pod, seeds scraped out", "3 fresh strawberries", "75ml/2½fl oz double cream", "½ vanilla pod, seeds only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil, caster sugar, red wine vinegar, red wine, vanilla pod and seeds in a small non-stick frying pan.", "Add the fresh strawberries and heat gently until glazed and warmed through.", "Spoon the strawberries around the edge of a serving plate and pour the pan juices over them.", "For the cream, lightly whisk the double cream and vanilla seeds together.  ", "Spoon the cream into the centre of the plate to serve."]}, {"isVegetarian": true, "title": "Hot, sweet and sour strawberries with vanilla cream", "url": "www_bbc_co_uk_food_recipes_hotsweetandsourstraw_88193", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 tbsp caster sugar", "1 vanilla pod, split with a sharp knife to remove the seeds", "2 tbsp red wine vinegar", "100g/3½oz fresh strawberries", "75ml/2½fl oz red wine", "100ml/3½fl oz double cream", "½ vanilla pod, seeds only", "2 tsp icing sugar", "2 tbsp sugar-coated chocolate buttons"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the hot, sweet and sour strawberries, heat the olive oil and sugar in a frying pan until caramelised. Add the split vanilla pod and red wine vinegar and simmer for two minutes. Add the strawberries and shake in the sauce for one minute. Remove the strawberries to a plate.", "Add the red wine to the pan and simmer for three minutes, or until the sauce has reduced slightly and turned syrupy.", "For the vanilla cream, whip the double cream, vanilla seeds and icing sugar together in a bowl until soft peaks form when the whisk is removed. Stir in the sugar-coated chocolate buttons.", "To serve, spoon the vanilla cream into the middle of a serving bowl. Pour the strawberries around the cream and then pour over the sauce from the frying pan."]}, {"isVegetarian": false, "title": "Hot sweet and spicy beetroot soup", "url": "www_bbc_co_uk_food_recipes_hotsweetandspicybeet_84433", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 shallot, sliced", "1 clove garlic, chopped", "1 large beetroot, grated", "2 tbsp red wine vinegar", "pinch of sugar", "200ml/7fl oz beef stock", "Greek yoghurt", "chives, chopped to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium heat and fry the shallot and garlic until soft.", "Add the beetroot and red wine vinegar and cook to reduce the liquid.  ", "Add the sugar and cook for one minute.", "Add the beef stock and simmer for 10 minutes.", "Transfer the soup into a serving bowl, and serve with a spoon of Greek yoghurt and chopped chives."]}, {"isVegetarian": true, "title": "Hot Vacherin", "url": "www_bbc_co_uk_food_recipes_hotvacherin_73054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 500g/1lb Vacherin Mont d'Or cheese", "fresh figs, chicory, biscuits and raisin bread, to serve"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Place the whole Vacherin, in its lidded box, on a baking tray in the oven and bake for 20-25 minutes until runny.", "Place the box of melted cheese on a serving plate and serve with fresh figs and chicory and some savoury biscuits and raisin bread, like a fondue."]}, {"isVegetarian": true, "title": "Hot sweet soufflé", "url": "www_bbc_co_uk_food_recipes_hotsweetsouffle_84346", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites", "3 tbsp caster sugar", "1 tsp cornflour", "3 free-range egg yolks", "30g/1oz fudge, crumbled", "6-8 raspberries, to decorate"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Place the egg whites into a clean bowl and whisk, gradually adding the caster sugar and cornflour until the mixture forms stiff, glossy peaks, when the whisk is removed. ", "Place the egg yolks into a separate bowl and whisk. Then stir in the fudge and raspberries.", "Gently fold the egg whites into the egg white and fudge mixture and stir to combine. ", "Transfer the egg mixture into a flameproof saucepan, and place into the oven to cook for six to eight minutes or until well risen and golden. ", "To serve, serve the soufflé in the saucepan and dust with the icing sugar."]}, {"isVegetarian": false, "title": "Hotwater pastry", "url": "www_bbc_co_uk_food_recipes_hotwaterpastry_1279", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "pinch of salt", "1 egg, beaten", "100ml/3½fl oz water", "80g/3oz lard"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour, salt and egg into a bowl and roughly mix together.", "Put the water and lard in a small saucepan and heat together until it reaches boiling point.", "Stir into the flour mixture and bring into a ball. Wrap in clingfilm and rest at room temperature for 5 minutes before moulding into your pie dish or mould.", "The pastry will harden as it cools."]}, {"isVegetarian": false, "title": "Roast ham", "url": "www_bbc_co_uk_food_recipes_how_to_cook_a_ham_22897", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_a_ham_22897_16x9.jpg", "ingredients": ["1 raw smoked ham, about 5kg/11lb, bone in", "2 leeks, halved", "1 onion, halved", "1 carrot, cut into big chunks", "10 black peppercorns", "2 bay leaves", "1 tsp coriander seeds", "1 tsp grated orange zest", "3 tbsp demerara sugar", "3 tbsp light muscovado sugar", "2-3 tbsp English mustard powder", "handful whole cloves, for decoration", "honey to drizzle"], "serves": "Serves 8-10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Test the saltiness of your ham by slicing a small piece off the end and frying it in a little oil. If the ham is very salty, you will need to soak it for 12 hours in cold water, changing the water once. If your ham is quite salty, place the joint in a very large pan, cover with cold water, bring to the boil. Drain and discard the cooking water. ", "Once the ham is ready to cook, put the joint into a large pan, cover with fresh cold water and add the leeks, onion, carrot, peppercorns, and bay leaves. Bring to the boil, cover with a lid then simmer the ham for about 20 minutes per 450g/1lb.  To test that the ham is cooked, stick a cold skewer down into the centre of the ham and leave it for 10 seconds. Take it out and test it carefully against your lip. It should be piping hot.", "Let the ham cool a little in its cooking liquid, then carefully lift it out and onto a board. (The liquid can be used as a delicious stock for split pea soup and other recipes.) Leave the ham to cool a little. ", "Using a small sharp knife, carefully cut the skin from the ham, leaving behind a good even layer of fat. ", "Score the fat into a diagonal criss-cross pattern with a sharp knife. The ham can now be chilled for up to two days, or you can bake it straight away. ", "Preheat the oven to 220C/425F/Gas 7. ", "Grind the coriander seeds in a pestle and mortar. In a bowl, mix the grated orange zest and sugars, then add the ground coriander seeds. Sift the mustard powder evenly over the ham, then scatter the sugar mixture over the work surface and roll the ham in the mixture to coat the fat. Push a clove into the centre of each diamond in the fat of the ham. Drizzle over the honey.", "Cover the exposed end of the ham loosely with foil, securing with a few toothpicks. Place the ham on a rack inside a roasting tin and bake the ham for 15 minutes until the glaze is sticky and crisp, maybe even a little charred here and there. Eat hot or cold."]}, {"isVegetarian": false, "title": "How to cook pheasant", "url": "www_bbc_co_uk_food_recipes_how_to_cook_pheasant_05547", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_pheasant_05547_16x9.jpg", "ingredients": ["2 pheasants, about 500g/1lb 2 oz each", "50g/2oz flour", "salt", "1 tbsp vegetable oil", "knob of butter", "1 tbsp unsalted butter", "1½ banana shallots, finely chopped", "1 sprig thyme, leaves picked and finely chopped", "2 garlic cloves, crushed", "½ glass of white wine", "4 tsp cider or white wine vinegar", "300ml/10fl oz chicken stock ", "2 tsp Dijon mustard, or more to taste", "100ml/3½fl oz double cream", "Puy lentils, cooked according to the packet instructions, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the pheasant first. Pheasant legs have tough tendons that need to be removed before cooking. Using a pair of pliers, tug hard on the exposed ends of the tendons (at the foot end), and pull them out. ", "Cut the legs and thighs away from each bird, but leave the breast meat attached to the ribcage. Cut away the backbone using strong kitchen scissors or poultry shears.", "Place the flour onto a plate and season with salt. Dust the skin of the pheasant with the flour, shaking off any excess.", "Preheat the oven to 200C/400F/Gas 6. ", "Heat a large frying pan until hot, then add the oil and knob of butter. Fry the legs and breast meat, skin-side down, until browned on all sides (don't crowd the pan - if necessary, fry the meat in batches). Set the breast sections aside on a plate and put the legs in a roasting tray. ", "Put the pheasant legs into the oven to roast for 5-7 minutes. Add the breast sections, skin-side up, then continue to roast all the meat for another 10-12 minutes. Remove from the oven onto a warm plate, reserving the cooking juices, and loosely cover the pheasant with foil. Allow to rest for five minutes.", "Meanwhile, make the sauce while the pheasant is roasting. Into the same pan as the pheasant cooking juices, add butter the shallots, thyme and a little salt. Cover and cook gently for 10 minutes until the shallots have softened. Then add the garlic and fry for another minute. ", "Pour in the wine, turn up the heat and boil the sauce furiously until the wine has evaporated away to leave no watery liquid. Add the cider or white wine vinegar and continue to cook until the liquid has disappeared.", "Pour in the stock and continue to cook, reducing the liquid to about a third of its original volume.", "Add the mustard and stir in the cream. Return to the boil then simmer for a few minutes until the sauce is just thickened. Add the reserved cooking juices and season, to taste, with salt and freshly ground black pepper. ", "Carve the pheasant breast from the ribcage (it should still be a little pink). This will give two pieces of breast from each bird. Cut into thick slices.", "To serve, arrange Puy lentils on each of four plates, spoon over a generous amount of sauce, then top with one sliced breast and a leg per plate. Sprinkle over a little chopped curly leaf parsley."]}, {"isVegetarian": false, "title": "How to cook pork belly", "url": "www_bbc_co_uk_food_recipes_how_to_cook_pork_belly_03291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_pork_belly_03291_16x9.jpg", "ingredients": ["1.3kg/3lb piece belly pork ", "4 sprigs rosemary, leaves finely chopped ", "1 tbsp fennel seeds", "1 tsp freshly ground black pepper", "1 unwaxed lemon, zest only, grated", "1½ tbsp flaked sea salt", "1 tbsp sunflower oil", "2 large fennel bulbs", "4 cloves garlic", "250ml white wine", "squeeze lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pat the pork belly dry with kitchen paper and score the skin with a sharp kitchen knife (or DIY knife), if your butcher has not already done so.  The scoring should be right across the width of the meat, in parallel lines close together. The scoring should go through the skin, into the fat, but not into the meat below. ", "Preheat the oven to 220C/425F/Gas 7. ", "Chop together the rosemary leaves, fennel seeds, pepper, lemon zest and salt. Rub the pork all over with the sunflower oil before rubbing the herb and salt mixture into the skin, pushing it in between the scored lines. Place the pork onto a rack sat in a roasting tin, skin-side up, and cook for 35-40 minutes or until the skin starts to puff and crisp at the edges. ", "Meanwhile, prepare the fennel. Remove the stalks of the fennel and set aside any feathery fronds. Slice the bulb into thin wedges. Flatten the garlic and remove the peel, leaving the cloves whole. ", "Remove the pork belly from the oven and turn the oven down to 160C/300F/Gas 2. Lift the rack off the roasting tin and add the fennel, garlic and white wine to the pork fat in the roasting tin and stir to coat. Set the rack back on top. Return the pork and fennel to the oven and roast for a further hour at 160C/300F/Gas 2.", "Remove the fennel from the oven, when it is tender and golden brown (this will take approximately 30-40 minutes). Squeeze over some lemon juice, then cover and set aside in a warm place.", "To finish the pork, turn the oven back up to 200C/400F/Gas 6. Cook the pork for another 20 minutes, or until the skin is very crisp. Slice the pork belly and serve the fennel alongside, sprinkling over the chopped reserved fennel fronds for garnish. "]}, {"isVegetarian": false, "title": "How to make steak and ale pie", "url": "www_bbc_co_uk_food_recipes_how_to_cook_steak_and_15585", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_steak_and_15585_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for rolling out", "½ tsp fine salt", "250g/9oz unsalted butter, cold but not rock hard (or you can use half butter, half lard)", "150ml/¼ pint ice-cold water", "1 free-range egg, beaten, to glaze", "1 kg/2lb 4oz braising steak, cut into matchbox-sized pieces", "3 tbsp plain flour", "3 tbsp olive oil", "300ml/½ pint brown ale", "2 garlic cloves, roughly chopped", "2 onions, roughly chopped", "250g/9oz carrots, roughly chopped", "2 sticks celery, roughly chopped", "1 bay leaf", "handful fresh thyme sprigs", "300ml/½ pint good-quality beef stock", "1 tbsp tomato purée ", "1 tbsp balsamic vinegar", "500g/1lb 2oz chestnut or white mushrooms, halved or cut into quarters if large", "knob of butter", "salt and freshly ground black pepper"], "serves": "Serves 4 - 6", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour and the salt into a large mixing bowl, then put into the fridge for a few minutes to chill. (Keeping the flour and bowl cold will help you to get a better result later and create nice separate layers or pastry.)", "Meanwhile, cut the butter into small cubes. Using a round-bladed knife, stir it into the bowl until each piece is well coated with flour. Pour in the water, then, working quickly, use the knife to bring everything together to a rough dough.", "Gather the dough in the bowl using one hand, then turn it onto a work surface. Squash the dough into a fat, flat sausage, without kneading. Wrap in cling film then chill it in the fridge for 15 minutes. ", "Lightly flour the work surface and the pastry. Roll out the pastry in one direction until it’s about 1cm thick and three times as long as it is wide, or about 45x15cm/18x6in. Straighten up the sides using your hands now and again, and try to keep the top and bottom edges as square as possible. ", "Fold the bottom third of the pastry up, then the top third down, to make a block about 15x15cm/6x6in. It doesn’t matter if the pastry isn’t exactly the right size, the important thing is that the corners are square. ", "Turn the dough so that its open edge is facing to the right, like a book. Press the edges of the pastry together using the rolling pin.", "Roll out and fold the pastry again, repeating this four times in all to make a smooth dough, with buttery streaks here and there. If the pastry feels greasy at any point, or starts to spring back when as you roll, then cover and chill it for 10 minutes before continuing. Chill the finished pastry for an hour, or ideally overnight, before using.", "For the filling, mix the beef with the flour and some salt and pepper. An easy way to do this without making too much mess is to put everything into a large food bag, seal, then shake well.", "Heat a tablespoon of the oil in a large heatproof casserole up to a medium heat, then add half the beef, shaking off the excess flour and keeping the chunks well spaced so they fry rather than sweat. Brown for about 10 minutes, until golden-brown all over. ", "Transfer the first batch of meat to a bowl, then add a splash of brown ale or water to the pan and scrape up any meaty bits. Tip the liquid into the bowl of meat. Wipe out the pan, then add a tablespoon of oil and brown the second batch of beef. When the beef is golden-brown transfer it to the bowl and set aside.", "Add the final spoon of oil to the pan and heat gently. Add the garlic, onions, carrots, celery and herbs to the pan and fry for a few minutes, until softened.", "Put the beef back into the pan. Pour in the stock and brown ale, then add the tomato purée and balsamic vinegar. If necessary, add a little more stock or hot water to ensure the meat is covered in liquid (this will prevent the beef from drying out). Bring to the boil, then cover and simmer the stew for 1–1½ hours until the beef is almost tender and the sauce has thickened. Set aside to cool, overnight if possible. ", "Melt the butter in a large frying pan, then add the mushrooms. Season with salt and freshly ground black pepper, then fry over a high heat for 5 minutes, or until golden-brown. Mix with the cooled pie filling and add to the pie dish. ", "To make the pie, preheat the oven to 200C/Fan 180C/Gas 6. Flour the work surface, then roll out the pastry to the thickness of two £1 coins and wide enough to cover a family-size pie dish with some excess. Brush the edge of the pie dish with a little water or beaten egg.", "Use a sharp knife to cut the pastry to fit the top of the dish – if it’s too big it doesn’t matter. Lift on top of the pie, laying the pastry over a rolling pin to lift it. Press down gently to seal. ", "Holding the knife blade horizontally, make a patterned edge by pressing down gently all around the edge of the pastry (this will help the layers in the pastry to puff up). ", "Cut a couple of slits in the top of the pie to release steam. Brush the top of the pie with the beaten egg – taking care to avoid getting egg on the edges of the pastry as it will stick the layers together. Chill for 10 minutes, or until the pastry is firm. Bake for 30 minutes, or until the filling is bubbling and the pastry is golden-brown and puffed all over. "]}, {"isVegetarian": false, "title": "How to cook venison", "url": "www_bbc_co_uk_food_recipes_how_to_cook_venison_11210", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_cook_venison_11210_16x9.jpg", "ingredients": ["500g/1lb 2oz venison fillet, at room temperature", "3 tbsp vegetable oil", "salt and freshly ground black pepper", "300g/10½oz fine green beans", "100g/3½oz bag watercress, or a mix of peppery leaves", "½ shallot, finely sliced", "handful of walnuts, roughly broken", "1 tbsp walnut oil", "1 tsp English mustard powder", "1 pickled walnut, thinly sliced, plus 2 tsp juice from the jar ", "1 gherkin, chopped ", "¼ tsp freshly ground black pepper", "1 tsp Worcestershire sauce ", "1 sprig tarragon, leaves picked ", "½ tsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a very sharp knife, cut away any silvery sinews that run down the length of the fillet.", "Rub the venison with a tablespoon of vegetable oil, then season generously with salt and freshly ground black pepper. Heat a large heavy-based frying pan until very hot, and then sear the fillet on all sides until dark golden-brown on the outside (this will take about two minutes). Then reduce the heat to low and gently fry, turning regularly, for 6-8 minutes or until cooked to your liking. ", "Transfer the venison onto a board, cover very loosely with a piece of foil and allow to rest for a few minutes while you make the dressing. Add a tablespoon or so of water to the hot frying pan, and scrape up any browned bits from the pan with a wooden spoon. Set aside to cool.", "For the salad, trim the stalk end from the green beans. Bring a pan of salted water to the boil, then cook the beans for five minutes or until just tender. Drain, cool under cold running water (so they keep the bright green colour), then drain again, pat dry and set aside.  ", "For the dressing, in a small bowl whisk the mustard powder, pickled walnut juice, gherkin, black pepper and Worcestershire sauce together with the juices from the meat pan. Chop half the tarragon leaves and add to the dressing with the red wine vinegar.", "Carve the venison into slices on the diagonal. Add any juices from the meat to the dressing. Scatter the beans, watercress, pickled walnut, shallot and walnuts over four plates, top with the venison then spoon over the dressing. Drizzle with walnut oil and season to taste with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "How to make a tomato sauce", "url": "www_bbc_co_uk_food_recipes_how_to_make_a_tomato_07153", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_a_tomato_07153_16x9.jpg", "ingredients": ["4 tbsp extra virgin olive oil, plus more to serve ", "5 garlic cloves, thinly sliced", "2 tbsp tomato purée", "4 x 400g tins chopped plum tomatoes ", "1 tbsp caster sugar", "large bunch fresh basil, finely chopped", "salt and freshly ground black pepper", "2 herby pork sausages per person", "1 tsp olive oil, for frying ", "¼ tsp dried crushed chillies per person (optional)", "spaghetti, cooked according to packet instructions", "freshly grated Parmesan, to serve", "1 tbsp mascarpone per person", "spaghetti, cooked according to packet instructions", "basil leaves, to serve"], "serves": "Makes 8 servings", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the basic tomato sauce, heat the oil in a wide saucepan or large frying pan, then add the garlic and basil stalks and sizzle for 1 minute, without colouring them. Stir in the tomato purée.", "Tip in the chopped tomatoes, and sugar, then season with a generous amount of salt and pepper. Simmer for 5 minutes until the sauce is rich and thick. Stir in the basil leaves just before the end.", "For the sausage meatballs variation, cut the sausage skin and squeeze the meat from the sausages, pinching it into small meatballs as you squeeze. ", "Heat the oil in a non-stick frying pan, then add the sausage meatballs and fry for 10 minutes or until browned all over and cooked through. Season with the chillies. Stir in some of the tomato sauce then bring to a simmer. Add cooked pasta to the sauce, stirring to coat it in the sauce. Add 2 tablespoons of the pasta cooking water to thin down the sauce. Serve with freshly grated Parmesan.", "For the creamy mascarpone sauce variation, stir the mascarpone in to the tomato sauce until melted. Stir in cooked pasta to coat it in the sauce. Add two tablespoons of the pasta cooking water to thin down the sauce. Season to taste and serve scattered with basil leaves. "]}, {"isVegetarian": true, "title": "How to make an omelette", "url": "www_bbc_co_uk_food_recipes_how_to_make_an_omelette_22250", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_an_omelette_22250_16x9.jpg", "ingredients": ["2 medium courgettes", "200g/7oz asparagus spears", "8 large eggs", "salt and freshly ground black pepper", "handful fresh dill, roughly chopped", "1 tbsp extra virgin olive oil, plus a little drizzle to finish", "1 garlic clove", "bunch spring onions", "100g/3½oz round goats’ cheese", "½ unwaxed lemon, zest only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high (250-275C/480-520F). Slice the courgettes in quarters lengthways, and chop into smallish chunks. Cut the asparagus into short lengths, discarding the last 5cm/2in or so of each stalk.", "Beat the eggs with some salt and pepper and most of the dill. ", "Heat the oil in a medium frying pan, approximately 23cm, and fry the courgette over a high heat for two minutes or so to soften them, stirring often. Add the asparagus and cook for two minutes, until bright green and just tender and the courgette is browned here and there.", "Meanwhile, crush the garlic and finely slice the spring onions. Cut the cheese into small chunks.", "Add the garlic and two-thirds of the spring onions to the pan, grate in most of the lemon zest, fry for one minute, then pour in the eggs and scatter in half the cheese.", "With the pan over a medium heat, cook the omelette slowly, stirring gently to allow the runny egg on top to meet the heat of the pan. The egg will start to set like ribbons. When the egg is softly set all the way through, and slightly runny on top, remove from the heat.  ", "Scatter the omelette with the rest of the onions and cheese, then grill for two minutes or until just golden-brown. ", "Finish with the rest of the dill and lemon zest, and a drizzle of extra virgin olive oil of you like, then serve in wedges."]}, {"isVegetarian": true, "title": "Easy apple crumble pie", "url": "www_bbc_co_uk_food_recipes_how_to_make_apple_59768", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_apple_59768_16x9.jpg", "ingredients": ["375g/13oz pack ready-made sweet, all-butter shortcrust pastry", "4-6 Bramley apples (about 800g/1lb 12oz) ", "1 tbsp lemon juice", "1½ tbsp plain flour ", "½ tsp ground cinnamon", "½ tsp freshly grated nutmeg", "100g/3½oz golden caster sugar, plus a little extra for sprinkling", "50g/2oz raisins or sultanas, or fresh blackberries (optional)", "85g/3oz plain flour", "pinch fine salt", "85g/3oz unsalted butter, cut into small cubes", "4 tbsp caster sugar ", "handful porridge oats (optional)"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Lightly cover the work surface with flour, then roll out the shortcrust pastry until it is about 3cm/1½in larger than the pie plate. ", "Flip the pastry up over the rolling pin, then lift the pastry over the plate or tin. Press it into the tin, then trim the edge with a sharp knife. Chill the pastry while you make the filling. ", "Preheat the oven to 190C/375F/Gas 5 and put a baking sheet on the middle shelf.", "For the crumble topping, sift the flour and salt into a large bowl, then add the butter. Rub the butter into the flour using your fingertips until the mix looks like rough breadcrumbs. ", "Stir in the sugar and, if you like, a handful of oats. Chill the crumble topping in the fridge while you prepare the apples. ", "Peel the apples, cut in half, then into chunky slices, cutting out the core as you go. Toss the apple slices with the lemon juice in a large bowl.", "Sift over the flour, cinnamon and nutmeg and mix well to coat. Tip in the sugar, reserving some for the topping, and add in the raisins or fruit, if using. Mix well.", "Pile the apples into the pastry lined tin, scatter with the crumble mix and then a final sprinkling of sugar. (It will seem to be heaped high but will reduce and settle during baking.) Bake the pie for 30 minutes, or until the pastry and crumble are golden and crisp. Serve warm with cream or ice cream. "]}, {"isVegetarian": true, "title": "How to make banoffee pie", "url": "www_bbc_co_uk_food_recipes_how_to_make_banoffee_pie_35961", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_banoffee_pie_35961_16x9.jpg", "ingredients": ["75g/3oz unsalted butter", "200g/7oz digestive biscuits", "150g/5½oz light muscovado or soft brown sugar", "150g/5½oz unsalted butter", "1 x 397g can condensed milk", "pinch sea salt flakes", "2 ripe bananas", "150ml/¼ pt double or whipping cream", "100g/3½oz bar milk chocolate, grated"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Make the biscuit base first. Melt the butter in a medium-sized pan. Put the biscuits into a food bag and crush with a rolling pin, or pulse them until fine in a food processor. ", "Tip the biscuit crumbs into the melted butter until evenly coated. Pour the mixture into the centre of a 23cm/9inch loose-bottomed tart tin. Then press the mixture firmly over the base of the tin and up the sides. Transfer the base to the fridge to chill for about 30 minutes, until firm.", "While the base cools, make the caramel. Heat the brown sugar and butter together in a pan over a medium heat until the butter melts and the sugar has dissolved. At first the sugar and butter won’t mix, but keep stirring. As the sugar melts, it will come together. ", "Stir in the condensed milk and the sea salt flakes. Bring up to the boil, then take off the heat. ", "Take the set biscuit base out of the fridge and pour the caramel onto the biscuit base. Transfer to the fridge and leave to cool completely. ", "When ready to serve, slice the bananas and layer them over the set caramel. Pour the cream into a large bowl, and whip with electric hand beaters till thickened but not stiff. Spoon the cream over the bananas. ", "Grate the chocolate over the top of the pie.", "Remove the pie from the tart tin, by placing the tin on top of an upturned bowl, then sliding the edge of the tin down.  Move the bowl out of the way, then slide the banoffee pie off the tin base and onto a board or plate. It’s now ready to serve."]}, {"isVegetarian": true, "title": "How to make brownies", "url": "www_bbc_co_uk_food_recipes_how_to_make_brownies_14648", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_brownies_14648_16x9.jpg", "ingredients": ["200g/7oz dark chocolate (70% cocoa solids)", "150g/5½oz unsalted butter, plus extra for greasing the tin", "100g/3½oz milk or white chocolate, or a mix of both ", "125g/4½oz dark muscovado sugar", "125g/4½oz golden caster sugar", "4 free-range eggs, at room temperature", "85g/3oz plain flour", "2 tbsp cocoa powder, plus a little extra for dusting, if you like", "¼ tsp fine salt"], "serves": "Makes 16 - 20", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Place a medium saucepan containing an inch of boiling water from the kettle onto the hob and bring to a simmer.", "Meanwhile, use a little butter to grease the inside of a 23cm/9in square baking tin. Cut a square of baking parchment a bit bigger than your tin (roughly 27cm/11in). Snip a 5cm/2in cut diagonally from the corners toward the centre. Push the paper into the tin and ease the paper into the corners neatly - they will overlap slightly. Trim if needed. ", "Using a large sharp knife, chop the dark chocolate into small pieces (the smaller the pieces, the quicker it will melt). Place the chopped dark chocolate with the butter into a large mixing bowl that will sit on top of your pan of simmering water. ", "Set the bowl over the pan of simmering water, making sure that the bottom of the bowl does not touch the water. Keep the heat low - the water should not be boiling furiously underneath, but quietly bubbling. After a few minutes the chocolate and butter will start to melt. Stir occasionally, until the chocolate is mostly melted. Remove the bowl from the pan and set aside. The residual heat in the chocolate will finish off the melting process.", "While the chocolate is melting, chop the white (or white and milk) chocolate into bigger pieces - about the size of a penny. Set these aside.", "Whisk the sugar into the melted chocolate, then add the eggs and whisk together well until the mix is slightly bubbly. ", "Sift the flour, cocoa powder and the salt into a separate bowl. Using a large metal spoon, add the flour mix into the chocolate mixture a third at a time, and gently fold into the chocolate mixture until thoroughly combined. ", "Gently pour the batter into the prepared tin, and scatter the remaining chunks of chocolate on top. Bake the brownies for 20-25 minutes. The brownies should still wobble slightly in the middle, as they will continue to cook for a little while when removed from the oven. An over-baked brownie is dry and crumbly, rather than moist and fudgy, so keep an eye on them.", "Let the brownies cool completely in their tin. Lift them out of the tin onto a board, using the baking paper to help, then cut into squares. Sift over a little icing sugar or cocoa powder. Store in an airtight tin."]}, {"isVegetarian": true, "title": "How to make cheesecake", "url": "www_bbc_co_uk_food_recipes_how_to_make_cheesecake_30383", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_cheesecake_30383_16x9.jpg", "ingredients": ["125g/4½oz unsalted butter", "250g/9oz digestive biscuits", "3 eggs and 2 egg yolks, at room temperature", "1 vanilla pod (or 1 tsp vanilla paste)", "900g/2lb cream cheese, at room temperature", "200g/7oz golden caster sugar", "300ml/½ pint full-fat crème fraîche", "200g/7oz strawberries", "25g/1oz icing sugar"], "serves": "Serves 12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Melt the butter in a medium saucepan over a gentle heat. Brush a little of the melted butter around the base and sides of a 23cm/9in springform tin, then line the base with a circle of baking parchment.", "Put the biscuits into a large sealable freezer bag, squeeze out the air and seal the top. Use a rolling pin, or a bottle, to crush the biscuits to fine crumbs. ", "Stir the crumbs into the melted butter until completely combined. Press the crumbs into the tin. Use the back of the spoon to compact the crumbs as much as you can in an even layer. Put into the fridge to firm up while you make the cheesecake, roughly 30 mins - 1 hour.", "Preheat the oven to 180C/350F/Gas 4. ", "To separate the eggs, have three small bowls ready, preferably glass or ceramic. Gently crack the shell against the side of a small bowl. Slowly pull the shell apart as cleanly as possible along the crack, tipping the yolk into one half of the shell. Let the white drain away into the bowl below. Drop the yolk into another small bowl. Separate the next egg over a third bowl - that way if you accidentally break the yolk, it won’t contaminate the clean whites.  (The egg whites will keep for a week in the fridge, and can be whipped up to lighten pancakes.)", "Slit the vanilla pod lengthwise, and scrape the seeds out with the blunt side of your knife. Scrape the seeds from your knife (or spoon the vanilla paste) into a large mixing bowl with the cream cheese. Beat the cheese and vanilla together with a wooden spoon or a hand-held mixer until smooth.", "Add the sugar, then beat again till smooth. Now add the eggs and yolks, one at a time, followed by half of the crème fraîche.", "When the base is well chilled, wrap the outside of the tin in two sheets of wide foil. Ensure that the foil covers the sides of the tin more than halfway, then sit the wrapped tin in a deep roasting tin. Spoon in the cheesecake filling and smooth the top. ", "Boil a kettle full of water. Then place the roasting tin with the cheesecake on the top shelf of the oven. Pour the hot water from the kettle into the roasting tin around the cheesecake so that it comes halfway up the sides and carefully slide the tin into the oven. Bake for 10 minutes at 180C/350F/Gas 4, then turn the oven down to 140C/275F/Gas 1 and cook for another 40-50 minutes until the cheesecake is set, with a slight wobble in the middle. ", "Turn the oven off, and let the cheesecake cool in the oven, with the door ajar. When cool, remove from the oven and chill thoroughly. Cooling the cheesecake slowly will help to prevent the top from cracking.", "For strawberry sauce, put half of the strawberries into a food processor or blender, add the icing sugar then pulse until smooth. Slice the remaining strawberries and set aside.", "About half an hour before you want to eat the cheesecake, remove it from the fridge. Sweep a palette knife between the cake and the side of the tin, then carefully unclip the springform. Transfer the cheesecake to a serving plate. Spread the remaining crème fraîche over the surface of the cheesecake - this will cover any cracks that might have appeared. Decorate the top with the sliced strawberries - then cut into wedges and serve with the strawberry sauce poured over. "]}, {"isVegetarian": true, "title": "How to make carrot cake", "url": "www_bbc_co_uk_food_recipes_how_to_make_carrot_cake_28928", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_carrot_cake_28928_16x9.jpg", "ingredients": ["4 free-range eggs, at room temperature ", "200ml/7fl oz vegetable or sunflower oil, plus a little extra for the tin", "250g/9oz carrots, coarsely grated", "100g/3½oz raisins or sultanas", "100g/3½oz walnut pieces, plus a few extra for decoration", "1 orange, zest only", "200g/7oz self-raising flour", "2 tsp mixed spice", "1 tsp bicarbonate of soda", "¼ tsp fine salt", "200g/7oz light muscovado sugar", "150g/5½oz unsalted butter, at room temperature", "45g/3 tbsp caster sugar", "300g/10½oz full fat cream cheese"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, preheat the oven to 180C/350F/Gas 4. Grease and line a deep, 20cm/8in round cake tin with baking parchment. ", "Break the eggs into a bowl, and lightly whisk using a fork.", "Add the vegetable oil to the eggs and whisk again.", "Add the grated carrots, raisins, walnut pieces and orange zest.", "In a separate bowl, sift the flour, mixed spice, bicarbonate of soda and salt. Stir in the sugar. ", "Add the wet carrot mixture to the dry ingredients and mix well to combine, making sure there are no pockets of flour.", "Spoon the cake batter into the lined tin and bake on the middle shelf for 1 - 1¼ hrs, until the cake has risen and is golden-brown all over.  ", "Remove the cake from the oven and set aside in the tin to cool for 10-15 mins, then turn the cake out and leave to cool completely on a wire rack. ", "While the cake cools, make the frosting. Place the butter in a large bowl with the caster sugar, beat it for 2-3 minutes until light and creamy, then beat in the cream cheese until smooth. ", "Place the cake on to a serving plate or cake stand. Use a palette knife, or wide flat bladed knife,  to spread the frosting over the top and sides of the cake. Scatter more walnuts on the top. It’s now ready to serve. "]}, {"isVegetarian": false, "title": "How to make chicken noodle soup", "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_19119", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_19119_16x9.jpg", "ingredients": ["1 large roasted chicken carcass with approximately a third of the meat on the bone", "2 litres/3½ pints of water", "2 carrots, peeled ", "2 leeks", "1 onion, peeled and halved", "1 bay leaf", "6 black peppercorns", "1 chicken stock cube", "150g/5½oz egg or rice noodles", "100g/3½oz bok choi, roughly chopped", "3-4 spring onions, finely sliced", "50g/1¾oz canned sweetcorn", "3 tbsp soy sauce", "small bunch coriander, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the remaining meat from the chicken carcass and place it in the fridge. ", "Heat 2 litres/3½ pints of water up to a simmer in a large, deep saucepan.", "Place the roasted chicken carcass, along with any remaining cooking juices, into the hot water and add the carrots, whole leeks, onion, bay leaf, peppercorns and stock cube.", "Bring the stock up to the boil, reduce to a simmer and cook for an hour. Skim the stock from time to time to remove any scum that forms on the top.", "After cooking the stock for an hour, place a colander over a large pan. Pick out the chicken carcass from the stock and place it into the colander. Carefully pour the rest of the stock through the colander into the pan.", "Return the strained stock to the heat, and bring back up to a simmer.", "Meanwhile, tear the reserved roast chicken into small pieces.", "Add the noodles to the chicken stock and cook for a minute before adding the chicken, bok choi, spring onion, sweetcorn and soy sauce to the pan. Cook for 2-3 minutes, then stir through the chopped coriander.", "Divide between four bowls and serve immediately."]}, {"isVegetarian": false, "title": "How to make chicken teriyaki", "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_71312", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_71312_16x9.jpg", "ingredients": ["4 chicken thighs", "30ml/2 tbsp honey", "60ml/4 tbsp soy sauce", "60ml/4 tbsp mirin", "30ml/2 tbsp sake", "2 tsp grated fresh root ginger", "1 garlic clove, chopped", "30ml/2 tbsp vegetable oil", "250g/9oz medium egg noodles"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remove the bones from the chicken thighs using a small, sharp knife.", "In a large bowl, mix together the honey, soy sauce, mirin, sake, ginger and garlic. ", "Place the chicken thighs in the marinade and cover the meat thoroughly with the sauce. Transfer the chicken to the fridge for 15 minutes. ", "When ready to cook the chicken, heat the vegetable oil in a frying pan. Dry the skin side of the chicken thighs on some kitchen paper, so the skin will crisp up when fried. Place the chicken thighs in the frying pan, skin side down, over a medium heat.  Fry until the skin is browned. Depending on the size of your frying pan, you may need to fry the chicken in batches - don't crowd the pan. ", "Turn down the heat to low, then turn the chicken over to fry the other side. Pour the sauce used to marinate the chicken into the pan. Simmer on a low heat for five minutes, then increase the temperature and cook until the sauce becomes thick. ", "Meanwhile, cook the noodles according to packet instructions.", "To serve, slice the chicken and place on a plate with the noodles. Pour the thickened teriyaki sauce over the chicken. "]}, {"isVegetarian": false, "title": "The best chicken stir-fry", "url": "www_bbc_co_uk_food_recipes_how_to_make_chicken_stir_01397", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chicken_stir_01397_16x9.jpg", "ingredients": ["1 chicken or vegetable stock cube or similar", "2 nests egg noodles", "100g/3½oz Tenderstem broccoli, cut into finger-lengths", "2 skinless chicken breasts (or you can use pork tenderloin)", "200g/7oz mushrooms, shiitake or chestnut, halved or quartered", "1 red onion, thickly sliced", "1 red pepper, deseeded and thickly sliced", "1 garlic clove, thinly sliced", "thumb-size piece fresh root ginger, thinly sliced ", "1 tbsp vegetable or sunflower oil", "½ tsp dried chilli flakes", "3 tbsp hoisin sauce, mixed with 2 tbsp water", "1-2 tsp sesame oil ", "handful cashew nuts or peanuts"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil, add the stock cube and let it dissolve. Add the noodles and bring back up to the boil. ", "Add the broccoli and boil for two minutes until the broccoli and noodles are just tender, then drain, rinse with cold water and set aside in the colander.", "Cut the chicken into strips, and prepare the mushrooms, onion, pepper, garlic and ginger.", "Heat one teaspoon of the vegetable oil in a large non-stick frying pan or wok, then add the chicken. Stir-fry the chicken for two minutes over a high heat until browned. ", "Take the chicken out of pan, and set aside on a plate while the vegetables are cooked. ", "Return the pan to the heat and add the remaining oil. Add the peppers, onions and mushrooms. Stir and cook for couple of minutes until just tender, but still brightly coloured, and the mushrooms are just browned.  ", "Add the garlic, ginger and chilli flakes then sizzle for a few seconds till fragrant. ", "Tip in the drained noodles, broccoli and the chicken and stir-fry until the noodles are hot. Add the hoisin sauce and water mixture, then mix so everything is coated in the sauce. If the noodles seem a bit dry, add a splash more water. To finish, drizzle with the sesame oil, scatter with the roasted nuts and serve immediately."]}, {"isVegetarian": true, "title": "How to make chilli pepper jam", "url": "www_bbc_co_uk_food_recipes_how_to_make_chilli_11991", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chilli_11991_16x9.jpg", "ingredients": ["5 red peppers", "8 red chillies", "1.25kg/2lb 12oz granulated sugar", "360ml/12fl oz white wine vinegar or cider vinegar", "225g/8oz canned chopped tomatoes", "125g/4½oz liquid pectin"], "serves": "Makes 3 jars", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To clean the jars, preheat the oven to 140C/275F/Gas 1. Wash the jars well in warm soapy water then rinse thoroughly under running water. Leave the jars and lids to dry, upside down, in the oven. (Or you can clean the jars by putting them through the hot cycle of a dishwasher.)", "Place a clean plate in the freezer to chill. This will be used to test if the cooked jam has reached setting point.", "For the jam, cut the peppers and chillies in half, then remove the seeds and white membranes (keep the white membranes of the chillies if you want more spicy heat). Either chop the peppers and chillies finely by hand or, alternatively, roughly chop them, then place in a food processor and pulse to chop finely.  ", "Place the chopped chillies and peppers into a wide, deep saucepan with the sugar, vinegar and tomatoes. Bring slowly to the boil, stirring, until the sugar has dissolved.", "Bring the mixture to a rolling boil for 7-10 minutes to reduce the liquid by a half. Remove from the heat and stir in the pectin. Return the pan to the heat and boil for another couple of minutes. ", "To test if the jam has reached setting point spoon a little onto the chilled plate. Leave for a moment, then push the edge of the jam with your finger - if the jam is ready the surface will wrinkle as you push.", "Once the jam has reached setting point, let it cool for five minutes before potting into the sterilised jars. The jam will keep in the sealed jar for up to six months."]}, {"isVegetarian": true, "title": "How to make chutney", "url": "www_bbc_co_uk_food_recipes_how_to_make_chutney_57366", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/how_to_make_chutney_57366_16x9.jpg", "ingredients": ["1kg/2lb 4oz Bramley apples", "500g/1lb 2oz onions", "2 garlic cloves", "5cm/2in piece fresh root ginger", "100g/3½oz sultanas (or other dried fruit such as dates and raisins)", "pinch dried chilli flakes ", "500ml/18fl oz distilled malt vinegar", "250g/9oz light muscovado sugar", "1½ tsp salt"], "serves": "Makes 7-8 jars of chutney", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Peel, core, then roughly chop the apples. Roughly chop the onions, finely chop the garlic and peel and finely chop the ginger. ", "Place the apple, onion, garlic, ginger, chilli flakes and fruit into a large, wide saucepan. Stir in the vinegar, sugar and salt. Stir the mixture over a medium heat until all the sugar has dissolved. ", "Once the sugar has dissolved, bring to the boil, then reduce the heat slightly and simmer the chutney for around one hour, stirring every so often. As it thickens, stir more frequently and watch that the sugar does not begin to stick to the bottom of the pan. The chutney is done when you can scrape a wooden spoon across the bottom of the pan and the chutney does not flow back into the gap. ", "Meanwhile, to clean the jam jars, preheat the oven to 140C/275F/Gas 1. Wash the jars well in warm soapy water then rinse thoroughly under running water. Leave the jars and lids to dry, upside down, in the oven. (Or you can clean the jars by putting them through the hot cycle of a dishwasher.)", "Carefully spoon the chutney into the sterilised jars and seal while hot. Store in a cool, dark place for about a month before eating, to let the flavours mellow."]}]