[{"isVegetarian": false, "title": "Fried ham and cheese sandwich", "url": "www_bbc_co_uk_food_recipes_fried_ham_and_cheese_34474", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_ham_and_cheese_34474_16x9.jpg", "ingredients": ["250g/9oz gruyère cheese, grated", "2 free-range egg yolks", "1 tbsp Worcestershire sauce", "1 tsp mustard powder", "2 pinches cayenne pepper", "dash cream (if mixture is too thick to spread)", "4 slices thin white bread (square)", "4 thin slices cooked ham", "olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the sandwich filling ingredients (except the cream) into a food processor and blend until smooth (the mixtuer should spread easily, but add a little cream if needed.) ", "Cover four slices of bread with a thin layer of cheese mixture almost to the edge, place a slice of ham over that and then finally place another slice of bread on to the ham. Press down firmly and then repeat the process for the second sandwich. Cut off the crusts and liberally brush (or spray) each side of the sandwiches with olive oil.", "Cut each sandwich in half to give four rectangles. Heat a large, non-stick frying pan until medium-hot and fry the sandwiches in the dry pan until gorgeously golden-brown and crusted on each side - about two minutes per side. "]}, {"isVegetarian": false, "title": "Fried pork fillet with quince and wilted chard", "url": "www_bbc_co_uk_food_recipes_fried_pork_fillet_with_64068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz pork fillet, trimmed", "salt and freshly ground black pepper", "1 tbsp olive oil", "50g/1¾oz unsalted butter", "110g/4oz sugar ", "90g/3½oz butter", "½ lemon, juice only", "500g/1lb 2oz quince, peeled, cores removed, chopped", "50g/1¾oz unsalted butter", "1 head chard, leaves removed and shredded", "200ml/7fl oz pork jus or gravy"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pork fillet, preheat the oven to 200C/400F/Gas 6.", "Season the pork fillet with salt and freshly ground black pepper.", "Heat an ovenproof frying pan until hot, add the oil then the pork fillet, and sear until golden-brown on all sides (about 30-45 seconds on each side). ", "Transfer the pan to the oven and roast for 6-8 minutes. Remove from the oven and rest for five minutes in the pan.", "For the quince, heat the sugar, 40g/1½oz of the butter and the lemon juice with 500ml/18fl oz water in a non-reactive saucepan until the sugar is dissolved and the mixture is well combined. ", "Add the quince and bring the mixture to the boil. Reduce the heat and simmer until the quince has softened. Strain off the liquid, reserving a few tablespoonsful.", "Transfer half of the quince to a food processor and blend to a smooth purée. Pass the purée through a fine sieve, loosening the strained mixture with a little of the reserved cooking liquid if necessary. ", "Put the quince purée in a clean saucepan. Season, to taste, with salt and freshly ground black pepper, and cover with cling film until required. ", "For the rest of the quince, heat the remaining butter in a frying pan and, once hot, add the quince and fry for 1-2 minutes.", "For the wilted chard, heat the butter in a large pan and once hot add the chard and cook until wilted.", "To serve, slice the pork and divide between two serving plates. Add the purée, fried quince and wilted chard."]}, {"isVegetarian": false, "title": "Fried mackerel and sweet potato gnocchi", "url": "www_bbc_co_uk_food_recipes_fried_mackerel_and_sweet_44395", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 large mackerel fillets ", "1 orange, juice and zest only ", "3 slices red onion ", "3 tbsp sherry vinegar ", "1 tsp sea salt ", "1 small glass white wine", "a few peppercorns", "3 bay leaves", "8 slices prosciutto", "500g/1lb2oz sweet potatoes", "500g/1lb 2oz potatoes, for mash ", "1 free-range egg  ", "200g/7oz 00 flour, plus extra for dusting", "2 litres vegetable stock ", "100g/3½oz unsalted butter ", "handful freshly picked samphire (optional)", "extra virgin olive oil, to taste", "12 large sage leaves, roughly chopped", "75g/2½oz parmesan, freshly grated ", "½ red onion, finely diced", "1 large bunch basil", "3 large ripe tomatoes, peeled and roughly chopped", "a pinch smoked sea salt (available in specialist delicatessens and online) ", "drizzle good olive oil ", "salt and freshly ground black pepper "], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the mackerel, cut the fillets in half and place in a large bowl. Add the zest of half the orange, the orange juice, onion slices, sherry vinegar, sea salt, white wine, a few peppercorns and the bay leaves. Leave to marinade for an hour, then drain off any liquid and set aside until ready to cook.", "For the Gnocchi, either boil or bake the sweet potatoes and potatoes in their skins until tender (boiling will be faster). If baking, heat the oven to 180C/350F/Gas 4 and bear in mind that the sweet potatoes will take less time to cook than the other potatoes.", "Once the potatoes and sweet potatoes are cooked and cool enough to handle, remove the skins and push the flesh through a potato ricer (or use a potato masher). ", "Season to taste with salt and freshly ground black pepper. Then add the egg and flour a little at a time to form a smooth, slightly sticky dough.", "Tip out the dough onto a clean, floured work surface. Divide the mixture into eight and roll into sausage shapes about 1cm/½in thick. Cut into 2cm/ ¾in long sections and roll in the flour. Carefully but quite firmly roll each piece down the prongs of a fork (this will make the traditional indentations). Compress the gnocchi lightly with your thumb and roll on a floured tray (to round off the ends). Set aside for a few hours to set (or you can freeze them until you need them).", "For the salad, combine all the ingredients together in a bowl. Toss together and set aside until ready to use.", "When you are ready to cook the gnocchi, fill a large pan with the stock and bring to the boil. Add the gnocchi. ", "While the gnocchi is cooking, make the sauce. Gently melt the butter in a large frying pan until the butter becomes a light-brown colour. Add the samphire (if using), a ladel of the gnocchi cooking liquor and some extra virgin olive oil. Remove from the heat and add the sage leaves.  ", "When the gnocchi float to the surface, they are ready. Drain and toss them in the butter. Season to taste with salt and freshly ground black pepper. Sprinkle over the parmesan. ", "For the mackerel, heat a large non-stick frying pan and fry the prosciutto until crisp. Remove from the pan and set aside.  ", "Fry the mackerel fillets in the same pan, skin side down first. After 2-3 minutes turn over and cook the other side for a few minutes.", "Serve the gnocchi with the tomato salad and fried mackerel topped with the crispy ham. Drizzle over the juice from the tomato salad."]}, {"isVegetarian": false, "title": "Fried red mullet with oranges and capers", "url": "www_bbc_co_uk_food_recipes_fried_red_mullet_with_82300", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fried_red_mullet_with_82300_16x9.jpg", "ingredients": ["8 small or 4 medium red mullet, scaled and gutted", "½ tsp salt", "freshly ground black pepper", "semolina, for dusting", "50ml/2fl oz olive oil", "2 small oranges; 1 zested and juiced, 1 thinly sliced into rounds", "1 tbsp capers", "1 tbsp pine nuts, toasted", "pinch chilli flakes", "small handful flatleaf parsley, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the red mullet with the salt and some pepper, and dust with semolina. ", "Heat the olive oil in a frying pan over a medium heat and fry the fish on both sides until golden-brown. Transfer to a plate and keep warm. ", "Deglaze the pan with the orange zest and juice, then add the orange slices, capers, pine nuts, chilli flakes and parsley to the pan and warm through. Pour over the fish and serve immediately."]}, {"isVegetarian": false, "title": "Fried scallops with chilli, sage and lemon, and Swiss chard", "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_25567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz Castelluccio lentils", "1½ garlic cloves, the whole clove peeled and half clove sliced ", "extra virgin olive oil for dressing", "500g/1lb 2oz Swiss chard leaves, stem and thick veins removed and leaves halved", "2 tbsp olive oil ", "1 tsp fennel seeds, crushed", "12 scallops (with roe), cleaned", "1 tsp small capers in vinegar, drained", "1 fresh red chilli, finely chopped", "12 sage leaves", "1 lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the lentils in a pan with the whole garlic clove. Cover with water and bring to a simmer, then cook for 20–25 minutes until tender. Drain the lentils. Season and add a good dash of extra virgin olive oil, then cover and keep warm.", "Meanwhile, blanch the Swiss chard leaves in salted boiling water for about 3 minutes until tender. Drain well, squeezing out excess water. ", "Heat 1 tablespoon of the olive oil in a clean pan and fry the sliced garlic with the fennel seeds over a medium-high heat for 30 seconds. Add the drained Swiss chard and stir to combine. Season with salt and pepper, remove from the heat, cover and keep warm.", "Heat a heavy-based frying pan over a high heat. Toss the scallops in a bowl with salt, pepper and 1 tablespoon of olive oil. When the pan is very hot, carefully place the scallops in the pan and cook for 1 minute on each side until golden-brown and cooked through. Add the capers, chilli, sage leaves and a squeeze of lemon. Serve hot, with the lentils and Swiss chard."]}, {"isVegetarian": false, "title": "Fried scallops with caramel miso aubergine", "url": "www_bbc_co_uk_food_recipes_fried_scallops_with_62665", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white miso", "150g/5½oz caster sugar", "vegetable oil, for deep frying", "2 aubergines, cut into 1-2cm/½-¾in cubes", "2 tbsp roughly chopped fresh coriander", "50g/1¾oz butter", "12 scallops, cleaned, roe removed", "100g/3½oz edamame beans", "1 tbsp white sesame seeds", "1 tbsp black sesame seeds", "1 tbsp coriander cress", "1 tbsp red amaranth cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the miso and sugar with 50ml/2fl oz of water in a saucepan, and bring to the boil. Simmer gently for 8-10 minutes, until it has thickened and darkened in colour. Decant the mixture into an airtight container such as a squeezy bottle fitted with a small nozzle lid. ", "Heat the oil in a deep-fat fryer to 180C. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Deep-fry the diced aubergine, in batches if necessary, for 2-3 minutes, or until golden-brown and crisp. Remove from the oil using a slotted spoon, then set aside to drain on kitchen paper. Sprinkle over the chopped coriander and mix together. Repeat the process with the remaining aubergine.", "Heat the butter in a large frying pan over a medium to high heat. When the butter is foaming, add the scallops and fry on each side for 2-3 minutes, or until golden-brown and just cooked through. Add the edamame beans and continue to fry until warmed through. Mix the sesame seeds together.", "To serve, spoon the fried aubergine onto the serving plates, scatter over the edamame beans, then sprinkle the sesame seeds on top. Finish with the pan fried scallops and a drizzle of the miso sauce, then garnish with the mixed cress."]}, {"isVegetarian": true, "title": "Fried semolina-crusted aubergine with honey", "url": "www_bbc_co_uk_food_recipes_fried_semolina-crusted_09005", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large aubergines ", "vegetable oil, for frying ", "200ml/7fl oz milk ", "6 tbsp semolina", "sea salt flakes, crushed", "75ml/2½fl oz  clear honey ", "Allepo pepper (pul biber) chilli flakes, to serve (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Peel the aubergines and cut them into 3.5cm/1¼in thick discs. Then cut each slice roughly into pieces about 5cm/2in in diameter. Shape variation doesn’t matter and neither does size inconsistency – just make the pieces roughly around the same size so that they cook in the same time.", "Pour about 5cm/2in vegetable oil into a large, deep frying pan and heat the oil over a high heat. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Pour the milk into a small bowl.  Tip the semolina on to a small side plate and season it well with crushed salt.  Dip the aubergine pieces into the milk, then shake off any excess milk and immediately roll the pieces in the seasoned semolina.  ", "Cooking in batches, put the coated aubergine pieces into the hot oil and fry for approximately 1 minute on each side, or until golden brown and cooked through. Once cooked, transfer to a tray or plate lined with kitchen paper to soak up any excess oil. Repeat with subsequent batches.  ", "Serve with a good drizzle of clear honey and a sprinkling of chilli flakes, if using."]}, {"isVegetarian": false, "title": "Fried sole with ginger cream sauce and seasonal vegetables", "url": "www_bbc_co_uk_food_recipes_fried_sole_with_ginger_36957", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz unsalted butter", "2 shallots, finely chopped", "50g/1¾oz fresh ginger, peeled and finely sliced", "200ml/7fl oz white wine", "200ml/7fl oz fish stock", "200ml/7fl oz double cream", " 2 lemon sole, skinned and filleted", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "2cm/1in piece fresh root ginger, peeled, cut into strips", "1 courgette, cut into strips", "1 red pepper, cut into strips", "100g/3½oz mangetout, cut into strips", "100g/3½oz fresh peas", "100g/3½oz broad beans, blanched", "2 tbsp chervil", "2cm/1in piece fresh root ginger, cut into strips"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish, heat a frying pan and add half of the butter and all the shallots and cook for a couple of minutes. Add the ginger and cook for a further couple of minutes.", "Add the white wine and cook until it is reduced in volume by half. Add the stock and reduce by half again and then add the cream. Strain through a fine sieve into another warm pan.", "Heat a large frying pan and add the remaining butter. Season the sole fillets with salt and pepper. Once hot add the seasoned fillets and cook either side for two minutes, then remove from the pan and allow to rest for a couple of minutes.", "For the seasonal vegetables, heat a large frying pan and add the butter. Once hot, add the courgette and cook for a minutes then add the pepper and mangetout and cook for 2-3 minutes. Add the peas and blanched broad beans and allow to cook for a further minute.", "To serve, place a pool of the sauce in the centre of a shallow bowl and some seasonal vegetables on top. Place the sole fillet on top and garnish with fresh chervil and fresh ginger."]}, {"isVegetarian": false, "title": "Fried turkey with bang bang sauce", "url": "www_bbc_co_uk_food_recipes_fried_turkey_with_bang_00594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey thighs, skinless, bone removed and cut into bite-size chunks ", "200ml/7fl oz buttermilk to marinate ", "pinch ground star anise ", "10 coriander seeds, crushed ", "vegetable oil, for deep-frying", "2 tsp baking powder ", "2 tsp cayenne pepper", "4 tsp paprika ", "250g/9oz plain flour ", "4 tsp crushed Sichuan peppercorns ", "2 tsp garlic powder", "1 tsp Chinese 5-spice ", "1 tsp salt", "1 tsp ground black pepper", "salt and freshly ground black pepper", "250g/9oz smooth peanut butter ", "4 tsp soy sauce", "6 tbsp vegetable oil ", "5 tbsp sesame oil", "5 tbsp sweet chilli sauce", "handful curry leaves ", "1 red chilli, thinly sliced", "1 green chillis, thinly sliced", "4 spring onions, thinly sliced ", "1 tbsp micro coriander ", "1 tbsp micro amaranth", "handful toasted peanuts, roughly chopped", "few bean sprouts ", "150g/5½oz pickled onion rings, thinly sliced", "1 tbsp black sesame seeds"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the fried turkey, place the buttermilk into a bowl with the star anise and coriander and mix to combine. Add the turkey, season with salt and pepper and coat well. Cover and marinate in the fridge overnight. ", "When you are ready to cook, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Mix the remaining turkey ingredients together in a bowl. Dip the turkey pieces into the mixture and deep-fry in batches for 6–8 minutes, until cooked through. Drain on kitchen paper and keep warm. ", "Deep-fry the curry leaves, drain on kitchen paper and set aside.", "To make the bang bang sauce, warm the peanut butter in a bowl set over a pan of simmering water until soft. Slowly stir in the remaining ingredients until you have a loose, spoonable sauce. ", "To serve, spoon a generous amount of the sauce on the bottom of a serving plate and pile the crisp turkey on top. Garnish with the fried curry leaves and remaining serving ingredients. Drizzle over some more of the sauce and serve. "]}, {"isVegetarian": true, "title": "Fried baby pineapple with mint and cream", "url": "www_bbc_co_uk_food_recipes_friedbabypineapplewi_89121", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 baby pineapple, skin cut off, halved and sliced", "75ml/2½fl oz double cream", "1 sprig fresh mint", "1 lemon wedge, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a frying pan and lightly fry the pineapple slices on both sides for 3-4 minutes, or until they start to colour.", "Transfer the pineapple slices onto a servin g plate, spoon over the double cream and garnish with fresh mint and a wedge of lemon."]}, {"isVegetarian": true, "title": "Fried christophine with corn on the cob", "url": "www_bbc_co_uk_food_recipes_friedchristophinewit_89119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 christophine (also called chow chow), peeled, cored and sliced", "55g/2oz butter", "1 red scotch bonnet chilli, de-seeded (or to taste)", "1 orange scotch bonnet chilli, de-seeded (or to taste)", "1 corn on the cob"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Parboil the christophine slices in boiling water for 3-4 minutes, then drain.", "Melt half of the butter in a frying pan and fry the christophine and the whole scotch bonnet chillies for 4-5 minutes, turning the slices once, until the christophine is tender and golden-brown on both sides. ", "Microwave the corn for 4-5 minutes on high, then remove and fry in another frying pan with the remaining butter for 3-4 minutes, or until the corn is tender.", "To serve, pile the fried christophine and chillies onto a serving plate, and place the corn on the cob on the side."]}, {"isVegetarian": true, "title": "Fried edamame beans with chilli", "url": "www_bbc_co_uk_food_recipes_friededamamebeanswit_86248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "150g/5½oz edamame beans, in their pods", "pinch chilli flakes", "2 garlic cloves, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and add the beans, chilli flakes and garlic. Season with salt and freshly ground black pepper and sauté for 2-3 minutes, until the beans are tender.", "To serve, place into a serving bowl."]}, {"isVegetarian": false, "title": "Fried egg with pan-fried haggis and mash", "url": "www_bbc_co_uk_food_recipes_friedeggwithpanfried_82605", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 potato, peeled and diced", "½ haggis, sliced", "2 tbsp vegetable oil", "1 free-range egg"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil and cook the potato for 8-10 minutes until tender. Drain the potato and mash it. ", "Heat half of the oil in a non-stick pan, spoon the potato mixture in and spread evenly. Season with salt and freshly ground black pepper and fry for 4-5 minutes on each side until golden brown.", "Fry the haggis slices in a separate pan for 3-4 minutes on each side until golden and cooked through. ", "Heat the rest of the oil in a small frying pan, crack the egg in and fry for a few minutes, or until set.", "To serve, arrange the potato cake on a serving plate, serve the cooked haggis on top and top with the fried egg."]}, {"isVegetarian": true, "title": "Fried green beans", "url": "www_bbc_co_uk_food_recipes_friedgreenbeans_80842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil ", "150g/5½oz green beans, finely sliced ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a deep frying pan and add the olive oil. Add the green beans and fry for five minutes, until cooked through and golden. Season with salt and freshly ground black pepper.", "Serve in a bowl as a side dish."]}, {"isVegetarian": false, "title": "Fried fish in oatmeal with tartare sauce", "url": "www_bbc_co_uk_food_recipes_friedfishinoatmealwi_91975", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz mixed fish fillets (such as herring, smoked haddock, plaice, etc), any pin bones removed, cut into strips", "salt and freshly ground black pepper", "½ lemon, juice only", "2 free-range eggs, beaten", "200g/7oz pinhead oatmeal ", "sunflower oil, for frying ", "1 x 500g/1lb 2oz jar ready-made good quality mayonnaise", "2 tbsp chopped capers ", "2 tbsp chopped pickled cornichons or gherkins ", "2 tbsp chopped fresh parsley leaves", "2 tbsp chopped fresh dill", "½ lemon, juice only", "splash Tabasco sauce", "salt, to taste", "1 lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the fish strips with salt and freshly ground black pepper, and sprinkle over the lemon juice.", "Pour the beaten eggs into a bowl. Sprinkle the pinhead oatmeal onto a plate. ", "Brush each piece of fish all over with a little of the beaten egg using a pastry brush, then dredge in the oatmeal until completely covered. ", "Pour enough oil into a large frying pan to just cover the base of the pan. Heat the oil over a medium to high heat (CAUTION: hot oil can be dangerous. Do not leave unattended). When the oil is hot, add the prepared fish strips, in batches, and fry for 6-8 minutes, turning once, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper, keeping warm. Repeat the process with the remaining fish.", "Meanwhile, for the tartare sauce, in a bowl, mix together all of the tartare sauce ingredients until well combined. Set aside until ready to serve. (NB: this recipe will make more tartare sauce than is needed. Store the remaining sauce in an airtight jar in the fridge for up to a week.)", "To serve, divide spoonfuls of the tartare sauce equally among four small dipping bowls. Place one dipping bowl into the centre of each of four serving plates. Arrange the fish goujons around the dipping bowls. Sprinkle over salt, to taste, and garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Fried halloumi with courgette and bean salad", "url": "www_bbc_co_uk_food_recipes_friedhalloumiwithcou_78478", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 courgette ", "1 handful red Peppadew peppers", "1 handful fresh coriander, chopped", "1 handful tinned mixed beans, rinsed and drained", "juice of ½ lemon", "3 tbsp olive oil", "salt and freshly ground black pepper", "tsp olive oil", "3 slices halloumi cheese"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Using a peeler, peel the courgette into thin 'ribbons' for the salad. Place into a bowl.", "Add the coriander, mixed beans, lemon juice and olive oil and toss well. Season to taste with salt and freshly ground black pepper.", "In a small frying pan with a little oil add the slices of halloumi and cook for 20 seconds on each side.", "Serve the courgette and bean salad on a plate and place the fried halloumi on top."]}, {"isVegetarian": false, "title": "Fried halibut steaks", "url": "www_bbc_co_uk_food_recipes_friedhalibutsteaks_83811", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz flour", "2 halibut steaks, about 2.5cm/1 inch thick", "juice of 1 lemon", "olive oil, for frying", "chopped parsley", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Scatter a think layer of flour onto a plate. Dip the halibut steaks into the lemon juice, then into the flour on both sides.", "Fry the fish until firm and cooked right through, about five minutes on each side.", "Serve hot scattered with parsley and served with large wedges of lemon."]}, {"isVegetarian": false, "title": "Fried noodles, prawns and char-grilled salad onions", "url": "www_bbc_co_uk_food_recipes_friednoodlesprawnsan_80162", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "3 salad onions", "salt and freshly ground black pepper", "2 tbsp sesame oil", "1 garlic clove, chopped", "pinch dried chilli flakes", "2 salad onions, finely chopped", "2 baby aubergines, sliced", "1 handful spinach", "3 prawns, chopped", "150g/5½oz egg noodles, cooked according to packet instructions", "2 tbsp soy sauce", "1 tbsp sesame seeds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad onions, place the salad onions and olive oil into a bowl. Season, to taste, with salt and freshly ground black pepper and toss together.", "Heat a griddle pan until smoking. Add the salad onions and char-grill for two minutes on each side, so that brown griddle marks are formed. Remove from the heat and set aside.", "For the noodles, heat the sesame oil in a large wok over a high heat. Add the garlic, chilli, salad onions and aubergine and stir fry for one minute.", "Add the spinach and prawns and cook for a further two minutes, turning the prawns halfway through cooking.", "Add the noodles, drizzle over the soy sauce and toss together.", "To serve, place the noodles on a large warm plate and sprinkle with sesame seeds. Place the char-grilled salad onions criss-crossed on top."]}, {"isVegetarian": false, "title": "Fried herb-stuffed chicken with cabbage and chestnuts", "url": "www_bbc_co_uk_food_recipes_friedherbstuffedchic_92613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 boneless chicken breasts, wing bone attached", "6 tbsp fresh chervil leaves", "6 tbsp flatleaf parsley, leaves only", "3 tbsp freshly grated parmesan cheese", "1 garlic clove", "1 tsp salt", "½ tsp black peppercorns", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "75g/3oz butter", "1 tbsp olive oil", "200ml/7fl oz red wine", "300ml/11fl oz chicken stock", "75g/3oz butter", "1 banana shallot, finely chopped", "1 garlic clove, finely diced", "4 rashers bacon, cut into lardons", "400g/14oz  pointed cabbage, finely shredded", "150g/5oz cooked chestnuts, roughly chopped", "200ml/7fl oz water", "4 sprigs fresh chervil, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/325F/Gas 5.", "For the chicken, cut the meat around the end of the wing bone and push down towards the breast, exposing the bone. Taking great care, using the heel of the knife, cut off the small knuckle at the end of the bone to leave a clean straight bone. Carefully lift the skin away from the breast meat, starting at the end furthest away from the bone, but leaving it intact and still attached at the bone end.", "Place the chervil, flatleaf parsley, parmesan, garlic, salt and peppercorns into a pestle and mortar and pound to a paste. Add the extra virgin olive oil and pound once more to a smooth paste. Season, to taste, with salt and freshly ground black pepper.", "Spoon the herb mixture onto the chicken breasts, then smooth the skin back down to cover the herbs.", "Heat half the butter and the olive oil in an ovenproof frying pan, add the chicken breasts, skin-side down and fry for two minutes, until the skin is crisp and golden-brown then, turn over and cook for another minute. Transfer to the oven for 15 minutes, until the chicken is golden-brown and cooked through. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Remove and rest for five minutes.", "Heat a frying pan until hot, add the red wine and cook until the volume of the liquid has reduced by a third, then add the chicken stock and cook until the volume of the liquid has reduced by a half. Add any chicken juices from the rested chicken, season, to taste, with salt and freshly ground black pepper and add the remaining butter.", "For the cabbage, heat a deep-sided frying pan until hot, add half the butter, the shallot and garlic and sweat for 1-2 minutes. Add the bacon and cook for two minutes until just starting to crisp. Add the cabbage and chestnuts, sauté for 1 minute then add the rest of the butter and the water. Bring to a boil, turn down the heat and simmer gently for 4-5 minutes until the cabbage is tender and the sauce reduced slightly. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the cabbage into the centre of each plate, cut each chicken breast into three slices and place on top of the cabbage. Spoon the sauce around the edge and garnish with a sprig of chervil."]}, {"isVegetarian": false, "title": "Fried onion, chorizo and egg on toast", "url": "www_bbc_co_uk_food_recipes_friedonionchorizoand_84497", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, sliced", "150g/5½ oz chorizo, chopped", "small handful parsley, chopped", "salt and freshly ground black pepper", "2 slices ciabatta", "1 tbsp olive oil", "2 free-range eggs, fried"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a small frying pan over a medium heat. Add the onion and chorizo and fry for four minutes, until the juices start to run from the chorizo. Stir in the parsley and season with freshly ground black pepper.", "Heat a griddle pan over a high heat. Drizzle the ciabatta with the olive oil and griddle on both sides for two minutes or until golden.", "To serve, place the griddled ciabatta on to a serving plate. Place the chorizo and onion onto top, and then top with the fried eggs."]}, {"isVegetarian": true, "title": "Frittata", "url": "www_bbc_co_uk_food_recipes_frittata_34910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["sunflower oil, for greasing", "100g/3½oz boiled potatoes, chilled and crushed", "2 fresh asparagus spears, trimmed, chopped", "1 spring onion, trimmed, chopped", "2 heaped tbsp frozen peas", "5 fresh mint leaves, torn", "2 tbsp grated parmesan", "2 free-range eggs, beaten", "pinch freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease an ovenproof dish with a little sunflower oil.", "In a bowl, mix together the asparagus, spring onion and peas. Stir in the mint leaves and parmesan until well combined.", "Tip the beaten eggs into the bowl and mix carefully. Season with freshly ground black pepper and mix again. ", "Spoon the frittata mixture into the prepared ovenproof dish. Place the dish onto a baking tray, then transfer to the oven and bake for 15-20 minutes, or until the eggs have completely set and a skewer inserted into the centre of the frittata comes out clean. ", "Serve with cherry tomatoes."]}, {"isVegetarian": false, "title": "Fried sea bass with poached leeks, pesto and tomato sauce", "url": "www_bbc_co_uk_food_recipes_friedseabasswithpoac_92839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch fresh basil leaves", "2 tbsp pine nuts", "1 garlic clove, peeled", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp tomato purée", "100ml/3½fl oz chicken stock", "salt and freshly ground black pepper", "1 tbsp olive oil", "1 sea bass fillet", "5 baby leeks", "300ml/½pint chicken stock", "25g/1oz butter", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, blend all the pesto ingredients in a food processor to a rough paste. Season, to taste, with salt and freshly ground black pepper.", "For the tomato sauce, heat the tomato purée in saucepan until it colours. Stir in the stock, bring the mixture to a simmer and continue to simmer until the mixture is well combined and has thickened. Season, to taste, with salt and freshly ground black pepper.", "For the sea bass, heat the olive oil in a frying pan over a medium heat. Fry the sea bass, skin-side down, for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper. Turn the sea bass fillet over and fry for a further 3-4 minutes, or until the skin is crisp and golden-brown and the fish is cooked through. Remove from the pan and set aside to rest on a serving plate.", "For the leeks, bring all the ingredients to the boil in a saucepan. Reduce the heat until the mixture is simmering and poach the leeks for 8-10 minutes, or until tender. Drain the leeks then season, to taste, with salt and freshly ground black pepper. ", "To serve, spoon the tomato sauce over the fried sea bass. Serve the poached leeks alongside with a dollop of pesto."]}, {"isVegetarian": false, "title": "Fritto misto with chilli-lime gremolata", "url": "www_bbc_co_uk_food_recipes_frito_misto_with_94137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep frying", "150g/5½oz rice flour", "150g/5½oz plain flour", "15g/½oz smoked paprika ", "400g/14oz prepared squid, cleaned", "400g/14oz prepared prawns, peeled and deveined ", "200g/7oz prepared mussels, scrubbed and debearded", "lemon wedges, to serve", "salt and freshly ground black pepper", "1 lime, zest only", "2 garlic cloves, crushed", "1 large green chilli, deseeded and finely chopped ", "½ bunch fresh flatleaf parsley, finely chopped", "200g/7oz bulgur wheat, cooked in stock ", "200g/7oz quinoa, cooked in stock", "100g/3½oz black lentils, cooked in stock", "55g/2oz soya beans, cooked in stock", "85g/3oz kale, stem removed and shredded", "25g/1oz sunflower seeds ", "1 tbsp garlic purée", "1 lime, juice only ", "2 tsp tahini", "25g/1oz spring onions, chopped ", "25g/1oz fresh flatleaf parsley, chopped", "100ml/3½fl oz cold-pressed rapeseed oil"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fritto misto, preheat oil in a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "In a large bowl, combine the flours, paprika, salt and pepper on a plate. Toss the seafood in the flour mixture and drop carefully into the deep-fat fryer. Fry until golden then carefully remove using a slotted spoon and drain on kitchen paper. ", "For the gremolata, mix all the ingredients in a small bowl. ", "For the superfood salad, combine all of the ingredients in a large bowl. For the dressing, blitz all of the ingredients in a blender and stir thoroughly through the salad. ", "Serve the fritto misto with the lemon wedges, gremolata and salad alongside. "]}, {"isVegetarian": true, "title": "Potato and leek frittata", "url": "www_bbc_co_uk_food_recipes_frittata_79389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil", "¼ potato, sliced", "½ leek, chopped", "2 free-range eggs, beaten", "handful fresh basil leaves"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan. Add the potatoes and leeks sauté them for 4-5 minutes or until they are softened.", "Add the eggs and basil and gently stir around the pan until the eggs begin to set.", "Carefully turn the frittata over and cook for a further minute, or until cooked through.", "Transfer to a warmed plate and serve immediately."]}, {"isVegetarian": true, "title": "Omelette", "url": "www_bbc_co_uk_food_recipes_frittataomelette_84222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range eggs", "1 tbsp whole milk", "1 tbsp double cream", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl mix together the eggs, milk and cream, then season with salt and freshly ground black pepper. ", "Heat the oil in a frying pan, and pour in the egg mixture.  After one minute, fold the omelette over from one side into the middle. Then fold the top edge over to the bottom. ", "To serve, immediately place the omelette onto a plate."]}]