[{"ingredients": ["3 cucharadas de aceite de oliva", "100g / 3½oz de lentejas marrones, enjuagadas", "1 hoja de laurel", "1 cebolla picada", "1 chile rojo fresco, picado", "400g / 14oz de tomates de ciruela enlatados", "sal y pimienta negra recién molida"], "method": ["Ponga a hervir una olla de agua con sal y agregue una cucharada de aceite de oliva. Agregue las lentejas y la hoja de laurel y cocine por 15 minutos, o hasta que las lentejas estén blandas. Escurrir bien y dejar reposar.", "Calentar el aceite restante en una sartén y freír la cebolla durante 5-6 minutos, o hasta que la cebolla esté suave y dorada. Agregue el chile picado y cocine durante 1-2 minutos más, luego agregue las lentejas drenadas y los tomates enlatados con todo su jugo. Sazonar con sal y pimienta negra recién molida, luego bajar el fuego y dejar hervir a fuego lento durante diez minutos.", "Con una cuchara, sirva los tazones y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_braisedlentils_89207", "title": "Lentejas cocidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "3 cebollas picadas", "6 dientes de ajo picados", "1 cucharadita de tomillo fresco picado", "1 cucharadita de Romero fresco picado", "1 kg / 2¼ lb de carne picada", "400g de tomates cortados en lata", "1 cucharada de salsa Worcestershire", "3 cubos de caldo de carne"], "method": ["Caliente la mitad del aceite vegetal en una sartén grande a fuego alto. Agregue las cebollas, el ajo y las hierbas y fríalos durante 3-4 minutos, o hasta que estén suaves y dorados. Apague el fuego y coloque la olla a un lado.", "Caliente media cucharada de aceite restante en una sartén por separado a fuego medio. Agregue un tercio de la carne picada de ternera y fría por 4-5 minutos, o hasta que se dore.", "Transfiera la carne picada dorada a la sartén que contiene las cebollas, el ajo y las hierbas. Repita el proceso dos veces más con el aceite restante y los lotes restantes de carne picada. (Sobrecargar la sartén no acelerará las cosas porque la sartén perderá calor, así que tómese su tiempo).", "Regrese la sartén que contiene la carne picada cocida y las verduras a fuego medio. Agregue los tomates enlatados y la salsa Worcestershire y mezcle bien la mezcla para combinar. Lleva la mezcla a fuego lento.", "Mientras tanto, desmenuce los cubos en una jarra grande a prueba de calor y agregue 1 litro / 1¾ pintas de agua hirviendo. Revuelva hasta que los cubos de caldo se hayan disuelto. Agregue el caldo a la carne y cocine a fuego lento. Cocine a fuego lento durante 1 hora, sin cubrir, o hasta que el volumen del líquido se haya reducido ligeramente y la salsa se haya espesado.", "La carne picada estofada se puede comer directamente, servida con arroz o espagueti. Consulte las secciones de consejos para conocer otras formas de utilizar la carne picada."], "url": "www_bbc_co_uk_food_recipes_braisedmince_91963", "title": "Picadillo básico estofado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 2 x 1 kg / 2 lb 4 oz de lote de carne picada", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedmince_91963_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["16 mejillas de cerdo, recortadas de toda grasa y tendones", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cebolla picada", "1 zanahoria, picada", "50 g / 2 oz de jengibre, picado", "1 ramita de tomillo fresco", "2g semillas de cilantro, ligeramente trituradas", "250ml / 9fl oz de cerveza de jengibre", "1 litro / 1 pinta 15¼fl oz de caldo de pollo", "500 g / 1lb 2 oz zanahorias baby, bases de hojas dejadas en", "1 cucharadita de jengibre molido", "1 cucharada de miel", "25g / 1oz de mantequilla", "Papas Royal Jersey Jersey de 300g / 11oz, restregadas", "25g / 1oz de mantequilla"], "method": ["Para las mejillas de cerdo, sazone las mejillas de cerdo con sal y pimienta negra recién molida, al gusto.", "Calentar una sartén honda hasta que esté caliente, agregar la mitad del aceite y las mejillas y freír por ambos lados hasta que estén doradas. Retire las mejillas de la sartén y déjelas a un lado.", "Agregue la otra cucharada de aceite a la sartén, agregue las semillas de cebolla, zanahoria, jengibre, tomillo y cilantro y cocine a fuego medio hasta que estén doradas.", "Vierta la cerveza de jengibre y cocine hasta que el líquido se reduzca a un glaseado almibarado; luego coloca las mejillas encima de las verduras.", "Verter sobre el caldo de pollo para cubrir, llevar a ebullición, luego reducir el fuego y hervir a fuego lento durante una hora hasta que las mejillas estén tiernas. Retire las mejillas de la sartén y déjelas a un lado.", "Pase el líquido de cocción a través de un colador en una sartén limpia y vuelva al fuego. Cocine a fuego lento hasta que espese, luego agregue las mejillas y mezcle para cubrir las mejillas en el glaseado.", "Para las zanahorias jengibre, ponga a hervir un sartén con agua con sal, agregue las zanahorias y cocine durante dos minutos, o hasta que estén tiernas. Escurrir y apartar.", "Calentar una sartén hasta que esté caliente, agregar el jengibre molido y la miel y llevar a ebullición.", "Agregue la mantequilla, agregue las zanahorias cocidas y fría por un minuto, o hasta que estén doradas.", "Ponga a hervir una olla de agua con sal, agregue los Jersey Royals y cocínelos durante 4-7 minutos o hasta que estén tiernos. Escurra las papas, vuelva a la sartén y agregue la mantequilla. Revuelva para cubrir.", "Para servir, comparte las mejillas acristaladas entre cuatro platos, coloca las zanahorias al lado y vierte la salsa restante alrededor del cerdo. Coloque los Jersey Royals a un lado."], "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_91132", "title": "Mejillas de cerdo estofadas con zanahorias de jengibre y papas Jersey Royal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 mejillas de cerdo, grasa y tendones eliminados", "2 cucharadas de aceite de oliva", "50ml / 2fl oz de vinagre de vino tinto", "1 cebolla, pelada, picada", "2 zanahorias, peladas, picadas", "150ml / 5fl oz de vino blanco", "1 cucharadita de jengibre molido", "1 cucharadita de cilantro molido", "1 cucharadita de canela molida", "1 cucharadita de especias mixtas", "Anís de 2 estrellas", "2 tomates, picados", "1 diente de ajo, pelado", "1 ramita de tomillo fresco", "1 hoja de laurel", "2 cucharadas de miel", "1 cucharada de salsa de soja", "1 litro / 1¾pt de caldo de pollo", "500ml / 17½ fl oz de leche", "500ml / 17½fl oz de caldo de pollo", "Olla de cocción rápida 175g / 6oz", "25g / 1oz de parmesano rallado", "25 g / 1oz de mantequilla sin sal", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "Col rizada de 200g / 7oz", "1 cucharada de aceite de oliva", "1 calamar mediano, limpio, anotado, cortado en triángulos", "1 limón, solo jugo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sazone las mejillas de cerdo, al gusto, con sal y pimienta negra recién molida.", "Caliente una cucharada de aceite de oliva en una sartén no reactiva a fuego medio y fríe las mejillas de cerdo durante 4-5 minutos, o hasta que se doren por todos lados. Retire la carne de cerdo de la sartén y déjela a un lado.", "Cuidadosamente drene la grasa de la sartén agregue el vinagre, raspando cualquier pedacito dorado con una cuchara de madera para desglasar. Retire del fuego.", "Caliente el aceite de oliva restante en una sartén y fríe la cebolla y la zanahoria durante 2-3 minutos, o hasta que se ablanden.", "Agregue el vino blanco y las especias y continúe cocinando hasta que el volumen de la mezcla se haya reducido a la mitad.", "Coloque las mejillas de cerdo y los jugos de cacerola en la sartén y agregue los ingredientes restantes de la mejilla de cerdo. Llevar la mezcla a ebullición, luego transferirla al horno para que se cocine durante 1½-2 horas, o hasta que las mejillas de cerdo estén blandas.", "Retire las mejillas de cerdo de la sartén y déjelas a un lado, luego cuele la mezcla de cocción a través de un colador. Reserve el líquido y deseche las verduras.", "Cocine las mejillas de cerdo y el líquido de cocción reservado en una cacerola durante 4-5 minutos, o hasta que el líquido se haya reducido ligeramente y las mejillas de cerdo estén pegajosas y esmaltadas.", "Mientras tanto, para la polenta, caliente la leche y el caldo en una cacerola y llévela a ebullición. Lentamente mezcle la polenta y cocine a fuego lento durante 4-5 minutos.", "Agregue el parmesano y la mantequilla y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, calentar la mantequilla en una sartén y freír la col rizada durante 4-5 minutos, o hasta que esté marchita y tierna. Calentar el aceite de oliva en una sartén y freír el calamar durante 1-2 minutos, o hasta que esté recién cocido. Sazonar, al gusto, con jugo de limón y sal y pimienta negra recién molida.", "Ponga un poco de polenta en cada uno de los 4 platos para servir, cubra con las mejillas de cerdo y el calamar y coloque la col rizada al costado."], "url": "www_bbc_co_uk_food_recipes_braisedporkcheekswit_93223", "title": "Mejillas de cerdo estofadas con polenta y calamar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 col roja mediana, descuartizada, sin corazón y en rodajas", "2 cebollas rojas, peladas y en rodajas", "80g / 3oz de arándanos secos", "2 manzanas Bramley, peladas, sin corazón y ralladas", "1 cucharadita de canela molida", "25g / 1 oz de azúcar demerara", "3 cucharadas de vinagre de vino tinto", "Sal y pimienta"], "method": ["Precalentar el horno a 170 C / 3325 F / Gas 3.", "Mezcle la col con el resto de los ingredientes y ponga en un plato a prueba de horno.", "Sazonar bien y cubrir con papel de aluminio.", "Hornee en el horno durante 60-90 minutos hasta que el repollo esté tierno y jugoso. Mezcle los ingredientes juntos 2-3 veces durante la cocción.", "Deje enfriar y almacenar en la nevera. Recalentar cuando sea necesario."], "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_2528", "title": "Estofado de col roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 cebolla mediana, finamente rebanada", "2 manzanas de postre, peladas, sin corazón y en rodajas", "1kg / 2¼lb de col roja, finamente rebanada", "100g / 4oz sultanas o pasas", "200ml / 7fl oz de vinagre de jerez", "sal y pimienta recién molida"], "method": ["Derrita la mantequilla en una cacerola de acero inoxidable o a prueba de llama a fuego medio (una bandeja de aluminio no funcionará para esto).", "Freír la cebolla en la mantequilla durante tres minutos, luego agregar la manzana y el repollo.", "Cocine durante cinco minutos más o menos, hasta que se ablanden, luego agregue las sultaninas y el vinagre de jerez.", "Coloque una tapa en la sartén y cocine por una hora, hasta que todas las verduras estén tiernas.", "Sazone al gusto con sal y pimienta negra recién molida y vuelva a colocar la tapa. Continúe cocinando hasta que el repollo esté tierno y todo el líquido se haya evaporado. Este plato se mantendrá durante varios días, cubierto, en la nevera. Simplemente vuelva a calentar cuando esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_braisedredcabbagewit_87606", "title": "Repollo rojo estofado con manzanas y vinagre de jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedredcabbagewit_87606_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30ml / 1oz de aceite de oliva", "2 dientes de ajo, en rodajas", "1 chalota de plátano, en rodajas", "50 g / 1¾oz de tocino ahumado rayado, picado", "¼ repollo rojo, rallado", "30ml / 1fl oz de vino tinto", "1 cucharada de vinagre de vino tinto", "1 cucharada de azúcar moreno", "100ml / 3½fl oz de caldo de verduras calientes", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite en una cacerola a fuego medio. Agregue el ajo y la chalota y fría por 2-3 minutos para ablandar.", "Agregue el tocino rayado y fría por 3-4 minutos, hasta que estén dorados.", "Agregue el repollo rojo y continúe cocinando durante cinco minutos.", "Agregue el vino tinto, el vinagre y el azúcar. Llevar a ebullición, reducir el fuego y cocinar a fuego lento durante 4-5 minutos, hasta que el volumen del líquido se reduzca en tres cuartos.", "Agregue el caldo y cocine a fuego lento durante otros cinco minutos, hasta que el repollo esté cocido.", "Sazonar, al gusto, con sal y pimienta negra recién molida y verter en un tazón grande y tibio para servir."], "url": "www_bbc_co_uk_food_recipes_braisedredcabbage_81485", "title": "Estofado de col roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5¼ oz de arroz", "½ litro / 290 ml de caldo de pollo o verdura", "75g / 2½ oz de champiñones, en rodajas", "75 g / 2½ oz Romero pimienta, en rodajas", "puñado de hierbas mixtas, picadas", "30 g / 1¼ oz de mantequilla"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Ponga a hervir el caldo de arroz y pollo en una sartén grande a prueba de horno. Coloque en el horno por diez minutos.", "Agregue los champiñones y los pimientos. Cubra con una tapa y vuelva al horno por tres minutos.", "Retire el arroz del horno y agregue las hierbas y la mantequilla."], "url": "www_bbc_co_uk_food_recipes_braisedricewithmushr_77787", "title": "Arroz estofado con champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco, miga en un procesador de alimentos", "Queso Gruyère de 25 g / 1 oz, rallado", "Queso cheddar 15 g / ½ oz, rallado", "4 ramitas de tomillo, hojas recogidas", "4 cucharadas de perejil rizado, aproximadamente picado", "50g / 2oz de mantequilla, ablandada", "4 x 150 g / 5¼ oz de filetes de salmón", "50ml / 2fl oz de caldo de pescado", "50ml / 2fl oz de vino blanco", "50g / 2oz de mostaza Dijon", "Tomates de vid 150g / 6oz", "2 cucharadas de vinagre balsámico", "1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "4 puñados de hojas de espinaca"], "method": ["Para la corteza, coloque todos los ingredientes de la corteza en un procesador de alimentos y mezcle hasta que quede suave.", "Extienda la mezcla en una bandeja para hornear forrada y deje enfriar hasta que se asiente.", "Para el salmón, precalentar el horno a 200C / 400F / Gas 6 y verter el caldo de pescado y el vino en un plato resistente al horno.", "Coloque los filetes de salmón en el plato y sazone con sal y pimienta.", "Pincelar con la mostaza.", "Cortar la corteza en rectángulos para cubrir el lugar de salmón y en la parte superior.", "Cocine en el horno por diez minutos, o hasta que esté cocido.", "Saque el salmón del horno y déjelo descansar.", "Coloque los tomates en una bandeja para hornear, vierta sobre el vinagre y el aceite, sazone y tueste al lado del horno durante ocho minutos.", "Calentar una sartén hasta que esté caliente y luego agregar la mantequilla. Cuando haga espuma, agregue la espinaca y saltee durante dos minutos hasta que se marchite.", "Para servir, coloque la espinaca en el centro del plato, coloque el salmón encima y los tomates asados ​​a un lado."], "url": "www_bbc_co_uk_food_recipes_braisedsalmonwithmus_83759", "title": "Salmón cocido con mostaza y corteza de hierbas de Gruyère, espinacas salteadas y tomates en rama asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 repollo Savoy, sin corazón y rallado", "Tocino rayado ahumado de 110 g / 4 oz, deshilachado y picado", "55 g / 2 oz de mantequilla", "85ml / 3fl oz de vino blanco seco", "2 cucharadas de perejil fresco picado", "2 cucharaditas de semillas de hinojo", "2 cucharadas de crema", "sal y pimienta recién molida"], "method": ["Derrita la mantequilla en una sartén grande. Agregue el tocino y cocine por 3-4 minutos.", "Agregue el repollo y mezcle todo junto. Agregue el vino y sazone bien. Cubra y cocine suavemente durante 10 minutos hasta que el repollo esté tierno.", "Agregue las semillas de hinojo, el perejil y la crème fraîche y sirva."], "url": "www_bbc_co_uk_food_recipes_braisedsavoycabbagew_68087", "title": "Col estofada de col rizada con tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braisedsavoycabbagew_68087_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "½ cebolla, pelada, picada", "6 setas de castaña", "sal y pimienta negra recién molida", "200ml / 7fl oz de caldo de pescado", "1 filete de lubina, sin piel", "Crema doble 50ml / 2fl oz", "1 cucharada de cebolletas frescas picadas", "25g / 1oz de mantequilla", "5 puerros tiernos, blanqueados durante 6 minutos en agua hirviendo, escurridos", "sal y pimienta negra recién molida"], "method": ["Para la lubina, derrita la mantequilla en una sartén a fuego medio. Agregue la cebolla picada y saltee durante 4-5 minutos, o hasta que se suavice.", "Agregue los champiñones a la sartén y cocine por otros 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Verter en el caldo, llevar a ebullición, luego reducir el fuego hasta que la mezcla esté hirviendo a fuego lento. Coloque la lubina en la mezcla, cubra la olla con una tapa y cocine por 6-8 minutos, o hasta que la lubina esté cocida y opaca. Retire la lubina de la sartén y reserve para descansar en un plato de servir.", "Vierta la crema en el líquido de cocción, vuelva a hervir y cocine durante 3-4 minutos, o hasta que el volumen del líquido se haya reducido. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar la mitad de las cebolletas picadas.", "Mientras tanto, para los puerros, derrita la mantequilla en una sartén a fuego medio. Agregue los puerros blanqueados y fría por 2-3 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la salsa de crema sobre el pescado, coloque los puerros al lado y espolvoree con el resto del cebollino picado."], "url": "www_bbc_co_uk_food_recipes_braisedseabasswithle_92838", "title": "Lubina estofada con puerros y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "500 g / 1lb 2 oz de panceta sin ahumar, cortada en cubos grandes", "1.5kg / 3lb 5 oz espinilla de carne de res cortada en rodajas de 2,5 cm / 1 pulgada de ancho", "85ml / 3fl oz de vino tinto", "1 kg / 2¼ lb de zanahorias de invierno orgánicas grandes, peladas y picadas", "1 cabeza de apio, más o menos picada", "1 kg / 2¼ libra de cebollas en vinagre o chalotas", "Tomates de 1 kg / 2¼lb, asados ​​y tamizados hasta obtener un puré", "1 litro / 1¾ pinta buen caldo de carne o agua", "1 bouquet garni", "puré de patatas, para servir"], "method": ["Caliente el aceite en una sartén grande de fondo grueso. Agregue la panceta y fría hasta que esté dorada y crujiente. Retire de la sartén y agregue a una olla grande o cacerola.", "Freír la espinilla de ternera en la sartén, por ambos lados, hasta que se dore bien. Transfiere la espinilla a la olla.", "Vierta el vino tinto en la sartén y revuelva durante 2-3 minutos para recolectar los jugos de cocción. Inclínate en la olla.", "Coloque la olla de caldo sobre un calor suave. Agregue las zanahorias, el apio y las cebollas. Vierta el puré de tomate y suficiente reserva o agua para cubrir la carne y las verduras. Agregue el bouquet garni y cubra con una tapa.", "Cocine a fuego lento durante 3-4 horas, revolviendo de vez en cuando. Sirva con puré de papa."], "url": "www_bbc_co_uk_food_recipes_braisedshinofbeef_73258", "title": "Espina de vaca estofada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Costillas cortas de carne de 4 kg / 9lb", "sal y pimienta negra recién molida", "50ml / 1fl oz de aceite vegetal", "2 zanahorias, peladas y picadas", "1 puerro, más o menos picado", "1 cabeza de ajo", "2 cucharaditas de pimienta negra", "Anís de 4 estrellas", "6 cebollas, 3 picadas, 3 rebanadas", "300ml / 10fl oz de vino tinto", "Puerto de oz 110ml / 4fl", "4 litros / 7 pintas de oz de carne de vacuno", "6 ramitas de tomillo fresco, solo hojas", "4-6 x 10cm / 4in huesos de la médula de la carne de vaca", "4-6 ramitas de romero fresco", "3 papas grandes y harinosas, peladas y cortadas en pedazos", "200ml / 7fl de leche en oz", "200g / 7oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para rellenar la tarta casera, sazone las costillas con sal y pimienta negra recién molida.", "Caliente una cazuela grande hasta que esté caliente, agregue la mitad del aceite vegetal y luego agregue las costillas cortas sazonadas. Freír hasta que se dore por todos lados.", "Retire las costillas de la sartén y colóquelas sobre una rejilla suspendida sobre un plato.", "Agregue las zanahorias, el puerro, el ajo, los granos de pimienta, el anís estrellado y la cebolla picada (reserve la cebolla en rodajas) y fría por 4-5 minutos, o hasta que estén doradas.", "Agregue el vino tinto y el puerto a la sartén, deje hervir y luego reduzca el fuego a fuego lento. Cocine hasta que tenga consistencia de jarabe y reduzca su volumen en tres cuartas partes.", "Regrese las costillas de ternera a la sartén, cúbralas con el caldo de carne y déjelas hervir. Recorta una tapa de papel a prueba de grasa del tamaño de la sartén. Elimine las impurezas de la superficie del líquido con una cuchara, cubra con la tapa de papel a prueba de grasa, baje la temperatura y cocine a fuego lento durante tres horas, o hasta que la carne esté tierna y caiga del hueso.", "Cuando la carne esté cocida, cuele el líquido y vierta la salsa en una cacerola limpia. Establecer la carne cocida a un lado.", "Coloque el líquido en el fuego, hierva y luego reduzca inmediatamente el fuego a fuego lento. Continúe cocinando a fuego lento hasta que se reduzca a la mitad, eliminando cualquier exceso de grasa con una cuchara.", "Mientras tanto, retira la carne de los huesos, descartando cualquier grasa y tendones. Retire la salsa reducida del fuego y agregue la carne picada. Mezclar bien.", "Calentar una sartén hasta que esté caliente, agregar el aceite vegetal restante a la sartén y la cebolla en rodajas. Freír durante 5-8 minutos hasta que estén dorados y suaves. Agregue las hojas de tomillo y reserve.", "Para el puré, coloque las papas en una sartén con agua con sal y deje hervir. Cocine a fuego lento durante 15-18 minutos, o hasta que esté tierno. Drene y devuelva las papas a la sartén para eliminar el exceso de humedad.", "Pase las papas a través de un ricer en un tazón limpio (alternativamente, use un machacador de papas, aunque no obtendrá un acabado uniforme).", "Traiga la leche y la mantequilla a fuego lento en una sartén por separado. Agregue la mezcla de leche caliente y mantequilla a las papas y bata bien. Sazone con sal y pimienta negra recién molida e incline la mezcla en una manga pastelera.", "Para terminar la carne de res, precaliente el horno a 200C / 400F / Gas 6. Con una cuchara, la carne estofada en 4-6 platos a prueba de horno y cubra con las cebollas fritas. Coloque un hueso de médula en el centro de cada plato y coloque las ramitas de romero en la parte superior del hueso. Pipe el puré de patatas en la carne.", "Cocine en el horno durante 15-20 minutos, o hasta que estén dorados y burbujeantes.", "Sirva el pastel de requesón con costillas cortas y cebolla al momento."], "url": "www_bbc_co_uk_food_recipes_braisedshortribandon_91339", "title": "Tarta de requesón con costillas y cebolla cocida con médula ósea", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para la elaboración", "250 g / 9 oz de mantequilla muy fría, cortada en cubos pequeños", "½ cucharadita de sal", "25g / 1oz de azúcar glas", "40 g / 1½ oz de mantequilla", "2 manzanas Bramley grandes, peladas y picadas", "1 vaina de vainilla, partido y semillas raspadas", "125 g / 4½ oz zarzamoras", "1 limón, solo jugo", "300 ml / 10 fl oz doble crema"], "method": ["Para la pasta de hojaldre basta, coloque la harina en un montículo sobre una superficie de trabajo limpia y haga un pozo en el centro.", "Coloque la mantequilla y la sal en el pocillo y trabaje con las yemas de los dedos de una mano, y gradualmente arrastre la harina hacia el centro con la otra mano.", "Cuando los cubitos de mantequilla se hayan convertido en trozos pequeños y la masa esté granulosa, agregue gradualmente 125 ml de agua helada y mezcle hasta que esté todo incorporado, pero no trabaje demasiado la masa; debería tener un efecto marmolado con la mantequilla. sin mezclarlo apropiadamente.", "Enrolle la mezcla en un rectángulo de 2.5cm / 1in de grueso, envuélvala en una película adhesiva y refrigérela durante 20 minutos.", "Enharine la superficie de trabajo y extienda la masa en un rectángulo de 40x20cm / 16x8 pulgadas.", "Doble el tercio superior hacia el centro, luego el tercio inferior hacia arriba para luego doblar la parte superior. Dale un cuarto de vuelta.", "Haga rodar el bloque de masa en un rectángulo de 40x20cm / 16x8in como antes, y repita los pliegues. Estos son los primeros dos turnos. Repite dos veces más para hacer cuatro giros.", "Envuelva la masa en una película adhesiva y refrigere durante al menos 30 minutos antes de usarla.", "Para la tarta, precaliente el horno a 220C / 425F / Gas 7.", "Ruede los pasteles en una superficie de trabajo ligeramente enharinada de aproximadamente 3-4 mm de grosor. Cortar en tres rectángulos de 7.5x15cm / 3x6in y desempolvar la masa con azúcar glas para cubrir totalmente.", "Levante la masa en una bandeja para hornear y hornee durante 15 minutos. Mientras tanto, haz el relleno.", "Caliente una sartén pequeña hasta que esté caliente, agregue la mantequilla y las manzanas y cocine por un minuto, luego agregue 2-3 cucharadas de agua y continúe cocinando.", "Agregue la vaina de vainilla y las semillas, las moras y el jugo de limón y cocínelos durante 5-6 minutos, o hasta que estén blandos y suaves.", "Retirar del fuego y enfriar en la nevera mientras se cocina.", "Batir la crema doble en un tazón grande hasta que se formen picos firmes cuando se retire la batidora de la taza, y luego echarla en una bolsa de plástico.", "Una vez que la masa esté cocida, retírela del horno y déjela enfriar en una rejilla. Corta las hojuelas de repostería enfriadas por la mitad del ancho de la masa, tienes el mismo tamaño de rectángulos que antes pero la mitad de grueso: una pieza acristalada y una pieza inferior para cada hoja.", "Con una cuchara, coloque la mezcla de moras y manzanas en una capa de masa, luego vierta la crema sobre la superficie.", "Coloca otra pieza de pastel encima y luego repite con otra capa de mora, manzana y crema.", "Termine con una pieza de masa glaseada. Repita con la masa restante y las pilas se pueden cortar en porciones para servir."], "url": "www_bbc_co_uk_food_recipes_bramley_apple_and_63079", "title": "Tarta de milhojas de manzana y mora de Bramley", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250 g / 9 oz de moras congeladas", "50 g / 1 oz de azúcar en polvo", "2 manzanas Bramley, peladas, sin corazón y picadas", "2 cucharadas de azúcar en polvo", "apretón de jugo de limón", "½ cucharadita de canela molida", "1/8 de nuez moscada rallada", "40 g / 1½ oz de mantequilla ablandada, para engrasar", "115 g / 4 oz de azúcar en polvo", "175ml / 6fl de leche en oz", "1 vaina de vainilla, dividida longitudinalmente", "4 huevos medianos de granja, separados", "Harina normal de 25g / 1oz", "6 galletas, como las nueces de jengibre, remojadas en un chorrito de brandy o whisky (opcional)"], "method": ["Para el coulis de mora, coloca las moras y el azúcar en una olla pequeña con 100 ml de agua. Llevar a ebullición, luego cocine a fuego lento durante unos cinco minutos, o hasta que las bayas se descomponen. Retirar del fuego y dejar enfriar un poco.", "Incline la mezcla de frutas en una licuadora y mezcle hasta hacer un puré, luego cuele a través de un colador y frótelo con el dorso de una cuchara. Ponga a un lado hasta que esté listo para servir.", "Para el puré de manzana, coloque todos los ingredientes en una olla pequeña y caliéntelos suavemente, revolviendo ocasionalmente hasta que las manzanas se rompan. Deje que se enfríe un poco y luego licúe hasta lograr un puré suave, ya sea con una licuadora de mano o inclinando la mezcla en un procesador de alimentos o licuadora. Guarde los restos de esta receta en el refrigerador y úsela como salsa para el cerdo asado o sirva con yogur para el desayuno.", "Para el soufflé, unta cuatro platos individuales de soufflé de 10 cm / 4 in usando movimientos ascendentes para alentar la mezcla de soufflé. Cubra el interior con 40 g de azúcar.", "Caliente la leche y 20 g / ¾ oz del azúcar en una sartén pequeña. Raspe las semillas de la vaina de vainilla y deje que hierva lentamente, revolviendo con frecuencia. Retire del fuego.", "Batir las yemas de huevo y 15 g / ½ oz del azúcar en un tazón con una consistencia de cinta. (La consistencia de la cinta es cuando las yemas de huevo y el azúcar se han engrosado y aumentado en volumen hasta un punto donde un rastro de la mezcla se mantiene en la superficie por un segundo antes de volver a fusionarse). Mezcle la harina. Vierta la leche caliente sobre las yemas, revolviendo continuamente con un batidor. Regrese a la sartén y bata a fuego lento durante un minuto, luego vierta en un recipiente, cúbralo con film transparente y deje enfriar un poco. Agregue dos cucharadas de puré de manzana una vez que esté frío.", "Precalentar el horno a 200C / 400F / Gas 6 y poner una bandeja de horno dentro para calentar.", "Asegúrese de que su equipo de batido esté limpio y libre de grasa; de lo contrario, puede evitar que las claras se levanten. Batir las claras de huevo en un tazón para mezclar hasta que estén espesas y espumosas, luego agregar el azúcar restante y continuar batiendo hasta que las claras de huevo formen picos suaves cuando se quita el batidor del tazón. Es crucial no sobrepasar las claras de huevo. Inmediatamente y con confianza, bata un tercio de las claras de huevo en la mezcla de manzana, luego dobla delicadamente el resto con una cuchara grande.", "Divida la mezcla entre los platos de soufflé para que se nivele con el borde, enterrando los bizcochos (si los está usando) en el medio. Párese sobre la bandeja para hornear caliente y cocínela durante 8-10 minutos, o hasta que se eleve a 2,5 cm / 1 cm sobre la parte superior del plato y la parte superior esté dorada. La sobrecocción hará que los soufflés colapsen. Sirva los soufflés tan pronto como salgan del horno en platos calientes. Haz un pozo en el medio del soufflé y vierte el coulis."], "url": "www_bbc_co_uk_food_recipes_bramley_apple_and_81186", "title": "Soufflé de manzana y mora de Bramley", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1.3kg / 3lb moras, lavadas", "2 manzanas grandes para cocinar, lavadas, sin corazón y cortadas en cubitos", "450 ml / ¾ de agua por litro", "1 limón, solo jugo", "conservante o azúcar granulada", "2-3 cucharadas de crème de cassis (opcional)", "frascos de mermelada esterilizados y cubiertas de marihuana"], "method": ["Prepare una bolsa de gelatina o un trapo de té hirviéndolo en agua durante 2-3 minutos. Tira bien y deja que se enfríe. Coloque la bolsa de gelatina en un soporte o en un taburete con un cuenco grande debajo, listo para que el jugo de fruta gotee.", "Coloque las moras, la manzana, el agua y el jugo de limón en una cacerola conservada o grande, de base pesada.", "Llevar a ebullición, luego cocine a fuego lento durante 20-25 minutos o hasta que la fruta esté completamente suave.", "Incline la fruta blanda y el jugo en la bolsa de gelatina y déjela gotear durante 8 horas o hasta que se haya liberado todo el jugo.", "Prepare los frascos de mermelada lavándolos en agua caliente con jabón y déjelos secar y calentar en un horno frío: 130 ºC / 250 F / Gas ½ durante 10-15 minutos.", "Mida el jugo. Por cada 600 ml / 1 pinta pesa 450 g / 1 libra de azúcar. Vuelva a colocar el jugo y el azúcar en la cacerola limpiadora, caliente a fuego lento hasta que todo el azúcar se haya disuelto, agregue la crema de cassis, si la está usando. Llevar a ebullición y cocine a fuego lento durante 10-15 minutos o hasta que se alcance el punto de ajuste.", "Elimina cualquier espuma de la parte superior de la gelatina y llena los frascos de mermelada hasta el borde. Cubierta, sello y etiqueta. Almacene en un lugar fresco y oscuro hasta que se requiera."], "url": "www_bbc_co_uk_food_recipes_bramblejelly_13698", "title": "Jalea de mora", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Hace 3-5 jarras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bramblejelly_13698_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1½lb manzanas Bramley, peladas, sin corazón y picadas", "50-75 g / 2-3 onzas de azúcar en polvo", "25g / 1oz de mantequilla, más extra para engrasar", "2 x 320g / 11oz de hojas de hojaldre listas para usar (alrededor de 35cm x 23cm / 14in x 9in)", "Mazapán natural (sin colorear) de 250 g / 9 oz, en rodajas finas", "2 yemas de huevo de gallinas camperas, ligeramente batidas", "2 cucharadas de azúcar demerara", "200g / 7oz de crema coagulada, para servir"], "method": ["Precalentar el horno a 200C / 180 Fan / Gas 6.", "Caliente las manzanas, 50 g / 2 oz del azúcar impalpable, la mantequilla y 3 cucharadas de agua en una cacerola a fuego medio. Ponga la mezcla a ebullición, revuelva bien, cubra y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 3-5 minutos, o hasta que la manzana se haya ablandado.", "Retire la tapa y revuelva bien, luego cocine durante 2-3 minutos más, o hasta que la manzana se haya descompuesto por completo para formar un puré. Pruebe el puré y agregue más azúcar según sea necesario, luego retire el puré del fuego y déjelo enfriar.", "Coloque una hoja de hojaldre en una bandeja para hornear ligeramente engrasada con mantequilla. Coloque las rebanadas de mazapán en la parte superior de la masa para cubrir, dejando un borde de 2 cm / 1 en todo el contorno.", "Extienda el puré de manzana enfriado sobre la capa de mazapán, luego cepille el borde de la masa con un poco del huevo batido.", "Dobla la segunda hoja de hojaldre por la mitad a lo largo, luego puntúa cuidadosamente la masa desde el lado doblado hacia el lado cortado a 1 cm / ½ en intervalos por la longitud de la masa, dejando intactos 2 cm / 1 en el lado cortado de la masa.", "Desdobla la masa marcada y colócala exactamente encima de la masa cubierta de manzana, luego engarza los bordes para sellar las dos hojas de masa con los dedos.", "Recorte los bordes de la masa y cepille la parte superior de la rebanada de manzana Bramley todo con el huevo batido restante. Espolvorea la parte superior con azúcar demerara, luego hornea en el horno durante 25-30 minutos, o hasta que la masa se haya levantado y esté crujiente y dorada.", "Deje que se enfríe un poco antes de servir, sirva con la crema coagulada."], "url": "www_bbc_co_uk_food_recipes_bramley_apple_slice_66887", "title": "Rebanada de manzana Bramley", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bramley_apple_slice_66887_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de salvado", "125ml / 4fl de leche en oz", "100g / 3½ oz de harina de auto crianza", "100g / 3½oz de harina integral", "2 cucharaditas de azúcar demerara fina", "pizca de polvo de hornear", "75g / 3oz de tocino ahumado lardon, cocinado hasta que se dore", "1 limón, ralladura solamente", "1 cucharadita de canela molida", "3 cucharadas de miel clara", "75g / 3oz de mantequilla", "1 huevo de gallinas camperas", "100 ml / 3½ fl oz oz yogur", "mantequilla extra, para servir"], "method": ["Remoje el salvado en la leche durante cinco minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza las harinas, el azúcar y el polvo de hornear en un tazón. Agregue el tocino, la ralladura de limón y la canela.", "Caliente la miel y derrita la mantequilla en una cacerola pequeña a fuego lento. Fuera del fuego, bata el huevo, el yogur y el salvado con su leche.", "Revuelva los ingredientes húmedos en los ingredientes secos en el tazón.", "Con una cuchara, coloca la mezcla en las cajas de muffins y hornea por 20-25 minutos.", "Sirve con mantequilla."], "url": "www_bbc_co_uk_food_recipes_branbaconandcinnamon_85160", "title": "Muffins de salvado, tocino y canela", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de bacalao salado", "500ml / 18fl de leche en oz", "2 hojas de laurel", "2 dientes de ajo, en rodajas finas", "pocos granos de pimienta", "½ cucharadita de semillas de hinojo", "1 pieza de ralladura de limón", "Papas 400 g / 14 oz, peladas (peso sin pelar)", "100 m / 3½ fl oz crema individual", "75ml / 2½fl oz de aceite de oliva", "ralladura de nuez moscada", "1-2 cucharadas de aceite de oliva", "pocas rodajas de trufa", "rebanadas finas de pan francés, tostado"], "method": ["Primero remoje el bacalao - necesitará comenzar este proceso un día completo antes de que desee hacer la brandada. Coloque el bacalao en un recipiente grande y cúbralo con agua fría. Dejar en remojo a temperatura ambiente durante 24 horas, cambiando el agua al menos cuatro veces.", "Escurra el bacalao y póngalo en una cacerola. Cubra con agua y lleve a ebullición. Cocine a fuego lento durante cinco minutos, luego escurra. Repita este proceso", "Regrese el bacalao a la cacerola y esta vez cubra con la leche. Agregue las hojas de laurel, los dientes de ajo, los granos de pimienta, las semillas de hinojo y la ralladura de limón. Calentar suavemente hasta que esté casi hirviendo, luego bajar y dejar hervir a fuego lento durante 10 minutos. Retire del fuego y deje que el pescado se enfríe en la leche.", "Corta las papas en trozos pequeños y colócalos en una cacerola. Cubra con agua y lleve a ebullición. Cocine a fuego lento hasta que estén tiernos, alrededor de 10 minutos, luego escurra.", "Cuele el bacalao, reservando 50ml / 2fl oz de la leche, pero descartando los aromáticos. Retire la piel y los huesos del bacalao, luego triture los copos ligeramente con un tenedor.", "Haga la salsa en un procesador de alimentos o con la mano. Para hacer en un procesador de alimentos, coloque el pescado y las papas en el procesador con la leche reservada y la crema. Mezcle hasta que quede suave, luego rocíe gradualmente en el aceite de oliva mientras el motor está funcionando hasta que tenga una pasta suave y bien emulsionada.", "Alternativamente, machaque el bacalao con un tenedor, o machaque con una mano de mortero, incorporando gradualmente la leche reservada, luego machaque las papas con la crema. Mezcle y luego gradualmente trabaje en el aceite de oliva.", "Sirva con un poco de nuez moscada rallada, un chorrito de aceite de oliva y tal vez unas rodajas de trufa, junto con tostadas rebanadas de pan francés."], "url": "www_bbc_co_uk_food_recipes_brandade_de_morue_30836", "title": "Brandade de morue", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo", "15g / ½ oz de perifollo", "100g / 3½oz de papa, pelada, picada y hervida hasta que esté suave", "50g / 1¾oz de eglefino, escalfado y en copos", "sal y pimienta negra recién molida, al gusto", "hoja de perifollo, para adornar"], "method": ["Coloque todos los ingredientes, excepto la hoja de perifollo, en un procesador de alimentos y mezcle con un puré.", "Para servir, coloque en un tazón pequeño y adornar con la hoja de perifollo."], "url": "www_bbc_co_uk_food_recipes_brandard_83323", "title": "'Brandade'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]