[{"isVegetarian": true, "title": "Canapés de berenjena y tomate", "url": "www_bbc_co_uk_food_recipes_aubergine_and_tomato_31225", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_tomato_31225_16x9.jpg", "ingredients": ["1 berenjena grande o 2 medianas", "1 cucharada de aceite de girasol", "1 cucharadita de semillas de mostaza", "1 cebolla roja, finamente picada", "Jengibre de raíz fresco de 2½ cm / 1 en pieza, finamente picado", "2 cucharadas de pasta de tomate deshidratada", "½ cucharadita de sal", "1 chile verde, finamente picado", "½ cucharadita de azúcar en polvo", "manojo de cilantro fresco, finamente picado", "puñado de micro hierbas de amaranto rojo (opcional)", "60 g / 2¼ oz de mantequilla sin sal", "¼ cucharadita de sal", "puñado de hojas de cilantro, finamente picado", "Harina normal de 85g / 3oz", "2 huevos grandes de gallinas camperas, golpeados"], "serves": "Hace 15-20 canapés", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la parrilla a alto.", "Pinche la berenjena con un cuchillo y colóquela debajo de la parrilla, volteándola con frecuencia, durante aproximadamente 15 minutos o hasta que esté muy suave. Deje que se enfríe un poco, luego retire con cuidado la piel y pique finamente la carne.", "Caliente el aceite en una sartén a fuego alto, agregue las semillas de mostaza y cocine durante 1 minuto hasta que empiecen a reventar. (PRECAUCIÓN: cuando estallen las semillas de mostaza, mantenga la sartén lejos de su cara y ojos).", "Agregue las cebollas, reduzca el fuego y cocine durante 5-10 minutos, hasta que se ablanden. Agregue el jengibre y cocine durante 5 minutos. Agregue la berenjena picada, la pasta de tomate, la sal, el chile y el azúcar y cocine durante 10 minutos. Agregue el cilantro y deje enfriar.", "Precaliente el horno a 200C / 180C Ventilador / Gas 6. Coloque dos bandejas para hornear con papel para hornear. Dibuja círculos de 2½ cm en el papel pergamino, dejando la misma habitación de nuevo entre los círculos.", "Para la masa, combine la mantequilla, la sal, 125 ml / 4 fl oz de agua y las hojas de cilantro. Una vez que la mantequilla se haya derretido, hierva el líquido y retírelo del fuego. Incline la harina y revuelva rápidamente con una cuchara de madera. Revuelva vigorosamente durante 2 minutos y luego colóquelo en un bol para que se enfríe un poco. Con un batidor eléctrico, agregue gradualmente los huevos batidos a la pasta, batiendo cada vez que la agregue hasta que forme una pasta brillante que mantenga su forma cuando se entinta (es posible que no necesite todos los huevos).", "Coloca los choux en una manga pastelera y coloca el choux en los círculos marcados con el papel pergamino. Hornea por 20 minutos. Haga un hoyo en cada bollo choux usando un pincho y regréselo al horno por 10 minutos hasta que esté crujiente. Dejar enfriar sobre una rejilla.", "Corta la parte superior de los bollos de choux, saca cualquier masa mal cocida y llénalos con la mezcla de berenjena. Puede recalentar estos en el horno durante 3 minutos para que estén crujientes antes de servir. Decora con las micro hierbas o el cilantro picado, si se usa."]}, {"isVegetarian": true, "title": "Chips de berenjena con yogur de hinojo", "url": "www_bbc_co_uk_food_recipes_aubergine_chips_with_67293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_chips_with_67293_16x9.jpg", "ingredients": ["1 cucharadita de semillas de cilantro", "1 cucharada de semillas de hinojo", "200g / 7oz de yogur de estilo griego", "125g / 4½ oz de mayonesa", "1 cucharadita de jugo de limón", "gran pizca de sal marina", "pimienta negra", "2 cucharaditas de semillas de cilantro", "2 cucharaditas de semillas de hinojo", "Harina normal de 100 g / 3½ oz", "1 cucharadita de sal fina", "½ cucharadita de pimienta negra", "3-4 huevos medianos de granja", "Pan rallado de 150 g / 5½ oz panko", "2 cucharaditas de semillas de sésamo", "2 berenjenas, cortadas en forma de chips de 10cm / 4 pulgadas, aproximadamente ½cm / ¼ de ancho", "aceite, para freír"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Tueste ambas semillas de cilantro y de hinojo colocando las 6 cucharaditas en una sartén antiadherente y fríelas durante unos minutos hasta que las huela. Retire y muela en un mortero y una mano.", "Agregue 2 cucharaditas de semillas molidas al yogur y combine con los ingredientes restantes del yogur.", "Para las patatas fritas de berenjena, mezcle la harina, la sal y la pimienta en un tazón. En un segundo tazón, bate los huevos. En un tercer cuenco mezcle las migajas de pan, las semillas molidas restantes y las semillas de sésamo.", "Sumerja las rodajas de berenjena en la harina y cubra bien. Sacuda el exceso y luego sumérjalo en el huevo y sacúdalo para finalmente gotear en las migas de pan. Poner a un lado, pero no poner en la nevera.", "Caliente el aceite en una freidora de grasa profunda o una sartén profunda de fondo profundo y pesado a 190 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida). Freír la berenjena en lotes durante 2-3 minutos hasta que estén doradas. Retire y escurra sobre papel de cocina.", "Espolvorear con sal y servir con el yogur de hinojo."]}, {"isVegetarian": true, "title": "Gratinado de berenjena con salsa de tomate y ensalada", "url": "www_bbc_co_uk_food_recipes_aubergine_gratin_with_32622", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucharadas de aceite de oliva virgen extra", "400g / 14oz de tomates picados enlatados", "2 dientes de ajo, picados", "1 gran puñado de hojas frescas de albahaca, aproximadamente picadas", "sal y pimienta negra recién molida", "2 berenjenas cortadas longitudinalmente en rodajas de 0.5cm / ¼", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 gran puñado de hojas de albahaca, aproximadamente picadas", "Sultanas 110 g / 4oz", "50g / 2oz de piñones tostados", "1 mozzarella de búfala grande, ½ corte en rodajas finas y ½ toscamente picada", "110g / 4oz de hojas de cohete", "25 g / 1 oz de virutas de parmesano", "1 cucharada de vinagre balsámico", "3 cucharadas de aceite de oliva virgen extra", "exprimir jugo de limón", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la salsa de tomate, caliente una sartén a fuego medio-alto y agregue el aceite de oliva, los tomates y el ajo. Cocine a fuego lento durante 3-4 minutos, o hasta que los tomates comiencen a descomponerse.", "Agregue la albahaca y sazone, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para la berenjena, precaliente la parrilla a su configuración más alta. Calentar una sartén a fuego medio a alto. Sazonar las rodajas de berenjena con sal y pimienta negra recién molida. Cuando la sartén esté caliente, agregue el aceite y las rodajas de berenjena, unas pocas a la vez. Freír durante 2-3 minutos en cada lado, o hasta que estén doradas y suaves.", "Retire las rodajas de berenjena de la sartén y coloque en una sola capa en un plato o bandeja de horno forrada con papel de cocina, para drenar.", "Esparce sobre las hojas de albahaca, sultaninas, piñones y la mozzarella picada.", "Ruede cada porción de berenjena desde el lado corto, para formar un molinete. Seguro con un palito de cóctel.", "Coloque los rollos de berenjena llenos en un plato resistente al horno, apretándolos con fuerza. Retire los palitos de cóctel y cuchara sobre la salsa de tomate.", "Coloque las finas rebanadas de mozzarella en la parte superior y sazone con sal y pimienta negra recién molida.", "Grill durante 3-4 minutos, o hasta que el queso esté dorado y burbujeante.", "Para la ensalada, mezcle el cohete y las virutas de queso parmesano en un bol.", "Batir el vinagre balsámico, el aceite de oliva y el jugo de limón juntos en un tazón pequeño hasta que estén bien combinados, luego condimentar, al gusto, con sal y pimienta negra recién molida.", "Agregue el cohete y el parmesano al aderezo y mezcle bien para combinar.", "Para servir, espolvorea algunos de los rollitos de berenjena y la salsa de tomate en los platos y sirve la ensalada al lado."]}, {"isVegetarian": true, "title": "Hummus de berenjena", "url": "www_bbc_co_uk_food_recipes_aubergine_hummus_58701", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 berenjena mediana, cortada en discos de 1 cm / ½ pulgadas", "3 dientes de ajo picados", "6 cucharadas de aceite de oliva", "400 g / 14 oz pueden garbanzos, drenados", "3 ramitas de romero"], "serves": "Sirve 3", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Ajuste el horno a 200C / 400F / Gas 6.", "Coloque la berenjena en una bandeja para hornear, esparza el ajo picado y la mitad del aceite de oliva.", "Hornee en el horno por 15 minutos.", "Escurrir los garbanzos y calentar en una sartén con el resto del aceite de oliva y el romero.", "Cuando la berenjena esté suave y ligeramente tostada (después de unos 15 minutos), retírela del horno.", "Coloque la mitad de los garbanzos y la mitad de las berenjenas en un procesador de alimentos y mezcle hasta que quede suave.", "Devuelva la mezcla mezclada a la sartén y agregue el resto de las berenjenas y caliente durante un minuto.", "Servir caliente."]}, {"isVegetarian": true, "title": "Berenjena a la parmesana", "url": "www_bbc_co_uk_food_recipes_aubergine_parmigiana_57566", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_parmigiana_57566_16x9.jpg", "ingredients": ["2 berenjenas grandes, cortadas en rodajas finas de aproximadamente 5 mm / ¼ de grosor", "2 cucharadas de aceite de oliva", "100g / 3½ oz de ricotta", "100g / 3½oz de parmesano rallado (o queso vegetariano vegetariano alternativo)", "Mozzarella 100 g / 3½ oz, en rodajas", "sal marina y pimienta negra recién molida", "2 dientes de ajo, finamente picados", "1 cebolla roja, finamente picada", "un buen aceite de oliva", "2 x 400 g de tomates picados", "2 cucharaditas de orégano seco", "125ml / 4fl oz de vino tinto", "Una selección de hojas italianas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de Jerez", "1 cucharadita de mostaza Dijon"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cepille las rodajas de berenjena con aceite de oliva en ambos lados para cubrir. Caliente una sartén a la plancha y cocine las berenjenas durante unos minutos en ambos lados hasta que estén ligeramente doradas. Dejar de lado mientras te llevas la salsa de tomate.", "Calienta una sartén grande. Freír el ajo y la cebolla con un poco de aceite hasta que estén suaves. Agregue los tomates picados, el orégano y el vino. Cocine a fuego lento durante unos 15 minutos, o hasta que la salsa se espese.", "Precalentar el horno a 220C / 200C Fan / Gas 7.", "En una lata para asar de tamaño mediano, unte un poco de salsa de tomate sobre el fondo de la lata. Agregue una capa de rodajas de berenjena y distribuya otra capa de salsa de tomate encima.", "Extienda la mitad de la ricotta en la parte superior y espolvoree con parmesano, sal y pimienta. Continúa repitiendo las capas hasta que se use toda la berenjena. Termine con una capa de rodajas de mozzarella cubiertas con una pizca de parmesano final. Hornea por 25 minutos.", "Para la ensalada, coloque las hojas en un tazón grande y mezcle. Combine el aceite, el vinagre y la mostaza en un tazón pequeño. Condimentar con sal y pimienta. Viste las hojas con el aderezo justo antes de servir.", "Sirva la parmigiana caliente con la ensalada al lado. Este plato se recalienta bien si tienes restos de comida."]}, {"isVegetarian": false, "title": "Berenjena rellena con salchichas, piñones y pasas de Corinto", "url": "www_bbc_co_uk_food_recipes_aubergine_stuffed_with_73083", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas", "aceite de oliva virgen extra", "½ cebolla, picada", "1 diente de ajo, cortado en cubitos", "1-2 palitos de apio, cortados en cubitos", "½ bulbo de hinojo, cortado en cubitos", "225 g / 8oz de salchicha de cerdo luganega picante, pelada y desmenuzada", "Pan rallado blanco 30g / 1oz", "3 cucharadas de piñones", "20g / ¾oz alcaparras", "1 huevo de gallinas camperas", "1 cucharada de orégano seco", "3 cucharadas de pecorino rallado", "3 cucharadas de grosellas", "2 cucharadas de tomates secos picados", "2 cucharadas de orégano picado"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5.", "Pele algunas tiras a lo largo de las berenjenas, para que pueda sacar la carne de la berenjena. Corte una incisión y saque la carne y déjela a un lado.", "Caliente el aceite de oliva en una sartén y saltee la cebolla, el ajo, el hinojo y el apio hasta que se ablanden. Agregue la salchicha y cocine por 20 minutos. Picar la carne de berenjena y agregar a la sartén. Agregue las migas de pan a la sartén y luego los piñones.", "Incline la mezcla en un recipiente y agregue las alcaparras, el huevo, el orégano, el queso y las grosellas. Mezcle bien y sazone con sal y pimienta.", "Rellene las berenjenas con la mezcla y colóquelas en una bandeja honda para hornear, lubrique bien y agregue 150 ml / 5 fl oz de agua a la bandeja para hornear. Cubra holgadamente con papel aluminio y hornee durante 40 minutos. Esto ayudará a hervir y cocinar la berenjena. Retire la lámina y hornee por otros 10 minutos.", "Mientras tanto, mezcle los tomates secados al sol con el aceite de oliva restante y el orégano fresco.", "Para servir, cuchara los tomates secados al sol sobre la berenjena."]}, {"isVegetarian": true, "title": "Dip de berenjena y cilantro", "url": "www_bbc_co_uk_food_recipes_aubergineandcoriande_1929", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 berenjena mediana", "1 diente de ajo, pelado y aplastado", "jugo y ralladura 1 limón", "2 cucharadas de cilantro fresco picado", "120ml / 4fl oz de aceite de oliva", "Sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Poner la berenjena en una bandeja para hornear y asar en el horno durante 30-40 minutos hasta que estén tiernas. Enfriar y quitar la piel.", "Coloque la carne de berenjena en un procesador de alimentos con ajo, jugo de limón, cáscara y cilantro. Sazonar bien y zumbar juntos.", "Con el motor todavía en funcionamiento, vierta el aceite de oliva y mezcle hasta que la mezcla esté suave."]}, {"isVegetarian": true, "title": "Pilas de berenjena y mozzarella", "url": "www_bbc_co_uk_food_recipes_aubergineandmozzarel_68040", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas grandes, cortadas en rodajas de 1cm / ½ pulgada de grosor", "aceite de oliva, para cepillar", "1 mugful de perejil fresco de hoja plana", "3 dientes de ajo, finamente picados", "1 limón, ralladura rallada solamente", "1 cucharadita de Romero fresco picado", "4 bolas de mozzarella de búfala de 110 g / 4 oz cada una", "sal y pimienta negra recién molida.", "1 cucharada de aceite de oliva", "1 chalote, finamente picado", "1 chili rojo pequeño, regordete y pequeño, sin semillas y picado", "1 diente de ajo, finamente picado", "8 tomates de ciruela maduros, desollados y picados", "buena pizca de azúcar", "2 cucharadas de albahaca fresca picada"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cepille las rodajas de berenjena con aceite y sazone ligeramente. Caliente una sartén de plancha estriada hasta que sienta que sube un buen calor. Agregue las rodajas de berenjena y chargrill durante unos 3 minutos por cada lado hasta que se ablanden. Necesitas hacer esto en lotes. Retirar y dejar enfriar.", "Para hacer la gremolata, pique finamente las ramitas de perejil y mezcle con el ajo, la ralladura de limón y el romero.", "Corta las bolas de mozzarella en rodajas de 1cm / ½. Divida las rebanadas de mozzarella y berenjena en 4 porciones iguales. Coloque las rebanadas sobre una bandeja para hornear ligeramente engrasada, salpique la gremolata y condimente entre cada capa, para hacer 4 pilas, 4-5 capas de altura, utilizando las piezas más grandes para las bases y las piezas más pequeñas en la parte superior.", "Hornee las pilas en el horno durante unos 15 minutos hasta que el queso empiece a derretirse.", "Mientras tanto, para hacer la salsa, caliente el aceite en una sartén, agregue la chalota, el chile y el ajo y saltee durante unos 5 minutos. Agregue los tomates picados, el azúcar y el condimento. Cocine durante aproximadamente 10 minutos hasta que tenga una salsa espesa, revolviendo ocasionalmente. Agrega la albahaca. Entonces deja enfriar. Transfiera a un procesador de alimentos o licuadora y procese para hacer un puré. Vuelva a calentar la salsa en una olla limpia y manténgala caliente.", "Coloque cada pila en el centro de un plato para servir calentado con la salsa junto a la cuchara."]}, {"isVegetarian": true, "title": "Curry de berenjena", "url": "www_bbc_co_uk_food_recipes_auberginecurry_82146", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tallo de limoncillo, finamente picado", "2 dientes de ajo, finamente picados", "½ chile rojo, finamente picado", "1 cucharada de tallos de cilantro fresco picado", "1 cucharadita de semillas de comino", "Leche de coco 250ml / 9fl oz", "50ml / 2fl oz de agua caliente", "4 berenjenas tailandesas, reducidas a la mitad", "½ lima, solo jugo", "1 cucharada de cilantro fresco picado, para decorar"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle la hierba de limón, el ajo, el chile, los tallos de cilantro, las semillas de comino y una cucharada de agua caliente en una mini licuadora para formar una pasta.", "Coloque esta mezcla en una olla pequeña y cocine suavemente a fuego medio durante un minuto.", "Agregue la leche de coco, el agua caliente, las berenjenas y el jugo de lima, cubra con una tapa y cocine por 12 minutos o hasta que las berenjenas estén suaves.", "Para servir, vierta en un recipiente y adornar con cilantro picado."]}, {"isVegetarian": true, "title": "Tarta de berenjena y feta", "url": "www_bbc_co_uk_food_recipes_aubergine_and_feta_tart_82948", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aubergine_and_feta_tart_82948_16x9.jpg", "ingredients": ["2 berenjenas (aproximadamente 300 g / 10½ oz), termina recortadas y en rodajas finas a lo largo", "100ml / 3½ fl oz aceite de oliva, más extra para llovizna", "Paquete de 320 g de hojaldre listo para enrollar", "1 huevo pequeño de gallinas camperas, ligeramente golpeado", "4 cucharadas de pasta de tomate secada al sol", "2 dientes de ajo picados", "1 cucharadita de albahaca seca", "100g / 3½oz de feta", "sal y pimienta negra recién molida", "puñado de hojas de albahaca fresca, desgarrada, para servir", "5 dientes de ajo", "150ml / 5fl oz de aceite de oliva", "50ml / 2fl oz de vinagre balsámico", "1 cucharada de mayonesa entera en grasa", "4 puñados grandes de rúcula o ensalada de hojas mixtas", "1 cebolla roja pequeña, finamente cortada", "50g / 1¾oz de piñones, tostados"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Coloque una plancha a fuego medio-alto. Cepille las rodajas de berenjena con aceite de oliva y sazone suavemente por ambos lados. Cocine en la plancha hasta que esté tierna y chamuscada, volteando a la mitad. Es posible que deba hacer esto en lotes.", "Desenrolle la masa y colóquela en una bandeja grande para hornear antiadherente. Con un cuchillo pequeño, marque un borde de 1 cm / ½ pulgada alrededor del borde de la masa y pinche la base para evitar que se hinche. Cepille el borde con huevo batido.", "Mezcle la pasta de tomate, el ajo y la albahaca seca en un tazón pequeño y extiéndalos sobre la base, evitando el borde. Coloque la berenjena encima. Desmiga el queso feta y espolvorea sobre las berenjenas. Hornee en el estante del medio durante 25-30 minutos, o hasta que los lados se hinchen y la masa se haya cocinado. Deje reposar por 10 minutos.", "Mientras tanto, prepara la ensalada. Coloque con cuidado los dientes de clavo en el borde de una pequeña placa de cocina y encienda la llama en su posición más baja para que los bordes se enganchen y el ajo se ponga negro. Apague el gas, deje que el ajo se enfríe un poco, pique los dientes lo más finamente posible y aplaste con la parte posterior de un cuchillo.", "Coloque el ajo, el aceite, el vinagre, la mayonesa y una pizca de sal en un recipiente con tapa y agite hasta que quede suave.", "Coloque las hojas, la cebolla y los piñones en un tazón grande y rocíe sobre el aderezo. (Cualquier apósito sobrante se puede refrigerar).", "Para servir, corte la tarta en cuatro a seis rebanadas y sirva con la ensalada. Espolvorea sobre la albahaca y termina con un chorrito de aceite de oliva."]}, {"isVegetarian": false, "title": "Moussaka de berenjena con patatas salteadas", "url": "www_bbc_co_uk_food_recipes_auberginemoussakawit_88436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas", "2 cucharadas de aceite de oliva", "1 cebolla grande, picada", "2 dientes de ajo, aplastados", "600g / 1lb 5oz cordero picado", "4 tomates de ciruela, finamente picados", "1 cucharadita de comino molido", "1 cucharadita de canela molida", "½ cucharadita de orégano seco", "150ml / 5fl oz de vino tinto", "2 cucharadas de menta fresca picada", "120ml / 4fl oz de caldo de pollo", "sal y pimienta negra recién molida", "25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "200ml / 7fl oz de leche, calentada a punto de ebullición", "2 huevos de gallinas camperas, golpeados", "pizca de nuez moscada recién rallada", "Queso cheddar de 75 g / 3 oz, rallado", "Queso mozzarella 75 g / 3 oz, rallado", "2 cucharadas de aceite de oliva", "3 papas blancas, peladas y cortadas en cubos", "sal y pimienta negra recién molida", "2 cucharadas de perejil de flatleaf"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Cortar las berenjenas por la mitad, y cuidadosamente sacar la carne, dejando las pieles a un lado. Cortar la carne de berenjena en cubos pequeños.", "Calentar una sartén a fuego medio hasta que esté caliente, luego agregar el aceite de oliva y las berenjenas y freír durante 2-3 minutos.", "Agregue la cebolla y el ajo y freír durante 2-3 minutos más, hasta que las cebollas se hayan suavizado y las berenjenas estén comenzando a dorarse.", "Agregue el cordero picado y cocine durante 4-5 minutos, hasta que se dore.", "Agregue los tomates, el comino, la canela, el orégano seco y el vino tinto y cocínelos durante 2 o 3 minutos, rompiendo los tomates con una cuchara mientras cocina.", "Agregue la menta y el caldo. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Vierta la mezcla de berenjena en las pieles de berenjena reservadas y colóquelas en una bandeja de asar.", "Coloque la mantequilla en una sartén a fuego medio. Cuando la mantequilla se haya derretido, agregue la harina y cocine, revolviendo bien, durante un minuto. Agregue la leche caliente y cocine, revolviendo constantemente, durante 2-3 minutos, hasta que la mezcla se espese.", "Agregue los huevos, sazone con sal y pimienta negra recién molida, y agregue la nuez moscada.", "Agregue la mitad del queso cheddar rallado y la mozzarella y continúe cocinando, revolviendo, hasta que se combinen como una salsa suave.", "Ponga la misma cantidad de salsa de queso sobre la parte superior de cada una de las berenjenas rellenas, luego espolvoree con el queso cheddar rallado y la mozzarella.", "Transfiera las berenjenas rellenas al horno para hornear durante 20-25 minutos, hasta que el relleno de queso esté dorado y burbujeante.", "Mientras tanto, para las papas salteadas, caliente una sartén a fuego medio hasta que esté caliente. Agregue el aceite de oliva y las papas y fría, volteándolas de vez en cuando, durante 7-8 minutos, o hasta que se doren por completo y estén tiernas.", "Sazone las papas con sal y pimienta negra recién molida, luego agregue el perejil plano y revuelva bien.", "Para servir, coloque una berenjena rellena en cada plato y coloque una cucharada de papas salteadas al lado."]}, {"isVegetarian": true, "title": "Berenjena y tofu satay", "url": "www_bbc_co_uk_food_recipes_aubergineandtofusata_8816", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chalote, pelado, finamente picado", "1 tallo de limoncillo, hojas externas duras retiradas, picadas", "2 chiles rojos pequeños, picados", "2 dientes de ajo, pelados, aplastados", "Jengibre fresco de raíz de 2.5cm / 1 pulgada, pelado y rallado", "1 lima, ralladura solamente", "1 cucharada de cilantro fresco picado", "2 cucharadas de aceite de cacahuete", "1 paquete de tofu firme, escurrido y prensado", "1 berenjena", "12 pinchos de madera cortos, empapados en agua fría durante al menos 15 minutos", "2 cucharadas de aceite de cacahuete", "1 chalote, pelado, finamente picado", "2 dientes de ajo, pelados, finamente picados", "2 chiles rojos grandes, sin semillas, picados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "75g / 3oz de mantequilla de maní crujiente", "200 g / 7 fl oz de leche de coco", "1 lima, solo jugo", "sal al gusto"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la pasta de curry verde, coloque todos los ingredientes de la pasta en un mortero y machaque con un mortero hasta que formen una pasta. (No necesitará toda la pasta; guarde la porción no utilizada en un recipiente bien tapado en la nevera durante un máximo de dos semanas).", "Para los pinchos, mezcle tres cucharadas de la pasta de curry verde junto con una cucharada de aceite de maní hasta que estén bien combinados.", "Cortar el tofu y la berenjena en cubos de 1,25 cm / ½ pulgada y ensartar en los pinchos de madera, alternando el tofu y la berenjena a lo largo del pincho. Coloque los pinchos planos en un plato y vierta sobre la mezcla de pasta de curry para cubrir bien, frotando la berenjena y el tofu por todas partes. Cubra con una película adhesiva y déjelo marinar durante al menos 30 minutos, o durante la noche si es posible, en la nevera.", "Precalentar la parrilla a mediano.", "Cepille las verduras con el aceite de maní restante y cocínelas debajo de la parrilla durante 8-10 minutos, volteándolas una vez, o hasta que las brochetas estén doradas por todas partes. Dejar de lado.", "Para la salsa satay, caliente el aceite en una sartén pequeña y fría la chalota, el ajo, los chiles y las especias durante 4-5 minutos, o hasta que la chalota y el ajo se ablanden.", "Mezcle la mantequilla de maní con un poco de agua tibia para hacer una pasta más delgada y agregue a la sartén, seguido de la leche de coco. Llevar a ebullición, luego cocine a fuego lento durante 6-8 minutos, o hasta que la salsa se espese. Sazonar, al gusto, con jugo de limón y sal. Divida la salsa en partes iguales entre cuatro cuencos pequeños.", "Sirva los pinchos en platos individuales con un tazón pequeño de salsa satay en el lado."]}, {"isVegetarian": true, "title": "Envoltura de berenjena y mozzarella con pesto de berro", "url": "www_bbc_co_uk_food_recipes_aubergineandmozzarel_77215", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 rebanadas de pan, largas y muy finas", "1 paquete de berenjenas a la parrilla", "5 mini bolas de mozzarella", "5 hojas de albahaca, desgarradas", "aceite de oliva, a llovizna", "1 puñado de albahaca", "Paquete de 50g / 1¾oz de berro, blanqueado", "3 cucharadas de yogur al estilo griego", "25 g / 1 oz de piñones", "pimienta negra recién molida", "2 cucharadas de aceite de oliva"], "serves": "Rinde 5", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las envolturas, coloque las rodajas de berenjena en las rebanadas de pan y cubra cada una con la mozzarella y la albahaca.", "Ruede como un rollo suizo. Asegure con palitos de cóctel y rocíe con aceite.", "Coloque en una bandeja para hornear y coloque en el horno durante 3-4 minutos, hasta que el queso esté burbujeante y se calientan.", "Para hacer el pesto, mezcle todos los ingredientes en un procesador de alimentos y rocíe alrededor de los rollos de berenjena."]}, {"isVegetarian": true, "title": "Buñuelos de mozzarella de berenjena con berenjena 'caviar'", "url": "www_bbc_co_uk_food_recipes_auberginemozzarellaf_91463", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para freír", "2 berenjenas, en rodajas finas", "sal y pimienta negra recién molida, al gusto", "2 bolas de mozzarella, finamente cortadas", "1 eneldo pequeño de racimo, recogido", "¼ cucharadita de azúcar en polvo", "1 cucharadita de levadura seca de acción rápida", "1 cucharadita de vinagre de sidra", "300ml / 11fl oz de cerveza", "Harina normal de 200g / 7oz", "2 berenjenas", "2 ramitas de romero, cortadas en trozos", "2 dientes de ajo, cortados en rodajas gruesas", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 bolsa pequeña de hojas de ensalada mixtas", "1 manojo de eneldo, recogido", "1 cucharada de mostaza Dijon", "1 cucharada de vinagre de vino tinto", "3 cucharadas de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Para los buñuelos de berenjena, caliente el aceite en una freidora a 190 ° C o llene a medias una sartén de base pesada con aceite vegetal y caliente hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje desatendido).", "Coloque una rodaja de berenjena sobre una superficie de trabajo limpia. Sazonar bien con sal y pimienta negra recién molida, luego cubrir cada rebanada de berenjena con una rodaja de mozzarella. Sazonar una vez más con sal y pimienta negra recién molida, luego espolvorear con suficiente eneldo para cubrir la mozzarella.", "Cubra con otra rodaja de berenjena para formar una pila, luego presione bien hacia abajo. Repita con la berenjena, la mozzarella y el eneldo restantes hasta que se hayan agotado todas las rodajas de berenjena, el queso y las hierbas.", "Coloque la levadura, el azúcar, el vinagre y la cerveza en un tazón grande y mezcle hasta que quede suave y comience a burbujear. Batir la harina para hacer una masa espesa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Sumerge todas las pilas de berenjena y mozzarella en la masa. Cúbralo bien, luego bótelo cuidadosamente en el aceite caliente, en tandas. Freír durante 1-2 minutos en cada lado, o hasta que estén dorados y cocidos. Retire de la sartén con una cuchara ranurada y déjela a un lado para escurrir sobre papel de cocina. Sazonar, al gusto, con sal.", "Para el 'caviar' de berenjena, precaliente el horno a 200C / 400F / Gas 6. Con un cuchillo afilado, corte las ranuras en las berenjenas. Presione las piezas de las ramitas de romero y las rodajas de ajo en las hendiduras.", "Coloque las berenjenas en una bandeja de asar y tueste en el horno durante una hora, o hasta que estén suaves. Retirar y dejar a un lado para que se enfríe un poco.", "Saca la carne de berenjena de las pieles con una cuchara y colócala en el recipiente de un procesador de alimentos. Licuar hasta obtener un puré, luego agregar el jugo de limón y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la ensalada, coloque las hojas de ensalada y el eneldo en un tazón. Batir la mostaza de Dijon, el vinagre y el aceite de oliva juntos en un recipiente aparte. Agregue este aderezo a las hojas de la ensalada y mezcle bien.", "Para servir, coloque una cucharada de berenjena 'caviar' en cada plato. Coloque dos buñuelos de berenjena encima y amontone la ensalada."]}, {"isVegetarian": true, "title": "Espárragos con huevos de pato revueltos y cebolletas", "url": "www_bbc_co_uk_food_recipes_asparaguswithscrambl_87736", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 manojo de espárragos", "2 cucharadas de aceite de oliva", "3 huevos de pato al aire libre", "2 cucharadas de cebolletas frescas picadas", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 350F / Gas 6.", "Con un cuchillo afilado, recorte los tallos leñosos de las espárragos.", "Caliente una cucharada de aceite en una sartén a prueba de horno. Agregue los espárragos y fría en la sartén por unos minutos, antes de transferirlos al horno para cocinar durante 4-5 minutos hasta que estén tiernos hasta el final.", "Agriete los huevos en un tazón pequeño y agregue los cebollines picados. Batir los huevos con el cebollín y la sal y pimienta negra recién molida al gusto.", "Caliente el aceite de oliva restante en una sartén pequeña a fuego medio-bajo, luego agregue los huevos y revuelva con una cuchara de madera hasta que los huevos estén recién cocinados. Retire del fuego.", "Divida los espárragos tostados entre dos platos. Coloque el huevo revuelto junto al espárrago y sirva."]}, {"isVegetarian": true, "title": "Pinchos de berenjena satay", "url": "www_bbc_co_uk_food_recipes_auberginesatayskewer_92178", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 berenjenas, cortadas por la mitad a lo largo", "1-2 cucharaditas de sal", "6-8 cucharadas de aceite vegetal", "100ml / 3½fl oz de aceite vegetal", "Cacahuetes sin sal 225g / 8oz, conchas eliminadas", "4 chalotes, pelados, picados", "2 dientes de ajo, pelados, picados", "pizca de chile en polvo", "½-1 cucharadita de azúcar morena, al gusto", "1 cucharada de salsa de soja oscura", "400ml / 14fl oz de agua", "1 chile rojo pequeño, finamente picado", "1 limón, solo jugo", "pizca de sal"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Remoje de cuatro a ocho brochetas de madera en un recipiente con agua durante 10 minutos, luego sacuda el exceso de humedad y déjelo a un lado.", "Corta con fuerza cada mitad de berenjena en medias lunas. Mientras tanto, coloque las rodajas de berenjena en un tazón grande, espolvoree la sal y rocíe sobre el aceite. Mezcle bien hasta que todas las rebanadas estén cubiertas de manera uniforme en el aceite y la sal. Dejar de lado por 20 minutos.", "Cuando las berenjenas hayan reposado durante 20 minutos, caliente una charola a fuego alto.", "Cuando la sartén esté caliente, agregue las rodajas de berenjena, en lotes, y la plancha durante dos minutos en cada lado, o hasta que aparezcan marcas doradas de la plancha en ambos lados. Retire las rodajas de berenjena de la sartén y déjelas a un lado hasta que estén lo suficientemente frías para manipularlas.", "Repite el proceso con las rebanadas restantes de berenjena.", "Pase las rodajas de berenjena a la parrilla en los pinchos de madera empapados, disponiendo cada media luna en un ángulo diferente al de debajo para crear una espiral. Dejar de lado.", "Para la salsa satay, caliente 80ml / 2¾fl oz del aceite en un wok a fuego alto. Agregue los cacahuetes y sofría por 2-3 minutos, o hasta que estén dorados.", "Transfiera los cacahuetes fritos a un procesador de alimentos y mezcle hasta lograr una pasta homogénea.", "Caliente el aceite restante en una sartén a fuego medio. Agregue los chalotes y el ajo y fría por 1-2 minutos, o hasta que estén blandos.", "Agregue el chile en polvo, el azúcar morena, la salsa de soya y el agua, mezcle bien y ponga la mezcla a ebullición.", "Agregue la pasta de maní y chile rojo picado y revuelva bien para combinar. Deje que la mezcla hierva a fuego lento, luego continúe cocinando a fuego lento durante 8-10 minutos o hasta que espese. Agregue el jugo de limón y la sal.", "Para servir, coloque los pinchos de berenjena en cuatro vasos altos o en cuatro platos para servir. Sirve la salsa satay en cuencos de inmersión al lado."]}, {"isVegetarian": true, "title": "Ensalada de berenjena con hinojo y naranja", "url": "www_bbc_co_uk_food_recipes_auberginesaladwithfe_91623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bombilla de hinojo, cortada muy finamente en una mandolina", "2 naranjas, 1 segmentado, 1 cáscara y jugo", "50ml / 2fl oz de vinagre de jerez", "175ml / 6fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 cucharada de estragón fresco picado", "2 berenjenas, cortadas en cuñas", "4-5 cucharadas de aceite vegetal", "2 panes naan grandes, cortados en 6 discos de 10cm / 4in de diámetro", "racimo pequeño de hojas frescas de berro"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["En un tazón, mezcle las rodajas de hinojo, los segmentos de naranja, el jugo de naranja, la ralladura de naranja, el vinagre de jerez y el aceite de oliva hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar el estragón picado y remover bien.", "Frote las cuñas de berenjena por todas partes con 2-3 cucharadas de aceite vegetal. Caliente una sartén a fuego medio. Cuando la sartén esté caliente, agregue las cuñas de berenjena y ase a la parrilla durante 1-1½ minutos en cada lado, o hasta que aparezcan marcas doradas a ambos lados y la berenjena esté tierna. Reservar en un plato caliente.", "Cepille los discos de pan naan por todas partes con el aceite vegetal restante. Agregue el pan naan a la sartén de la plancha en la que se cocinó la berenjena y ase a la parrilla por un minuto en cada lado, o hasta que aparezcan las marcas doradas de la plancha en ambos lados.", "Para servir, coloque un disco de pan naan a la parrilla en el centro de cada una de las seis placas de servir. Coloque una pizca de hojas de berros en el centro de cada pan naan, luego una porción de berenjena se dobla en la parte superior. Cuchara sobre el aderezo de vinagre de Jerez. Coloque pequeñas pilas de hinojo marinado y naranja alrededor del pan naan y rocíe sobre el aderezo restante."]}, {"isVegetarian": false, "title": "Berenjena rellena de chorizo, espinaca, tomate y ricotta", "url": "www_bbc_co_uk_food_recipes_auberginestuffedwith_85210", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 berenjena, cortada a la mitad a lo largo", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "75g / 2½ oz de chorizo", "1 tomate, finamente picado", "50 g / 1¾oz de espinaca, picada", "75g / 2½oz de queso ricotta"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Saca un poco de carne de las mitades de berenjena. Cortar finamente la carne y dejar de lado.", "Coloque las mitades de berenjena en una bandeja para hornear, rocíe con la mitad del aceite de oliva y sazone bien con sal y pimienta negra recién molida. Transfiera al horno y tueste por 8-10 minutos.", "Mientras tanto, caliente el aceite restante en una sartén a fuego medio y fría el chorizo ​​durante 2-3 minutos. Agregue la carne de berenjena picada y cocine durante 1-2 minutos. Agregue el tomate y las espinacas y cocine por un minuto más.", "Retirar del fuego, agregar la ricota y sazonar bien con sal y pimienta negra recién molida.", "Retire las mitades de berenjena del horno, vierta la mezcla de relleno en las mitades de berenjena y coloque de nuevo en el horno durante 6-8 minutos, o hasta que se suavice y se dore.", "Para servir, coloque las mitades rellenas de berenjena en dos platos."]}, {"isVegetarian": true, "title": "Pan australiano con amortiguador de aceite", "url": "www_bbc_co_uk_food_recipes_aussie_olive_damper_47860", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aussie_olive_damper_47860_16x9.jpg", "ingredients": ["Harina de auto aumento de 450 g / 1 lb, más extra para quitar el polvo", "3 ramitas de romero, solo hojas, más o menos picadas", "½ cucharadita de sal", "1 cucharada de aceite de oliva extra virgen", "75g / 3oz de aceitunas verdes o negras deshuesadas, más o menos picadas", "Aceite de oliva con sabor a fruta y vinagre balsámico"], "serves": "Hace 1 pan", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 200C / 400F / Gas 6 y coloque una bandeja para hornear para calentar.", "Ponga la harina en un tazón grande, con el romero, la sal, el aceite y 225 ml / 8 fl oz de agua. Mezcle todo bien hasta que la masa comience a unirse en una bola. Luego ponga sus manos dentro y coloque todas las partes secas, usando el pan como un paño para juntar todas las partes.", "Polvore una tabla o superficie de trabajo limpia con un poco de harina y coloque la masa. Ajústalo en una ronda plana, coloca las aceitunas en el centro y aplástalas un poco, llevando los bordes de la masa hacia el centro, de modo que las aceitunas estén cubiertas. Luego voltea la masa y amasa las aceitunas.", "En este punto, la masa puede estar bastante húmeda, con aceitunas volando por toda la tienda, pero sigue empujando las aceitunas deshonestas de vuelta a la masa. Si todo está muy húmedo, solo agrega un puñado de harina a la masa. Dale forma a una ronda de 20 cm / 8 pulgadas y colócala en la bandeja de horno calentada.", "Frote un poco de harina en el mango de una cuchara de madera. Luego, sosteniendo el mango horizontal al pan, presione hacia abajo sobre el pan haciendo una sangría casi hasta el fondo de la bandeja.", "Gire la manija de forma que quede en un ángulo de 90 grados con respecto a la primera línea y empuje hacia abajo nuevamente para hacer una cruz. Haga esto dos veces más para que su pan parezca una especie de cara de reloj de ocho porciones triangulares.", "Hornee en el horno durante 35 minutos o hasta que el pan suene hueco al tocarlo en la parte inferior. Esto es maravilloso servido caliente con un poco de aceite de oliva con sabor a fruta y balsámico."]}, {"isVegetarian": true, "title": "Postre de otoño", "url": "www_bbc_co_uk_food_recipes_autumn_pudding_30736", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/autumn_pudding_30736_16x9.jpg", "ingredients": ["Peras inglesas de 400 g / 14oz (como Conference), peladas y cortadas en cuartos", "300 g / 10 oz de manzanas para cocinar (como Bramley), peladas y cortadas en cuartos", "Ciruelas maduras de 500 g / 17 oz cortadas a la mitad, sin hueso", "450 g / 1 libra de moras frescas", "200 g / 7 oz de azúcar en polvo", "15g / ½ oz de mantequilla", "aceite de girasol, para engrasar", "10 rebanadas gruesas de pan blanco, sin costras"], "serves": "Para 6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Coloque la fruta, el azúcar y la mantequilla en una olla y cocine a fuego medio durante 15 minutos, o hasta que se ablanden. (No revuelva demasiado a menudo ya que la fruta se volverá blanda).", "Retire la sartén del fuego y vierta el contenido en un colador sobre un tazón grande. Deje reposar durante 8-10 minutos, revolviendo una o dos veces, para que la fruta libere todo el jugo posible. Deberías terminar con alrededor de 600ml / 20fl oz.", "Vierta el zumo de fruta en la olla, deje hervir a fuego lento y cocine durante 10-15 minutos, o hasta que el volumen del líquido se haya reducido a la mitad. Retire la sartén del fuego y déjela enfriar durante 20-30 minutos.", "Engrase ligeramente un recipiente de pudín de 1.5 litros / 2 pinta y alinee con film transparente, dejando un montón sobresaliendo del borde. Cortar una rebanada de pan con un cortador redondo y sumergirlo rápidamente en el jugo de fruta. Coloque en la base del lavabo con leche.", "Corte las otras rebanadas de pan por la mitad y sumerja de a una en el jugo. Coloque las piezas verticales ligeramente superpuestas alrededor del interior del lavabo, asegurándose de que estén empapadas en jugo sin estar empapadas.", "Una vez que todos los lados de la palangana estén cubiertos con pan, vierta la mitad del jugo de fruta restante sobre la fruta drenada y revuelva muy ligeramente hasta que se vea abundante y brillante. Vierta la mezcla en el cuenco del pudín.", "Sumerja las rebanadas de pan restantes en el jugo de fruta y colóquelo sobre la parte superior del pudín, recortando el pan donde sea necesario para darle un acabado limpio. Reserve cualquier jugo de fruta restante en un tazón pequeño.", "Coloque el pudín en un plato. Cubra la parte superior del pudin con la película adhesiva, coloque un plato en la parte superior (asegúrese de que quede dentro del lavabo) y pese con un par de latas. Enfriar en la nevera durante la noche.", "Cuando esté listo para servir, retire los pesos y la placa y abra la película adhesiva. Coloque un plato de servir en la parte superior del pudín e invierta. Retire el lavabo y despegue la película adhesiva. Cepille cualquier espacio donde se muestre pan blanco con el zumo de fruta reservado."]}]