[{"ingredients": ["190g / 6½ oz de harina de auto crianza", "150 g / 5 oz de azúcar en polvo", "2 cucharadas de cacao en polvo", "1 nivel de cucharadita de bicarbonato de soda", "1 cucharadita de polvo de hornear de nivel", "2 cucharadas de jarabe de oro", "2 huevos de gallinas camperas", "150ml / ¼ pinta de aceite de girasol", "150 ml de leche de pinta", "200g / 7oz de chocolate blanco", "Crema doble de 150 ml / 1/4 de pinta", "1 x 125 g / 4½ oz de crema de queso con grasa entera"], "method": ["Caliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase y cubra con papel engrasado engrasado las bases de dos latas de bocadillo suelto de lados rectos de 20 cm / 8 pulg.", "Tamiza los ingredientes secos en un tazón grande y haz un pozo en el centro. Agregue el jarabe, los huevos, el aceite y la leche, mezcle con un batidor eléctrico y viértalo en las latas.", "Hornee en el horno durante 25-30 minutos, o hasta que los pasteles salten hacia atrás cuando los presione ligeramente con la punta de los dedos. Déle vuelta a una rejilla de alambre, retire el papel y déjelo enfriar.", "Para la formación de hielo, rompa el chocolate blanco en un tazón. Caliente la crema doble en una sartén, hasta que esté muy caliente, pero no hirviendo, y vierta la crema caliente sobre el chocolate blanco para derretirlo. Revuelva hasta que se derrita y deje enfriar.", "Coloque el queso crema en un tazón y luego agregue gradualmente la mezcla de chocolate blanco y revuelva hasta que se combinen. Dejar de lado para enfriar un poco, hasta que espese lo suficiente como para helar.", "Extiende la mitad del glaseado en una torta, coloca la otra en la parte superior y extiende el resto del glaseado en la parte superior para darle un acabado bonito."], "url": "www_bbc_co_uk_food_recipes_celebration_chocolate_18175", "title": "Pastel de chocolate de celebración", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celebration_chocolate_18175_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 huevo", "2 cucharadas de aceite vegetal", "2 cucharadas de leche", "½ cucharadita de extracto de vainilla", "12 frambuesas frescas", "60g / 2oz de harina auto crianza", "1 cucharada de azúcar en polvo", "3 conos de helado de fondo plano"], "method": ["Lávese las manos y póngase un delantal. Pese y mida todos los ingredientes. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 5.", "Rompa el huevo suavemente en una taza. Luego separe el huevo haciendo una forma de garra con una mano y sosténgalo sobre un tazón. Luego vierta el huevo entero en su mano y atrape la yema, dejando que el blanco gotee dentro del tazón. (Puede poner la yema a un lado para otra receta).", "Batir la clara de huevo con un tenedor para hacer algunas burbujas. Agregue el aceite y la leche y vuelva a mezclar. Agregue el extracto de vainilla.", "Toma seis frambuesas y ponlas a un lado. Coloque las frambuesas restantes en la mezcla de clara de huevo; puede aplastarlas un poco para que la mezcla se vuelva rosa.", "En otro recipiente para mezclar, mezcle la harina y el azúcar que aumenten la temperatura.", "Incline los ingredientes húmedos en la mezcla de harina y revuelva hasta que estén completamente mezclados. La mezcla estará bastante húmeda.", "Coloque los conos de helado en una lata de pan de 500 g para que se levanten derechos. Agrega una frambuesa en la parte inferior de cada corneta. Divida la masa de la torta por igual entre los conos de helado usando dos cucharas, una para recogerla y otra para insertarla. Ahora agregue una frambuesa en la parte superior de cada una como decoración. Pídale a un adulto que los ponga en el horno por 20-25 minutos. Deja enfriar. Sirve los pasteles con frambuesas frescas adicionales."], "url": "www_bbc_co_uk_food_recipes_celebration_cornet_cake_49654", "title": "Pastel de ciruela Celebration", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 3 tortas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 lb 2 oz (aproximadamente 3) comiendo manzanas", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de girasol", "2 cebollas picadas", "1 apio nabo (aproximadamente 750 g / 1 libra 10 onzas), cortado en trozos de aproximadamente 2 cm / in", "1 zanahoria grande (aproximadamente 120 g / 4½ oz), cortada en aproximadamente 1,5 cm / ½ en rodajas", "2 dientes de ajo, aplastados", "2 papas medianas (aproximadamente 250 g / 9 oz), peladas y cortadas en trozos de aproximadamente 2 cm / in", "1 pequeño racimo de tomillo fresco (3-4 ramitas)", "1 hoja de laurel", "1,3 litros / 2¼ pintas de caldo de verduras o pollo, hecho con 1 cubo de reserva", "sal marina escamada y pimienta negra recién molida", "1 cucharadita de aceite de girasol", "4 lonchas de tocino ahumado sin corteza", "4 cucharadas de crema fresca", "2 cucharadas de leche", "pequeño perejil de hojas planas, hojas rotas"], "method": ["Pele las manzanas, córtelas en cuartos y quite los núcleos. Corta las manzanas en rodajas gruesas. Derrita 25 g / 1 oz de la mantequilla en una olla grande y fría los trozos de manzana a fuego medio durante cinco minutos, o hasta que estén ligeramente dorados, volteándolos regularmente. Con una cuchara ranurada, transfiere los trozos de manzana a un plato y devuelve la sartén al fuego.", "Agregue la mantequilla y el aceite restantes a la sartén y tan pronto como la mantequilla se derrita, fríe con cuidado las cebollas, el apionabo y la zanahoria durante 15 minutos, o hasta que las cebollas estén blandas y muy ligeramente doradas, revolviendo ocasionalmente. Agregue el ajo, las manzanas, las papas, el tomillo y la hoja de laurel y cocine durante tres minutos más, revolviendo.", "Vierta el caldo en la sartén, sazone con pimienta negra y deje que hierva. Reduzca el fuego a fuego lento y cocine por unos 25 minutos, o hasta que el apionabo y las zanahorias estén muy suaves, revolviendo ocasionalmente.", "Retire la sartén del fuego. Retire los tallos de tomillo y la hoja de laurel y deséchelos. Enfríe un poco y luego mezcle la sopa con una batidora hasta que esté muy suave. (Para una sopa aún más aterciopelada, pásala por un colador fino hasta un recipiente limpio). Agrega un poco de agua extra, si es necesario, hasta alcanzar la consistencia adecuada. Alternativamente, permita que la sopa se enfríe por un tiempo y luego mezcle en un procesador de alimentos hasta que quede suave y vuelva a la sartén.", "Ajuste el aderezo con sal y pimienta al gusto. Ponga a un lado hasta que esté listo para servir.", "Para hacer la guarnición, cepille el aceite sobre el interior de una sartén pequeña antiadherente y fríe el tocino durante 2-3 minutos por cada lado a fuego medio-alto hasta que se dore y se ponga crujiente. Escurrir sobre papel de cocina.", "Mezcle la crème fraîche con la leche en un tazón pequeño hasta que quede suave.", "Vuelva a calentar la sopa suavemente antes de servir, revolviendo constantemente. Cucharee en cuencos calientes.", "Rocíe la mezcla de crème fraîche en cada plato de sopa. Con cuidado, corta el tocino crujiente en trozos con unas tijeras de cocina y esparce encima. Espolvorear con el perejil, sazonar con un poco de pimienta negra recién molida y servir."], "url": "www_bbc_co_uk_food_recipes_celeriac_and_apple_soup_32322", "title": "Sopa de apio y manzana con tocino y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriac_and_apple_soup_32322_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Apioalergo de 650 g / 1 libra 7 oz, pelado y cortado en tiras finas (ver consejo)", "1 limón, solo jugo", "6 cucharadas de mayonesa light", "1 cucharada de mostaza Dijon", "½ limón, solo jugo", "una pizca de azúcar", "sal y pimienta negra recién molida"], "method": ["Coloque el apionabo en un recipiente y cúbralo con aproximadamente 100 ml / 3½ fl oz de agua fría. Agregue el jugo de limón. Mezcle bien para evitar que se ponga marrón.", "Mezcle todos los ingredientes del aderezo y sazone con sal y pimienta.", "Escurra el apionabo, mezcle el aderezo y deje que se ablande durante 30 minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_celeriac_remoulade_65265", "title": "Apiola de apio nabo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriac_remoulade_65265_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 apio nabo pequeño, pelado y luego cortado en tiras con un pelador de verduras", "1 limón, solo jugo", "40 g / 1½ oz de semillas de calabaza", "2 cucharadas de aceite de oliva virgen extra", "15g / ½ oz de mantequilla", "4 ramitas de tomillo, hojas retiradas", "2 dientes de ajo, finamente picados", "½ cucharadita de hojuelas de chile seco", "1 manojo de acelga, tallos en rodajas y hojas desmenuzadas", "20g / ¾oz de pecorino o queso vegetariano duro", "sal y pimienta negra recién molida"], "method": ["Exprime la mayor parte del jugo de limón en un tazón grande de agua fría y agrega las cintas de apio nabo.", "Freír las semillas de calabaza en una sartén a fuego medio hasta que se hinchen y exploten. Dejar de lado.", "Ponga a hervir una olla grande de agua con sal, agregue el apionabo y cocine durante 1 minuto. Drene y reserve el agua.", "Caliente el aceite y la mantequilla en una sartén antiadherente grande a fuego medio. Cuando la mantequilla se haya derretido, agrega el tomillo, el ajo y las hojuelas de chile y cocina durante 5 minutos hasta que estén fragantes y casi dorados.", "Agregue la acelga en la sartén y cocine por un par de minutos, sazone con sal y pimienta y un chorrito de jugo de limón. Suba el fuego y agregue la mitad del queso. Agregue el apionabo y un chorrito de agua de cocción y mezcle, agitando la sartén hasta que la salsa se vea brillante.", "Divida entre platos, cubra con más queso y sirva."], "url": "www_bbc_co_uk_food_recipes_celeriac_ribbons_with_50177", "title": "Cintas de apio con acelgas, ajo y semillas de calabaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cabeza de apionabo", "Vinagre de vino blanco 50ml / 2floz, más 1 cucharadita", "500g / 1lb 2oz winkles", "Stock de pollo 500ml / 18floz", "50g / 1¾oz de mantequilla", "1 trufa negra, finamente picada", "150 g / 5½ oz de mascarpone", "150 g / 5½ oz parmesano", "150ml / 5fl oz de caldo de pollo oscuro reducido", "1 pomelo, pelado y segmentado", "1 palo de apio, solo hojas"], "method": ["Lave y pele el apionabo, reservando la cáscara. Pica en tajadas 500g / 1lb 2oz de la carne y corta el resto en dados muy pequeños, aproximadamente del tamaño de los granos de arroz.", "Coloque la cáscara de apio nabo y 500 ml / 18 fl oz de agua en una olla, llevar a ebullición y cocine a fuego lento durante 30 minutos. Cuele a través de un tamiz fino y reserve el caldo.", "Ponga a hervir una olla de agua con sal, agregue el apionabo picado y cocine a fuego lento durante 10-12 minutos hasta que esté suave. Escurrir, luego colocar en un procesador de alimentos con 50 ml / 2 fl oz de vinagre de vino blanco. Mezclar hasta obtener un puré fino y pasar a través de un colador fino.", "Cocine los winkles en agua hirviendo con sal con la cucharadita de vinagre de vino blanco durante un minuto. Escurra los guijarros, luego retírelos del caparazón y retire el saco de residuos y el pie.", "Coloque los winkles en una cacerola y cubra con el caldo de pollo. Llevar a fuego lento y cocinar durante 45 minutos.", "Caliente una sartén antiadherente hasta que esté medio caliente, agregue la mantequilla y los dados de apio nabo y cocine suavemente durante un minuto. Agregue un poco del caldo de apio nabo a la vez, como si estuviera haciendo un risotto, y cuando el caldo se absorba, agregue un poco más, hasta que el apionabo esté solo tierno, esto debería tomar solo 5-6 minutos. Agregue la trufa y cocine por un minuto.", "Una vez cocido, agregue el mascarpone, parmesano y caldo de pollo oscuro reducido. Agregue los guiños y revuelva.", "Para servir, cuchara el puré de apio nabo en la base de un plato de sopa. Cucha el \"risotto\" por encima. Esparza los segmentos de pomelo y termine con una pequeña hoja de apio."], "url": "www_bbc_co_uk_food_recipes_celeriac_risotto_28472", "title": "Risotto de apio nabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ apionabo, pelado y rallado", "100ml / 3½ fl oz crema doble", "55g / 2oz de queso Stilton, desmenuzado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Caliente el aceite de oliva y la mantequilla juntos en una sartén y fríe con cuidado el apionabo durante 4-5 minutos, o hasta que comience a dorarse. Agregue la crema y el queso, luego transfiera a un plato gratinado para horno. Hornee en el horno durante 10-12 minutos, o hasta que estén doradas en la parte superior y burbujeando."], "url": "www_bbc_co_uk_food_recipes_celeriacandstiltongr_90746", "title": "Gratinado de Celeriac y Stilton", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla, más extra para engrasar", "2 cebollas, finamente cortadas", "1 apio nabo, cortado en rodajas gruesas de 0.5cm / ½ in", "Papas de 500 g / 1 libra y 1 onza, cortadas en rodajas gruesas de 0,5 cm / ½ pulg.", "600 ml / 1 litro de caldo de pollo caliente de 1 fl oz (los vegetarianos pueden sustituir el caldo de verduras)", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 450F / Gas 6.", "Caliente una sartén hasta que esté caliente y luego agregue la mitad de la mantequilla y todas las cebollas.", "Sudor durante 3-4 minutos hasta que se suavice.", "Coloque una capa de rebanadas de apio nabo en el fondo de un plato a prueba de horno con mantequilla.", "Cubra con una capa de cebollas, luego papas, luego cebollas de nuevo, sazonar con sal y pimienta negra recién molida sobre la marcha.", "Repita con el apio nabo, las cebollas y las papas restantes, y termine con una capa de papas.", "Punto con la mantequilla restante.", "Vierta sobre el caldo caliente para que todas las capas estén cubiertas.", "Transfiera al horno y cocine durante 45-60 minutos, verificando ocasionalmente para asegurarse de que el caldo no se haya evaporado por completo, y presionando las capas hacia abajo con el reverso de una cuchara.", "Hornee hasta que casi todo el caldo se haya absorbido y la capa superior esté dorada.", "Servir."], "url": "www_bbc_co_uk_food_recipes_celeriacandpotatobou_77525", "title": "Palangana de apio y patata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pequeño apio nabo, pelado y muy finamente cortado", "1 cucharada de aceite de oliva", "½ cucharadita de nuez moscada recién rallada", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "1 diente de ajo, finamente picado", "sal y pimienta negra recién molida", "Queso azul Shropshire 75 g / 2½ oz, desmenuzado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes excepto el queso en una olla grande y caliente hasta que la mezcla comience a hervir.", "Vierta la mezcla en un plato gratinado con mantequilla pequeño. Agregue el queso a la parte superior de la mezcla y hornee en el horno durante 15 minutos o hasta que burbujee, dorado en la parte superior y el apionabo es suave.", "Para servir, sáquelo del horno y espolvoréelo en un plato limpio."], "url": "www_bbc_co_uk_food_recipes_celeriacdauphinoise_84618", "title": "Cebolla dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 yemas de huevo", "2 cucharaditas de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "sal", "pimienta negra recién molida", "300ml / 10fl oz de aceite vegetal", "½ apionabo, pelado y rallado", "1 limón, solo jugo", "1 cucharada de mostaza Dijon", "puñado de perejil fresco de flatleaf, picado", "sal", "pimienta negra recién molida"], "method": ["Para hacer la mayonesa, coloque todos los ingredientes, excepto el aceite, en un procesador de alimentos y mezcle hasta que estén pálidos y cremosos.", "Con el motor en marcha, vierta suficiente aceite, en un flujo constante, hasta que la mayonesa esté espesa.", "Para Remoulade, coloque el apio nabo, el jugo de limón, la mostaza, el condimento y el perejil en un tazón grande.", "Mezcle bien y agregue la mayonesa hecha en casa. Sazone al gusto.", "Mezcle para combinar y servir."], "url": "www_bbc_co_uk_food_recipes_celeriacremouladewit_71405", "title": "Remoulade de apio nabo con mayonesa casera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pequeño apio nabo, cortado en tiras finas", "½ limón, solo jugo", "2 cucharadas de crema doble", "3 cucharadas de mayonesa de buena calidad", "2 cucharaditas de mostaza Dijon", "sal y pimienta blanca"], "method": ["Coloque las tiras de apio nabo en un tazón junto con el limón y el jugo y revuelva para combinar.", "Mezcle la crema doble, la mayonesa y la mostaza juntas y luego revuelva en el apio nabo.", "Sazonar con sal y pimienta blanca.", "Coloque en el refrigerador por un par de horas para que los sabores se desarrollen antes de servir."], "url": "www_bbc_co_uk_food_recipes_celeriacremoulade_77607", "title": "Apiola de apio nabo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celeriacremoulade_77607_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de oliva", "Harina simple de 450g / 1lb", "1 cucharadita de bicarbonato de soda", "1 cucharadita de sal", "400ml / 14fl oz (aprox) suero de leche", "pizca de sal marina Maldon", "30g / 1oz de mantequilla", "Cebollas de 110 g / 4 oz, finamente picadas", "Papas 140 g / 5 oz, finamente", "sal y pimienta negra recién molida", "425 g / 15 oz de apionabo, finamente cortado en cubitos", "1,2 litros / 2 pintas de caldo de pollo (los vegetarianos pueden sustituirlo con caldo de verduras o agua)", "170ml / 6fl de leche en oz", "Crema de 60 ml / 2 fl oz (opcional)", "perejil fresco de flatleaf, picado, para adornar", "Avellanas tostadas de 25 g / 1 oz, picadas para decorar"], "method": ["Precalentar el horno 230C / 450F / Gas 8. Cepillar generosamente una bandeja para hornear con aceite de oliva.", "Para el pan de soda, tamice la harina común y el bicarbonato de soda en un tazón grande. Agregue la sal y mezcle con sus manos. Haga un pozo en el centro de la mezcla de harina, vierta la mayor parte del suero de leche, y con una mano rígida y los dedos extendidos como una garra, comience a mezclar en un círculo completo una vez que la leche con mantequilla haya entrado.", "Sigue mezclando así hasta que tengas una masa suave. No lo amas sino que trabajalo muy suavemente para unirlo.", "Transfiera a una superficie enharinada, extiéndala a aproximadamente 35x20cm / 14x8 pulgadas y transfiérala a la bandeja engrasada.", "Cepille la parte superior de la masa con un poco más de aceite y espolvoree con un poco de sal marina. Transfiera al horno y cocine por diez minutos. Luego baje el horno a 200C / 400F / Gas 6 y cocine durante 8-12 minutos más hasta que esté cocido. Cuando está cocido, debe sentirse firme en el centro y dorado.", "Transfiera el pan de soda del horno a una rejilla de alambre y deje enfriar durante unos minutos, luego córtelo en cuadrados para servir.", "Mientras tanto, para la sopa, derrita la mantequilla en una cacerola pesada a fuego medio. Cuando espume, agregue las papas y las cebollas y mezcle en la mantequilla hasta que esté uniformemente cubierto. Sazonar con sal y pimienta recién molida.", "Cubra con un círculo de papel para hornear (para mantener el vapor) y la tapa de la olla, y pase un poco de calor durante unos diez minutos, hasta que los vegetales estén suaves pero no coloreados.", "Retire la tapa del papel. Agregue el apio y el caldo de pollo, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante 8-10 minutos, hasta que el apionabo esté suave.", "Licuar la sopa con una batidora, agregar un poco más de caldo, leche (o crema) para adelgazar hasta la consistencia requerida. Sazone al gusto con sal y pimienta negra recién molida.", "Sirva la sopa caliente en un bol con una dispersión de avellanas picadas, y un poco de perejil picado para adornar, acompañado de rebanadas de pan de soda."], "url": "www_bbc_co_uk_food_recipes_celeriacroasthazelnu_78846", "title": "Sopa de apio y avellana asada con pan de soda", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 bombilla pequeña de hinojo, en rodajas finas", "1 cebolla, finamente rebanada", "2 palitos de apio, en rodajas", "2 tomates maduros firmes, descuartizados", "2 limones pequeños, ralladura y jugo", "2 cucharadas de eneldo fresco picado", "2 cucharadas de alcaparras (opcional)", "4 filetes de trucha de 175 g / 6 onzas, huesos de alfiler retirados", "8 cucharadas de vino blanco", "500g / 1lb 2oz de patatas nuevas", "400g / 14oz de judías verdes, recortadas", "75g / 2½oz de mantequilla sin sal", "sal marina y pimienta negra recién molida"], "method": ["Para la trucha, precaliente el horno a 180C / 200C Marca de ventilador / gas 6. Para cada pieza de pescado, prepare un paquete cortando un cuadrado de papel de cocina de 35cm / 14 pulgadas. Encima de esto pon un cuadrado de pergamino para hornear del mismo tamaño.", "Ponga el hinojo, la cebolla, el apio, el tomate, la ralladura de limón y el jugo, el eneldo, las alcaparras y la mitad del aceite de oliva en un bol y mezcle. Condimentar con sal y pimienta.", "Divida la mezcla de hinojo entre los cuadrados de papel pergamino y coloque un filete de trucha en la parte superior de cada montón. Rocíe el resto del aceite de oliva, luego agregue un chorrito de jugo de limón a cada uno.", "Dobla la lámina y el papel de pergamino sobre los filetes de trucha y doble el doble de cada borde para hacer un paquete sellado, dejando un espacio en la parte superior. Vierta 2 cucharadas de vino blanco en cada paquete, luego selle completamente. El paquete no debe ser demasiado apretado, ya que el vapor lo hinchará en el horno.", "Coloque las parcelas en una bandeja grande para hornear y hornee durante 20 minutos, o hasta que el pescado esté completamente opaco y cocido.", "Ponga un cocedor sobre una olla en la cocina y agregue las papas. Después de 15 minutos agregue las judías verdes. Sream por otros 5 minutos y luego drenar. Agregue la mantequilla y sazone con sal y pimienta.", "Sirve los paquetes en platos calientes para que se puedan abrir en la mesa. Haga que los frijoles al vapor y las papas en tazones se entreguen por separado."], "url": "www_bbc_co_uk_food_recipes_celery_trout_en_54422", "title": "Trucha de apio en papel de aluminio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ tallo de apio, picado", "½ manzana, picada", "2 dientes de ajo picados", "150ml / 5¼ fl oz de caldo de verduras calientes", "50ml / 1¾ fl oz leche", "Crema doble de 75 ml / 2½ fl oz", "sal y pimienta negra recién molida", "1 cucharada de nueces picadas", "rociar aceite de oliva"], "method": ["Para la sopa, caliente el aceite de oliva en una olla pequeña y agregue el apio, la manzana y el ajo y cocine durante tres minutos.", "Agregue el caldo de verduras calientes, la leche, la crema y la sal y la pimienta negra recién molida a la sartén, cubra con una tapa y cocine por tres minutos.", "Vierta la mezcla en una licuadora y blitz hasta que quede suave.", "Vierta la sopa en un recipiente y decore con nueces picadas y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_celeryandapplesoup_85782", "title": "Sopa de apio y manzana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 apio de cabeza", "6 chalotes, pelados (y partidos si los bulbos se están dividiendo)", "1 o 2 ramitas de tomillo", "1 ramita de romero", "4 hojas sabias", "3 rebanadas de panceta o tocino rayado ahumado", "3 cucharadas de aceite de oliva ligero", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 240C / 475F / Gas 9.", "Comience quitando las duras capas externas del apio, luego corte la parte externa de la raíz, pero déjela unida. Ahora corte el apio a unos 9 cm / 3½ pulgadas de la base. Coloque la mitad inferior en posición vertical y corte verticalmente a través del centro. Luego, corte cada mitad en 4 para hacer 8 piezas, manteniéndolas unidas a la raíz. Guarde un par de hojas bonitas (preferiblemente unidas a un tallo pequeño) y corte las piezas superiores de apio de una longitud similar a la base, cortando los bordes realmente duros y fibrosos. Ahora lava todas las piezas y sécalas en papel de cocina.", "Luego caliente una cucharada de aceite en una sartén, luego dore ligeramente el apio y los chalotes, manteniéndolos en movimiento para que se doren uniformemente. Ahora transfiéralos a un plato. Aumente el calor debajo de la sartén, agregue la panceta y fríe las rebanadas hasta que estén realmente crujientes: llevará de 2 a 3 minutos y deberá seguir volteándolas.", "A continuación, coloque el papel de silicona sobre la bandeja de hornear y engrase ligeramente un círculo de 23 cm. Coloque el apio en una forma atractiva sobre el papel, ponga las piezas más bonitas en la parte superior, agregue las hojas de chalote, tomillo, romero y salvia, y sazone con sal y pimienta.", "Ahora combina el aceite de oliva restante y el vinagre de vino, espolvoréalos sobre las verduras, y luego la panceta se desmenuce en pedazos con las manos. A continuación doble el papel de silicona y selle, haciendo pliegues, por todos lados; puede encontrar un par de clips de papel de metal (no de plástico) útiles aquí, ya que es esencial para mantener el vapor atrapado en su interior. Coloque el paquete en el horno precalentado durante 20-25 minutos.", "Después de eso, desenvuelva cuidadosamente el papel, es posible que necesite tijeras, y sirva las verduras con los jugos puestos una cucharada."], "url": "www_bbc_co_uk_food_recipes_celerybakedinvinaigr_67190", "title": "Apio al horno en vinagreta con panceta y chalotas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celerybakedinvinaigr_67190_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / ½ pinta de caldo de pollo", "2 dientes de ajo", "1 corazón de apio, extremos eliminados y reservados", "1 filete de cerdo, machacado con un mazo hasta que quede delgado", "1 cucharada de aceite de oliva", "el apio termina del corazón, picado", "½ cebolla, picada", "½ cucharadita de orégano seco", "½ cucharadita de pimentón dulce", "100 ml / 3½ fl oz de caldo de pollo", "3 dientes de ajo picados", "4 albaricoques secos, cortados en cubitos", "2 cucharadas de perejil picado", "20 g / oz de mantequilla", "Harina normal de 20g / ¾oz", "½ cucharadita de mostaza en polvo", "300ml / ½pt de leche", "100 g / 4 oz de queso ahumado, cortado en cubitos", "cebollino pequeño, finamente picado"], "method": ["Para el corazón de apio, hierva el caldo de pollo y agregue los dientes de ajo enteros. Reducir a fuego lento.", "Envuelva el cerdo alrededor del corazón de apio y asegúrelo con un palito de cóctel. Agregue al caldo y cocine por diez minutos, o hasta que esté cocido. Retire el corazón de apio envuelto en cerdo del caldo y déjelo a un lado.", "Para el apio picante, caliente el aceite en una sartén y saltee todos los ingredientes, a excepción del albaricoque y el perejil, durante cinco minutos.", "Agregue los albaricoques y el perejil y revuelva para combinar.", "Para la salsa de queso, derrita la mantequilla en una sartén pequeña. Agregue la harina y el polvo de mostaza, batiendo durante un minuto para hacer un roux.", "Poco a poco agregue la leche, batiendo todo el tiempo.", "Llevar la mezcla a ebullición y agregar el queso ahumado, revolviendo bien, hasta que todo se haya derretido.", "Agregue las cebolletas y revuelva.", "Para servir, coloque una cama de apio picante en un plato, cubra con el corazón de apio envuelto en carne de cerdo y una cuchara sobre la salsa de queso ahumado."], "url": "www_bbc_co_uk_food_recipes_celeryheartwrappedin_78746", "title": "Corazón de apio envuelto en carne de cerdo sobre apio picante con salsa de queso ahumado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, picado", "½ cebolla roja picada", "150g / 5½oz de apio, picado", "200ml / 7fl oz de caldo de pollo caliente", "2 rebanadas de pan ciabatta tostado, para servir"], "method": ["Caliente el aceite en una cacerola y cocine el ajo, la cebolla y el apio a fuego lento durante cinco minutos, hasta que se ablanden.", "Agregue el caldo de pollo y cocine a fuego lento durante 10-12 minutos.", "Transfiera la sopa a una licuadora y licúe.", "Para servir, coloque la sopa en un tazón con la chapata tostada al lado."], "url": "www_bbc_co_uk_food_recipes_celerysoup_85016", "title": "Sopa de apio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celerysoup_85016_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz '00' harina de pasta, más extra para quitar el polvo", "2 huevos de gallinas camperas", "2 cucharadas de aceite de oliva", "250 g / 9 oz de champiñones frescos, cortados, enjuagados y finamente cortados en rodajas", "sal marina y pimienta negra recién molida", "1 chalote de plátano, pelado, finamente picado", "2 dientes de ajo, pelados, finamente picados", "3 hojas grandes de salvia fresca", "¼ limón, solo jugo", "1 huevo de gallinas camperas, golpeado", "10g / ½ oz de piñones", "10 avellanas", "40 g / 1½ oz de mantequilla sin sal", "8 hojas de salvia fresca, finamente picadas", "50 ml / 2 fl oz de agua", "½ limón, solo jugo"], "method": ["Para la pasta, coloque la harina en un procesador de alimentos, agriete los huevos y pulse para combinar. Agregue un poco de agua, si es necesario, para hacer que la masa se junte (la masa se juntará cuando frote una pieza entre los dedos).", "Convierta la masa en una superficie de trabajo enharinada y amasar ligeramente durante 2-3 minutos, o hasta que quede suave y elástica. Aplanar la masa y enrollarla a un grosor de 1 cm / ½ pulgadas. Envuelva la masa en papel film y déjelo reposar en la nevera durante 30 minutos para que se relaje.", "Retire la película adhesiva y corte la masa de pasta en 2 piezas iguales. Aplanar cada pieza ligeramente con un rodillo de la misma anchura que su máquina de pasta.", "Pase la masa a través de la máquina de pasta, comenzando con la configuración más espesa, luego doble los extremos de la pasta en el centro, como una carta comercial. Gire 90 grados y pase la pasta por la configuración más espesa una vez más. Cambia la configuración de la máquina de pasta al siguiente espesamiento y vuelve a pasar la masa. Repita la operación de rodadura, pasando la hoja a través de cada ajuste hasta llegar a la configuración más delgada. Corte cada hoja de pasta en 3 (la masa debe producir suficiente pasta para aproximadamente seis hojas que midan 35 cm x 10 cm / 14 pulgadas x 4 pulgadas).", "Coloque las hojas de pasta en una bandeja, separadas por capas de película adhesiva, y manténgalas en la nevera hasta que estén listas para usar.", "Para el relleno, caliente el aceite de oliva en una sartén grande a fuego alto y fría los ceps con una pizca de sal marina y pimienta negra recién molida durante 2-3 minutos, hasta que estén tiernos. Si no puede encontrar ceps frescos, puede usar botones o setas de campo. O podría usar algunos ceps secos de buena calidad, empapados de antemano.", "Agregue los chalotes y cocine durante 1-2 minutos. Agregue el ajo, luego mezcle los ceps y chalotes juntos y cocine durante 1-2 minutos, o hasta que los chalotes se ablanden. Agregue el jugo de limón y mezcle bien. Retirar del fuego y verter en un plato para que se enfríe un poco, luego enfriar en la nevera hasta que esté frío.", "Tome una hoja de pasta y coloque 4 cucharaditas grandes del relleno a lo largo del medio, asegurándose de que los montículos de relleno estén espaciados uniformemente. Ligeramente cepille la pasta alrededor del relleno con huevo lavado. Doble el borde superior de la hoja sobre el relleno para que coincida con el borde inferior de la hoja, luego presione alrededor del relleno con los dedos para sellar (asegúrese de que no haya burbujas de aire en la pasta). Repita con las hojas restantes de pasta y el relleno.", "Recorte los tortellini, usando un cortador de tamaño mediano para sellar una forma de media luna. Presione el centro hacia abajo ligeramente, luego junte las esquinas inferiores de la media luna para formar un círculo. Pellizca los extremos para sellar. Coloque los tortellini preparados en un plato ligeramente enharinado hasta que estén listos para cocinar.", "Precalentar el horno a 170C / 340F / Gas 3.", "Para las nueces tostadas y la mantequilla de salvia, esparza los piñones y las avellanas en una bandeja para hornear y tueste en el horno durante aproximadamente 10 minutos, o hasta que las nueces estén doradas. Retire y reserve para enfriar.", "Cocine los tortellini, en tandas, en una sartén de agua hirviendo con sal durante 2-3 minutos, o hasta que estén al dente. Retirar con una cuchara ranurada y transferir a platos calientes.", "Mientras tanto, caliente la mantequilla en una sartén a fuego medio hasta que se derrita y tenga un color marrón avellana (tenga cuidado de no dejar que la mantequilla se oscurezca más allá del marrón oscuro). Agregue la salvia y cocine durante 5 segundos, luego vierta el agua y un chorrito de jugo de limón y cocine por 1-2 minutos.", "Para servir, vierta la mantequilla de salvia sobre los tortellini y espolvoree sobre los piñones tostados y las avellanas."], "url": "www_bbc_co_uk_food_recipes_cepstortelliniwithro_93488", "title": "Tortellini Ceps con nueces tostadas y mantequilla de salvia", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cepstortelliniwithro_93488_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de atún fresco, finamente cortado", "1 lima, solo jugo", "1 cucharadita de aceite vegetal", "1 cucharada de salsa de soja", "sal y pimienta negra recién molida", "2 cucharadas de pimiento naranja, cortadas en cubitos", "1 cuña de lima", "½ limón, jugo", "½ cucharadita de salsa Tabasco", "1 cucharada de aceite de oliva", "½ cebolla roja, finamente rebanada", "100 g / 3½ oz de espinaca", "1 naranja, segmentado", "500ml / 18fl oz de aceite vegetal", "1 patata grande para hornear, picada en rodajas, piel dejada en", "sal y pimienta negra recién molida, al gusto"], "method": ["Para hacer el atún, mezcle el aceite, el jugo de lima y la soja en un tazón pequeño.", "Coloque las rebanadas de atún crudo planas alrededor de un plato. Rocíe el adobo y sazone bien con sal y pimienta negra recién molida.", "Espolvorea sobre el pimiento naranja en cubitos.", "Adorne con la cuña de lima", "Para hacer la ensalada, mezcle el jugo de limón, el aceite de oliva, la salsa de Tabasco y la cebolla roja en un tazón grande.", "Agregue la espinaca, mezcle y sazone al gusto.", "Transfiera a un plato y espolvoree con la naranja segmentada.", "Para hacer las virutas, caliente el aceite en una olla de fondo grueso (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Verifique que el aceite haya alcanzado la temperatura correcta dejando caer una migaja de pan en el aceite. Debería chisporrotear y dorarse en 20 segundos.", "Freír las papas hasta que estén doradas y crujientes. Retire y coloque sobre papel de cocina absorbente.", "Espolvorea con sal, al gusto y colócalo en un bol.", "Servir caliente con el ceviche y la ensalada."], "url": "www_bbc_co_uk_food_recipes_cervichetunawithlime_78025", "title": "Ceviche de atún con lima y chile con ensalada de espinacas y patatas fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 filete de lubina, con piel", "1 lima, ralladura y jugo", "½ cucharadita de azúcar en polvo", "1 cucharada de aceite vegetal", "sal y pimienta negra recién molida"], "method": ["Cortar el filete de lubina finamente en la diagonal con un cuchillo muy filoso.", "Extienda las rodajas de bajo en un plato y espolvoree la ralladura de lima y el jugo, el azúcar y el aceite vegetal. Sazonar, al gusto, con sal y pimienta negra recién molida. Déjelo marinar en un lugar fresco por unos 15 minutos, pero no lo deje más tiempo o la carne de pescado comenzará a descomponerse. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cevicheofseabass_88623", "title": "Ceviche de lubina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]