[{"ingredients": ["640g / 1lb 7oz de patatas harinas, preferiblemente Maris Piper, peladas y en rodajas finas", "2 pimientos rojos, en rodajas", "2 hojas de laurel", "2 dientes de ajo, finamente picados", "2 cucharadas de aceite de oliva", "½ cucharadita de copos de sal marina", "4 x 120 g / 4 oz de filetes de bacalao, sin piel y sin espinas", "pimienta negra recién molida", "½ diente de ajo", "25 g / 1 oz de piñones", "50 g / 1¾oz de hojas frescas de albahaca", "5 cucharadas de aceite de oliva", "25 g / 1 oz de queso parmesano, finamente rallado", "1 cucharada de jugo de limón", "½ cucharadita de copos de sal marina"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Mezcle las papas, pimientos, laurel, ajo, aceite, sal y una buena pizca de pimienta negra en una lata grande para asar. Cubra bien con papel de cocina y hornee durante 1 hora.", "Mientras tanto, para hacer el pesto, mezcle el ajo y los piñones en un procesador de alimentos. Agregue la albahaca y el pulso hasta que estén picados. Con el motor todavía en funcionamiento, agregue el aceite y mezcle brevemente. Agregue el parmesano, el jugo de limón y la sal.", "Coloque el bacalao encima de las verduras y distribuya cada filete con un cuarto del pesto. Hornee, destapado, durante 15 minutos o hasta que el pescado esté bien cocido. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_cod_with_pesto_roast_14470", "title": "Bacalao con pesto, patatas asadas y pimientos traybake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cod_with_pesto_roast_14470_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, pelada y picada", "½ chile rojo o verde, finamente picado", "Cubitos de panceta de 140 g / 5oz o tocino rayado, picados", "Guisantes congelados de 200g / 7oz, descongelados", "Papas de 500g / 1lb y 2oz, peladas y cortadas en chips", "1 litro / 1¾ pintas de aceite vegetal, para freír", "1 ramita de romero fresco, hojas solo, picadas", "sal al gusto", "100g / 3½ oz de harina de auto crianza", "100 g / 3½ oz de harina de maíz", "1 cucharadita de polvo chino de cinco especias", "1 cucharadita de sal, más extra para el gusto", "175-200ml / 6¼-7¼fl oz de agua de soda", "2 x 175 g / 5 oz de bacalao o filetes hoki", "cuñas de limón, para servir"], "method": ["Para los guisantes, caliente el aceite en una sartén a fuego medio y fría la cebolla durante 1-2 minutos. Agregue la guindilla y revuelva bien.", "Agregue la panceta o tocino y cocine durante 8-10 minutos hasta que estén dorados y crujientes.", "Agregue los guisantes a la sartén, agite bien la sartén y cocine durante 2-3 minutos más.", "Para las patatas fritas, coloque el aceite vegetal en una olla profunda de base pesada y caliente hasta que un pequeño cubo de pan chisporrotee y se dore cuando se le caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Coloque cuidadosamente las papas en el aceite caliente. Cocine durante unos diez minutos, hasta que estén dorados y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Espolvorear con el romero y un poco de sal.", "Para el pescado, tamice la harina, la harina de maíz, el polvo de cinco especias y la sal en un tazón y revuelva.", "Poco a poco vierta el agua de soda, batiendo continuamente, para hacer una mezcla suave la consistencia de doble crema espesa.", "Usando pinzas, sumerja los filetes de pescado en la mezcla para cubrir completamente, sacudiendo cualquier exceso.", "Coloque el pescado en el aceite caliente en el que se cocinaron las papas fritas. Cocine durante 4-5 minutos, volteándolo cuidadosamente de vez en cuando.", "Cuando esté dorado y crujiente, retire el pescado del aceite con una espumadera y escurra sobre papel de cocina. Espolvorea con sal, al gusto.", "Para servir, coloque el pescado en platos con las virutas, los guisantes y las rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_codandchipswithpeas_86983", "title": "Bacalao y patatas con guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de cebada 200 g / 7 oz", "Filete de bacalao 225g / 8oz, sin piel y sin espinas", "sal y pimienta negra recién molida", "5 cucharadas de aceite de oliva", "Chorizo ​​para cocinar 200 g / 7 oz, más o menos picado", "½ cucharadita de pimentón picante ahumado", "90g / 3½oz de pimientos rojos asados ​​(de un frasco) cortados en tiras", "3 cucharadas de perejil de flatleaf fresco picado", "½ limón, solo jugo"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Ponga a hervir una olla grande de agua con sal, agregue el orzo y cocine durante 10-12 minutos, o hasta que esté tierno. Drene el orzo y reserve.", "Sazonar el bacalao con sal y pimienta negra recién molida. Calentar una sartén a prueba de horno hasta que se fume, agregar una cucharada de aceite de oliva y freír el bacalao durante 1-2 minutos en ambos lados, o hasta que se dore por todas partes. Transfiera al horno para cocinar por 3-4 minutos, o hasta que el pescado esté bien cocido.", "Retire el pescado de la sartén y vierta la carne en un plato.", "Calentar una sartén hasta que esté caliente, agregar el aceite de oliva restante y el chorizo ​​y freír durante 2-3 minutos, o hasta que el chorizo ​​esté cocido y los aceites se liberen en la sartén. Con una cuchara ranurada, retire el chorizo ​​de la sartén y déjelo a un lado.", "Agregue el orzo cocido y el pimentón dulce ahumado a la sartén, mezcle bien para cubrir con aceite y cocine durante 1-2 minutos. Regrese el chorizo ​​a la sartén y agregue los pimientos rojos asados ​​y el bacalao en copos. Mezcle bien para combinar y sazone con sal y pimienta negra recién molida. Agregue el perejil y el jugo de limón.", "Para servir, cuchara en platos para servir."], "url": "www_bbc_co_uk_food_recipes_codandchorizoorzo_90791", "title": "Bacalao y chorizo ​​orzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 piezas de filete de bacalao, aproximadamente 150-200g / 5¼-7oz", "Tapenade de aceituna negra 100 g / 3½ oz", "1 cucharada de aceite de oliva", "2 hojas de laurel", "Ramita de tomillo", "125g / 4oz de chorizo, en rodajas finas", "algunas hojas de albahaca", "1 cucharada de aceite de albahaca", "Berenjena 50g / 2oz cortada por la mitad", "1 cucharada de aceite de oliva", "2 chalotes de plátano bebé, escaldados y cortados por la mitad", "puñado de aceitunas negras", "½ limón, solo jugo", "sal y pimienta blanca agrietada", "2 bebé hinojo, blanqueado", "16-20 tomates cherry", "250ml / 8¾oz de jugo de tomate"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Haga un corte en el costado de cada filete de bacalao, y deslice el cuchillo alrededor para crear un pequeño bolsillo.", "Extiende la tapenade adentro.", "Caliente una sartén grande a prueba de horno hasta que esté caliente y luego agregue el aceite de oliva.", "Agregue las hojas de laurel, el tomillo, el chorizo ​​y el bacalao con la piel hacia abajo y fríalos durante dos minutos.", "Dé la vuelta al pescado para que quede con la piel hacia arriba y luego coloque la sartén en el horno durante unos cinco minutos o hasta que la piel esté dorada y la carne recién cocida.", "Para el acompañamiento de hinojo, coloque la berenjena en una bandeja en el horno durante 10-12 minutos.", "Retire y deje que se enfríe un poco antes de quitar la piel y cortar en trozos.", "Calentar una sartén hasta que esté caliente y luego agregar el aceite de oliva.", "Agregue los chalotes y la berenjena y cocine por un par de minutos.", "Sazonar con sal y pimienta blanca cuarteada.", "Agregue el bebé hinojo, aceitunas, tomates y jugo de limón y cocine por otros dos minutos.", "Sirve con el bacalao. Servido adornado con hojas de albahaca y rociado con aceite de albahaca.", "Para el jugo de tomate, coloque el jugo en una olla pequeña y déjelo hervir suavemente.", "Sirva rociado alrededor del plato con el bacalao y el chorizo"], "url": "www_bbc_co_uk_food_recipes_codandchorizo_79585", "title": "Bacalao y chorizo ​​con hinojo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10½fl oz de leche entera", "½ cebolla, pelada, finamente rebanada", "pizca de nuez moscada recién rallada", "1 hoja de laurel fresca", "4 granos de pimienta blancos enteros", "35 g / 1½ oz de mantequilla", "25 g / 1 oz de harina", "3 cucharadas de hojas de perejil fresco picado", "sal y pimienta negra recién molida", "200g / 7oz de papas nuevas, cocidas hasta que estén tiernas, escurridas", "Apioagudo 200g / 7oz, pelado y cortado en cubos, cocido hasta que esté tierno, escurrido", "75g / 3oz de mantequilla", "1 cucharada de crema doble", "sal y pimienta negra recién molida", "50g / 1¾oz de harina", "sal y pimienta negra recién molida", "4 x 175 g / 6oz de filetes de bacalao", "1-2 cucharadas de aceite vegetal", "75g / 3oz de mantequilla", "1 limón, solo jugo, más rodajas de limón extra, para servir"], "method": ["Para la salsa de perejil, lentamente lleve la leche, la cebolla, la nuez moscada, la hoja de laurel y los granos de pimienta blanca a fuego lento en una sartén. Retire la sartén del fuego y déjela enfriar durante 8-10 minutos.", "Mientras tanto, derretir 25 g / 1 oz de la mantequilla en una sartén de base pesada. Batir la harina para crear una pasta suave (esto se conoce como roux), luego cocinar, batir continuamente, durante un minuto, o hasta que la pasta se espese. Retire la sartén del fuego.", "Cuele la mezcla de leche en la mezcla Roux, luego batir bien hasta que esté completamente incorporado.", "Regrese la sartén al fuego y gradualmente lleve la mezcla a ebullición, batiendo continuamente, hasta que la salsa se haya espesado lo suficiente como para cubrir la parte posterior de la cuchara.", "Agregue los 10 g / ½ oz restantes de mantequilla hasta que la salsa esté brillante, luego cocine a fuego lento durante 2-3 minutos. Agregue el perejil y sazone, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el puré, triture las papas cocidas y los cubos de apio en una sartén con la mantequilla y la crema hasta que estén suaves y bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para el bacalao, espolvorear la harina en un plato y sazonar, al gusto, con sal y pimienta negra recién molida. Dragar los filetes de bacalao con la harina sazonada hasta que estén completamente cubiertos.", "Calentar el aceite en una sartén a fuego medio. Cuando el aceite esté caliente, agregue los filetes de bacalao recubiertos y fría por 2-3 minutos en cada lado, o hasta que estén crujientes y dorados por ambos lados y cocidos. (NB: El bacalao se cuece cuando la carne es opaca).", "Cuando el bacalao esté casi cocido, salpique los filetes de bacalao con la mantequilla y luego apriete el limón. Cuando la mantequilla se haya derretido, retire la sartén del fuego.", "Para servir, vierta una porción del puré en el centro de cada una de las cuatro placas para servir. Coloque un filete de bacalao frito encima de cada porción. Rocíe los jugos de la sartén y vierta sobre la salsa de perejil. Adorne cada plato con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_codwithparsleysauce_92631", "title": "Bacalao con salsa de perejil y puré", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz Klippfisk (bacalao) que se ha empapado durante 24 horas", "1,8 litros / 3¼ pintas de agua hirviendo", "1 ramita de romero mediana", "15 semillas de mostaza", "5 pimienta de Jamaica", "5 granos de pimienta blanca", "5 dientes", "1 diente de ajo, finamente picado", "1 puerro pequeño, finamente triturado", "1 cebolla, en rodajas", "3 zanahorias, ralladas o en rodajas", "100 g de mantequilla", "700ml / 1¼ pintas de leche", "700ml / 1¼ pintas de crema agria", "ramitas de romero, para adornar"], "method": ["Agregue todos los ingredientes en una sartén y deje hervir a fuego lento durante 20 minutos.", "Cepa, reservando la carne de pescado, las zanahorias, las cebollas y el ajo pero desechando todo lo demás.", "Desmenuce el pescado reservado en trozos pequeños. Divida en porciones de aproximadamente 50 gramos por persona, y manténgase separado.", "Agregue los ingredientes restantes de la sopa (mantequilla, leche y crema agria) y cocine a fuego lento durante 20 minutos. Si sientes que la sopa es demasiado fina, puedes espesarla con harina de maíz pero esto generalmente no es necesario.", "Cuando el caldo sea lo suficientemente grueso, agregue las zanahorias, cebollas y ajo reservados.", "Para servir, divida el caldo entre los tazones, agregue una porción de klippfisk desmenuzado a cada tazón y decore con una ramita de romero.", "Sirve con pan"], "url": "www_bbc_co_uk_food_recipes_codfish_klipfisk_soup_18817", "title": "Bacalao (pescado cortado)", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 6 - 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/codfish_klipfisk_soup_18817_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 huevos de gallinas camperas", "Azúcar en polvo 350g / 12oz", "Harina normal de 250g / 9oz", "100 g / 3½ oz de cacao en polvo", "85g / 3oz de mantequilla, derretida, más extra para engrasar", "400 ml / 14 fl oz crema doble", "5 cucharadas de café fuerte y frío", "3 cucharadas de azúcar glas, tamizado", "Mascarpone 250 g / 9 oz, ablandada", "250g / 9oz de mascarpone", "Puré de castañas edulcorado 225g / 8oz", "300 ml / 10 fl oz doble crema", "6-8 cucharadas de aguardiente", "4-6 nidos de merengue grandes, desmenuzados", "225 g / 8 oz de azúcar en polvo", "100 ml / 3½ fl oz de agua", "4 huevos de gallinas camperas, solo para blancos", "acebo, adornar"], "method": ["Para la torta de chocolate, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme ligeramente la base de una lata de torta suelta de 25 cm / 10 pulg.", "Batir los huevos y el azúcar juntos en un tazón de 4 a 5 minutos o hasta que estén espesos y pálidos.", "Tamiza la harina y el polvo de cacao en un recipiente aparte y dóblalos suavemente en la mezcla de huevo y azúcar hasta que se combinen y revuelva la mantequilla derretida.", "Vierta la mezcla en la lata de la torta, ligeramente alisado sobre la parte superior. Coloque la lata en una bandeja para hornear y hornee en el horno durante 35 minutos, o hasta que la torta se haya levantado y esté floja al tacto. Retire del horno, deje que se enfríe brevemente y luego colóquelo en una rejilla para que se enfríe completamente.", "Para la mousse de café, coloque la crema, el café y el azúcar glas en un bol y mezcle con los picos suaves.", "Batir el mascarpone en un bol hasta que esté muy suave y luego doblar la mezcla de crema en el mascarpone hasta que se combinen.", "Para la mousse de castañas, coloque el mascarpone y el puré de castañas en un procesador pequeño y mezcle hasta que quede suave.", "Batir la crema doble hasta que se formen picos suaves y luego doblar la mezcla de castañas hasta que se combinen.", "Para el merengue italiano, coloque el azúcar y el agua en una sartén y lentamente hierva hasta que el almíbar alcance los 110 ° C / 230 ° F en un termómetro de azúcar.", "En esta etapa, bata las claras de huevo en el tazón de un mezclador eléctrico hasta que se formen picos firmes cuando se quite el batidor.", "Continúe calentando el jarabe de azúcar y tan pronto como alcance 121C / 250F retire la sartén del fuego.", "Inmediatamente continúe batiendo las claras de huevo con el batidor a su velocidad más baja y luego vierta el jarabe de azúcar en un flujo constante. (PRECAUCIÓN: asegúrese de que el almíbar esté limpio de los batidores para evitar que se salpique en sus manos).", "Continúe latiendo durante unos cinco minutos o hasta que el merengue esté tibia.", "Para ensamblar, corte la torta de chocolate horizontalmente en cinco pedazos, colocando la pieza inferior en el plato de servir.", "Con una cuchara, espolvoree 1 o 2 cucharadas de brandy, luego distribuya la mitad del mousse de café y luego esparza más de una cuarta parte de los nidos de merengue desmenuzados.", "Coloque otra pieza de esponja en la parte superior, espolvoree con otro brandy de 1-2 cucharadas y luego unte con la mitad de la mousse de castaña otro cuarto del merengue.", "Repita estas capas, terminando con una capa de esponja.", "Extiende el merengue italiano por los lados y la parte superior de la pila de esponjas, horneando el merengue para hacer pequeños picos.", "Con un soplete, glasear el merengue hasta que quede dorado y adornar con holly."], "url": "www_bbc_co_uk_food_recipes_coffee_and_chestnut_29340", "title": "Pastel de merengue de café y castaña", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Margarina 100 g / 3½ oz", "100 g / 3½ oz de azúcar en polvo", "2 huevos de gallinas camperas", "100g / 3½ oz de harina de auto crianza", "½ cucharadita de polvo de hornear", "50 g / 1¾oz de almendras molidas", "algunas gotas de extracto de vainilla", "3 cucharaditas de leche", "1½ cucharadita de café instantáneo en polvo", "25g / 1oz de nueces sin cáscara, picadas", "100g / 3½oz de azúcar glasé", "40 g / 1½ oz de mantequilla, ablandada", "½ cucharadita de café instantáneo en polvo", "1½ cucharadita de leche", "Mazapán blanco de 225g / 8oz", "5 piezas pequeñas de nogal"], "method": ["Para la torta, precaliente el horno a 170 ° C / 325 ° F / Gas 3. Engrase el fondo y los lados de una lata cuadrada de pastel de 20 cm / 8 pulgadas.", "Recorte un trozo de papel resistente a la grasa que sea de 7,5 cm / 3 pulgadas más largo que la longitud de la lata. Dobla el papel por la mitad a lo ancho. Abra el papel y empuje hacia arriba el pliegue central para hacer un pliegue de 4 cm / 1½ pulgadas. Alinee la base de la lata con esto, haciendo cualquier ajuste para asegurar que el pliegue discurra por el centro de la lata, haciendo en efecto dos \"latas\" rectangulares dentro de la lata.", "Batir la margarina, el azúcar, los huevos, la harina, el polvo de hornear y las almendras molidas en un tazón grande durante unos 2-3 minutos, o hasta que queden lisos, un poco más claros y de aspecto brillante. (Si coloca un paño húmedo debajo del tazón, evita que se mueva).", "Vierta un poco más de la mitad de la mezcla en un recipiente aparte y agregue el extracto de vainilla y 1½ cucharadita de leche. Dejar de lado.", "Mezcle el café con las 1½ cucharaditas restantes de leche, revuelva hasta que se disuelva (no necesita calentar la leche), luego revuelva en el otro tazón de mezcla junto con las nueces picadas. Coloque la mezcla de vainilla en la mitad de la lata y la mezcla de café y nuez en la otra mitad. Nivele la superficie de cada mitad con un cuchillo. Verifique que el divisor de papel esté recto y en el medio.", "Hornee en el horno durante 35-40 minutos o hasta que el pastel esté bien levantado, elástico al tacto y se haya encogido ligeramente desde los lados de la lata. Deje enfriar en la lata durante unos minutos, luego afloje la torta de los lados con un cuchillo de hoja redonda, apáguela, retire el papel protector y termine de enfriar en una rejilla de alambre.", "Para el glaseado de mantequilla, tamiza el azúcar glas en un tazón mediano. Agrega la mantequilla. Mezcle el café y la leche hasta que el café se haya disuelto y vierta en el bol. Batir todo junto con una cuchara de madera hasta que esté suave y lisa. Dejar de lado.", "Recorte los bordes crujientes de la torta enfriada con un cuchillo de sierra, luego corte y recorte si es necesario en 4 tiras iguales. Coloque una vainilla y una tira de café y nuez una al lado de la otra, luego use un poco del glaseado de mantequilla para unirlas. Extender un poco más de hielo en la parte superior. Pega las dos tiras restantes con glaseado y colócalas encima para crear un efecto de tablero de damas.", "Extienda un poco más de glaseado sobre la parte superior de la torta ensamblada.", "Corta dos trozos de hilo, uno que tenga la longitud del pastel ensamblado y otro que lo envuelva todo.", "Haga rodar el mazapán, en una superficie de trabajo ligeramente espolvoreada con azúcar glas tamizada, en forma oblonga a lo largo del pastel y lo suficientemente ancho como para envolver el pastel, utilizando los trozos de cuerda como su guía de medición.", "Coloque el lado helado de mantequilla del pastel en el mazapán, colocándolo de manera que cuando levante un lado largo, cubra perfectamente un lado del pastel (de esta manera, la unión quedará perfectamente en la esquina).", "Reserve una cucharadita de glaseado y distribuya el resto en los tres lados restantes del pastel (no en los extremos). Cepille las migas del mazapán y la superficie de trabajo. Pase el pastel por el mazapán, presione para cubrirlo con cuidado, luego cepille la esquina uniéndolo ligeramente con agua, presionándolo para sellar. (Trate de evitar tocar el mazapán con los dedos mojados, ya que lo marcarán). Voltee el pastel para que la unión quede debajo. Recorte una fina rebanada de cada extremo del pastel para empacar y mostrar el efecto de tablero de damas. Alise el mazapán con las manos para que su calidez le dé un acabado suave.", "Mientras el mazapán aún esté suave, ribetee los bordes pellizcando el mazapán entre el pulgar y el índice en un ángulo leve y a intervalos regulares. Marca la parte superior de la torta con largas líneas diagonales con un cuchillo afilado. Cierne un poco de azúcar glasé para espolvorear ligeramente la parte superior, luego coloque las nueces por el centro, asegurando con la cobertura de mantequilla reservada."], "url": "www_bbc_co_uk_food_recipes_coffee_and_walnut_88342", "title": "Tarta battenberg de café y nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 torta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g de flan bajo en grasa comprado en la tienda", "60g / 2% C2% BCoz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20broken% 20into% 20pieces", "40ml / 1½fl oz de café espresso fuerte", "½ naranja, ralladura fina solamente", "¼ cucharadita de cardamomo molido", "25 ml / 1 fl oz crema ligera squirty, para servir", "¼ cucharadita de cacao en polvo, para servir"], "method": ["Caliente la crema en una cacerola a fuego medio. Agregue el chocolate, el expreso, la ralladura de naranja y el cardamomo, revolviendo continuamente hasta que el chocolate se haya derretido. Tamizar en una jarra.", "Divida por igual entre cuatro macetas de 125 ml / 4½ onzas o cubetas y refrigere para reafirmar durante al menos 3 horas (no se pondrá completamente firme).", "Cuando esté listo para servir, cubra con crema liviana y un polvo de cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_52759", "title": "Jarras de café y chocolate", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_and_chocolate_52759_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["14 hojas de pasta de filo lista para usar", "200g / 7oz de mantequilla sin sal, derretida", "50g / 1¾oz de avena de avena molida, remojada durante la noche en 100ml / 3½fl oz de jugo de manzana", "75g / 2½oz de avellanas picadas rostizadas", "75g / 2½oz de almendras en copos", "100 g / 3½ oz de arándanos secos, cerezas y fresas", "100 ml / 3½ fl oz miel", "10 rebanadas de manzana seca, picada", "½ cucharadita de anís estrellado molido", "2 cucharaditas de jengibre molido", "2 cucharaditas de canela molida", "2 piezas de tallo de jengibre, picado", "/ 1¾oz 50g de azúcar Demerera", "400ml / 14fl oz de jugo de manzana", "200 g / 7 oz de azúcar en polvo", "125g / 4½oz de avellanas picadas rostizadas", "2 cucharadas de cacao en polvo", "2 cucharadas de café expreso instantáneo", "50 g / 1¾oz de chips de chocolate", "1 anís estrellado entero", "azúcar Demerera / 1 oz 30g", "300ml / 10½fl oz de jugo de naranja", "150 g / 5½ oz de azúcar en polvo", "1 cucharada de extracto de azahar", "1 naranja, solo ralladura"], "method": ["Para el desayuno Baklava, precaliente el horno a 180 ° C / 350 ° F / Gas 4 y engrase una bandeja grande para hornear con mantequilla. Recorte ocho hojas de filo para que encajen perfectamente en la bandeja.", "Coloque una hoja de filo en la bandeja y cepille con mantequilla derretida y luego coloque otra hoja de filo en la parte superior. Espolvoree una capa de avena, nueces, frutas secas, especias, miel, manzana seca y tallo de jengibre. Repita este proceso dos veces más, cepillando el filo con mantequilla sobre la marcha, luego cubra con una capa doble de filo.", "Antes de untar la última hoja de filo, use un cuchillo puntiagudo para cortar el baklava por la mitad. Luego córtalo en tercios hacia el ancho para hacer seis piezas. Corta cada pieza en la diagonal para formar 12 triángulos. Cepille la parte superior con mantequilla y luego agregue una pizca de azúcar demerera.", "Hornee por 25-30 minutos, o hasta que estén doradas.", "Mientras el baklava se cocina, prepare un almíbar. En una sartén, caliente el jugo de manzana y el azúcar a fuego lento hasta que el azúcar se disuelva y luego hierva. Usando un termómetro de cocción, siga midiendo la temperatura del almíbar hasta que alcance los 108 ° C / 226 ° F, luego retírelo del fuego y déjelo enfriar.", "Cuando el baklava esté cocido, vierta sobre el jarabe enfriado. Déjelo enfriar por completo antes de sacarlo de la lata.", "Para el baklava de café y chocolate, combine las avellanas picadas, el cacao, el café, el chocolate, el anís estrellado y el azúcar demerera en un bol para hacer el relleno.", "Precaliente el horno a 200C / 400F / Gas 6. Engrase una bandeja grande para hornear con mantequilla.", "Corte las seis hojas restantes de filo por la mitad para crear 12 cuadrados y cepille una pieza con la mantequilla derretida. Coloque otro cuadrado sobre la parte superior y cepille con más mantequilla. Extienda un tercio del relleno sobre la parte superior, luego agregue otro trozo de filo, cepille con mantequilla y termine con otro trozo de filo, untando con mantequilla como antes.", "Con ayuda de una cuchara de madera como ayuda, enrolle suavemente el filo en una salchicha, luego aplaste ligeramente y colóquelo en la lata preparada. Repita para hacer dos rollos de filo más.", "Corta cada rollo en cuartos para hacer 12 porciones. Cepille la mantequilla por todos lados.", "Hornee durante 15 minutos, luego reduzca la temperatura del horno a 180 ° C / 350 ° F / Gas 4 y hornee durante otros 10 a 15 minutos.", "Mientras tanto, haz un jarabe. Caliente el jugo de naranja y el azúcar impalpable en una sartén hasta que el azúcar se disuelva y luego hierva. Usando un termómetro de cocción, siga midiendo la temperatura del almíbar hasta que alcance los 108 ° C / 226 ° F, luego retírelo del fuego. Agregue el extracto de azahar y déjelo enfriar.", "Cuando el baklava esté cocido, esparza la ralladura de naranja en la parte superior y vierta sobre el jarabe refrigerado. Poner a un lado para enfriar completamente antes de servir."], "url": "www_bbc_co_uk_food_recipes_coffee_and_chocolate_14427", "title": "Baklava de café y chocolate y baklava de desayuno", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "2 huevos grandes de gallinas camperas", "100g / 3½ oz de harina de auto crianza", "1 cucharadita de polvo de hornear de nivel", "50g / 1¾oz de nueces picadas", "1 cucharada de esencia de café", "75g / 2¾oz de mantequilla sin sal, ablandada", "225g / 8oz de azúcar glas, cernida", "2 cucharaditas de leche", "2 cucharaditas de esencia de café", "8 mitades de nuez, para decorar"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Ligeramente lave dos latas tipo sándwich de 18cm / 7 pulgadas con fondo suelto y forre las bases con papel de hornear.", "Coloque la mantequilla, el azúcar, los huevos, la harina, el polvo de hornear, las nueces y la esencia de café en un tazón grande para mezclar y batir juntos (usando un batidor eléctrico si tiene uno) hasta que estén bien combinados y sin grumos.", "Divida la mezcla de manera uniforme entre las latas. Nivele la superficie con una espátula o la parte posterior de una cuchara.", "Hornee durante 20-25 minutos, o hasta que salga limpio un pincho insertado. Deje que las tortas se enfríen en las latas durante 5 minutos, luego coloque una pequeña espátula o un cuchillo de mantequilla redondo alrededor del borde de las latas y con cuidado pase las tortas a una rejilla. Despegue el papel y deje que se enfríe por completo.", "Para rellenar y cubrir, batir la mantequilla y agregar gradualmente el azúcar glas. Agregue la esencia de leche y café y bata hasta que quede suave.", "Elija la torta con la mejor tapa, luego coloque la otra torta de arriba hacia abajo en un plato de servir y unte con la mitad del glaseado de café. Sandwich junto con la otra mitad. Hiele la parte superior de la torta y decore con las piezas de nueces para servir."], "url": "www_bbc_co_uk_food_recipes_coffee_and_walnut_cake_03763", "title": "Pastel de café y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_and_walnut_cake_03763_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla sin sal, suavizada, más extra para engrasar las latas", "200 g / 7 oz de azúcar en polvo", "4 huevos medianos de granja", "3 cucharadas de esencia de café, como Camp", "Harina de auto aumento 250g / 9 oz", "100g / 3½oz de mantequilla sin sal", "200g / 7oz de azúcar glasé", "2 cucharaditas de café en gránulos", "1 cucharada de agua hirviendo", "2 cucharaditas de café en gránulos", "1 cucharada de agua hirviendo", "100g / 3½oz de azúcar glasé", "Azúcar en polvo de 110 g / 4 oz", "18 mitades de nuez", "aceite vegetal, para freír"], "method": ["Para la torta de café, precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme una lata de torta de fondo suelto de 23 cm / 9 pulg.", "Coloque la mantequilla y el azúcar en un tazón grande y bata hasta que esté suave y esponjoso.", "Poco a poco agrega los huevos, batiendo continuamente, luego la esencia del café. Tamizar en la harina y doblar.", "Vierta en la lata de torta preparada y nivele con una espátula.", "Hornee durante 20-25 minutos, o hasta que estén doradas y se hayan levantado.", "Retire de la lata y deje enfriar en una rejilla para enfriar.", "Para la crema de mantequilla de café, coloque la mantequilla ablandada en un tazón y mezcle con una batidora eléctrica de mano. Agregue el azúcar glas tamizado y bata al mismo tiempo. Disuelva el café en el agua y agregue a la crema de mantequilla y revuelva. Dejar de lado.", "Para la glaseado glacé, coloque el café y el agua hirviendo en un bol para disolver, luego agregue el azúcar glas y bata hasta que quede suave. Agregue un poco más de agua hirviendo si es necesario hasta que la mezcla tenga una consistencia extensible.", "Para las nueces confitadas, coloque el azúcar y 110ml / 3½ fl oz en una cacerola y cocine a fuego lento. Agregue las nueces y cocine por un par de minutos, o hasta que estén tiernas. Escurrir y colocar en una hoja grande de papel resistente a la grasa.", "Caliente 2,5 cm / 1 in de aceite vegetal en una cacerola hasta que brille. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Con cuidado agregue las nueces confitadas al aceite y cocine por 1-2 minutos, o hasta que estén doradas.", "Levante y drene en una hoja nueva de papel resistente a la grasa. Deja hasta que se enfríe.", "Para armar el pastel, corte el pastel por la mitad horizontalmente. Extienda la crema de mantequilla sobre la mitad de la torta y coloque la otra mitad encima. Extiende la glaseado glacé sobre la parte superior y decora con nueces confitadas."], "url": "www_bbc_co_uk_food_recipes_coffee_cake_with_coffee_65414", "title": "Tarta de café con crema de café, glaseado de café glaseado y nueces confitadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "Harina simple de 75g / 2¾oz", "2 huevos medianos de granja", "Azúcar glas fondant 230g / 8oz", "2 cucharadas de espresso, enfriado", "75g / 2½oz de coco desecado", "Crema doble de 425 ml / 15 fl oz", "1 cucharada de azúcar glas, tamizada", "½ cucharadita de extracto de vainilla", "4 maracuyá, solo semillas"], "method": ["Precaliente el horno 200C / 400F / Gas 6. Cubra una bandeja para hornear con papel para hornear antiadherente.", "Para los éclairs, coloque 125 ml / 4 fl oz de agua y la mantequilla en una cacerola y derrita suavemente la mantequilla. Llevar a ebullición por un minuto.", "Retire del fuego y agregue la harina de una sola vez, batiendo bien hasta que la mezcla esté suave y se desprenda de los lados de la sartén.", "Regrese al fuego por un minuto o dos para cocinar.", "Retire del fuego otra vez y agregue los huevos, uno a la vez, batiendo bien entre la adición de cada huevo, hasta que estén suaves y lustrosos.", "Coloque la masa en una manga pastelera y pinte 5 cm / 2 en éclairs largos en la bandeja de horno forrada y hornee durante 20 minutos, o hasta que estén dorados. Retirar del horno y reservar para enfriar en una rejilla de alambre.", "Una vez que se haya enfriado, haga un agujero en un extremo del éclair.", "Para la formación de hielo, mezcle la mitad del azúcar glas con el café en un tazón pequeño. La mezcla debe tener una consistencia extensible, de modo que agregue más azúcar glas si es necesario.", "En otro recipiente, coloque el glaseado de fondant restante con dos cucharadas de agua y mezcle hasta que esté combinado.", "Para finalizar, caliente una sartén pequeña y tueste el coco hasta que esté dorado.", "Batir la crema con el azúcar glas y el extracto de vainilla hasta que se formen picos suaves cuando se quite la batidora.", "Transfiera la crema batida a una manga pastelera con una boquilla plana de 1 cm / ½ pulgada y póngala en los éclairs.", "Sumerja la mitad de un lado de los éclairs en el glaseado de café y el otro en el glaseado simple. Espolvorea con coco tostado. Sirva los éclairs de coco con las semillas de maracuyá."], "url": "www_bbc_co_uk_food_recipes_coffee_clairs_66851", "title": "Eclairs de café", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de mantequilla", "125 g / 4½ oz de azúcar en polvo", "2 huevos de gallinas camperas", "1 cucharadita de bicarbonato de soda", "1 cucharadita de extracto de vainilla", "Harina de levante 225g / 8oz", "200ml / 7fl oz de jerez Pedro Ximénez", "100 g / 3½ oz de mantequilla", "200g / 7oz de azúcar glasé", "2-3 cucharadas de esencia de café", "100ml / 3½ fl oz crema doble", "100g / 3% C2% BDoz% 20buena calidad% 20dark% 20chocolate,% 20minimum% 2070 %% 20cocoa% 20solids,% 20broken% 20into% 20pieces", "Una selección de chocolates y dulces, para decorar"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forre una lata profunda de pastel de primavera de 20 cm / 8 pulg.", "Batir la mantequilla y el azúcar juntos hasta que estén suaves y cremosos. Batir los huevos, bicarbonato de soda y extracto de vainilla. Dobla por la mitad de la harina. Vierta el jerez y agregue el resto de la harina.", "Vierta la mezcla en la lata preparada y hornee durante 30-40 minutos.", "Mientras tanto, para hacer la crema de mantequilla de café, bata la mantequilla en un bol hasta que esté suave, luego gradualmente bata el azúcar glasé. Agregue la esencia de café y mezcle hasta que quede suave.", "Deje que la torta se enfríe en la lata durante unos minutos, luego colóquela en una rejilla y déjela enfriar por completo.", "Corta la torta horizontalmente en tres capas. Extienda la mitad de la crema de mantequilla en la capa inferior y cubra con la segunda capa. Repita con la crema de mantequilla restante.", "Para la ganache de chocolate, caliente la crema y el chocolate en una sartén de base pesada. Retire la sartén del fuego y bata la mezcla hasta que quede suave y espesa. Dejar enfriar un poco.", "Cucharee el ganache de chocolate y déjelo correr por los lados del pastel.", "Adorne con los chocolates y sirva."], "url": "www_bbc_co_uk_food_recipes_coffee_chocolate_and_px_77531", "title": "Pastel de café, chocolate y jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace pastel de 1 x 20 cm / 8 pulgadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de gránulos de café instantáneo", "75 g / 2½ oz de azúcar en polvo", "600ml / 20fl oz de leche entera", "3 huevos de gallinas camperas", "3 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo"], "method": ["Caliente el horno a 150C / 300F / Gas 2. Tenga listos cuatro moldes para horno.", "Ponga el café, el azúcar impalpable y la leche en una cacerola y llévelos suavemente hasta el punto de cocción a fuego lento, revolviendo ocasionalmente para disolver el café. No hiervas Retirar del fuego y dejar de lado mientras se hace el caramelo.", "Para el caramelo, ponga el azúcar y 50 ml / 2 fl oz de agua en una sartén de base pesada. Calentar suavemente hasta que el azúcar se haya disuelto, luego llevar a ebullición. Hervir durante unos minutos, o hasta que el jarabe se haya convertido en un caramelo dorado oscuro.", "Tan pronto como el caramelo haya alcanzado el color correcto, viértalo en los moldes. Tenga cuidado porque hará mucho calor. Deje que se seque (pero no lo ponga en la nevera).", "Batir los huevos y las yemas de huevo juntos en un tazón. Verter suavemente sobre la leche con sabor a café y batir hasta que estén bien combinados. Colar en una jarra. Vierta esta mezcla en los moldes. Coloque los moldes en una bandeja de horno grande y profunda. Vierta agua caliente en la bandeja para que llegue a tres cuartas partes de los moldes. Cubra la bandeja con papel de aluminio y colóquela en el horno. Hornee por 40-45 minutos, o hasta que las natillas estén listas, pero todavía se balanceen un poco.", "Retire de la fuente del horno y deje enfriar completamente, luego refrigere por 24 horas.", "Para salir, primero coloca un cuchillo de hoja delgada alrededor de la natilla, luego coloca un plato sobre la parte superior e invierte el molde para que la natilla y sus adorables jugos de caramelo salgan al plato. Servir de inmediato"], "url": "www_bbc_co_uk_food_recipes_coffee_crme_caramels_75585", "title": "Crema de caramelo de café", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_crme_caramels_75585_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["600ml / 1 pinta fuerte, café exprés caliente", "Azúcar en polvo 120g / 4oz", "300 ml / 10 fl oz doble crema", "1 vaina de vainilla, longitudinalmente dividida, semillas raspadas", "1 cucharada de azúcar glas"], "method": ["Coloque una fuente de horno poco profunda (aproximadamente 1 litro / 1 ¾ de capacidad) en el congelador.", "Revuelva y disuelva el azúcar en el café a fuego lento. Dejar de lado para enfriar.", "Vierta la mezcla de café en el plato y congele durante 40 minutos. Compruebe si hay cristales de hielo formando alrededor del borde. Si hay, tráigalos suavemente al centro del líquido con un tenedor. Coloque el granito de nuevo en el congelador", "Mire otra vez en aproximadamente 20 minutos y repita el mismo proceso que en el paso 3. Siga haciendo esto hasta que toda la mezcla sea una masa de cristales de café sin partes líquidas restantes. Una vez que esto se haya logrado, incline el granito en una caja plástica con tapa y guárdelo en el congelador hasta que lo necesite.", "Coloque la crema, la vainilla y el azúcar glas en un tazón grande. Agregue un puñado de hielo picado y batir la mezcla hasta obtener una consistencia de caída.", "Sirva el granizado en vasos preenfriados con la mezcla de crema batida."], "url": "www_bbc_co_uk_food_recipes_coffee_granita_02612", "title": "Granizado de café", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_granita_02612_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["340g / 12oz de azúcar sin refinar", "570ml / 1 pinta de agua", "40 granos de café", "Polvo de cacao 180g / 6oz", "pizca de sal", "60 g / 2 oz de chocolate amargo de la mejor calidad que puedes encontrar"], "method": ["Coloque el azúcar en una sartén a fuego medio. Cepille los lados de la sartén con un cepillo de pastelería mojado en una taza de agua fría. Continúe este proceso hasta que el azúcar se caramelice. (Probablemente terminará usando un tercio del agua).", "Agregue el resto del agua, los granos de café, el cacao en polvo, la sal y el chocolate.", "Llevar a ebullición.", "Pasar a través de un tamiz muy fino y dejar enfriar.", "Servir frío."], "url": "www_bbc_co_uk_food_recipes_coffeeandchocolatesa_9813", "title": "Salsa de café y chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de chocolate con leche, picado", "2 cucharadas de esencia de café", "½ cucharada de azúcar morena clara", "11 nueces"], "method": ["Reserve 50g / 1¾oz del chocolate para más tarde y atempere el chocolate restante. Para templar, derrita el chocolate con leche en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento. No permita que el recipiente toque el agua o el chocolate se quemará y no permita que entre agua en el chocolate o el chocolate se agarrotará.", "Continúe calentando el chocolate hasta que mida 42 ° C / 107 ° F en un termómetro de chocolate. Luego quítelo del fuego y déjelo enfriar a 31C / 88F.", "Use una brocha limpia o sin grasa o una cucharadita para cubrir y forrar cada una de las copas acanaladas en el molde con el chocolate. Debe hacer esto rápidamente o el chocolate comenzará a fraguar y será demasiado grueso para trabajar.", "Usa una espátula para raspar cualquier chocolate de la parte superior del molde. Guarde cualquier chocolate que no haya usado para volver a usar más tarde.", "Coloque los moldes en la nevera para establecer durante unos 20 minutos.", "Para hacer el relleno, coloque la esencia de café en una jarra medidora y agregue suficiente agua fría para llegar a 50 ml / 2 fl oz. Verter en una sartén, agregar el azúcar y llevar a ebullición. Cocine a fuego lento por un minuto.", "Ponga los 50g / 1¾oz de chocolate con leche reservados en un tazón. Agregue el líquido del café y revuelva para ayudar a que el chocolate se derrita, luego déjelo hasta que esté frío. Deje que se espese en la nevera durante una hora o más antes de llenar los moldes.", "Saca los moldes de la nevera. Coloque la mezcla de chocolate y café en los moldes y déjelo reposar durante la noche.", "Para sellar los látigos de nueces, atemperar el chocolate con leche restante, usando cualquier resto de chocolate de antes.", "Con una cucharadita, coloca el chocolate sobre el relleno para cubrirlo.", "Cubra cada uno con una nuez. Enfríe durante al menos 30 minutos hasta que se endurezca, luego, con cuidado, agítelo sobre un tablero para soltar los látigos de nueces.", "Sirve después de la cena con café."], "url": "www_bbc_co_uk_food_recipes_coffee_walnut_whips_36317", "title": "Látigos de café y nueces", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Hace 11 látigos de nuez", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_walnut_whips_36317_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos grandes de gallinas camperas", "300 g / 10½ oz de azúcar en polvo, más extra para quitar el polvo", "75 ml / 2 ½ oz de esencia de café", "100g / 3½ oz de harina de auto crianza", "50g / 1¾oz de almendras blanqueadas", "50 g / 1¾oz de pistachos", "50 g / 1¾oz de avellanas blanqueadas", "300ml / 10½ fl oz crema doble", "25g / 1oz de azúcar glas", "50g/1¾oz dulce de leche", "8-10 castañas dulces"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase y forme una lata de rollo suizo de 33x23cm / 13x9in con papel para hornear.", "Batir los huevos y 100 g / 3½ oz del azúcar en un bol hasta que la mezcla se vuelva ligera y deje un rastro cuando retire el batidor del bol. Esto llevará entre 10 y 15 minutos. Batir en la esencia de café.", "Tamiza la harina en la mezcla de huevo y dóblala con cuidado. Vierte la mezcla en la lata y agítala para nivelarla, de modo que se extienda uniformemente.", "Hornee durante 8-10 minutos o hasta que el pastel se dore. Luego aparta para enfriar en la lata.", "Coloque el resto de 200 g / 7 oz de azúcar en una sartén a fuego medio. Derretir el azúcar, sin remover, hasta que se forme un caramelo dorado. (PRECAUCIÓN: el azúcar derretido está muy caliente. Tenga cuidado de no quemarse). Retire del fuego y agregue las nueces. Vierta la almendra garapiñada en una hoja grande de pergamino para hornear o papel de silicona y déjela a un lado hasta que esté completamente fría y dura.", "En un procesador de alimentos, mezcle el praliné con un polvo grueso. Reserve a un lado hasta que esté listo para armar el rollo suizo.", "Incline el suizo todavía caliente sobre una toalla de té limpia. Comenzando en uno de los bordes más largos, enrolle el rollo suizo y déjelo a un lado para que se enfríe por completo.", "Mientras la torta se está enfriando, prepare el relleno. Vierta la crema en un tazón grande y agregue el azúcar. Batir hasta que se formen picos suaves cuando se quite la batidora de la taza. Agregue el dulce de leche y mezcle bien.", "Coloque una toalla de té sobre la superficie de trabajo y espolvoree el praliné mezclado sobre la toalla de té en una capa uniforme.", "Desenrolle con cuidado el rollo suizo sobre el praliné mezclado, luego extienda la crema de caramelo sobre la esponja fría, dejando un espacio de 2 cm en el borde.", "Usando la toalla de té para ayudarlo, enrolle la esponja con fuerza, asegurándose de que el relleno permanezca adentro. Ruede la esponja de la toalla de té. El praliné mezclado debe pegarse al exterior de la torta, pero cualquier parche puede llenarse presionando cualquier exceso de praliné sobre la esponja.", "Decora el rollo suizo con los marrons glacées y sírvelo en rebanadas."], "url": "www_bbc_co_uk_food_recipes_coffee_swiss_roll_with_63858", "title": "Rollo suizo de café con relleno de caramelo y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 rollo suizo", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz doble crema", "1 vaina de vainilla, semillas raspadas", "100 g / 3½ oz de azúcar en polvo", "2-3 hojas de gelatina, empapadas en agua fría durante unos minutos", "350ml / 12fl oz de suero de leche", "50ml / 2fl oz de café exprés", "300 ml / 10 fl oz de leche", "500g / 1lb 2oz de harina fuerte, más extra para espolvorear", "75 g / 2½ oz de azúcar en polvo, más extra para quitar el polvo", "Sal de mesa 5g", "7g acción rápida levadura seca", "1 huevo de gallinas camperas, golpeado", "50g / 1¾oz de mantequilla suavizada", "aceite vegetal, para freír", "175g / 6oz de chocolate puro, roto en pedazos", "50 g / 1 oz de azúcar en polvo", "2 cucharadas de avellanas blanqueadas machacadas", "2 cucharadas de almendras blanqueadas machacadas", "4 cucharadas de hojas de menta fresca"], "method": ["Para el panna cotta de café, enfríe una jarra grande o un tazón en el congelador.", "Caliente la crema doble, la vaina de vainilla y las semillas y el azúcar en una cacerola hasta que hierva. Retire la sartén del fuego, agregue la gelatina remojada y la leche de suero y bata hasta que estén bien combinados.", "Pase la mezcla a través de un tamiz fino en la jarra fría, y luego agregue el café.", "Regrese la jarra al refrigerador y bata la mezcla cada cinco minutos hasta que comience a fraguar.", "Vierta la mezcla en moldes dariole o moldes, y enfríe en la nevera durante al menos dos horas, o hasta que esté completamente preparado.", "Para las donas, caliente la leche suavemente en una olla. Mezcle la harina, el azúcar, la sal y la levadura en un mezclador independiente. Agregue la leche tibia y el huevo y mezcle con una masa pegajosa. Usando un accesorio de paleta, amase durante aproximadamente 5 minutos hasta que quede suave y elástico.", "Con la batidora en funcionamiento, agregue gradualmente la mantequilla ablandada un poco a la vez, mezclándola entre cada adición. Esto tomará alrededor de 10 minutos.", "Harina una superficie de trabajo y sacar la masa. Continúa amasando hasta que quede suave, brillante y no más pegajoso. Coloque la masa en un recipiente grande, cubra y deje en un lugar cálido para que se levante durante 2 horas, o hasta que duplique su tamaño. Moldee la masa en bolitas y colóquela en una bandeja para hornear forrada y deje que se levante nuevamente durante 20 minutos.", "Caliente el aceite en una freidora de grasa profunda o una sartén profunda de fondo profundo y pesado a 190 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Baje con cuidado las donas en la grasa y fríe durante 3-4 minutos hasta que estén doradas. Escurrir sobre papel de cocina. Transfiera a un plato y espolvoree con azúcar en polvo.", "Para la salsa de chocolate, derrita el chocolate en un recipiente colocado sobre una fuente de agua hirviendo (asegúrese de que el fondo del recipiente no toque el agua).", "Caliente el azúcar en una sartén con 100 ml / 3½ fl oz de agua, revolviendo hasta que el azúcar se disuelva. Llevar a ebullición.", "Mezcle el jarabe de azúcar en el chocolate derretido hasta que quede suave y brillante.", "Para servir, coloque la base de los moldes dariole en agua hirviendo para aflojar la panna cotta. Coloque en un plato junto a las donas y la salsa de chocolate. Adorne con las nueces trituradas y la menta."], "url": "www_bbc_co_uk_food_recipes_coffee_panna_cotta_with_85926", "title": "Café panna cotta con donas y salsa de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]