[{"isVegetarian": true, "title": "Overnight muesli with apple and nuts", "url": "www_bbc_co_uk_food_recipes_overnight_muesli_with_57876", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/overnight_muesli_with_57876_16x9.jpg", "ingredients": ["50g/1¾oz porridge oats", "2 apples, coarsely grated", "20g/¾oz blanched hazelnuts, roughly chopped", "¼ tsp ground cinnamon", "¼ tsp ground nutmeg", "200g/7oz 0% fat Greek yoghurt", "100ml/3½fl oz skimmed milk", "100g/3½oz blueberries ", "10g/¼oz flaked almonds, toasted"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["In a bowl mix the oats, apples, hazelnuts, cinnamon and nutmeg. Stir in the yoghurt and milk, then cover the bowl and chill in the fridge for several hours or overnight. ", "Spoon into two bowls and top with the blueberries and almonds. "]}, {"isVegetarian": false, "title": "Ox cheeks braised in red wine with creamy mash and sautéed asparagus", "url": "www_bbc_co_uk_food_recipes_ox_cheeks_braised_in_red_60794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "2 ox cheeks, trimmed ", "1 onion, diced", "2 carrots, diced", "4 sticks celery, diced", "2 tbsp tomato purée ", "750ml bottle red wine", "2 garlic bulbs, halved", "2 bay leaves", "small bunch fresh thyme", "2 star anise", "3–4 cloves", "500ml/18fl oz dark chicken or veal stock", "salt and freshly ground black pepper", "1 bunch watercress", "2 tbsp light olive oil, plus more if needed", "4 asparagus spears, stalks roughly chopped, tips still intact", "10g/⅓oz butter", "1 braised ox tongue, diced ", "splash Madeira", "mashed potato, made very soft with lots of butter and double cream. ", "micro watercress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a large flameproof casserole dish over a medium heat. Brown the ox cheek on all sides, remove and set aside.", "Throw in the vegetables with the garlic, herbs and spices and fry for 10 minutes, until golden-brown. Stir in the tomato purée and add the wine. Simmer until the volume of the liquid is reduced by half. ", "Return the cheek to the pan, add the stock, bring to a simmer, cover and braise for 2–3 hours or until the cheek is tender. ", "Remove the cheek and keep warm. Strain the sauce into a clean pan and reduce to a glossy, coating consistency. Season to taste.  ", "To make the watercress oil, blanch the watercress for a couple of minutes and refresh under cold water. Remove the stalks and put into a blender with the olive oil and salt. Blitz well and pass through a sieve. ", "To make the tongue and asparagus, blanch the asparagus for 2 minutes and refresh under cold water. Heat the butter in a pan, add the asparagus and braised tongue and sauté for 2–3 minutes. Add the Madeira to glaze.  ", "To serve, divide the mashed potato between two shallow bowls and top with the cooked cheeks. Spoon over the sauce, garnish with the tongue and asparagus, drizzle with the watercress oil and garnish with the micro watercress. "]}, {"isVegetarian": false, "title": "Oxtail poutine and butter-fried steak with golden garlic", "url": "www_bbc_co_uk_food_recipes_oxtail_poutine_and_07033", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz beef dripping", "2kg/4lb 8oz short ribs, cut into 500g/1lb 2oz portions", "1 onion, chopped", "1 carrot, peeled and chopped", "1 celery stick, chopped", "2 garlic cloves, finely chopped", "250ml/9fl oz red wine", "2 litres/3½ pints beef stock", "4 tbsp olive oil", "2kg/4lb 8oz oxtail", "250g/9oz floury potatoes, such as Maris Piper, cut into 2cm/¾in-thick chips", "500g/1lb 2oz beef dripping", "75g/2½oz curd cheese ", "2 x 550g/1lb 4oz bone-in steaks, such as T-bone or prime rib ", "100g/3½oz beef dripping", "250g/9oz unsalted butter ", "4 fresh thyme sprigs", "1 fresh rosemary sprig", "2 heads garlic, peeled, cloves separated", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3", "To make the oxtail gravy, heat the dripping in a large casserole dish over a medium heat. Add the ribs in batches and seal until brown all over. Add the onion, carrot, celery and garlic and cook for 5–6 minutes. Add the red wine and simmer until the volume has reduced by half. Add the stock, return the ribs to the pan, cover and place in the oven for an hour.", "Meanwhile, roast the oxtail in a frying pan and add it to the casserole pan and continue to cook for a further 3 hours. Remove from the oven and carefully flake the meat using a fork and stir. It should be a little lumpy.", "Rinse the cut potatoes in plenty of cold water to remove the startch and place in a saucepan of boiling salted water and cook for 7 minutes. Drain in a colander and allow to dry.", "Put the beef dripping in a deep-fat fryer or a large, deep, heavy-bottomed saucepan. Heat to 140C. (CAUTION: Hot fat can be dangerous. Do not leave unattended.) Fry the chips for 4–5 minutes, ensuring they are submerged. Remove from the fryer and drain. Shake the chips to chuff the edges and allow to cool completely in the basket.", "Meanwhile, season the steaks all over with salt and pepper. Heat the dripping in a large cast-iron frying pan over a high heat. Once it is foaming, add the steaks and cook for 5 minutes, or until crusty on the bottom. Turn the steaks and add half the butter, the thyme, rosemary and garlic. Cook over a high heat, basting the steaks with the foaming butter, garlic and herbs, for 5–7 minutes, or until medium-rare. Transfer the steaks to a plate and leave to rest for 10 minutes. Meanwhile, remove the herbs from the pan and keep frying the garlic until soft and golden, adding the remaining butter. ", "Reheat the deep-fat fryer or heavy-bottomed saucepan to 190C. (CAUTION: Hot fat can be dangerous. Do not leave unattended.) Fry the chips again for 4–5 minutes, or until golden. ", "Strain 2 ladles of oxtail gravy into a pan places over a medium heat and simmer until thickened and heated through.", "Cut the steaks off the bone and slice the meat across the grain. Serve with the fried garlic and the resting meat juices poured over. Toss the cooked chips with the cheese curds and place in a serving dish, pour over the gravy and serve with the steaks."]}, {"isVegetarian": false, "title": "Oxtail soup", "url": "www_bbc_co_uk_food_recipes_oxtail_soup_71917", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_soup_71917_16x9.jpg", "ingredients": ["3 tbsp olive oil", "1.25kg/2lb 12oz oxtail, trimmed of fat and cut into pieces", "1 onion, roughly chopped", "1 celery stalk, roughly chopped", "1 large carrot, roughly chopped", "1 bay leaf", "3 thyme sprigs", "10 black peppercorns", "2 tsp tomato purée", "300ml/10½fl oz red wine", "1.5 litres/2½ pints litres beef stock", "1 tbsp plain flour"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the oil in a large, flameproof casserole dish. Add the oxtail pieces and fry over a high heat until browned all over – you may have to do this in batches. Take the oxtail out of the dish and put it on a plate.", "Add all the vegetables to the casserole and cook for 4-5 minutes, stirring occasionally. Add the herbs, peppercorns and tomato purée and cook for another minute. Pour in the wine and allow to bubble for a few minutes.", "Return the oxtail to the pan and pour in the stock. Bring to the boil, then turn down the heat to a gentle simmer. Cover and cook for 2½-3 hours, until the oxtail is really tender and falling off the bone. Using tongs or a slotted spoon, transfer the oxtail pieces to a plate and leave to cool.", "Strain the cooking liquor through a sieve into a bowl and leave to cool. Shred the oxtail meat and discard the bones. Place in a bowl and cover. Cover the bowl of cooking liquor and leave in the fridge, along with the oxtail meat, overnight.", "The next day, scrape away and discard the layer of fat on top of the cooking liquid. Spoon the remaining jellified soup into a pan and heat through until simmering. In a small bowl, blend the flour and three tablespoons of the hot soup until smooth. Whisk into the soup and simmer for two minutes. Add the oxtail meat to the pan and heat through for a minute or two before serving."]}, {"isVegetarian": false, "title": "Oxtail soup with mini parsley dumplings", "url": "www_bbc_co_uk_food_recipes_oxtail_soup_with_mini_37306", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole oxtail (around 1.3kg/3lb), cut into chunky pieces ", "3 tbsp plain flour", "flaked sea salt and freshly ground black pepper", "3-4 tbsp sunflower oil", "2 onions, halved and sliced", "2 garlic cloves, finely chopped ", "3 carrots, peeled and diced", "2 sticks celery, trimmed and diced", "1 tsp dried thyme", "2 bay leaves", "300ml/10fl oz red wine", "2 litres/3½ pints beef stock, made with 2 beef stock cubes", "2 tbsp tomato purée", "2 tbsp cream sherry", "2 tbsp yeast extract, such as Marmite", "200g/7oz self-raising flour", "100g/3½oz shredded suet", "3 tbsp finely chopped parsley", "½ tsp flaked sea salt", "150ml/5fl oz cold water"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/3140F/Gas 3-4.", "Wash the oxtail pieces and pat dry with kitchen paper. Trim off as much excess fat as possible. Put the flour in a strong plastic food bag and season well with salt and freshly ground black pepper. Drop half of the oxtail pieces into the seasoned flour and shake to coat. Transfer to a plate. Repeat with the remaining oxtail pieces.", "Heat two tablespoons of the oil in a large non-stick frying pan. Brown the oxtail pieces over a medium heat for about 10 minutes, or until deeply coloured, turning every now and then. You may need to add extra oil or cook the beef in batches depending on the size of your pan. Put the oxtail pieces in a large, flame-proof casserole.", "Return the frying pan to the hob and add the onions, garlic, carrots and celery, with a little extra oil if necessary. Cook gently for 10 minutes, or until softened and lightly browned, stirring occasionally. ", "Tip the vegetables on top of the beef and add the thyme and bay leaves. Stir in the wine, beef stock and tomato purée. Season with salt and pepper and bring to a gentle simmer. Cover the casserole with a lid and cook in the centre of the oven for three hours, stirring and turning the oxtail pieces halfway through the cooking time until the meat is falling off the bones.", "Remove the casserole from the oven and transfer the oxtail pieces to a board. Leave to cool slightly. Skim off the fat from the soup that will have pooled on the surface and discard. Pull the meat off the bones and discard any gristly bits. Cut the beef into small chunks and return to the casserole. Stir in the sherry and yeast extract.", "To make the dumplings, mix the flour, suet, parsley and salt in a large bowl. Stir in enough water to mix to a soft, spongy dough. ", "Roll the dough into 18 small balls and put to one side. Bring the soup to a gentle simmer, stirring occasionally. Add plenty of seasoning and drop the dumplings gently on top of the soup. Cover tightly with a lid and simmer for 15-18 minutes, or until the dumplings are well-risen and fluffy. Ladle the soup into deep bowls to serve."]}, {"isVegetarian": false, "title": "Oxtail stew", "url": "www_bbc_co_uk_food_recipes_oxtail_stew_91956", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oxtail_stew_91956_16x9.jpg", "ingredients": ["1.3kg/3lb oxtail, cut into chunky pieces (ask your butcher to do this for you)", "3 tbsp plain flour", "salt and freshly ground black pepper", "3–4 tbsp sunflower oil", "2 medium onions, sliced", "2 garlic cloves, finely chopped", "2 medium carrots, diced", "2 celery stalks, diced", "4–5 sprigs fresh thyme (or ½ tsp dried thyme)", "2 bay leaves", "300ml/½pint red wine", "500ml/18fl oz beef stock", "2 tbsp tomato purée", "1 tbsp chopped fresh parsley, to serve (optional)"], "serves": "Serves 5-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2.", "Wash the oxtail pieces and pat dry with kitchen paper. Trim off as much excess fat as possible. Put the flour in a freezer bag and season well with salt and pepper. Put half the oxtail pieces into the seasoned flour, toss well to coat then put aside on a plate. Repeat with the remaining oxtail pieces.", "Heat two tablespoons of the oil in a large non-stick frying pan. Brown the oxtail over a medium heat for about 10 minutes, turning every now and then, until dark brown all over. You may need to add extra oil if the pan looks dry at any point during the browning step. Put the browned oxtail into a flameproof casserole dish. (You may need to do this in batches.)", "Return the frying pan to a low heat and add the onions, garlic, carrots and celery. Add a little extra oil if necessary. Cook gently for 10 minutes, or until softened and lightly browned, stirring occasionally. ", "Tip the vegetables on top of the beef and add the thyme and bay leaves. Stir in the wine, beef stock and tomato purée. Season with salt and pepper, put the casserole on the heat and bring to a gentle simmer. Cover the casserole dish with a lid and cook in the centre of the oven for 3 hours. Stir after 1½ hours, turning the oxtail in the sauce.", "After 3 hours, the meat should be falling off the bones and the sauce should be thick. Remove the casserole dish from the oven and transfer the oxtail pieces to a plate, set aside and keep warm.", "Skim any fat that has pooled on the surface of the sauce.", "Divide the oxtail pieces between six warmed plates and spoon over the sauce. Sprinkle with the chopped parsley (if using) and serve with mashed potato and fresh vegetables."]}, {"isVegetarian": false, "title": "Oxtail salad with summer vegetables", "url": "www_bbc_co_uk_food_recipes_oxtailsaladwithsumme_86396", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz oxtail, cut into 2.5cm/1in thick pieces, trimmed of any excess fat ", "salt and freshly ground black pepper", "50g/2oz flour, plus extra for dusting the oxtail", "60g/2½oz butter, plus extra for the carrots ", "1 onion, finely chopped", "2 garlic cloves, crushed ", "1 tsp fresh thyme leaves ", "2 tsp tomato purée ", "100ml/3½fl oz red wine ", "2 litres/3½ pints beef stock (or 2 good quality beef stock cubes, dissolved in 2 litres/3½ pints hot water ", "1 tbsp cider vinegar", "½ tsp English mustard ", "3 tbsp extra virgin rapeseed oil", "handful pea shoots", "handful small salad and herb leaves (for example, silver sorrel, bittercress, amaranth, corn salad or baby spinach)", "60g/2½oz (shelled weight) fresh peas, boiled", "80-100g/3-4oz (shelled weight) fresh broad beans, boiled"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/400F/Gas 7.", "For the oxtail, season the pieces of oxtail with salt and freshly ground black pepper and lightly dust them with a little flour.", "Place the oxtail into a roasting tin and roast in the oven for 30 minutes, turning the oxtail pieces after 15 minutes to make sure they are nicely coloured on both sides.", "Meanwhile melt the butter in a pan over a low heat and gently cook the onion, garlic and thyme for 3-4 minutes until soft, stirring occasionally.", "Add the flour and the tomato purée and stir well.", "Gradually pour in the red wine and stock, stirring well between additions to avoid lumps forming, then bring the mixture to the boil.", "Add the pieces of roasted oxtail to the pan, then cover and simmer gently over a low heat for about two hours. Check the pieces of oxtail - the meat should be tender and easily removed from the bone. If not, replace the lid and cook for another 15 minutes and test again.", "Drain the oxtail into a colander over a bowl to reserve the sauce.", "When the oxtail is cool enough to handle, remove the pieces of meat from the bone and place into a clean saucepan and cover with the reserved sauce. Bring to the boil, then reduce the heat and simmer until the sauce has reduced enough to just coat the meat.", "Meanwhile, for the dressing, whisk all of the dressing ingredients together in a clean bowl and season, to taste, with salt and freshly ground black pepper.", "For the salad, place the pea shoots, salad and herb leaves, peas and broad beans into a bowl and cover with most of the dressing. Mix well to coat and arrange a little salad in the centre of each serving plate.", "To serve, spoon a little of the warm oxtail meat around the salad with a small amount of sauce just coating the meat, then spoon a little of the remaining dressing over the oxtail."]}, {"isVegetarian": false, "title": "Oyster loaves", "url": "www_bbc_co_uk_food_recipes_oysterloaves_67845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 miniature cottage loaves or brioches", "110g/4oz butter", "12 fresh oysters ", "salt and freshly ground pepper", "pinch of grated nutmeg", "150ml/5fl oz double cream", "1 tsp fresh lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. Slice the tops off the rolls or brioches and scoop out most of the bread inside. Melt 55g/2oz of the butter. Brush the undersides of the lids and the hollows of the rolls inside and out generously with the melted butter. ", "Place the loaves on a baking sheet. Bake for about 10 minutes or until lightly brown. Meanwhile clean and open the oysters, drain off the liquor and reserve to one side. ", "While the loaves are browning, heat the remaining butter in a large frying pan. Sauté the oysters in the pan about 1 minute. ", "Remove the oysters from the pan with a draining spoon, cut them into 3 pieces and set aside. Add the reserved oyster liquor to the pan with the cream. Season with salt, pepper and nutmeg. Boil down steadily, stirring constantly, to form a very thick sauce, adding in the lemon juice. ", "Return the chopped oysters to the pan and gently reheat. Spoon the oysters and the sauce into the warmed rolls. Top with the lids and serve at once."]}, {"isVegetarian": false, "title": "Oyster po'boys", "url": "www_bbc_co_uk_food_recipes_oysterpoboys_80061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["18 freshly shucked oysters, or more if you like", "grapeseed oil or vegetable oil, for deep frying", "1 small jar mayonnaise, or make your own", "1 tbsp chopped fresh tarragon", "1 tbsp capers", "1 tbsp finely chopped shallots", "1 tsp French mustard", "dash Tabasco", "1 tbsp tomato purée", "2 tbsp lemon juice", "1 tsp red wine vinegar", "½ tsp cayenne pepper", "1 tbsp horseradish sauce", "225g/8oz cornmeal", "1 tbsp ground cumin", "1 tsp ground fennel", "1 tsp cayenne pepper", "salt and freshly ground black pepper", "2 eggs", "285ml/½pint milk ", "French stick, warmed", "butter", "crisp lettuce, such as cos, torn"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the remoulade mix all the ingredients together. Taste and adjust any of the ingredients you think necessary.", "For the cornmeal crust, combine all the ingredients in a bowl. Add salt and freshly ground black pepper to taste. ", "In a separate bowl, combine the egg and milk in a bowl for the egg wash. ", "Dry the freshly shucked oysters with kitchen towel then dip in the egg wash and then in the cornmeal crust mixture, coating liberally.", "Heat the grapeseed or vegetable oil in a large pan for deep frying until a breadcrumb sizzles gently in it (CAUTION: hot oil can be dangerous - do not leave unattended).", "Deep-fry the coated oysters until golden, about 2-3 minutes. Remove with a slotted spoon and drain on kitchen towel.", "Take a freshly warmed French stick, split down the middle and butter. Top with a layer of lettuce then drizzle over the remoulade sauce. Add the deep-fried oysters and cover with the other half of the French loaf.", "Eat at once."]}, {"isVegetarian": false, "title": "Oysters thermidor", "url": "www_bbc_co_uk_food_recipes_oysters_thermidor_69288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["24 native oysters in their shells", "55g/2oz butter", "1 shallot, finely chopped", "1 tbsp vermouth", "140ml/4½fl oz chicken stock", "140ml/4½fl oz fish stock", "140ml/4½fl oz double cream", "1 tbsp Dijon mustard, to taste", "2 egg yolks", "1 tbsp chopped fresh parsley", "55g/2oz parmesan, finely grated", "200g/7oz samphire"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Open the oysters carefully, retaining the juice. Cover the oysters with a clean cloth, but do not refrigerate.", "Melt the butter in a pan and add the shallot. Cook gently without colouring.", "Add the vermouth, oyster juice and stocks. Cook until the volume of liquid has reduced by two thirds.", "Add the cream and cook until the volume has reduced by half.", "Shuck the oysters, pry them from the shells and set aside. Clean the deeper shells and lay them on a tray, then put a little of the sauce in the base of each shell. Lay an oyster in each shell and transfer to the oven for two minutes. Preheat the grill to hot.", "Stir the mustard into the remaining sauce. Remove the sauce from the heat and stir in the egg yolks, followed by the parsley and half of the parmesan.", "Take the oysters out of the oven and pour a little sauce over each one. Sprinkle the remaining parmesan over the top. ", "Cook the samphire in a pan of boiling salted water for 1-2 minutes, or until tender. Drain well. ", "Meanwhile grill the oysters to glaze them. Serve with the samphire."]}, {"isVegetarian": false, "title": "Oysters Rockefeller", "url": "www_bbc_co_uk_food_recipes_oystersrockefeller_85977", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 fresh oysters in their shell", "55g/2oz butter", "½ small onion, chopped", "1 tbsp chopped fresh parsley", "55g/2oz spinach, chopped", "55g/2oz fine breadcrumbs"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Open the oyster shells with a shucker. Discard the top and loosen each oyster from the base of its shell. Set aside and keep cool.", "Melt the butter in a small frying pan. Fry the onion and the parsley for 2-3 minutes, until softened.", "Add the spinach and cook until wilted.", "Add the breadcrumbs and cook for 1-2 minutes.", "Place a teaspoon of spinach and breadcrumb mixture onto each half oyster shell to cover the oyster and place a small lump of butter on top of each.", "Place the oysters onto a baking tray and transfer to the grill to cook until golden-brown."]}, {"isVegetarian": false, "title": "Oysters with a coriander and passion fruit relish", "url": "www_bbc_co_uk_food_recipes_oysterswithacoriande_87075", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 rock oysters", "1 lemon, juice only", "1 lime, juice only", "150ml/¼ pint olive oil", "1 passion fruit, pulp scraped out", "1 tsp chilli flakes", "1 shallot, finely chopped", "small handful fresh coriander, finely chopped", "1 lime, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully open the oysters using an oyster shucker and place on a serving plate.", "Place all the remaining ingredients, except the lime wedges, into a small bowl and mix well.", "To serve, pour the relish over the oysters and garnish with lime wedges."]}, {"isVegetarian": false, "title": "Oysters with tagliolini", "url": "www_bbc_co_uk_food_recipes_oysterswithtagliolin_73313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 large oysters, preferably Colchester oysters", "55g/2oz butter", "200g/7oz tagliolini pasta, preferably fresh", "2 tbsp white wine vinegar", "½ lemon, juice only", "1 small bunch of chives, finely chopped", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of salted water to the boil. With an oyster knife, open the oysters and scoop the oysters' flesh out of the shell. Cut them in half and put them back in their own water, taking care not to leave any bits of shell in the oyster water.", "Gently melt the butter in a large saucepan. ", "Meanwhile, add the pasta to the pan of boiling salted water. It should take two minutes to cook, if you're using fresh pasta, or according to packet instructions. Drain the cooked pasta, reserving some of the cooking water.", "Add the drained pasta to the pan with melted butter. Then add the oysters and the oyster water. Add the chives, vinegar and lemon. Stir for a couple of minutes, just to warm the oysters up. Add more water or butter if needed. ", "Serve immediately."]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_pad_thai_36788", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_36788_16x9.jpg", "ingredients": ["250g/9oz flat rice noodles ", "3 garlic cloves, roughly chopped ", "good handful coriander leaves and stalks ", "1 red chilli, seeds removed, roughly chopped ", "2 limes, zest and juice", "2 tbsp sunflower oil ", "20 raw tiger prawns, de-shelled, heads and black vein removed ", "6 spring onions, trimmed and finely sliced ", "100g/3½oz beansprouts ", "3 tbsp Thai fish sauce (Nam Pla) ", "1 tbsp light soft brown sugar ", "2 large free-range eggs, beaten ", "lime wedges, to garnish ", "4 tbsp toasted sesame seeds, roughly chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles according to the packet instructions then drain them and set aside.", "In a pestle and mortar, make a paste from the garlic, coriander stalks, red chilli and lime zest.", "Heat the oil in a wok or a large non-stick frying pan over a high heat. When the oil is just at smoking point, add the paste and fry for about one minute, or until it becomes aromatic. ", "Add the prawns, half of the spring onions and half of the beansprouts and stir-fry for two minutes.", "Add the drained noodles and mix through. Stir in the lime juice, fish sauce and brown sugar and cook for two minutes. Pour in the beaten eggs and mix through the noodles until just cooked.", "Tumble the noodles out onto warmed serving plates and serve garnished with the coriander leaves, lime wedges, toasted sesame seeds, and the remaining spring onions and bean sprouts."]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_pad_thai_38349", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pad_thai_38349_16x9.jpg", "ingredients": ["250g/9oz flat rice noodles", "3 garlic cloves, roughly chopped", "1 handful fresh coriander, chopped, leaves and stalks seperated", "1 red chilli, seeds removed, roughly chopped", "2 limes, juice and zest", "2 tbsp sunflower oil", "1 cooked chicken breast, skin removed and thinly sliced", "6 spring onions, thinly sliced", "100g/3½oz bean sprouts", "3 tbsp fish sauce", "1 tbsp soft light brown sugar", "2 large free-range eggs, beaten", "1 handful salted peanuts, roughly chopped, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the noodles according to the packet instructions, then drain and set aside. ", "In a pestle and mortar, grind the garlic, coriander stalks, chilli and lime zest to a paste. ", "Heat the oil in a wok or a large frying pan until just at smoking point. Add the paste and fry for 1 minute, or until aromatic. Add the chicken, half the spring onions and half the bean sprouts and cook for 2 minutes, stirring well to coat everything in the paste.", "Add the drained noodles and mix well. Stir in the lime juice, fish sauce and sugar and cook for 2 minutes. ", "Pour in the egg and mix until just cooked. Serve the pad Thai with the coriander leaves, lime wedges, peanuts and remaining spring onions and bean sprouts."]}, {"isVegetarian": false, "title": "Pad Thai salad", "url": "www_bbc_co_uk_food_recipes_pad_thai_salad_01326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz medium rice noodles", "3 Thai shallots, roughly chopped", "2 garlic cloves, roughly chopped", "2 tbsp fresh coriander root", "1 tsp chilli powder", "50ml/1¾oz sunflower oil", "200g/7oz minced chicken", "50g/1¾oz dried shrimps", "4 spring onions, finely chopped", "150g/5½oz bean sprouts", "25ml/2 tbsp soy sauce", "25ml/2 tbsp oyster sauce ", "2 medium free-range eggs", "3 limes, juice only", "10 leaves Pak chee laos (dill)", "75g/2½oz roasted peanuts, roughly chopped", "100g/3½oz beansprouts", "4 spring onions, green part only, finely chopped", "1 red chilli, julienned", "fresh coriander, picked", "1 tbsp pickled turnip, shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the noodles in a large, heatproof bowl and pour over boiling water until they are submerged. Leave for 2–3 minutes, then drain well and place in cold water to cool.", "Grind the shallots, garlic, coriander root and chilli powder in a mortar, adding a touch of water to bring it to a paste.", "Heat the oil in a large frying pan, add the chicken and cook until brown. Add the shrimps, spring onions and beansprouts and cook for a further minute.", "Stir in the soy sauce and oyster sauce and cook for another minute.", "Add the drained noodles, eggs, lime juice and leaves. Toss gently until the eggs are cooked.", "To serve, place the pad Thai salad into a large serving bowl and top with all the garnishes."]}, {"isVegetarian": true, "title": "Padron peppers", "url": "www_bbc_co_uk_food_recipes_padron_peppers_93262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive or vegetable oil", "150g/5½oz padron peppers", "flaky sea salt", "2 tbsp extra virgin olive oil"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a large (preferably cast iron) frying pan over a high heat. When the air above the oil starts to shimmer and the pan is too hot to comfortably hold your hand over, add the padron peppers.", "Cook on one side for 1 minute, or until the skins to start to blacken and blister, then turn over. ", "Cook for a further minute then continue to cook, shaking the pan regularly, for another 2–3 minutes, or until the peppers are blistered all over but have softened to the point that they are just tender.", "Remove from the pan and drizzle over the extra virgin olive oil. Sprinkle over a generous pinch of flaky sea salt. Serve immediately or at room temperature. "]}, {"isVegetarian": false, "title": "Pad Thai", "url": "www_bbc_co_uk_food_recipes_padthai_67953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/padthai_67953_16x9.jpg", "ingredients": ["1 tbsp dried shrimps (optional)", "100g dried rice stick noodles", "3 tbsp vegetable oil", "2 eggs, lightly beaten", "2 garlic cloves, smashed", "200g small fresh prawns, peeled", "100g bean sprouts, rinsed", "2 spring onion greens, chopped into 3cm/1in lengths", "3 tbsp Thai fish sauce (nam pla)", "1 tbsp tomato ketchup", "2 tbsp lime juice", "½ tsp dried chilli flakes or cayenne", "1 tbsp palm or brown sugar", "2 tbsp roasted peanuts, lightly crushed", "2 tbsp coriander sprigs", "1 lime, quartered"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Grind the dried shrimps to a fluffy powder in an electric coffee grinder (you can clean out the grinder by whizzing raw rice in it).", "Cover the noodles with boiling water and leave for 15 minutes or until al dente.  Rinse in cold water and drain well, then use 1 tsp of oil to coat your hands and run them through the noodles to help prevent sticking.", "To make the omelette, heat 1 tbsp of the oil in a wok and swirl to coat the surface. Pour in the beaten eggs and swirl to make a very thin omelette. Run a knife around the edge, turn out, slice into strips and set aside.", "To cook the noodles, add remaining oil to the wok and heat. Add the garlic and the prawns and toss over high heat. Set the prawns aside.", "In turn, add the noodles, omelette strips, bean sprouts, spring onions, shrimp powder, fish sauce, ketchup, lime juice, chilli and sugar, tossing constantly over high heat.", "To serve, scatter with crushed peanuts, coriander leaves and quartered limes."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_67269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 chicken breasts, cut into 8 pieces", "4 raw king prawns, shell and head on", "20 mussels, cleaned", "1 garlic clove, roughly chopped", "3 tomatoes, blanched, peeled, seeded and roughly chopped", "200g/7oz paella rice ", "a pinch of saffron", "1 litre/1¾ pints chicken stock, boiling", "8 small cherry tomatoes", "110g/4oz broad beans, fresh or frozen"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a paella pan, heat the olive oil and fry the chicken pieces for 1-2 minutes.", "Add the prawns, then stir; add the mussels and  stir again, then add the garlic and tomatoes. Fry for a couple more minutes.", "Sprinkle in the rice. NOTE: Do not stir the ingredients, just shake them.", "Add a good pinch of saffron, and pour on up to 1 litre/1¾ pints of boiling chicken stock (about 1cm/½in above the level of the rice).", "Finally add the small cherry tomatoes and broad beans and season and simmer for 20 minutes.", "Serve with a rocket salad and crusty bread."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_89059", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz olive oil", "175g/6oz chorizo cut into 5mm/¼inch slices", "8 chicken thighs, de-boned, cut in half, rolled in plain flour", "1kg/2lb 4oz mussels, cleaned and debearded", "1 large Spanish onion, finely chopped", "3 cloves garlic, chopped", "½ tsp dried red chilli flakes", "1 red pepper, chopped", "400g/14oz paella rice (such as calasparra), rinsed and drained", "3 bay leaves", "1 tsp smoked paprika", "1 tsp saffron threads, toasted in a dry frying pan for 1-2 minutes", "125ml/4fl oz white wine", "1 tbsp lemon juice", "2.8 litres/5 pints chicken stock made from mussel cooking broth + water and a chicken stock cube", "115g/4½oz frozen peas, thawed", "18 small fresh clams, cleaned (discard any with broken shells or that do not close when firmly tapped)", "4 large tomatoes, de-seeded and chopped", "5 tbsp chopped flatleaf parsley", "1 lemon, zest only", "55g/2oz unsalted butter", "12 raw king prawns, in their shells", "450g/1lb squid, cleaned and cut into small pieces", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the olive oil in a paella dish or large heavy-based pan over a medium heat, add the chorizo and fry for 2-3 minutes, then remove and set aside.", "Add the chicken pieces to the same pan and cook for 2-3 minutes until the skin is browned. Remove and set aside.", "Place the mussels into a pan of boiling water, cover and boil until they open. Discard any that do not open. Strain and reserve the mussels and the broth.", "Add half the remaining olive oil to the paella pan and fry the onion, two of the cloves garlic, the chilli flakes and the red pepper. Cook slowly until the onion has softened but not browned, about eight minutes.", "Add the rice to the pan, stirring well to coat it in the oil, for two minutes, then add the bay leaves, paprika, the toasted saffron, white wine, lemon juice and prepared stock. Cook gently for five minutes.", "Add the fried chicken and chorizo, cover with a piece of dampened greaseproof paper and simmer gently for ten minutes.", "Stir in the peas and add the clams. Cover and simmer until all the clams have opened, about five minutes (discard any clams that have not opened).", "Remove the greaseproof paper from the pan and stir in the tomatoes, parsley, lemon zest and butter.", "Add the remaining olive oil to a separate frying pan over a medium-high heat. Add the remaining clove of garlic and the prawns and fry for 2-3 minutes, adding the squid for the last minute. Season to taste with salt and freshly ground black pepper and add to the paella. Serve immediately."]}, {"isVegetarian": true, "title": "Pain au chocolat blanc with raspberries and cream cheese", "url": "www_bbc_co_uk_food_recipes_pain_au_chocolat_blanc_37035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz full-fat milk ", "500g/1lb 2oz strong white flour ", "2 tsp fast-action yeast ", "80g/3oz caster sugar ", "2 medium free-range eggs ", "2 tsp fine sea salt ", "250g unsalted butter, chilled, in a block ", "120g/4¼oz white chocolate, chopped ", "150g/5½oz full fat cream cheese", "1 lemon, zest only", "200g/7oz raspberries", "1 large free-range eggs, beaten, for glazing"], "serves": "Makes 12 pastries", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough, warm the milk and 90ml/3fl oz water in a small saucepan until lukewarm. ", "Place all the other ingredients, except the butter, in the bowl of a freestanding mixer with a dough hook attachment, making sure the yeast doesn’t touch the salt. Add three-quarters of the milk and water mixture. ", "Start the mixer on a low speed until all the ingredients are incorporated. Add a bit more liquid if the dough seems too dry; you want a slightly sticky dough. Increase the speed and mix for seven minutes. ", "Spread the dough out onto a baking tray lined with baking parchment. Cover with cling film and place in the freezer to cool. ", "Using a rolling pin, flatten the butter out between two pieces of baking parchment into a rectangle 33x19cm/13x7½in and place in the freezer. ", "After 15 minutes remove the dough from the freezer and roll it out to a rectangle 50x20cm/19½x8in. With a short edge towards you place the flattened butter on the lower two-thirds of the dough. ", "Fold the top third of dough over the butter and then fold the bottom third upwards so all the butter is encased. Press the edges of the dough firmly together. ", "Turn the block of dough 90 degrees and roll out to 50x20cm/19½x8in. Fold the top third down and the bottom third up and place back in freezer for 15 minutes. ", "Repeat the rolling and folding twice more, placing the dough in the freezer for 15 minutes in between.", "Cut the pastry in half and roll out one half on a well-floured work surface to a 42x20cm/16½x8in rectangle.", "For the filling, with the long edge of the dough towards you, place a 1cm/½in row of white chocolate right across the dough about 2.5cm/1in away from the edge. Roll up the bottom edge of the dough to cover the chocolate. ", "Mix together the cream cheese and lemon zest in a bowl until smooth and airy. ", "Place the cream cheese mixture in a piping bag fitted with a 7mm nozzle and pipe two rows right across the dough just above the encased chocolate. Place a row of raspberries on top of the cream cheese. Roll the dough again to encase the filling and trim off any excess dough. ", "Cut the roll of dough into six even pieces, each one 7cm/2¾in long. Place each one on a baking tray lined with non-stick baking paper. ", "Repeat the filling process for the second half of the dough so you end up with 12 pastries. Cover the pastries with cling film and allow to prove at room temperature for 40 minutes. ", "Preheat the oven to 200C/400F/Gas 6. (Do not use a fan-assisted oven.)", "Brush the pastries with the beaten egg. Bake for 25 minutes, or until well-risen and golden-brown. Remove from the oven and allow to cool slightly before transferring to a cooling rack."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_85931", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 shallot, chopped", "1 garlic clove, chopped", "½ tsp smoked paprika", "½ red pepper, chopped", "400g/14oz risotto rice (such as arborio or carnaroli)", "pinch saffron strands", "150ml/5½fl oz white wine", "500ml/18fl oz hot vegetable stock", "4 raw king prawns, shells removed, cleaned", "1 squid, cleaned and cut into rings", "handful fresh parsley, chopped", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan and gently fry the shallot, garlic, paprika and red pepper until softened.", "Add the rice and stir until coated in oil.", "Add the saffron and wine and simmer until the liquid has reduced by half.", "Add the stock and simmer for ten minutes, or until most of the stock has been absorbed.", "Add the prawns and squid rings and cook for a further 3-4 minutes, or until the rice is tender and the prawns and squid are cooked through.", "Sprinkle over the parsley, season, to taste, with salt and freshly ground black pepper and stir well.", "To serve, place servings of the paella onto plates and garnish with lemon wedges."]}, {"isVegetarian": true, "title": "Pain au lait", "url": "www_bbc_co_uk_food_recipes_pain_au_lait_22273", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz lukewarm full-fat milk", "5g fast-action yeast", "275g/9¾oz plain flour", "75g/2½oz strong bread flour", "45g/1¾oz sugar", "1 tsp salt", "75g/2½oz unsalted butter, softened", "1 large free-range egg, beaten, plus extra for glazing", "nibbed sugar (pearl sugar), for sprinkling"], "serves": "Makes 12 buns", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["In a small bowl, mix the milk and yeast together, and set aside for five minutes.", "In a large bowl, mix the flours, sugar and salt until thoroughly combined.", "Pour in the yeast and milk mixture, softened butter and beaten egg and stir to combine.", "Turn out onto a lightly floured work surface and knead (use a dough scraper) for 10 minutes, or until smooth and no longer sticky.", "Put the dough into a clean bowl, cover with a clean tea towel and leave to prove for 30 minutes.  ", "Preheat the oven to 210C/410F/Gas 6½.  ", "Weigh the dough and cut into 12 equal pieces.  Roll into balls and leave to rest, covered, for 10 minutes.  ", "Using a rolling pin, roll each dough ball out into an 8cm/3in circle.  Fold one-third of the circle into the centre and press with your thumb to stick it down. Then fold the opposite third of the circle into the centre. Fold this shape in half lengthwise to form a cylinder. Roll gently to seal the sides together, pressing slightly harder at the ends to make them slightly pointed. Place the buns, seam-side down, onto baking trays lined with baking parchment.  ", "Cover the dough with cling film and allow to rise for 30 minutes. ", "Brush each of the buns with egg and, using scissors, snip a zig-zag shape onto the top. Sprinkle with nibbed sugar and bake for 10-12 minutes."]}, {"isVegetarian": false, "title": "Pain perdu, caramelised pineapple and candy floss", "url": "www_bbc_co_uk_food_recipes_pain_perdu_caramelised_35024", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "30g/1oz caster sugar", "250ml/9fl oz milk", "1 vanilla pod, split in half lengthways and seeds scraped out", "2 tbsp rum, plus extra to flambé", "2 thick slices brioche", "100g/3½oz brown sugar", "½ pineapple, peeled and cut into cubes", "60g/2¼oz butter ", "200ml/7fl oz whipping cream", "50g/1¾oz icing sugar", "1 vanilla pod, split in half lengthways and seeds scraped out", "candy floss (optional), to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pain perdu and pineapple, mix the eggs, caster sugar, milk, vanilla and rum in a large bowl. Add the brioche and leave to soak.", "Heat the sugar in a pan until melted and slightly coloured.  Add the pineapple and a little extra rum. Allow to heat briefly, then slowly tilt the pan towards the flame, or light with a match. Let the flames flare up then die down (CAUTION: be careful of flames and keep your face away from the pan).  Add the butter and cook for 2 minutes.", "For the topping, whip the cream, icing sugar and vanilla together until soft peaks form when the whisk is removed.", "Place the soaked brioche in a hot frying pan and cook for 2 minutes on each side until golden-brown.", "Put the brioche in serving dishes, cover with the caramelised pineapple, add a spoonful of the whipped cream and cover with candy floss."]}, {"isVegetarian": true, "title": "Pain perdu with roasted fruits and glazed almond sabayon", "url": "www_bbc_co_uk_food_recipes_pain_perdu_with_roasted_54564", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 orange, juice only", "1 vanilla pod, seeds only", "150g/5½oz caster sugar ", "2 white peaches, pitted and cut into wedges", "150g/5½oz raspberries ", "3 free-range eggs and 1 free-range yolk, beaten", "75g/2½oz salted butter", "2 slices fruit bread or brioche ", "1–2 drops almond essence ", "4 free-range egg yolks ", "50g/1¾oz caster sugar ", "3 tbsp dark rum"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the orange juice, half the vanilla pod and most of the sugar in a saucepan to make a syrup. Add the peaches, remove from the heat after a few minutes and add the raspberries. Set aside. ", "To make the sabayon, place a glass bowl over a saucepan of barely simmering water. Add all the ingredients and whisk continuously, until pale and thick. Remove the bowl from the heat and whisk the mixture until cool.", "To make the pain perdu, mix the eggs and egg yolk with the other half of the vanilla seeds. Add the bread slices and soak for 2 minutes. ", "Melt the butter in a large frying pan. When foaming, add the soaked bread and fry until golden on both sides. Sprinkle with sugar.", "Top the pain perdu with the fruits and spoon over the sabayon. Glaze with a blow torch and serve. "]}, {"isVegetarian": false, "title": "Pain perdu with sticky apricots", "url": "www_bbc_co_uk_food_recipes_painperduwithstickya_86043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "5 tbsp/75ml double cream", "1 tbsp caster sugar", "1 reday-made teacake, sliced horizontally into three ", "1 tbsp butter", "110g/4oz tinned apricots, drained", "3 tbsp marmalade ", "1 tbsp chopped fresh mint"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Whisk the eggs, cream and sugar together to form a batter then dip the teacake pieces into the batter until well coated.", "Heat the butter in a non-stick frying pan and fry the bread on each side for 2-3 minutes, or until golden brown on both sides.", "Place the apricots and marmalade into a separate frying pan and warm until the jam melts. Stir in the mint.", "To serve stack the fried teacake slices on a plate and spoon over the sticky apricots."]}, {"isVegetarian": true, "title": "Pakora with mango chutney", "url": "www_bbc_co_uk_food_recipes_pakorawithmangochutn_92807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "2.5cm/1in piece fresh root ginger, peeled, minced", "1 small red chilli, chopped", "1 lime, zest and juice", "1 garlic clove, peeled, crushed", "pinch ground cinnamon ", "pinch ground coriander", "225g/8oz soft light brown sugar", "225g/8fl oz cider vinegar", "3 mangoes, stones removed, peeled, diced ", "2 onions, peeled, sliced", "1 head broccoli, cut into florets", "½ cauliflower head, cut into florets", "200g/7oz gram flour (chickpea flour)", "1 small red chilli, finely chopped", "1 tsp ground turmeric", "1 tsp cayenne pepper", "salt and freshly ground black pepper", "100-175ml/3½-6fl oz ice cold water", "vegetable oil, for deep frying", "plain yoghurt, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat two tablespoons of vegetable oil in a frying pan over a medium heat. Add the ginger, chilli, lime zest and garlic and fry for 3-4 minutes, or until softened.", "Stir in the ground cinnamon, ground coriander, sugar, cider vinegar, lime juice and mangoes. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 20-30 minutes, or until the mixture has reduced and has the consistency of jam. (NB: The chutney makes double the amount needed for this recipe. The remaining chutney can be kept in sterilised jars in the fridge for up to 3 weeks.)", "Meanwhile, for the pakora, boil the onion slices in a pan of salted water for 2-3 minutes. Add the broccoli and cauliflower florets and continue to boil for 1-2 minutes, or until the onions are tender. Drain well and set aside.", "For the batter, mix together the flour, chilli, ground turmeric, cayenne pepper and seasoning in a bowl until well combined. Gradually add the water in a thin stream, whisking continuously, until a thick batter forms. (NB: You may not need to use all of the water.)", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the blanched cauliflower florets and broccoli into the batter, then lower spoonfuls of the sliced onion into the batter.", "Carefully lower the battered vegetables into the hot oil in batches and fry for 4-5 minutes, or until crisp and golden-brown. Remove from the heat using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining battered vegetables.", "To serve, divide the pakora among four serving baskets. Serve the yoghurt (if using) and mango chutney in dipping bowls alongside."]}, {"isVegetarian": true, "title": "Palmiers", "url": "www_bbc_co_uk_food_recipes_palmiers_83940", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz ready-rolled puff pastry", "25g/1oz caster sugar", "1 tsp ground cinnamon", "50ml/2fl oz double cream, whipped ", "1 orange, cut into wedges, to serve"], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Unroll the pastry and brush with water. Mix the sugar and cinnamon together in a bowl, then sprinkle over the pastry to lightly cover. Fold in both of the long ends of the pastry so that they meet in the middle. Brush with more water and sprinkle with more of the sugar mixture. Fold the pastry over again and slice 1cm/½in slices and place on a baking tray.", "Place in the oven and bake for ten minutes, or until cooked through. Serve with whipped cream and oranges."]}, {"isVegetarian": true, "title": "Pampushki (Baltic buns)", "url": "www_bbc_co_uk_food_recipes_pampushki_baltic_buns_10557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz white bread flour", "150g/5½oz rye flour", "7g dry instant yeast (1 sachet)", "1 tsp sugar", "1 tsp salt", "1 tbsp oil or butter", "300ml/10 fl oz milk, warmed", "2 garlic cloves, crushed", "25g/1oz butter or oil", "salt"], "serves": "Makes 8 bread rolls", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["If using a stand mixer, attach the dough hook. Put all the dry ingredients in, mixing in the yeast thoroughly before you add the salt, then add the butter. Start the motor running and gradually add all the milk until you have a dough. If your dough is still a little dry add a little water. Knead with the dough hook for 5 minutes. Cover with a damp cloth and leave somewhere warm to rise until doubled in size, this will take at least an hour.", "If you are doing this by hand, put the dry ingredients in a large bowl and mix. Add the butter and combine.  Make a well in the centre and gradually incorporate all of the milk, taking flour from the sides as you go. When you have something resembling a dough, knead until smooth. Leave to rise as before.", "When your bread has risen, knock back the dough, and cut it into 8 pieces. Knead each piece and form it into a tight ball (by tucking the dough under as you turn it). Dust a baking tray with a little flour and arrange the dough balls on the tray – one in the middle, the others placed around it, placed slightly apart – like a flower. Cover the bread rolls with a damp cloth and leave to rise again. ", "Preheat the oven to its highest setting.", "When the bread rolls are well risen and are just touching, they are ready to bake. Put in the oven and immediately reduce the temperature to 200C/180C Fan/Gas 6. Bake for around 20 minutes.", "Meanwhile, make the topping. Mash the garlic, butter and salt together. Put in a frying pan and melt very gently – you don’t want either the butter or the garlic to brown. When the bread rolls are out of the oven, spread the mixture over the rolls while they are still hot."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_92222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil, plus extra for drizzling", "2 onions, peeled, one sliced and the other roughly chopped ", "3 garlic cloves, peeled, two finely chopped and the third finely sliced", "1 large red pepper, seeds removed, chopped", "4 large tomatoes, roughly chopped", "3 tbsp chopped fresh flatleaf parsley", "2 sprigs fresh oregano, chopped", "6 skinless and boneless chicken thighs, cut into bite-sized pieces", "sea salt and freshly ground black pepper", "1 tsp smoked paprika", "125g/4½oz cooking chorizo, chopped", "400g/14oz Spanish short-grain rice, such as Calasparra", "pinch saffron strands", "150ml/5fl oz dry sherry ", "1 litre/2 pints hot vegetable stock", "200g/7oz fresh peas ", "1 preserved lemon, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the olive oil in a large frying pan or paella pan. Add the sliced onion, the two cloves of finely chopped garlic and the chopped red pepper. Gently fry for 5-6 minutes over a medium heat, or until the onions are softened but not coloured. ", "Place the tomatoes, parsley and oregano into a bowl and mix well to combine. ", "Season the chicken thighs with sea salt and freshly ground black pepper and rub with the smoked paprika. Heat the remaining olive oil in a frying pan and fry the chicken for 2-3 minutes on each side, or until golden-brown all over. Transfer the chicken to a bowl, along with any pan juices. ", "Return the paella pan to the heat and add the chopped onion, the finely sliced garlic, and the chopped chorizo. Cook for 3-4 minutes, or until the chorizo is golden-brown. ", "Add the rice to the pan along with the saffron and stir to coat in the oil, then add the chicken pieces. Pour in the sherry and stir once, then allow to bubble for 2-3 minutes until most of the liquid has evaporated. Pour in the vegetable stock and turn down the heat to a simmer. Cover the pan with a lid and cook for 20 minutes, stirring once or twice during cooking, until all of the stock is absorbed and the rice is tender. ", "Sprinkle the fresh peas over the paella, then top with the prepared tomatoes, oregano and parsley. Turn the heat off and cover with a lid for 2-3 minutes.", "To serve, fluff up the paella with a fork and spoon into serving bowls, with a wedge of preserved lemon to garnish."]}, {"isVegetarian": false, "title": "Paella", "url": "www_bbc_co_uk_food_recipes_paella_7100", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/paella_7100_16x9.jpg", "ingredients": ["170g/6oz chorizo, cut into thin slices", "110g/4oz pancetta, cut into small dice", "2 cloves garlic finely chopped", "1 large Spanish onion, finely diced", "1 red pepper, diced", "1 tsp soft thyme leaves", "¼ tsp dried red chilli flakes", "570ml/1pint calasparra (Spanish short-grain) rice", "1 tsp paprika", "125ml/4fl oz dry white wine", "1.2 litres/2 pints chicken stock, heated with ¼ tsp saffron strands", "8 chicken thighs, each chopped in half and browned", "18 small clams, cleaned", "110g/4oz fresh or frozen peas", "4 large tomatoes, de-seeded and diced", "50ml/2fl oz good olive oil", "1 head garlic, cloves separated and peeled", "12 jumbo raw prawns, in shells", "450g/1lb squid, cleaned and chopped into bite-sized pieces", "5 tbsp chopped flatleaf parsley", "Salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Heat half the olive oil in a paella dish or heavy-based saucepan. Add the chorizo and pancetta and fry until crisp. Add the garlic, onion and pepper and heat until softened. Add the thyme, chilli flakes and calasparra rice, and stir until all the grains of rice are nicely coated and glossy. Now add the paprika and dry white wine and when it is bubbling, pour in the hot chicken stock, add the chicken thighs and cook for 5-10 minutes.", "Now place the clams into the dish with the join facing down so that the edges open outwards. Sprinkle in the peas and chopped tomatoes and continue to cook gently for another 10 minutes.", "Meanwhile, heat the remaining oil with the garlic cloves in a separate pan and add the prawns. Fry quickly for a minute or two then add them to the paella. Now do the same with the squid and add them to the paella too.", "Scatter the chopped parsley over the paella and serve immediately."]}, {"isVegetarian": false, "title": "Pan-fried hake on the bone with Arbequina olive oil mash, surf clams, chorizo and flat parsley", "url": "www_bbc_co_uk_food_recipes_pan-_fried_hake_on_the_33468", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large potato, preferably Desirée variety, peeled and evenly diced", "10g/¼oz unsalted butter", "5 tbsp double cream", "sea salt and freshly ground black pepper", "125ml/4fl oz Arbequina olive oil", "2 x trimmed and cleaned darnes of hake, about 200g/7oz each", "olive oil, for cooking", "125g/4½oz hot cooking chorizo, peeled and diced", "1 small banana shallot, peeled and diced", "16 surf clams, washed", "50ml/2fl oz manzanilla sherry", "50ml/2fl oz white wine", "25g/1oz unsalted butter", "1 sprig flat leaf parsley, leaves picked and chopped", "lemon juice, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the mash, place the potatoes in a pan of salted water and bring to the boil. Simmer until the potatoes are tender and then drain well and push through a ricer. ", "Return the potatoes to the pan over a low heat and then stir in the butter and cream. Season well with sea salt and freshly ground black pepper then slowly whisk in the olive oil until thoroughly combined. Set the pan aside in a warm place.", "For the hake, heat a non-stick pan over a high heat and add a splash of olive oil. Season the hake darnes with sea salt and freshly ground black pepper and place them in the pan. ", "Sear on one side for two minutes, turn onto the other side and add the chorizo, shallots and clams. ", "Cook for a further minute until the chorizo has started to release its oil and the clams have started to open. ", "Drain off a little of the oil then add the sherry and wine. Bring to the boil and reduce the sauce then turn the hake again and add the butter and parsley.", "Stir the sauce to emulsify it, scraping the sediment from the bottom of the pan to add extra flavour. The sauce should have a syrupy consistency and the hake cooked through – the flesh should be opaque when a small knife is inserted near the bone. Check the sauce for seasoning and add a squeeze of lemon juice.", "To serve, spoon some of the mash onto a serving plate, top with the hake, spoon over the sauce and scatter around the clams and chorizo. "]}, {"isVegetarian": false, "title": "Pan-fried balsamic pear salad with pancetta, gorgonzola and a warm honey dressing", "url": "www_bbc_co_uk_food_recipes_pan-fried_balsamic_pear_35881", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_balsamic_pear_35881_16x9.jpg", "ingredients": ["2 x 120g/4oz packets rocket", "handful pine nuts", "16 slices pancetta", "2 knobs of butter", "1 tsp olive oil", "4 pears, peeled, cored, quartered", "1 tsp honey, plus extra for the dressing", "1 tsp balsamic vinegar, plus 2 tbsp for the dressing", "½ tsp Dijon mustard", "150g/5oz gorgonzola, ripped into chunks", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Distribute the rocket evenly among four serving plates.", "Heat a frying pan and toast the pine nuts for three minutes, or until golden-brown. Remove the nuts from the frying pan.", "Heat the pancetta in a frying pan over a medium heat and cook until crispy. Remove and set aside to drain on kitchen paper.", "Place a knob of butter and the oil into a clean frying pan set over a low heat. Once the butter melts, add the pears, salt, pepper and honey. Turn up the heat and cook for a further five minutes.", "Add the balsamic vinegar and cook for another minute, then take the pan off the heat. Remove the pears from the pan, reserving any juice that may be left.", "Arrange the pears and pancetta on top of the rocket leaves so each person has four quarters each. ", "For the dressing, put the pan containing the pear juices back on the heat and add the remaining knob of butter, a dash of honey, the mustard, salt and pepper and the pine nuts. Cook the mixture until warmed through.", "Pour the dressing over the pears and the rocket. Scatter over the gorgonzola and serve."]}, {"isVegetarian": false, "title": "Fried bacon with poached egg and tomatoes", "url": "www_bbc_co_uk_food_recipes_pan-fried_bacon_with_76907", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_bacon_with_76907_16x9.jpg", "ingredients": ["1 tsp sunflower oil", "4 rashers of rindless smoked back bacon", "1 tsp white wine vinegar", "2 free-range very fresh eggs (fridge cold)", "8 cherry tomatoes, halved", "good handful of watercress", "drizzle of good-quality balsamic vinegar", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Brush a large non-stick frying pan with sunflower oil, using the tip of a pastry brush. Place the pan over a medium heat and add the bacon. Cook for 2 minutes until lightly browned, then turn and fry on the other side for another 3 minutes.", "While the bacon is cooking, half fill a medium non-stick saucepan with water, add the vinegar and bring to the boil. Turn the heat to low, so the water is only just bubbling. Crack the eggs into the water, one at a time, spacing them well apart. Cook for 2½ minutes. ", "The eggs should rise to the surface within a minute. If the egg white sticks to the bottom of the pan, lift it gently with a wooden spoon. Alternatively, you can use a hob-top egg poacher, lightly greased with sunflower oil.", "Add the tomatoes to the pan with the bacon and season with plenty of black pepper. Cook the tomatoes for about a minute until just beginning to soften, turning them once. ", "Put a small pile of watercress on each plate. Put some bacon and tomatoes on the plates and drizzle with a dash of balsamic vinegar. Take the eggs out of the water with a slotted spoon and place them on top. Season with a little more pepper and tuck in right away while it’s all lovely and hot."]}, {"isVegetarian": false, "title": "Pan-fried black pudding with scallops and ginger purée", "url": "www_bbc_co_uk_food_recipes_pan-fried_black_pudding_99293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz fresh root ginger, peeled and thinly sliced", "4 fresh curry leaves", "75g/2¾oz palm sugar", "50g/2oz tamarind paste", "pinch salt", "25g/1oz caster sugar", "1 apple, cut horizontally into 12 thin slices", "10g/½oz butter", "8 thin slices pancetta", "8 x 1cm/½in thick slices black pudding", "1 tsp olive oil", "4 large scallops with roe", "½ lemon, juice only", "4 tsp extra virgin olive oil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the ginger, curry leaves, palm sugar, tamarind and 500ml/18fl oz water to the boil in a large saucepan, then reduce the heat and simmer for 10 minutes. Remove from the heat and set aside to cool slightly, then blend to a fine purée in a food processor. Season with a pinch of salt. ", "Heat the caster sugar in a frying pan over a low to medium heat until melted and beginning to caramelise. Add the apple slices and cook in the caramelised sugar for a few seconds before adding the butter. When the butter has melted, add a splash of water to the pan and swirl the contents, without stirring, until the caramel is smooth and the apple slices are coated in caramel.", "Dry-fry the pancetta slices in a non-stick frying pan over a high heat, until crisp on both sides. Remove from the pan and set aside.", "Add the black pudding slices to the same pan and dry-fry for 30 seconds only on each side, until just crisp on the outside but still soft on the inside. Remove from the pan and set aside.", "Drizzle the scallops with a little of the oil, then add them to the same pan and fry for 1-1½ minutes on each side, or until golden-brown on both sides and just cooked through. Squeeze over the lemon juice then remove the scallops from the pan.", "To serve, cut the scallops in half widthways. Place one disc of caramelised apple into the centre of the serving plates. Top with a small spoonful of the spice purée, then a slice of black pudding, then half a scallop. Repeat the stacking process once more to create two towers on each plate. Drizzle a spoonful of spice purée around the edge of each plate, then top the towers with a couple of pieces of crispy pancetta and finish with a drizzle of extra virgin olive oil."]}, {"isVegetarian": false, "title": "Pan-fried calf’s liver, grilled baby leeks and creamed cabbage", "url": "www_bbc_co_uk_food_recipes_pan-fried_calfs_liver_78370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ savoy cabbage, shredded ", "3 tbsp olive oil ", "knob of butter", "½ onion, thinly sliced", "½ carrot, peeled and thinly sliced", "¼ celeriac, peeled and thinly sliced", "350ml/12fl oz double cream", "6 slices calf’s liver", "4 baby leeks, cut in half lengthways", "salt and freshly ground black pepper", "hot red wine gravy, to serve", "watercress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the cabbage in a large pan of salted water for 3 minutes then drain. ", "Heat 1 tablespoon of the oil and the butter in a frying pan and cook the onion until softened. Add the carrot and celeriac and cook for 2 minutes. Pour in the cream and season with salt and pepper. Add the cabbage to the pan and cook until the volume of the liquid has reduced by a third. ", "Meanwhile, heat 1 tablespoon of the oil in a frying pan and fry the liver slices for 1½ minutes on each side. Season with salt and pepper.", "Oil a griddle pan with the remaining oil and place over a high heat. Add the leeks and griddle until slightly charred. Season with salt and pepper.", "To serve, divide the cabbage between two serving plates. Add the liver and top with the leeks. Pour over the gravy and garnish with the watercress."]}, {"isVegetarian": false, "title": "Pan-fried chicken pie", "url": "www_bbc_co_uk_food_recipes_pan-fried_chicken_pie_32885", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_chicken_pie_32885_16x9.jpg", "ingredients": ["2 tbsp olive oil", "large knob of butter", "1 leek, thinly sliced", "4-5 spring onions, thinly chopped", "150g/5oz button mushrooms, thinly sliced", "225g/8oz boneless cooked chicken, shredded", "150g/5oz feta cheese, crumbled", "4 tbsp chopped dill", "4 tbsp chopped parsley", "4-6 tbsp double cream", "a little freshly ground nutmeg", "freshly ground black pepper and a little salt ", "olive oil, for brushing ", "200g/7oz filo pastry"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, heat the olive oil and butter in a pan and fry the leeks, spring onions and mushrooms until softened.", "Place in a large bowl with the cooked chicken, feta cheese, herbs and enough cream to make the mixture moist.", "Season the filling with lots of freshly ground black pepper and a little nutmeg, to taste. Try the filling and add a little salt if needed. Feta cheese is very salty so you might not need it.", "Brush the base of a frying pan with olive oil. Lay some large pieces of pastry over the pan so that it drapes over the sides and brush all over with olive oil, then spoon in half the filling.", "Rip a piece of pastry and lay on top of the filling to cover. Brush with olive oil and sprinkle with a little water.", "Spoon in the rest of the filling; place more pastry on top in the same way as before to make the top layer, brush with olive oil and sprinkle with water.", "Fold the pastry, hanging over the edges of the pan, back over the top to form a nice round pie. Brush again with olive oil and sprinkle lightly with water.", "Fry for 6-8 minutes on a low heat, checking all the time so it doesn’t go brown too fast. ", "Remove from the heat, turn over like a Spanish tortilla by placing a plate over the frying pan and quickly turning the pie upside-down on to the plate. Quickly slide it back into the pan and cook the other side for 6-8 minutes, or until golden-brown.", "Place on a round wooden board and cut into large wedges. Serve hot or cold with a green salad or vegetables. "]}, {"isVegetarian": false, "title": "Pan-fried cod with a parsley crust, sautéed girolles and vermouth sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_cod_with_a_42389", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "2 tbsp vermouth", "300ml/10½fl oz fish stock", "225ml/8fl oz double cream", "140g/5oz breadcrumbs", "55g/2oz fresh flatleaf parsley", "6 tbsp olive oil", "4 x 175g/6¼oz cod fillets, skin on", "25g/1oz unsalted butter", "100g/3½oz girolle mushrooms", "2 tbsp flatleaf parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the vermouth sauce, melt the butter in a frying pan and fry the shallots and garlic for 2-3 minutes. De-glaze the pan with the vermouth and cook until the volume of the liquid has reduced by half. Add the fish stock and cream and cook again until the volume of the liquid has reduced by half. ", "Blend the mixture in a blender and pass the sauce through a sieve.", "For the pan-fried cod with a parsley crust, preheat the grill to the highest setting.", "Blend the breadcrumbs, parsley and four tablespoons of the olive oil in a food processer  until well combined. ", "Roll the mixture out on a work surface and cut out four pieces the same size as the cod fillets.", "Meanwhile, heat the remaining olive oil in a frying pan and fry the cod, skin-side down, for 2-3 minutes.", "Remove the cod fillets from the pan, peel off the skin and place the parsley crust on top. ", "Grill the cod fillets for 2-3 minutes.", "For the sautéed girolles, melt the butter in a frying pan, fry the mushrooms for 2-3 minutes, then stir in the chopped parsley.", "To serve, spoon the mushrooms around each of four serving plates, place a cod fillet into the centre of each plate and spoon around the vermouth sauce."]}, {"isVegetarian": false, "title": "Pan-fried Dover sole with a shrimp and caper butter sauce and wilted spinach", "url": "www_bbc_co_uk_food_recipes_pan-fried_dover_sole_20729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole Dover sole, filleted and pin boned ", "25g/1oz plain flour, seasoned with salt and pepper", "25ml/1fl oz olive oil ", "50g/1¾oz unsalted butter", "1 shallot, finely chopped", "1 lemon, juice only", "10g/ baby capers", "2 tsp gentleman’s relish", "2 tbsp finely chopped parsley", "100g/3½oz brown shrimps", "50g/1¾oz unsalted butter", "50g/1¾oz baby spinach", "pinch freshly grated nutmeg", "1 bunch fresh watercress", "1 lemon, peeled with spoon to remove all the pith and finely sliced to resemble flowers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Dover sole, dust the fish in the seasoned flour. Heat a large frying pan and add the oil. Once hot, add the fish skin-side down and cook for a couple of minutes. Turn over and cook for a further minute.", "Remove the fish from the pan and set aside to rest.", "Heat the butter in a separate frying pan, add the shallots and fry for a few minutes. One it has reached the nut brown stage (or beurre noisette), add the lemon juice, capers, gentleman’s relish, parsley and shrimps and cook for a couple of minutes.", "For the wilted spinach, in the same pan you fried your fish, heat the butter, add the spinach and a tablespoon of water and cook until wilted. Finish with a grating of fresh nutmeg.", "To serve, place some spinach in the centre of each serving plate and top with the fish. Spoon the sauce over and around the fish. Garnish with watercress and lemon flowers."]}, {"isVegetarian": false, "title": "Pan-fried duck breast with a Moroccan cauliflower salad, duck scratchings and a beetroot dressing", "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_breast_41664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["small bunch mixed baby beetroot (red, candy, striped), trimmed", "2 thyme sprigs", "2 duck breasts, skin removed and reserved", "2 tbsp olive oil, plus extra for drizzling ", "25g/1oz butter", "1 white cauliflower, half broken into florets, half grated ", "200ml/7fl oz milk ", "3 tbsp sesame seeds ", "1 tbsp black onion seeds", "1 tsp cumin seeds", "1 tsp crushed coriander seeds", "4 crushed cardamom pods", "half purple cauliflower, broken into florets", "half Romanseco cauliflower, broken into florets", "3 garlic cloves, finely chopped", "1 red chilli", "2 cooked red beetroots", "1 cooked yellow beetroot, peeled", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Rub the baby beetroots with olive oil and sprinkle with thyme, salt and pepper. Cover with foil and cook for about 2 hours, or until soft. ", "Meanwhile, carefully remove the skin from the duck breasts, wrap in cling film and freeze until solid. Shred as finely as possible. ", "Once the beets are cool enough to handle, peel and cut into quarters. ", "Heat a dash oil in a frying pan over a medium heat and cook the duck breasts for 10–12 minutes until medium rare. Remove and set aside to rest. ", "Add the duck skin to the pan and fry until crisp. Remove and drain on kitchen paper. When cool enough to handle, slice into strips.", "Melt the butter in a frying pan over a medium heat. Add the grated cauliflower, garlic and chilli and gently cook, without colouring, for 5–8 minutes. Add the milk and cook until soft. Pour into a blender or food processor and blend into a purée. Pass through a fine sieve and set aside. ", "Dry fry the seeds and spices in a frying pan until toasted and aromatic. Bash in a pestle and mortar.", "Blanch the cauliflower florets in boiling water for 3 minutes, drain and toss in the toasted spices, chilli and garlic. Set aside. ", "Blitz the cooked red beetroots in a blender until smooth. ", "Place the cauliflower purée in the centre of two plates and scatter over the cauliflower florets and baby beetroot. Slice the duck on a diagonal into strips and serve between the two plates. Scatter the duck scratchings on top. Spoon over the beetroot dressing, finish with the yellow beetroot slices and serve. "]}, {"isVegetarian": false, "title": "Pan-fried monkfish with wild garlic and fennel", "url": "www_bbc_co_uk_food_recipes_pan-fried_fillet_of_83911", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 large garlic cloves (new season if possible), sliced", "100g/3½oz unsalted butter", "450g/1lb fennel bulb, thinly sliced", "600ml/20fl oz fish stock", "salt and freshly ground black pepper", "100g/3½oz semolina", "15g/½oz sprigs wild fennel leaves", "4 x 225g/8oz pieces prepared monkfish fillet", "4 tbsp sunflower oil", "2 tsp lemon juice", "splash aniseed liqueur", "20g/¾oz wild garlic leaves, sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.  ", "Cut 13 of the garlic cloves lengthways into long thin pieces.  Melt half of the butter in a pan, add the garlic and sliced fennel and fry over a medium heat until lightly browned.  Add half of the fish stock and salt and pepper, and simmer for 15 minutes, or until the fennel is tender.", "Meanwhile slice the remaining three cloves of garlic and put into a food processor with the semolina and all but one sprig of fennel leaves. Blend until you have an aromatic pale-green powder. ", "Coat the pieces of monkfish in the semolina mixture.  Heat the oil in an ovenproof frying pan, add a small knob of the butter and the monkfish pieces and fry over a moderate heat, turning now and then, until they are golden-brown all over.  Transfer the pan to the oven and cook the monkfish for a further 10 minutes.", "Remove the pan from the oven and lift the fillets onto a chopping board. Slice diagonally into thick slices, keeping each piece in shape. Transfer to a plate and keep warm.", "Finely chop the remaining wild fennel herb. Add it to the pan in which the monkfish was cooked along with the cooked fennel mixture, lemon juice, liqueur, and wild garlic.  ", "Simmer rapidly until slightly reduced in volume, then add the remaining butter and simmer until it has blended in to make a rich sauce.  Adjust the seasoning if necessary.  Lift the fish onto four warmed plates and spoon some of the sauce around each piece."]}, {"isVegetarian": false, "title": "Pan-fried duck with sherry, raisin and pine nut sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_duck_with_90914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz raisins", "300ml/10fl oz oloroso sherry", "4 x 175-200g/6-7oz duck breasts", "25g/1oz caster sugar", "2 tsp sherry vinegar", "1 tbsp red wine vinegar", "¾ tsp arrowroot", "25g/1oz pine nuts, toasted", "olive oil, for frying", "1 large pumpkin, thinly sliced, skin on", "1 banana shallot, finely diced", "75g/2¾oz girolles", "4 sprigs thyme", "watercress sprigs, to garnish", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the raisins in the sherry overnight. Place the duck breasts on a plate and cover them loosely with a sheet of greaseproof paper. Leave them in the fridge overnight (this will help dry out the skin and make it extra crispy).", "When ready to start cooking, put the sugar and sherry vinegar in a small pan with 1 tablespoon cold water and cook over a low heat until the sugar has completely dissolved. Increase the heat and boil vigorously until the syrup turns into a deep amber-coloured caramel (CAUTION: boiling sugar is extremely hot). ", "Remove the pan from the heat and add the red wine vinegar (take care as it will bubble quite energetically). Return the pan to the heat, add the soaked raisins and the sherry. Leave to simmer gently for 20 minutes. ", "Mix the arrowroot with 2 tablespoons water, stir into the sauce and simmer for 1 minute, then add the pine nuts. Season to taste and keep warm over a low heat.", "Lightly score the skin of each duck breast in a diamond patter, taking care not to cut down into the flesh. Season the meat with salt and pepper and the skin with just salt. ", "Heat a dry, heavy-based frying pan over a high heat. Add the duck breasts, skin-side down, lower the heat to medium and cook for 3-4 minutes until the skin is crisp and golden brown. Turn the breasts over and cook them for 5 minutes if you like them pink, or slightly longer if you like them a little more cooked. Remove the breasts from the pan and place on a board. Leave to rest for 5 minutes. ", "Meanwhile, using the same pan that you cooked the duck in, add a little olive oil and fry the sliced pumpkin for a few minutes. ", "Heat a little olive oil in a small frying pan and add the shallot. As they start to turn colour, add the girolles and thyme, fry for no more than 1 minute. Season to taste. ", "Place the pumpkin on warm serving plates. Slice each duck breast diagonally into long thin slices and place alongside the pumpkin. Add some of the girolles around the side of the plate, spoon the sauce over and garnish with the watercress sprigs. "]}, {"isVegetarian": false, "title": "Pan-fried gnocchi with broccoli pesto and grilled veg", "url": "www_bbc_co_uk_food_recipes_pan-fried_gnocchi_with_36887", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_gnocchi_with_36887_16x9.jpg", "ingredients": ["350g/12oz broccoli (about 1 head), roughly chopped", "100ml/3½fl oz olive oil, plus extra to loosen if desired", "50-100g/2-3½oz toasted pine nuts, to taste", "1 garlic clove, roughly chopped", "1 green chilli, finely chopped", "50g/1¾oz parmesan cheese (or vegetarian alternative), freshly grated", "salt and pepper, to taste", "300g/10½oz green vegetables such as asparagus, purple sprouting broccoli, courgettes and baby leeks", "olive oil, for drizzling and frying", "1 pack shop-bought gnocchi", "3 slices pancetta, baked or grilled, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Blanch the broccoli in boiling salted water for 3-4 minutes, or until tender. Drain and immediately plunge into ice water to stop it from cooking any further. Drain again and add to a blender with the olive oil, toasted pine nuts, garlic, chilli and a good grating of parmesan cheese. Blend to a paste to make pesto. Taste and season with salt and pepper and add more olive oil if needed to get the consistency you like.", "To cook the vegetables, heat a griddle pan to hot. Drizzle the green vegetables with olive oil and cook on a griddle pan. (You can use any vegetables you like for this, but if you choose root veg or anything bigger than asparagus you might need to blanch it first to soften before griddling.)", "Heat a good amount of olive oil in a frying pan and tip in the gnocchi straight from the pack. Fry until golden-brown all over, so they look like mini roast potatoes.", "Serve up the gnocchi and griddled veg with a good dollop of broccoli pesto. You could also sprinkle over some crumbled pancetta for a crisp, salty garnish."]}, {"isVegetarian": false, "title": "Pan-fried grouse with Marsala sauce and wilted kale", "url": "www_bbc_co_uk_food_recipes_pan-fried_grouse_with_94896", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 slices pancetta", "2 grouse breasts", "salt and freshly ground black pepper", "small handful sage leaves", "olive oil", "butter, for frying", "2 tbsp olive oil", "1 garlic clove, peeled and crushed", "2 shallots, peeled and finely sliced", "½ chilli, finely chopped", "4 tbsp Marsala wine", "2 tbsp rowan jelly (alternatively use redcurrant or blackcurrant jelly)", "1 tbsp olive oil", "knob of butter", "2 garlic cloves, peeled and crushed", "300g/10½ oz curly kale", "100ml/3½fl oz chicken stock"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the grouse, lay three slices of pancetta on a board, overlapping slightly. Place a grouse breast in the centre, season with salt and pepper and place a few sage leaves on top. Wrap up the breast in the pancetta. Repeat with the other breast. ", "In a frying pan, heat 1-2 tablespoons olive oil and fry the grouse for 2-2½ minutes on each side. Add a knob of butter and, when it has melted, baste the breasts. Remove from the heat and set aside to rest.", "For the sauce, heat the oil in a pan and gently fry the garlic, shallot and half the chopped chilli for a few minutes to soften. Add the Marsala and rowan jelly. Season to taste with salt and freshly ground black pepper. Reduce the heat and simmer until the sauce has thickened.", "For the kale, heat the oil and butter in a pan and gently fry the garlic and the reserved chilli for two minutes. Add the kale, stir in the stock and cook for 2-3 minutes, or until the kale has wilted.", "To serve, spoon the kale onto serving plates and place the grouse alongside. Drizzle with the sauce. "]}, {"isVegetarian": false, "title": "Pan-fried gurnard with broad bean, spinach and mint stew", "url": "www_bbc_co_uk_food_recipes_pan-fried_gurnard_with_79627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "200g/7oz new potatoes, lightly scraped then quartered lengthways", "½ onion, peeled, sliced finely ", "1 garlic clove, peeled, finely chopped", "400ml/14floz chicken stock", "salt, to taste", "200g/7oz frozen shelled and podded broad beans, thawed", "250g/9oz spinach, chopped", "10g/½ oz fresh mint leaves, sliced finely ", "freshly ground black pepper, to taste", "4 x 175g/6oz gurnard fillets, pin boned, skin scored", "110g/4oz streaky bacon, cut into lardons"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a large saucepan and fry the onion and potatoes gently for about 10 minutes, or until the vegetables are softened but not brown.", "Add the garlic and cook for a further minute. ", "Add the stock and season with salt, to taste. Bring the stew to the boil, then reduce the heat, cover and simmer for about 10 minutes or until the potatoes are tender. ", "Add the broad beans and cook for a further minute. Stir in the chopped spinach and cook for 1-2 minutes, or until the spinach is wilted. Finally, stir in the mint and season with freshly ground black pepper, to taste.", "Heat a frying pan until hot, add the remaining olive oil and fry the gurnard fillets, skin side down, for 2-3 minutes, or until just crisp. Flip the fillets over and continue to cook for another two minutes, or until the fish is cooked through.", "Remove the gurnard from the pan and set aside to rest for 1-2 minutes.", "Meanwhile, heat a separate frying pan and  fry the bacon lardons for 2-3 minutes, or until golden-brown and crisp.", "To serve, divide the stew between two bowls, top each with two gurnard fillets and sprinkle over the bacon lardons."]}, {"isVegetarian": false, "title": "Hake with button mushrooms and vinegar", "url": "www_bbc_co_uk_food_recipes_pan-fried_hake_with_95796", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_hake_with_95796_16x9.jpg", "ingredients": ["2 x 200g/7oz slices of hake, cut through the bone (alternatively use thick hake fillets)", "pinch sea salt flakes", "3-4 tbsp plain flour, for dusting", "1 tbsp vegetable oil ", "50g/1¾oz butter", "splash malt vinegar", "1 tbsp fresh thyme leaves ", "1 tbsp demerara sugar", "2 tbsp chopped celery leaves, plus extra for garnish", "25g/1oz butter", "1 onion, peeled and finely diced", "1 garlic clove, grated", "pinch salt", "300g/10½oz button mushrooms, washed, sliced", "75ml/2¾fl oz dry sherry", "20g/¾oz dried mushrooms", "150ml/5fl oz double cream", "1 tbsp Greek yoghurt", "75g/2¾oz butter", "pinch sea salt flakes", "1 celery root (the end of a bunch of celery), cleaned, trimmed, stringy bits removed, cut in half through the root", "½ tsp fresh thyme leaves", "30g/1¼oz toasted hazelnuts, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the hake, sprinkle one side of the hake with salt flakes. Set aside.", "For the mushroom purée, heat the butter in a saucepan over a medium heat. Add the onion and garlic and season with a pinch of salt. Fry for 3-4 minutes, or until softened.", "Add 200g/7oz of the button mushrooms and continue to cook for a further 1-2 minutes, stirring regularly. Pour in the sherry and bring to the boil, then add the dried mushrooms. Reduce the heat until the mixture is simmering and continue to simmer until most of the liquid has evaporated.", "Add the double cream and return the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 4-5 minutes, or until the volume of liquid has reduced by one-third. Remove from the heat and set aside to cool slightly.", "In a food processor, blend the mushroom mixture to a purée, adding the yoghurt as you blend. Strain the purée through a fine sieve into a clean saucepan, then keep warm over a low heat.", "For the celery root, bring 200ml/7fl oz water to the boil in a frying pan. Add the butter and a pinch of salt, then add the celery root and reduce the heat until the water is simmering. Continue to simmer for 20-25 minutes, or until most of the water has evaporated. Baste the celery root with the buttery juices remaining in the pan, then sprinkle over the thyme leaves and set aside. Keep warm.", "For the mushroom purée, sprinkle the remaining mushrooms with sea salt and set aside for 5 minutes.", "For the hake and butter sauce, sprinkle the flour onto a plate. Dust the hake in flour to completely cover. ", "Heat the oil in a frying pan over a medium heat. Add the fish and fry for 5-6 minutes, or until crisp and golden-brown on one side. Turn the fish over, add the butter and cook for 4-5 minutes, or until the hake is crisp and golden-brown on both sides and the butter has turned brown.", "Add the malt vinegar and thyme to the pan, then baste the fish in the butter and vinegar mixture. Remove the fish from the pan. ", "Add the sugar to the pan, stirring it in the butter and vinegar mixture until dissolved. Stir in the chopped celery leaves.", "To serve, put a spoonful of the mushroom purée into the centre of each plate. Place one piece of celery root on top with the hake alongside. Garnish with the salted mushrooms and a few sliced celery leaves, then drizzle the butter sauce around the edge of the plates. Finish with the toasted hazelnuts."]}, {"isVegetarian": false, "title": "Halibut with deep-fried, miso-glazed aubergine and edamame beans", "url": "www_bbc_co_uk_food_recipes_pan-fried_halibut_with_97859", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines, cut into 2cm/1in cubes", "180ml/6fl oz white miso", "160g/5½oz caster sugar", "50g/1¾oz clear honey", "4 tbsp groundnut oil", "4 x 150g-200g/5½-7oz fillets of halibut, skin on, pin boned", "75g/2½oz unsalted butter", "100g/3½oz edamame beans", "4 tbsp white sesame seeds", "4 tbsp black sesame seeds", "4 tbsp Korean cayenne threads", "2 tbsp mixed micro cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aubergine and edamame beans, half-fill a large saucepan or deep-fat fryer with the oil. Heat the oil to 180C, or until a 2cm/1in cube of bread dropped into the oil turns golden-brown and crisp within 1 minute. (CAUTION: do not leave hot oil unattended.)", "Deep-fry the diced aubergine for 2-3 minutes or until golden-brown and crisp. Set aside to drain on kitchen roll.", "In a saucepan, heat the white miso, sugar, honey and 100ml/3½fl oz water. Cook until it has reduced in volume and turned golden-brown.", "For the halibut, heat a large frying pan and add the oil. Once hot add the fish skin-side down and cook for 2-3 minutes, turn over and cook for a further 2-3 minutes.", "Just before serving add the butter and baste the fish. Allow the fish to rest before serving.", "To serve, place the diced aubergine onto a serving plate and spoon over the sauce. Place the fish in the centre and garnish with the edamame beans, sesame seeds, cayenne threads and micro cress."]}, {"isVegetarian": false, "title": "Pan-fried mackerel, black olive croute with tomato and pomegranate salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_black_81238", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 ripe tomatoes, chopped", "¼ cucumber, peeled and chopped", "1 red pepper, seeds removed and chopped", "50-100ml/2-3½fl oz sherry vinegar, to taste", "4 tbsp extra virgin olive oil", "8 slices white baguette, cut on diagonal 1cm/½in thick", "2 tomatoes, peeled and sliced", "1 red onion, thinly sliced", "2 Charleston peppers (or hot fresh chillies), sliced", "¼ bunch parsley, finely chopped", "2 tbsp black olive paste (available in Turkish supermarkets and online)", "2 tbsp pomegranate molasses", "1 tbsp ground fennel seeds", "1 tbsp cumin seeds", "1 tsp sunflower oil", "4 mackerel fillets, pin-boned", "2 tbsp pul biber (Turkish chilli flakes)", "sea salt and freshly ground black pepper", "50g/1¾oz butter", "pul biber (Turkish chilli flakes), to taste", "100g/3½oz radishes with leaves, thinly sliced", "pickled chillies, roughly chopped", "nigella seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the gazpacho, blend all the ingredients in a food processor until smooth.", "For the salad, preheat the oven to 200C/180C Fan/Gas 6.", "Drizzle a little olive oil and sea salt on the bread and bake on a tray for 10 minutes or until a little golden and crisp.", "Combine the tomatoes, red onion, peppers, parsley, extra virgin olive oil and pomegranate molasses with a little salt and pepper.", "Heat a small frying pan and add the fennel and cumin seeds and cook until the start to release their oils. Place into a pestle and mortar and grind.", "Heat the sunflower oil in a large frying pan over a medium to high heat. Season the flesh side of the mackerel with salt, the ground fennel, cumin and pul biber. Press the seasoning in. Cook the fish skin-side down in the frying pan for 2 minutes or until the skin is golden-brown and crisp. Turn over and cook for 1 minute or until the fish is just done.", "For the Turskish chilli butter, heat the butter in a pan until foaming then add the chilli flakes, cook until the butter browns. Keep warm.", "Just before serving dip some bread into the gazpacho. Place two slices of bread on the serving plate then pile the vegetables, serving ingredients and fish on top, pour over the chilli butter and serve. "]}, {"isVegetarian": false, "title": "Pan-fried loin of venison with butternut squash, roasted salsify, venison jus with dark chocolate and Brussels sprout salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_loin_of_55675", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16 thin slices pancetta ", "4 x 175g/6oz venison loin, fully trimmed, trimmings reserved", "1 tbsp olive oil", "1 thyme sprig", "1 garlic clove, crushed", "1 tbsp olive oil", "venison trimmings (from above)", "1 onion, chopped ", "2 carrot, peeled cut in half lengthways, and chopped ", "1 juniper berry", "½ stick celery, chopped ", "1 thyme sprig", "1 litre/1¾pints red wine", "2 litres/3½ pints chicken stock", "50g/2oz 6 per cent dark chocolate, roughly chopped", "salt and freshly ground black pepper", "200g/7oz butternut squash, cut into 3-4mm thick small rectangles", "75ml/3fl oz olive oil", "1 thyme sprig ", "1 garlic clove, skin on, crushed", "30g/1oz shallots, finely diced", "2 salsify roots, washed, cut into equal-sized pieces", "500ml/18floz full fat milk", "25g/1oz butter", "4 tbsp flatleaf parsley, leaves picked and chopped", "1 garlic clove", "50g/2oz wild mushrooms", "4 Brussels sprouts, base removed, outer leaves and very centre leaves discarded, and remaining leaves separated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the venison, preheat the oven to 150C/300F/Gas 2. Lay the pancetta slices out on a clean work surface. Roll the venison onto the pancetta, and tightly wrap it up. ", "Heat a large ovenproof frying pan and fry the venison until golden-brown all over.", "Place in the oven and cook for 12-14 minutes, or until cooked to your liking.", "Remove from the oven and leave to rest, covered in a warm place, for five minutes.", "For the venison jus, heat a high-sided frying pan until hot, add the olive oil and venison trimmings and cook for a couple of minutes until browned.", "Add the onion, carrot, juniper, celery and thyme. ", "Cover the meat with the red wine and bring to the boil, then cook until the volume of red wine has reduced completely.", "Add one-fifth of the chicken stock and cook until very little of the liquid is left. Repeat this process with the chicken stock five times until it is all added.", "Pass the jus through a muslin cloth into a clean pan.", "Whisk in the dark chocolate and add salt and freshly ground black pepper to taste. Keep warm.", "For the vegetables, place the butternut squash in a frying pan with a tablespoon of the olive oil, plus the thyme and garlic. Cook for five minutes, or until just tender.", "Cook the salsify: poach it in a saucepan with the milk and shallot until soft, but still retaining a little bite. Remove from the pan and pat dry with kitchen paper. ", "Heat half of the butter and a dash of olive oil in a pan and fry the salsify until light golden-brown. Add the chopped parsley and garlic.", "Heat another frying pan, add the remaining butter and a splash more olive oil and fry the wild mushrooms for 1-2 minutes.", "Bring a small pan of salted water to the boil, add the Brussels sprout leaves and cook for one minute. Prepare a bowl of iced water. Drain the sprout leaves and refresh in the iced water. Drain again and pat dry with kitchen paper or a clean tea towel.", "Toss the sprout leaves with the remaining olive oil, and salt and freshly ground black pepper to taste.", "To serve, cut the venison into thick slices and place on each of four plates. Scatter some salsify and butternut squash around and on top. Drizzle with the sauce and garnish with the dressed sprout leaves. "]}, {"isVegetarian": false, "title": "Pan-fried mackerel with beetroot and celery salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_68364", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel, filleted", "1 tbsp olive oil", "2 tbsp rice wine vinegar", "1 tsp caster sugar", "pinch salt", "2 banana shallots, finely sliced into rings", "3 tbsp celery leaves", "2 tbsp chervil sprigs (or parsley)", "50g/1¾oz baby watercress sprigs", "4 tbsp croutons", "500g/1lb 2oz cooked beetroot, thinly sliced", "1 tbsp French mustard", "1 tbsp lemon juice", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, add the olive oil and the mackerel fillets, skin side down, and cook for two minutes until the flesh changes colour halfway up the fish. ", "Flip the fillets over and cook for one more minute then remove from the heat and set aside to rest for a couple of minutes.", "Heat the rice wine vinegar and sugar together in a saucepan then add the shallot rings and salt. Leave to macerate for a few minutes.", "Meanwhile, toss the celery leaves, chervil (or parsley), watercress and croutons together.", "Set aside two-thirds of the beetroot. ", "Place the remaining beetroot into a food processor and blend to make a fine purée then pass it through a sieve into a bowl.", "Add the mustard and lemon juice then whisk in the olive oil and season to taste with salt and freshly ground black pepper.", "To serve, lay the reserved beetroot onto the plates and top with the pickled shallots. ", "Toss the salad with a little of the dressing then place on top of the beetroot slices.", "Add the mackerel fillets then drizzle over more of the dressing."]}]