[{"isVegetarian": false, "title": "Wild garlic, roasted sweetbread and morel risotto", "url": "www_bbc_co_uk_food_recipes_wild_garlic_roasted_66193", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["knob of butter", "3 shallots, finely chopped", "500g/1lb 2oz carnaroli risotto rice", "1.5litres/2½ pints hot vegetable stock", "3 tsp finely chopped thyme", "2 tbsp mascarpone", "3 tbsp grated parmesan", "125g/4½oz cold butter, diced", "cabernet sauvignon vinegar, to taste", "olive oil, for frying", "1kg/2lb 4oz button mushrooms", "150g/5½oz dried ceps (porcini mushrooms)", "100g/3½oz mushroom bouillon", "1.75 litres/3 pints veal stock", "1.75 litres/3 pints white chicken stock", "20 morel mushrooms", "2 tbsp minced shallot", "4 tsp white wine", "200ml/7fl oz chicken stock ", "40g/1½oz wild garlic", "parmesan shavings", "wild rocket", "240g/9oz calves’ or sheeps’ sweetbreads ", "salt and pepper", "olive oil, for frying", "knob of butter"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the risotto, heat the butter in a frying pan. Gently fry the shallots until softened. Add the rice and stir to coat in the butter and shallots. Cook until the rice is translucent.", "Add the hot stock and thyme and cook for seven minutes. Spoon the risotto onto a baking tray and set aside to cool.", "For the mushroom stock, heat the olive oil in a large heavy-based pan.  Add the button mushrooms and fry until golden-brown.", "Add the dried ceps, mushroom bouillon and stock. Bring to the boil, and continue to cook over a high heat until the volume of liquid has reduced by half. Strain the mushrooms, set aside and return the liquid to the pan. Continue to cook over a high heat until the volume of liquid has reduced by half again. Remove from the heat and reserve for later. ", "For the morels, trim the white rim around the base of the morels, then soak in warm water to remove any sand that may be inside the mushrooms. Drain.", "Heat a little olive oil a pan set over high heat, and fry the morels with the minced shallot until golden-brown. Deglaze the pan with the white wine and cover with a lid. Cook until the wine has evaporated, then add the chicken stock and cook with a lid on until the stock has evaporated and the mushrooms are glazed. Remove from the heat and reserve for later.", "For the garnish, wash and spin dry all the wild garlic, then remove all the stems. Reserve 12 of the smallest leaves for the garnish, finely chop the rest and reserve for later.", "For the sweetbreads, using a sharp knife remove the outer skin/membrane from the sweetbreads. Season with salt and pepper.", "Heat a little oil and a knob of butter in a pan set over high heat. When the butter is foaming, add the sweetbreads and fry until golden-brown and crisp on the outside and the juices run clear (not milky) when a knife is inserted into the thickest part. Remove from the pan and reserve for later.", "To finish the risotto, heat a large pan over a medium heat and add 400g/14oz of the cooked and chilled risotto rice. Pour in 360ml/12fl oz of the mushroom stock and cook until the rice is al dente, then remove from the heat and add the chopped wild garlic, mascarpone, grated parmesan and the diced cold butter. Keep stirring until all the ingredients are combined and hot. ", "Add a few drops of cabernet sauvignon vinegar and season to taste with salt and pepper. Spoon the risotto into four serving bowls and garnish with the sweetbreads, morels, parmesan shavings, rocket and raw wild garlic leaves. Drizzle any juice left in the morel pan over the risotto as this is packed with flavour."]}, {"isVegetarian": false, "title": "Wild garlic soup with bacon-fat potatoes and sour cream", "url": "www_bbc_co_uk_food_recipes_wild_garlic_soup_with_17660", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz  onions, thinly sliced", "400g/14oz wild garlic, plus 25g/1oz wild garlic stalks\t\t", "1 fresh thyme sprig", "50g/1¾oz garlic bulbs, unpeeled", "50g/1¾oz butter", "150g/5½oz potatoes, peeled and very thinly sliced", "25g/1oz double cream", "salt", "olive oil, for frying", "50g/1¾oz smoked pancetta lardons", "1 small waxy potato, cut into 1cm/½in cubes, skin roughly chopped", "1 fresh thyme sprig", "1 garlic clove, crushed ", "knob of butter", "50ml/2fl oz sour cream", "wild garlic oil, optional", "handful small wild garlic leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Put 400g/14oz onions, 400g/14oz wild garlic and the thyme in a large saucepan with 800ml/1½ pints water and bring to the boil. Simmer for 30 minutes, remove from the heat, cover and leave to infuse for 2 hours.   ", "Preheat the oven to 180C/160C Fan/Gas 4. Wrap the garlic bulbs in kitchen foil and roast for 30–40 minutes, or until softened. When cool enough to handle, squeeze the garlic flesh into a bowl and set aside. ", "For the bacon-fat potatoes, heat 2 teaspoons olive oil in a frying pan over a medium heat. Fry the pancetta, potato cubes, thyme and crushed garlic for 3–6 minutes, or until golden-brown and crispy. Remove from the heat, drain on kitchen paper and set aside. ", "For the crispy skin, melt the butter in a small saucepan and pour over the potato skin. Season with salt. Fill a small heavy-bottomed saucepan one-third full with oil. Heat to 180C (a cube of bread should turn brown in 1 minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Deep-fry the potato skin until crispy, then remove with a slotted spoon and leave to drain on kitchen paper. ", "For the soup, melt the butter in a large saucepan over a low heat and cook the remaining 100g/3½oz onions for 5 minutes, or until softened. Add the potato slices and roasted garlic and cook without colouring until the potato is soft. ", "In a separate saucepan, heat the double cream with the wild garlic stock, then pour onto the onion and sliced potato mixture. Add the remaining wild garlic stalks and bring to the boil. Blend the soup in a blender, strain through a sieve back into the pan and season with salt. ", "To serve, place a spoonful of sour cream into the middle of each of four shallow bowls, top with wild garlic oil, if using, then the bacon-fat potatoes, crispy skins and wild garlic leaves and drizzle the soup around the edges of the bowls.   "]}, {"isVegetarian": false, "title": "Wild mushroom and braised courgette and celery with an egg and tarragon vinaigrette", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_03692", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2¾oz butter", "150ml/5fl oz light chicken stock", "1 head of celery, each stalk cut into 2in batons ", "6 baby courgettes, halved lengthwise ", "150g/5½oz wild mushrooms ", "few sprigs thyme", "splash Madeira wine", "dash oil", "3 king scallops", "4 tbsp olive oil", "2 tbsp white wine vinegar ", "1 tsp Dijon mustard ", "1 garlic clove, crushed", "1 free-range egg", "2 sprigs tarragon, finely chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt 50g/1¾oz butter in a saucepan over a medium heat then stir in the stock. Add the celery and courgette and cook until tender.", "To make the dressing, bring a pan of water to the boil, reduce to a simmer, add the egg and cook for 5 minutes until soft boiled.", "Meanwhile, mix the oil, vinegar, mustard, garlic and season. Break the yolk of the soft boiled egg into the dressing and whisk. Finely chop the whites and stir into the dressing. Stir in the tarragon and set aside.", "Melt the remaining 25g/1oz butter in a pan and sauté the mushrooms and thyme. Add a splash of Madeira and cook until reduced.", "In a separate pan, heat dash oil over a high heat and fry the scallop slices on one side until golden; this will take 2–3 minutes. Slice on an angle.", "To serve, spoon the mushrooms between two bowls, crisscross the top with the celery and courgettes, spoon over some of the vinaigrette and top with the scallop slices. "]}, {"isVegetarian": false, "title": "Wild mushroom and partridge ravioli", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_38111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz ‘00’ pasta flour", "4 free-range eggs", "25g/1oz unsalted butter", "100g/3½oz wild mushrooms, cleaned", "1 sprig fresh thyme", "1 partridge breast (approx. 100-150g/3½-5½oz ), skin removed", "150ml/5fl oz double cream", "salt and freshly ground black pepper", "2 tbsp olive oil", "50g/1¾oz unsalted butter", "4 partridge breasts, skin on", "250g/9oz wild mushrooms", "200ml/7fl oz beef stock of jus", "100ml/3½fl oz double cream", "selection of fresh herbs"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the ravioli, place the flour and eggs into a food processor and blend until the mixture comes together. Remove from the blender and knead until it forms a smooth dough. Wrap in cling film and place in the fridge to rest for at least 1 hour.", "Meanwhile, heat a medium frying pan and add the butter, once melted add the mushrooms and thyme. Cook for 1-2 minutes.", "Place the cooked mushrooms, partridge and cream into a food processor, season with salt and pepper and blend until smooth.", "Divide the rested pasta dough into 2 and pass through a pasta machine. Start with the pasta machine at its widest setting and pass the dough through the rollers. Do not fold but repeat this process, decreasing the roller setting down grade by grade with each pass, until you reach the thinnest setting. Roll out two sheets of pasta and cut out circles 6-8cm/2½-3¼in wide. ", "Place 1 tsp of the mixture into the centre of a circle and using a pastry brush, brush around the edge with water. Place another circle on top and seal. Repeat this process with the remaining ingredients (you should be able to make 10-12 ravioli). ", "For the sauce, preheat the oven to 200C/180C Fan/Gas 6. ", "Heat a medium frying pan and add the oil and half the butter, once hot add the partridge breast and cook on the skin side for 2-3 minutes, turn over and place in the oven for 4-6 minutes.", "Heat a medium frying pan and add the remaining butter, once hot add the mushrooms and cook for 1-2 minutes, add the stock and continue to cook for 2 minutes. Just before serving, finish the sauce with the cream. ", "Bring a large saucepan of salted water to the boil. Add the ravioli and cook until they float to the top.", "Place the ravioli into the sauce and serve in a large serving bowl with the mushrooms on top. Carve the partridge and place on top. Garnish with fresh herbs."]}, {"isVegetarian": true, "title": "Wild mushroom and Stinking Bishop tart", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_and_55565", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz shortcrust pastry", "50g/1¾oz unsalted butter", "50g/1¾oz plain flour, plus extra for dusting", "300ml/10fl oz whole milk", "1 tbsp Dijon mustard", "1 tsp fresh thyme, leaves only", "3 free-range eggs, separated, plus 1 egg white", "pinch cayenne pepper", "150g/5½oz Stinking Bishop, or other strongly flavoured cheese, chopped", "75g/2½oz unsalted butter", "300g/10½oz wild mushrooms, cleaned", "1 garlic clove, chopped", "1 banana shallot, chopped", "75g/2½oz toasted walnuts, crushed", "black or white truffle, shaved"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/170C Fan/Gas 5.", "Lightly dust a work surface with flour. Roll out the pastry to line a 23cm/9in tart tin. Prick the base of the pastry with a fork but do not trim it. Cover the pastry with baking paper, fill with baking beans and bake 'blind' for 15–20 minutes. Carefully remove the paper and beans and return the pastry case to the oven for 5–10 minutes. Leave to cool on a baking tray. Trim the pastry.", "Meanwhile, melt the butter in a large saucepan. Stir in the flour and cook for 2–3 minutes. Add the milk gradually, whisking all the time, until you have a smooth mixture. Stir in the mustard, thyme, egg yolks, cayenne and half the cheese. Scatter the rest of the cheese into the pastry case.", "In a large, clean, glass bowl, beat the egg whites using an electric hand whisk until soft peaks form. Fold in the custard. Pour into the pastry case. Bake for 20–25 minutes.", "For the wild mushrooms, melt the butter in a frying pan. Add the mushrooms, garlic and shallots and cook for 2–3 minutes.", "To serve, transfer the tart to a serving plate or board. Top with the mushrooms, toasted walnuts and truffle shavings."]}, {"isVegetarian": true, "title": "Wild mushroom galettes", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_galettes_33717", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz block ready-made puff pastry ", "plain flour, for dusting ", "1 free-range egg, beaten ", "3 tbsp sunflower oil ", "knob of butter", "1 large garlic clove, crushed ", "250g/9oz chestnut mushrooms, quartered", "250g/9oz large flat mushrooms, cut into 8 wedges", "250g/9oz mixed wild mushrooms such as oyster and shitake, sliced", "400g/14oz full-fat crème fraîche", "50g/1¾oz Parmesan or alternative vegetarian hard cheese, finely grated", "½ lemon, juice only", "finely chopped flatleaf parsley, to garnish", "salt and freshly ground black pepper"], "serves": "Makes 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with baking paper.", "Roll out the pastry on a floured work surface into a 28x20cm/11x8in rectangle about 3cm/1in thick. Lightly score a criss-cross pattern over the surface of the pastry, being careful not to cut all the way through. Stamp out six rounds using an 8½cm/3in cutter. ", "Place on the baking tray and refrigerate for 10 minutes. Remove from the fridge and brush the tops with beaten egg.", "Place a large roasting tin in the oven until very hot. Carefully add the oil, butter, garlic, and chestnut and flat mushrooms. Season with salt and pepper and toss. Place the tin at the bottom of the oven and the baking sheet with pastry near the top of the oven. Bake for 18–20 minutes, or until the pastries are well risen and lightly golden. The mushrooms should be brown and most of the juices should have evaporated.", "Remove both trays from the oven. Slice the galettes in half widthways and remove any uncooked pastry from the middles. Place upside down on the baking sheet.", "Add the wild mushrooms and crème fraîche to the roasting tin and mix. Place both trays back in the oven for 8–10 minutes, or until the pastry cases are crisp. The mushrooms should be softened and the crème fraîche will have made a mushroom-coloured sauce. Add the cheese and lemon juice to the mushrooms and season well.", "Spoon the mushroom mixture into half the pastry cases. Garnish with the remaining parsley and top with the other halves. Serve straight away. "]}, {"isVegetarian": false, "title": "Wild mushroom quiche with smoked salmon salad", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_quiche_13320", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz plain flour, plus extra for dusting", "½ tsp salt", "100g/3½oz butter, cubed", "75g/2½oz lard, cubed", "1 tbsp olive oil", "300g/10½oz wild mushrooms, cleaned", "5 free-range eggs, beaten", "100ml/3½fl oz whole milk", "200ml/7fl oz double cream", "salt and black pepper", "200g/7oz mature English cheddar, grated", "2 thyme sprigs, leaves picked", "8 spring onions, trimmed and cut into two", "5 tbsp olive oil", "2 fillets hot smoked salmon, skin removed and flesh flaked", "2 handfuls fresh watercress", "1 tsp Dijon mustard", "3 tbsp olive oil", "1 tbsp white wine vinegar"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the shortcrust pastry, put the flour and salt in a large bowl and add the cubes of butter and lard.", "Use your fingertips to rub the butter and lard into the flour until you have a mixture that resembles coarse breadcrumbs with no large lumps of butter or lard remaining. Try to work quickly so that it does not become greasy.", "Measure out eight tablespoons of cold water. Using a knife, stir in just enough of the cold water to bind the dough together.", "Wrap the dough in cling film and chill in the fridge for 10-15 minutes before using. ", "Alternatively use a food processor. Put the flour, butter and salt in the food processor and pulse until the fat is rubbed into the flour. With the motor running, gradually add the water through the funnel until the dough comes together. Only add enough water to bind it and then stop. Wrap the dough in cling film as before and chill for 30 minutes before using.", "Preheat the oven to 190C/375F/Gas 5. ", "Roll out the pastry on a lightly floured work surface to the thickness of a pound coin. Use the rolling pin to help you lift it into a 22cm/8½in deep flan tin. Let the edges overhang (these will be trimmed later) and place in the fridge to chill for at least 15 minutes.", "Line the pastry case with baking parchment and fill it with baking beans. Place on a baking tray and bake for 15-20 minutes, or until the pastry is a very light golden-brown. Remove the baking beans and parchment, and return to the oven for another five minutes to cook the base. Remove and reduce oven temperature to 160C/325F/Gas 3.", "For the wild mushroom quiche, heat the oil in a large frying pan and cook the mushrooms for a minute. In a jug, combine the eggs, milk and cream and season with salt and pepper. ", "Sprinkle the cheese into the pastry case, then add the mushrooms and pour over the egg mix. Sprinkle the thyme leaves over the top. Bake for 40-45 minutes, or until the filling is set. ", "Remove from the oven and set aside to cool. When cool enough to handle, trim the pastry edges. ", "For the smoked salmon salad, heat a griddle pan and toss the spring onions in two tablespoons of olive oil. Griddle the spring onions for two minutes each side, or until they have charred.", "Place the spring onions in a large bowl with the salmon and watercress.", "In a small bowl, add the mustard, vinegar and the remaining three tablespoons of olive oil. Whisk until combined. Just before serving, pour the dressing over the salad and mix.", "Serve the quiche in slices with the smoked salmon salad."]}, {"isVegetarian": false, "title": "Wild mushroom risotto with sautéed Jerusalem artichokes", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_risotto_44544", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 litre/1¾ pints chicken stock ", "150g/5½oz unsalted butter, plus extra knob for stirring in", "200g/7oz chanterelle mushrooms, torn if large", "1 tbsp olive oil", "1 onion, finely chopped", "300g/10½oz Arborio rice", "75ml/2½fl oz dry white wine", "75g/2¾oz Parmesan, finely grated", "salt and freshly ground black pepper", "75g/2¾oz unsalted butter", "500g/1lb 2oz Jerusalem artichokes, peeled and diced", "2 fresh thyme sprigs", "150g/5½oz Parmesan, finely grated", "75g/2¾oz Parmesan, finely grated", "4 free-range eggs", "1 bunch fresh rocket", "extra virgin olive oil, for drizzling"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. ", "To make the Parmesan crisps, line a baking tray with greaseproof paper. Put a circular cutter onto the tray and sprinkle the Parmesan inside. Repeat until you have four circles of Parmesan. Bake for 3–8 minutes, or until the cheese has melted. Leave to cool.", "Pour the stock into a saucepan and bring to a gentle simmer.", "Meanwhile, heat a large frying pan over a medium heat. Melt 75g/2½oz butter, then fry the mushrooms until slightly coloured and any moisture released has evaporated. Transfer to a plate and set aside.", "Heat the remaining 75g/2½oz butter and the oil in the same pan, add the onion and fry gently for 10–12 minutes, or until soft. Add the rice and stir until coated.", "Pour in the wine and let it bubble until almost evaporated. Start adding the warm stock, about two ladlefuls at a time, stirring constantly and ensuring all of it is absorbed before adding more. Continue adding stock for 15–20 minutes, stirring all the time, until the rice is tender and has a creamy coating. Set aside.", "For the artichokes, heat a sauté pan over a low heat and add the butter. Once melted, add the artichokes and cook for 5–7 minutes. Add the thyme and cook for 3–5 minutes, or until cooked through. Season with salt and pepper.", "Place a shallow pan of salted water over a medium heat, bring to a simmer and poach the eggs. Remove from the pan with a slotted spoon and drain on kitchen paper", "Return the risotto to the heat, add the knob of butter, cooked mushrooms and Parmesan and gently stir. Season to taste with salt and pepper.", "Transfer the risotto to serving plates, top with the sautéed artichokes, poached egg and Parmesan, drizzle with the oil and garnish with the Parmesan crisp and serve with the rocket."]}, {"isVegetarian": false, "title": "Wild mushroom risotto balls with beef carpaccio", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_risotto_80784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz butter", "2 shallots, finely chopped", "1 garlic clove, finely chopped", "1 sprig thyme", "200g/7oz wild mushrooms, cleaned and chopped", "250g/9oz risotto rice", "100ml/3½fl oz dry white wine", "600ml/20fl oz chicken stock", "2 tbsp mascarpone or double cream", "2 tbsp freshly grated Parmesan ", "2 tbsp chopped flatleaf parsley", "200g/7oz small baby mozzarella balls", "salt and freshly ground black pepper", "300g/10½oz beef fillet, trimmed", "1 tbsp olive oil", "3 tbsp roughly chopped fresh mint", "3 tbsp torn fresh basil", "3 tbsp roughly chopped flatleaf parsley", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "1 unwaxed lemon, zest only", "2 tbsp capers, drained ", "4 anchovies, roughly chopped", "3 tbsp extra virgin olive oil", "10g/¼oz bull's blood leaves", "5g baby bull's blood leaves", "½ bunch rocket", "Parmesan, shavings "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the risotto balls, in a medium saucepan, melt the butter and gently fry the shallot and garlic for 5 minutes, or until softened. Add the thyme and mushrooms and gently fry for 2 minutes. Stir in the rice until coated in the butter. Pour in the wine and allow to bubble for a minute or so. ", "Add a ladleful of the stock, bring to the boil, and then reduce to a simmer, stirring constantly. Add another ladleful of stock and stir again until absorbed. Continue adding more stock in this way until the grains of rice are plump and creamy. It should take about 15-18 minutes. Fold in the mascarpone and Parmesan. Season to taste with salt and pepper and stir through the parsley. Leave to cool.", "For the beef carpaccio, season the beef fillet with salt and pepper. Heat a frying pan until smoking, add the olive oil and sear the beef for 2-3 minutes on all sides, until golden-brown. Remove the beef from the pan and cover in cling film and roll into a barrel shape, twisting tightly at both ends to seal. Refrigerate for 1 hour, or until firm.", "When the risotto is cool, use your hands to cover each mozzarella ball with the risotto. Shape into balls.", "Heat a deep-fat fryer to 180C. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the risotto balls in the hot oil for 4-5 minutes or until golden-brown. Drain on kitchen paper. ", "For the green sauce, put all the ingredients in a pestle and mortar and pound until you have a thick paste.", "Thinly slice the beef and fan it out on a large serving plate. Dot the green sauce around the plate and add the risotto balls. Drizzle with the extra virgin olive oil and top with bull's blood leaves and Parmesan shavings."]}, {"isVegetarian": false, "title": "Wild mushroom soup with homemade garlic bread", "url": "www_bbc_co_uk_food_recipes_wild_mushroom_soup_with_65367", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 garlic bulb", "500ml/18fl oz double cream", "handful fresh parsley, finely chopped", "5 tbsp extra virgin olive oil ", "1 large ciabatta, cut lengthways into 4 ", "50ml/2fl oz rapeseed oil ", "1 shallot, chopped ", "1 garlic clove, chopped ", "625g/1lb 6oz wild mushrooms, such as chanterelle, ceps, tompette, girolle or oyster", "½ lemon, juice only ", "400ml/14fl oz chicken stock  ", "125ml/4fl oz double cream ", "50g/13/4oz butter, diced ", "salt and freshly ground black pepper", "¼ bunch fresh chervil, chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the garlic bread, preheat the oven to 170C/150C Fan/Gas 3½. Wrap the garlic bulb in aluminium foil and place on a roasting tray. Roast for 40-45 minutes, or until soft. Leave to cool. ", "Cut the top off the garlic bulb and squeeze out all the soft cloves, then finely chop.", "Pour the cream into the bowl of a freestanding mixer and beat for 3-5 minutes, or until the mixture turns to solid fatty lumps with a liquid base. Line a colander with a clean muslin cloth and place it over a bowl. Tip the mixture into the colander and wrap the muslin tightly around the cream. Squeeze out all the liquid so that you have a solid mass of butter in the muslin, then discard the liquid.", "Tip the butter into a bowl, add the chopped garlic and a generous pinch of salt. Stir in the parsley and mix once more. Refrigerate until ready to serve.", "Meanwhile, for the soup, heat half the oil in a large, heavy-based saucepan over a medium heat. Add the shallot and garlic and cook for 1-2 minutes, or until softened. Add 500g/1lb 2oz of the mushrooms, season with salt and pepper, and cook for 3-4 minutes. ", "Stir in the lemon juice, then the stock. Bring the boil, reduce the heat and simmer gently for 10 minutes. ", "Pour the soup into a blender and blend to a smooth purée. Return it to the pan and stir in the cream. Gently warm over a low heat, then stir in the butter, adjust the seasoning, if needed, and keep warm on the hob. ", "Heat the remaining oil in a frying pan over a medium heat. Gently fry the remaining mushrooms for 3 minutes, or until cooked, then season and set aside. ", "To serve, heat a large griddle pan and brush the bread with oil. Place on the griddle pan and cook each side for 1-2 minutes. Spread the bread with the garlic butter. Divide the cooked wild mushrooms between bowls, ladle over the soup and sprinkle with the chervil."]}, {"isVegetarian": true, "title": "Wild rice salad", "url": "www_bbc_co_uk_food_recipes_wild_rice_salad_89972", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_rice_salad_89972_16x9.jpg", "ingredients": ["100g/3½oz broad beans, podded", "3-4 tbsp extra virgin olive oil", "1 lemon, juice only", "1 garlic clove, crushed", "pinch chilli flakes", "175g/6oz wild rice, cooked according to packet instructions", "1 ripe avocado, peeled, stone removed, sliced ", "3 spring onions, sliced", "4 radishes, sliced", "2-3 handfuls micro cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the broad beans in a pan of boiling water for 3-5 minutes. Drain and refresh in cold water. When cool enough to handle, remove the skin from each bean, use your nail to slit the skin, then pop out the bright green bean. ", "Whisk the olive oil, lemon juice, garlic and chilli flakes together in a bowl and season, to taste, with salt and freshly ground black pepper. ", "Mix the wild rice, broad beans, avocado, spring onions and radishes together in a bowl, add the dressing and toss gently. Add the micro cress, give the salad one further toss and serve."]}, {"isVegetarian": false, "title": "Wild salmon and asparagus quiches", "url": "www_bbc_co_uk_food_recipes_wild_salmon_and_07205", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_salmon_and_07205_16x9.jpg", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting", "pinch salt and freshly ground black pepper", "2 tsp dried parsley", "250g/9oz cold butter, cut into cubes", "4 medium free-range egg yolks", "100ml/3½fl oz ice-cold water", "1 free-range egg, beaten, for egg wash", "drizzle olive oil", "3 x 110g/4oz boneless wild salmon fillets ", "3 sprigs fresh dill", "½ tsp chilli flakes", "2 garlic cloves, lightly crushed", "½ lemon, sliced ", "220g/8oz fine asparagus ", "large bowl ice cold water, for refreshing", "8 large free-range eggs", "160ml/5¾oz double cream", "200g/7oz Parmesan, finely grated", "100g/3½oz gruyère, finely grated ", "small bunch fresh chives"], "serves": "Makes 18 individual quiches", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["In a large mixing bowl, combine the flour, salt, pepper and dried parsley. Add the cold, cubed butter and rub in with your fingertips until it is the texture of breadcrumbs (you can also do this in a food processor). Add the egg yolks and mix together with your hands, then slowly mix in the water little by little until it just comes together.", "Turn the pastry out onto the work surface and knead a few times very lightly to form into a ball. Try not to handle the pastry too much. Then divide the pastry in half, wrap in cling film and chill in the fridge for half an hour.", "For the filling, preheat the oven to 180C/160C Fan/Gas 4. Lay out a large sheet of aluminium foil and drizzle with olive oil. Lay the salmon fillets on the foil and top with the fresh dill, chilli flakes and garlic cloves, adding a generous amount of salt and freshly ground black pepper. Squeeze the lemon slices over the fish and lay them on top. Fold the foil over to make a loose pouch and seal the edges with double folds. Place the pouch onto a baking tray and bake the salmon for 10–15 minutes, depending on their thickness. Unwrap the fish, discard the herbs, garlic and lemon and set the fish aside to cool. Refrigerate until needed.", "Snap off the woody ends of the asparagus. Bring a large pan of salted water to the boil, add the asparagus and blanch for 1 minute. Plunge the asparagus into the bowl of ice cold water and drain when cool. Set aside 2 spears of asparagus, cut to 10cm/4in, per tart. Cut the rest into 1cm/½in pieces.", "Preheat the oven to 180C/160C Fan/Gas 4.", "Roll the pastry to 4mm thick and cut into 11cm/4¼in circles, re-rolling as needed, to line the mini pastry tins. Put the tins onto a baking tray and chill in the fridge for 10 minutes. (If you don’t have enough tins and are baking the pastry in batches, divide the pastry in half and chill the second batch while the others are baking.)", "Cut a square of baking paper slightly larger than the tart tins and scrunch them up to soften the paper. Put one square onto each pastry case and add a pile of baking beans. Bake the pastry cases for 15 minutes. Remove the paper squares and the baking beans, and brush the pastry cases with the egg wash. Return to the oven for a further 6 minutes. ", "Meanwhile, in a bowl, mix together the eggs and double cream, adding a pinch salt and a good grind of black pepper. Set aside 30g/1oz of the grated Parmesan, then mix the remaining cheeses into the egg mixture. Snip in the fresh chives and mix to combine.", "Gently flake the cooked salmon in chunks into the baked pastry cases and with some asparagus pieces. Spoon over the egg mixture so that it fills the tart to the top (you may need to push the filling down into the gaps). Lay two crossed spears of asparagus on the top, and sprinkle over some reserved grated Parmesan. ", "Bake the tarts for 15 minutes until golden-brown but with a slight wobble on top. Allow to cool for a few minutes before carefully turning out onto a cooling rack. Serve warm or cold with a crisp green salad."]}, {"isVegetarian": false, "title": "Wild salmon with English asparagus and hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_wild_salmon_with_english_40568", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_salmon_with_english_40568_16x9.jpg", "ingredients": ["2 sticks of celery", "small bunch parsley", "small bunch tarragon", "2 bay leaves", "1 leek, sliced", "1 fennel bulb, sliced", "2 onions, quartered", "6 carrots, peeled and sliced", "2kg/4lb 8oz asparagus, trimmings reserved ", "2 tbsp salt", "1 tbsp black peppercorns", "100ml/3½oz white wine vinegar", "2 lemons, chopped in half ", "1x 3.5kg/8lb wild salmon, gutted and scaled", "6 free-range egg yolks", "1kg/2lb 4oz clarified butter, kept warm", "1 tbsp white wine vinegar", "salt and black pepper"], "serves": "Serves 20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Tie the celery, parsley, tarragon and bay leaves together to make a bouquet garni. ", "Half fill a large fish kettle with cold water, add the bouquet garni, leek, fennel, onions, carrots, asparagus trimmings, salt, peppercorns, white wine vinegar and lemons. Place the salmon on top and add more cold water to cover, if needed. Cover with a lid and bring to the boil, then remove from the heat.", "In a large pan of boiling water cook the asparagus spears for 1-2 minutes, or until tender. Drain and plunge into ice-cold water to refresh.", "To make the sauce, place the egg yolks in a bowl set over a pan of simmering water (take care not to let the bowl touch the water) and beat until pale and thickened. Slowly add the warm butter in a thin steady stream, whisking all the time until you have a smooth emulsion. Beat in the white wine vinegar and season with salt and pepper.", "To serve, scoop a piece of fish onto each plate along with some blanched asparagus and a spoonful of sauce."]}, {"isVegetarian": false, "title": "Wild salmon with sauce vierge", "url": "www_bbc_co_uk_food_recipes_wild_salmon_with_sauce_52126", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "4 x 150-200g/5½-7oz pieces wild salmon fillet", "120ml/4fl oz extra virgin olive oil", "1 lemon, juice only", "2 tomatoes, skin and seeds removed, diced", "1 shallot, finely diced", "1 garlic clove finely chopped", "2 tbsp baby capers", "2 tbsp torn fresh basil", "2 tbsp chopped fresh chervil", "2 tbsp chopped fresh dill", "2 tbsp chopped fresh parsley", "2 tbsp snipped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the wild salmon, heat a large frying pan and, once hot, add the oil. Place the fillets of salmon skin-side down for three minutes and turn over for another three minutes. Remove from the pan and leave to rest in a warm place.", "For the sauce vierge, pour the olive oil into a non-reactive pan. Whisk in the lemon juice until well combined. Add the chopped tomatoes, shallot, garlic and capers.", "Heat the pan over a medium heat until the mixture is just warmed through.", "Add the basil, chervil, dill, parsley and chives and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the salmon among four plates and then spoon the sauce vierge over the top."]}, {"isVegetarian": false, "title": "Wild sea bass en papillotte", "url": "www_bbc_co_uk_food_recipes_wild_sea_bass_en_83887", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz sea beets (available in some supermarkets or online)", "50g/1¾oz sea aster (available online)", "20g/¾oz sea purslane (available online)", "clementine peels (see below)", "300g/10½oz pumpkin, peeled and diced", "20g/¾oz fresh dill", "2 x 140g/5oz wild sea bass, filleted", "150ml/5fl oz fish stock", "olive oil, for frying", "100g/3½oz mussels, preferably Shetland mussels, scrubbed and debearded (discard any mussels with broken shells and any that refuse to close when tapped)", "1 shallot, finely chopped", "parsley stalks", "100ml/3½fl oz white wine ", "3 clementines, segments and juice, peel reserved", "100ml/3½fl oz white wine vinegar", "100ml//3½fl oz white wine", "3 free-range egg yolks", "150g/5½oz clarified butter", "splash Tabasco", "few sprigs fresh dill, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Lay the sea vegetables, clementine peels, diced pumpkin, fresh dill and sea bass fillets in the middle of a large piece of parchment paper.  Fold over the parchment paper to seal, but leaving a 5cm/2in gap at one side. Pour the fish stock through the gap and seal, using a stapler if you have one, or by folding over as before. ", "Heat some olive oil in an ovenproof frying pan and place the bag in the pan. When the bag starts to rise (about a minute), transfer the pan to the oven for 4-5 minutes.", "For the hollandaise, put the clementine juice, white wine vinegar and white wine in a pan and place over a medium heat. Bring to a boil and cook until the volume of liquid has reduced by about two thirds in volume. ", "Put the egg yolks in a heatproof bowl and add the reduction. Place the bowl over a pan of boiling water and start to whisk. Whisk consistently, as the eggs start to turn light, fluffy and pale in colour slowly start adding the clarified butter in a thin stream until incorporated. Add the clementine segments, a dash of Tabasco and chopped fresh dill.", "Heat a lidded saucepan over a very high heat. Once the pan is really hot and smoky, add the mussels, shallot, parsley stalks and white wine.  Cover with the lid and allow to steam for 2 minutes, or until the mussels have opened (discard any mussels that remain closed). ", "Open the fish parcel and lift all contents into the middle of a large serving plate. Scatter the mussels around the serving plate and serve the hollandaise on the side. "]}, {"isVegetarian": false, "title": "Wild Scottish venison with port, figs and potato wedges", "url": "www_bbc_co_uk_food_recipes_wild_scottish_venison_36281", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wild_scottish_venison_36281_16x9.jpg", "ingredients": ["100ml/3½fl oz cold-pressed rapeseed oil", "4 large potatoes", "pinch smoked sea salt", "100ml/3½fl oz cold-pressed rapeseed oil", "5 small red chillies, whole", "4 small red onions, finely sliced", "800g/1lb 12oz wild Scottish venison haunch steaks ", "200g/7oz soft dried figs", "50ml/2fl oz port ", "150ml/5fl oz balsamic vinegar", "watercress salad, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato wedges, preheat the oven to 200C/400F/Gas 6. Warm the rapeseed oil in a baking tray in the oven.", "Slice the potatoes into wedges as thickly or thinly as you like, rinse under cold running water and pat dry with a tea towel (you don’t want any droplets of water left on the wedges).", "Add the wedges to the hot oil and bake until golden and crisp - about 40 minutes - turning only once half way through. (Baking time is dependent on the thickness of the wedges.)", "For the venison, heat half the rapeseed oil in a heavy frying pan. Add the chillies to the hot oil and coat completely, cooking for about two minutes or until the skins just begin to blister.", "Stir in the red onions and cook for three minutes. Add the venison steaks, turning to seal all sides of the meat.  Cook for about eight minutes for medium-rare.  Add the figs and remaining oil, then the port and the balsamic vinegar and reduce for about three minutes.", "Serve the venison with a watercress salad and a sprinkling of smoked sea salt over the potato wedges."]}, {"isVegetarian": false, "title": "Wild sea bass with new potatoes and a champagne sauce", "url": "www_bbc_co_uk_food_recipes_wild_sea_bass_with_new_73976", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz samphire", "500g/1lb 2oz medium new potatoes, scrubbed and quartered", "2 shallots, finely chopped", "2 garlic cloves, finely chopped", "olive oil", "175g/6oz smoked streaky bacon, chopped into lardons", "125g/4½oz broad beans, podded", "large knob of unsalted butter", "freshly ground black pepper", "4 tbsp olive oil", "700-900g/1lb 9oz-2 lb sea bass, descaled, pin bones removed and cut into 4 fillets ", "sea salt flakes and freshly ground black pepper", "200g/7oz butter", "1 banana shallot, thinly sliced", "1 medium carrot, thinly sliced", "6 button mushrooms, sliced", "200ml/7fl oz champagne", "300ml/10fl oz white fish stock", "300ml/10fl oz double cream", "150g/5½oz brown shrimps, peeled"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the samphire, strip the fronds from the main stalks and wash thoroughly. Blanch the stalks in boiling water for 30 seconds.  Refresh in cold water, drain and set aside.", "Put the new potatoes in a large pan of salted water, bring to the boil and cook until just tender, then drain. ", "Meanwhile, heat a large frying pan over a high heat and add a little olive oil. Fry the shallots and garlic for a minutes then add the bacon and cook for a few minutes more. Add the potatoes, shaking the pan to make sure the potatoes are coloured all over. Add the samphire, broad beans and the butter.", "Season with pepper, tossing thoroughly to make sure everything is heated through.  ", "For the sea bass, preheat the grill to high.  Line a baking tray with tin foil", "Score the skin of the sea bass fillets being careful not to cut too deeply into the flesh.  ", "Season the flesh side of the fish with salt and pepper. Arrange the fish skin-side up on the prepared tray. Brush the skin with olive oil, and place the fillets under the grill. Cook for about 4 minutes, or until the skin has blackened and the flesh is just cooked.", "For the sauce, melt 50g/1¾oz of the butter in a saucepan over a medium heat, add the vegetables and fry gently until just softened but not coloured. ", "Add half the champagne and cook until reduced in volume to a syrupy consistency. Add the stock and cook until the volume of liquid has reduced by half. Add the cream and simmer to reduce by half.", "Pass through a sieve into a clean saucepan and then over a low heat whisk in the remaining butter. Just before serving, stir in the shrimp and carefully warm the sauce until everything is heated through. Stir in the remaining champagne and check the seasoning. ", "To serve, put the new potatoes on a large serving plate. Top with the sea bass and pour over the sauce."]}, {"isVegetarian": false, "title": "Wild strawberries and yuzu sorbet", "url": "www_bbc_co_uk_food_recipes_wild_strawberries_and_62191", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz wild strawberries, hulled", "60g/2½oz yuzu juice", "150g/5½oz sugar", "100g/3½oz pasteurised egg white", "100g/3½oz caster sugar", "100g/3½oz icing sugar", "250g/9oz strawberry purée", "50g/1¾oz vanilla syrup", "1 spoon Gelcrem Fred ", "70g/2½oz sugar", "1½ leaves gelatine, soaked in iced water for 10 minutes", "20g/½oz basil leaves", "50g/½oz sugar", "50g/½oz lemon juice", "160g/5⅔oz gariguette strawberries, hulled and cut into quarters ", "100ml/3½fl oz vanilla syrup (made from 250g/9oz sugar, 250ml/9fl oz water and the seeds from a vanilla pod)", "20 fraise des bois alpine strawberries, hulled", "micro basil leaves, for garnish", "1 lime or yuzu, zest only", "marshmallows, to garnish"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the wild strawberry and yuzu sorbet, place in the strawberries in a blender and blend until smooth. Pass through a sieve.", "Place the sugar and 150ml/5½fl oz water in a sauce pan and boil until the sugar is dissolved and you have a syrup. ", "Add the strawberry purée and yuzu juice to the syrup. Place in an ice cream maker and churn following the manufacturer’s instructions until frozen.", "For the meringue, preheat the oven to 80C/150F/Gas ¼, or the lowest possible setting.", "Combine the ingredients in a large freestanding mixer and whisk until stiff peaks form when the whisk is removed. Spoon into a piping bag and pipe small dots onto a silicone mat or a baking tray lined with baking parchment.", "Bake for 2-3 hours, or until firm.  Pound the basil leaves in a pestle and mortar. When you remove the meringues from the over, stir them through the crushed basil and set aside.", "For the strawberry jam, combine all ingredients in a thermo mix or blender and pulse until fully incorporated.  Strain through a sieve and pour into sterilized jars.", "For the basil soup, place the sugar and 350ml/12fl oz water in a large saucepan and bring to the boil. Squeeze the gelatine to remove any excess water, then add to the pan. Set aside to cool.", "Place the basil leaves and sugar in a blender and pulse to form a smooth paste. Add the lemon juice and the gelatine mixture, blend again then pass through a fine sieve.", "For the gariguettes and fraise des bois, dress the gariguettes with a drizzle of vanilla syrup and mix with the fraise des bois.", "To serve, arrange the dressed strawberries in small bowls, place five mini meringues around the strawberries, a few dabs of strawberry jam and sprinkle a few micro basil leaves over the top. Place a scoop of sorbet on top of the strawberries and grate some fresh yuzu or lime zest over the top. ", "Drizzle with some vanilla syrup and scatter some marshmallows over and serve. Finally, at the table, poor some chilled basil soup into the bowls."]}, {"isVegetarian": true, "title": "Wild mushroom and sweetcorn biryani parcels", "url": "www_bbc_co_uk_food_recipes_wildmushroomandsweet_92214", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz low GI rice (available from health food shops and some supermarkets)", "1 bay leaf", "2 green cardamom pods", "2 cloves", "1 tbsp vegetable oil", "1 tbsp butter", "1 tsp cumin seeds", "2 green cardamom pods, lightly crushed", "1 bay leaf", "2 garlic cloves, peeled, chopped", "200g/7oz onions, peeled, finely chopped ", "2 large Portobello mushrooms, wiped clean, chopped", "110g/4oz mixed wild mushrooms, wiped clean, roughly chopped", "75g/3oz sweetcorn kernels", "1 tsp ground coriander", "½ tsp ground cumin", "½ tsp red chilli powder", "½ tsp garam masala ", "1 tbsp white truffle paste (optional)", "½ tbsp tomato purée", "2 tbsp single cream", "2 tbsp chopped fresh coriander leaves", "salt and freshly ground black pepper", "8 large sheets ready-made filo pastry", "110g/4oz butter, melted", "1 punnet coriander cress", "½ tbsp butter", "½ tbsp vegetable oil", "1 garlic clove, crushed to a paste with the edge of a knife", "½ tsp crushed coriander seeds", "¼ tsp dried chilli flakes", "50g/2oz almonds, lightly toasted, cut into halves", "110g/4oz mixed wild mushrooms, wiped clean, sliced", "1 tbsp freshly squeezed lemon juice", "salt and freshly ground black pepper", "1 x 20g/¾oz punnet coriander cress (optional)", "300g/11oz Greek-style yoghurt", "1 tsp toasted cumin seeds, ground to a powder", "110g/4oz fresh blackberries, blended to purée", "black truffle shavings (optional), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the parboiled rice, add the rice, bay leaf, cardamom and cloves to a pan of boiling, salted water. Cook the rice until it is almost tender, then drain well and set aside.", "For the biryani, heat the oil and butter in a frying pan. When the butter is foaming, add the cumin, cardamom and bay leaf and fry for 1-2 minutes, or until fragrant and beginning to pop. (CAUTION: Keep the pan away from your eyes and face - the seeds may pop.)", "Add the chopped garlic and fry for 1-2 minutes, or until pale golden-brown. ", "Add the chopped onion and fry for 2-3 minutes, or until golden-brown.", "Add all of the mushrooms and the sweetcorn kernels and continue to fry, stirring well, for a further 3-4 minutes, or until softened.", "Add the ground spices and stir well to coat the vegetables. Continue to fry for 1-2 minutes, or until fragrant, then add the white truffle paste (if using), tomato purée and cream and stir well to combine.", "Add the parboiled rice and chopped coriander and season, to taste, with salt and freshly ground black pepper.", "Brush one side of each sheet of filo pastry all over with some of the melted butter. ", "Place one sheet of filo pastry on top of another to create two layers of pastry, then spoon a quarter of the biryani mixture into the centre of the pastry. ", "Fold the sides over the rice filling, then roll the pastry into a parcel. Brush all over with more melted butter.", "Repeat the process with the remaining filo pastry and biryani mixture.", "Place the biryani parcels and the coriander cress onto a baking tray and bake in the oven for 12-15 minutes, or until the pastry is crisp and golden-brown and the coriander cress has dried. ", "Meanwhile, for the mushrooms, heat the oil and butter in a pan over a medium heat. When the butter is foaming, add the crushed garlic, coriander seeds and chilli flakes and fry for 1-2 minutes, or until the garlic has softened.", "Add the toasted almonds, then add the mushrooms and stir well. Continue to fry for 1-2 minutes, or until the mushrooms have softened, then drizzle over the lemon juice. Season, to taste, with salt and freshly ground black pepper.", "For the raita, blend all of the raita ingredients together in a food processor until well combined, then chill in the fridge until needed.", "To serve, spoon the mushroom and almond mixture into the centre of each of four serving plates. Cut the biryani parcels in half and place one biryani parcel (two halves) on top of each serving. Sprinkle over the dried coriander cress and truffle shavings, if using. Serve the raita alongside."]}, {"isVegetarian": true, "title": "Wild mushroom bruschetta with poached eggs and balsamic tomatoes", "url": "www_bbc_co_uk_food_recipes_wildmushroombruschet_88541", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 slice ciabatta bread", "2 tbsp olive oil", "25g/1oz butter", "½ shallot, finely chopped", "100g/3½oz wild mushrooms, roughly chopped", "1 garlic clove, finely chopped", "75ml/2½fl oz double cream", "1 tbsp chopped fresh sage", "salt and freshly ground black pepper", "2 tbsp olive oil", "150g/5½oz vine tomatoes", "2 sprigs fresh thyme", "2 sprigs fresh rosemary", "2 tsp balsamic vinegar", "2 poached free-range eggs", "1 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the bruschetta, heat a griddle pan until hot. Drizzle the olive oil over the slice of ciabatta bread and griddle until golden-brown on both sides. Remove from the pan.", "In a separate frying pan, heat the butter and gently fry the shallots, mushrooms and garlic until the mushrooms start to colour, about five minutes. Add the cream and simmer until reduced slightly, then stir in the chopped sage and season, to taste, with salt and freshly ground black pepper.", "For the tomatoes, heat the oil in an ovenproof frying pan. Add the tomatoes and herbs to the pan and sear on all sides. Sprinkle over the balsamic vinegar and transfer to the oven to cook for about six minutes, or until soft.", "To serve, place the griddled ciabatta onto a serving plate and top with the mushroom mixture. Place the poached eggs on top and arrange the balsamic tomatoes around the side. Garnish with parsley."]}, {"isVegetarian": true, "title": "Wild mushroom fricassée on toast with wilted nettles", "url": "www_bbc_co_uk_food_recipes_wildmushroomfricasse_89012", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "½ onion, sliced", "1 clove garlic, chopped", "200g/7oz wild mushrooms, sliced", "splash white wine", "150ml/5½fl oz double cream", "salt and freshly ground black pepper ", "small handful fresh nettles (wear rubber gloves when handling nettles)", "squeeze lemon juice", "dash olive oil", "small handful fresh nettles (wear rubber gloves when handling nettles)", "salt and freshly ground black pepper ", "2 slices crusty white bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the fricassée, heat the butter in a frying pan, add the onion and garlic and fry for 3-4 minutes, or until softened but not coloured. Add the mushrooms and fry for 2-3 minutes, or until golden-brown. ", "Add a splash of white wine, then reduce the heat and simmer for 2-3 minutes. Stir in the cream, season to taste with salt and freshly ground black pepper and simmer until the sauce has reduced by half. Stir in the nettles and add a squeeze of lemon juice, to taste.", "For the wilted nettles, heat the olive oil in a frying pan and add the nettles. Season with salt and freshly ground black pepper, and leave to wilt in the heat for 1-2 minutes.", "To serve, pile the wilted nettles onto a serving plate, place the toast on top and then pour over the mushroom fricassée."]}, {"isVegetarian": true, "title": "Wild mushroom pasta", "url": "www_bbc_co_uk_food_recipes_wildmushroompasta_88656", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped", "125g/4½oz wild mushrooms, such as morels, porcini, chanterelles etc", "150ml/5fl oz white wine", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "2 vine tomatoes, seeds removed, chopped", "200g/7oz cooked tagliatelle, kept warm", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh chives"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan and gently fry the onion and garlic for 3-4 minutes.", "Add the mushrooms and continue to cook for 4-5 minutes.", "Pour in the white wine and simmer until reduced slightly, then pour in the cream. Season well with salt and freshly ground black pepper and simmer gently for about five minutes. Stir in the tomatoes.", "Stir the sauce into the cooked tagliatelle.", "Serve in a shallow pasta bowl, garnished with fresh parsley and chives."]}, {"isVegetarian": true, "title": "Wild mushroom pilaff", "url": "www_bbc_co_uk_food_recipes_wildmushroompilaff_86758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp vegetable oil", "1 tsp cumin seeds", "2 bay leaves", "1 large piece cinnamon stick", "2 black cardamom pods, lightly crushed", "6 black peppercorns ", "6 green cardamom pods, lightly crushed", "4 cloves", "1 small onion, roughly chopped", "large handful raw cashew nuts, whole", "200g/7oz fresh wild mushrooms (girolles, morels, ceps, oyster mushrooms, etc, wiped clean with damp kitchen towel, and cleaned of any grit)", "2 garlic cloves, finely chopped", "salt, to taste", "300g/10½oz basmati rice, washed well and soaked (soak the rice while you chop the mushrooms)", "390ml/13¾fl oz water", "1 tsp lemon juice, or to taste"], "serves": "4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oil in a large wide saucepan. Add the whole spices, cook for 20 seconds then add the onion and cashew nuts. Be careful as they may splater a bit. Fry for about 4-5 minutes, until the onions are soft and browning at the edges.", "Add the mushrooms, garlic and salt and sauté over a high heat for 4-5 minutes. Drain the rice that's been soaking and add to the pan along with the 390ml/13¾fl oz water, bring to the boil then cover and lower the heat to very low and cook for ten minutes. ", "After ten minutes, check a grain of rice to see if it is tender. If not, leave for another minute. Take off the heat, remove the lid and allow any excess moisture to evaporate. Gently stir in the lemon juice, taste and adjust seasoning if necessary and stir gently with a fork."]}, {"isVegetarian": true, "title": "Wild mushroom risotto", "url": "www_bbc_co_uk_food_recipes_wildmushroomrisotto_85127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "¼ onion, finely chopped", "1 garlic clove, finely chopped", "100g/3½oz wild mushrooms, cleaned and chopped", "150g/5½oz long grain rice", "50ml/2fl oz white wine", "200ml/7fl oz hot vegetable stock", "25g/1oz butter", "50ml/2fl oz double cream", "salt and freshly ground black pepper ", "1 tsp fresh thyme leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large frying pan over a medium heat, add the chopped onion and cook for 4-5 minutes, or until softened but not browned.", "Add the garlic and mushrooms and cook for 3-4 minutes. ", "Add the rice and stir to coat all the grains with oil. Turn up the heat, add the white wine and simmer for 2-3 minutes.", "Reduce the heat and gradually add the stock, a ladleful at a time, until all the liquid has been absorbed. ", "Stir in the butter and cream and season well with salt and freshly ground black pepper. ", "To serve, place the risotto into a bowl and sprinkle over the thyme leaves."]}, {"isVegetarian": false, "title": "Wild mushroom risotto with parmesan", "url": "www_bbc_co_uk_food_recipes_wildmushroomrisottow_86555", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "50g/2oz onion, chopped", "1 garlic clove, chopped", "salt, to taste", "175g/6oz risotto rice", "1 litre/1¾ pints boiling water", "1 tbsp olive oil", "400g/14oz mixed mushrooms", "100g/3½oz grated parmesan", "1 tsp chopped fresh chervil", "1 tsp chopped fresh chives", "100g/3½oz tomatoes, skinned, seeds removed and finely chopped", "salt and freshly ground black pepper ", "white truffle oil, for drizzling"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the risotto, heat the olive oil in a pan. Place the onions, garlic and a pinch of salt into the pan and cook until the onions are soft and transparent. ", "When the onions are cooked, add the rice and stir until the rice is very hot and the grains are starting to turn translucent. Begin to add the water little by little, stirring continuously. Cook for 18-20 minutes then remove the pan from the heat and leave to stand.", "To complete the risotto, heat a little olive oil in a frying pan. Add the mushrooms to the pan and fry for a few minutes. ", "When the mushrooms have softened, mix them through the risotto base and cook the rice for a further few minutes. Once the rice is soft, stir in the parmesan, chervil, chives and tomatoes. Season with salt and freshly ground black pepper.", "To serve, place the risotto into the middle of four serving dishes and drizzle over a little white truffle oil."]}]