[{"ingredients": ["175g / 6oz de mantequilla", "175g / 6oz de azúcar en polvo de oro", "3 huevos grandes de gallinas camperas", "Harina de 175g / 6oz", "1 cucharadita de polvo de hornear", "2 cucharaditas de gránulos de café instantáneo", "Piezas de nogal de 65g / 2¾oz", "600 ml / 1 pinta de crema doble", "1 cucharada de café instantáneo en polvo, disuelto en 2 cucharadas de agua hirviendo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Alinee la base de dos latas de esponja de fondo suelto de 20cm (8pulg) con papel para hornear.", "Batir la mantequilla y el azúcar impalpable hasta que quede ligero, pálido y esponjoso. Puedes hacerlo a mano, pero es mucho más fácil con un mezclador eléctrico.", "Rompe los huevos en un cuenco, divídelos con un tenedor, luego agrégalos un poco a la mantequilla y el azúcar, y bate bien después de cada adición.", "Combine la harina y el polvo de hornear y mezcle suavemente en la mantequilla y el azúcar, ya sea con un mezclador de mano a baja velocidad oa mano, con una cuchara grande de metal.", "Disuelva los gránulos de café en una cucharada de agua hirviendo, luego mezcle con la mezcla.", "Picar las nueces y doblarlas suavemente", "Divida la mezcla de la torta entre las dos latas, alise la tapa ligeramente y hornee de 20 a 25 minutos; la torta debe ser elástica al tacto y una broche insertada en su interior debe salir limpia.", "Transfiera a una rejilla para enfriar.", "Para el relleno y relleno, azote la crema doble y agregue la mezcla de café.", "Extienda la mitad de la crema de café sobre una de las mitades de la torta y unir los pasteles. Alise la crema de café restante en la parte superior."], "url": "www_bbc_co_uk_food_recipes_coffeeandwalnutcake_83909", "title": "Pastel de café y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffeeandwalnutcake_83909_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8oz de mantequilla sin sal, más extra para engrasar", "225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "50ml / 1¾fl oz de café espresso fuerte", "Harina de levante 225g / 8oz", "Nueces de 75 g / 2½ oz", "125g / 4½oz de mantequilla sin sal", "200g / 7oz de azúcar glasé", "50ml / 2fl oz de café espresso fuerte", "12 mitades de nuez, para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón, bata la mantequilla y el azúcar hasta que estén muy claros y pálidos.", "Agregue los huevos uno a la vez a la mezcla de mantequilla y azúcar, batiendo bien para incorporar completamente cada huevo antes de agregar el siguiente huevo.", "Agregue el espresso a la mezcla y mezcle bien.", "Agregue la harina y las nueces y mezcle bien para combinar completamente.", "Con una cuchara, mezcle la torta en dos latas de torta alineadas y engrasadas de 20 cm / 8 in.", "Transfiera al horno para hornear de 25 a 30 minutos, o hasta que un pincho insertado en el centro del pastel salga limpio y el pastel esté dorado.", "Retire los pasteles del horno y déjelos enfriar en una rejilla de alambre.", "Para el aderezo de crema de mantequilla, bata la mantequilla y el azúcar glas juntos en un tazón pequeño hasta que estén pálidos y claros.", "Agregue el espresso y mezcle bien.", "Extienda la crema de mantequilla sobre la parte superior de cada pastel, luego coloque una torta encima de la otra.", "Decora la parte superior de la torta con las mitades de nuez y sirve en rebanadas generosas."], "url": "www_bbc_co_uk_food_recipes_coffeeandwalnutcake_87248", "title": "Pastel de café y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffeeandwalnutcake_87248_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["570 ml / 1 pinta de helado de café de buena calidad, ligeramente suavizado", "Chocolate oscuro de 255 g / 9 oz, rallado", "cacao en polvo y azúcar glas, para quitar el polvo", "Mantequilla 110g / 4oz ablandada", "Azúcar glas de 140g / 5oz", "Harina común 110g / 4oz", "3 huevos, solo blancos", "1 cucharada de gránulos de café instantáneo", "2 cucharadas de azúcar en polvo", "120ml / 4fl oz de crema doble"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer los tallos de los champiñones, toma cuatro montículos de dariole grandes o cuatro pequeños o vasos de chupito de vodka y cúbrelos con una película adhesiva. Rellene con el helado ligeramente suavizado y vuelva a congelar hasta que vuelva a endurecerse.", "Para hacer los tuiles, unte la mantequilla y el azúcar. Agregue lentamente las claras de huevo a la mezcla, luego agregue la harina. Usando una plantilla redonda grande y una pequeña (tapas de margarina: corte un círculo de la tapa y colóquelo en una bandeja para hornear, con la boca hacia arriba y extienda la mezcla tuile sobre el orificio con una espátula, luego levante la plantilla para dejarla un círculo perfecto) - necesitarás 4 de cada tamaño. Hornee en el horno precalentado durante 2-3 minutos hasta que quede ligeramente coloreado en los bordes. Retire y coloque cada disco de tuile sobre una taza de huevo o similar hasta que esté frío. La tuile blanda se doblará en forma de tapa de hongo y se volverá crujiente.", "Disolviendo el café y el azúcar con un poco de agua hirviendo para hacer un jarabe. Revuelva el jarabe de café enfriado en la crema doble, haciendo una salsa de café.", "Para servir, esparza las rejas en un círculo alrededor de los bordes de cuatro platos para servir. Ponga un poco de salsa de café en el centro. Desmolde el helado, retire la película adhesiva y coloque los tallos en posición vertical sobre el grupo de salsa, uno de cada tamaño en cada plato.", "Para hacer las tapas de champiñones, voltee las tuiles con el domo hacia arriba. Usando un pequeño tamiz, espolvoree las cúpulas tuiles con cacao en polvo y azúcar glasé. Coloque las tapas pequeñas en los tallos pequeños y las tapas grandes en los tallos grandes. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_coffeemushrooms_68104", "title": "Setas de café", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["8 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "250ml / 9fl oz de vino de postre dulce y afrutado, como Monbazillac o Beaume de Venice", "pizca de cayena pequeña pizca", "1-2 cucharaditas de jugo de limón recién exprimido", "Crema batida de 200 ml / 7 onzas líquidas, batida hasta que se formen picos suaves cuando se quite el batidor", "Esencia de café 50ml / 2fl oz o café fuerte enfriado", "salsa de caramelo (opcional)", "crema de vainilla (opcional)", "nueces tostadas picadas", "cacao en polvo, para quitar el polvo"], "method": ["Batir las yemas de huevo, el azúcar y el vino de postre juntos en un tazón grande y resistente al calor hasta que estén pálidos y esponjosos.", "Coloque el recipiente sobre una olla con agua apenas hervida y continúe batiendo durante 3-4 minutos, o hasta que la mezcla esté pálida y espesa (la temperatura de la mezcla debe alcanzar aproximadamente 78-80 ° C / 175 ° F).", "Retire del fuego, coloque el recipiente en un recipiente más grande con agua helada y bata de nuevo hasta que se enfríe.", "Agregue la pimienta de cayena y el jugo de limón. Dejar de lado hasta que esté completamente frío.", "Bata un tercio de la crema batida en la mezcla enfriada de sabayon, luego dobla cuidadosamente la crema restante hasta que se combine.", "Dobla la esencia del café cuidadosamente en el sabayon hasta que se combinen.", "Coloque la mezcla en una lata de pan de 1,2 kg / 2 lb 10¼ oz y nivele la parte superior con una espátula. Enfríe en el congelador durante al menos 12 horas o hasta que se solidifique.", "Cuando esté listo para servir, retire el parfait de café del congelador y sumerja la lata de pan en agua caliente para aflojar el parfait de la lata. Pase un cuchillo romo alrededor del parfait, luego gírelo en una placa rectangular larga.", "Para servir, corta el parfait de café y sírvelo con salsa de caramelo o crema de vainilla, si lo usas. Espolvoree con nueces tostadas picadas y polvo con cacao en polvo."], "url": "www_bbc_co_uk_food_recipes_coffeeparfait_93225", "title": "Café perfecto", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Rinde 1,4 litros / 2 pintas a 10 fl oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb2oz de patatas harinas, cocidas", "Repollo de 250g / 9oz, rallado y ligeramente cocido al vapor", "2 cucharadas de crema (opcional)", "sal y pimienta negra", "1 cebolla grande o 2 cebollas pequeñas, en rodajas finas", "un poco de grasa de tocino, goteo de carne u otro aceite, para freír"], "method": ["Tamizar o machacar las papas y mezclar con el repollo y la crema. Sazonar bien con sal y pimienta.", "Freír la cebolla en la grasa a fuego moderado hasta que esté suave y empiece a dorarse.", "Usando una espátula, presione la mitad de la mezcla de papa y repollo en una capa uniforme sobre la cebolla y fría durante 4-5 minutos hasta que esté bien dorado y crujiente por debajo.", "Corte la mezcla en 4 cuartos con la espátula o espátula y gírelos cuidadosamente para que la broca crujiente quede arriba. Presione la mezcla restante de papa y repollo en la primera capa y luego de unos minutos más, corte y vuelva a doblar.", "Cuando el fondo esté nuevamente dorado, también tendrás una parte superior crujiente, un fondo crujiente y una capa crujiente en el medio."], "url": "www_bbc_co_uk_food_recipes_colcannon_13802", "title": "Colcannon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2 o 4 como guarnición", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/colcannon_13802_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de Cointreau", "1 naranja, ralladura solamente", "2 cucharadas de jugo de naranja recién exprimido", "1 cucharadita de azúcar", "300 ml / 10 fl oz doble crema"], "method": ["Caliente el Cointreau en una olla pequeña y deje que hierva.", "Agregue la ralladura de naranja y cocine a fuego lento hasta que el Cointreau se haya reducido a la mitad.", "Agregue el jugo de naranja, el azúcar y la crema. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 2-3 minutos."], "url": "www_bbc_co_uk_food_recipes_cointreaucream_70906", "title": "Crema Cointreau", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Arroz de grano largo italiano fácil cocinar 350g / 12oz", "2 pechugas medianas de pollo", "2 pimientos amarillos enteros", "1 pimiento rojo entero", "2 limones", "8 cucharadas de aceite de oliva virgen extra italiano", "perejil de hoja plana, picado", "hoja de lechuga", "puñado de nueces", "sal y pimienta recién molida al gusto"], "method": ["Hervir el arroz y dejar enfriar.", "Ase el pollo en cada lado hasta que esté cocido y déjelo enfriar. Corte en tiras de ½ cm / ¼ in.", "Asar los pimientos en el horno durante aproximadamente 20 minutos. Una vez que se haya enfriado, pelar la piel, sacar las semillas y cortarlas en tiras de aproximadamente ½ cm / ¼ en cada una.", "En un tazón grande mezcle el pollo y los pimientos juntos. Agregue las nueces y sal y pimienta al gusto. Exprime los dos limones enteros y la virgen extra y revuelve bien. Por último, agregue el arroz y déjelo reposar durante 5 minutos antes de servir.", "Coloque una hoja grande de lechuga en un plato y agregue la mezcla de risotto en el medio, decore con un poco de perejil. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_coldchickenandpepper_70263", "title": "Risotto de pollo y pimienta fría (risotto de pollo frío)", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de mostaza Dijon", "1 limón, solo jugo", "8 cucharadas de aceite de oliva", "2 ramitas de estragón", "1 diente de ajo, pelado", "sal y pimienta negra recién molida", "2 x 600 g / 1 libra de langostas cocidas de 5 oz", "1 bulbo de hinojo, cortado y finamente picado", "2 palitos de apio, finamente picado", "1 cebolla, finamente picada", "cáscaras de langosta (desde arriba)", "150ml / 5fl oz de vino blanco", "300 ml / 10 fl oz de caldo de pollo o agua", "200ml / 7fl oz crema", "8 patatas nuevas cocidas, enfriadas y peladas", "4 gema bebé deja", "una mezcla de hojas de berro o micro", "2 tomates, pelados y sin semillas, cortados en cubitos"], "method": ["Para hacer la vinagreta, bata la mostaza y el jugo de limón en un tazón. Poco a poco agregue 6 cucharadas de aceite de oliva. Agregue el estragón y el diente de ajo y déjelos para infundir. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Recoge la carne de las langostas y ponla a un lado en un recipiente en la nevera, reservando las conchas.", "Caliente una cacerola a fuego medio. Agregue las dos cucharadas soperas restantes de aceite, hinojo picado, apio y cebolla y fría hasta que se ablanden. Agregue las cáscaras de langosta y fría por 2-3 minutos.", "Agregue el vino blanco y cocine a fuego lento. Agregue el caldo o el agua, vuelva a hervir a fuego lento durante una hora, luego cuele el caldo a través de un colador fino.", "Vuelva a colocar el líquido en una olla y agregue la crema. Cocine a fuego lento durante 30 minutos, o hasta que el volumen del líquido se haya reducido a la mitad y espesado. Sazonar con sal y pimienta y dejar enfriar. Enfríe la crema de langosta en el refrigerador hasta que esté lista para servir.", "Cortar las papas nuevas en rondas finas. Organice las rondas en el anillo de un cocinero en cada plato de servir para crear una base circular. Retire el anillo de los cocineros.", "Coloque una hoja de Baby Gem en las papas. Vierta ligeramente la carne de langosta con un poco de vinagreta de estragón, luego mezcle con la Gema para bebés. Coloque un puñado pequeño de berros mezclados encima de la langosta. Coloque el tomate cortado en cubitos alrededor del borde del plato y luego vístelo con un poco de la crema de langosta fría."], "url": "www_bbc_co_uk_food_recipes_cold_lobster_salad_with_50725", "title": "Ensalada de langosta fría con vinagreta de estragón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pepino, rebanado por la mitad a lo largo, semillas raspadas usando una cucharadita", "Manzana 20g / ¾oz rallada", "20g / ¾oz de zanahoria rallada", "20g / ¾oz de remolacha cocida, rallada", "30g / 1¼ oz de queso crema", "15 g / ½ oz de pasas"], "method": ["Corta el pepino en cuatro pedazos.", "Mezcle la manzana, la zanahoria y la remolacha en un tazón. Agregue el queso crema hasta que esté bien combinado.", "Llene cada pedazo de pepino con un poco de la mezcla de queso crema.", "Espolvoree cada pieza de pepino llena de pasas. Envuelva por separado en film transparente y enfríe en el refrigerador hasta que lo necesite."], "url": "www_bbc_co_uk_food_recipes_coleslaw_cucumber_sticks_70231", "title": "Coleslaw pepino palos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Col blanca de 450 g / 1 lb", "1 cebolla pequeña (opcional)", "1 zanahoria pequeña (opcional)", "30g / 1 oz de azúcar", "una pizca de cayena o chile en polvo", "Harina normal de 30g / 1oz", "2 huevos, solo yemas", "un buen botón de mantequilla", "175ml / 6fl oz de leche entera", "55ml / 2fl oz de vinagre de vino tinto", "1-2 cucharaditas de mostaza inglesa"], "method": ["Ralla o ralla la col, las zanahorias y las cebollas (si las estás usando). Póngalos en un tazón grande y déjelos a un lado.", "Mezcle el azúcar, la pimienta de cayena y la harina en un recipiente que entrará en la caldera doble. Sazonar bien con sal y pimienta. Ahora mezcle todos los ingredientes restantes, excepto la mostaza, en el orden en que aparecen en la lista. Mientras tanto, caliente el agua en el fondo de la caldera doble.", "Coloque el recipiente sobre el fuego y comience a batir. No se detenga por más de unos momentos mientras la mezcla se está cocinando. Cocinar le llevará algo así como 15 minutos, y sabrá que la salsa está hecha cuando es lo suficientemente espesa como para cubrir la parte posterior de una cuchara. Cuele en un tazón limpio para eliminar los grumos y mezcle la mostaza. (Use la cantidad más grande si quiere un resultado más caliente, más pequeño si solo quiere un acento mustardy).", "Mezcle la ensalada con la mitad del aderezo y mezcle. Si necesita más, agréguelo en pequeñas dosis hasta que haya alcanzado la consistencia deseada. Sirva inmediatamente o váyase, cubierto, en el refrigerador, por 1-2 días con 1 o 2 lanzamientos al día."], "url": "www_bbc_co_uk_food_recipes_coleslaw_68108", "title": "Ensalada de col", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coleslaw_68108_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120ml / 4fl oz de aceite de oliva virgen extra", "1 limón, solo jugo", "2 tomates, pieles y semillas retiradas, carne cortada en cubitos", "1 chalote, pelado, finamente picado", "1 diente de ajo pequeño, pelado, finamente picado", "3 cucharadas de estragón fresco picado", "4 x 175 g / 6oz de filetes de coley", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "½ limón, solo jugo", "Ensalada verde ligeramente vestida, para servir"], "method": ["Para la salsa vierge, vierta el aceite de oliva en una sartén no reactiva. Batir el jugo de limón hasta que esté bien combinado. Agregue los tomates picados, chalota y ajo.", "Calentar la sartén a fuego medio hasta que la mezcla de salsa vierge se caliente por completo. Agregue el estragón y condimente, al gusto, con sal y pimienta negra recién molida. Dejar de lado.", "Para el coley, sazonar el filete Coley con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén no reactiva a fuego medio. Agregue los filetes de coley sazonados, con la piel hacia abajo, y fría durante 1-2 minutos hasta que estén dorados.", "Voltee los filetes con una rebanada de pescado y cocine durante 1-2 minutos más, o hasta que estén recién cocidos.", "Rocíe el jugo de limón sobre los filetes de pescado y retírelo del fuego.", "Para servir, coloque los filetes de coley en el centro de un plato de servir. Rocíe sobre la vierge de salsa de estragón (bata la vierge de salsa de estragón antes de servir hasta que esté bien combinada). Coloque la ensalada verde al lado."], "url": "www_bbc_co_uk_food_recipes_coleywithtarragonsau_90925", "title": "Coley con salsa de estragón vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coleywithtarragonsau_90925_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo", "4 muslos de pollo", "cabeza de ajo (opcional)", "ramitas de tomillo fresco (opcional)", "100 g / 3½ oz de harina", "1 cucharadita de comino molido", "1 cucharadita de pimienta de cayena", "1 cucharadita de sal de apio", "½ cucharadita de mostaza en polvo inglesa", "½ cucharadita de sal", "300ml / 10½ fl oz de leche", "1 litro / 1¾ pintas de aceite vegetal", "4 papas, horneadas hasta que estén tiernas, luego enfriadas en la nevera durante la noche", "½ repollo Savoy, núcleo removido, finamente triturado", "1 pepinillo grande, cortado, rallado", "2 zanahorias, cortadas, peladas, ralladas", "1 cebolla roja, pelada, cortada a la mitad, finamente cortada", "100 g / 3½ oz de mayonesa lista para usar"], "method": ["Coloque los muslos de pollo y las baquetas, la cabeza de ajo (si usa) y las ramitas de tomillo (si usa) en una sartén grande y cúbralas con agua fría.", "Ponga a hervir el agua, luego reduzca el fuego hasta que el agua hierva a fuego lento. Continúe cocinando a fuego lento durante 25-30 minutos, o hasta que las piezas de pollo estén cocidas.", "Retire la sartén del fuego y reserve. Cuando el pollo se haya enfriado, en el caldo, enfríelo, cubra, en el refrigerador hasta que lo necesite (pero no más de una noche).", "En un tazón, mezcle la harina, el comino molido, la pimienta de cayena, la sal de apio, el polvo de mostaza y la sal hasta que estén bien combinados.", "Retire las piezas de pollo refrigerado del caldo con pinzas y seque con papel de cocina. Retire la piel si lo desea. (El líquido de cocción restante se puede reservar en la nevera por hasta tres días y se puede usar como reserva en otra receta. Alternativamente, se puede congelar hasta que se necesite).", "Dragar las piezas de pollo en la harina especiada hasta que estén cubiertas.", "Vierta la leche en un recipiente y sumerja cada trozo de pollo enharinado hasta que esté cubierto.", "Dragar las piezas de pollo en la harina especiada por segunda vez. (NB: el doble recubrimiento de las piezas de pollo las hará más crujientes).", "Vierta el aceite vegetal en una sartén grande hasta que alcance los 10 cm por los lados de la sartén. (PRECAUCIÓN: No llene demasiado la bandeja, la bandeja debe estar solo hasta la mitad con aceite. El aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Caliente el aceite a 170 ° C (use un termómetro de cocción para probar la temperatura; alternativamente, caliente el aceite en una freidora). Cuando una migaja de pan se deja caer en el aceite, chisporrotea y se dore, baje suavemente las piezas de pollo, en tandas, en el aceite caliente con una cuchara ranurada.", "Freír durante 4-5 minutos, o hasta que estén crujientes, doradas y completamente cocidas. Retire las piezas de pollo de la sartén con una espumadera y déjelas a un lado para escurrirlas sobre papel de cocina. Mantener caliente", "Repita el proceso con las piezas de pollo restantes.", "Corte las papas heladas al horno en trozos, seque con papel de cocina, luego bájelos, en tandas, en el aceite caliente. Freír por 2-3 minutos, o hasta que estén crujientes y doradas. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Mantener caliente", "Repita el proceso con las cuñas restantes de papa.", "Mientras tanto, en un tazón, mezcle todas las verduras y la mayonesa hasta que la mezcla esté bien combinada y se asemeje a la ensalada de col.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_colonelmerrettsbucke_91985", "title": "El cubo de pollo del coronel Merrett", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "1 cebolla grande picada", "2 zanahorias medianas, picadas", "560 g / 1¼ lb de carne de res picada", "400g / 14oz puede tomates", "290ml / 10fl oz de caldo de carne", "1 hoja de laurel", "tomillo fresco hojas de 1 ramita", "2 cucharadas de puré de tomate", "sal y pimienta negra recién molida", "Papas 750g / 1½ lb, peladas y picadas", "Pastinacas 225g / 8oz, peladas y picadas", "2 cucharaditas de rábano picante batido", "75 g / 2½ oz de mantequilla", "55ml / 2fl de leche en oz"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Calienta el aceite en una sartén grande. Agregue la cebolla y la zanahoria y cocine a fuego medio durante cinco minutos hasta que estén suaves.", "Agregue la carne picada y cocine durante tres minutos para dorar.", "Agregue los tomates, el puré, el caldo de carne, la hoja de laurel y el tomillo.", "Cubra y cocine a fuego lento durante 30 minutos. Temporada.", "Mientras tanto, para hacer el relleno, hierva las papas y las chirivías en agua hasta que estén blandas. Escurrir y macerar con la mantequilla y la leche. Agregue el rábano picante y sazone con sal y pimienta.", "Coloque la carne en un plato resistente al horno. Cubra con el puré y hornee durante 30 minutos hasta que estén doradas."], "url": "www_bbc_co_uk_food_recipes_comfortingcottagepie_14505", "title": "Cómodo pastel de casa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/comfortingcottagepie_14505_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["700 g / 1½ lb, aproximadamente 24 chalotes pequeños, de un solo tamaño, pelados y dejados enteros (los que se dividen en gemelos cuentan como 2)", "55ml / 2fl oz de vinagre de vino tinto", "400ml / 14fl oz de vino tinto seco", "1 cucharadita de azúcar", "sal"], "method": ["Use una cacerola amplia y poco profunda que tomará los chalotes en una capa, luego simplemente coloque todos los ingredientes anteriores, excepto el azúcar, y lleve todo hasta el punto de cocción lenta. Luego baje la temperatura a su nivel más bajo y deje que los chalotes hiervan a fuego lento (solo unas pocas burbujas que rompen la superficie) durante 1-1¼ horas. Dé vuelta las chalotas al medio tiempo, y 10 minutos antes del final del tiempo de cocción, espolvoree el azúcar. Deberías terminar con chalotes tiernos que brillan con un hermoso glaseado. Si su fuente de calor no es lo suficientemente baja, es posible que necesite usar un difusor. Si es más conveniente, puede cocinar las chalotas por adelantado y volver a calentarlas suavemente antes de servirlas."], "url": "www_bbc_co_uk_food_recipes_compoteofglazedshall_67193", "title": "Compôte de chalotes glaseados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["pavo sobrante, picado", "papas nuevas (cerosas), idealmente Pink Fir Apple o Ratte", "½-1 lata pequeña de anchoas, picada aproximadamente (según la cantidad de pavo que tenga y cuánto le gusten las anchoas)", "½ diente de ajo, triturado hasta obtener un puré con un tenedor", "pocas cebolletas, o 1 cebolla roja pequeña, cortada en rodajas finas", "aceite de oliva", "jugo de limon", "perejil fresco"], "method": ["Mezcle las anchoas con el ajo, 1 cucharada de aceite de oliva y un chorrito de limón.", "Mezcle esta mezcla con el pavo y la cebolla y deje que se macere mientras hierve algunas papas nuevas hasta que estén tiernas.", "Rebane las papas cuando aún estén calientes y mezcle inmediatamente con el pavo y algunas hojas de perejil fresco picado."], "url": "www_bbc_co_uk_food_recipes_coldturkeywithpotato_14226", "title": "Ensalada de pavo caliente con anchoas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 peras", "1 manzana", "2 nectarinas", "½ limón, solo jugo", "1 plátano, más o menos cortado en discos", "3 cucharadas de azúcar en polvo de oro", "Harina normal de 200g / 7oz", "100 g / 3½ oz de mantequilla", "60 g / 2¼ oz de avena", "1 gran puñado de semillas de calabaza", "30g / 1oz de almendras en copos", "2 cucharadas de semillas de sésamo", "4 cucharadas de azúcar demerara", "crema o crema"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Picar las peras, manzana y nectarinas y colocar en una sartén a fuego lento con el jugo de limón. Calentar durante 10 minutos.", "Para la cobertura de crumble, en un tazón, frote la harina y la mantequilla con las manos hasta que se asemeje a pan rallado. Agregue los ingredientes secos restantes y el azúcar demerara. Dejar de lado.", "Tome una lata pequeña para asar. Coloque la fruta tibia en la parte inferior, junto con el plátano picado. Espolvorea con el azúcar impalpable de oro.", "Cubra con la mezcla de crumble y hornee durante 20-30 minutos, o hasta que la cobertura esté dorada. Sirva inmediatamente con crema o natillas."], "url": "www_bbc_co_uk_food_recipes_compost_crumble_38208", "title": "Crumble de compost", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-7", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/compost_crumble_38208_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Porciones de salmón 4 x 75g / 3oz, cuadrado cortado por el medio", "½ limón", "Vinagreta de 125ml / 4fl oz", "Pesto 125ml / 4fl oz (hecho en casa o comprado en la tienda)", "50g / 2oz de guisantes frescos blanqueados, picados aproximadamente", "Habas blanqueadas 50g / 2oz, picado aproximadamente", "¼ manojo de menta, picado", "Condimento", "1 manojo de berros", "Cohete 50g / 2oz", "50 g / 2 oz de acelga de rubí o mostaza roja"], "method": ["Ponga el salmón en una sartén caliente y termine en el horno a 180 ° C / 350 ° F / Gas 4, cocinando durante 5-8 minutos.", "Exprime el limón y coloca la vinagreta sobre el salmón. Dejar enfriar, colocar en un recipiente y refrigerar.", "Para el pesto, mezcle todos los ingredientes en un tazón y sazone. Poner en un recipiente y refrigerar.", "Para la ensalada, lava y recoge las hojas y colócalas en un recipiente.", "Para servir, coloque el salmón en un plato, rocíe con pesto grueso y la ensalada mixta de hojas con vinagreta."], "url": "www_bbc_co_uk_food_recipes_coldsearedsalmonchun_11735", "title": "Salmón chamuscado en frío con pesto grueso de frijoles y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["225g / 8oz de queso azul, desmenuzado", "Crema doble 225ml / 8fl oz", "80g / 3oz de mantequilla sin sal, cortada en cubos pequeños", "4 x winglets de pollo", "grasa de pato o aceite vegetal para cubrir las aletillas", "100ml / 3½fl oz de vinagre de vino blanco", "100ml / 3½fl oz de aceite de oliva de orujo", "1 chalota de plátano, en rodajas finas", "2 cucharaditas de pimienta blanca", "2 cucharaditas de semillas de cilantro", "½ cucharadita de sal marina", "Carne de calabaza de 200g / 7oz, cortada en cubos de 1cm / ½ pulgada", "100g / 3½oz de mantequilla sin sal", "500g / 1lb 2 oz de carne de calabaza, cortada en cuadrados de 3 cm / 1 ¼ pulgadas", "100ml / 3½fl oz de caldo de verduras o agua", "sal marina", "1 hoja de alga nori", "50g / 1¾oz de col rizada seca", "Algas wakame 10g / ½ oz", "1 cucharadita de semillas de sésamo blanco", "1 cucharadita de semillas de sésamo negro", "pizca de pimentón dulce ahumado", "10 g / ½ oz de semillas de girasol", "10g / ½ oz de semillas de calabaza", "Quinua hinchada 10g / ½oz"], "method": ["Para la mousse, pon el queso y la crema en una cacerola de base pesada a fuego medio, revuelve y lleva a ebullición. Agregue la mantequilla hasta que se mezcle. Cuele en un recipiente pequeño, cubra y enfríe durante 3 horas.", "Mientras tanto, ponga las alitas de pollo en una bandeja pequeña para asar y espolvoree ligeramente con sal. Cubra con película adhesiva y enfríe durante 1 hora. Precalentar el horno a 90 C / Gas 1/4. Lave la sal de las aletillas y séquelas con papel de cocina. Devuélvalos a la bandeja y cubra completamente con la grasa de pato derretida. Hornee durante 1 hora y media o hasta que el pollo esté suave y cocido. Retire el pollo de la grasa, reservando la grasa. Mientras está caliente, saque la carne de los huesos, colóquela en una bandeja para hornear y cubra con otra bandeja con peso. Dejar hasta que se establezca.", "Mientras tanto, para la calabaza encurtida, ponga todos los ingredientes aparte de la calabaza en una cacerola. Agregue 200 ml / ½ pinta de agua, luego hierva y cocine durante 2 minutos. Cuele en una cacerola separada, agregue la calabaza y cocine a fuego lento durante 4 minutos. Deja enfriar.", "Para el puré de calabaza, derrita la mantequilla en una cacerola grande de base pesada a fuego medio-bajo. Agregue la calabaza y fría por 5 minutos, pero no coloree. Vierta el caldo y cocine a fuego lento hasta que esté suave. Incline en una licuadora y mezcle hasta que quede suave. Sazonar con sal al gusto.", "Para el aliño de algas marinas, coloque todos los ingredientes en un procesador de alimentos y mezcle con un polvo suave. Puede almacenarlo en un recipiente hermético.", "Para el crujido de calabaza, mezcle todos los ingredientes en un tazón pequeño.", "Para servir, coloca el puré de calabaza en el centro de un recipiente para servir poco profundo. Cucharee el pepinillo de calabaza y cruje alrededor del exterior. En una sartén antiadherente, fríe la carne de las alas en un poco de la grasa de pato hasta que quede crujiente, luego coloca encima del puré. Usando una cucharilla caliente, coloque la mousse en el winglet, luego espolvoree ligeramente con el aliño de algas marinas y sirva."], "url": "www_bbc_co_uk_food_recipes_confit_chicken_wing_with_01511", "title": "Ala de pollo confitada con mousse de queso azul y calabaza encurtida", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 patas de pato, preferiblemente de patos de Berbería de granja, alimentados con maíz, cada uno de aproximadamente 175 g / 6 oz, incluida la grasa", "40g / 1½oz de sal marina", "pimienta negra recién molida", "4 dientes de ajo sin pelar y aplastados con el borde plano de un cuchillo", "4 ramitas de tomillo, solo hojas", "1 kg / 2 libras 4 oz de ganso o grasa de pato, derretida", "2 cucharadas de miel", "200g / 7oz de lentejas Puy, enjuagadas", "1 chalote, finamente picado", "1 zanahoria pequeña, pelada y cortada en cubitos", "1 bouquet garni hecho con 1 ramita de tomillo y 1 ramita de perejil, atados con una cuerda de cocina", "1 diente de ajo, sin pelar", "2-3 cucharadas de vinagreta", "1 puñado de perifollo, hojas solo, picadas"], "method": ["Para hacer confitado el pato, coloque las patas de pato en una bandeja pequeña y poco profunda, con la piel hacia abajo, y sazone con sal, pimienta, ajo y tomillo. Cubra con película adhesiva, presione hacia abajo y deje marinar durante 2-3 horas en la nevera.", "Precalentar el horno a 140C / 275F / Gas 1.", "Saca el pato de la bandeja y descarta el adobo. Enjuague con agua corriente fría y seque con papel de cocina.", "Coloque el pato en una cacerola grande de base pesada o en una sartén de hierro fundido y vierta la grasa de ganso derretida encima. Cubra con una tapa o papel resistente a las grasas sellado con papel de aluminio, colóquelo en el horno y hornee durante 3-4 horas, o puede hervir a fuego lento el pato en la estufa, tapado con una tapa, durante 3-4 horas.", "Retire del horno, o quite el fuego si está cocinando en la estufa, quite la grasa y cubra con papel de aluminio y reserve.", "Mientras tanto, cocina las lentejas. Colóquelos en una olla pequeña y cubra con agua fría. Llevar a ebullición y raspar la espuma blanca de la superficie. Agregue la chalota, la zanahoria, el bouquet garni y el ajo, reduzca el fuego y cocine a fuego lento por otros 10 minutos o hasta que esté al dente.", "Cuele las lentejas, reservando dos cucharadas de líquido de cocción. Deseche la chalota, bouquet garni y ajo. Agregue la vinagreta, el líquido de cocción reservado y el perifollo. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cepille las patas de pato con la miel y tápelas con la piel hacia abajo, en una sartén antiadherente a fuego medio durante cinco minutos o hasta que estén crujientes y doradas. La miel se caramelizará muy rápido, así que ten cuidado de no dejar que se queme.", "Para servir, coloque las lentejas en platos para servir y cubra con las patas de pato. Alternativamente, acomode las patas de pato encima de las lentejas en una olla grande y sirva en la mesa."], "url": "www_bbc_co_uk_food_recipes_confit_de_canard_aux_68185", "title": "Pato confitado con lentejas", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "6 salchichas de cerdo de buena calidad", "1 chalote, finamente picado", "½ cucharadita de hojas frescas de romero picadas", "1 diente de ajo, finamente picado", "200g / 7oz de tomates picados en lata", "60ml / 2¼fl oz de caldo de pollo", "Frijoles de flageolet enlatados de 200g / 7oz, escurridos y enjuagados", "½ cucharada de perejil fresco de flatleaf", "Tocino panceta 50g / 1oz", "2 patas de pato confitadas (disponibles en delicatessens), huesos retirados, carne picada", "275ml / 9¼fl oz de caldo de pollo", "1 cucharadita de hojas de romero fresco tostadas", "1 cucharada de hojas frescas de perejil de flatleaf picadas", "4 rebanadas gruesas de pan de masa fermentada", "500g / 1lb 2oz de papas harinas, como King Edward, peladas y picadas", "50 g / 1¾oz de mantequilla sin sal", "5-6 cucharadas de crema doble", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para los frijoles horneados y las salchichas, caliente una cucharada de aceite en una sartén a prueba de horno a fuego medio. Agregue las salchichas y fría por 2-3 minutos, o hasta que estén doradas por todos lados. Transfiera la sartén al horno y continúe cocinando durante 10-12 minutos, o hasta que esté cocida. Retire de la sartén y reserve.", "Mientras tanto, caliente otra cucharada de aceite en una sartén separada a fuego medio. Agregue los chalotes y fría por 2-3 minutos, o hasta que estén blandos. Agregue el romero y el ajo y fría por 1-2 minutos más.", "Agregue los tomates picados y llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Agregue el caldo y los frijoles, deje que la mezcla hierva a fuego lento y cocine durante 3-4 minutos, o hasta que la salsa se haya espesado un poco.", "Agregue el perejil y sazone, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para el cassoulet y el puré, caliente una cacerola a fuego medio a prueba de horno a fuego medio. Agregue los lardons de panceta y fría hasta que estén crujientes y dorados. A continuación, agregue el confit de pato.", "Agregue las salchichas cocidas y la mezcla de frijoles, luego vierta sobre el caldo y deje que la mezcla hierva a fuego lento. Agregue el romero y el perejil y sazone al gusto con sal y pimienta negra recién molida.", "Mientras tanto, caliente una sartén a fuego medio. Rocíe un poco de la cucharada restante de aceite en cada lado de las rebanadas de pan. Ase el pan durante 1-2 minutos en cada lado, o hasta que aparezcan marcas doradas en ambos lados.", "En un procesador de alimentos, mezcle la masa madre tostada con pan rallado. Espolvoree las migas de pan en la parte superior del cassoulet y hornee por 5-10 minutos, o hasta que la salsa se haya espesado un poco.", "Mientras tanto, hierva las papas en una sartén de agua con sal durante 12-15 minutos, o hasta que estén tiernas. Drene bien y regrese a la sartén, luego regrese la sartén al fuego durante 1-2 minutos para que se evapore el exceso de humedad.", "Aplaste las papas hasta que estén suaves (de preferencia con un ricero de patata), luego bata la mantequilla y doble crema hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida el puré entre los platos y sirva sobre el cassoulet."], "url": "www_bbc_co_uk_food_recipes_confit_duck_cassoulet_12263", "title": "Cassoulet de pato confitado con puré de aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]