[{"ingredients": ["1 cabeza de achicoria, dividida en 6 hojas individuales", "55g / 2oz de queso de cabra, desmenuzado", "55 g / 2 oz de patatas nuevas cocidas, picadas", "55g / 2oz de guisantes cocidos", "Nueces de 30g / 1oz, más o menos picadas", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "1 cucharada de miel clara", "1 cucharadita de mostaza integral", "sal y pimienta negra recién molida"], "method": ["Coloque las seis hojas de achicoria en un plato de servir.", "En un tazón pequeño, mezcle el queso de cabra, las papas, los guisantes y las nueces juntas hasta que se combinen.", "Para el aderezo, en un tazón pequeño mezcle todos los ingredientes del aderezo y mezcle el queso de cabra y la mezcla de papa.", "Coloque la mezcla de queso de cabra en las hojas de achicoria y sazone con sal y pimienta negra recién molida.", "Enfriar hasta que se requiera y servir."], "url": "www_bbc_co_uk_food_recipes_nuttychicorycanapes_87040", "title": "Canapés de achicoria nuez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["120 g / 4oz de avena jumbo enrollada", "30g / 1oz de arroz inflado no endulzado (no cereal de arroz crujiente)", "75g / 2½oz de almendras copos tostadas", "25 g / 1 oz mezcla de semillas", "130g / 4½oz de fechas empedradas, picadas", "50 g / 1¾oz de chips de chocolate negro (opcional)", "40 g / 1½ oz pasas o bayas secas de su elección", "100g / 3½ oz de mantequilla de maní crujiente", "90g / 3¼ oz de miel"], "method": ["Cubra una lata cuadrada de 20cm / 8in o 23cm / 9in con papel para hornear.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Extiende la avena en una bandeja para hornear y hornea por unos 10 minutos hasta que huelan bien y tostado. Dejar de lado para enfriar. (Puede omitir este paso, pero hace que las barras sean más crujientes).", "Mezcle la avena tostada, el arroz inflado, las almendras, las semillas, las fechas picadas, las chispas de chocolate y las pasas en un tazón grande.", "Derrita la mantequilla de maní y la miel en una cacerola pequeña a fuego suave. Revuelva hasta que la mezcla esté suave y completamente combinada. Mientras todavía está caliente, mezcle la mantequilla de maní y la miel en la mezcla de avena (puede que tenga que poner las manos allí) para cubrir completamente toda la avena, los frutos secos y la fruta.", "Incline la mezcla en la lata forrada y presione firmemente para formar una capa uniforme. Las manos húmedas hacen que este trabajo menos pegajoso. Coloque la lata en el congelador durante 20 minutos para reafirmarla antes de cortarla en 15 bares. Envuelva cada barra en una película adhesiva para mantenerlos frescos, y están listos para estallar en un almuerzo."], "url": "www_bbc_co_uk_food_recipes_nutty_oat_energy_bars_48616", "title": "Barras de energía de avena Nutty", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15 barras", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nutty_oat_energy_bars_48616_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 manzanas Cox", "6 palos de hielo de madera pequeños", "225g / 8oz de azúcar granulada", "110 ml / 4 fl oz de agua", "30g / 1oz de mantequilla", "2 cucharadas de jarabe de oro", "4 cucharadas de nueces mixtas finamente picadas"], "method": ["Empuja los palos de madera hasta la mitad de las manzanas en el extremo del tallo.", "Disuelva el azúcar y el agua en una sartén de fondo grueso a fuego suave.", "Agregue la mantequilla y el jarabe a la mezcla y deje que hierva. Continúe hirviendo, sin remover, hasta que el caramelo alcance 140C / 275F (use un termómetro de azúcar para medir esto).", "Retire la sartén del fuego y mezcle suavemente las nueces.", "Con cuidado sumerja cada manzana en el caramelo, asegurándose de que cada manzana esté bien cubierta, y déjela a un lado para que se endurezca en un intento de hornear forrado con un pergamino antiadherente."], "url": "www_bbc_co_uk_food_recipes_nuttytoffeeapples_68088", "title": "Manzanas Nutty toffee", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nuttytoffeeapples_68088_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["140g / 5oz de mantequilla", "100g / 3½oz de avena jumbo", "100 g / 3½ oz de avena", "2 cebollas rojas, más o menos picadas", "200 g / 7 oz de pistachos", "4 higos, picados, con piel", "8 ramitas de tomillo", "600g / 1lb 5oz de carne de salchicha"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita 100 g / 3½ onzas de mantequilla en una sartén, agregue ambos tipos de avena y cocine durante tres minutos. Transfiera a un plato mezclador más grande.", "Derrita 40 g / 1½ oz de mantequilla en la sartén y cocine las cebollas rojas picadas hasta que se ablanden.", "Agregue los pistachos e higos y rasgue en el tomillo. Cálmate durante dos minutos. Transfiera al tazón con la avena.", "Finalmente agregue la carne de salchicha al cuenco y mezcle bien con sus manos.", "Extienda la mezcla de relleno uniformemente a través de una fuente de horno y hornee durante 45 minutos."], "url": "www_bbc_co_uk_food_recipes_oat_fig_stuffing_92823", "title": "Avena relleno de higos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de avena", "50g / 1¾oz de linaza dorada", "Puertas de 40g / 1½oz", "2 cucharadas de jarabe de arce", "100g / 3½ oz de almendras enteras, con la piel puesta, muy picada", "100g / 3½oz de nueces peladas, más o menos picadas", "10-12 fechas, piedras removidas, más o menos picadas", "50 g / 2 oz de bayas de goji (disponibles en tiendas de alimentos saludables y algunos supermercados)", "puñado de semillas de cáñamo (disponible en tiendas de alimentos saludables)", "gran pizca de canela molida", "taza pequeña de yogur de estilo griego", "puñado de uvas sin semillas, reducido a la mitad", "5-6 piezas de melón Honeydew fresco", "ramita de menta fresca, picada"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Espolvoree la avena, las semillas de lino y el salvado en una bandeja para hornear. Rocíe el jarabe de arce y enrolle los ingredientes secos en la bandeja de hornear para cubrirlos con el almíbar.", "Hornee los ingredientes cubiertos de jarabe en el horno durante 15-20 minutos, agitando la bandeja unas cuantas veces mientras se cocina el contenido. Retirar del horno cuando esté dorado y reservar para enfriar.", "Cuando la mezcla de avena se haya enfriado a temperatura ambiente, colóquela en un recipiente grande hermético y agregue las nueces, las fechas, las bayas de goji, las semillas de cáñamo y la canela hasta que estén bien combinadas.", "Para servir, coloca un puñado de granola en una taza de yogur griego y cúbrelo con uvas, melón y menta picada. Alternativamente, come como cereal con leche."], "url": "www_bbc_co_uk_food_recipes_oat_maple_and_pecan_71418", "title": "Granola de avena, arce y pacanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oat_maple_and_pecan_71418_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de pasta de miso amarillo", "2 cucharadas de jengibre fresco rallado", "100g / 3½oz de fideos Somen cocidos", "2 manojos grandes de baby pak choi (variedad de tallo blanco), lavados, hojas separadas", "150g / 5½ oz de langostinos tigre frescos de tamaño mediano, sin cáscara con cabeza, cola, limpiado y desvenado", "Calamar bebé de 100 g / 3½ onzas, tentáculos separados, cuerpo en rodajas para dar anillos de calamar", "100g / 3½ oz de mejillones, preferiblemente mejillones de Groenlandia, limpios y sin barba (deseche las cáscaras que estén rotas, o abiertas y no se cierren cuando se golpeen con fuerza sobre la superficie de trabajo)", "2 cucharadas de Shaoxing (vino de arroz chino) o jerez seco", "2 cucharaditas de salsa de soja liviana baja en sodio o tamari", "sal al gusto", "2 pizcas de pimienta blanca molida", "2 pequeños puñados de cilantro, toscamente picados, para adornar"], "method": ["Vierta 1 litro / 1¾pints de agua en un wok mediano y llévelo a ebullición.", "Agregue la pasta de miso y el jengibre y cocine a fuego medio durante 5 minutos.", "Agregue los fideos somen, pak choy y todos los mariscos. Cocine por 1 minuto hasta que las conchas de mejillón se hayan abierto. Deseche cualquier mejillón que permanezca cerrado. Sazonar con el vino de arroz, salsa de soya, sal y pimienta.", "Transfiera a cuencos hondos, adorne con el cilantro y coma de inmediato."], "url": "www_bbc_co_uk_food_recipes_nourishing_mixed_seafood_92551", "title": "Caldo de mariscos mixtos nutritivos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1-2 cucharadas de aceite vegetal", "1 cebolla blanca grande, finamente picada", "1 cucharadita de sal", "2 cucharaditas de comino molido", "150 g / 5½oz de guisantes congelados, descongelados", "25 g / 1 oz de eneldo fresco, finamente picado", "400g / 14oz puré de papa", "6 pasteles de avena Derbyshire o panqueques de 20 cm / 8 pulgadas, cortados por la mitad", "4 cucharadas de harina normal", "aceite vegetal, para freír"], "method": ["Para hacer el relleno, caliente el aceite en una sartén antiadherente a fuego medio, agregue la cebolla y la sal y cocínelo hasta que esté suave y ligeramente dorado. Agregue el comino y los guisantes y cocine por unos minutos. Agregue el eneldo, junto con el puré de papa, y mezcle bien, luego transfiera a un recipiente y deje que se enfríe completamente.", "Para armar, forre una bandeja para hornear con papel de hornear. Mezcle la harina y 4 cucharadas de agua juntas en un tazón pequeño para hacer un \"pegamento\".", "Coloque una cucharada colmada de relleno en el centro de la mitad, dejando espacio alrededor de los bordes. Dobla un lado de la torta de avena sobre el relleno, luego dobla el otro lado. Cepille las costuras y los bordes con el \"pegamento\", presione los bordes para sellar cualquier orificio. Coloque en la bandeja de horno forrada y repita con el resto de las tortas de avena y el relleno. Coloque las samosas en el congelador por 30 minutos.", "Mientras tanto, llene una freidora o una sartén grande, profunda y de fondo grueso, dos tercios llena con el aceite. Caliéntelo a 190 ° C o hasta que un cubo de pan se ponga marrón en un minuto cuando lo deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las samosas en lotes, cocinando durante unos minutos por cada lado, hasta son crujientes y dorados. Escurrir sobre papel de cocina, y servir caliente."], "url": "www_bbc_co_uk_food_recipes_oatcake_potato_and_dill_35463", "title": "Tortas de sésamo, patata y eneldo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de miel clara", "150g / 5½oz de frambuesas congeladas (o frescas)", "Avena de avena 100 g / 3½ oz (no instantánea)", "¼ cucharadita de copos de sal marina", "1 cucharadita de polvo de hornear", "1½ cucharadita de canela molida", "100 ml / 3½ fl oz de leche de avena, o cualquier otro tipo que desee", "1 huevo de gallinas camperas", "1 cucharadita de pasta de vainilla o extracto", "1 cucharadita de aceite de girasol"], "method": ["Caliente la miel y las frambuesas en una cacerola pequeña a fuego medio, revolviendo con frecuencia, hasta que las frambuesas se hayan descongelado (si se usan congeladas). Esto no debería tomar más de 3 minutos más o menos. Saca la sartén del fuego.", "Coloque la avena y la sal en una licuadora o procesador de alimentos con el recipiente pequeño ajustado, y procese hasta obtener la consistencia de la harina, una harina harinosa, pero aún así debe estar bien molido. Incline en un recipiente y agregue el polvo de hornear y la canela.", "En una jarra de medir, mezcle la leche, el huevo y la vainilla, y luego mezcle la mezcla húmeda en el seco, hasta que se combinen a fondo. Si la masa se espesa demasiado, agregue más leche. Y no dejes que esta masa descanse, ya que de lo contrario se espesará demasiado.", "Vierta ½ cucharadita de aceite sobre una plancha lisa y antiadherente (o una sartén grande de hierro fundido o de base pesada) y, con un rollo de cocina, aplíquelo sobre toda la superficie. Ponga la plancha a fuego medio y, cuando esté caliente, agregue la mezcla, usando una medida de un cuarto de taza pero solo llenándola dos tercios llena. Deberías obtener 4 panqueques a la vez, y necesitarán alrededor de 2 minutos por cada lado. En general, cuando se cocinan panqueques, se los da vuelta cuando ves burbujas que vienen hacia el lado superior, y mientras eso sigue siendo cierto, las burbujas son más bien discretas aquí. Así que desliza una espátula debajo de un panqueque después de 2 minutos para ver si la parte inferior parece estar cocida, y luego cuando esté, voltéala y el resto de los panqueques, déjelos reposar y cocínelos por otros 2 minutos. Como siempre, no presione los panqueques mientras se cocinan, y no los voltee más de una vez. Cuando haya cocinado los 4 primeros, amontone en un plato y cúbralos con una toalla de té limpia, luego vuelva a engrasar la olla y proceda como antes.", "Sirva inmediatamente - la avena continúa bebiendo líquido, y los panqueques se secarán en reposo - con la cálida miel de frambuesa vertida en la parte superior."], "url": "www_bbc_co_uk_food_recipes_oat_pancakes_with_14049", "title": "Panqueques de avena con frambuesas y miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6-8 panqueques", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oat_pancakes_with_14049_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["½ Arbroath smokie, despellejado, deshuesado y desmenuzado en trozos pequeños", "2 cucharadas de yogur al estilo griego", "1 cucharada de eneldo fresco picado", "1 cucharada de cebolletas frescas picadas", "sal y pimienta negra recién molida", "55g / 2oz de cohete salvaje", "2 cucharadas de aceite de oliva", "½ limón, solo jugo", "6 pequeños pasteles de avena", "½ tomate maduro, semillas retiradas, picadas"], "method": ["Para el paté, coloque todos los ingredientes de paté en un tazón y mezcle con un tenedor.", "En un recipiente aparte, revise las hojas del cohete con el aceite y el jugo de limón.", "Extienda un poco del paté en cada una de las tortas de avena y cubra con algo del cohete. Adorne con un trozo de tomate picado y sirva."], "url": "www_bbc_co_uk_food_recipes_oatcakeandrocketcana_88566", "title": "Tortas de avena y canapés con paté de smokie de Arbroath", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de levante 225g / 8oz", "Azúcar demerara 200 g / 7 oz", "225 g / 8 oz de avena cocida", "225g / 8oz de mantequilla, derretida", "50g / 2oz de sirope dorado", "½ cucharadita de bicarbonato de sodio, mezclado con 1 cucharadita de agua caliente", "200 g / 7oz de piezas de dulce de vainilla", "250g / 9oz de chocolate blanco, derretido"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una bandeja para hornear con papel resistente a la grasa.", "En un tazón, mezcle la harina, el azúcar, la avena, la mantequilla, el jarabe dorado y el bicarbonato de soda en un bol para formar una masa espesa. Con las manos húmedas, enrolle porciones de la mezcla en bolas de 3cm / 1½ pulgadas y colóquelas en la bandeja preparada, dejando suficiente espacio entre cada bola.", "Aplanar cada bola con un tenedor, luego hornear en el horno durante 15-20 minutos, o hasta que estén doradas y cocidas. Retirar del horno y dejar enfriar.", "Mientras tanto, coloque el dulce de azúcar entre dos hojas de papel resistente a la grasa y extiéndalo hasta que el dulce de chocolate tenga un grosor de aproximadamente 2 mm. Cortar en círculos del mismo tamaño que las galletas de avena y colocar sobre la parte superior de los bizcochos.", "Vierta chocolate blanco derretido sobre los bizcochos y el dulce de azúcar (es posible que desee hacerlo colocando los bizcochos en una rejilla para enfriar con un poco de papel antigrasa debajo para atrapar cualquier chocolate goteando).", "Enfríe los bizcochos en la nevera hasta que el chocolate esté listo. Servir a temperatura ambiente"], "url": "www_bbc_co_uk_food_recipes_oatywhitechocolatebi_91773", "title": "Oaty galletas de chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de avena mediana 110 g / 4 oz, más más para espolvorear", "Harina común 110g / 4oz", "55 g / 2 oz de manteca de cerdo, goteo o grasa de ave", "1 cucharadita de sal", "agua fría", "1 huevo", "1 cucharada de leche", "1 cucharadita de azúcar"], "method": ["Mezcle la harina de avena y la harina en un tazón. Frote la grasa, agregue la sal y mezcle en suficiente frío para formar una masa suave pero no pegajosa.", "Estirar la masa sobre una tabla derramada de avena. Recorta los círculos con un cortador de bollos. Alternativamente, corte una ronda de plato de cena, y cuarto.", "Mezcle el huevo, la leche y el azúcar para formar un glaseado.", "Cocine las tortas de avena en una plancha sin engrasar a temperatura media, sin girarlas. En el momento en que el primer lote esté en su lugar, cepíllelos con glaseado: se convertirá en una capa brillante mientras se cocinan.", "Cuando esté completamente cocido, eliminar. Almacenar en una caja hermética."], "url": "www_bbc_co_uk_food_recipes_oatcakes_74180", "title": "Oatcakes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/oatcakes_74180_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pulpo, aproximadamente 1.75kg - 2kg / 4lb - 4lb 8oz", "1 cucharada de escamas de sal marina", "2 cucharadas de vinagre", "200 g / 7oz de salsa de chorizo ​​para cocinar, en cubos", "5 cebollas de primavera, en rodajas", "1 puñado de hojas frescas de orégano", "2 naranjas, solo segmentos", "1 puñado de hojas de menta", "1 puñado de hojas de orégano", "1 puñado de hojas de perejil", "10 aceitunas Kalamata;", "5 cebollas de primavera, en rodajas", "flores de capuchina o pensamientos naranjas", "2 cucharadas de aceite de oliva", "½ limón, solo jugo", "1 cucharadita de semillas de sésamo"], "method": ["Para el pulpo, ponga a hervir una olla grande de agua. Batir los tentáculos ligeramente con un mazo de carne para ablandar y luego pelar la piel.", "Corta la cabeza del cuerpo, justo debajo de los ojos. Retire el pico del centro de los tentáculos volteándolo hacia adentro y empujando el pico.", "Agregue la sal al agua hirviendo y luego moje el pulpo tres veces en agua hirviendo. Agregue el vinagre y luego devuelva el pulpo a la sartén y cocine a fuego lento durante una hora. (Dormir el pulpo asegura que los tentáculos no se adhieren durante la cocción y se vuelven duros y masticables. La clave es cocinar el pulpo muy lentamente en agua hirviendo a fuego lento, el vinagre ayuda a ablandar el pulpo).", "Corta los tentáculos en pequeños trozos. Caliente una sartén hasta que esté caliente, agregue el chorizo ​​y cocine durante unos minutos hasta que estén crujientes. Agregue las cebolletas y las piezas de pulpo, junto con las hojas de orégano, y cocínelas todas juntas durante dos minutos más. Retire la sartén del fuego y reserve.", "Para la ensalada, combine los segmentos de naranja, las hierbas, las aceitunas y las cebolletas.", "Esparcir con las flores, rociar con el aceite de oliva y el jugo de limón, agregar las semillas de sésamo y sazonar con sal y pimienta negra recién molida.", "Sirve con el pulpo y el chorizo."], "url": "www_bbc_co_uk_food_recipes_octopus_chorizo_sausage_91997", "title": "Pulpo, chorizo ​​y orégano con ensalada de naranja, capuchina y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 racimos de cilantro fresco", "1 puñado de perejil", "1 cebolla de primavera", "3 dientes de ajo", "250ml / 9fl oz de aceite de oliva, preferiblemente Arbequina, más extra para freír poco y llovizna", "75ml / 5 cucharadas de vinagre de vino blanco", "1 cucharada de Cayena molida", "1 cucharada de comino molido", "Pulpo de doble lechón de 1 x 2-3 kg / 5-7 lb, limpiado y dejado entero, pico y ojos eliminados", "½ cebolla", "1 hoja de laurel", "500g / 1lb 2oz de patatas nuevas", "4 chalotes, toscamente picados", "Txistorra 250 g / 9 oz, u otra salchicha curada, cortada en cubos de 4 cm / 1½ pulgadas", "sal y pimienta negra recién molida", "aceite vegetal, para freír", "2 alcachofas de Jerusalén, en rodajas finas", "2 cucharadas de perejil picado"], "method": ["Para el mojo verde, ponga el cilantro, el perejil, la cebolla tierna, el ajo, 170ml / 5½ fl oz de aceite de oliva, vinagre de vino blanco, pimienta, comino, sal y pimienta en un procesador de alimentos y pulse hasta obtener una pasta gruesa. Dejar de lado.", "Haga hervir una olla grande de agua. Agregue el pulpo, la cebolla y la hoja de laurel y cocine a fuego lento hasta que estén tiernos. (Esto toma alrededor de 20 minutos por kilo. Si un diente se desliza fácilmente a través de un tentáculo, entonces el pulpo se cocina). Una vez cocidos, separe las patas del cuerpo del pulpo cortando en la unión y luego córtelas en pedazos.", "Caliente una pizca de aceite en una sartén a fuego medio. Agregue el pulpo y fría por 2-3 minutos.", "Ponga a hervir una olla con agua y agregue las papas nuevas. Hervir durante 10 minutos o hasta que esté cocido. Escurrir y dejar enfriar lo suficiente para manejar. Cortado en mitades", "Calentar una sartén con el resto de 80ml / 2¾fl de aceite de oliva. Agregue las mitades de papa y los chalotes, sazone y fría hasta que estén dorados.", "Calentar una sartén hasta que esté caliente. Seque la txistorra hasta que la piel se vea dorada y crujiente.", "Precalienta el aceite en una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Coloque las alcachofas en rodajas en la freidora y cocínelas durante 1-2 minutos. Escurrir en un plato forrado con papel de cocina.", "Para servir, unte el mojo verde en un plato y coloque una mezcla de pulpo, patatas y txistorra encima. Rocíe con un poco de aceite de oliva y decore con las alcachofas."], "url": "www_bbc_co_uk_food_recipes_octopus_mojo_verde_00254", "title": "Pulpo, mojo verde, patatas, alcachofas y txistorra", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pequeño pulpo, cortado en pedazos", "1 zanahoria, picada", "1 cebolla picada", "4 dientes de ajo, pelados y aplastados", "2 palitos de apio, picados", "300g / 10½oz de papas nuevas, cocidas al vapor hasta que estén tiernas", "1 limón, ralladura solamente", "1 naranja, segmentado", "100g / 3½oz de aceitunas verdes, sin hueso", "1 cucharada de vinagre de Jerez", "4 cucharadas de aceite de oliva", "2 cucharadas de perejil de flatleaf, picado", "2 cucharadas de albahaca, desgarrada", "Calamar de 500 g / 1 libra 2 oz, limpiado, cortado y cortado en anillos", "130g / 4¾oz de harina de maíz", "Harina normal 130g / 4¾oz", "½ cucharadita de pimentón ahumado", "1 cucharada de sal marina", "1 cucharada de granos de pimienta"], "method": ["Para el pulpo, coloca todos los ingredientes en una sartén grande y cúbrelos con agua. Cocine a fuego lento durante 1-1½ horas hasta que esté tierno. Saca el pulpo cocido y déjalo a un lado para que se enfríe un poco, luego córtalo en trozos del tamaño de un bocado.", "Para la ensalada, coloque todos los ingredientes en un tazón de vidrio grande y mezcle, sazone con sal y pimienta. Mezcle el pulpo justo antes de servir.", "Para el calamar de sal y pimienta, precaliente una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Combine la harina de maíz y la harina en un tazón grande. Moler la sal del mar y los granos de pimienta hasta convertirlos en un polvo en una mano de mortero. Agregue la sal y la pimienta a las harinas y mezcle. Polvo del calamar en las harinas sazonadas.", "Freír el calamar a fuego lento durante 1-2 minutos. Retire con una espumadera y escurra sobre papel de cocina hasta que esté listo para servir.", "Sirva los platos por separado con trozos de limón y el alioli en un tazón pequeño."], "url": "www_bbc_co_uk_food_recipes_octopus_salad_and_salt_58948", "title": "Ensalada de pulpo y sal y pimienta de calamar con alioli", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "1 bulbo de ajo, cortado por la mitad horizontalmente", "12 cebollas de ensalada o cebollas grandes de primavera, solo partes blancas, recortadas", "8 patas medianas de pulpo, cortadas en trozos del tamaño de un bocado en la diagonal", "1 limón, solo jugo", "2 hojas frescas de laurel", "gran ramita de tomillo fresco, solo hojas", "8 granos de pimienta negra, dejados enteros", "300g / 10½oz de guisantes frescos, las vainas retiradas (peso no envasada)", "Mantequilla generosa mantequilla fría o aceite de oliva", "4 frondas de hinojo silvestre, picadas (opcional)"], "method": ["Calentar el aceite en una cazuela de base pesada a fuego alto. Cuando el aceite solo esté humeando, agregue las mitades del bulbo de ajo, los lados cortados hacia abajo, y las cebollas, y fríalos durante 2-3 minutos, o hasta que las cebollas estén crujientes y doradas.", "Agregue las piezas de pulpo y saltee durante 30 segundos, luego reduzca el fuego a su nivel más bajo. Exprima el jugo de limón y espolvoree sobre las hojas de laurel, tomillo y granos de pimienta, luego cubra la olla con una tapa y continúe cocinando por otros dos minutos, o hasta que las piezas de pulpo hayan liberado sus jugos de color rosa púrpura.", "Continúe cocinando a fuego lento la mezcla a fuego lento durante 1 hora y 45 minutos a 2 horas, o hasta que el pulpo esté tierno y no ofrezca resistencia cuando se perfora con la punta de un cuchillo.", "Cuando el pulpo esté cocido y esté tierno, agregue los guisantes y continúe cocinando, sin tapar, durante 8-10 minutos, o hasta que el volumen de los jugos de cocción se haya reducido y los guisantes estén tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mantequilla fría (o aceite de oliva) hasta que esté bien combinada, luego espolvoree sobre las hojas de hinojo silvestre picadas, si las está usando. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_octopusinthesardinia_91780", "title": "Pulpo al estilo sardo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Filete de cordero 200 g / 7 oz", "50g / 2oz de pan rallado", "½ cucharadita de mostaza Dijon", "1 cucharada de perejil fresco picado", "3 chirivías pequeñas, peladas, cortadas en cuartos", "1 cucharada de aceite de oliva", "2 cucharadas de miel", "½ limón, solo jugo", "sal y pimienta negra recién molida", "150ml / 5fl oz de caldo de carne", "2 cucharadas de puerto", "50g / 2oz de mantequilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente el aceite en una sartén a prueba de horno. Agregue el cordero y cocine durante 1-2 minutos en cada lado.", "En un tazón, mezcle las migas de pan, la mostaza de Dijon y el perejil. Coloque la mezcla de migas de pan en cada trozo de cordero, luego transfiera al horno para hornear durante 4-5 minutos, o hasta que esté cocido. Retire del horno y deje reposar durante 3-4 minutos.", "Para las chirivías, coloque las chirivías en una bandeja para hornear y rocíe con aceite. Coloque en el horno para asar durante ocho minutos, luego sacar y rociar sobre la miel y el limón. Sazonar con sal y pimienta negra recién molida, luego volver al horno para asar durante dos minutos más.", "Para la salsa del puerto, caliente el caldo de carne y el puerto juntos en una cacerola pequeña. Llevar a ebullición y cocinar durante cinco minutos. Agregue la mantequilla y mezcle para derretir.", "Para servir, coloque el costillar de cordero en el medio de un plato, coloque las chirivías y espárzalos sobre la salsa para oporto."], "url": "www_bbc_co_uk_food_recipes_oflambwithhoneyandle_84927", "title": "Corteza de cordero con miel y chirivías asadas con limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 rebanadas de masa fermentada", "50 g / 1¾oz de mantequilla sin sal", "8 cebollas grandes encurtidas", "200g / 7oz de queso de vaca firme, (como Ogelshield), rebanado", "1 cucharada de aceite de oliva", "1 cucharadita de hojuelas de chile seco", "50ml / 2fl oz de vinagre de vino blanco", "50 g / 1 oz de azúcar en polvo", "3 manzanas Braeburn, peladas, sin corazón y picadas", "1 manojo de remolacha baby, cortado en cuartos", "1 chalota de plátano, en rodajas", "Vinagre de vino blanco 110ml / 3¾fl oz", "1 cucharadita de sal", "1 cucharadita de azúcar", "50 g / 1¾oz de lechuga de cordero", "50 g / 1¾oz de hojas de mizuna"], "method": ["Para el queso sobre pan tostado, vierta el aceite sobre las rebanadas de pan y colóquelas en una sartén caliente y tápelas por un lado por un minuto. Caliente una sartén limpia y agregue la mantequilla. Una vez caliente y derretido, agregue las cebollas en escabeche y cocine hasta que se coloreen por completo.", "Para la compota de manzana, caliente una parrilla a fuego alto. Calentar el aceite en una sartén a fuego medio. Agregue las hojuelas de chile, el vinagre y el azúcar y fría por un minuto.", "Agregue la manzana y cocine por cinco minutos, o hasta que las manzanas comiencen a descomponerse y ablandarse. Coloque en una licuadora y mezcle hasta que quede suave.", "Extienda la compota sobre el pan tostado y corte las cebollas encurtidas y colóquelas encima. Coloque el queso sobre las cebollas y colóquelo debajo de la parrilla hasta que se derrita.", "Para la ensalada de remolacha baby, coloque las remolachas baby y los chalotes en rodajas en un tazón.", "Ponga el vinagre, 110ml / 3¾fl oz de agua, sal y azúcar en una cacerola y una vez caliente, viértalo sobre la remolacha y los chalotes y déjelos por 2-3 minutos.", "Coloque las hojas en un tazón grande y agregue la remolacha y las chalotas y un poco del licor de decapado.", "Para servir, coloque el queso sobre una tostada en un plato y sirva las hojas de ensalada junto a la tostada."], "url": "www_bbc_co_uk_food_recipes_oglesheild_on_toast_with_48962", "title": "Queso elegante en pan tostado con compota de manzana y ensalada de remolacha baby", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de vinagre destilado", "150g / 5½oz de grosella negra congelada", "450g / 1lb de miel clara", "450ml / 16fl oz de vinagre de vino tinto", "3 zanahorias", "3 pastinacas", "1 pequeño sueco", "1 pequeño apio nabo", "1kg / 2lb 4oz de pato o grasa de ganso", "6 ramitas de tomillo de limón", "3 dientes de ajo", "1 ramita de romero", "fina sal marina, al gusto", "Pimienta blanca molida, al gusto", "fina sal marina, al gusto", "3 ramitas de tomillo, hojas recogidas", "pimiento blanco molido, al gusto", "Crema doble 50ml / 2fl oz", "175g / 6oz de mantequilla sin sal, cortada en cubitos", "5 cucharadas de aceite de oliva", "apretón de limón", "150 g / 5½ onzas de mantequilla, suavizadas", "35g / 1¼ oz de ajo, triturado", "35g / 1¼ oz de perejil flatleaf, finamente picado", "1 repollo savoy, rallado", "2 cucharadas de pimienta negra entera", "2 cucharadas de bayas de enebro", "Lomo de venado Oisin 800 g / 1lb 12 oz, recortado"], "method": ["Para la gastrique de grosella negra, coloque el azúcar y el vinagre en una cacerola y cocine hasta que se haya reducido a un jarabe y tenga un color dorado. Agregue las grosellas negras congeladas y cocine hasta que las bayas se descompongan. Pruebe la gastrica, agregue más azúcar si está demasiado agrio o un poco más de vinagre si es demasiado dulce.", "Para la reducción de la miel, ponga la miel, el vinagre de vino tinto y 450 ml / 16 fl oz de agua en una olla y cocine a fuego lento, cocine hasta que haya reducido el volumen en dos tercios. Dejar de lado.", "Pelar y lavar todas las verduras de raíz. Corta todas las verduras de raíz en trozos del mismo tamaño. Escalde las zanahorias y el nabo brevemente.", "Lleva la grasa del pato a fuego lento. Envuelva el tomillo de limón, el ajo y el romero en un paño de muselina y agregue grasa de pato. Sazone al gusto con sal y pimienta.", "Cocine las chirivías en la grasa de pato durante 10 a 15 minutos: deben cocinarse pero aún así conservar un bocado. Escurrir las chirivías en un colador y espolvorear con un poco de aderezo. Una vez drenados, enfríelos en una bandeja para que dejen de cocinar y no se vuelvan pastosos. Repita el mismo proceso para todas las verduras restantes.", "Cuando todas sus verduras estén listas y aún tibias, mezcle todas suavemente. Freír las verduras en una sartén grande antiadherente (la sartén debe ser lo suficientemente grande para que las verduras no se superpongan). Cuando las verduras comiencen a dorarse, agrega la reducción de miel al glaseado.", "Para la emulsión de mantequilla, ponga a hervir 150 ml / 5 fl oz de agua. Agregue la sal, el tomillo y la pimienta. Deje que se infunda y luego agregue la crema. Mientras el agua aún esté caliente, agregue la mantequilla y use una batidora manual para crear una emulsión, luego agregue el aceite y use la licuadora de mano otra vez. Controle el condimento, balancee con un chorrito de jugo de limón y páselo por un colador fino. Deje a temperatura ambiente.", "Para el repollo, haz una mantequilla de ajo. Mezcle el ajo y el perejil con la mantequilla ablandada. Blanquee el repollo durante 1-2 minutos, luego drene. Derrita la mantequilla de ajo y vierta la col drenada en ella.", "Para la carne de venado, tueste los granos de pimienta y las bayas de enebro en una sartén (como lo haría con las semillas) hasta que suelten un aroma, luego muela con un molinillo de especias o en un mortero. Rocíe ligeramente el venado con las especias molidas. Cubre el venado suavemente y cocina hasta que sea raro, déjalo reposar en un lugar cálido.", "Tallar la carne de venado y servir con las verduras glaseadas de miel y la col de mantequilla de ajo. Rocíe un poco de la emulsión y espolvoree la gastrique de grosella negra sobre la carne de venado."], "url": "www_bbc_co_uk_food_recipes_oisin_venison_with_honey_46149", "title": "Venado Oisin con vegetales de raíz tostados con miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 750g / 1lb 10oz de poussin de campo abierto, pelado y espolvoreado (alternativamente use 800 g / 1lb 12 oz de muslos de pollo, cada muslo reducido a la mitad)", "80g / 3 oz de yogur griego completo en grasa", "1 cucharada de jengibre y pasta de ajo", "1 cucharada de aceite vegetal", "1½ cucharadita de sal", "1 limón, solo jugo", "1 cucharada de chile rojo en polvo", "1 cucharada de comino molido", "½ cucharadita de sal masala", "Harina blanca lisa de 375g / 13oz", "¾ cucharadita de polvo de hornear", "1½ cucharadita de sal", "200ml / 7fl oz de leche entera", "15 g / ½ oz de azúcar", "1 huevo de gallinas camperas, golpeado (solo necesitarás la mitad del huevo)", "2 cucharadas de aceite vegetal", "1kg / 2lb 4oz de tomates frescos", "5cm / 2 en pieza de jengibre fresco de raíz, pelado, medio rallado y medio finamente picado", "4 dientes de ajo, pelados", "4 vainas de cardamomo verde", "5 dientes", "1 hoja de laurel", "1 cucharada de chile rojo en polvo", "80 g / 3 oz de mantequilla, en cubitos", "2 chiles verdes, hendidura longitudinal", "75ml / 2½fl oz de crema individual", "1 cucharadita de sal", "2 cucharaditas de hojas secas de fenogreco, aplastadas entre las puntas de los dedos", "½ cucharadita de sal masala", "sal y pimienta negra recién molida", "1 cucharada de azúcar"], "method": ["Precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Coloque una bandeja para hornear en el horno para calentar.", "Para el adobo, haga pequeños cortes en todo el poussin o trozos de pollo con un cuchillo afilado para ayudar al adobo a penetrar.", "Mezcle todos los ingredientes del adobo en un plato hondo para horno. Unta el pollo cortado con el adobo, cúbrelo con una película adhesiva y déjalo en la nevera durante 10 minutos.", "Cocine el pollo en el adobo en el horno por 15 minutos. Es posible que deba girar las piezas a la mitad de la cocción para asegurarse de que se doren uniformemente en ambos lados.", "Mientras tanto, para el pan naan, mezcle la harina, el polvo de hornear y la sal en un tazón grande. En un tazón aparte, mezcle la leche, el azúcar y la mitad del huevo batido, luego agregue esto a la mezcla de harina y amasar ligeramente hasta que se junte para hacer una masa blanda (tenga cuidado de no trabajar demasiado la masa). Cubra el recipiente con un paño húmedo y déjelo reposar durante 15 minutos.", "Para la salsa, coloque los tomates en una sartén con 125 ml / 4 fl oz de agua, el jengibre rallado, el ajo, el cardamomo, el clavo de olor y la hoja de laurel. Cocine a fuego lento durante unos 10 minutos a fuego medio hasta que los tomates se hayan descompuesto.", "Elija las especias más grandes, luego mezcle la salsa con una licuadora de mano hasta que quede suave. (Pase a través de un colador para obtener un puré realmente suave.) Coloque el puré en una sartén limpia, agregue el chile en polvo y cocine a fuego lento durante 12-15 minutos. Debería comenzar a espesarse lentamente.", "Corte el pollo cocido en pedazos del tamaño de un bocado (el pollo no necesita estar completamente cocinado en este punto ya que continuará cocinándose en la salsa). Cuando la salsa esté espesa y brillante, agregue las piezas de pollo y el tamiz en los jugos de tostado.", "Agregue aproximadamente 200 ml / 7 fl oz de agua (dependiendo de qué tan grueso prefiera su salsa) y cocine a fuego lento durante 3-5 minutos. Bata lentamente la mantequilla, un par de piezas a la vez, y cocine a fuego lento durante 6-8 minutos, hasta que el pollo esté cocido y la salsa se vuelva brillante.", "Para cocinar los panes naan, vierta el aceite sobre la masa de naan reposada y gírelo unas cuantas veces para que quede uniformemente cubierto. Divida la masa en 8 piezas iguales y despliegue cada una sobre una superficie ligeramente aceitada en un círculo de aproximadamente 9 cm / 3½ pulgadas de diámetro. Estire suavemente los círculos de masa para formar la forma tradicional de lágrima o, alternativamente, gírelos en círculos de 10 cm.", "Coloque los panes naan en la bandeja de horno precalentada y hornee por 4-5 minutos, o hasta que comiencen a dorarse en ambos lados. Es posible que deba voltear el pan para asegurarse de que esté coloreado en ambos lados.", "Para terminar el curry, agregue el jengibre, los chiles y la crema finamente picados y cocine a fuego lento durante un minuto o más, teniendo cuidado de mantener el fuego bajo para que la salsa no se parta. Agregue la sal, las hojas de alholva trituradas y el garam masala. Sazone al gusto con sal y pimienta, luego agregue el azúcar. Sirva el curry con los panes calientes naan al costado."], "url": "www_bbc_co_uk_food_recipes_old_delhi-style_butter_73290", "title": "Pollo de mantequilla al estilo antiguo de Delhi", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina común", "2 cucharaditas de tomillo seco o 2 cucharadas de hojas de tomillo fresco picado", "sal marina y pimienta negra recién molida", "15g / ½ oz de mantequilla", "2-3 cucharadas de aceite de girasol", "1 conejo de granja grande o 2 conejos salvajes jóvenes, unidos en 8 piezas", "6 lonchas de panceta ahumada y sin corteza, cortadas en cuadrados de 2cm / ¾", "2 cebollas picadas", "500ml / 17fl oz de sidra seca", "300ml / 10fl oz de caldo de pollo o vegetal", "2 hojas de laurel", "350g / 12oz de zanahorias chantenay, peladas", "150g / 5oz de guisantes congelados"], "method": ["Coloque la harina, el tomillo y una buena pizca de sal y un montón de pimienta negra recién molida en una bolsa grande de congelador. Coloque las porciones de conejo en la bolsa, algunas a la vez, y sacuda bien hasta que la harina sazonada quede uniformemente cubierta. Transfiere a un plato.", "Derrita la mantequilla con una cucharada de aceite en una sartén grande de base pesada a fuego medio. Freír el conejo, unas pocas piezas a la vez, hasta dorar por todas partes. Coloque todas las porciones de las patas delanteras y traseras en una cazuela a prueba de llamas.", "Transfiera las piezas de la silla de montar a un plato, cúbralas sin apretarlas y déjelas a un lado (estas necesitarán menos tiempo de cocción, por lo que pueden agregarse más adelante). Precalentar el horno a 170C / 340F / Gas 3½.", "Agregue un poco más de aceite a la sartén y cocine el tocino hasta que la grasa se dore y comience a crujiente. Agregue el tocino a la cazuela.", "Agregue un poco más de aceite a la sartén y fría la cebolla durante 5-7 minutos, o hasta que se dore ligeramente y comience a ablandarse. Agregue las cebollas a la cazuela, espolvoree con la harina restante en la bolsa del congelador y revuelva hasta que esté bien combinado.", "Vierta la mitad de la sidra en la sartén y revuelva vigorosamente con una cuchara de madera para levantar cualquier sedimento del fondo. Cocine a fuego lento durante unos segundos y luego vierta en la cazuela. Agregue el resto de la sidra y el caldo. Revuelva las hojas de laurel en la cazuela, cubra con una tapa y cocine en el centro del horno durante 45 minutos.", "Retire la cacerola del horno, agregue las piezas reservadas de la silla de montar y las zanahorias, gire todas las porciones de conejo, asegurándose de que la mayor parte de la carne esté cubierta por líquido lo más posible. (No toda la carne estará tapada). Regrese al horno por otras 1-2 horas.", "Saque la cazuela del horno después de una hora y revise el conejo - la carne debe comenzar a caerse del hueso cuando el conejo esté listo. Pase las porciones de las patas y las piezas de la silla de montar con un cuchillo y, si no se desliza fácilmente, devuelva la cazuela al horno. Verifique nuevamente la sensibilidad y gire las porciones de conejo cada 30 minutos más o menos.", "Cuando el conejo esté tierno, quite toda la grasa que pueda haber subido a la parte superior de la cazuela con una cuchara grande. Con cuidado, transfiera la cazuela a la cocina. Deje que hierva a fuego lento y cocine durante 3-5 minutos, o hasta que el líquido se reduzca a una consistencia espesa, ligeramente espesa. Agregue los guisantes congelados y cocine a fuego lento durante otros tres minutos. Sazonar con sal y pimienta negra recién molida y servir."], "url": "www_bbc_co_uk_food_recipes_old_fashioned_rabbit_74225", "title": "Guiso de conejo pasado de moda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 5-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/old_fashioned_rabbit_74225_16x9.jpg", "isVegetarian": false, "recommendations": 0}]