[{"ingredients": ["150g / 5½oz de berro", "150ml / 5fl oz de aceite de colza", "sal marina", "4 x 110 g / 4 oz de filetes de rodaballo", "300ml / 10½ fl oz aceite de colza", "300ml / 10½ fl oz de aceite de girasol", "20ml / ¾fl oz de aceite de colza", "40g / 1½ oz chalote, finamente picado", "50ml / 2fl oz de sidra", "15 g / ½ oz de bacalao seco", "¼ diente de ajo, picado", "Crema doble 250ml / 9fl oz", "4 tallos de brócoli brotación púrpura", "4 tallos de col rizada", "aceite vegetal, para freír"], "method": ["Para el aceite de berros, hierva una olla grande de agua. Agregue el berro por 15 segundos. Drene y actualice inmediatamente en agua fría.", "Pon el berro en una tela de muselina y exprime la mayor cantidad de agua posible.", "Coloque en una licuadora con aceite de colza y una pizca de sal. Mezcle durante cinco minutos, o hasta que el color del aceite cambie a verde oscuro.", "Coloque un colador forrado con muselina sobre un tazón. Agregue el aceite y déjelo reposar por una hora o durante la noche.", "Para los peces, pon el aceite de colza en una sartén y caliéntalo a 50 ° C / 120 ° F.", "Cueza el pescado durante 8-10 minutos, luego retírelo y colóquelo en una rejilla para drenar.", "Deje el pescado en un lugar cálido durante 5-10 minutos y termine carbonizando la piel con un soplete de chef.", "Para la salsa de sidra, caliente el aceite en una cacerola y fría la chalota sin dorarla.", "Agregue la mitad de la sidra, el whitebait y el ajo y caliente hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue la crema doble y cocine a fuego lento durante cinco minutos.", "Deja que la salsa se enfríe un poco, luego pulsa en una licuadora y pasa la salsa por un colador fino.", "Para los verdes, cocine al vapor el brócoli que brota en un vaporizador por 4-5 minutos hasta que esté tierno.", "Recorte la col rizada en pedazos grandes.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Calienta el aceite a 160 ° C / 320 ° F (usa un termómetro de sonda para verificar la temperatura si no estás usando una freidora). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Agregue la col rizada a la freidora y fría hasta que esté crujiente (asegúrese de cubrir la freidora con la tapa cuando cocine la col rizada, ya que puede escupir).", "Escurrir la col rizada en una bandeja forrada con papel de cocina y sazonar con sal marina.", "Coloque las patatas crujientes en un horno a la temperatura más baja posible para mantenerlas calientes hasta que estén listas para servir.", "Justo antes de servir, agregue la sidra restante a la salsa y sazone, al gusto, con sal.", "Vierte la salsa en el medio de los tazones para servir. Rocíe con aceite de berros. Coloque el pescado en el centro. Termine con el brócoli que brota púrpura y las patatas crujientes de col rizada."], "url": "www_bbc_co_uk_food_recipes_white_fish_poached_in_77936", "title": "Pescado blanco escalfado en aceite", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["15 g / ½ oz de levadura fresca o 2,5 ml / ½ cucharada de levadura seca", "300 ml / ½ pinta de leche tibia", "450 g / 1 libra de harina blanca fuerte", "1 cucharadita de sal", "25g / 1oz de mantequilla"], "method": ["Mezcle la levadura con un poco de la leche para obtener un líquido cremoso.", "Pon la harina y la sal en un recipiente y frota la mantequilla.", "Agregue el líquido de levadura y el resto de la leche para obtener una masa suave.", "Encienda una superficie de trabajo ligeramente enharinada y amasar hasta que la masa esté suave y elástica, alrededor de 10-15 minutos. Poner en un recipiente limpio y cubrir con film transparente. Párese en un lugar cálido durante 1 hora para levantarse.", "Caliente el horno a 220C / 425F / Gas 7. Engrase ligeramente una lata de pan de 1 kg / 2¼ lb.", "Vuelva a colocar la masa sobre la superficie de trabajo y amasar durante 5-10 minutos. Forme la masa en forma de hogaza para que se ajuste a la lata y colóquela en la lata. Cubra con una toalla de té limpia y deje que se levante nuevamente, aproximadamente 15 minutos.", "Hornee en el horno hasta que esté dorado y levantado, aproximadamente 30-40 minutos. La base del pan debe sonar hueca cuando lo toca. Encienda una rejilla para enfriar."], "url": "www_bbc_co_uk_food_recipes_whitebread_1291", "title": "pan blanco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400g / 14oz de mouli (también conocido como rábano blanco o daikon)", "¼ de cebolla blanca", "sal marina copos", "1 cucharadita de salsa de anchoas", "½ cucharadita de aceite de sésamo", "½ cucharadita de vinagre de manzana", "¼ cucharadita de gambas fermentadas", "1 cucharadita de azúcar", "1½ cucharadita colmada de gochugaru (chile rojo en polvo coreano)", "2 cebollas de primavera", "½ cucharadita de semillas de sésamo negro (opcional)"], "method": ["Cortar finamente el mouli en juliana, cortar finamente la cebolla y colocar ambos en un bol. Espolvorear con sal marina y dejar actuar durante diez minutos.", "Agregue la salsa de anchoas, el aceite de sésamo, el vinagre de manzana, los camarones fermentados, el azúcar y el chile en polvo a un tazón pequeño. Agregue la mezcla al mouli y la cebolla y mezcle bien para que quede todo recubierto.", "Picar las cebolletas por la mitad y luego cada mitad en cuartos a lo largo. Agregue al mouli, espolvoree las semillas de sésamo (si está usando) y sirva."], "url": "www_bbc_co_uk_food_recipes_white_radish_salad_90778", "title": "Ensalada de rábano blanco (Sangchae)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["675g / 1½lb de harina blanca fuerte, más extra para hacer harina", "1½ cucharadita de sal", "1½ cucharadita de azúcar", "3 cucharaditas de levadura fácil de mezclar", "1½ cucharadas de aceite de oliva virgen, más extra para engrasar", "450ml / 1 pinta de agua tibia", "1 huevo de gallinas camperas, golpeado", "semillas de amapola, para rociar"], "method": ["En un tazón grande, mezcle la harina y la sal. Espolvorea sobre el azúcar y la levadura fácil de mezclar.", "Agregue el aceite de oliva al agua. Haga un pozo en el centro de la harina y vierta la mayor parte de la mezcla de agua y aceite de oliva. Retenga un poco del líquido; Es posible que deba agregar más más tarde para obtener la consistencia correcta.", "Revuelva con una cuchara de madera y agréguela para formar una masa suave.", "Convierta la masa en una superficie ligeramente enharinada y amasar durante diez minutos hasta que quede suave y elástica.", "Coloque la masa en un tazón grande, ligeramente engrasado. Cubra y deje en un lugar cálido durante aproximadamente una hora para aumentar, hasta que duplique su tamaño.", "Cuando la masa haya subido, colóquela sobre una superficie de trabajo limpia y, con las manos enharinadas, amásala de nuevo para \"noquearla\". Amase durante unos cinco minutos hasta que quede suave y elástico.", "Divida la masa en tres pedazos iguales y ruede para formar tres formas iguales de \"salchicha\".", "Trenza las tres \"salchichas\" de masa para formar un pan grande y colócalo en una bandeja para hornear ligeramente enharinada.", "Precalentar el horno a 220C / 400F / Gas 7.", "Cubra el pan y regrese a un lugar cálido hasta que haya aumentado a una vez y media su tamaño. Esto llevará entre diez y 30 minutos.", "Esmalte el pan con el huevo batido y espolvoree las semillas de amapola en la parte superior.", "Hornee el pan en el horno durante 10-15 minutos.", "Reduzca el calor a 190 ° C / 375 ° F / Gas 5 y hornee por otros 30 minutos.", "El pan se cocina cuando está subido y dorado y suena hueco cuando se toca debajo."], "url": "www_bbc_co_uk_food_recipes_whitebreadplait_90314", "title": "Trenza de pan blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitebreadplait_90314_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina fuerte", "15g / ½ oz de sal", "55ml / 2fl oz de aceite de oliva", "20 g / oz de levadura fresca", "275ml / 9fl oz de agua"], "method": ["Mezcle todos los ingredientes en un tazón grande teniendo cuidado de no poner la levadura en la parte superior de la sal.", "Amasar bien con las manos y los nudillos hasta que la masa sea elástica, lisa y brillante. Cubra con una película adhesiva y deje que se levante durante 1 hora.", "Cubra una lata de hornear con pergamino para hornear y moldee la masa en una salchicha y colóquela en la lata.", "Precaliente su horno a 220C / 450F / Gas 6, luego deje que la masa suba por otros 30 minutos a 1 hora. Coloque la lata en el horno durante 35 minutos. Retire de la lata, toque la parte inferior con los nudillos - si suena hueco, está listo. Dejar enfriar sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_whitebread_66040", "title": "pan blanco", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1x1kg / 2¼lb de pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de azúcar en polvo", "4 huevos de gallinas camperas", "225g / 8oz de mantequilla, derretida, más extra para engrasar", "150 g / 5½ oz de harina común, tamizada", "225g / 8oz de chocolate blanco, picado", "100 g / 3½ oz de nueces de macadamia, picadas", "75g / 2¾oz de mantequilla", "175g / 6oz de azúcar glas", "1 vaina de vainilla, partido, semillas raspadas con un cuchillo (la vaina se puede reservar para otra receta)", "125g / 4½oz de mantequilla de maní crujiente", "50-75 ml / 2-4 fl oz de leche (opcional)"], "method": ["Precalienta el horno a 180 ° C / 350 ° F / Gas 4. Engrasa una lata cuadrada de 20 cm / 8 pulgadas con mantequilla.", "Para los brownies, en un tazón, bata el azúcar y los huevos hasta que estén pálidos y esponjosos. Batir la mantequilla derretida poco a poco, asegurándose de que cada adición de mantequilla se incorpore por completo antes de agregar la siguiente.", "Agregue la harina y dóblela cuidadosamente en la mezcla con una cuchara de metal.", "Agregue el chocolate blanco picado y las nueces de macadamia y dóblelas con cuidado en la mezcla.", "Con una cuchara, coloque la masa de brownie en la lata de torta preparada y agite suavemente hasta que esté nivelada. Transfiera la lata al horno y hornee por 30-35 minutos, o hasta que una brocheta insertada en el centro de los brownies salga limpia. Dejar de lado para enfriar.", "Mientras tanto, para el glaseado, en un tazón, mezcle la mantequilla, el azúcar glas y las semillas de vainilla con un batidor eléctrico hasta que estén suaves y bien combinados.", "Agregue la mantequilla de maní y bata hasta que la mezcla esté suave y bien combinada. (Agregue un poco de leche, si se usa, para aflojar la mezcla, según sea necesario).", "Una vez que los brownies de chocolate blanco se hayan enfriado, extiende sobre el glaseado de mantequilla de maní en una capa uniforme. Cortar los brownies en cuadrados, con cuidado eliminarlos de la lata y servir en un plato grande."], "url": "www_bbc_co_uk_food_recipes_whitechocolatebrowni_91667", "title": "Brownies de chocolate blanco (Blondies)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitechocolatebrowni_91667_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de queso crema suave", "4 huevos grandes de gallinas camperas", "1 vaina de vainilla, semillas raspadas", "225g / 8 oz de chocolate blanco de buena calidad", "225g / 8oz de crema fresca", "mantequilla, para engrasar", "Migajas de galletas de 55 g / 2 oz, para quitar el polvo de la lata con mantequilla (use cualquier tipo que le guste - los digestivos de chocolate son buenos)"], "method": ["Batir el queso crema en un tazón hasta que esté suave, luego agregar los huevos uno por uno, junto con las semillas raspadas de la vaina de vainilla.", "Derrita el chocolate blanco en un tazón sobre una fuente de agua hirviendo a fuego lento, luego doble la crema hasta que quede suave.", "Dobla la mezcla de chocolate en la mezcla de queso crema.", "Engrase un molde para pastel de 25 cm / 10 in y espolvoree la base con las migas de galleta para cubrir. Vierta la mezcla de chocolate y queso crema en la lata y golpee sobre una superficie firme para eliminar las burbujas de aire.", "Hornee en un horno bajo, 150C / 300F / Gas 2, durante 45 minutos-1 hora, o hasta que el centro esté firme.", "Deje descansar durante varias horas para reafirmarse, antes de apagar y servir."], "url": "www_bbc_co_uk_food_recipes_whitechocolatecheese_12412", "title": "Tarta de queso de chocolate blanco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 x 25cm / pastel de 10 pulgadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitechocolatecheese_12412_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla", "Chocolate blanco de calidad 300g / 10½oz, picado", "3 huevos medianos", "150 g / 5 oz de azúcar en polvo", "½ cucharadita de extracto puro de vainilla", "Harina normal de 200 g / 7 oz, tamizada", "pizca de sal", "azúcar glas para servir", "1 chile rojo fresco grande, sin semillas", "1 chile verde fresco grande, sin semillas", "100 g / 3½ oz de azúcar en polvo", "150ml / 5fl oz de agua"], "method": ["Caliente el horno a 180C / 355F / Gas 4.", "Engrase ligeramente una bandeja para hornear de lados rectos de 20cm x 30cm / 8in x 12in y forre la base con papel antigrasa.", "Corta finamente los chiles en la diagonal.", "Combine el azúcar, el agua y los chiles y deje que hierva, revolviendo. Cocine a fuego lento durante cinco minutos.", "En un recipiente a prueba de calor sobre una olla de agua apenas hervida, derrita la mantequilla con 150 g / 5 oz del chocolate blanco, batiendo bien hasta que quede suave. Retirar del fuego y dejar enfriar ligeramente.", "En otro recipiente, bata los huevos, el azúcar y la vainilla hasta que estén pálidos. Batir en la mezcla derretida de chocolate blanco.", "Dobla la harina tamizada y la sal, luego el resto del chocolate blanco picado. Escurra los chiles y agregue la mayoría de ellos al rebozado.", "Vierta en la bandeja para hornear, esparza los chiles restantes en la parte superior y hornee durante 25 minutos o hasta que la parte superior esté firme y ligeramente dorada. Retirar y enfriar en la sartén.", "Cortar en cuadrados pequeños o grandes, espolvorear con azúcar glas y servir."], "url": "www_bbc_co_uk_food_recipes_whitechocolatechilli_72899", "title": "Brownies de chocolate blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 25 pequeños o 12 medianos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 higos, tops marcados con una cruz con un cuchillo afilado", "4 cucharadas de miel clara", "Crema doble 500ml / 18fl oz", "150ml / 5½ fl oz de leche", "100g / 3½oz de chocolate blanco, roto en pedazos", "25 g / 1 oz de azúcar", "4 hojas de gelatina, remojadas durante 5-10 minutos en agua tibia, exprimidas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para los higos tostados, coloque los higos en una bandeja para hornear y rocíe sobre la miel. Asar en el horno durante 6-8 minutos, o hasta que los higos se ablanden y la miel se haya caramelizado. Dejar de lado.", "Mientras tanto, para la panna cotta, caliente la crema y la leche en una sartén a fuego medio hasta que la mezcla esté casi hirviendo a fuego lento.", "Reduzca el fuego a bajo y agregue el chocolate blanco y el azúcar hasta que los ingredientes se hayan derretido y la mezcla esté bien combinada.", "Retire la sartén del fuego y agregue las hojas de gelatina remojadas. Revuelva hasta que las hojas de gelatina se hayan derretido y luego deje la mezcla a un lado hasta que se haya enfriado por completo.", "Vierta la mezcla de panna cotta en moldes, luego enfríe en la nevera durante cinco horas o hasta que se solidifique.", "Para servir, sumerja las bases y los lados del molde en agua tibia para aflojar la panna cotta de los moldes. Ponga una panna cotta en el centro de cada uno de los cuatro platos para servir. Coloque una higos asada al costado."], "url": "www_bbc_co_uk_food_recipes_whitechocolatepannac_91281", "title": "Panna cotta de chocolate blanco con higos asados", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de almendras blanqueadas enteras", "500ml / 18fl oz de agua helada", "Pan blanco de 80g / 3oz, en cubos, sin costras", "2 dientes de ajo, picados", "50ml / 2fl oz de aceite de oliva", "50ml / 2fl oz de vinagre de jerez", "sal y pimienta negra recién molida", "150g / 5oz de pasas doradas"], "method": ["Coloque las almendras en un procesador de alimentos y mezcle hasta que estén bien molidas.", "Agregue 50ml / 2fl oz del agua y mezcle hasta formar una pasta.", "Agregue el pan y el ajo y mezcle de nuevo.", "Con el motor de la licuadora en funcionamiento, agregue gradualmente el resto del agua.", "Con el motor todavía en funcionamiento, agregue gradualmente el aceite de oliva.", "Agregue el vinagre de jerez y sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la sopa entre cuatro tazones y espolvoree unas pasas sobre cada una."], "url": "www_bbc_co_uk_food_recipes_whitegazpachosoup_88994", "title": "Sopa blanca de gazpacho", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "Harina normal de 25g / 1oz", "600 ml / 1 litro de leche", "sal y pimienta blanca"], "method": ["Derretir la mantequilla en una olla.", "Agregue la harina y cocine durante 1-2 minutos.", "Retire la sartén del fuego y mezcle gradualmente la leche para obtener una salsa suave. Regrese al fuego y, revolviendo todo el tiempo, lleve a ebullición.", "Cocine a fuego lento durante 8-10 minutos y sazone con sal y pimienta blanca."], "url": "www_bbc_co_uk_food_recipes_whitesauce_1298", "title": "salsa blanca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 1 pinta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whitesauce_1298_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 400 g / 14 oz de duraznos o peras, jugo reservado", "160ml / 5fl oz de zumo de melocotón o pera reservado", "Harina blanca fuerte 280g / 10oz", "15 g / ½ oz de levadura fresca", "100g / 3½oz de harina blanca fuerte", "Harina de pan de granero 200g / 7oz", "Masa inicial de 60 g / 2¼ oz (desde arriba)", "150ml / 5½ oz de sidra", "15 g / ½ oz de levadura fresca", "15 g / ½ oz de mantequilla sin sal", "10g / ¼ oz de sal fina", "aceite de oliva para cocinar", "6 chalotes de plátano, toscamente picados", "8 dientes de ajo, finamente picados", "3 chiles rojos calientes medianos, finamente picados", "Filete de pescadilla de 1.5kg / 3lb 5oz, piel removida y picada", "5 cucharadas de perejil plano de hojas picadas", "3 huevos de gallinas camperas, ligeramente golpeados", "Pan rallado blanco fresco de 250 g / 9 oz", "sal marina (preferiblemente de Cornualles) y pimienta negra recién molida", "2 yemas de huevo grandes de gallinas camperas", "1 cucharadita de vinagre de vino blanco", "½ cucharadita de mostaza en polvo inglesa", "1 cucharadita de sal", "1 limón, solo jugo", "275ml / 10floz de aceite de colza", "2 cucharadas de alcaparras picadas", "4 pepinillos, picados", "1 cucharada de perejil de hoja plana", "3 pepinillos, en rodajas finas", "1 pepino, picado", "2 chalotes, en rodajas finas", "aceite de colza, para lloviznar"], "method": ["Para la masa inicial, escurra la lata de duraznos / peras, reservando el jugo. Coloque la fruta en un tazón con 160ml / 5fl oz del jugo reservado. Cubra y deje fermentar a temperatura ambiente durante dos días.", "Transfiera la fruta y el jugo a una licuadora y mezcle hasta lograr un puré fino. Cuele el puré a través de un colador en una jarra.", "Coloque la harina, la levadura y el jugo fermentado en una batidora eléctrica independiente equipada con un gancho para masa y mezcle a alta velocidad hasta que se forme una masa homogénea.", "Para los rollos de sidra, coloque todos los ingredientes, excepto la sal, en un mezclador eléctrico equipado con un gancho de masa y mezcle a alta velocidad durante seis minutos. Agregue la sal y mezcle durante otros dos minutos. Transfiera la masa a un recipiente enharinado, cúbrala con un paño húmedo y déjela en un lugar cálido para que se levante durante 30 minutos.", "En una superficie enharinada, derriba la masa levantada y luego dale forma en diez rollos. Coloque los rollos en una bandeja para hornear, cúbralos con un paño húmedo y déjelos en un lugar cálido hasta que dupliquen su tamaño, aproximadamente 40 minutos.", "Precalentar el horno a 220C / 450F / Gas 7.", "Espolvoree la superficie de los panecillos con harina, luego hornee durante 15-20 minutos o hasta que estén dorados y el pan suene hueco cuando se golpee en la parte inferior.", "Transfiera a una rejilla de alambre y deje enfriar antes de servir.", "Para la hamburguesa, caliente una sartén a fuego medio y agregue un chorrito de aceite de oliva. Con cuidado fríe los chalotes, el ajo y los chiles durante dos minutos, luego retírelos a un plato y déjelos enfriar.", "Trabajando en dos lotes, mezcle la pescadilla en un procesador de alimentos durante un minuto, luego transfiera a un tazón grande.", "Agregue la mezcla de chalote y chile, el perejil, los huevos, el pan rallado y algo de sal y pimienta. Mezcle bien, usando sus manos, hasta que esté uniformemente mezclado y bien combinado. (Freír una pequeña porción de la mezcla para probar el condimento, agregando sal y pimienta según sea necesario).", "Divida la mezcla en bolas de 100 g / 3½ oz y moldee en empanadas. Coloque en un plato, cubra y refrigere durante 20 minutos o hasta que esté listo para cocinar.", "Para cocinar las hamburguesas, caliente su horno a 200C / 400F / Gas 6.", "Calentar una sartén a fuego medio y agregar una buena llovizna de aceite de oliva. Cuando esté caliente, agregue las empanadas y fría por dos minutos en cada lado. Transfiéralos a una bandeja para hornear y colócalos en el horno por tres minutos para terminar de cocinar.", "Para la salsa tártara, coloque las yemas de huevo, el vinagre, la mostaza, la sal y el jugo de limón en un procesador de alimentos.", "Mezcle para combinar, luego con el motor todavía en funcionamiento, gradualmente agregue el aceite de colza poco a poco.", "Continúe hasta que se haya agregado todo el aceite y la salsa tártara se haya espesado.", "Coloque la cuchara en un recipiente, agregue los ingredientes restantes y mezcle bien.", "Sazonar con pimienta negra y un poco más de sal si es necesario.", "Para la ensalada de pepinillo, mezcle los ingredientes y sazone con sal y pimienta negra recién molida.", "Dividir cada rollo por la mitad. Rocíe las mitades inferiores con un poco de aceite de oliva, luego agregue un poco de ensalada de pepinillos. Cubra con una hamburguesa de pescadilla, luego cuchara con salsa tartare."], "url": "www_bbc_co_uk_food_recipes_whiting_burger_in_cider_95401", "title": "Whiting burger en sidra con salsa tártara y ensalada de pepinillos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Rinde 10 hamburguesas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 mantequilla grande de perillas", "glug aceite de oliva", "4 cebollas medianas, cortadas en varios tamaños", "3 dientes de ajo, aplastados", "6 patatas grandes, cortadas en varios tamaños", "8 chuletas de cordero, exceso de grasa recortada y reservada - las chuletas gruesas en el cuello serán las mejores (ve a un carnicero si puedes)", "sal y pimienta negra recién molida", "565ml / 1 pinta de caldo de cordero de buena calidad", "perejil picado, opcional"], "method": ["Derrita la mantequilla con el aceite en una sartén grande de fondo grueso con una tapa ajustada.", "Agregue las cebollas y el ajo y hágalos sudar suavemente, removiendo lentamente los sabores - 15 minutos más o menos a fuego lento deberían hacerlo.", "Agregue las papas y mezcle bien para cubrir los jugos cremosos de la cebolla y el ajo.", "Agregue mucha pimienta negra recién molida y tres pellizcos de sal (¡dos pellizcos si tiene manos grandes!).", "Deje las papas y las cebollas en la sartén por otros 15 minutos a fuego muy bajo, teniendo cuidado de no dejar que se quemen; si comienzan a pegarse, agregue un poco de caldo.", "Mientras tanto, caliente una sartén a fuego lento y agregue el exceso de grasa recortada del cordero a la sartén. Deje que la grasa disminuya y agregue sal y pimienta negra recién molida.", "Retire y mantenga los trozos de grasa sólida que quedan y agregue las chuletas a la sartén y dore en ambos lados.", "Una vez dorado, quite las chuletas y agréguelas a las papas.", "Agregue un poco del caldo a la sartén y revuelva bien para sacar todos los trozos dorados del fondo de la sartén. Agregue esto a las chuletas y las papas.", "Agregue el stock restante justo debajo del nivel de sus ingredientes. Coloque la tapa en la sartén y cocine a fuego lento durante una hora y media.", "Si lo desea, agregue un poco de perejil 10 minutos antes de que el estofado esté listo.", "Retire el guiso del fuego y déjelo reposar durante aproximadamente 10 minutos antes de servir, luego pruebe y ajuste el condimento según sea necesario."], "url": "www_bbc_co_uk_food_recipes_whiteirishstew_80062", "title": "Guiso irlandés blanco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 hojas de menta fresca, más 1 ramita de menta, para adornar", "25 ml / 1 fl oz de puré de durazno blanco fresco", "20 ml / ¾fl oz de jugo de lima fresco", "1 cucharadita de jarabe de azúcar", "35ml / 1¼fl oz de ron oscuro", "2 cucharaditas de licor de melocotón", "dash ginger ale", "1 rodaja de durazno blanco, para adornar"], "method": ["Coloque las hojas de menta, el puré de melocotón, el jugo de lima, el jarabe de azúcar, el ron y el licor de melocotón en un vaso hondo. Revuelva con una cuchara de mango largo.", "Tres cuartas partes llenan el vaso con hielo picado y luego se rellenan con ginger ale.", "Para servir, enganche la rodaja de melocotón blanco y la ramita de menta sobre el borde del vaso."], "url": "www_bbc_co_uk_food_recipes_whitepeachmojito_91695", "title": "Mojito blanco de melocotón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["sal marina", "6 tomates grandes, cortados por la mitad", "2 cucharadas de aceite vegetal", "2 cebollas en rodajas", "Arborio de 450 g / 1 libra o arroz risotto similar", "1 cucharada de hojas frescas de tomillo", "salpicar vino blanco", "650ml / 1 pinta 3½fl oz de caldo de verduras calientes", "Crema doble 75ml / 3fl oz", "400 g / 14 oz espinaca bebé", "sal y pimienta negra recién molida", "virutas de parmesano, para servir (los vegetarianos pueden sustituir el queso duro vegetariano similar)", "2 cucharadas de aceite vegetal", "12 rebanadas de morcilla vegetariana"], "method": ["Precalentar el horno a 140C / 285F / Gas 1.", "Para los tomates tostados, cubra una bandeja para hornear con sal marina.", "Coloque los tomates, con el lado del corte hacia arriba, sobre la bandeja de sal y colóquelos en el horno durante tres horas, o hasta que los tomates estén completamente secos.", "Para el risotto, caliente el aceite en una sartén honda y agregue las cebollas. Freír las cebollas hasta que estén suaves pero no doradas.", "Agregue el arroz, el tomillo y el vino y mezcle bien. Cuando el vino haya sido absorbido por el arroz, agregue un cucharón de caldo y revuelva constantemente hasta que casi todo el caldo haya sido absorbido.", "Agregue otro cucharón de caldo y repita el proceso de remover y agregar caldo hasta que el arroz esté completamente cocido, pero aún con un poco de 'mordida'.", "Agregue la crema y la espinaca y mezcle bien, condimentar, al gusto, con sal y pimienta negra recién molida.", "Para la morcilla, caliente el aceite en una sartén limpia a fuego medio. Agregue la morcilla y fría, volteándola una vez, hasta que esté crujiente por ambos lados y completamente cocida.", "Para servir, coloque una porción generosa del risotto en cada tazón. Cubra cada plato de risotto con dos mitades de tomate asadas y tres rodajas de morcilla y adorne con virutas de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_whiteonionrisottowit_86925", "title": "Risotto de cebolla blanca con tomates asados", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 patata mediana, como maris piper, pelada, finamente cortada en rodajas", "75ml / 3fl oz de mantequilla clarificada", "1 cucharada de azúcar glas", "700g / 1½ lbs de bacalao, o pescado blanco, cortado en 8 piezas", "sal y pimienta negra recién molida", "3 cucharadas de aceite de oliva", "1 chalote, finamente cortado en cubitos", "150g / 5oz de mantequilla sin sal", "1 limón, segmentado", "1 cucharada de alcaparras", "1 cucharada de perejil fresco picado"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Cubra una bandeja de hornear con papel antigrasa.", "Sumerja las rodajas de patata en la mantequilla clarificada y colóquelas en la bandeja de horno revestida. Tamice el azúcar glas en la parte superior y cúbralo con otra pieza de papel resistente a la grasa. Coloque una bandeja para hornear pesada en la parte superior y hornee en el horno durante 10-12 minutos, o hasta que estén cocidos.", "Cepille las piezas de bacalao con aceite y sazone con sal y pimienta negra recién molida.", "Caliente dos cucharadas de aceite en una sartén grande y fría las piezas de bacalao por un minuto en cada lado, o hasta que estén bien cocidas. Retire de la sartén y reserve.", "Agregue el aceite restante a la sartén y fría los chalotes durante 2-3 minutos, o hasta que estén blandos. Agregue la mantequilla y cocínela durante 3-4 minutos, o hasta que tenga un color marrón pálido.", "Agregue los segmentos de limón, las alcaparras y el perejil y retire la sartén del fuego.", "Para servir, divida el pescado entre cuatro platos para servir, ponga la salsa sobre la salsa y cubra con las papas."], "url": "www_bbc_co_uk_food_recipes_whiting_with_lemon_and_31206", "title": "Bacalao con limón y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whiting_with_lemon_and_31206_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite de girasol", "Setas de 175g / 6oz, limpiadas y cortadas aproximadamente", "20g / ½ oz de avellanas blanqueadas, más o menos picadas", "4 tomates secados al sol en aceite, bien drenados, más o menos picados", "1 diente de ajo, finamente picado", "50 g / 1¾oz de pan blanco seco", "1/2 perejil pequeño, finamente picado", "1 cucharadita de hojuelas de chile seco", "100 g / 3½ oz de queso feta, desmenuzado", "2 pimientos rojos o amarillos pequeños, cortados por la mitad de arriba a abajo, sin semillas ni tallos", "sal y pimienta negra recién molida", "1 cebolla roja, finamente rebanada", "Setas de 200g / 7oz", "175g / 6oz de papas nuevas, sin pelar, cortadas en rodajas de 1cm / ½", "6 tomates secados al sol en aceite, drenados bien", "2 dientes de ajo, aplastados", "15 g / ½ oz de piñones", "2 cucharadas de aceite de oliva", "1 pescado entero, eviscerado y a escala", "1 limón, reducido a la mitad", "puñado de perejil flailedaf, toscamente picado, para servir", "puñado de albahaca fresca, aproximadamente triturada, para servir"], "method": ["Precaliente el horno a 220C / 200C Fan / Gas 7 y forre una lata de asar con papel de cocina.", "Calentar el aceite en una sartén grande y sofreír los champiñones a fuego alto durante 4 minutos. Agregue las avellanas y cocine por otros 5 minutos hasta que estén ligeramente tostadas. Sazonar y retirar del fuego.", "Agregue los tomates, el ajo, las migas de pan, el perejil y los copos de chile hasta que estén bien combinados. Doble suavemente en el feta.", "Coloque los pimientos, corte hacia arriba, en la lata y llene cada mitad con el champiñón y el relleno de queso feta. Cubra la superficie del relleno con un trozo de papel de cocina para evitar que se queme.", "Hornee durante 35 minutos, o hasta que los pimientos estén tiernos, y retire la lámina durante los últimos 10 minutos del tiempo de cocción.", "Mientras tanto, forre una gran bandeja para hornear con papel de hornear.", "En un tazón grande de vidrio, mezcle la cebolla, los champiñones, las papas, los tomates, el ajo, las nueces y el aceite.", "Extienda la mitad de las verduras en la bandeja. Coloque el pescado en la parte superior y use las verduras restantes para rellenar la cavidad del pescado y volcar sobre la parte superior. Agregue las mitades de limón y hornee durante 20-25 minutos o hasta que el pescado esté bien cocido.", "Sirva el pescado entero en un plato grande con los pimientos rellenos alrededor del pescado. Espolvoree con hierbas frescas y un chorrito de limón tostado."], "url": "www_bbc_co_uk_food_recipes_whole_baked_fish_with_44740", "title": "Pescado entero horneado con champiñones y pimientos rellenos de queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de patatas nuevas", "1 limón pequeño sin cera, en rodajas", "1 cucharada de semillas de cebolla negra", "1 x 280 g de jarra de tomates secados al sol en aceite", "¼ cucharadita de azúcar en polvo", "2 pescados enteros (aproximadamente 400 g / 14 oz) como lubina, trucha de mar o lenguado de Dover, limpios", "pequeño racimo de perejil fresco", "pequeño racimo de limón tomillo", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Hervir las papas durante 10 minutos en una olla grande de agua hasta que estén tiernas. Escurra y deje que se enfríe un poco, luego córtelas longitudinalmente en rodajas de aproximadamente 5 mm / ¼ de grosor.", "Ponga las papas en una fuente grande para hornear o asar lata forrada con papel de hornear y mezcle con las rodajas de limón y las semillas de cebolla. Retire los tomates deshidratados de su aceite, reserve el aceite y pique los tomates. Mezcle en las papas junto con 3 cucharadas de aceite reservado. Sazone con sal, pimienta y el azúcar y mezcle bien.", "Sazone el pescado por dentro y por fuera y coloque las hierbas en las cavidades del abdomen, dividiendo entre los peces. Coloque el pescado encima de las papas y rocíe sobre el resto del aceite de tomate seco.", "Hornee por 25-30 minutos o hasta que el pescado esté recién hecho y las papas estén crujientes. Retirar del horno y servir."], "url": "www_bbc_co_uk_food_recipes_whole_baked_fish_with_46332", "title": "Pescado entero al horno con patatas, limón y tomates secados al sol", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/whole_baked_fish_with_46332_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "2 cebollas blancas, finamente cortadas", "2 hojas de laurel", "200ml / 7fl oz de sidra", "1 solla (al menos 1kg / 2lb 4oz), eviscerado", "sal y pimienta", "200g / 7oz de mantequilla sin sal, ablandada", "2 chalotes, finamente picados", "4 filetes de anchoas saladas, picadas", "1 manojo de estragón, hojas recogidas y picadas, pocas hojas reservadas para decorar", "sal y pimienta", "1 limón, cortado en cuñas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En una lata para asar agregue el aceite, la cebolla, laurel y la sidra. Coloque en el horno por 15-20 minutos.", "Mientras tanto, prepare el estragón y la mantequilla de anchoa. Coloque la mantequilla, las chalotas, las anchoas saladas y el estragón picado en un recipiente y mezcle bien. Sazone con sal y pimienta y deje enfriar hasta que esté listo para cocinar el pescado.", "Sazone la solla por completo y quite las cebollas del horno. Coloque el pescado encima de las cebollas y luego vuelva al horno y cocine por 15 minutos. Para verificar que la solla esté cocida, haga una incisión en la parte más gruesa del pescado y vea si la carne se está separando del hueso.", "Coloque las perillas de la mantequilla saborizada sobre el pescado y luego revuelva todo en el horno durante dos minutos.", "Sírvalo en la bandeja para que pueda ayudarse a sí mismo. Sirva simplemente con algunas de las cebollas de sidra, una rodaja de limón y las hojas de estragón reservadas."], "url": "www_bbc_co_uk_food_recipes_whole_baked_plaice_cider_78626", "title": "Solla al horno, sidra, estragón y anchoa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 besugos enteros, eviscerados y limpiados", "2 dientes de ajo, pelados y toscamente picados", "1 chile rojo, finamente cortado", "1 cebolla pequeña o puerro, rebanadas gruesas", "2 cucharadas de perejil de flatillo picado", "1 limón, en rodajas", "1 cucharada de hojas de tomillo picadas", "100ml / 3½fl oz de vino blanco", "50ml / 2fl oz de aceite de oliva", "200g / 7oz de patatas nuevas", "50 g / 1¾oz de espinaca baby", "2 cucharadas de perejil de flatleaf, aproximadamente picado", "sal y pimienta negra", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el besugo al horno, rellenar la cavidad del pescado con el ajo, chile rojo, cebolla (o puerro), el perejil y la mitad del limón en rodajas. Coloque el pescado en una bandeja para hornear y coloque las rodajas de limón restantes y las hojas de tomillo en la parte superior. Verter sobre el vino blanco, rociar con aceite de oliva y cubrir con papel de aluminio.", "Hornee por 10-15 minutos (dependiendo del tamaño del pescado), o hasta que el pescado esté bien cocido.", "Para las espinacas, ensalada de papas y perejil nueva, caliente una olla de agua hirviendo y cocine las papas durante 10 a 15 minutos. Escurrir y colocar en un tazón grande.", "Agregue el bebé espinaca y perejil. Revuelva y sazone al gusto con sal y pimienta.", "En un tazón pequeño, agregue el aceite de oliva, el vinagre de vino blanco y la mostaza de Dijon y bata para combinar. Vierta el aderezo sobre la ensalada justo antes de servir.", "Para servir, coloque todo el besugo en un plato y sirva la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_whole_baked_sea_bream_41151", "title": "Dorada entera al horno con espinacas, ensalada nueva de patata y perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]