[{"isVegetarian": false, "title": "Bacon butty and brown sauce", "url": "www_bbc_co_uk_food_recipes_baconbuttyandbrownsa_91737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["700g/1½lb strong bread flour, plus extra for dusting", "1 tsp dried yeast", "1 tsp sugar", "400ml/14fl oz warm water", "1 tsp salt", "1 tbsp vegetable oil", "4 shallots, peeled, finely chopped", "4 fresh tomatoes, chopped", "75g/2½oz dates, chopped", "50ml/2fl oz ready-made tamarind sauce", "1 tsp ground ginger", "4 cloves", "4 black peppercorns", "pinch ground turmeric", "pinch cayenne pepper", "pinch ground coriander", "200ml/7fl oz water", "700ml/1 pint 5fl oz malt vinegar", "1 tbsp mustard powder", "2 tbsp molasses", "pinch salt", "2 tbsp muscovado sugar", "2 tbsp cornflour, mixed with enough water to form a loose paste", "30 slices thick-cut smoked back bacon, grilled", "butter, for spreading"], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Lightly oil and flour two 450g/1lb loaf tins.", "For the bread, sift the flour, yeast and sugar into a large bowl. Gradually add the water, mixing gently as you go, until the mixture comes together to form a dough (you may not need all of the water). ", "Knead the dough on a lightly floured work surface for 3-5 minutes, or until the dough feels smooth and elastic. Place the dough back into the bowl and cover with a damp tea towel. Leave in a warm, dry place for two hours. ", "Add the salt to the dough, then knead for 2-3 more minutes, or until smooth and elastic. Cut into two oblong loaves, then place each piece into a prepared loaf tin. Cover with a damp tea towel again and leave to rest in a warm, dry place for one hour. Meanwhile, preheat the oven to 220C/430F/Gas 7. ", "Bake the two loaves for 30-40 minutes, or until golden-brown and cooked through. (The bread will sound hollow when it is tapped on the bottom.) Remove from the oven and set aside to cool. ", "For the brown sauce, heat the oil in a non-reactive pan and gently fry the shallots for 4-5 minutes, or until softened but not coloured. Add the tomatoes, dates, tamarind sauce, ginger, cloves, peppercorns, turmeric, cayenne pepper, ground coriander and water. Bring to boil, then reduce the heat and simmer for ten minutes.", "Transfer the mixture to a food processor and blend until smooth. Pass the mixture through a very fine sieve into a clean, non-reactive pan and bring to the boil. Stir in the malt vinegar, mustard powder, molasses, salt and muscovado sugar. Whisk well and boil for 4-5 minutes. ", "Reduce the heat, then stir in the cornflour paste and cook for a further minute, or until the sauce is thickened. Set aside to cool slightly. (The sauce can be cooled and stored in an airtight bottle for up to three weeks in the fridge.)", "To serve, thickly slice the bread and butter each slice. Place three slices of cooked bacon in between two slices of bread, with dollops of brown sauce on top of the bacon. Serve immediately."]}, {"isVegetarian": false, "title": "Bacon-wrapped cheese stuffed chicken with fresh herbed pasta and sautéed broccoli", "url": "www_bbc_co_uk_food_recipes_baconwrappedcheesech_87168", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 boneless chicken thigh, skin removed, boned", "55g/2oz cheddar cheese, sliced", "3 rashers bacon", "freshly ground black pepper", "1 tbsp olive oil", "250ml/9fl oz double cream", "1 garlic clove, crushed", "handful each fresh chives, dill, parsley, chopped", "salt and freshly ground black pepper", "125g/4½oz pasta bows, cooked according to packet instructions", "1 tbsp olive oil", "25g/1oz butter", "½ head broccoli, cut into florets", "splash water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "For the chicken, stuff the chicken thigh with the cheese slices and season with salt and freshly ground black pepper.", "Wrap the chicken in bacon rashers. Secure with a wooden skewer. ", "Heat the olive oil in an ovenproof frying pan, add the chicken and cook until it is brown on all sides. Place the frying pan into the oven and cook for 12 minutes, or until the chicken is cooked through.", "For the pasta, put the cream and garlic into a saucepan and bring to the boil. As soon as it boils, remove from the heat, stir in the herbs and season, to taste, with salt and freshly ground black pepper. Add the cooked pasta and stir well.", "For the broccoli, heat the olive oil and butter in a frying pan, add the broccoli and a splash of water and sauté for three minutes. ", "To serve, pile the pasta onto a serving plate or bowl, slice the chicken thigh into 3-4 vertical slices and place on top of the pasta. Serve with the sautéed broccoli on the side."]}, {"isVegetarian": false, "title": "Bacon sandwich", "url": "www_bbc_co_uk_food_recipes_baconsandwich_82114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "2 slices crusty white bread", "2 slices prosciutto", "2 tomatoes, halved", "salt and freshly ground black pepper", "olive oil, to drizzle"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the olive oil over the bread. Heat a griddle pan until hot, add the bread slices and griddle for two minutes on each side.", "Remove from the pan and then griddle the prosciutto until crispy. Remove.", "Add the tomatoes to the grill pan and cook until soft.", "To serve, put the prosciutto onto one slice of griddled bread, top with the tomatoes, season well with salt and freshly ground black pepper, drizzle with olive oil and place the other griddled slice of bread on top."]}, {"isVegetarian": false, "title": "Bacon-wrapped chicken with cheese and potato tower", "url": "www_bbc_co_uk_food_recipes_baconwrappedchickenw_84124", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ chicken breast", "25g/1oz Wensleydale cheese, chopped", "100g/3½oz streaky bacon", "1 tbsp olive oil, plus extra to grease", "½ potato, peeled and thinly sliced", "25g/1oz Wensleydale cheese", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Using a sharp knife, cut a pocket halfway into the chicken breast. Stuff the cheese into the pocket and wrap the chicken in the streaky bacon, to seal up the pocket.", "Heat an ovenproof frying pan and, when hot, add the wrapped chicken breast and fry for two minutes on each side, until the bacon is golden but not crisp. Transfer to the oven and cook for five minutes, or until completely cooked through. (You will know the chicken is cooked when if pierced the juices run clear.)", "To make the potato tower, place a 5cm/2in greased chefs' ring onto a clean work surface. Add alternate layers of potato and cheese, seasoning well with salt and freshly ground black pepper between each layer.", "Heat the oil in an ovenproof frying pan over a medium heat. Carefully lift the chefs' ring and add to the pan. Cook for two minutes on each side, then transfer to the oven and bake for 12 minutes.", "To serve, push the potato and cheese tower out of the chefs' ring onto a plate and serve the chicken alongside."]}, {"isVegetarian": false, "title": "Bacon, mozzarella, and mushroom pizza", "url": "www_bbc_co_uk_food_recipes_baconmozzarellaandmu_80090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz plain flour", "50ml/2fl oz water", "2 tbsp olive oil", "pinch salt", "1 tin plum tomatoes", "3 tbsp olive oil", "1 garlic clove, finely chopped", "25g/1oz parsley chopped", "25g/1oz basil chopped", "salt and freshly ground black pepper", "50g/1¾oz crispy fried bacon lardons", "50g/1¾oz smoked mozzarella ripped", "50g/1¾oz marinated mushrooms"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "To make the base, in a large bowl mix the flour, water, oil and salt to form a dough.", "Dust your hands with flour and shape the dough into a ball. Roll out on a floured surface into an 20cm/8in round.", "Heat a small frying pan and cook for two minutes on each side.", "To make the tomato sauce, place the tomatoes, olive oil and garlic in a saucepan. ", "Simmer until thick, then stir in the herbs. Season with salt and freshly ground black pepper.", "Spread some of the tomato sauce on the pizza. Sprinkle over the bacon, mushrooms and cheese, and season with salt and freshly ground black pepper.", "Bake in the oven for five minutes until the cheese has melted."]}, {"isVegetarian": false, "title": "Bacon-wrapped pigeon stuffed with orange zest with roasted tomatoes and citrus salad", "url": "www_bbc_co_uk_food_recipes_baconwrappedpigeonst_88925", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 pigeon breasts", "1 orange, zest only", "1 tbsp chopped fresh rosemary", "4 smoked streaky bacon rashers", "1 tbsp olive oil", "7 vine cherry tomatoes ", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 orange, peeled and segmented", "½ lemon, peeled and segmented", "1 tbsp chopped fresh chervil", "6 fresh basil leaves, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the pigeon, lay out the bacon rashers side-by-side on a chopping board. Flatten out the pigeon breasts with a meat mallet or rolling pin, and place side by side across the bacon. Scatter over the orange zest and rosemary, then roll up tightly with the bacon on the outside.", "Heat the olive oil in a frying pan and fry the breasts for 6-8 minutes, until golden-brown all over and cooked through. Remove from the heat and set aside to rest, then slice in half.", "For the roasted tomatoes, place the tomatoes in an ovenproof frying pan and drizzle over the olive oil. Heat until the oil starts to sizzle, then season with salt and freshly ground black pepper and transfer to the oven to roast for 6-7 minutes, until softened.", "For the citrus salad, combine all the salad ingredients together in a bowl and mix gently to combine. ", "To serve, pile the citrus salad onto a serving plate and place the sliced pigeon on top. Arrange the roasted cherry tomatoes on the side and serve."]}, {"isVegetarian": false, "title": "Bacon sandwich", "url": "www_bbc_co_uk_food_recipes_baconsandwich_81145", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "50g/2oz streaky bacon", "25g/1oz unsalted butter, softened", "2 slices thick-cut white farmhouse loaf", "salt and freshly ground black pepper", "1 tbsp tomato ketchup"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan. Fry the bacon rashers until crisp and golden on both sides.", "Spread the butter on the bread slices, then place the bacon on the bread. Sandwich together and season with salt and freshly ground black pepper. Cut into triangles on a chopping board.", "Serve on a plate with a dollop of ketchup to the side."]}, {"isVegetarian": true, "title": "Bagels", "url": "www_bbc_co_uk_food_recipes_bagels_47163", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bagels_47163_16x9.jpg", "ingredients": ["450g/1lb strong bread flour, plus extra for dusting", "2 tsp salt", "7g sachet fast-acting yeast", "2 tbsp clear honey", "1 tbsp vegetable oil, plus extra for greasing", "3 tbsp black treacle or molasses", "fine polenta, for sprinkling", "1 free-range egg, beaten", "sesame seeds, sea salt, poppy seeds, or a savoury topping of your choice (optional)"], "serves": "Serves 7", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Sift the flour and salt into a large mixing bowl, then add the yeast and mix well.", "Measure 250ml/9fl oz warm water in a measuring jug and then stir in the honey and oil.", "Make a well in the centre of the flour and pour the liquid in gradually, bringing the dough together with your hands.", "Turn the dough out onto a clean, dry and floured work surface. Start kneading the dough, stretching it away with the palm of one hand and folding it back again with the other. Knead for approximately 10 minutes, adding more flour if the dough becomes too sticky. Continue kneading until the dough is firm and elastic.", "Shape the dough into a large ball and place in a lightly oiled, large bowl. Turn the dough in the oil to coat. Cover with cling film or a plastic bag and put in a warm, dry place for 1–3 hours, or until the dough has doubled in size.", "When the dough has proved, bring a large saucepan of water to the boil and add the treacle or molasses. Cover and turn off the heat.", "Lightly oil two baking trays and sprinkle with polenta. Remove the dough from the bowl, then punch it down and knead it briefly. Roll it into a rough sausage shape and divide into seven equal chunks. As you work with one chunk, keep the others covered with a clean tea towel.", "Firmly roll out each chunk into a long, slender sausage shape. Bring the ends together, splash the ends with a tiny bit of water and squeeze them together to seal. Place on the prepared baking trays and repeat with the remaining the dough.", "Cover and set aside to prove for a further 10–20 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Bring the saucepan of molasses and water back to a gentle simmer. Gently drop each bagel into the water (do this in batches of no more than three at a time) and turn over after 1-2 minutes. Simmer for another 1-2 minutes, then remove the bagels from the water, and drain.", "Place the bagels on the prepared baking trays, spacing them widely apart. Brush the tops with the beaten egg and sprinkle with sesame seeds, sea salt, poppy seeds or a savoury topping of your choice. Bake in the oven for 15 minutes, or until golden-brown, then turn them upside down for a further ten minutes to cook the bases. Transfer to a wire rack to cool before serving."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_79923", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz extra virgin olive oil", "4-5 cloves of garlic, peeled and crushed", "12 anchovies preserved in olive oil, drained and chopped", "120g/4oz unsalted butter, cut into cubes", "Selection of raw vegetables such as fennel, cauliflower, endive, celery, peppers and courgettes, cut into bite-sized pieces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the olive oil in a pan with the garlic and anchovies and stir over a low heat for a few minutes.", "Whisk in 90g of the butter, and as soon as it has melted, remove from the heat and whisk a few more times so that everything is creamy and amalgamated.", "Taste, and if you feel you want this dipping sauce, which is meant to be pungent but not acrid, a little more mellow, then whisk in two more tablespoons of butter.", "Pour into a fondue dish over a flame or just serve in a very warm bowl.", "Serve with the vegetable crudités for dipping."]}, {"isVegetarian": false, "title": "Bagna cauda", "url": "www_bbc_co_uk_food_recipes_bagnacauda_81861", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "¼ red onion, finely sliced", "150g/5½oz anchovy fillets in olive oil, chopped", "200g/7oz tinned flageolet beans, drained", "150ml/¼ pint vegetable stock", "1 tbsp double cream", "2 slices crusty white bread, crusts removed and cubed", "1 tbsp chopped fresh parsley, for garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon olive oil in a medium saucepan, add the red onion and anchovy fillets and sauté for three minutes. ", "Add the beans and vegetable stock and cook for two minutes. Stir in the double cream and heat for one minute. ", "Remove from the heat and blend with a hand blender until smooth.  Set aside.", "To make the croutons, roll the cubed bread in two tablespoons olive oil, season well and fry for three minutes or until golden brown. Drain on kitchen paper.", "To serve, pour the hot soup into a bowl and sprinkle over the croutons and chopped parsley."]}, {"isVegetarian": true, "title": "Baguettes", "url": "www_bbc_co_uk_food_recipes_baguettes_11543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baguettes_11543_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "5g/¼oz salt", "5g/¼oz fast action dried yeast", "30ml/1fl oz olive oil, plus extra for oiling", "180ml/6fl oz water"], "serves": "Makes 2 small baguettes", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour, salt, yeast, olive oil and most of the water in a food mixer with a dough hook attached, taking care not to let the yeast touch the salt until you begin mixing. ", "Start mixing on a slow speed, gradually adding the rest of the water until you have a smooth dough.  This should take about five minutes.", "Tip the dough into an oiled bowl, cover and leave the dough to prove for two hours.", "Tip the dough out onto an oiled surface. Dust your hands in a little flour and divide the dough in two.", "Knock back the dough and stretch and fold, and then roll the dough into a baguette shape.", "Place on a baguette tray or a large baking tray, cover and leave to prove until it has doubled in size. ", "Heat a roasting dish in the bottom of the oven and pour in some water to create some steam (this will help form the crust). Preheat the oven to 220C/425F/Gas 7 in a non-fan oven.", "Just before baking, slash the top of each baguette three times. ", "Bake the baguettes for 30 minutes. Then drop the temperature to 200C/400G/Gas 6 and cook for 10 minutes. The baked baguettes should be golden-brown and have a slight sheen to them. "]}, {"isVegetarian": true, "title": "Irish cream and chocolate cheesecake", "url": "www_bbc_co_uk_food_recipes_baileysandchocolatec_72293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileysandchocolatec_72293_16x9.jpg", "ingredients": ["100g/3½oz butter", "250g/8¾oz digestive biscuits, crushed", "600g/1lb 5oz cream cheese", "25ml/1fl oz Baileys or other Irish cream liqueur", "100ml/3½oz icing sugar", "300ml/10½oz double cream, whipped", "100g/3½oz grated chocolate", "200ml/7¼oz double cream, whipped", "cocoa powder, to dust"], "serves": "Makes 1", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Melt the butter in a pan and add the crushed digestive biscuits. Mix well until the biscuits have absorbed all the butter. ", "Remove from the heat and press into the bottom of a lined 18cm/7in springform tin. Place in the refrigerator and allow to set for one hour.", "Meanwhile, prepare the filling. Lightly whip the cream cheese then beat in the Irish cream and icing sugar. Fold in the whipped cream and grated chocolate. When smooth, spoon evenly onto the biscuits. ", "Refrigerate and allow to set for a further two hours. Once set, remove and decorate with whipped cream and cocoa powder dusted over the top. Serve."]}, {"isVegetarian": true, "title": "Baked Alaska", "url": "www_bbc_co_uk_food_recipes_baked_alaska_96104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint double cream", "300ml/½ pint milk", "1 vanilla pod (soft and fresh)", "3 free-range egg yolks", "100g/3½oz caster sugar", "3 free-range egg whites", "175g/6oz caster sugar", "2-3 tbsp cherry jam", "20cm/8in circle ready-made sponge cake about 2.5cm/1in thick"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the vanilla ice cream, pour the cream and milk into a heavy-based saucepan.  Split the vanilla pod lengthways and scrape out the seeds; then add the seeds and pod to the pan. Heat the mixture until just below boiling point.  ", "Remove the pan from the heat and set aside to cool for one hour to allow the vanilla flavour to infuse into the mixture.  Remove the vanilla pod and discard.", "Whisk the egg yolks and sugar in a bowl until pale and thickened. Slowly whisk in about one-quarter of the cream mixture. Reheat the remaining cream mixture until just boiling, then slowly whisk it into the egg mixture.", "Pour the egg mixture into a clean saucepan and cook over a gentle heat, stirring continuously until the custard thickens enough to coat the back of a spoon – it must not boil.  Pour the custard into a bowl and set aside to cool, then cover and chill in the fridge overnight.", "Pour the cooled custard into an ice cream machine and churn according to the manufacturer's instructions, until thick and smooth. Spoon into a freezer container and freeze until needed.", "For the meringue, whisk the egg whites in a clean, large bowl until stiff peaks form when the whisk is removed.  Slowly whisk in the sugar, whisking well between each addition.  Continue to whisk until glossy and very stiff peaks form when the whisk is removed.", "To assemble the Alaska, spread the jam over the circle of sponge cake, then arrange scoops of ice cream in a pyramid shape on top, leaving a 1.5cm/½in border. Spoon the meringue all over the ice cream, ensuring there are no gaps, and use the back of a spoon to make a swirl pattern.", "The baked Alaska can now be frozen until needed.", "To cook the baked Alaska, preheat the oven to 200C/400F/Gas 6 and bake for 8-10 minutes, or until golden-brown all over."]}, {"isVegetarian": false, "title": "Brilliant breakfast omelette", "url": "www_bbc_co_uk_food_recipes_baileys_breakfast_24338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileys_breakfast_24338_16x9.jpg", "ingredients": ["3 free-range eggs", "1 tbsp milk", "1 tsp butter", "1 tomato, finely chopped", "2 tbsp grated cheddar", "1 tbsp finely chopped fresh parsley or 1 tsp dried parsley", "2 thin slices good-quality ham", "salt and pepper"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Take your eggs and crack them into a bowl – don’t put them directly into the pan as you need to mix them first! Add a pinch of salt and pepper to the eggs and stir in the milk. ", "Beat the eggs with a fork, first use the fork to break the yolks of the eggs (this makes beating the eggs easier). Then tip the bowl gently and using a fork in a circular motion beat the eggs until the yolks and whites are combined and the mixture has an even colour.", "Bring your pan to a high heat and add the butter. Pour in your egg mixture and cook on a high heat for 2 minutes, making sure that the mixture is spread out evenly. Reduce the heat.", "As the egg begins to set, use a spatula to push the set egg towards the omelette centre, tilting the pan so the runny egg fills the space. Add the tomatoes and most of the cheese and parsley. Arrange the ham on top. ", "Cook the omelette for another minute, then loosen the edges with a spatula. Slide the omelette from the pan onto a warmed plate, tilting the pan so that the omelette folds nicely on the plate.", "Sprinkle with the remaining cheese and parsley, then serve."]}, {"isVegetarian": true, "title": "Baked Alaska with creamy chocolate sauce", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_creamy_40265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz caster sugar", "6 free-range egg whites", "1 small ready-made sponge flan case, cut in half horizontally to create two thinner discs (only one is needed in this recipe)", "50ml/2fl oz Armagnac", "1 x 500g/1lb 2oz tub firm vanilla ice cream (not soft-scoop)", "200g/7oz plain chocolate, roughly chopped", "200ml/7fl oz double cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked Alaska, bring 50ml/5fl oz water and the sugar to the boil in a saucepan. Keep boiling until the mixture reaches 121C on a sugar thermometer. (Caution: Hot sugar can be dangerous as it boils over very quickly. Do not leave unattended.)", "Meanwhile, whisk the egg whites in a large clean bowl, using a freestanding mixer or an electric whisk, until stiff peaks form when the whisk is removed.", "When the sugar reaches 121C, remove the pan from the heat. With the whisk or mixer running slowly, carefully pour the sugar syrup into the whisked egg whites in a thin stream, taking care not to let the hot sugar hit the beaters as it may splash. Continue to whisk until all the syrup has been incorporated into the egg whites and the mixture is glossy.", "Continue to whisk the egg white mixture at a slow speed until it has almost completely cooled (about 5 minutes).", "For the chocolate sauce, heat the chocolate with 2 tablespoons water in a saucepan over a low heat. When the chocolate has melted, add half of the cream and bring the mixture to the boil, whisking continuously.", "When the mixture is boiling, remove the pan from the heat and whisk the mixture until smooth. Whisk in the remaining cream until combined. Decant into a serving jug and set aside until needed.", "To assemble the baked Alaska, place the sponge disc onto a heatproof serving plate and drizzle the Armagnac all over it. Upturn the tub of ice cream in the centre of the sponge base and cut away the packaging.", "Spread half of the meringue mixture all over the ice cream and sponge base using a palette knife. Transfer the remaining meringue mixture to a piping bag with a star nozzle and pipe it over the top of the meringue layer to decorate.", "Using a chefs’ blow torch, heat the piped meringue all over until it caramelises to a light golden-brown. Alternatively, heat your oven to its highest setting and place the baked Alaska into the oven for a few seconds.", "Serve immediately with the chocolate sauce alongside."]}, {"isVegetarian": true, "title": "Baked Alaska with hot chocolate sauce", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_hot_20041", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_alaska_with_hot_20041_16x9.jpg", "ingredients": ["1 litre/1¾ pints vanilla, coffee or chocolate ice cream", "50g/1¾oz dark chocolate, in drops or broken into pieces", "125g/4½oz butter, softened, plus extra for greasing", "125g/4½oz caster sugar", "2 free-range eggs, beaten", "125g/4½oz self-raising flour, sifted", "3 free-range egg whites", "200g/7oz caster sugar", "pinch cream of tartar", "200ml/7fl oz double cream", "200g/7oz dark chocolate, in drops or chopped into pieces", "1–2 tbsp rum or brandy (optional)"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the base, line the pudding basin with two layers of cling film, leaving enough hanging over the edge to cover the sides of the basin. ", "Place the ice cream in the basin (you may need to allow it to soften for a few minutes, but don't let it melt) and press down to get a smooth surface , giving it a few gentle bangs to help remove any air holes.  Cover the top with the cling film and return it to the freezer.", "Preheat the oven to 180C/350F/Gas 4, butter the sides of the cake tin and line the base with a disc of baking parchment.", "Place the chocolate in a heatproof bowl set over a pan of gently simmering water. Leave until just melted, stirring occasionally, then remove from the heat and set aside.", "In a large bowl or in an electric food mixer, cream the butter until soft. Add the sugar and beat until the mixture is light and fluffy. Gradually add the eggs to the creamed butter mixture, beating all the time.", "Beat in the melted chocolate, then gently fold in the flour until combined.", "Pour the batter into the prepared cake tin and bake for 25-30 minutes, or until a wooden skewer inserted into the centre of the cake comes out clean.", "Remove the cake from the oven and turn the temperature up to 220C/425F/Gas 7 (if cooking the meringue straight away).", "Allow the cake to cool down in the tin for 10 minutes, then loosen around the edges with a small, sharp knife and carefully remove the cake. Place on a wire rack to cool down fully.", "For the meringue, in a large, spotlessly clean bowl, whisk the egg whites until they form soft peaks when the whisk is removed. ", "Add half of the caster sugar and the cream of tartar and whisk until stiff peaks form when the whisk is removed and the meringue is satiny and glossy. Fold in the remaining sugar with a metal spoon or spatula.", "For the chocolate sauce, place the cream in a saucepan and bring to the boil. Add the chocolate and stir until just melted, then add the rum or brandy (if using). Set aside until ready to serve (reheat the sauce gently if needed).", "To assemble, once the cake has cooled, place it in the middle of a baking tray (one that is completely flat, with no 'lip', so that the baked Alaska can be removed easily). ", "Take the ice cream out of the freezer. With the help of the cling film, remove the ice cream from the pudding bowl and place it upside down on the cake, remove all the cling film.", "Quickly spoon over the meringue, spreading it thickly and in peaks over the ice cream and the sides of the cake right down to the baking tray. You can cook the baked Alaska immediately or you can return it to the freezer for up to an hour (it will take an extra 3-4 minutes in the oven if cooking from frozen). ", "Place in the centre of the hot oven for 3-4 minutes or until the meringue is set on the outside and golden in colour.", "Carefully transfer the baked Alaska to a serving plate, using a palette knife dipped in hot water to help you slide and push it onto the plate.", "Serve immediately with the chocolate sauce."]}, {"isVegetarian": true, "title": "Baked almond cheesecake", "url": "www_bbc_co_uk_food_recipes_baked_almond_cheesecake_31585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz softened butter, for greasing", "40g/1½oz crunchy amaretti biscuits ", "750g/1lb 10oz ricotta cheese", "150g/5½oz caster sugar", "6 free-range eggs", "100ml/3½fl oz double cream", "1 lemon, zest only", "4 tbsp amaretto liqueur"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/ Gas 4. Grease a 24cm/9½in springform cake tin with a little butter on the base and all around the sides. (Put the base of the tin in upside down so that it will be easier to remove the cheesecake once it is ready.)", "Put the amaretti biscuits into a food processor and blend into fine crumbs. (If you don’t have a food processor, put the biscuits into a strong plastic bag and crush with a rolling pin instead.) Dust the amaretti biscuits on the bottom and the sides of the cake tin, tilting and shaking to get an even coating. Reserve some of the crumbs to sprinkle on the top of the finished cheesecake.", "Drain the ricotta cheese and put in a mixing bowl with the sugar. Using electric beaters, whisk until well combined. Gradually add the eggs, one at a time, whisking well between each addition. ", "Stir in the cream, lemon zest and the amaretto liqueur. The mixture should be very soft and light.", "Pour all the cheese mixture slowly into the prepared tin, starting in the middle to avoid disturbing the crumbs. Put on a baking tray and bake in the centre of the oven for 10 minutes. ", "Reduce the oven temperature to 160C/140C Fan/Gas 3 and cook for a further hour, or until the cheesecake is just set. Do not allow to over-brown. If the cheesecake does start to brown while it is still very wobbly, cover the tin loosely with a large piece of foil.", "When the cheesecake is ready, turn the oven off and open the door slightly. Wedge a folded tea towel or wooden spoon in the door to keep it ajar and leave the cheesecake to cool completely. This will take 3–4 hours and should prevent the top from cracking. When the cake is completely cool, transfer to the fridge and chill for at least 2 hours before removing from the tin. ", "Slide a knife around the cheesecake, taking care to retain as much of the crumb as possible, and release gently from the tin. Slide carefully off the tin base onto a serving plate and sprinkle the top with the reserved amaretti crumbs. Serve in wedges. "]}, {"isVegetarian": true, "title": "Baked Alaska with sautéed apples", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_sauted_94738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz caster sugar", "4 medium free-range eggs", "125g/4½oz plain flour", "25g/1oz butter, melted ", "2 Bramley apples, peeled, cored, thinly sliced", "75g/2¾oz butter, melted", "4 tbsp caster sugar", "300g/10½oz caster sugar", "6 free-range egg whites", "50ml/2fl oz Calvados", "1 x 500g/1lb 2oz tub firm vanilla ice cream", "75g/2¾oz unsalted butter", "2 eating apples, peeled and sliced", "2 tbsp brandy"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and line a 23cm/9in round cake tin.", "For the génoise sponge, put the sugar and eggs in a large bowl and whisk until thick and pale. Fold in the flour and melted butter and pour into the prepared cake tin.", "Bake in the oven for 20-30 minutes, or until risen and springy to the touch. Remove from the oven and set aside to cool. When cool enough to handle, turn out on to a wire rack to cool completely.", "For the apple purée, put the apples, butter, sugar and 2 tablespoons water into a lidded pan and cover. Place over a medium heat and bring to a simmer. Cook for 3-4 minutes until the apples have become light and softened. Whisk the apples to a smooth purée, then set aside to cool.", "For the baked Alaska, bring 50ml/2fl oz water and the caster sugar to the boil in a saucepan (CAUTION: Hot sugar can be dangerous as it boils over very quickly. Do not leave unattended).", "Meanwhile, whisk the egg whites in a large clean bowl, using a freestanding mixer or an electric whisk, until stiff peaks form when the whisk is removed.", "When the sugar reaches 121C on a sugar thermometer, remove the pan from the heat. With the whisk or mixer running slowly, carefully pour the sugar syrup into the whisked egg whites in a thin stream, taking care not to let the hot sugar hit the beaters as it may splash. Continue to whisk until all the syrup has been incorporated into the egg whites and the mixture is glossy. Continue to whisk the egg white mixture at a slow speed until it has almost completely cooled (about 5 minutes).", "Cut a circle of sponge out using a plate or a cutter. Place the sponge circle on a heatproof serving plate and drizzle the calvados all over it. Spoon the apple purée on top of the sponge.", "Shape the ice cream in the centre of the sponge base. Spread half of the meringue mixture all over the ice cream and sponge base using a palette knife, making sure there aren't any gaps. Transfer the remaining meringue mixture to a piping bag fitted with a star nozzle and pipe it over the top of the meringue layer to decorate.", "Using a chefs’ blow torch, heat the piped meringue all over until it caramelises to a light golden-brown. Alternatively, heat your oven to its highest setting and place the baked Alaska into the oven for a few minutes.", "For the sautéed apples, heat a medium frying pan and add the butter, once hot add the apples and cook until golden-brown. Finish with the brandy and reduce until most of the liquid has evaporated. ", "Place the baked Alaska on a serving plate and serve the sautéed apples alongside."]}, {"isVegetarian": true, "title": "Baked apples in a semolina soufflé", "url": "www_bbc_co_uk_food_recipes_baked_apples_in_a_74612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz unsalted butter", "4 apples, such as Blenheim Orange or Chivers Delight, stalks intact ", "60g/2¼oz caster sugar", "20g/¾oz unsalted butter", "100g/3½oz caster sugar, plus extra for sprinkling", "500ml/18fl oz whole milk", "2 drops of vanilla extract", "70g/2½oz semolina", "70g/2½oz sultanas", "1 tbsp calvados (optional)", "4 free-range medium eggs, separated", "8 drops of lemon juice", "icing sugar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked apples, preheat the oven to 170C/150C Fan/Gas 3½. Grease a baking tray with a little butter. ", "Melt the butter. Brush the apples with the melted butter and roll in the caster sugar to coat all over. Place on the greased tray and bake in the oven for 25–30 minutes, until almost tender and still holding their shape. Set aside.", "For the soufflé, preheat the oven to 190C/170C Fan/Gas 5. ", "Melt 10g/¼oz butter. Grease the baking dish with the melted butter, then sprinkle with 20g/¾oz sugar. Wipe the rim of the dish with a damp cloth, this will stop the soufflé sticking to the rim and enable it to rise evenly.", "Pour the milk into a saucepan, add the vanilla and bring to the boil. Lower the heat and add 60g/2¼oz sugar, the semolina, sultanas and calvados (if using). Simmer for 3 minutes, or until thickened, whisking constantly to keep it smooth. Transfer to a large bowl, sprinkle with a little sugar to prevent a crust forming and let the mixture cool slightly, for 2-3 minutes.", "In a clean bowl, whisk the egg whites with the lemon juice until soft peaks form and then slowly add the remaining 20g/¾oz caster sugar, whisking constantly. Continue to whisk until stiff peaks form when the whisk is removed.", "Mix the egg yolks into the warm milk mixture, then briskly whisk in a third of the whisked egg whites. Carefully fold in the remaining egg whites using a spatula or large metal spoon. As you fold in the egg whites, delicately cut and lift the mixture to ensure there is minimum loss of volume and lightness.", "Pour the mixture into the prepared baking dish and place the baked apples in it. Dab a knob of butter on top of each apple and sprinkle caster sugar evenly over the surface of the pudding. Bake for 25 minutes or until the soufflé is risen and golden-brown. Sprinkle with icing sugar and serve."]}, {"isVegetarian": false, "title": "Baked bean soup", "url": "www_bbc_co_uk_food_recipes_baked_bean_soup_08513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2½ canned borlotti beans, drained and rinsed", "1 celery stalk, trimmed, chopped", "1 spring onion, trimmed, sliced", "50g/2oz cooked bacon, chopped", "1 garlic clove, peeled and crushed", "pinch dried chilli flakes", "25g/1oz tomato purée", "pinch stock or bouillon powder", "250ml/9fl oz water"], "serves": "Makes 2 small bowls", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Spoon the borlotti beans into a lidded ovenproof dish and squash with the back of a spoon to loosen the skins. Add the celery, spring onion, bacon pieces and garlic. Stir in the chilli flakes and the tomato purée. ", "Pour over the water, add the stock powder or bouillon and stir again until well combined. Cover the dish with the lid.", "Transfer the dish to the oven and cook for 25-30 minutes, or until the soup has thickened. Stir well before serving in soup bowls with bread and butter on the side, if desired."]}, {"isVegetarian": false, "title": "Baked beans with bubble and squeak hash browns", "url": "www_bbc_co_uk_food_recipes_baked_beans_with_bubble_72371", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_beans_with_bubble_72371_16x9.jpg", "ingredients": ["600g/1lb 5oz floury potatoes", "2–3 tbsp double cream", "30g/1oz unsalted butter", "200g/7oz pancetta, cubed", "1 large bunch fresh thyme", "300g/10½oz savoy cabbage, finely shredded", "1 large bunch flat-leaf parsley, roughly choppped", "3–4 oregano sprigs, leaves picked", "1 tbsp wholegrain mustard", "sunflower oil for frying ", "salt and freshly ground black pepper", "30g/1oz dried porcini", "1 tbsp sunflower oil", "2 tbsp unsalted butter", "400g/14oz smoked pancetta, cubed ", "10 fresh thyme sprigs", "2 fresh bay leaves", "3 fresh rosemary sprigs", "1 large white onion, finely chopped", "1 large carrot, peeled and finely chopped", "2 celery sticks, finely chopped", "3 garlic cloves, crushed", "1 cinnamon stick", "300ml/10fl oz red wine", "2 tbsp tomato purée", "1 tbsp umami paste", "50g/1¾oz light brown sugar", "500ml/18fl oz fresh beef stock ", "200ml/7fl oz passata", "1 tbsp smoked paprika", "400g tin pinto beans ", "400g tin haricot beans", "large handful fresh flat-leaf parsley, roughly chopped", "3 sprigs oregano, leaves picked", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the hash browns, bring a large pan of salted water to the boil and cook the potatoes for 15–20 minutes, or until tender. Drain and roughly mash with the cream. Season and set aside.", "Place a frying pan over a medium heat and add the butter. Fry the pancetta and thyme until crispy. Remove with a slotted spoon and add to the mash. ", "Add the cabbage to the same pan with a dash water, cover and cook for 2–3 minutes, or until the cabbage is just tender. Stir into the mash with the herbs and mustard. Season, leave to cool completely and then refrigerate. ", "Meanwhile, to make the beans, place the mushrooms into a bowl and cover with boiling water to rehydrate. Drain and chop finely.", "Place a large pan over a medium heat with the oil and butter. Fry the pancetta, thyme, bay leaves, pepper and rosemary until brown and starting to crisp. Remove with a slotted spoon and discard. Add the onion, carrot and celery to the pan and fry for 10 minutes, or until softened. Add the mushrooms, garlic and cinnamon stick for 1 minute. Add the red wine and simmer until reduced by half. Add the tomato purée, umami paste, sugar, stock and passata and bring to the boil until reduced by half again. Stir in the paprika and beans and heat through.", "Divide the cooled potato mixture into 10 equal peices and shape into patties. ", "Heat a layer of oil 1cm deep in a non-stick pan over a high heat and fry the hash browns for 2–3 minutes on each side, or until golden and piping hot (CAUTION: hot oil can be dangerous. Do not leave unattended.). ", "Stir the fresh herbs through the beans, remove the cinnamon stick and serve with the hash browns. "]}, {"isVegetarian": true, "title": "Baked blackcurrant rice", "url": "www_bbc_co_uk_food_recipes_baked_blackcurrant_rice_06422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml/8fl oz apple juice ", "50g/2oz arborio rice", "40g/1½oz  fresh blackcurrants", "2 tbsp sugar", "½ tsp vanilla extract"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 220C/425F/Gas 7. ", "Pour the juice into the ovenproof dish, then add the rice.", "Prepare the blackcurrants by pinching out any woody stalks before adding them to the ovenproof dish. ", "Add the sugar and the vanilla extract. Give the mixture a stir and put on the lid. Place on a baking tray.  ", "You’ll need to ask a grown-up to help with this part. Cook for 20 minutes then leave to stand for at least 10 minutes with the lid on (the rice will carry on cooking). When the rice has cooled a bit, you can eat it! "]}, {"isVegetarian": true, "title": "Baked blueberry cheesecake with blueberry compôte", "url": "www_bbc_co_uk_food_recipes_baked_blueberry_91786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, melted, plus extra for greasing", "300g/10½oz digestive biscuits, crushed", "1 vanilla pod, seeds scraped out", "1 lemon, zest and juice", "200g/7oz caster sugar", "50g/1¾oz cornflour", "850g/1lb 4oz full-fat cream cheese", "375ml/13fl oz double cream", "4 large free-range eggs", "250g/9oz blueberries", "250g/7oz blueberries", "100g/3½oz caster sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line a 23cm/9in springform cake tin with baking parchment.", "For the baked blueberry cheesecake, melt the butter in a medium saucepan and add the crushed biscuits and mix.", "Tip into the prepared tin and press the crumbs down firmly and evenly to form a bottom crust. Bake for 10 minutes, then set aside to cool completely. ", "Place the vanilla seeds, lemon zest and juice, caster sugar, cornflour, cream cheese and cream in a large glass bowl and whisk together.", "Add the eggs continually whisking until the mixture is smooth, then add the blueberries and stir carefully.", "Pour onto the baked base and tap the tin lightly against the work surface to settle the mixture into the tin. Wrap the outside of the tin in a double thickness of foil if you are concerned about the tin’s water-tightness.", "Place the cake into a deep roasting tin containing 2cm/1in hot water.", "Bake in the oven for 1¼-1½ hours or until the cheesecake is golden-brown and just set.", "Turn the heat off in the oven and leave the cake in the oven for at least two hours or preferably overnight.", "For the blueberry compôte, place the blueberries and sugar into a sauce pan and cook until the sauce thickens.", "Serve the cooled cheesecake in slices with the blueberry compote."]}, {"isVegetarian": true, "title": "Baked Bramley apple with spiced custard and apple granita", "url": "www_bbc_co_uk_food_recipes_baked_bramley_apple_with_15070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 Bramley apples (or 125ml/4fl oz apple juice if you do not have a juicer)", "sugar, to taste", "2 Bramley apples, peeled, cored and cut in half", "100g/3½oz butter", "50g/1¾oz demerara sugar", "110g/3¾oz raisins", "50ml/1¾fl oz double cream", "110g/3½oz soft brown sugar", "5g ground mixed spice", "1 lemon, zest only", "1 orange, zest only", "250ml/9fl oz milk", "250ml/9fl oz cream", "50g/1¾oz fresh Douglas fir pine needles", "200g/7oz pasteurised egg yolk, or fresh egg yolks", "80g/2¾oz caster sugar"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the apple granita, juice the apples using a juicer (or alternatively use bought apple juice). You will need 125ml/4fl oz apple juice. Add a little sugar if it is too sour, then strain through a fine metal sieve into a freezable tub. Freeze until completely frozen.", "For the baked apples, preheat the oven to 240C/475F/Gas 9. ", "Use a pastry brush to coat the apples in some of the butter and sprinkle over the demerara sugar. Set aside until needed.", "Place the remaining baked apple ingredients, except the mixed spice and zests, into a pan. Bring to the boil and simmer for two minutes. Remove from the heat and add the mixed spice and zest.", "Divide the mixture between four small ovenproof pots or ramekins and top with the halved apples.Transfer to the oven and bake for 10 minutes.", "Reduce the oven temperature to 160C/325F/Gas 3 and cook until soft (approximately 10 minutes), then set aside.", "For the pine custard, in a pan bring the milk, cream and pine needles up to the boil. Turn off the heat and set aside for 30 minutes to infuse.", "When the mix has infused, slowly bring back up to the boil.", "Whisk together the egg yolks and sugar in a large heatproof bowl until pale.", "When the infused milk is boiling, turn off the heat. Pour it gradually, in a steady stream, into the egg yolk mixture, whisking constantly. Keep whisking until the mixture has cooled down a little, then strain through a fine metal sieve into a clean pan and keep warm.", "When ready to serve, scrape the frozen juice with the back of a spoon to form a granita.", "To serve, divide the custard between four bowls then place a baked apple half on top and sprinkle over the granita. Serve at once."]}, {"isVegetarian": false, "title": "Baked burrito", "url": "www_bbc_co_uk_food_recipes_baked_burrito_04690", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_burrito_04690_16x9.jpg", "ingredients": ["1 small onion", "oil, for cooking", "600g/1lb 5oz skinless, boneless turkey breast or thigh", "3 tsp Mexican seasoning, such as mild taco seasoning", "2 tomatoes, halved", "200g tin of sweetcorn, drained", "200g/7oz grated cheese, such as Cheddar", "4 large soft tortilla wraps", "4 tbsp natural yoghurt, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 4. ", "Peel and roughly chop the onion. Heat a large frying pan over a medium heat, then add a dash of oil and the onion. Cook for 7-10 minutes, or until soft and translucent but not brown. Reduce the heat if the onion starts to colour.", "Cut the turkey meat into 2½cm/1in cubes and add them and the Mexican seasoning to the onion. Cook for 10 minutes, stirring now and again, or until the turkey is cooked through with no sign of pink juices when you cut into the largest cube.", "Grate the cut sides of the tomatoes into the pan, using a cheese grater, and stir. Discard the skin once the flesh is grated. Increase the heat to medium-high and cook for 3-4 minutes, or until the tomato mixture has thickened and coats the turkey. Add the sweetcorn and stir.", "Put the tortilla wraps on a chopping board and spoon the meat mixture into the middle of the wraps. Sprinkle with the grated cheese. Fold the sides of the wraps over the filling, then roll the wraps up from bottom to top to enclose the filling completely.", "Put the wraps, folded side-down on a baking tray. Put a little oil into your hand and gently rub it over the wraps. Place in the oven and bake for 7 minutes, then turn the wraps over and bake for a further 5 minutes, or until golden and crisp all over.", "Serve each burritos with a tablespoon of yoghurt on the side for dipping."]}, {"isVegetarian": true, "title": "Baked celeriac and crispy duck egg salad", "url": "www_bbc_co_uk_food_recipes_baked_celeriac_and_74227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range duck eggs", "115g/4oz flour ", "2 free-range eggs, lightly beaten", "115g/4oz breadcrumbs ", "1 medium celeriac, peeled ", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "50g/2oz butter ", "1 sprig thyme", "3 tbsp mayonnaise", "½ lemon, juice only", "3 tbsp extra virgin olive oil", "1 tsp grated truffle", "1 handful celery leaves ", "1 handful watercress, leaves picked", "1 fresh truffle, finely shaved"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Bring a pan of salted water to a rolling boil. Lower the duck eggs in with a slotted spoon and boil for six minutes. Drain the eggs and place in ice-cold water for 30 minutes.", "Place the flour into a wide shallow bowl, the beaten eggs in another bowl and the breadcrumbs in a third bowl.", "Peel the duck eggs and roll them in flour, then the beaten eggs and finally in the breadcrumbs. Place them on a baking tray and set aside, covered, in the fridge.", "Preheat the oven to 180C/350F/Gas 4.", "Season the whole celeriac with salt and pepper. ", "Place a heavy-based oven-proof frying pan over a medium heat. Add the vegetable oil then fry the celeriac gently until golden-brown all over. This will take about 30 minutes. (You will need to balance the celeriac on the side of the frying pan to colour it on all sides.)", "When the celeriac is golden-brown all over, add the butter and the thyme sprig. Place the celeriac into the oven, and bake for 20-30 minutes, basting the celeriac with the butter 2-3 times, or until soft and cooked through. Set aside to cool.", "When cool enough, slice the celeriac very thinly. ", "Finely julienne a few slices of the celeriac and mix with the mayonnaise.", "Whisk the lemon juice, olive oil and grated truffle together with a pinch of salt and black pepper to make a dressing.", "Dress the slices of celeriac with the truffle dressing and a pinch of sea salt.", "Heat a deep fat fryer to 190C/375F or place enough oil in a large saucepan to come halfway up the pan and heat until a bread cube dropped in the oil sizzles and turns golden-brown. (CAUTION: Hot oil may be dangerous. Do not leave unattended.)", "Deep-fry the egg straight from the fridge for one minute or until the breadcrumbs are golden-brown. Remove the egg from the oil with a slotted spoon and set aside to drain onto kitchen paper.", "To serve, divide the slices of celeriac among four serving plates - arrange them to get height and show texture. ", "Place a spoonful of the finely sliced celeriac in mayonnaise (remoulade) in the centre of each plate.", "Cut the top off each egg to reveal the runny yolk and place the egg on top of the celeriac.  ", "Scatter the celery and watercress leaves and truffle slices over the dish and serve."]}, {"isVegetarian": true, "title": "Baked cheesecake with blueberries", "url": "www_bbc_co_uk_food_recipes_baked_cheesecake_with_97326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz butter, melted, plus extra for greasing", "175g/6oz digestive biscuits", "175g/6oz blueberries, plus extra for decorating", "450g/1lb cream cheese", "150g/5½oz caster sugar", "1 tsp vanilla extract", "4 free-range eggs, lightly beaten", "icing sugar, to dust"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Butter the sides and base of a 23cm/9in cake tin.", "Place the biscuits into a food processor and pulse until the mixture resembles rough breadcrumbs. Alternatively, place them into a plastic bag and bash with a rolling pin. Mix the crushed biscuits with the melted butter and press down into the base of the tin. Spread the blueberries over the base and chill in the fridge until needed.", "Beat the cream cheese, sugar, vanilla extract and the eggs together in a large bowl until smooth and creamy. Pour over the top of the blueberries and then bake in the oven for 40 minutes, or until it is a pale golden-brown and only wobbles slightly when you gently shake the tin.", "Remove from the oven and allow to cool in the tin for about 10-15 minutes, then run a knife around the edge to loosen it and carefully remove the cheesecake from the tin. Transfer to a serving plate. Sprinkle over a few blueberries, then dust with icing sugar.", "Cut into slices to serve. This cheesecake is best eaten when it is at room temperature."]}, {"isVegetarian": false, "title": "Baked courgette with parmesan", "url": "www_bbc_co_uk_food_recipes_baked_courgette_with_40269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash vegetable oil, for greasing", "1 medium courgette, trimmed, grated", "1 rasher cooked bacon, chopped", "1 heaped tbsp plain yoghurt", "25g/1oz feta", "1 heaped tbsp grated parmesan", "pinch ground black pepper", "1 free-range egg, beaten", "2 tomatoes, sliced, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Grease an ovenproof dish with a little oil using a pastry brush. Add the grated courgette, then scatter over the chopped bacon.", "In a bowl, mix together the plain yoghurt, feta, parmesan and ground black pepper until well combined. Stir in the beaten egg until well combined.", "Pour the egg-and-yoghurt mixture on top of the courgette and bacon mixture. Transfer the dish to the oven and bake for 20–25 minutes, or until the egg-and-yoghurt mixture has set and is golden-brown on top. ", "Remove the dish from the oven and set aside to cool slightly. Serve with the sliced tomatoes, if desired."]}, {"isVegetarian": true, "title": "Baked courgette fritters with marinara sauce", "url": "www_bbc_co_uk_food_recipes_baked_courgette_fritters_54670", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_courgette_fritters_54670_16x9.jpg", "ingredients": ["1 tsp extra virgin olive oil", "1 large garlic bulb, with the top sliced off", "200g/7oz low-fat cream cheese ", "3 tbsp low-fat Greek yoghurt", "½ bunch chives, finely chopped", "2 tbsp olive oil", "1 large red onion, finely chopped", "2 garlic cloves, finely chopped", "400g/14oz can chopped tomatoes ", "2 sprigs thyme, leaves finely chopped (about 1 tsp chopped leaves)", "pinch caster sugar (optional)", "flaked sea salt and freshly ground black pepper", "large handful fresh basil leaves, roughly torn", "3 medium free-range eggs", "50g/1¾oz wholemeal or plain flour", "125g/4½oz dried natural breadcrumbs", "2 packed tbsp finely grated parmesan cheese (or a similar vegetarian hard cheese)", "2 tsp chopped rosemary leaves", "2 medium courgettes (as straight as possible)", "spray oil", "1 small lemon, cut into wedges"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the roasted garlic skinny dip, preheat the oven to 220C/425F/Gas 7 (fan 200C). Drizzle the oil in the centre of a 20cm/8in square of aluminium foil and sit the garlic, cut-side down on top. Wrap up loosely, sit on a small baking tray and pop in the oven straight away (even if the oven is not hot enough) to cook for about 50-55 minutes, or until very soft. ", "For the marinara sauce, heat the oil in a medium pan over a low heat. Add the onion and cook for about 6-8 minutes, or until beginning to soften, stirring regularly. Add the garlic and cook for a further minute. Stir the tomatoes, thyme, sugar (if you think it needs a little sweetening) and some salt and pepper. Turn down the heat so that the mixture is just simmering and leave to cook for 15-20 minutes, or until the sauce has thickened and the flavours have intensified. ", "Meanwhile, make the courgette fritters. Line two large baking trays with baking parchment. Beat the eggs in a large shallow bowl. Put the flour into another and stir in a couple of large pinches of salt and lots of pepper. Divide the breadcrumbs, parmesan and rosemary evenly between two large shallow bowls and set aside. ", "Trim the courgette ends and slice one lengthways into three evenly-sized slices. Cut each slice into three long, evenly-sized strips and then in half across their width to give 18 chips. Repeat with the second courgette to give 36 chips in total. Each one will be about 1.5cm/¾in wide and 7-8cm/3in long, depending on the size of your courgettes.", "Working with a few at a time, toss the courgette batons in the flour until well coated - this will help the egg to stick in the next stage. Toss through the beaten egg and, after allowing the excess egg to drip off, roll them around in one of the batches of breadcrumbs to stick all over evenly. Arrange in a single layer on the baking trays as you go. Repeat until all of the courgettes are coated, using the second batch of breadcrumbs once the first has been used up. ", "The marinara sauce will probably be nice and thick at this stage. If it's too thick to pour, stir in a little water. Remove from the heat, season to taste with salt and pepper, add the basil leaves and cover to keep warm until ready to serve.", "Spray the courgettes with the oil and place in the oven for 20 minutes. If tight on space, nestle the garlic parcel onto one of the courgette trays. Half way through cooking time, remove the courgettes, turn them over, give another spray and pop them back in the oven - this time on the opposite shelves to what they were already on. Once cooked, they should be lightly browned and very crisp all over. ", "Once softened, remove the garlic from the oven and, when cool enough to handle, unwrap it and squeeze the garlic cloves from their papery skins into a bowl. Mash lightly with a fork and then add the cream cheese, yoghurt and chives and stir everything together really well. Season to taste and spoon into a serving bowl.", "Spoon the marinara sauce in a serving bowl. Pile the courgettes onto a serving platter and serve with the lemon wedges. "]}, {"isVegetarian": false, "title": "Baked celeriac with smoked trout and caper salsa", "url": "www_bbc_co_uk_food_recipes_baked_celeriac_with_34623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium celeriac, skin scrubbed but left on, cut in half lengthways ", "2 tbsp olive oil", "10g/¼oz thyme sprigs", "80g/2¾oz crème fraîche", "20g/¾oz fresh horseradish, peeled and finely grated (use horseradish cream as an alternative)", "150g/5½oz smoked trout or salmon, sliced into 3cm/1¼in strips ", "2 tsp lemon juice", "flaky sea salt and black pepper", "20g/¾oz small capers (or regular capers, chopped) ", "1 tbsp finely chopped parsley ", "1 tsp finely chopped tarragon", "1½ tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Place the celeriac halves on 2 separate pieces of foil, large enough to cover the celeriac. Drizzle 1 tablespoon of oil over each half, along with the thyme and ¾ teaspoon of salt (on each half) and rub everything evenly. Finish with a generous grind of pepper and then seal the celeriac in the foil. Bake for an hour, until soft. Remove from the oven, unwrap and foil and set aside for about half an hour, for the celeriac to come to room temperature. ", "Meanwhile, mix together the crème fraiche and horseradish, with a pinch of salt and a grind of pepper. Keep in the fridge until ready to serve. ", "For the salsa, mix together all the ingredients and set aside. ", "When ready to serve, cut each celeriac half into 4 long wedges, each about 4-5cm/1½-2in wide. Place 2 wedges onto each plate and then spoon the horseradish cream on top. Layer the trout or salmon on top of this, followed by the salsa. Drizzle each portion with lemon juice and serve. "]}, {"isVegetarian": true, "title": "Baked crumble nectarines", "url": "www_bbc_co_uk_food_recipes_baked_crumble_nectarines_25068", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour", "20g/¾oz butter", "1 tsp demerara sugar", "1 heaped tbsp rolled oats", "1 ripe nectarine, halved, stone removed", "2 tbsp orange juice", "plain yoghurt, to serve"], "serves": "Makes 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7.", "Rub the flour and butter together in a bowl using your fingertips until the mixture resembles breadcrumbs. Stir in the demerara sugar, then the oats.", "Lay the nectarine halves in an ovenproof dish, cut sides facing upwards. Pour in the orange juice. Pile the crumble topping onto the cut surfaces of the nectarines. ", "Place the ovenproof dish onto a baking tray. Transfer to the oven and bake for 12-15 minutes, or until the nectarines have softened and the crumble is crunchy and golden-brown.", "Serve on small plates with plain yoghurt."]}, {"isVegetarian": false, "title": "Baked crab 'poblano' with achiote", "url": "www_bbc_co_uk_food_recipes_baked_crab_poblano_with_42581", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 pasilla chilli, seeds removed", "100g/3½oz salted butter", "1 large red onion, diced", "3 garlic cloves, chopped", "20g/½oz achiote paste, softened (avaliable at specialist stores and online)", "2 tbsp orange juice", "2 poblano chillies, deseeded and finely sliced (or alternatively 3–4 tbsp pickled jalapeño peppers)", "3 large tomatoes, deseeded and roughly chopped", "250g/9oz fresh white crab meat", "small handful fresh coriander, roughly chopped", "½ tsp salt", "30g/1oz panko breadcrumbs", "30g/1oz Parmesan (or alternaive vegetarian hard cheese), grated"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour boiling water into a small heat-resistant bowl and soak the pasilla chilli for 20 minutes. Drain the water and chop the chilli finely.", "Preheat the grill to its highest setting.", "Melt the butter in a saucepan and fry the onions and garlic over a medium heat for 3–4 minutes, until softened. ", "Mix the achiote paste with the orange juice in a small bowl until smooth, then stir into the onions with the pasilla chilli, poblanos (or pickled jalapeños) and tomatoes. Cook for 4–5 minutes.", "Stir in the crab meat and coriander until heated through. Season with salt. Divide the mixture equally between 6 ramekins. ", "Mix the panko breadcrumbs with the Parmesan and sprinkle over the ramekins. Grill for a few minutes until the tops are crisp and golden-brown. Serve immediately. "]}, {"isVegetarian": false, "title": "Baked egg with ham and spinach", "url": "www_bbc_co_uk_food_recipes_baked_egg_with_ham_and_69539", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_egg_with_ham_and_69539_16x9.jpg", "ingredients": ["25g/1oz slice ham ", "40g/1½oz baby spinach", "1 medium free-range egg", "30g/1oz slice wholemeal or granary bread", "2g low-fat margarine (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Line a ramekin with the ham. Pour some boiling water into a small saucepan over a low heat. Add the spinach and cook for 2 minutes, or until wilted. Remove from the heat, squeeze out any excess water and place on top of the ham. ", "Break the egg on top of the spinach. Bake for 10–15 minutes, or until the egg has set. Meanwhile, toast the bread and spread with low-fat margarine, if using, and serve."]}, {"isVegetarian": true, "title": "Baked eggs in avocado with pitta", "url": "www_bbc_co_uk_food_recipes_baked_eggs_in_avocado_52473", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_eggs_in_avocado_52473_16x9.jpg", "ingredients": ["1 ripe avocado", "2 medium free-range eggs", "1 tomato, finely chopped", "3 spring onions, finely sliced", "1-2 pitta breads, toasted", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Slice the avocado in half lengthwise and twist to separate the halves. Chop a knife into the avocado stone (like an axe) and lever it out of the avocado. If the stone is small, you may need a teaspoon to scoop out a bit of a bigger hole. A tablespoon-size hole works best.", "Scrunch up some tin foil to hold the avocado halves in place on a baking tray, or wedge them into a small tin so they don't move.", "Crack one of the eggs into a small bowl, then carefully pour it into one half of the avocado and season with salt and pepper. Repeat with the other half, then bake for 12-15 minutes until the egg white is cooked through.", "Serve with the tomato, spring onions and toasted pitta on the side. "]}, {"isVegetarian": true, "title": "Baked explorer pancakes", "url": "www_bbc_co_uk_food_recipes_baked_explorer_pancakes_79902", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil for greasing ", "1 free-range egg ", "2 dessertspoons milk ", "2 spring onions", "small handful fresh coriander ", "2 dessertspoons sweetcorn ", "8 green beans ", "50g/2oz plain flour ", "½ tsp baking powder ", "pinch ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Preheat the oven to 220C/425F/Gas 7. Line a baking tray with some baking parchment and brush it with a little oil.", "Break the egg into a cup, add the milk and stir until well mixed. ", "Ask a grown-up to help you use some scissors to chop up the spring onions. Cut off the roots and the dark green part and throw them away. Chop up the rest of the spring onion into a mixing bowl. Cut up the fresh coriander in another cup using the scissors. Add the chopped coriander to the mixing bowl, then add the sweetcorn.", "Snap off a little of each end of the green beans with your fingers, then snap them into small pieces  (about 2cm/1in) and add to the mixing bowl. Stir all the ingredients together, then add the egg mixture to the vegetables.", "In another bowl, stir the flour and baking powder together. Add the flour mixture to the vegetable mixture and stir to form a smooth batter - it will be quite thick. Sprinkle in the pepper.", "Drop four heaped dessertspoons of the batter onto the lined baking tray to make four pancakes. Flatten them a little with the back of the spoon.  ", "Bake in the oven for 10 minutes. "]}, {"isVegetarian": true, "title": "Baked falafel with tzatziki", "url": "www_bbc_co_uk_food_recipes_baked_falafel_with_09084", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp olive oil ", "2 small onions (200g/7oz in total), finely chopped", "2 x 400g tins chickpeas, rinsed and drained ", "4 garlic cloves, grated ", "3 tsp ground cumin ", "2 tsp ground coriander ", "2 tsp sea salt flakes ", "30g/1oz coriander leaves, roughly chopped ", "30g/1oz flatleaf parsley leaves, roughly chopped ", "40g/1½oz plain flour ", "freshly ground black pepper ", "olive oil spray ", "200ml/7oz 0% fat plain yoghurt", "140g/5oz piece cucumber, grated ", "1 small garlic clove, finely grated ", "2 tbsp finely chopped mint leaves", "pinch sea salt ", "pinch granulated sweetener"], "serves": "Makes 18", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8 and line a baking tray with baking parchment. ", "Heat the olive oil in small frying pan over a medium heat. Add the onions and cook for about 10 minutes, or until softened and starting to brown (add a splash of water if they start to stick). Remove from the heat and leave to cool. ", "Put the onions, chickpeas, garlic, spices, salt, chopped herbs, flour and some pepper in a food processor. Pulse until the mixture is fairly smooth, stopping every so often to scrape down the sides with a spatula. You want to retain some texture but the paste should be able to hold together. ", "Divide the mixture into 18 equal pieces and shape into patties. Place on the prepared baking tray and spray the patties with 10 sprays of oil. Cook on the top shelf of the oven for 20–25 minutes, or until golden-brown. ", "For the tzatziki, put the yoghurt into a small bowl. Squeeze the grated cucumber to remove excess liquid, then add to the yoghurt with the garlic, mint, salt and sweetener. Mix well. ", "Lower the oven setting to 200C/180C Fan/Gas 6 and move the tray of falafel to the bottom shelf of the oven. Bake for a further 20–25 minutes, or until cooked through. Sprinkle with a little salt and serve with the tzatziki."]}, {"isVegetarian": true, "title": "Baked ginger parkin with rhubarb", "url": "www_bbc_co_uk_food_recipes_baked_ginger_parkin_with_37593", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz soft light brown sugar", "150g/5½oz softened butter, plus extra for greasing", "250g/9oz golden syrup", "75g/2½oz black treacle", "125g/4½oz oat flakes", "175g/6oz self-raising flour", "3 tbsp ground ginger", "1 tsp ground nutmeg", "1 tsp mixed spice", "pinch of salt", "2 free-range eggs, beaten", "25ml/1fl oz milk", "vanilla ice cream, to serve", "50g/1¾oz butter", "75g/2½oz caster sugar", "1 orange, zest only", "4 sticks rhubarb, cut into 5cm/2in lengths", "200g/7oz golden syrup", "100ml/3½fl oz dry cider", "½ tsp ground mixed spice", "½ tsp ground ginger", "¼ tsp ground nutmeg "], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1 and butter a 30cm/12in x 20cm/8in cake tin.", "For the parkin, put the soft brown sugar, butter, syrup and treacle into a small saucepan and melt over a gentle heat.", "Put the oats, flour, ginger, nutmeg, mixed spice and a pinch of salt into a large bowl, then add the eggs and milk. Pour the melted butter and sugar mixture into the bowl and mix together with a whisk until combined.", "Pour into the prepared tin and bake for 1¼ hours, or until firm in the centre. ", "Remove from the oven and leave in the tin to cool before turning out and cutting into squares. This is best kept kept in a tin for 2-3 days as it will become really sticky all the way through.", "For the rhubarb, put the butter, sugar and five tablespoons of water in a large frying pan with the orange zest and rhubarb. Place over a gentle heat to poach for 4-5 minutes, or until just tender, then remove from the heat.", "For the syrup, combine the golden syrup, cider and spices in a saucepan and bring to the boil. Reduce the heat and cook for 3-4 minutes, or until just thickened. ", "Serve the parkin in squares with a spoonful of rhubarb to one side and the syrup over the top. Finish with a scoop of ice cream. "]}, {"isVegetarian": true, "title": "Baked ginger parkin with perry poached pear", "url": "www_bbc_co_uk_food_recipes_baked_ginger_parkin_with_52330", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour", "pinch salt", "2 tbsp ground ginger", "½ tsp ground nutmeg", "½ tsp mixed spice", "75g/3oz oat flakes", "175g/6oz golden syrup", "50g/2oz black treacle", "110g/4oz unsalted butter, plus extra for greasing", "110g/4oz soft brown sugar", "1 free-range egg, beaten", "2 tsp whole milk", "4 firm pears, peeled, cored and halved", "500ml/18fl oz perry", "150g/5oz caster sugar", "2 cinnamon sticks", "freshly grated nutmeg", "1 lemon, peel only", "vanilla ice cream"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the parkin, preheat the oven to 140C/275F/Gas 1 and butter a 20cm/8in square cake tin. ", "Sieve the flour, a pinch of salt, the ginger, nutmeg and mixed spice together into a large bowl. Mix in the oat flakes.", "Put the syrup, treacle, butter and sugar into a small saucepan and melt over a gentle heat – bring up to a simmer but do not boil. When the butter and sugar have melted, pour into the flour mixture and stir to combine.", "Mix in the beaten egg and milk to create a soft, almost pouring consistency batter. ", "Pour into the buttered tin and bake for 50 minutes, or until firm in the centre. ", "Remove from the oven and leave to cool in the tin for 5-10 minutes before turning out and cutting into squares.", "For the poached pear, place all the ingredients into a small saucepan so that the pears are all submerged in the liquid.", "Top with a piece of greaseproof paper cut into a circle to help keep the pears submerged.", "Bring to the boil, then reduce the heat to a simmer and cook for 15 minutes until just tender – check with the tip of a knife to see if tender, if not, return to the heat and cook for another five minutes then check again.", "Remove the pears and set aside. Return the pan to the heat, bring to a boil and reduce the poaching liquor by half, or until it reaches a light syrup.", "To serve, place a square of parkin on each plate with a pear alongside, then spoon over the syrup. Finish with a scoop of ice cream. "]}, {"isVegetarian": false, "title": "Baked hake with green sauce and fennel salad", "url": "www_bbc_co_uk_food_recipes_baked_hake_fennel_apple_56445", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["165g/6oz unsalted butter", "265g/9oz panko or sourdough breadcrumbs ", "2 tsp sea salt", "glug of olive oil", "4 x 150g/5½oz–200g/7oz hake fillet, skin-on, pin-boned", "1 bunch flatleaf parsley", "½ bunch fresh tarragon", "4–6 anchovy fillets", "1 tbsp small capers", "2 cloves garlic, roughly chopped", "1 tsp Dijon mustard", "1 unwaxed lemon, finely grated zest only", "2 tbsp red wine vinegar", "4–6 tbsp olive oil", "1 garlic clove, crushed", "1 orange, finely grated zest and juice", "2 tbsp white wine vinegar", "1 tsp Dijon mustard", "2 tbsp olive oil", "2 fennel bulbs, thinly sliced on a mandolin", "2 green apples, cored, sliced and cut into matchsticks", "1 tbsp finely chopped fresh dill"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Melt the butter in an ovenproof frying pan over a medium–high heat until it starts to turn brown. Add the breadcrumbs and salt and cook until golden brown. Tip the mixture onto a plate and leave to cool. Wipe out the pan. ", "Heat the oil in the frying pan over a medium–high heat. Add the hake and cook for 2–3 minutes. Turn the fish over and top with the breadcrumb mixture. Transfer to the oven and bake for 4 minutes, or until cooked through. ", "Meanwhile, for the green sauce, blend together the parsley, tarragon, anchovies, capers and garlic in a food processor. Add the mustard, lemon zest and vinegar, then with the engine running pour in the oil until you have a smooth sauce. ", "For the salad, make a vinaigrette by mixing together the garlic, orange zest and juice, vinegar, mustard and oil in a small bowl. Put the fennel, apple and dill in large bowl and toss with the vinaigrette.", "Serve the fish with the green sauce and the salad alongside."]}, {"isVegetarian": false, "title": "Baked meatballs with hidden veggies", "url": "www_bbc_co_uk_food_recipes_baked_meatballs_with_17989", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_meatballs_with_17989_16x9.jpg", "ingredients": ["2 tbsp sunflower oil", "1 onion, roughly chopped", "1 sweet potato, peeled, cut into chunks", "2 garlic cloves, crushed", "1 x 400g tin chopped tomatoes ", "2 tbsp tomato purée", "1 tsp dried oregano", "1 bay leaf", "salt and freshly ground black pepper", "1 slice bread, crust removed, torn into small pieces", "4 tbsp milk", "1 small onion, finely grated", "1 carrot, peeled, finely grated", "1 courgette, trimmed, finely grated", "500g/1lb 2oz lean beef mince", "1 large free-range egg yolk", "100g/3½oz grated mozzarella or cheddar", "freshly ground black pepper"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat the oil in a large, heavy-based saucepan, add the onion and sweet potato and fry gently for 4-5 minutes, stirring regularly, until the onion has softened and is beginning to brown. Add the garlic and fry for 1-2 minutes, stirring regularly.", "Add the remaining sauce ingredients and 500ml/17fl oz water and stir well to combine. Season with salt and pepper. Bring to the boil, then simmer for 18-20 minutes, stirring regularly, until the vegetables are very soft.", "Meanwhile, put the bread in a large bowl. Pour over the milk and set aside for a few minutes until the milk has soaked into the bread.", "Add the onion and carrot. Squeeze any excess moisture from the courgette and add along with the mince and egg yolk. Mix all of the ingredients until thoroughly combined. Season well with pepper, then mix again. ", "Roll into 24 small balls, arranging them in the bottom of a shallow, 2 litre/3½ pint ovenproof dish. Bake for 18-20 minutes, or until lightly browned.  Drain off any liquid that has collected in the bottom of the dish. ", "When the sauce is ready, remove the bay leaf. Using a hand-held blender, blitz the sauce until smooth. ", "Pour over the meatballs and sprinkle with the mozzarella. Return to the oven and cook for a 20-25 minutes, or until the cheese has melted and browned and the sauce is bubbling. Serve immediately with cooked pasta, rice or even mashed potatoes."]}, {"isVegetarian": false, "title": "Lighter baked mushrooms", "url": "www_bbc_co_uk_food_recipes_baked_mushrooms_55154", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_mushrooms_55154_16x9.jpg", "ingredients": ["1 tsp olive oil", "2 large, flat Portobello mushrooms (150g/5½oz total weight), wiped clean, stalks finely chopped", "1 spring onion, thinly sliced", "1 stick celery, thinly sliced", "1 bacon medallion (30g/1oz), roughly chopped", "20g/¾oz fresh breadcrumbs", "30g/1oz baby spinach ", "1 tomato, halved", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Heat the oil in a small frying pan over a medium heat. Add the mushroom stalks, spring onion, celery and bacon and cook for 1–2 minutes, or until softened. Stir in the breadcrumbs and spinach and season. ", "Place the mushrooms cup-side up on a baking tray. Season the tomato and place on the baking tray.", "Spoon the filling into the mushrooms and bake for 10–15 minutes, or until they have softened. Serve the mushrooms with the tomato. "]}, {"isVegetarian": false, "title": "Baked pappardelle with pancetta and porcini", "url": "www_bbc_co_uk_food_recipes_baked_pappardelle_with_21046", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_pappardelle_with_21046_16x9.jpg", "ingredients": ["500ml/18fl oz milk", "20g/¾oz dried porcini mushrooms", "40g/1½oz butter", "25g/1oz plain flour", "salt and freshly ground black pepper", "100g/4oz pappardelle", "50g/2oz pancetta, cut into 2cm/1in pieces", "4-5 tbsp freshly grated parmesan"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "Warm the milk in a saucepan, add the porcini mushrooms, remove from the heat and soak for 10 minutes. Strain through a sieve suspended over a bowl, pressing lightly on the mushrooms with the back of ladle to extract all the milk. ", "Heat the butter in a clean saucepan, add the flour and stir over a low heat for 2-3 minutes without colouring the roux. ", "Pour in the porcini-flavoured milk all in one go and whisk together vigorously until smooth. Cook the sauce for a further 10 minutes, or until the sauce has thickened. Season lightly with salt and freshly ground black pepper and set aside.", "Bring a large pan of salted water to a rolling boil. Add the pasta and cook until al dente. Drain in a colander, tip into a roomy bowl and carefully stir in the sauce, porcini and pancetta until well combined. ", "Place the pasta into a lightly buttered oven-proof dish. Smooth the surface and cover with two tablespoons of the parmesan. Bake in the oven for 30-40 minutes, or until bubbling around the edges and golden-brown. ", "Serve the dish piping hot at the dinner table and have extra cheese at the ready. "]}, {"isVegetarian": true, "title": "Baked plum tart", "url": "www_bbc_co_uk_food_recipes_baked_plum_tart_71302", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz butter, cut into pieces, plus extra for greasing", "300g/10½oz self-raising flour, sifted", "50g/1¾oz caster sugar", "1 orange, zest and 2 tsp juice", "150ml/¼ pint of milk", "700g/1lb 9oz plums, stoned and halved", "50g/1¾oz butter", "50g/1¾oz demerara sugar", "2 tsp ground cinnamon"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "Lightly grease a 23x33cm/9x13in Swiss roll tin. In a bowl rub the butter into the flour using your fingertips. Stir in the caster sugar and orange zest. Pour in the milk and mix using a flat knife blade until it is fully combined with the dry ingredients (add a little more milk if required). ", "Tip the mixture into the prepared tin and smooth the surface. ", "For the topping, place the plums on top, cut side up, and put a small dot of butter on top of each plum. ", "In a bowl, mix the demerara sugar and cinnamon.  Sprinkle over the plums and finish with a drizzle of orange juice.", "Bake for approximately 20 minutes, or until the base is golden and plums are bubbling and juicy."]}, {"isVegetarian": true, "title": "Baked peaches with amaretti crumble and cream", "url": "www_bbc_co_uk_food_recipes_baked_peaches_with_06758", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz whole hazelnuts", "40g/½oz oat biscuits ", "40g/½oz amaretti biscuits", "50g/1¾oz unsalted butter, room temperature", "25g/1oz caster sugar", "1 free-range egg yolk", "½ lemon, juice only", "4 ripe peaches or nectarines", "1 tsp lemon zest", "4 tbsp thick cream ", "4 sprigs fresh mint (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the filling, dry fry the hazelnuts in a pan over a medium heat until golden-brown (take care not to leave them on the heat for too long). Chop the hazelnuts finely.", "Crush both types of biscuit roughly using a rolling pin or the bottom of a clean small pan.", "Mix the hazelnuts, biscuits, butter, sugar, and egg yolk in a bowl until the ingredients hold together as a rough paste.  ", "For the baked peaches, put the lemon juice in a shallow dish. Slice the peaches in half, remove the stones and put the cut half in the lemon juice to avoid discolouration.  ", "Pack a round spoonful of the filling onto each half. This should fill the cavity and cover most of the exposed half.  Place the halves in an ovenproof dish, and bake for 15-20 minutes, depending on the ripeness of the peaches.", "To serve, place the baked peaches on to serving plates, and scoop a dollop of the thick cream beside it. Garnish with mint if desired."]}, {"isVegetarian": true, "title": "Kids' baked potato gnocchi with pesto", "url": "www_bbc_co_uk_food_recipes_baked_potato_gnocchi_10745", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_potato_gnocchi_10745_16x9.jpg", "ingredients": ["30g/1oz fresh basil", "½ clove garlic, crushed", "1 tbsp toasted pine nuts or walnuts (optional)", "2 tbsp grated parmesan", "1-2 tbsp extra-virgin olive oil", "freshly ground black pepper ", "3-5 large baked potatoes (can be leftovers), halved and potato scooped out (you will need about 400g/14oz cooked potato)", "1 free-range egg", "150g/5½oz plain flour (or gluten-free flour mix)", "2 tbsp finely grated cheese, such as parmesan or cheddar", "pinch nutmeg (optional)", "up to 200g/7oz cooked squash or carrots, mashed, can be substituted for some of the potato to make orange gnocchi", "50g/1¾oz chopped cooked spinach, drained (squeeze as much water out as possible in a sieve) to make green gnocchi", "1 tbsp chopped fresh herbs such as basil, chives or parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Kids job: For the pesto, wash the basil leaves under the tap and dry them on a tea towel or in a salad spinner. ", "Kid’s job: Add the basil leaves to a food processor with the crushed garlic, toasted pine nuts, grated parmesan and olive oil. Add a twist of black pepper and then blend to a paste. You may need a little more olive oil to make it smooth. (Adults should supervise this.) Spoon into a jar and store in the fridge until needed.", "Adult’s job: Preheat the oven to 200C/400F/Gas 6. Prick the baking potatoes all over with a fork and place in the oven to bake for 1-1½ hours. (Oven timers are great if you’re at work – put the potatoes in the cold oven in the morning and set it to come on 90 minutes before you get home.) If you are using leftover baked potatoes, they will need to be warmed up again or the gnocchi will taste doughy - put them into a warm oven for 10 minutes or microwave on high for 30 seconds.", "Kid’s job: If you are using freshly baked potatoes allow them to cool enough to be handled safely and then slice them in half and kids can scoop out the flesh into a large bowl. Add any cooked squash or carrot if you are making the orange option. ", "Kid’s job: Mash the cooked potato with a masher or a large fork, until it is smooth.", "Kid’s job: Knock the egg gently on the work surface to crack it – cracking on a flat surface will create less little bits of shell. Pull the egg open over a small bowl. Pull out any bits of shell that have fallen into the bowl. (Wash your hands after handling eggs.)", "Kid’s job: Add the egg, flour, grated cheese, black pepper and nutmeg (and the spinach or herbs if you are making the green version) to the bowl and mix together with your hands until you have a smooth dough. If the dough is sticky you can add more flour – it should feel like play dough.", "Kid’s job: Divide the dough into four balls. On a lightly floured surface or table roll the potato dough into a long sausage and then, using a table knife cut it into 15 x 2cm/1in pieces.", "Kid’s job: Press each gnocchi with a fork to make a ridged pattern (this helps them cook and also helps sauce stick to them). Repeat with the rest of the dough.", "Adult’s job: Bring a large pan of water to the boil with a pinch of salt. Place 10 gnocchi at a time carefully into the water and boil for about 30 seconds - the gnocchi will rise to the surface of the water when they are cooked. ", "Adult’s job: Remove the gnocchi from the water with a slotted spoon into a warmed bowl and stir in a teaspoonful of the pesto. Add another batch of gnocchi to the pan of water and repeat until all of the gnocchi are cooked. Serve immediately with a green salad."]}, {"isVegetarian": true, "title": "Baked potato gnocchi, cavolo nero and pumpkin", "url": "www_bbc_co_uk_food_recipes_baked_potato_gnocchi_38563", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.25kg/2lb 12oz baking potatoes (such as Catriona or Spunta)", "2 tbsp olive oil, plus extra for frying", "2 leaves cavolo nero, stalks removed, cut into 10cm/4in pieces", "400g/14oz pumkpin (such as Delica), peeled, seeds removed, cut into 1cm/½in dice  ", "1 free-range egg, beaten", "100-150g/3½-5½oz plain flour", "530ml/18fl oz double cream ", "75g/2½oz butter", "small bunch fresh chives, finely chopped", "1 lemon, juice only", "salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Bake the potatoes for 45–50 minutes, or until soft.", "Meanwhile, heat a tablespoon of oil in a frying pan over a medium-low heat. Fry the cavolo nero until crisp. Season with a little salt and drain on kitchen paper.", "Heat another tablespoon of oil in the same pan and fry the pumpkin gently until just soft and golden brown. Season with a little salt and drain on kitchen paper.", "Scoop out the potato flesh and pass through a mouli. Place the skins back on the baking sheet and bake for a further 12 minutes, or until golden brown. ", "Meanwhile, place a double layer of cling film over your work surface. Put the potato flesh into the centre, sprinkle over some salt and knead briefly. Add a little of the egg and the flour. Gather the cling film over the dough and knead very lightly. Roll it into a sausage shape and chill. Remove the cling film and cut out 2.5cm/1in pieces. ", "Meanwhile, transfer the potato skins to a medium pan and cover with 500ml cream. Bring to the boil and simmer gently. As the skins soften, press them with back of a spoon until the flavour is extracted from them. Reduce the cream by a third and pass through a sieve into a bowl. Stir in the remaining 30ml/1fl oz cream and season well with salt and a little lemon juice to taste. Transfer the cream to a foam gun, shake well and add two pellets. ", "To serve, warm the pumpkin and shallow-fry the gnocchi in butter on both sides for a few minutes, until piping hot. ", "Place the gnocchi on serving plates and scatter over half of the pumpkin cubes. Gently pipe over the foam in small amounts and scatter with the remaining pumpkin cubes, the cavolo nero and chives. Serve immediately. "]}, {"isVegetarian": false, "title": "Baked potato with bacon, taleggio and leek", "url": "www_bbc_co_uk_food_recipes_baked_potato_skins_with_28036", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_potato_skins_with_28036_16x9.jpg", "ingredients": ["4 large baking potatoes", "1 tbsp olive oil", "sea salt", "25g/1oz butter", "1 shallot, finely chopped", "1 garlic clove, finely sliced", "2 leeks, sliced lengthways then across into slices", "75ml/2½fl oz white wine", "300ml/10½fl oz double cream", "150g/5½oz taleggio cheese, roughly chopped", "8 slices streaky bacon", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Rub the potatoes with the olive oil, prick all over with a fork and place onto a little pile of sea salt on a baking tray.", "Place the potatoes on the top shelf of the oven and bake until tender and the skin is crisp, about an hour.", "Remove from the oven and set aside until cool enough to handle. ", "Meanwhile, heat a frying pan until medium hot. Add the butter, shallot and garlic and cook for 2-3 minutes, then add the leeks and cook for another two minutes.", "Add the white wine and cook until the volume of liquid has reduced by half. Add the cream and cook for 3-4 minutes, or until thickened. Season, to taste, with salt and black pepper.", "When the potatoes are cool enough, cut them into quarters and place into an ovenproof dish. Pour the leek sauce over the top then add the taleggio pieces.", "Heat a frying pan until hot, add the bacon and cook until golden-brown and crisp. ", "Roughly chop the bacon and scatter it over the top of the cheese.", "Place in the oven and bake for 10 minutes, or until golden-brown and bubbling."]}, {"isVegetarian": true, "title": "Baked raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_baked_raspberry_49297", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb digestive biscuits", "5 tbsp unsalted butter, melted ", "2 tbsp sugar ", "pinch salt ", "900g/2lb cream cheese, at room temperature ", "160ml/5⅓fl oz soured cream  ", "160ml/5⅓fl oz double cream ", "270g/9½oz sugar ", "4 large free-range eggs ", "1 vanilla pod, sliced lengthways and seeds scraped out", "½ jar good-quality raspberry jam ", "340g/12oz fresh raspberries "], "serves": "Serves 16", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4, with a shelf placed in the lower third of the oven.", "Place a large square of aluminium foil on a flat surface. Place the springform tin in the middle of the foil. Gently fold up the foil around the sides of the tin. Take care to do this gently so that you don't create any holes in the foil (the idea is to create a waterproof skin around the tin). Press the foil around the edges of the tin. Place a second large square of foil underneath the tin, and repeat. Gently crimp the top of the foil sheets around the top edge of the pan.  Make sure no water can get in as this would ruin the crust.", "In a food processor, pulse the biscuits and melted butter until finely ground and combined.", "Put all but three tablespoons of the crumbs in the bottom of the springform tin. Gently press down the crumbs using your fingers, until you have an even layer at the bottom of the pan, with just a slight rise along the inside edges of the tin. Use the reserved crumbs to fill in any holes or uneven patches.", "Bake for 10 minutes. Remove from the oven and set aside to cool for approximately 10 minutes. ", "Reduce the oven temperature to 160C/320F/Gas 3.", "To make the filling, add the cream cheese to the bowl of a freestanding mixer.  Add the soured cream, double cream, sugar and eggs.  Mix on a medium speed for 5-6 minutes until smooth, soft and creamy. Mix in the vanilla pod seeds. (Remember to scrape down the sides of the mixer bowl, and scrape up any thicker bits of cream cheese that have stuck to the bottom of the mixer that the paddle attachment has failed to incorporate.)", "For the topping, in a saucepan gently heat the raspberry jam with 120ml/4fl oz water. Stir to form a smooth liquid. Strain the liquid through a fine sieve to remove any seeds. Set aside.", "To cook the cheesecake, place the foil-wrapped springform tin in a large, high-sided roasting tin. Fill a kettle with water and set it to boil.", "Pour the cream cheese filling into the springform tin over the biscuit base. Smooth the top with a spatula or the back of a spoon. ", "Place the roasting tin - with the springform tin sat in it - in the oven, on a low shelf. ", "Carefully pour the boiling water into the roasting tin (take care not to burn yourself on the hot oven), until the water reaches halfway up the side of the springform tin. (Alternatively, you can add the water before putting the tin in the oven - whichever is easier for you.) ", "Bake for 1½ hours, or until just set.", "Turn off the oven and open the door slightly. Leave the cheesecake in the oven to cool very slowly for an hour (this gentle cooling will help prevent the cheesecake surface from cracking).", "Cover the top of the springform tin with foil, so that it doesn't actually touch the cheesecake. Chill in the fridge for a minimum of four hours, or overnight.", "Take the cake from the fridge and remove the foil from around the tin. To remove the cheesecake from the tin, carefully run a pallet knife around the edge of the cheesecake. Open the springform latch, ease open the tin and carefully lift it away. You can serve the cheesecake on the base of the tin, but, if you wish to remove it, carefully slide a pallet knife under the cheesecake to loosen it from the tin, then slightly lift one edge of the cheesecake and slide it onto a serving plate. ", "To serve, decorate the top of the cheesecake with fresh raspberries covered in the topping."]}, {"isVegetarian": true, "title": "Baked reblochon cheese with deep-fried blue cheese beignets and seasonal vegetables", "url": "www_bbc_co_uk_food_recipes_baked_reblochon_cheese_12280", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 whole reblochon cheese (in the box)", "2 tbsp olive oil", "50g/1¾oz unsalted butter", "¼ brioche loaf, crumbed ", "2 sprigs fresh thyme, leaves removed", "50g/1¾oz butter", "75g/2½oz plain flour", "2 medium free-range eggs", "75g/2½oz Stilton cheese", "salt and freshly ground black pepper", "½ cauliflower, cut into florets", "1 bunch baby carrots", "150g/5½oz French beans, trimmed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked reblechon cheese, preheat the oven to 180C/350F/Gas 4.", "Leave the cheese in the boxes and score around the top about 5mm/¼in in and cut off the top layer of skin.", "Drizzle the oil over the cheeses and place in the oven for 15-20 minutes, or until oozy in the middle.", "In the meantime, heat a large frying pan and, once hot, add the butter. Add the breadcrumbs and thyme to the pan and cook until golden-brown and toasted. Top the cheese with the breadcrumbs.", "For the deep-fried blue cheese beignets and seasonal vegetables, preheat a deep-fat fryer to 190C/375F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place 125ml/4fl oz water and the butter into a saucepan and bring to a rolling boil for a minute.", "Remove the pan from the heat and add the flour, beating well until the mixture is smooth and comes away from the sides of the pan.", "Return to the heat for a minute or two to cook the flour out.", "Remove from the heat again and add the eggs, one at a time, beating well between the addition of each egg.", "Add the crumbled Stilton and mix well. Season with salt and freshly ground black pepper. ", "Drop teaspoonfuls of the batter into the deep-fat fryer and fry for 2-3 minutes, or until golden-brown and crisp (you may need to do this in batches).", "Remove the beignets from the oil with a slotted spoon and set aside to drain on a plate lined with kitchen paper. Season with a little salt.", "Meanwhile heat a large saucepan of boiling water and cook the vegetables to your liking. Drain.", "To serve, place the baked cheeses on a large serving plate and place the beignets and vegetables alongside."]}, {"isVegetarian": true, "title": "Baked cheesecake with blackberries, blueberries and  figs", "url": "www_bbc_co_uk_food_recipes_baked_ricotta_and_cream_48552", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_ricotta_and_cream_48552_16x9.jpg", "ingredients": ["50g/1¾oz unsalted butter, melted", "200g/7oz gingernut biscuits (about 20 biscuits)", "450g/1lb full-fat cream cheese ", "250g/9oz ricotta", "150g/5½oz double cream ", "3 medium free-range eggs", "125g/4½oz caster sugar", "2½ tbsp cornflour ", "1 vanilla pod, seeds scraped out", "125g/4½oz fresh blueberries ", "125g/4½oz fresh blackberries ", "2 figs, each cut into 6 evenly-sized wedges", "2 tsp icing sugar, sifted", "handful fresh mint leaves (optional)"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3 (150C fan).", "To make the base, melt the butter in a medium saucepan over a low heat (or a bowl in the microwave). Line the base of a 23cm/9in springform cake tin with baking parchment, brushing a little of the melted butter on the base to help the paper stick. Break up the gingernut biscuits in a food processor to give fine crumbs. Mix well into the melted butter and then tip into the bottom of the prepared tin. Press the mixture well into the bottom so it is packed  tight and level. Place in the fridge to set for 20 minutes or so while you get on with the filling. ", "For the filling, put the cream cheese, ricotta, cream, eggs, sugar, cornflour and vanilla seeds into a large bowl and beat like mad for a few minutes until everything is combined and smooth. An electric mixer fitted with the whisk attachment will make this easier than by hand. Once the biscuit base is set, remove the tin from the fridge and pour this mixture in on top. ", "Sit on a baking tray and pop into the oven for 40-45 minutes. The cheesecake should be just set with a little wobble. When it reaches this stage, turn off the oven and leave to cool in there for about an hour. This (usually) stops the cheesecake from cracking. Also avoid moving the cheesecake around at this stage to help prevent cracking. However, don’t worry if it does crack as it will still taste delicious and will be nicely decorated.", "Once it has had an hour of cooling, remove the cheesecake from the oven. The cheesecake may still be a little bit warm, so you can either eat it like this or wait and eat it when it is completely cool. Arrange the berries and figs on top, dust with icing sugar and scatter over the mint leaves if using, and serve. The cheesecake will keep for a couple of days, covered in the fridge."]}]