[{"ingredients": ["2 cucharadas de aceite de oliva", "10 lonchas de tocino ahumado ahumado, tostadas", "5 cebollas rojas, más o menos picadas", "15 tomates medianos", "2 cucharaditas de pimentón ahumado", "Anís de 3 estrellas", "sal y pimienta negra recién molida", "1 x 400 g / 14 oz puede pintar frijoles"], "method": ["Caliente el aceite de oliva en una sartén grande. Freír el tocino y las cebollas en la sartén a fuego moderado hasta que estén coloreados.", "Cortar los tomates y agregarlos a la sartén cuando el tocino esté crujiente y la cebolla esté transparente.", "Agregue el pimentón ahumado y el anís estrellado, y sazone bien con sal y pimienta negra recién molida.", "Vierta 1 litro / 1¾ pintas de agua y cocine a fuego moderado con la tapa puesta durante 30 minutos. Revuelve cada 10 minutos.", "Cuando hayan transcurrido 30 minutos, incline los frijoles pintos escurridos y cocine por otros cinco minutos.", "Si tiene la intención de congelar la sopa, deje que se enfríe a temperatura ambiente y luego llene seis bolsas de congelador. Congelar por hasta un mes.", "Cuando desee cocinar la sopa, descongele bien y, cuando vuelva a calentar, asegúrese de que la sopa hierva vigorosamente."], "url": "www_bbc_co_uk_food_recipes_hearty_tomato_soup_55968", "title": "Sopa de tomate abundante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas", "20g / 1oz de mantequilla", "ramita de romero", "pizca de sal", "2 cucharaditas de bayas de enebro", "1 zanahoria", "1 pastinaca", "½ colina", "4 cucharadas de vino Marsala", "2 cucharadas de harina normal", "150g / 5½oz de castañas enlatadas", "2 hojas de laurel", "400ml / 14fl oz de caldo de verduras", "pimienta negra recién molida", "4 hongos castaños", "puñado de setas porcini secas", "1 cucharada de mostaza integral", "1 cucharada de jalea de grosella", "1 granada, solo semillas, médula blanca eliminada"], "method": ["Pica bien las cebollas y lentamente ablanda en una cazuela con un poco de mantequilla. Mientras tanto, tome una ramita de romero en un mortero con una pizca de sal y bayas de enebro. Déles un buen golpe y luego agregue a las cebollas.", "Ahora corta la zanahoria, el colinabo y la chirivía en trozos abundantes, van a ser el cuerpo del guiso y agrega a la cebolla.", "Para preparar la salsa, agregue algunos glugs de los vinos de Navidad que tenga a mano, aquí particularmente me gusta Marsala. Agregue una cucharada de harina y revuelva para que se cocine y espese la salsa. Agregue las castañas, laurel y caldo, sazone con pimienta negra recién molida y luego deje hervir a fuego lento durante 15 minutos.", "Cuarta las setas castañas; luego agrégalos a la olla junto con un puñado de porcini seco. Esto le dará al guiso una profundidad leñosa. Ahora, para los toques finales a la salsa, agregue una cucharada de mostaza integral y jalea de grosella, y déjela hervir a fuego lento durante otros 20 minutos.", "Finalmente sirva con una dispersión de semillas de granada sobre cada ayuda."], "url": "www_bbc_co_uk_food_recipes_hearty_party_hotpot_93924", "title": "Estofado de fiesta abundante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hearty_party_hotpot_93924_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aerosol de aceite de cocina controlado en calorías", "1 cebolla mediana, en rodajas", "2 dientes de ajo, en rodajas finas", "2 ramas de apio, cortadas y en rodajas finas", "2 zanahorias medianas o 2 pimientos amarillos, cortados en trozos de 2cm / 1in", "400g / 14oz de tomates picados en lata", "1 cubo de caldo de verduras", "1 cucharadita de hierbas mezcladas secas", "Frijoles de mantequilla de hojalata de 400g / 14oz, escurridos y enjuagados", "1 cabeza de hojas jóvenes de primavera (aproximadamente 125 g / 4½ oz), cortadas y cortadas", "sal marina y pimienta negra recién molida"], "method": ["Rocíe una olla grande antiadherente con aceite y cocine la cebolla, el ajo, el apio y las zanahorias o los pimientos suavemente durante 10 minutos, revolviendo regularmente hasta que se ablanden.", "Agregue 750ml / 26fl oz de agua y los tomates picados. Mezcle sobre el cubo de caldo y agregue las hierbas secas. Llevar a ebullición, luego reduzca el fuego a fuego lento y cocine durante 20 minutos.", "Sazone la sopa con sal y pimienta y agregue los verdes de primavera y las habas de mantequilla. Regrese a fuego lento y cocine durante 3-4 minutos o hasta que los vegetales se ablanden. Sazone al gusto y sirva en recipientes profundos."], "url": "www_bbc_co_uk_food_recipes_hearty_vegetable_soup_14365", "title": "Sopa de verduras abundante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hearty_vegetable_soup_14365_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["750g / 1lb 10oz de coles de Bruselas, cortadas y partidas por la mitad", "Pata para hornear de 250 g / 9 oz, pelada y cortada en dados de 2-3 cm", "Tortiglioni o penne 500w / 1lb 2oz de trigo integral", "sal", "100g / 3½ oz de ricotta", "250g / 9oz Gruyère, en cubos", "50g / 2oz de mantequilla sin sal ablandada", "1 cucharada de aceite de ajo", "4 hojas de salvia, trituradas", "50g / 2 oz de queso parmesano (o similar queso duro vegetariano), rallado"], "method": ["Precaliente el horno a 200C / 400f / Gas 6, y llene una olla grande con agua para cocinar los brotes, la papa y la pasta.", "Cuando hierva el agua, sal, generosamente, eche los brotes preparados, los dados de patata y la pasta y deje que el agua vuelva a hervir, luego cocine por unos 8-10 minutos, o hasta que la papa esté tierna y la pasta al dente. Justo antes de drenar, retire dos tazas del líquido de cocción y póngalo a un lado.", "Incline la pasta, los brotes y el spud escurridos en una lata para asar (o un plato de lasaña), luego agregue la ricota y el Gruyère cortado en cubitos y una taza de agua para cocinar, y mezcle bien para combinar. Agregue más líquido si siente que la pasta está demasiado seca.", "Caliente la mantequilla y el aceite de ajo en una cacerola pequeña y, cuando se derrita y comience a chisporrotear suavemente, agregue la salvia y freír durante unos 30 segundos antes de cucharear o gotear la mantequilla y las hojas de salvia sobre el horneado de pasta. Espolvorear con el parmesano y hornear en el horno durante 20 minutos, momento en el cual la superficie se chamuscará de un color dorado claro. Me gusta más si se deja reposar por lo menos 15 minutos antes de comer."], "url": "www_bbc_co_uk_food_recipes_hearty_wholewheat_pasta_66804", "title": "Pasta abundante de trigo integral con coles de Bruselas, queso y patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hearty_wholewheat_pasta_66804_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "2 chalotes de plátano mediano, finamente cortados en cubitos", "2 dientes de ajo, finamente picados", "2 tallos de apio, finamente picados", "1 hoja de laurel", "Pastillas de 50ml / 2fl oz", "1 cucharada de harina normal", "150ml / 5fl de leche en oz", "Mejillones de 1kg / 2lb 4 oz, sin barba y limpios", "300ml / 10fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "pan crujiente, para servir"], "method": ["Derrita la mantequilla en una cacerola pequeña a fuego lento y cocine suavemente los chalotes, el ajo, el apio y la hoja de laurel hasta que estén suaves pero no dorados. Agregue los pastis y continúe cocinando hasta que el líquido se haya evaporado.", "Agregue la harina y cocine suavemente por un minuto más o menos y luego lentamente agregue la leche de a poco, revolviendo continuamente, para hacer una salsa suave y espesa.", "Mientras tanto, incline los mejillones y el vino en una sartén por separado, cubra con una tapa y cocine al vapor los mejillones durante 3-4 minutos hasta que los caparazones se acaban de abrir.", "Coloque un colador sobre la sartén que contiene la salsa blanca y vierta el licor de mejillón en la salsa. Regrese los mejillones a su sartén y cubra con una tapa para mantener el calor.", "Trabajando rápidamente, mezcle el licor de mejillón en la salsa, hágalo hervir y continúe hirviendo hasta que tenga la consistencia de crema doble. Agregue la crema, vierta la salsa en la olla de mejillones y sirva inmediatamente con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_hearty_winter_mussels_45629", "title": "Calurosos mejillones de invierno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800g / 1lb 12oz de pan crujiente", "400g / 14oz de mantequilla fría, cortada en cubitos", "200 g / 7 oz de perejil flatleaf, finamente picado", "100 g / 3½ oz de cebollín, cortados", "5 limones, solo ralladura", "sal marina y pimienta recién molida", "Filetes de maruca sin piel de 6 kg / 13 lb u otros pescados blancos", "5 cucharadas de aceite de girasol"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Rompa el pan en trozos, colóquelo en un procesador de alimentos y pulse para hacer migas de pan gruesas.", "Agregue la mantequilla, el perejil, el cebollino y la ralladura de limón y luego vuelva a pulsar hasta que esté bien mezclado. Puede que tenga que hacer esto en lotes. Sazonar la mezcla de pan rallado con sal y pimienta negra recién molida.", "Coloque los filetes de pescado en latas grandes para hornear, esparza sobre la mezcla de migas de pan y hornee durante 8-10 minutos o hasta que el pescado esté bien cocido.", "Sirva el pescado con puré de papas y guisantes."], "url": "www_bbc_co_uk_food_recipes_herb-crusted_fish_78116", "title": "Pez con costra de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["130g / 4½oz de miel de brezo", "100 g / 3½ oz de mantequilla sin sal, suavizada, más extra para engrasar", "100 g / 3½ oz de azúcar en polvo", "3 huevos de gallinas camperas", "Harina de auto crianza 110g / 4oz", "1 cucharadita de polvo de hornear", "natillas o crema, para servir"], "method": ["Unte con mantequilla un recipiente de budín de 1 litro / 1¾ de pinta. Ponga dos cucharadas de miel en el recipiente preparado (si la miel es muy espesa, cállela suavemente primero para que quede más líquida).", "Coloque la miel restante y todos los demás ingredientes en un tazón grande y bata con un batidor eléctrico. Comience lentamente, luego aumente la velocidad y mezcle durante dos minutos hasta que todos los ingredientes estén bien combinados.", "Vierta la mezcla en el recipiente de budín, encima de la miel.", "Coloque un trozo de pergamino para hornear sobre una hoja de papel de aluminio y haga un pliegue grande en el centro, doblando ambas hojas juntas (esto permite la expansión del budín a medida que se cocina). Coloque el pergamino y el papel de aluminio encima del budín, con la lámina hacia arriba, y asegúrelo con una cuerda, colocando el extremo de la cuerda sobre la punta del pastel y atándolo para formar un mango que le permita levantar y sacar el budín. de la sartén.", "Coloque el recipiente en una olla grande y vierta suficiente agua hirviendo para llegar hasta la mitad del costado del recipiente. Coloque una tapa en la sartén y cocine a fuego lento. Baje el fuego para mantener la cocción a fuego lento y deje que el pudín hierva durante 1 ¼ horas, hasta que esté crecido y elástico al tacto. Rellene el agua hirviendo, si es necesario, para evitar que la sartén hierva en seco.", "Retire la lámina y el pergamino y pase la punta de un cuchillo pequeño y afilado alrededor del borde del pudin para ayudar a soltarlo. Ponerlo en un plato caliente y servir caliente con natillas o crema."], "url": "www_bbc_co_uk_food_recipes_heather_honey_sponge_11301", "title": "Esponja de miel Heather", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/heather_honey_sponge_11301_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de semillas de cáñamo", "2 cucharadas de aceite de oliva", "sal"], "method": ["Caliente las semillas de cáñamo en una sartén a fuego medio y tueste durante cinco minutos, lanzándolas con frecuencia para asegurar una cocción pareja.", "Agregue el aceite de oliva, sazone con mucha sal y elimine del fuego.", "Para servir, vierta en un tazón."], "url": "www_bbc_co_uk_food_recipes_hempseedpopcorn_81591", "title": "Semillas de cáñamo tostadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de flores secas de arveja (también conocidas como bunga telang, disponibles en delicatessen del sudeste asiático o especialistas en línea)", "500g / 1lb 2oz de arroz glutinoso", "350ml / 12½fl oz de leche de coco", "1 cucharadita de sal", "2 hojas pandan (disponibles en delicatessen del sudeste asiático)", "3-4 hojas de plátano (opcional)", "7 hojas pandan", "4 huevos de gallinas camperas", "250 g / 9 oz de azúcar en polvo", "pizca de sal", "Leche de coco 400ml / 14fl oz"], "method": ["Para las tortas de arroz con guisante azul, el día antes de servir el plato, ponga a hervir 250 ml / 9 fl oz de agua en una cacerola. Enjuague suavemente las flores de arveja azul con agua corriente fría, agréguelas al agua hirviendo, luego reduzca el fuego a su nivel más bajo y empújelo durante 5 minutos antes de retirar la sartén del fuego.", "Drene el agua de la sartén, luego presione la mayor cantidad posible de líquido de las flores con el dorso de una cuchara de madera, reservándolo todo en la sartén. Deseche las flores y deje el líquido azul a un lado para que se enfríe.", "Divida el arroz glutinoso por igual entre dos cuencos. Cubra un tazón de arroz con agua fría y el otro tazón de arroz con el líquido azul (si no hay suficiente líquido azul para cubrir el arroz, recargue el tazón con agua fría). Cubra los tazones y déjelos a un lado para que se remojen en un lugar fresco durante al menos 4 horas o durante la noche.", "Mientras tanto, para la crema de coco pandan, el pandano se deja en un exprimidor eléctrico, descartando la pulpa. Alternativamente, corte las hojas pandan en cuadrados de 2.5cm / 1in y use un mortero y una maja para aplastarlos hasta que se libere todo el jugo. Agregue un poco de agua, luego cuele la mezcla a través de un tamiz fino, reservando el líquido. (También podría usar una licuadora para extraer el jugo mezclando las hojas pandan con una lata de leche de coco de 400 ml / 14floz, y luego filtrar el líquido y reservar).", "En un tazón grande, bata los huevos con el azúcar hasta que estén pálidos, esponjosos y bien combinados. Agregue la sal y la mezcla filtrada de pandan y coco, luego transfiera a una cacerola pequeña y caliente a fuego lento, revolviendo continuamente hasta que la mezcla de natillas comience a espesarse, esto tomará aproximadamente 20 minutos. (Es posible que desee remover con un pequeño batidor si ve bultos formando, o bien cocine la crema en una caldera doble).", "La crema terminada tendrá una textura ligeramente granulada debido a la leche de coco. No te preocupes por esto; no afectará el sabor. Decantar la crema pastelera en un recipiente hermético y, cuando esté frío, enfriar hasta que se necesite; se mantendrá durante hasta tres días en la nevera.", "Cuando el arroz glutinoso se haya mojado, escurra el agua de ambos recipientes: una porción de arroz ahora será azul y otra blanca.", "Vierta 125ml / 4½fl oz de leche de coco sobre cada tazón de arroz remojado. Agregue la sal a la leche de coco restante y reserve.", "Forre dos pequeños recipientes de un vapor a granel con película adhesiva a prueba de calor. Coloque el arroz blanco en una de las bandejas de vapor e inserte una hoja pandan en el centro del arroz. Repita el proceso con el arroz azul y el otro recipiente de vapor, luego apile los moldes y cocine a vapor sobre agua hirviendo durante 18-20 minutos o hasta que estén tiernos.", "Levante con cuidado las ollas del cocedor y esponje ambas porciones de arroz con un tenedor. Vierta la mitad de la leche de coco salada restante en cada sartén de arroz, revuelva para distribuir uniformemente, luego devuelva las ollas al vaporizador y continúe cocinando por otros 8-10 minutos, o hasta que el arroz esté completamente suave.", "Alinee una lata para pastel de 20 cm / 8 pulgadas con hojas de plátano, si lo desea, o una película adhesiva resistente al calor. Coloque cucharadas alternas de los arroces azul y blanco en la lata para crear un efecto multicolor, luego use la parte posterior de una cuchara para alisar la parte superior de cada cucharada y presione la mezcla de torta de arroz con firmeza y de manera uniforme en la sartén. Dejar de lado para enfriar por completo.", "Para servir, espolvoree la crema pastelera de coco en tazones y sirva rebanadas de las tortas de arroz con arveja azul al lado."], "url": "www_bbc_co_uk_food_recipes_helens_coconut_pandan_32016", "title": "Crema de coco pandan con tortas de arroz azul de guisante", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz huesos de cordero, picados (pregunte a su carnicero por estos)", "2 hojas de laurel", "1 ramita de romero fresco", "1 litro / 1¾ pintas de pollo listo para usar", "1 berenjena grande", "2 cucharadas de aceite de oliva", "1 cucharadita de eneldo fresco picado", "1 cucharadita de hojas de menta fresca picada", "1 cucharada de yogur al estilo griego", "½ limón, ralladura y jugo", "sal y pimienta negra recién molida", "½ cucharadita de vainas de cardamomo", "aceite vegetal, para freír", "1 x 6 huesos de cordero", "2 rebanadas gruesas de pan de masa fermentada", "pequeño manojo de menta fresca", "2 cucharadas de mostaza inglesa, más extra para cepillar", "800 ml / 1 pinta 8fl oz de caldo de cordero reducido (desde arriba)", "1 cucharada de vinagre de vino tinto", "1 cucharada de azúcar moreno oscuro", "pequeño puñado de hojas de menta fresca picada"], "method": ["Para el caldo de cordero marrón, precaliente el horno a 200C / 180C Ventilador / Gas 6. Coloque los huesos de cordero en un molde para asar y tueste en el horno durante 20-30 minutos, o hasta que los huesos se hayan oscurecido y la grasa y la médula desde adentro los huesos se han derretido", "Escurra la grasa de la bandeja de tostado y reserve. Transfiera los huesos a una olla grande. Limpie la bandeja de tostado con un trozo de papel de cocina.", "Coloque la bandeja de asar a fuego medio, agregue un chorrito de agua y deje que hierva, raspando las partes quemadas del fondo de la bandeja con una cuchara de madera. Vierta el líquido en la cacerola que contiene los huesos, luego agregue 500 ml / 18 fl oz de agua, las hojas de laurel, el romero y el caldo de pollo. Llevar la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 2 horas.", "Cuele el caldo a través de un colador fino en un recipiente. Cubra el recipiente y déjelo enfriar, luego déjelo enfriar en la nevera durante la noche. Durante este tiempo, la grasa se elevará a la parte superior del stock y se solidificará.", "Al día siguiente, retire la capa sólida de grasa de la superficie de la reserva refrigerada. Vierta el caldo en una cacerola y lleve a ebullición. Reduzca el fuego hasta que el caldo esté hirviendo a fuego lento, luego cocine a fuego lento hasta que el volumen del líquido se haya reducido en aproximadamente 100 ml / 3½ fl oz y el caldo se haya espesado. Mantener caliente", "Para el puré de berenjena, perfore la berenjena con un cuchillo afilado, luego transfiera a un plato y cubra con una película adhesiva. Microondas a plena potencia durante 8-10 minutos, o hasta que estén desinflados y muy suaves en el medio. Alternativamente, coloque la berenjena perforada en una bandeja para hornear y hornee en el horno a 200 ° C / 180 ° Ventilador / Gas 6 durante 45-60 minutos.", "Deje la berenjena a un lado para que se enfríe, luego córtela a la mitad, saque la carne y aplaste bien. Escurrir la carne de berenjena en un colador por una hora.", "Caliente el aceite en una cacerola a fuego medio, luego agregue la berenjena, el eneldo, la menta, el yogur, la ralladura de limón y el jugo de limón, y revuelva bien hasta que se caliente. Sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para el cordero en costra, freír las vainas de cardamomo a fuego medio durante 30 segundos o hasta que estén fragantes. Dejar de lado en un plato.", "Agregue un poco de aceite a la sartén, luego fríe la parrilla de cordero durante unos segundos en todos los lados hasta que se dore por todas partes. Coloque el cordero con la piel hacia abajo y continúe freír hasta que la grasa se derrita.", "Mezcle la masa fermentada, la menta, las vainas de cardamomo tostadas y la mostaza inglesa en un puré tosco en un procesador de alimentos.", "Transfiera la parrilla de cordero a una bandeja de asar y cepille la carne con un poco de mostaza inglesa. Extienda una cucharada de la mezcla de menta en el lado graso de la parrilla de cordero. Asar en el horno durante 12-15 minutos (para medio raro), o hasta que esté cocido a su gusto. Retire el cordero del horno y déjelo reposar durante 10 minutos.", "Mientras tanto, para la salsa, vierta los jugos de la bandeja de tostado en una cacerola, luego agregue el caldo de cordero reducido, el vinagre de vino tinto y el azúcar y mezcle bien hasta que el azúcar se haya disuelto. Ponga la mezcla a ebullición, luego reduzca el fuego y cocine a fuego lento durante 10-15 minutos, o hasta que el volumen del líquido se haya reducido lo suficiente como para formar una salsa espesa que cubra la parte posterior de la cuchara. Justo antes de servir, remueva la menta picada.", "Para servir, esculpe la parrilla de cordero en chuletas y divídalas por igual entre dos platos de servir. Coloque el puré de berenjena al lado y luego rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_herb-crusted_rack_of_23806", "title": "Costillar de cordero con costra de hierbas y puré de berenjena", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2 lb 4 oz de huesos de cordero (del cordero y las alcachofas a continuación)", "1 zanahoria, más o menos picada", "1 cebolla, más o menos picada", "1 apio en barra, aproximadamente picado", "ramita de tomillo, hojas recogidas", "ramita de romero, hojas recogidas", "1 litro / 1¾ pinta de caldo de pollo fresco", "Aceite para freír", "2 chalotes, en rodajas", "2 pimientos rojos, en rodajas", "100ml / 3½fl oz de vinagre balsámico", "500 g / 1lb 2oz de papas Desiree", "125g / 4½oz '00' harina de pasta", "sal y pimienta", "Trufas conservadas 50g / 1¾oz, finamente picadas", "2 huevos grandes de gallinas camperas, golpeados", "aceite de oliva, para freír", "1 gran manojo de perejil", "4 rebanadas de pan blanco seco", "1 diente de ajo, picado", "ramita de romero, hojas recogidas", "sal y pimienta negra recién molida", "500 g / 1lb 2 oz de alcachofas de Jerusalén, peladas y cortadas en cubos de igual tamaño", "Aceite para freír", "mantequilla, para freír", "sal y pimienta negra recién molida", "500g / 1lb 2oz chalotes, pelados", "100 g / 3½ oz de miel", "100ml / 3½fl oz de vinagre de vino tinto", "Hueso de cordero de 4 x 4 huesos, huesos extraídos y reservados", "2 claras de huevo de gallinas camperas"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el jus, haga una reserva colocando los huesos en una lata de asar y tostándola en el horno durante 20 minutos, o hasta que tengan un color marrón oscuro. Freír con cuidado la zanahoria, la cebolla, el apio, el tomillo y el romero en una cacerola grande durante cinco minutos. Agregue los huesos y cubra con caldo de pollo. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante aproximadamente tres horas, eliminando cualquier espuma que salga a la superficie.", "Para los gnocchi, pique las papas y hornee en el horno por una hora. Cuando esté cocido, retírelo del horno y déjelo enfriar.", "Una vez que el caldo esté cocido, cuele a través de un colador. En una sartén grande, fría con cuidado los chalotes y los pimientos con un poco de aceite durante cinco minutos. Agregue el vinagre balsámico y el caldo colado. Continúe cocinando hasta que el jus se reduzca a una consistencia lo suficientemente gruesa como para cubrir la parte posterior de una cuchara. Colar a través de un colador y mantener caliente hasta que esté listo para servir.", "Para la corteza de hierbas, mezcle el perejil, el pan seco, el ajo y el romero en un procesador de alimentos, hasta que se combinen y la consistencia de migas de pan fino. Sazone al gusto con sal y pimienta negra recién molida y déjela reposar en una bandeja para hornear.", "Para los gnocchi, una vez que las papas se hayan cocinado y enfriado, retire la piel y pase la carne por un colador o un ricero de papa en un tazón. Tamice la harina y sazone al gusto con sal y pimienta negra recién molida. Agregue las trufas, la mitad del huevo batido y combine para formar una masa suave. Si la mezcla está demasiado seca para formar una masa, agregue un poco más de huevo.", "Sobre una superficie ligeramente enharinada, enrolle la masa en forma de salchicha delgada y córtela en cuadrados pequeños. Coloque en una bandeja y déjelo en la nevera para enfriar.", "Para el cordero y las alcachofas, caliente una sartén y agregue el aceite y la mantequilla. Suavemente fría las alcachofas con un poco de sal y pimienta hasta que comiencen a colorear. Transfiera a una bandeja de asar y tueste en el horno por 15-20 minutos, o hasta que esté tierno.", "En la misma sartén, freír las chalotas enteras. Agregue la miel y el vinagre y cocine a fuego lento durante 25 minutos, o hasta que los chalotes estén suaves.", "Prepare los filetes de cordero cortándolos en 2-3 porciones (dependiendo del tamaño) y sazonar con sal y pimienta. Sumérjalo en la clara de huevo y transfiéralo a la bandeja que contiene la mezcla de la corteza de hierbas. Haga rodar el cordero alrededor para asegurarse de que los filetes estén cubiertos de manera uniforme.", "Agregue un poco de aceite de oliva y mantequilla a una sartén a prueba de horno. Freír los filetes de cordero durante un minuto (puede necesitar hacer esto en tandas), dar la vuelta y transferir al horno durante 6-7 minutos para medio raro (cocinar durante 3-4 minutos si prefiere que el cordero esté bien hecho) . Retire el cordero del horno y déjelo a un lado para que descanse.", "Para los gnocchi, en una sartén con agua salada hirviendo, cocine los gnocchi por unos minutos (el gnocchi se cocina cuando flota hacia la superficie). Retirar con una cuchara ranurada y luego freír en aceite de oliva hasta que estén doradas.", "Para servir, pon los chalotes, las alcachofas y los gnocchi en platos para servir. Cubra con el cordero y la cuchara sobre el jus."], "url": "www_bbc_co_uk_food_recipes_herb-crusted_lamb_with_96093", "title": "Cordero con costra de hierbas con ñoquis de trufa, chalotas glaseadas con miel y alcachofas asadas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 truchas arco iris, limpiadas y evisceradas", "sal y pimienta negra recién molida", "½ manojo de perifollo fresco", "½ manojo de tomillo fresco", "½ manojo de Romero fresco", "2 limones, en rodajas", "110g / 4oz de mantequilla sin sal", "½ limón, solo jugo", "4 cucharadas de almendras en copos, tostadas", "4 cucharadas de alcaparras, escurridas", "1 cucharada de perejil fresco de hoja plana picado", "1 cucharada de perifollo fresco picado", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "25g / 1oz de berros", "4 lechuga Baby Gem"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para la trucha, sazone el interior de la trucha con sal y pimienta negra recién molida.", "Rellene la trucha con las hierbas y los limones rebanados.", "Caliente la mantequilla en una sartén a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue la trucha y fría por 1-2 minutos en cada lado.", "Transfiera la trucha a una bandeja para hornear y hornee por otros 4-5 minutos, o hasta que esté bien cocida.", "Retírelo y déjelo a un lado para que descanse por un minuto, luego despegue la piel y retire la cabeza.", "Para el beurre noisette, caliente una sartén hasta que esté caliente, agregue la mantequilla y caliente hasta que tome un color marrón nuez.", "Agregue el jugo de limón, almendras tostadas, alcaparras y hierbas y una pizca de sal y pimienta negra recién molida y luego retírelo del fuego.", "En un tazón pequeño mezcle el aceite, el vinagre y la mostaza.", "Coloque las hojas de ensalada en un tazón grande. Vierta el aderezo sobre la ensalada y mezcle justo antes de servir.", "Para servir, coloque cada trucha en un plato calentado y cubra con una cuchara el beurre noisette. Sirve la ensalada al lado."], "url": "www_bbc_co_uk_food_recipes_herb-stuffed_rainbow_44937", "title": "Trucha arcoiris rellena de hierba con noisy beurre y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 200g / 7oz, más extra para quitar el polvo", "pizca de sal", "125g / 4½oz de mantequilla, en cubos", "1 huevo de gallinas camperas, golpeado", "1.5kg / 3lb 5oz tocino sin hueso o jamón", "1 cebolla, en rodajas", "1 diente de ajo, finamente picado", "25g / 1oz de mantequilla, más extra para engrasar", "200ml / 7fl oz de sidra seca", "50ml / 1¾fl oz de crema doble", "2 cucharaditas de mostaza integral", "2-3 cucharaditas de azúcar moreno", "1 cucharada de hierbas picadas de su elección", "2 cucharadas de harina de maíz", "sal y pimienta negra recién molida", "Papas de 450g / 1lb, peladas, hervidas hasta que estén suaves y finas", "1 manzana cocida, pelada, descuartizada y en rodajas"], "method": ["Para la masa, ponga la harina y la sal en un tazón. Frote la mantequilla hasta que se asemeje a pan rallado grueso. Poco a poco, agregue el huevo batido y combine para formar una masa (guarde los restos de huevo para glasear la masa).", "Presione en una forma oval, un poco menos de 1 cm / ½ en profundidad. Cubra con film transparente y deje enfriar en la nevera durante al menos 30 minutos (si tiene prisa, puede ponerlo en el congelador durante 10-15 minutos).", "Para el relleno, coloque la articulación de tocino en una olla y cubra con agua fría. Llevar a ebullición y cocinar a fuego lento durante 45 minutos-1 hora, o hasta que esté cocido. Cuando esté listo, un pincho entrará y saldrá fácilmente.", "Mientras tanto, freír la cebolla y el ajo en la mantequilla hasta que estén suaves y dorados.", "Cuando la junta de tocino esté cocida, retírela del licor de cocción y déjela enfriar.", "Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón, mezcle la sidra, la crema, la mostaza, el azúcar morena y las hierbas picadas. Mezcle la harina de maíz, usando un batidor o un tenedor para romper los grumos, y luego sazone al gusto con sal y pimienta negra recién molida.", "Una vez que la carne esté lo suficientemente fría como para ser manipulada, córtela en rebanadas de 5 mm / ¼ in de espesor", "Engrase un plato para pastel de 2 litros / 3½ con mantequilla. Coloque la mitad de las papas en rodajas en el fondo del plato, seguido de la mitad de las cebollas cocidas y el ajo. Ahora agregue la mitad de la manzana rebanada y la mitad del tocino cocido. Vierta la mitad de la mezcla de crema sobre las capas.", "Repita las capas con los ingredientes restantes.", "Retire la masa de la nevera. En una superficie de trabajo ligeramente enharinada, enrolle la masa hasta un grosor de aproximadamente 4 mm / ¼ in. Coloque la masa en la parte superior del plato de pastel y recorte cualquier exceso de los bordes (mantenga los restos para decorar).", "Cepille cualquier resto de huevo o un poco de leche sobre la masa como glaseado.", "Enrolle cualquier trozo de pastel en formas, como hojas o manzanas, y úselo para decorar la parte superior del pastel. Haz un agujero en el centro del pastel para permitir que escape el vapor. Cepille cualquier decoración con glaseado de huevo o leche. Use un tenedor para doblar los bordes de la masa.", "Cocine la torta en el horno por 45 minutos, o hasta que la masa esté dorada y el relleno burbujee."], "url": "www_bbc_co_uk_food_recipes_herb_and_mustard_fidget_17097", "title": "Pastel de hierbas y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de pan integral 300g / 10½oz", "200g / 7oz de harina de espelta", "50g / 1¾oz de harina de centeno", "50g / 1¾oz de harina de pan blanco", "1½ cucharadita de sal", "2 cucharadas de perejil fresco picado", "1 cucharada de salvia fresca picada", "1 cucharada de romero fresco picado", "1 cucharada de tomillo fresco picado", "2 sobres secos de levadura de acción rápida", "aproximadamente 500ml / 18fl oz de agua tibia", "2 cucharadas de azúcar", "3 cucharadas de aceite vegetal", "Nueces de 200g / 7oz, más o menos picadas", "pequeño puñado de hierbas frescas picadas (como el perejil de pan rallado, salvia, romero, tomillo)", "1 huevo de gallinas camperas", "1 cucharada de agua"], "method": ["Mezcle las harinas con la sal en un tazón grande, luego agregue las hierbas y la levadura y haga un pozo en el centro. Mezcle el agua, el azúcar y el aceite, vierta en la harina y mezcle hasta que los ingredientes se unan para formar una masa, es posible que necesite agregar un poco más de agua.", "Convierta la masa en una tabla enharinada, amase durante 10 minutos y luego colóquela en un bol engrasado, cubra y deje en un lugar tibio hasta que duplique su tamaño.", "Precalentar el horno a 200C / 400F / Gas 6. Amasar las nueces en la masa. Divida la masa en ocho porciones, forme panecillos y colóquelos en una bandeja para hornear engrasada.", "Para el glaseado, pula las hierbas en agua hirviendo durante unos segundos y luego revuelva en agua helada. Mezcle el huevo y el agua. Cepille los rollos con la mezcla de huevo, coloque las hierbas encima y vuelva a cepillar con el glaseado. Hornee en el horno de 12 a 15 minutos o hasta que los fondos suenen huecos al tocarlos."], "url": "www_bbc_co_uk_food_recipes_herb_and_walnut_rolls_58818", "title": "Rollos de hierbas y nueces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50 g / 1¾oz de mantequilla sin sal", "1kg / 2lb 4oz de papas blancas, peladas y en rodajas finas", "2 dientes de ajo, finamente picados", "sal y pimienta", "300ml / 10fl oz de leche entera", "300 ml / 10 fl oz doble crema", "mantequilla, para engrasar", "Hojas de espinaca baby 10g / ⅓oz, marchitas", "2 lonchas de tocino rayado, picadas y fritas", "4 rebanadas de pan blanco, cortezas eliminadas, cortadas en cubos de 5mm / ¼ in y fritas", "2 huevos medianos de granja, golpeados", "4 cucharadas de crema doble", "1 cucharada de perejil picado", "salsa, para servir", "2 x 6 huesos de cordero, francés recortado", "2 cucharadas de aceite de oliva", "5 cucharadas de pan rallado fresco", "1 cucharada de perejil de flatillo picado", "1 cucharada de albahaca picada", "1 cucharada de cebollino picado", "1 cucharada de mostaza inglesa"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Para las patatas dauphinoise, engrase un plato mediano a prueba de horno con la mitad de la mantequilla.", "Coloque las papas en rodajas en el plato en capas, con un poco de ajo y condimento entre las capas.", "Mezcle la leche y la crema y vierta sobre las papas. Coloca la mantequilla restante sobre la parte superior y cúbrela con papel de aluminio.", "Hornee en el horno por 1 hora y media. Retire la lámina y vuelva al horno por 30 minutos, o hasta que las papas estén doradas.", "Para la espinaca y el timbal de albahaca, engrase seis moldes dariole con mantequilla y alinee con la película adhesiva. Alinee los moldes con la espinaca marchita.", "Mezcle el tocino y croûtons en un tazón. Agregue los huevos y la crema. Sazonar con sal y pimienta, agregar el perejil y verter en los moldes.", "Coloque los moldes en una lata para asar de lados profundos y agregue agua hirviendo a la lata hasta que llegue a la mitad del costado de los moldes.", "Coloque en el horno por 30 minutos, o hasta que se asiente.", "Para el costillar de cordero con costra de hierbas, precaliente el horno a 200C / 400F / Gas 6.", "Sazonar el cordero con sal y pimienta. Caliente una sartén grande y agregue el aceite, una vez caliente, agregue el cordero y el sello por todos lados.", "En un tazón mezcle las migajas de pan y las hierbas y reserve.", "Cepille el cordero con mostaza y cubra con las migas de hierbas.", "Coloque el cordero en el horno de 12 a 14 minutos o hasta que esté cocido a su gusto. Luego retírelo y déjelo a un lado para que descanse durante al menos cinco minutos antes de tallar.", "Para servir, esculpe los estantes de cordero. Coloque una porción de papas y un timbal en cada plato junto con tres pedazos del cordero. Sirve con salsa."], "url": "www_bbc_co_uk_food_recipes_herb_crusted_rack_of_50326", "title": "Rack de cordero con costra de hierbas con patatas dauphinoise y una espinaca y timbal de albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Ciabatta de 200g / 7oz, aproximadamente desgarrado", "Corteza de limón 40g / 1½ oz, rallado", "Alcaparras 40 g / 1½ oz, enjuagadas", "Anchoas de 40 g / 1½ oz", "40 g / 1½ oz cebollas, más o menos picadas", "Aceitunas negras de 40 g / 1½ oz, deshuesadas y picadas", "1 manojo de perejil fresco", "1 manojo de albahaca fresca", "2 x 4 huesos de corderos, huesos extraídos", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "3 cucharaditas de mostaza Dijon", "50g / 2oz de mantequilla", "2 puerros grandes, finamente rebanados", "400g / 14oz pueden frijoles borlotti, enjuagados y escurridos", "1 manojo pequeño de perejil fresco de hojaldre, solo hojas", "sal y pimienta negra recién molida", "150ml / 5fl oz de vino tinto", "110ml / 4fl oz de caldo de pollo", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "puré de patatas"], "method": ["Precalentar el horno a 120C / 250F / Gas ½.", "Para la corteza de la hierba, ponga la ciabatta, corteza de limón, alcaparras, anchoas, cebollas y aceitunas en una bandeja para hornear. Coloque en el horno durante dos horas para que se seque.", "Transfiera la mezcla seca a un procesador de alimentos, agregue el perejil y la albahaca y mezcle hasta que se formen migas finas. Extienda la mezcla en un plato grande o limpie la bandeja.", "Encienda el horno a 180C / 355F / Gas 4.", "Sazonar el cordero con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva. Agregue los bastidores de cordero y fría en cada lado hasta que se doren.", "Retire de la sartén y cepille los estantes de cordero con mostaza para que estén completamente cubiertos y luego gírelos en la corteza de la hierba para cubrir completamente.", "Coloque las parrillas de cordero recubiertas en un plato resistente al horno y transfiéralo al horno para hornear durante 12-14 minutos, hasta que sea medio raro o más largo según su gusto. Dale la vuelta a la mitad de la carne. Retire del horno y deje reposar.", "Para puerros y frijoles, caliente una sartén hasta que esté caliente, luego agregue la mantequilla y los puerros. Freír suavemente los puerros durante 4-5 minutos hasta que estén suaves, pero no dorados.", "Agregue los frijoles y cocine durante 2-3 minutos más.", "Agregue el perejil y la sazón, al gusto, con sal y pimienta negra recién molida.", "Para la salsa de vino tinto, coloque el vino tinto en una sartén poco profunda a fuego alto y deje que hierva. Cocine para reducir el vino a la mitad, luego agregue el caldo de pollo y continúe hirviendo para reducir el volumen de líquido a la mitad nuevamente.", "Agregue la mantequilla, sazone con sal y pimienta negra recién molida.", "Para servir, coloque una cucharada de puré de patatas en cada uno de los cuatro platos y coloque una cucharada de puerros al lado. Corta el cordero por la mitad y colócalo sobre los puerros, luego coloca la salsa de vino tinto alrededor."], "url": "www_bbc_co_uk_food_recipes_herbandlemonencruste_84877", "title": "Hierba y cordero con corteza de limón con puerros y judías borlotti", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, cortada por la mitad a lo largo", "sal y pimienta negra recién molida", "2 cucharadas de perejil fresco picado", "1 cucharada de romero fresco picado, solo hojas", "1 cucharada de aceite de oliva", "Tomates cherry cherry 85g / 3oz, enteros", "2 cucharadas de aceite de oliva", "1 cucharada de vinagre balsámico", "1 cucharadita de azúcar en polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el pollo, mezcle el aderezo y las hierbas en un tazón, y presione las piezas de pollo en la mezcla, girándolas hasta que cada pieza esté completamente cubierta.", "Calentar el aceite en una sartén a fuego medio. Agregue el pollo y fría por 8-10 minutos, volteándolo hasta la mitad de la cocción, hasta que esté cocido, dorado y crujiente en ambos lados.", "Para los tomates, coloque los tomates en una sartén pequeña y resistente al horno. Rocíe el aceite y el vinagre sobre los tomates y espolvoréelos uniformemente con azúcar. Coloque en el horno para asar durante 5-10 minutos.", "Para servir, coloca el pollo en un plato con los tomates balsámicos al lado."], "url": "www_bbc_co_uk_food_recipes_herbandpepperchicken_89342", "title": "Pollo con hierbas y pimienta con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cuscús 250 g / 9 oz", "150ml / ¼ pinta de caldo de verduras calientes", "2 cucharadas de aceite de oliva", "250 g / 9 oz de judías verdes, recortadas, escaldadas y picadas", "2 tomates, semillas retiradas y picadas", "1 limón, solo jugo", "2 cucharadas de perejil de flatleaf fresco picado", "sal y pimienta negra recién molida"], "method": ["Coloque el cuscús en un recipiente resistente al calor, vierta sobre el caldo y el aceite de oliva y cubra con una película adhesiva. Deje reposar durante cinco minutos.", "Agregue los frijoles, los tomates, el jugo de limón y el perejil al cuscús. Sazonar, al gusto, con sal y pimienta negra recién molida y remover bien.", "Para servir, coloca el cuscús en platos para servir."], "url": "www_bbc_co_uk_food_recipes_herbandtomatocouscou_85748", "title": "Cuscús de hierba y tomate con judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de polvo de cúrcuma", "1 cucharadita de vainas de cardamomo, abiertas", "1 cucharadita de semillas de cilantro", "100 ml / 3½ fl oz de caldo de pollo", "100ml / 3½ fl oz crema doble", "25g / 1oz de cilantro fresco, picado, para adornar", "1 cucharadita de pimienta de cayena", "1 cucharadita de pimentón", "1 cucharada de aceite de oliva", "½ limón, solo jugo", "2 vainas de cardamomo, abiertas, sin semillas", "3 gambas grandes, cortadas a la mitad", "sal y pimienta negra recién molida"], "method": ["Para hacer el caldo de hierbas, coloque las semillas de cúrcuma, cardamomo y cilantro en una sartén y fría por dos minutos, para liberar los sabores.", "Agregue el caldo de pollo y la crema doble. Llevar a ebullición, luego reduzca el fuego a fuego lento durante cinco minutos.", "Para hacer las gambas, coloque la cayena, el pimentón, el aceite de oliva, el jugo de limón y las semillas de cardamomo en un tazón y mezcle bien.", "Agregue las gambas y deje macerar durante diez minutos.", "Caliente una sartén hasta que fume. Agregue las gambas y el chargrill durante dos minutos a cada lado, o hasta que estén cocidos, y sazone con sal y pimienta negra recién molida.", "Para servir, vierta el caldo en un recipiente tibio y sirva las gambas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_herbbrothwithspicypa_83621", "title": "Caldo de hierbas con gambas picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de mantequilla, suavizada", "6 hojas de salvia, finamente picadas", "1 manzana de comer, rallada", "Condimento", "200g / 7oz de mantequilla", "un puñado de hojas de tomillo comunes, de limón y naranjas despojadas de los tallos y finamente picadas", "Condimento"], "method": ["Prepare la mantequilla de salvia y manzana: mezcle todos los ingredientes (debe probar el salvia antes de incluirlo en la mantequilla ya que su fuerza varía drásticamente).", "Embale en una bandeja de cubitos de hielo o colóquese en una película adhesiva y enrolle para hacer una forma de salchicha limpia y enfríe o congele hasta que lo necesite.", "Haga la tres manteca de tomillo: machaque todos los ingredientes juntos.", "Embale en una bandeja de cubitos de hielo o colóquese en una película adhesiva y enrolle para hacer una forma de salchicha limpia y enfríe o congele hasta que lo necesite."], "url": "www_bbc_co_uk_food_recipes_herbbutters_8631", "title": "Mantequillas de hierbas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Hace rollos de 2x200g / 7oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]