[{"isVegetarian": true, "title": "Mozzarella, aubergine, mushroom and roasted pepper roll", "url": "www_bbc_co_uk_food_recipes_mozzarella_aubergine_83704", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large mushroom or 4 button mushrooms, thinly sliced", "½ aubergine, thinly sliced", "½ tsp olive oil", "1 wholemeal roll, sliced in half", "50g/1¾oz roasted red pepper from a jar (not in oil), drained, sliced", "30g/1oz mozzarella, sliced", "1 thin slice red onion", "pinch dried oregano", "handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sliced mushrooms and aubergines in a microwave safe bowl. Drizzle over the olive oil and season with salt and freshly ground black pepper. Cover with cling film and microwave on high for 2 minutes, until the mushrooms and aubergines have steamed and are tender.", "Let them cool slightly, then pile onto the sliced roll. Top with the roasted pepper, mozzarella and red onion. Season with a pinch of dried oregano and pile on the rocket. "]}, {"isVegetarian": false, "title": "Mouthwatering chicken", "url": "www_bbc_co_uk_food_recipes_mouthwatering_chicken_34426", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½cm/1in piece fresh root ginger, peeled and grated ", "2 tbsp mirin ", "½ tsp ground Sichuan pepper ", "¼ tsp ground sea salt ", "½ tsp crushed dried chilli flakes ", "400g/14oz free-range chicken thighs or drumsticks", "110g/4oz spring onions, two finely sliced and the remainder sliced into 2½cm/1in pieces", "2 tbsp vegetable oil ", "½ tsp ground Sichuan pepper", "½ tsp crushed dried chilli flakes ", "1 tbsp light soy sauce ", "1 tbsp rice vinegar ", "1 tbsp toasted sesame oil", "2 tbsp flavourless oil, such as vegetable oil", "1 banana shallot, sliced", "1 garlic clove, sliced", "25g/1oz dried baby shrimp ", "1 head Gai Lan (Chinese broccoli), cut into florets", "2 tbsp light soy sauce", "2 tbsp black rice vinegar", "2 tbsp toasted sesame oil", "400g/14oz brown rice", "50g/1¾oz sesame seeds, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a bowl, mix the grated ginger, mirin, ground Sichuan pepper, ground sea salt and crushed dried chillies together. Rub the mixture all over the chicken.", "Put the 2½cm/1in pieces of spring onion in a shallow heatproof dish. Lay the chicken thighs (or drumsticks) on top. ", "Fill a wok or a large pan with 1 litre/1¾ pints water and place a stainless steel steamer rack over the top. Bring the water to a simmer.", "Place the heatproof dish with the chicken on top of the rack, cover the pan with a lid and steam over a medium heat for 25 minutes, or until the chicken is cooked through. (The chicken is cooked when the juices run clear when the thickest part of the flesh is pierced.) Reserve the cooking juices from the dish.", "Take the chicken off the heat and carefully shred the chicken off the bone using a knife and fork (the chicken will be very hot). Slice and shred the skin into bite-sized pieces. Place on a serving plate. ", "Meanwhile, place the brown rice in a colander and wash until the water runs clear. Place the rice in a pan and add 500ml/18fl oz water. Place over a high heat and bring to the boil, then turn the heat down to low and cover with lid. Cook for 15-20 minutes, or until the rice has absorbed all the water. Turn off the heat and fluff the rice with a fork. Keep in the warm pan until ready to serve. ", "For the dressing, heat a small wok or pan and add the vegetable oil. In a small heatproof bowl, add the ground Sichuan pepper and chilli flakes. Pour the hot oil over the spices, sizzling them, and then add the soy sauce, rice vinegar and toasted sesame oil. Stir in four tablespoons of the reserved cooking juices. Spoon this sauce over the chicken.", "For the stir-fried broccoli, heat a wok, once hot, add the oil. Add the shallot, garlic and shrimp and cook for 1-2 minutes. Add the broccoli and cook for a further 2-3 minutes. Add the remaining ingredients and cook for a further 1-2 minutes.\r\n", "To serve, scatter the finely sliced spring onions over the chicken. Serve the rice in four bowls and garnish them with some toasted sesame seeds. Put the remaining reserved cooking juices from the chicken in a small bowl, serve them on the side, to use to moisten and flavour rice.  Serve the broccoli alongside the chicken."]}, {"isVegetarian": true, "title": "Mozzarella in carrozza", "url": "www_bbc_co_uk_food_recipes_mozzarellaencarozza_89236", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 slices white bread", "8 large fresh basil leaves", "1 x 150g/5oz mozzarella ball, cut into four thick round slices", "2 spring onions, finely sliced", "2 tbsp flour, seasoned with salt and freshly ground black pepper", "2 free-range eggs, beaten with a splash of milk and seasoned with salt and freshly ground black pepper", "2 tbsp olive oil, for frying", "sea salt flakes", "tomato chutney"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Use a 10cm/4in pastry cutter to cut circles from the bread slices. ", "Place a basil leaf onto each of four of the bread circles.", "Place a slice of mozzarella onto each basil leaf, then top with another basil leaf.", "Sprinkle some of the spring onions on top and season well with salt and freshly ground black pepper.", "Top each with one of the four remaining bread circles and press the edges of the bread together to seal the sandwich.", "Dredge the sandwiches in the seasoned flour to coat lightly, then dip them into the beaten egg mixture to completely coat. ", "Heat the olive oil in a large non-stick frying pan over a medium heat.", "Fry the sandwiches for 3-4 minutes each side, or until crisp and golden-brown all over.", "To serve, place two sandwiches onto each of four plates, sprinkle with sea salt flakes and serve with a dollop of tomato chutney."]}, {"isVegetarian": true, "title": "Mozzarella in carrozza", "url": "www_bbc_co_uk_food_recipes_mozzarellaincarrozza_87988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 slices crusty white bread", "100g/3½oz buffalo mozzarella, sliced", "½ beef tomato, sliced", "1 free-range egg, beaten", "salt and freshly ground black pepper", "1 tbsp olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a slice of bread on a plate and top with the sliced mozzarella and sliced tomato. Place the other slice of bread on top to make a sandwich. ", "Beat the egg in a bowl with a little salt and freshly ground black pepper. Dip the sandwich into the beaten egg. ", "Heat the olive oil in a pan, add the sandwich and fry for 2-3 minutes on each side, or until golden-brown. Remove from the heat, cut in half and serve on a plate."]}, {"isVegetarian": false, "title": "Mozzarella skewers with roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_mozzarellaskewerswit_85482", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/16oz buffalo mozzarella, torn into large pieces, about 50g/2oz each", "plain flour, seasoned with salt and freshly ground pepper", "2 free-range eggs, beaten", "fresh breadcrumbs, for rolling", "200ml/7fl oz vegetable oil, for frying", "200g/7oz cherry tomatoes, halved", "10 canned anchovies, rinsed and drained, finely chopped", "salt and freshly ground black pepper", "100ml/3½fl oz olive oil", "½ lemon, juice only", "1 tbsp fresh thyme leaves", "1 garlic clove, crushed", "1 tbsp pine nuts ", "2 tbsp red wine vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/355F/Gas 4.", "Thread two pieces of mozzarella onto each of four wooden skewers, that have been soaked in water for ten minutes, or until all the mozzarella has been used up.", "Dredge each mozzarella skewer in the seasoned flour, then dip into the beaten egg to coat.", "Dip and roll the mozzarella in the breadcrumbs to completely coat the cheese. ", "Heat the oil in a deep frying pan until it's almost smoking hot. Add the skewers and fry, turning regularly, until they are crisp and golden-brown all over.", "Carefully remove from the oil with a slotted spoon and drain on kitchen paper.", "For the tomato and anchovy sauce, place the tomatoes, cut-side up, into a shallow ovenproof dish.", "Place the anchovies on top of the tomatoes and season with salt and freshly ground pepper.", "Drizzle over the olive oil, then place into the oven to roast for 20 minutes, or until softened. ", "Once the tomatoes are cooked, add the lemon juice, thyme, garlic, pine nuts and red wine vinegar and mix gently with a spoon. ", "To serve, place a spoonful of the tomato and anchovy sauce onto each plate and serve with a mozzarella skewer on top."]}, {"isVegetarian": true, "title": "'Mr Carrot' on creamed carrot", "url": "www_bbc_co_uk_food_recipes_mrcarrotoncreamedcar_88122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 carrots, chopped", "25g/1oz butter", "150ml/¼ pint double cream", "2 tbsp white wine", "Salt and freshly ground black pepper", "For 'Mr Carrot'", "1 carrot, trimmed"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the creamed carrots, place the chopped carrots into a pan of boiling salted water and boil for six minutes or until softened and then drain.", "Melt the butter in a frying pan, add the cooked carrots and stir in the melted butter. Add the cream and wine and simmer for five minutes. Season well with salt and freshly ground black pepper and spoon onto a serving plate.", "For 'Mr Carrot', place a carrot into pan of boiling salted water and boil for five minutes or until tender and drain.", "To serve, place 'Mr Carrot' standing up vertically in the creamed carrots."]}, {"isVegetarian": true, "title": "Muhammara (red pepper dip)", "url": "www_bbc_co_uk_food_recipes_muhammara_red_pepper_dip_65246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 roasted red peppers (jarred is fine)", "75g/2½oz walnuts ", "75g/2½oz white breadcrumbs ", "1 tbsp tahini", "1 tbsp pomegranate molasses", "4 tbsp extra virgin olive oil", "fresh mint leaves, to garnish", "salt and freshly ground black pepper"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the red peppers in a food-processor until smooth and put in a large bowl.", "Blend most of the walnuts until you have fine crumbs and add to the pepper purée. Mix in the breadcrumbs and season well. ", "Stir in the tahini and pomegranate molasses and loosen with olive oil and a splash of water, if necessary.", "Arrange in a serving dish and garnish with fresh mint and the remaining walnuts"]}, {"isVegetarian": true, "title": "Mujaddarah", "url": "www_bbc_co_uk_food_recipes_mujaddarah_80248", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz white basmati rice", "175g/6oz small brown lentils", "75g/3oz butter", "1 tsp ground cinnamon", "1 tsp ground allspice", "salt, to taste ", "1 tsp freshly ground black pepper", "300ml/10½ fl oz sunflower oil", "4 large onions, halved and sliced into very thin rounds", "large handful chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Wash the rice very well in several changes of cold water, until the water runs clear. Place in a saucepan, then cover with warm water. Add salt, to taste, and bring to the boil and simmer for 10-12 minutes.", "Put the lentils into a separate saucepan and cover generously with water. Bring to the boil, reduce heat to a gentle simmer and cook for about 10 minutes or until the lentils are still a bit hard. Drain immediately and set aside.", "While the lentils are cooking, make the caramelised onions. Heat the oil in a large frying pan.   Depending on the size of your frying pan, you may need to cook them in two batches. When the oil is hot, add enough sliced onion to make a single layer, and cook over a medium heat, stirring occasionally. Towards the end of the cooking, when onions are beginning to brown, stir constantly to stop them from burning. The cooking time will be about 30 minutes. When nicely browned, remove onions with a slotted spoon, and then fry the rest of the onions.", "Melt butter in a saucepan and add the spices. Stir in the drained lentils and rice and a third of the fried onions. Gently toss them all together. Pour enough water into the saucepan to cover the rice and lentils by about 0.5cm/¼inch and season to taste with salt and freshly ground black pepper. Cover the top with some damp baking parchment cut to the shape of the pan or some foil so it touches the surface. ", "Put a lid on the pan and bring to the boil over a high heat. After five minutes turn down the heat to low, then cook for a further five minutes. All the water should now have been absorbed and the rice grains will be standing on end. Serve covered with the remaining fried onions and sprinkled with the chopped coriander."]}, {"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_mulled_cider_54895", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml fresh apple juice", "1 heaped tbsp muscovado sugar", "half an orange studded with 3-4 cloves", "1 cinnamon stick", "500ml cider ", "50ml orange liqueur", "1 lemon and ginger herbal tea bag"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the apple juice and sugar into a pan and stir.  Warm together until the sugar is dissolved. Add the cinnamon stick and the half orange studded with cloves. Add the cider and orange liqueur and warm gently", "Put in the lemon and ginger teabag and leave to infuse for 2 minutes and then remove. Warm, do not boil, for 10 min so that all flavours infuse. Serve warm. If pre-preparing, remove spices and fruit and keep warm. "]}, {"isVegetarian": true, "title": "Mulled wine baked fruit", "url": "www_bbc_co_uk_food_recipes_mulled_fruit_salad_08855", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_fruit_salad_08855_16x9.jpg", "ingredients": ["3 apples, peeled, cored and cut into eighths", "3 pears, peeled, cored and quartered", "5cm/2in orange peel, studded with 3 cloves", "1 cinnamon stick", "½ vanilla pod, split lengthways", "1 tbsp sweetener, or 3 tbsp sugar", "375ml/13fl oz (½  bottle) red wine, such as Rioja", "250g/9oz frozen black cherries", "50g/1¾oz raisins", "low-fat crème fraîche, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. ", "Put everything into a shallow, ovenproof dish and bake for 45 minutes, stirring 2 or 3 times. The wine will slowly poach the fruit, leaving it intact and gloriously purple. Allow to cool slightly before serving with a dollop of low-fat crème fraîche, if using. "]}, {"isVegetarian": true, "title": "Mulled wine-spiced roll with brandy icing", "url": "www_bbc_co_uk_food_recipes_mulled_wine-spiced_roll_67007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cinnamon stick, crushed", "½ tsp whole cloves ", "½ tsp ground ginger ", "¼ tsp ground nutmeg", "20g/¾oz dried fast-action yeast", "625g/1lb 7oz strong white bread flour, plus extra for dusting", "75g/2¾oz caster sugar", "pinch sea salt", "500g/1lb 2oz chilled butter, sliced into 1cm/½in-thick rectangles, plus extra for greasing ", "2 free-range egg yolks, lightly beaten", "300g/10½oz full-fat cream cheese", "1 vanilla pod, seeds only", "1 tsp mulled spice mixture (see above)", "200g/7oz icing sugar, sifted", "100ml/3½fl oz maple syrup", "25ml/1fl oz brandy"], "serves": "Makes 9", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the spice mixture, grind the ingredients to a fine powder in a pestle and mortar or spice grinder. Set aside.", "For the roll, put the yeast and a little water in a small saucepan and warm gently. Place the flour, sugar, salt and yeast mixture into a free-standing food mixer fitted with a dough hook. Set the motor running at a slow speed, then gradually pour in 450ml/¾ pint of cold water until the mixture comes together as an elastic dough and starts sticking to the edges of the mixing bowl (You may not need to use all of the water.).", "Cover the bowl with a clean tea towel and set aside in a warm room for about 20 minutes, or until the dough has doubled in size. ", "When the dough has risen, turn it out onto a lightly floured work surface and knock it back. Roll the dough out to a rectangle measuring 60cmx30cm/24inx12in. ", "Lay the slices of chilled butter in two lines down one side of the dough rectangle. Fold the other half of the dough over the buttered half, pressing  down gently at the edges to seal. Bash the filled dough with a rolling pin, then roll out again into another rectangle measurung 60cmx30cm/24inx12in. ", "Fold each of the short edges of the dough rectangle into the centre so that they meet in the middle, then fold the rectangle again like a book. Repeat the bashing, rolling and folding process twice more, then wrap the dough in cling film and chill in the fridge for one hour.", "Roll the chilled dough out into a rectangle measuring 30cmx45cm/12inx18in and approximately 1cm/½in thick. Set aside. ", "For the filling, mix all the ingredients together in a bowl until well combined.", "Spread filling evenly over the dough, then roll up the dough tightly, starting at the longest side closest to you. Cut the roll into 9 slices, each 5cm/2in thick. ", "Grease a 23cm/9in circular springform cake tin with butter. Place one of the roll slices in the centre, standing upright, then arrange the remaining 8 slices around it. Make sure they are not too tightly packed. Set aside to prove again for 35-40 minutes, or until doubled in size.", "Preheat the oven to 200C/180C Fan/Gas 6.", "When the rolls have proved, brush them all over with the beaten egg. Bake in the oven for 40-45 minutes, or until the rolls are golden-brown and have expanded and joined together. Remove from the oven and set aside to cool on a wire rack. Separate once cool enough to handle.", "Meanwhile for the icing, mix together the icing sugar, maple syrup and brandy in a bowl until smooth.", "To serve, arrange the rolls onto a serving platter. Drizzle the brandy icing over the mulled wine-spiced rolls in a criss-cross pattern."]}, {"isVegetarian": true, "title": "Mulled wine", "url": "www_bbc_co_uk_food_recipes_mulled_wine_46955", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg", "ingredients": ["1 large orange", "3 lemons", "12 cloves", "2 satsumas or clementines", "2 x 750ml bottles red wine", "2 cinnamon sticks", "150g/5½oz caster sugar (optional)", "brandy, to taste (optional)"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Carefully peel the zest very thinly from the orange and lemons using a vegetable peeler. Squeeze out the juice and reserve. ", "Stick the cloves into the satsumas. ", "Pour the wine, 1.2 litres/2 pints of cold water, and the citrus peel and juices into a large, heavy-based saucepan. Add the clove-studded satsumas and cinnamon sticks. Bring the mixture just to the boil, then reduce the heat until the mixture is simmering, cover the pan with the lid, and continue to simmer for about 1 hour. Stir in the sugar gradually during cooking, until the mulled wine is sweetened to your liking (you may not need all of the sugar). ", "Strain the mulled wine and serve hot in cups."]}, {"isVegetarian": true, "title": "Mulled wine trifle", "url": "www_bbc_co_uk_food_recipes_mulled_wine_trifle_96060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz butter, at room temperature", "175g/6oz caster sugar", "3 free-range eggs", "250g/9oz self-raising flour ", "2-3 tbsp milk", "2 lime zest, only", "2 pinches finely ground nutmeg", "240ml/8¾fl oz red wine", "2 x 5cm/2in cinnamon", "thumb-nail sized piece ginger, bashed ", "8 green cardamom pod, bashed ", "1 clove", "2 tbsp caster sugar", "1 orange, juice and zest", "1 packet strawberry jelly", "2 x 400g/14oz tins fruit cocktail in light syrup, drained", "250ml/9fl oz whipping cream", "25g/1oz flaked almonds, toasted", "small handful glacé cherries", "3 large free-range eggs, yolks only", "50g/1¾oz caster sugar", "50g/1¾oz cornflour", "1 tsp vanilla extract", "600ml/1 pint whole milk", "300ml/10½fl oz single cream"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the cake, preheat the oven to 180C/350F/Gas 4. ", "Grease a 18cm/7in cake tin and line the base with baking parchment.", "Cream the butter and sugar together in a bowl.", "Beat in the eggs, one at a time, beating all the time and adding a tablespoon of the flour with the last egg to prevent splitting.", "Sift the flour and gently fold it in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the zest and nutmeg.", "Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown.", "Remove the cake from the oven and set aside to cool. It is best to let the cake go stale for a day or two so that it soaks up more jelly.", "For the mulled jelly, place the red wine with the spices, sugar, orange zest and orange juice into a saucepan over a high heat.", "Bring to the boil and then reduce the heat to simmer for ten minutes.", "Strain and discard the spices; then measure the liquid. Top up with boiling water to the amount of liquid need for the instructions on the packet of strawberry jelly.", "Make the jelly as directed on the packet and set aside.", "To assemble, cut the cake into cubes and put in a large trifle bowl. Scatter over half of the fruit cocktail and pour half of the jelly on top of the sponge. Place in the fridge to set.", "Once set, pour on the rest of the jelly and the rest of the fruit and return to the fridge to set again.", "For the custard, put the egg yolks, caster sugar, cornflour and vanilla extract into a large bowl and whisk until blended. ", "Heat the milk and cream together in a pan until hot, but not boiling. ", "Gradually whisk this into the egg yolk mixture a little at a time, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat and cover with cling film in contact with the surface to prevent a skin forming while it cools.", "Pour over the cooled custard, cover and leave until completely cold before transferring to the fridge to chill and set.", "To finally assemble, beat the whipping cream in a bowl until a ribbon of cream falls from the whisk when the whisk is removed.", "Gently spread the cream over the surface of the set custard and scatter with the almonds and top with glacé cherries. "]}, {"isVegetarian": true, "title": "Mulled cider", "url": "www_bbc_co_uk_food_recipes_mulledcider_8851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3½pts/2L dry cider or fresh apple juice", "2 apples studded with cloves", "4-6 cinnamon sticks", "5-6 allspice berries", "zest of 1 orange", "dark rum (optional)", "slices of apple for garnish"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Combine all ingredients in a large saucepan and simmer gently for 30 minutes - do not boil. ", "Transfer to a heatproof bowl and ladle into glass mugs. Garnish with apple slices to serve."]}, {"isVegetarian": true, "title": "Mulled wine", "url": "www_bbc_co_uk_food_recipes_mulledwine_8156", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_8156_16x9.jpg", "ingredients": ["1 bottle red wine", "60g/2oz demerara sugar", "1 cinnamon stick", "grated nutmeg", "1 orange, halved", "1 dried bay leaf", "60ml/2fl oz sloe or damson gin (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the wine in a saucepan with the orange, sugar, bayleaf and the spices.", "Heat gently until the sugar has dissolved. Taste to see if you want the wine sweeter, and add more sugar to taste.", "Off the heat, stir in the sloe or damson gin if you are using it.", "Strain into heatproof glasses and serve at once."]}, {"isVegetarian": true, "title": "Spiced mulled wine", "url": "www_bbc_co_uk_food_recipes_mulledwine_84959", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwine_84959_16x9.jpg", "ingredients": ["½ bottle red wine", "1 cinnamon stick", "2 star anise", "2 cloves", "1 orange, sliced", "1 lemon, sliced", "50g/1¾oz brown sugar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a saucepan and simmer gently for 6-8 minutes, without boiling. Alternatively, place the ingredients in your slow cooker and cook on low until warm (1-2 hours, depending on your slow cooker). ", "To serve, pour the mulled wine into heatproof glasses."]}, {"isVegetarian": true, "title": "Mulled wine fruit compôte", "url": "www_bbc_co_uk_food_recipes_mulledwinefruitcompo_84808", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ bottle red wine", "1 orange, juice and zest", "250g/9oz mixed dried fruit", "100g/3½oz caster sugar", "1 tsp mixed spice", "1 tsp cornflour", "25ml/1fl oz water", "100g/3½oz caster sugar", "150g/5½oz roasted chestnuts", "½ lemon, juice only"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the compote, place the wine, orange juice and zest, dried fruit, sugar and spice into a pan and cook for six minutes. ", "Place the cornflour and the water into a separate bowl and mix the ingredients until the mixture is smooth.", "Add the cornflour mixture to the compote and stir until the texture of the sauce has thickened.", "For the caramelised chestnuts, heat the sugar in a frying pan over a gentle heat, until the sugar has melted to create a smooth caramel. Add the chestnuts to the caramel and mix well to coat them.  Then pour in the lemon juice and mix well.  Then pour the mixture onto a greased non-stick baking sheet.", "To serve,  place the compote into a clean bowl.  Sprinkle some of the chestnuts on top of the compote."]}, {"isVegetarian": false, "title": "Mulled wine trifle", "url": "www_bbc_co_uk_food_recipes_mulledwinetrifle_93108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulledwinetrifle_93108_16x9.jpg", "ingredients": ["1 orange, peel only, white pith removed", "1 lemon, peel only, white pith removed", "1 tbsp grated ginger", "1 cinnamon stick", "2 cloves", "100ml/3½fl oz vanilla vodka", "6 cardamom pods", "200ml/7fl oz port", "750ml/1pint 7fl oz red wine", "150g/5¼oz sugar", "25g/1 oz sheet gelatine, softened in cold water, drained", "12 tbsp frozen summer fruits, defrosted", "400g/14 oz fresh custard", "550ml/1 pint double cream, whipped until soft peaks form when the whisk is removed", "1 tsp vanilla extract", "handful flaked almonds, toasted, to decorate"], "serves": "Serves 12", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Heat the orange and lemon zest, ginger, cinnamon stick, cloves, vanilla vodka, cardamom pods, port, red wine and sugar over a low heat until hot, but not boiling. Strain the mixture through a sieve onto the softened gelatine in a large bowl and stir well. ", "Spoon the soft fruit into a large glass serving bowl and pour enough of the jelly mixture to fill it a third of the way up. Chill in the fridge overnight, or until they have completely set.", "Mix half of the whipped cream with the custard and vanilla in a bowl until well combined and spoon this mixture onto the set jelly.", "To serve, spoon the remaining whipped cream onto the trifle and scatter over the flaked almonds."]}, {"isVegetarian": true, "title": "Mulligatawny soup", "url": "www_bbc_co_uk_food_recipes_mulligatawny_soup_68949", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulligatawny_soup_68949_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp sunflower oil", "1 large onion, finely chopped", "2 garlic cloves, chopped", "2 medium carrots, cut into 1.5cm/ ⅝in cubes", "2 celery sticks, thinly sliced", "1 medium sweet potato, peeled, cut into 1.5cm/⅝in cubes", "1 eating apple, peeled, quartered, cut into 1.5cm/⅝in cubes ", "1 tbsp medium curry powder", "1 vegetable or chicken stock cube (low-salt is best)", "1litre/1¾ pints boiling water", "1 tbsp tomato purée", "1 tbsp mango chutney", "100g/3½oz  basmati rice", "100g/3½oz natural yoghurt or soured cream, to serve", "fresh coriander or flat-leaf parsley, to garnish (optional)", "salt and freshly ground black pepper"], "serves": "Serves 4-5", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the oil in a large saucepan and stir in the onion, garlic, carrots, celery and sweet potato. Cook over a medium heat for 10 minutes, stirring regularly until the vegetables are beginning to soften and brown lightly. Stir in the apple pieces and sprinkle over the curry powder. Cook for a further 2 minutes more, stirring as it cooks. ", "Crumble the stock cube into a measuring jug, and pour over the boiling water. Mix to combine. Pour into the pan, and stir in the tomato purée and mango chutney. Bring to the boil, then reduce the heat slightly and leave to simmer for 30 minutes, stirring occasionally . Cook until the vegetables are tender. ", "While the soup is simmering, half-fill a medium pan with water and bring to the boil. Add the rice and return to the boil. Cook for 10 minutes, or until the rice is tender. Drain the rice in a sieve and rinse under running water until cold. ", "When the soup is ready, cool the soup for a few minutes and blend with a stick blender or in a food processor until smooth before stirring in the cooled rice. If you want a more rustic texture to the soup, do not blend. ", "Add enough water to give a good consistency, (about 150-200ml/5½-7fl oz). Heat the soup for 3–4 minutes until piping hot and check the seasoning, add salt and freshly ground black pepper to taste.", "Ladle the soup into deep bowls and top each with a spoonful of natural yoghurt or soured cream. Garnish with sprigs of coriander or flat-leaf parsley if you like."]}, {"isVegetarian": false, "title": "Pepper and pineapple soup", "url": "www_bbc_co_uk_food_recipes_mulligatawnysoup_83986", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "½ red pepper, chopped", "1 tbsp curry powder", "1 tsp turmeric", "1 chicken stock cube (vegetarians may substitute with a vegetable stock cube.)", "400ml/14fl oz water", "handful pineapple, chopped", "75ml/3fl oz double cream"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan and add the onion and pepper. Fry gently over a medium heat for three minutes, to soften.", "Add the curry powder and turmeric and cook for a further minute.", "Crumble in the stock cube and add the water and the pineapple. Bring to the boil and then reduce the heat and simmer gently for ten minutes.", "Add the double cream and simmer for 2-3 minutes to thicken the soup .", "Pour the soup into a serving bowl and serve immediately."]}, {"isVegetarian": true, "title": "Multi-seed savoury crackers", "url": "www_bbc_co_uk_food_recipes_multi-seed_savoury_03806", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seed_savoury_03806_16x9.jpg", "ingredients": ["230g/8oz wholemeal flour", "115g/4oz semolina", "¾ tsp fine salt (smoked or fleur de sel Guérande if available)", "55g/2oz sesame seeds", "55g/2oz flax seed", "55g/2oz pumpkin seeds – roughly ground", "1 tbsp runny honey", "3½ tbsp vegetable oil, plus extra for greasing", "ground seeds or spices of your choice (optional)"], "serves": "Makes 48", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix the wholemeal flour, semolina and salt together with the sesame, flax and ground pumpkin seeds. ", "In separate bowl, whisk 210ml/7¼fl oz water with the honey and oil.  Stir in to the dry ingredients and mix to a medium-firm dough. ", "Knead the dough for five minutes. Return to the bowl, cover and set aside for 20 minutes.", "Preheat oven to 180C/375F/Gas 4.  Line 2-3 baking trays with non-stick parchment.", "Oil the work surface and roll the dough out to a thickness of 3mm. ", "Using a ruler and a sharp knife or pizza cutter, cut the dough into rectangles or diamonds, of approximately 5x15cm/2x6in.  Place on to the prepared trays close together, but not touching. ", "Spray the crackers with water. At this point you can add a topping if you wish (more ground seeds or spices). You can reknead any left-over scraps, but they will not be as successful as first kneading. Alternatively, put the scraps on a tray and bake them for snacking. ", "Bake the crackers for 15-18 minutes. Turn the oven off, open the door for 30 seconds and close again. Leave the trays in the residual heat of the oven for 10-15 minutes for extra crispness.  Transfer to a wire rack to cool.  "]}, {"isVegetarian": true, "title": "Multi-seeded wheat-free bread", "url": "www_bbc_co_uk_food_recipes_multi-seeded_wheat-free_24145", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/multi-seeded_wheat-free_24145_16x9.jpg", "ingredients": ["450g/1lb wheat-free flour (a blend of potato flour, rice flour, tapioca flour and xanthan gum) ", "1 tsp salt", "2 tbsp caster sugar", "2 tsp fast-action yeast ", "310ml/10fl oz full-fat milk", "1 tsp cider vinegar", "6 tbsp vegetable oil, plus extra for greasing", "2 free-range eggs, plus 1 free-range egg beaten for egg wash", "4 tbsp mixed seeds, such as pumpkin, sesame and sunflower seeds, plus extra for finishing"], "serves": "Makes 1 loaf", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Grease and line a 900g/2lb loaf tin.", "Place the flour into a free-standing food mixer fixed with the balloon whisk attachment. ", "Add the salt, sugar and yeast in three separate piles.", "Mix together the milk, vinegar, oil, and two eggs in a jug.  ", "Pour the liquid into the mixing bowl and add the seeds.", "Switch on the mixer and whisk the ingredients for about 3-4 minutes.", "Put the batter into the prepared tin, cover with oiled cling film and leave to prove for about one hour, or until doubled in size.", "Preheat the oven to 180C/350F/Gas 4. Bake for about 35-45 minutes. Cover with foil after ten minutes.", "About ten minutes before the end of the cooking time, brush the loaf with egg wash (beaten egg) and sprinkle over the seeds.", "Remove from the oven, leave to cool on a wire rack."]}, {"isVegetarian": false, "title": "Mum’s everyday fish pie with cheese mash", "url": "www_bbc_co_uk_food_recipes_mums_everyday_fish_pie_43141", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mums_everyday_fish_pie_43141_16x9.jpg", "ingredients": ["400ml/14fl oz whole milk", "1 small onion, thickly sliced", "2 bay leaves", "500g/1lb 2oz thick white fish fillets, preferably cod, haddock or pollock, skinned", "40g/1½oz butter", "40g/1½oz plain flour", "150g/5½oz frozen peas", "200g/7oz large raw prawns, peeled", "sea salt and freshly ground black pepper", "800g/1lb 12oz medium potatoes, peeled and cut into quarters", "40g/1½oz butter, cubed", "3 tbsp milk", "100g/3½oz mature Cheddar cheese, grated"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["To make the filling, pour the milk into a large lidded pan and add the sliced onion and bay leaves. Season with salt and black pepper.", "Place the fish fillets in the pan and bring to a very gentle simmer, cover and cook for two minutes. ", "Remove the pan from the heat and leave to stand and infuse for 20 minutes. Drain the fish through a colander into a bowl, then pour the milk into a jug.", "Meanwhile, make the mash for the topping. Half fill a large saucepan with cold water. Add the potatoes and bring to the boil. Reduce the heat and simmer for 15 minutes or until the potatoes are soft.", "Drain the potatoes and return them to the pan. Mash with the butter, milk and three-quarters of the grated cheese. Season to taste with salt and black pepper. ", "Preheat the oven to 200C/400F/Gas 6. ", "To finish the filling, melt the butter in a medium saucepan and stir in the flour. Cook for a few seconds, then gradually add the infused milk, stirring constantly, and simmer over a medium heat for 3–4 minutes until the sauce is smooth and thick. Stir in the peas and season with salt and black pepper.", "Spread one third of the sauce into the base of a 1.5 litre/2¾ pint ovenproof dish. Scatter half the fish fillets over the sauce, breaking them into chunky pieces as you go and discarding the onion and bay leaves. ", "Arrange half the prawns on top of the fish and pour over another third of the sauce. Repeat this with the remaining fish and prawns and finish with the final third of sauce on top.", "Spoon the mash over the fish mixture, spreading to the edges with a palette knife. Fork the surface and sprinkle over the remaining cheese. Place the dish on a baking tray and bake in the centre of the oven for about 25 minutes or until the top is golden-brown and the filling is bubbling."]}, {"isVegetarian": false, "title": "Murg adraki", "url": "www_bbc_co_uk_food_recipes_murg_adraki_57546", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½ tbsp rapeseed oil", "1 tsp cumin seeds", "2 tsp sesame seeds", "200g/7oz ginger, thinly sliced", "1 green chilli, slit open", "salt, to taste", "1 tsp red chilli powder", "100g/3½oz palm sugar ", "100g/3½oz tamarind paste", "pinch asafoetida", "1 dried red chilli", "½ tsp mustard seeds", "5-6 curry leaves", "4 chicken breasts, skin on", "300g/10½oz chicken breast, minced", "1 spring onion, chopped", "2 tbsp ginger, finely chopped", "pinch garam masala", "salt, to taste", "1 litre/1¾ pints chicken stock", "vegetable oil, for frying", "2 tbsp rapeseed oil", "1 tsp cumin seeds", "50g/1¾oz ginger, finely chopped", "1 green chilli, slit open", "2 medium onions, finely chopped", "1 tsp red chilli powder", "2 tsp ground coriander", "1 tsp ground turmeric ", "2 medium tomatoes, chopped", "fresh ginger , julienned and crisp-fried", "Celery cress ", "Red shisho cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat two tablespoons of the oil in a frying pan, fry the cumin seeds for 1-2 minutes then add the sesame seeds, ginger and green chilli and season with a little salt.  ", "Stir for 2-3 minutes and then cover the mixture with a circle of greaseproof paper and let it cook slowly for 40-45 minutes until the ginger is almost cooked. ", "Let the mixture cool then transfer to a food processor and blend to a fine paste with the tamarind paste and palm sugar.   ", "Heat the remaining oil in a separate pan, add the asafoetida, red chilli and mustard seeds. As the mustard seeds pop, add the curry leaves, stir for 30 seconds then pour into the ginger chutney mixture and mix well. Set aside.", "Meanwhile, prepare the chicken. Place each breast of chicken on a large piece of foil and flatten them with a meat mallet.", "Mix the minced chicken breast with the spring onion, ginger, garam masala and a little salt and divide into four portions.   ", "Place one portion of mince on flattened chicken breast and roll into a roulade with the foil. Tighten the ends of foil by twisting each end.  ", "Bring the chicken stock to a simmer in a saucepan and poach the roulades for 25-30 minutes or until the chicken is completely cooked through. Remove the roulades from the stock and let cool.", "Heat a little oil in a frying pan. Remove the foil from the chicken roulades and sear them on all sides until lightly coloured and crisp.  ", "While the chicken is poaching, make the sauce. Heat the oil in a pan, gently fry the cumin seeds and ginger then add the green chilli and chopped onions.    ", "Fry until the onions are caramelised to a golden-brown then add the chilli powder, coriander and turmeric. Cook for 2-3 minutes then season with salt and add the chopped tomatoes.   ", "When the tomatoes have softened, place the mixture in a food processor and blend to a fine paste, moistened with a little stock if necessary. Set the sauce aside and keep warm. ", "To serve, cut each chicken roulade into three equal pieces.  Spoon the sauce and chutney on the plate and place three pieces of roulade on top of the sauce. Garnish with the fried ginger and cress leaves."]}, {"isVegetarian": true, "title": "Muscovado and hazelnut tart with yoghurt sorbet", "url": "www_bbc_co_uk_food_recipes_muscovadoandhazelnut_86417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz caster sugar", "120ml/4fl oz boiling water ", "500ml/18fl oz good-quality plain yoghurt", "½ lemon, juice only, strained", "150g/5½oz dark muscovado sugar, plus 1 tbsp for sprinkling", "120g/4½oz plain flour, sifted", "50g/2oz salted butter, softened", "100g/4oz hazelnuts, shells removed, toasted ", "1 large free-range egg ", "½ tsp baking powder", "150g/5½oz soured cream", "1 tbsp hazelnuts, shells removed, toasted, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the yoghurt sorbet, place the sugar and boiling water into a small pan and bring back to the boil, stirring to dissolve the sugar. Once dissolved, boil for a few seconds, then remove from the heat and leave to cool. ", "When the sugar syrup is cold, pour it into a bowl with the yoghurt and lemon juice. Taste and add a little more lemon juice if necessary. Churn in an ice cream machine according to the manufacturer's instructions for about 15 minutes, or until softly set, then transfer to a container and freeze. ", "Preheat the oven to 200C/400F/Gas 6. ", "For the tart, place the sugar (except the one tablespoon for sprinkling), flour, butter and nuts into a food processor and pulse until the mixture resembles coarse breadcrumbs. Remove half the mixture from the food processor and spread it over the bottom of a 20cm/8in round non-stick tin that is 5cm/2in deep (not loose-bottomed). Pat the mixture down gently with the back of a spoon as you would for a cheesecake base, without pressing too firmly. ", "Tip the other half of the mixture into a bowl. Crack in the egg, add the baking powder and soured cream and beat to make a smooth batter. Pour this mixture over the crumb base. Sprinkle over the reserved tablespoon of muscovado sugar. Transfer to the oven and bake for about 25 minutes, or until just firm. To check if it's done, insert a skewer into the centre - it should come out clean. Allow the tart to reach room temperature before serving.", "To serve, cut the tart into wedges and sprinkle over the chopped hazelnuts. Serve with a scoop of the yoghurt sorbet."]}]