[{"ingredients": ["500 g / 1 lb 2 oz zanahorias, peladas", "50g / 2oz de mantequilla", "1 diente de ajo, pelado, aplastado", "750ml / 1 pinta 7fl oz de agua", "1 ramita de tomillo fresco", "1 ramita de romero fresco", "sal y pimienta negra recién molida", "150ml / 5fl de leche en oz", "2 pomelos rosados, pelados y segmentados, segmentos a la mitad", "1 puñado de aceitunas Gordal verdes, piedras removidas, cortadas a la mitad", "1 puñado de avellanas, trituradas y tostadas", "1 centavo berro de cilantro fresco", "4 cucharadas de aceite de avellana"], "method": ["Corta las zanahorias lo más finamente posible, usando una mandolina.", "Caliente una sartén grande hasta que esté caliente, luego agregue la mantequilla, las zanahorias rebanadas y el ajo y cocine a fuego medio durante 2-3 minutos.", "Agregue el agua, el tomillo y el romero y sazone con sal y pimienta negra recién molida. Deje que hierva a fuego lento, luego cubra con una tapa y cocine por 5-6 minutos, o hasta que las zanahorias estén tiernas.", "Retire la sartén del fuego y agregue la leche. Deje que se enfríe un poco, luego transfiera la mezcla a una licuadora y mezcle hasta que quede suave. Coloque en la nevera para enfriar durante al menos 30 minutos.", "Para servir, divida la sopa entre cuatro tazones para servir. Coloque los segmentos de pomelo, las aceitunas, las nueces y el berro de coriandro encima de la sopa, luego rocíe sobre el aceite de avellana."], "url": "www_bbc_co_uk_food_recipes_chilledsoupofcarrots_91727", "title": "Sopa fría de zanahorias, pomelo rosado, aceitunas verdes y avellanas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco del país, las cortezas quitadas y rotas en migas grandes", "2 cucharaditas de vinagre de jerez", "½ diente de ajo, pelado y finamente picado", "1 cucharadita de azúcar en polvo", "½ chile rojo, sin semillas y finamente cortado en cubitos", "30ml / 1fl oz de aceite de oliva virgen extra", "225g / 8oz de tomates de ciruela, pelados y sin semillas", "2 cucharaditas de ketchup de tomate", "200ml / 7fl oz de jugo de tomate", "2 cebollas tiernas, finamente cortadas", "½ pimiento rojo, asado oa la parrilla, pelado, sin semillas y cortado en cubitos", "¼ pepino grande, pelado, sin semillas y cortado en cubos", "2 cucharaditas de pesto", "sal y pimienta negra recién molida", "cubitos de aceite de oliva congelados (coloque el aceite de oliva en moldes de cubitos de hielo y congele)"], "method": ["Coloque el pan en un procesador de alimentos o licuadora. Con la máquina en funcionamiento agregue el vinagre, el ajo, el azúcar y el chile, y mezcle hasta que quede suave.", "Agregue el aceite de oliva virgen extra hasta que el pan no se absorba más, luego, poco a poco, agregue los tomates, el ketchup de tomate, el jugo de tomate, las cebolletas, el pimiento rojo, el pepino y el pesto. Continúa mezclándote para formar una emulsión suave. Sazone al gusto con sal y pimienta negra.", "Sirva con cubitos de aceite de oliva congelado"], "url": "www_bbc_co_uk_food_recipes_chilledtomatobisque_70019", "title": "Sopa de tomate enfriado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, picado", "100g / 3½ oz de batata, picada", "1 puerro, finamente cortado", "200 ml / 7 fl oz de caldo de pollo caliente (los vegetarianos pueden sustituir el caldo de verduras)", "6 cucharadas de crema doble", "sal y pimienta negra recién molida", "pequeño puñado de cebollín fresco, picado, para servir"], "method": ["Caliente la mantequilla y el aceite en una cacerola y fría la cebolla hasta que estén suaves pero no coloreados.", "Agregue el ajo, la batata y el puerro y saltee durante 3-4 minutos, hasta que se suavice un poco.", "Agregue el caldo y traiga el hervor. Reduzca el fuego, agregue la crema doble y cocine a fuego lento durante 2-3 minutos, o hasta que la sopa espese un poco. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Retirar del fuego y dejar enfriar por completo. Coloque en la nevera para enfriar.", "Para servir, vierta la sopa en tazones y decore con las cebolletas."], "url": "www_bbc_co_uk_food_recipes_chilledvichyssoise_86139", "title": "Batata vichyssoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 estantes de costillas de cerdo", "1 cucharadita de pimienta negra", "3 hojas de laurel", "perejil pequeño de hojas planas", "1 cebolla, más o menos picada", "1 zanahoria, cortada en trozos", "4 papas para hornear grandes", "1 cucharada de aceite de oliva", "1 cucharadita de copos de sal marina", "250ml / 9fl oz de crema agria", "4 cucharadas de perejil rizado finamente picado", "175g / 6oz de ketchup de tomate", "150g / 5oz de chile chipotle, salsa de tomate", "100ml / 3½fl oz de salsa de soja oscura", "175g / 6oz de azúcar moreno oscuro", "4 cucharadas de salsa teriyaki"], "method": ["Para las costillas, coloque las costillas en una olla grande con los granos de pimienta, hojas de laurel, perejil, cebolla y zanahoria. Cubra con agua, lleve a ebullición, luego reduzca a fuego lento y cocine durante 1 hora y media.", "Mientras tanto, precalentar el horno a 200C / 400F / Gas 6.", "Para la papa al horno, perfore la papa un par de veces con un tenedor, luego frote con el aceite de oliva y la sal.", "Hornee en el estante superior del horno durante una hora o hasta que esté cocido.", "Para la salsa, coloque todos los ingredientes en una olla y cocine a fuego lento.", "Retire las costillas del agua, sumérjalas en la salsa y colóquelas en una bandeja de asar.", "Cueza al horno en el horno por 20-30 minutos, rociando con más de la salsa después de 10 minutos.", "Para servir, apile las costillas en un plato para servir. Separe las papas a la mitad y cubra con una cucharada de crema agria y un poco de perejil picado."], "url": "www_bbc_co_uk_food_recipes_chilli-glazed_sticky_71707", "title": "Costillas pegajosas glaseadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli-glazed_sticky_71707_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 dientes de ajo", "cilantro fresco de manojo grande", "1 cucharada de pimentón dulce", "1 cucharadita de pimentón ahumado", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "grandes hebras de azafrán", "5 cm / 2 en pieza de jengibre", "1 chile rojo, cortado, semillas retiradas", "2 cucharadas de vinagre balsámico blanco (o vinagre balsámico común)", "1 limón, solo jugo", "3 cucharadas de aceite de oliva de buena calidad", "sal al gusto", "pimienta de cayena, al gusto (opcional)", "4 x 150 g / 5 oz de filetes de salmón", "1 cucharadita de aceite de oliva", "1 cebolla blanca, cortada en rodajas finas", "2 pimientos rojos, tallo eliminado, sin semillas, carne cortada en tiras", "100ml / 3½fl oz de vino blanco", "200g / 7oz de tomates cherry, cortados a la mitad", "2 cucharadas de hojas de albahaca fresca, finamente picada", "1 cucharadita de ralladura de limón rallado", "guión aceite vegetal, para engrasar", "½ limón, cortado en 4 rodajas finas", "cuscús cocido, para servir", "aceitunas negras, en rodajas, para servir"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la pasta de chermoula, mezcle todos los ingredientes de la pasta, excepto la sal y la pimienta de cayena, en un procesador de alimentos hasta que estén suaves y bien combinados. Sazonar, al gusto, con sal y pimienta de cayena, si se usa.", "Extender la pasta de chermoula generosamente por todos los filetes de salmón. Cubra y reserve para marinar durante el mayor tiempo posible, y hasta una hora si el tiempo lo permite.", "Caliente el aceite en una sartén grande y antiadherente a fuego medio. Agregue la cebolla y los pimientos rojos y fría por 3-4 minutos, o hasta que empiecen a ablandarse pero todavía estén intactos.", "Agregue el vino y lleve la mezcla a ebullición, luego reduzca el fuego hasta que el vino esté hirviendo a fuego lento. Cocine a fuego lento durante 2-3 minutos, o hasta que la mayor parte del vino se haya evaporado.", "Agregue los tomates, reduzca ligeramente el calor y cocine por 4-5 minutos o hasta que comiencen a descomponerse. Agregue la albahaca y la ralladura de limón.", "Corta cuatro pedazos grandes de papel de hornear o papel de aluminio, cada uno debe ser lo suficientemente grande como para envolver un filete de pescado. Cepille o rocíe cada trozo de pergamino o papel de aluminio con un poco de aceite vegetal, luego coloque un filete de salmón con chermoula en el centro de cada uno.", "Coloque una rodaja de limón en la parte superior de cada filete de pescado. Coloque una cuarta parte de la mezcla de pimiento rojo y tomate junto a cada trozo de pescado.", "Envuelva cuidadosamente las parcelas de pescado juntando los bordes opuestos del pergamino o la lámina y doblando para sellar por todos lados.", "Coloque las parcelas de pescado en una bandeja para hornear y hornee en el horno durante 12-15 minutos, o hasta que el salmón esté bien cocido. (Para comprobar que el pescado esté cocido, retire un paquete del horno y ábralo ligeramente; el salmón está cocido cuando se desmenuce fácilmente con un tenedor. Precaución: El vapor escapará del paquete al abrirlo).", "Para servir, coloque las parcelas sin abrir en platos para servir. Permita que cada persona abra su propio paquete. Sirva con un tazón grande de cuscús cocido al vapor y unas pocas aceitunas negras."], "url": "www_bbc_co_uk_food_recipes_chilli-spiced_salmon_66094", "title": "Salmón picante", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli-spiced_salmon_66094_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1kg / 2lb 2 oz de carne picada", "2 cebollas, finamente cortadas en cubitos", "2 dientes de ajo, finamente cortados en cubitos", "1 apio en barra, finamente cortado en cubitos", "2 chiles, finamente cortados en cubitos", "1 hoja de laurel", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "1 cucharada de orégano seco", "1 cucharada de pimentón", "2 cucharaditas de Cayena", "1 cucharadita de canela molida", "1 cucharadita de pimienta negra molida", "1 cucharada de puré de tomate", "400g / 14oz de tomates enlatados", "250ml / 9fl oz de caldo de carne", "25 g / 1 oz de chocolate negro, finamente picado", "400g / 14oz de frijoles rojos en lata, enjuagados y escurridos", "hojas pequeñas de cilantro racimo, toscamente picadas", "arroz basmati"], "method": ["Caliente una sartén grande hasta que esté caliente, luego agregue el aceite de oliva y la carne picada. Freír hasta que se dore, luego retirar de la sartén y reservar.", "Agregue las cebollas, el ajo, el apio y los chiles y sude unos 5-6 minutos hasta que estén dorados.", "Agregue todas las especias y fría por un minuto.", "Regrese la carne a la sartén y revuelva para combinar.", "Agregue el puré de tomate, tomates enlatados y caldo y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 1-1½ horas hasta que esté muy tierno.", "Agregue el chocolate y los frijoles y cocine a fuego lento durante otros cinco minutos hasta que estén calientes.", "Verifique el condimento antes de agregar las hojas de cilantro y servir."], "url": "www_bbc_co_uk_food_recipes_chilli_78774", "title": "Chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de bacalao, coley o filete de eglefino", "2 cucharaditas de jugo de limón", "1 cucharada de hojas frescas de cilantro", "1 diente de ajo, aproximadamente picado", "1 chile verde, sin semillas y picado", "¼ de cucharadita de azúcar", "2 cucharaditas de yogurt natural", "Mangetout 80 g / 3 oz, cocido al vapor, para servir"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque el pescado en un plato no metálico y espolvoree con el jugo de limón. Cubra y deje en la nevera para marinar durante 15-20 minutos.", "Coloque el cilantro, el ajo y el chile en un procesador de alimentos o licuadora y procese hasta que la mezcla forme una pasta. Agregue el azúcar y el yogur y brevemente procese para mezclar.", "Coloque el pescado en una hoja de papel de aluminio. Cubra los peces en ambos lados con la pasta. Recoja la lámina flojamente y voltee en la parte superior para sellarla. Regrese a la nevera por al menos 1 hora.", "Coloque el paquete en una bandeja para hornear y hornee por unos 15 minutos o hasta que el pescado esté recién cocinado. Sirve con el mangetout."], "url": "www_bbc_co_uk_food_recipes_chilli_and_coriander_21270", "title": "Paquete de pescado de cilantro y cilantro", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_coriander_21270_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "60ml / 2fl oz de vinagre de vino de arroz", "2 bastoncillos de limoncillo, magullados", "1 chile rojo, finamente cortado", "2 cucharadas de menta finamente cortada", "2 cucharadas de cilantro finamente cortado", "400 g / 14 oz bloque atún fresco", "8 lanzas de espárragos, recortadas", "½ manojo de rábanos de desayuno para bebés, hojas retiradas y reservadas", "1 manojo de nabos bebé", "½ manojo de berros frescos", "2 cucharadas de hojas de menta fresca, deja todo", "2 cucharadas de cilantro fresco, todo entero", "2 cucharadas de berro de coriandro bebé, para servir"], "method": ["Para el filete de atún, caliente una sartén hasta que esté caliente.", "Caliente una sartén y agregue el azúcar, el vinagre y 60 ml / 2 fl oz de agua. Una vez que el azúcar se haya disuelto, agregue el lemongrass, el chile, la menta y el cilantro.", "Cocine por un par de minutos hasta que esté pegajoso y luego enrolle el atún en el glaseado.", "Coloque el atún en una sartén y cocine hasta que aparezcan las marcas de la barra y gire el atún hasta que tenga marcas alrededor del atún. Asegúrate de que esté rosa en el medio.", "Una vez retirado de la sartén, cepille el glaseado restante sobre el atún. Permita descansar por unos minutos mientras prepara la ensalada.", "Para la ensalada de espárragos, caliente una olla de agua hirviendo y pula los espárragos, los rábanos y los nabos. Desagüe.", "Coloque las verduras en agua helada para refrescar.", "Coloque las hojas de berro, menta y cilantro en un tazón grande. Agregue las verduras blanqueadas, junto con las hojas de rábano y mezcle todo junto.", "Para servir, corte el atún en trozos pequeños y sirva con la ensalada al lado. Adorne con berro de coriandro. Rocíe sobre el glaseado que queda en la sartén después de cocinar el atún."], "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_66169", "title": "Filete de atún glaseado de Chili y limón sobre ensalada de espárragos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de hojuelas de chile seco", "1 cucharadita de gránulos de ajo", "¼ cucharadita de sal marina", "Col rizada 250g / 9oz, hojas recogidas de los tallos, lavadas y secadas", "1 cucharada de aceite de oliva light"], "method": ["Precaliente el horno a 120C / 100C Fan / Gas ½ y alinee dos bandejas grandes para hornear con papel de hornear.", "Mezcle el chile, los gránulos de ajo y la sal marina.", "Coloque la col rizada en un recipiente grande y masajee el aceite en las hojas. Mezcle con el condimento.", "Extiende las hojas en una sola capa en dos bandejas grandes para hornear. Hornee durante 20 minutos, girando las bandejas a la mitad de la cocción.", "Levante las hojas del papel de hornear con una espátula. Regrese las bandejas al horno, apague el fuego y déjelas reposar de 12 a 15 minutos o hasta que estén crujientes."], "url": "www_bbc_co_uk_food_recipes_chilli_and_garlic_spiced_00826", "title": "Chiles y patatas fritas de col ricas en ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_garlic_spiced_00826_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 tallos de limoncillo, finamente picados", "1 chile rojo, sin grano y finamente picado", "2 dientes de ajo, pelados y finamente picados", "1 cucharada de salsa de pescado tailandesa", "Carne de muslo de pollo 350 g / 12 oz, cortada en trozos del tamaño de un bocado", "1 cucharada de aceite de girasol", "100 ml / 3½ fl oz de caldo de pollo", "1 cucharada de azúcar en polvo", "½ cabeza pequeña de brócoli, cortada en pequeños floretes", "pequeñas hojas de menta fresca, albahaca y cilantro, para adornar (opcional)", "arroz al vapor, para servir"], "method": ["En un tazón, combine la hierba de limón, el chile, el ajo y la salsa de pescado. Coloque la carne de pollo en otro recipiente y agregue la mitad de la mezcla de hierba de limón, reservando el resto. Cubra y coloque en el refrigerador para marinar durante al menos 20 minutos.", "Caliente el aceite en un wok o una sartén antiadherente grande a fuego alto. Agregue la mezcla reservada de hierba de limón y saltee durante aproximadamente un minuto hasta que esté fragante. A continuación, agregue el pollo marinado y saltee durante 4-5 minutos, o hasta que las piezas de pollo tengan un bonito color en todos los lados. Agregue el brócoli y saltee por otro minuto.", "Vierta el caldo de pollo en la sartén y agregue el azúcar. Cocine a fuego lento durante unos minutos, o hasta que el caldo se haya reducido y le quede una salsa espesa. Sirva con arroz al vapor y adorne con las hierbas."], "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_73685", "title": "Pollo Chili y hierba de limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_lemongrass_73685_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 tallos de limoncillo, finamente picados", "1 chile rojo, sin semillas y finamente picado", "2 dientes de ajo, finamente picados", "1 cucharada de salsa de pescado tailandesa", "350 g / 12 oz de cerdo, cortado en trozos del tamaño de un bocado", "1 cucharada de aceite de girasol", "1 cucharada de curry en polvo", "100 ml / 3½ fl oz de caldo de pollo", "1 cucharada de azúcar en polvo", "1 cucharada de aceite de girasol", "2 dientes de ajo, finamente rallados", "1 chile rojo, sin semillas y finamente picado", "Jengibre fresco de raíz 2½cm / 1in, pelado y finamente rallado", "manojo de cebollas de primavera, en rodajas finas", "2 cucharaditas de aceite de sésamo", "2 cucharadas de salsa de soja", "150g / 5½oz de guisantes congelados", "300g / 10½oz de arroz basmati cocido", "2 huevos grandes de gallinas camperas, golpeados", "pequeño puñado de hojas de menta, albahaca y cilantro, desgarrado"], "method": ["Combine el lemongrass, el chile, el ajo y la salsa de pescado en un tazón y mezcle.", "Coloque la carne de cerdo en otro recipiente, agregue la mitad de la mezcla de hierba de limón y reserve el resto. Cubra y coloque en el refrigerador para marinar durante al menos 20 minutos.", "Caliente el aceite en un wok o en una sartén grande a fuego alto. Agregue la mezcla reservada de hierba de limón y el polvo de curry y saltee durante aproximadamente 1 minuto hasta que esté fragante.", "Agregue el cerdo adobado y saltee durante 4-5 minutos hasta que las piezas tengan un bonito color en todos los lados. Vierta el caldo de pollo y agregue el azúcar. Cocine a fuego lento durante unos minutos hasta que el caldo se haya reducido y le quede una salsa espesa.", "Para el arroz, caliente el aceite en una sartén grande y agregue el ajo, el chile y el jengibre. Agregue las cebollas de primavera y revuelva a través del aceite de sésamo y la salsa de soja. Agregue los guisantes y mezcle todo. Agregue el arroz a la sartén y mezcle con las verduras.", "Haz un pozo en el centro y vierte el huevo. Deje que se asiente brevemente, luego trabaje revuelva rápidamente el huevo e incorpore el arroz por los lados hasta que todo esté combinado. Cocine por 2 minutos.", "Sirve el cerdo con arroz y hierbas frescas"], "url": "www_bbc_co_uk_food_recipes_chilli_and_lemongrass_80877", "title": "Chili y hierba de limón con arroz frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200ml / 7fl oz de aceite vegetal, para freír", "2 huevos de gallinas camperas, golpeados", "5 cucharadas de harina de maíz", "1 cucharadita de sal marina", "Filete de solomillo de 400 g / 14 oz, cortado en tiras finas", "2 zanahorias, cortadas en tiras finas", "2 cebollas tiernas, finamente cortadas", "Jengibre de 2.5cm / 1in, pelado, cortado en cerillas", "2 dientes de ajo, en rodajas", "½ cucharadita de copos de chile", "4 cucharadas de azúcar en polvo", "50ml / 2fl oz de vinagre de arroz", "50ml / 2fl oz de salsa de soja ligera", "arroz hervido", "chile, en rodajas", "rodajas de limón"], "method": ["Para la carne de res, vierta el aceite vegetal en una freidora o en una olla mediana y caliente hasta que alcance 180 ° C / 350 ° F, o cuando un pequeño cubo de pan caiga dorado en 30 segundos. (Nota: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Bata los huevos, la harina de maíz y la sal en un bol hasta formar una masa espesa.", "Cubra las tiras de carne en la masa, sacuda el exceso y fríaselas durante dos minutos en el aceite o hasta que estén crujientes y doradas. Retire con una espumadera y déjelo a un lado en papel de cocina. Cubra las tiras de zanahoria en la masa, sacuda el exceso y fríaselas durante dos minutos en el aceite, o hasta que estén crujientes y doradas. Retire con una espumadera y déjelo a un lado en papel de cocina.", "Caliente un wok con una cucharada de aceite para freír. Agregue las cebollas de primavera, el jengibre, el ajo y el chile y saltee por un minuto.", "Agregue el azúcar, el vinagre y la salsa de soja, carne de res frita y zanahorias y revuelva hasta que estén bien combinados. Retire la sartén del fuego.", "Sirva la carne de chile con arroz hervido, rodajas de chile y rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_46473", "title": "Carne de chiles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "500g / 1lb 2 oz espinilla de res cortada y cortada en cubos de 1cm / ½ en cubitos", "1 cebolla grande, picada", "2 dientes de ajo, aplastados", "1 chile rojo, finamente picado", "1 cucharadita de orégano seco", "½ cucharadita de cacao en polvo", "1 cucharada de puré de tomate", "1 x 400g / 14oz de tomates picados en lata", "200ml / 7fl oz de caldo de buey rico", "sal y pimienta negra", "1 x 400 g / 14 oz de frijoles de lata, drenados y enjuagados", "3 pimientos rojos grandes asados ​​de un tarro, sin semillas y picados", "125g / 4½oz de harina natural", "125g / 4½oz de harina de maíz", "½ cucharadita de sal", "115g / 4oz de mantequilla sin sal, derretida y ligeramente enfriada", "2 huevos de gallinas camperas, golpeados", "250ml / 8fl oz de suero de leche", "1 chile verde, sin grano y muy finamente picado", "½ cucharadita de polvo de hornear", "120g / 4¼oz de queso cheddar fuerte, rallado"], "method": ["Para hacer el llenado (que puede hacer antes de tiempo), primero caliente su horno a 170 C / 325 F / Gas 3.", "Caliente una cucharada de aceite en una cazuela a prueba de fuego a fuego alto. Agregue la mitad de la carne y dore bien.", "Retire y reserve en un plato. Agregue la carne restante, y un poco más de aceite si es necesario, dorar y reservar con el resto de la carne.", "Reduzca el fuego a medio-bajo y agregue un poco más de aceite a la sartén. Agregue la cebolla y el ajo y cocínelos durante 5-8 minutos, hasta que se ablanden.", "Agregue el chile, el orégano, el cacao en polvo y el puré de tomate a las cebollas y mezcle. Vuelva a colocar la carne en la sartén junto con los jugos que se hayan filtrado y cocine durante unos minutos. Condimentar con sal y pimienta.", "Agregue los tomates y el caldo de carne, cocine a fuego lento, luego cubra y cocine en el horno durante una hora. Agregue los frijoles y los pimientos y vuelva al horno por una hora más o hasta que la carne esté tierna.", "Compruebe el condimento (si no es lo suficientemente caliente para usted, puede condimentarlo con un poco de chile en polvo) y luego mezcle la mezcla en 4-6 platos de pastel individuales, dejando unos 2 cm / ¾ por debajo del borde.", "Encienda el horno a 180C / 350F / Gas 4.", "Para hacer la mezcla de pan de maíz, mezcle la harina, la harina de maíz y la sal en un tazón grande. En una jarra, combine la mantequilla derretida, los huevos, el suero de leche, el chile verde y el polvo de hornear. Agregue a los ingredientes secos y mezcle hasta que estén combinados - no mezcle en exceso.", "Cubra la carne de chile con la mezcla de pan de maíz, luego espolvoree queso sobre cada plato. Hornee durante aproximadamente 30 minutos, hasta que estén doradas. Si lo desea, puede terminar los pasteles debajo de la parrilla por unos minutos para obtener una tapa dorada muy bonita. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_cornbread_76029", "title": "Pasteles de maíz con carne de res", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_cornbread_76029_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chalotes de plátano grandes, toscamente picados", "Jengibre fresco de raíz de 5cm / 2in en pieza, pelado, más o menos picado", "2 tallos de limoncillo, hojas externas duras descartadas, núcleo toscamente picado", "3 hojas de lima, más o menos picadas", "6 dientes de ajo, pelados, más o menos picados", "4 chiles rojos largos, toscamente picados", "1 kg / 2lb 4oz de carne de ternera cocida, cortada en cubos", "1-2 pequeños chiles secos, al gusto", "1 cucharada de aceite de colza", "5 vainas de cardamomo, ligeramente trituradas", "Anís de 3 estrellas", "2 palitos de canela", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "1 x 400 ml de leche de coco de estaño", "200ml / 7fl oz de caldo de carne", "1 cucharada de salsa de pescado", "1 cucharada de azúcar de palma", "2 cucharadas de pasta de tamarindo", "2 limas, solo jugo", "sal y pimienta negra recién molida", "arroz jazmín hervido, para servir"], "method": ["Mezcle los chalotes, el jengibre, el limoncillo, las hojas de lima, el ajo, los chiles rojos y 5 cucharadas de agua en una pasta en un procesador de alimentos. Saque la mezcla en un tazón grande y agregue la carne, mezcle bien hasta que la carne esté recubierta con la pasta. Cubra y reserve para marinar durante al menos 2 horas, y preferiblemente durante la noche en la nevera.", "Coloque los chiles secos en un recipiente y cúbralos con agua hirviendo del hervidor. Dejar de lado durante 30 minutos para suavizar.", "Calentar el aceite en una cazuela a fuego medio. Agregue el cardamomo, el anís estrellado, la canela, el comino molido y el cilantro molido y mezcle las especias en el aceite hasta que estén fragantes.", "Agregue la carne marinada y revuelva bien para cubrirla con las especias.", "Agregue todos los ingredientes restantes excepto el jugo de lima (y el arroz) y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Escurra los chiles secos, reservando el agua de remojo y picarlos finamente. Agregue los chiles y 50ml / 2fl oz del agua de remojo a la cazuela y revuelva bien. Cubra con una tapa y cocine a fuego lento durante 2 horas, o hasta que la carne esté tierna.", "Retire la tapa y mezcle el curry, luego cocine a fuego lento por otros 15-20 minutos o hasta que la salsa se espese. Agregue el jugo de lima y sazone, al gusto, con sal y pimienta negra recién molida.", "Sirve el rendang de carne con arroz jazmín."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_rendang_47873", "title": "Rendang de carne de chili", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_rendang_47873_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de grupa de ternera a 400 g / 14 oz", "4 tortillas de trigo integral, cortadas en 8 cuñas", "75g / 2¾oz de hojas de espinaca bebé, lavadas", "sal y pimienta negra recién molida", "15g / ½ oz de hojas frescas de cilantro", "2 cucharadas de jugo de lima", "1 cucharada de aceite de girasol", "1 diente de ajo, aplastado", "1 chile rojo, finamente picado"], "method": ["Precalentar la parrilla a un ajuste caliente.", "Sazonar la carne con sal y pimienta negra recién molida. Calentar una sartén grande y dorar la carne a fuego alto hasta que esté cocida pero aún rosada. Esto tomará aproximadamente 2 minutos por cada lado, dependiendo del grosor. Dejar de lado a temperatura ambiente.", "Ase las tortillas por unos 5 minutos, o hasta que estén crujientes. Dejar de lado para enfriar.", "Mientras tanto, prepara el aderezo combinando todos los ingredientes en un tazón pequeño.", "Corta finamente la carne y colócala sobre las hojas de espinaca. Cuchara sobre el aderezo y servir con las cuñas de tortilla caliente."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_salad_with_26728", "title": "Ensalada de carne de chili con cilantro", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_salad_with_26728_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite de girasol, para freír", "1 cucharada de granos de pimienta de Sichuan, triturados hasta obtener un polvo fino", "2 limas, solo cáscara", "1 naranja, solo ralladura", "3 cucharadas de harina de arroz tbsp, harina de patata o harina de maíz", "Filete de res 400g / 14oz, cortado en tiras finas", "2 cucharadas de aceite vegetal", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz vino de arroz Shaoxing", "25ml / 1fl oz de vinagre de vino de arroz", "1½ chiles rojos, finamente picados", "2 cucharadas de chile en hojuelas", "Jengibre fresco de la raíz de los 10cm / 4in, pelado y cortado fino", "2 tallos de limoncillo, hojas exteriores descartadas, finamente picadas", "4 hojas de lima, aplastadas", "2 huevos grandes, ligeramente batidos", "2 cucharaditas de aceite de sésamo", "2 cucharadas de aceite de cacahuete", "200g / 7oz de arroz basmati, recién cocinado según las instrucciones del paquete y enfriado", "4 cebollas de primavera, en rodajas finas", "4 cucharadas de salsa de soja", "3 cucharadas de hojas de cilantro fresco finamente picado"], "method": ["Calienta una freidora a 190 ° C o calienta el aceite de girasol para freír en una sartén profunda y de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No se deje sin supervisión).", "Ponga la pimienta de Sichuan en un tazón grande, agregue los zumos de lima y naranja y la harina de arroz, luego mezcle bien.", "Cubra las tiras de carne con el aceite vegetal, luego con la mezcla de pimienta.", "Freír la carne en lotes por 2 minutos por lote y luego escurrir sobre papel de cocina.", "Para la salsa, caliente una sartén o wok hasta que esté caliente. Agregue el azúcar, el vino de arroz y el vinagre y deje que hierva. Agregue los chiles, los copos de chile, el jengibre, la hierba de limón y las hojas de lima, luego cocínelos durante 5-8 minutos o hasta que estén espesos, pegajosos y lustrosos.", "Agregue la carne cocida a la salsa, retírela del fuego y mezcle bien para que quede cubierta en salsa.", "Para el arroz frito con huevo, mezcle los huevos y el aceite de sésamo en un tazón con un tenedor. Caliente el aceite de cacahuete en un wok hasta que esté caliente, luego agregue el arroz y saltee durante 2-3 minutos, o hasta que esté bien caliente. Agregue los huevos y saltee durante 2-3 minutos más, o hasta que estén listos y la mezcla esté seca.", "Sazonar con sal y pimienta y sofreír durante 2 minutos más, luego agregar las cebolletas, la salsa de soya y el cilantro. Sirva el arroz en tazones con tiras de carne encima."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_90112", "title": "Carne de chili con arroz frito con huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 papas para hornear, lavadas y secas", "4 cucharaditas de aceite de colza", "1½ cucharadita de comino molido", "1½ cucharadita de cilantro molido", "½ cucharadita de canela molida", "1½ cucharadita de chile en polvo suave", "Solomillo de 300 g / 10½ oz o bistec de lomo, sin grasa, cortado en tiras de 1 cm / ½ pulgada", "1 cebolla roja, finamente rebanada", "1 pimiento rojo, sin semillas, en rodajas finas", "2 dientes de ajo, finamente picados", "½-1 chile rojo, sin semillas, en rodajas", "400g de tomates cortados en lata", "1 cucharada de hojas de cilantro picado", "sal marina y pimienta negra recién molida", "100 g / 3½ oz de crema agria", "45 g / 1½ oz de queso cheddar maduro. rallado", "30g / 1 oz de jalapeños, en rodajas"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Frote las papas con 2 cucharaditas de aceite y sazone con sal y pimienta. Pincharlos con un tenedor. Hornee por 45-60 minutos, o hasta que esté crujiente por fuera y esponjoso por dentro.", "Mientras tanto, mezcle las especias juntas en un tazón mediano. Retire 2 cucharaditas de la mezcla de especias y reserve. Agregue el bistec al recipiente y revuelva para cubrir.", "Caliente una sartén grande hasta que esté muy caliente. Agregue el aceite restante y la carne de res y fríe durante 30-40 segundos en cada lado, hasta que se dore y se cocine, luego incline sobre un plato y déjelo a un lado.", "Agregue la cebolla y el pimiento a la sartén, cúbralo con una tapa y fría a fuego lento durante 2-3 minutos, hasta que se ablande. Agregue el ajo, el chile y la mezcla de especias reservadas y fría por otros 2 minutos, luego agregue los tomates. Llevar a ebullición, luego reduzca el fuego a fuego lento, cubra y cocine durante 4-5 minutos, hasta que estén tiernos y la salsa se reduzca ligeramente. Agregue la carne y los jugos y cocine por otro minuto, hasta que estén cocidos y calientes. Sazonar con sal y pimienta y luego incorporar el cilantro.", "Cuando las papas estén blandas, córtelas por la mitad a lo largo y divídalas entre las placas para servir. Coloque la carne de chile en la parte superior y termine con una cucharada de crema agria, queso rallado y algunas rodajas de jalapeño."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_jacket_37003", "title": "Chilli de ternera con patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_with_jacket_37003_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla salada", "Harina normal de 50g / 2oz", "aproximadamente 250ml / 9fl oz de cerveza o leche", "Queso Cheddar maduro 100 g / 4 oz, rallado", "100 g / 4 oz Caerphilly u otro queso maduro, rallado", "25 g / 1 oz de Shropshire azul u otro queso azul, desmenuzado, o más al gusto", "3 yemas de huevo de gallinas camperas", "pizca de sal", "2-3 chiles verdes frescos y suaves, sin semillas, finamente picados", "1 diente de ajo, finamente triturado (opcional)", "1 cucharadita de pimienta negra molida", "1 cucharada colmada de cilantro fresco picado", "2-3 cucharadas de mostaza inglesa", "6-8 rebanadas gruesas de pan", "chutney, para servir"], "method": ["Derrita la mantequilla en una cacerola a fuego medio y mezcle la harina con una espátula de madera, revolviendo continuamente. Cocine por dos minutos, revolviendo todo el tiempo, para hacer un roux. Retire del fuego. Poco a poco mezcle la cerveza o la leche, y agite enérgicamente durante unos segundos hasta que no haya trozos de roux sin mezclar, y vuelva a calentar a fuego medio. Cocine, revolviendo a menudo, hasta que la salsa comience a espesar, luego cocine a fuego lento durante 3-4 minutos.", "Retire la sartén del fuego. Agregue los quesos, yemas de huevo, sal, chile picado, ajo, pimienta y cilantro picado, vuelva a calentar a fuego lento y cocine suavemente hasta que todo el queso se haya derretido y la mezcla comience a burbujear en los bordes; será muy espesa en este momento etapa que es correcta. Pruebe y ajuste el condimento si es necesario.", "Caliente la parrilla al máximo. Tueste el pan, ya sea debajo de la parrilla en ambos lados o en una tostadora. Ponga la mezcla de rareza generosamente sobre la tostada, colóquela debajo de la parrilla hasta que burbujee y se dore en algunos lugares. Servir caliente con salsa picante."], "url": "www_bbc_co_uk_food_recipes_chilli_cheese_toast_71091", "title": "Tostada de queso picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace suficiente cobertura para 6-8 rebanadas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite, para freír", "Filete de res 400g / 14oz, cortado en tiras finas", "2 cucharadas de aceite vegetal", "1 cucharada de granos de pimienta de Sichuan", "2 limas, solo cáscara", "1 naranja, solo ralladura", "3 cucharadas colmadas de arroz o harina de patata o harina de maíz", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz vino de arroz Shaoxing", "25ml / 1fl oz de vinagre de vino de arroz", "1½ chiles rojos, finamente picados", "2 cucharadas de chile en hojuelas", "Jengibre fresco de raíz de 10cm / 4in, finamente picado", "2 tallos de limoncillo, hojas externas eliminadas, luego finamente picadas", "4 hojas de lima finamente picadas", "1 cucharada de aceite vegetal", "4 huevos de gallinas camperas", "2 cucharadas de salsa de soja", "400 g / 14oz de arroz frío cocido"], "method": ["Para la carne de chile, caliente una freidora a 190 ° C o 375 ° F o caliente el aceite para freír en una sartén profunda y pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Mezcle las tiras de carne con las dos cucharadas de aceite vegetal.", "En una maja y mortero, triture los granos de pimienta de Sichuan en un polvo fino. Colóquelos en un tazón grande con la ralladura de lima, naranja y harina de arroz y mezcle bien. Agregue la carne y revuelva para cubrir cada pieza completamente.", "Coloque la carne en la freidora de grasa unos pocos lotes a la vez, y cocine durante dos minutos. Escurrir sobre papel de cocina.", "Para la salsa, calentar una sartén o wok hasta que esté caliente, agregar el azúcar, el vino de arroz y el vinagre de vino de arroz y llevar a ebullición.", "Agregue los chiles, las hojuelas de chile, el jengibre, el limoncillo y las hojas de lima y luego cocine por 5-8 minutos hasta que se espese, se vea pegajoso y brillante.", "Agregue la carne cocida a la salsa, quite del fuego y mezcle bien para que toda la carne esté cubierta con salsa de chile pegajoso.", "Para la tortilla de arroz pegajoso, caliente el wok hasta que esté caliente, agregue el aceite y revuelva para cubrirlo antes de limpiar cuidadosamente el wok con un paño de cocina, eliminando el exceso de aceite.", "Batir los huevos, agregar la salsa de soya, verter en el wok caliente, levantar el wok y hacer rodar el huevo por los lados para que tenga una tortilla muy grande.", "Agregue el arroz cocido al centro de la tortilla y luego retire con cuidado la tortilla de los lados del wok para cubrir el huevo.", "Cuando el arroz esté caliente y la tortilla puesta, enrolle en un tablero y córtela en cuatro pedazos.", "Para servir, apile la carne en platos y la tortilla de arroz en recipientes separados."], "url": "www_bbc_co_uk_food_recipes_chilli_beef_with_sticky_49937", "title": "Carne de chili con tortilla de arroz pegajoso", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_beef_with_sticky_49937_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite vegetal", "8-10 chiles enteros de ojo de pájaro", "2 cucharadas de jengibre fresco de raíz finamente rallado", "2 dientes de ajo, finamente picados", "2 cebollas, finamente picadas", "8 muslos de pollo, deshuesados ​​y sin piel, cortados en trozos", "2-3 cucharadas de salsa de soja oscura", "2-3 cucharadas de vinagre blanco", "pizca de sal", "1 cebolleta, finamente cortada, para adornar", "arroz recién cocido al vapor, para servir"], "method": ["Caliente el aceite en una sartén grande o en un sartén a fuego medio. Agregue los chiles, tape y cocine por 3-4 minutos, o hasta que estén ennegrecidos. Agregue el jengibre, el ajo y la cebolla y cocine sin tapar durante 10 minutos, o hasta que se ablanden, teniendo cuidado de no quemar el ajo.", "Agregue el pollo y cocine por 8-10 minutos, o hasta que esté recién cocido. Agregue la salsa de soja, el vinagre y una pizca de sal, si es necesario, y cocine a fuego lento durante 1 minuto.", "Coloque el pollo en un plato para servir, espolvoree las cebolletas y sirva junto con arroz recién hecho al vapor."], "url": "www_bbc_co_uk_food_recipes_chilli_chicken_55870", "title": "Pollo chili", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_chicken_55870_16x9.jpg", "isVegetarian": false, "recommendations": 0}]