[{"isVegetarian": true, "title": "Bruschetta with fresh cherry tomatoes and basil", "url": "www_bbc_co_uk_food_recipes_bruschettawithfreshc_87057", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small ciabatta loaf, split lengthways", "2 tbsp olive oil", "150g/5½oz cherry tomatoes, halved", "1 large sprig basil, leaves only ", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Drizzle the cut side of the ciabatta bread with one tablespoon of the olive oil and toast in a large, non-stick frying pan until golden-brown.", "Mix the remaining tablespoon of olive oil, cherry tomatoes, basil and salt and pepper in a small bowl and leave aside to infuse.", "To serve, divide the tomato mixture between the two pieces of toasted ciabatta bread."]}, {"isVegetarian": true, "title": "Bruschetta with halloumi", "url": "www_bbc_co_uk_food_recipes_bruschettawithhallou_85353", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "100g/3½oz halloumi, cut into 4 slices", "1 tbsp olive oil", "2 plum tomatoes, chopped", "1 tbsp brown sugar", "2 tbsp tomato ketchup", "salt and freshly ground black pepper", "1 slice ciabatta, toasted", "2 tbsp olive oil", "sprig fresh chervil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the halloumi, heat the oil in a frying pan and fry the halloumi slices for 2-3 minutes on each side, until golden-brown.", "For the tomato sauce, heat the oil in a saucepan and cook the tomatoes, sugar and ketchup until thickened. Season, to taste, with salt and freshly ground black pepper.", "To serve, place the toasted ciabatta onto a plate, drizzle with olive oil and top with the tomato sauce and halloumi. Garnish with chervil."]}, {"isVegetarian": true, "title": "Bruschetta with tomatoes and rosemary", "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_77891", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz cherry tomatoes", "2 tbsp olive oil ", "2 tbsp rosemary", "2 tbsp thyme", "1 garlic clove, chopped ", "2 large slices of ciabatta bread, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the tomatoes on a baking sheet, drizzle with oil and sprinkle with rosemary, thyme and garlic.", "Place into the preheated oven for 10 minutes.", "Serve the hot tomatoes on the toasted bread and enjoy."]}, {"isVegetarian": true, "title": "Bruschetta with tomato and red onion", "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_79947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 thick slices of bread", "1 tbsp olive oil ", "25g/1oz chopped red onion ", "75g/2¾oz tinned tomatoes, chopped", "1 tbsp olive oil ", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and rub the bread with olive oil. Place the bread onto the griddle and cook for two minutes on each side, or until toasted.", "For the topping, place the red onion, tomatoes and olive oil into a bowl and mix well.", "Add the parsley and season, to taste, with salt and freshly ground black pepper.", "To serve, place the toasted bread on the plate and spoon over the topping."]}, {"isVegetarian": true, "title": "Bruschetta with tomatoes, basil, garlic and olive oil", "url": "www_bbc_co_uk_food_recipes_bruschettawithtomato_88870", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil ", "2 slices ciabatta bread", "½ tsp sea salt", "1 clove garlic, peeled and halved", "2 tbsp chopped fresh parsley, chopped", "2 vine tomatoes, de-seeded and chopped", "1 clove garlic, finely chopped", "6 basil leaves, torn", "3 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the toasted bread, drizzle the oil over the ciabatta and sprinkle over the salt. Heat a griddle pan until smoking and chargrill the bread for 2-4 minutes on each side, or until golden-brown and toasted. Remove from the pan and rub each slice of toast with the cut-side of half a garlic clove.", "For the tomato topping, combine all the ingredients in a bowl and mix well, then season, to taste, with salt and freshly ground black pepper.", "To serve, pile the tomato mixture on top of the toasted bread."]}, {"isVegetarian": false, "title": "Brussels sprouts with pancetta", "url": "www_bbc_co_uk_food_recipes_brussels_sprouts_with_12803", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brussels_sprouts_with_12803_16x9.jpg", "ingredients": ["salt", "900g/2lb 4oz Brussels sprouts, trimmed and loose leaves removed", "2 tsp olive oil", "225g/8oz pancetta, cut into cubes"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of salted water to the boil and add the sprouts. Cook for 8-10 minutes, or until tender, then drain in a colander.", "Heat a frying pan over a high heat until hot. Add the olive oil and pancetta cubes and fry for 5-7 minutes, or until the pancetta is crisp and golden-brown.", "Add the drained sprouts and stir together to warm through. Serve immediately."]}, {"isVegetarian": false, "title": "Brussels sprouts with toasted almonds and bacon", "url": "www_bbc_co_uk_food_recipes_brussels_sprouts_with_57377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices smoked or unsmoked streaky bacon, roughly chopped", "1 banana shallot, thinly sliced", "2 garlic cloves, crushed", "250g/9oz Brussels sprouts, finely shredded", "30g/1oz toasted almonds, roughly chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over medium heat and fry the bacon until crisp. Transfer to a plate lined with kitchen paper to drain.", "Add the shallot and garlic to the pan and cook for 2 minutes, until soft. Add the sprouts and cook for 3-4 minutes, until wilted, stirring occasionally. ", "Return the bacon to the pan, add the almonds and cook through for 2 minutes. Serve immediately.  "]}, {"isVegetarian": true, "title": "Brussels sprout gratin", "url": "www_bbc_co_uk_food_recipes_brusselssproutgratin_88284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz butter", "55g/2oz plain flour", "200ml/7fl oz milk", "100ml/3½fl oz double cream", "85g/3oz cheddar cheese, grated", "½ tsp Dijon mustard", "salt and freshly ground black pepper", "100g/3½oz Brussels sprouts, quartered", "small handful chopped fresh chives, to garnish"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Melt the butter in a saucepan, add the flour and stir until it forms a thick paste. Remove from the heat and gradually whisk in the milk and cream. Return to the heat and stir until the mixture has thickened.", "Add the grated cheese, mustard, salt and freshly ground black pepper and simmer for five minutes over a low heat.", "Place the quartered Brussels sprouts into a pan of salted boiling water and boil for 3-4 minutes, then drain.", "Spoon the cooked Brussels sprouts into the base of a small gratin dish and pour over the cheese sauce. Place in the oven and bake for 8-10 minutes, or until golden-brown on top. Scatter with chopped fresh chives and serve."]}, {"isVegetarian": false, "title": "Bubble and squeak", "url": "www_bbc_co_uk_food_recipes_bubble_and_squeak_64067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3–4 tbsp turkey fat from the gravy, or 15g/½oz butter", "1 onion, finely chopped", "400g/14oz Brussels sprouts (leftover or freshly cooked), shredded", "600g/1lb 5oz leftover roast potatoes, parsnips, carrots or any other Christmas vegetables", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat half the fat in a non-stick frying pan. Add the onion and fry over a medium heat until translucent. Add the sprouts and cook until everything is starting to caramelise around the edges. Transfer to a bowl.", "Roughly mash the leftover root vegetables together, then add them to the onion and sprouts. Season well.", "Heat the remaining fat in the frying pan. Pile the mixture back in, pressing down. Cook until the base has a really good crust on it. Carefully go round the edges with a palette knife to make sure it will come away easily (it won’t if the crust hasn’t cooked for long enough), then flip onto a plate, before sliding it back, cooked side up, into the pan. ", "Cook until another crust forms, then serve. (Alternatively, you can wait for a crust to form, break it all up and flatten down again, repeating a couple of times until the bubble and squeak is a mixture of mash and well browned, crisp nuggets of crust.)"]}, {"isVegetarian": true, "title": "Bubble and squeak and candied shallots", "url": "www_bbc_co_uk_food_recipes_bubble_and_squeak_and_38318", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bubble_and_squeak_and_38318_16x9.jpg", "ingredients": ["30 shallots, peeled ", "150g/5oz butter", "3 tbsp caster sugar", "200ml/7fl oz red wine", "125ml/4fl oz port", "crème de cassis", "600ml/1 pint beef stock", "1 fresh bay leaf", "1 lemon, zest only", "1 tsp dried thyme", "3 tbsp olive oil", "2 leeks, washed, sliced", "1.25kg /2lb 12oz potatoes, peeled, boiled, mashed and left to cool", "750g/1lb 10oz spring cabbage, finely shredded, blanched (or leftover cooked cabbage or Brussels sprouts)", "sea salt flakes and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the candied shallots, simmer the shallots gently for 4-5 minutes in a pan of boiling water to soften. Drain.", "Heat the butter in a non-reactive frying pan, add the shallots and fry gently until golden-brown, about 3-4 minutes.", "Add the sugar and stir until it melts and begins to caramelise and coat the shallots.", "Mix the wine, port, cassis and stock together in a bowl. Add a quarter of the wine mixture to the pan with the shallots and bring to a boil, then add the bay leaf and lemon zest. Reduce the heat until the mixture is simmering, then continue to simmer until the liquid has reduced to a glaze.", "Add some more of the wine mixture to the pan and simmer again until the liquid has reduced to a glaze. Add the remaining liquid bit by bit, reducing each time, until the shallots are coated in the glaze. Set aside until needed.", "For the bubble and squeak, heat half of the olive oil in a frying pan and cook the leeks for 3-4 minutes, or until softened but not coloured. ", "Mix the leeks, mashed potato and cabbage together in a bowl. Season, to taste, with salt and freshly ground black pepper. ", "Heat the remaining olive oil in the frying pan. Place four 7.5cm/3in chefs' rings into the pan and spoon the bubble and squeak into the rings, packing down gently. Cook until golden-brown on the bottom, turn the rings over carefully and cook on the other side. Remove from the pan and keep warm until ready to serve, carefully removing the chefs’ rings before serving."]}, {"isVegetarian": true, "title": "Bubble and squeak cakes", "url": "www_bbc_co_uk_food_recipes_bubbleandsqueakcakes_92283", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large spring onions, roughly chopped", "large slice butter ", "olive oil, for frying", "3-4 cardamom pods ", "1 heaped tsp coriander seeds", "1 heaped tsp cumin seeds", "leftover mashed potato ", "small pot (150ml/5fl oz) double cream", "handful fresh coriander leaves, chopped"], "serves": "2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan and add the spring onions, the butter and a good drop of olive oil to stop the butter from burning. ", "Meanwhile, remove the black seeds from the cardamom pods using the back of a knife. Place in a mortar (or alternatively use a plastic bag and a rolling pin), add the coriander seeds and cumin seeds and work the pestle or the rolling pin until they are coarsely ground. Don't grind them to a complete powder - you want texture and nuttiness from the spices.", "Add the spices to the spring onions and cook, stirring occasionally, until they turn a pale golden-brown but before they start to burn and crisp up. Add the onion mixture to some leftover mashed potato in a bowl and form into four potato cakes using your hands. Place the cakes back into the frying pan and cook until crisp and brown on each side, literally a few minutes, that's all, and remove from the pan. ", "For a quick sauce, add the cream to the pan used to cook the bubble and squeak cakes with some fresh coriander. Bring to the boil and season well. Serve the bubble and squeak cakes straightaway with the sauce. These are also wonderful served with grilled bacon rashers or gammon steaks."]}, {"isVegetarian": false, "title": "Bubble and squeak with poached egg and hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_bubbleandsqueakwithp_84100", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["675g/1½ lb Maris Piper potatoes, peeled and cut into chunks ", "225g/8oz curly kale or spring cabbage, thinly sliced ", "25g/1oz butter ", "1 leek or small onion, chopped ", "150ml/5fl oz full-cream milk ", "freshly ground white pepper ", "6 rashers streaky bacon, cut into lardons", "2 tbsp white wine vinegar", "4 free-range eggs", "ready-made hollandaise sauce, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the potatoes in a large pan of  salted water (one teaspoon of salt per 600ml/ pint water). Bring to the boil and simmer until tender. ", "Put 1 cm/½ inch of water into a large pan and bring to the boil. Add half a teaspoon of salt and the cabbage and cook over a vigorous heat for 4-5 minutes, until just tender.", "Drain the cooked potatoes and leave the steam to die down. Drain the cabbage well. ", "Using the same pan, melt the butter, then add the leek or onion and cook gently for 7-8 minutes, or until softened but still translucent.", "Pass the potatoes through a potato ricer (if you do not have one you can use a masher) into the pan and add the cabbage, milk and white pepper to taste. Mix together well.", "Heat a frying pan until hot and add the bacon and fry until crisp. Add the bacon to the potato mix and form into four patties.", "Heat the frying pan. Place patties in the hot pan and cook for 2-3 minutes, or until golden brown, then flip and cook for another 2-3 minutes.", "Meanwhile, bring a pan of salted water to the boil and add the vinegar. Whisk the water to create a whirlpool and once settled, crack an egg in. Simmer for 2-3 minutes, remove the poached egg carefully with a slotted spoon and place on a plate to drain. Repeat the process with the remaining eggs.", "To serve, place the bubble and squeak on a plate and top with the eggs and a spoonful of hollandaise sauce."]}, {"isVegetarian": false, "title": "Christmas chocolate Yule log", "url": "www_bbc_co_uk_food_recipes_buchedenoel_73213", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buchedenoel_73213_16x9.jpg", "ingredients": ["vegetable oil, for greasing", "150g/5½oz golden caster sugar", "6 large free-range eggs, separated", "250g/9oz high quality dark chocolate (minimum 60 per cent cocoa solids)", "250g/9oz unsalted butter, softened", "450g/1lb golden icing sugar, plus extra for dusting", "50g/1¾oz cocoa powder, sifted", "2 tbsp milk", "400ml/14fl oz double cream, lightly whipped", "250g/9 oz raspberries", "dash whisky liqueur (optional)"], "serves": "Serves 8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["This Christmas roll can be made two ways: with buttercream icing and festive decorations, or filled with cream and berries.", "Preheat the oven to 220C/425F/Gas 7. Line a 23x33cm/9x13 in Swiss roll tin with greaseproof paper and brush this lightly with oil.", "Combine the caster sugar and egg yolks in a bowl and whisk them together until light and thick. Melt the chocolate with 4tbsp cold water in a bowl over a pan of very gently simmering water. When you can see the chocolate has melted until smooth, stir in the sugar and egg mixture.", "Meanwhile, whisk the egg whites until stiff but not dry. Gently fold a spoonful of the egg whites into the chocolate mixture to lighten it, then fold in the remaining whites using a large metal spoon. Do not overmix, and always use a gentle action. Pour the batter gently into the prepared tin and bake for 12-14 minutes (no longer), until risen and just firm to the touch.", "Remove to a wire rack and leave to cool in the tin for at least 2 hours.", "Once cold, lay a sheet of greaseproof paper on a board. With one bold movement, turn the whole cake onto the sheet of paper, then lift the tin off. Carefully peel away the paper and trim away any scraggy edges of cake.", "To make the buttercream icing, beat the butter until soft, then sift in the icing sugar and cocoa. Add the milk and combine together until soft. Spread half the icing over the cake up to the edges.", "Roll up as you would a Swiss roll: starting at the long side opposite you, use the paper to roll the cake towards you, around the icing; don't worry about the cracks. Transfer to a flat serving dish. Carefully spread the remaining icing over the cake (you can pipe the icing if you like). Chill until needed, then decorate with festive decorations and sift over some icing sugar.", "To make the cream filling, spread the inverted cake with the whipped cream, scatter over the berries and add a few dribbles of Drambuie, if you like. Carefully roll up as described above. Sift over icing sugar just before serving."]}, {"isVegetarian": true, "title": "Buckwheat and butternut cupcakes with tahini maple icing", "url": "www_bbc_co_uk_food_recipes_buckwheat_and_butternut_60078", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_and_butternut_60078_16x9.jpg", "ingredients": ["300g/10½oz cooked butternut squash", "140g/4¾oz buckwheat flour", "1 tbsp ground cinnamon", "4 tbsp coconut oil, melted", "4 tbsp maple syrup", "2 tsp vanilla extract", "1 tsp baking powder", "1 tbsp apple cider vinegar", "1½ tbsp maple syrup", "130g/4½oz coconut oil", "2 tbsp tahini", "2 tsp vanilla extract", "dried edible rose petals or grated vegan chocolate, to decorate"], "serves": "Makes 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a 12-hole cupcake tray with paper cases.", "Blend all of the cupcakes ingredients and 3 tablespoons water together in a food processor until smooth and well combined.", "Divide the batter equally among the cupcake cases (about 3 tablespoons per paper case). Bake for 18-20 minutes, or until a skewer inserted into the centre of the cupcakes comes out clean. Remove the cupcakes from the tin and set aside to cool on a wire rack until completely cold.", "Meanwhile, whip the icing ingredients together with an electric whisk until light and fluffy. Chill in the fridge until the cupcakes have cooled, then whip again.", "Transfer the tahini maple icing to a piping bag and ice the cupcakes. Sprinkle with the rose petals or grated vegan chocolate and serve."]}, {"isVegetarian": false, "title": "Buckwheat pancakes with smoked salmon and citrus cream cheese", "url": "www_bbc_co_uk_food_recipes_buckwheat_pancakes_with_39810", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_pancakes_with_39810_16x9.jpg", "ingredients": ["400ml/14fl oz dairy-free milk or apple juice", "125g/4½oz buckwheat flour", "40g/1½oz gram flour", "1 tbsp cornflour", "pinch salt", "200g/7oz soya or regular cream cheese ", "1 lemon, juice and zest", "rapeseed oil, for frying", "200g/7oz smoked salmon", "small bunch of chives, chopped", "25g/1oz pumpkin seeds, toasted", "1 tbsp caperberries, roughly chopped"], "serves": "Makes 8 pancakes", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Whisk together the dairy-free milk, flours, salt and 65ml/2¼fl oz water in a large bowl. Leave the mixture to rest for at least 1 hour.", "Meanwhile, mix the cream cheese, lemon juice and lemon zest together in a bowl.  Beat until smooth and creamy then store in the fridge until ready to use.", "Heat a 20-25cm/8-10in non-stick frying pan over a medium heat until hot. Brush lightly with oil and pour in a little of the batter, swirling it around so that it forms a thin layer on the bottom of the pan. If the batter isn’t thin enough you can add a little more liquid to the mixture.", "When the top of the pancake is dry (about 1 minute) flip the pancake and cook the other side for a further minute, the pancakes should colour just slightly.  Repeat with the remaining batter. You can keep the cooked pancakes warm by wrapping in foil and placing in a low temperature oven. ", "Spread a generous layer of cream cheese over the pancake and top with a slice of smoked salmon, chives, pumpkin seeds and caperberries. Roll the pancake to enclose the filling and serve. "]}, {"isVegetarian": true, "title": "Buckwheat pasta with potatoes and Swiss chard", "url": "www_bbc_co_uk_food_recipes_buckwheat_pasta_with_71440", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz pizzoccheri pasta (made usually with 1/3 Italian ‘00’ flour, 2/3 buckwheat flour)", "200g/7oz waxy potatoes, peeled and cut into small cubes", "200g/7oz Swiss chard, leaves only ", "salt and freshly ground black pepper", "80g/3oz unsalted butter", "3 garlic cloves, sliced", "300g/10½oz bitto or toma cheese, cut into small cubes", "100g/4oz parmesan (or a similar vegetarian hard cheese), freshly grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Put the pizzoccheri, potatoes and Swiss chard in a large saucepan and cover with lightly salted boiling water. Cook together until soft, about 14 minutes. ", "Meanwhile, melt the butter in a small frying pan and fry the garlic until cooked, but not brown. ", "Drain the pizzoccheri pasta, potatoes and chard and put in a large ovenproof dish. While still warm, mix in the cubes of cheese. Pour over the foaming butter and garlic and sprinkle over the parmesan. Season to taste with salt and pepper, then mix together well. ", "Bake in the oven for 20 minutes. Serve hot. "]}, {"isVegetarian": true, "title": "Triple chocolate buckwheat cookies", "url": "www_bbc_co_uk_food_recipes_buckwheat_triple_32460", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buckwheat_triple_32460_16x9.jpg", "ingredients": ["150g/5½oz dark chocolate chips", "125g/4½oz dark chocolate (minimum 70% cocoa solids)", "125g/4½oz buckwheat flour", "25g/1oz cocoa powder, sieved", "½ tsp bicarbonate of soda", "½ tsp fine sea salt", "60g/2¼oz soft unsalted butter", "125g/4½oz soft dark brown sugar", "1 tsp vanilla paste or extract", "2 large free-range eggs, fridge-cold"], "serves": "Makes approximately 25 cookies", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Clatter the chocolate chips out into a flattish dish and put this in the fridge while you get on with making the batter. It wouldn’t hurt to sit them in the freezer, either. I do this so that the chips don’t melt too much while baking, leaving you with nuggets of intense chocolatiness.", "Preheat the oven to 180C/160C Fan/Gas 4. Line a couple of baking sheets (or 1 if baking in 2 batches) with baking parchment.", "Roughly chop the dark chocolate, and melt it either in a suitable bowl in the microwave or over a pan of simmering water. Set aside to cool a little.", "In another bowl, mix together the buckwheat flour, cocoa, bicarb and salt, and fork to make sure everything’s well combined.", "In yet another bowl (I use my freestanding mixer here, but a bowl and a handheld whisk or, indeed, wooden spoon and elbow grease would work, too), cream together the butter and sugar with the vanilla extract until a dark caramel colour and fluffy, using a spatula to scrape down the sides of the bowl if necessary. Beat in the cooled, melted chocolate then the fridge-cold eggs (I find this means one doesn’t then have to refrigerate the dough before baking) one by one, and when both are absorbed into the butter and sugar mixture, scrape down the sides of the bowl again, turn the speed down and carefully beat in the dry ingredients.", "Using a wooden spoon or a spatula, fold in the cold chocolate chips, then dollop rounded tablespoonsful of the dough onto a lined baking sheet, leaving about 6cm/2½in between each one. Put the bowl with the remaining cookie dough in the fridge while the first batch is underway.", "Bake for 9–10 minutes, by which time the cookies will be just set at the edges, but otherwise seem undercooked, then remove the sheet from the oven and let the cookies sit on the warm tray for another 10 minutes before transferring them to a wire rack to cool.", "When the tray is cool, or you have another one lined and ready to go, take the bowl of dough out of the fridge and proceed as before."]}, {"isVegetarian": false, "title": "Buckwheat noodles with smoked salmon and dill", "url": "www_bbc_co_uk_food_recipes_buckwheatnoodleswith_77288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30ml/1fl oz olive oil", "100g/3½oz button mushrooms, finely sliced", "240ml/9fl oz dry white wine", "1 heaped tbsp fresh dill, chopped (can substitute for dried)", "a handful fresh chives, chopped", "300ml/10fl oz cream - cow, goat, soya or oat, depending on what you are able to eat ", "225g/8oz smoked salmon cut into thin matchsticks", "sea salt and freshly ground black pepper", "1 lemon, juice only", "350g/12oz buckwheat noodles"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wide pan and gently fry the mushrooms for 4 - 5 minutes; do not let them colour. ", "Add the wine, increase the heat and cook quickly for a further five minutes to reduce the wine. ", "Add the herbs and the cream, mix thoroughly, then add the salmon and reheat gently but do not boil. ", "Season to taste with sea salt, pepper and lemon juice. Cover, set aside and keep just warm.", "Cook the noodles in plenty of boiling, slightly salted water until there are just al dente, about 4-8 minutes depending on the variety. Drain and rinse thoroughly with boiling water. ", "Turn the pasta into a warmed serving dish and gently mix in the salmon sauce before serving."]}, {"isVegetarian": true, "title": "Gluten-free buckwheat pancakes", "url": "www_bbc_co_uk_food_recipes_buckwheatpancakebatt_74763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "225ml/8fl oz milk", "1 tsp salt", "¼ tsp sugar", "60g/2½oz rice flour", "2½ tbsp buckwheat flour", "1½ tsp vegetable oil", "2 small eggs, preferably free-range", "40ml/1½fl oz sparkling mineral water"], "serves": "Makes 12 x 18cm/7in pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a small pan. Add the milk, salt and sugar, stir well and turn off the heat. ", "Put both flours in a mixing bowl, make a well in the centre and pour in the vegetable oil and add the eggs. Mix the eggs and oil with a whisk, gradually bringing in flour from the sides until it begins to thicken. Add the milk mixture little by little until all has been incorporated and the batter is smooth. Finally, whisk in the water. ", "Pour the batter through a medium strainer into a bowl and refrigerate for at least two hours. (The resting time allows the batter to relax and the flour to absorb the liquids fully. Pancake batter may be made up to a day ahead and refrigerated.)", "To cook, heat a 15-18cm/6-7in frying pan. Add a very little oil. When the pan is hot, pour in just enough batter to cover the base of the pan. ", "Allow to cook on one side for 1-2 minutes, flip over onto the other side and continue to cook, until speckled and slightly golden. ", "Slide onto a plate and keep warm while you make the rest of the pancakes. You can stack one on top of the other as they can be peeled apart later but are best eaten fresh off the pan."]}, {"isVegetarian": true, "title": "Buckwheat pancakes", "url": "www_bbc_co_uk_food_recipes_buckwheatpancakes_80141", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275ml/9½fl oz skimmed milk", "1 free-range egg", "pinch salt", "1 tsp vegetable oil", "55g/2oz wholemeal flour", "55g/2oz buckwheat flour", "1 tsp vegetable oil, for cooking", "1 lemon, juice only", "1 orange, juice only"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the milk, egg, salt and oil into a large bowl and mix well.", "Sift the wholewheat and buckwheat flour into a separate bowl. ", "Add the mixed flour to the milk mixture gradually, stirring constantly until a smooth batter is formed. Allow the batter to rest for thirty minutes prior to cooking.", "Add teaspoon of oil to a hot pan, pour in an eighth of the mixture and cook for 1-2 minutes on each side, or until golden on each side. Remove from the pan and place between sheets of baking paper and keep warm while repeating the process with the remaining mixture to create eight pancakes.", "To serve, place a pancake onto a warmed plate and add a squeeze of fresh lemon and orange juice."]}, {"isVegetarian": false, "title": "Buffalo and ale pie", "url": "www_bbc_co_uk_food_recipes_buffalo_and_ale_pie_72032", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "pinch salt", "65g/2¼oz cold, unsalted butter, cut into 5-10mm/¼-½in cubes", "65g/2¼oz cold lard, cut into 5-10mm/¼-½in cubes", "1 tsp lemon juice", "2 tbsp plain flour", "1kg/2lb 4oz buffalo stewing steak, cut into 4-5cm/2in cubes", "1-2 tbsp vegetable oil", "25g/1oz unsalted butter", "12 shallots, peeled but left whole", "2 large carrots cut into 2cm/1in slices ", "2 tsp mushroom ketchup", "1 tbsp tomato purée", "300ml/10½fl oz ale or stout", "300ml/10½fl oz beef stock", "few sprigs thyme ", "1 tsp soft dark brown sugar", "salt and freshly ground black pepper", "1 free-range egg, beaten, for glazing"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the flaky pastry, combine the flour and salt in a large bowl. Put the butter and lard in a separate bowl, mixing them together loosely.", "Take one quarter of the mixed fats and rub them into the flour lightly with your fingertips. ", "Combine the lemon juice with 130ml/4fl oz water and mix lightly into the flour to form a very soft dough.", "Roll out the dough on a well-floured surface to a rectangle, about 10x30cm/4x12in.", "Take another quarter of the mixed fats and dot evenly over the top two-thirds of the pastry rectangle.", "Now fold the empty bottom third up and the top third down over it, as if folding a letter.", "Turn the dough 90 degrees and seal the edges by pressing down with your fingers.", "Roll out the dough and repeat the dotting and folding three times to use all of the fat.", "Wrap the dough in cling film and leave to chill in the fridge for at least 30 minutes before rolling out and using.", "To make the filling, put the flour in a large bowl and season it generously with salt and pepper. Toss the meat in the flour until evenly coated.", "Heat a tablespoon of oil and the butter in a flameproof casserole over a medium-high heat. Working in batches, brown the meat well all over, adding a dash more oil if you need to. Transfer the browned meat to a dish.", "Lower the heat under the pan, add a little more oil if necessary and add the shallots and carrots. Fry gently for a couple of minutes, until the shallots are just starting to soften. Return all the meat to the pan. Add the mushroom ketchup and tomato purée and cook for another two minutes.", "Pour in the ale and stock then add the thyme and sugar. Bring to the boil, then reduce the heat, cover with a lid and simmer gently for an hour or until the meat is very tender.", "Transfer the meat to a 1.5 litre/2½ pint pie dish and leave to cool completely. (If there is a lot of liquid, keep some of it back to serve as gravy).", "Preheat the oven to 200C/400F/Gas 6.", "On a floured surface, roll out the pastry to 3mm thickness (about the thickness of a £1 coin). ", "Cut off a 2cm/1in strip of pastry. Dampen the rim of the pie dish with water and press the pastry strip onto the rim. ", "Cut the remaining pastry a little larger than the pie dish. Sit a pie funnel in the centre of the filling. Press the lid over the top and crimp the edges. Trim away the excess pastry.", "Brush the pastry with beaten egg and make a steam hole exposing the funnel. Bake for 35-40 minutes until the pastry is crisp and golden-brown. Leave to settle for 10-15 minutes before serving."]}, {"isVegetarian": false, "title": "Buffalo chicken burgers", "url": "www_bbc_co_uk_food_recipes_buffalo_chicken_burgers_84771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalo_chicken_burgers_84771_16x9.jpg", "ingredients": ["30g/1oz butter ", "4 tbsp chilli sauce ", "1½ tsp white wine vinegar ", "2 tsp Worcestershire sauce ", "pinch each of celery salt, cayenne pepper and black pepper ", "½ tbsp barbecue sauce ", "2 drops smoke oil (optional)", "50ml/2fl oz buttermilk", "½ small red cabbage, shredded or grated ", "½ carrot, grated ", "½ red onion, thinly sliced ", "½ red chilli, finely chopped", "1 tbsp finely chopped coriander leaves", "1–2 heaped tbsp mayonnaise", "50g/1¾oz panko breadcrumbs ", "1½ tsp ground coriander ", "1½ tsp ground fennel seeds  ", "50g/1¾oz plain flour ", "1 free-range egg, lightly beaten", "2 chicken breasts (approximately 175g/6oz), butterflied", "1 tbsp sunflower oil", "4 pretzel buns, or similar, cut in half and toasted, to serve"], "serves": "Makes 4 burgers", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the buffalo sauce, mix together all the ingredients, except for the buttermilk, in a saucepan. Bring to a simmer and stir well. Allow to cool completely and add the buttermilk. Cover and leave in the fridge until ready to serve. ", "To make the slaw, mix together all the  ingredients until thoroughly combined. Cover and leave in the fridge until ready to serve.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To make the chicken, mix together the breadcrumbs, coriander and fennel seeds in a bowl. Put the flour and the beaten egg in separate bowls. Dredge each piece of chicken in the flour and shake off the excess. Dip the chicken in the egg and then cover with the seasoned breadcrumbs.", "Heat the oil in a frying pan and fry the chicken until golden-brown on both sides. Transfer to a baking tray and bake in the oven for 8–10 minutes or until the chicken is cooked through and there are no traces of pink.", "To serve, spoon a generous helping of the slaw onto the bottom  halves of the toasted buns. Spread a spoonful of the buffalo dressing over the cut sides of the top halves. Put the chicken on top of the slaw and add the top bun.  "]}, {"isVegetarian": false, "title": "Buffalo chicken wings with roast potato salad", "url": "www_bbc_co_uk_food_recipes_buffalo_chicken_wings_25720", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz waxy potatoes, washed and cut into chunks", "1 tbsp olive oil", "3 tbsp mayonnaise", "1 garlic clove, crushed", "½ lemon, juice only", "110g/4oz butter", "120ml/4fl oz hot chilli sauce", "½ tbsp Worcestershire sauce", "2 tsp paprika", "½ tsp cayenne pepper", "½ tsp sea salt", "½ tsp freshly ground black pepper", "sunflower oil, for frying", "100g/3½oz plain flour", "1.3kg/3lb chicken wings", "2 Little Gem lettuce, leaves separated", "12 celery sticks, sliced", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh parsley", "1 lemon, juice only", "1 tsp Dijon mustard", "3 tbsp olive oil"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the potatoes, preheat the oven 200C/180C Fan/Gas 6.", "Put the potatoes in an oven tray with some olive oil, salt and pepper. Mix well then roast for 45 minutes, or until the potatoes are golden-brown.", "When the potatoes are done, take them out of the oven and leave to cool for about 5 minutes.", "In a large bowl, make the dressing by mixing the mayonnaise, garlic and lemon juice, then season with sea salt and ground black pepper to taste. Add the potatoes and toss to coat.", "For the chicken wings, whisk the butter, hot chilli sauce, Worcestershire sauce, 1 teaspoon paprika, cayenne pepper and salt and black pepper together in a saucepan over a high heat. Bring to the boil, then reduce the heat and simmer for 5 minutes until slightly thickened.", "For the wings, heat 5cm/2in of sunflower oil in a large, deep casserole until it reaches 190C/375F (or until a small cube of bread sizzles and turns brown within 1 minute when added to the oil). ", "Season the flour with salt and pepper and mix through the remaining teaspoon of paprika. Dredge the chicken in the flour and fry the wings in batches in the hot oil for 15 minutes, or until cooked through, crisp and golden-brown. Remove from the oil using tongs and drain on a plate lined with kitchen paper. Place the chicken wings in a large bowl and toss with the sauce until completely coated.", "For the salad, mix the lettuce, celery and herbs in a large bowl. In a separate bowl whisk together all the dressing ingredients. Just before serving pour the dressing over the salad.", "To serve, place the chicken wings onto a serving plate and serve salad alongside, with the potatoes in a separate bowl."]}, {"isVegetarian": false, "title": "Buffalo wings", "url": "www_bbc_co_uk_food_recipes_buffalo_wings_09457", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalo_wings_09457_16x9.jpg", "ingredients": ["1kg/2lb 4oz chicken wings, tips removed and split into “drumettes” and “flats”", "vegetable oil, for deep frying", "a few celery sticks", "salt and freshly ground black pepper", "50g/1¾oz butter", "2 garlic cloves, crushed", "125ml/4fl oz hot sauce ", "1 tbsp cider vinegar", "1 tsp caster sugar", "100g/3½oz creamy blue cheese ", "1 small onion, very finely chopped", "100ml/3½fl oz buttermilk", "150ml/5fl oz crème fraîche", "1 tsp cider vinegar"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["If you have time, prepare the wings by sprinkling generously with salt. Lay out, on a rack in the fridge, cover and chill overnight – this will help them crisp when you fry them. An hour before you want to cook them, remove from the fridge to bring to room temperature and pat dry. ", "For the hot sauce, melt the butter in a small saucepan and add the garlic. Cook gently for a minute or two, then whisk in the hot sauce, vinegar and sugar. Season with salt and pepper.", "To make the blue cheese sauce, mash the cheese with the onion, buttermilk, crème fraîche and vinegar.", "Pour enough oil in a deep-fat fryer or large saucepan, to fill it no more than halfway. Heat the oil to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the wings in batches for around 10 minutes, then drain them of any excess oil. Raise the temperature of the oil to 190C and fry again, cooking for a further 2 minutes, until cooked through, very crisp and deep brown. Turn out on to kitchen paper.", "Put the wings in a bowl and smother them in the hot sauce. Serve them with the blue cheese sauce and celery sticks."]}, {"isVegetarian": true, "title": "Mozzarella bruschetta with shaved fennel and courgette", "url": "www_bbc_co_uk_food_recipes_buffalomozzarellabru_93627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buffalomozzarellabru_93627_16x9.jpg", "ingredients": ["½ small fennel bulb, herby tops reserved ", "1 small yellow courgette ", "small bunch fresh mint, torn into pieces ", "½ orange, skin removed, thinly sliced into rounds", "½ lemon, juice only", "3 tbsp extra virgin olive oil ", "sea salt and freshly ground black pepper ", "1 thick slice sourdough bread", "1 garlic clove, peeled, cut in half ", "125g/4½oz buffalo mozzarella"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Using a vegetable peeler, thinly shave the fennel and courgette into strips. Place into a bowl with the mint and half of the fennel tops.", "Add the orange slices and lemon juice and stir to combine.", "Drizzle in one tablespoon of the olive oil and season, to taste, with salt and freshly ground black pepper.", "Heat a griddle pan over a high heat until smoking hot.", "Toast the bread well on both sides for 2-3 minutes, or until scorched with griddle pan marks. Remove from the pan and place on a plate.", "Rub the chargrilled sourdough bread with the cut side of the garlic and drizzle over another tablespoon of olive oil.", "Tear the mozzarella in half and place onto the toasted bread.", "Pile the fennel and courgette salad on top, and drizzle over the remaining olive oil. Scatter over the reserved fennel tops."]}]