[{"isVegetarian": true, "title": "Herb risotto", "url": "www_bbc_co_uk_food_recipes_herbrisotto_85056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "250g/9oz basmati rice", "300ml/½ pint hot vegetable stock", "50g/1¾oz margarine", "handful each fresh dill, parsley, chervil, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan, add the onion and fry gently until softened. ", "Add the garlic and cook for one minute, then add the rice and stir well to coat the grains.", "Add a ladleful of hot stock to the pan and stir well until almost all of the stock has been absorbed. Repeat with the rest of the stock until all the stock has been absorbed and the rice is tender.", "Stir in the margarine and herbs, reserving some for the garnish, and season well with salt and freshly ground black pepper. ", "To serve, transfer the risotto to a bowl and garnish with the remaining herbs."]}, {"isVegetarian": false, "title": "Herb-stuffed chicken with crushed potatoes and red wine sauce", "url": "www_bbc_co_uk_food_recipes_herbstuffedchickenwi_86838", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 sprig fresh rosemary, chopped", "small handful fresh parsley, chopped", "½ garlic clove, chopped", "salt and freshly ground black pepper, to taste", "1 chicken drumstick", "dash olive oil", "10 new potatoes, peeled and halved", "¼ onion, finely diced", "2 tbsp butter", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper, to taste", "1 tbsp double cream", "dash olive oil", "55g/2oz cherry tomatoes", "3 tbsp red wine", "1 tbsp balsamic vinegar", "small handful broccoli, cut into florets, steamed, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, mix the herbs, garlic and seasoning together in a bowl then push the mixture under the skin of the chicken drumstick. ", "Heat a dash of olive oil in an ovenproof frying pan, add the chicken and fry for four minutes. Turn over and place in a hot oven for ten minutes, or until the juices are clear when you stick the tip of a knife into the chicken and it's completely cooked through.", "For the potatoes, boil the potatoes in salted boiling water for ten minutes or until soft. Drain well, add the onion, butter, chives, salt and freshly ground black pepper and double cream and mash until smooth.", "For the sauce, pour a splash of olive oil into a clean frying pan. Add the cherry tomatoes and fry for five minutes. Add the red wine and balsamic vinegar to the pan and simmer for one minute.", "To serve, pile the crushed potatoes onto a serving plate, top with the chicken drumstick and pour the red wine sauce over the top. Serve with the steamed broccoli."]}, {"isVegetarian": true, "title": "Herby cocktail", "url": "www_bbc_co_uk_food_recipes_herby_cocktail_97456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz caster sugar", "1 lemon, zest and juice", "6 lemon verbena leaves, lightly bruised, plus extra for serving", "1 tsp orange blossom water", "400ml/14fl oz soda water", "100ml/3½fl oz vodka", "ice"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["To make a sugar syrup, put the sugar, lemon zest and juice, and 200ml/7fl oz water  in a large saucepan placed on a medium-low heat. Warm until the sugar has dissolved.", "Mix together the sugar syrup, bruised verbena leaves, orange blossom water, soda water and vodka in a jug.", "Pour into glasses filled with ice and finish with lemon verbena leaves. "]}, {"isVegetarian": true, "title": "Herby puff twists and pepper and goats’ cheese palmiers", "url": "www_bbc_co_uk_food_recipes_herby_puff_twists_and_39016", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_puff_twists_and_39016_16x9.jpg", "ingredients": ["500g/1lb 2oz plain flour, plus extra for dusting ", "1 tsp fine sea salt", "50g/1¾oz butter, melted", "400g/14oz very cold unsalted butter ", "1 free-range egg, beaten, for egg wash ", "1 tbsp finely chopped fresh rosemary", "1 tbsp finely chopped fresh thyme", "1 tbsp finely chopped fresh sage", "50g/1¾oz fine breadcrumbs ", "freshly ground black pepper ", "½ unwaxed lemon, zest only", "100g/3½oz roasted red peppers from a jar, drained, finely chopped ", "140g/5oz hard goats' cheese, finely grated "], "serves": "Makes 25 of each variety", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, sift the flour into a large mixing bowl and make a well in the centre. Add the salt, 225ml/8fl oz ice-cold water and melted butter into the middle of the well. Using your fingertips, gradually stir the liquid and incorporate the flour. Once the mix has come together into a dough, knead it a few times firmly to bring it into a ball. Wrap it in cling film and chill for 10 minutes in the freezer.", "Remove the butter from the fridge and place it in between two sheets of greaseproof paper. Use a rolling pin to beat the butter block into a 19cm/7½ in square. Chill in the freezer for 10 minutes.", "Remove the dough from the freezer and tip onto a lightly floured surface. Roll out the dough into a diamond shape that is a bit larger than the size of the butter block. Place the butter in the centre of the dough (with the flat sides of the block facing the points of the diamond) and pull the flaps over the top and pinch to seal them.", "Roll the pastry away from you into a rectangle that is 75x30cm/30x12in. Move the pastry frequently to prevent sticking and work quickly to avoid heating the dough. ", "To make a letter turn, place the rolled out dough on the surface with the short side nearest to you. Pull the top third of dough down over the middle third then lift the bottom third over the folded portion, just like an A4 letter. Make sure the edges match up and are square. Dust off any excess flour with a pastry brush. Place the dough in a freezer bag and place in the freezer for 10 minutes. This is the first turn. Take note of the number of turns that has been performed at each stage.", "Repeat the rolling, folding and turning four more times to give five letter turns in total. Split the dough into two equal portions and refrigerate until ready to use.", "Preheat the oven to 210C/190C Fan/Gas 6½. Line two baking trays with baking paper. ", "For the herby puff twists, mix the herbs in a small bowl with the breadcrumbs, pepper and lemon zest and stir to combine. ", "Roll one piece of the pastry out on a lightly floured surface to roughly 40x30cm/16x12in with the short side nearest you. It should be the thickness of a pound coin. Brush egg wash over the pastry then liberally sprinkle the herb mix over the dough. Press the filling lightly into the dough all over using a rolling pin.", "Tightly roll the bottom two-thirds of the dough up like a Swiss roll so the filling is on the inside. For the last third, roll it underneath itself in the opposite direction so the filling is on the outside. ", "Place the roll onto a baking tray, slide into a large freezer bag and freeze for 10 minutes.", "Use a sharp knife to cut off any ragged ends then cut into 1cm/½in slices and lay them flat on one of the prepared trays, leaving at least 5cm/2in between each as they will spread during baking.", "Bake for 11 minutes, flip them over and bake for a further 11 minutes until golden-brown and puffed up. Transfer to a cooling rack. ", "For the pepper and goats’ cheese palmiers, roll one piece of the puff pastry out on a lightly floured surface to roughly 40x30cm/16x12in with the short side facing you. Spread the goats’ cheese and peppers over the pastry. Press the filling lightly into the dough all over using a lightly oiled rolling pin.", "Fold the bottom sixth of dough upwards and press down, then repeat this fold once more upward and you should be near the midpoint of the dough. Repeat this double fold for the top of the pastry coming down. Lightly brush some beaten egg along the top of the folded portions, then fold these together like a book. All the topping should be on the inside. ", "Place the roll onto a baking tray, slide into a large freezer bag and freeze for 10 minutes.", "Use a sharp knife to cut off any ragged ends then cut 1cm/½in slices and lay them flat on the preapred tray. Clean the knife using kitchen paper between each slice. Leave at least 5cm/2in between each as they will spread during baking.", "Bake for 11 minutes then flip and bake for a further 11 minutes until golden-brown and puffed up. Transfer to a cooling rack."]}, {"isVegetarian": false, "title": "Herby chicken and potato salad", "url": "www_bbc_co_uk_food_recipes_herby_skyr_chicken_salad_90551", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_skyr_chicken_salad_90551_16x9.jpg", "ingredients": ["2 skinless, boneless chicken breasts", "75g/2½oz plain skyr or Greek yoghurt", "1 tbsp olive oil, plus extra for cooking", "handful flat-leaf parsley, chopped ", "1 tsp ground ginger", "¼ lemon, juice only", "salt and freshly ground black pepper", "250g/9oz new potatoes", "1 courgette, grated", "1 large carrot, cut into ribbons using a vegetable peeler", "50g/1¾oz plain skyr or Greek yoghurt", "25ml/1fl oz olive oil", "1 tsp Dijon mustard", "1–1½ tsp cider vinegar", "½–1 tsp runny honey", "4 tbsp finely chopped fresh chives, plus extra for garnish"], "serves": "Serves 2–4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the marinated chicken, cut down the centre of each breast lengthways, being careful not to cut all the way through. Open each breast up like a book and flatten using the palm of your hand.", "Put the skyr or yoghurt, oil, parsley, ginger, lemon juice and some salt and pepper in a food processor and blend until smooth.", "Put the butterflied chicken breasts in a freezer bag and add the marinade, mixing well to cover the chicken. Seal and chill in the fridge.", "Meanwhile, to make the salad, boil the potatoes for 15 minutes, or until tender, and drain. Cover with cold water and set aside to cool.  ", "To make the dressing, whisk together the skyr or yoghurt, oil, mustard, 1 teaspoon of the vinegar and ½ teaspoon of the honey, along with a pinch of salt and pepper. If the mixture is a little thick, add a tablespoon of water at a time until the desired consistency is reached. Stir in the chives and adjust the seasoning, or add a little more vinegar and/or honey if needed.", "Halve the cooled potatoes and toss with a little of the dressing in a bowl, until coated. Put the courgette and carrot in a serving bowl and add dressed potatoes.", "Heat a dash of oil in a large, heavy-based frying pan over a medium–high heat. Shake off the excess marinade and cook the chicken, opened out, for 4 minutes on either side, or until cooked through. Reduce the heat if it is browning too much. ", "Slice the chicken and place on top of the salad. Drizzle over the rest of the dressing, garnish with more chopped chives and serve."]}, {"isVegetarian": false, "title": "Herby smoked salmon omelette", "url": "www_bbc_co_uk_food_recipes_herby_smoked_salmon_77028", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herby_smoked_salmon_77028_16x9.jpg", "ingredients": ["8 free-range large eggs", "2 spring onions, thinly sliced", "2 tbsp chopped chives", "2 tbsp chopped chervil", "20g/¾oz butter", "4 thin slices of smoked salmon, cut into thin strips, or 125g/4½oz smoked salmon trimmings", "100g/3½oz salad leaves", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the eggs, spring onions and herbs in a bowl, beat together lightly and season with freshly ground black pepper.", "Heat a medium-sized frying pan over a medium-low heat, add a quarter of the butter and melt until beginning to foam. Pour in a quarter of the egg mixture and swirl to cover the base of the pan. Stir gently for 2-3 minutes or until almost set.", "Sprinkle over a quarter of the smoked salmon strips and cook for a further 30 seconds, or until just set. Fold over and slide on to a serving plate. Repeat to make 3 more omelettes. Serve each omelette with salad leaves."]}, {"isVegetarian": true, "title": "Herby tabbouleh", "url": "www_bbc_co_uk_food_recipes_herby_tabbouleh_16740", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz bulgur wheat, soaked in cold water overnight", "3 tbsp roughly chopped mint ", "3 tbsp roughly chopped coriander", "2 tbsp chopped parsley", "½ red onion, finely chopped", "50g/1¾oz pistachio nuts, roughly chopped", "100g/3½oz fresh raspberries", "100g/3½oz dried apricots, roughly chopped", "1 pomegranate, seeds only", "1 lemon, juice only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the bulgur wheat well, pressing down lightly to ensure all the water is removed. Put in a large bowl.", "Add all the other ingredients and mix well. Season, to taste, with salt and pepper and serve. "]}, {"isVegetarian": true, "title": "Butternut squash tagine with couscous", "url": "www_bbc_co_uk_food_recipes_herbycouscouswithbut_92552", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herbycouscouswithbut_92552_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 onion, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "½ tsp cayenne pepper", "1 tsp ground ginger", "1 tsp ground coriander", "2 tsp ground cumin", "1 cinnamon stick", "1 tsp ground turmeric", "1 butternut squash, peeled, seeds removed, cut into 1cm/½in cubes", "200g/7oz tinned chopped tomatoes", "200ml/7fl oz vegetable stock", "3 preserved lemons, rind only, roughly chopped", "1 tbsp clear honey", "salt and freshly ground black pepper ", "400g/14oz couscous", "600ml/1 pint 2fl oz hot vegetable stock", "2 lemons, zest only", "100g/3½oz toasted flaked almonds", "1 tbsp each chopped fresh parsley, chives and coriander", "1 tbsp olive oil", "small handful coriander, to garnish "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the butternut squash tagine, heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the onion and fry for 4-5 minutes. Add the garlic and fry for a further 3-4 minutes, or until softened.", "Add the cayenne pepper, ground ginger, ground coriander, ground cumin, cinnamon stick and ground turmeric and stir well. Continue to cook for 3-4 minutes, or until the spices are fragrant. ", "Add the butternut squash cubes and stir well to coat the squash in the spices.", "Add the chopped tomatoes, stock, preserved lemons and honey, then season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer and cook for 10 minutes, or until the butternut squash is tender but still holds its shape.", "Meanwhile, for the herby couscous, place the couscous into a large bowl and pour over the hot chicken stock. Cover the bowl with cling film and set aside until the couscous has absorbed all of the stock, about three minutes. ", "Fluff up the couscous using a fork, then stir in the lemon zest, flaked almonds, chopped herbs and olive oil until well combined. ", "Serve the couscous with the tagine on top and a little chopped coriander to garnish."]}, {"isVegetarian": false, "title": "Herb-crusted cod loin with sautéed potatoes", "url": "www_bbc_co_uk_food_recipes_herbycrustedcodloinw_86860", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz potatoes, peeled and cut into cubes", "1 tbsp olive oil", "1 sprig fresh rosemary", "small handful fresh flatleaf parsley", "small handful fresh coriander", "2 slices white bread", "1 tbsp olive oil", "150g/5½oz cod loin"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the potatoes, bring a pot of salted water to the boil, add the potatoes and simmer for five minutes. Drain.", "Heat the olive oil in a small non-stick frying pan and sauté the potatoes with the rosemary for ten minutes, or until golden and tender.", "For the fish, place the herbs and bread into a small food processor and pulse to make breadcrumbs. Roll the fish in the crumbs to coat well.", "Heat the olive oil in a small non-stick ovenproof frying pan and fry the fish for two minutes on each side, or until crisp and golden.  ", "Transfer to the oven for a further 4-5 minutes, or until cooked through.", "Serve the fish on top of the sauteéd potatoes."]}, {"isVegetarian": true, "title": "Heritage carrots, goats’ curd, oats and hazelnuts", "url": "www_bbc_co_uk_food_recipes_heritage_carrots_goats_73817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100ml/3½fl oz white wine vinegar", "50g/1¾oz caster sugar", "1 tbsp chopped fresh tarragon leaves", "10 coriander seeds", "1 star anise", "1 bunch yellow heritage carrots", "100g/3½oz oats, sieved", "50g/1¾oz blanched hazelnuts, roughly chopped, plus 4 hazelnuts, grated, for garnish", "1 tbsp grape seed oil", "1 bunch orange heritage carrots, leaves reserved", "2 tbsp olive oil", "1 tsp salt", "1 tbsp chopped fresh thyme leaves", "100ml/3½fl oz carrot juice", "30g/1oz butter", "60g/2¼oz cream", "300g/11oz goats’ curd, mixed with a little milk ", "nasturtium leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pickled carrots, put the vinegar, sugar, tarragon, coriander seeds and star anise in a medium saucepan with 50ml/2fl oz water and heat until the sugar has melted.", "Heat a large saucepan of boiling water and blanch the yellow carrots until cooked but still with a little crunch. Place in iced water, drain, then put them into the pickling solution.", "For the oats and hazelnuts, preheat the oven to 150C/300F/Gas 2.", "Spread the oats and chopped hazelnuts out on a large baking tray and drizzle over the grape seed oil. Roast for 10-15 minutes, or until golden-brown, then set aside.", "Increase the oven temperature to 170C/340F/Gas 3½.", "Place the orange carrots on a separate baking tray, drizzle with the oil and sprinkle over the salt and thyme. Roast for 20-25 minutes.", "Meanwhile, heat the carrot juice in a pan until reduced in volume to a sticky consistency.", "Heat the butter and cream in a separate large saucepan and whisk continually. Reduce it in volume and cook until it turns a toffee brown colour. Add it to the reduced carrot juice.", "Drain the pickled carrots from the pickling liquid.", "Serve the goat’s curd, pickled carrots, roasted carrots, oats, nuts, carrot leaves and nasturtium leaves dressed with the carrot juice and garnished with the grated hazelnuts."]}, {"isVegetarian": true, "title": "Herby salad dressing", "url": "www_bbc_co_uk_food_recipes_herbysaladdressing_67766", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz water", "200ml/7fl oz olive oil", "55ml/2fl oz tarragon vinegar", "1 sprig thyme", "1 bay leaf", "1 garlic clove"], "serves": "Makes 400ml/14fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the ingredients together and leave to infuse at room temperature for 1-2 days before using."]}, {"isVegetarian": true, "title": "Heritage tomato and mozzarella salad", "url": "www_bbc_co_uk_food_recipes_heritage_tomato_and_03417", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.2kg/2lb 7oz heritage tomatoes (Marmande, Coeur de Boeuf, Darby Striped Yellow/Green and Black Russian) ", "1 Rose de Roscoff onion, cut into 3mm slices ", "20 basil leaves, roughly chopped ", "3 tbsp finely chopped chives ", "1 garlic clove, chopped ", "2 tbsp white wine vinegar ", "6 tbsp extra virgin olive oil ", "sea salt and freshly ground black pepper ", "1 head Freckles lettuce, leaves picked ", "1 head Seurat lettuce, leaves picked ", "1 head Lollo Rosso lettuce, leaves picked ", "1 head Reine des Glaces lettuce, leaves picked ", "1 tbsp white wine vinegar ", "2 tbsp extra virgin olive oil, plus a little extra to finish ", "3 x 120g/4¼oz buffalo mozzarella ", "50g/1¾oz Kalamata olives, pitted, dried in the oven for 1 hour at 100C/90C Fan/Gas ¼, finely chopped"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomatoes, using a small paring knife, cut the hard core out of each tomato, then cut each into quarters. Transfer to a large bowl. Season with a pinch each of salt and pepper. Stir so the seasoning lightly cures the tomatoes, which will then produce a beautiful juice. Mix in the onion, herbs, garlic, vinegar and oil. Stir and leave to marinate for a minimum of 10 minutes for the flavours to infuse. ", "For the salad, at the last moment, mix the leaves in a large bowl. Season with a pinch each of salt and pepper, then toss the leaves with the vinegar and olive oil. ", "Arrange the leaves on a large platter. With a large spoon, lift the tomato mixture onto the salad. Cut the mozzarella in half and scatter around the salad. Sprinkle over the dried olives and finish with a drizzle of your best extra virgin olive oil. "]}, {"isVegetarian": true, "title": "Herby rice", "url": "www_bbc_co_uk_food_recipes_herbyrice_75769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz rice, cooked", "2 tsp soy sauce", "handful fresh coriander, chopped", "1 lime, juice and zest"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix together all the ingredients and serve."]}, {"isVegetarian": true, "title": "Herby noodle tortilla with chilli peanut dressing", "url": "www_bbc_co_uk_food_recipes_herbynoodletortillaw_87403", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs", "salt and freshly ground black pepper", "small handful each fresh basil, fresh coriander, fresh parsley, chopped", "150g/5½oz fresh egg noodles", "25g/1oz butter", "dash olive oil", "dash olive oil", "¼ onion, sliced", "1 garlic clove, peeled and chopped", "½ fresh red chilli, finely sliced", "1 tsp white wine vinegar", "3 tbsp soy sauce", "2 tbsp edamame beans", "1 tbsp chopped cashews"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tortilla, crack the eggs into a bowl, season with salt and freshly ground black pepper and beat well. Stir in the herbs and egg noodles. ", "Heat the butter and oil in a medium frying pan, add the egg and noodle mixture and cook for about 3-4 minutes, or until just set. Slide onto a plate and leave to cool slightly before slicing.", "For the dressing, heat the oil in a small saucepan, add the onion and sauté for 3-4 minutes. Add the garlic and cook for a further 1-2 minutes. Add the rest of the ingredients and warm through for 1-2 minutes. ", "To serve, place slices of the tortilla onto a serving plate and drizzle over the dressing."]}, {"isVegetarian": true, "title": "Heritage tomato tart with blow-torched tomato salad", "url": "www_bbc_co_uk_food_recipes_heritage_tomato_tart_49741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz ready-made all-butter puff pastry", "plain flour, for dusting", "1 free-range egg yolk, beaten", "200g/7oz Gruyère, grated", "400g/14oz mixed heritage tomatoes, thickly sliced", "4 sprigs fresh thyme, leaves only", "1 tbsp rapeseed oil", "salt and freshly ground black pepper", "300g/10½oz heritage tomatoes", "1 red onion, thickly sliced", "2 heads Romaine lettuce, roots removed, cut into thick slices", "4 tbsp vegetable oil", "1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "1 egg yolk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomato tart, preheat the oven to 210C/190C Fan/Gas 7.", "Roll out the pastry on a lightly floured work surface to form a large square about 3mm thick.", "Cut 4 x 17.5cm/7in circles from the pastry using an upturned bowl or cake tin. Transfer each to a baking tray. ", "Using a sharp knife, score a 1.5cm/½in border around the edge of each pastry circle. Brush each border with a little of the egg yolk.", "Pile a quarter of the grated Gruyère in the centre of each pastry circle. Arrange the tomato slices in concentric circles on top of the cheese. Season, to taste, with salt and freshly ground black pepper, then scatter over the thyme leaves and drizzle with a little rapeseed oil.", "Bake the tarts in the oven for 12-15 minutes, or until the pastry borders have risen and are golden-brown and the filling is bubbling. ", "Meanwhile, for the tomato salad, lay the tomatoes, red onion and lettuce on a roasting tray and drizzle over a little of the vegetable oil. Mix well to coat everything in the oil. ", "Place the roasting tray onto a heatproof surface and, using a chefs' blow torch, char until caramelised – this should take 4-5 minutes. Alternatively, preheat your grill to its highest setting and grill the vegetables for 4-5 minutes.", "Shake the vinegar, mustard, egg yolk and the remaining vegetable oil in a clean, sealed jam jar until well combined, then season, to taste, with salt and freshly ground black pepper. ", "To serve, place a tart on each serving plate. Transfer the blow-torched vegetables to a large bowl and drizzle over enough of the dressing to coat the leaves. Mix the salad to coat it in the dressing, then serve."]}, {"isVegetarian": false, "title": "Herring in oats with potato salad", "url": "www_bbc_co_uk_food_recipes_herring_in_oats_with_84871", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz small new potatoes", "50g/2oz kale, very coarsely chopped", "¼ cucumber, cut in half lengthways, seeds scooped out with a spoon, thickly sliced", "1-2 spring onions, trimmed and sliced", "1 tbsp white balsamic vinegar", "2 tbsp cold-pressed rapeseed oil", "squeeze lemon juice", "salt and freshly ground black pepper", "2 handfuls ‘medium’ oatmeal ", "salt and freshly ground black pepper", "6 herring fillets, scales and central line of bones removed (ask your fishmonger to do this for you)", "dollop English mustard", "30g/1¼oz butter", "splash rapeseed oil", "lemon wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the potato salad, boil the new potatoes in a large saucepan of salted water until tender (about 12 minutes). Add the kale and cucumber to the pan three minutes before the potatoes are ready and boil until all of the ingredients are tender. Drain well and set aside.", "For the dressing, whisk together the vinegar, rapeseed oil and lemon juice in a jug until well combined. Season, to taste, with salt and freshly ground black pepper. Set aside.", "For the herring, sprinkle the oatmeal onto a plate and season with salt and freshly ground black pepper.", "Brush both sides of each herring fillet with a little of the mustard, then roll in the seasoned oatmeal until completely covered. ", "Heat the butter and the oil in a large, heavy-based frying pan over a medium heat. Add the coated herring fillets to the pan, skin-side up (do this in batches if necessary). Gently press down on each of the herring fillets using a fish slice so that they stay flat. Fry for 1-2 minutes, or until the oats are golden-brown, then turn over and continue to fry on the other side for a further 1-2 minutes, or until the herrings are cooked through and the oats are golden-brown. ", "Remove the herring fillets from the pan using a slotted spoon and set aside to drain on kitchen paper. ", "Place the boiled potatoes, kale and cucumber into a serving bowl, stir in the spring onions, and drizzle over the dressing. Mix well and season, to taste, with salt and freshly ground black pepper.", "To serve, divide the herring equally between two serving plates. Spoon the potato salad alongside and serve with a wedge of lemon."]}, {"isVegetarian": true, "title": "Hot chocolate and cherry fondants", "url": "www_bbc_co_uk_food_recipes_hhh_87203", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter, plus extra for greasing", "100g/3½oz caster sugar", "1 tsp baking powder", "100g/3½oz cocoa powder", "200g/7oz self-raising flour", "8 cherries, stones removed, plus 4 extra cherries to garnish", "100g/3½oz cocoa powder", "150ml/¼ pint water", "2 tbsp caster sugar", "2 tbsp double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grease the insides of two 7.5cm/3in chefs' rings with butter and lay on a baking sheet lined with non-stick babking paper.", "Place the butter, sugar, baking powder, cocoa and flour into a food processor and blend until completely combined.", "Add the eight cherries and stir well with a wooden spoon. ", "Divide the mixture between the two chefs' rings, then transfer to the oven to bake for 10-12 minutes, or until risen and cooked through.", "For the sauce, heat the cocoa powder, water and sugar in a pan until the sugar has dissolved and the sauce is glossy and smooth.", "To serve, transfer the fondants to dessert plates and remove the rings.", "Pour over the chocolate sauce and drizzle a tablespoon of cream over each and garnish with two extra cherries."]}, {"isVegetarian": false, "title": "Herring with dill and mustard potato salad", "url": "www_bbc_co_uk_food_recipes_herringwithdillandmu_88218", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/herringwithdillandmu_88218_16x9.jpg", "ingredients": ["100ml/3½fl oz water", "2 limes, juice only", "100ml/3½fl oz white wine", "1 tsp white peppercorns", "2 bay leaves", "1 tbsp white wine vinegar", "1 tsp salt", "4 x 100g/3½oz herring fillets ", "250g/9oz cooked new potatoes", "100ml/3½fl oz mayonnaise ", "1 tbsp chopped fresh dill", "1 tbsp wholegrain mustard", "½ lemon, juice only", "½ tsp curry paste", "salt and freshly ground black pepper", "few sprigs fresh dill", "lemon wedges"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the herring, bring the water, lime juice, white wine, peppercorns, bay leaves, white wine vinegar and salt to a slow boil in a pan. Turn down the heat to a gentle simmer, add the fish and poach for about 12 minutes, or until cooked through.", "For the potato salad, cut the cooked potatoes in half and place into a large bowl.", "In another bowl, combine the mayonnaise, dill, mustard, lemon juice, curry paste, salt and freshly ground black pepper. Add to the bowl with the potatoes and stir to coat. ", "Drain the fish, then place it on top of the potato salad. Garnish with more dill and lemon wedges."]}, {"isVegetarian": false, "title": "Hidden vegetables shepherd’s pie", "url": "www_bbc_co_uk_food_recipes_hidden_vegetables_05418", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hidden_vegetables_05418_16x9.jpg", "ingredients": ["1 onion, finely chopped", "400g/14oz lamb mince", "2 tbsp plain flour", "2 carrots (approximately 100g/3½oz each), peeled, finely grated", "2 courgettes (approximately 175g/6oz each), peeled, finely grated", "400g tin chopped tomatoes", "2 tbsp tomato purée", "200ml/7fl oz just-boiled water", "½ tsp dried mixed herbs", "1 lamb stock cube", "salt and freshly ground black pepper", "800g/1lb 12oz floury potatoes, peeled, chopped into cubes", "50g/2oz butter", "4 tbsp milk", "100g/3½oz mature Cheddar, coarsely grated", "1 small cauliflower (approximately 650g/1lb 7oz), trimmed, stalk removed, finely grated"], "serves": "Serves 5-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Heat a large, non-stick saucepan over a medium heat. Add the onion and mince and dry-fry for 8-10 minutes, stirring regularly until the mince has browned.", "Sprinkle the flour over the lamb and stir well. Add the carrots, courgettes, tomatoes, tomato purée, water and herbs and stir again to combine. Crumble over the stock cube, season with salt and pepper. ", "Bring to the boil, then simmer for 25-30 minutes, stirring regularly, until the sauce has thickened and the vegetables have almost completely broken down. ", "Meanwhile, bring a saucepan of water to the boil.  Add the potatoes and cook for 15-20 minutes, or until soft but not falling apart.", "Transfer the filling mixture to a 2 litre/3½ pint shallow ovenproof dish and place on a baking tray.", "Drain the potatoes and return to the pan. Add the butter and mash until smooth, then beat in the milk until fluffy. Stir in half of the cheese. Mix in the cauliflower and season with salt and pepper. Add a little extra milk if required. ", "Spoon the mash on top of the lamb and spread evenly. Sprinkle over the remaining cheese. Bake for 25-30 minutes, or until the cheese has melted and turned golden-brown and the filling is bubbling. "]}, {"isVegetarian": false, "title": "Highland beef salad", "url": "www_bbc_co_uk_food_recipes_highland_beef_salad_45037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/highland_beef_salad_45037_16x9.jpg", "ingredients": ["1 x 300g/10½oz sirloin or fillet steak ", "salt and freshly ground black pepper", "25ml/1fl oz rapeseed oil", "1 red chilli, finely chopped", "1 tbsp palm sugar", "2 garlic cloves, sliced", "2 tbsp fresh coriander, plus extra for the salad", "2 tbsp fresh mint", "1 tsp fish sauce", "1 tbsp soy sauce", "1 lime, juice and zest", "1 round lettuce", "50g/1¾oz sugar-snap peas, halved", "6 radishes, sliced"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue or griddle pan to hot.", "Season the steak with lots of black pepper, drizzle with oil and place onto a hot barbecue or griddle pan for five minutes, turning half-way through.", "To make the dressing, put the chilli, palm sugar, garlic and a teaspoon of salt into a pestle and mortar. Grind for 1-2 minutes, then add the coriander and mint and grind for another minute. Mix in the fish sauce, soy sauce, lime juice and zest.", "Cut the lettuce into six wedges and place in a bowl. Top with the sugar-snap peas, radishes and a few coriander leaves. Pour the dressing over the salad and toss to coat. Slice the beef and lay it on top of the salad."]}, {"isVegetarian": true, "title": "Hide-and-seek cheesecake", "url": "www_bbc_co_uk_food_recipes_hide-and-seek_cheesecake_00243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 digestive biscuits", "20g/¾oz butter, melted", "12-16 fresh raspberries, plus extra to garnish", "125g/4½oz soft cream cheese", "1 free-range egg, beaten", "½ tsp vanilla extract", "30g/1¼oz caster sugar"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the biscuits into a food bag and lightly bash with a rolling pin until they resemble breadcrumbs.", "Mix together the crushed biscuits and melted butter until well combined.", "Divide the mixture equally among four ramekins, pressing each portion down into an even layer at the base using your fingertips. ", "Divide the raspberries equally among the ramekins, putting them on top of the biscuit base. ", "Whisk together the cream cheese, beaten egg, vanilla extract and sugar until smooth and well combined.", "Spoon the cream cheese mixture into the ramekins, smoothing the tops of each with a palette knife. Transfer the ramekins to a baking tray.", "Bake the cheesecakes in the oven for 18-20 minutes, or until the tops are light golden-brown and the cheese mixture is just set in the middle, with a slight wobble.", "To serve, place the ramekins onto dessert plates and garnish with fresh raspberries."]}, {"isVegetarian": false, "title": "Hoisin salmon with broccoli and noodles", "url": "www_bbc_co_uk_food_recipes_hoisin_salmon_with_44468", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hoisin_salmon_with_44468_16x9.jpg", "ingredients": ["4 x 125g/4oz salmon fillets, with skin left on", "2 heaped tbsp hoisin sauce (from a jar or bottle)", "150g/5½oz cherry tomatoes, halved", "140g/5oz medium egg noodles", "200g/7oz long-stemmed broccoli, trimmed ", "freshly ground black pepper", "dark soy sauce, to serve (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7 and line a small, shallow ovenproof dish with kitchen foil. ", "Place the salmon fillets into the dish, skin-side down, and brush generously with the hoisin sauce. Make sure the fillets are placed at least 5cm/2in apart from each other. Scatter the cherry tomatoes around them. Cook for 15 minutes, or until the salmon is cooked through. ", "Meanwhile, prepare the noodles. Half-fill a saucepan with water and bring to the boil. Add the noodles, return to the boil and cook for 1 minute, stirring to separate the strands. Add the broccoli and cook for 3 more minutes, stirring occasionally.", "Divide the noodles and broccoli between four warmed plates. Top with the salmon fillets and scatter with the cherry tomatoes. Season with pepper and serve sprinkled with a little soy sauce, if using.  "]}, {"isVegetarian": false, "title": "Hoi An crispy beef", "url": "www_bbc_co_uk_food_recipes_hoiancrispybeef_81504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs, beaten", "1 tbsp sesame oil", "1 tsp palm sugar", "2 tsp galangal, sliced into strips", "1 tbsp root ginger, sliced into strips", "3 tsp sesame seeds", "1 tbsp fish sauce", "1 tsp rice wine or sake", "1 tsp freshly ground black pepper", "500g/1lb 2oz beef fillet, thinly sliced across the grain", "sunflower oil or groundnut oil, for deep frying", "cornflour, for coating"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Mix all the marinade ingredients together in a bowl and add the sliced beef. Marinate for as long as you can or overnight if possible.", "For the beef, heat the oil in a deep, heavy-bottomed pan. It is ready when a breadcrumb that is dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Dip the beef in the cornflour, then add to the oil and fry until slightly golden. Don't be tempted to put lots of beef into the oil at once, but cook in batches. Remove with a slotted spoon and drain on kitchen towel. Serve immediately."]}, {"isVegetarian": false, "title": "Hoisin and plum-glazed ham with lemon potato salad", "url": "www_bbc_co_uk_food_recipes_hoisinandplumglazedh_84880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3kg/4lb 4oz - 6lb 6oz easy-carve ready-cooked ham leg", "15-20 whole star anise, to decorate", "125ml/4½fl oz hoisin sauce", "125ml/4½fl oz plum sauce", "60ml/2½fl oz Chinese rice wine", "60ml/2½fl oz soy sauce", "60g/2½oz soft brown sugar", "1 tsp Chinese five-spice powder", "750g/1lb 10oz waxy potatoes (such as kipfler), peeled and sliced", "1 tsp sea salt", "75ml/3fl oz extra virgin olive oil", "125ml/4½fl oz lemon juice", "1 tbsp sumac (available in Middle Eastern grocers)", "salt and freshly ground black pepper ", "1 lime, juice only", "1 small green pepper, seeds removed, finely chopped", "2 large red chillies, seeded, finely chopped", "1 small bunch fresh mint, roughly chopped", "1 large bunch fresh flatleaf parsley leaves", "6 spring onions, finely sliced"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/355F/Gas 4.", "Using a small sharp knife, cut through the rind around the shank of the ham. Carefully lift the rind from the fat in one piece, running your fingers through where the rind and fat are joined to ease away. Reserve the rind and use to cover the cut ham when storing.", "Score the white fat in a diamond pattern and press star anise into the centre of every second or third scored diamond.", "Place the ham on a rack over a roasting tray, then pour a small amount of water into the base of the roasting tray to prevent the glaze from burning.", "Place the remaining ham ingredients into a saucepan over low heat, stirring until the sugar has completely dissolved.", "Remove the glaze mixture from the heat and carefully pour over the ham making sure that all of the exposed fat is covered.  ", "Transfer the ham to the oven to bake for 30-40 minutes, basting occasionally, until the ham is golden all over. ", "Remove the ham from the oven and place it onto a large platter ready to carve.", "For the lemon potato salad, bring a large saucepan of water to the boil then add the potatoes and salt. Reduce the heat and simmer for about 8-10 minutes, until the potatoes are tender when pierced with a knife. Remember to undercook the potatoes a little, because they will continue cooking in their own heat and steam when removed from the water.", "Place the olive oil, lemon juice and sumac into a bowl, stir to combine and season, to taste, with salt and freshly ground black pepper. ", "Pour half of the sumac dressing over the hot potatoes and stir very gently. Leave to cool, then add the capsicum, chilli, mint, parsley, spring onion and remaining dressing and stir gently to combine.", "To serve, place several slices of ham onto each plate with a large spoonful of potato salad alongside."]}, {"isVegetarian": true, "title": "Hollandaise sauce", "url": "www_bbc_co_uk_food_recipes_hollandaisesauce_1309", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollandaisesauce_1309_16x9.jpg", "ingredients": ["3 tbsp white wine vinegar", "6 peppercorns", "1 dried bay leaf", "2 eggs, yolks only", "125g/4oz butter", "lemon juice, salt and pepper to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the vinegar in a small pan with the peppercorns and bay leaf. Reduce the vinegar over a high heat until there is only 1 tbsp left. Strain the peppercorns and the bay leaf from this reduction.", "Put the egg yolks in a food processor with the vinegar reduction.", "Gently melt the butter so that the butter solids fall to the bottom of the saucepan.", "Turn the food processor on and slowly pour the butter on to the egg yolks with the motor still running. The sauce will start to thicken. When only the butter solids are left, stop.", "If the sauce is too thick, add a little hot water.", "Season to taste with salt and pepper and a little lemon juice."]}]