[{"isVegetarian": true, "title": "American baked cheesecake", "url": "www_bbc_co_uk_food_recipes_americanbakedcheesec_8358", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanbakedcheesec_8358_16x9.jpg", "ingredients": ["25cm/10in sponge (cut from a large bought flan case)", "200g/7oz caster sugar ", "finely grated zest of 3 lemons ", "4 tbsp cornflour ", "3 tbsp sultanas, soaked in a bit of bourbon ", "845g/29¾oz full fat soft cream cheese ", "3 medium eggs ", "7.5ml/1½ tsp vanilla essence ", "1 vanilla pod ", "Jack Daniels to taste or bourbon (optional) ", "375ml/12½fl oz double or single cream ", "10 small bananas ", "25g/1oz butter ", "2 tbsp sugar ", "caramel sauce or maple syrup ", "sprig of mint or basil"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Butter a 25cm/10in loose-bottomed cake tin. ", "Cut the sponge horizontally into 2 discs. Use one to line a buttered cake tin. ", "In a bowl mix together the sugar, lemon zest, cornflour and sultanas using a wooden spoon, then beat in the cream cheese. Add the eggs one by one, also add the vanilla essence, beating constantly until all the eggs are well incorporated. ", "Slice open the vanilla pod, remove the seeds with a sharp knife and place the seeds into the cream mixture, add a splash of bourbon (about 4 tbsp), if using, and mix everything together well. Add the cream and beat well until the mixture is smooth. Pour gently over the sponge base in the cake tin. ", "Sit the tin in a baking tray filled with 2-3mm of warm water to help create steam during cooking. Place into the preheated oven and bake for 50 minutes until the top is golden. Remove from the oven and leave to cool and set completely before removing from the tin. ", "Just before serving, peel the bananas and pan fry in the butter and sugar until brown and slightly caramelised. ", "Serve, cut into wedges, with the bananas and a drizzle of caramel sauce or maple syrup."]}, {"isVegetarian": true, "title": "Chocolate ripple cheesecake", "url": "www_bbc_co_uk_food_recipes_americanchocolaterip_6334", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanchocolaterip_6334_16x9.jpg", "ingredients": ["100g/4oz plain chocolate digestive biscuits, crushed", "50g/2oz butter, melted", "150g/5oz plain chocolate, broken into pieces", "700g/1½lb full-fat soft cheese", "225g/8oz caster sugar", "½ tsp vanilla esence", "2 size 2 eggs"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/325F/Gas 3. Lightly grease a 20cm/8in loose-bottomed cake tin or spring release tin.", "Mix together the ingredients for the base and press into the prepared tin.", "For the cheesecake filling, melt the chocolate in a bowl over a pan of hot water. Cool slightly.", "Measure the cheese into a large bowl and beat until soft. Add the sugar and beat again until well mixed. Beat in the vanilla essence and then the eggs, one at a time. Spoon half the cheese mixture on to the biscuit crust, separating the spoonfuls. Add the melted chocolate to the remaining cheesecake mixture and stir well to mix. Spoon this mixture in between the cheesecake mixture already in the tin. Swirl the top to give a marbled effect.", "Bake the cheesecake in the preheated oven for about 30 minutes or until the cheesecake becomes puffy around the edges but it still very soft in the centre. Turn off the oven but leave the cheesecake in the oven to cool.", "Chill well and then loosen the cheesecake from the sides of the tin using a small palette knife. Serve well chilled."]}, {"isVegetarian": false, "title": "Gluten-free American buttermilk pancakes", "url": "www_bbc_co_uk_food_recipes_americanbuttermilkpa_74762", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/americanbuttermilkpa_74762_16x9.jpg", "ingredients": ["175ml/6fl oz buttermilk", "1 egg, preferably free-range", "15g/½oz butter, melted", "50g/2oz tapioca flour", "25g/1oz fine cornmeal", "good pinch of salt", "1 tsp bicarbonate of soda", "clarified butter", "butter", "crispy bacon", "maple syrup"], "serves": "Makes 14-15 x 7cm/3in pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the buttermilk, egg and melted butter in a large bowl, until smooth and blended. Sift together the tapioca flour, fine cornmeal, salt and bicarbonate of soda and gently stir into the buttermilk only until the ingredients are moistened - don't worry about the lumps. ", "Heat a heavy iron or non-stick pan until medium hot. Grease with a little clarified butter. Spoon one generous tablespoon of batter onto the pan and spread slightly with the back of the spoon. ", "Cook until the bubbles rise and break on the top of the pancake.  Flip over gently. Cook until pale golden on the other side. Remove and keep warm. Continue until all the batter has been used. ", "Spread each pancake with butter and serve a stack of three per person with crispy bacon and maple syrup."]}, {"isVegetarian": false, "title": "American-style pancakes with bacon and maple syrup", "url": "www_bbc_co_uk_food_recipes_americanpancakeswith_86498", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz plain flour", "1 tsp baking powder", "25g/1oz caster sugar", "2 free-range eggs, separated", "250ml/9fl oz milk", "25g/1oz butter", "12 rashers maple-cured back bacon", "maple syrup, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the flour, baking powder and caster sugar into a bowl and stir to combine.", "Add the egg yolks and milk to the bowl with the dry ingredients and whisk to make a smooth batter.", "In a separate clean bowl, whisk the egg whites until soft peaks form when the whisk is removed, then fold into the batter.", "Heat a large frying pan until hot, add the butter and heat until melted and foaming. Place ladlefuls of the batter into the pan and cook for 1-2 minutes, or until bubbles start to form on top of the batter. Turn the pancakes over using a spatula and cook for a further minute on the other side. Remove from the pan and keep warm until ready to serve. Repeat the process with the remaining batter.", "Meanwhile, heat a frying pan until hot, add the bacon and cook for two minutes on each side, or until crisp. Remove from the pan and drain on kitchen paper.", "To serve, divide the pancakes among four serving plates, top with the bacon and drizzle with maple syrup."]}, {"isVegetarian": true, "title": "Anardana chana (pomegranate and chickpea curry)", "url": "www_bbc_co_uk_food_recipes_anardana_channa_chickpea_14037", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anardana_channa_chickpea_14037_16x9.jpg", "ingredients": ["200g/7oz dried chickpeas, soaked in water overnight", "100g/3½oz chana dal, soaked in water overnight", "2 tbsp sunflower oil", "2 onions, roughly chopped", "3cm/1¼in fresh root ginger, finely grated", "1½ tsp cumin seeds", "1 cinnamon stick", "2 black cardamoms, lightly crushed", "2–3 cloves", "1 small green chilli, finely chopped", "1 tsp salt", "1½ tbsp anardana powder (crushed pomegranate), or 1 tbsp pomegranate molasses", "1 tsp garam masala ", "50g/1¾oz pomegranate seeds, to garnish", "handful coriander, finely chopped, to garnish"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the chickpeas and place in a saucepan. Cover with water and bring to the boil. Reduce the heat and simmer for 45 minutes, or until tender. Drain and set aside.", "Meanwhile, heat the oil in a heavy bottomed saucepan over a medium heat. When hot, add the onions and cook for a few minutes until starting to soften. Add the ginger, spices, chilli and salt. ", "Drain the chana dal and add to the pan with 400ml/14fl oz water. Bring to the boil, then simmer for 35–40 minutes, or until the dal is tender. Add a little more water if needed. ", "Stir in the anardana, garam masala and chickpeas, heat through and adjust the seasoning.", "To serve, pick out the whole spices if you wish and garnish with the coriander and pomegranate seeds. "]}, {"isVegetarian": false, "title": "Anatra con melagrana (duck with pomegranate) and sautéed escarole", "url": "www_bbc_co_uk_food_recipes_anatraconmelagranadu_84995", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 skinless duck breasts", "salt and freshly ground black pepper", "plain flour, for dusting", "40g/1½oz butter", "4 tbsp olive oil", "4 pomegranates", "1 escarole, cleaned and leaves separated ", "5 tbsp olive oil", "3 garlic cloves, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Season the duck breast with salt and freshly ground black pepper and dust with flour, shaking off any excess.", "Heat the butter and olive oil in a large ovenproof frying pan until the butter begins to foam. Add the duck and fry for two minutes on each side, then transfer to the oven to roast for 5-6 minutes, or until just cooked. The duck should be rare, but cook according to your preference.", "Meanwhile, rub two of the whole pomegranates firmly on a work surface with the palm of your hand, then cut them in half and squeeze out the juice, as you would with a lemon, all over the cooked duck.", "Open up the remaining pomegranates and remove the seeds. Sprinkle the pomegranate seeds over the duck.", "Place the duck onto a plate and drizzle with the juices and seeds from the pan. Let the duck rest for 2-3 minutes then slice on the diagonal.", "For the escarole, blanch the escarole leaves for a couple of minutes in boiling salted water. Drain and set aside.", "Heat the olive oil in a frying pan, add the garlic and fry for one minute, or until soft, then add the escarole and gently sauté for 1-2 minutes. Reduce the heat, cover with a lid and cook for 5-6 minutes, or until the escarole is tender.", "To serve, place the escarole onto the plate alongside the duck and spoon any remaining pan juices over."]}, {"isVegetarian": false, "title": "Pork chops with celeriac mash and apple and ale gravy", "url": "www_bbc_co_uk_food_recipes_amershamporkchopswit_80661", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amershamporkchopswit_80661_16x9.jpg", "ingredients": ["1 large celeriac", "150g/5oz butter, plus extra for the sauce", "salt and freshly ground black pepper", "1 large onion", "2 tbsp extra virgin olive oil", "3 Cox's apples, peeled", "425ml/¾ pint London Pride ale (or similar)", "4 pork chops", "2 tsp vegetable oil", "½ tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "250g/9oz rocket leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Peel the celeriac, chop into 2.5cm/1-inch chunks and place in a pan of cold water. Place on the hob, bring to the boil and simmer until tender, about 20 minutes. Mash the celeriac with 100g/3½oz of the butter and season with salt and freshly ground black pepper. Keep covered and warm.", "Meanwhile, peel, halve and thinly slice the onion lengthways into semicircles. Heat the olive oil in a heavy-bottomed frying pan and cook the onions on a medium high heat until soft and lightly coloured. ", "Cut the apples into quarters and cut out the cores out, then cut them again into eighths. ", "Remove the onions from the pan, add the remaining 50g/1½oz butter and place the apples in. Cook over a medium heat. When they are golden brown turn them over so that they are beautifully coloured on both sides. ", "Return the onions to the pan with the apples, raise the heat and add the ale to the pan. Adjust the seasoning and continue cooking until the apples begin to break down a little and the liquid has reduced by at least half and has thickened somewhat.", "With a sharp knife score the skin of the chops and season them. This will help the chop to crisp when it is cooked.", "Heat a griddle pan until smoking hot. Rub the pork chops with some vegetable oil (this will help prevent sticking) and place the chops on the hot griddle. Cook, turning as necessary, until the meat is cooked through (cooking time will depend on the thickness of the chops; it will be cooked when the juices run clear when pierced with a sharp knife near the bone).", "For the salad, make the vinaigrette. Place the mustard, vinegar and olive oil in a bowl and whisk. Season to taste.", "When the chops are cooked, remove from the griddle, and put covered on a plate in a warm place for five minutes. Meanwhile, whisk a knob of butter into the sauce to thicken it slightly. ", "To serve, divide the mash among four plates, place a chop on each dollop of mash and pour the mustard and ale sauce over it. Dress the rocket with the vinaigrette and serve on the side."]}, {"isVegetarian": false, "title": "An authentic ragù bolognese", "url": "www_bbc_co_uk_food_recipes_anauthenticragubolog_66229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb lean minced beef", "450g/1lb minced pork", "6 tbsp extra virgin olive oil", "1x225g/8oz tub chicken livers", "2 medium onion, finely chopped", "4 fat garlic cloves, chopped", "2 x 70g packs (or 140g/5oz) pancetta or streaky bacon, finely chopped", "2 x 400g/14oz tins Italian chopped tomatoes", "2 x 200g/7oz tubes double concentrate tomato purée", "1 x 37.5cl half bottle red wine (or 400ml/14fl oz)", "2 x 15g packs or 30g/1oz fresh basil", "½ whole nutmeg, grated", "salt and freshly milled black pepper"], "serves": "Makes 8 x 225g/8oz portions", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 140C/275F/Gas 1.", "First take a large frying pan, the largest you have, heat 3 tbsp of the oil and gently fry the onion and garlic over a medium heat for about 10 minutes, moving it around from time to time.", "While the onion is softening, chop the pancetta: the best way to do this after opening the pack is to roll the contents into a sausage shape, then using a sharp knife slice it lengthways into four, then slice the lengths across as finely as possible. After 10 minutes, add this to the pan to join the onions and garlic and continue cooking them all for another 5 minutes. ", "Now transfer this mixture to the casserole. Add another tbsp of oil to the pan, turn the heat up to its highest then add the minced beef and brown it, breaking it up and moving it round in the pan. When the beef is browned tip it into the casserole. Heat another tbsp of the oil and do exactly the same with the minced pork. While the pork is browning, trim the chicken livers, rinse them under cold running water, dry them thoroughly with kitchen paper and chop them minutely small. When the pork is browned, transfer it to the casserole, then heat the remaining tbsp of oil and brown the pieces of chicken liver. Add these to the casserole.", "Now you've finished with the frying pan, so get rid of that and place the casserole over the direct heat, give everything a good stir together, then add the contents of the tins of tomatoes, the tomato purée, red wine and a really good seasoning of salt, pepper and nutmeg.", "Allow this to come up to simmering point. Then strip the leaves from half the basil, chop them very finely and add them to the pot. As soon as everything is simmering, place the casserole on the centre shelf of the oven and leave it to cook slowly, without a lid, for 4 hours.  It's a good idea to have a look after 3 hours to make sure all is well, but what you should end up with is a thick, concentrated sauce with only a trace of liquid left in it, then remove it from the oven, taste to check the seasoning, strip the leaves off the remainng basil, chop them small and stir them in.", "Then when the sauce is absolutely cold, divide it, using scales, by spooning 225g/8oz into polythene freezer bags. Seal them leaving a little bit of air at the top to allow room for expansion. Each 225g/8oz pack, thoroughly defrosted and re-heated, will provide enough ragù for 225g/8oz pasta, which will serve 2 people."]}, {"isVegetarian": false, "title": "Anchoïade dip", "url": "www_bbc_co_uk_food_recipes_anchoiadedip_81089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2½oz anchovy fillets, roughly chopped", "4 cloves garlic, roughly chopped", "2 shallots, roughly chopped", "1 tbsp red wine vinegar", "handful parsley, finely chopped", "150ml/5fl oz extra virgin olive oil", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the anchoiade, put all the ingredients except the olive oil and black pepper in a processor, and switch on. Pour the oil into the blender in a steady stream, until it forms a thick sauce. ", "Pour into a pan and heat through. Season with freshly ground black pepper and serve immediately."]}, {"isVegetarian": false, "title": "Anchoïade with crudites", "url": "www_bbc_co_uk_food_recipes_anchoiadewithcrudite_83883", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz extra virgin olive oil", "4 cloves garlic, roughly chopped", "2 shallots, roughly chopped", "110ml/4fl oz white wine", "60g/2½oz white anchovy fillets, roughly chopped", "1 free-range egg yolk", "110ml/4fl oz double cream", "freshly ground black pepper", "selection of washed raw vegetables: celery, carrot sticks, cucumber sticks, radishes, strips of fennel, strips of peppers, cherry tomatoes on sticks, etc."], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, then add the olive oil, garlic and shallots. Cook for 1-2 minutes, to soften but not brown.", "Add the anchovies and the wine and cook for a further 1-2 minutes, until the wine has reduced by half and the anchovies start to break down.", "Transfer the anchovy mixture to a food processor, add the egg yolk and cream and blend to a paste.", "Season with black pepper (the anchovies should make the dish salty enough) and pour into a serving bowl.", "Serve immediately with a selection of washed raw vegetables for dipping."]}, {"isVegetarian": false, "title": "Andalucian shrimp and spring onion fritters", "url": "www_bbc_co_uk_food_recipes_andalucian_shrimp_and_67313", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 garlic cloves, unpeeled", "½ tsp salt ", "1 free-range egg yolk ", "175ml/6fl oz extra virgin olive oil ", "175g/6oz plain flour ", "½ tsp baking powder ", "1 tbsp dry white wine", "175g/6oz raw prawns, cut into small pieces", "2 spring onions, thinly sliced", "1 tbsp chopped fresh flatleaf parsley ", "olive oil, for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the aioli, put the garlic cloves onto a chopping board and crush them under the blade or a large knife. ", "Remove the papery skins, sprinkle the garlic with the salt and work into a smooth paste using the knife blade. ", "Scrape the garlic paste into a bowl and add the egg yolk. ", "Whisk together, then very gradually whisk in the olive oil to make a thick mayonnaise –like mixture. ", "For the fritters, sift the flour, baking powder and a pinch of salt into a mixing bowl. Make a well in the centre and add 300ml/10fl oz water and the wine. ", "Gradually mix the dry ingredients into the liquid to make a batter, then whisk until you have a thick cream. Fold in the prawns, spring onions and parsley.", "Pour ½cm/¼in of olive oil into a large frying pan and place over a high heat. Leave until hot but not smoking, or until a drop of the batter sizzles immediately.  (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Carefully drop large spoonfuls of the batter into the pan and spread each one out a little with the back of the spoon so they develop lovely thin, crispy edges as they cook. Don’t be tempted to overcrowd the pan – only cook 2-3 at a time. ", "Cook, turning the fritters over every now and then, for about two minutes or until puffed up and golden brown on both sides.", "Remove with a slotted spoon and drain on a tray lined with plenty of kitchen paper. Eat straight away while they are still hot and crisp. "]}, {"isVegetarian": false, "title": "Andalucian pork with apricots, prunes and herbs, rolled in paprika", "url": "www_bbc_co_uk_food_recipes_andalucianporkwithap_72080", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium to large pork fillet", "50g/1¾oz prunes, chopped", "50g/1¾oz soft dried apricots, chopped", "10g/½oz parsley, chopped", "2 tbsp paprika", "1 tsp dried oregano", "1 tsp dried thyme", "1 clove garlic, crushed", "1 tbsp coarse salt", "2 tbsp olive oil", "salt and freshly ground black pepper", "1 lemon, cut into wedges, to serve"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Cut the pork open with a sharp knife and open the fillet out along its length, being careful not to cut all the way through the fillet.", "In a bowl, mix together the prunes, apricots and parsley and insert along the length of the fillet. Season well.", "Roll the fillet up and securely fasten with string.", "Mix up the paprika, the remaining herbs, the garlic, the salt and the oil to make a thick paste. Spread over the surface of the meat, and leave it in the fridge, ideally overnight.", "Preheat the oven to 200C/400C/Gas 6. Season the meat and sear on all sides in a heavy pan. Place in the oven for fifteen minutes.", "Rest the meat before serving with lemon wedges."]}, {"isVegetarian": false, "title": "Feijoada", "url": "www_bbc_co_uk_food_recipes_andre_and_andersons_49427", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/andre_and_andersons_49427_16x9.jpg", "ingredients": ["1kg/2lb 4oz dried black beans", "4 tbsp olive oil", "500g/1lb 2oz dry-smoked pork ribs, fat trimmed, cut into individual ribs", "1kg/2lb 4oz unsmoked pork ribs, fat trimmed, cut into individual ribs", "1 large onion, roughly chopped", "1 head garlic, cloves finely chopped", "500g/1lb 2oz smoked bacon, cut into medium-sized pieces", "500g/1lb 2oz pork belly, cut into medium-sized chunks", "200g/7oz smoked pork sausage, cut into medium-sized chunks", "salt and freshly ground black pepper", "2 tbsp dried chilli flakes (optional)"], "serves": "Serves 6-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the black beans in 2 litres/3½ pints of cold water overnight.", "When the beans have soaked, heat half of the oil in a lidded frying pan (large enough to fit all the ribs in at once) over a medium heat. ", "Season the smoked and unsmoked pork ribs all over with salt and freshly ground black pepper. Fry the ribs for 4-5 minutes on each side, or until browned on both sides.", "Add the onion and garlic and continue to fry for a further 2-3 minutes, stirring well, until softened.", "Add 250ml/9fl oz water and bring it to a simmer, then cover the frying pan with the lid and cook for 18-20 minutes, topping up the pan with water as necessary if the liquid evaporates too quickly. Transfer the pan contents to a large casserole and set aside.", "Wipe the frying pan clean with kitchen paper, then heat the remaining oil over a medium heat. Fry the bacon, pork belly and sausage, in batches, until browned all over (do not overcrowd the pan). Transfer the browned meat to the casserole.", "Add the soaked black beans and the soaking liquid to the casserole and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering gently. Simmer, half-covered, for about 2½ hours, topping up the casserole with water every so often to prevent it from drying out. The feijoada is ready when the ribs are tender and the meat is almost falling off the bone.", "Just before serving, season the feijoada with salt and freshly ground black pepper, if necessary, and with chill flakes, if desired."]}, {"isVegetarian": true, "title": "An extraordinary way with lettuce", "url": "www_bbc_co_uk_food_recipes_anextraordinarywaywi_92374", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large slice of butter", "1 bunch spring onions, cut into 2.5cm/1in lengths", "1 handful broad beans, out of their pods", "3 heads Baby Gem lettuce, trimmed and cut in half", "vegetable stock, enough to nearly cover the lettuce", "1-2 handfuls fresh peas, out of their pods ", "a few fresh mint sprigs, leaves only"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a large shallow pan until the butter is foaming, then add the spring onions and cook for a few minutes. ", "Meanwhile, cook the broad beans in a pan of boiling water for 2-3 minutes, or until they are tender enough to slip the skins off, if you so wish.", "Place the halved Baby Gem lettuces cut-side down on top of the spring onions and add the vegetable stock to the lettuce, enough to nearly cover. Scatter over the drained broad beans (I prefer mine skinned - they are just a little brighter and softer that way but skin on is fine also). Add the peas, season lightly with salt and freshly ground black pepper and simmer for a few minutes. ", "Finish with some mint leaves and serve once the vegetables are tender. This dish is lovely on its own but it is equally delicious paired with some old-fashioned English ham."]}, {"isVegetarian": false, "title": "Anchovy and sage crisps", "url": "www_bbc_co_uk_food_recipes_anchovy_and_sage_crisps_70251", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40 large sage leaves, all similar size", "2 free-range eggs, beaten ", "50g/1¾oz plain flour ", "75g/2½oz very fine white breadcrumbs or polenta ", "10 anchovy fillets, drained ", "vegetable oil, for frying "], "serves": "Makes 20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wipe the sage leaves and pat them dry with absorbent kitchen paper.", "Take three deep plates or shallow dishes and pour the beaten egg into one, the flour into another and the breadcrumbs or polenta into the third.", "Lay 20 of the sage leaves out flat and place half an anchovy down the centre of each one. Place the remaining 20 sage leaves over the anchovies and press down to sandwich together.", "Individually coat each sage and anchovy sandwich in the flour, then dip in the beaten egg and finally coat in the breadcrumbs or polenta. ", "Heat the oil in a large frying pan. (CAUTION: hot oil can be dangerous. Do not leave unatttended.) Cook the sage crisps in batches until golden-brown and crisp. Drain on absorbent kitchen. ", "Serve while still warm. "]}, {"isVegetarian": true, "title": "Angel food cake with lemon curd", "url": "www_bbc_co_uk_food_recipes_angel_food_cake_with_04002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angel_food_cake_with_04002_16x9.jpg", "ingredients": ["125g/4½oz plain flour", "300g/10½oz caster sugar", "10 large free-range egg whites", "2 large lemons, grated zest only", "1 tbsp lemon juice", "1 tsp cream of tartar ", "½ tsp salt", "10 large free-range egg yolks", "400g/14oz caster sugar", "4 large lemons, juice only (approximately 200ml/7fl oz) ", "2 large lemons, grated zest only", "175g/6oz unsalted butter, cubed", "2 passion fruit", "300ml/10fl oz whipping cream", "½ tsp vanilla extract"], "serves": "Serves 12-15, and makes two 350g/12oz jars of lemon curd", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4 (fan 160C) and arrange an oven shelf in the bottom third of the oven. Sift the flour and 100g/3½oz of the caster sugar together in a bowl and set aside.", "Whisk the egg whites in a large bowl with an electric hand whisk or mixer on a high speed for one minute until frothy. Add the lemon zest, lemon juice, cream of tartar and salt and continue whisking for 2-3 minutes, or until soft peaks form when the whisk is removed from the bowl. Increase the speed and add the remaining 200g/7oz of caster sugar, one tablespoon at a time to form firm, but not stiff peaks. ", "Sprinkle over one-third of the flour mixture and fold gently to combine. Repeat with the remaining two-thirds of the flour mixture folding gently to keep as much air in the mixture as possible.", "Transfer the batter to a 25cm/10in angel food cake pan. Gently run a knife through the centre of the batter to remove any pockets of air. Cook for 45-50 minutes, or until a skewer inserted into the centre comes out clean. ", "Remove from the oven and immediately turn upside down onto the tin’s cooling legs, or place over the neck of a wine bottle. Leave to cool for at least one hour. ", "Run a knife around the inner and outer edges of cake to remove it from the pan. Invert onto a plate. Carefully use a palette knife to separate the cake from the base of the pan. Leave to cool on a wire rack.", "For the lemon curd, mix the egg yolks, sugar, lemon juice and lemon zest together in a large pan. Cook over a low heat, stirring with a wooden spoon, making sure to stir the sides and base of the pan.  Cook for 5-7 minutes, or until the mixture coats the back of a spoon. Remove from the heat and stir in the butter. Pass through a sieve into a large jug. Fill two 350g/12oz glass jars with the lemon curd and seal with lids. Cover the remaining curd with cling film and leave to cool. ", "For the topping, whisk the cream and vanilla extract in a bowl until soft peaks form when the whisk is removed. Spoon the topping over the angel food cake and, using a palette knife, coat the top and sides of the cake, smoothing as you go.", "Cut the passion fruit in half and scoop out the seeds. Stir the passion fruit into the reserved, cooled lemon curd and drizzle over the angel food cake before serving. You may want to use just one of the jars of lemon curd to serve with the cake and save the other to eat separately. "]}, {"isVegetarian": false, "title": "Chicken in white wine sauce", "url": "www_bbc_co_uk_food_recipes_angelaschickeninwhit_85878", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angelaschickeninwhit_85878_16x9.jpg", "ingredients": ["4 skinless chicken breasts", "1 onion, roughly chopped", "1 carrot, roughly chopped ", "1 stick celery, roughly chopped ", "1 bay leaf", "6 black peppercorns", "30g/1oz butter", "30g/1oz flour", "150ml/¼ pint white wine", "1 free-range egg yolk", "2-3 tbsp double cream", "salt and freshly ground black pepper", "squeeze lemon juice", "2 tbsp chopped fresh parsley", "mashed potato, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place chicken breasts into a large pan. Add the vegetables, bay leaf and peppercorns and cover with water.", "Place the pan over a low heat and slowly bring to the boil, then simmer for 30 minutes, or until the chicken is completely cooked through.", "Remove the chicken with a slotted spoon, place onto a plate and keep warm. ", "Strain the cooking liquid into a bowl, reserving 450ml/¾ pint.", "Melt the butter in a clean pan over a medium heat. Add the flour and stir well to make a roux. Slowly add the reserved chicken stock to the roux, stirring constantly, to make a thick sauce.", "Add the white wine and bring to the boil.", "Place the egg yolk and the cream into a clean bowl and lightly whisk together. Gradually add the egg mixture to the sauce, stirring well.", "Add the chicken breasts to the sauce. Remove from the heat, season, to taste, with salt and freshly ground black pepper and add a squeeze of lemon juice. ", "To serve, spoon the mashed potato on serving plates, top with a chicken breast, pour over some sauce and garnish with chopped parsley."]}, {"isVegetarian": false, "title": "Slow-cooked shoulder of lamb with Jansson’s temptation and sautéed sprout tops", "url": "www_bbc_co_uk_food_recipes_anchovy_and_rosemary_77076", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lamb shoulder ", "6 anchovy fillets ", "2 sprigs rosemary, broken into small pieces", "1 head garlic, peeled and chopped", "400ml/14fl oz gravy, to serve ", "1kg/2lb 4oz potatoes, cut into matchsticks", "150g/5½oz Swedish anchovies, chopped", "1 onion, sliced", "500ml/18fl oz double cream", "75g/2½oz unsalted butter", "50g/1¾oz fresh white breadcrumbs", "salt and freshly ground black pepper", "2 handfuls sprout leaves or baby sprouts, broken into leaves ", "75g/2½oz unsalted butter "], "serves": "Serves 6–8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the lamb, preheat the oven to 180C/160C Fan/Gas 4. ", "Pierce the lamb all over with a sharp knife and stuff the anchovies, garlic and rosemary into the holes. Place in a large roasting tray and cook for 3–4 hours. ", "To make the Jansson’s temptation, turn the oven up to 200C/180C Fan/Gas 6. Spread a third of the potatoes in an oven-proof baking dish and top with half of the anchovies and half of the onion then repeat again and finish with a layer of potatoes. Season with salt and pepper, dot the butter over the top and pour the cream over. Sprinkle with the breadcrumbs and bake for 1½ hours, until golden and cooked through. ", "To make the sprout tops, heat the butter in a large frying pan and sauté the sprouts over a high heat until cooked. ", "To serve, slice the lamb and serve on plates alongside the Jansson’s temptation and sprouts. Drizzle with gravy.  "]}, {"isVegetarian": false, "title": "Angela's slow roasted ginger pork", "url": "www_bbc_co_uk_food_recipes_angelasslowroastedgi_71381", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 shoulder of pork weighing approximately 4kg/8lb 2oz skin scored", "4 garlic cloves, peeled and roughly chopped", "4cm/1½inch piece fresh root ginger, peeled and roughly chopped", "3 tbsp olive oil", "4 tbsp white wine vinegar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas mark 7.", "Place the pork skin-side up on a rack over a roasting tin. Place the garlic and ginger in a pestle and mortar or food processor and pound or process until you get a rough paste then mix in the oil and vinegar. Rub the paste all over the scored skin of the pork. Place in the preheated oven and cook for 30 minutes.", "Remove the pork from the oven, reduce the temperature to 150C/300F/Gas 2. Turn the pork over with the skin side down on the rack and return to the oven and cook for 4-5 hours.", "Remove from the oven and turn up to the highest setting 220C/425F/Gas 7. Turn the pork over to the crackling side on the rack and roast in the hot oven for the final 20 minutes to crisp up the crackling. Leave to stand for 10-15 minutes before carving.", "To serve, cut away the crackling with a sharp knife and break it up into pieces then carve the meat. It should be very tender and succulent."]}, {"isVegetarian": false, "title": "Annika's glögg (Annika’s mulled wine)", "url": "www_bbc_co_uk_food_recipes_annikas_glgg_annikas_32356", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/annikas_glgg_annikas_32356_16x9.jpg", "ingredients": ["1 bottle red wine (quality doesn’t matter) ", "1-2 sticks cinnamon ", "5g dried root ginger ", "5g dried Seville orange peel (or other orange if you can't get Seville) ", "7 green cardamom pods ", "15-16 whole cloves ", "80g/3oz sugar ", "flaked almonds  ", "raisins ", "splash of either vodka, aquavit, rum or cognac (optional)"], "serves": "Makes 1 bottle", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the wine into a pan, add the rest of the ingredients and heat to around 80C/176F, stirring to dissolve the sugar. ", "Remove from the heat and leave to infuse for at least an hour. ", "Strain the mixture and return the mulled wine to the bottle - use a funnel to make life easier for yourself. The wine can be kept for around a week. ", "To serve, pour the wine into a saucepan and heat it.", "Place a few flaked almonds and raisins in the bottom of your serving cups, and pour the glögg over the mixture. ", "If you want to give your glögg a kick, add a splash of either vodka, aquavit, rum or cognac just after you’ve reheated the wine. "]}, {"isVegetarian": false, "title": "Anolini in brodo (meat filled pasta in chicken broth)", "url": "www_bbc_co_uk_food_recipes_anolini_in_brodo_meat_26930", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "500g/1lb 2oz beef sirloin steak", "200g/7oz veal rump steak", "1 onion, roughly chopped", "2 carrots, roughly chopped", "2 celery sticks, roughly chopped", "2 tbsp tomato purée", "2 bay leaves", "300ml/10fl oz red wine", "500ml/18fl oz chicken stock", "100g/3¾oz fresh white breadcrumbs", "250g/9oz Parmesan, finely grated ", "1 x 1.5–2kg/3lb 5oz–4lb 8oz whole chicken, preferably organic", "500g/1lb 2oz beef shin", "1 carrot, roughly chopped", "1 onion, roughly chopped", "1 celery stick, roughly chopped", "1 garlic clove, chopped", "400g/14oz '00' flour, plus extra for dusting", "4 free-range eggs, beaten", "pinch salt"], "serves": "Serves 6–8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the anolini, heat the oil in a large, lidded casserole dish. Add the beef sirloin and veal and seal all over. Remove from the pan and rest on a plate.", "Cook the onion, carrots and celery in the casserole for 5–8 minutes. Add the tomato purée and cook for 1–2 minutes.", "Put the meat back in the pan. Add the bay leaf and wine and cook until reduced by half. Add the stock, put the lid on and cook for 3–4 hours.", "Remove the cooked meat and shred it. Remove the vegetables and mash them in a bowl with a little of the cooking liquor. Season to taste. Mix in the meat, breadcrumbs and nearly all the Parmesan, keeping some for serving. Add more breadcrumbs if you need them to make a firm mixture.", "For the broth, put the chicken, beef shin, carrot, onion, celery and garlic in a large saucepan and add enough water to cover. Bring to the boil, cover with a lid and simmer for 2 hours. Strain the liquor, keeping the broth and discarding the vegetables. Reserve the chicken and beef for another meal or your second course.", "To make the pasta, in a food processor, mix the flour, eggs and salt. If the mixture is too dry, add a little water. Dust a work surface with a little flour and knead the mixture until it forms a dough. Wrap in cling film and rest in the fridge for 30 minutes.", "Dust the pasta with a little flour, then roll it out using a pasta machine until it is about 2mm thick (around setting number five on the pasta machine). Alternatively, roll out the dough using a rolling pin.", "Lay a sheet of pasta on a floured work surface and spoon a teaspoon of the meat mixture along the pasta leaving 2cm/¾in gap between each pile. Lay another sheet of pasta on top, taking out the air, and cut into parcels. Cook the pasta in a large saucepan of boiling salted water for 1–2 minutes.", "To serve, reheat the chicken broth. Divide the parcels between the serving bowls, ladle over the stock and sprinkle over the remaining Parmesan."]}, {"isVegetarian": true, "title": "Easy cookies", "url": "www_bbc_co_uk_food_recipes_anytimecookies_92185", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anytimecookies_92185_16x9.jpg", "ingredients": ["250g/9oz unsalted butter, softened", "150g/5oz golden granulated sugar", "2-3 drops vanilla extract", "1 free-range egg, beaten", "220g/½lb plain flour", "1 tsp baking powder", "pinch salt", "1-2 handfuls chocolate chips (optional)", "1-2 handfuls nuts (such as peanuts, macadamia nuts, or brazil nuts) (optional)", "1-2 handfuls crystallised ginger"], "serves": "Makes 30", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, beat together the butter and sugar until pale, fluffy and well combined. ", "Beat in the vanilla extract and beaten egg, a little at a time, until well combined. ", "Sift the flour, baking powder and salt into the bowl and mix well until smooth and combined.", "Lay a large sheet of cling film (approx 30cm/12in square) onto a work surface and pour the cookie batter into the middle of it. ", "Bring the far edge of the cling film over the cookie batter and towards you, then use the side of a palette knife to press the batter against the length of cling film. Wrap the cling film around the dough to form a sausage shape 7–8cm/3–4in wide. Twist the ends to secure and chill in the fridge for one hour, or until firm. (NB: At this stage, the cookie dough can be frozen until needed.)", "Preheat the oven to 200C/180 Fan/Gas 6.", "When the cookie dough is firm, cut 1cm/½in slices from it and arrange them on a baking tray with enough space around each to allow for the mixture spreading.", "The cookies can be cooked as they are. Alternatively, sprinkle over toppings of your choice, such as chocolate chips, nuts or crystallised ginger before cooking. ", "Transfer the cookies to the oven and bake for 8–10 minutes, or until the edges are pale golden-brown.", "Set the cookies aside for 1–2 minutes, then transfer to a wire rack to cool."]}, {"isVegetarian": true, "title": "Aperitivo di passata", "url": "www_bbc_co_uk_food_recipes_aperitivodipassata_70570", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300m/10fl oz passata sauce", "2 limes", "¼ nutmeg, grated", "3 pinches of sugar", "1 pinch of salt", "1 pinch of chilli powder"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the passata, lime juice, nutmeg, salt and chilli powder in a large bowl and stir well. ", "Place in the fridge.  ", "Get a cold glass and slightly wet the rim. Dip into the sugar.", "Pour the mixture into the glass and decorate with a slice of lime. Serve chilled."]}, {"isVegetarian": false, "title": "Antony's 'mainstay' mince", "url": "www_bbc_co_uk_food_recipes_antonysmainstaymince_73336", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz streaky bacon, diced ", "175-200ml/6-7fl oz good olive oil ", "2 onions, finely diced", "2 sticks celery, peeled and finely diced", "2 carrots, peeled and finely sliced", "5 cloves garlic, peeled and crushed with a little salt", "2 tsp fresh soft thyme leaves", "2 bay leaves", "2 tsp dried oregano", "2 x 400g/14oz cans chopped tomatoes", "2 tbsp tomato purée", "1 tbsp anchovy essence", "2 tbsp Worcestershire sauce", "1.8kg/4lb minced beef", "250g/9oz fresh chicken livers, finely chopped", "2 bottles dry red wine", "1.7 litres/3 pints chicken, beef or lamb stock", "salt and freshly ground black pepper"], "serves": "Makes 2kg", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["In a large heavy-based saucepan, fry the bacon in two tablespoons of olive oil. When the bacon is crisp and has released some natural fats, add the onions, celery, carrots, garlic, thyme, bay leaves and oregano and cook over a medium heat until the vegetables have softened and taken on a little colour. Add the tinned tomatoes, tomato purée, anchovy essence and Worcestershire sauce. Stir to combine.", "Meanwhile, in a large frying pan, heat a little olive oil and fry off the mince in small batches until browned. While the meat is frying, break up any lumps with the back of a wooden spoon. Remove the cooked meat from the pan and repeat, using more oil each time if necessary, until all the meat is used up. After each batch, add the meat to the sauce mix. ", "In the same frying pan, fry the chicken livers until brown and crusty (in a little more olive oil) and add the livers to the meat. Deglaze the frying pan with some of the red wine, scraping any crusty bits from the bottom, then pour this wine, the remaining wine and the stock into the meat pot.", "Bring to the boil, reduce the heat and simmer, stirring from time to time, for about two hours. Season to taste. If the liquid reduces too much, top up with water. When the meat is tender, allow to cool, then refrigerate. When cold, lift off the solidified fat and discard. Freeze the mixture in small batches and use for stuffed tomatoes, bolognese, cannelloni, shepherd's pie, moussaka or lasagne."]}, {"isVegetarian": true, "title": "Apple and blackberry crumble", "url": "www_bbc_co_uk_food_recipes_apple_and_blackberry_33697", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_blackberry_33697_16x9.jpg", "ingredients": ["500g/1lb 2oz cooking apples, peeled, cored and sliced", "25g/1oz butter                 ", "75g/2½oz caster sugar     ", "250g/9oz blackberries                                         ", "100g/3½oz plain wholemeal flour", "75g/2½oz porridge oats", "2 tsp shony (powdered seaweed)", "100g/3½oz soft dark brown sugar", "75g/2½oz unsalted butter, chilled, cut into roughly 1cm/½in cubes", "25g/1oz sunflower seeds", "15g/½oz pumpkin seeds"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. ", "For the filling, put the apples, butter and sugar in a pan. Cook over a medium heat for about 10 minutes, stirring from time to time, until the sugar has dissolved and the fruit is just beginning to collapse. Taste and add more sugar if required. Stir in the blackberries and transfer the mixture to an oven dish and set aside.  ", "To make the crumble topping, combine the flour, oats, powdered seaweed and sugar in a bowl. Add the butter and rub in lightly with your fingertips until the mix resembles coarse breadcrumbs. ", "Using a pestle and mortar or a small food processor, crush the seeds so they break down a little. Do not reduce them to a fine powder. Stir the crushed seeds into the crumble mixture.", "Spoon the crumble mixture over the filling. Bake for 35-40 minutes, or until golden-brown and bubbling. Leave to settle for about 10 minutes before serving. "]}]