[{"isVegetarian": false, "title": "Carne de res con crema de whisky y champiñones, espinacas marchitas y tatties trituradas", "url": "www_bbc_co_uk_food_recipes_beefwithwhiskyandmus_84588", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 cucharadas de granos de pimienta negra, molidas gruesas, tamizadas, polvo desechado", "4 filetes de filete de x 175g / 6oz, cortados por la mitad", "4 cucharaditas de mostaza Dijon", "sal marina recién molida y pimienta recién molida", "2 cucharadas de aceite de girasol", "50g / 2oz de mantequilla", "200 g / 7 oz de champiñones frescos (porcini), en rodajas gruesas", "450g / 1lb de papas nuevas, fregadas, hervidas hasta que estén tiernas", "50g / 2oz de mantequilla", "sal y pimienta blanca recién molida", "3 cucharadas de perejil de flatillo picado", "25g / 1oz de mantequilla", "500 g / 1lb 2oz de espinaca de hojas de bebé", "3 cucharadas de agua", "sal y pimienta blanca recién molida", "50ml / 2fl de whisky de oz", "50ml / 2fl oz de caldo de carne", "Crema doble 50ml / 2fl oz"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para los filetes, extender las piezas gruesas de pimienta negra sobre un plato pequeño. Cubra todos los lados de los filetes con la mostaza Dijon y luego presione sobre los granos de pimienta triturados para cubrir.", "Calentar una sartén grande hasta que esté muy caliente y agregar el aceite de girasol. Sazone los filetes con sal, luego agregue a la sartén para cocinar durante 1-2 minutos. Dé vuelta una vez para dorar ambos lados (no mueva los filetes una vez que estén en la sartén o la corteza de la pimienta se caerá; cocínelos para obtener un buen recubrimiento crujiente en cada lado).", "Agregue la mantequilla y permita que se derrita y se vuelva de color castaño, pero no la deje que se queme.", "Agregue los champiñones y agregue la mantequilla. A medida que los hongos comienzan a absorber los jugos de la sartén, voltee los filetes nuevamente y déjelos cocinar durante 3-4 minutos por cada lado, o hasta que estén cocidos a su gusto.", "Retire los filetes y colóquelos en una bandeja para hornear y déjelos reposar en un lugar cálido.", "Para los tatties, coloque las papas en un tazón grande. Agregue la mantequilla y triture suavemente cada patata con un tenedor hasta que se rompa. Sazonar, al gusto, con sal y pimienta blanca recién molida, y agregar el perejil. Mezcle hasta que toda la mantequilla haya sido absorbida, pero no demasiado las patatas.", "Para la espinaca, caliente una sartén mediana o wok hasta que esté caliente. Agregue la mantequilla y la espinaca y saltee por un minuto, luego agregue el agua. Continúa revolviendo hasta que la espinaca se haya marchitado. Retirar del fuego, sazonar, al gusto, con sal y pimienta blanca recién molida y reservar hasta que esté listo para servir.", "Para la salsa de whisky, agregue el whisky a la sartén que se utiliza para cocinar los filetes, y cocine a fuego muy alto durante un minuto para hervir el alcohol. (PRECAUCIÓN: el whisky puede prenderse fuego, lo cual es perfectamente aceptable, pero si esto le preocupa, tenga a mano una tapa grande para colocar sobre la bandeja para evitar las llamas y asegúrese de que tiene el extractor apagado).", "Agregue el caldo y hierva para reducir el volumen de líquido, hasta que espese, luego agregue la crema. Hierva para reducir el volumen de líquido nuevamente, raspando y revolviendo para aflojar los pedazos pegados del fondo de la sartén.", "Vierta los jugos liberados por los filetes de descanso en la salsa y mezcle bien.", "Para servir, coloca un anillo de chefs en el centro de cada una de las cuatro placas. Rellene con las papas trituradas y retire con cuidado el anillo. Coloque una pequeña pila de espinacas en las papas y coloque dos medallones de carne en la parte superior de cada montón. Coloque la salsa y los champiñones sobre el bistec y sirva."]}, {"isVegetarian": false, "title": "Caballa azotada por la cerveza con ensalada de remolacha", "url": "www_bbc_co_uk_food_recipes_beer-battered_mackerel_44962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml / 5fl oz de aceite de oliva", "50ml / 1¾fl oz de vinagre balsámico", "1 remolacha roja cocida grande, cortada en cubos", "1 remolacha amarilla mediana, en rodajas finas", "1 remolacha confitada mediana, finamente rebanada", "½ manojo de eneldo fresco, aproximadamente picado", "250 g / 9 oz de crema fresca", "Harina normal de 405 g / 15 oz, más extra para quitar el polvo", "300ml / 10fl oz de cerveza", "aceite, para freír", "2 filetes de caballa, huesos extraídos, partidos por la mitad", "sal y pimienta negra recién molida", "150g / 5½ozrocket, para adornar"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle el aceite y el vinagre con toda la remolacha y sazone bien.", "Mezcle el eneldo con la crème fraîche y condimente.", "Coloque la harina en un tazón grande y bata la cerveza, poco a poco, hasta que quede suave.", "Precaliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Espolvorea la caballa con harina, sacudiendo el exceso, sumérgete en la masa y fríe durante 3-5 minutos, o hasta que se dore. Escurrir sobre papel de cocina y sazonar bien.", "Divida las remolachas entre dos platos y cubra con el eneldo crème fraîche. Coloque la caballa encima y adorne con un cohete."]}, {"isVegetarian": false, "title": "Gambas a la cerveza con salsa tártara", "url": "www_bbc_co_uk_food_recipes_beer-battered_scampi_68196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["16-20 colas de gambas escocesas silvestres, peladas y descongeladas (si están congeladas)", "4 cucharadas de harina normal", "½ cucharadita de sal marina fina", "cuñas de limón, para servir", "75g / 3oz de harina de maíz", "Harina normal de 200g / 7oz", "1 cucharadita de sal marina fina", "Botella de 330ml / 12fl 0z de ale real", "2 cucharadas de vinagre de vino blanco", "2 yemas de huevo de gallinas camperas", "1 cucharada de vinagre de vino blanco", "2 cucharaditas de mostaza Dijon", "¼ de cucharadita de lanzador", "pizca de sal marina fina", "150ml / 5fl oz de aceite de girasol", "50ml / 2fl oz de aceite de oliva virgen extra", "Alcaparras 50g / 2oz, drenados y toscamente picados", "50g / 2oz mini pepinillos (cornichons), drenados y en rodajas finas", "2 cucharadas de perejil fresco picado", "1 cucharada de estragón fresco picado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa tártara, bata las yemas de huevo, el vinagre, la mostaza, el azúcar y la sal en un tazón con un batidor grande de metal hasta que estén bien combinados. Poco a poco agregue el aceite, unas pocas gotas a la vez, batiendo hasta que la mayonesa sea suave y muy espesa.", "Agregue las alcaparras, los pepinillos, el perejil, el estragón y un montón de pimienta negra recién molida. Cubra la superficie de la salsa con film transparente y déjelo a un lado durante 20 minutos.", "Para la mezcla, mezcle la harina de maíz, la harina común y la sal juntas en un tazón grande. Haz un pozo en el centro y agrega dos tercios de la cerveza. Batir con un batidor grande de metal para hacer un batido suave. Agite suavemente la cerveza restante y el vinagre. Dejar de lado.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 190 ° C / 375 ° F (use un termómetro de sonda para verificar la temperatura si no está usando una freidora de grasa). (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido)", "Para las gambas, ponga cuatro cucharadas de harina en una bolsa de plástico grande y sazone con sal. Agregue las colas de gambas, una a la vez, y sacúdalas para cubrirlas con la harina sazonada.", "Revuelva la masa y luego sumerja una pieza de scampi enharinado en la masa hasta que esté completamente cubierto. Retire con pinzas y colóquelo suavemente en el aceite caliente. Repite el proceso con otros 3-4 pedazos de gambas y agrégalo a la sartén. Cocine por 3-4 minutos hasta que estén doradas y crujientes.", "Retire las gambas y escurra sobre papel de cocina. Mantener caliente Regrese el aceite a la temperatura y cocine las colas restantes en 2-3 lotes más.", "Coloque la salsa en cuatro platos pequeños, los moldes son buenos, y coloque cuatro platos calientes. Divida las gambas entre ellas, agregue las rodajas de limón para exprimir y servir."]}, {"isVegetarian": false, "title": "Estantería de cerdo marinada con cerveza y gratinado con acelga", "url": "www_bbc_co_uk_food_recipes_beer-marinated_rack_of_35117", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beer-marinated_rack_of_35117_16x9.jpg", "ingredients": ["2 cucharadas de copos de sal marina", "2 cucharadas de azúcar moreno oscuro", "1 cucharadita de pimienta negra", "4 dientes de ajo, ligeramente triturados", "2 hojas de laurel", "2 cucharadas de semillas de mostaza amarillas, 1 cucharada remojada en agua fría durante la noche", "4 ramitas de tomillo fresco", "4 ramitas de perejil fresco de hoja plana", "500ml / 18fl oz de cerveza, preferiblemente una cerveza de buena calidad", "1 x 1-1.2kg / 2lb 4oz-2lb 10oz costillar de lomo de cerdo de seis costillas, francés-recortado (pregunte a su carnicero que haga esto por usted)", "75g / 2½oz de mantequilla sin sal", "100g / 3½oz de brioche, aproximadamente desgarrado", "1 cucharadita de mostaza inglesa en polvo", "1 cucharada de semillas de mostaza marrón, remojadas en agua durante la noche", "700g / 1lb 9oz de acelga suiza, cortada, cortada en rodajas de 2cm / ¾in", "2 patatas grandes, peladas y cortadas en piezas de 1.5cm / ½ en", "1 cebolla, en rodajas", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de harina natural", "400ml / 14fl oz de leche entera", "200ml / 7fl oz de caldo de pollo", "100 g / 3½ oz de Gruyère, rallado", "sal y pimienta negra recién molida"], "serves": "Para 6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el cerdo, vierta 100 ml / 3½ fl oz de agua fría en una olla grande. Agregue los copos de sal marina y el azúcar y caliente a fuego lento hasta que se disuelva, revolviendo bien. Retire la sartén del fuego y agregue 400ml / 14fl oz de agua fría, los granos de pimienta, ajo, hojas de laurel, semillas de mostaza amarilla sin remojar, tomillo, perejil y cerveza.", "Si el estante de lomo de cerdo cabe en la sartén, agréguelo a la sartén. De lo contrario, coloque la parrilla de lomo de cerdo en un recipiente grande y vierta sobre el líquido. Cubra y enfríe en la nevera durante 24 horas para marinar, volteando el cerdo de vez en cuando.", "Cuando el cerdo se haya marinado, precaliente el horno a 200C / 180C Fan / Gas 6.", "Retire la carne de cerdo del adobo y seque con papel de cocina.", "Caliente 50 g / 1¾ oz de la mantequilla en una sartén grande a fuego medio. Cuando la mantequilla esté espumosa, agregue la parrilla de lomo de cerdo y fría por unos segundos en todos los lados, o hasta que se dore ligeramente por todas partes. Transfiera la parrilla de lomo de cerdo a una bandeja de asar y tueste en el horno por 15 minutos.", "Mientras tanto, mezcle el brioche, la mostaza en polvo inglesa y las semillas de mostaza amarillas y marrones empapadas en una pasta en un procesador de alimentos con la mantequilla restante. Sazonar, al gusto, con sal y pimienta negra recién molida, luego dejar de lado.", "Para el gratinado, coloque la mitad de la acelga en una capa en el fondo de un plato resistente al horno y cubra con la mitad de las papas. Espolvoree sobre la cebolla, luego cubra con capas de las acelgas y papas suizas restantes.", "Derrita la mantequilla en una cacerola a fuego medio. Agregue la harina y bata bien para combinar con la mantequilla derretida. Continúe cocinando durante 1-2 minutos, batiendo regularmente, luego gradualmente vierta la leche, batiendo continuamente, hasta que se haya incorporado toda la leche y la mezcla se haya espesado a una salsa suave.", "Agregue el caldo y la mitad del Gruyère y revuelva hasta que se derrita. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Vierta la salsa sobre la acelga y las papas. Espolvorea sobre el Gruyère restante.", "Después de que el cerdo haya estado cocinando durante 15 minutos, retírelo del horno y disminuya la temperatura a 180 ° C / 160 ° Ventilador / Gas 4.", "Extienda el brioche y la pasta de mostaza sobre la parte superior de la parrilla de lomo de cerdo en una capa gruesa, luego regrese la carne de cerdo al horno, junto con el gratinado de acelga suiza. Cocine por otros 45 minutos o hasta que la carne de puerco se cocine a su gusto y la miga se haya crujido y se haya dorado, y el gratén con acelga esté burbujeante y dorado.", "Cuando el cerdo esté cocido a su gusto, déjelo reposar durante 15 minutos (mantenga caliente). Continúe cocinando el gratinado con acelga suiza por otros 15 minutos, si es necesario; de lo contrario, manténgase caliente.", "Para servir, esculpe la parrilla de lomo de cerdo en seis chuletas. Coloque uno en cada plato de servir y cuchara el gratinado de acelga al costado."]}, {"isVegetarian": false, "title": "Pollo de salmón salpicado de cerveza con maíz dulce a la brasa y arroz herby", "url": "www_bbc_co_uk_food_recipes_beer-splashed_jerk_23004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5cm / 2in de jengibre fresco, picado", "2 dientes de ajo, picados", "1 guindilla Scotch, semillas removidas y finamente picadas", "2 cucharadas de condimento tirón", "50-75ml / 2-2½fl oz de salsa de soja oscura", "1 cucharadita de hojas de tomillo", "2-3 cucharadas de aceite de oliva", "1 cebolla, más o menos picada", "4 piezas de pollo deshuesadas y sin piel, cortadas en piezas del tamaño de un bocado", "2 pimientos de varios colores, sin semillas y picados", "2 cucharadas de miel", "2 cucharadas de azúcar moreno oscuro", "1 x 330 ml / 11 fl oz botella de cerveza", "300ml / 10fl oz de caldo de pollo", "sal y pimienta negra recién molida", "2 orejas de maíz dulce en la mazorca, cada corte en 4 piezas", "rociar aceite de oliva", "300g / 10½oz de arroz basmati", "6 dientes", "2 hojas de laurel", "puñado de cilantro picado y perejil"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para el pollo jerk, mezcle el jengibre, el ajo, el chile, el condimento, la salsa de soja oscura y las hojas de tomillo en un procesador de alimentos hasta que quede suave.", "Calentar el aceite de oliva en una olla grande y freír las cebollas durante 2-3 minutos o hasta que se ablanden. Agregue las piezas de pollo y los pimientos y fría hasta que se doren.", "Agregue el jerk paste a la sartén y cocine por unos minutos más. Agregue la miel, el azúcar y vierta la cerveza. Desglaze raspando la base de la sartén para liberar cualquier residuo caramelizado. Agregue el caldo de pollo, sazone con sal y pimienta negra y reduzca el fuego. Cocine por 20-25 minutos, o hasta que la salsa se espese y el pollo esté bien cocido.", "Rocíe los trozos de maíz dulce con un toque de aceite de oliva y la parrilla a la parrilla en una sartén caliente durante unos minutos en cada lado, hasta que estén bien carbonizados. Sazone con sal y pimienta negro. Mantenga caliente en el horno si es necesario.", "Para el arroz herby, coloque el arroz basmati en un colador y lave con agua fría hasta que el agua salga limpia. Desagüe. Coloque el arroz en una olla con los dientes de ajo y las hojas de laurel. Cubra con agua hasta que esté ½ pulgada / 1 cm por encima del arroz y lleve a ebullición. Reduzca el fuego, cubra con una tapa y cocine a fuego lento durante 12-15 minutos o hasta que esté cocido. Una vez cocinado, revuelva a través del cilantro y el perejil.", "Para servir, vierta el arroz herby en los platos para servir. Coloque el pollo jerk al costado y agregue los pedazos de maíz dulce a la parrilla."]}, {"isVegetarian": true, "title": "Cerveza y miel, centeno, harina, oatcakes", "url": "www_bbc_co_uk_food_recipes_beer_and_honey_rye_flour_42117", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["90g / 3¼ oz de harina de centeno", "90g / 3¼ oz de harina blanca fuerte", "180 g / 6¼ oz de avena, mezcladas con un polvo grueso en un procesador de alimentos", "10g / ¼ oz acción rápida levadura seca", "1½ cucharadita de sal marina", "1 cucharada de miel líquida", "1½ cucharadita de aceite de girasol", "300ml / 10fl oz de agua tibia", "450ml / 16fl oz pale ale", "mantequilla o aceite, para freír"], "serves": "Hace 12-16", "time": {"preparation": "1-2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["En un tazón grande combine las harinas, la avena mezclada, la levadura y la sal. En una jarra separada, mezcle la miel, el aceite de girasol y el agua tibia. Haga un pozo con los ingredientes secos y agregue la mezcla líquida.", "Agregue la cerveza y mezcle bien. La masa estará líquida, como una salsa espesa. Cubra con una toalla de té húmeda y deje en un lugar cálido durante una hora. La mezcla comenzará a burbujear y espesar.", "Para cocinar los pasteles de avena, derrita un poco de mantequilla en una sartén antiadherente grande a fuego medio. Vierta un cucharón lleno de la mezcla y revuélvala en la sartén, como si estuviera haciendo un panqueque.", "Cocine hasta que la torta de avena quede dorada y crujiente en la parte inferior y pueda voltearse con confianza (aproximadamente cinco minutos). Dale la vuelta y cocina el otro lado de la misma manera.", "Transfiera a un estante de enfriamiento hasta que esté listo para servir.", "Repita con la mezcla restante."]}, {"isVegetarian": false, "title": "Cerveza de merluza con guisantes blandos y salsa tártara", "url": "www_bbc_co_uk_food_recipes_beer_battered_hake_with_37004", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "25g / 1oz de mantequilla", "sal marina y pimienta negra recién molida", "1 limón, cortado en cuñas", "Harina normal de 200g / 7oz", "15 g / ½ oz de levadura fresca", "pizca de sal", "pizca de azúcar en polvo", "Cerveza 200ml / 7fl oz", "1 cucharada de vinagre de sidra", "aceite vegetal, para freír", "Filete de merluza de 4 x 200 g / 7 onzas, con piel, espinas deshuesadas y cortadas", "1 cebolla, cortada en anillos", "4 rebanadas de pan blanco grueso", "mantequilla, para el pan, opcional", "3 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de sidra", "300ml / 11 fl oz aceite de colza", "50g / 1¾oz de alcaparras", "75 g / 2½ oz de pepinillos, picados", "1 chalote, finamente picado", "1 eneldo pequeño, picado", "2 cucharadas de perejil de flatillo picado", "½ limón, solo jugo"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para los guisantes blandos, remoje los guisantes en un tazón grande, en tres veces su volumen de agua durante al menos 1 hora y media o, si tiene tiempo, durante la noche.", "Escurra los guisantes, enjuáguelos bajo el grifo y colóquelos en una fuente grande y cúbralos con el agua. Agregue el bicarbonato de soda. Cubra y hierva, y una vez hervida, reduzca el fuego y cocine a fuego lento los guisantes durante 1½-2 horas, revolviendo de vez en cuando.", "Los guisantes deben ser suaves y de textura blanda pero no demasiado secos. Si están mojados, continúe cocinando sobre el fuego con la tapa apagada para secar un poco. Batir la mantequilla y sazonar con sal y pimienta.", "Para la merluza malteada, combine la harina, la levadura, la sal y el azúcar en un tazón.", "Agregue la cerveza y el vinagre y bata hasta formar una masa espesa.", "Dejar de lado para fermentar durante unos 30 minutos. Está listo para usar cuando la mezcla comienza a burbujear.", "Caliente una freidora a 190 ° C o 375 ° F o caliente el aceite para freír en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja cada trozo de cebolla en la masa para cubrirla completamente. Cocínelos en tandas en la freidora y cocine por 2-3 minutos hasta que estén dorados y cocidos.", "Sumerja cada trozo de pescado en la mezcla para cubrirla completamente. Bajarlos con cuidado en la freidora, y cocinar uno a la vez. Cocine durante 4-6 minutos hasta que el pescado esté cocido y la masa esté dorada.", "Rocíe la mezcla restante en la grasa para hacer sobras.", "Mantequilla el pan con la mantequilla ablandada y córtalo por la mitad.", "Para la salsa tartare de colza, mezcle las yemas de huevo, la mostaza y el vinagre en un tazón o procesador pequeño.", "Todavía batiendo, comience a agregar el aceite de colza muy lentamente para hacer una mayonesa: la mezcla debe ser espesa y ligera una vez que se haya incorporado el aceite.", "Agregue las alcaparras, pepinillos, chalotes y hierbas.", "Sazonar con sal y pimienta y un toque de jugo de limón.", "Para servir, coloque el pescado en los platos, con una cucharada de guisantes blandos al lado. Apila el pan y la mantequilla al lado y termina con un chorrito de jugo de limón y una cucharada de salsa tártara."]}, {"isVegetarian": false, "title": "Cerveza estofada de carne de res con puré cremoso", "url": "www_bbc_co_uk_food_recipes_beer_braised_shin_of_12682", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beer_braised_shin_of_12682_16x9.jpg", "ingredients": ["6 cucharadas de aceite de colza", "2 cebollas grandes, en rodajas finas", "4 zanahorias, en rodajas", "3 palitos de apio, en rodajas", "½ bulbo de ajo, golpeado", "3 cucharadas de harina natural, para quitar el polvo", "2kg / 4lb 8 oz espinilla de carne de res, con hueso (pide a tu carnicero que la corte en rodajas de 3cm / 1¼)", "568ml / 1 pinta ale", "300ml / ½ litro de carne de vacuno", "3-4 ramitas de romero", "sal y pimienta negra recién molida", "1 kg / 2 libras 4 oz de papas harinosas, como King Edward o Maris Piper, cortadas en cubos de 4 cm / 1½ pulgadas", "150g / 5½oz de mantequilla salada", "salpicar leche o crema, al gusto"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente 2 cucharadas de aceite en una sartén grande de fondo grueso a fuego medio. Agregue las cebollas, las zanahorias, el apio y el ajo y fría hasta que comiencen a colorear. Transfiera a una cacerola con tapa grande.", "Ponga la harina en un plato y sazone con sal y pimienta. Cubra la carne con la harina sazonada y sacuda el exceso de harina. Encienda el fuego en alto, luego agregue el aceite restante a la sartén. Freír la carne, en tandas, durante 1 minuto por cada lado hasta que se dore por todas partes. Agregue la carne a la cacerola.", "Agregue un chorro de cerveza a la sartén y quite los trozos de comida cocidos, luego vierta todo en la cazuela. Vierta la cerveza restante, el caldo de carne y el romero. Ponlo en el horno y cocina durante 3-4 horas, o hasta que la carne se desprenda fácilmente del hueso.", "Mientras tanto, ponga a hervir una olla de agua ligeramente salada y agregue las papas. Cocine por 15-20 minutos hasta que estén tiernos. Drene y regrese a la olla. Mash hasta que quede suave. Mezcle la mantequilla y la leche. Sazone al gusto con sal y pimienta.", "Sirve la espinilla cocida con el puré."]}, {"isVegetarian": true, "title": "Pan de cerveza y queso", "url": "www_bbc_co_uk_food_recipes_beerandcheesebread_89613", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 cucharaditas de azúcar", "2 cucharaditas de levadura seca", "450ml / 16fl oz brown ale, a temperatura ambiente", "520g / 1lb 2½oz de harina de pan blanco fuerte, más extra para espolvorear", "Harina integral de 320g / 11oz", "Queso cheddar 200 g / 7 oz, rallado", "75g / 2½ oz de queso parmesano (o similar queso duro vegetariano), rallado", "50 g / 2 oz de leche en polvo", "1½ cucharadita de sal", "1½ cucharadita de mostaza en polvo", "2 huevos de gallinas camperas, golpeados", "2 cucharaditas de semillas de hinojo", "1 huevo de gallinas camperas, solo blanco, para acristalamiento"], "serves": "Rinde 2 panes", "time": {"preparation": "más de 2 horas", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["En un recipiente, disuelva el azúcar y la levadura en la cerveza marrón y déjelo a un lado durante 5-6 minutos.", "Mezcle la harina de pan, la harina integral, el queso cheddar, el parmesano, la leche en polvo, la sal, la mostaza en polvo, los huevos y las semillas de hinojo en un tazón grande. Agregue la levadura y la mezcla de cerveza y mezcle bien con las manos hasta que la mezcla forme una masa suave.", "Con las manos enharinadas, amase la masa sobre una superficie de trabajo enharinada limpia durante 20-25 minutos hasta que quede suave y elástica. Si la masa se vuelve demasiado seca, agrega un poco de agua tibia.", "Divida la masa en dos panes y colóquelos en una bandeja grande para hornear. Con un cuchillo afilado, calce la parte superior de los panes con un patrón entrecruzado. Cubra con una toalla de té húmeda y limpia y déjela durante dos horas en un lugar cálido, seco y libre de corrientes de aire, hasta que la masa se haya duplicado.", "Precaliente el horno a 200C / 400F / Gas 6. Cuando los panes se hayan expandido, cepille cada uno con la clara de huevo.", "Transfiera los panes al horno y hornee durante 25-30 minutos, o hasta que el pan se haya cocinado y la masa esté dorada.", "Para servir, corta los panes y sirve con un gran tazón de sopa."]}, {"isVegetarian": false, "title": "Lata de cerveza con patatas con mantequilla de ajo", "url": "www_bbc_co_uk_food_recipes_beer_can_chicken_with_27487", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1½ cucharada de pimentón dulce ahumado", "½ cucharada de pimentón ahumado en caliente", "½ cucharadita de copos de chile", "2 cucharadas de mostaza Dijon", "1 cucharada de vinagre de vino tinto", "3 limas, solo jugo, más cuñas de lima extra para servir", "3 limones, solo jugo, más cuñas de limón extra para servir", "5 cucharadas de aceite de oliva", "2kg / 4lb 8oz de pollo", "4 papas para hornear, fregadas", "2 bulbos de ajo", "Lata de cerveza de 440 ml, medio llena", "3 cucharadas de cebollines finamente picados", "Mantequilla 250g / 9oz, ablandada", "sal marina y pimienta negra recién molida", "1 lechuga de cabeza, raíz eliminada, hojas separadas y lavadas", "4 tomates maduros, cortados en trozos", "¼ de pepino, cortado por la mitad a lo largo, luego en rodajas de media luna", "2 cucharadas de aceite de oliva virgen extra"], "serves": "Para 4 personas", "time": {"preparation": "1-2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Mezcle los paprikas, los copos de chile, la mostaza, el vinagre y los zumos de limón y lima en un tazón hasta obtener una pasta homogénea.", "Transfiera el adobo a una bolsa grande de plástico para alimentos, agregue 4 cucharadas de aceite de oliva y el pollo, luego selle la bolsa y sacúdala con cuidado para cubrir el pollo en el adobo. Reserve para marinar durante el mayor tiempo posible.", "Pinche las papas con un tenedor, luego frote con el resto del aceite y sazone con sal y pimienta. Envuelva cada una en papel de aluminio.", "Coloque un bulbo de ajo en otra hoja de papel de aluminio y rocíe con más aceite restante. Envuelva la bombilla firmemente en la lámina.", "Enciende la barbacoa. Permita que las llamas se enciendan y se apaguen, luego espere hasta que las brasas brillen y comiencen a ponerse blancas.", "Corta el segundo bulbo de ajo por la mitad horizontalmente y rellena las dos mitades dentro del pollo. Maniobre la lata de cerveza medio llena para que quepa justo dentro del pollo, de modo que la mitad inferior de la lata sobresalga del pollo.", "Coloque las papas envueltas y el bulbo de ajo en las brasas, luego coloque al pollo en posición vertical sobre su lata de cerveza en el centro de la barbacoa. Envuelva un pedazo de papel de aluminio alrededor de la base del pollo para formar un collar protector, luego cubra la barbacoa con la tapa y cocine durante 15 minutos.", "Retire el bulbo de ajo y déjelo enfriar. Continúe cocinando el pollo y las papas por otros 30 minutos o hasta que el pollo esté completamente cocido y las papas estén tiernas.", "Desenvuelve el ajo y exprime el ajo tostado de los dientes en un bol. Agregue el cebollín y la mantequilla.", "Para la ensalada, mezcle las hojas de lechuga, los tomates y el pepino en un tazón grande y luego rocíe con aceite de oliva.", "Para servir, transfiere el pollo cocido, que aún está de pie sobre una lata de cerveza, a un plato grande para servir. Desenvuelva las papas, corte una cruz en la parte superior de cada una, apriete suavemente y cuchara sobre la mantequilla de ajo. Coloque las papas alrededor del pollo, adorne el plato con las rodajas de limón y lima y luego sirva con la ensalada."]}, {"isVegetarian": false, "title": "Filetes con incrustaciones de mostaza y cerveza con miel y berenjenas de romero", "url": "www_bbc_co_uk_food_recipes_beerandhoneymustarde_88998", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150 g / 5 oz de semillas de mostaza amarillas", "75g / 3oz de semillas de mostaza marrón", "Vinagre de vino blanco 110ml / 4fl oz", "60g / 2½oz English set honey", "200ml / 7fl oz light ale", "Filetes de solomillo de 4 x 175 g / 6oz", "25g / 1oz de mantequilla", "4 cucharadas de aceite de oliva", "2 berenjenas, cortadas en trozos de 2.5cm / 1in", "2 chalotes de plátano grandes, toscamente picados", "3 ramitas de romero"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para la mostaza, coloca las semillas de mostaza en un tazón.", "Coloque el vinagre y la miel en una sartén no reactiva y caliente hasta que la miel se haya disuelto. Vierta la mezcla de vinagre y miel sobre las semillas de mostaza y mezcle bien.", "Agregue la cerveza y mezcle para combinar. Cubra con película adhesiva y déjela a un lado durante al menos cuatro horas, preferiblemente durante la noche.", "Vierta la mezcla de mostaza en un procesador de alimentos y mezcle hasta que quede suave. Esto tomará tiempo ya que todas las semillas de mostaza deben descomponerse.", "Cuchara en frascos y sello esterilizados.", "Para los filetes, coloque los filetes entre dos pedazos de película adhesiva y golpee ligeramente con un rodillo para aplanar ligeramente los filetes.", "Extienda dos cucharadas de mostaza sobre cada bistec.", "Calentar una sartén hasta que esté caliente, agregar la mantequilla y dos cucharadas de aceite de oliva. Una vez que la mantequilla se haya derretido agregue los filetes y cocine por 3-4 minutos en ambos lados, o hasta que estén cocidos a su gusto. Retire de la sartén y descanse durante al menos cinco minutos.", "Mientras tanto, caliente una sartén hasta que esté caliente y agregue el aceite de oliva restante. Agregue las berenjenas, los chalotes y el romero y fría durante 5-6 minutos, revolviendo ocasionalmente, hasta que las berenjenas estén doradas y suaves.", "Para servir, coloque un bistec en cada uno de los cuatro platos y cubra con una cucharada de mostaza. Coloque un par de cucharadas de la mezcla de berenjena al lado."]}, {"isVegetarian": false, "title": "Cerveza y bacalao majado en eneldo con guisantes blandos", "url": "www_bbc_co_uk_food_recipes_beeranddillbatteredc_92901", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450 g / 6oz de guisantes marrowfat, empapados en agua fría durante la noche", "25g / 1oz de mantequilla", "1 limón, solo jugo", "sal y pimienta negra recién molida", "15 g / ½ oz de levadura fresca", "1 pizca de azúcar en polvo", "Cerveza 200ml / 7fl oz", "1 cucharadita de vinagre de sidra", "Harina normal de 200 g / 7¼ oz", "1 pizca de sal, más extra para sazonar", "3 cucharadas de eneldo fresco picado", "aceite vegetal para freír", "4 x 200 g / 7 oz de filetes de bacalao, huesos de piel y alfiler eliminados", "1 limón, solo jugo", "50 g de brotes de guisantes", "1 cucharada de aceite de oliva extra virgen"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para los guisantes blandos, escurra los guisantes y enjuague bien con agua corriente. Coloque los guisantes en una olla grande con tapa, cubra con 600 ml de agua y deje que hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra la olla con una tapa, luego cocine a fuego lento durante 25-30 minutos o hasta que esté tierna. Retire la tapa y continúe cocinando hasta que la mayor parte del agua se haya evaporado y los guisantes estén muy suaves.", "Escurra el exceso de agua de los guisantes cocidos, luego agregue la mantequilla y el jugo de limón y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la cerveza y el bacalao rebozado en eneldo, espolvorea la levadura y el azúcar en un tazón. Verter sobre la cerveza y el vinagre, mezclar bien, luego batir la harina y la sal hasta que la mezcla esté bien combinada.", "Deja la mezcla a un lado para fermentar. (Está listo para usar cuando la mezcla comience a burbujear).", "Cuando la mezcla haya fermentado, agregue el eneldo y revuelva hasta que esté bien combinado.", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja el bacalao en la mezcla, luego fríe en el aceite durante 3-5 minutos, o hasta que esté dorado, crujiente y cocido. Retire el pescado del aceite con una espumadera y déjelo a un lado para escurrirlo sobre papel de cocina. Sazonar, al gusto, con sal y un poco de jugo de limón.", "Mezcle el aceite de oliva y una cucharadita del jugo de limón restante en un recipiente hasta que estén bien combinados. Agregue los brotes de guisantes y mezcle hasta que estén bien cubiertos en el aderezo", "Para servir, espolvorea algunos de los guisantes blandos en el centro de cuatro platos para servir, luego completa con un trozo de bacalao machacado y un puñado de brotes de arvejas."]}, {"isVegetarian": false, "title": "Pez a la cerveza", "url": "www_bbc_co_uk_food_recipes_beerbatteredfish_93119", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g / 2½ oz de harina de maíz", "Harina normal de 200 g / 7¼ oz", "1 cucharadita de sal marina fina", "330ml / 11½fl oz de cerveza real", "2 cucharadas de vinagre de vino blanco", "aceite de girasol, para freír", "4 cucharadas de harina normal", "½ cucharadita de sal marina fina", "4 x 200 g / 7¼ oz de filetes de pescado blanco, como eglefino o merlán", "fichas, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la mezcla, mezcle la harina de maíz, la harina común y la sal juntas en un tazón grande. Haga un pozo en el centro de la mezcla y mezcle la cerveza y el vinagre. Batir con un batidor de metal grande para hacer una mezcla suave con la consistencia de crema doble.", "Para el pescado, caliente una cacerola profunda de fondo grueso medio llena del aceite de girasol a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, use una freidora eléctrica de alta presión calentada a 180 ° C.", "Ponga la harina en una bolsa de polietileno grande y fuerte y sazone con la sal. Agregue los filetes de pescado, uno a la vez, y sacúdalos hasta que estén cubiertos con la harina sazonada.", "Cuando el aceite haya alcanzado la temperatura adecuada, revuelva bien la masa. Sumerja un filete de pescado enharinado en la mezcla hasta que esté bien cubierto. Levante el pescado con un par de tenazas y baje suavemente en el aceite caliente. Tenga cuidado con las salpicaduras ya que el aceite estará extremadamente caliente.", "Repita el proceso con un segundo filete de pescado y cocine con el primero durante 5-6 minutos (dependiendo del grosor de los filetes) o hasta que esté dorado y crujiente. Es importante que la masa no se dore demasiado rápido antes de que el pescado esté cocido. Retire de la sartén con una cuchara ranurada y transfiera a un plato forrado con papel de cocina para absorber el exceso de aceite.", "Vuelva a calentar el aceite y cocine las otras dos piezas de pescado exactamente de la misma manera. Sirve con papas fritas recién hechas."]}, {"isVegetarian": false, "title": "Abadejos azotados con cerveza con guisantes blandos, batatas fritas y salsa tártara", "url": "www_bbc_co_uk_food_recipes_beerbatteredhaddockw_89436", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml / ½ pinta de aceite vegetal, para freír", "6-8 cucharadas de harina natural, para dragado", "1 filete de eglefino", "½ cebolla española, pelada, cortada en anillos", "Harina de auto crianza de 200g / 7oz", "200ml / 7fl oz de cerveza o cerveza embotellada", "pizca de sal", "250g / 9oz de guisantes frescos", "2 cucharadas de aceite de oliva", "1 ramita de menta fresca, hojas solo, picadas", "sal y pimienta negra recién molida", "300ml / ½ pinta de aceite vegetal, para freír", "½ batata, pelada, cortada en chips", "harina común, para quitar el polvo", "pizca de sal", "2 yemas de huevo de gallinas camperas", "4 cucharadas de perifollo fresco picado", "4 cucharadas de perejil fresco picado", "1 cucharada de vinagre de vino blanco", "sal y pimienta negra recién molida", "150ml / 5fl oz de aceite vegetal", "2 cucharadas de pepinillos picados", "cuñas de limón, para servir"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Poner a hervir una olla de agua con sal.", "Para el eglefino atado de cerveza, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Espolvorea la harina común en un plato. Dragar el filete de eglefino y los aros de cebolla en la harina para cubrir. Coloque el plato de harina a un lado.", "Coloque la harina de auto aumento en un tazón grande y bata gradualmente en la cerveza, según sea necesario para hacer una masa espesa la consistencia de crema doble. Sazonar con sal.", "Sumerja el filete de eglefino y los aros de cebolla en la mezcla y cuidadosamente bájelos en el aceite caliente. Freír durante 8-10 minutos, o hasta que estén doradas y crujientes. Retire con una espumadera y escurra sobre papel de cocina.", "Para los guisantes blandos, agregue los guisantes al agua hirviendo con sal y cocine durante 4-5 minutos o hasta que estén tiernos. Escurra los guisantes y póngalos en un tazón. Agregue el resto de los ingredientes de guisante blando y mezcle con un tenedor hasta que estén bien combinados.", "Para las batatas dulces, caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Presione las batatas dulces en la harina común restante para recubrirlas, sacuda el exceso y luego cuidadosamente baje las virutas en el aceite caliente. Freír a fuego lento durante 6-7 minutos o hasta que estén doradas. Retire con una espumadera y escurra sobre papel de cocina.", "Para la salsa tártara, bate las yemas de huevo en un tazón.", "Coloque las hierbas, el vinagre de vino blanco, la sal y la pimienta negra recién molida en un recipiente pequeño apto para microondas y caliente en el microondas durante 30 segundos a máxima potencia. Vierta esta mezcla caliente sobre los huevos y mezcle hasta que estén combinados. Poco a poco agregue el aceite vegetal en una corriente delgada y siga batiendo hasta que todo el aceite se haya incorporado por completo y la mezcla tenga la consistencia de la mayonesa. Agregue los pepinillos picados.", "Para servir, coloque el filete de eglefino en un plato de servir y coloque las batatas, los aros de cebolla y los guisantes blandos al lado. Ponga la salsa tártara en un tazón para servir por separado en el lado. Adorne con las rodajas de limón."]}, {"isVegetarian": false, "title": "Ostras azucaradas con ensalada de berros y cebolla roja", "url": "www_bbc_co_uk_food_recipes_beerbatteredoystersw_88731", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["aceite vegetal, para freír", "1 cucharadita de levadura seca", "300ml / 11fl oz de cerveza", "Harina normal de 300g / 11oz", "24 ostras", "1 cucharadita de sal marina ahumada", "Vinagre de vino blanco 110ml / 4fl oz", "Azúcar en polvo de 110 g / 4 oz", "1 cebolla roja, finamente rebanada", "1 chile rojo grande, finamente cortado", "4 cucharadas de aceite de colza", "sal y pimienta negra recién molida", "200g / 7oz de berros"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las ostras, caliente una freidora a 190C / 375F. Caliente el aceite vegetal en una cacerola profunda y pesada, hasta que la miga de pan chisporrotee y se dore cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso; no lo deje sin supervisión).", "Coloque la levadura y la cerveza en un recipiente y mezcle.", "Agregue 200 g / 7 oz de la harina común y mezcle con una batidora suave. Dejar de lado por cinco minutos.", "Mientras tanto, desviste las ostras, conservando el jugo en un tazón.", "Coloque la harina común restante en un plato y el polvo de las ostras en la harina.", "Sumerja cada ostra en la mezcla de cerveza y déjela directamente en la grasa caliente, en tandas.", "Cocine durante unos dos minutos hasta que estén dorados y crujientes, unos pocos a la vez. Retire con cuidado las ostras con una espumadera y transfiéralas al papel de cocina.", "Para la ensalada, coloque el vinagre y el azúcar en una olla no reactiva y deje que hierva. Cocine a fuego lento hasta que el azúcar se haya disuelto.", "Coloque las cebollas rojas y el chile en un recipiente, luego vierta el vinagre caliente sobre ellos y revuelva para combinar. Dejar de lado por cinco minutos.", "Separe dos cucharadas del líquido de decapado de cebolla y colóquelo en un tazón con dos cucharadas de los jugos de ostras reservados. Agregue el aceite de colza y mezcle para combinar. Sazonar con sal y pimienta negra recién molida, al gusto.", "Coloque el berro en un recipiente. Escurra las cebollas rojas, agréguelas al recipiente y agregue el aderezo. Mezcle para combinar.", "Para servir, divida la ensalada en partes iguales entre cuatro platos, cubra cada porción con seis ostras y una pizca de sal marina ahumada."]}, {"isVegetarian": true, "title": "Rollba de remolacha y chocolate", "url": "www_bbc_co_uk_food_recipes_beetroot_and_chocolate_33061", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_and_chocolate_33061_16x9.jpg", "ingredients": ["Harina de auto aumento 250g / 9 oz", "4 cucharadas de cacao en polvo", "2 cucharaditas de polvo de hornear", "250g / 9oz de remolacha cocida en jugos naturales", "3 cucharadas de vinagre de vino blanco", "160ml / 5½fl oz de suero de leche", "160g / 5½oz de mantequilla, suavizada", "Azúcar en polvo 230g / 8oz", "3 huevos grandes de gallinas camperas", "Crema de queso 280 g / 10 oz", "50 g / 1¾oz de mantequilla sin sal, ablandada", "50g / 1¾oz de azúcar glas, tamizado", "½ cucharadita de extracto de vainilla", "2 x remolachas crudas", "200 g / 7 oz de azúcar en polvo"], "serves": "Hace 12 rebanadas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forre una lata de bandeja de 30x20cm / 12x8 pulgadas.", "Mezcle la harina, el cacao en polvo y el polvo de hornear en un tazón.", "Mezcle la remolacha en un procesador de alimentos hasta que tenga un puré áspero. Coloque el puré en un bol, agregue el vinagre y el suero de leche. Mezcle para combinar.", "Batir la mantequilla y el azúcar juntos hasta que estén suaves y esponjosos. Poco a poco batir los huevos, seguido por la mitad de la mezcla seca y la mitad de la mezcla de remolacha.", "Continúe mezclando suavemente, agregando el resto de los ingredientes secos y la remolacha restante. Vierta la mezcla en la lata y hornee durante 40-50 minutos. Dejar enfriar en la lata durante 10 minutos antes de sacarlo de la lata y dejar que se enfríe por completo.", "Mientras tanto, haz la guinda. Batir el queso crema y la mantequilla hasta que estén suaves. Batir el azúcar glas y el extracto de vainilla hasta que se combinen, luego extender el glaseado sobre la torta enfriada.", "Para los corazones de remolacha, cortar en rodajas finas la remolacha y cortar en 12 formas de corazón.", "Hierva el azúcar en 200 ml / 7 fl oz de agua hasta que el azúcar se haya disuelto, luego agregue los corazones de remolacha y cocine a fuego lento durante unos 10 minutos hasta que estén suaves y translúcidos. Con un tenedor, retire cuidadosamente los corazones de remolacha del almíbar de azúcar caliente y cuidadosamente póngalos en una toalla de papel para absorber el exceso de jarabe.", "Corta el pastel en 12 cuadrados pares, y luego decora cada cuadrado con un corazón de remolacha."]}, {"isVegetarian": true, "title": "Risotto de queso de remolacha y cabra", "url": "www_bbc_co_uk_food_recipes_beetroot_and_goats_80522", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500 g / 1 libra de remolacha cocida de 2oz", "1 litro / 1¾ de pinta de pollo o vegetales", "2 cucharadas de aceite de oliva", "30g / 1oz de mantequilla", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "Arroz risotto 300g / 10½ oz", "1 tomillo de ramita grande", "100ml / 3½fl oz de vino blanco", "perejil pequeño, finamente picado", "eneldo pequeño, finamente picado (opcional)", "exprimir el jugo de limón (opcional)", "sal y pimienta negra recién molida", "aceite, para freír en grasa", "puñado de hojas de col rizada, recortadas, lavadas y muy secas", "150g / 5½oz de queso de cabra cremoso, desmenuzado", "50 g / 1¾oz de parmesano"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la mitad de la remolacha con el caldo en un procesador de alimentos y mezcle hasta que quede suave. Vierta en una cacerola y cocine a fuego lento. Ralla o corta finamente la remolacha restante y déjala escurrir en un colador.", "Caliente el aceite de oliva y la mitad de la mantequilla en una cazuela grande o una cacerola. Agregue la cebolla y freír suavemente hasta que esté suave. Agregue el ajo y cocine por 2-3 minutos. Agregue el risotto de arroz y tomillo hasta que esté cubierto con aceite y mantequilla.", "Enciende el fuego y vierte el vino. Cocine por 1-2 minutos hasta que se reduzca. Baje la temperatura a medio y agregue un cucharón de caldo de remolacha. Condimentar con sal y pimienta. Revuelva continuamente hasta que el líquido haya sido absorbido. Repita hasta que se haya agregado todo el stock. En este punto, el arroz tendrá una textura cremosa pero aún estará al dente.", "Batir la mantequilla restante y la remolacha rallada. Revuelva a través de las hierbas, si usa, y revise el condimento, es posible que desee agregar un chorrito de jugo de limón. Retire la ramita de tomillo.", "Para la guarnición, llene a medias una cacerola de grasa o una freidora con aceite vegetal (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Cuando haya alcanzado los 170 ° C, agregue la col rizada deja algunas a la vez. Cocine por 1 minuto o hasta que esté crujiente y brillante. Escurrir sobre papel de cocina y espolvorear con sal.", "Divida el risotto entre 4 platos calentados y revuelva sobre el queso de las cabras y una pizca de parmesano en la mesa. Adornar con la col rizada."]}, {"isVegetarian": true, "title": "Ensalada de remolacha, judías verdes y queso feta", "url": "www_bbc_co_uk_food_recipes_beetroot_green_bean_and_83225", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beetroot_green_bean_and_83225_16x9.jpg", "ingredients": ["50g / 1oz de judías verdes", "100g / 3½oz de remolacha cocida", "25 g / 1 oz espinaca bebé", "40g / 1¾oz más ligero de queso al estilo griego, desmenuzado"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cocine a fuego lento las judías verdes en agua durante 4-5 minutos. Drene y enjuague con agua corriente fría hasta que se enfríe.", "Mezcle los frijoles con la remolacha y las espinacas en un tazón pequeño. Cubra con el queso y sirva."]}, {"isVegetarian": false, "title": "Pastel de capas de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_layer_cake_55402", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Remolacha 400g / 1lb", "4 cucharadas de aceite de oliva", "1 cucharadita de mostaza inglesa", "100g / 3½ oz de puerro, finamente picado", "50g / 1¾oz de mantequilla", "1 cucharada de harina", "425 ml / 15 fl oz de leche", "nuez moscada rallada", "pimienta negra recién molida", "100g / 3½oz de Cheddar maduro", "200 g / 7 oz de jamón asado ahumado", "parmesano, rallado"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Hierva la remolacha en agua ligeramente salada, pele y corte en rodajas de 3 mm / in. Coloque la remolacha en un recipiente y mezcle con dos cucharadas de aceite de oliva y mostaza. Freír el puerro en el aceite restante hasta que esté suave.", "Derrita la mantequilla en una cacerola a fuego medio, agregue la harina y luego agregue la leche en un flujo constante hasta que esté todo incorporado. Agregue una ralladura de nuez moscada y una pizca de pimienta negra, luego el queso cheddar y finalmente los puerros. Mezcle hasta que esté bien combinado y retire la sartén del fuego.", "Coloque una capa de remolacha en el fondo de un plato resistente al horno, vierta la salsa y agregue una capa de jamón. Repita estas capas, terminando con una capa de salsa y un parmesano de dispersión.", "Hornee en el horno por 20 minutos, o hasta que estén doradas."]}, {"isVegetarian": true, "title": "Salsa de remolacha", "url": "www_bbc_co_uk_food_recipes_beetroot_relish_74771", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Remolacha 300g / 10½oz, pelada", "½ cebolla, más o menos picada", "salpicar aceite de oliva", "½ cucharadita de semillas de mostaza amarilla", "125ml / 4fl oz de vinagre balsámico", "125ml / 4fl oz de vinagre de vino blanco", "225g / 8oz de azúcar", "1 diente", "Una pizca de sal marina", "Pizca de pimienta"], "serves": "Hace 2 tarros pequeños", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Mezcle la remolacha y la cebolla en un procesador de alimentos o licuadora. Dejar de lado.", "Calentar un poco de aceite en una sartén tapada y freír las semillas de mostaza hasta que exploten. (PRECAUCIÓN: cuando estallen las semillas de mostaza, mantenga la sartén lejos de su cara y ojos).", "Agregue todos los ingredientes y 125ml / 4fl de agua a una sartén grande o una olla grande. Poner a fuego medio, tapar y llevar a ebullición.", "Cocine durante 30-60 minutos, o hasta que la remolacha esté suave y el líquido se haya reducido y espesado a la consistencia deseada.", "Retire el exceso de líquido con un cucharón, según sea necesario, y retire el clavo de olor. Vierta en frascos esterilizados, selle y deje enfriar."]}]