[{"isVegetarian": false, "title": "Grilled pork chops with almond croquettes", "url": "www_bbc_co_uk_food_recipes_grilled_pork_chop_with_91412", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilled_pork_chop_with_91412_16x9.jpg", "ingredients": ["2 pork loin chops, about 2cm/¾in thick", "1 apple, cored and cut into wedges", "salt", "1 free-range egg yolk", "1 tsp English mustard", "2 tsp clear honey", "2 tbsp cider vinegar", "150ml/5fl oz vegetable or sunflower oil", "1 banana shallot, finely chopped", "1 garlic clove, finely chopped", "1 tbsp finely chopped flatleaf parsley", "1 tbsp finely chopped mint", "1 tbsp finely chopped basil", "1 tbsp finely chopped thyme", "salt and freshly ground black pepper", "500g/1lb 2oz mashed potatoes", "1 tbsp finely chopped flatleaf parsley", "50g/1¾oz plain flour", "1 free-range egg, beaten", "75g/3oz flaked almonds", "1 head Little Gem lettuce, roughly chopped", "2 handfuls lamb’s lettuce "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high. Place the pork chops and apple wedges in an ovenproof frying pan. Season the pork fat with salt and place under the grill for  and grill for 5 minutes on each side, or until the pork cooked through. ", "Meanwhile, make the dressing. Put the egg yolk, mustard and honey into a bowl. Add the cider vinegar and whisk, gradually adding the vegetable oil, whisking constantly, until thick and creamy. Add the shallot, garlic, parsley, mint, basil and thyme and whisk once more. Check the seasoning and set aside.", "Heat the oil in a deep-fat fryer or large saucepan to 180C/350F. (CAUTION: hot oil can be dangerous. Never leave the pan unattended.)", "To make the croquettes, check the seasoning of the mashed potatoes, add the remaining flatleaf parsley and mix well. Take a small handful and roll into a small sausage shape, repeating with all the potato mixture. ", "Prepare a plate of flour, a bowl of eggs and a plate of flaked almonds. Roll the potato sausages in the flour, then the eggs and then the flaked almonds. ", "Carefully lower the croquettes into the fat fryer for 2–3 minutes, or until golden brown, crisp and heated through. Remove using a slotted spoon and drain on kitchen paper. ", "Put the salad leaves into a bowl with enough dressing to just coat the leaves and toss well.", "Serve the pork chops with the croquettes, apple wedges and salad. "]}, {"isVegetarian": false, "title": "Grilled pork chops with blatjang and radishes", "url": "www_bbc_co_uk_food_recipes_grilled_pork_chops_with_74983", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz salt", "1 tsp coriander seeds", "1 tsp fennel seeds", "2 star anise", "1 tbsp roughly chopped stem ginger", "250g/9oz pork chops, trimmed ", "350g/12oz dried apricots", "175g/6oz raisins", "7g/¼oz black mustard seeds", "7g/¼oz white mustard seeds", "250g/9oz caster sugar", "375ml/13fl oz cider vinegar", "100g/3½oz ground almonds", "handful dried apricots, finely chopped ", "1 red chilli, finely chopped", "handful fresh coriander leaves", "½ mooli, thinly sliced", "½ black radish, thinly sliced", "10 breakfast radishes, thinly sliced", "olive oil, for drizzling", "salt and freshly ground black pepper ", "watercress, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["To make the pork chops, put the salt, coriander seeds, fennel seeds, star anise and stem ginger in a saucepan with 1.5 litres/2¾ pints water. Heat gently, then remove from the heat and chill until cold. ", "Put the pork chops in a container and pour over the cold marinade. Cover and leave in the fridge for 6 hours.", "Preheat a barbecue or grill to the highest setting. ", "To make the blatjang, mix together the whole dried apricots, raisins, both types of mustard seeds, sugar and vinegar in a saucepan. Cook over a low heat for 15 minutes, or until thickened. Stir in the ground almonds, chopped apricots, chilli and coriander.", "Grill the marinated pork chops for 5 minutes on each side, or until cooked through. ", "Meanwhile, to make the radishes, mix the mooli with the black radish and breakfast radishes, drizzle over the oil and season. ", "Serve the pork chops with the blatjang and radishes and scatter over the watercress."]}, {"isVegetarian": false, "title": "Grilled salmon and scallop kebab", "url": "www_bbc_co_uk_food_recipes_grilled_salmon_and_76093", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz salmon fillet, skinned and cut into 2cm/1in pieces", "4 scallops, coral removed", "8 cherry tomatoes, left whole", "1 green pepper, cut into 2cm/1in pieces", "1 red onion, cut into 2cm/1in pieces", "500g/1lb 2oz plain flour, plus extra for rolling ", "½ tsp caster sugar", "pinch salt", "3 tsp vegetable oil", "250ml/9fl oz full-fat milk", "1 medium free-range egg", "½ white cabbage, finely shredded", "¼ daikon, finely julienned", "1 bunch spring onions, finely chopped", "pinch chilli flakes", "20g/¾oz poppy seeds", "50ml/2fl oz rice wine vinegar", "pinch caster sugar", "¼ root fresh turmeric, peeled and grated", "1 garlic clove", "½ tsp chilli flakes", "½ tsp caster sugar", "1 tbsp white wine vinegar", "3 tbsp olive oil", "200g/7oz natural yoghurt", "½ cucumber, grated", "1 lime, juice only", "1 tbsp chopped fresh mint"], "serves": "Serves 8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the kebabs, thread all the ingredients alternatively on a wooden skewer, only one of each, and place on a plate in the fridge until all the other components are ready to serve.", "For the naan, put the flour in a large bowl and add the sugar, salt and one teaspoon of vegetable oil and stir.", "Whisk together the milk and the egg in a separate bowl..", "Gradually add the milk and egg to the flour. Knead to make a dough and cover with cling film. Leave to rest in a warm place for one hour. ", "Preheat the oven to 220C/425F/Gas 7. Dust two baking trays with flour.", "Once the dough has rested, pour the remaining oil over the dough and mix together.  ", "Flour a clean work surface and roll or shape the bread into eight teardrop shapes and place on the floured baking trays.", "Bake for 8-10 minutes, or until golden-brown and puffed up.", "For the slaw, place all the ingredients in a large bowl and mix. Set aside in the fridge.", "For the garlic and chilli dipping sauce, put all the dipping sauce ingredients in a small bowl and mix until well combined.", "For the mint raita, put all the raita ingredients in a medium bowl and mix and set aside.", "To cook the kebabs, preheat the grill to hot. Place the kebabs on a tray under the grill and cook for 8-10 minutes, or until cooked through.", "To serve, place the raita on each plate and the slaw in the centre and kebab on top. Serve the dipping sauce in a small dish and a naan on the side."]}, {"isVegetarian": false, "title": "Grilled salmon with Japanese seven-spice with miso broth", "url": "www_bbc_co_uk_food_recipes_grilled_salmon_with_36749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz udon noodles", "1.5 litre/2½ pints dashi or miso stock (from sachet)", "50ml/2fl oz mirin", "50ml/2fl oz dark soy sauce", "100g/3½oz firm tofu, cubed", "6 spring onions, sliced", "a few strands wakame seaweed", "1 pak choi, broken into separate leaves", "4 x 200g/7oz salmon fillets, skin on, scaled and pin-boned", "1 tbsp sunflower oil", "Japanese seven-spice powder (available from specialist suppliers online and Asian stores), to taste", "¼ mouli, peeled and julienned (if you can't get mouli, some shredded cabbage would also work here)", "few coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To cook the noodles, plunge them into a pan of boiling water. ", "Cook the noddles for four minutes and then drain and refresh in a bowl of iced cold water. Drain again.", "Put the dashi stock into a saucepan and add the mirin, soy sauce and tofu. Add the sliced spring onions and wakame seaweed. Simmer for 3-4 minutes. Stir in the pack choi and allow to wilt for 1-2 minutes.", "Preheat a griddle pan. Brush the salmon with oil and dust with the Japanese seven-spice powder. ", "Grill the salmon skin-side down on the griddle pan for 2-3 minutes, before turning over and finishing for a further 1-2 minutes. ", "To serve warm the udon noodles in the miso broth and ladle into serving bowls. Spoon the hot broth over. ", "Top with the griddled salmon and garnish with the strips of mouli and coriander leaf to serve. "]}, {"isVegetarian": false, "title": "Grilled salmon with tempura prawns", "url": "www_bbc_co_uk_food_recipes_grilled_salmon_with_78688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 handfuls baby spinach leaves", "2 handfuls baby watercress leaves", "3 tbsp coriander cress", "1 mango, peeled, stone removed, cut into 0.5cm/¼in dice", "1 tbsp white wine vinegar", "3 tbsp rapeseed oil", "1 pinch sugar", "500g/1lb 2oz salmon fillet, pin bones and skin removed, cut into 0.5cm/¼in thick slices", "110g/4oz butter, melted", "1 vanilla pod, split, seeds scraped out with a knife", "25g/1oz plain flour", "25g/1oz cornflour", "pinch salt", "75-110ml/3-4fl oz sparkling water", "12 raw king prawns, heads and shells removed, deveined"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, mix together the spinach, watercress and coriander cress in a bowl. Add half of the diced mango and mix again.", "Place the remaining diced mango and the white wine vinegar into a food processor and blend to a purée. ", "With the motor still running, slowly add the oil in a thin stream until the mixture is just emulsified. Season, to taste, with salt, freshly ground black pepper and a pinch of sugar. ", "Spoon the mixture over the salad and mix to combine. Set aside.", "For the salmon, preheat the grill to its highest setting. ", "Place a 20cm/8in chefs’ ring (or bottomless tart ring) onto a baking tray. Layer one quarter of the salmon slices into the ring, overlapping each slice a little.", "Mix the melted butter and vanilla seeds together in a bowl and season, to taste, with salt and freshly ground black pepper.", "Brush the melted butter mixture over the salmon layer, then remove the chefs’ ring. Repeat the process with the remaining salmon and butter mixture to create four rings of salmon.", "Place the salmon rings under the grill for 2-3 minutes, or until just cooked through. Slide each one onto a serving plate.", "Meanwhile, for the tempura prawns, heat the oil in a deep-fat fryer to 190C/375/Gas 5. Alternatively, fill a deep-sided frying pan two-thirds full with vegetable oil. Heat the oil until hot but not smoking. (Caution: hot oil can be dangerous. Do not leave unattended.) ", "Place the flour, cornflour and salt into a bowl and add the sparkling water, whisking well until the mixture forms a thick, smooth batter.", "Drop the prawns into the batter to coat fully, then place straight into the hot oil. Fry for 2-3 minutes, or until the batter is golden-brown and crisp and the prawns are pink and cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.", "To serve, pile a portion of salad onto each circle of salmon. Top with three tempura prawns."]}, {"isVegetarian": false, "title": "Grilled sardines with samphire and Little Gem lettuce", "url": "www_bbc_co_uk_food_recipes_grilled_sardines_with_52686", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20ml/¾fl oz Cabernet Sauvignon vinegar", "20g/¾oz Dijon mustard", "80ml/2¾fl oz olive oil ", "salt and pepper", "1 lemon, juice and zest", "3 Little Gem lettuce", "1 tbsp olive oil ", "60g/2¼oz samphire, picked", "8 large sardines, scaled and gutted", "coarse sea salt", "1 tbsp finely chopped parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a grill pan or wire rack over the heat or coals of a barbecue.", "For the dressing, whisk the vinegar, mustard and olive oil together in a bowl until fully emulsified. Season with salt and pepper, adding a little lemon juice if desired.", "For the sardines, lettuce and samphire, trim the brown root off the bottom of the lettuce and then cut into quarters. Brush with a little olive oil and place on the grill until charred and toasted. ", "Blanch the samphire in a pan of boiling water for twenty seconds, then remove from the water with a slotted spoon.", "Brush the sardines with a little oil and season with the sea salt. ", "Put the sardines onto the hot grill or barbecue and cook until the skin is charred; then turn over to cook the other side of the fish. ", "When cooked flake the fish into a bowl with the gem lettuce, parsley and and lemon zest. Add the samphire and dress with the red wine dressing."]}, {"isVegetarian": false, "title": "Grilled sardines with crab mayonnaise and dukkah", "url": "www_bbc_co_uk_food_recipes_grilled_sardines_with_92256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large free-range egg yolk", "50g/1¾oz brown crab meat, passed through a sieve", "½ red chilli, finely chopped", "½ garlic clove, finely chopped", "1 small tsp Dijon mustard", "100ml/3½fl oz extra virgin olive oil", "5 tbsp vegetable oil", "lemon juice, to taste", "4 tsp buttermilk", "½ small bunch coriander, finely chopped", "sea salt and freshly ground black pepper", "50g/1¾oz sesame seeds", "50g/1¾oz pistachio nuts", "10g/¼oz nigella seeds", "5g cumin seeds", "25g/1oz coriander seeds", "4 tsp extra virgin olive oil", "½ lemon, juice only", "4 tsp extra virgin olive oil", "8 large sardines, scaled, butterflied and tails left in tact", "2 small Little Gem lettuce, cut into 4 lengthwise", "½ tsp sumac spice mix", "½ tsp chilli flakes", "½ lemon, juice only", "sprigs of fennel herb"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the crab mayonnaise, put the egg yolk, crab, chilli, garlic and mustard in a bowl and whisk to combine. Mix the olive oil and vegetable oil in a jug. Slowly pour the oil into the bowl in a thin stream, whisking all the time until emulsified. Season with salt, pepper and lemon juice. Then stir in the buttermilk and chopped coriander. Set aside. ", "For the dukka, put the seeds and nuts in a dry frying pan and place over a medium heat. Cook carefully until the spices become fragrant and the nuts start to release their natural oils. Transfer everything to a pestle and mortar and pummel to a rough paste along with the olive oil and lemon juice. Season with salt and pepper and set aside.", "To cook the sardines, preheat the grill to a high heat.", "Drizzle the extra virgin olive oil over the sardines and Baby Gem quarters and then season with salt, black pepper, sumac and chilli flakes.", "Grill the Little Gem on all sides for about 2 minutes until lightly charred and softened Carefully lay the sardines skin-side up and cook for 2 minutes before flipping and cooking briefly on the flesh side. The sardines should be nicely charred and still a little pink inside. Squeeze some lemon juice over the sardines and lettuce.", "To serve, spoon a circle of mayonnaise on a plate and then arrange the sardines and Baby Gem quarters on top followed by the dukka and some sprigs of fennel herb."]}, {"isVegetarian": false, "title": "Grilled sirloin steak with salsa verde", "url": "www_bbc_co_uk_food_recipes_grilled_sirloin_steak_78860", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp roughly chopped fresh mint", "3 tbsp torn fresh basil", "3 tbsp roughly chopped flatleaf parsley", "1 shallot, roughly chopped", "1 garlic clove, roughly chopped", "1 lemon, zest only", "2 tbsp capers, drained ", "4 anchovies, roughly chopped", "½ tsp English mustard", "3 tbsp extra virgin olive oil", "100g/3½oz unsalted butter, softened", "1 garlic clove, finely chopped", "4 tbsp roughly chopped flatleaf parsley", "salt and pepper", "4 large field mushrooms", "20g/¾oz Japanese panko breadcrumbs", "4 x 150g/5½oz sirloin steak", "2 tbsp olive oil", "salt and pepper", "1 kg/2lb 4oz frozen chips", "vegetable oil, for deep-fat frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the salsa verde, place all the ingredients in a pestle and mortar and pound until you have a thick paste.", "For the garlic field mushrooms, preheat the grill to high.", "Place the softened butter in a large mixing bowl, add the garlic and parsley, and season with salt and pepper.", "Cut the stalks off the mushrooms and fill the mushrooms with the garlic butter and top with the breadcrumbs.", "Place under the grill for 4-6 minutes, or until cooked through.", "For the griddled sirloin steak with frozen chips, heat a large griddle pan, rub the steak with oil and season it with salt and pepper. Place on the griddle pan for 2-3 minutes each side.", "Remove from the griddle, cover and leave to rest in a warm place for five minutes.", "Heat a deep-fat fryer to 180C/350F, or until a cube of bread sizzles and turns brown after about a minute. (CAUTION: hot oil can be dangerous. Do not leave unattended. Deep-fat frying frozen chips is potentially dangerous, due to the high water content of the chips. Be sure to put the chips in the fryer a few at a time – you will certainly need to cook them in batches.) ", "Cook each batch for 4-5 minutes, or until golden-brown and cooked through. ", "Drain and place on a plate lined with kitchen roll. Season with salt and serve immediately.", "To serve, place each steak on a plate and spoon some salsa verde on top. Serve with the chips and one of the mushrooms for each serving."]}, {"isVegetarian": false, "title": "Grilled skate with spring lamb shoulder ragoût and salt-crust Jersey Royals", "url": "www_bbc_co_uk_food_recipes_grilled_skate_with_90321", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "500g/1lb 2oz diced lamb shoulder", "60g/2¼oz diced shallot", "10 sprigs picked thyme", "25g/1oz garlic", "25g/1oz tomato purée", "250g/9oz peeled tomatoes", "150g/5½oz brown chicken stock", "200g/7oz cooked barley", "30g/1oz sea purslane", "50g/2oz garden peas", "50g/2oz fresh broad beans, blanched", "800g/1lb 12oz plain flour", "7-8 free-range egg whites", "350g/12oz table salt", "10 medium-sized Jersey Royal potatoes", "5 sprigs fresh mint", "50g/1¾oz fresh edible seaweed", "¼ skate wing (about 50g/2oz), skin off ", "50g/1¾oz butter", "1 tbsp olive oil", "¼ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the spring lamb shoulder ragoût, heat two tablespoon of vegetable oil in a medium-sized pan and brown small batches of the lamb shoulder in the pan. Once browned, place the meat into a fine metal sieve to drain.", "Add the shallot and thyme to the same pan you used to brown the meat. After two minutes, add the garlic.", "Add the tomato purée and cook for two minutes.", "Stir in the fresh peeled tomatoes and chicken stock.", "Simmer for one hour, or until the meat is tender.", "Once the lamb is cooked, remove it from the cooking liquor with a slotted spoon and use a fork to break the meat up. If the cooking liquor looks like it needs to be thickened more to be a sauce consistency, continue to simmer until thickened. Set aside the cooking liquor and lamb.", "For the salt-crust Jersey Royals, preheat the oven to 180C/350F/Gas 4. Make the salt crust by mixing the flour, 175ml/6fl oz water, egg whites and salt until they form a wet pastry.", "Clean the Jersey Royals under a cold tab with a sponge to remove the bitter outer skin.", "Once the potatoes are cleaned, dry them with kitchen paper.", "Cut the pastry into two and roll out to a 3cm/1¼in thickness.", "Place one piece of pastry onto a tray lined with greaseproof paper.", "Place the Jersey Royals on top with the mint and seaweed covering them", "Place the second layer of the pastry on top and seal with a little water at the edges", "Cook the potatoes for 30-45 minutes in the oven.", "For the grilled skate, preheat the grill to hot. Place the skate wing onto a baking tray. Spread the butter onto the skate, drizzle over the olive oil and squeeze over the lemon juice. Place under the grill for around four minutes, or until cooked.", "To finish the ragoût, place the lamb and enough of the liquor to cover into a pan, add the cooked barley, sea purslane, garden peas and broad beans and warm through.  ", "To serve, spoon the lamb ragoût onto each of four plates. Carefully remove the meat from the skate wing and place on top of the ragoût.", "Serve with the salt-baked Jersey Royals."]}, {"isVegetarian": false, "title": "Grilled swordfish", "url": "www_bbc_co_uk_food_recipes_grilled_swordfish_71017", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 swordfish steaks (around 150g/5½oz each)", "salt and freshly ground black pepper", "50ml/2fl oz olive oil", "1 lemon, zest and juice only", "2 garlic cloves, crushed", "1 tsp dried oregano or 1 tsp mixed Italian herbs", "200g/7oz podded and peeled broad beans (around 300g/10½ oz podded weight, 1kg/2lb 4oz fresh unpodded weight)", "1 tbsp olive oil", "100ml/3½fl oz white wine", "20g/¾oz butter", "1 lemon, pared zest only, finely chopped", "50g/1¾oz green olives, finely chopped", "50g/1¾oz capers, finely chopped", "25g/1oz parsley, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the swordfish steaks with salt and pepper and place in a shallow dish. Mix all the marinade ingredients together, and pour over the swordfish. Leave to marinade for no longer than 15 minutes (you don’t want to risk the lemon “cooking” the fish).", "Meanwhile, to make the sauce, blanch the broad beans in a pan of boiling water for 2 minutes, then drain and set aside.", "Make the gremolata by mixing together the lemon zest, olives, capers and parsley. ", "Heat a tablespoon of olive oil in a heavy-based frying pan. When the pan is very hot, add the swordfish steaks and fry for 3–4 minutes on each side. ", "Remove from the pan and leave to rest while you finish the sauce. Deglaze the pan with the white wine, then add the butter. Swirl until the butter has melted, then add the blanched broad beans. Heat through.", "Serve the swordfish with the sauce spooned over and the gremolata on the side."]}, {"isVegetarian": false, "title": "Grilled squid with an instant spiced mayonnaise", "url": "www_bbc_co_uk_food_recipes_grilled_squid_with_an_81647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz fresh squid tubes and tenticles, tubes cut in half lengthways and flesh scored ", "4 tsp olive oil ", "2 lemons, juice only", "2 long red chillies, seeds removed, finely chopped", "sea salt and freshly ground black pepper ", "60g/2¼oz watercress ", "1 free-range egg ", "300ml/10fl oz vegetable oil ", "1 red chilli, seeds removed, finely chopped ", "2 tsp Dijon mustard", "1 tsp white vinegar ", "100g/3½oz wild rocket ", "½ bunch watercress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mayonnaise, blanch the watercress in a large saucepan of boiling water for 2 minutes. Drain and refresh under cold running water until completely cool. Squeeze out any excess water. Blend the watercress in a bowl with the remaining ingredients plus salt and freshly ground black pepper, using a hand-held blender, until you have a smooth mayonnaise. ", "Preheat a griddle pan over a medium-high heat. Season the squid with salt and pepper and drizzle with the oil, then cook on the hot griddle for 2 minutes (it should curl and go dark and sticky on the outside). Turn the squid and cook for a further minute. ", "Meanwhile, mix half the lemon juice with the red chillies. Remove the griddle from the heat and pour the lemon and chilli mixture over the squid. ", "To serve, put a handful of rocket and watercress on each of four plates. Place the squid on top, pour over the remaining lemon juice and serve with a spoonful of mayonnaise."]}, {"isVegetarian": false, "title": "Grilled tiger prawns, white onion purée and seared cucumber", "url": "www_bbc_co_uk_food_recipes_grilled_tiger_prawns_36749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 medium white onions", "1 tbsp olive oil", "1 sprig thyme", "1 cucumber, washed ", "2 pinches ground paprika ", "1 tbsp olive oil", "1 tbsp walnut oil", "1 tbsp olive oil", "1 tbsp Dijon mustard", "1 tbsp balsamic vinegar", "salt and freshly ground black pepper", "8 tiger prawns, heads and shells removed, deveined ", "1 lemon, zest only ", "2 tbsp olive oil", "pinch of ground paprika", "2 red chilli, julienned and fried", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "For the onion purée, trim both ends of the onions, but do not peel. Place both whole onions on a sheet of aluminium foil. Add the oil and thyme then season with salt and pepper. Roast for 1½ hours until very soft. ", "Once cooked, remove from the oven and discard the outer layer of the onions together with the thyme. Place the soft onions and any cooking juices into a blender and pulse to a smooth purée (add a tablespoon of water if necessary).", "For the garnish, peel and half the cucumber (keep the peel to use in the dressing), then cut into elegant bite-size chunks. Season the cucumber with salt, pepper and paprika. ", "Heat the oil in a frying pan and fry the cucumber until golden. Set aside.", "For the dressing, place all the cucumber peel (reserved from the garnish) in a juicer to produce a dark green juice. Put the juice in a small mixing bowl with all the other ingredients. Season with salt and pepper, then whisk to create a split vinaigrette dressing.", "For the tiger prawns, place the prawns in a mixing bowl, mix in the remaining ingredients, then season with salt and pepper. ", "Preheat a griddle pan over a high heat. Once hot, fry the prawns for a minute on each side, or until cooked through (the exact cooking time will vary depending on the size of the prawns).", "To serve, divide the prawns between serving plates. Spoon the onion purée alongside. Arrange the fried cucumber around the plates and drizzle over the dressing. Serve with the fried red chillies and coriander cress."]}, {"isVegetarian": false, "title": "Grilled tuna with tomato salsa", "url": "www_bbc_co_uk_food_recipes_grilled_tuna_with_tomato_29511", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz extra virgin olive oil", "2 lemons, juice and zest", "1 tsp honey", "1 small banana shallot, finely chopped", "50g/1¾oz green olives, chopped", "50g/1¾oz black olives, chopped", "1 garlic clove, crushed or grated", "2 tsp dried oregano", "½ tsp sea salt", "¼ tsp freshly ground black pepper", "4 x fresh tuna steaks (about 150g/5½oz each) ", "2 plum tomatoes, seeds removed and diced", "2 tbsp capers, roughly chopped", "100g/3½oz rocket, roughly chopped", "4 slices sourdough bread", "2 tbsp olive oil", "1 garlic clove ", "1 plum tomato, chopped and mashed with a little olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the vinaigrette, whisk the oil, lemon juice, lemon zest, honey, shallot, olives, garlic, oregano, salt and pepper together in a bowl and set aside. ", "Lay the tuna steaks in one layer in a shallow baking dish and pour two thirds of the vinaigrette over them. Turn the tuna to coat well. Cover with cling film and place in the fridge for 15 minutes.", "Meanwhile, combine the remaining vinaigrette with the tomatoes, capers, and rocket. Set aside.", "Heat the grill or a griddle pan to a medium-high heat. Grill the tuna for 3–4 minutes on each side for medium-rare or until cooked to your liking. ", "Drizzle the bread with oil and cook in a hot griddle pan for 1–2 minutes on each side or until char marks appear. Cool slightly then rub with the raw garlic, place the smashed tomato on top and season with salt and pepper.\r\n\r\n", "Serve the tuna steaks topped with the salsa and the garlic and tomato bruschetta on the side."]}, {"isVegetarian": true, "title": "Grilled asparagus with Stilton butter and red onion chutney", "url": "www_bbc_co_uk_food_recipes_grilledasparaguswith_78067", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, finely chopped", "1 tbsp brown sugar", "1 clove garlic, crushed", "3 tbsp balsamic vinegar", "1 bunch asparagus, ends trimmed", "olive oil", "15g/½oz butter", "30g/1¼oz Stilton cheese"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney place all of the ingredients into a small saucepan and cook over a gentle heat for fifteen minutes.", "For the asparagus, heat a grill pan and lightly brush the asparagus with oil.", "Grill until nicely charred on all sides for 4-5 minutes.", "In a small pan, melt the butter and add chunks of Stilton until melted.", "When ready to serve, plate up the asparagus, drizzle with the Stilton butter and place a spoonful of chutney on the side."]}, {"isVegetarian": false, "title": "Grilled and home-smoked mackerel with horseradish cream and beetroot salad", "url": "www_bbc_co_uk_food_recipes_grilledandsmokedmack_90876", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 mackerel, cleaned with cold water and filleted", "2 tbsp olive oil", "salt and freshly ground black pepper, to taste", "3 tbsp fresh horseradish, grated", "90ml/3½fl oz double cream", "1 lemon, juice only", "1 tbsp white wine vinegar", "3 tbsp rapeseed oil", "2 tbsp chervil, finely chopped", "2 tbsp chives, finely chopped", "2 tbsp tarragon, finely chopped", "2 large cooked beetroot, peeled and cut into 5mm slices, to serve", "1 red onion, finely sliced into rings, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the grill to high. Line the base of a wok with a double layer of aluminium foil, scatter a layer of wood chippings over and then place a steamer insert on top.  Cover with a lid and place onto a high heat.", "Lightly oil half of the mackerel fillets with half of the olive oil and place skin-side up onto the steamer insert. Cover the steamer with a tight fitting lid.", "Reduce the heat and cook for 4-7 minutes (depending on the size of the mackerel), or until just cooked through. Remove and set aside. (Smoking generates a great deal of smoke. Make sure you work in a well-ventilated area.)", "Preheat the grill to hot. ", "Place the remaining mackerel fillets, skin-side down, onto a clean work surface, season with freshly ground black pepper and spread over one tablespoon of the fresh horseradish and the remaining olive oil.", "Place the mackerel skin-side up onto a grill tray and cook under the grill for 3-4 minutes, or until cooked through.", "Place the double cream into a bowl, add half of the lemon juice and salt and freshly ground black pepper, to taste. Whisk until thickened. Add the remaining horseradish and stir to combine. Set aside.", "Place the remaining lemon juice, white wine vinegar and rapeseed oil into another bowl and whisk together. Add the herbs and season with salt and freshly ground black pepper.", "To serve, place one fillet of smoked mackerel at the top of each plate, skin-side up. Lay the beetroot slices alongside the mackerel, in a line. Top with red onion rings, then place the grilled mackerel next to the beetroot, skin-side up.", "Drizzle the beetroot with the herb dressing and place a dollop of horseradish cream alongside. Serve at once."]}, {"isVegetarian": true, "title": "Grilled asparagus with lemon and chive dressing", "url": "www_bbc_co_uk_food_recipes_grilledasparaguswith_86532", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["24 asparagus spears, hard stalks removed", "bowl iced water", "olive oil", "1 lemon, juice only ", "3-4 tbsp olive oil, or to taste", "1 shallot, finely chopped", "small handful fresh chives, chopped", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the asparagus, bring a pan of salted water to the boil. Add the asparagus to the water and blanch briefly.", "Using tongs or a slotted spoon, remove the asparagus from the boiling water and place immediately into the iced water, then drain.", "Heat a griddle pan until very hot. Drizzle olive oil over the asparagus and place onto the griddle. Cook, turning occasionally, until nicely marked and browned on all sides.", "For the lemon and chive dressing, mix the juice of the lemon in a bowl with the olive oil, chopped shallot and chives and season with salt and freshly ground black pepper.", "To serve, place six asparagus spears onto each of four plates. Dress with the lemon and chive vinaigrette."]}, {"isVegetarian": true, "title": "Grilled aubergines with miso", "url": "www_bbc_co_uk_food_recipes_grilledaubergineswit_90214", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledaubergineswit_90214_16x9.jpg", "ingredients": ["2 Japanese aubergines or 1 large purple aubergine", "vegetable oil, for shallow frying", "4 spring onions, green part only", "4 tbsp light (sweet) miso paste (available in some supermarkets and in Asian grocers)", "2 tsp sugar", "1 small knob fresh ginger", "1 tbsp shoyu or light soy sauce", "2 tbsp mirin"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare the aubergines. Slice the aubergines in half lengthways, keeping the stem end intact.", "Score the cut side of the aubergines diagonally, forming a diamond pattern in the flesh.", "Heat about 0.5cm/0.25in oil in a heavy-bottomed frying pan. When it's hot, add the aubergine halves, cut side down. Fry the halves until lightly browned, about three minutes. Turn over and lightly fry the other side for a further minute or two. The aubergines should be fairly soft.", "Carefully remove the aubergines from the pan with a fish slice and drain on kitchen paper.", "Preheat the grill to medium.", "Prepare the miso topping. Place the miso into a bowl and stir in the sugar. Grate the ginger into the bowl, then stir in the shoyu or soy sauce and mirin.", "Place the aubergines onto a baking sheet, cut-side up. Spoon the miso topping over the aubergine halves, then place them under the grill. Grill until the miso topping is just beginning to brown and bubble slightly, but don't allow it to burn.", "Finely slice the spring onions.", "Place the grilled aubergines onto a serving plate, scatter the finely sliced spring onions over the top and serve."]}, {"isVegetarian": true, "title": "Grilled aubergine with salsa verde", "url": "www_bbc_co_uk_food_recipes_grilledauberginewith_72909", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines sliced lengthways and grilled with olive oil until golden", "1 ball of mozzarella", "1 lemon, juice and zest only", "1 clove of garlic, finely chopped", "2 tbsp chopped flat parsley", "150g/5oz fresh white breadcrumbs", "100g/3½oz cherry tomatoes", "big bunch of mint", "big bunch of basil", "big bunch of parsley", "1 clove garlic", "1 lemon, juice and zest only", "70ml/2½fl oz good olive oil", "30g/1oz pine nuts"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["In a food processor, blend the breadcrumbs, mozzarella, lemon, garlic and parsley until a crumb consistency appears. ", "Make small balls of this and roll them up in the aubergine slices. Place in a baking dish.  ", "Roast the cherry tomatoes in some olive oil for about 20 minutes, until soft. When they are cooked, crush them lightly with a fork.", "Spoon some of the crushed tomatoes over the aubergine rolls and bake in the oven with plenty of olive oil for ten to fifteen minutes at 200C/400F/Gas 6.", "Place all the salsa verde ingredients in a food processor and blend to a coarse consistency. Divide the rest of the crushed tomatoes between four serving plates, lay two or three aubergines rolls on top and spoon over some salsa verde to serve."]}, {"isVegetarian": true, "title": "Grilled aubergine with tomato sauce and courgette flowers", "url": "www_bbc_co_uk_food_recipes_grilledauberginewith_86571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 aubergines, cut into long slices 1cm/½in thick", "plain white flour, seasoned with salt and freshly ground black pepper", "2 free-range eggs, beaten with a pinch of salt", "3 tbsp light olive oil", "300g/10oz mozzarella cheese, sliced", "110g/4oz parmesan cheese, freshly grated", "salt and pepper to taste", "extra virgin olive oil", "1 onion, finely chopped", "3 garlic cloves, finely chopped", "500g/1lb 2oz fresh tomatoes, roughly chopped", "500g/1lb 2oz canned chopped tomatoes", "¼ tsp dried oregano", "12 fresh basil leaves", "vegetable oil, for deep frying", "25g/1oz plain flour", "25g/1oz cornflour", "pinch salt", "75-110ml/3-4fl oz sparkling water", "4 courgette flowers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the aubergines, preheat the grill to high.", "Dredge the aubergine slices in the flour, then dip into the beaten egg.", "Heat a frying pan until hot and add the olive oil.", "Add the aubergine slices and fry, turning once, until golden-brown on both sides. Carefully remove each slice of aubergine and place onto kitchen paper and set to one side to drain.", "Transfer the aubergines onto an ovenproof tray and top with the chopped mozzarella and grated parmesan.", "Season with salt and freshly ground black pepper and place under the grill to cook until the topping is golden-brown and bubbling.", "For the tomato sauce, heat a pan until hot and add the olive oil, onion and garlic and fry for 4-5 minutes.", "Add the tomatoes and bring to the boil, then add the oregano, reduce the heat and simmer for 10-15 minutes. Halfway through the cooking add the basil leaves.", "Season, to taste, with salt and freshly ground black pepper and place into a food processor. Allow to cool for a couple of minutes, then blend until smooth.", "For the courgette flowers, heat a deep heavy-bottomed pan two-thirds filled with vegetable oil until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Sieve the flour, cornflour and salt into a bowl and add the sparkling water. Stir to combine very briefly, until the batter just comes together, leaving any lumps.", "Dip the courgette flowers into the batter and turn to coat fully, then carefully place into the hot oil. Deep-fry on each side until just golden and crisp. Remove from the pan with a slotted spoon and drain onto kitchen paper.", "To serve, spoon some tomato sauce onto each plate and top with some grilled aubergine slices. Garnish with a battered courgette flower and serve."]}, {"isVegetarian": true, "title": "Grilled bananas with rosemary, toffee sauce and instant ice cream", "url": "www_bbc_co_uk_food_recipes_grilledbananaswithro_83882", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large bananas, skin on", "4 sprigs fresh rosemary", "200ml/7fl oz double cream", "150g/5oz butter", "150g/5oz dark brown sugar", "2 tbsp black treacle", "2 tbsp golden syrup", "4 bananas, peeled, cut into chunks and frozen in a freezer bag or on a tray", "¼ tsp vanilla essence", "3-4 tbsp caster sugar", "150ml/5fl oz buttermilk"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Insert a sharp knife into one end of the bananas to create a slit in the skin and insert the sprig of fresh rosemary. Heat a griddle pan until very hot.", "Place the bananas with the skin still on onto the griddle pan and griddle for 3-4 minutes each side, or until the skin is dark brown and starting to split.", "To make the toffee sauce, simply place the double cream, butter, sugar, treacle and golden syrup into a saucepan over a medium heat and bring to the boil. Stir well to ensure all the ingredients are combined and dissolved.", "To make the ice cream, tip the frozen banana chunks into a food processor. Add the vanilla essence, sugar and 75ml/2½fl oz of the buttermilk. Turn on the processor and let it run for 20-30 seconds.", "While the food processor is still running, gradually pour in the remaining buttermilk in a steady stream. Let the machine run until the mixture is smooth and creamy.", "Serve each banana in a bowl as you would a jacket potato: cut open down the centre, with the skin on. Pour over a spoonful of the toffee sauce and place a scoop of ice cream on top."]}, {"isVegetarian": false, "title": "Grilled beef rump steak with swede fondant", "url": "www_bbc_co_uk_food_recipes_grilledbeefrumpsteak_84729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz rump steak", "2 sprigs fresh rosemary, leaves only", "2 garlic cloves, chopped", "3 tbsp olive oil", "salt and freshly ground black pepper", "1 tbsp olive oil", "75g/2½oz swede, sliced into 4cm/1½in x 1½cm/½in round pieces", "150ml/¼ pint hot chicken stock"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the beef, place all of the ingredients into a small bowl and leave the beef to marinate for about ten minutes. ", "Heat the griddle pan over a high heat and griddle the marinated beef for 3-4 minutes. Turn the beef over and cook on the other side for 2-3 minutes. Set aside and leave to rest in a warm place.", "For the fondant, heat the oil in an ovenproof frying pan, add the swede and cook for 2-3 minutes on each side, until golden-brown. Add the chicken stock to cover the swede.", "Transfer the pan to the oven and bake for 12-14 minutes, or until softened.", "To serve, place the marinated griddled beef onto a serving plate along with the swede fondant."]}, {"isVegetarian": true, "title": "Roasted broccoli", "url": "www_bbc_co_uk_food_recipes_grilledbroccoli_83988", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1  medium head of broccoli, broken up into florets", "1 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat an ovenproof griddle pan until smoking hot. Place the broccoli into the pan and drizzle with the oil.", "Grill for two minutes on each side then transfer to the oven for five minutes, until cooked through."]}, {"isVegetarian": true, "title": "Grilled broccoli with chilli soy dressing", "url": "www_bbc_co_uk_food_recipes_grilledbroccoliwithc_90677", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz Tenderstem broccoli, blanched and drained", "1 tbsp vegetable oil", "2 tbsp soy sauce", "1 red chilli, chopped", "3 tbsp chopped fresh chervil", "1 tbsp sesame oil", "1 tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking, then drizzle the broccoli with the vegetable oil and add to the pan. Chargrill for 2-3 minutes, turning occasionally, or until the broccoli is golden-brown all over. ", "Combine the remaining ingredients in a small bowl for the dressing.", "Place the chargrilled broccoli on a serving plate and drizzle over the dressing. Serve immediately."]}, {"isVegetarian": true, "title": "Grilled broccoli with water chestnut dressing", "url": "www_bbc_co_uk_food_recipes_grilledbroccoliwithw_78109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz purple sprouting broccoli, trimmed", "2 tbsp soy sauce", "1 tsp honey", "4 water chestnuts, diced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of water to the boil.  Add the broccoli and par-boil for two to three minutes and drain.", "Heat a grill pan and chargrill the broccoli until nicely coloured.", "To make the dressing, mix together the honey, soy sauce and water chestnuts.", "Serve the broccoli warm, drizzled with the dressing."]}, {"isVegetarian": false, "title": "Grilled 'butterflied' anchovies with Caesar salad", "url": "www_bbc_co_uk_food_recipes_grilledbutterfliedan_87801", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 garlic cloves, peeled", "150ml/6fl oz white wine", "1 tbsp Dijon mustard", "4 free-range egg yolks", "3 marinated anchovy fillets, roughly chopped", "150ml/6fl oz extra virgin olive oil", "150ml/6fl oz rapeseed oil", "freshly ground black pepper, to taste", "16 fresh anchovies, cleaned, deboned and flattened out ", "salt and freshly ground black pepper ", "2 tbsp olive oil", "50g/2oz plain flour", "2 tsp sweet smoked paprika", "110g/4oz country bread, cut into small cubes", "2 tbsp olive oil", "salt and freshly ground black pepper ", "25g/1oz parmesan, grated", "3 Little Gem lettuces, leaves separated", "8 marinated anchovy fillets, finely sliced"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the Caesar dressing, place the garlic and white wine into a small pan and bring to the boil. Simmer for five minutes until the garlic is just softened.", "Take the pan off the heat and add the mustard, egg yolks and marinated anchovies, mixing to combine.", "Using a stick blender, blend to a purée and transfer to a bowl.", "Gradually add the two oils, whisking constantly. Season with freshly ground black pepper, to taste, and set aside. ", "For the anchovies, preheat the grill to high.", "Season the anchovies with salt and freshly ground black pepper and brush with the olive oil.", "Mix the flour with the paprika in a small bowl and then toss the anchovies in the flour to coat.", "Place the anchovies onto a grill pan and place under the grill for two minutes until just cooked.", "Turn and cook for a further minute and then remove from the grill.", "For the salad, mix the country bread with the olive oil, salt and freshly ground black pepper.", "Heat a frying pan until hot, add the bread and cook for 3-4 minutes, stirring occasionally, until golden-brown on all sides and crunchy.", "Remove the pan from the heat, add the parmesan and mix to coat the croutons with parmesan.", "Place the Little Gem leaves and sliced anchovies into a bowl with some of the Caesar dressing and mix to coat.", "At the last minute, add the croutons and mix together.", "To serve, place a pile of salad in the centre of each of four plates. Pile up the grilled anchovies next to the salad and serve immediately."]}]