[{"ingredients": ["mantequilla de perilla, para engrasar", "170 g / 6 oz% 20plain% 20chocolate% 20 (70%% 20cocoa% 20solids)", "5 huevos de gallinas camperas, separados", "225g / 8oz de azúcar", "284ml / 10fl oz de crema doble"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Prepare una lata de rodillo suizo engrasándola con mantequilla y luego cúbrala con un trozo de papel resistente a la grasa ligeramente más grande que la lata.", "Suavemente derrita el chocolate en un recipiente de vidrio sobre una olla de agua hirviendo.", "Batir las yemas de huevo en el azúcar.", "Cuando el chocolate se haya enfriado y derretido un poco, viértalo en la yema de huevo y la mezcla de azúcar.", "Batir las claras de huevo a picos rígidos, antes de doblar en la mezcla de chocolate.", "Vierta la mezcla en la lata y hornéela en el horno durante 15-20 minutos hasta que esté firme al tacto: sabrá que la torta está lista cuando un pincho insertado salga limpio.", "Pase una toalla de té debajo del agua fría y escúrrala.", "Coloque la toalla de té sobre el pastel de chocolate una vez que se haya enfriado un poco. Después de diez minutos retire la toalla de té, transfiera el rollo a la nevera y déjelo toda la noche.", "Al día siguiente, tamiza el azúcar glasé sobre una hoja de papel resistente a la grasa un poco más grande que la lata.", "Incline la torta sobre el papel fresco a prueba de grasa y retire la otra pieza de papel resistente a la grasa de la parte superior del trineo.", "Batir la crema doble y alisar todo el enredado.", "Enrolle el rollo, usando el papel antigrasa para ayudar a mantenerlo unido. Puede agrietarse un poco, pero esto no afectará la calidad del pastel."], "url": "www_bbc_co_uk_food_recipes_chocolateroulade_83888", "title": "Rollo de chocolate básico", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol, para engrasar", "6 huevos de gallinas camperas, separados", "175g / 6oz de azúcar en polvo", "50 g / 2 oz de cacao en polvo, tamizado", "25g / 1oz de almendras sin cáscara", "25g / 1oz de avellanas sin cáscara", "Azúcar en polvo de 110 g / 4 oz", "300ml / 10½ fl oz crema doble", "50 g / 2 oz de cacao en polvo, tamizado", "75 g / 3 oz de chocolate negro, rallado"], "method": ["Para el rollo, precaliente el horno a 180C / 465F / Gas 4.", "Engrase ligeramente una lata de rollo suizo de 23cm x 33cm / 9in x 13in con un poco de aceite de girasol y hilvane el pergamino para hornear.", "Coloque las yemas de huevo y el azúcar en un tazón grande y bata hasta que esté claro y pálido.", "Tamice el polvo de cacao en la mezcla de yema de huevo y mezcle hasta que esté completamente combinado.", "En un tazón limpio, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Agregue la mitad de las claras de huevo batidas a la mezcla de cacao y mezcle bien, luego doble suavemente las claras de huevo batidas restantes hasta que se combinen.", "Vierta la mezcla en la lata de rollo suizo, moviendo la lata para que la mezcla se distribuya uniformemente en las esquinas.", "Transfiera al horno para hornear por 20 minutos, o hasta que esté firme al tacto, luego retírelo del horno. Coloque una toalla de té limpia y seca encima del rollo y encima de este lugar, otra toalla de té que haya sido remojada en agua fría y bien escurrida. Deja en un lugar fresco por una hora.", "Para el relleno, caliente una sartén seca hasta que esté caliente y agregue las almendras, las avellanas y las tostadas hasta que se doren por todas partes.", "Retire las tuercas de la sartén, deje que se enfríe un poco, luego corte aproximadamente.", "Agregue el azúcar a la misma sartén y vuelva al fuego. Cocine hasta que el azúcar se haya derretido y se haya caramelizado hasta obtener un color dorado.", "Agregue las nueces picadas al caramelo y agite para combinar y cubrir las nueces con caramelo.", "Vierta la mezcla de caramelo y nueces en una bandeja para hornear bien engrasada y alineada, deje enfriar y deje reposar. Una vez establecido, retire la mezcla y divídala en trozos pequeños.", "Batir la crema hasta que se formen picos suaves cuando se quita la batidora, luego doblar los trozos de caramelo en la crema.", "Para servir, retire las toallas de té de la esponja y colóquelas en un trozo de pergamino para hornear que haya sido espolvoreado con polvo de cacao tamizado.", "Despegue el papel de la esponja y extienda la mezcla de crema batida uniformemente sobre la parte superior.", "Comenzando desde un extremo largo, enrolle la esponja, usando el papel con polvo de cacao para ayudar a levantar la torta a medida que la rueda hacia adelante.", "Una vez enrollado, empolva el rollo con más cacao en polvo tamizado y espolvorea el chocolate rallado sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_chocolaterouladewith_87177", "title": "Rollo de chocolate con crema de praliné", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225 g / 8 oz de chocolate negro, roto en pedazos", "Azúcar en polvo 80g / 3oz", "120ml / 4fl oz de crema doble", "60ml / 2fl oz de agua caliente"], "method": ["Pon todos los ingredientes en una olla de fondo grueso.", "Ponga un poco de calor y revuelva hasta que el chocolate se derrita y la salsa esté caliente."], "url": "www_bbc_co_uk_food_recipes_chocolatesauce_1302", "title": "Salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de cacao en polvo", "2 huevos de gallinas camperas, separados", "100ml / 3½ fl oz crema doble", "2 cucharadas de azúcar en polvo", "2 cucharadas de aceite de cacahuete", "1 naranja, segmentado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón grande mezcle el cacao y las yemas de huevo juntas. Agregue la mitad de la crema doble y mezcle.", "Batir las claras de huevo hasta formar picos duros. Continúe batiendo y agregue lentamente el azúcar hasta que tenga picos brillantes.", "Doble los blancos cuidadosamente en la mezcla de chocolate, luego caliente el aceite en una sartén pequeña antiadherente.", "Vierta la mezcla en la sartén caliente, luego transfiérala al horno durante 8 minutos o hasta que esté bien cocida.", "Para servir, vierta sobre la crema doble restante y adorne con las naranjas segmentadas."], "url": "www_bbc_co_uk_food_recipes_chocolatesouffle_81163", "title": "Chocolate soufflé", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150 g / 5¼ oz de mantequilla, cortada en cubos, más extra para engrasar", "250g / 8¾oz de harina natural, más extra para quitar el polvo", "50g / 1¾oz de azúcar glas", "vaina de vainilla, solo semillas (raspado con un cuchillo)", "1 huevo de gallinas camperas, golpeado", "400g / 14¼ oz de chocolate negro, roto en pedazos", "150ml / 5½ fl oz de leche", "250ml / 8¾ fl oz de crema batida", "2 huevos de gallinas camperas, golpeados", "crema coagulada, para servir"], "method": ["Precaliente el horno a 200C / 400F / Gas 6. Engrase una caja agria de 28cm / 11in con mantequilla.", "Para la repostería dulce, en un procesador de alimentos, pulse la mantequilla y la harina hasta que la mezcla se asemeje a pan rallado.", "Transfiera la mezcla de mantequilla y harina a un recipiente y agregue el azúcar glas y las semillas de vainilla. Mezcle hasta que esté bien combinado.", "Agregue el huevo batido y mezcle, con sus manos, hasta que la mezcla se una como masa. Envuelva la masa en una película adhesiva y enfríe en la nevera durante 30 minutos.", "Pase el pastel frío sobre una superficie ligeramente enharinada hasta que tenga 30-35 cm / 12-14 pulgadas de diámetro. Alinee la lata de tarta preparada con la masa, presionándola suavemente sobre la lata y recortando cualquier exceso. Alinee la caja de repostería con el pergamino para hornear y llene hasta la mitad con los granos de cerámica para hornear, luego transfiera al horno y hornee por 8-10 minutos.", "Retire los frijoles para hornear y el pergamino para hornear, luego pique la masa varias veces con un tenedor. Regrese al horno y continúe cocinando por otros 4-5 minutos o hasta que la masa esté crujiente y dorada.", "Reduzca la temperatura del horno a 130 ° C / 250 ° F / Gas 1.", "Para el relleno de tarta, hierva un poco de agua en una sartén, luego reduzca el fuego hasta que el agua hierva a fuego lento. Suspenda un recipiente a prueba de calor sobre el agua. No permita que la base del recipiente toque el agua. Agregue las piezas de chocolate negro al recipiente y revuelva hasta que quede suave y completamente derretido. Retire el recipiente del fuego y déjelo a un lado.", "Traiga la leche y la crema a ebullición en una sartén, luego vierta la mezcla sobre el chocolate derretido.", "Agregue los huevos batidos y mezcle hasta que estén suaves y bien combinados.", "Vierta la mezcla de relleno en la caja de repostería y hornee durante 20-25 minutos, o hasta que se endurezca. Dejar que se enfríe antes de servir.", "Para servir, coloque una rebanada de tarta en el centro de cada plato de servir. Cucharee un poco de crema coagulada al costado."], "url": "www_bbc_co_uk_food_recipes_chocolatetartwithclo_91269", "title": "Tarta de chocolate con crema cuajada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 tarta de 28 cm / 11 in", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "pizca de sal", "125g / 4½oz de mantequilla fría", "3 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "400 ml / 14 fl oz crema doble", "algunas gotas de extracto de vainilla", "100 g / 3½ oz de azúcar en polvo", "400g / 14 oz de chocolate negro, aproximadamente 70 por ciento de sólidos de cacao", "50g / 2oz de mantequilla", "250ml / 9fl oz de crema individual", "1 vaina de vainilla, dividida longitudinalmente", "100g / 3½oz de chocolate blanco, picado", "frambuesas y ramitas de menta fresca, para servir"], "method": ["Para la masa, coloque la harina, la sal y la mantequilla en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado.", "Agregue las yemas de huevo y el azúcar y pulse hasta que la mezcla se una para formar una masa. Es posible que deba agregar un chorrito de agua helada si la masa está demasiado seca. Coloque en un tazón, cubra el tazón con película adhesiva y enfríe en la nevera durante 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa sobre una superficie ligeramente enharinada hasta que sea lo suficientemente grande para forrar una lata de tarta acanalada de 25cm / 10in. Coloque en la lata, luego coloque un trozo de papel a prueba de grasa en la parte superior y péselo con alubias o arroz.", "Coloque en el horno por 15 minutos, luego quite el papel y los frijoles y vuelva al horno por cinco minutos, o hasta que estén ligeramente dorados.", "Mientras tanto, para el relleno, lleve la crema, el extracto de vainilla y el azúcar lentamente a ebullición en una sartén.", "Rompa el chocolate y la mantequilla en trozos y colóquelos en un tazón grande. Verter sobre la mezcla de crema y batir lentamente hasta que el chocolate se haya derretido y la mezcla esté suave.", "Vierta la mezcla de chocolate en la caja de tarta y deje enfriar. Coloque en la nevera para establecer durante dos horas.", "Para la salsa, coloque la mitad de la crema y la vaina de vainilla en una sartén y caliente hasta que la mezcla esté tibia pero no demasiado caliente cuando la toque con un dedo. Quite el fuego y retire la vaina de vainilla.", "Agregue el chocolate blanco y revuelva hasta que se derrita. Agregue la crema restante.", "Para servir, corte la tarta en rodajas y rocíe sobre la salsa de chocolate blanco. Servir con frambuesas y una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_chocolatetartwithwhi_87928", "title": "Tarta de chocolate con salsa de chocolate blanco", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatetartwithwhi_87928_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de azúcar en polvo", "6 huevos de gallinas camperas, separados", "Harina normal de 50g / 2oz", "175g / 6oz de chocolate negro, derretido", "Puré de castañas edulcorado 150 g / 5 oz", "Crema doble de 150 ml / 5 fl oz, batida hasta que se forman picos suaves cuando se quita la batidora", "50g / 2oz mascarpone", "75g / 3oz de castañas cocidas, más o menos picadas", "2-3 cucharadas de azúcar glas, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Cubra una lata de rollo suizo de 23x33cm / 9x13in con una hoja de papel resistente a la grasa y cepille el papel ligeramente con aceite vegetal.", "Batir el azúcar y las yemas de huevo en un bol hasta que estén pálidas y gruesas. Agregue la harina hasta que se mezcle, luego agregue el chocolate derretido.", "Mientras tanto, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Doble suavemente una cucharada de claras de huevo batidas en la mezcla de chocolate, con una cuchara de metal grande, luego doble suavemente las claras de huevo restantes hasta que se combinen. (NB: No mezcle en exceso)", "Con cuidado, vierta la masa de torta en la lata de rollo suizo preparada y hornee durante 18-20 minutos, hasta que la torta se haya levantado y salte hacia atrás cuando se presione suavemente un dedo en el centro.", "Cuando el pastel esté cocido, déjelo a un lado, en la lata, en una rejilla de alambre, para que se enfríe durante al menos dos horas.", "Cuando el pastel esté completamente frío, pasa un cuchillo de mantequilla por el borde interior de la lata para aflojar el pastel. Extiende una toalla de té sobre una tabla de cortar grande. Con un movimiento audaz, coloque la torta entera sobre la toalla de té, luego levante la lata. Con cuidado quite el forro de papel resistente a las grasas.", "Mientras tanto, para el relleno, mezcle cuidadosamente el puré de castañas, la crema batida y el mascarpone en un bol hasta que estén bien combinados, luego doble las castañas picadas. Extiende el relleno por todo el pastel, dejando un borde de 2 cm / 1 pulg. Libre en el borde.", "Comenzando en el lado más largo de la torta, suavemente, pero con firmeza, enrolle la torta, como lo haría con un panecillo suizo, usando la toalla de té como guía. Transfiera el rollo suizo a un plato plano.", "Para servir, corte el tronco de yule en rodajas y polvo con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolateyulelog_93127", "title": "Chocolate yule log", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7 oz de hojas de choi sum (col china), en rodajas", "100g / 3½ oz azucarados arvejas", "2 zanahorias grandes, en juliana", "1 pimiento rojo, sin semillas, en rodajas", "1 pimiento amarillo, sin semillas, en rodajas", "240g / 8½oz de piña en conserva, escurrida, en rodajas", "2 cebollas tiernas, finamente cortadas", "2-3 cucharadas de aceite de cacahuete o aceite de oliva", "7 cucharadas de jugo de piña", "2 cucharadas de salsa de soja ligera", "1 cucharada de vinagre de arroz o vinagre de sidra", "pizca de pimienta negra recién molida"], "method": ["Para la ensalada, mezcle todos los ingredientes de la ensalada en una ensaladera grande.", "Para el aderezo, mezcle todos los ingredientes del aderezo en un tazón pequeño y rocíe la ensalada. Mezcle bien para cubrir, luego apile en platos para servir y sirva."], "url": "www_bbc_co_uk_food_recipes_choisumandmixedveget_89262", "title": "Choi sum y ensalada de vegetales mixtos con aderezo de piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["170g / 6oz de frijoles", "280g / 10oz de cebada", "2 cucharadas de grasa de ganso o aceite de girasol", "Pechuga de carne de 1,5 kg / 3 lb 5 oz, o bistec estofado, cortado en cubos", "Patatas de 1.8kg / 4lb, preferiblemente King Edward o Maris Piper, peladas y dejadas enteras", "sal marina y pimienta negra recién molida", "Harina de 280g / 10oz", "2 cucharaditas de polvo de hornear", "1 cebolla grande, cortada en cubos pequeños", "2 cucharadas de aceite de girasol"], "method": ["Remoje los frijoles en agua fría durante 24 horas antes de que se necesiten. Puede usar frijoles enlatados, pero los frijoles secos le dan un sabor mucho mejor.", "En la noche de cocinar el plato, primero haga la bola de masa. Coloque la harina y el polvo de hornear en un bol y agregue la cebolla, el aceite y el condimento.", "Agregue suficiente agua para hacer una masa suave, forme un óvalo graso, luego envuélvala en papel film y déjela enfriar en la nevera durante al menos 30 minutos.", "Precalentar el horno a 120C / 250F / Gas ½. Lave y escurra la cebada y escurra los frijoles empapados.", "Engrase una cacerola grande y pesada o una olla grande con grasa de ganso o aceite de girasol (no use aceite de oliva) y coloque la carne en el centro del plato.", "Coloque la bola de masa, los frijoles, la cebada y las papas alrededor de la carne, luego vierta agua hirviendo para cubrir todo. Sazonar con sal y pimienta negra recién molida y cubrir con una tapa hermética. Coloque en un estante bajo en el horno y deje cocinar durante la noche.", "Por la mañana, verifique que haya suficiente líquido en la olla, por lo general hay suficiente para dejar que el plato se cocine como está, pero si se ve seco, agregue un poco de agua. El plato estará listo para la hora del almuerzo. Si desea un color más oscuro, puede calentar el horno un par de horas antes de comerlo."], "url": "www_bbc_co_uk_food_recipes_cholent_16734", "title": "Cholent", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cholent_16734_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g de garbanzos de lata, escurridos y enjuagados", "1 lechuga iceberg, picada", "½ lechuga romana picada", "120 g / 4½ oz de salame italiano, cortado en tiras delgadas de aproximadamente 5 cm / 1¾ de largo", "200 g / 7 oz de mozzarella, aproximadamente picada", "3 tomates, toscamente picados", "½ pepino, aproximadamente picado", "pequeñas hojas de albahaca, finamente picadas", "sal marina escamada y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino tinto", "½ cucharadita de mostaza en polvo", "½ cucharadita de azúcar en polvo"], "method": ["Para hacer la ensalada, mezcle los garbanzos con 1 cucharadita de sal, luego mezcle con los ingredientes restantes en un tazón grande.", "Para hacer el aderezo, mezcle todos los ingredientes junto con ½ cucharadita de sal 12 vueltas del molinillo de pimienta negro en un tazón.", "Rocíe el aderezo sobre la ensalada y mezcle bien. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chopped_salad_41277", "title": "Ensalada picada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chopped_salad_41277_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de pato", "50g / 2oz de mantequilla sin sal ablandada", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "500ml / ½ litro de aceite de oliva", "Filete de salmón curado asado en horno a 200 g / 7oz, cortado en 4 piezas", "110g / 4oz de berros, hojas recogidas", "ramitas de perifollo fresco"], "method": ["Para los huevos de pato, hierva una olla de agua. Con una cuchara ranurada, baje suavemente los huevos de pato en el agua y cocine a fuego lento durante 7-8 minutos para hervir los huevos a fuego lento.", "Con una cuchara ranurada, retire los huevos del agua y revuelva en un recipiente con agua fría. Con cuidado despegue las cáscaras, luego corte cada huevo por la mitad y saque las yemas en un tazón grande.", "Picar finamente las claras de huevo y agregar al bol con las yemas de huevo. Mezcle bien hasta que los blancos estén uniformemente cubiertos en la yema. Dejar de lado.", "Para el salmón, vierta el aceite de oliva en una sartén de base pesada y coloque a fuego muy bajo, preferiblemente con un difusor de calor debajo de la sartén. Caliente el aceite lentamente hasta que registre 55 ° C / 130 ° F en un termómetro de cocción.", "Baje suavemente el salmón en el aceite y cocínelo, manteniendo la temperatura constante bajando o aumentando el calor según sea necesario, durante 8-10 minutos, o hasta que el pescado esté cocido. Retire el pescado con una cuchara ranurada y seque con papel de cocina.", "Para el berro, ponga a hervir un sartén de agua con sal, agregue el berro y la carne blanca por 20 segundos, o hasta que las hojas estén marchitas pero aún de color verde brillante. Escurrir, luego transferir a un procesador de alimentos y mezclar hasta obtener un puré fino. Vierta en un recipiente caliente.", "Coloque los huevos de pato picados en una sartén con la mantequilla, la crema, la sal y la pimienta negra recién molida y cálida suavemente a fuego medio.", "Para servir, espolvorea el puré de berros en la base de cuatro tazones para servir y cúbrelo con los huevos de pato picados. Cubra con una porción de filete de salmón, adorne con las ramitas de perifollo y sirva."], "url": "www_bbc_co_uk_food_recipes_choppedduckeggwithco_90364", "title": "Huevo de pato picado con salmón confitado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4 como entrante", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tomate, finamente picado", "4 cucharadas de pepino finamente picado", "1 chile verde, finamente picado", "2 cucharadas de cebolla finamente picada", "puñado de hojas y tallos de cilantro picados", "2 cucharadas de cacahuetes salados, más o menos picados", "1 cucharada colmada de coco desecado", "¼ cucharadita de jengibre rallado", "sal al gusto", "1 cucharadita de aceite vegetal", "¼ cucharadita de semillas de mostaza", "pocas hojas de curry", "1 cucharada de jugo de limón, o al gusto"], "method": ["Para la ensalada, mezcle todos los ingredientes de la ensalada en un tazón.", "Para las especias, caliente el aceite en una sartén pequeña y agregue las semillas de mostaza. Una vez que comienzan a balbucear, agregue las hojas de curry y retire del fuego. Agregue el jugo de limón y revuelva.", "Para servir, vierta la mezcla de especias sobre la ensalada y revuelva para cubrir. Pruebe y ajuste el aderezo si es necesario."], "url": "www_bbc_co_uk_food_recipes_choppedsaladwithpean_86558", "title": "Ensalada picada con cacahuetes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 yema de huevo grande de gallinas camperas", "1 pequeña cucharadita de mostaza Dijon", "½ diente de ajo, muy finamente picado", "1 cucharadita de vinagre de vino blanco, más extra para el gusto", "100ml / 3½fl oz de aceite vegetal", "100ml / 3½fl oz de aceite de oliva virgen extra", "sal y pimienta recién molida", "jugo de limón, al gusto", "10 calamar bebé", "3 parrilla picante cocinando chorizos, pelados y picados finamente", "8 patatas nuevas, cortadas en cuartos", "2 cucharadas de aceite de oliva", "1 diente de ajo, aplastado", "25 g / 1oz de mantequilla sin sal", "7 hojas de salvia, más o menos picadas", "25g / 1oz de guisantes frescos, envasables", "12g / ½oz de alcaparras en escabeche en miniatura", "½ limón, solo ralladura", "sal marina y pimienta negra recién molida"], "method": ["Para el aoli, coloca la yema en un tazón junto con la mostaza, el ajo y el vinagre. Comience batiendo y agregue lentamente los aceites para emulsionar con la yema. A medida que los aceites se incorporan a la yema, puede acelerar el proceso.", "Cuando se haya agregado todo el aceite, sazone con sal y pimienta y agregue un poco de jugo de limón y vinagre al gusto. Dejar de lado.", "Para el calamar relleno de chorizo, retira los tentáculos del cuerpo de cada calamar y recógelos. Compruebe el centro de los tentáculos para el pico duro, que puede ser descartado. Sienta dentro del cuerpo la pluma de cada calamar (se asemeja a un pedazo de plástico). Sácalo del calamar y deséchalo. Enjuague dentro del cuerpo en agua fría. Tire de las orejas (aletas similares a alas) del cuerpo. Tire de la piel purpura de las orejas y el cuerpo para dejar solo la carne blanca.", "Deseche las tripas del calamar o, si lo desea, conserve el saco de tinta para usar en pasta de marisco o risotto.", "Amasar el chorizo ​​en un tazón con las manos para formar una pasta áspera. Tome un trozo de chorizo ​​y forme una forma para llenar la cavidad de uno de los calamares.", "Llene cada calamar a aproximadamente dos tercios lleno y presione hacia abajo. Asegure cada tubo de calamar con un palillo de cóctel y reserve hasta que esté listo para cocinar.", "Cocine las papas en una sartén con agua con sal hasta que estén tiernas y luego drene bien. Caliente una sartén antiadherente a fuego medio, agregue un poco de aceite de oliva, el ajo triturado y las papas y sazone bien con sal y pimienta negra recién molida. Cocine a fuego moderado de vez en cuando para que crujen uniformemente y caramelice las papas.", "Tome otra sartén antiadherente y colóquela a fuego moderado. Sazone los bolsillos de calamar y los tentáculos con sal y pimienta. Agregue un trapo de aceite a la sartén y agregue el calamar. Cocine por dos minutos en un lado y luego voltee y cocine por otros dos minutos.", "Agregue la mantequilla y la salvia y, cuando haga espuma, cúbrala sobre el calamar para cocinar más y asegúrese de que el chorizo ​​esté cocido dentro. El relleno se sentirá firme al tacto cuando esté cocido.", "Agregue los guisantes, las alcaparras y la ralladura y retire la sartén del fuego. Cuando las papas estén listas, transfiéralas a un plato forrado con papel de cocina para drenar.", "Para servir, divida las papas entre los platos junto con el calamar, los jugos de manteca, los guisantes, las alcaparras y la ralladura. Sirve con una cucharada de alioli."], "url": "www_bbc_co_uk_food_recipes_chorizo-stuffed_squid_25587", "title": "Calamar relleno de chorizo ​​con salvia, patatas, guisantes, alcaparras y aoli", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 papas para hornear (200 g / 7 oz cada una)", "200g / 7oz de cocción de chorizo, en rodajas", "2 x 390 g de tomates picados con cebolla y ajo", "2 x 400 g de habas de mantequilla, escurridas", "50 g / 1¾oz de hojas frescas de albahaca, aproximadamente picadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Pinche las papas por todas partes con un tenedor y cocine en el microondas a fuego alto durante 5-6 minutos. Sazonar bien con sal. Hornee durante 10-15 minutos, o hasta que estén tiernos. (Si no tiene un microondas, hornee durante 1 hora a 220C / 200C Ventilador / Gas 7).", "Mientras tanto, fría el chorizo ​​en una cacerola grande a fuego medio durante 4-5 minutos o hasta que esté ligeramente dorado. Agregue los tomates picados y los frijoles y deje hervir. Reduzca el fuego a medio y cocine por 12-15 minutos hasta que espese un poco, revolviendo con frecuencia. Sazonar y agregar la albahaca.", "Sirve el estofado con las papas al horno."], "url": "www_bbc_co_uk_food_recipes_chorizo_and_butterbean_72682", "title": "Guiso de chorizo ​​y mantequilla con papas al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_butterbean_72682_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["un poco de harina común, para quitar el polvo", "Hojaldre de paquete de 340g / 11¾oz (no listo para enrollar, ya que generalmente se rompe cuando lo abre)", "18 piezas de chorizo ​​precortado (aproximadamente 7cm / 2¾en piezas anchas)", "1 palo de limon", "pimienta negra recién molida", "1 huevo de gallinas camperas, ligeramente golpeado"], "method": ["Alinee una bandeja grande para hornear con un pergamino para hornear y reserve.", "Aspire ligeramente una superficie de trabajo limpia con harina y enrolle la masa en un rectángulo de 25x35 cm / 10x14 pulgadas.", "Arregle seis rebanadas de chorizo ​​en una capa ligeramente superpuesta en una fila por un lado largo. Repita para hacer tres filas y cubrir completamente la masa.", "Arriba y la cola del palo de limoncillo y luego retire una o dos capas externas. Corta el palo muy fino y luego espolvorea esto uniformemente sobre el chorizo. Sazonar con un poco de pimienta.", "Con el lado más largo hacia usted, enrolle el pastel lejos de usted, muy apretado como un rollo suizo que tenga unos 4 cm / 1½ pulgadas de grosor. Levante con cuidado la bandeja de hornear y luego déjela caer en la nevera para reafirmarla durante unos 20 minutos.", "Precalentar el horno a 220C / 425F / Gas 7 (ventilador 200C)", "Una vez que la masa esté bien y firme, use un cuchillo afilado para cortar el rollo en 32 rebanadas de aproximadamente 1 cm / ½ pulgadas de espesor cada una. Coloque cada uno en la bandeja de horno, espaciados, sobre la marcha. Cepille los lados hacia arriba con el huevo batido.", "Hornee en el horno durante unos 15-20 minutos, o hasta que la masa se hinche y se ponga dorada. Una vez horneado, retírelo del horno, déjelo enfriar durante un par de minutos y luego sirva en un plato de fiesta."], "url": "www_bbc_co_uk_food_recipes_chorizo_and_lemongrass_30901", "title": "Rollos de hojaldre de chorizo ​​y pasto de limón", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 32", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_and_lemongrass_30901_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco fuerte, más extra para espolvorear", "2 cucharaditas de sal", "1 bolsita de levadura seca de acción rápida", "250-300ml / 9-11fl oz de agua", "4 ramitas de tomillo fresco, solo hojas", "50g / 2oz de chorizo ​​cocido, picado finamente", "1 cucharada de aceite vegetal, para engrasar", "3 cucharadas de leche"], "method": ["Precalentar el horno a 200C / 400F / Gas 6 y espolvorear una bandeja grande para hornear con harina.", "Mezcle la harina, la sal y la levadura en un tazón grande y mezcle hasta que estén bien combinados. Haga un pozo en el centro de la mezcla y vierta constantemente en el agua hasta que la masa esté suelta y sea fácil de amasar, pero no demasiado pegajosa.", "Amasar la masa durante 10 minutos en una superficie de trabajo ligeramente enharinada, o durante 5 minutos en una batidora eléctrica equipada con un gancho de masa.", "Agregue el tomillo y amasar por otros 30 segundos o hasta que esté bien combinado. Pon la mitad del chorizo ​​en el centro de la masa y luego dobla los bordes alrededor para cubrir y amasar durante un minuto más.", "Coloque la mezcla de masa sobre una superficie de trabajo espolvoreada. Dale forma de bola, asegurándote de que la parte superior se enseñe y sea suave. Usando un rodillo, extiéndalo en una forma oval áspera.", "Corta barras en el pan para que parezcan hojas de helecho con un cuchillo o cuchilla de afeitar, y luego abre las barras con manos enharinadas.", "Empuja el resto del chorizo ​​en la parte superior de la masa, luego cúbrelo con la película adhesiva untada (es posible que necesites varias piezas). Deje que se levante en un lugar cálido hasta que la masa se haya duplicado, aproximadamente durante una hora.", "Una vez levantado, retire la película adhesiva, cepille la masa con leche y colóquela en el horno caliente. Rocíe el horno con agua antes de cerrar; esto evitará que se forme una costra demasiado rápido y ayudará a asegurar un buen aumento. Hornee por 30-35 minutos, o hasta que el pan esté bien levantado y dorado. Saldrá de la bandeja una vez totalmente cocida también.", "Para servir, mantenga el pan entero o córtelo en trozos para comer antes o con una comida principal."], "url": "www_bbc_co_uk_food_recipes_chorizo_and_thyme_65587", "title": "Chorizo ​​y tomillo fougasse", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chorizo ​​semicurado de 250 g / 9 oz, despellejado, toscamente picado", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "1 chile rojo, finamente picado", "1 cucharadita de pimentón ahumado", "2 tomates, sin piel, sin semillas, picados", "200g / 7oz de tomates picados en lata", "400 g / 14 oz de garbanzos en conserva, escurridos", "110ml / 4fl oz de caldo de pollo", "Hoja de espinaca baby 300g / 11oz", "½ limón, solo jugo", "2 cucharadas de aceite de oliva virgen extra", "3 cucharadas de berro de coriandro", "Chorizo ​​curado de 150g / 5oz, cortado en rodajas gruesas", "110 g de mantequilla, ablandada", "dash lemon juice", "4 pechugas de pollo, deshuesadas y sin piel", "Harina normal de 50g / 2oz", "2 huevos de gallinas camperas, ligeramente golpeados", "110g / 4oz de pan rallado seco"], "method": ["Calentar una cacerola grande y freír el chorizo ​​durante 3-4 minutos, o hasta que estén crujientes.", "Agregue la cebolla, el ajo y el chile y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el pimentón y revuelva hasta que esté bien combinado. Coloque los tomates, los garbanzos y el caldo de pollo en la sartén y deje que hierva.", "Reduzca el fuego y cocine a fuego lento durante 4-5 minutos. Agregue las espinacas y dóblelas a través del estofado.", "Regrese la mezcla al fuego y sazone con sal y pimienta negra recién molida. Cocine por otro minuto para marchitar la espinaca, luego sazone con jugo de limón.", "Para el pollo relleno de chorizo, caliente una freidora a 170C / 340F. (PRECAUCIÓN: No deje desatendida la grasa caliente).", "Coloque el chorizo ​​y la mantequilla en un procesador de alimentos y mezcle hasta obtener un puré. Agregue un poco de jugo de limón y pimienta negra, luego póngalo en una manga pastelera. Haz una incisión en el costado de la pechuga de pollo y coloca un poco de manteca de chorizo ​​en el pollo.", "Presione la incisión cerrada y luego polvillo con la harina. Prepare un plato de huevo y un plato de pan rallado. Sumerja el pollo primero en el huevo, luego el pan rallado. Coloque en la freidora y cocine durante 8-9 minutos, o hasta que estén dorados y cocidos.", "Para servir, corte el pollo por la mitad con cuidado. Coloque el guiso en un bol y cubra con el pollo. Termine con un chorrito de aceite de oliva virgen extra y la dispersión de berro."], "url": "www_bbc_co_uk_food_recipes_chorizo_and_tomato_soup_10248", "title": "Guiso de chorizo ​​y garbanzos con pollo relleno de chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 vieiras grandes", "20 semillas de cilantro", "10g / ½ oz de canela en rama", "200g / 7oz de sal marina", "175g / 6oz de mantequilla, ablandada", "Extracto de levadura 40g / 1½ oz", "Chorizo ​​de cocción suave 150 g / 5oz, sin piel, carne cortada en cubitos", "4 huevos de gallinas camperas", "1 cucharada de aceite de girasol", "4 rebanadas gruesas de pan de grano malteado", "1 x 20 g / ¾oz de cilantro de coriandro", "pimienta negra recién molida", "1 limón, solo jugo"], "method": ["Prize abra las conchas de vieiras, seque las vieiras con papel de cocina y déjelas en la nevera, descubiertas, durante 2-3 horas para deshidratarlas ligeramente.", "Mientras tanto, para la sal de cilantro, freír las semillas de cilantro y la rama de canela en una sartén a fuego medio durante 30-40 segundos, o hasta que estén tostados y fragantes.", "Transfiera las semillas tostadas a un molinillo de especias y mezcle con un polvo grueso. Incline el polvo en un recipiente y mezcle la sal marina. Coloque la mezcla de sal de cilantro a un lado.", "Cuando las vieiras se hayan secado en la nevera, precaliente la parrilla a su nivel más alto. Retire las vieiras de sus conchas y córtelas por la mitad para crear dos vieiras más finas. Mezcle 160 g / 5½ oz de la mantequilla con el Marmite hasta que quede suave y bien combinado y reservar.", "Caliente una sartén a fuego medio, agregue el chorizo ​​cortado en cuadritos y fría por 4-5 minutos, o hasta que se dore.", "Rompe los huevos en la sartén sobre las piezas de chorizo ​​y freír durante 1-2 minutos, o hasta que estén cocidos a tu gusto. Retire la sartén del fuego", "Mientras tanto, caliente una sartén por separado a fuego medio hasta que esté caliente. Agregue el aceite de girasol y los restantes 15 g / ½ onza de mantequilla. Cuando la mantequilla se haya derretido, agregue las vieiras y cocine por 15-20 segundos en el lado cortado, o hasta que estén doradas.", "Retire las vieiras de la sartén y colóquelas, con los lados cortados hacia abajo, en una sartén fría y resistente al horno. Coloque la sartén debajo de la parrilla y ase las vieiras durante 30 segundos, o hasta que estén recién cocidas.", "Para servir, tueste el pan hasta que esté crujiente y dorado. Coloque una rebanada en cada uno de los cuatro platos de servir. Sazone los huevos de chorizo ​​con un poco de sal de cilantro y pimienta negra recién molida. Coloque uno encima de cada rebanada de pan tostado y adorne con el berro de cilantro. Exprime el jugo de limón sobre las vieiras, sazona con un poco más de sal de cilantro y luego cepíllalas con la mantequilla de Marmite. Coloque una vieira en la parte superior de cada porción de huevos de chorizo."], "url": "www_bbc_co_uk_food_recipes_chorizo_eggs_with_94719", "title": "Huevos de chorizo ​​con vieiras y sal de cilantro", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 aguacate maduro", "1 lima, solo jugo", "3 cucharadas de cebollines picados", "150 g / 5½oz de salchicha de chorizo ​​cocida, más o menos picada"], "method": ["Coloque la carne de aguacate en un tazón.", "Exprime el jugo de lima sobre el aguacate para evitar que se decolore.", "Ligeramente aplaste el aguacate con un tenedor.", "Piel y corte el chorizo.", "Pica bien las cebolletas y luego dobla todo junto con el aguacate y sírvelo."], "url": "www_bbc_co_uk_food_recipes_chorizo_guacamole_64754", "title": "Chorizo guacamole", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 chalota de plátano, en rodajas", "1 diente de ajo, finamente picado", "300g / 1oz de chorizo, cortado diagonalmente en trozos de 2.5cm / 1in", "2 hojas frescas de laurel", "200ml / 7fl oz de vino tinto", "2 cucharadas de aceite de oliva", "2 dientes de ajo, en rodajas", "Chorizo ​​de 300 g / 11 oz, cortado diagonalmente en rodajas gruesas de ½ cm.", "Una pizca de sal marina", "8 gambas medianas, concha en", "50ml / 2fl oz de jerez seco", "2-3 cucharadas de perejil de flatleaf fresco picado"], "method": ["Para el chorizo ​​en vino tinto, caliente una sartén hasta que esté medianamente caliente, agregue el aceite de oliva, la chalota y el ajo y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el chorizo ​​a la sartén y fría durante 1-2 minutos, o hasta que esté crujiente y se libere el aceite.", "Agregue las hojas de laurel y el vino tinto, y cocine hasta que el volumen de vino se haya reducido para cubrir el chorizo.", "Para las gambas con chorizo, caliente una sartén hasta que esté medio caliente, agregue el aceite de oliva y el ajo y fría por 1-2 minutos. Agregue el chorizo ​​y fría por otros 1-2 minutos.", "Agregue la sal marina y las gambas y cocine por 2-3 minutos, o hasta que las gambas estén rosadas.", "Agregue el jerez seco y desglasifique la sartén.", "Incline en un plato para servir y espolvoree sobre el perejil."], "url": "www_bbc_co_uk_food_recipes_chorizo_tapas_72587", "title": "Chorizo tapas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chorizo_tapas_72587_16x9.jpg", "isVegetarian": false, "recommendations": 0}]