[{"isVegetarian": true, "title": "Christmas popcorn", "url": "www_bbc_co_uk_food_recipes_christmas_popcorn_55253", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_popcorn_55253_16x9.jpg", "ingredients": ["1 tsp vegetable oil", "50g/1¾oz popcorn", "2 tbsp cocoa", "1 tsp ground ginger", "3 oranges, zest only", "3 tbsp runny honey"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil for 20-30 seconds over a medium heat in a large lidded saucepan. Add the popcorn, cover with a lid and cook for a few minutes, until it has all popped, giving it a shake halfway through. ", "Tip the popcorn into a bowl. While it is still hot, sieve over the cocoa and ginger, then sprinkle over the orange zest and drizzle on the honey. Mix well and serve."]}, {"isVegetarian": false, "title": "Christmas porchetta", "url": "www_bbc_co_uk_food_recipes_christmas_porchetta_19448", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3kg/6lb 8oz pork loin, boned and butterflied (alternatively use pork belly or shoulder)", "salt and freshly ground black pepper", "2 lemons, zest only", "15g/½oz parmesan, grated", "175g/6oz pork mince", "175g/6oz chicken livers, roughly chopped", "150g/5½oz onions, finely chopped", "5g fresh sage, leaves picked and chopped", "8g fresh rosemary, leaves picked and chopped", "8g fresh thyme, leaves picked", "350g/12oz bread, soaked in 200ml/7fl oz water and broken into small pieces", "15g/½oz pine nuts", "30g/1oz sultanas", "6 slices mortadella with pistachios (about 200g/7oz)", "dash olive oil", "4 carrots", "1 onion", "250ml/9fl oz white wine", "70ml/2¼fl oz Vin Santo", "3 tbsp olive oil ", "1kg/2lb 4oz potatoes, peeled and cut into quarters, par-boiled", "4 sprigs fresh rosemary", "6 garlic cloves, skin on, smashed"], "serves": "Serves 8-12", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Season the pork with salt and pepper and rub it into the pork, along with the lemon zest.", "Place the parmesan, pork mince, chicken livers, onions, sage, rosemary, thyme, bread, pine nuts and sultanas, in a large bowl and mix.", "Spread the filling on top of the loin and roll onto one side. Cover with two slices of mortadella and then roll halfway along.", "Pull in the other side of the lion, add the rest of the filling, then press down and put on four slices of mortadella. Roll  to secure and tie with kitchen string. Rub with olive oil and season with salt and pepper.", "Place the whole carrots and onion, the wine, Vin Santo and 125ml/4fl oz of water in the bottom of baking tray and place the pork on top.", "Cook in the oven for 30 minutes and then turn the oven down to 150C/300F/Gas 3 for three hours.", "For the rosemary and garlic sautéed potatoes, heat a large frying pan and add the oil. Once hot, add the potatoes and cook for a couple of minutes. Add the rosemary and garlic and cook until the potatoes are crisp and cooked through.", "To serve, place the pork and potatoes in the centre of the table and let people help themselves."]}, {"isVegetarian": true, "title": "Christmas pudding", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_41498", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_41498_16x9.jpg", "ingredients": ["350g/12oz mixed dried fruit (raisins, currants, sultanas)", "100g/3½oz pitted ready-to-eat prunes, chopped or left whole", "100g/3½oz dark muscovado sugar", "4 tbsp dark rum", "100ml/3½fl oz stout ", "100g/3½oz chopped walnuts", "100g/3½oz blanched almonds", "100g/3½oz ground almonds", "100g/3½oz fresh white breadcrumbs", "50g/1¾oz plain flour", "100g/3½oz frozen butter, grated, plus a little extra for greasing", "½ tsp freshly grated nutmeg", "1 tsp ground cinnamon", "2 tsp mixed spice", "100g/3½oz chopped glacé cherries (or left whole if you prefer)", "3 large free-range eggs, beaten"], "serves": "Makes 1 x 1.2 litre/2 pint pudding", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Combine the mixed fruit, prunes, muscovado sugar, rum and stout in a mixing bowl. Stir well to mix, cover and leave for 24 hours to soak.", "After 24 hours, mix the walnuts, almonds, ground almonds, breadcrumbs, flour, butter, spices, cherries and eggs along with the soaked fruit mixture in a large mixing bowl, making sure you include all the soaking liquor from the soaked fruit. Mix well until completely combined (let all the members of the family have a stir and make a wish). ", "Cover with cling film and leave to stand in a cool place for 24 hours.", "After 24 hours, grease a 1.2 litre/2 pint pudding basin with butter. Cut a circle of baking paper and place into the bottom of the pudding basin and then grease it with a little more butter. Pack the pudding mixture into the pudding basin, pressing as you add it. Fold a pleat into the middle of a large piece of baking paper and place over the pudding. Cover with a large piece of pleated foil, ensuring the pleats are on top of one another. Secure tightly with kitchen string tied under the lip of the pudding basin.", "Place an upturned saucer into a large saucepan one-quarter full of water. Fold a long piece of foil into quarters lengthways to create a long strip and place the pudding basin in the middle of the strip. Bring the sides of the strip up the sides of the pudding basin and lower into the saucepan. Ensure the water in the saucepan comes one-third of the way up the side of the pudding basin, but nowhere near the top of the basin. Leave the ends of the foil strip hanging over the side to make it easy to remove the pudding later.", "Bring the water to the boil and then reduce the heat to a gentle simmer. Simmer gently for 5-6 hours, topping up the water level as necessary throughout cooking (do not allow the pan to dry out).", "Once the pudding is cooked, remove from the pan and set aside to cool. The pudding can be stored for up to two years in a cool, dry place. To serve, reheat the pudding by steaming again (in the same way) for two hours, or until hot all the way through. Alternatively, remove the foil and reheat in the microwave."]}, {"isVegetarian": true, "title": "Christmas pudding and sherry trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_and_px_59638", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz leftover Christmas pudding", "8 fresh black figs, cut into quarters", "250ml/9fl oz Pedro Ximénez sherry ", "250g/9oz mascarpone", "250ml/9fl oz double cream", "icing sugar, to taste ", "150g/5½oz mixed crumbled pecans and toasted flaked almonds", "pinch ground cinnamon ", "100g/3½oz chocolate shavings, to decorate", "500ml/18fl oz full-fat milk ", "100ml/3½fl oz double cream", "1 vanilla pod, split in half lengthways", "6 egg yolks", "2 tsp cornflour", "50g/1¾oz brown sugar"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the trifle, break up the pudding into the bottom of a large serving dish or individual serving glasses. Top with the quartered figs and splash over the sherry.", "For the custard, heat the milk, cream and vanilla in a saucepan until just boiling. Remove from the heat and set aside to cool a little. In a bowl, whisk together the yolks, cornflour and sugar and then pour the warm milk mixture over (if the milk is too hot the eggs will scramble). Tip back into the pan and whisk over a low heat until thickened. Remove from the heat and strain. Cover the surface of the custard with baking paper to prevent a skin forming and set aside to cool.", "Beat the mascarpone and double cream with the icing sugar, to taste.", "Spoon the cooled custard over the soaked pudding and then top with the mascarpone cream. Decorate with crumbled pecans, almonds, cinnamon and chocolate shavings. Chill until ready to serve. "]}, {"isVegetarian": false, "title": "Christmas pudding fridge cake", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_fridge_58372", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_fridge_58372_16x9.jpg", "ingredients": ["250g/8oz digestive biscuits", "150g/5oz milk chocolate", "150g/5oz dark chocolate", "100g/3½oz unsalted butter", "150g/5oz golden syrup", "100g/3½oz dried apricots, chopped", "75g/2½oz raisins", "60g/2oz pecans, chopped ", "200g/7oz marshmallows, chopped into small pieces", "100g/3½oz white chocolate, broken into pieces", "2 glacé cherries", "sprig holly leaves"], "serves": "Makes 1 x 1.2 litre/2 pint pudding", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Use cling film to line a 1.2 litre/2 pint pudding bowl, leaving extra cling film hanging over the sides.", "Bash the biscuits into pieces using a rolling pin. (Put them in a plastic bag first so they don't go everywhere!)", "Melt chocolate, butter and golden syrup in a heatproof bowl set over a pan of simmering water. Stir occasionally.", "Remove the bowl from the heat and stir in the broken biscuits, apricots, raisins, pecans and marshmallows.", "Spoon the mixture into the bowl, pushing down well to minimise air pockets. ", "Leave to cool, then put in the fridge overnight to set.", "The next day, place the pudding bowl in a dish of hot water for a few seconds to loosen it from the pudding bowl. Place upside down on a serving plate. ", "Melt the white chocolate in a heatproof bowl set over a pan of simmering water. Allow to cool and thicken slightly before pouring some on the top of the pudding and gently pushing down to form a custard shape. ", "Top with the glacé cherries and holly and serve. "]}, {"isVegetarian": true, "title": "Christmas pudding ice cream with sautéd pineapple and a spiced caramel", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_ice_86469", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg yolks", "120g/4½oz caster sugar", "250ml/9fl oz milk", "250ml/9fl oz double cream", "2 vanilla pods, split open and seeds scraped out", "200g/7oz cooked Christmas pudding, crumbled", "110g/4oz caster sugar", "1 star anise", "1 cinnamon stick", "pinch fresh nutmeg", "110g/4oz unsalted butter", "175ml/6fl oz double cream", "50g/1¾oz unsalted butter", "1 pineapple, peeled, cored and sliced into rounds"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the Christmas pudding ice cream, whisk the egg yolks with 60g/2¼oz caster sugar until thick and creamy.", "Place the remaining caster sugar, milk, cream and vanilla seeds and pods in a pan and bring to the boil. Pour the hot milk into the whisked yolks and stir well.", "Return the mixture to the pan and cook over a very low heat, stirring constantly with a spatula, until the mixture is thick enough to coat the back of a spoon.", "Cool the vanilla mixture, then refrigerate for at least one hour. Strain the mixture into an ice cream maker and churn according to manufacturer's instructions. Just as the ice cream is soft enough to mix, stir in the Christmas pudding and freeze.", "For the spiced caramel, place the sugar, star anise, cinnamon and nutmeg into a frying pan and cook, without stirring, until the sugar is melted and just golden-brown.", "Whisk in the butter and double cream and bring to a simmer. Cook for 3-5 minutes, or until just thickened then pass through a fine sieve into a clean pan.", "For the sautéd pineapple, heat a large frying pan and add the butter. Once hot and melted, add the pineapple and cook for a couple of minutes on each side.", "To serve, place the cooked pineapple on serving plates with a spoonful of ice cream. Drizzle the caramel sauce over. "]}, {"isVegetarian": true, "title": "Christmas pudding soufflé", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_souffl_48184", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter", "500g/1lb 2oz cooked Christmas pudding", "400ml/14oz full-fat milk", "6 large free-range egg yolks", "8 large free-range egg whites", "icing sugar, for dusting", "brandy butter ice cream, to serve"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Melt half the butter and use it to grease a 2 litre/3½ pint soufflé dish.", "Put the Christmas pudding into a food processor and pulse to break it all up. Leave it in the food processor.  ", "Bring the milk to the boil in a small saucepan. Add to the Christmas pudding, blending it until it is well combined. Add the yolks to the mixture one at a time, blending between each addition.", "Beat the egg whites with a pinch of salt in a bowl until stiff peaks form when the whisk is removed from the bowl.", "Fold the beaten egg whites carefully into the Christmas pudding mixture. ", "Spoon the mixture into the dish and bake for 40 minutes. Take care not to burn the top. ", "Remove from the oven, dust with icing sugar and serve with brandy butter ice cream."]}, {"isVegetarian": false, "title": "Christmas pudding tart", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_tart_59676", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["270g/9½oz plain flour", "150g/5½oz unsalted butter, cold", "50g/1¾oz ground almonds", "1 lemon or orange, grated zest only", "1 vanilla pod, seeds only", "100g/3½oz icing sugar", "1 free-range egg", "1 free-range egg yolk", "175ml/6fl oz milk", "75g/2½oz double cream", "½ vanilla pod, seeds removed", "90g/3¼oz caster sugar", "75g/2½oz free-range egg yolks (about 4-5 yolks)", "15g/½oz cornflour", "15g/½oz plain flour ", "15g/½oz butter, melted", "150g/5½oz ground almonds", "115g/4oz demerara sugar", "175g/6oz unsalted butter", "85g/3oz plain flour", "1 lemon, zest only", "100g/3½oz blanched almonds ", "25g/1oz pine nuts", "125g/4½oz icing sugar", "30ml/1fl oz orange liqueur", "250g/9oz cranberry sauce", "25g/1oz caster sugar", "125g/4½oz mascarpone cheese", "100ml/3½fl oz double cream", "25g/1oz icing sugar", "2 tbsp almond-flavoured Italian liqueur, such as Amaretto", "pinch freshly grated nutmeg", "250g/9oz Christmas pudding", "30g/1oz sliced almonds", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, put all the pastry ingredients apart from the eggs in a food processor and pulse until the pastry has a texture like breadcrumbs. ", "Add the eggs and pulse until mixture starts to form a ball. Turn out onto a floured surface and work as little as possible until it is smooth. Form into a ball and flatten. Wrap in cling film and chill for at least three hours.", "For the pastry cream, place the milk, cream, vanilla pod and 60g/2¼oz of the sugar in a pan and bring to the boil.", "In a clean bowl whisk the yolks with the remaining sugar until pale.", "Mix the cornflour and flour into the yolk mix. Pour half of the milk onto the yolk mix and whisk well.", "Add the remaining milk, place back in the saucepan and cook until it thickens.", "Add the butter and mix it in. Pass through a fine sieve and cool. Cover with cling film and pierce with a fork to let out steam. Set aside in the fridge.", "For the crumble topping, in a bowl, rub together all the ingredients with your hands until it resembles breadcrumbs. Place to one side.", "For the crystallised almonds and pine nuts, place all the ingredients in a heavy-bottomed saucepan.", "Place on a moderate heat and stir until the sugar crystallises and coats all the almonds and pine kernels. You will notice a whitish powder forming on the sides of the pan. Stir this back into the pan as this starts the crystallising process. Stir until all the nuts are coated.", "Scatter onto a plate or baking tray and leave until cold. Store in an airtight container until needed.", "For the cranberry sauce purée, place all the ingredients with 75ml/2½fl oz water into a saucepan and bring to the boil. Taste, make sure it is sweet enough and then liquidise using a blender. Pass through a fine sieve and leave to cool, then store in a squeezy bottle until ready to use.", "For the mascarpone and amaretto cream, place all the ingredients in a mixing bowl and stir until the sugar is dissolved.", "Whisk until medium stiff peaks form when the whisk is removed from the bowl. Cover and store in the fridge until needed.", "To make the tart case, preheat the oven to 180C/350F/Gas 4.", "Grease four 12cm/4½in loose-bottomed tart tins. Use the pastry dough to line the tin and prick the base all over with a fork and leave to rest in the fridge for about 30 minutes.", "Preheat the oven to 180C/350F/Gas 4.", "Line the pastry with parchment paper and weigh down with uncooked rice or ceramic baking beans. Bake the pastry blind for 15 minutes, remove the paper and rice or beans and return the pastry cases to the oven for a few minutes more, until light golden-brown. ", "To make the filling, warm the Christmas pudding and add to the cool pastry cream with the almonds. Pipe the mixture into the tarts.", "Sprinkle with the almond crumble. Return to the oven and cook for 15 minutes, or until the crumble is golden-brown.", "Allow to cool a little, remove from the tins and dust with icing sugar", "To serve, place on the plate, dress with a little cranberry sauce purée, crystallised nuts and a scoop of mascarpone cream."]}, {"isVegetarian": true, "title": "Christmas pudding trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_47025", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz madeira cake, sliced", "100–150ml/3½–5fl oz ginger wine or sherry", "250g/9oz Christmas pudding, cut into chunks.", "1 ripe mango, peeled and thinly sliced", "½ small pineapple, or 227g tin pineapple in own juice, diced", "500ml/18fl oz quality custard", "1 tbsp icing sugar", "300ml/10fl oz double cream", "50g/1¾oz flaked almonds", "1 orange, pared zest only"], "serves": "Serves 4–6", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Arrange the madeira cake around the base of a trifle bowl. Pour over half the ginger wine, then press the Christmas pudding on top into any gaps. Add the remaining wine, but make sure the trifle doesn’t get too wet. Arrange the mango over the top, then the pineapple. ", "Pour over the custard and smooth using the back of a spoon. Refrigerate for 2 hours to allow the custard to set. ", "Meanwhile, sieve the icing sugar into the double cream and whisk until soft peaks. Pour over the trifle and smooth over.", "Lightly toast the almonds in a dry frying pan and set aside to cool. Decorate the trifle with the almonds and pared orange zest."]}, {"isVegetarian": true, "title": "Christmas pudding trifle", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_trifle_58574", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_trifle_58574_16x9.jpg", "ingredients": ["400g/14oz leftover Christmas pudding (about half a large pudding)", "2 tbsp dry sherry", "400g tin pear halves in juice", "500g/1lb 2oz ready-made custard", "150g/5½oz mascarpone", "300ml/10fl oz whipping or double cream", "1 square of dark chocolate", "handful of flaked almonds (optional)"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Break the Christmas pudding into chunks and place it in the bottom of a trifle bowl in an even layer. Sprinkle over the sherry and 1 tablespoon of the pear juice. ", "Drain the pears and cut each one in half, then layer them on top of the cake. ", "Beat together the custard and mascarpone and spoon on top of the pears. ", "Whisk the cream until soft peaks form, then spoon it onto the custard. Finely grate over the chocolate and sprinkle over the flaked almonds, if using."]}, {"isVegetarian": true, "title": "Christmas pudding vodka", "url": "www_bbc_co_uk_food_recipes_christmas_pudding_vodka_45343", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_pudding_vodka_45343_16x9.jpg", "ingredients": ["300g/10½oz mixed dried fruit (sultanas, currants, raisins)", "75g/3oz caster sugar", "2 cinnamon sticks", "2 tsp ground mixed spice", "6 cloves", "½ whole nutmeg, finely grated", "1 orange, zest only, finely grated ", "1 unwaxed lemon, zest only, finely grated", "750ml/1 pint 5fl oz bottle good quality vodka"], "serves": "Makes 500ml/18fl oz", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the dried fruit with the sugar, cinnamon sticks, mixed spice, cloves, grated nutmeg and citrus zest in a large bowl. ", "Pour over the vodka, and cover tightly with cling film. ", "Place in the fridge and leave for 3 days, stirring once each day.", "Line a sieve with a double layer of fine muslin and place over a large, clean jug.  ", "Pour the dried fruit and vodka mixture into the sieve and allow to drip through into the jug.", "Pour into a sterilized bottle."]}, {"isVegetarian": false, "title": "Christmas quackers", "url": "www_bbc_co_uk_food_recipes_christmas_quackers_23472", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_quackers_23472_16x9.jpg", "ingredients": ["6 rashers smoked streaky bacon", "3 tbsp olive oil", "3 medium to large Maris Piper potatoes", "2 onions", "salt and freshly ground black pepper", "handful thyme", "1 x 2.5kg/5lb 8oz duck", "6 bay leaves", "a wineglass Madeira "], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Cut the bacon into postage stamp size pieces and fry directly in the roasting tin with a little oil. Add thinly sliced discs of the potatoes, scatter over the sliced onion and tear in the thyme. Fry altogether till the bacon crisps up and the potatoes start to warm through. ", "Onto this base lay the duck, stuff it with the bay leaves and roast for 60-90 minutes. Check the duck for doneness. Its juices should be clear without any trace of blood. Remove the tin from the oven, turn the heat up to 220C/425F/Gas 8, and place the duck and potatoes into a new tin or onto a heatproof serving plate, then return it to the oven whilst you make the gravy. ", "Put the original roasting tin on the heat and pour in the Madeira. With a wooden spoon dislodge all the crisp caramelised sediments and stir them in to make the gravy. Serve the duck and potatoes with the gravy. "]}, {"isVegetarian": false, "title": "Christmas roast duck", "url": "www_bbc_co_uk_food_recipes_christmas_roast_duck_83066", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_roast_duck_83066_16x9.jpg", "ingredients": ["1.5kg/3lb 5oz potatoes, peeled and thinly sliced", "2 onions, thinly sliced", "500ml/18fl oz chicken stock", "1 x 2kg/4lb 8oz whole duck, giblets removed", "1 clementine, cut in half", "1 cinnamon stick", "½ tsp Chinese five-spice powder", "75g/2½oz butter", "1 head Savoy cabbage, leaves shredded", "50g/1¾oz dried cranberries ", "sea salt and freshly ground black pepper", "2 Bramley apples, peeled, cores removed, roughly chopped", "200g/7oz fresh cranberries", "5 tbsp cider", "2-3 tbsp caster sugar, to taste"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Arrange the shelves of your oven so that there is space for the duck at the top and the potatoes on the shelf immediately underneath. Preheat the oven to 180C/160C Fan/Gas 4.", "Layer the potatoes and onions in an large roasting dish, seasoning each layer with salt and freshly ground black pepper. Pour over the stock, flattening the top layer down.", "Place the potatoes onto the lower shelf in the oven.", "Pierce the duck skin all over with a fork and stuff the neck end of the cavity with the satsuma halves and cinnamon stick. Rub the five-spice powder all over the skin and season with salt and freshly ground black pepper.", "Place the duck directly onto the oven rack above the potatoes, so that the juices from the duck will drip onto the potatoes as they cook. If your dish with the potatoes is on the small side, it may be useful to put a very large empty tray on the bottom of the oven to catch any drips of fat.", "Roast for 1½-2 hours, or until the duck is cooked through and the potatoes are tender and golden-brown.", "Meanwhile, for the spiced cranberry apple sauce, bring the apples, cranberries and cider to the boil in a frying pan. Reduce the heat until simmering and simmer for 10 minutes, stirring occasionally, until the cranberries have burst and the mixture has thickened. Season, to taste, with sugar, if too tart, then pour the sauce into a serving bowl and set aside.", "When the duck is cooked, remove it from the oven and set aside to rest for 10 minutes on a serving platter while you cook the cabbage. ", "Pour enough water into the bottom of a large frying pan to reach 1cm/½in up the sides of the pan. Add half of the butter and bring to the boil. When the butter has melted, add the cabbage and boil until it has just wilted, stirring occasionally. Add the dried cranberries and cook for another 1-2 minutes, or until most of the water has evaporated, then season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the wilted cabbage (drained, if necessary) onto a serving platter and lay the roast duck on top. Serve the potatoes and sauce alongside."]}, {"isVegetarian": false, "title": "Christmas seafood platter", "url": "www_bbc_co_uk_food_recipes_christmas_seafood_89090", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz smoked salmon trimmings", "100g/3½ oz cream cheese", "75g/2½ oz soured cream or crème fraîche", "½ lemon, juice and grated zest ", "freshly ground black pepper", "cucumber slices", "small bunch fresh dill (optional)", "24 crostini or mini Melba toasts", "½ bulb of garlic, unpeeled", "150g/5½ oz good-quality mayonnaise", "250g/9oz cooked, peeled, jumbo king prawns", "1 lemon, juice only", "small bunch flatleaf parsley, chopped", "36 canapé blinis", "100g/3½ oz smoked salmon trimmings", "75ml/2½fl oz soured cream", "1 x 50g jar lumpfish caviar", "½ lemon, for squeezing"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the smoked salmon pâté, put the salmon, cream cheese, soured cream, lemon juice and black pepper in a food processor and blend until you have a rough paste. Transfer to a serving bowl, or a small terrine lined with cling film if you want to turn it out later. Refrigerate for at least 1 hour or up to 1 week. ", "For the mayonnaise, preheat the oven to 180C/160C Fan/Gas 4. Wrap the garlic in a piece of foil and scrunch up to seal. Roast for 20-30 minutes until the garlic is softened and brown. Set aside to cool.", "Put the mayonnaise into a mixing bowl and squeeze each clove of garlic out of its papery skin like squeezing out a toothpaste tube. Mix together with a fork to mash up the garlic. Season with salt and pepper. Cover with cling film and set aside in the fridge for up to 3 days.", "Shortly before serving, put the prawns into a bowl and squeeze over the lemon juice, tossing to combine. Arrange the lemony prawns in a serving bowl, sprinkle with parsley and season with salt and pepper. Serve the garlic mayonnaise alongside for dipping.", "Immediately before serving, heat the oven to 200C/180C Fan/Gas 6. Place the blinis on a tray and heat in the oven for 5 minutes. Meanwhile warm a serving plate (the trick with these blinis is to serve them just warm - cold blinis are doughy).", "Make sure that the salmon trimmings are cut into manageable pieces ready to top the blinis.  Remove the blinis from the oven and transfer to the warmed serving plate. Working quickly, spoon a half a teaspoon of soured cream on each blini. Add a little smoked salmon to the top of 18 of the blinis and a quarter of a teaspoon of caviar onto the remaining 18.  Squeeze lemon over the salmon blinis and grind over some black pepper. Serve immediately.", "To serve the smoked salmon pâté, turn out and remove the cling film if shaped in the terrine. Garnish with the cucumber slices, fresh dill and serve spread on mini toasts."]}, {"isVegetarian": true, "title": "Christmas tree pavlova", "url": "www_bbc_co_uk_food_recipes_christmas_tree_pavlova_36017", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_tree_pavlova_36017_16x9.jpg", "ingredients": ["6 free-range egg whites", "450g/1lb caster sugar", "1 tbsp cornflour", "1 tbsp white wine vinegar", "¼ tsp ground cloves", "½ tsp ground ginger", "1 cinnamon stick", "1 lemon, peeled", "1 orange, peeled", "400g/14oz fresh blackberries", "600ml/20fl oz double cream", "1 tbsp vanilla bean paste", "50ml/2fl oz crème de cassis"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/90C Fan/Gas ½. Line a large baking tray with silicone or baking paper. ", "Whisk the egg whites in a clean bowl using an electric whisk, or in the bowl of a freestanding mixer, until soft peaks form when the whisk is removed. ", "Add 300g/10½oz of the caster sugar and continue to whisk until the mixture is smooth and glossy and stiff peaks form when the whisk is removed. You should hear the machine dropping down a gear as the meringue mixture reaches the correct consistency. Reduce the speed of the whisks and add the cornflour and vinegar. Whisk until very stiff.", "Transfer the meringue mixture to a piping bag. Pipe an outline of a Christmas tree shape onto the prepared baking tray. Pipe a rectangular trunk at the bottom. Fill the outline with the remaining meringue mixture, then smooth the top using a palette knife. With the last of the meringue mixture, pipe around the edge of the Christmas tree shape to form a raised edge. Pipe little balls on each of the points to resemble baubles.", "Bake the Christmas tree in the oven for 1½-2 hours, or until firm, then remove from the oven and set aside to cool.", "Meanwhile, make the filling. Bring the remaining caster sugar and 150ml/5fl oz water to the boil in a saucepan. Stir in the ground cloves, ground ginger, cinnamon stick, and lemon and orange peel and boil for a further 4-5 minutes, or until thickened and syrupy. Stir in the blackberries, then remove the pan from the heat and set aside until completely cool.", "When the meringue and fruit syrup have cooled, whisk the cream and vanilla bean paste in a bowl until soft peaks form when the whisk is removed, then stir in the crème de cassis.", "To assemble, transfer the meringue to a serving platter and spread the cream on top. Spoon over the fruit syrup. Serve immediately."]}, {"isVegetarian": true, "title": "Christmas trifle", "url": "www_bbc_co_uk_food_recipes_christmas_trifle_17719", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_trifle_17719_16x9.jpg", "ingredients": ["1 lemon, finely grated zest only", "250g/9oz ready-to-eat dried apricots", "150g/5½oz dried, sweet cranberries", "150g/5½oz dried pineapple", "3 large free-range egg yolks", "35g/1¼oz cornflour", "50g/1¾oz caster sugar", "600ml/20fl oz milk", "300ml/10fl oz single cream", "16 trifle sponges", "½ jar apricot jam", "20 ratafia biscuits (or amaretti biscuits)", "250ml/9fl oz medium-dry sherry", "600ml/20fl oz double cream", "50g/1¾oz flaked almonds, toasted"], "serves": "Serves 10", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["First, make the fruit compôte. Pour 600ml/20fl oz water into a large pan, add the lemon zest and bring to the boil. Add the apricots, cranberries and pineapple, reserving 2 apricots and 5 cranberries for decoration. Bring to the boil, lower the heat and simmer for 40 minutes. Remove from the heat and leave to cool for at least 4 hours, or preferably overnight. Once cool, strain the fruit, reserving the syrup.  ", "For the custard, put the egg yolks, cornflour and sugar into a large bowl and stir together with a whisk. Heat the milk and cream together in a pan until hot but not boiling. Gradually whisk into the yolks, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat, cover and allow to cool.", "For the fillings, split the trifle sponges and spread generously with the apricot jam. Sandwich together and arrange in the base of a 3 litre/5¾ pint trifle dish, close together, cutting to fit if necessary. Crumble the ratafias over the top. ", "Combine 250ml/9fl oz of the reserved fruit syrup with the sherry and sprinkle over the sponge and crumbled biscuits. Level the surface by pressing down with a spoon.", "Scatter the plump fruit over the sponge, then spread the cooled custard over the fruit. Cover and leave until completely cold before transferring to the fridge to chill and set.", "To decorate, beat the cream until just stiff enough to hold a soft, floppy shape. Spoon half into a piping bag fitted with a plain nozzle and gently spread the remaining half over the surface of the set custard and scatter with the almonds. Pipe blobs of cream around the edge of the trifle bowl. Halve the reserved apricots, then slice thinly. Cut each cranberry into three small pieces. Put a piece of apricot and a piece of cranberry on each blob of cream to decorate. Cover and chill until ready to serve. "]}, {"isVegetarian": true, "title": "Christmas wreath biscuits", "url": "www_bbc_co_uk_food_recipes_christmas_wreath_66081", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_wreath_66081_16x9.jpg", "ingredients": ["115g/4oz unsalted butter", "100g/3½oz caster sugar", "2 oranges, finely grated zest only", "1 small free-range egg, beaten", "150g/5½oz plain flour, plus extra for dusting", "50g/1¾oz cornflour", "50g/1¾oz ground almonds", "40g/1½oz slivered pistachios or pistachios ", "150g/5½oz white chocolate, cut into chunks", "25g/1oz dried cranberries ", "40g/1½oz dried barberries"], "serves": "Makes 18 biscuits", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Cream together the butter and sugar. Add the orange zest and two-thirds of the egg. Add the flours and almonds and mix to form a dough, adding a little extra flour if you need it to make a rollable dough.", "Lightly flour a work surface and roll out the dough to 8mm. Place on a baking tray and chill in the freezer for 15 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Cut 18 biscuits out with a ring template 5cm/2in in diameter and cut out a smaller circle in the middle so it looks like a wreath, re-rolling the dough if you need to. ", "Bake for 12–15 minutes. Remove and set aside to cool. ", "If you have bought whole pistachios, soak them in boiling water for 2–3 minutes, then skin them and cut them into slivers. ", "Melt the white chocolate in a heatproof bowl set over a pan of simmering water, making sure the bowl doesn’t touch the water. Use a small palette knife to drizzle and spread over the biscuits.", "Decorate with the pistachios, barberries and cranberries. Leave to set."]}, {"isVegetarian": true, "title": "Christmas apricot and chestnut stuffing", "url": "www_bbc_co_uk_food_recipes_christmasapricotandc_73428", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasapricotandc_73428_16x9.jpg", "ingredients": ["1 large onion, coarsely chopped", "225g/8oz dried apricots, snipped into small pieces", "225g/9oz fresh white breadcrumbs", "75g/3oz butter", "225g/8oz frozen chestnuts, thawed, roughly chopped", "generous bunch fresh parsley, chopped", "salt", "freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven 200C/400F/Gas 6.  Butter a shallow ovenproof dish.", "Add 600ml/1 pint water into a pan with the onion and apricots. Bring to the boil, then reduce the heat and simmer for about five minutes. Drain. ", "Put the breadcrumbs into a large bowl.  Melt the butter in a frying pan and pour half of this onto the breadcrumbs.  ", "In the remaining butter, fry the chestnuts over a high heat until lightly browned.  Tip into the bowl with the breadcrumbs. Add the apricots, onion and parsley to the bowl. Season with salt and pepper.", "Turn into a buttered, shallow ovenproof dish and bake in a preheated oven for about 25-30 minutes until crisp and hot right through."]}, {"isVegetarian": true, "title": "Christmas biscuits", "url": "www_bbc_co_uk_food_recipes_christmasbiscuits_93733", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmasbiscuits_93733_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter, softened at room temperature", "100g/3½oz caster sugar", "1 free-range egg, lightly beaten", "1 tsp vanilla extract", "275g/10oz plain flour", "To decorate", "400g/14oz icing sugar", "3-4 tbsp water", "2-3 drops food colourings", "Edible glitter"], "serves": "Makes 36 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. Line a baking tray with greaseproof paper.", "Cream the butter and sugar together in a bowl until pale, light and fluffy.", "Beat in the egg and vanilla extract, a little at a time, until well combined.", "Stir in the flour until the mixture comes together as a dough.", "Roll the dough out on a lightly floured work surface to a thickness of 1cm/½in.", "Using biscuit cutters or a glass, cut biscuits out of the dough and carefully place onto the baking tray. To make into Christmas tree decorations, carefully make a hole in the top of the biscuit using a straw.", "Bake the biscuits for 8-10 minutes, or until pale golden-brown. Set aside to harden for 5 minutes, then cool on a wire rack.", "For the icing, sift the icing sugar into a large mixing bowl and stir in enough water to create a smooth mixture. Stir in the food colouring.", "Carefully spread the icing onto the biscuits using a knife and sprinkle over the glitter. Set aside until the icing hardens."]}, {"isVegetarian": false, "title": "Christmas broth with cheesy croûtons", "url": "www_bbc_co_uk_food_recipes_christmasbrothwithch_84924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ red onion, chopped", "1 garlic clove, chopped", "100g/3½oz lamb trimmings", "½ sweet potato, finely chopped", "2 tbsp port", "150ml/5fl oz vegetable stock", "salt and freshly ground black pepper", "1 tbsp chopped fresh parsley", "100g/3½oz bread, cut onto cubes", "1 tbsp olive oil", "80g/3oz Stilton"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat the oil in a frying pan and add the onion and garlic. Fry for two minutes until softened.", "Add the lamb trimmings and fry until browned all over.", "Add the sweet potato, port and stock, bring to the boil and cook for ten minutes, or until the sweet potato is soft. Season, to taste, with salt and freshly ground black pepper and add the parsley.", "Meanwhile, for the croûtons, place the bread onto a baking tray and drizzle with the olive oil. Place under the grill to lightly toast.", "Sprinkle the toast with the cheese and return to the grill until the cheese has melted.", "Serve the soup in a bowl with the cheesy croûtons sprinkled over."]}, {"isVegetarian": true, "title": "Christmas cake", "url": "www_bbc_co_uk_food_recipes_christmascake_2359", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_2359_16x9.jpg", "ingredients": ["225g/8oz plain flour", "¼ tsp salt", "½ tsp mixed spice", "½ tsp ground cinnamon", "200g/7oz butter", "200g/7oz dark brown sugar", "2 tbsp black treacle", "1 tbsp marmalade", "¼ tsp vanilla essence", "4 free-range eggs, lightly beaten", "800g/1¾lb mixed dried fruits", "100g/3½oz chopped mixed peel", "150g/5oz glacé cherries, halved", "100g/3½oz blanched almonds, chopped", "brandy", "200g/7oz marzipan", "1-2 tbsp apricot jam, warmed", "3 free-range egg whites", "600g/1lb 5oz icing sugar, sieved", "1½ tsp liquid glycerine - optional", "1 tbsp lemon juice"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Heat the oven to 150C/300F/Gas2. Grease a 20cm/8inch round or an 18cm/7inch square cake tin and line the bottom and sides with baking parchment.", "Sieve the flour, salt, mixed spice and cinnamon into a bowl. ", "Cream the butter and the sugar in a large mixing bowl and then mix in the sugar, treacle, marmalade and vanilla essence until light and fluffy.", "Mix the eggs a little at a time into the mixture adding a tablespoon of flour mixture with the last amount.", "Fold in the remaining flour mixture until well mixed and then mix in the dried fruit, mixed peel, glace cherries and the almonds.", "Turn the mixture into the prepared tin and make a slight hollow in the centre.", "Bake in the oven for 3 hours and then test with a skewer. If not ready bake for up to another hour testing every 20 minutes until the skewer comes out clean. You may need to cover the top with a piece of foil if it begins to look too dark.", "Remove from the oven and leave to cool in the tin for 15 minutes. Turn out on to a wire rack and leave to cool.", "Once cool, make a few holes in the cake with a skewer and pour over 3-4 tbsp of brandy. Let the brandy soak into the cake. Store the cake wrapped in foil and in an airtight tin or plastic container, holes side up. For a rich and moist cake, spoon over a few tablespoons of brandy every week until you are ready to ice and decorate your cake.", "To decorate the cake, place the cake on a foil board or cake plate. Dust your hands and the work surface with a little icing sugar and knead the marzipan until soft. Roll out half the marzipan to fit the top of the cake and roll out the rest in strips to fit around the sides of the cake.", "Brush the cake all over with the warmed apricot jam and then place the marzipan on top and around the cake. Cover the cake with a clean tea towel and then leave in a cool place to dry for at least one day.", "To make the icing, lightly whisk the egg whites adding the sugar at intervals. Beat well until the icing reaches soft peaks. Add the glycerine if using and the lemon juice. Spread icing all over cake either flat iced using a clean ruler or by forming soft peaks. Decorate with Christmas ornaments."]}, {"isVegetarian": true, "title": "Christmas cake icing", "url": "www_bbc_co_uk_food_recipes_christmascakeicing_2360", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz marzipan", "1-2 tbsp apricot jam, warmed ", "3 egg whites", "600g/1lb 5oz icing sugar, sieved", "1½ tsp liquid glycerine - optional", "1 tbsp lemon juice"], "serves": "1 cake", "time": {"preparation": "1-2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Place the cake on a foil board or cake plate.", "Dust your hands and the work surface with a little icing sugar and knead the marzipan until soft.", "Roll out half the marzipan to fit the top of the cake and roll out the rest in strips to fit around the sides of the cake.", "Brush the cake all over with the warmed apricot jam and then place the marzipan on top and around the cake.", "Cover the cake with a clean tea towel and then leave in a cool place for at least one day.", "To make the icing, lightly whisk the egg whites adding the sugar at intervals. Beat well until the icing reaches soft peaks. Add the glycerine if using and the lemon juice.", "Spread icing all over cake either flat iced using a clean ruler or by forming soft peaks. Decorate with Christmas ornaments."]}, {"isVegetarian": true, "title": "Gluten-free Christmas cake", "url": "www_bbc_co_uk_food_recipes_christmascake_77307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmascake_77307_16x9.jpg", "ingredients": ["100g/3½oz soya margarine (or whatever kind of butter you like)", "1 large ripe banana", "2 large lemons, finely grated rind and juice only", "100g/3½oz soft prunes, stoned and halved", "75g/3oz raisins", "75g/3oz sultanas", "75g/3oz currants", "150g/5oz soft dried apricots, chopped in fairly large pieces", "50g/2oz mixed peel", "75g/2½oz walnuts, halved and 25g/¾oz hazelnuts, chopped OR 75g/3oz large pumpkin seeds and 25g/¾oz sunflower seeds", "2 eggs (or 2 level tsp gluten-free baking powder to make an egg-free cake) ", "75g/2½oz coarse polenta and 75g/2½oz rice flour and 1 level tsp xanthan gum OR 150g gluten-free flour that already includes xanthan gum ", "2 heaped tsp ground nutmeg", "1 heaped tsp ground cinnamon", "1 heaped tsp ground ginger", "½ teaspoon ground cloves", "2 tbsp brandy (optional)"], "serves": "Makes 20cm/8 in cake", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 160C/300F/Gas 3.", "In a food processor beat the butter/margarine with the banana and the lemon juice and rind. Pour into a bowl.", "Mix in the dried fruit and nuts or seeds. ", "Beat the eggs if you are using them. ", "Sieve which ever flours you are using with the baking powder (if you are substituting it for the eggs) and the spices. ", "Fold the eggs (if you are using them) into the fruit mixture alternately with the flours. Add some brandy if you like.", "Line a 20cm/8in cake tin with greased greaseproof paper. Spoon the mixture in and level off the top. ", "Bake for about two hours or until a skewer inserted in the middle comes out clean.", "Remove from the tin and cool on a rack. ", "Eat as it is or store to be iced for Christmas. You can also decorate this cake with whole nuts such as almonds."]}, {"isVegetarian": true, "title": "Christmas chutney", "url": "www_bbc_co_uk_food_recipes_christmaschutney_2803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb onions, peeled and chopped", "5 tbsp water", "900g/2lb cooking apples, peeled, cored and chopped", "700g/1½ pears, peeled, cored and chopped", "85g/3oz dates, stoned and chopped", "570ml/1 pint cider vinegar", "1 tsp salt", "1 tsp ground cinnamon", "1 tsp cayenne powder", "225g/8oz sugar"], "serves": "Makes 1.8kg/4lb", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Put the onions and the water in a large heavy-based pan. Bring to the boil and simmer until soft.", "Add the apples and pears and continue cooking gently for 15-20 minutes. Add the dates, salt, spices and half the vinegar. Cook, stirring occasionally until the mixture thickens. ", "Add the sugar and the rest of the vinegar, stirring until the sugar dissolves. Continue to simmer until the chutney becomes really thick. Stir occasionally.", "When ready, pot and seal in sterilised jars and leave to mature for a week or longer."]}, {"isVegetarian": false, "title": "Christmas crumble with vanilla custard", "url": "www_bbc_co_uk_food_recipes_christmascrumblewith_87717", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 rhubarb stems ", "2 tbsp light muscovado sugar", "1 orange, juice only", "pinch ground cinnamon", "55g/2oz plain flour", "pinch ground mixed spice", "2 tbsp finely chopped butter", "1 tbsp caster sugar", "100ml/3½fl oz ready-made fresh vanilla custard"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Trim and peel the rhubarb. Cut the rhubarb into chunks and place into a pan over a medium heat.", "Add the light muscovado sugar, orange juice and cinnamon. Bring to the boil, then reduce the heat to simmer for 8-10 minutes, until the rhubarb is tender but still holding its shape.", "Meanwhile, sieve the flour and mixed spice into a bowl.", "Add the butter and rub into the flour mixture with your fingers until the mixture resembles fine breadcrumbs.", "Add the caster sugar and stir to combine.", "Transfer the stewed rhubarb to an ovenproof dish and sprinkle over a thin, even layer of the crumble topping.", "Transfer the crumble to the oven to bake for 10-12 minutes, or until the topping is cooked through and lightly golden-brown.", "Heat the vanilla custard in a small pan, then transfer to a serving jug.", "Serve the crumble in its dish at the table (place a thick heatproof board underneath), with a jug of the custard so that guests can help themselves."]}]