[{"ingredients": ["1 huevo de gallinas camperas, solo yema", "85g / 3oz de queso azul danés, desmenuzado", "3 cucharadas de crema doble", "1 cucharadita de mostaza Dijon", "dash salsa Worcestershire", "sal y pimienta negra recién molida", "2 rebanadas de pan blanco crujiente, a la plancha"], "method": ["Precalentar la parrilla a mediano.", "Coloque la yema de huevo, queso, crema, mostaza, salsa Worcestershire, sal y pimienta negra recién molida en un mini procesador de alimentos y mezcle hasta que estén bien combinados. Cubra el pan con la mezcla de huevo y queso y coloque en una bandeja para hornear. Grill durante 3-4 minutos, o hasta que se dore y burbujee en la parte superior.", "Transfiera a un plato de servir y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_bluecheesewelshrareb_89074", "title": "Queso azul gales rarebit", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["grasa recortada de 2 pechugas de pato o 15 ml / 1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, picada", "1 puerro, picado", "1 zanahoria, pelada y picada", "150ml / ¼ pt de vino tinto", "150ml / ¼ pt de caldo de verduras", "55g / 2 oz de perejil fresco de hoja plana, picado"], "method": ["Precalentar una olla grande.", "Caliente la grasa de pato o el aceite de oliva en la cacerola. Agrega la mantequilla.", "Agregue las cebollas y saltee durante 2 minutos.", "Agregue el puerro y la zanahoria y saltee durante 2 minutos.", "Agregue el vino tinto y el caldo de verduras. Ponga la sopa a hervir y cocine a fuego lento durante 8-10 minutos.", "Agregue la hierba antes de quitar la sopa del fuego.", "Vierte la sopa en los tazones y sirve."], "url": "www_bbc_co_uk_food_recipes_bluemingmarvellous_67695", "title": "Caldo de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["¼ cucharadita de pimienta blanca molida", "¼ cucharadita de pimienta negra molida", "¼ nuez moscada, finamente rallado", "¼ cucharadita de pimienta de cola molida (también conocida como bayas cubeb)", "¼ cucharadita de semillas de comino", "¼ de cucharadita de anís", "1 pimiento largo seco", "½ cucharadita de semillas de cilantro", "3 dientes de ajo, finamente picados", "7 chalotes, finamente picados", "3 chiles rojos, sin semilla, finamente picados", "2cm / ¾ en pieza de raíz de jengibre fresco, pelado, finamente picado", "1cm / ½ en pieza de galanga fresca, pelada, finamente picada", "Cúrcuma fresca de 2cm / ¾in, frita hasta dorada", "½ cucharadita de pasta de tamarindo lista para usar", "4 nueces de vela", "1 tallo de limoncillo, hojas exteriores duras retiradas, tallo interior suave picado", "1 cucharadita de azúcar de coco", "1 lubina grande y grande (aproximadamente 2kg / 4lb 8oz), desescamada, eviscerada, enjuagada por dentro y por fuera bajo agua fría", "2 limas, solo jugo", "sal al gusto", "pequeño manojo de hojas de albahaca y limón", "3 hojas de laurel", "1 x 70x40cm / 28x16 en hoja de plátano, para envolver el pescado"], "method": ["Precalentar el horno a un ventilador de 200C / 180C / Gas 6.", "Para la pasta de especias, fríe en un sartén a fuego medio durante 4-5 minutos, o hasta que estén tostados y fragantes, la pimienta blanca, la pimienta negra, la nuez moscada, la pimienta de cola, las semillas de comino, el anís, la pimienta larga y las semillas de cilantro.", "Moler las especias tostadas a un polvo fino en una maja grande y mortero o molinillo de especias. Agregue los ingredientes restantes de la pasta de especias y continúe amasando los ingredientes para obtener una pasta áspera. Dejar de lado.", "Para la lubina al horno, frote la lubina con jugo de lima y deje de lado durante 5 minutos.", "Extiende la pasta de especias por todo el pescado hasta que esté cubierto. Sazonar con sal, luego rellenar la cavidad con hojas de albahaca y hojas de laurel.", "Coloque el pescado en el centro de la hoja de plátano (use varias hojas si no puede encontrar una que sea lo suficientemente grande). Doble los bordes de la hoja de plátano sobre el pescado para crear un paquete apretado. Asegúrelo con brochetas de madera o cócteles.", "Hornee la lubina en el horno durante 40-50 minutos, o hasta que el pescado esté bien cocido. Desenvuelva el pescado y retire la carne de los huesos, manteniendo la piel lo más intacta posible. Sirva con verduras cocinadas con cúrcuma."], "url": "www_bbc_co_uk_food_recipes_bobbys_banana_leaf-baked_35050", "title": "Lubina al horno de hoja de plátano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 dientes de ajo", "5 chalotes", "3 cm / 1¼ en pieza de cúrcuma fresca", "5 nueces de vela", "1 cucharada de sal", "2 cucharadas de aceite vegetal", "2 tallos de limoncillo, magullados ligeramente (aplastar un poco con un rodillo)", "2 hojas de laurel", "2cm / ¾en pieza de galanga fresca, ligeramente triturada", "Jengibre fresco de 3cm / 1¼ en pieza, ligeramente triturado", "3 hojas de lima kaffir", "400-500ml / 14-17fl oz de leche de coco", "Frijoles verdes de 250g / 9oz, lavados, recortados, cortados a 5mm / ¼ de largo", "Zanahorias de 400g / 14oz, recortadas, cortadas en cubos de 5mm / ¼ en cubitos", "50g / 1¾oz de chalotes, cortados en trozos pequeños", "1 pepino, cortado por la mitad a lo largo, semillas raspadas, carne picada en cubos de 7 mm / ¼", "12 chiles rojos de ojo de pájaro, dejados enteros", "3 cucharadas de vinagre de vino de arroz", "2 cucharadas de azúcar en polvo", "1 cucharadita de sal"], "method": ["Para la pasta de especias, moler todos los ingredientes de la pasta de especias en una pasta en un mortero. Dejar de lado.", "Para las verduras, caliente el aceite vegetal en un wok a fuego alto. Agregue la pasta de especias y fría por 2-3 minutos, o hasta que esté fragante.", "Agregue las hojas de limoncillo, hojas de laurel, galanga, jengibre y lima kaffir, luego vierta la leche de coco y cocine a fuego lento, revolviendo bien. Cocine a fuego lento durante 5-10 minutos, o hasta que la leche de coco se reduzca en volumen y espese ligeramente.", "Agregue las judías verdes, las zanahorias y los chalotes y continúe cocinando a fuego lento por otros 5-10 minutos, o hasta que estén tiernos. Agregue el pepino y los chiles y cocine a fuego lento durante 2-3 minutos más.", "Agregue el vinagre de vino de arroz, el azúcar y la sal, y continúe cocinando a fuego lento por unos 2-3 minutos. Compruebe el condimento, agregando más vinagre, azúcar o sal, al gusto.", "Justo antes de servir, retire los tallos de limoncillo y las hojas de laurel. Servir en tazones."], "url": "www_bbc_co_uk_food_recipes_bobbys_vegetables_cooked_00387", "title": "Verduras cocidas en cúrcuma y vinagre de arroz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["una pieza de tamarindo del tamaño de una miniatura", "285 ml / ½ pinta de vino tinto de buena calidad", "3 kg / 6½ lb de la mejor carne picada (para obtener mejores resultados, consigue un buen filete de grupa y picadito por ti mismo)", "250g / 9oz de almendras blanqueadas", "24 granos de pimienta negra, aplastados", "un pedazo de jengibre fresco del tamaño de un pulgar, finamente picado", "2 chiles calientes, finamente picados", "algunas ramitas de mejorana, solo hojas", "20 semillas de cilantro, aplastadas", "4 dientes de ajo, finamente picados", "1 cebolla pequeña, finamente picada", "un limón, ralladura solamente", "puñado de sultanas", "285ml / ½ pinta de crema doble", "125gm / 4oz de mantequilla sin sal ablandada", "sal y pimienta negra recién molida", "8 hojas de laurel", "semillas de comino, para rociar", "mantequilla, para engrasar", "565ml / 1 litro de leche", "10 huevos, batidos", "2 cucharadas de polvo de curry medio", "1 cucharadita de polvo de hornear", "nuez moscada recién rallada, al gusto", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Remoje la vaina de tamarindo en el vino para permitir que se ablande y se disuelva ligeramente.", "Coloque la carne en un recipiente limpio junto con los siguientes diez ingredientes de la lista de ingredientes. Amasar bien la carne y las especias, no seas tímido, no te metas.", "Agregue la mezcla de tamarindo y vino tinto, luego agregue la crema, 125 g / 4 oz de mantequilla. Sazone al gusto con sal y pimienta. Ruede las hojas de laurel y \"siembrelas\" como plántulas en el pastel de carne.", "Mantequilla los lados y el fondo de una olla de barro lo suficientemente grande como para mantener la carne con mucho espacio de sobra. Espolvorea el interior con las semillas de comino. Coloque el pastel de carne en el horno precalentado durante aproximadamente una hora, hasta que esté ligeramente levantado y cocido.", "Para el relleno de crema, mezcle la leche y los huevos. Agregue el polvo de curry, la sal al gusto y bata de nuevo.", "Retire la albondiga del horno y vierta cuidadosamente la mezcla de crema sobre la parte superior. Regrésalo al horno y hornea hasta que el aderezo de crema se haya endurecido y cocinado hasta obtener un color marrón dorado. Puedes terminarlo con un soplete si se ve un poco anémico. Termine con un toque de nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_bobotie_79662", "title": "bobotie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve alrededor de 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva", "1 cebolla picada", "2 dientes de ajo, aplastados", "500g / 1lb 2oz de carne de cordero", "1 cucharada de curry en polvo caliente", "1 limón, jugo y ralladura solamente", "2 cucharadas de chutney de mango", "75g / 2½oz sultanas", "75g / 2½oz de almendras tostadas", "1 rebanada de pan blanco, remojado en leche durante 1 minuto y luego exprimido en seco", "sal y pimienta negra recién molida", "4 hojas de laurel", "3 huevos de gallinas camperas", "150ml / 5fl de leche en oz", "arroz, cocinado según las instrucciones del paquete", "chutneys de su elección", "yogur"], "method": ["Precalentar el horno a 180C / 375F / Gas 4.", "Caliente la mitad del aceite en una sartén grande a fuego medio. Agregue la carne picada y cocine hasta que se dore. Incline la carne picada en un colador y escurra el exceso de grasa.", "Limpie la sartén, agregue el aceite restante y fría la cebolla y el ajo hasta que se ablanden. Regrese la carne picada a la sartén.", "Agregue el polvo de curry, el zumo y la ralladura de limón, la chutney de mango, las sultaninas, las almendras tostadas y el pan remojado y mezcle bien.", "Sazone con sal y pimienta negra recién molida, luego transfiera todo a un plato de soufflé engrasado o lata de pan.", "Coloque las hojas de laurel en la mezcla.", "Rompe los huevos en un tazón y mezcle con la leche. Vierta la mezcla de huevo sobre la mezcla de carne.", "Cubra con papel de aluminio y colóquelo en el horno para hornear durante 40 minutos, o hasta que esté cocido y dorado.", "Sirve con arroz, chutneys de tu elección, yogur y cualquier otro acompañamiento de estilo curry que te apetezca."], "url": "www_bbc_co_uk_food_recipes_bobotie_83671", "title": "bobotie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Espinilla de res 900g / 2lb o estofado de ternera, cortado en 6 trozos grandes", "2 cucharadas de harina normal", "2 cucharadas de aceite vegetal", "150 g / 5½ oz lardons o cubos de tocino ahumado", "10 cebollas o chalotes, pelados", "2 dientes de ajo, aplastados", "1 hoja de laurel", "manojo de perejil, solo tallos", "Ramita de tomillo", "ramita de romero", "3 dientes", "10 granos de pimienta, aplastados", "500ml / 18fl oz de vino tinto", "1 cucharada de puré de tomate", "1 cucharadita de azúcar", "1 cucharadita de sal", "10 hongos castaños", "hojas de perejil, picadas, para adornar", "Baguette rancio 200g / 7oz u otro pan (corteza incluida)", "puñado de perejil picado", "Leche 250ml / 9oz", "pizca de nuez moscada", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas", "1 cucharada de harina normal", "mantequilla, para freír"], "method": ["Precalentar el horno a 150C / 300F / Gas 2.", "Espolvorea cada trozo de carne con harina. Caliente el aceite en una cazuela grande a fuego alto y fría la carne en tandas hasta que se dore. Retire cada lote, manteniendo el aceite, luego fría los lardons, las cebollas y el ajo en la misma sartén hasta que estén dorados. Agregue las hierbas y las especias y devuelva la carne a la sartén. Agregue 300 ml / 10 fl oz de agua, el vino, la pasta de tomate, el azúcar y la sal. Raspe los pedazos caramelizados ya que agregarán sabor.", "Cubra, coloque en el horno y cocine durante tres horas o hasta que la carne esté tierna y casi se derrumbe.", "Cortar la baguette en cubos pequeños y colocar en un bol. Agrega el perejil Llevar la leche a ebullición y verter sobre. Revuelva para que la leche se absorba de manera uniforme, luego cúbrala y déjela durante 15 minutos.", "Sazone con nuez moscada, sal y pimienta, agregue el huevo y mezcle en una cucharada de harina. Si la mezcla está demasiado húmeda (debe estar húmeda y ligeramente pegajosa), agregue una segunda cucharada de harina. Moje las manos un poco para ayudar a detener la masa que se adhiere a ellas, luego haga 12-14 bolas de masa hervida (más pequeñas que una pelota de golf).", "Aproximadamente 20 minutos antes de que el guiso esté listo, agregue los champiñones en el guiso y sazone con sal al gusto.", "Mientras tanto, caliente un trozo de mantequilla en una sartén grande y fría las albóndigas a fuego medio durante cinco minutos o hasta que estén doradas y crujientes, luego escurra.", "Adorne el guiso con perejil y sirva con las albóndigas."], "url": "www_bbc_co_uk_food_recipes_boeuf_bourguignon_with_17690", "title": "Ternera Bourguignon con albóndigas de baguette", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/boeuf_bourguignon_with_17690_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,6kg / 3lb 8oz bistec estofado de buena calidad (chuck steak)", "4-5 cucharadas de aceite de girasol", "sal marina escamada y pimienta negra recién molida", "200 g / 7 oz de tocino ahumado lardons o tocino rayado ahumado, cortado en piezas de 2cm / ¾in", "1 cebolla grande, finamente picada", "2 dientes de ajo, aplastados", "Botella de 75 cl vino tinto", "2 cucharadas de puré de tomate", "1 cubo de caldo de carne", "2 hojas de laurel grandes", "3 ramitas espesas tomillo", "25g / 1oz de mantequilla", "Cebollas de botón de 450 g / 1 libra, o 24 cebollas bebé", "Setas de castaña de botón de 300g / 10½ oz, secadas y cortadas a la mitad o descuartizadas si son grandes", "2 cucharadas colmadas de harina de maíz", "2 cucharadas de agua fría", "perejil recién picado, para adornar"], "method": ["Corte el filete estofado en trozos gruesos, cada uno alrededor de 4-5 cm / 1½-2 in. Recorte cualquier grasa o tendón realmente duro. Sazone la carne muy bien con sal y pimienta.", "Caliente dos cucharadas de aceite en una sartén grande. Freír la carne en tres tandas a fuego medio-alto hasta que se dore por todos lados, volteándola de vez en cuando y agregando más aceite si es necesario. Tan pronto como la carne esté dorada, transfiérala a una gran cazuela a prueba de llamas. Precalentar el horno a 170 ° C / 150 ° C (ventilador) / Gas 3.", "Vierta un poco más de aceite en la sartén en la que se doraba la carne y fríe el tocino durante 2-3 minutos, o hasta que la grasa se dore y se dore. Esparce el tocino sobre la carne. Agregue un poco más de aceite a la sartén y freír la cebolla picada a fuego lento durante 5-6 minutos, revolviendo a menudo hasta que se ablande. Revuelva el ajo en la sartén y cocine por un minuto más.", "Agregue la cebolla y el ajo a la sartén con la carne y vierta sobre el vino. Agregue el puré de tomate y 150 ml / 5 fl oz de agua. Desmenuce el cubo común, agregue las hierbas y cocine a fuego lento. Revuelva bien, cubra con una tapa y transfiéralo al horno. Cocine durante 1½ -1¾ horas, o hasta que la carne esté casi tierna.", "Mientras la carne se cocina, pele las cebollas. Coloque las cebollas en un recipiente resistente al calor y cubra con agua recién hervida. Deje reposar durante cinco minutos y luego drene. Cuando las cebollas estén lo suficientemente frías para manipularlas, recorte la raíz cerca del extremo para que no se deshagan y despeguen de la piel.", "Unos minutos antes de que la carne esté lista, derrita la mitad de la mantequilla en una sartén antiadherente grande con un toque de aceite y sofríe las cebollas a fuego medio durante unos cinco minutos, o hasta que estén doradas por todos lados. Sugerencia en un tazón. Agregue la mantequilla y los champiñones restantes a la sartén y cocínelos durante 2-3 minutos a fuego bastante alto hasta que estén dorados, volteándolos con frecuencia.", "Mezcle la harina de maíz con el agua en un tazón pequeño hasta que quede suave.", "Retire la cazuela del horno y agregue la mezcla de harina de maíz, seguido de las cebollas y los champiñones. Regrese al horno y cocine durante 45 minutos más, o hasta que la carne esté tierna y la salsa espesa. La salsa debe cubrir la parte posterior de una cuchara, si queda bastante delgada, simplemente agregue un poco más de harina de maíz, mezcle con un poco de agua fría y cocine a fuego lento durante unos minutos en la placa.", "Para servir, elimina los tallos de tomillo. Espolvoree la cazuela con perejil recién picado y sirva."], "url": "www_bbc_co_uk_food_recipes_boeuf_bourguignon_25475", "title": "Carne de res Bourguignon", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "400ml / 14fl oz de leche entera", "50g / 1¾oz de pan blanco fresco", "4 huevos grandes de gallinas camperas, golpeados", "1 cucharada de aceite de oliva", "1kg / 2lb 4oz cordero picado", "2 cebollas, finamente picadas", "1 hoja de laurel", "2 dientes de ajo, aplastados", "2 cucharadas de pasta de curry madras", "250ml / 9fl oz de caldo de cordero", "2 cucharadas de salsa Worcestershire", "2 cucharadas de chutney de mango", "50 g / 1oz de pasas", "50 g / 1¾oz de albaricoques secos, picados", "1 cucharada de vinagre de sidra"], "method": ["Precaliente el horno a 180C / 160C Fan / Gas 4 y engrase un plato hondo para horno con mantequilla.", "Combine la leche, el pan rallado y los huevos en una jarra grande, mezcle con un tenedor y déjelos a un lado.", "Caliente el aceite en una sartén grande de base pesada y fría el cordero en lotes durante 5 minutos o hasta que se dore. Transfiera a un tazón usando una cuchara ranurada. Agregue las cebollas y la hoja de laurel a la sartén y fría por 10 minutos, o hasta que las cebollas estén doradas.", "Agregue el ajo a la sartén, fría por un minuto y luego agregue la pasta de curry. Fría la pasta por un minuto, luego devuelva el cordero a la sartén y revuelva para cubrir. Vierta sobre el caldo, hierva a fuego lento y cocine durante 10 minutos, o hasta que la mayoría del líquido se haya evaporado.", "Retire la sartén del fuego y agregue los ingredientes restantes. Con una cuchara, coloca la mezcla de cordero en el plato untado con mantequilla y alisa con una cuchara.", "Vierta la mezcla de leche sobre la parte superior, luego hornee durante 35 minutos, o hasta que se dore en la parte superior; la cobertura debe estar acabada, con un ligero bamboleo. Deje reposar por unos minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_bobotie_95101", "title": "bobotie", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos medianos", "2 rebanadas de pan de centeno oscuro (pumpernickel)", "5 g de mantequilla sin sal, para untar", "sal marina y pimienta negra molida"], "method": ["Mitad llene una cacerola mediana con agua y llévela a ebullición. Agregue suavemente los huevos al agua con una espumadera y vuelva a hervir.", "Cocine los huevos en agua hirviendo durante 6 minutos para un huevo pasado por agua.", "Mientras se cocinan los huevos, tueste el pan, extiéndalo con una capa fina de mantequilla y corte en soldados delgados.", "Coloque los huevos en hueveras y colóquelos en platos pequeños. Cortar las tapas y sazonar al gusto. Sirva con los soldados para mojar."], "url": "www_bbc_co_uk_food_recipes_boiled_egg_with_rye_48933", "title": "Huevo hervido con pan de centeno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/boiled_egg_with_rye_48933_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["900g / 2lb de fruta mezclada, pasas, pasas sultanas, nueces picadas y nueces", "350 g / 12 oz de azúcar", "Margarina 350g / 12oz", "1 cucharadita de bicarbonato de soda", "250ml / 9fl oz de agua fría", "Brandy 250ml / 9fl oz", "240g / 8½oz de harina natural", "240g / 8½oz de harina de auto crianza", "4 huevos de gallinas camperas, golpeados", "2 cucharaditas de polvo de hornear", "1 cucharadita de especias mixtas", "1 x 200 g / 7oz de tina de cerezas glaseadas, picadas"], "method": ["Precaliente el horno a 150 ° C / 300 ° F / Gas 3. Engrase y alinee tres moldes para pan.", "Coloque la fruta y los frutos secos, el azúcar, la margarina, el bicarbonato de soda, el agua y el brandy en una sartén grande y deje que hierva. Retire la olla del fuego y deje que se enfríe.", "Cuando la mezcla se haya enfriado, agregue los ingredientes restantes y mezcle bien. Verter en las latas de pan y hornear por dos horas o hasta que un pincho insertado en el medio salga limpio."], "url": "www_bbc_co_uk_food_recipes_boiled_fruit_cake_18540", "title": "Pastel de frutas hervidas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Rinde 3 panes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Jamón de 5½ -7¼kg / 12-16lb con el hueso adentro", "2 cebollas, descuartizadas", "pocos dientes", "algunos granos de pimienta negra", "1 hoja de laurel", "4 cucharadas de mostaza inglesa", "75g / 2½ oz de azúcar demerara, dependiendo del tamaño del jamón", "Polvo de pollo 300ml / ½pint (para hacer una salsa)"], "method": ["Coloque el jamón remojado en una sartén grande, con las cebollas, los clavos de olor, los granos de pimienta y la hoja de laurel.", "Cubra con agua, hierva y elimine cualquier impureza. Deje el jamón a fuego lento, permitiendo 20 minutos por 450 g (1 libra).", "Precaliente el horno a 190C / 375F / Gas 5.", "Una vez cocido, retire el jamón de la sartén y déjelo reposar de 10 a 15 minutos antes de despegar la piel.", "La grasa puede dejarse como está o marcarse, creando un patrón de diamante. Cepille el jamón con mostaza y espolvoree bien con el azúcar demerara.", "Hornee el jamón durante 30-40 minutos teniendo cuidado de rociar el jamón con los jugos y el azúcar caramelizado. Una vez dorado, retírelo del horno y descanse durante 15-30 minutos antes de tallar, o déjelo hasta que esté frío.", "Para preparar la salsa, vierta el caldo de pollo en la bandeja de asar para levantar cualquier residuo en la sartén y cocine a fuego lento hasta que se reduzca en un tercio a la mitad y colar."], "url": "www_bbc_co_uk_food_recipes_boiledandbakedham_71057", "title": "Jamón hervido y cocido", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/boiledandbakedham_71057_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 limones de piel gruesa, preferiblemente sin encerar", "1 cucharadita de sal marina", "4 alcachofas globo", "75g / 3oz de almendras blanqueadas, divididas en mitades", "2 cucharadas de tomillo fresco finamente picado", "2 cucharadas de miel", "1 limón, solo jugo", "4 cucharadas de aceite de oliva virgen extra"], "method": ["Coloque los limones enteros en una olla pequeña, cúbralos con agua, agregue la sal y deje que hierva. Cubra con una tapa de cacerola más pequeña vuelta al revés, o un platillo a prueba de calor para mantener los limones debajo de la superficie del agua. Puede que tenga que pesar la tapa o el platillo hacia abajo, ya que los limones flotarán a la superficie.", "Hervir los limones durante 30 minutos, o hasta que los limones estén suaves y la piel se pueda perforar fácilmente con un tenedor, luego drenar y reservar para enfriar.", "Cocine las alcachofas en una sartén por separado de agua hirviendo con sal durante 20 minutos, o hasta que estén blandas en el centro, luego escurra y déjelas a un lado para que se enfríen.", "Pele las hojas exteriores duras de las alcachofas y corte a través de la parte superior para eliminar la parte superior, no comestible de las hojas y revelar el corazón. Recorte los tallos si son fibrosos, y elimine el estrangulador (la materia amarilla peluda en el centro de la alcachofa) si hay uno. Corte las alcachofas en cuartos, colóquelas en un recipiente y sazone con sal y pimienta negra recién molida.", "Corte los limones hervidos por la mitad, luego saque y deseche la pulpa interna suave y otra médula fibrosa. Rasgue las pieles de cada mitad en 2-3 pedazos y agregue a las alcachofas.", "Calentar una sartén pequeña a fuego medio. Agregue las almendras y tuestelas, revolviéndolas ocasionalmente, doradas por todas partes.", "Agregue las almendras tostadas y las hojas de tomillo a la mezcla de alcachofas y limón.", "Mezcle la miel con el jugo de limón en un recipiente limpio y agregue el aceite de oliva. Sazonar, al gusto, con sal y pimienta negra recién molida, luego verter el aderezo sobre las alcachofas y los limones. Mezcle bien y sirva."], "url": "www_bbc_co_uk_food_recipes_boiledlemonandartich_84656", "title": "Ensalada hervida de limón y alcachofa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas, finamente picadas", "1 zanahoria grande, finamente picada", "2 palitos de apio, finamente picado", "500 g / 1 libra de carne picada magra de 2 oz", "500 g / 1 libra de carne picada 2 oz", "3 dientes de ajo, aplastados", "3 cucharadas de pasta de tomate secada al sol", "150ml / 5fl oz de vino blanco", "500g / 1lb 2oz pasado", "400g de tomates cortados en lata", "200ml / 7fl oz de caldo de carne", "3 hojas de laurel", "2 cucharadas de hojas de tomillo picadas", "4 cucharadas de crema doble", "sal y pimienta negra recién molida", "Pasta de pappardelle 450g / 1lb, para servir", "Parmesano, para servir", "hojas de albahaca, para adornar"], "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente el aceite en una cacerola honda a prueba de horno con tapa. Agregue la cebolla, la zanahoria y el apio y fría a fuego alto durante 5-6 minutos, o hasta que comience a ablandarse. Agregue la carne de cerdo y la carne picada y fría hasta que se dore y el exceso de líquido se haya evaporado. Agregue el ajo y fría por 30 segundos.", "Agregue la pasta de tomate y revuelva. Agregue la passata, tomates, caldo, hierbas y vino. Sazonar con sal y pimienta y llevar a ebullición, cubrir y hornear durante aproximadamente una hora.", "Agregue la crema, y ​​vuelva al horno, con la tapa, durante otra hora, hasta que esté tierno y reducido.", "Ponga a hervir una olla de agua con sal, agregue la pasta y cocine según las instrucciones del paquete. Drene y revise el condimento.", "Divida la pasta entre los platos, cubra con la salsa, ralle sobre un poco de parmesano, adorne con hojas de albahaca y sirva."], "url": "www_bbc_co_uk_food_recipes_bolognaise_ragu_with_66037", "title": "Ragú boloñés con pappardelle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognaise_ragu_with_66037_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 huevos de pato al aire libre", "3 rebanadas de pan blanco, tostado", "mantequilla, para servir"], "method": ["Coloque con cuidado los huevos de pato en una olla con agua hirviendo y cocine por 6-7 minutos. Retire de la sartén y coloque en una taza de huevo.", "Unte las tostadas con mantequilla y corte a los soldados para que sirvan con los huevos."], "url": "www_bbc_co_uk_food_recipes_boiledduckeggandsold_88787", "title": "Huevo de pato hervido y soldados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["400 g / 14 oz 00 harina de pasta", "4 huevos de gallinas camperas, ligeramente golpeados", "2 cucharaditas de sal", "Carne de salchicha de cerdo grueso de buena calidad de 400g / 14oz", "1 cucharada de aceite de oliva", "1 cebolla pequeña, finamente picada", "2 palitos de apio, picados", "¾ cucharadita de semillas de hinojo, tostadas en un mortero", "1 ramita de romero fresco, hojas finamente picadas", "¼ cucharadita de copos de chile", "1 diente de ajo grande, rallado", "150ml / 5fl oz de vino blanco seco", "150ml / 5fl oz de crema doble", "150ml / 5fl oz de caldo de pollo", "50 g / 1¾oz de queso parmesano, recién rallado", "sal y pimienta negra recién molida"], "method": ["Para hacer la pasta, en un procesador de alimentos, combine la harina, los huevos y la sal, luego incline sobre una superficie de trabajo y agréguelos en una bola de masa, cubra con una película adhesiva y descanse durante 20-30 minutos.", "Idealmente con una máquina de pasta o un rodillo, extienda la pasta en un par de hojas finas (de aproximadamente 2 mm de grosor). Ejecutar a través de una máquina de pasta para hacer tagliatelle, o con un cuchillo o cortador de pizza, cortar en cintas de 5 mm de ancho. Separe los hilos y déjelos secar en el respaldo de una silla o extiéndalos en una bandeja.", "Divida la carne de salchicha en una sartén grande con tapa con un poco de aceite de oliva, dependiendo de qué tan grasa es la carne de salchicha, ya que puede hacer un poco de grasa. Cocine a fuego medio durante unos 10 minutos revolviendo de vez en cuando. Agregue la cebolla, el apio, las semillas de hinojo, el romero, el chile y el ajo, luego cocine por otros 15 minutos. Vierta el vino y cocine hasta que se reduzca el volumen a la mitad, luego agregue la crema y el caldo de pollo. Sazone con sal y pimienta, luego tape la sartén y cocine a fuego lento durante media hora.", "Cuando esté listo para servir, cocine los tallarines en abundante agua con sal por unos 4 minutos hasta que estén al dente, drene y agregue a la sartén de ragú y mezcle. Sirva en tazones calientes con parmesano recién rallado."], "url": "www_bbc_co_uk_food_recipes_bolognese_sausage_rag_01151", "title": "Salchicha boloñesa ragú con tagliatelle", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bolognese_sausage_rag_01151_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,4 kg / 3 lb 1 oz de cuello de tocino, con la piel puesta, empapado en agua fría durante la noche en la nevera o en un lugar fresco", "1 hoja de laurel fresca", "10 granos de pimienta negra", "2 dientes", "1 barra de canela", "1 cebolla grande, pelada", "600ml / 1 pinta 2fl oz buena sidra", "25 g / 1oz de mantequilla sin sal", "4 dientes grandes de ajo, pelados", "8 chalotas pequeñas, peladas pero con el extremo de la raíz intacto", "10 granos de pimienta blanca", "4 zanahorias medianas, cortadas en diagonal a 5 mm / ¼ de grosor", "3 palitos de apio, cortados en diagonal a 5 mm / ¼ de grosor", "Harina de 90g / 3½oz de levante", "pizca de sal", "1 cucharadita de mostaza inglesa en polvo", "45 g / 1½ oz de sebo triturado", "1 cucharada de perejil fresco picado", "pimienta negra recién molida, al gusto", "Mostaza inglesa, al gusto"], "method": ["Para hervir el tocino, retire la junta de tocino del agua y colóquela en una cacerola grande y profunda con tapa. Agregue el resto de los ingredientes para hervir el tocino.", "Vierta suficiente agua fría para cubrir la junta en 2,5 cm / 1 in. Cubra con una tapa, colóquelo a fuego alto y lleve a ebullición. Reduzca el fuego a fuego lento y cocine, cubierto, durante una hora.", "Prueba para ver si la carne está tierna perforándola con un cuchillo de mesa romo. Si es difícil insertar la cuchilla, continúe cocinando por otros 20 minutos y vuelva a probar. Cuando la carne esté tierna, retire la sartén del fuego y déjela a un lado.", "Para guisar el tocino, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Coloque una cacerola grande con horno con tapa en la estufa y caliente hasta que esté caliente. Agregue la mantequilla, luego agregue el ajo, los chalotes y los granos de pimienta y fría por un minuto.", "Agregue las zanahorias y el apio y freír suavemente durante unos cinco minutos hasta que estén ligeramente coloreados. Retire el collar de tocino del líquido en el que se hirvió la carne.", "Corte y levante la piel del tocino con un cuchillo afilado: debe desprenderse en una sola pieza. Coloque la articulación de tocino sin piel encima de las verduras en la cazuela. Agregue suficiente del líquido de caza furtiva para cubrir las verduras en 2,5 cm / 1 in (es posible que deba recargar con agua si no es suficiente).", "Cubra con la tapa y colóquelo en el horno por 15 minutos.", "Mientras tanto, para las albóndigas, tamice la harina, la sal y el polvo de mostaza en un bol. Agregue el sebo, el perejil picado y la pimienta negra recién molida, al gusto.", "Agregue suficiente agua fría para hacer una masa rígida que no se adhiera a los lados del recipiente. Con las manos, divida la mezcla en trozos del tamaño de una nuez y enrolle las bolas ordenadas en la palma de su mano.", "Agregue las albóndigas enrolladas a la cazuela, alrededor de la unión, y coloque la cazuela de nuevo en el horno para cocinar durante otros 25-30 minutos. Cuando haya terminado, las albóndigas deben estar cocidas, infladas y livianas. La carne estará tierna y untuosa, las verduras colapsarán un poco y el líquido de cocina se habrá espesado.", "Para servir, levante con cuidado la carne de la cazuela en un tablero y corte en rodajas generosas. Divida las verduras en partes iguales entre cuatro platos, cubra con rebanadas de carne, rodee con unas albóndigas y una cuchara sobre los jugos espesados. Sirve con mostaza inglesa."], "url": "www_bbc_co_uk_food_recipes_boiledcollarofbaconw_90922", "title": "Collar de tocino hervido con verduras y albóndigas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200 g / 7 oz mezcla de hojas amargas, como al menos tres de estos: cime de violación, puntarelle, achicoria, achicoria y escarola", "Cohete de 100g / 3½ oz", "6 higos maduros, cuarteados o 2 melocotones blancos maduros, piedra removida y rebanada", "10 rebanadas de prosciutto, desmenuzado", "50g / 1¾oz de virutas de parmesano", "90 g / 3¼ oz de gorgonzola", "500g / 1lb 2oz de tomates maduros sabrosos, sin núcleo, cortados en cuñas", "1 cucharada de alcaparras, escurridas", "40 g / 1½ oz de piñones tostados", "puñado de hojas de albahaca", "60ml / 2fl oz de aceite de oliva", "30ml / 1fl oz de vinagre balsámico dulce y envejecido"], "method": ["Mezcle las hojas y el cohete en un tazón grande. Cubra con trozos de higo o melocotón blanco, trozos de jamón, virutas de queso parmesano, trozos de queso gorgonzola y rodajas de tomate.", "Espolvoree las alcaparras, las hojas de albahaca y los piñones. Rocíe con aceite de oliva y vinagre balsámico antes de tirar bien y servir."], "url": "www_bbc_co_uk_food_recipes_bologna_sum_up_salad_16484", "title": "Bolonia suma ensalada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Tocino de 200g / 7oz, picado", "1kg / 2lb 2 oz de carne picada", "3 cucharadas de aceite de oliva", "25g / 1oz de mantequilla", "1 cebolla, más o menos picada", "2 zanahorias, peladas, finamente picadas", "2 palitos de apio, finamente picados", "150ml / 5fl de leche en oz", "4 cucharadas de puré de tomate", "175ml / 6fl oz de vino tinto", "750ml / 1pint 7fl oz de caldo de carne", "sal y pimienta negra recién molida", "Tagliatelle de 500 g / 1 lb 2 oz, cocido de acuerdo con las instrucciones del paquete, escurrido", "150 g / 5 oz de parmesano, recién rallado"], "method": ["Caliente una cazuela grande no reactiva hasta que esté caliente, agregue la panceta y fría por 3-4 minutos, o hasta que la panceta se ablande y la grasa comience a derretirse. Agregue la carne picada en pequeños lotes y fría a fuego alto hasta que se dore. Retire cada lote de carne picada de la sartén con una espumadera, déjelo a un lado y manténgalo caliente mientras fríe los lotes restantes.", "Agregue el aceite de oliva y la mantequilla a la sartén en la que cocinó la carne, luego agregue la cebolla y fríela suavemente durante 1-2 minutos, o hasta que se ablanden. Agregue las zanahorias y el apio a la sartén y cocine por un minuto más.", "Agregue la carne picada dorada, luego agregue la leche y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 5 minutos.", "Agregue el puré de tomate y cocine por un minuto más. Agregue el vino tinto y cocine a fuego lento hasta que el volumen del líquido se haya reducido en un cuarto.", "Agregue el caldo de carne y devuelva el ragu a ebullición. Sazonar, al gusto, con sal y pimienta negra recién molida. Reduzca el fuego y cocine a fuego lento durante 1½-2 horas, o hasta que el ragù se haya espesado y la carne esté tierna.", "Mezcle los tallarines con un poco del ragù.", "Para servir, apile los tallarines en cada uno de los cuatro platos y luego cubra cada porción con otra generosa cucharada de ragú. Espolvoree con parmesano recién rallado."], "url": "www_bbc_co_uk_food_recipes_bologneseraguwithtag_93392", "title": "Ragú boloñés con tagliatelle", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 9 oz harina 00", "3-4 huevos medianos de granja (preferiblemente con yemas amarillas brillantes)", "Harina de sémola fina de 250 g / 9 oz", "4 cucharadas de aceite de oliva", "150g / 5½oz de panceta, cortada en cubitos", "Carne picada de 225g / 8oz", "225g / 8oz de carne picada de cerdo", "2 x 400 g de tomates picados", "4 dientes de ajo, picados", "2 cucharadas de albahaca fresca, desgarrada (opcional)", "sal marina y pimienta negra recién molida", "Queso parmesano 100 g / 3½ oz, rallado"], "method": ["Para la pasta, coloque la harina y los huevos en un procesador de alimentos y pulse hasta que estén bien combinados y la mezcla se una como masa. Coloque la masa en un recipiente, cúbrala con una película adhesiva y colóquela en la nevera para que repose durante 30 minutos.", "Corta la masa de pasta por la mitad y pásala por una máquina de pasta en su posición más ancha. Repita este proceso, disminuyendo la configuración del rodillo grado por grado con cada pasada hasta que la masa sea lo suficientemente delgada como para pasar a través de su cortador de tallarines. Agregue su cortador a la máquina de pasta y pase la pasta a través de la máquina para hacer su forma. Polvore la pasta con un poco de sémola.", "Repita el proceso con la masa restante, luego coloque las formas en un plato y utilícelas inmediatamente o refrigere durante la noche.", "Para los boloñeses, caliente una sartén grande y agregue el aceite. Una vez caliente, agregue la panceta y cocine hasta que esté dorado y crujiente. Agregue los dos tipos de carne picada y cocine hasta que se doren por completo, esto tomará de 6 a 8 minutos.", "Agregue los tomates y el ajo enlatados y cocínelos durante 25-40 minutos, o hasta que tenga una salsa espesa y reducida. Sazonar con sal y pimienta y agregar la albahaca. Mantenga caliente hasta que esté listo para servir.", "Para la pasta, cocine la pasta en una olla grande de agua hirviendo con sal hasta que esté al dente (alrededor de 3-4 minutos). Escurrir, reservar un poco de agua de pasta, y agregar el boloñesa. Mezcle con un poco de agua de pasta.", "Para servir, coloque un poco de pasta y boloñesa en tazones para servir. Adorne con queso parmesano recién rallado."], "url": "www_bbc_co_uk_food_recipes_bolognese_with_21188", "title": "Boloñesa con tallarines", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]