[{"ingredients": ["1 taza grande de harina normal", "pizca de sal", "½ taza de agua", "½ taza de leche", "1 taza de huevos de gallinas camperas", "1 cucharada de vinagre de malta", "Goteo de carne de res de 125 g / 4 oz (puede sustituirlo con aceite vegetal)", "6 simplemente salchichas de primera calidad cocidas", "1 cucharada de aceite vegetal", "2 cebollas en rodajas", "1 cucharada de azúcar", "1 cucharada de puré de tomate", "1 cucharada de salsa de soja o salsa de soja", "1 cucharada de salsa Worcestershire", "150ml / 5fl oz cerveza oscura o cerveza", "250ml / 9fl oz de caldo de carne", "50g / 2oz de mantequilla fría, cortada en cubos"], "method": ["Tamiza la harina y la sal en un tazón.", "Combina el agua y la leche en una jarra.", "Agregue los huevos y la mitad de la mezcla de leche y agua a la harina y bata hasta que quede suave.", "Agregue el resto de la mezcla de leche y agua y el vinagre y bata para combinar. Deje reposar durante 30 minutos.", "Precalentar el horno a 200C / 440F / Gas 6.", "Coloque una cucharada de goteo (o aceite vegetal) en cada uno de los seis agujeros de una lata de muffins. Coloque la lata en el horno para calentar el goteo a fumar caliente.", "Con cuidado vierta un sexto de la mezcla en cada hoyo con goteo o aceite, luego agregue una salchicha a cada uno.", "Regrese al horno para cocinar por 25 minutos. ¡No abra la puerta del horno durante este tiempo!", "Para la salsa, caliente el aceite en una sartén y fría las cebollas hasta que estén suaves.", "Agregue el puré de azúcar y tomate y cocine durante cinco minutos.", "Agregue la salsa para dorar o la salsa de soja, salsa Worcestershire, cerveza y caldo. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 25 minutos.", "Retire del fuego y agregue la mantequilla un poco a la vez, batiendo para combinar para hacer una salsa brillante.", "Retire el sapo en los agujeros del horno y coloque cada uno en un plato. Vierta una generosa cantidad de salsa y sirva."], "url": "www_bbc_co_uk_food_recipes_individualtoadintheh_88684", "title": "Sapo individual en los agujeros", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Rinde 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de 200g / 7oz para aumentar la producción, más extra para quitar el polvo", "100 g / 3½ oz de sebo vegetal", "pizca de sal", "1 cucharada de perejil fresco finamente picado", "120ml / 4fl oz de agua", "2 cucharadas de aceite de oliva", "4 chalotes grandes, pelados, más o menos picados", "2 dientes de ajo, pelados, picados", "2-3 ramitas de tomillo fresco, solo hojas, picadas", "2 cucharadas de ketchup de champiñones", "150ml / 5fl oz Irish stout", "200ml / 7fl oz de caldo de verduras", "500g / 1lb 2 oz de champiñones mezclados (como castaña, Portobello, rebozuelo y girolle), cepillado limpio, picado", "sal y pimienta negra recién molida", "calabacines al vapor y zanahorias, para servir"], "method": ["Para la pasta de sebo, en un tazón grande, mezcle la harina, el sebo, la sal y el perejil picado.", "Poco a poco agregue el agua en una corriente delgada, revolviendo continuamente con un tenedor, hasta que la mezcla se una como una masa. (Nota: es posible que no necesite usar toda el agua).", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar ligeramente durante 1-2 minutos. Envuelva la masa en una película adhesiva y enfríe en la nevera durante 15-20 minutos.", "Mientras tanto, para el relleno, caliente el aceite en una sartén a fuego medio. Agregue los chalotes y el ajo picado y fría por 8-10 minutos, o hasta que estén blandos.", "Agregue las hojas de tomillo, el ketchup de champiñones y la cerveza negra irlandesa. Continúe cocinando por 2-3 minutos, revolviendo bien.", "Agregue el caldo y los champiñones y lleve la mezcla a fuego lento. Continúe cocinando a fuego lento durante 10-12 minutos, o hasta que el volumen del líquido se haya reducido ligeramente y la mezcla de relleno se haya espesado. Sazonar, al gusto, con sal y pimienta negra recién molida. Dejar enfriar un poco.", "Una vez que la masa se haya enfriado, divídala en cuatro pedazos iguales", "Pellizque un cuarto de la primera porción de pastel y déjelo a un lado para usarlo como la tapa del pudín. Extienda la porción de repostería restante en una superficie de trabajo ligeramente enharinada hasta que forme un círculo lo suficientemente grande como para alinear uno de los recipientes de budín.", "Levante cuidadosamente la masa con un rodillo y alinee el recipiente para pudin con ella. Permita que cualquier exceso de bollos cuelgue sobre los lados del lavabo.", "Vierta una cuarta parte de la mezcla de relleno en el recipiente de budín.", "Extienda la tapa de repostería reservada sobre una superficie de trabajo ligeramente enharinada hasta que tenga un diámetro ligeramente mayor que el recipiente para pudin.", "Cepille el borde del recipiente del budín con agua. Cubra el pudín con la tapa de pastelería y presione los bordes de la masa para sellar. Corte cualquier exceso de masa, luego cubra la tapa expuesta del pudin con una hoja doble de papel de aluminio, plisada en el medio para permitir espacio para la expansión a medida que el pudín se cocina.", "Repite el proceso con las tres porciones restantes de masa, el relleno restante y las cuencas de budín restantes.", "Prepare un recipiente para cocer al vapor, luego caliente los postres en la sartén durante 40-45 minutos o hasta que estén cocidos.", "Cuando los postres estén cocidos, retírelos con cuidado de la olla de cocción al vapor con guantes de cocina. Dejar de lado.", "Cuando las bandejas del pudín estén lo suficientemente frías para manipular, desenvuelva la parte superior de los postres. Retire la lámina de cada cuenco de pudín. Invierta un budín en cada uno de los cuatro platos para servir.", "Sirva inmediatamente con calabacines al vapor y zanahorias."], "url": "www_bbc_co_uk_food_recipes_individualvegetarian_92054", "title": "Champiñones y pudines de vegetales fuertes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Muslos de pollo de 700 g / 1 lb y 9 onzas, desollados, deshuesados ​​y cortados en 3-4 piezas cada uno", "aceite para freír", "3 dientes de ajo, pelados y picados", "4 cucharadas de harina de maíz", "1 cucharada de salsa de soja ligera", "1 cucharada de salsa de soja oscura", "1 cucharada de vinagre de arroz", "pellizcar el comino molido", "pizca de chile en polvo", "pizca de cilantro molido", "½ cubo de caldo de pollo, aplastado hasta formar un polvo", "½ cucharadita de sal", "3 cucharadas de aceite vegetal", "2 chiles rojos secos, partidos en pedazos", "1 cucharadita de semillas de comino entero", "3 dientes de ajo, finamente picados", "2 cebollas rojas, finamente picadas", "½ pimiento rojo o verde, cortado en dados en piezas de 2.5cm / 1in", "1 cucharadita de sal", "1½ cucharadita de azúcar", "1 cucharadita de chile rojo en polvo", "1 cucharadita de comino molido", "2 cucharaditas de salsa de soja oscura", "1 cucharada de harina de maíz, mezclada en una pasta con un poco de agua", "½ limón, solo jugo", "2 cucharadas de ajo silvestre picado (cuando está en temporada) o cebollas de primavera", "berro de bebé, rúcula o ensalada de hoja joven similar, para adornar"], "method": ["Mezcle todos los ingredientes para el adobo, luego frótelos sobre los muslos de pollo, cúbralos y déjelos a un lado en el refrigerador para marinar durante 30 minutos.", "Caliente aceite suficiente para freír en una freidora de grasa profunda o en una cacerola profunda de base pesada a 190 ° C / 375 ° F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Agregue las piezas de pollo y fría durante aproximadamente cinco minutos, o hasta que estén crujientes, doradas y recién cocidas. Escurrir en un plato forrado con papel de cocina y reservar.", "Para sofreír, caliente el aceite en una sartén hasta que alcance el punto de ahumado. Agregue los chiles rojos secos y muévalos rápidamente. A medida que se oscurecen, agregue el comino y el ajo y revuelva rápidamente.", "Tan pronto como el ajo comience a cambiar de color, agregue las cebollas y el pimiento rojo o verde y saltee por unos dos minutos hasta que se ablanden. A continuación, agregue el pollo frito, la sal, el azúcar, el chile rojo en polvo y el comino y continúe revolviendo a fuego alto durante 1-2 minutos. Finalmente, agregue la salsa de soja y mezcle bien.", "Cuando todas las verduras estén blandas y las especias bien combinadas, agregue la pasta de aciano y revuelva rápidamente para mezclar uniformemente. Esto le da al plato un glaseado atractivo y también espesa la salsa. Exprima el jugo de limón, agregue el ajo silvestre picado o las cebolletas y revuelva para mezclar.", "Servir inmediatamente con arroz al vapor o fideos si se sirve como plato principal, o con una ensalada simple de berros como entrante. Como alternativa, sirva en pinchos como comida de fiesta o para acompañar cócteles."], "url": "www_bbc_co_uk_food_recipes_indo-chinese_stir-fried_62572", "title": "Pollo salteado indochino con chiles secos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "Tiras de cerdo de 750 g / 1½ libras o filetes de carne de cerdo, picados en cuadrados de 2 cm / 1 in", "1 cebolla, pelada y cortada finamente", "1 diente de ajo, pelado y aplastado", "Jengibre de raíz de 2.5cm / 1in, pelado y finamente rallado", "1 cucharadita de semillas de hinojo", "1 palo de limoncillo fresco, cortado en rodajas finas", "6 cucharadas de pasta de curry tailandesa roja o verde", "300ml / ½ pinta de crema de coco", "Calabaza de 350g / 12oz, pelada y cortada en cubos de 2.5cm / 1in", "1 cucharada de cilantro fresco, rallado grueso", "1 cucharada de albahaca fresca, rallada en trozos gruesos", "Hojas de espinaca fresca de 300 g / 10 oz, recogidas y lavadas", "1 cucharada de jugo de lima", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en el wok o en la sartén pesada hasta que fume.", "Cocine el cerdo en tandas hasta que se dore por todas partes y dorado, retire, mantenga caliente.", "Agregue la cebolla y el ajo y cocine a fuego lento hasta que se ablanden.", "Agregue la calabaza, el jengibre, las semillas de hinojo y el limoncillo y cocine durante 5 minutos a fuego lento.", "Agregue la pasta de curry tailandés y cocine hasta que esté fragante.", "Regrese la carne de cerdo a la sartén con la leche de coco, lleve a ebullición, cocine a fuego lento durante 10-12 minutos.", "Finalmente mezcle las espinacas, las hierbas y sazone al gusto, mezcle el jugo de lima y sirva con arroz esponjoso al vapor o hervido."], "url": "www_bbc_co_uk_food_recipes_indonesianporkcurry_412", "title": "Curry de cerdo indonesio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Sal de mar copos 150g / 5½oz", "1 hoja de laurel", "5 granos de pimienta blanca", "3 bayas de enebro", "Lomo de bacalao negro de 500g / 1lb 2oz o lomo de bacalao de buena calidad", "50g / 1¾oz de aceitunas negras recién picadas", "500g / 1lb 2oz pequeñas patatas nuevas", "1 chile rojo, sin semillas, cortado en tiras finas", "aproximadamente 100ml / 3½fl oz de agua helada", "Cebollas de primavera 80g / 3oz, recortadas", "70ml / 2½fl oz de aceite de oliva virgen extra, más extra para freír", "1 ramita de tomillo fresco", "1 cucharada de jugo de limón", "1 cucharada de vinagre de vino blanco", "1 cucharada de miel líquida", "pimienta negra recién molida", "½ granada, semillas retiradas", "puñado de acianos comestibles", "pizca de pimentón ahumado"], "method": ["Ponga la sal, la bahía, los granos de pimienta y las bayas de enebro en una cazuela grande. Agregue 1 litro / 1¾ pintas de agua y deje que hierva. Tan pronto como comience a hervir, quítelo del fuego y deje que se enfríe por completo. Cuando el agua esté fría, sumerja el bacalao, cúbralo y déjelo marinar a temperatura ambiente durante 4 horas.", "Precalentar el horno a 200C / 180C Fan / Gas 6.", "Coloque las aceitunas en una bandeja pequeña para hornear y ponga las papas en una lata para asar. Hornee las aceitunas durante 20 minutos, luego déjelos enfriar. Hornee las papas durante 30 minutos, o hasta que estén suaves, luego déjelos enfriar. Pele y triture las papas en trozos del tamaño de una almendra a mano.", "Ponga la guindilla en agua helada durante 10 minutos.", "Cortar la parte blanca de las cebolletas y reservar, luego cortar los tallos verdes en tiras muy finas y agregarlos al agua helada.", "Cuando esté listo para cocinar el bacalao, precaliente el horno a 200C / 180C Ventilador / Gas 6. Escurra bien el bacalao y séquelo en papel de cocina.", "Caliente una sartén grande con unas gotas de aceite y el tomillo a fuego alto. Agregue el bacalao y fríalos durante 1 minuto en cada lado, o hasta que estén dorados.", "Transfiera el bacalao a un trozo de papel para hornear, doble el papel por la parte superior y termine de cocinar en el horno durante 6 minutos. Deje que se enfríe un poco, luego desmenuce la carne.", "Para hacer el aderezo, bata el jugo de limón, el aceite, el vinagre y la miel en un tazón, hasta que quede cremoso. Condimentar con sal y pimienta.", "Coloque los copos de bacalao en un plato para servir, luego esparza sobre las papas, las aceitunas y las rodajas de cebolla blanca.", "Verter sobre el aderezo y decorar con los rizos de chile drenados y tiras de cebolla verde, semillas de granada, flores comestibles y pimentón ahumado."], "url": "www_bbc_co_uk_food_recipes_insalata_di_baccal_salt_37547", "title": "Ensalada de bacalao", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5 litros / 2½ pintas de vinagre de vino blanco", "50g / 1¾oz de sal", "50g / 1¾oz de azúcar", "6 dientes", "10 hojas de laurel", "200g / 7oz cebollas en vinagre", "2 zanahorias, cortadas en pequeñas rondas", "1 coliflor pequeña, cortada en florecillas", "1 pimiento amarillo, cortado en tiras", "1 pimiento rojo, cortado en tiras", "30g / 1oz de alcaparras saladas grandes, empapadas 30 por minutos en agua, escurridas", "Anchoas de 100 g / 3½ oz", "100g / 3½oz de aceitunas negras", "4 cucharadas de aceite de oliva", "1 chile rojo, finamente picado", "12 rebanadas de salami", "12 rebanadas de jamón"], "method": ["Para la insalata di rinforzo, ponga el vinagre, 1 litro / 1¾ pintas de agua, la sal y el azúcar en una sartén con los dientes de ajo y las hojas de laurel y deje que hierva. Agregue las cebollas y las zanahorias y cocine durante 10 minutos, luego agregue la coliflor y los pimientos y cocine por otros 20 minutos. Drenado y genial.", "Para ensamblar, combine las alcaparras, las anchoas y las aceitunas en un tazón. Rocíe el aceite de oliva y agregue el chile picado. Mezclar bien todos los ingredientes.", "Agregue un poco del pepinillo a la ensalada y combine.", "Para servir, coloque el salami rebanado y el jamón en un plato junto con la ensalada. Cualquier pepinillo restante se puede reservar en una nevera en el tarro o se puede comer al lado."], "url": "www_bbc_co_uk_food_recipes_insalata_di_rinforzo_16631", "title": "Ensalada reforzada", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "100g / 3½oz de azúcar glas, tamizado, más extra para quitar el polvo", "2 cucharadas de esencia de café", "500g / 1lb 2oz mascarpone", "Crema doble 175ml / 6fl oz", "1 vaina de vainilla, dividida longitudinalmente, semillas raspadas con un cuchillo afilado", "2 estuches de flan de esponja grande (aproximadamente 250 g / 9 oz cada uno, o 25 cm / 10 pulgadas de ancho)", "175ml / 6fl oz de café frío", "2 cucharadas de cacao en polvo", "10 pequeñas conchas de merengue preparadas, aplastadas", "4 malvaviscos blancos, cortados en cuartos", "50 g / 2 oz de chocolate negro, finamente rallado"], "method": ["Batir las claras de huevo en un tazón grande hasta que se formen picos suaves cuando se quite el batidor.", "Incline el azúcar impalpable y el azúcar glas y continúe batiendo durante 4-5 minutos más, o hasta que se formen picos duros y brillantes cuando se quite la batidora.", "Agregue la esencia del café, luego deje la mezcla a un lado.", "En otro recipiente, bata las semillas de mascarpone, crema doble y vainilla hasta que estén suaves y bien combinadas.", "Usando el anillo de la lata de tarta, elimine los centros de las cajas de flan. Corte cada disco de esponja por la mitad horizontalmente para formar dos discos más delgados (cuatro en total).", "Coloque el anillo de la lata de tarta con fondo suelto en un plato de servir, luego coloque un disco de esponja encima. Cepille más de una cuarta parte del expreso frío, luego extienda un tercio de la mezcla de crema de mascarpone.", "Repita el proceso de estratificación con los discos de esponja restantes, el expreso frío y la mezcla de mascarpone, completando el pastel con el disco de esponja final.", "Coloque la mezcla de clara de huevo en la torta y extienda por toda la parte superior y los lados en una capa uniforme con una espátula.", "Usando una soplete de cocineros, caliente el merengue hasta que quede crujiente y dorado claro.", "Para servir, espolvorea la parte superior del gâteau con cacao en polvo. Espolvoree los malvaviscos y las cáscaras de merengue trituradas, luego decore con chocolate negro rallado. Polvo con azúcar glas antes de servir."], "url": "www_bbc_co_uk_food_recipes_instant_coffee_meringue_53900", "title": "Torta de merengue de café instantáneo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "3 cucharadas de azúcar en polvo", "4 cucharadas de crema preparada", "4 claras de huevo de gallinas camperas", "1 cucharadita de licor de banana", "4 plátanos pequeños, pelados y cortados en ángulo", "50g / 1¾oz de mantequilla", "75 g / 2½ oz de azúcar en polvo", "150ml / 5fl oz de crema doble", "1 ramita de menta, solo hojas"], "method": ["Para el suflé de plátano, precaliente el horno a 200C / 400F / Gas 6 y engrase cuatro moldes usando la mitad de la mantequilla y una cucharada de azúcar en polvo.", "En un tazón grande, mezcle el azúcar restante con la crema pastelera.", "En un tazón grande limpio, bata las claras de huevo hasta que se formen picos rígidos cuando se quite el batidor.", "Con cuidado doblar las claras de huevo en la mezcla de crema, agregue el licor de plátano y la cuchara en los moldes preparados. Ponga una bandeja para hornear y colóquela en el horno durante 6-8 minutos.", "Para los plátanos caramelizados, caliente una sartén hasta que esté caliente. Agregue los plátanos, con el lado del corte hacia abajo, y fría por 1-2 minutos, o hasta que estén caramelizados. Retire de la sartén y reserve.", "Agregue la mantequilla a la sartén y caliente hasta que haga espuma, luego agregue el azúcar y cocine hasta que la mezcla tenga un color caramelo.", "Agregue la crema, hierva, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cocine a fuego lento durante 2-3 minutos, o hasta que estén doradas. Regresa los plátanos a la sartén y caliéntalos.", "Para servir, coloque los suflés en platos para servir y coloque los plátanos caramelizados junto a ellos. Adorne con hojas de menta."], "url": "www_bbc_co_uk_food_recipes_instant_souffl_with_94231", "title": "Soufflé instantáneo con plátano caramelizado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de azúcar moreno (azúcar de caña) o azúcar de palma (ambos disponibles en comestibles asiáticos) o azúcar moreno claro", "175ml / 6fl oz de vinagre de sidra", "120ml / 4fl oz de aceite de oliva extra virgen (puede usar aceite de maní o aceite vegetal)", "1-2 dientes de ajo, pelados y triturados", "1 cucharadita de jengibre fresco finamente rallado", "Florecillas pequeñas de coliflor de 400g / 14oz", "5 zanahorias medianas, peladas y cortadas en trozos de 5cm / 2½ pulgadas", "Nabos para bebé de 225 g / 9 oz, pelados y partidos por la mitad", "2 cucharaditas de semillas de mostaza marrones enteras, molidas en un molinillo de café limpio", "2 cucharaditas de sal", "una mezcla de 1 cucharadita de chile en polvo y 1½ cucharadita de pimentón rojo brillante", "½ cucharadita de sal masala"], "method": ["Combine el azúcar y el vinagre en una sartén pequeña a fuego lento, revolviendo de vez en cuando. Caliente hasta que el azúcar se haya disuelto, luego apague el fuego.", "Vierta el aceite en una sartén grande a fuego medio. Cuando el aceite esté caliente, agregue el ajo y el jengibre y revuelva durante 30 segundos.", "Agregue la coliflor, las zanahorias y los nabos a la sartén. Revuelva y cocine durante aproximadamente un minuto o hasta que las verduras estén cubiertas con aceite y aún crujientes.", "Reduzca el fuego a bajo y agregue la mezcla de mostaza molida, sal, chile en polvo y pimentón y garam masala. Revuelva y mezcle por un minuto o dos hasta que los vegetales estén cubiertos con las especias.", "Vierta la mezcla de azúcar y vinagre de palma y revuelva. Quite el fuego y deje enfriar el pepinillo.", "Con una cuchara, la salmuera terminada en uno o dos frascos limpios, con sus jugos, luego refrigérela. El pepinillo se puede comer inmediatamente, pero se mantendrá en la nevera durante 3-4 semanas."], "url": "www_bbc_co_uk_food_recipes_instantpunjabistylep_90220", "title": "Salmuera instantánea estilo punjabi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "1 litro / 2 pintas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/instantpunjabistylep_90220_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80g / 3oz% 20dark% 20chocolate% 20 (80 %% 20cocoa% 20solids),% 20cut% 20into% 20small% 20pieces% 20", "120ml / 4fl oz de crema doble", "2 gotas de extracto de vainilla"], "method": ["Divida el chocolate y la crema entre cuatro moldes. Microondas a fuego medio durante 20 segundos. Revuelva la mezcla con un tenedor hasta que se combinen. Si aún quedan trozos de chocolate después de remover, calienta en el microondas durante otros 5-10 segundos.", "Agregue la vainilla, cubra con una película adhesiva y colóquela en la nevera durante 1 hora o hasta que se endurezca."], "url": "www_bbc_co_uk_food_recipes_intense_chocolate_pots_39697", "title": "Intensas macetas de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/intense_chocolate_pots_39697_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 plátanos muy maduros, pelados, cortados en trozos", "¼ cucharadita de esencia de vainilla", "3-4 cucharadas de azúcar, miel o edulcorante, al gusto", "Suero de leche 150ml / 5fl oz o yogur griego de 150g / 5½oz"], "method": ["Extienda los trozos de plátano en una bandeja y transfiéralos al congelador. Deje la banana en el congelador hasta que se congele completamente (aproximadamente una hora).", "Coloque los trozos de plátano congelados en un procesador de alimentos. Agregue la vainilla, el azúcar, la miel o el edulcorante y la mitad del suero (o yogur). Encienda el procesador y mezcle por unos momentos. Luego, mientras el procesador aún está en funcionamiento, vierta el suero de leche restante en un chorro delgado y constante (si está usando yogur, simplemente apúntelo todo y mezcle).", "Mezcle hasta que la mezcla esté suave y cremosa. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_instantbananaicecrea_86115", "title": "Helado de plátano instantáneo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/instantbananaicecrea_86115_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125 g / 4 oz de chocolate negro", "150g / 5¼ oz de harina común", "30g / 1oz de cacao, tamizado", "1 cucharadita de bicarbonato de soda", "½ cucharadita de sal", "125g / 4oz de mantequilla sin sal ablandada", "75g / 2½oz de azúcar moreno claro", "50 g / 2 oz de azúcar en polvo", "1 cucharadita de extracto de vainilla", "1 huevo de gallinas camperas, frío de la nevera", "350g / 12¼ oz de trocitos de chocolate negro"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Rompe el chocolate negro de 125g / 4oz en pedazos y colócalo en un tazón resistente al calor colocado sobre una sartén con agua apenas hirviendo. Caliente, revolviendo de vez en cuando, hasta que se derrita.", "Coloque la harina, el cacao, el bicarbonato de soda y la sal en un tazón grande y mezcle bien.", "En otro tazón, bata la mantequilla y dos azúcares hasta que estén suaves y esponjosos. Agregue el chocolate derretido y revuelva bien.", "Batir el extracto de vainilla y romper en el huevo, luego mezclar los ingredientes secos. Finalmente agregue las chispas de chocolate.", "Saque 12 porciones iguales de la mezcla (una pala de helado y una espátula son las mejores herramientas para el trabajo) y colóquelas en una bandeja para hornear forrada a unos 6cm / 2½ pulgadas. No los aplaste.", "Transfiera al horno y hornee por 18 minutos, luego pruebe con un pincho - debe salir semilimpiado y no mojado con la mezcla. Si perforas una viruta de chocolate, inténtalo de nuevo.", "Deje que las galletas se enfríen en la bandeja para hornear durante 4-5 minutos, luego transfiéralas a una rejilla de enfriamiento para que se endurezcan a medida que se enfrían."], "url": "www_bbc_co_uk_food_recipes_intensechocolatecook_87336", "title": "Intensas galletas de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/intensechocolatecook_87336_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharadita de comino", "1 cucharadita de canela", "1 cucharadita de jengibre molido", "1 cucharadita de nuez moscada molida", "1 cucharadita de cúrcuma", "3 berenjenas medianas", "1 cebolla mediana, pelada y finamente picada", "1 cucharada de aceite de oliva", "4 dientes de ajo, picados", "1 chile rojo, finamente cortado", "1 pimiento verde, cortado en cubitos finamente", "60 ml / 2 fl oz zumo de naranja", "Garbanzos 100 g / 3½ oz, peso cocido", "Anacardos asados ​​150g / 5oz", "100 g / 3½ oz de albaricoques secos", "Fechas de 100g / 3½oz, picadas", "2 tomates, cortados en cubitos", "1 cucharada de jugo de limón", "2 cucharadas de cilantro fresco, picado", "sal y mucha pimienta negra recién molida", "1 cucharada de margarina de girasol", "1 cebolla pequeña, pelada y picada", "2 dientes de ajo, pelados y picados", "Jengibre de 2 cm, pelado y finamente picado", "1 cucharadita de cúrcuma", "1 cucharadita de Cayena", "1 lata / 400ml de leche de coco", "750ml de agua", "1 ramita de canela", "100 g / 3½ oz de almendras molidas", "ralladura y jugo de 1 lima", "sal"], "method": ["precalentar el horno a 220C / 425F / Gas7.", "Cortar las berenjenas por la mitad a lo largo, colocar en una bandeja de asar cortada en el lado superior y cubrir con papel de plata", "Asar en el horno precalentado hasta que esté suave y cocido (aproximadamente 30 minutos). Deje que las berenjenas se enfríen, luego retire los medios dejando suficiente carne como apoyo. Picar groseramente las entrañas y dejar de lado.", "Rehidratar los albaricoques en agua hirviendo durante 30 minutos, luego picar finamente.", "Freír la cebolla en el aceite de oliva hasta que quede transparente. Agregue el ajo y el chile y saltee por un par de minutos.", "Agregue la mezcla de especias y saltee hasta que esté fragante. Agregue el pimiento verde y el jugo de naranja, mezcle bien. Freír hasta que el pimiento esté suave.", "Tueste o tueste los anacardos: tenga cuidado de que no se quemen.", "Mezcle los anacardos con los garbanzos cocidos, los albaricoques picados, las fechas picadas y los tomates cortados en cubitos.", "Agregue la mezcla de anacardo a la mezcla de especias de cebolla junto con las entrañas de berenjena picada, jugo de limón, cilantro, sal y mucha pimienta negra. Reserve algo de cilantro para la guarnición.", "Apila el relleno en las pieles de berenjena y hornea por 15 minutos.", "Para la salsa de coco y almendras: fría la cebolla con suavidad en la margarina hasta que esté suave, agregue el ajo y el jengibre y fría con cuidado. Asegúrate de que la cebolla y el ajo no se doren ya que esto arruinará el color de la salsa.", "Agregue las especias, revuelva en la mezcla de cebolla, luego agregue la leche de coco, agua y canela. Llevar a ebullición y cocine a fuego lento durante 15 minutos.", "Quítate el fuego y quita la ramita de canela", "Agregue las almendras molidas, la ralladura de lima, el jugo y una pizca de sal.", "Mezcle la salsa en un licuador. Verifica el condimento.", "Sirva la berenjena, adornada con cilantro fresco con la salsa de coco y almendras y una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_iranianstuffedauberg_2405", "title": "Berenjenas rellenas iraníes con salsa de coco y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["harina, para quitar el polvo", "sal y pimienta negra recién molida", "2 huevos, golpeados", "Leche", "Pollo de 1.4kg / 3lb, articulado", "Aceite para freír", "harina", "sal y pimienta negra recién molida"], "method": ["Sazone la harina con sal y pimienta negra recién molida y combine los huevos con leche.", "Espolvorea los trozos de pollo con harina y sumérgelos en la colada de huevo.", "En una sartén grande, calienta el aceite y fríe el pollo con cuidado para comenzar, elevando la temperatura hasta que esté tan dorado y cocinado después de 10-15 minutos. Sacar de la sartén y mantenga caliente.", "Para la salsa, agregue un poco de harina al aceite en la sartén y dore lentamente.", "Agregue agua fría, revolviendo hasta que la salsa tenga el espesor requerido, más sal y pimienta negra recién molida.", "Cocine a fuego lento durante unos minutos y luego vierta sobre el pollo."], "url": "www_bbc_co_uk_food_recipes_irenecleavessouthern_70533", "title": "Pollo frito del sur de Irene Cleaves", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz crema batida", "125g / 4½oz de leche condensada endulzada", "2 cucharadas de licor de crema irlandesa", "pellizcar canela molida"], "method": ["Vierta la crema en un tazón grande y bata hasta formar picos fuertes.", "Introduzca con cuidado la leche condensada, el licor de crema irlandés y la canela.", "Transfiera a un recipiente con tapa y congele durante 4-6 horas, o hasta que se solidifique."], "url": "www_bbc_co_uk_food_recipes_irish_cream_ice_cream_63791", "title": "Helado crema irlandés", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_cream_ice_cream_63791_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200g / 7oz de harina integral", "275g / 9¾oz de harina blanca fuerte, más extra para rociar", "1 cucharadita de bicarbonato de soda", "pizca de sal", "200ml / 7fl oz de suero de leche", "1 huevo grande de gallinas camperas", "1 cucharadita de miel", "1 patata grande", "Filetes de abadejo ahumado sin teñir 250g / 9oz, piel sobre", "1 hoja de laurel", "1 chalote, reducido a la mitad", "650ml / 22fl oz de leche entera", "30g / 1oz de mantequilla sin sal", "1 cebolla picada", "1 diente de ajo, en rodajas", "150g / 5½oz granos de maíz dulce (descongelados, si están congelados)", "puñado de frijoles, en rodajas", "6 vieiras, en rodajas", "12 almejas al vapor", "Filete de abadejo de 200g / 7oz, cortado en cubitos", "150g / 5½oz de gambas crudas", "1 cucharada de perejil picado fresco de hoja plana", "pimienta negra recién molida"], "method": ["Precalienta el horno a 190 ° C / 375 ° F / Gas 5. Engrasa y enharina una lata de hogaza de 900 g / 2lb.", "Combina las harinas, el bicarbonato de sodio y la sal en un tazón.", "En una jarra medidora, combine el suero de leche con el huevo y la miel.", "Haga un pozo en el centro de los ingredientes secos y luego vierta la mezcla húmeda. Agregue un poco de harina adicional si encuentra que la masa está demasiado húmeda y pegajosa.", "Usando una cuchara de madera, junte la mezcla para formar una masa. Forme un óvalo rugoso y colóquelo en la lata de pan.", "Espolvoree un poco de harina en la parte superior y hornee en el horno durante 35-40 minutos. Dé vuelta al pan sobre una rejilla para que se enfríe antes de cortarlo.", "Para la sopa de pescado, coloque la papa en una cacerola, cubra con agua, deje hervir y cocine a fuego lento durante 15-20 minutos hasta que esté tierna. Corte la papa cocida en trozos pequeños y déjela a un lado.", "Coloque el eglefino ahumado, con la piel hacia arriba, en una sartén con la hoja de laurel y el chalote y cubra con la leche. Deje que hierva a fuego lento durante unos minutos, luego quite el fuego y déjelo en la leche para terminar de cocinar.", "En una sartén grande, fríe con cuidado las cebollas en la mantequilla hasta que se ablanden. Agregue el ajo en rodajas, la papa cocida y el maíz dulce, luego agregue un puñado de los frijoles en rodajas.", "Levante el eglefino de la leche con una espumadera y colóquelo en un plato. Despega la piel y rompe en pedazos. Cuele la leche a través de un colador en la mezcla de la patata de cebolla y cocine a fuego lento durante unos 20 minutos.", "Agregue el eglefino cocido, las vieiras en rodajas, las almejas al vapor, el colín y las gambas y caliente, luego agregue el perejil y sazone con mucha pimienta negra.", "Para servir, ponga la sopa de pescado en tazones y sirva con rebanadas gruesas de pan de soda."], "url": "www_bbc_co_uk_food_recipes_irish_fish_chowder_with_08587", "title": "Sopa de pescado irlandesa con pan de soda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_fish_chowder_with_08587_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de leche entera", "1½ cucharada de harina común", "Queso cheddar irlandés de 400 g / 14 oz, rallado", "160g / 6oz de pan rallado", "1 cucharadita de mostaza inglesa en polvo", "120ml / 4fl oz de grasa", "2 huevos de gallinas camperas, solo yemas", "4 cebolletas, finamente picadas", "6 rebanadas de pan de soda tostado"], "method": ["Caliente la leche en una cacerola y mezcle con la harina. Sigue revolviendo y lleva a ebullición. Reduzca el fuego a fuego lento. La leche debe espesar un poco.", "Agregue el queso y revuelva a fuego lento hasta que se derrita. Agregue las migas de pan, mostaza y cerveza. Continúe revolviendo hasta que la mezcla se una, debe dejar los lados de la sartén.", "Retire del fuego y la punta en un recipiente, deje que se enfríe un poco. Una vez enfriado, agregue las yemas de huevo y bata vigorosamente con una cuchara de madera hasta que el huevo se mezcle completamente. Agregue las cebolletas picadas.", "Extienda la rarebit en pan de soda tostado y colóquela bajo una parrilla caliente hasta que burbujee y se dore."], "url": "www_bbc_co_uk_food_recipes_irish_rarebit_65884", "title": "Rareza irlandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irish_rarebit_65884_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["un buen glug de whisky irlandés", "1 cucharadita de azúcar moreno de caña", "1 cucharada colmada de crema batida", "café fuerte y caliente para llenar el vaso"], "method": ["Use vasos de café calientes y agregue el whisky.", "Agregue el azúcar y disuelva en el whisky.", "Agregue el café y revuelva bien.", "Flote la crema batida encima y sirva."], "url": "www_bbc_co_uk_food_recipes_irishcoffee_8924", "title": "café irlandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1½kg / 3lb 5oz de ternera guisada, cortada en cubos", "Tocino rayado de 175g / 6oz", "3 cucharadas de aceite de oliva", "12 cebollas baby, peladas", "18 champiñones, todo entero", "3 zanahorias, cortadas en cuartos o 12 zanahorias baby, restregadas y dejadas enteras", "sal y pimienta negra recién molida", "1 cucharada de tomillo picado", "2 cucharadas de perejil picado", "10 dientes de ajo, aplastados y rallados", "425ml / 15fl oz de vino tinto", "425ml / 15fl oz de pollo o caldo de carne", "50g / 2oz de mantequilla", "50g / 1¾oz de harina", "campeón, para servir"], "method": ["Dore la carne y el tocino en el aceite de oliva en una cacerola caliente o en una cacerola pesada.", "Retire la carne y mezcle las cebollas, los champiñones y las zanahorias, un ingrediente a la vez, condimentando cada vez.", "Coloque estos en la cazuela, junto con las hierbas y el ajo.", "Cubra con vino tinto y caldo y cocine a fuego lento durante una hora o hasta que la carne y las verduras estén cocidas.", "Para hacer el roux, en una sartén por separado derrita la mantequilla, agregue la harina y cocine por dos minutos.", "Cuando el guiso esté cocido, retire la carne y las verduras.", "Ponga a hervir el líquido restante y agregue una cucharada de roux.", "Batir la mezcla hasta que el roux se rompa y los jugos se hayan espesado, dejando hervir.", "Reemplace la carne y las verduras, y pruebe el condimento.", "Espolvorear con perejil picado y servir con Champ."], "url": "www_bbc_co_uk_food_recipes_irishbeefstew_73826", "title": "Guiso de ternera irlandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irishbeefstew_73826_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, ablandada", "½ pan de granja blanco pan, en rodajas", "60 g / 2¼ oz de sultanas", "3 yemas de huevo grandes de gallinas camperas", "2 huevos grandes de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "300ml / 10½ fl oz crema doble", "300m / 10½ fl oz de leche", "2 gotas de extracto de vainilla", "5 cucharadas de licor de crema irlandesa", "20g / ¾oz demerara azúcar", "crema doble, para servir"], "method": ["Precalentar el horno a 180 ° C / 360 ° F / Gas 4.", "Unte con mantequilla un plato a prueba de horno de 1½ litro / 2 pintas de 12¾ fl oz con la mitad de la mantequilla.", "Extienda las rebanadas de pan con la mantequilla restante en ambos lados. Cortar el pan en triángulos y superponer capas de pan con las sultaninas en el plato engrasado.", "Batir las yemas de huevo, los huevos enteros y el azúcar juntos en un tazón grande hasta que estén cremosos. Batir la crema, la leche, el extracto de vainilla y el licor de crema irlandés.", "Vierta la mezcla sobre el pan y presione hacia abajo las rebanadas de pan hasta que se sumerja. Deje reposar durante 20 minutos para permitir que el pan absorba el líquido.", "Coloque el plato en una bandeja de asar y agregue suficiente agua para llegar hasta la mitad del plato (esto se conoce como baño maría). Espolvorear con azúcar demerara y hornear durante 35-40 minutos hasta que estén doradas.", "Para servir, coloque una porción de pudín de pan y mantequilla en cada plato y vierta sobre la crema doble."], "url": "www_bbc_co_uk_food_recipes_irishcreambreadandbu_90971", "title": "Crema irlandesa de pan y mantequilla con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]