[{"isVegetarian": true, "title": "Wild mushroom risotto with truffle oil", "url": "www_bbc_co_uk_food_recipes_wildmushroomrisottow_90966", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large knob of butter", "1 onion, finely chopped", "1 garlic clove, finely sliced", "30g/1¼oz dried porcini mushrooms, soaked in a bowl of warm water for half an hour", "450g/1lb wild mushrooms, such as trompette, girolle and oyster mushrooms, roughly chopped", "300g/10½oz arborio rice", "splash of olive oil, if necessary", "250ml/8¾ fl oz dry white wine", "1.5 litres/2 pints 12¾fl oz chicken stock (or vegetable stock)", "½ bunch parsley, roughly chopped", "100g/3½oz parmesan, or similar vegetarian hard cheese, finely grated", "drizzle truffle oil, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a deep frying pan over a medium heat. Add the onion and garlic and fry gently until translucent. ", "Drain the soaked porcini, reserving about 300ml/10½fl oz of the soaking water.", "Increase the heat to high and add the mushrooms to the pan. Cook over a high heat for 2-3 minutes and then add the rice. If at this point the mixture is drying out add a splash of olive oil. Fry the mixture for 2-3 minutes until the rice is slightly translucent.", "Add the wine and simmer until the liquid is mostly absorbed, then add a ladleful of stock.", "Continue to cook the rice, adding a ladleful of stock at a time and stirring continuously until the liquid is absorbed by the rice. The rice should take about 18-20 minutes to cook.", "Once the rice is tender, take the pan off the heat and stir in the parsley and parmesan. ", "Divide the risotto among four serving plates, drizzle with truffle oil and serve."]}, {"isVegetarian": true, "title": "Wild mushrooms on crostini (funghi trifolati)", "url": "www_bbc_co_uk_food_recipes_wildmushroomsoncrost_65558", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb chestnut mushrooms, sliced ", "55g/2oz dried porcini mushrooms ", "2 cloves garlic ", "75ml/3fl oz olive oil ", "salt and pepper ", "fresh parsley, chopped ", "1 day old French baguette"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the dried mushrooms in hot water for at least one hour. ", "In a large frying pan heat the olive oil and sauté the garlic for 2 minutes. ", "Add the sliced mushrooms and sauté for 3 to 4 minutes. ", "Add the dried mushrooms and some of the water, strained through kitchen paper, in which the mushrooms have been soaking. ", "Cover and simmer for about 10 minutes or until the volume of liquid has reduced. ", "Sprinkle with the chopped parsley and serve warm. ", "Or, add some cream or marscapone to make a creamy sauce for pasta and top with parmesan and butter.", "To serve with crostini, slice the baguette on the diagonal and dry it out in the oven, but do not colour it."]}, {"isVegetarian": false, "title": "Wild mushroom soup", "url": "www_bbc_co_uk_food_recipes_wildmushroomsoup_11367", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wildmushroomsoup_11367_16x9.jpg", "ingredients": ["60g/2oz shallots, chopped", "50g/2oz butter ", "pinch of salt", "400g/14oz  wild mushrooms, trimmed (or 250g/9oz dried mushrooms)", "570ml/1 pint water ", "290ml/½ pint chicken stock", "salt and freshly ground black pepper, to taste", "50g/2oz butter", "100g/3½oz wild mushrooms, prepared and washed ", "50-100g/2-3½oz of hazelnuts"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat the shallots in the butter with a pinch of salt for 3 minutes. Do not let them colour.", "Add the mushrooms and continue to sweat for 5 minutes. ", "Now add the water and chicken stock (replace the chicken stock with water for vegetarians).", "Bring to the boil and reduce to a simmer. Cook out for 20 minutes.", "sauté the garnish mushrooms and hazelnuts in butter while the soup is simmering.", "After 20 minutes, pour the soup into a liquidiser and blend until smooth. Place in a saucepan and using a hand blender whisk in the remaining butter. Correct the seasoning and serve garnished with the sautéed mushrooms and hazelnuts."]}, {"isVegetarian": false, "title": "Wild rabbit and morel stew with olive oil mash", "url": "www_bbc_co_uk_food_recipes_wildrabbitandmorelst_92455", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz plain flour", "salt and freshly ground black pepper", "1 wild rabbit, cut into eight serving pieces", "2 tbsp vegetable oil", "3 rashers smoked streaky bacon, cut into lardons", "1 onion, peeled, roughly chopped", "2 garlic cloves, peeled, finely chopped", "2 sprigs fresh thyme, leaves only", "40g/1½oz dried morel mushrooms, soaked in 150ml/5fl oz warm water for at least 30 minutes", "200ml/7fl oz red wine", "350ml/12fl oz beef stock", "1kg/2lb 2oz floury potatoes, such as King Edward or Maris Piper, peeled, cut into equal-sized pieces", "75-110ml/3-4fl oz extra virgin olive oil", "50g/2oz butter", "salt and freshly ground black pepper ", "4 tbsp chopped fresh flatleaf parsley, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the wild rabbit and morel stew, sprinkle the flour into a bowl and season, to taste, with salt and freshly ground black pepper. Dredge the rabbit pieces in the seasoned flour until completely coated.", "Heat the oil in a large casserole over a medium heat. Add the coated rabbit pieces, in batches if necessary, and fry for 3-4 minutes on each side, or until browned on all sides. Remove from the pan and set aside on a warm plate.", "Add the bacon to the casserole the rabbit was cooked in and fry for 1-2 minutes, or until the fat is released. ", "Add the onion, garlic and thyme leaves and fry, stirring well, for 2-3 minutes, or until the bacon is crisp and golden-brown and the vegetables have softened.", "Add the morels, strained soaking liquid and the red wine to the casserole and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the volume of liquid has reduced by half, about 8-10 minutes. ", "When the liquid has reduced, add the beef stock and return the mixture to the boil.", "Return the browned rabbit pieces to the casserole and season, to taste, with salt and freshly ground black pepper. ", "Bring the contents of the casserole to a simmer, then cover the pan with a lid and simmer gently for 1-1½ hours, or until the rabbit meat is tender and the cooking liquid has thickened slightly.", "Meanwhile, for the olive oil mash, boil the potatoes in a large pan of salted water, for 10-15 minutes, or until tender. Drain well.", "Return the potatoes to the pan and heat over a low heat for 10-15 seconds to drive off any excess moisture.", "Mash the potatoes well using a potato masher or ricer, then add the olive oil and butter and mash again until smooth and well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, place a spoonful of the olive oil mash into the centre of each of four serving dishes. Place two pieces of rabbit on top of each portion of olive oil mash. Spoon over the stew. Sprinkle over the flatleaf parsley."]}, {"isVegetarian": false, "title": "Wild salmon and crushed peas with marjoram and vine tomato sauce", "url": "www_bbc_co_uk_food_recipes_wildsalmonandcrushed_86204", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "2 x 150g/5oz wild salmon fillets", "500g/1lb 2oz fresh peas, pods removed", "1 tbsp fresh marjoram, finely chopped ", "2 tbsp butter", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper ", "200g/7oz ripe baby cherry tomatoes", "½ tsp caster sugar", "1 tsp Cabernet red wine vinegar ", "seaweed salt (equal parts of sea salt and dried nori ground together in a mortar and pestle)", "2 sprigs fresh basil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot and add the olive oil. Place the salmon fillets in the pan, skin-side down.", "Cook the salmon for three minutes, then turn over and cook for a further three minutes until cooked all the way through. Remove from the heat and rest in a warm place.", "For the crushed peas with marjoram, bring a saucepan of water to the boil and add the podded peas.", "Cook the peas for 1-2 minutes, then drain and transfer to a bowl of iced water to cool. When the peas are cool, drain them.", "Heat a small frying pan until hot. Add the peas to the pan along with the marjoram and butter and heat through, crushing lightly with a wooden spoon. Keep warm.", "While the fish and peas are cooking, make the vine tomato sauce. For the vine tomato sauce, whisk the Dijon mustard, white wine vinegar and extra virgin olive oil together in a bowl and season with salt and freshly ground black pepper.", "Transfer the mustard mixture, cherry tomatoes and sugar to a blender or food processor and blend until puréed.", "Pour the puréed mixture through a sieve into a bowl. Add the Cabernet red wine vinegar and stir well.", "Place a chef's ring in the middle of an individual serving plate and place half of the peas inside, pressing well to the edges. Remove the ring. Repeat with the remaining peas on another plate.", "Place a salmon fillet on top of each of the pea circles and spoon the sauce around. Finish with a sprinkle of seaweed salt and a sprig of basil each. Serve at once."]}, {"isVegetarian": false, "title": "Wild sea trout with fresh peas and horseradish", "url": "www_bbc_co_uk_food_recipes_wildseatroutwithfres_91645", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5oz wild sea trout fillets, skin scored with a sharp knife", "salt and freshly ground black pepper ", "1 tbsp olive oil", "400g/14oz shelled fresh peas", "4 medium carrots, peeled, cut into batons", "200g/7oz smoked streaky bacon, cut into lardons", "300g/11oz cold butter, cut into cubes", "400ml/14fl oz chicken stock", "4 Little Gem lettuces, cores removed, leaves separated and shredded", "4 tbsp horseradish cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea trout, season the sea trout fillets all over with salt and freshly ground black pepper. ", "Heat the oil in a large frying pan over a medium heat. Add the trout fillets, skin-side down, and fry without moving the fish for 4-5 minutes, or until the skin is crisp and golden-brown.", "Turn off the heat, then turn over the trout fillets and allow the undersides of the fillets to cook through on the residual heat.", "Meanwhile, for the peas and horseradish, blanch the peas and carrot batons in a pan of boiling salted water for 1-2 minutes, or until just tender. Drain well, refresh in cold water, then drain again. ", "Blanch the bacon lardons for one minute in a separate pan of boiling water, then drain well. ", "Heat one tablespoon of the butter cubes in a large saucepan over a high heat. When the butter is foaming, add the blanched bacon lardons and fry until crisp and golden-brown.", "Add the blanched carrots and peas to the pan with the bacon lardons in it. Pour over the chicken stock and bring the mixture to the boil, then reduce the heat to a simmer and simmer the mixture for 4-5 minutes. Season, to taste, with salt and freshly ground black pepper.", "Add the butter cubes, a few at a time, to the mixture, shaking the pan regularly until the butter melts and the sauce has thickened slightly before adding the next few cubes. ", "Add the shredded Little Gem lettuce leaves and horseradish cream and stir well, then remove the pan from the heat.", "To serve, divide the vegetables and sauce equally among four serving bowls. Place one trout fillet on top of each serving. Serve immediately."]}, {"isVegetarian": false, "title": "Wilted red cabbage with ham hock", "url": "www_bbc_co_uk_food_recipes_wilted_red_cabbage_with_74108", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wilted_red_cabbage_with_74108_16x9.jpg", "ingredients": ["1 egg yolk", "1 tbsp Dijon mustard", "50ml/2fl oz walnut vinegar", "100ml/3½fl oz vegetable oil", "salt and freshly ground black pepper", "½ red cabbage, finely sliced", "½ cooked ham hock, shredded"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Place the egg, mustard and vinegar in a bowl and whisk together. Slowly add the oil whisking all the time until emulsified and the mixture resembles mayonnaise. Add 25ml/1fl oz water to slacken then season with plenty of salt and black pepper.", "Put the cabbage into a bowl and add the dressing, toss well to combine then set aside for at least 15 minutes to wilt, preferably up to one hour.", "Pile onto plates and top with some shredded ham hock. "]}, {"isVegetarian": false, "title": "Wild sea bass poached in red wine with creamed cavolo nero, ceps and crisp oysters", "url": "www_bbc_co_uk_food_recipes_wildseabasspoachedin_87456", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750ml/1pt 6fl oz red port", "500ml/18fl oz red wine", "1 bay leaf", "1 tsp black peppercorns", "6 cardamom pods", "2 star anis", "1 cinnamon stick", "1 tsp coriander seeds", "1 fillet from a 3kg/6lb/10oz wild sea bass", "vegetable oil, for deep frying", "1 bunch cavolo nero cabbage leaves", "110ml/4fl oz double cream", "2 garlic cloves", "salt and freshly ground black pepper", "2 tbsp olive oil", "110g/4oz fresh ceps, sliced 1cm/½ thick", "50g/2oz butter", "8 fresh oysters, shucked and dried", "50g/2oz plain flour", "2 free-range eggs, beaten", "200g/7oz breadcrumbs", "1 tbsp Cabernet Sauvignon vinegar (or other good quality red wine vinegar)", "50g/2oz butter"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the poaching liquor place all of the poaching liquor ingredients into a saucepan large enough to fit the sea bass.", "Place the pan over a low heat and slowly heat to infuse for 30 minutes, until the liquid has reduced by a quarter.", "Skin the sea bass fillet, cut into four equal portions and season with salt, then set aside for ten minutes.", "Place the bass in the hot poaching liquor - the liquid should be barely simmering - and cook for 6-8 minutes, or until completely cooked through. Remove from the poaching liquor and keep warm.", "Bring a large pan of water to the boil and cook the cavolo nero for one minute. Drain and refresh in a bowl of iced water, then squeeze dry. Slice the cavolo nero into fine shreds.", "Place the cream and garlic into a pan over a medium heat and bring to the boil. Reduce the heat to simmer until the liquid has reduced by half.", "Add the cavolo nero, season, to taste with salt and freshly ground black pepper and warm through.", "Heat the vegetable oil to 190C/375F in a deep fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Heat a frying pan until hot, add the olive oil and ceps and fry for 2-3 minutes, or until golden-brown all over.", "Add the butter, season with salt and freshly ground black pepper and fry for a further two minutes. Keep warm until ready to serve.", "Dredge the oysters in the flour, then dip into the beaten egg to coat, then finally dip into the breadcrumbs, ensuring the oysters are well coated.", "Add the oysters to the hot oil and deep-fry for 1-2 minutes or until crisp and golden-brown. Carefully remove with a slotted spoon and drain onto kitchen paper.", "Pour out 110ml/4fl oz of the poaching liquid into a small clean pan over a medium heat.", "Add the Cabernet Sauvignon vinegar and bring to the boil. Reduce the liquid by half then remove from the heat and add the butter, stirring well to thicken the sauce.", "To serve, spoon the creamed cavolo nero onto plates, arranged slightly to one side. Place a sea bass portion on top of each pile of cavelo nero. Place the ceps and oysters onto the plates on the other side and finish with a drizzle of the sauce"]}, {"isVegetarian": true, "title": "Wilted spinach and poached egg on toast", "url": "www_bbc_co_uk_food_recipes_wilted_spinach_and_33071", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wilted_spinach_and_33071_16x9.jpg", "ingredients": ["1 tsp olive oil", "1 large handful spinach", "1 whole nutmeg, for grating", "1 free-range egg", "white wine vinegar", "sea salt and freshly ground black pepper", "1 slice sourdough, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan over a medium heat, add the spinach, a small grating of nutmeg and season with salt and pepper. Pop the lid on and cook on low for 1-2 minutes, until just wilted. ", "Meanwhile, bring a pan of water to a boil and reduce the heat to a simmer. Add a splash of white wine vinegar and gently break the egg in as close to the surface as possible. Cook for 2-3 minutes or until the egg is cooked to your liking. ", "To serve, place the spinach on the toast, top with the egg and season with salt and pepper. "]}, {"isVegetarian": true, "title": "Wine, oil and herb marinade", "url": "www_bbc_co_uk_food_recipes_wineoilandherbmarina_5311", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6tbsp/90ml virgin olive oil", "3 tbsp/45ml wine vinegar or lemon or lime juice", "2 cloves garlic, chopped", "small bunch each of 3-4 herbs e.g. parsley, coriander, thyme, sage or savory, chopped ", "1 tsp/5ml coarsely ground black pepper"], "serves": "Makes 135ml marinade", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Combine all ingredients and cover the meat, fish or vegetables. Leave in a cool place. ", "Add salt just before starting to cook and use the marinade to baste whilst cooking."]}, {"isVegetarian": true, "title": "Winter crumble tart", "url": "www_bbc_co_uk_food_recipes_winter_crumble_tart_74434", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/winter_crumble_tart_74434_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "125g/4½oz chilled butter, cut into cubes", "30g/1oz caster sugar", "1 large free-range egg, beaten", "4 large Bramley apples (about 1.2kg/2lb 10oz), peeled, cored and cut into small chunks", "150g/5½oz caster sugar", "275g/10oz fresh blackberries", "175g/6oz plain flour", "100g/3½oz butter, at room temperature, cut into cubes", "50g/1¾oz rolled oats", "100g/3½oz demerara sugar", "50g/1¾oz hazelnuts, roasted and chopped", "custard or double cream, to serve"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "For the pastry, pulse the flour and butter in a food processor until the mixture resembles breadcrumbs (or rub the ingredients together in a large mixing bowl using your fingertips). ", "Add the sugar, egg and 1-2 tablespoons of cold water and mix again until the mixture comes together as a smooth dough. ", "Turn out the dough onto a lightly floured work surface and roll it out into a circle that's about 3mm thick and large enough to line the tart tin. Press the pastry into the base and sides of the tin and make a small lip around the top with the excess pastry. Prick the base all over with a fork, then chill in the fridge for 15 minutes. ", "Line the chilled pastry case with baking paper and baking beans, then bake in the oven for 12-15 minutes, or until the lip of the pastry is light golden-brown. Remove the baking beans and paper, then reduce the oven temperature to 160C/140C Fan/Gas 3 and bake for a further 8-10 minutes, or until the pastry case is crisp and golden-brown all over. Set the pastry case aside in its tin to cool, leaving the oven on. ", "For the filling, place the apples, sugar and 2 tablespoons of water in a large, deep, lidded saucepan and cook over a medium heat, stirring gently, for 4-5 minutes. Cover the pan with the lid and bring the mixture to a gentle simmer. Simmer, without stirring, for 5-10 minutes, or until the apples have softened but still retain their shape. ", "Stir the blackberries into the cooked apples and continue to simmer for a further 5-10 minutes, or until all of the fruit is just tender. Set aside to cool.", "Meanwhile, for the crumble topping, put the flour and butter into a large mixing bowl and rub the ingredients together using your fingertips, until the mixture resembles breadcrumbs. Add the remaining crumble topping ingredients and rub them into the mixture until small clumps have formed. (Alternatively, pulse all of the crumble topping ingredients in a food processor - there is no need to wash this out after making the pastry.) Set the crumble topping aside.", "Suspend a colander over a bowl and strain the cooked fruits, collecting the juices. Spoon the fruits into the cooked pastry case. (If there is too much fruit to fit into the pastry case, add the remaining fruit to the reserved fruit juice.) ", "Sprinkle the crumble topping all over the fruit filling and bake the tart at 200C/180C Fan/Gas 4 for 20-25 minutes, or until the crumble is crisp and golden-brown. ", "Meanwhile, boil the reserved fruit juice in a saucepan for 3-4 minutes, or until thickened to a syrup. ", "Serve the tart warm, in slices, with the extra fruit juice spooned over it and either custard or cream on the side."]}, {"isVegetarian": true, "title": "Winter salad and parsnip nests", "url": "www_bbc_co_uk_food_recipes_winter_salad_and_parsnip_81747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra for greasing", "2 large parsnips, peeled and julienned", "1 free-range egg, beaten", "salt and freshly ground black pepper", "2 heads red chicory, thinly shredded", "¼ red cabbage, thinly shredded", "1 red onion, thinly sliced, soaked in iced water for 10 minutes and drained", "25g/1oz hazelnuts, toasted, lightly crushed, to garnish", "2 tbsp hazelnut oil", "1 tbsp sherry vinegar", "1 tsp Dijon mustard", "1 orange, juice of 1, finely grated zest of ½"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the parsnip nests, preheat the oven to 200C/180C Fan/Gas 6. Heat the oil in a frying pan. Add the parsnips and plenty of salt and pepper, then fry for a few minutes, until wilted down and slightly softened – this helps get rid of some of the volume. Leave to cool completely, then mix with the egg. ", "Grease a 12-hole fairy cake tin or a four-hole Yorkshire pudding tin with oil. Strain the parsnips to get rid of any excess egg – you want them just coated to hold them together, not swimming in it. ", "Divide the mixture between the holes, pressing down the centre and pushing up the sides to create nest shapes. Bake for 20 minutes, or until the parsnips are crisp and brown. Leave in the tins for a few minutes before removing.", "To make the salad, put the chicory, cabbage and drained red onion in a bowl. Season with salt and pepper.", "To make the dressing, whisk the dressing ingredients together and season. Pour the dressing over the salad and toss. Garnish with the toasted hazelnuts. ", "Serve the parsnip nests with the salad."]}, {"isVegetarian": true, "title": "Winter Swiss roll bowl cake", "url": "www_bbc_co_uk_food_recipes_winter_swiss_roll_bowl_27318", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x jumbo chocolate Swiss rolls (not the chocolate-dipped ones) or 4 normal-sized ones", "150ml/5fl oz alcohol of your choice, such as rum, sherry or limoncello (optional)", "2-3 litres/3½-5 pints ice cream (chocolate or vanilla or both), softened but still frozen (no warmer than 12C/54F)"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 120, "preparationMins": 120}, "recommendations": 0, "method": ["Line the inside of a medium glass bowl or 1.2 litre/2 pint pudding basin with clingfilm (make sure there is plenty of extra clingfilm hanging over the sides).", "Cut the Swiss rolls into 1cm/½in slices. Place one slice in the middle on the bowl in the base, then place another next to it. Continue until the whole inside of the bowl is lined. Squash the Swiss roll slices slightly together so that there are no gaps between them. When you reach the top of the bowl, cut slices in half if a whole one does not fit.", "Use a pastry brush to dab the sponge with the alcohol. Spoon the ice cream into the lined bowl, squidging it down so that it is completely full. Now place the cake in the freezer and leave overnight or at least until the ice cream is completely firm.", "Once the ice cream is firm, carefully remove the cake from the bowl using the clingfilm to help you. Ease it very gently out of the bowl with the clingfilm. If it is too hard to remove, warm the bowl up a little in your hands or by carefully running a flat blunt knife between the bowl and the clingfilm. When the cake is loose in the bowl and feels as if you could pull it out easily, place a large serving plate on top of the bowl and turn the bowl upside down, so that the plate is the right way up. Carefully remove the bowl and peel off the clingfilm."]}, {"isVegetarian": false, "title": "Winter vegetable soup", "url": "www_bbc_co_uk_food_recipes_winter_vegetable_soup_24185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp sunflower oil", "1 onion, finely sliced", "3 garlic cloves, finely sliced", "2 carrots, cut into 1.5cm/¾in chunks", "2 turnips, cut into 1.5cm/¾in chunks", "1 large potato (preferably Maris Piper), cut into 1.5cm/¾in chunks", "1 large parsnip, cut into 1.5cm/¾in chunks", "2 heaped tsp paprika (sweet), plus extra to serve", "1 heaped tsp hot smoked paprika", "1 x 400g/14oz can chopped tomatoes", "1 tbsp tomato purée", "125g/4½oz chorizo sausage (we like picante), skinned and cut into 5mm slices", "100g/3½oz Puy lentils, rinsed and drained", "1.75 litres/3 pints stock, made with 1 chicken stock cube", "100g/3½oz cavolo nero, kale or spring greens, tough midribs removed, shredded into 2cm/¾in pieces", "flaked sea salt and freshly ground black pepper", "soured cream or crème fraîche, to taste."], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large non-stick saucepan or large flame-proof casserole and fry the onion and garlic gently for five minutes, or until softened but not coloured, stirring occasionally. While the onion is frying, cut the carrots, turnips, potatoes and parsnip into roughly 1.5cm/¾in chunks.", "Add the root vegetables to the pan with the onion and garlic and cook over a low heat for five minutes, or until beginning to soften, stirring occasionally. Stir in both the sweet and smoked paprika and fry for a few minutes. Add the tomatoes and the tomato purée into the pan, increase the heat a little and cook for 2-3 minutes, stirring regularly.", "Add the chorizo, Puy lentils and the stock into the pan and bring to the boil. Reduce the heat and simmer gently for 45 minutes, or until the vegetables and lentils are tender, stirring every now and then.", "Add the cavolo nero, kale or spring greens to the pan with the vegetables. Cook for five minutes or until softened, stirring regularly.", "Season the soup with salt and lots of freshly ground black pepper. Serve in deep bowls, with a dollop of soured cream or crème fraiche and a sprinkling of paprika."]}, {"isVegetarian": true, "title": "Winter cobbler", "url": "www_bbc_co_uk_food_recipes_wintercobbler_90041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, sliced", "2 garlic cloves, sliced ", "2 leeks, cut into slices", "200g/7oz cavolo nero, chopped", "200g/7oz butternut squash, cut into cubes and roasted until golden-brown", "440g/15½oz can chopped tomatoes", "splash white wine", "salt and freshly ground black pepper", "225g/8oz flour", "3 tsp baking powder", "pinch salt", "100g/3½oz cubed butter", "175ml/6fl oz soured cream", "150ml/5fl oz olive oil ", "bunch fresh basil", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until softened.", "Add the leeks and cavolo nero and cook for 3-4 minutes.", "Add the squash, tomatoes, wine and season, to taste, with salt and freshly ground black pepper. Simmer for 5-6 minutes, then divide between four individual ovenproof dishes or ramekins.", "For the topping, place the flour, baking powder, salt and butter into a food processor and pulse until the mixture resembles breadcrumbs.", "Add the soured cream and pulse again until it just comes together as a very sticky dough.", "Spoon dollops of the topping over the contents of each ramekin, then bake for 25 minutes, or until crisp and golden-brown.", "For the dressing, place the oil, basil and lemon juice into a clean food processor and blend until smooth.", "Serve the cobblers at the table in their ramekins and spoon over the dressing."]}, {"isVegetarian": true, "title": "Winter fruits with vermouth sabayon and cherry ripple ice cream", "url": "www_bbc_co_uk_food_recipes_winterfruitswithverm_93329", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz double cream", "300ml/10fl oz full-fat milk", "1 vanilla pod, seeds scraped out", "6 free-range egg yolks", "175g/6oz caster sugar", "200g/7oz black cherries, stones removed, roughly chopped", "75ml/3fl oz water", "4 free-range egg yolks", "110g/4oz caster sugar", "110ml/4fl oz vermouth rosso", "2 pears, peeled, cut lengthways into 8 wedges", "½ lemon, juice only", "20 black cherries", "20 blackberries"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the cherry ripple ice cream, heat the cream, milk and vanilla pod until boiling. Remove from the heat and set aside to infuse for 5 minutes. Discard the vanilla pod.", "Whisk the egg yolks and 110g/4oz of the sugar in a bowl until well combined. Pour the cream mixture onto the eggs, whisking continuously, until well combined.", "Return the mixture to the saucepan and continue to heat over a low heat, stirring continuously until the mixture has thickened enough to coat the back of a spoon. (Do not allow the mixture to boil.) Set aside to cool completely.", "Meanwhile, heat the the cherries, remaining caster sugar and water in a saucepan, until boiling. Boil for 4-5 minutes, or until the cherries have broken down, then blend in a food processor to a thick pureé.", "Churn the mixture in an ice-cream machine to a soft consistency, then stir in the cherry pureé. Transfer to an airtight container and put into the freezer for at least two hours.", "For the vermouth sabayon, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Whisk the egg yolks and half of the sugar in the bowl until well combined.", "Gradually whisk in 75ml/3fl oz of the vermouth until the mixture has thickened.", "Place the pear wedges, remaining vermouth, remaining sugar and lemon juice into a pan and add enough water to just cover the pears. Simmer the mixture for 5-8 minutes, or until the pears are tender. Drain and pat dry with kitchen paper.", "To serve, divide the poached pears, cherries and blackberries among four serving plates. Spoon the vermouth sabayon over the fruit and heat, using a cooks' blow torch until golden-brown. Scoop the cherry ripple ice cream alongside and serve immediately."]}, {"isVegetarian": true, "title": "Winter salad", "url": "www_bbc_co_uk_food_recipes_wintersalad_89195", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wintersalad_89195_16x9.jpg", "ingredients": ["¼ red cabbage, finely sliced", "¼ green cabbage, finely sliced", "2 carrots, peeled and cut into matchsticks", "handful walnuts, out of their shells, roughly chopped", "4 tbsp walnut oil", "1 tbsp sherry or red wine vinegar", "½ tsp Dijon mustard", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the sliced cabbage, carrots and walnuts into a large bowl. ", "In a small bowl, whisk together the walnut oil, sherry or red wine vinegar and mustard. Season, to taste, with salt and freshly ground black pepper, then drizzle over the salad and toss well to coat.", "To serve, pile onto a serving plate."]}, {"isVegetarian": true, "title": "Winter vegetable colcannon", "url": "www_bbc_co_uk_food_recipes_wintervegetablecolca_73661", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["675g/1½lb plain mashed potato, still hot", "225g/8oz kale or savoy cabbage, cooked and chopped", "225g/8oz carrots, peeled, cooked and roughly mashed", "125ml/4fl oz double cream", "125ml/4fl oz milk", "6 spring onions, sliced", "55g/2oz butter, melted"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl combine the hot mashed potato with the cooked kale or savoy cabbage and carrots.", "In a medium saucepan gently heat the double cream and milk.  ", "Add the spring onions and continue to cook on a low heat until the spring onions have softened and cooked. ", "Fold the creamy spring onion mixture into the mashed vegetables.", "Place in a warmed dish. ", "Indent the surface of the mixture and pour the melted butter over the top to form a puddle of butter.", "Serve."]}, {"isVegetarian": true, "title": "Winter vegetable salad", "url": "www_bbc_co_uk_food_recipes_wintervegetablesalad_93506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp olive oil", "250g/9oz pumpkin (such as Muscat de Provence or Iron Bar), peeled, cut into 2cm/1in cubes", "sea salt and freshly ground black pepper", "½ tsp extra virgin olive oil", "½ tsp hazelnut oil", "1 candy beetroot, washed, quartered", "1 golden beetroot, washed, quartered", "1 ruby beetroot, washed, quartered", "4 pieces pumpkin, each cut into rounds 3cm/1.5in in diameter and height using a pastry cutter", "2 tbsp olive oil", "1 tbsp extra virgin olive oil", "sea salt and freshly ground black pepper", "100ml/3½fl oz ruby port", "100ml/3½fl oz red wine", "1 star anise", "caster sugar, to taste", "1 tbsp olive oil ", "1 small handful baby beetroot leaves", "100g/3½oz mixed mushrooms, such as chanterelles, girolles and trompettes", "squeeze lemon juice", "sea salt and freshly ground black pepper", "10g/½oz fresh flatleaf parsley, roughly chopped", "½ parsnip, peeled, sliced into ribbons with a vegetable peeler, deep-fried until crisp and golden-brown", "12 fresh sage leaves, deep-fried until crisp", "12 pickled baby shallots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pumpkin purée, heat the olive oil in a non-stick pan and gently fry the pumpkin for 4-5 minutes over a medium-low heat. Season with sea salt, freshly ground black pepper and a squeeze of lemon juice. ", "Increase the heat and cover the pan with a tight-fitting lid. Continue to cook the pumpkin for 8-10 minutes, or until tender. Transfer to a food processor and blend to a smooth purée. Spoon into a bowl and season, to taste, with salt and freshly ground black pepper. Mix in the extra virgin olive oil and hazelnut oil. Set aside until ready to serve.", "Preheat the oven to 170C/325F/Gas 3.", "Bring a pan of water to a simmer and place a steamer insert on top. Place all of the beetroot into the steamer and steam for 15-20 minutes, or until tender. Set aside to cool slightly.", "Heat the olive oil in a small ovenproof frying pan, add the pumpkin rounds and fry for 1-2 minutes on one side, or until golden-brown. Transfer to the oven and roast for 7-10 minutes, or until golden-brown and tender. ", "Mix the steamed beetroot with the extra virgin olive oil in a small pan and season to taste with salt and freshly ground black pepper. Warm through over a medium heat just before serving.", "For the sauce, heat a frying pan until hot and carefully pour in the port, and reduce in volume by half. ", "Add the red wine and star anise to the pan and simmer until the liquid has reduced in volume by a further two-thirds, and is thick enough to coat the back of a spoon. Taste and add a little bit of sugar if the tannins in the sauce are too strong.  Strain the sauce into a small bowl. ", "For the mushroom fricassée, heat a non-stick frying pan until hot and add the olive oil, baby beetroot leaves and chanterelle mushrooms. Add a squeeze of lemon juice and fry for one minute, then cover the pan with a lid and cook for a further minute.", "Add the girolles and fry for a further 30 seconds with the lid on, then remove the lid and add the trompette de la mort mushrooms. Cook for a few more seconds, then season, to taste, with salt and freshly ground black pepper and stir in the chopped parsley.", "To serve, take a spoonful of pumpkin purée and drag it in a line along the middle of a rectangular plate. Place three beetroot wedges along the purée (one of each colour). Place a roasted pumpkin round on the other end of the pumpkin purée. Spoon the mushroom fricassée on either side of the pumpkin. Top with some deep-fried parsnip ribbons and deep-fried sage leaves, and arrange a few pickled shallots around the plate. Drizzle over the sauce. Repeat the process three more times to create four servings."]}, {"isVegetarian": true, "title": "Witchcraft", "url": "www_bbc_co_uk_food_recipes_witchcraft_90056", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25ml/1fl oz black vodka ", "1 tbsp lemon juice", "2 tsp vanilla extract", "25ml/1fl oz blackberry liqueur", "25ml/1fl oz fresh apple juice", "", "1 lychee, peeled", "½ tsp strawberry jam", "1 blueberry"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vodka, lemon juice, vanilla syrup, blackberry liqueur and apple juice into a cocktail shaker filled with ice and shake well. Pour into a cocktail glass.", "To garnish, cut a small hole into the lychee. Fill with strawberry jam, then stick the blueberry into the jam to create an 'eyeball'. Float the 'eyeball' in the cocktail and serve."]}, {"isVegetarian": true, "title": "Wobbly apricot tart", "url": "www_bbc_co_uk_food_recipes_wobbly_apricot_tart_20144", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/wobbly_apricot_tart_20144_16x9.jpg", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "100g/3½oz icing sugar", "100g/3½oz butter, cubed", "1 free-range egg", "375g/13oz almond paste or marzipan", "2 x 400g/14oz cans halved apricots in natural juice", "icing sugar", "single cream or crème fraîche"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry put the flour, icing sugar and butter into a food processor. Blend until it resembles breadcrumbs. Add the egg and mix until the mixture holds together. Tip onto a floured work surface and gather the dough into a ball. Wrap in cling film and chill in the fridge for approximately 15 minutes.", "Preheat the oven to 200C/400F/Gas 6 and place a baking tray on the middle shelf to heat. Line the base and sides of a 23cm/9in round deep fluted tin.  ", "Take two-thirds of the chilled pastry from the fridge. Roll it out thinly to make a circle large enough to line the base and sides of the tin. Use a rolling pin to lift the pastry into the tin.", "Use a small ball of excess pastry to press the rolled out pastry into the base and sides of the fluted tin (this will help prevent holes forming in the pastry). Ensure the tin is fully lined, with no holes.", "Coarsely grate or finely chop the almond paste or marzipan and sprinkle it over the base of the tart ", "Drain the apricots thoroughly and pat dry with kitchen paper. Arrange the apricots over the base of the tart cut side down. ", "Roll out the remaining pastry to form the lid. Dampen the edge of the pastry base in the tin. Lift the pastry lid over the top of the fruit and press the two layers of pastry together around the edge of the tin, patching the edges if necessary.", "Place the tart on the preheated baking tray and bake in the centre of the oven for approximately 30-35 minutes, or until pale golden-brown.", "To serve, dust with icing sugar and serve with crème fraîche or cream."]}, {"isVegetarian": false, "title": "Witchill potatoes, caramelised onion purée, buffalo milk and turkey prosciutto", "url": "www_bbc_co_uk_food_recipes_witchill_potatoes_56219", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz red wine", "225g/8oz salt", "1 head garlic, cut across in half", "150g/5½oz roughly chopped carrots", "200g/7oz roughly chopped onions", "2 sprigs thyme", "2 bay leaves", "1 sprig rosemary", "20 black peppercorns", "400g/14oz piece skinless turkey breast, sinew-free", "6g black peppercorns", "8g coriander seeds", "8g mustard seeds", "2g cumin seeds", "5g fennel seeds", "8g flaked sea salt", "75g/2½oz salt", "500g/1lb 2oz green elderberries", "400ml/14fl oz white balsamic vinegar", "40g/1½oz salt", "250g/9oz wild garlic buds", "3 leeks", "450g/1lb buffalo milk", "80g/3oz double cream", "50g/1¾oz dried buffalo milk powder (available from specialist suppliers online)", "1.8g agar-agar", "6 Witchill potatoes, about 40g/1½oz each, scrubbed", "50g/1¾oz unsalted butter", "4g leek ash (from above)", "50g/1¾oz duck fat", "600g/1lb 5oz onions, finely sliced", "30g/1oz unsalted butter", "12 pencil-thin spring onions, trimmed", "1 tsp olive oil", "salt and freshly ground black pepper", "10g/¼oz pickled green elderberries (from above)", "10g/¼oz salted garlic buds (from above)", "chickweed"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["For the brine, combine all the ingredients, except the turkey, in a large saucepan with 1 litre/1¾ pints water and bring to the boil. Cook for five minutes. Remove from the heat and leave to cool. Place the turkey in the brine, cover and leave in the brine in the fridge for 4-5 days.", "For the turkey coating, toast all the ingredients, apart from the sea salt, in a dry pan until the seeds start popping and the mixture smells aromatic. Remove from the heat and leave to cool, then grind in a blender, or in spice mill or clean coffee grinder. Mix with the salt and keep in a sealed jar until needed.", "For the turkey prosciutto, drain the turkey, rinse briefly and dry with a clean cloth. Roll the turkey in the spiced coating mixture, then roll it in a piece of muslin. Tie both ends with string, making a loop at one end. Hang up and leave to air-dry for 1-2 weeks in a cool, airy place. When needed, remove the cloth and slice as finely as possible. You will need 4-5 slices per portion.", "For the pickled green elderberries, put the salt into 350ml/12fl oz water in a medium saucepan and bring to the boil to dissolve the salt. Place to one side and cool.", "Check the elderberries for any bugs, then put the berries in a sterilised container that has a tight fitting lid. Pour in the brine. Cover the container and keep in a cool place or the fridge for 2-3 weeks. Keep an eye on the berries, you don’t want them to shrivel. If they start to look a bit too wrinkled, drain and quickly rinse under cold running water.", "Once the salting period is over, drain the brine from the berries and put them into a clean, sterilised, warm jar. Bring the vinegar to the boil, then pour over the berries to cover them completely. Immediately cover with a tight-fitting lid and leave to cool. Keep in the refrigerator. (They can be stored for 6- 8 months.)", "For the salted wild garlic buds, put the salt into 200ml/7fl oz water in a small saucepan and bring to the boil. Remove from the heat and leave to cool.", "Make sure the garlic buds are free of stalks, then rinse thoroughly. Place them in a sterilised jar, pour over the brine solution and cover. Keep in a cool, dark place for 2-3 weeks before using. If you want to keep them longer than this, drain the buds, place in another sterilised jar and cover with olive oil. Keep in the fridge until needed.", "For the leek ash, set a large pan of salted water on the heat and bring up to the boil. Meanwhile, cut the leeks in half lengthways, separate the layers and wash well, removing any grit. Drain. Blanch the leeks in the boiling water, then drain and refresh. Place on a cloth to dry.", "Spread out the batch of leeks, in a single layer, on a baking tray and grill them until black and dry. Repeat until all the leek layers have been grilled. Place the blackened, dried leeks in a blender, or a clean spice mill or coffee grinder, and blend to a powder. Pass the powder through a fine sieve, to end up with a uniform fine powder with no big bits in it. Store in an airtight container until needed (up to one month). ", "For the buffalo milk jelly, place all the ingredients in a medium-sized saucepan and whisk together, then leave to sit for five minutes. Heat up the mixture, whisking occasionally, and boil for two minutes. Season. Strain through a fine chinois into a stainless-steel tray, about 15cmx3cmx½cm. Leave to cool, then cover and leave in the fridge for about four hours, until set. Remove from the fridge 30 minutes before needed. ", "For the Witchill potatoes, put the potatoes in a large saucepan, just cover with water and add some salt. Bring up to the boil, then simmer for 10-15 minutes, or until tender. Drain and leave to cool. When needed, cut each potato into four even slices. Warm the butter in a medium pan, add the potatoes and turn around in the butter, then add the leek ash. Turn the potatoes in the ash and butter until coated. Season and keep warm until needed.", "For the caramelised onion purée, heat the duck fat in a large saucepan, add the onions and stir well, then cover with a lid. Cook for about five minutes, stirring occasionally, until the onions have collapsed and become translucent. Remove the lid and cook until the onions are a lovely deep golden-brown colour, stirring well to prevent them from catching. Transfer the onions to a blender and blend until smooth. Add the butter and blend again. Remove from the blender to a small saucepan and season. Keep warm until needed.", "For the spring onions, heat a large frying pan. While it is getting hot, toss the spring onions in the oil and seasoning. Place them in the pan and keep turning until wilted, golden-brown and cooked. ", "To serve, make a smear of onion purée down the centre of each plate. Sprinkle with green elderberries and garlic buds. Using a teaspoon, place four scoops of buffalo milk jelly on each place, then add the spring onions. Now, add the potatoes, four slices per plate. Arrange 4-5 slices of turkey prosciutto on each plate, bending them a little. Finally, add the chickweed and dust a band of leek ash over the centre of the plate."]}, {"isVegetarian": false, "title": "Wok-fried Singapore-style crab", "url": "www_bbc_co_uk_food_recipes_wok-fried_singapore_32489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 long red chillies, seeds removed, chopped", "30g/1oz crushed garlic", "100g/3½oz fresh ginger, diced", "50ml/2fl oz rice wine vinegar", "50g/1¾oz caster sugar", "2 tsp sea salt", "50g/1¾oz sambal oelek", "2kg/4lb 8oz whole king crab, cooked, white and brown meat removed", "handful curry leaves", "vegetable oil", "100ml/3½fl oz fish sauce", "freshly ground black pepper", "2 long red chilli, julienned ", "2 spring onions, julienned ", "handful coriander, leaves picked", "handful fresh mint leaves ", "Thai basil", "50g/1¾oz deep-fried shallots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a blender, mix the chilli, garlic and half the ginger and blend to a paste. Add the rice wine vinegar, sugar and salt. Blend again and adjust the seasoning if necessary.", "Heat a little vegetable oil in a wok and stir-fry the sambal oelek until fragrant. Add the remaining ginger and the crab meat. Mix in most of the chilli paste, keeping a little back for the end. Add the curry leaves. Cover with a lid or a piece of aluminium foil and steam for 5 minutes. ", "Season to taste with fish sauce and black pepper. Add half the garnish and mix to release all aromas.", "To serve, transfer to a bowl and and spoon over the reminaing chilli paste and scatter with the remaining garnish."]}, {"isVegetarian": false, "title": "Venison and jungle curry with lime Thai rice", "url": "www_bbc_co_uk_food_recipes_wok-fried_venison_and_21951", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz tender venison fillet", "1 tbsp Shaoxing rice wine", "2 tbsp cornflour", "1 tbsp fish sauce", "pinch sea salt", "pinch ground black pepper", "pinch caster sugar", "1 tbsp vegetable oil ", "1 lime, juice only", "3 garlic cloves, peeled", "8 Thai shallots", "2 small red or yellow chillies, seeds removed, roughly chopped", "4 cayenne chillies, seeds removed, roughly chopped", "2.5 cm/1in piece galangal, peeled and roughly chopped (or shop-bought paste is fine)", "1 cm/½in piece fresh turmeric", "1 stick lemongrass, outer leaves removed, bruised, finely sliced", "2 tbsp palm sugar", "1 tbsp shrimp paste", "pinch sea salt", "¼ tsp white pepper ", "2 tbsp vegetable oil", "2 medium purple aubergines, cut into 2cm/¾ in", "500ml/18fl oz chicken stock", "2 kaffir lime leaves, spine removed, shredded", "1 tbsp fish sauce", "400ml/14fl oz tin coconut milk", "200g/7oz French beans, washed, sliced into 1 cm/½in slices", "200ml/7fl oz water", "350ml/12fl oz chicken stock", "300g/10½oz Thai jasmine rice, washed well", "1 stick lemongrass, bruised and sliced", "1 kaffir lime leaf", "1–2 small baby Thai shallots, peeled and finely sliced into rings", "1 tbsp fish sauce", "3 tbsp lime juice", "1 tbsp palm sugar", "400g/14oz chillies", "5 garlic cloves, finely chopped ", "50g/1¾oz piece fresh root ginger, peeled and finely grated", "2 stalks lemongrass, outer husk removed, bruised and finely sliced", "100ml/3½fl oz rice vinegar", "5 tsp caster sugar", "3 large pinches salt", "1 tbsp finely grated lime zest", "micro coriander leaves", "crispy fried shallots (optional)", "1 fresh banana leaf", "1 fresh bamboo leaf", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pickled Thai shallots, peel and slice the shallot and add to a bowl. Add the fish sauce, lime juice and palm sugar, cover with cling film  and leave in the fridge.", "If making the sabal oelek, blend the garlic, ginger, chilli and lemongrass and vinegar in a food processor or pestle and mortar until a paste forms. ", "Tip the paste into a wok with the vinegar and bring to the boil. Add the sugar and stir until dissolved. Season with salt and lime zest. Spoon oil, blast chill and then place in jars.", "To make the jungle curry paste, place all the ingredients in a food procesor and blend to a rough paste. ", "To make the curry, heat a wok over a high heat. Add the vegetable oil, all the curry paste and cook until you have a dry paste. Add the aubergines and fry for a few minutes, coating the aubergines well with the paste. Add the lime leaves, fish sauce and chicken stock and bring to the boil.", "Add the coconut milk and reduce to a simmer for 20 minutes, until the aubergines are very soft and the curry becomes thick. Add the French beans for the last 3 minutes of the cooking time. ", "Slice the venison into ½cm slices, season with salt and pepper and dust with cornflour. ", "Heat a wok over a high heat and add the vegetable oil. Add the venison strips and sear for 10–15 seconds on one side, before flipping to sear on the other side. ", "Pour in the Shaosing rice wine to deglaze the pan and season with fish sauce mixed with sugar and lime juice.", "Method for the lemongrass and lime leaf infused jasmine rice ??", "Serve the venison with the aubergine jungle curry and with a side of lemongrass and lime infused rice, sambal oelek and pickled Thai baby shallots, lime wedge, micro coriander and crispy fried shallots, if using."]}, {"isVegetarian": false, "title": "Wok-cooked monkfish with sesame soy sauce", "url": "www_bbc_co_uk_food_recipes_wokcookedmonkfishwit_89274", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 monkfish fillets, membrane removed", "salt and ground white pepper", "3 tbsp groundnut oil", "4 cloves garlic, finely chopped", "2.5cm/1in piece fresh root ginger, peeled, finely chopped", "1 red chilli, seeds removed, flesh finely chopped", "1 tbsp of Shaoxing rice wine ", "4-5 tbsp light soy sauce", "2 tbsp toasted sesame oil", "2 spring onions, cut into thin strips (julienne)", "1 tbsp chopped fresh coriander", "steamed rice or wholewheat noodles", "steamed asparagus", "steamed broccoli"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the monkfish fillets with salt and ground white pepper, then slice into six equal-sized pieces. ", "Heat a wok until smoking and add the groundnut oil. Add the fish, pressing down lightly on the pieces of fish as they cook. Cook for 3-4 minutes on one side, then reduce the heat to medium.", "Turn the fish over and sprinkle over the garlic, ginger and chilli. Cook for a further 3-4 minutes (depending on the size of the fillet), or until the flesh has turned opaque and flakes easily when poked with a pair of chopsticks or a fork.", "Season with the soy sauce and sesame oil and spoon the sauce over the fish. Add the spring onion strips and chopped coriander and cook for 1-2 minutes, or until the herbs have wilted slightly. ", "To serve, transfer the fish to a serving plate and garnish with the wilted herbs. Spoon over the cooking juices from the pan and serve immediately with steamed rice or dressed wholewheat noodles and steamed asparagus and broccoli."]}]