[{"isVegetarian": false, "title": "Cheesy leek bruschetta", "url": "www_bbc_co_uk_food_recipes_cheesyleekbruschetta_90089", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp olive oil", "¼ leek, white part only, chopped", "1 garlic clove, crushed", "85g/3oz canned tuna", "1 tbsp fresh thyme, chopped", "100ml/3½fl oz double cream", "2 slices French bread", "Fresh parsley, dill and chervil sprigs"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat two tablespoons of the oil in a pan and gently fry the leek and garlic for 2-3 minutes, or until softened. Add the tuna and thyme, stir well and pour in the cream. Simmer for 4-5 minutes. ", "Heat a chargrill pan, drizzle the bread with the remaining oil and griddle the bread for 2-3 minutes on each side, or until golden-brown and crisp.", "Serve the leek and tuna mixture on top of the toasted bread, garnished with the fresh herbs."]}, {"isVegetarian": true, "title": "Cheesy pasta with courgette and peas", "url": "www_bbc_co_uk_food_recipes_cheesypastawithyello_76613", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheesypastawithyello_76613_16x9.jpg", "ingredients": ["1 tbsp olive oil", "½ red onion, finely chopped", "1 garlic clove, finely chopped or grated", "1 courgette, diced", "85g/3oz frozen peas, defrosted under cold running water", "110g/3½oz Wensleydale cheese, grated", "100ml/3½fl oz double cream", "handful fresh flatleaf parsley, chopped", "140g/5oz whole wheat fusilli pasta, cooked according to the packet instructions, drained", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large pan and gently fry the red onion, garlic and courgette for a few minutes, to soften. Stir in the peas and heat for a few minutes, to warm through.", "Stir in the Wensleydale cheese and then add the cream. Season with salt and pepper.  Heat gently for a further 4-5 minutes, add most of the parsley and the pasta at the end. Transfer to a serving bowl or plate and serve immediatedly, garnished with the remaining parsley."]}, {"isVegetarian": true, "title": "Cheesy refried barbecue beans", "url": "www_bbc_co_uk_food_recipes_cheesyrefriedbarbecu_84251", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 red chilli, seeds removed and chopped finely", "1 garlic clove, crushed", "1 tbsp brown sugar", "2 tsp soy sauce", "3 tbsp tomato sauce", "150g/5½oz cannellini beans from a can, rinsed and drained", "1 ready-made flour tortilla", "2 tbps grated Emmental cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Heat the oil in a frying pan and add the chilli and garlic and fry for one minute.", "Add the brown sugar and cook for two minutes, or until the sugar starts to melt.", "Add the soy sauce, tomato sauce and cannellini beans. Bring to the boil, then reduce the heat and simmer for four minutes.", "Place the tortilla into a clean ovenproof frying pan. Pour the beans mixture into the middle and fold the tortilla to cover. ", "Top with the grated cheese and place under the grill. Cook for two minutes, or until the cheese is melted and golden."]}, {"isVegetarian": true, "title": "Cheesy roast potatoes", "url": "www_bbc_co_uk_food_recipes_cheesyroastpotatoes_85799", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["butter, for greasing", "200g/7oz potatoes, quartered", "2 tbsp olive oil", "1 sprig fresh rosemary", "1 garlic clove, crushed", "salt and freshly ground black pepper", "100g/3½oz Red Leicester, grated"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Lightly grease a gratin dish with the butter and add the potatoes, olive oil, fresh rosemary and crushed garlic. Season with salt and freshly ground black pepper and mix well.", "Roast the potatoes in the oven for 15 minutes or until golden and cooked through.", "Add the grated cheese for the final three minutes of the cooking time. Serve hot."]}, {"isVegetarian": false, "title": "Cheesy salmon and spaghetti bake", "url": "www_bbc_co_uk_food_recipes_cheesysalmonandspagh_83965", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200ml/7fl oz double cream", "sea salt and freshly ground black pepper", "110g/4oz skinless salmon fillet, chopped", "handful fresh flatleaf parsley, chopped", "55g/2oz parmesan cheese, grated plus a handful extra to sprinkle", "200g/7oz spaghetti, cooked according to packet instructions", "fresh chives, chopped, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat the cream in a saucepan and season with sea salt and freshly ground black pepper.", "Once the cream has boiled, add the salmon, parsley and parmesan, simmer for two minutes.", "Add the cooked spaghetti, stir well and pour into a medium-sized gratin dish.", "Sprinkle with the extra Parmesan and bake for five to ten minutes, until the cheese is bubbling and golden.", "Serve garnished with chives."]}, {"isVegetarian": false, "title": "Cheesy sausage cakes on roasted field mushrooms", "url": "www_bbc_co_uk_food_recipes_cheesysausagecakeson_74664", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10 large, even-sized field mushrooms", "1 tbsp olive oil", "salt and freshly ground black pepper", "30g/1oz butter", "1 tbsp chopped fresh chives", "450g/1 lb good quality pork sausages", "115g/4oz cheddar cheese, chopped", "1 shallot, finely chopped", "2 cloves garlic, crushed", "1 tbsp chopped parsley", "1 tsp French mustard", "1 splash Worcestershire sauce", "2 splashes Tabasco sauce", "4 free-range eggs, fried according to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "Place the mushrooms on a roasting tray, drizzle with the olive oil and season.", "Cook in the oven for 15 minutes then reduce the temperature to 140C/285F/Gas 4. Cook at this temperature for about one-and-a-half hours. Remove from the oven and drain well. Put to one side. Turn the oven up to 180C/355F/Gas 5. Meanwhile, to make the sausage cakes, take the sausage meat out of the sausage skins and put into a bowl. Discard the skins.", "Add the rest of the ingredients and mix well. Mould into four even-sized cakes.", "Heat a little olive oil in a frying pan and fry the sausage cakes for a few minutes on each side, or until nicely browned.", "Transfer to a baking tray and cook in the oven for about 20 minutes, or until cooked through.", "Just before they're finished cooking, return four of the roast mushrooms to the oven to reheat.", "Cut the remaining six roast mushrooms into strips and fry gently in the butter. Season and stir in the chives.", "Spoon the mushroom strips onto the centre of four serving plates. Top with one whole mushroom, a sausage cake and a fried egg."]}, {"isVegetarian": true, "title": "Cheesy stuffed tomatoes with rocket salad", "url": "www_bbc_co_uk_food_recipes_cheesystuffedtomatoe_84489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large ripe tomatoes", "50g/1¾oz fresh breadcrumbs", "1 tsp each chopped chervil, dill, parsley ", "½ garlic clove, crushed ", "1 tbsp cheddar cheese, grated", "salt and freshly ground black pepper", "1 tbsp olive oil, plus extra for rubbing", "1 small red pepper", "35g/1¼oz rocket", "squeeze lemon juice"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Scoop the insides of the tomatoes out leaving the tomatoes whole. ", "Place the breadcrumbs, herbs, garlic, cheese and salt and freshly ground black pepper into a bowl and mix together. Stuff the tomatoes with the breadcrumb mixture. ", "Place the tomatoes on a baking sheet and cook in the oven for six minutes.", "Heat a frying pan over a high heat. Rub the pepper with a little of the olive oil and fry whole in a frying pan until charred all sides. ", "Place the pepper into a bowl, cover with cling film and leave for 2-3 minutes. ", "Remove the cling film, peel the pepper, discarding the charred skin, and slice into strips. ", "Place the pepper strips, rocket, olive oil and lemon juice into a bowl and mix together.", "To serve, place the rocket and pepper salad onto a serving plate and place the roasted tomatoes on top."]}, {"isVegetarian": true, "title": "Cheesy vegetable bake", "url": "www_bbc_co_uk_food_recipes_cheesyvegetablebake_74795", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 medium carrots, thinly sliced", "55g/2oz butter", "2 cloves garlic, finely chopped", "200g/7oz emmental cheese, grated", "1 small swede, sliced", "2 small parsnips, sliced", "3 medium potatoes, thinly sliced", "300ml/½ pint milk", "300ml/½ pint cream", "1 medium egg, beaten", "3 tbsp breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the carrots in the bottom of a medium-sized baking dish. Add the butter and a pinch of the garlic.", "Sprinkle over some of the grated emmental.", "Layer the swede over, and add a couple more knobs of butter, and a little more garlic. Repeat with the parsnips, and finally the potato.", "Sprinkle over the remaining cheese.", "Mix together the milk, cream and egg, and pour evenly over the vegetables.", "Top with the breadcrumbs and bake the gratin in a preheated oven 190C/375F/Gas 5 for 45 minutes.", "Serve."]}, {"isVegetarian": true, "title": "Homemade lemonade", "url": "www_bbc_co_uk_food_recipes_chefshomemadelemonad_74839", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chefshomemadelemonad_74839_16x9.jpg", "ingredients": ["100g/3½ oz fruit sugar", "4 lemons, preferably Sicilian, juice only", "ice", "about 1 litre/15¼fl oz sparkling mineral water"], "serves": "Makes 1 litre", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the sugar and lemon juice in a jug. ", "Add some ice and top up with the mineral water.  ", "Stir to combine."]}, {"isVegetarian": false, "title": "Chelsea buns", "url": "www_bbc_co_uk_food_recipes_chelsea_buns_01576", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chelsea_buns_01576_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "1 tsp salt", "1 x 7g sachet fast-acting yeast", "300ml/10fl oz milk", "40g/1½oz unsalted butter, plus extra for greasing the tin", "1 free-range egg", "vegetable oil, for greasing", "25g/1oz unsalted butter, melted", "1 orange, zest only, grated", "75g/2½oz soft brown sugar", "2 tsp ground cinnamon", "100g/3½oz dried cranberries", "100g/3½oz sultanas", "100g/3½oz dried apricots, chopped", "1 heaped tbsp apricot jam", "200g/7oz icing sugar, sifted", "1 orange, zest only, grated"], "serves": "Makes 10 buns", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place the flour and salt into a large mixing bowl and stir until thoroughly combined. Make a well in the centre of the flour and pour in the yeast. ", "Warm the milk and butter in a small saucepan until the butter is melted and the mixture is lukewarm. Pour into the flour mixture, add the egg and stir thoroughly until the contents of the bowl come together as a soft dough.", "Tip the dough onto a lightly floured work surface and knead well for five minutes, until the dough is smooth and elastic.", "Place the dough into an oiled bowl and leave to rise, covered with a damp tea towel, for one hour or until doubled in size. ", "Tip the dough out onto a lightly floured work surface. Roll out dough into a rectangle about 30x20cm/12x8in.", "Brush all over with the melted butter. Evenly sprinkle the orange zest over the buttered surface, followed by the sugar, cinnamon and dried fruit.", "Tack down the long side of the dough rectangle nearest to you by pressing it down onto the work surface with your thumb. Roll the opposite long side of the dough towards you quite tightly, until the roll is complete and tight. With a sharp knife cut into thick rounds - about 4cm/1¾in.", "Grease a deep roasting tin or baking tray thoroughly with butter.", "Place the buns, cut side up, into the greased baking tray leaving about 1cm/½in of space between each one. You want them to be close enough so that when they rise further and then bake, they will bake with their sides touching.  They can then be pulled apart and you get a lovely soft edge.", "Leave to rise for about 30 minutes in a warm place. ", "Preheat oven to 190C/375F/Gas 5. ", "When the buns are ready, put them in the oven and bake for 20-25 minutes until golden-brown. Check after 15 minutes or so and cover the buns with foil if they are getting too brown.", "Remove the buns from the oven and let them cool slightly before transferring them from the tin to a cooling rack.", "Melt the jam in a small saucepan with a splash of water until smooth. Brush the jam over the buns to glaze and allow to cool. ", "Mix together the icing sugar, orange zest and two tablespoons water. Drizzle the icing over the cooled buns and allow to set before serving."]}, {"isVegetarian": true, "title": "Chelsea buns", "url": "www_bbc_co_uk_food_recipes_chelsea_buns_95015", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chelsea_buns_95015_16x9.jpg", "ingredients": ["500g/1lb strong white flour, plus extra for dusting", "1tsp salt", "1 x 7g/¼oz sachet fact-action dried yeast", "300ml/10fl oz milk", "40g/1½oz unsalted butter, softened at room temperature", "1 free-range egg", "vegetable oil, for greasing", "25g/1oz unsalted butter, melted", "75g/3oz soft brown sugar", "2 tsp ground cinnamon", "150g/5oz dried mixed fruit", "2 tbsp milk", "2 tbsp caster sugar"], "serves": "Makes 10 buns", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sift the flour and salt into a large bowl. Make a well in the middle and add the yeast.", "Meanwhile, warm the milk and butter in a saucepan until the butter melts and the mixture is lukewarm.", "Add the milk mixture and egg to the flour mixture and stir until the contents of the bowl come together as a soft dough. (You may need to add a little extra flour.)", "Tip the dough onto a generously floured work surface. Knead for five minutes, adding more flour if necessary, until the dough is smooth and elastic and no longer feels sticky.", "Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size. ", "Lightly grease a baking tray.", "For the filling, knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a rectangle 0.5cm/¼in thick. Brush all over with the melted butter, then sprinkle over the brown sugar, cinnamon and dried fruit.", "Roll the dough up into a tight cylinder , cut ten 4cm/1½in slice and place them onto a lightly greased baking sheet, leaving a little space between each slice. Cover with a tea towel and set aside to rise for 30 minutes. ", "Preheat oven to 190C/375F/Gas 5.", "Bake the buns in the oven for 20-25 minutes, or until risen and golden-brown. ", "Meanwhile, for the glaze, heat the milk and sugar in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes. ", "Remove the buns from the oven and brush with the glaze, then set aside to cool on a wire rack."]}, {"isVegetarian": true, "title": "Chelsea bunski", "url": "www_bbc_co_uk_food_recipes_chelsea_bunski_61653", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Bun dough:", "45g/1½oz fresh yeast ", "300-400ml/10-14fl oz lukewarm water", "825g/1lb 13oz strong white flour", "65g/2¼oz caster sugar", "¾ tsp fine salt", "160g/5¾oz butter", "2 free-range eggs, whisked", "270g/9½oz black poppy seeds", "500ml/18fl oz full-fat milk", "190g/6¾oz caster sugar", "1 large orange, zest only", "100g/3½oz golden raisins", "1 lemon, zest and juice", "1 tbsp brandy", "1 tbsp orange liqueur", "20g/¾oz butter", "1 tbsp vanilla extract", "200g/7oz butter, melted, plus extra for brushing ", "30g/1oz water", "30g/1oz full-fat milk", "60g/2¼oz caster sugar"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the bun dough, dissolve the yeast in 200ml/7fl oz of the lukewarm water. ", "Sieve the flour, sugar and salt into a large bowl. Rub in the butter. ", "Add the whisked eggs and the yeast mixture and enough additional water to make fairly soft dough. ", "Cover and leave to rest for 10 minutes. ", "Turn out onto a floured surface. Knead well, about 5-10 minutes, until the dough becomes firm and springy. ", "Put the dough into an oiled bowl, cover with cling film and leave to rise until it doubles in size – up to an hour. ", "Turn out onto surface and knead for 2-3 minutes. Leave to rest for five minutes. ", "For the poppy seed filling, grind the seeds in a coffee or nut grinder. ", "Heat the milk, sugar, orange zest, ground poppy seeds and raisins in a small saucepan over medium heat. Cook gently until the seeds absorb the milk, and the mixture thickens to spreadable consistency - about 15 minutes. ", "Add the lemon juice, brandy, orange liqueur and butter and cook for another two minutes. ", "Finally, add the vanilla and stir to combine. Remove from heat and turn out onto a medium-sized tray to speed up cooling. You can also be put in the fridge if necessary. ", "While the dough is proving, grease and sugar a 13 x 10in/33 x 25cm, deep sided tin. ", "Preheat oven to 200C/400F/Gas 6.", "Roll out the dough to a 26 x 40cm/10½ x 16in rectangle. Brush the surface with melted butter and spread the poppy seed filling evenly over this, leaving a 2.5cm/1in border all the way round. Roll the long side of the dough forward into a fairly tight roll. ", "Moisten the farthest edge of the dough with water, and press the roll of dough onto it to form a seal. ", "Brush the log with melted butter. ", "Cut off about 2.5cm/1in at either end for neatness, and slice the log into 12 equal portions. ", "Place each bun cut-side down in the prepared tin, leaving a small gap between each one to allow for expansion. ", "Brush each bun with egg wash, cover with tea towel and set aside to prove for 30 minutes. ", "When the buns have proved, bake in the pre-heated oven, on the middle shelf, for 18-20 minutes. ", "Meanwhile, place the ingredients for the bun wash together in a pan and bring up to the boil. Boil for 3-4 minutes to create syrup.  Keep hot.", "Remove the Chelsea buns from the oven and brush immediately with the bun wash. ", "After five minutes, turn the buns out onto a cooling rack and separate each one.  Allow the buns to cool a little then serve."]}, {"isVegetarian": true, "title": "Chermoula tofu and roasted vegetables", "url": "www_bbc_co_uk_food_recipes_chermoula_tofu_and_24910", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chermoula_tofu_and_24910_16x9.jpg", "ingredients": ["25g/1oz coriander, finely chopped", "3 garlic cloves, chopped", "1 tsp cumin seeds, lightly crushed", "1 lemon, finely grated rind", "½ tsp dried crushed chillies", "1 tbsp olive oil", "250g/9oz tofu", "2 red onions, quartered", "2 courgettes, thickly sliced", "2 red peppers, deseeded and sliced", "2 yellow peppers, deseeded and sliced", "1 small aubergine, thickly sliced", "low-calorie cooking spray", "pinch salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/ Gas 6. ", "For the chermoula, mix the coriander, garlic, cumin, lemon rind and chillies together with the oil and a little salt in a small bowl.", "Pat the tofu dry on kitchen paper and cut it in half. Cut each half horizontally into thin slices. Spread the chermoula generously over the slices.", "Scatter the vegetables in a roasting tin and spray with oil. Bake for about 45 minutes, until lightly browned, turning the ingredients once or twice during cooking.", "Arrange the tofu slices over the vegetables, with the side spread with the chermoula uppermost, and bake for a further 10-15 minutes, or until the tofu is lightly coloured. ", "Divide the tofu and vegetables between four plates and serve. "]}, {"isVegetarian": false, "title": "Chermoula-baked sea bass with quinoa, tomatillo and preserved lemon salad, spiced toasted seeds and tahini cream", "url": "www_bbc_co_uk_food_recipes_chermoulabakedseabas_93826", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50ml/2fl oz olive oil", "1 red onion, peeled, sliced", "¼ tsp sweet smoked paprika", "20ml/¾fl oz sherry vinegar", "100g/3½oz quinoa (uncooked weight), cooked according to packet instructions", "2 medium tomatillos, diced", "1 tbsp preserved lemon rind, pulp removed, finely diced", "4 tbsp chopped fresh coriander, plus extra whole leaves, to serve", "2 tbsp finely chopped fresh mint leaves", "1 lime, juice only", "100ml/3½fl oz olive oil", "handful fresh curry leaves", "2 tsp fennel seeds", "2 tsp poppy seeds", "1 tsp kalonji (black onion) seeds or nigella seeds", "1 tsp black mustard seeds", "200g/7oz sunflower seeds", "200g/7oz pumpkin seeds", "1 tbsp amchur (dried, ground, unripe mango)", "1 tsp salt", "2 x 250-300g/9-10½oz sea bass fillets, skin on", "1 tbsp cumin seeds, toasted, ground", "1 tsp coriander seeds, toasted, ground", "1½ tsp sweet smoked paprika", "½ tsp dried chilli flakes", "1 tbsp fresh root ginger, peeled, crushed to a paste", "1 tbsp fresh turmeric, peeled, crushed to a paste", "2 garlic cloves, peeled, crushed", "1 banana shallot, peeled, finely chopped", "2 lemons, zest and juice", "3 tbsp flatleaf parsley leaves, finely chopped", "5 tbsp fresh coriander, finely chopped", "1 tsp salt", "100ml/3½fl oz extra virgin olive oil", "1 tbsp olive oil", "125ml/4½fl oz tahini", "1½ lemons, juice only", "125ml/4½fl oz water", "salt, to taste", "50g/2oz mustard, sorrel or watercress leaves", "drizzle extra virgin olive oil", "1 lime, cut into wedges"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the quinoa, tomatillo and preserved lemon salad, heat a frying pan over a medium to high heat. Add the olive oil and fry the red onion slices for 5-10 minutes, or until the onion slices have caramelised.", "Add the smoked paprika and sherry vinegar, stir well and fry until the liquid has evaporated.", "Mix together the remaining salad ingredients in a bowl, then add the frying pan contents and stir until well combined. Set aside.", "Meanwhile, for the toasted seeds, heat a frying pan over a medium heat. Add the olive oil, then fry the curry leaves for a few seconds until fragrant. ", "Add all of the seeds and stir continuously until well combined and coated in the oil, shaking the pan regularly. Fry for 4-5 minutes, or until the seeds are golden-brown and toasted, then remove the pan from the heat.", "Add the amchur and salt, to taste, and stir well. Set aside and keep warm.", "For the chermoula-baked sea bass, place the sea bass fillets into a medium-sized glass bowl. Add all of the remaining chermoula-baked sea bass ingredients except the olive oil, mix until well combined, then set aside to marinate for 30 minutes.", "When the sea bass has marinated, shake any excess marinade from the sea bass fillets. Heat an ovenproof frying pan over a medium heat, add the olive oil, then add the sea bass fillets and fry for 1-2 minutes on each side, or until browned on both sides. Transfer to the oven and continue to cook for 4-6 minutes, or until cooked through (the sea bass is cooked through when the flesh is opaque).", "Meanwhile, for the tahini cream, whisk all of the tahini cream ingredients in a bowl for 2 minutes, or until smooth. Season, to taste, with salt.", "Just before serving, mix half of the toasted seeds into the quinoa, tomatillo and preserved lemon salad until combined.", "To serve, divide the quinoa, tomatillo and preserved lemon salad equally among four to six serving plates. Divide the chermoula-baked sea bass fillets among the servings. Sprinkle over the remaining toasted seeds. Drizzle the tahini cream and a little extra virgin olive oil around the edge of the plates. Place two lime wedges alongside each serving."]}, {"isVegetarian": true, "title": "Cherry, almond and nutmeg tarts", "url": "www_bbc_co_uk_food_recipes_cherry_almond_and_nutmeg_81144", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_almond_and_nutmeg_81144_16x9.jpg", "ingredients": ["icing sugar, for dusting (approx. 20g/¾oz)", "500g/1lb 2oz shortcrust pastry", "150g/5½oz cherry jam", "½ tsp ground nutmeg", "1 free-range egg, lightly beaten", "100g/3½oz icing sugar, sifted", "¼ tsp almond extract", "20g/¾oz toasted flaked almonds"], "serves": "Makes 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line two large baking trays with baking paper. ", "Dust a work surface with icing sugar and roll out the pastry to a 30x35cm/12x14in rectangle. Place the pastry on one of the prepared baking trays and cut right down the middle lengthways, giving you two long equal rectangles. Now make three cuts widthways to give you eight equal rectangles. Place in the fridge.", "Put the jam in a bowl, add the nutmeg and mix. Add 1 teaspoon of jam to one side of each pastry piece, avoiding the edges. Brush the edges with the beaten egg and fold over the other half of the pastry. Press down the edges with a blunt knife to seal. This is crucial unless you enjoy flowing molten lava jam!", "Do the same with the remaining seven pastries and place on the other prepared baking tray. Brush the tops with the egg and place in the fridge for 20 minutes. ", "Bake the pastries on the middle shelf of the oven for 20–25 minutes. Place on a wire rack to cool.", "For the almond icing, put the icing sugar, 1½ tablespoons of water and the almond extract in a bowl and mix to a smooth paste. Cover the tops of the cooled pastries with the icing and sprinkle with the almonds."]}, {"isVegetarian": true, "title": "Cherry and chocolate gateau", "url": "www_bbc_co_uk_food_recipes_cherry_and_chocolate_17711", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 free-range eggs", "150g/5½oz caster sugar", "25g/1oz butter, melted, plus extra for greasing the tins", "115g/4oz plain flour", "40g/1½oz cocoa powder, sifted", "400ml/14fl oz double cream", "3 tbsp kirsch", "2 tbsp icing sugar", "200g/7oz cherry jam", "250g/9oz caster sugar", "5 free-range eggs, whites only", "squeeze lemon juice", "150g/5½oz butter, softened", "150g/5½oz dark chocolate, melted", "8 fresh cherries, stalks on", "4 tbsp chocolate sprinkles"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Lightly grease and line the bases of two 23cm/9in cake tins.", "Place the eggs, sugar and melted butter into a bowl and whisk for 4-5 minutes, until thickened and very pale – when the whisk is lifted out of the bowl, a trail should be left behind.", "Sift in the flour and cocoa powder and fold in gently.", "Spoon the mixture into the two cake tins, dividing evenly, then tap to settle.", "Place the tins on a baking sheet in the oven for 12-15 minutes until risen and just firm to the touch – you do not want to overcook a genoise sponge, as it will become dry.", "Remove from the oven and cool briefly before tipping out onto a rack to cool completely.", "For the filling, whip the cream to soft peaks and fold in the kirsch and icing sugar. ", "For the topping, place the sugar with 125ml/4fl oz water into a pan and slowly bring to the boil until the syrup reaches 121C/250F on a sugar thermometer, then remove the pan from the heat. ", "Meanwhile, place the egg whites into a clean bowl with a squeeze of lemon juice, and whisk until firm peaks form.", "With the beater at its lowest speed, pour in the sugar syrup, in a steady stream, making sure it is clear of the beaters. ", "Continue beating for about five minutes, until the meringue is tepid. ", "Add the butter and continue to beat until it is all incorporated. Then beat in the chocolate and make sure it is all incorporated.", "To serve, cut the sponges in half horizontally so that you have four thin layers of sponge.", "Place one piece of sponge onto the serving plate and spread over a third of the cherry jam, then a third of the kirsch cream.", "Repeat with the other sponges and remaining jam and cream until you have a stack of four sponges with three layers of jam and cream.", "Spread the chocolate topping over the gateau to cover completely.", "Decorate with the fresh cherries and chocolate sprinkles."]}, {"isVegetarian": true, "title": "Cherry and ginger florentines", "url": "www_bbc_co_uk_food_recipes_cherry_and_ginger_69469", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_and_ginger_69469_16x9.jpg", "ingredients": ["25g/1oz butter", "75g/2½oz caster sugar", "1 tbsp plain flour", "75ml/2½fl oz double cream", "50g/1¾oz flaked almonds, lightly toasted", "50g/1¾oz cut mixed peel", "2 tbsp stem ginger, finely chopped", "1 orange, zest only", "25g/1oz glace cherries, chopped", "100g/3½oz dark chocolate"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Place the butter into a medium saucepan over a medium heat. Once melted, add the sugar and flour and whisk continuously until everything is combined and you have a smooth pale paste. Pour in the cream, stirring as you pour until completely incorporated. The mixture should be smooth.", "Turn off the heat, add the almonds, mixed peel, stem ginger, orange zest and cherries. Mix with a wooden spoon until combined and set aside to cool.", "Line a baking tray with parchment paper and place teaspoons of the florentine mixture onto the tray, allowing 3cm/1¼in between them as they will spread during cooking. You may need to do this in batches, or use two trays.", "Place the tray into the oven and bake for 12-15 minutes, or until golden-brown. Remove from the oven and allow to cool for two minutes before quickly transferring to a wire cooling rack to cool completely.", "While the florentines are cooling, melt the chocolate in a heatproof bowl set over a pan of simmering water. (Make sure that the base of the bowl does not touch the water.)", "Drizzle the cooled florentines with the melted chocolate. Allow to set then serve. Or store in an airtight container for up to three days."]}, {"isVegetarian": true, "title": "Cherry Bakewell cupcakes", "url": "www_bbc_co_uk_food_recipes_cherry_bakewell_cupcakes_24953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_bakewell_cupcakes_24953_16x9.jpg", "ingredients": ["150g/5½oz margarine", "150g/5½oz caster sugar", "100g/3½oz self-raising flour", "3 free-range eggs, at room temperature", "1 tsp baking powder", "60g/2¼oz ground almonds", "1 tbsp milk", "90g/3¼oz raspberry jam", "250g/9oz icing sugar", "3 tbsp fresh lemon juice", "12 un-dyed glacé cherries "], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a 12-hole muffin tin with paper cases.", "For the cupcakes, cream the margarine in a bowl until light and fluffy. Add the remaining ingredients, except the raspberry jam, and mix until well combined.", "Spoon the mixture into the cases and bake for 15-20 minutes, or until risen and golden-brown and a skewer inserted into the middle comes out clean. Remove from the oven and set aside to cool for 10 minutes.", "For the icing, mix the icing sugar and lemon juice together in a bowl until smooth. ", "Using an apple corer, carefully remove the middle of the cupcakes. Fill the holes with the raspberry jam.", "Carefully spoon the icing onto the top of each cake until the icing reaches the sides of the cake case and top with a cherry."]}, {"isVegetarian": true, "title": "Cherry chapel hat pegs", "url": "www_bbc_co_uk_food_recipes_cherry_chapel_hat_pegs_61298", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_chapel_hat_pegs_61298_16x9.jpg", "ingredients": ["1 jar maraschino cherries", "about ¼ bottle kirsch cherry liqueur, for soaking the cherries", "450g/1lb dark chocolate, broken into small pieces", "200ml/7fl oz double cream", "25g/1oz unsalted butter", "edible gold paint (optional)"], "serves": "Makes 20 chocolates", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["A week before you want to cook, start soaking the cherries. Empty the liquid out of the cherry jar and fill it right to the top with kirsch instead. Put the lid back on and leave it in the fridge. ", "After a week, drain the cherries, reserving the kirsch liquid. ", "Line a 40x35cm/16x14in baking tray with baking parchment.", "Put 200g/7oz of the broken chocolate into a bowl.", "Heat the cream and butter in a saucepan until simmering, without letting it boil. Be careful it does not burn or catch on the bottom of the pan. ", "Take the pan off the heat, pour the mixture over the chocolate and give it a brisk stir. Set aside, but check it to make sure that all the chocolate has melted. Give it a stir to help it along if need be. Add two tablespoons of the reserved kirsch and stir.", "Cool the mixture for approximately an hour, or until a teaspoonful will hold its shape. Put small spoonfuls of mixture (about the size of a pound coin) onto the baking tray. Once you have 20, go back and put another spoonful of mixture on top of the original. Try to make them quite tall.", "Place a cherry on top of each pile, pressing it down slightly. Place in the fridge to cool for 15 minutes.", "Temper the remaining chocolate. Put the chocolate into a bowl set over a pan of simmering water. Don’t let the bowl touch the water or the chocolate will burn and don’t let any water into the chocolate or the chocolate will seize. Put a chocolate thermometer in the bowl and bring the chocolate up to 42C/107F, then take off the heat and cool to 32C/90F.", "Using two forks, carefully dip each cherry chocolate mound in the melted dark chocolate until coated all over. Place onto the lined baking tray. Leave the coated hat pegs in a cool place to cool completely and set.", "Dot the top of each one with a twinkle of edible gold paint (if desired)."]}, {"isVegetarian": true, "title": "Cherry Bakewell fondant fancies", "url": "www_bbc_co_uk_food_recipes_cherry_bakewell_fondant_20118", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_bakewell_fondant_20118_16x9.jpg", "ingredients": ["100g/3½oz ground almonds", "50g/1¾oz caster sugar", "50g/1¾oz icing sugar, sifted, plus extra if the mixture is too wet and to dust", "1 free-range egg", "½ tsp almond extract ", "75g/2½oz unsalted butter, melted, plus extra for greasing tin", "5 free-range eggs, at room temperature", "1 tsp almond extract", "1 unwaxed lemon, finely grated zest only", "150g/5½oz golden caster sugar", "150g/5½oz plain flour ", "1kg/2lb 4oz ready-made white fondant icing", "1 lemon, juice only ", "violet food colour gel", "150g/5½oz unsalted butter, softened", "225g/8oz icing sugar, sifted", "15g/½oz ground almonds", "1 tsp almond extract", "violet food colour gel", "100g/3½oz black cherry conserve", "1 tbsp almond liqueur ", "200g/7oz fresh cherries, stones removed, halved ", "edible glitter (optional) "], "serves": "Makes 25 fondant fancies", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the marzipan, combine the almonds, caster sugar and icing sugar in a large bowl. Create a well in the middle and add the egg and almond extract. Stir until just combined. Knead briefly until the marzipan is smooth, adding more icing sugar if the mixture is too wet. Wrap in cling film and put in the fridge until needed.", "For the sponge, Preheat the oven to 180C/160C fan/Gas 4. Grease and line a 23cm/9in square deep baking tin with butter and baking paper. ", "In the bowl of a freestanding mixer fitted with the whisk attachment, add the eggs, almond extract, lemon zest and sugar. Beat on a high speed for 7–10 minutes, or until the mixture is thick, smooth and trebled in size and the whisk leaves trails which sit on the surface of the mixture when lifted out.", "Sift a third of the flour over the surface and very gently fold into the mixture using a large metal spoon until combined. Repeat this process once more, then pour in the cooled, melted butter around the rim of the bowl and fold in with the last third of flour. Make sure the butter and flour are completely folded in, but be careful to keep as much air in the mixture as possible.", "Pour the mixture into the prepared tin and bake for 30 minutes until golden-brown and coming away from the edges. Allow to cool in the tin for 5 minutes before transferring to a cooling rack to cool completely. Wrap in cling film and place in the freezer.", "For the fondant icing, tear the fondant into small pieces into the bowl of a freestanding mixer fitted with a paddle attachment. Add 100ml/3½fl oz water and the lemon juice gradually (you might not need it all) beating on medium speed until a thick pourable consistency. Add a drop of colour to the fondant, mixing thoroughly, until it is a pale lilac colour. Transfer to a bowl, cover with cling film and set aside.", "For the almond buttercream, beat the butter in a freestanding mixer fitted with a paddle attachment until smooth. Gradually add the icing sugar and almonds and beat until light and smooth. Add the almond extract, to taste. Cover and leave in a cool place.", "For the filling, mix the cherry conserve with the almond liqueur. ", "Remove the sponge from the freezer and carefully trim the edges to straighten. Measure the cake and mark out a grid of 5 equal columns and rows on the surface of the cake (which will be cut later to make 25 squares of cake). Using a small knife, cut out a dip in the middle of each square – but be careful not to cut through to the bottom. Fill each hole with a little cherry conserve.", "On a surface dusted with icing sugar, roll out the marzipan to a square slightly larger than the cake and drape over, trimming the edges so it covers the top neatly. Place in the freezer for 10 minutes to set. Re-measure the 5 x 5 grid as before and cut the cake into individual fancies using a serrated knife.", "Using a palette knife smooth a crumb coat of buttercream around the sides of each sponge. Place in the freezer to chill for a minute. You may want to do a second coat to make very neat edges. ", "Place a large cooling rack over a sheet of newspaper. Dip the chilled cakes into the lilac fondant to cover the sponges. Set the fondants onto the rack to drip dry. ", "Place the remaining buttercream in a piping bag fitted with a medium star nozzle. Once the fondant is slightly set, pipe a small swirl of buttercream on top of each fondant fancy. Place half a fresh cherry on top of each swirl. Sprinkle each cherry with a little glitter, if using. "]}, {"isVegetarian": true, "title": "Cherry clafoutis", "url": "www_bbc_co_uk_food_recipes_cherry_clafoutis_18623", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherry_clafoutis_18623_16x9.jpg", "ingredients": ["450g/1lb ripe cherries, the best you can find, stones removed", "3 tbsp caster sugar, plus extra for sprinkling", "3 tbsp kirsch (optional)", "20g/¾oz unsalted butter, plus extra for greasing", "2 free-range eggs", "3 tbsp caster sugar, plus extra for sprinkling", "½ tsp vanilla extract", "1 heaped tbsp plain flour", "50g/1¾fl oz whole milk", "75g/2¼fl oz whipping cream", "pinch sea salt"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Gently mix together the cherries, sugar and kirsch and leave to macerate for two hours. (The sugar will slowly permeate the cherries and intensify their flavour.)", "Preheat the oven to 180C/350F/Gas 4. Grease a baking dish with butter and sprinkle with sugar. Shake the sugar around the dish so that it is evenly coated, then tip out any excess.", "For the batter, heat the butter in a small pan until it turns a pale hazelnut colour – this is called a beurre noisette. Do not allow the butter to burn or it will become bitter and carcinogenic. Remove the pan from the heat and set aside in a warm place.", "In a large bowl whisk together the eggs, sugar and vanilla until creamy.", "Add the flour, whisk until smooth, then slowly incorporate the milk, cream, salt and beurre noisette.", "Mix the macerated cherries and their juice into the batter and pour into the prepared baking dish.", "Bake in the oven for 30-35 minutes, or until the top is slightly domed and the blade of a knife inserted in the middle comes out clean. ", "To finish, sprinkle with caster sugar and serve warm. "]}, {"isVegetarian": true, "title": "Cherry clafoutis with vanilla whipped cream", "url": "www_bbc_co_uk_food_recipes_cherry_clafoutis_with_18549", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "75g/2¾oz caster sugar, plus extra for dusting", "40g/1½oz plain flour", "100ml/3½fl oz double cream or crème fraîche", "100ml/3½fl oz milk", "butter, for greasing", "225g/8oz cherries, stoned", "150ml/5fl oz double cream", "25g/1oz icing or caster sugar", "seeds from 1 vanilla pod"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the clafoutis, preheat the oven to 180C/350F/Gas 4. Place the eggs and sugar in a large bowl and whisk together. Sift over the flour and whisk well then stir in cream or crème fraîche and milk. Leave to rest for 10 minutes.", "Lightly butter a large baking dish and sprinkle with sugar to coat. Scatter the cherries in the dish and gently pour over the clafoutis batter. Bake for 20-25 minutes or until the batter is just firm to the touch. If it is too soft in the centre, bake for a further five minutes. Remove from the oven and allow to cool a little before serving.", "Whip together the cream, sugar and vanilla seeds to soft peaks and spoon over the clafoutis."]}, {"isVegetarian": true, "title": "Cherry meringues with cherry compôte and vanilla cream", "url": "www_bbc_co_uk_food_recipes_cherry_meringues_with_51276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz caster sugar", "310g/11oz ripe cherries, stones removed", "3 free-range egg whites", "90g/3¼oz caster sugar", "90g/3¼oz icing sugar, sieved", "400ml/14fl oz double cream", "1 vanilla pod, seeds only", "500g/1lb 2oz dark cherries, pitted", "500g/1lb 2oz jam sugar", "2 lemons, juice only"], "serves": "Makes 2 very large merigue sandwiches", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cherry meringues, place the sugar and 150ml/5½fl oz water in a pan and boil until the sugar has dissolved and a syrup forms. Add the cherries to the boiling syrup and poach for 1-2 minutes (depending on how ripe the cherries are), or until soft. Transfer to a bowl to cool.", "Preheat the oven to 110C/225F/Gas ¼ and line a baking tray with baking parchment.", "In a clean bowl, beat the egg whites with the caster sugar until stiff peaks form when the whisk is removed. Add the icing sugar and continue to beat for 4-6 minutes, or until the mixture is smooth and shiny. ", "Drain the cherries onto kitchen paper to remove as much syrup as possible. Using a large metal spoon, gently fold the cherries into the meringue mixture. Using another large spoon, scoop out a large spoonful of the meringue and shape into a quenelle (rugby ball shape)  and place it onto the lined baking tray. Repeat the process to make three more large meringues. Cook in the oven for two hours.", "Once cooked, remove from the oven and allow to cool slightly. Then use a palette knife to remove the meringues from the baking tray. Transfer to a cooling rack to cool completely.", "For the cherry compôte, place the cherries, sugar and lemon juice in a large saucepan and cook for 5-6 minutes.", "To finish the cherry meringues, place the cream and vanilla seeds in a large bowl and whip until stiff peaks form when the whisk is removed.", "Once the meringues have cooled, place some cream on the flat side and sandwich another half meringue on the other side.", "Place the sandwiched cherry meringues on a serving plate and serve with the cherry compote."]}, {"isVegetarian": false, "title": "Cherry pork with spicy bacon broccoli and sweet potato brown rice", "url": "www_bbc_co_uk_food_recipes_cherry_pork_with_spicy_20767", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large piece pork belly (about 500g/1lb 2oz)", "300g/10½oz red rock sugar (available from specialist Chinese groceries)", "2 tbsp vegetable oil", "2 tbsp dark soy sauce", "300g/10½oz brown rice ", "400g/14oz sweet potatoes, unpeeled, cut into 1.5cm/¾in chunks", "150g/5½oz fresh or frozen cranberries", "50ml/2fl oz orange juice", "2 tbsp groundnut oil", "2 garlic cloves, crushed", "2.5cm/1in fresh root ginger, finely grated ", "2 whole dried red chillies, torn ", "180g/6oz smoky bacon lardons, finely diced  ", "2 tbsp Shaoxing rice wine, or dry sherry", "1 large red carrot, sliced in quarters lengthwise, then cut into 5cm/2in pieces at an angle ", "200g/7oz Tenderstem broccoli, cut into 2.5cm/1in pieces", "2 tbsp Chinkiang black rice vinegar ", "1 tbsp low sodium light soy sauce"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cherry pork, in a large pan of water boil the pork for 30 minutes, then drain and allow to cool. Slice into 2.5cm/1in pieces.", "Place the red rock sugar in a pan with about 1 litre/1¾ pints water and cook over a high heat until reduced in volume to a red–brown caramel syrup.", "Heat a wok over a high heat and add the vegetable oil. Add the pork pieces, dark soy sauce and red rock sugar syrup and stir fry on a medium heat for one minute, or until browned, stirring constantly so the sugar does not caramelise.", "Pour in 1 litre/1¾ pints boiling water, cover the wok and simmer for two hours on a medium hear, or until the pork is tender. ", "For the sweet potato brown rice, wash the rice well until the water runs clear. Add to a pan with 700ml/1¼pints water and the sweet potato chunks. Bring to the boil. Once boiled, reduce the heat to a simmer and place a lid on the pan. Cook on a low heat for another 20-25 minutes, or until all the water has evaporated, the sweet potato is tender and the rice cooked. While the rice is cooking make the cranberry sauce and spicy broccoli. ", "For the cranberry sauce, place the cranberries and orange juice in a saucepan and bring to a boil and turn down and simmer for 5-8 minutes.", "For the spicy broccoli, heat a wok over high heat and add the groundnut oil. Add the garlic and ginger, then the dried chilli pieces, and toss for a few seconds. Then quickly add the bacon lardons and stir-fry for one minute until browned. ", "Add the Shaoxing rice wine or dry sherry. Then add the carrot and Tenderstem broccoli pieces and cook tossing for one minute. Season with Chinkiang black rice vinegar. Cook for one more minute until the vegetables are crisp then add the light soy sauce.", "Five minutes before serving stir the cranberry sauce into the pork. Remove the sweet potato rice from the heat, fluff the rice and serve immediately."]}, {"isVegetarian": true, "title": "Cherry slice", "url": "www_bbc_co_uk_food_recipes_cherry_slice_34744", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz puff pastry", "450g/1lb fresh cherries, halved and stoned", "1 orange, zest only", "4 tbsp cherry brandy", "1 tbsp clear honey", "1 tsp cornflour, to thicken", "570ml/1 pint double cream, whipped", "icing sugar, to dust"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a baking tray with parchment and have another tray and sheet of parchment ready.", "Roll out the pastry to 5mm/1/4-inch thick and cut to fit the lined baking tray. Prick it all over with a fork. You need enough cooked pastry from which to be able to cut three 15x15cm/6x6in squares.", "Place the pastry on the lined tray. Put another piece of parchment on top and put the second tray on top of that.", "Bake for 20 minutes, or until golden-brown. Leave to cool, then trim into three even squares.", "To make the cherry compôte, put the cherries in a pan with the orange zest, cherry brandy and honey. Bring to the boil, then reduce the heat and simmer for about five minutes, until the cherries have softened but still hold their shape. Strain the juices off and return these to the pan. Set the cherries aside.", "Mix the cornflour with a little water to make a runny paste, then add to the liquid in the pan. Whisk over a high heat until the liquid thickens. Return the cherries to the pan and mix. Leave to cool.", "When you are ready to assemble the cake, whip the cream until firm peaks form when the whisk is lifted. Put out four tablespoons in a bowl for later.", "Gently fold two-thirds of the cherry compôte into the cream. Place one of the pastry squares on a board. Top with half of the cherry cream mix. Put a second pastry square on top, then the other half of the mix, then top with the last pastry sheet. Chill in the fridge for at least an hour to set.", "To serve, place the cake on a serving plate. Cover the sides of the cake with the remaining cream. Dredge the top with icing sugar. Carefully heat a skewer in a gas flame, then scorch a line across the surface of the cake, repeating to create a criss-cross pattern. Decorate with the remaining compôte."]}]