[{"ingredients": ["2 cucharadas de aceite de oliva", "1 filete de lubina, despellejado", "1 cucharada de aceite de oliva", "1 cucharadita de vinagre balsámico", "sal y pimienta negra recién molida", "1 tomate, semillas retiradas y picadas", "100 g / 3½ oz de judías verdes, recortadas, blanqueadas y escurridas"], "method": ["Para la lubina, caliente el aceite en una sartén a fuego medio y cocine la lubina durante 2-3 minutos en cada lado, o hasta que esté bien cocida.", "Para la vierge salsa de judías verdes, coloque el aceite y el vinagre en un recipiente, sazone con sal y pimienta negra recién molida y mezcle bien. Agregue el tomate picado y revuelva.", "Para servir, coloque los frijoles en un plato para servir y vierta sobre el aderezo. Coloque la lubina al lado."], "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithg_85746", "title": "Lubina frita con salsa de judías verdes vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Papas Royal Jersey de 300g / 10½oz (o papas nuevas similares), restregadas", "4 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 filetes de lubina", "150g / 5oz de berros, solo hojas", "3 cucharadas de perejil de flatleaf fresco picado", "2 cebollas grandes de primavera, más o menos picadas", "1 diente de ajo, aproximadamente picado", "1 limón, ralladura solamente", "2 cucharadas de alcaparras, enjuagadas y escurridas", "2 cucharadas de pan rallado", "3 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Coloque las papas en una olla de agua y deje que hiervan. Cocine por 8-10 minutos, hasta que las papas estén tiernas. Escurrir, volver a la sartén y agregar dos cucharadas de aceite de oliva, y sazonar bien con sal y pimienta negra recién molida. Mezcle bien para combinar.", "Sazone los filetes de lubina con pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente, agregar las dos cucharadas restantes de aceite de oliva y los filetes de lubina. Cocine a cada lado durante 2-3 minutos, hasta que esté cocido. Retire de la sartén y deje reposar durante dos minutos.", "Para el berro salsa verde, ponga a hervir un pequeño sartén limpio de agua salada. Agregue el berro y cocine por un minuto. Escurrir y refrescar el berro en agua helada.", "Transfiera el berro a un procesador de alimentos y agregue los ingredientes restantes y procese a un puré. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque cantidades iguales de papas en cada plato. Coloque un filete de lubina al lado y sirva con una cucharada de salsa verde."], "url": "www_bbc_co_uk_food_recipes_panfriedseabasswithj_89323", "title": "Lubina frita con Jersey Royals y berro salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de mantequilla sin sal, más un poco más", "½ cebolla, picada", "1 apio en barra, picado", "pizca de sal", "Leche 250ml / 9fl oz", "algunas gotas de caldo de pollo concentrado", "250ml / 9fl oz de agua", "300 g / 11 oz de apionabos, pelados y picados", "pizca de pimienta blanca molida", "50 g / 2 oz de mantequilla, más un poco más", "3 chalotes, 2 rebanadas, 1 finamente picado", "pizca de sal", "50g / 2 oz champiñones, en rodajas", "2 ramitas de tomillo fresco", "110 ml / 4 fl oz oz madeira", "150ml / 6fl oz de caldo de pollo caliente", "Crema doble 150ml / 6fl oz", "sal y pimienta negra recién molida", "125g / 5oz de setas silvestres mezcladas", "25g / 1oz de mantequilla", "20 chalotes, pelados y blanqueados", "sal y pimienta negra recién molida", "2 cucharadas de vinagre de jerez", "4 filetes de solomillo de x 200-250g / 7-9oz", "sal y pimienta negra recién molida", "25 g / 1 oz de mantequilla sin sal, más un poco más", "1 cucharada de aceite vegetal", "botón de mantequilla", "200g / 7oz de hojas de espinaca baby", "sal y pimienta negra recién molida"], "method": ["Para el puré de apio nabo, caliente una olla y agregue la mantequilla, la cebolla, el apio y la sal. Freír suavemente durante 2-3 minutos.", "Agregue la leche, el caldo de pollo y el agua, luego el apio nabo y la pimienta blanca. Llevar a ebullición, luego reducir a fuego lento y cocinar durante 30 minutos.", "Retirar del fuego y dejar enfriar ligeramente. Presione la mezcla a través de un colador en un recipiente y bata bien hasta que quede suave. Transfiera a una licuadora y mezcle hasta obtener un puré muy fino.", "Regrese el puré a la sartén, agregue un poco de mantequilla y pruebe para verificar el condimento. Apartar y mantener caliente.", "Para la salsa de crema de madeira, caliente una sartén, agregue 25 g / 1 oz de la mantequilla, los dos chalotes en rodajas y una pizca de sal y cocine a fuego lento hasta que los chalotes sean transparentes.", "Agregue los champiñones y continúe cocinando hasta que adquieran una textura resbaladiza, luego agregue el tomillo.", "Agregue la madeira y cocine a fuego lento hasta que se reduzca a la mitad.", "Agregue el caldo de pollo y reduzca a la mitad nuevamente, luego agregue la crema y reduzca esto a la mitad.", "Agregue la mantequilla restante, luego pase la mezcla a través de un colador fino en una sartén limpia y sazone con sal y pimienta negra recién molida. Apartar y mantener caliente.", "Para los chalotes asados, caliente la mantequilla en una sartén de base pesada. Agregue los chalotes escaldados y sazone con sal y pimienta negra recién molida. Freír suavemente hasta que las chalotas estén blandas y coloreadas.", "Aumenta un poco el fuego, agrega el vinagre de jerez a la sartén y revuelve con una cuchara de madera, raspando las brocas del fondo de la sartén. Dejar de lado.", "Para los filetes, condimente los filetes a ambos lados con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté muy caliente. Agregue la mantequilla, el aceite vegetal y los filetes y cocínelos durante 2-4 minutos a cada lado, dependiendo de cómo le gusten los filetes cocinados. Retire los filetes de la sartén y déjelos reposar en una bandeja durante unos minutos.", "Vierta el exceso de grasa de la sartén en la que se cocinaron los filetes. Agregue un chorrito de agua a la sartén y vierta la salsa de crema de madeira. Llevar a ebullición y reducir a una consistencia de salsa, luego dejar de lado.", "En una sartén separada, caliente un poco de mantequilla y fríe con delicadeza la chalota finamente picada hasta que esté blanda pero no coloreada. Agregue las setas silvestres y fríelas suavemente hasta que se ablanden. Agregue la mezcla de setas silvestres a la salsa de crema de Madeira.", "En la misma sartén donde se cocinaron las chalotas y los champiñones, caliente un poco de mantequilla y cocine suavemente las espinacas hasta que se marchiten. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la espinaca entre cuatro platos para servir. Corta los filetes y ábrelos sobre la espinaca.", "Con una cuchara grande, coloque un frotis de apio nabo con forma de lágrima en cada plato.", "Coloque cinco chalotes tostados en cada plato y cuchara el champiñón y la salsa de crema de madeira sobre la carne."], "url": "www_bbc_co_uk_food_recipes_panfriedsirloinsteak_87611", "title": "Filete de solomillo con chalotes, puré de apio nabo, champiñones y salsa de crema de madeira", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 rebanadas de salmón ahumado", "1 cucharada de aceite", "½ limón, solo jugo", "pimienta negra recién molida", "3 cucharadas de crema", "1 cucharada de yogur griego", "2 cucharadas de alcaparras, enjuagadas, escurridas y picadas", "1 cebolla tierna, finamente picada", "½ limón, solo jugo", "puñado de eneldo fresco, picado", "puñado de cebollín fresco, picado", "puñado de perejil fresco", "puñado de albahaca fresca", "puñado de cilantro fresco"], "method": ["Para el salmón, coloque tres rodajas de salmón ahumado una encima de la otra y luego enrolle en forma de salchicha. Enrolla el salmón enrollado y dale forma de círculo.", "Caliente el aceite en una sartén pequeña a fuego medio. Agregue el salmón ahumado y freír durante dos minutos por cada lado, hasta que esté rosado y cocido. Agregue el jugo de limón y cocine por un minuto más.", "Para la salsa tártara, coloque todos los ingredientes de la salsa tártara, excepto el eneldo y el cebollín, en una cacerola pequeña y caliente a fuego lento durante dos minutos. Retire del fuego y agregue el eneldo y el cebollín y revuelva.", "Para servir, mezcle el perejil, la albahaca y el cilantro en un tazón. Coloque las hierbas mixtas en un plato, coloque el salmón ahumado en sartén encima y vierta sobre la salsa tártara."], "url": "www_bbc_co_uk_food_recipes_panfriedsmokedsalmon_84584", "title": "Salmón ahumado a la sartén con salsa tártara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de salmón ahumado", "1 manojo de rábanos, sin cabeza, rallado", "1 naranja, solo jugo", "1 cucharada de aceite de oliva", "1 cucharada de eneldo fresco picado", "2 cucharaditas de vinagre de vino blanco"], "method": ["Calentar una sartén y freír las rodajas de salmón en un lado durante dos minutos. Sacar de la sartén y mantenga caliente.", "Coloque los rábanos rallados en un tazón grande.", "Coloque el jugo de naranja, el aceite, el eneldo y el vinagre en un tazón pequeño y bata para combinar. Vierta el aderezo sobre los rábanos y revuelva bien.", "Para servir, coloque las rodajas de salmón en platos para servir con la ensalada de rábanos."], "url": "www_bbc_co_uk_food_recipes_panfriedsmokedsalmon_86061", "title": "Salmón ahumado en sartén con ensalada de rábano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 remolachas enteras, cocidas y peladas", "aceite de oliva", "2 cucharadas de crema de rábano picante", "sal marina y pimienta, al gusto", "1 cucharada de mantequilla", "2 porciones de 300 g / 10½oz limpiaron el filete de pargo rojo, cortado en rodajas finas", "limón, para servir"], "method": ["Coloque la remolacha cocida en un procesador de alimentos y mezcle aproximadamente.", "Agregue un poco de aceite de oliva, la crema de rábano picante (o un poco de rábano picante recién rallado), sal y pimienta. Mezcla otros 20 segundos.3. Caliente el aceite de oliva y la mantequilla en una sartén y agregue las piezas de pargo una vez que la mantequilla esté marrón.", "Cocine el pescado por 2 minutos en cada lado y déjelo a un lado para que descanse.", "Para servir, apilar las piezas de pescado en un plato y agregar pimienta recién molida. Coloque una cucharada colmada de puré de remolacha a un lado y termine con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_panfriedsnapperwithb_12160", "title": "Pargo frito con remolacha", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de aceite vegetal", "¼ de cebolla, en rodajas", "100 g / 3½ oz okra, en rodajas a lo largo", "2 cucharadas de vino blanco", "1 cucharada de puré de tomate", "1 cucharada de miel", "pizca de copos de chile", "sal y pimienta negra recién molida", "1 cucharada de mantequilla", "¼ de coco fresco, carne en rodajas finas", "2 cucharadas de vino blanco", "2 cucharadas de leche de coco", "3 cucharadas de crema doble", "sal y pimienta negra recién molida", "pequeñas hojas de albahaca fresca, rasgada", "1 cucharada de aceite vegetal", "1 filete de pargo rojo, piel en", "100g / 3½oz de arroz, cocinado según las instrucciones del paquete, para servir"], "method": ["Para la okra picante, caliente el aceite en una sartén y fría la cebolla hasta que esté suave. Agregue la okra y el vino blanco y cocine a fuego lento hasta reducir a la mitad.", "Agregue el puré de tomate, miel y hojuelas de chile y cocine a fuego lento durante cinco minutos, o hasta que el quimbombó esté suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la salsa de coco y albahaca, caliente la mantequilla en una sartén pequeña. Agregue el coco fresco y el vino blanco y cocine a fuego lento hasta que el vino se haya reducido a la mitad. Agregue la leche de coco y la crema doble y sazone con sal y pimienta negra recién molida. Agregue la albahaca y revuelva. Apartar y mantener caliente.", "Para el pargo, caliente el aceite en una sartén y fríe el pargo en ambos lados hasta que esté cocido y la piel esté crujiente.", "Para servir, coloque el arroz en un plato para servir y cubra con el pescado. Rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedsnapperwiths_85775", "title": "Pargo frito con arroz al vapor, okra picante y salsa de coco y albahaca", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 diente de ajo, finamente picado", "2 cucharadas de alcaparras, escurridas, enjuagadas y finamente picadas", "1 tomate maduro, semillas eliminadas, picadas", "sal y pimienta negra recién molida", "½ limón, solo jugo", "puñado de perejil fresco, picado", "1 cucharada de aceite de oliva", "1 único filete, pelado"], "method": ["Para el aderezo, caliente el aceite en una sartén, agregue el ajo, las alcaparras y el tomate picado y suavemente caliente. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el jugo de limón y el perejil. Retirar del fuego, reservar y mantener caliente.", "Para la suela, caliente el aceite en una sartén antiadherente y fríe la suela durante 2-3 minutos en cada lado, o hasta que esté bien cocida.", "Para servir, coloque la suela en un plato y vierta sobre el aderezo caliente."], "url": "www_bbc_co_uk_food_recipes_panfriedsolefilletwi_85485", "title": "Filete de lenguado frito con alcaparras y aderezo de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de crema doble", "Queso cheddar 125 g / 4½ oz, rallado", "3 yemas de huevo de gallinas camperas", "3 claras de huevo de gallinas camperas, batidas hasta formar picos rígidos", "2 cucharadas de cebolletas frescas picadas", "1 cucharada de mantequilla", "2 cucharadas de harina normal", "3 cucharadas de vino blanco", "100ml / 3½ fl oz crema doble", "1 cucharada de mostaza integral", "1 cucharada de cebolletas frescas picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la crema y el queso en una cacerola y caliente sin hervir.", "Retirar del fuego durante unos minutos y luego batir las yemas de huevo.", "Dobla las claras de huevo y el cebollín en la mezcla de queso.", "Frote una sartén pequeña a prueba de horno con mantequilla y polvo con la harina normal. Coloque cucharadas de la mezcla de queso en la sartén y coloque en el horno para hornear durante ocho minutos.", "Para la salsa, coloque el vino blanco y la crema, la mostaza y el cebollín en una cacerola a fuego medio y cocine a fuego lento. Cocine por dos minutos y quite del fuego.", "Para servir, coloca el soufflé en el centro del plato y rocía la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedsoufflewithc_79943", "title": "Soufflé frito con salsa cremosa de mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de harina normal", "Filete de lubina 200-300 g / 7oz-10oz", "1 cucharadita de pimentón", "½ cucharadita de copos de chile", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 camote, pelado y rebanado", "75 g / 2½ oz de gorgonzola, en rodajas", "Crema doble 50ml / 2fl oz", "25g / 1oz de mantequilla", "sal y pimienta negra recién molida", "gran puñado de albahaca fresca, picada", "4 cucharadas de aceite de oliva", "2 cucharadas de piñones", "1 cucharada de limón, solo jugo", "sal y pimienta negra recién molida", "1 lima, cortada en rodajas, para adornar", "1 ramita de perejil fresco de hoja plana, para adornar"], "method": ["Para la lubina, coloque la harina en un tazón y sumerja el filete de lubina en la harina hasta que esté cubierto por ambos lados. Sacuda el exceso de harina.", "Coloque el pimentón, las hojuelas de chile, la sal y la pimienta negra recién molida en un recipiente limpio y mezcle bien. Luego enrolle la lubina en esta mezcla hasta que esté cubierta por ambos lados. Sacude el exceso de mezcla.", "Calentar el aceite en una sartén y agregar la lubina. Cocine la lubina durante tres minutos en cada lado, o hasta que esté cocida. Retire la lubina del fuego y reserve.", "Para el puré de gorgonzola, coloque la batata en una cacerola y deje hervir durante diez minutos o hasta que la papa esté tierna. Escurra el exceso de agua y triture la papa con un triturador de papas hasta que la mezcla esté suave.", "Agregue las piezas de gorgonzola, crema, mantequilla, sal y pimienta negra recién molida a la papa y mezcle bien.", "Para el pesto, coloque todos los ingredientes del pesto en un procesador de alimentos y mezcle.", "Para servir, coloque el puré en un plato limpio, coloque el filete de lubina encima y rocíe con pesto. Adorne con las rodajas de limón y el perejil."], "url": "www_bbc_co_uk_food_recipes_panfriedspicyseabass_84628", "title": "Lubina picante frita con puré de gorgonzola y pesto fresco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["pequeño manojo de albahaca fresca", "2 cucharadas de aceite de oliva, más 1 cucharada extra", "1 diente de ajo, aplastado", "sal marina y pimienta negra recién molida", "2 tomates, en rodajas gruesas", "Harina normal de 25g / 1oz"], "method": ["Coloque la albahaca, el aceite y el ajo en un procesador de alimentos y mezcle hasta que quede suave. Sazonar, al gusto, con sal marina y pimienta negra recién molida.", "Coloque el aceite de albahaca en un lado de los tomates cortados.", "Coloque el aceite adicional de cucharada en una sartén a fuego alto.", "Separe las rodajas de tomate en la harina, coloque los tomates en la sartén caliente y fría durante 2-3 minutos por cada lado, o hasta que estén dorados."], "url": "www_bbc_co_uk_food_recipes_panfriedtomatoes_84048", "title": "Tomates fritos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 11oz de frijoles borlotti secos", "1 ramita de salvia", "1 guindilla roja, pinchada con un cuchillo", "1 diente de ajo, cortado en cuartos", "2 tomates", "3 cucharadas de aceite de oliva", "1 cucharadita de vinagre de vino tinto", "sal y pimienta negra recién molida", "6 calamares frescos enteros", "rociar aceite de oliva virgen extra", "1 chile rojo, sin semillas y finamente picado", "3 filetes de anchoa, picados", "2 cucharadas de perejil de flatleaf, picado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "puñado de cohete picado, vestido con aceite de oliva y jugo de limón"], "method": ["Para los frijoles, remoje los frijoles Borlotti durante la noche en abundante agua fría y limpia.", "Escurrir los frijoles y transferir a una sartén grande con tres veces el volumen de agua. Agregue salvia, chile, ajo y tomates.", "Llevar a ebullición y luego reducir el fuego a fuego lento. Cocine a fuego lento durante una hora o hasta que los frijoles estén tiernos (el tiempo puede variar dependiendo de la edad de los frijoles).", "Escurra tres cuartas partes del licor de cocción y luego transfiera los frijoles y el licor de cocción restante a un bol. Retire y deseche el chile y la salvia. Retira el ajo, machaca con un tenedor y luego vuelve a los frijoles y revuelve.", "Sazonar con sal y pimienta negra y agregar el aceite de oliva y el vinagre.", "Para el calamar, pele las alas y la membrana externa y quite la cabeza y los intestinos. Cortar por la mitad a lo largo y raspar el interior con un cuchillo. Lávese bien con agua fría y seque.", "Coloque las piezas de calamar planas, con la piel hacia abajo, y marque con un cuchillo afilado en un patrón entrecruzado.", "Sazone el calamar con sal y pimienta negra recién molida y frote un poco de aceite de oliva en la piel.", "Coloque una sartén antiadherente a fuego medio. Cuando esté caliente, agregue el calamar, anotado hacia abajo. Cocine por un minuto hasta que esté dorado, luego voltee.", "Agregue los chiles, los filetes de anchoas, el perejil y el jugo de limón a la sartén.", "Retire el calamar y rápidamente corte en trozos del tamaño de un bocado. Regrese inmediatamente a la sartén y mezcle brevemente con los otros ingredientes.", "Para servir, coloque una cuchara de la mezcla de frijoles borlotti en el centro de un plato. Coloque una pequeña cantidad de cohete en la parte superior y luego el calamar picado."], "url": "www_bbc_co_uk_food_recipes_panfriedsquidwithbor_85600", "title": "Calamar frito con frijoles Borlotti, chile, anchoa, perejil y cohete picado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["7 g / ½ oz de mantequilla sin sal", "1 chalote, picado", "pizca de sal", "600 ml / 1 pinta 2 fl oz de leche", "Almendras 200 g / 7 oz, copos o enteros, ligeramente tostados", "dash doble o crema batida", "dash aceite de almendras", "pimienta negra recién molida, al gusto", "15 g / ½ oz de mantequilla sin sal", "½ cucharada de aceite de oliva", "4 truchas enteras, escamadas, evisceradas y sin cabeza", "sal y pimienta negra recién molida", "1 limón, solo jugo", "pequeño racimo de perejil picado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Para el puré de almendras, en una sartén de tamaño mediano derretir la mantequilla y sudar los chalotes picados hasta que estén suaves y transparentes. Sazonar con sal al gusto.", "Agregue la leche y las almendras y déjelas hervir. Cocine por 30 minutos.", "Coloque las almendras y los chalotes en una licuadora con unas cucharadas de leche en la que se han cocinado. Mezcle para hacer un puré fino. Ajuste la consistencia agregando más líquido de cocción si es necesario y una pizca de crema y aceite de almendras al gusto.", "Regrese el puré a una sartén más pequeña, sazone con sal y pimienta negra recién molida y manténgalo caliente.", "Para la trucha, derrita la mantequilla con el aceite de oliva en una sartén antiadherente a prueba de horno. Calienta hasta que la mantequilla esté espumosa. Sazone la trucha con sal y pimienta negra recién molida antes de colocarlos en la sartén. Cocine durante aproximadamente tres minutos en el primer lado antes de girar cuidadosamente la trucha y transferir la sartén al horno durante diez minutos.", "Retire la sartén del horno. Exprime el jugo de limón sobre la trucha y déjalo reposar por unos minutos.", "Para servir, espolvoree un poco del puré de almendras caliente en cada plato de servir antes de colocar el pescado en el plato. Agregue el perejil al aceite de cocina tibia en la sartén, revuelva y luego espolvoree sobre el pescado."], "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithalm_86542", "title": "Trucha frita con puré de almendras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de jugo de limón", "2 cucharaditas de vinagre de vino blanco", "2 yemas de huevo grandes de gallinas camperas", "125 g / 4½ oz de mantequilla", "pizca de sal", "1 naranja, solo ralladura", "sal y pimienta negra recién molida", "50g / 2oz de mantequilla sin sal", "1 trucha entera, fileteada, sin piel", "1 naranja, segmentada (recolecta y reserva el jugo liberado al segmentar la naranja en un tazón)", "1 pomelo rosado, segmentado (recolecte y reserve el jugo liberado al segmentar el pomelo en un recipiente)", "1 bulbo de hinojo, finamente cortado", "2 chalotes, pelados, finamente cortados", "2 cucharadas de perejil fresco picado", "2 cucharadas de aceite de oliva virgen extra", "sal y pimienta negra recién molida"], "method": ["Para la naranja holandesa, caliente el jugo de limón y el vinagre de vino blanco en una sartén no reactiva hasta que hierva.", "Mientras tanto, caliente la mantequilla en una sartén de base pesada a fuego medio a bajo hasta que se derrita. (NB: No cocine en exceso la mantequilla o se quemará).", "Mezcle las yemas de huevo y la sal en un procesador de alimentos hasta que estén bien combinados.", "Con el motor en marcha, agregue gradualmente la mezcla caliente de limón y vinagre en una corriente delgada, hasta que toda la mezcla se haya incorporado completamente en las yemas de huevo.", "Con el motor en marcha, agregue gradualmente la mantequilla derretida en una corriente delgada, hasta que toda la mantequilla se haya incorporado completamente a la mezcla y la salsa se haya espesado.", "Transfiera la salsa holandesa a un tazón, agregue la ralladura de naranja y sazone al gusto con sal y pimienta negra recién molida. Poner a un lado (mantener caliente).", "Para la ensalada de trucha y naranja, caliente 25 g / 1 oz de la mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumosa, agregue los filetes de trucha y fríalos durante 2-3 minutos en cada lado, o hasta que estén bien cocidos. (NB: La trucha se cuece cuando la carne es opaca.) Retire de la sartén y manténgase caliente.", "Caliente los restantes 25 g / 1 oz de mantequilla en una sartén por separado a fuego medio. Cuando la mantequilla esté espumosa, agregue los segmentos de naranja y pomelo y fría en ambos lados hasta que esté caramelizada.", "Mientras tanto, pula el hinojo en rodajas y los chalotes en una olla grande de agua hirviendo con sal. Escurrir bien, luego refrescar en agua helada. Drenar de nuevo.", "En un tazón grande, mezcle bien el hinojo blanqueado y los chalotes, la naranja caramelizada y la toronja y el perejil picado hasta que estén bien combinados.", "Batir el aceite de oliva virgen extra y los jugos reservados de la naranja y el pomelo segmentados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, divida la ensalada de hinojo y pomelo en partes iguales entre dos platos para servir. Coloque un filete de trucha en la parte superior de cada porción. Rocíe sobre la naranja holandesa. Rocíe el aderezo de aceite y cítricos alrededor del borde de los platos."], "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithora_92674", "title": "Trucha frita con naranja holandesa e hinojo y ensalada de pomelo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110g / 4oz de patatas nuevas", "110g / 4oz de judías verdes", "botón de mantequilla", "2 filetes de trucha", "sal y pimienta negra recién molida", "55g / 2oz de mantequilla sin sal, derretida"], "method": ["Poner a hervir una olla de agua y hervir las papas nuevas durante 8-10 minutos, o hasta que estén tiernas, y los frijoles durante 3-4 minutos. Desagüe.", "Calienta suavemente la mantequilla en una sartén antiadherente. Sazonar el filete de trucha y freír en sartén durante 2-3 minutos en cada lado.", "Transfiera la trucha a un plato de servir. Coloque las papas y los frijoles nuevos al lado y rocíe con la mantequilla derretida para servir."], "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithnew_76752", "title": "Trucha frita con papas nuevas y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla", "2 truchas, fileteadas y despellejadas", "sal y pimienta negra recién molida", "2 tallos de ruibarbo, en rodajas muy finas", "2 cucharaditas de azúcar en polvo", "½ cucharadita de jengibre molido", "½ pan blanco crujiente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "½ limón, jugo y ralladura", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida", "3-4 cucharadas de aceite de oliva virgen extra", "50 g / 2 oz de hojas de mizuna", "50g / 2oz de hojas de espinaca baby", "25 g / 1 oz de hojas de perejil de flatleaf"], "method": ["Para la trucha, caliente una sartén hasta que esté caliente y agregue la mitad de la mantequilla.", "Sazone la trucha con sal y pimienta negra recién molida, al gusto, y colóquela en la sartén.", "Cocine por dos minutos, antes de dar vuelta cuidadosamente con una rebanada de pescado y freír por un minuto más. Retire el pescado de la sartén y déjelo a un lado en un lugar cálido.", "Caliente una sartén por separado y agregue la mantequilla restante. Agregue el ruibarbo, el azúcar y el jengibre molido y saltee brevemente hasta que el ruibarbo se haya suavizado y el azúcar se haya disuelto. Reservar en un lugar cálido.", "Para los croûtons, corte las cortezas del pan y córtelas en cubos de 1cm / ½.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva. Agregue el pan en cubos y la sal y la pimienta negra recién molida, al gusto. Freír durante 2-3 minutos hasta que estén dorados y crujientes.", "Transfiera el pan frito a un plato forrado con papel de cocina.", "Para la ensalada, coloque el jugo de limón y la ralladura en un tazón pequeño y agregue la mostaza. Sazonar con sal y pimienta negra recién molida y batir en el aceite de oliva.", "Coloque las hojas de mizuna, espinaca baby y perejil en un bol, junto con los crotones y el aderezo y mezcle para combinar.", "Divida la trucha por igual entre cuatro platos y cubra con algo del ruibarbo. Coloque una pila de ensalada al lado y sirva."], "url": "www_bbc_co_uk_food_recipes_panfriedtroutwithrhu_87935", "title": "Trucha frita con ensalada de ruibarbo y mizuna y croûton", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "4 x 150-175g / 6-7oz filetes de rodaballo, desollados", "175ml / 6fl oz de vino blanco", "175ml / 6fl oz de caldo de pescado", "Crema doble 175ml / 6fl oz", "55 g / 2 oz de mantequilla", "2 cucharadas de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "200g / 8oz de setas silvestres mezcladas", "½ limón, solo jugo", "2 cucharadas de perejil de hoja plana, más o menos picado", "puré de patatas"], "method": ["Calentar una sartén hasta que esté caliente y agregar la mantequilla y el aceite de oliva.", "Sazonar el pescado con sal y pimienta negra recién molida y colocar en la sartén cuando el aceite y la mantequilla estén muy calientes. Cocine los filetes de rodaballo durante 2-3 minutos en cada lado, o hasta que estén dorados por todos lados.", "Para la espuma de crema, verter el vino blanco en una sartén a fuego medio y llevar a ebullición. Hierva hasta que se reduzca en dos tercios, luego agregue el caldo de pescado. Vuelva a hervir y cocine hasta que el líquido se haya reducido en dos tercios.", "Agregue la crema, vuelva a hervir y cocine hasta que el líquido se haya reducido a la mitad, luego sazone al gusto con sal y pimienta negra recién molida. Reserve y mantenga caliente hasta que esté listo para servir.", "Para los champiñones, caliente una sartén limpia y agregue la mantequilla y el aceite de oliva. Una vez caliente, agregue los chalotes y el ajo y fría por 2-3 minutos, hasta que se ablanden.", "Agregue los champiñones y cocine por otros dos minutos, luego sazone, al gusto, con sal y pimienta negra recién molida y agregue el jugo de limón y el perejil.", "Usando una batidora de mano, mezcle la salsa de crema hasta que esté ligera y espumosa.", "Para servir, coloque una cucharada grande de puré de patatas en el centro de cada plato. Coloque un filete de rodaballo encima de cada uno y ponga la mezcla de hongos alrededor del borde de la papa. Cuchara un poco de la salsa de espuma sobre los champiñones y servir."], "url": "www_bbc_co_uk_food_recipes_panfriedturbotwithwi_87179", "title": "Rodaballo con champiñones, puré de patatas y salsa de crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110g / 4oz de mantequilla sin sal", "Chalotes de 75g / 3oz, en rodajas", "10 ramitas de tomillo fresco", "110 g / 4 oz champiñones, en rodajas", "200ml / 7fl oz de jerez Amontillado seco", "200ml / 7fl oz de caldo de pollo", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida", "4 x 175 g / 6 oz de filetes de ternera rosados, cortados en medallones", "sal y pimienta negra recién molida", "110g / 4oz de mantequilla", "1 cucharada de aceite de oliva", "20 dientes de ajo, pelados y blanqueados 3 veces (coloque en agua fría, lleve a ebullición, escurrir y refrescar en agua fría y repetir dos veces más)", "ramita de tomillo fresco", "20 puntas de espárragos peladas y cortadas", "150g / 5oz de setas silvestres mezcladas (como mousserons, girolles, pied blue)", "110g / 4oz de ajo silvestre", "Hojas de espinaca baby 110g / 4oz"], "method": ["Para la salsa, caliente una sartén hasta que esté caliente, agregue la mitad de la mantequilla y las chalotas. Cocine a fuego lento hasta que esté suave y transparente.", "Agregue el tomillo y los champiñones y cocine hasta que los champiñones se hayan suavizado.", "Agregue el jerez, suba el fuego y cocine a fuego lento hasta que el líquido se reduzca en volumen a la mitad.", "Agregue el caldo de pollo y cocine a fuego lento hasta que el líquido se reduzca en volumen a la mitad otra vez.", "Agregue la crema y cocine a fuego lento hasta que el líquido se reduzca en volumen a la mitad otra vez.", "Batir la mantequilla restante, pasar a través de un tamiz fino en una sartén limpia y sazonar, al gusto, con sal y pimienta negra recién molida. Mantener caliente", "Para la ternera, condimente los medallones de ternera con sal y pimienta negra recién molida.", "Calentar una sartén hasta que esté caliente y agregar un tercio de la mantequilla y todo el aceite de oliva. Agregue la ternera y fríasela suavemente durante 2-3 minutos, sin volverla, hasta que se dore por un lado.", "Voltee la ternera, agregue el ajo y el tomillo y fría por 2-3 minutos o hasta que la ternera esté dorada por ambos lados y el ajo esté dorado y suave.", "Retire la carne de ternera y el ajo de la sartén y deje reposar en un lugar cálido.", "Saque el exceso de grasa de los jugos de cocción en la sartén y agregue un chorrito de agua a la sartén para desglasar, raspando cualquier broche marrón pegado al fondo de la sartén.", "Agregue este líquido a la salsa de jerez. Vuelva a calentar la salsa, batiendo todo el tiempo, hasta que se hayan incorporado los jugos de cocción. Mantener caliente", "Ponga a hervir una olla de agua poco profunda, agregue otro tercio de la mantequilla y los espárragos. Cocine suavemente durante 2-3 minutos, hasta que estén tiernos, y escurra", "Caliente una sartén por separado hasta que esté caliente, agregue la mantequilla restante, los champiñones, el ajo silvestre y las hojas de espinacas y saltee durante 2-3 minutos, o hasta que los champiñones estén cocidos y las hojas marchitas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta dos tercios de la mezcla de champiñones en el centro de un plato grande y tibio. Cubra con los medallones de ternera y la mezcla de hongos restante. Coloque los espárragos a un lado y cuchara sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_panfriedvealfilletwi_88996", "title": "Filete de ternera frito con setas, espárragos, ajo silvestre y salsa de jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["35ml / 1fl oz de ketchup de tomate", "25g / 1oz de mostaza inglesa", "25g / 1oz alcaparras", "2 chalotes, finamente picados", "puñado de perejil, finamente picado", "1 cucharada de cebollines cortados", "½ cucharadita de mejorana picada", "½ cucharadita de hojas de tomillo", "6 hojas de estragón, finamente picadas", "½ cucharadita de romero picado", "1 diente de ajo, finamente picado", "6 filetes de anchoa, finamente picados", "1 cucharada de aguardiente", "1 cucharada de Madeira", "½ cucharadita de salsa Worcestershire", "1 cucharada de pimentón", "½ cucharadita de curry en polvo", "½ cucharadita de Cayena", "1 limón, ralladura y jugo", "1 naranja, solo ralladura", "1 cucharadita de sal", "450 g / 1 libra de mantequilla, a temperatura ambiente, cortado en cubos pequeños", "150ml / 5fl oz de vino blanco seco", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "½ cucharadita de hojas tiernas de tomillo", "350 g / 12 oz cada pequeños mejillones y berberechos o almejas pequeñas", "1 cucharadita de aceite de oliva", "4 filetes de salmón silvestre, cada uno de aproximadamente 175 g / 6 oz, desollados", "sal y pimienta negra recién molida", "25 g / 1oz de mantequilla sin sal", "1 cucharada de salsa de tomate reducida o puré de tomate diluido", "115g / 4oz de gambas marrones cocidas, peladas", "2 vieiras grandes capturadas por buzos, cortadas en cubitos", "8 papas Ratte o Pink Fir Apple, cocidas al vapor hasta que estén tiernas y peladas, para servir"], "method": ["Primero haga la mantequilla del Café de Paris. Combine todos los ingredientes, excepto la mantequilla, en un tazón grande. Reserve por 4 horas.", "Batir la mantequilla hasta que quede esponjoso, luego mezclar con los otros ingredientes. Transfiera a una hoja de película adhesiva y déle forma a un tronco pulcro de aproximadamente 2,5 cm de diámetro. Envuélvete en la película adhesiva y relájate. (Esto producirá más mantequilla de la que necesita para esta receta, pero puede conservarse en el congelador hasta por 6 meses, es buena en carnes, pollo y pescado).", "Para el salmón, caliente el vino con los chalotes, el ajo y el tomillo en una cacerola grande a fuego lento durante 3 minutos. Encienda el fuego y agregue los mejillones y berberechos o almejas. Cubra con una tapa y agite bien la sartén, luego cocine por 3 minutos o hasta que todas las conchas se acaban de abrir. Descarta cualquiera que no se abra.", "Incline en un colador o tamiz colocado sobre un recipiente para que pueda retener los jugos. Cuando estén lo suficientemente fríos como para manipularlos, retire los mejillones y los berberechos de sus conchas y déjelos a un lado; retenga algunos en sus caparazones para adornar.", "Regrese los jugos a la sartén y reduzca a fuego alto hasta que le queden 4 cucharadas soperas. Mantener caliente", "Caliente una sartén grande hasta que esté muy caliente. Agregue 1 cucharada de la mantequilla del Café de Paris y el aceite de oliva. Sazonar el salmón con sal y pimienta negra recién molida y colocar en la sartén. Cocine por 2-3 minutos en cada lado, dependiendo del grosor. Retire y mantenga caliente.", "Vierta los jugos de mariscos en la bandeja de pescado caliente y revuelva para combinar con los jugos de la sartén. Agregue 2 cucharadas de mantequilla de Café de Paris, la mantequilla sin sal y la salsa reducida y cocine hasta que se emulsione. Verifica el condimento. Agregue los mejillones y los berberechos sin cáscara, los camarones y las vieiras y caliente.", "Para servir, coloque el salmón sobre cuatro platos calentados y póngalo sobre el pescado. Adorne con los mejillones y los berberechos con cáscara y las papas al vapor."], "url": "www_bbc_co_uk_food_recipes_panfriedwildsalmonwi_81726", "title": "Salmón salvaje salteado con mantequilla de marisco con especias", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ escalope de ternera", "100 g / 3½ oz de champiñones silvestres", "2 cucharadas de aguardiente", "25g / 1oz de mantequilla", "Crema doble 50ml / 2fl oz", "sal y pimienta negra recién molida", "2 cucharadas de cebollines picados", "25g / 1oz de mantequilla", "1 cucharada de aceite de oliva", "150 g / 5½ oz cavolo nero, tallos eliminados, en rodajas finas", "200ml / 7½fl oz de caldo de verduras"], "method": ["Para la ternera, caliente el aceite de oliva en una sartén a prueba de horno, y fría la carne de ternera durante 4-5 minutos en ambos lados, o hasta que se dore por todos lados. Retire la carne de ternera de la sartén y déjela a un lado. Mantener caliente", "Agregue los champiñones a la misma sartén que se usa para cocinar la ternera y fría por 5-6 minutos. Regresa la ternera a la sartén.", "Agregue el brandy, caliente brevemente y luego encienda la luz con una cerilla. Deje que las llamas se enciendan y luego desaparezcan. Cocine durante 3-4 minutos más hasta que la mayoría del líquido se haya evaporado. (PRECAUCIÓN: Mantenga las llamas lejos de los ojos y la cara. No las deje desatendidas).", "Agregue la mantequilla y la crema, deje hervir y caliente por un minuto. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregar los cebollines picados.", "Para el cavolo nero, derrita la mantequilla y el aceite de oliva en una sartén y agregue el cavolo nero. Freír por un minuto, luego verter en el caldo, llevar la mezcla a ebullición y hervir durante 4-5 minutos, o hasta que esté tierna.", "Para servir, coloque la ternera y las setas en un plato para servir y sirva el cavolo nero al costado."], "url": "www_bbc_co_uk_food_recipes_panfriedvealwithcrea_92850", "title": "Ternera frita con champiñones cremosos y cavolo nero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]