[{"isVegetarian": false, "title": "Beef fillet with chicory and blue cheese salad and celeriac chips", "url": "www_bbc_co_uk_food_recipes_beef_fillet_on_the_bone_66102", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz egg white (3 small free-range eggs whites)", "500g-1kg/1lb 2oz-2lb 4oz fine salt", "1 celeriac, approx 650g/1lb 7oz", "390g jar pickled walnuts", "100g/3½oz tapioca flour", "vegetable oil, for deep-frying", "olive oil, for frying", "1 fillet of beef on the bone ", "1 red chicory", "1 white chicory", "1 frisée lettuce", "75g/2¾oz of blue cheese, crumbled", "1 tbsp 2.5cm/1in chopped chives", "2 tbsp walnut oil, for drizzling", "salt and freshly ground black pepper ", "300ml/10fl oz jus or beef gravy, to serve", "2 walnuts, roughly chopped, to serve"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Mix the egg whites and salt into a paste. Put the paste around the celeriac to form a salt crust and place on a baking tray. Bake for 1½ hours, then set aside to cool completely. (This can be done the night before, if preferred.).", "Drain the pickled walnuts, reserving the liquid, and blend in a food processor. Slowly add the liquid, blending all the time, until a thick, smooth purée forms. Sieve the mixture into a clean bowl and set aside.", "For the celeriac chips, break up the salt crust and discard. Cut the celeriac into chip-sized pieces and dust in the tapioca flour. Heat the oil in a deep-fat fryer to 190C (CAUTION: hot oil can be dangerous. Do not leave unattended.). Fry the celariac chips until golden, then drain on kitchen paper.", "Heat a little olive oil in a frying pan over a high heat. Season the beef, then fry for 2 minutes on each side, or until done to your liking. Set aside to rest somewhere warm. ", "Cut the base off the chicory and lettuce and remove the outer leaves. Separate the inner leaves and place in a large bowl. Sprinkle over the blue cheese and chives, season and drizzle with a little walnut oil.", "To serve, heat the jus until hot. Remove the bone from the beef fillet and slice the meat in half, then place it on two warmed plates and spoon the jus over it. Add the chips and salad with a spoonful of walnut ketchup on the side. Sprinkle with chopped walnuts. "]}, {"isVegetarian": false, "title": "Beef fillet with black-pepper miso and pickled Japanese mushroom salad", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_13708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5½fl oz sake", "150ml/5½fl oz mirin", "20g fresh root ginger, peeled and finely chopped", "2 tsp crushed garlic", "3 tsp freshly ground black pepper", "200g/7oz red miso paste", "4 x 200g/7oz beef fillet steaks \t\t\t\t\t\t\t\t\t", "freshly grated wasabi, to serve", "1 tbsp vegetable oil", "300g/10½oz mix Japanese mushrooms (keep the shiitake separate) ", "350ml/12fl oz mirin", "100ml/3½fl oz rice vinegar", "50ml/2fl oz light soy sauce ", "1 onion, cut into 1cm/½in rings"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the beef with miso, heat the sake and mirin together in a small saucepan for 3-4 minutes, or until the alcohol has evaporated. Add the ginger and garlic and cook for 2-3 minutes, or until tender. Add the pepper and miso paste and stir until blended. Remove from the heat.", "Brush the steaks lightly with the mixture. If possible, marinade, covered, in the fridge for 2-3 hours, but bring back to room temperature before cooking. ", "For the pickled Japanese mushroom salad, heat the oil in a frying pan and fry the shiitake mushrooms until coloured. Add the remaining mushrooms and fry for 2-3 minutes. ", "Deglaze the pan by pouring in 100ml/3½fl oz mirin, then bubble until reduced by half. Pour in the vinegar and soy sauce, then stir, remove from the heat and set aside. ", "Preheat a griddle pan to hot. Cook the onion rings for 5-7 minutes, turning halfway, until caramelised on both sides. Transfer to a heatproof lidded container and set aside.", "Bring the remaining 250ml/9fl oz mirin to the boil, then pour it over the onions. Seal the container and leave to cool. ", "For the beef with miso, preheat a heavy-based griddle pan over a medium heat. Cook the steaks until a crust has formed. Continue cooking and turning, brushing the steaks with more black-pepper miso each time they are turned, until cooked to your taste. Be careful not to let them catch, or the miso will go bitter. Leave to cool for at least 20 minutes. ", "Slice the steaks and arrange on a platter. Serve with the mushrooms, onions and wasabi. "]}, {"isVegetarian": false, "title": "Beef fillet with potato rosti and Madeira sauce", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_potato_43905", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large Maris Piper potatoes, peeled and coarsley grated", "2 tbsp crème fraîche", "1 free-range egg, yolk only", "salt and freshly ground black pepper", "25g/1oz butter, melted", "25g/1oz butter", "1 banana shallot, halved lengthways", "sprig fresh thyme", "85g/3oz butter ", "1 banana shallot, finely chopped", "1 garlic clove, chopped", "50ml/2fl oz Madeira", "100ml/3½fl oz beef stock", "1 tbsp chopped fresh tarragon ", "1 tbsp rapeseed oil", "2 x 150g-200g/5½-7oz thick-cut beef fillets", "200g/7oz wild mushrooms", "2 tbsp chopped fresh parsley", "50g/1¾oz baby spinach"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the rosti, wrap the grated potatoes in a clean tea towel and squeeze out as much liquid as you can.", "Put the grated potato in a bowl with the crème fraîche and egg yolk. Season with salt and pepper. Stir to combine.", "Heat the butter in a frying pan over a medium heat and place two 7.5cm/3in chefs' rings into the pan. (If you don’t have chef’s rings just shape the potato mix into two patties.) Spoon the potato mixture into the rings, press down well using a spoon, and cook for 3-4 minutes, or until golden-brown, then remove the rings (if using). ", "Turn the rosti over, press the mixture down and cook for 3-4 minutes on the other side, or until cooked through. ", "For the shallot, dot knobs of butter in a roasting tin. Sit the shallot halves on the butter, cut-side down, and put the thyme sprig on top. Roast in the preheated oven for 5-10 minutes until soft.", "For the sauce, heat a frying pan and add 55g/2oz butter. Once hot add the shallot and garlic and cook for 2-3 minutes. Add the Madeira and stock. Cook until the volume of liquid has reduced by half and you have a thick sauce (homemade stock, or stock bought as liquid works best for this, rather than stock made from powder which is more watery). ", "Add the tarragon and stir in the rest of the butter, to give the sauce a glossy finish.", "For the beef, heat a frying pan and add the rapeseed oil. Once hot add the fillet steak and cook on each side for 3-4 minutes.", "When the beef is almost done, add the mushrooms to the pan. Baste the beef with the pan juices while cooking. When the beef is cooked to your liking remove it from the pan and set aside to rest. ", "Add the parsley to the mushrooms and cook for another couple of minutes until the mushrooms are cooked.", "In a separate pan, add the spinach and two tablespoons of water. Cook until wilted.", "To serve, place a rosti in the centre of each plate and top with the mushrooms and spinach. Place the beef on top and spoon over the sauce."]}, {"isVegetarian": false, "title": "Beef fillet with wild garlic purée and a fricasse of wild mushrooms", "url": "www_bbc_co_uk_food_recipes_beef_fillet_with_wild_74776", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz unsalted butter", "4 small shallots, sliced", "1 garlic clove, crushed", "300g/10½oz wild garlic ", "30g/1oz fresh chervil, chopped", "30g/1oz fresh tarragon, chopped", "150ml/5fl oz double cream ", "pinch salt", "2 tbsp olive oil/rapeseed oil", "75g/2½oz unsalted butter", "4 x 120g/4oz beef fillets", "100g/3½oz unsalted butter", "1 garlic clove, crushed", "1 shallot, finely chopped", "200g/7oz assorted wild mushrooms", "2 tbsp Madeira ", "100ml/3½fl oz beef stock or brown chicken stock", "1 tsp wholegrain mustard ", "1 tomato, peeled, de-seeded and finely chopped", "1 tsp chopped fresh tarragon ", "2-3 tbsp olive oil or rapeseed oil", "12 asparagus tips", "whole fresh wild garlic leaves "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the wild garlic purée, melt the butter in a sauce pan. Add the shallots and garlic in and cook gently without colouring them. Add the wild garlic, chervil and tarragon and cook until the wild garlic is tender. ", "Transfer to a blender. In a small pan bring the cream to the boil. Add this to the blender. Blend until smooth. Season with salt, to taste. Put into a plastic bottle and keep warm until serving. ", "For the beef, season the beef with salt. Heat the oil and butter in a frying pan until foaming. Cook the beef for a few minutes on each side until cooked to your liking. Set it aside to rest before serving.", "For the fricassee of wild mushroom, melt 20g/¾oz of the butter in a pan, add the garlic and chopped shallot and cook until transparent. Add the mushrooms, season with salt and pepper and cook gently for 3 minutes. Add the Madeira to the pan and scrape the bottom of the pan. Cook until reduced by a third in volume. Add the stock and bring to the boil. Whisk in the mustard and then the rest of the butter. Season with salt and pepper and then and the tomato and tarragon just before serving. ", "For the asparagus tips, heat a griddle pan to hot. Coat the asparagus in the oil, season with salt and pepper, then place onto the hot griddle, turning occasionally. Cook for about 5 minutes until done and ready to serve. ", "To serve, pipe the wild garlic purée onto the plate from the plastic bottle. Cut the beef in half, add to the plate with the mushroom fricassee and asparagus. Garnish with wild garlic leaves. "]}, {"isVegetarian": false, "title": "Beef hotpot", "url": "www_bbc_co_uk_food_recipes_beef_hotpot_59730", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_hotpot_59730_16x9.jpg", "ingredients": ["1kg/2lb 2oz braising steak, trimmed, cut into 5cm/2in chunks", "salt and freshly ground black pepper", "1 tbsp vegetable oil", "75g/3oz butter", "150g/5oz baby onions, peeled", "4 carrots, peeled, cut into chunks", "1 tbsp plain flour", "200ml/7floz red wine", "400ml/14fl oz fresh beef stock", "2 fresh thyme sprigs", "1kg/2lb 2oz potatoes, cut into 5mm/¼in slices"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Season the meat with salt and freshly ground black pepper.", "Heat a large casserole dish until very hot then add the oil and a small knob of butter. Fry the beef until browned all over, then remove from the pan and set aside. (You may need to do this in batches.)", "Add the onions and another knob of butter to the pan and fry for 2-3 minutes, or until lightly browned. Add the carrots and cook for a further minute.", "Stir in the flour then gradually add the red wine, stirring until smooth.  Add the browned beef and the stock, season with salt and freshly ground black pepper and bring to the boil. Stir in the fresh thyme, then arrange the potatoes on top. Dot the surface with the remaining butter.", "Cover with a lid and cook in the oven for one hour.", "Remove the lid and increase the heat to 200C/400F/Gas 6 for 30 minutes."]}, {"isVegetarian": false, "title": "Beef jhal faraizi, karhai broccoli and sweet and sour squash", "url": "www_bbc_co_uk_food_recipes_beef_jhal_faraizi_karhai_92693", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["340g/12oz small floury potatoes, unpeeled", "2 tbsp olive or rapeseed oil", "½ tsp whole cumin seeds", "1 medium onion, cut into 7mm/⅓in cubes", "2-3 fresh, hot green chillies (such as bird’s-eye chillies), chopped", "340g/12oz leftover roast beef, 7mm/⅓in cubes", "1 tsp salt ", "freshly ground black pepper", "3 tbsp olive or rapeseed oil", "⅛ tsp ground asafoetida", "¼ tsp whole cumin seeds", "¼ tsp whole mustard seeds", "400g/14oz trimmed broccoli florets", "½ tsp salt", "¼ tsp cayenne pepper", "3 tbsp olive oil", "generous pinch ground asafoetida", "½ tsp whole brown or yellow mustard seeds", "560g/1¼lb peeled and de-seeded butternut squash, cut into 2.5cm/1in pieces", "¾-1 tsp salt", "1½ tsp caster sugar", "⅛-¼ tsp cayenne pepper", "1 tbsp plain yoghurt", "2 tbsp chopped fresh coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef jhal faraizi, boil the potatoes in a pan of salted water and set aside to cool. Once cool, peel them and cut into 7mm/⅓in cubes.", "Heat the oil in a large frying pan, preferably non-stick, over a medium-high heat. When hot, add the cumin seeds. Let them sizzle for five seconds, then add the onion, cooked potatoes and chillies. ", "Lower the heat to medium and stir-fry the mixture for 4-5 minutes, or until the onion has softened and is translucent. Add the beef, salt and lots of freshly ground black pepper, then stir-fry for a further minute. ", "Reduce the heat to medium-low. Press down on all the ingredients in the pan with a spatula to form a flat cake that fills the pan. Continue to cook for 12-15 minutes, turning the pan so that the bottom of the ‘cake’ browns evenly. Keep warm. ", "For the karhai broccoli, heat the oil in a karhai (or lidded wok or frying pan) over a medium-high heat. ", "When the oil is hot, add the asafoetida, cumin and mustard seeds (be aware of mustard seeds popping out of the pan into your eyes). As soon as the mustard seeds begin to pop, add the broccoli. Stir-fry for one minute, then add the salt and cayenne pepper. ", "Pour in four tablespoons of water and bring the mixture to a simmer. Cover the pan with a lid, lower the heat until the mixture is simmering gently and cook for 7-8 minutes, or until the broccoli is just tender, stirring now and then.", "Meanwhile, for the sweet-and-sour butternut squash, heat the oil in a lidded pan over a medium heat. When hot, add the asafoetida and mustard seeds. As soon as the seeds start to pop - a matter of seconds - add the squash. ", "Stir-fry the squash for 2-3 minutes, or until the pieces just start to brown. Add 50ml/2fl oz water, cover the pan with a lid, lower the heat and cook for 8-10 minutes, or until the squash is tender.", "Add the salt, sugar, cayenne pepper and yoghurt. Stir until well combined and cook, uncovered, over a medium heat, until the yoghurt mixture has warmed through. Stir in the fresh coriander.", "To serve, break up the the beef jhal faraizi into four equal portions and serve it hot with the karahi broccoli and squash."]}, {"isVegetarian": false, "title": "Beef goulash soup (Gulyas leves)", "url": "www_bbc_co_uk_food_recipes_beef_goulash_soup_gulyas_16159", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_goulash_soup_gulyas_16159_16x9.jpg", "ingredients": ["1kg/2lb 4oz braising steak or venison", "2 tbsp plain flour", "vegetable oil", "2 medium onions, diced", "4 medium carrots, diced", "2 celery sticks, leaves and all, diced", "1 red pepper, seeded and diced", "5 garlic cloves, crushed", "4 tbsp good sweet Hungarian paprika", "2 tbsp caraway seeds, crushed", "60g/4 tbsp tomato purée", "3 bay leaves", "2 litres/3½ pints good beef stock", "4 potatoes, peeled and chopped into small cubes", "flaked sea salt", "freshly ground black pepper", "soured cream and flat-leaf parsley, to garnish"], "serves": "Serves 6 - 8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the meat and cut it into bite-sized chunks. In a large bowl, mix the flour with a teaspoon each of salt and pepper. Add the beef and toss so that all the chunks are dusted with flour. ", "Heat a tablespoon of oil in a large frying pan and brown the beef in small batches, setting each batch aside while you brown the next. Take care not to crowd the pan or the beef will steam rather than brown.", "Meanwhile, heat a little oil in a large heavy-bottomed pan, add the onions, carrots, celery, red pepper and garlic. Cook gently for about 10 minutes until they start to soften.", "Add the beef, paprika, caraway seeds, tomato purée and bay leaves, then pour in the beef stock.", "Stir well, cover the pan and simmer for at least 1½ hours until the beef is starting to get tender. Add the potatoes and continue to simmer for another 30 minutes. Check the seasoning before serving.", "Serve the soup in bowls with a generous swirl of soured cream and a good sprinkling of parsley."]}, {"isVegetarian": false, "title": "Beef olives and onion beer gravy", "url": "www_bbc_co_uk_food_recipes_beef_olives_and_onion_11851", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil, for frying", "1 shallot, finely chopped", "2 tbsp chopped mushrooms", "120g/4½oz beef mince", "2 tbsp breadcrumbs", "1 tbsp Dijon mustard", "2 x 80g/3oz slices silverside or rump beef steak ", "2 onions, finely chopped", "1 tbsp plain flour", "100ml/3½fl oz dark ale", "250ml/9fl oz beef stock", "2 tbsp olive oil", "1 leek, roughly chopped ", "4 carrots, peeled and roughly chopped", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a dash of oil in a pan and fry the shallot and mushrooms until soft, then leave to cool.", "Mix the fried vegetables with the mince, breadcrumbs and mustard.", "Shape into two sausages the length of the beef slices, then roll the beef slice around the mixture. Tie with kitchen string, and season with salt and pepper.", "Heat a little more oil in a pan and fry until golden-brown all over. Add the onions and cook until they have coloured a little, then add the flour and beer. Simmer for 5 minutes, then add the stock. Loosely cover and simmer for 30 minutes.", "Meanwhile, toss the leeks and carrots in olive oil and roast in the oven for 25-30 minutes. ", "Serve the beef olives with the leeks and carrots."]}, {"isVegetarian": false, "title": "Beef pasties", "url": "www_bbc_co_uk_food_recipes_beef_pasties_45473", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4.5kg/10lb plain flour, plus extra for dusting", "3 tbsp salt", "2.25kg/5lb lard", "1.2 litres/2 pints cold water", "3kg/6lb 8oz beef skirt or braising steak, chopped into 2cm/1in cubes", "150g/5½oz plain flour", "salt and freshly ground black pepper.", "4.5kg/10lb potato, peeled, roughly chopped", "1.5kg/3lb 5oz swede, peeled, roughly chopped", "1.5kg/3lb 5oz onion, peeled, finely chopped", "10 free-range eggs, beaten"], "serves": "Makes 40 pasties", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, combine the flour, salt and lard and rub together until the mixture resembles breadcrumbs - this can be done in an industrial food processor or in batches. ", "Either by hand, or with the motor still running, gradually add the water in a thin stream until the mixture comes together as a dough. ", "Wrap the pastry in cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/350F/Gas 4.", "For the filling, place the chopped beef and flour in a large bowl and mix until the meat is coated in the flour. Season, to taste, with salt and freshly ground black pepper.", "When the pastry has chilled, divide it into 40 even sized pieces. Roll out each piece of pastry onto a lightly floured work surface until it is just larger than a dinner plate. Make sure not to tear the pastry. ", "Using a dinner plate as a template, trim the edges of each piece of pastry to form a disc. ", "Spoon some of the chopped potato onto one half of each pastry disc, leaving 1.5cm/¾in free along the edges. ", "Spoon some of the chopped swede on top of the layer of potato, and then spoon some of the chopped onion on top of the layer of swede. Finally, spoon over some of the beef.", "Brush all round the edges of the pastry lightly  with a little of the beaten egg. ", "Fold the empty half of the pastry disc over the filled half and either press the edges together with a fork, or twist the edges to seal.", "Brush the top of each pasty with more beaten egg. Using a sharp knife, cut a small cross shape in the top of the pasties through which the steam can escape. Repeat the process with the remaining pastry, vegetables and meat.", "Place the pasties onto a baking tray and transfer to the oven. Bake for 45-50 minutes, or until the pastry is crisp and golden-brown and the filling is cooked through and piping hot.", "When the pasties are cooked, remove them from the oven and set aside to rest for 5-10 minutes before serving."]}, {"isVegetarian": false, "title": "Beef pithivier", "url": "www_bbc_co_uk_food_recipes_beef_pithivier_74073", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz leftover cooked vegetables, roughly chopped", "1 tbsp chopped flatleaf parsley", "sea salt and freshly ground black pepper", "50ml/2fl oz leftover beef gravy, plus extra to serve", "2 x 375g/13oz ready-made all-butter puff pastry", "plain flour, for dusting", "2 tsp wholegrain mustard", "300g/10½oz leftover cooked beef, cut into thin slices", "2 free-range egg yolks, beaten"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7. Line a large baking sheet with silicone baking paper.", "Mix the vegetables and parsley together in a bowl, then season, to taste, with salt and freshly ground black pepper. Squashing the mixture slightly into a mass, adding enough of the leftover gravy for it to stick together.", "Roll out one piece of pastry onto a lightly floured work surface to a thickness of 3mm. Upturn a dinner plate onto the pastry and cut round it using a sharp knife to create a large pastry disc. Find a bowl that is about 3cm/1¼in smaller in diameter than the pastry disc, then upturn it in the centre and use it as a template to score a smaller circle on the pastry. Transfer the pastry disc to the prepared baking tray.", "Prick the inner pastry circle several times with a fork. Spread over some of the mustard, then arrange some of the cooked beef on top, then spread some of the vegetable mixture on top of that, always keeping inside the scored circle.", "Spoon alternate layers of the mustard, beef, and vegetable mixture in the centre of the pastry disc until everything is used up.", "Brush the pastry border with some of the beaten egg.", "Roll out the second piece of pastry onto a lightly floured work surface to a thickness of about 5mm/¼in. Lay the pastry over the top of the dome of filling, pressing down gently around the edges to seal the two pieces of pastry together.", "Trim away any excess pastry. Use any offcuts to decorate the top of the pithivier with a flower shape. Use a butter knife to score details into the petals and stem, if desired.", "Brush the surface of the pithivier all over with the remaining beaten egg. Bake in the oven for 20 minutes, or until the filling is piping hot and the pastry is crisp and golden-brown.", "Serve the pithivier with the remaining leftover gravy."]}, {"isVegetarian": false, "title": "Beef pho", "url": "www_bbc_co_uk_food_recipes_beef_pho_34022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 star anise", "4 cloves ", "2 tbsp coriander seeds", "1 large onion, unpeeled, halved", "1 large thumb-sized piece fresh root ginger, unpeeled and halved", "1.5 litres/2¾ pints beef stock", "1 bone marrow, cleaned ", "3 tbsp fish sauce", "250g/9oz flat rice noodles", "400g/14oz best-quality sirloin steak, fat removed, very thinly sliced", "large handful beansprouts ", "3 spring onions, thinly sliced", "1 red chilli, thinly sliced", "small handful mint leaves", "small handful basil leaves", "small handful coriander leaves", "2 limes, quartered"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to the medium-high setting.", "Place a frying pan over a high heat. When hot, add the star anise, cloves and coriander seeds and toast until aromatic. Transfer to a plate and set aside.", "Put the onion and ginger on a grill pan and place under the grill, turning from time to time, until soft and slightly caramelised, but lightly charred on all sides. Leave to cool a little, then peel the onion and ginger and discard the skins. ", "Put the onion, ginger and toasted spices into a large, lidded pot. Add the stock and bone marrow and bring to a steady simmer. Cover, lower the heat a little and simmer for 30 minutes to allow the flavours to develop and infuse the broth. Add the fish sauce for the last 10 minutes of the cooking time. ", "Strain the broth through a sieve into a clean saucepan and return to the boil.", "Meanwhile, cook the noodles according to the packet instructions, drain and refresh under cold running water to stop the cooking process. ", "Put the noodles in deep bowls and top with the sirloin. Ladle the hot broth over the top. Add the beansprouts, spring onions, chilli, herbs and a wedge of lime at the table. "]}, {"isVegetarian": false, "title": "Beef ragù and courgetti", "url": "www_bbc_co_uk_food_recipes_beef_rag_and_courgetti_60735", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp ghee or butter ", "2 onions, finely chopped ", "2 garlic cloves, finely chopped", "2 dried bay leaves", "¼ tsp mixed spice (or try a tiny pinch of nutmeg)", "2 tsp dried oregano", "400g/14oz beef mince (chuck or braising steak - not lean meat)", "100g/3½oz chicken livers, trimmed and chopped", "250ml/9fl oz red wine", "14 large tomatoes, roughly chopped, or 2 x 400g/14oz tins chopped tomatoes or 800g/1lb 12oz tomato passata ", "2 tsp tomato purée ", "200ml/7fl oz bone broth or water (you won’t need much if using tinned tomatoes)", "2 large carrots, finely grated ", "sea salt and freshly ground black pepper ", "1 large handful fresh parsley, finely chopped", "4 large courgettes ", "knob of butter", "extra virgin olive oil, to serve", "100g/3½oz parmesan, grated, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the ghee or butter in a large saucepan and gently fry the onion over a low heat until softened but not browned (about 10 minutes). Add the garlic, bay leaves, mixed spice, oregano and fry for a further two minutes. ", "Increase the heat and add the beef to the pan, using a wooden spatula to break it up as you cook.", "After five minutes, add the chicken livers, pour in the red wine and stir to deglaze the pan, then add the tomatoes, tomato purée and bone broth or water.", "Bring to the boil, cover with a lid, leaving the lid just slightly off, then reduce to a gentle simmer, stirring occasionally, for 2½ hours, or until rich and thickened. It is even better after 3-4 hours. Keep an eye on it and add more liquid if needed.", "Add the grated carrots 15 minutes before the end of cooking. Turn up the heat to a medium simmer and season with sea salt, a good grind of pepper and the fresh parsley.", "Meanwhile, use a spiralizer or julienne peeler to make the spaghetti from the courgettes. This is the courgetti. Or you can use a regular vegetable peeler to slice the courgettes lengthways into very wide ribbons, which you can then slice in half. You might want to cut the long strands in half to make them easier to eat.", "Soften the courgetti in a pan with a little butter, stirring over a low heat for three minutes. Alternatively, save washing up another pan by just running some of the hot sauce through your spirals – the heat and salt in the sauce will soften them.", "Serve the courgette and beef ragù in bowls. Drizzle each bowl with extra virgin olive oil and serve with grated parmesan."]}, {"isVegetarian": false, "title": "Beef ragu with linguine", "url": "www_bbc_co_uk_food_recipes_beef_ragu_with_linguine_27254", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ragu_with_linguine_27254_16x9.jpg", "ingredients": ["300g/10½oz '00' flour, plus extra for dusting", "3 free-range eggs", "2 tbsp olive oil", "1 onion, finely chopped", "2 garlic cloves, finely chopped", "1 large carrot, finely chopped", "1 celery stalk, trimmed, finely chopped", "200g/7oz smoked bacon lardons", "500g/1lb 2oz beef mince", "2 tbsp tomato purée", "1 x 400g tin tomatoes", "150ml/5fl oz red wine", "handful fresh basil leaves, roughly torn", "salt and freshly ground black pepper", "3-4 tbsp freshly grated Parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the homemade pasta, tip the flour onto a clean work surface and make a well in the centre. Crack the eggs into the well, then gradually draw the flour into the eggs until the mixture comes together as a sticky dough. Knead the dough on a lightly floured work surface until all of the flour has been incorporated and the dough is smooth. Alternatively, blend the flour and eggs in a food processor until the mixture forms small crumbs. Tip it out onto a clean, lightly floured work surface and squish into a ball, then knead for a few minutes until smooth. ", "Wrap the pasta dough in cling film and chill for 20 minutes in the fridge.", "Dust the rollers of your pasta-rolling machine with flour.", "Cut the chilled pasta dough into 3 equally sized pieces and flatten them with the palms of your hand to a thickness of 1cm/½in. ", "Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other.", "Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before.", "Repeat this process 3 or 4 more times, flouring the machine and changing the setting down each time until the last but one setting. You should end up with a long sheet of pasta.", "Repeat the rolling process with the remaining pieces of pasta dough.", "Fold the rolled pasta sheets over into a manageable size, then cut them lengthways to form strips of linguine about 3mm thick. Hang the linguine over a rack so that it can dry out slightly while you make the ragu.", "For the ragu, heat the oil in a large flameproof casserole over a medium heat. Add the onions and garlic and fry for 2-3 minutes, or until softened but not coloured.", "Add the carrot and celery and fry for another 2-3 minutes. Add the bacon and fry for a further 1-2 minutes. ", "Add the beef mince and fry for 2-3 minutes on each side, or until just browned.", "Stir in the tomato purée and continue to cook for 1-2 minutes, then pour in the tinned tomatoes and red wine and bring the mixture to the boil. ", "Stir in half of the basil leaves, then reduce the heat until the mixture is simmering. Simmer for 45 minutes, or until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Stir in the remaining basil leaves just before serving. ", "To serve, bring a large pan of salted water to the boil. Add the pasta and cook for 3-4 minutes, or until tender. Drain well, then add the pasta to the pan of ragu and mix well to coat the pasta in the sauce. Serve sprinkled with the Parmesan."]}, {"isVegetarian": false, "title": "Beef rendang", "url": "www_bbc_co_uk_food_recipes_beef_rendang_62793", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_rendang_62793_16x9.jpg", "ingredients": ["2 lemongrass stalks, dry outer leaves removed, roughly chopped ", "3 medium-sized red onions, quartered", "6 garlic cloves, peeled", "25g/1oz fresh root ginger, peeled and roughly chopped", "75g/2½oz chunk galangal, peeled and roughly chopped ", "3 plump red chillies, roughly chopped without deseeding ", "3 tbsp sunflower oil", "2 tsp ground cumin", "1 tbsp ground coriander", "1 tsp ground turmeric", "1.5kg/3lb 5oz beef chuck steak (or any good braising beef), trimmed and cut into 3cm/1¼in cubes", "400ml/14fl oz can coconut milk", "4 fresh kaffir lime leaves", "1 cinnamon stick", "1 tbsp soft light brown sugar or palm sugar", "2 tsp tamarind paste or freshly squeezed juice of 1 lime", "2 tbsp dark soy sauce", "2 tsp flaked sea salt, plus extra to season", "ground black pepper", "toasted coconut flakes, to serve (optional)"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["In a food processor combine the lemongrass, onions, garlic, ginger, galangal and chillies. Blend to a fine paste (you may need to remove the lid and push the mixture down a couple of times with spatula until the right consistency is reached).", "Heat the sunflower oil in a large flame-proof casserole and fry the paste gently for 3-4 minutes, stirring constantly. Add the cumin, coriander and turmeric and cook for two minutes.", "Add the beef to the pan and stir to coat in the paste and spices. Cook for five minutes, stirring constantly until the meat is very lightly coloured all over. Pour the coconut milk and 400ml/14fl oz cold water into the casserole. Add the lime leaves, cinnamon stick, sugar, tamarind paste or lime juice, soy sauce and salt and bring to a simmer. ", "Reduce the heat and leave to gently simmer uncovered for about 2½-3 hours, or until the meat is meltingly tender and the sauce is very thick, glossy and rich. Stir the beef occasionally towards the beginning of the cooking time then more often as the coconut milk reduces. You don’t want the sauce to stick. Season to taste with more salt and freshly ground black pepper.", "Spoon the curry into warm serving dishes, pick out the kaffir lime leaves and cinnamon stick, and sprinkle with the toasted coconut, if using."]}, {"isVegetarian": false, "title": "Beef rendang with mango chutney and sticky rice", "url": "www_bbc_co_uk_food_recipes_beef_rendang_with_mango_78223", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemongrass stalks, roughly chopped", "20g/¾oz coriander seeds", "½ tsp cumin seeds", "½ tsp ground turmeric", "1 star anise", "3 cardamom pods, crushed and seeds removed", "50g/1¾oz coconut cream", "1½ large onions, sliced", "3 garlic cloves, chopped", "3 red chillies, seeds removed, chopped", "1 thumb-sized piece fresh root ginger, peeled and chopped", "1 bay leaf", "750g/1lb 10oz beef shin, boneless and cut into 2.5cm/1in cubes", "1 x 400g/14oz tin coconut milk", "250ml/9fl oz strong veal or beef stock, heated", "1 tsp black mustard seeds", "1 tsp black peppercorns", "1 tsp cumin seeds", "1 tsp dried chilli flakes", "1 tsp coriander seeds", "1 green (under ripe) mango, sliced", "2 ripe mangoes, sliced", "125g/4½oz light soft brown sugar", "110ml/3¾fl oz malt vinegar", "400g/14oz sticky rice", "1 tsp salt"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef rendang, pound the lemongrass to a pulp in a pestle and mortar. ", "Gently toast the coriander seeds, cumin seeds and turmeric, star anise and cardamom in a dry frying pan until fragrant, then grind until the spices are as smooth as possible.", "In a wide pan (or cast-iron wok), heat the block of coconut cream until it melts, but keep the heat low so it does not burn. Add the onions, garlic, chillies, ginger and pounded lemongrass and cook gently until the onions have softened and the mixture starts to smell beautiful and fragrant. ", "Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma. Stir in the beef and increase the heat so that it browns it well and is completely coated with the spices – this will take a few minutes. ", "Add the coconut milk, bring to the boil and then add the hot stock. Turn the heat up to high and continue cooking - the amount of liquid will quickly reduce. Only stir occasionally until the sauce reduces to a thick paste. Reduce the heat and keep cooking and stirring until the sauce becomes thick like lava and really coats the meat – at least 1-1½ hours.", "For the mango chutney, heat a frying pan until hot. Add all the spices and toast for 30 seconds, or until the mustard seeds start to pop. Add the green mango and ripe mangoes and cook for 1-2 minutes. Add the sugar and cook until dissolved into the mango juices, then add the vinegar.", "Cover with a lid and reduce the heat. Simmer for 25 minutes, or until the mango has broken down and the mixture resembles chutney.", "For the sticky rice, rinse the rice three times and drain thoroughly.", "Cook the rice according to the packet instructions, or place it in a saucepan and cover with water up to the first knuckle on your finger. Add the salt, cover with a lid and bring to the boil. Boil for five minutes, then, without opening the lid, turn the heat off and let the rice steam for 20 minutes. ", "To serve, pile the rice onto serving plates, and add the beef rendang alongside with a spoonful of the mango chutney."]}, {"isVegetarian": false, "title": "Beef ribs with barbecue sauce, baked potato and chive soured cream", "url": "www_bbc_co_uk_food_recipes_beef_ribs_with_bbq_sauce_80391", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_ribs_with_bbq_sauce_80391_16x9.jpg", "ingredients": ["4 Jacob’s ladder beef ribs", "1 onion, chopped", "1 head of garlic, cut in half horizontally", "1 tsp fennel seeds", "2 star anise", "4 baking potatoes", "a little oil", "sea salt and freshly ground black pepper", "200ml/7fl oz double cream", "1 lemon, juice only", "3 tbsp chives, finely sliced", "25g/1oz butter, plus extra to serve", "1 onion, roughly chopped", "1 garlic clove, crushed", "2 red chillies, finely sliced", "1 tsp fennel seeds, crushed", "2 star anise", "150g/5½oz light muscovado sugar", "300g/10½oz tomato ketchup", "150g/5½oz chipotle chilli ketchup", "150ml/5fl oz dark soy sauce"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Place the ribs in a large, wide saucepan. Cover with water and add the onion, garlic, fennel seeds and star anise.", "Bring to a boil, then reduce the heat and simmer very gently for three hours, or until the meat is tender, skimming any scum off occasionally.", "Preheat the oven to 200C/400F/Gas 6.", "Rub the baking potatoes with a little oil. Create four small piles of sea salt in a baking tray then place the potatoes on top. Bake for 1-1½ hours, or until tender.", "Meanwhile, make the bbq sauce. Heat a sauté pan until hot and add the butter, onions and garlic and fry for 4-5 minutes, or until softened.", "Add the chillies, fennel seeds, star anise and sugar. Cook for a further 3-4 minutes until the sugar has dissolved. ", "Add the ketchups and soy sauce and bring to the boil. Reduce the heat and simmer for five minutes, or until thickened.", "Remove from the heat and cool slightly before placing in a blender. Pulse to form a smooth pureé.", "Dip the ribs into the sauce then place into a roasting tray and spoon some more sauce over the top. Place in the oven with the potatoes for 15-20 minutes until sticky. ", "While the ribs cook, put the double cream, lemon juice, chives and a pinch of salt into a large bowl and whisk until thickened.", "Serve the ribs with the jacket potato topped with a dollop of butter and soured cream."]}, {"isVegetarian": false, "title": "Beef shin and blue cheese cobbler", "url": "www_bbc_co_uk_food_recipes_beef_shin_and_blue_34138", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz shin of beef", "plain flour, for dusting", "1 tbsp olive oil", "100g/3½oz butter", "150g/5½oz smoked panetta, roughly chopped", "4 onions, thinly sliced", "½ head celery, thinly sliced", "2 tbsp soft brown sugar", "2 tbsp red wine vinegar", "500ml/18fl oz dark Belgian beer", "1–2 bay leaves", "2 thyme sprigs", "1 head garlic, cut in half", "salt and freshly ground black pepper ", "1 tbsp finely chopped parsley, to garnish", "250g/9oz self-raising flour", "50g/1¾oz butter, chopped", "1 tsp salt", "1 tsp finely chopped thyme", "150g/5½oz Stilton, crumbled", "150ml/5fl oz milk"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Season the beef and roll in a little flour.", "Heat the oil in a large casserole dish and sear the beef all over. Remove the beef and set aside. ", "Melt the butter, then add the pancetta, onions and celery and cook until the onions are soft and the pancetta is crisp. ", "Return the beef to the pan, then add the sugar and vinegar. Allow to bubble then pour in the beer. Add the herbs and garlic and cook for 2–3 hours, or until the beef is tender and falling apart.", "Remove the dish from the oven and increase the oven temperature to 200C/180C Fan/Gas 6. ", "To make the topping, rub the flour and butter together with the salt and thyme. Stir in the cheese and slowly add the milk. Mix until you have a rough dough. ", "Roll the dough into a 3cm/1¼in thick log. Cut it into slices and layer it over the beef stew.", "Cook for 25–30 minutes. Sprinkle over the parsley and serve."]}, {"isVegetarian": false, "title": "Beef steak burger with truffle mayonnaise, tomato chutney in a brioche bun with fries", "url": "www_bbc_co_uk_food_recipes_beef_steak_burger_with_02716", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz minced beef steak", "2 large chipping potatoes, peeled and cut into thin fries", "vegetable oil, for deep-frying", "4 brioche rolls", "8 gherkins, sliced", "4 beef tomatoes, sliced", "½ round lettuce, leaves separated", "1 red onion, sliced", "1 tbsp olive oil", "½ shallot, chopped", "1½ tomatoes, chopped", "1 garlic clove, crushed", "1 tbsp balsamic vinegar", "1 tsp brown sugar", "3 egg yolks ", "2 tsp Dijon mustard ", "150ml/5fl oz light olive oil ", "100ml/3½fl oz sunflower oil ", "50ml/2fl oz truffle oil", "2 tbsp lemon juice ", "few shavings of black truffle (optional)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the burger and fries, put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into four burger-shaped patties. Wrap the patties individually in cling film and place in the fridge for an hour.", "Meanwhile, for the tomato chutney, heat the oil in a small pan. Add the shallot, tomatoes and garlic and cook for 5-8 minutes until softened. Add the vinegar and sugar and cook for 3-5 minutes until the chutney has caramelised slightly.", "For the truffle mayonnaise, put the egg yolks, mustard and a pinch of salt and pepper in a food processor and combine. Mix the oils in a jug, then, with the motor running, slowly pour oil through the feed tube until you have a thick emulsion. Mix in the lemon juice and a little warm water to loosen, if necessary. ", "The mayonnaise will keep for up to 2 days in the fridge. Just before serving, stir in the truffle shavings.", "When you are ready to cook the burger and fries, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep saucepan until a cube of bread sizzles and turns brown when dropped in. (CAUTION: Hot oil can be dangerous; do not leave unattended.) ", "Carefully add the potatoes to the fryer and cook for 2-3 minutes, or until just coloured and crisp. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper. Season with salt.", "Heat a large frying pan with a little oil. Cook the burgers on each side for 2-3 minutes, or until cooked to your liking (you can serve the burger rare as you are using fresh steak mince).", "To serve, put each burger in a brioche roll topped with the gherkins, tomato slices, chutney, lettuce, a few onion slices and the truffle mayonnaise. Secure with a wooden skewer and serve with the fries."]}, {"isVegetarian": false, "title": "Beef stew and dumplings with Vichy carrots", "url": "www_bbc_co_uk_food_recipes_beef_stew_and_dumplings_09183", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "25g/1oz unsalted butter", "750g/1lb 10oz stewing steak, cut into 2-3cm/¾-1¼in pieces", "2 tbsp plain flour", "2 garlic cloves, chopped", "250g/9oz round shallots, peeled and left whole", "150ml/5½fl oz red wine", "500ml/18fl oz beef stock", "2 fresh bay leaves", "3 tbsp fresh thyme leaves", "Worcestershire sauce, to taste", "salt and black pepper", "125g/4½oz plain flour", "1 tsp baking powder", "pinch salt", "60g/2¼oz suet", "4 medium carrots, peeled and left whole", "50g/1¾oz unsalted butter", "1 tbsp sugar"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.", "Sprinkle over the flour and cook for a further 2-3 minutes. Add the garlic and shallots and fry for 1-2 minutes.", "Stir in the wine, stock and herbs, then add the Worcestershire sauce to taste. Season to taste with salt and freshly ground black pepper.", "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.", "For the dumplings, sift the flour, baking powder and salt into a bowl. Add the suet and enough water to form a thick dough. With floured hands, roll spoonfuls of the dough into small balls.", "After two hours, remove the lid from the stew and place the dumpling balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)", "For the Vichy carrots, place the carrots, butter, sugar and four tablespoons of water into a pan and bring to a simmer.", "Cover with a lid or cartouche (a circle of greaseproof paper arranged so that it covers the top of the carrots) and cook gently for 4-5 minutes, or until the carrots are tender. Season with salt and black pepper.", "To serve, place a spoonful of the stew onto a plate and place one whole carrot and a dumpling next to it."]}, {"isVegetarian": false, "title": "Beef in oyster sauce", "url": "www_bbc_co_uk_food_recipes_beef_in_oyster_sauce_14507", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_in_oyster_sauce_14507_16x9.jpg", "ingredients": ["450g/1 lb fillet of beef, cut into 5cm/2in thin strips", "1 tbsp light soy sauce", "2 tsp sesame oil", "1 tbsp Shaoxing rice wine or dry sherry", "2 tsp cornflour", "3 tbsp groundnut or vegetable oil", "3 tbsp oyster sauce", "1½ tbsp finely chopped spring onions", "2 tsp Dijon mustard", "2 tsp Madras curry powder", "2 tbsp light soy sauce ", "2 tsp salt", "1 tsp freshly ground black pepper", "4 tbsp extra virgin olive oil ", "100g/3½oz broccoli florets, cut into small florets", "100g/3½oz French beans, trimmed ", "100g/3½oz cauliflower florets, cut into small florets", "100g/3½oz peas", "225g/8oz fresh tomato, peeled, seeds removed, chopped", "50g/2 oz fresh water chestnuts, peeled, sliced", "3 tbsp finely chopped shallots, squeezed dry through a linen cloth ", "3 tbsp finely chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Put the beef, soy sauce, sesame oil, Shaoxing rice wine or dry sherry and cornflour into a bowl and mix together until well combined. Set aside to marinate for 20 minutes.", "Heat a wok or large frying-pan until it is very hot. ", "Add the oil, and when it is very hot and slightly smoking, add the beef slices and stir-fry for 5-6 minutes or until they are pale golden-brown. ", "Remove the beef strips and set aside to drain in a colander over a bowl. Discard the drained oil.", "Wipe the wok or pan clean and reheat it over a high heat until it is hot. ", "Add the oyster sauce, and bring to a simmer. ", "Return the drained beef slices and mix them thoroughly with the sauce. ", "Turn the mixture onto a serving platter and garnish with the spring onions.", "Meanwhile, for the salad, mix the mustard, curry powder, soy sauce, salt, pepper and olive oil together in a bowl. ", "Cook the broccoli, green beans and cauliflower in boiling water for 2-3 minutes, then add peas and cook for 1-2 minutes.", "Drain the vegetables into a warm bowl, then add the water chestnuts and tomatoes, shallots and chives.  Drizzle over the salad dressing and mix until well combined.", "Serve the salad alongside the beef."]}, {"isVegetarian": false, "title": "Beef stew with fluffy dumplings", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_fluffy_95002", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_fluffy_95002_16x9.jpg", "ingredients": ["1kg/2lb 4oz silverside beef, cut into large pieces", "1 tsp plain flour", "2 tbsp vegetable oil", "2 onions, cut into chunks", "3 carrots, scrubbed and cut into large pieces", "4 sticks celery, cut into large pieces", "1 tbsp tomato purée", "300ml/10½fl oz red wine", "500ml/18fl oz beef stock", "2 sprigs fresh parsley", "1 bay leaf", "3 sprigs fresh thyme", "2 garlic cloves, finely sliced", "25g/1oz butter", "1 tsp redcurrant jelly", "200g/7oz plain flour, plus extra for dusting", "1½ tsp baking powder", "100g/3½oz suet, shredded ", "2 tbsp finely chopped flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dredge the beef in the flour until coated.", "Heat half of the vegetable oil in a large, lidded casserole dish over a high heat. Fry the beef, in batches, until browned on all sides, about 3-4 minutes. Remove and set aside.", "Add the onions, carrots and celery to the casserole and fry for 2-3 minutes. Add the tomato purée, stir well, then cook for a further 1-2 minutes.", "Pour in the red wine, bring it to the boil, then reduce the heat until the mixture is simmering and simmer until it has reduced in volume by half. Add the beef stock and return the mixture to a simmer. Return the beef to the casserole and stir well. ", "Tie the herbs together as a bouquet garni using cooking string and add it to the casserole. Finally, stir in the garlic. ", "Cover the stew with the lid and simmer gently for 1½ hours, or until the beef is really tender.", "For the dumplings, in a bowl, mix together the flour, baking powder, suet, chopped parsley and a pinch of salt, then gradually add 3-5 tablespoons water, mixing as you do so, until the mixture comes together as a slightly sticky dough (you might not need to use all of the water). ", "Turn out the dough onto a lightly floured work surface and roll into small balls, each half the size of a golf ball. Set aside until the stew is ready.", "Remove the bouquet garni from the stew, season, to taste, with salt and freshly ground black pepper, then stir in the butter and redcurrant jelly.", "Top the stew with the dumplings, cover the casserole with the lid, then return to the oven for 10-15 minutes, or until the dumplings have puffed up and are cooked through. Serve in bowls."]}, {"isVegetarian": false, "title": "Beef stew with light herby dumplings", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_light_80291", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_light_80291_16x9.jpg", "ingredients": ["spray oil, for frying", "600g/1lb 5oz lean stewing beef, all visible fat removed", "1 litre/1¾ pints beef stock, made from 2 low-sodium cubes", "1 large onion, finely chopped", "2 garlic cloves, crushed", "2 celery sticks, finely chopped", "3 carrots, 1 finely chopped, rest cut into chunks", "1 tbsp tomato purée", "1 tbsp balsamic vinegar", "1 parsnip, cut into chunks", "300g/10½oz butternut squash (about half a squash)", "150g/5½oz self-raising flour", "pinch salt and freshly ground black pepper", "2 tbsp chopped fresh parsley or thyme (depending on preference) ", "1 egg yolk, lightly beaten", "1 tsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Preheat a casserole dish on the hob, then spray with oil. Add the beef in batches, cooking each batch until browned all over and spraying with more oil as needed. Transfer the beef to a plate using a slotted spoon and set aside. Add a little stock to the dish, turn the heat up to high, and deglaze by scrubbing off the cooked-on bits with a spatula. ", "Turn down the heat and spray the dish with more oil. Add the onion and cook until softened. Add the garlic and cook for 1-2 minutes. Add the celery and finely chopped carrot and cook for 3-4 minutes. Stir in the tomato purée and balsamic and cook for 2-3 minutes more. Return the meat to the pan and stir in the rest of the stock, then bring to the boil.", "Put the dish in the oven (without a lid) and cook for 1 hour. ", "Add the parsnip, butternut squash and carrot chunks, put the lid on the dish and cook for another 30 minutes.", "For the dumplings, put the flour in a mixing bowl with the salt and pepper. Mix in the herbs. Add the egg and oil and mix, adding just enough cold water to bring it together as a dough (about 4 tbsp). Be careful not to add too much water as this will make the dumplings heavy. Knead the mixture a little.", "Shape into eight golf-ball-sized pieces and put on top of the stew, pushing down a little to coat in the juices. Cover with the lid and return to the oven for 15 minutes, then remove the lid and cook for a further 15 minutes. ", "When the dumplings are golden-brown, lift them out of the stew into serving bowls and stir the stew (the squash will be very tender, which will thicken and flavour the sauce). Serve immediately."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_16029", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stroganoff_16029_16x9.jpg", "ingredients": ["½ tbsp light olive oil ", "1 large onion, finely sliced", "3 garlic cloves, finely chopped", "1 beef stock cube", "2 tsp sweet smoked paprika", "1 tbsp tomato purée", "400g tin beef consommé", "150g/5½oz chestnut mushrooms, thinly sliced", "1 tbsp Dijon mustard", "2 rump steaks (175g/6oz each), visible fat trimmed", "olive oil spray", "60g/2¼oz cornichons or small gerkins, sliced", "75ml/2½fl oz half-fat crème fraîche", "2 tbsp finely chopped flatleaf parsley", "2 tbsp roughly chopped chervil", "2 tbsp dried onion flakes", "sea salt and freshly ground black pepper", "160g/5¾oz basmati rice, freshly cooked"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the light olive oil in a large frying pan over a low–medium heat. Add the onion and cook gently for 10 minutes, or until softened and starting to caramelise.", "Stir in the garlic and cook gently for 2 minutes. Crumble in the stock cube and stir in the paprika and tomato purée. Cook, stirring, for 2 minutes. Add the beef consommé, mushrooms and mustard. Bring to the boil then lower the heat and simmer for 10–15 minutes, or until the volume of liquid has reduced by half.", "Meanwhile, place a griddle pan over a high heat. Bash the steaks between two sheets of cling film, until about 5mm/¼in thick. Spray each side with six sprays of oil and season with salt and pepper. When the griddle is smoking hot, add the steaks and cook for 1 minute on each side. Remove and set aside to rest.", "Once the sauce has reduced, remove from the heat and stir through the cornichons, crème fraîche, and most of the parsley and chervil (reserving some for garnishing). Stir in the juices from the resting meat and check the seasoning. Cut the meat into thick slices and stir into the sauce.", "Mix together the dried onion flakes and reserved chopped parsley and chervil. Serve the stroganoff sprinkled with the onion and herb mix, with the rice on the side, if you like."]}, {"isVegetarian": false, "title": "Beef stroganoff", "url": "www_bbc_co_uk_food_recipes_beef_stroganoff_21900", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz vegetable oil ", "4kg/8lb 12oz braising steak, cut into thin strips", "10 large onions, sliced", "15 red peppers, seeds removed and sliced ", "2.5kg/5lb 8oz button mushrooms, sliced", "2 tbsp paprika", "1 litre/1¾ pints water", "2.5 litres/4½ pints plain yoghurt"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the vegetable oil in large frying pans and add the meat. Fry for 2-3 minutes, turning once or twice, until the meat is browned all over then remove the meat from the pan and set aside. ", "Add a little more oil if necessary and fry the onions for 3-4 minutes or until just starting to soften, then stir in the peppers and cook for a further 3-4 minutes. Add the mushrooms and cook for a further five minutes.", "Sprinkle in the paprika and stir to coat the vegetables then add the water and yoghurt and reduce the heat.  ", "Stir in the beef and any resting juices. Transfer to ovenproof dishes, cover with aluminium foil and cook in the oven for about one and a half hours or until the meat it tender and the sauce is thick."]}, {"isVegetarian": false, "title": "Beef sukiyaki", "url": "www_bbc_co_uk_food_recipes_beef_sukiyaki_84557", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175ml/6fl oz liquid instant dashi ", "150ml/5fl oz soy sauce", "50ml/1¾fl oz mirin ", "2 tbsp groundnut oil ", "2 tsp sesame oil", "450g/1lb fillet or well-trimmed rib-eye beef steak, thinly sliced (a little thicker than carpaccio)", "1½ tbsp sugar ", "12 button mushrooms, sliced", "4 brown cap mushrooms sliced", "100g/3½oz enoki mushrooms, split into 4", "6 fresh shiitake mushrooms (remove stalks and cut in ½)", "½ Chinese cabbage (ideally Napa cabbage) sliced 2.5cm/1in thick ", "1½ sticks celery, sliced on a diagonal 5mm/¼in thick ", "160-175g/5¾-6oz block firm tofu, cubed ", "200g/7oz sliced bamboo shoots sliced, vacuumed-packed (alternatively used canned and drained bamboo shoots) ", "6 spring onions, cut into 2.5cm/1in pieces on a slant ", "cooked rice, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, mix the liquid dashi with 175ml/6fl oz of water in a jug to bring the total liquid to 375ml/13fl oz. Stir in the remaining ingredients for the sauce. Set aside.", "For the beef, heat a large lidded frying pan that’s suitable to serve at the table. Heat the groundnut oil and sesame oil until hot. Add the beef and sprinkle the sugar over. The sugar will help caramelise the meat.  Turn the meat over after about 30 seconds - as the beef is so thin it will cook very quickly.", "Remove the meat from the pan. Add the mushrooms, cabbage, celery, tofu and bamboo shoots to the same pan and cook for another two minutes - just to brown the tofu slightly and to wilt the cabbage. You do not want to over-cook as you still want to retain the textures of the celery.", "Add the sukiyaki sauce to the pan, put the lid on and simmer for two minutes.", "Remove the lid, turn the vegetables and the tofu over and then combine the beef into the vegetables. Add the spring onions and simmer for a further two minutes.", "Serve in the pan at the table so that everyone can help themselves, or divide the mixture into four bowls with a bowl of rice each."]}, {"isVegetarian": false, "title": "Beef tournedos Rossini", "url": "www_bbc_co_uk_food_recipes_beef_tournedos_rossini_16043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "4 slices white bread", "1 tbsp olive oil", "4 x 200g/7oz beef fillet steak", "8 tbsp madeira", "200ml/7fl oz beef stock", "5 peppercorns", "50g/1¾oz unsalted butter", "200g/7oz wild mushrooms", "a few slices of fresh truffle", "1kg/2lb 4oz white potatoes, peeled and cut into chunks", "300ml/10fl oz double cream", "300ml/10fl oz whole milk", "100g/3½oz unsalted butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Rossini, heat a small frying pan and add a little of the butter. Cut the crusts off the bread and cut to the same size as the steak. Add the bread to the pan and toast on each side.", "Heat a separate frying pan and add the oil. Cook the steak to your liking. Remove from the pan and place on the toasted bread to rest.", "In the pan you cooked the steaks in add the madeira. Deglaze the pan by scraping off the stuck on parts from cooking the steak. Cook until the volume of liquid is reduced by half, then add the beef stock and peppercorns. Cook for 2-3 minutes, then strain through a fine sieve into a clean pan and finish with a knob of butter.", "In a separate frying pan, add the remaining butter and, once hot, add the wild mushrooms and cook for 2-3 minutes.", "For the mash, place the potatoes into a large pan filled with cold water and bring to the boil. Cook for 15-20 minutes, or until the potatoes are soft.", "Drain and place back in the pan. Mash or rice the potatoes. Add the cream, milk and butter and mix to form a smooth mash.", "To serve, add a few shavings of truffle to the sauce. Place a spoonful of the mash onto serving plates, place the bread and steak next to it and pour the sauce over the steaks. Finish with more truffle shavings and scatter the wild mushrooms around the steak."]}, {"isVegetarian": false, "title": "Beef tournedos Rossini with Madeira sauce", "url": "www_bbc_co_uk_food_recipes_beef_tournedos_rossini_68537", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 200g/7oz beef fillet steaks", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "115g/4oz butter", "1 onion, skin on, halved", "150ml/5fl oz Madeira", "150ml/5fl oz red wine", "250ml/9fl oz beef or veal stock", "250g/9oz baby spinach leaves", "1 pinch freshly grated nutmeg", "175g/6oz duck liver pâté", "4 slices brioche "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the beef with salt and freshly ground black pepper.", "Heat a frying pan until hot, add the oil and some of the butter, seal the beef on each side for three minutes then remove from the heat and set aside to rest.", "Heat a sauté pan until hot; add some more of the butter and the onion, cut side down. Fry until the bottom of the onion is very browned then add the Madeira and cook until reduced by half.", "Add the red wine, reduce again then add the stock and cook once more until reduced by half. Strain into a clean pan then whisk in 25g/1oz of the butter and season with salt and freshly ground black pepper. Keep warm.", "Heat a frying pan until hot, add a little more butter and the spinach, cook until the spinach has wilted down then season with a little salt, freshly ground black pepper and nutmeg. Drain the spinach onto kitchen paper. ", "Heat the last of the butter in a clean frying pan until foaming then add the brioche slices and cook on each side until golden brown. Remove from the pan and drain onto kitchen paper.", "To serve, lay the brioche onto the centre of the plate then spread the duck liver pâté over the top. Place a pile of spinach on top then the rested steaks. Finish with a ladle of Madeira sauce over the top."]}, {"isVegetarian": false, "title": "Beef Wellington", "url": "www_bbc_co_uk_food_recipes_beef_wellington_22208", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_22208_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp vegetable oil", "2 shallot, finely diced", "8 chestnut mushrooms, chopped", "2 tbsp cream", "dash vegetable oil, to fry", "1.2kg/2lb 12oz beef fillet", "salt and pepper, to taste", "3-4 crêpes (you can use ready- made)", "225g/8oz ready-made puff pastry", "2 free-range egg yolks, lightly beaten ", "1 garlic clove, halved", "1kg/2lb 4oz waxy spuds, peeled and very finely sliced (preferably on a mandoline)", "500ml/18fl oz double cream", "salt and pepper, to taste", "knob of butter", "1 shallot, finely diced", "100ml/3½fl oz port", "100ml/3½fl oz Madeira", "500ml/18fl oz veal stock (or beef or chicken stock)", "1 heaped tbsp truffle peelings in brine, drained"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the mushroom duxelle, heat the butter and vegetable oil in a frying pan. Once hot, add the chopped shallots and fry, stirring all the time, for two minutes. Tip in the chopped mushrooms. Reduce the heat a little and continue stirring and cooking for about ten minutes until the mushrooms are softened and their liquid has evaporated. Stir in the cream and cook for a further two minutes, then remove from the heat and leave to cool.", "For the Wellington, heat the oil in a frying pan over a high heat. Season the fillet all over with salt and pepper. Once the oil is smoking, add the beef and fry on all sides until it is a lovely caramel-brown colour. Remove to a plate and leave to cool. (NB. Don’t wash up the pan. Use this to make the Madeira and port reduction later.)", "Place the crêpes onto the work surface, one layer thick, but overlapping - you need to create an area about twice the thickness of the fillet, and about 2.5cm/1in longer at each end. Spread the mushroom duxelle over the crêpes. ", "Lightly pat the fillet with kitchen paper to remove any excess moisture, before placing the meat on top of the duxelle.", "Carefully roll the side closest to you over the meat encasing it within the crêpes and mushrooms. The crêpes should cover the meat on all sides, but trim off any excess. ", "Place the wrapped fillet onto a sheet of clingfilm and wrap up tightly into a cylinder. Set aside in the fridge until completely cold, about half an hour.", "Meanwhile for the potato dauphinoise, preheat the oven to 150C/300F/Gas 2.", "Rub the inside of a deep baking dish or casserole with the raw garlic. ", "Place the sliced potatoes in a bowl and pour over the cream and season with salt and freshly ground black pepper. Stir to coat the potatoes, then lay them evenly in the garlicky baking dish.", "Cover the dish with foil and bake in the oven for 30 minutes. Remove the foil and cook for a further 20-30 minutes while you prepare the Wellington.", "Roll the pastry out on a well-floured surface to a rectangle with a thickness of about 3mm.", "Brush the pastry with beaten egg yolk. Remove the clingfilm from the beef fillet and place onto the middle of the pastry. ", "Wrap the pastry up over the beef fillet. Lightly stretch one edge of the seam so that it is not too thick, then press down firmly to seal.", "You should be left with a tube that is open at either end. Lightly press the ends of the pastry together using a rolling pin to seal and thin the two pieces. Then with a small knife, trim the edges on each side to form a triangle shape. Brush the triangle of pastry with a little egg and press it up against the side of the Wellington. Repeat with the other side before flipping over so that the Wellington is seam-side down. ", "Place your Wellington onto a baking tray, brush with the remaining egg yolk set aside in the fridge to chill for 5-10 minutes.", "Increase the oven temperature to 180C/350F/Gas 4 (the dauphinoise should remain in the oven).", "Remove the Wellington from the fridge and score a pattern of your choice onto the top. ", "Place in the oven with the potatoes dauphinoise and bake for 25 minutes. Remove the Wellington from the oven and leave to rest for 10 minutes. This should give you a perfectly pink finish to your meat. If you prefer it more cooked, then leave in the oven for longer, but you must ensure the meat is well rested.", "For the Madeira and port reduction, heat the butter in the same pan in which you cooked the beef fillet over a medium heat. Once bubbling, add the shallot and fry for 3-4 minutes, or until softened. ", "Increase the heat and add the port and Madeira. Simmer until the volume of liquid has reduced by half and then add the stock. Reduce again by half. When the sauce has a thick, syrupy consistency, strain through a fine sieve.  Stir in the truffle peelings and keep warm until ready to serve. ", "Serve slices of the beef Wellington with the potato dauphinoise alongside and the Madeira and port reduction."]}, {"isVegetarian": false, "title": "Beef Wellington", "url": "www_bbc_co_uk_food_recipes_beef_wellington_95545", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["10g dried porcini", "1 tbsp butter", "3 shallots, finely chopped ", "300g/10½oz chestnut mushrooms, finely chopped", "3 thyme sprigs ", "100ml/3½fl oz brandy ", "100ml/3½fl oz single cream", "6 thick beef fillet steaks with a good marbling of fat", "1 tbsp olive oil", "2 tsp English mustard", "plain flour, for dusting", "500g/1lb 2oz puff pastry", "1 large free-range egg, beaten", "sea salt and freshly ground black pepper ", "400g/14oz seasonal greens, steamed"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the filling, first soak the porcini in boiling water for 10–15 minutes until they are plump and tender. Drain, reserving the soaking liquid, and chop finely.", "Melt the butter in a large non-stick frying pan over a medium heat until foaming. Add the shallots and fry for 6 minutes until softened. Stir in the porcini and the chestnut mushrooms together with the thyme and cook for 6 minutes until tender. Pour in the mushroom soaking liquid, brandy and cream and simmer until the liquid has reduced and the mixture thickened. Put the filling into a clean bowl and leave to cool completely.", "For the beef Wellington, season the steaks with sea salt and freshly ground black pepper. Wipe the pan used to cook the filling with kitchen paper and then place it back over a high heat with a little oil and brown the steaks, in batches if necessary, for about 1 minute on each side. Remove from the heat and rest for at least 30 minutes. When completely cooled, brush each one with mustard.", "Preheat the oven to 220C/200C Fan/Gas 7. Dust a work surface with flour and roll out the puff pastry into a large rectangle measuring about 45x30cm/18x12in and about 3mm thick. Divide the rectangle into six squares, each one big enough to wrap all the way around each fillet.", "Divide the mushroom mixture among the six squares and spread over the pastry, leaving 1cm uncovered all the way around the edge. Place the beef fillet on top. Brush the pastry edges with the egg, then lift the pastry edges over the beef and turn over tucking in the edges neatly. Put the parcels on a baking tray, seam-side down.", "Cook in the oven for 15–20 minutes for medium rare, or to your liking.", "Remove from the oven to rest for 5 minutes before serving on warmed plates with steamed greens."]}, {"isVegetarian": false, "title": "Beef Wellington with tarragon sauce", "url": "www_bbc_co_uk_food_recipes_beef_wellington_with_35577", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_with_35577_16x9.jpg", "ingredients": ["1.3kg/2lb 14oz middle-cut fillet of beef", "1 tbsp oil ", "1½ x 375g packets all-butter puff pastry", "plain flour, for dusting", "1 egg, beaten with a dash of milk", "salt and freshly ground black pepper", "large knob of butter", "350g/12oz mixed mushrooms (such as button, chestnut, wild), thinly sliced", "50g/1¾oz Parmesan, finely grated ", "1 tbsp finely chopped tarragon", "2 tsp Dijon mustard", "1 egg yolk", "small knob of butter", "100g/3½oz button mushrooms, finely sliced", "1 tbsp plain flour ", "400ml/14fl oz full-fat crème fraîche", "1 tbsp Dijon mustard", "1 tbsp freshly chopped tarragon", "a pinch sugar"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Season the beef with salt and pepper. Place a large frying pan over a high heat, add the oil and fry the beef on all sides until browned. Transfer to a baking tray and roast in the oven for 15–18 minutes. Turn the oven off and remove the beef. Leave to cool, reserving any cooking juices, and then chill in the fridge for at least 1 hour (see tip).", "Next make the topping. Melt the butter in the same pan and fry the mushrooms over a high heat for 5–10 minutes – you may need to do this in batches. Tip the mushrooms into a sieve set over a bowl to collect the juices and reserve these for the sauce. Transfer the mushrooms to another bowl and allow to cool before mixing with the Parmesan, tarragon, mustard and egg yolk. Season with salt and pepper and chill in the fridge for 30 minutes.", "Line a baking sheet with baking paper. Sit the single 375g packet of pastry on a floured work surface and roll out to a square about 40cm/16in in size, then transfer it to the baking sheet. Place the cooked beef to one side of the pastry and spoon the mushroom mixture on top. Fold over the ends of the pastry and then fold the longest edge over the beef, sealing along the side with a little of the egg wash. Chill in the fridge for 30 minutes. While it is chilling, preheat the oven again to 220C/200C Fan/Gas 7.", "Brush the top of the chilled beef Wellington with egg wash. Roll out the remaining half block of pastry and cut into 8 thin strips: lay 4 strips diagonally, and evenly spaced, across the top of the beef Wellington, and 4 strips across these to create a lattice pattern. Brush the lattice with egg wash and then roast in the oven for 30–35 minutes or until the pastry is golden-brown and crisp.", "Meanwhile, make the tarragon sauce. Melt the butter in the same frying pan and fry the mushrooms over a high heat for 5–10 minutes or until the juices evaporate. Sprinkle in the flour and add the crème fraîche with the reserved mushroom juices (from the topping), the mustard and tarragon. Season with salt, pepper and sugar and bring to the boil, stirring. Simmer for 3 minutes until reduced slightly and add any beef juices from the original baking tray. Keep hot.", "Allow the beef Wellington to rest, covered with foil, for 15 minutes before carving. Slice into thick slices and serve with the hot tarragon sauce."]}, {"isVegetarian": false, "title": "Beef Wellington with wild mushroom Madeira sauce", "url": "www_bbc_co_uk_food_recipes_beef_wellington_with_98256", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_with_98256_16x9.jpg", "ingredients": ["1 tsp olive oil", "1 x 1kg/2lb 4oz beef fillet (ask your butcher for the middle section)", "50-100g/2-3½oz butter", "4 Portobello mushrooms, cleaned and very finely chopped", "150g/5½oz baby spinach leaves", "2 free-range eggs, plus 3 free-range egg yolks", "60g/2¼oz plain flour", "200ml/7fl oz milk", "150g/5½oz chicken liver pâté", "500g/1lb 2oz readymade puff pastry", "150g/5½oz mixed wild mushrooms, cleaned and trimmed", "50ml/2fl oz Madeira", "300ml/10fl oz concentrated beef stock (boil 600ml/1 pint beef stock until the volume has reduced by half)", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 100C/80C Fan/Gas ½.", "Heat the oil in frying pan over a high heat. Quickly fry the beef fillet, turning it every few seconds, until browned on all sides.", "Cut 4 large pieces of heatproof cling film or aluminium foil big enough to roll the beef fillet in, and place them on top of each other. Place the beef fillet in the centre and wrap it very tightly to form a cylinder, twisting the ends to secure. Place the wrapped beef fillet on a baking tray and roast in the oven for an hour. ", "Remove the beef from the oven, set aside until cooled to room temperature, then chill in the fridge until completely cold.", "Meanwhile, heat a knob of butter in a frying pan over a medium heat. When the butter is foaming, add the chopped mushrooms and fry for 1-2 minutes, or until all of the liquid has evaporated and the mushrooms have softened. Transfer the mushrooms to a bowl and wipe the pan with a piece of kitchen roll.", "Add a little more butter to the pan, then fry the spinach for a minute, or until just starting to wilt. Remove the pan from the heat and continue to stir the spinach until completely wilted. Transfer to a bowl and set aside.", "Next, make the pancakes. Place the two whole eggs and the flour in a bowl and whisk together until well combined. Gradually whisk in the milk until the mixture forms a smooth batter that is thick enough to coat the back of a spoon.", "Heat a knob of butter in a frying over a high heat. When the butter is foaming and starting to smoke, add a ladleful of the pancake batter and swirl the pan to evenly coat the base. Fry for 1-2 minutes, or until the underside of the pancake is golden-brown. Flip the pancake over and cook for a further minute, or until the pancake is cooked through and golden-brown all over. Slide the pancake out onto a plate lined with greaseproof paper, then cover it with another layer of greaseproof paper. Repeat the process with the remaining butter and pancake batter.", "Place the chicken liver pâté in a bowl and beat until smooth and soft.", "Increase the oven temperature to 230C/210C Fan/Gas 8.", "Roll out the puff pastry on a lightly floured work surface to a rectangle measuring 40x50cm/16x20in with a thickness of 2-3mm (it needs to be large enough to wrap the beef fillet).", "Arrange the pancakes all over the pastry, overlapping the edges slightly and leaving a 2.5cm/1in border free at the edge. Trim the overlapping edges of the pancakes using a sharp knife so they sit in one even layer.", "Spread the softened pâté in an even layer all over the pancakes. Arrange a layer of wilted spinach on top. Spread the cooked mushrooms on top of the spinach. Season, to taste, with salt and freshly ground black pepper. Finally, peel the cling film or foil from the beef fillet and place it in the centre.", "Whisk the egg yolks in a bowl, then brush them around the pastry border. Tightly roll the beef fillet in the pastry, ensuring the seal sits at the bottom of the Wellington. Tuck the ends underneath the Wellington without trimming them. Transfer the Wellington to a baking tray lined with baking paper and brush all over with the remaining beaten egg yolks. If desired, decorate with pastry trimmings.", "Bake the beef Wellington in the oven for 20-25 minutes (for medium), or until the pastry has risen and is golden-brown.", "Meanwhile, heat a knob of butter in a frying pan over a high heat. When the butter is foaming, add the wild mushrooms and fry for 2-3 minutes, or until just softened. Add the Madeira and set it alight using a match. (Caution: Keep eyes and hair away from the flames and switch off the extractor fan before flaming.) Allow the flames to flare up and die down.", "Add the concentrated beef stock and bring to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 3-4 minutes, or until the volume of liquid has reduced by one-third. Stir in the remaining butter until melted.", "To serve, carve the beef Wellington into thick slices and place each into the centre of a serving plate. Drizzle the mushroom and Madeira sauce around the edge of the plates."]}, {"isVegetarian": false, "title": "Beef with a garlic and parsley risotto and roasted shallots", "url": "www_bbc_co_uk_food_recipes_beef_with_a_garlic_and_62404", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_with_a_garlic_and_62404_16x9.jpg", "ingredients": ["50g/1¾oz butter", "50g/1¾oz fresh parsley, chopped", "½ garlic clove, crushed", "4 banana shallots, three halved (with skin on) and one finely chopped", "2 garlic cloves, finely chopped", "50g/1¾oz arborio rice", "50ml/2fl oz white wine", "300ml/10fl oz chicken stock", "25ml/1fl oz olive oil", "1 x 500g/1lb 2oz beef fillet (preferably Dexter beef)", "salt and freshly ground black pepper", "2 tbsp mascarpone", "50g/1¾oz parmesan, grated", "1 small bunch fresh parsley, leaves chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat a barbecue or griddle pan to hot.", "In a food processor, mix the butter, parsley and garlic together. (If making in advance you can keep it in the fridge at this point until ready to use.)", "Melt the flavoured butter in a saucepan and then gently fry the chopped shallot and garlic for 1-2 minutes. ", "Add the rice and stir to coat in the butter. Stir in the wine and bring to the boil before adding the stock. Simmer gently for 12-15 minutes stirring occasionally.", "Drizzle half of the oil over the steak and season generously with black pepper. Place onto the barbecue or griddle pan. Drizzle the remaining oil over the shallot halves and place onto the barbecue flesh-side down. Cook both for 8-10 minutes, turning halfway through.", "Add the mascarpone, parmesan and chopped parsley to the risotto and season to taste with salt and pepper.", "To serve, spoon the risotto onto serving plates. Slice the steak and place alongside. Remove the skin from the shallots and place onto the plates."]}, {"isVegetarian": false, "title": "Beef with fritto misto and chilli sauce", "url": "www_bbc_co_uk_food_recipes_beef_with_fritto_misto_77954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2x 175g/6oz sirloin steaks", "salt and freshly ground black pepper", "1 tbsp chopped fresh rosemary", "3 tbsp olive oil", "2 red chilli, finely chopped ", "1 tbsp chopped fresh flatleaf parsley", "1 garlic clove, crushed with a little sea salt", "1 tsp red wine vinegar", "vegetable oil, for frying", "4 tbsp olive oil ", "300g/11oz plain flour ", "1 litre/1¾ pints warm water ", "1 free-range egg white", "2 violet artichokes, tough outer leaves and choke removed", "2 Jerusalem artichokes, peeled, sliced", "1 small head radicchio, outer leaves removed, quartered", "4 fresh sage leaves ", "salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef and chilli sauce, heat a griddle pan until very hot.", "Season the steaks with salt, freshly ground black pepper and the chopped rosemary.", "Brush with two tablespoons of the olive oil and fry for 2-3 minutes on each side (for medium), then remove from the pan and set aside to rest for 10 minutes.", "Mix the red chilli, parsley, garlic, vinegar and remaining tablespoon of olive oil together in a bowl.", "Slice the steaks and spoon over the chilli sauce. ", "For the fritto misto, heat the oil in a deep-fat fryer to 180C/350F. Do not leave the deep-fat fryer unattended.", "Place the flour into a large bowl, make a well in the centre and pour in the olive oil. Slowly whisk in the warm water until the batter is the consistency of runny honey. (You may not need all the water.)", "Whisk the egg white in a separate bowl until soft peaks form when the whisk is removed. Fold the egg white into the batter.", "Add the prepared vegetables to a bowl along with a ladleful of batter and mix until well combined. ", "Cook the vegetables in the deep-fat fryer for 2-3 minutes, or until crisp. Remove from the fryer with a slotted spoon, set aside to drain on kitchen paper and sprinkle with salt. (You may need to cook the vegetables in batches.)", "To serve, arrange the beef on serving plates and place the fritto misto alongside."]}, {"isVegetarian": false, "title": "Beef and ale pie", "url": "www_bbc_co_uk_food_recipes_beefandalepie_81022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb diced stewing beef", "25g/1oz flour, seasoned with salt and freshly ground black pepper, plus extra for dusting", "100g/3½oz butter", "2 onions, roughly chopped", "2 cloves garlic, roughly chopped", "2 medium carrots, roughly chopped", "150g/5½oz button mushrooms", "2 sprigs fresh thyme", "1 bay leaf", "400ml/14fl oz good-quality ale", "500ml/17fl oz beef stock", "salt and freshly ground black pepper", "1 free-range whole egg beaten with 1 free-range egg yolk", "300g/10½oz ready-made rolled puff pastry"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the meat into the seasoned flour, then place a large lidded pan on the hob. ", "Heat half the butter in the pan and add the meat. Sear all over until golden brown.", "Add the vegetables and herbs, then pour in the ale and stock. Bring to a simmer, then cover with a lid and gently simmer on the stove for 1½ hours. ", "Preheat the oven to 220C/425F/Gas 7.", "Once cooked, season the stew, add the remaining butter and tip into an ovenproof serving dish. Brush the edge of the dish with the beaten egg. ", "If necessary, roll out the pastry using as little flour as possible and place over the dish. Pinch the edges of the dish so that the pastry will stick to it and trim off any remaining pieces of pastry from around the edge. Cut the leftover pastry into leaves and add them to the top, using the beaten egg as a 'glue', for decoration.", "Brush the pastry top thoroughly with the remaining beaten egg and place on a baking tray. Bake in the oven for 20-30 minutes until the pastry is golden brown on top. Serve."]}, {"isVegetarian": false, "title": "Beef, ale and carrot pie", "url": "www_bbc_co_uk_food_recipes_beefaleandcarrotpie_90442", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz plain flour", "salt and freshly ground black pepper ", "750g/1½lb braising steak, cut into 5cm/2in cubes", "2 tbsp vegetable oil", "2 shallots, chopped", "125g/4½oz baby onions (or small onions), peeled", "400g/14oz carrots, cut into large pieces", "4 sprigs fresh thyme", "3 bay leaves", "4 tbsp tomato purée", "300ml/10fl oz ale", "300ml/10fl oz hot beef stock", "500g/1lb 2oz ready-made puff pastry, rolled to 0.5cm/½in thickness", "1 free-range egg, beaten", "steamed vegetables of your choice, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "Sprinkle the flour onto a plate and season well with salt and freshly ground black pepper. Dredge the steak pieces in the seasoned flour. ", "Heat an ovenproof casserole dish over a high heat, add the steak pieces in batches and fry for 3-4 minutes, or until golden-brown on all sides, stirring regularly. Remove the cooked steak from the dish, transfer to a warm plate and set aside. Repeat the process with the remaining steak pieces, then set aside. ", "Add the shallots, onions and carrots to the emptied casserole and fry for 2-3 minutes, or until just softened.", "Add the thyme, bay leaves and tomato purée and stir well to combine.", "Add the ale and stir well, scraping any sediment up from the bottom of the casserole using a wooden spoon. ", "Return the browned steak pieces to the casserole, add the hot stock, stir well and bring the mixture to the boil.", "Transfer the dish to the oven and cook for 1½ hours, or until the beef is tender and the gravy has thickened. Remove from the oven and set aside to cool slightly.", "Increase the heat of the oven to 220C/425F/Gas 7.", "Divide the beef and gravy mixture among four small ovenproof dishes.", "Cut the pastry into four equal pieces, each one big enough to cover the small pie dishes.", "Brush a little water around the rim of each small pie dish, then place one piece of pastry over each pie and press the edges to seal the pastry to the dish.", "Brush each pie with a little beaten egg, then place the pies in the oven and cook for 15-20 minutes, or until the pastry is pale golden-brown and has risen. ", "To serve, place the small pie dishes onto serving plates and spoon steamed vegetables of your choice alongside."]}, {"isVegetarian": false, "title": "Beef stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_dumplings_15297", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_dumplings_15297_16x9.jpg", "ingredients": ["4 tbsp olive oil", "500g/1lb 2oz chuck steak, cubed", "2 onions, roughly chopped", "1 large carrot, peeled, roughly chopped", "1 celery stalk, trimmed, roughly chopped", "½ swede, peeled, roughly chopped", "2 tbsp plain flour", "1 litre/1¾ pints beef stock", "400ml/14fl oz red wine", "2 bay leaves", "salt and freshly ground black pepper", "125g/4½oz plain flour", "65g/2¼oz shredded suet", "1 tsp baking powder", "1 tsp salt ", "4-5 tbsp cold water, to mix", "70g/2½oz fine oatmeal", "70g/2½oz plain flour", "1 tsp baking powder", "1 tsp salt", "1 tbsp chopped fresh parsley", "2 tsp chopped fresh rosemary leaves", "2 tsp fresh thyme leaves", "80g/2¾oz chilled butter ", "4-5 tbsp cold water, to mix"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef stew, heat the oil in a large, lidded casserole over a medium heat. Fry the chuck steak for 3-4 minutes, until browned on all sides. Remove from the pan and set aside.", "Add the onions, carrot, celery and swede and fry for 6-8 minutes, or until golden-brown, adding a little more olive oil if need be. Season with salt and pepper.", "Add the plain flour and stir well. Cook for 1-2 minutes, or until it turns a nut-brown colour. Pour in the stock and stir well until the sauce thickens.", "Return the beef to the casserole, add the red wine and bay leaves and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then leave to simmer gently for 1 hour with the lid slightly ajar.", "Meanwhile, for the suet dumplings, combine the flour, suet, baking powder and salt in a bowl until well combined. Add the water gradually, stirring the mixture with your fingers, until it comes together as a slightly sloppy dough. Shape the dough into balls roughly the size of a plum.", "For the herby oat dumplings, combine the oatmeal, flour, baking powder, salt and herbs in a mixing bowl until well combined. Grate the chilled butter into the bowl and mix again. Bring the dough together with your fingers, gradually adding enough water, as before, to make a wet dough. Shape the dough into plum-sized balls.", "When the stew has been simmering for an hour, season it again with salt and pepper, if necessary. Put the dumplings on top of the stew, cover the casserole with the lid, and cook for a further 15-20 minutes, or until the dumplings have proudly puffed up. Serve. "]}, {"isVegetarian": false, "title": "Beef and ale stew with dumplings", "url": "www_bbc_co_uk_food_recipes_beefandalestewwithdu_90180", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1kg/2lb 3oz diced shin of beef (cut off the bone into large pieces)", "2 sticks celery", "2 carrots", "2 large onions", "3 cloves garlic", "1 heaped tsp tomato purée", "1 tbsp plain flour", "salt and freshly ground black pepper", "½ litre/17fl oz real ale or bitter", "200ml/7fl oz dark beef stock", "2 bay leaves", "1 sprig fresh thyme", "150g/5oz beef suet", "150g/5oz self-raising flour, sifted, plus extra for dusting", "salt and freshly ground black pepper", "1 tsp prepared horseradish (optional)", "water to bind"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2. Heat a large casserole on the hob. Add some of the vegetable oil and, when hot, add some of the beef in a single layer and cook over a high heat until browned. When browned, remove the beef to a bowl, before adding the next batch and browning. Don't crowd the pan. Remove the last batch of meat and place in a bowl.", "Roughly chop the celery. Add the last bit of oil to the casserole and add the celery.", "Roughly chop the carrots and onions and add to the casserole.", "Slice the garlic and add to the casserole. Stir all the vegetables thoroughly and allow them to brown gently, scraping up the browned bits from the bottom of the pan as you go.", "Once the vegetables are coloured, add the tomato purée and stir. Add the flour and stir together well until the flour is incorporated. Season with salt and freshly ground black pepper.", "Add the ale to the casserole, followed by the beef stock.", "Bring up to the simmer and return the browned beef to the casserole. Cover with a lid and simmer.", "Make the dumplings. Place the suet in a clean bowl and add the flour. Using your hands, mix the suet and flour well, then season with salt and freshly ground black pepper. If you want horseradish dumplings, now is the time to add it to the mix.", "Make a well in the centre of the flour and suet mixture and add water a bit at a time. Mix with your hands until you get a firm dough that comes away cleanly from the sides of the bowl.", "Turn the dough out onto a clean board and sprinkle over some flour. Roll the dough out into a sausage shape, then form into six golf ball-sized dumplings (they'll double in size when cooking). Carefully drop the dumplings into the stew. You can store any unused dumpling dough wrapped in cling film in the fridge for two or three days.", "Cover the casserole with a lid and place in the preheated oven to cook for 2½-3 hours, checking periodically.", "After two hours, turn the dumplings over. Add the bay leaves and the thyme and continue cooking for a further half hour to an hour. When the beef is done, it should fall apart to the touch and the dumplings should be light and fluffy.", "Serve the dumplings and beef stew in large bowls."]}, {"isVegetarian": false, "title": "Beef and mango Jamaican stew", "url": "www_bbc_co_uk_food_recipes_beefandmangojamaican_92087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp freshly grated nutmeg", "1 tbsp curry powder", "1 tbsp light soy sauce", "1 Scotch bonnet chilli, finely chopped ", "salt and freshly ground black pepper ", "450g/1lb braising steak, cut into chunks", "2 tbsp vegetable oil", "1 onion, peeled, thinly sliced", "1 green pepper, seeds removed, sliced", "1 garlic clove, peeled, crushed ", "1 tbsp tomato purée", "4 tomatoes, chopped", "1 baking potato, peeled and cut into large chunks", "50ml/2fl oz rum", "300ml/10½fl oz beef stock", "2 just-ripe mangoes, peeled, stones removed, chopped", "1 tbsp chopped fresh thyme", "long grain rice, cooked according to packet instructions, drained, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Place the nutmeg, curry powder, soy sauce, chilli and salt and freshly ground black pepper into a bowl and mix well. Add the chunks of beef and mix well to coat evenly in the mixture. ", "Heat the vegetable oil in a pan until smoking, then fry the meat for 1-2 minutes on all sides, or until golden-brown all over. Remove the beef from the pan and set aside. ", "Add the onion, pepper and garlic to the pan and fry for for 3-4 minutes, or until softened, then stir in the tomato purée and chopped tomatoes and cook for 2-3 more minutes. ", "Add the meat back into the pan along with the potato chunks, rum and stock, then bring to boil. Reduce to a simmer and cook for 1 hour to 1 hour 30 minutes, or until the beef is tender.", "Stir in the mangoes and thyme and cook for a further 4-5 minutes to heat through. ", "Serve the Jamaican stew alongside cooked long grain rice, and a rum cocktail if desired."]}, {"isVegetarian": false, "title": "Beef and onion pie with cheese crust", "url": "www_bbc_co_uk_food_recipes_beefandonionpiewithc_92634", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225/8oz plain flour, plus extra for dusting", "75g/2¾oz chilled butter, cut into cubes, plus extra for greasing", "pinch salt", "75g/2¾oz mature Lancashire cheese, or similar mature crumbly cheese, grated", "4 tbsp water", "1 free-range egg yolk", "1-2 tbsp vegetable oil", "250g/9oz beef mince", "1 onion, peeled, chopped", "1 carrot, peeled, finely chopped", "1 celery stalk, trimmed, finely chopped", "1 tbsp tomato purée", "1 tbsp Worcestershire sauce", "splash bitter ale", "1 free-range egg, beaten", "mashed potatoes", "brown sauce"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, blend the flour, butter cubes and salt in a food processor until the mixture resembles breadcrumbs. ", "Add the cheese, water and egg yolk and continue to blend until the mixture comes together as a dough.", "Turn out the dough onto a lightly floured work surface and knead lightly for 3-4 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for at least one hour.", "Meanwhile, for the filling, heat the oil in a frying pan over a medium heat. Add the beef mince, in batches if necessary, and fry for 6-8 minutes, turning once, or until browned all over. Remove from the pan and set aside (keep warm). Repeat the process with the remaining batches of beef mince.", "Add the onion, carrot and celery to the pan used to fry the mince. Fry for 3-4 minutes, stirring well, until softened. ", "Return the mince to the pan and stir in the tomato purée, Worcestershire sauce and bitter ale. Bring the mixture to a simmer and cook, stirring regularly, for 8-10 minutes, or until the majority of the liquid has evaporated.", "Preheat the oven to 200C/400F/Gas 6. Grease a 20cm-25cm/8-10in pie plate with butter. ", "When the dough has chilled, divide it in half. Roll out one half onto a lightly floured work surface until slightly larger than the pie plate. Carefully line the pie plate with the pastry, pressing it into the edges of the plate. ", "Spoon the filling into the pie case.", "Roll the remaining dough out onto a lightly floured work surface until it is slightly larger than the pie dish. ", "Brush the rim of the pie case with a little of the egg wash. Place the pastry disc on top of the pie and press the edges together. Brush the pie lid all over with the remaining beaten egg. Prick the pastry all over several times with a fork.", "Bake the pie in the oven for 35-40 minutes, or until the pastry is crisp and pale golden-brown. Serve with mashed potatoes and brown sauce."]}, {"isVegetarian": false, "title": "Beef and red pepper stir fry with egg fried rice", "url": "www_bbc_co_uk_food_recipes_beefandredpepperstir_79707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz cooked basmati rice", "1 free-range egg", "1 tbsp soy sauce", "2 tbsp fresh coriander, chopped", "1 tbsp soy sauce", "1 tbsp honey", "1 tbsp sesame oil", "100g/3½oz rump beef, sliced into strips", "½ courgette, finely sliced ", "½ red pepper, finely sliced", "¼ onion, sliced", "1 garlic clove, sliced", "1 tbsp sesame seeds", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the egg fried rice, place a wok over a high heat.", "Place the rice and soy sauce in a bowl and mix together. Add the rice to the wok and keep stirring for one minute.", "Break in the egg and stir for a further minute until the egg has cooked.", "Serve in a bowl with the chopped coriander sprinkled over.", "To make the stir fry, place the soy sauce, honey, sesame oil in a bowl ", "Add the sliced beef to the mixture and marinate for five minutes.", "Place a clean wok over a high heat. Add the courgette, red pepper, onion, garlic, marinated beef and sesame seeds and stir-fry for two minutes.", "Add the marinade juices and cook for two more minutes. Season, to taste, with salt and freshly ground black pepper and place in a bowl.", "Serve the bowl of rice beside the bowl of beef stir fry."]}, {"isVegetarian": false, "title": "Beef and shiitake mushroom stir-fry", "url": "www_bbc_co_uk_food_recipes_beefandshitakemushro_86551", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sesame oil ", "300g/10½oz beef shoulder steak, thinly sliced ", "1 garlic clove, crushed ", "10g/¾oz ginger, grated", "100g/3½oz shiitake mushrooms, sliced ", "100g/3½oz spring cabbage, sliced ", "50g/2oz red onion, sliced ", "50g/2oz bean sprouts ", "50g/2oz mangetout ", "1 tsp Chinese five-spice powder", "1 tbsp sesame seeds ", "1 lime, juice only", "salt, to taste", "soy sauce, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sesame oil in a large frying pan or wok. Add the beef to the pan and stir fry for 1-2 minutes until coloured on all sides. Add the garlic and ginger and stir well. Add the vegetables and stir fry for another minute or until the beef is cooked to your liking.", "As soon as the beef is cooked, add the five-spice powder, sesame seeds and lime juice, stir and remove from the heat.", "To serve, season with salt and/or soy sauce and divide among four plates."]}, {"isVegetarian": false, "title": "Beef and Stilton pie with celeriac mash and honey-roasted beetroot", "url": "www_bbc_co_uk_food_recipes_beefandstiltonpiewit_92225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz plain flour, plus extra for dusting", "250g/9oz cold butter, cut into small cubes", "½ tsp salt", "125ml/4½fl oz ice-cold water", "1kg/2lb 2oz braising steak, cut into chunks", "2 garlic cloves, peeled, crushed", "1 small bunch fresh thyme", "1 tbsp black peppercorns", "400ml/14fl oz Leicestershire pale ale", "2 tbsp plain flour, seasoned with salt and freshly ground black pepper", "2 tbsp olive oil", "2 tbsp butter", "100g/3½oz chestnut button mushrooms", "8 shallots, peeled, halved", "500ml/17½fl oz beef stock", "75g/2½oz Stilton cheese, crumbled", "salt and freshly ground black pepper", "1 free-range egg, beaten ", "350g/12oz celeriac, peeled, cut into chunks", "800g/1lb 12oz Maris Piper potatoes", "150ml/5fl oz double cream", "1 tbsp butter", "2 tsp coarse grain mustard", "salt and white pepper", "2 tsp chopped fresh thyme", "2 tsp balsamic vinegar", "2 tbsp olive oil", "2 tbsp clear honey", "500g/17½oz cooked beetroot (not in vinegar)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, sift the flour into a bowl and make a well in the centre. Add the butter and salt and rub into the flour with your fingertips until the mixture resembles breadcrumbs. ", "Gradually add the ice-cold water, mixing until the dough comes together (be careful not to overwork the dough). Roll the dough into a ball, wrap in cling film and chill in the fridge for 20 minutes. ", "Remove the pastry from the fridge and unwrap it. Flour the work surface and roll out the pastry to a 40cm x 20cm/16in x 8in rectangle. Fold the pastry into thirds and give it a quarter turn. Roll the pastry out again into a 40cm x 20cm/16in x 8in rectangle as before and fold it into three again. Wrap the folded pastry in cling film and chill in the fridge for 30 minutes. ", "Remove the pastry from the fridge and unwrap it. Repeat the rolling out and folding process another two times, turning the pastry by a quarter each time. After folding it for the last time, wrap again in cling film and chill in the fridge until needed. ", "For the pie filling, place the beef, garlic, thyme, peppercorns and ale into a bowl. Cover with cling film and leave to marinate in the fridge for at least 2-3 hours, but preferably overnight. ", "Remove the beef from the marinade, pat dry with kitchen paper and dredge in the seasoned flour. Strain the marinade through a fine sieve into a clean bowl and set aside. ", "Heat the oil and one tablespoon of the butter in a flameproof casserole dish and fry the beef in small batches for 2-3 minutes each time, or until browned all over. Once the meat is browned, remove from the casserole dish and set aside. ", "Return the casserole dish to the heat and fry the mushrooms and shallots for 4-5 minutes, or until softened. ", "Return the beef and the reserved marinating liquid to the casserole and add the beef stock. Cover with a lid and gently simmer for 1½ hours, or until the beef is tender. ", "Strain off half of the cooking liquid from the casserole dish and set aside to make gravy for serving. ", "Crumble the Stilton into the casserole and stir until melted. Season, to taste, with salt and freshly ground black pepper and set aside to cool. ", "Preheat the oven to 180C/350F/Gas 4. Grease four 10cm/4in chefs' rings and dust each with flour. ", "Place the chefs' rings onto a baking tray and fill each with the beef and Stilton filling. ", "On a floured work surface, roll out the puff pastry to a thickness of about 2.5cm/1in. Cut out four circles of pastry large enough to cover the chefs' rings with a bit of overhang. ", "Brush the edges of the pastry with some of the beaten egg and place over the chefs' rings. Crimp the pastry to seal, then trim off any excess pastry, making sure there are no gaps between the chefs' rings and the pastry. Make a small hole in the middle of each pastry lid so allow steam to escape, then brush all over with the remaining beaten egg.", "Bake the pies in the oven for 20-25 minutes, or until the pastry is crisp and golden-brown. ", "Meanwhile, place the reserved cooking liquid into a clean pan and simmer for 8-10 minutes, or until reduced to a gravy consistency. Stir in the remaining tablespoon of butter until melted, and the sauce is smooth and glossy. Keep warm. ", "For the celeriac and mustard mash, place the celeriac and potatoes into separate pans of cold water and bring to the boil. Reduce to a simmer and cook the celeriac for 15-20 minutes and the potatoes for 10-12 minutes, or until both are tender. Drain well, then place both the celeriac and potatoes to one pan and place back over the heat for a few minutes to drive off any excess moisture. ", "Mash the celeriac and potatoes together, then beat in the butter, the cream and the mustard until well combined. Season, to taste, with salt and white pepper. ", "For the honey-roasted beetroot, preheat the oven to 220C/425F/Gas 7. ", "Mix together the thyme, vinegar, olive oil and honey in a bowl until well combined. ", "Using a small melon baller or small spoon, scoop out balls of the beetroot and place into the bowl with the honey mixture and season, to taste, with salt and freshly ground black pepper. ", "Place the beetroot into a deep roasting tray and roast in the oven for 15 minutes, or until the beetroot is sticky and glazed. ", "To serve, transfer the pies onto a serving plate using a fish slice or spatula. Carefully remove the chefs' rings. Spoon the celeriac and potato mash on the side. Spoon the honey-roasted beetroot balls alongside and serve with a small jug of the gravy."]}, {"isVegetarian": false, "title": "Beef bavette (skirt steak) with mash and garlic Portobello mushrooms", "url": "www_bbc_co_uk_food_recipes_beefbavettewithmasha_92174", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 250g/9oz thick beef skirt steaks ", "salt and freshly ground black pepper", "2 tbsp olive oil", "1½ tbsp white wine vinegar", "50ml/2fl oz brandy", "200ml/7fl oz beef stock", "2 cloves garlic, peeled", "1 handful fresh thyme leaves", "2 tsp butter", "25g/1oz green peppercorns", "100ml/3½fl oz double cream", "3 free-range egg yolks", "25ml/1fl oz white wine vinegar", "2 tsp warm water", "120g/4oz butter, melted", "1 sprig fresh tarragon, leaves only, finely chopped", "splash olive oil", "1kg/2lb 3oz Maris Piper or King Edward potatoes", "1 tbsp butter ", "100ml/3½fl oz double cream ", "salt and freshly ground black pepper", "500g/17½oz Portobello mushrooms", "50g/2oz butter", "2 cloves garlic, peeled, thinly sliced ", "salt and freshly ground black pepper ", "1 handful picked fresh thyme leaves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the beef, season the steaks with salt and freshly ground pepper.", "Heat a non-reactive frying pan until hot, then add the oil then the steaks. Sear the steaks for 2-3 minutes on both sides, or until golden-brown all over. ", "Carefully add the white wine vinegar to the pan, then add half of the brandy and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight (NB: keep clothing and fabric well clear of the flame and do not leave unattended). When the flame has gone out, add the beef stock, the garlic and the thyme. Cook for a further 2-3 minutes, then remove the steak from the pan and set aside to rest on a warm plate.  ", "Return the pan to the heat and add the green peppercorns and the remaining brandy. Simmer the mixture for 8-10 minutes, or until the liquid has reduced to a sauce consistency. Stir in the double cream and simmer again for a further 6-8 minutes, or until the sauce is thickened and glossy. Keep warm and pour into a gravy boat when ready to serve.", "For the béarnaise sauce, place the egg yolks into a heatproof bowl and add the white wine vinegar and warm water. Whisk to combine, then place the bowl over a pan of just-simmering water (make sure the bottom of the bowl does not touch the water) and whisk continuously for 3-4 minutes, or until the mixture is pale and fluffy and has doubled in volume. ", "Slowly drizzle in the melted butter in a thin, steady stream while whisking continuously, until all of the butter is incorporated and the mixture is thickened and emulsified. Stir in the chopped tarragon and whisk in a splash of olive oil. Pour into a gravy boat when ready to serve.  ", "For the mash, cook the potatoes in a pan of boiling water for 10-12 minutes, or until tender. Drain, return the potatoes to the pan and place back over the heat for a few minutes to drive off any excess moisture, then pass the potatoes through a potato ricer or mash with a masher. Beat in the butter and cream until well combined and season, to taste, with salt and freshly ground black pepper. ", "For the garlic mushrooms, melt the butter in a pan until foaming, then add the mushrooms and fry for 2-3 minutes, or until golden-brown and tender. Season, to taste, with salt and freshly ground black pepper and add the garlic and thyme. Cook for a further minute, or until the mushrooms are softened. ", "To serve, place the steaks onto serving plates and spoon the mash and garlic mushrooms alongside. Serve with a choice of the green peppercorn or béarnaise sauce."]}, {"isVegetarian": false, "title": "Beef bourguignon", "url": "www_bbc_co_uk_food_recipes_beefbourguignon_5151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefbourguignon_5151_16x9.jpg", "ingredients": ["1.5kg/3lb5oz chuck beef or braising steak, cut into 5cm/2in pieces", "3 tbsp olive oil", "1 large carrot, peeled and cut into chunks", "1 large onion, peeled and cut into chunks", "2 sticks celery, rough chopped", "2 bottles red burgundy wine", "2 sprigs fresh thyme", "1 head garlic, cut in half horizontally", "4 bay leaves", "50g/2oz unsalted butter", "225g/8oz whole piece of smoked bacon or pancetta", "450g/1lb shallots, peeled", "2 tbsp plain flour", "375g/12oz chestnut mushrooms  ", "290ml/½ pint fresh beef stock", "5 tbsp brandy", "freshly chopped flatleaf parsley"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Heat 1 tbsp of the oil in a large saucepan. Add the carrot, onion and celery and cook for 2-3 minutes.  Add the wine, thyme, garlic and 2 bay leaves. Bring to the boil and simmer for 15 minutes. Allow to cool. ", "Place the beef in a large bowl and pour over the wine marinade. Cover and place in the fridge overnight. This is known as a cook marinade.", "Preheat the oven to 150C/300F/Gas2. Drain the beef from the marinade into a colander over a glass bowl. Reserve the marinade and set aside. ", "Heat 25g/1oz butter and 1 tbsp of the oil in a large frying pan. Add the bacon and cook until golden and brown. Add the shallots and transfer to a large casserole dish.", "Heat 1 tbsp oil in a large frying pan. Pat dry the cubes of beef from the marinade mixture using absorbent kitchen paper. Add half of the beef to the pan and cook until brown on all sides. Remove the beef and transfer to the casserole dish with the bacon, shallots and vegetables. Repeat with the remaining beef and add to the casserole dish.", "Stir in 2-3 large spoonfuls of the reserved marinade mixture to deglaze or remove any sediment from the pan. Pour into the casserole dish.", "Stir in the plain flour, the remaining marinade mixture and beef stock into the casserole dish.", "Bring to the boil, cover and place in the oven for 3-3½ hours or until the beef is very tender. ", "Halfway through cooking, heat the remaining oil and butter in a large frying pan and cook the mushrooms until brown. Add the brandy and cook for a few minutes. ", "Add the mushrooms to the casserole dish, stir and return to the oven the remaining cooking time. ", "Serve with new potatoes, sprinkled with freshly chopped parsley and purple sprouting broccoli."]}, {"isVegetarian": false, "title": "Beef bourguignon", "url": "www_bbc_co_uk_food_recipes_beefbourguignon_90175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb chuck steak, cut into 5cm/2in cubes", "500ml/17½fl oz red wine", "1 tbsp fresh thyme", "1 bay leaf", "1 garlic clove, chopped", "1 tbsp vegetable oil", "100g/3½oz bacon lardons", "1 onion, sliced", "1 carrot, sliced", "salt and freshly ground black pepper", "30g/1oz plain flour", "30g/1oz tomato purée", "250ml/9fl oz game stock, or chicken stock", "50g/2oz butter", "16 small shallots", "300g/10½oz button mushrooms", "handful fresh parsley, chopped", "rice, cooked according to packet instructions, or boiled potatoes"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Place the beef, red wine, thyme, bay leaf and garlic into a large bowl. Cover and marinate in the fridge for at least two hours, preferably overnight. ", "Preheat the oven to 160C/320F/Gas 3.", "Heat the vegetable oil in a pan over a medium heat. Add the bacon pieces and fry until crisp and golden-brown.", "Remove the beef from the marinade. Reserve the marinade liquid for later. Add the beef to the pan and cook until brown on all sides. Remove the beef from the pan.", "Add the onion and carrot to the same pan and fry for 5-6 minutes, until softened.", "Return the beef to the pan and season well with salt and freshly ground black pepper.", "Sprinkle with the flour, stir well and cook for a further two minutes.", "Add the tomato purée, stir to combine and cook for four minutes. ", "Add the wine marinade and the game (or chicken stock) and bring to the boil.", "Cover with a lid and cook in the oven for two hours.", "Towards the end of the cooking time, melt half of the butter in a frying pan over a low heat. Add the shallots and fry for 10-12 minutes, until golden-brown all over.", "In a separate frying pan, melt the remaining butter and fry the mushrooms until golden-brown all over.", "Remove the beef casserole from the oven and carefully strain the sauce into a clean pan. Reserve the beef and vegetables. Bring the sauce to the boil and cook to reduce the volume by half.", "Return the reserved beef and vegetables to the pan of reduced sauce and add the cooked shallots and mushrooms. Simmer for three minutes, stirring occasionally.", "To serve, spoon equal portions of the beef bourguignon onto warmed plates. Garnish with parsley and serve with rice or boiled potatoes."]}, {"isVegetarian": false, "title": "Beef bourguignon with bubble and squeak", "url": "www_bbc_co_uk_food_recipes_beefbourguignonwithb_73425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb¼oz shin beef, chopped into large chunks ", "salt", "freshly ground black pepper ", "2 tbsp duck or goose fat ", "50g/1¾oz smoked bacon, diced ", "4 garlic cloves, chopped ", "18 shallots, peeled but left whole ", "2 onions, sliced ", "1 tbsp tomato purée ", "1 bouquet garni, (sprigs of thyme, rosemary and flat-leafed parsley) ", "12 small cépe mushrooms, or chestnut mushrooms ", "750ml/26½floz Burgundy wine made from pinot noir grapes from France ", "25g/1oz butter ", "25g/1oz flour", "500g/17½oz dry mashed potato", "¼ savoy cabbage, finely sliced", "200g/7¼oz peas", "25g/1oz butter", "1 onion, sliced", "salt", "freshly ground black pepper", "duck fat, oil or lard for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas2", "Season the shin of beef with salt and pepper.", "Heat half the duck fat in a casserole dish.", "Add in the beef and fry until well browned. Remove the beef, set aside and add in the rest of the duck fat to the casserole.", "Add bacon, garlic, shallots and onions, fry until brown.", "Stir in tomato purée, return beef to casserole dish, and add the bouquet garni.", "Add the mushrooms and pour in enough wine to cover beef. Cover and simmer.", "Move the beef mixture in the casserole dish to the oven and cook for three hours.", "When beef is tender, using a slotted spoon remove beef and shallots from mixture and place in a serving bowl. Keep warm.", "On the hob bring the sauce to a simmer. Mix together the flour and butter and whisk this into the simmering mixture a little at a time.", "Pour the sauce over the beef and serve.  ", "For the bubble and squeak: Boil the cabbage and onion in salted water for 20 minutes, then drain and cool. ", "Work the butter into the potato, making sure it stays fairly dry in texture. ", "Mix in the cabbage, onion and peas and season well. ", "Form the bubble into cakes and fry in oil for ten minutes on each side. The outside should be golden and the cakes should stay firm."]}, {"isVegetarian": false, "title": "Beef braised in beer with classic English suet dumplings served with buttery mash", "url": "www_bbc_co_uk_food_recipes_beefbraisedinbeerwit_79803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp plain flour, seasoned with salt and freshly ground black pepper", "1kg/2lb 3oz braising steak, cut into 5cm/2in pieces", "55g/2oz unsalted butter", "150g/5½ oz smoked streaky bacon, cut into 1cm/¼in dice", "2 onions, peeled and thinly sliced", "1 sprig thyme", "1 bay leaf", "650ml/23fl oz Irish stout, such as Guinness", "80g/3oz stoneless prunes cut in half", "80g/3oz pickled walnuts, sliced", "4 tsp balsamic vinegar", "4 tsp soft dark brown sugar", "2 tsp Dijon mustard", "500ml/10½fl oz beef stock", "salt and freshly ground black pepper", "235g/8oz plain flour", "120g/4oz shredded suet", "80g/3oz fine white breadcrumbs", "2 tsp parsley, chopped", "2 tsp chives, chopped", "salt and freshly ground white pepper", "500ml/17fl oz beef stock ", "1kg/2¼lb floury potatoes, peeled, washed and cut into 2.5cm/1in chunks", "salt and ground white pepper ", "85g/3oz unsalted butter ", "225ml/8fl oz semi-skimmed milk, warmed"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat oven to 140C/285F/Gas 1.", "Place the flour and meat in a polythene bag and shake to coat the meat.  ", "Heat half the butter in a deep casserole and fry the meat until golden and crusty all over. Remove the meat and set aside.", "Add the remaining butter to the same pan and fry the bacon until crispy. Add the onions, thyme and bay leaves and cook until the onion has softened.  Add any remaining flour and stir to combine.  ", "Pour in the Guinness and stir vigorously.", "Return the beef to the pan; stir to combine, add remaining ingredients and bring to the boil.", "Cover the casserole with a lid and place in the oven. ", "Cook for at least four hours (or preferably overnight) until the meat is very tender.  ", "For the suet dumplings, combine the first five ingredients, mixing well.  Work to a paste with cold beef stock, adding just enough to bind all the ingredients.  Season to taste.", "Heat the remaining beef stock in a saucepan and bring to the boil. Shape the paste into 2cm/¾in dumplings and drop them into boiling beef stock. Cook until light and puffed up. This should take about 30 minutes.", "Remove from the stock and add to your beef casserole.", "For the mashed potato, simmer the potatoes in salted water for 12-15 minutes.  Drain, then put the colander over the pan on a low heat for two minutes to dry the potatoes.", "Return the potatoes to the saucepan with a pinch of salt and ground white pepper and mash until smooth.", "Fold in the butter and warm milk and beat until combined.  Check seasoning.", "Serve the beef and dumplings with a dollop of mashed potato."]}, {"isVegetarian": false, "title": "Beef burgers", "url": "www_bbc_co_uk_food_recipes_beefburgers_83748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2¼lb minced beef", "1 large onion, grated", "3 tbsp fresh parsley and thyme ", "salt and pepper, to taste"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the barbecue to hot. ", "Place all the ingredients in a large bowl and mix together with a fork.", "With wet (and clean) hands, shape the meat into flattish rounds of an equal depth to ensure even and thorough cooking. ", "Cook on the barbecue for approximately 5 minutes on each side - the burgers should be brown in the middle as well as on the outside."]}, {"isVegetarian": false, "title": "Beef burger with thyme potato wedges", "url": "www_bbc_co_uk_food_recipes_beefburgerwithpepper_88281", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefburgerwithpepper_88281_16x9.jpg", "ingredients": ["1 large potato, cut into wedges", "2 garlic cloves, unpeeled", "2 tbsp olive oil", "1 sprig fresh thyme, leaves only", "salt and freshly ground black pepper", "¼ onion, finely chopped", "150g/5½oz minced beef", "pinch dried chilli flakes", "dash olive oil", "2 slices ciabatta or 1 ciabatta roll, halved"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "For the wedges, bring a pot of salted water to the boil. Carefully drop the wedges into the pan and boil for 4 minutes, then drain well. ", "Put the potato wedges on a baking tray with the garlic. Drizzle with olive oil, sprinkle with salt, pepper and the thyme and roast for 30 minutes, or until golden-brown and tender.", "For the burger, mix the onion, beef, chilli flakes, salt and pepper together in a bowl. Using your hands, shape the mixture into a patty and rub with olive oil. Heat a frying pan until smoking hot and fry the burger for 4-5 minutes on each side, or until cooked through.", "Meanwhile, preheat the grill to high and grill the ciabatta until crisp. Put the burger on the toasted ciabatta and top with any desired toppings. Serve the burger with the potato wedges alongside. "]}, {"isVegetarian": false, "title": "Beef curry with crispy noodles", "url": "www_bbc_co_uk_food_recipes_beefcurrywithcrispyn_86429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp cumin seeds", "1 tsp coriander seeds", "1 tsp fennel seeds", "1 tsp fenugreek seeds", "2 cardamom pods, lightly crushed", "1 tbsp vegetable oil", "500g/1lb 2oz cubed fillet steak", "2 onions, sliced", "2 garlic cloves, finely chopped", "2 small red bird's-eye chillies, finely chopped ", "1 x 400g/14oz can chopped tomatoes", "1 tbsp grated fresh ginger", "1 tbsp turmeric", "250ml/10½fl oz beef stock", "1 x pack thick rice noodles, broken into 7cm/3in pieces", "basmati rice, cooked according to packet instructions", "lime wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Gently dry-fry the spices in a large frying pan over a medium heat for 2-3 minutes, until fragrant and toasted. Transfer to a pestle and mortar and grind together.", "In same pan, heat the oil and add the steak pieces. Fry for 2-3 minutes, stirring occasionally, until golden-brown all over, then remove from the pan.", "Add the onion to the pan. Reduce the heat and gently fry for 10-12 minutes, until soft and golden-brown.", "Add the garlic and chillies and fry for two minutes.", "Add the ground spice mixture, tomatoes, ginger and turmeric and bring to the boil.", "Add the stock and bring back to the boil. Reduce the heat and simmer for 25 minutes, until thickened.", "Return the meat to the sauce and allow to warm through.", "Meanwhile, for the noodles, heat the oil in a deep, heavy-bottomed pan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Add the noodles to the oil in small batches and fry for 1-2 minutes, or until they puff up and become crisp.", "Carefully remove the cooked noodles from the oil with a slotted spoon and drain on kitchen paper.", "To serve, place a large spoonful of basmati rice onto each plate and spoon the curry over or alongside.", "Place a small handful of the crispy noodles onto the curry and serve with lime wedges on the side."]}]