[{"ingredients": ["25 g / 1oz de mantequilla sin sal", "1 diente de ajo, finamente picado", "¼ cebolla roja, finamente rebanada", "100 g / 3½ oz de champiñones, picados por la mitad", "Crema doble 50ml / 2fl oz", "1 cucharada de perejil de flatillo picado", "sal y pimienta negra recién molida", "2 rebanadas gruesas de pan tostado", "1 cucharada de aceite de oliva", "pizca de pimentón, para adornar"], "method": ["Derrita la mantequilla en una sartén grande, luego fría el ajo y la cebolla hasta que estén blandos.", "Agregue los champiñones y cocine hasta que estén suaves.", "Agregue la crema doble y el perejil, sazone con sal y pimienta negra recién molida y reduzca hasta que espese.", "Para servir, rocíe la tostada con aceite de oliva y cuchara sobre la mezcla de champiñones. Adorne con una pizca de pimentón."], "url": "www_bbc_co_uk_food_recipes_mushroomsontoast_83304", "title": "Champiñones sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "3 rebanadas de pan", "1 hongo Portobello, en rodajas", "sal y pimienta negra recién molida", "Queso Wensleydale de 55 g / 2 oz, desmenuzado", "1 puñado de espinacas", "1 diente de ajo, aplastado", "3 cucharadas de aceite de oliva", "6 hojas de albahaca fresca", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el champiñón en la tostada, rocíe tres cucharadas de aceite sobre el pan y colóquelo en una bandeja para hornear. Coloque en el horno para tostar durante 3-4 minutos, o hasta que estén doradas y crujientes.", "Calentar el aceite de oliva en una sartén y freír los champiñones durante 2-3 minutos, luego sazone con sal y pimienta negra recién molida.", "Para el pesto, coloque todos los ingredientes del pesto en un procesador de alimentos y pulse hasta que quede suave.", "Sirva los champiñones en la tostada, con el pesto rociado sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_mushroomsontoastwith_90123", "title": "Champiñones en pan tostado con pesto de espinacas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "2 puerros picados", "3 dientes de ajo picados", "300 g / 9 oz de champiñones, en rodajas", "2 -3 ramitas de tomillo fresco, solo hojas", "600 ml / 1 pinta de caldo de pollo o verdura"], "method": ["Derrita la mantequilla en una olla grande y cocine suavemente los puerros y el ajo durante 4-5 minutos o hasta que se ablanden. Agregue los champiñones y el tomillo y cocine a fuego alto durante 2-3 minutos.", "Vierta sobre el caldo y cocine durante 5 minutos.", "Retirar del fuego, verter cuidadosamente en un procesador de alimentos y mezclar hasta que quede suave. Alternativamente, mantén la olla y usa una batidora para blitz hasta que quede suave.", "Divida entre cuatro tazones y sirva."], "url": "www_bbc_co_uk_food_recipes_mushroomsoup_77788", "title": "Sopa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushroomsoup_77788_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25 g / 1 oz de mantequilla sin sal, picada", "1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 hongo de Portobello, finamente picado", "sal y pimienta negra recién molida", "50ml / 2fl oz de vino blanco", "200ml / 7fl oz de pollo caliente o caldo de verduras", "Crema doble 50ml / 2fl oz", "1 cucharadita de perejil fresco picado"], "method": ["Derretir la mantequilla con el aceite de oliva en una sartén y freír la cebolla y el ajo hasta que estén suaves.", "Agregue la seta y cocine hasta que esté suave, luego sazone bien con sal y pimienta negra recién molida.", "Agregue el vino blanco y cocine para reducir a la mitad.", "Agregue el caldo y cocine a fuego lento durante cinco minutos, luego agregue la crema y el perejil.", "Deje que se enfríe un poco, luego mezcle hasta que esté suave en una licuadora. Sirva en un recipiente tibio, recalentado si es necesario."], "url": "www_bbc_co_uk_food_recipes_mushroomsoup_83366", "title": "Sopa de champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "25g / 1oz de mantequilla", "½ cebolla, finamente picada", "125g / 4½ oz de champiñones de castaña, en cuartos", "1 cucharadita de pimentón", "75ml / 2½fl oz de vino blanco", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "½ limón, solo jugo", "2 cucharadas de cebolletas frescas picadas", "2 rebanadas de pan blanco", "4 cucharadas de aceite de oliva", "1 diente de ajo, finamente picado", "Filete de solomillo de 150 g / 5½ oz", "1 cucharada de aceite de oliva", "1 cucharada de yogurt natural", "1 cucharada de cebolletas frescas picadas", "pizca de pimentón", "Rodajas de limón"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el champiñón stroganoff, caliente el aceite y la mantequilla en una sartén y fría la cebolla hasta que comience a ablandarse.", "Agregue los champiñones y el pimentón y continúe freír durante 4-5 minutos.", "Agregue el vino blanco y cocine a fuego lento hasta que esté ligeramente reducido, luego vierta la crema y llévela al punto de ebullición. Sazonar con sal y pimienta negra recién molida y agregar el jugo de limón y el cebollín.", "Mientras tanto, para la bruschetta, caliente una sartén a prueba de horno hasta que esté caliente. Rocíe el pan con aceite de oliva y espolvoree sobre el ajo. Coloque en la sartén, pesando el pan con una cacerola. Planche hasta que el pan esté dorado a cada lado. Retire de la sartén, pero deje la sartén al fuego.", "Para la carne, frote la carne con aceite de oliva y coloque en la sartén plancha caliente. Dobla la carne rápidamente en cada lado y luego transfiere la sartén al horno para continuar cocinando durante unos cinco minutos o hasta que esté cocida a tu gusto. Retire del horno y deje reposar en un lugar cálido durante unos minutos.", "Para servir, corte las dos rebanadas de pan a la parrilla por la mitad y coloque las cuatro piezas en un plato. Vierta sobre el champiñón stroganoff.", "Cortar la carne y colocar en un ventilador sobre la parte superior de los champiñones. Sirva con una cucharada de yogur natural en la parte superior, espolvoree cebollino y pimentón y adórnelo con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_mushroomstroganoffon_88527", "title": "Mushroom stroganoff sobre bruschetta de ajo con carne de vaca chamuscada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 hongo plano grande", "1 cucharada de aceite de oliva", "50g / 1¾oz de pan rallado fresco", "puñado de perejil fresco, picado", "1 diente de ajo, finamente picado", "puñado de espinacas, picadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Retire el tallo de la seta y picarlo finamente. Calentar el aceite en una sartén y freír suavemente el tallo de setas picadas durante un minuto.", "Agregue las migas de pan, el perejil y el ajo y fría por 2-3 minutos. Agregue la espinaca picada, sazone al gusto, con sal y pimienta negra recién molida y fría por un minuto más.", "Coloque el hongo en una bandeja para hornear y rellene con la mezcla de migas de pan. Transfiera al horno y hornee durante 6-8 minutos, o hasta que la cobertura esté dorada y el hongo se ablande.", "Para servir, coloque el hongo relleno en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_mushroomstuffedwiths_86057", "title": "Champiñones rellenos de espinacas, pan rallado, ajo y hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 rebanada gruesa de pan", "2 cucharadas de perejil picado", "½ cebolla, finamente picada", "1 cucharada de aceite de oliva", "1 hongo grande, picado", "½ cucharadita de mostaza integral", "salpicar vino blanco", "salpicaduras doble crema"], "method": ["Caliente el aceite en una sartén pequeña a fuego medio. Espolvoree el pan con el picado y luego fría por ambos lados durante 1-2 minutos.", "Retire el pan frito de la sartén y manténgalo caliente. Agregue la cebolla, aceite extra y champiñones a la sartén y fría a fuego alto durante tres minutos.", "Revuelva a través de la mostaza, el vino blanco y la crema doble y sazone con sal marina y pimienta negra recién molida. Dejar hervir a fuego lento hasta que la mezcla se espese.", "Para servir, coloque el pan frito en un plato de servir y cuchara sobre la mezcla cremosa de champiñones."], "url": "www_bbc_co_uk_food_recipes_mushroomswithcreamym_84463", "title": "Champiñones con mostaza cremosa en pan frito", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de cacahuete", "2 huevos de gallinas camperas, ligeramente golpeados", "1 diente de ajo, finamente picado", "1 cucharada de jengibre fresco rallado", "Filetes de pechuga de pollo sin piel de 250g / 9oz cortados en trozos pequeños", "1 cucharada de vino de arroz Shaoxing o jerez seco", "2 hongos chinos secos, previamente empapados en agua caliente durante 20 minutos, escurridos y finamente picados", "1 zanahoria pequeña, zanahoria", "50g / 2 oz de pepinillos o mostaza en conserva, finamente picados", "Setas de madera secas de 50 g / 2 oz, previamente empapadas en agua caliente durante 20 minutos, escurridas y finamente picadas", "Brotes de bambú enlatados de 120g / 4oz, drenados y picados", "1 puñado de cacahuetes tostados en seco", "2 cucharadas de salsa de soja ligera", "1 cucharadita de aceite de sésamo tostado", "2-3 pellizcos de pimienta blanca molida", "12 hojas de lechuga iceberg o 12 harina de trigo pequeña Panqueques chinos, cocidos al vapor en un vapor de bambú durante 5-6 minutos"], "method": ["Caliente un wok hasta que esté humeando y agregue dos cucharadas de aceite de cacahuete, luego agregue los huevos y cocínelos por un minuto, o hasta que estén revueltos. Retira del wok y ponlo a un lado. Limpie el wok limpio.", "Caliente el aceite de cacahuete restante en el wok hasta que esté humeando, luego agregue el ajo y el jengibre y saltee por unos segundos. Agregue el pollo y cocine durante 1-2 minutos, o hasta que esté ligeramente dorado, luego agregue el vino de arroz o el jerez y mezcle bien. Revuelva freír durante unos segundos, luego agregue los hongos chinos secos y la zanahoria y saltee durante 1-2 minutos, o hasta que las zanahorias estén tiernas pero con un poco de mordida.", "Agregue los pepinillos, las setas de madera secas, los brotes de bambú y los cacahuetes y mezcle bien. Revuelva en los huevos revueltos. Sazone con la salsa de soja, el aceite de sésamo y la pimienta y transfiera a un plato para servir.", "Para servir, coloca el plato en el centro de la mesa junto con las hojas de lechuga. Rellene cada hoja de lechuga con el relleno y coma de inmediato."], "url": "www_bbc_co_uk_food_recipes_mushuchicken_89297", "title": "Número MU pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mushuchicken_89297_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo pequeño", "1 limón, solo jugo", "escasa ½ cucharadita de pimienta de Jamaica molida", "1 cebolla mediana, más o menos picada", "1 hoja de laurel fresca", "aceite de oliva, para cepillar", "Cebollas 700g / 1½lb", "3-4 cucharadas de aceite de oliva y girasol, mezclado, más extra para freir piñones", "2-3 tbsp sumac", "475-700ml / 16-25fl oz / 3 / 4-1¼ pintas de caldo de pollo", "2 puñados grandes de piñones", "Pan plano libanés o similar"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Corta el pollo por la mitad. Frote la piel con el jugo de limón y coloque el pollo en una cazuela con aproximadamente 2-3cms / 1½-2 pulgadas de agua, la pimienta de Jamaica, la cebolla picada y la hoja de laurel. Cubra la cacerola con una tapa ajustada, colóquela en la placa y cocine a fuego lento el pollo a fuego medio durante aproximadamente 45 minutos, hasta que esté cocido. (Es posible que necesite agregar más agua para evitar que la cazuela se seque).", "Escurre el pollo y reserve el caldo. Cepille las piezas de pollo con aceite de oliva, colóquelas en un molde para asar y colóquelas en el horno precalentado hasta que la piel esté ligeramente dorada (esto debería demorar unos 20 minutos).", "Mientras el pollo está rostizado, pique finamente las cebollas de 700 g / 1½ lbs. Caliente el aceite de oliva y el aceite de girasol en una sartén grande, agregue las cebollas y fríe suavemente durante unos 10-15 minutos hasta que estén suaves y dorados. Agregue el zumaque y saltee, revolviendo constantemente, durante tres o cuatro minutos, agregando más aceite de oliva si la mezcla parece seca. Agregue el caldo de pollo, cubra y cocine a fuego lento muy lentamente, sin cubrir durante 20 minutos.", "Mientras tanto, freír los piñones en un poco de aceite.", "Al final del tiempo de cocción, retire el pollo dorado de la lata de asar. Cepille la lata con aceite de oliva y cubra la parte inferior de la lata de asar con una capa de pan plano y una cuchara sobre la mayor parte de la mezcla de cebolla y zumaque, reservando algunos para ir encima del pollo. Vuelva a colocar el pollo en la parte superior del pan, ponga la mezcla de cebolla / zumaque reservada y vuelva al horno por otros 10-15 minutos.", "Sirva el pollo, espolvoreado con piñones, encima del pan."], "url": "www_bbc_co_uk_food_recipes_mussakhan_80246", "title": "Mussakhan", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 cebollas, finamente cortadas", "sal y pimienta negra", "2 dientes de ajo, en rodajas finas", "¼-½ cucharadita de hojuelas de chile, al gusto", "200g / 7oz de tomates enlatados", "Arroz de paella 250 g / 9 oz", "500ml / 18fl oz de caldo de pollo o vegetal", "175g / 6oz de mejillones cocidos", "Guisantes congelados de 200g / 7oz, descongelados"], "method": ["Caliente una sartén grande de base delgada a fuego medio. Agregue el aceite y, una vez caliente, agregue las cebollas y una pizca de sal. Cocine por 5-6 minutos, o hasta que las cebollas estén suaves y translúcidas, luego agregue las hojuelas de ajo y chile y cocine por otros dos minutos.", "Revuelva a través de los tomates enlatados, rompiendo cualquier trozo grande con el dorso de una cuchara de madera. Agregue el arroz y una pizca de sal y pimienta y revuelva bien para mezclar. Vierta sobre el caldo y deje la sartén durante siete minutos sin remover. Baje el fuego a medio bajo si el líquido parece evaporarse demasiado rápido.", "Dispersar sobre los mejillones y los guisantes - no mezclar (está tratando de crear un fondo fresco para el arroz). Cubra con una tapa y cocine por otros cinco minutos, o hasta que el líquido se haya absorbido por completo, el arroz esté tierno pero todavía con un ligero mordisco, y los mejillones y los guisantes estarán calientes por completo.", "Sirva la paella caliente, asegurándose de que todos tengan un poco de arroz crujiente pegado al fondo de la sartén."], "url": "www_bbc_co_uk_food_recipes_mussel_and_pea_paella_42918", "title": "Paella de mejillones y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1kg / 2lb 4 oz, fregados y rellenos", "2 ramitas de tomillo fresco", "200ml / 7fl oz de vino blanco seco", "50g / 1¾oz de mantequilla", "1 cucharada de aceite de oliva", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 puerro, más o menos picado", "1 bulbo de hinojo, más o menos picado mantener las frondas de la parte superior", "200g / 7oz de granos de maíz dulce", "250ml / 9fl oz de caldo de pollo o pescado", "100ml / 3½ fl oz crema doble", "4 pan de focaccia rebanado largo, dejado para ir añejo", "2 tomates, pequeña cruz hecha en la parte inferior", "agua helada, para refrescar", "4 cucharadas de eneldo fresco finamente picado", "2 cucharadas de aceite de oliva virgen extra"], "method": ["Deseche los mejillones rotos y los que no se cierren herméticamente cuando los toque.", "Caliente una cacerola grande a fuego medio-alto. Agregue los mejillones, el tomillo y el vino y coloque una tapa. Cocine por 3-4 minutos, o hasta que los mejillones se hayan abierto. Drene, reservando el licor de cocción y deseche los mejillones que permanecen cerrados. Elige los mejillones de sus conchas. Deja a un lado el licor y los mejillones.", "Caliente una sartén grande y agregue la mantequilla y el aceite. Agregue la chalota y el ajo y cocine durante dos minutos. Agregue los puerros e hinojo y cocine durante 2-3 minutos más. Agregue el maíz dulce, luego agregue el caldo, el licor retenido y las tres cuartas partes de la carne de mejillón. Cocine por 2-3 minutos.", "Coloque la sopa en una licuadora y mezcle hasta que quede suave. Vierta en la sartén y agregue la crema. Tostar el pan.", "Coloque los tomates en un recipiente con agua hirviendo durante dos minutos. Levante con una cuchara ranurada y revuelva en agua helada. Pele y retire los tomates, luego corte la carne. Transfiera a un tazón pequeño y mezcle el eneldo, el aceite de oliva y los mejillones restantes.", "Sirva la sopa con la mezcla de tostadas y tomate."], "url": "www_bbc_co_uk_food_recipes_mussel_and_sweetcorn_31015", "title": "Sopa de mejillones y maíz dulce con focaccia, tomates y eneldo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1.5kg / 3lb 5oz", "dash aceite de oliva", "4 chalotes, cortados en 1cm / ½ en dados", "1 diente de ajo, finamente rallado", "10 g de jengibre encurtido, finamente picado", "10g de raíz fresca de jengibre", "2 chiles rojos, sin semillas, cortados en rodajas finas", "3 hojas de lima kaffir", "15g / ½ oz de azúcar de palma", "1 palo de limoncillo, finamente picado", "1 litro / 1¾ pintas de caldo de pescado, cocinado hasta reducido a 500ml / 18fl oz", "½ x 200 ml / 7 fl oz de leche de coco estaño", "salsa de soja, al gusto", "1 lima, ralladura y jugo", "1 pan de masa fermentada de buena calidad", "10g hojas de albahaca rotas", "10g de hojas de cilantro (el cuchillo pasa suavemente)"], "method": ["Lave los mejillones con abundante agua fría y corriente. Deseche cualquier abierto que no se cierre cuando se golpea ligeramente.", "Saque las barbas duras y fibrosas que sobresalen entre las conchas bien cerradas y luego corte los percebes con un cuchillo grande. Dar a los mejillones otro enjuague rápido para eliminar cualquier pequeño trozo de concha. Dejar de lado.", "A fuego medio o bajo, freír los chalotes en una sartén grande en un poco de aceite de oliva hasta que estén suaves, pero aún incoloros. Agregue el ajo, tanto el jengibre en escabeche como el jengibre fresco, los chiles en rodajas, las hojas de lima kaffir, el azúcar de palma y el limoncillo. Cocine esto suavemente por otros ocho minutos, agregando un poco de agua si la mezcla comienza a colorear.", "Vierta el caldo de pescado, cocine a fuego lento y cocine hasta que el volumen del líquido se haya reducido (aproximadamente cinco minutos). Agregue la leche de coco y cocine a fuego lento por otros 5-8 minutos. Pruebe el caldo, revise el condimento y ajústelo con salsa de soja y jugo de lima, al gusto. Deja enfriar.", "Caliente un wok o una sartén de tamaño mediano a fuego medio. Agregue los mejillones, baje el fuego y cocine suavemente con una tapa hasta que todos los mejillones estén abiertos (deseche los que no se abren). Agrega el caldo", "Cortar el pan de masa fermentada en rodajas y frotar todo con aceite de oliva. Calentar una sartén y dorar el pan por ambos lados.", "Espolvoree el caldo con albahaca recién picada, cilantro y ralladura de lima y sirva en tazones con la masa madre."], "url": "www_bbc_co_uk_food_recipes_mussel_broth_61515", "title": "Caldo de mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina de pan blanco", "1 cucharadita de sal", "1 x 7 g bolsita de levadura seca", "1 cucharada de aceite de oliva extra virgen", "1 cucharada de aceite de oliva", "1 cucharada de mantequilla", "2 chalotes, en rodajas", "2 dientes de ajo, en rodajas", "1 bulbo de hinojo, finamente cortado", "1 zanahoria grande, pelada en tiras", "2 tomates de ciruela, pelados, sin semillas y picados", "300 ml / 10½ fl oz de vino blanco", "300ml / 10½ fl oz crema doble", "1 cucharadita de hojas frescas de tomillo - ¿no se usa?", "1 cucharada de perejil de hoja plana, picado", "1 cucharada de perifollo, picado", "Mejillones de 300g / 11oz en sus conchas, limpios", "2 yemas de huevo, batidas"], "method": ["Para la masa de pan, coloca la harina, la sal y la levadura en un tazón grande y revuelve. Haga un pozo en el centro de la harina y vierta gradualmente el aceite y 350 ml / 12 fl oz de agua, mezclando la harina para formar una masa suave.", "Incline y amasar sobre una superficie de trabajo engrasada durante aproximadamente 10 minutos o hasta que la masa esté suave y elástica. Colóquelo en un recipiente, cúbralo y déjelo reposar durante 2 horas, o puede dejarlo en la nevera durante la noche.", "Para el pastel de mejillones, precaliente el horno a 220C / 425F / Gas 7.", "Limpia los mejillones y tira de las \"barbas\". Si hay mejillones abiertos, tóquelos ligeramente sobre una superficie dura. Si no se cierran, deséchelos.", "Calienta una sartén a horno de 23 cm / 9 pulgadas o una cacerola y una vez caliente agrega el aceite y la mantequilla.", "Freír los chalotes, el ajo y el hinojo en el aceite y la mantequilla durante 2-3 minutos hasta que estén blandos. Agregue la zanahoria y los tomates y cocine por un minuto más.", "Encienda el fuego y agregue el vino blanco, revolviendo bien para recoger cualquier trozo pegado en el fondo de la sartén.", "Cocine hasta que el vino haya reducido el volumen a la mitad y luego agregue la crema. Cocine a fuego lento para reducir a la mitad.", "Agregue las hierbas frescas y los mejillones y retírelos del fuego.", "Ruede la masa sobre una superficie enharinada hasta que tenga un círculo un poco más grande que la sartén. Cubra la cazuela con la masa y coloque los bordes alrededor de los lados.", "Cepille la parte superior de la masa con el huevo batido y colóquela en el horno de 15 a 20 minutos hasta que se dore.", "Para servir, lleve la sartén a la mesa y sirva enseguida. (No coma mejillones que no se hayan abierto durante la cocción)."], "url": "www_bbc_co_uk_food_recipes_mussel_pie_14813", "title": "Tarta de mejillones", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250g / 9oz de arroz baldo", "30g / 1oz de mantequilla", "3 cucharadas de aceite de oliva", "4 cucharadas de orzo (o arpa sehriye)", "500ml / 18fl oz de caldo de pollo", "Mejillones de 500 g / 1 libra y 2 onzas, fregados y rellenos", "30 g / 1 oz de eneldo fresco, aproximadamente picado"], "method": ["Lave el arroz con agua corriente fría.", "Caliente la mantequilla y el aceite de oliva en una sartén grande y poco profunda con tapa. Agregue el orzo y cocine durante 1 minuto, hasta que comience a dorarse. Agregue el arroz lavado y cocine durante 2 minutos, revolviendo constantemente.", "Verter sobre el caldo de pollo, llevar a ebullición y luego cocinar a fuego lento durante 10-15 minutos, o hasta que se ablande, pero aún con un pequeño mordisco.", "Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos. Esparza los mejillones sobre el arroz, coloque la tapa en la sartén y cocine a fuego lento durante 4-5 minutos adicionales.", "Comprueba que los mejillones se hayan abierto. Deseche cualquier mejillón que permanezca cerrado.", "Dobla el eneldo en el arroz y los mejillones antes de servir."], "url": "www_bbc_co_uk_food_recipes_mussel_pilav_38570", "title": "Arroz de mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussel_pilav_38570_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de mantequilla", "1 cebolla, más o menos picada", "250ml / 9fl oz de vino blanco", "Mejillones de 500 g / 1 libra y 2 onzas (enjuagados, sin barba, deseche los mejillones que no se cierren herméticamente cuando se golpean)", "500g / 1lb 2 oz de calabaza, pelada, sin semillas, picada", "2 dientes de ajo, picados", "2 ramitas de tomillo fresco, solo hojas", "400ml / 14fl oz de caldo de verduras", "Crema doble 125ml / 4½fl oz", "Anís de 2 estrellas", "pequeño azafrán", "1 lima, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de berro de acedera roja o hierbas frescas picadas, para adornar (opcional)"], "method": ["Caliente la mitad de la mantequilla en una cazuela con tapa a fuego medio a alto. Cuando la mantequilla esté espumosa, agregue la mitad de la cebolla y fría por 2-3 minutos, hasta que se ablande.", "Verter en la mitad del vino y llevar a ebullición. Agregue los mejillones, cubra la cacerola con la tapa, luego cocine a fuego lento durante 2-3 minutos, o hasta que los mejillones se hayan abierto.", "Cuele los mejillones a través de un colador suspendido sobre una olla limpia. Recoge el líquido de cocción en la sartén. Dejar de lado para enfriar.", "Agregue la mantequilla restante a la cazuela. Freír la cebolla restante durante 2-3 minutos, o hasta que se ablanden, luego agregar la calabaza y agregarla por unos minutos más.", "Agregue el ajo, el tomillo, el vino restante, el caldo y los jugos de cocción reservados (a excepción de cualquier residuo arenoso en el fondo de la sartén). Agregue dos tercios de la crema, el anís estrellado y el azafrán y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cocine a fuego lento durante 6-8 minutos, o hasta que la calabaza esté tierna.", "Mientras la sopa se cocina, toma la carne de los mejillones. Deseche las conchas y los mejillones que no se hayan abierto.", "Cuando la calabaza esté tierna, retire la sopa del fuego y deseche el anís estrellado. Agregue dos tercios de la carne de mejillón y deje que la sopa se enfríe un poco.", "Mezcle la sopa, en tandas, en un procesador de alimentos, hasta obtener un puré fino. Calentar en una cacerola limpia si es necesario. Sazonar, al gusto, con el jugo de limón y sal y pimienta negra recién molida.", "Sirva la sopa en tazones, esparcida con los mejillones restantes y adornada con un remolino de la crema restante y un poco de berro, si se usa."], "url": "www_bbc_co_uk_food_recipes_mussel_pumpkin_and_73735", "title": "Sopa de mejillones, calabaza y azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 kg / 2lb 3 oz de mejillones frescos", "200ml / 7fl oz de vino blanco", "1 cucharada de aceite de oliva", "1 chalote, finamente picado", "1 diente de ajo, finamente picado", "1 bulbo de hinojo, aproximadamente picado", "pellizcar el azafrán", "50ml / 2fl oz de licor de anís", "300ml / 10½fl oz de caldo de pescado", "100ml / 3½ fl oz crema doble", "2 cucharaditas de berro de coriandro (o cilantro picado finamente)", "1 pan blanco pan rebanado", "2 cucharadas de aceite de oliva", "1 diente de ajo, reducido a la mitad"], "method": ["Limpia los mejillones frotándolos a fondo con abundante agua corriente, quitándolos y descartando las \"barbas\", los hilos fibrosos similares a las algas marinas. Deseche los mejillones rotos y cualquier mejillón que no se cierre herméticamente cuando los toque.", "Coloque los mejillones en una olla, agregue el vino blanco y cocine durante 3-4 minutos.", "Escurrir, reservar el licor de cocción y recoger los mejillones de sus caparazones. Separe el licor y los mejillones, pero deseche las cáscaras.", "Caliente una sartén grande y agregue el aceite. Agregue el chalote, el ajo y el hinojo finamente picados y cocine por 3-4 minutos.", "Agregue el azafrán, el licor de anís, el caldo, tres cuartas partes de la carne de mejillón, termine con la crema", "Cocine durante otros 3-4 minutos hasta que se caliente, luego mezcle con una batidora hasta que quede suave.", "Calentar una sartén grande de la plancha y rociar el pan en rodajas con aceite y frotar con el diente de ajo a la mitad. Tueste el pan en la plancha por 2-3 minutos."], "url": "www_bbc_co_uk_food_recipes_mussel_soup_84311", "title": "Sopa de mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 dientes de ajo", "2 yemas de huevo de gallinas camperas", "medio limón, solo jugo", "sal y pimienta", "1 cucharadita de mostaza Dijon", "200ml / 7fl de oz de aceite, (mezcla de girasol y aceite de oliva, al gusto. El aceite de oliva lo hace un sabor más pesado).", "Mejillones 750g / 1lb 10oz", "2 cucharadas de aceite de oliva", "1 cebolla, finamente rebanada", "2 hojas de laurel", "250ml / 9fl oz de vino blanco seco", "1 parecía", "1 hinojo, en rodajas finas", "1 zanahoria, en rodajas finas", "2 pizcas de azafrán", "sal y pimienta", "250 ml / 9 fl oz aoli ​​(ver arriba)", "grandes trozos de pan duro, para servir"], "method": ["Para el aoli, pele el ajo y quite el germen verde central de cualquiera de los dientes. Mézclelo en un procesador de alimentos y agregue las yemas de huevo, el jugo de limón, una generosa pizca de sal y pimienta y la mostaza. Licúe hasta que quede suave, luego agregue gradualmente el aceite, hasta que tenga una pasta suave. Dejar de lado en la nevera.", "Para los mejillones, limpia y descarta los mejillones. Si alguno está abierto, y no se cierra cuando se golpea firmemente, entonces deséchelo inmediatamente.", "Caliente una sartén grande con tapa a fuego alto.", "Agregue el aceite y la mitad de la cebolla. Freír suavemente hasta que esté suave, luego agregar las hojas de laurel y un generoso toque de vino.", "Una vez caliente, agregue los mejillones inmediatamente seguidos de 200 ml / 7 fl oz de agua. Rápidamente abra la tapa y cocine los mejillones al vapor durante 3-5 minutos, o hasta que se acaban de abrir. Incline los mejillones en un colador colocado sobre un recipiente, de modo que retenga los jugos de cocción, descartando los que no se hayan abierto.", "Cuando esté lo suficientemente frío para manipularlo, saque la carne de mejillón de las conchas y colóquela en un recipiente. Reserve el líquido de cocción colado.", "Lave el puerro y corte finamente la parte blanca. Freír la cebolla restante, el puerro, el hinojo y la zanahoria en una sartén grande con un poco de aceite de oliva hasta que estén tiernos. Agregue un poco más de vino blanco, el líquido de cocción reservado de los mejillones y 100 ml / 3½ fl oz de agua. Agregue el azafrán y un poco de sal y pimienta al gusto y cocine a fuego lento durante 10 minutos.", "Una vez que el caldo se haya cocido a fuego lento durante 10 minutos, mezcle una cucharada grande de aoli ​​para espesar. Siga con los mejillones recogidos y déjelos calentar antes de servir.", "Para servir, ponga una rebanada gruesa de pan duro en cada tazón y vierta sobre el guiso."], "url": "www_bbc_co_uk_food_recipes_mussel_stew_with_garlic_31460", "title": "Mejillones con ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mussel_stew_with_garlic_31460_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30g / 1oz de mantequilla", "1 puerro pequeño, finamente cortado en cubitos", "1 bulbo de hinojo, finamente cortado", "Setas de castaña 200 g / 7 oz, en rodajas (opcional)", "3 chalotes, finamente picados", "pizca de curry en polvo", "pellizcar hilos de azafrán", "ramitas de tomillo", "250ml / 9fl oz de vino blanco", "590 g / 1 libra de mejillones frescos de 5 oz, limpios y barbados", "Crema doble de 200 ml / 7 fl oz", "perejil pequeño, cortado y picado finamente", "sal y pimienta negra recién molida"], "method": ["En una sartén grande, derrita la mantequilla y agregue el puerro, el hinojo y las setas (si se usan) las chalotas, el curry en polvo, el azafrán y el tomillo. Cubra la sartén y sude las verduras suavemente durante unos 5 minutos, o hasta que estén suaves pero no coloreadas.", "Agregue el vino y deje que hierva, luego agregue los mejillones. Cubra y cocine, sacudariendo ocasionalmente hasta que todos los mejillones estén abiertos. Deseche cualquier que permanezca cerrado.", "Colar y devolver el licor a la sartén. Cocine sin tapar durante 5 minutos para reducir antes de agregar la crema y el perejil.", "Volver a hervir, devolver los mejillones a la sartén, dejar calentar durante un minuto y servir inmediatamente con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_musselfennelandsaffr_67648", "title": "Caldo de mejillones, hinojo y azafrán", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1-2 chalotes, pelados y finamente picados", "1 diente de ajo, pelado y aplastado", "Mejillones de 1 kg / 2¼ lb, limpios y sin barba (descartados o abiertos)", "1 botella de cerveza", "2-3 cucharadas de pimiento finamente picado, perejil para decorar"], "method": ["Caliente una olla grande con tapa y agregue el aceite de oliva.", "Agregue los chalotes y el ajo y cocine por un minuto.", "Agregue los mejillones y vierta la cerveza. Mezclar, subir el fuego y poner la tapa.", "Cocine, agitando la sartén de vez en cuando hasta que todos los mejillones se hayan abierto y estén cocidos. Retire los mejillones que permanecen cerrados.", "Con una cuchara, sirva los tazones con los jugos, espolvoréelos con perejil y sírvalos con pan rústico."], "url": "www_bbc_co_uk_food_recipes_mussels_1399", "title": "Mejillones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 manojo grande de romero", "800 g / 1 lb 12 oz de sémola", "200g / 7oz de polenta blanca", "Mejillones de 1kg / 2lb 4 oz, al vapor y carne de mejillón eliminada", "sal fina", "300g / 10½oz de kumquats, muy finas en rodajas", "aceite vegetal, para freír", "10 anchoas marrones más el aceite del estaño, preferiblemente Natoora o Brindisa", "40 g / 1½ oz de queso parmesano, rallado", "1 bulbo de ajo, asado", "2 tbsp Unio Moscatel vinegar", "Crema fresca de 230g / 8oz", "3 cucharadas de aceite de oliva", "Brócoli que brota de color morado o blanco de 500 g / 1 lb 2 oz", "1 alcaparras de jarra, preferiblemente alcaparras de Lilliput, escurridas y enjuagadas", "200 g / 7 oz Parmesano (preferiblemente 24 meses de edad), rallado", "Romero grande, hojas removidas, finamente picadas", "500g / 1lb de mantequilla sin sal 2 oz", "500g / 1lb 2oz focaccia, rasgada", "200g/7oz boquerones", "copos de sal marina", "aceite de oliva virgen extra, para servir"], "method": ["Para los mejillones, kumquats y romero. Caliente el aceite vegetal en una freidora o una sartén profunda de fondo grueso a 180 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida).", "Recoja las cabezas superiores de las ramitas de romero y coloque el aceite caliente, retire inmediatamente con una espumadera y escurra sobre papel de cocina. Dejar de lado.", "Mezcle la sémola y la polenta. Seque la carne del mejillón y mezcle la mezcla de sémola y polenta para cubrir, sacuda el exceso.", "Aumente la temperatura de la freidora a 190C. Pon los mejillones en la freidora, fríe durante 1-2 minutos o hasta que estén crujientes. Retire y escurra sobre papel de cocina. Sazonar con sal fina y mezclar con kumquats y romero.", "Para el aderezo de anchoa, coloque todos los ingredientes en un procesador de alimentos y mezcle.", "Para el brócoli que brota púrpura, quite los extremos y las hojas leñosos, reserve las hojas. Corta los tallos verticalmente, teniendo cuidado de mantener los floretes unidos. Poner debajo de un paño húmedo y reservar.", "Coloque las alcaparras, reservando algunas para decorar, el parmesano, el romero y una pizca de sal en un tazón y mezcle.", "Pon la mantequilla en una cacerola, derretir hasta que burbujee y se ponga marrón. Manteniendo a fuego lento, agregue la focaccia y mezcle de vez en cuando hasta que el pan esté marrón oscuro. Retire el pan con una cuchara ranurada y colóquelo en una bandeja. Espolvoree las alcaparras y la mezcla de queso parmesano sobre el pan mientras todavía esté caliente para que se adhiera al pan.", "Coloque el brócoli en un tazón grande, cubra con un poco de aderezo para cubrir los flósculos y las hojas. Doble las alcaparras, anchoas rotas, croûtons y un par de raspados de queso parmesano. Aplasto un poco de pan extra para adornar y unas cuantas virutas de parmesano y termino con aceite de oliva virgen extra.", "Sirva los mejillones fritos en un plato y temporada. En un plato aparte, sirva el brócoli cubierto adornado con las alcaparras reservadas."], "url": "www_bbc_co_uk_food_recipes_mussels_kumquats_and_66812", "title": "Mejillones, kumquats y romero con brócoli en flor, anchoa y pan de mantequilla quemada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]