[{"ingredients": ["150 g / 5½ oz de carne picada de pavo", "1 cucharadita de pimentón", "1 cucharadita de canela molida", "1 cucharadita de jengibre molido", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "25 g / 1oz de mantequilla sin sal", "1 cucharadita de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "½ repollo rojo pequeño, en rodajas", "½ manzana, pelada, sin corazón y picada", "½ puerto de botella en miniatura", "2 cucharadas de azúcar moreno", "2 cucharadas de vinagre balsámico", "sal y pimienta negra recién molida"], "method": ["Remoje tres brochetas de madera en un recipiente con agua durante diez minutos", "Para los koftas, coloque las especias de pavo y pavo en un bol y mezcle bien. Sazonar bien la mezcla con sal y pimienta negra recién molida.", "Forme la picadita especiada en seis bolas ovaladas con sus manos y pase dos de las bolas por cada uno de los tres pinchos de madera.", "Caliente una sartén hasta que esté caliente. Cepille los koftas con el aceite de oliva y fríalos durante tres minutos en cada lado, o hasta que estén completamente cocidos.", "Para el repollo, derrita la mantequilla con el aceite en una sartén. Agregue la cebolla y el ajo a la sartén y cocínelos hasta que estén suaves y dorados.", "Agregue el repollo y la manzana a la sartén y cocine durante tres minutos.", "Agregue el puerto, el azúcar y el vinagre a la sartén y mezcle bien.", "Coloque una tapa sobre la sartén y cocine la col hasta que esté tierna, luego sazone con sal y pimienta negra recién molida.", "Para servir, coloque la col en un plato limpio. Coloque los koftas en la parte superior de la col."], "url": "www_bbc_co_uk_food_recipes_turkeykoftawithglaze_84784", "title": "Koftas de pavo con col roja esmaltada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 escalopes de pavo o papas de pavo 225g / 8oz", "1 pimiento rojo pequeño y 1 pimiento verde pequeño sin semillas y cortado en tiras", "2 dientes de ajo - aplastados", "1 cebolla pequeña picada", "400 g / 14 oz pueden cortar tomates", "10 aceitunas negras (con piedras)", "puñado de albahaca fresca", "botón de mantequilla", "aceite de oliva", "Sal y pimienta", "pasta", "parmesano"], "method": ["Saltear el pavo con mantequilla y aceite hasta que esté dorado y cocido.", "En otra sartén, caliente un poco de aceite de oliva y saltee la cebolla y el ajo, agregue los pimientos en rodajas y cocine durante unos minutos.", "Agregue los tomates y las aceitunas y cocine a fuego lento hasta que la salsa se haya reducido y espesado ligeramente.", "Agregue la albahaca rasgada al final de la cocción."], "url": "www_bbc_co_uk_food_recipes_turkeypizzaiola_4865", "title": "Turquía pizzaiola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "Pechuga de pavo 110 g / 4 oz, finamente picada", "½ puerro, más o menos picado", "1 diente de ajo, aplastado", "1 x 400g / 14oz puede tomates cherry, escurridos", "2 cucharadas de vinagre de vino blanco", "1 cucharada de perejil fresco picado", "tazón de arroz, cocinado según las instrucciones del paquete"], "method": ["Caliente el aceite vegetal en una sartén a fuego alto. Agregue el pavo y fría por 2-3 minutos en cada lado, o hasta que estén dorados.", "Agregue los puerros y el ajo a la sartén por 2-3 minutos.", "Agregue los ingredientes restantes a fuego lento para reducir y espesar la salsa.", "Para servir, quite la salsa de la sartén y coma solo o con un tazón de arroz humeante."], "url": "www_bbc_co_uk_food_recipes_turkeyragu_84111", "title": "Ragú de Turquía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz chalotes, pelados, muy finamente en rodajas", "¼ cucharadita de sal, o al gusto", "350g / 12¼oz de carne de pavo cocida, fría y cocida, cortada en tiras", "400g / 14¼oz de repollo chino, sin núcleo, hojas finamente ralladas", "100g / 3½oz de brotes de soja", "1 zanahoria grande, pelada, cortada a la mitad, finamente triturada", "15g / ½oz de hojas de menta vietnamitas (disponibles en algunas tiendas de comestibles asiáticas), o una mezcla de cilantro y menta o hojas de albahaca tailandesa, picadas", "Cacahuetes tostados de 40 g / 1½ oz, cortados en trozos grandes, más extra para servir", "pimienta negra recién molida", "3 cucharadas de salsa de pescado (nam pla)", "3 cucharadas de jugo de limón recién exprimido", "1 cucharada de vinagre de arroz", "2 cucharadas de azúcar en polvo", "1 cucharadita de ajo muy picado", "2 guindillas rojas, finamente picadas"], "method": ["Mezcle las chalotas y la sal en un tazón grande y déjelas a un lado durante 30 minutos, o hasta que se ablanden.", "Mientras tanto, para el aderezo, mezcle los ingredientes del aderezo en un recipiente aparte hasta que estén bien combinados.", "Justo antes de servir, agregue las tiras de pavo frío al cuenco de chalotes salados. Mezcle las hojas de repollo chino, los brotes de soja, la zanahoria rallada, las hierbas y los cacahuetes hasta que estén bien combinados.", "Verter sobre el aderezo, sazonar, al gusto, con pimienta negra recién molida, luego mezclar bien hasta que el aderezo cubra los ingredientes de la ensalada.", "Para servir, apile la ensalada de pavo en el centro de cada uno de los cuatro platos para servir. Espolvorea sobre el resto de los cacahuates tostados picados."], "url": "www_bbc_co_uk_food_recipes_turkeysaladwithchine_92947", "title": "Ensalada de pavo con repollo chino, brotes de soja y menta vietnamita", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeysaladwithchine_92947_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de yogur natural al estilo griego", "1 diente de ajo, aplastado", "1 cucharadita de copos de sal marina", "2 cucharadas de mantequilla sin sal", "1 cucharada de aceite de oliva extra virgen", "1 cucharadita de pimienta Aleppo", "2 huevos grandes de gallinas camperas, nevera fría", "2 cucharaditas de jugo de limón", "algunas hojas de eneldo fresco, picado", "tostada de masa fermentada gruesa, para servir"], "method": ["Llene una olla hasta 4 cm / 1½ en profundidad con agua y deje que hierva. Coloque el yogur en un tazón resistente al calor lo suficientemente grande como para sentarse sobre la sartén y agregue el ajo y la sal. Coloque el recipiente sobre la bandeja, asegurándose de que la base no toque el agua. Revuelva hasta que alcance la temperatura corporal y tenga la consistencia de una crema doble ligeramente batida. Apague el fuego, dejando el recipiente sobre la sartén.", "Derrita la mantequilla suavemente en una olla pequeña separada hasta que apenas empiece a ponerse de color marrón avellana. Apague el fuego, luego mezcle el aceite, seguido de la pimienta de Alep y reserve.", "Llene una cacerola amplia con tapa con 4 cm / 1½ en agua y coloque a fuego medio. Alinee un plato grande con papel de cocina.", "Agriete el primer huevo en un pequeño colador de malla fina suspendido sobre un tazón pequeño, luego levante y agite suavemente durante aproximadamente 30 segundos, dejando que la parte acuosa del goteo blanco en el tazón; descarte. Incline suavemente el huevo en una taza pequeña o un molde y vierta 1 cucharadita de jugo de limón, apuntando hacia el blanco. Repita con el segundo huevo.", "Cuando el agua de la caza furtiva esté empezando a hervir a fuego lento, deslice suavemente los huevos, uno a cada lado de la sartén. Baje el fuego para que no haya movimiento en el agua, y pique los huevos durante 3-4 minutos, hasta que los blancos estén listos y las yemas todavía estén líquidas. Transfiera los huevos al plato revestido con una cuchara ranurada.", "Divida el yogur caliente y cremoso entre dos tazones poco profundos, cubra cada uno con un huevo escalfado, vierta sobre la mantequilla picante, esparza el eneldo picado encima y coma con la tostada."], "url": "www_bbc_co_uk_food_recipes_turkish_eggs_77109", "title": "Huevos de Turquía", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkish_eggs_77109_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 lonchas gruesas de tocino rayado o panceta, cortadas en cubitos", "aceite de oliva", "1 cebolla mediana picada", "1 diente de ajo, picado", "pavo sobrante, picado bastante pequeño", "200g / 7oz de guisantes frescos o congelados", "2-3 cucharadas de crema doble", "sal y pimienta", "Tagliatelle 200-300g, cocido según las instrucciones del paquete", "parmesano fresco"], "method": ["En una sartén pesada freír el tocino o la panceta hasta que estén crujientes. Baje el fuego, luego agregue las cebollas y el ajo y cocine suavemente hasta que estén suaves pero no coloreados.", "Agregue los guisantes y un chorrito de agua y deje burbujear por un par de minutos. Cuando la sartén esté casi seca, agregue el pavo y caliente.", "Agregue la crema y sazone bien con sal y pimienta negra. Deje burbujear hasta que la crema se haya reducido un poco y la salsa tenga una buena consistencia de recubrimiento.", "Servir mezclado con los tallarines cocidos, con abundante parmesano rallado sobre la mesa."], "url": "www_bbc_co_uk_food_recipes_turkeywithbaconpeasa_14227", "title": "Sobras de pasta de pavo con tocino, guisantes y crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeywithbaconpeasa_14227_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cucharadas de aceite de oliva", "½ cucharadita de canela molida", "¾ cucharadita de pimienta de cayena", "1 cucharadita de comino molido", "2 dientes de ajo rallados", "6 muslos de pollo deshuesados, sin piel", "sal y pimienta negra recién molida", "2 dientes de ajo picados", "copos de sal marina", "1 chile verde, reducido a la mitad, sin semillas, más o menos picado", "1 guindilla roja, partida en dos, sin semillas, picada", "15g / ½ oz de cilantro fresco, aproximadamente picado", "8 ramitas de menta, solo hojas, aproximadamente desgarradas", "70g / 2½oz de aceitunas verdes deshuesadas, más o menos picadas", "6 cucharadas de aceite de oliva virgen extra", "2 cucharadas de vinagre balsámico blanco", "buen apretón de jugo de limón", "Harina normal de 200g / 7oz", "½ cucharadita de sal", "2 cucharadas de ghee, derretido", "¼ de pepino, en rodajas", "puñado de hojas de bebé", "3 cucharadas de aceite de oliva", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza Dijon", "Rodajas de limón", "200ml / 7fl oz de yogur griego"], "method": ["Para el pollo, haga un adobo mezclando el aceite de oliva, la canela, la pimienta de cayena, el comino, el ajo, la sal y la pimienta en un tazón.", "Haga pequeñas hendiduras en la parte inferior del pollo con la punta de un cuchillo. Pon el pollo en el adobo, volteando para cubrir. Cubra con una película adhesiva y colóquela en la nevera. Déjelo en el refrigerador por un par de horas o durante la noche. Asegurándose de llevarlo a temperatura ambiente antes de cocinar.", "Para hacer el deleite, ponga el ajo y la sal del mar en un almirez y mortero y golpee hasta que se triture. Agregue los chiles, el cilantro, la menta y las aceitunas y golpee todo junto. Poco a poco agregue el aceite de oliva virgen extra y el vinagre balsámico hasta que tenga una pasta áspera (debe ser gruesa, no puré). Agregue el jugo de limón al gusto y reserve.", "Para hacer los panes planos, ponga la harina en un tazón mediano, agregue la sal y revuelva. Agregue suficiente agua hasta que la mezcla de harina se convierta en una masa. Amase hasta que quede suave y divídalo en 4 pedazos. Haga rodar cada pieza en un círculo y coloque una sartén caliente de a una por vez. Voltee el pan una vez que hayan aparecido las marcas carbonizadas y cepille con el ghee derretido.", "Para la ensalada verde, ponga el pepino y las hojas en un tazón grande. Vierta el aceite de oliva y el vinagre de vino blanco en un tazón pequeño y bata la mostaza. Justo antes de servir, vierta el aderezo sobre la ensalada y mezcle.", "Para cocinar el pollo, caliente una sartén de plancha. Retire el pollo del adobo, sacudiendo el exceso. Cocine el pollo a fuego medio durante aproximadamente 2 minutos por cada lado. Reduzca el fuego a bajo y cocine por otros 4 minutos o hasta que esté cocido.", "Ponga el pollo en un plato y sirva con los panes planos, salsa picante, ensalada verde, rodajas de limón y un tazón de yogur griego."], "url": "www_bbc_co_uk_food_recipes_turkish_spiced_chicken_12732", "title": "Pollo con especias turco con panes planos y salsa verde", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkish_spiced_chicken_12732_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cordero picado 900g / 2lb", "2 cebollas, finamente ralladas", "6 dientes de ajo, aplastados", "2 cucharaditas de copos de chile seco", "1 pequeño manojo de perejil de hojaldre, picado", "aceite para cepillar", "2 tomates madurados en la vid, en rodajas finas", "sal", "pimienta negra recién molida", "200 g / 7 oz de yogur natural griego", "2 cucharadas de menta picada", "2 zanahorias grandes, peladas y cortadas a la mitad", "2 colinabo, pelado", "2 cucharadas de aceite de girasol", "4 cucharaditas de semillas de comino", "4 cucharaditas de jugo de limón"], "method": ["Precaliente una barbacoa de carbón 40 minutos antes de cocinar o una barbacoa de gas 10 minutos antes de cocinar. Si utiliza un molde de plancha de hierro fundido, caliéntelo a fuego alto y luego baje ligeramente el calor antes de cocinar.", "Cubra ocho pinchos de bambú con agua fría y déjelos en remojo.", "Ponga el cordero picado en un bol con las cebollas, el ajo, los copos de chile, el perejil, una cucharadita de sal y un poco de pimienta negra molida. Mezcle con sus manos hasta que se unan.", "Divida la mezcla en ocho y moldee en forma de salchicha alrededor de los pinchos de bambú escurridos.", "Para el yogur acuñado, mezcle el yogur con la menta, media cucharadita de sal y un poco de pimienta y reserve.", "Para la ensalada, triture finamente las zanahorias y el colinabo, en una mandolina o en la configuración de ensalada de col de su procesador de alimentos para obtener unas tiras largas, finas y crujientes.", "Ponlos en un bol con una pizca de sal y mezcla bien.", "Caliente el aceite de girasol en una olla pequeña, agregue las semillas de comino y, en cuanto empiecen a chisporrotear, agréguelos a las verduras con el jugo de limón y mezcle.", "Cepille generosamente el kofta con aceite y engrase ligeramente los barrotes de la barbacoa o la plancha. Cocine por cinco minutos, volteándolo ocasionalmente, hasta que se dore por todos lados y se cocine completamente.", "Extienda el yogur acuñado sobre uno o cuatro platos de servir individuales. Coloque el kofta en la parte superior, garnsih con los tomates en rodajas y sirva con la ensalada."], "url": "www_bbc_co_uk_food_recipes_turkishkoftakebabswi_71862", "title": "Brochetas de kofta turco con yogur acuñado y ensalada de colinabo y zanahoria", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkishkoftakebabswi_71862_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 coliflor mediana, limpiada, dejada entera, hojas reservadas para freír", "5 g de raíz de cúrcuma fresca", "25 g / 1 oz de dientes de ajo tostados, pieles eliminadas (ver consejo)", "50ml / 2fl oz de aceite de colza", "100 ml / 3½ fl oz de crema de soja", "100ml / 3½ fl oz crema doble", "85g / 3oz Stilton", "400ml / 14fl oz de agua con gas helada", "Harina normal de 100 g / 3½ oz", "100 g / 3½ oz de harina de maíz", "½ cucharada de vinagre de sidra", "sal", "2 rebanadas de masa fermentada tostada", "100 g / 3½ oz de nueces"], "method": ["Precaliente el horno a 140C / 120C Fan / Gas 1.", "Para la coliflor de cúrcuma, cocine a vapor toda la coliflor durante aproximadamente 8-10 minutos, o hasta que esté tierna en el medio. Escurrir y colocar en una bandeja para hornear.", "En un procesador de alimentos, pulse la raíz de cúrcuma, el ajo asado y el aceite de colza hasta que tenga una pasta áspera. Verter sobre la coliflor al vapor, sazonar con sal y pimienta y asar la coliflor durante 25 minutos.", "Suavemente caliente tanto la soya como la crema doble en una cacerola. Desmenuce en Stilton y caliente hasta que se derrita.", "Retire la coliflor del horno, vierta la crema de queso, luego hornee durante 30 minutos o hasta que burbujee y se dore.", "Para las hojas de coliflor fritas, precaliente una freidora a 180 ° C (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Batir todos los ingredientes para formar una masa, sumergir en las hojas reservadas para cubrir. Baje a la freidora y fría hasta que estén crujientes y doradas. Coloque en un plato forrado con papel de cocina para drenar el exceso de aceite.", "Para la miga de nuez de masa fermentada, en un procesador de alimentos, pulse las nueces y la masa madre para formar migas.", "Para servir, coloque la coliflor en un plato o plato y decore con las hojas fritas y las migas. Servir en rebanadas"], "url": "www_bbc_co_uk_food_recipes_turmeric-roasted_76567", "title": "Coliflor asada con cúrcuma con crema de Stilton y hojas de coliflor fritas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["12 gambas crudas muy grandes, sin cáscara y sin venas", "250 g / 9 oz de yogur de estilo griego", "2 dientes de ajo, aplastados", "4cm / 1½ en pieza de jengibre fresco, pelado y finamente picado", "1 chile verde, finamente picado", "2 cucharaditas de cúrcuma molida", "½ cucharadita de cardamomo molido", "1 cucharadita de comino molido", "6 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "3 dientes", "1 ramita de canela", "8 hojas de curry", "200g / 7oz de arroz basmati", "300ml / 10fl oz de caldo de pollo", "½ limón, solo jugo", "3 cucharadas de hojas de cilantro, más o menos picadas", "4 huevos, ligeramente batidos", "hojas de cilantro, para adornar"], "method": ["Para las gambas, coloque todos los ingredientes, excepto las gambas, en un bol y mezcle bien para combinar. Agregue las gambas, mezcle suavemente y colóquelas en el refrigerador para marinar durante al menos cuatro horas.", "Para la pila de omelette, caliente una cacerola hasta que esté caliente, agregue la mitad del aceite, la cebolla, el ajo y las especias, y fría por dos minutos.", "Agregue el arroz y agregue el caldo de pollo. Llevar a ebullición, cubrir y reducir a fuego lento a fuego lento. Cocine durante 18-20 minutos hasta que el arroz esté tierno y todo el líquido se absorba. Sazone con sal, pimienta negra recién molida y el jugo de limón, luego agregue las hojas de cilantro y déjelas a un lado hasta que se enfríen lo suficiente como para manipularlas.", "Caliente una sartén grande hasta que esté humeante, agregue la mitad del aceite restante y la mitad de los huevos batidos y revuelva alrededor de la sartén hasta que los huevos estén recién cocinados.", "Esparce la mitad del arroz pilaf sobre la tortilla y luego deslízate de la sartén sobre una tabla de cortar. Enrolle la tortilla en un molinillo y déjela a un lado.", "Repita con el aceite restante, los huevos y el arroz.", "Mientras tanto, retire las gambas del refrigerador, vuelva a la temperatura ambiente y luego ensarte en los pinchos de madera.", "Caliente una sartén o una barbacoa interior hasta que esté muy caliente, agregue las gambas y cocine por 1-2 minutos por cada lado o hasta que estén recién cocidas.", "Retire los pinchos de la sartén y descanse por un par de minutos.", "Para servir, coloque los pinchos de gambas en platos para servir. Cortar el molinillo de tortilla en rodajas gruesas y colocar junto a las gambas. Adorne con una ramita de cilantro y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_turmeric-spiced_prawns_47504", "title": "Gambas especiadas con cúrcuma y pila de omelette", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz de patatas cerosas", "1.5L / 2½pt aceite de maíz o aceite vegetal sin sabor", "1 cabeza de ajo, dientes separados pero no pelados", "8 ramitas de tomillo, romero o salvia, o hierbas de su elección", "copos de sal marina, al gusto"], "method": ["Corta los extremos cortos de cada patata (pero no la peles) para que se pueda sentar verticalmente, y luego córtala hacia abajo en generosas rebanadas de 1cm / ½. Corta estas rebanadas en trozos de aproximadamente 1 cm de grosor, una vez más, se equivoca en el lado generoso. Cargue una toalla de té limpia con las virutas mientras las corta.", "Coloque el aceite en una bandeja ancha de base pesada (la mía tiene aproximadamente 28 cm de diámetro y 11 cm de profundidad) y agregue las papas recién cortadas. Luego ponga la sartén a fuego alto y hiérvala, lo que debería demorar unos cinco minutos. Mantenga una vigilancia cuidadosa sobre la bandeja en todo momento.", "Continúe cocinando las papas fritas, sin removerlas, por otros 15 minutos. Una vez que la temperatura del aceite alcance 160C / 325F, baje el fuego ligeramente y mantenga las papas fritas a una temperatura de entre 150-160C. La sartén burbujeará vigorosamente. Si el aceite se calienta demasiado o las burbujas se vuelven demasiado duras, reduzca un poco el calor y manténgalo siempre atento.", "Ahora puede muy cuidadosamente darle a las papas un suave revuelo con un par de tenazas sostenidas en un guante de horno, moviendo cualquiera que se haya pegado al fondo oa los lados de la sartén. Agregue los dientes de ajo sin pelar a la sartén, revuelva suavemente, y cocine por otros 5-10 minutos (mirando la temperatura y asegurándose de que el ajo no se vea quemado o las papas fritas demasiado oscuras), antes de probar un chip para que quede crocante. el exterior y la ternura en el interior. ¡No te quemes la boca, sin embargo! Es posible que necesite otros cinco minutos más o menos, pero quédese junto a su sartén, las virutas pueden pasar de un oro cocido a un bronce quemado rápidamente.", "En el momento en que las astillas son de oro pálido, pero crujiente, mezcle las hierbas, luego de un minuto más o menos saque todo, usando un par de palas perforadas y usando guantes del horno para proteger sus manos, en una bandeja o plato forrado con un doble espesor de rollo de cocina. Una vez que se ha absorbido el exceso de aceite, incline las virutas del papel de cocina ruidosamente sobre el plato y espolvoree con hojuelas de sal marina al gusto, sirviendo inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tuscan_fries_61356", "title": "Papas fritas toscanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_fries_61356_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva, más 2 cucharaditas de llovizna", "1 cebolla roja, más o menos picada", "1 diente de ajo, aplastado", "227g de tomates cortados en lata", "400 g de alubias de estaño, escurridas y enjuagadas", "1 ramita de romero fresco", "2 x 75 g / 2¾oz (o 4 x 37.5g / 1¼oz) de rebanadas de pan de masa fermentada", "¼ diente de ajo", "sal y pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén a fuego medio-bajo. Agregue la cebolla roja y el ajo y fría por 5 minutos, o hasta que comience a ablandarse.", "Agregue los tomates, los frijoles y el romero. Sazonar con abundante pimienta y una pizca de sal. Calienta durante 5 minutos, revolviendo ocasionalmente.", "Tueste la masa madre en ambos lados. Rocíe una cucharadita de aceite sobre cada pieza y frote la tostada con el ajo. Sirva los frijoles en la masa fermentada."], "url": "www_bbc_co_uk_food_recipes_tuscan_beans_on_99053", "title": "Frijoles toscanos en pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_beans_on_99053_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50ml / 2fl oz de aceite de oliva virgen extra", "Tocino rayado ahumado de 300 g / 10 ½ onzas, más o menos picado", "2 cucharadas de vinagre de jerez", "2 cebollas rojas, más o menos picadas", "2 zanahorias, aproximadamente picadas", "2 dientes de ajo, finamente picados", "2 tallos de apio, más o menos picados", "1 puerro grande, más o menos picado", "2 papas cerosas grandes, toscamente picadas", "6 tomates de vid, toscamente picados (reserva las vides)", "pequeño racimo de romero fresco y tomillo, atado con una cuerda", "130g / 4¾oz de pasta orecchiette pequeña", "2 litros / 3½ pintas de caldo de buey de buena calidad", "1 x 400 g de frijoles cannellini de lata, escurridos y enjuagados", "16 florecillas pequeñas de brócoli brotación púrpura", "100 g / 3½ oz de espinaca de hoja de bebé", "sal y pimienta negra recién molida", "15g / ½ oz de albahaca fresca, picada", "15g / ½ oz de ajo silvestre, aproximadamente picado", "50g / 1¾oz de piñones", "3 cucharadas de aceite de oliva", "15g / ½ oz de queso parmesano, finamente rallado", "½ limón, ralladura solamente, finamente rallado", "1 cucharadita de jugo de limón, al gusto", "sal y pimienta negra recién molida", "puñado de albahaca fresca, picada", "pequeño puñado de perejil fresco de flatleaf, toscamente picado", "pequeño puñado de cebollín fresco, cortado", "100 g / 3½ oz de queso parmesano, finamente rallado", "aceite de oliva, para lloviznar", "1 pan crujiente de pan, para servir"], "method": ["Para la sopa, caliente el aceite en una cacerola de base pesada a fuego alto. Agregue el tocino, luego sazone y fría durante 3-4 minutos, hasta que se caramelice pero no se queme. De glasear la sartén con el vinagre de Jerez. Agregue las cebollas rojas, las zanahorias, el ajo, el apio y el puerro y cocínelos durante 8-10 minutos, o hasta que se ablanden.", "Agregue las papas y los tomates, con sus vides, luego agregue el romero y el paquete de tomillo. Aplaste los tomates con una cuchara de madera. Llevar la sartén a fuego lento.", "Caliente el caldo de carne en una cacerola a fuego alto. Agregue la pasta a las verduras. Una vez que el caldo esté hirviendo a fuego lento, viértalo también.", "Vierta la sopa en la olla a presión (PRECAUCIÓN: siga las instrucciones del fabricante para el uso seguro de su olla a presión). Poner a presión y cocinar durante 5 minutos a presión. Apague el fuego y lentamente suelte la presión. Retire el romero, el tomillo y las vides de tomate y deséchelos. Agregue los frijoles cannellini, el brócoli y la espinaca y deje que se ablanden con el calor residual durante 5 minutos.", "Mientras tanto, para hacer el pesto, moler la albahaca y el ajo silvestre en un mortero con un mortero o procesador de alimentos para liberar los aceites naturales. Luego, agregue los piñones y la ralladura de limón y muela. Una vez combinado, agregue el aceite de oliva para hacer una pasta y moler en el queso parmesano. Agregue un chorrito de limón y sazone al gusto.", "Para servir, vierta en tazones de sopa y espolvoree sobre las hierbas frescas, el parmesano, el pesto de ajo silvestre y el aceite de oliva. Sirve con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_tuscan_peasant_pot_soup_52268", "title": "Tocino toscano y sopa de frijoles con pesto de ajo silvestre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_peasant_pot_soup_52268_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600 g / 1 libra de frijoles cannellini secos de 5oz", "300g / 10½oz de judías borlotti secas", "100g / 3½oz de grasa cortada de un jamón o jamón o hueso de jamón serrano", "sal y pimienta negra recién molida", "1 litro / 1¾ pintas de verduras o caldo de carne", "aceite de oliva virgen extra, para lloviznar", "8 cucharadas de aceite de oliva virgen extra", "4 palitos de apio, finamente picados", "2 zanahorias, finamente picadas", "1 cebolla mediana, finamente picada", "2 dientes de ajo, aplastados", "1 ramita de romero", "4 hojas de laurel", "sal y pimienta negra recién molida"], "method": ["Remoje los frijoles durante la noche en agua fría, usando un recipiente separado para cada tipo de frijol.", "Enjuague y escurra los frijoles, luego hiérvalos en recipientes separados; los frijoles borlotti durante aproximadamente una hora, los frijoles cannellini durante 45 minutos. Escurrir y apartar.", "Mientras tanto, cocina el soffritto. Caliente el aceite de oliva en una olla y fríe con cuidado el apio, la zanahoria, la cebolla, el ajo, el romero y las hojas de laurel hasta que estén dorados, aproximadamente 15 minutos.", "Retire la ramita de romero y las hojas de laurel y sazone con sal y pimienta negra recién molida.", "Agregue la grasa o el hueso de jamón y los frijoles cannellini al sofrito. Sazonar con sal y pimienta negra recién molida, y cocinar por otros 10 minutos.", "Agregue el caldo y lleve a ebullición, luego cocine a fuego lento durante 25 minutos o hasta que los frijoles estén tiernos.", "Retire los trozos de grasa o hueso de jamón. Agregue los frijoles Borlotti. Sazonar con más sal y pimienta negra recién molida al gusto. Sirva rociado con aceite de oliva virgen extra."], "url": "www_bbc_co_uk_food_recipes_tuscanbeansoup_82379", "title": "Sopa de frijoles toscanos", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["gran puñado de hojas frescas de albahaca", "1 diente de ajo", "125g / 4½oz de piñones", "aceite de oliva virgen extra", "125g / 4½oz de queso de oveja duro, recién rallado"], "method": ["Pon la albahaca, el ajo y los piñones en un almirez y mortero y aplasta hasta que se reduzca a una pasta.", "Agregue suficiente aceite de oliva para darle la consistencia que desee y mezcle el queso Pecorino.", "Transfiera a un plato limpio y utilícelo inmediatamente o coloque un recipiente hermético. Cubra con una capa de aceite de oliva, coloque en el refrigerador (hasta por un mes) hasta que esté listo para usar."], "url": "www_bbc_co_uk_food_recipes_tuscanpesto_82385", "title": "Pesto toscano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo", "1.5 litros / 52¾fl oz de vino blanco", "250ml / 8¾fl oz de vinagre de sidra", "1.5 litros / 52¾fl oz de agua", "4 cucharadas de sultanas", "2 cucharadas de granos de pino", "1 limón, ralladura solamente, cortado en tiras", "1 cucharadita de sal", "½ litro / 17½ fl oz de aceite de oliva", "10 cucharadas de vinagre balsámico", "4 ramas de romero, más o menos picadas", "5 dientes de ajo, picados", "1 chile rojo, más o menos picado", "ensalada verde"], "method": ["Para hacer el adobo, coloque todos los ingredientes del adobo en un tazón grande y déjelos a un lado.", "Coloque los ingredientes restantes en una olla grande y deje que hierva.", "Reduzca y hierva a fuego lento por 15 minutos.", "Una vez hervidos a fuego lento, retire las pechugas de pollo, la ralladura de limón, las pasas sultanas y los granos de pino y, mientras aún esté caliente, agréguelos al adobo.", "Deja en el refrigerador para marinar durante 12 horas, luego retira las pechugas de pollo, el limón, las pasas sultanas y los granos de pino.", "Cortar el pollo y servir con una ensalada verde arrojada que se ha adornado con el limón, pasas y piñones."], "url": "www_bbc_co_uk_food_recipes_tuscanstylemarinated_73191", "title": "Pechugas de pollo marinadas de estilo toscano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva virgen extra", "4 palitos de apio, finamente picados", "2 zanahorias, finamente picadas", "1 cebolla mediana, finamente picada", "2 dientes de ajo, aplastados", "1 ramita de romero", "4 hojas de laurel", "sal y pimienta negra recién molida", "200 g / 7 oz de zanahorias, picadas", "200g / 7oz de apio, picado", "200g / 7oz de patatas picadas", "200g / 7oz de calabacines, picados", "trozo de corteza de jamón (opcional)", "1,5 litros / 2¼ pintas de caldo (el caldo de verduras o pollo está bien)", "2 tomates, pelados y picados, con el jugo y las semillas exprimidos"], "method": ["Para sofrritto, caliente el aceite de oliva en una olla grande y fríe con cuidado el apio, la zanahoria, la cebolla, el ajo, el romero y las hojas de laurel hasta que estén dorados, aproximadamente 15 minutos.", "Retire la ramita de romero y las hojas de laurel y sazone con sal y pimienta negra recién molida.", "Para hacer la sopa, agregue las zanahorias, el apio, las papas y los calabacines y cocine a fuego lento durante 10-15 minutos, revolviendo continuamente pero con cuidado. Agregue la corteza de jamón en esta etapa si la está incluyendo (recuerde quitarla antes de servir la sopa). Sazonar con sal y pimienta negra recién molida al gusto.", "Agregue el caldo y cocine a fuego lento durante otros 20-30 minutos. Agregue los tomates y continúe cocinando por otros 10 minutos. Servir."], "url": "www_bbc_co_uk_food_recipes_tuscanvegetablesoup_82390", "title": "Sopa de verduras de la Toscana", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla pequeña", "8 dientes", "1 hoja de laurel", "8 granos de pimienta", "300 ml / 10 fl oz de leche", "40 g / 1½ oz de mantequilla, más extra para engrasar", "Harina normal de 40 g / 1½ oz", "50g / 1¾oz Stilton, desmenuzado", "Queso cheddar de 75 g / 2½ oz, finamente rallado", "3 huevos de gallinas camperas, separados", "rallado de nuez moscada fresca", "1 cucharadita de hojas frescas de tomillo", "Mitades de nuez de 30g / 1oz, más o menos picadas", "120ml / 4fl oz de crema doble"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Ligeramente lave ocho platos de ramekin y forre las bases con un círculo de papel para hornear.", "Pele la cebolla, dejando la base intacta. Presione los dientes en la cebolla, luego póngalo en una olla pequeña de fondo grueso. Agregue la hoja de laurel y los granos de pimienta, luego vierta la leche. Caliente suavemente hasta que hierva, luego retírelo del fuego y déjelo reposar durante al menos 10 minutos. Cuele los aromatizantes de la leche y deséchelos.", "Derrita la mantequilla en una sartén de fondo grueso a fuego medio. Agregue la harina y continúe cocinando, revolviendo todo el tiempo, durante 1-2 minutos. Vierta lentamente la leche tibia y bata bien con un batidor hasta que hierva a fuego lento y tenga una salsa espesa.", "Revuelva en el Stilton y agregue 50 g / 1¾oz del queso cheddar rallado, luego continúe revolviendo sobre el fuego hasta que tenga una salsa suave. Retirar del fuego y batir en las yemas de huevo, nuez moscada y tomillo. Agregue las nueces.", "En un recipiente de vidrio limpio, bata las claras de huevo hasta que se formen picos fuertes. Dobla una cucharada de los blancos batidos en la mezcla de soufflé. Agregue el resto de los blancos y doble bien.", "Coloque la mezcla en los moldes preparados justo debajo de la parte superior. Hornee durante 15-20 minutos, o hasta que se haya levantado y cocinado. Deje que se enfríe, luego pase un cuchillo por los lados para aflojarlos. Alinee una bandeja para hornear con papel de hornear. Apague los soufflés en la bandeja para hornear preparada, para que estén boca abajo. Si está refrigerando y comiendo al día siguiente, cúbralo con una película adhesiva.", "Para terminar los soufflés, precaliente el horno a 200C / 180C Fan / Gas 6. Espolvoree el queso restante sobre los soufflés y ponga una cucharada de crema doble sobre cada uno. Hornee durante 10 minutos o hasta que estén dorados. Servir."], "url": "www_bbc_co_uk_food_recipes_twice-baked_blue_cheese_40326", "title": "Soufflés de queso azul y nuez dos veces horneados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 8 suflés", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 filetes de rib eye de 4 x 175g / 6oz (idealmente todo cortado del mismo pedazo de rib-eye por su carnicero)", "1 x botella de 750 ml de vino tinto", "1 ramita de tomillo fresco", "2 cucharadas de aceite de colza", "2 zanahorias, finamente picadas", "2 palitos de apio, finamente picados", "1 cebolla grande, finamente picada", "3 dientes de ajo picados", "6 tomates maduros, picados", "1 cucharada de salsa Worcestershire", "1 litro / 1¾ pintas de caldo de pollo", "2 cucharadas de rábano picante a la crema", "50g / 1¾oz de mantequilla", "2 cucharadas de perejil fresco picado", "aceite vegetal, para freír en grasa", "Harina normal de 100 g / 3½ oz", "1 cucharadita de pimentón ahumado", "150ml / ¼ de pinta de leche entera", "2 cebollas cortadas en rodajas de 0.5cm / ¼ de grosor", "500g / 1lb 2oz de papas nuevas, hervidas hasta que estén tiernas", "50g / 1¾oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["El día antes de servir los filetes, colóquelos en un tazón grande para mezclar, vierta sobre el vino y agregue el tomillo. Cubra el tazón y enfríe en la nevera durante la noche.", "Cuando los filetes se hayan marinado, precaliente el horno a 160 C / 140 C Fan / Gas 3.", "Caliente el aceite en una cazuela a prueba de fuego a fuego medio. Agregue las zanahorias, el apio y la cebolla y fría por 6-8 minutos, o hasta que estén suaves y dorados.", "Agregue el ajo, los tomates picados y la salsa Worcestershire y revuelva bien para combinar.", "Coloque los filetes marinados en la parte superior de las verduras y sazone, al gusto, con sal y pimienta negra recién molida. Verter sobre el adobo y el caldo y llevar la mezcla a ebullición.", "Corta un círculo de papel resistente a la grasa ligeramente más pequeño que el diámetro de la cazuela. Colóquelo dentro de la cazuela para cubrir su contenido. Transfiera al horno por 1½-1¾ hora, hasta que la carne esté muy tierna, pero no se deshaga. Retire la carne de la cacerola, cubra y reserve para descansar. Mantener caliente", "Mientras tanto, toma un cucharón de salsa de la cazuela y vierte en un bol. Agregue el rábano picante a la crema hasta que esté bien combinado. Vuelva a colar la mezcla en la cazuela a través de un tamiz fino, descartando el contenido del tamiz.", "Cuele toda la cazuela a través de un colador fino, recogiendo el líquido filtrado en una olla limpia. Cocine a fuego lento hasta que se espese a la consistencia de la crema doble. Sazone con sal y pimienta, luego agregue la mantequilla y el perejil. Apartar y mantener caliente.", "Caliente el aceite en una freidora a 180 ° C / 350 ° F. Alternativamente, caliente el aceite en una cacerola profunda de base pesada hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "En un tazón grande, mezcle la harina y el pimentón ahumado hasta que estén bien combinados. Vierta la leche en un tazón.", "Espolvorea las rebanadas de cebolla con la harina sazonada, luego sumérgelas en la leche. Finalmente, enróllalos nuevamente en la harina sazonada para cubrir.", "Con cuidado, baje las rodajas de cebolla en el aceite caliente y fría por 1-2 minutos, o hasta que estén crujientes y doradas.", "Para servir, coloque uno de los filetes de costilla estofados en cada uno de los cuatro platos de servir. Cuchara sobre un poco de la salsa. Adorne con las cebollas fritas. Sirva las papas nuevas en un tazón grande, salpicado con la mantequilla."], "url": "www_bbc_co_uk_food_recipes_twice-cooked_braised_66810", "title": "Filetes de costilla de rábano picante cocidos dos veces cocidos con cebollas crujientes", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz vientre de cerdo graso, piel en", "2 cucharadas de aceite de cacahuete", "1 cucharada de vino de arroz Shaoxing (o jerez seco)", "1 cucharada de pasta de frijoles", "1 cucharada de salsa de frijol amarillo", "1 cucharada de frijoles negros fermentados, enjuagados y triturados", "1 cebolleta (o puerro), cortada en diagonal en tiras de juliana", "1 cucharadita de salsa de soja oscura", "1 cucharadita de salsa de soja ligera", "azúcar pizca", "sal marina y pimienta blanca recién molida", "1 diente de ajo, picado", "2 pizcas de azúcar en polvo", "1 cucharada de vinagre de arroz claro chino o vinagre de sidra", "1 cucharadita de pasta de frijol picante", "1 cucharadita de aceite de chile", "1 cucharada de aceite de sésamo tostado", "4 pepinos pequeños, cortados por la mitad a lo largo, sin semillas, cada mitad cortada en rodajas largas y luego cortada en trozos de 1cm / ½ en pedazos", "1 chile rojo fresco, sin semillas y cortado en tiras pequeñas", "300 g / 10½ oz de arroz jazmín, al vapor"], "method": ["Para el cerdo, vierta 700ml / 1¼ pintas de agua en una sartén grande, agregue el cerdo y deje que hierva. Hervir durante 30 minutos. Escurrir y dejar enfriar.", "Transfiera la carne a la nevera durante una hora, para reafirmarla.", "Mientras tanto, para el pepino en escabeche, combine el ajo, el azúcar, el vinagre, la pasta de frijoles, el aceite de ají y el aceite de sésamo en un tazón.", "Agregue los pepinos y deje que se marinen en la nevera durante 20 minutos.", "Retire los pepinos de la nevera y agregue el chile fresco.", "Retire la carne del refrigerador y corte en rodajas de 5 mm / ¼ en gruesas. Caliente un wok a fuego alto y agregue el aceite de cacahuete, luego el puerco. A medida que el cerdo comience a dorarse, agregue el vino de arroz (o jerez) y cocine hasta que el cerdo se dore y la piel esté ligeramente crujiente.", "Agregue la pasta de frijoles, la salsa de frijoles amarillos y los frijoles negros fermentados y saltee por un minuto.", "Agregue la cebolla tierna (o puerro) si está usando, y saltee por menos de un minuto hasta que esté bien mezclado.", "Agregue las salsas de soja y el azúcar, sazone y sirva.", "Para servir, coloca una cucharada de arroz en el plato, coloca la carne de cerdo sobre la parte superior y luego los pepinillos a un lado."], "url": "www_bbc_co_uk_food_recipes_twice_cooked_pork_with_11941", "title": "Dos veces cocido de cerdo con pepino encurtido", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]