[{"isVegetarian": true, "title": "Greek salad", "url": "www_bbc_co_uk_food_recipes_greeksalad_79831", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 handfuls fresh flatleaf parsley leaves, roughly chopped", "2 celery stalks, finely chopped", "3 tomatoes, deseeded and chopped", "100g/3½oz feta, cut into cubes", "2 tbsp tinned cannellini beans, rinsed and drained", "1 lemon, juice only", "1 tbsp olive oil", "2 tbsp black olives, pitted"], "serves": "Serves", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the ingredients into a large bowl. Toss together well and serve immediately."]}, {"isVegetarian": true, "title": "Greek apricots", "url": "www_bbc_co_uk_food_recipes_greekapricots_72397", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greekapricots_72397_16x9.jpg", "ingredients": ["250ml/8¾fl oz cold water", "50g/1¾oz caster sugar", "1 cinnamon stick", "small pinch saffron strands", "1 tbsp honey", "12 apricots, halved", "150g/5¼oz tub Greek yoghurt", "50g/1¾oz pistachios, crushed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the water, sugar, cinnamon stick, saffron and honey into a pan and heat until the sugar has dissolved. ", "Simmer gently for five minutes before adding the apricots. Simmer for a further five minutes. Remove from the heat and discard the cinnamon stick.", "Serve the apricots warm on a bed of yogurt, and drizzle over the syrup."]}, {"isVegetarian": true, "title": "Greek salad", "url": "www_bbc_co_uk_food_recipes_greeksalad_82142", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz feta, chopped", "75g/2½oz black olives, pits removed ", "3 tbsp chopped fresh parsley", "3 tbsp olive oil", "2 tsp white wine vinegar", "2 tsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together and serve."]}, {"isVegetarian": true, "title": "Greek salad on bruschetta", "url": "www_bbc_co_uk_food_recipes_greeksaladonbruschet_81321", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greeksaladonbruschet_81321_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 lemon, juice only", "150g/5½oz vine cherry tomatoes, halved", "½ shallot, peeled and finely sliced", "50g/2oz olives, pits removed", "50g/2oz feta cheese, crumbled", "salt and freshly ground black pepper", "4-6 slices ciabatta, depending on size of loaf ", "2 tbsp olive oil", "salt and freshly ground black pepper"], "serves": "Makes 4-6 medium-sized slices", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the Greek salad, whisk together the olive oil and lemon juice in a bowl.", "Add the cherry tomatoes, shallot, olives and feta cheese, then season with salt and freshly ground black pepper and toss together.", "To make the bruschetta, heat a griddle pan until smoking. Drizzle the ciabatta slices with the oil and season both sides with salt and freshly ground black pepper. Grill for one minute on each side.", "To serve, place the bruschetta slices in the centre of a plate and spoon the Greek salad on top."]}, {"isVegetarian": true, "title": "Greek salad with fried feta cheese", "url": "www_bbc_co_uk_food_recipes_greeksaladwithfriedf_83947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 roasted red pepper from a jar, sliced", "¼ cucumber, sliced", "1 clove garlic, thinly sliced", "handful chickpeas from a can, rinsed and drained", "1 tbsp olive oil", "handful olives, pitted", "½ lemon, juice only", "sea salt and freshly ground black pepper", "25g/1oz flour", "2 tsp sesame seeds", "1 free-range egg", "110g/4oz feta cheese, sliced into 2 pieces", "4 tbsp olive oil, to fry", "squeeze of lemon juice"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, mix together all of the ingredients, season to taste with salt and freshly ground black pepper and set aside.", "For the fried feta mix together the flour, sesame seeds and egg in a bowl. Dip the feta pieces into the mixture to coat. ", "Heat the oil in a deep frying pan and add the feta. Fry for two to three minutes, turning once, until golden on both sides. Remove and drain on kitchen paper.", "Place the fried feta on top of the salad with a squeeze of lemon juice and serve."]}, {"isVegetarian": false, "title": "Greek-style roast chicken", "url": "www_bbc_co_uk_food_recipes_greekstyleroastchick_92179", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 free-range egg whites, lightly beaten", "1 tbsp clear honey", "1 lemon, juice and zest", "2 tbsp cumin seeds", "½ tsp cayenne pepper", "½ tsp ground ginger", "½ tsp ground cinnamon", "½ tsp ground allspice", "salt and freshly ground black pepper", "1 x 1.3kg/3lb whole chicken", "125ml/4½fl oz olive oil", "500g/1lb 2oz salad potatoes such as Anya or Charlotte, parboiled until tender in chicken stock", "100g/3½oz black olives, pits removed, chopped", "salt and freshly ground black pepper", "1 lemon, zest only", "1 tbsp unsalted butter", "1 tbsp chopped fresh parsley", "lightly dressed mixed green salad", "Greek-style yoghurt"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "In a large bowl, whisk together the egg whites, honey, lemon juice and lemon zest until well combined. ", "In a separate bowl, mix together the cumin seeds, cayenne pepper, ginger, cinnamon, allspice, salt and pepper until well combined. Sprinkle the mixture onto a plate.", "Dip the chicken first in the egg mixture, then roll it in the spice mixture until completely coated. ", "Place the coated chicken onto a baking tray and roast in the oven for 1¼-1½ hours, or until the skin is crisp and golden-brown and the chicken is cooked through. (NB: The chicken is cooked through when the juices run clear when a skewer is inserted into the thickest part). ", "Meanwhile, for the potatoes, heat the oil in a roasting tray in the oven until smoking. Add the parboiled potatoes and the chopped olives and season, to taste, with salt and freshly ground black pepper. Return to the oven and roast for 35-40 minutes, or until the potatoes are crisp and golden-brown and cooked through.", "Transfer the cooked potatoes and olives to a bowl, then stir in the lemon zest, butter and parsley until they coat the potatoes and olives.", "To serve, carve the chicken and divide the meat equally among four serving plates. Spoon the potatoes and olives alongside. Serve with the green salad and Greek-style yoghurt."]}, {"isVegetarian": true, "title": "Greek-style salad", "url": "www_bbc_co_uk_food_recipes_greekstylesalad_85405", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz feta, crumbled", "1 beef tomato, diced", "2 tbsp raisins", "handful fresh parsley, leaves only", "handful fresh mint, leaves only", "handful fresh basil, leaves only", "handful fresh chives, chopped", "2 tsp olive oil", "1 tsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the feta, tomato, raisins and herbs together in a small bowl and gently stir to combine.", "Whisk the olive oil with the red wine vinegar in a separate bowl and season, to taste, with salt and freshly ground black pepper.", "To serve, pour the dressing over the salad and stir to coat the salad well."]}, {"isVegetarian": false, "title": "Green gooseberry jelly cheesecake with red gooseberry compôte", "url": "www_bbc_co_uk_food_recipes_green_gooseberry_jelly_79010", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz rye flour ", "100g/3½oz wholemeal flour ", "80g/3oz unsalted butter ", "2g bicarbonate of soda ", "40g/1½oz caster sugar ", "3g salt ", "95g/3¼oz jumbo oats ", "1 free-range egg, beaten ", "300g/10½oz cream cheese ", "130g/4¾oz crème fraîche ", "1 tbsp vanilla purée or good-quality vanilla extract ", "¼ lemon, juice only, plus an extra drop for the egg whites ", "2 gelatine leaves", "100g/3½oz caster sugar ", "4 medium egg whites ", "200g/7oz green gooseberries (such as Invicta), washed, stalks removed and cut in half ", "10g caster sugar ", "2¼ gelatine leaves, softened in water then drained ", "about 10–12 firm green gooseberries, stalks removed", "500g/1lb 2oz red gooseberries (such as Hinnomaki), trimmed ", "50g/1¾oz caster sugar (optional)"], "serves": "Serves 10-16", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Have ready a 4cm/1½in deep, 20cm/8in pastry ring or cake tin. ", "For the oat biscuit base, in a large bowl combine the flours, butter, bicarbonate of soda, sugar and salt. Using your fingertips, rub the ingredients together until the mixture resembles breadcrumbs. Add the oats and egg and mix well. Knead until it comes together. ", "Using a rolling pin, roll the biscuit mixture out between two sheets of baking parchment to a thickness of 5mm/¼in. Lift onto a baking tray and remove the top piece of paper. Bake in the oven for 15 minutes. ", "Remove from the oven and leave to rest for 2 minutes. Using the 20cm/8in pastry ring or cake tin, press down into the biscuit, cutting through the bottom. Leave to cool completely before using for the cheesecake. Remove the excess biscuit from around the ring; this can be crumbled on top of the finished cheesecake, if wished. ", "For the filling, in a large bowl mix the cream cheese, crème fraîche, vanilla purée or extract and lemon juice together. ", "Place the gelatine in a small saucepan with 2 teaspoons water and heat gently until the gelatine is dissolved. Once slightly cool, briskly whisk into the cream mixture. In a small saucepan dissolve the sugar in 5 teaspoons water. Bring to a boil and continue to heat to 121C on a sugar thermometer. (CAUTION: boiling sugar is very hot. Take care not to burn yourself.)", "Meanwhile, in a food mixer fitted with the whisk attachment or using an electric hand whisk and a bowl, whisk the egg whites, adding just a single drop of lemon juice at the beginning. Whisk until soft peaks form when the whisk is removed. ", "Turn the whisk to a medium speed and prepare to add the hot sugar syrup. The best technique for making this kind of Italian meringue is to pour the hot sugar syrup down the side of the bowl in a single thread so that it mixes beautifully. Otherwise the speed of the whisk will spin the sugar and solidify it over the whisk and bowl. Continue to whisk on a medium speed for a further 5 minutes until the mixture is glossy – the hot syrup will partially cook the egg white making it stable. ", "Rest the base of the bowl of meringue in a bowl of ice-cold water and continue to whisk by hand until the mixture is completely cool. When cool, add half the egg whites to the cream filling mixture and briskly beat with a whisk until smooth, then add the remaining egg whites and fold together. ", "Place the pastry ring or cake tin with the biscuit base inside on a baking tray or plate. Pour the filling into the ring, leaving a gap of 5mm/¼in from the top of the ring and level the surface flat using a palette knife or the back of a spoon. Refrigerate for 2 hours to allow the mixture to firm up. ", "When the cheesecake has chilled for 1½ hours, make the gooseberry jelly. Put the gooseberries in a bowl and macerate with the sugar for 15 minutes. Transfer to a small saucepan over a medium heat and simmer for 10 minutes, covered with a lid. Pour into a blender, with the softened gelatine and 50g/1¾oz water and blend on full speed for a minute. To make sure the purée is smooth, pass it through a fine sieve into a bowl, forcing it through using the back of a ladle. Rest the base of the bowl over a bowl of ice-cold water to cool, stirring all the time. Once the mixture starts to thicken, spoon it over the chilled cheesecake. ", "For the topping, top and tail the gooseberries and cut each one crossways into slices 2mm thick. Arrange 16 slices of gooseberries around the edge of the cheesecake on top of the jelly. Chill the cheesecake overnight or until set completely. ", "For the compôte, cut the gooseberries in half. Taste one – if sweet enough, there is no need to macerate them, if they are a little sour, put in a mixing bowl with the sugar and leave to macerate for 15 minutes. ", "Transfer to a saucepan on a medium heat and cook for 10 minutes with a lid on, stewing them at a gentle bubble; stir from time to time to prevent the compôte catching on the bottom of the pan. Remove from the heat and allow to cool completely, taste and adjust with a splash of water if it’s too acidic or a little sugar, if needed. ", "Serve the cheesecake with the compôte alongside for your guests to help themselves. "]}, {"isVegetarian": true, "title": "Green parcel pie", "url": "www_bbc_co_uk_food_recipes_green_parcel_pie_17626", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 egg ", "100g/4oz soft cream cheese with chives ", "1 tablespoon ready-grated parmesan, or similar vegetarian hard cheese ", "black pepper", "60g/2oz courgette, grated ", "50ml/2fl oz rapeseed oil ", "3 sheets filo pastry ", "pinch of pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 200C/400F/Gas 6.", "Start by making the pie filling. Break an egg into a bowl then beat with afork. Then add the cream cheese and mix into the egg until well combined.   Add the parmesan and some black pepper. Stir well, then add the grated courgette and give the mixture another good stir.", "Brush the inside of a small (500g) loaf tin with the oil and line with a sheet of filo pastry with the extra falling over the outside of the tin. ", "Brush with more oil, then lay another sheet on top creating extra overlap on the side. Brush that layer with oil, then add the third sheet on top. ", "Pour your eggy filling into the pie then fold the extra pastry over the top, a layer at a time, hiding the filling. Dot the pastry with oil as you build the layers. Finally dab the top of filo pastry with more oil.", "Ask a grown-up to put it in the oven for 20-25 minutes or until the filo topping is golden-brown and crisp."]}, {"isVegetarian": false, "title": "Green spatchcocked chicken", "url": "www_bbc_co_uk_food_recipes_green_spatchcocked_72293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large bunch fresh coriander, roughly chopped", "large bunch fresh mint, leaves only", "large bunch fresh basil, leaves only", "6 garlic cloves, roughly chopped", "5cm/2in piece fresh root ginger, peeled and roughly chopped", "4 green chillies, roughly chopped", "200g/7oz Greek-style yoghurt", "5 limes", "1 whole chicken, spatchcocked", "2 tbsp dark soy sauce", "2 tbsp fish sauce", "1 tbsp toasted sesame oil", "1 tbsp honey", "1 hispi cabbage, leaves only, finely sliced", "1 red onion, finely sliced", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to its highest setting, or at least 240C/220C Fan/Gas 8.", "Blend two-thirds of the coriander, mint and basil leaves in a food processor. Add 5 of the garlic cloves, all of the ginger, and 3 of the chillies and blend to a fine paste. Add the yoghurt and blend again. Add the zest and juice of 3 of the limes and blend until smooth. Set this marinade aside.", "Season the spatchcocked chicken really well on both sides with salt and freshly ground black pepper. Lay it in a roasting tray, skin side up. Rub the marinade all over the chicken using your hands. If you have time, cover and place in the fridge to marinate for 1 hour; otherwise cook straight away.", "Roast the chicken in the oven for 40-45 minutes, or until cooked through. (The chicken is cooked through when the juices run clear when the chicken is pierced in the thickest part of the thigh with a sharp knife and no trace of pink remains.) ", "Meanwhile, grind the remaining coriander, mint and basil to a paste using a pestle and mortar. Season with a large pinch of salt. Add the remaining chilli and garlic and grind again to a smooth paste. Stir in the soy and fish sauces, sesame oil and honey until well combined. Add the zest and juice of the remaining 2 limes and grind once more.", "Mix the cabbage and onion in a bowl, drizzle over the dressing and toss to coat. Tip the salad onto a serving platter. Carve the cooked chicken into chunks and arrange them on top of the salad to serve."]}, {"isVegetarian": false, "title": "Green tea panna cotta with cardamom tuile biscuits", "url": "www_bbc_co_uk_food_recipes_green_tea_panna_cotta_14475", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/green_tea_panna_cotta_14475_16x9.jpg", "ingredients": ["sunflower oil, for greasing", "3 sheets leaf gelatine", "150ml/5fl oz full-fat milk", "600ml/1 pint single cream", "150g/5fl oz caster sugar", "1 large cinnamon stick ", "7 green tea teabags", "1 English breakfast teabag", "12 cardamom pods, seeds only", "115g/4oz unsalted butter, softened", "115g/4oz icing sugar", "115g/4oz plain flour", "3 large free-range egg whites, lightly whisked", "1 tsp vanilla extract", "½ tsp cardamom pods, seeds only"], "serves": "Serves 6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the green-tea panna cotta, lightly grease six 150ml/5fl oz ramekin dishes or dariole moulds with sunflower oil.", "Soak the leaf gelatine in a bowl of cold water for 10 minutes.", "Pour the milk and cream into a saucepan and add the sugar, cinnamon stick, teabags and cardamom seeds. Heat over a very low heat, gradually bringing the milk to the boil and stirring gently until all of the sugar has dissolved. Remove the pan from the heat.", "Squeeze any excess water from the softened gelatine leaves and stir into the warm milk until dissolved. Strain the mixture through a sieve lined with muslin into a heatproof jug, then pour the mixture into the prepared dariole moulds or ramekins. Set aside to cool completely, then chill in the fridge for at least four hours, but preferably overnight, until set.", "For the tuile biscuits, beat the butter and icing sugar together in a mixing bowl until pale, fluffy and smooth. Carefully fold in the flour, followed by the whisked eggs whites and vanilla extract. Cover the bowl with cling film and chill in the fridge for one hour.", "While the tuile biscuit mixture is resting, line a baking tray with silicone paper. Take a sturdy piece of plastic, such as the clean lid of an ice cream carton and cut four 5cm/2in holes from it, leaving a 2.5cm/1in space between each hole and discarding the circles you cut out (the ice cream lid will be your template).", "When the tuile biscuit mixture has rested, preheat the oven to 180C/350F/Gas 4. ", "Lay the template over the silicone paper. Using a palette knife, spread a little of the mixture into the holes to create four thin, even, flat discs. Remove the template carefully and sprinkle the biscuits with cardamom seeds.", "Bake the tuile biscuits in the oven for 5-10 minutes, or until crisp and golden-brown at the edges. Remove from the oven and, while still warm, wrap the exposed face of each biscuit over a rolling pin (or other curved surface, such as a mug), carefully peel away the silicone paper, and set aside to cool.", "Repeat the cooking and shaping process with the remaining tuile biscuit mixture. You should end up with elegantly curled biscuits.", "When the panna cotta is ready to serve, dip the moulds quickly into boiling water and turn the panna cotta out onto serving plates. Serve with the tuile biscuits."]}, {"isVegetarian": false, "title": "Green pasta ravioli with burrata mozzarella", "url": "www_bbc_co_uk_food_recipes_green_pasta_ravioli_with_90869", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz Italian ‘00’ flour ", "2 free-range eggs", "pinch salt", "75g/2½oz well-drained, puréed cooked spinach ", "600g/1lb 5oz burrata mozzarella cheese", "50g/1¾oz parmesan, freshly grated ", "60g/2¼oz unsalted butter", "20g/¾oz pine nuts, toasted", "1 tbsp fresh rosemary leaves", "80g/3oz parmesan, freshly grated"], "serves": "Serves 4-6 (makes 12 large ravioli)", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["To make the pasta, sift the flour onto a work surface, forming a volcano-shaped mound with a well in the centre. Break the eggs into the well and add the salt and spinach. Incorporate the eggs and spinach into the flour with a fork and your hands, gradually drawing the flour into the egg mixture until it forms a coarse paste.", "Add a little more flour if the mixture is too soft or sticky, or a little water if the mixture is too dry. Using a knife (or a spatula), scrape up any stray pieces of dough. ", "Before kneading the dough, clean your hands and the work surface. Lightly flour the work surface, and start to knead the dough with the heel of one hand as you might break the dough. Work the dough for 10-15 minutes until the consistency is smooth and elastic. If the dough sticks to your fingers, rub your hands with some flour. Wrap the dough in cling film or aluminium foil and leave it to rest for at least half an hour.", "Roll out the pasta, by machine or using a rolling pin, into two long sheets, roughly 15-20cm/6-8in wide, and 2mm thick. Cut the burrata mozzarella into 12 pieces.", "Place one sheet of pasta on the work surface. Put six pieces of mozzarella evenly along one side of the pasta sheet, and sprinkle with half of the parmesan.", "Brush around the pieces of cheese with water and fold over the other side of the pasta sheet.  Cover the six pieces of cheese by pressing the dough all around each to expel the air. Cut into rectangles with a pasta wheel or a sharp knife to make six large ravioli. Cover with a tea towel while you make the remaining ravioli. ", "Repeat with the other pasta sheet, using the rest of the burrata pieces and the remaining parmesan. ", "Cook the ravioli gently in plenty of boiling salted water for 2-3 minutes or until al dente.  Melt the butter in a pan with the pine nuts and rosemary. Let the hot butter absorb the herb flavour for two minutes. Scoop the ravioli out of the water and place in the pan with the melted butter and pine nuts.  ", "Serve the pasta on warmed plates, sprinkled with more parmesan."]}, {"isVegetarian": true, "title": "Green tomato chutney", "url": "www_bbc_co_uk_food_recipes_green_tomato_chutney_41573", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/green_tomato_chutney_41573_16x9.jpg", "ingredients": ["175g/6oz light brown sugar", "150ml/5fl oz white wine vinegar", "1 shallot, peeled, finely chopped", "1 garlic clove, peeled, finely chopped", "2cm/¾in piece fresh root ginger, peeled, finely grated", "1 red chilli, finely chopped", "125g/4½oz sultanas", "600g/1lb 5oz green tomatoes, quartered"], "serves": "Makes about 600g/1lb 5oz", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sugar in a frying pan until the sugar melts and caramelises.", "Add the white wine vinegar, shallot, garlic, ginger, chilli, sultanas and green tomatoes and bring the mixture to the boil. Reduce the heat and simmer for 1 hour, or until the chutney has thickened and you can draw a wooden spoon across the base of the pan so that it leaves a channel behind it that does not immediately fill with liquid.", "Spoon the chutney into sterilised jars."]}, {"isVegetarian": true, "title": "Green vegetables with mint caper butter", "url": "www_bbc_co_uk_food_recipes_green_vegetables_with_71110", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz fine green beans, trimmed and halved", "200g/7oz baby broad beans", "200g/7oz mangetout, halved lengthways", "2 tbsp chopped fresh mint", "coarse sea salt and black pepper", "30g/1oz butter", "3 tbsp capers, kept whole", "1 tbsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large pan of salted water to the boil and cook the beans and broad beans for 3 minutes.  Add the mangetout and cook for a further 2 minutes.  Drain and tip into a warm bowl.  Add half the mint, season with salt and pepper and toss.", "Melt the butter in a saucepan over a high heat. Add the capers, lemon juice, blanched vegetables and remaining mint. Heating briefly and tossing together before serving. Serve piping hot."]}, {"isVegetarian": true, "title": "Green bean and beansprout salad", "url": "www_bbc_co_uk_food_recipes_greenbeanandbeanspro_8812", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz fine green beans, topped and tailed", "100g/4oz mangetout, shredded diagonally", "175g/6oz beansprouts", "1 red onion, sliced very finely ", "200g/7oz canned straw mushrooms", "1 tbsp rice or white wine vinegar", "2 tbsp light soy sauce", "5-10ml/1-2tsp sesame oil", "1 tsp raw brown sugar", "1 tbsp fresh coriander leaves, chopped roughly", "1 tbsp Thai basil, chopped roughly", "3 spring onions, shredded finely", "a few sprigs fresh coriander and basil leaves", "1 tbsp sesame seeds, toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Steam the green beans and mangetout for 3 minutes. Place in a colander and refresh under cold running water. Drain. ", "Place the beans, mangetout, beansprouts, onion and mushroom in a large bowl and mix well. ", "In a small bowl mix together the vinegar, soy sauce, sesame oil, and sugar. Stir in the coriander and basil leaves, pour over the salad ingredients and toss together well. ", "Transfer to a serving platter and scatter over the spring onions, herb leaves and toasted sesame seeds. "]}, {"isVegetarian": true, "title": "Green bean, red pepper and brazil nut salad", "url": "www_bbc_co_uk_food_recipes_greenbeanredpepperan_88959", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz green beans, topped and tailed ", "1 red pepper, sliced", "2 tbsp chopped fresh coriander", "2 tsp sesame seeds, toasted", "30g/1oz brazil nuts, chopped", "4 tbsp olive oil", "2 tbsp balsamic vinegar", "1 tbsp red wine vinegar", "1 tsp Dijon mustard", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the green beans into a steamer and steam for 4-5 minutes, until tender. Transfer to a bowl, add the rest of the salad ingredients and season to taste with salt and freshly ground black pepper. Stir well to combine. ", "Spoon into a serving bowl and serve."]}, {"isVegetarian": true, "title": "Green bean salad", "url": "www_bbc_co_uk_food_recipes_greenbeansalad_84217", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg yolk", "½ shallot, finely chopped", "½tsp white wine vinegar", "50ml/2fl oz olive oil", "100g/3½oz green beans, blanched, refreshed", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl whisk together the egg yolk, shallot and vinegar. Gradually add the oil while whisking to create a thick emulsion, and then season, to taste, with salt and freshly ground black pepper. ", "Add the beans to the dressing and mix together. ", "To serve, pile the beans high on a plate."]}, {"isVegetarian": true, "title": "Green beans with garlic and almonds", "url": "www_bbc_co_uk_food_recipes_greenbeanswithgarlic_11974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1lb French green or bobby beans", "3 tbsp olive oil", "2 cloves garlic, sliced thinly", "100g/4oz slivered or whole almonds", "2 tbsp tamari soy sauce"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Drop the beans into boiling water and boil for 10 minutes. Drain and pile into a warm serving dish.", "Gently heat the oil with the garlic until it is just turning golden, quickly toss in the almonds and the tamari, stir and brown a few minutes longer. Tip over the green beans. Serve immediately."]}, {"isVegetarian": true, "title": "Green beans with ginger and mustard", "url": "www_bbc_co_uk_food_recipes_greenbeanswithginger_67362", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ tsp mustard seeds\t\t", "200g/7oz green beans, trimmed and par-boiled", "1 tsp cumin powder", "1 tsp peeled and grated root ginger", "¼ tsp salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan.  Add the mustard seeds.", "A few seconds later tip in the beans with the cumin and fry for 1 minute.  ", "Stir in the ginger and salt and sauté over a low heat for 5 minutes."]}, {"isVegetarian": false, "title": "Green beans with ham and cheese", "url": "www_bbc_co_uk_food_recipes_greenbeanswithhamand_92489", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 good handful green beans, trimmed", "4 or so slices of prosciutto, cut into strips", "3-4 thick slices taleggio cheese", "a good glug fruity olive oil", "freshly ground black pepper", "sourdough bread, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a pan of boiling salted water for about five minutes (you want them to bend a little - that is when they are most flavoursome). Drain the beans and add them quickly back to the hot pan, scatter over the ham and cheese, trickle over the olive oil and season well with freshly ground black pepper. Toss gently over a low heat so that the cheese melts to makes a warm voluptuous dressing for the beans. Serve immediately with crusty sourdough bread. Brie or camembert work well if you can't find taleggio."]}, {"isVegetarian": true, "title": "Green beans with spring onions and parsley butter", "url": "www_bbc_co_uk_food_recipes_greenbeanswithspring_89357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz green beans, trimmed", "25g/1oz butter", "3 spring onions, sliced", "salt and freshly ground black pepper", "1 tbsp honey", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a saucepan of boiling, salted water for 3-4 minutes, or until they have softened slightly but are not cooked through, then drain. ", "Melt the butter in a frying pan until foaming, then add the beans, sliced spring onions, and salt and pepper. Cook for 2-3 minutes. ", "Drizzle the vegetables with the honey and stir in the parsley, then serve."]}, {"isVegetarian": false, "title": "Green beans wok-tossed with spicy pork and a slow chilli burn", "url": "www_bbc_co_uk_food_recipes_greenbeanswoktossedw_74499", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["450g/1 lb green beans or long snake beans", "200g/7oz minced pork", "1 tbsp soy sauce", "½ tsp cornflour", "1 tsp sugar", "3 tbsp vegetable oil", "2 garlic cloves, peeled and squashed", "1 tbsp Chinese rice wine", "½ tsp of chilli oil or less, to taste", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the tops of the beans and cut into 15cm (6in) lengths.", "Cook the beans in simmering salted water for two minutes.", "Drain and cool under cold running water.", "Mix the minced pork with the soy sauce, cornflour, sugar, sea salt and freshly ground black pepper.", "Heat one tablespoon of the vegetable oil in a wok. When the oil is hot add the beans and stir-fry quickly with a pinch of salt for one minute until wrinkled.", "Remove the beans and reheat the wok, adding the remaining vegetable oil and the garlic cloves.", "When hot, discard the garlic (it will have flavoured the oil sufficiently) and add the pork mixture. Stir-fry quickly for three minutes until it darkens.", "Add the rice wine and chilli oil and stir through. ", "Return the beans to the sauce and stir-fry briefly until mixed.", "Serve with plenty of steamed rice."]}, {"isVegetarian": true, "title": "Green chilli salsa", "url": "www_bbc_co_uk_food_recipes_greenchillisalsa_71295", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350g/12oz green chillies", "350g/12oz plum tomatoes, chopped", "1 medium red onion, diced", "3 garlic cloves, chopped", "¼ tsp ground cumin", "salt", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place chillies in a roasting tray and roast at 220C/425F/Gas 7 for 10-15 minutes, depending on the size of chillies.  ", "They should be blackened on the outside and soft to the touch.  ", "Remove any black skin from the chillies and pass through a fine sieve. ", "Fold together with the tomatoes, garlic, onion, and cumin."]}, {"isVegetarian": true, "title": "Green chutney", "url": "www_bbc_co_uk_food_recipes_greenchutney_86561", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greenchutney_86561_16x9.jpg", "ingredients": ["80g/2¾oz fresh coriander leaves and stalks, washed", "20g/¾oz fresh mint leaves, washed", "1 garlic clove, peeled and roughly chopped ", "2.5cm/1in piece fresh ginger, peeled and roughly chopped ", "½ small onion, chopped ", "1-2 green chillies, or to taste, seeds removed, chopped", "15 raw pistachio nuts, shells removed, chopped ", "2 tbsp lemon juice, or to taste", "salt, to taste", "3 tbsp water"], "serves": "Makes 200ml/7fl oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients into a food processor and blend until smooth."]}, {"isVegetarian": true, "title": "Green coconut chutney", "url": "www_bbc_co_uk_food_recipes_greencoconutchutney_12733", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz fresh grated coconut or frozen coconut, thawed ", "or 150g/5oz desiccated coconut", "1 large bunch of fresh coriander", "1 large bunch of fresh mint", "4-5 green chillies", "6-8 garlic cloves", "1 tsp (heaped) cumin seeds", "1 tbsp sugar", "1 large lime, juiced (or to taste)", "salt"], "serves": "Makes approx. 250g/9oz", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients into a blender and whiz until you have got a thick paste, adding a little water if necessary. ", "Taste and adjust the seasoning, adding more lime juice if you like."]}]