[{"isVegetarian": false, "title": "Turkey tortilla soup", "url": "www_bbc_co_uk_food_recipes_turkey_tortilla_soup_40086", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkey_tortilla_soup_40086_16x9.jpg", "ingredients": ["500g/1lb 2oz ripe tomatoes", "½ head garlic cloves, unpeeled", "2 dried ancho chillies", "2 tbsp olive oil", "2 red onions, cut into thin wedges", "1 red pepper, diced", "1 green pepper, diced", "2 sticks celery, sliced", "2 tsp ground cumin", "large sprig thyme", "2 bay leaves", "1 tsp dried oregano", "small bunch coriander, stems and leaves separated", "1.25 litres/2 pints turkey stock", "250g/9oz cooked black beans", "250g/9oz sweetcorn", "salt and freshly ground black pepper", "300g/10½oz cooked turkey meat, cut into strips", "1 lime, juice only (optional)", "6-8 corn tortillas, cut into wedges or strips", "2 tbsp olive oil", "2 avocados, peeled, stones removed, diced", "1 lime, juice only", "salt, to taste", "3-4 spring onions, finely sliced", "100g/3½oz grated hard cheese"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["First prepare the tomatoes. Heat a heavy-based frying pan until hot, then add the tomatoes, garlic and dried chillies. Dry fry, shaking the pan regularly until the tomatoes are starting to blacken. ", "Remove the chilli when it starts to smell aromatic and put it in a bowl. Pour over some freshly boiled water and leave to soften.", "Tip the tomatoes into a food processor or blender. Peel the garlic cloves and add these too, then drain the chilli from its soaking water and add this. Blend until smooth.", "While you are dry roasting the tomatoes, heat the olive oil in a large casserole or saucepan. Add the onions, pepper and celery. Fry on a medium heat until starting to caramelise around the edges – this should take between 10-15 minutes. ", "Add the cumin, thyme, bay leaves and oregano. Finely chop the coriander stems and add these too. ", "Add the stock and reserved tomato mixture to the saucepan, along with the black beans and sweetcorn. Season well with salt and pepper, then bring to the boil, turn down the heat and simmer for 15-20 minutes.", "Add the cooked turkey to the soup and leave to simmer while you prepare the garnishes. ", "Preheat the oven to 200C/180C Fan/Gas 6. Toss the tortilla pieces in the oil and arrange over a couple of baking trays. Leave in the oven until crisp.", "Toss the avocado in the lime juice and season well with salt.", "Taste the soup and add a little lime juice if you think it needs it. Serve the soup garnished with the avocado, coriander leaves, spring onions, cheese and tortilla pieces."]}, {"isVegetarian": false, "title": "Turkey balls with tomato sauce and sweet potato fondant", "url": "www_bbc_co_uk_food_recipes_turkeyballswithtomat_80567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz turkey mince", "100g/3½oz breadcrumbs", "1 tbsp fresh chopped thyme", "1 egg, beaten", "salt and freshly ground black pepper", "1 tin chopped tomatoes", "1 small bunch thyme, leaves picked", "1 tbsp tomato purée", "½ onion, chopped ", "salt and freshly ground black pepper", "1 garlic clove, sliced", "1 tbsp fresh chopped thyme", "55g/2oz butter", "100ml/3½fl oz chicken stock", "100g/3½oz sweet potato, sliced into thin rounds"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the turkey balls, place all of the ingredients into a large bowl and mix together well. Divide the mixture into two, shape into balls and place in the fridge, while you make the sauce.", "For the sauce, place all of the ingredients into a deep frying pan over a medium heat. Bring to the boil and reduce the heat to a simmer for five minutes.", "Add the turkey balls and cook in the sauce, turning occasionally. Poach for 15 minutes, or until the turkey balls are cooked through.", "Meanwhile make the sweet potato fondant by placing all the ingredients into a small non-stick frying pan over a medium heat and cooking for ten minutes, stirring occasionally.", "To serve, turn out the fondant onto a plate. Top with the turkey balls and spoon over any extra sauce."]}, {"isVegetarian": false, "title": "Turkey club sandwich with garlic mayo", "url": "www_bbc_co_uk_food_recipes_turkeyclubsandwichwi_79115", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp white wine vinegar", "1 tbsp Dijon mustard", "2  free-range egg yolks", "1 garlic clove, chopped", "200ml/7fl oz olive oil", "3 thick slices bread", "3 slices of turkey", "1 tbsp flatleaf parsley, chopped"], "serves": "1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the garlic mayo, whisk the egg yolks with the white wine vinegar and Dijon mustard in a large bowl.", "Add the chopped garlic and whisk again.", "Continue whisking and gradually add the oil to create a thick mayonnaise consistency.", "To build the club sandwhich, spread the mayo on the bread and layer up with the turkey slices. Slice sandwich into triangles and sprinkle the chopped flat leaf parsely to serve."]}, {"isVegetarian": false, "title": "Turkey curry", "url": "www_bbc_co_uk_food_recipes_turkeycurry_78850", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeycurry_78850_16x9.jpg", "ingredients": ["1 tbsp olive oil", "25g/1oz unsalted butter", "1 large onion, peeled and finely chopped", "4 garlic cloves, peeled and finely chopped", "2.5cm/1in knob of fresh ginger, peeled and grated", "1 red chilli, de-seeded and finely chopped", "8 green cardamom pods, slightly crushed", "1 tsp ground cumin", "1 tbsp ground turmeric", "½ tsp chilli powder", "1 tsp garam masala", "1 tsp ground coriander seeds", "2 large potatoes, peeled and cut into cubes", "1 butternut squash, peeled, seeds removed and cut into cubes", "570ml/1pt chicken or turkey stock", "125ml/4fl oz yoghurt", "85ml/3fl oz double cream", "1 tbsp lemon juice", "6 large handfuls leftover turkey, chopped", "1 tbsp fresh coriander leaves, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil and butter in a large non-stick casserole pot.", "Add the onions and cook for 2-3 minutes, then add the garlic, ginger, chilli, cardamom, cumin, turmeric, garam masala and ground coriander.  Cook over a medium heat until the onion is soft, being careful not to burn the spices.", "Add the potatoes and butternut squash and cook until the potato begins to stick to the bottom of the pan slightly.", "Add the stock and bring to the boil.  Season, to taste, with salt and freshly ground black pepper. Reduce the heat and simmer for 10-15 minutes, until the potatoes and butternut squash are tender.", "Stir in the yoghurt and cream, then add the lemon juice. Add the cooked turkey, fold in and simmer to heat through. Sprinkle with coriander leaves and serve immediately."]}, {"isVegetarian": false, "title": "Turkey escalope with sage sauce vierge", "url": "www_bbc_co_uk_food_recipes_turkeyescalopewithsa_85320", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 150g/5½oz piece turkey breast", "1 tbsp olive oil", "3 fresh sage leaves", "1 tbsp olive oil", "½ lemon, juice only", "1 tomato, seeds removed, chopped", "handful fresh parsley, chopped", "handful fresh chives, chopped", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the turkey escalope, place the turkey breast between two sheets of cling film and flatten with a rolling pin or the base of a frying pan.", "Heat the oil in a frying pan over a medium heat and cook the escalope with the sage leaves for 3-4 minutes on each side, or until completely cooked through. Remove the turkey from the pan and set aside to keep warm.", "For the sauce vierge, in the same pan heat the remaining olive oil with the lemon juice, chopped tomato and herbs until simmering. Season with salt and freshly ground black pepper.", "To serve, place the turkey escalope onto a serving plate and drizzle over the sauce vierge."]}, {"isVegetarian": false, "title": "Turkey enchiladas", "url": "www_bbc_co_uk_food_recipes_turkeyenchiladas_80222", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeyenchiladas_80222_16x9.jpg", "ingredients": ["1 tbsp olive oil", "1 onion, chopped", "1 garlic clove, crushed ", "200ml/7fl oz passata (or 1 x 400g tin chopped tomatoes)", "1 tsp chopped fresh oregano (or 1/2 tsp dried oregano)", "½ tsp freshly ground black pepper", "1 tbsp olive oil", "1 garlic clove, crushed", "1 red onion, chopped", "1 red pepper, seeds and core removed, finely chopped", "1 courgette, chopped", "170g/6oz turkey mince", "85g/3oz cheddar, grated", "4 wholemeal tortillas"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4.", "To make the sauce heat the olive oil in saucepan over a medium heat. Add the onion and garlic and sauté for 4-5 minutes, until softened.", "Add the passata, oregano and black pepper. Cover , reduce the heat and leave to simmer for ten minutes.", "Meanwhile for the turkey, heat the olive oil in a separate pan over a medium heat. Add the onion, garlic, red pepper and courgette. Sauté for five minutes then add the turkey mince. Cook for around 5-7 minutes, or until the turkey mince is browned and cooked through.", "Add half of the cheese to the turkey mixture and continue to cook until the cheese has melted.", "Divide the turkey mixture between four tortillas and roll up into parcels. Place into an ovenproof dish, spoon over sauce and sprinkle with remaining cheese. Place into the preheated oven to bake for 15-20 minutes, until golden."]}, {"isVegetarian": false, "title": "Turkey feta burgers with Sicilian herb and lemon salad", "url": "www_bbc_co_uk_food_recipes_turkeyfetaburgerswit_90372", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ turkey breast", "85g/3oz feta cheese", "1 handful mixed fresh herbs (parsley, basil and chives)", "½ lemon, zest only", "1 free-range egg yolk", "salt and freshly ground black pepper", "2 tbsp plain flour", "2 tbsp olive oil", "1 lemon, segmented", "½ tsp caster sugar", "½ tsp chilli flakes", "½ tsp salt", "1 tbsp chopped fresh mint", "1 tbsp chopped fresh parsley", "1 tbsp chopped fresh dill ", "2 tbsp olive oil", "2 slices white bread, griddled"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the burgers, place all of the burger ingredients, except the flour and oil, in a food processor and pulse until well combined. Using damp hands, shape the mixture into two patties, then dust with the flour. ", "Heat the olive oil in a frying pan and fry the patties for 3-4 minutes on both sides, or until golden-brown and cooked through. ", "For the salad, combine all of the salad ingredients in a bowl and mix well.", "To serve, place one patty on each slice of bread and arrange the salad on top."]}, {"isVegetarian": false, "title": "Turkey kiev with cheese and sage and potato rosti", "url": "www_bbc_co_uk_food_recipes_turkeykievwithcheese_84984", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/½ pint vegetable oil, for deep frying", "1 x 150g/5½oz turkey breast", "75g/2½oz garlic and herb cream cheese", "3-4 fresh sage leaves", "salt and freshly ground black pepper", "75g/2½oz plain flour", "1 free-range egg, beaten", "50g/1¾oz fresh breadcrumbs", "1 potato, peeled, grated", "30g/1oz butter", "salt and freshly ground black pepper", "30g/1oz broccoli, steamed, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "To make the turkey kiev, cover the turkey breast with cling film and bash with a meat mallet or rolling pin until it is 0.5cm/¼in thick.", "Place the cream cheese and sage into the centre of the flattened turkey breast and season well with salt and freshly ground black pepper.", "Fold the turkey in half over the filling and secure with cocktail sticks. Transfer to the fridge for five minutes.", "Place the flour, beaten egg and breadcrumbs into three separate bowls. Season the flour with salt and freshly ground black pepper.", "Remove the turkey from the fridge, remove the cocktail sticks and dip the turkey first into the flour, then the egg and finally the breadcrumbs. ", "Carefully place the turkey into the hot oil and deep fry for 3-4 minutes, or until golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.", "Place the turkey onto a baking sheet, transfer to the oven and bake for 10-12 minutes, or until completely cooked through.", "For the rösti, place the grated potato into a clean tea towel and squeeze the tea towel over a bowl to remove the excess moisture.", "Melt the butter in a small frying pan, add the grated potato and press into the pan to form a disc 1cm/½in thick. Season well with salt and freshly ground black pepper and fry for 2-3 minutes, or until the base begins to turn golden-brown. Turn over and cook on the other side for 2-3 minutes.", "To serve, place the potato rösti onto a plate and top with the kiev, sliced in half on the diagonal, with the steamed broccoli alongside."]}, {"isVegetarian": false, "title": "Turkey legs coq au vin", "url": "www_bbc_co_uk_food_recipes_turkeylegscoqauvin_13962", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey legs", "2 turkey wings", "turkey giblets (ie neck, heart, gizzard, but not the liver - save for the stuffing)", "50g/2oz butter", "1 tbsp olive oil", "250g/9oz small (ie pickling) onions, blanched and then peeled", "250g/9oz pancetta or thick cut streaky bacon, in chunky pieces", "50g/2oz seasoned flour", "½ wine glass brandy", "500ml/16½fl oz red wine", "500ml/16½fl oz poultry or pork stock, or water", "bouquet garni of bay, thyme and parsley stalks", "4 sticks celery, cut into 3cm/1¼in lengths", "4 garlic cloves, bruised", "4 medium tomatoes, peeled, deseeded and  finely chopped", "salt and fresh ground black pepper", "beurre manie (25g/1oz flour mixed with 25g/1oz soft butter)"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Carefully cut the whole legs from the turkey, then cut at the joint to separate the thigh from the drumstick. Cut off the wings with poultry shears at the point at which they attach to the breast.", "Heat the butter and oil in a heavy pan and fry the bacon pieces until browned. Transfer the bacon pieces to your chosen casserole dish. Lightly brown the onions in the same pan and transfer these to the casserole dish. ", "Dust the turkey legs with seasoned flour and brown these next, turning several times until coloured and crisp. Pour over the brandy and set light to it (by tipping the pan towards the gas flame, if you are cooking on gas, with a lit wooden taper if you are not). When the flames have subsided, transfer the turkey legs and all the juices in the pan to the casserole dish.", "Return the pan to the heat, deglaze one more time by pouring in the wine and scraping the bottom and sides of the pan while the wine bubbles. Pour the boiling wine over the turkey pieces and then repeat the process with the water or stock (the job of deglazing is sure to be done by now but it is good to add hot, not cold, liquid to the casserole to start the cooking).", "Now add the herbs, celery and tomatoes to the pan and bring to a gentle simmer. Cover the pan and cook over a very low heat or in a low oven for about 1½ hours until the meat is completely tender.", "Strain the stock into a separate, clean pan leaving the meat and vegetables in your casserole dish. Boil the stock fast to reduce by half or even two-thirds, into a rich, intense sauce. If you think the sauce seems a little thin you can whisk in a few  crumbs  of beurre manié. Season to taste with salt and pepper.", "When the turkey pieces are cool enough to handle, remove the meat from the bones with your fingers and return the pieces of meat to the finished sauce along with the bacon pieces and vegetables.", "Set aside, keeping in the fridge if necessary, reheating carefully and thoroughly but without burning or serve immediately."]}, {"isVegetarian": false, "title": "Turkey mince kebabs", "url": "www_bbc_co_uk_food_recipes_turkeymincekebabs_78586", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chilli, de-seeded and finely chopped", "½ leek, finely chopped", "3 garlic cloves, chopped", "1 bunch coriander root, chopped", "zest of 1 lime", "1 tsp cumin", "1 tsp fish sauce (nam pla)", "125g/4½oz turkey mince", "1 tbsp olive oil", "little gem lettuce, broken up", "lime wedges"], "serves": "Makes 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the curry paste, blend together all of the paste ingredients in a food processor.", "Add one tablespoon of the curry paste to the turkey mince and mix through thoroughly in a bowl. Divide the mixture into thirds and mould around three skewers.", "Heat a grill pan and add the oil. Grill the skewers, turning occasionally for 8-10 minutes.", "Serve on the baby gem lettuce with the lime wedges."]}, {"isVegetarian": false, "title": "Turkey koftas with glazed red cabbage", "url": "www_bbc_co_uk_food_recipes_turkeykoftawithglaze_84784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz turkey mince", "1 tsp paprika", "1 tsp ground cinnamon", "1 tsp ground ginger", "salt and freshly ground black pepper", "1 tbsp olive oil", "25g/1oz unsalted butter", "1 tsp olive oil", "½ onion, chopped", "1 garlic clove, chopped", "½ small red cabbage, sliced", "½ apple, peeled, cored and chopped", "½ miniature bottle port ", "2tbsp brown sugar", "2tbsp balsamic vinegar", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Soak three wooden skewers in a bowl of water for ten minutes ", "For the koftas, place the turkey and turkey spices into a bowl and mix well.  Season the mixture well with salt and freshly ground black pepper.", "Shape the spiced mince into six oval balls with your hands and thread two of the balls onto each of the three wooden skewers. ", "Heat a griddle pan until it is smoking hot.  Brush the koftas with the olive oil and fry them for three minutes on each side, or until completely cooked through. ", "For the cabbage, melt the butter with the oil in a frying pan.  Add the onion and garlic to the frying pan and cook until they have become soft and golden in colour.", "Add the cabbage and apple to the frying pan and cook for three minutes.", "Add the port, the sugar and the vinegar to the frying pan and mix well.", "Place a lid on the frying pan and cook the cabbage until it is tender, then season with salt and freshly ground black pepper.", "To serve, place the cabbage onto a clean plate.  Place the koftas on top of the cabbage."]}, {"isVegetarian": false, "title": "Turkey pizzaiola", "url": "www_bbc_co_uk_food_recipes_turkeypizzaiola_4865", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 turkey escalopes or 225g/8oz turkey strips", "1 small red and 1 small green pepper de-seeded and cut into strips", "2 cloves garlic - crushed", "1 small onion chopped", "400g/14oz can chopped tomatoes", "10 black olives (with stones) ", "handful fresh basil", "knob of butter", "olive oil", "Salt and pepper", "pasta", "parmesan"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sauté the turkey in butter and oil until it is brown and cooked through. ", "In another pan, heat some olive oil and sauté the onion and garlic, add the sliced peppers and cook for a few minutes. ", "Stir in the tomatoes and olives and simmer gently until the sauce has reduced and thickened slightly. ", "Add torn basil at the end of cooking. "]}, {"isVegetarian": false, "title": "Turkey ragù", "url": "www_bbc_co_uk_food_recipes_turkeyragu_84111", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp vegetable oil", "110g/4oz turkey breast, finely chopped", "½ leek, roughly chopped", "1 garlic clove, crushed", "1 x 400g/14oz can cherry tomatoes, drained", "2 tbsp white wine vinegar", "1 tbsp chopped fresh parsley", "bowl of rice, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the vegetable oil in a frying pan over a high heat. Add the turkey and fry for 2-3 minutes on each side, or until golden brown. ", "Add the leeks and garlic to the pan for 2-3 minutes.", "Add the remaining ingredients simmer to reduce and thicken the sauce.", "To serve, remove the sauce from pan and eat alone or with a bowl of steaming rice."]}, {"isVegetarian": false, "title": "Turkey salad with Chinese cabbage, beansprouts and Vietnamese mint", "url": "www_bbc_co_uk_food_recipes_turkeysaladwithchine_92947", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeysaladwithchine_92947_16x9.jpg", "ingredients": ["100g/3½oz shallots, peeled, very thinly sliced", "¼ tsp salt, or to taste", "350g/12¼oz cold, cooked leftover turkey meat, sliced into strips", "400g/14¼oz Chinese cabbage, core removed, leaves finely shredded", "100g/3½oz beansprouts", "1 large carrot, peeled, cut in half, finely shredded", "15g/½oz Vietnamese mint leaves (available from some Asian grocers), or a mixture of coriander and mint or Thai sweet basil leaves, roughly chopped", "40g/1½oz roasted peanuts, coarsely chopped, plus extra to serve", "freshly ground black pepper", "3 tbsp fish sauce (nam pla)", "3 tbsp freshly squeezed lime juice", "1 tbsp rice vinegar", "2 tbsp caster sugar", "1 tsp very finely chopped garlic ", "2 red bird's-eye chillies, finely chopped"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the shallots and salt in a large bowl and set aside for 30 minutes, or until softened.", "Meanwhile, for the dressing, mix together the dressing ingredients in a separate bowl until well combined.", "Just before serving, add the cold turkey strips to the bowl of salted shallots. Mix in the Chinese cabbage leaves, beansprouts, shredded carrot, herbs and peanuts until well combined. ", "Pour over the dressing, season, to taste, with freshly ground black pepper, then mix well until the dressing coats the salad ingredients.", "To serve, pile the turkey salad into the centre of each of four serving plates. Sprinkle over the remaining chopped roasted peanuts."]}, {"isVegetarian": true, "title": "Turkish eggs", "url": "www_bbc_co_uk_food_recipes_turkish_eggs_77109", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkish_eggs_77109_16x9.jpg", "ingredients": ["200g/7oz Greek-style plain yoghurt", "1 garlic clove, crushed", "1 tsp sea salt flakes", "2 tbsp unsalted butter", "1 tbsp extra virgin olive oil", "1 tsp Aleppo pepper", "2 large free-range eggs, fridge cold", "2 tsp lemon juice", "few fronds fresh dill, chopped", "thick sourdough toast, to serve "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a saucepan up to 4cm/1½in deep with water and bring to the boil. Place the yoghurt into a heatproof bowl large enough to sit over the pan and stir in the garlic and salt. Place the bowl over the pan, making sure the base doesn’t touch the water. Stir until it reaches body temperature and has the consistency of lightly whipped double cream. Turn off the heat, leaving the bowl over the pan. ", "Melt the butter gently in a seperate small saucepan until it is just beginning to turn hazelnut-brown. Turn the heat off, then stir in the oil, followed by the Aleppo pepper and set aside.  ", "Fill a wide, lidded saucepan with 4cm/1½in water and place over a medium heat. Line a large plate with kitchen paper. ", "Crack the first egg into a small fine mesh strainer suspended over a small bowl, then lift up and swirl gently for about 30 seconds, letting the watery part of the white drip into the bowl; discard. Gently tip the egg into a small cup or ramekin and pour 1 teaspoon of lemon juice onto it, aiming for the white. Repeat with the second egg. ", "When the poaching water is just starting to simmer, gently slide in the eggs, one on each side of the pan. Turn the heat right down so there is no movement in the water, and poach the eggs for 3–4 minutes, until the whites are set and the yolks still runny. Transfer the eggs to the lined plate using a slotted spoon.", "Divide the warm, creamy yoghurt between two shallow bowls, top each with a poached egg, pour over the peppery butter, scatter the chopped dill on top and eat with the toast. "]}, {"isVegetarian": false, "title": "Leftover turkey pasta with bacon, peas and cream", "url": "www_bbc_co_uk_food_recipes_turkeywithbaconpeasa_14227", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkeywithbaconpeasa_14227_16x9.jpg", "ingredients": ["3 thick rashers streaky bacon or pancetta, diced small", "olive oil", "1 medium onion, chopped", "1 clove garlic, chopped", "leftover turkey, chopped fairly small", "200g/7oz fresh or frozen peas", "2-3 tbsp double cream", "salt and pepper", "200-300g tagliatelle, cooked according to packet instructions", "fresh Parmesan"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a heavy frying pan fry the bacon or pancetta until just crispy. Turn the heat down, then add the onions and garlic and cook gently until soft but not coloured.", "Add the peas and a splash of water and allow to bubble for a couple of minutes. When the pan is almost dry again add the turkey and heat through.", "Add the cream and season well with salt and black pepper. Allow to bubble until the cream has reduced a little and the sauce has a nice coating consistency.", "Serve tossed with the cooked tagliatelle, with plenty of fresh grated Parmesan on the table. "]}, {"isVegetarian": false, "title": "Turkish spiced chicken with flatbreads and green relish", "url": "www_bbc_co_uk_food_recipes_turkish_spiced_chicken_12732", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkish_spiced_chicken_12732_16x9.jpg", "ingredients": ["6 tbsp olive oil", "½ tsp ground cinnamon", "¾ tsp cayenne pepper", "1 tsp ground cumin", "2 garlic cloves, grated", "6 boneless chicken thighs, skin removed", "salt and freshly ground black pepper", "2 garlic cloves, chopped", "sea salt flakes", "1 green chilli, halved, seeds removed, roughly chopped", "1 red chilli, halved, seeds removed, roughly chopped", "15g/½oz fresh coriander, roughly chopped", "8 sprigs of mint, leaves only, roughly torn", "70g/2½oz pitted green olives, roughly chopped", "6 tbsp extra virgin olive oil", "2 tbsp white balsamic vinegar", "good squeeze of lemon juice", "200g/7oz plain flour", "½ tsp salt", "2 tbsp ghee, melted", "¼ cucumber, sliced", "handful of baby leaves", "3 tbsp olive oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "lemon wedges", "200ml/7fl oz Greek yoghurt"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the chicken, make a marinade by mixing the olive oil, cinnamon, cayenne, cumin, garlic, salt and pepper together in a mixing bowl. ", "Make little slits all over the undersides of the chicken with the point of a knife. Put the chicken in the marinade, turning to coat. Cover with cling film and put in the fridge. Leave in the fridge for a couple of hours, or overnight. Making sure to bring it to room temperature before cooking.", "To make the relish, put the garlic and sea salt in a pestle and mortar and bash it until it is crushed. Add the chillies, coriander, mint and olives and bash everything together. Gradually add the extra virgin olive oil and balsamic vinegar until you have a rough paste (it should be chunky, not puréed). Add lemon juice to taste and set aside.", "To make the flatbreads, put the flour in a medium bowl, add the salt and stir. Add enough water until the flour mix comes to a dough. Knead until smooth and divide into 4 pieces. Roll each piece into a circle and put on a hot griddle pan one at a time. Turn the bread over once charred marks have appeared and brush with the melted ghee.", "For the green salad, put the cucumber and leaves in a large bowl. Pour the olive oil and white wine vinegar in a small bowl and whisk in the mustard. Just before serving pour the dressing over the salad and mix.", "To cook the chicken, heat a griddle pan. Remove the chicken from the marinade, shaking off the excess. Cook the chicken over a medium heat, for about 2 minutes on each side. Reduce the heat to low and cook for another 4 minutes, or until cooked through. ", "Put the chicken on a plate and serve with the flatbreads, chutney, green salad, lemon wedges and a bowl of Greek yoghurt. "]}, {"isVegetarian": false, "title": "Turkish kofta kebabs with minted yoghurt and kohlrabi and carrot salad", "url": "www_bbc_co_uk_food_recipes_turkishkoftakebabswi_71862", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/turkishkoftakebabswi_71862_16x9.jpg", "ingredients": ["900g/2lb minced lamb", "2 onions, finely grated", "6 garlic cloves, crushed", "2 tsp dried chilli flakes", "1 small bunch of flatleaf parsley, chopped", "oil for brushing", "2 vine-ripened tomatoes, thinly sliced", "salt", "freshly ground black pepper", "200g/7oz Greek natural yoghurt", "2 tbsp chopped mint", "2 large carrots, peeled and halved", "2 kohlrabi, peeled", "2 tbsp sunflower oil", "4 tsp cumin seeds", "4 tsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat a charcoal barbecue 40 minutes ahead of cooking or a gas barbecue 10 minutes ahead of cooking. If using a cast-iron griddle pan, heat it over a high heat, then lower the heat slightly before cooking.", "Cover eight bamboo skewers with cold water and leave them to soak.", "Put the minced lamb into a bowl with the onions, garlic, chilli flakes, parsley, one teaspoon of salt and some freshly ground black pepper. Mix together with your hands until bound together.", "Divide the mixture into eight and mould it into long sausage shapes around the drained bamboo skewers.", "For the minted yoghurt, mix the yoghurt with the mint, half a teaspoon of salt and some pepper and set aside.", "For the salad, finely shred the carrots and kohlrabi, on a mandolin or on the coleslaw setting of your food processor so you get nice long, thin, crunchy strips.", "Put these in a bowl with a large pinch of salt and mix together well.", "Heat the sunflower oil in a small pan, add the cumin seeds and, as soon as they start to sizzle, add them to the vegetables with the lemon juice and toss together.", "Brush the kofta generously with oil and lightly oil the bars of the barbecue or griddle. Cook for five minutes, turning occasionally, until browned all over and cooked through.", "Spread the minted yoghurt over one large or four individual serving plates. Lay the kofta on top, garnsih with the sliced tomatoes and serve with the salad."]}, {"isVegetarian": true, "title": "Turmeric-roasted cauliflower with Stilton cream and deep-fried cauliflower leaves", "url": "www_bbc_co_uk_food_recipes_turmeric-roasted_76567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 medium cauliflower, cleaned, left whole, leaves reserved for deep-frying  ", "5g fresh turmeric root ", "25g/1oz roasted garlic cloves, skins removed (see tip)", "50ml/2fl oz rapeseed oil ", "100ml/3½fl oz soya cream ", "100ml/3½fl oz double cream ", "85g/3oz Stilton ", "400ml/14fl oz ice-cold sparkling water", "100g/3½oz plain flour ", "100g/3½oz cornflour", "½ tbsp cider vinegar", "salt", "2 slices toasted sourdough", "100g/3½oz walnuts  "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1.", "For the turmeric cauliflower, steam the whole cauliflower for about 8–10 minutes, or until tender in the middle. Drain and place on a baking tray.", "In a food processor, pulse the turmeric root, roast garlic and rapeseed oil until you have a rough paste. Pour over the steamed cauliflower, season with salt and pepper and roast the cauliflower for 25 minutes. ", "Gently warm both the soya and double cream in a saucepan. Crumble in the Stilton and heat until melted. ", "Remove the cauliflower from the oven, pour the cheesy cream over, then bake for a further 30 minutes, or until bubbling and golden. ", "For the deep-fried cauliflower leaves, preheat a deep-fat fryer to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended).  ", "Whisk all the ingredients together to form a batter, dip in the reserved leaves to coat. Lower into the fryer and fry until crisp and golden. Place on a plate lined with kitchen roll to drain off any excess oil. ", "For the sourdough walnut crumb, in a food processor, pulse the nuts and sourdough to form crumbs.", "To serve, place the cauliflower on a serving dish or plate and garnish with the fried leaves and crumbs. Serve in slices."]}, {"isVegetarian": false, "title": "Turmeric-spiced prawns with omelette pilau", "url": "www_bbc_co_uk_food_recipes_turmeric-spiced_prawns_47504", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 very large raw prawns, shelled and veins removed", "250g/9oz Greek-style yoghurt", "2 cloves garlic, crushed", "4cm/1½in piece fresh ginger, peeled and finely chopped", "1 green chilli, finely chopped", "2 tsp ground turmeric", "½ tsp ground cardamom", "1 tsp ground cumin", "6 tbsp vegetable oil", "1 onion, finely diced", "1 garlic clove, crushed", "3 cloves", "1 cinnamon stick", "8 curry leaves", "200g/7oz basmati rice", "300ml/10fl oz chicken stock", "½ lemon, juice only", "3 tbsp coriander leaves, roughly chopped", "4 eggs, lightly beaten", "coriander leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the prawns, place all the ingredients except the prawns into a bowl and mix well to combine. Add the prawns, mix gently then place in the fridge to marinate for at least four hours.", "For the omelette pilau, heat a saucepan until hot, add half the oil, the onion, garlic and spices, and fry for two minutes.", "Stir in the rice and add the chicken stock. Bring to the boil, cover and reduce to a gentle simmer. Cook for 18-20 minutes until the rice is tender and all the liquid is absorbed. Season with salt, freshly ground black pepper and the lemon juice, then stir in the coriander leaves and set aside until cool enough to handle.", "Heat a large frying pan until smoking hot, add half the remaining oil and half the beaten eggs and swirl around the pan until the eggs are just cooked.", "Scatter half the pilau rice over the omelette then slide out of the frying pan onto a chopping board. Roll the omelette up into a pinwheel and set aside.", "Repeat with the remaining oil, eggs and rice.", "Meanwhile, remove the prawns from the fridge, return to room temperature then thread onto wooden skewers.", "Heat a griddle pan or indoor barbecue until very hot, add the prawns and cook for 1-2 minutes on each side or until just cooked through.", "Remove the skewers from the pan and rest for a couple of minutes.", "To serve, lay the skewers of prawns onto serving plates. Cut the omelette pinwheel into thick slices and lay alongside the prawns. Garnish with a sprig of coriander and serve immediately."]}, {"isVegetarian": true, "title": "Tuscan fries", "url": "www_bbc_co_uk_food_recipes_tuscan_fries_61356", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_fries_61356_16x9.jpg", "ingredients": ["1kg/2lb 4oz waxy potatoes", "1.5L/2½pt corn oil or flavourless vegetable oil", "1 head garlic, cloves separated but not peeled", "8 sprigs thyme, rosemary or sage, or herbs of your choice", "sea salt flakes, to taste"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut the short ends off each potato (but don’t peel it) so that it can sit up vertically, and then slice it downwards into generous 1cm/½in slices. Cut these slices into chips about 1cm thick, again, err on the generous side. Load up a clean tea towel with the chips as you cut them.", "Put the oil into a wide, heavy-based pan (mine is approximately 28cm/11in diameter and 11cm/4in deep), and add the freshly cut potatoes. Then put the pan over a high heat and bring to a boil, which should take about five minutes. Keep a careful watch on the pan at all times.", "Continue to cook the fries, without stirring them, for another 15 minutes. Once the oil temperature reaches 160C/325F, turn down the heat slightly and keep the fries cooking at between 150-160C. The pan will be bubbling vigorously. If the oil gets too hot or bubbles too hard, reduce the heat a little, and always keep a close eye on it.", "Now you can very carefully give the chips a gentle stir with a pair of tongs held in an oven glove, moving any that have stuck away from the bottom or sides of the pan. Add the unpeeled cloves of garlic to the pan, stir gently again, and cook for another 5-10 minutes (watching the temperature and making sure the garlic doesn’t look burnt or the fries too dark), before testing a chip for crispness on the outside and tenderness on the inside. Do not burn your mouth, though! You might need another five minutes or so beyond this, but stand by your pan, the chips can turn from a cooked gold to a burnt bronze quickly.", "At the point when the chips are pale gold, but crisp, toss in the herbs, then after a minute or so scoop everything out – using a couple of perforated scoops for ease, and wearing oven gloves to protect your hands – onto a tray or platter lined with a double thickness of kitchen roll. Once any excess oil has been absorbed, tip the chips off the kitchen paper clatteringly onto the plate and sprinkle with sea salt flakes to taste, serving immediately."]}, {"isVegetarian": true, "title": "Tuscan beans on sourdough toast", "url": "www_bbc_co_uk_food_recipes_tuscan_beans_on_99053", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_beans_on_99053_16x9.jpg", "ingredients": ["2 tbsp olive oil, plus 2 tsp for drizzling", "1 red onion, roughly chopped", "1 garlic clove, crushed", "227g tin chopped tomatoes ", "400g tin haricot beans, drained and rinsed", "1 sprig fresh rosemary", "2 x 75g/2¾oz (or 4 x 37.5g/1¼oz) slices sourdough bread", "¼ garlic clove", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a frying pan over a medium–low heat. Add the red onion and garlic and fry for 5 minutes, or until starting to soften.  ", "Add the tomatoes, beans and rosemary. Season with plenty of pepper and a small pinch of salt. Heat for 5 minutes, stirring occasionally. ", "Toast the sourdough on both sides. Drizzle a teaspoon of oil over each piece and rub the toast with the garlic. Serve the beans on the sourdough."]}, {"isVegetarian": false, "title": "Tuscan bacon and bean soup with wild garlic pesto", "url": "www_bbc_co_uk_food_recipes_tuscan_peasant_pot_soup_52268", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuscan_peasant_pot_soup_52268_16x9.jpg", "ingredients": ["50ml/2fl oz extra virgin olive oil", "300g/10½ oz smoked streaky bacon, roughly chopped", "2 tbsp sherry vinegar ", "2 red onions, roughly chopped ", "2 carrots, roughly chopped", "2 garlic cloves, finely chopped", "2 stalks celery, roughly chopped", "1 large leek, roughly chopped", "2 large waxy potatoes, roughly chopped", "6 vine tomatoes, roughly chopped (reserve the vines)", "small bunch fresh rosemary and thyme, tied with string", "130g/4¾oz small orecchiette pasta ", "2 litres/3½ pints good-quality beef stock", "1 x 400g tin cannellini beans, drained and rinsed", "16 small florets purple sprouting broccoli ", "100g/3½oz baby leaf spinach", "salt and freshly ground black pepper", "15g/½oz  fresh basil, roughly chopped", "15g/½oz wild garlic, roughly chopped  ", "50g/1¾oz pine nuts ", "3 tbsp olive oil", "15g/½oz Parmesan, finely grated", "½ lemon, zest only, finely grated", "1 tsp lemon juice, to taste", "salt and freshly ground black pepper", "small handful fresh basil, roughly chopped", "small handful fresh flatleaf parsley, roughly chopped", "small handful fresh chives, snipped", "100g/3½oz Parmesan, finely grated", "olive oil, for drizzling ", "1 loaf crusty bread, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the soup, heat the oil in a heavy-based saucepan over a high heat. Add the bacon, then season and fry for 3–4 minutes, until caramelising but not burning. De-glaze the pan with the sherry vinegar. Add the red onions, carrots, garlic, celery and leek and cook for 8–10 minutes, or until softened. ", "Stir in the potatoes and tomatoes, with their vines, then add the rosemary and thyme bundle. Squash the tomatoes with a wooden spoon. Bring the pan to a simmer.", "Heat the beef stock in a saucepan over a high heat. Add the pasta to the vegetables. Once the stock is simmering, pour this in too.", "Pour the soup into the pressure cooker (CAUTION: Please follow the manufacturer's guidelines for safe use of your pressure cooker). Bring up to pressure and cook for 5 minutes at pressure. Turn off the heat and slowly release the pressure. Remove the rosemary and thyme bundle and tomato vines and discard. Stir in the cannellini beans, broccoli and spinach and allow to soften in the residual heat for 5 minutes. ", "Meanwhile, to make the pesto, grind the basil and wild garlic in a mortar with a pestle or food processor to release the natural oils. Then, add the pine nuts and lemon zest and grind. Once combined, add the olive oil to make a paste and grind in the Parmesan. Add a squeeze of lemon and season to taste.", "To serve, pour into soup bowls and sprinkle over the fresh herbs,  parmesan, wild garlic pesto and olive oil. Serve with crusty bread."]}, {"isVegetarian": false, "title": "Tuscan bean soup", "url": "www_bbc_co_uk_food_recipes_tuscanbeansoup_82379", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz dried cannellini beans ", "300g/10½oz dried borlotti beans", "100g/3½oz fat cut from a ham, or a ham or prosciutto bone", "salt and freshly ground black pepper", "1 litre/1¾ pints vegetable or beef stock", "extra virgin olive oil, for drizzling", "8 tbsp extra virgin olive oil", "4 celery sticks, finely chopped", "2 carrots, finely chopped", "1 medium onion, finely chopped", "2 cloves garlic, crushed", "1 sprig rosemary", "4 bay leaves", "salt and freshly ground black pepper"], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Soak the beans overnight in cold water, using a separate bowl for each type of bean.", "Rinse and drain the beans, then boil them in separate pans; the borlotti beans for about an hour, the cannellini beans for 45 minutes. Drain and set aside.", "Meanwhile, cook the soffritto. Heat the olive oil in a saucepan and gently fry the celery, carrot, onion, garlic, rosemary and bay leaves until golden, about 15 minutes.", "Remove the rosemary sprig and bay leaves and season with salt and freshly ground black pepper. ", "Add the ham fat or bone and the cannellini beans to the soffritto. Season with salt and freshly ground black pepper, and cook for a further 10 minutes.", "Add the stock and bring to the boil, then simmer for 25 minutes or until the beans are tender. ", "Remove the pieces of ham fat or bone. Stir in the whole borlotti beans. Season with more salt and freshly ground black pepper to taste. Serve drizzled with extra virgin olive oil."]}, {"isVegetarian": true, "title": "Tuscan pesto", "url": "www_bbc_co_uk_food_recipes_tuscanpesto_82385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["large handful fresh basil leaves", "1 clove garlic", "125g/4½oz pine nuts", "extra virgin olive oil", "125g/4½oz hard Pecorino cheese, freshly grated"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the basil, garlic and pine nuts into a pestle and mortar and crush until it is reduced to a paste.", "Add enough olive oil to give a consistency you like and mix in the Pecorino cheese. ", "Transfer to a clean dish and either use immediately or place an airtight container. Cover in a layer of olive oil, place in the refrigerator (for up to one month) until ready to use."]}]