[{"ingredients": ["¼ cucharadita de sal", "½ cucharadita de semillas de cilantro", "½ cucharadita de copos de chile", "1 cardamomo debajo", "1 cucharadita de aceite de oliva", "½ pechuga de pato, con la piel puesta", "½ papa grande, pelada y cortada en 3 rondas", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida", "1 naranja, ralladura y jugo", "2 cucharaditas de vinagre de vino tinto", "¼ cucharadita de cúrcuma molida", "1 cucharadita de azúcar en polvo", "2 cucharadas de aceite de oliva"], "method": ["Para el pato, coloca la sal, las semillas de cilantro, los copos de chile y la vaina de cardamomo en un mortero y machaca y aprieta. Agregue el aceite para hacer una pasta. Frote la pasta de especias por todo el pato.", "Calentar una sartén y freír la pechuga de pato con la piel hacia abajo durante 8-10 minutos, o hasta que se haya liberado mucha grasa y la piel esté dorada y crujiente. Drene cualquier exceso de grasa en un tazón.", "Voltee y fría por 3-4 minutos o hasta que esté completamente cocido. Retire de la sartén y deje reposar durante cinco minutos en un lugar cálido.", "Para la galette de papa, hierva las papas en una cacerola de agua con sal durante cinco minutos, luego escurra.", "Calentar el aceite en una sartén y freír las rodajas de patata hasta que estén doradas. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para la vinagreta, caliente la ralladura de naranja y el jugo, el vinagre, la cúrcuma y el azúcar en una olla pequeña y cocine a fuego lento hasta reducir a la mitad y almibarado. Retire del fuego y mezcle con el aceite de oliva.", "Para servir, coloque las rodajas de papa en un plato para servir, cubra con el pato y rocíe sobre la vinagreta."], "url": "www_bbc_co_uk_food_recipes_sweetandspicyduckwit_87237", "title": "Pato dulce y picante con paleta de galette y vinagreta de naranja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["12 salchichas de cerdo o de venado de buena calidad", "3 cucharadas de mostaza de grano", "3 cucharadas de miel clara", "1 limón, ralladura y jugo", "2 cucharaditas de pimentón"], "method": ["Caliente el horno a 200C / 400F / Gas 6.", "Mezcle la miel, la mostaza, el pimentón, el jugo de limón y la ralladura. Pinche las salchichas y mezcle la mezcla de mostaza. Ponga una lata para asar y hornéela en el horno hasta que se dore y cocine bien. Gire las salchichas de vez en cuando mientras están cocinando.", "Sirve con papas al horno."], "url": "www_bbc_co_uk_food_recipes_sweetandspicysausage_68086", "title": "Salchichas dulces y picantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300 ml / 10 fl oz de ketchup de tomate", "300ml / 10fl oz de salsa de soja oscura", "125g / 4oz de goteo de miel", "Jengibre fresco, pelado y picado de 5cm / 2in en pieza", "4 dientes de ajo picados", "5 cucharadas de jerez Amontillado", "1 cucharadita de anís estrellado molido (opcional)", "1 cucharada de salsa de soja dulce (salsa de chile dulce)", "1 cucharada de romero fresco, picado", "Costillas de cerdo de 1,8-2,2 kg / 4-5 lb (costillas del bebé, si es posible)", "agua", "2 cebollas tiernas, finamente picadas", "6 patatas grandes, cada una de aproximadamente 100 g / 4 oz", "3 cucharadas / 2 fl oz de aceite de oliva", "75g / 2oz de polenta", "30 g / 1 oz de queso parmesano, finamente rallado", "2 cucharadas de romero fresco, finamente picado", "sal y pimienta negra recién molida", "crema agria", "mini dulce con mantequilla"], "method": ["Para las costillas, coloque el ketchup de tomate en un plato grande y poco profundo con salsa de soja, miel, jengibre, ajo, jerez, anís estrellado (si se usa), ketjap manis y romero. Mezcle bien para combinar.", "Agrega las costillas. Si el tiempo lo permite, cubra y enfríe por hasta 24 horas.", "Coloque las costillas en una sartén grande y profunda. Puede que tenga que cortar las costillas a la mitad para que encajen. Vierta sobre la mezcla de ketchup de tomate y luego agregue suficiente agua para cubrir completamente las costillas.", "Llevar a fuego lento, luego cocine a fuego medio durante 45 minutos a una hora hasta que esté completamente tierno.", "Precalienta la parrilla. Retire las costillas de la salsa y coloque las costillas en una parrilla. Coloque la salsa sobre la placa a fuego medio y reduzca hacia abajo hasta que tenga una consistencia pegajosa.", "Coloque las costillas debajo de la parrilla precalentada durante aproximadamente ocho minutos en cada lado, rociando o pintando las costillas con el adobo reducido de vez en cuando. Alternativamente cocina en una barbacoa.", "Para las cuñas de papa, precaliente el horno a 200C / 400F / Gas 6. Pinche cada patata con un tenedor y frote con un poco de aceite. Coloque las papas directamente en el estante del horno y hornee durante 40-45 minutos o hasta que estén ligeramente blandas al exprimirlas, luego déjelas enfriar.", "Cuando esté frío, corte cada patata por la mitad a lo largo y luego en cuartos. Corte un poco de la carne, dejando una capa de papa de al menos 5 mm / 1/4 pulgada de grosor en la piel. Cepille todo con el aceite restante.", "Coloque la polenta, el parmesano, el romero, la sal y una generosa molienda de pimienta negra en un bol y mezcle. Agregue las papas engrasadas y mezcle con la mezcla de polenta. Sacuda cualquier exceso, luego coloque en una sola capa, con la piel hacia abajo, en un estante de alambre colocado en una bandeja de asar.", "Coloque en el horno y hornee durante 30 minutos, volteando hasta la mitad, hasta que estén crujientes y doradas.", "Para servir, corte las costillas en porciones de una sola costilla y acomódelas en un plato grande. Dispersar sobre las cebolletas. Sirva las pieles de papa y el mini maíz dulce en el costado o en tazones separados con muchas servilletas y cuencos para los dedos a mano para los dedos pegajosos."], "url": "www_bbc_co_uk_food_recipes_sweetandstickyribs_75147", "title": "Costillas dulces y pegajosas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Sirve 4 a 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de salsa de soja ligera", "4 cucharadas de jugo de limón", "2 cucharadas de jugo de naranja", "1 cucharadita de aceite de maní", "1-2 cucharaditas de azúcar en polvo (o al gusto)", "1-2 cucharadas de miel (al gusto)", "½ pepino pequeño, cortado a la mitad longitudinalmente, sin semilla y finamente picado", "1 chile verde, sin semillas, finamente picado", "1 cucharada de aceite de maní", "Filete de res 250 g / 9 oz, cortado en tiras de 5 mm / ¼ in", "1 cucharadita de vino de arroz Shaoxing o jerez seco", "pellizcar copos de chile seco triturado", "1 cucharadita de salsa de soja ligera", "pizca de pimienta blanca molida", "1 gran puñado de hojas de espinaca baby, lavadas", "2 cabezas pak choi, variedad de tallo verde, lavado y rebanado", "1 mango pequeño, pelado, sin hueso, carne picada finamente"], "method": ["Para el aderezo dulce y picante, mezcle la salsa de soja ligera, el jugo de limón, el jugo de naranja, el aceite de cacahuete, el azúcar impalpable y la miel en un tazón pequeño. Batir bien para combinar, luego agregar el pepino y el chile. Revuelva y reserve.", "Para la carne, caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue la carne y saltee por unos segundos. Agregue el vino de arroz o jerez y cocine por un minuto.", "Agregue las hojuelas de chile secas trituradas, la salsa de soja liviana y una pizca de pimienta blanca molida. Cocine por 1-2 minutos o hasta que la carne esté cocida a su gusto.", "Para servir, esparza la espinaca y el pak choi en rodajas sobre un plato para servir y coloca la carne de res en el centro. Rocíe el aderezo dulce y picante, espolvoree los mangos finamente picados y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sweetandtangychillib_89294", "title": "Carne de chile dulce y picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetandtangychillib_89294_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 rebanada de pan blanco crujiente", "25g / 1oz de mantequilla, derretida", "½ mango, pelado y rebanado", "1 cucharadita de azúcar en polvo", "1 lima, ralladura y jugo", "1 cucharada de crema doble", "azúcar glas, al polvo", "rodajas de limón"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Sumerja la rebanada de pan en la mantequilla derretida para cubrir y colocar en una bandeja para hornear. Cubra con el mango en rodajas y espolvoree con azúcar impalpable, ralladura de limón y jugo. Coloque en el horno y hornee durante cinco minutos.", "Retire del horno y coloque en un plato de servir. Rocíe con crema, polvo con azúcar glas y adornar con rodajas de limón. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sweetbakedmangoandli_88336", "title": "Dulce al horno y lima 'bruschetta'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de arándanos", "1 cucharada de azúcar en polvo", "4 huevos de gallinas camperas, separados", "3 cucharadas de azúcar en polvo", "25 g / 1oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "azúcar glas, al polvo"], "method": ["Precalentar una sartén pequeña a prueba de horno en el horno a 200C / 400F / Gas 6.", "Para el relleno, coloque los arándanos y el azúcar en una olla pequeña y cocine suavemente durante 3-4 minutos.", "Para la tortilla, coloca las claras de huevo en un tazón grande y bate hasta que estén firmes.", "Coloque las yemas de huevo y el azúcar en un recipiente aparte y bata hasta que estén espumosos.", "Vierta las claras de huevo en la mezcla de yema y dóblelas suavemente.", "Retire la sartén del horno y coloque la mantequilla y el aceite en la sartén para derretir, luego vierta la mezcla de huevo en la sartén.", "Vierta la mezcla de arándanos en el centro de la mezcla de huevo, transfiera al horno y hornee por 4-5 minutos, o hasta que se asienten.", "Para servir, retire la sartén del horno y espolvoree con azúcar glasé."], "url": "www_bbc_co_uk_food_recipes_sweetblueberryomelet_84806", "title": "Tortilla dulce de arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350-450 g / 12oz-1lb tomates cherry", "2-3 oz de queso mozzarella de búfala", "aceite de oliva, para aderezar", "sal marina gruesa y pimienta negra recién molida", "azúcar demerara, para rociar", "4 cuñas de limón", "Hojas de albahaca 50g / 2oz", "100ml / 3½fl oz de aceite de oliva"], "method": ["Precalienta la parrilla. Corta a la mitad los tomates cherry en posición horizontal, colocándolos en un plato o plato grande para servir muy poco profundo.", "Corta la mozzarella razonablemente delgada.", "Para hacer el aceite de albahaca, coloca las hojas de albahaca en un procesador pequeño. Caliente el aceite de oliva y vierta sobre las hojas.", "Sazone con sal y pimienta y mezcle la albahaca con un puré. Colar a través de un colador y dejar de lado.", "Rocíe aceite de oliva sobre los tomates, colocando una pepita de sal marina en cada mitad. Moler un poco de pimienta en la parte superior y espolvorear con azúcar. Coloque debajo de una parrilla caliente.", "Una vez que empiecen a chisporrotear, retírelos de la parrilla y coloque la mozzarella encima de los tomates.", "Vuelva a colocar el plato debajo de la parrilla, hasta que el queso se haya derretido.", "Sirva con aceite de albahaca y pan."], "url": "www_bbc_co_uk_food_recipes_sweetcherrytomatoesw_73831", "title": "Tomates cherry dulce con mozzarella de fusión", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina simple de 75g / 2¾oz", "3 yemas de huevo de gallinas camperas", "50ml / 2fl oz de leche entera", "1 naranja, jugo y ralladura", "3 claras de huevo de gallinas camperas", "1 cucharada de azúcar en polvo", "25 g / 1oz de mantequilla sin sal", "1 cucharada de azúcar glas, al polvo"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque la harina, las yemas de huevo, la leche, el jugo de naranja y la ralladura en un tazón limpio y bata hasta que los ingredientes se hayan combinado y la mezcla tenga una textura suave.", "Coloque las claras de huevo en un recipiente limpio y separado, bátalas hasta que se formen picos rígidos cuando se quite el batidor.", "Agregue el azúcar impalpable a las claras de huevo y continúe batiendo la mezcla hasta que tenga una textura brillante.", "Doble la mezcla de clara de huevo en la mezcla de yema de huevo y revuelva hasta que las dos mezclas se hayan combinado.", "Derretir la mantequilla en una sartén grande.", "Agregue un cucharón grande de la mezcla a la sartén y fría por dos minutos en cada lado, hasta que el panqueque esté dorado. Retire de la sartén. Repita este proceso con la masa restante hasta que toda la mezcla haya sido utilizada.", "Para servir, coloque los panqueques en una pila sobre un plato limpio y espolvoree con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_sweetcitruspancakeso_84813", "title": "Soufflé dulce panqueque de cítricos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9 oz de tofu", "1 diente de ajo, finamente picado", "½ cucharadita de hojuelas de chile seco", "1 cucharada de azúcar", "1 naranja, solo jugo", "1 cucharada de salsa de soja", "1 cucharadita de miel", "1 cucharada de aceite vegetal", "2 cucharadas de cilantro fresco picado", "200 g / 7 oz de soja", "½ manojo de berros, solo hojas", "2 cucharadas de menta fresca picada", "2 cucharadas de agua hirviendo", "8 tomates cherry", "2 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "sal al gusto", "1 cucharada de cilantro fresco picado, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el tofu, seca el tofu en papel de cocina y corta en cubos. Coloque el tofu en un recipiente no reactivo con el resto de los ingredientes de tofu, excepto el aceite y el cilantro, y mezcle bien. Deje marinar durante al menos diez minutos.", "Calentar el aceite en un wok y freír el tofu hasta que esté dorado y crujiente, alrededor de 5-7 minutos. Revuelva en el cilantro.", "Para el puré de soja, pula los frijoles en agua hirviendo hasta que estén tiernos, alrededor de 3-4 minutos. Escurra los frijoles y transfiéralos a un procesador de alimentos. Agregue el berro, la menta, el agua hirviendo y el pulso hasta que los frijoles estén en puré, pero no del todo lisos.", "Para los tomates balsámicos, coloque los tomates en una bandeja para hornear y rocíe sobre el aceite de oliva y el vinagre balsámico. Espolvorear con sal y colocar en el horno para asar durante 10-15 minutos.", "Para servir, coloque un lecho de puré de soja en un plato para servir y espolvoree el tofu marinado en la parte superior. Sirva los tomates balsámicos tostados a un lado y espolvoree sobre el cilantro picado."], "url": "www_bbc_co_uk_food_recipes_sweetchilligarlicora_88593", "title": "Tofu de chile dulce, ajo, naranja y cilantro en una soja, berros y puré de menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de maíz dulce", "3 cebolletas, muy finamente picadas", "3 huevos de gallinas camperas", "30 ml / 1 fl oz de leche", "Harina normal de 75 g / 2½ oz", "½ cucharadita de pimienta de cayena", "aceite vegetal, para freír", "sal y pimienta negra recién molida"], "method": ["Para hacer los buñuelos, ponga el maíz dulce y las cebolletas en un tazón. Batir los huevos con la leche. Vierta esta mezcla sobre el maíz dulce y mezcle bien. Condimentar con sal y pimienta. Tamiza la harina con la pimienta de cayena y luego revuelve en el maíz dulce.", "Agregue el aceite a una sartén grande; debe freírlos poco a poco, así que asegúrese de que la base de la sartén esté bien cubierta. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Caliente el aceite y luego pruebe añadiendo un poco de la mezcla, debería comenzar a burbujear inmediatamente cuando toca el aceite. Con un cucharón pequeño, vierta la mezcla en el aceite; necesita alrededor de 2 cucharadas de mezcla por buñuelo. Deberías poder freír 4-5 en cualquier momento. Freír por un par de minutos en un lado hasta que esté dorado claro, voltear y cocinar por un minuto más.", "Coloque la toalla en la cocina para eliminar el exceso de aceite y mantener el calor. Continúa hasta que hayas agotado toda la masa."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_46558", "title": "Buñuelos de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 10 buñuelos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500 g / 1 libra de maíz congelado 2 oz, descongelado", "½ cucharadita de copos de chile", "Harina normal de 200g / 7oz", "1 cucharadita de polvo de hornear", "2 huevos, golpeados", "150ml / 5fl de leche en oz", "sal y pimienta", "125g / 4½ oz de tocino, picado", "2 cucharadas de aceite de oliva", "Tomates 200g / 7oz, finamente cortados en cubitos"], "method": ["Coloque el maíz dulce y las hojuelas de chile en un tazón. Tamizar la harina y el polvo de hornear y mezclar.", "En un tazón pequeño o jarra, combine los huevos y la leche y sazone con una pizca de sal y pimienta. Vierta sobre el maíz dulce y la harina, y mezcle bien para que todo esté distribuido uniformemente.", "Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Freír el tocino en una sartén seca grande a fuego medio hasta que esté crujiente y coloreado. Una vez cocido, quítelo y ajústelo a un lado.", "Si hay pedazos quemados en la sartén, elimínelos. Agregue un poco de aceite de oliva a la sartén y agregue cucharadas soperas de la mezcla de maíz dulce a la sartén (tendrá que freírlas en lotes). Freír a fuego medio durante 1-2 minutos, o hasta que se coloreen, luego girar y repetir en el otro lado. Mantenga caliente en el horno precalentado mientras cocina la masa restante. Agregue un poco más de aceite a la sartén a medida que avanza para evitar que los buñuelos se peguen y para ayudarlos a colorear bien.", "Mientras tanto sazone el tomate finamente cortado en cubitos con sal y pimienta.", "Sirva los crujientes buñuelos de maíz dulce con el tocino y el tomate picado espolvoreado sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_with_42524", "title": "Buñuelos de maíz dulce con tocino crujiente y tomates", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo grande de gallinas camperas", "Harina de auto crianza de 75g / 2¾oz", "198g maíz dulce de hojalata, sin escurrir", "2 cebollas de primavera, cortadas y finamente rebanadas", "1 chile verde o rojo largo, finamente picado y sin semillas, si se prefiere", "Hojas frescas de cilantro de 25 g / 1 oz, finamente picadas", "½ cucharadita de sal marina en copos o ¼ cucharadita de sal fina", "pimienta negra recién molida", "1 cucharada de aceite de oliva extra virgen", "4 cucharadas de yogurt natural", "2 cucharaditas de salsa dulce de chile", "2 vides de tomates cherry, para servir", "hojas mixtas, para servir", "cuñas de lima, para exprimir", "75g / 2¾oz de col roja, muy finamente rallada", "1 zanahoria, pelada y rallada", "2 cebollas de primavera, cortadas y finamente rebanadas", "½ lima, solo jugo"], "method": ["Rompa el huevo en un bol y agregue la harina y 2 cucharadas de agua. Batir con una cuchara de madera hasta que quede suave y espeso. Agregue el maíz dulce con el contenido líquido de la lata y agregue las cebolletas, el chile, el cilantro, la sal y mucha pimienta. Mezclar bien.", "Calienta la mitad del aceite en una sartén grande y antiadherente. Con cuidado, vierta 3 cucharadas grandes de masa dulce en la sartén, manteniendo los buñuelos a una distancia de 2-3 cm / ¾-1¼in. Aplanar ligeramente con el dorso de una cuchara. Cocine a fuego medio-alto durante 3-4 minutos, o hasta que la superficie de cada buñuelo parezca seca y colocada y la base esté ligeramente dorada.", "Voltee con una espátula y cocine en el otro lado por otros 2-3 minutos, o hasta que esté ligeramente dorado y cocido. Transfiera a un plato calentado, forrado con papel de cocina. Agregue el aceite restante a la sartén y cocine los 3 buñuelos restantes de la misma manera.", "Mientras los buñuelos se cocinan, mezcle el yogur con la salsa de chile. Para el repollo, mezcle el repollo, la zanahoria, la cebolleta y el jugo de lima en un tazón pequeño. Sirva los buñuelos con la salsa de yogurt de chile, col, tomates, hojas mezcladas y rodajas de limón para exprimir sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_fritters_with_76583", "title": "Buñuelos de maíz dulce con salsa de chile dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/sweetcorn_fritters_with_76583_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 baby sweetcorn", "3 mazorcas de maíz", "1-2 cucharaditas de vinagre de vino blanco", "2 cucharaditas de aceite de oliva virgen extra", "Filetes de salmón de 300 g / 10½ oz cortados en cubitos grandes", "4-5 aceite de oliva", "100 g / 3½ oz de sobrasada, cortada en trozos pequeños", "1 chile verde, en rodajas finas", "2 cebollas tiernas, ralladas", "2 cucharadas de cilantro fresco finamente picado", "1 lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Chargrill el maíz dulce bebé en una sartén de plancha para ablandar. Cortar en tiras y reservar.", "Corta el maíz de las mazorcas y colócalo en una bandeja para hornear. Tueste en el horno por 20 minutos, o hasta que esté cocido y tierno. Reserve una pequeña cantidad para la guarnición y agregue el resto a un procesador de alimentos. Agregue el vinagre y el aceite de oliva y mezcle hasta obtener una pasta. Condimentar con sal y pimienta.", "Para el salmón, sazone con sal y pimienta y agregue el aceite de oliva.", "Agregue un poco de aceite de oliva a una sartén colocada a fuego alto. Freír el salmón en todos los lados durante unos minutos, o hasta que esté cocido por fuera pero aún rosado en el medio. Dejar de lado. Agregue la sobrasada a la sartén y fría hasta que esté crujiente. Agregue los granos de maíz dulce reservados, retírelos del fuego y déjelos a un lado.", "Para servir, espolvorea un poco del puré de maíz en platos para servir. Agregue el salmón, luego cuchara sobre el maíz dulce y sobrisada.", "En un tazón, mezcle el maíz en rebanadas, el chile, las cebolletas y el cilantro. Agregue jugo de lima y aceite de oliva al gusto. Espolvorea sobre el salmón y sirve."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_pure_and_95179", "title": "Puré de maíz dulce y salmón asado con maíz a la brasa, maíz enano y sobrasada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash oil", "1 cebolla picada", "1 diente de ajo", "2 cucharaditas de jengibre rallado", "1-2 chiles picados", "½ pimiento rojo, picado", "½ pimiento verde, picado", "2 mazorcas de granos dulces, granos eliminados", "1 tomate grande, sin semillas, sin piel", "2 cucharadas de azúcar moreno oscuro", "2 cucharadas de vinagre de sidra", "½ cucharadita de sal", "Pimienta al gusto", "3 cucharadas de cilantro picado"], "method": ["Caliente el aceite en una sartén y cocine la cebolla, el ajo y el jengibre hasta que estén suaves.", "Agregue las otras verduras a la sartén y cocine, permitiendo que se evapore cualquier líquido.", "Agregue el resto de los ingredientes, excepto el cilantro. Cocine por cinco minutos.", "Agregue el cilantro y cocine por otro minuto. Transfiera a un recipiente esterilizado y deje enfriar."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_relish_14809", "title": "Sweetcorn condimento", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 1 jarra", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["25g / 1oz de mantequilla", "1 chalota de plátano, en rodajas", "1 cucharadita de polvo de curry mediano", "Maíz dulce de estaño 340g / 12oz", "75ml / 3fl oz de vino blanco", "Crema doble de 200 ml / 7 fl oz", "sal y pimienta negra recién molida", "2 cucharaditas de jugo de limón solamente", "100 g / 3½ onzas escogidas de carne de cangrejo blanca", "llovizna aceite de colza"], "method": ["Caliente una sartén grande hasta que esté medio caliente. Agregue la mantequilla, el chalote y el curry en polvo y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue el maíz dulce y todo el líquido de la lata y luego vierta el vino y suficiente agua para cubrir.", "Deje que hierva a fuego lento, agregue la mitad de la crema y luego sazone con sal y pimienta negra.", "Regrese la mezcla a ebullición, retire del fuego para que se enfríe un poco y luego transfiera a la licuadora. Sin embargo, dobla hasta que quede suave y devuelve la sopa a la sartén para calentarla.", "Haga un poco de crema agria batiendo la crema restante con el jugo de limón hasta que espese.", "Sirva la sopa en un tazón y luego cubra con un poco del cangrejo, una cucharada de la crema agria y un chorrito de aceite de colza."], "url": "www_bbc_co_uk_food_recipes_sweetcorn_soup_with_crab_97376", "title": "Sopa de maíz dulce con cangrejo y crema agria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de tocino rayado, picadas", "1 cucharadita de mantequilla derretida", "1 diente de ajo, picado", "1 cucharadita de harina común", "150ml / ¼ pinta de leche entera", "Crema doble 50ml / 2fl oz", "50g / 1¾oz de maíz dulce crudo", "6 almejas, cocidas al vapor durante 5 minutos (descartar cualquier sombrero que no se abra)", "sal y pimienta negra recién molida", "cebollín fresco, para adornar", "pan blanco crujiente grueso, para servir"], "method": ["Freír el tocino durante 2-3 minutos, agregar la mantequilla y el ajo y cocinar durante 1 minuto. Agregue la harina y revuelva bien.", "Poco a poco agregue la leche y la crema y mezcle bien. Agregue el maíz dulce y cocine a fuego lento hasta que espese.", "Agregue las almejas y vierta en un tazón. Adorne con cebollino y sirva con pan blanco crujiente."], "url": "www_bbc_co_uk_food_recipes_sweetcornandbaconcho_82153", "title": "Sopa de dulce de maíz y tocino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 2oz de mantequilla", "1 cebolla, pelada, picada", "1 diente de ajo, pelado, aplastado", "½ cucharadita de curry en polvo", "450g / 14oz de maíz en conserva estañado, escurrido", "600ml / 1 pinta 1½fl oz de caldo de pollo", "200g / 7oz de carne de cangrejo blanca", "Crema doble 250ml / 7fl oz", "½ limón, solo jugo", "½ lima, solo jugo", "2 cucharadas de hojas frescas de cilantro, para adornar", "125ml / 4½fl oz de agua", "50g / 2oz de mantequilla, cortada en cubitos", "Harina normal de 75g / 3oz", "2 huevos de gallinas camperas", "175g / 6oz de maíz en conserva estañado, escurrido", "3 cucharadas de hojas de cilantro fresco picado", "1 lima, solo jugo", "aceite vegetal, para freír"], "method": ["Para la sopa, caliente la mantequilla en una sartén grande hasta que haga espuma, luego fría la cebolla y el ajo junto con el polvo de curry durante 2-3 minutos, o hasta que se ablanden. Agregue el maíz dulce y freír durante un minuto más, luego vierta el caldo de pollo y cocine a fuego lento. Cocine por 2-3 minutos.", "Agregue la carne de cangrejo a la sartén y deje que hierva. Quítese el fuego inmediatamente, luego transfiéralo a un procesador de alimentos y mezcle hasta obtener un puré suave.", "Regrese la sopa a una sartén limpia a fuego medio-bajo. Agregue la crema, el limón y el jugo de lima, luego sazone con sal y pimienta negra recién molida. Mantener caliente", "Para los beignets, coloca el agua y la mantequilla en una sartén y deja hervir durante un minuto. Retirar del fuego e incorporar la harina inmediatamente, batiendo continuamente con una cuchara de madera hasta que la mezcla esté suave y se desprenda fácilmente del costado de la sartén.", "Regrese la sartén al fuego durante 1-2 minutos para que se caliente. Retire del fuego y agregue los huevos uno por uno, batiendo bien entre cada adición. Agregue el maíz dulce, el cilantro y el jugo de lima, mezclándolo hasta que esté bien combinado. Sazonar con sal y pimienta negra recién molida.", "Llene a la mitad una sartén profunda de base pesada con aceite vegetal y caliente a 180C / 355F (verifique con un termómetro digital. PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Ponga cucharaditas de la pasta de beignet en lotes en el caliente el aceite y fría por 2-3 minutos, o hasta que esté dorado y crujiente. Retire con una espumadera y escurra sobre papel de cocina. Repita con la mezcla de beignet restante.", "Para servir, ponga la sopa en cuencos para servir y coloque algunos beignets encima. Adorne con algunas hojas de cilantro."], "url": "www_bbc_co_uk_food_recipes_sweetcornandcrabsoup_91553", "title": "Sopa de cangrejo y cangrejo con beignets de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb de granos de maíz dulce", "2 pimientos rojos, sin semillas y en cubos", "1 cebolla roja, pelada y cortada finamente", "4 cucharadas de perejil fresco, picado", "2 cucharadas de aceite de oliva", "sal y pimienta"], "method": ["Caliente el aceite en una sartén grande y agregue la cebolla y los pimientos. saltee durante 2-3 minutos hasta que comience a ablandarse.", "Agregue el maíz dulce, sazone bien y mezcle. Baje el fuego, cubra y cocine suavemente hasta que los vegetales estén tiernos.", "Agregue el perejil picado y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_sweetcornandredpeppe_8824", "title": "Maíz dulce y pimientos rojos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8-10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "¼ de cebolla, finamente picada", "200 ml / 7 fl oz de caldo de pollo (los vegetarianos pueden sustituirlo con caldo de verduras)", "¼ de pimiento rojo, cortado en cubitos", "½ chile rojo, cortado en cubitos", "½ lata de maíz dulce", "sal y pimienta negra recién molida", "Mangetout 25g / 1oz, picado", "1½ cucharada de perejil de flatleaf, picado", "Crema doble 140ml / 5oz"], "method": ["Calentar el aceite en una olla. Agregue la cebolla y cocine durante cinco minutos, hasta que se ablanden.", "Agregue los ingredientes restantes, a excepción del perejil y la crema, lleve a ebullición, reduzca el fuego y cocine a fuego lento durante otros cinco minutos.", "Agregue el perejil y la crema y caliente antes de servir."], "url": "www_bbc_co_uk_food_recipes_sweetcornchowder_78954", "title": "Sopa de dulce de maíz", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 oreja de maíz dulce, los granos se eliminan con un cuchillo afilado", "2 huevos de gallinas camperas, golpeados", "2 cucharadas de harina normal", "2 cucharadas de leche", "sal y pimienta negra recién molida, al gusto", "2 cucharadas de aceite de oliva", "1 oreja de maíz dulce, los granos se eliminan con un cuchillo afilado", "1 tomate, sin semillas y picado", "¼ de cebolla roja, finamente picada", "1 lima, solo jugo", "3 cucharadas de cilantro fresco picado"], "method": ["Para los buñuelos, coloque todos los ingredientes del buñuelo excepto el aceite en un tazón y mezcle bien.", "Calentar el aceite de oliva en una sartén y freír cucharadas de la mezcla durante 2-3 minutos en ambos lados, o hasta que estén doradas y crujientes. Escurrir sobre papel de cocina.", "Para la salsa, mezcle todos los ingredientes de la salsa en un tazón pequeño.", "Para servir, coloca el tazón de salsa en el medio de un plato de servir y coloca los buñuelos alrededor."], "url": "www_bbc_co_uk_food_recipes_sweetcornfritters_90748", "title": "Buñuelos de maíz dulce con salsa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]