[{"ingredients": ["5 huevos de gallinas camperas, más 1 yema de huevo", "250 g de carne de res o cordero picada", "2 dientes de ajo, pelados, aplastados", "Jengibre de raíz de 2.5cm / 1in, pelado, rallado", "½ cucharadita de cilantro molido", "½ cucharadita de comino molido", "½ cucharadita de chile en polvo", "¼ cucharadita de clavo de olor molido", "1 cucharada de harina de maíz", "sal", "2 cucharadas de harina", "2 cucharadas de semillas de sésamo", "aceite vegetal para freír poco"], "method": ["Ponga a hervir una olla grande de agua y cocine 4 de los huevos durante 4-5 minutos hasta que estén hervidos a fuego medio. Escurrir y enfriar con agua corriente fría (esto evitará que las yemas se decoloren). Pelar y reservar. Batir el huevo restante en un recipiente y dejarlo a un lado.", "En un tazón, mezclar la carne picada, el ajo, el jengibre, las especias, la harina de maíz y la yema de huevo hasta que estén bien combinados. Sazonar, al gusto, con sal.", "Divida la mezcla de carne de manera uniforme en 4 porciones. Enrolle cada porción en una bola, luego aplánela para formar una empanada fina. Envuelva cada empanada alrededor de los huevos duros pelados, alisando la unión y asegurándose de que no quede ningún huevo expuesto.", "Enrolla los huevos escoceses en la harina, luego sumerge el huevo batido y revuelve las semillas de sésamo.", "Llene a la mitad una sartén con aceite vegetal y caliente hasta que esté caliente. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír los kebabs Nargis en pequeños lotes durante 4-5 minutos, revolviendo los huevos de vez en cuando, o hasta que estén dorados por todos lados y cocidos. Retirar del aceite con una cuchara ranurada y escurrir sobre papel de cocina."], "url": "www_bbc_co_uk_food_recipes_nargiskebabs_93344", "title": "Nargis kebabs", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, pelados", "nuez moscada pizca", "¼ cucharadita de pimienta negra recién molida", "½ cucharadita de cúrcuma molida", "2 chalotes, pelados", "Cacahuetes sin sal 25g / 1oz", "1 cucharadita de sal", "3 chiles de ojo de pájaro, semillas retiradas", "1 cucharada de azúcar de palma", "1-2 cucharadas de aceite vegetal, o más si es necesario", "2 cucharadas de aceite de verdura o maní, más extra para freír los huevos", "2 pechugas de pollo, sin piel, cortadas en tiras finas", "Gambas, cabezas y cáscaras de 200 g / 7 oz retiradas y sin nervaduras", "Frijoles verdes finos de 110g / 4oz, cortados y cortados en pedazos de 1cm / ½ en trozos", "4 cebolletas, en rodajas", "275g / 10oz de arroz cocido de grano largo (debe estar frío)", "splash light salsa de soja", "splash ketjap manis (salsa de soya indonesia)", "4 huevos de gallinas camperas", "½ pepino, pelado, sin semillas, finamente cortado en cubitos", "1 cucharada de cilantro picado", "Cacahuetes de 50g / 2oz", "1 lima, cortada en cuñas", "puñado de chalotes crujientes fritos", "Aceite de chile al estilo asiático, para servir"], "method": ["Para la pasta de especias, mezcle todos los ingredientes de la pasta de especias en un procesador de alimentos. Agregue suficiente aceite para juntar la mezcla como una pasta suelta. Dejar de lado.", "Para sofreír, caliente el aceite en un wok a fuego alto hasta que esté reluciente, luego agregue el pollo y fría por un minuto más o menos, luego agregue la pasta de especias y las gambas y revuelva bien, cocinando para un buen 4-5 minutos.", "Agregue los frijoles y las cebollas tiernas y fría por otro minuto, manteniendo todo en movimiento.", "Agregue el arroz cocido y revuelva hasta que se haya incorporado todo: puede agregar algunas cucharadas de agua en este punto si se vuelve un poco seco y comienza a pegarse. Sazonar con salsa de soja y ketjap manis, al gusto.", "Calentar un poco del aceite en una sartén grande a fuego medio y freír los huevos hasta que estén crujientes en los bordes y cocinar a su gusto.", "Para servir, divida la salteada entre dos tazones, coloque dos huevos encima y espolvoree los ingredientes de la guarnición. Sirva con el aceite de chile en un lado, para rociar."], "url": "www_bbc_co_uk_food_recipes_nasi_goreng_69542", "title": "Arroz frito (arroz frito de estilo indonesio)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 dientes de ajo, aplastados", "1 cucharadita de granos de pimienta blanca triturada", "1 cucharada de azúcar granulada", "1 cucharada de salsa de pescado tailandesa", "1 lima, solo jugo", "500g / 1lb 2 oz de muslos de pollo deshuesados, cortados en tiras de 2,5 cm / 1 in", "2 cucharadas de aceite vegetal", "4 dientes de ajo gordos, toscamente picados", "50g / 2 oz chalotes, más o menos picados", "Cacahuetes salados asados ​​25g / 1oz", "6 chiles rojos a fuego medio, picados", "1 cucharadita de blachan (pasta de camarones)", "1 cucharadita de sal", "300g / 10½oz de arroz de grano largo", "aceite de girasol, para freír", "6 chalotes grandes, en rodajas finas", "2 huevos grandes de gallinas camperas", "sal y pimienta negra recién molida", "1 cucharada de puré de tomate", "1 cucharada de salsa de soja dulce", "1 cucharada de salsa de soja ligera", "Pepino de 5cm / 2 en pieza, cortado en cuartos a la mitad, en rodajas", "8 cebolletas, cortadas, finamente cortadas en diagonal", "sal y pimienta negra recién molida"], "method": ["Para el pollo a la barbacoa, mezcle el ajo machacado, los granos de pimienta blanca triturados, el azúcar, la salsa de pescado y el jugo de lima en un bol. Agregue las piezas de pollo y colóquelas en el refrigerador para marinar durante al menos 2 horas o toda la noche.", "Para cocinar el pollo, pase las piezas de pollo marinado por pares paralelos de los pinchos de bambú empapados (esto ayuda a evitar que las piezas giren a medida que las gira).", "Precaliente la parrilla a su nivel más alto (o prepare la barbacoa).", "Ase los pinchos de pollo durante 6-7 minutos, volteándolos regularmente, hasta que estén dorados y caramelizados por fuera y cocidos (no debe quedar ningún rastro de color rosa).", "Deslice el pollo a la barbacoa de los pinchos, cortar en trozos y reservar.", "Para la pasta de especias, mezcle todos los ingredientes de la pasta de especias en un procesador de alimentos hasta obtener una pasta homogénea.", "Para el nasi goreng, cocine el arroz en agua hirviendo con sal durante 12-15 minutos, o de acuerdo con las instrucciones del paquete, hasta que esté tierno. Escurra, enjuague bien con agua hirviendo de la tetera y drene nuevamente.", "Extienda el arroz en una bandeja grande para hornear y déjelo a un lado hasta que esté frío (pero no lo refrigere).", "Caliente 1 cm / ½ pulgada del aceite de girasol en una sartén grande y profunda hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje desatendido). Agregue las chalotas en rodajas y las alevines poco profundas, revolviendo de vez en cuando, hasta que estén crujientes y doradas. Retire las cebollas de la sartén con una espumadera y déjelas a un lado para que drene un montón de papel de cocina. Espolvorear ligeramente con sal y reservar hasta que esté frío y crujiente.", "Batir los huevos en un bol con un poco de sal y pimienta negra recién molida.", "Calentar un par de cucharadas de aceite de girasol en una sartén pequeña a fuego medio-alto, verter un tercio del huevo batido y cocinar hasta que se haya puesto encima.", "Dale la vuelta al huevo, fríelo por unos segundos más y luego ponlo sobre una tabla de cortar o un plato, arrángalo bien y déjalo a un lado hasta que esté frío. Repita el proceso dos veces más con el huevo restante.", "Cuando los rollos de huevo estén fríos, córtelos en tiras finas.", "Caliente un wok a fuego alto hasta que esté humeante. Agregue dos cucharadas soperas del aceite sobrante de freír las chalotas, luego agregue la pasta nasi goreng y saltee durante 1-2 minutos, o hasta que esté fragante.", "Agregue el puré de tomate y el ketjap manis y saltee por unos segundos, luego agregue el arroz cocido y saltee durante 2-3 minutos o hasta que se caliente.", "Agregue los trozos de pollo asado, los chalotes fritos y las tiras de tortilla y saltee por otro minuto.", "Agregue la salsa de soja, el pepino y la mayoría de las cebolletas y mezcle bien.", "Para servir, cuchara el nasi goreng en una fuente grande y caliente. Espolvoree sobre las cebolletas restantes y permita que las personas se ayuden a sí mismas."], "url": "www_bbc_co_uk_food_recipes_nasi_goreng_with_lime_87031", "title": "Nasi goreng con limón y azúcar a la barbacoa pollo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nasi_goreng_with_lime_87031_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Leche de coco de estaño 400ml", "pieza del tamaño del pulgar jengibre fresco de raíz, pelado y finamente picado", "1 tallo de limoncillo", "350g / 12oz de arroz basmati", "sal", "1 pieza de hoja pandan, atada en un nudo, para servir", "2 cucharadas de aceite vegetal", "1 cebolla, finamente rebanada", "1 diente de ajo, finamente picado", "1 cucharadita de pasta de camarón", "1-2 cucharaditas de ají rojo en pasta", "Anchoas secas a 250 g / 9 oz, remojadas en agua y escurridas", "1 cucharada de azúcar en polvo", "250ml / 9fl oz de pasta de tamarindo mezclada con 400ml / 13fl oz de agua", "1 huevo de gallinas camperas", "aceite vegetal para freír", "puñado de pequeñas anchoas blancas secas", "cacahuetes manoseados, con la piel puesta si es posible", "½ pepino, en rodajas finas"], "method": ["Coloque la leche de coco, el jengibre, el limoncillo, el arroz y una pizca de sal en una cacerola grande. Agregue 400 ml / 14 fl oz de agua, mezcle y cocine a fuego medio durante 10-15 minutos, o hasta que el arroz esté cocido y todo el líquido haya sido absorbido.", "Para hacer el sambal, caliente el aceite en una sartén y sude la cebolla y el ajo durante 5-7 minutos, hasta que estén blandos. Agregue la pasta de camarones, la pasta de chile y la mayoría de las anchoas empapadas y revuelva. Agregue el azúcar y una pizca de sal y vierta el agua de tamarindo. Cocine a fuego lento hasta que se reduzca a una pasta espesa. Dejar de lado.", "Mientras tanto, para preparar la guarnición, hierva los huevos en agua durante 7-10 minutos; las yemas deben ser firmes. Cuando estén lo suficientemente fríos para manipularlos, quíteles las cáscaras y córtelos a la mitad. Precalienta el aceite en una freidora a 180 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír las anchoas blancas secas durante 3 minutos o hasta que estén crujientes. Tueste los cacahuetes en una sartén seca.", "Elija la hierba de limón del arroz y deséchela. Pon el arroz en un tazón pequeño y presiona hacia abajo hasta que esté compactado. Unturn el arroz en el medio de la hoja pandan. Coloque el huevo, los cacahuetes, el pepino y las anchoas restantes alrededor del arroz y esparza sobre las anchoas crujientes."], "url": "www_bbc_co_uk_food_recipes_nasi_lemak_58791", "title": "Nasi lemak", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de cordero de 1,2 kg / 2½ lb, cortado en cubos de 7,5 cm / 3 in", "1½ cucharada de harina", "4 cucharaditas de aceite vegetal", "1 cebolla, pelada, picada", "1 cabeza de ajo entera, cortada por la mitad horizontalmente", "350ml / 12fl oz de vino blanco", "300g / 10½oz de tomates picados enlatados", "3-4 ramitas de tomillo fresco, solo hojas", "3-4 ramitas de romero fresco, solo hojas", "500ml / 17fl oz de cordero frío o caldo de pollo", "450g / 1lb de verduras de temporada mezcladas, peladas, cortadas en pedazos de igual tamaño", "50g / 2oz de mantequilla", "200-250 g / 7-9 onzas de puré de papas, para servir"], "method": ["Espolvorea la harina en un plato y draga los cubos de cordero hasta que estén completamente cubiertos.", "Caliente una cucharadita de aceite vegetal en una cazuela grande de base pesada a fuego medio. Agregue un tercio de los cubos de cordero y fríe durante 6-8 minutos, revolviendo ocasionalmente, hasta que estén dorados por todos lados, teniendo cuidado de no sobrecargar la sartén. Retire de la sartén con una cuchara ranurada y déjelo a un lado en un plato caliente.", "Repita el proceso dos veces más con las dos cucharaditas más de aceite y los lotes restantes de cubos de cordero hasta que todo el cordero esté dorado.", "Agregue la cucharadita restante de aceite a la sartén en la que se cocinó el cordero y caliente a fuego medio Agregue las cebollas y el ajo y fría por 4-5 minutos, o hasta que estén doradas.", "Agregue el vino y lleve la mezcla a fuego lento. Continúe cocinando a fuego lento durante 6-8 minutos o hasta que el volumen del líquido se haya reducido a la mitad.", "Cuando el vino se haya reducido, agregue los tomates picados y las hierbas y mezcle bien. Regrese la mezcla a fuego lento, luego continúe cocinando a fuego lento durante 4-5 minutos o hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue el caldo frío y las piezas de cordero doradas reservadas (agregue un poco más de agua si el caldo no cubre las piezas de cordero).", "Caliente el contenido de la sartén hasta que esté hirviendo a fuego lento, tape la olla y cocine a fuego lento durante 1 hora y media, revolviendo ocasionalmente, o hasta que la salsa se espese y el cordero esté tierno.", "Mientras tanto, para las verduras, cocine las verduras durante 2-3 minutos en una sartén de agua hirviendo con sal. Escurrir bien.", "Caliente la mantequilla en una sartén a fuego alto. Agregue las verduras blanqueadas y fría por 1-2 minutos, o hasta que la mantequilla se haya derretido y cubierto las verduras, y las verduras estén tiernas.", "Para servir, divida el puré de patatas en partes iguales entre cuatro platos para servir. Cuchara sobre el navarin de cordero. Cubra con las verduras mixtas cocidas."], "url": "www_bbc_co_uk_food_recipes_navarinoflamb_91968", "title": "Navarin de cordero", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de sultanas", "2 cucharaditas de vinagre de moscatel", "1 rebanada de pan blanco", "4 cucharadas de perejil de flatillo finamente picado", "1 cucharada de alcaparras, escurridas, finamente picadas", "2 anchoas, escurridas, finamente picadas", "1 huevo, duro, solo blanco cocido, finamente picado", "½ cucharada de semillas de hinojo", "110g / 4oz N'duja (salchicha de cerdo francesa untable)", "Brócoli 300 g / 11 oz, lavado y recortado en florecillas", "4 x 175 g / 6oz de filetes de bacalao", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, finamente cortado en juliana", "1 chile rojo, finamente cortado en juliana", "1 cucharada de piñones"], "method": ["Remojar las sultanas durante la noche en el vinagre.", "Al día siguiente, quite las sultanas del vinagre con una espumadera y déjelas a un lado. Remoje la rebanada de pan en el mismo vinagre. Cuando esté empapado, exprima cualquier exceso de líquido.", "Batir el pan empapado, el perejil, las alcaparras, las anchoas, la clara de huevo cocida, las semillas de hinojo y N'Duja en un almirez y el mortero hasta obtener una pasta.", "Extienda la pasta entre dos hojas de papel resistente a la grasa y enfríe en el refrigerador hasta que esté firme.", "Precalentar el horno a 200C / 400F / Gas 6.", "Blanquee los brotes de brócoli en una sartén de agua hirviendo con sal durante 3-4 minutos o hasta que estén tiernos. Escurrir bien y reservar para enfriar.", "Cuando la pasta se haya endurecido, sazone los filetes de bacalao por ambos lados con sal y pimienta negra recién molida. Corta la capa de pasta en cuatro piezas del mismo tamaño que cada filete de bacalao. Coloque uno encima de cada trozo de bacalao.", "Coloque los filetes de bacalao en costra N'duja en una bandeja para hornear y tueste en el horno durante 6-8 minutos.", "Mientras tanto, caliente una cucharada de aceite de oliva virgen extra en una sartén y fría el ajo y el chile hasta que el ajo esté dorado. Agregue los granos de pino, sultanas remojadas reservadas y el brócoli y saltee durante 1-2 minutos, o hasta que estén bien calientes. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, vierta la mezcla de brócoli en el centro de cuatro platos para servir. Coloque un filete de bacalao en costra N'duja encima de cada porción.", "En un recipiente, mezcle los jugos de la sartén y la cucharada restante de aceite de oliva hasta que se emulsionen (bien combinados). Rocíe la salsa sobre el bacalao."], "url": "www_bbc_co_uk_food_recipes_nduja-crusted_cod_with_15828", "title": "N'duja con costra de bacalao con brócoli", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800 g / 1 libra 12 oz harina 00", "Harina de sémola de 200g / 7oz", "1 cucharada de azúcar en polvo", "1 cucharadita de sal", "1 x 7 g bolsita de levadura de acción rápida", "650 ml / 1 pinta 2fl oz de agua tibia", "4 cucharadas de aceite de oliva virgen extra", "1 x 400 g de tomates de hojalata, preferiblemente San Marzano, mezclados a un puré", "400g / 14oz de queso mozzarella, desgarrado en pedazos", "300g / 10½oz 'nduja salchicha", "1 gran puñado de hojas frescas de albahaca", "1 cucharada de aceite vegetal"], "method": ["Para la masa de pizza, tamice las harinas, el azúcar y la sal en un tazón grande y mezcle bien. Mezcle la levadura y un poco de agua en una jarra pequeña.", "Haga un pozo en el centro de los ingredientes secos y agregue la pasta de levadura. Vierta gradualmente sobre el resto del agua tibia, llevando los ingredientes secos al centro poco a poco, hasta que la mezcla se una como una masa suave.", "Voltee la masa sobre una superficie de trabajo ligeramente engrasada y amasar durante 5-10 minutos, hasta que quede suave y elástica. Coloque la masa en un tazón grande y limpio y cubra con una toalla de té húmeda y limpia. Reserve en una habitación cálida para probar durante 1 hora y media.", "Cuando la masa casi ha duplicado su tamaño, arrójalo golpeándolo y amasándolo un poco, y luego divídelo en 4-6 bolas iguales (dependiendo de la cantidad de pizzas que quieras hacer).", "Coloque las bolas de masa en una bandeja para hornear ligeramente engrasada, bien separadas, y cúbralas con una lámina de película adhesiva ligeramente engrasada. Reserve para probar nuevamente, durante al menos 4 horas (en una habitación cálida) o durante la noche (en la nevera).", "Cuando las bolas de masa hayan duplicado su tamaño nuevamente, precaliente el horno a su configuración más alta. Coloque una bandeja para hornear pesada o una piedra para pizza en el horno para calentar.", "Ruede una de las bolas de masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 0.5cm / ¼ de pulgada. Espolvoree un poco de harina en una bandeja de hornear volteada y transfiera la base de la pizza sobre ella.", "Ponga un poco de la mezcla de tomate en el centro de la base de la pizza, extendiéndola casi hasta los bordes. Espolvoree un poco de queso mozzarella, salchichas ndjua y hojas de albahaca en la pizza, luego rocíe sobre el aceite de maní.", "Trabajando lo más rápido posible, mueva la pizza al horno deslizándola desde la bandeja hacia arriba sobre la piedra para pizza o la bandeja para hornear caliente. Cocine por 5-8 minutos, o hasta que la base esté cocida, el queso se haya derretido y los tomates estén burbujeando.", "Mientras tanto, repita el proceso con las bases de pizza restantes, sirviendo cada pizza de inmediato."], "url": "www_bbc_co_uk_food_recipes_nduja_and_mozzarella_49902", "title": "'Nduja y pizza mozzarella", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Rinde 4-6 pizzas grandes", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10oz de patatas nuevas", "2 cucharadas de aceite vegetal", "1 cebolla, en rodajas", "75g / 3oz 'nduja (disponible en tiendas de delicatessen italianas y en línea especializadas)", "1 chile rojo, picado", "200g / 7oz de jamón serrano, picado", "1 cucharada de alcaparras", "100 g / 3½ oz de mantequilla", "8 huevos de gallinas camperas", "4 rebanadas de pan francés", "1 cucharada de perejil fresco picado", "salsa de chile"], "method": ["Coloque las papas nuevas en una cacerola, llénelas con agua y deje que hiervan. Baje el fuego y cocine a fuego lento hasta que las papas estén tiernas. Escurrir y apartar.", "Caliente una cucharada de aceite en dos sartenes pesadas colocadas a fuego medio. Divida la cebolla entre las dos bandejas y fríela suavemente durante 10 minutos o hasta que esté suave y dorada.", "Agregue la mitad del nduja y el chile a cada sartén y cocínelos durante tres minutos. Agregue la misma cantidad de jamón Serrano y cocine por otros tres minutos.", "Agregue la mitad de las papas, las alcaparras y la mantequilla a cada sartén. Deje que las papas se doren, siga girándolas de vez en cuando con una espátula hasta que estén crujientes.", "Haga dos agujeros en la mezcla en cada bandeja. Agriete dos huevos en cada hoyo, cúbralos con una tapa y cocínelos durante tres minutos hasta que los prepare.", "Mientras tanto, tuesta el pan en una sartén hasta que quede crujiente.", "Coloque el hash en cuatro platos, dándole a cada persona dos huevos y espolvoree sobre el perejil. Sirva con la tostada y la salsa de chile al costado."], "url": "www_bbc_co_uk_food_recipes_nduja_and_potato_hash_45320", "title": "Nduja y hash de papa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nduja_and_potato_hash_45320_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina de sémola de 200g / 7oz", "800g / 1lb 12oz tipo '00' harina, más extra para quitar el polvo", "1 cucharada de azúcar en polvo", "1 cucharadita de sal", "650ml / 1 pinta 3fl oz de agua tibia", "1 x 7 g de bolsita de levadura fresca", "1 x 400 g puede ciruela tomates, preferiblemente San Marzano", "Queso de oveja 400 g / 14 oz, desmenuzado", "300g / 11oz 'nduja (salchicha italiana picante suave, disponible en delicatessen o especialistas en línea)", "1 gran puñado de hojas frescas de albahaca", "1 cucharada de aceite de maní"], "method": ["Para la masa de pizza, tamice las harinas, el azúcar y la sal en un tazón grande y mezcle bien.", "Mezcle la levadura y un chorrito del agua hasta formar una pasta en una jarra pequeña.", "Haga un pozo en el centro de los ingredientes secos y agregue la pasta de levadura. Vierta gradualmente sobre el resto del agua tibia, llevando los ingredientes secos al centro poco a poco, hasta que la mezcla se una como una masa suave.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amasar durante 5-10 minutos, hasta que quede suave y elástica. Coloque la masa en un tazón grande y limpio y cubra con una toalla de té húmeda y limpia. Reserve en una habitación cálida para probar durante 1 hora y media.", "Cuando la masa casi ha duplicado su tamaño, arrójelo golpeándolo y amasándolo un poco, luego divídalo en cuatro bolas iguales.", "Coloque las bolas de masa en una bandeja para hornear ligeramente engrasada, bien separadas, y cúbralas con una lámina de película adhesiva ligeramente engrasada. Reserve para probar nuevamente, durante al menos cuatro horas (en una habitación cálida) o durante la noche (en la nevera).", "Cuando las bolas de masa hayan duplicado su tamaño nuevamente, precaliente el horno a su configuración más alta. Coloque una bandeja para hornear pesada o una piedra para pizza en el horno para calentar con ella.", "Ruede una de las bolas de masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 0.5cm / ¼ de pulgada. Espolvoree un poco de harina en una bandeja de hornear volteada y transfiera la base de la pizza sobre ella.", "Para el relleno, mezcle los tomates enlatados con un puré en un procesador de alimentos. Coloque una cucharada de la mezcla en el centro de la base de la pizza, extendiéndola casi hasta los bordes.", "Espolvoree algunas de las hojas de queso, nduja y albahaca de las ovejas en la pizza, luego rocíe sobre el aceite de maní.", "Trabajando lo más rápido posible, coloque la pizza en el horno empujándola desde la bandeja hacia arriba sobre la piedra para pizza o la bandeja para hornear caliente. Cocine por 5-8 minutos, o hasta que la base esté cocida, el queso se haya derretido y los tomates estén burbujeando.", "Mientras tanto, repita el proceso con las tres bases de pizza restantes y el resto del relleno, sirviendo cada pizza de inmediato."], "url": "www_bbc_co_uk_food_recipes_nduja_sausage_and_sheeps_56588", "title": "'Nduja salchicha y pizza de queso de oveja", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Hace 4 pizzas grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/nduja_sausage_and_sheeps_56588_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina lisa fuerte", "1 cucharadita de sal", "1 cucharadita de levadura fresca", "325ml / 11fl oz de agua tibia", "300g de tomates de ciruela enlatados", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva virgen extra", "30g / 1oz de queso parmesano, recién rallado", "algunas hojas de albahaca fresca o un poco de orégano seco", "Mozzarella 140g / 5oz, más o menos picada", "aceite de oliva virgen extra, para lloviznar", "1 diente de ajo, finamente picado", "1 ramita de romero, picada", "30g / 1oz taleggio, rallado", "2 rebanadas de mota", "½ calabacín en rodajas", "¼ de berenjena, en rodajas", "1 rebanada de jamón", "puñado de cohetes hojas"], "method": ["Precalentar el horno a 250C / 500F / Gas 9.", "En un tazón grande, coloque la harina y la sal juntas. Disuelva la levadura en agua tibia y agregue gradualmente a la harina. Mezcle bien hasta que obtenga una masa. Si encuentra la masa demasiado pegajosa, solo agregue un poco de harina.", "Forme la masa en forma de bola y déjela reposar cubierta con un paño durante 5 minutos. Después de este tiempo, encontrarás que la masa es mucho más flexible para trabajar. Amasar la masa y dividir en dos. Amasar cada pieza durante un par de minutos cada una y formar bolas. Espolvoree un poco de harina sobre un paño limpio de cocina y coloque la masa sobre ella con un paño ligeramente humedecido. Dejar crecer en un lugar cálido durante 30 minutos.", "Coloque los tomates en un recipiente y aplaste ligeramente, agregue sal y pimienta y mezcle bien.", "Espolvoree un poco de harina en una superficie de trabajo limpia y con los dedos extienda la masa en una forma más o menos redonda con un borde. Haga la masa tan delgada como un panqueque, pero tenga cuidado de no partir la masa. Espolvoree algunas migas de pan en dos bandejas grandes para hornear y coloque las bases para pizza sobre ellas.", "Extienda un poco del tomate de manera uniforme sobre cada base, no demasiado, ya que la pizza se mojará. Rocíe con aceite de oliva, espolvoree queso parmesano, agregue unas hojas de albahaca o espolvoree un poco de orégano y cubra con trozos de queso mozzarella. Luego agregue el relleno de su elección.", "Coloque en el horno caliente durante 7 minutos (un par de minutos más si prefiere que su pizza esté crujiente). Retire del horno, rocíe con un poco de aceite de oliva y cómalo inmediatamente; las pizzas no son muy buenas ni recalentadas."], "url": "www_bbc_co_uk_food_recipes_neapolitanstylepizza_67358", "title": "Pizza de estilo napolitano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 2 pizzas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva virgen extra, más extra para engrasar", "5 dientes de ajo, pelados, picados", "2 ramitas de romero fresco, solo hojas, picadas", "800 g / 1 libra de 12¼ oz de conservas de frijoles cannellini, escurridos, enjuagados", "Avellanas sin cáscara de 50g / 2oz, tostadas, sin piel", "sal y pimienta negra recién molida", "Repollo negro de 250-300 g / 9-10½ oz, sin tallos", "1,2 kg / 2 lb 10¼ oz de filetes de cordero, cada uno con mariposa y luego batidos a 15 cm x 30 cm x 2 cm / 6 pulgadas x 12 pulgadas x 1 en rectángulos usando un mazo de carne"], "method": ["Precalentar el horno a 220C / 430F / Gas 7.", "Calentar el aceite en una cacerola a fuego medio y freír el ajo y el romero durante 2-3 minutos. Una vez que el ajo esté pálido dorado, agregue los frijoles escurridos. Continúe calentando, revolviendo regularmente, durante 10-12 minutos, o hasta que los granos comiencen a descomponerse.", "Agregue las avellanas y sazone, al gusto, con sal y pimienta negra recién molida. Mash la mezcla ligeramente, con un tenedor, luego cuchara en un plato y dejar de lado para enfriar.", "Blanquee el cavolo nero en una sartén de agua hirviendo con sal durante cuatro minutos. Drene bien y, cuando esté lo suficientemente frío como para manipularlo, apriete suavemente para eliminar el exceso de agua.", "Coloque cada rectángulo aplanado de filete de cuello en una gran pieza de película y sazone, al gusto, con sal y pimienta negra recién molida. Disponga una capa de hojas de cavolo nero en cada filete de cuello y divida la mezcla de frijoles entre ellas. Mójese las manos y, utilizando los planos de sus palmas, presione la mezcla hacia abajo para formar una capa compacta y uniforme.", "Comenzando con el borde corto del rectángulo de cordero, enrolle suavemente el cordero con suavidad pero con firmeza, usando la película adhesiva para mantener la forma firme y pareja, hasta que el cordero forme un rollo ordenado.", "Retire la película adhesiva y ate 3-4 pedazos de cuerda alrededor de cada filete de cordero para mantenerlo en su lugar. (NB: Si hace la preparación por adelantado, cubra el cordero enrollado con film transparente y guárdelo en el refrigerador durante la noche. Retire del refrigerador 3-4 horas antes de cocinarlo).", "Coloque los filetes de cordero rellenos en una bandeja para hornear ligeramente engrasada y sazone, al gusto, con sal y pimienta negra recién molida. Transfiera al horno y cocine en el estante superior durante 20-25 minutos (para el medio) o hasta que esté cocido a su gusto. Una vez cocinado, retíralo del horno, cúbrelo con papel de aluminio y déjalo reposar por lo menos durante 10 minutos.", "Para servir, esculpe el cordero enrollado y relleno en rodajas y divida las rebanadas por igual entre seis platos para servir."], "url": "www_bbc_co_uk_food_recipes_neckoflambstuffedwit_92664", "title": "Cuello de cordero relleno de frijoles cannellini y avellanas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neckoflambstuffedwit_92664_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 kg / 2¼ lb de extremo scrag del cordero, en el hueso o las chuletas del extremo del cuello, o ambos", "jugo de 1½ limones, más una pequeña corteza delgada", "6-8 ramitas de tomillo", "un vaso de vino de agua o caldo de cordero", "sal y pimienta negra molida", "pan blanco", "Ensalada de tomate y cebolla de estilo griego"], "method": ["Calentar el aceite en una cacerola de base pesada. Agregue el cordero y deje que chisporrotee y escupir, volteándolo ocasionalmente hasta que se dore ligeramente por todas partes.", "Agregue el jugo de limón, tomillo, agua o caldo, un poco de sal y mucha pimienta. Llevar a ebullición, luego baje el fuego a fuego lento y coloque una tapa en la sartén. Cocine suavemente, volteando la carne de vez en cuando, durante aproximadamente 50 minutos, hasta que la carne esté tierna.", "Sirva con abundante pan blanco y una ensalada de tomate y cebolla estilo griego."], "url": "www_bbc_co_uk_food_recipes_neckoflambwithlemona_8863", "title": "Cuello de cordero con limón y tomillo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 5-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neckoflambwithlemona_8863_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de harina", "20 g / oz de mantequilla", "pizca de sal", "½ huevo de corral", "2 cucharaditas de mantequilla", "2 cucharadas de azúcar moreno", "5 cm / 2 en pieza de galangal o jengibre, finamente picado", "2 nectarinas, cortadas a la mitad y piedras removidas", "azúcar glas, al polvo", "100 ml / 3½ fl oz crema doble, batida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque todos los ingredientes de la masa en un procesador de alimentos y mezcle hasta que se forme una masa. Envuelva la masa en una película adhesiva y transfiérala a la nevera para enfriarla durante 10 minutos.", "Para la fruta, derrita la mantequilla en una sartén pequeña a prueba de horno a fuego medio. Agregue el azúcar y revuelva hasta que se disuelva.", "Agregue el galangal o jengibre a la sartén y cocine durante dos minutos.", "Agregue las nectarinas a la sartén, con el lado cortado hacia abajo. Cocine por cinco minutos hasta que se pongan suaves y marrones por debajo.", "Estirar la masa en una superficie ligeramente enharinada. Corta un disco para que coincida con el diámetro de la sartén y úntalo para cubrir las nectarinas. Pellizque los bordes para sellar y transferir la sartén al horno. Hornee durante 12 minutos o hasta que estén dorados y cocidos.", "Para servir, dé la vuelta sobre un plato de servir y saque la punta. Polvo con azúcar glas y servir con la crema batida."], "url": "www_bbc_co_uk_food_recipes_nectarineandgingerta_84555", "title": "Nectarina y tarta tatin de jengibre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "3 nectarinas, peladas, removidas y picadas", "½ una tarta de Madeira ya hecha, en rodajas", "75 ml / 3 fl oz dulce vino de postre", "100 g / 3½ oz de queso mascarpone", "60g / 2oz de azúcar glas, tamizado", "Crema doble de 225 ml / 8 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "1 nectarina, piel dejada, piedra removida, picada"], "method": ["Caliente el azúcar y el agua en una sartén durante 4-5 minutos, hasta que el azúcar se haya disuelto y el líquido forme un jarabe.", "Transfiera a un procesador de alimentos y permita que se enfríe un poco.", "Agregue las nectarinas peladas picadas, luego mezcle con un puré. Dejar enfriar.", "Coloque 1-2 rebanadas de pastel de Madeira en el fondo de cada uno de los cuatro platos o tazones de fuente y vierta un poco de vino sobre cada uno. Debe usar aproximadamente la mitad del vino.", "Coloque el mascarpone, el azúcar glas, el vino restante y la crema batida en un tazón limpio y dóblelos hasta que quede suave.", "Agregue el puré de nectarina y revuelva suavemente a través de la mezcla de mascarpone para crear un efecto marmoleado.", "Agregue dos tercios de los pedazos de nectarina sin pelar y dóblelos a través de la mezcla.", "Para servir, ponga la mezcla sobre la esponja empapada en vino en cada tazón y cubra con algunos trozos de la nectarina restante."], "url": "www_bbc_co_uk_food_recipes_nectarinesyllabub_86545", "title": "Silabú de nectarina", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ de helado de vainilla", "1 litro / 1 taza de helado de fresa", "1 litro / 1¾ de helado de chocolate", "2 huevos grandes de gallinas camperas", "50 g / 1 oz de azúcar en polvo", "Harina de auto aumento de 30g / 1oz", "20 g / oz de cacao en polvo", "20 g / oz de mantequilla, derretida", "225 g / 8 oz de azúcar en polvo", "4 claras de huevo grandes de gallinas camperas", "Colorante de comida de pasta de gel rosa", "Colorante de comida de pasta de gel amarillo", "bayas mezcladas, para decorar"], "method": ["Alinee un bol de budín de 3 litros / 5 litros con película adhesiva. En un tazón grande o en un mezclador independiente, bata el helado de vainilla para que se ablande un poco y luego espolvoréalo en la base del tazón. Nivel con una espátula y congelar durante una hora, o hasta que esté firme.", "Limpie el recipiente para mezclar y agregue el helado de fresa. Batir para ablandar un poco y luego una cuchara sobre el helado de vainilla. Nivel con una espátula y congelar durante una hora, o hasta que esté firme.", "Precaliente el horno a 190 ° C (ventilador de 170 ° C) / 375 ° F / Gas 5. Engrase ligeramente una lata de sándwich de 20 cm / 8 in y forre la base con papel para hornear.", "Para la base de la esponja, coloque los huevos y el azúcar en un tazón grande y bata a toda velocidad con un batidor eléctrico hasta que la mezcla tenga un color pálido y lo suficientemente gruesa como para dejar un rastro cuando se levante el batidor.", "Tamiza la harina y el polvo de cacao sobre la superficie de la mezcla y dóblala suavemente con una cuchara o espátula de metal. Vierta la mantequilla derretida por el lado del tazón y dóblela suavemente.", "Vierta en la lata preparada e incline la lata para permitir que la mezcla se extienda uniformemente a los lados. Hornee por unos 10 a 12 minutos, o hasta que quede elástico al tacto y comience a encogerse desde los lados de la lata. Apague y deje que se enfríe en una rejilla de alambre.", "Para el relleno, en un tazón grande o mezclador, bata el helado de chocolate para ablandar un poco y luego extender sobre el helado de fresa. Nivel con una espátula y congelar durante una hora, o hasta que esté firme.", "Coloque la esponja fría en un plato para servir a prueba de horno. Coloque el helado sobre la esponja y vuelva a colocarlo en el congelador mientras prepara el merengue.", "Precaliente el horno a 240C (220C fan) / 460F / Gas 8½.", "Para hacer el merengue, coloque el azúcar y seis cucharadas de agua en una cacerola de base pesada. Revuelva el azúcar y el agua a fuego medio hasta que el azúcar se disuelva, luego lleve a ebullición rápida hasta que alcance 110 ° C / 230 ° F.", "Batir las claras de huevo en un tazón grande de un mezclador eléctrico hasta que se formen picos rígidos cuando se quite el batidor.", "Cuando la temperatura del almíbar alcance los 115 ° C / 240 ° F en un termómetro de azúcar, vierta lenta y cuidadosamente el jarabe sobre las claras de huevo en un chorro delgado mientras continúa batiendo. Cuidando de no dejar que el jarabe corra sobre los batidores ya que puede salpicar.", "Continúe batiendo por unos 15 minutos o hasta que el merengue esté completamente frío.", "Toma la torta y el helado del congelador y quita la película adhesiva. Con una espátula, extiende una fina capa de merengue sobre el helado y la esponja para formar un recubrimiento.", "Coloque una gran bolsa de plástico desechable con una boquilla de estrella 2D. Con una brocha o un pequeño cepillo para pasteles, pinte una línea de pasta de gel rosa en el interior de la bolsa en línea desde la boquilla hasta la parte superior. Repite en el lado opuesto con la pasta de gel amarilla. Coloque el merengue en la manga pastelera.", "Comenzando desde la parte superior de la cúpula de helado y trabajando rápidamente, vierta pequeñas rosetas de merengue sobre la cúpula de helado, hasta que estén completamente cubiertas.", "Hornee en el horno precalentado durante aproximadamente 4-5 minutos, o hasta que estén dorados. Decora con bayas mixtas y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_neopolitan_baked_alaska_18464", "title": "Napolitano al horno Alaska", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/neopolitan_baked_alaska_18464_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 paquete de pasta filo", "3 cucharadas de aceite de girasol", "250g / 9oz de arroz salvaje", "1 bolsita bouquet garni", "1 calabaza pequeña, finamente cortada", "1 gran calabacín, cortado en cubitos", "Champiñones de 50 g / 2 oz", "1 pimiento rojo, cortado en cubitos", "100 g / 4 oz de frijoles, cocidos al vapor", "1 radicchio pequeño", "2 cucharadas de vinagre balsámico", "5 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "2 ramitas grandes de romero", "1 manojo de perejil picado"], "method": ["Precalentar el horno a 180C / 350F / Gas4.", "Coloque un anillo de flan de 10 cm / 4 pulgadas de ancho boca abajo en una bandeja para hornear. Engrase ligeramente la parte exterior del anillo de flan.", "Cepille cinco hojas de hojaldre con aceite de girasol y coloque sobre el anillo de flan en capas en diferentes ángulos, dando como resultado una forma de estrella. Coloque en el horno durante aproximadamente 10 minutos o hasta que estén doradas. Deje que se enfríe durante 5 minutos, luego levante cuidadosamente los nidos de los anillos y colóquelos sobre un plato. Esto debe hacerse tres veces más, hasta que tenga cuatro cestas. En esta etapa, eleve la temperatura del horno a 200C / 400F / Gas6.", "Lave bien el arroz. Agregar a una olla grande de agua con el bouquet garni y llevar a ebullición. Cocine a fuego lento durante 40 a 45 minutos, hasta que los granos se hayan dividido y estén tiernos.", "Mientras tanto, coloque todas las verduras en un tazón grande y mezcle. Mezcle el vinagre balsámico, el aceite de oliva, el condimento y una ramita de romero. Vierta sobre las verduras y reserve durante 30 minutos para que las verduras se marinen.", "Engrase una bandeja grande para asar y distribuya las verduras uniformemente sobre la bandeja. Cubra con papel de aluminio y colóquelo en el horno por 15 minutos. Retire la lámina y tueste por otros 15 minutos.", "Para servir, llene cada nido de filo con las verduras asadas y los jugos marinados. Agregue el arroz silvestre alrededor del borde de la canasta y adorne con el perejil y el romero."], "url": "www_bbc_co_uk_food_recipes_nestofroastedbalsami_6549", "title": "Nido de verduras balsámicas asadas con arroz silvestre aromático", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de claras de huevo de gallinas camperas", "150 g / 5½ oz de azúcar en polvo", "50ml / 2fl oz de agua fría", "250g / 9oz de mantequilla sin sal, a temperatura ambiente", "3 huevos de gallinas camperas", "harina común", "azúcar glas", "margarina", "un punto de colorante de comida roja", "3 huevos de gallinas camperas", "harina común", "azúcar glas", "margarina", "semillas de 1 vaina de vainilla", "3 huevos de gallinas camperas", "harina común", "azúcar glas", "margarina", "2 cucharadas de cacao", "50 g / 1 oz de azúcar en polvo", "50g / 1¾oz de mantequilla", "2 cucharadas de jarabe de oro", "50g / 1¾oz de harina", "1 cucharadita de brandy", "½ cucharadita de jengibre molido", "1 limón, ralladura solamente", "100g / 3½oz de chocolate con leche, derretido", "100ml / 3½ fl oz crema doble", "100g / 3½oz de chocolate con leche de buena calidad, roto en pedazos", "Frambuesas 100g / 3½ oz", "100g / 3½oz de azúcar glasé"], "method": ["Para la crema de mantequilla de merengue italiana, bata las claras de huevo en un bol hasta que se formen suaves picos espumosos. Pese 25 g / 1 oz del azúcar en polvo, luego continúe batiendo las claras de huevo y agregue gradualmente el azúcar hasta que estén bien combinadas. Continúe batiendo hasta que se formen picos rígidos cuando se quite el batidor.", "Caliente el azúcar restante y el agua en una cacerola pequeña a fuego medio a bajo hasta que la mezcla se vea clara. (Agite la sartén si queda azúcar sin disolver). Aumente el fuego a un nivel justo por encima del medio y hierva hasta que la mezcla de azúcar alcance 118C / 245F. (Mida esto con un termómetro de azúcar).", "Continúe batiendo las claras de huevo y agregue lentamente el jarabe de azúcar, continúe batiendo hasta que el recipiente ya no se sienta caliente, luego agregue la mantequilla, poco a poco, hasta que se incorpore por completo. Continúe batiendo durante 2-3 minutos o hasta que quede suave y espeso.", "Batir el glaseado de crema de mantequilla con una cuchara de madera para eliminar un poco de aire y luego echar la mitad de la mezcla en una bolsa de hielo con una pequeña boquilla. Vierta el resto de la crema de mantequilla en un recipiente y cubra con una película adhesiva.", "Para preparar las esponjas, precaliente el horno a 190 ° C / 375 ° F / Gas 5. Ponga en línea tres moldes suizos de 30 cm x 23 cm / 12 \"x 9\" con papel antigrasa.", "Para la esponja rosa, pese los huevos en sus cáscaras y pese cantidades iguales de harina, azúcar y margarina. Coloque todos los ingredientes en un tazón, bata hasta que estén suaves y cremosos, luego transfiera la mezcla a la lata y nivele la superficie con una espátula. Hornee en el horno por 15-20 minutos o hasta que la esponja esté dorada y cocida. Permita que la esponja se enfríe, luego vuélvala a un tablero y despegue el papel.", "Para la esponja de vainilla, repita el paso 6, agregando las semillas de vainilla en lugar del colorante de alimentos.", "Para la esponja de chocolate, repita el paso 6, sustituyendo el cacao en polvo por dos cucharadas de la harina.", "Para hacer que el mini brandy rompa 'copos', precaliente el horno a 180 ° C / 350 ° F / Gas 4. Coloque dos bandejas para hornear con papel antigrasa.", "Caliente el azúcar, la mantequilla y el sirope dorado en una cacerola hasta que el azúcar se haya disuelto. Agregue la harina, el brandy, el jengibre molido y la ralladura de limón hasta que estén bien combinados y luego coloque cucharadas pequeñas en las bandejas para hornear, dejando suficiente espacio para que la mezcla se extienda. Hornee durante 6-7 minutos, o hasta que estén dorados y los agujeros comiencen a desarrollarse. Retire del horno, deje que se enfríe un poco y luego envuelva cada uno con un lápiz engrasado. Dejar de lado para enfriar en una rejilla de alambre. (Si el brandy se vuelve demasiado rígido para trabajar, regréselos al horno por unos segundos).", "Sumerja los extremos del brandy en el chocolate derretido y déjelo enfriar en una rejilla de alambre.", "Para hacer la ganache, caliente la crema doble en una cacerola hasta que hierva, luego agregue el chocolate. Batir hasta que esté espeso y suave, luego retire la sartén del fuego y reserve.", "Para hacer la salsa de frambuesa, empuje las frambuesas a través de un colador fino y mezcle el azúcar glas para hacer una pasta espesa. Vierta la salsa en una botella squeezy.", "Para ensamblar, con un cuchillo de sierra y una regla, corte las esponjas en cuadrados de 5 cm / 2 pulgadas, recortando si es necesario para asegurarse de que todos tengan el mismo grosor. Sandwich los pasteles con la crema de mantequilla; rosa en la parte inferior, vainilla en el medio y chocolate en la parte superior. (Vuelva a llenar la manga pastelera con crema de mantequilla si es necesario.) Extienda ganache en la parte superior de los pasteles y cubra con un remolino de crema de mantequilla. Termine con un brandy snap 'flake' y rocíe sobre la salsa de frambuesa."], "url": "www_bbc_co_uk_food_recipes_neopolitan_ice_cream_30000", "title": "Napolitano 'helado' sandwich petits fours", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Galletas digestivas 150 g / 5½ oz", "75g / 2½oz de mantequilla, más extra para engrasar", "900g / 2lb de queso crema con toda su grasa", "200 g / 7 oz de azúcar en polvo", "200ml / 7fl oz de crema agria", "3 cucharadas de harina común", "3 huevos de gallinas camperas, más 1 yema de huevo, ligeramente batida", "2 cucharaditas de extracto de vainilla"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forme la base de un molde para pastel de 23 cm / 9 pulg.", "Coloca los bizcochos en una bolsa de plástico y aplasta con un rodillo para migajas finas.", "Derrita la mantequilla y agregue las migas de galletas, revuelva para combinar. Coloque en la base del molde para pasteles y extiéndalo en una capa uniforme, luego aplánelo (use sus dedos o un triturador de papas).", "Hornee en el horno durante 10 minutos hasta que estén dorados. Retire y deje enfriar mientras prepara el relleno.", "Reduzca el horno a 160C / 315F / Gas 2.", "En un tazón grande, bata el queso crema y el azúcar hasta que esté suave, luego agregue la crema agria y la harina y vuelva a batir. Poco a poco agregue los huevos y la esencia de vainilla batiendo bien entre cada adición (bata en lugar de batir ya que no desea incorporar demasiado aire ya que esto afectará la superficie lisa de la tarta de queso).", "Vierta la mezcla de queso crema en la base de galletas y hornee en el horno durante 45 minutos. La tarta de queso debe estar acabada con un leve bamboleo y aún así debe ser crema en la parte superior con solo una leve sugerencia dorada alrededor de los bordes.", "Una vez que la tarta de queso esté cocida, apague el horno y abra la puerta para que quede un poco entreabierta y deje que la tarta de queso se enfríe en el horno para evitar que se agriete.", "Una vez que el horno esté frío, puedes quitar la tarta de queso para que se enfríe por completo antes de sacarla de la lata."], "url": "www_bbc_co_uk_food_recipes_new_york_cheesecake_20451", "title": "Tarta de queso Nueva York", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/new_york_cheesecake_20451_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite de oliva", "400 g / 14 oz de papas reales de Royal, en cuartos", "1 cebolla, cortada en cubitos", "1 diente de ajo, finamente picado", "2 hojas de laurel", "1 ramita de tomillo", "1 ramita de romero", "pellizcar pimiento de Espelette o pimentón ahumado", "Una pizca de sal marina", "120 g / 4½ oz de chorizo ​​para cocinar, cortado en dados pequeños", "15g / ½oz de perejil de hoja plana, finamente picado", "80g / 3oz de espinaca, picada", "8 huevos de gallinas camperas, golpeados"], "method": ["Precalentar el horno a 170C / 150C Fan / Gas 3½.", "Caliente el aceite en una sartén mediana o en una sartén con tapa a fuego medio. Suavemente fríe las papas, la cebolla, el ajo, las hojas de laurel, el tomillo, el romero, la pimienta de Espelette y la sal durante 13-15 minutos. Revuelva regularmente para evitar cualquier coloración.", "Agregue el chorizo ​​y fría por 5 minutos con la tapa para que los sabores se mezclen. Agregue el perejil y las espinacas y revuelva durante 30 segundos. Retire del fuego, agregue los huevos y revuelva hasta que esté bien mezclado.", "Vierta la mezcla de huevo en una sartén antiadherente y antiadherente de 20 cm / 8 pulgadas y colóquela en el horno durante 15 minutos hasta que esté cocida. Deje reposar durante 5 minutos antes de encender un tablero o un plato grande.", "Cortar la tortilla en 4-6 rodajas en forma de cuña con un cuchillo de sierra y servir caliente."], "url": "www_bbc_co_uk_food_recipes_new_potato_and_chorizo_96091", "title": "Nueva tortilla de papa y chorizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 manzanas rojas crujientes, como Red Delicious o Cox's, sin corazón y cortadas en rodajas de 1.5cm / ⅝in", "½ limón, solo jugo", "1 nivel de cucharadita de miel", "150g / 5½oz de uvas rojas y verdes sin semillas, cortadas a la mitad", "2 palitos de apio, en rodajas finas", "4 cebollas de primavera, en rodajas finas", "1 pequeña joya, hojas separadas, rotas", "2 x 150 g / 5½ oz de pechugas de pollo cocidas, sin piel, rotas", "1-2 cucharadas de nueces tostadas picadas", "3-4 ramitas de eneldo fresco, para adornar", "200g / 7fl oz de yogur natural sin grasa", "1 diente de ajo, aplastado", "1 cucharada de vinagre de sidra", "1 cucharada grande de mostaza integral", "2-3 cucharadas de eneldo fresco picado", "sal y pimienta negra recién molida"], "method": ["Coloque las manzanas en una ensaladera ancha y mezcle con el jugo de limón y la miel. Agregue las uvas, el apio, la cebolla tierna, la lechuga y el pollo y mezcle.", "Para hacer el aderezo, mezcle el yogur, el ajo, el vinagre, la mostaza y el eneldo juntos y sazone. Cuchara sobre la ensalada y revuelva bien.", "Esparce las nueces, decora con eneldo y sirve."], "url": "www_bbc_co_uk_food_recipes_new_york_chicken_and_67791", "title": "Ensalada de pollo y manzana New York", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/new_york_chicken_and_67791_16x9.jpg", "isVegetarian": false, "recommendations": 0}]