[{"ingredients": ["450 g / 1 libra de frambuesas frescas", "Azúcar mermelada de 400g / 14oz", "5 huevos de gallinas camperas", "125 g / 4½ oz de azúcar en polvo, más extra para quitar el polvo", "2 vainas de vainilla, partidas, semillas raspadas con la punta de un cuchillo afilado", "95g / 3¼ oz de harina de auto crianza, tamizada", "Crema doble 500ml / 18fl oz", "Frambuesas frescas de 75 g / 2½ oz, para la guarnición", "8 pequeñas ramitas de menta fresca o hierba luisa, para la guarnición", "1 cucharada de pistachos picados, para la guarnición (opcional)"], "method": ["Para la mermelada de frambuesa, caliente las frambuesas, el azúcar y 3 cucharadas de agua en una cacerola grande de base pesada a fuego lento durante 2 a 3 minutos o hasta que el azúcar se haya disuelto. Aumente el fuego y cocine la mezcla por otros 6-8 minutos, o hasta que se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara.", "Aparte 75 g / 2½ oz de la mermelada para usar en el rollo suizo. Vierta el resto de la mermelada en frascos calientes, esterilizados, selle y reserve para enfriar.", "Para la esponja, precaliente el horno a 190C / 170C Fan / Gas 5. Cubra una lata de rollo suizo de 38x25cm / 15x10in con pergamino para hornear.", "En un tazón grande, mezcle los huevos, el azúcar y la mitad de las semillas de vainilla hasta que queden muy livianos, espesos y esponjosos. Doble la harina tamizada con una cuchara de metal, tratando de retener la mayor cantidad de aire posible en la mezcla.", "Vierta la mezcla en la lata preparada y alise la superficie con una espátula. Hornee en el horno durante 10-12 minutos, o hasta que la esponja haya salido y esté firme al tacto (debe retroceder cuando se presiona ligeramente con un dedo).", "Coloque una toalla de té limpia y húmeda que sea un poco más grande que la lata de rollo suizo sobre una superficie de trabajo y espolvoree con azúcar en polvo. Coloque la esponja sobre la toalla de té, luego retire con cuidado el pergamino para hornear.", "Con el borde más largo de la esponja hacia usted, enrolle la esponja firmemente pero con cuidado en la toalla de té, haciendo que el rollo sea lo más ajustado posible. Desenrolle cuidadosamente la esponja y deje que se enfríe por completo.", "Para ensamblar el rollo suizo, bate la crema doble con las semillas de vainilla restantes hasta que se formen picos firmes cuando se quite la batidora.", "Extiende toda la mermelada de frambuesa dentro de la esponja fría, dejando un borde de 2 cm en el extremo más alejado de ti. Extienda la mayor parte de la crema sobre la mermelada.", "Enrolle la esponja de nuevo, comenzando por el borde más largo más cercano a usted (como antes) y usando el paño de cocina para guiarlo. Intente hacer que el suizo ruede lo más apretado posible sin exprimir el relleno.", "Usando la toalla de té, levante el rollo suizo en un plato de servir, con la costura contra el plato. Espolvorear con un poco más de azúcar en polvo y decorar con frambuesas y las ramitas de verbena de menta o limón. Si lo desea, decore la parte superior del panecillo suizo con quenelles de la crema batida restante, luego espolvoree con los pistachos, si los usa."], "url": "www_bbc_co_uk_food_recipes_swiss_roll_with_homemade_90772", "title": "Rollo suizo con mermelada de frambuesa casera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swiss_roll_with_homemade_90772_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["170 g / 6 oz de avena", "170 g / 6oz pasas o sultanas", "Albaricoques secos de 110g / 4oz, aproximadamente picados", "Avellanas de 110g / 4oz, partidas a la mitad y asadas", "350ml / 12fl oz de jugo de manzana fresca", "2 manzanas (coxes o granny smiths) peladas y toscamente ralladas", "1 pequeña tina yogur griego o natural", "4 albaricoques maduros, toscamente picados", "miel clara para servir"], "method": ["En un tazón grande mezcle la avena, las pasas, los albaricoques y las avellanas. Verter sobre el jugo de manzana y dejar actuar durante 10-15 minutos para permitir que la avena y la fruta seca absorban el jugo.", "Divida el muesli entre 6 tazones de vidrio y cubra con la manzana rallada. Cuchara en una cucharada de yogur y rocíe un poco de miel. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_swissmuesli_7252", "title": "Muesli suizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo, reducido a la mitad", "290ml / ½ pinta de vino blanco", "1 cucharadita de jugo de limón", "225g / 8oz de queso emmental rallado", "Queso gruyère 225g / 8oz rallado", "1 cucharada de harina de maíz", "1 cucharada de kirsch (opcional)", "trozos de pan en cubos, para mojar"], "method": ["Frota el interior de la olla de fondue con las mitades de ajo.", "Agregue el vino y el jugo de limón a la olla y caliente hasta que hierva. Baje el fuego y mezcle gradualmente los quesos hasta que se derrita, revolviendo todo el tiempo.", "Si usa kirsch, mezcle con la harina de maíz, de lo contrario use agua. Agregue a la mezcla de queso y cocine suavemente hasta que la mezcla esté suave - no la deje hervir o se quemará.", "Usando los dientes de fondue, sumerja los cubos de pan en el queso y sirva."], "url": "www_bbc_co_uk_food_recipes_swisscheesefondue_8925", "title": "Fondue de queso suizo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/swisscheesefondue_8925_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Crema doble de 290ml / ¼ de pinta", "Azúcar en polvo de 55 g / 2 oz", "½ limón, ralladura finamente rallada", "3 cucharadas de jugo de limón", "150ml / 5fl oz de vino blanco dulce o Madeira"], "method": ["Caliente el azúcar, los jugos y la ralladura suavemente hasta que el azúcar se disuelva y deje que se cocine por completo.", "Agregue el vino o Madeira.", "Batir la crema a los picos suaves. Doble en la mezcla de vino.", "Verter en vasos de tallo alto y enfriar bien.", "Servir decorado con uvas y una pequeña ramita de romero."], "url": "www_bbc_co_uk_food_recipes_syllabub_70037", "title": "Dulce con nata o leche", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de garbanzos secos, remojados durante la noche en agua fría, con 1 cucharadita de bicarbonato de soda", "2 panes árabes grandes", "1 tomate de ternera, en rodajas", "2 pepinillos en rodajas", "puñado de hojas de perejil fresco, finamente picado", "½ limón", "sal y pimienta negra recién molida", "puñado de hojas frescas de cilantro", "puñado de hojas frescas de perejil", "1 diente de ajo", "1 cucharadita de comino molido", "1 cucharadita de semillas de cilantro", "25 g / 1 oz de semillas de sésamo", "1 litro / 1¾ pintas de aceite vegetal", "buen zumaque, para adornar", "3 cucharadas de tahini", "3 cucharadas de yogur natural", "buen jugo de limón exprimido", "1 cucharada de tahini", "1 diente de ajo", "rociar aceite de oliva", "2 cucharadas de yogur natural", "1 limón, solo jugo", "1-2 cubos de hielo", "1½ cucharadita de aceite vegetal", "50g / 1¾oz de carne picada de cordero", "buen zumaque, para adornar", "puñado de hojas frescas de perejil, para adornar", "400 g de habas de habas / habas, escurridas", "puñado de hojas frescas de perejil", "1 tomate de buey, aproximadamente picado", "exprimir jugo de limón", "2 cucharadas de melaza de granada", "buen comino molido", "2-3 cebollas de primavera, finamente cortadas", "2 panes pitta", "buen zumaque, para adornar", "rociar aceite de oliva, para adornar"], "method": ["Escurrir los garbanzos y verter dos tercios de ellos en una cacerola, reservando el último tercio para los falafels. Cubra con agua y lleve a ebullición. Reduzca el fuego y cocine a fuego lento durante 45-50 minutos, o hasta que estén tiernos. Alternativamente, cocine en una olla a presión por 20 minutos. Drene, reservando el líquido de cocción.", "Mientras tanto, para hacer los falafels, ponga los garbanzos crudos reservados en un procesador de alimentos y mezcle con el cilantro fresco, el perejil, el ajo, las especias y las semillas de sésamo. Agregue un poco de agua tibia si la mezcla es demasiado espesa. Sazone al gusto. Forma en 20 falafels.", "Para hacer la salsa de falafel, mezcle el tahini con el yogur y el jugo de limón y sazone al gusto.", "Para hacer el hummus, ponga la mitad de los garbanzos cocidos en un procesador de alimentos. Agregue el tahini, el ajo, el aceite de oliva, el yogur, el jugo de limón y un poco de aderezo. Agregue los cubitos de hielo y mezcle de nuevo, hasta que tenga un hummus suave. Caliente el aceite vegetal en una cacerola pequeña a fuego medio. Freír el cordero picado hasta que se dore, rompiéndolo mientras se cocina.", "Vierta la mitad del hummus en un plato y cubra con el cordero cocido. Adorne con el zumaque y el perejil. Mantenga el humus restante para la grasa.", "Para hacer la ensalada de garbanzo, mezcle la mitad del resto de los garbanzos cocidos con los frijoles. Agregue los ingredientes restantes y sazone al gusto.", "Para hacer la grasa, precaliente la parrilla a lo alto y tueste los panes pitta. Dejar enfriar y luego cortar en cubos. Rocíe con un poco de líquido de cocina de garbanzos. Vierta el humus restante en un tazón pequeño y mezcle con un poco de líquido de cocina de garbanzo, debe ser un poco más espeso que la crema doble. Coloque los pittas ligeramente empapados en un plato para servir. Cubra con el último de los garbanzos cocidos. Adorne con el zumaque y el aceite de oliva.", "Caliente una olla profunda de aceite vegetal a 160 ° C, o hasta que un cubo de pan marse en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Freír el falafel en lotes durante 5 minutos, o hasta que estén dorados. Escurrir sobre papel de cocina y espolvorear con zumaque.", "Divida los panes planos por la mitad para que tenga cuatro círculos grandes. Coloque la salsa de falafel en el medio, cubra cada uno con cinco falafel, una cuarta parte del tomate y los encurtidos, un poco de perejil y un poco de limón. Envolver. Repita para las envolturas restantes.", "Coloque una plancha a fuego alto y, cuando esté caliente, cocine las envolturas hasta que estén calientes y carbonizadas.", "Sirva los panecillos con la ensalada de garbanzos y hummus. Sirva con ensalada de garbanzo, grasa y hummus."], "url": "www_bbc_co_uk_food_recipes_syrian-themed_brunch_15028", "title": "Brunch de inspiración siria", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrian-themed_brunch_15028_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 4 oz de mantequilla, más extra para engrasar", "4 cucharadas de jarabe de oro", "100 g / 4 oz de azúcar en polvo", "½ limón, jugo y ralladura solamente", "2 huevos medianos de granja", "225 g / 8 oz de harina de levadura propia, tamizada", "2 cucharadas de leche"], "method": ["Engrase un recipiente de pudín de 1 litro / 2 pinta con mantequilla. Vierta el jarabe de oro en el lavabo.", "En un tazón, mezcle la mantequilla y el azúcar hasta que esté suave y esponjoso (un batidor eléctrico de mano funciona mejor). Agregue la ralladura de limón.", "Batir los huevos, uno a la vez, alternando cada huevo con una cucharada de harina. Agregue la harina restante, el jugo de limón y la leche y vierta en el recipiente, cubriendo el almíbar.", "Recorte un círculo de papel resistente a la grasa, una vez y media más grande que el diámetro del recipiente para budines. Doble un pliegue a lo largo del medio del papel a prueba de grasa y colóquelo sobre la parte superior del recipiente del pudín. Átelo firmemente con un pedazo de cuerda y ate un lazo separado de cuerda en la parte superior para formar un mango. Recorte cualquier exceso de papel a prueba de grasa.", "Coloque un plato volteado hacia arriba en la base de una olla grande con tapa. Siente la palangana sobre el platillo vuelto hacia arriba y llene la sartén cuidadosamente con agua hirviendo hasta que llegue a dos tercios del camino por los lados del recipiente para budines. Asegúrese de que el agua no entre en contacto con el papel antigrasa, lo que podría hacer que el pudín quede empapado.", "Coloque la tapa en la sartén, coloque a fuego medio-bajo y deje hervir a fuego lento. Enjuague con vapor durante una hora y media, revisando el nivel del agua de vez en cuando y llenando con más agua hirviendo si es necesario. (No levante la tapa durante los primeros 30 minutos de cocción o la esponja puede colapsar).", "Con cuidado, levante el recipiente de budín de la sartén utilizando el mango de cadena. Retire el papel antigrasa, pase suavemente un cuchillo por el borde del recipiente para budines y coloque la esponja jarabe en un plato para servir. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_syrupsponge_88975", "title": "Esponja de jarabe", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 pepinos, pelados, sin semillas, cortados en bastones largos de 5cm / 2 pulgadas", "gran pizca de sal", "Aceite de cacahuete 100ml / 3½oz", "1 cucharadita de aceite de chile", "1 diente de ajo, aplastado", "Chile rojo pequeño, semillas eliminadas, picadas", "25 g / 1 oz de azúcar", "1 cucharadita de pimienta de Sichuan, asada en una sartén seca, aplastada", "0.5cm / quarter in piece jengibre fresco, pelado, cortado en cerillas", "30ml / 1fl oz de vinagre de vino de arroz", "2 cebollas tiernas, finamente picadas", "220 g / 7½ oz de brotes de bambú de una lata, enjuagados y escurridos", "Mangetout de 100 g / 3½ oz, finamente cortado", "2 cucharadas de brotes de soja", "1 cucharada de pimienta de Sichuan, asada en una sartén seca, aplastada", "4 filetes de solomillo de res de 200 g / 7 oz", "1 cucharada de aceite vegetal", "1 cucharada de semillas de sésamo", "hojas frescas de cilantro, para adornar"], "method": ["Para la ensalada, coloque los bastones de pepino en un colador y espolvoree con sal, revolviéndolos para cubrir uniformemente. Deje que se drene durante 20-25 minutos, para eliminar el exceso de humedad, luego enjuague con agua fría y seque.", "En una olla pequeña caliente el aceite de cacahuete y el aceite de chile. Agregue el ajo y el chile y caliente por un minuto.", "Agregue el azúcar, los granos de pimienta de Sichuan, el jengibre y el vinagre de vino de arroz, lleve a ebullición y cocine a fuego lento durante cinco minutos.", "Agregue las cebollas de pepino y primavera, aumente el fuego a alto y hierva por 10-15 segundos. Retire la sartén del fuego y déjela a un lado para que quede completamente fría.", "Cuando el líquido esté frío, agregue los brotes de bambú, mangetout y brotes de soja.", "Para el bistec, condimente los filetes con sal. Cepille los filetes con aceite vegetal y luego sumérjalos en los granos de pimienta para cubrirlos.", "Freír los filetes en una sartén muy caliente durante 3-4 minutos por cada lado, o hasta que estén cocidos a su gusto.", "Retire el bistec de la sartén y espolvoree con semillas de sésamo. Deje reposar por cinco minutos, luego corte en rodajas.", "Para servir, coloque cucharadas de la ensalada en los platos y cubra con rebanadas de carne. Adorne con hojas frescas de cilantro."], "url": "www_bbc_co_uk_food_recipes_szechwanbeefwithpick_85438", "title": "Carne de Sichuan con ensalada de pepino en vinagre", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4oz de mantequilla, derretida, más extra para engrasar el bol con leche", "125g / 4oz de azúcar en polvo", "2 huevos", "Harina normal 150g / 5oz", "1 cucharadita de polvo de hornear", "2 limones pequeños, ralladura y jugo", "1-2 cucharadas de leche", "4 cucharadas de sirope dorado, o mermelada si se prefiere, para servir", "flan, opcional, para servir"], "method": ["Engrase un tazón de 1,2 litros / 2 pinta (adecuado para el microondas). Tamizar juntos la harina y el polvo de hornear. Incline la mantequilla, el azúcar, los huevos, la harina y el polvo de hornear en un procesador de alimentos y mezcle hasta obtener una pasta. Si no está usando un procesador de alimentos, bata el azúcar y la mantequilla en un bol, mezcle los huevos, el polvo de hornear y la harina.", "Agregue el zumo y la ralladura de limón, continúe mezclando y agregue suficiente leche para que la mezcla alcance una consistencia de caída. (Sostenga una cucharada de la mezcla al revés y debería caerse después de una breve pausa).", "Vierta la mezcla en el recipiente engrasado. Cubra con film transparente y microondas a máxima potencia durante cuatro minutos (o hasta que la esponja comience a encogerse por los lados y sea elástica al tacto).", "Deje reposar de 2 a 3 minutos antes de dar vuelta y servir con sirope dorado o mermelada y flan."], "url": "www_bbc_co_uk_food_recipes_syrupspongewithprope_4983", "title": "Esponja de jarabe en el microondas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/syrupspongewithprope_4983_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aderezo francés", "2 cucharadas de miel", "2 cucharadas de vinagre balsámico blanco", "500ml / 18fl oz de aceite vegetal", "5g de chalote finamente picado", "½ diente de ajo, en rodajas", "1 cucharadita de albahaca fresca picada", "1 cucharadita de hojas de tomillo fresco picado", "1 cucharadita de cebollines picados", "1 cucharadita de hojas de perejil fresco picado", "1 cucharadita de levadura fresca", "400ml / 14fl oz de cerveza", "Harina normal de 200g / 7oz", "aceite vegetal, para freír", "2 cebollas pequeñas, cortadas finamente en anillos", "2 x filetes de T-bone", "4 cucharadas de aceite de colza", "3 cucharadas de vinagre de estragón", "3 cucharadas de vino blanco", "¼ cucharadita de granos de pimienta blanca", "½ chalote de plátano pequeño, finamente picado", "125 g / 4½ oz de mantequilla", "2 yemas de huevo de gallinas camperas", "½ limón, solo jugo", "1 cucharada de hojas de estragón picadas", "sal marina y pimienta negra recién molida", "Hojas de espinaca baby 25g / 1oz", "1 lechuga pequeña gema", "½ cabeza de brócoli, floretes finamente en rodajas", "100g / 3½oz de judías verdes francesas cocidas"], "method": ["Para el aderezo, coloque todos los ingredientes del aderezo en un procesador de alimentos y mezcle hasta que quede suave. Dejar de lado.", "Para los aros de cebolla fritos, mezcle la levadura y la cerveza en un tazón grande. Agregue la harina y mezcle con batido suave. Dejar de lado por 5 minutos.", "Llene una freidora con grasa o una sartén grande, profunda y de fondo grueso, dos tercios llena con aceite vegetal. Caliente el aceite a 180 ° C o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Sumerja los aros de cebolla en la mezcla y luego bájelos con cuidado en el aceite caliente (puede necesitar hacer esto en lotes). Cuando los aros de cebolla estén dorados, quítelos del aceite con una espumadera y sazone con sal y pimienta. Escurrir en el rollo de cocina y mantener caliente en un horno bajo hasta que esté listo para servir.", "Para el bistec T-bone, caliente una sartén grande y agregue el aceite. Una vez caliente, agrega el bistec. Cocine a cada lado durante 2-3 minutos, dependiendo de cómo le guste su bistec cocinado. Reserve para descansar en un lugar cálido.", "Para la salsa bearnesa, ponga el vinagre, el vino blanco, los granos de pimienta y la chalota en una olla pequeña y deje que hierva. Cocine a fuego lento hasta que el volumen de líquido se haya reducido a aproximadamente una cucharada. Cuele el líquido en un recipiente y luego déjelo enfriar.", "Mientras tanto, derrita 100 g / 3½ oz de la mantequilla en una cacerola pequeña a fuego medio.", "Coloque las yemas de huevo en un recipiente colocado sobre una fuente de agua hirviendo a fuego lento y bata hasta que espese y luz en color. Poco a poco agregue la mantequilla derretida, batiendo constantemente. Sazone con sal y pimienta negro. Agregue la reducción de chalote refrigerado, el jugo de limón y las hojas de estragón picado y mezcle bien. Apague el fuego y deje el recipiente sobre la sartén hasta que esté listo para usar.", "Para servir, coloca los ingredientes de la ensalada verde en un tazón. Agregue el aderezo y mezcle para cubrir.", "Sazone el bistec con sal y pimienta. Cortar el bistec en rodajas y colocar en platos junto a la ensalada y una pila de aros de cebolla. Pon la salsa en una jarra lista para servir en la mesa."], "url": "www_bbc_co_uk_food_recipes_t-bone_steak_with_38432", "title": "T-bone steak con salsa bearnesa y ensalada verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["25g / 1oz de trigo bulgur", "2 tomates grandes y maduros", "gran manojo de perejil recién hecho, solo hojas, lavado, secado, finamente picado", "pequeño manojo de hojas de menta fresca, lavado, secado, finamente picado", "1 cebolla roja pequeña, pelada, finamente picada", "2-3 cucharadas de jugo de limón recién exprimido", "2-3 cucharadas de aceite de oliva virgen extra", "copos de sal marina", "4 flatbreads listos para servir"], "method": ["Coloque el trigo bulgur en un tazón pequeño y cubra con 50 ml / 2 fl oz de agua hirviendo. Agitar, luego reservar durante 20 minutos, o hasta que el trigo bulgur haya absorbido toda el agua.", "Recorta los tallos verdes de los tomates y haz una pequeña cruz en cada una de las bases. Coloque los tomates en un recipiente aparte y cubra con agua hirviendo. Dejar de lado por 30 segundos, luego drenar el agua.", "Cuando los tomates estén lo suficientemente fríos para manipularlos, pele y deseche las pieles. Corta los tomates en cuartos, descarta las semillas y corta la carne. Transfiera los tomates cortados en cubitos a un tazón para servir.", "Agregue el perejil, la menta y la cebolla a los tomates y mezcle bien hasta que se combinen.", "Cuando el trigo bulgur haya absorbido toda el agua, pélela con un tenedor hasta que los granos se separen. Agregue el trigo bulgur a la mezcla de tomate.", "Rocíe el jugo de limón y el aceite de oliva y sazone al gusto con sal. Mezcle bien para cubrir los ingredientes en el líquido.", "Para servir, divida la tabulé por partes iguales entre cuatro platos para servir. Coloque un pan plano asado a la par de cada uno."], "url": "www_bbc_co_uk_food_recipes_tabbouleh_91782", "title": "tabulé", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tabbouleh_91782_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 alcachofas pequeñas", "2 cucharadas de aceite de oliva", "1 diente de ajo, finamente cortado", "1 cucharada de perejil picado", "2 cucharadas de crema doble", "sal y pimienta", "Pasta fresca de tagliarini 250 g / 9 oz", "75g / 2½ oz de parmesano (o un queso vegetariano similar), rallado", "50g / 1¾oz de trufa negra fresca"], "method": ["Retire las hojas exteriores de las alcachofas y corte la parte superior. Con un cuchillo afilado, corte las partes verdes y duras para que quede con las hojas tiernas y el tallo. Cortar las alcachofas por la mitad y cortar en rodajas finas.", "Caliente el aceite de oliva en una sartén y cocine suavemente la alcachofa y el ajo durante dos minutos. Agregue cuatro cucharadas de agua, cubra con una tapa y cocine por cuatro minutos, o hasta que las alcachofas estén tiernas.", "Cuando las alcachofas estén cocidas, agregue el perejil y la crema y sazone con sal y pimienta.", "En una sartén con agua salada hirviendo, cocine el tagliarini por unos tres minutos o hasta que esté al dente. Usando un par de pinzas, transfiera el tagliarini a la sartén que contiene las alcachofas. Agregue un par de cucharadas de agua de pasta y la mitad del parmesano rallado a la sartén. Mezcle bien y ralle una pequeña trufa en la pasta. Controle el condimento y agregue sal y pimienta según sea necesario. Mezcle nuevamente para que la trufa se absorba en la salsa.", "Servir en cuencos calientes con más rodajas de trufa y el parmesano restante en la parte superior."], "url": "www_bbc_co_uk_food_recipes_tagliarini_with_18980", "title": "Tagliarini con alcachofas y trufas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite de girasol, para freír", "100g / 3½oz de pan duro, cortados en trozos gruesos", "5 cucharadas de aceite de oliva virgen extra", "1 diente de ajo, en rodajas finas", "8 taggiasca o aceitunas pequeñas niçoise, picadas", "10 tomates datterini, cortados en cuartos", "Recortadores frescos de 200g / 7oz", "2 filetes de salmonete", "1 cucharadita de perejil de flatleaf finamente picado", "sal marina y pimienta negra recién molida"], "method": ["Caliente el aceite de girasol en una freidora a 160 ° C. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír las migas de pan durante 1 minuto hasta que estén doradas. Escurrir sobre papel de cocina y espolvorear con sal. Dejar de lado.", "Caliente 3 cucharadas de aceite de oliva en una sartén a fuego medio. Agregue el ajo, las aceitunas negras y los tomates y cocine por 3-4 minutos o hasta que los tomates se rompan.", "Cocine el tagliarini en una sartén grande de agua con sal según las instrucciones del paquete.", "Mientras tanto, agregue los filetes de salmonete rojo a los tomates y continúe cocinando durante 5 minutos. Agregue el perejil y sazone con sal y pimienta. Sáquelo del fuego y apártelo.", "Cuando la pasta esté al dente, retírela del agua con unas pinzas y agréguela a los tomates.", "Regrese la sartén a fuego lento y agregue una cucharada de agua de pasta y el aceite de oliva restante. Mezcle la pasta con los otros ingredientes en la sartén, separando los filetes de pescado.", "Transfiera a servir cuencos y esparza sobre el pangrattato."], "url": "www_bbc_co_uk_food_recipes_tagliarini_with_red_87558", "title": "Tagliarini con salmonetes, tomates, aceitunas y pangrattato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de harina italiana '00'", "1 huevo de gallinas camperas", "6 yemas de huevo de gallinas camperas", "50 g / 2 oz de harina de sémola fina", "50g / 2oz de mantequilla", "6 cebollas de primavera, en rodajas finas", "200 g / 7 oz de guisantes frescos, envasadas", "salpicar agua", "75 g / 3 oz de jamón, en rodajas aproximadamente", "50g / 2oz de queso parmesano, rallado finamente", "sal y pimienta negra recién molida"], "method": ["Para la pasta, coloque la harina, el huevo y las yemas de huevo en un procesador de alimentos y pulse hasta que estén bien combinados y la mezcla se una como masa. Coloque la masa en un recipiente, cúbrala con una película adhesiva y colóquela en la nevera para que repose durante 30 minutos.", "Cortar la masa de pasta por la mitad y alimentar a una de las piezas a través de una máquina de pasta de acuerdo con las instrucciones de la máquina, terminando en la configuración más delgada.", "Agregue el cortador de tagliarini a la máquina de pasta y pase la pasta por la máquina para hacer tiras finas.", "Repita el proceso con la masa restante, luego empolva la pasta con harina de sémola, colócala en un plato y refrigera durante la noche.", "Cuando esté listo para cocinar la pasta, ponga a hervir una sartén grande de agua con sal, agregue los tagliarini y cocine por 2-3 minutos hasta que estén tiernos.", "Para la salsa, caliente la mantequilla en una sartén, agregue las cebollas tiernas y fría por un minuto.", "Agregue los guisantes y un poco de agua y cocine a fuego lento durante un minuto, luego agregue el jamón y cocine por un minuto más.", "Escurra la pasta y agregue a la sartén con la salsa. Agregue el queso parmesano, sazone al gusto, con sal y pimienta negra recién molida y revuelva. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tagliariniwithprosci_86297", "title": "Tagliarini con prosciutto, guisantes, cebolleta y parmesano", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5g / ¼oz de hongos porcini secos", "2 cucharadas de aceite de oliva, más extra para lloviznar", "Tocino pancetta 70 g / 2½ oz", "¼ de chile rojo, en rodajas finas", "1 diente de ajo grande, en rodajas finas", "Pasta de tagliatelle 200 g / 7 oz", "¼ de tomate de vaca, sin semillas y finamente picado", "150g / 5½oz de setas silvestres mezcladas", "1 manojo de perejil de flautín, más o menos picado", "50 g / 1¾oz de mantequilla sin sal", "50g / 1¾oz de queso parmesano, rallado"], "method": ["Cubra los hongos porcini en agua fría y déjelos en remojo durante 10 minutos.", "Caliente 2 cucharadas de aceite de oliva en una sartén grande para saltear, agregue la panceta y cocine por 5-7 minutos o hasta que estén crujientes. Agregue el chile y el ajo y cocine durante 2-3 minutos más.", "Cocine los tallarines en una olla grande de agua hirviendo con sal, de acuerdo con las instrucciones del paquete, o hasta que estén al dente.", "Mientras tanto, escurra los hongos porcini, reservando el licor de remojo y agregue los porcini a la sartén. Cuele el licor de remojo en la sartén y deje burbujear hasta que se reduzca a la mitad. Agregue el tomate y las setas y cocine por 2 minutos. Dispersar sobre el perejil.", "Escurra los tallarines y agregue a la salsa. Agregue la mantequilla y el queso hasta que la salsa se emulsione.", "Dividir entre cuatro tazones, rociar con aceite de oliva y servir."], "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_23536", "title": "Tallarines con champiñones y panceta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pasta de tagliatelle 200 g / 7 oz", "2 cucharadas de aceite de oliva", "2 filetes de anchoa", "¼ de chile rojo, finamente picado", "1 diente de ajo grande, en rodajas finas", "70g / 2½oz de aceitunas deshuesadas verdes o negras", "¼ de tomate de vaca, sin semillas y finamente picado", "50 g / 1¾oz de mantequilla sin sal", "Pan rallado de 150 g / 5½ oz panko", "½ limón, solo ralladura", "puñado de perejil, finamente picado"], "method": ["Cocine los tallarines en una olla grande de agua hirviendo con sal, de acuerdo con las instrucciones del paquete, o hasta que estén al dente.", "Mientras tanto, para hacer el pangrattato, derrita la mantequilla en una sartén a fuego medio. Agregue las migas de pan y pan tostado durante unos minutos hasta que estén crujientes y doradas. Agregue la ralladura de limón y el perejil.", "Caliente el aceite en una sartén mediana. Agregue las anchoas, el chile y el ajo y cocine durante 1 minuto. Revuelva a través de las aceitunas y los tomates.", "Escurra los tallarines y agregue a la salsa.", "Divida entre cuatro cuencos, esparza sobre pangraatto y sirva."], "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_olives_33298", "title": "Tagliatelle con aceitunas, anchoas y pangrattato", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de harina italiana '00', más extra para harina", "50 g / 2 oz de sémola, más extra para quitar el polvo", "2 huevos de gallinas camperas", "6 cucharadas de aceite de oliva virgen extra", "1 filete de anchoa, finamente picado", "1 cucharada de alcaparras, finamente picadas", "3 dientes de ajo, finamente picados", "1 x 400 g / 14 oz de tomates de ciruela, picados", "½ cucharadita de orégano seco", "¼ de chile rojo, finamente picado", "Mejillones de 800 g / 1 libra y 12 onzas, limpios y sin barba (deseche cualquier mejillón que no se cierre herméticamente al golpearlo)", "puñado de perejil fresco, finamente picado", "sal"], "method": ["Para la pasta, mezcle la harina y la sémola juntas en una superficie de trabajo limpia o en un tazón grande.", "Haz un pozo en el centro y rompe los huevos.", "Con un tenedor o con las manos, mezcle gradualmente la harina con los huevos para formar una masa suave. Amasar la masa durante cinco minutos, o hasta que quede suave.", "Forme la masa en forma de bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante al menos 30 minutos.", "Harina la máquina de pasta con sémola y divida la pasta en cuatro partes iguales. Comenzando por el ajuste más bajo (más grueso), introduzca una pieza de la masa en la máquina, gire el mango con una mano y sostenga la masa con la otra a través de la máquina. Cambie la configuración de la máquina de pasta a la configuración más gruesa siguiente, vuelva a dorarla y vuelva a alimentar la hoja de pasta a través de la máquina, como antes.", "Repita este proceso 3-4 veces más, enharinando la máquina y cambiando la configuración cada vez. La pasta debe ser bastante delgada, pero aún así fácil de manejar sin romperse. No tengas la tentación de saltear las configuraciones o la masa puede romperse. Repita con las otras piezas de masa.", "Una vez que las hojas de pasta hayan alcanzado el grosor ideal, córtelas en tiras largas y espolvoree con sémola", "Para la salsa, caliente el aceite de oliva en una sartén grande con tapa y freír la anchoa, las alcaparras y el ajo durante 2-3 minutos.", "Agregue los tomates picados, el orégano, el chile y los mejillones. Revuelva bien, cubra parcialmente con la tapa y cocine a fuego medio durante 4-6 minutos, o hasta que la mayoría de los mejillones se hayan abierto (deseche los mejillones que no se hayan abierto durante la cocción).", "Retire la mayoría de los mejillones de sus caparazones y deseche las conchas, manteniendo algo a un lado para decorar. Regrese los mejillones sin cáscara a la salsa.", "Mientras tanto, cocine la pasta en una olla grande de agua hirviendo durante 2 o 3 minutos, o hasta que esté al dente.", "Escurre la pasta, reservando un poco del agua de la pasta. Incline la pasta en la salsa de tomate y revuelva hasta que esté bien combinada. Si es necesario, afloje la salsa con un poco de agua de pasta reservada.", "Para servir, ponga la pasta en los cuencos de pasta, espolvoree sobre el perejil y los mejillones sin cascarón."], "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_mussels_64767", "title": "Tallarines con mejillones", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["200g / 7oz de harina italiana '00'", "7 huevos de gallinas camperas, 1 entero, 6 yemas solamente", "50 g / 2 oz de harina de sémola fina", "2 calabacines, finamente cortados usando una mandolina, y cortados al mismo tamaño que los tallarines", "Tagliatelle fresco de 200g / 7oz (hecho arriba)", "2 cucharadas de aceite de oliva", "8 tomates datterini, u otros tomates pequeños, pelados", "1 diente de ajo, finamente picado", "200g / 7oz de calamar fresco, limpiado, anotado, rebanado tan grueso como el tallarín", "1 cucharadita de perejil picado", "1 pizca de chile seco", "sal y pimienta negra recién molida", "20g / ¾oz bottarga, afeitado"], "method": ["Para la pasta, coloque la harina, el huevo y las yemas de huevo en un procesador de alimentos y pulse hasta que estén bien combinados y la mezcla se una como masa. Coloque la masa en un recipiente, cúbrala con una película adhesiva y colóquela en la nevera para que repose durante 30 minutos.", "Cortar la masa de pasta por la mitad y alimentar a una de las piezas a través de una máquina de pasta de acuerdo con las instrucciones de la máquina, terminando en la configuración más delgada.", "Agregue el cortador de tallarines a la máquina de pasta y pase la pasta por la máquina para hacer tiras finas.", "Repita el proceso con la masa restante, luego empolva la pasta con harina de sémola, colócala en un plato y refrigera durante la noche o úsala de inmediato.", "Para la salsa, ponga a hervir una cacerola grande de agua con sal, agregue los tallarines y los calabacines en rodajas y vuelva a hervir durante dos minutos.", "Calentar una sartén hasta que esté medio caliente, agregar el aceite de oliva, los tomates, el ajo, el calamar y el perejil cocinar suavemente durante dos minutos.", "Agregue la pasta y los calabacines a la sartén y mezcle.", "Sazonar con chile, sal y pimienta negra recién molida y esparcir la bottarga encima."], "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_squid_09531", "title": "Tallarines con calamar y bottarga", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz de aceite de oliva", "1 hoja de laurel fresca", "1 ramita de romero fresco", "2 bayas de enebro", "3 granos de pimienta negros enteros", "2 dientes de ajo", "8 cebollas blancas, peladas, en rodajas finas", "sal y pimienta negra recién molida", "10 sardinas medianas, escamas removidas, evisceradas, fileteadas, cabezas removidas", "2-3 cucharadas de harina", "aceite vegetal, para freír", "5 cucharadas de vinagre de vino blanco", "2 cucharadas de sultanas, remojadas en agua durante 30 minutos", "300-400 g / 10½ -14oz masa de pasta fresca"], "method": ["Para la salsa, caliente el aceite, la hoja de laurel, el romero, las bayas de enebro, los granos de pimienta y el ajo en una cacerola profunda, de base dura y no reactiva, a fuego muy suave. A medida que el aceite se calienta, aumente el calor un poco para permitir que los sabores infundan el aceite.", "Cuando las hierbas comiencen a chisporrotear, agregue la cebolla y la sazón, al gusto, con sal y pimienta negra recién molida. Cocine muy suavemente sin freírlo ferozmente o dejando que la cebolla se dore, durante 15-20 minutos, o hasta que las rodajas de cebolla se hayan suavizado y estén cubiertas por el aceite.", "Mientras tanto, sazone los filetes de sardina con sal y pimienta negra recién molida. Espolvoree la harina en un plato y drague cada filete de sardina en la harina hasta que estén todos recubiertos por ambos lados.", "Caliente el aceite vegetal en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se dore cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión). Alternativamente, caliente el aceite en una freidora.", "Baje suavemente las sardinas en el aceite caliente en lotes y fría por un minuto. Las sardinas no deben colorearse ni cocinarse. Retire de la sartén con una espumadera y déjela a un lado para escurrir sobre papel de cocina. Repita el proceso con los lotes restantes de sardinas.", "Aumente el calor de la sartén que contiene las cebollas y agregue gradualmente el vinagre a la sartén en una corriente delgada. Retire la sartén del fuego. Escurre las sultanas y luego revuélvalas en la mezcla de cebolla.", "Con una cuchara, coloque la mitad de la mezcla de cebolla caliente en una fina capa en el fondo de un plato hondo para horno. Coloque las sardinas a medio cocer en una sola capa en la parte superior, luego cubra con la mezcla de cebolla restante. Cubra el plato con film transparente y déjelo enfriar y marinar. Esto debería tomar 2-3 horas (el adobo cocinará el pescado). Si marinas las sardinas durante la noche, colócalas en el refrigerador y quítalas media hora para que vuelvan a la temperatura ambiente antes de continuar.", "Mientras tanto, para la pasta, tome la masa de pasta fría y córtela en pedazos si es necesario (para que sea más manejable). Aplaste cada trozo de pasta, luego ruede hasta un grosor de aproximadamente 0.5 cm / ¼ pulg utilizando un rodillo.", "Pase una pieza de masa de pasta a través de una máquina de pasta a su configuración más amplia. Doble cada borde de la masa de pasta enrollada sobre la sección central de la masa (de modo que termine un tercio de su ancho original y tres veces su altura original) y vuelva a enrollar a través del mismo ajuste.", "Repita este proceso sin cambiar la configuración de la máquina de pasta hasta que la pasta sea brillante y de forma rectangular. Luego repita el proceso con la (s) pieza (s) restante (s) de masa de pasta.", "Disminuya el ajuste del rodillo de la máquina de pasta en un grado y pase la (s) pieza (s) de masa de pasta por los rodillos una vez más. Cada vez que pasa la pasta a través de los rodillos, disminuya la configuración en un grado hasta llegar al ajuste penúltimo o final y la masa de la pasta es suave y flexible.", "Con un cuchillo afilado, corte los bordes irregulares de las hojas de pasta para crear varias hojas de 20 cm de largo.", "Si su máquina de pasta tiene un cortador de tallarines, alimente las hojas de pasta a través de la máquina una a la vez, cubriendo los filamentos de tallarines sobre un secador de pasta o similar hasta que sea necesario. Repite el proceso usando las tiras de pasta restantes. Alternativamente, corte los tallarines a mano con un cuchillo afilado.", "Cuando las sardinas se hayan marinado, hierva una sartén grande de agua con sal en preparación para la pasta.", "Retire el ajo, las hierbas, los granos de pimienta y las bayas de la mezcla de adobo.", "Con una cuchara ranurada, transfiera la mezcla de sardina y cebolla a una sartén grande de base pesada. Calienta a fuego lento para calentar la mezcla, revolviendo regularmente y rompiendo suavemente las sardinas en pedazos mientras lo haces.", "Hervir los tallarines en agua salada y hirviendo durante 2-3 minutos o hasta que estén al dente. Drene, reservando un poco del agua de cocción.", "Mezcle los tallarines en la mezcla de sardina y cebolla, revolviendo para cubrir la pasta en la salsa. Agregue un poco del agua de cocción reservada a la mezcla si es necesario, para aflojar la salsa.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_tagliatelle_with_42197", "title": "Tagliatelle con sardinas agridulces (Tagliatelle alle sarde in saor)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva extra virgen", "Rebanadas de prosciutto de 300 g / 10½ oz, cortadas en tiras de 1 cm / ½ pulgada de ancho", "100g / 3½oz de mantequilla sin sal", "150ml / 5fl oz de vino blanco", "6 yemas de huevo de gallinas camperas", "50 g / 2 oz de parmesano, recién rallado, más extra para servir", "50g / 2oz de pecorino envejecido, recién rallado", "sal y pimienta negra recién molida", "Tagliatelle de huevo de 350g / 12oz"], "method": ["Calentar el aceite de oliva en una olla de fondo grueso. Agregue dos tercios del jamón y fría por un minuto.", "Agregue 50 g / 2 oz de la mantequilla a la sartén y deje que se derrita, luego agregue el vino y cocine a fuego lento durante 2-3 minutos, solo para combinar con la mantequilla y los jugos de jamón.", "Coloque las yemas de huevo, queso parmesano y pecorino en un recipiente y sazone al gusto con sal y pimienta negra recién molida.", "Cocine los tallarines de acuerdo con las instrucciones del paquete, o hasta que estén al dente, luego drene, reservando algunas cucharadas de agua de cocción.", "Inmediatamente agregue la pasta a la mezcla de prosciutto, luego agregue la mezcla de huevo - el calor de la pasta cocinará el huevo.", "Agregue el agua de cocción reservada si la salsa parece demasiado espesa, luego agregue el jamón restante y la mantequilla reservada.", "Para servir, espolvorear en recipientes calientes y espolvorear con un poco de queso parmesano."], "url": "www_bbc_co_uk_food_recipes_tagliatelleallacarbo_84655", "title": "Tagliatelle con carbonara", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de harina natural, más extra para espolvorear", "1 huevo de gallinas camperas", "1 cucharada de aceite de oliva", "½ cebolla, picada", "1 diente de ajo, picado", "½ cabeza de brócoli, cortada en florecillas", "2 tomates, picados", "1 cucharada de puré de tomate", "1 cucharada de agua caliente", "sal y pimienta negra recién molida"], "method": ["Para los tallarines, coloque la harina y el huevo en el tazón de un procesador de alimentos y mezcle los ingredientes hasta que se hayan combinado y la mezcla haya formado una masa.", "Coloque la masa sobre una superficie enharinada y amasar durante un minuto.", "Envuelva la masa en una película adhesiva y transfiérala a la nevera para que descanse durante cinco minutos.", "Retire la masa del refrigerador y pase por una máquina de pasta dos veces, o hasta que se forme una hoja de pasta plana.", "Corta la pasta en cinco cintas y colócala en una olla de agua hirviendo con sal. Cocine por 30 segundos y luego drene el exceso de agua.", "Para la salsa, caliente el aceite en una cacerola y agregue la cebolla y el ajo. Freír los ingredientes hasta que se vuelvan suaves y dorados.", "Agregue el brócoli, los tomates, el puré y el agua a la cacerola y mezcle bien los ingredientes. Cocine por cinco minutos y luego sazone, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque los tagliatelle en un recipiente limpio y ponga la salsa sobre la pasta."], "url": "www_bbc_co_uk_food_recipes_tagliatellewithbrocc_84782", "title": "Tallarines con brócoli y salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]