[{"isVegetarian": true, "title": "Goats' cheese cannelloni with cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_goatscheesecannellon_86639", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goatscheesecannellon_86639_16x9.jpg", "ingredients": ["400g/14oz cherry tomatoes, halved", "125ml/4fl oz extra virgin olive oil", "1 tbsp fresh thyme leaves", "salt and freshly ground black pepper", "400g/14oz ricotta", "100g/3½oz goats' cheese", "30g/1oz parmesan (or a vegetarian alternative), grated ", "200g/7oz baby spinach", "2 garlic cloves, crushed", "12 x 12cm/5in x 10cm/4in sheets fresh pasta ", "parmesan shavings", "green salad leaves, dressed with olive oil and balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the tomatoes into a bowl and drizzle with the olive oil. Add the thyme and season well with salt and freshly ground black pepper.", "Place the ricotta, goats' cheese and parmesan into a clean bowl and mix well.", "Add the spinach and garlic and season well with salt and freshly ground black pepper. ", "Lay the pasta sheets onto a clean work surface. Place a line of the cheese and spinach mixture along the longer edge of each pasta sheet, then roll up like a cigar.", "Drizzle the cannelloni rolls with a little of the oil that the tomatoes have been sitting in, then pour the remaining oil into the bottom of an ovenproof dish that will hold all 12 cannelloni.", "Place the cannelloni tubes into the dish and place the tomatoes evenly over the top.", "Transfer to the oven to bake for 15 minutes, or until cooked through.", "To serve, place three cannelloni onto each of four plates. Sprinkle with parmesan shavings and place a spoonful of dressed mixed green salad leaves alongside."]}, {"isVegetarian": false, "title": "Goats' cheese, lemon and herb risotto", "url": "www_bbc_co_uk_food_recipes_goatscheeselemonandh_84763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, finely chopped", "150g/5½oz risotto rice", "50ml/2fl oz white wine", "300ml/10fl oz hot chicken stock", "50g/1½oz goats' cheese", "50ml/2fl oz double cream", "1 lemon, zest only", "1 tsp chopped fresh chives ", "1 tsp chopped fresh parsley", "1 tbsp chopped fresh chervil", "freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the oil in a saucepan. Place the onion and garlic into the pan and cook gently for 2-3 minutes.", "Add the rice and wine to the pan, bring to the boil and cook until the wine is absorbed.", "Add the hot stock to the pan and simmer for 8-10 minutes.", "Add the goats' cheese, cream, lemon zest and herbs to the pan, stir well and season with pepper only. Cook for a further 2-3 minutes, or until the rice is al dente.", "To serve, transfer the risotto to a warmed serving bowl."]}, {"isVegetarian": true, "title": "Goats' cheese double-baked soufflés with walnut salad", "url": "www_bbc_co_uk_food_recipes_goatscheesedoublebak_91369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter, plus extra, melted, for greasing", "50g/2oz walnuts, finely chopped", "40g/1½oz plain flour (those with a wheat intolerance can substitute wheat-free flour)", "275ml/10fl oz milk", "175g/6oz Ragstone goats' cheese, or similar firm, log-shaped goats' cheese, finely chopped", "salt and freshly ground black pepper ", "4 free-range eggs, separated, whites whisked until stiff peaks form when the whisk is removed", "75g/3oz Ogleshield cheese, or similar crumbly cows' milk cheese, finely grated", "4 tbsp double cream", "50g/2oz butter", "12 asparagus spears, woody ends trimmed, peeled", "8 thin slices pancetta, cut into 2cm/¾in strips", "110g/4oz walnut halves", "110g/4oz mixed salad leaves", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflés, preheat the oven to 180C/350F/Gas 4. Brush the insides of four ramekins with melted butter. Add some of the finely chopped walnuts to each ramekin, turn to coat the sides and bottom, then shake out any excess. Set aside.", "Heat the butter in a pan over a medium heat until melted. Add the flour, stirring continuously, then continue to cook for a further 1-2 minutes, or until the mixture forms a thick paste. Remove from the heat.", "Gradually add the milk to the pan and whisk until the mixture is smooth and well combined.", "Return the mixture to the heat and continue to cook for 1-2 minutes, or until thickened. Add the goats' cheese and stir until it has melted and the mixture is smooth and well combined. Season, to taste, with salt and freshly ground black pepper.", "Remove the pan from the heat, beat in the egg yolks one at a time, beating thoroughly after each addition, until well combined, then set aside.", "Beat a third of the stiffened egg whites into the sauce until well combined, then carefully fold in the remaining egg whites with a metal spoon.", "Spoon the mixture into the prepared ramekins, tapping the sides gently to remove any large air bubbles. ", "Place the ramekins into a roasting tray. Carefully pour enough boiling water into the roasting tray to reach halfway up the sides of the ramekins (this is called a bain-marie). ", "Transfer the bain-marie to the oven and bake for 20-25 minutes, or until the soufflés have risen and are pale golden-brown and cooked through (the soufflés are cooked through when a skewer inserted into the middle of the soufflés comes out clean). Remove the soufflés from the bain-marie and set aside to cool slightly. ", "Preheat the grill to its highest setting.", "Carefully turn out each soufflé from its ramekin and place onto a baking tray.", "Sprinkle over the Ogleshield cheese and drizzle over the cream.", "Grill the soufflés for 2-3 minutes, or until the cheese is golden-brown and bubbling and the soufflés have heated through.", "Meanwhile, for the walnut salad, heat 25g/1oz of the butter in a frying pan over a medium heat until melted. Add the asparagus spears, pour over just enough hot water to cover them and bring the water to a simmer. Continue to simmer for 2-3 minutes, or until the asparagus spears are tender. Drain well and set aside.", "Heat a separate frying pan until hot, add the remaining butter and the pancetta strips and fry for 2-3 minutes, or until beginning to crisp.", "Add the walnut halves and cooked asparagus spears and fry for 1-2 minutes, or until golden-brown, then remove from the pan and set aside to drain on kitchen paper.", "Add the fried walnut halves, pancetta strips and asparagus spears to the salad leaves and mix well to combine. ", "In a bowl, whisk together the Dijon mustard, vinegar and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, drizzle two thirds of the dressing over the salad and mix well to coat the leaves. Divide the dressed salad leaves equally among four serving plates. Place one twice-baked soufflé alongside each serving. Drizzle the remaining dressing around the edge of each plate."]}, {"isVegetarian": true, "title": "Goats' cheese on garlic toast", "url": "www_bbc_co_uk_food_recipes_goatscheeseongarlict_92228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heads garlic", "olive oil, for drizzling", "2-3 sprigs fresh thyme", "salt and freshly ground black pepper", "1 goats' cheese round ", "1 ciabatta or baguette", "lettuce leaves, to serve", "prosciutto, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas 4. ", "Arrange the whole heads of garlic snugly in an oven dish. Drizzle with olive oil and season with thyme, salt and freshly ground black pepper. Roast in the oven for about an hour, or until the garlic is softened.", "Squeeze the soft garlic out of its skins into a small dish or bowl. Add enough olive oil to make a thick paste and season, to taste, with salt and freshly ground black pepper. Slice some goats' cheese thinly. Cut the ciabatta in half and place under the grill to toast then spread the slices with the garlic paste. Place the goats' cheese on top and pop under the grill again until the cheese has melted. ", "Serve with on a bed of fresh, crisp lettuce leaves. I often add a couple of slices of prosciutto, too."]}, {"isVegetarian": true, "title": "Goats' cheese pâté", "url": "www_bbc_co_uk_food_recipes_goatscheesepacirctea_65619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tub goats' cheese ", "olive oil ", "mixed chopped herbs ", "crusty bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cheese, oil and herbs in a bowl and stir. ", "Spread liberally on the crusty bread and serve."]}, {"isVegetarian": true, "title": "Goats' cheese pizza", "url": "www_bbc_co_uk_food_recipes_goatscheesepizza_84262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "3 tbsp olive oil, plus extra for greasing", "3 tbsp water", "2 tbsp tomato purée ", "1 tbsp olive oil", "100g/3½oz wild mushrooms", "30g/1oz sun-blushed tomatoes, chopped", "55g/2oz goats' cheese, crumbled"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6 and oil a baking sheet.", "Mix the flour, olive oil and water together in a bowl to make a soft dough.", "On a clean flat surface, roll the dough out into a thin disc and lay onto the oiled baking sheet.", "Spread the tomato puré over the dough disc.", "Meanwhile, for the topping, heat the olive oil in a frying pan over a high heat. Add the mushrooms and sun-blushed tomato and fry for two minutes.", "Spread the mushroom mixture over the pizza, crumble over the goats' cheese and transfer to the oven and cook for 6-8 minutes, until the cheese is melted and the base is crisp and golden."]}, {"isVegetarian": true, "title": "Goats' cheese ravioli with sage and tomato sauce", "url": "www_bbc_co_uk_food_recipes_goatscheeseravioliwi_81002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain or '00' flour, plus extra for dusting", "2 free-range eggs", "2 free-range egg yolks", "1 tbsp olive oil", "2 pinches salt", "200g/7oz baby spinach, wilted in a pan and chopped", "150g/5½oz soft goats' cheese, crumbled", "salt and freshly ground black pepper", "1 free-range egg, beaten", "100g/3½oz unsalted butter", "1 shallot, finely chopped", "10 sage leaves, chopped", "½ clove garlic, chopped", "few sprigs parsley, chopped", "4 tomatoes, skinned, deseeded and finely chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To prepare the pasta dough, place the flour, whole eggs, yolks, oil and salt in a large bowl and, using your hands, knead until you have a firm dough. Cover with clingfilm and place in the fridge for at least 5 hours.", "Meanwhile, make the filling. Mix the chopped spinach with the goats' cheese, then season with salt and freshly ground black pepper and leave to one side.", "Next make the ravioli. When the dough has rested, put the dough through a pasta machine until you have two large flat rectangular shapes, approximately 60cm/24 inches long. Keep dusting with flour so the dough doesn't stick.", "Place teaspoons of the spinach and goats' cheese mixture on the dough roughly 4cm/1½ inches apart. Glaze in between each spoon of filling with the beaten egg, then place the second pasta sheet on top. Press along the edges of each spoon of filling with your fingers. Using a pastry wheel, cut into squares to create a ravioli shape. ", "To cook, simply place the ravioli in boiling salted water for 2 minutes. Remove with a slotted spoon and keep warm.", "For the sauce, heat the butter in a frying pan, and when it starts to froth and turn golden brown, add the shallot, sage, garlic, parsley and tomatoes. Cook for a minute or two and serve at once with the cooked ravioli."]}, {"isVegetarian": false, "title": "Goats' cheese-stuffed chicken breast with roasted vegetables and boiled potatoes", "url": "www_bbc_co_uk_food_recipes_goatscheesestuffedch_84592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 boneless, skinless chicken breasts", "1 rosemary-coated soft goats' cheese", "salt and freshly ground black pepper ", "3 tbsp olive oil", "1 crotin goats' cheese (a small semi-firm disc of goats' cheese), sliced", "1 red pepper, quartered", "1 courgette, cut into thin strips", "1 aubergine, cut into 5mm/¼in thick rounds", "200g/7oz baby new potatoes, boiled, cut in half"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Use a sharp knife to cut a pocket into the side of each chicken breast.", "Slice the soft goat's cheese and press into the pocket in the chicken breasts. Season the breast with salt and freshly ground black pepper.", "Heat one tablespoon of the olive oil in an ovenproof frying pan over a medium heat. When the oil is hot, add the chicken breasts, presentation-side down and fry until golden-brown. Turn the breasts and cook for a further two minutes on the other side, then transfer the pan to the oven and roast for 15 minutes.", "Remove the pan from the oven and top with the remaining goats' cheese and return to the oven to cook for a further five minutes, until the chicken is completely cooked through and the cheese has melted.", "Meanwhile, heat a griddle pan until smoking.", "Place the red pepper, courgette and the aubergine slices into a bowl with the remaining two tablespoons of olive oil and season with salt and freshly ground black pepper. Place the vegetables onto the griddle pan and cook for five minutes, or until tender, turning once.", "To serve, place the chicken breasts onto two plates with a pile of chargrilled vegetables and some cooked potatoes alongside each."]}, {"isVegetarian": true, "title": "Goats cheese rolled on breadcrumbs and ground almonds (meculin de Crottin de Chavignol)", "url": "www_bbc_co_uk_food_recipes_goatscheeserolledonb_10171", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 50g/2oz goats' cheese (Crottin Chavignol but you can use any) ", "50g/2oz ground almonds ", "200g/7oz white bread crumbs, needn t be fresh", "1 egg, beaten", "200ml/7fl oz whole milk ", "50g/2oz plain flour ", "2 whole pears ", "250ml/8fl oz red wine ", "250ml/8fl oz port", "1 sprig of thyme ", "¼ garlic glove ", "2 star anise ", "½ cinnamon stick ", "2 black pepper corns ", "1 clove", "250ml/8fl oz water", "250ml/8fl oz sugar", "100ml/3½fl oz  walnut oil ", "45ml/1¾oz  white wine vinegar ", "100ml/3½fl oz arachide oil, or corn oil", "salt and pepper to taste", "20g/1oz mixed leaves", "1 tsp chopped chives", "1 tsp chopped shallots", "You will need a deep fat fryer for this recipe."], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the goats cheese, peel the outside rind from the goats' cheese.", "Mix the ground almonds and breadcrumbs together.", "Mix the egg and milk together to make an  egg-wash .", "Roll the goats cheese into the flour, then the  egg-wash  and then into the almond and breadcrumb mix repeat this twice and then refrigerate. Two coats will stop the cheese from bursting through when fried.", "To make the pear chutney, peel the pears and leave them whole.", "Put the port in a small pan and reduce until it becomes syrupy.", "Add red wine, spices, herbs and garlic and reduce by half.", "Add the stock syrup (black pepper corns, clove, water and sugar having already been mixed) and bring to the boil.", "Put the pears in the mixture and cook until they are soft. Insert a knife into the pears and if there is no resistance they are cooked (approx 5 minutes).", "Allow the pears to cool down in the syrup. It's best made 1 day in advance to maximise flavour.", "For the walnut dressing, mix all the ingredients together.", "Season to taste with the salt and pepper.", "Place the goats cheese into a hot fryer [approximately 170 degrees] until golden brown then, into a preheated hot oven for approx 3 minutes. This will seal the cheese and stop it from bursting out.", "Dice the pears into cubes and place them neatly onto the plate. Top with the goat's cheese and salad leaves mixed with the chopped shallots, chives and walnut dressing."]}, {"isVegetarian": true, "title": "Goats' cheese tagliatelle with breadcrumbs", "url": "www_bbc_co_uk_food_recipes_goatscheesetagliatel_80182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz breadcrumbs", "50g/1¾oz fresh parsley", "100ml/3½fl oz double cream", "100g/3½oz goats' cheese", "½ tsp freshly ground black pepper", "pinch paprika", "150g/5½oz tagliatelle, cooked according to packet instructions", "150g/5½oz monkfish, chopped into large cubes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the breadcrumbs and parsley in a food processor and blend together.", "Meanwhile place the double cream in a small saucepan over a medium heat and bring to a simmer.", "Add the goats' cheese, black pepper and paprika to the cream and continue simmering to melt the cheese and thicken the sauce.", "Place the cooked tagliatelle and monkfish pieces into a large bowl. Pour in the cream and cheese sauce and toss together. ", "Pour the sauce and tagliatelle into an ovenproof dish. Sprinkle with the parsley breadcrumbs and place into the oven to bake for five minutes, or until the top is turning golden.", "Remove from the oven and serve in the ovenproof dish."]}, {"isVegetarian": true, "title": "Goats' cheese, pear and apple tart with chilli sugar", "url": "www_bbc_co_uk_food_recipes_goatscheesepearandap_73222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14¼oz puff pastry ", "2 cooking apples ", "2 pears ", "2 limes, juice only  ", "225g/8oz goats' cheese (log-shaped chèvre)", "1 egg white ", "1 tsp milk ", "1 fresh red chilli", "1 tbsp sugar ", "1 tbsp olive oil ", "salt and freshly ground pepper", "green salad"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4. ", "Roll out the puff pastry to a rectangle slightly larger than a sheet of A4 paper.", "Place the pastry on a greased baking sheet, cover and refrigerate for 30 minutes. ", "Peel, core and finely slice the apples and pears and toss with half the lime juice.", "Using a hot, wet, sharp knife, cut the chèvre in half lengthways.", "Finely slice the chèvre into thin, half-moon shapes. ", "Beat together the egg white and the milk. ", "Take the puff pastry rectangle and brush the egg white mixture around its edges.", "Place alternate slices of apple and pear in neat lines across the rectangle, leaving a 2cm (¾in) gap of pastry around the edge. ", "Place the chèvre slices so that they overlap with the fruit slices. ", "Bake the fruit tart for 15-20 minutes until the pastry is crisp, the fruit is golden and the goats' cheese has browned. ", "Meanwhile, using a mortar and pestle, grind together the chilli and sugar to form a paste. ", "Mix in the remaining lime juice, olive oil, salt and freshly ground pepper and mix together well. ", "Once the tart is cooked, remove from the oven and allow to rest for five minutes.", "Drizzle over the chilli lime dressing and serve with a green salad."]}, {"isVegetarian": true, "title": "Goats' cheese parcels", "url": "www_bbc_co_uk_food_recipes_goatscheeseparcels_65618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 sheets buttered filo pastry ", "olive oil ", "1 tsp thyme ", "1 tsp marjoram ", "1 clove garlic ", "85g/3oz goats' cheese cheddar (a hard cheddar-like cheese) - cut into 1cm/in cubes ", "seasoning"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the sheets on a damp surface to prevent drying out. Cut into a rectangle. ", "Place the cheese, herbs and oil in a bowl and mix together. ", "Put the mixture in the centre of the rectangle and roll up into a spring roll shape. ", "Twist both the ends to make a cracker shape. ", "Brush with oil and bake in an oven 200C/400F/Gas 6 for 4 minutes to crisp up."]}, {"isVegetarian": true, "title": "Goats' cheese toastie with aubergines, peppers and courgettes", "url": "www_bbc_co_uk_food_recipes_goatscheesetoastiewi_86533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper, de-seeded and halved ", "1 yellow pepper, de-seeded and halved", "2 tbsp olive oil", "salt and freshly ground black pepper ", "1 courgette, sliced approximately 0.5cm/¼in thick", "1 small aubergine, sliced approximately 0.5cm/¼in thick", "small handful fresh basil, chopped", "1 tbsp balsamic vinegar ", "4 slices country white bread", "olive oil, for brushing", "goats' cheese log, cut into four pieces", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "For the vegetables, line a baking tray with aluminium foil, place the peppers on the tray, drizzle with one tablespoon of the olive oil and season with salt and freshly ground black pepper. Roast in the oven for 20 minutes, then remove the peppers from the oven and leave to cool. Once cooled, peel and chop into strips.", "Heat the remaining olive oil in a pan and fry the courgette and aubergine for a few minutes, seasoning with salt and freshly ground black pepper.", "In a bowl, mix the peppers, courgettes and aubergines together with the chopped basil and balsamic vinegar.", "Preheat a grill to medium.", "For the toastie, brush the sliced bread with olive oil and toast the bread on both sides under the grill. Place a large spoonful of the vegetable mixture onto the toast and then top with goats' cheese. Return to the grill until the goats' cheese begins to melt and turn golden."]}, {"isVegetarian": false, "title": "Goats' cheese tower with bacon and sautéed spicy spinach", "url": "www_bbc_co_uk_food_recipes_goatscheesetowerwith_85628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices baguette, rubbed with olive oil", "4 slices streaky bacon, grilled until crisp", "1 tbsp olive oil, plus extra, to serve", "¼ onion, finely chopped", "75g/2½oz spinach", "1 tsp chilli flakes", "salt and freshly ground black pepper", "100g/3½oz goats' cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and griddle the baguette slices until golden-brown on both sides. Place one slice onto a serving plate and top with the bacon. Place the second baguette slice on top.", "Heat the olive oil in a frying pan, add the onion and gently fry until softened.", "Add the spinach and chilli flakes and season well with salt and freshly ground black pepper. Cook, stirring frequently, for 1-2 minutes, or until the spinach has wilted. Remove from the heat and drain off the excess water.", "Place the spinach on top of the baguette on the serving plate. Top with the third slice of griddled baguette.", "Heat a frying pan and fry the goats' cheese for 2-3 minutes on each side, or until just beginning to melt.", "Place the goats' cheese on top of the tower and use a mini-blowtorch to brown all over.", "To serve, drizzle with olive oil."]}, {"isVegetarian": true, "title": "Goats' cheese with chicory orange jam", "url": "www_bbc_co_uk_food_recipes_goatscheesewithchico_83705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 onion, roughly chopped", "1 clove garlic, chopped", "5 heads chicory, finely sliced", "2 oranges, zest and juice only", "150g/5¼oz caster sugar", "250ml/8 3/4fl oz dry white wine", "4 small goats' cheese rounds", "4 slices white bread, lightly toasted", "20g/ 3/4oz butter", "1 apple, peeled and cut into wedges", "75g/2½oz cooked beetroot, cut into wedges", "50g/1 3/4oz rocket salad", "25g/1oz walnut halves", "2 tbsp vinaigrette"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large heavy-based saucepan until hot, then add the butter.", "Add the onion and garlic and fry for 2-3 minutes. Add the chicory and remaining ingredients. Bring to the boil, reduce the heat and simmer for 45 minutes, stirring occasionally, until thick and caramelised.", "Preheat the grill until hot.", "Place the goats' cheese onto the toast and grill until golden and bubbling.", "Heat a frying pan until hot then add the butter and apple and sauté until golden brown. Set aside and cool.", "To serve, place the jam in the centre of a serving plate. Top with the goats' cheese toast. Spoon the apple, beetroot, walnuts and rocket leaves around.", "Drizzle the vinaigrette over the top."]}, {"isVegetarian": false, "title": "Goats' cheese wrapped in parma ham with herb salad", "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_87235", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices parma ham", "1 thick slice goats' cheese", "½ tbsp olive oil", "handful fresh coriander, chervil and flatleaf parsley, leaves only, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the slices of parma ham on a board so that they overlap slightly and place the cheese in the centre. Fold the parma ham around the cheese to enclose it completely.", "Heat the oil in a small frying pan and fry the parcel for 2-3 minutes on all sides, or until crisp and golden-brown all over.", "To serve, place the herbs in the centre of a serving plate and top with the cheese parcel."]}, {"isVegetarian": false, "title": "Goats' cheese wrapped in pancetta with pear chutney and pan-fried pears", "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_84037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz round goats' cheese, rind removed, halved", "4 slices pancetta", "½ pear, cored, chopped", "½ onion, chopped", "1 tbsp chopped, fresh parsley", "1 tbsp olive oil", "1 tbsp balsamic vinegar", "25g/1oz butter", "½ pear, sliced", "2 tbsp olive oil ", "1 tsp wholegrain mustard", "½ lemon, juice only", "sea salt and freshly ground black pepper", "handful watercress"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the goats' cheese halves with the pancetta.", "Heat a frying pan on a medium to high heat. Place the goats' cheese in the frying pan and fry for two minutes on each side, until golden.", "For the pear chutney, place all of the chutney ingredients into a saucepan over a medium heat and simmer together for ten minutes.", "For the pear salad, melt the butter in a small pan. Add the pears and fry over a medium to high heat for five minutes, turning occasionally, until browned all over.", "For the dressing, whisk together all of the dressing ingredients in a clean bowl and season, to taste, with salt and freshly ground black pepper. ", "To serve, place the watercress onto a  plate and pour over the dressing. Top with the pan-fried pears and goats' cheese and serve  the chutney in a bowl alongside."]}, {"isVegetarian": true, "title": "Gobi 65", "url": "www_bbc_co_uk_food_recipes_gobie_65_goan_street_32808", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gobie_65_goan_street_32808_16x9.jpg", "ingredients": ["vegetable oil, for deep-frying", "1 cauliflower, leaves removed and cut into florets", "3 tbsp chickpea flour (gram flour)", "4 tbsp cornflour", "1 tbsp chilli paste", "½ tbsp finely chopped fresh curry leaves", "½ tbsp garam masala ", "8 fresh curry leaves, to garnish", "2 green chillies, sliced, to garnish ", "½ tsp ground cumin ", "½ tsp black mustard seeds", "1 green chilli", "1 tbsp cashew nuts, smashed", "1 cucumber, grated", "150ml/5fl oz thick natural yoghurt", "250g/9oz plain flour, plus extra for dusting", "1 tsp salt", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried cauliflower, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Heat a large saucepan of salted boiling water and blanch the cauliflower for 2–3 minutes. Drain well and set aside.", "Place the flours into a large bowl and add the chilli paste, chopped curry leaves and garam masala. Mix then add enough cold water to make a smooth batter consistency. ", "Dip the blanched cauliflower into the batter and deep-fry for 2 minutes or until golden-brown. Set aside to drain on kitchen roll and keep warm until ready to serve. (Keep the deep-fat fryer warm to fry the garnish at the last minute.)", "For the salad, in a dry frying pan over a medium heat, toast the cumin, mustard seeds, green chilli and nuts for 2–3 minutes, taking care not to burn them.", "Put the grated cucumber into a clean tea towel and squeeze out the water. Place the cucumber into a bowl with the yoghurt and mix in the roasted spices and nuts.", "For the flatbreads, mix the flour and salt in a large bowl. Add the oil and mix again. Gradually add enough water to form a dough then knead until smooth. Divide into 8 balls. On a floured surface, roll them out into round flatbreads.", "In a dry frying pan over a medium heat, cook each flatbread for 2–3 minutes on both sides or until cooked through.", "Just before serving, deep-fry the curry leaves and sliced green chillies. ", "To serve, place the fried cauliflower onto a serving plate and top with the salad. Serve the flatbreads on the side."]}, {"isVegetarian": true, "title": "Gold digger buns", "url": "www_bbc_co_uk_food_recipes_gold_digger_buns_07011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour, plus extra for dusting", "60g/2½oz butter", "6 dried, ready-to-eat apricots, chopped", "30g/1¼oz caster sugar", "1 free-range egg, beaten", "seedless grapes, to serve (optional)"], "serves": "Makes 6 buns", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with baking parchment.", "In a bowl, rub the flour and butter together using your fingertips until the mixture resembles breadcrumbs.", "Stir in the apricots and sugar.", "Gradually add the beaten egg and stir until the mixture comes together as a soft dough. If the mixture becomes too sticky, add a little more flour.", "Turn out the dough onto a lightly floured work surface. Cut it into six equally sized pieces and roll each into a ball. Arrange the balls onto the prepared baking tray.", "Bake the buns in the oven for 15-20 minutes, or until golden-brown on top and cooked through (a skewer inserted into the centre of each should come out clean). Set aside to cool, then eat with grapes, if desired."]}, {"isVegetarian": true, "title": "Gold millionaire shortbreads", "url": "www_bbc_co_uk_food_recipes_gold_millionaire_96516", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gold_millionaire_96516_16x9.jpg", "ingredients": ["120g/4oz plain flour", "50g/1oz caster sugar", "120g/4oz butter", "50g/1oz semolina", "24 pieces butter fudge sweets", "75g/2oz dark chocolate ", "gold luster dust"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 160C/310F/Gas 2 and lightly grease a baking sheet.", "Place all the ingredients for the base into a food processor and blend together. Lightly flour a smooth surface, then remove the dough and knead lightly until smooth. Leave to rest in the fridge for 30 minutes.", "On a lightly-floured surface roll out the dough to a thickness of about 5mm/¼in.  Cut out 12 x 6cm/2in rounds and place on the baking sheet. Prick twice with a fork. If you want to string your gold medals, use a drinking straw to make a hole in each biscuit.", "Bake for approximately 30-40 minutes until golden-brown and firm. Set aside to cool.", "Once the biscuits have cooled. Soften two pieces of fudge (this can be done by massaging the fudge by hand or warming it in 10 second bursts in a microwave), knead into a ball and roll or pat into a circle the same size as the biscuits. Press onto the surface of the shortbread and leave to set on a tray for 30 minutes. Repeat for the remaining biscuits.", "Break the chocolate into small pieces and place in a bowl over a pan of gently simmering water (do not let the bowl touch the water).  Melt the chocolate, stirring infrequently, until smooth. Leave to cool slightly. Pour the chocolate over the biscuits until they are completely covered.  Set aside until the chocolate has set, then brush the chocolate with the gold luster."]}, {"isVegetarian": true, "title": "Golden egg curry", "url": "www_bbc_co_uk_food_recipes_golden_egg_curry_00708", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_egg_curry_00708_16x9.jpg", "ingredients": ["2 green chillies, de-seeded and roughly chopped", "4 green finger chillies, 1 roughly chopped and 3 left whole ", "150g/5½oz shallots, peeled and roughly chopped ", "2 large garlic cloves, roughly chopped ", "25g/1oz fresh ginger, peeled and roughly chopped", "15g/½oz fresh turmeric, peeled and roughly chopped, or 1 tsp ground turmeric ", "2 tbsp vegetable oil ", "1 lemongrass stalk, trimmed and bruised", "1 x 400ml tin coconut milk  ", "2 tsp sea salt flakes ", "2 tsp tamarind paste ", "4 large free-range eggs, at room temperature ", "rice or flatbreads (or both), to serve "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the 2 green chillies and 1 roughly chopped green finger chilli, shallots, garlic, ginger and turmeric to a paste using a stick blender or mini food processor. ", "Heat the oil in a heavy-based wok or a similar-sized pan with a lid, add the paste and the lemongrass and fry gently, stirring frequently, for 5 minutes, until the paste is cooked and softened. ", "Add the coconut milk, salt and tamarind with 100ml/3½fl oz freshly boiled water. Make a couple of little incisions in each of the 3 whole finger chillies with the point of a small sharp knife and add to the pan. Turn the heat up to bring to a near boil, then reduce the heat and simmer gently for about 7 minutes, stirring frequently, until the sauce has cooked and reduced to a thick golden soup. ", "Crack the eggs into the sauce, cover with a lid and leave to simmer very gently for about 4 minutes, or until the whites are set but the yolks still runny, or cook for longer if you want well-cooked yolks. ", "Divide between two bowls, trying to spoon out most of the sauce from the pan first. Serve with rice, flatbreads or both. "]}, {"isVegetarian": true, "title": "Golden dough balls with cheese and herbs", "url": "www_bbc_co_uk_food_recipes_golden_dough_balls_with_70562", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_dough_balls_with_70562_16x9.jpg", "ingredients": ["16 ready-to-cook dough balls", "75g/2½oz full-fat cream cheese", "salt and freshly ground black pepper, to taste ", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh parsley", "3 tbsp mango chutney"], "serves": "Makes 32 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and line a baking tray with non-stick paper or foil.", "Slice each dough ball in half horizontally. On the baking trays, arrange the half dough balls up on the rounded part with the cut side up. You may need to slice a small piece off the rounded base so that they sit flat on the tray without toppling over.", "Mix the cream cheese with salt, pepper, chives and parsley and spread the cheese mixture over the flat side of each ball, spreading right to the edges.  Spoon a small blob of mango chutney on top.", "Bake for about 10-12 minutes or until golden-brown and hot.", "Arrange on a flat platter and serve hot."]}, {"isVegetarian": true, "title": "Golden flapjacks with mango, sour cherries and coconut", "url": "www_bbc_co_uk_food_recipes_goldenflapjackswithm_93620", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goldenflapjackswithm_93620_16x9.jpg", "ingredients": ["2 tbsp golden syrup", "4 tbsp runny honey", "150g/5oz salted butter ", "150g/5oz porridge oats", "100g/3½oz desiccated coconut", "75g/2¾oz sour cherries", "75g/2¾oz dried mango, chopped"], "serves": "Makes 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.  ", "Grease a medium-sized deep baking tray. (The size of the tray will depend on the thickness of the flapjacks).", "In a large saucepan, melt the golden syrup, honey and butter together over a low heat, stirring until well combined.", "Remove the pan from the heat and stir in the oats, coconut, cherries and mango.", "Pour the flapjack mixture into the prepared tray and press it down gently into the corners of the tin. Bake for 25-30 minutes, or until deep golden-brown on top. ", "Score the flapjack into pieces while still hot, and allow to cool in the tin before turning out and cutting completely."]}, {"isVegetarian": true, "title": "Golden mojito", "url": "www_bbc_co_uk_food_recipes_goldenmojito_89969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 fresh mint leaves", "1 lemon wedge", "2 tsp sugar syrup (sold as 'gomme' syrup)", "50ml/2fl oz golden rum", "1 tbsp lemon juice", "ginger ale, to top up", "sprig fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mint leaves, lemon wedge and sugar syrup into a cocktail shaker and mash (muddle) with the end of a rolling pin.", "Add a handful of ice and stir well.", "Add the rum and lemon juice and stir well.", "Top up with ginger ale and garnish with a sprig of mint."]}, {"isVegetarian": false, "title": "Gong bao haddock goujons", "url": "www_bbc_co_uk_food_recipes_gongbaohaddockgoujon_89278", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp Shaoxing rice wine or dry sherry", "1 tbsp peeled and grated fresh root ginger", "1 small spring onion, finely chopped", "340g/12oz haddock fillets, cut into strips ", "1 tbsp crushed dried chillies", "1 tsp sea salt", "1 tsp white pepper", "100g/3½oz dry breadcrumbs", "100g/3½oz plain flour", "2 free-range eggs, beaten", "groundnut oil, for deep-frying", "2 tbsp lemon juice", "2 tbsp hoisin sauce", "1 tbsp dark soy sauce", "1 tsp crushed dried chilli flakes ", "1 tbsp cornflour, mixed with 2 tbsp cold water, to thicken"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock goujons, mix the Shaoxing rice wine, grated ginger and chopped spring onion together in a shallow bowl and add the fish strips. Cover with cling film and leave to marinate in the fridge for 20 minutes. ", "Mix the dried chillies, sea salt and white pepper together with the breadcrumbs in a bowl, then tip onto a plate or tray. Dip the marinated strips of fish into the flour, then into the beaten egg, then roll in the seasoned breadcrumb mixture. Pat lightly to secure the breadcrumbs to the fish, then shake off any excess. Repeat with all of the fish strips.", "Quarter-fill a wok with groundnut oil and heat until a small cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the fish goujons in small batches and deep-fry for 2-3 minutes, or until golden-brown, then remove with a slotted spoon and drain on kitchen paper. Repeat with the remaining fish goujons. ", "For the gong bao sauce, heat all of the sauce ingredients together in a small saucepan, and, if necessary, thicken with the cornflour and water mixture. Remove from the heat and transfer to a small bowl or ramekin for dipping. ", "To serve, pile the fish goujons onto a serving plate and place the bowl of gong bao sauce on the side. Serve immediately with roast sweet potato wedges."]}]