[{"isVegetarian": false, "title": "Hoki with patatas bravas", "url": "www_bbc_co_uk_food_recipes_hokiwithpatatasbrava_84674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["olive oil, for roasting", "6-8 large baking potatoes, peeled, cut into 2.5cm/1in cubes", "salt and freshly ground black pepper ", "4 garlic cloves, crushed", "2 x 400g/13oz cans chopped tomatoes", "2 small red chillies, seeds removed, chopped", "1 tsp paprika", "1 tbsp chopped fresh parsley", "10 x 150g/5oz hoki steaks", "1 lemon, juice only", "400g/13oz mature cheddar or Manchego cheese, grated ", "25g/1oz Dijon mustard", "2 free-range eggs, beaten", "salt and freshly ground pepper"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the oil into a large, deep roasting tin, until ithe oil is 2cm/1in deep in the tin and place into the oven until smoking.", "Carefully add the potatoes to the hot oil and turn them in the oil to coat. Season with salt and freshly ground black pepper and place into the oven for ten minutes.", "Carefully add the crushed garlic, tomatoes, chillies and paprika to the potatoes and stir to combine. Return to the oven to roast for a further 30 minutes, or until the potatoes are crisp on the outside, but soft on the inside.", "Season, to taste, with salt and freshly ground black pepper, add more olive oil if the potato mixture has become dry and sprinkle with the parsley.", "For the hoki, lightly oil a clean roasting tray and add the hoki steaks. Season lightly with salt and freshly ground black pepper and squeeze lemon juice over the top.", "Place the cheese, mustard and beaten egg into a bowl and stir well to combine. ", "Divide the cheese mixture into ten portions and mould each portion to fit on top of a piece of the hoki, then press onto each of the fish steaks. (Don't worry if it looks a bit sloppy: the egg will set the topping when it cooks.)", "Transfer the fish to the oven and roast for 10-15 minutes, or until the cheese browns and the fish is completely cooked through.", "To serve, press a spoonful of patatas bravas onto a plate, then place a hoki steak on top."]}, {"isVegetarian": false, "title": "Hollywood’s temptation", "url": "www_bbc_co_uk_food_recipes_hollywoods_temptation_10953", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hollywoods_temptation_10953_16x9.jpg", "ingredients": ["75g/2½oz unsalted butter, plus extra for greasing", "1 large onion, thinly sliced", "salt and black pepper", "800g/1lb 12oz waxy potatoes (such as Maris Peer), peeled and thinly sliced", "500ml/18fl oz whole milk (enough to cover the potatoes for cooking)", "4 large sheets filo pastry (about 25x40cm/10x16in each)", "400g/14oz flaked, deboned hot-smoked salmon ", "100ml/3½fl oz double cream"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and put a lipped baking tray (as the pie may leak a little butter) on the middle shelf to heat up. Use a little butter to grease a 20cm/8in springform cake tin (about 7cm/2¾in deep).", "Heat 25g/1oz of the butter in a large frying pan. Add the onion and gently fry over a low heat for around 20 minutes, stirring often, until very soft and golden-brown. Season with a little salt and pepper and set aside.", "Put the sliced potatoes in a large saucepan and cover with the milk. Bring to the boil, lower the heat and simmer for about five minutes, or until the potatoes are just tender but not cooked through. ", "Drain the potatoes, reserving 100ml/3½fl oz of the milk.", "Melt the remaining butter. Put one sheet of filo pastry in the cake tin, leaving the excess hanging over the side. Brush lightly with the melted butter then turn the tin slightly and repeat with the rest of the sheets.", "Put one-third of the potatoes into the pastry-lined tin and season with a little salt and pepper. Follow with half the onions and then half the flaked fish. Repeat these layers, then finish off with the final third of potato.", "Mix the reserved milk with the cream and pour over the filling.", "Fold the overhanging pastry back over the filling to enclose it, and brush the top of the pie with melted butter. Place the pie on the hot baking tray in the oven and bake for 30–35 minutes, or until the filo is crisp and golden-brown.", "Leave the pie to stand for 30 minutes or so – it’s best eaten warm or at room temperature – then transfer to a deep plate before slicing."]}, {"isVegetarian": false, "title": "Home-smoked trout with feta salad", "url": "www_bbc_co_uk_food_recipes_home-smoked_trout_with_19243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "200g/7oz sea salt", "1 large trout, cleaned, filleted, pin boned (ask your fishmonger to do this for you)", "1 tbsp white balsamic vinegar", "3 tbsp extra virgin olive oil", "2 shallots, peeled, sliced into rings", "200g/7oz cooked beetroot, roughly chopped", "200g/7oz feta, roughly chopped", "100g/3½oz watercress", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Mix the sugar and sea salt together in a bowl. Divide the mixture into four equal portions.", "Place a large piece of cling film on a clean work surface. Place another piece on top. Sprinkle one portion of the salt and sugar mixture in a line across the centre of the cling film. Place one of the trout fillets, skin-side down, on the line of sugar and salt. ", "Sprinkle another portion of the salt and sugar mixture all over the fillet, then wrap in the cling film. ", "Repeat the process with the remaining trout fillet. Chill the fish in the fridge for 12-24 hours.", "When the trout has cured, remove the cling film and brush off the salt and sugar mixture. Rinse the fish thoroughly under cold running water, then pat dry with kitchen paper.", "Place a generous handful of oak chips in a smoker. Light the wood chips and drizzle with a little water.                     ", "When the wood chips are smouldering, lay the trout fillets, skin-side down, in the centre of the grate. Cover with the lid and smoke for 1-1½ hours, checking the chips regularly to make sure they are not burning. (CAUTION: Food-smoking generates a great deal of smoke. Cook in a well-ventilated place and open the windows.)", "When the trout has smoked, remove from the smoker and set aside to cool. ", "Meanwhile, whisk the balsamic vinegar and olive oil together in a bowl. Season, to taste, with salt and freshly ground black pepper.", "Arrange the shallot rings, beetroot and feta on a large serving platter. Flake the smoked trout over the top. Garnish with watercress leaves, then drizzle over the dressing."]}, {"isVegetarian": false, "title": "Home-smoked cod with salad and anchovy dipping sauce", "url": "www_bbc_co_uk_food_recipes_home_smoked_cod_with_38574", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz brown sugar", "pinch salt", "600g/1lb 5oz piece of cod, skin on, boned", "1 short length of juniper branch", "½ head frisée lettuce, use only the light green and white parts, chopped", "1 apple, sliced", "½ fennel, sliced", "2 tbsp picked dill", "3 tbsp heavy cream", "salt, to taste", "400g/14oz new potatoes, halved", "½ cucumber ", "2 tbsp capers", "3 tbsp sour cream", "100g/3½oz mayonnaise", "1 tbsp red wine vinegar", "100g/3½oz sugar", "100ml/3½fl oz vinegar", "1 tbsp mustard seeds", "½ tbsp caraway seeds", "½ tbsp dill seeds", "150ml/5fl oz oil from a jar of anchovies"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the sugar and salt together for the curing mix. Rub the cod with curing mix on both sides. Leave at room temperature for 30 minutes. Place in the fridge for at least 8 hours, preferably overnight. ", "Pat the cod dry with kitchen paper. Put the cod in a baking tin and put the juniper branch on the opposite side of the tin. Carefully set fire to the juniper branch. Cover with foil and smoke for 10 minutes. If you want a smokier flavour leave to smoke for longer. ", "Remove the cod from the roasting tin and carefully cut into 5mm/¼in slices. Lightly brown the slices with a chef’s blow torch.", "For the apple and frisée salad, toss all of the salad ingredients in the cream and season with salt. ", "For the potato salad, bring a pot of salted water to the boil, add the potatoes and cook until soft. Use a peeler to create thin strands from the outside of the cucumber, reserve this to make pickled cucumber. Finely chop the remaining flesh of the cucumber for the potato salad", "Drain the potatoes and leave to cool. Mix with the other potato salad ingredients. ", "For the anchovy mustard dipping sauce, put the sugar, vinegar, spices and 100ml/3½fl oz water in a pot and bring to the boil. Whisk to dissolve the sugar. Leave to cool and reserve half for the pickled cucumber. Mix the other half with the anchovy oil.", "For the pickled cucumber, mix the reserved cucumber strands with ½ tablespoon of salt and set aside for 5 minutes. Wash the cucumber to remove the salt, then drain. Mix with the pickling liquid. ", "Divide the cod slices bewreen 4 serving plates and serve with the salads and dipping sauce."]}, {"isVegetarian": false, "title": "Home cured salmon", "url": "www_bbc_co_uk_food_recipes_homecuredsalmon_66103", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz fresh salmon", "5  tbsp sea salt", "150ml/¼ pint olive oil", "2 lemons, juice and finely grated rind ", "2  tbsp chopped dill", "1 tbsp sugar", "3 tbsp sherry", "black pepper"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Place the salmon in a bowl and cover well with the sea salt. Cover the bowl with cling film and refrigerate overnight.", "The next day, rinse the salmon. It should feel a little bit hard and leathery. Place in a clean bowl.", "For the marinade, whisk together the olive oil, lemon juice, rind, dill, sugar, sherry and pepper. Pour over the salmon and leave, covered, in the fridge overnight.", "Carve the salmon finely and serve with crisp salad leaves, oatcakes and mayonnaise."]}, {"isVegetarian": true, "title": "Hive cake", "url": "www_bbc_co_uk_food_recipes_hive_cake_03837", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/hive_cake_03837_16x9.jpg", "ingredients": ["400g/14oz butter, softened", "400g/14oz sugar", "2 tbsp honey ", "2 lemons, zest only", "7 free-range eggs (preferably organic)", "400g/14oz self-raising flour, sifted", "1kg/2lb 4oz butter, softened", "1.5kg/3lb 5oz icing sugar, sifted", "lemon juice", "1 tbsp honey, or to taste", "Golden-yellow colouring - rather than lemon ", "Small amounts of ready-to-roll fondant icing in yellow, black, red and white", "25g/1oz  flaked almonds", "250g/9oz ready-to-roll green fondant icing"], "serves": "Serves 14-16", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4. Grease and line a 15cm/6in cake tin and a 18cm/7in cake tin. Grease a 15cm/6in oven-proof glass bowl or similar. Cut out a small circle of baking paper to fit in the bottom of the bowl. Flour the sides.", "Cream the butter and sugar until it is very pale, light and fluffy. Beat in the lemon zest and honey. ", "Add eggs slowly plus a little flour if the batter looks like it may curdle. Fold in the remaining flour with a large metal spoon.", "Divide the mixture between the cake tins and the oven-proof bowl.", "Bake for 40-50 minutes, checking the smaller cakes after 30 minutes. The cakes are done when a skewer inserted into the centre of the cake comes out clean.", "Remove from the oven and cool in the tins for 10 minutes before turning out onto a wire rack to cool completely. Remove the baking paper carefully.", "For the decoration, beat the softened butter in a free-standing mixer for 5-8 minutes until very light and soft. Add the icing sugar in gradually, beating all the time, until it is all incorporated. Loosen this buttercream icing mixture with the lemon juice and flavour with honey, to taste. Beat the golden-yellow food colouring into the buttercream icing to achieve your desired shade.", "Dust the work surface with icing sugar. Knead the yellow fondant icing until soft and pliable, then roll small amounts of the yellow fondant into rugby balls to form the body of the bees. Knead the black icing until soft and roll out on the dusted work surface into very thin ropes to create stripes.  Brush the bees very lightly with water and stick on the stripes. Roll tiny balls of red for noses, and little balls of white with  black dots for eyes. Stick these on with a very little water. Push two slices of almond into each bee for wings.  Set aside to dry.", "Roll out the white fondant icing and use a daisy cutter to cut out white flowers. Cut small circles from the yellow fondant for the centres of the daisies.  Set aside to dry.", "Roll out the green fondant icing to cover the cake board. ", "Place the largest cake on the green lined cake board. Spread a layer of the buttercream on the top, then top with the smaller cake. Spread a little more buttercream on the top and then finish with the round bowl cake. ", "Spread a thin layer of buttercream all over the outside of the cake. Set aside to harden (preferably in the fridge) for 10-15 minutes.", "Transfer the remaining buttercream to a piping bag fitted with a plain 2cm/¾in nozzle. Pipe the icing around the outside of the cake in concentric circles to create a hive shape. On the top, pipe a spiral and smooth with a palette knife.", "Place a few bees on skewers or cocktail sticks and stick into the cake. Attach other bees directly to the hive. Place daisies on the cake and on the green board."]}, {"isVegetarian": false, "title": "Cheeseburger with skinny fries and chilli sweetcorn relish", "url": "www_bbc_co_uk_food_recipes_highlandcheeseburger_89309", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, finely chopped", "700g/1lb 9oz good quality beef mince", "2 red chillies, finely chopped ", "2 tbsp flatleaf parsley, roughly chopped", "salt and freshly ground black pepper", "4 short, thick slices Monterey Jack cheese (or strong cheddar)", "4 burger buns, split in half", "400ml/14fl oz vegetable oil, for deep frying", "2 large baking potatoes, cut into 5cm/2½in long strips", "2 sweetcorn, on the cob", "50g/2oz butter", "2 red chillies, finely chopped", "½ lime, juice only", "2 Little Gem lettuces, leaves separated", "2 tomatoes, thickly sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the burger, heat a frying pan until hot, add the olive oil and onion and cook until the onion is softened, but not coloured. Remove from the heat and allow to cool slightly.", "Place the beef mince, chillies, flatleaf parsley, salt and freshly ground black pepper and cooled cooked onion into a large bowl and mix thoroughly.", "Divide the mixture into four equal portions. Wrap each portion of burger mixture around a piece of the cheese and mould to form a burger shape. Be careful that no cheese is exposed.", "Heat a griddle pan until hot, add the burgers and cook for 4-6 minutes on each side, or until the meat is just cooked through. Remove from the pan and leave to rest in a warm place for 2-3 minutes.", "Meanwhile, place the burger buns cut side-down onto the griddle pan and toast for one minute, until hot.", "For the skinny fries, heat the oil in a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Add the potato strips to the oil in batches and fry for 3-4 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain onto kitchen paper.", "For the chilli sweetcorn relish, bring a large pan of salted water to the boil. Add the corn on the cobs and boil for 7-8 minutes, or until tender.", "Drain the corn on the cobs and allow to cool slightly. Once cool enough to handle, slice the kernels off the cob into a bowl.", "Add the butter and chilli and mix well until the butter has melted. Sprinkle with lime juice and season, to taste, with salt and freshly ground black pepper.", "To serve, place the bottom half of each bun onto a plate. Top each with some Little Gem leaves and a couple of tomato slices, then add a burger. Top each burger with the other half of the bun.", "Place a handful of fries alongside and finish with a spoonful of the chilli sweetcorn relish."]}, {"isVegetarian": false, "title": "Homemade baked beans with sausages", "url": "www_bbc_co_uk_food_recipes_homemade_baked_beans_02438", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "8 good-quality pork sausages", "2 shallots, finely chopped", "1 tsp roughly chopped fresh rosemary leaves", "2 garlic cloves, finely chopped", "1 x 400g tin chopped tomatoes", "125ml/4¼fl oz chicken stock", "1 x 400g tin flageolet beans, drained and rinsed", "1 tbsp roughly chopped fresh flatleaf parsley", "4-6 thick slices sourdough bread", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Heat a tablespoon of the oil in an ovenproof frying pan over a medium heat. Add the sausages and fry for 2-3 minutes, or until browned on all sides. Transfer the pan to the oven and continue to cook for 10-12 minutes, or until cooked through.", "Meanwhile, heat another tablespoon of the oil in a separate frying pan over a medium heat. Add the shallots and fry for 2-3 minutes, or until softened. Add the rosemary and garlic and fry for a further 1-2 minutes.", "Add the chopped tomatoes and bring the mixture to the boil, then reduce the heat until the mixture is simmering. Add the stock and beans, return the mixture to a simmer and cook for 3-4 minutes, or until the sauce has thickened slightly. ", "Stir in the parsley and season, to taste, with salt and freshly ground black pepper. Keep warm.", "Just before serving, heat a griddle pan over a medium heat. Drizzle a little of the remaining tablespoon of oil onto each side of the bread slices. Grill the bread for 1-2 minutes on each side, or until golden-brown chargrill marks appear on both sides.", "To serve, place one slice of toast onto each serving plate. Spoon over the bean mixture and top each with a sausage or two."]}, {"isVegetarian": true, "title": "Homemade beans on toast", "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_39014", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_39014_16x9.jpg", "ingredients": ["½ onion, finely chopped", "½ clove garlic, sliced", "1 tbsp extra virgin olive oil", "1 tomato, chopped", "1 x 400g tin pinto beans, drained and rinsed", "½ tsp smoked paprika", "sea salt and freshly ground black pepper", "1 slice sourdough, toasted"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Fry the onions and garlic in a little oil until soft, add the tomato, beans and a dash of water and cook for 10 minutes until almost dry. Add ½ tsp smoked paprika and a drizzle more olive oil and season with salt and pepper. ", "Pour the beans on top of the toast and eat straight away. "]}, {"isVegetarian": false, "title": "Home-cured salmon with pickled ginger and wasabi dressing", "url": "www_bbc_co_uk_food_recipes_homecuredsalmonwithp_91466", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz salmon fillet, trimmed, skin scored with a sharp knife, cut into four equal-sized fillets ", "110g/4oz good quality sea salt flakes", "110g/4oz fine sea salt", "200g/7oz caster sugar", "1 tsp coriander seeds", "1 tsp black peppercorns", "1 lemon, zest and juice", "½ orange, zest and juice", "200ml/7fl oz water       ", "small bunch dill, chopped", "2 free-range egg yolks", "3 free-range egg whites", "50g/2oz English mustard  ", "50g/2oz wasabi paste ", "75ml/3fl oz white balsamic vinegar", "1 tbsp rice wine vinegar", "2 tsp caster sugar", "110ml/4fl oz olive oil ", "110ml/4fl oz grapeseed oil ", "salt and freshly ground black pepper ", "200g/7oz dill, roughly chopped", "110ml/4fl oz vegetable oil       ", "110ml/4fl oz olive oil       ", "2 cucumbers, peeled", "4 tbsp olive oil", "50ml/2fl oz sparkling water", "salt and freshly ground black pepper ", "75g/3oz Charlotte potatoes, cooked, drained, cut into 1cm/½in cubes", "4-5 tbsp ready-made lemon vinaigrette", "2 medium-sized, ready-made focaccia, cut into 30 1cm x 2.5cm/½in x 1in cubes", "50g/2oz caster sugar", "1 lemon, zest and juice", "40g/1½oz pickled ginger", "40g/1½oz fennel, very finely sliced, set aside in a bowl of iced water", "10g/½oz wasabi-flavoured fish roe (available from specialist Japanese suppliers)", "small bunch dill, chopped", "1 x 20g/¾oz punnet shiso cress (available from specialist suppliers and online)", "1 x 20g/¾oz punnet tahoon cress (available from specialist suppliers and online)"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["For the cured salmon, place the salmon fillets into a large, deep dish. In a bowl, mix together all of the remaining cured salmon ingredients until well combined.", "Place the salmon fillets into a large deep dish and pour the curing mixture all over it. ", "Place a second, slightly smaller dish on top of the salmon fillets and place a heavy object, such as a bag of sugar, into the second dish to flatten the salmon fillets.", "Cover the dish with cling film, then transfer the dish with the salmon fillets to the fridge and leave to cure for 1-2 days, turning the salmon fillets twice a day (about eight hours apart).", "When the salmon fillets have cured, rinse away the curing liquid and pat the salmon fillets dry using kitchen paper. Carve the salmon fillets into thin slices, then chill in the fridge, covered, until needed.", "For the wasabi dressing, blend the egg yolks, egg whites, English mustard, wasabi paste, white balsamic vinegar, rice wine vinegar and caster sugar to a purée in a food processor.", "With the motor still running, gradually add the olive oil and grapeseed oil to the purée, one after the other, in a thin stream, until the dressing mixture thickens. Season, to taste, with salt and freshly ground black pepper, then set aside.", "For the dill oil, blend the dill oil ingredients in a clean food processor to a very fine purée. Set aside.", "For the salad, using a melon baller, carve 20 balls from the peeled cucmbers.", "Place the cucumber balls into a bowl and drizzle over two tablespoons of the olive oil and all of the sparkling water. Season, to taste, with salt and freshly ground black pepper.", "Cover the bowl and microwave on full power for one minute. Drain the liquid from the bowl.", "Add the cooked potato cubes to the drained cucumber balls, then pour over a little of the lemon vinaigrette and mix well to coat the cooked vegetables.", "Heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the focaccia cubes and fry for 1-2 minutes on all sides, or until they become crisp and golden-brown croûtons. ", "Heat the caster sugar in a separate, non-reactive pan over a low to medium heat. When the sugar has melted and caramelised, add the focaccia croûtons and stir well to coat them in the melted sugar. ", "Add the lemon zest, lemon juice and the remaining tablespoon of olive oil and stir to coat the croûtons.", "To serve, drain the fennel slices and pat dry with kitchen paper. Brush four serving plates with the wasabi dressing, then sprinkle over the pickled ginger and drained fennel slices and dot with the wasabi fish roe. Divide the salad equally among the plates and top with a serving of cured salmon slices. Sprinkle over the croûtons, chopped dill, shiso cress and tahoon cress. Drizzle the dill oil around the edge of the plate."]}, {"isVegetarian": false, "title": "Chorizo beans on toast", "url": "www_bbc_co_uk_food_recipes_homemade_beans_on_toast_46976", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beans_on_toast_46976_16x9.jpg", "ingredients": ["100g/3½oz cooking chorizo, diced", "200g/7oz tinned chickpeas, drained and rinsed", "200g/7oz tinned chopped tomatoes", "1 tbsp chopped fresh thyme leaves", "salt and freshly ground black pepper", "2 slices toast", "1 tbsp chopped fresh parsley leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a saucepan over a medium heat. When the pan is hot, add the chorizo and fry for 1-2 minutes, or until starting to crisp.", "Add the drained chickpeas and tinned tomatoes, then stir in the thyme. Season, to taste, with salt and freshly ground black pepper. Simmer for 4-5 minutes, or until the sauce has warmed through and thickened to your liking. ", "To serve, spoon the chickpea mixture on top of the toast and garnish with parsley. "]}, {"isVegetarian": true, "title": "Homemade beer mustard", "url": "www_bbc_co_uk_food_recipes_homemade_beer_mustard_55981", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_beer_mustard_55981_16x9.jpg", "ingredients": ["175g/6oz yellow mustard seeds", "175g/6oz black mustard seeds", "500ml/18fl oz beer or ale", "1 tbsp sea salt", "pinch crushed chilli flakes", "175ml/6fl oz cider vinegar or white wine vinegar", "6 tbsp runny honey ", "1 tbsp ground mace or nutmeg"], "serves": "Makes 4 x 250g/9oz jars", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["Mix the mustard seeds and beer together in bowl, cover and set aside overnight. (The mustard seeds will soften and soak up most of the beer.)", "Sterilise the jars for the mustard.  Wash in very hot water or on the hot cycle of a dishwasher.  Preheat the oven to 160C/325F/Gas 3. Place the jars upside down on a baking tray and dry in the oven for 10-15 minutes.", "Stir in the remaining ingredients, then blend in a food processor until nearly smooth (you may need to do this is batches).", "Spoon the mustard into the sterilised jars; tap gently to remove all the air bubbles. "]}, {"isVegetarian": true, "title": "Homemade buttery croissants", "url": "www_bbc_co_uk_food_recipes_homemade_buttery_18294", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_buttery_18294_16x9.jpg", "ingredients": ["625g/1lb 6oz strong white bread flour, plus extra for dusting", "75g/2½oz caster sugar", "12g fine sea salt", "40g/1½oz fresh yeast", "500g/1lb 2oz chilled unsalted butter, plus extra to serve", "1 free-range egg and 1 egg yolk, lightly beaten", "raspberry jam, to serve"], "serves": "Makes 16", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["The day before you want to bake the croissants, place the flour, sugar, salt and yeast in the bowl of a food mixer fitted with a dough hook, or a large mixing bowl. Pour in 350-400ml/12-14fl oz cold water and mix until it comes together as a soft dough. ", "Turn out the dough onto a lightly floured work surface and knead for a good 8-10 minutes, or until the dough feels smooth, stretchy and elastic. Return to the bowl and set aside to rest.", "Sandwich the chilled butter between two sheets of greaseproof paper and roll out to a 30x20cm/12x8in rectangle, about 1cm/½in thick. Chill in the fridge until needed.", "Turn the dough out again onto a lightly floured work surface. Roll it into a rectangle 60x30cm/24x12in.", "Peel the greaseproof paper from the butter and place the butter centrally on top of the pastry rectangle. ", "Fold one edge of the pastry over the butter to half-cover it, then do the same with the other edge of the pastry so that the butter is covered.", "Fold the rectangle in half lengthways, then give it a quarter-turn and roll out again to a rectangle measuring 60x30cm/24x12in. ", "Repeat the folding, turning and rolling process, as before, three more times (do not roll out the pastry the final time you fold and turn it). Wrap the pastry in cling film and chill in the fridge overnight.", "When the pastry has rested, roll it out to a thickness of 0.5cm/¼in. Cut the pastry into two 50x20cm/20x8in strips, then cut each strip into triangles about 10cm/4in wide at the base.", "With the narrow point of one of the pastry triangles facing away from you, use your fingertips to stretch the two points of the triangle nearest to you out sideways so that they bow a little.", "Roll the pastry over itself, curling it into a traditional crescent shape, so that the furthest point of the triangle ends up curled over the top of the croissant.", "Repeat the process with the remaining pastry triangles to create about 20 croissants.", "Place the croissants onto baking trays lined with silicone paper or baking parchment. Brush them all over with the beaten egg, then set aside to prove for 30-45 minutes. (NB: The croissants can be frozen at this point, if desired.)", "Preheat the oven to 190C/170C Fan/Gas 5. Bake the croissants for 20-25 minutes, or until risen and golden-brown. Serve warm with jam and butter."]}, {"isVegetarian": true, "title": "Homemade chilli oil", "url": "www_bbc_co_uk_food_recipes_homemade_chilli_oil_54985", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_chilli_oil_54985_16x9.jpg", "ingredients": ["450ml/17fl oz olive oil (not virgin)", "20g/¾oz dried red chilli flakes", "3-4 whole dried red chillies"], "serves": "Makes 450ml/17fl oz chilli oil", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Gently warm the olive oil in a saucepan. Add the chilli flakes and whole chillies to the oil and heat for 3-4 minutes. Remove from the heat and leave the oil to cool slightly.", "When the oil has cooled, carefully strain it into a sterilised, sealable glass bottle using a funnel. Add dried chillies from the pan and seal the bottle.", "Keep the bottle in the refrigerator and use within one week.  "]}, {"isVegetarian": false, "title": "Homemade chorizo", "url": "www_bbc_co_uk_food_recipes_homemade_chorizo_98579", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 2oz minced lean pork shoulder", "200g/7oz pork back fat, diced", "25g/1oz fine salt", "1½ tbsp smoked paprika", "3 garlic cloves, crushed", "1½ tbsp crushed black peppercorns", "1½ tbsp fennel seeds", "25-50ml/1-2fl oz red wine", "natural sausage skins (available from butchers)"], "serves": "Makes 1.2kg /2Ib 10oz chorizo", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["For the chorizo, place all of the ingredients, except the sausage skins, into a bowl and mix until well combined.", "Press the sausage meat into a manual sausage machine and press down.", "Place a sausage skin over the end of the nozzle and turn the handle.", "Turn until the skins are all filled, then remove from the nozzle.", "Twist the sausage at 30cm/12in intervals to form individual sausages then prick carefully with a toothpick to release any air pockets.", "Hang in a cool dry place for at least  one month, preferably up to three months. "]}, {"isVegetarian": true, "title": "Homemade coleslaw", "url": "www_bbc_co_uk_food_recipes_homemade_coleslaw_84746", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_coleslaw_84746_16x9.jpg", "ingredients": ["100g/3½oz low-fat natural yoghurt", "½ lemon, juice only", "1 tbsp grainy mustard", "3 tbsp roughly chopped soft herbs, such as chives, parsley, coriander, mint", "¼ white cabbage, finely shredded", "¼ red cabbage, finely shredded", "½ red onion, thinly sliced", "2 carrots, peeled then peeled into ribbons", "sea salt and freshly ground black pepper"], "serves": "", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Put the yoghurt, lemon juice, mustard and herbs into a large bowl and whisk well to combine. Season with salt and plenty of black pepper.", "Add the cabbages, red onion and carrots and mix really well until coated in the mustard mixture.", "Ideally, leave to soften and absorb the flavours for 30 minutes before eating."]}, {"isVegetarian": true, "title": "Homemade crackers", "url": "www_bbc_co_uk_food_recipes_homemade_crackers_41322", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz wholemeal wheat or spelt flour ", "¼ tsp baking powder", "¼ tsp instant dried yeast", "1 tsp sea salt", "1 tsp honey", "100ml/3½fl oz warm water", "50ml/2fl oz melted butter", "dash olive oil", "nigella seeds, for sprinkling", "dried thyme leaves, for sprinkling"], "serves": "Makes about 30", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.  Mix the flour, baking powder, yeast and salt together, making sure you crumble up the salt well.", "In a separate bowl or jug, mix the honey, water and butter together. Add the wet ingredients to the dry ingredients and mix until it comes together as a dough. Turn out onto a work surface and knead for a couple of minutes until smooth. Cover with cling film or a damp cloth and leave to stand for half an hour.", "Roll the dough out as thinly as you can and use a cookie cutter to make small rounds, or cut into wide strips – it depends how rustic you want these to look. Arrange over a couple of baking trays and prick thoroughly all over with a fork. Brush with olive oil and sprinkle over the onion seeds and thyme leaves.", "Bake in the oven for 8-10 minutes, or until crisp and burnished. Transfer to a cooling rack. They will continue to crisp once out of the oven. "]}, {"isVegetarian": false, "title": "Homemade doner kebab", "url": "www_bbc_co_uk_food_recipes_homemade_doner_kebab_56527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_doner_kebab_56527_16x9.jpg", "ingredients": ["1 tsp rapeseed oil", "400g/14oz lean lamb mince (5% fat)", "2 garlic cloves, crushed", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp onion powder", "½ tsp smoked paprika", "½ tsp sea salt", "½ tsp freshly ground black pepper", "4 brown pittas", "½ iceberg lettuce, finely shredded", "¼ red cabbage, cored and finely shredded", "½ red onion, thinly sliced", "1 red pepper, sliced", "2 tbsp chilli sauce", "4 tbsp low-fat plain yoghurt", "2 tbsp pickled chillies (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Brush the oil over a 1kg/2lb 4oz loaf tin.", "Tip the mince into a large bowl, add the garlic, spices and seasoning and mix with your hands until smooth. Press into the loaf tin and bake for 20 minutes. Set aside until cool enough to handle.", "Meanwhile, warm the pittas in the oven for 5 minutes.", "Turn the meat out of the tin and slice the kebab lengthways into thin strips. Open up each pitta to create a pocket and pile in the salad ingredients and meat. Add chilli sauce and yoghurt, plus pickled chillies if using."]}, {"isVegetarian": true, "title": "Homemade falafels with salad and pitta bread", "url": "www_bbc_co_uk_food_recipes_homemade_falafels_with_30527", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_falafels_with_30527_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 small onion, finely chopped ", "1 garlic clove, crushed", "1 x 400g/14oz can chickpeas ", "2 tsp ground cumin", "1 tsp mixed herbs ", "1 lemon, zest grated", "salt and black pepper", "1 egg, beaten ", "3 tbsp olive oil ", "1 lemon, juice only", "½ cucumber, peeled and thinly sliced ", "100g/3½oz tomatoes (approximately two medium tomatoes), roughly chopped", "1 round lettuce, washed, leaves torn  ", "4 pitta breads "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a tablespoon of oil in a small pan. Fry the onion over a medium heat for 3-4 minutes until softened. Add the garlic and fry for a further two minutes and remove from the heat. ", "Drain and rinse the chickpeas and transfer to a mixing bowl. Add the sautéed onion and garlic and crush together with a potato masher until the mixture is broken down.", "Add the cumin, mixed herbs and lemon zest and mix well. Taste and season with salt and pepper. Add the egg and mix together.  ", "Preheat the oven to 200C/400F/Gas 6. Divide the mixture into 16 walnut-sized balls and place on a non-stick baking tray. Rest in the fridge for 20-30 minutes.", "Remove the falafel from the fridge, drizzle with the remaining oil and bake for 25 minutes, or until crisp and golden-brown. Turn occasionally to ensure even cooking.  ", "Meanwhile place the cucumber, tomato and lettuce in a large bowl.  Squeeze the juice of half the lemon into a small bowl, add a pinch of salt and pepper and using a fork whisk together with the olive oil to form a dressing.  Pour over the salad and mix well.", "Lightly toast the pitta breads then carefully slice open along one side using a knife.  ", "When ready to serve, arrange a little salad in each pitta, top with some of the falafels and add a squeeze of juice from the remaining lemon half.  Serve with the remaining salad alongside.    "]}, {"isVegetarian": false, "title": "Homemade fish fingers", "url": "www_bbc_co_uk_food_recipes_homemade_fish_fingers_85938", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_fish_fingers_85938_16x9.jpg", "ingredients": ["3 tbsp plain flour", "1 large free-range egg, beaten", "50g/1¾oz golden breadcrumbs (if not available, substitute with 30g/1oz fresh white breadcrumbs mixed with 20g/½oz easy-cook polenta)", "500g/1lb2oz thick skinless white fish fillets ", "3 tbsp sunflower oil", "frozen peas, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour in a strong freezer bag and season with salt and black pepper. Pour the beaten egg into a shallow dish. Put the breadcrumbs (or breadcrumb and polenta mixture) in a separate shallow dish.", "Gently toss each fish piece in the seasoned flour bag until evenly coated, then dip into the beaten egg then the breadcrumbs until evenly coated. Put the prepared fish pieces on a plate. ", "Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. Add the fish fingers carefully and fry for 5–6 minutes, turning occasionally until golden brown and crisp on all sides. (You may need to do this in batches.) Remove the fish with a spatula and drain on kitchen paper. ", "Bring a pot of water to the boil, and cook the frozen peas for 2-3 minutes or until soft. Drain. ", "Serve the fish fingers with the peas. "]}, {"isVegetarian": true, "title": "Homemade garlic bread", "url": "www_bbc_co_uk_food_recipes_homemade_garlic_bread_66737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_garlic_bread_66737_16x9.jpg", "ingredients": ["250g/9oz strong white flour, plus extra for dusting", "5g/¼oz salt", "5g/¼oz fast action dried yeast", "30ml/1fl oz olive oil, plus extra for oiling", "180ml/6fl oz water", "1 head of garlic", "splash olive oil ", "pinch salt ", "pinch sugar", "1 x 125g/4½oz  buffalo mozzarella"], "serves": "Makes 2 mini-baguettes", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the baguettes, place the flour, salt, yeast, olive oil and most of the water in a food mixer with a dough hook attached, taking care not to let the yeast touch the salt until you begin mixing. ", "Start mixing on a slow speed, gradually adding the rest of the water until you have a smooth dough.  This should take about five minutes.", "Tip the dough into an oiled bowl, cover and leave the dough to prove for two hours.", "Tip the dough out onto an oiled surface. Dust your hands with a little flour and divide the dough in two.", "Knock back the dough and stretch and fold, and then roll the dough into shape.", "For the garlic mixture, preheat the oven to 200C/400F/Gas 6. Smash the head of garlic to release the cloves and place them in a roasting tin, still in their skins.  Add a splash of olive oil and a pinch each of salt and sugar and toss together.  Cook in the preheated oven for 20 minutes, or until caramelised.  ", "Remove from the oven and, when cool enough to handle, squeeze the soft, roast garlic out of their skins.  ", "Press the garlic cloves into the baguette (add them to taste) as you shape the dough into a baguette shape. ", "Place on a baguette tray or a large baking tray, cover and leave to prove until it has doubled in size. ", "Heat a roasting dish in the bottom of the oven and pour in some water to create some steam (this will help form the crust). Preheat the oven to 220C/425F/Gas 7 in a non-fan oven.", "Just before baking, slash the top of each baguette three times. ", "Bake the baguettes for 30 minutes. Then drop the temperature to 200C/400G/Gas 6 and cook for 10 minutes. The baked baguettes should be golden-brown and have a slight sheen to them.", "Remove the baguettes from the oven and leave to cool.", "Once cooled, preheat the grill to hot. Slice the bread, top with mozzarella and grill until melted and bubbly.  "]}, {"isVegetarian": false, "title": "Homemade hotdogs", "url": "www_bbc_co_uk_food_recipes_homemade_hotdogs_70075", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_hotdogs_70075_16x9.jpg", "ingredients": ["1 tbsp olive oil", "25g/1oz unsalted butter", "2 large onions, peeled and sliced", "½ tsp salt", "½ tsp pepper", "160g/5¾oz cured pork fat (lardo or salo, available from specialist online suppliers)", "25g/1oz pork back fat (available from a butcher)", "250g/9oz lean pork mince", "2 free-range egg whites", "1 tsp cornflour", "salt and freshly ground black pepper", "freshly grated nutmeg", "pinch ground coriander", "4 tbsp frozen milk", "natural sheep casings, cleaned thoroughly under cold running water (available from specialist online suppliers)", "brioche rolls", "mustard"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the caramelised onions, heat the oil and butter in a pan and add the onions, salt and pepper. Cook over a low heat for 20-30 minutes, stirring from time to time, until golden-brown, soft and sticky. ", "For the hotdogs, chop both fats then place in a food processor with the mince and all the other remaining ingredients, except the casings. Blend to a smooth paste. Fill a large piping bag with the hotdog mix and carefully fill the sheep casing. Twist the filled casings to separate into individual hotdogs, around 15cm/6in long. Tie off the ends to seal in the mixture. ", "Place in a pan of cold water and bring up to 86C/187F. The water must not exceed this temperature. Poach gently (so as not to break the casings) for about 10 minutes, or until the pork has cooked through.", "Drain well and serve in a brioche roll with mustard."]}, {"isVegetarian": false, "title": "Homemade gravad lax with cucumber salad and mustard sauce", "url": "www_bbc_co_uk_food_recipes_homemade_gravadlax_with_08463", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_gravadlax_with_08463_16x9.jpg", "ingredients": ["85g/3oz caster sugar ", "70g/2½oz flaky sea salt", "2 tbsp schnapps, gin or vodka", "2 tsp freshly ground white pepper ", "100g/3½oz fresh dill ", "500g/1lb 2oz centre-cut salmon fillet, skin on, bones removed", "1 large cucumber, peeled, thinly sliced ", "1 tsp sea salt", "2 tsp caster sugar ", "freshly ground white pepper ", "1-2 tbsp white wine vinegar ", "3 tbsp Dijon mustard", "squeeze lemon juice", "2 tsp caster sugar", "1-2 tsp dried dill ", "salt and pepper", "2-3 tbsp sunflower oil"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 0, "preparationMins": 0}, "recommendations": 0, "method": ["To cure the salmon, blend together the sugar, salt, alcohol, white pepper and dill in a food processor to make a paste.", "Place half of the mixture into a container that will accommodate the fish snugly (say the plastic container the fish was bought in). Lay the salmon on top of this flesh-side down, press it down, then cover with the other half of the mixture, smearing it well over the surface of the fish. Secure with a lid or cling film and leave to chill in the fridge for 48 hours, turning the fish occasionally, until firm to the touch. ", "For the cucumber salad, mix all the ingredients together in a bowl and leave to macerate for an hour in the fridge. Drain off the liquid, put the cucumber into a serving dish and chill in the fridge. The salad should be served really cold.", "For the sauce, mix the mustard, lemon juice, sugar, salt, pepper and dried dill in a bowl until well combined. Gradually whisk in the oil until you have a loose, thick dressing. You may need a little more oil. Pour into a small serving bowl.", "Carefully rinse the fish under cold running water, but not so much that no remnants of dill remain. Dry with kitchen paper.", "Thinly slice the gravad lax at an angle and present on a large serving dish. Serve alongside the cucumber salad and the mustard sauce with buttered rye bread."]}, {"isVegetarian": true, "title": "Homemade Irish cream", "url": "www_bbc_co_uk_food_recipes_homemade_irish_cream_18863", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/homemade_irish_cream_18863_16x9.jpg", "ingredients": ["250ml/9fl oz single cream ", "1x 397g/14oz tin condensed milk", "350ml/12fl oz Irish whiskey", "1 tsp Camp coffee essence", "3 tsp chocolate sauce", "1 tsp vanilla essence", "1 tsp almond essence"], "serves": "Makes 1 litre/1¾ pints", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Sterilise the bottles for the liqueur: wash in very hot water or on the hot cycle of a dishwasher.  Preheat the oven to 160C/325F/Gas 3. Place the bottles on a baking tray and dry in the oven for 10-15 minutes. Leave to cool. ", "Pour all the ingredients into a blender and blend on high for 30 seconds.  Add extra Camp or chocolate to taste.   ", "Pour into sterilised bottles and store in the fridge. (The liqueur will keep for up to two months.) Shake well before using."]}, {"isVegetarian": false, "title": "Monster meatball pitta", "url": "www_bbc_co_uk_food_recipes_homemade_lamb_meatballs_15794", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz lamb mince", "2 tsp ground cumin", "oil, for frying", "salt and pepper", "100g/3½oz plain yoghurt, to serve", "1 tsp dried mixed herbs, to serve", "4 wholemeal pitta breads, to serve", "1 lettuce, to serve", "4 medium tomatoes", "1 cucumber", "oil. for drizzling", "1 tsp dried mixed herbs "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large bowl, mix the mince, cumin and a little salt and pepper together well.", "Divide the mixture into 16 even-sized pieces. Roll each piece into a ball about the size of a golf ball and set aside.", "Heat a large frying pan, or two smaller frying pans, over a medium heat. Once hot, add a dash of oil and carefully put the meatballs in the pan. Cook for 15 minutes, or until cooked through, rolling the meatballs around from time to time to ensure even cooking on all sides.", "Meanwhile, make the salad. Cut the tomatoes into cubes and put them in a bowl. Cut the cucumber into cubes and add to the salad bowl. Drizzle over a little oil and sprinkle with the mixed herbs. Season with a pinch of salt and pepper and toss together to make sure all the vegetables are evenly coated in oil and herbs. Set aside.", "Mix together the yoghurt and mixed herbs and season to taste. ", "Lightly toast the pitta breads and cut open. Lay a few lettuce leaves inside each pitta. Top with four meatballs and spoon over the herby yoghurt. Serve immediately with the salad on the side. "]}]