[{"isVegetarian": false, "title": "Pan fried salmon with sauce vierge", "url": "www_bbc_co_uk_food_recipes_pan_fried_salmon_with_51607", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "8 thin slices salmon, about 1cm/½in thick", "120ml/4fl oz extra virgin olive oil", "1 lemon, juice only", "2 tomatoes, skins and seeds removed, flesh diced", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "2 courgettes, diced", "2 tbsp chopped fresh tarragon", "2 tbsp chopped fresh dill", "2 tbsp chopped fresh parsley", "2 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan until hot, add the butter then add the salmon and fry on each side for two minutes.", "Pour the olive oil into a non-reactive pan. Whisk in the lemon juice until well-combined. Add the chopped tomatoes, shallot, garlic and courgette.", "Heat the pan over a medium heat until the mixture is just warmed through. ", "Add the tarragon, dill, parsley and chives and season, to taste, with salt and freshly ground black pepper. ", "To serve, divide the salmon between four plates then spoon the sauce vierge over the top."]}, {"isVegetarian": false, "title": "Pan-fried sea bream with mussels and fennel", "url": "www_bbc_co_uk_food_recipes_pan_fried_sea_beam_with_87333", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz mussels, scrubbed and debearded", "4 tbsp olive oil", "1 shallot, finely chopped", "1 garlic clove, finely chopped", "2 sprigs thyme", "25ml/1fl oz white wine ", "100ml/3½fl oz fish stock ", "1 leek, finely chopped", "¼ celeriac, roughly chopped", "1 carrot, roughly chopped", "1 tbsp crème fraîche ", "1 small bunch chives, finely chopped ", "2 x sea bream fillets (roughly 180–200g/6½–7¼oz each), skin on", "1 fennel bulb, quartered, core removed, julienned", "2 tbsp extra virgin olive oil ", "1 lemon, juice only ", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Discard any mussels with broken shells and any that refuse to close when tapped.", "Add 1 tablespoon olive oil in a large, lidded saucepan over a medium-high heat. Add the shallot and garlic and sweat for 1 minute. Add the thyme, white wine and fish stock and bring to a simmer. Add the mussels, cover and steam for 3–4 minutes, stirring half way through. Strain the mussels, reserving the cooking liquor, and set aside. Discard any mussels that remain closed. ", "Add 1 tablespoon olive oil in a saucepan over a medium heat. Add the leek, celeriac and carrot and cook for 2 minutes until soft. Add half of the mussel cooking liquor and bring to a simmer. Add the crème fraîche, chives and cooked mussels and cook until warmed through.", "Score the fish skins and season with salt. Place a large frying pan over a medium heat and add 2 tablespoons olive oil. Once hot, add the fish, skin side down and cook for 2–3 minutes then turn over and cook the flesh for 1 minute or until cooked (a cocktail stick should enter the fish with no resistance).", "Toss the fennel with the extra virgin olive oil and lemon juice. Season.", "To serve, divide the fennel between two plates, spoon over the mussels and vegetables, place the sea bream fillet on top and drizzle over the sauce."]}, {"isVegetarian": false, "title": "Pan fried scallops with caramelised cauliflower purée and cumin velouté", "url": "www_bbc_co_uk_food_recipes_pan_fried_scallops_with_48595", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 shallot, sliced", "1 large sprig thyme", "1 bay leaf", "90g/3¼oz honey", "2½ tbsp white wine vinegar", "15g/½oz salt", "pinch white peppercorns", "1 cauliflower, cut into florets", "50g/2oz butter", "2 large cauliflowers, cut into florets", "50g/2oz unsalted butter", "drizzle white truffle oil", "salt and freshly ground black pepper", "75g/2½oz butter", "110g/4oz shallots, finely sliced", "8g cumin seeds, toasted and lightly blitzed in a food processor", "250g/9oz button mushrooms, sliced", "500ml/18fl oz fish stock", "500ml/18fl oz Gewürztraminer wine", "500ml/18fl oz double cream", "8 large scallops", "2 tbsp olive oil", "1 lemon, juice only", "1 tbsp chopped chives", "1 tbsp micro herbs ", "1 tbsp white truffle oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sousing liquid, add the olive oil to a large saucepan and sweat the shallot without colouring. Add the thyme and bay leaf and continue to cook for another minute. ", "Add the honey, white wine vinegar, salt, peppercorns and 600ml/20fl oz water. Bring to a rolling boil for 10 minutes, then pass through a sieve into a clean saucepan and set aside to cool.", "Add the cauliflower florets to the cooled liquid and bring to the boil, then reduce to a gentle simmer. Cook for 20 minutes, or until the florets are soft, then leave to cool in the liquid.", "Remove the cauliflower from the liquid and pat dry. Heat a non-stick frying pan until hot. Add the butter and the cauliflower and cook until caramelised. Set aside until ready to serve.", "For the caramelised cauliflower purée, place the cauliflower in a saucepan and cover with water. Bring to the boil and simmer until fully cooked. ", "Strain the cauliflower over a bowl, reserving the cooking liquor.", "Place the cauliflower into a blender and blend to a fine purée.", "Put a frying pans onto the heat and add the butter. Add the purée and fry until it stars to caramelise, whisking occasionally.", "When the mixture is nice and brown, return the purée to the blender and blitz once more until very fine and smooth.", "Add a little truffle oil and, if necessary, thin the purée by adding a little cooking liquor. Season to taste with salt and freshly ground black pepper.", "For the cumin velouté, add a third of the butter to a frying pan over a medium heat. Add the shallots, cumin and a pinch of salt. Fry until softened but not coloured. Add the mushrooms and cook until slippery.", "Add the fish stock, bring to the boil and cook until the volume of liquid has reduced by half. Add the wine and reduce by a third.", "Add the cream, bring to the boil and cook until thick enough to coat the back of a spoon.", "Pass through a fine sieve into a clean saucepan then whisk in the remaining butter and season to taste with salt and freshly ground black pepper.", "For the scallops, season the scallops on both sides with salt and freshly ground black pepper. Heat the oil in a non-stick frying pan and fry the scallops for two minutes on each side. Remove from the heat and squeeze a little lemon juice over the top.", "For the cumin velouté, use a hand blender to form a froth.", "To serve, spread some cauliflower purée in the middle of each plate then place the scallops and caramelised cauliflower around. Dress the chives and micro herbs with lemon juice, olive oil, salt and black pepper and place over the scallops. Drizzle with a little truffle oil and dots of the velouté froth, then serve. "]}, {"isVegetarian": false, "title": "Oysters in coconut crumb with beetroot mayonnaise", "url": "www_bbc_co_uk_food_recipes_pan_fried_oysters_in_01256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cooked beetroot, peeled and roughly chopped", "1 tbsp Dijon mustard", "1 medium free-range egg yolk", "2 tbsp balsamic vinegar", "100ml/3½fl oz olive oil", "salt and freshly ground black pepper", "1 celery heart, grated on a mandolin, leaves reserved", "100g/3½oz lamb’s lettuce", "100g/3½oz beet salad leaves", "dash olive oil", "1 lemon, juice only", "6 medium oysters", "2 tbsp plain flour", "1 medium free-range egg, beaten", "2 tbsp panko breadcrumbs", "2 tbsp desiccated coconut", "dash olive oil", "knob of butter"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the beetroot mayonnaise, blend the beetroot with the mustard, egg yolk and vinegar in a food processor, gradually adding the oil to make a purée. Season with salt and pepper and set aside.", "For the salad, toss all the ingredients together in a large bowl and season. ", "Open the oyster shells using a shucker. Loosen each oyster from the base and discard the shell. Dry the oysters on kitchen paper. ", "Put the flour and egg in separate shallow bowls. Combine the breadcrumbs and coconut in a third bowl. One at a time, dip the oysters in the flour, then the egg and finally the breadcrumb mix, coating liberally.", "Fry the oysters immediately in a little oil and  butter over a medium heat for 2–3 minutes on each side, or until golden. ", "To serve, dot the beetroot mayonnaise across two serving plates, place the salad in the centre with the oysters around the edge. "]}, {"isVegetarian": false, "title": "Pan roasted duck breast with orange sauce, carrots and courgettes", "url": "www_bbc_co_uk_food_recipes_pan_roasted_duck_breast_88974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 duck breasts", "75g/3oz white caster sugar", "2 oranges, zest and juice", "2 tbsp sherry vinegar", "300ml/11fl oz reduced chicken stock", "3 carrots, peeled and sliced", "3 courgettes, thickly sliced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "Heat an ovenproof frying pan until very hot, add the duck breasts, fat-side down and cook for 3-4 minutes, or until golden-brown. Turn over and cook for a further 1-2 minutes. ", "Place into the oven for 8-10 minutes.", "Remove from the oven and set the duck aside to rest for five minutes.", "Meanwhile, heat a frying pan until hot, add the caster sugar and cook to a caramel.", "Remove from the heat then add the orange juice and vinegar, return to the heat and cook for a couple of minutes.", "Add the chicken stock, return to a simmer and cook for 3-4 minutes until just thickened.", "Add the orange zest then season with salt and freshly ground black pepper.", "Bring a pan of salted water to the boil, cover with a steamer insert then add the carrots, cover and steam for two minutes.", "Add the courgettes and steam for another three minutes until just tender.", "To serve, carve the duck into thick slices.Place the carrots and courgettes onto the plate the lay the sliced duck over the top. Finish with a spoonful of orange sauce."]}, {"isVegetarian": false, "title": "Chicken with chorizo bean stew", "url": "www_bbc_co_uk_food_recipes_pan_roasted_chicken_with_06765", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan_roasted_chicken_with_06765_16x9.jpg", "ingredients": ["3 tbsp olive oil", "40g/1½oz butter", "2 whole chicken legs, cut into drumsticks and thighs", "2 shallots", "1 lemon, cut in half", "1 garlic bulb, cut in half", "200g/7oz chorizo, cut into small chunks", "2 tomatoes, peeled, seeds removed, finely chopped", "660g/1lb 8oz tinned white haricot beans, drained", "2 sprigs rosemary, finely chopped", "4 sprigs thyme, finely chopped", "250ml/9fl oz chicken stock", "2 tbsp roughly chopped flatleaf parsley", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat an ovenproof frying pan until hot, add half of the olive oil and half of the butter. When the butter is foaming, add the chicken and fry until just golden-brown. ", "Cut one shallot in half lengthways and add to the pan along with the lemon and half the rosemary and thyme. Add the garlic, reserving two garlic cloves.", "Roast in the oven for 15 minutes, or until golden-brown and the chicken is cooked through. ", "Meanwhile, finely chop the remaining shallot and reserved garlic cloves.", "Heat a large frying pan or sauté pan until medium-hot. Add the remainder of the olive oil and the chorizo and cook for five minutes, or until the oil has changed colour and the chorizo is crisp around the edges. ", "Add the tomatoes and the chopped garlic and shallot. Gently fry for a minute, then add the beans and the rest of the rosemary and thyme and cook for a further two minutes.", "Add the stock and bring to a simmer. Cook for 4-5 minutes, or until the shallot has softened and the volume of liquid has slightly reduced. ", "Stir in the last of the butter and the parsley. Season to taste with plenty of black pepper.", "Ladle the beans into the middle of two soup plates, top with some chicken, then place a piece of lemon, shallot and garlic alongside."]}, {"isVegetarian": false, "title": "Pan roasted duck with ginger chutney, asparagus and Tenderstem broccoli", "url": "www_bbc_co_uk_food_recipes_pan_roasted_duck_with_89879", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2½ tbsp rapeseed oil", "1 tsp cumin seeds", "2 tsp sesame seeds", "200g/7oz fresh root ginger, thinly sliced", "1 green chilli, sliced open", "salt, to taste", "1 tsp red chilli powder", "100g/3½oz tamarind paste", "100g/3½oz palm sugar ", "pinch asafoetida", "1 dried red chilli", "½ tsp mustard seeds", "5-6 curry leaves", "4 duck breasts, trimmed and scored", "12 spears asparagus, trimmed", "12 spears Tenderstem broccoli", "2 tbsp olive oil", "salt and freshly ground black pepper", "2 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the chutney, heat two tablespoons of the oil in a frying pan, fry the cumin seeds for 1-2 minutes then add the sesame seeds, ginger and green chilli and season with a little salt. ", "Stir for 2-3 minutes and then cover the mixture with a circle of greaseproof paper and let it cook slowly for 40-45 minutes until the ginger is almost cooked. ", "Let the mixture cool then transfer to a food processor with the tamarind paste, palm sugar and 50ml/2fl oz water and blend to a fine paste. ", "Heat the remaining oil in a separate pan, add the asafoetida, red chilli and mustard seeds. As the mustard seeds pop, add the curry leaves, stir for 30 seconds then pour into the ginger chutney mixture and mix well. Set aside.", "For the duck, preheat the oven to 200C/400F/Gas 6.", "Heat a frying pan until very hot, add the duck breasts, fat side down and cook until golden brown.", "Turn the duck breasts over, to seal the other side, then transfer the pan to the oven and roast for 10-12 minutes.Remove the duck from the oven and rest for 5-6 minutes.", "Meanwhile, bring a pan of salted water to the boil, add the asparagus and broccoli and boil for 2-3 minutes until just tender.", "Drain the asparagus and broccoli and mix with the olive oil.", "Heat a griddle pan until hot, add the asparagus and broccoli and sear on each side until charred.", "Remove and season with salt and freshly ground black pepper.", "To serve, lay the asparagus and broccoli onto the plate. Carve the duck into slices and lay on top then place a spoonful of chutney alongside. Finish with a scattering of coriander cress."]}, {"isVegetarian": false, "title": "Pan roasted potato and sardine tart with sun blush tomatoes", "url": "www_bbc_co_uk_food_recipes_pan_roasted_potato_and_16177", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 plum tomatoes, halved lengthways", "2 sprigs thyme", "salt and freshly ground black pepper", "2 tbsp olive oil", "125g/4½ oz rocket leaves", "50g/2oz parmesan, finely grated", "40g/1½ oz pine nuts, lightly toasted", "1 garlic clove, finely chopped", "4-5 tbsp olive oil", "salt and freshly ground black pepper", "5 tbsp olive oil", "450g/1 lb waxy potatoes, peeled and sliced thinly", "8 fresh sardines, scaled and filleted", "2 tsp picked oregano leaves", "vegetable oil, for frying the capers", "2 tbsp capers", "pecorino shavings"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomatoes, preheat the oven to 150C/300F/Gas 2.", "Place the tomatoes, cut-side up, onto a roasting tray.", "Sprinkle with the thyme, salt and freshly ground black pepper, to taste, and olive oil.", "Roast for 1-2 hours until the moisture has mainly evaporated and the tomatoes have dried out.", "Remove the tomatoes from the oven and set aside to cool.", "For the pesto, place all the ingredients, except the oil and seasoning, into a pestle and mortar or food processor and blend to a coarse purée. Then gradually add the oil, continuing to blend until you have a thick purée.", "Season the pesto to taste with salt and freshly ground black pepper.", "For the tart, preheat the oven to 200C/400F/Gas 6.", "Heat two small (18-20cm/7-8in) ovenproof frying pans over a medium heat and add a few tablespoons of olive oil to each.", "Arrange the sliced potatoes in just overlapping circles so they cover the bottom of the pans.", "Season with salt and freshly ground black pepper and reduce the heat to low.", "Cook for about five minutes until the potatoes turn golden brown on the edges and are translucent in the middle.", "Spread the rocket pesto over the potato layer.", "Place the sardines on top, with the tail pointing towards the middle, in a fan shape around the pan then sprinkle the oregano over the top.", "Place the pans in the oven and bake for 15-20 minutes until golden brown on the base.", "When the potatoes are cooked and the top is golden brown, remove the tarts from the oven and cool slightly before tipping out of the pan.", "Meanwhile, heat a frying pan with about 2cm/1in of vegetable oil, until just shimmering.", "Add the capers and cook until crispy then remove and drain onto kitchen paper.", "To serve, place each tart onto a serving plate and place a few roasted tomatoes on top. Finish with some of the deep-fried capers and pecorino shavings."]}, {"isVegetarian": false, "title": "Pan-roasted turbot with ratatouille and chive beurre blanc", "url": "www_bbc_co_uk_food_recipes_pan_roasted_turbot_with_97893", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 red onion, chopped", "1 red pepper, cut into 1cm/½in dice", "1 yellow pepper, cut into 1cm/½in dice", "2 garlic cloves, peeled, roughly chopped", "1 aubergine, cut into 1cm/½in dice ", "2 courgettes, cut into 1cm/½in dice", "3 tomatoes, cut into 1cm/½in dice ", "2 tbsp fresh basil leaves, finely chopped", "salt and freshly ground black pepper", "2 shallots, peeled, finely sliced", "1 tbsp white wine vinegar", "4 tbsp white wine", "1 tbsp cold water", "225g/8oz salted butter, cut into cubes", "salt and freshly ground black pepper", "4 tbsp chives, chopped", "4 x 175g/6oz turbot fillets", "salt and freshly ground black pepper", "50g/2oz butter", "75ml/3fl oz white wine"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the ratatouille, heat a frying pan over a medium to high heat, add the olive oil and, when it’s hot, add the onion and peppers. Fry for 2-3 minutes, or until softened.", "Add the garlic, aubergine and courgettes and fry for a further 2-3 minutes, stirring occasionally.", "Add the tomatoes and continue to cook for a further minute.", "Sprinkle over the basil leaves and season, to taste, with salt and freshly ground black pepper.", "For the chive beurre blanc, bring the finely sliced shallots, white wine vinegar and white wine to the boil in a non-reactive saucepan. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan. ", "Add the cold water and continue to simmer until the volume of liquid remaining in the pan is about one tablespoon. ", "Reduce the heat to low, then gradually whisk in the butter, 25g/1oz at a time, waiting until all of the butter has melted and incorporated into the mixture before adding more. ", "Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives. Set aside at room temperature until needed (do not refrigerate as the sauce will separate).", "For the turbot, preheat the oven to 200C/400F/Gas 6. Season the turbot fillets with salt and freshly ground black pepper.", "Heat a frying pan over a medium heat, add the butter and, when it’s foaming, add the turbot fillets, skin-side down (in batches if necessary). Fry for 1-2 minutes, or until the skin is crisp and golden-brown, then turn the fish over and add the wine.", "Cover the fish with the cartouche and transfer the pan to the oven for 3-4 minutes, or until just cooked through (the fish is cooked through when the flesh is opaque).", "Remove the fish from the pan and set aside to rest for 1-2 minutes.", "To serve, spoon a quarter of the ratatouille into the centre of each of four serving plates. Place one fillet of turbot on top of each portion. Spoon over the chive beurre blanc."]}, {"isVegetarian": false, "title": "Panang chicken stir-fry", "url": "www_bbc_co_uk_food_recipes_panang_chicken_stir-fry_00869", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/panang_chicken_stir-fry_00869_16x9.jpg", "ingredients": ["225g/8oz long-grain rice", "2 tbsp olive oil", "2 chicken breasts, cut into very thin strips", "1 tbsp clear honey", "1 onion, finely chopped", "1 courgette, finely chopped", "1 red pepper, finely chopped", "2 sticks celery, finely chopped", "2cm/¾in piece fresh root ginger, finely grated", "2 garlic cloves, crushed", "1 tbsp medium curry powder", "3 tbsp soy sauce", "1 tbsp sweet chilli sauce ", "½ lime, juice only", "salt and freshly ground black pepper", "4 lime wedges, to serve"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a saucepan of water to the boil and cook the rice according to the packet instructions (about 10–12 minutes). Drain well, rinse and set aside to cool completely.", "When the rice is cool, heat the oil in a frying pan, season the chicken with salt and pepper and add to the pan. Drizzle with the honey and fry quickly over a high heat for a few minutes until golden and just cooked. Remove from the pan and set aside. ", "Add the onion, courgette, red pepper and celery to the pan. Fry for 4–5 minutes, stirring. Stir in the ginger, garlic and curry powder and fry for another minute. Add the rice, soy sauce, chilli sauce and lime juice. Toss and season with little salt and pepper. Return the chicken to the pan.  ", "Spoon into hot bowls and serve with the lime wedges. "]}, {"isVegetarian": true, "title": "Pancake Day pancakes", "url": "www_bbc_co_uk_food_recipes_pancakebatter_13556", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakebatter_13556_16x9.jpg", "ingredients": ["120g/4oz plain flour", "pinch salt", "2 free-range eggs", "210ml/7fl oz milk", "90ml/3fl oz water", "1 tbsp vegetable oil", "butter, for frying", "caster sugar", "lemon juice", "lemon wedges"], "serves": "6 pancakes", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Mix the flour and salt together in a large bowl. ", "Make a well in the centre and crack in the eggs. ", "In a separate bowl mix together the milk and the water. ", "Beat the eggs into the flour with a wooden spoon and gradually beat in the milk and water mixture to get a smooth liquid the consistency of single cream. ", "Stir in the oil and allow to stand for 30 minutes before using.", "Heat a non-stick frying pan until very hot, then add a small knob of butter. Ladle in a ladleful of the batter, quickly turning the pan to coat the base evenly with the batter. Cook for 30 seconds to one minute, until the base is lightly browned.", "Using a palette knife, gently flip the pancake over and cook on the other side for a few seconds, until lightly browned. Slide the pancake onto a plate, cover with greaseproof paper and keep warm. Repeat the process with the remaining batter.", "To serve, sprinkle the pancakes with caster sugar and lemon juice, then fold twice to form triangles. Serve the lemon wedges alongside."]}, {"isVegetarian": true, "title": "Pancakes with berries and white chocolate", "url": "www_bbc_co_uk_food_recipes_pancakes_with_berries_54226", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakes_with_berries_54226_16x9.jpg", "ingredients": ["50g/1¾oz plain flour", "small pinch salt", "1 medium free-range egg", "150ml/5fl oz milk", "2 tsp vegetable oil or melted butter, plus extra for frying", "100g/3½oz white chocolate, broken into small pieces", "200g/7oz mixed frozen berries"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the flour and salt in a large bowl. Make a well in the centre, pour in the milk and crack in the egg.  Using a whisk, gradually incorporate the flour into the wet ingredients until you have a smooth batter. Add the vegetable oil and mix thoroughly.", "Heat a large frying pan over a medium heat. Add a little oil and use kitchen paper to smear it all over the base of the pan. Add a small ladleful of batter and swirl it around the pan to create a thin, even layer. Cook for 1-2 minutes, or until the batter is a little darker and set in the middle (to check, lift the edge of the pancake and check the underside is lightly golden-brown). Flip it over and cook the other side for 30-40 seconds. Transfer to a warm plate and cover with a clean tea towel to keep it warm. Cook the remaining batter in the same way to make 3 more pancakes. ", "For the topping, melt the chocolate in a heatproof bowl set over a pan of gently simmering water. Alternatively, melt the chocolate in short bursts in a microwave.", "Put a pancake on each serving plate and divide the frozen berries between them. Drizzle the melted chocolate over the top and serve immediately. The heat of the pancakes and chocolate will thaw the berries quickly, but you want them to be chilled (it’s the contrast of temperatures that makes it so special). "]}, {"isVegetarian": true, "title": "Pancakes with feta cheese glazed with cinnamon, honey, orange and saffron", "url": "www_bbc_co_uk_food_recipes_pancakes_with_feta_47079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz plain flour", "15g/½oz caster sugar", "pinch salt ", "4 medium free-range eggs", "350ml/12fl oz full-fat milk", "50g/1¾oz melted butter, for frying", "1 Romaine lettuce, cut into quarters", "4 tbsp olive oil", "2 oranges, juice only", "1 cinnamon stick, broken in half", "2 tbsp clear honey", "pinch saffron", "150g/5½oz feta cheese, crumbled"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, combine the flour, sugar and salt, then mix in the eggs using a whisk. Add the milk gradually to avoid any lumps.", "To cook the pancakes, add a smear of melted butter to a non-stick frying pan, using a pastry brush. Ladle in some batter, swirling around to coat the pan - it might take one or two test pancakes before you’ve got the amount of batter just right. Cook each pancake on both sides until golden-brown and then remove to a plate while you cook the next pancake.", "For the salad, place the cut lettuce into ice-cold water and leave for a couple of minutes. Just before serving, remove from the water and drizzle with olive oil.", "For the glaze, heat a medium saucepan and add the orange juice and cinnamon stick. Stir in the honey and saffron and cook until reduced to a syrupy glaze.", "Sprinkle the feta on the pancakes and fold them into quarters. Return the folded pancakes to the frying pan and pour over the glaze. Heat gently for a few minutes.", "Serve the pancakes with any remaining glaze poured on top. Serve the salad alongside."]}, {"isVegetarian": true, "title": "Pancakes served with roasted peaches and nectarines and lavender honey", "url": "www_bbc_co_uk_food_recipes_pancakesservedwithro_86540", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "200g/7oz plain flour", "350ml/12fl oz milk", "pinch of salt ", "2 tsp vegetable oil", "55g/2oz unsalted butter", "2 sprigs fresh lavender", "3½ tbsp honey", "2 peaches, quartered and stones removed", "2 nectarines, quartered and stones removed", "1 orange, juice only"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat oven to 180C/350F/Gas 4.", "For the pancakes, break the eggs into a bowl and whisk in the flour until it is a smooth batter. Whisk in the milk, salt and one teaspoon of vegetable oil.", "Using a paper kitchen towel, smear the base of a non-stick frying pan with the remaining oil before allowing to gently heat.", "When the pan is hot, ladle some of the pancake mixture in until it is evenly covering the base of the pan.", "Allow the pancake to colour until golden-brown underneath before turning and cooking the other side. Once golden-brown remove from the pan and place onto a plate. It is useful to separate the pancakes using small pieces of baking parchment paper. Repeat the process until there are eight pancakes. Place the pancakes into the oven to keep warm.", "For the roasted fruits, place the butter, one sprig of lavender and the honey into a non-stick, ovenproof pan and heat gently. Add the fruit to the pan and caramelise lightly before placing the pan into the oven and cooking for approximately five minutes.", "Remove the fruits from the oven. Add the orange juice to the fruits and use a wooden spoon to scrape the caramelised juices off the bottom and sides of the pan. Add another sprig of fresh lavender. Leave to rest.", "Remove the pancakes from the oven. To serve, place one pancake onto a plate, spoon in some of the fruit and its juice and fold or roll the pancake up. Repeat this for the rest of the pancakes."]}, {"isVegetarian": true, "title": "Pancakes with blueberry sauce", "url": "www_bbc_co_uk_food_recipes_pancakeswithblueberr_78069", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour", "1 tsp baking powder", "1 tbsp caster sugar", "1 free-range egg, beaten", "100-125ml /4-1½fl oz milk", "oil, for frying", "100g/3½oz fresh blueberries", "100ml/3½fl oz red wine", "pinch cinnamon", "1 tbsp caster sugar", "½ tsp vanilla extract", "1 tbsp flaked almonds ", "50ml/1¾fl oz double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes whisk together the self-raising flour, baking powder and sugar.", "Add the egg and milk gradually to form a thick batter.", "Heat a frying pan, coated with oil. Spoon the batter into rounds in batches, cooking 2-3 minutes per side. Keep warm.", "For the blueberry sauce, add all ingredients to a small saucepan and simmer for ten minutes, until reduced and syrupy.", "To serve, place the pancakes on a plate, drizzle with blueberry sauce, top with flaked almonds and pour cream around the outside."]}, {"isVegetarian": true, "title": "Pancakes with crushed nuts and hot chocolate sauce", "url": "www_bbc_co_uk_food_recipes_pancakeswithcrushedn_86112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour", "1 tsp baking powder", "2 free-range eggs", "150ml/¼ pint milk", "1 tbsp sultanas", "1 tbsp vegetable oil", "5 tbsp double cream", "4 tbsp chocolate and hazelnut spread", "2 tbsp orange liqueur", "1 tsp chopped satsuma zest", "2 tbsp chopped pistachios, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pancakes, place the flour, baking powder, eggs and milk into a large bowl and whisk together to make a smooth batter. Add the sultanas and stir.", "Heat the vegetable oil in a non-stick frying pan and pour in a ladleful of batter, swirling the pan so that the batter covers the base in a thin layer. Fry for 1-2 minutes on each side until golden-brown. Remove the pancake from the pan and set aside to keep warm. Repeat the process with the remaining batter.", "For the chocolate sauce, place the cream, chocolate and hazelnut spread, orange liqueur and satsuma zest in a small pan and heat gently, stirring frequently, until smooth and well combined.", "To serve, place the pancakes onto serving plates, drizzle over the sauce and sprinkle over the pistachio nuts."]}, {"isVegetarian": false, "title": "Pancakes with crispy maple bacon", "url": "www_bbc_co_uk_food_recipes_pancakeswithcrispyma_72298", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["170g/6oz self-raising flour", "1 tbsp baking powder", "115g/4oz caster sugar", "2 eggs", "275ml/10fl oz milk", "230g/8oz smoked streaky bacon", "maple syrup", "butter for frying"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour, baking powder and caster sugar into a bowl.", "Using a whisk, add the eggs and the milk. Be careful not to overwhisk. Put to one side.", "Put the bacon on an oven tray and bake until crisp.", "Remove and brush over a little of the maple syrup.", "To cook the pancakes, preheat a non-stick frying pan. Add a little butter and pour around three spoonfuls of the mixture into the pan - the pancakes should be quite small. Cook until golden brown and turn over to colour the other side. Remove and place on a large plate.", "To serve, pile the pancakes on the plate and arrange the bacon around and on top. Drizzle with maple syrup and serve."]}, {"isVegetarian": true, "title": "Pancakes with maple syrup", "url": "www_bbc_co_uk_food_recipes_pancakeswithmaplesyr_79985", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range eggs", "½ orange, zest only", "100g/3½oz self-raising flour", "½tsp baking powder", "75ml/2¾fl oz milk", "25g/1oz unsalted butter", "1 tbsp vegetable oil", "icing sugar, for dusting", "½ orange, peeled and segmented", "3 tbsp maple syrup"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the eggs, orange zest, flour, baking powder and milk into a large bowl and whisk together to form a smooth batter.", "Heat the butter and oil in a shallow frying pan over a medium heat.", "Ladle a quarter of the batter mixture to the pan to make a large thick pancake. Cook for one minute on each side, until golden.", "Transfer to a baking sheet and repeat the pancake-making process to cook three more pancakes.", "Once you have four pancakes placed on the baking sheet, place into the oven to bake for two minutes.", "To serve, stack the pancakes onto a warm plate and dust with icing sugar. Arrange the orange segments around the plate and drizzle the pancakes with maple syrup."]}, {"isVegetarian": false, "title": "Pancetta and parmesan puffs", "url": "www_bbc_co_uk_food_recipes_pancetta_and_parmesan_96186", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancetta_and_parmesan_96186_16x9.jpg", "ingredients": ["50g/1¾oz butter", "125ml/4½fl oz milk", "50g/1¾oz pancetta", "1 tbsp oil, for frying", "25g/1oz parmesan", "75g/3oz plain flour ", "1 tsp chilli powder (optional)", "pinch of salt", "2 free-range eggs"], "serves": "Makes 25 puffs", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3. Line two baking sheets with parchment paper and set aside. ", "Put a small frying pan on a medium heat for the pancetta. ", "Then, put the butter and milk in a medium pan over a low heat and leave the butter to melt. ", "Meanwhile, tip the pancetta into the frying pan with a drizzle of oil and cook for about four minutes, tossing every so often.", "Once the butter has melted into the milk, whack up the heat and bring to the boil.", "Meanwhile, finely grate the parmesan and tip it into a medium bowl. Stir in the flour, chilli powder (if using) and a pinch of salt.", "As soon as the buttery milk boils, remove the pan from the heat and add the flour mixture to it. Beat it really hard with a wooden spoon until the mixture starts to leave the sides of the pan. Then tip it into a medium bowl, spread it out all around the inside and leave it for a few minutes until cool to touch.", "Once the pancetta is crisp and golden, remove it from the heat and tip it onto kitchen towel to drain off the excess fat.  Then finely chop it and set aside.", "Once the flour mix has cooled down a little, add the eggs, one at a time beating hard between each addition. When the egg first goes in, the mixture will look a little less-than-pleasant as if it won’t mix in, but keep beating it really hard and it will come good. Then stir in the pancetta. ", "Now, here you can either spoon blobs of the choux pastry onto the baking sheets or, (my favourite method with my piping bag obsession) pipe the blobs using a disposable piping bag cut to give a 3cm/1¼in opening. Either way, make them about 2-3cm/¾–1¼in in diameter and space them a little bit apart. This makes about 25. Use a finger slightly moistened with water to push down any end bits that may be sticking up (so they don’t burn in the oven). Then bake for 25 minutes.", "The puffs should be crisp and golden on top when cooked. These are really best served piping hot while they are still slightly moist as they are cut open."]}, {"isVegetarian": false, "title": "Pancetta beef burger with tarragon mayonnaise", "url": "www_bbc_co_uk_food_recipes_pancetta_beef_burger_25307", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancetta_beef_burger_25307_16x9.jpg", "ingredients": ["70g/2½oz fresh white breadcrumbs", "2 tbsp whole milk", "500g/1lb 2oz beef mince", "1 garlic clove, crushed", "1 tbsp tomato purée", "1 tbsp Worcestershire sauce", "2 tbsp chopped flatleaf parsley leaves", "12 thin slices round pancetta", "salt and freshly ground black pepper", "150g/5½oz mayonnaise", "1 tsp Dijon mustard", "1 tbsp chopped fresh tarragon leaves", "6 ciabatta or crusty bread rolls, halved ", "60g/2¼oz spinach leaves", "150g/5½oz caramelised onion relish, from a jar", "150g/5½oz mature Cheddar, thinly sliced", "6 gherkins, thinly sliced "], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the breadcrumbs and milk in a bowl, mix and set aside for 5 minutes, or until the milk is absorbed. Add the mince, garlic, tomato purée, Worcestershire sauce and parsley, season with salt and pepper and mix well.", "Shape the mixture into six large, flat patties. Place a slice of pancetta on both sides of each patty. Heat a large frying pan over a high heat. Add the patties and cook, in batches, for 4 minutes on each side, or until the pancetta is cooked and the burgers are done to your liking. ", "For the tarragon mayonnaise, put the mayonnaise, mustard and tarragon in a bowl and mix. Set aside.", "Preheat the grill to high, then toast the rolls. Spread them with the tarragon mayonnaise and top with the spinach, patties, caramelised onion rellish and Cheddar. Serve with the gherkins."]}, {"isVegetarian": true, "title": "Pancakes with chocolate sauce", "url": "www_bbc_co_uk_food_recipes_pancakeswithchocolat_76457", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancakeswithchocolat_76457_16x9.jpg", "ingredients": ["85g/3oz self-raising flour", "1 free-range egg", "300ml/½ pint milk (approx)", "drizzle oil", "55g/2oz caster sugar", "splash hot water", "30g/1¼oz cocoa powder"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pancakes, whisk the flour, egg and milk in a bowl to make a batter. ", "Heat the oil in a pancake pan and ladle the mixture in. Allow the mixture to coat the pan and fry the pancake for 1-2 minutes on each side or until golden. ", "Repeat to make further pancakes.", "For the sauce, whisk the sugar, water and cocoa together in a small pan over a gentle heat.  Add extra water depending on how thick you require the sauce.", "To serve, transfer the pancakes to a serving plate and drizzle the chocolate sauce over."]}, {"isVegetarian": true, "title": "Pancakes with blueberry sauce", "url": "www_bbc_co_uk_food_recipes_pancakeswithblueberr_78335", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz self-raising flour", "½ tsp baking powder", "2 free-range eggs", "60ml/2¼fl oz milk", "½ punnet blueberries ", "2 tbsp icing sugar", "25g/1oz butter", "4 tbsp red wine", "4 tbsp sugar", "2 cloves", "pinch mixed spice", "½ punnet blueberries"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place in a bowl the self-raising flour, baking powder, eggs and milk.  Mix together to form a thick batter.", "Add the icing sugar and blueberries.", "Melt the butter in a frying pan and ladle in the blueberry pancake mix a ladleful at a time.  Cook the pancakes until golden brown, on both sides.", "Stack the blueberry pancakes and leave to one side.", "For the blueberry sauce, in a pan add the red wine with the sugar, cloves, mixed spice and the blueberries.", "Simmer for four minutes, and take off the heat.", "Put the sauce through a sieve and remove the cloves.", "To serve, place the stack of pancakes in the middle of the plate and drizzle with the blueberry sauce."]}, {"isVegetarian": false, "title": "Pancetta-baked eggs with a minted pea and feta salad", "url": "www_bbc_co_uk_food_recipes_pancettabakedeggswit_93866", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pancettabakedeggswit_93866_16x9.jpg", "ingredients": ["sunflower oil, for greasing", "12 slices pancetta", "3 free-range eggs", "125ml/4½fl oz double cream", "20g/¾oz freshly grated parmesan", "small handful fresh basil leaves, torn", "salt and freshly ground black pepper", "240g/8½oz frozen peas", "3 tbsp chopped fresh mint", "1 lemon, juice only", "2 tbsp olive oil", "50g/1¾oz baby spinach leaves", "100g/3½oz feta, crumbled", "lavosh bread (flatbreads), to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the baked pancetta eggs, preheat the oven to 180C/350F/Gas mark 4 and grease 4 holes of a12-hole muffin tray.", "Line each muffin hole with 3 slices of pancetta.", "Whisk the eggs, cream, parmesan and basil leaves together in a bowl until well combined. Season, to taste, with salt and freshly ground black pepper.", "Divide the mixture among the muffin holes and bake in the oven for 10-12 minutes, or until the eggs are just set.", "Meanwhile, for the pea and mint salad, pour boiling water over the frozen peas and set aside to stand for 2 minutes. Drain, then refresh in cold water.", "Mix the peas, mint, lemon juice and olive oil in a bowl until well combined. ", "To serve,  divide the spinach among each of 4 serving plates and spoon some pea and mint salad on top. Sprinkle over the crumbled feta. Serve the baked eggs alongside with the lavosh bread."]}, {"isVegetarian": false, "title": "Pancetta king prawns, pecorino and pear foam and a beetroot and apple salad", "url": "www_bbc_co_uk_food_recipes_pancettakingprawnspe_93112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4½fl oz single cream", "2 pears, peeled, core removed", "110g/4oz pecorino cheese, finely grated", "½ tsp xanthum gum (available from health food shops and online)", "6 large raw king prawns, peeled, de-veined", "6 wooden skewers, soaked in water for ten minutes", "6 thin slices smoked pancetta", "2 tbsp flour", "1 tsp smoked paprika", "salt and freshly ground black pepper", "2 free-range eggs, beaten", "2 tbsp vegetable oil, for frying", "4 small beetroots, cooked, peeled, finely diced", "1 Granny Smith apple, peeled, core removed, finely diced", "1 mandarin orange, peeled, white pith removed, segmented", "6 fresh mint leaves, finely chopped", "2 tbsp olive oil", "1 tbsp white wine vinegar", "½ pear, core removed, cut lengthways into thin slices", "small handful chopped fresh flatleaf parsley"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pecorino and pear foam, blend the cream and pears in a food processor to a fine purée and strain this mixture through a sieve.", "Heat the strained pear and cream mixture and grated pecorino in a saucepan over a low heat, stirring constantly, for 1-2 minutes, or until the cheese has melted. Add the xanthum gum to the mixture and whisk to dissolve and thicken the mixture. ", "When the mixture is cooled, pour into an espuma gun and charge with two gas chargers. Keep in the fridge until needed. (If you don't have an espuma gun, blend the sauce with a hand blender until light and foamy before serving.)", "For the prawns, thread the prawns onto the wooden skewers from top to bottom so that the prawns are threaded onto the skewers in a straight line. Wrap each prawn skewer in a piece of pancetta.", "Mix the flour and paprika together in a bowl and season, to taste, with salt and freshly ground black pepper. Whisk the eggs in a bowl. Dredge each prawn skewer in the flour, shake off any excess, then dip into the beaten egg. Dredge each prawn skewer in the flour again and shake off any excess.", "Heat the vegetable oil in a frying pan and fry the prawn skewers for 3-4 minutes, or until prawns are cooked through, golden-brown and crisp.  (You may need to do this in batches.)", "For the salad, mix all the ingredients together in a bowl until well combined.", "To serve, place the salad at one end of each of two serving plates. Spray the pecorino and pear foam into the middle of the plates and top with the battered prawns. Place the pear slices onto the otherend of each of the plates and scatter with the parsley."]}, {"isVegetarian": false, "title": "Pancetta-wrapped goats' cheese en croute with chilli apple chutney", "url": "www_bbc_co_uk_food_recipes_pancettawrappedgoats_85603", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp butter", "110g/4oz baby spinach leaves", "freshly grated nutmeg", "salt and freshly ground black pepper", "4 slices pancetta", "200g/7oz rindless soft goats' cheese log", "250g/9oz puff pastry, rolled out to 5mm/¼in thick", "1 free-range egg, beaten", "110g/4oz light muscovado sugar", "1 shallot, finely chopped", "1 tsp fresh ginger, finely chopped", "1 tsp mixed spice", "½ tsp dried chilli flakes", "2 apples, cored and chopped", "110g/4oz sultanas", "60ml/2½fl oz white wine vinegar"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the en croute, melt the butter in a frying pan over a medium heat. Add the spinach and cook until just wilted.", "Add a pinch of freshly grated nutmeg and season well with salt and freshly ground black pepper. Remove from the pan and leave to cool.", "Wrap the pancetta rashers around the goats' cheese.", "Place into the same hot frying pan and cook for two minutes on each side, then remove and set aside to cool.", "Cut the puff pastry into two large rounds. Place the spinach into the centre of one of the pastry rounds.", "Top the spinach with the cooled pancetta-wrapped goats' cheese and season well with salt and freshly ground black pepper.", "Brush the edge of the pastry round with the egg and place the remaining piece of pastry over the top. Press the pastry down and crimp the edges.", "Score the top of the pastry in a circular pattern and brush with the remaining egg wash. Place the pastry parcel onto a baking tray and transfer to the oven to bake for 20 minutes, or until golden brown and cooked through.", "For the chutney, heat a pan, add the sugar and allow to melt.", "Add all of the remaining chutney ingredients and cook for 15-20 minutes, until the apples are tender and the chutney has thickened slightly, then remove from the heat and allow to cool.", "To serve, place a half of the goats' cheese en croute onto each plate with a spoonful of chutney placed alongside."]}]