[{"ingredients": ["aceite en aerosol bajo en calorías", "1 cebolla, más o menos picada", "1 pimiento rojo, sin corazón, sin semillas y tostado", "1 diente de ajo, reducido a la mitad", "Muslos de pollo deshuesados ​​y sin piel, 250 g / 9 oz, cortados en trozos de 3cm / 1¼ pulgadas", "2 cucharaditas de chile en polvo", "200g / 7oz de arroz de grano largo y fácil de cocinar", "400 g de frijoles rojos, enjuagados y escurridos", "400 g de tomates cherry, en jugo natural", "200ml / 7fl oz de caldo de pollo", "sal y pimienta negra recién molida", "hojas frescas de cilantro, toscamente picadas", "rodajas de limón"], "method": ["Caliente una sartén grande con un mango ignífugo a fuego medio y rocíe ligeramente con aceite. Agregue la cebolla, el pimiento rojo, el ajo y el pollo. Cocine por 3 minutos, revolviendo continuamente.", "Precalentar la parrilla a un ajuste caliente.", "Agregue el chile en polvo, arroz, frijoles, tomates y caldo a la sartén. Sazone al gusto con sal y pimienta negra recién molida. Llevar a ebullición, luego reduzca el fuego y cocine a fuego lento durante 15 minutos.", "Coloque la sartén debajo de la parrilla y cocine hasta que esté dorada.", "Divida entre cuatro platos, decore con cilantro y sirva con trozos de lima."], "url": "www_bbc_co_uk_food_recipes_chicken_with_red_kidney_97909", "title": "Pollo con frijoles rojos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_red_kidney_97909_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz pueden frijoles rojos", "400ml / 14fl oz puede leche de coco", "1 bonete escocés, sin grano y picado", "2 cebollas de primavera; Cortado", "1 ramita de tomillo", "400g / 14 oz de arroz de grano largo", "sal marina y pimienta negra recién molida", "1 cebolla picada", "½ pimiento rojo, picado", "½ pimiento verde, picado", "½ pimiento amarillo, picado", "1 bonete escocés, sin grano y picado", "2 cucharadas de ketchup", "1 cucharada de salsa de browning", "2 cucharadas de azúcar", "1 cucharada de harina de maíz", "½ cucharadita de sal", "Harina de auto aumento 250g / 9 oz", "2-3 cucharadas de aceite", "Harina normal 175g / 6oz", "½ cucharadita de ajo en polvo", "3 cucharadas de condimento picante y caliente (ver consejos)", "1½ cucharada de condimento para todo uso (ver consejos)", "6 pechugas de pollo sin hueso", "aceite de girasol, para freír"], "method": ["Para el arroz", "Agregue el arroz y, si es necesario, un poco de agua hirviendo adicional para que el arroz esté cubierto. Coloque una tapa en la sartén y cocine de 12 a 15 minutos o hasta que el arroz esté cocido. Sazone al gusto con sal marina y pimienta negra recién molida y reserve.", "Para la salsa, haga hervir alrededor de 250 ml / 9 fl oz de agua. Agregue la cebolla picada, los pimientos y el bonete escocés y hiérvalos durante tres minutos. Agregue el ketchup, el jugo de salsa y el azúcar, luego cocine a fuego lento durante otros tres minutos.", "En un tazón pequeño, mezcle la harina de maíz con una cucharada de agua y agregue a la salsa para espesar. Revuelva bien, sazone al gusto con sal marina y pimienta negra recién molida y reserve en un lugar cálido.", "Para las albóndigas, mezcle la sal en la harina. Agregue agua para hacer una masa y amase bien, luego forme la mezcla en bolitas. Caliente el aceite en una sartén y fría las albóndigas durante 2-4 minutos hasta que estén doradas, luego escurra sobre papel de cocina y manténgalo caliente.", "Para el pollo, mezcle la harina común con el ajo en polvo y los condimentos en un tazón. Sumerja las pechugas de pollo en la mezcla hasta que estén bien cubiertas.", "Caliente el aceite en una freidora o sartén profunda a aproximadamente 170 ° C / 325 ° F. El aceite está lo suficientemente caliente cuando un cubo de pan flota en la superficie y se vuelve dorado. (PRECAUCIÓN: el aceite caliente puede ser peligroso. Nunca deje la bandeja desatendida).", "Freír el pollo, unas pocas piezas a la vez, hasta que esté cocido y dorado. Escurrir sobre papel de cocina y servir con el arroz y los guisantes, la salsa y las albóndigas."], "url": "www_bbc_co_uk_food_recipes_chicken_with_rice_peas_19832", "title": "Pollo con arroz, guisantes y albóndigas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mini filetes de pollo 400 g / 14 oz", "pimienta negra (opcional)", "2 cucharaditas de aceite vegetal", "2-3 ramitas de romero o tomillo (alternativamente use ½ cucharadita de hierbas secas)", "1 cebolla picada", "2 dientes de ajo, finamente picados o triturados", "1 pimiento (de cualquier color), sin semillas y picado en trozos de 1cm / ½ en trocitos", "1 calabacín, picado en trozos de 1cm / ½ en trocitos", "1 x 400 g / 14 oz pueden cortar tomates", "1 cucharadita de puré de tomate con cuchara", "1 cucharadita de salsa Worcestershire", "1 cucharadita de vinagre (balsámico o vino tinto)"], "method": ["Coloque los filetes de pollo en un plato grande apto para microondas con un tenedor y mézclelos con pimienta negra, si los usa. Rocíe con el aceite y mezcle las hierbas frescas o espolvoree con las hierbas secas. Lava tus manos.", "Cubra con una tapa o película adhesiva, dejando un área pequeña abierta, y cocine a máxima potencia durante dos minutos. Retire el plato, retire la película adhesiva y gire el pollo de manera que las partes cocidas del exterior estén en el centro. Vuelva a tapar y cocine por otro minuto.", "Retire el plato y transfiera el pollo a un plato con un tenedor.", "Agregue la cebolla y el ajo al plato. Cocine a máxima potencia durante dos minutos.", "Agregue el pimiento y el calabacín a las cebollas, mezcle bien y cocine a máxima potencia durante otros dos minutos.", "Agregue los tomates a las verduras. Mida en el puré de tomate, salsa Worcestershire y vinagre. Revuelve para combinar.", "Agregue el pollo y los jugos para que estén completamente cubiertos con salsa de tomate.", "Cubra el plato con la película adhesiva de la misma manera que antes y cocine a máxima potencia durante tres minutos.", "Con cuidado, retire la película adhesiva, manteniendo sus manos y muñecas fuera del camino, ya que el vapor puede causar quemaduras. Mezcle los filetes de pollo para que puedan cocinar uniformemente.", "Vuelva a tapar y cocine a máxima potencia durante otros cinco minutos.", "Retire el plato y déjelo reposar durante dos minutos. Con cuidado, retire la película adhesiva y compruebe que todo el pollo esté bien cocido (no rosa en el medio). De lo contrario, vuelva a tapar y cocine durante otros 1-2 minutos cada vez hasta que se cocinen."], "url": "www_bbc_co_uk_food_recipes_chicken_with_tomato_23577", "title": "Pollo con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_with_tomato_23577_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo medianas, sin piel y sin espinas", "Harina simple 100g / 3½", "1 puñado de pan rallado fino, tostado", "2 huevos, batidos con sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva virgen extra italiano", "4 tomates de ciruela grandes frescos, picados", "1 puñado de aceitunas negras deshuesadas, en rodajas", "3 cucharadas de perejil de flatillo, picado", "10 cucharadas de aceite de oliva italiano, para freír", "1 diente de ajo, en rodajas", "2 pizcas de chile seco y picado", "Hojas de espinaca 500 g / 1 lb 1½ oz, lavadas", "sal y pimienta negra recién molida, al gusto"], "method": ["Con la ayuda de un mazo de carne, bata las pechugas de pollo entre dos hojas de película adhesiva hasta que estén delgadas.", "Polvo de las pechugas de pollo en harina, luego sumerja cada una en el huevo y luego en las migas de pan, asegurándose de que cada pieza esté bien cubierta.", "Precaliente el aceite de oliva en una sartén grande y fríe con cuidado el pollo durante aproximadamente dos minutos en cada lado, hasta que se pongan dorados y crujientes. Coloque los senos dorados en un poco de rollo de cocina, permitiendo que el exceso de aceite se drene. Mantener caliente", "Para hacer la salsa, en un tazón grande, mezcle los tomates, las aceitunas y el perejil y sazone con un poco de aceite de oliva virgen extra y un poco de sal y pimienta. Permita que esta mezcla descanse.", "Mientras tanto, fría el ajo y la guindilla en dos cucharadas de aceite de oliva por aproximadamente 10 segundos. Inmediatamente agregue las hojas de espinaca, sazone con sal y cocine durante aproximadamente tres minutos, hasta que se ablanden.", "Para servir, ponga un poco de espinaca en el medio de un plato, coloque una pechuga de pollo encima y distribuya dos cucharadas de la mezcla fría de tomate encima.", "Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenallamilanese_72800", "title": "Pollo Milanese", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 cucharadas de aceite de oliva", "1 cebolla, en rodajas", "2 tallos de apio, más o menos picados", "2 zanahorias medianas, aproximadamente picadas", "6 pechugas de pollo, o muslos de pollo, huesos retirados", "175ml / 6fl oz de vino blanco", "3 cucharadas de puré de tomate", "500ml / 17 fl oz de caldo de pollo", "2 hojas de laurel", "2-3 hojas de salvia", "1 ramita de romero", "250g / 9oz de polenta fácil de cocinar", "botón de mantequilla", "25 g / 1 oz de queso parmesano"], "method": ["Calentar el aceite en una sartén y freír la cebolla, el apio y las zanahorias durante 4-5 minutos o hasta que se ablanden. Agregue las piezas de pollo y continúe cocinando durante 2-3 minutos o hasta que se doren un poco.", "Vierta el vino y continúe cocinando hasta que el volumen del líquido se haya reducido a la mitad. Agregue el puré de tomate y el caldo.", "Agregue las hierbas, reduzca el fuego y cocine a fuego lento durante 30 minutos, o hasta que el pollo esté bien cocido.", "Mientras tanto, cocine la polenta de acuerdo con las instrucciones del paquete. Agregue la mantequilla y el parmesano y revuelva hasta que estén bien combinados.", "Para servir, vierta la polenta en platos para servir y cubra con el pollo."], "url": "www_bbc_co_uk_food_recipes_chickenalocacciatore_70349", "title": "Cazador de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenalocacciatore_70349_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["30-55g / 1-2oz de pulpa de tamarindo seca, de un bloque", "agua caliente, para cubrir", "10-12 chiles rojos secos y calientes (de la variedad larga, cayena)", "Chalotes 140g / 5oz, picados", "5 dientes de ajo, pelados y picados", "3 rodajas finas de galanga fresca pelada, o jengibre fresco", "1 cucharada de limoncillo fresco que ha sido finamente cortado, cruzado", "6-8 raíces frescas de cilantro, bien lavadas y picadas en trozos gruesos (use hojas de cilantro si no están disponibles)", "1 rodaja fina de corteza de lima kaffir fresca, aproximadamente 4 cm x 0.5 cm / 1½ pulg x ¼ pulgada, o corteza seca, remojada en agua durante 30 minutos (sustituya la cáscara de lima ordinaria, sin la médula blanca, si no está disponible)", "½ cucharadita de pimienta blanca recién molida", "¼ de cucharadita de pasta de camarones, o 2 anchoas de una lata, picadas", "½ cucharadita de comino molido", "½ cucharadita de cilantro molido", "2 cucharadas de pimentón rojo brillante", "450 g / 1 libra de pechugas de pollo deshuesadas y peladas", "2 cucharadas de aceite de verdura o maní", "400ml / 14fl oz de lata de leche de coco, sin tocar durante tres horas o más", "5 cucharadas de pasta de curry rojo", "140g / 5oz de brotes de bambú en rodajas de una lata, escurridos y enjuagados", "4 hojas frescas de lima kaffir o 1 cucharadita de ralladura de limón", "2 cucharadas de salsa de pescado, o al gusto", "1 cucharadita de pasta de tamarindo o jugo de limón", "1 cucharadita de azúcar de palma o azúcar moreno", "15-20 hojas frescas de albahaca tailandesa (sagrada) u hojas de albahaca comunes"], "method": ["Si usa pasta de tamarindo, un par de horas antes de que desee preparar el curry (o preferiblemente la noche anterior), coloque la pulpa de tamarindo en un tazón pequeño. Agregue agua caliente o hirviendo para cubrir (si la pulpa está muy seca, use agua hirviendo). Remoje el tamarindo hasta que esté muy suave y flexible, durante unas horas o preferiblemente durante la noche.", "Para obtener la pulpa, quite las semillas de tamarindo y las fibras duras con los dedos. Descarte. Coloque la pulpa en un tamiz colocado sobre un recipiente y presione la pulpa a través del tamiz.", "Para la pasta de curry, remoje los chiles en cinco cucharadas de agua caliente durante 1-2 horas. (También puede ponerlos en un horno de microondas durante 2-3 minutos y luego dejarlos en remojo durante aproximadamente una hora).", "Coloque los chiles remojados, junto con su líquido de remojo, en el tazón de un procesador de alimentos, junto con todos los ingredientes de pasta restantes en el orden indicado. Mezcle hasta que tenga una pasta suave. Es posible que necesite agregar un poco más de agua. Esta receta hará aproximadamente diez cucharadas de pasta, así que congele o refrigere lo que no usa.", "Para el curry, corte las pechugas de pollo en diagonal en rodajas de 3 mm / 1/8 pulgadas de espesor.", "Caliente el aceite en una sartén amplia, preferiblemente antiadherente, a fuego medio-alto.", "Abra con cuidado la lata de leche de coco sin molestar demasiado. Retire cuatro cucharadas de crema de coco espesa que se han asentado en la parte superior y colóquelo en un tazón pequeño. Agite bien el contenido restante de la lata y reserve.", "Cuando la sartén esté caliente, agregue la crema de coco y revuelva. Agregue la pasta de curry y revuelva de nuevo. Revuelva freír durante 3-4 minutos o hasta que el aceite se separe y la pasta esté ligeramente dorada.", "Reduzca el fuego a bajo y agregue el pollo, brotes de bambú, leche de coco reservada, hojas de lima (o ralladura de limón), salsa de pescado, pasta de tamarindo (o jugo de limón) y el azúcar de palma (o azúcar moreno).", "Revuelva bien y cocine a fuego lento. El pollo debe ponerse blanco y cocinarse para cuando aparezcan las primeras burbujas. Cocine a fuego lento durante uno o dos minutos más.", "Justo antes de servir, espolvorea las hojas de albahaca sobre el curry, revuelve suavemente y retira del fuego. Sirve con arroz jazmín."], "url": "www_bbc_co_uk_food_recipes_chickenandbambooshoo_90183", "title": "Pollo al curry rojo tailandés", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandbambooshoo_90183_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["llovizna de aceite de oliva", "4 cebollas rojas, finamente picadas", "1 diente de ajo, aplastado", "2 palitos de apio, finamente cortados", "1 pimiento rojo, sin semillas, finamente cortado", "2 puerros, en rodajas finas", "6 hongos portabellini (o cualquier champiñones grandes y planos)", "1,75 litros / 3 pintas de caldo de pollo", "2 cucharadas de salsa de soja", "1 x lata 400g / 14oz de tomates picados enlatados", "2 zanahorias, finamente picadas", "1 x estaño 400g / 14oz de frijoles, enjuagados y escurridos", "10 muslos de pollo, en el hueso, la piel quitada", "agua", "285g / 10oz de arroz basmati"], "method": ["Caliente el aceite de oliva en una olla grande de fondo grueso. Agregue las cebollas y el ajo y freír suavemente hasta que se ablanden. Agregue el apio, el pimiento rojo, los puerros y los champiñones, revolviendo suavemente.", "Agregue el caldo, la salsa de soja y los tomates, y hágalos hervir, luego baje a fuego lento. Agregue las zanahorias, los frijoles con mantequilla y los muslos enteros de pollo y deje que hiervan a fuego lento durante aproximadamente una hora.", "Para hacer el arroz, llevar a ebullición una sartén con agua sazonada con una pizca de sal. Agregue el arroz y cocine según las instrucciones del paquete.", "Saca uno de los muslos de pollo y abrácelo suavemente. Verifique que la carne esté bien cocida (la carne será blanca, no rosada). Cuando esté cocido, retire los muslos de pollo de la olla y retire el hueso. El pollo debería caer literalmente del hueso. Si lo desea, corte en trozos del tamaño de un bocado y vuelva a la sartén.", "Escurra el arroz y colóquelo en tazones. Para servir, coloque generosamente la cazuela en cuencos de arroz."], "url": "www_bbc_co_uk_food_recipes_chickenandbutterbean_84102", "title": "Cazuela de frijoles con pollo y mantequilla con arroz basmati", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandbutterbean_84102_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 huevo de gallinas camperas", "1 cucharada de harina de maíz", "Una pizca de sal marina", "Filetes de pechuga de pollo sin piel de 500 g / 1 lb 2 oz, en rodajas", "300 ml / 10 fl oz de aceite de maní", "1 cebolla, en rodajas", "1 pimiento amarillo, sin semillas, cortado en tiras", "1 pimiento rojo, sin semillas, cortado en tiras", "3 cucharadas de caldo de pollo", "2-3 cucharadas soperas de salsa de soja", "2 cebollas de primavera grandes, en rodajas", "4 cucharadas de anacardos tostados", "sal marina y pimienta blanca molida", "arroz jazmín al vapor, para servir"], "method": ["Para el pollo, coloque el huevo en un recipiente, agregue la harina de maíz y una pizca de sal y mezcle bien. Agregue el pollo a la mezcla y cubra bien en el huevo.", "Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete. Freír el pollo durante 4-5 minutos, o hasta que esté dorado y crujiente, luego retire con una espumadera y escurra sobre papel de cocina absorbente.", "Para el salteado, vierta todo el aceite del wok, a excepción de una cucharada. Vuelva a calentar el aceite a fuego alto, agregue la cebolla y saltee por unos segundos. Agregue las rodajas de pimiento amarillo y rojo y saltee por un minuto, o hasta que estén blandos. Agregue las piezas de pollo y saltee durante 1-2 minutos, luego agregue el caldo y la salsa de soja. Cocine a fuego lento por otro minuto, o hasta que el pollo esté bien cocido.", "Agregue las cebollas de primavera y los anacardos, sazone al gusto con sal marina y pimienta blanca molida y transfiera a un plato para servir. Sirva inmediatamente con arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_chickenandcashewnuts_89299", "title": "Pollo y anacardos salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandcashewnuts_89299_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 tortillas de harina listas para usar", "250g / 9oz de queso cheddar maduro, rallado", "Pollo cocido de 300g / 11oz, rebanado grueso", "½ cebolla roja, finamente rebanada", "60 g / 2½ oz de chiles jalapeños, picados", "1 racimo pequeño de hojas y raíces de cilantro", "4 cucharadas de crema agria", "2 cucharadas de aceite de oliva", "Maíz dulce de 150g / 5oz", "20 g / ¾oz de chiles jalapeños, picados", "1 chile verde, finamente picado", "1 lima, solo jugo", "2 cucharadas de hojas de menta fresca, picadas", "2 cucharadas de hojas frescas de cilantro, picadas", "sal y pimienta negra recién molida"], "method": ["Para la quesadilla, coloque cuatro de las tortillas en un tablero y cúbralas con el queso rallado.", "Divida el pollo, la cebolla roja, los chiles jalapeños y el cilantro por igual sobre las tortillas cubiertas de queso.", "Extienda la crema agria en un lado de cada una de las cuatro tortillas restantes y coloque el lado de la crema agria sobre las tortillas rellenas.", "Calentar una sartén y agregar el aceite. Con cuidado, coloque una quesadilla en la sartén y cocine a fuego medio durante 3-4 minutos, hasta que esté crujiente y dorada y el relleno de queso se está derritiendo. Con cuidado, voltee la quesadilla y cocine en el otro lado por otros dos minutos, o hasta que esté crujiente y dorada. Retirar de la sartén y reservar para mantener caliente. Repite con las quesadillas restantes.", "Cortar las quesadillas en cuartos y servir frescas y calientes.", "Para la salsa, coloque todos los ingredientes de la salsa en un procesador de alimentos y pulse para combinar. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el plato para servir las quesadillas y coloque un plato de salsa en el centro."], "url": "www_bbc_co_uk_food_recipes_chickenandcheeseques_85536", "title": "Quesadillas de pollo y salsa de maíz dulce", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandcheeseques_85536_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "½ cebolla, pelada, finamente picada", "2 dientes de ajo, pelados, finamente picados", "1 pechuga de pollo, sin piel, picada", "2 cucharadas de puré de tomate", "150ml / 5fl oz de caldo de pollo", "6 tomates cherry, cortados por la mitad", "85g / 3oz de garbanzos enlatados, escurridos", "2 cucharadas de queso crema con ajo y hierbas, para servir"], "method": ["Caliente el aceite de oliva en una sartén a fuego medio. Freír la cebolla y el ajo durante 4-5 minutos, o hasta que se ablanden, revolviendo ocasionalmente.", "Agregue el pollo picado a la sartén y freír durante 4-5 minutos, o hasta que se dore, revolviendo ocasionalmente. Agregue el puré de tomate y el caldo de pollo y caliente hasta hervir a fuego lento.", "Agregue los tomates y los garbanzos y continúe cocinando a fuego lento durante 2-3 minutos.", "Para servir, coloca el pollo y la salsa en un plato y desmigaja sobre el queso crema con ajo y hierbas."], "url": "www_bbc_co_uk_food_recipes_chickenandchickpeast_92405", "title": "Guiso de pollo y garbanzos con tomates asados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharaditas de pimentón ahumado", "1 cucharadita de chile en polvo", "1 muslo de pollo, hueso retirado", "2 cucharadas de aceite de oliva", "½ cebolla, finamente rebanada", "2 dientes de ajo, finamente picados", "1 chorizo ​​pequeño, picado", "100 ml / 3½ fl oz de vino tinto", "50 g / 1¾oz de frijoles, pieles eliminadas (congelado está bien, pero descongelar primero)", "1 cucharada de cebolletas frescas picadas", "perejil fresco picado, para adornar", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "En un tazón, combine el pimentón ahumado, el chile en polvo, la sal y la pimienta. Abra el muslo de pollo para que quede plano y enrolle la mezcla de especias para cubrir. Caliente 1 cucharada de aceite de oliva en una sartén a prueba de horno y fría el pollo hasta que se dore por todos lados. Transfiera al horno y tueste durante 10-12 minutos, o hasta que esté cocido.", "Mientras tanto, caliente la cucharada restante de aceite en una sartén y fría la cebolla y el ajo hasta que se ablanden. Agregue el chorizo ​​y freír suavemente hasta que el chorizo ​​comience a crujir ligeramente, esto debería tomar alrededor de 5-7 minutos. Agregue el vino tinto y cocine a fuego lento durante 5 minutos, o hasta que se reduzca ligeramente. Agregue las habas y revuelva.", "Retire el pollo del horno y córtelo en tiras. Agregue el pollo y el cebollín a la sartén y revuelva para combinar.", "Ponga la mezcla de pollo en un plato poco profundo, adorne con perejil fresco y sirva."], "url": "www_bbc_co_uk_food_recipes_chickenandchorizoste_88444", "title": "Pollo y chorizo ​​con pimentón y vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandchorizoste_88444_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Azúcar de palma 50 g / 2 oz (sustituya el azúcar en polvo de oro si no está disponible)", "50ml / 2fl oz de salsa de pescado", "1 lata de leche de coco", "6 muslos de pollo, huesos retirados", "2 chalotes pequeños, pequeños tailandeses si es posible", "½ pimiento rojo pequeño", "2 chiles rojos largos", "½ pepino, pelado", "Cacahuetes tostados 100g / 3½oz", "puñado de hojas de cilantro", "hojas de lima (opcional)"], "method": ["En una sartén de base pesada, ponga a hervir el azúcar de palma, la salsa de pescado y la leche de coco. Una vez que esté hirviendo, vierta los muslos de pollo y asegúrese de que todas las piezas estén cubiertas por el líquido. Cocine a fuego lento durante unos buenos 10 minutos, dando vuelta una o dos veces. Una vez cocido, dejar enfriar en el líquido.", "Pelar y cortar los chalotes muy finamente, quitar las semillas de la pimienta y los chiles y cortar en tiras largas y delgadas.", "Corta el pepino por el centro longitudinalmente y quita las semillas. Usando un pelador de patatas, pele las tiras largas del pepino hasta que todo se haya agotado.", "Picar los cacahuetes tostados y mezclarlos con el cilantro. Mezcle la pimienta, los chalotes, los chiles y el pepino en un bol y déjelos reposar.", "Cuando esté frío, saca el pollo del líquido y, con un cuchillo afilado, quítate la piel y deséchalo. Corta el pollo en tiras delgadas aproximadamente del mismo tamaño que la pimienta y los chiles. Agregue el pollo a la mezcla de vegetales, luego agregue la mezcla de leche de coco.", "Mezcle bien y coloque en un tazón grande. Espolvorear con las nueces picadas y el cilantro para servir."], "url": "www_bbc_co_uk_food_recipes_chickenandcoconutsal_74613", "title": "Ensalada de pollo y coco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 mini-filetes de pollo", "½ calabacín", "2 cucharadas de aceite de oliva", "1 cucharada de salsa de soja", "1 lima, cortada en cuñas", "½ naranja, cortado en cuñas", "pequeño puñado mezclado tomates cherry rojos y amarillos, reducido a la mitad", "ramita de perejil fresco"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Corte cada mini filete de pollo por la mitad y corte la mitad del calabacín en seis pedazos. Pase los trozos de pollo y calabacín alternativamente en dos brochetas.", "Calentar el aceite en una sartén a prueba de horno y freír los pinchos de pollo y calabacín durante 4-5 minutos, girando con frecuencia, hasta que comiencen a dorarse.", "Espolvorea sobre la salsa de soja y transfiere al horno para cocinar durante cinco minutos, o hasta que el pollo esté completamente cocido.", "Sirva con una guarnición de rodajas de naranja y lima, tomates cherry a la mitad y una ramita de perejil fresco."], "url": "www_bbc_co_uk_food_recipes_chickenandcourgettes_88468", "title": "Pinchos de pollo y calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo preparada, toscamente picada", "puñado de sabio fresco", "puñado de cilantro fresco", "puñado de perejil fresco", "puñado de menta fresca", "puñado de eneldo fresco", "puñado de albahaca fresca", "3 yemas de huevo de gallinas camperas", "2 cucharadas de cebolla caramelizada de un tarro", "½ cucharadita de vinagre de vino blanco", "sal y pimienta negra recién molida", "150ml / 5fl oz de aceite de oliva"], "method": ["Para la ensalada, mezcle el pollo y las hierbas en un recipiente limpio y déjelo a un lado.", "Para la mayonesa de cebolla, coloque las yemas de huevo, la cebolla y el vinagre de vino blanco en un procesador de alimentos y mezcle hasta que quede suave. Sazonar, al gusto, con sal y pimienta negra recién molida. Una vez que se ve un poco espesa, comienza a agregar gradualmente en el aceite de oliva, mezclándose constantemente.", "Para servir, mezcle la mayonesa de cebolla en la ensalada."], "url": "www_bbc_co_uk_food_recipes_chickenandherbsaladw_84198", "title": "Ensalada de pollo y hierbas con mayonesa de cebolla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina natural, más extra para enharinar", "pizca de sal", "30 g / 1¼ oz de manteca fría, cortada en cubos (opcional, puedes usar toda la mantequilla si lo prefieres)", "85g / 3oz de mantequilla fría, cortada en cubos", "2-3 cucharadas de agua fría", "1 huevo de gallina, batido con una pizca de sal", "30 g / 1¼ oz de mantequilla", "30g / 1¼ oz de harina", "600 ml / 1 litro de leche", "3 cucharadas de crema doble", "2 cucharaditas de mostaza Dijon", "1/3 de cubo de caldo de pollo, desmenuzado", "2 puerros grandes", "30 g / 1½ oz de mantequilla", "3 crujientes comiendo manzanas, sin corazón y cortadas en pedazos grandes", "70 g / 2½ onzas de tocino lardons, o tocino rayado, cortado en cubitos", "10 muslos de pollo sin hueso, cortados en cubitos", "1 manojo de estragón, solo hojas (opcional)", "pimienta negra recién molida"], "method": ["Para la masa, tamice la harina y la sal en un tazón grande.", "Agregue la manteca y la mantequilla y, con la punta de los dedos, frote la grasa en la harina hasta que la mezcla se asemeje a pan rallado. Levante la harina en el aire a medida que lo hace, para obtener un poco de aire en la mezcla y mantenerlo fresco.", "Agregue suficiente agua fría para formar una masa y mezcle con una espátula.", "Luego, usando sus manos, junte la masa en el tazón. Colóquelo sobre una superficie de trabajo limpia y enharinada y amaselo brevemente. Dale forma a un círculo aplanado y envuélvelo en una película adhesiva. Enfriar en la nevera durante al menos 20 minutos.", "Mientras la masa está fría, prepare la salsa blanca. Derrita la mantequilla en una sartén de fondo grueso. Agregue la harina y revuelva con una cuchara de madera a fuego medio durante uno o dos minutos, teniendo cuidado de no quemarla.", "Agregue la leche todo de una vez. Quite el fuego y bata la mezcla con un batidor de globo. Una vez que todos los grumos se incorporen, coloque la sartén nuevamente a fuego medio y bata continuamente hasta que la salsa hierva y se espese.", "Cocine por otros cinco minutos, revolviendo frecuentemente con una cuchara de madera. Agregue la crema doble, la mostaza y el cubo desmenuzado. Revuelva bien, luego deje enfriar.", "Para el relleno, arriba y abajo los puerros. Cortar en anillos gruesos y lavar a fondo en un recipiente de agua limpia, para eliminar la arena. Caliente una sartén de fondo grueso y coloque los puerros en la sartén caliente. Agrega la mantequilla.", "Agregue las manzanas a la sartén con los puerros y cocine por unos minutos. Agregue los lardons de tocino y los trozos de pollo a la sartén y cocine por unos minutos más (el pollo estará cocido aproximadamente en dos tercios en esta etapa).", "Precaliente el horno a 200C / 400F / Gas 6. Coloque la mezcla de pollo en un molde para pastel. Espolvoree las hojas de estragón, si se usa, sobre la parte superior. Sazonar con pimienta recién molida negro. Vierta sobre la salsa blanca fría.", "Para la superficie de repostería, permita que la repostería alcance la temperatura ambiente. Enharina ligeramente una tabla limpia y extienda la masa en un rectángulo de aproximadamente una vez y media el tamaño del plato de tarta.", "Con un cuchillo, corte tiras largas, de media pulgada de ancho de la masa. Use los bordes para hacer un borde alrededor del plato para pastel frotándolos con un poco de agua (para ayudar a que el pastel se adhiera) y colóquelos en una sola capa alrededor del borde exterior del plato para pastel.", "Usando su rodillo, levante la hoja de repostería restante y colóquela en la parte superior del plato para formar una tapa. Recorte alrededor del borde del plato para pastel con un cuchillo para cortar el exceso de masa, reservando los bordes. Usa los dedos y el pulgar para doblar los bordes. Haga un agujero en el centro para permitir que escape el aire.", "Cepille la parte superior de la masa con el huevo batido y la sal. Utilice los adornos de pastelería reservados para decorar la parte superior.", "Coloque el pastel en una bandeja para hornear y hornéelo en el horno durante 25-30 minutos hasta que burbujee caliente y dorado. Servir mientras está caliente"], "url": "www_bbc_co_uk_food_recipes_chickenandleekpie_90191", "title": "Pastel de pollo y puerro", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandleekpie_90191_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "75g / 2¾oz de pechuga de pollo cortada en tiras", "sal y pimienta negra recién molida", "1 cucharada de aceite de sésamo", "1 cucharada de salsa de soja", "½ lima, solo jugo", "1 diente de ajo, finamente cortado en cubitos", "½ cucharadita de lemongrass, blanco interno finamente picado", "¼ de cebolla, finamente picada", "½ mango, cortado en cubitos", "1 cucharada de hojas de menta picadas", "1 cucharada de cilantro picado", "50g / 1¾oz de brócoli blanqueado"], "method": ["Calentar el aceite de oliva en una sartén a fuego medio a alto, freír las tiras de pollo durante aproximadamente diez minutos o hasta que el pollo esté cocido, sazonar y escurrir los jugos.", "En un tazón grande mezcle el aceite de sésamo, la salsa de soja, el jugo de limón, el ajo, la hierba de limón y la cebolla.", "Agregue el mango, pollo, hierbas. Sazonar y mezclar.", "Servir en una pila alta en un plato con el brócoli."], "url": "www_bbc_co_uk_food_recipes_chickenandmangosalad_80105", "title": "Ensalada de pollo y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "2 cucharadas de aceite de oliva", "5 cucharadas de vino marsala", "botón de mantequilla", "pizca de harina, sal y pimienta al gusto", "patatas, hervidas y arrojadas en sal, pimienta y aceite de oliva virgen extra"], "method": ["Aplane la pechuga de pollo con un rodillo o mazo de carne entre dos hojas de película adhesiva. Freír el pollo en aceite de oliva durante tres minutos por cada lado.", "Agregue el vino de Marsala y deje que se caliente. A medida que las llamas de la salsa, retire el pollo de la sartén y apague la llama.", "Cubra la perilla de mantequilla en harina y agregue a la sartén. Añadir sal y pimienta al gusto.", "Cuando la salsa se espese, sirva con el pollo y las papas."], "url": "www_bbc_co_uk_food_recipes_chickenalmarsala_73329", "title": "Pollo al marsala", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "1 pechuga de pollo", "½ limón, solo jugo", "5 cucharadas de vino blanco", "botón de mantequilla", "pizca de harina", "sal y pimienta negra recién molida", "judías verdes"], "method": ["Calentar una sartén grande y agregar el aceite de oliva, freír el pollo durante 5 minutos en cada lado, o hasta que esté bien cocido.", "Agregue el jugo de limón y sal y pimienta. Agregue el vino blanco y reduzca por 30 segundos. Cubra la perilla de mantequilla en harina, y vierta en la mezcla para espesar.", "Poner a hervir una olla de agua y cocinar las judías verdes durante 3-4 minutos, escurrir.", "Coloque los frijoles en un plato, cubra con el pollo, rocíe la salsa y sirva."], "url": "www_bbc_co_uk_food_recipes_chickenallimone_73328", "title": "Pollo al limón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenallimone_73328_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 rebanadas de piña de una lata, picadas", "½ lima, solo jugo", "1 cucharada de aceite de oliva", "¼ de chile rojo, finamente picado", "½ pechuga de pollo preparada, picada", "puñado de hierbas frescas mezcladas, p. menta, albahaca, cilantro y perejil"], "method": ["Coloque todos los ingredientes en un tazón, ray y sirva."], "url": "www_bbc_co_uk_food_recipes_chickenandpineapples_83971", "title": "Ensalada de pollo y piña", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 pechugas de pollo, piel y hueso eliminados", "150g / 5½ oz champiñones, descuartizados", "1 cebolla pequeña, picada", "1 diente de ajo, finamente picado", "50g / 2oz de mantequilla", "2 cucharadas de harina natural, más extra para quitar el polvo", "300 ml / ½ litro de leche", "200ml / 7fl oz de caldo de pollo", "nuez moscada recién rallada, al gusto", "pimienta blanca recién molida", "pizca de sal", "pequeño puñado de perejil fresco, picado", "500g / 1lb 2oz de pasta de corteza corta lista para usar", "1 huevo de gallinas camperas, golpeado"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Calentar el aceite en una sartén, agregar el pollo y freír hasta que el pollo comience a ponerse blanco.", "Agregue los champiñones y continúe freír hasta que el pollo esté dorado.", "Retire el pollo y los champiñones de la sartén y déjelos a un lado. Agregue la cebolla y el ajo en la misma sartén y fría por 2-3 minutos o hasta que estén blandos. Retire del fuego y reserve con el pollo y los champiñones.", "Derrita la mantequilla en una cacerola, mezcle la harina y cocine durante unos tres minutos, revolviendo constantemente hasta que haya formado una pasta espesa y suave (esto se conoce como roux).", "Mezcle la leche y el caldo en una jarra, luego agregue la nuez moscada, pimienta blanca y sal, al gusto. Vierta el líquido lentamente en la mezcla de harina, batiendo todo el tiempo hasta que quede suave. Cocine a fuego lento con un poco de calor, revolviendo constantemente, durante unos cinco minutos o hasta que la salsa se espese.", "Agregue el perejil picado y vierta la salsa sobre la mezcla de pollo y champiñones. Mezcle bien, luego póngalo en una fuente para pastel y déjelo hasta que esté completamente frío.", "Estirar la masa en una superficie ligeramente enharinada hasta que tenga el grosor de una moneda de una libra. Cepille los bordes del plato de tarta con huevo batido, coloque la masa en la parte superior, presione hacia abajo los bordes y recorte. Cepille la parte superior del pastel con huevo batido y corte algunas formas de hojas del pastel sobrante para decorar la parte superior del pastel.", "Haga dos o tres ranuras en la parte superior del pastel para permitir que salga el vapor y luego hornee en el horno durante 20-25 minutos o hasta que estén doradas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chickenandmushroompi_89034", "title": "Pastel de pollo y champiñones", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenandmushroompi_89034_16x9.jpg", "isVegetarian": false, "recommendations": 0}]