[{"ingredients": ["1 pollo mediano entero, unido en 8 piezas", "8 cucharadas de aceite de oliva", "8 ramitas de tomillo de limón", "4 dientes de ajo, en rodajas finas", "Brócoli brotación púrpura de brotes 500g / 1lb 2oz, recortado", "2 cucharadas de aceite de oliva", "200g / 7oz taza marrón de champiñones, en rodajas", "1 cebolla roja, en rodajas", "150g / 5½oz de aceitunas negras españolas", "1 cucharada de vinagre de Jerez", "1 cucharada de vinagre de vino tinto", "2 cucharadas de aceite de oliva virgen extra", "2 bolas de queso burrata, rotas en pedazos"], "method": ["Coloque las piezas de pollo, el aceite, el tomillo limón y el ajo en una bolsa grande de congelador y selle. Deje marinar en la nevera durante al menos una hora e idealmente durante la noche.", "Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Vierta el pollo y su adobo en una bandeja para hornear y cocínelos durante 15-20 minutos o hasta que estén cocidos.", "Para la ensalada, caliente una cacerola grande con agua con sal y blanquee el brócoli durante 2 minutos, retírelo y drene.", "Caliente una sartén grande de la plancha y rocíe el brócoli con el aceite. Coloque en la sartén de la plancha y cocine durante 2-3 minutos hasta que se queme.", "Combine los champiñones, la cebolla, las aceitunas y el brócoli cocido en un tazón grande. En un tazón pequeño o jarra mezcle los dos vinagres y el aceite de oliva virgen extra para hacer un aderezo.", "Para servir, vierta el aderezo sobre la ensalada y mezcle. Coloque en un plato para servir y cubra con la burrata. Sirve el pollo al lado."], "url": "www_bbc_co_uk_food_recipes_garlic_and_lemon_thyme_36885", "title": "Pollo de tomillo con ajo y limón con una brócoli de brotes púrpura, champiñones y ensalada de cebolla roja", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas de 2 kg / 4 libras y 8 onzas, como Maris Piper, peladas y cortadas en trozos grandes del mismo tamaño", "8 dientes de ajo grasosos, magullados y ligeramente astillados con el lado plano de un cuchillo de hoja ancha, luego se deslizaron fuera de sus pieles", "2 cucharadita de copos de sal marina, más extra para el gusto", "75 g / 2½ oz de mantequilla sin sal, ablandada", "50g / 1¾oz de queso parmesano, finamente rallado", "50 g / 1¾oz de pan rallado seco o panko", "50 g / 1¾oz de mantequilla sin sal, en gotas o cucharaditas", "35 g / 1¼ oz de queso parmesano, finamente rallado"], "method": ["Coloque las papas y el ajo preparado en una sartén muy grande, cubra con agua fría, agregue la sal, cúbralo con tapa y deje hervir a fuego alto, baje y cocine parcialmente tapado, solo una hendidura, hasta que esté muy tierno. .", "Coloque un colador sobre un tazón grande u otro recipiente y escurra las papas, dejando que el agua con almidón se acumule debajo. No tire esto: es un líquido precioso (consulte la punta de la receta).", "Agregue la mantequilla a la bandeja de papas caliente y vacía, y deje que empiece a derretirse, luego incline las papas y el ajo drenados. Sumerja una taza de medir en el líquido de cocción, agregue aproximadamente 125 ml / 4 onzas líquidas y haga puré usando el método elegido (consulte la punta de la receta). Es posible que desee agregar más líquido de cocción. Nunca agrego menos de 250ml / 9fl oz, ya que me gusta que sea lo más suave y cremosa posible, aunque soy consciente de que muchas personas prefieren un puré más sólido. Mezcle el queso parmesano a mano y revise el condimento antes de transferirlo a un recipiente tibio.", "Si está preparando esto por adelantado, ponga mantequilla en una lata pequeña para asar o en un plato resistente al horno, midiendo aprox. 30x25cm / 12x10in, y rellene con el puré de papas, alisando la parte superior. Deje que se enfríe, cubra y coloque en la nevera por hasta 3 días.", "Al recalentarse, retírelo del refrigerador y déjelo llegar a la temperatura ambiente, lo que tomará una o dos horas, dependiendo del clima.", "Precalentar el horno a 200C / 180C Fan / Gas 6 y hacer una cobertura desmenuzable frotando las migas de pan junto con la mantequilla y el parmesano, luego salpique y espolvoree en la parte superior. Cocine durante aproximadamente 30 minutos, o hasta que esté bien caliente todo el tiempo. Cubra el plato sin apretar con papel de aluminio si el acabado se vuelve demasiado marrón en cualquier etapa."], "url": "www_bbc_co_uk_food_recipes_garlic_and_parmesan_mash_80742", "title": "Puré de ajo y queso parmesano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_and_parmesan_mash_80742_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 bulbo entero de ajo", "1 cucharada de aceite de oliva", "1 pollo entero", "Crema doble 600ml / 20fl oz", "sal y pimienta negra recién molida", "400ml / 14fl oz de salsa de pollo, para servir", "Patatas King Edward de 1,2 kg / 2 lb 12 oz, en rodajas finas", "25g / 1oz de mantequilla", "300 ml / 10 fl oz doble crema", "300ml / 10fl oz de leche entera", "1 manojo de espárragos, recortado en 3 longitudes", "200 g / 7 oz de guisantes frescos, envasadas", "500g / 1lb 2oz de habas frescas, envasadas", "50 g / 1¾oz de mantequilla sin sal", "1 chalote, finamente picado", "1 diente de ajo, finamente picado"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Ponga el ajo en un trozo de papel de cocina y rocíe con el aceite. Selle la lámina en un paquete y tápela durante 30-40 minutos.", "Mientras tanto, ponga el pollo en una lata honda y sazone con sal y pimienta. Asar durante 40-60 minutos.", "Mientras el pollo se asa, ponga la crema en un procesador de alimentos con un accesorio batidor / paleta y mezcle hasta que se convierta en mantequilla, dejando el suero en la parte inferior. Coloque la parte sólida en un recipiente, agregue una cucharadita de sal y mezcle. Exprime los dientes de ajo en la crema y vuelve a mezclar.", "Unta el pollo con la crema de ajo y regrésalo al horno durante 30-40 minutos, dependiendo del tamaño del pájaro. Verifique que esté cocinado usando un termómetro de carne, o verifique que los jugos salgan limpios cuando la parte más profunda de la carne se perfora con un pincho.", "Mientras tanto, para las patatas dauphinoise, precaliente un horno a 170C / 150C Fan / Gas 3½. Lave las papas en agua fría para eliminar el exceso de almidón. Escurra bien y seque.", "Engrase un plato a prueba de horno con 1 cucharadita de mantequilla y coloque las papas en el plato, superponiéndolas un poco, hasta que estén llenas. Sazonar con sal y pimienta entre cada capa.", "Coloque la crema y la leche en un bol, sazone con sal y pimienta y mezcle con batidor. Vierta esto sobre las papas. Apunte con la mantequilla restante, cubra bien con papel de cocina y hornee durante 1 hora. Retire la lámina y hornee por otros 30 minutos o hasta que estén dorados y tiernos.", "Mientras tanto, pula los espárragos, los guisantes y las habas en una olla grande de agua hirviendo ligeramente salada. Drene y sumérjase en agua helada para mantener el color. Derrita la mantequilla en una sartén mediana. Agregue la chalota y el ajo y fría por 1-2 minutos. Agregue las verduras blanqueadas y cocine por 2-3 minutos.", "Para servir, esculpe el pollo asado y colóquelo en un plato para servir. Caliente la salsa hasta que esté caliente. Coloque una cucharada de las papas en cada plato, agregue los espárragos, los guisantes y las habas, y sirva con el pollo y la salsa."], "url": "www_bbc_co_uk_food_recipes_garlic_butter_chicken_37133", "title": "Pollo con mantequilla de ajo con espárragos, guisantes, habas y patatas dauphinoise", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "6 rebanadas de jamón curado, cortado por la mitad", "50g / 1¾oz de mantequilla", "6 rebanadas gruesas de brioche", "4 dientes de ajo gordos, aplastados", "250 g / 9 oz de champiñones castaños, en rodajas", "100 g / 3½ oz de champiñones shiitake, a la mitad si son grandes", "75g / 2¾oz de setas de ostra, reducidas a la mitad si son grandes", "150 g / 5½ oz enoki hongos", "2 cucharadas de crema entera de grasa", "perejil fresco picado, para adornar", "sal y pimienta negra recién molida"], "method": ["Agregue el aceite a una sartén grande de base pesada y fríe el jamón a fuego alto durante 1-2 minutos hasta que quede crujiente. Es posible que deba hacer esto en dos lotes para evitar la sobrepoblación de la sartén. Eliminar y reservar.", "Baja el fuego a medio y derretir alrededor de un tercio de la mantequilla en la sartén. Freír las rebanadas de brioche hasta que estén doradas en cada lado, puede que tenga que hacer esto en tandas. Eliminar y reservar.", "Derrita otro tercio de la mantequilla en la sartén, agregue los champiñones de ajo, castaña y shiitake y fríe a fuego alto durante 2-3 minutos. Baje el fuego, cubra con una tapa y cocine por otros 2 minutos. Retire la tapa y fría a fuego alto hasta que esté tierno y dorado, agite hasta que se seque y el líquido se haya evaporado.", "Agregue la mantequilla restante, junto con la ostra y las setas enoki, y fría durante 1-2 minutos hasta que estén doradas. Sazonar bien con sal y pimienta. Agregue la crème fraîche.", "Coloque una rebanada de brioche tostado en cada plato, cuchara sobre algunos de los hongos de ajo, seguido de una loncha de jamón frito y una pizca de perejil picado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_garlic_mushrooms_and_09096", "title": "Setas de ajo y jamón curado en brioche tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_mushrooms_and_09096_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["aceite en aerosol bajo en calorías", "250 g / 9 oz de champiñones castaños, en rodajas", "1 diente de ajo pequeño, aplastado", "1 cucharada de cebolletas frescas en rodajas finas", "4 huevos grandes de gallinas camperas, golpeados", "pimienta negra recién molida", "1 lechuga Little Gem, hojas separadas", "100g / 3½oz de tomates cherry, cortados por la mitad", "1/3 de pepino, cortado en trozos"], "method": ["Rocíe una pequeña sartén a prueba de llamas con aceite y colóquela a fuego alto. (La base de la sartén no debe ser más ancha que aproximadamente 18 cm / 7 pulgadas). Revuelva-fríe los champiñones en tres lotes durante 2-3 minutos, o hasta que estén suaves y ligeramente dorados. Incline los champiñones cocidos en un colador sobre un recipiente para recoger los jugos; no desea que los champiñones se empapen.", "Regrese todas las setas a la sartén y agregue el ajo y las cebolletas, y una pizca de pimienta negra molida. Cocine por un minuto más, luego reduzca el fuego a bajo.", "Precalentar la parrilla a su temperatura más alta. Vierta los huevos sobre los champiñones. Cocine por cinco minutos o hasta que esté casi listo.", "Coloque la sartén debajo de la parrilla durante 3-4 minutos, o hasta que se asiente.", "Combine los ingredientes de la ensalada en un tazón.", "Retirar de la parrilla y aflojar los lados de la frittata con una cuchilla de hoja redonda. Salir sobre una tabla y cortar en cuñas. Sirva caliente o frío con la ensalada."], "url": "www_bbc_co_uk_food_recipes_garlic_mushroom_frittata_50129", "title": "Frittata de setas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_mushroom_frittata_50129_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["¼ de pimiento naranja, semillas retiradas", "1 pechuga de pollo cocida, sin piel, rebanada", "4 patatas nuevas", "2 cucharadas colmadas de frijoles rojos en lata, enjuagados y escurridos", "3 dientes de ajo enteros, pieles dejadas en", "1 cucharadita de harina común", "pizca de pimentón", "picar el caldo de caldo vegetal", "125ml / 4½fl oz de agua hirviendo", "½ cucharadita de extracto de levadura, como Marmite o Bovril", "alubias al vapor, para servir"], "method": ["Precalentar el horno a 220C / 450F / Gas 7.", "Coloque la pimienta, el pollo, las papas y los frijoles en una cazuela con tapa. Agregue los dientes de ajo, con sus pieles todavía encendidas. Espolvorea sobre la harina y el pimentón.", "Agregue el polvo de caldo al agua, luego mezcle el extracto de levadura hasta que se disuelva. Vierta esta mezcla en la cazuela para cubrir su contenido. Cubra el plato con la tapa.", "Cocine el pollo al ajo en el horno durante 25-30 minutos, o hasta que las papas estén tiernas. Sirva con judías verdes al vapor."], "url": "www_bbc_co_uk_food_recipes_garlic_chicken_08030", "title": "Pollo con ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "4 dientes de ajo, en rodajas finas", "500 g / 1 libra de hongos mixtos de 2 oz, los más grandes cortados a la mitad o en rodajas", "2 cucharadas de vinagre de jerez", "sal y pimienta negra recién molida", "rociar aceite de oliva", "pizca de pimentón caliente", "perejil pequeño de racimo o cilantro, finamente picado"], "method": ["Calentar el aceite de oliva en una sartén grande. Agregue el ajo y fría, revolviendo constantemente, durante 1 minuto.", "Agregue los champiñones y continúe freír a fuego alto hasta que los champiñones estén recién dorados; si se cocinan a una temperatura lo suficientemente alta como para que no emitan ningún líquido, si lo hacen, continúe cocinando hasta que el recipiente esté seco.", "Sazone con sal y pimienta, luego vierta dos cucharadas de vinagre de Jerez - la sartén debe chisporrotear. Continúe cocinando hasta que la mayoría del líquido se haya evaporado.", "Sirva con otra llovizna de aceite de oliva, una ligera pizca de pimentón y abundante perejil o cilantro."], "url": "www_bbc_co_uk_food_recipes_garlic_mushrooms_with_91490", "title": "Setas de ajo con vinagre de jerez", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_mushrooms_with_91490_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["150g / 5½oz de polenta de cocción rápida", "425 ml / ¾ pinta de caldo de pollo", "1 cucharadita de hojuelas de chile seco", "55g / 2oz de queso de cabra, picado", "1 cucharada de albahaca fresca picada", "1 cucharada de hojas de salvia frescas picadas", "1 cucharada de perejil fresco picado", "1 cucharada de aceite de oliva", "2 dientes de ajo, aplastados", "1 ramita de romero fresco", "1 cordero", "2 cucharadas de aceite de oliva", "1 diente de ajo, ligeramente triturado", "2 cucharadas de perejil fresco picado", "2 cucharadas de hojas de albahaca picadas", "1 tomate, semillas eliminadas, picadas"], "method": ["Coloque la polenta en una olla. Agregue el caldo de pollo y las hojuelas de chile y cocine, revolviendo constantemente, durante 4-5 minutos o hasta que estén suaves y todo el líquido haya sido absorbido.", "Agregue el queso de cabra y las hierbas frescas y revuelva.", "Para la chuleta de cordero, coloque el aceite de oliva en una sartén a fuego medio. Agregue el ajo y el romero y cocine por 1-2 minutos y luego retírelo de la sartén.", "Agregue la chuleta de cordero y fría por 3-4 minutos en cada lado, o hasta que esté completamente cocido. Retire de la sartén y descanse la chuleta en un lugar cálido durante cinco minutos.", "Para la salsa, caliente el aceite y el ajo en una cacerola a fuego lento durante 2-3 minutos, o hasta que el ajo se ponga dorado. Retire el ajo y agregue el perejil, la albahaca y el tomate picado y cocine por un minuto para que se caliente.", "Para servir, coloca la polenta en un plato. Coloque la chuleta de cordero en la parte superior y rocíe sobre la salsa vierge."], "url": "www_bbc_co_uk_food_recipes_garlicandrosemarylam_84508", "title": "Ajo y romero cordero con chile y hierba polenta y salsa vierge", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 hongos portobello, enteros", "1 diente de ajo, en rodajas finas", "2 cucharaditas de aceite de oliva", "1 rebanada de masa fermentada, tostada", "sal marina y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 5.", "Coloque el hongo en una bandeja para hornear y espolvoree el ajo sobre ellos. Rocíe con aceite de oliva, sazone con sal y pimienta y coloque en el horno durante 20 minutos.", "Para servir, coloque los champiñones encima de la tostada y sazone al gusto."], "url": "www_bbc_co_uk_food_recipes_garlic_roasted_mushroom_91748", "title": "Seta asada con ajo sobre pan tostado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlic_roasted_mushroom_91748_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de aceite de oliva", "1 cebolla roja, pelada, finamente rebanada", "1 cucharada de jerez", "2 dientes de ajo, pelados, aplastados", "2 cucharaditas de pimentón ahumado", "1 cucharadita de hojuelas de chile secas", "8 tomates de ciruela, picados", "12 gambas crudas, cáscaras y cabezas retiradas", "Pan rallado de 100 g / 3½ oz (preferiblemente brioche)", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Calentar una cucharada de aceite en una sartén a fuego medio y freír la cebolla durante 4-5 minutos, o hasta que se ablande. Agregue el jerez y cocine durante 1-2 minutos más, o hasta que el volumen del líquido se haya reducido ligeramente.", "Agregue el ajo, el pimentón, el chile, los tomates y el aceite restante y cocínelos por otros 18-20 minutos, o hasta que la salsa esté espesa y los tomates se hayan ablandado.", "Agregue las gambas y la cuchara en un plato resistente al horno. Espolvorea sobre las migas de pan y hornea por 15-17 minutos, o hasta que estén doradas en la parte superior.", "Sirva inmediatamente con el pan crujiente."], "url": "www_bbc_co_uk_food_recipes_garlicandpaprikapraw_93405", "title": "Gambas al ajillo y pimentón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de lentejas Puy", "55 g / 2 oz de mantequilla", "½ cebolla grande, finamente rebanada", "1 diente de ajo, aplastado", "75ml / 2½ fl oz crema doble", "85g / 3oz de queso parmesano, rallado", "½ limón, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 chuletas de cordero", "sal y pimienta negra recién molida", "1 bulbo de ajo, cortado a la mitad por el medio", "2 ramitas de romero fresco"], "method": ["Para las lentejas, ponga a hervir una olla de agua con sal y agregue las lentejas. Cocine a fuego lento durante 15 minutos, o hasta que estén tiernos, luego drene y coloque en un recipiente.", "Caliente la mantequilla en una cacerola y fríela suavemente durante cinco minutos hasta que esté suave pero no coloreada.", "Agregue el ajo y fría por un minuto.", "Agregue la crema doble y cocine a fuego lento durante 3-4 minutos, o hasta que la salsa se espese un poco.", "Vierta la mezcla de crema sobre las lentejas escurridas y agregue el parmesano y el jugo de limón. Revuelva hasta que el queso se haya derretido y sazone, al gusto, con sal y pimienta negra recién molida. Mantenga caliente hasta que se requiera.", "Para el cordero, frote las chuletas de cordero con aceite de oliva y sazone con sal y pimienta negra recién molida.", "Caliente una sartén a la plancha y cocine las chuletas con el ajo y el romero durante cinco minutos por cada lado, o hasta que se cocinen a su gusto. Retirar del fuego y dejar reposar durante cinco minutos.", "Para servir, coloque las lentejas en un plato de servir y cubra con las chuletas de cordero, el ajo y el romero."], "url": "www_bbc_co_uk_food_recipes_garlicandrosemaryroa_87066", "title": "Ajo y romero asado de cordero con lentejas a la crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 rebanadas de jamón de Parma", "50ml / 2fl oz de aceite de oliva", "3 dientes de ajo, enteros", "1 croissant, cortado por la mitad transversalmente", "50ml / 2fl oz de vinagre de vino blanco", "2 huevos de gallinas camperas", "sal y pimienta negra recién molida"], "method": ["Para el pan de ajo, precaliente el horno a 200C / 400F / Gas 6 y coloque el jamón de Parma en una bandeja para hornear.", "Coloque el jamón en el horno y tueste durante ocho minutos hasta que estén crujientes.", "Permita que el jamón se enfríe; se endurecerá ligeramente.", "Caliente el aceite de oliva en una sartén pequeña y agregue el ajo. Agregue las mitades de croissant a la sartén y fría hasta que se dore más profundo en ambos lados.", "Para los huevos escalfados, ponga una olla pequeña de agua y el vinagre a fuego lento a fuego medio.", "Con cuidado, romper los huevos en dos moldes pequeños, teniendo cuidado de no romper las yemas.", "Agregue suavemente los huevos al agua. Baje el fuego y coloque una tapa en la sartén.", "Cocine los huevos durante dos minutos hasta que el blanco esté firme.", "Retire los huevos con una cuchara ranurada y presione la base de la cuchara contra una hoja de papel de cocina para drenar.", "Para servir, coloca el jamón y el croissant frito en un plato y coloca el huevo encima. Sazone al gusto con sal y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_garlicbreadwithcrisp_85542", "title": "Pan de ajo con crujiente jamón de Parma y huevos escalfados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 diente de ajo, finamente picado", "25g / 1oz de mantequilla sin sal, ablandada", "1 cucharada de cilantro picado, más extra para decorar", "6 mejillones de labios verdes, sin barba y limpios, una cáscara eliminada", "75g / 3oz de pan rallado fresco", "sal y pimienta negra recién molida", "½ limón, cortado en cuñas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "En un tazón pequeño, mezcle el ajo, la mantequilla y el cilantro.", "Coloque los mejillones en una bandeja pequeña para hornear. Divida la mantequilla entre los mejillones, espolvoree sobre los pan rallado y sazone con sal y pimienta negra recién molida. Hornee en el horno por 5 minutos.", "Para servir, transfiéralo a un plato caliente y espolvorea con cilantro y trozos de lima."], "url": "www_bbc_co_uk_food_recipes_garlicbutterroastedm_80972", "title": "Mejillones asados ​​con mantequilla de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de pechugas de pollo sin hueso, peladas", "450g / 1lb de pepino", "2 cucharaditas de sal", "1 cucharada de aceite de maní", "1½ cucharada de ajo, finamente picado 1 cucharada de cebollas de primavera, finamente picadas", "1 cucharada de salsa de soja ligera", "1 cucharada de vino Shaoxing o jerez seco", "2 cucharaditas de salsa de chile en grano o chile en polvo", "2 cucharaditas de aceite de sésamo"], "method": ["Corta el pollo en cubos de 2.5cm / 1in y ponlo a un lado.", "Pele el pepino, divídalo a la mitad y quite las semillas con una cucharadita. Luego córtelo en cubos de 2.5cm / 1 in, espolvoree sal y ponga el pepino en un colador para drenar durante 20 minutos. (Esto elimina el exceso de humedad del pepino).", "A continuación, enjuague los cubos de pepino con agua fría y séquelos con papel de cocina.", "Caliente un wok o una sartén grande hasta que esté muy caliente.", "Agregue el aceite y cuando esté muy caliente y ligeramente humeante, agregue los cubos de pollo y sofríalos por unos segundos.", "Agregue todos los otros ingredientes excepto el pepino y continúe revolviendo por otros 2 minutos.", "Ahora agregue los cubos de pepino y siga revolviendo toda la mezcla por otros 3 minutos. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_garlicchickenwithcuc_66272", "title": "Pollo de ajo con pepino", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Brócoli 85g / 3oz, cortado en florecillas", "1 diente de ajo, picado", "½ chile rojo, finamente picado", "2 cucharadas de salsa de soja", "1 cucharadita de aceite de sésamo", "½ lima, solo jugo", "sal y pimienta negra recién molida"], "method": ["Calentar el aceite de oliva en un wok, agregar el brócoli y freír durante 2-3 minutos, o hasta que comience a ablandarse, luego agregar el ajo y el chile y freír durante 1-2 minutos.", "Agregue la salsa de soja, el aceite de sésamo, el jugo de lima, la sal y la pimienta negra recién molida y fríe durante 1-2 minutos, o hasta que el brócoli esté tierno.", "Para servir, vierta la salteada en un bol y sirva como guarnición."], "url": "www_bbc_co_uk_food_recipes_garlicchilliandbrocc_90660", "title": "Ajo, chile y brócoli salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garlicchilliandbrocc_90660_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de pan blanco fuerte de 340g / 12oz, más extra para enharinar", "1 cucharadita de sal", "1½ cucharadita de levadura seca de fácil mezcla", "aproximadamente 200ml / 7fl oz de agua tibia", "3 cucharadas de aceite de oliva, más extra para engrasar", "2 dientes de ajo, finamente picados", "4 tomates grandes de ciruela madura", "1 cucharadita de azúcar en polvo", "sal y pimienta negra recién molida", "llovizna de aceite de oliva virgen extra", "6-8 rebanadas de jamón de Parma", "gran puñado de cohetes", "2 x 125g / 4½ oz de bolas de mozzarella fresca", "2 cucharadas de alcaparras, enjuagadas", "aceite de oliva, para lloviznar"], "method": ["Tamiza la harina en un tazón grande con la sal, luego agrega la levadura. Haz un pozo en el centro de la harina. Mezcle el agua tibia y el aceite de oliva, luego mezcle el líquido con la harina y mezcle para hacer una masa suave y húmeda (es posible que necesite agregar un poco más de agua o aceite de oliva).", "Coloque la masa sobre una superficie limpia, ligeramente enharinada y, con las manos enharinadas, amase durante 5-10 minutos, hasta que quede suave y elástica.", "Coloque la masa en un recipiente grande, calentado y ligeramente engrasado. Cubra con una película adhesiva y deje que se levante en un lugar cálido durante aproximadamente una hora, hasta que la masa se haya duplicado.", "Precalentar el horno a 220C / 430F / Gas 7.", "Cuando la masa haya subido, colóquela sobre una superficie limpia enharinada y amasar nuevamente para \"noquearla\". Incorpore gradualmente el ajo picado.", "Ruede la masa en un círculo grande. Colóquelo en una bandeja para hornear enharinada o piedra para pizza y use sus manos para empujarlo hacia los bordes de la piedra o la sábana.", "Cortar los tomates y colocarlos encima de la pizza y espolvorear sobre el azúcar. Sazone con sal y pimienta negra recién molida y termine con una generosa llovizna de aceite de oliva virgen extra.", "Hornee durante unos 15-20 minutos, o hasta que la pizza esté crujiente y los tomates hayan comenzado a dorarse.", "Cuando la pizza esté cocida, retírela del horno, colóquela en un plato grande o en una tabla de cortar y agregue los ingredientes. Rasgue las rodajas de jamón de Parma y las bolas de mozzarella y esparza sobre la pizza con el cohete y las alcaparras. Rocíe con un poco de aceite de oliva extra y sirva."], "url": "www_bbc_co_uk_food_recipes_garliccrustpizzawith_90215", "title": "Pizza de corteza de ajo con jamón de Parma", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 pizza", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/garliccrustpizzawith_90215_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 polluelos", "4 dientes de ajo, finamente rallados", "½ cucharadita de pimienta de cayena", "40 g / 1½ oz de mantequilla", "1 cucharada de aceite de girasol", "½ cucharada de estragón picado", "½ cucharada de albahaca picada", "½ cucharada de perejil picado", "½ cucharada de eneldo picado", "copos de sal marina", "350 g / 12 oz de ciruelas o verdes, apedreado y más o menos picado", "1 diente de ajo, rallado o triturado", "½ cucharadita de pimentón ahumado", "½ cucharada de melaza negra", "2 ramitas de eneldo, picado", "copos de sal marina", "pan de masa fermentada"], "method": ["Comience por spatchcocking los poussins. Cortarlos a lo largo de la columna vertebral con un cuchillo o tijeras. Aplástalos con la palma de tu mano, luego frota con el ajo rallado y condimenta generosamente todo con la pimienta de cayena y los copos de sal marina.", "Caliente la mantequilla y el aceite en una sartén o sartén grande de base pesada. Cocine los poussins, con el lado del corte hacia abajo, a fuego medio durante 3 minutos, luego voltéelos y cocínelos boca abajo durante 5 minutos.", "Baje el fuego y coloque un círculo de pergamino para hornear o papel a prueba de grasa sobre los poussins, seguido de una sartén más pequeña en la parte superior. Pésalo todo con algo pesado.", "Cocine por 20-25 minutos sobre el calor más bajo posible. Para probar que los poussins están cocidos, sepárelos de las patas: deben salir fácilmente y los jugos deben quedar limpios.", "Mientras tanto, haga la salsa picante de ciruela, ponga las ciruelas o las bayas verdes en una olla con tapa. Agregue un chorrito de agua, cubra con una tapa y hierva a fuego medio-bajo durante unos 10 minutos hasta que los frutos comiencen a ablandarse.", "Mash las ciruelas con un tenedor, luego agregue el ajo, el pimentón y la melaza. Sazonar con sal marina. Cocine con la tapa por otros 10 minutos. Agrega el eneldo Puedes guardar la salsa durante unos días en un recipiente esterilizado en el refrigerador.", "Cuando terminen los poussins, déjalos reposar en una tabla de cortar durante 5 minutos. Agregue las hierbas a los jugos mantecosos en la sartén y cocine durante uno o dos minutos más.", "Sirva los poussins georgianos rociados con los zumos herby con el chutney de ciruela en el lado y un poco de pan de masa fermentada para limpiarlo todo."], "url": "www_bbc_co_uk_food_recipes_garlicky_georgian_30165", "title": "Garlicious georgiano poussins con ciruela chutney", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2¼lb de patatas nuevas, preferiblemente Jersey Royals, restregado", "1 litro / 1¾pints de caldo de verduras", "6 dientes de ajo", "Puntas de espárragos de 450 g / 1 lb", "2 cucharadas de perejil", "Paquete de 20 g de menta, tallos eliminados", "ralladura de cáscara y jugo de 1 limón grande", "4 cucharadas de aceite de nuez", "4 cucharadas de aceite de girasol", "1 cucharada de azúcar en polvo"], "method": ["Coloque las papas en una olla grande, agregue el caldo de verduras y el ajo, sazone ligeramente con sal y pimienta. Cubra y lleve a ebullición, cocine a fuego lento durante 7 - 8 minutos o hasta que esté casi tierna. 2. Agregue las puntas de espárragos y continúe cocinando, destapado, hasta que los espárragos estén tiernos.", "Levante los espárragos en un plato y déjelos a un lado. Continúe cocinando las papas a fuego alto hasta que el caldo se reduzca a un glaseado pegajoso para cubrir las papas.", "Incline en un tazón grande y agregue los espárragos. Dejar de lado. Levante el ajo y manténgalo separado.", "Coloque el ajo ablandado de las papas cocidas, las hierbas, la ralladura de limón y el jugo, el aceite y el azúcar en un procesador de alimentos o licuadora. Mezcle para formar un puré y sazone con sal y pimienta. Justo antes de servir verter el pistou sobre las patatas y los espárragos, mezcle ligeramente y amontone en un plato para servir."], "url": "www_bbc_co_uk_food_recipes_garlickyjerseyroyals_11713", "title": "Garlicky Jersey royals y espárragos con menta y limón pistou", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 diente de ajo", "Una pizca de sal marina", "2 cucharadas de aceite de oliva", "150 g / 5½ oz de filete de cordero", "pimienta negra recién molida", "100g / 3½oz de lentejas enlatadas, escurridas", "200ml / 7fl oz de vino tinto", "1 hoja de laurel", "50g / 1¾oz de mantequilla", "sal y pimienta negra recién molida"], "method": ["Para el cordero, coloque el ajo y la sal en un almirez y mortero o en un recipiente pequeño y aplastelos juntos para hacer una pasta. Agregue el aceite de oliva, frote la mezcla sobre el cordero y deje macerar durante cinco minutos.", "Caliente una sartén a la parrilla y carme el cordero durante 4-5 minutos en cada lado, o hasta que esté cocido a su gusto. Sazonar con pimienta negra recién molida y reservar para mantener el calor.", "Para las lentejas, coloque las lentejas en una sartén con el vino tinto y la hoja de laurel y cocine a fuego lento durante 10-12 minutos. Agregue la mantequilla y sazone con sal y pimienta negra recién molida.", "Para servir, coloque las lentejas en un plato con el cordero en la parte superior, cortado en rodajas."], "url": "www_bbc_co_uk_food_recipes_garliclambwithredwin_85014", "title": "Cordero de ajo con lentejas de vino tinto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["10 pequeñas patatas nuevas, hervidas en sus pieles", "2 cucharadas de pan rallado muy fino", "2 cucharadas de parmesano rallado o queso duro vegetariano similar", "2 huevos, golpeados", "aceite, para freír", "55 g / 2 oz de mantequilla", "2 dientes de ajo, finamente picados", "½ cucharadita de perejil, finamente picado", "sal y pimienta"], "method": ["Piel las papas cuando aún estén calientes y revuelva en pan rallado y parmesano mezclados. Sumerja el huevo batido y revuelva las papas en la mezcla de migas de pan. Calentar el aceite a 350 ° F / 180 ° C y freír durante 5-6 minutos hasta que estén dorados. Escurrir sobre papel de cocina absorbente y mantener caliente.", "Derrita la mantequilla, cocine el ajo hasta que se dore, sazone, mezcle con el perejil y vierta sobre las papas."], "url": "www_bbc_co_uk_food_recipes_garlicpotatoes_68023", "title": "Patatas de ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]