[{"isVegetarian": false, "title": "Coquilles Saint Jacques à la Parisienne with taboulleh", "url": "www_bbc_co_uk_food_recipes_coquillessaintjacque_85814", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 scallops, live in the shell, shell cleaned", "200g/7oz button mushrooms, thinly sliced", "¼ lemon, juice only", "500ml/18fl oz fish stock ", "300g/11oz medium baking potatoes", "2 free-range egg yolks", "25g/1oz butter", "salt and freshly ground white pepper", "50g/2oz butter", "25g/1oz plain flour", "2 free-range egg yolks", "150ml/7fl oz double cream", "salt and freshly ground black pepper", "110g/4oz couscous", "110ml/4fl oz boiling water", "1 head broccoli", "1 tsp light olive oil", "salt and freshly ground black pepper ", "15g/½oz gruyère, finely grated", "15g/½oz fine breadcrumbs", "50g/2oz butter, melted", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Place the whole live scallops onto a hotplate or hot griddle pan for 1-2 minutes, until they begin to open.", "Slide the blade of a filleting knife between the flat shell and the scallop and carefully lift off the shell lid. ", "Slide the knife blade between the scallop and the concave shell to detach the scallop and coral.", "Keep the four best concave shell halves for serving, brush them under cold water and dry them out.", "Peel off the membrane surrounding the scallops, clean them in cold water, cut in pieces and set aside for use in the sauce.", "Separate the whites of the scallops from the orange corals and wash gently in cold water to remove any grains of sand. ", "Place the scallops, corals, mushrooms, membranes and lemon juice into a pan with the fish stock, set over low heat and slowly bring to the boil. Lower the heat to simmer very gently for one minute. Remove from the heat, set aside and keep the scallops and mushrooms in the stock at room temperature.", "Preheat the oven to 220C/425F/Gas 7.", "Scrub the potatoes under cold running water and prick in 2-3 places with the point of a knife. Place onto a baking sheet and transfer to the oven to bake in their jackets for 35-40 minutes, or until soft inside.", "Halve the potatoes and scoop out the cooked flesh from the jackets. Force the potato flesh through a hard sieve or ricer into a clean bowl.", "Add two of the egg yolks and the butter and beat until smooth. Season, to taste, with salt and freshly ground white pepper. (The potato can be done the day before and kept in the fridge until needed.)", "For the sauce, melt the butter in a saucepan, stir in the flour and cook for two minutes to make a roux.", "Take the pan off the heat and strain in the stock from the scallops and mushrooms, stirring constantly to combine without lumps. Set the scallops and mushrooms aside.", "Simmer the sauce gently for a few minutes, whisking frequently.", "In a bowl, mix the two egg yolks with the cream, and then pour this mixture into the sauce. Before it begins to bubble, take the pan off the heat, season the sauce with salt and freshly ground black pepper and keep hot.", "For the tabbouleh, place the couscous into a bowl and pour an equal amount of boiling water onto it, season with salt and freshly ground black pepper, stir with a fork and cover with cling film for 4-5 minutes. Stir again and add the olive oil.", "Shave the very top of the broccoli florets off with a sharp knife and add to the couscous. Stir gently with a fork and season, to taste, with salt and freshly ground black pepper.", "To assemble the final dish, increase the oven temperature to 240C/465F/Gas 9.", "Cut the scallop whites into thick slices. Place a layer of mushrooms into each of the four clean scallop shells. Add a layer of scallop whites then top with the scallop corals.", "Fill a piping bag with the potato mixture and pipe an attractive ribbon around the edge of the scallop shells.", "Mix the gruyère and breadcrumbs together in a clean bowl.", "Cover the mushroom and scallop layers generously with sauce and sprinkle the top with the gruyère and breadcrumbs mixture.", "Melt the butter and pour it over the top of the sauce.", "Place the scallops into the hot oven to bake for 3-5 minutes, until the top of the sauce is lightly glazed and the potato border pale golden. ", "To serve, spoon the tabbouleh out onto four plates and carefully remove the scallops from the oven and place one on top of each pile of tabbouleh. Do not forget to warn your guests that the scallop shell will be extremely hot."]}, {"isVegetarian": false, "title": "Coriander baked sea bass with steamed purple sprouting broccoli and a coriander raita", "url": "www_bbc_co_uk_food_recipes_coriander_baked_sea_bass_66447", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["120g/4oz coriander, washed thoroughly ", "3 garlic cloves, peeled", "1 green chilli, stalk removed", "25g/1oz palm sugar", "3 tbsp vegetable oil", "1 tsp salt", "½ tsp sugar", "1 lemon, juice only", "1 whole wild sea bass (or 2 farmed), fins removed, cleaned and gutted", "200g/7oz yoghurt", "2 tsp ground cumin, toasted in a dry frying pan until fragrant", "½ cucumber, finely chopped", "2 tbsp finely chopped fresh coriander leaves", "salt and freshly ground black pepper", "1 bunch (about 225g/8oz) purple sprouting broccoli", "50g/1¾oz unsalted butter", "2 tbsp coriander cress", "2 tbsp baby red sorrel cress"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 5.", "For the baked sea bass, put the coriander (leaves and stalks), garlic, chilli, palm sugar, oil, salt, sugar and lemon juice in a food processor and blend to a paste consistency.", "Put the sea bass on a baking tray lined with aluminium foil. Cover the fish with the coriander paste and another sheet of foil. Bake for 10 minutes then remove the top sheet of foil to uncover the fish and cook for a further 10-15 minutes.", "For the coriander raita, mix all of the raita ingredients together in a bowl. Season with salt and pepper.", "For the purple sprouting broccoli, put the purple sprouting broccoli into a steamer and steam for 4-7 minutes. Keep warm and finish with the butter.", "To serve, place the broccoli in the centre of serving bowls. Peel the skin off the sea bass and top the broccoli with some of the sea bass meat and a spoonful of coriander raita. Garnish with coriander cress and baby red sorrel cress, if using."]}, {"isVegetarian": false, "title": "Coriander crusted tuna with red cabbage salad", "url": "www_bbc_co_uk_food_recipes_corainder_crusted_tuna_70559", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp coriander seeds, lightly crushed", "8 tbsp chopped fresh coriander", "800g/1lb 12oz fresh tuna steak", "4 tbsp olive oil", "110g/3¾oz coriander", "1 garlic clove, chopped", "75g/2¾oz fresh coconut, grated", "vegetable oil", "½ red cabbage, shredded finely", "4 tbsp fresh coriander leaves", "4 tbsp fresh mint leaves ", "1 red chilli, finely diced", "3 tbsp fish sauce", "2 limes, zest and juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the tuna, mix the coriander seeds and fresh coriander together and sprinkle on a board.", "Brush the oil all over the tuna and roll in the coriander mixture. Heat a griddle pan and place the tuna onto the pan. Cook until bar marks appear and turn the tuna around until you have marks all around the tuna. Make sure it is still pink in the middle.\r\n", "For the coriander pesto, put the coriander, garlic and coconut into a food processor and blend adding enough oil to give you a coarse paste. ", "For the salad, place all of the ingredients in a large bowl and mix. ", "Cut the tuna into odd shapes and dot onto a plate. Place a quenelle of the pesto on the plate and dress with the cabbage salad."]}, {"isVegetarian": false, "title": "Coriander-marinated spatchcock chicken with coconut and coriander salad", "url": "www_bbc_co_uk_food_recipes_coriander-marinated_56361", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp coriander seeds", "2 tbsp fenugreek seeds", "1 tsp cumin seeds", "½ tsp fennel seeds", "1 tsp black peppercorns", "1 cinnamon stick", "5 cloves", "3 cardamom pods, seeds removed", "1 tbsp ground turmeric", "2 bay leaves, crushed", "2 tbsp fresh coriander", "400g/14oz natural yoghurt", "2 tbsp vegetable oil", "1 chicken, spatchcocked", "50g/1¾oz mitzuna leaves", "2 head Little Gem lettuce, leaves separated", "½ fresh coconut, flesh only, cut into strips", "4 tbsp palm sugar", "4 garlic cloves", "2 tbsp grated fresh root ginger", "3 red chillies, finely chopped", "1 bunch fresh coriander", "3 limes, juice only", "2 tbsp fish sauce"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the coriander-marinated spatchcock chicken, place all the spices in a dry frying pan and cook for 2-3 minutes, or until the spices start to pop and realise their oils and aroma.", "Place the spices in a spice grinder and grind to a powder.", "Put the coriander, yoghurt, oil and powdered spices in a bowl and mix. Spread the marinade all over the chicken and leave to marinate for at least two hours.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a large griddle pan and place the chicken breast-side down and cook for 4-5 minutes, or until bar marks appear. Turn over and cook for a further 4-5 minutes.", "Cook in the oven for 20-25 minutes, depending on the size of the chicken. The chicken is cooked when the juices run clear when the thickest part is pierced with a skewer. Once cooked, remove from the oven, cover and allow to rest in a warm place.", "For the coconut and coriander salad, place the mitzuna and lettuce leaves in a bowl and add the strips of coconut.", "Place the remaining salad ingredients into a pestle and mortar and pound to a paste. Add the paste to the bowl of leaves and toss to coat.", "To serve, cut the chicken into portions and place on a serving plate alongside the coriander salad."]}, {"isVegetarian": false, "title": "Coriander chicken and fennel seeds and rosemary pulled pork vol-au-vents", "url": "www_bbc_co_uk_food_recipes_coriander_chicken_and_76082", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz plain flour", "1½ tsp table salt", "560g/1lb 4oz unsalted butter", "½ tsp lemon juice", "1 large free-range egg, for egg wash", "vegetable oil, for frying", "300g/10½oz boneless chicken thighs, chopped into small pieces", "1 medium white onion, roughly chopped", "1 small green pepper, seeds removed and roughly chopped", "handful fresh coriander, roughly chopped", "2 small green bird's-eye chillies, seeds removed and finely chopped", "2cm/¾in fresh root ginger, peeled and finely chopped", "2 garlic cloves, finely chopped", "1 tsp table salt", "1 tsp ground coriander seeds", "¼ tsp ground turmeric", "1 tbsp full-fat Greek yoghurt", "1 lemon, juice only ", "vegetable oil, for frying", "400g/14oz pork shoulder steaks (6 Steaks)", "500ml/18fl oz clear apple juice", "2 tbsp dark soy sauce", "2 tsp fennel seeds ", "25g/1oz butter ", "2 tsp chopped fresh rosemary", "½ tsp salt"], "serves": "Makes 48 vol-au-vents", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the puff pastry, in a food processor combine the flour, salt and 60g/2¼oz of the butter. Add 225ml/8fl oz water and the lemon juice and knead to a smooth dough. Cover with cling film and leave to rest in the fridge.", "Take two large pieces of baking parchment and lay them either side of the remaining butter block. Bash the butter block with a rolling pin into a square shape until smooth and pliable. Once the dough has rested for about 15 minutes, roll out to a square large enough so that it will envelope the butter. Seal the butter into the dough and then roll out to a long rectangle and fold the dough over itself into thirds (like folding a letter). ", "Turn the dough 90 degrees, roll out and fold over again. Cover with cling film and rest in the fridge again. Repeat this process to give 6 turns in total. Rest the dough in the fridge again for about 20 minutes.", "While the pastry is resting make the fillings. For the coriander chicken, heat some oil in a frying pan over a medium heat and cook the chicken until browned all over.", "Meanwhile, put the onion, peppers, coriander, chillies, ginger, garlic and salt in a blender and blend to a paste. ", "In another pan, cook the ground spices in a little oil for 1 minute. Add the chicken and cook for a further minute. Add the coriander paste and cook for 5-10 minutes over a medium heat. Add salt as needed and then finish by stirring in the yoghurt and lemon juice to taste.", "For the pulled pork, heat a little vegetable oil over a medium heat and brown the pork shoulder steaks on all sides. Add the apple juice and soy sauce and simmer, covered, for 1½-2 hours on a medium heat.", "Once the pork is cooked and nearly falling apart, leave to cool in the pan with the juices. Remove to a plate after 15-20 minutes and shred using your hands or two forks.", "Grind the fennel seeds in a pestle and mortar. Heat the butter in large wok over a medium heat and add the fennel seeds and rosemary. Cook for 1 minute and then remove the pork from its cooking juices and add it to the wok with the salt. Fry on a medium heat for 2-3 minutes, adding in some of the cooking juices if the meat starts to dry out.", "When all the turns are completed, roll the dough out to 5mm thick. Cut out rings using a 5cm/2in crinkled cookie cutter, then, using a 2½cm/1in round cookie cutter, remove the middle. Make 48 of these in total.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Take the scraps of remaining dough and knead them into a ball. Roll out thinly to 4mm and cut out 48 bases, using the 5cm/2in cutter. Arrange on 2 baking trays lined with baking parchment. Brush the bases with egg wash and prick all over with a fork. Place the rings on top and brush with egg wash again, being careful not to let any egg wash drip down the sides. Bake for 17 minutes, or until cooked through and golden-brown. Remove and set aside to cool.", "Assemble the vol-au-vents by placing a little of the chicken or pork filling in each pastry. Top the pork filling with a splash of some of the reserved juices. Serve immediately."]}, {"isVegetarian": false, "title": "Coriander seared tuna on pickled bean sprouts", "url": "www_bbc_co_uk_food_recipes_coriandersearedtunao_10343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14oz fresh tuna (must be fresh)", "30g/1oz coriander seeds", "20g/¾oz sechuan peppercorns", "salt and pepper to taste", "180g/6oz bean sprouts", "20ml/1 tsp rice wine vinegar (any other is too strong)", "40ml/2tsp brown sugar", "20g/¾oz Thai basil, ripped", "20g/¾oz mint, ripped", "50g/2oz spring onion, thinly sliced", "60g/2¼oz shallots, thinly sliced", "20g/¾oz chilli julienne (large red chillies - not too hot - sliced)", "20g/¾oz deep-fried garlic/chilli (can make yourself or buy from an Asian store)", "20g/¾oz coriander (fresh)", "tumeric oil", "reduced balsamic vinegar", "100ml/4fl oz olive oil", "1 tsp tumeric (fresh or powder)", "100ml/3½fl oz balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Roll the tuna in crushed coriander seeds and the sechuan pepper seeds.", "Roll the tuna in cling film to keep its's hape and refrigerate for an hour, this stops the seeds from falling off.", "Sear tuna on all sides, keep at room temperature, the tuna should be pink.", "Slice the tuna into 4 pieces.", "To make the pickled bean sprouts, heat the rice wine vinegar and sugar. Pour over the bean sprouts and allow to cool.", "To prepare the tumeric oil, Heat the oil, add the tumeric and allow to cool.", "To prepare the balsamic vinegar, reduce by a half  by heating for approximately 5 minutes.", "To serve, mix pickled bean sprouts with basil, mint, sliced shallots, spring onions and deep fried chilli/garlic. Arrange neatly on to four flat plates.", "Place one piece of the tuna on each of the plates. Garnish with coriander, drizzle tumeric oil and reduced balsamic vinegar around the plate."]}, {"isVegetarian": false, "title": "Coriander fish curry with pilau rice and coriander flatbreads", "url": "www_bbc_co_uk_food_recipes_coriander_fish_curry_68807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp vegetable oil", "1 onion, thinly sliced", "3 green cardamom pods, crushed", "1 cinnamon stick, broken in half", "2 star anise", "400g/14oz basmati rice", "2 tsp cumin seeds", "4 tsp coriander seeds", "50ml/2fl oz sunflower oil", "1 small onion, finely chopped", "1 tsp black mustard seeds", "1 tsp turmeric", "1 stick cinnamon, broken up", "3 garlic cloves, chopped", "1 red chilli, seeds removed and finely chopped", "2cm/½in fresh ginger", "1 mango, finely diced", "100g/3½oz fresh coconut, grated", "400ml/14fl oz coconut milk", "800g/1lb 12oz white fish fillets, pin-boned, skin removed, diced", "4 tsp tamarind paste", "4 tbsp finely chopped fresh coriander", "1 tsp turmeric", "1 tsp curry powder", "4 tsp finely chopped fresh coriander", "1 tsp salt", "200g/7oz plain flour", "100g/3½oz butter or ghee, melted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the pilau rice, heat the oil in a large saucepan and, once hot, add the onion. Cook until the onions are golden-brown, this will take approximately 10 minutes.", "Stir in the cardamom, cinnamon and star anise. Add the rice and stir to coat in the onion spice mix. Add 600ml/21fl oz water and bring to the boil, reduce the heat to low and cover with a lid. Cook for 15 minutes then turn off the heat, leaving the lid on, and leave to steam for another 15 minutes.", "For the curry, heat a small frying pan and add the cumin and coriander seeds and cook until they start to pop. Remove from the pan, transfer to a pestle and mortar and pound the seeds to a coarse powder.", "In a large pan, heat the sunflower oil. When hot, add the onions and fry for 4-5 minutes, or until deeply golden-brown. Add all the spices (including those from the pestle and mortar), garlic, chilli, ginger, mango and fresh coconut and cook for 2- 3 minutes and then add the coconut milk and bring to the boil.", "Add the fish and cook for 2-3 minutes. ", "To finish, add the tamarind paste and coriander and simmer for 1-2 minutes.", "Method for the coriander flatbeads, mix the turmeric, curry powder, coriander, salt, flour and in a bowl adding enough water to create a soft dough.", "Knead using floured hands and roll out on a floured surface until thin. Cut into rustic shapes and then pan fry in a hot pan brushed with butter for 4-5 minutes on each side or until golden-brown.", "Serve the curry and rice in shallow serving bowls and place the flatbreads on the side."]}, {"isVegetarian": false, "title": "Corn and quinoa tamale, grilled vegetable salsa and marinated grilled chicken", "url": "www_bbc_co_uk_food_recipes_corn_and_quinoa_tamale_77639", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large chicken thighs", "2 tbsp natural yoghurt", "1 lime, juice and zest", "1 tsp honey", "¼ tsp smoked paprika", "4 sweetcorn on the cob with husks on", "4 tbsp olive oil", "1 onion, finely chopped", "3 garlic cloves, finely chopped", "½ tsp lemon thyme leaves", "1 dried chipotle chilli, seeds removed, finely chopped or 1 tsp chipotle paste", "200ml/7fl oz apple juice ", "1-2 tbsp quinoa", "½ red pepper", "1 cucumber, cut into 5cm/2in chunks", "¼ small red onion", "1 tomato ", "3 tbsp olive oil ", "salt and freshly ground black pepper", "½ garlic clove", "1 lime, juice only", "½ handful of fresh mint, chopped", "½ handful of fresh coriander, chopped  ", "½ handful of fresh basil, chopped "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Place all the ingredients for the marinade in a small bowl then mix well with a spoon. Dip each piece of chicken in the marinade then place on a plate. Cover with a cling film to marinate in the fridge for a couple of hours.", "For the corn and quinoa tamale, gently pull off the husk (leaves) from around the cob, making sure to keep it whole. With a sharp knife, cut off the corn from the cob and keep the leaves to one side.", "In a pan, heat up the olive oil and add the onions, garlic, lemon thyme and finely chopped chipotle. Cook by gently stirring until the onions get a light golden colour; at this stage add the corn and the apple juice. Cover with a lid and cook on a low heat to simmer gently. ", "After 15 minutes, keeping the ingredients in the pan, use a hand-held stick blender to slightly blend the mixture - pulse 3 or 4 times (only enough to start to break some corn and release some of the starch). Add the quinoa, mix well, cover with a lid and cook on a low heat for another 10 minutes. Pour the mixture into a clean bowl, then set aside to cool.", "To shape the tamale: Cut four 15cm/6in lengths of kitchen string. On a clean surface overlap the corn leaves to make four crosses. Place equal amounts of the mixture in the middle and then fold in the right side to the left, then the top down toward you, then the left to right and finally, the front up to complete the parcel. Tighten the parcel neatly with a piece of string.", "For the salsa, heat a griddled pan or barbecue to hot. Toss the vegetables in very little of the olive oil, season with salt and pepper then sear them on a very hot cast iron griddle or barbecue to slightly char the outside.", "Place in a blender, add the rest of the olive oil with some salt, pepper, garlic and lime juice and blend to a slightly chunky sauce. Taste and season again if necessary.", "Preheat a griddle pan or barbecue to medium-high and grill the marinated chicken thighs until cooked through, then set aside to rest. (Insert a skewer into the thickest part of the thigh to check that the juices run clear.) Finish in the oven if necessary at 200C/400F/Gas 6.", "Place the tamales on the griddle or barbecue to colour on both sides. Then switch off the heat (or move the tamale off the direct heat if on the barbecue) and leave to warm through.", "To serve, place the salsa in a jug. Cut off the top leaves of each tamale with scissors place one on each plate.  Place a chicken thigh alongside, sprinkle over the herbs and serve."]}, {"isVegetarian": false, "title": "Corn on the cob with burnt-onion ketchup", "url": "www_bbc_co_uk_food_recipes_corn_on_the_cob_with_88227", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corn_on_the_cob_with_88227_16x9.jpg", "ingredients": ["2-3 tbsp vegetable oil", "3 onions, peeled and sliced", "2 bay leaves", "150ml/5fl oz white wine vinegar", "1 tbsp Worcestershire sauce", "3 garlic cloves, grated", "50g/1¾oz dark muscovado sugar", "1 tbsp chopped salted anchovies", "100g/3½oz butter, softened", "1 tsp smoked paprika", "1 tsp dried sage", "1 tsp dried chilli flakes", "1 tsp cracked black peppercorns", "1 tsp table salt", "1 tsp garlic powder", "4 heads sweetcorn, husk and silk removed"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the burnt-onion ketchup, heat a tablespoon of the oil in a large non-stick frying pan over a high heat. Add a small handful of the sliced onions and fry until dark golden-brown and almost charred. Remove from the pan using a slotted spoon and set aside in a bowl. Repeat the process with more oil and more onions until all of the onions are cooked.", "Return all of the cooked onions to the pan and add the bay leaves, white wine vinegar, Worcestershire sauce, grated garlic and muscovado sugar. Bring to the boil, then reduce the heat until the mixture is just simmering. Simmer for 20-25 minutes, or until the onions have softened. If the mixture starts to catch on the bottom of the pan add a little water.", "Remove the pan from the heat and remove the bay leaves from the ketchup mixture. Stir in the chopped anchovies and leave to cool slightly.", "When the ketchup mixture has cooled a little, transfer it to a jug and blend to a smooth purée using a hand-held blender (or transfer to a food processor and blend). Add a little water if the ketchup is too thick. ", "Strain the mixture through a fine-mesh sieve, collecting the strained ketchup in a bowl. Cover and chill until needed.", "Preheat the oven to 200C/400F/Gas 6.", "For the corn on the cob, in a bowl, beat together the butter, smoked paprika, dried sage, chilli flakes, cracked black pepper, salt and garlic powder. Spread the mixture all over the corn, then wrap each corn on the cob in aluminium foil. Place on a baking tray and roast in the oven for 20-25 minutes, or until the corn kernels are cooked. ", "To serve, unwrap the corn on the cobs, place on serving plates and serve the burnt-onion ketchup alongside."]}, {"isVegetarian": true, "title": "Corn tortilla", "url": "www_bbc_co_uk_food_recipes_corn_tortilla_59257", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corn_tortilla_59257_16x9.jpg", "ingredients": ["150g/5½oz masa harina (available online)", "pinch salt", "100ml/3½fl oz cold water", "1 tbsp olive oil"], "serves": "Makes 24 tortillas", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the masa harina and salt in a bowl. Add the water and olive oil and mix until a smooth dough is achieved.  (If it’s too sticky add a little more masa harina, or, if it’s too dry, add a drop more water.)", "Divide the dough into 24 balls. Cover and leave to rest in the fridge for 10 minutes. ", "Flatten the balls of dough with your hands - alternatively, use a tortilla press or roll them between two layers of cling film. Flatten to approximately 3mm thick. ", "To cook the tortillas, lightly oil a flat griddle pan or frying pan and place over a hot heat.", "Cook the tortillas for approximately one minute on each side, or until lightly coloured."]}, {"isVegetarian": false, "title": "Corn and cod chowder with saffron, bacon and tomato", "url": "www_bbc_co_uk_food_recipes_cornandcodchowderwit_86166", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ onion, chopped", "1 sweetcorn cob, kernels removed", "200ml/¼ pint double cream", "pinch saffron strands", "1 x 100g/3½oz cod fillet, skin removed, chopped", "1 tomato, finely chopped", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper", "1 rasher streaky bacon, chopped and fried until crisp, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan, add the onion and sauté for 3-4 minutes, or until softened.", "Add the sweetcorn kernels to the pan and cook for 1-2 minutes.", "Add the cream, saffron and cod pieces and simmer for 2-3 minutes, or until the cod is cooked through.", "Add the tomato and parsley, season well with salt and freshly ground black pepper and stir.", "To serve, pour the chowder into a serving bowl and top with the bacon."]}, {"isVegetarian": true, "title": "Cornbread", "url": "www_bbc_co_uk_food_recipes_cornbread_86386", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornbread_86386_16x9.jpg", "ingredients": ["375g/13oz plain flour", "225g/8oz cornmeal", "1 tsp salt", "4 tsp baking powder", "110g/4oz sugar", "480ml/17fl oz milk", "2 free-range eggs ", "110g/4oz butter, melted, plus extra for greasing ", "small tin sweetcorn kernels, drained (or use fresh sweetcorn)"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease 23cm/9in square baking pan with melted butter.", "In a large bowl, combine all the ingredients together except for the sweetcorn kernels.  Mix until you have the consistency of a sponge cake batter, then add the sweetcorn.  ", "Stir to combine thoroughly, then pour into the prepared baking pan. Bake for about 20 minutes in the top of the oven. (Alternatively, you can bake these in a muffin tray lined with paper cases.)", "The cornbread is ready when it has a golden colour and is springy to the touch. Allow to cool slightly before cutting."]}, {"isVegetarian": true, "title": "Sweetcorn chowder", "url": "www_bbc_co_uk_food_recipes_cornchowder_84186", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "½ 326g/11½ oz can sweetcorn, rinsed and drained", "100ml/3½fl oz ready-made cheese sauce", "50ml/2fl oz white wine", "100ml/3&rfac12;fl oz double cream", "1 garlic clove, crushed", "100ml/3½fl oz chicken stock (vegetarians may substitute suitable vegetable stock)", "½ lemon, zest only", "2 spring onions, finely chopped", "1 tbsp chopped fresh chives", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a saucepan and add the sweetcorn, stirring to coat.", "Add the cheese sauce, wine, cream, garlic, stock, lemon zest, spring onions and chives to the pan and season, to taste, with salt and freshly ground black pepper.", "Bbring the mixture up to a simmer, cook for 3-4 minutes, then pour into a bowl."]}, {"isVegetarian": true, "title": "Cornbread with spiced Cajun-style beans", "url": "www_bbc_co_uk_food_recipes_cornbreadwithspicedc_92780", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz self-raising flour", "100g/3½oz medium polenta", "2 tsp baking powder", "1 lemon, zest and juice ", "1 tsp cayenne pepper", "200-225ml/7-8fl oz water", "1 garlic clove, peeled, crushed ", "salt and freshly ground black pepper ", "250ml/9fl oz vegetable oil", "2-3 tbsp vegetable oil", "1 red onion, peeled, chopped ", "2 celery stalks, trimmed, finely chopped", "1 garlic clove, peeled, crushed ", "1 tsp ground white pepper", "1 tsp dried thyme leaves ", "1 tsp dried oregano leaves ", "pinch cayenne pepper", "440g/1lb canned chopped tomatoes", "125ml/4½fl oz vegetable stock", "200g/7oz canned kidney beans, drained, rinsed", "200g/7oz canned butter beans, drained, rinsed"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the cornbread, mix together the flour, polenta, baking powder, lemon zest and cayenne pepper in a bowl until well combined. Gradually add the water in a thin stream, stirring well until the mixture comes together as a thick batter (you may not need to use all of the water). Stir in the lemon juice and garlic and season, to taste, with salt and freshly ground black pepper.", "Heat half of the oil in a 20-25cm/8-10in ovenproof frying pan over a medium to high heat. When the oil is smoking, pour in the cornbread batter. Fry for 4-5 minutes on each side, or until beginning to set.", "Drizzle the remaining oil over the cornbread, then transfer the pan to the oven and continue to cook for a further 4-5 minutes, or until golden-brown on top and cooked through. Remove from the pan and set aside to cool slightly. ", "Meanwhile, for the topping, heat the oil in a frying pan over a medium heat. Add the onion, celery and garlic and fry for 4-5 minutes, or until softened. Stir in the spices and herbs and cook for a further 1-2 minutes, or until fragrant.", "Add the chopped tomatoes and stock and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 5-8 minutes, or until thickened.", "Add the kidney beans and butter beans and cook for a further 3-4 minutes, or until heated through.", "To serve, cut the cornbread into six equal-sized pieces. Place one into the centre of each of six serving plates. Spoon over the bean mixture."]}, {"isVegetarian": false, "title": "Corned beef and oatmeal pudding", "url": "www_bbc_co_uk_food_recipes_corned_beef_and_oatmeal_07769", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz beef dripping or butter", "115g/4oz fine oatmeal", "450g/1 lb corned beef, chopped ", "55g/2oz wholemeal breadcrumbs", "2 tbsp grated carrot", "300ml/½ pint vegetable stock", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the dripping in a hot saucepan.  Add the oatmeal and cook for 2-3 minutes then stir in the corned beef, breadcrumbs and raw carrots. ", "Stir in the vegetable stock until well combined.", "Grease a pudding basin and spoon in the mixture.", "Fold a large piece of aluminium foil in half and grease one side with butter. Wrap the pudding in the greased foil, greased side facing into the pudding. (Pleat the foil a few times as you wrap it to allow room for the pudding to expand.) Secure the foil to the rim of the pudding basin with string.", "Place the wrapped pudding into a large steamer. (Alternatively, place the wrapped pudding into a large pan, pour in enough boiling water to reach halfway up the sides of the basin, then cover the pan with a lid.) Steam the pudding over a medium heat for 1 hour 30 minutes, or until cooked through, topping up the steamer with boiling water as necessary. (NB. The pudding is cooked through when a skewer inserted into the centre comes out clean.)"]}, {"isVegetarian": false, "title": "Corned beef and onion pie", "url": "www_bbc_co_uk_food_recipes_corned_beef_and_onion_91401", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corned_beef_and_onion_91401_16x9.jpg", "ingredients": ["15g/½oz butter", "1 tbsp sunflower oil", "1 large onion, sliced or chopped", "2 celery sticks, trimmed, peeled to remove stringy bits, sliced", "2 medium carrots, cut into 1cm/½in dice", "300g/10½oz potatoes, preferably Maris Pipers, peeled and cut into 1cm/½in dice", "2 tbsp tomato ketchup", "1 x 340g/11¾oz can corned beef", "freshly ground black pepper", "300g/10½oz plain flour, plus extra for rolling", "good pinch sea salt", "175g/6oz cold butter, cubed", "1 free-range egg"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the filling, melt the butter with the oil in a large non-stick frying pan. Add the onion, celery, carrots and potatoes. Cook over a low heat for about 15 minutes until the vegetables are softened and beginning to colour, stirring regularly. The carrots should retain a little bite.", "Add the ketchup and stir into the vegetables for a few seconds before adding the corned beef. Break the beef into chunky pieces with a wooden spoon and mix with the vegetables.", "Season with pepper – you shouldn’t need salt as the corned beef is fairly salty – and remove from the heat. Leave to cool for about 20 minutes.", "Preheat the oven to 190C/375F/Gas 5. ", "To make the pastry, put the flour, salt and butter in a food processor and pulse until the mixture resembles breadcrumbs. ", "Lightly whisk the egg with a tablespoon of cold water in a small bowl. Slowly pour all but one tablespoon of the egg mixture into the food processor with the motor running and blend until the mixture begins to form a ball.", "Turn the pastry out onto a well-floured work surface and bring it together into a ball. Take about a third of the pastry, roll it out and use it to line a 23cm/9in pie plate or 20cm/8in round ceramic quiche dish or deep Victoria sandwich tin. Leave any excess pastry overhanging the edge. Brush the pastry edge lightly with the reserved egg.", "Spoon the filling into the pastry base and spread it out evenly. Flour the surface once more and roll out the remaining pastry. Lift the rolled pastry over the rolling pin and place gently over the filling. Press the edges firmly together then trim neatly. Seal the edge with a fork. ", "Brush the top of the pastry with the remaining beaten egg, cut a cross in the centre of the pie and place onto a baking tray. Bake for about 40 minutes or until the pastry is golden-brown and the filling is piping hot."]}, {"isVegetarian": false, "title": "Corned beef hash", "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_00708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz unsalted butter", "10 onions, sliced", "7kg/15lb 4oz floury white potatoes, boiled and chopped into cubes", "10 x 340g/12oz tins corned beef, chopped into cubes", "150ml/5fl oz Worcestershire sauce", "small bunch curly parsley, chopped", "sea salt and freshly ground black pepper"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in frying pans until foaming and gently fry the onions for 2-3 minutes, or until softened. ", "Add the potatoes and the corned beef and fry for 5-6 minutes, pressing down the mixture every so often with a fish slice, until the mixture is golden-brown and crisp. ", "When the corned beef hash is cooked, remove the pan from the heat, sprinkle over the Worcestershire sauce and parsley and season to taste with salt and freshly ground black pepper. "]}, {"isVegetarian": false, "title": "Corned beef hash with beer-battered onion rings", "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_with_09807", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 floury potatoes, such as Maris Piper, peeled and diced", "vegetable oil, for deep-frying", "100g/3½oz plain flour", "1 tbsp caster sugar", "pinch salt", "2 tbsp cider vinegar", "150-200ml/5-7fl oz beer or lager", "2 onions, 1 cut into 1cm/½in-thick slices, 1 chopped", "50g/1¾oz butter", "1 garlic clove, crushed", "4 ripe tomatoes, 2 chopped, 2 sliced", "1 x 340g tin corned beef, roughly chopped", "1 tbsp Worcestershire sauce", "4-5 drops Tabasco"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the potatoes to the boil in a pan of salted water. Reduce the heat until the water is simmering and simmer the potatoes for 8-10 minutes, or until just tender. Drain well and set aside.", "Meanwhile, heat the oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan, until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Whisk the flour, sugar, salt, vinegar and half of the beer together in a large bowl to a thick, smooth batter. Continue to add the beer a little at a time until the batter has the consistency of double cream (you may not need to use all of the beer).", "Separate the onion slices into rings and dip each one into the batter until completely coated. Carefully lower the onion rings, in batches, into the hot oil and fry for 3-4 minutes, or until golden-brown and cooked through. Remove from the hot oil and set aside to drain on kitchen paper. Repeat the process with the remaining onion rings.", "Heat half of the butter in a frying pan over a medium heat and add the chopped onion. Fry for 2-3 minutes, or until softened.", "Add the remaining butter to the pan, then add the garlic and drained potatoes and continue to fry for 2-3 minutes.", "Add the chopped tomatoes and the corned beef and stir-fry for 1-2 minutes, or until the tomatoes have softened and the corned beef is heated through. Add the Worcestershire sauce and Tabasco and season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the corned beef hash onto serving plates. Pile the onion rings on top. Garnish with the sliced tomatoes."]}, {"isVegetarian": false, "title": "Corned beef hash with fried egg", "url": "www_bbc_co_uk_food_recipes_corned_beef_hash_with_90754", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz potatoes, peeled and cut into similar-sized pieces ", "3 tbsp olive oil ", "1 onion, thinly sliced ", "1 x 200g/7oz tin corned beef, diced ", "1-2 tsp English mustard, to taste ", "4 eggs ", "salt and black pepper "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the peeled, chopped potatoes in a saucepan of salted boiling water for 8-10 minutes, or until tender. Once tender, drain and set aside.", "Meanwhile, heat one tablespoon of the olive oil in a large non-stick frying pan. Cook the onion with a pinch of salt over a medium heat for about five minutes, or until softened and turning golden-brown. Once the onions are cooked, push them to the edge of the pan.", "Add a little more oil to the pan and then add the potatoes, crushing them roughly with the back of a fork. Spread them out so that they cover the base of the pan and leave to cook for 4-5 minutes, or until a golden crust is beginning to form on the base. Turn and repeat until all the sides of the potatoes are golden-brown. Mix with the onions at the edge of the pan.", "Add the corned beef and English mustard to taste and stir through to mix well. Continue to cook over a low heat while you prepare the eggs.", "Add the remaining olive oil to a separate frying pan. Once hot, crack in the eggs and fry until the white is cooked through, but the yolk still runny.", "Serve the hash divided between serving plates with an egg on top and eat immediately."]}, {"isVegetarian": false, "title": "Corned beef plate pie", "url": "www_bbc_co_uk_food_recipes_corned_beef_plate_pie_41244", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/corned_beef_plate_pie_41244_16x9.jpg", "ingredients": ["300g/10½oz plain flour", "pinch salt", "75g/2½oz cold unsalted butter, cut into roughly 1cm/½in dice", "75g/2½oz lard, cut into roughly 1cm/½in dice", "beaten egg, to finish", "1 tbsp vegetable or sunflower oil", "1 medium onion, chopped", "1 large carrot, peeled and diced ", "2 celery sticks, diced", "1 large potato, about 250g/9oz, such as Desiree, peeled and cut into 1cm/½in dice", "340g/12oz tin corned beef, broken into large chunks", "splash Hendersons Relish or Worcestershire sauce", "250m/9fl oz dark beef stock", "1 tbsp chopped parsley ", "salt and white pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the pastry, put the flour into a bowl and mix in the salt. Add the butter and lard and rub into the flour with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or mixer and then transfer to a bowl.", "Using a table knife, work in just enough cold water to bring the pastry together (4–6 tablespoons). When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and put in the fridge to rest while you make the filling.", "Heat the oil in a large frying pan over a medium-low heat. Add the onion, carrot and celery and cook gently for 5–10 minutes, or until soft but not coloured.\t", "Add the potato and cook for another five minutes. Stir in the corned beef, making sure it’s evenly distributed.", "Add the bottled sauce, pour over the stock and bring to the boil. Lower the heat and simmer, uncovered, for 20 minutes or so, until the carrots and potatoes are tender and most of the liquid has evaporated.", "Taste and add salt and pepper if necessary, then tip into a bowl and leave to cool completely.", "Preheat the oven to 200C/400F/Gas 6 and have ready a 23cm/9in metal pie plate.", "Divide the pastry into two pieces – roughly two-thirds and one third. Lightly flour your work surface and roll out the larger piece to a 2–3mm thickness. Use to line the pie plate. Roll out the remaining pasty ready to form the lid.", "Stir the chopped parsley into the filling. Spoon the filling into the pastry-lined dish (if it’s very wet, keep some of the liquid back to serve as gravy). Brush the edges of the pastry on the plate with a little beaten egg, then cover the pie with the pastry lid. ", "Crimp the edges together with a fork, or your fingers, then trim away the excess pastry neatly. Brush with beaten egg and make a couple of holes in the top to let the steam out. Bake for 30–35 minutes until golden brown. Leave to rest for 15–20 minutes before slicing."]}, {"isVegetarian": false, "title": "Corned beef hash", "url": "www_bbc_co_uk_food_recipes_cornedbeefhash_87542", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["275g/10oz potatoes, cut into cubes but not peeled", "3 tbsp oil", "1 onion, sliced", "1 garlic clove, crushed", "225g/8oz canned corned beef, cut into cubes", "3 tbsp Worcestershire sauce", "1 large pickled gherkin, chopped", "1 tsp wholegrain mustard", "salt and freshly ground black pepper ", "50g/2oz butter", "4 poached eggs", "brown sauce and tomato ketchup"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Boil the potatoes in a pan of salted water for five minutes, then drain.", "Heat two tablespoons of the oil in a pan and fry the onion and garlic for 6-8 minutes, or until softened and lightly browned.", "Tip the onion mixture into a bowl with the corned beef, Worcestershire sauce, chopped gherkin and mustard. Season with salt and freshly ground black pepper and mix well.", "Transfer this mixture to an ovenproof dish.", "Heat the remaining tablespoon of oil with the butter in a frying pan and fry the potatoes until tender and golden-brown.", "Preheat the grill to high. ", "Spoon the potatoes on top of the meat mixture in the dish, then place under the grill for 4-6 minutes, or until crisp and golden-brown.", "To serve, divide the corned beef hash among four serving plates. Top each portion with a poached egg and serve with brown sauce and tomato ketchup."]}, {"isVegetarian": false, "title": "Corned beef fritters with onion marmalade", "url": "www_bbc_co_uk_food_recipes_cornedbeeffritterswi_86924", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for deep-frying", "125g/4oz plain flour", "½ tsp turmeric", "1 tsp salt", "1 free-range egg", "1 free-range egg yolk", "285ml/10fl oz whole milk", "1 tbsp olive oil", "1 free-range egg white, whisked until soft peaks form when the whisk is removed", "400g/14oz corned beef from a can, cut into 2.5cm/1in thick pieces", "50ml/2fl oz olive oil", "2 large onions, chopped", "2 red bird's-eye chillies, finely chopped", "4 cloves", "1 garlic clove, crushed", "1 orange, juice and zest only", "150ml/5fl oz sherry vinegar", "150g/5oz soft light brown sugar", "salt and freshly ground black pepper", "4 poached free-range eggs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Sift the flour, turmeric and salt into a bowl.", "Make a well in the centre of the flour mixture. Add the whole egg and the egg yolk and whisk together from the centre outwards to create a paste.", "Add the milk and olive oil and fold into the flour and egg paste mixture to create a smooth batter.", "Fold the egg white into the batter.", "Dip the corned beef slices into the batter mixture and carefully add to the hot oil. Fry for six minutes, or until crisp and golden-brown, then carefully remove with a slotted spoon and drain on kitchen paper.", "For the onion marmalade, heat the olive oil in a pan over a medium heat.", "Add the onions, chillies, cloves and garlic and fry gently for 15-20 minutes, until the onions have softened and caramelised to a deep brown colour. ", "Add the orange juice and zest, sherry vinegar and sugar and bring to the boil.", "Cook the mixture for 10-12 minutes, or until the mixture is the consistency of jam. Season, to taste, with salt and freshly ground black pepper.", "To serve, divide the fritters evenly among four plates and top with a poached egg. Place a spoonful of marmalade alongside."]}, {"isVegetarian": false, "title": "Corned beef hash with poached eggs", "url": "www_bbc_co_uk_food_recipes_cornedbeefhashwithfr_78048", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornedbeefhashwithfr_78048_16x9.jpg", "ingredients": ["4 potatoes, diced into cubes", "3 tbsp olive oil", "1 onion, finely diced", "1 garlic clove, crushed", "340g/12oz corned beef, tinned", "Salt and freshly ground black pepper, to taste", "1 tbsp vinegar", "1-2 free-range eggs (per person)", "Tomato ketchup, to serve", "300g/10½oz plain flour", "315g/11oz cornmeal", "200g/7oz icing sugar", "1 tbsp baking powder", "1 free-range egg", "250ml/9fl oz milk", "200g/7oz butter, melted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the corned beef hash, place the potatoes into a saucepan and cover with water. Bring to the boil and simmer until just tender. Drain and set aside.", "Heat a frying pan until hot. Add one tablespoon of the olive oil, the onion and garlic and fry for two to three minutes.", "Add the potatoes and fry for a further minute.", "Crumble in the corned beef and mix together.", "Spoon the mixture into a soup dish then place under the grill for three to four minutes, until crusty.", "Bring a pan of water to the boil, add the vinegar and whirl the water around.", "Crack an egg into a ladle. Pour the egg into the pan and simmer for two minutes, until ready. Remove from the pan and drain.", "Remove the hash from the grill and top with the egg.", "Top with a squeeze of ketchup and serve with hot, buttered corn bread.", "For the cornbread, mix together the flour, cornmeal, icing sugar and baking powder.", "Make a well in the centre of the dry ingredients and add the milk and egg. Mix together from the centre outwards, incorporating the dry ingredients into the wet gradually to create a dough-like paste. Add the melted butter last.", "Place in a hot baking tin. Place in a hot oven for about 15 minutes until golden brown.", "Remove from the oven, allow to cool slightly. Turn out, cut into slices and serve with the corned beef hash."]}, {"isVegetarian": false, "title": "Corned beef pasties", "url": "www_bbc_co_uk_food_recipes_cornedbeefpasties_13552", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900g/2lb shortcrust pastry", "450g/1lb onions, peeled and sliced", "450g/1lb corned beef, cubed", "2 tbsp tomato ketchup", "2 tbsp vegetable oil", "salt and pepper", "beaten egg for glazing"], "serves": "Makes 6 pasties", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oven to 200C/400F/Gas 6. ", "Roll out the pastry and cut out circles 20cm/8in in diameter. ", "Heat the oil and cook the onions in it until starting to soften. ", "Take off the heat and cool. Stir in the corned beef and tomato ketchup and season well. ", "Divide the mixture between the 6 circles and crimp the edges together. Brush with a little of the beaten egg. ", "Put on a baking sheet and bake in the oven for 20-30 minutes until the pastry is golden. Serve hot or cold."]}, {"isVegetarian": false, "title": "Corned beef hotpot with runner beans", "url": "www_bbc_co_uk_food_recipes_cornedbeefhotpotwith_90598", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "1.5kg/3lb 3oz corned beef, thickly sliced", "salt and freshly ground black pepper", "1-2 onions, finely sliced", "8 sprigs fresh thyme, leaves picked", "1kg/2lb 2oz waxy potatoes, such as Cara and Charlotte, peeled and thinly sliced", "175ml/6fl oz chicken stock", "300g/11oz runner beans, trimmed and cut into 6cm/2.5in diagonal pieces", "50g/2oz butter", "2 shallots, finely sliced", "salt and freshly ground black pepper", "5 tbsp chopped fresh flatleaf parsley", "50g/2oz butter", "1.5kg/3lb 3oz corned beef, thickly sliced", "salt and freshly ground black pepper", "1-2 onions, finely sliced", "8 sprigs fresh thyme, leaves picked", "1kg/2lb 2oz waxy potatoes, such as Cara and Charlotte, peeled and thinly sliced", "175ml/6fl oz chicken stock", "300g/11oz runner beans, trimmed and cut into 6cm/2.5in diagonal pieces", "50g/2oz butter", "2 shallots, finely sliced", "salt and freshly ground black pepper", "5 tbsp chopped fresh flatleaf parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/390F/Gas 6.", "For the hotpot, grease the insides of a medium ovenproof dish with a little of the butter, then place a layer of corned beef into the bottom. Seasoning with salt and freshly ground black pepper between each layer, top with a layer of onions, sprinkle over the thyme and cover with a layer of potatoes. Repeat the layers, finishing with the potatoes on top. ", "Pour the stock over the top, then dot with the remaining butter. Cover the dish with aluminium foil and place into the oven to bake for one hour, or until the potatoes are just tender. Remove the foil and return to the oven to cook for 15 minutes, or until golden-brown on top.", "For the beans, bring a pan of salted water to the boil, add the beans and cook for 2-3 minutes, or until tender. ", "Melt the butter in a frying pan, then add the shallots and fry for 1-2 minutes, or until softened. Add the cooked beans and fry for a further minute, then season with salt and freshly ground black pepper. Add the parsley and toss well to coat. ", "To serve, spoon the corned beef hotpot onto a serving plate and arrange the beans alongside."]}, {"isVegetarian": false, "title": "Corned beef potato cakes with red onion chutney", "url": "www_bbc_co_uk_food_recipes_cornedbeefpotatocake_72292", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["a little olive oil", "50g/1¾oz diced leeks", "1 clove garlic, chopped ", "400g/14oz potatoes, mashed ", "1 egg yolk", "150g/5¼oz grated corned beef", "a little plain flour", "salt and freshly ground black pepper", "olive oil", "100g/3½oz red onion, diced", "1 dried red chilli", "50g/1¾oz tomato, diced and de-seeded", "50g/1¾oz brown sugar", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat some of the olive oil in a frying pan and brown off the leeks and garlic.  ", "Remove from the heat and add the mashed potato along with the egg yolk and corned beef.  Mix well.  ", "Coat your hands in a little flour so the potato doesn't stick, and form the mixture into four equal patties, approximately 5cm/2in in diameter.  Add salt and pepper and shallow fry the patties in a little more olive oil until golden brown on both sides.", "To make the chutney, heat a saucepan with a drizzle of olive oil, the red onion and the chilli.  Cook until browned.  ", "Add the tomato, brown sugar and seasoning, and allow to caramelise for five minutes.  ", "Serve either hot or cold with the potato cakes and some ripped salad leaves."]}, {"isVegetarian": false, "title": "Cornish chilli crab", "url": "www_bbc_co_uk_food_recipes_cornish_chilli_crab_27091", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 garlic cloves, diced", "2 long red chillies, diced", "2½cm/1in piece fresh root ginger, peeled and diced", "4 tbsp sunflower oil", "4 crabs (about 1.5kg/3lb 5oz each)", "4 tbsp tomato ketchup", "1 tsp Marmite, or similar yeast extract", "4 tbsp dark soy sauce", "4 spring onions, julienned", "2 tbsp chopped coriander"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a saucepan of water on the hob and place a steamer on top.", "Place the garlic, chilli, ginger and sunflower oil in a small bowl and mix.", "Chop up the crab, remove the brown meat and discard the dead man’s fingers (gills). Place the meat in the steamer for 4-5 minutes.", "Meanwhile, add two tablespoons of the flavoured oil to a wok set over a high heat. Fry without colouring, then add the tomato ketchup, yeast extract and soy sauce. When it starts to caramelise, add the crab and toss until coated. ", "Add 150ml/5fl oz water, cover with a lid and cook for a further three minutes.", "Remove from the heat, add the spring onion and coriander and serve immediately."]}, {"isVegetarian": false, "title": "Cornish fish stew with garlic toast and aïoli", "url": "www_bbc_co_uk_food_recipes_cornish_fish_stew_with_36730", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "400g/14oz inexpensive fish steaks or trimmings, such as gurnard, hake, pollock, sardines or red mullet", "100g/3½oz small uncooked prawns, shells left on", "1 large fennel bulb, trimmed and chopped", "2 banana shallots, chopped", "1 carrot, peeled and chopped", "1 celery stalk, trimmed and chopped", "1 tbsp tomato purée", "250g/9oz plum tomatoes, chopped", "1 star anise ", "pinch saffron strands", "½ tsp cayenne pepper", "300ml/10½fl oz dry white wine", "2 tbsp pastis", "600ml/20fl oz fish stock", "600ml/20fl oz chicken stock", "400g/14oz sea bass fillets, cut into 4 pieces", "400g/14oz cod fillet, cut into 4 pieces", "300g/10½oz halibut fillet, cut into 4 pieces", "12 cockles, cleaned (discard any cockles that do not shut tightly when tapped firmly on the side of the sink)", "8 cooked tiger or king prawns, shells left on", "1 lemon, juice only", "3 garlic cloves, peeled and left whole", "200g/7oz butter, softened ", "1 baguette, diagonally sliced into 8-12 slices", "2 garlic cloves, crushed", "2 free-range egg yolks", "small pinch saffron strands", "75ml/2½fl oz olive oil", "75ml/2½fl oz vegetable oil", "1 tsp white wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the fish stew, heat 2 tablespoons of the oil in a wide, heavy-based saucepan over a medium heat. Add the fish trimmings (or steaks) and the small prawns and season, to taste, with salt and freshly ground black pepper. Fry for 8-10 minutes, or until golden-brown all over, then remove from the pan and set aside on a plate.", "Add 2 more tablespoons of oil to the same saucepan and increase the heat to high. Fry the fennel, shallots, carrot and celery for 8-10 minutes, stirring occasionally, until they begin to brown.", "Stir in the tomato purée and continue to cook for 1-2 minutes. Add the chopped tomatoes, star anise, saffron and cayenne pepper and cook for a further 3-4 minutes. ", "Pour in the white wine and pastis and bring to the boil, scraping up any burned bits from the bottom of the pan with a wooden spoon to deglaze. Continue to boil until the liquid has reduced to a thick syrup. ", "Add the stocks and return the mixture to the boil. Continue to boil until the volume of liquid has reduced by one-third, about 10-15 minutes.", "Remove the pan from the heat and set aside to cool slightly. Ladle the liquid into a food processor and blend to a smooth purée in batches, taking care to cover and hold down the lid of the food processor with a tea towel to avoid scalding yourself. ", "Strain the mixture through a fine sieve into a clean pan, then reheat over a medium heat.", "Season the pieces of sea bass, cod and halibut on both sides with salt and freshly ground black pepper. ", "Heat the remaining oil in a large frying pan over a medium heat. Add the fish pieces, in batches if necessary, and fry for 1-2 minutes on each side, or until golden-brown on both sides. Add them to the strained stew.", "Add the cockles to the strained stew and cook until the shells open (discard any cockles whose shells do not open during cooking). Add the cooked prawns and stir until heated through. Squeeze over a little lemon juice, then season, to taste, with salt and freshly ground black pepper. Stir in the reserved fried fish trimmings (or steaks) and the cooked small prawns.", "For the garlic toast, preheat the grill to its highest setting. ", "Blanch the garlic cloves in a pan of boiling water for 20 seconds. Drain well, then crush the cloves to a fine paste. ", "In a bowl, mix the crushed garlic with the softened butter. Spread the garlic butter onto the baguette slices.", "Arrange the baguette slices on a baking tray and grill for 1-2 minutes, or until lightly toasted.", "For the aïoli, blend the garlic, egg yolks and saffron strands to a paste in a food processor. Pour both oils into a jug,  mix the together and, with the motor running, gradually add them to the aïoli in a thin stream until all of the oil has been incorporated and it has thickened to the consistency of mayonnaise. Add the vinegar a few drops at a time, to taste. Season, to taste, with salt and freshly ground black pepper.", "To serve, ladle the fish stew into serving bowls. Dollop a teaspoonful of the aïoli on top of each garlic toast and float 2 or 3 toasts on top of each portion. Serve the remaining aïoli in dipping bowls alongside."]}, {"isVegetarian": false, "title": "Cornish ling, grapefruit and prawn dressing, spiced quinoa and lemon yoghurt", "url": "www_bbc_co_uk_food_recipes_cornish_ling_with_a_60914", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz quinoa", "3 tbsp olive oil", "1 tsp salt", "½ tsp dill seeds", "½ tsp fennel seed", "¼ tsp cumin seed", "¼ tsp ground cinnamon", "1 tsp flat leaf parsley, finely chopped ", "1 tsp dill, finely chopped", "1 tsp chives, finely chopped ", "salt and freshly ground black pepper", "150g/5½oz winter salad leaves", "1 tbsp balsamic vinegar", "4 x 125g/4½oz Cornish ling pieces, skinned", "salt, to taste", "2 tbsp olive oil", "lemon juice, to taste", "115g/4oz Greek-style yoghurt", "50ml/2fl oz grapefruit juice", "50ml/2fl oz olive oil", "pinch salt", "50g/2oz peeled cooked prawns", "1 tbsp flatleaf parsley", "10g/½oz capers"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the quinoa, place all but about a teaspoon of the quinoa into a saucepan with 200ml/7fl oz water, one tablespoon of the olive oil and the salt and bring to the boil. Reduce the heat and simmer for 10 minutes then cover with cling film and allow to steam in a warm place until the quinoa has cooled. Place the cooled quinoa in a large mixing bowl.", "Heat a frying pan until medium hot, add one tablespoon of the oil, the reserved quinoa, dill seed, fennel seed, cumin seed and ground cinnamon and toast for one minute.", "Pour the mixture onto the cooked quinoa then stir in the herbs. Mix well and season to taste with salt and freshly ground black pepper. ", "Toss the winter leaves with a little of the quinoa, the balsamic vinegar and the last of the olive oil.", "For the ling, preheat the oven to 180C/350F/Gas 4. Season the ling well with salt.", "Heat a non-stick frying pan until hot, add the olive oil. Add the ling and cook on each side until lightly golden-brown. ", "Remove the ling from the pan, and place onto a baking tray.  Bake in the oven for 3-4 minutes.", "Remove the baking tray from the oven and season the ling with a little salt and lemon juice. ", "Place the yoghurt into a bowl and season, to taste, with lemon juice and salt. Mix well.", "For the grapefruit and prawn dressing, place the grapefruit juice, olive oil, 25ml/1fl oz water and salt into a jug and stir until the salt dissolves. Pour the dressing into a small saucepan and heat through, then add the prawns, parsley and capers.", "To serve, spoon lemon yoghurt around 4 plates, and place a pile of quinoa in the centre of each plate. Top with a piece of ling, and spoon the grapefruit and prawn dressing over the top. Serve the salad leaves alongside. "]}, {"isVegetarian": false, "title": "Cornish shoulder of lamb, chilli salsa bruschetta and lemon verbena yoghurt", "url": "www_bbc_co_uk_food_recipes_cornish_shoulder_of_lamb_77252", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz white wine vinegar", "150ml/5fl oz caster sugar", "50ml/2fl oz olive oil", "1 tsp salt", "1.5kg/3lb 5oz lamb shoulder", "3 lemons, halved", "3 garlic cloves ", "6 thyme sprigs", "6 rosemary sprigs", "2 bay leaves ", "100g/3½oz butter ", "1 tbsp olive oil", "400ml/14fl oz white wine ", "sea salt ", "3 large slices good-quality sourdough", "1 red onion thinly sliced", "1 red chilli, thinly sliced on an angle", "1 green chilli, thinly sliced on an angle", "4 spring onions, thinly sliced on an angle", "12 cherry tomatoes, halved", "1 garlic clove ", "1 tbsp finely chopped coriander", "handful sliced basil leaves", "1 lime, juice and zest", "1 lemon, juice only", "olive oil", "salt and freshly ground black pepper", "300g/10½oz good-quality Greek-style yoghurt ", "fresh verbena (freshly chopped to taste)", "freshly chopped mint (freshly chopped to taste)", "1 lime, juice and zest "], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["To make the cold pickle, place all the ingredients in saucepan with 600ml/1 pint water and warm to a tepid temperature to dissolve the sugar. Transfer to a bowl and allow to cool.", "Add the red onion, cover with cling film and leave in the fridge overnight.", "Preheat the oven to 170C/150C Fan/Gas 3½.", "Warm the olive oil in a lidded casserole dish over a medium heat. Add the butter and allow to foam. Season the lamb liberally all over and add to the pan, sealing each side until it’s caramelised all over. ", "Remove the lamb and set aside. Add the garlic cloves and half lemons to the casserole dish and allow to caramelise. Add the herbs and cook for a further 2 minutes.  Drain off the butter and add the white wine. Bring to the boil and reduce to a simmer. ", "Return the shoulder of lamb to the casserole dish. Season with salt, put the lid on and place in the oven for 4 hours, basting regularly, adding a little water if needed so the pan never dries out. ", "Remove the red onions from the cold pickle and place in bowl. Add the chillies, spring onions, chopped coriander and sliced basil and stir together to make a salsa.", "When the lamb’s cooking time is up, increase the oven temperature to 200C/180C Fan/Gas 6 to crisp up the skin. Allow the lamb to cool and pull apart with two forks. ", "Preheat the grill to the highest setting. ", "Drizzle the olive oil over the sourdough slices and chargrill to nice and golden brown, take off and rub with a fresh garlic clove", "Add the tomatoes to the salsa and stir well. Add a squeeze of lime and lemon juice and season. ", "In a bowl, mix together the yoghurt, chopped mint, verbena, lime zest and juice to your taste. ", "Spread the salsa over the toast and top with the lamb.   "]}, {"isVegetarian": false, "title": "Steak pasty", "url": "www_bbc_co_uk_food_recipes_cornishpasty_89627", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornishpasty_89627_16x9.jpg", "ingredients": ["225g/½lb plain flour, plus extra for dusting", "1 tsp baking powder", "½ tsp salt", "60g/2½oz unsalted butter", "1 free-range egg, yolk only", "60ml/2½fl oz water", "1 free-range egg, beaten, for glazing", "50g/2oz swede, finely chopped", "150g/5½oz potato, peeled and cut into cubes", "50g/2oz onion, finely chopped ", "100g/3½oz rib-eye steak, cut into small pieces", "1 tbsp chopped fresh parsley", "salt and freshly ground black pepper"], "serves": "Makes 1 large pasty", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. ", "Gradually add the water, a tablespoon at a time, mixing continuously until the mixture just comes together as a dough. (You may not need to use all the water.) Roll the dough into a ball, then wrap it in cling film and chill in the fridge for an hour. ", "Meanwhile, for the filling, bring a pan of salted, boiling water to the boil. Add the chopped swede and potato and cook for 4-5 minutes, until tender, then drain well, refresh in cold water and set aside.", "Preheat the oven to 180C/350F/Gas 4.", "Roll the chilled pastry out onto a clean, floured work surface. Cut a large disc from the pastry using a dinner plate as a template. Place the onions in a line down the middle of the pastry disc. Spoon the chopped steak on top, then spoon the cooked potato and swede over it. Sprinkle with the chopped parsley and season, to taste, with salt and freshly ground black pepper.", "Brush the edge of the pastry disc with some of the beaten egg. Draw the edges of the pastry together and crimp them with your fingers to seal so that the seal sits on top of the filling. Using a knife, make a small hole in the top of the pasty and brush all over with the remaining beaten egg.", "Place the pasty onto a baking tray and bake in the oven for 25-30 minutes, or until golden-brown."]}, {"isVegetarian": true, "title": "Cornmeal flatbreads", "url": "www_bbc_co_uk_food_recipes_cornmealflatbreads_86122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["525g/1lb 5oz medium cornmeal, maize flour or polenta", "25g/1oz white mooli radish (available from some greengrocers), grated", "2 spring onions, trimmed and finely chopped", "1 tbsp chopped fresh coriander leaves ", "salt, to taste", "lukewarm water", "1 tbsp sunflower oil, for greasing", "unsalted butter, to serve"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place all but 25g/1oz of the cornmeal, the mooli, spring onions, coriander and salt into a large bowl and stir to combine. Gradually add the water, a little at a time, until the mixture comes together to make a soft, smooth dough - the quantity of water will depend on the texture of the cornmeal. Knead lightly, then set aside.", "Cover a work surface with cling film and sift the remaining 25g/1oz cornmeal evenly over it.", "Grease your palms with oil, then divide the dough into 12 lemon-sized balls and flatten them with your hands.", "Roll out a piece of flattened dough into a 0.5cm/¼in thick round on the prepared work surface. Repeat the process with the remaining dough.", "Heat a griddle or frying pan and cook each piece of dough as you go along. Fry on both sides until slightly puffed up and speckled with brown spots.", "Serve immediately, spread with butter, or wrap in aluminium foil for later use."]}, {"isVegetarian": true, "title": "Corn on the cob with lime and cayenne butter", "url": "www_bbc_co_uk_food_recipes_cornonthecobwithlime_84071", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ corn on the cob", "85g/3oz butter", "½ tsp cayenne pepper", "½ lime, zest only", "1 tbsp coriander, finely chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the corn on the cob into a saucepan of boiling water and boil for 8-10 minutes or until the sweetcorn is cooked and tender. Remove the corn on the cob from pan and keep warm.", "In another saucepan, heat the butter, cayenne pepper, lemon zest and coriander until melted together.", "To serve, immediately pour the sauce over the hot corn on the cob."]}, {"isVegetarian": true, "title": "Corn pudding", "url": "www_bbc_co_uk_food_recipes_cornpudding_70982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15g/½oz unsalted butter", "½ onion, finely chopped", "1 clove garlic, finely chopped", "1 tsp thyme leaves", "½ green pepper, finely chopped", "2 green chillies, finely diced", "corn kernels from 3 cobs", "2 tbsp plain flour", "150ml/¼ pint milk", "3 eggs", "300ml/¾ pint double cream", "1 tsp salt", "¼ tsp freshly ground black pepper", "¼ tsp freshly grated nutmeg", "pinch of cayenne pepper", "2 tablespoons chopped flat-leaf parsley", "1 tablespoon snipped chives", "55g/2oz parmesan, freshly grated", "55g/2oz Gruyere cheese, grated"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Heat the butter in a frying pan, add the onion, garlic thyme, green pepper and chilli, and cook over a medium heat for eight minutes. ", "Add half the corn and cook for ten minutes. Set aside.", "Place the remaining corn in a food processor with the flour, milk and eggs, and blend until smooth. Set aside.", "To the corn in the frying pan add the cream, salt, pepper, nutmeg and cayenne. Fold in the corn puree, the herbs and both cheeses.", "Pour the mixture into a greases 1.7 litre/3 pint soufflé dish, place in a hot Bain Marie and bake until the mixture is firm, about one hour. ", "Let the pudding stand for ten minutes before serving."]}, {"isVegetarian": true, "title": "Corn skewers with chilli herb drizzle", "url": "www_bbc_co_uk_food_recipes_cornskewerswithchill_88428", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 corn-on-the-cob", "1 tbsp water", "1 tbsp olive oil", "salt and freshly ground black pepper ", "3 tbsp olive oil", "1 tbsp white wine vinegar", "2 tbsp chopped fresh coriander", "¼ fresh red chilli, chopped", "1 lime, juice only", "1 lime, cut into wedges, for garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the corn skewers, place the corn-on-the-cob into a small bowl, sprinkle with water and microwave on high for six minutes. Cut into 2cm/1in pieces using a large, sharp knife.", "Thread the corn pieces onto skewers, drizzle with olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot and griddle the corn skewers until golden-brown on all sides.", "For the chilli herb drizzle, mix all the ingredients together in a small bowl.", "To serve, place the corn skewers onto a serving plate and pour over the chilli herb drizzle. Garnish with lime wedges."]}, {"isVegetarian": false, "title": "Coronation chicken", "url": "www_bbc_co_uk_food_recipes_coronation_chicken_30402", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronation_chicken_30402_16x9.jpg", "ingredients": ["2 free range chicken breasts, skin removed", "1 tbsp olive oil", "1 lemon, juice and zest", "sea salt and freshly ground black pepper", "knob of butter", "1 shallot, finely chopped", "1 red chilli, deseeded and finely chopped", "2 teaspoons madras curry powder", "2 tbsp tomato purée", "100ml/3½fl oz dry white wine", "100ml/3½fl oz chicken stock", "1 tbsp apricot jam", "150ml/5fl oz mayonnaise", "75ml/3fl oz crème fraîche", "1 large mango, peeled, stone removed, flesh diced", "4 spring onions, finely chopped", "2 tbsp chopped fresh coriander", "dash Tabasco sauce", "50g/2oz flaked almonds (toasted lightly dry frying pan)", "green salad leaves, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Rub the olive oil all over the chicken. Scatter over the lemon zest and season with the salt and black pepper. ", "Steam the chicken for 20-25 minutes, or until cooked through, then set aside to cool.", "Melt the butter in a  frying pan, add the shallot and chilli and fry for five minutes. Stir in the curry powder and cook for 2-3 minutes. Stir in the tomato purée and cook for a further minute. Add the wine and continue to cook until the volume of the liquid has reduced by half. ", "Stir in the jam and stock, continue to simmer until the volume of the liquid has reduced by half. Set aside to cool.", "Mix the mayonnaise and the crème fraiche in a bowl until well combined, then stir in the curry dressing. Fold in the mango, spring onions, lemon juice and coriander. ", "Cut the chicken into bite-sized pieces. Fold this into the mayonnaise mixture. Season with salt, freshly ground black pepper and Tabasco to taste. Serve with a green salad, and dress with the toasted almond flakes."]}, {"isVegetarian": false, "title": "Coronation prawn vol-au-vents", "url": "www_bbc_co_uk_food_recipes_coronationprawnvolau_93068", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronationprawnvolau_93068_16x9.jpg", "ingredients": ["350g/12oz puff pastry", "1 free-range egg, beaten, plus 1 free-range egg yolk", "15g/½oz butter", "50g/1¾oz plain flour", "200ml/7fl oz hot fish stock", "1 tbsp curry paste, mixed with 1 tbsp water to form a smooth paste", "salt and freshly ground black pepper", "75ml/2¾fl oz double cream", "18 king prawns, cooked, peeled", "1 tbsp flaked almonds", "3 spring onions, chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Roll the pastry out on a floured surface to 5mm/¼in thick. Cut out 12 circles using a 9cm/3½in plain cutter. Cut a smaller circle out of the centre of six of the circles.", "Place the six full circles onto a baking sheet and brush with a little beaten egg. Place the six circles with a hole cut out on top of each of the full circles and transfer to the oven for 10-15 minutes, or until risen and golden-brown.", "Meanwhile, melt the butter in a frying pan, stir in the flour and cook until the mixture forms a smooth paste. ", "Remove from the heat and gradually whisk in the hot fish stock and curry paste. Return to the heat, season, to taste, with salt and freshly ground black pepper and bring to the boil. Reduce the heat until the mixture is simmering and simmer, stirring constantly, for 10-12 minutes, or until thickened.", "Beat the egg yolk and cream together in a bowl, then whisk into the sauce.", "Stir the prawns, nuts and spring onions into the sauce and spoon into the cooked pastry shells.", "Return to the oven and bake for 10-12 minutes. Serve immediately."]}, {"isVegetarian": false, "title": "Coronation chicken", "url": "www_bbc_co_uk_food_recipes_coronationchicken_72328", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coronationchicken_72328_16x9.jpg", "ingredients": ["1.5kg/4lb free-range chicken", "4 spring onions, sliced", "6 garlic cloves, peeled, left whole", "1 tbsp sea salt", "10 whole black peppercorns", "1 tbsp vegetable oil", "1 onion, chopped", "1 tbsp curry powder", "1 tbsp tomato purée", "85ml/3fl oz red wine", "150ml/¼pint water", "1 bay leaf", "salt and freshly ground black pepper", "caster sugar", "2 slices lemon", "squeeze of lemon juice", "425ml/15fl oz good-quality  mayonnaise ", "2 tbsp apricot purée (made by blending 4-5 stoned, dried apricots with 3 tbsp water)", "3 tbsp whipped cream", "1 tbsp roughly chopped coriander", "rice, cooked according to packet instructions"], "serves": "Serves 4-8", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Place the chicken into a saucepan with a tight-fitting lid, cover with water and add the spring onions, garlic, salt and peppercorns. ", "Bring to the boil and simmer for 30 minutes, turning the chicken once during the cooking process. Cover with a lid and switch off the heat. Leave for one hour, then remove the chicken, allow to cool completely, and tear the chicken from the bones into rough pieces.", "Meanwhile, for the sauce, heat the oil in a pan over a medium heat. Add the onion and cook gently for 3-4 minutes.  Add the curry powder and cook for a further two minutes, stirring well. Add the tomato purée, wine, water and bay leaf.   ", "Bring the mixture to the boil. Season with salt and freshly ground black pepper, then add the sugar, lemon slices and lemon juice, to taste. Reduce the heat until the mixture is simmering and simmer, uncovered, for 5-10 minutes.  Strain the sauce through a fine meshed sieve and set aside to cool.", "Gradually fold in the mayonnaise and apricot purée, to taste. Add more lemon juice, as necessary.", "Fold in the whipped cream.", "To serve, arrange the portioned chicken on a large platter, pour the sauce over the top, sprinkle with the coriander and serve immediately, with rice."]}, {"isVegetarian": true, "title": "Cosmopolitan", "url": "www_bbc_co_uk_food_recipes_cosmopolitan_88567", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cosmopolitan_88567_16x9.jpg", "ingredients": ["35ml/1½fl oz vodka", "15ml/½fl oz orange liqueur", "squeeze fresh lime juice", "25ml/1fl oz cranberry juice", "twist orange peel, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the vodka, orange liqueur, lime juice and cranberry juice into a cocktail shaker and fill with ice. Shake hard and then strain into a coupe glass or small Martini glass.", "Hold the piece of orange peel over the glass and carefully flame with a match. Garnish the cocktail with the flamed orange peel and serve."]}, {"isVegetarian": true, "title": "Cotswold pudding", "url": "www_bbc_co_uk_food_recipes_cotswold_pudding_25532", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["180ml/6fl oz milk", "180g/6oz plain flour", "2 free-range eggs", "3 tbsp beef dripping (but any oil will do if you want it to be vegetarian)", "4 large banana shallots, sliced in half lengthways", "4 carrots, roughly chopped", "6 garlic cloves, peeled but left whole", "6 sprigs thyme, leaves only", "salt and freshly ground black pepper"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the batter, whisk together the milk, flour, eggs and 120ml/4½fl oz water in a bowl. Cover and refrigerate for at least 20 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Heat the beef dripping in a large pan over a moderate heat.", "Sit the shallots in the pan cut-side down, and cook until softened.", "Add the carrots and garlic and cook until they have browned and caramelised - about five minutes.", "Transfer the pan ingredients to an oven dish, add the thyme, season with salt and freshly ground black pepper and place in the oven to get piping hot for five minutes.", "Once the dripping is sizzling hot, open the oven door and tip the batter over the vegetables as quickly as possible, so not to lose too much heat.", "Bake for 20-30 minutes, or until the pudding is well risen and golden-brown                             .", "Serve quickly as otherwise the pudding will deflate."]}, {"isVegetarian": false, "title": "Cottage pie to feed a crowd", "url": "www_bbc_co_uk_food_recipes_cottage_pie_46881", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/5fl oz sunflower oil", "10 large onions, peeled, chopped", "1kg/2lb 4oz carrots, peeled, finely chopped", "5kg/11lb lean beef mince", "300g/10½oz plain flour  ", "4.5 litres/8 pints beef stock", "2.8 litres/5 pints cold water", "300g/10½oz tomato purée", "4 dried bay leaves", "4 tbsp Worcestershire sauce", "8 tbsp finely chopped parsley", "salt and freshly ground black pepper", "8kg/18lb floury potatoes, peeled and cut into even-sized pieces", "400g/14oz butter, cubed", "450ml/16fl oz milk"], "serves": "Serves 40", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the sunflower oil in a large deep pan over a medium heat and gently fry the onion and carrots for 7-8 minutes, or until the onions are softened and lightly coloured. ", "Add the beef mince to the pan and cook with the vegetables for 4-5 minutes, stirring frequently, until the meat is browned all over.", "Sprinkle over the flour and stir well for a few minutes to prevent any lumps from forming.", "Gradually add the beef stock to the pan, then add the cold water, tomato purée and bay leaves. Bring the mixture to a gentle simmer, then cover with the lid and cook over a low heat for 25-30 minutes, stirring occasionally, until the mince is tender and the sauce has thickened. ", "Season with Worcestershire sauce, salt and freshly ground black pepper and stir in the parsley. Remove from the heat, spoon into several ovenproof dishes and set aside.", "Half-fill a very large pan, or two smaller pans, with cold water. Add the potatoes and bring to the boil, then reduce the heat to a simmer and cook for about 15 minutes, or until the potatoes are very soft.", "Drain the potatoes, then return to the pan set over a medium heat. Cook for a few seconds to steam off any excess moisture, then remove the potatoes from the heat. Add the butter and milk and mash until smooth and creamy. Season with a little salt.", "Spoon the mash over the mince mixture, working towards the middle from the outside. Smooth with a palette knife then create patterns on the surface using a fork.", "Place the dishes on baking trays and bake in the centre of the oven for around 25 minutes, or until the potatoes are golden-brown and the filling is bubbling up around the edges. "]}, {"isVegetarian": false, "title": "Cottage pie", "url": "www_bbc_co_uk_food_recipes_cottage_pie_67314", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 onion, diced", "2 carrots, diced", "1 garlic clove, crushed", "250g/9oz beef mince ", "1 x 410g/14½oz tin baked beans", "1 x 400g/14oz tin tomatoes ", "400ml/14fl oz stock, made from stock cube (ideally beef but chicken or vegetable is fine)", "900g/2lb potatoes, chopped into equal size pieces ", "100ml/3½fl oz milk", "50g/1¾oz butter", "salt and black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat a large saucepan over a medium heat and add the oil. Once hot, fry the onions and carrots gently with a pinch of salt for 6-7 minutes, or until the onions are translucent but not browned. Add the garlic and cook for another two minutes.", "Add the mince and stir to mix. Cook for 5-6 minutes or until all the raw meat has turned brown. Add the baked beans, tomatoes and stock.  Simmer the mixture for 30-40 minutes without a lid to allow the mix to reduce and thicken a little. ", "Once cooked, pour into a medium sized baking dish about 21x27cm/8x11in. Taste and add salt and pepper as necessary.  Leave to cool and then chill in the fridge for 20 minutes - this will prevent the mashed potato sinking into it too much.", "Meanwhile boil the potatoes in a saucepan of salted boiling water for 15 minutes until tender. Remove and drain, leaving to steam dry in the colander for 3-4 minutes. ", "Heat the milk and butter together in the pan you used to cook the potatoes, until the butter is melted. Once the potatoes are dried a little, place back into the saucepan and mash with a potato masher until smooth, mixing well with the butter and milk. Taste and add salt and pepper to taste.", "Layer the mashed potato on top of the meat base in the baking dish and bake in the preheated oven to 25-30 minutes, or until bubbling and the potato top is golden-brown."]}, {"isVegetarian": false, "title": "Cottage pie with dauphinoise potato", "url": "www_bbc_co_uk_food_recipes_cottage_pie_with_31714", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cottage_pie_with_31714_16x9.jpg", "ingredients": ["1 tbsp oil", "900g/2lb beef mince", "2 onions, chopped", "4 sticks celery, diced", "50g/1¾oz plain flour", "250ml/9fl oz red wine", "300ml/½ pint beef stock", "2 tbsp Worcestershire sauce", "2 tbsp light muscovado sugar", "1 tbsp chopped thyme", "250g/9oz small brown chestnut mushrooms, sliced ", "dash of gravy browning (optional)", "salt and pepper", "1.5kg/3lb 5oz King Edward potatoes, peeled and sliced into 4mm slices ", "150ml/5fl oz double cream", "100g/3½oz strong cheddar, grated "], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a hot frying pan and add the beef. Stir over a high heat until golden-brown. Using a slotted spoon, remove the mince from the pan and set aside. Add the onions and celery to the pan and fry until beginning to soften.  Return the beef to the pan.", "Whisk the flour and wine together in a bowl to make a smooth paste, whisk in the stock and then add it to the pan with the Worcestershire sauce, sugar and thyme. Bring to the boil, stirring until thickened, then add the mushrooms and gravy browning if liked. Season with salt and pepper. Cover with a lid and simmer for 45 minutes, or until the mince is tender.  Check the seasoning and add salt and pepper if necessary.", "Cook the potato slices in boiling salted water for about 4-5 minutes - the potatoes need to be soft. Drain carefully into a colander and leave to cool a little. If the potatoes are too hard they will be waxy and the cream will run off them.", "Tip the cooked meat into a 2.4 litre/4 pint ovenproof shallow dish. Preheat the oven to 220C/425F/Gas 7 (200C fan).", "Arrange a layer of the blanched potato on top of the mince and pour over half of the cream.  Arrange the remaining potato on top, seasoning between the layers. Pour over the remaining cream and sprinkle over the cheese.", "Bake in the preheated oven for about 30 minutes, or until golden-brown and bubbling."]}, {"isVegetarian": false, "title": "Cottage pie with cheesy mash", "url": "www_bbc_co_uk_food_recipes_cottagepiewithcheesy_93216", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cottagepiewithcheesy_93216_16x9.jpg", "ingredients": ["1 tbsp sunflower oil", "1 large onion, peeled, chopped", "2 celery sticks, finely chopped", "2 carrots, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "500g/17½oz lean beef mince", "150ml/5fl oz red wine", "2 tbsp plain flour", "500ml/17½fl oz beef stock", "300ml/10½fl oz cold water", "2 tbsp tomato purée", "½ tsp mixed dried herbs ", "1 dried bay leaf", "splash Worcestershire sauce", "salt and freshly ground black pepper", "800g/1lb 12oz floury potatoes, such as King Edward or Maris Piper, peeled and cut into even-sized pieces", "40g/1½oz butter, cubed", "3 tbsp milk", "100g/3½oz mature cheddar, grated", "salt and freshly ground black pepper", "green beans or shredded Savoy cabbage, cooked"], "serves": "4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the sunflower oil in a large deep lidded pan over a medium heat and gently fry the onion, celery and carrots for 7-8 minutes, or until the onions are softened and lightly coloured. Add the garlic and cook for 2-3 more minutes.", "Add the beef mince to the pan and cook with the vegetables for 4-5 minutes, stirring frequently, until the meat is browned all over. ", "Pour the wine into the pan, bring the mixture to the boil and cook for 4-5 minutes, or until most of the liquid has evaporated, then sprinkle over the flour and stir well for a few minutes to prevent any lumps from forming. ", "Gradually add the beef stock to the pan, then add the cold water, tomato purée and dried herbs. Bring the mixture to a gentle simmer, then cover with the lid and cook over a low heat for 25-30 minutes, stirring occasionally, until the mince is tender and the sauce has thickened. Season with a splash of Worcestershire sauce and salt and freshly ground black pepper. Remove from the heat, spoon into a 1.5 litre/2 pints 13fl oz ovenproof dish and set aside.", "Preheat the oven to 200C/400F/Gas 6. ", "Half-fill a large pan with cold water. Add the potatoes and bring to the boil, then reduce the heat to a simmer and cook for about 15 minutes, or until the potatoes are very soft. ", "Drain the potatoes, then return to the pan set over a medium heat. Cook for a few seconds to drive off any excess moisture, then remove the potatoes from the heat. Add the butter, milk and cheese and mash until smooth and creamy. Season with salt and freshly ground black pepper. ", "Spoon the mash over the mince mixture in the ovenproof dish, working towards the middle from the outside. Smooth with a palette knife. When all the mince is covered with mash, create patterns on the surface using a fork. ", "Place the dish on a baking tray and bake in the centre of the oven for around 25 minutes, or until the potatoes are golden-brown and the filling is bubbling up around the edges. Serve with freshly cooked green beans or shredded Savoy cabbage."]}, {"isVegetarian": false, "title": "Cottage pie with leeks", "url": "www_bbc_co_uk_food_recipes_cottagepiewithleeks_85908", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil ", "1 large onion, chopped ", "1 medium carrot, chopped ", "560g/1¼lb minced beef", "1 x 400g/14oz can tomatoes ", "2 tbsp tomato purée ", "290ml/10fl oz beef stock ", "1 bay leaf ", "1 sprig fresh thyme, leaves only", "salt and freshly ground black pepper", "1 tbsp tomato ketchup", "1 tbsp Worcestershire sauce", "knob butter", "2 leeks, chopped", "4 large King Edward potatoes", "splash cream (to taste)", "large knob butter (to taste)", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large lidded pan. Add the onion and carrot and fry over a medium heat for five minutes until soft. ", "Add the minced beef to the pan and fry for a few minutes to brown the mince all over. ", "Add the tomatoes, tomato purée, beef stock, bay leaf and thyme to the pan. ", "Simmer for 30 minutes. Season with salt and freshly ground black pepper.", "In the meantime, for the mash topping, chop the potatoes into quarters and boil in a pan of boiling salted water for about 10-15 minutes, until tender.", "When the potatoes are cooked, drain the water and mash the potatoes well.", "Add cream, butter and salt and freshly ground black pepper to taste. Set aside. Preheat the oven to 190C/375F/Gas 5. ", "After 30 minutes cooking time, taste the meat, and add ketchup and Worcestershire sauce if desired. If the mixture is too wet, cook for a few more minutes to reduce the liquid.", "In a separate pan, heat a little butter. Add the leeks and fry until softened, but not coloured.", "Transfer the meat into an ovenproof dish and layer the leeks on top.", "Arrange spoonfuls of the mash on top of the meat and leeks and use a wet spatula to smooth out the edges. Cook for about 30 minutes, until the potato is crisp and golden-brown around the edges. Serve hot."]}, {"isVegetarian": false, "title": "Cottage pie with peas", "url": "www_bbc_co_uk_food_recipes_cottagepiewithpeas_93324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.5kg/3lb 4oz baking potatoes", "75g/3oz butter", "150ml/5fl oz milk", "Salt and freshly ground black pepper", "400ml/14fl oz beef stock", "200ml/7fl oz red wine", "75ml/3fl oz balsamic vinegar", "1 tbsp olive oil", "1 onion, peeled, finely chopped", "2 carrots, peeled, finely chopped", "750g/1lb 11oz beef mince", "1 tbsp plain flour", "1 bay leaf", "Salt and freshly ground black pepper", "150g/5oz boiled peas, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5.", "For the mashed potato topping, prick the potatoes all over with a fork and bake in the middle of the oven for 1-1½ hours, or until tender.", "Meanwhile, for the filling, heat the beef stock, red wine, and balsamic vinegar in a saucepan until boiling. Reduce the heat until the mixture is simmering and simmer for 10-12 minutes, or until the volume of the liquid has reduced by half.", "Heat the olive oil in a large non-reactive frying pan and fry the onions and carrots for 1-2 minutes, or until softened. Add the beef mince and continue to cook for 4-5 minutes, or until browned all over. Stir in the plain flour and cook for 1-2 minutes, then stir in the reduced stock mixture and add the bay leaf.", "Simmer the mixture for 45-60 minutes, or until the mince is tender and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper.", "When the potatoes are cooked, slice them in half, scoop out the flesh and pass through a potato ricer into a saucepan.", "Place the saucepan on the heat, add the butter and milk and stir well with a wooden spoon until the mash is smooth and creamy. Season, to taste, with salt and freshly ground black pepper.", "To assemble the cottage pie, spoon the cooked mince into a baking dish and pipe the mashed potato on top. ", "Bake in the oven for 20-25 minutes, or until golden-brown and bubbling.", "To serve, spoon some cottage pie onto each of 4 serving plates. Spoon the peas alongside."]}, {"isVegetarian": false, "title": "Country captain shepherd's pie", "url": "www_bbc_co_uk_food_recipes_country_captain_95324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tsp cumin", "1 tbsp coriander seeds", "50g/2oz fresh root ginger", "50g/2oz garlic", "2-3 tbsp sunflower oil", "1.25kg/2lb 12oz cleaned lamb shoulder or leg (kept whole)", "2 x 2.5cm/1in pieces cinnamon (or casia bark)", "3-4 green cardamom", "2-3 cloves", "3-4 black peppercorns", "2-3 large dried red chilli", "3 medium onions, chopped", "250g/9oz chopped tomatoes", "1 tsp salt, plus extra for seasoning", "freshly ground black pepper", "1 heaped tbsp fresh coriander", "3-4 large baking potatoes, peeled and roughly chopped             ", "1 tbsp butter", "½ tsp cumin seeds", "2-3 garlic cloves, finely chopped", "1 dried red chilli, shredded", "250g/9oz fresh spinach leaves, coarsely shredded", "2 medium eggs", "75ml/3floz double cream"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the shepherd's pie filling, preheat the oven to 140C/275F/Gas 1.", "Place the cumin and coriander seeds into a dry frying pan on a low heat and toast them until they change colour slightly, then remove from the pan.", "Grind the spices, ginger and garlic together in a spice grinder to a fine paste, adding only as much water as is necessary to make it into a paste.", "Heat a large oven-proof casserole dish until medium hot, add the oil and continue to heat until a haze forms.", "Add the lamb and brown well on all sides until the meat is well sealed.", "Remove the lamb from the pan and set aside, then add the cinnamon, cardamom, cloves, peppercorns and the red chillies broken into pieces, to the pan. ", "Fry the spices for 1-2 minutes until the cloves swell a little. Add a little water to the pan to deglaze it, scraping up any meat residue and dissolving it in the water.", "Add the chopped onions and cook until the liquid evaporates, then gently fry the onions until soft, about 4-5 minutes.", "Add the spice paste and cook for 5-6 minutes mixing well then return the lamb to the pan.", "Coat the lamb with the mixture then season lightly with salt and freshly ground black pepper, and cover the pan.", "Place the pan into the oven and cook for 2- 2 ½ hours, stirring the casserole occasionally and making sure the onions do not catch on the bottom of the pan.", "Add the chopped tomatoes and mix well (add a little more water if it looks dry) then cover and return to the oven for another 15 minutes.", "Check that the lamb is cooked - the meat will have retracted from the bone and the meat will feel soft to the touch.", "Lift the lamb out of the casserole and place onto a tray to cool slightly.", "Carefully remove all the whole spices from the gravy in the casserole and discard.", "When the lamb is cool enough to handle, shred the meat off of the bone and place back into the casserole with the gravy.", "Place back onto a medium low heat and cook until the gravy has thickened nicely.", "Add the freshly chopped coriander, check the seasoning, and spoon into an oven-proof dish, big enough that the filling reaches 2cm/1in from the top of the dish.", "For the topping, place the potatoes into a saucepan and cover with water, bring to the boil and simmer until tender.", "Drain, return the potatoes to the pan and back on the heat to drive off any extra moisture.", "Pass the cooked potatoes through a ricer (or mash them to a smooth puree) and set aside. ", "Place the butter onto the board with the cumin seeds, then finely chop the two together.", "Heat a frying pan and add the cumin butter and gently fry until the cumin colours gently, but don’t heat it too much or the butter will burn.", "As soon as the cumin changes colour, lift out the seeds and add to the potatoes, transferring as little butter as is possible.", "Add the chopped garlic and chilli to the butter in the frying pan and gently fry for one minute.", "When the garlic is light golden-brown, add the spinach leaves, toss for a minute or so until soft, season lightly then remove from pan and place straight onto the dish of shredded lamb, spreading evenly over the top.", "Mix the cumin seeds into the potato with the eggs and cream and mix well until smooth then check the seasoning.", "Spread the potato over the spinach evenly, ruffle the surface a little, it doesn’t have to be smooth, just evenly spread. ", "Place back in the oven for 10 minutes then increase the oven temperature to 180C/350F/Gas 4 and cook for another 15 minutes until golden brown. ", "To serve, spoon a dollop of pie onto a serving plates, and serve with some crusty bread or steamed rice."]}, {"isVegetarian": false, "title": "Country captain chicken curry", "url": "www_bbc_co_uk_food_recipes_countrycaptainchicke_84737", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 large roasting chicken, cut into 8 pieces", "120g/4oz butter", "3 large onions, thinly sliced", "2 garlic cloves, finely chopped", "1 tbsp grated fresh ginger root", "2 cloves", "2 bay leaves", "2.5cm/1in cassia stick", "1 tsp turmeric", "2 tsp freshly ground black pepper", "¾ tbsp finely chopped fresh green/red chilli", "200ml/7fl oz chicken stock", "½ lemon, juice only", "salt and freshly ground black pepper", "fresh coriander leaves, to garnish", "200g/7oz rice, cooked according to packet instructions", "red onion, sliced into rings", "bacon, cut into thin strips and fried until crisp", "fresh coconut, grated", "peanuts", "1 free-range egg, hard-boiled and chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large frying pan until hot then add half of the butter and all of the chicken pieces. Fry the chicken, stirring frequently, until golden-brown on all sides, then remove from the pan and set aside.", "Melt the remaining butter in another large frying pan over a medium heat. Add the onion and fry for 3-4 minutes, until softened and golden-brown.", "Add the ginger and garlic and fry for one minute. ", "Add the cloves, bay leaves, cassia stick, turmeric, black pepper and chillies and fry for 1-2 minutes to release the flavours.", "Add the chicken pieces and half of the stock. Reduce the heat and simmer for about 20 minutes until the chicken is tender and completely cooked through. (If necessary, add more stock during cooking to prevent the chicken from sticking to the pan.)", "Add the lemon juice, season, to taste, with salt and freshly ground black pepper and garnish with chopped coriander leaves.", "To serve, place a spoonful of cooked rice onto each of four plates and spoon the curry alongside. Sprinkle with red onion rings, crispy bacon, coconut, peanuts and hard-boiled egg."]}, {"isVegetarian": false, "title": "Country ham omelette with red onion and plum relish", "url": "www_bbc_co_uk_food_recipes_countryhamomelettewi_87772", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red onion, chopped", "3 plums, stones removed, roughly chopped", "2 tbsp brown sugar", "1 tbsp clear honey", "2 tbsp red wine vinegar", "1 lime, juice only", "15g/½oz butter", "3 large free-range egg, beaten", "2 slices ham, chopped", "salt and freshly ground black pepper", "2 tbsp chopped fresh parsley"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the red onion and plum relish, heat the oil in a frying pan. Add the red onion and plums and fry over a high heat. Add the remaining relish ingredients to the pan and simmer for five minutes until softened. ", "Spoon the relish into a small serving bowl and leave to cool while you prepare the omelette.", "For the omelette, melt the butter in a small frying pan. ", "Mix the beaten egg with the chopped ham in a small bowl and season well with salt and freshly ground black pepper.", "Add the egg mixture to the pan and mix with a wooden spoon until it starts to set around the edge of the pan. Leave to cook over a low heat until it has completely set. Carefully flip the omelette out onto a plate and slice into wedges. ", "Serve the omelette with the relish on the side, garnished with chopped parsley."]}, {"isVegetarian": true, "title": "Country vegetable soup with basil pistou", "url": "www_bbc_co_uk_food_recipes_countryvegetablesoup_90195", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/countryvegetablesoup_90195_16x9.jpg", "ingredients": ["2 stalks celery", "2 carrots", "4 tbsp/2½fl oz good-quality olive oil", "1 large onion", "2 small potatoes (such as Maris Piper)", "4 garlic cloves", "1 ready-made bouquet garni (such as thyme, parsley, rosemary and sage)", "2 litres/3 pints 10fl oz water", "salt and freshly ground black pepper", "200g/7oz canned haricot beans, rinsed and drained", "large bunch fresh basil leaves", "100g/3½oz parmesan", "100ml/3½fl oz good-quality olive oil, plus extra for drizzling", "salt and freshly ground black pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Chop the celery and carrots into small dice.", "While you're chopping the vegetables, heat the olive oil in a heavy-bottomed pan. Add the chopped celery and carrots to the pan.", "Peel the onion and chop into pieces the same size as the chopped celery and carrots. Add to the pan.", "Chop the potatoes into pieces the same size as the other vegetables and add to the pan.", "Lightly crush the garlic cloves with the heel of your hand and add the unpeeled cloves to the pan. Gently sweat the vegetables in the olive oil for a few minutes, just to colour them slightly. Add the bouquet garni.", "Pour in the water and season with salt and freshly ground black pepper. Cover and bring the soup to the simmer and cook for about 10-15 minutes, until the vegetables are just tender.", "Make the pistou. Place the basil leaves in a clean bowl. Roughly chop the parmesan and add to the bowl. Pour in the olive oil and season with salt and freshly ground black pepper.", "Blend to a smooth sauce with a hand-held blender (alternatively you could make the sauce in a mini-food processor). The sauce should be bright green and have a fairly smooth consistency (you may need to add more oil).", "Add the beans to the soup. Remove the bouquet garni.", "Cook until the vegetables are tender and the beans are heated through.", "To serve, ladle the soup into bowls and swirl a spoonful or two of the pistou into each. Drizzle over some olive oil and serve with some good bread."]}]