[{"ingredients": ["1kg / 2lb 3 oz de rape", "1½ cucharada de jengibre molido", "2 cucharaditas de pimienta negra recién molida", "2 cucharaditas de canela en polvo", "3 cucharaditas de cúrcuma molida", "1½ cucharada de pimentón", "1 cucharadita de pimienta de cayena", "1 cabeza de ajo, todos menos 3 dientes aplastados con un poco de sal", "450 g / 1 libra de cebollas, ralladas", "2 cucharadas de aceite de oliva", "175 g / 6¼ oz de albaricoques secos, remojados en un poco de agua (reservar el agua), cortados por la mitad", "Almendras en copos de 85g / 3oz", "55g / 2oz sultanas o pasas", "2 cucharadas de miel clara", "1 cucharadita de estafados de azafrán, empapados en agua fría", "400g / 14oz de tomates enlatados, toscamente picados", "600ml / 1 pinta de jugo de tomate", "600 ml / 1 pinta de caldo de pescado", "1 limón en escabeche, solo corteza, picado", "Hojas de cilantro de 25 g / 1 oz, picadas"], "method": ["Cubra el pescado con la mitad de las especias molidas y déjelo marinar en la nevera durante la noche.", "Precalentar el horno a 170 ° C / 340 ° F / Gas 3. Caliente una cucharada de aceite de oliva en una cazuela y agregue las especias restantes, el ajo picado y la cebolla rallada. Permita que la cebolla se ablande sin dorar.", "Agregue los albaricoques y su agua de remojo, las almendras, pasas sultanas o pasas, miel, azafrán, tomates, jugo de tomate y caldo de pescado. Llevar a ebullición, colocar en el horno y cocinar durante una hora.", "Después de 40 minutos, agregue el pescado y devuelva la cazuela al horno para terminar de cocinar. Si desea una salsa más espesa, quite las piezas de pescado, coloque un plato caliente y reduzca la salsa a fuego alto hasta que espese.", "Freír la cáscara de limón conservada en el aceite de oliva restante durante unos minutos, luego doblar en el cilantro picado.", "Vierta la salsa sobre el pescado y decore con la mezcla de limón y cilantro."], "url": "www_bbc_co_uk_food_recipes_fishtagine_72361", "title": "Tagine de pescado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3.5-4kg / 8-9lb pedazo de panceta de cerdo, con hueso, piel en", "2 cucharadas de sal", "8 dientes de ajo, aplastados", "4 cucharadas de pimentón ahumado", "4 cucharadas de aceite vegetal", "2 limones, cortados a la mitad y cortados en rodajas gruesas", "4 papas grandes, peladas y cortadas a la mitad", "4 cucharaditas de aceite vegetal", "6 pastinacas peladas, recortadas y divididas en el medio", "500 g / 1 lb 2 pastillas de chirivía, peladas y cortadas en trozos de 5 cm / 2 in", "100 g / 3½oz de patatas, cortadas en cubitos", "1 diente de ajo, pelado y dejado entero", "200ml / 7fl de leche en oz", "50ml / 2fl oz de aceite de oliva", "½ limón, solo jugo", "Crema doble 50ml / 2fl oz", "10g / ¼ oz de mantequilla", "sal y pimienta", "2 manojos grandes de perejil de flatleaf, hojas recogidas", "1 gran puñado de hojas de albahaca", "2 dientes de ajo, pelados", "1 huevo hervido", "1 puñado de pan blanco fresco", "1 cucharada de vinagre de vino blanco", "1 cucharada de alcaparras", "50ml / 2fl oz de aceite de oliva", "pizca de sal"], "method": ["Para la carne de cerdo, usando un cuchillo muy afilado (o un cuchillo), marque la piel del cerdo muy profundamente en un patrón entrecruzado con un espacio de 1 cm / ½ pulgada entre cada corte. Hervir el hervidor, poner el cerdo en un fregadero limpio, con la piel hacia arriba, y verter el agua hirviendo sobre la piel del cerdo - esto lo escalda y se asegurará de que la piel esté crujiente una vez que se haya tostado.", "En un tazón grande, mezcle la sal, el ajo, el pimentón, el aceite vegetal y las piezas de limón. Ahora, frote la mezcla en la piel de cerdo y la carne, dejando las piezas de limón encima de la piel. Coloque el cerdo en una bandeja y déjelo marinar en la nevera durante 12-24 horas.", "Precaliente el horno a 160 ° C / 140 ° Ventilador / Gas 3. Coloque las papas en una lata grande para asar (las papas actuarán como trébedes). Coloque el cerdo con la piel hacia arriba sobre las papas y vierta sobre el adobo que quede en la bandeja. Vierta una taza de agua en el fondo de la bandeja debajo del cerdo. Cubra el cerdo con papel de hornear, luego con papel de aluminio y coloque la lámina alrededor de la parte exterior de la lata para sellar. Asar por 4 horas.", "Saque la carne de cerdo del horno y aumente la temperatura del horno a 200 ° C / 180 ° Ventilador / Gas 6. Retire con cuidado la lámina: la lata humeante. Vuelva a poner el cerdo en el horno y tápelo durante una hora más.", "Para las chirivías asadas, caliente el aceite en una bandeja para asar hasta que esté caliente. Coloque las chirivías en un recipiente y vierta sobre agua hirviendo para escaldarlas. Escurra las chirivías y seque, coloque el aceite caliente y revuelva cuidadosamente para que estén todas cubiertas. Asar por 45 minutos. Sazonar con un poco de sal antes de servir.", "Saque la carne de cerdo del horno y déjela reposar en un lugar tibio para que descanse durante 30 minutos. Mientras el cerdo está en reposo, prepare el puré y la salsa verde.", "Para el puré de chirivía, ponga las chirivías, las papas, los dientes de ajo en una olla y la mitad cubra con agua. Agregue la leche y el aceite de oliva y sazone con sal y pimienta. Cubra con una tapa y cocine hasta que esté completamente cocido, revolviendo constantemente.", "Drene bien, transfiera a una olla limpia y manténgalo caliente, reservando el líquido de cocción. Caliente la crema y la mantequilla. Coloque las verduras cocidas en un procesador de alimentos con un poco del licor de cocción y mezcle hasta que quede suave, agregue la crema y la mantequilla y mezcle más. Si la mezcla es demasiado espesa, agregue un poco más del líquido de cocción.", "Para la salsa verde, ponga el perejil, la albahaca y el ajo en un procesador de alimentos y pulse hasta que quede grueso. Agregue los ingredientes restantes y pulse durante 30 segundos o hasta que la mezcla tenga una textura más o menos picada, no debe ser una pasta.", "Cuando la carne de cerdo haya descansado, levántela de la lata y colóquela boca abajo sobre una tabla para cortar. Marca la parte inferior del cerdo para que puedas ver los extremos de los huesos. Explórelos usando su pulgar, luego saque los huesos tirando de los extremos que sobresalen - deben separarse fácilmente de la carne. Corte la carne de cerdo por la mitad a lo largo, luego corte cada mitad en 5 o 6 rebanadas. Dale la vuelta a cada uno, debería ser una deliciosa rebanada de deliciosa tostada. Toda la tabla va a la mesa. Cuencos de puré, cuencos de salsa verde - ¡adelante! Sirva con las papas fritas que se cocinaron debajo de la carne de cerdo y las chirivías asadas."], "url": "www_bbc_co_uk_food_recipes_five-hour_roast_pork_03985", "title": "Vientre de cerdo asado de cinco horas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve de 10 a 12 personas muy hambrientas, con sobras", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 estrella de anís", "1 cucharadita de semillas de hinojo", "Pocos granos de pimienta de Sichuan", "1 cucharada de polvo de cinco especias", "sal", "1kg / 2lb 4 oz de costillas de cerdo", "½ manojo de cebollas de primavera, cortadas, picadas", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "algunos puentes miel", "1-2 dientes de ajo, pelados, finamente picados", "150ml / 5fl oz de salsa de soja", "1 lima, ralladura solamente", "3 cucharadas de semillas de sésamo (opcional)", "1-2 chiles rojos, sin semillas, finamente rebanados"], "method": ["Precaliente el horno a 200 ° C / 400 ° F / Gas 6. Cubra una bandeja de horno grande o una lata para asar con papel de aluminio.", "Para el masaje, triture el anís estrellado, las semillas de hinojo y los granos de pimienta de Sichuan en un mortero. A continuación, agregue el polvo de cinco especias y un poco de sal y mezcle para combinar.", "Coloque las costillas en un recipiente, espolvoree la mezcla de frotar y frote todo dentro. Incline las costillas en la bandeja de hornear y extiéndalas en una sola capa.", "Cocine en el horno por 45 minutos.", "Mientras tanto, mezcle todos los ingredientes para el glaseado de miel en una sartén pequeña. Caliente a fuego lento hasta que la miel se derrita y todos los ingredientes estén bien combinados.", "Retire las costillas del horno, cepille generosamente con el glaseado de miel, espolvoree las cebolletas y sazone bien con sal y pimienta negra recién molida. (Coloque el resto del glaseado de miel a un lado para más adelante).", "Regrese las costillas al horno y cocine por otros 15 minutos.", "Una vez que las costillas estén cocidas, retírelas del horno y colóquelas en un plato grande. Vuelva a calentar el glaseado de miel restante y sirva como una salsa de inmersión con las costillas y una ensalada verde grande."], "url": "www_bbc_co_uk_food_recipes_five-spice_baked_ribs_40323", "title": "Cinco costillas al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1kg / 2lb 4oz vientre de cerdo, piel en", "1½ cucharadita de sal", "1 cucharadita de cinco especias chinas", "2 cucharadas de jengibre picado", "5 dientes de ajo, picados", "3 cebolletas, picadas", "splash salsa de soja (si es necesario)", "4 cucharadas de caldo de pollo", "4 cucharadas de salsa de soja", "4 cucharaditas de azúcar de palma", "4 cucharaditas de salsa de ciruela", "4 cucharaditas de vinagre balsámico", "1 cabeza grande Lechuga Little Gem, rebanada", "½ mango, picado", "4 cucharadas de jengibre encurtido", "2 cucharadas de cacahuetes salados", "1-2 chiles rojos, finamente rebanados (al gusto)", "2 cebollas tiernas, finamente cortadas", "1 cucharadita de semillas de sésamo tostadas", "2 cucharadas de cebolla roja finamente picada", "4 cucharadas de hoja de cilantro picado", "gran puñado de fideos de vidrio cocidos"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el cerdo, puntee la piel con un cuchillo filoso en ½ cm / ¼ en líneas. Sazone generosamente en ambos lados con sal, frotando bien la sal en la piel marcada.", "Voltea el vientre con la piel hacia abajo y condimenta el lado de la carne con una cucharadita de cinco especias chinas.", "Coloque el jengibre, el ajo y la cebolleta en una cazuela o lata de horno y coloque la barriga de cerdo en la parte superior.", "Hornee por una hora, luego baje la temperatura a 170C / 325F / Gas 4 y cocine por otra hora.", "Si la barriga de cerdo se engancha en la sartén, agregue una cucharada de agua y una cucharada de salsa de soja.", "Para el aderezo, mezcle todos los ingredientes del aderezo.", "Para la ensalada, combine todos los ingredientes de la ensalada en un tazón y mezcle para combinar.", "Para servir, coloca la ensalada en cuatro platos. Corta el cerdo y sirve encima de la ensalada. Rocíe un poco de aderezo (1-2 cucharadas soperas por porción) para terminar."], "url": "www_bbc_co_uk_food_recipes_five-spice_belly_pork_65372", "title": "Carne de cerdo de cinco especias con mango, jengibre encurtido y ensalada de fideos de vidrio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de girasol", "2 cebollas rojas grandes, en rodajas finas", "50g / 1¾oz de jengibre fresco de raíz, pelado, finamente rallado", "4 dientes de ajo, aplastados", "1 cucharadita de hojuelas de chile seco", "Filete de estofado de 500 g / 1 lb 2 oz, cortado, cortado en cubos de 5 cm / 2 in", "2 cucharaditas de polvo chino de cinco especias", "350ml / 12fl oz de caldo de carne caliente (hecho con 1 cubo de reserva)", "4 cucharadas de salsa de soja oscura", "4 cucharaditas de harina de maíz", "2 cucharadas de miel clara", "pimienta negra recién molida"], "method": ["Caliente el aceite en una sartén grande de base pesada a fuego medio. Agregue las cebollas y freír durante 8-10 minutos, revolviendo regularmente, hasta que estén suaves y ligeramente doradas. Agregue el jengibre, el ajo y las hojuelas de chile, revuelva bien y cocine por 2-3 minutos, asegurándose de que el ajo no se queme.", "Sazone la carne con pimienta, espolvoree sobre el polvo de cinco especias y mezcle para cubrir uniformemente. Agregue a la sartén y fría por 3-4 minutos, volteando la carne regularmente hasta que se dore ligeramente por todas partes.", "Transfiera a la olla de cocción lenta. Vierta sobre el caldo y agregue la salsa de soja. Cubra y cocine a fuego alto durante 4 horas, hasta que la carne esté tierna y tierna.", "Cuando la carne esté cocida, bata la harina de maíz con 1 cucharada de agua hasta obtener una pasta homogénea, agregue la miel. Agregue a la olla de cocción lenta, cubra y cocine durante 12-15 minutos, o hasta que la salsa esté brillante y se haya espesado ligeramente.", "Sirva la carne con arroz al vapor o fideos hervidos y verduras salteadas."], "url": "www_bbc_co_uk_food_recipes_five-spice_braised_beef_86835", "title": "Carne estofada de cinco especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/five-spice_braised_beef_86835_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cabezas de ajo, clavos pelados", "100 g / 3½ oz de jengibre, pelado", "3 cucharaditas de aceite de colza", "3 cucharaditas de mezcla de cinco especias (phoran panch: semilla de alholva, semilla de nigella, semilla de comino, semilla de mostaza negra y semilla de hinojo)", "1 cucharadita de cúrcuma molida", "2 cucharaditas de pasta de chile rojo de Cachemira", "1 cucharadita de puré de tomate", "sal al gusto", "500g / 1lb 2oz de pollo sin hueso, cortado en pedazos", "arroz hervido o chapati, para servir"], "method": ["Haga una pasta del ajo y el jengibre en una licuadora de alimentos.", "Caliente el aceite en una sartén antiadherente y agregue la mezcla de especias.", "Agregue el jengibre y la pasta de ajo a la sartén. Cocine a fuego alto durante 5-6 minutos o hasta que se vuelva marrón claro. Agregue la cúrcuma molida, la pasta de ají roja de Kashmiri, el puré de tomate y la sal, al gusto.", "Agregue el pollo deshuesado y mezcle bien. Cocine durante 10-15 minutos a fuego medio, o hasta que el pollo esté bien cocido, revolviendo ocasionalmente.", "Sirva con arroz hervido o chapati."], "url": "www_bbc_co_uk_food_recipes_five-spice_chicken_with_00850", "title": "Pollo de cinco especias con jengibre y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 3-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Patatas cerosas de 1kg / 2lb 4oz como Vivaldi, piel dejada, cortada en cubos de 2.5cm / 1in", "pizca de sal", "1-2 cucharadas de aceite de maní", "1-2 cucharadas de jengibre rallado recién rallado", "1 cucharadita de frijoles negros salados fermentados (disponibles en los supermercados chinos), enjuagados, triturados", "¼ cucharadita de copos de chile tostado en seco", "Lardones de tocino ahumado ahumado 120 g / 4½ oz", "1 cucharada de salsa de soja oscura", "2-3 cucharadas de aceite de colza o grasa de ganso (opcional)", "300 g / 10½ oz de arándanos frescos", "100g / 3½oz de azúcar morena suave", "2-3 cucharadas de agua", "1 limón, solo jugo", "1 naranja pequeña, solo jugo", "Anís de 2 estrellas", "1 cucharadita de copos de chile tostado en seco", "2 cucharaditas de polvo chino de cinco especias", "1 cucharadita de hojuelas de chile seco", "8 pizca de sal", "½ cucharadita de pimienta blanca molida", "4 codornices (aproximadamente 560 g / 1 libra 4 onzas en total), limpiadas (solicite al carnicero que haga esto por usted)", "Jengibre fresco de la raíz de los 2.5cm / 1in, pelado, cortado en 8 rebanadas", "1 naranja pequeña, pelar solo, quitar la cáscara de una vez, luego cortar en 8 longitudes de igual tamaño", "4 cebolletas, cortadas, cortadas en 8 rebanadas", "2 cucharadas de aceite de colza", "4 chalotes bebé, pelados, en rodajas", "1 cucharada de vino de arroz Shaoxing", "sal y pimienta negra recién molida", "700 ml / 1¼ pintas de caldo de pollo", "4-5 cucharadas de harina natural", "1 cucharada de salsa de soja oscura", "Zanahorias de 300 g / 10½ oz heredadas del bebé (menos de 10 cm de largo), sin la parte superior", "1 cucharada de aceite de colza", "320g / 11¼ oz cavolo nero, lavado, rebanado", "2 copos generosos copos de sal marina"], "method": ["Para las papas, coloca los cubos de papa y la sal en una olla con tapa de agua fría. Llevar a ebullición, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Cubra la olla con una tapa y cocine a fuego lento durante 15-20 minutos, o hasta que esté tierna. Escurrir bien y dejar reposar.", "Para la salsa de arándanos, caliente todos los ingredientes de la salsa de arándanos en una olla con tapa a fuego medio durante 10-15 minutos, revolviendo bien hasta que los arándanos se hayan suavizado. Cubra la olla con la tapa y manténgala caliente a fuego muy lento.", "Para la frotación de especias, mezcle todos los ingredientes de la mezcla de especias hasta que estén bien combinados.", "Para la codorniz especiada, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Lave las codornices con un grifo que funcione en frío, luego seque con papel de cocina.", "Sazone la cavidad de cada codorniz con sal y pimienta negra recién molida, luego rellene cada uno con dos pedazos de jengibre, dos pedazos de cáscara de naranja y dos trozos de cebolla tierna. Coser las cavidades con un pequeño alfiler de metal o un pequeño pincho de bambú. Esto ayudará a mantener a las codornices húmedas e impartir sabor a la carne.", "Cepille las codornices con el aceite de colza, y luego revuelva en el condimento hasta que esté completamente cubierto. Ate las patas traseras de cada codorniz usando una cuerda de carnicero.", "Cubra la base de una bandeja de asar con los chalotes de bebé en rodajas y las rodajas restantes de cebolla de primavera. Coloque las codornices en la parte superior de la capa de verduras y rocíe el vino de arroz para sazonar. Asar en el horno durante 20-25 minutos, o hasta que la piel esté crujiente y dorada, y la carne esté bien cocida. (Las codornices se cuecen si los jugos se hacen transparentes cuando se inserta un pincho en la parte más gruesa del muslo y no queda rastro de rosa). Revise las codornices después de 15 minutos para asegurarse de que las patas no se estén dorando demasiado rápido; cubra las piernas con papel de aluminio si es así.", "Mientras tanto, continúa con las papas. Caliente el aceite de maní en un wok a fuego alto. Agregue el jengibre, los frijoles negros, las hojuelas de chile seco y el tocino y saltee por 30 segundos o hasta que se dore. Agregue los cubos de papa escurridos y continúe revolviendo por 2-3 minutos. Agregue la salsa de soja y mezcle de nuevo.", "Transfiera la mezcla de papa a una bandeja para hornear, rocíe sobre un chorrito de aceite de colza (o la grasa de ganso), luego tueste en el horno durante 20-25 minutos, o hasta que las papas estén crujientes y doradas.", "Cuando las codornices estén cocidas, transfiéralos a una tabla de madera, quítale los cordones de los carniceros y cualquier papel de aluminio, y déjelos a un lado para que descanse durante 5 minutos. Reserve los jugos en la bandeja de asar.", "Para la salsa, coloque la bandeja de tostado con los jugos de codorniz reservados a fuego medio en la estufa. Agregue el caldo de pollo y deje que hierva, raspando las partes quemadas del fondo de la bandeja con una cuchara de madera. Batir la harina hasta que la mezcla esté suave, luego continuar a hervir hasta que se espese a la salsa. Agregue la salsa de soya, luego mantenga caliente a fuego lento.", "Para las zanahorias, pula las zanahorias en una cacerola con agua hirviendo durante 2-3 minutos, luego escurra bien y déjelas a un lado.", "Para el cavolo nero, caliente el aceite de colza en un wok a fuego alto. Agregue el cavolo nero y saltee por 1 minuto.", "Agregue un poco de agua fría al wok, luego continúe revolviendo hasta que el agua se haya evaporado y el cavolo nero se haya marchitado.", "Agregue las zanahorias, sazone con los copos de sal marina, y saltee durante 1-2 minutos más. Sáquelo del fuego y apártelo.", "Para servir, coloque el cavolo nero y las zanahorias en un lado de cada uno de los cuatro platos y papas en el otro lado. Coloque una codorniz encima de cada porción y coloque una cucharada de la salsa de arándanos en el costado de cada plato. Sirva la salsa en una jarra al costado."], "url": "www_bbc_co_uk_food_recipes_five-spice_oven-roasted_18972", "title": "Codorniz tostada de cinco especias con salsa de arándano agridulce", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 x 2kg / 4lb 8oz pato, hueso de la espalda eliminado, aplanado", "sal y pimienta negra recién molida", "4 cucharadas de polvo chino de cinco especias", "1 cucharada de aceite de oliva", "3 cebollas de primavera, en rodajas", "1 ramita de canela", "½ cucharadita de granos de pimienta de Sichuan, aplastados", "Ciruelas de 500 g / 1 lb 2 oz, sin piedras, picadas", "125ml / 4fl oz de vinagre de vino de arroz", "75 g / 2½ oz de azúcar en polvo", "sal y pimienta negra recién molida", "225g / 8oz de harina blanca fuerte", "175ml / 6fl oz de agua hirviendo", "4 cebolletas, finamente trituradas", "1 pepino, cortado en bastones"], "method": ["Para el pato de cinco especias, precalentar el horno a 210C / 410F / Gas 6.", "Coloque el pato, con la piel hacia arriba, sobre una rejilla sobre una bandeja de asar y perforar la piel con un cuchillo.", "Hervir un hervidor de agua y verter el agua recién hervida sobre la piel del pato. Desechar el agua y acariciar el pato seco con papel de cocina. Frote la sal, pimienta negra recién molida y cinco especias en toda la piel.", "Asar durante 1-1 ¼ horas, o hasta que estén crujientes y doradas. Retire del horno y deje reposar por 10 minutos. Triture el pato en pedazos finos usando dos tenedores.", "Mientras tanto, para la salsa de ciruela, caliente el aceite de oliva en una sartén con tapa y fría las cebollas durante 1-2 minutos, o hasta que se ablanden. Agregue las especias y continúe cocinando por otros 1-2 minutos.", "Agregue las ciruelas, el vinagre y el azúcar y ponga la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, cubra con una tapa y cocine a fuego lento durante 5-6 minutos, o hasta que las ciruelas estén tiernas. Dejar de lado para enfriar.", "Retire la ramita de canela y mezcle la mezcla con un puré en un procesador de alimentos. Cuele el puré a través de un colador en un recipiente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para los panqueques, coloca la harina en un bol y haz un pozo en el centro. Vierta el agua hirviendo y revuelva para formar una masa. Incline la masa sobre una superficie de trabajo enharinada y amase durante 2-3 minutos, o hasta que la masa esté suave.", "Cortar la masa en 16 piezas y enrollar cada pieza en un panqueque fino.", "Caliente una sartén hasta que esté caliente y fría cada panqueque por 1-2 minutos en cada lado, o hasta que estén pálidas doradas. Mantenga los panqueques calientes hasta que estén listos para servir.", "Para servir, coloque el pato rallado en un plato de servir grande y coloque la cebolla y el pepino al lado. Coloque los panqueques en un plato de servir por separado y sirva con la salsa de ciruela."], "url": "www_bbc_co_uk_food_recipes_five-spice_whole_roast_95220", "title": "Pato asado entero de cinco especias con panqueques, pepino, cebolleta y salsa de ciruela", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1.5kg / 3lb 5oz vientre de cerdo sin hueso, con corteza", "4 cucharadas de sal marina gruesa", "2 cucharaditas de pimienta blanca recién molida", "2 cucharadas de polvo chino de cinco especias", "1 cucharada de azúcar en polvo", "2 cucharadas de aceite de girasol", "2 pak choi, cortado en cuartos", "500 g / 1 lb 2 oz mezclados verdes asiáticos", "2cm / 1 en pieza de jengibre fresco, pelado y cortado en tiras finas", "4 cebolletas, en rodajas", "Jengibre fresco de la raíz de los 5cm / 2in, cortado en tiras finas", "2 dientes de ajo, en rodajas finas", "2 chiles rojos largos, en rodajas finas", "3 cucharadas de hojas de cilantro fresco picado", "3 cucharadas de menta fresca picada", "3 cucharadas de azúcar de palma", "2 cucharadas de salsa de soja", "2 cucharaditas de salsa de pescado", "1 lima, solo jugo", "4 cebolletas, en rodajas", "1 chile rojo, en rodajas"], "method": ["Para preparar la carne de cerdo, perfore el lado de la carne de cerdo con un tenedor o cuchillo afilado hasta que la piel esté cubierta con finos orificios.", "Haga hervir una olla grande de agua y, usando un cucharón grande, vierta el agua caliente sobre el lado de la carne de cerdo varias veces. Lo mejor es hacerlo suspendiendo la carne de cerdo sobre el fregadero con un gancho, pero puede colocarla en una rejilla en el fregadero. Coloque el vientre de cerdo a un lado.", "Caliente un wok hasta que esté caliente, luego agregue la sal, la pimienta, el polvo de cinco especias y el azúcar y saltee la mezcla por 3 minutos. Permita que la mezcla se enfríe un poco.", "Cuando la mezcla esté lo suficientemente fría como para manipularla, frótela en el lado de carne del cerdo. Cuelgue la carne para que se seque durante 8 horas o durante la noche en un lugar fresco o frente a un ventilador. Alternativamente, coloque la carne en una rejilla de alambre colocada encima de una lata de asar.", "Para cocinar el cerdo, precaliente el horno a un ventilador de 200C / 180C / Gas 6.", "Coloque el cerdo en una rejilla de alambre, con la corteza hacia arriba y asar durante 20 minutos.", "Reduzca el calor a 180C / 160C ventilador / Gas 4 y continúe asando durante 2 horas. Vuelva a encender el horno hasta 230C / 210C ventilador / Gas 8 y cocine durante 15 minutos. Retire la carne del horno y permita que la carne de cerdo se enfríe.", "Para los verdes, caliente un wok, una vez que esté caliente, agregue los ingredientes y cocine por 2-3 minutos.", "Para hacer el aderezo, coloque todos los ingredientes en una mano de mortero y machaque hasta obtener una pasta áspera.", "Para servir, revuelva el aderezo a través de las verduras wok y esparza en un plato grande. Corta la carne de cerdo en pequeños cuadrados y salpícalo alrededor del plato. Adorne con las cebolletas y el chile."], "url": "www_bbc_co_uk_food_recipes_five_spice_belly_pork_81415", "title": "Cinco especia de cerdo de vientre con verduras asiáticas", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 pechugas de pato pequeñas", "4 cucharaditas de polvo de cinco especias", "sal y pimienta negra recién molida", "2 cucharadas de miel clara", "6 cucharadas de salsa de soja", "sal", "4 cebollas de primavera", "1 paquete de fideos de huevo estilo oriental (2 cuadrados de fideos secos)", "semillas de sésamo, al gusto", "aceite de sésamo tostado, al gusto", "exprimir jugo de limón fresco"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Con un cuchillo filoso, calce la grasa del pato en un patrón de rayitas cruzadas.", "Espolvoree el polvo de cinco especias sobre la piel de los senos de pato y frótelo en la grasa. Sazonar con sal y pimienta negra recién molida.", "Caliente una sartén resistente al horno de base pesada. No agregue aceite Coloque los pechos de pato con la piel hacia abajo en la sartén caliente. Sazonar el otro lado con cinco especias en polvo y sal y pimienta negra recién molida. Cocine hasta que la mayor parte de la grasa se haya agotado en la sartén y la piel tenga un color dorado (aproximadamente tres minutos).", "Voltea las pechugas de pato y cocina el otro lado por un minuto más o menos.", "Coloque las pechugas de pato en el horno durante 3-5 minutos para terminar.", "Para hacer la salsa, caliente la miel y la salsa de soja en una sartén pequeña. Lleve hasta el punto de ebullición y deje que burbujee durante uno o dos minutos para reducir. Quite el fuego y deje enfriar. La salsa debe tener una consistencia tipo jarabe.", "Retire las pechugas de pato cocidas del horno y deje reposar en un lugar cálido.", "Mientras que el pato está descansando, corazón una sartén mediana de agua con sal para los fideos.", "Mientras tanto, corte las partes blancas y verdes de las cebolletas en rodajas en diagonal.", "Cuando el agua esté hirviendo, agregue los fideos de huevo y cocínelos durante 3-4 minutos o según las instrucciones del paquete.", "Escurra los fideos y colóquelos en un tazón. Espolvorear las semillas de sésamo, rociar con unas gotas de aceite de sésamo y espolvorear con cebollas cortadas, reservar algo para la guarnición. Revuelva bien juntos.", "Para servir, coloca los fideos en un plato. Exprime un poco de jugo de limón. Cortar los pechugas de pato en tiras y colocar al lado de los fideos. Espolvorea sobre la cebolla tierna restante y rocía sobre la miel y la salsa de soja."], "url": "www_bbc_co_uk_food_recipes_fivespiceduckbreasts_90212", "title": "Pechugas de pato de cinco especias con miel y soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespiceduckbreasts_90212_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "3 dientes de ajo picados", "2 cucharadas de jengibre fresco rallado", "1 cucharada de vino de arroz Shaoxing o jerez seco (opcional)", "2 cucharadas de salsa de soja ligera", "2 cucharaditas de polvo de cinco especias", "2 cucharadas de miel", "Baquetas de pollo de 1 kg / 2 lb, con la piel puesta"], "method": ["Para el adobo, coloque todos los ingredientes del adobo en un tazón grande y revuelva para combinar. Agregue el pollo y deje marinar mientras precalienta el horno a 200C / 180C Fan / Gas 6.", "Coloque los muslos de pollo en una bandeja para asar y tápelos durante 20-30 minutos, o hasta que la piel esté dorada y el pollo esté bien cocido. (Para comprobarlo, perfore la baqueta en su parte más gruesa, al lado del hueso. Los jugos deben quedar claros)."], "url": "www_bbc_co_uk_food_recipes_fivespiceroastchicke_89295", "title": "Palillos de pollo asado de cinco especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespiceroastchicke_89295_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Costillas de cerdo de 750g / 1½lb", "600 ml / 1 pinta de aceite de cacahuete (maní)", "1 cucharada de vino de arroz Shaoxing o jerez seco", "1 cucharada de salsa de soja ligera", "1 cucharada de vinagre de arroz negro o vinagre de sidra", "2 cucharaditas de aceite de sésamo", "1 cucharada de harina de maíz", "2 cucharadas de ajo finamente picado", "2 cucharaditas de polvo de cinco especias", "3 cucharadas de cebolletas finamente picadas", "3 cucharadas de azúcar de roca china o azúcar granulada", "3 cucharadas de vino de arroz Shaoxing o jerez seco", "150ml / 5fl oz de caldo de pollo", "1½ cucharada de salsa ligera de soja", "2 cucharadas de cáscara de naranja rallada y seca", "85ml / 3fl oz vinagre de arroz negro o vinagre de sidra"], "method": ["Haga que su carnicero separe las costillas de cerdo en costillas individuales y luego en trozos de aproximadamente 7.5 cm de largo. También puede hacer esto usted mismo usando una cuchilla afilada que pueda atravesar los huesos.", "Mezcle los ingredientes del adobo en un tazón y empújelos en el adobo por unos 25 minutos a temperatura ambiente. Retire las costillas de cerdo del adobo con una cuchara ranurada.", "Caliente el aceite en una freidora o en un wok grande. Cuando el aceite esté muy caliente y ligeramente humeante, dore lentamente las costillas marinadas en varios lotes hasta que estén doradas. Escurra cada lote cocido en papel de cocina. (Deje que se enfríe el aceite de cocina. Cúbralo a través de un filtro si quiere volver a usarlo cuando cocine la carne de cerdo).", "Coloque los ingredientes de la salsa en un wok o sartén limpio.", "Llevar la salsa a ebullición y luego reducir el fuego. Agregue las costillas de cerdo, tapar y cocine a fuego lento durante unos 40 minutos, revolviendo ocasionalmente.", "Si es necesario, agregue un poco de agua a la salsa para evitar que las costillas se sequen. Elimine cualquier grasa de la superficie, coloque el plato caliente y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_fivespicespareribs_70976", "title": "Costillas chinas de cinco especias", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fivespicespareribs_70976_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["750g / 1lb 10 oz de harina común", "375g / 13oz de mantequilla sin sal, refrigerada y en cubos", "150g / 5½oz de azúcar glas", "3 huevos medianos de granja", "1 cucharada de leche entera", "675g / 1lb 7oz de queso crema con toda su grasa", "150 g / 5½ oz de azúcar en polvo", "150ml / 5fl oz de crema agria", "3 huevos medianos de granja y 1 yema de huevo de gallinas camperas", "3 cucharadas de harina común", "2 bolas de tallo de jengibre en almíbar, jengibre picado", "1 limón grande sin cera, solo cáscara", "1 cucharadita de pasta de frijoles de vainilla", "100ml / 3½ fl oz crema doble", "100 g / 3% C2% BDoz% 20dark% 20chocolate% 20buttons% 20 (% mínimo 2070%% 20cocoa% 20solids)% 20", "4 cucharadas de jengibre de tallo (reservado de la jarra de jengibre)", "100ml / 3½ fl oz crema doble", "100g / 3½oz de botones de chocolate blanco de buena calidad", "2 cucharaditas de extracto de limón siciliano", "Colorante de comida de gel amarillo", "100ml / 3½ fl oz crema doble", "100g / 3½ oz de chocolate blanco", "2 cucharaditas de pasta de vainilla", "2 claras de huevo medianas", "Azúcar en polvo de 110 g / 4 oz", "100g / 3½oz de botones de chocolate blanco de buena calidad", "50g / 1¾oz popping candy", "3 cubos de jengibre cristalizado, toscamente picados"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para la base de repostería, frote la harina en la mantequilla hasta que se asemeje a pan rallado. Mezcle el azúcar glas.", "Batir los huevos y la leche juntos en un recipiente aparte y agregar a la mezcla de harina. Usa tus manos para juntar la masa. Envuelva la película adhesiva y transfiérala al congelador por 10 minutos.", "En una superficie de trabajo ligeramente enharinada, extienda la masa lo más delgada posible (idealmente de 3 mm de grosor).", "Alinee las 3 latas con la masa, asegurándose de dejar algo extra en caso de que se encoja (deje cualquier exceso de hojaldre en posición vertical que no cuelgue sobre los lados ya que podría ser difícil recortarlo más tarde). Pinchar las bases con un tenedor y enfriar las latas rellenas durante 15 minutos en la nevera.", "Alinee el interior de las latas con papel de hornear y llene cada lata con alubias para hornear. Coloque las latas en bandejas para hornear. Ciega hornea las cáscaras de repostería durante 15 minutos. Retire los frijoles para hornear y deje que la masa se enfríe en las latas.", "Reduzca la temperatura del horno a 150 ° C / 130 ° Ventilador / Gas 2.", "Para el relleno de queso crema, mezcle el queso crema y el azúcar en un tazón grande hasta que se incorpore. Agregue la crema agria, los huevos, el huevo y la harina. Mezcle suavemente para evitar la incorporación de exceso de aire y vierta la mezcla en las cajas de repostería, dejando un pequeño borde en la parte superior que se rellenará con salsa más adelante.", "Esparza el tallo de jengibre sobre la superficie de la tarta de queso de 20 cm / 8 pulgadas, la ralladura de limón en la tarta de queso de 18 cm / 7 pulgadas y agite la pasta de frijoles de vainilla en la tarta de queso de 15 cm. Coloque todas las latas en el estante del medio del horno y hornee la tarta de 15cm / 6in durante 30 minutos y las 2 más grandes durante 45 minutos, o hasta que cada tarta de queso se ajuste con un leve bamboleo en el centro. Déjalos enfriar en la lata.", "Para la cobertura de cerveza de jengibre, caliente la crema hasta que hierva y luego viértala sobre el chocolate. Cuando se derrita, agrega el jarabe de jengibre. Una vez que se haya enfriado un poco, vierta sobre la tarta de queso de 20 cm. Enfríe en la nevera o el congelador.", "Para el relleno de limonada, caliente la crema hasta que hierva y luego viértala sobre el chocolate. Cuando se derrita, agregue el extracto de limón y colorante para alimentos. Una vez que se haya enfriado un poco, vierta sobre la tarta de queso de 18 cm. Enfríe en la nevera o el congelador.", "Para el aderezo de crema de soda, caliente la crema hasta que hierva y luego viértala sobre el chocolate. Cuando se derrita, mezcle la pasta de vainilla. Una vez que se haya enfriado un poco, vierta sobre la tarta de queso de 15 cm. Enfríe en la nevera o el congelador.", "Para el merengue italiano, instale un mezclador independiente con el accesorio batidor. Agregue las claras de huevo y bata hasta que se formen picos suaves cuando se quite el batidor. Mientras tanto, caliente el azúcar y 3 cucharadas de agua en una sartén hasta que alcance los 120ºC en un termómetro de azúcar.", "Tan pronto como el azúcar alcance los 120 ° C, vierta lentamente en las claras de huevo con el motor en funcionamiento (tenga cuidado de no verter el jarabe en los batidores ya que podría salpicar). Cuando se incorpora todo el jarabe, la mezcla debe ser brillante y lisa. Continúe batiendo hasta que el recipiente se sienta frío. Transfiera el merengue a una manga pastelera equipada con una boquilla mediana lisa.", "Para ensamblar, vierta unos cuantos puntos de merengue en cada tarta de pastel. Recorte con cuidado cualquier exceso de masa y retire las tartas de queso de sus latas. Coloque cada pastel de queso en la tarta correspondiente.", "Comenzando con la tarta de queso más grande, inserte 3 pajitas para beber en forma de triángulo a unos 5 cm de separación (esto soportará el peso de la siguiente capa de tarta de queso). Recorta cuidadosamente las pajitas a la misma altura que la tarta de queso. Repite el proceso con la tarta de queso de 18 cm.", "Apila las tartas de queso de mayor a menor y coloca el merengue italiano alrededor del borde de cada una de las 2 tartas de queso y encima de la más pequeña. Decora los pasteles de queso con chocolate blanco en la capa superior, haciendo estallar los dulces en el medio y el jengibre cristalizado en la parte inferior."], "url": "www_bbc_co_uk_food_recipes_fizzy_pop_cheesecakes_30211", "title": "Tartaletas de queso Fizzy pop", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Rinde 3 niveles de tartas de queso decoradas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["harina, para quitar el polvo", "½ paquete de 425 g / 15 oz laminado en hojaldre", "1 huevo de gallinas camperas, golpeado", "55 g / 2 oz de espinaca", "55g / 2oz de queso crema", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "¼ de cebolla, cortada en cuñas", "Filete de salmón 100 g / 3½ oz, desollado y cortado en trozos de 4 cm / 1½ en piezas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Extienda la masa en una superficie ligeramente enharinada para hacer una ronda de 20 cm / 8 pulgadas y colóquela en una bandeja para hornear antiadherente.", "Calentar una sartén a fuego medio-bajo y colocar la espinaca en la sartén seca. Revuelva sobre el fuego hasta que se marchite, luego espolvoree sobre la masa.", "Ponga el queso crema sobre la espinaca y condimente, al gusto, con sal y pimienta negra recién molida.", "Hornee en el horno durante 10-12 minutos, o hasta que estén dorados y crujientes.", "Calentar el aceite en una sartén pequeña, agregar la cebolla y freír suavemente durante cinco minutos.", "Agregue las piezas de salmón y continúe cocinando por 2-3 minutos, o hasta que el salmón esté bien cocido.", "Para servir, coloque la pizza de hojaldre en un plato para servir y esparza el salmón y la cebolla sobre la parte superior."], "url": "www_bbc_co_uk_food_recipes_flakedsalmonspinacha_87684", "title": "Salmón en escamas, espinacas y queso cremoso 'pizza'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "pizca de sal", "80 g / 3oz de manteca de cerdo", "80g / 3oz de mantequilla"], "method": ["Mezcle la harina con la sal y frote en la mitad de la manteca de cerdo. Agregue suficiente agua fría para llevar la harina a una masa suave.", "Mezcle el resto de la manteca y la mantequilla.", "Estirar la masa para hacer un rectángulo de 12,5 x 25 cm / 5 x 10 pulgadas.", "Ponga un tercio de la mezcla de mantequilla / manteca de cerdo sobre dos tercios del rectángulo. Dobla la tercera sin grasa sobre el tercio medio de la masa. Trae el otro tercio en la parte superior. Selle los bordes con un rodillo y gire la masa 90 grados. Enfríe por 10 minutos.", "Repite la etapa 4 con la mitad del resto de la grasa y luego repite una vez más con la grasa restante. Enfriar durante 10 minutos después de cada plegado.", "Girar y doblar una vez más sin grasa y luego enfriar durante 30 minutos."], "url": "www_bbc_co_uk_food_recipes_flakypastry_1282", "title": "Hojaldre", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["75g / 2¾oz de azúcar en polvo", "Jengibre de raíz de 2cm / ¾in, pelado y finamente picado", "1 chalote, finamente picado", "3 barras de ruibarbo, finamente picadas", "5 cucharadas de vinagre de sidra", "1 naranja, solo jugo", "2 filetes de caballa, fileteados, deshuesados, piel en", "sal y pimienta negra recién molida", "½ manojo de remolachas heredadas del bebé, limpiadas, deja un poco de tallo", "75g / 2¾oz de mantequilla sin sal", "200ml / 7fl oz de vinagre de vino blanco", "75g / 2¾oz de azúcar en polvo", "1 cucharadita de sal", "½ cucharadita de pimienta negra", "2 chalotes de plátano, en rodajas finas", "100g / 3½ oz de crema", "1 cucharada de hojas de sangre de toro", "1 cucharada de hojas de acelga roja bebé"], "method": ["Para la salsa picante, en una sartén de base pesada, derrita el azúcar hasta que se forme un caramelo dorado (PRECAUCIÓN: el azúcar hirviendo está extremadamente caliente. Manipúlelo con cuidado). Retire del fuego y agregue el jengibre, el chalote y el ruibarbo. Agregue el vinagre de sidra y el jugo de naranja. Vuelva a hervir y luego cocine suavemente durante 8-10 minutos. Sazonar con sal y pimienta, reservar para enfriar.", "Coloque el bebé remolacha en una olla grande de agua hirviendo y cocínelo durante 15-20 minutos. Escurrir y dejar enfriar un poco. Con cuidado pele las remolachas y córtelas a la mitad. Derrita la mantequilla en una sartén mediana y agregue las remolachas. Cocine por 2-3 minutos o hasta que esté ligeramente dorado.", "Para los chalotes encurtidos, caliente el vinagre de vino blanco, el azúcar, la sal y los granos de pimienta en una sartén a fuego medio hasta que el azúcar se haya disuelto. Coloque los chalotes en un recipiente y vierta sobre la mezcla de vinagre caliente. Mezcle, cubriendo los chalotes. Déjelo a un lado para que quede en salmuera durante al menos una hora, pero preferiblemente durante 24 horas.", "Coloque la caballa con la piel hacia arriba sobre una bandeja de horno pesada y use un soplete de chef para carbonizar la piel. Condimentar con sal y pimienta.", "Coloque una cucharada de salsa picante en cada plato con la remolacha para bebés salpicada alrededor de los platos. Coloque la caballa en el centro y salpique las placas con crème fraîche y chalotes encurtidos. Adornar con las hojas."], "url": "www_bbc_co_uk_food_recipes_flamed_mackerel_with_79694", "title": "Caballa flameada con salsa picante de ruibarbo, remolacha asada y chalotes encurtidos", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 75 g / 2½ oz", "2 huevos de gallinas camperas", "1 cucharada de aceite de oliva", "100ml / 3½ fl oz de leche", "aceite vegetal", "55g / 2oz de chocolate", "30g / 1oz de mantequilla", "30ml / 1oz de mantequilla", "1 cucharada de suga marrón", "170 g / 6oz de peras envasadas, escurridas y en rodajas", "1 cucharada de licor de avellana", "azúcar en polvo", "crema batida, para servir, opcional"], "method": ["Coloque todos los ingredientes de panqueque, aparte del aceite, en un recipiente y mezcle para formar una masa suave.", "Caliente el aceite vegetal en una sartén a fuego alto y vierta suficiente masa para cubrir la base en una capa fina.", "Cocine el panqueque por un minuto o dos, luego voltee con cuidado cuando la base esté dorada y cocine el otro lado. Guay. Repite hasta que tengas tres panqueques. Dobla por la mitad, luego en cuartos y apilar en un plato de servir.", "Para la salsa de chocolate, coloque el chocolate y la mantequilla en un recipiente (no metálico) y coloque en el microondas. Cocine por 30 segundos o hasta que se derrita.", "Para las peras, derrita la mantequilla en una sartén a fuego medio. Agregue el azúcar morena deje disolver, luego agregue las peras.", "Agregue el licor y el flambeado, encendiendo el licor con una cerilla, teniendo cuidado de mantener la sartén a la distancia de un brazo (NB: mantenga la tapa de la olla a un lado en caso de que la llama deba apagarse). Agite la sartén hasta que la llama se apague.", "Para servir, apile los panqueques en el centro de un plato para servir y coloque las peras encima. Rocíe con la salsa de chocolate y el polvo con azúcar glas. Sirva con una cuchara de crema batida si lo desea."], "url": "www_bbc_co_uk_food_recipes_flambeedpearswithpan_84484", "title": "Peras flambeadas con panqueques y salsa de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Recortes de pescado blanco de 250 g / 9 oz, enjuagados", "2 puerros, solo parte blanca, más o menos picados", "½ bulbo de hinojo, toscamente picada", "2 zanahorias, aproximadamente picadas", "1 hoja de laurel", "1 cucharada de aceite de oliva", "2 chalotes, finamente picados", "1 diente de ajo, finamente picado", "2 tomates de ciruela enlatados, escurridos y finamente picados", "2 langostas cocidas, cortadas, con cola y carne de garra retiradas, cortadas en porciones", "Brandy 75ml / 3fl oz", "110ml / 4fl oz de caldo de pescado", "50g / 2oz de mantequilla", "3 cucharadas de perifollo, más o menos picadas", "sal y pimienta negra recién molida"], "method": ["Para el caldo de pescado, coloque todos los ingredientes del caldo de pescado en una cacerola y cubra con agua fría. Coloque en el fuego y llevar a ebullición.", "Reduzca el fuego y cocine a fuego lento durante 25 minutos, eliminando cualquier espuma que se asiente en la superficie. Cuele en un recipiente y utilícelo cuando sea necesario (el material puede congelarse si es necesario; asegúrese de que se haya enfriado por completo antes de colocarlo en el congelador y de que el recipiente que utiliza es apto para la congelación).", "Para la langosta flambeada, caliente una sartén hasta que esté caliente, agregue el aceite de oliva, los chalotes y el ajo y cocínelos durante dos minutos.", "Agregue los tomates y saltee por un minuto. Agregue la langosta y el brandy.", "Incline la sartén hacia el fuego para que el brandy se prendió, lanzando la langosta para que se cubra con las llamas. Una vez que las llamas han disminuido, agregue el caldo de pescado y cocine a fuego lento durante dos minutos. Agregue la mantequilla y el perifollo, sazone con sal y pimienta negra recién molida y sirva de inmediato."], "url": "www_bbc_co_uk_food_recipes_flambeedlobster_89187", "title": "Langosta flameada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "1 cebolla pequeña, picada", "1 diente de ajo, picado", "80g / 2¾oz de jamón serrano, picado", "1 cucharadita colmada de pimentón ahumado en caliente", "8 tomates grandes (alrededor de 750 g / 1 libra 10 onzas), despellejados y picados, o 2 tomates de ciruela pelados de 2 x 400 gramos", "1 cucharadita de puré de tomate", "75g / 2½ oz de guisantes frescos o congelados", "100g / 3½oz de judías verdes finas", "4 huevos de gallinas camperas", "12 rebanadas de chorizo", "1 pimiento rojo, asado y despellejado, cortado en 8 tiras (o use pimientos de un frasco)", "sal y pimienta negra recién molida", "4-8 rebanadas gruesas de pan", "1 diente de ajo, reducido a la mitad", "2 cucharadas de aceite de oliva", "pequeño puñado de perejil flatleaf, picado, para servir"], "method": ["Precaliente el horno a 200C / 180C Fan / Gas 6 (alternativamente puede terminar de cocinar en la placa).", "Caliente el aceite en una sartén grande, tapada, a prueba de horno o en una cacerola poco profunda a fuego medio-bajo. Cocine la cebolla y el ajo durante 5-10 minutos, o hasta que estén suaves.", "Agregue el jamón y el pimentón y fría por 3 minutos. Agregue los tomates y el puré de tomate, cubra la olla y cocínelos durante 10-15 minutos, o hasta que los tomates estén reducidos y tengan pulpa.", "Mientras tanto, trae una olla de agua a ebullición. Agregue las arvejas y los frijoles a cocer durante 3-4 minutos, luego escurra y revuelva en agua fría (los guisantes congelados no requieren precocción).", "Esparce los guisantes y los frijoles sobre la salsa de tomate. Rompa los huevos en la salsa. Coloque las rebanadas de chorizo ​​y las tiras de pimiento rojo alrededor de los huevos. Condimentar con sal y pimienta.", "Hornee durante 10 minutos, o hasta que las claras de huevo estén puestas y las yemas aún blandas; verifique después de 8 minutos. Alternativamente, cocine en la placa a fuego medio con una tapa en la sartén durante 10 minutos.", "Mientras tanto, frote el pan con el ajo, cepille con el aceite y póngalo en una sartén o en una sartén.", "Esparce el perejil sobre el plato y sírvelo con pan a la parrilla."], "url": "www_bbc_co_uk_food_recipes_flamenco_eggs_29298", "title": "Huevos de flamenco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/flamenco_eggs_29298_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de azúcar granulada", "2 cucharadas de agua", "Leche entera de 900ml / 1½ pinta", "4 cucharadas de miel de lavanda", "1 naranja, ralladura finamente rallada", "9 huevos de gallinas camperas", "100 ml / 3½ fl oz de vino dulce de moscatel (o cualquier otro vino de postre)"], "method": ["Para hacer el caramelo, caliente el azúcar y el agua en una sartén de base pesada hasta que el azúcar se disuelva, revolviendo ocasionalmente. Una vez que el azúcar se haya disuelto, deje de remover y cocine hasta que el jarabe de azúcar se caramelice y se vuelva dorado. Agite el líquido en la sartén ocasionalmente para que no se queme.", "Tan pronto como el caramelo esté listo, viértalo cuidadosamente en una lata de flan con relleno antiadherente de 1.5 litros / 2¾ pinta. (No use una lata de flanco de fondo suelto para esto). Sosteniendo la lata con un paño de horno, incline el caramelo en las crestas; tenga mucho cuidado ya que el caramelo estará extremadamente caliente. Déjalo a un lado mientras se pone el caramelo.", "Para hacer la crema pastelera, vierta la leche en una cacerola mediana antiadherente y agregue la miel y la ralladura de naranja. Deje que hierva a fuego lento y cocine hasta que la miel se disuelva, revolviendo ocasionalmente. Mire cuidadosamente para que no se hunda. Retire la leche del fuego y deje en infusión durante 10 minutos.", "Mientras tanto, ponga a hervir un hervidor de agua y precaliente el horno a 170 C / 325 F / Gas 3½. Pon la lata de flan en una lata de asar.", "Batir los huevos y el vino juntos hasta que estén pálidos y cremosos. Cuele la leche caliente y la miel a través de un tamiz fino en una jarra, luego vierta en los huevos y el vino, revolviendo constantemente. Vierta esta mezcla en la lata de flan en la parte superior del caramelo.", "Vierta agua recién hervida en la lata para asar hasta que llegue a la mitad de los lados de la lata de flan. Esto ayuda a la natilla a cocinar suavemente y le da una textura suave al flan terminado.", "Hornee por 45-50 minutos o hasta que la crema esté lista. Cubra la lata sin apretar con papel de aluminio a la mitad del tiempo de cocción para evitar que se dore demasiado la parte superior. La crema todavía debe estar bastante tambaleante en el centro cuando está cocida y continuará fraguando a medida que se enfría.", "Saque la lata de asar del horno y deje que se enfríe en el agua durante al menos una hora. Una vez que se haya enfriado, cúbralo con una película adhesiva y transfiéralo a la nevera. Enfriar durante al menos 6 horas o toda la noche.", "Para servir, presione la crema con la punta del dedo para romper el sello en el borde de la lata. Coloque un plato bastante hondo en la parte superior de la lata (para contener el caramelo) e inviértalo. Sujetando tanto el plato como el flan juntos, dale un pequeño batido. La crema debería caer al plato. Vierta cualquier caramelo en el plato sobre la crema pastelera. Si la natilla es reacia a dejar la lata, sumerja la base muy rápidamente en un recipiente con agua recién hervida y vuelva a intentarlo."], "url": "www_bbc_co_uk_food_recipes_flan_de_saint_jean_de_38808", "title": "Flan de San Juan de Minervois", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Porciones 8 - 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]