[{"isVegetarian": true, "title": "The ultimate veggie burger", "url": "www_bbc_co_uk_food_recipes_theultimateveggiebur_91774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/theultimateveggiebur_91774_16x9.jpg", "ingredients": ["3-4 tbsp olive oil", "1 onion, peeled, thinly sliced", "250g/9oz firm tofu, finely chopped", "1 cooked beetroot (not in vinegar), peeled, grated", "150g/5½oz fried mushrooms, drained", "1 carrot, peeled, grated", "1 tsp smoked paprika", "1 garlic clove, peeled, crushed", "1 tsp chopped fresh thyme", "1 tbsp chopped kidney beans", "salt and freshly ground black pepper", "6 burger buns", "6 tbsp ready-made mayonnaise (optional)", "3 beefsteak tomatoes, thickly sliced", "2-3 gherkins, sliced"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat 1-2 tablespoons of the olive oil in a pan over a medium-low heat and fry the onions for 15 minutes, stirring frequently, or until they are softened and golden-brown.", "In a bowl, mix together the cooked onions, tofu, beetroot, mushrooms, carrots, smoked paprika, garlic, thyme and kidney beans. Season, to taste, with salt and freshly ground black pepper.", "With damp hands, divide the mixture into approximately 150g/5oz portions and shape into patties. ", "Heat the remaining olive oil in a frying pan and fry the patties for 3-4 minutes on both sides, or until golden-brown. Heat a griddle pan until smoking, then add the patties and fry for a further 1-2 minutes on both sides, or until there are deep char lines on both sides. ", "To serve, place the patties into burger buns and arrange over the toppings of your choice."]}, {"isVegetarian": false, "title": "Thick smoked-haddock chowder", "url": "www_bbc_co_uk_food_recipes_thick_smoked-haddock_90997", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thick_smoked-haddock_90997_16x9.jpg", "ingredients": ["25g/1oz butter", "1 tbsp sunflower oil", "100g/3½oz frozen chopped onion (or 1 medium onion, chopped)", "20g/¾oz plain flour", "400ml/14fl oz semi-skimmed milk", "400ml/14fl oz just-boiled water", "2 medium potatoes (approximately 200g/7oz each), peeled, cut into roughly 2cm/¾in cubes ", "¼ tsp salt", "freshly ground black pepper", "100g/3½oz frozen sweetcorn kernels", "125g/4½oz frozen sliced leeks (or 1 medium leek, trimmed and finely sliced)", "4 x 90g/3¼oz frozen smoked-haddock fillets", "4 large free-range eggs (optional)", "handful roughly chopped fresh flatleaf parsley leaves, to garnish (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter and oil in a large, non-stick frying pan over a medium heat. Add the onion and fry for 3 minutes, stirring regularly, until completely softened but not coloured. Sprinkle over the flour and stir the onions well.", "In a measuring jug, mix the milk and water. Gradually add 700ml/1¼ pints of the liquid to the onions, stirring after each addition.", "Add the potatoes and salt to the pan and season generously with freshly ground black pepper. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer, stirring regularly, for 10-12 minutes, or until the potatoes are almost tender. Stir in the sweetcorn and leeks and return the mixture to a gentle simmer. ", "Place the smoked-haddock fillets on top of the chowder and continue to simmer for 10-15 minutes, or until the fish has thawed and the flesh flakes easily when prodded with a knife. (This will depend on the thickness of each fillet.) Turn the fish twice as the fillets simmer, without allowing them to break up if possible. ", "Carefully remove the cooked smoked-haddock fillets from the chowder using a slotted spoon and set aside in a warm place. (Remove the skin at this point if you prefer.) Stir the remaining milk and water into the pan and return to a simmer, stirring. \r\n", "If using the eggs, fill a wide saucepan half full with boiling water. Reduce the heat until the water is barely simmering. Carefully crack the eggs into the water one at a time, spacing them well apart. Poach very gently for 3-4 minutes, or until the whites have set but the yolks remain runny. Remove the poached eggs from the pan using a slotted spoon", "To serve, spoon the chowder into warm bowls, seasoning again with salt and pepper, if necessary. Top each serving with one of the haddock fillets and a poached egg, if using. Garnish with parsley, if using. Serve with slices of crusty bread."]}, {"isVegetarian": true, "title": "Tusha shinni", "url": "www_bbc_co_uk_food_recipes_thoosha_shinni_91830", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thoosha_shinni_91830_16x9.jpg", "ingredients": ["2 cups boiling water", "2 cups caster sugar", "3 cardamom seeds", "1 large cinnamon stick", "2 cups plain flour", "1 cup salted butter or clarified butter, melted", "½ cup raisins", "pistachios, chopped", "crystallised rose petals"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the boiling water into a jug, then stir in the sugar until dissolved. Add the cardamom and cinnamon and set aside.", "Sieve the flour into a large, wide pan and cook over a low heat, stirring often, until golden-brown. This can take up to 25 minutes, but take care not to burn it as it will make the dish taste bitter.", "Pour in the melted butter and raisins and stir until the mixture resembles a roux. It should start coming away from the sides of the pan. Remove from the heat.", "Sieve the spices from the sugary water, then add the water to the flour mixture. Return the pan to the heat and mix very fast to avoid lumps. (This can be easier with one person to hold the pan while another stirs vigorously.) Cook until the water is absorbed. The mixture will have the consistency of very soft, sugary dough.", "Serve warm, garnished with pistachios and crystallised rose petals."]}, {"isVegetarian": true, "title": "Three-tier red velvet cake", "url": "www_bbc_co_uk_food_recipes_three-tier_red_velvet_17795", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-tier_red_velvet_17795_16x9.jpg", "ingredients": ["150g/5oz butter, softened, plus extra for greasing", "150g/5oz caster sugar", "2 free-range eggs", "few drops vanilla essence", "pinch salt", "125g/4½oz plain flour", "25g/1oz cocoa powder", "1½ tsp baking powder", "1 tbsp red food colouring", "450g/1lb ready-to-roll white icing", "350g/12oz butter, softened, plus extra for greasing", "350g/12oz caster sugar", "6 free-range eggs", "½ tsp vanilla essence", "pinch salt", "300g/10oz plain flour", "50g/2oz cocoa powder", "1 tbsp baking powder", "50ml/2fl oz red food colouring", "800g/1¾lb ready-to-roll white icing", "650g/1lb 7oz butter, softened, plus extra for greasing", "650g/1lb 7oz caster sugar", "10 free-range eggs", "1 tbsp vanilla essence", "large pinch salt", "575g/1lb 5oz plain flour", "75g/3oz cocoa powder", "35g/1¼oz baking powder", "100ml/3½fl oz red food colouring", "1.25kg/2lb 12oz ready-to-roll white icing", "730g/1lb 10oz butter, softened", "1.8kg/4lb icing sugar", "225g/8oz cream cheese", "few drops vanilla essence"], "serves": "Serves 100", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Take the smallest cake tin and draw round it twice on greaseproof paper. Cut out both circles. Measure the circumference of the tin with string, then cut a long strip of paper the length of the string and fold in half lengthways. Grease the tin with butter and place one of the paper circles into the base. Grease again, add a second circle, then grease once more. Grease the inside edge of the tin and line with the long paper strip. Repeat this with the 23cm/9in tin and 30cm/12in tin.", "For the small tier, beat the butter and sugar together in a large bowl until light and fluffy. Gradually beat in the eggs, vanilla and salt, and half of the flour to prevent the mixture from curdling. Add the remaining flour, cocoa powder and baking powder and give it a final beat to mix together. Add the food colouring and mix well. Spoon into the prepared tin and bake for 40-45 minutes, or until a skewer inserted into the middle comes out clean.", "Remove the cake from the oven, leave to cool for five minutes, then remove from the tin, peel off the greaseproof paper and leave to cool completely on a wire rack.", "For the medium tier, repeat steps 3 and 4 and cook the cake for 1 hour 15 minutes.", "For the large tier, repeat steps 3 and 4 and cook the cake for 1 hour 30 minutes.", "Meanwhile, for the buttercream, cream together the softened butter and icing sugar in a very large bowl until light and fluffy. Beat in the cream cheese and a few drops of vanilla essence, to taste. (If you’re not using the buttercream straight away, cover the surface with cling film and chill until ready to use. Beat the mixture again until light and fluffy before using.)", "Using a long-bladed serrated knife, carefully cut the smallest cake in half and sandwich together with three heaped tablespoons of the buttercream. Cut the remaining cakes in the same way, using six heaped tablespoons of buttercream to sandwich the medium cake and eight heaped tablespoons of buttercream for the large one. ", "Spread a teaspoon of buttercream onto each cake board and place the cakes onto them, upside down (this gives the cakes a flatter top for icing).", "Using half of the remaining buttercream, spread a thin layer over the top and sides of each cake until covered. Refrigerate the cakes for 30 minutes, or until the icing has set. Spread the remaining icing over the cakes to give a smooth finish and chill in the fridge until set.", "To cover the cakes in ready-to-roll icing, ice just one cake at a time, as the icing can dry out very quickly. Make sure your work surface is clean and dry, then knead the icing until warm and pliable. Place two tablespoons of icing sugar into a small sieve and use to lightly dust your work surface.", "Cut a piece of string for each cake to measure the combined length of the top and sides – this will be the size to which to roll your circle of icing. Roll the icing out to a large enough circle that is 0.4cm/⅙in thick. Carefully slide your hands and arms under the icing, lift centrally over the cake and lay onto the buttercream (you could use a large rolling pin for this instead – simply hold the pin over the centre of the icing and flip the icing over it. Lift, position, and roll over the cake). Dust your hands with a little icing sugar and rub them gently over the cake to smooth the icing over the surface and to make sure it has stuck to the buttercream underneath. ", "Use a sharp long-bladed knife to trim the edges, cutting downwards cleanly (keep wiping the knife blade, or else the icing will build up and make it difficult to get a clean cut). Repeat with the remaining cakes and icing. ", "To stack the cakes, hold a dowelling rod at the side of the medium cake and mark with a pencil where the icing comes to. Cut the rod and three others to the same length. Push the rods into the cake about 5cm/2in away from the sides, to form the four corners of a square in the centre of the cake. They should not rise above the level of the icing. If you have miscalculated and the dowelling is too long, remove it and shave off any excess with a sharp knife. Measure, cut and insert the rods in the same way for the large cake. The three cakes can now be stacked directly on to each other. Once they’re stacked, it’s best not to move them about, so it’s safest to assemble them at your venue or in the position you want them to be displayed."]}, {"isVegetarian": false, "title": "Family frittata", "url": "www_bbc_co_uk_food_recipes_three-way_frittata_71196", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-way_frittata_71196_16x9.jpg", "ingredients": ["2 tsp rapeseed oil", "3 turkey sausages, skinned and roughly chopped", "1 tsp smoked sweet paprika", "1 large red pepper, thickly sliced, optional", "1 x 300g tin new potatoes, drained and sliced", "6 free-range eggs, beaten", "60g/2oz frozen peas, defrosted, optional", "100g/3½oz Cheddar cheese, grated, optional", "1 tomato, sliced, optional", "sea salt and freshly ground black pepper"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Place an ovenproof frying pan over a medium heat and add a teaspoon of the oil. Stir in the sausages and smoked paprika and fry for 1 minute. Add the pepper, if using, and turn the heat down. Cover and cook for 2 minutes, or until just softened. Tip the mixture out onto a plate and set aside. ", "Heat the remaining oil in the frying pan, stir in the potatoes and fry for 1 minute.", "Season the eggs then pour them into the frying pan and stir. Lower the heat and cook for 2–3 minutes, or until just set on the bottom, drawing the eggs in from the side a few times.", "Turn off the heat and add the tomato, peas and / or Cheddar, if using. Spoon over the sausage mixture at this point. For a twist, you could give each third of the frittata a different topping if you are serving people with different preferences.", "Bake for 6–8 minutes, or until puffed up and golden-brown. Leave to cool for 3 minutes before running a spatula around the edges and sliding out onto a board or plate. Cut into thirds and serve."]}, {"isVegetarian": false, "title": "Three-tier white chocolate and raspberry cheesecake", "url": "www_bbc_co_uk_food_recipes_three-tier_white_23088", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three-tier_white_23088_16x9.jpg", "ingredients": ["150g/5½oz butter", "75g/2½oz dark chocolate", "700g/1lb 9oz shortbread biscuits", "900g/2lb white chocolate, broken into pieces", "1.2kg/2lb 12oz full-fat cream cheese", "6 free-range eggs", "450ml/16fl oz soured cream", "1 tbsp vanilla extract", "450g/1lb fresh raspberries", "200g/7oz raspberries", "1 tsp icing sugar, plus extra for dusting", "300ml/10fl oz double cream", "50g/1¾oz white chocolate"], "serves": "Serves 24-30", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3. Grease and line the base and sides of a 13cm/5in, a 18cm/7in and a 23cm/9in deep, loose-bottom cake tin with non-stick baking paper. ", "Melt the butter and chocolate in a saucepan over a low heat. Stir in the crushed biscuits and divide between the 3 tins. Press evenly over the base of the tins and chill in the fridge while you make the filling. (Make sure the base covers right to the edge, or the topping could leak through the join on the loose bottom.)", "For the filling, break the white chocolate into a bowl and melt very gently over a pan of hot water (do not allow the chocolate to become too hot), stir occasionally with a spoon until runny and smooth.", "Beat the cream cheese and eggs together in a large bowl until smooth, add the soured cream and vanilla and whisk again until completely smooth with no lumps. Stir in the melted chocolate and mix together.", "Divide half of the mixture between the 3 chilled bases. Scatter the raspberries over the mixture in each tin and cover with the remaining mixture, spreading evenly. ", "Bake in the preheated oven for 30-35 minutes for the 13cm/5in cheesecake, 35-40 minutes for the 18cm/7in cheesecake and 40-45 minutes for the 23cm/9in, until they are just firm around the edge and just set in the middle. Remove from the oven, and then leave to cool at room temperature before transferring to the fridge to chill. ", "For the decoration, pulse 50g/1¾oz of the raspberries with the icing sugar in a food processor to make a purée. Pass through a sieve and discard the seeds. ", "Turn the cheesecakes out of their tins and place the 23cm/9in cheesecake on a serving plate. Place the 18cm/7in and 13cm/5in cheesecakes on 3mm-thick cake boards. Cut a cake dowel or an invisible cake pillar to the same height as the largest cheesecake. Press down into the middle of the cheesecake and place the 18cm/7in cheesecake on top. Repeat the process with the 18cm/7in cheesecake and place the 13cm/5in cheesecake on top. The dowel or invisible pillar helps to support the cheesecakes and prevents the lower layers from being crushed.", "Whip the cream until soft peaks form when the whisk is removed. Spoon into a piping bag fitted with a medium star nozzle. Pipe rosettes of cream close together around the top edge of all 3 cheesecakes and top each rosette of cream with a raspberry. Pour the raspberry coulis on to the top tier - the piped cream should prevent it from dripping down the sides. ", "To make white chocolate curls, place the chocolate bar on its side and drag the blade of a long sharp knife at a slight angle towards you (for easier, but shorter, curls use a vegetable peeler). Arrange the curls over the top tier. "]}, {"isVegetarian": true, "title": "Three cheese and cress muffins", "url": "www_bbc_co_uk_food_recipes_three_cheese_and_cress_14627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 free-range egg white", "4 tbsp vegetable oil", "3-4 tbsp milk", "125g/4½oz plain flour", "1 tsp baking powder", "pinch English mustard powder", "small bunch salad cress", "15g/½ oz cheddar, grated", "15g/½ oz feta, crumbled", "15g/½ oz parmesan, grated"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Line a mini muffin tin with paper cases.", "Whisk the egg white in a bowl until frothy, then whisk in the oil and milk. Season with freshly ground black pepper.", "Stir the flour, baking powder and mustard powder together in a bowl.", "Stir in the egg mixture, cress, cheddar, feta and parmesan until just combined.", "Spoon the mixture into the muffin tin and bake in the oven for 12-15 minutes, or until the muffins are risen and golden-brown."]}, {"isVegetarian": true, "title": "Three cheese pizza with a rocket and parmesan salad", "url": "www_bbc_co_uk_food_recipes_three_cheese_pizza_with_11842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1¾lb '00' flour", "200g/7oz semolina flour, plus extra for dusting", "1 tsp salt", "1 tbsp caster sugar", "14g/½oz dried yeast", "4 tbsp extra virgin olive oil", "2 x 400g/14oz tins San Marzano tomatoes", "200g/7oz mozzarella cheese", "150g/5½oz dolcelatte cheese", "100g/3½oz pecorino cheese (or a similar vegetarian hard cheese)", "3 tbsp olive oil", "sea salt and freshly ground black pepper", "handful basil leaves", "2 bunches rocket", "75g/2½oz parmesan cheese, shaved (or a similar vegetarian hard cheese)", "3 tbsp olive oil", "1 tbsp balsamic vinegar"], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 450F/220C/Gas 7.", "For the pizza dough, place the flours, salt, sugar and yeast into a large bowl and stir. Make a well in the centre of the flour and pour in 650ml/1 pint 2fl oz of water and the oil, gradually mixing in the flour to form a soft dough.", "Tip out and knead on an oiled work surface for about 10 minutes or until the dough is smooth and elastic. Place it into a bowl, cover and leave to rise for two hours.", "Place a heavy baking tray or pizza stone on the top shelf of the oven to heat.", "When the dough has proved, remove it from the bowl and knead for a few minutes, then divide into 6-8 pieces depending on how many pizzas you want to make. Allow to rest for five minutes, then stretch each piece over your hands to form a disc about 5mm/¼in thick.", "Place the circles of dough onto upturned floured baking trays or a pizza peel if you have one.", "For the topping, put the tinned tomatoes into a food processor and blend to a purée. Spoon the tomato purée thinly over the pizzas, scatter over the cheeses then drizzle over the oil. Season with sea salt and freshly ground black pepper.", "Slide a pizza off the baking tray directly onto the heated baking tray or pizza stone in the oven and cook for 5 -10 minutes, or until golden-brown and crisp. Repeat to cook the remaining pizzas.", "For the rocket and parmesan salad, place the rocket in a bowl. Pour the oil and balsamic vinegar into a small bowl and whisk. Toss the rocket in the dressing and mix in the parmesan just before serving.", "To serve, scatter the basil leaves over the pizza and drizzle with a little more olive oil. Serve with the salad."]}, {"isVegetarian": false, "title": "Three cheese, potato and caramelised onion pie", "url": "www_bbc_co_uk_food_recipes_three_cheese_potato_and_30007", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/2½oz unsalted butter, room temperature", "75g/2½oz lard, room temperature", "200g/7oz plain flour", "½ tsp salt", "½ tbsp white wine vinegar", "about 150ml/5fl oz chilled water ", "30g/1oz butter", "280g/10oz onions, peeled, thinly sliced", "1 tsp salt", "2 tbsp caster sugar", "930g/2lb 1oz potatoes, preferably Marabel variety, peeled, thinly sliced ", "140g/5oz crème fraîche", "4 tbsp double cream", "100g/3½oz mature cheddar, grated", "100g/3½oz Stilton, crumbled", "100g/3½oz Gruyère, grated", "freshly ground black pepper", "1 tsp grated nutmeg", "1 free-range egg, beaten"], "serves": "Serves 4 - 6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["To make the pastry, place the butter and lard into a bowl and mash with a fork until soft and creamy. Divide the mixture into four equal portions.", "Place the flour into a bowl and add the salt. Take one portion of the butter/lard mixture and rub into the flour until the mixture resembles breadcrumbs. Add the white wine vinegar and mix it in using a blunt knife. Add just enough cold water to form a dough then turn it out onto a floured work surface. ", "Shape the dough into a rectangle and roll it out to a thickness of about 1cm/½in. Gently lift the pastry with your fingers and allow it to shrink back a little.", "Cut another portion of the butter/lard mixture into small pieces using a palette knife and dot it over the pastry, being careful not to get it too close to the edges. Fold the pastry into thirds, rubbing off any excess flour as you do so, cover in cling film and place in the fridge for five minutes.", "Take the pastry from the fridge. Repeat steps 3 and 4 using the remaining butter/lard mixture. If any fat shows through the pastry, scatter over a little more flour. ", "Remove the pastry from the fridge, roll once more into a rectangle about 1cm/½in thick, fold into thirds and return to the fridge for 30 minutes.", "Meanwhile, make the filling. Heat the butter in a wide pan and add the onions, salt and sugar. Fry over a low heat, stirring occasionally, for 5-6 minutes, or until the onions are lightly caramelised. Remove the pan from the heat and set aside. ", "Cook the potatoes in a large pan of boiling, salted water for eight minutes, drain well then set aside.", "Preheat the oven to 220C/425F/Gas 7, with a rack is just above the middle of the oven and a baking tray underneath to catch any filling that might escape during cooking. ", "Mix the crème fraîche, cream and cheddar in a small bowl. Mix together the Stilton and Gruyère in a separate bowl. ", "Layer one quarter of the potatoes, a third of the onions and a third of the Stilton/Gruyère mixture in the bottom of a large pie dish. Sprinkle with a little freshly ground black pepper and grated nutmeg.", "Repeat step 11, working from the outside of the pie dish into the middle to achieve a domed effect, seasoning as you go, then pour over half the cream/cheddar mixture. Repeat this step then cover the filling with the remaining potato, ensuring none of the cream mixture is visible.", "Take the pastry from the fridge and place on a floured work surface. Roll out in one direction only, turn 45 degrees and roll again until you have a piece of pastry that is a little larger than the pie dish. Lift the pastry with your fingers to allow it to shrink back a little. ", "Cut thin strips from each edge of the pastry and use a little egg wash to stick each one to the rim of the pie dish.  Brush each strip with beaten egg and carefully place the pastry over the filling, pressing it down on the pastry strips to make a good seal.", "Take a fork and press down gently around the edges of the pie. Use any off-cuts of pastry to decorate the pie then brush the top with the remaining egg wash. Cut a small cross in the top of the pie to let the steam escape.", "Transfer the pie to the oven and bake for 30 minutes then reduce the oven to 180C/350F/Gas 4 and bake the pie for one hour or until golden-brown. "]}, {"isVegetarian": false, "title": "Three fish pie", "url": "www_bbc_co_uk_food_recipes_three_fish_pie_58875", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three_fish_pie_58875_16x9.jpg", "ingredients": ["1kg/2lb 4oz peeled main crop potatoes, cubed ", "knob of butter", "a little milk", "salt and pepper", "50g/1¾oz Gruyère cheese, grated", "75g/3oz butter ", "2 leeks, sliced ", "75g/2¾oz plain flour", "150ml/5fl oz white wine ", "568ml/1 pint milk", "2 tbsp chopped parsley", "750g/1lb 10oz mixture of salmon, smoked haddock and fresh haddock, skinned and cut into cubes", "6 free-range eggs, hard-boiled, peeled and quartered"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 (180C fan).", "Put the potatoes into a saucepan of cold salted water. Bring up to the boil and simmer until completely tender. Drain well and then mash with the butter and milk. Add pepper and taste to check the seasoning. Add salt and more pepper if necessary.", "For the fish filling, melt the butter in a saucepan, add the leeks and stir over the heat. Cover with a lid and simmer gently for 10 minutes, or until soft. Measure the flour into a small bowl. Add the wine and whisk together until smooth. ", "Add the milk to the leeks, bring to the boil and then add the wine mixture. Stir briskly until thickened. Season and add the parsley and fish. Stir over the heat for two minutes, then spoon into an ovenproof casserole. Scatter over the eggs. Allow to cool until firm.", "Spoon the mashed potatoes over the fish mixture and mark with a fork. Sprinkle with cheese. ", "Bake for 30-40 minutes, or until lightly golden-brown on top and bubbling around the edges."]}, {"isVegetarian": true, "title": "Three easy dips for kids", "url": "www_bbc_co_uk_food_recipes_three_easy_dips_for_kids_08808", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/three_easy_dips_for_kids_08808_16x9.jpg", "ingredients": ["1 x 400g tin chickpeas, butter beans, pinto or borlotti beans (no added salt), rinsed and drained", "1 tbsp tahini (optional – for making hummus)", "½ garlic clove, crushed", "1 tsp olive oil", "1 tsp lemon juice, plus extra, to taste", "salt and pepper, to taste", "½ cucumber", "150ml/5fl oz plain yoghurt (or a dairy-free alternative) ", "1 tsp lemon juice", "small bunch fresh herbs such as mint, coriander or parsley (optional)", "10 cherry tomatoes (or 3 larger tomatoes)", "1-2 spring onions, chopped finely with scissors", "½ cucumber, chopped ", "½ mango, peel removed by an adult, chopped ", "handful of sweetcorn (fresh, tinned or frozen and defrosted) ", "small bunch herbs, such as mint, coriander or parsley, chopped (optional)", "1 tsp olive oil ", "squeeze lemon juice"], "serves": "Makes 3 dips", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Kid’s job: For the beany dip, place the chickpeas or beans into a bowl or a food processor. Blend or mash with a fork or masher (or the end of a rolling pin!) until the beans are a rough paste. Some beans will mash more easily than others. You can leave them chunky or keep going until they are smooth. Add the crushed garlic and tahini (if using) and mix well. To get the right “dippable” consistency add a teaspoon each of water, olive oil and lemon juice and mix well. Keep adding water, oil and lemon until the dip is the texture and taste you want. Add a little salt and pepper, to taste.", "Kid’s job: For the cucumber yoghurt dip, grate the cucumber with a rotary grater or box grater (a grown up should supervise this). Add to a bowl with the yoghurt, lemon juice, olive oil. Add any herbs if you like, chopped with scissors. Stir well and then taste- add more lemon or seasoning as needed.", "Kid’s job: For the fruity salsa, carefully chop the cherry tomatoes or big tomatoes into small pieces using a salad knife (a grown up should supervise this) stir the chopped tomatoes together with the chopped spring onions, cucumber, mango and sweetcorn. Mix in any chopped herbs you want to add, with a teaspoon of olive oil and have a taste. You may want to add a squeeze of lemon or a pinch of sugar.", "Serve the dips with crusty bread, strips of pitta bread for dipping or use as a topping for wraps and sandwiches."]}, {"isVegetarian": false, "title": "Three ways with puff pastry", "url": "www_bbc_co_uk_food_recipes_three_ways_with_puff_29378", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp gentlemen’s relish", "2 tsp double cream", "275g/9¾oz all-butter ready-rolled puff pastry", "1 free-range egg, beaten", "275g/9¾oz all-butter ready-rolled puff pastry", "125g/4½oz basil pesto", "200g/7oz baby mozzarella balls", "180g/6oz baby tomatoes on the vine", "1 bunch fresh basil, leaves only", "275g/9¾oz all-butter ready-rolled puff pastry", "100g/3½oz parmesan, finely grated", "100g/3½oz emmental, grated"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the anchovy palmiers, preheat the oven to 200C/400F/Gas 6.", "In a small bowl, mix the relish with the cream.", "Lay the puff pastry out on a clean work surface.", "Spread the mixture all over the pastry, leaving a 2cm/¾in border all around the edge.", "Starting at one end of the pastry, roll the pastry up towards the middle.", "Turn the pastry around and roll the other side up towards the middle to leave two even rolls of pastry meeting in the middle.", "Cut the rolled up pastry into 1cm/½ thick slices. Place each slice flat onto the work surface and flatten out slightly with a rolling pin.", "Place the pastry pieces onto a baking tray. Brush with the beaten egg.", "Transfer the pastry pieces to the oven and bake for 12-15 minutes, or until golden-brown and crisp. Remove from the oven and leave to cool.", "For the tomato and mozzarella tarts, line a baking tray with baking parchment. ", "Using a 5cm/2in cutter, cut out eight circles from the puff pastry and place on the lined baking tray. ", "Place a teaspoon of pesto in the centre of the circles, leaving a 1cm/½in border. ", "Place a mozzarella ball on top and place a cherry tomato on top of that. Brush with egg wash around the edges.", "Place in the oven for 12-15 minutes. Once cooked, remove and garnish with fresh basil leaves.", "For the cheese straws, lay the puff pastry on a work surface and brush the whole sheet of pastry with egg wash.", "Leaving a 2cm/¾in border around the edge, sprinkle the pastry with the two cheeses. ", "Cut the pastry into strips 2cm/¾in wide, twist each one and place on a greased baking tray.", "Place in the oven to cook for 8-10 minutes, or until golden brown. ", "To serve, place the palmiers, tarts and cheese straws on a plate and serve."]}, {"isVegetarian": true, "title": "Three Chimneys shortbread", "url": "www_bbc_co_uk_food_recipes_threechimneysshortbr_11894", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["375g/13oz plain flour", "125g/4oz white rice flour", "375g/13oz slightly salted butter", "125g/4oz caster sugar"], "serves": "Makes 24", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cream the butter and sugar together until pale and fluffy.", "Work the sifted the flour and rice flour into the creamed mixture until it forms a firm paste.", "Knead it lightly on a well-floured board.", "Roll it out until quite thin (0.5 cm thick) and cut biscuit shapes with cutter of your choice.", "Using a palette knife, lift the biscuits onto a well-buttered baking sheet and prick with fork.", "Bake on the centre shelf of a moderate oven, 190C/375F/Gas 5, until pale golden in colour.", "Remove from oven and sprinkle liberally with caster sugar while still warm. Lift on to wire tray to cool and firm-up. Store in an airtight tin."]}, {"isVegetarian": true, "title": "Throw-together banoffee pie", "url": "www_bbc_co_uk_food_recipes_throwtogetherbanoffe_92446", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/throwtogetherbanoffe_92446_16x9.jpg", "ingredients": ["300g/10½oz oat or ginger biscuits", "60g/2¼oz butter", "450g/1lb jar dulce de leche (sweet toffee sauce), available from Spanish delicatessens and some supermarkets", "3 large ripe bananas, peeled, sliced", "350ml/12¼fl oz double cream", "1 tbsp icing sugar", "100g/3½oz dark chocolate, grated, to serve"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Place the biscuits into a freezer bag and crush using a rolling pin until they resemble breadcrumbs. ", "Melt the butter in a small saucepan over a low to medium heat. ", "Mix together the crushed biscuits and melted butter in a bowl until well combined. Spoon the mixture into the bottom of a tart tin and press down to form an even layer. ", "Spread the dulce de leche evenly over the biscuit base. ", "Arrange the sliced bananas in an even layer on top of the dulce de leche. Cover the tart tin with cling film and chill in the fridge for one hour. ", "When the banoffee base has chilled, whip the cream and icing sugar until soft peaks form when the whisk is removed. Spread the whipped cream over the bananas. ", "Just before serving, sprinkle over the grated chocolate."]}, {"isVegetarian": true, "title": "Thyme and garlic-roasted vegetables", "url": "www_bbc_co_uk_food_recipes_thymeandgarlicroaste_92892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "½ small swede, peeled and cut into small cubes", "½ baking potato, peeled and cut into small cubes", "2 garlic cloves, peeled, chopped", "sprig fresh rosemary", "3 sprigs fresh thyme", "handful broccoli florets", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in an ovenproof pan and gently fry the swede, potato, garlic and herbs for 6-8 minutes, stirring regularly. ", "Add the broccoli florets, season, to taste, with salt and freshly ground black pepper, then transfer to the oven to cook for a further 8-10 minutes, or until the vegetables are tender."]}, {"isVegetarian": true, "title": "Thyme and parsley stuffing", "url": "www_bbc_co_uk_food_recipes_thymeandparsleystuff_13559", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, peeled and  finely chopped ", "1 tbsp vegetable oil", "2 tsp chopped fresh parsley", "2 tsp chopped fresh thyme leaves", "85g/3oz fresh white breadcrumbs", "salt and freshly ground black pepper", "1 egg, beaten"], "serves": "1 serving", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sweat the onion in the oil until soft but not coloured. ", "Mix the onion with the breadcrumbs and herbs and season well. Stir in enough egg to bind.", "Use to stuff meat or poultry, or roll into individual stuffing balls - cook these in the roasting tin with the meat for 30 minutes at the end of the cooking time. "]}, {"isVegetarian": true, "title": "Thyme-buttered cabbage", "url": "www_bbc_co_uk_food_recipes_thymebutteredcabbage_90385", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thymebutteredcabbage_90385_16x9.jpg", "ingredients": ["200ml/7fl oz vegetable or chicken stock ", "¼ cabbage, shredded", "100ml/3½fl oz double cream", "2 tbsp chopped fresh thyme", "25g/1oz butter, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Bring the stock to the boil in a saucepan, then add the cabbage. Reduce to a simmer and cook for 5-7 minutes, or until softened, then stir in the cream and thyme. ", "Cook for a further 2-3 minutes, or until the cabbage is completely softened, then stir in the butter. Serve."]}, {"isVegetarian": false, "title": "Tielle sétoise (squid and tomato pie)", "url": "www_bbc_co_uk_food_recipes_tielle_setoise_42164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz cold unsalted butter, cubed and left to soften slightly", "500g/1lb 2oz good quality plain flour", "2 tsp salt", "2 free-range eggs, yolks only", "100ml/3½fl oz ice-cold water", "1 small squid (500g/1lb 2oz), cleaned, tentacles reserved and squid sliced into thin rings", "½ celery stalk, sliced", "2 small onions, finely chopped", "3 garlic cloves, finely chopped", "40ml/1½fl oz olive oil", "75ml/2½fl oz dry white wine", "500g/1lb 2oz tomatoes, blanched and refreshed, skin and seeds removed, flesh roughly chopped", "25g/1oz pitted black olives, chopped", "¾ tbsp light brown sugar", "salt and freshly ground black pepper", "1½ tsp paprika", "1 free-range egg, yolk only", "2 fennel bulbs, thinly sliced", "½ bunch fresh mint, leaves picked", "1 lemon, zest and juice", "3 tbsp olive oil"], "serves": "Serves 3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pastry, combine the flour and salt on a work surface add the butter and work the dough with your fingertips until the mixture has a texture like sand or resembles breadcrumbs.", "Make a well in the mixture, place the egg yolks and water in the centre and mix using one hand starting from the centre of the well. ", "Bring the dough together into a smooth ball. ", "Let it rest in the refrigerator, covered in plastic wrap, for 30 minutes before using. (It will keep in the refrigerator for one week covered in plastic wrap.)", "In a heavy-based frying pan, gently fry the squid, celery, onion and garlic in three quarters of the olive oil for 2-3 minutes without colouring the squid. Add the white wine, tomatoes, black olives and sugar. Cook over a low heat for one hour (the mixture needs to stew together well). Allow to cool and season to taste with salt and freshly ground black pepper.", "Combine the paprika with the remaining olive oil and set aside.", "Preheat the oven to 180C/350F/Gas 4 and line a baking tray with baking paper.", "From the pastry roll out two circles about 20cm/8in wide and about 3mm/1/8 inch thick. Put one piece of pastry on the prepared tray. Spread the squid mixture over the pastry, leaving a 1cm/½in border all around. Glaze the edges with the egg yolk. Cover with the second piece of pastry and seal the two rounds of pastry dough together by pinching the edges, and then roll them inward so they stick together.", "Brush the tielle with the paprika oil and bake for 30 minutes.", "For the fennel and mint salad, place the sliced fennel and mint leaves in a bowl.", "Put the lemon zest and juice in a small glass bowl along with the oil and whisk.", "Pour the dressing over the fennel and mint and mix together.", "To serve, place the tielle sétoise on a serving board and pile the salad next to it."]}, {"isVegetarian": false, "title": "Thyme flavoured chicken breast with wild mushroom sauce and olive oil mash", "url": "www_bbc_co_uk_food_recipes_thymeflavouredchicke_8357", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red chilli finely diced ", "100ml/3½fl oz olive oil ", "4 chicken breasts ", "Butter ", "Olive oil ", "¼ onion, chopped ", "3 tbsp balsamic vinegar ", "150 ml red wine (optional) ", "700ml/1 pt and 5 ¼fl oz chicken stock ", "300g/14oz wild mushrooms of your choice ", "Handful of flatleaf parsley, chopped ", "Sprig of thyme ", "Salt and black pepper ", "Mashed potato ", "Sugar snap peas"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Prepare the chilli oil for the sugar snap peas by simply infusing the chilli in the hot oil. Set aside. ", "Pan-fry the chicken breasts in butter and olive oil. ", "Meanwhile sauté the onions in a little butter until they are well coloured. De-glaze the pan with the red wine and/or balsamic vinegar. Add the chicken stock and reduce by half. ", "Prepare the mushrooms (do not wash them they will become waterlogged) simply wipe them with a damp cloth to remove any dirt, clean any stubborn bits with a toothbrush. Slice and sauté the mushrooms in a very hot pan with a little butter and oil. The heat must be really high to drive off any liquid, you don t want them to stew. ", "Once the chicken is cooked and the stock reduced, strain the liquid, add the cooked mushrooms and finish with the chopped parsley. Season to taste, adding a knob of butter if the sauce tastes too strong. ", "To serve, add some olive oil to the mash and stir well, place some of the potato in the centre of a serving plate. Slice each chicken breast in half diagonally and place on top of the potato. Spoon the sauce around and serve with the sugar snap peas as prepared below. Cook the sugar snap peas briefly so that they retain their colour and texture. Drizzle over the chilli oil and serve in a bowl alongside the chicken."]}, {"isVegetarian": false, "title": "Tiger prawns, red pepper sauce and a yoghurt dressing", "url": "www_bbc_co_uk_food_recipes_tiger_prawns_red_pepper_43041", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz shallots, sliced", "300g//10½oz roasted red peppers from a jar, sliced", "70g/2½oz garlic, thinly sliced ", "½ tsp cayenne pepper", "100ml/3½fl oz olive oil", "8 large tiger prawns ", "250g/9oz fat-free Greek-style yoghurt", "2 garlic cloves, crushed or finely chopped", "1 large shallot, very finely chopped", "2 tbsp white wine vinegar", "2 tbsp lemon juice", "2 tbsp freshly chopped flatleaf parsley", "2 tbsp chopped fresh chives", "1 tbsp chopped fresh mint", "5 tbsp extra virgin olive oil", "sea salt flakes", "5 generous handfuls mixed green leaves", "5 radishes, thinly sliced", "1 fennel bulb, thinly sliced", "sea salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put all the sauce ingredients, except the prawns, in a saucepan, cook gently until the shallots are soft then bring to the boil. Transfer the mixture to a blender and blend until smooth. Pass the sauce through a sieve into a bowl. Marinade the prawns in the sauce for 10 minutes.", "For the dressing, combine the yoghurt, 125ml/4fl oz cold water, garlic, shallot, vinegar, lemon juice, parsley, chives and mint. Whisk in the olive oil and season with salt, to taste. ", "To cook the prawns, heat a flat griddle pan until very hot. Push the prawns onto two skewers and cook on each side for 3–4 minutes.", "Meanwhile for the salad, place the greens, radishes and fennel in ice-cold water for a few minutes to crisp up. Remove, drain and pat dry. ", "Combine in a salad bowl and spoon the dressing down the sides. Toss the salad using your hands, pulling the dressing off the sides of the bowl as you do. Season with salt and pepper. ", "Serve the prawns on top of the salad."]}, {"isVegetarian": false, "title": "Tidy Friday pan fry", "url": "www_bbc_co_uk_food_recipes_tidyfridaypanfry_92229", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 tbsp olive oil", "6 bacon rashers ", "4 sausages, cooked", "1 large onion, or a couple of large spring onions", "4 small potatoes, or 2 large ones", "1 handful of any bright greens, such as cabbage ", "1 large handful fresh parsley, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat some olive oil in a non-stick pan. Roughly chop the bacon, sausages and onion and add to the oil. Add the potatoes unpeeled, if you like, so that the skins go crisp. Keep on a low heat. Don't stir too much so that the juices have a chance to caramelise a little. ", "Roughly chop the greens and gently boil them in a separate pan - just a couple of minutes usually.  Drain the greens and add to the pan fry. Top with chopped parsley. Gently stir all the ingredients together and increase the heat until the meat is a little crisp. Serve straightaway."]}, {"isVegetarian": false, "title": "Langoustine and samphire stir fry", "url": "www_bbc_co_uk_food_recipes_tigerprawnandsamphir_89272", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tigerprawnandsamphir_89272_16x9.jpg", "ingredients": ["1 tbsp groundnut oil", "2 garlic cloves, finely chopped", "6-8 cooked langoustines (or other large prawns)", "1 tsp Shaoxing rice wine", "150g/5oz fresh samphire, woody stems removed, or marsh samphire, preserved in brine ", "150g/5oz baby leeks, trimmed", "2 spring onions, trimmed and cut into 4cm/2in pieces", "1 tsp light soy sauce", "sea salt, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok until smoking and add the groundnut oil. Add the garlic and stir fry for a few seconds. ", "Add the Dublin Bay prawns and stir fry for 1-2 minutes, then add the Shaoxing rice wine and cook for another few seconds. Stir in the fresh samphire, then add the leeks and spring onions. Stir fry for one minute, then season, to taste, with the light soy sauce and sea salt.", "To serve, spoon onto a serving plate and drizzle over any remaining juices from the wok."]}, {"isVegetarian": false, "title": "Tiger prawn linguine with tomatoes and fresh herbs", "url": "www_bbc_co_uk_food_recipes_tigerprawnlinguinewi_90112", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 shell-on tiger prawns", "200ml/7fl oz boiling water", "3 tbsp olive oil, plus extra for drizzling", "4 garlic cloves, whole", "85g/3oz baby plum tomatoes, chopped", "1 tbsp tomato purée", "½ fish stock cube", "½ lemon, juice only", "2 tbsp chopped fresh parsley", "salt and freshly ground black pepper", "200g/7oz dried linguine, cooked according to packet instructions"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Devein the prawns, then remove the shells and heads and reserve. Place the shells and heads into a pan with the boiling water and bring to the boil, then reduce the heat and simmer for 5-10 minutes. Strain the liquid through a sieve and reserve the liquor. Discard the heads and shells.", "In a separate pan, heat the oil over a low heat and add the garlic, cooking gently for 3-4 minutes. Remove the garlic from the oil, turn up the heat and add the prawns. Cook for 1-2 minutes, or until the prawns are beginning to turn pink, then stir in the chopped tomatoes and add the tomato purée.", "Dissolve the stock cube in the prawn stock and pour into the pan with the prawns. Cook for 3-4 minutes, then stir in the lemon juice, parsley and season with salt and freshly ground black pepper. Stir in the cooked linguine. ", "Serve the linguine with a drizzle of olive oil."]}, {"isVegetarian": false, "title": "Tiger prawn jambalaya", "url": "www_bbc_co_uk_food_recipes_tigerprawnjambalaya_68037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 raw tiger prawns, shell on, fresh or frozen, or you could use cooked Mediterranean prawns in their shells ", "4oz/110g chorizo sausage, peeled and cut into 3/4 inch (2 cm) pieces ", "1-2 tablespoons olive oil ", "1 medium onion, peeled and cut into 1/2 inch (1 cm) slices ", "2 cloves garlic, peeled and crushed ", "2 sticks celery, trimmed and sliced into 1/2 inch (1 cm) pieces on the diagonal ", "1 green chilli, deseeded and finely chopped ", "1 yellow pepper, deseeded and cut into 1/2 inch (1 cm) slices ", "6fl oz/175ml white basmati rice ", "1 tsp Tabasco sauce ", "3 medium tomatoes, dropped into boiling water for 1 minute, then peeled and chopped ", "1 bay leaf ", "1 tbsp roughly chopped flat-leaf parsley, to garnish ", "2 spring onions, trimmed and finely sliced, to garnish ", "salt and freshly milled black pepper "], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Begin by bringing a pan with 1 pint (570 ml) of water to simmering point. If using raw prawns, drop them into the water for 3 minutes. After that, remove them with a draining spoon, reserving the cooking liquid. (Cooked prawns will not need this pre-cooking.) Now set aside two whole prawns and shell the rest. To do this, just remove the heads by giving them a sharp tug, then simply peel off the rest - which comes away very easily - but leave the tails intact as this makes them look nicer. Now remove the black vein from the back of each prawn, which will come away easily using the point of a sharp knife. Next place the shells in the pan of water and simmer for 30 minutes, without a lid, to make a nice prawn-flavoured stock, then drain and discard the shells. Pour the hot stock into a jug and cover with a plate to keep warm.", "Now heat the frying pan over a high heat and brown the pieces of chorizo sausage, without adding any fat, then remove them from the pan to a plate and set aside. Then add a tablespoon of the oil and, when it's hot, fry the onions for 2-3 minutes to brown them a little at the edges, then return the chorizo to the pan and add the garlic, celery, chilli and sliced pepper. Continue to fry for 4-5 minutes, till the celery and pepper are also softened and lightly tinged brown at the edges, adding a little more oil if you need to.  ", "Now stir in the rice to get a good coating of oil, then measure out 12 fl oz (340 ml) of the reserved stock and add the Tabasco to it. Next add the chopped tomatoes and bay leaf to the pan, then pour in the stock. Season with salt and freshly milled black pepper, give it all one stir and push the rice down into the liquid. Now turn the heat to low, put a lid on and let it barely simmer for 20 minutes.", "Then, check the rice is cooked and return the shelled and the two reserved shell-on prawns to the pan, adding a little more stock if necessary. Cover with a lid for 5 more minutes, then serve garnished with the chopped parsley and spring onions."]}, {"isVegetarian": false, "title": "Tiger prawns steamed in beer with hollandaise sauce and griddled asparagus", "url": "www_bbc_co_uk_food_recipes_tigerprawnssteamedin_83694", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350ml/12¼fl oz bottle of beer", "8 large wild tiger prawns, shells on", "salt and freshly ground black pepper", "1 tbsp olive oil", "12 stems asparagus", "125g/4½oz butter, melted", "2 tsp lemon juice", "2 tsp white wine vinegar", "2 large free-range egg yolks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Pour the beer into the base of a steamer.", "Place the prawns in a bowl, season with salt and freshly ground black pepper and drizzle with a little olive oil.", "Place prawns in the steamer basket on top of the steamer with a lid on and cook for 5-6 minutes until just cooked through. Meanwhile, heat a griddle pan until hot.", "Toss the asparagus in the remaining olive oil and season with salt and freshly ground black pepper.", "Place on the griddle pan and grill for 3-4 minutes until tender.", "For the hollandaise, place the butter in a saucepan and bring to a simmer.", "Place the lemon juice and vinegar into a separate small pan and heat until just boiling.", "Place the egg yolks into a food processor with a pinch of salt and turn on.", "With the motor running add the hot lemon and vinegar. Then slowly add the melted butter until it is all incorporated. Remove from the processor and season with a little salt and black pepper.", "Serve two large prawns each with three asparagus spears and a drizzle of hollandaise sauce."]}]