[{"ingredients": ["Harina integral autorreflectante de 170g / 6oz", "Harina natural 170g / 6oz", "½ cucharadita de sal", "½ cucharadita de bicarbonato de soda", "Suero de leche de 290 ml / ½ pinta"], "method": ["Precalentar el horno a 400F / 200C / Gas 6.", "Incline las harinas, la sal y el bicarbonato de soda en un tazón grande y revuelva.", "Haga un pozo en el centro y vierta el suero de leche, mezclándolo rápidamente con un tenedor grande para formar una masa suave. (Dependiendo de la absorbencia de la harina, es posible que deba agregar un poco de leche si la masa parece demasiado dura pero no demasiado húmeda o pegajosa).", "Dé vuelta a una superficie ligeramente enharinada y amase brevemente.", "Forma una ronda y aplana la masa ligeramente antes de colocarla en una bandeja para hornear ligeramente enharinada.", "Corta una cruz en la parte superior y hornea durante unos 30 minutos o hasta que el pan suene hueco al tocarlo. Dejar enfriar sobre una rejilla."], "url": "www_bbc_co_uk_food_recipes_irishsodabread_67445", "title": "Pan de soda Irlandes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/irishsodabread_67445_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aproximadamente 1 kg / 2¼ lb scrag end o cuello de cordero en el hueso", "2 zanahorias", "1 cebolla grande", "2 palitos de apio", "1 parecía", "2-3 dientes de ajo, aplastados", "1 hoja de laurel grande", "1 ramita grande de tomillo fresco", "sal marina y pimienta negra recién molida", "Zanahorias pequeñas de 150g / 5oz", "150 g / 5 oz de bebé o cebollas en vinagre", "1 papa grande y harinosa, aproximadamente 300 g / 10 oz de peso, pelada y cortada en cubitos finamente", "2 cebollas de primavera, en rodajas finas", "un poco de perejil fresco picado"], "method": ["Con un cuchillo de deshuesar delgado y filoso, quite la mayor cantidad de carne posible de los huesos de cordero. Picar finamente y apartar.", "Pon los huesos en una olla grande. Pica las zanahorias, la cebolla grande, el apio y el puerro y luego colócalas en la olla con el ajo y las hierbas. Cubra con al menos 4 litros / 7 pintas de agua fría. Llevar a ebullición, sazonar ligeramente, luego hervir a fuego lento, destapado durante un máximo de dos horas. Desnata con una cucharada grande si es necesario. Deje que el líquido hierva a fuego lento hasta que se reduzca en casi dos tercios. Necesitas alrededor de 1,2 litros / 2 pintas de caldo dulce encantador.", "Cuele y deseche los huesos, etc. Lo ideal es enfriar y enfriar el caldo, luego puede raspar cualquier grasa que se haya asentado en la parte superior.", "Coloque la carne de cordero en una olla grande y cubra con agua fría. Llevar a ebullición lentamente, quitar cualquier residuo, verter inmediatamente en un colador y enjuagar con agua corriente fría. Este escaldado elimina la grasa.", "Regrese la carne a la sartén y cúbrala con el caldo y llévela a ebullición. Baje el fuego y cocine a fuego lento parcialmente cubierto, durante aproximadamente 30 minutos, o hasta que estén tiernos.", "Mientras tanto, pele las zanahorias y córtelas en pequeños trozos o forme \"barriles\" limpios. Pele las cebollas bebé, ayuda a blanquearlas en agua hirviendo durante un minuto para pelarlas fácilmente. Agregue las zanahorias pequeñas y cebollas bebé a la sopa y cocine por otros cinco minutos.", "A continuación, agregue la patata en cubos y cocine durante otros 10-15 minutos, hasta que comience a disolverse en la sopa y espese. Por último, revise el condimento, agregue mucha pimienta negra aromática y un poco de sal marina. Adorne con rodajas de cebolleta y perejil."], "url": "www_bbc_co_uk_food_recipes_irishstew_67437", "title": "estofado irlandés", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 17fl oz Irish stout", "200ml / 7fl oz de leche condensada", "10 cubitos de hielo", "canela molida o nuez moscada recién rallada, para rociar"], "method": ["Vierta la cerveza irlandesa y la leche condensada en una licuadora y agregue el hielo. Pulso por un minuto hasta que esté liviano y espumoso.", "Para servir, vierta en vasos y espolvoree con un poco de canela molida o nuez moscada recién rallada."], "url": "www_bbc_co_uk_food_recipes_irishstoutpunch_87001", "title": "Ponche fuerte de Irlanda", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 tallos de limoncillo, capa exterior resistente eliminada, capas internas finamente cortadas", "1 cucharadita de sal", "1 cucharadita de azúcar en polvo", "6 dientes de ajo, finamente picados", "3 raíces frescas de cilantro o 6 tallos de cilantro, finamente picados", "1 cucharada de pimienta negra molida", "1 cucharada de salsa de pescado", "4 pechugas de pollo sin hueso, con la piel puesta, cada una cortada en 4 piezas", "4 muslos de pollo sin hueso, con la piel puesta, partidos por la mitad", "4 cucharadas de cacahuetes crudos sin piel o anacardos crudos", "Jengibre fresco de 3cm / 1¼ en pieza, finamente picado", "2 chiles frescos, sin semillas, finamente picados", "4 chalotes, finamente picados", "1 cucharada de azúcar de palma o azúcar moreno", "1 cucharada de salsa de soja oscura", "3 cucharadas de pulpa de tamarindo", "3 cucharadas de agua tibia", "aceite vegetal, para freír", "250g / 9oz de cuajada de habichuelas", "Mangetout de 200 g / 7 oz, cortado, finamente cortado", "Brotes de soja 150 g / 5 oz, recortados, enjuagados", "1 pepino grande, sin semillas, finamente cortado", "1 pimiento rojo dulce, sin semillas, en rodajas finas", "2 cebollas tiernas, finamente picadas", "puñado de hojas frescas de cilantro"], "method": ["Para el pollo, usando un mortero y una mano, machaque la hierba de limón con la sal y el azúcar para hacer una pasta áspera. Agregue la raíz o los tallos de ajo y cilantro y continúe amasando hasta obtener una pasta. Agregue los granos de pimienta negra triturados y la libra hasta que tenga una pasta semi-suave. Finalmente, agregue la salsa de pescado y mezcle hasta que esté bien mezclado.", "Frote las piezas de pollo a fondo con la pasta, y marinado, cubierto, en el refrigerador durante al menos dos horas.", "Precalienta una parrilla con rejilla de hierro fundido hasta que esté caliente, pero no demasiado caliente. Alternativamente, encienda una barbacoa al aire libre y espere hasta que las llamas se hayan apagado y los carbones se pongan blancos.", "Coloque el pollo en la sartén o en la barbacoa donde no esté demasiado cerca del calor directo. Cocine el pollo en la sartén de la parrilla o sobre la barbacoa lentamente para impartir un sabor ahumado y permita que el adobo se caramelice.", "Convierta las piezas de pollo con frecuencia (cada tres minutos aproximadamente) para evitar que se quemen. Cocine durante 10-15 minutos, o hasta que esté cocido y caramelizado (el pollo se cocina cuando los jugos se hacen transparentes cuando el pollo se perfora en la parte más gruesa con un pincho).", "Para el aderezo, seque las nueces en una sartén de base pesada (sin aceite) a fuego medio hasta que estén doradas. Agite la sartén de vez en cuando, teniendo cuidado de no quemar las nueces. Retirar del fuego y dejar enfriar las nueces.", "Usando un mortero y una mano, muele el jengibre, los chiles y los chalotes hasta obtener una pasta. Agregue las nueces tostadas y continúe aplastando, luego agregue el azúcar de palma y trabaje hasta que quede suave. Agregue los ingredientes restantes del aderezo y mezcle. El aderezo será dulce, caliente, salado y agrio.", "Para la ensalada de cuajada de habichuelas, llene a medias una sartén profunda de base pesada con aceite vegetal y caliente hasta que un cubo de pan caiga en chispas y se vuelva marrón dorado en 30 segundos. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Seque la cuajada de habichuelas con papel de cocina, luego fría en aceite caliente durante 4-5 minutos o hasta que se dore por todas partes. Retirar con una cuchara ranurada, escurrir sobre papel de cocina y cortar en rodajas de ½ cm.", "Poner a hervir una olla de agua con sal. Cocine los brotes de mangetout y de frijoles en agua hirviendo durante 30 segundos, luego revuelva rápidamente con agua fría para evitar que sigan cocinando. Mezcle las verduras blanqueadas con el pepino y el pimiento rojo. Esparce sobre las rebanadas fritas de cuajada de soja, las cebolletas y las hojas de cilantro.", "Para servir, espolvorea la nuez tostada y el aderezo de tamarindo sobre la ensalada y apila el pollo al costado. La ensalada se come mejor inmediatamente."], "url": "www_bbc_co_uk_food_recipes_isaanstylegrilledchi_91586", "title": "Pollo asado estilo Isaan (kai yaan) y ensalada de cuajada de habichuelas al estilo Nonya (taukwa goreng)", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 tomates de carne", "1 chalote, finamente picado", "500g / 1lb 2oz de carne de cordero", "25g / 1oz de pan rallado fresco", "300g / 10½ oz champiñones, finamente picados", "3 cucharadas de estragón fresco picado", "sal y pimienta negra", "25ml / 1fl oz de aceite de oliva", "8 tomates medianos (preferiblemente tomates Island Beauty), cortados en cuartos", "50ml / 2fl oz de aceite de colza", "2-3 dientes de ajo, finamente picados"], "method": ["Precalentar el horno a 200C / 400F / Gas 6 o preparar una barbacoa.", "Corta la parte superior de los tomates de carne, reservando las tapas para usarlas como tapas más adelante. Saque la carne y las semillas del centro y colóquelas en una cacerola.", "Mezcle la chalota, la carne picada, el pan rallado, los champiñones y el estragón en un tazón. Sazonar con sal y pimienta negra recién molida.", "Rellene los tomates con la mezcla de carne picada (no llene en exceso ya que la mezcla se expandirá al cocinar y podría dividir la piel), rocíe con aceite y coloque los párpados en la parte superior.", "Coloque los tomates rellenos en una barbacoa durante 10-15 minutos, o hasta que la carne esté completamente cocida. Alternativamente hornee en el horno por el mismo tiempo.", "Para hacer la salsa, agregue los tomates a la cacerola que contiene la carne de los tomates de carne, luego agregue el aceite y el ajo. Sazonar con sal y pimienta y llevar a ebullición. Cocine a fuego lento durante 10 minutos.", "Para servir, coloque los tomates disecados en un plato grande para servir y rocíe alrededor de la salsa."], "url": "www_bbc_co_uk_food_recipes_isle_of_wight_stuffed_79263", "title": "Tomates rellenos de la isla de Wight", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 5", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/isle_of_wight_stuffed_79263_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 chiles rojos secos, sin semillas", "1 chalote pequeño, cortado en cubitos", "3 dientes de ajo", "1 cucharada de galanga, picada", "2 tallos de limoncillo, hojas externas eliminadas, finamente picadas", "1 lima, jugo y ralladura solamente", "2 cucharaditas de cilantro fresco picado, usa la raíz si puedes", "½ cucharadita de granos de pimienta blanca", "1 cucharadita de semillas de cilantro", "½ cucharadita de semillas de comino", "2 cucharaditas de pasta de camarones tailandeses", "200g / 7oz de fideos de arroz secos", "4 cucharadas de aceite de cacahuete", "2 cucharaditas de vinagre de arroz", "1 cucharada de jengibre fresco picado", "½ cebolla, picada", "2 cucharaditas de pasta de curry rojo", "2 cucharadas de nam pla (salsa de pescado tailandés)", "1 cucharada de salsa de soja ligera", "Brotes de soja fresca 150 g / 5 oz", "2 cebollas tiernas, finamente cortadas", "110g / 4oz pak choi, finamente cortado", "Vieiras de reina de 500 g / 1lb 2 oz", "Gambas crudas de 200g / 7oz, peladas y desvainadas", "2 limas, cortadas en cuñas", "Cacahuetes tostados 50g / 2oz, aplastados"], "method": ["Para la pasta de curry rojo, coloque todos los ingredientes de la pasta de curry en una mano de mortero y moler hasta obtener una consistencia suave. (Alternativamente, use un molinillo de café o un mini procesador de alimentos).", "Para el taco tailandés, coloque los fideos de arroz en un recipiente con agua caliente, pero no hirviendo, y déjelos en remojo durante diez minutos, o hasta que estén tiernos pero no demasiado blandos, o se deshacen cuando se cocinan.", "Escurra los fideos y refresque con agua fría, luego drene nuevamente y colóquelos en un tazón.", "Agregue una cucharada de aceite de cacahuete y vinagre de arroz a los fideos y mezcle bien: el aceite de cacahuete y el vinagre evitarán que se peguen entre sí.", "Caliente un wok y agregue dos cucharadas de aceite, jengibre y cebolla y cocine hasta que estén suaves. Agregue la pasta de curry y cocine durante 2-3 minutos más.", "Agregue los fideos y cubra bien con la mezcla de cebolla, jengibre y pasta de curry. Agregue la salsa de pescado y la salsa de soja.", "Agregue los brotes de soja, la cebolla tierna y el pak choi y cocine durante 2-3 minutos más.", "Mientras tanto, caliente el aceite de cacahuete restante en una sartén. Agregue las vieiras y las gambas y saltee durante un minuto, o hasta que estén completamente cocidas. Agregue las vieiras y gambas al wok y revuelva.", "Para servir, divida la almohadilla thai entre cuatro platos para servir y decore con los cacahuetes tostados triturados y las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_isleofmanqueeniescal_87332", "title": "Almohadilla de vieira de la reina de la isla de man tailandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de harina natural", "1 cucharadita de pimentón ahumado", "1 cucharadita de mostaza en polvo", "2 huevos de gallinas camperas, golpeados", "100g / 3½oz de pan rallado fino seco o harina de matzá", "1 cucharada de semillas de sésamo", "4 pechugas de pollo grandes, con mariposa y aplastadas", "sal", "aceite vegetal, para freír", "2 dientes de ajo, finamente picados", "2 yemas de huevo", "1 cucharadita de mostaza", "250ml / 9fl oz de aceite de girasol o maní", "exprimir jugo de limón o unas gotas de vinagre", "Col roja de 300 g / 10½ oz, rallada", "1 zanahoria, en juliana", "1 cebolla pequeña, finamente picada", "2 manzanas crujientes que comen, peladas, sin corazón y finamente picadas", "1 cucharada de jugo de limón", "1 cucharadita de semillas de comino", "2 cucharaditas de vinagre de sidra", "2 cucharadas de mayonesa de ajo (ver arriba)", "pizca de azúcar en polvo"], "method": ["Para el pollo, ponga la harina en un plato grande. Mezcle el pimentón ahumado, la mostaza en polvo y ½ cucharadita de sal. Coloque los huevos en un recipiente poco profundo y mezcle las migas de pan y las semillas de sésamo en otro recipiente poco profundo. Cubra cada pechuga de pollo con la mezcla de harina y seque todo exceso. Sumérgete en el huevo y luego en la mezcla de migas de pan. Dejar de lado.", "Vierta el aceite en una sartén grande hasta 2 cm / ¾ de profundidad. Calienta a una temperatura media. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión.) Esto es importante, demasiado caliente y el exterior se quemará antes de que el pollo esté cocido, demasiado frío y el recubrimiento simplemente absorberá el aceite. Para probar, agregue un cubo de pan al aceite caliente, debe ser crujiente y dorado después de 2-3 minutos.", "Freír el pollo durante 3-4 minutos en cada lado, o hasta que esté dorado. Es posible que tenga que hacer esto en tandas, de ser así, mantenga caliente el pollo cocinado en un horno bajo y asegúrese de que el aceite regrese a fuego medio antes de cocinar el segundo lote.", "Para la mayonesa de ajo, machaque el ajo hasta obtener una pasta con un poco de sal. Poner en un bol con las yemas de huevo y la mostaza y mezclar bien. Comience a lloviznar en el aceite, unas pocas gotas a la vez, batiendo constantemente, hasta que tenga una emulsión. Siga añadiendo el aceite, muy gradualmente, hasta que lo haya incorporado todo. Si la mayonesa se está volviendo grasosa o demasiado gruesa para trabajar, agregue unas gotas de agua tibia y mezcle bien antes de agregar más aceite. Pruebe y agregue más condimentos y un chorrito de limón o vinagre si necesita acidez.", "Para la ensalada de col, ponga la col lombarda, la zanahoria y la cebolla en un bol. Mezcle la manzana en el jugo de limón para evitar que se oscurezca, y agregue esto al repollo. Espolvoree las semillas de alcaravea y mezcle bien. Batir el vinagre con 2 cucharadas de mayonesa de ajo, el azúcar y la sal y la pimienta al gusto. Vierta esto sobre la ensalada de col y revuelva bien. Mantenga la mayonesa restante en el refrigerador, ya sea en un frasco o cubierta con una película adhesiva.", "Sirve el escalope con la ensalada de col al lado."], "url": "www_bbc_co_uk_food_recipes_israeli_chicken_76953", "title": "Escalope de pollo israelí con repollo rojo y ensalada de col de manzana", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/israeli_chicken_76953_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ pintas de jugo de zanahoria fresco", "2 puerros, cortados, picados", "2 patatas dulces, peladas, cortadas en piezas de 2cm / ¾in", "1 x 400 g / 14 oz pueden garbanzos, drenados y enjuagados", "Coco cremoso de 4 cm / 1½ pulgadas", "1 chile de bonete escocés, picado (retire las semillas que dan calor si lo desea)", "2cm / ¾ en pieza de raíz de jengibre fresco, pelado, finamente picado", "1 diente de ajo, finamente picado", "2 ramitas de tomillo fresco, solo hojas, finamente picadas", "grandes hojas de callaloo o hojas de espinaca, lavadas, trituradas (opcional)", "botón de mantequilla", "pimienta negra recién molida", "4 cucharaditas de crema agria o yogur al estilo griego", "1 cucharada de hojas de cilantro fresco picado"], "method": ["Llevar el jugo de zanahoria a ebullición en una sartén.", "Agregue los puerros, batatas, garbanzos, coco en crema, chile, jengibre, ajo y tomillo y reduzca el fuego a fuego lento. Cocine a fuego lento la mezcla durante 4-5 minutos.", "Agregue el callaloo triturado o las espinacas, si se usan, a la mezcla y continúe cocinando a fuego lento por otros 4-5 minutos, o hasta que los trozos de boniato estén tiernos.", "Una vez que los vegetales estén tiernos, la sopa puede servirse inmediatamente. Sin embargo, si prefiere una sopa gruesa y gruesa, machaque las verduras en la sopa ligeramente con un machacador de papas. Si prefiere una sopa suave, mezcle la mezcla en un procesador de alimentos hasta que quede suave. (NB: Es posible que necesite agregar jugo de zanahoria extra a la sopa si la machaca o mezcla, ya que se espesará considerablemente).", "Agregue la mantequilla a la sopa y revuelva hasta que se derrita, luego sazone, al gusto, con pimienta negra recién molida.", "Para servir, ponga la sopa de zanahoria y camote en cuatro cuencos. Adorne cada porción con una llovizna de crema agria o una cucharadita de yogur al estilo griego, luego espolvoree sobre el cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_italcarrotandsweetpo_91711", "title": "Sopa de zanahoria y camote ital", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "1 cebolla picada", "2 zanahorias medianas, cortadas en cubitos", "2 tallos de apio, cortados y cortados en cubitos", "2 dientes de ajo, aplastados", "12 salchichas de estilo italiano, carne retirada de las pieles", "1 cucharadita de hojuelas de chile seco", "1 cucharadita de orégano seco", "1 cucharadita de azúcar en polvo", "1 cucharada de harina normal", "150ml / 5fl oz de vino tinto", "300ml / 10fl oz de caldo de carne", "1 x 400 g / 14 oz pueden tomates cherry", "1 hoja de laurel", "1.5kg / 3lb 4oz tuétano", "15g / ½ oz de mantequilla", "15g / ½ oz de harina natural", "Leche 250ml / 9fl oz", "25g / 1oz de parmesano finamente rallado", "125 g / 4 oz de mozzarella, escurrida"], "method": ["Para hacer el relleno, caliente el aceite en una sartén antiadherente grande y fría la cebolla, las zanahorias y el apio durante 6-8 minutos hasta que la cebolla se ablande y comience a dorarse. Agregue el ajo y el aderezo de salchicha y cocínelos durante 3-4 minutos, revolviendo constantemente con una cuchara de madera para separar los grumos de carne.", "Agregue los copos de chile, el orégano, el azúcar y la harina común y cocine por un minuto. Vierta el vino tinto en la sartén, seguido de los tomates, el caldo y la hoja de laurel. Deje que hierva a fuego lento y cocine durante 30-40 minutos, revolviendo ocasionalmente hasta que la carne esté tierna y la salsa se haya espesado.", "Para la salsa de queso, derrita la mantequilla en una cacerola grande de base pesada y agregue la harina. Cocine a fuego lento durante unos 30 segundos, revolviendo constantemente. Poco a poco agregue la leche. Aumente un poco el fuego y cocine a fuego lento. Cocine por cinco minutos, revolviendo constantemente.", "Espolvoree sobre el parmesano y cocine a fuego lento durante 1-2 minutos más hasta que el queso se haya derretido. Sazone la salsa con sal y pimienta negra recién molida. Retire del fuego y cubra cuidadosamente la superficie de la salsa con film transparente para evitar que se forme la piel.", "Precalentar el horno a 190C / 375F / Gas 5.", "Lave bien la médula y colóquela en una tabla. Cortar por la mitad horizontalmente y raspar las semillas con una cuchara de postre. Corta una tira delgada de la parte inferior de una de las mitades para que quede plana sobre la tabla sin balancearse.", "Coloque una hoja de papel de cocina en una lata grande para hornear y coloque la médula de fondo plano en la parte superior, con el lado sin semillas hacia arriba. Coloca la mezcla de carne en el hueco y coloca la salsa de queso encima. Rompa la mozzarella en pedazos y acomódela en la parte superior. Cubra con la médula restante para encerrar por completo el relleno.", "Acerca el papel alrededor de la médula y pellizca los bordes para sellar. Hornee en el centro del horno durante 1-1¼ horas o hasta que la médula esté tierna y el relleno esté caliente.", "Con cuidado, levante la médula en un plato o tablero de servir y retire suavemente la lámina. Sirva la médula en rodajas gruesas con una ensalada verde fresca."], "url": "www_bbc_co_uk_food_recipes_italian-style_stuffed_63676", "title": "Tuétano de peluche al estilo italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "Brócoli 300 g / 10½ oz, cortado en floretes", "2 puerros pequeños, aproximadamente 300 g / 10½ oz en total, cortados, cortados y cortados en rodajas gruesas", "4 cucharadas de jugo de limón", "2 cucharadas de aceite de oliva", "2 cucharadas de miel clara", "1 cucharada de alcaparras, bien drenado", "2 cucharadas de estragón picado", "sal y pimienta recién molida"], "method": ["Coloque los huevos en una olla grande, cubra con agua fría y lleve a ebullición. Una vez que el agua esté hirviendo, cocine por otros 7-10 minutos. Cuando esté cocinado, sumerja los huevos en agua helada durante 1 minuto, retírelos y déjelos a un lado.", "Mientras tanto, coloca el brócoli en la parte superior de un barco a vapor, cocina por 3 minutos. Agregue los puerros y cocine por otros 2 minutos.", "Para el aderezo, mezcle el jugo de limón, el aceite, la miel, las alcaparras y el estragón en una ensaladera. Sazonar con sal y pimienta negra recién molida.", "Shell y más o menos corta los huevos.", "Agregue el brócoli y los puerros al aderezo y mezcle. Espolvorear con los huevos picados y servir."], "url": "www_bbc_co_uk_food_recipes_italian_broccoli_and_egg_38643", "title": "Ensalada italiana de brócoli y huevo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_broccoli_and_egg_38643_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Panettone 625g / 1lb 6oz (o pandoro)", "6 cucharadas de licor de tuaca (o ron, brandy o marsala)", "2 huevos de gallinas camperas, a temperatura ambiente", "75 g / 2½ oz de azúcar en polvo", "500g / 1lb 2oz mascarpone, a temperatura ambiente", "Crema doble de 250 ml / 9 fl oz, a temperatura ambiente", "125ml / 4½fl oz Marsala", "75g / 2¾oz de marrons glacés, picados (opcional)", "Mini trocitos de chocolate de 125g / 4½oz o chocolate finamente picado", "100 g / 3½ oz de pistachos picados", "2 cucharadas de semillas de granada"], "method": ["Con un cuchillo de sierra, corte el panettone aproximadamente en rodajas de 1 cm, luego use aproximadamente un tercio de estos para revestir la parte inferior de una lata con forma de resorte de 23 cm / 9 pulg. Separe las piezas para que no queden huecos: el panettone es fabulosamente suave y moldeable, por lo que no es un trabajo difícil. Rocíe dos cucharadas de Tuaca (u otro licor) sobre él para que el revestimiento del panettone se humedezca. Se ve como un hermoso mosaico dorado hecho de pastel.", "Ahora sigue con el relleno delicioso. Batir, utilizando una batidora eléctrica independiente para facilitar, los huevos y el azúcar hasta que estén muy espumosos y aumenten en volumen y ligereza.", "Más lentamente, mezcle el mascarpone y la crema doble, luego bata gradualmente en el Marsala y continúe batiendo hasta que la mezcla esté espesa y untable. Retire 250 ml (una buena taza) en un recipiente u otro recipiente, cubra y coloque en el refrigerador: esto es para la capa superior, que no se agrega hasta que sirva el pastel.", "Desmenuce los marrons glacés en el tazón grande de la mezcla de crema de mascarpone, seguido de 100 g de las chispas de chocolate y 75 g de los pistachos picados, y dóblelos. Use la mitad de este relleno cremoso para cubrir la capa de panettone que recubre la lata de la torta.", "Use otro tercio de las rebanadas de panettone para cubrir el relleno de crema, sin dejar agujeros para que la crema se escape. Humedezca con otras dos cucharadas de licor.", "Con una cuchara, coloca la otra mitad de la mezcla de crema y extiéndela uniformemente. Luego cubra con una tercera y última capa del pan dulce, cubriendo la crema como antes, y rocíe sobre ella las dos últimas cucharadas de licor. Cúbralo firmemente con film transparente, presione un poco sobre la parte superior y colóquelo en la nevera durante la noche o hasta dos días.", "Cuando esté listo para servir, saque el pastel del refrigerador, desmolde y siéntelo en un plato plano o en un soporte para pasteles, luego extiéndalo con la mezcla reservada de mascarpone. No intente levantar la torta de la base ya que las rebanadas de panettone en la parte inferior son demasiado deliciosamente húmedas.", "Esparza la parte superior, y alrededor de la tarta, si lo desea, con las virutas de chocolate restantes y los pistachos picados y sus joyas de granada. Estas salpicaduras también proporcionan un camuflaje hermoso para cualquier borde que no sea estéticamente edificante de la base de la base de resorte que puede ser visible."], "url": "www_bbc_co_uk_food_recipes_italian_christmas_20000", "title": "Pastel italiano de pudín de Navidad", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 0}, "serves": "Sirve 12-14", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_christmas_20000_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100ml / 3½fl oz de suero de leche", "1 cucharada de aceite de oliva, más extra para engrasar", "1 huevo de gallinas camperas, golpeado", "Harina normal de 50g / 2oz", "50g / 2oz de polenta seca de cocción rápida", "1 cucharadita de polvo de hornear", "pizca de pimienta negra recién molida", "50g / 2oz de queso de cabra suave", "pequeñas hojas de albahaca, rasgadas, más extra para servir", "1 cucharada de parmesano rallado o queso duro italiano similar", "pequeños pizcas de chile seco", "2 rebanadas de mozzarella, para servir", "1 tomate, en rodajas, para servir"], "method": ["Precaliente el horno a 220C / 450F / Gas 7. Engrase una lata pequeña de pan con aceite de oliva.", "Mezcle el suero de leche, el aceite de oliva y el huevo batido en un tazón grande hasta que estén bien combinados.", "En otro recipiente, mezcle la harina, la polenta, el polvo de hornear y la pimienta negra recién molida.", "Revuelva el queso de cabra, la albahaca, el parmesano y las hojuelas de chile en la mezcla de harina hasta que estén bien combinados.", "Agregue la mezcla de suero de leche a la mezcla de queso y bata bien, batiendo tan rápido como sea posible.", "Con una cuchara, la mezcla de pan de maíz en la lata de pan preparada y hornear en el horno durante 20-25 minutos, o hasta que estén doradas y cocidas (un pincho insertado en el centro del pan de maíz debe salir limpio).", "Sirva el pan de maíz en rebanadas con una ensalada de mozzarella, tomate y albahaca."], "url": "www_bbc_co_uk_food_recipes_italian_cornbread_02974", "title": "Pan de maíz italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paquete de 1 X 7g / ⅛oz de levadura seca", "1 cucharadita de azúcar", "500g / 1lb 2 oz de harina de pan blanco, más extra para la harina", "1 cucharada de aceite de oliva, más extra para engrasar", "1 cucharadita de sal marina", "5 cucharadas de parmesano rallado (o queso vegetariano similar)", "1 cucharada colmada de queso azul", "3 cucharaditas de condimento italiano", "3 cucharaditas de ajo en polvo", "2 cucharadas de jalapeños picados, de un tarro", "1 huevo de gallinas camperas", "50 g / 1¾oz de parmesano rallado (o queso duro vegetariano similar)", "2 cucharadas de ajo en polvo", "1 cucharadita de condimento italiano", "2 cucharaditas de jalapeño en polvo"], "method": ["Agregue la levadura y el azúcar a 280 ml / 10 oz de agua tibia en un tazón grande. Agregue 75g / 2½fl oz de la harina, bata y luego déjelo por diez minutos para que la levadura se active.", "Agregue el aceite y luego mezcle bien.", "Poco a poco agregue la harina restante, la sal, los quesos, el condimento italiano, el ajo en polvo y los jalapeños picados hasta que estén completamente incorporados.", "Voltee la masa sobre una superficie ligeramente engrasada y amase durante aproximadamente 5-8 minutos.", "Coloque la masa en un bol engrasado, cubra y deje por 30 minutos.", "Precalienta el horno a 190 ° C / 375 ° F / Gas 5. Aceite y enharina al menos dos bandejas para hornear.", "Para el problema, combine todos los ingredientes de frotar en un tazón pequeño.", "Estirar la masa hasta por lo menos 28 cm de largo. Cepille con la yema de huevo, espolvoree sobre el frote y presione suavemente para que se adhiera. Usando un cuchillo o un cortador de pizza, corte las tiras de la masa y sujételas desde cualquier extremo de la tira, gire la masa suave y rápidamente para crear una espiral y colóquela en una bandeja para hornear inmediatamente.", "Hornee durante 15-20 minutos, o hasta que los palitos de pan estén ligeramente dorados y se sientan firmes al tacto. Retire los palitos de pan del horno y deje que se enfríen en las bandejas para hornear."], "url": "www_bbc_co_uk_food_recipes_italian_grissini_86213", "title": "Palitos de pan italianos", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 10-15 palitos de pan", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva virgen extra", "50g / 1¾oz de cebollas rojas o cebolletas, más o menos picadas", "120 g / 4¼oz de salchicha Calabria o toscana suave y picante (o un chorizo ​​muy suave para cocinar), sin piel, carne desmenuzada", "50ml / 2fl oz de vino Marsala", "120 g / 4¼oz de habas, sin cáscara", "120g / 4¼oz de guisantes, sin cáscara", "1 puñado de albahaca, aproximadamente picada", "1 manojo de perejil de flautín, más o menos picado", "1 puñado de hojas de menta, más o menos picadas", "30 g / 1 oz de ricotta sarda de Cerdeña (disponible en delicatessen italianas) o un queso suave salado similar, ligeramente ahumado o un queso de cabra suave", "1 puñado de brotes de guisantes", "pellizcar semillas de hinojo negro", "sal marina y pimienta negra recién molida"], "method": ["Caliente 4 cucharaditas de aceite de oliva en una olla grande. Agregue las cebollas y una pizca de sal. Freír la cebolla a fuego lento hasta que esté suave y translúcida. Agregue la salchicha, suba el fuego a fuego alto y cocine hasta que las salchichas estén doradas por todos lados. Agregue el Marsala y déjelo evaporarse.", "Escalde las habas y los guisantes en agua hirviendo con sal durante 30 segundos. Escurrir bien y mezclar con la cebolla y las salchichas. Cubra la olla con una tapa y continúe cocinando a fuego medio durante aproximadamente 5 minutos.", "Agregue todas las hierbas y una cucharada de aceite de oliva. Condimentar con sal y pimienta.", "Para servir, coloque la mezcla de salchicha en platos calientes. Desmenuce la ricotta mustia y cubra con los brotes de guisantes y una pizca de semillas de hinojo."], "url": "www_bbc_co_uk_food_recipes_italian_sausage_broad_76643", "title": "Salchicha italiana, habas y guisantes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de lentejas verdes", "aceite de oliva, para freír", "1 cebolla, finamente picada", "3-4 dientes de ajo, finamente picados", "puñado de albahaca fresca, hojas enteras y tallos finamente picados", "400g de tomates cortados en lata", "400 ml / 14 fl oz de verduras o caldo de pollo", "sal y pimienta negra recién molida", "queso de oveja, rallado (opcional)"], "method": ["Agregue las lentejas a una olla grande y cubra con 5cm / 2in de agua. Cocine a fuego medio, no quiere hervir las lentejas, durante unos 20 minutos. Para probar si las lentejas están cocidas aplastar una entre los dedos, se debe sentir cremoso y no almidón. Sazone las lentejas con sal y pimienta.", "Calentar una olla grande y agregar el aceite. Agregue las cebollas y cocine a fuego medio hasta que estén suaves y doradas.", "Agregue los tallos de ajo y albahaca. Ten cuidado de no quemar el ajo. Una vez que el plato comience a oler fuertemente a ajo, agregue los tomates picados.", "Agregue las lentejas y el caldo y revuelva. Deja cocinar durante 5 minutos para que todos los sabores se casen.", "Sazonar con sal y pimienta y poner la sopa en cuencos. Cubra con queso de oveja rallado (si se usa), hojas de albahaca y un chorrito de aceite de oliva."], "url": "www_bbc_co_uk_food_recipes_italian_lentil_and_69054", "title": "Sopa de lentejas y tomate italiano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_lentil_and_69054_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 x 1,5 kg / 3 lb 5 oz de pollo (preferiblemente orgánico)", "1 limón no encerado, cortado por la mitad", "4 ramitas de romero", "3 puerros, lavados y cortados", "2 pimientos rojos", "1 pimiento naranja", "1 pimiento amarillo", "100g / 3½oz de aceitunas negras envasadas en seco", "4 cucharadas de aceite de oliva", "Escamas de sal marina y pimienta negra recién molida, para servir"], "method": ["Precalienta el horno a 200C / 400F / Gas 6. Retira el pollo, siéntalo en una lata para asar y coloca las mitades de limón y dos de las ramitas de romero en la cavidad del pollo.", "Lave y corte los puerros, corte cada uno en tres troncos, luego corte longitudinalmente y agregue a la lata. Ahora quite el núcleo y las semillas de los pimientos y córtelos en tiras, siguiendo sus curvas y crestas naturales, y agregue estos a la lata.", "Viértelo en las aceitunas, y ahora vierta el aceite de oliva, principalmente sobre las verduras, pero un poco sobre el pollo, también. Agregue las ramitas de romero restantes a las verduras, junto con algunos copos de sal marina y pimienta negra recién molida, al gusto. Con un par de cucharas o espátulas, agite suavemente las verduras para ayudar a cubrirlas con aceite y asegúrese de que todo esté bien mezclado.", "Espolvoree unos copos de sal marina sobre el pollo y póngalo en el horno durante aproximadamente 1-1 ¼ horas, momento en el cual el pollo debe estar cocido, y sus jugos se vuelven transparentes cuando se corta en la carne con un cuchillo pequeño y afilado en el más grueso parte de la articulación del muslo. Las verduras deberían estar tiernas por ahora, también, y algunos de los puerros serán de un color marrón claro quemado en algunas partes.", "Retire el pollo a una tabla de tallado y, mientras descansa (durante unos 10 minutos), vuelva a colocar la bandeja de verduras en el horno, apagando el horno mientras lo hace.", "Corta el pollo por completo, transfiriendo las piezas a un plato grande y caliente. Ahora saca la sartén del horno y, con una cuchara o espátula ranurada, retira las verduras a la fuente grande y, cuando todo esté preparado para tu deleite estético, vierte sobre él todos los jugos de bronce con sabor intenso que se han recogido en el horno. el pan."], "url": "www_bbc_co_uk_food_recipes_italian_roast_chicken_88087", "title": "Pollo asado italiano con pimientos y aceitunas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_roast_chicken_88087_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "175 g / 6 oz de aceite de coco virgen extra o mantequilla sin sal", "200ml / 7fl oz de miel o jarabe de arce", "150 g / 5½ oz de almendras molidas", "150g / 5½ oz de harina de espelta blanca", "½ limón sin cebar, solo cáscara", "2 cucharaditas de extracto de vainilla", "1 cucharadita de bicarbonato de soda", "1 cucharadita de polvo de hornear", "½ cucharadita de sal marina fina", "150 g / 5% C2% BDoz% 20dark% 20chocolate% 20 (mínimo% 2070 %% 20cocoa% 20solids),% 20broken% 20into% 20large% 20chunks", "Fresas de 250g / 9oz, descascadas y partidas por la mitad"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase los dientes y la línea con papel de hornear.", "Batir los huevos en una batidora de pie o con un batidor eléctrico, a alta velocidad durante 4-5 minutos, hasta que espese y aumente su volumen.", "Derretir el aceite de coco en una cacerola a fuego lento. Vierta en un tazón grande y mezcle la miel, las almendras, la harina, la ralladura de limón, la vainilla, el bicarbonato de soda, el polvo de hornear y la sal. Doble los huevos batidos hasta que se combinen.", "Vierta la mitad de la mezcla en la lata de la torta, espolvoree la mitad de los trozos de chocolate en la parte superior y cubra con la mitad de la mezcla restante de la torta.", "Coloque la mitad de las fresas en la parte superior, cubra con la mezcla de pastel restante y cubra con la mitad de los trozos de chocolate restantes y las fresas.", "Hornee durante 1 hora y 15 minutos o hasta que el pastel se sienta firme y vuelva a la superficie al tacto. Dejar enfriar en la lata durante 15 minutos. Retire de la lata y deje enfriar completamente en una rejilla de alambre antes de servir.", "Derrita el chocolate restante en un recipiente de vidrio sobre agua hirviendo, asegurándose de que el recipiente no entre en contacto con el agua. Rocíe sobre la torta enfriada y decore con las fresas frescas."], "url": "www_bbc_co_uk_food_recipes_italian_strawberry_and_51490", "title": "Pastel italiano de chocolate con fresa y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_strawberry_and_51490_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz% 20extra% 20lean% 20beef% 20mince% 20 (5 %% 20fat% 20or% 20less)", "1 cebolla pequeña, muy finamente picada", "1 cucharadita de hierbas mezcladas secas", "aerosol de aceite de cocina controlado en calorías", "1 diente de ajo, aplastado", "227g / 8oz pueden cortar tomates", "2 cucharadas colmadas de hojas de albahaca fresca finamente trituradas, más extra para decorar", "2 calabacines medianos, cortados y sin semillas", "sal marina y pimienta negra recién molida"], "method": ["Coloque la carne, la mitad de la cebolla, la mitad de las hierbas mezcladas y una pizca de sal y pimienta en un tazón y mezcle bien. Forma en 10 bolas pequeñas.", "Rocíe una sartén antiadherente mediana con un poco de aceite y cocine las albóndigas durante 5-7 minutos, volteándolas de vez en cuando hasta que se doren por todos lados. Transfiere a un plato.", "Para la salsa, coloque la cebolla restante en la misma sartén y cocine a fuego lento durante tres minutos, revolviendo. Agregue el ajo y cocine por unos segundos.", "Agregue los tomates, 300 ml / 10 fl oz de agua, las hierbas mezcladas restantes y la albahaca picada. Llevar a ebullición, revolviendo. Regrese las albóndigas a la sartén, reduzca el fuego a fuego lento y cocine durante 20 minutos, revolviendo ocasionalmente hasta que la salsa esté espesa y las albóndigas estén bien hechas.", "Mientras tanto, llene a medias un recipiente mediano con agua y llévelo a ebullición. Use un pelador de verduras para pelar los calabacines en cintas. Cocine el calabacín en agua hirviendo durante un minuto y luego escurra.", "Divida las cintas de calabacín entre dos platos y cubra con las albóndigas y la salsa. Adornar con hojas de albahaca."], "url": "www_bbc_co_uk_food_recipes_italian_style_meatballs_69955", "title": "Albóndigas de estilo italiano con calabacín 'tagliatelle'", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/italian_style_meatballs_69955_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["165 g / 5½ oz de azúcar en polvo", "1 naranja, ralladura y jugo", "3 cucharadas de licor con sabor a naranja (como Grand Marnier)", "30 dedos de esponja (preferiblemente panecillos Pavesini, disponibles en la mayoría de las tiendas de delicatessen italianas)", "6 huevos de gallinas camperas, separados", "Crema doble de 325ml / 11½ fl oz", "500 g / 1 lb 2 oz de queso mascarpone", "2 cucharadas de extracto de vainilla", "250 g / 9 oz de fresas, en rodajas", "3 cucharadas de azúcar glas"], "method": ["En una sartén, caliente suavemente 120 g / 4 oz del azúcar con la ralladura de naranja. Agregue el licor y el jugo de naranja y continúe cocinando hasta que el azúcar se haya disuelto. Use pinzas para sumergir rápidamente la mitad de los dedos de la esponja en el almíbar (tenga cuidado de no quemarse), luego colóquelos en el fondo de un plato cuadrado.", "Coloque un recipiente resistente al calor sobre una fuente de agua hirviendo a fuego lento. Agregue las yemas de huevo y el azúcar impalpable restante al recipiente y bata para combinar. Cuando el azúcar se haya derretido, retire el recipiente del fuego y bata las yemas de huevo hasta que estén pálidas, dobladas en volumen y cremosas. Vierta en un recipiente fresco y reserve.", "En otro recipiente, bata las claras de huevo hasta que estén firmes. En un tazón grande, bata la crema hasta que espese. Doble el mascarpone en la crema, luego doble las yemas de huevo hasta que se combinen. Doble las claras de huevo y el extracto de vainilla.", "Extienda una capa de la mezcla sobre los dedos de esponja empapados y luego agregue una capa de fresas. Continúa colocando en capas los dedos de la esponja, la mezcla cremosa y las fresas, y termina con una capa de fresas. Cubra con film transparente y colóquelo en la nevera para enfriar durante dos horas.", "Deseche la película adhesiva y empolva la parte superior del budín de verano con azúcar glasé. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_italian_summer_10941", "title": "Tiramisú de fresa italiana de verano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["50ml / 2oz de aceite de oliva, más extra para engrasar", "500g / 1lb 2oz de harina blanca fuerte", "Sal 10g / 2tsp", "25 g / 1 oz de levadura fresca", "300ml / 11floz de agua fría", "150g / 5oz de aceitunas verdes, finamente picadas", "3-5 rebanadas de jamón de Parma", "2-3 paquetes de mozzarella de búfala, rebanadas gruesas", "Hojas de albahaca de 20 g¾oz, aproximadamente desgarradas", "Aceitunas negras 150 g / 5 oz, finamente picadas", "1 cucharada de cilantro, más o menos picado", "2-3 paquetes de queso halloumi", "½ cucharadita de menta seca", "3-5 rebanadas de jamón Lounza"], "method": ["Aceite ligeramente dos latas redondas de 25cm / 10in de diámetro, 10cm / 4in de altura con aceite de oliva.", "Coloque la harina, la sal, el aceite, la levadura y el agua en un tazón grande y mezcle hasta que toda la harina haya sido consumida por el agua.", "Incline la masa sobre una superficie enharinada y amase durante seis minutos, luego coloque la masa nuevamente en el recipiente para comprobar durante una hora.", "Precalentar el horno a 220C / 425F / Gas 7.", "Divida la masa en ocho piezas iguales y enrolle cada pieza en un círculo para que encaje en la lata.", "Coloque uno en el fondo de una de las latas y extienda las aceitunas verdes picadas sobre la parte superior de manera uniforme.", "Coloque otro círculo de masa encima de las aceitunas y cubra con el jamón de Parma.", "Coloque otro círculo de masa en el parma y cubra con mozzarella.", "Raspe la albahaca y coloque en la parte superior del queso.", "Coloque un círculo de masa final en la parte superior y deje que se levante durante una hora.", "Repita con los rellenos chipriotas y los círculos de masa restantes.", "Coloque ambas latas en el horno durante 30-40 minutos hasta que estén doradas.", "Retirar de las latas una vez que se enfríe un poco, cortar en trozos y servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_italianandcypriottie_83850", "title": "Pan con gradas italiano y chipriota", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]