[{"isVegetarian": true, "title": "Chocolate Easter egg nest cakes", "url": "www_bbc_co_uk_food_recipes_eastereggnests_93841", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eastereggnests_93841_16x9.jpg", "ingredients": ["225g/8oz plain chocolate, broken into pieces", "2 tbsp golden syrup", "50g/2oz butter", "75g/3oz cornflakes ", "36 mini chocolate eggs"], "serves": "Makes 12", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Line a 12-hole fairy cake tin with paper cases.", "Melt the chocolate, golden syrup and butter in a bowl set over a pan of gently simmering water, (do not let the base of the bowl touch the water). Stir the mixture until smooth.", "Remove the bowl from the heat and gently stir in the cornflakes until all of the cereal is coated in the chocolate.", "Divide the mixture between the paper cases and press 3 chocolate eggs into the centre of each nest. Chill in the fridge for 1 hour, or until completely set."]}, {"isVegetarian": false, "title": "Eastern-spiced shepherd’s pie with Bombay potato topping", "url": "www_bbc_co_uk_food_recipes_eastern-spiced_shepherds_80973", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eastern-spiced_shepherds_80973_16x9.jpg", "ingredients": ["2-3 tbsp sunflower oil", "2 onions, peeled, diced", "2 celery stalks, trimmed, diced", "2 carrots, peeled, trimmed, diced", "3 garlic cloves, peeled, chopped", "knob fresh ginger, peeled, grated", "1 tsp ground cinnamon", "1 tsp ground coriander", "1 tsp ground cumin", "½ tsp ground turmeric", "1 tsp mustard seeds", "500g/1lb 2oz leftover roast lamb, finely diced", "½ orange, zest only", "1 tbsp plain flour", "250ml/9fl oz warm lamb stock", "1 tsp clear honey", "1 tbsp Worcestershire sauce", "4 dried figs, chopped", "salt and freshly ground black pepper", "400g/14oz floury potatoes, such as Maris Piper, peeled, diced", "2 tbsp sunflower oil", "1 tsp mustard seeds", "3 large pinches mild curry powder", "½ tsp cumin seeds"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the oil in a large frying pan with a tight-fitting lid over a medium heat. Add the onions, celery, carrots, garlic, ginger and spices, stir well and fry for 8-10 minutes, or until the vegetables have softened slightly. Increase the heat and stir in the leftover lamb and orange zest. Continue to cook for a further five minutes.", "Sprinkle over the flour and stir to incorporate, then pour over the stock. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and stir in the honey, Worcestershire sauce, and figs. Season, to taste, with salt and freshly ground black pepper.", "Cover the pan with the lid and simmer for 12-15 minutes. Remove from the heat and set aside to cool slightly.", "Preheat the oven to 180C/350F/Gas 4.", "For the Bombay mashed potato, cook the potatoes in a large pan of boiling salted water for 12-15 minutes, or until tender. Drain well and mash until completely smooth.", "While the potatoes are boiling, heat the oil in a small frying pan. Add the mustard seeds, curry powder and cumin seeds and fry gently until the seeds start to pop. (Caution: keep your eyes and face away from the pan.) Remove the pan from the heat and set aside.", "Stir the spice mixture into the mashed potato and season well with salt and freshly ground black pepper.", "Spoon the filling into a suitably sized ovenproof dish (or two smaller ones if necessary). Top with the Bombay mashed potato, smoothing into an even layer using a spatula. Drag a fork through the topping to decorate.", "Bake the shepherd’s pie in the oven for 15-20 minutes, or until the filling is bubbling and the mashed potato is crisp and golden-brown."]}, {"isVegetarian": true, "title": "Eastern slaw", "url": "www_bbc_co_uk_food_recipes_eastern_slaw_89338", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 tbsp Greek yoghurt ", "2 tbsp mayonnaise ", "1 heaped tbsp creamed horseradish ", "2 tsp ground coriander ", "1 tsp ground cinnamon ", "1 heaped tsp nigella seeds ", "generous handful golden raisins ", "½ white cabbage, thinly shredded", "¼ cauliflower, stalk removed, florets thinly sliced", "1 large fennel bulb, quartered and thinly sliced, fronds chopped ", "1 red onion, very thinly sliced into half moons", "2 apples (of your choice), quartered, cored and thinly sliced ", "20g/¾oz mint leaves, roughly chopped ", "20g/¾oz dill, fronds and stems roughly chopped ", "sea salt flakes and freshly ground black pepper "], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put the yoghurt, mayonnaise, horseradish, coriander, cinnamon and nigella seeds in a small bowl and stir well. Add the raisins and season generously with salt and pepper. Mix well. ", "Put the vegetables and apples in a large bowl and pour over the sauce. Use your hands to ensure everything is well coated and evenly mixed. Add the fresh herbs, mix well again until the ingredients are evenly combined. "]}, {"isVegetarian": false, "title": "Eastern chicken stir-fry", "url": "www_bbc_co_uk_food_recipes_easternchickenstirfr_67096", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 large chicken breast, boneless and skinless, cut into pencil thin strips and seasoned", "2 tsp clear honey", "4 spring onions, finely sliced", "1 red pepper, finely sliced", "100g/4oz mangetout, trimmed and sliced diagonally", "110g/4oz button chestnut mushrooms, left whole", "100g/4oz pak choi, thickly sliced keeping the white and green parts separate", "salt and freshly ground black pepper", "1 tbsp soy sauce", "½tsp cornflour", "1 tbsp hoi sin sauce", "25g/1oz  salted cashew nuts"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok or deep frying pan over a high heat and add the chicken. Pour over 1 tsp of the honey and brown the chicken quickly. Remove from the pan with a slotted spoon, and set aside.", "Add the spring onion to the frying pan and add a little more oil if needed. Pour over the remaining teaspoon of honey and allow to cook for couple of minutes. Add red peppers, mangetout, mushrooms and the white parts of pak choi and toss over high heat.", "Slate together the cornflour, soy sauce, and hoi sin sauce in and mix well.  Return the chicken to the pan, add the green parts of pak choi, soy mixture and cashew nuts and cook until sauce is bubbling and thick.  Serve immediately."]}, {"isVegetarian": false, "title": "Easy Boston baked beans with potato cakes", "url": "www_bbc_co_uk_food_recipes_easy_boston_baked_beans_26627", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "150g/5oz cubed pancetta ", "1 onion, finely chopped ", "2 cloves garlic, crushed ", "½ tsp hot paprika ", "1 tbsp English mustard ", "1 tsp treacle ", "splash Worcestershire sauce", "300g/10oz canned cherry tomatoes ", "1 tsp brown sugar ", "1 tsp tomato purée  ", "1 x 400g/14oz can haricot beans, drained, rinsed ", "1 tbsp chopped fresh flatleaf parsley, to garnish ", "2 good quality pork sausages", "1 tbsp olive oil", "350g/12oz Desirée potatoes, peeled", "2 spring onions, finely sliced", "1 heaped teaspoon plain flour", "1 large knob of butter", "2 tbsp olive oil"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beans, heat the olive oil in a wide heavy-based pan over a medium-high heat. Add the pancetta and fry for 1-2 minutes, or until starting to crisp at the edges, then stir in the onion and garlic.", "Fry for 2-3 minutes, until the onion is translucent, then stir in the paprika, mustard, treacle, Worcestershire sauce, to taste, tomatoes, sugar, tomato purée and haricot beans. Bring to a boil and cook for ten minutes, or until the liquid has reduced to a thick consistency. Season with sea salt and freshly ground black pepper", "Meanwhile, for the meatballs, remove the casing from the sausages and roll the sausage meat into golf ball sized pieces. Heat the olive oil in a frying pan over a medium heat and fry for ten minutes, turning regularly, or until golden-brown and cooked through.", "For the potato cakes, boil the whole potatoes for five minutes or until just tender. Drain and, when cool enough to handle, coarsely grate into a mixing bowl. Add the spring onions, flour and half the butter. Season with salt and freshly ground black pepper and mix well. Divide into four equal balls and pat into flat rounds. ", "Heat the oil and remaining butter in a large non-stick frying pan over a medium heat and gently fry the potato cakes for 2-3 minutes on each side, or until golden-brown and cooked through. ", "To serve, spoon the beans over the potato cakes and meatballs and garnish with the parsley."]}, {"isVegetarian": true, "title": "Easy bread sauce", "url": "www_bbc_co_uk_food_recipes_easy_bread_sauce_26387", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_bread_sauce_26387_16x9.jpg", "ingredients": ["1 large onion, peeled", "6 cloves", "1 bay leaf", "6 black peppercorns", "570ml/1 pint full-fat milk", "110g/4oz fresh white breadcrumbs", "40g/1½oz butter", "salt and freshly ground black pepper"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the bread sauce, stud the onion all over with the cloves, then place into a saucepan along with the bay leaf, peppercorns and milk. Bring the mixture to the boil, remove the pan from the heat and set to cool for 15 minutes.", "Remove the onion, bay leaf and peppercorns, then stir in the breadcrumbs.", "Return the pan to the heat and cook very gently for 5-10 minutes, stirring occasionally until the breadcrumbs have absorbed all the liquid and the sauce is the desired consistency.", "Stir in the butter and season, to taste, with salt and freshly ground black pepper."]}, {"isVegetarian": false, "title": "Easy chicken and pea risotto", "url": "www_bbc_co_uk_food_recipes_easy_chicken_and_pea_31687", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chicken_and_pea_31687_16x9.jpg", "ingredients": ["2 tbsp mild olive oil or sunflower oil", "1 onion, cut in half, coarsely grated", "2 garlic cloves, grated", "250g/9oz arborio risotto rice ", "100ml/3½fl oz white wine, dry vermouth or water", "1 litre/1¾ pints chicken stock cube, made with 1 stock cube", "250g/9oz cooked leftover chicken, skin removed, cut into small pieces", "200g/7oz frozen peas", "75g/2¾oz Grana Padano or other hard Italian-style cheese, finely grated ", "25g/1oz butter", "freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, non-stick saucepan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, stirring occasionally, until softened and just beginning to colour. ", "Add the risotto rice to the pan and stir well for 30-40 seconds, until the oil has coated the grains of rice. ", "Pour in half of the wine and allow to bubble for 30-40 seconds, then add all of the stock and bring to the boil, stirring well. Reduce the heat and simmer, uncovered, for 8-10 minutes, stirring frequently, until the rice is almost tender and the risotto is creamy in appearance. ", "Stir in the remaining wine, the chicken and the frozen peas, then continue to cook, stirring constantly, for a further 4-5 minutes, or until the chicken and peas are heated through and the rice is tender with a slight bite. ", "Remove the pan from the heat, then stir in the butter and cheese. Season with black pepper. Cover the pan with a lid and set aside for 5 minutes before serving. "]}, {"isVegetarian": false, "title": "Easy chicken pasties", "url": "www_bbc_co_uk_food_recipes_easy_chicken_pasties_37125", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz cooked chicken, cut into bite-sized pieces", "½ lemon, zest only ", "5 thyme sprigs, leaves picked and finely chopped", "small bunch fresh parsley, leaves picked and finely chopped", "4 heaped tbsp crème fraîche", "500g/1lb 2oz block puff pastry", "1 free-range egg, beaten lightly", "salt and freshly ground black pepper"], "serves": "Makes 6 pasties", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Put the chicken into a large bowl and add the lemon zest, thyme and parsley. Stir in enough crème fraîche to coat the ingredients. Season with salt and pepper.", "Cut the puff pastry block into three equal pieces and roll out each one into a rectangle approximately 33cm/13in x 13cm/5in. Cut each rectangle in half horizontally to make six equal-sized pieces of pastry.", "Brush the rectangles around the edges with a little beaten egg. Place a heaped spoonful of the chicken filling to one side of the rectangle then fold over the remaining pastry to form a parcel. Press the edges together and seal by pressing the prongs of a fork along the three sealed edges. Make 3 small slits in the top.", "Brush the whole parcel with a a little beaten egg and place on a large well-greased baking tray. Repeat with the remaining pieces of pastry. Put the baking tray in the fridge for about 20 minutes so the pasties firm up. ", "Preheat the oven to 200C/180C Fan/Gas 6.", "Bake the pasties for approximately 20–30 minutes, until the pasties are risen and golden-brown all over."]}, {"isVegetarian": true, "title": "Easy chocolate birthday cake", "url": "www_bbc_co_uk_food_recipes_easy_chocolate_birthday_90089", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chocolate_birthday_90089_16x9.jpg", "ingredients": ["100g/3½oz unsalted butter", "250g/9oz caster or brown sugar", "50ml/2fl oz sunflower oil", "25g/1oz cocoa powder", "2 tsp vanilla extract", "4 medium free-range eggs", "80ml/2½fl oz milk", "100ml/3½fl oz double cream", "300g/10½oz plain flour", "3 tsp baking powder", "25g/1oz cocoa powder", "300g/10½oz icing sugar", "50g/1¾oz butter", "50ml/2fl oz double cream", "250ml/9fl oz double cream, whipped until stiff peaks form when the whisk is removed", "150g/5½oz jam"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the cake, line the base of a deep 20cm/9in cake tin with non-stick paper and preheat the oven to180C/350F/Gas 4.", "Melt the butter over a low heat in a small pan, pour it into a bowl with the sugar, oil, cocoa powder and vanilla. Beat well until smooth, then whisk in the eggs followed by the milk and cream.", "Sift the flour and baking powder into the butter mixture and beat until smooth, then spoon into the prepared tin and cover the top of the tin with aluminium foil.", "Bake for 30 minutes, then remove the foil and bake for a further 20 minutes, or the top is springy and a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven and set aside to cool completely.", "Meanwhile make the cocoa frosting, mix the cocoa powder and icing sugar in a bowl. Melt the butter for a few seconds in the microwave, or in a small pan over a low heat. Mix the melted butter and the cream into the sugar and cocoa, and stir until smooth.", "To assemble the cake, remove the cake from the tin, trim the top of the cake to make it flat, then cut the cake in half horizontally. Put the bottom half of the cake onto a serving plate and spread with the whipped cream. Top with the jam.", "Spread the cocoa frosting onto the top of the cake and swirl it with a spoon, then carefully place it onto the bottom half of the cake."]}, {"isVegetarian": true, "title": "Easy chocolate cake", "url": "www_bbc_co_uk_food_recipes_easy_chocolate_cake_31070", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chocolate_cake_31070_16x9.jpg", "ingredients": ["225g/8oz plain flour", "350g/12½oz caster sugar", "85g/3oz cocoa powder", "1½ tsp baking powder", "1½ tsp bicarbonate of soda", "2 free-range eggs", "250ml/9fl oz milk", "125ml/4½fl oz vegetable oil", "2 tsp vanilla extract", "250ml/9fl oz boiling water", "200g/7oz plain chocolate", "200ml/7fl oz double cream"], "serves": "Makes 1 cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line two 20cm/8in sandwich tins.", "For the cake, place all of the cake ingredients, except the boiling water, into a large mixing bowl. Using a wooden spoon, or electric whisk, beat the mixture until smooth and well combined. ", "Add the boiling water to the mixture, a little at a time, until smooth. (The cake mixture will now be very liquid.)", "Divide the cake batter between the sandwich tins and bake in the oven for 25-35 minutes, or until the top is firm to the touch and a skewer inserted into the centre of the cake comes out clean.", "Remove the cakes from the oven and allow to cool completely, still in their tins, before icing.", "For the chocolate icing, heat the chocolate and cream in a saucepan over a low heat until the chocolate melts. Remove the pan from the heat and whisk the mixture until smooth, glossy and thickened. Set aside to cool for 1-2 hours, or until thick enough to spread over the cake.", "To assemble the cake, run a round-bladed knife around the inside of the cake tins to loosen the cakes. Carefully remove the cakes from the tins.", "Spread a little chocolate icing over the top of one of the chocolate cakes, then carefully top with the other cake.", "Transfer the cake to a serving plate and ice the cake all over with the chocolate icing, using a palette knife."]}, {"isVegetarian": true, "title": "Easy chocolate traybake", "url": "www_bbc_co_uk_food_recipes_easy_chocolate_traybake_12742", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz cocoa powder", "6 tbsp boiling water", "100g/3½oz unsalted butter", "275g/9¾oz golden caster sugar", "3 large free-range eggs", "125ml/4fl oz full-fat milk", "150g/5½oz self-raising flour", "25g/1oz ground almonds", "1 tsp baking powder", "50g/1¾oz malted milk powder", "4 tbsp strawberry jam", "200ml/7fl oz double cream", "400g/14oz white chocolate, finely chopped"], "serves": "Makes 20 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 5. Grease a 30x23cm/12x9in traybake tin and line with baking parchment. ", "Put the cocoa and boiling water in large bowl and mix. Add the butter and mix until smooth. Add the remaining sponge ingredients and mix until fully incorporated. ", "Pour into the tin, and bake for 30-35 minutes, or until the traybake springs back when pressed lightly with a finger in the centre and is beginning to shrink away from the sides of the tin.", "Leave to cool in the tin for 10 minutes, then turn out, carefully remove the parchment and place on a wire rack to cool completely.", "To make the icing, gently heat the cream in a small heavy bottomed saucepan. Add the white chocolate and stir until smooth. Leave to cool. ", "Pour the icing over the traybake in an even layer. "]}, {"isVegetarian": true, "title": "Easy chow mein for kids", "url": "www_bbc_co_uk_food_recipes_easy_chow_mein_for_kids_81406", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chow_mein_for_kids_81406_16x9.jpg", "ingredients": ["200g/7oz dried egg noodles (or rice or soba noodles)", "1 large carrot", "2 spring onions", "50g/1¾oz green beans, peas or mangetout (fresh or frozen)", "handful beansprouts, cabbage leaves, sliced pepper, broccoli florets or mushrooms (optional)", "2 tsp vegetable or sunflower oil ", "1 garlic clove, finely chopped by an adult or crushed in a garlic press", "handful shredded cooked meat, prawns or tofu (optional)", "1 tbsp soy sauce (low-salt version if possible)", "2 tsp honey", "1 tsp tomato ketchup", "half a lemon, juice only"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Adult’s job: Place the dried noodles in a heatproof bowl and add boiling water from the kettle. They will take approximately five minutes to cook and this is fun for children to watch but be careful of the hot water. When the noodles are cooked, drain them in a sieve and rinse the noodles under cold water.", "Kid’s job: Peel and grate the carrot. This can be done by kids but be cautious using graters and peelers as they can be very sharp. Kids can chop any other vegetables you want to include. Everything should be sliced thinly if possible.", "Kid’s job: In a small bowl mix together the soy, honey, ketchup and lemon juice. Have a taste - it should be tangy but sweet. You can add a little more of the ingredients as needed.", "Adult’s job: Heat a large frying pan or wok and add the oil. Add the garlic and stir fry for a few seconds, then add the grated carrots, spring onions and the beans or peas (either raw or from frozen) as well as any other raw veg or cooked meats you want to add. ", "Adult’s job: Stir fry for two minutes on a high heat before adding the sauce and a splash of water. Taste (kids can do this). You may need extra honey, lemon or soy sauce.", "Adult’s job: Add the cooked noodles to the stir-fried ingredients along with the beansprouts if you are using them. Stir the chow mein for a couple of minutes over a high heat to finish the dish. Serve in a bowl - try using chopsticks!"]}, {"isVegetarian": true, "title": "Paul Hollywood's ciabatta", "url": "www_bbc_co_uk_food_recipes_easy_ciabatta_98431", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white bread flour, plus extra for dusting", "10g/⅓oz salt", "10g/⅓oz instant yeast", "fine semolina, for dusting"], "serves": "Makes 4 small loaves", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, salt and yeast with 330ml/11fl oz cold water into a freestanding mixer fitted with a dough hook (don’t put the salt directly on top of the yeast). Begin mixing on a slow speed. ", "As the dough starts to come together, with the motor running, slowly add another 110ml/3⅓fl oz of cold water, drip by drip. Mix for a further 5-8 minutes on a medium speed until the dough is smooth and stretchy.", "Lightly oil a 3 litre/5¼pint square plastic container with a lid. (It’s important to use a square tub as it helps shape the dough).", "Tip the dough into the oiled container and seal with the lid. Leave for 1½ to 1¾ hours at room temperature, or until at least doubled, even trebled in size (it's important the dough proves slowly, otherwise it will collapse and your loaves will be flat).", "Dust two large baking trays with flour and semolina. ", "Dust your work surface heavily with flour and semolina and carefully tip out the dough (it will be very wet) - trying to retain a rough square shape. ", "Rather than knocking it back, handle it gently so you can keep as much air in the dough as possible. Coat the top of the dough with more flour and/or semolina. ", "Cut the dough lengthways, dividing into four equally-sized loaves. Stretch each piece of dough lengthways a little and place on the prepared baking trays. Leave the ciabatta to rest for a further 30-45 minutes.  ", "Preheat the oven to 220C/425F/Gas 8 (200C fan) and bake for 25 minutes, or until the loaves are golden-brown and sound hollow when tapped on the base. Leave to cool completely on a wire rack before serving."]}, {"isVegetarian": true, "title": "Easy creamy vanilla custard", "url": "www_bbc_co_uk_food_recipes_easy_creamy_vanilla_20376", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large free-range egg yolks", "2 tsp cornflour", "25g/1oz caster sugar", "1 vanilla pod, split lengthways, or ½ tsp good-quality vanilla extract", "250ml/9fl oz whole milk", "250ml/9fl oz double cream"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the egg yolks in a medium saucepan with the cornflour and sugar. Scrape the vanilla seeds into the pan, or add the vanilla extract, and use a metal whisk to combine all the ingredients. ", "Gradually whisk in the milk and cream then place the pan over a low heat and cook gently for 6-8 minutes, whisking constantly, until smooth and thick. (Do not allow the custard to boil.)"]}, {"isVegetarian": false, "title": "Easy kids' fishcakes", "url": "www_bbc_co_uk_food_recipes_easy_kids_fishcakes_70996", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_kids_fishcakes_70996_16x9.jpg", "ingredients": ["2 medium potatoes (or sweet potatoes)", "200g/7oz cooked fish- use either smoked mackerel or a tin of tuna or salmon", "a small lemon, juice only", "freshly ground black pepper ", "100g/3½oz cream crackers or similar savoury biscuits (or breadcrumbs if you have them)", "1 tbsp vegetable or sunflower oil ", "2 spring onions, chopped", "1 tbsp chopped chives or parsley ", "1 tbsp grated cheddar", "1 tsp wholegrain mustard"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Adult’s job: Preheat the oven to 220C/425F/Gas 7.", "Kid’s job: Wash the potatoes and then an adult can boil the potatoes whole with their skins on. After 20-30 minutes the potatoes should feel soft when an adult pushes a small knife in - if not, cook them for a few minutes more and then rinse them and leave to cool. ", "Kid’s job: Once the potatoes have cooled, kids can then peel the skin off the potatoes with their fingers and squash the flesh into a bowl. Mash the potato using a masher, fork or clean fingers.", "Kid’s job: Add the fish and mix well. Add the lemon, a little pepper and any of the optional extras you like.  Have a taste - you can add more pepper or lemon, if you like. All of the ingredients are cooked at this point so it is safe to taste!", "Kid’s job: Place the crackers in a sandwich bag and wrap it in a clean tea towel or layers of kitchen paper. Crush the crackers using a rolling pin - it is safer to roll over the crackers rather than bashing! Pour the cracker crumbs onto a plate. Have a bowl ready with some water for dipping hands in.", "Kid’s job: Get your hands a little bit wet and roll small balls of the fishcake mixture. Don’t worry too much about making perfect balls - you can flatten them into patties. Get the outside of the fishcakes damp again and push them into the bowl of crushed crackers - you want a light coating of crumbs all over the fishcakes.", "Kid’s job: Pour the oil over the bottom of a baking tray and place the fishcakes on top. Turn them all over once so that they have a little oil on each side. An adult can place the baking tray into the preheated oven.", "Adult’s job: Bake the fishcakes for 10 minutes on one side and then turn the fishcakes over before placing them back in the oven for another 10 minutes or until the fishcakes are golden-brown. Carefully remove from the oven and leave to cool slightly before serving."]}, {"isVegetarian": false, "title": "Easy jambalaya", "url": "www_bbc_co_uk_food_recipes_easy_jambalaya_77952", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_jambalaya_77952_16x9.jpg", "ingredients": ["1 tbsp olive oil", "2 chicken thighs, boneless, skin removed, cut into 2½cm/1in pieces", "75g/2½oz smoked sausage (such as kobanos), sliced", "1 small onion, finely chopped", "1 celery stick, finely chopped", "1 garlic clove, finely chopped", "1 red pepper, thinly sliced", "200g tin chopped tomatoes", "½ tsp cayenne pepper, or to taste", "150g/5½oz basmati rice", "200ml/7fl oz chicken stock (made from ½ stock cube)", "salt and freshly ground black pepper", "handful fresh parsley, finely chopped, optional"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan with a tight-fitting lid and fry the chicken and sausage for 3 minutes. ", "Add the onion and celery, season well and fry for 5 minutes, or until softened. Add the garlic and pepper and cook for a further minute. Add the tomatoes and cayenne and cook for 2 minutes, then add the rice and stir well.", "Pour over the stock, bring to the boil, put the lid on, turn the heat down as low as it will go and cook for 12 minutes. ", "Turn off the heat and leave the rice to stand for 12 minutes. Take off the lid, fluff up the rice and serve immediately, garnished with the parsley, if using. "]}, {"isVegetarian": true, "title": "Easy no-cook cheesecake", "url": "www_bbc_co_uk_food_recipes_easy_no-cook_cheesecake_89811", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_no-cook_cheesecake_89811_16x9.jpg", "ingredients": ["200g/7oz digestive biscuits", "75g/2½ oz unsalted butter", "400g/14oz full-fat cream cheese, at room temperature", "300g/10½ oz mascarpone, at room temperature", "200g/7oz icing sugar, sifted", "1 tsp vanilla extract", "100g/3½oz malted milk balls (optional)"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Place the digestive biscuits into a sealable freezer bag. Push all the air out and seal the bag. Crush the biscuits with a rolling pin, being careful not to break any holes in the bag.", "Melt the butter in a large saucepan. Tip the biscuit crumbs into the butter and mix well until thoroughly combined.  Press the buttery crumbs into the bottom of a 23cm/9in springform or loose-bottomed tin. Chill in the refrigerator while you make the topping.", "Combine the cream cheese and mascarpone in a large mixing bowl. Using an electric handheld mixer, blend the cheeses together until light and fluffy. Add the icing sugar a little at a time and blend to incorporate.  Finally, mix in the vanilla. The mixture should be very light and fluffy. ", "Place the malted milk balls in the sealable freezer bag and close. Knock the malted milk balls with a rolling pin to just break them apart. Fold half of the crushed malted milk balls into the cream cheese mixture until thoroughly combined.", "Spread the cream cheese mixture over the biscuit base and smooth the top with a palette knife or spatula. Cover with cling film and chill in the fridge for at least four hours. ", "When ready to serve, sprinkle the remaining crushed malted milk balls over the top of the cheesecake. Release the catch of the springform tin carefully, then slice and serve."]}, {"isVegetarian": false, "title": "Easy roast chicken with gravy", "url": "www_bbc_co_uk_food_recipes_easy_roast_chicken_with_29774", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_roast_chicken_with_29774_16x9.jpg", "ingredients": ["2 carrots, cut into chunks", "2 celery stalks, trimmed, cut into chunks", "1 onion, cut into six ", "1 x 2kg/4½lb whole chicken", "½ lemon, cut into quarters", "small bunch fresh mixed herbs (sage, thyme and rosemary)", "dash vegetable oil ", "salt and freshly ground black pepper", "potatoes and roasted vegetables, to serve", "275ml/½ pint chicken stock ", "30g/1¼oz butter ", "1 tbsp plain flour "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 140C/120C Fan/Gas 1. ", "Put the carrots, celery and onion in a roasting tray and place the chicken on top. Stuff the cavity of the chicken with the lemon and herbs, then drizzle with the oil, rubbing it into the skin. Season, to taste, with salt and pepper. ", "Roast the chicken for 3 hours, basting the skin with the juices halfway through. Increase the oven temperature to its highest setting and continue to roast the chicken for 5-10 minutes to crisp up the skin. Remove it from the roasting tray and check it is cooked through (see tips), then set aside on a platter to rest for 10-15 minutes. Reserve the vegetables and cooking juices in the roasting tray. ", "Meanwhile, for the gravy, strain the reserved vegetables and cooking juices through a fine sieve into a saucepan, squeezing the vegetables with the back of a wooden spoon to extract maximum flavour. Add the stock to the pan and bring to the boil.", "Put the roasting tray over a low heat and add the butter. As the butter melts, scrape up any burned bits from the bottom of the tray using a wooden spoon. Whisk in the flour until it forms a paste. ", "Gradually pour the hot roasting juices and stock back into the roasting tray, whisking after each addition, until all the liquid is incorporated and the gravy has thickened. Season with a little salt. Heat until just bubbling, then continue to cook the gravy, stirring well, for 5 minutes. Season with a pinch of salt. ", "Strain the gravy through a sieve into a serving jug. Keep warm. Just before serving, stir any juices released by the rested chicken in to the gravy. ", "To serve, carve the roast chicken at the table and serve with roasted vegetables and potatoes. Drizzle with the gravy."]}, {"isVegetarian": false, "title": "Easy pizza with Parma ham and mozzarella", "url": "www_bbc_co_uk_food_recipes_easy_pizza_with_parma_02334", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_pizza_with_parma_02334_16x9.jpg", "ingredients": ["2 large corn or wheat tortillas ", "180g/6oz tinned chopped tomatoes", "1 tbsp tomato purée", "2 sprigs oregano, leaves picked, finely chopped", "1 garlic clove, grated", "sea salt and freshly ground black pepper", "2 mushrooms, thinly sliced", "2 small courgettes, very thinly sliced", "30g/1oz pitted black olives, halved", "3 salted anchovies, finely chopped", "2 tsp baby capers", "6 sun-blushed tomatoes, halved", "3 slices Parma ham (45g/1½oz in total), roughly torn ", "4 slices reduced-fat salami (20g/¾oz in total), halved", "100g/3½oz half-fat mozzarella, grated", "10g/⅓oz Parmesan, freshly grated", "small handful basil leaves, to serve", "small handful rocket, to serve"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½.", "Place the tortillas on two baking trays and bake for 5 minutes, or until crisp, but not coloured. Remove the tortillas from the oven and increase the oven temperature to 200C/180C Fan/Gas 6.", "Mix together the tinned tomatoes, tomato purée, oregano and garlic. Season to taste and stir well. Spread half of the tomato mixture evenly over each tortilla, leaving a 1cm/½in margin. Divide the toppings between the tortillas, finishing with the mozzarella and a final scattering of Parmesan.", "Bake for 10–12 minutes, or until the cheese has melted and started to turn golden-brown. Cut the pizzas into wedges and scatter over the basil and rocket leaves to serve. "]}, {"isVegetarian": false, "title": "Easy spaghetti Bolognese", "url": "www_bbc_co_uk_food_recipes_easy_spaghetti_bolognese_93639", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spaghetti_bolognese_93639_16x9.jpg", "ingredients": ["2 tbsp olive oil ", "400g/14oz beef mince  ", "1 onion, diced ", "2 garlic cloves, chopped ", "100g/3½oz carrot, grated", "2 x 400g tin chopped tomatoes ", "400ml/14fl oz stock (made from stock cube. Ideally beef, but any will do)", "400g/14oz dried spaghetti ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large saucepan over a medium heat. Add a tablespoon of olive oil and once hot add the beef mince and a pinch of salt and pepper. Cook the mince until well browned over a medium-high heat (be careful not to burn the mince. It just needs to be a dark brown colour). Once browned, transfer the mince to a bowl and set aside.", "Add another tablespoon of oil to the saucepan you browned the mince in and turn the heat to medium. Add the onions and a pinch of salt and fry gently for 5-6 minutes, or until softened and translucent. Add the garlic and cook for another 2 minutes. Add the grated carrot then pour the mince and any juices in the bowl back into the saucepan.", "Add the tomatoes to the pan and stir well to mix. Pour in the stock, bring to a simmer and then reduce the temperature to simmer gently for 45 minutes, or until the sauce is thick and rich. Taste and adjust the seasoning as necessary.", "When ready to cook the spaghetti, heat a large saucepan of water and add a pinch of salt. Cook according to the packet instructions. Once the spaghetti is cooked through, drain and add to the pan with the bolognese sauce. Mix well and serve."]}, {"isVegetarian": false, "title": "Easy Spanish chicken", "url": "www_bbc_co_uk_food_recipes_easy_spanish_chicken_09987", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spanish_chicken_09987_16x9.jpg", "ingredients": ["1 tbsp extra virgin olive oil", "2 small boneless, skinless chicken breasts (each about 150g/5½oz), sliced", "1 onion, thinly sliced", "1 yellow pepper, seeds removed, cut into 4cm/1½in pieces", "1 courgette, trimmed, halved lengthways and cut into 1cm/½in slices", "100g/3½oz cooking chorizo, sliced ", "100ml/3½fl oz red wine", "400g tin chopped tomatoes ", "400g tin butter beans, drained and rinsed", "1 tbsp tomato purée", "1 tsp dried oregano", "½ tsp dried chilli flakes ", "1 chicken stock cube", "160g/5¾oz long-grain rice", "175g/6oz green beans, trimmed (optional)", "chopped fresh flatleaf parsley, to garnish", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a large, non-stick frying pan or sauté pan. Add the chicken and season with the pepper. Fry for 2 minutes, stirring regularly. ", "Transfer the chicken to a plate using a slotted spoon or spatula and add the onion, pepper, courgette and chorizo to the pan. Fry over a medium–high heat for 3 minutes, stirring regularly. ", "Add the wine, tomatoes, butterbeans, tomato purée, oregano, chilli flakes and chicken stock cube to the pan. Refill the tomato tin with cold water, pour into the tomato mixture and stir. Season with a little salt and pepper.", "Bring the sauce to the boil, return the chicken to the pan and simmer for 8–10 minutes, or until the chicken is tender and cooked through and the sauce has thickened. ", "Meanwhile, half-fill a large saucepan with water and bring to the boil. Add the rice and simmer for 10–12 minutes, or until cooked. ", "Place the green beans, if using, in a small saucepan of boiling water and cook for 5–6 minutes, or until tender. Drain the beans and the rice and set aside. ", "Garnish with the parsley and serve immediately with the green beans and rice alongside. "]}, {"isVegetarian": true, "title": "Easy spinach soup with a poached egg", "url": "www_bbc_co_uk_food_recipes_easy_spinach_soup_with_a_85543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spinach_soup_with_a_85543_16x9.jpg", "ingredients": ["2 tbsp olive oil", "3 fat garlic cloves, finely chopped", "2 x 260g bags baby spinach", "1 litre/1¾ pints hot vegetable stock", "4 medium free-range eggs", "300ml/½ pint double cream", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil over a medium heat in a large, heavy-based saucepan. Add the garlic and fry for 1 minute. Add the spinach, a few handfuls at a time, stirring, and cook for 2 minutes. Pour in the stock, bring to the boil and simmer for 10 minutes.", "Meanwhile, half-fill a medium saucepan with water and bring to the boil. Crack the eggs into four small bowls. Turn the heat down so that the water is bubbling very gently. Slowly add the eggs to the water two at a time and cook for 3 minutes, or until the white is set but the yolk remains runny.", "Remove the soup from the heat and blitz with a stick blender until smooth. Return to the heat and stir in the cream. Heat through and season to taste with salt and pepper. ", "Divide the soup between four serving bowls and top each with a poached egg."]}, {"isVegetarian": true, "title": "Easy sticky toffee pudding with toffee sauce", "url": "www_bbc_co_uk_food_recipes_easy_sticky_toffee_46584", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_sticky_toffee_46584_16x9.jpg", "ingredients": ["5 tbsp demerara sugar, for coating the moulds", "200g/7oz pitted dates", "½ tsp vanilla extract", "50g/2oz butter, softened, plus extra for greasing the moulds", "175g/6oz dark muscovado sugar", "1½ tsp golden syrup", "1½ tsp black treacle", "200g/7oz self-raising flour", "2 free-range eggs", "1½ tsp bicarbonate of soda", "500ml/18fl oz double cream", "175g/6oz demerara sugar", "175g/6oz butter", "1 tbsp golden syrup", "1 tbsp black treacle", "vanilla ice cream"], "serves": "Makes 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Butter eight small pudding basins (dariole moulds) and sprinkle demerara sugar inside, coating evenly. Shake any excess sugar out of the moulds, and place them on a baking tray.", "Place the dates with 250ml/9fl oz water into a saucepan and bring up to the boil. Reduce the heat and simmer for 2-3 minutes. Remove the pan from the heat.", "Stir the vanilla extract into the date mixture. ", "Blend with a stick blender until the date mixture is thick and soupy. ", "In a large bowl, beat the butter and muscovado sugar together until smooth. ", "Stir in the syrup and treacle, then the flour, mixing well. ", "Break the eggs one at a time into the bowl, stirring well after each one. ", "Add the bicarbonate of soda to the date mixture, then pour into the flour mixture and beat well to blend. ", "Pour the mixture into the prepared pudding basins, filling them two-thirds full.", "Put the puddings into the oven immediately, and bake for 20 minutes until well-risen and springy to the touch.", "For the sauce, gently heat the cream in a saucepan. Add the sugar and butter and whisk until melted. Whisk in the syrup and treacle. ", "To serve, turn the pudding out onto a plate, spoon the sauce over the top and around, then finish with a dollop of ice cream."]}, {"isVegetarian": true, "title": "Easy veggie stir-fry", "url": "www_bbc_co_uk_food_recipes_easy_veggie_stir-fry_03446", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp sunflower oil", "2 spring onions, cut into 4cm lengths", "1 clove garlic, crushed", "1 cm piece fresh ginger, peeled and grated", "½ carrot, peeled and cut into matchsticks", "½ red pepper, cut into thick matchsticks", "50g baby sweetcorn, halved", "½ courgette, cut into thick matchsticks", "75g sugar snap peas or mange tout, trimmed", "1 tbsp hoisin sauce", "1 tbsp low salt soy sauce"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a wok on a high heat and add the oil. Add the spring onions, garlic, ginger and stir-fry for one minute. Add the carrots, red pepper and baby sweetcorn and stir-fry for 2 minutes.", "Add the courgette and sugar snap peas or mangetout and stir fry for a further 3 minutes. ", "Add the hoisin and soy sauce with a tablespoon of water and cook over a high heat for a further 2 minutes or until all the vegetables are cooked but not too soft.  Serve with noodles or rice."]}, {"isVegetarian": true, "title": "Easy white bread", "url": "www_bbc_co_uk_food_recipes_easy_white_bread_37005", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_white_bread_37005_16x9.jpg", "ingredients": ["400g/14oz strong white flour, plus extra for shaping and dusting", "1 tsp fast-action yeast ", "1 tsp fine salt", "300ml/10fl oz warm water", "oil, for kneading"], "serves": "Makes 1 loaf", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, yeast and salt in a bowl, pour in the warm water and stir everything together into a sticky shaggy mass. ", "Scrape the dough from your hands, cover the bowl with a cloth and leave for 10 minutes. ", "Lightly oil a 30cm/12in area of the work surface and your hands. Tilt the bowl and ease the dough out onto the oiled surface without too much pulling and teasing (a scraper may help). Lightly oil the inside of the bowl as well, to prevent any sticking later. Take the edge of the dough furthest from you in one hand and with minimal pulling, simply fold it over, to meet the edge nearest to you. Press the heel of your other hand down onto and into the dough, stretching it away from you by 5-10cm/2-4in. ", "Give the dough a clockwise quarter-turn and repeat the \"fold towards you, then push and gently stretch away from you\" action. Do this turning, folding and pushing action, no more than 8-10 times, then return the dough to the bowl. You don't want to flatten or tear the dough, or handle it roughly: the whole action should be quite gentle and measured. Don't be tempted to add more flour, even if the dough seems wet; that's exactly as it should be. Repeat this light kneading twice at 10-minute intervals, and finally return the dough to the bowl and leave it to prove for 45 minutes. ", "Wipe the work surface, dust it with flour then pat the dough into an oval. Roll it up tightly, give each end a pinch to keep it neat then place the dough seam-side down on a floured tray, cover with a cloth and leave until the dough has increased in size by a half – about 45 minutes. ", "Meanwhile preheat the oven to 220C/425F/Gas 7 (fan 200C). ", "Flour the top of the dough, cut a slash down the middle and bake for 35–40 minutes."]}]