[{"ingredients": ["150g / 5oz de mantequilla", "750ml / 1 pinta 7fl oz de caldo de pollo, preferiblemente fresco", "6 lonchas de jamón curado al aire, como Parma o Serrano, 4 en total, 2 finamente picadas", "Baguette rancio de 220g / 7¾oz, cortado en cubos de 1cm / ½ en cubitos", "75 g / 2½ oz de panceta ahumada, picada en lardons", "60g / 2½ oz de perejil de flatleaf, lavado, hojas finamente picadas", "2 chalotes medianos, pelados, finamente cortados", "1 limón, ralladura solamente", "1 x 2,2 kg / 4 lb 13½ oz de pollo entero", "10 hojas frescas de salvia", "2-3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1kg / 2lb 3oz de patatas, peladas, cortadas por la mitad", "1 cebolla blanca, pelada, finamente picada", "3 mazorcas de maíz dulce, sólo granos", "pequeño puñado de tomillo fresco, solo hojas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Derrita 100g / 3½oz de la mantequilla en una cacerola, luego agregue 250ml / 7fl oz de la acción y revuelva bien para combinar.", "En un tazón grande, mezcle las dos rebanadas de jamón picado curado al aire, pan en cubos, panceta, 30 g / 1 / oz de las hojas de perejil y todos los chalotes y la ralladura de limón hasta que estén bien combinados. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue la mezcla seca a la mezcla de la mantequilla y de la acción y mezcle bien para combinar. Déjalo a remojo durante 15-20 minutos.", "Mientras tanto, con los dedos húmedos, retire suavemente la piel de las pechugas de pollo hasta que toda la piel desde la abertura hasta el hueso del ala se desprenda de la carne.", "Presione dos piezas del jamón curado al aire y frótelas con agua. Deslice dos de las rebanadas de jamón debajo de la piel en un lado del pecho, empujándolos hacia el hueso del ala.", "Frote las hojas de salvia en agua y deslice 4-5 hojas debajo de la piel en un lado del pecho también. Repita el proceso en el otro lado del pecho.", "Exprime la mezcla de relleno y luego rellena la cavidad del pollo con el relleno. Coloque el pollo relleno en una bandeja para hornear, con el lado de la pechuga hacia abajo.", "Perforar el pollo por todas partes con un pincho de madera, luego frotar la piel con aceite de oliva y sazonar, a gusto, con sal y pimienta negra recién molida.", "Transfiera el pollo al horno y cocínelo, con la pechuga hacia abajo, durante una hora en el medio del horno.", "Voltee el pollo y continúe asándolo por otros 20 minutos, o hasta que la piel de la corona esté crujiente y dorada, y el pollo esté bien cocido. (El pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho). Transfiera el pollo a un plato caliente, cubra con papel de aluminio y déjelo reposar durante 10 minutos (reserve la grasa en la bandeja de asar para la salsa).", "Mientras tanto, hierva las papas en una sartén con agua con sal durante 18-20 minutos, o hasta que estén tiernas. Escurrir bien, luego sazonar, a gusto, con pimienta negra recién molida y agregar el perejil picado restante. Mantener caliente", "Mientras tanto, agregue los 500ml / 17fl oz restantes de caldo de pollo a la grasa en la bandeja de asar y caliente a fuego medio hasta que hierva a fuego lento. Continúe cocinando a fuego lento durante 4-5 minutos, o hasta que el volumen de salsa se haya reducido a la mitad. Mantener caliente", "Mientras tanto, caliente los 50 g / 2 oz restantes de mantequilla en una cacerola aparte a fuego medio. Agregue las cebollas y los granos de maíz dulce y revuelva para cubrirlos en la mantequilla, luego cubra la olla con una tapa y continúe cocinando durante 4-5 minutos, o hasta que se ablanden.", "Retire la sartén del fuego, mezcle las hojas de tomillo y sazone, al gusto, con sal y pimienta negra recién molida. Mash los granos de maíz dulce con un triturador de patata o la parte posterior de una cuchara de madera hasta que quede cremoso.", "Para servir, esculpe el pollo relleno dos veces y coloque la carne en cuatro platos para servir. Con una cuchara, las papas y la crema de maíz dulce a un lado. Rocíe la salsa."], "url": "www_bbc_co_uk_food_recipes_twicestuffedchicken_92270", "title": "Pollo dos veces relleno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600ml / 21¼fl oz de agua", "150ml / 5¼fl oz de vinagre de malta", "3 tomates, cortados a la mitad", "Jengibre de raíz 4cm, finamente picado", "50ml / 1¾fl oz de jarabe de frasco de tallo de jengibre", "1 cucharadita de salsa de soja", "1 cucharada de azúcar demerara", "1 cucharada de harina de maíz, mezclada con 1 cucharada de ketchup de tomate", "1 kg / 2¼lb vientre de cerdo, cocido el día anterior", "Paquete de 500 g / 17½ oz de fideos de huevo medio secos de 4 minutos", "1 cucharada de aceite de sésamo mezclado con 1 cucharada de aceite vegetal", "4 hongos shiitake, en rodajas", "4 baby sweetcorn, descuartizado", "½ pimiento amarillo, cortado en tiras finas", "1 diente de ajo, finamente picado", "Jengibre fresco de raíz de 2.5cm, finamente picado", "2 cebolletas, cortadas en trozos de 4cm", "6 mangetout", "1 zanahoria, cortada en fósforos", "3 cucharadas de cilantro fresco picado", "1 cucharadita de salsa de pescado tailandés (nam pla)", "1 cucharadita de salsa de soja"], "method": ["Ponga todos los ingredientes agridulces, excepto la harina de maíz y el ketchup de tomate, en una cacerola, deje que hierva y deje cocer a fuego lento durante 30 minutos.", "Luego agregue la mezcla de harina de maíz y cocine hasta que esté espeso y brillante.", "Coloque los fideos en una olla grande con agua hirviendo ligeramente salada, vuelva a hervir y cocine durante 4 minutos.", "Escurrir y enfriar con agua fría.", "Divida la carne de cerdo en cuatro porciones y caliente en una sartén por 4 minutos en cada lado.", "Luego caliente la mitad de los aceites mezclados en una sartén grande o wok, agregue los fideos fríos y escurridos y saltee hasta que estén ligeramente coloreados.", "Transfiera a un plato y manténgalo caliente.", "Agregue el aceite restante al wok y saltee las verduras durante 2 minutos, comenzando con los champiñones y el maíz dulce, luego agregue la pimienta, el ajo y el jengibre, luego las cebolletas, el mangetout y finalmente las zanahorias.", "Agregue los fideos, la salsa agridulce, el cilantro, la salsa de pescado y la salsa de soja al gusto y mezcle bien. Sirve con el cálido vientre de cerdo."], "url": "www_bbc_co_uk_food_recipes_twicecookedporkbelly_70504", "title": "Vientre de cerdo dos veces cocido con fideos chow chow", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["550g / 1lb 4oz de harina de pan blanco fuerte, más extra para espolvorear", "100g / 3½oz de harina de pan integral", "2 cucharaditas de sal", "7g bolsita de levadura seca de acción rápida", "2 puentes de miel", "1 cucharada de aceite de sésamo", "50g / 1¾oz semillas de amapola", "aceite de girasol (o aceite en aerosol)"], "method": ["Coloque las harinas, la sal y la levadura en un tazón grande, mezcle un poco y luego haga un agujero en el medio. Squidge en la miel y agregue 350ml / 12oz de agua tibia (del grifo). Luego mezcle todo hasta que se combinen. Entonces, me gusta meter las manos (¡me parece muy terapéutico!) Y mezclar todo junto, recogiendo todas esas partes secas del fondo del tazón.", "Luego incline la masa en una superficie enharinada y amasar durante 10 minutos (o cinco minutos si lo amasa en un mezclador de alimentos equipado con un gancho de masa). Para probar y ver si ha sido lo suficientemente amasado, forma la masa en forma de bola con una buena parte superior tensa. Sumerja su dedo en la harina y luego pise el lado de la masa haciendo una sangría. La sangría debería retroceder hasta el final y casi desaparecer si está lista.", "Ponga un poco más de harina en la superficie y luego, usando un rodillo, enrolle la masa en un rectángulo de 40x24 cm / 15x9 pulgadas. Si es demasiado elástico para rodar, cúbralo con un paño de cocina y déjelo durante cinco minutos más o menos. De esta forma, los filamentos elásticos del gluten en el pan pueden relajarse un poco, lo que facilitará su despliegue.", "Usando un pincel de pastelería, cepille la parte superior de la masa con el aceite de sésamo hasta los bordes y luego espolvoree las semillas de amapola uniformemente por todas partes. Luego corte la masa en seis tiras anchas de 4cm / 1½ pulgadas de largo.", "Manteniendo las tiras alineadas, retuerza cada una como un palito de pan retorcido o paja de queso. Una vez que estén todos retorcidos, apilarlos en un paquete y recogerlos todos de una vez. Luego, gíralos para que tengas una cuerda larga y gruesa compuesta de hebras individuales de pan. Intente girarlo de manera uniforme para que la cuerda tenga un grosor uniforme en todo.", "Luego, curva el pan en forma de \"corona\" y aplasta los extremos, sellándolos con un poco de agua. No tiene que ser perfecto, siempre y cuando estén unidos. Cuando hago este pan, generalmente quedan muchas semillas de amapola en la superficie, así que las recojo y luego las esparzo por el pan, especialmente el trocito donde está la unión, para cubrirlo un poco.", "Coloque la corona en una bandeja para hornear. Engrase un poco de película adhesiva (creo que el aceite en aerosol es el mejor para esto) y úsela para cubrir la masa, con el lado aceitado hacia abajo, para que quede hermética pero con espacio suficiente para que la masa se eleve un poco.", "Usualmente pongo el horno para precalentar a 200C / 400F / Gas 6 ahora y pongo la masa en una silla cerca de ella, para que esté agradable y caliente. Déjala probar durante aproximadamente 30 minutos. Para probar si está listo para el horno (porque el pan no habrá duplicado su tamaño, pero probablemente haya crecido a la mitad más), espolvoree un poco de harina con el dedo y luego haga una sangría en el costado del pan. La sangría debería volver a la mitad. Si la sangría simplemente se queda allí y realmente no se mueve mucho, entonces necesita más tiempo.", "Cuando esté listo, colóquelo en el horno durante 35 minutos.", "El pan está cocido cuando suena hueco cuando se toca debajo. Si no, démosle otros cinco minutos más o menos en el horno.", "Una vez listo, retirar del horno y servir. Me encantan los crujientes pedacitos crujientes en el exterior y el suave almohadillado dentro untado con mucha mantequilla."], "url": "www_bbc_co_uk_food_recipes_twister_bread_10942", "title": "Pan Twister", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1 pan", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/twister_bread_10942_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["300g / 10½oz de azúcar glas", "25g / 1 oz de glucosa líquida", "50g / 1¾oz de leche condensada", "2 cucharaditas de extracto de vainilla u otro saborizante", "200g / 7oz de mantequilla sin sal, ablandada", "100g / 3½oz de margarina para hornear, ablandada", "200g / 7oz de azúcar glasé", "100ml / 3¾ fl oz crema doble", "colorante y saborizante"], "method": ["Mezcle el azúcar glas, la glucosa, la leche condensada, el saborizante y la mantequilla con un mezclador eléctrico en un recipiente hasta que quede suave y liviano, luego bata en la margarina para hornear hasta que quede suave.", "En una jarra, mezcle el azúcar glas en la crema hasta que se disuelva, luego agregue cualquier colorante o saborizante que desee, o simplemente déjelo en limpio. Bata esto gradualmente en la mezcla de mantequilla hasta que esté suave y esponjoso.", "Esta crema de mantequilla se mantiene muy bien cubierta a temperatura ambiente durante 2-3 días y se puede calentar ligeramente y volver a batir si la textura es demasiado firme."], "url": "www_bbc_co_uk_food_recipes_two-step_buttercream_19730", "title": "Crema de mantequilla de dos pasos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace suficiente para cubrir y cubrir una torta de cumpleaños redonda de 20cm / 8in", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/two-step_buttercream_19730_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo", "sal al gusto", "300g / 10oz de yogurt natural", "1 limón, solo jugo", "pequeñas hojas de menta picadas, picadas"], "method": ["Machaque el ajo con un poco de sal en un mortero para hacer una pasta.", "Agregue el yogur y el jugo de limón y mezcle bien. Revuelve a través de la menta. Dejar de lado hasta que sea necesario."], "url": "www_bbc_co_uk_food_recipes_tzatziki_01135", "title": "Tzatziki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 300 g / 10 oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz de yogur griego", "1 pepino", "2 cucharadas de jugo de limón", "2 dientes de ajo rallados finamente", "pizca de aceite de oliva virgen extra", "pimentón, para rociar"], "method": ["El mejor resultado se obtiene pelando y quitando la semilla del pepino antes de rallar. Cuelgue el pepino rallado en tela de muselina o un paño de cocina para exprimir todo el exceso de líquido.", "Combine el yogur, el pepino, el jugo de limón y el ajo. Agregue una pizca de aceite de oliva y espolvoree con pimentón.", "Perfecto para mojar sus berenjenas (consulte la receta para puré de berenjena y salsa de ajo)."], "url": "www_bbc_co_uk_food_recipes_tzatziki_13049", "title": "Tzatziki", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Algas marinas Kombu de 5 cm / 2 in", "1½ cucharadita de polvo dashi", "Jengibre fresco de 2½cm / 1in, pelado y rallado", "1 cucharada de pasta de miso blanco", "pizca de azúcar en polvo", "2 cucharadas de mirin", "75 g / 2½ oz de tofu, en cubos en pedazos de 1cm / ½ en trozos", "1 cucharada de aceite vegetal", "1 diente de ajo, finamente cortado", "4 hongos shiitake, en rodajas", "2 cabezas de bok choi, cortadas en cuartos", "75g / 2½oz de col rizada, desmenuzada", "1 calabacín pequeño, en rodajas", "50g / 2¾oz de arvejas de azúcar", "2 cucharadas de salsa de soja japonesa", "40 g / 2½ oz de hongos enoki, rotos en pedazos", "4 cebolletas, finamente cortadas", "1 cucharadita de Petite Pepper", "1 cucharadita de semillas de sésamo", "1 x 150g / 5oz paquete fideos udon"], "method": ["Para el caldo de miso, coloque una olla de agua a fuego medio y agregue las algas kombu.", "Agregue el polvo dashi, revuelva y deje hervir a fuego lento durante unos minutos. Agregue el jengibre rallado, la pasta de miso blanco, el azúcar y el mirin. Pruebe y ajuste la cantidad de azúcar o mirin si es necesario. Mantener caliente", "Para las verduras salteadas, caliente un wok con un poco de aceite vegetal hasta que brille, agregue el ajo en rodajas y fríalo suavemente durante 10 segundos. Incline los champiñones rebanados, el bok choi, la col rizada, el calabacín y los guisantes dulces.", "Continúe revolviendo el contenido del wok y cocínelo durante dos minutos más o menos, luego agregue la salsa de soja, las setas enoki y todo menos una cucharadita de cebolletas.", "Mientras tanto, trae una segunda sartén, llena de agua, hasta que hierva.", "Freír las verduras hasta que se ablanden un poco, luego agregar todo menos una pizca de pimienta schicimi y semillas de sésamo.", "Coloque los fideos udon en el agua hirviendo y cocine durante unos minutos, o hasta que se caliente, y luego drene.", "Para terminar el caldo de miso, agregue los cubos de tofu al caldo.", "Para servir, coloque los fideos udon en el fondo de un tazón, coloque los vegetales salteados en la parte superior y luego lavé sobre el caldo miso. Termine con la cebolla de primavera finamente cortada reservada y una pizca de semillas de sésamo y shichimi."], "url": "www_bbc_co_uk_food_recipes_udon_noodles_in_miso_41653", "title": "Fideos Udon en caldo de miso con verduras salteadas y pimienta shichimi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["800 g / 1 libra 12 oz bistec de carne de primera calidad, picada", "3 yemas de huevo", "1 cucharada de mostaza Dijon", "300ml / 10½ fl oz aceite de colza", "25 g / 1 oz de mostaza de cerveza o mostaza integral", "½ limón, solo jugo", "2 cucharadas de aceite vegetal", "4 rollos de brioche, cortados por la mitad", "4 cucharadas de salsa de chile suave lista para usar", "½ ronda de lechuga, hojas separadas", "2 tomates, en rodajas", "Rebanadas de queso 200 g / 7 oz, preferiblemente Monterey Jack", "8 pepinillos, escurridos, en rodajas", "1 cebolla roja, pelada, en rodajas", "sal y pimienta negra recién molida"], "method": ["Sazonar la carne picada de la carne con sal y pimienta negra recién molida y mezclar en un recipiente con las manos. Divida la carne picada en cuatro bolas del mismo tamaño y presione cada una entre sus palmas para formar una empanada. Coloque las hamburguesas en un plato, cubra y deje enfriar en la nevera durante una hora.", "Treinta minutos antes de que quieras comer, enciende tu barbacoa. Permita que las llamas se enciendan y se apaguen.", "Mientras tanto, en un tazón, mezcle las yemas de huevo y la mostaza hasta que estén bien combinados. Poco a poco agregue el aceite de colza en una corriente delgada, batiendo continuamente, hasta que la mezcla espese a una mayonesa y todo el aceite se ha incorporado. Agregue la mostaza de cerveza y el jugo de limón, luego condimente, al gusto, con sal y pimienta negra recién molida.", "Cuando las brasas estén brillando, frote las empanadas con aceite vegetal y cocine durante 3-4 minutos por cada lado, o hasta que estén cocidas a su gusto. (Alternativamente, cocine a fuego alto en una sartén plancha).", "Coloque cada brioche en la barbacoa, con el lado del corte hacia abajo, y cocine por un minuto, o hasta que aparezcan marcas en el pan. Dejar de lado.", "Para armar las hamburguesas, extiende un poco del condimento de chile en la base de cada bollo de brioche. Coloque una hoja de lechuga y una rodaja de tomate en la parte superior, luego agregue una hamburguesa, una rebanada de queso y una cucharada de mayonesa de mostaza. Cubra con unas rebanadas de pepinillo y cebolla roja, luego coloque la mitad superior del panecillo de brioche encima.", "Coloque las hamburguesas en los platos para servir, evitando que se vuelquen arrojándolas con brochetas de madera, si lo desea."], "url": "www_bbc_co_uk_food_recipes_ultimate_burger_in_a_73911", "title": "La mejor hamburguesa en un bollo de brioche", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ultimate_burger_in_a_73911_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 patatas nuevas", "2-3 cucharadas de aceite vegetal, para cocinar", "100 g / 3½ oz de pudin negro, cortado en anillos", "Tocino tocino 100 g / 3½ oz", "100g / 3½oz de chorizo ​​para cocinar", "2 chalotes de plátano, cortados en rodajas finas", "2 dientes de ajo rallados", "1 chile verde, en rodajas", "6 huevos de gallinas camperas, golpeados", "1 cucharada de romero picado", "1 manojo de perejil de hojaldre, hojas recogidas y picadas", "sal y pimienta negra recién molida"], "method": ["Cocine las papas nuevas en agua hirviendo con sal durante 12-15 hasta que estén suaves. Escurrir en un colador y luego dejar secar al vapor y enfriar. Cuando esté frío, córtalo por la mitad y manténgalo a un lado.", "Precalentar el horno a 220C / 425F / Gas 7.", "Caliente una sartén a prueba de horno de 25cm / 10in a fuego medio y vierta un poco de aceite. Freír la morcilla hasta que quede crujiente, retirar de la sartén y escurrir en el rollo de cocina. Agregue el tocino a la sartén y fría hasta que comience a dorarse y la grasa se elimine. Agregue todo el chorizo ​​a la sartén y fría con el tocino. El aceite de pimentón rojo ahumado comenzará a salir del chorizo. Retire el tocino y el chorizo ​​de la sartén y escurra sobre el rollo de cocina. Cuando el chorizo ​​esté lo suficientemente frío como para cortarlo, divídalo.", "Agregue una de las chalotas de plátano en rodajas y el ajo rallado a la sartén con todo el aceite vertido todavía en ella, y cocine a fuego lento hasta que estén blandos. Agregue las papas a la mitad y revuelva, luego coloque las carnes cocidas nuevamente en la sartén y agregue el chile verde.", "Vierta los huevos en la sartén, agregue el romero y la mitad del perejil picado. Sazone con sal y pimienta y revuelva lentamente a fuego lento hasta que comience a solidificarse. Coloque la sartén en el horno y cocine de 5 a 8 minutos, o hasta que los huevos estén listos e hinchados.", "Retire la sartén del horno, espolvoree el chalote crudo restante y el perejil picado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_ultimate_english_39468", "title": "Tortilla de desayuno inglés final", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["40 g / 1½ oz de mantequilla sin sal, derretida, más extra para engrasar", "5 huevos medianos de granja", "165 g / 5¾oz de azúcar en polvo", "2 naranjas grandes, ralladura finamente rallada solamente", "pizca de sal", "165g / 5¾oz de harina común", "55g / 2oz de mantequilla sin sal", "130g / 4⅔oz de azúcar morena clara", "5 cucharadas de crema doble", "1 cucharadita de sal marina", "Crema doble 600ml / 20fl oz", "1 cucharada de mantequilla (para espesar, si es necesario)", "color de la comida del gel de marfil (opcional)", "150ml / 5fl oz de crema doble", "Azúcar en polvo 135g / 5oz", "55 g / 2 oz de cacao en polvo", "3 hojas de gelatina", "100g / 3½ oz de azúcar granulada", "50 g / 1¾oz de avellanas blanqueadas", "rizos de chocolate (opcional)"], "method": ["Precaliente el horno a 180 ° C / 170 ° Ventilador / Gas 4. Engrase y alinee dos moldes para pasteles con forma de resorte de 20 cm / 8 pulg. Con papel de hornear.", "Para la génoise, medio lleno una olla grande con agua y llevar a fuego lento. En un tazón grande para mezclar a prueba de calor, combine los huevos y el azúcar, luego coloque el recipiente sobre la olla (creando un baño maría). Asegúrese de que el fondo del recipiente no toque el agua.", "Con un batidor eléctrico de mano, bata vigorosamente la mezcla durante aproximadamente 7 minutos, o hasta que se triplique en volumen, pálida y deja cintas en la superficie cuando se levanta el batidor. Retire la mezcla del fuego tan pronto como esté caliente al tacto para evitar cocinar los huevos.", "Doble suavemente la ralladura de naranja y la sal. Tamizar la harina en la mezcla en tres lotes, doblando suavemente en cada lote antes de agregar el siguiente. Vierta lentamente la mantequilla derretida por el costado del tazón y dóblela.", "Divida la mezcla por igual entre las latas de torta preparadas, vertiendo desde la altura más baja posible. Coloque en el estante del medio del horno y hornee durante 18-20 minutos, o hasta que estén saliendo de los lados de la lata y un pincho de pastel insertado en el medio sale limpio. Enfríe en la lata durante 5 minutos y luego transfiéralo a una rejilla para que se enfríe por completo.", "Para la salsa de caramelo salado, ponga la mantequilla y el azúcar moreno claro en una cacerola pequeña a fuego lento y revuelva hasta que el azúcar se derrita (aproximadamente 3 minutos). Rocíe en la crema doble, mezcle bien, tenga cuidado ya que la mezcla puede salpicar. Llevar a ebullición y hervir a fuego lento durante 1 minuto, luego retirar del fuego. Agregue la sal marina y déjela enfriar, revolviendo frecuentemente para evitar que se forme una costra. Cuando se haya enfriado, bátalo durante 1-2 minutos para incorporar algo de aire.", "Para la base de crema, bata la crema doble hasta que se formen picos duros. A continuación, mezcle el caramelo salado para hacer una crema de caramelo con sal. Si la mezcla está demasiado floja, bata la mantequilla hasta que quede suave y agrégala a la crema de caramelo salada según sea necesario. Use un palillo de dientes para agregar suficiente colorante de marfil para hacer un color marrón claro / naranja (si lo usa).", "Para armar el pastel, corte cada pastel por la mitad horizontalmente para hacer cuatro capas. Coloque con cuidado la primera capa en una tarta de pastel. Usando una espátula, extienda aproximadamente 5 mm de crema en la parte superior en una capa uniforme. Coloque la siguiente capa de génoise en la parte superior y repita las capas de crema y pastel hasta que tenga cuatro capas de génoise con crema de caramelo con sal encima de cada capa.", "Aplique una \"capa de migas\" de crema por todo el pastel, asegurándose de que se llenen los huecos para dar una superficie lisa. Asegúrese de que no haya bordes sobresalientes, ya que esto afectará el glaseado del espejo más adelante. Transfiera la torta a la nevera durante 20-30 minutos.", "Retire la tarta del refrigerador y agregue una capa final de crema por todas partes, y termínela cuidadosamente con una espátula (cuanto más suave sea la crema, mejor será el acabado final). Vuelva a colocar en la nevera durante 20 minutos, junto con la crema restante.", "Para el glaseado de chocolate, agregue la crema, el azúcar, el cacao en polvo y 150 ml / 5 fl oz de agua en una cacerola pequeña y caliente suavemente hasta que el azúcar se disuelva por completo. Mantenga la agitación durante el calentamiento. Llevar a ebullición y cocine a fuego lento durante 2 minutos. Retirar del fuego y dejar enfriar durante 10 minutos.", "Remoje las hojas de gelatina en un recipiente con agua fría durante 5 minutos. Exprima el exceso de agua de las hojas y mezcle con el esmalte hasta que se disuelva por completo. Use un termómetro de azúcar para verificar la temperatura del glaseado y enfríelo a un máximo de 38 ° C antes de usar.", "Pase el glaseado a través de un tamiz fino en una jarra medidora y toque una superficie dura para alentar las burbujas de aire.", "Una vez que la torta ha terminado de enfriarse en la nevera, transfiérala a un estante de enfriamiento de alambre colocado en una bandeja grande para hornear para recoger el exceso de glaseado mientras lo vierte sobre la torta.", "Vierta el glaseado uniformemente sobre la parte superior de la torta. Compruebe que los lados de la torta estén cubiertos y agregue más glaseado si es necesario al reutilizar cualquier exceso de esmalte que haya quedado atrapado en la bandeja de hornear. Inmediatamente transfiera la torta al refrigerador para reafirmarla.", "Para decorar, hacer un caramelo. Ponga el azúcar y 1-2 cucharadas de agua en una sartén pequeña a fuego medio. No te muevas, solo agita la sartén. Caliente hasta que el azúcar tenga un color caramelo ámbar, luego retírelo del fuego.", "Mientras tanto, une cada avellana al extremo de un palito de cóctel. Con mucho cuidado sumerja cada avellana en el caramelo (el caramelo estará muy caliente, así que tenga cuidado de no quemarse) y cuélguelo sobre el borde de la superficie de trabajo, usando una tabla de cortar pesada para sostener el cóctel en su lugar - proteja el piso y cualquier armario y con periódico como el caramelo goteará. Esto formará un \"pico\" de caramelo a medida que el caramelo se estira. Una vez que todas las avellanas estén cubiertas, recorte las espigas al mismo largo con unas tijeras y quítelas de los palitos de cóctel en una hoja de papel pergamino.", "Para finalizar, coloque la torta en un plato para servir y pinte pequeños círculos de crema de caramelo con sal alrededor del borde superior de la torta y coloque una avellana caramelizada en cada círculo."], "url": "www_bbc_co_uk_food_recipes_ultimate_indulgence_90754", "title": "Pastel de glaseado espejo indulgencia final", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 1 torta grande", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ultimate_indulgence_90754_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["110ml / 3¾fl oz de vinagre de arroz", "Azúcar superfino 110 g / 4oz o azúcar en polvo", "1 cucharadita de sal kosher o sal marina", "500g / 1lb 2oz de rábano, preferiblemente Daikon, cortado en cubos de 10 mm / ½ in", "35g / 1¼ oz de harina de maíz", "2½ cucharadita de sal kosher o sal marina", "½ cucharadita de polvo de hornear", "pimienta negra recién molida", "2 muslos de pollo, muslos y alas (con puntas), huesos, piel", "aceite vegetal, para freír", "70g / 2½ oz de harina de maíz", "35g / 1¼ oz de harina de matz fino", "35g / 1¼ oz de harina común", "2 cucharadas de hojuelas de chile, preferiblemente hojuelas de chile coreano (gochugaru)", "1 cucharada de sal kosher o sal marina", "2½ cucharaditas de gránulos de ajo", "2½ cucharaditas de gránulos de cebolla", "¼ cucharadita de polvo de hornear", "5 cucharadas de vodka", "2 cucharadas de pasta de chile, preferiblemente pasta de chile coreano (gochujang)", "250ml / 9fl oz de salsa de soja", "2 cucharadas de vinagre de vino de arroz", "4 cucharadas de mirin", "100g / 3½oz de azúcar moreno oscuro", "2 dientes de ajo, aplastados", "4 cucharaditas de jengibre fresco rallado", "½ cucharadita de pasta de chile, preferiblemente gochujang (pasta de chile coreano)", "1 cucharadita de aceite de sésamo", "1½ cucharada de harina de maíz", "Pasta de chile 70g / 2½ oz, preferiblemente pasta de chile coreano (gochujang)", "4 cucharaditas de salsa de soja", "1 cucharada de vinagre de vino de arroz", "70g / 2½oz de azúcar moreno oscuro", "3 dientes de ajo, aplastados", "2 cucharaditas de jengibre fresco rallado", "4 cucharaditas de aceite de sésamo", "1 cucharadita de semillas de sésamo blanco tostado", "¼ manojo de cebollín fresco, picado", "2 cucharaditas de semillas de sésamo negro"], "method": ["Para el rábano encurtido, ponga el vinagre de arroz, el azúcar, la sal y 110 ml / 3 lfl de agua en un tazón. Batir hasta que el azúcar y la sal se hayan disuelto. Agregue el rábano y revuelva para cubrir. Cubra y deje a temperatura ambiente durante 24 horas, luego coloque en la nevera.", "Para el recubrimiento, ponga la harina de maíz, la sal, el polvo de hornear y la pimienta en un tazón grande y mezcle. Agregue el pollo y mezcle bien hasta que esté bien cubierto. Transfiera el pollo a un estante, sacudariendo bien para eliminar cualquier exceso de recubrimiento. Dejar reposar durante 1 hora en la nevera.", "Vierta suficiente aceite en una cazuela grande para alcanzar una profundidad de 5 cm. Caliente el aceite a fuego medio-alto hasta que alcance 175C / 350F (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Para la mezcla, mezcle los ingredientes secos en un tazón grande. En un recipiente aparte, bata los ingredientes húmedos y 235 ml / 8¼ fl oz de agua juntas. Justo antes de freír, mezcle la mezcla húmeda en la mezcla seca. La consistencia debe ser relativamente delgada y líquida.", "Sumerja cada trozo de pollo en la mezcla, dejando que el exceso de la mezcla gotee. Suspenda el pollo en el aceite durante un par de segundos para que se fije antes de dejar que se deslice completamente en el aceite. Es posible que deba hacer esto en lotes.", "Freír el pollo durante 15-20 minutos, o hasta que esté dorado y cocido. Transfiera a una rejilla para drenar.", "Para la salsa negra de umani de soya, ponga todos los ingredientes excepto la harina de maíz en una olla pequeña y cocine a fuego medio hasta que el azúcar se disuelva. Mezcle la harina de maíz con 1½ cucharada de agua y bata en la salsa. Llevar a ebullición, luego retirar del fuego.", "Para la salsa de chile rojo, coloque todos los ingredientes en una cacerola pequeña y cocine a fuego medio durante 2 a 3 minutos, batiendo bien para asegurarse de que los ingredientes se disuelvan e incorporen. .", "Coloque el pollo y los rábanos encurtidos en un plato con las salsas. Adorne con cebolletas frescas y semillas de sésamo."], "url": "www_bbc_co_uk_food_recipes_ultimate_korean_fried_29527", "title": "Ultimate pollo frito coreano con rábano picado", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "100g / 3½ oz de setas de rebozuelo amarillo, lavadas y picadas", "100 g / 3½ oz ceps, lavados y toscamente picados", "40 g / 1½ oz de mantequilla sin sal, más extra para engrasar", "½ chalota, finamente picada", "2 dientes de ajo, finamente picados", "2 rebanadas finas de panceta, cortadas en tiras finas", "sal", "2 huevos de gallinas camperas", "160g / 5½ oz crema batida", "4 yemas de huevo de rango medio", "120 g / 4¼ oz de queso parmesano, rallado", "200ml / 7fl oz de leche entera", "pimienta", "Jus de pollo 200ml / 7fl oz o caldo de pollo reducido, calentado", "4 rebanadas de tocino", "25ml / 1fl oz de aceite de oliva", "1 calabacín, finamente picado", "Mangetout 100 g / 3½ oz, en rodajas", "100g / 3½oz de espárragos en rodajas", "Setas girolle 150 g / 5½ oz, limpiadas", "100g / 3½oz de guisantes frescos", "Parmesano 100 g / 3½ oz, rallado", "Harina normal de 10g / ¼ oz"], "method": ["Para el parmesano y la crema de champiñones silvestres, precaliente el horno a 150 ° C / 300 ° F / Gas 2 y engrase cuatro moldes.", "Vierta el aceite de oliva en una sartén caliente y freír los champiñones y ceps por un minuto hasta que liberen el agua. Escurrir y reservar los champiñones. Deseche el líquido de cocción.", "Derrita la mantequilla en la sartén que se usa para cocinar los champiñones. Cuando la mantequilla esté dorada, agregue los chalotes, el ajo y la panceta en rodajas. Revuelva y devuelva los champiñones a la sartén.", "Sazonar con sal y revolver. Continúe cocinando durante dos minutos, teniendo cuidado de no colorear los champiñones (les hará un sabor ligeramente amargo). Transfiere a un plato para enfriar.", "Cuando la mezcla de hongos esté fría, divídala entre los moldes preparados.", "En un tazón, bata los huevos y la crema batida. Mezcle las yemas de huevo, parmesano y leche. Sazone al gusto con sal y pimienta.", "Divida la mezcla de manera uniforme entre los moldes preparados. Coloque en una fuente para hornear y vierta agua fría en la fuente para hornear para llegar a la mitad del costado de los moldes. Cocine en el horno durante 20-25 minutos.", "Comprueba que las natillas estén cocidas insertando un cuchillo en una de ellas, si sale limpia, la crema está cocida. Regrese al horno por unos minutos si es necesario. Cuando las natillas estén cocidas, sepáralas para que se enfríen un poco.", "Para el popurrí de verduras, precaliente el horno a 220C / 425F / Gas 7.", "Coloque la panceta entre dos bandejas para hornear que encajen entre sí y hornee en el horno durante 5-6 minutos, o hasta que estén crujientes. Retire del horno y deje enfriar con la bandeja de hornear encima para que la panceta se mantenga recta.", "Calentar una sartén grande y agregar el aceite de oliva. Una vez caliente, agregue el calabacín, mangetout, espárragos, girolles y guisantes y cocínelos (sin colorear) hasta que estén tiernos.", "Coloque el parmesano y la harina en un bol y mezcle. Para hacer un parmesano crujiente, caliente una sartén y espolvoree un cuarto de la mezcla en una línea ordenada. Cuando la mezcla empiece a burbujear, sáquelo de la sartén en una sola pieza y colóquelo sobre un rodillo para curvar el parmesano crujiente. Repita con la mezcla restante.", "Para servir, agregue una cucharada de jus caliente de pollo a las natillas. Coloque las verduras y una rodaja de panceta en la parte superior de las natillas con un parmesano crujiente."], "url": "www_bbc_co_uk_food_recipes_umami_bomb_parmesan_and_62918", "title": "Bomba Umami (parmesano y crema de hongos silvestres)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½ oz de pechugas de pollo", "1 cucharada de aceite de colza", "½ cebolla, picada", "50g / 1¾oz de guisantes congelados", "6 hongos shiitake frescos, cortados en cubitos", "1 cucharada de vino de arroz Shaoxing", "½ cucharadita de polvo chino de cinco especias", "150ml / 5fl oz de caldo de pollo", "150ml / 5fl oz de crema doble", "1 cucharada de hojas de estragón fresco picado", "1 cucharada de salsa de soja ligera", "sal marina y pimienta negra molida", "3 hojas de hojaldre", "1 huevo de gallinas camperas"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Cueza el pollo en una sartén grande con tapa con agua. Cubra con la tapa y deje que hierva, reduzca el fuego y cocine a fuego lento durante 20 minutos o hasta que el pollo esté cocido. Retire el pollo de la sartén y déjelo enfriar. Una vez frío, tritura el pollo.", "Calentar un wok a fuego alto. Agregue el aceite de colza y saltee las cebollas hasta que estén ligeramente translúcidas, luego agregue los guisantes, las setas y el vino de arroz. Revuelva freír por un minuto. Agregue el pollo picado y las cinco especias chinas y cocine por 30 segundos. Agregue el caldo y revuelva bien. Vierta la crema doble y el estragón. Sazone con salsa de soja, sal y pimienta negra. Dejar de lado.", "Estirar los pasteles a aproximadamente 3 mm / ⅛ de espesor. Con los cortadores de hojaldre, corte suficientes pasteles para alinear las bases de la bandeja del muffin y cree las partes superiores del pastel.", "Línea de la bandeja con la masa y luego cuchara el relleno en la parte superior. Batir un huevo, cubrir los pasteles con hojaldre y glasear con el huevo.", "Hornee por 25 minutos hasta que la masa esté dorada. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_unami_chicken_and_08796", "title": "Pollo Umami y tartas de champiñones shiitake", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 mini pies", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla ablandada, más extra para engrasar", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas", "Harina de 175g / 6oz de auto crianza", "½ cucharadita de extracto de vainilla", "colorante de comida azul", "300g / 10½ azúcar glasé", "150 g / 5¼ onza de mantequilla, ablandada", "6 cucharadas de mermelada de fresa de buena calidad", "500g / 1lb 2 oz blanco, mazapán listo para usar", "2-3 cucharadas de azúcar glas, para quitar el polvo"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Engrase y forre una lata cuadrada de 20 cm / 8 pulgadas.", "Batir la mantequilla y el azúcar en un bol hasta que estén suaves y esponjosos. Batir los huevos, poco a poco, hasta que estén bien combinados. (Si la mezcla parece que está cuajando, agregue una cucharada de harina). Doble la harina. Poco a poco, agregue unas gotas de colorante azul para alimentos (no agregue demasiado o el pastel se verá verde).", "Con una cuchara, coloca la masa de la torta en la lata de la torta y nivelala con el dorso de una cuchara. Hornee durante 35-40 minutos, o hasta que estén doradas y una brocheta insertada en el centro salga limpia.", "Retire la torta del horno, déjela enfriar durante cinco minutos, luego déjela enfriar, boca abajo, sobre una rejilla de alambre.", "Para el relleno de crema de mantequilla, bata la mantequilla en un bol hasta que esté suave y suave, bata lentamente el azúcar glas. Continúa batiendo hasta que quede esponjoso.", "Para armar el pastel, corte el pastel por la mitad a lo largo, coloque una esponja sobre la otra mitad y recorte los bordes, asegurándose de que ambas tortas sean del mismo tamaño.", "Corta los pasteles por la mitad otra vez a lo largo para hacer cuatro rectángulos largos.", "Corta cada rectángulo diagonalmente a lo largo para hacer dos tortas triangulares", "Extienda cada lado cortado del triángulo con crema de mantequilla y mermelada y sándwich junto con el otro triángulo para hacer cuatro secciones rectangulares. Envuelva cada sección rectangular en film transparente y relájese durante al menos una hora.", "Apile las secciones rectangulares en un cuadrado, de modo que la sección transversal se parezca a un Union Jack (utilice una imagen del Union Jack como guía).", "Ensamble la mitad inferior de la torta primero extendiendo cada uno de los bordes interiores largos con crema de mantequilla y mermelada y sándwich juntos. Repita con la capa superior y enfríe ambas tortas durante una hora.", "Finalmente, empareje las dos tortas juntas separando la parte superior de la capa inferior y la parte inferior de la capa superior con glaseado de crema de mantequilla. Extienda la capa inferior con mermelada y sándwich juntos. Enfríe el pastel por una hora.", "Mientras tanto, enrolle el mazapán en una superficie espolvoreada con azúcar glasé hasta un grosor de 5 mm / ¼, debe ser lo suficientemente grande como para cubrir el pastel.", "Caliente un poco de mermelada de fresa y use esto para cepillar la parte exterior de la torta fría.", "Voltee la torta boca abajo en el mazapán y cepille la parte inferior de las esponjas con el atasco.", "Envuelva el mazapán alrededor del pastel, presionándolo suavemente sobre la superficie de las esponjas, y presione los bordes para formar una unión firme.", "Regrese con la costura debajo, recorte una fina rebanada en cada extremo y colóquela en un plato para servir. Tome una rebanada de cada extremo de la torta para limpiar el borde y debería revelar una versión de torta de Union Jack."], "url": "www_bbc_co_uk_food_recipes_union_jack_battenburg_15063", "title": "Pastel Union Jack Battenberg", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 1 torta", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/union_jack_battenburg_15063_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de azúcar demerara", "3 peras inglesas, peladas, sin corazón y cortadas a la mitad", "6 cerezas heladas", "100g / 4oz de mantequilla sin sal", "100g / 4 oz de jarabe de oro", "100g / 4 oz de melaza negra", "1 huevo grande de gallinas camperas", "150ml / 5fl oz de leche tibia", "1 cucharadita de bicarbonato de soda", "Harina normal 225g / 8oz", "1 cucharada de canela molida", "1 jengibre molido cucharadita de jengibre", "75g / 3oz azúcar moreno claro", "helado de vainilla, para servir"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / gas 4. Alinee la base y los lados de una lata de pastel redonda de 20 cm / 8 pulg. De lado profundo con un pergamino antiadherente para hornear. Espolvorea la base con el azúcar demerara.", "Coloque una cereza en la cavidad de cada mitad de pera donde se ha extraído el núcleo, luego coloque las peras, con el lado cortado hacia abajo, sobre el azúcar en el molde de la torta, irradiando desde el centro de la lata.", "Derrita la mantequilla, el jarabe y la melaza juntos en una sartén pequeña a fuego lento, luego reserve. En una jarra, mezcle el huevo, la leche y el bicarbonato de soda.", "Tamiza la harina, la canela y el jengibre en un recipiente para mezclar y agrega el azúcar morena suave. Haga un pozo en el centro y vierta los ingredientes derretidos y la mezcla de huevo y leche. Revuelva bien hasta que esté bien combinado. Vierta sobre las peras en la lata de torta preparada.", "Hornee en el centro del horno durante aproximadamente 45 minutos, o hasta que esté bien levantado, dorado y firme al tacto. Dejar enfriar en la lata durante 3-4 minutos y luego colocarlo en un plato para servir, con la pera hacia arriba. Cortar en rodajas gruesas y servir caliente con helado de vainilla."], "url": "www_bbc_co_uk_food_recipes_upside_down_winter_10049", "title": "Pudín de invierno boca abajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de mantequilla sin sal ablandada", "175g / 6oz de azúcar en polvo", "3 huevos de gallinas camperas, ligeramente golpeados", "Harina de 175g / 6oz de auto crianza", "1-2 cucharadas de leche", "50 g / 1 oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "¼ cucharadita de esencia de limón", "150g / 5½oz de azúcar glas", "75g / 2¾oz de mantequilla, ablandada", "3-5 cucharadas de mermelada de fresa", "2 cucharadas de mermelada de albaricoque, calentado suavemente, luego pasado a través de un tamiz", "Mazapán 250 g / 9 oz", "450g / 1 libra de azúcar glasé glaseado", "colorante de comida rojo y azul"], "method": ["Precaliente el horno a 190 ° C / 375 ° F / Gas 5. Engrase y forre una lata cuadrada de 20 cm / 8 pulgadas.", "Batir la mantequilla y el azúcar en un bol hasta que estén suaves y esponjosos. Batir los huevos, poco a poco, hasta que estén bien combinados. (Si la mezcla parece que está cuajando, agregue una cucharada de la harina.) Doble la harina y agregue un poco de leche si la mezcla se ve tieso.", "Con una cuchara, coloca la masa de la torta en la lata de la torta y nivelala con el dorso de una cuchara. Hornee durante 35-40 minutos, o hasta que estén doradas y una brocheta insertada en el centro salga limpia.", "Retire la torta del horno, déjela enfriar durante 5 minutos, luego déjela enfriar y déjela enfriar por completo, al revés, sobre una rejilla.", "Mientras tanto, para el jarabe de azúcar, caliente el azúcar y el agua en una cacerola hasta que el azúcar se haya disuelto. Agregue la esencia de limón.", "Para el relleno, bata la mantequilla en un bol hasta que esté suave y suave, bata lentamente en el azúcar glasé. Continúa batiendo hasta que quede esponjoso.", "Con mucho cuidado, con el cuchillo más largo que tenga, retire la corteza oscura de la parte superior del pastel y revuelva el pastel. A continuación, corte el pastel por la mitad horizontalmente.", "Rocíe o cepille la capa de la torta inferior con el jarabe de azúcar y luego unte con la crema de mantequilla. Cubra con la mermelada y cuidadosamente sándwich con la mitad superior de la torta.", "Envuelva la torta en una película adhesiva y déjela enfriar durante 2 a 3 horas, esto hará que sea más fácil cortar el pastel más tarde.", "Espolvoree ligeramente la superficie de trabajo con azúcar glas y extienda el mazapán al mismo tamaño que la torta. Una vez que el pastel esté frío, cepille la parte superior del pastel con la mermelada de albaricoque tamizada. Con cuidado, levante el mazapán sobre el pastel, alisarlo plano en la parte superior del pastel y cortar el exceso de mazapán. Corta el pastel en cuadrados iguales de 25 x 4 cm / 1 ½.", "Tamiza el azúcar impalpable en un tazón pequeño y agrega suficiente agua caliente para hacer un glaseado suave lo suficientemente grueso como para cubrir los pasteles. Reservando tres cucharadas de glaseado en dos tazones, cúbralo con una película adhesiva y déjelo a un lado.", "Cubra los cuadrados de la torta con el glaseado, facilitando la formación de hielo a los lados de los pasteles hasta que tenga un recubrimiento uniforme en todos los pasteles. Coloque las tortas en una rejilla para enfriar hasta que se forme la formación de hielo.", "Agregue unas gotas de colorante azul a uno de los tazones de glaseado, mezcle con una pasta suave y con una cuchara en una manga pastelera con una boquilla muy fina. Repita con el otro tazón de glaseado usando el colorante rojo para alimentos.", "Use estos dos colores para conectar el conector Union en las fantasías de fondant. ¡Sé tan simple o intrincado como te atreves! Retire con cuidado los pasteles del estante y siéntese en cajas de papel."], "url": "www_bbc_co_uk_food_recipes_union_jack_fondant_70560", "title": "Fantasías de fondant Union Jack", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace 25", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/union_jack_fondant_70560_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "200g / 7oz de tomates cherry", "100 g / 3½ oz de azúcar en polvo", "1 cucharada de salvia fresca picada", "100 g / 3½ oz de harina natural, más extra para espolvorear", "55 g / 2 oz de mantequilla", "2 cucharadas de aceite de oliva", "2 cucharadas de agua fría", "2 cucharadas de vinagre balsámico, para servir"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el llenado, caliente el aceite en una sartén pequeña a prueba de horno. Agregue los tomates y el azúcar y fríalos hasta que los tomates comiencen a ablandarse y el azúcar se vuelva dorado claro. Esparce la salvia picada sobre los tomates.", "Para la masa, coloque la harina y la mantequilla en un procesador de alimentos. Mezcle hasta que se asemeje a migas de pan.", "Agregue el aceite y el agua y mezcle durante unos segundos más. Incline sobre una superficie de trabajo ligeramente espolvoreada con harina y apelmace ligeramente para formar una masa suave.", "Usando un rodillo, ruede hacia un círculo redondo ligeramente más grande que la sartén.", "Coloque la masa en la parte superior de los tomates fritos y meta los bordes en el relleno.", "Coloque la sartén en el horno y cocine durante aproximadamente 12 minutos, hasta que la masa esté dorada y cocida en la parte superior.", "Con cuidado, colóquelo en un plato grande, de modo que los tomates estén arriba. Rocíe con vinagre balsámico y sirva caliente."], "url": "www_bbc_co_uk_food_recipes_upsidedowncherrytoma_87767", "title": "Tarta tatin de tomate cherry al revés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55 g / 2 oz de mantequilla", "Azúcar en polvo de 55 g / 2 oz", "1 pera, núcleo eliminado y en rodajas", "100 g / 3½ oz de nueces", "125g / 4½oz de mantequilla, suavizada", "125g / 4½ oz de harina de auto crianza", "3 cucharadas de azúcar en polvo", "2 huevos de gallinas camperas", "Crema doble de 150 ml / 1/4 de pinta", "2 cucharadas de miel"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Derrita la mantequilla y el azúcar en una sartén pequeña, a prueba de horno, a fuego lento hasta que el azúcar empiece a ponerse de color marrón claro. Agregue la pera y saltee ligeramente por unos minutos. Ponlo a un lado.", "Para el frangipane, coloca las nueces en un procesador de alimentos y muévelo hasta que quede un polvo. Agregue los ingredientes restantes de frangipane al procesador de alimentos y vuelva a dar vueltas hasta que quede suave. Vierta la mezcla sobre las peras y nivele la parte superior.", "Coloque la sartén en el horno y hornee durante aproximadamente 12-15 minutos o hasta que el frangipano esté cocido. Afloje los bordes de la tarta, luego cuidadosamente gire sobre un plato.", "Para la crema con miel, bate la crema en un tazón y agrega la miel. Vierta la crema con miel sobre la tarta. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_upsidedownpearandwal_87281", "title": "Tarta de frangipanes de pera y nuez al revés con crema de miel", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal 225g / 8oz", "100g / 3½oz de mantequilla sin sal", "2 huevos de gallinas camperas", "30 ml / 1 fl oz de agua", "1 cucharada de aceite de oliva", "2 dientes de ajo, finamente picados", "1 chalota, en rodajas", "4 chuletas de chump de cordero, en rodajas", "sal y pimienta negra recién molida", "50ml / 2fl oz de vino tinto", "Aceitunas de 25 g / 1 oz, pozos eliminados, picados", "25g / 1oz de tomates cherry, picados", "15g / ½oz de hojas de menta, picadas", "50g / 2oz de queso feta", "hojas de perejil, para adornar", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la masa, coloque la harina y la mantequilla en un procesador de alimentos y mezcle hasta obtener una mezcla que se asemeje a pan rallado grueso.", "Agregue un huevo y el agua y hágala hasta que la masa se una en una masa.", "Enrolle la masa en una superficie enharinada a 1/2 cm de grosor. Use un plato pequeño como guía para cortar la masa en un círculo.", "Coloque en una bandeja para hornear y en el horno para hornear durante 12 minutos.", "Para hacer el relleno, caliente el aceite en una sartén y fría el ajo y la chalota hasta que se ablanden.", "Sazone el cordero con sal y pimienta negra recién molida y agregue a la sartén. Freír hasta que esté bien cocido, luego retirar de la sartén y reservar.", "Vierta el vino tinto y deje que burbujee durante 1 minuto, luego agregue las aceitunas, los tomates y la menta. Mezcle y sazone con sal y pimienta negra recién molida.", "Para servir, coloque la masa en un plato, espolvoree la mezcla de cordero, revuelva sobre el queso feta y adorne con unas hojas de perejil."], "url": "www_bbc_co_uk_food_recipes_v_81322", "title": "Tarta de cordero abierta con queso feta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "3 chalotes, picados", "1 zanahoria, picada", "1 puerro, picado", "1 bulbo de hinojo, picado", "2 palitos de apio, picados", "2 dientes de ajo picados", "30g / 1oz de puré de tomate", "4 tomates, desollados y picados", "Brandy de 60 ml / 2 fl oz", "175ml / 6fl oz de vino blanco", "300 g / 11 oz de salmón y bacalao mezclados, picados", "900ml / 1¾ pintas de caldo de pescado", "1 hoja de laurel", "1 ramita de estragón", "pizca de cayena", "400g / 14oz surtido de pescados y mariscos, como salmón, bacalao, patín y almejas", "12 papas nuevas cocidas", "2 zanahorias, cortadas y cocinadas", "100g / 3½oz de frijoles finos, picados y cocidos", "Crema doble de 50-100 ml / 2-3½ fl oz", "1 cucharada de perejil fresco picado", "1 limón, solo jugo", "sal y pimienta negra recién molida", "pan crujiente", "mayonesa de ajo"], "method": ["Para la salsa, caliente el aceite en una cazuela. Agregue los chalotes, el puerro, la zanahoria, el hinojo, el ajo y el apio y freír durante 10 minutos a fuego lento hasta que estén suaves.", "Agregue el puré de tomate, los tomates picados, el vino blanco y el brandy y cocine para reducir a la mitad.", "Agregue el salmón y el bacalao picados y cocine durante cinco minutos.", "Agregue el caldo de cultivo, la hoja de laurel, el estragón y la pimienta de cayena, luego cubra y cocine a fuego lento durante 40 minutos.", "Mezcle la mezcla, luego pase a través de un colador (empuje la mezcla a través del colador para obtener el mayor sabor posible).", "Para el estofado, vuelva a verter la salsa tamizada en la cazuela y deje que hierva. Agregue el pescado y las verduras y cocine a fuego lento durante 3-4 minutos o hasta que el pescado esté bien cocido.", "Cuando esté cocido, mezcle la crema doble y mezcle con el perejil.", "Agregue el jugo de limón y sazone con sal y pimienta negra recién molida. Sirva con pan crujiente y mayonesa de ajo."], "url": "www_bbc_co_uk_food_recipes_valencianfishstew_83162", "title": "Guiso de pescado valenciano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]