[{"ingredients": ["180 g / 6¼ oz de almendras molidas", "2 huevos de gallinas camperas", "4 pechugas de pollo, cortadas en pepitas", "1½ cucharadita de sal", "pimienta negra recién molida, al gusto", "1 cucharada de mantequilla", "¾ cucharadita de cebolla en polvo", "¾ cucharadita de ajo en polvo", "3 cucharadas de puré de tomate", "2 cucharadas de mantequilla, derretida", "2 cucharadas de vinagre balsámico", "½ cucharadita de pimentón ahumado, al gusto", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con papel para hornear.", "Vierta las almendras molidas en un tazón y mezcle el condimento. Batir los huevos en un recipiente aparte.", "Sazone las piezas de pollo con sal y pimienta. Sumerja cada pieza de pollo primero en el huevo, luego enrolle las almendras hasta que estén completamente cubiertas. Coloque los nuggets en la bandeja de horno preparada.", "Derrita la mantequilla en una olla pequeña a fuego lento. Rocíe la mantequilla derretida sobre las pepitas. Hornee en el horno durante 18-20 minutos, volteando hasta la mitad de la cocción, hasta que esté cocido y dorado.", "Mientras tanto, para la salsa BBQ, mezcle el puré de tomate, la mantequilla derretida y el vinagre balsámico hasta que estén bien combinados. Sazonar con sal, pimienta y pimentón ahumado.", "Transfiera la salsa de barbacoa a un recipiente hermético y esterilizado y deje enfriar en el refrigerador hasta que sea necesario. Se mantendrá en un frasco sellado por hasta 1 semana."], "url": "www_bbc_co_uk_food_recipes_chicken_nuggets_with_61414", "title": "Nuggets de pollo con salsa de barbacoa fácil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_nuggets_with_61414_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 muslos de pollo, huesos retirados", "3 cucharadas de aceite vegetal", "1 chalote de plátano grande, finamente cortado", "3 chiles rojos a la vista de pájaro cortados en rodajas", "2 dientes de ajo, finamente picados", "1 cucharada de jengibre fresco, finamente picado", "100g / 3½oz de gambas peladas cocidas", "Fideos de arroz de 300 g / 11oz, cocidos de acuerdo con las instrucciones del paquete", "100g / 3½oz de brotes de soja", "4 cucharadas de pasta de tamarindo", "4 cucharadas de salsa de pescado", "4 cucharadas de salsa de soja", "½ cucharadita de pimienta blanca recién molida", "2 huevos de gallinas camperas, golpeados", "2 limas, solo jugo", "3 cucharadas de cilantro picado", "2 cucharadas de cacahuetes salados tostados, aplastados"], "method": ["Caliente una sartén hasta que esté medianamente caliente, agregue una cucharada de aceite y fríe los muslos de pollo, con la piel hacia abajo, durante 3-4 minutos hasta que la piel esté crujiente. Voltee los muslos y cocine por otros 3-4 minutos o hasta que estén cocidos. Retire de la sartén y déjela a un lado para escurrir sobre papel de cocina.", "Cuando el pollo esté lo suficientemente frío como para manipularlo, corte en rodajas finas y déjelo a un lado.", "Caliente un wok hasta que esté caliente, luego agregue el aceite restante, el chalote, el chile, el ajo y el jengibre y saltee por un minuto.", "Agregue las gambas y el pollo cocido y cocine por un minuto más. Agregue los fideos y los brotes de soja y saltee para calentar, luego agregue la pasta de tamarindo, pescado y salsas de soja, pimienta y jugo de lima y revuelva para cubrir.", "Agregue el huevo batido al wok y mezcle los fideos en el huevo, y continúe revolviendo por 1-2 minutos. Espolvoree con el cilantro y la mitad de los cacahuetes.", "Para servir, apile un poco de tarta en los platos y espolvoree con el resto del maní triturado."], "url": "www_bbc_co_uk_food_recipes_chicken_pad_thai_96522", "title": "Pollo y gambas tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "8 muslos de pollo, piel y hueso", "2 cebollas, finamente picadas", "2 dientes de ajo, aplastados", "2 pimientos verdes, sin semillas y finamente picados", "3 cucharadas de pimentón dulce ahumado", "1 cucharadita de pimentón picante", "1 cucharada de harina normal", "1 x 400 g de tomate picado", "400ml / 14fl oz de caldo de pollo caliente", "150ml / 5fl oz de crema agria", "Harina de auto aumento 230g / 8oz", "75 g / 2½ oz de sebo", "1 cucharada de eneldo fresco finamente picado", "1 cucharada de perejil fresco finamente picado", "500ml / 18fl oz de caldo de pollo", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Caliente el aceite de oliva en una sartén colocada a fuego medio. Sazonar los muslos de pollo con sal y pimienta y agregarlos a la sartén. Cocine hasta que se dore por todas partes. Retira el pollo y ponlo a un lado.", "Agregue las cebollas, el ajo y los pimientos a la sartén y fríe con cuidado durante 10 minutos. Agregue las paprikas y la harina. Cocine, revolviendo todo el tiempo, durante unos minutos. Agregue los tomates y el caldo, luego devuelva los muslos de pollo a la sartén. Cocine a fuego lento durante 30-40 minutos, o hasta que el pollo esté bien cocido.", "Mientras tanto, para hacer las albóndigas, mezcle la harina, el sebo, las hierbas y el condimento en un tazón. Agregue 100ml / 3½fl oz de agua y mezcle para formar una masa pegajosa.", "Enrolle la masa en bolitas y déjela caer en un molde para hornear poco profundo. Verter sobre el caldo de pollo caliente y hornear durante 30 minutos.", "Cuando esté listo para servir, mezcle la crema agria en el pollo y sirva con las albóndigas."], "url": "www_bbc_co_uk_food_recipes_chicken_paprikash_02086", "title": "Pollo a la paprika", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, de mariposa y ligeramente aplastadas", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas, golpeados", "75g / 2½ oz de queso parmesano, rallado", "75g / 2½oz de pan rallado", "1 cucharadita de orégano seco", "algunas hojas de albahaca, finamente picadas", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo, finamente picados", "100 ml / 3½ fl oz de vino tinto", "1 cucharadita de orégano seco", "1 x 400 g / 14 oz de tomates cortados en lata (o equivalente fresco)", "azúcar pizca (opcional)", "sal y pimienta negra recién molida", "1 diente de ajo", "1 cucharadita de aceite de oliva", "2 bolas de mozzarella, en rodajas", "puñado de hojas de albahaca fresca"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Sazonar el pollo con sal y pimienta. Sazone la harina y coloque en un plato, ponga los huevos batidos en otro y mezcle las migajas, el parmesano y las hierbas en un tercer plato.", "Sumerja cada trozo de pollo en la harina, luego quite el exceso de polvo y vierta en el huevo. Finalmente cubra con la mezcla de migas de pan y parmesano, presionándola en el pollo firmemente.", "Coloque el pollo en una bandeja para hornear y rocíe con un poco de aceite de oliva. Hornee por alrededor de 12-15 minutos, o hasta que esté recién cocido.", "Para hacer la salsa, caliente el aceite de oliva en una cacerola y agregue la cebolla. Freír hasta que esté muy suave, si lo quieres translúcido y mantecoso, luego agrega el ajo. Cocine por otros 2 minutos, luego agregue el vino tinto. Permita burbujear ferozmente hasta que el volumen del líquido se haya reducido a la mitad, luego agregue el orégano y los tomates.", "Condimentar con sal y pimienta. Cocine a fuego lento, tapado, durante 10 minutos, luego retire la tapa. Pruebe y agregue una pizca de azúcar si cree que los tomates no son lo suficientemente dulces. Cocine a fuego lento durante otros 10 minutos, sin tapar, hasta que tenga una salsa bien reducida; no desea que quede demasiado mojado para este plato, ya que hará que el pollo quede empapado.", "Para armar, tome un plato de horno grande y poco profundo que tomará todo el pollo en una sola capa. Cortar el diente de ajo por la mitad y frotar sobre el plato.", "Extienda la salsa de tomate sobre la base del plato y luego cubra con el pollo. Coloque la mozzarella encima hasta que el pollo esté casi completamente cubierto. Hornee en el horno por alrededor de 15-20 minutos o hasta que todo esté bien caliente y la mozzarella esté derretida y dorada. Servir con unas hojas de albahaca esparcidas."], "url": "www_bbc_co_uk_food_recipes_chicken_parmo_08987", "title": "Parmo de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3lb 5 oz patatas harinosas, como King Edwards, peladas", "30g / 1oz de mantequilla", "5 cucharadas de crema doble", "2 yemas de huevo de gallinas camperas", "sal y pimienta negra", "30g / 1oz de mantequilla", "6 chalotes grandes u 8 pequeños, pelados y partidos por la mitad", "3 zanahorias picadas", "2 palitos de apio picados", "1 diente de ajo, finamente picado", "4 cucharadas de vino blanco seco", "1 cucharada de puré de tomate", "4 tomates maduros grandes, pelados y picados (o 1 x 400 g de tomates de ciruela picados)", "350ml / 12fl oz de caldo de pollo", "600 g / 1 libra de pollo asado sobrante de 5 oz, rallado", "16 aceitunas negras, piedras removidas, cortadas a la mitad", "2 cucharadas de perejil fresco picado", "50g / 1¾oz de queso Gruyère"], "method": ["Para el aderezo, hierva las papas en agua con sal hasta que estén tiernas. Escurra y empuje a través de un ricero de patata, o machaque bien. Agregue la mantequilla, la crema y las yemas de huevo. Sazonar y apartar.", "Para el relleno, derrita la mantequilla en una sartén grande. Agregue los chalotes, las zanahorias y el apio y fría con cuidado hasta que estén suaves, luego agregue el ajo. Vierta el vino y cocine durante 1 minuto. Agregue el puré de tomate, los tomates picados y el caldo y cocine durante 10-15 minutos, hasta que espese. Agregue el pollo rallado, las aceitunas y el perejil. Sazone al gusto con sal y pimienta.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque el relleno en un plato resistente al horno de 20x30cm / 8x12in y cubra con el puré de papa. Ralla sobre el Gruyère. Hornee durante 30-35 minutos, hasta que esté caliente y la papa esté dorada."], "url": "www_bbc_co_uk_food_recipes_chicken_parmentier_25434", "title": "Pollo Parmentier", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_parmentier_25434_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "Plumas de 250 g / 9 oz", "1 cebolla, más o menos picada", "3 pechugas de pollo deshuesadas y sin piel, cortadas en tiras finas aproximadamente del tamaño de tu dedo meñique", "1 cucharada de pimentón", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "50g / 1¾oz de mantequilla", "50g / 1¾oz de harina natural", "750ml / 1 pinta 6 fl oz de leche caliente (ver consejo)", "1 cucharadita de mostaza Dijon", "100 g / 3½ oz de queso parmesano, rallado grueso", "2 tomates grandes, sin semillas y cortados en cubos pequeños"], "method": ["Precaliente el horno a 220C / 200C Ventilador / Gas 7. Aplique mantequilla a un plato poco profundo de 1,75 litros / 3 pinta para horno.", "Cocine el penne con la cebolla en agua hirviendo con sal, de acuerdo con las instrucciones del paquete. Escurrir, refrescar en agua fría y dejar escurrir nuevamente en el colador.", "Coloque las tiras de pollo en una bolsa de congelador que se puede volver a sellar con el pimentón y un poco de sal y pimienta, selle la bolsa y agite para cubrir.", "Calentar 1 cucharada de aceite en una sartén grande y freír rápidamente el pollo a fuego alto durante unos 2 minutos hasta que esté dorado y recién cocido (puede que tenga que hacerlo por lotes). Con una cuchara ranurada, transfiera el pollo frito a un plato y déjelo a un lado.", "Para hacer la salsa, derrita la mantequilla en una cacerola grande, agregue la harina y mezcle para formar un roux. Cocine por 1 minuto, luego gradualmente agregue la leche caliente, batiendo a fuego alto hasta que la salsa esté suave y espesa, y deje hervir durante 4 minutos. Agregue la mostaza y la mitad del queso y sazone con sal y pimienta.", "Agregue la pasta y la cebolla a la salsa en la sartén y mezcle. Con una cuchara vierta la mitad de esta mezcla en el plato, coloque las tiras de pollo sobre la parte superior y coloque la pasta y la salsa restantes sobre el pollo. Dispersar sobre los tomates y luego cubrir con el queso restante. Hornee en el horno por unos 20 minutos hasta que esté caliente y dorado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_chicken_pasta_bake_25701", "title": "Pasta de pollo al horno (pasta de la noche del sábado)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pasta_bake_25701_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3-4 cucharadas de mayonesa", "1-2 cucharadas de pesto", "3 pechuga de pollo cocida sin piel, rallada", "puñado de cohetes", "6 rollos de pan granero o con semillas, rebanados horizontalmente, ligeramente untados con mantequilla."], "method": ["Mezcle la mayonesa y el pesto en un bol. Revuelva suavemente el pollo desmenuzado.", "Rellene los panecillos con la mezcla de pollo y cubra con un poco de cohete."], "url": "www_bbc_co_uk_food_recipes_chicken_pesto_and_rocket_00432", "title": "Sándwich de pollo, pesto y rúcula", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 6 sándwiches", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pesto_and_rocket_00432_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4.5kg / 10lb 2 oz de harina natural, más extra para espolvorear", "3 cucharadas de sal", "Manteca de cerdo 2.25kg / 5lb, en cubitos", "aproximadamente 1,2 litros / 2 pintas de agua fría", "Muslos de pollo de 3 kg / 6 libras y 8 onzas, deshuesados ​​y sin piel, finamente picados", "Harina normal 150g / 5½ oz", "sal y pimienta negra recién molida", "1,5 kg / 3lb cebolla de 5oz, pelada, picada finamente", "Colina de 1.5kg / 3lb 5oz, pelada, finamente picada", "Patata de 4.5kg / 10lb 2oz, pelada, finamente picada", "10 huevos de gallinas camperas, golpeados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la masa, mezcle la harina, la sal y la manteca de cerdo en un mezclador grande hasta que la mezcla se asemeje a pan rallado.", "Con el motor todavía en funcionamiento, agregue gradualmente el agua en una corriente delgada hasta que la mezcla se una como masa. Si no tiene un mezclador lo suficientemente grande, frote la grasa en la harina en un tazón grande o limpie la cubeta.", "Envuelva la masa en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Para el relleno, coloque el pollo picado y la harina en un tazón grande y mezcle hasta que la carne esté cubierta con la harina. Sazone al gusto con sal y pimienta negra recién molida.", "Sazone las verduras con sal y pimienta negra recién molida.", "Cuando la masa se haya enfriado, divídala en 40 piezas de igual peso. Extienda cada pieza de masa en una superficie de trabajo ligeramente enharinada hasta que sea más grande que el diámetro de un plato. Asegúrate de no rasgar la masa.", "Usando un plato como plantilla, recorte los bordes de cada pieza de masa para formar un disco.", "Coloque una cucharada de la papa picada en la mitad de cada disco de hojaldre, dejando 1,5 cm / ¾ in libre en los bordes.", "Con una cuchara, coloque un poco del colinabo en la parte superior de la capa de papa, y luego espolvoree un poco de cebolla picada sobre la capa de colinabo. Finalmente, cuchara sobre parte del pollo.", "Cepille ligeramente los bordes de los discos de pastelería con un poco del huevo batido.", "Doble la mitad vacía del disco de repostería sobre la mitad llena y presione los bordes con un tenedor o gire los bordes para sellar.", "Cepille la parte superior de cada pasty con más huevo batido. Con un cuchillo afilado, corte una pequeña cruz en la parte superior de las empanadas a través de la cual puede escapar el vapor.", "Coloque las empanadas en las bandejas para hornear engrasadas y transfiéralas al horno. Hornee durante 45-50 minutos, o hasta que la masa esté crujiente y dorada, y el relleno esté bien cocido y caliente.", "Cuando los pasteles estén cocidos, retírelos del horno y déjelos a un lado para que descansen de 5 a 10 minutos antes de servirlos."], "url": "www_bbc_co_uk_food_recipes_chicken_pasties_23673", "title": "Pastel de pollo", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 40 pasties", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cebolla, pelada, finamente picada", "4 dientes de ajo, partidos por la mitad", "20g / ¾oz de raíz de jengibre fresco, pelado, en rodajas finas", "2 chiles rojos frescos largos, en rodajas (o 1 cucharadita de hojuelas de chile secas)", "1 cucharadita de polvo chino de cinco especias", "4 cucharadas de salsa de soja oscura, más extra para servir", "1kg-1.2kg / 2lb 4oz-2lb 10oz de pollo entero", "1 cucharada de salsa de pescado tailandés (nam pla)", "200g / 7oz de fideos de arroz secos", "6 cebollas de primavera, cortadas y en rodajas finas", "100g / 3½oz de soja, enjuagada y escurrida", "Ramitas frescas de cilantro de 25g / 1oz", "1 chile rojo largo, en rodajas finas", "1 lima, cortada en cuñas"], "method": ["Coloque las verduras en la olla de cocción lenta. Agregue el polvo de cinco especias, 1 litro / 1¾ pintas de agua y salsa de soja hasta que estén bien combinados.", "Corta cualquier hilo del pollo, quita la piel empujando los dedos entre la carne de la pechuga y la piel y quitándote la piel. Haz lo mismo con las piernas, cortando cualquier piel alrededor de las alas o las puntas de las piernas con unas tijeras.", "Coloque el pollo, con la pechuga hacia arriba, en la olla de cocción lenta, empujándolo hacia abajo entre las verduras. Sazonar todo con sal y pimienta.", "Cubra y cocine a fuego alto durante 4½ horas, o hasta que el pollo esté completamente cocido y muy tierno.", "Drene el contenido de la olla de cocción lenta en un tazón grande. Coloque el pollo en una tabla de cortar y quite la carne del cuerpo, corte grueso. Cubra con papel de aluminio.", "Elimine la grasa del caldo recolectado en el recipiente con una cuchara grande de metal. Vierta el caldo en una olla limpia, agregue la salsa de pescado y colóquelo a fuego lento.", "Llene a la mitad una cacerola aparte con agua y deje que hierva. Agregue los fideos y cocine hasta que estén tiernos, revolviendo regularmente para separarlos. Escurrir bien.", "Divida los fideos por igual entre 4 cuencos hondos. Cubra cada uno con pollo, cebolleta, brotes de soja y cilantro. Cucharee las existencias calientes y sazone con soja. Adorne con el resto del chile en rodajas y las rodajas de lima."], "url": "www_bbc_co_uk_food_recipes_chicken_pho_97726", "title": "Pho de pollo de cocción lenta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pho_97726_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo mediano", "1 cebolla, pelada", "6 dientes", "1 zanahoria, pelada", "2 hojas de laurel", "1 cubo de caldo de pollo", "6-8 granos de pimienta", "Harina simple de 450g / 1lb", "½ cucharadita de sal o al gusto", "120 g / 4½ oz de mantequilla, fría", "120g / 4½ oz de manteca vegetal, frío", "1 huevo de gallinas camperas, batido, para glasear", "250ml / 9fl oz de leche entera", "55 g / 2 oz de mantequilla", "Harina normal de 55g / 2oz"], "method": ["Enjuague el pollo en agua fría y colóquelo en una sartén grande.", "Stud la cebolla con clavos de olor y agregarlo a la sartén con la zanahoria, hojas de laurel, cubo de valores y granos de pimienta.", "Cubra con agua fría y lleve a ebullición, luego reduzca el fuego y cocine a fuego lento hasta que el pollo esté cocido. Esto tomará aproximadamente 45 minutos-1¼ horas, dependiendo del tamaño del pollo.", "Mientras tanto, haz los pasteles. Tamiza la harina y la sal en un tazón grande. Corta la manteca fría y la manteca vegetal y frótalas en la harina hasta que la mezcla se asemeje a finas migas de pan.", "Mezcle con suficiente agua fría para formar una masa dura. Déle vuelta a una superficie ligeramente enharinada y amase suavemente para formar una bola lisa de masa. Envuelva en film transparente o coloque en una bolsa de plástico y relájese durante al menos 30 minutos.", "Cuando el pollo esté cocido, retire la sartén del fuego. Retire el pollo y colóquelo en un plato. Vuelva a poner la sartén sobre el fuego y reduzca el líquido de cocción a aproximadamente 250 ml / 9 fl oz. Cuele el líquido reducido en una jarra y déjelo enfriar, luego quite la grasa y deséchela.", "Cuando el pollo esté lo suficientemente frío como para manipularlo, corte la carne en trozos y deseche la piel y los huesos.", "Para la salsa, quite los dientes de la cebolla y coloque en un procesador de alimentos con el caldo reservado. Licúe hasta que quede suave, luego agregue la leche y reserve.", "Derrita la mantequilla en una sartén y agregue la harina. Poco a poco agregue el caldo y la leche, luego hierva, revolviendo continuamente. Reduzca el fuego y cocine a fuego lento durante 4-5 minutos para cocinar el sabor de la harina.", "Sazonar, al gusto, con sal y pimienta negra recién molida, luego doblar la carne suavemente en la salsa. Deja la mezcla a un lado para enfriar.", "Precaliente el horno a 220 ° C / 425 ° F / Gas 7. Extienda dos tercios de la masa y úsela para alinear un plato para pastel de 20-25 cm / 8-10 pulgadas y agregue la mezcla de pollo enfriada.", "Extienda la masa restante para hacer una tapa para el pastel, cepille el borde con huevo batido y pellizque los bordes para sellar.", "Decora la parte superior de la tarta con hojas hechas de guarniciones de pastelería y cepíllalas con huevo batido. Haz un agujero en la parte superior del pastel para permitir que salga el vapor, luego hornea en el horno precalentado durante unos 45 minutos, o hasta que el pastel esté dorado."], "url": "www_bbc_co_uk_food_recipes_chicken_pie_24044", "title": "Pastel de pollo tradicional", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pie_24044_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de harina normal", "1 x 1,5 kg / 3 lb 5 oz pollo, menudencias quitadas, unidas en 8 piezas", "25ml / 1fl oz de aceite de oliva", "2 cebollas, rebanadas gruesas", "2 dientes de ajo, ligeramente triturados", "4 pimientos rojos, semillas eliminadas, rebanadas gruesas", "1 cucharada de puré de tomate", "5 cucharadas de jerez seco", "5 cucharadas de vino blanco", "400g de tomates de hojalata", "2 cucharaditas de pimienta espelette molida", "1-2 cucharaditas de azúcar en polvo, al gusto", "2 cucharadas de perejil de flatillo finamente picado", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "1 cebolla, finamente picada", "6 clavos enteros", "1 ramita de canela", "200g / 7oz de arroz basmati", "2 hojas de laurel", "1 limón, en rodajas"], "method": ["Para el pollo, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Espolvoree la harina en un plato y sazone con sal y pimienta, luego drague las piezas de pollo en la harina.", "Caliente la mitad del aceite en una sartén grande a fuego medio. Freír el pollo en lotes durante 2-3 minutos en cada lado, o hasta que se dore por ambos lados. Retire de la sartén con una cuchara ranurada y transfiera a una cazuela para horno.", "Caliente el aceite restante en la misma sartén, luego fría las cebollas, el ajo y los pimientos durante 4-5 minutos, o hasta que se ablanden. Agregue el puré de tomate y continúe freír durante 1-2 minutos, luego vierta el jerez y el vino blanco y lleve la mezcla a ebullición. Agregue los tomates enlatados, la pimienta espelette y el azúcar y vuelva a hervir. Condimentar con sal y pimienta.", "Vierta la salsa sobre las piezas de pollo. Cubra y hornee durante 1-1½ horas, o hasta que el pollo esté cocido y no queden rastros de restos de color rosa, los pimientos están tiernos y la salsa se ha espesado ligeramente.", "Mientras tanto, para el arroz pilaf, caliente el aceite en una sartén grande con tapa a fuego medio. Agregue la cebolla y fría por 2-3 minutos, o hasta que se suavice pero no se dore. Agregue los dientes de ajo y la canela y cocine por otros 1-2 minutos, hasta que estén fragantes. Agregue el arroz y mezcle bien para cubrirlo con aceite, luego vierta más de 600 ml / 20 fl oz de agua y mezcle nuevamente.", "Agregue las hojas de laurel y 2 rodajas de limón, luego cubra la olla con una tapa y reduzca el fuego hasta que esté hirviendo a fuego lento. Cocine el arroz por 15-20 minutos, o hasta que esté solo tierno y todo el líquido haya sido absorbido. Retire las rodajas de limón y las hojas de laurel antes de servir.", "Para servir, revuelva el perejil en el pollo y sazone de nuevo. Sirve con arroz pilaf. Adorne los platos con las rodajas de limón restantes."], "url": "www_bbc_co_uk_food_recipes_chicken_piperade_with_23608", "title": "Piperade de pollo con arroz pilaf", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Muslos y pechugas de pollo sin hueso, 375 g / 13oz, sin piel, partidos por la mitad", "125ml / 4fl oz de caldo de pollo", "4 cucharadas de crema individual o leche entera", "3 tallos de apio, picados", "1 puerro, cortado en pedazos de 1cm / 1in", "125g / 4½oz de papas nuevas, cortadas a la mitad", "2 dientes de ajo picados", "250 g / 9 oz de jamón cocido, cortado en cubos de 2 cm / 1 in", "25g / 1oz de mantequilla salada", "3 cucharadas de harina común", "¼ cucharadita de nuez moscada recién rallada", "2 cucharadas de perejil fresco de hojas planas", "sal y pimienta negra recién molida", "1 hoja de hojaldre laminado", "1 yema de huevo batida con 1 cucharada de leche, para glaseado", "¼ repollo blanco", "¼ col roja", "1 zanahoria mediana", "1 remolacha mediana", "½ cebolla roja", "3 rábanos", "2-3 cucharadas de mayonesa", "½ limón, solo jugo", "1 chile rojo, sin semillas y finamente picado"], "method": ["Coloque el pollo, el caldo, la crema o la leche, el apio, los puerros, las papas, el ajo y el jamón en una cacerola grande. Llevar a ebullición, reducir el fuego, tapar y cocinar a fuego lento durante unos 20-25 minutos o hasta que el pollo esté tierno.", "Vierta el contenido de la sartén en un colador colocado sobre una jarra medidora resistente al calor. Necesitará 250ml / 9fl oz de líquido. Compense la cantidad usando crema extra o leche, si es necesario. Deje que se enfríe un poco mientras hace el roux.", "Limpie y seque la sartén, agregue la mantequilla y derrita suavemente a fuego moderado. Agregue la harina hasta que esté bien combinada, y cocine durante unos minutos, pero no deje que la mezcla se coloree.", "Agregue el líquido de escalfar, aproximadamente un tercio cada vez, calentando y revolviendo bien entre las adiciones, hasta que la mezcla sea espesa, suave y aterciopelada. Agregue la nuez moscada y el perejil, luego agregue sal y pimienta, al gusto.", "Agregue el pollo cocido y las verduras y mezcle suavemente en la salsa hasta que esté bien cubierto. Dejar enfriar durante al menos 10 minutos, idealmente fría completamente y enfriar en la nevera.", "Precalentar el horno a 220C / 425F / Gas 7.", "Desenrolle la masa sobre una superficie de trabajo enharinada. Convierte un molde para pastel rectangular de 14x18cm / 5½x7 pulgadas con el borde del borde plano boca abajo en la hoja de hojaldre y córtalo alrededor, dejando un borde de 3cm / 1¼ pulgadas.", "Corta una tira de hojaldre de 2 cm por 1 pulgada para que quepa alrededor del borde del plato. Cepille el borde del borde plano del plato para pastel con agua y pegue la tira en la parte superior. Vierte el relleno en el plato, apilándolo en el centro.", "Coloque la tapa de pastelería en la parte superior y presione sobre la tira de pastelería para sellar. Si hay algún exceso, recórtalo de manera uniforme. Corte una ventilación de 1 cm / ½ en el centro, luego cepille el huevo y el glaseado de leche sobre la masa. Marque los patrones decorativos en la masa, si lo prefiere, o deje en blanco.", "Hornee por 25-30 minutos, o hasta que la masa se hinche y esté dorada.", "Para la ensalada de col, rallar la col, la zanahoria, la remolacha, la cebolla y los rábanos en un tazón grande. Agregue la mayonesa, el jugo de limón, la sal y la pimienta y los chiles y revuelva bien. Guarde en el refrigerador hasta que esté listo para servir.", "Sirva el pastel de pollo caliente, directamente del plato, con ensalada de col crujiente fría al lado."], "url": "www_bbc_co_uk_food_recipes_chicken_pot_pie_with_52117", "title": "Pastel de pollo con ensalada de col picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 2-3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_pot_pie_with_52117_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["8 muslos de pollo sin hueso, piel sobre", "1 cucharada de condimento italiano (una mezcla de albahaca, orégano y perejil)", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "1 cebolla pequeña, pelada, finamente picada", "1 x 400 g / 14 oz pueden tomates cherry italianos", "6 filetes de anchoa, en aceite", "2 dientes de ajo, pelados, aplastados", "½ cucharadita de hojuelas de chile seco", "300 g / 10½ oz linguine", "1 cucharada de alcaparras para bebés", "puñado de hojas de albahaca fresca, más extra para decorar"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque cada muslo de pollo con la piel hacia abajo sobre una tabla de cortar y espolvoree cada uno con un poco de aderezo italiano y sal y pimienta negra recién molida, al gusto.", "Con la cuerda para cocinar, dobla con cuidado los bordes de cada muslo en el centro, luego átala firmemente para crear paquetes redondos limpios (la piel debe estar en el exterior).", "Caliente dos cucharadas de aceite de oliva en una sartén grande a fuego medio a alto. Agregue los paquetes de pollo, en lotes si es necesario, y cocine por 3-4 minutos en cada lado, o hasta que se doren por todos lados. Transfiera los paquetes de pollo a un plato refractario y déjelos a un lado.", "Agregue otras dos cucharadas de aceite de oliva a la misma sartén. Agregue la cebolla y fría por 3-4 minutos, o hasta que se ablanden.", "Agregue los tomates cherry, los filetes de anchoa, el ajo y las hojuelas de chile y continúe cocinando durante 4-5 minutos, revolviendo bien. Vierta la mezcla sobre los paquetes de pollo, rocíe un poco más de aceite de oliva, luego cocine en el horno durante 18-20 minutos, o hasta que el pollo se haya cocinado y la salsa se haya espesado.", "Mientras tanto, lleve una olla grande de agua con sal a ebullición y cocine el linguini de acuerdo con las instrucciones del paquete. Escurra bien, regrese a la sartén y mezcle con una pizca de aceite de oliva.", "Cuando la puttanesca de pollo se haya cocinado, retire con cuidado los paquetes de pollo de la salsa y deséchela. Revuelva las alcaparras y las hojas de albahaca en la salsa y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque un giro de linguini en el centro de cada plato. Coloque dos muslos de pollo en la parte superior de cada montículo de pasta y una cuchara sobre la salsa puttanesca. Adorne con unas ramitas de albahaca fresca."], "url": "www_bbc_co_uk_food_recipes_chicken_puttanesca_with_80065", "title": "Puttanesca de pollo con linguini", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_puttanesca_with_80065_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Chalotes de bebé 400g / 14oz, pelados", "3 dientes de ajo, aplastados", "1 pequeño racimo de tomillo fresco", "4 hojas de laurel", "600ml / 20fl oz de vino tinto", "6 pechugas de pollo pequeñas sin piel y sin huesos", "2 cucharadas de aceite de oliva", "75g / 2¾oz de mantequilla", "3 cucharadas de harina común", "Tocino rayado ahumado de 350g / 12oz, cortado en trozos", "1 cucharada de puré de tomate", "1 cucharada de azúcar mascabado ligero", "400 g / 14 oz champiñones, reducido a la mitad", "sal y pimienta negra recién molida"], "method": ["Pon los chalotes en un tazón grande con ajo, hierbas y vino. Mezcle, agregue las pechugas de pollo, sazone con sal y pimienta negra y deje marinar durante al menos 1 hora. Cuando esté listo para cocinar, precaliente el horno a 160C / 140C Fan / Gas 3.", "Coloque un colador sobre una cacerola grande y cuele el pollo marinado, reservando los chalotes, las hojas de laurel y el tomillo. Mojar el pollo con papel de cocina para secarlo.", "Caliente el aceite y 50 g / 1¾ oz de la mantequilla en una sartén honda a prueba de horno o en una cacerola. Agregue las pechugas de pollo y fría a fuego medio-alto, durante 5-10 minutos por cada lado, o hasta que se doren por todos lados, puede necesitar hacer esto en tandas. Retire con una espumadera y déjelo a un lado.", "Mientras tanto, coloque la sartén con el adobo de vino a fuego alto y hiérvala, durante 5-10 minutos, hasta que el volumen de líquido se haya reducido en un tercio. Agregue la harina a un recipiente con 150 ml / 5 fl oz de agua y bata hasta que quede suave. Agregue un poco del vino caliente y agregue esta mezcla al resto del vino en la sartén. Mantener caliente.", "Agregue el tocino a la sartén o cazuela y fría a fuego fuerte durante unos 10 minutos o hasta que se dore. Agregue las chalotas reservadas y continúe cocinando por otros 10 minutos o hasta que empiecen a ablandarse.", "Agregue la salsa de vino caliente y el puré de tomate a la sartén o cazuela con el azúcar, las hojas de laurel reservadas, el tomillo, la sal y la pimienta negra y deje que hierva. Revuelva hasta que espese y agregue el pollo dorado. Regrese a ebullición, cubra con una tapa y hornee durante 20-25 minutos, o hasta que esté cocido.", "Mientras tanto, derrita la mantequilla restante en una sartén mediana y fría los champiñones a fuego medio durante 5-10 minutos, o hasta que estén recién cocinados. Agregue a la cazuela de pollo justo antes de servir. Retire las hojas de laurel y el tomillo de la cazuela y sirva la cazuela caliente con puré de patatas y repollo rallado."], "url": "www_bbc_co_uk_food_recipes_chicken_red_wine_and_88480", "title": "Cazuela de pollo, vino tinto y ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_red_wine_and_88480_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ bulbo de ajo, sin pelar, de un bulbo entero cortado horizontalmente", "½ limón", "1 pollo de corral (aproximadamente 1.25kg / 2lb 12oz)", "½ pan de masa fermentada grande, redondo, ligeramente rancio, de un pan entero cortado horizontalmente", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "puñado de hojas de ajo silvestre", "1 yema de huevo grande de gallinas camperas", "1 cucharadita de mostaza Dijon", "100ml / 3½fl oz de aceite de oliva virgen extra", "vinagre de vino blanco, al gusto", "75g / 2½oz de mantequilla sin sal", "100 g / 3½ oz setas de morel, limpiadas y partidas por la mitad", "Guisantes congelados de 100g / 3½oz, descongelados", "puñado de hojas de ajo silvestre, rallado", "2 cucharadas de mantequilla sin sal", "2 cucharadas de aceite de oliva", "2 papas, cortadas en pedazos de 1cm / ½ en", "puñado de ajo silvestre fresco, rallado"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 8. Para el pollo, coloque el ajo y el limón dentro de la cavidad del pollo y sazone con sal y pimienta.", "Coloque la masa madre en una bandeja grande para hornear y rocíe con 1 cucharada de aceite de oliva. Sazone con sal y pimienta y coloque el pollo encima. Sazone el pollo y rocíe sobre la otra cucharada de aceite de oliva.", "Ase el pollo durante una hora y media, o hasta que la piel esté dorada y crujiente y el pollo esté cocido. Para probar que el pollo esté cocido, inserte un pequeño cuchillo afilado en la parte más gruesa de la carne, entre la pierna y mama; los jugos que corren deben ser claros, sin signos de rosa. Si hay algo de rosa, tuesta el pollo durante otros 10-20 minutos o hasta que esté cocido. Cuando el pollo esté cocido, déjalo reposar durante 20 minutos.", "Mientras tanto, para la mayonesa de ajo silvestre, pula el ajo silvestre en agua hirviendo durante 1 minuto, luego escurra y mezcle con 100 ml / 3½ fl oz de agua. Batir la yema de huevo y la mostaza en un bol, luego batir lentamente en el aceite hasta que tenga una mayonesa espesa. Revuelva a través del puré de ajo silvestre, sazone con el vinagre, sal y pimienta y reserve a temperatura ambiente.", "Para las colmenillas y los guisantes, caliente la mantequilla en una sartén mediana. Cuando haga espuma, agregue las colmenillas, sazone con sal y pimienta y fría hasta que estén doradas. Agregue los guisantes y el ajo silvestre con un chorro de agua, luego apague el fuego y déjelo a un lado.", "Para las patatas fritas, caliente la mantequilla y el aceite en una sartén a fuego medio-alto. Freír las papas durante 8-10 minutos, hasta que estén cocidas. Coloque el ajo silvestre encima y cocine hasta que se marchite.", "Para servir, esculpir el pollo en las piernas y los senos, quitar la carne de la pierna del hueso y cortar los senos en pedazos. Exprime el limón cocido desde el interior de la cavidad del pollo sobre la carne.", "Corta la masa madre en cuatro trozos y divídelos entre platos, coloca un poco de pollo encima, coloca una cuchara sobre las colmenillas y los guisantes y rocía la mayonesa con ajo encima, sirve con las papas fritas a los lados."], "url": "www_bbc_co_uk_food_recipes_chicken_roasted_over_34391", "title": "Pollo asado sobre masa madre con colmenillas, guisantes y mayonesa de ajo silvestre", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["400 g / 14 oz de pollo o pechuga de pavo, cortado en tiras", "2 cucharadas de salsa de soja", "1 cucharada de harina de maíz", "375g / 13oz de fideos de huevo secos", "2 cucharaditas de aceite de colza", "6 cebollas de primavera, en rodajas finas", "3 cucharadas de mantequilla de maní", "2 cucharadas de salsa de chile dulce", "1 x 400 ml de leche de coco con contenido reducido de grasa", "100g / 3½ oz azucarados arvejas", "150 g / 5½ oz de frijoles y guisantes congelados", "100g / 3½oz de maíz dulce congelado", "1 lima, solo jugo", "1 zanahoria, afeitada en rodajas finas con un pelador de verduras", "75g / 2¾oz de hojas de espinaca baby", "2 cucharadas de anacardos picados", "2 cucharadas de cilantro recién picado"], "method": ["Coloque el pollo en un bol, agregue la salsa de soya y la harina de maíz y mezcle bien. Cubra y reserve por unos momentos.", "Mientras tanto, ponga a hervir una olla grande de agua, agregue los fideos y cocine según las instrucciones del paquete. Escurrir en un colador, enjuagar con agua fría hasta que estén fríos, luego drenar una vez más e inclinarlos de nuevo en la sartén fría. Agregue la mitad del aceite de colza y mezcle.", "Caliente un wok hasta que esté caliente, agregue el aceite de colza restante y las cebolletas y sofría por 1 minuto, o hasta que se ablanden. Agregue la mantequilla de maní, la salsa de chile y la leche de coco y revuelva hasta que se combinen. Deje que hierva a fuego lento, luego agregue el pollo marinado y la carne picada durante 4 minutos, o hasta que esté bien cocida. Agregue los guisantes de azúcar y cocine a fuego lento durante otros 2 minutos, o hasta que estén casi tiernos, luego agregue los guisantes congelados, los frijoles y el maíz dulce. Regrese a ebullición, agregue el jugo de lima y revise el condimento; es posible que desee agregar más jugo de lima o chile, dependiendo de qué tan caliente le guste.", "Agregue los fideos cocidos y caliente durante 1-2 minutos, o hasta que estén calientes. Agregue las virutas de zanahoria y las espinacas y retire del fuego. El calor del plato marchitará la espinaca. Revuelva un par de veces.", "Servir en tazones, adornado con anacardos y cilantro."], "url": "www_bbc_co_uk_food_recipes_chicken_satay_noodles_95490", "title": "Fideos de pollo satay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_satay_noodles_95490_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 lechuga iceberg", "1 pechuga de pollo cocida sin piel y sin piel (aproximadamente 100 g / 3½ oz)", "⅓ pepino", "1 zanahoria, pelada y cortada en fósforos finos", "½ pimiento rojo, sin semillas y cortado en fósforos finos", "5 rábanos, cortados y en rodajas finas", "15g / ½ oz de hojas frescas de cilantro", "1 chile rojo largo, finamente picado", "3 cebollas de primavera, cortadas y finamente rebanadas", "cuñas de lima, para exprimir", "3 cucharadas de mantequilla de maní crujiente", "1 cucharada de salsa de chile dulce", "2 cucharaditas de salsa de soja oscura", "2 cucharaditas de jugo de lima fresco"], "method": ["Para hacer la salsa satay, ponga la mantequilla de maní en un tazón pequeño y agregue 2 cucharadas de agua recién hervida. Mezcle la salsa de chile, la salsa de soja y el jugo de limón. Transfiera a un plato para servir poco profundo y colóquelo en el centro de un tablero grande o fuente.", "Recorte la parte inferior de la lechuga y separe cuidadosamente 8 hojas grandes. No se preocupe si se rasgan un poco mientras trabaja hacia la mitad de la lechuga. Enjuague las hojas y seque.", "Cortar las pechugas de pollo en rodajas finas y colocar en el tablero o plato con la salsa satay. Coloque las hojas de lechuga, el pepino, la zanahoria, la pimienta, los rábanos y el cilantro en pilas separadas al lado del pollo. Coloque el chile y las cebolletas en pequeños platos separados en el tablero.", "Para armar las envolturas, coloque una selección de las verduras en las hojas de lechuga. Agregue un par de rebanadas de pollo y luego cubra con la salsa satay, cebollas tiernas y chiles al gusto. Adorne con el cilantro fresco y agregue un chorrito de lima antes de envolver el resto de la hoja alrededor del relleno. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_satay_wraps_38509", "title": "Envolturas de pollo satay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_satay_wraps_38509_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de yogur griego grueso", "½ cucharadita de sal", "8-12 filetes de muslo de pollo, desollados", "2 limones, solo jugo", "50ml / 2fl oz de aceite de oliva", "4 dientes de ajo, aplastados", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "1 cucharadita de pimentón dulce ahumado", "½ cucharadita de canela molida", "½ cucharadita de Cayena o chile en polvo", "2 hojas de laurel aplastadas", "sal y pimienta negra recién molida"], "method": ["Para hacer el labneh, alinee un colador o colador con una doble capa de gasa o muselina y colóquelo sobre un recipiente lo suficientemente pequeño como para caber en su refrigerador. Vierta el yogur y agregue ½ cucharadita de sal. Envuelva la tela alrededor de ella y ate en un manojo, luego déjela colar, preferiblemente de la noche a la mañana, hasta que sea mucho más espesa, pero aún cremosa.", "Coloque los muslos de pollo en una bolsa de comida grande o en un tazón y sazone bien. Batir el jugo de limón y el aceite y agregar el ajo, las especias y las hojas de laurel. Mezcle bien y vierta sobre el pollo, frotándolo con las manos. Si prefiere mantener sus manos limpias y está usando una bolsa, sállela primero, luego masajee desde el exterior.", "Deje marinar en el refrigerador, cubriéndolo durante al menos 2 horas, pero preferiblemente durante la noche. Deje que el pollo alcance la temperatura ambiente antes de cocinarlo.", "Para cocinar el pollo, caliente una parrilla o una sartén y quite el exceso de adobo del pollo. A fuego medio, asa o plancha el pollo, volteándolo con frecuencia, durante unos 20-25 minutos, o hasta que esté cocido. Retire de la barbacoa y deje reposar por unos minutos, antes de cortar y servir con el labneh."], "url": "www_bbc_co_uk_food_recipes_chicken_shawarma_34413", "title": "Shawarma de pollo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de arroz silvestre", "1 pequeño puñado de hojas de cohetes", "50 g / 1¾oz de pollo asado cocido, rallado", "2 cebollas de primavera, en rodajas finas", "½ pimiento rojo, en rodajas", "½ chile verde, finamente picado (o al gusto)", "2 ramitas de menta, hojas recogidas", "1 cucharada de aceite de oliva extra virgen", "sal y pimienta negra recién molida"], "method": ["Cocine el arroz salvaje según las instrucciones del paquete, luego escurra.", "Coloque el arroz en el recipiente que planea comer y agregue el cohete, el pollo, la cebolleta, el pimiento rojo, el chile y la menta.", "Rocíe abundantemente con el aceite y sazone con sal y pimienta. Coma enseguida o prepare su fiambrera lista para llevar al trabajo."], "url": "www_bbc_co_uk_food_recipes_chicken_spring_onion_89118", "title": "Bol de grano de pollo, cebolla de primavera, chile y arroz salvaje", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_spring_onion_89118_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 supremas de pollo sin piel", "500ml / 18fl oz de vino tinto fuerte", "300ml / 10fl oz de caldo de pollo o ternera", "1 cucharada de miel", "1 diente de ajo, aplastado", "2 cucharadas de mantequilla", "1 cucharada de aceite vegetal", "10 cebollas perla, peladas y blanqueadas", "10 setas de botón", "125g / 4½oz de tocino ahumado, cortado en cubitos", "sal y pimienta negra recién molida", "2 patatas harineros, peladas y ralladas", "1 chalote, pelado y rallado", "½ zanahoria, pelada y rallada", "½ chirivía, pelada y rallada", "1 nabo pequeño, pelado y rallado", "1 cucharada de perejil de flatillo finamente picado", "sal y pimienta negra recién molida", "2 cucharadas de aceite vegetal", "2 perillas de mantequilla"], "method": ["Coloque los supremas de pollo en un plato poco profundo y cubra con el vino, el caldo, la miel y el ajo. Cubra y marine en el refrigerador por 2 horas. Retire el pollo del adobo, escurra y deje secar sobre un paño o papel de cocina, reservando el adobo.", "Coloque el adobo en una olla pequeña y deje que hierva. Cocine por 15 minutos, o hasta que se reduzca en dos tercios.", "Mientras tanto, fríe el pollo en una sartén con 1 cucharada de mantequilla y aceite durante 15 minutos, o hasta que esté cocido y la parte más gruesa de la carne no muestre rastro de rosa. Sacar de la sartén y dejar reposar.", "Agregue las cebollas y los champiñones a la sartén y cocine por unos minutos. Escurra el exceso de grasa y luego agregue el tocino y cocine por 5-8 minutos, o hasta que se dore.", "Vierta el adobo reducido en la sartén y hierva rápidamente hasta que esté almibarado. Agregue la mantequilla restante para hacer la salsa brillante. Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para los röstis vegetales de raíz, coloque todas las verduras en un tazón grande. Sazonar con sal y pimienta y agregar el perejil. Coloque la mezcla en un paño de muselina o limpie la toalla de té y exprima la mayor cantidad de agua posible.", "Coloque dos anillos de metal de 10cm / 4in en una lata de asar y engrase con el aceite. Presione la mezcla de verduras con fuerza en los anillos, agregue un pomo de mantequilla en la parte superior de cada uno y cocine durante 10 minutos. Dé vuelta y cocine por otros 10 minutos. Deje enfriar un poco antes de quitar el anillo.", "Coloque los röstis vegetales en platos calientes y cubra cada uno con un pollo supremo. Vierta la salsa de vino tinto alrededor de los röstis y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chicken_supreme_au_vin_16466", "title": "Pollo supremo con vino de Borgoña", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]