[{"isVegetarian": true, "title": "German-style potato salad", "url": "www_bbc_co_uk_food_recipes_germanstylepotatosal_74850", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 shallots, finely chopped", "4 tbsp corn oil", "1 tbsp white wine vinegar", "1 tsp Dijon mustard", "salt ", "freshly ground black pepper", "4 large potatoes, cooked and cooled", "1 tsp mustard seeds", "50g/1¾ oz gherkins, chopped", "½ bunch fresh dill, chopped"], "serves": "Serves 3-4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Prepare a dressing for the potatoes. Combine the shallots, oil, vinegar and mustard. Season well, then taste, adjusting the quantity of oil and vinegar, if necessary.   ", "Lightly crush the potatoes and fold through the dressing, mustard seeds, gherkin and fresh dill.", "Serve."]}, {"isVegetarian": false, "title": "Gemelli with anchovies, tomatoes and mascarpone", "url": "www_bbc_co_uk_food_recipes_gemelli_with_anchovies_80715", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gemelli_with_anchovies_80715_16x9.jpg", "ingredients": ["175g/6oz gemelli pasta", "1 tbsp olive oil ", "6 anchovy fillets, finely chopped ", "1 garlic clove, crushed ", "¼ tsp dried chilli flakes ", "150g/5½oz cherry tomatoes, halved across the equator", "4 tbsp dry white vermouth ", "2 tbsp mascarpone ", "1 tbsp finely grated Parmesan plus extra to serve", "2 tbsp finely chopped flatleaf parsley, plus extra to serve ", "salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a large saucepan of salted water to the boil. Cook the pasta according to packet instructions, but start checking a good 2 minutes before you’re told it should be ready. ", "Meanwhile, put the oil and anchovies into a heavy-based wok, and cook, stirring over a medium heat for about 1 minute, or until the anchovies have almost dissolved into the oil. Stir in the garlic and chilli flakes, then turn the heat up a little and add the tomatoes, stirring gently for 2 minutes, or until they begin to soften. ", "Pour in the vermouth, let it bubble up, then stir and push the tomatoes about in the pan for 2 minutes until they have broken down a little in the thickened, reduced sauce. Take the pan off the heat, stir in the mascarpone and, when it’s all melted, stir in the Parmesan and parsley. ", "Before you drain the pasta, lower in a cup to remove some of the cooking water. Add a tablespoon or so of the cooking water to the pasta sauce; this will help the sauce coat the pasta. Drain the pasta, add it to the sauce and toss well to mix, adding more of the pasta cooking water if needed. Sprinkle with a little parsley and take the Parmesan to the table to serve. "]}, {"isVegetarian": false, "title": "Gherkin salad with pan fried brill", "url": "www_bbc_co_uk_food_recipes_gherkin_salad_with_pan_71661", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 butterhead lettuce, roughly chopped", "50g/2oz gherkin, roughly chopped", "80g/2¾oz glucose", "1 cucumber, cut in half then sliced lengthways", "50g/2oz caster sugar", "150ml/5fl oz rice wine vinegar", "1 red chilli, finely diced", "16 pea pods", "3 medium gherkins, finely sliced lengthways", "12 breakfast radishes, sliced lengthways", "2 tbsp capers", "4 brill fillets, skinned and fully trimmed", "salt and freshly ground black pepper", "50g/2oz butter", "1 tbsp olive oil", "2 tbsp coriander cress", "2 tbsp pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place the butterhead lettuce, gherkins and glucose into a food processor and blend to a very fine purée. ", "Pour into a cloth or paper lined sieve over a bowl then set aside to drain through, leaving the dressing in the sieve. ", "For the salad, place the cucumber into a bowl.", "Heat the caster sugar and rice wine vinegar in a small saucepan until just simmering then add the chilli and stir.", "Pour immediately onto the cucumber and stir to make sure all the cucumber is covered. Set aside to cool to room temperature.", "Pop the peas from their pods and cook for a minute in a pan of boiling water. Immediately drain the peas and put them into a bowl of cold water, to stop the cooking process. ", "Place the gherkins, radishes, capers, peas together in a bowl and mix together.", "Drain the cucumber, reserving the pickling liquor. Add the cucumber to the gherkin mixture and mix together.", "Add a little of the pickling liquour to the salad, just enough to coat the vegetables.", "Season the brill with salt and black pepper.", "Heat a frying pan until hot, add the butter and oil then add the brill and fry on each side for two minutes.", "To serve, using a pastry brush, brush a spoonful of the dressing onto each serving plate, then top with a handful of the salad, finishing with a scattering of coriander cress and pea shoots. Set the brill fillet alongside."]}, {"isVegetarian": true, "title": "Ghoogra", "url": "www_bbc_co_uk_food_recipes_ghoogra_70656", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ghoogra_70656_16x9.jpg", "ingredients": ["225g/8oz fine semolina", "7 tbsp melted unsalted butter", "200ml/7¼fl oz water", "120g/4¼oz  caster sugar", "30g/1¼oz ground almonds", "30g/1¼oz white poppy seeds", "30g/1¼oz desiccated coconut", "¼ tsp ground cardamom", "¼ tsp nutmeg", "600g/1lb and 5¼oz plain flour", "vegetable oil, for frying"], "serves": "Serves 25", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sift flour into a bowl and rub in four tablespoons of the melted butter, add a little water at a time to the mixture to form a soft dough, you may not need to use all the water. Knead the dough for about a minute until it is smooth, cover with a damp cloth and set aside.", "Gently heat the remaining butter, then add the semolina and increase the heat to medium. Cook, stirring continuously for about 5-10 minutes or until the semolina is a light brown colour. Add the remaining ingredients, except for the sugar, mix well and cook for a minute. Remove the pan from the heat, add the sugar and set aside to cool.", "Divide the dough into 25 small balls.", "Roll one ball into an 8cm/3in circle and place two teaspoons of the semolina mixture at one end. Fold the pastry in half, press the ends firmly together and crimp to form a secure seal. Repeat this with remaining dough and filling.", "Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C/350F, or until a breadcrumb sizzles. (CAUTION: Hot oil can be dangerous. Don't leave unattended). Fry the ghoogras for 2-3 minutes, or until golden-brown. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper."]}, {"isVegetarian": true, "title": "Ghost cake", "url": "www_bbc_co_uk_food_recipes_ghost_cake_56500", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ghost_cake_56500_16x9.jpg", "ingredients": ["450g/1lb butter or margarine, softened at room temperature", "450g /1lb caster sugar", "8 medium free-range eggs", "4 tsp vanilla extract", "450g/1lb self-raising flour", "milk, to loosen", "280g/10oz butter, softened", "560g/1lb 4oz icing sugar", "2-4 tbsp milk", "1.2kg/2lb 12oz white fondant icing", "apricot jam, sieved", "black fondant icing"], "serves": "Serves 20-24", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Grease and flour the hemisphere cake tin or bowl. Grease 3 x 18cm/7in cake tins and line with baking paper. ", "Cream the butter and the sugar together in a large bowl until pale and fluffy. Gradually beat in the eggs and stir in the vanilla extract. ", "Fold in the flour, adding a little extra milk if necessary, to create a batter with a soft dropping consistency. Divide the mixture between the cake tins and gently spread with a spatula. ", "Bake for 20-25 minutes, or until golden-brown on top and a skewer inserted into the middle comes out clean. Remove from the oven and set aside for 5 minutes, then remove from the tins and peel off the paper. Place onto a wire rack and leave to cool.", "Meanwhile for the buttercream, beat the butter in a large bowl until soft. Add half of the icing sugar and beat until smooth. Add the remaining icing sugar and 2 tablespoons of the milk and beat the mixture until creamy and smooth. Beat in more milk, if necessary, to loosen the mixture.", "When the sponges have cooled assemble the cake. Place one of the regular sponges on a round cake board and spoon buttercream on top, top with another sponge and continue with layers of buttercream and the remaining sponges, finishing with the hemisphere sponge. Then carefully smooth the remaining buttercream over the whole cake (the white fondant will be draped over the cake so the buttercream does not have to look perfect!). ", "Roll the white fondant into a large circle that is wide enough to drape over the whole cake. Place the white fondant over the cake, making sure it covers the cake evenly. Then press down on the fondant to hold it in place. ", "Use the black fondant to make eyes and a mouth and stick them on the cake with a little apricot jam. "]}, {"isVegetarian": true, "title": "Slow-cooked tomato sauce", "url": "www_bbc_co_uk_food_recipes_giancarlostomatosauc_82370", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6-8 tbsp olive oil", "½ large red onion, finely chopped", "2 cloves garlic", "salt and freshly ground black pepper", "2 x 400g tins chopped tomatoes", "200ml/7fl oz vegetable stock"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan and fry the onion for 5-7 minutes. ", "Add the whole garlic cloves and cook for about one minute. Season with salt and freshly ground black pepper.", "Add the chopped tomatoes and the stock. Let the mixture simmer and reduce for about 40 minutes. You may wish to add more stock and let it boil for longer, or add further seasoning, according to taste. Serve."]}, {"isVegetarian": true, "title": "Giant pavlova", "url": "www_bbc_co_uk_food_recipes_giant_pavlova_91173", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/giant_pavlova_91173_16x9.jpg", "ingredients": ["8 free-range egg whites", "475g/1lb 1oz caster sugar", "3 tsp cornflour", "2 tsp white wine vinegar", "800g/11lb 12oz seasonal mixed berries, such as raspberries, strawberries, gooseberries, blackberries or redcurrants", "2 oranges, juice and grated zest", "600ml/1 pint 1fl oz double cream", "Icing sugar, for dusting"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Line two baking trays with baking parchment.", "Whisk the egg whites in a large bowl until stiff, shiny peaks form when the whisk is removed.", "Add the sugar a few spoonfuls at a time, whisking well after each addition. When all of the sugar has been whisked into the egg whites, continue to whisk for 6-7 minutes or until the meringue mixture is stiff and glossy and stands up in peaks. Finally, whisk in the cornflour and white wine vinegar.", "Divide the meringue mixture equally between the two lined baking trays, spooning the mixture into the centre and spreading it into circles that are roughly 25cm/10in in diameter, using a palette knife.", "Reduce the oven temperature to 120C/250F/Gas ½, then bake the meringues for 1½ hours. After 1½ hours, turn off the oven and leave the meringues inside until they have completely cooled", "Meanwhile, place the berries, orange juice and orange zest into a saucepan. Bring the mixture to the boil, then reduce the heat until the fruit is simmering gently and continue to simmer for 10-15 minutes, or until the fruit is starting to break down. Remove the pan from the heat and set aside, covered, until the stewed fruit has completely cooled.", "Whip the cream in a large bowl until soft peaks form when the whisk is removed. Fold in the cooled stewed fruit to create a marbled effect.", "When the meringues have cooked, gently peel off the baking parchment.", "To serve, place one of the meringues onto a serving plate or cake stand. Spoon half of the cream and fruit mixture on top of it. Top with the second meringue and spoon over the remaining cream and fruit mixture. Dust with icing sugar and serve immediately. "]}, {"isVegetarian": true, "title": "Gin and lime truffles", "url": "www_bbc_co_uk_food_recipes_gin_and_lime_truffles_65812", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gin_and_lime_truffles_65812_16x9.jpg", "ingredients": ["100g/3½oz dark chocolate, broken into pieces", "2 tbsp double cream", "50g/1¾oz unsalted butter, chopped into small pieces", "2 tbsp gin", "½ lime, zest and juice only", "cocoa powder, to dust"], "serves": "Makes 20 truffles", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Put a heatproof bowl on top of a pan of simmering water, making sure the bottom of the bowl is not touching the water. Put the chocolate in the bowl with the cream and heat gently to allow the chocolate to melt.  ", "Add the butter (cut the butter up in quite small pieces because you want it to melt quite quickly). Give it a stir just to make sure all the butter is melted into the chocolate mixture. Keep stirring until all the butter has melted and the mixture is smooth and glossy.", "Add the gin, lime zest and juice. Whisk the ingredients together until smooth and slightly thickened. Spoon into a sealable container, put on the lid and chill overnight in the fridge.", "Take teaspoonfuls of the mixture and roll them into balls. Put on a plate lined with baking parchment and chill for an hour or so. ", "Sieve the cocoa into a bowl and roll the truffles in it to cover. These make a brilliant present."]}, {"isVegetarian": true, "title": "Gin and tonic granita", "url": "www_bbc_co_uk_food_recipes_gin_and_tonic_granita_18303", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gin_and_tonic_granita_18303_16x9.jpg", "ingredients": ["220g/8oz caster sugar", "170ml/6fl oz good quality gin", "500ml/18fl oz tonic", "1 lemon, juice only", "2 Bramley apples, peeled and grated", "500ml/18fl oz apple juice", "50g/1¾oz butter", "2 Braeburn apples, diced"], "serves": "Serves 8-10", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Bring 120ml/4fl oz water and the caster sugar to the boil. Once the sugar has dissolved, remove from the heat. Add the gin, tonic, lemon juice and the grated Bramley apple. Set aside to cool completely, then pour the mixture into a plastic freezer-proof container and place in the freezer.", "Every 30 minutes, remove from the freezer and whisk. Repeat this until frozen (this will take about 3-4 hours).", "To make an apple caramel, heat the apple juice until reduced in volume to a thick caramel (this will take approximately 45 minutes).  Remove from the heat and whisk in the butter. Leave to cool.", "To serve, remove the granita from the freezer and break up with a fork to create a ‘slush puppy’ texture. Sprinkle the diced Braeburn apple on top and serve with the apple caramel."]}, {"isVegetarian": true, "title": "Gin and cranberry sauce", "url": "www_bbc_co_uk_food_recipes_ginandcranberrysauce_87674", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ clementine ", "2 tsp cranberry jelly", "1 shot sloe gin", "champagne", "sprig redcurrants, dipped in sugar syrup (sold as 'gomme' syrup), then dipped in sugar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Squeeze the juice of the clementine quarter into a cocktail shaker, then add the quarter.", "Add the cranberry jelly and the sloe gin, top up with ice cubes and shake well.", "Pour the champagne into a flute glass until about two-thirds full.", "Strain the clementine, cranberry and sloe gin mixture into the flute glass. ", "Garnish with the sprig of sugared redcurrants."]}, {"isVegetarian": false, "title": "Ginger and coconut lobster curry with ginger chutney and coconut sticky rice", "url": "www_bbc_co_uk_food_recipes_ginger_and_coconut_28196", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 lobsters, cooked and meat removed, shells reserved for serving (optional)", "3 small onions, finely chopped", "20g/¾oz fresh ginger, grated", "12 curry leaves", "3 tbsp grated fresh coconut", "5 tbsp coriander seeds", "2 tbsp cumin seeds ", "1 tsp black peppercorns", "8 tbsp tamarind pulp", "1 litre vegetable stock", "3 dates, stones removed, chopped", "1 tbsp garam masala", "1 tbsp chilli powder", "1 tbsp curry powder", "200ml/7fl oz coconut milk", "3 tbsp rapeseed oil", "1 tsp cumin seeds", "2 tsp sesame seeds", "200g/7oz fresh ginger, thinly sliced", "1 green chilli, slit open", "1 tsp red chilli powder", "100g/3½oz tamarind paste", "100g/3½oz palm sugar", "pinch asafoetida", "1 dried red chilli", "½ tsp mustard seeds", "5-6 curry leaves", "400g/14oz sticky rice", "150ml/5fl oz coconut milk", "1 tsp salt", "2 tbsp fresh coriander, roughly chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the lobster curry, place the onion, ginger, curry leaves, coconut, seeds, peppercorns and a little water into a blender and blend until a smooth paste is formed.", "Put the tamarind pulp, stock, dates, garam masala, chilli powder and curry powder in a large pan and cook for 20-30 minutes to make tamarind stock.", "Heat a wok and add the paste. Once hot, add 200ml/7fl oz of the tamarind stock and the coconut milk. Cook for 4-6 minutes.", "Drop the cooked lobster pieces in the curry mixture and cook for 1-2 minutes.", "For the ginger chutney, heat two tablespoons of oil in a frying pan. Fry the cumin seeds for 1-2 minutes then add the sesame seeds, ginger, green chilli and chilli powder and season with a little salt. ", "Stir for 2-3 minutes and then cover the mixture with a circle of greaseproof paper and let it cook slowly for 40-45 minutes until the ginger is almost cooked. ", "Let the mixture cool then transfer to a food processor and blend to a fine paste with the tamarind paste and palm sugar. ", "Heat the remaining oil in a separate pan, add the asafoetida, red chilli and mustard seeds. As the mustard seeds pop, add the curry leaves, stir for 30 seconds then pour into the ginger chutney mixture and mix well. Set aside.", "For the coconut sticky rice, wash the rice 3 times and drain. Put the rice in a saucepan, cover with coconut milk and water so the liquid is 2cm/1in above the level of the rice. Add the salt and cover with a lid and bring to the boil.", "Boil for 5 minutes, then without opening the lid, turn the heat off and leave to steam for 20 minutes.", "To serve, pour or spoon the curry and lobster back into the shell (if using) and place on the serving plate. Put a spoon of ginger chutney alongside. Serve the coconut sticky rice in a separate serving bowl. Garnish with chopped fresh coriander."]}, {"isVegetarian": true, "title": "Ginger and treacle spiced traybake", "url": "www_bbc_co_uk_food_recipes_ginger_and_treacle_60494", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_and_treacle_60494_16x9.jpg", "ingredients": ["225g/8oz margarine, softened", "175g/6oz light muscovado sugar", "200g/7oz black treacle", "300g/10oz self-raising flour ", "2 tsp baking powder", "1 tsp ground mixed spice", "1 tsp ground allspice", "4 free-range eggs", "4 tbsp milk", "3 pieces stem ginger from a jar, finely chopped", "75g/2½oz icing sugar, sieved", "3 tbsp stem ginger syrup from the jar", "3 pieces stem ginger from a jar, chopped coarsely"], "serves": "Makes 15-20 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Cut a rectangle of non stick baking parchment to fit the base and sides of a 30x23x4cm/12x9x1½in traybake tin or roasting tin. Grease the tin and then line with the paper, pushing it neatly into the corners of the tin.   ", "Preheat the oven to 160C/325F/Gas 3.", "Measure all the ingredients for the traybake into a large bowl and beat well for about two minutes until well blended. A hand-held electric mixer is best for this but of course you can also mix it by hand with a wooden spoon. (Treacle can be difficult to weigh accurately as it tends to stick to the scale pan. Weighing the treacle on top of the sugar overcomes this problem.)", "Turn the mixture into the prepared tin, scraping the sides of the bowl with a plastic spatula to remove all the mixture. Level the top gently with the back of the spatula.", "Bake in the preheated oven for about 35-40 minutes, or until the traybake springs back when pressed lightly with a finger in the centre and is beginning to shrink away from the sides of the tin. Allow the traybake to cool a little, then remove the cake from the tin by easing the paper away from the sides of the tin. Turn onto a cooling rack, remove the lining paper and leave to cool completely.", "To make the icing, mix the icing sugar and syrup together in a small bowl until smooth and a spreading consistency. Pour the icing over the cake, spread gently to the edges with a small palette knife and sprinkle with the chopped stem ginger to decorate. ", "Allow the icing to set before slicing the traybake to serve. "]}, {"isVegetarian": true, "title": "Ginger and walnut carrot cake", "url": "www_bbc_co_uk_food_recipes_ginger_and_walnut_carrot_68622", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_and_walnut_carrot_68622_16x9.jpg", "ingredients": ["200g/7oz plain flour ", "1 tsp baking powder ", "½ tsp bicarbonate of soda ", "2 tsp ground ginger ", "¼ tsp fine sea salt ", "175g/6oz soft light brown sugar ", "2 large free-range eggs, at room temperature ", "200ml/7fl oz vegetable oil, plus extra for greasing ", "200g/7oz carrots, peeled and coarsely grated ", "100g/3½oz walnut pieces, roughly chopped, plus extra for decorating ", "75g/2½oz crystallised ginger, finely chopped, plus extra for decorating ", "100g/3½oz unsalted butter, softened ", "100g/3½oz icing sugar, sieved if lumpy ", "1 tsp cornflour ", "100g/3½oz cream cheese", "1 tbsp coarsely grated fresh ginger "], "serves": "Makes 8–12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150C Fan/Gas 3½ and grease the sides and line the base of a 20cm/8in springform cake tin with baking paper.", "Mix the flour, baking powder, bicarbonate of soda, ground ginger and salt together in a bowl. ", "Beat the sugar, eggs and oil in another large bowl until they are completely mixed together, then gradually add the flour mixture. At this stage the mixture may seem alarmingly stiff, but the carrots will loosen it up. Beat in the carrots and then fold in the walnuts and crystallised ginger, until everything is evenly combined. ", "Spoon into the prepared tin. Don’t worry if it looks as if you haven’t got enough batter, as the cake will rise well as it bakes. Smooth the top and bake for 45–55 minutes. When it’s ready, the cake will be set and golden-brown on top, beginning to shrink away from the edges of the tin and a cake tester will come out with just a few crumbs stuck to it. Transfer to a wire rack and leave to cool in its tin. ", "Meanwhile, to make the icing, beat the butter and icing sugar together and when combined, beat in the cornflour, followed by half the cream cheese. Once that’s incorporated, beat in the remaining half. Be careful not to over-beat or the icing will get too runny. Squeeze the juice from the grated ginger into the bowl and mix in, discard the ginger flesh. Cover with cling film and place in the fridge. ", "When the cake is completely cold, take the icing out of the fridge for about 20 minutes. Beat briefly to make sure it’s smooth. Remove the cake from its tin and place on a plate or cake stand. Spread the icing on top, swirling it a little, then sprinkle some chopped walnuts and crystallised ginger on top. "]}, {"isVegetarian": true, "title": "Ginger biscuits", "url": "www_bbc_co_uk_food_recipes_ginger_biscuits_87673", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_biscuits_87673_16x9.jpg", "ingredients": ["70g/2½oz butter", "80g/2¾oz light muscovado sugar", "2 tbsp black treacle or molasses", "8 cardamon pods", "250g/9oz plain flour", "½ tsp bicarbonate of soda", "2 tsp ground cinnamon", "1 tsp ground ginger", "1 free-range egg, yolk only", "around 2 tbsp milk", "1 tbsp icing sugar", "1 lemon, juice only"], "serves": "Makes 10-12 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Lightly butter a baking tray.", "Cream the butter and sugar together in a bowl with an electric mixer until light and fluffy. Beat in the black treacle or molasses.", "Break the cardamom pods open and crush the seeds finely. Add them to the mixture with the flour, bicarbonate of soda, cinnamon, ginger and egg yolk. ", "Beat in a couple of tablespoons of milk and then bring it all together to form a dough.", "Roll the dough out on a floured surface to a £1 coin thickness. Cut into your desired shapes.", "Lay the biscuits on the buttered baking tray and bake for 12-14 minutes. Remove from the oven and cool on cooling rack. Repeat with the remaining dough.", "Combine the icing sugar and the lemon juice in a bowl until smooth. Ice the biscuits with a pattern of your choosing."]}, {"isVegetarian": true, "title": "Gigantes with tomatoes and greens", "url": "www_bbc_co_uk_food_recipes_gigantes_with_tomatoes_47546", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gigantes_with_tomatoes_47546_16x9.jpg", "ingredients": ["500g/1lb 2oz dried gigantes beans or butter beans, soaked overnight", "1 onion, chopped", "2 garlic cloves, chopped", "6 tbsp olive oil", "½ tsp sweet paprika", "1 tbsp tomato purée", "1 x 400g tin chopped tomatoes", "1 tsp salt", "freshly ground black pepper, to taste", "350g/12oz chard or spinach, washed", "small handful fresh parsley, chopped", "small handful fresh mint, chopped"], "serves": "Serves 4-8", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Drain the beans, cover with fresh water and bring to the boil. Turn down to a simmer and cook for 1½-2 hours until the beans are just tender.", "Gently soften the onion and garlic in 2 tablespoons of the olive oil for 5 minutes. When soft, stir in the paprika, tomato purée, chopped tomatoes, 100ml/3½fl oz water, salt and pepper.", "Bring to the boil then reduce to a simmer and cook for 30 minutes. Stir in the chard and take off the heat.", "Preheat the oven to 160C/140C Fan/Gas 3. ", "When the beans are cooked, drain them and mix with the tomato and chard sauce, adding a further 2 tablespoons of olive oil and the chopped herbs.", "Transfer the beans to a casserole pan, drizzle with the remaining olive oil and bake for 35–40 minutes until the beans are tender and the sauce thickened and bubbling. Serve hot, warm or at room temperature."]}, {"isVegetarian": true, "title": "Ginger chocolate oat bar", "url": "www_bbc_co_uk_food_recipes_ginger_chocolate_oat_bar_55755", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_chocolate_oat_bar_55755_16x9.jpg", "ingredients": ["100g/3½oz butter", "100g/3½oz jumbo oats", "100g/3½oz rolled oats", "450g/1lb dark chocolate, 72 percent", "150ml/5fl oz double cream", "150g/5½oz dried cranberries", "150g/5½oz dried cherries", "150g/5½oz crystallised ginger, chopped"], "serves": "Makes 12-15", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a pan. Add both types of oats and cook for three minutes. Transfer to an oven dish that will fit in your fridge.", "Place a bowl over a pan of simmering water. Add the chocolate and cream to the bowl and leave to melt for 15 minutes without stirring.", "Add the cranberries, cherries and ginger to the oats and stir.", "When the chocolate has fully melted, give it a little stir and then pour over the oat and fruit. Fold the chocolate through and then refrigerate for 30 minutes.", "When set, break into pieces by hand and serve."]}, {"isVegetarian": false, "title": "Ginger gammon with mustard sauce", "url": "www_bbc_co_uk_food_recipes_ginger_gammon_with_92608", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_gammon_with_92608_16x9.jpg", "ingredients": ["3kg/6lb 8oz unsmoked gammon joint, off the bone", "600ml/21fl oz ginger beer", "4 pieces stem ginger, finely chopped", "4 tbsp ginger syrup from the jar", "200g/7oz full-fat crème fraîche", "6 tbsp full-fat mayonnaise", "2 tbsp Dijon mustard", "2 tbsp wholegrain mustard", "pinch caster sugar", "salt and freshly ground black pepper"], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "To make the gammon, put the gammon joint in a saucepan that fits snugly.  Pour in the ginger beer and 1.2 litres/2 pints of water or just enough to cover the gammon. Cover with a lid, bring to the boil and boil for a few minutes. Transfer to the oven for about 2½ hours or until cooked through.  Alternatively, simmer over a low heat for about 2½ hours.", "Increase the oven temperature to 220C/200C Fan/Gas 7.", "Remove the gammon joint from the liquid and, using a sharp knife, slice off the skin, just leaving a very thin layer.", "Line a roasting tin with kitchen foil, sit the gammon, fatiside up in the tin and wrap the foil around the meat just leaving the top showing.  Score the fat and drizzle over the ginger syrup. Scatter over the chopped ginger and press lightly so the top fat is covered.", "Bake in the hot oven for about 25 minutes or until golden and glazed on top.", "To make the sauce, mix all the ingredients together and season with salt and pepper.", "Slice the gammon into thin slices and serve hot or cold with the sauce."]}, {"isVegetarian": true, "title": "Ginger fizz", "url": "www_bbc_co_uk_food_recipes_ginger_fizz_01295", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_fizz_01295_16x9.jpg", "ingredients": ["200g/7oz ice ", "400g/14oz frozen cranberries, plus extra for decoration", "2-4 knobs of preserved stem ginger (depending on how gingery you like it)", "3 tbsp syrup from the stem ginger jar", "500ml/18fl oz cider"], "serves": "Makes 1 large jug", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Blend all ingredients except for the cider in a blender.", "Pour in the cider and blend again.", "Serve in a jug with a few extra frozen cranberries for decoration."]}, {"isVegetarian": true, "title": "Ginger parkin with ginger ice cream and sugared hazelnuts", "url": "www_bbc_co_uk_food_recipes_ginger_parkin_with_93910", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz double cream", "7 tbsp stem ginger syrup , from a jar", "½ tsp ground ginger ", "4 tbsp honey", "110g/3¾oz stem ginger from a jar, finely chopped", "150g/5½oz soft light brown sugar", "150g/5½oz softened butter, plus extra for greasing", "250g/9oz golden syrup", "75g/2¾oz black treacle", "125g/4½oz oats", "175g/6oz self-raising flour", "3 tbsp ground ginger", "1 tsp ground nutmeg", "1 tsp mixed spice", "pinch salt", "2 free-range eggs, beaten", "5 tsp milk", "1 free-range egg white ", "550g/1lb 4oz whole hazelnuts", "200g/7oz caster sugar ", "¼ tsp sea salt ", "150g/5½oz caster sugar", "200g/7oz fresh strawberries", "lemon verbena"], "serves": "", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the ginger ice cream, put the cream, ginger syrup, ground ginger and honey into a clean bowl. Whisk until soft peaks are formed in the cream when the whisk is removed. Stir in the chopped stem ginger, then transfer to a freezer-proof container and put in the freezer for 2 hours, or until solid. Remove from the freezer 10 minutes before serving to soften slightly.", "Preheat the oven to 140C/120C Fan/Gas 1. Butter a 30x20cm/12x8in cake tin.", "For the parkin, put the brown sugar, butter, syrup and treacle in a small saucepan and melt over a low heat.", "Put the oats, flour, ginger, nutmeg, mixed spice and salt in a large bowl and mix. Add the eggs and milk. Pour the melted butter and sugar mixture into the bowl and mix together with a whisk until well combined. Pour into the prepared tin and bake for 1¼ hours, or until firm in the centre. Remove from the oven and leave in the tin to cool before turning out and cutting into squares. ", "For the sugared hazelnuts, reduce the oven temperature to 130C/110C Fan/Gas 1.", "Lightly beat the egg white with 1 tablespoon water. Add the hazelnuts and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on a lined tray. Cook for 1 hour in the oven, stirring occasionally, until golden-brown. Remove and leave to cool. ", "For the decoration, heat a medium frying pan and add the sugar, leave on the heat until it turns to caramel (CAUTION: boiling sugar is extremely hot. Handle very carefully.)  Use a pastry brush to carefully brush the caramel on to serving plates. ", "Cut the ginger parkin into squares and place on the serving plates along with the sugared hazelnuts, strawberries and lemon verbena. Top with a scoop of the ginger ice cream and serve. "]}, {"isVegetarian": false, "title": "Ginger scallops with Chinese greens chiu chow noodles in sesame sauce", "url": "www_bbc_co_uk_food_recipes_ginger_scallops_with_31234", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp groundnut oil", "1½ tbsp finely chopped fresh ginger", "1 tbsp finely chopped garlic", "2 tbsp finely chopped spring onions", "450g/1lb scallops, including the roes", "1 tbsp Shaoxing rice wine or dry sherry", "2 tsp light soy sauce", "1 tsp sugar", "½ tsp salt", "½ tsp freshly ground white pepper", "1 tbsp groundnut oil", "2 tbsp garlic, thinly sliced", "700g/1½lb Chinese greens, such as Chinese flowering cabbage or bok choi, cut into 7.5cm/3in pieces", "2 tsp sesame oil", "225g/8oz dried e-fu noodles or dried egg noodles", "2 tbsp sesame oil", "4 tbsp sesame paste or peanut butter", "1 tbsp dark soy sauce", "2 tbsp light soy sauce", "2 tsp sugar", "225ml/8fl oz chicken stock", "½ tsp salt", "freshly ground white pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the ginger scallops with Chinese greens, heat a wok or large frying-pan over high heat until it is hot.  Add the oil, and when it is very hot and slightly smoking, add the ginger, garlic and spring onions and stir-fry for 10 seconds.  Immediately add the scallops and stir-fry them for 1 minute.  ", "Add the rice wine, soy sauce, sugar, salt, and pepper. Continue to stir-fry for 2 minutes, remove the scallops from the wok with any sauce and set aside.", "For the chiu chow noodles, in a large pot of boiling salted water, blanch the noodles for 2 minutes or until they are barely soft. Drain well and toss immediately with sesame oil and arrange on a serving platter.", "Mix all the sesame sauce ingredients together in a small pot and bring to a simmer. Allow the sauce to cool slightly and toss with the noodles. Serve at once.", "To finish the scallops, wipe the wok clean, add the groundnut oil and heat over high heat. When it is very hot and slightly smoking, add the sliced garlic and stir-fry for 10 seconds. Add the Chinese greens and stir-fry for 3 minutes or until the greens have wilted a little. ", "Return the scallops to the wok and continue to stir-fry for 3 minutes. Now add the sesame oil and stir-fry for another minute.  Serve at once."]}, {"isVegetarian": true, "title": "Ginger sponge cake", "url": "www_bbc_co_uk_food_recipes_ginger_sponge_cake_51697", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_sponge_cake_51697_16x9.jpg", "ingredients": ["200g/7oz self-raising flour", "200g/7oz sugar", "1 tsp ground ginger", "1 tsp bicarbonate of soda", "55g/2oz margarine, plus extra for greasing", "1 free-range egg, beaten", "2 tbsp golden syrup", "240ml/9fl oz hot water"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350FGas 4. Grease and line a 28cm x 18cm/11in x 7in baking tin with greaseproof paper.", "Mix the flour, sugar, ginger and bicarbonate of soda together in a bowl. Using your fingers, rub the margarine in until the mixture resembles breadcrumbs. Add the beaten egg, syrup and hot water and mix well with a wooden spoon until combined. ", "Pour the mixture into the prepared tin and bake in the middle of the oven for 35–40 minutes, or until golden-brown and the top is springy to the touch. Leave to cool in the tin. Once cool, cut into squares. "]}, {"isVegetarian": true, "title": "Ginger thins", "url": "www_bbc_co_uk_food_recipes_ginger_thins_11044", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ginger_thins_11044_16x9.jpg", "ingredients": ["130g/4⅔oz unsalted butter", "80g/2¾oz treacle", "50g/1¾oz golden syrup", "50g/1¾oz stem ginger in syrup, finely chopped", "3 tbsp syrup, from the stem ginger ", "1 lemon, zest only", "130g/4⅔oz soft light brown sugar", "500g/1lb 2oz plain flour", "2 tsp ground ginger", "2 tsp ground cinnamon", "1 tsp freshly grated nutmeg"], "serves": "Makes approximately 35 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line two large baking trays with baking paper.", "In a saucepan, heat the butter, treacle, golden syrup, stem ginger and syrup, lemon zest and sugar over a medium heat until melted and well combined.", "Sift the flour, ground ginger, cinnamon and nutmeg into a mixing bowl and stir together. Slowly add the warm wet mixture, mixing all the time with a wooden spoon until just combined. Briefly knead to bring the dough together.", "Roll out the dough between two sheets of greaseproof paper (it is quite sticky) until about 3—4mm thick. Cut out shapes using a biscuit cutter and transfer to the prepared trays (the biscuits don’t spread much so you can put them quite close together).", "Bake for 15 minutes, or until firm and golden-brown. Place on a wire rack to cool completely."]}, {"isVegetarian": true, "title": "Ginger apple fizz", "url": "www_bbc_co_uk_food_recipes_gingerapplefizz_8853", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1oz/25g raisins", "3½pts/2L apple juice", "3½pts/2L ginger beer", "1in/2cm piece root ginger (grated with skin on and squeezed for the juice - should yield about 1 tbsp/15ml)"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 60, "preparationMins": 60}, "recommendations": 0, "method": ["Soak the raisins in the apple juice for 1 hour.", "Add the ginger beer and root ginger juice. Serve at once. "]}, {"isVegetarian": true, "title": "Ginger and butternut squash ice cream", "url": "www_bbc_co_uk_food_recipes_gingerandbutternutsq_84060", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz double cream", "2 tbsp finely chopped, fresh ginger", "4 free-range egg yolks", "125g/4½oz caster sugar", "125g/4½oz cooked butternut squash, puréed ", "1 tsp lemon juice"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Fill a large bowl with ice and a little water.", "Place the cream and ginger into a saucepan and bring to the boil.", "Remove the saucepan from the heat and cover, leaving the cream to infuse for 30 minutes.", "After 30 minutes return the pan to the heat and bring back to the boil.", "Place the egg yolks and sugar in a bowl and whisk together.", "Pour in some of the hot cream mixture into the egg yolks and whisk continuously to combine.", "Pour the egg yolk mixture into the saucepan containing the rest of the cream and continue cooking gently for 3-4 minutes, or until the mixture coats the back of a spoon.  ", "Add the butternut squash to the cream mixture and, stir in throughly.", "Place the saucepan into the iced water bath, stirring occasionally, until chilled.  ", "Add the lemon juice to the cream and strain through a fine-mesh sieve.  ", "Pour the mixture into an ice cream machine and churn until smooth. Keep frozen until ready to use."]}, {"isVegetarian": true, "title": "Gingerbread apricot stuffing", "url": "www_bbc_co_uk_food_recipes_gingerbread_apricot_12205", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 onion, finely chopped ", "4 garlic cloves, chopped", "25g/1oz parsley, finely chopped ", "25g/1oz chives, finely chopped ", "25g/1oz thyme, finely chopped ", "25g/1oz oregano, finely chopped", "25g/1oz spring onions, finely chopped ", "50ml/2fl oz rapeseed oil  ", "500g/1lb 2oz pork sausagemeat ", "100g/3½oz dried apricots, finely chopped ", "200g/7oz parkin (or gingerbread or bulla) crumbled into the size of breadcrumbs", "1 free-range egg, beaten"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 150C/130C Fan/Gas 2.", "In a food processor, pulse together the onion, garlic, herbs, spring onions and rapeseed oil.", "In a bowl, mix the blended ingredients with the sausagemeat, apricots and parkin. Add the egg and season with salt and pepper.", "Roll into little balls and place on a lined baking sheet and bake for around 25 minutes."]}]