[{"ingredients": ["2 huevos de gallinas camperas", "Harina normal 150g / 5oz", "50ml / 2fl de leche en oz", "250 g / 9 oz de lentejas secas, cocidas de acuerdo con las instrucciones del paquete", "1 cucharada de aceite vegetal", "1 cucharada de aceite de colza", "½ cebolla, más o menos picada", "1 diente de ajo, picado", "1 pimiento verde, semillas eliminadas, en rodajas", "200 g / 7 oz de champiñones, en rodajas", "puñado de perejil fresco, picado", "Queso cheddar 100 g / 3½ oz, rallado", "sal y pimienta negra recién molida"], "method": ["Para los panqueques, coloque los huevos, la harina y la leche en un tazón grande y mezcle para formar una masa espesa y suave.", "Agregue las lentejas, mezcle bien y sazone, al gusto, con sal y pimienta negra recién molida.", "Caliente el aceite en una sartén y vierta lentamente suficiente masa para cubrir el fondo de la sartén. Freír durante dos minutos, o hasta que se doren por debajo, luego con cuidado voltee el panqueque y fría el otro lado durante dos minutos más. Repita con la masa restante.", "Para el relleno, caliente el aceite de colza en una sartén, agregue la cebolla y el ajo y cocínelos hasta que se ablanden.", "Agregue el pimiento verde y los champiñones y fría hasta que los champiñones estén suaves. Sazonar, al gusto, con sal y pimienta negra recién molida y revolver a través del perejil picado.", "Para servir, coloque el panqueque en un plato caliente, coloque una cuchara sobre el relleno de verduras en el centro y espolvoree sobre el queso."], "url": "www_bbc_co_uk_food_recipes_vegetablepancakes_85555", "title": "Panqueques de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de gramo 250g / ½lb", "50g / 2oz de harina autogeneradora", "½ cucharadita de chile rojo en polvo", "1 cucharadita de sal masala", "1 cucharadita de polvo tandoori masala (opcional), disponible en supermercados especializados de Asia", "1 cucharada de jugo de limón", "Papas de 300g / 10½oz, peladas y cortadas en trozos pequeños", "Cebollas de 300g / 10½oz, finamente picadas", "3 cebolletas, cortadas, finamente picadas", "6-8 hojas de espinaca, finamente picadas", "puñado de hojas frescas de cilantro", "1 cucharadita de chile verde picado", "1 cucharadita de sal", "aceite de girasol, para freír"], "method": ["Tamizar la harina de gramo y la harina de auto crianza en un recipiente. Agregue el chile en polvo, el garam masala y el polvo de tandoori masala, si está usando, y mezcle bien para combinar.", "Agregue el jugo de limón, luego agregue gradualmente suficiente agua para formar una masa suave que sea lo suficientemente gruesa como para cubrir la parte posterior de una cuchara. Reserve de 10 a 15 minutos.", "Agregue todos los ingredientes restantes excepto el aceite de girasol a la mezcla de la mezcla y mezcle bien para cubrir las papas y las cebollas.", "Caliente el aceite en una sartén profunda de base pesada hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cuando el aceite esté caliente, baje cuidadosamente cucharadas soperas de la mezcla de la mezcla en el aceite y fríe durante 5-6 minutos, o hasta que las pakoras estén crujientes y doradas y las verduras se hayan cocinado. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_vegetablepakoras_90048", "title": "Pakoras vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 3-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetablepakoras_90048_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["140-170 g / 5-6 onzas de hojaldre con mantequilla", "½ calabacín, finamente cortado", "½ pimiento rojo, sin semillas y finamente cortado", "½ cebolla roja, finamente rebanada", "4-5 setas de botón finamente cortadas", "1 cucharada de mantequilla", "sal y pimienta negra recién molida", "1 huevo, solo yema, ligeramente batido", "1 cucharada de pecorino recién rallado o queso parmesano"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "Ruede la masa de hojaldre a un grosor de ½ cm / ¼ in. Enfriar en el refrigerador durante al menos 30 minutos. Cortar en forma redonda con un diámetro de aproximadamente 20 cm / 8 pulgadas y pinchar toda la superficie de un tenedor, de manera uniforme y completamente por todas partes. Coloque la masa en una bandeja para hornear y hornee por 10-15 minutos, hasta que esté dorada.", "Mientras la masa está horneada, saltee las verduras en la mantequilla por unos minutos, hasta que se marchiten, pero no completamente cocidas. Condimentar con sal y pimienta.", "Retire la masa del horno y cepille con la yema de huevo. Esto ayuda a mantener las verduras pegadas a la bocanada, pero también protege la pastelería de absorber el exceso de líquidos de las verduras, asegurando una base crujiente y no mojada.", "Extienda las verduras uniformemente sobre la masa, espolvoree con el queso y hornee durante aproximadamente 10 minutos, aproximadamente 180 ° C / 350 ° F / Gas 4. Para servir, corte en rodajas."], "url": "www_bbc_co_uk_food_recipes_vegetablepuffpizza_67910", "title": "Pizza de soplo de verduras", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de semillas de cardamomo (si no puedes comprar las semillas, entonces compra las vainas de cardamomo y cáscalas tú mismo)", "1 cucharadita de pimienta negra", "1 cucharadita de semillas de comino negro (puede usar semillas de comino regulares si el negro no está disponible)", "1 cucharadita de clavos enteros", "1/3 de nuez moscada entera (se puede romper una nuez moscada enterita colocándola en un paño y golpeándola con un mazo de carne o un rodillo)", "una barra mediana de canela, aproximadamente 5cm-8cm / 2in-3in, dividida en 3-4 piezas", "arroz basmati, medido al nivel de 450 ml / 1 pinta en una jarra medidora", "pedazo de jengibre fresco del tamaño de un pulgar", "3 cucharadas de aceite de oliva o maní", "½ cucharadita de semillas de mostaza marrón", "1 ají verde caliente, finamente picado", "Patata de 100g / 4oz, pelada y cortada en dados de 5mm / ¼in", "¼ zanahoria, pelada y cortada en dados de 5mm / ¼in", "40 g / 1½ oz de judías verdes, cortadas en segmentos de 5 mm / ¼ pulgadas", "½ cucharadita de cúrcuma molida", "1 cucharadita de sal masala", "1¼ cucharadita de sal", "570ml / 1 pinta de agua"], "method": ["Para el garam masala, ponga todas las especias de garam masala en un molinillo de café limpio u otro molinillo de especias y muela lo más finamente posible. Almacene en un recipiente bien tapado, lejos del calor y la luz solar. Esto hace alrededor de tres cucharadas.", "Para el pullao, lava el arroz en varios cambios de agua y luego escurre. Coloque el arroz en un recipiente, cúbralo con agua y déjelo en remojo durante 30 minutos, luego drene nuevamente.", "Pelar y rallar finamente el jengibre.", "Caliente el aceite en una sartén de base pesada (con una tapa bien ajustada) a fuego medio-alto. Cuando esté caliente, agregue las semillas de mostaza.", "Tan pronto como empiezan a explotar, en cuestión de segundos, agregue el chile, la papa, la zanahoria y las judías verdes y revuelva.", "Agregue la cúrcuma y el garam masala y revuelva por un minuto.", "Agregue el jengibre y saltee, revolviendo, por otro minuto.", "Escurra el arroz y agréguelo a la sartén.", "Reduzca el fuego a medio-bajo y mezcle el arroz muy suavemente para mezclarlo con los otros ingredientes y cúbralo con el aceite y las especias. Cocina de esta manera por dos minutos.", "Agregue los 570 ml / 1 pinta de agua y la sal y deje que hierva. Cubra la sartén con una tapa muy ajustada (si no tiene una tapa muy ajustada, cubra la sartén con papel de aluminio y luego con una tapa), luego caliente el fuego a fuego lento y cocínelo durante 25 minutos. Después de este tiempo pruebe un grano de arroz para ver si está cocinado, cocínelo unos minutos más si es necesario.", "Una vez que esté cocido, puede dejarlo con la tapa puesta y el calor apagado durante hasta media hora antes de servir. O servir a la vez en un plato de servir."], "url": "www_bbc_co_uk_food_recipes_vegetablepullao_90302", "title": "Pulao de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetablepullao_90302_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de aceite de oliva", "2-3 dientes de ajo, finamente picados", "3 grandes pellizcos de hilos de azafrán", "3 pimientos rojos y anaranjados mezclados, sin corazón, sin semillas y cortados en 6 tiras", "3 calabacines, aproximadamente 100 g / 3½ oz cada uno, cortados en trozos de 2.5cm / 1in", "2 cebollas cortadas en rodajas", "sal y pimienta negra recién molida", "4 tomates de ciruela, alrededor de 250 g / 9 oz en total", "1 pimiento rojo, sin corazón, sin semillas y descuartizado", "1 diente de ajo, finamente picado", "gran pizca de pimentón ahumado", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Ponga el aceite para las verduras en una bolsa grande de plástico con ajo, azafrán y algo de sal y pimienta. Agregue las verduras, sujete el borde superior de la bolsa para sellar y mezclar. Dejar de lado por al menos 30 minutos.", "Mientras tanto, para el rouille, ponga los tomates y la pimienta en una lata pequeña para asar. Espolvorear con el ajo, pimentón ahumado un poco de sal y pimienta. Luego rocíe el aceite y tápelo durante 15 minutos. Dejar enfriar.", "Pele las pieles de los tomates y la pimienta. Purifique la carne en un licua- dor o procesador de alimentos con cualquier jugo del estaño de tostado hasta que quede suave. Poner en un tazón y reservar, mantener caliente.", "Incline las verduras de azafrán en una lata grande para asar y cocine en el horno durante 15-20 minutos, volteándolas una vez, hasta que estén doradas.", "Coloque las verduras en platos individuales y sirva con cucharadas de rouille."], "url": "www_bbc_co_uk_food_recipes_vegetables_with_red_91408", "title": "Verduras con pimienta roja rouille", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetables_with_red_91408_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "½ cebolla, pelada, rebanada", "2 dientes de ajo, pelados, aplastados", "1 cucharada de raíz de jengibre, pelado, rallado", "½ cucharadita de curry en polvo", "3 vainas de cardamomo, solo semillas, aplastadas", "225g / 8oz de lentejas Puy cocidas, escurridas, enjuagadas", "1 cucharada de puré de tomate", "puñado de hojas frescas de espinaca", "200g / 7oz de harina de chapati, más extra para espolvorear", "pizca de sal", "agua tibia, para unir", "1 cucharada de semillas de cebolla negra"], "method": ["Para el estofado, caliente el aceite vegetal en una sartén a fuego medio. Freír las cebollas, el ajo y el jengibre en el aceite durante 3-4 minutos, para ablandarlo.", "Agregue las especias a la sartén y mezcle bien. Agregue las lentejas de Puy cocidas y el puré de tomate y cocínelas durante 4-5 minutos, o hasta que estén bien calientes, revolviendo ocasionalmente. Agregue la espinaca. Dejar de lado.", "Para los chapatis, mezcle la harina, la sal y suficiente agua tibia para formar una masa. Convierta la masa en una superficie ligeramente enharinada y amasar hasta que quede suave y elástica.", "Divida la masa en 3-4 piezas, cada una del tamaño de una manzana pequeña, y extienda en círculos finos con un rodillo. Distribuye sobre las semillas de cebolla negra y presiona hacia abajo en la masa.", "Uno por uno, freír los círculos de masa enrollados en una sartén por ambos lados hasta que empiecen a burbujear y se pongan dorados.", "Para servir, calentar el estofado y servir con los dos o más chapatis."], "url": "www_bbc_co_uk_food_recipes_vegetablestewwithcha_92394", "title": "Guiso de verduras con chapatis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite vegetal", "½ cebolla, en rodajas", "1 cucharada de jengibre fresco y picado", "1 diente de ajo, picado", "½ pimiento rojo, cortado en tiras", "½ pimiento amarillo, cortado en tiras", "1 hoja suma choi, triturada", "2 cucharadas de salsa de soja", "1 cucharada de aceite de sésamo"], "method": ["Caliente el aceite en una sartén y fría la cebolla, el jengibre y el ajo durante 3-4 minutos o hasta que se ablanden. Agregue los pimientos y cocine durante 2-3 minutos más, luego agregue la suma de choi, salsa de soja y aceite de sésamo. Revuelva bien y cocine por 2-3 minutos más, o hasta que la suma de choi se marchite.", "Poner los sofritos en un bol y servir."], "url": "www_bbc_co_uk_food_recipes_vegetablestirfry_90424", "title": "Salteado de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de cerdo 150 g / 5½ oz, en rodajas", "pizca de copos de chile", "dash aceite de oliva", "sal y pimienta negra recién molida", "2 dientes de ajo picados", "½ cebolla, finamente rebanada", "1 zanahoria, muy finamente cortada", "2 puerros pequeños, muy finamente rebanados"], "method": ["Coloque la carne de cerdo en rodajas en un bol con las hojuelas de chile, una pizca de aceite de oliva, sal y pimienta negra recién molida y ajo. Revuelva bien y déjelo marinar durante diez minutos.", "Calentar un wok, agregar un chorrito de aceite de oliva y sofreír el cerdo por 2-3 minutos, luego retirarlo a un plato.", "Agregue un poco más de aceite de oliva al wok y vuelva al fuego. Agregue la cebolla, la zanahoria y los puerros y saltee durante tres minutos. Regrese la carne de cerdo al wok y revuelva bien.", "Para servir, amontone los sofritos en un tazón para servir."], "url": "www_bbc_co_uk_food_recipes_vegetablestirfrywith_87963", "title": "Vegetales salteados con chile y carne de cerdo con ajo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de maní", "1 cebolla, pelada y rebanada", "1 diente de ajo, aplastado", "1 pimiento rojo, en rodajas", "1 pimiento amarillo, en rodajas", "Floretes de brócoli 100 g / 4 oz", "175g / 6oz de maíz dulce para bebés, reducido a la mitad", "2 calabacines en rodajas", "50 g / 2 oz de castañas de agua, en rodajas", "2 cucharadas de salsa de soja ligera", "1 cucharadita de arrurruz, mezclado con", "2 cucharadas de caldo de verduras liviano", "5cm / 2in pieza de raíz de jengibre fresco, rallado y jugo exprimido", "1 cucharada de salsa de chile dulce", "50g / 2oz anacardos, ligeramente tostados"], "method": ["Calentar el aceite en un wok y freír la cebolla y el ajo durante 3 minutos. Agregue los pimientos y fría por 3 minutos más.", "Agregue los brotes de brócoli, maíz dulce y calabacines y continúe freír por otros 5 minutos. Agregue las castañas de agua y mezcle para mezclar.", "En un tazón pequeño, mezcle la salsa de soja, el arrurruz y el caldo ligero, el jugo de jengibre y la salsa de chile dulce.", "Con una cuchara de madera, haga un espacio en el centro de las verduras salteadas para que la base del wok esté visible. Vierta la salsa y hierva, revolviendo todo el tiempo hasta que empiece a espesarse. Mezcle las verduras para cubrirlas completamente con la salsa.", "Transfiera a un plato de servir y espolvoree con los anacardos."], "url": "www_bbc_co_uk_food_recipes_vegetablestirfrywith_8814", "title": "Vegetales salteados con anacardos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de cacahuete", "2 dientes de ajo, pelados, finamente picados", "Jengibre fresco de 2.5cm / 1in, pelado, rallado", "150g / 3½oz de langostinos crudos, cabezas y cáscaras retirados, sin espinas", "2 zanahorias, peladas, en juliana", "Floretes de brócoli 150 g / 5 oz", "Col china de 150g / 5oz, rallada", "2 cabezas de bok choi, cortadas por la mitad", "80g / 2¾oz de soja", "250g / 9oz de fideos listos para el wok", "3 cucharadas de aceite de sésamo", "3 cucharadas de salsa de soja ligera", "3 cucharadas de vinagre de arroz o mirin", "hojas de cilantro fresco picado, para servir"], "method": ["Caliente el aceite de cacahuete en un wok a fuego alto. Cuando el aceite esté humeando, agregue el ajo, el jengibre y las gambas y saltee por un minuto.", "Agregue las zanahorias, el brócoli y la col china y continúe revolviendo por 2-3 minutos, o hasta que se marchite.", "Agregue el bok choi, los brotes de soja y los fideos y sofría por un minuto más.", "En un tazón, mezcle el aceite de sésamo, la salsa de soja y el vinagre de arroz hasta que estén bien combinados. Agregue la mezcla al wok y saltee durante otros 1-2 minutos, o hasta que la mayor parte del líquido se haya evaporado.", "Espolvorea sobre las hojas de cilantro y sirve inmediatamente."], "url": "www_bbc_co_uk_food_recipes_vegetablestirfrywith_92057", "title": "Salteado de verduras con gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 zanahorias, peladas y picadas", "2 cebollas, peladas y cortadas en cuartos", "2 tallos de apio, más o menos picados", "½ bulbo de hinojo, toscamente picada", "tallo de una cabeza de brócoli, más o menos picada", "2 tomates", "8 botones de champiñones, a la mitad", "6 granos de pimienta negra", "1 hoja de laurel seca", "3 tallos frescos de perejil"], "method": ["Pon todos los ingredientes en una sartén grande y cúbrelos con agua. Llevar a ebullición. Cubra y cocine a fuego lento con cuidado durante 20-30 minutos. Colar en un tazón grande y dejar enfriar.", "Use dentro de 3 días o congele. Para congelar, reduzca el caldo a la mitad hirviéndola vigorosamente y enfríe. Verter en bandejas de cubitos de hielo y congelar. Cuando esté congelado, coloque los cubos en una bolsa, etiquételos, y cuando quiera usar uno, simplemente coloque una jarra y agregue agua hirviendo para disolver el cubo."], "url": "www_bbc_co_uk_food_recipes_vegetablestock_1297", "title": "Caldo de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 1 pinta", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "½ puerro, cortado en cubitos", "1 zanahoria, en cubitos", "1 bulbo pequeño de hinojo, cortado en cubitos", "3 dientes de ajo, todo entero y aplastado suavemente", "alrededor de 20 granos de pimienta negra", "8-10 setas de botón", "1 palo de apio, cortado en cubitos", "3 tomates, cortados en cubitos", "3-4 tallos de perejil fresco, toscamente desgarrados"], "method": ["Para hacer el caldo de verduras, agregue el aceite de oliva a una sartén de fondo grueso o una olla a fuego medio.", "Agregue la cebolla, el puerro, la zanahoria, el hinojo y el sudor durante 2-3 minutos.", "Agregue suficiente agua fría para cubrir generosamente las verduras y suba el fuego a fuego alto.", "Agregue el ajo, los granos de pimienta, los champiñones, el apio, los tomates y el perejil y mezcle. Llevar a ebullición y hervir suavemente durante 15 minutos.", "Vierta el caldo a través de un colador. Deseche los pedazos de vegetales o reserve para otro uso. El material líquido está listo para ser utilizado. Puede almacenarse en la nevera por hasta tres días o congelarse en lotes para usar en el futuro."], "url": "www_bbc_co_uk_food_recipes_vegetablestock_90306", "title": "Caldo de verduras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "1.5l / 2 pintas 12fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetablestock_90306_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "1½ cucharadita de semillas de comino", "1 chile seco de Cachemira, entero con semillas", "Jengibre fresco de la raíz de los 5cm / 2in, fino rallado", "3 cebollas pequeñas, en rodajas finas", "1 chile verde fresco, picado, con o sin semillas", "1 pimiento rojo o amarillo, sin semillas, cortadas longitudinalmente en tiras de 5 mm / ¼ de grosor", "1 pimiento verde, sin semillas, cortado longitudinalmente en tiras de 5 mm / ¼ de grosor", "1 cucharadita de sal", "½ cucharadita de cúrcuma molida", "1½ cucharadita de chile en polvo Kashmiri", "Paneer de 250g / 9oz, cortado en 3cm / 1¼in x 1.5cm / ¾en piezas", "3 tomates, cortados en tiras", "1 cucharadita de vinagre de vino", "½ cucharadita de semillas de comino molidas", "¾ cucharadita de sal masala"], "method": ["Calentar el aceite en una sartén o karahi de base pesada a fuego medio y agregar las semillas de comino, el chile entero seco y aproximadamente dos tercios del jengibre rallado, y freír durante 30 segundos hasta que estén aromáticos.", "Agregue las cebollas y el chile verde y fría por 5-6 minutos, o hasta que las cebollas se suavicen pero no se doren y todavía tengan un poco de crujido. Agregue los pimientos, la sal, la cúrcuma y el chile en polvo, y fría por 3-4 minutos más.", "Baje el fuego, agregue el paneer a la sartén y revuelva todo suavemente durante unos cinco minutos, luego agregue el tomate y caliente. Agregue el vinagre, el comino molido y el garam masala, espolvoréese con el jengibre rallado restante y sirva."], "url": "www_bbc_co_uk_food_recipes_vegetarian_curry_with_66421", "title": "Curry vegetariano con queso indio, tomates y pimientos (paneer jalfrezi)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 2-4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarian_curry_with_66421_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 berenjena grande, cortada en trozos pequeños", "5 dientes de ajo sin pelar", "3 ramitas de tomillo frescas", "3 cucharadas de aceite de oliva, más extra para freír", "1 cebolla grande, finamente rebanada", "400g de tomates cortados en lata", "½ pimiento rojo, semillas removidas y rebanadas finas", "Azúcar demerara 30 g / 1 oz", "2 cucharadas de puré de tomate", "½ lima, solo jugo", "½ manojo de cilantro fresco, hojas recogidas, tallos finamente picados", "sal y pimienta negra recién molida", "50 g / 1¾oz de chile chipotle seco, reducido a la mitad", "1 cebolla grande, descuartizada", "4 dientes de ajo", "2 cucharadas de hojas frescas de orégano", "2 cucharadas de hojas frescas de tomillo", "½ cucharadita de semillas de comino", "dash salsa Tabasco", "2 chiles verdes, tallos eliminados", "200ml / 7fl oz de agua hirviendo", "2 cucharadas de aceite de oliva", "25ml / 1fl oz de vinagre de vino blanco", "25ml / 1fl oz de vinagre balsámico", "2 cucharadas de puré de tomate", "½ cucharada de salsa de soja", "Azúcar demerara 90 g / 3 oz", "½ lima, solo jugo", "1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "2 dientes de ajo grandes, aplastados", "1 chile rojo, finamente picado", "400 g de pulsos mixtos de estaño, escurridos y enjuagados", "½ cilantro fresco pequeño, hojas escogidas, tallos finamente picados", "½ pequeño perejil fresco de flatleaf, finamente picado", "½ racimo de cilantro fresco pequeño, finamente picado", "1 cebolla roja grande, finamente picada", "½ chile rojo, sin semillas, finamente picado", "½ lima, solo jugo", "1 tomate, finamente picado", "Harina de maíz con 250g / 9 oz de harina de masa", "1 cucharadita de polvo de hornear", "200-250ml / 7-9fl oz de agua caliente", "250ml / 9fl oz de aceite de oliva", "sal"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para hacer la berenjena asada, poner la berenjena en una lata de asar con dos dientes de ajo y el tomillo. Sazone con sal y pimienta y cubra con el aceite. Asar durante 30-40 minutos, volteándolos de vez en cuando, hasta que estén suaves y dorados.", "Mientras tanto, para hacer la salsa de chipotle, ponga a hervir una olla pequeña de agua. Reduzca el fuego, agregue los chiles chipotle y cocine a fuego lento durante 15 minutos.", "Mientras se cocinan los chiles, ponga la cebolla, el ajo, el orégano, el tomillo, las semillas de comino, el tabasco, los chiles verdes, el agua hirviendo, 1 cucharada de aceite y una pizca de sal y pimienta en un procesador de alimentos. Mezcle durante aproximadamente 5 minutos, o hasta que tenga una pasta.", "Escurra los chiles chipotle, agréguelos al procesador de alimentos y luego mezcle nuevamente.", "Vierta la pasta de chile en la cacerola con el resto de 1 cucharada de aceite. Cocine por 2 minutos a fuego medio. Agregue los vinagres, el puré de tomate, la salsa de soya, el azúcar y el jugo de lima. Llevar a ebullición, reducir el fuego y hervir a fuego lento durante 15 minutos, o hasta que se alcance una consistencia pastosa. Prueba a ver si se necesita más sal o azúcar y retíralo del fuego.", "Para hacer los frijoles refritos, caliente el aceite en una cacerola de fondo grueso a fuego medio. Freír la cebolla durante 5-10 minutos, o hasta que comience a dorarse. Agregue el ajo y el chile y cocine por 1 minuto. Agregue los pulsos drenados, los tallos de cilantro y una cucharada de salsa chipotle. Cocine por 10-12 minutos. Sazone con sal y pimienta y agregue las hojas de cilantro y el perejil.", "Para terminar la berenjena asada, caliente un poco de aceite en una sartén a fuego medio y fría la cebolla durante 5 minutos, o hasta que esté transparente. Pele y triture el ajo restante y agregue a la sartén. Freír durante 2 minutos antes de agregar los tomates, el pimiento rojo, el azúcar y el puré de tomate. Llevar a ebullición, sazonar y cocinar a fuego lento hasta que se reduzca en un tercio. Agregue 5 cucharadas de la salsa de chipotle, el jugo de lima y los tallos de cilantro y vuelva a hervir. Finalmente, agregue la berenjena asada y las hojas de cilantro y revise el condimento.", "Mezcle todos los ingredientes de la salsa y déjelos a un lado.", "Para hacer las gorditas, combine la harina de maíz con harina de masa, el polvo de hornear y una buena pizca de sal en un tazón grande. Haga un pozo en el centro y lentamente agregue el agua caliente hasta que tenga una masa factible. Forme ocho piezas y enrolle cada una en un círculo de 10cm / 4 pulgadas.", "Calentar el aceite en una sartén antiadherente y freír las gorditas en lotes durante 2 o 3 minutos, volteándolas, hasta que estén doradas. Escurrir sobre papel de cocina.", "Sirva las gorditas con la salsa de berenjena tibia, frijoles refritos, salsa y salsa de chipotle extra, si lo desea."], "url": "www_bbc_co_uk_food_recipes_vegetarian_gorditas_with_08931", "title": "Gorditas vegetarianas con berenjena asada, salsa de chipotle, frijoles refritos y salsa", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarian_gorditas_with_08931_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 grandes setas planas abiertas / Portobello", "1 cucharada de aceite de oliva", "75g / 2½ oz de pan rallado", "2 cucharadas de piñones, tostados", "2 cucharadas de pecorino rallado", "2 cucharadas de perejil fresco picado", "350g / 12 oz de haggis vegetarianos, en rodajas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Coloque los champiñones en una bandeja para hornear y rocíe con un poco de aceite. Cocine en el horno durante 5-6 minutos o hasta que comience a ablandarse.", "Mezcle las migas de pan, los piñones, el pecorino y el perejil.", "Retire los champiñones de debajo de la parrilla y cubra cada hongo con una rebanada de haggis vegetariano.", "Coloque la mezcla de migas de pan sobre los haggis y rocíe con un poco más de aceite.", "Regrese al horno por unos 15 minutos o hasta que el queso se derrita ligeramente y el relleno esté caliente y burbujeante.", "Sirva un hongo como entrante o 2-3 con tatties y neeps como plato principal."], "url": "www_bbc_co_uk_food_recipes_vegetarian_haggis_12104", "title": "Hongos rellenos de haggis vegetarianos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarian_haggis_12104_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "2 cebollas, finamente picadas", "4 zanahorias picadas", "½ colinabo, picado", "200g / 7oz chirivías, picadas", "50g / 1¾oz de harina natural", "750ml / 1⅓ pinta de caldo de verduras, hecho de cubo común", "4 cucharadas de cebada perlada", "3 ramitas de tomillo, solo hojas", "Patatas de 900 g / 2lb, cortadas en rodajas de 2 mm", "25g / 1oz de mantequilla", "sal y pimienta negra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Caliente una cacerola grande a fuego medio. Agregue el aceite y, una vez caliente, agregue la cebolla y una pizca de sal. Cocine las cebollas durante 4-5 minutos, o hasta que se ablanden. Agregue las zanahorias, el colinabo y la chirivía, más otra pizca de sal. Coloque una tapa y fríela suavemente durante 10 minutos, o hasta que se ablande un poco.", "Retire la tapa, espolvoree la harina y revuelva para cubrir las verduras y absorba los jugos de cocina. Agregue el caldo, la cebada perlada y el tomillo y revuelva para mezclar bien. Cocine a fuego lento durante 15-20 minutos para espesar. Añadir sal y pimienta al gusto.", "Mientras tanto, caliente una olla grande de agua y cocine las rodajas de patata en agua hirviendo durante 1-2 minutos para que se ablanden ligeramente. Escurra y luego póngalos en agua fría para enfriarlos y hacerlos más fáciles de manejar.", "Vierta la mezcla de verduras en un plato grande a prueba de horno de 21x29 cm / 8x12 pulgadas. Coloque las rodajas de papa sobre la parte superior de las verduras, condimente entre las capas con sal y pimienta al gusto y termine con una capa de rodajas ordenadas. Pase la manteca y termine con una pizca de sal y pimienta. Coloque en el horno precalentado y cocine durante 45-50 minutos, o hasta que el relleno esté burbujeante y las papas estén doradas en la parte superior."], "url": "www_bbc_co_uk_food_recipes_vegetarian_lancashire_22533", "title": "Cocina vegetariana de Lancashire", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["rociar aceite de oliva", "4 puerros, en rodajas finas", "4 ramitas de romero, recogidas", "6 ramitas de tomillo, toscamente picadas", "3 dientes de ajo, finamente picados", "250 g / 9 oz de champiñones castaños, finamente picados", "5 hojas de salvia, más o menos picadas", "600g / 1lb de nueces variadas de 5 oz (por ejemplo, pacanas, anacardos y avellanas)", "150g / 5½oz Gruyère, rallado", "3 huevos de gallinas camperas", "150g / 5½oz de arándanos secos", "125g / 4½oz de arándanos congelados", "100 ml / 3½ fl oz de agua", "80g / 2¾oz de mantequilla", "125g / 4½ oz de harina natural, más extra para extender la masa", "150g / 5½oz de harina integral", "pizca de sal", "1 huevo de gallinas camperas, más 1 huevo de gallinas camperas, batido, para esmaltar", "2 cucharadas de mantequilla", "1 cucharadita de puré de tomate", "1 cucharadita de extracto de levadura", "1 cucharada de harina normal", "algunas ramitas de romero", "500ml / 18fl oz de caldo de verduras", "pizca de azúcar moreno", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200 ° C / 400 ° F / Gas 6 y engrasar una lata con forma de resorte de 18 cm / 7 pulg.", "Calentar el aceite en una sartén y freír los puerros, el romero y el tomillo durante 4-5 minutos, o hasta que se ablanden. Añadir el ajo y cocinar por otro minuto.", "Agregue los champiñones y la salvia y cocínelos por 2-3 minutos, luego retírelos del fuego, transfiéralos a un tazón grande y déjelos enfriar. (Reserve dos cucharadas de esta mezcla para la salsa).", "Tueste las nueces en el horno durante 8-10 minutos (vigílelas ya que se queman muy fácilmente). Retirar del horno y reservar para enfriar.", "Mezcle las nueces en un procesador de alimentos con un polvo grueso y agregue a la mezcla de puerros con el queso. Mezcle hasta que esté bien combinado y sazone con sal y pimienta negra recién molida.", "Agregue los huevos hasta que estén bien combinados.", "Para la masa, caliente el agua y la mantequilla en una cacerola pequeña a fuego medio hasta que la mantequilla se derrita y la mezcla hierva.", "Mezcle las harinas, la sal y el huevo en un bol, luego agregue la mezcla de mantequilla y mezcle bien rápidamente hasta que se combinen. Forme la masa en forma de bola (debe estar bastante húmeda) y enfríe en la nevera durante cinco minutos.", "Corte una quinta parte de la masa y déjela a un lado, luego amasar la masa restante brevemente y extender sobre una superficie de trabajo bien enharinada en un círculo de 5 mm / ¼ pulgada de espesor.", "Enharina la parte superior de la masa, dóblela en cuatro y úsela para revestir la lata con forma de resorte de 18 cm / 7 pulg. Coloque la masa doblada en la lata con el extremo puntiagudo hacia el centro, luego despliegue la masa para que el exceso caiga sobre el costado (la masa será bastante frágil). Ahora facilita la masa en las esquinas de la lata. Si la masa se rompe, apriétala nuevamente, este pastel es muy indulgente.", "Recorte la masa, dejando un borde de 1 cm / ½ pulgada.", "Vierta la mitad del relleno en la lata, presionándola fuertemente con una cuchara de madera. Incline los arándanos secos, presione un poco y termine con el resto del relleno de pastel, presionando bien.", "Cepille cualquier masa expuesta con el huevo batido.", "Haga rodar la masa reservada en un círculo, y usando la lata del pastel como guía, recorte un círculo con un borde de 1 cm / ½ pulgada.", "Coloque la masa en la parte superior de la lata y apriete o engarce la tapa sobre la tarta para sellarla, recortando cualquier exceso. Corta una hendidura en el medio del pastel para que escape el vapor y hornea en el horno durante 20-25 minutos.", "Retire la tarta del horno y retire con cuidado la lata. Deslice el pastel sobre una bandeja para hornear y glasee la parte superior y los lados del pastel con el huevo batido, luego vuelva al horno por otros 15 minutos o hasta que se dore.", "Retire el pastel del horno, vuelva a glasear la parte superior y cubra con los arándanos congelados. Regrese al horno por otros 5-10 minutos.", "Mientras tanto, para la salsa, derrita la mantequilla en una cacerola y agregue la mezcla reservada de hongos y puerros, seguido del puré de tomate. Revuelva a fuego lento durante 2 minutos, o hasta que cambie de color a un tono más oscuro de marrón.", "Agregue el extracto de levadura, la harina y el romero y agregue gradualmente el caldo. Llevar a ebullición, luego sazone con sal pimienta y azúcar moreno.", "Cocine a fuego lento durante 10-15 minutos, hasta que espese. (Puede colar la mezcla para obtener una salsa suave si lo desea)."], "url": "www_bbc_co_uk_food_recipes_vegetarian_nut_roast_pie_62864", "title": "Pastel vegetariano de nueces asadas con arándanos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8-10", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarian_nut_roast_pie_62864_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "1 puerro, cortado, finamente picado", "2 zanahorias, finamente picadas", "Setas de castaña 150g / 5½ oz, más o menos picadas", "1 diente de ajo grande, finamente picado", "3 hojas de salvia fresca, toscamente picadas", "3 ramitas de tomillo fresco, solo hojas, finamente picadas", "1 x 400 g de estaño verde o lentejas Puy, escurridas", "1 x 400 g de tomate picado", "200ml / 7fl oz de caldo de verduras", "200ml / 7fl oz de vino tinto", "1 cucharada de salsa Worcestershire", "1 cucharada de salsa de soja", "1 cucharadita de hojuelas de chile (opcional)", "1 cucharadita de azúcar en polvo (opcional)", "sal y pimienta negra recién molida", "2 patatas dulces (aproximadamente 500 g / 1 libra 2 onzas en total), peladas y cortadas en trozos de 2 cm / in", "2 papas harinas (aproximadamente 500 g / 1lb 2oz en total), peladas y cortadas en trozos de 2cm / ¾in", "½ coliflor pequeña, hojas y raíz eliminadas, separadas en florecillas", "botón de mantequilla sin sal", "sal y pimienta negra recién molida", "1 cucharada de parmesano finamente rallado (opcional)"], "method": ["Para el relleno, caliente el aceite en una sartén a fuego medio. Agregue los puerros y freír durante 4-5 minutos, o hasta que comiencen a suavizarse.", "Agregue las zanahorias, los champiñones y el ajo y continúe cocinando, revolviendo regularmente, durante 4-5 minutos.", "Agregue la salvia, el tomillo, las lentejas en lata, los tomates enlatados, el caldo y el vino tinto y revuelva hasta que estén bien combinados. Ponga la mezcla a ebullición, luego reduzca el fuego hasta que esté hirviendo a fuego lento y continúe cocinando a fuego lento durante 18-20 minutos mientras hace el aderezo.", "Precalentar el horno a 200C / 180 Fan / Gas 6.", "Para el relleno, ponga a hervir una olla grande de agua (no es necesario agregar sal). Agregue el camote y la papa y hierva por 10-12 minutos. Agregue la coliflor y hierva por otros 8-10 minutos, o hasta que esté tierna.", "Escurra bien las verduras y devuélvalas a la sartén. Agregue la mantequilla, sazone bien con sal y pimienta negra recién molida, luego mastique hasta que quede suave. Apartar y mantener caliente.", "Mezcle la salsa Worcestershire, la salsa de soja, las hojuelas de chile (si se usa) y el azúcar (si se usa) en la mezcla de relleno, que debe espesarse durante la cocción. Continúe cocinando a fuego lento durante 1-2 minutos más, agregando un poco de agua si la mezcla está demasiado seca (cocine a fuego lento durante más tiempo si la mezcla es demasiado acuosa). Sazonar, al gusto, con sal y pimienta negra recién molida.", "Transfiera la mezcla de relleno a una fuente de horno para hornear, luego cubra la capa superior y extiéndala en una capa uniforme. Si quieres un relleno crujiente, crea picos en el puré con un tenedor. Espolvorea sobre el queso parmesano, si lo estás usando.", "Hornee el pastel de pastor en el horno durante 18-20 minutos, o hasta que el relleno esté dorado y el relleno burbujee."], "url": "www_bbc_co_uk_food_recipes_vegetarian_shepherds_pie_73637", "title": "Pastel de pastor de vegetales", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarian_shepherds_pie_73637_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 cucharadas de aceite vegetal", "Jengibre 2cm / ¾ en pieza, rallado", "1 diente de ajo grande, aplastado", "3 cebollas picadas", "250ml / 8¾fl oz de agua", "4 tomates, picados", "2 cucharaditas de cilantro fresco picado", "1 cucharadita de comino molido", "½ cucharadita de polvo de cúrcuma", "¼ cucharadita de chile en polvo", "½ cucharadita de pimentón", "½ cucharadita de sal masala", "2 hojas de laurel", "4 cardamomos, roto ligeramente abierto", "1½ cucharadita de sal", "1 cucharada de aceite vegetal", "2 cebollas picadas", "Jengibre 2cm / ¾ en pieza, rallado", "3 dientes de ajo, aplastados", "2 tomates, picados", "200g / 7¼ oz de florecillas de coliflor", "250 g / 8¾oz de garbanzos enlatados, escurridos y enjuagados", "2 cucharaditas de sal", "250 g / 8¾oz de hojas de espinaca baby", "2-3 chiles verdes frescos, finamente picados", "1 cucharada de cilantro fresco picado", "1 cucharadita de sal masala", "pan naan"], "method": ["Calentar el aceite en una olla, agregar el jengibre y el ajo y mezclar.", "Agregue las cebollas y saltee durante cinco minutos hasta que estén translúcidas.", "Agregar el agua y llevar a ebullición.", "Agregue el resto de los ingredientes de la salsa, cubra y cocine a fuego lento durante 30 minutos.", "Retire las hojas de laurel y las vainas de cardamomo y licúe el resto en una licuadora.", "Calentar el aceite en un wok grande, agregar las cebollas y freír suavemente hasta que comiencen a dorarse.", "Agregue el jengibre y el ajo, revuelva bien y cocine por un minuto.", "Agregue los tomates, la coliflor, los garbanzos, la sal y suficiente salsa de balti para cubrir todas las verduras (4-6 cucharones de salsa).", "Baja el fuego a fuego lento, tapa y cocina a fuego lento hasta que la coliflor esté tierna.", "Agregue los chiles verdes y las espinacas y saltee por tres minutos más hasta que la espinaca se haya marchitado.", "Revuelva en el cilantro.", "Justo antes de servir, espolvorea el garam masala encima.", "Sirve con pan naan o chapatis."], "url": "www_bbc_co_uk_food_recipes_vegetariancauliflowe_74041", "title": "Coliflor vegetariano, espinaca y balti de garbanzo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["175g / 6oz de lentejas verdes", "2 cucharadas de aceite de girasol", "1 cebolla grande, picada", "1-2 dientes de ajo, aplastados", "1-2 cucharaditas de chile en polvo", "1 cucharadita de semillas de comino", "1 pimiento rojo y 1 pimiento verde, tallo y semillas retirados, y picados", "2 zanahorias, peladas y picadas", "2 x 400 g / 14 onzas de latas de tomates picados", "1 cucharada de puré de tomate tbsp", "300ml / ½ pinta de caldo de verduras", "100g / 4oz de guisantes congelados", "Setas de 175g / 6oz, limpiadas y descuartizadas", "1 calabacín, picado", "sal y pimienta negra recién molida", "1 lata de frijoles, escurrida"], "method": ["Coloque las lentejas verdes en un recipiente grande y vierta agua hirviendo sobre ellas. Déjalo en remojo durante 30 minutos. (Alternativamente, compre una lata de lentejas previamente remojadas.) Escurra.", "Calentar el aceite en una olla grande y freír la cebolla y el ajo junto con el chile y el comino, unos diez minutos o hasta que las cebollas estén suaves.", "Agregue los pimientos, las zanahorias y las lentejas verdes escurridas y cocine durante cinco minutos, revolviendo todo el tiempo. Agregue los tomates, el puré, el caldo y los guisantes, lleve a ebullición y cocine a fuego lento hasta que las lentejas estén blandas (aproximadamente 30 minutos). Agregue los champiñones y los calabacines y cocine a fuego lento durante cinco minutos más. Sazone al gusto.", "Agregue los frijoles cocidos y cocine a fuego lento durante cinco minutos más.", "Sirve con arroz cocido."], "url": "www_bbc_co_uk_food_recipes_vegetarianchilli_6544", "title": "Chile vegetariano", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/vegetarianchilli_6544_16x9.jpg", "isVegetarian": true, "recommendations": 0}]