[{"isVegetarian": false, "title": "Crispy fish fingers", "url": "www_bbc_co_uk_food_recipes_crispy_fish_fingers_34974", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_fish_fingers_34974_16x9.jpg", "ingredients": ["1-2 tbsp vegetable oil", "1 slice day-old bread, grated", "2 tbsp quick-cook dried polenta", "freshly ground black pepper", "3 tbsp plain flour", "pinch paprika", "1 free-range egg", "½ lemon, juice only", "1 white fish fillet, such as cod or plaice, skin and bones removed, cut into 3cm/1in strips"], "serves": "Serves 1-2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/450F/Gas 7. Line a baking tray with baking parchment and brush the parchment all over with a little vegetable oil.", "In a bowl, mix together the breadcrumbs and polenta, and season well with freshly ground black pepper.", "Put the plain flour into another bowl and season with the paprika. Beat the egg in a bowl.", "Squeeze the lemon juice over the strips of fish.", "Roll each strip of fish first in the flour mixture, then dip it into the beaten egg, then coat it in the polenta mixture. Place each fish finger onto the prepared baking tray.", "Drizzle a little more vegetable oil onto each fish finger, then bake in the oven for 10-12 minutes, or until the fish is cooked through and the coating is crisp. Serve with salad or steamed vegetables."]}, {"isVegetarian": false, "title": "Crispy fried pigeon", "url": "www_bbc_co_uk_food_recipes_crispy_fried_pigeon_94157", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 225-350g/8-12oz squab pigeons, cut in half lengthways\t", "4 thin slices fresh ginger (7.5cm/3in long)", "900ml/1½ pints groundnut or vegetable oil ", "lemon wedges, to serve", "1.2 litres/2 pints chicken stock", "5 tbsp dark soy sauce", "3 tbsp light soy sauce", "150ml/5fl oz Shaoxing rice wine or dry sherry", "3 tbsp rock sugar", "1 tsp salt", "6 pieces fresh orange peel, finely chopped or dried citrus peel, soaked and finely chopped", "3 pieces Chinese cinnamon bark or cinnamon sticks ", "3 whole star anise", "1 tsp white pepper", "2 tsp sesame oil", "2 tbsp roasted Sichuan peppercorns, finely ground and sieved ", "3 tbsp salt", "1 tbsp groundnut or vegetable oil", "4 garlic cloves, peeled and crushed", "2 tsp salt", "750g/1lb 10oz Chinese greens, such as Chinese flowering cabbage or bok choi", "2 tbsp chicken stock or water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the pigeon, bring a large pan of water to the boil.  Blanch the pigeons in the boiling water for about two minutes. (This method helps to rid them of impurities and tightens the skin.)  Remove the pigeons from the pot and discard the water.  ", "Combine all the braising sauce ingredients together in a large pot and bring it to the boil.  Add the pigeons and the ginger.  Lower the heat to a simmer and cover the pot tightly.  Let it simmer for about 30 minutes or until the pigeons are just tender.  Remove them with a slotted spoon and let them dry on a plate, or hang them up in a cool, dry, airy place for at least two hours.  (The braising liquid, once cooled, can be stored in a plastic container and frozen for future use.)", "After two hours the skin of the pigeons should feel like parchment paper.  Just before you are ready to serve them, heat the groundnut or vegetable oil in a deep-fat fryer or large wok.  (Caution: Hot oil can be dangerous. Do not leave unattended.) ", "When the oil is hot, lower in the pigeons and deep-fry them until they are crisp and deep brown in colour.  Turn them over frequently with a slotted spoon so that all sides are thoroughly cooked and browned.  This should take about 10 minutes.  Drain the cooked pigeons on kitchen papers and let them cool for a few minutes.", "For the salt and pepper dip, heat a wok or large skillet until it is hot and add the ground peppercorns and salt. Stir-fry for one minute, remove and allow to cool. Then mix in a blender for one minute. ", "For the stir fried Chinese vegetables, heat a wok or large frying-pan over high heat until it is hot. Add the oil, and when it is very hot and slightly smoking, then add the garlic and salt. Stir-fry the mixture for 15 seconds or until the garlic is lightly brown. Then quickly add the Chinese greens.  Stir-fry for 3-4 minutes until the greens have wilted a little. Add the chicken stock or water and continue to stir-fry for a few more minutes until the greens are done but are still slightly crisp.", "To serve, using a heavy cleaver or knife, chop the pigeon into 4-6 pieces and arrange on a warm serving platter.  Serve at once with lemon wedges, the roast salt and pepper dip and the greens."]}, {"isVegetarian": false, "title": "Crispy haggis and potato pancake with a spinach salad and warm whisky and bacon dressing", "url": "www_bbc_co_uk_food_recipes_crispy_haggis_and_potato_74567", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "200g/7oz potatoes, peeled (roughly one potato per person)", "80g/3oz haggis, cut into two slices, at room temperature", "2 free-range eggs", "50g/1¾oz pancetta, finely chopped", "75g/2½oz baby spinach", "3 raw button mushrooms, very thinly sliced", "2 tbsp chopped chives", "2 tbsp chopped parsley", "2 ripe tomatoes, deseeded and finely chopped", "3 tbsp olive oil", "1 tbsp red wine vinegar", "1 tsp grainy mustard", "1 tbsp whisky", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Grate the peeled potatoes into a clean tea towel using the large holes on the grater. Wrap the tea towel around the grated potato and squeeze to remove the moisture. ", "Heat a blini pan (or a frying pan) over a medium heat and add about a tablespoon of the olive oil. When hot, place a heaped tablespoon of the dry grated potato in a mound in the pan and gently press down to form a neat circle. Leave to cook for a couple of minutes. Place a slice of haggis on top of each potato cake, then cover with another heaped tablespoon of grated potato and gently press down. ", "Cook until crispy and golden (4-5 minutes), then very carefully turn and cook on the other side for 3-4 minutes. Blini pans make this job easier, but an alternative method is to cook them in a frying pan and cut out the neat finished rounds after cooking. Place in the oven for 5-6 minutes.", "Fry the eggs as you like them. I like mine cooked in a fair bit of olive oil over a high heat, so they go a bit crispy while keeping the yolk runny.", "To make the salad, in a pan set over a medium heat fry the pancetta until crisp in a little olive oil. Keep warm. Place the spinach, mushrooms, herbs and tomato in a bowl. When ready to serve, stir the warm pancetta through the salad. ", "Combine the olive oil, vinegar, mustard and whisky into a dressing and vigorously shake. Drizzle over the salad, keeping a little back for serving.", "To serve, place the warm dressed salad on serving plates, topped with the haggis and potato pancakes and a fried egg. Grind over a little pepper and drizzle the remaining dressing around. Serve immediately."]}, {"isVegetarian": false, "title": "Crispy hen’s egg, griddled asparagus, asparagus purée, burnt onion", "url": "www_bbc_co_uk_food_recipes_crispy_hens_egg_griddled_95185", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["750g/1lb 10oz onions, peeled", "50g/2oz butter", "2 small onions, roughly chopped", "3 garlic cloves, roughly chopped", "750g/1lb 10oz asparagus, chopped", "1 litre/1¾ pints white chicken stock, hot", "200ml/7fl oz beurre noisette ", "200ml/7fl oz boiled double cream", "150g/5½oz baby spinach, washed", "750g/1lb 10oz asparagus, chopped ", "150ml/5fl oz beurre noisette", "125ml/4fl oz boiled double cream", "115g/4oz washed baby spinach", "2 tbsp white wine vinegar", "4 free-range eggs", "4 large potatoes, made into spaghetti using a spiralizer", "8 large asparagus spears, trimmed", "2 tbsp olive oil", "salt, to season"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the burnt onion powder, preheat the oven to 65C/150F/Gas: lowest possible setting.", "Heat a dry frying pan until hot.", "Cut the onions in half and place cut side down onto the frying pan and leave until very charred. Turn the onions over and repeat on the other side. Transfer the onions onto a baking tray and bake in the oven on a very low heat for 12 hours.", "When completely dry, blend the onions in a food processor to a fine powder. Sieve the onion powder and set aside until needed. ", "For the asparagus velouté, heat a frying pan until medium hot. Add the butter, onions and garlic and fry gently for 4-5 minutes until just soft.", "Add the chopped asparagus, stir well, then pour the hot chicken stock over. Bring the mixture up to the boil and simmer for six minutes.", "Add the beurre noisette and cream to the asparagus pan and mix well.", "Pour the asparagus mixture into a blender, add the baby spinach and blend to a fine purée.", "Strain the asparagus purée through a fine sieve into a bowl over iced water, to chill and keep the colour. Set aside until needed.", "For the asparagus purée, bring a pan of salted water to the boil, add the asparagus and cook for a few minutes until soft. Drain the asparagus, then plunge immediately into cold water to refresh. Drain again, and pat the asparagus dry. ", "Blend the cooked asparagus with the remaining ingredients to a fine purée. ", "Strain the purée through a fine sieve into a bowl over iced water, to chill and keep the colour. Set aside until needed.", "For the crispy hen’s eggs, heat a deep fat fryer to 190C/375F. Alternatively heat vegetable oil in a deep sided, heavy-based pan, until a breadcrumb sizzles and turns golden brown when dropped in. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Bring a deep pan of water to the boil, add the vinegar then the eggs and cook for 2½ minutes. Drain the eggs and place immediately into cold water to refresh and stop the cooking process. Peel the shells from the eggs and trim them so they are nice and round.", "Pat the peeled eggs dry then wrap them in potato spaghetti. Gently lower the potato wrapped eggs into the hot oil and cook until crisp.", "Remove the eggs from the oil with a slotted spoon and drain on kitchen paper. Season with salt and freshly ground black pepper.", "For the griddled asparagus, bring a large pan of salted water to the boil, add the asparagus and boil for two minutes 20 seconds, then drain and plunge immediately into cold water to refresh. Drain the asparagus again and pat dry. ", "Heat a griddle pan until medium hot. Drizzle the asparagus with olive oil, sprinkle with salt and griddle them on a medium heat until charred on each side.", "To serve, sprinkle the onion powder onto the griddled asparagus. Spoon three stripes of asparagus purée across each serving plate, and place two griddled asparagus covered in the onion powder across the purée. Place the deep-fried egg on top of the asparagus. Pour the velouté into small jugs and serve alongside. "]}, {"isVegetarian": false, "title": "Crispy noodles with prawn and crab (Mee krob)", "url": "www_bbc_co_uk_food_recipes_crispy_noodles_with_80051", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heaped tbsp grated palm sugar", "5 tbsp Thai fish sauce ", "3 tbsp fresh lime juice", "vegetable oil, for deep fat frying", "125g/4½oz vermicelli or thin rice noodles", "5 Thai shallots or 1 banana shallot, thinly sliced", "400g/14oz raw tiger prawns, peeled and deveined (feel free to leave the shell on some of the prawns if preferred) ", "1 small thumb-sized piece fresh root ginger ", "3 garlic cloves, grated or crushed ", "thumb-sized piece galangal, finely grated ", "at least 3 spring onions, cut lengthways and thinly sliced ", "150g/5½oz beansprouts", "3 kaffir lime leaves, finely sliced ", "200g/7oz freshly picked white crab meat", "handful coriander leaves, roughly chopped", "handful picked mint leaves (do not chop or the leaves will go brown)", "handful picked holy basil (normal basil will do if not available)", "1 long red chilli, sliced on the diagonal for garnish", "2 limes, cut into wedges "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, add the palm sugar and fish sauce to a small bowl and mix well to dissolve the sugar. Add the lime juice and set aside.", "For the crispy noodles, heat the oil for deep-fat frying in a deep fryer, wok or large saucepan to 180-190C/250F-375F. When it is ready, a small cube of bread should become crisp and golden-brown and float to the top in a few seconds. Cook the vermicelli - do this in batches. Fry until puffed up and turning a pale golden-brown colour.  Carefully remove using a slotted spoon and drain on a plate lined with kitchen paper.", "Add three tablespoons of vegetable oil to a wok or saucepan. Fry the Thai shallots (or banana shallot) until crisp. Remove from the pan and set aside to drain on kitchen paper.", "Add another tablespoon of vegetable oil to the wok. When hot, add the prawns and stir or toss until slightly opaque.  ", "Add the ginger, garlic, and galangal and fry for a couple of minutes. Stir until the prawns are cooked – no longer than a minute. Transfer into a large bowl with the crisp shallots.", "Add the spring onions, bean sprouts, lime leaves, and crabmeat. Pour in the dressing and the herbs. Mix well, but gently as you do not want to bruise the herbs - use your hands for this.", "Layer the salad up in a large serving bowl, by putting a layer of crisp noodles on the  bottom and a layer of prawn and crab mixture on top, then repeat until you have used up all the ingredients. Garnish with slithers of chilli and lime wedges and serve straight away."]}, {"isVegetarian": false, "title": "Crispy Mongolian lamb lettuce wraps", "url": "www_bbc_co_uk_food_recipes_crispy_mongolian_lamb_05784", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz lamb fillet or cheaper cut like lamb leg steaks (remove any sinew), sliced into small 5mm X 2cm/1in strips ", "2 tbsp potato flour", "2 tbsp tapioca granules, ground", "groundnut oil, for deep-frying", "1 tbsp freshly grated ginger", "1 tbsp Shaoxing rice wine or dry sherry   ", "½ tsp ground dry-toasted Sichuan peppercorns", "½ tsp sea salt", "1 tsp low-sodium light soy sauce ", "1 tsp yellow bean paste ", "1 tsp hoisin sauce ", "1 pinch Chinese five spice powder ", "½ orange, juice only", "1 tsp runny honey ", "1 tbsp low-sodium light soy sauce", "1 tbsp groundnut oil ", "2 garlic cloves, peeled and finely chopped ", "2 medium courgettes, top and tailed, sliced to 5mm/¼in cube pieces ", "2 red Romano peppers, deseeded and chopped to 5mm/¼in cube pieces ", "1 small handful roasted salted cashew nuts ", "1 iceberg lettuce, halved, separated, washed and refrigerated", "3-4 kumquats, finely sliced (two pieces in each wrap) ", "fresh purple/yellow edible flowers, optional", "few coriander leaves "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Place the lamb pieces into a non-metallic bowl. Add the marinade ingredients. Mix well, cover and leave to marinate in the fridge for at least 20 minutes. ", "Remove the lamb from the marinade, dust with potato flour and then the ground tapioca granules. ", "Heat a saucepan or wok over a medium heat, half fill with groundnut oil and heat to 180C/350F or until a piece of bread turns golden brown in 15 seconds (Caution: Hot oil can be dangerous. Do not leave unattended). Place the lamb strips onto a metal slotted spoon and gently lower into the oil and cook for 30 seconds or until the lamb turns golden-brown and crisp. Remove, drain on kitchen paper and set aside. ", "For the stir-fry, mix together the orange juice, runny honey and light soy sauce. ", "Heat a wok over high heat, add the groundnut oil and garlic and fry for a few seconds to release the aroma. Add the courgettes and peppers and cook stirring constantly for a few seconds. Then add the cashew nuts, and the orange soy honey mixture. Give it one final stir take it off the heat.", "To serve, remove the lettuce cups from the fridge, place onto a serving plate. Spoon the stir-fried vegetables into each parcel (holding back any liquid), top with the crispy Mongolian lamb pieces and dress with kumquat slices, edible flowers if using and coriander leaves. "]}, {"isVegetarian": false, "title": "Crispy pigs’ cheeks and deep-fried shallots with taramasalata and flatbread", "url": "www_bbc_co_uk_food_recipes_crispy_pigs_cheeks_and_62979", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp rapeseed oil", "2 celery sticks, finely chopped", "1 carrot, finely chopped", "½ onion, finely chopped", "6 star anise ", "1 tbsp white peppercorns", "4 pigs’ cheeks", "500ml/18fl oz chicken stock", "4 banana shallots, sliced into rings", "250ml/9fl oz milk", "vegetable oil for deep-frying", "plain white flour for dusting", "3 tbsp olive oil, plus extra for drizzling", "1 green chilli, chopped with seeds", "salt and freshly ground black pepper, to taste", "4 medium slices of white bread, crusts removed", "200ml/7fl oz milk", "200g/7oz smoked cod’s roe, skinned", "3 garlic cloves, crushed", "200ml/7fl oz mild olive oil or vegetable oil", "½ lemon, juice only", "250g/9oz strong white flour, plus extra for kneading and rolling", "½ tsp salt", "4 tbsp olive oil", "100ml/3½fl oz warm water"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the rapeseed oil in a saucepan over a medium heat. Add the celery, carrot, onion, star anise and white peppercorns, cover the pan and leave the vegetables to fry gently and loose water for at least five minutes until softened. ", "Add the pigs cheeks’ and chicken stock. Increase the heat to high and bring to boil, skimming off any fat that rises to the surface. Turn the heat down to low, cover the pan and braise the cheeks for about 2½ hours until tender. Remove the cheeks from the stock and leave them to cool.", "Meanwhile, make the taramasalata. Put the bread in a food processor and pulse to form breadcrumbs. Tip these into a bowl and cover with the milk. Put the cod’s roe and garlic into the processor and blend until smooth. Add the soaked bread and milk and blend again. With the motor running, slowly add the olive oil. Add the lemon juice and season. Transfer the taramasalata to a serving bowl, cover and chill until needed.", "To make the flat breads, mix the flour and salt together in a bowl and make a well in the centre. Add the olive oil, and then slowly add the warm water, bringing the paste together to form dough. Knead into a tight ball and leave to rest, covered with cling film, for 30 minutes.", "Meanwhile, put the shallots into a bowl, cover with the milk and leave to soak for 10 minutes. When ready to deep-fry the shallot rings, heat enough oil for deep frying in a deep-fat fryer or heavy-based frying pan to 180C/350F (Caution: hot oil can be dangerous. Do not leave unattended). ", "Drain the shallots, and then dust them in flour, shaking off the excess. Deep-fry the shallot rings for 3-5 minutes until crisp and golden-brown. Drain on kitchen paper and season with salt and pepper while still hot. Leave these to one side until you are ready to serve. They don’t need to be kept warm – they are added to the dish for the texture. Just make sure you don’t cover them because that will cause them to soften.", "For the flatbreads, after the dough has rested, lightly flour the work surface and divide the dough into four equal portions. Roll each portion into an oval shape about ½cm/¼in thick. Heat a large non-stick frying pan over a medium heat. Add as many flat breads as will fit and dry-fry for 2-3 minutes on each side until lightly toasted and crisp. Keep warm until you are ready to serve.", "Just before you’re ready to serve, heat the three tablespoons of olive oil in the pan over a high heat and throw in the braised pigs’ cheeks. Use two forks to shred the meat and cook, stirring, for 8-10 minutes until crisp. Season with salt and pepper and sprinkle with the chopped green chilli.", "Spread the flat breads with taramasalata, then add the crispy pigs’ cheeks and then the shallot rings. Drizzle with a little more olive oil and serve."]}, {"isVegetarian": false, "title": "Crispy pollack with pickled carrots and sweet vinegar dressing", "url": "www_bbc_co_uk_food_recipes_crispy_pollack_pickled_03950", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1lb 5oz pollack fillet, skinned and pin boned, cut into 4cm/1½in square pieces", "salt", "3 tbsp chopped coriander", "1 green chilli, seeds removed, finely chopped", "1 lime, zest only", "1 tsp smoked paprika", "100ml/3½fl oz white wine", "100ml/3½fl oz white wine vinegar", "100g/3½oz sugar", "3 carrots, cut into matchstick-sized pieces", "1 banana shallot, sliced", "2 garlic cloves, sliced in half and germ removed ", "75g/2½oz plain flour, plus extra for dusting the fish", "75g/2½oz cornflour ", "200ml/7fl oz ice cold soda water", "sunflower oil, for deep frying", "2 spring onions, finely sliced", "120ml/4fl oz cold press rapeseed oil"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Season the fish pieces with salt, two tablespoons of the chopped coriander, half the chilli, the lime zest and smoked paprika in a bowl. Set aside for at least 30 minutes and preferably a few hours. ", "Put the wine, vinegar, sugar and 100ml/3½fl oz of water in a pan and heat to a simmer. ", "Place the carrots, shallot, garlic and green chilli into a bowl and pour the simmering pickling juice over. Submerge the carrots using a piece of cling film to hold them in place. Leave to cool. ", "To make the batter, mix together the flour and cornflour with a pinch of salt in a bowl. Add the soda water and keep the batter chilled, ideally on ice, until needed. ", "Preheat a deep fat fryer to 180C/350F, or half-fill a heavy-bottomed pan with sunflower oil. (Caution: hot oil can be dangerous. Do not leave unattended.) Dust the fish with flour and pat off any excess. ", "Dip the pieces of fish into the batter and carefully drop them into the fryer one by one. Cook for two minutes and then transfer to a on a plate lined with kitchen paper. Season the crispy batter with a touch more salt. ", "Drain the carrots and discard the garlic. Mix the remaining tablespoon of chopped coriander and the spring onions with the carrot mixture, season with salt and dress with the rapeseed oil. Serve the fried fish on a platter with the pickled carrot salad."]}, {"isVegetarian": false, "title": "Crispy pork covered squid with fennel salad and mustard mayonnaise", "url": "www_bbc_co_uk_food_recipes_crispy_pork_covered_43500", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 large free-range egg yolks", "1 tsp Dijon mustard", "2 tsp white wine vinegar", "400ml/14fl oz sunflower oil", "ground ginger, to taste", "sea salt", "1 fennel bulb, quartered, cored and thinly sliced, fronds reserved", "100ml/3½fl oz rapeseed oil", "20ml/¾fl oz chardonnay vinegar", "1 tsp wholegrain mustard", "½ lime, juice only", "salt and freshly ground black pepper", "vegetable oil, for deep-frying", "½ tsp ground ginger", "½ tsp paprika", "½ tsp garam masala", "100g/3½oz plain flour", "2 large free-range eggs, beaten", "120g/4½oz crushed pork crackling", "2 squid tubes, cleaned and cut into rings", "sea salt", "1 lime, cut into wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the mustard mayonnaise, place the egg yolks in a bowl and whisk in the mustard and vinegar. Slowly drizzle the oil into the bowl, whisking constantly, until you have a mayonnaise consistency. Season with ginger and salt and place in the fridge until ready to serve. ", "To make the fennel salad, place the fennel in a bowl of iced water to crisp up, then remove and drain on kitchen paper. ", "Mix the oil, vinegar and mustard together in a bowl with a squeeze of lime juice and season with salt and pepper. Dress the fennel, add the fennel fronds and set aside. ", "To make the squid, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Mix the ginger, paprika and garam masala together in a bowl. Put the flour in a separate bowl, the eggs in another bowl and the pork crackling in another bowl.", "Roll the squid rings in the spices, coat in the flour, then the egg, and finally the pork crackling. Set aside on a large plate until ready to fry.", "Deep-fry the squid for 1–2 mins until golden brown and crispy. Drain on kitchen paper and season with salt.", "Serve the squid hot with the mustard mayonnaise and fennel salad, garnished with lime wedges."]}, {"isVegetarian": true, "title": "Crispy potato peeling crisps with squash ketchup", "url": "www_bbc_co_uk_food_recipes_crispy_potato_peelings_07088", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_potato_peelings_07088_16x9.jpg", "ingredients": ["250g/9oz squash, peeled and deseeded", "½ tsp coriander seeds", "½ tsp cumin seeds", "125ml/4fl oz cup cider vinegar, plus extra to taste", "110g/4oz caster sugar", "salt and freshly ground black pepper", "potato peelings, to taste", "sunflower oil for frying", "pinch chilli powder or smoked paprika"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the ketchup, add all the ingredients to the smallest pan possible, add water to cover and bring to a simmer.", "Once the squash is tender, drain off two inches of liquid and blend smooth with a stick blender or a food processor.  ", "Return to the heat if necessary, and cook down slowly to reduce to a ketchup consistency. ", "Check the seasoning and add salt, pepper and vinegar as required.", "Put the ketchup in a clean, plastic tub or sterile glass jar and keep in the fridge for up to two weeks.", "For the peelings, wash and drain the peelings well and then dry the peelings by removing excess water with a tea towel.", "Add an inch or so of oil to a deep saucepan and heat to about 160C/325F, or until a small piece of peeling sizzles when added to the oil. (Caution: Do not leave hot oil unattended).", "Fry the potato peelings in small batches until crisp, golden-brown and crunchy. ", "Drain well on kitchen paper and season with salt and pepper. ", "Serve the potato peelings with the squash ketchup for dipping and a little sprinkling of chilli powder or smoked paprika."]}, {"isVegetarian": false, "title": "Crispy salmon, polenta chips and grilled asparagus", "url": "www_bbc_co_uk_food_recipes_crispy_salmon_polenta_67895", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_salmon_polenta_67895_16x9.jpg", "ingredients": ["900ml/1½ pints vegetable or chicken stock", "200g/7oz instant polenta", "1 stick rosemary, leaves finely chopped (about 1 tbsp chopped rosemary)", "flaked sea salt and freshly ground black pepper", "20 large sage leaves", "20 slices pancetta", "2 tbsp olive oil", "4 garlic cloves (can use more or less depending on your taste), roughly chopped", "handful fresh parsley, roughly chopped", "1 lemon, finely grated zest only", "50ml/1¾fl oz olive oil", "2 tbsp olive oil", "4 salmon steaks, with the skin scored ", "250g/9oz asparagus, woody root ends snapped off", "50g/1¾oz unsalted butter", "small handful fresh parsley leaves, finely chopped", "1 lemon, juice only", "1 lemon cut in to wedges, to serve"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Line a 20cm/8in square tin with baking parchment or heatproof cling film. Bring the stock to the boil in a large saucepan. Reduce the heat to a fast simmer and, using a whisk or silicone spatula, gradually stir in the polenta. Add the rosemary and season with salt and pepper. ", "Cook for 4-5 minutes, stirring constantly until large volcanic-like bubbles form. The polenta will swell and become really thick - don’t leave for a minute or it could become lumpy. Pour the mixture into the prepared tin and smooth the surface with the back of a spoon. Set aside to cool for 20 minutes.", "Meanwhile, make the gremolata. Place the garlic, parsley and lemon zest in a pestle and mortar and pound the mixture to a mash so that all the flavours mix together. Stir in the oil. Alternatively, blend everything together in a mini-blender until as fine as possible. Either way, spoon into a small serving bowl and set aside.", "Line a large baking tray with baking parchment. Once the polenta is firm, pull it up out of the tin, place on a chopping board and carefully remove the paper or cling film. Cut the slab into 10x2cm/4x¾in wide strips and then cut them in half across to give 20 chunky chips. Being careful not to break the chips, wrap a sage leaf around the middle of each one, followed by a slice of pancetta. Arrange on the tray as you go. These can be prepared to this stage a day ahead of time, in which case, cover with cling film and keep in the fridge.", "Preheat the oven to 110C/225F/Gas ¼ (fan 80C). Heat two large frying pans on a medium to high heat and drizzle a tablespoon of oil into each one. Fry 10 polenta chips in each pan for about 1-2 minutes on each side. Use a small fish slice to carefully turn them over to avoid breaking them. Arrange them back on the baking tray once cooked and pop them in the oven to keep warm.", "For the fish and asparagus, wipe out the frying pans with kitchen paper and return both to a medium to high heat with a tablespoon of oil in each one. Season the salmon with salt and pepper and, once the oil is hot, place the fish skin-side down in one pan and leave to cook for about 3-4 minutes. ", "Meanwhile, for the asparagus, fry the asparagus in the other pan for 3-4 minutes tossing occasionally.", "If you want to make the sauce, simply melt the butter in a small saucepan and add the finely chopped parsley, lemon juice and season to taste. Keep warm.", "Once the fish has had its time, flip it over and let it cook for four minutes on the other side.  ", "Meanwhile, remove the polenta chips from the oven and arrange five on each serving plate. Divide the asparagus up evenly between them also. Once the salmon is cooked to your liking (either a little pink in the centre or cooked completely through) remove from the heat and arrange one on each serving plate. If you made the optional sauce, pour this over now. ", "Serve at once with the gremolata and lemon wedges."]}, {"isVegetarian": false, "title": "Crispy breadcrumbed squid with creamy ponzu dressing", "url": "www_bbc_co_uk_food_recipes_crispybreadcrumbedsq_93514", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 free-range egg yolks", "½ tsp sea salt", "pinch white pepper", "2 tsp rice wine vinegar", "4 tsp ready-made chilli-garlic sauce", "2 tsp yuzu juice (available from some supermarkets and Asian grocers, or specialist online retailers), or to taste ", "200ml/7fl oz vegetable oil", "vegetable oil, for deep frying", "75g/3oz plain flour", "salt and freshly ground black pepper", "4 medium squid, cleaned, quills and beaks removed, sliced into 0.5cm/½in rings", "2 free-range eggs ", "75g/3oz Japanese panko breadcrumbs"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the creamy ponzu dressing, blend all of the dressing ingredients, except the vegetable oil, to a smooth purée in a food processor.", "With the motor still running, gradually pour in the vegetable oil in a thin stream, until the mixture has thickened and resembles mayonnaise. Season, to taste, with more yuzu juice, as required. Chill until needed.", "For the squid, heat the oil in a deep fat fryer to 190C/374F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. ", "Dredge the squid rings in the seasoned flour until completely coated, shaking off any excess.", "Beat the eggs in a bowl, then sprinkle the Japanese panko breadcrumbs onto a separate plate.", "Dip each floured squid ring first in the beaten egg, then dredge it in the panko breadcrumbs until completely coated.", "Carefully lower the coated squid rings, in batches, into the hot oil. Fry for 2-3 minutes, or until crisp and golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining coated squid rings.", "To serve, divide the crispy breadcrumbed squid equally among four serving plates. Drizzle over the creamy ponzu dressing. Serve immediately."]}, {"isVegetarian": true, "title": "Crispy stuffed mushrooms", "url": "www_bbc_co_uk_food_recipes_crispy_stuffed_mushrooms_30058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large, flat mushrooms (such as Portabello or field mushrooms), stalks removed", "100g/3½oz Chinese mushrooms, chopped (the stems from the large mushrooms can be used here too)", "1 garlic clove, crushed", "1 tbsp melted butter              ", "1 large free-range egg, yolk only", "2 tbsp white breadcrumbs             ", "2 tsp chopped chives           ", "2 tsp chopped parsley", "1 tsp chopped thyme", "salt and freshly ground black pepper", "pinch freshly ground nutmeg", "200ml/7fl oz whole milk", "few slices of carrot, to taste", "few slices of onion, to taste", "2 peppercorns", "sprig thyme", "sprig parsley", "15g/½oz plain flour", "15g/½oz butter", "1/8 teaspoon mustard (preferably Dijon)", "15g/½oz cheddar cheese, grated  ", "15g/½oz parmesan cheese (or a vegetarian alternative), grated", "salt and freshly ground black pepper", "25g/1oz butter", "50g/1¾oz soft white breadcrumbs", "40g/1½oz grated cheddar cheese, or 25g/1oz grated parmesan cheese"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Arrange the flat mushrooms in a single layer in an ovenproof serving dish. Season with salt and freshly ground black pepper.", "To make the filling, preheat the oven to 200C/400F/Gas 6.", "Chop the stalks from the large flat mushrooms and chop all the Chinese mushrooms. Add to a bowl with the garlic, melted butter, egg yolk, breadcrumbs and the herbs. Season with salt, freshly ground black pepper and a pinch of nutmeg. Divide the filling between the flat mushrooms.", "For the cheese sauce, pour the milk into a saucepan with the carrot, onion, peppercorns, thyme and parsley. Place over a medium heat and bring to the boil. Simmer for 4-5 minutes, then remove from the heat, cover and leave to infuse for 10 minutes.", "As the sauce infuses, make a roux. Add the flour and butter to a clean saucepan and place over a medium heat. Stir frequently, for approximately two minutes until the roux is thick and well combined, then set aside to cool.", "Strain the milk to remove the vegetables and herbs. In a pan, bring the milk to the boil then whisk in the roux. Whisk constantly until you have a sauce just thick enough to coat the back of a spoon. Stir in the mustard and the grated cheese. Season to taste with salt and freshly ground black pepper. ", "Put the butter in a pan over a medium heat and melt. When just until melted, remove from the heat and stir in the breadcrumbs. Set aside to cool.", "Spread a little of the sauce over each mushroom and top with the breadcrumbs and the grated cheese.", "Bake in the oven for 15 minutes, or until lightly browned on top. If you would like them even crisper, place under a hot grill for a minute or two to finish. Serve immediately."]}, {"isVegetarian": false, "title": "Crispy chicken salad", "url": "www_bbc_co_uk_food_recipes_crispychickensalad_75685", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 chicken thigh, bones removed, with skin on", "1 tsp olive oil", "1 tsp balsamic vinegar", "salt and freshly ground black pepper", "handful flatleaf parsley", "handful fresh basil", "handful fresh coriander", "handful fresh mint", "½ pepper, finely sliced", "1 ¼ onion, finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan and fry the chicken thigh skin side down for 6-8 minutes on each side. Turn and cook for the same length of time. When crisp, golden and cooked through cut into thin slices.", "For the dressing, mix together the olive oil, balsamic vinegar, salt and pepper. ", "Add the herbs, pepper and onion to the dressing. ", "Mix through the chicken at the last minute and serve."]}, {"isVegetarian": false, "title": "Crisp fried chicken with barbecue sauce", "url": "www_bbc_co_uk_food_recipes_crispychickenwithbar_86974", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices white bread", "2 garlic cloves, chopped", "1 lemon, zest only", "small handful each fresh chives, flatleaf parsley, basil and tarragon", "240g/8½oz chicken mini-fillets", "5 tbsp plain flour", "1 free-range egg, beaten", "1 tbsp olive oil", "sprig flatleaf parsley, to garnish", "½ tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, crushed", "½ tsp Worcestershire sauce", "1 tsp clear honey", "3 tbsp tomato ketchup", "1 lemon, cut into wedges, to garnish", "sprig flatleaf parsley, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["For the crisp fried chicken, iplace the bread, garlic cloves, lemon zest and herbs in a small food processor and pulse until combined. Transfer the herb mixture to a plate.", "Dust the chicken fillets in plain flour, dip in the egg and roll in the herb breadcrumbs to coat well.", "Heat the olive oil in a small non-stick frying pan and fry the chicken pieces for 4-6 minutes on each side, or until cooked through.", "For the sauce, heat the olive oil in a small saucepan and add the onion. Fry until the onion is soft but not coloured.", "Add the garlic to the pan and cook for one minute.", "Add the remaining ingredients and simmer for a further two minutes. ", "To serve, pour the sauce into a small dipping bowl. Place the chicken onto a serving plate and garnish with lemon wedges and parsley."]}, {"isVegetarian": false, "title": "Crispy deep-fried sole with spicy mango salsa", "url": "www_bbc_co_uk_food_recipes_crispydeepfriedsolew_84481", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150ml/¼ pint vegetable oil", "1 free-range egg white", "45g/1½oz self-raising flour", "100g/3½oz sole, sliced into 3 pieces", "½ mango, peeled and cut into small cubes", "½ chilli, seeds removed,finely chopped", "¼ onion, finely diced", "½ lime, juice only", "fresh chives, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in deep heavy-bottomed saucepan until very hot or until a breadcrumb sizzles in it (CAUTION: Hot oil is very dangerous. Do not leave unattended).", "Place the egg white and flour into a bowl an whisk together to form a smooth batter.  Add a little water if required.", "Dip the slices of fish in the batter and carefully lower into the hot oil.  Deep-fry for three minutes, or until golden and cooked through.", "For the salsa, place all the salsa ingredients into a bowl and mix together.", "To serve, place the salsa into the centre of a serving plate.  Place the fish on top of the salsa and garnish with the fresh chives."]}, {"isVegetarian": false, "title": "Crispy duck with apricot and plum sauce", "url": "www_bbc_co_uk_food_recipes_crispyduck_89265", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispyduck_89265_16x9.jpg", "ingredients": ["4 tbsp grated fresh root ginger", "2 tbsp Shaoxing rice wine or dry sherry ", "2 tbsp ground Sichuan peppercorns", "pinch of salt, to taste (optional) ", "6 whole star anise", "1 tbsp dark soy sauce", "1 tbsp light soy sauce ", "2 duck breasts, skin scored in a criss-cross pattern", "1 tbsp groundnut oil", "salad leaves, to serve", "100ml/3½fl oz water", "2 plums, stones removed, quartered ", "50g/2oz dried apricots, chopped ", "2½ tsp caster sugar", "1 tbsp honey", "1 cinnamon stick ", "1 whole star anise ", "1 lime, juice only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the marinade, place all of the marinade ingredients into a bowl and whisk well to combine. ", "For the duck, place the duck into the bowl with the marinade, cover with cling film and leave to marinate in the fridge for 20-25 minutes.", "Preheat the oven to 200C/400F/Gas 6. ", "Heat a wok until smoking and add the groundnut oil, then add the duck skin-side down and fry for 4-5 minutes, or until the skin is browned and crisp. Transfer the duck onto a baking tray, skin side up, and cook in the oven for 3-4 minutes, or until cooked to your liking. ", "For the apricot and plum sauce, place the water into a small saucepan and bring to the boil. Add the plums, apricots, sugar, honey, cinnamon stick and star anise and cook over a medium heat until reduced to a sticky sauce. Take off the heat, strain through a sieve and stir in the lime juice. Discard the spices left behind in the sieve.", "To serve, place a duck breast onto each serving plate, pour the sauce over the duck and serve with the salad."]}, {"isVegetarian": false, "title": "Crispy duck and cashew noodle stir-fry", "url": "www_bbc_co_uk_food_recipes_crispyduckandcashewn_87404", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["dash olive oil", "100g/3½oz duck breast, cut into strips", "¼ onion, sliced", "½ fresh red chilli, finely sliced", "2 tbsp chopped cashews", "1 orange, zest and juice only", "1 lemon, zest and juice only", "1 lime, zest and juice only", "splash soy sauce", "150g/5½oz fresh egg noodles", "2 tbsp edamame beans"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a wok, add the duck strips and fry over a high heat for 5-6 minutes.", "Add the onion and cook for 2-3 minutes. Add the rest of the ingredients, stir well and cook for a further 2-3 minutes. ", "To serve, pile the noodles onto a serving plate."]}, {"isVegetarian": false, "title": "Crispy fragrant duck with pickled radish salad", "url": "www_bbc_co_uk_food_recipes_crispyfragrantduckwi_89266", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ tsp ground cinnamon", "½ tsp ground ginger", "½ tsp ground allspice", "2 tbsp Shaoxing rice wine or dry sherry", "2 tbsp honey", "1 tbsp chilli sauce", "1 tbsp light soy sauce", "2 cloves garlic, finely chopped", "2 duck legs, skin on ", "75g/3oz potato flour or plain flour", "groundnut oil, for deep-frying ", "100g/3½oz red radish, finely chopped", "½ cucumber, halved lengthways, de-seeded and finely chopped", "1 red chilli, de-seeded and finely chopped (optional)", "1 tbsp clear rice vinegar or cider vinegar", "½ tsp salt", "1 tsp caster sugar ", "½ tsp Shaoxing rice wine or dry sherry", "1 small handful fresh coriander leaves, finely chopped", "pinch salt", "pinch dried chilli flakes"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the marinade, place all of the marinade ingredients into a small bowl and whisk well to combine. ", "For the duck, place the duck legs into a bowl and pour over the marinade. Cover with cling film and place into the fridge to marinate for at least 24 hours. ", "For the pickled radish salad, place all of the salad ingredients into a bowl and mix well to combine. Cover with cling film and set aside in the fridge for one hour.", "Preheat the oven to 180C/350F/Gas 4. ", "For the duck, remove the duck legs from the marinade and place, skin-side up, into a roasting tin. Place into the oven to roast for ten minutes, or until the skin is golden-brown and crisp.", "Increase the oven temperature to 220C/425F/Gas 7.", "Roast the duck legs for five more minutes, or until the duck is cooked to your liking. Remove from the oven and allow to rest for 2-3 minutes.", "When just cool enough to handle, cut the duck into bite-sized slices and lightly dust in the potato flour, shaking off any excess.", "Half-fill a wok or deep heavy-based pan with the groundnut oil and heat to 180C/350F, or until a cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the duck slices into the oil and fry, in small batches, until crisp and golden-brown. Remove from the pan with a slotted spoon and drain on kitchen paper.", "To serve, spoon some pickled radish salad onto each of two serving plates and arrange the crispy duck slices on top. Sprinkle over a pinch of salt and some dried chilli flakes over the duck pieces and serve immediately."]}, {"isVegetarian": false, "title": "Crispy duck pancakes with chilli-plum sauce", "url": "www_bbc_co_uk_food_recipes_crispyduckpancakeswi_93114", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 2kg/2lb 4oz duck, back bone removed, flattened", "1 tbsp olive oil", "3 spring onions, sliced", "2 red chillies, finely chopped", "1 cinnamon stick", "½ tsp Sichuan peppercorns", "500g/1lb 2oz plums, stones removed, roughly chopped", "125ml/5fl oz rice wine vinegar", "75g/3oz caster sugar", "salt and freshly ground black pepper", "225g/8oz strong white flour", "175ml/6fl oz boiling water", "4 spring onions, finely shredded", "2 red chillies, seeded, finely shredded"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 210C/410F/Gas 7.", "For the crispy duck, place the duck, skin side up, onto a rack over a roasting tray and pierce the skin all over with a knife.", "Boil a kettle and pour the boiling water over the duck skin, discarding the water. Pat the duck dry, using kitchen paper, then rub salt and freshly ground black pepper, to taste, over the skin. ", "Transfer to the oven to roast for 1-1¼ hours, or until crisp and golden-brown. Remove from the oven and set aside to rest for 10 minutes. Shred the duck into fine pieces using two forks.", "For the chilli plum sauce, heat the olive oil in lidded pan and fry the spring onions and chillies for 1-2 minutes, or until softened. Add the spices and continue to cook for another 1-2 minutes. ", "Add the plums, vinegar and sugar and bring the mixture to the boil. Reduce the heat until the mixture is simmering, cover with a lid and simmer for 5-6 minutes, or until the plums are tender. Set the plums aside to cool", "Remove the cinnamon stick and blend the mixture to a purée in a food processor. Strain the purée through a sieve into a bowl. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the pancakes, place the flour into a bowl and make a well in the centre. Pour in the boiling water and stir to form a dough. Tip the dough out onto a floured work surface and knead for 2-3 minutes, or until the dough is smooth.", "Cut the dough into 16 pieces and roll each piece into a thin pancake.", "Heat a frying pan until hot and fry each pancake for 1-2 minutes on each side, or until pale golden-brown. Keep the pancakes warm until ready to serve.", "To serve, place the shredded duck onto a large serving plate and place spring onion and chillies alongside. Place the pancakes onto a separate serving plate and serve the plum sauce alongside."]}, {"isVegetarian": false, "title": "Crispy duck pancakes", "url": "www_bbc_co_uk_food_recipes_crispyduckpancakes_85915", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500ml/18fl oz vegetable oil, for deep frying", "1 cooked Chinese-style duck breast", "1 tbsp soy sauce", "1 tbsp sesame oil", "3 tbsp honey", "salt and freshly ground black pepper ", "6 ready-made Chinese-style pancakes, heated according to packet instructions", "¼ cucumber, thinly sliced", "¼ red pepper, finely chopped", "¼ onion, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the duck, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the duck breast into the hot oil and deep fry for 3-4 minutes, or until crisp. Remove from the oil with a slotted spoon and drain on kitchen paper, then shred the duck into fine pieces using two forks.", "For the sauce, place all of the sauce ingredients into a bowl and mix well.", "To make the pancakes, spread equal amounts of the sauce onto each pancake, then sprinkle over equal amounts of the duck. Top with the cucumber, red pepper and onion and roll up.", "To serve, place the pancakes onto serving plates."]}, {"isVegetarian": false, "title": "Crisp fried sea bass fillet with pineapple salsa", "url": "www_bbc_co_uk_food_recipes_crispyfriedseabassfi_85747", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fillet sea bass, skinned", "100g/3½oz cornflour", "1 tsp salt, plus extra for sprinkling", "5 tbsp sparkling water", "300ml/½ pint vegetable oil, for deep frying", "¼ pineapple, peeled and chopped", "pinch chilli flakes", "1 lime, zest and juice", "55g/2oz green beans, cooked and chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the crisp fried sea bass, slice the fish in half on the diagonal. Place the cornflour, salt and water into a bowl and whisk together to make a thick batter.", "Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Don't leave unattended.)", "Dip the sea bass into the batter to coat, shaking off any excess, then carefully place into the hot oil. Deep fry until crisp and golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper. Sprinkle with salt.", "For the salsa, place all the salsa ingredients into a bowl and mix well.", "To serve, place the crisp fried sea bass onto a plate with a dollop of salsa."]}, {"isVegetarian": false, "title": "Crispy fried sea bass with roast fennel and watercress sauce", "url": "www_bbc_co_uk_food_recipes_crispyfriedseabasswi_14506", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil ", "1 shallot, finely chopped ", "2 cloves garlic ", "2 fennel bulbs, sliced ", "1 small glass white wine ", "110g/4oz watercress, blanched ", "1 tsp parsley ", "85g/3oz butter ", "4x140g/5oz sea bass fillets, skin on ", "8 baby tomatoes, halved ", "55g/2oz black olives, diced"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Sauté the shallot, garlic and fennel in 1 tbsp of the oil. Add the white wine and simmer for 3-5 minutes. ", "Place the watercress and parsley into a food processor and blend until smooth. ", "Heat the butter with the remaining oil and place the sea bass in the pan skin side down. Season and turn over the fish. Add the tomato halves and cook for 1-2 minutes. ", "To serve: Spoon the fennel on to the plate and top with the fish. Place the tomatoes and olives around and drizzle with the watercress sauce."]}, {"isVegetarian": false, "title": "Crispy herbed salmon", "url": "www_bbc_co_uk_food_recipes_crispyherbedsalmon_243", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g/1¼lb salmon fillet, with skin", "4 lemons", "splash white wine", "2 tbsp thyme leaves", "2 tbsp rosemary leaves", "2 tbsp dill fronds", "300ml/½ pint olive oil", "2 tbsp chopped parsley", "Maldon sea salt and cracked black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut salmon in four and score the skin.  Put in a non-metal dish.", "Zest and juice two lemons. Halve remaining lemons.", "Combine zest and juice with wine, thyme, rosemary, dill, one-third of the oil and half the parsley. Season.", "Preheat oven to 180C/350F/Gas 4.", "Pour marinade over salmon and leave for 30 minutes.", "Remove salmon, drain off marinade and fry, skin side down, for 1 minute.  Turn and seal other side.", "Lay salmon, skin side up, in a roasting tray, sprinkle with salt and roast for about 10 minutes or until just cooked through.", "Put on serving dish, drizzle with remaining oil, sprinkle with remaining parsley and serve with lemon halves."]}, {"isVegetarian": false, "title": "Crispy noodle cake with chicken", "url": "www_bbc_co_uk_food_recipes_crispynoodlecakewith_76490", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "1 chicken breast", "salt and freshly ground black pepper", "55g/2oz egg noodles, cooked", "1 tsp sesame oil", "1-2 tbsp vegetable oil", "55ml/2fl oz white wine vinegar", "pinch chilli flakes", "55g/2oz caster sugar", "3 tbsp soy sauce", "1 garlic clove, peeled and crushed"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.", "Heat the oil in a griddle pan. Season the chicken and chargrill in the hot pan for 5-6 minutes on each side. Transfer to the oven and cook for 10-12 minutes, until cooked through.", "For the noodle cake, mix the noodles and sesame oil in a large bowl. Heat the vegetable oil in a small pan or blini pan and place the noodles in. Cook for 3-4 minutes on each side until crispy and golden.", "To make the dressing, heat the vinegar, chilli flakes, sugar, soy sauce and garlic in a small pan for 4-5 minutes, stirring occasionally.", "To serve, transfer the chicken to a serving plate. Serve the crispy noodle cake alongside and drizzle the dressing over."]}]