[{"isVegetarian": false, "title": "Costillas de cordero a la brasa", "url": "www_bbc_co_uk_food_recipes_bbqlambribs_86385", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Costillas de cordero de 8-10 lb / 3.6-4.5 kg", "1 litro / 1 pinta 15fl oz de cola", "85g de ketchup de tomate", "2 cucharadas de granos de pimienta negra, triturados en un mortero y una maja", "1 cucharada de pimienta de cayena (opcional)", "350ml / 12fl oz de whisky bourbon", "165ml / 6fl oz de jarabe de arce (o 6 cucharadas de azúcar moreno)", "3-4 cucharadas de salsa de soja", "2 hojas de laurel", "4 ramitas de romero grandes", "4-5 dientes de ajo, aplastados o machacados en un mortero"], "serves": "Sirve 10", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el adobo, combine todos los ingredientes en un tazón grande o cuenca y sumerja las costillas en ellos. Cúbralo con film transparente y déjelo toda la noche en la nevera, si es posible, de lo contrario deje macerar durante una hora en la nevera.", "Precalentar el horno a 180C / 350F / Gas 4.", "Hilvane las costillas con el adobo y cúbralas con papel de aluminio. Prepáralos en el horno durante 20-30 minutos. De lo contrario, los ingredientes dulces (cola y jarabe de arce) pueden carbonizarse en la barbacoa.", "Prepara la barbacoa No debería estar demasiado caliente; las brasas deben ser grises y cenicientas, pero aún tienen un buen calor.", "Coloque las costillas en la barbacoa. Déles la vuelta después de unos 40 minutos para darle textura al otro lado. Después de unos 10 minutos, voltee las costillas de nuevo.", "Si te gustan las costillas ligeramente crujientes ponlas debajo de una parrilla precalentada por unos cinco minutos. Tenga cuidado de no quemarlos. Servir."]}, {"isVegetarian": true, "title": "salsa BBQ", "url": "www_bbc_co_uk_food_recipes_bbqsauce_4973", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbqsauce_4973_16x9.jpg", "ingredients": ["1 cebolla pequeña, picada", "3 dientes de ajo, aplastados", "aceite de oliva", "1 chile rojo, finamente picado", "1 cucharadita de semillas de hinojo, trituradas", "55g / 2oz de azúcar moreno oscuro", "50ml / 1¾fl oz de salsa de soja oscura", "300 ml / 10 fl oz de ketchup de tomate", "sal y pimienta"], "serves": "Hace ½pint", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Freír la cebolla y el ajo en aceite de oliva con el chile, las semillas de hinojo y el azúcar.", "Agregue la salsa de soja y el ketchup y sazone con sal y pimienta.", "Llevar a ebullición y cocine a fuego lento durante unos minutos para combinar los sabores. Úselo como salsa o para cubrir costillas, pollo o salchichas."]}, {"isVegetarian": true, "title": "Registro de Navidad (registro de Yule)", "url": "www_bbc_co_uk_food_recipes_bche_de_nol_christmas_96543", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 huevos de gallinas camperas, separados", "60g / 2¼ oz de azúcar en polvo", "60g / 2¼ oz de harina común", "15g / ½oz de mantequilla sin sal, derretida", "70 g / 2 oz de azúcar en polvo", "3 yemas de huevo de gallinas camperas", "30ml / 1¼fl oz de ron oscuro", "240 g / 8¾oz de mantequilla sin sal, suavizada a temperatura ambiente", "200g / 7oz de castañas confitadas, la mitad reservada entera, el resto toscamente picado", "40 g / 1 oz de azúcar en polvo", "Ron oscuro de 25ml / 1fl oz", "2 cucharadas de leche", "90ml / 3fl oz crema batida", "80g / 2¾oz de chocolate puro, mínimo 70% de sólidos de cacao, picados, más chocolate extra rallado, para decorar", "cacao en polvo, para decorar"], "serves": "Sirve 8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para el genoise, precaliente el horno a 180C / 160C Fan / Gas 4.", "Batir las claras de huevo en un bol (o batidora independiente) hasta que se formen picos suaves cuando se quite el batidor. Poco a poco agregue el azúcar mientras bate las claras de huevo, hasta que se formen picos rígidos cuando se quite el batidor.", "Reduzca la velocidad del batidor eléctrico a mediano, luego mezcle las yemas de huevo con la mezcla, una por una.", "Tamizar la mitad de la harina en el recipiente, luego dóblela suavemente en la mezcla de huevo con una espátula. Agregue la harina restante y dóblela cuidadosamente en las claras de huevo también.", "Verter sobre la mantequilla derretida y doblarla suavemente en la mezcla de clara de huevo.", "Cubra una lata de rollo suizo de 30cm / 12in con papel de silicona, pegando cada esquina a la lata con un poco de la mezcla de genoise.", "Vierta el genoise en la lata preparada, empujándolo hacia las esquinas y nivelando la superficie con una espátula.", "Hornee el genoise en el horno durante 10 minutos, o hasta que tenga un color marrón dorado pálido y elástico al tacto. Retirar del horno y reservar para enfriar en la lata.", "Mientras tanto, para la crema de mantequilla, caliente el azúcar y 50 ml / 2 fl oz de agua en una olla pequeña hasta que la temperatura de este jarabe de azúcar alcance los 121 ° C (use un termómetro de azúcar para esto).", "Con una batidora eléctrica o una batidora de pie, bata las yemas de huevo con 30 ml / 1 fl oz de agua durante 5 minutos a máxima velocidad hasta que estén pálidas y esponjosas.", "Reduzca la velocidad de los batidores eléctricos, luego rocíe el jarabe de azúcar en una corriente delgada por el costado del tazón. (Precaución: no vierta el jarabe caliente directamente sobre los batidores). Batir hasta que la mezcla se espese y se vea sedosa, luego continuar batiendo hasta que la mezcla se enfríe por completo.", "Reduzca la velocidad de los batidores a una velocidad lenta, luego mezcle el ron. Agregue la mantequilla ablandada un poco a la vez, batiendo hasta que cada adición se haya incorporado completamente en el sabayon, luego continúe batiendo por otros 3 minutos.", "Doble las castañas picadas y déjelas a un lado hasta que las necesite (relájese en la nevera si las prepara con anticipación).", "Para el líquido de remojo, lleve el azúcar y 40 ml / 1 g / l de agua a ebullición en una cacerola pequeña, luego retire la sartén del fuego y agregue el ron.", "Usando un pincel de pastelería, cepille el líquido de remojo uniformemente sobre la esponja enfriada.", "Coloque la esponja empapada boca abajo sobre una toalla de té limpia, luego retire con cuidado el papel de silicona.", "Extienda un tercio de la crema de mantequilla en una capa uniforme sobre toda la esponja empapada. Coloque las castañas confitadas en una línea donde estará el interior del rollo. Luego, enrolle la esponja lo más apretadamente posible con la toalla de té para levantar la esponja.", "Envuelva el rollo de esponja firmemente en una película adhesiva, luego enfríe en el refrigerador por 15 minutos.", "Desenvuelva el rollo de esponja y transfiéralo a un tablero para pasteles con la costura en su parte inferior. Cuidadosamente recorte cada extremo con un cuchillo afilado.", "Extienda la crema de mantequilla restante por todo el rollo de esponja en una capa uniforme con una espátula (o una manga pastelera, si lo desea). Arrastre un tenedor de forma ligera y desigual a través de la crema de mantequilla para que se vea como corteza de árbol. Refrigere por otros 30 minutos.", "Mientras tanto, para la salsa de chocolate, traiga la leche y la crema hasta que hierva en una cacerola. Retire la sartén del fuego y agregue el chocolate hasta que quede suave y derretido.", "Justo antes de servir, espolvoree el bûche de Noël con un poco de cacao en polvo y adorne con chocolate rallado o rizos de chocolate. Si lo desea, corte el extremo del tronco y colóquelo encima.", "Para servir, corta el bûche de Noël y rocía con un poco de salsa de chocolate."]}, {"isVegetarian": false, "title": "Paella junto a la playa", "url": "www_bbc_co_uk_food_recipes_beachside_paella_41859", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beachside_paella_41859_16x9.jpg", "ingredients": ["1 cucharada de aceite de oliva", "6 muslos de pollo deshuesados ​​y sin piel, cortados por la mitad", "75 g de chorizo ​​(nos gusta picante) desollado y cortado en rodajas de 5 mm / ¼ in", "2 cebollas medianas, peladas y picadas", "1 pimiento rojo, descuartizado, sin semillas y rebanado", "1 pimiento amarillo, descuartizado, sin semillas y rebanado", "Frijoles verdes de 150g / 5½oz, cortados y cortados en 2cm / ¾ de largo", "3 dientes de ajo, pelados y triturados", "2 cucharaditas de pimentón ahumado", "2 buenos pellizcos de hilos de azafrán", "1 hoja de laurel", "175g / 6oz de arroz de paella (arroz de grano medio)", "1 litro de caldo de pollo caliente, hecho con 1 cubo de caldo de pollo", "Mejillones vivos de 500 g / 1 libra, bien lavados y barba", "1 calamar mediano, limpiado y rebanado en anillos o 225g / 8oz de anillos de calamar preparados", "12 gambas crudas, peladas o conchas, descongeladas si están congeladas", "sal marina copos", "pimienta negra recién molida", "cuñas de limón, para exprimir"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una paellera de 38 cm / 15 in, idealmente antiadherente. Una paellera es lo mejor, pero si no la tiene, use una cacerola antiadherente muy amplia, poco profunda, una cazuela resistente al fuego o una sartén.", "Coloque la sartén a fuego medio. Sazone los muslos de pollo con sal y pimienta negra y fríalos por unos cinco minutos, volteándolos de vez en cuando hasta que estén ligeramente coloreados. Agregue el chorizo ​​y cocine por 30 segundos más, volteándolo una vez. Transfiera el pollo y el chorizo ​​a un tazón grande y resistente al calor con una cuchara ranurada, dejando la grasa en la sartén.", "Agregue las cebollas a la sartén y freír suavemente durante 4-5 minutos hasta que estén suaves y ligeramente doradas, revolviendo ocasionalmente. Agregue los pimientos y las judías verdes a las cebollas y cocine por dos minutos hasta que comiencen a ablandarse. Agregue el ajo, el pimentón ahumado, el azafrán, la hoja de laurel y el arroz y cocínelos por 1-2 minutos hasta que el arroz brille por todos lados.", "Regrese el pollo y el chorizo ​​a la sartén, junto con los jugos. Revuelva bien, vierta el caldo de pollo y sazone con pimienta negra. Revuelva una o dos veces y cocine a fuego lento a fuego medio. Cocine por 12 minutos, revolviendo ocasionalmente.", "Incline los mejillones en la mezcla de arroz parcialmente cocido y revuelva una vez más, asegurándose de que estén bien metidos en el arroz caliente y en el líquido humeante. Regrese a fuego lento y cocine por tres minutos o hasta que la mayoría de los mejillones se hayan abierto, revolviendo ocasionalmente.", "Esparce el calamar y las gambas sobre la paella y revuelve bien. Continúe cocinando durante 4-5 minutos hasta que el calamar y las gambas estén cocidos, el arroz esté tierno y casi todo el líquido haya sido absorbido. Las gambas deben estar completamente rosadas cuando estén cocidas.", "Es importante no seguir revolviendo después de agregar el calamar y los langostinos. Desea que el arroz se ponga ligeramente dorado y un poco pegajoso a los lados de la sartén, ya que esto agrega sabor. No obstante, vigile el calor, ya que no quiere que se queme el arroz. Agregue un poco más de agua si la paella comienza a parecer muy seca antes de que el arroz esté listo. Elija los mejillones que no se hayan abierto al final del tiempo de cocción y retírelos. Sirva caliente con rodajas de limón para exprimir."]}, {"isVegetarian": true, "title": "Burrito de frijoles y arroz", "url": "www_bbc_co_uk_food_recipes_bean_and_rice_burrito_33565", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bean_and_rice_burrito_33565_16x9.jpg", "ingredients": ["½ cebolla pequeña, finamente picada", "Tomates 200g / 7oz, cortados en cubitos", "1 cucharada de vinagre de vino blanco", "1 lima, ralladura solamente (el jugo se usa a continuación)", "sal y pimienta", "1 x 400g / 14oz de estaño mezcla de judías al estilo mexicano o frijoles mezclados en salsa de chile picante", "200 g / 7 oz de maíz dulce congelado, descongelado", "8 envolturas de tortilla", "Arroz de grano largo de 150 g / 5½ oz, cocinado de acuerdo con las instrucciones del paquete", "1 lima, jugo solamente (ralladura usada arriba)", "aproximadamente 200g / 7oz de yogurt natural"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el condimento del tomate, mezcle todos los ingredientes para el condimento en un recipiente y sazone con sal y pimienta. Dejar de lado.", "Para el burrito de frijoles y arroz, caliente una sartén pequeña a fuego medio y caliente los frijoles durante 3-5 minutos. Agregue el maíz dulce y mezcle bien. Pruebe y agregue sal y pimienta si es necesario.", "Caliente las envolturas de tortilla durante 10 segundos en un microondas o en una sartén seca a fuego medio hasta que estén tibias y suaves.", "Para armar, divida el arroz cocido y los frijoles entre las ocho envolturas de tortilla. Exprime un poco de jugo de lima sobre cada uno de ellos. Cuchara sobre el condimento de tomate y el yogur y enrolle para encerrar cada burrito. Sirve caliente."]}, {"isVegetarian": true, "title": "Envoltorios de tortilla de frijoles y tomate con guacamole", "url": "www_bbc_co_uk_food_recipes_beanandtomatotortill_85375", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200 g / 7oz de alubias en conserva, enjuagadas y escurridas", "200g / 7oz de tomates de ciruela enlatados, escurridos", "2 cucharadas de ketchup de tomate", "1 cebolla tierna, finamente picada", "sal y pimienta negra recién molida", "2 envolturas de tortilla listas para usar", "puñado de cilantro fresco, toscamente picado", "algunas gotas de salsa Tabasco", "½ aguacate, pelado, rebanado", "6 cucharadas de yogur griego", "1 diente de ajo, aplastado", "2 cucharadas de frijoles en conserva, enjuagados y escurridos", "½ aguacate, pelado", "½ limón, solo jugo", "pizca de chile en polvo", "sal y pimienta negra recién molida"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para las envolturas de tortilla, coloque los frijoles, los tomates, el ketchup y la cebolleta en una olla pequeña y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 3-4 minutos. Sazonar con sal y pimienta negra recién molida.", "Coloque las tortillas en dos platos y divida la mezcla de frijoles entre los dos. Espolvorea sobre el cilantro y unas gotas de salsa Tabasco. Agregue el aguacate rebanado y enrolle los envoltorios como un cigarro.", "Calienta una sartén de plancha y plancha las envolturas, girando con cuidado, hasta que se caliente.", "Para el guacamole, coloque todos los ingredientes de guacamole en un tazón, sazone con sal y pimienta negra recién molida y aplaste aproximadamente con un tenedor hasta que se combinen.", "Para servir, coloque las envolturas en platos con una cucharada de guacamole."]}, {"isVegetarian": true, "title": "Guiso de frijoles y tomate con pan de ajo, verduras a la plancha y aceite de albahaca", "url": "www_bbc_co_uk_food_recipes_beanandtomatostewwit_85377", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "200 g / 7oz de alubias en conserva, enjuagadas y escurridas", "200g / 7oz de tomates de ciruela enlatados, escurridos", "1 diente de ajo, finamente picado", "1 cebolla tierna, finamente picada", "pizca de cayena", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 rebanada de pan crujiente blanco", "1 cebolleta, cortada a la mitad a lo largo", "1 calabacín, cortado en 4 a lo largo", "1 diente de ajo, pelado", "sal y pimienta negra recién molida", "1 diente de ajo, picado", "puñado de hojas de albahaca fresca", "1 cucharada de aceite de oliva", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el guiso de frijoles, coloque todos los ingredientes del guisado de frijoles en una sartén y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 4-5 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para el pan de ajo y las verduras a la parrilla, caliente una sartén hasta que esté caliente. Rocíe el pan, la cebolla tierna y las rodajas de calabacín con aceite de oliva y chargrill hasta que el pan se tueste y las verduras estén tiernas. Frote la tostada caliente con el diente de ajo y sazone la cebolla y el calabacín con sal y pimienta negra recién molida.", "Para el aceite de albahaca, coloque el ajo, la albahaca y el aceite en un procesador de alimentos pequeño, sazone con sal y pimienta negra recién molida y mezcle hasta que quede suave.", "Para servir, coloque el guiso de frijoles en un recipiente y rocíe con aceite de albahaca. Sirva el pan de ajo y las verduras a la plancha al lado."]}, {"isVegetarian": false, "title": "Cazuela de frijoles", "url": "www_bbc_co_uk_food_recipes_beancasserole_79155", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite de oliva", "1 diente de ajo, picado", "2 tiras de pimiento asado de un tarro, picado", "8 tomates cherry, cortados por la mitad", "6 salchichas de salame bebé, cortadas a la mitad a lo largo", "Frijoles cannellini en conserva 85 g / 3 oz, enjuagados y escurridos", "½ calabacín, cortado en cubitos", "2 cucharadas de perejil fresco, picado", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una sartén, agregue el ajo y saltee durante 1 minuto.", "Agregue los pimientos y los tomates cherry y caliente durante 2-3 minutos.", "Agregue el salami, los frijoles y el calabacín y cocine a fuego lento durante 6-8 minutos, revolviendo ocasionalmente.", "Agregue el perejil y la sazón, al gusto, con sal y pimienta negra recién molida. Transfiera a un tazón de servir y sirva."]}, {"isVegetarian": true, "title": "Cuajada de frijoles con salsa de \\\"ostra\\", "url": "www_bbc_co_uk_food_recipes_beancurdwithoystersa_90178", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beancurdwithoystersa_90178_16x9.jpg", "ingredients": ["6-8 hongos shiitake secos", "450 g / 1 lb de cuajada de soja firme (tofu)", "aceite para freír", "1 diente de ajo, pelado y finamente picado", "120 g / 4½ oz de guisantes frescos (peso sin cáscara) o guisantes congelados (descongelados)", "1 cucharada de aceite de sésamo", "1 cucharada de harina de maíz", "120ml / 4fl oz de caldo de vegetales, más 1 cucharada", "1 cucharadita de salsa de soja ligera china", "2 cucharaditas de salsa de soja oscura china", "2 cucharaditas de azúcar", "3 cucharadas de salsa vegetariana de \\\"ostra\\\" o condimento vegetariano de champiñones"], "serves": "Sirve 4-6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Coloque las setas shiitake secas en un recipiente, agregue agua tibia para cubrir y déjelas en remojo durante 30 minutos o hasta que estén suaves.", "Mientras los champiñones están en remojo, corte la cuajada de frijol en rodajas de aproximadamente 0.5cm x 4cm x 5cm / ½in x 1½in x 2in.", "Coloque las piezas de cuajada de frijoles en una hoja o dos de papel de cocina, cúbralas con otra hoja de papel de cocina y seque con palmaditas.", "Retire los champiñones del agua y corte los tallos duros. Deseche los tallos y devuelva las tapas al líquido de remojo hasta que lo necesite.", "Caliente el aceite en un wok o freidora a fuego medio-alto; debería estar a unos 5 cm / 2 pulgadas de profundidad en el centro del wok si está utilizando uno. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Cuando el aceite empiece a brillar, agregue las piezas de cuajada de frijol y frítelas hasta que estén doradas por ambos lados, esto debería demorar unos 5-7 minutos.", "Retire la cuajada de frijoles con una cuchara ranurada y déjela escurrir sobre un plato forrado con papel de cocina. Con mucho cuidado, drene todas las cucharadas menos del aceite del wok.", "Para la salsa, mezcle la harina de maíz con una cucharada de caldo de verduras en un tazón pequeño.", "En un recipiente aparte, combine las salsas de soja claras y oscuras, el azúcar, la salsa de \\\"ostra\\\" o champiñones y el resto del caldo de verduras y revuelva para mezclar.", "Coloque el wok o la sartén grande en la cocina, colocada a fuego alto. Cuando el aceite esté caliente, agregue el ajo y saltee por 30 segundos.", "Retire los champiñones de su líquido, exprima cualquier exceso de líquido y agregue los champiñones al ajo. Revuelva freír por 30 segundos.", "Agregue la cuajada de frijoles y vierta sobre la mezcla de salsa. Cubra, baje el fuego a fuego lento y cocine a fuego lento con cuidado durante 7-8 minutos.", "Agrega los guisantes. Cocine a fuego lento, cubierto, por otros dos minutos.", "Retire la tapa y quite el wok del fuego. Revuelva la mezcla de harina de maíz y viértala en el wok. Regrese al fuego, revuelva suavemente y cocine, tapado, a fuego lento hasta que la salsa se espese. Agregue el aceite de sésamo y revuelva.", "Servir a la vez"]}, {"isVegetarian": true, "title": "Ensalada de frijoles", "url": "www_bbc_co_uk_food_recipes_beansalad_88164", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, finamente picada", "1 diente de ajo, finamente picado", "85g / 3oz finas judías verdes, recortadas", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "1 cucharada de perejil de flatleaf picado, para decorar"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Calentar el aceite en una sartén y freír suavemente la cebolla y el ajo durante 5-7 minutos, hasta que estén translúcidos. Agregue los frijoles y continúe cocinando durante cinco minutos o hasta que los frijoles estén cocidos, pero firmes.", "Agregue la crema, sazone con sal y pimienta negra recién molida y continúe cocinando hasta que la crema se haya calentado y se haya reducido ligeramente, aproximadamente 3-4 minutos.", "Sirva como guarnición adornada con perejil picado."]}, {"isVegetarian": false, "title": "Fideos de cerdo con salsa de frijoles", "url": "www_bbc_co_uk_food_recipes_beansaucenoodles_76545", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beansaucenoodles_76545_16x9.jpg", "ingredients": ["300g / 10½oz de fideos de huevo secos o frescos, cocidos de acuerdo con las instrucciones del paquete y escurridos", "1½ cucharada de aceite", "2 dientes de ajo, finamente picados", "1 cucharada de jengibre fresco de raíz, finamente picado", "3 cucharadas de cebollas de primavera, picadas, más extra para decorar", "450 g / 1 libra de carne de cerdo picada", "3 cucharadas de salsa de frijol amarillo o salsa de frijoles negros", "1½ cucharadas de vino de arroz Shaoxing o jerez seco (opcional)", "2 cucharadas de salsa de soja", "½ cucharadita de pimienta negra recién molida", "2 cucharaditas de aceite de chile (opcional)", "2 cucharaditas de azúcar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa, caliente un wok o una sartén grande a fuego alto hasta que esté caliente. Agrega el aceite. Cuando esté muy caliente y ligeramente humeante, agregue el ajo, el jengibre y la cebolleta. Revuelva freír durante 15 segundos, luego agregue el cerdo picado.", "Revuelva bien para romper todas las piezas y continúe revolviendo por unos 2 minutos o más, hasta que la carne de cerdo pierda su color rosado. Agregue los ingredientes restantes, excepto los fideos, revolviendo todo el tiempo. Llevar la mezcla a ebullición, baje la temperatura a bajo y cocine a fuego lento durante 5 minutos, agregando un poco de agua si se ve demasiado seco.", "Sumerja los fideos cocidos en un recipiente con agua hirviendo del hervidor durante 30 segundos, o hasta que estén recién calentados. Drene bien en un colador o colador.", "Incline los fideos en un tazón grande y vierta la salsa picante sobre la parte superior.", "Espolvoree cebollas de primavera en la parte superior, mezcle bien todo junto y sirva inmediatamente."]}, {"isVegetarian": false, "title": "Guiso de Gamekeeper", "url": "www_bbc_co_uk_food_recipes_beaters_stew_70079", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 faisanes", "2 cucharadas de aceite", "Tocino rayado ahumado de 100 g / 3½ oz, cortado en tiras de 1 cm / ½ pulgada", "1 cebolla, más o menos picada", "2 palitos de apio, cortados finamente en diagonal", "Harina normal de 25g / 1oz", "Jugo de manzana 300ml / 10fl oz", "300ml / 10fl oz de caldo de pollo caliente", "1 cucharada de jalea de fruta, como jalea de grosella", "2 cucharadas de salsa Worcestershire", "3 hojas de laurel", "250g / 9 oz de champiñones, reducido a la mitad", "salsa dorada (opcional)", "puré de papa, para servir", "sal y pimienta negra recién molida"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno 160C / 140C Ventilador / Gas 3.", "Para preparar la carne, retire la carne de pechuga y las patas de las aves. Separe los cadáveres para hacer inventario para otro momento. Retire la piel de toda la carne y corte la carne de la pechuga en cubos de 3cm / 1¼. Sazonar la pechuga y las piernas con sal y pimienta.", "Caliente 1 cucharada de aceite en una cazuela colocada a fuego medio. Agregue la carne y fría hasta que se dore por todas partes. Retire con una espumadera y déjelo a un lado.", "Agregue el aceite restante y fría el tocino durante unos minutos hasta que estén crujientes. Agregue la cebolla y el apio, y fría a fuego alto durante unos minutos hasta que se ablanden.", "Espolvorea la harina y revuelve. Poco a poco vierta el jugo de manzana y caldo y llevar a ebullición. Agregue la jalea de grosella, la salsa Worcestershire y las hojas de laurel y devuelva la carne a la sartén.", "Devuelve todo a ebullición, revolviendo. Sazone con sal y pimienta y unas gotas de salsa amarillenta, usando. Cubra y cocine en el horno durante aproximadamente 1-1 ½ horas, o hasta que estén tiernos. Agregue los champiñones y cocine por otros 30 minutos.", "Retire las hojas de laurel y sirva la tubería caliente con puré de papa."]}, {"isVegetarian": true, "title": "Salsa Béchamel", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_8751", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g / 1oz de mantequilla", "Harina normal de 30g / 1oz", "455 ml / 16 fl oz de leche", "½ una cebolla pequeña, pelada y rebanada", "4 granos de pimienta negra", "1 hoja de laurel seca", "3 tallos frescos de perejil", "hoja de maza", "sal y pimienta blanca"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Pon la leche en una olla con la cebolla, los granos de pimienta, la hoja de laurel, los tallos de perejil y la maza. Haga que hierva y luego apague el fuego. Permitir infundir durante 30 minutos y luego drenar.", "Derretir la mantequilla en una olla. Agregue la harina y cocine durante 1-2 minutos.", "Retire la sartén del fuego y mezcle gradualmente la leche infundida para obtener una salsa suave.", "Regrese al fuego y, revolviendo todo el tiempo, lleve a ebullición.", "Cocine a fuego lento durante 8-10 minutos y sazone con sal y pimienta blanca."]}, {"isVegetarian": true, "title": "Salsa Béchamel", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_70004", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bechamelsauce_70004_16x9.jpg", "ingredients": ["15fl oz / 425ml de leche", "algunos tallos de perejil", "1 hoja de laurel", "1 hoja de maza o una pizca de maza en polvo (opcional)", "10 granos de pimienta negros enteros", "1 rodaja de cebolla, 1/4 de pulgada (5 mm) de grosor", "1½ oz / 40 g de mantequilla", "Harina simple de ¾oz / 20g", "sal y pimienta negra recién molida"], "serves": "Hace 15 fl oz / 425 ml", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Primero coloque la leche en una cacerola pequeña y agregue los tallos de perejil, la hoja de laurel, la maza (si se usa), los granos de pimienta y la cebolla. Luego colóquelo a fuego lento y déjelo llegar muy lentamente hasta el punto de cocción lenta, lo que le tomará aproximadamente 5 minutos. Luego retire la cacerola del fuego y cuele la leche en una jarra, descartando los saborizantes.", "Todo esto puede hacerse con anticipación, pero cuando quiera preparar la salsa, use la misma sartén lavada y colóquela sobre un fuego suave. Comience por derretir la mantequilla con cuidado, no la caliente excesivamente ni deje que se dore, ya que esto afectará el color y el sabor de la salsa. Tan pronto como la mantequilla se derrita, agregue la harina y, a fuego medio y usando una cuchara pequeña de madera con punta, mezcle con fuerza para hacer una pasta lisa y brillante. Ahora comience a agregar la leche infundida un poco a la vez - aproximadamente 1 fl oz / 25 ml primero y revuelva nuevamente vigorosamente. Luego, cuando se incorpore esta leche, agregue la siguiente cantidad y continúe incorporando cada pedacito de líquido antes de agregar el siguiente. Cuando tenga aproximadamente la mitad de la leche, cambie a un batidor de globo y comience a agregar grandes cantidades de leche, pero siempre batiendo vigorosamente. Tu recompensa será una salsa suave, brillante y cremosa.", "Ahora baje la temperatura a su nivel más bajo y cocine la salsa durante 5 minutos, batiendo de vez en cuando. Mientras esto sucede, pruebe y sazone con sal y pimienta negra recién molida. Si desea mantener la salsa caliente, lo único que debe hacer es verterla en una jarra calentada y cubrir la superficie con film transparente para evitar que se forme una piel, luego coloque la jarra en una fuente con agua apenas hervida."]}, {"isVegetarian": true, "title": "Salsa Béchamel", "url": "www_bbc_co_uk_food_recipes_bechamelsauce_70892", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600ml / 1½ pintas de leche", "1 cebolla", "1 hoja de laurel", "2 dientes", "6 granos de pimienta negra", "55 g / 2 oz de mantequilla", "Harina normal de 55g / 2oz", "nuez moscada rallada (opcional)"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Llevar la leche a ebullición con la cebolla perforada con la hoja de laurel y los clavos, y los granos de pimienta.", "Retirar del fuego y dejar en infusión durante 20 minutos antes de colar.", "Luego, derrita la mantequilla en una sartén antiadherente, agregue la harina y cocine a fuego lento durante cinco minutos.", "Cuando esté suave, comience a agregar algo de la leche filtrada. Revuelva hasta que quede suave, y luego agregue más leche hasta que la salsa se espese.", "Cocine por 10-15 minutos para asegurarse de que la harina esté bien cocida.", "Espolvoree con nuez moscada rallada, si lo desea, y sirva."]}, {"isVegetarian": false, "title": "Estofado de ternera y cerveza", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_76412", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 cucharadas de aceite de cacahuete", "2 cebollas, peladas y cortadas en dados", "2 zanahorias, peladas y en rodajas", "2 palitos de apio, cortados y cortados en pedazos grandes", "1 x 400g / 14oz de estaño tomates de ciruela de buena calidad", "1 cucharadita de pimienta negra molida", "2 hojas frescas de laurel", "2 ramitas de tomillo fresco", "1 cucharada de harina (condimentada con ½ cucharadita de pimienta de cayena)", "500 g / 1 lb 2 oz de carne de vacuno en cubitos", "500ml / 17fl oz pale ale", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite en una cazuela grande de base pesada a fuego medio-alto. Agregue las cebollas, las zanahorias y el apio y fríalos durante 4-5 minutos, o hasta que se ablanden pero no se doren.", "Agregue los tomates de ciruela, los granos de pimienta negra triturados, las hojas de laurel y el tomillo y continúe cocinando, revolviendo regularmente, durante 3-4 minutos.", "Agregue la harina sazonada y continúe cocinando por 2-3 minutos.", "Agregue la carne a la mezcla de vegetales, luego vierta la cerveza pálida y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 3 horas, revolviendo cada 20-30 minutos, hasta que la carne esté lo suficientemente tierno como para cortarla con una cuchara.", "Sirva el estofado de ternera y cerveza en cuencos con rebanadas gruesas de pan fresco o en platos con puré de papa y vegetales verdes."]}, {"isVegetarian": false, "title": "Pastel de carne de res con guisantes blandos", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_pie_with_75061", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite vegetal", "1kg / 2lb 4oz de carne asada cortada en cubos de 5cm / 2in", "1 cebolla, finamente picada", "250 g / 9 oz de champiñones castaños, cortados en cuatro trozos", "8 chalotes redondos pequeños, pelados", "Zanahorias de 400g / 14oz, peladas y cortadas en tres", "4 ramitas de tomillo", "2 hojas de laurel", "4 cucharadas de puré de tomate", "500 ml / 18 fl oz de ale", "300ml / 10½fl oz de caldo de carne caliente reducido", "500g / 1lb 2 oz de hojaldre listo", "1 huevo de gallinas camperas, golpeado", "225g / 8oz de guisantes secos de tuétano", "1 cucharadita de bicarbonato de soda", "75g / 2½oz de mantequilla sin sal", "sal"], "serves": "Sirve 6-8", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Para el pastel, caliente una cazuela o una sartén grande a prueba de horno a fuego alto y agregue el aceite. Una vez caliente, agregue los trozos de carne en lotes y fríalos durante 3-4 minutos, o hasta que estén dorados por todos lados, revolviendo regularmente. Retire el filete cocido del plato, transfiéralo a un plato caliente y déjelo a un lado. Repita el proceso con las piezas de carne restantes, luego reserve.", "Agregue la cebolla, los champiñones, los chalotes enteros y las zanahorias a la cazuela vacía y fríalos durante 2 a 3 minutos, o hasta que se suavicen.", "Agregue el tomillo, las hojas de laurel y el puré de tomate y mezcle bien para combinar.", "Agregue la cerveza y mezcle bien, raspando cualquier sedimento del fondo de la cazuela con una cuchara de madera.", "Regrese las piezas de filete doradas a la cazuela, agregue el caldo caliente, revuelva bien y lleve la mezcla a ebullición. Baje el fuego, coloque una tapa en la cacerola y cocine durante 1 hora y media, o hasta que la carne esté tierna y la salsa espesa.", "Una vez cocido, retire el relleno del pastel del plato y déjelo enfriar.", "Precalentar el horno a 220C / 425F / Gas 7.", "Coloque la mezcla de carne y salsa en un plato redondo resistente al horno de 23 cm de diámetro.", "Extienda la masa a 1cm / ⅓ de grosor y corte la masa en un círculo ligeramente más grande que el plato para pastel.", "Cepille un poco de agua alrededor del borde del plato para pastel, coloque la masa sobre el relleno y presione los bordes para sellar la masa al plato.", "Cepille el pastel con un poco de huevo batido, luego coloque el pastel en el horno y cocínelo durante 20-30 minutos, o hasta que el pastel esté dorado pálido y haya subido.", "Para los guisantes blandos, en un tazón grande empape los guisantes en tres veces su volumen de agua y el bicarbonato de soda. Deje por lo menos cuatro horas o, si tiene tiempo, toda la noche.", "Escurra los guisantes, enjuáguelos bajo el grifo y colóquelos en una sartén grande y cúbralos con agua. Cubra y lleve a ebullición. Una vez hervida, reduzca el fuego y cocine a fuego lento los guisantes durante 1½-2 horas, revolviendo de vez en cuando.", "Los guisantes deben ser suaves y de textura blanda pero no demasiado secos. Si están mojados, continúe cocinando sobre el fuego con la tapa apagada para secar un poco. Agregue la mantequilla y sazone al gusto con sal.", "Para servir, corte una rebanada de pastel y colóquelo en un plato y espolvoree algunos guisantes blandos."]}, {"isVegetarian": false, "title": "Estofado de ternera y cerveza con albóndigas de rábano picante", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_with_57183", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_ale_stew_with_57183_16x9.jpg", "ingredients": ["2-3 cucharadas de aceite de oliva ligero", "1kg / 2lb 4oz de carne de vaca estofada, cortada en cubos", "Chalotes de 250 g / 9 oz o cebollas decapadas en piel plateada, reducidos a la mitad", "2 zanahorias, en rodajas finas", "200g / 7 oz champiñones, dejó todo", "50g / 1¾oz de harina natural", "500 ml / 18 fl oz de ale", "150ml / 5fl oz de caldo de carne", "2-3 cucharadas de mermelada de cebolla", "1-2 cucharadas de salsa Worcestershire", "3 hojas de laurel", "salsa dorada (opcional)", "sal y pimienta negra recién molida", "Harina de 175g / 6oz de auto aumento, más extra para quitar el polvo", "75g / 1¾oz de sebo, rallado", "3-4 cucharadas de salsa de rábano picante caliente, de un tarro", "2 cucharadas de perejil picado"], "serves": "Sirve 6-8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 160C / 140C Fan / Gas 3.", "Caliente 1 cucharada de aceite en una cacerola honda a prueba de horno a fuego alto. Agregue la carne en lotes y dore todo, agregando más aceite si es necesario. Transfiera a un plato con una espumadera y déjelo a un lado. Vierta otra cucharada de aceite en la cazuela, agregue los chalotes, las zanahorias y los champiñones y fríalos durante unos minutos, revolviendo.", "Mientras tanto, ponga la harina en un bol, mezcle con una pequeña cerveza para hacer una pasta suave y luego mezcle con el resto de la cerveza.", "Regrese la carne a la cazuela, luego vierta la mezcla de cerveza y caliéntela. Revuelva a fuego alto hasta que espese y hierva. Agregue la mermelada de cebolla, la salsa Worcestershire, las hojas de laurel y el dorado de la salsa (si se usa) y cocine, revolviendo, durante unos minutos. Sazonar con sal y pimienta, tapar, hornear durante 2-2½ horas o hasta que la carne esté tierna.", "Para hacer las albóndigas, ponga la harina y el sebo en un recipiente y sazone con sal y pimienta. Poco a poco agregue 150ml / 5fl oz de agua y revuelva para hacer una masa suave y pegajosa. Incline sobre una superficie de trabajo enharinada y amase suavemente hasta que quede suave.", "Harina una hoja de papel para hornear antiadherente. Coloque la masa encima y extiéndala a aproximadamente 15x25cm / 6x8in. Extienda la crema de rábano picante y espolvoréese con perejil. Enrolle la masa, desde el lado largo, para hacer una forma de rodillo suizo. Enfriar durante 45 minutos, luego cortar en ocho pedazos.", "Cuando la carne esté tierna, retírela del horno y aumente la temperatura del horno a 220 C / 200Fan / Gas 7. Retire las hojas de laurel y agregue las albóndigas. Vuelva al horno, sin la tapa, durante 25 minutos, o hasta que las albóndigas estén doradas e hinchadas. Sirve caliente."]}, {"isVegetarian": false, "title": "Tagine de carne de vaca y manzana", "url": "www_bbc_co_uk_food_recipes_beef_and_apple_tagine_51104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de cocción de 750 g / 1 lb 10 oz (idealmente filete de chuck)", "4 cucharadas de aceite de girasol", "2 cebollas, cortadas a la mitad y en rodajas", "2 dientes de ajo, finamente picados", "2 cucharaditas de comino molido", "2 cucharaditas de cilantro molido", "1 cucharadita de chile en polvo", "400 g / 14 oz pueden cortar tomates", "400 g / 14 oz pueden garbanzos, drenados y enjuagados", "3 cucharadas de miel clara", "1 cubo de caldo de carne", "1 ramita de canela", "1 camote mediano (alrededor de 400 g / 14 oz)", "2 manzanas grandes para comer", "25g / 1oz manojo de cilantro fresco", "Ciruelas pasas sin remojar, 75 g / 2½ oz, a la mitad", "sal marina escamada y pimienta negra recién molida", "1 gran manzana roja de comer carne", "15g / ½ oz de mantequilla", "1 cucharada de miel clara"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Corte la carne de cualquier grasa dura y córtela en trozos de aproximadamente 3 cm / 1 in. Sazonar todo con sal y pimienta. Caliente una cucharada de aceite en una sartén antiadherente grande y fría la carne en tres tandas a fuego alto hasta que se dore por todos lados, agregando un poco más de aceite a la sartén cuando sea necesario. Transfiera cada lote a una gran cazuela a prueba de llamas una vez dorada.", "Reduzca el fuego y agregue dos cucharadas de aceite más a la sartén. Freír las cebollas durante cinco minutos, o hasta que estén blandas y ligeramente coloreadas, revolviendo regularmente. Agregue el ajo y espolvoree con el comino, el cilantro y el chile en polvo. Cocine por 1-2 minutos más, revolviendo constantemente.", "Incline las cebollas y las especias en la cazuela con la carne. Mezcle 150ml / 5fl oz de agua fría en la sartén y revuelva vigorosamente para levantar el sedimento del fondo. Vierta en la cazuela.", "Agregue 350ml / 12fl oz más de agua, los tomates y los garbanzos a la cacerola y agregue la miel. Desmenuce el cubo en la parte superior, agregue la canela y mezcle bien. Deje que hierva a fuego lento sobre la placa, revolviendo un par de veces. Cubra el plato con una tapa, transfiéralo al horno y cocínelo durante 1½ horas.", "Diez minutos antes de que se acabe el tiempo, pele la batata y córtela en trozos de aproximadamente 2,5 cm. Pelar las manzanas, cortar en cuartos y eliminar los núcleos. Corta las manzanas en trozos de 2cm / ¾in. Recorte el cilantro y corte aproximadamente la mitad de las hojas.", "Saque con cuidado la cazuela del horno y retire la tapa. Agregue la batata, las manzanas, las ciruelas pasas y el cilantro picado. Cubra una vez más y regrese al horno. Cocine por otros 45-60 minutos o hasta que la carne esté tierna. Corta aproximadamente las hojas de cilantro restantes justo antes de servir.", "Para hacer la guarnición, corte la manzana en cuartos y retire el núcleo. Rebana cada cuarto de manzana longitudinalmente en cinco. Sazonar con pimienta negra molida. Derrita la mantequilla en una sartén antiadherente grande y fría las rodajas de manzana a fuego alto durante 3-4 minutos, o hasta que estén ligeramente doradas, volteándolas de vez en cuando. Retire del fuego, rocíe con la miel y mezcle ligeramente.", "Esparce las manzanas fritas sobre el tajín en la cazuela, espolvorea con cilantro picado y sirve."]}, {"isVegetarian": false, "title": "Estofado de carne y cerveza con albóndigas", "url": "www_bbc_co_uk_food_recipes_beef_and_ale_stew_with_39262", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_ale_stew_with_39262_16x9.jpg", "ingredients": ["2 dientes", "¼ de canela", "Anís de 2 estrellas", "harina común, para quitar el polvo", "1 cucharada de sal", "1kg / 2lb 4 oz de carne de res (idealmente costillas sin espinas), cortado en trozos grandes", "3-4 cucharadas de aceite vegetal", "4 zanahorias picadas", "2 cebollas, cortadas en cuartos", "4 tallos de apio, cortados, cortados por la mitad", "3 manzanas Bramley grandes, sin corazón y en cubitos", "500 ml / 18 fl oz de ale", "1.5 litros / 2½ pintas de caldo de pollo", "1 manojo de romero, atado con hilo de cocina", "5 hojas de laurel", "115g / 4oz de pan blanco fresco", "115 g / 4 oz de sebo de ternera", "Harina de auto crianza de 115g / 4oz", "pizca de sal", "2 cucharadas de hojas frescas de perejil de flatleaf picadas", "1 huevo de gallinas camperas, golpeado", "2 cucharadas de leche", "aceite de colza o mantequilla derretida, para glasear"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 140C / 275F / Gas 1.", "Para el estofado, envuelva los clavos, la canela y el anís estrellado en una pieza de muselina limpia y asegúrelos bien. Dejar de lado.", "Espolvorea la harina en un plato y mezcla la sal. Dragar los trozos de ternera en la harina sazonada, sacudiendo cualquier exceso.", "Caliente el aceite en una cacerola grande, de base pesada e ignífuga a fuego medio. Agregue la carne en tandas, fríe durante unos segundos en todos los lados, o hasta que se dore por todas partes. Retire de la cazuela con una espumadera y déjela en un bol. Repita el proceso con la carne restante.", "Agregue las zanahorias y fría, revolviendo regularmente, durante 6-8 minutos, o hasta que estén pegajosas y doradas. Retire de la cacerola con una cuchara ranurada y reservar con la carne.", "Agregue las cebollas y fría, revolviendo regularmente, durante 6-8 minutos o hasta que estén bien coloreadas. Retire de la cacerola con una cuchara ranurada y reservar con la carne y las zanahorias. Agregue el apio y fría, revolviendo regularmente, durante 6-8 minutos o hasta que estén bien coloreados.", "Regrese la carne de res y las verduras cocidas a la cazuela y mezcle bien. Agregue la bolsa de muselina y las manzanas y mezcle de nuevo. Vierte la cerveza, revuelve bien, luego lleva la mezcla a ebullición.", "Vierta el caldo, agregue el romero y las hojas de laurel y vuelva a hervir la mezcla. Revuelva bien, luego cubra la cazuela con la tapa y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Sazonar, al gusto, con sal.", "Transfiera la cacerola al horno y cocine durante 2½-3½ horas, o hasta que la carne esté tierna y se separe.", "Para las albóndigas, mezcle bien las migas de pan, el sebo, la harina de auto aumento, la sal y el perejil en un tazón grande hasta que estén bien combinados. En una jarra, mezcle el huevo y la leche hasta que estén bien combinados.", "Haga un pozo en el centro de los ingredientes secos, luego vierta gradualmente los ingredientes húmedos en él. Mezcle la mezcla seca en la mezcla húmeda poco a poco, hasta que la mezcla se una como masa. Enrolle la masa en ocho albóndigas de igual tamaño, luego apártelos.", "Cuando el guiso se haya estado cocinando durante 2½-3 horas y la carne esté tierna, retire la cazuela del horno y retire la tapa. Coloque las albóndigas sobre la superficie del guiso, dejando espacio entre cada una.", "Coloque la tapa en la cazuela y vuelva a colocarla en el horno durante otros 20 minutos o hasta que las albóndigas se hayan expandido.", "Retire la cazuela del horno. Retire la tapa de la cacerola y cepille la parte superior de las albóndigas con un poco de aceite o mantequilla derretida.", "Aumente la temperatura del horno a 200C / 400F / Gas 6.", "Regrese la cazuela al horno. Continúe cocinando por otros 10-15 minutos, o hasta que las albóndigas estén crujientes y doradas en la parte superior y cocidas.", "Coloque la cazuela a un lado durante 10-20 minutos antes de servir. Para servir, coloque la cazuela sobre la mesa y permita que las personas se ayuden a sí mismas."]}]