[{"isVegetarian": false, "title": "Mary Berry's fish pie", "url": "www_bbc_co_uk_food_recipes_mary_berrys_fish_pie_79943", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g/3oz butter, plus extra for greasing ", "1 large onion, roughly chopped ", "50g/2oz plain flour ", "570ml/1 pint milk ", "salt and freshly ground black pepper ", "2 tbsp lemon juice ", "350g/12oz fresh haddock, cut into 1cm/½in pieces ", "350g /12oz smoked undyed haddock, cut into 1cm/½in pieces ", "4 hard-boiled free-range eggs, roughly chopped ", "900g/2lb potatoes, peeled and cut into even-sized pieces ", "about 8 tbsp hot milk ", "about 50g/2oz butter "], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven 200C/400F/Gas 6.  Grease a shallow 2.5 litre/4½pint dish with butter. ", "Melt the butter in a pan on a high heat and fry onion for few minutes. Lower the heat, cover and leave to soften for 15 minutes.   ", "Remove the lid and increase the heat to remove any moisture.  Sprinkle in the flour and then add the milk gradually, stirring well and allowing the sauce to thicken until all the milk has been added.   ", "Season with salt and freshly ground black pepper, add lemon juice and the raw fish and cook for couple of minutes, stirring continuously until the fish has just cooked.  Stir in the smoked haddock. Pour the mixture into the buttered dish and leave to cool. Top with the hard-boiled eggs. ", "For the topping, boil the potatoes in a pan of salted water until tender. Drain, tip the potatoes back into the pan, add milk and butter and mash until lump-free. Use a ricer to get smooth mash. Add salt and freshly ground black pepper to taste. ", "Spread the mash over the top of the sauce and fish in the dish and score with a fork. ", "Bake in the preheated oven for about 30 minutes, or until the potato is crisp and golden-brown. "]}, {"isVegetarian": true, "title": "Gingerbread house", "url": "www_bbc_co_uk_food_recipes_mary_berrys_gingerbread_91126", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_gingerbread_91126_16x9.jpg", "ingredients": ["375g/13oz unsalted butter", "300g/10½oz dark muscovado sugar", "150g/5½oz golden syrup", "900g/2lb plain flour", "1 tbsp bicarbonate of soda ", "2 tbsp ground ginger", "3 free-range egg whites", "675g/1½lb icing sugar, sifted", "3 tsp lemon juice", "15 yellow or orange boiled sweets", "1 x 30cm/12in square cake board", "200g/7oz giant milk chocolate buttons", "2 night-light candles", "6 cocktail sticks"], "serves": "Makes 1 gingerbread house", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 (fan 180C).", "Melt the butter, sugar and syrup together in a large pan. Sieve the flour, bicarbonate of soda and ground ginger together into a large bowl and make a well in the centre. Pour in the melted butter mixture, stir it in and, when cool enough to handle, knead to a stiff dough. ", "Divide the mixture into five equally-sized pieces, cut one of these pieces in half (so you have six pieces in total). Roll each piece out on a sheet of greaseproof paper to ¾cm/⅓in thick. Using the templates, cut out the sections for the roof, sides, front and back of the house. Slide onto three baking trays lined with baking parchment. ", "Using the template as a guide, a ruler and the rim of a cup, cut out the arched windows on the front and sides of the house. Using a star cutter, cut out a star in the front and back of the house. Using a knife, cut out the door on the front and back of the house and place the doors separately on the baking trays. ", "Re-roll the trimmings and use to cut out the chimney pieces, three Christmas trees and three triangles to use as supports to help the trees stand upright. Bake the gingerbread for 7-8 minutes.  ", "Meanwhile place the boiled sweets in a pestle and mortar and crush to a rough sand texture. ", "Remove the gingerbread from the oven. Trim the windows if the mixture has spread and sprinkle the crushed sweets into the windows. Return to the oven and continue to cook for 3-4 minutes, or until the sweets have melted and the gingerbread is firm. Remove from the oven and leave to cool for a few minutes, then trim around the templates again to give clean, sharp edges. Leave to cool completely. ", "For the icing, whisk the egg whites in a large bowl until frothy.  Using a wooden spoon or a hand-held electric mixer on slow speed, add the icing sugar a tablespoonful at a time. Stir in the lemon juice and beat the icing until it is very stiff and white and stands up in peaks. Cover the surface with a damp cloth if not using immediately.", "Spoon a little of the icing into a piping bag fitted with a medium plain nozzle. Pipe blobs of icing on the back of each chocolate button and stick, overlapping onto the two roof sections, to create a tile effect. Transfer some icing to another piping bag fitted with a small plain nozzle and pipe frames around the windows, doors and stars to decorate. Spoon six tablespoons of the icing over the cake board and, using a palette knife, spread the icing to cover the board with a snow effect and to create a base to stick the house on to. ", "Pipe some icing along the wall edges and join the house together on the iced cake board.  Leave the icing to dry and harden for a minimum of four hours, but preferably overnight. ", "Once dry, place two night-lights inside the house before attaching the roof. ", "Cut the pointed ends of the cocktail sticks into 1cm/½in pieces (you should have 12 small pointed pieces). Push the blunt end of the cocktail stick pieces into the sloping edges of the front and back of the house, leaving the pointed ends sticking out to act as peg supports to attach the roof. (Remember to remove the sharp cocktail sticks from your gingerbread house before eating it, to avoid a choking hazard.) Pipe icing between the cocktail sticks and fix the two roof panels onto the house. Pipe icing around the base and edges of the chimney and attach to the roof.  ", "To decorate, pipe icing along the apex and edges of the roof to look like snow and icicles. Stick the front door in place with icing. Cut the back door into three pieces to use as props to keep the trees upright. Decorate the Christmas trees with piped icing and fix them onto the cake board with icing and gingerbread props. Dust the roof with icing sugar and light the night lights using a candle lighter through the open back door.  Do not leave the candles lit unattended, and it is best not to burn the candles inside the house for longer than 15 minutes or they may singe the inside of the roof and start to melt the chocolate buttons. "]}, {"isVegetarian": true, "title": "Mary Berry's hot cross buns", "url": "www_bbc_co_uk_food_recipes_mary_berrys_hot_cross_65003", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_hot_cross_65003_16x9.jpg", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "75g/2¾oz caster sugar", "2 tsp mixed spice powder", "1 tsp ground cinnamon", "1 lemon, finely grated zest only", "10g/¼oz salt", "10g/¼oz fast-action dried yeast", "40g/1½oz butter", "300ml/10fl oz milk", "1 free-range egg, beaten", "200g/7oz sultanas", "50g/1¾oz finely chopped mixed peel", "oil, for greasing", "75g/2¾oz plain flour", "2 tbsp golden syrup, for glazing"], "serves": "Makes 12 buns", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, sugar, spices and lemon zest into a large bowl and mix together. Then add the salt and yeast, placing them on opposite sides of the bowl.", "Melt the butter in a pan and warm the milk in a separate pan. Add the butter and half the tepid milk to the dry ingredients. Add the egg and use your hands to bring the mixture together, incorporating the flour from the edges of the bowl as you go. Gradually add the remaining milk, to form a soft pliable dough (you may not need all of the milk).", "Tip the dough out on to a lightly floured work surface. Knead by hand incorporating the sultanas and mixed peel into the dough. Lightly knead for 10 minutes until silky and elastic and forming a smooth ball. The kneading can also be done in a food mixer with a dough hook.", "Oil a bowl and place the dough in a bowl, cover with cling film and leave to rest in a warm place for about 1½ hours or until doubled in size.", "Turn the dough out on to a floured surface and divide into 12 balls. Line 1-2 baking trays with paper and place the balls on the tray, placing them fairly close together and flattening them slightly.", "Slip each baking tray into a large clean polythene bag, making sure the bag doesn’t touch the buns. Leave for 40-60 minutes until the buns have doubled in size.", "Preheat the oven to 220C/200C Fan/Gas 7.", "For the topping, add the flour to a bowl with 100ml/3½fl oz water. Mix together to make a paste and spoon into the icing bag. ", "When the buns have risen remove the polythene bags and pipe a cross on each bun. Bake for 15-20 minutes until pale golden-brown, turning the baking trays round halfway through if necessary. ", "Melt the golden syrup in a pan and while the buns are still warm, brush the buns with a little syrup to give a nice shine, before setting aside to cool on a wire rack. "]}, {"isVegetarian": false, "title": "Mary Berry’s jaffa cakes", "url": "www_bbc_co_uk_food_recipes_mary_berrys_jaffa_cakes_58695", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_jaffa_cakes_58695_16x9.jpg", "ingredients": ["1 x 135g packet orange jelly ", "150ml/5fl oz boiling water ", "1 small orange, finely grated zest only ", "unsalted butter, for greasing ", "1 large free-range egg", "25g/1oz caster sugar ", "25g/1oz self-raising flour, sifted ", "180g/6¼oz plain chocolate (about 36% cocoa solids) "], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the jelly, break the jelly into pieces and place in a small bowl. Pour over the boiling water and stir until the jelly is completely dissolved. Add the orange zest, then pour into a shallow 30x20cm/12x8in tray. Chill in the fridge for 1 hour, or until set. ", "Meanwhile, preheat the oven to 180C/160C Fan/Gas 4 and grease a 12-hole, shallow bun tin with butter. ", "For the sponge, whisk the egg and sugar together for 4-5 minutes until pale and fluffy, then gently fold in the flour. Fill each well in the bun tin three-quarters full (about a dessert spoonful per hole) and smooth the tops. Bake for 7-9 minutes, or until well risen and the top of the sponges spring back when lightly pressed. Leave to cool in the tray for a few minutes then finish cooling on a wire rack. ", "To assemble, break the chocolate into pieces then melt in a bowl set over a pan of gently simmering water. Remove the bowl from the heat and leave to cool and thicken slightly. ", "Turn the jelly out onto a sheet of non-stick baking parchment. Cut 12 discs from the orange jelly using a 5cm/2in round cutter. Sit one jelly disc on top of each sponge. ", "Spoon the melted chocolate over the jelly discs. Using the tips of the tines of a fork or a skewer, lightly press to create a criss-cross pattern on top of the chocolate, then leave to set completely. You may need to reheat the chocolate a little if it starts to set before you have finished all the jaffa cakes."]}, {"isVegetarian": false, "title": "Mary Berry’s lasagne al forno", "url": "www_bbc_co_uk_food_recipes_mary_berrys_lasagne_al_16923", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_lasagne_al_16923_16x9.jpg", "ingredients": ["2 tbsp olive oil ", "900g/2lb minced beef ", "2 onions, roughly chopped ", "4 sticks celery, diced (optional) ", "2 garlic cloves, crushed ", "2 level tbsp plain flour ", "150ml/¼ pint beef stock ", "1 tbsp redcurrant jelly (optional) or 1 tsp sugar ", "3 tbsp tomato purée ", "1 tbsp chopped thyme ", "2 x 400g/14oz can chopped tomatoes ", "50g/2oz butter ", "50g/2oz plain flour ", "750ml/1¼ pints hot milk ", "2 tsp Dijon mustard ", "50g/2oz parmesan cheese, grated ", "salt and pepper ", "10-12 sheets lasagne ", "75g/3oz mature cheddar cheese, grated "], "serves": "Serves 6-8", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to160C/325F/Gas 3. ", "For the ragu, heat a large frying pan until hot and add the oil. Cook the mince until browned all over. Remove from the heat and transfer to a plate. Add the onion, celery (if using) and garlic to the pan and cook until softened. Return the meat to the pan and stir in the flour. Add the stock and bring to the boil. Add the redcurrant jelly (or sugar), tomato purée and thyme, then stir well. ", "Stir in the canned tomatoes. Bring to the boil again, cover and simmer in the oven for 1-½ hours, or until the beef is tender. ", "For the white sauce, melt the butter in a saucepan. Add the flour and cook over the heat for one minute. Gradually whisk in the hot milk, whisking until thickened. Add the Dijon mustard and parmesan cheese and season well with salt and pepper.  ", "For the lasagne, put one third of the meat sauce in the base of a 2.3 litre/4 pint shallow ovenproof dish. Spoon one third of the white sauce on top. Arrange one layer of lasagne sheets on top. Season.  Spoon half of the remaining meat sauce on top and then half of the white sauce. Put another layer of lasagne sheets on top, then the remaining meat sauce and remaining white sauce. Sprinkle over the cheddar cheese. ", "Leave for six hours before cooking so that the pasta can start to soften.   ", "Preheat the oven temperature to 200C/400F/Gas 6.   ", "Cook in the middle of the oven for about 45 minutes- or until golden brown on top, bubbling around the edges and the pasta is soft. "]}, {"isVegetarian": true, "title": "How to make a soufflé", "url": "www_bbc_co_uk_food_recipes_mary_berrys_lovely_lemon_73914", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_lovely_lemon_73914_16x9.jpg", "ingredients": ["melted butter, for greasing ", "2 lemons, juice and zest", "2 free-range egg yolks, plus 4 free-range egg whites ", "6 rounded tbsp caster sugar, plus extra for the ramekins ", "3 rounded tsp cornflour ", "1 rounded tbsp plain flour", "90ml/3¼fl oz double cream", "110ml/4fl oz full-fat milk", "icing sugar, for dusting (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Brush the insides of four ramekins with butter. Add a small amount of sugar to each and turn them to coat the sides and bottom, shaking out any excess. Set aside to chill in the fridge.", "Use a fine grater to zest the lemons – grate the yellow outer skin, but be careful not to grate the white pith underneath (the pith will make the soufflés bitter). Cut the lemons in half and squeeze the juice. Add the zest to the juice and put to one side.", "Separate the eggs – crack each egg in half and tip the contents between the two shells, allowing the whites to slide through into the bowl beneath while the yolks stay in the shells. ", "Put four egg whites into a large bowl and two of the yolks into a separate small bowl (the left-over egg yolks can be saved for scrambled eggs or custard). Add 6 tablespoons of sugar to the small bowl with the egg yolks.", "Preheat the oven to 180°C (160°C fan assisted)/350F/Gas 4. Put the baking tray into the middle of the oven.", "Put the cream, flour and cornflour into a medium-sized bowl and whisk to a smooth paste.", "Warm the milk in a large saucepan over a medium heat until just boiling. Remove from the heat. ", "Mix the hot milk into the cream, flour and cornflour mixture with the whisk – add a little to start with and mix well until the mixture is smooth like really thick cream. Press any lumps to the side to break them up. Then add the rest of the milk. ", "Pour the mixture back into the saucepan and put it over a gentle heat. Beat vigorously with a hand whisk until it’s thickened. It’s important to keep whisking all the time so that the mixture doesn’t stick. ", "When you feel it thickening, remove the pan from the heat and whisk in the lemon juice and zest a little at a time. The heat of the pan will continue to cook the mixture. ", "Use a wooden spoon to beat the egg yolks and caster sugar together in the small bowl. Beat them into a thick paste. ", "Add this paste to the mixture in the saucepan and mix well until smooth. Put the saucepan back on the hob to thicken again. Whisk until it begins to bubble and then take if off the heat – the mixture should look like custard. Put it to one side to cool before adding the egg whites.", "Whisk the egg whites in a large bowl using a hand whisk or electric hand mixer. Before you start, make sure the bowl and whisk are completely clean and grease-free, and make sure there’s no yolk with the egg whites or they won’t whip to full volume. Whisk until soft peaks begin to form – the egg whites should look like clouds. ", "When the mixture in the saucepan has cooled you can add the egg whites. Check the temperature of the mixture before you add the egg whites – it should be body temperature or cooler. Add one large spoonful of the egg whites and beat well with the whisk to make the mixture less stiff. Now use a large metal spoon or spatula to very gently fold in the remaining egg whites. Use the spoon to go round the outside and cut through the middle – the aim is to fold in the air bubbles slowly, without breaking them up. Continue until it’s a pale yellow mixture with no streaks of egg white.", "Fill the ramekins to the brim with the mixture and level off with a spatula or palette knife. Run a thumb nail around the inside rim of the ramekins (this helps the soufflés rise evenly without catching on the sides). ", "Place the ramekins on the baking tray in the middle of the oven for about 14 minutes until risen and turning golden. Don’t open the oven during cooking. Time and watch the soufflés carefully – take them out as soon as they’ve risen and are starting to go golden. If you’re using smaller ramekins you’ll need to reduce the cooking time by a few minutes (5 or 6 smaller soufflés will need about 10 minutes).", "Dust with icing sugar and serve immediately."]}, {"isVegetarian": true, "title": "Mary Berry’s mother’s bread and butter pudding", "url": "www_bbc_co_uk_food_recipes_mary_berrys_mothers_97161", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_mothers_97161_16x9.jpg", "ingredients": ["150g/5oz mixed sultanas and raisins", "75g/3oz caster sugar", "1 lemon or orange, finely grated zest ", "½ tsp mixed spice", "8 thin slices white bread, crusts removed", "100g/4oz butter, melted", "2 free-range eggs", "300ml/½ pint double cream", "150ml/¼ pint milk", "2 tbsp demerara sugar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["You will need an ovenproof dish about 2½-3 pint/1.4-1.7 litres volume (18 x 23 x 5 cm/7 x 9 x 2 in). ", "Preheat the oven to 180C/350F/Gas 4 and use some of the melted butter to grease the dish.", "Combine the dried fruit, sugar, lemon zest and spice together in a bowl and toss to mix well. ", "Cut each bread slice into three strips. Take sufficient slices to cover the base of the dish and dip one side of each one in melted butter. Lay them in the dish, buttered-side down. Sprinkle with half the dried fruit mixture. Repeat the layering, laying the bread strips buttered-side up. Lay the third and final layer of bread strips on top, buttered-side up.", "For the custard, beat together the eggs, cream and milk in a bowl and pour it over the pudding. Sprinkle with demerara sugar, and then leave to stand for about one hour if time allows.", "Bake for about 30-40 minutes, or until the top is golden-brown and crisp and the pudding slightly puffed up. Serve hot, or there are some who insist that it is delicious cold!"]}, {"isVegetarian": true, "title": "Mary Berry's perfect Victoria sandwich", "url": "www_bbc_co_uk_food_recipes_mary_berrys_perfect_34317", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_perfect_34317_16x9.jpg", "ingredients": ["4 free-range eggs", "225g/8oz caster sugar, plus a little extra for dusting the finished cake", "225g/8oz self-raising flour", "2 tsp baking powder ", "225g/8oz baking spread, margarine or soft butter at room temperature, plus a little extra to grease the tins", "good-quality strawberry or raspberry jam", "whipped double cream (optional)"], "serves": "Makes 12 slices", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and line 2 x 20cm/8in sandwich tins. Use a piece of baking paper to rub a little baking spread or butter around the inside of the tins until the sides and base are lightly coated then line the bottom of the tins with a circle of baking paper.", "Break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and baking spread. Mix everything together until well combined with an electric hand mixer (you can also use a wooden spoon) but be careful not to over mix. Put a damp cloth under your bowl when you’re mixing to stop it moving around. The finished mixture should fall off a spoon easily.", "Divide the mixture evenly between the tins: this doesn’t need to be exact, but you can weigh the filled tins if you want to check. Use a spatula to remove all of the mixture from the bowl and gently smooth the surface of the cakes.", "Place the tins on the middle shelf of the oven and bake for 25 minutes. Check the cakes after 20 minutes.", "The cakes are done when they’re golden-brown and coming away from the edge of the tins. Press them gently to check – they should be springy to the touch. Remove them from the oven and set aside to cool in their tins for five minutes. Then run a palette or rounded butter knife around the inside edge of the tin and carefully turn the cakes out onto a cooling rack. ", "To take your cakes out of the tins without leaving a wire rack mark on the top, put the clean tea towel over the tin, put your hand onto the tea towel and turn the tin upside-down. The cake should come out onto your hand and the tea towel – then you can turn it from your hand onto the wire rack. Set aside to cool completely.", "To assemble the cake, place one cake upside down onto a plate and spread it with plenty of jam. If you want to, you can spread over whipped cream too. Top with the second cake, top-side up. Sprinkle over the caster sugar."]}, {"isVegetarian": true, "title": "Mary Berry's simnel cake", "url": "www_bbc_co_uk_food_recipes_mary_berrys_simnel_cake_49483", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz light muscovado sugar", "175g/6oz butter, softened, plus extra for greasing ", "175g/6oz self-raising flour", "3 large free-range eggs", "50g/1¾oz ground almonds", "3 tbsp milk", "100g/3½oz sultanas ", "100g/3½oz glacé cherries, quartered", "100g/3½oz dried apricots, cut into small pieces", "2 tsp mixed spice powder", "450g/1lb golden marzipan", "3 tbsp apricot jam", "1 free-range egg, beaten"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Grease a 20cm/8in round, deep-sided, loose-bottomed tin with butter and line the base with baking paper.", "Put the cake ingredients into a large bowl and beat together until well incorporated. Spoon half the mixture into the prepared tin and level the surface.", "Roll one-third of the marzipan to the same size as the base of the tin and place on top of the cake mixture. ", "Spoon the remaining cake mixture on top of the marzipan and level the surface. Bake for 1¾-2 hours or until golden-brown on top and firm in the middle. If the cake is beginning to brown but not cooked through cover it with tin foil. Leave the cake to cool for 10 minutes before removing from the tin. ", "Heat the apricot jam in a pan, then  brush the top of the cooled cake with a little warm jam. Roll out half of the remaining marzipan to fit the top of the cake. Place the marzipan on the cake and use your thumb to crimp around the edges .", "Make 11 balls from the remaining marzipan and place these around the edge of the cake fixing them to the marzipan with a little beaten egg. ", "Brush the marzipan with the egg and glaze under a hot grill for about 5 minutes (turning the cake round to ensure even browning). You can do this using a cook’s blowtorch if you prefer. "]}, {"isVegetarian": true, "title": "Mary Berry’s simnel cake", "url": "www_bbc_co_uk_food_recipes_mary_berrys_simnel_cake_84841", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz red or natural glacé cherries", "225g/8oz softened butter", "225g/8oz light muscovado sugar", "4 large free-range eggs", "225g/8oz self-raising flour", "225g/8oz sultanas", "100g/4oz currants", "50g/2oz chopped candied peel", "2 lemons, zest only", "2 level tsp ground mixed spice", "450g/1lb golden marzipan ", "2 tbsp apricot jam", "1 large free-range egg, beaten, to glaze", "1 free-range egg white", "organic primroses (or alternatively other edible spring flowers)", "handful caster sugar"], "serves": "Serves 10", "time": {"preparation": "overnight", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 150C/300F/Gas 2. Grease a 20cm/8in deep round cake tin and then line the base and sides with baking parchment.", "Cut the cherries into quarters, put in a sieve and rinse under running water. Drain well and then dry thoroughly on kitchen paper. ", "Beat the butter and sugar together in a large bowl until light and creamy. Beat in the eggs, one at a time, to prevent them from curdling. Sift in the flour and mix it in a little at a time. Stir the fruit, peel, zest and mixed spice thoroughly into the mixture.  Place half the mixture into the prepared tin and level the surface.", "Take one-third of the marzipan and roll it out to a circle the size of the tin and then place the circle on top of the cake mixture. Spoon the remaining cake mixture on top and level the surface.", "Bake in the preheated oven for about 2½ hours until well-risen, evenly brown and firm to the touch. Cover with foil after one hour if the top is browning too quickly. Leave to cool in the tin for 10 minutes and then turn out, peel off the parchment and finish cooling on a wire rack.", "When the cake is cool, warm the apricot jam in a small saucepan. Brush the top of the cake with a little of the jam and roll out half of the remaining marzipan to fit the top of the cake. Press firmly on the top and crimp the edges to decorate. Mark a criss-cross pattern on the marzipan with a sharp knife. Form the remaining marzipan into 11 balls. ", "Brush the marzipan with beaten egg and arrange the marzipan balls around the edge of the cake. Brush the tops of the balls with beaten egg, too, and then place the cake under a hot grill to turn the marzipan golden-brown.", "To crystallise the primroses, whisk the egg white in a bowl until frothy. Snip the long stalks off the primroses, then, using a paint brush, carefully paint the petals of each primrose with a little frothy egg white, then turn the flower over and paint the underside of the petals and the little stalk. ", "Cover the flowers in caster sugar until all the egg white is evenly coated, and leave to dry completely. You can either just lie them carefully on non-stick parchment, or, to help keep the flowers’ shape, you can stretch non-stick paper over a plastic box or bowl, securing it in place with string or a rubber band, and then pierce several holes in the paper using a skewer. Place the stems of the crystallised flowers through the holes, allowing the paper to hold and support the flowers in a more natural position as they dry and harden. You will need to make the crystallised flowers at least a day in advance. ", "Decorate the cake by arranging the crystallised primroses on top and tying a ribbon around the middle. "]}, {"isVegetarian": true, "title": "Mary Berry’s tipsy trifle", "url": "www_bbc_co_uk_food_recipes_mary_berrys_tipsy_trifle_21330", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_tipsy_trifle_21330_16x9.jpg", "ingredients": ["4 large free-range eggs", "100g/3½oz caster sugar, plus extra for dusting", "100g/3½oz self-raising flour", "175g/6oz strawberry jam or conserve", "20 ratafia biscuits", "1 x 800g/1lb 12oz tin pear halves in natural juice", "250ml/9fl oz medium dry sherry", "3 large free-range eggs, yolks only", "50g/1¾oz caster sugar", "50g/1¾oz cornflour", "1 tsp vanilla extract", "600ml/1 pint whole milk", "300ml/10½fl oz single cream", "250ml/9fl oz whipping cream", "25g/1oz flaked almonds, toasted", "10 cherries"], "serves": "Serves 10", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7.  Grease and line a 33x23cm/13x9in Swiss roll tin with baking parchment.", "For the Swiss roll, whisk the eggs and sugar together in a large bowl until the mixture is light and frothy and the whisk leaves a trail when lifted out. Sift the flour into the mixture and carefully fold it in. Turn the mixture into the prepared tin and give it a gentle shake so that the mixture finds its own level, making sure that it has spread evenly to the corners. ", "Bake for 10-12 minutes, or until the sponge is golden-brown and begins to shrink from the edges of the tin.  While the cake is cooking, place a piece of baking parchment a little bigger than the size of the tin on the work surface and dust it with caster sugar.", "Turn the cake out onto the sugared parchment and peel off the paper.  Trim the edges of the sponge with a sharp knife to give straight clean edges. Make a score mark running down one of the long sides, about 2cm/1in in from the edge, being careful not to cut right through.  ", "Leave to cool slightly, then spread with jam.  Roll up the cake firmly from the scored end.  ", "Cut the Swiss roll into 14 slices.  Carefully arrange eight of the slices, closely together, around the sides of a 20cm/8in, straight sided, glass bowl, with the cut, rolled sides facing outwards.", "For the filling, arrange the remaining six slices in the base of the dish. Crumble the ratafia biscuits over the top. ", "Combine 150ml/5fl oz of the pear juice drained from the tin with the sherry and sprinkle it over the sponge and crumbled biscuits. Level the surface by pressing down with a spoon and leave to soak while you make the custard. ", "For the custard, put the egg yolks, caster sugar, cornflour and vanilla extract into a large bowl and whisk until blended. Heat the milk and cream together in a pan until hot, but not boiling. Gradually whisk this into the egg yolk mixture a little at a time, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat and cover with cling film in contact with the surface to prevent a skin forming.", "Drain the pears and cut each half in three lengthways and arrange over the sponges. Pour over the custard, cover and leave until completely cold before transferring to the fridge to chill and set.", "Beat the whipping cream in a bowl until a ribbon of cream falls from the whisk when the whisk is removed.Leaving three tablespoons aside for final decoration, gently spread the cream over the surface of the set custard and scatter with the almonds. Whisk the remaining cream further until soft peaks form when the whisk is removed and spoon 10 cream blobs around the trifle, one for each portion. Decorate with 10 cherries and chill until ready to serve."]}, {"isVegetarian": true, "title": "Mary Berry’s treacle tart with woven lattice top", "url": "www_bbc_co_uk_food_recipes_mary_berrys_treacle_tart_28524", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mary_berrys_treacle_tart_28524_16x9.jpg", "ingredients": ["250g/9oz plain flour", "130g/4½oz butter, plus extra for greasing", "400g/14oz golden syrup", "150g/5½oz fine fresh white breadcrumbs", "2 lemons, zest and juice ", "1 free-range egg, beaten, to use as egg wash"], "serves": "Serves 8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["First make the short crust pastry:  measure the flour into a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs (alternatively, this can be done in a food processor). Add about three tablespoons of cold water and mix to a firm dough, wrap in cling film and chill in the fridge for about 20 minutes.  ", "Preheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat up. Grease a deep 18cm/7in loose-bottomed fluted flan tin with butter.", "Remove about 150g/5½oz of pastry from the main ball and set aside for the lattice top.", "Roll the rest of the pastry out thinly on a lightly floured work surface and line the prepared flan tin with the pastry.", "Prick the base with a fork, to stop the base rising up during baking.", "Place the reserved pastry for the lattice top on cling film and roll out thinly.  Egg wash the pastry and set aside to chill in the fridge (the cling film makes it easier to move about). Do not cut into strips at this stage. Do not egg wash the strips once they are on the tart as it will drip into the treacle mixture.", "To make the filling, heat the syrup gently in a large pan but do not boil.", "Once melted, add the breadcrumbs, lemon juice and zest to the syrup.  (You can add less lemon if you would prefer less citrus taste.)  If the mixture looks runny, add a few more breadcrumbs. ", "Pour the syrup mixture into the lined tin and level the surface.    ", "Remove the reserved pastry from the fridge and cut into long strips, 1cm/½in wide.   Make sure they are all longer than the edges of the tart tin.", "Egg wash the edge of the pastry in the tin, and start to make the woven laying lattice pattern over the mixture, leave the strips hanging over the edge of the tin. ", "Once the lattice is in place, use the tin edge to cut off the strips by pressing down with your hands, creating a neat finish. ", "Bake on the pre-heated baking tray in the hot oven for about 10 minutes until the pastry has started to colour, and then reduce the oven temperature to 180C/350F/Gas 4. If at this stage the lattice seems to be getting too dark brown, cover the tart with tin foil.  ", "Bake for a further 25-30 minutes until the pastry is golden-brown and the filling set.", "Remove the tart from the oven and leave to firm up in the tin. Serve warm or cold. "]}, {"isVegetarian": true, "title": "Mary Berry's cheat's cheese sauce", "url": "www_bbc_co_uk_food_recipes_maryberryscheatschee_73830", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 level tbsp cornflour", "1 x 500g/17oz tub Greek-style yoghurt", "2 eggs ", "1 tsp Dijon mustard", "75g/3oz fresh parmesan cheese (or another hard cheese), grated", "lemon, for juicing (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Measure the cornflour into a bowl.", "Blend in a little yoghurt, stir in the eggs and whisk with a hand whisk until smooth. ", "Mix in the remaining yoghurt and the mustard.", "If using with a moussaka (or another oven-baked dish) the yoghurt sauce is now ready to be spread on top of the aubergines, sprinkled with cheese and cooked in a preheated oven for about 45 minutes. This will thicken the yoghurt and cheese sauce.", "For a hot pouring sauce (for fish), whisk four tablespoons of yoghurt with one tablespoon of the cornflour and the mustard until smooth.", "Blend in the remaining yoghurt. ", "Bring to the boil and stir constantly, until thickened and smooth. ", "While stirring, add the cheese, two egg yolks (not the whites), and season with salt and pepper.", "At this point a squeeze of lemon juice can be added if desired.", "Season with salt and pepper and pour directly onto the already cooked fish."]}, {"isVegetarian": true, "title": "Proper apple pie", "url": "www_bbc_co_uk_food_recipes_maryhenrysproperappl_67463", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maryhenrysproperappl_67463_16x9.jpg", "ingredients": ["255g/9oz plain flour", "pinch of salt", "140g/5oz hard margarine or butter", "6 tsp cold water", "3 large Bramley cooking apples, chopped, stewed and cooled", "sugar, to taste", "caster sugar, to serve"], "serves": "6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Sieve the flour and salt into a bowl.", "Rub in the margarine or butter until the mixture resembles fine breadcrumbs.", "Add the cold water to the flour mixture. Using a knife, mix the water into the flour, using your hand to firm up the mixture. The pastry should be of an even colour and suitable consistency for rolling.", "Divide the pastry into two halves. Take one half and roll it out so that it is big enough to cover an 20cm/8in enamel or aluminium plate. Trim the edges with a knife using the edge of the plate as your guide.", "Cover the pastry with the stewed apples and sprinkle with sugar to taste.", "Roll out the other half of the pastry. Moisten the edge of the bottom layer of pastry and place the second piece on top. ", "Press down on the pastry edges, making sure that they are properly sealed. Trim off any excess pastry with a knife in a downward motion, again using the plate as your guide. ", "Flute the edges with a pinching action using your fingers and thumb.", "Prick the surface of the pastry lightly before placing the pie in the oven. Cook for 20-30 minutes.", "When the pie is cooked it should move slightly on the plate when gently shaken.", "Slide on to a serving plate, dust with caster sugar and serve."]}, {"isVegetarian": false, "title": "Maryland fried chicken with waffles and maple syrup", "url": "www_bbc_co_uk_food_recipes_maryland_fried_chicken_30424", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1.7kg/3lb 11oz oven-ready chicken, jointed into 8 pieces", "250ml/9fl oz buttermilk", "1 tbsp Worcestershire sauce", "200g/7oz plain flour", "2 tsp flaked sea salt", "1 tbsp paprika", "½ tsp cayenne pepper, or to taste", "1 tsp freshly ground black pepper, or to taste", "1 tsp dried thyme", "1 tsp dried oregano ", "500ml/18fl oz sunflower or groundnut oil, for frying", "50g/1¾oz butter", "sunflower oil, for greasing", "150g/5½oz plain flour", "3 tbsp cornflour", "1½ tsp baking powder", "1 tbsp golden caster or white granulated sugar", "1 large free-range egg", "225ml/8fl oz semi-skimmed milk", "maple syrup, to serve", "butter, to serve (optional) "], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the fried chicken, put the chicken in a bowl or shallow dish and pour over the buttermilk and Worcestershire sauce. Toss the chicken in the buttermilk mixture, cover with cling film and allow to marinate in the fridge for at least 2 hours and up to 4 hours before cooking. ", "When you are ready to cook, put the plain flour in a large, shallow dish. Add the salt, paprika, cayenne pepper, black pepper, thyme and oregano. Mix all the dry ingredients thoroughly. Preheat the oven to 180C/160C Fan/Gas 4. ", "Pour the oil into a large saucepan or deep frying pan and set over a medium high heat. Place a thermometer in the oil and heat to 180C (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep fat fryer. ", "Take each a piece of chicken with tongs and shake lightly to remove any excess buttermilk. Drop it into the flour. Turn until well coated, then remove with tongs and put on a plate. Repeat with the rest of the chicken. When the oil has reached the right temperature, very carefully lower the chicken pieces into the oil. Cook in batches of 3 or 4 pieces at a  time, cook for 2-3 minutes on each side, or until brown and crisp. Allowing the oil to return to the right temperature between batches will help ensure your chicken is light and crisp.", "Take the cooked chicken out of the pan with clean tongs (not the tongs that have been used for raw chicken). Put on a baking tray lined with kitchen roll to help soak up any excess oil. Scoop out any stray pieces of batter from the oil with a slotted spoon.", "Transfer the fried chicken to a rack and put on a baking tray. Bake in the oven for 15 minutes, or until cooked through.", "For the waffles, put the butter in a small saucepan and melt over a low heat. Preheat a waffle maker to its second highest setting, greasing with a little oil according to the manufacturer’s instructions.", "Mix the flour, cornflour, baking powder, sugar and a good pinch of fine salt in a bowl and make a well in the centre. Whisk the egg with the milk and melted butter in a jug with a metal whisk until smooth. Gradually whisk the milk and egg mixture into the flour until just combined. Pour into the jug and leave to stand for 10 minutes.", "Pour just enough of the batter into the waffle maker to fill each plate and quickly smooth the surface with a palatte knife or spatula. Close the lid and cook the waffles for 4-5 minutes, or until well risen, crisp and brown. Lift carefully out of the waffle maker with tongs and keep warm while the remaining waffles are cooked.", "Once cooked, drain the chicken well on more kitchen roll and serve hot with the waffles, maple syrup and a knob of butter, if you like."]}, {"isVegetarian": false, "title": "Maryland chicken with banana fritters and cornbread", "url": "www_bbc_co_uk_food_recipes_marylandchickenwithb_86621", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz fresh breadcrumbs", "1 tsp chilli flakes", "salt and freshly ground black pepper", "4 chicken breasts, skin left on", "2 free-range eggs, beaten", "oil, for frying ", "30g/1oz butter", "300g/10½oz plain flour", "300g/10½oz polenta", "200g/7oz icing sugar", "1 level tbsp baking powder", "1 free-range egg, beaten", "250ml/9fl oz milk", "200g/7oz butter, melted ", "vegetable oil, for deep frying", "175g/6oz plain flour", "1 tbsp sugar", "about 100ml/3½fl oz ice-cold water (enough to make a batter)", "3 bananas, cut into thick chunks"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the Maryland chicken, combine the breadcrumbs and chilli flakes in a bowl and season well with salt and freshly ground black pepper.", "Season the chicken and dip into the beaten egg, then the breadcrumb mixture, to coat all over.", "Heat the oil in a frying pan and fry the chicken for about 12 minutes over a medium heat, turning frequently, until crisp and golden-brown.", "Dot the chicken breasts with butter, place onto a baking sheet and transfer to the oven. Bake for ten minutes, or until the chicken is completely cooked through.", "For the cornbread, place the flour, polenta, sugar and baking powder into a bowl and mix well. Place a deep, ovenproof dish into the oven.", "Make a well in the centre of the dry mixture and add the beaten egg and the milk. Mix well, then add the melted butter.", "Pour the mixture into the hot ovenproof dish, transfer to the oven and bake for 15 minutes, or until golden-brown.", "For the banana fritters, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Place the flour and sugar into a bowl and add enough water to make a smooth batter. Dip the banana pieces into the batter to coat.", "Carefully place the bananas into the hot oil and deep fry for 4-5 minutes, or until crisp and golden-brown.", "To serve, place the Maryland chicken, cornbread and banana fritters onto a large platter."]}, {"isVegetarian": true, "title": "Mary’s Bakewell tart", "url": "www_bbc_co_uk_food_recipes_marys_bakewell_tart_12584", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_bakewell_tart_12584_16x9.jpg", "ingredients": ["200g/7oz raspberries ", "250g/9oz jam sugar ", "225g/8oz plain flour, plus extra for dusting", "150g/5½oz butter, chilled ", "25g/1oz icing sugar ", "1 large free-range egg, beaten ", "150g/5½oz butter, softened ", "150g/5½oz caster sugar ", "150g/5½oz ground almonds ", "1 large free-range egg, beaten ", "1 tsp almond extract ", "300g/10½oz icing sugar ", "1 tsp almond extract ", "pink food colouring gel "], "serves": "Serves 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the jam, put the raspberries in a small, deep-sided saucepan and crush them using a masher. Add the sugar and bring to the boil over a low heat until the sugar has melted. Increase the heat and boil for 4 minutes. Remove from the heat and carefully pour into a shallow container. Leave to cool and set. ", "For the pastry, measure the flour into a bowl and rub in the butter using your fingertips until the mixture resembles fine breadcrumbs. Stir in the icing sugar. Add the egg and 2 tablespoons cold water, mixing to form soft dough. ", "Roll out the dough on a lightly floured work surface to the thickness of a pound coin. Line a 23cm/9in fluted flan tin and transfer to the fridge to chill for 30 minutes. ", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Line the pastry case with non-stick baking paper and fill with baking beans or uncooked rice. Bake blind for 15 minutes, then remove the beans and paper and cook for a further 5 minutes to dry out the base. Set aside to cool a little before adding the filling. ", "For the filling, spread the base of the pastry case with 4 tablespoons of raspberry jam. ", "Cream the butter and sugar together until pale and fluffy. Add the ground almonds, egg and almond extract and mix together. Spoon the mixture into the pastry case and smooth the surface using a palette knife. ", "Reduce the oven temperature to 180C/160C Fan/Gas 4 and bake for 25–35 minutes, until golden-brown and a skewer inserted in the centre comes out clean. Remove from the oven and leave to cool completely in the tin. ", "For the icing, sift the icing sugar into a bowl. Stir in the almond extract and about 3 tablespoons cold water to make a smooth, fairly thick icing. Place 3 tablespoons of the icing in a separate bowl and add a little pink food colouring gel to make a raspberry coloured icing. Spoon the pink icing into a small piping bag fitted with a small plain nozzle. ", "When the tart has cooled completely, spoon the white icing on top and spread to form a smooth surface. Pipe parallel lines of pink icing over the white icing, then drag a cocktail stick through the lines (at a 90 degree angle to the lines) to create a feathered effect. Leave to set, then serve in slices."]}, {"isVegetarian": true, "title": "Mary's Black Forest gâteau", "url": "www_bbc_co_uk_food_recipes_marys_black_forest_gteau_47151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_black_forest_gteau_47151_16x9.jpg", "ingredients": ["6 large free-range eggs", "150g/5½oz caster sugar", "100g/3½oz self-raising flour, sifted ", "50g/1¾oz cocoa powder, sifted", "2 x 390g jars black cherries in kirsch (500g/1lb 2oz drained weight)", "2 heaped tbsp cornflour ", "750ml/1⅓ pint double cream, whipped", "150g/5½oz white chocolate", "250g/9oz plain chocolate (about 46% cocoa solids)", "24 fresh cherries with stalks"], "serves": "Makes 1 large cake", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Lightly grease two 23cm/9in cake tins and line the base with greased non-stick baking parchment. ", "Break the eggs into a mixing bowl, add the sugar and whisk until the mixture is pale and thick enough to leave a trail when the whisk is lifted out of the bowl. Carefully fold in the sifted flour and cocoa powder. Turn the mixture into the prepared tins. ", "Bake for 25-30 minutes, until the sponges are well risen and beginning to shrink away from the sides of the tin. Turn out onto a wire rack to cool and peel off the parchment. ", "For the filling, drain the jars of cherries, reserving the juice. Chop the cherries roughly into quarters. Measure the cornflour into a small saucepan, make a paste with a small amount of the reserved juice, then stir in the remaining juice. Place over a medium heat and bring slowly to the boil, stirring until thickened, then simmer for 2 minutes. Remove from the heat, add the cherries and leave to cool. Refrigerate until quite firm. ", "For the decoration, melt the white and plain chocolate in 2 separate bowls set over 2 pans of gently simmering water. Dip 12 of the fresh cherries into the plain chocolate and leave to set on a sheet of non-stick baking parchment. Dip the remaining 12 fresh cherries into the white chocolate and leave to set.  Spoon the remaining melted chocolate into 2 separate disposable piping bags.  ", "Draw a credit card size rectangle on a piece of paper and position it vertically. Draw a tree within the rectangle to use as a template. Lay a sheet of non-stick parchment paper over the template. Snip off the tip of the plain chocolate piping bag (start with a very small tip). Pipe 12 (plus a few spare in case they break) chocolate tree shapes onto the non-stick parchment. Leave to harden and set. ", "When the chocolate on the cherries has set, snip the end of the white chocolate piping bag and pipe thin lines of white chocolate over the plain chocolate dipped cherries. Pipe thin lines of plain chocolate over the white chocolate dipped cherries. Leave to set. ", "Whip the cream to soft peaks. Divide the cream in half, setting aside one half for the sides and top of the cake. ", "Cut each sponge into 2 layers using a long sharp knife. Divide the cherry mixture into thirds. Spread one third of the cherry mix over the sliced sponge. Divide one half of the cream into thirds and spread one third over the cherry mix. Top with another sponge layer and continue until you have three layers of cherries and cream. Top with the final sponge layer. ", "Spread half of the reserved whipped cream around the sides of the cake and cover with the chocolate trees. With the remaining reserved cream, pipe rosettes of cream around the top edge of the cake and decorate with the chocolate dipped cherries. "]}, {"isVegetarian": true, "title": "Cherry cake", "url": "www_bbc_co_uk_food_recipes_marys_cherry_cake_17869", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_cherry_cake_17869_16x9.jpg", "ingredients": ["200g/7oz glacé cherries", "225g/8oz self-raising flour", "175g/6oz softened butter, plus extra for greasing", "175g/6oz caster sugar", "1 lemon, finely grated zest only ", "50g/1¾oz ground almonds", "3 large free-range eggs", "175g/6oz icing sugar", "1 lemon, juice only ", "15g/½oz flaked almonds, toasted", "5 glacé cherries, quartered "], "serves": "Serves 10-12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease a 23cm/9in bundt tin or savarin mould with butter. ", "Cut the cherries into quarters. Set aside five of the quartered cherries for the decoration later. Put the rest of the quartered cherries in a sieve and rinse under running water. Drain well then dry thoroughly on kitchen paper and toss in two tablespoons of the flour.", "Measure all the remaining ingredients into a large bowl and beat well for two minutes to mix thoroughly. Lightly fold in the cherries. Turn into the prepared tin.", "Bake in the preheated oven for 35-40 minutes until well risen, golden-brown and a skewer inserted into the centre comes out clean. Leave to cool in the tin for 10 minutes then turn out and cool on a wire rack.", "For the icing, mix the icing sugar together with the lemon juice to a thick paste. Drizzle over the cooled cake using the back of a spoon, sprinkle over the toasted almonds and reserved cherries."]}, {"isVegetarian": true, "title": "Mary’s Christmas choux wreath", "url": "www_bbc_co_uk_food_recipes_marys_christmas_choux_11022", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_christmas_choux_11022_16x9.jpg", "ingredients": ["110g/3¾oz butter, cubed", "130g/4¾oz plain flour, sifted", "4 large free-range eggs, lightly beaten", "600ml/20fl oz full-fat milk", "6 free-range egg yolks", "75g/2¾oz caster sugar", "50g/1¾oz cornflour", "½ tsp ground cinnamon", "¼ tsp ground nutmeg", "150ml/5fl oz double cream", "100g/3½oz milk chocolate, 46% minimum cocoa solids", "100ml/3½fl oz double cream", "100g/3½oz white chocolate, melted", "200g/7oz caster sugar", "red food colouring paste", "12 blanched hazelnuts"], "serves": "Serves 12", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line three baking sheets with baking parchment. ", "Put the butter into a heavy saucepan with 250ml/9fl oz water and heat over a medium heat until the butter melts. Bring to the boil taking care not to burn the butter.", "Remove from the heat and add the flour. Stir vigorously with a wooden spoon until the mixture forms a soft ball. Cook over a low heat for 3–5 minutes, stirring constantly to dry out the choux. Leave to cool slightly.  ", "Tip into the bowl of a food mixer with a whisk attachment or use an electric hand whisk. Gradually add the eggs, whisking well between each addition, to form a smooth, shiny paste. Spoon the mixture into piping bag fitted with a 1½cm/¾in plain nozzle.", "Pipe twelve small mounds onto each prepared baking sheet (giving a total of 36 mounds). Dip your finger in water and gently smooth the top of each mound. Bake for 10 minutes.  ", "Reduce the oven temperature to 190C/170C Fan/Gas 5. Cook the choux for a further 10 minutes until golden-brown.  ", "Pierce each bun with a skewer to allow the steam to escape. Return to the oven for 5 minutes to dry out. Leave to cool on a wire rack.", "For the crème pâtissière, pour the milk into a heavy-based pan, bring to the boil. Remove from the heat and leave to cool for 30 seconds.", "Meanwhile, in a medium bowl, whisk together the egg yolks and caster sugar until pale, then whisk in the cornflour, cinnamon and nutmeg. Pour the milk over the egg mixture, whisking continuously, then pour back into the pan.", "Bring to the boil, whisking continuously over a medium heat and cook for a minute. Remove from the heat and pour the crème pâtissière into a bowl. Cover the surface with cling film to prevent a skin from forming and leave to cool. ", "For the chocolate ganache, break the chocolate into pieces and place in a heatproof bowl. Pour the cream into a pan and heat until simmering.  Remove from the heat and pour over the chocolate. Stir until the mixture is smooth. Leave to cool until thick enough to drizzle.", "For the chocolate snowflakes, spoon the chocolate into a small piping bag fitted with a writing nozzle. Pipe 12 snowflake shapes onto baking parchment and leave to set.", "To assemble, whip the double cream to soft peaks and fold into the crème pâtissière. Spoon into a piping bag fitted with a long thin nozzle or jam syringe. Fill the choux buns with the crème pâtissière.", "For the caramel, boil the caster sugar and 5 tablespoons water together in a pan until it turns golden or reaches 170C on a sugar thermometer (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over). Remove from the heat and plunge the pan into a sink of cold water and leave the caramel to thicken slightly.  ", "On a large cooling rack or work surface, arrange a circle of fourteen choux buns so they are all touching and place ten choux buns inside the circle, so you have two circles of choux buns. Carefully dip one side of each choux bun individually into the caramel and glue to the bun next to it. Continue until the two circles are joined together. ", "Dip the base of the remaining twelve choux buns in caramel and stick them on top of the circles. ", "Line a baking sheet with silicon paper. Return the caramel to the heat and bring to a gentle simmer, add a small amount of red food colouring paste.  Add the hazelnuts, stir well and lift each hazelnut out and place on the prepared sheet. Leave to cool. ", "Finally drizzle the wreath with one quarter of the chocolate ganache. Transfer onto a serving plate and decorate with the chocolate snowflakes and caramel hazelnuts. "]}, {"isVegetarian": true, "title": "Christmas Genoa cake", "url": "www_bbc_co_uk_food_recipes_marys_christmas_genoa_32386", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_christmas_genoa_32386_16x9.jpg", "ingredients": ["350g/12oz red or natural (uncoloured) glacé cherries, rinsed, dried and cut into quarters", "225g/8oz tinned pineapple in pineapple juice, drained, dried and roughly chopped", "50g/2oz ready-to-eat dried apricots, chopped", "100g/3½oz blanched almonds, roughly chopped", "2 lemons, finely grated zest only", "350g/12oz sultanas", "250g/9oz unsalted butter, softened, plus extra for greasing", "250g/9oz caster sugar", "5 large free-range eggs, lightly beaten", "250g/9oz self-raising flour", "75g/2½oz ground almonds", "small handful blanched whole almonds", "small handful walnut halves", "small handful red or natural (uncoloured) glacé cherries, halved", "50g/1¾oz whole orange peel (available from health-food shops), cut into pieces", "100g/3½oz apricot jam"], "serves": "Makes 1 x 23cm/9in cake", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 3. Grease a deep, 23cm/9in round cake tin with butter, then line the base and sides with a double layer of baking parchment.", "In a bowl, gently mix together the cherries, pineapple, apricots, almonds, lemon zest and sultanas until well combined. Set aside.", "In a food processor, cream the butter and sugar until light and fluffy.  Pour in the beaten eggs a little at a time, adding a spoonful of the flour to prevent the mixture from curdling and pulsing after each addition. ", "Carefully fold the remaining flour and ground almonds into the cake mixture using a metal spoon, then gently fold in the fruit and nut mixture until just combined. ", "Pour the cake mixture into the prepared tin and smooth the surface using a palette knife.", "For the topping, decorate the cake with the blanched whole almonds, walnut halves, glacé cherry halves and orange peel.", "Bake the cake in the oven for 2-2¼ hours, or until golden-brown on top and cooked through. (The cake is cooked through when a skewer inserted into the centre of the cake comes out clean.) Cover the cake loosely with aluminium foil after one hour to prevent the top from becoming too dark.", "Set the cake aside in its tin to cool for 30 minutes, then remove from the tin, peel the baking parchment away from the sides and place onto a wire rack to cool completely. ", "Meanwhile, heat the apricot jam in a small pan over a low heat, then strain through a fine sieve to remove any pieces of fruit. When the cake has cooled, brush the top all over with the warm apricot jam. Wrap a ribbon around the cake and tie with a bow, if desired, then serve. "]}, {"isVegetarian": false, "title": "Mary's classic Caesar salad", "url": "www_bbc_co_uk_food_recipes_marys_classic_caesar_72903", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "2 slices of day-old white bread, crusts removed, cubed", "1 romaine lettuce heart, sliced ", "30g/1oz Parmesan cheese, shaved ", "salt and freshly ground black pepper", "6 tbsp light mayonnaise", "1½ tbsp Dijon mustard", "2 tbsp grated Parmesan cheese", "½ garlic clove, crushed", "a few drops of Worcestershire sauce"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a non-stick frying pan, add the bread and fry over a high heat for 3–4 minutes until golden-brown. Remove with a slotted spoon, transfer to a bowl and season with salt and pepper. ", "Put all the dressing ingredients in a bowl and beat together until smooth with 1–2 tablespoons water. ", "Toss the romaine lettuce in the dressing and scatter with the toasted croûtons and grated Parmesan."]}, {"isVegetarian": true, "title": "Mary’s florentines", "url": "www_bbc_co_uk_food_recipes_marys_florentines_49833", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_florentines_49833_16x9.jpg", "ingredients": ["50g/1¾oz butter", "50g/1¾oz demerara sugar", "50g/1¾oz golden syrup", "50g/1¾oz plain flour", "25g/1oz dried cranberries or glacé cherries, finely chopped", "50g/1¾oz candied peel, finely chopped", "25g/1oz almonds, finely chopped", "25g/1oz walnut pieces, finely chopped", "200g/7oz plain chocolate (70% cocoa solids)"], "serves": "Makes 18 biscuits", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.  Line three baking trays with baking parchment or silicon sheets.", "Measure the butter, sugar and syrup into a small pan and heat gently until the butter is melted. Remove from the heat and add the flour, chopped cranberries or cherries, candied peel and nuts to the pan. Stir well to mix. ", "Make 18 florentines by spooning six teaspoonfuls of the mixture on to each of the prepared baking trays, leaving plenty of room for them to spread during cooking.", "Bake for 8-10 minutes, or until golden-brown. Leave the florentines to cool before lifting onto a cooling rack using a palette knife (if the florentines have been baked on greased baking trays, then allow them to harden for a few moments only before lifting onto cooling racks to cool completely). If the florentines become too hard to remove, then pop them back into the oven for a few minutes to allow them to soften.", "Set a heatproof bowl over a pan of simmering water, without letting the bowl touch the water. Temper the chocolate by breaking half of the chocolate into the bowl. Stir until the chocolate reaches a melting temperature of 53C/127F.  Meanwhile, finely chop or grate the remaining chocolate. ", "Carefully remove the bowl from the pan, add the rest of the chocolate and stir gently until the chocolate has cooled to 26C/79F.  ", "Spread a little melted chocolate over the flat base of each florentine and leave to cool slightly before marking a zigzag in the chocolate with a fork.  Leave to set, chocolate side up on a cooling rack. Store in an airtight container."]}, {"isVegetarian": true, "title": "Mary’s frosted walnut layer cake", "url": "www_bbc_co_uk_food_recipes_marys_frosted_walnut_15679", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_frosted_walnut_15679_16x9.jpg", "ingredients": ["225g/8oz self-raising flour, sifted", "1 tsp baking powder", "100g/3½oz walnuts, finely chopped", "225g/8oz butter, softened, plus extra for greasing", "225g/8oz caster sugar", "4 large free-range eggs, beaten", "100g/3½oz caster sugar ", "10 walnut halves", "125g/4½oz butter, softened", "½ tsp vanilla extract", "2 tbsp milk", "250g/9oz icing sugar", "2 large egg whites ", "350g/12oz caster sugar", "¼ tsp cream of tartar"], "serves": "Makes 1 large cake", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3. Grease 3 x 20cm/8in sandwich tins and line the base of each tin with baking parchment. ", "Mix the flour, baking powder and walnuts together in a bowl. In a separate bowl, cream the butter and sugar together until pale and fluffy. Beat in the eggs a little at a time. ", "Fold in the flour mixture using a large metal spoon. Divide the mixture equally between the 3 tins and level the surfaces. ", "Bake for about 25-30 minutes, or until the cakes are golden-brown and springy to the touch. Leave to cool in the tins for a few minutes then turn out, peel off the parchment and finish cooling on a wire rack. ", "For the caramelised walnuts, tip the sugar and 2 tablespoons water into a pan and heat over a low heat until the sugar begins to melt. Increase the heat and cook the caramel to a dark golden colour (CAUTION: boiling sugar is extremely hot. Handle very carefully). Remove from the heat, add the walnut halves and swirl to coat in the caramel. Transfer the walnut halves to a silicon sheet and leave to set. ", "For the buttercream, put the butter, vanilla extract, 1 tablespoon of the milk and half the icing sugar in a large bowl and beat until smooth. Beat in the remaining icing sugar. Pour in the rest of the milk, if needed to make the buttercream the right consistency.", "Spread half of the buttercream over one of the cooled sponges and place the second sponge on top. Spread the remaining buttercream over the second sponge and top with the third sponge. ", "For the boiled icing, measure the egg whites, sugar, 4 tablespoons water and cream of tartar into a heatproof bowl set over a pan of hot water and whisk for 8-10 minutes until thick. ", "Working quickly (the icing sets rapidly), cover the top and sides of the cake with the icing, swirling the icing to form softened peaks. Leave to set in a cool place, but not in the fridge. Decorate with the caramelised walnuts. "]}, {"isVegetarian": true, "title": "Galette", "url": "www_bbc_co_uk_food_recipes_marys_galette_38999", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/marys_galette_38999_16x9.jpg", "ingredients": ["750g/1lb 10oz ready-made all-butter puff pastry, chilled", "plain flour, for dusting", "1 free-range egg, beaten, to glaze", "100g/3½oz unsalted butter, softened", "100g/3½oz caster sugar", "1 large free-range egg, plus 1 yolk, at room temperature", "100g/3½oz ground almonds", "50g/1¾oz flaked almonds", "1 tsp almond extract"], "serves": "Makes 1 large tart", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Line a baking tray with baking parchment. Roll out half of the pastry on a lightly floured work surface until it is about 25x25cm/10x10in in size and slightly thinner than a pound coin. ", "Cut a 23cm/9in circle from the pastry by cutting around the bottom of a 23cm/9in cake tin using a sharp knife. Transfer the pastry circle to the prepared baking tray and cover with cling film. ", "Repeat the process with the other half of the pastry, placing the second pastry circle on top of the cling film and covering with more cling film. Chill until needed.", "For the filling, beat the softened butter until creamy using a wooden spoon or freestanding mixer. Add the sugar and beat again thoroughly until the mixture is pale and fluffy. ", "In a small bowl, beat the egg with the egg yolk until just combined. Gradually add it to the creamed butter and sugar mixture, a tablespoon at a time, beating well after each addition to incorporate the egg into the mixture. ", "When the mixture is very light in colour and texture, gently stir in the ground almonds, flaked almonds and almond extract. Cover the bowl with cling film and chill in the fridge for 15-20 minutes.", "When the pastry and filling have cooled, remove the cling film from the pastry and leave one pastry circle on the baking tray. Spoon the filling mixture onto the pastry circle on the baking tray, heaping it into a slight mound in the middle and leaving a 2cm/1in border all around the edge. Brush the pastry border with some of the beaten egg, then gently lay the second pastry circle over the filling, pressing the edges firmly together to seal. ", "Holding a small knife blade at right angles to the pastry border, ‘knock up’ the edge of the galette by making small indentations all around the edge of the pastry. Scallop the pastry border by pushing the indentations in at 2cm/1in intervals using the back of the knife. Brush the top of the galette all over with more of the beaten egg, then chill the galette in the fridge for 30 minutes. ", "Preheat the oven to 220C/200C Fan/Gas 7.", "Brush all over the top of the chilled galette again with the remaining beaten egg, then score it with a criss-cross pattern using the tip of a sharp knife. Make a couple of small steam holes in the centre of the galette. Bake in the oven for 25-30 minutes, or until the pastry is crisp and golden-brown. Set aside to cool slightly before serving."]}]