[{"isVegetarian": false, "title": "Pan-fried mackerel with curry cream and coriander flatbreads", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_25452", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 fillets mackerel, pin-boned", "1 red onion, thinly sliced ", "1–2 green chillies, finely chopped ", "2 tbsp micro coriander, plus extra for garnish", "2 tbsp olive oil", "½ onion, diced", "2 celery sticks, chopped", "1 carrot, chopped", "1 apple, diced ", "2 tbsp finely chooped fresh coriander", "1 tsp coriander seeds", "1 tsp cumin seeds", "2 tsp medium curry powder", "½ tsp ground turmeric ", "500ml/18fl oz fish stock", "1 x 150g tin coconut cream", "400g/14oz self-raising flour, plus extra for dusting", "1 tsp baking powder", "300ml/10fl oz plain yoghurt ", "1 tbsp olive oil", "8 anchovy fillets in olive oil, drained and finely chopped", "2 garlic cloves, finely chopped ", "150g/5½oz unsalted butter", "2 tbsp finely chopped coriander "], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the sambal, mix together the onion, chillies and micro coriander and set aside. ", "For the curry cream, heat the oil in a medium sauté pan over a medium heat and gently fry the vegetables, apple, coriander stalks and spices for a few minutes until soft. Add the stock and coconut cream, bring to the boil and simmer for 2–3 minutes. ", "Blitz the mixture in a blender, pass through a sieve, reserving the cream in a bowl underneath, and keep warm.", "To make the flatbreads, mix together the flour, baking powder, yoghurt and oil and knead until a soft dough is formed (you may need to add a little water if the dough is too dry). Divide the dough into four equal portions and roll out on a floured surface to approximately 1cm/½in thick.", "Heat a griddle pan over a medium heat and grill the flatbreads for 2–3 minutes on each side, until lightly browned. ", "Meanwhile, heat the oil in a frying pan and fry the mackerel fillets for 2–3 minutes on each side, or until cooked through. ", "Melt the butter, then mix with the anchovies, garlic and coriander leaves. Brush the mixture over the hot flatbreads.  ", "To serve, pour the curry cream into the bottom of four serving bowls and sprinkle over the sambal. Top with the mackerel and micro coriander and serve with the flatbreads."]}, {"isVegetarian": false, "title": "Pan-fried mackerel with caponata", "url": "www_bbc_co_uk_food_recipes_pan-fried_mackerel_with_85442", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-fried_mackerel_with_85442_16x9.jpg", "ingredients": ["2 tbsp olive oil", "1 red onion, finely chopped", "1 onion, finely chopped", "1 fennel bulb, chopped", "1 aubergine, chopped ", "2 celery stalks, sliced ", "1 tbsp tomato purée", "50g/2oz capers", "50g/2oz raisins, soaked in 50ml/2fl oz red wine vinegar and drained", "25g/1oz pine nuts, toasted", "½ red pepper, finely chopped", "salt and freshly ground black pepper ", "4 x mackerel fillets", "2 tbsp vegetable oil ", "100ml/3½fl oz light soy sauce", "2 oranges, juiced and zested ", "150ml/5 fl oz runny honey", "1 red chilli, finely chopped "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the caponata, heat the olive oil in a pan and fry the onions, fennel, aubergine and celery for seven minutes. Add the tomato purée and fry for another two minutes.\r\n\r\n", "Remove the mixture from the heat and place in a bowl. Add the capers, raisins, pine nuts, pepper, salt and freshly ground black pepper. Mix together until well combined. ", "Rub the mackerel with oil and place skin-side down in a hot frying pan. Fry over a medium heat for 2-3 minutes on each side. Remove and set aside to drain on kitchen paper. ", "For the sauce, place all the ingredients in a pan. Stir over a low heat until warmed through.", "To serve, divide the caponata between four plates. Place a piece of mackerel on each and cover with the sauce. "]}, {"isVegetarian": false, "title": "Pan-fried monkfish cheeks, ceps ‘paysanne’ and chickpea farinata", "url": "www_bbc_co_uk_food_recipes_pan-fried_monkfish_68204", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz chickpea flour", "salt and freshly ground black pepper", "1 tsp thyme leaves", "100g/3½oz extra virgin olive oil ", "olive oil, for frying", "50ml/1¾fl oz olive oil ", "100g/3½oz butter, plus another knob for frying ceps", "200g/7oz shallots, finely diced", "1 whole unpeeled garlic clove, smashed ", "2 sprigs thyme ", "100g/3½oz cooked gammon, finely diced", "500g/1lb 2oz fresh cep mushrooms, roughly diced ", "1 tbsp chopped fresh parsley", "extra virgin olive oil, for drizzling", "12 monkfish cheeks ", "25g/1oz plain flour", "olive oil, for frying"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the pancakes, sieve the chickpea flour into a bowl. Season with salt and pepper and add the picked thyme leaves.", "Add 500g/1lb 2oz of warm water and the olive oil to the bowl and whisk together to make a batter. Cover and leave to rest in the fridge, ideally for 48 hours, before using.", "For the fricassée, heat a large frying pan. Heat the oil and butter and add the shallots, garlic and thyme.", "When the shallot and garlic has softened, add the gammon to the shallot mixture. Remove and discard the garlic and thyme. Set the fricassée aside. ", "For the monkfish, dust the fish in the flour. Heat a dash of oil and fry the fish on both sides until blonde in colour.", "For the pancakes, heat a non-stick pan with a little oil and add a ladle of the chickpea batter. Gently fry until crisp on one side, then flip and repeat on the other side. Remove the pancakes and set aside. Repeat to use up all the batter.", "To finish the fricassée, heat a little oil and a knob of butter. Fry the ceps until golden-brown. Season with salt and freshly ground black pepper. ", "To serve, stir the cooked ceps and chopped parsley into the fricassée. Place a pancake onto each of four plates and spoon the fricassée over the pancake. Drizzle some extra virgin olive oil over the top and sit the monkfish cheeks on top."]}, {"isVegetarian": false, "title": "Pan-fried pheasant breast with gamekeeper’s pie", "url": "www_bbc_co_uk_food_recipes_pan-fried_pheasant_71343", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 young whole pheasants (preferably hens)", "2 tbsp crushed sea salt", "340g/12oz goose fat", "2 garlic cloves, peeled, crushed", "1 tbsp garam masala", "1 cinnamon stick", "2 bay leaves", "½ tsp whole black peppercorns", "1 tbsp olive oil", "1 small onion, roughly chopped", "1 celery stalk, roughly chopped", "1 carrot, roughly chopped", "2 sprigs fresh thyme", "1 litre/1¾ pints hot chicken stock", "500g/1lb 2oz floury potatoes such as Maris Piper, peeled and cut into evenly sized pieces", "1 free-range egg yolk", "50g/2oz butter", "large pinch freshly grated nutmeg", "½ tsp white pepper", "2 tbsp double cream", "1 small onion, peeled, finely chopped", "1 celery stalk, trimmed, finely chopped", "1 carrot, peeled, finely chopped", "25g/¾oz plain flour", "200g/7oz swede, peeled, cut into 2cm/¾in dice", "200g/7oz carrots, peeled, cut into 2cm/¾in dice", "200g/7oz floury potatoes, such as Maris Piper, peeled, cut into 2cm/¾in dice", "½ vegetable stock cube", "25g/¾oz butter", "salt and freshly ground black pepper", "salt and freshly ground black pepper", "1 tbsp olive oil", "2 sprigs fresh thyme", "2 tbsp redcurrant jelly"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Cut the breasts and legs from the pheasants, reserving the carcasses for the stock. (You can ask your butcher to do this for you.)", "For the confit, place the pheasant legs into a non-metallic bowl and sprinkle all over with the salt. Set aside for at least 20 minutes and up to one hour.", "Brush the salt from the pheasant legs and transfer them to a small ovenproof dish. Pour over the goose fat and add the garlic, garam masala, cinnamon stick, bay leaves and peppercorns. Move the pheasant legs around in the fat to ensure that they are completely covered.", "Cover the dish with aluminium foil and cook the pheasant legs for 2-2½ hours, or until the meat is falling off the bone. Remove from the oven.", "Remove the pheasant legs from the goose fat, reserving the goose fat. When the pheasant legs are cool enough to handle, remove the meat from the bone, discarding any skin and sinew.", "While the pheasant legs are cooking, make the stock. For the stock, chop the reserved pheasant carcasses into smaller pieces using a large sharp knife or a meat cleaver.", "Heat the olive oil in a heavy-based saucepan over a medium heat.  Add the pheasant carcasses, onion, celery and carrot and fry for 3-5 minutes, or until browned. Add the thyme and chicken stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for one hour, skimming the foam that collects on the surface of the liquid at regular intervals.", "Remove the stock from the heat and strain through a fine sieve lined with a piece of muslin, reserving the strained liquid in a clean saucepan. Set aside.", "When the confit and stock have cooked, increase the oven temperature to 200C/400F/Gas 6.", "For the gamekeeper’s pie, bring a large pan of salted water to the boil, add the potatoes and boil for 15-20 minutes, or until tender.  Drain well and mash thoroughly.", "Beat the egg yolk, butter, nutmeg, white pepper and cream into the mashed potatoes until well combined. Set aside.", "Heat one tablespoon of the reserved goose fat in a frying pan over a medium heat. Add the onion, celery and carrot and cook for 2-3 minutes, or until the vegetables have softened but not coloured.", "Stir in the pheasant leg meat and sprinkle over the flour. Continue to cook for two minutes, then pour in 200ml/7fl oz of the strained stock. Bring to a simmer and continue to simmer for 3-4 minutes, then remove the pan from the heat and set aside to cool.", "Grease four muffin tins or large ramekins with more of the reserved goose fat.", "Using a piping bag or spoon, fill each muffin tin with mashed potato, leaving one-quarter of the mashed potato aside.", "Make a well in the middle of the mashed potato and fill with the pheasant mixture. Cover each pie with the remaining mashed potato. Cook in the oven for 30 minutes.", "Meanwhile, for the mash, place the swede, carrots and potatoes into a large saucepan. Add the stock cube and cover the pan contents with water. Bring the water to the boil, reduce the heat until the water is simmering and simmer for 15-20 minutes, or until the vegetables are tender. Drain well and mash thoroughly with the butter.  Season, to taste, with salt and freshly ground black pepper. Keep warm.", "For the pheasant breasts and redcurrant sauce, keep the oven temperature at 200C/400F/Gas 6. Season the pheasant breasts with salt and freshly ground black pepper and trim the wing bones of any excess meat or sinew.", "Heat the olive oil and one tablespoon of the reserved goose fat in a heavy-based, ovenproof frying pan. Add the thyme sprigs, then add the pheasant breasts, skin-side down. Fry for 2-3 minutes, or until the skin has browned, then turn and cook for a further two minutes on the other side.", "Transfer the pan to the oven and roast for 6-7 minutes, or until cooked to your liking. Remove the pan from the oven and transfer the pheasant breasts to a warm plate to rest.", "Return the pan to a medium to high heat. Add the remaining strained stock and bring to the boil, scraping the browned bits up from the bottom of the pan using a wooden spoon, to deglaze. Reduce the heat until the stock is simmering, then simmer until the volume of liquid has reduced by half.  Stir in the redcurrant jelly.", "To serve, carefully remove the gamekeeper’s pies from the muffin tins using a rounded knife. Place one into the centre of each of four plates. Spoon a quenelle of mash alongside, and place a pheasant breast on the other side. Spoon over the redcurrant sauce.  "]}, {"isVegetarian": false, "title": "Pan-fried pigeon breast, wild mushroom and beetroot salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_pigeon_breast_76424", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 raw baby beetroots, leaves on", "1 tbsp olive oil", "1 shallot, finely diced", "150g/5½oz wild mushrooms, cleaned and trimmed", "90g/3¼oz cooked chestnuts", "3 tbsp celery leaves", "75g/2¾oz mixed winter salad leaves", "1 tsp Dijon mustard", "2 tbsp sherry vinegar", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "1 large baking potato, cut into game chips", "vegetable oil, for frying", "4 pigeon breasts", "2 tbsp olive oil", "25g/1oz butter"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the salad, place the beetroot into a saucepan and cover with water. Bring to the boil then reduce the heat and simmer for 20-25 minutes until the beetroot is tender. Drain and cut the beetroot into quarters lengthways.", "Heat a frying pan until hot then add the oil and shallots and cook gently for two minutes until just softened. ", "Add the mushrooms and fry for two more minutes until the mushrooms are just tender. Tip the mixture into a large bowl then add the chestnuts, celery and salad leaves.", "Whisk the mustard, vinegar and extra virgin olive oil together and season with salt and freshly ground black pepper.", "Place the vegetable oil into deep-sided saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat a deep-fat fryer to 190C/375F.", "Carefully place the potato chips into the hot oil and deep fry for 1-2 minutes until golden-brown. Remove from the oil with a slotted spoon, drain on kitchen paper and season with salt and freshly ground black pepper. ", "For the pigeon, preheat the oven to 200C/400F/Gas 6. Season the pigeon breast with salt and freshly ground black pepper. ", "Heat an ovenproof frying pan until hot then add the olive oil and butter. Cook the pigeon breasts, skin side down, for one minute until golden-brown then turn and cook for another minute. Transfer the pan to the oven and roast for three minutes.", "Remove the pan from the oven and leave to rest for five minutes, basting occasionally with the pan juices.", "To serve, toss the beetroot quarters into the salad and dress with the dressing. Carve the pigeon into thick slices then add to the salad. At the very last minute, add the game chips and toss lightly to combine."]}, {"isVegetarian": false, "title": "Pan-fried plaice with crab and samphire", "url": "www_bbc_co_uk_food_recipes_pan-fried_plaice_with_57647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 large plaice fillets, skinned and pin boned", "salt, to season the fish", "3 tbsp plain flour", "75g/3oz butter", "115g/4oz samphire", "115g/4oz white crab meat, picked", "2 tbsp finely chopped capers", "2 tbsp finely chopped flatleaf parsley", "1 tbsp finely chopped chives", "1 tbsp finely chopped chervil", "2 hard-boiled eggs, finely chopped", "3-4 tbsp extra virgin olive oil", "½ lemon, juice only, to taste", "25g/1oz butter", "1 shallot, finely diced", "1 garlic clove, finely diced", "75g/3oz brown crab meat, passed through a fine sieve", "75ml/2½fl oz white wine", "3 tbsp mayonnaise"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Season the plaice with a little salt then dust with the flour.", "Heat a frying pan until hot, add half the butter and the plaice fillets, presentation side down and cook for 1- 1 ½ minutes until just cooked then turn over and cook for another 45 seconds.", "Remove from the pan and rest for a couple of minutes.", "Heat a frying pan until medium hot, add the remaining butter and the samphire and sauté for 2-3 minutes until just tender.", "For the white crab, place all the ingredients, except the olive oil and lemon juice, into a bowl and mix well to combine.", "Add enough olive oil so that the mixture just holds together if pressed lightly into a quenelle.", "Check the seasoning and add a little lemon juice if necessary.", "For the brown crab, heat a frying pan until medium hot, add the butter, shallots and garlic and sweat for 2-3 minutes until just softened.", "Add the sieved brown crab meat, whisk well to combine then add the white wine and bring to a simmer.", "Cook for a minute until just reduced then remove from the heat and whisk in the mayonnaise.", "Check the seasoning and add salt and freshly ground black pepper to taste.", "To serve, pile some samphire onto the centre of each serving plate then top with a plaice fillet.", "Form a quenelle of the white crab meat and set on top of the plaice. Drizzle the brown crab sauce around the edge of the dish."]}, {"isVegetarian": false, "title": "Pan-fried pork medallions with leeks and flageolet beans", "url": "www_bbc_co_uk_food_recipes_pan-fried_pork_31392", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 leeks, trimmed and cut into slices about 2cm/¾in thick ", "1 tbsp butter", "drizzle of oil ", "1 tsp vegetable bouillon powder", "1 x 400g/14oz can flageolet beans, drained and rinsed ", "1 large British pork tenderloin, cut into medallions", "sea salt and freshly ground black pepper ", "1 small knob of butter ", "drizzle of oil", "splash Calvados or other apple brandy", "5 tbsp apple juice", "3-4 sage leaves, finely shredded, plus extra whole leaves to garnish", "1 tbsp grainy Dijon mustard ", "1 garlic clove, crushed", "4 tbsp double cream"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the leeks and beans, in a shallow pan, gently fry the leeks in the butter and oil, adding a splash of water and the vegetable bouillon powder when they start to sizzle. Cover the pan with a lid and, when the leeks are nearly cooked (about 10 minutes), stir in the flageolet beans. Put the lid back on the pan and cook for another couple of minutes, giving the pan a good shake every now and then, until the beans are heated through and the Ieeks are tender.", "Meanwhile, for the pork, season the pork with salt and freshly ground black pepper. Heat the butter and oil in a large frying pan over a medium-high heat and, when the butter is foaming, add the medallions to the pan and brown for 2-3 minutes on each side (you may need to do this in batches to avoid overcrowding the pan). Transfer each batch of pork to a warm plate.", "Deglaze the pan by pouring in the Calvados followed by the apple juice and scraping up the burned bits from the bottom of the pan using a wooden spoon. Bring the mixture to the boil, let it bubble for a minute or so to reduce slightly, then stir in the shredded sage, mustard, garlic and cream. Return the pork medallions to the pan, along with any juices that have collected on the plate, and continue to cook in the sauce for another 2-3 minutes, or until the pork is cooked through.", "To serve, place a pile of leeks and beans onto each plate, arrange the pork medallions on top and spoon over the sauce. Garnish with the whole sage leaves."]}, {"isVegetarian": false, "title": "Pan-fried salmon with curried mussels", "url": "www_bbc_co_uk_food_recipes_pan-fried_salmon_with_85432", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz mussels", "1 tbsp olive oil", "1 onion, chopped", "small bunch parsley, chopped", "salt and freshly ground black pepper", "225ml/8fl oz white wine", "50g/1¾oz butter", "1 onion, diced", "1 medium carrot, diced", "1 celery stick, trimmed and diced", "1 tsp medium curry powder", "150ml/5fl oz double cream", "115g/4oz potatoes, peeled and diced", "1 tbsp chopped chives", "½ lemon, juice only", "4 x 125g/4½oz pieces salmon fillet, skin on", "2 tbsp vegetable oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Scrub the mussels, remove the beards and discard any mussels that remain open when tapped against the side of the sink.", "Heat the olive oil in a large, heavy-based pan that has a lid. Add the onion and the parsley and cook gently until the onion is soft but not brown. ", "Add the mussels, salt and freshly ground black pepper and the white wine. Bring the wine to the boil, put the lid on and shake the mussels about. Leave the pan on the heat and cook for 3-5 minutes or until the mussels are open. Discard any that remain closed.", "Strain the mussels and set aside, reserving the cooking liquor. Pour the liquor through a fine sieve into a clean jug to remove any grit.", "For the sauce, melt the butter in a saucepan over a low heat. Gently cook the onion, carrot and celery until soft. Stir in the curry powder and continue cooking for a few minutes. ", "Add 150ml/5fl oz of the cooking liquor from the mussels, stir well and cook for another minute. Stir in the double cream, bring back to the boil then add the diced potatoes and cook for about five minutes or until the potatoes have softened. ", "Remove the mussels from their shells, add them to the cream mixture and warm them through. Finish the sauce with the chopped chives and season with salt and freshly ground black pepper and squeeze of lemon juice.", "For the salmon, wash the fish and dry the skin thoroughly. With a sharp knife, cut diagonal slashes in the skin and season with salt and freshly ground black pepper.", "Heat a non-stick ovenproof frying pan over a medium heat then add the vegetable oil. Cook the salmon, skin-side down, for 4-5 minutes or until the skin is crisp, then turn the fish over and transfer the pan to the oven for 3-4 minutes or until the fish is just cooked through.", "To serve, place the curried mussels in a large bowl and arrange the salmon fillets on top. "]}, {"isVegetarian": false, "title": "Pan-fried scallops with kipper velouté and sea vegetables", "url": "www_bbc_co_uk_food_recipes_pan-fried_scallops_with_21619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 onion, finely chopped", "4 garlic cloves, finely chopped", "200g/7oz kipper fillets, bones removed", "200ml/7fl oz fish stock", "200ml/7fl oz double cream", "200ml/7fl oz whole milk", "1 tbsp unsalted butter", "4 large diver scallops, cleaned", "1 tsp salty fingers", "1 tsp sea purslane", "1 ploughman’s blood apple, peeled and finely chopped", "2 tbsp pecans, roughly chopped", "2 tbsp capers, to garnish", "few sprigs lovage, finely chopped, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat one tablespoon of oil in a saucepan over a medium heat and cook the onion and garlic until soft. Add the kippers and stock and bring to the boil. Reduce to a simmer and add the cream. Transfer to a food processor and blend until smooth and pourable. Add a little milk if the consistency is too thick.", "Heat the remaining oil in a frying pan with the butter. Pan-fry the scallops for 1–2 minutes on each side, or until cooked though and golden. ", "Divide the scallops between two warm plates and scatter over the salty fingers, sea purslane, apple and pecans. Garnish with the capers and lovage and serve. "]}, {"isVegetarian": false, "title": "Fried scallops with curried cauliflower and coconut sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_scallops_with_24163", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz butter", "1 tbsp mild curry powder", "1 tsp ground cumin", "1 tsp ground ginger", "½ cinnamon stick", "3 cloves", "1 tsp coriander seeds", "1 tsp fenugreek seeds", "1 tsp dried chilli flakes", "1 large cauliflower, root and outer leaves removed, cut into small florets", "1 litre/1¾ pints vegetable stock ", "400ml tin coconut milk", "1 lime leaf", "6 fresh mint leaves, thinly sliced", "8 scallops", "1 tsp olive oil", "squeeze lime juice ", "salt", "micro coriander shoots, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt 1 tablespoon of butter in a saucepan over a medium heat. When the butter is foaming, add the ground and whole spices and stir well. Fry for 1–2 minutes, or until fragrant.", "Add the cauliflower to the pan and enough of the stock to cover the florets. Bring to the boil, then reduce the heat and simmer for 20 minutes or until tender. Remove the pan from the heat and set aside to allow the cauliflower to cool in the stock.", "Meanwhile, put the coconut milk and lime leaf in a small saucepan and bring to the boil. Continue to boil until the volume of the liquid has reduced by half, removing any scum that floats to the surface during cooking. Discard the lime leaf and stir in the mint and a pinch of salt. ", "Just before serving, drain the cauliflower and discard the cinnamon stick and cloves. Heat half of the remaining butter in a frying pan over a medium heat. When the butter is foaming, add the cauliflower and fry until golden brown. ", "Heat the oil in a frying pan over a medium heat. Fry the scallops for 1½ minutes on each side. Add the butter and fry until golden. ", "To serve, scatter the cauliflower florets onto a serving dish and add the scallops. Drizzle with the coconut sauce, squeeze over the lime juice and garnish with the coriander shoots."]}, {"isVegetarian": false, "title": "Pan-fried sea bass with courgette ribbons and mussel soup", "url": "www_bbc_co_uk_food_recipes_pan-fried_sea_bass_with_04547", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 x 150g/5½oz sea bass fillets, trimmed", "salt", "3 tbsp olive oil", "75g/2¾oz butter", "1 onion, finely diced", "1 clove garlic, finely diced", "1 star anise", "250g/9oz mussels, washed and debearded", "125ml/4fl oz white wine", "250ml/9fl oz fish stock", "125ml/4fl oz double cream", "freshly ground black pepper", "2 courgettes, sliced vertically with a potato peeler"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sea bass, cut slashes into the skin side of the sea bass then season the other side with salt. ", "Heat a frying pan until hot, then add a little of the oil and some of the butter. Place the sea bass, skin side down, into the pan and cook for two minutes then turn over, cook for another two minutes then remove from the fish the pan.", "For the mussel soup, heat a saucepan until hot, add some more of the butter and oil, the onion, garlic and star anise and cook gently for one minute.", "Add the mussels and white wine and cover with a lid. Cook for 2-3 minutes or until the mussels have opened then remove the mussels with a slotted spoon and set them aside. ", "Add the fish stock to the pan and cook until reduced by one third then place the mixture in a food processor. Take care not to overfill the food processor,  hot liquid could spurt out the top.Try filling up to a third, and test to see how far the liquid goes up the sides. ", "Remove the mussels from their shells and add blend two thirds of them in the food processor with the reduced stock. Blend the mixture to a fine purée then return it to the pan and add the cream.", "Heat gently until it is warmed through and thick enough to coat the back of a spoon. Add the reserved mussels to the pan then season with salt and freshly ground black pepper.", "For the courgettes, heat a clean frying pan until hot, add the remaining butter and oil and stir-fry the courgette ribbons carefully, taking care not to break them up. Season with salt and freshly ground black pepper.", "To serve, pile the courgette ribbons into the centre of four soup plates. Top with the sea bass then spoon the soup around the edge. "]}, {"isVegetarian": false, "title": "Pan-fried sea bream, fennel salad, warm beetroot jelly and brown shrimp vinaigrette", "url": "www_bbc_co_uk_food_recipes_pan-fried_sea_bream_19398", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/11fl oz  beetroot juice", "50g/2oz caster sugar", "50ml/2fl oz port", "2 strips peeled orange zest", "1 star anise", "50ml/2fl oz red wine vinegar", "4 black peppercorns", "¼ tsp mustard seeds", "4g/⅛oz agar agar flakes", "1 fennel bulb, finely sliced", "1 lemon, juice only", "pinch sea salt flakes", "1 tbsp chopped fresh chives", "2 tbsp rapeseed oil", "sea salt and freshly ground black pepper", "4 oranges, 2 peeled, segmented and diced, 2 zested and juiced", "50ml/2fl oz white balsamic vinegar or sweet white wine vinegar", "200ml/7fl oz rapeseed oil", "30g/1¼oz small brown shrimps", "1 tbsp rapeseed oil", "4 sea bream fillets, pin bones removed", "sea salt", "½ lemon, juice only", "3 tbsp coriander cress"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the beetroot jelly, line a shallow oven tray with cling film.", "Put all the ingredients into a pan and bring to the boil. Remove the pan from the heat and set aside to infuse for 15 minutes. ", "Return the pan to the heat and whisk in the agar agar flakes. Bring to the boil, then remove the pan from the heat and strain through a sieve into the oven tray. Leave to chill in the fridge for 2-3 hours, or until set.", "For the fennel salad, mix the fennel, lemon juice and salt together in a bowl and set aside to marinate for 30 minutes.", "Squeeze the fennel to remove any excess liquid and then place into a clean bowl. Add the chives and rapeseed oil and stir until well combined. Season, to taste, with sea salt and freshly ground black pepper.", "For the orange vinaigrette, heat the orange juice and zest in a saucepan until boiling and cook until the mixture is syrupy. Whisk in the vinegar and rapeseed oil.", "Strain the vinaigrette into a clean saucepan, then stir in the diced orange and brown shrimps.  ", "For the sea bream, heat the oil in a frying pan and fry the sea bream fillets, skin-side down, for 2-3 minutes, or until crisp. Season with sea salt, then carefully turn the fish over and remove the pan from the heat. Set aside to rest for a few minutes then season, to taste, with sea salt and lemon juice.", "To serve, preheat the oven to 80C/180F/Gas ¼.", "Warm the beetroot jelly in the oven for 5-10 minutes.  ", "Heat the vinaigrette until warmed through.", "Spoon the fennel salad onto serving plates and top with the sea bream fillets. Spoon a little beetroot jelly on the side, then carefully spoon the dressing over and around the sea bream. Finish with a little coriander cress. "]}, {"isVegetarian": false, "title": "Pan-fried sirloin steak with red wine and snail sauce", "url": "www_bbc_co_uk_food_recipes_pan-fried_sirloin_steak_94594", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/2lb 4oz floury potatoes, such as Maris Piper, peeled and cut into chunks", "225g/8oz unsalted butter", "150ml/5fl oz double cream", "1 tbsp olive oil", "4 x 250g/9oz sirloin steaks, at room temperature", "4 banana shallots, 2 with skin on and cut in half lengthways, 2 peeled and finely chopped", "1 garlic clove, peeled and finely chopped", "25g/1oz caster sugar", "250ml/9fl oz red wine", "175ml/6fl oz veal stock (or chicken stock if not available)", "12 cooked braised snails (available from online specialists)", "2 tbsp finely chopped fresh tarragon leaves", "2 tbsp chopped flatleaf fresh parsley leaves", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180 Fan/Gas 6.", "Place the potatoes in a pan of cold, salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.", "Drain the potatoes and return to the pan, placing over a low heat for a couple of minutes to dry them slightly. Pass the potatoes through a ricer, then add 150g/5oz of the butter and all of the cream and beat to a very smooth mash, seasoning to taste with salt and freshly ground black pepper. Cover and keep warm.", "Season the steaks, to taste, with salt. Heat a large ovenproof frying pan over a high heat until very hot, then add 25g/1oz of the remaining butter, the olive oil, and the steaks. Add the halved shallots to the pan too, cut sides down. ", "Fry the steaks for 2 minutes on each side, basting with the melted butter. Do not move the shallots as the steaks cook. ", "Transfer the pan to the oven and continue to cook for 6-8 minutes (for medium), or longer if you prefer your steak more well done. ", "Transfer the pan contents to a warm plate and set aside to allow the meat to rest.", "Return the frying pan to the hob, wrapping the handle in a cloth so as not to burn yourself,  and heat over a medium heat. Add 25g/1oz more of the remaining butter, then fry the chopped shallots and garlic for 2-3 minutes, or until softened but not coloured. ", "Increase the heat to high, add the caster sugar and cook until melted and golden-brown. Pour in the wine and bring the mixture to the boil, then continue to boil until the volume of liquid has reduced by half.", "Add the stock, return the mixture to the boil, then reduce the heat and simmer for a further 2-3 minutes. Add the snails and cook until heated through.", "Whisk the remaining 25g/1oz of butter into the sauce, then season, to taste, with salt and freshly ground black pepper. Stir in the chopped herbs.", "To serve, place one steak onto each of four serving plates. Fan one of the halved shallots on top of each steak. Spoon over the red wine and snail sauce and place the mash alongside. "]}, {"isVegetarian": false, "title": "Trout with roasted beetroot and fennel salad", "url": "www_bbc_co_uk_food_recipes_pan-fried_trout_with_88316", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz baby beetroot, trimmed and washed", "2 tbsp olive oil", "1 large fennel, thinly sliced, fronds reserved for garnish", "salt and freshly ground black pepper", "6 tbsp olive oil", "2 tbsp white wine vinegar", "½ tbsp white wine vinegar", "2 tbsp extra virgin olive oil", "1 tsp fennel seeds, toasted and roughly crushed", "1 small orange, segmented", "1 small fennel bulb, finely shaved, fronds reserved for garnish", "1 courgette, shaved into thin ribbons", "8 trout fillets", "4 tbsp unsalted butter", "2 lemons, cut into wedges"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "Put the beetroots on a large piece of aluminium foil, drizzle the olive oil over and season with salt and pepper. Fold the foil over to make a parcel and roast for 1 hour, or until tender when pierced with a knife. Peel and halve the beetroots and set aside. ", "Meanwhile, for the dressing whisk the oil and vinegar in a bowl. Season with salt and pepper. ", "For the courgette, fennel and orange salad, in a medium-sized mixing bowl, whisk together the vinegar and oil. Season with sea salt and freshly ground black pepper and mix through the fennel seeds. Add the orange segments, shaved fennel and courgette and toss to coat. Allow to sit for at least 5 minutes before serving.", "Toss the fennel through the dressing. Don’t toss the beetroot otherwise it will stain the fennel.", "Just before serving, cook the trout. Use two large frying pans to ensure all the fish is cooked and ready at the same time. Divide the butter between the pans and melt over a medium heat. Gently fry the trout, flesh-side down first, for 2–3 minutes on each side until golden-brown and cooked through.", "Arrange the fennel in the centre of each serving plate and scatter the beetroot on top. Drizzle any remaining dressing over and then carefully lay 2 trout fillets, flesh-side up, on top. Roughly tear the fennel fronds over and serve with a wedge of lemon. Serve the courgette salad alongside."]}, {"isVegetarian": true, "title": "Pan-roast lime feta and chilli greens burrito", "url": "www_bbc_co_uk_food_recipes_pan-roast_lime_feta_and_27230", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pan-roast_lime_feta_and_27230_16x9.jpg", "ingredients": ["2 garlic cloves, sliced ", "1 red chilli, sliced", "2 tsp coconut oil", "½ tsp smoked paprika", "400g tin borlotti beans, undrained", "2 handfuls cherry tomatoes, roughly chopped", "2 unwaxed limes, grated zest and juice", "a small bunch fresh coriander, chopped", "2 ripe avocados, stone removed", "200g/7oz feta cheese or firm tofu", "2 large pinches red chilli flakes", "200g/7oz spring greens, stems removed and shredded", "a few sprigs fresh oregano, leaves only", "4 large wholemeal or seeded tortillas"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Put the garlic and chilli in a medium frying pan with a little coconut oil. Cook until starting to brown, then add the smoked paprika, borlotti beans with their liquid and the juice of one lime and let it blip away for 10 minutes to heat through.", "Mix the tomatoes with the juice of half a lime and the coriander. Mash the avocados with the juice of the other lime half. ", "Sprinkle the zest of one lime over the feta or tofu and scatter over a couple of large pinches of chilli flakes. Put the remaining coconut oil into a large frying pan and fry the feta or tofu for 3 minutes each side, until just brown, being careful not to move it too much otherwise it will break up.", "Once the feta or tofu is browned on both sides, remove and keep warm. Add the spring greens and oregano to the same pan, with a little more oil if needed, and add the remaining lime zest, another good pinch of chilli flakes and 2 tablespoons water. Cook until the water has evaporated and the greens are starting to crisp.", "Serve with tortillas. "]}, {"isVegetarian": false, "title": "Pan-roasted fillet of beef with lobster ravioli and spring vegetables", "url": "www_bbc_co_uk_food_recipes_pan-roasted_fillet_of_55369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz salmon fillet", "1 garlic clove ", "2 egg whites", "400ml/14fl oz double cream", "salt, to taste", "1 packet wonton wrappers", "1 cooked lobster tail, meat sliced into small, wafer thin slices using a sharp knife", "50g/2oz watercress", "8 baby carrots, cleaned, peeled and trimmed", "8 baby leeks, cleaned and trimmed                ", "8 baby turnips, cleaned, peeled and trimmed", "200g/7oz fresh peas", "1 bunch asparagus                          ", "1 x 800g/1lb 12¼oz beef fillet, preferably Jersey beef, fully trimmed", "1 tbsp vegetable oil", "salt and freshly ground black pepper", "4 cooked lobster claws, cracked, meat removed and sliced into small, wafer thin slices using a sharp knife", "1 packet Shimeji mushrooms (available from some larger supermarkets and Japanese grocers)", "25g/1oz butter", "200g/7oz fresh spinach", "300ml/11fl oz beef jus (available from some supermarkets and butchers), to serve "], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the lobster ravioli, blend the salmon and garlic in a food processor until smooth.", "Add the egg whites to the blended salmon a little at a time, blending after each addition. ", "Add the double cream to the salmon and egg mixture in a thin stream, blending all the time, until all of the cream has been incorporated into the mixture. Season, to taste, with salt.", "Transfer the salmon mixture to a bowl, cover, and chill in the fridge until firm, about 30 minutes.", "Meanwhile, for the spring vegetables, bring a large pan of salted water to the boil, then add the carrots, leeks, turnips, peas, asparagus and mushrooms and boil for three minutes. (If you don’t have a pan large enough to hold all of the vegetables, divide them among several pans.)", "Drain the vegetables, then plunge them into ice-cold water to refresh. When the vegetables are cold, drain again, then set aside until needed.", "When the salmon has chilled, make the ravioli. Using a small teaspoon (or a piping bag), place a marble-sized amount of the chilled salmon mixture into the centre of one of the wonton wrappers. ", "Repeat the process until half of the wonton wrappers and all of the salmon mixture have been used up.", "Place one slice of the cooked lobster and one watercress leaf on top of each portion of salmon mixture. ", "One by one, brush the edges of one side of each of the remaining wonton wrappers with a little cold water. Place it, moistened-side down, on top of the prepared ravioli, pressing down at the edges to seal the two wonton wrappers together. Trim away any excess using a sharp knife.", "Repeat the process with the remaining wonton wrappers to create ravioli. Cover the ravioli with clingfilm and set aside.", "For the beef, preheat the oven to 180C/350F/Gas 4.", "Roll the beef fillet tightly in heatproof cling film (see tip below) to form a perfect cylindrical shape, then – with the cling film still on – slice the fillet into four equal portions. Season both sides of each fillet slice with salt.", "Heat an ovenproof frying pan over a medium to high heat, then add the oil. When the oil is hot, fry the fillets for 20-30 seconds on each side, or until browned on both sides.", "Transfer the pan to the oven and continue to cook the beef fillets for four minutes (for medium-rare), or until cooked to your liking. ", "Remove the beef fillets from the pan and remove the cling film from each. Return the pan to the heat and fry the parts of the beef that were wrapped in cling film, turning regularly, until browned all the way around.", "Set the beef fillets aside to rest for 5-10 minutes. Keep warm.", "Add the mushrooms and lobster claws to the pan that the beef was cooked in and fry for 1-2 minutes, or until warmed through.", "Meanwhile, for the spinach, heat the butter in a frying pan over a low to medium heat. When the butter has melted, add the spinach and fry, stirring constantly, until wilted. Remove from the heat and keep warm.", "Bring two large pans of salted water to the boil, then reduce the heat until the water is simmering. ", "Add the spring vegetables to one pan and the ravioli to the other (in batches if necessary). Simmer for 4-5 minutes, or until the vegetables are cooked to your liking and the ravioli are cooked through. Drain well.", "To serve, divide the spring vegetables equally among four serving bowls. Spoon over some of the fried mushrooms. Place one fillet of beef on top of each portion. Rest one lobster claw on top of each fillet. Divide the ravioli among the four dishes, placing them on top of the beef and lobster. Drizzle over some of the hot beef jus."]}, {"isVegetarian": false, "title": "Pan-roasted guinea fowl with truffles and leeks", "url": "www_bbc_co_uk_food_recipes_pan-roasted_guinea_fowl_19879", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 breasts guinea fowl (or chicken if you prefer), skin on", "2 small black winter truffles, thinly sliced", "sea salt and freshly ground black pepper", "4 tbsp olive oil", "1 leek or 3 baby leeks, green parts only, thinly sliced", "300g/11oz small new potatoes, cut into 5mm thick rounds", "100g/3½oz pancetta, thinly sliced", "2 chervil or flat-leaf parsley sprigs, roughly chopped", "75g/2½oz butter"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Slit the skin of the guinea fowl breasts and place three thin slices of truffle underneath. Fold the skin back over the breast and season both sides with salt and pepper. ", "Cut the remaining truffle slices into thin julienne strips and set aside.", "Heat two tablespoons of the oil in an ovenproof frying pan over a medium heat. Add the guinea fowl, skin-side down, and cook for 2-3 minutes, or until the skin is golden-brown. Make sure the pan is not too hot so that the skin does not shrink back too much. ", "Turn the guinea fowl over and cook for a further minute, then place in the oven for eight minutes. When cooked, remove the guinea fowl from the oven. Set aside and keep warm.", "While the guinea fowl is in the oven, heat two pans of salted water until boiling, drop the leeks in one and cook for one minute. Drain, refresh in ice-cold water and drain once more. ", "Put the potatoes into the other pan of boiling water, cook for six minutes, then add the pancetta and cook for a further two minutes. Drain, refresh in ice-cold water and drain again. ", "Heat a frying pan over a medium heat, add the remaining olive oil, potatoes and pancetta and cook for 1-2 minutes, or until the potatoes are golden-brown.", "Add the leeks, a pinch of the reserved truffle and the chervil (or parsley) to the frying pan. Drain off any fat. Add 2-3 tablespoons of water and stir to make a sauce. ", "Add the butter and the remaining truffle and cook until the butter has melted. ", "To serve, cut each breast in half lengthways. Place some of the leek and potato mixture in the middle of each serving plate, put the guinea fowl on top and pour the truffle butter sauce over. "]}, {"isVegetarian": false, "title": "Pan-roasted potato tart with sardines and roasted tomatoes", "url": "www_bbc_co_uk_food_recipes_pan-roasted_potato_tart_26968", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 tomatoes on the vine, halved widthways", "4 tbsp olive oil", "sea salt and freshly ground black pepper", "4 sprigs thyme", "5 tbsp olive oil", "450g/1lb waxy potatoes, peeled and sliced thinly", "8 fresh sardines, scaled and filleted", "10 fresh oregano leaves ", "1 large handful basil leaves", "200ml/7floz light olive oil", "115g/4oz rocket leaves"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the tomatoes, preheat the oven to 150C/300F/Gas 2. Place the tomatoes, cut side up onto a roasting tray and drizzle with the olive oil.", "Season with sea salt and freshly ground black pepper then scatter the thyme over the top. Place in the oven and roast for 4-6 hours until slightly dried out. Turn the oven off and allow to cool, preferably overnight, in the oven.", "For the tart, preheat the oven to 200C/400F/Gas 6. Heat a medium sized (about 25cm/10in) ovenproof frying pan over a medium heat then add a drizzle of the olive oil.", "Arrange the sliced potatoes in overlapping circles so they cover the bottom of the pan. Season with sea salt and freshly ground black pepper then turn the heat down to low.", "Cook for about five minutes until the potatoes turn golden-brown at the edges and are translucent in the middle. Place the sardines on top in a fan shape, with the tails pointing towards the middle of the pan.", "Lay the oven-roasted tomatoes over the top then sprinkle with the oregano. Place in the oven and bake for 15-20 minutes until the potatoes are cooked and the top is golden brown. Remove the pan from the oven and let the tart cool slightly. ", "For the salad, bring a pan of salted water to the boil, add the basil, blanch for one minute then drain and refresh in iced water.", "Squeeze out the water and place the basil into a food processor with the olive oil. Blend for 1-2 minutes until the oil has turned vibrant green then strain through a fine sieve into a bowl. Toss the rocket leaves with a little of the oil. ", "To serve, place the tart onto a plate then pile the salad on top."]}, {"isVegetarian": false, "title": "Pan fried brill with sauce vierge", "url": "www_bbc_co_uk_food_recipes_pan_fried_brill_with_32299", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole brill", "butter, for frying", "120ml/4fl oz extra virgin olive oil", "1 lemon, juice only", "2 tomatoes, skins and seeds removed, flesh diced", "1 shallot, finely chopped", "1 small garlic clove, finely chopped", "3 tbsp chopped fresh tarragon", "2 tbsp chopped fresh dill", "2 tbsp chopped fresh chervil", "2 tbsp chopped fresh chives"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["To fillet the brill, place the brill onto a chopping board and using a flexible filleting knife cut down the centre line from the head toward the tail.", "Place the knife slightly on its side in the centre cut then press down onto the bone and carve the first fillet away, using the bones as guide to make sure all the flesh comes away from the fish. The first fillet is half of the top side of the fish.", "Repeat to take the second fillet off the top side of the fish.", "Turn the fish over and repeat on the underside to take of two more fillets, giving you four fillets in total.", "Skin the fillets then trim any frill off of each side. ", "Season the brill with salt and freshly ground black pepper.", "Heat a frying pan until hot, add the butter then add the brill and fry on each side for two minutes.", "Pour the olive oil in a non-reactive pan. Whisk in the lemon juice until well-combined. Add the chopped tomatoes, shallot and garlic.", "Heat the pan over a medium heat until the sauce vierge mixture is just warmed through. Add the tarragon, dill, chervil and chives and season to taste, with salt and freshly ground black pepper. Set aside.", "To serve, place the brill onto the plate then spoon the sauce vierge over the top."]}, {"isVegetarian": false, "title": "Pan fried calf’s liver with wilted spinach, capers and lemon zest confit", "url": "www_bbc_co_uk_food_recipes_pan_fried_calfs_liver_84839", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 lemon, zest removed and cut into thin strips", "1 tbsp caster sugar", "2 x 250g/9oz thick slices best-quality calf’s liver ", "100g/3½oz pig’s caul fat, ready to use", "2 fresh bay leaves", "100g/3½oz butter", "2 tbsp sunflower oil", "200g/7oz spinach leaves, washed", "1 garlic clove, peeled and pricked with a fork", "sea salt and freshly ground pepper", "1 tbsp honey", "1 tbsp nonpareille capers, rinsed", "1 small handful fresh parsley, chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Set a small pan of boiling water over a medium heat and add the strips of lemon zest. Boil for 2 minutes, then drain and repeat (this will reduce the bitterness of the lemon zest).", "Add the sugar and blanched zest back to the pan and just cover with water. Cook slowly for about 12 minutes, or until the strips of zest are shiny and don’t stick to each other. Remove from heat and set aside on a plate.", "Pat dry the calf’s liver and pig caul using kitchen paper.", "Plunge the bay leaves into boiling water and refresh in ice-cold water. ", "Make a two small incisions in each slice of liver. Slice the bay leaves in half and push into the incisions. Season with pepper, then wrap in pig cauls.", "Place an ovenproof non-stick pan over a medium-high heat, add a knob of butter and a drizzle of sunflower oil. When the butter is foaming, add the liver and fry all over until golden-brown. ", "Place the liver in the oven for five minutes, or until cooked to your liking (preferably the liver should be pink/medium as it will be dry if overcooked). Remove from the pan and leave to rest in a warm place. Reserve the pan for cooking the capers later.", "Place another pan over a medium heat. Heat a knob of butter and, when foaming, add the spinach and garlic. Season with salt and pepper. When the spinach has wilted, remove from the pan and keep warm until ready to serve.", "In the pan used to cook the liver, warm the honey, capers and the remaining butter. When the butter is melted and starting to brown, add the chopped parsley. ", "Serve the liver immediately with the spinach on the side. Sprinkle with the lemon zest and drizzle over the caper butter."]}, {"isVegetarian": false, "title": "Calves’ liver with mash potato, cavolo nero, wild garlic and Maderia reduction", "url": "www_bbc_co_uk_food_recipes_pan_fried_calves_liver_39817", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz butter", "150g/5½oz streaky bacon lardons", "1 banana shallot, thinly sliced", "110ml/3½fl oz Madeira wine", "175ml/6fl oz beef stock", "salt and freshly ground black pepper", "2 tbsp finely chopped fresh chervil", "300g/11oz King Edward potatoes, peeled and cut into chunks", "50g/1¾oz butter", "110ml/3½fl oz double cream", "4 x 150g/5½oz slices calves' livers, trimmed", "salt and freshly ground black pepper", "50g/1¾oz butter", "50g/1¾oz unsalted butter", "1 head cavolo nero", "10g wild garlic"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the Madeira reduction, heat a frying pan over a medium heat and add the butter. When the butter is foaming, add the lardons and shallot. Fry for 3-4 minutes, or until the lardons and shallots are golden-brown. ", "Add the Madeira and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight. When the flame has gone out, cook until the liquid has reduced in volume by three-quarters.", "Add the beef stock, stirring well, and cook for 3-4 minutes, or until reduced in volume by half. Then season, to taste, with salt and freshly ground black pepper. Stir in the chervil.", "For the mash potatoes, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain.", "Push the potato through a potato ricer into a saucepan. Alternatively, mash with a potato masher, but the finish will be less smooth. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper. Place in a piping bag and set aside.", "For the calves’ liver, season the livers, to taste, with salt and freshly ground black pepper. ", "Heat a large frying pan over a high heat and the butter. When the butter is foaming, add the livers and fry on both sides for 1-2 minutes, or until golden-brown all over but still slightly pink in the middle. Remove from the pan and set aside to rest. ", "For the cavolo nero and wild garlic, add the butter to a hot frying pan and, once hot, add the cavelo nero and cook for a minute. Add the wild garlic and cook for a further two minutes, then season with salt and pepper. ", "To serve, pipe the mash into four shallow bowls and place the liver and cavolo nero and garlic by the side, and pour over the sauce."]}, {"isVegetarian": false, "title": "Pan-fried cod with beurre noisette, griddled baby leeks and a red wine reduction", "url": "www_bbc_co_uk_food_recipes_pan_fried_cod_with_73108", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110ml/4fl oz red wine vinegar", "110g/4oz caster sugar", "12 baby leeks", "2 tbsp rapeseed oil", "salt and black pepper", "110g/4oz unsalted butter", "4 x 150-200g/5½-7oz cod fillets, skin on", "2 tbsp baby capers", "½ lemon, juice only", "2 tbsp finely chopped fresh parsley"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the red wine reduction, put the red wine vinegar, sugar and 110ml/4fl oz water into a saucepan and cook until reduced to a syrup consistency.", "For the griddled baby leeks, bring a pan of salted water to the boil, add the leeks and cook until just tender, then drain and pat dry. Heat a griddle pan until hot, toss the leeks in a little oil, salt and black pepper and char on each side until scorched.", "For the cod with beurre noisette and capers, preheat the oven to 220C/425F/Gas 7.", "Heat a knob of butter in a frying pan over a medium-high heat. When the butter is foaming, add the cod and fry for 1-2 minutes on each side. Transfer to the oven to finish cooking (2-3 minutes).", "Add the remaining butter and, once brown, add the capers and lemon juice.", "To serve, put the leeks in the centre of the plate and place the cod on top. Pour the capers and red wine reduction over and around the fish. Garnish with chopped parsley."]}, {"isVegetarian": false, "title": "Pan fried halibut with truffle poached egg, hollandaise and cavalo nero", "url": "www_bbc_co_uk_food_recipes_pan_fried_halibut_with_48265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 free-range eggs", "1 truffle", "200g/7oz basmati rice", "4 x 200g/7oz halibut fillets, pin boned", "salt", "75g/3oz butter", "1 tbsp light olive oil", "2 tbsp white wine vinegar", "350g/13oz cavalo nero, picked", "125g/4½oz butter, melted", "2 tsp lemon juice", "2 tsp white wine vinegar", "2 free-range eggs, yolks only", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Place the whole eggs, unbroken, with the truffle and basmati into a bowl and leave for at least 24 hours for the truffle to infuse through the shells into the eggs. (The basmati is to absorb any moisture. It’s not cooked in this recipe, but can be kept and cooked later.)", "Season the halibut with a little salt.", "Heat a frying pan until medium hot, add a little butter and the olive oil. Cook the halibut, skin side down, over a medium heat for four minutes until the flesh has turned opaque.", "Flip over and cook for another minute then remove from the heat and rest in the pan for a couple of minutes.", "Bring a pan of salted water to the boil and add the vinegar. Whisk the water to create a whirlpool and once settled, crack an egg in. Simmer for 2-3 minutes, remove the poached egg carefully with a slotted spoon and place on a plate to drain. Repeat the process with the remaining eggs.", "Heat another frying pan with the remaining butter and heat until foaming. Add the cavalo nero and 75ml/3floz water and cook for 2-3 minutes until just softened and the water and butter emulsified.", "For the hollandaise, place the butter in a saucepan and bring to a simmer.", "Place the lemon juice and vinegar in a separate small pan and heat until just boiling.", "Place the egg yolks in a food processor with a pinch of salt and turn on.", "With the motor running, add the hot lemon and vinegar. Then slowly add the melted butter until it is all incorporated. Remove from the processor and season with a little salt and black pepper.", "To serve, lift the skin off of the halibut and discard. Divide the cavalo nero between four plates and top with a fillet of halibut. Place the poached eggs on top, then spoon the hollandaise over and finish with a grating of fresh truffle."]}, {"isVegetarian": false, "title": "Pan fried monkfish with red wine sauce", "url": "www_bbc_co_uk_food_recipes_pan_fried_monkfish_with_45947", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 small monkfish fillets, fully trimmed, cut into 1cm/½in thick escalopes", "pinch salt", "125g/4½oz unsalted butter", "1 tbsp olive oil", "50ml/2fl oz good red wine", "50ml/2fl oz red wine vinegar", "50g/2oz caster sugar", "1 shallot, finely diced", "1 garlic clove, peeled", "1 sprig fresh thyme"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Season the monkfish with a little salt.", "Heat a large frying pan until medium hot, add a knob of the butter and all the oil. Cook the monkfish on each side until just golden – about a minute either side.", "Remove the fish and rest on a plate covered in cling film.", "Place the red wine, vinegar, sugar, 50ml/2fl oz water and shallot into a saucepan and cook until reduced to a syrup.", "Heat a frying pan over a high heat and cook the remaining butter, thyme and whole garlic clove until a nut-brown colour.", "Mix the red wine syrup and butter together – there should be double the quantity of butter to red wine – check the seasoning, then remove the garlic clove.", "To serve, place the monkfish onto plates then spoon the red wine dressing over the top."]}, {"isVegetarian": false, "title": "Pan-fried red mullet with rosemary and a cabbage salad", "url": "www_bbc_co_uk_food_recipes_pan_fried_red_mullet_48324", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ small white cabbage, thinly sliced using a mandolin", "½ small red cabbage, thinly sliced using a mandolin", "3 carrots, thickly grated", "small bunch white grapes, preferably sultana grapes, halved", "handful fresh mint, roughly chopped", "salt, to taste", "sugar, to taste", "drizzle white wine vinegar (preferably aged such as Moscatel)", "4 x medium whole red mullet, scaled, gutted and washed in cold water", "extra virgin olive oil, preferably Greek, for frying", "1 bunch fresh rosemary", "dash white wine vinegar (preferably aged such as Moscatel)", "sea salt", "a little flour, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, place all the ingredients into a bowl and season to taste with salt, sugar and vinegar. Mix well to combine. ", "Heat a wide frying pan over a medium heat. When hot, add enough olive oil to cover the sides of the pan by about 1cm/½in.", "Dust each fish with salt and flour and carefully place into pan. Add the rosemary  and cook for 3–5 minutes or until golden-brown and crispy on one side, turn over and repeat until cooked through. Just before you remove the mullet, add a dash vinegar and turn off the heat.", "Divide the fish between four plates and serve with the cabbage salad."]}]