[{"isVegetarian": false, "title": "Goat koftas with a yoghurt, mint and lime dressing", "url": "www_bbc_co_uk_food_recipes_goat_koftas_with_a_89880", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["5 tbsp olive oil", "1 small onion, finely chopped ", "300g/10½oz minced goat", "2 garlic cloves, chopped ", "handful of mint, chopped", "handful of parsley, chopped", "25g/1oz toasted pine nuts  ", "1 tsp ground cinnamon", "1 tsp cumin", "pinch freshly grated nutmeg", "½ cucumber, peeled and diced", "2 tbsp chopped fresh mint", "300g/10½oz yoghurt ", "2 limes, juice only", "salt and freshly ground black pepper", "4 white pitta breads, warmed", "400g/14oz feta cheese or halloumi, broken into pieces"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a small frying pan and add 1 tablespoon of oil.  Once hot add the onion and cook until soft. Place all the kofta ingredients, apart from the oil, into a bowl and mix thoroughly. Shape into sausage shapes. ", "Heat a heavy flat griddle pan. Oil the koftas with the remaining oil and cook on the griddle for 6-7 minutes turning around constantly so they cook evenly.", "Mix all the dressing ingredients in a bowl and season to taste with salt and pepper.", "To serve, stuff the pitta bread with the cooked koftas, dressing and cheese and enjoy warm."]}, {"isVegetarian": false, "title": "Goat tagine with toasted nut couscous", "url": "www_bbc_co_uk_food_recipes_goat_tagine_with_toasted_74021", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tsp ground cumin", "1 tsp ground turmeric", "2 tsp ras-el-hanout spice mix", "½ tsp saffron strands", "4 tbsp vegetable oil", "600g/1lb 6oz goat meat (a mixture of shoulder, neck and leg), cut into large dice", "1 onion, finely chopped", "2 garlic cloves, chopped", "1 red chilli, stalk and seeds removed, chopped", "4cm/1½in fresh root ginger, unpeeled, finely grated", "1 cinnamon stick", "1 x 400g tin tinned tomatoes", "1 tbsp honey", "125g/4½oz ready-to-eat dried apricots, roughly chopped", "1 medium preserved lemon, skin only, roughly chopped", "sea salt and freshly ground black pepper", "50g/1¾oz pistachios, roughly chopped", "3 tbsp roughly chopped fresh coriander leaves", "3 tbsp roughly chopped fresh flat leaf parsley", "3 tbsp roughly chopped fresh mint leaves", "25g/1oz butter", "200g/7oz couscous", "50g/1¾oz pistachios, roughly chopped", "50g/1¾oz flaked toasted almonds", "50g/1¾oz pine nuts, toasted", "50g/1¾oz ready-to-eat apricots, roughly chopped", "1 preserved lemon, skin only, finely chopped", "3 tbsp roughly chopped fresh mint leaves", "3 tbsp roughly chopped fresh coriander root and leaves", "3 tbsp roughly chopped fresh flatleaf parsley", "1 lemon, juice only", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the tagine, mix together the cumin, turmeric, ras-el-hanout, saffron strands and 2 tablespoons of the vegetable oil until well combined. Add the goat meat to the marinade and mix to coat the meat, then set aside to marinate for as long as possible (chill in the fridge if marinating for more than 30 minutes).", "Heat the remaining oil in a large flameproof casserole over a medium to high heat. Fry the onion, garlic, chillies and ginger for 2-3 minutes, or until just softened. Add the marinated goat meat and fry for 2-3 minutes, or until browned on all sides. ", "Add the cinnamon stick, tinned tomatoes and honey and mix well. Pour in 200ml/7fl oz water and bring the mixture to the boil, then add the apricots and preserved lemon and mix well. Reduce the heat until the mixture is simmering, and simmer for 45-60 minutes, or until the goat is tender and the sauce has thickened, then season, to taste, with salt and freshly ground black pepper. ", "Just before serving, stir in the chopped pistachios and herbs.", "Meanwhile, for the couscous, heat the butter in a frying pan with a tight-fitting lid over a medium heat. When the butter is foaming, add the couscous and stir-fry until golden-brown all over.", "Pour in 400ml/14fl oz water, mix well, and remove the pan from the heat. Cover tightly with the lid or a sheet of aluminium foil and set aside to steam for 5 minutes. Fluff up the steamed couscous with a fork, then cover once more and steam for a further 5 minutes. Stir in the nuts, apricots, preserved lemon, herbs and lemon juice until well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, pile the toasted nut couscous into the centre of 4 serving plates, then ladle the tagine on top."]}, {"isVegetarian": false, "title": "Goat and sweetcorn curry with chickpea flatbread", "url": "www_bbc_co_uk_food_recipes_goatandsweetcorncurr_93827", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg/1lb 2oz shoulder of goat, bones removed, meat cut into 2.5cm/1in cubes", "300g/10½oz plain yoghurt", "2 tsp ground coriander", "1 tsp ground turmeric", "2 tsp salt", "1 onion, peeled, finely chopped", "5 garlic cloves, peeled, left whole", "6 green chillies", "50g/2oz ghee", "1 tsp cumin seeds", "5 green cardamom pods, lightly crushed", "4 black cardamom pods, lightly crushed", "10 whole cloves", "2 bay leaves", "750ml/1 pint 7fl oz lamb stock", "450g/1lb canned sweetcorn, drained, chopped", "300g/10½oz gram flour", "200g/7oz plain flour", "15g/½oz salt", "1cm/½in root ginger, peeled, finely chopped", "2 green chillies, finely chopped", "1 tbsp finely chopped fresh coriander", "1 tsp ajwain (carom) seeds", "½ tsp black onion seeds", "½ tsp ground turmeric", "2 tbsp vegetable oil", "200ml/7fl oz water", "1 red onion, peeled, finely chopped", "1 spring onion, trimmed, finely chopped", "3 tsp ghee", "1 lemon, juice only", "2 tbsp chopped fresh coriander"], "serves": "Serves 4-6", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["For the goat and sweetcorn curry, mix together the goat meat, yoghurt, coriander, turmeric and salt in a large bowl. Cover and set aside to marinate for one hour.", "Meanwhile, for the chickpea bread, mix together the gram flour and plain flour in a large bowl until well combined.", "Add the salt, ginger, chillies, coriander, ajwain seeds, black onion seeds and ground turmeric and mix until well combined.", "Make a well in the centre of the dry ingredients. Gradually add the oil and water, stirring well, until the mixture comes together as a dough (you may not need to use all of the water). Cover the dough with a damp tea towel and set aside to rest for 15-20 minutes.", "When the goat meat has marinated, continue with the goat and sweetcorn curry. Blend the onion, garlic and chillies to a smooth paste in a food processor, then set aside.", "When the goat meat has marinated, heat the ghee in a heavy-based frying pan over a medium heat. Add the cumin seeds, green and black cardamom pods, cloves and bay leaves and fry until the spices begin to crackle and pop and smell fragrant. (CAUTION: Popping seeds can be dangerous. Cover the pan with a lid and keep away from your eyes and face.) ", "Add the marinated goat meat to the pan and fry for 3-4 minutes, or until browned on all sides. Add the onion, garlic and chilli paste, stir well and continue to cook for 2-3 minutes.", "Reduce the heat slightly and pour in the lamb stock. Bring the liquid to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 30 minutes, or until the goat is tender.", "Add the chopped sweetcorn and continue to simmer gently for 8-10 minutes, stirring continuously, until the sweetcorn starts to break down.", "Meanwhile, divide the dough for the chickpea bread into 8 pieces and roll each into a ball. Flatten each ball slightly between the palms of your hands, and top with some of the chopped red onion and spring onion. ", "Roll the dough balls out onto a lightly floured work surface to a diameter of 20cm/8in.", "Heat a large frying pan over a medium to high heat. When the pan is hot, add one of the chickpea bread discs and cook for 3-4 minutes, then brush the uncooked uppermost side with a little ghee. Turn the flatbread over and continue to cook for a further 3-4 minutes, or until golden-brown on both sides. Brush the cooked uppermost side of the bread with a little more ghee. Repeat the process with the remaining chickpea breads. Keep the cooked chickpea breads warm while you cook the remaining bread discs.", "To serve, divide the goat and sweetcorn curry equally among four to six serving plates. Squeeze over a little lemon juice and sprinkle with fresh coriander. Serve with the warm chickpea bread."]}, {"isVegetarian": false, "title": "Grilled goats’ cheese and courgette with spring salad", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_78832", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large round courgettes, cut into 1cm/½in thick slices", "1 tbsp olive oil", "salt and freshly ground black pepper", "400g/14oz goats’ cheese, cut into 1cm/½in thick slices", "200g/7oz peas in the pod", "200g/7oz fresh broad beans, peeled", "12 spears asparagus, trimmed", "2 tbsp sherry vinegar", "1 tsp Dijon mustard", "6 tbsp extra virgin olive oil", "pinch caster sugar", "4 large radishes, very finely sliced", "1 banana shallot, very finely sliced into rings", "50g/2oz rocket leaves", "50g/2oz baby spinach leaves", "50g/2oz watercress, leaves picked", "1 punnet pea shoots"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to high.", "Heat a griddle pan until searing hot. Rub the courgette slices with the olive oil and season with salt and freshly ground black pepper.", "Place the courgettes onto the griddle and cook for a minute on each side until marked with griddle lines.", "Remove the courgettes from the griddle and top with a slice of the goats’ cheese.", "Place the courgette and goats' cheese under the grill and cook for 1-2 minutes until the cheese has melted and turned light golden-brown.", "Meanwhile, bring a pan of salted water to the boil, add the peas, broad beans and asparagus and cook for two minutes until just tender. Drain and set aside.", "Whisk the sherry vinegar, Dijon mustard and extra virgin olive oil together with a pinch of salt, pepper and sugar.", "To serve, place the radishes, shallot rings, rocket, spinach and watercress leaves in a bowl and toss to combine.", "Gently open the pea pods, leaving them half open then add along with the broad beans and asparagus, then toss lightly once more.", "Lay the salad onto the plate, then carefully place a couple of pieces of courgette on top and serve immediately."]}, {"isVegetarian": true, "title": "Goats' cheese and chive soufflé", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_chive_87246", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300ml/10fl oz full-fat milk", "1 onion, quartered ", "1 bay leaf", "1 small bunch thyme", "300g/10oz goats’ cheese", "50g/2oz butter", "50g/2oz plain flour", "4 free-range eggs, separated", "3 tbsp finely snipped chives", "10g/¼oz finely grated Parmesan", "sea salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cut a 42cm/16in piece of baking parchment in half lengthways. Fold one half in half again and tie around a 13cm/5in soufflé dish using kitchen string. Lift the paper so it creates a collar that rises around 5cm higher than the dish. Butter the inside of the soufflé dish and the paper generously.", "Put the milk in a small non-stick pan and add the onion, bay and thyme. Bring to a gentle simmer then remove from the heat and set aside to infuse for 15 minutes. ", "Preheat the oven to 220C/425F/Gas 7.", "Place a baking tray in the oven to heat. Strain the flavoured milk through a fine sieve into a jug. Cut the rind off the goats' cheese and cut the cheese into 2cm/¾in pieces.  (You should end up with 200g/7oz cheese.)", "Melt the butter in a heavy-based saucepan over a low heat. Stir in the flour, cook for a few seconds then gradually start adding the milk, a little at a time, stirring well between each addition. When the sauce is smooth and very thick, continue to cook for a further two minutes, stirring constantly then remove from the heat and stir in half the goats' cheese. ", "Whisk the egg yolks lightly and stir into the milk mixture until smooth. Season to taste with sea salt and freshly ground black pepper. Pour into a large mixing bowl and cover the surface with a sheet of cling film to prevent a skin forming.", "Whisk the egg whites with a pinch of salt until stiff but not dry. They are ready when you can turn the bowl upside down without them sliding out. ", "Stir the chives into the cheese sauce. Fold in the remaining cheese. Fold in a large spoonful of the egg white until combined, then fold in the remainder.", "Pour the mixture slowly into the prepared soufflé dish. Sprinkle with the parmesan and freshly ground black pepper. (Keep the parmesan towards the centre of the soufflé so it doesn’t melt and hinder the rise by sticking to the paper.)", "Bake on the preheated baking tray in the oven for 23-25 minutes or until golden-brown and risen. Remove from the oven, remove the string and serve the soufflé immediately."]}, {"isVegetarian": false, "title": "Goats’ cheese and chicken layered loaf", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_mixed_95623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60g/2¼oz basil leaves", "50g/1¾oz toasted pine nuts", "50g/1¾oz parmesan, grated", "2 garlic cloves, chopped", "75-125ml/2½-4fl oz extra virgin olive oil", "2 courgettes, sliced lengthways", "1 yellow courgette, sliced lengthways", "2 tbsp olive oil", "2 chicken breasts, cooked and cut into strips", "1 large red onion, sliced", "100g/3½oz sundried tomatoes", "1 large round loaf of bread, 23cm/9in wide", "200g/7oz goats’ cheese, sliced", "3 plum tomatoes, thinly sliced", "handful of basil leaves", "2 bunches rocket", "2 Little Gem lettuce, leaves separated", "50g/1¾oz pecorino cheese shavings", "100g/3½oz black pitted olives", "3 tbsp olive oil", "1 tbsp sherry vinegar"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the pesto, place all the ingredients except the oil in a food processor and blend. Gradually add the oil until you have a thick paste, and set aside.", "For the layered loaf, heat a griddle pan to hot.", "Toss the courgettes in a little olive oil and place them on the hot griddle and cook for 2-3 minutes.", "Slice off the top of the loaf of bread. Hollow out the loaf by scooping out the soft bread, leaving a 3cm/1¼in thick wall of bread around the edges.", "Fill the hollow loaf with layers of the chicken, red onion, courgettes, cheese, tomatoes, basil and pesto, seasoning between each layer.", "Place the lid of the loaf back on and push down, you can wrap it in cling film and leave overnight or slice straight away.", "For the salad, place the rocket, Little Gem, cheese and olives in a bowl and mix.", "Whisk the oil and vinegar together in a small bowl to make a dressing.", "Just before serving, pour the dressing over the salad and mix.", "To serve, slice the filled loaf and place on a plate with the salad."]}, {"isVegetarian": false, "title": "Goats' cheese and onion tarts", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_onion_51943", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_and_onion_51943_16x9.jpg", "ingredients": ["small sprig fresh thyme, leaves only", "100g/4oz plain flour", "25g/1oz butter", "25g/1oz lard (or more butter for a vegetarian option)", "2 red onions, finely sliced", "25g/1oz butter", "25g/1oz soft brown sugar", "1 tbsp balsamic vinegar", "1-2 tbsp cassis", "salt and freshly ground black pepper", "175g/6oz goats’ cheese", "1 free-range egg yolk", "1-2 tbsp double cream", "2 tbsp olive oil", "2 tsp lemon juice", "handful rocket leaves"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, put the thyme leaves, flour, butter and lard into a food processor and mix on pulse setting until the mixture resembles breadcrumbs. Gradually add enough cold water (about 2-3 tablespoons) to form a soft dough. Wrap in cling film and leave in the fridge to chill for 30 minutes.", "For the red onion jam, cook all the ingredients over a very low heat in a frying pan, stirring occasionally so that they don't clump together. ", "Preheat the oven to 200C/390F/Gas 6 and place a sturdy baking tray in the oven. ", "Divide the pastry into four. Using a rolling pin, roll it out and line 4 x 10cm/4in loose-bottomed tart tins. Line the tins with greaseproof paper and baking beans. ", "Place the tins on the heated baking tray and cook for 10 minutes. Remove the beans and lining paper and return to the oven for five minutes. Leave to cool for few minutes.", "For the goats’ cheese, trim away any rind and crumble the cheese into a bowl. Mix with the egg yolk and a splash of cream. Season with salt and freshly ground black pepper.  ", "Divide the red onion jam among the tartlets and spoon the goats’ cheese mixture on top. Return to the oven for 7-8 minutes, or until the top is bubbling and tinged with brown.", " Pour oil and lemon juice into a bowl and season with plenty of salt and freshly ground black pepper. Add the leaves and toss gently to coat. ", "To serve, carefully remove the tarts from their tins and place on a serving plate. Top with the rocket salad and serve."]}, {"isVegetarian": true, "title": "Goats' cheese and shallot tarts", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_shallot_60881", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_and_shallot_60881_16x9.jpg", "ingredients": ["175g/6oz plain flour, plus extra for dusting", "100g/3½oz cold butter, cubed ", "1 free-range egg, beaten", "30g/1oz walnuts, roughly chopped", "salt and freshly ground black pepper", "1 tbsp oil", "500g/1lb 2oz banana shallots, thinly sliced", "2 tbsp balsamic vinegar", "1 tbsp light muscovado sugar ", "300g/10½oz soft goats' cheese", "2 free-range eggs, beaten", "2 tbsp chopped fresh parsley "], "serves": "Makes 8 tarts", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Put a large baking tray in the oven to heat up.", "To make the pastry, put the flour, butter and a little salt into a food processor and pulse until the mixture resembles breadcrumbs. Alternatively, place in a mixing bowl and rub the butter into the flour using your fingertips. Add the beaten egg and a tablespoon water and mix until a ball of dough is formed. ", "Lightly flour a work surface and roll out the dough thinly (about 3mm/⅛in thick). Sprinkle the chopped walnuts over the pastry. Cover with cling film and roll over the cling film to press the nuts into the pastry. Cut out 8 large circles using a pastry cutter or saucer as a guide and line the Yorkshire pudding tins. Place in the fridge to chill while you make the filling.", "Heat the oil in a lidded frying pan, add the shallots and cook over a high heat for 2 minutes, stirring frequently. Lower the heat, cover and cook for 10 minutes until soft. Add the vinegar and sugar and cook for 15 minutes, stirring every now and then, until the shallots are dark brown and caramelised. Set aside to cool.", "Put the goats' cheese, beaten eggs and half the parsley in a bowl. Season with salt and pepper and mix until smooth.", "Prick the bases of the chilled tart cases all over with a fork, then spoon in the shallot mixture. Pour the goats' cheese mixture over the shallots.", "Slide the tins onto the hot baking sheet and cook for 20 minutes, or until the pastry is crisp and the filling is just set and golden-brown. Sprinkle with the remaining chopped parsley and serve warm or cold."]}, {"isVegetarian": false, "title": "Goats' cheese, black olive and Parma ham pin-wheel palmiers", "url": "www_bbc_co_uk_food_recipes_goats_cheese_black_olive_33876", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_black_olive_33876_16x9.jpg", "ingredients": ["125g/4½oz plain flour, plus extra for dusting", "125g/4½oz strong white flour", "1 tsp dried thyme", "1¼ tsp salt", "225g/8oz salted butter, chilled ", "50g/1¾oz Parmesan, grated", "100g/3½oz pitted Kalamata olives", "12g/½oz capers", "¾ tsp anchovy paste", "4 tsp red wine vinegar", "1 small garlic clove ", "few sprigs fresh thyme ", "150g/5½oz soft goats’ cheese, rind removed ", "120g/4¼oz Parma ham "], "serves": "Makes 16 palmiers", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the pastry, put the flours, thyme and salt in a mixing bowl. Make a well in the middle and pour in 150ml/5fl oz water. Stir to combine, then knead for a minute until well combined. Wrap in cling film and refrigerate for 30 minutes. ", "Cut the butter in half horizontally. Place a piece between baking paper and roll out so it is 14cm/5½in wide and 13cm/5in deep. Return to the fridge while you roll out the pastry.", "Put the dough on a lightly floured work surface and roll into a rectangle approximately 15x45cm/6x18in. With a short side nearest you, put one piece of butter on the bottom third of pastry and fold over. Put the second piece of butter on top of the folded over section and bring the top section of the pastry over to cover butter. Pinch the edges together so the butter is sealed in the dough. Turn so that a short edge is facing you and roll out to a 15x40cm/6x16cm rectangle, fold into three (like a letter), wrap in cling film and refrigerate for 30 minutes.", "Put the dough on a lightly floured work surface, with short edge nearest to you roll out to 15x40cm/6x16in, fold the bottom third up and top third down. Give the dough a quarter turn and roll out and fold as before. Wrap in cling film and refrigerate for 30 minutes.  ", "With the short edge facing you, roll out and fold as before, turn a quarter turn and roll out, this time cover the dough with the grated Parmesan before folding. Wrap in cling film and refrigerate for 30 minutes. Repeat, but without sprinkling with Parmesan. ", "For the filling, first make a tapenade. Put the olives, capers, anchovy paste, vinegar, garlic and thyme in food processor and pulse until you have a fairly smooth paste.", "To finish, roll the dough out to a large rectangle and trim to make a neat rectangle approximately 30x24cm/12x9½in. Soften the goats’ cheese a little in a bowl by mashing with a fork. Add the tapenade and mix well. ", "Spread the filling over the pastry and arrange the Parma ham evenly over the top. Roll up the pastry tightly starting at a short edge until you reach the middle, then repeat on other side. Where the two rolls meet brush with a little water and gently press together to help them hold the shape. Cut into 1cm/½in thick slices, using a large serrated knife. Place well apart on greased baking trays and chill for 20 minutes.", "Preheat the oven to 200C/180C Fan/Gas 6.", "Bake for 20 minutes or until the pastry is crisp. If they are still uncooked in the middle, turn them over and return to the oven for a further 2–3 minutes. Remove from the oven and leave to cool on the tray before serving."]}, {"isVegetarian": true, "title": "Goats’ cheese and white peach salad with truffled mascarpone cream", "url": "www_bbc_co_uk_food_recipes_goats_cheese_and_white_91501", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz cobnuts, shelled and finely chopped", "50g/2oz breadcrumbs", "2 x 125g/4½oz Crottin de Chavignol goats’ cheese", "2 white peaches, halved, stones removed", "1 tbsp honey, plus extra for drizzling", "few shavings fresh black truffle", "150g/5½oz mascarpone", "100g/3½oz frisée (curly endive)", "100g/3½oz red chard", "alfalfa sprouts, to garnish"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the grill to medium-high heat.", "In a bowl, combine the chopped cobnuts with the breadcrumbs.", "Cut the goats’ cheeses on a diagonal in half and roll in the cobnut breadcrumbs.", "Place the halved peaches onto a baking tray and drizzle with honey. Grill until golden-brown.", "Meanwhile, grate a little black truffle into the mascarpone and mix until well combined. ", "Toss together the frisée with the red chard and divide among four serving plates. Place a slice of the goats’ cheese and half a peach on top of each plate. Drizzle a little more honey over, finish with a dollop of the truffled mascarpone and a sprinkle of alfalfa sprouts."]}, {"isVegetarian": false, "title": "Goats' cheese, butternut squash, pancetta and sage rotolo", "url": "www_bbc_co_uk_food_recipes_goats_cheese_butternut_19608", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_butternut_19608_16x9.jpg", "ingredients": ["1 free-range egg ", "4 free-range egg yolks", "180g/6oz 00 pasta flour, plus extra for dusting", "1 tbsp olive oil", "rapeseed oil, for frying", "200g/7oz pancetta, cut into 1cm/½in cubes", "1 small butternut squash, peeled and cut into 1cm/½in cubes", "1 red onion, finely chopped", "2 garlic cloves, finely chopped", "1 large red chilli, finely chopped   ", "2 tbsp finely chopped fresh sage ", "250g/9oz goats' cheese, rind removed", "salt and freshly ground black pepper", "100ml/3½fl oz double cream", "150g/5½oz young small spinach leaves, washed and drained", "150g/5½oz freshly podded peas, cooked and refreshed in cold water", "150g/5½oz freshly podded broad beans, cooked, peeled and refreshed in cold water", "½ lemon, juice only", "extra virgin rapeseed oil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 160C/140C Fan/Gas 3.", "To make the pasta, put all of the ingredients in a bowl and, using your hands, gently mix together until they form a dough. Wrap in cling film and refrigerate for at least 15 minutes.", "For the filling, heat a little oil in a non-stick frying pan and add the pancetta. Cook over a medium heat for 2-3 minutes, or until the pancetta fat starts to melt, and then add the squash. Cook for a further minute and then add the onion, garlic, chilli and sage. Cover the pan with a lid and cook for 8-10 minutes, or until the squash is tender. Drain any excess oil from the pan. Cover and refrigerate.", "Remove the pasta dough from the fridge and cut in half. Roll the dough into 2 sheets using a pasta machine. Flour a work surface and the rollers of the pasta machine. Flatten out the dough into a rectangle. Set the rollers to their widest setting. Roll the pasta through the rollers. Narrow the rollers by changing the machine setting by one notch, then pass the rolled pasta through the rollers again. Dust the rolled pasta with flour. Repeat the process until they've been passed through the narrowest setting on the machine.", " Blanch each sheet for 1 minute in boiling salted water, before refreshing in cold water. Remove from the water and pat dry using a tea towel.", "On a clean, flat surface lay out two large pieces of cling film next to each other with a short edge nearest you, overlapping each length so that the surface area is double that of the combined size of the two pasta sheets. Lay the pasta sheets on the cling film in the opposite direction, overlapping in the middle to make one large sheet.", "Combine the filling with the cheese and season with salt and pepper. Carefully spread the mixture evenly over the pasta, leaving a 2cm/1in gap at the bottom and a 4-5cm/1½-2in gap at the top. Using the cling film under the pasta to help you, roll the pasta up like a Swiss roll, keeping the roll tight. Once rolled up, wrap the cling film around the pasta and tuck the ends under the roll to seal. ", "Heat a non-stick pan over a medium heat with a little rapeseed oil. Carefully cut the pasta rotollo into four thick (3-4cm/1½-1¾in) slices, leaving the cling film on. Lightly flour the cut sides, remove the cling film and carefully put the pieces in the pan. Colour on each side until golden-brown then transfer to the oven for 5 minutes, to finish.", "For the cream sauce, in a medium saucepan, bring the cream to the boil then add the spinach, peas and broad beans. Season with salt, pepper and a squeeze of lemon juice. ", "Divide the cream sauce between four serving bowls and place the rotolo on top. Drizzle a little extra virgin rapeseed oil on top and serve."]}, {"isVegetarian": true, "title": "Goats’ cheese cheesecake with poached rhubarb", "url": "www_bbc_co_uk_food_recipes_goats_cheese_cheesecake_54122", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["175g/6oz digestive biscuits", "85g/3oz butter", "300g/10½oz soft goats’ cheese", "125g/4½oz runny honey, plus 4 tbsp to serve", "1 vanilla pod, seeds only", "½  tsp ground cinnamon ", "1 tsp mixed spice ", "pinch freshly ground nutmeg ", "175g/6oz crème fraîche", "3 free-range eggs, beaten", "700g/1lb 9oz rhubarb, cut into 3–4cm/1½in pieces", "400g/14oz caster sugar", "100g/3½oz walnuts, broken into pieces", "100g/3½oz hazelnuts, chopped"], "serves": "Serves 8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 170C/150C Fan/Gas 3½. Put the biscuits in a food processor and blitz to fine crumbs.", "Melt the butter in a small saucepan. Add the biscuit crumbs and mix. Tip into an 18–20cm/7–8in loose-bottomed tart tin and press down. Cover and put in the fridge.", "Put the goats’ cheese, honey, vanilla seeds, spices, crème fraîche and eggs in a large bowl and mix.", "Pour the mixture onto the biscuit base and smooth with a pallette knife. Bake for 40 minutes, or until the filling is set but there is still a bit of a wobble. Leave to cool completely before placing in the fridge for at least 4 hours.", "When you are ready to serve the cheesecake, preheat the oven to 160C/140C Fan/Gas 3. Toss the rhubarb with the sugar, cover with 400ml/14fl oz water and bake for 10 minutes.", "Heat a small frying pan over a medium heat and cook the honey and nuts for 2–3 minutes.", "Remove the cheesecake from the tin and cut into slices. Scatter the nuts over the top and serve with the poached rhubarb."]}, {"isVegetarian": true, "title": "Goats’ cheese on brioche with salt baked celeriac and red currant dressing", "url": "www_bbc_co_uk_food_recipes_goats_cheese_on_brioche_20753", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz redcurrant jelly", "250ml/9fl oz red wine vinegar", "4 cloves", "75g/2¾oz Dijon mustard", "500g/1lb 2oz fine sea salt", "3 free-range eggs, whites only", "1 medium celeriac", "200g/7oz soft goats’ cheese, crumbled", "50ml/2fl oz double cream", "salt and freshly ground black pepper", "4 slices brioche loaf, 1cm/½in thick", "110g/4oz firm goats’ cheese, crumbled", "1 handful frisée lettuce", "1 handful lambs lettuce", "1 tsp vinegar", "3 tsp olive oil", "½ lemon, juice only"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the dressing, place the redcurrant jelly, vinegar and cloves into a saucepan and cook until reduced in volume down to a glaze thick enough to coat the back of a spoon.", "Pass the mixture through a sieve into a clean bowl, whisk in the mustard then set aside.", "For the salad, preheat the oven to 200C/400F/Gas 6.", "Whisk the egg whites until soft peaks then fold in the salt.", "Place a spoonful onto a baking tray then place the celeriac on top and cover with the rest of the salt.", "Place in the oven and bake for 45 minutes then leave to rest for five minutes.", "Crack the egg coating and remove the celeriac, discarding the salt.", "Peel the celeriac and thinly slice then stamp out discs with a cutter and set aside.", "Place the crumbled goats’ cheese into a bowl with the double cream and whip until softened and combined.", "Season with a little salt and plenty of black pepper.", "Toast the brioche until coloured a light golden-brown.", "Mix the lettuce leaves with the firm goats’ cheese in a bowl.", "Whisk the vinegar, olive oil and lemon juice together then dress the salad leaves lightly with the dressing.", "To serve, place the discs of celeriac into the red currant dressing and toss to combine. Place a few discs on the centre of the plate.", "Top with the brioche toast and a quenelle of the cream and goats’ cheese mix.", "Finish with a little tower of salad and serve immediately."]}, {"isVegetarian": true, "title": "Goats’ cheese crumpets with mango jam", "url": "www_bbc_co_uk_food_recipes_goats_cheese_crumpets_25508", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½ oz soft goats’ cheese", "salt and freshly ground black pepper", "1 tbsp chopped fresh mint", "1 tsp chilli flakes", "1 free-range egg, beaten", "6 crumpets", "1 tbsp sesame seeds ", "1-2 tbsp honey ", "200g/7oz mango chutney", "1 papaya, peeled, seeds removed, flesh chopped", "1 tbsp freshly chopped mint", "½ orange, juice only", "1 tbsp chopped fresh coriander", "baby salad leaves to serve "], "serves": "6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to medium.", "Beat the goats' cheese with the salt and freshly ground black pepper in a bowl. Add the fresh mint, chilli flakes, and egg, and mix until well combined. ", "Toast the crumpets under the grill until golden-brown, then spread with the cheese mixture. Return the crumpets under the grill and cook until the cheese is bubbling and pale golden-brown. Remove from the grill, sprinkle with the sesame seeds, and drizzle over the honey. ", "Meanwhile for the jam, mix together the mango chutney, papaya, mint, orange juice and coriander until well combined. ", "Serve the crumpets on top of a baby leaf salad with the mango jam."]}, {"isVegetarian": true, "title": "Goats' cheese quenelles with pea, mint and radish salad", "url": "www_bbc_co_uk_food_recipes_goats_cheese_quenelles_85303", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_quenelles_85303_16x9.jpg", "ingredients": ["vegetable oil, for deep-frying", "500g/1lb 2oz goats’ cheese", "plain flour, for dusting", "1 free-range egg, beaten", "100g/3½oz breadcrumbs", "400g/14oz fresh peas", "50g/1¾oz pea shoots ", "3 breakfast radishes, thinly sliced on a mandoline", "handful of mint leaves, chopped", "2 lemons, zest and juice", "olive oil", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a deep-fat fryer to 180C/350F, or heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and goes brown when dropped into the oil. (Caution: Hot oil can be dangerous. Do not leave unattended.)", "Soften the goats’ cheese a little by beating it with a spoon. Shape it into quenelles using two tablespoons and roll them in flour.", "Dip them in the beaten egg and then roll them in breadcrumbs to coat.", "Deep fry for a few minutes or until the breadcrumbs are golden-brown.", "Remove from the oil using a slotted spoon and set aside to drain on kitchen paper.", "For the salad, cook the peas in a pan of boiling water for about 30 seconds, just enough to blanch them. (You can include a few whole pods too if you like.) Drain and put into a bowl of ice-cold water.", "Refresh the peashoots by dipping them in cold water. Drain them and put in a bowl along with the drained peas, radish, mint and lemon zest.", "In a jug, mix a little olive oil with a big squeeze of lemon juice and whisk together with salt and pepper to make a dressing.", "To serve, dress the salad and place the goats’ cheese quenelles on top."]}, {"isVegetarian": true, "title": "Goats’ cheese, peach and radicchio salad", "url": "www_bbc_co_uk_food_recipes_goats_cheese_peach_and_25629", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_peach_and_25629_16x9.jpg", "ingredients": ["½ red onion, thinly sliced", "4 heads radicchio, trimmed and cut into wedges, keeping the root on so it holds together", "2 peaches, de-stoned and cut into thin wedges", "handful green salad leaves, such as watercress or rocket", "1 tbsp toasted hazelnuts", "100g/3½oz  fresh goats’ cheese, crumbled into pieces", "1 small red chili, finely chopped", "handful fresh mint leaves", "1 tbsp olive oil", "½ tsp Dijon mustard", "¼ tsp honey", "1 tsp cider vinegar"], "serves": "Serves 4–6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the salad, place the red onion in a bowl of iced, salted water and leave for a couple of minutes to mellow the flavour. Drain and set aside. ", "Preheat a barbecue or grill to high and cook the radicchio and peach slices for 2–3 minutes on each side until they are slightly wilted and charred.", "To make the dressing, whisk all the ingredients together in a small bowl and set aside.", "To assemble, scatter the leaves, cooked radicchio, peaches, onion, hazelnuts and goats’ cheese over a large platter. Garnish with the chopped chilli and fresh mint leaves. Drizzle with the dressing just before serving. Serve with other barbecue dishes. "]}, {"isVegetarian": true, "title": "Goats’ cheese, pepper and thyme galettes with onion marmalade", "url": "www_bbc_co_uk_food_recipes_goats_cheese_pepper_and_18098", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "3 large onions, sliced", "1 tbsp sugar", "1 tbsp balsamic vinegar", "sea salt and freshly ground black pepper", "3 red peppers", "olive oil", "325g/11½oz all-butter puff pastry", "2 x 150g/5½oz tubs soft goats’ cheese", "2 tbsp fresh broad-leaf thyme", "1 egg, beaten"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat.", "To make the onion marmalade, heat the oil in a non-stick frying pan over a high heat. Add the onion and fry for a few minutes. Sprinkle in the sugar and vinegar and season with sea salt and freshly ground black pepper. Cover and lower the heat for about 20 minutes or until soft. If the mixture is looking wet, remove the lid and let the liquid evaporate. Set the marmalade aside to cool.", "For the galettes, cut each pepper in half, remove the stalk and seeds and lay cut side down on another baking tray. Drizzle with a little oil and roast in the oven for about 20 minutes or until the skins are black. Transfer to a plastic bag and seal. When cold, peel away the skin and slice into thin strips.", "Roll the pastry out thinly on a floured work surface into a rectangle and trim the edges. Cut the pastry in half and prick with a fork. Transfer to a large piece of greaseproof paper and spread the goats’ cheese onto each piece of pastry, leaving a boarder around the edge. Spoon over the onion marmalade, scatter over the thmye and arrange the pepper strips on top. ", "Brush the edge of the pastry with the beaten egg and bake in the oven for 20-25 minutes, or until the pastry is crisp. "]}, {"isVegetarian": true, "title": "Goats’ cheese ravioli, spiced cauliflower and quails’ eggs with a caper and sultana dressing", "url": "www_bbc_co_uk_food_recipes_goats_cheese_ravioli_25344", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 quails’ eggs", "500g/1lb 2oz ‘00’ flour, plus extra for dusting", "4 free-range egg yolks", "2 tbsp olive oil, plus extra for cooking", "1 free-range egg, beaten", "225g/8oz soft goats’ cheese, broken up", "3 tbsp olive oil", "pinch ground cumin", "pinch ground turmeric", "1 head cauliflower, broken into florets", "1 head purple cauliflower, broken into florets", "1 thyme sprig", "1 bay leaf", "salt and freshly ground black pepper ", "1 tsp Dijon mustard", "1 tsp white wine vinegar", "3 tbsp extra virgin rapeseed oil", "8 capers, roughly chopped", "20g/¾oz golden raisins, soaked in warm water and drained", "½ tbsp finely chopped flatleaf parsley.", "nasturtium leaves and flowers, to garnish", "watercress leaves, to garnish"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Cook the quails' eggs in boiling, salted water for 3 minutes. Plunge into a bowl of iced water for 3 minutes. Peel and set aside.", "To make the ravioli, put the flour on a work surface and make a well in the centre. Add the egg yolks and oil to the well and gradually incorporate the flour to make a dough. Knead until smooth and wrap in cling film. Allow to rest for 1 hour.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To make the cauliflower, mix the oil with the cumin, turmeric, salt and pepper, then rub the mixture all over the cauliflower. Place the florets on a large square piece of kitchen foil. Add the thyme, bay and 50ml/2fl oz water.", "Fold the foil into a parcel by folding the long lengths together and scrunching up the ends. Bake for 20–25 minutes, or until the cauliflower is just cooked. Open the parcel and allow the cauliflower to cool, reserving the cooking juices.", "Return to the ravioli. On a lightly floured work surface, separate the pasta into two pieces and roll each piece into a very thin rectangle. Brush one rectangle with the beaten egg.", "Scatter the cheese over the egg-coated pasta sheet in four piles, allowing equal space between each pile. Cover with the second sheet of pasta and press down the edges and between the cheese to seal. Cut out four ravioli using a fluted cutter.", "Bring a pan of salted water with a dash of oil to the boil and cook the ravioli for 2 minutes, until all dente. ", "To make the dressing, mix together the mustard, vinegar, oil, capers, salt, pepper and a splash of water. Stir in the sultanas and parsley. ", "Serve the ravioli with the cauliflower, with dressing drizzled over, garnished with the eggs, nasturtium leaves and flowers and watercress leaves.  "]}, {"isVegetarian": true, "title": "Goats’ cheese, red onion and caraway seed tart", "url": "www_bbc_co_uk_food_recipes_goats_cheese_red_onion_69475", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for kneading", "75g/2½oz chilled butter, cut into cubes", "75g/2½oz chilled lard or vegetable shortening, cut into cubes", "salt", "1-2 tbsp rapeseed oil or vegetable oil", "85g/3oz unsalted butter", "450g/1lb red onions, finely sliced", "salt and freshly ground black pepper", "1 tbsp soft brown sugar, or more to taste", "1 tbsp caraway seeds, toasted in a dry frying pan", "about 80ml/2¾fl oz balsamic vinegar, to taste", "salt and freshly ground black pepper", "2 free-range eggs ", "200ml/7fl oz double cream ", "200g/7oz goats’ cheese, sliced", "salt and freshly ground black pepper", "fresh tarragon and coriander, use leaves only, to garnish (optional)"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["To make the shortcrust pastry, put the flour and a pinch of salt into a food processor. Add the butter and lard, and blend to the consistency of fine breadcrumbs. Transfer this to a mixing bowl. (If you don’t have a food-processor, mix the butter and lard into the flour with your fingertips in a mixing bowl.) Stir in 3-4 tablespoons of cold water – just enough to be able to bring the mixture together into a ball. ", "Turn out onto a lightly floured work surface and knead briefly until smooth. Roll out the pastry to a size that will line the base and sides of a 25cm/10in loose-bottomed flan tin. Press the pastry well into the crease between the base and the sides, prick the pastry base all over with a fork, and place in the fridge to chill for 30 minutes. ", "Preheat the oven to 190C/375F/Gas 5. Line the tart case with baking parchment and fill with baking beans. Blind bake for 15 minutes, then remove the beans and parchment and return the pastry to the oven for a further 10 minutes, or until the base is golden-brown. Remove from the oven and set aside.", "To make the onion marmalade, heat a large frying pan, add the oil and butter and heat until starting to foam. Add the onions, season with salt and pepper, and cook for five minutes on a low to medium heat, stirring regularly. Stir in the sugar and caraway seeds and cover the pan, then cook for a further 10-15 minutes until the juices have come out of the onions.  Taste and add more sugar if you like.", "Uncover the pan and increase the heat, and continue cooking for about 20 minutes to reduce all the juices. While the juices are being reduced, preheat the oven 200C/400F/Gas 6. ", "When the mixture reaches the consistency of marmalade, take the pan off the heat and stir in the vinegar. Adjust the seasoning to taste. ", "To make the filling, beat the eggs with the cream in a jug or bowl. Mix in the onion marmalade and pour into the blind-baked pastry case. Arrange the goats’ cheese on top. Bake in the preheated oven for 30-35 minutes, or until set and lightly browned on top.  ", "Remove from the oven and leave to cool slightly. Garnish with a scattering of tarragon and coriander leaves if you like."]}, {"isVegetarian": false, "title": "Goats’ cheese salad", "url": "www_bbc_co_uk_food_recipes_goats_cheese_salad_96364", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goats_cheese_salad_96364_16x9.jpg", "ingredients": ["½ red onion, finely chopped", "3-4 sprigs tarragon, leaves picked and finely chopped", "1 tbsp good-quality white wine vinegar (preferably Moscatel vinegar) ", "3 tbsp extra virgin olive oil", "vegetable oil, for frying", "2 rashers streaky bacon, diced ", "2 slices good-quality sourdough bread", "2 portions goats’ cheese (either individual crottins or slices from a larger log)", "1 handful toasted hazelnuts, lightly crushed", "200g/7oz good-quality mixed salad leaves", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["In a salad bowl, mix the red onion, tarragon, vinegar and olive oil. Season with salt and pepper and set aside. ", "Heat a little oil in a frying pan, add the bacon and fry until crisp. Drain on kitchen paper.", "Heat the grill to high. Toast the bread on both sides and grill the goats’ cheese until golden-brown and bubbling. ", "Add the hazelnuts, bacon and salad leaves to the bowl.  ", "Place the goats’ cheese on the toast and toss the salad making sure it is well coated with dressing.", "Arrange on a plate and serve. "]}, {"isVegetarian": true, "title": "Goats’ cheese truffles", "url": "www_bbc_co_uk_food_recipes_goats_cheese_truffles_80378", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz goats' cheese log, chilled", "sea salt and freshly ground black pepper", "1 tbsp honey", "2 tsp crushed pink peppercorns", "1 tsp sesame seeds", "½ tsp paprika", "1 tbsp finely grated Parmesan cheese", "1 tbsp finely chopped fresh chives", "1 tbsp toasted and finely chopped hazelnuts"], "serves": "Makes 18-20", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the goats’ cheese into a bowl. Season with sea salt and freshly ground black pepper. Mix until smooth and well combined.", "Break off small pieces (about one teaspoonful) of the cheese, roll into a ball and place onto a plate. ", "To coat the truffles, place each of the suggested toppings into small bowls.", "Mix the honey with a few drops of water to loosen it a little and brush it all over a  truffle.", "Place it into a bowl of topping and swirl it around until it is evenly coated. Arrange on a serving platter and repeat until all of the balls are coated. "]}, {"isVegetarian": true, "title": "Goats' cheese gratin", "url": "www_bbc_co_uk_food_recipes_goatscheeseandmushro_81822", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz linguini", "1 tbsp olive oil", "2 shallots, finely chopped", "1 clove garlic, finely chopped", "75ml/3fl oz double cream", "50g/2oz baby spinach leaves", "salt and freshly ground black pepper", "75g/3oz goats' cheese, sliced", "pinch paprika"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "Cook the linguini in boiling salted water until al dente. Drain and set aside. ", "Heat the olive oilin a medium-sized pan and sweat the shallot and garlic for two minutes or until softened but not coloured. ", "Add the cooked linguini, double cream, spinach, salt and freshly ground black pepper and stir well. Pour into a small gratin dish. ", "Put the slices of goats' cheese on top, sprinkle with paprika and place under the grill for five minutes or until bubbling and the goats' cheese has browned slightly. Serve."]}, {"isVegetarian": false, "title": "Goat’s saddle with artichokes, morels and wild garlic", "url": "www_bbc_co_uk_food_recipes_goats_saddle_with_45211", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["30g/1oz salted butter", "600g/21oz goat's rack and short saddle (aged for 2 weeks), trimmed", "2 artichokes, trimmed, chokes removed, cut into quarters", "50g/1¾oz morel mushrooms, roughly chopped ", "salt and black pepper", "1 tsp lazy garlic (1 garlic clove blended with 1 tsp olive oil)", "3 tsp sherry vinegar", "150ml/5fl oz gravy", "150g/5oz wild garlic, roughly chopped"], "serves": "Serves 2-4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a pan until foaming. Place the goat in with the butter and fry for 6-10 minutes, basting all the time - cook the meat longer, if you prefer your meat more well done. After a few minutes, add the artichokes. Remove and place on a carving dish, covering loosely with foil, and rest for at least six minutes.", "Blanch the morel mushrooms for ten seconds in a pan of salted boiling water. Drain thoroughly and add the morels to the pan used to cook the goat and cook for three minutes.", "Add the lazy garlic, cook for 15-20 seconds, or until fragrant, and then deglaze with the sherry vinegar. Once the vinegar has evaporated, add the gravy and bring to the boil.", "Add the wild garlic and season to taste with salt and pepper. Serve the meat in slices with the morels and wild garlic on the side."]}, {"isVegetarian": true, "title": "Goats' cheese and shallot tarte tatin with salad", "url": "www_bbc_co_uk_food_recipes_goatscheeseandshallo_86207", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/2oz butter", "2 tsp caster sugar", "2 sprigs thyme", "3 banana shallots, peeled and sliced lengthways", "250g/9oz ready-made puff pastry, rolled to 5mm/¼in thick", "75g/3oz soft goats' cheese", "200g/7oz firm goats' cheese", "25g/1oz clear honey", "2 tbsp truffle oil", "1 tbsp extra virgin olive oil", "½ lemon, juice only", "salt and freshly ground black pepper ", "1 punnet micro cress or mustard cress ", "50g/2oz lamb's lettuce"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the goats' cheese and shallot tarte tatin, heat two small ovenproof blini pans until hot. Divide the butter and caster sugar between the two pans and heat until the sugar and butter have melted and the mixture has started to caramelise and turn golden-brown.", "Place a sprig of thyme in each pan and add the shallots to the two pans.", "Cook for 3-4 minutes until the shallots are just beginning to turn brown.", "Meanwhile, place the pre-rolled pastry onto a clean, floured surface and crumble the soft goats' cheese over half of the pastry.", "Fold the pastry in half to cover the goats' cheese and roll out to 5mm/¼in thick again.", "Using a sharp knife, cut out two circles of pastry so they are slightly larger than the circumference of the blini pans.", "Cover each pan with a pastry round and tuck the edges inside the pan and around the shallots. ", "Transfer to the oven and bake for 15-20 minutes, until the pastry is golden-brown and cooked through. Remove and allow to cool slightly.", "For the salad, place the honey and oils into a small bowl and whisk to combine. Add the lemon juice and season with salt and freshly ground black pepper. Arrange the micro cress or mustard cress and lamb's lettuce in a large bowl and add the dressing to the salad leaves, reserving some for later. Mix well.", "To finish the tarte tatin, preheat the grill to high. Slice the firm goats' cheese in half, place on a grill tray and cook under the grill for two minutes until golden-brown.", "To serve, turn each tarte tatin out of its blini pan onto the centre of a serving plate, pastry-side-down - take care as it will be very hot. Top with the grilled firm goats' cheese and a small handful of dressed salad. Spoon the remaining dressing around the edge of each plate."]}, {"isVegetarian": true, "title": "Goats' cheese and sun-blushed tomato salad", "url": "www_bbc_co_uk_food_recipes_goatscheeseandsunblu_84043", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra to grease", "100g/3½oz round goats' cheese, cut in half", "½ tsp cracked black pepper", "small bunch fresh basil", "small bunch fresh coriander", "55g/2oz sun-blushed tomatoes, chopped", "½ tsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking, then brush with the oil.", "Place the cheese onto the griddle and cook for two minutes on each side.", "Meanwhile mix together the remaining ingredients in a bowl, then place onto a serving plate.", "To serve, place the griddled goats' cheese on top of the salad."]}, {"isVegetarian": true, "title": "Goats' cheese cannelloni with cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_goatscheesecannellon_86639", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goatscheesecannellon_86639_16x9.jpg", "ingredients": ["400g/14oz cherry tomatoes, halved", "125ml/4fl oz extra virgin olive oil", "1 tbsp fresh thyme leaves", "salt and freshly ground black pepper", "400g/14oz ricotta", "100g/3½oz goats' cheese", "30g/1oz parmesan (or a vegetarian alternative), grated ", "200g/7oz baby spinach", "2 garlic cloves, crushed", "12 x 12cm/5in x 10cm/4in sheets fresh pasta ", "parmesan shavings", "green salad leaves, dressed with olive oil and balsamic vinegar"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/365F/Gas 4.", "Place the tomatoes into a bowl and drizzle with the olive oil. Add the thyme and season well with salt and freshly ground black pepper.", "Place the ricotta, goats' cheese and parmesan into a clean bowl and mix well.", "Add the spinach and garlic and season well with salt and freshly ground black pepper. ", "Lay the pasta sheets onto a clean work surface. Place a line of the cheese and spinach mixture along the longer edge of each pasta sheet, then roll up like a cigar.", "Drizzle the cannelloni rolls with a little of the oil that the tomatoes have been sitting in, then pour the remaining oil into the bottom of an ovenproof dish that will hold all 12 cannelloni.", "Place the cannelloni tubes into the dish and place the tomatoes evenly over the top.", "Transfer to the oven to bake for 15 minutes, or until cooked through.", "To serve, place three cannelloni onto each of four plates. Sprinkle with parmesan shavings and place a spoonful of dressed mixed green salad leaves alongside."]}, {"isVegetarian": false, "title": "Goats' cheese, lemon and herb risotto", "url": "www_bbc_co_uk_food_recipes_goatscheeselemonandh_84763", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz unsalted butter", "1 tbsp olive oil", "½ onion, finely sliced", "1 garlic clove, finely chopped", "150g/5½oz risotto rice", "50ml/2fl oz white wine", "300ml/10fl oz hot chicken stock", "50g/1½oz goats' cheese", "50ml/2fl oz double cream", "1 lemon, zest only", "1 tsp chopped fresh chives ", "1 tsp chopped fresh parsley", "1 tbsp chopped fresh chervil", "freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter with the oil in a saucepan. Place the onion and garlic into the pan and cook gently for 2-3 minutes.", "Add the rice and wine to the pan, bring to the boil and cook until the wine is absorbed.", "Add the hot stock to the pan and simmer for 8-10 minutes.", "Add the goats' cheese, cream, lemon zest and herbs to the pan, stir well and season with pepper only. Cook for a further 2-3 minutes, or until the rice is al dente.", "To serve, transfer the risotto to a warmed serving bowl."]}, {"isVegetarian": true, "title": "Goats' cheese double-baked soufflés with walnut salad", "url": "www_bbc_co_uk_food_recipes_goatscheesedoublebak_91369", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["40g/1½oz butter, plus extra, melted, for greasing", "50g/2oz walnuts, finely chopped", "40g/1½oz plain flour (those with a wheat intolerance can substitute wheat-free flour)", "275ml/10fl oz milk", "175g/6oz Ragstone goats' cheese, or similar firm, log-shaped goats' cheese, finely chopped", "salt and freshly ground black pepper ", "4 free-range eggs, separated, whites whisked until stiff peaks form when the whisk is removed", "75g/3oz Ogleshield cheese, or similar crumbly cows' milk cheese, finely grated", "4 tbsp double cream", "50g/2oz butter", "12 asparagus spears, woody ends trimmed, peeled", "8 thin slices pancetta, cut into 2cm/¾in strips", "110g/4oz walnut halves", "110g/4oz mixed salad leaves", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the soufflés, preheat the oven to 180C/350F/Gas 4. Brush the insides of four ramekins with melted butter. Add some of the finely chopped walnuts to each ramekin, turn to coat the sides and bottom, then shake out any excess. Set aside.", "Heat the butter in a pan over a medium heat until melted. Add the flour, stirring continuously, then continue to cook for a further 1-2 minutes, or until the mixture forms a thick paste. Remove from the heat.", "Gradually add the milk to the pan and whisk until the mixture is smooth and well combined.", "Return the mixture to the heat and continue to cook for 1-2 minutes, or until thickened. Add the goats' cheese and stir until it has melted and the mixture is smooth and well combined. Season, to taste, with salt and freshly ground black pepper.", "Remove the pan from the heat, beat in the egg yolks one at a time, beating thoroughly after each addition, until well combined, then set aside.", "Beat a third of the stiffened egg whites into the sauce until well combined, then carefully fold in the remaining egg whites with a metal spoon.", "Spoon the mixture into the prepared ramekins, tapping the sides gently to remove any large air bubbles. ", "Place the ramekins into a roasting tray. Carefully pour enough boiling water into the roasting tray to reach halfway up the sides of the ramekins (this is called a bain-marie). ", "Transfer the bain-marie to the oven and bake for 20-25 minutes, or until the soufflés have risen and are pale golden-brown and cooked through (the soufflés are cooked through when a skewer inserted into the middle of the soufflés comes out clean). Remove the soufflés from the bain-marie and set aside to cool slightly. ", "Preheat the grill to its highest setting.", "Carefully turn out each soufflé from its ramekin and place onto a baking tray.", "Sprinkle over the Ogleshield cheese and drizzle over the cream.", "Grill the soufflés for 2-3 minutes, or until the cheese is golden-brown and bubbling and the soufflés have heated through.", "Meanwhile, for the walnut salad, heat 25g/1oz of the butter in a frying pan over a medium heat until melted. Add the asparagus spears, pour over just enough hot water to cover them and bring the water to a simmer. Continue to simmer for 2-3 minutes, or until the asparagus spears are tender. Drain well and set aside.", "Heat a separate frying pan until hot, add the remaining butter and the pancetta strips and fry for 2-3 minutes, or until beginning to crisp.", "Add the walnut halves and cooked asparagus spears and fry for 1-2 minutes, or until golden-brown, then remove from the pan and set aside to drain on kitchen paper.", "Add the fried walnut halves, pancetta strips and asparagus spears to the salad leaves and mix well to combine. ", "In a bowl, whisk together the Dijon mustard, vinegar and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper.", "To serve, drizzle two thirds of the dressing over the salad and mix well to coat the leaves. Divide the dressed salad leaves equally among four serving plates. Place one twice-baked soufflé alongside each serving. Drizzle the remaining dressing around the edge of each plate."]}, {"isVegetarian": true, "title": "Goats' cheese on garlic toast", "url": "www_bbc_co_uk_food_recipes_goatscheeseongarlict_92228", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heads garlic", "olive oil, for drizzling", "2-3 sprigs fresh thyme", "salt and freshly ground black pepper", "1 goats' cheese round ", "1 ciabatta or baguette", "lettuce leaves, to serve", "prosciutto, to serve (optional)"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/250F/Gas 4. ", "Arrange the whole heads of garlic snugly in an oven dish. Drizzle with olive oil and season with thyme, salt and freshly ground black pepper. Roast in the oven for about an hour, or until the garlic is softened.", "Squeeze the soft garlic out of its skins into a small dish or bowl. Add enough olive oil to make a thick paste and season, to taste, with salt and freshly ground black pepper. Slice some goats' cheese thinly. Cut the ciabatta in half and place under the grill to toast then spread the slices with the garlic paste. Place the goats' cheese on top and pop under the grill again until the cheese has melted. ", "Serve with on a bed of fresh, crisp lettuce leaves. I often add a couple of slices of prosciutto, too."]}, {"isVegetarian": true, "title": "Goats' cheese pâté", "url": "www_bbc_co_uk_food_recipes_goatscheesepacirctea_65619", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tub goats' cheese ", "olive oil ", "mixed chopped herbs ", "crusty bread"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the cheese, oil and herbs in a bowl and stir. ", "Spread liberally on the crusty bread and serve."]}, {"isVegetarian": true, "title": "Goats' cheese pizza", "url": "www_bbc_co_uk_food_recipes_goatscheesepizza_84262", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour", "3 tbsp olive oil, plus extra for greasing", "3 tbsp water", "2 tbsp tomato purée ", "1 tbsp olive oil", "100g/3½oz wild mushrooms", "30g/1oz sun-blushed tomatoes, chopped", "55g/2oz goats' cheese, crumbled"], "serves": "Makes 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat oven to 200C/400F/Gas 6 and oil a baking sheet.", "Mix the flour, olive oil and water together in a bowl to make a soft dough.", "On a clean flat surface, roll the dough out into a thin disc and lay onto the oiled baking sheet.", "Spread the tomato puré over the dough disc.", "Meanwhile, for the topping, heat the olive oil in a frying pan over a high heat. Add the mushrooms and sun-blushed tomato and fry for two minutes.", "Spread the mushroom mixture over the pizza, crumble over the goats' cheese and transfer to the oven and cook for 6-8 minutes, until the cheese is melted and the base is crisp and golden."]}, {"isVegetarian": true, "title": "Goats' cheese ravioli with sage and tomato sauce", "url": "www_bbc_co_uk_food_recipes_goatscheeseravioliwi_81002", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain or '00' flour, plus extra for dusting", "2 free-range eggs", "2 free-range egg yolks", "1 tbsp olive oil", "2 pinches salt", "200g/7oz baby spinach, wilted in a pan and chopped", "150g/5½oz soft goats' cheese, crumbled", "salt and freshly ground black pepper", "1 free-range egg, beaten", "100g/3½oz unsalted butter", "1 shallot, finely chopped", "10 sage leaves, chopped", "½ clove garlic, chopped", "few sprigs parsley, chopped", "4 tomatoes, skinned, deseeded and finely chopped"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To prepare the pasta dough, place the flour, whole eggs, yolks, oil and salt in a large bowl and, using your hands, knead until you have a firm dough. Cover with clingfilm and place in the fridge for at least 5 hours.", "Meanwhile, make the filling. Mix the chopped spinach with the goats' cheese, then season with salt and freshly ground black pepper and leave to one side.", "Next make the ravioli. When the dough has rested, put the dough through a pasta machine until you have two large flat rectangular shapes, approximately 60cm/24 inches long. Keep dusting with flour so the dough doesn't stick.", "Place teaspoons of the spinach and goats' cheese mixture on the dough roughly 4cm/1½ inches apart. Glaze in between each spoon of filling with the beaten egg, then place the second pasta sheet on top. Press along the edges of each spoon of filling with your fingers. Using a pastry wheel, cut into squares to create a ravioli shape. ", "To cook, simply place the ravioli in boiling salted water for 2 minutes. Remove with a slotted spoon and keep warm.", "For the sauce, heat the butter in a frying pan, and when it starts to froth and turn golden brown, add the shallot, sage, garlic, parsley and tomatoes. Cook for a minute or two and serve at once with the cooked ravioli."]}, {"isVegetarian": false, "title": "Goats' cheese-stuffed chicken breast with roasted vegetables and boiled potatoes", "url": "www_bbc_co_uk_food_recipes_goatscheesestuffedch_84592", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 boneless, skinless chicken breasts", "1 rosemary-coated soft goats' cheese", "salt and freshly ground black pepper ", "3 tbsp olive oil", "1 crotin goats' cheese (a small semi-firm disc of goats' cheese), sliced", "1 red pepper, quartered", "1 courgette, cut into thin strips", "1 aubergine, cut into 5mm/¼in thick rounds", "200g/7oz baby new potatoes, boiled, cut in half"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Use a sharp knife to cut a pocket into the side of each chicken breast.", "Slice the soft goat's cheese and press into the pocket in the chicken breasts. Season the breast with salt and freshly ground black pepper.", "Heat one tablespoon of the olive oil in an ovenproof frying pan over a medium heat. When the oil is hot, add the chicken breasts, presentation-side down and fry until golden-brown. Turn the breasts and cook for a further two minutes on the other side, then transfer the pan to the oven and roast for 15 minutes.", "Remove the pan from the oven and top with the remaining goats' cheese and return to the oven to cook for a further five minutes, until the chicken is completely cooked through and the cheese has melted.", "Meanwhile, heat a griddle pan until smoking.", "Place the red pepper, courgette and the aubergine slices into a bowl with the remaining two tablespoons of olive oil and season with salt and freshly ground black pepper. Place the vegetables onto the griddle pan and cook for five minutes, or until tender, turning once.", "To serve, place the chicken breasts onto two plates with a pile of chargrilled vegetables and some cooked potatoes alongside each."]}, {"isVegetarian": true, "title": "Goats cheese rolled on breadcrumbs and ground almonds (meculin de Crottin de Chavignol)", "url": "www_bbc_co_uk_food_recipes_goatscheeserolledonb_10171", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 x 50g/2oz goats' cheese (Crottin Chavignol but you can use any) ", "50g/2oz ground almonds ", "200g/7oz white bread crumbs, needn t be fresh", "1 egg, beaten", "200ml/7fl oz whole milk ", "50g/2oz plain flour ", "2 whole pears ", "250ml/8fl oz red wine ", "250ml/8fl oz port", "1 sprig of thyme ", "¼ garlic glove ", "2 star anise ", "½ cinnamon stick ", "2 black pepper corns ", "1 clove", "250ml/8fl oz water", "250ml/8fl oz sugar", "100ml/3½fl oz  walnut oil ", "45ml/1¾oz  white wine vinegar ", "100ml/3½fl oz arachide oil, or corn oil", "salt and pepper to taste", "20g/1oz mixed leaves", "1 tsp chopped chives", "1 tsp chopped shallots", "You will need a deep fat fryer for this recipe."], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["To make the goats cheese, peel the outside rind from the goats' cheese.", "Mix the ground almonds and breadcrumbs together.", "Mix the egg and milk together to make an  egg-wash .", "Roll the goats cheese into the flour, then the  egg-wash  and then into the almond and breadcrumb mix repeat this twice and then refrigerate. Two coats will stop the cheese from bursting through when fried.", "To make the pear chutney, peel the pears and leave them whole.", "Put the port in a small pan and reduce until it becomes syrupy.", "Add red wine, spices, herbs and garlic and reduce by half.", "Add the stock syrup (black pepper corns, clove, water and sugar having already been mixed) and bring to the boil.", "Put the pears in the mixture and cook until they are soft. Insert a knife into the pears and if there is no resistance they are cooked (approx 5 minutes).", "Allow the pears to cool down in the syrup. It's best made 1 day in advance to maximise flavour.", "For the walnut dressing, mix all the ingredients together.", "Season to taste with the salt and pepper.", "Place the goats cheese into a hot fryer [approximately 170 degrees] until golden brown then, into a preheated hot oven for approx 3 minutes. This will seal the cheese and stop it from bursting out.", "Dice the pears into cubes and place them neatly onto the plate. Top with the goat's cheese and salad leaves mixed with the chopped shallots, chives and walnut dressing."]}, {"isVegetarian": true, "title": "Goats' cheese tagliatelle with breadcrumbs", "url": "www_bbc_co_uk_food_recipes_goatscheesetagliatel_80182", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz breadcrumbs", "50g/1¾oz fresh parsley", "100ml/3½fl oz double cream", "100g/3½oz goats' cheese", "½ tsp freshly ground black pepper", "pinch paprika", "150g/5½oz tagliatelle, cooked according to packet instructions", "150g/5½oz monkfish, chopped into large cubes", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the breadcrumbs and parsley in a food processor and blend together.", "Meanwhile place the double cream in a small saucepan over a medium heat and bring to a simmer.", "Add the goats' cheese, black pepper and paprika to the cream and continue simmering to melt the cheese and thicken the sauce.", "Place the cooked tagliatelle and monkfish pieces into a large bowl. Pour in the cream and cheese sauce and toss together. ", "Pour the sauce and tagliatelle into an ovenproof dish. Sprinkle with the parsley breadcrumbs and place into the oven to bake for five minutes, or until the top is turning golden.", "Remove from the oven and serve in the ovenproof dish."]}, {"isVegetarian": true, "title": "Goats' cheese, pear and apple tart with chilli sugar", "url": "www_bbc_co_uk_food_recipes_goatscheesepearandap_73222", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14¼oz puff pastry ", "2 cooking apples ", "2 pears ", "2 limes, juice only  ", "225g/8oz goats' cheese (log-shaped chèvre)", "1 egg white ", "1 tsp milk ", "1 fresh red chilli", "1 tbsp sugar ", "1 tbsp olive oil ", "salt and freshly ground pepper", "green salad"], "serves": "Serves 4-6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 180C/360F/Gas 4. ", "Roll out the puff pastry to a rectangle slightly larger than a sheet of A4 paper.", "Place the pastry on a greased baking sheet, cover and refrigerate for 30 minutes. ", "Peel, core and finely slice the apples and pears and toss with half the lime juice.", "Using a hot, wet, sharp knife, cut the chèvre in half lengthways.", "Finely slice the chèvre into thin, half-moon shapes. ", "Beat together the egg white and the milk. ", "Take the puff pastry rectangle and brush the egg white mixture around its edges.", "Place alternate slices of apple and pear in neat lines across the rectangle, leaving a 2cm (¾in) gap of pastry around the edge. ", "Place the chèvre slices so that they overlap with the fruit slices. ", "Bake the fruit tart for 15-20 minutes until the pastry is crisp, the fruit is golden and the goats' cheese has browned. ", "Meanwhile, using a mortar and pestle, grind together the chilli and sugar to form a paste. ", "Mix in the remaining lime juice, olive oil, salt and freshly ground pepper and mix together well. ", "Once the tart is cooked, remove from the oven and allow to rest for five minutes.", "Drizzle over the chilli lime dressing and serve with a green salad."]}, {"isVegetarian": true, "title": "Goats' cheese parcels", "url": "www_bbc_co_uk_food_recipes_goatscheeseparcels_65618", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2-3 sheets buttered filo pastry ", "olive oil ", "1 tsp thyme ", "1 tsp marjoram ", "1 clove garlic ", "85g/3oz goats' cheese cheddar (a hard cheddar-like cheese) - cut into 1cm/in cubes ", "seasoning"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the sheets on a damp surface to prevent drying out. Cut into a rectangle. ", "Place the cheese, herbs and oil in a bowl and mix together. ", "Put the mixture in the centre of the rectangle and roll up into a spring roll shape. ", "Twist both the ends to make a cracker shape. ", "Brush with oil and bake in an oven 200C/400F/Gas 6 for 4 minutes to crisp up."]}, {"isVegetarian": true, "title": "Goats' cheese toastie with aubergines, peppers and courgettes", "url": "www_bbc_co_uk_food_recipes_goatscheesetoastiewi_86533", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper, de-seeded and halved ", "1 yellow pepper, de-seeded and halved", "2 tbsp olive oil", "salt and freshly ground black pepper ", "1 courgette, sliced approximately 0.5cm/¼in thick", "1 small aubergine, sliced approximately 0.5cm/¼in thick", "small handful fresh basil, chopped", "1 tbsp balsamic vinegar ", "4 slices country white bread", "olive oil, for brushing", "goats' cheese log, cut into four pieces", "salt and freshly ground black pepper, to taste"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["Preheat the oven to 170C/325F/Gas 3.", "For the vegetables, line a baking tray with aluminium foil, place the peppers on the tray, drizzle with one tablespoon of the olive oil and season with salt and freshly ground black pepper. Roast in the oven for 20 minutes, then remove the peppers from the oven and leave to cool. Once cooled, peel and chop into strips.", "Heat the remaining olive oil in a pan and fry the courgette and aubergine for a few minutes, seasoning with salt and freshly ground black pepper.", "In a bowl, mix the peppers, courgettes and aubergines together with the chopped basil and balsamic vinegar.", "Preheat a grill to medium.", "For the toastie, brush the sliced bread with olive oil and toast the bread on both sides under the grill. Place a large spoonful of the vegetable mixture onto the toast and then top with goats' cheese. Return to the grill until the goats' cheese begins to melt and turn golden."]}, {"isVegetarian": false, "title": "Goats' cheese tower with bacon and sautéed spicy spinach", "url": "www_bbc_co_uk_food_recipes_goatscheesetowerwith_85628", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices baguette, rubbed with olive oil", "4 slices streaky bacon, grilled until crisp", "1 tbsp olive oil, plus extra, to serve", "¼ onion, finely chopped", "75g/2½oz spinach", "1 tsp chilli flakes", "salt and freshly ground black pepper", "100g/3½oz goats' cheese"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan and griddle the baguette slices until golden-brown on both sides. Place one slice onto a serving plate and top with the bacon. Place the second baguette slice on top.", "Heat the olive oil in a frying pan, add the onion and gently fry until softened.", "Add the spinach and chilli flakes and season well with salt and freshly ground black pepper. Cook, stirring frequently, for 1-2 minutes, or until the spinach has wilted. Remove from the heat and drain off the excess water.", "Place the spinach on top of the baguette on the serving plate. Top with the third slice of griddled baguette.", "Heat a frying pan and fry the goats' cheese for 2-3 minutes on each side, or until just beginning to melt.", "Place the goats' cheese on top of the tower and use a mini-blowtorch to brown all over.", "To serve, drizzle with olive oil."]}, {"isVegetarian": true, "title": "Goats' cheese with chicory orange jam", "url": "www_bbc_co_uk_food_recipes_goatscheesewithchico_83705", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["25g/1oz butter", "1 onion, roughly chopped", "1 clove garlic, chopped", "5 heads chicory, finely sliced", "2 oranges, zest and juice only", "150g/5¼oz caster sugar", "250ml/8 3/4fl oz dry white wine", "4 small goats' cheese rounds", "4 slices white bread, lightly toasted", "20g/ 3/4oz butter", "1 apple, peeled and cut into wedges", "75g/2½oz cooked beetroot, cut into wedges", "50g/1 3/4oz rocket salad", "25g/1oz walnut halves", "2 tbsp vinaigrette"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a large heavy-based saucepan until hot, then add the butter.", "Add the onion and garlic and fry for 2-3 minutes. Add the chicory and remaining ingredients. Bring to the boil, reduce the heat and simmer for 45 minutes, stirring occasionally, until thick and caramelised.", "Preheat the grill until hot.", "Place the goats' cheese onto the toast and grill until golden and bubbling.", "Heat a frying pan until hot then add the butter and apple and sauté until golden brown. Set aside and cool.", "To serve, place the jam in the centre of a serving plate. Top with the goats' cheese toast. Spoon the apple, beetroot, walnuts and rocket leaves around.", "Drizzle the vinaigrette over the top."]}, {"isVegetarian": false, "title": "Goats' cheese wrapped in parma ham with herb salad", "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_87235", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 slices parma ham", "1 thick slice goats' cheese", "½ tbsp olive oil", "handful fresh coriander, chervil and flatleaf parsley, leaves only, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Lay the slices of parma ham on a board so that they overlap slightly and place the cheese in the centre. Fold the parma ham around the cheese to enclose it completely.", "Heat the oil in a small frying pan and fry the parcel for 2-3 minutes on all sides, or until crisp and golden-brown all over.", "To serve, place the herbs in the centre of a serving plate and top with the cheese parcel."]}, {"isVegetarian": false, "title": "Goats' cheese wrapped in pancetta with pear chutney and pan-fried pears", "url": "www_bbc_co_uk_food_recipes_goatscheesewrappedin_84037", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/4oz round goats' cheese, rind removed, halved", "4 slices pancetta", "½ pear, cored, chopped", "½ onion, chopped", "1 tbsp chopped, fresh parsley", "1 tbsp olive oil", "1 tbsp balsamic vinegar", "25g/1oz butter", "½ pear, sliced", "2 tbsp olive oil ", "1 tsp wholegrain mustard", "½ lemon, juice only", "sea salt and freshly ground black pepper", "handful watercress"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Wrap the goats' cheese halves with the pancetta.", "Heat a frying pan on a medium to high heat. Place the goats' cheese in the frying pan and fry for two minutes on each side, until golden.", "For the pear chutney, place all of the chutney ingredients into a saucepan over a medium heat and simmer together for ten minutes.", "For the pear salad, melt the butter in a small pan. Add the pears and fry over a medium to high heat for five minutes, turning occasionally, until browned all over.", "For the dressing, whisk together all of the dressing ingredients in a clean bowl and season, to taste, with salt and freshly ground black pepper. ", "To serve, place the watercress onto a  plate and pour over the dressing. Top with the pan-fried pears and goats' cheese and serve  the chutney in a bowl alongside."]}, {"isVegetarian": true, "title": "Gobi 65", "url": "www_bbc_co_uk_food_recipes_gobie_65_goan_street_32808", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gobie_65_goan_street_32808_16x9.jpg", "ingredients": ["vegetable oil, for deep-frying", "1 cauliflower, leaves removed and cut into florets", "3 tbsp chickpea flour (gram flour)", "4 tbsp cornflour", "1 tbsp chilli paste", "½ tbsp finely chopped fresh curry leaves", "½ tbsp garam masala ", "8 fresh curry leaves, to garnish", "2 green chillies, sliced, to garnish ", "½ tsp ground cumin ", "½ tsp black mustard seeds", "1 green chilli", "1 tbsp cashew nuts, smashed", "1 cucumber, grated", "150ml/5fl oz thick natural yoghurt", "250g/9oz plain flour, plus extra for dusting", "1 tsp salt", "1 tbsp olive oil"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the deep-fried cauliflower, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended.", "Heat a large saucepan of salted boiling water and blanch the cauliflower for 2–3 minutes. Drain well and set aside.", "Place the flours into a large bowl and add the chilli paste, chopped curry leaves and garam masala. Mix then add enough cold water to make a smooth batter consistency. ", "Dip the blanched cauliflower into the batter and deep-fry for 2 minutes or until golden-brown. Set aside to drain on kitchen roll and keep warm until ready to serve. (Keep the deep-fat fryer warm to fry the garnish at the last minute.)", "For the salad, in a dry frying pan over a medium heat, toast the cumin, mustard seeds, green chilli and nuts for 2–3 minutes, taking care not to burn them.", "Put the grated cucumber into a clean tea towel and squeeze out the water. Place the cucumber into a bowl with the yoghurt and mix in the roasted spices and nuts.", "For the flatbreads, mix the flour and salt in a large bowl. Add the oil and mix again. Gradually add enough water to form a dough then knead until smooth. Divide into 8 balls. On a floured surface, roll them out into round flatbreads.", "In a dry frying pan over a medium heat, cook each flatbread for 2–3 minutes on both sides or until cooked through.", "Just before serving, deep-fry the curry leaves and sliced green chillies. ", "To serve, place the fried cauliflower onto a serving plate and top with the salad. Serve the flatbreads on the side."]}, {"isVegetarian": true, "title": "Gold digger buns", "url": "www_bbc_co_uk_food_recipes_gold_digger_buns_07011", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["110g/4oz self-raising flour, plus extra for dusting", "60g/2½oz butter", "6 dried, ready-to-eat apricots, chopped", "30g/1¼oz caster sugar", "1 free-range egg, beaten", "seedless grapes, to serve (optional)"], "serves": "Makes 6 buns", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Line a baking tray with baking parchment.", "In a bowl, rub the flour and butter together using your fingertips until the mixture resembles breadcrumbs.", "Stir in the apricots and sugar.", "Gradually add the beaten egg and stir until the mixture comes together as a soft dough. If the mixture becomes too sticky, add a little more flour.", "Turn out the dough onto a lightly floured work surface. Cut it into six equally sized pieces and roll each into a ball. Arrange the balls onto the prepared baking tray.", "Bake the buns in the oven for 15-20 minutes, or until golden-brown on top and cooked through (a skewer inserted into the centre of each should come out clean). Set aside to cool, then eat with grapes, if desired."]}, {"isVegetarian": true, "title": "Gold millionaire shortbreads", "url": "www_bbc_co_uk_food_recipes_gold_millionaire_96516", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gold_millionaire_96516_16x9.jpg", "ingredients": ["120g/4oz plain flour", "50g/1oz caster sugar", "120g/4oz butter", "50g/1oz semolina", "24 pieces butter fudge sweets", "75g/2oz dark chocolate ", "gold luster dust"], "serves": "Makes 12", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 160C/310F/Gas 2 and lightly grease a baking sheet.", "Place all the ingredients for the base into a food processor and blend together. Lightly flour a smooth surface, then remove the dough and knead lightly until smooth. Leave to rest in the fridge for 30 minutes.", "On a lightly-floured surface roll out the dough to a thickness of about 5mm/¼in.  Cut out 12 x 6cm/2in rounds and place on the baking sheet. Prick twice with a fork. If you want to string your gold medals, use a drinking straw to make a hole in each biscuit.", "Bake for approximately 30-40 minutes until golden-brown and firm. Set aside to cool.", "Once the biscuits have cooled. Soften two pieces of fudge (this can be done by massaging the fudge by hand or warming it in 10 second bursts in a microwave), knead into a ball and roll or pat into a circle the same size as the biscuits. Press onto the surface of the shortbread and leave to set on a tray for 30 minutes. Repeat for the remaining biscuits.", "Break the chocolate into small pieces and place in a bowl over a pan of gently simmering water (do not let the bowl touch the water).  Melt the chocolate, stirring infrequently, until smooth. Leave to cool slightly. Pour the chocolate over the biscuits until they are completely covered.  Set aside until the chocolate has set, then brush the chocolate with the gold luster."]}, {"isVegetarian": true, "title": "Golden egg curry", "url": "www_bbc_co_uk_food_recipes_golden_egg_curry_00708", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_egg_curry_00708_16x9.jpg", "ingredients": ["2 green chillies, de-seeded and roughly chopped", "4 green finger chillies, 1 roughly chopped and 3 left whole ", "150g/5½oz shallots, peeled and roughly chopped ", "2 large garlic cloves, roughly chopped ", "25g/1oz fresh ginger, peeled and roughly chopped", "15g/½oz fresh turmeric, peeled and roughly chopped, or 1 tsp ground turmeric ", "2 tbsp vegetable oil ", "1 lemongrass stalk, trimmed and bruised", "1 x 400ml tin coconut milk  ", "2 tsp sea salt flakes ", "2 tsp tamarind paste ", "4 large free-range eggs, at room temperature ", "rice or flatbreads (or both), to serve "], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Blend the 2 green chillies and 1 roughly chopped green finger chilli, shallots, garlic, ginger and turmeric to a paste using a stick blender or mini food processor. ", "Heat the oil in a heavy-based wok or a similar-sized pan with a lid, add the paste and the lemongrass and fry gently, stirring frequently, for 5 minutes, until the paste is cooked and softened. ", "Add the coconut milk, salt and tamarind with 100ml/3½fl oz freshly boiled water. Make a couple of little incisions in each of the 3 whole finger chillies with the point of a small sharp knife and add to the pan. Turn the heat up to bring to a near boil, then reduce the heat and simmer gently for about 7 minutes, stirring frequently, until the sauce has cooked and reduced to a thick golden soup. ", "Crack the eggs into the sauce, cover with a lid and leave to simmer very gently for about 4 minutes, or until the whites are set but the yolks still runny, or cook for longer if you want well-cooked yolks. ", "Divide between two bowls, trying to spoon out most of the sauce from the pan first. Serve with rice, flatbreads or both. "]}, {"isVegetarian": true, "title": "Golden dough balls with cheese and herbs", "url": "www_bbc_co_uk_food_recipes_golden_dough_balls_with_70562", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/golden_dough_balls_with_70562_16x9.jpg", "ingredients": ["16 ready-to-cook dough balls", "75g/2½oz full-fat cream cheese", "salt and freshly ground black pepper, to taste ", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh parsley", "3 tbsp mango chutney"], "serves": "Makes 32 canapés", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6 and line a baking tray with non-stick paper or foil.", "Slice each dough ball in half horizontally. On the baking trays, arrange the half dough balls up on the rounded part with the cut side up. You may need to slice a small piece off the rounded base so that they sit flat on the tray without toppling over.", "Mix the cream cheese with salt, pepper, chives and parsley and spread the cheese mixture over the flat side of each ball, spreading right to the edges.  Spoon a small blob of mango chutney on top.", "Bake for about 10-12 minutes or until golden-brown and hot.", "Arrange on a flat platter and serve hot."]}, {"isVegetarian": true, "title": "Golden flapjacks with mango, sour cherries and coconut", "url": "www_bbc_co_uk_food_recipes_goldenflapjackswithm_93620", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/goldenflapjackswithm_93620_16x9.jpg", "ingredients": ["2 tbsp golden syrup", "4 tbsp runny honey", "150g/5oz salted butter ", "150g/5oz porridge oats", "100g/3½oz desiccated coconut", "75g/2¾oz sour cherries", "75g/2¾oz dried mango, chopped"], "serves": "Makes 8-12", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.  ", "Grease a medium-sized deep baking tray. (The size of the tray will depend on the thickness of the flapjacks).", "In a large saucepan, melt the golden syrup, honey and butter together over a low heat, stirring until well combined.", "Remove the pan from the heat and stir in the oats, coconut, cherries and mango.", "Pour the flapjack mixture into the prepared tray and press it down gently into the corners of the tin. Bake for 25-30 minutes, or until deep golden-brown on top. ", "Score the flapjack into pieces while still hot, and allow to cool in the tin before turning out and cutting completely."]}, {"isVegetarian": true, "title": "Golden mojito", "url": "www_bbc_co_uk_food_recipes_goldenmojito_89969", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["8 fresh mint leaves", "1 lemon wedge", "2 tsp sugar syrup (sold as 'gomme' syrup)", "50ml/2fl oz golden rum", "1 tbsp lemon juice", "ginger ale, to top up", "sprig fresh mint, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place the mint leaves, lemon wedge and sugar syrup into a cocktail shaker and mash (muddle) with the end of a rolling pin.", "Add a handful of ice and stir well.", "Add the rum and lemon juice and stir well.", "Top up with ginger ale and garnish with a sprig of mint."]}, {"isVegetarian": false, "title": "Gong bao haddock goujons", "url": "www_bbc_co_uk_food_recipes_gongbaohaddockgoujon_89278", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp Shaoxing rice wine or dry sherry", "1 tbsp peeled and grated fresh root ginger", "1 small spring onion, finely chopped", "340g/12oz haddock fillets, cut into strips ", "1 tbsp crushed dried chillies", "1 tsp sea salt", "1 tsp white pepper", "100g/3½oz dry breadcrumbs", "100g/3½oz plain flour", "2 free-range eggs, beaten", "groundnut oil, for deep-frying", "2 tbsp lemon juice", "2 tbsp hoisin sauce", "1 tbsp dark soy sauce", "1 tsp crushed dried chilli flakes ", "1 tbsp cornflour, mixed with 2 tbsp cold water, to thicken"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the haddock goujons, mix the Shaoxing rice wine, grated ginger and chopped spring onion together in a shallow bowl and add the fish strips. Cover with cling film and leave to marinate in the fridge for 20 minutes. ", "Mix the dried chillies, sea salt and white pepper together with the breadcrumbs in a bowl, then tip onto a plate or tray. Dip the marinated strips of fish into the flour, then into the beaten egg, then roll in the seasoned breadcrumb mixture. Pat lightly to secure the breadcrumbs to the fish, then shake off any excess. Repeat with all of the fish strips.", "Quarter-fill a wok with groundnut oil and heat until a small cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the fish goujons in small batches and deep-fry for 2-3 minutes, or until golden-brown, then remove with a slotted spoon and drain on kitchen paper. Repeat with the remaining fish goujons. ", "For the gong bao sauce, heat all of the sauce ingredients together in a small saucepan, and, if necessary, thicken with the cornflour and water mixture. Remove from the heat and transfer to a small bowl or ramekin for dipping. ", "To serve, pile the fish goujons onto a serving plate and place the bowl of gong bao sauce on the side. Serve immediately with roast sweet potato wedges."]}]