[{"ingredients": ["50 g / 1 oz de azúcar en polvo", "175g / 6¼ oz de cerezas, tallo y apedreado", "4 cucharadas de jugo de lima", "150ml / 5¼fl oz de tequila", "3 cucharadas de licor de cereza o Cointreau", "275 ml / 10 fl oz de hielo"], "method": ["Combine el azúcar con tres cucharadas de agua y caliente a fuego lento hasta que el azúcar se disuelva.", "Retirar del fuego y dejar enfriar.", "Una vez frío, coloca el azúcar en una licuadora con las cerezas, jugo de lima, tequila, licor de cereza o Cointreau y el hielo.", "Licúe hasta que quede suave y sirva en copas de martini con un borde azucarado."], "url": "www_bbc_co_uk_food_recipes_frozencherrymargarit_72296", "title": "Margarita de cereza congelada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 mango, pelado, removido y picado", "1 lima, ralladura y jugo", "2 naranjas, solo jugo", "3-4 cubitos de hielo", "hojas de menta fresca y rodajas de lima, para adornar"], "method": ["Coloque el mango, la ralladura de limón y el jugo, el jugo de naranja y el hielo en un procesador de alimentos y mezcle hasta que quede suave.", "Para servir, vierta en cuatro vasos de chupito y adorne cada uno con hojas de menta y trozos de lima."], "url": "www_bbc_co_uk_food_recipes_frozenmangoandlimesh_85670", "title": "Tiros de mango y lima congelados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 peras pequeñas, peladas y cortadas en dados de 2cm / ¾in", "2 cucharadas de jugo de limón", "4½ cucharadas de azúcar en polvo", "2 manzanas medianas para cocinar, preferiblemente variedad Bramley, peladas y cortadas en dados de 2 cm / ¾in", "16 moras", "Harina integral de 40g / 1½oz", "Harina normal de 40 g / 1½ oz", "50 g / 1¾oz de mantequilla sin sal, enfriada y cortada en cubos de 2cm / ¾in", "25g / 1oz de azúcar morena suave", "pizca de sal", "100 g / 3½ oz de avellanas y avellanas secas", "150ml / 5fl oz de crema doble", "100ml / 3½fl oz de yogur griego", "100 ml / 3½ fl oz de mascarpone", "1 cucharada de azúcar en polvo", "½ cucharadita de esencia de vainilla", "½ cucharadita de cardamomo molido", "½ cucharadita de anís estrellado molido"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Mezcle las peras, el jugo de limón y 1½ cucharadas de azúcar en polvo en un recipiente. Extiende las peras en la bandeja de horno, cúbrelas con papel de aluminio y colócalas en el horno. Después de 10 minutos, agregue las manzanas, cubra con la lámina de nuevo y vuelva al horno por 30 minutos. Aplastar la fruta con un tenedor, reservar para enfriar y doblar las moras.", "Para hacer el crumble, coloque las harinas en un tazón con la mantequilla y el azúcar moreno y frótelas con las puntas de los dedos hasta que la mezcla se asemeje a pan rallado. Extiéndalo en una bandeja para hornear forrada con papel resistente a la grasa y colóquelo en el horno por 15 minutos. Retire la bandeja del horno y déjela enfriar.", "Agregue las tres cucharadas restantes de azúcar en polvo y las nueces a una cacerola antiadherente y cocine a fuego lento durante 5-6 minutos, agitando la sartén con regularidad, hasta que el azúcar se haya derretido y cubierto las nueces de manera uniforme y la mezcla esté dorada. marrón. Incline la mezcla en una bandeja para hornear forrada con papel antigrasa y déjela enfriar. Una vez que se haya enfriado, triture las nueces en un polvo grueso.", "Para la crema, coloque todos los ingredientes en un tazón grande para mezclar y bata los picos suaves, teniendo cuidado de no batir demasiado.", "Para ensamblar, coloque dos tercios de la migaja en el fondo de los vasos para servir. Cubra con dos tercios de cada una de las mezclas de frutas, crema y nueces. Agregue la migaja restante, seguido del tercio restante de la fruta y la crema. Dispersar sobre las nueces restantes y servir a la vez, o enfriar durante unas horas. Si sirve el plato frío, esparza las nueces en el último minuto."], "url": "www_bbc_co_uk_food_recipes_fruit_and_cobnut_crumble_92561", "title": "Crema de frutas y crumble de garbanzos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_and_cobnut_crumble_92561_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "150g / 5oz de harina de pan blanco fuerte, más extra para espolvorear", "1 cucharadita de azúcar en polvo", "1 cucharadita de especias mixtas", "3 cucharadas de fruta seca mixta", "2 cucharadas de chocolate picado", "1 cucharadita de levadura instantánea de acción seca", "125ml / 4fl oz de leche, a temperatura ambiente", "uvas sin semillas, para servir (opcional)"], "method": ["Engrase los agujeros en una bandeja de mini muffins de seis hoyos con mantequilla.", "En un tazón, mezcle la harina, el azúcar y la mezcla de especias. Agregue la fruta seca y el chocolate picado y vuelva a mezclar hasta que estén bien combinados. Agregue la levadura.", "Haz un pozo en el centro de los ingredientes secos. Poco a poco vierta la leche, agregando los ingredientes secos en el recipiente de leche con un tenedor, hasta que la mezcla se una como masa. Es posible que no necesite toda la leche, trate de evitar que la masa se vuelva demasiado pegajosa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amase bien durante aproximadamente 10 minutos, o hasta que quede suave y elástica.", "Divida la masa en seis piezas de igual tamaño. Empuje uno en cada uno de los agujeros en la bandeja del muffin. Cubra la bandeja con una toalla de té limpia y húmeda y déjela a un lado en una habitación tibia durante 45-60 minutos, o hasta que los bollos casi hayan duplicado su tamaño.", "Precalentar el horno a 200C / 400F / Gas 6.", "Hornee los panecillos en el horno durante 20-25 minutos, o hasta que se levanten, dorados y cocidos (un pincho insertado en el centro de cada uno debe salir limpio). Retire los panecillos de la bandeja del muffin mientras todavía estén calientes (tenga cuidado ya que el dulce de azúcar estará muy caliente).", "Sirva con uvas sin semillas, si lo desea."], "url": "www_bbc_co_uk_food_recipes_fruit_and_fudge_buns_26812", "title": "Bollos de fruta y dulce de azúcar", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 6 bollos", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4kg / 9lbs comiendo manzanas, peladas, sin corazón y picadas", "Azúcar demerara 250 g / 9 oz", "2 litros / 3½ pintas de agua", "200g / 7oz de mantequilla sin sal", "800 g / 1 libra de avena 12 oz", "200g / 7oz de coco desecado", "1 cucharada de canela molida", "150 g / 5½ oz de miel", "2kg / 4lb 8oz de yogur natural"], "method": ["Precalentar el horno 200C / 400F / Gas 6.", "Coloque las manzanas, el azúcar y el agua en una olla grande y cocine suavemente durante 10-15 minutos, o hasta que las manzanas comiencen a romperse. Retirar del fuego y reservar para enfriar.", "Derretir la mantequilla en un microondas. Coloque en un tazón grande y agregue la avena, el coco, la canela y la miel. Extienda la mezcla en bandejas grandes para hornear y cocine en el horno durante 7-8 minutos, o hasta que estén doradas. Retirar del horno y reservar para enfriar.", "Para servir, coloque las manzanas enfriadas en tazones individuales para servir, cubra con el yogur y espolvoree sobre la mezcla de granola."], "url": "www_bbc_co_uk_food_recipes_fruit_and_yoghurt_with_32329", "title": "Fruta y yogurt con granola casera", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 40", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2-3 ciruelas maduras", "1 cucharada de jugo de naranja", "1 cucharada de miel líquida", "40g / 2oz de mantequilla", "1 cucharada de azúcar demerara", "1 rebanada gruesa de pan"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 200C / 400F / Gas 6.", "Asegúrate de pedirle a un adulto que te ayude a usar el cuchillo: corta las ciruelas a lo largo, luego gira las ciruelas por la mitad y saca la piedra.", "Coloque las ciruelas con el lado plano hacia abajo y córtelas a la mitad otra vez. Ponlos en una cacerola con el jugo de naranja y la miel y revuelve hasta que todas las ciruelas estén cubiertas.", "Derrita la mantequilla en una cacerola pequeña; necesitará un adulto para ayudarlo con esto. Póngalo a un lado para que se enfríe un poco mientras corta el pan en cuadrados grandes con el cuchillo de mesa para hacer el relleno. Coloque el pan en la mantequilla y bátalo para cubrir el pan. Agregue la mitad del azúcar demerara hasta que esté bien combinado.", "Incline el pan encima de las ciruelas y espolvoree la parte superior con el azúcar demerara restante.", "Pídale a un adulto que coloque la cacerola en el horno durante 20-25 minutos o hasta que el relleno esté dorado y crujiente y la fruta esté suave. Sirve con yogur o crema pastelera."], "url": "www_bbc_co_uk_food_recipes_fruit_jumble_25437", "title": "Mezcla de frutas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "300 g / 10½ oz de azúcar en polvo", "1 litro / 1¾ pintas de crema doble", "1 cucharada de pasta de frijoles de vainilla", "Fresas de 500g / 1lb 2oz, cascos eliminados, cortados por la mitad", "4 ciruelas, cortadas a la mitad, sin piedras, en rodajas finas", "5 higos maduros, cortados en pequeñas cuñas", "100 g / 3½ oz de azúcar en polvo", "2 cucharadas de almendras copos tostadas"], "method": ["Precaliente el horno a 110C / 90C Fan / Gas ½.", "Para los merengues, usando una lata de pastel como plantilla, dibuje círculos de 4 x 20 cm / 8 en 4 hojas de papel de silicona o papel para hornear. Déles la vuelta y coloque una hoja en cada una de las 4 bandejas planas para hornear.", "Batir las claras de huevo en un bol hasta que se formen picos suaves cuando se quite el batidor. Agregue el azúcar y continúe batiendo hasta que la mezcla esté suave y brillante y se formen picos rígidos cuando se quite la batidora.", "Con una cuchara, coloque la mezcla de clara de huevo en una manga pastelera con una boquilla normal de 1 cm / ½ pulgada. Use un punto de la mezcla para pegar cada esquina del papel de hornear en la bandeja. (Esto detiene el papel y el merengue soplado por el ventilador del horno.) Pipe la mezcla dentro de cada plantilla circular, comenzando en el centro y trabajando para llenarlo. Alisa cada disco de merengue con una espátula húmeda.", "Cocine los merengues en el horno durante 2 horas. Retire del horno para que se enfríe completamente antes de armarlo.", "Para el relleno, bata la crema y la pasta de vainilla en un bol hasta que se formen picos suaves cuando se quite la batidora.", "Para ensamblar, coloque un disco de merengue en un soporte para pasteles o en un plato grande para servir. Extienda un tercio de la crema de vainilla y luego esparza más de una cuarta parte de la fruta en rodajas. Cubra con un segundo disco de merengue. Repita el proceso de estratificación, encabezando el último disco de merengue con la fruta restante.", "Para servir, derrita el azúcar en una sartén de base pesada hasta que comience a caramelizar y se ponga dorado. Agregue las almendras copos hasta que estén completamente cubiertas. Rocíe la mezcla de nueces azucaradas en la parte superior del castillo. Enfriar en la nevera durante aproximadamente 1 hora antes de servir."], "url": "www_bbc_co_uk_food_recipes_fruit_meringue_gteau_22379", "title": "Pastel de merengue de frutas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "75 g / 2½ oz de azúcar en polvo", "pizca de sal", "1 vaina de vainilla, solo semillas", "150g / 5½oz de mantequilla sin sal, suavizada", "1 huevo de gallinas camperas, ligeramente golpeado", "1 cucharada de leche", "1 litro de leche entera", "1 vaina de vainilla, dividida por la mitad longitudinalmente", "6 yemas de huevo de gallinas camperas", "125 g / 4½ oz de azúcar en polvo", "Harina normal de 40 g / 1½ oz", "½ fresas para cestito, sin cáscara", "½ cestillo de frambuesas", "½ cestones de moras", "½ redcurrants de redil", "325ml / 11fl oz de champán rosado", "4 hojas de gelatina, suavizadas en agua fría durante 10 minutos", "75g / 2½ oz de azúcar"], "method": ["Para la masa, coloque la harina, el azúcar, la sal, las semillas de vainilla y la mantequilla en un procesador de alimentos. Use la configuración de pulso para mezclar hasta combinar. Agregue el huevo batido y la leche, luego pulse de nuevo hasta que la masa se una y deje los lados del recipiente.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada. Forme una bola y envuélvala en una película adhesiva y colóquela en la nevera durante al menos una hora antes de usarla. (Los pasteles también pueden prepararse y congelarse o guardarse en la nevera por hasta cuatro días).", "Precalentar el horno a 180C / 320F / Gas 4.", "Una vez enfriado, en una superficie de trabajo enharinada enrolle la masa finamente. Cubra un plato de flan o quiche de 20-23 cm / 8-9 pulgadas con la masa. Coloque un pergamino para hornear en el medio y llénelo con alubias para hornear. Hornee durante 30 minutos o hasta que la masa esté dorada clara (para hornear a ciegas, la masa no debe estar completamente cocida).", "Para la crème pâtissière, en una sartén ponga a hervir la leche y la vainilla. Retire del fuego y reserve para infundir.", "En un tazón, unte las yemas de huevo y el azúcar hasta que estén pálidas y esponjosas, luego agregue la harina. Retire la vaina de vainilla de la leche caliente y reserve. Vierta la leche sobre la mezcla de yema de huevo y mezcle bien. Regrese la mezcla a la sartén y caliente, revolviendo continuamente, a fuego medio hasta que esté lo suficientemente espesa como para cubrir la parte posterior de una cuchara.", "Retire del fuego. Coloque un colador fino sobre un recipiente y cuele la crème pâtissière en él. Cubra con clingfilm para que la película transparente se asiente directamente sobre la crème pâtissière (para evitar que se forme una piel) y refrigere hasta que se haya enfriado por completo.", "Llene la caja de repostería con la crème pâtissière y alise la superficie con una espátula o con el dorso de una cuchara.", "Para la cobertura de fruta, coloque las fresas, frambuesas, moras y grosellas rojas en la parte superior. Enfriar en la nevera hasta que sea necesario.", "Para la gelatina, caliente la mitad del champán en una sartén a fuego lento. Agregue el azúcar y cocine hasta que se derrita, luego agregue la gelatina ablandada y mezcle bien. Vierta el resto del champán y revuelva. Transferir a la nevera para enfriar. Cuando la gelatina esté casi lista, espolvee sobre la tarta de fruta y alise la superficie.", "Enfríe en la nevera hasta que la gelatina se haya solidificado por completo."], "url": "www_bbc_co_uk_food_recipes_fruit_tart_28132", "title": "Tarta de frutas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Hace 1 tarta grande", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 350g / 12oz", "pizca de sal", "125g / 4½oz de mantequilla sin sal, aplastada entre dos hojas de papel resistente a la grasa a 1cm / ½ pulgada de grosor, enfriada en la nevera", "125 g / 4½ oz de azúcar en polvo", "2 huevos de gallinas camperas, enteros y 1 huevo, solo yema", "1 huevo, solo yema, batido para lavar huevos", "500ml / 18fl oz de leche entera", "2 vainas de vainilla, semillas retiradas y vainas retenidas", "6 huevos de gallinas camperas, solo yemas", "120 g / 4½ oz de azúcar en polvo", "Harina normal de 50g / 2oz", "4 cucharadas de kirsch", "400 g / 14 oz de fresas", "100 g / 3½ oz de grosellas rojas", "100g / 3½ oz de grosellas blancas", "100 g / 3½ oz zarzamoras", "4 cucharadas de mermelada de albaricoque claro", "Consejos de menta de 75g / 2¾oz", "50g / 2oz de azúcar glasé", "100 g / 3½ oz de pistachos verdes desgranados, aproximadamente picados"], "method": ["Para la repostería dulce, precaliente el horno a 190C / 350F / Gas 5.", "Engrasar ligeramente y enharinar 12 x 8 cm / 3¼ en latas sueltas.", "Mezcle la harina y la sal juntas en un tazón grande. Agregue la mantequilla aplanada directamente del refrigerador en la harina y frote en la mezcla.", "Agregue el azúcar, mezcle los huevos y la yema de huevo, y mezcle. Mezcle suavemente con un raspador de masa o espátula, hasta que la masa se una en una bola.", "Enharina ligeramente una superficie de trabajo, incline la bola de masa sobre ella, y amasar hasta que tenga una masa suave y suave. Forme la masa en un cuadrado, para que sea más fácil extenderla.", "Coloque la masa en la nevera para enfriar durante una hora como mínimo, preferiblemente durante la noche.", "Retire la masa del refrigerador y enharine ligeramente una superficie de trabajo. Extienda la masa de 2-3 mm de grosor y forre las 12 latas, dejando un voladizo de hojaldre. Coloque un poco de papel antigrasa en la parte superior y rellene con alubias para hornear. Descanse en la nevera durante 30 minutos.", "Una vez frío, coloque las cajas de tarta de hojaldre en una bandeja para hornear y cocine durante 15 minutos. Saque el papel y los frijoles, cepille con la yema de huevo batida y vuelva a colocar en el horno durante 8 minutos.", "Retirar del horno y dejar enfriar durante 15 minutos. Luego recorte los bordes y levante sobre una rejilla de enfriamiento.", "Para la crème patissière, coloque la leche, las semillas de vainilla y las vainas en una olla grande y tibia.", "Coloque los huevos, el azúcar y la harina en un tazón grande para mezclar y bata hasta que el color cambie y se vuelva pálido. Poco a poco agregue la leche tibia y la vainilla a la mezcla de huevo, batir juntos, luego regrese la mezcla a la sartén. Cocine a fuego lento hasta que la mezcla se espese, luego vierta en un recipiente limpio. Coloque un círculo de papel antigrasa sobre la mezcla para evitar que se forme la piel.", "Si quieres darle sabor a la crema con kirsch, agrégala a la crema una vez que esté fría.", "Para preparar las tartas de frutas, coloque la crema pastelera en una bolsa de plástico y vierta en las cajas de los pasteles. Cubra las tartas con las fresas, grosellas rojas o grosellas blancas y moras.", "Coloque el mermelada de albaricoque y 1-2 cucharadas de agua en una cacerola pequeña y caliente, para que se afloje y se vuelva más líquido. Cepille ligeramente la fruta para glasear.", "Para servir, coloque las tartas en un soporte para pasteles y espolvoree con azúcar glas y adorne con puntas de menta o pistachos."], "url": "www_bbc_co_uk_food_recipes_fruit_tarts_45402", "title": "Tartas de frutas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_tarts_45402_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina natural, más extra para espolvorear", "100g / 3½oz de azúcar glasé", "250 g / 9 oz de mantequilla, en cubos", "1 yema de huevo de gallinas camperas", "salpicar agua helada, si es necesario", "500ml / 18fl de leche en oz", "6 yemas de huevo de gallinas camperas", "Harina normal de 40 g / 1½ oz", "125 g / 4½ oz de azúcar en polvo", "un poco de azúcar glas, al polvo", "½ jar de mermelada de albaricoque", "piña, pelada y cortada en cubitos", "Frambuesas 400 g / 14 oz", "puñado de fresas", "puñado de uvas"], "method": ["Para la masa, tamizar la harina y el azúcar glas en un tazón para mezclar hasta que estén bien combinados. Incline los cubos de mantequilla y frótelos con los dedos hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo batido y trabaje junto con sus manos hasta que la masa se una. Es posible que deba agregar un chorrito de agua helada si la masa está demasiado seca. Envuelva la película adhesiva y déjela reposar en la nevera durante al menos diez minutos.", "Precalentar el horno a 180C / 350F / Gas 4.", "Retire la masa de la nevera y despegue la película adhesiva. Ruede los pasteles sobre una superficie bien enharinada a un espesor de aproximadamente 5 mm / ¼ in.", "Corta los círculos de la masa con un cortador que es solo un poco más grande que un conjunto de cajas de tarta de 10 cm / 4 in. Cuidadosamente alinee las cajas de tarta en miniatura, asegurándose de que se superponga un poco al borde. Alternativamente, coloque la masa en la parte superior de las latas de barquette y haga rodar un rodillo sobre la caja de tarta para que se adapte a su forma, esto debería cortar la masa exactamente del mismo tamaño que la caja. A continuación, presione la masa en la tarta de tarta con los dedos.", "Pinche la base de la masa con un tenedor. Presione un cuadrado de papel de aluminio más grande que la lata contra la parte inferior para hacer la forma de la lata. Luego coloque la lámina en la caja de los pasteles y llene la caja con granos de cerámica para hornear. Repita con los pasteles y cajas restantes.", "Coloque todas las cajas en el horno y hornee durante aproximadamente 15 minutos, o hasta que estén cocidas y crujientes hasta el final. Retire los frijoles y el forro de papel de aluminio y deje las cajas a enfriar en una rejilla de alambre. Luego retírelo de las latas y déjelo a un lado.", "Para la crème pâtissière, caliente la leche en una sartén grande hasta que esté hirviendo.", "Mezcle bien las yemas de huevo, la harina común y el azúcar en un bol. Vierta la leche en el recipiente que contiene los huevos y bata para combinar. Vierta toda la mezcla en la sartén y cocine a fuego medio mientras revuelve constantemente. La mezcla debe espesar, ya que acaba de llegar a ebullición.", "Retirar del fuego y transferir a un recipiente para enfriar. En este punto espolvorea un poco de azúcar glas para evitar que se forme una piel.", "Pase la mermelada a través de un colador en un recipiente limpio para que quede lisa. Calentar la mermelada de albaricoque con dos cucharadas de agua y dejar enfriar.", "Cuchara un poco de crème pâtissière enfriado en cada una de las cajas de tartas. Cubra con cualquier fruta que desee antes de cepillar ligeramente con la mermelada de albaricoque refrigerado."], "url": "www_bbc_co_uk_food_recipes_fruit_tarts_77282", "title": "Tartas de frutas", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Hace 18 tartaletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruit_tarts_77282_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina normal de 250g / 9oz", "125g / 4½ oz de azúcar", "125g / 4½oz de mantequilla, cortada en cubitos", "25 g / 1 oz de almendras molidas", "1 cucharadita de polvo de hornear", "1 naranja, solo ralladura", "1 limón, ralladura solamente", "1 huevo de gallinas camperas, golpeado", "1 vaina de vainilla, semillas raspadas", "400ml / 14fl oz de leche entera", "115g / 4 oz de azúcar", "6 yemas de huevo de gallinas camperas", "30 g / 1 oz de harina de maíz, mezclada en una pasta con un poco de agua fría", "50ml / 2fl oz de flor de saúco cordial", "115g / 4 oz de azúcar", "250ml / 9fl oz de jugo de manzana", "2 cucharadas de harina de maíz", "2 cucharadas de jarabe de oro", "175 g / 6 oz de arándanos", "Frambuesas 175g / 6oz", "175g / 6 oz de grosellas rojas", "175g / 6oz de grosella blanca"], "method": ["Para la masa, pulse la harina, el azúcar, la mantequilla, las almendras molidas, el polvo de hornear y los zumos de cítricos en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Agregue el huevo batido y el pulso hasta que la mezcla se una como una masa (agregue un poco de agua fría si es necesario). Presione la masa en una bola, envuélvala en film transparente y déjela enfriar en la nevera durante al menos 30 minutos.", "Precaliente el horno a 200C / 400F / Gas 6. Engrase dos petit four latas de seis orificios.", "Para la crema pastelera, lleve las semillas de vainilla y la leche a ebullición, en una cacerola, batiendo todo el tiempo. Retire la sartén del fuego.", "Batir el azúcar y las yemas de huevo en el bol por 3-5 minutos, o hasta que la mezcla caiga en gruesas cintas del batidor. Bata lentamente la pasta de harina de maíz hasta que esté bien combinada.", "Agregue la leche caliente en un flujo constante y cuando esté completamente incorporada, vuelva a verter la mezcla en la cacerola. Caliente la mezcla, batiendo constantemente, hasta que hierva. Cocine por un minuto más, luego vierta la mezcla en un tazón. Reserve para enfriar durante 10 minutos, luego agregue el cordial de flor de saúco. Cubra con la película adhesiva y relájese en la nevera.", "Extienda la masa en una superficie de trabajo enharinada y úsela para revestir las cuatro latas pequeñas. Hornee en el horno durante 7-10 minutos o hasta que la masa esté dorada y crujiente. Deje que las cajas de tarta se enfríen un poco y luego transfiéralas cuidadosamente a una rejilla de alambre.", "Para el glaseado, caliente el azúcar y la mitad del jugo de manzana en una cacerola hasta que hierva, luego retire la sartén del fuego.", "Disuelva la harina de maíz en el jugo restante, vierta rápidamente la mezcla en la cacerola y vuelva a calentar. Cocine hasta que la mezcla se espese, revolviendo todo el tiempo, luego agregue el jarabe dorado, vuelva a hervir y retire la sartén del fuego. Dejar de lado para refrescar", "Para armar las tartas, espolvorea un poco de crema pastelera en cada caja de repostería. Coloque la fruta en la parte superior y rocíe sobre el glaseado. Enfríe en el refrigerador hasta que esté listo para servir."], "url": "www_bbc_co_uk_food_recipes_fruit_tarts_with_07623", "title": "Tartas de frutas con flan de flor de saúco", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Hace 12", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200 g / 7oz de frijoles pequeños, con las vainas retiradas (peso envasada) (use frijoles congelados si no están disponibles)", "2 cucharadas de aceite de oliva", "1 cebolla roja pequeña, pelada, picada", "sal y pimienta negra recién molida", "6 huevos grandes de gallinas camperas", "100 g / 3½ oz de queso feta, desmenuzado", "pequeño manojo de menta fresca, solo hojas (opcional)"], "method": ["Cocine las habas en una sartén de agua hirviendo con sal durante 2-3 minutos o hasta que estén tiernas. Escurrir bien, luego actualizar en agua fría. Cuando los granos estén lo suficientemente fríos como para manipularlos, quíteles las pieles externas, si así lo desea.", "Caliente el aceite en una sartén pequeña a prueba de horno a fuego lento. Agregue la cebolla y sazone con una pizca de sal. Freír durante 8-10 minutos, o hasta que se ablanden pero no se doren.", "Mientras tanto, precalentar la parrilla a su nivel más alto. En un tazón, bata los huevos hasta que estén bien combinados y llenos de aire, luego condimenta al gusto, con sal y pimienta negra recién molida.", "Cuando las cebollas se hayan suavizado, aumente el fuego a medio y vierta los huevos batidos. Espolvoree sobre el queso feta desmenuzado, las hojas de menta (si se usan) y las habas cocidas. Deje la sartén al fuego durante 2-3 minutos, o hasta que la parte inferior de la mezcla de huevos esté dorada. (NB: No revuelva la mezcla).", "Transfiera la sartén a la parrilla y cocine por otros 2-3 minutos, o hasta que la parte superior de la mezcla de huevos esté firme y dorada. Coloque un plato grande boca abajo sobre la sartén, luego gire la sartén para que la tortilla caiga sobre el plato. Cortar en trozos y servir con pan blanco crujiente."], "url": "www_bbc_co_uk_food_recipes_fruitalia_91683", "title": "Frittata de frijoles y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fruitalia_91683_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de frutas secas mezcladas, incluyendo albaricoques, pasas, pasas, grosellas y cerezas", "Goteo de carne clarificada 90 g / 3½ oz", "150g / 5oz de azúcar morena suave", "225ml / 8fl oz de agua", "mantequilla, para engrasar", "Harina integral 225g / 8oz", "1 cucharadita de polvo de hornear", "½ cucharadita de bicarbonato de soda", "¼ cucharadita de canela molida", "¼ cucharadita de nuez moscada molida", "¼ cucharadita de pimienta de Jamaica molida", "4 huevos de gallinas camperas, ligeramente golpeados", "550g / 1lb 4oz de naranjas de Sevilla", "1 limón, solo jugo", "1.3 litros / 2pt 4 fl oz de agua", "1,1 kg / 2 lb 6 oz de azúcar granulada"], "method": ["Para la torta, coloque la fruta mezclada, el goteo, el azúcar y el agua en una sartén a fuego medio y deje que hierva, revolviendo constantemente. Retirar del fuego y dejar enfriar y remojar durante la noche.", "Precalentar el horno a 180C / 365F / Gas 4.", "Engrase y forre una lata pequeña de pan.", "Tamiza la harina, el polvo de hornear, el bicarbonato de soda, la canela, la nuez moscada y la pimienta de Jamaica en un tazón grande.", "Agregue la mezcla de fruta enfriada y mezcle bien.", "Agregue los huevos uno por uno y bata la mezcla para combinar bien entre agregar cada uno.", "Vierta la mezcla de la torta en la lata de la torta y nivele la parte superior con una espátula. Coloque en el horno para hornear durante 1-1 ¼ horas, o hasta que la parte superior esté dorada y un pincho de metal salga limpio. (Es posible que deba cubrir la parte superior con papel de aluminio si comienza a dorarse demasiado).", "Retire del horno y deje enfriar en la lata durante 30 minutos antes de encender y dejar que se enfríe completamente en una rejilla de alambre.", "Para la mermelada de naranja de Sevilla, divida las naranjas a la mitad y coloque la carne en un procesador de alimentos, dejando atrás la médula. Mezcle la pulpa anaranjada con un puré suave y pase a través de un tamiz fino en una sartén no reactiva.", "Retire la médula restante de la cáscara restante, luego corte la cáscara en tiras finas y déjela a un lado.", "Agregue el jugo de limón, el agua y la cáscara en rodajas a la sartén de jugo de naranja y deje hervir a fuego medio. Reduzca el fuego y cocine a fuego lento durante 1-1½ horas, hasta que la cáscara esté tierna y el volumen del líquido se haya reducido a la mitad.", "Agregue el azúcar y revuelva hasta que se haya disuelto por completo. Vuelva a poner la mezcla a ebullición y cocine por otros 10 minutos, eliminando cualquier espuma que pueda formarse en la superficie con una cuchara.", "Pon a prueba si la mermelada está lista, colocando un poco sobre un plato frío y empujándolo con el dedo, debería ser como gelatina. Si todavía está moqueando, cocine por otros 5-10 minutos, o hasta que quede como gelatina en la placa fría.", "Dejar enfriar un poco antes de verter en recipientes esterilizados. (La mermelada debe conservarse hasta dos meses en el refrigerador si no se abre).", "Para servir, corte la torta y extienda generosamente con la mermelada."], "url": "www_bbc_co_uk_food_recipes_fruitdrippingcakewit_85924", "title": "Pastel de goteo de frutas con mermelada de naranja de Sevilla", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ piña, pelada y sin corazón", "2 mangos, pelados, cortados a la mitad y deshuesados", "1 papaya, pelada, partida a la mitad y descamada", "1 fruta de dragón, pelada", "2 kiwis, pelados", "12 lichis, pelados y deshuesados", "¼ sandía (sin semillas)", "12 hojas de lima kaffir, lavadas", "6 palos de hierba de limón, hojas externas eliminadas"], "method": ["Corta los frutos en formas ásperas.", "Pase los frutos por el limoncillo alternando cada tercera fruta con una hoja de lima.", "Enfríe hasta que se requiera o coloque en una barbacoa o parrilla y cocine durante 2 minutos a cada lado.", "Servir caliente o frío."], "url": "www_bbc_co_uk_food_recipes_fruitkebabskewers_10298", "title": "Brochetas de kebab de fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["3kg / 6¾lb gammon (ahumado o no ahumado según preferencia)", "1 litro / 1¾ pintas de jugo de piña", "1 litro / 1¾ pintas de jugo de manzana", "2 hojas de laurel", "Anís de 2 estrellas", "4 bayas de pimienta de Jamaica", "1 manzana, cortada por la mitad", "1 naranja, pelada, cortada por la mitad, médula eliminada", "1 lima, ralladura solamente", "1 ramita de canela", "Jengibre fresco de la raíz de los 7.5cm / 3in, pelado", "4 cucharaditas de mermelada de naranja espesa", "2 cucharadas de miel clara", "1 cucharadita de especias mixtas", "1 cucharadita de jengibre molido", "1 cucharadita de pimienta negra recién molida", "2 manojos de berro, solo hojas", "1 piña fresca de tamaño mediano, pelada y picada", "½ pepino, cortado por la mitad horizontalmente, semillas recogidas con una cuchara, carne picada finamente", "½ bombilla mediana de hinojo, en rodajas finas", "1 guindilla roja, sin semillas, carne picada finamente", "4 cucharaditas de azúcar en polvo de oro", "2 cucharadas de vinagre de frambuesa", "4 remolachas frescas, cocidas y picadas", "2 manzanas de postre grandes, peladas y finamente picadas", "1 lima, cáscara y jugo solamente", "4 cucharadas de hojas de menta fresca picadas"], "method": ["Para el jamón, ponga todos los ingredientes a punto de ebullición en una sartén grande. Reduzca el fuego a fuego lento, luego cubra y cocine a fuego lento durante tres horas, o hasta que el jamón esté cocido.", "Mientras tanto, para el glaseado de mermelada, coloque todos los ingredientes de glaseado de mermelada en una sartén y caliente a fuego medio, revolviendo bien, hasta que la mezcla esté suave y bien combinada.", "Cocine a fuego lento la mezcla durante 4-5 minutos, revolviendo continuamente, luego retire del fuego y reserve.", "Precalentar el horno a 180C / 350F / Gas 4.", "Transfiere el jamón cocido a una lata de asar. (El licor de cocción se puede colar y hervir a fuego lento durante 20 minutos hasta que espese a la consistencia de una salsa, si se desea, para servir con el plato terminado.)", "Retire la piel del gammon, dejando la capa subyacente de grasa expuesta. Con un cuchillo afilado, califica la grasa en forma de diamante.", "Cepille el glaseado de mermelada sobre el jamón, luego hornee en el horno durante 25-30 minutos, o hasta que el glaseado de mermelada se haya vuelto dorado y esté pegajoso, luego retírelo del horno y déjelo a un lado en un plato tibio para que descanse.", "Para la salsa de piña, en un tazón, mezcle la piña, el pepino, el hinojo y el chile hasta que estén bien combinados.", "Caliente el azúcar y el vinagre en una sartén no reactiva hasta que el azúcar se haya disuelto y la mezcla esté bien combinada. Rocíe la mezcla sobre la mezcla de piña y mezcle bien para combinar.", "Para la remolacha y la salsa de manzana, coloque la remolacha picada y las manzanas en un tazón y mezcle bien.", "Agregue el jugo de limón y la ralladura y mezcle bien para cubrir la remolacha y la manzana.", "Agregue la menta picada y mezcle bien.", "Para servir, coloque un puñado de berros en el centro de cada uno de los seis platos para servir. Tallar el jamón en rodajas gruesas y colocar dos rodajas en el berro. Coloque una cucharada de cada salsa junto con el gammon. Rocíe la salsa alrededor del borde de cada plato, si lo usa."], "url": "www_bbc_co_uk_food_recipes_fruitgammonwithspice_90783", "title": "Gammon con glaseado de mermelada con especias y dos salsas zingy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2 oz de harina de centeno integral, más extra para quitar el polvo", "25g / 1oz de azúcar moscatel marrón oscuro", "10g de sal", "10g de levadura seca de acción rápida", "200g / 7oz de mantequilla sin sal, ablandada", "12 langostinos", "12 navajas de afeitar, restregadas", "400 g / 14 oz de almejas en sus conchas, restregado", "1 x 1kg / 2lb 4 oz de langosta cocida", "1 cangrejo marrón cocido mediano", "8 ostras, descascaradas", "16 camarones cocidos en sus caparazones", "200g / 7oz de camarones marrones cocidos", "3 yemas de huevo de gallinas camperas", "1 cucharada de mostaza Dijon", "2 cucharadas de vinagre de sidra", "1 limón no encerado, jugo y ralladura finamente rallada", "300ml / 10½ fl oz aceite de colza", "sal y pimienta negra recién molida"], "method": ["Para el pan de centeno y la mantequilla, coloque la harina, el azúcar y la sal en un tazón grande o un mezclador de alimentos con un gancho de masa. Vierta 200ml / 7fl oz de agua tibia en una jarra y espolvoree sobre la levadura, mezcle para combinar. Agregue gradualmente el agua de levadura a los ingredientes secos, mezclándolos continuamente, hasta que se haya incorporado toda el agua de yeasted. Agregue otro 150ml / 5fl oz de agua y mezcle hasta que se mezcle como una masa.", "Convierta la masa en una superficie de trabajo ligeramente enharinada y amase bien durante 5-10 minutos, o hasta que quede suave y elástica. Enrolle la masa en forma de salchicha larga, luego transfiera a una bandeja para hornear forrada con papel de hornear, cúbrala con film transparente y déjela a un lado para que se demuestre durante al menos 6 horas, preferiblemente durante la noche, hasta que la masa duplique su tamaño.", "Cuando la masa haya demostrado, precaliente el horno a 220 ° C / 200 ° Ventilador / Gas 7. Destape la masa y el polvo con un poco de harina de centeno, luego barra la parte superior diagonalmente varias veces con un cuchillo afilado. Hornee el pan en el horno durante 30 minutos o hasta que se dore y la base suene hueca cuando se golpee firmemente. Dejar enfriar un poco.", "Mientras tanto, mezcle la mantequilla ablandada en un procesador de alimentos hasta que quede pálida y esponjosa, luego transfiérala a un plato para servir.", "Para las frutas de mermelada, cocine al vapor las langostinos, navajas y almejas durante 5-8 minutos, o hasta que estén bien cocidas (deseche las almejas que no se abran durante la cocción). Para hacer esto, puede colocar los diferentes ingredientes en capas separadas de un barco de vapor y suspender la pila sobre una sartén medio llena de agua hirviendo. Alternativamente, vaporizar cada ingrediente por separado usando un inserto de vapor. Dejar de lado.", "Cortar la langosta por la mitad a lo largo y quitar las patas y las garras. Deseche el contenido de la cabeza, dejando solo la carne del cuerpo. Rompe las garras de la langosta y los nudillos golpeándolos con un rodillo, luego saca la carne y apílala en el caparazón del cuerpo.", "Abre el caparazón del cangrejo y descarta los dedos del muerto (las branquias similares a esponjas). Retire las garras y la grieta golpeándolas con un rodillo. Elija la carne y apílala en el caparazón de cangrejo.", "Para la mayonesa, bata las yemas de huevo, la mostaza, el vinagre y el jugo de limón en un bol hasta que estén bien combinados. Poco a poco agregue el aceite en una corriente delgada, batiendo continuamente, hasta que todo se haya incorporado a la mezcla para formar una mayonesa espesa. Agregue la ralladura de limón y condimente, al gusto, con sal y pimienta negra recién molida.", "Para servir, apile los mariscos, incluidas las ostras y los camarones, en un plato grande para servir. Sirva la mayonesa de limón y la mantequilla batida en tazones al lado, con el pan de centeno rebanado."], "url": "www_bbc_co_uk_food_recipes_fruits_de_mer_with_26114", "title": "Frutas de mer con pan casero de centeno y mantequilla batida", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["5 cucharadas de licor de amaretto", "Fresas de 200g / 7oz, partidas por la mitad", "Arándanos 200g / 7oz", "Melón 200 g / 7 oz, en cubos", "menta, para adornar (opcional)"], "method": ["Remoje toda la fruta en el amaretto durante al menos 1 hora.", "Sirva la fruta en un vaso y espolvoree un poco de amaretto para marinar la fruta.", "Decorar con una ramita de menta."], "url": "www_bbc_co_uk_food_recipes_fruitsalad_67181", "title": "Ensalada de frutas", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["275g / 10oz de harina de arroz", "Harina de tapioca 50g / 2oz", "4 cucharaditas de polvo de hornear sin gluten", "2 cucharaditas de goma de xantano", "1 cucharadita de sal", "4 cucharadas de azúcar en polvo", "110g / 4oz de mantequilla", "Sultanas 110 g / 4oz", "2 huevos, preferiblemente de campo abierto", "125ml-175ml / 4-6fl oz de yogur natural", "1 huevo, batido, para lavar huevos"], "method": ["Precalentar el horno a 250C / 475F / Gas 9.", "Tamiza todos los ingredientes secos en un tazón grande y mezcla bien. Frote en la mantequilla. Agregue las sultanas y mezcle suavemente.", "Batir ligeramente los huevos y el yogurt natural juntos.", "Haga un pozo en el centro de los ingredientes secos y agregue la mezcla de huevo y yogur. Mezclar a masa suave, agregando un poco más de yogur natural si es necesario.", "Dale vuelta a una tabla con harina de arroz y amasa ligeramente, lo suficiente como para formar una ronda. Estirar a aproximadamente 2,5 cm / 1 pulgada de espesor y recortar rondas con un cortador de 5.5 cm / 2¼ pulgadas. Coloque en una bandeja para hornear con harina de arroz y cepille con un poco de huevo.", "Hornee durante aproximadamente 10 minutos hasta que estén doradas en la parte superior. Dejar enfriar sobre una rejilla.", "Servir por la mitad con mantequilla y mermelada de frambuesa casera."], "url": "www_bbc_co_uk_food_recipes_fruitscones_74767", "title": "Bollos de fruta sin gluten", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 15", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar y untar con mantequilla el bollo de leche", "10-12 rebanadas de pan de brioche cuadrado", "Frambuesas 300g / 10½ oz", "125 g / 4½ oz de azúcar en polvo", "1-2 cucharadas de licor de frambuesa, como framboise (opcional)", "4 huevos de gallinas camperas", "Leche 400ml / 14oz", "Crema doble 400ml / 14oz", "1 naranja grande, solo ralladura", "1-2 cucharadas de azúcar demerara"], "method": ["Unte con mantequilla un plato de tarta para horno grande y poco profundo. Unte con mantequilla las rebanadas de brioche y córtelas a la mitad en diagonal. Coloque una capa de las rebanadas, con la mantequilla hacia arriba, en el plato. Ponga 100 g / 3½ oz de las frambuesas en un tazón pequeño y espolvoree con el licor de frambuesa si usa y 2 cucharadas de azúcar en polvo. Aplastar muy ligeramente, luego cuchara esto sobre la capa de brioche.", "Espolvorea unas frambuesas enteras más. Cubra con las rodajas de brioche restantes, luego coloque las frambuesas restantes sobre el brioche, metiendo unas pocas en medio de las rebanadas y dejando unas pocas en la parte superior.", "Batir el azúcar restante con los huevos, luego agregar la leche, la crema doble y la ralladura de naranja. Asegúrese de que todo esté bien combinado, luego vierta esta mezcla sobre el brioche y las frambuesas.", "Deje reposar el budín durante media hora. Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Puntee el pudín con unos cuantos panecillos de mantequilla, luego espolvoree sobre el azúcar demerara.", "Hornee en el horno durante 35-45 minutos, o hasta que estén bien colocados, dorados y ligeramente tostados en algunos lugares. Coma caliente o frío."], "url": "www_bbc_co_uk_food_recipes_fruity_bread_and_butter_22104", "title": "Pan con sabor a fruta y pudín de mantequilla", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 pera en conserva, escurrida, jugo reservado", "4 cucharaditas de frutas secas mezcladas", "30g / 1oz de mantequilla sin sal", "gran pizca de especias mixtas", "1 cucharadita de azúcar en polvo", "4 hojas de hojaldre fresco"], "method": ["Antes de cocinar, lávese las manos y póngase un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que caliente el horno a 200C / 400F / Gas 6. Mida la fruta mezclada desecada en una taza y luego agregue un poco de jugo de pera de la fruta en lata - ponga a un lado durante cinco minutos mientras corta la pera.", "Pica la pera en un tazón con las tijeras; pide a un adulto que te ayude a usar las tijeras. Escurra la fruta mezclada y agréguela a la pera.", "Pídale a un adulto que lo ayude a derretir la mantequilla en una cacerola pequeña, luego coloque en un tazón con la mezcla de especias y el azúcar. Revuelva con el pincel de pastelería. Extiende una hoja de filo con el lado corto más cercano a ti y cepilla el filo con la mezcla de mantequilla.", "Coloque un cuarto de la mezcla de frutas en el centro en el borde más cercano a usted y luego doble los lados largos para cubrir la mezcla.", "Cepille el filo de nuevo con un poco más de su mezcla de mantequilla, luego enrolle la longitud de la masa para hacer un paquete.", "Repita para hacer cuatro paquetes y cepille la parte superior de cada uno con la mezcla de mantequilla restante. Coloque en una bandeja para hornear. Pídale a un adulto que los ponga en el horno precalentado y hornee por 10 minutos. Deje que se enfríe antes de comer ya que el relleno está muy caliente. Sirve los paquetes con yogur natural."], "url": "www_bbc_co_uk_food_recipes_fruity_filo_parcels_52065", "title": "Paquetes de filo con sabor a fruta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}]