[{"isVegetarian": false, "title": "Trout croquettes", "url": "www_bbc_co_uk_food_recipes_troutcroquettes_91864", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutcroquettes_91864_16x9.jpg", "ingredients": ["1 x 450g/1lb fresh brown or rainbow trout, guts and gills removed", "25g/1oz butter", "½ small onion, peeled, finely chopped", "40g/1½oz plain flour, plus three tablespoons for dredging", "250ml/9fl oz full-fat milk", "1 tsp tomato purée", "2 tsp finely chopped fresh tarragon leaves", "1 tsp Dijon mustard", "3 tbsp double cream", "salt and freshly ground black pepper", "2 large free-range eggs, beaten", "100g/3½oz fine white breadcrumbs (made from toasted stale bread blended in a food processor)", "8 tbsp ground almonds", "sunflower oil, for deep frying", "1 lemon, cut into wedges"], "serves": "Makes 15", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5. ", "Line a baking tray with aluminium foil and grease lightly with oil. Place the trout onto the prepared tray and cover with a second sheet of aluminium foil. Bake in the oven for 12-15 minutes, or until the fish is cooked through. (NB: The fish is cooked through when the flesh nearest the bone at the thickest part is opaque.)", "When the trout is cooked through, set aside to cool. When it is cool enough to handle, remove the skin and discard. Flake the fish into a sieve suspended over a bowl, discarding any bones. ", "Meanwhile, melt the butter in a large pan over a medium heat. When the butter is foaming, add the onion and fry for 2-3 minutes, or until starting to colour. ", "Stir in the flour and continue to heat for 30 seconds, stirring continuously. ", "Add the milk and continue to cook, stirring continuously, for 4-5 minutes, or until the mixture has thickened. ", "Remove the pan from the heat and beat in the tomato purèe, tarragon, Dijon mustard and cream until well combined. Season, to taste, with salt and freshly ground black pepper. Cover the pan with cling film and set aside to cool slightly. ", "When the mixture is tepid, stir in the trout flakes until well combined. Cover again and set aside until completely cooled, then chill in the fridge for a minimum of five hours, or until solid.", "When the trout mixture has cooled, make quenelles or balls of the mixture using two large spoons to form croquettes. ", "Pour the beaten eggs into a shallow bowl. Sprinkle half of the breadcrumbs and half of the ground almonds into another shallow bowl. Sprinkle the three tablespoons of flour into a third bowl.", "Dredge each croquette lightly in the flour, then dip it into the beaten egg, then roll in the breadcrumb mixture until completely coated. Place the prepared croquette onto a baking tray. Repeat the process until you have prepared eight croquettes.", "When eight of the croquettes have been prepared, discard the breadcrumb mixture and replace it with the remaining breadcrumbs and almonds. Repeat the process with the remaining croquette mixture until you have 12-16 croquettes. ", "Chill the croquettes in the fridge for at least 30 minutes.", "Half-fill a large pan with sunflower oil and heat to 180C (use a cooking thermometer to check the temperature). ", "When the oil is hot, carefully lower the croquettes, in batches, into the pan using a slotted spoon. Fry for 2-3 minutes, turning once during cooking, or until the breadcrumbs are crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt and keep warm. ", "Repeat the process with the remaining batches of croquettes. ", "To serve, pile the croquettes into the centre of a serving plate and squeeze over the juice from the lemon wedges."]}, {"isVegetarian": false, "title": "Trout en papillote", "url": "www_bbc_co_uk_food_recipes_troutenpapilotte_78165", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "½ red pepper, sliced", "½ red onion, sliced", "1 trout fillet", "1 lemon, sliced", "½ chilli, chopped", "1 tbsp soy sauce"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/425F/Gas 7. ", "Heat the oil in a wok and when hot add the red onion and red pepper. Stir fry for one to two minutes or until softened. ", "Spread out a large piece of baking parchment and place the stir fried vegetables onto the middle.", "Top with the trout fillet and place the lemon slices and chopped chilli on top. Pour over the soy sauce.", "Fold the parchment around the trout fillet and seal tightly. ", "Lay on a baking sheet and cook in a hot oven (220C) for ten minutes."]}, {"isVegetarian": false, "title": "Trout en papillote with white wine, dill and lemon", "url": "www_bbc_co_uk_food_recipes_troutenpapillotewith_88055", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 fillet rainbow trout, skin on", "50g/1¾oz fresh spinach leaves, washed", "½ lemon, sliced", "small bunch fresh dill", "2 tbsp white wine", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Using a sharp knife, score the skin of the trout diagonally at 2cm/½in intervals.", "Cut a sheet of foil about 30cm/12in square and lay a square of baking parchment of the same size on top. Place the pile of spinach in the centre of the baking parchment, followed by the trout fillet, the lemon slices, dill and white wine. Season with salt and freshly ground black pepper. ", "Bring the sides of the foil together over the fish and secure. Scrunch the two open ends together to make a 'tent' for the fish. Place on a baking tray and cook for 8-10 minutes, or until cooked through.", "To serve, place the foil parcel onto a serving plate and open it up."]}, {"isVegetarian": false, "title": "Trout fillet with pine nut crust, herb rice and spicy tomato sauce", "url": "www_bbc_co_uk_food_recipes_troutfilletwithpinen_88058", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["55g/2oz pine nuts", "1 fillet rainbow trout, halved", "1 tbsp olive oil", "15g/½oz butter", "½ lemon, juice only", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped ", "200g/7oz long grain rice", "200ml/7fl oz hot vegetable stock", "salt and freshly ground black pepper ", "2 tbsp chopped fresh dill, plus a sprig for garnish", "2 tbsp chopped fresh flatleaf parsley", "1 tbsp olive oil", "½ onion, finely chopped", "1 garlic clove, finely chopped ", "1 fresh green chilli, chopped", "3 fresh tomatoes, chopped", "salt and freshly ground black pepper ", "2 tbsp white wine", "1 handful fresh basil, torn"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "For the trout with pine nut crust, place the pine nuts in a food processor or mini blender and pulse until roughly chopped. Spread out on a tray and roll the trout fillet pieces in the nuts to coat.", "Heat the oil and butter in a small frying pan and fry the trout for about four minutes on each side, or until golden-brown and crisp. Add the lemon juice at the end, allowing it to slightly reduce in the pan.", "For the herb rice, heat the oil in an ovenproof pan and gently fry the onion and garlic until soft. Add the rice and fry for 1-2 minutes. Add the hot vegetable stock, season, to taste, with salt and freshly ground black pepper and stir. Cook on the hob for about 7-8 minutes, then put a lid on the pan and place in the oven for a further 8-10 minutes, stirring once during cooking and adding more hot water if more liquid is required.", "Remove from the oven and stir in the chopped dill and parsley.", "For the spicy tomato sauce, heat the oil in a saucepan and gently fry the onion and garlic until soft. Add the chilli and fry for a further 1-2 minutes. Add the chopped tomatoes, season, to taste, with salt and freshly ground black pepper and turn up the heat until the tomatoes are cooking down and the sauce is bubbling. Add the white wine and cook for a further two minutes. Reduce the heat and put a lid on the pan. Cook for a further five minutes, or until the tomatoes are cooked down. Finally stir in the torn basil leaves.", "Using a hand blender, process the sauce until smooth, adding more salt and freshly ground black pepper if required.", "To serve, place a spoonful of the rice onto a serving plate, arrange the trout halves on top and spoon over the sauce. Garnish with a sprig of dill."]}, {"isVegetarian": false, "title": "Trout with samphire and beurre blanc", "url": "www_bbc_co_uk_food_recipes_troutwithsamphireand_91865", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/troutwithsamphireand_91865_16x9.jpg", "ingredients": ["140g/5oz chilled unsalted butter, cut into small cubes ", "2 medium shallots, peeled, thinly sliced", "½ garlic clove, peeled, thinly sliced", "1 sprig fresh thyme", "1 small bay leaf", "3 black peppercorns, crushed", "150ml/5fl oz dry white wine", "1 tsp white wine vinegar", "sea salt flakes ", "1-2 tbsp freshly squeezed lemon juice", "2-3 tbsp plain flour", "salt and freshly ground black pepper", "2-3 tbsp sunflower oil", "2 x 200g/7oz thick-cut brown or rainbow trout fillets", "2 handfuls marsh samphire, rinsed thoroughly, tough stems removed, broken up into small pieces", "1 tbsp butter", "1-2 tbsp freshly squeezed lemon juice", "salt and freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the beurre blanc, heat one tablespoon of the butter in a non-reactive pan over a medium heat. When the butter has melted, add the shallots, garlic, thyme, bay leaf and peppercorns and fry for 2-3 minutes, or until the shallots have softened but not coloured. ", "Add the white wine and wine vinegar and bring the mixture to the boil. Continue to boil until most of the liquid has evaporated, then gradually whisk in the chilled butter cubes, one at a time, until all of the butter has been incorporated into the mixture and the sauce has thickened and is glossy. ", "Strain the beurre blanc through a fine sieve into a warmed bowl, then season, to taste, with salt and pour over the lemon juice. Keep warm. (NB: Do not leave the beurre blanc in too warm a place or the sauce may split.) ", "For the trout, heat a large frying pan over a high heat. Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Pat the fish fillets fry with kitchen paper. ", "Dredge the trout fillets, skin-sides down, in the seasoned flour, then shake off any excess flour. Dip the floured sides of the trout fillets in the sunflower oil. ", "When the pan is hot, add the trout fillets, floured-sides down, and fry for 3-4 minutes, or until more than half of the trout flesh has turned opaque and the skin is crisp and golden-brown. (NB: The skin needs to be flat against the pan to crisp up all over, so press the trout fillets down with a fish slice if the heat makes them arch up.) ", "Turn the trout fillets over carefully and continue to fry for a further minute, or until the trout fillets are almost cooked through but are still slightly rare in the centre.", "Meanwhile, for the samphire, add the samphire to a pan of boiling water (do not add salt) and cook for 2-3 minutes, or until tender. Drain well, then return the samphire to the pan, add the butter and lemon juice and season, to taste, with freshly ground black pepper. ", "To serve, divide the samphire between two warmed plates. Place the trout on top and spoon over the beurre blanc."]}, {"isVegetarian": false, "title": "Trout Orleans", "url": "www_bbc_co_uk_food_recipes_troutorleans_11571", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 eggs", "5 tbsp clarified butter", "plain flour, to coat", "2 sea trout fillets, skin on", "55g/2oz fresh breadcrumbs ", "2 bananas", "2 lemons, 1 juiced, 1 thinly sliced", "55g/2oz butter", "2 egg yolks", "2 tomatoes, thinly sliced", "salt and white pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to warm. In a shallow dish, whisk the eggs with 2 tbsp of the clarified butter.", "Put a good handful of flour on a plate and season lightly with white pepper and salt.", "Take the sea trout fillets and coat them with the seasoned flour, then dip them in the egg mixture and finally toss them in breadcrumbs until they are completely covered.", "Heat a frying pan until very hot then add 2 tbsp of the clarified butter. Place the breaded fillets in the pan, skin side up for 2 minutes. Turn the fillets over and cook for a further 3 minutes, or until golden brown. Leave the pan on the heat, transfer fillets to a heat-resistant plate, skin side down and place under the grill for 5 minutes.", "Halve the bananas, lengthways. Add the remaining clarified butter to the hot pan and place the banana halves in the pan for 5 minutes, turning occassionally to stop them burning.", "In a heatproof bowl sitting over a pan of hot water, whisk the lemon juice, butter and egg yolks to a creamy sauce. Season with salt and pepper to taste.", "Take the fillets from under the grill and place tomato and lemon slices over the flesh side, alternately and overlapping so they cover most of the fish. Turn the grill up to full and cook the fillets for a further minute.", "Serve the trout and bananas together on a plate, covered with sauce."]}, {"isVegetarian": false, "title": "Truffle-baked bream", "url": "www_bbc_co_uk_food_recipes_truffle-baked_bream_39834", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 sea bream fillets, around 150g-200g/5½oz-7oz per fillet, skin on", "1 unwaxed lemon, very thinly sliced", "2 sprigs fresh rosemary", "5 tbsp olive oil", "1 x 400g tin chopped tomatoes", "2 tbsp torn basil", "1 garlic clove, finely chopped", "150ml/5fl oz lobster bisque (from a tin is fine) ", "25g/1oz black truffle butter (or unsalted butter plus a splash of truffle oil)", "handful dried porcini", "handful chopped fresh chervil or tarragon, or other fresh herbs ", "flaked sea salt and freshly ground black pepper", "300g/10½oz strong white flour", "pinch salt", "knob of butter, melted, for brushing", "sprig fresh rosemary, finely chopped"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 220C/Fan 200C/Gas 7. ", "Season the flesh side of each bream fillet, then sandwich them together so the skin is on the outside. Put three lemon slices followed by a sprig of rosemary on top. Tie the fish up with two or three pieces of string, then set aside. ", "For the bread crust, put the flour in a large bowl and season with salt. Slowly mix in enough water to make a soft, malleable dough. ", "Heat 4 tablespoons of olive oil in a saucepan. Once hot add the chopped tomatoes, basil, season with salt and pepper and cook for 10-15 minutes to make a tomato sauce.", "Heat a little more oil in a casserole dish. Add the garlic and cook for a few seconds. Add the tomato sauce and cook for 1–2 minutes. Pour in the lobster bisque and bring to the boil. Whisk in the truffle butter. Add the porcini.", "Bring the sauce back to a simmer, then remove from the heat. Season to taste, stir in the herbs and add the fish – it should not be completely submerged. ", "Roll out the bread dough and cover the casserole dish until it is sealed. You need plenty of dough overlapping the sides of the casserole. Tuck it through the handles of the casserole to secure it well, then make a small hole in the top to allow the steam to escape ", "Return the casserole to the heat until you see a plume of steam coming through the hole in the dough. Transfer to the oven and bake for 10 minutes.", "Brush the crust generously with the melted butter, then bake for a further 2 minutes. Sprinkle the crust with sea salt and the chopped rosemary. Bake for 2 minutes more, then serve. "]}, {"isVegetarian": false, "title": "Truffle-stuffed roast chicken with vegetables and cream sauce", "url": "www_bbc_co_uk_food_recipes_truffle-stuffed_roast_27864", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 whole chicken, legs and wings removed but kept", "200g/7oz salted butter, softened", "1 truffle, sliced", "salt and freshly ground black pepper", "4 carrots, peeled and cut into batons", "2 tbsp rapeseed oil", "1 onion, roughly chopped", "2 small carrots, peeled and chopped", "1 small leek, chopped", "2 bay leaves", "2 sprigs fresh thyme", "50g/1¾oz unsalted butter", "2 shallots, chopped", "2 garlic cloves, chopped", "150ml/5fl oz white wine", "300ml/10fl oz double cream", "¼ bunch fresh chervil, finely chopped", "75g/2½oz unsalted butter", "1 head kale, finely chopped, tough stalks removed", "300g/10½oz frozen peas, blanched"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 230C/210C Fan/Gas 8.", "Put the legs and wings in a deep roasting tray and roast in the oven for 15-20 minutes, then set aside.", "Reduce the oven temperature to 180C/160C Fan/Gas 4.", "Place the butter in a large bowl, add half the truffle, a little salt and pepper and mix.", "Lift the skin away from the chicken crown (leaving the skin intact) and push the butter underneath the skin.", "Place in a deep roasting tray and roast for 1-1½ hours, or until cooked through. When you think there is 30 minutes left add the carrot batons.", "For the sauce, heat a large saucepan and add the oil. Once hot add the onions, carrots, leeks, bay leaves and thyme and cook for 3-4 minutes.", "Add the legs and wings and cook for 2-3 minutes. Add 2 litres/3½ pints of water and cook for at least 1 hour. ", "Strain and keep the liquid, but discard the vegetables. You will need 500ml/18fl oz of this chicken stock.", "Heat a sauté pan and melt the butter. Add the shallots and cook for 1-2 minutes. Add the garlic and cook for 1-2 minutes.", "Add the white wine and cook until reduced in volume by half then add the chicken stock and reduce by half again. Finish with the cream and chervil.", "For the kale and peas, heat a large sauté pan and melt the butter. Add the kale and peas and cook for 2-3 minutes, or until the kale has wilted.", "Put the roasted carrots, kale and peas in the centre of the plate. Remove the chicken breast, cut into slices and fan over the vegetables. Spoon over the creamy sauce, garnish with remaining truffle and serve."]}, {"isVegetarian": true, "title": "Truffle gnudi with broad beans, grilled Gem lettuce and pea purée", "url": "www_bbc_co_uk_food_recipes_truffle_gnudi_with_bread_54708", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz Parmesan (or alternative vegetarian hard cheese), grated", "450g/1lb ricotta cheese, drained ", "12.5g jar black truffle, finely chopped", "white truffle oil, for drizzling", "500g/1lb 2oz semolina flour ", "375g frozen peas", "handful fresh peas", "handful podded broad beans, outer skins removed", "25g/1oz butter", "2 fresh thyme sprigs", "2 Little Gem lettuce hearts, halved", "olive oil, for drizzling", "salt and freshly ground black pepper", "pea shoots, snipped, to garnish", "bunch chives, snipped, to garnish"], "serves": "Serves 2", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["Line a baking tray with baking paper. ", "To make the gnudi, mix 25g/1oz of the Parmesan with the ricotta. Add the truffle and a drizzle of truffle oil and season. Spoon into a piping bag. ", "Dust a work surface with the semolina flour and pipe out a long sausage shape. Chop it into 2.5cm/1in pieces and transfer them to the baking tray. Cover and refrigerate overnight, until a skin has formed.", "When almost ready to serve, tip the frozen peas into a blender and blitz with some salt until smooth. Pass them through a sieve.", "Blanch the fresh peas and beans in boiling water for 2 minutes, then drain. ", "Melt the butter in a wide saucepan and sauté the fresh peas, broad beans and thyme.", "Preheat the grill to high. Lightly drizzle the lettuce hearts with olive oil and season with salt and pepper. Grill, cut side-up, until charred. Set aside.", "Blanch the gnudi in salted boiling water for a few minutes, then drain. Toss with the peas and broad beans and tip onto a serving dish. Add the lettuce and pea purée, garnish with the pea shoots, chives and remaining Parmesan and serve. "]}, {"isVegetarian": true, "title": "Tsoureki bread (Greek Easter bread)", "url": "www_bbc_co_uk_food_recipes_tsoureki_bread_greek_90667", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz strong white flour, plus extra for dusting", "7g fast-action yeast", "10g salt", "60g/2½oz butter, softened", "75g/3oz caster sugar", "pinch gum mastic powder", "pinch mahlab (also called mechlebe or mahlepi, available from specialist delicatessens or online)", "pinch ground cinnamon", "1 orange, zest only", "150ml/5fl oz warm water", "150ml/5fl oz milk", "handful sultanas", "3 free-range eggs, hardboiled in their shells with red food colouring", "1 free-range egg, beaten for egg wash"], "serves": "Serves 6-8", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Put the flour, yeast, salt, butter and sugar into a large bowl. Add the mastic powder, mahlab  and cinnamon, then the orange zest. Pour in half the water and milk and mix together briefly, then keep adding the liquid and mixing until you have a soft glutinous dough.", "Mix the sultanas through the dough, then tip out onto a lightly floured surface and knead until you have a pliable dough. Shape into a ball and rest for at least an hour, or overnight in the fridge, until doubled in size. ", "Line a baking tray with baking parchment. Divide the dough into three and roll into three strands. Plait the strips together, place on the baking tray and leave to rise for another hour, or until doubled in size.", "Preheat the oven to 210C/400F/Gas 6. Brush the top of the bread with egg wash and push the coloured eggs into the bread. Bake for 20-25 minutes, then transfer to a wire rack to cool."]}, {"isVegetarian": true, "title": "Tuiles with chocolate mousse", "url": "www_bbc_co_uk_food_recipes_tuiles_with_chocolate_64665", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuiles_with_chocolate_64665_16x9.jpg", "ingredients": ["200g/7oz dark chocolate ", "300ml/10½fl oz double cream", "1 large free-range egg, white only", "50g/1¾oz caster sugar", "200g/7oz butter, softened", "175g/6oz icing sugar", "1 tsp vanilla extract ", "6 large free-range eggs, whites only, lightly beaten", "200g/7oz plain flour", "3 tsp cocoa powder", "50g/1¾oz plain chocolate, melted"], "serves": "Makes 18 curved tuiles, cigars or baskets", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["To make the chocolate mousse, break the chocolate into small pieces and set aside. In a small saucepan, heat half of the cream until just simmering.  Remove from the heat, add the chocolate pieces and stir until the chocolate has melted and the mixture is smooth.", "Pour the mixture into a bowl and leave to cool for 15 minutes.  Add the remaining cream and using a hand-held electric whisk, beat the mixture until soft peaks form when the whisk is removed. ", "In a clean bowl, whisk the egg white until stiff peaks form when the whisk is removed. Add the sugar, a tablespoon at a time, and continue whisking to make a soft meringue mixture. Carefully fold the meringue through the chocolate mixture. Put the mousse in the fridge and leave until set. ", "To make the tuiles mixture, use a hand-held electric mixer to mix the butter, sugar and vanilla extract into a paste.  Gradually add the egg whites, whisking all the time.  Fold in the flour a little at a time beating with a wooden spoon between each addition. ", "Transfer one-sixth of the mixture into a small bowl and add the cocoa. Beat until well mixed. You now have two bowls of tuile paste, one plain and one chocolate. Cover both bowls with cling film and leave to rest for 30 minutes.", "To bake the tuiles, preheat the oven to 180C/350F/Gas 4. Line a baking tray with parchment or a silicone sheet and place the tuile template in position.", "Spread some of the plain tuile paste over the cut out shapes of the template using a palette knife. Draw the blade across the template to remove any surplus paste. Remove the template by peeling away from the tray, leaving you with paste shapes on the baking tray. You should be able to make nine tuiles. Reserve the remaining plain tuile paste.", "Spoon the chocolate paste into a small piping bag fitted with a writing nozzle.  Pipe patterns (concentric circles, dots, straight lines, squiggles, wavy lines) onto the tuiles.  ", "Cook for 5-6 minutes, or until just turning golden-brown around the edge. Remove from the oven and, working very quickly, drape the tuiles over a rolling pin while still warm, so that they cool in a curved shape.", "If the cooked tuiles start to harden before you have chance to shape them all, return them to the oven for 30 seconds to one minute to soften. ", "For the tuile cigars, make a further nine plain tuiles using the template as before. Bake for 5-6 minutes, or until pale golden-brown. Reserve the remaining plain paste. Remove from the oven and, working very quickly, bend the warm tuiles around wooden spoon handles to make cigar shapes. Dip the cigar tuiles in the melted plain chocolate.  Leave aside to set. ", "For the tuile basket, drop a spoonful of the remaining plain paste onto a silicone sheet and flatten with the back of a spoon to an uneven circle approximately 8cm/3¼in in diameter. Cook for 5-6 minutes, or until a pale golden-brown colour.  Remove from the oven and lift off the baking tray. Mould immediately over a muffin cup or ramekin to make a basket shape. Leave them to cool.", "Use a tablespoon dipped in cold water to place scoops of the chocolate mousse into the basket. Serve with the cigar-shaped and curved tuiles."]}, {"isVegetarian": false, "title": "Tubetti pasta with clams, mussels and rocket", "url": "www_bbc_co_uk_food_recipes_tubetti_pasta_with_clams_90088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz clams ", "500g/1lb 2oz mussels ", "320g/12oz tubetti pasta ", "150ml/5fl oz white wine ", "1 garlic clove", "4 tbsp extra virgin olive oil, plus extra for drizzling ", "handful parsley, roughly chopped", "1g sachet powdered saffron ", "4 plum tomatoes, deseeded and chopped", "1 red chilli, finely chopped", "handful rocket", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "1-2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["Rinse the clams and mussels under cold running water. Place in a bowl of salted cold water and leave for about an hour. You will notice the shells opening slightly. Rinse under cold water again. ", "Meanwhile bring a saucepan of slightly salted water to the boil. Add the pasta and cook until al dente. Drain and set aside.", "Place the rinsed clams and mussels in a large saucepan together with the wine, garlic, oil and parsley. Cover with a lid and cook on a high heat for three minutes, until all the shells have opened. ", "Remove the clams from the heat. Immediately discard any unopened shells. Remove two-thirds of the clams and mussels from their shells, leaving the rest intact. Set aside. ", "Strain the cooking liquor through a fine sieve to remove any impurities. Return the cooking liquor to the pan with the shelled clams and mussels and cook on a medium heat until it reduces slightly.", " Stir in the saffron, tomato and chilli then season to taste with salt and freshly ground black pepper.", "Add the drained pasta to the sauce.", "Mix in the rocket and season with salt and freshly ground black pepper.", "Remove from the heat and stir in the clams and mussels in the shell. Drizzle with oil and serve immediately."]}, {"isVegetarian": true, "title": "Truffle egg toast", "url": "www_bbc_co_uk_food_recipes_truffle_egg_toast_40065", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 x 3cm/1¼in thick slice of square white bread", "80g/2¾oz fontina cheese, grated", "2 medium free-range egg yolks", "1 tsp truffle oil", "flaky sea salt and black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4.", "Lightly toast the bread on both sides.", "Put the bread on a tray. Use a very sharp knife to carefully cut a shallow well into the centre of the bread, about a 5cm/2in square. To do this cut the edges and push down the centre. Remember this is a well not a hole. It is important that you don’t cut all the way through!", "Distribute the fontina evenly around the rim of the well.  ", "Mix the yolks together with the truffle oil and pour them into the well then bake for 3-5 minutes until the cheese melts.", "Take the toast out and give the yolk a little stir then sprinkle with salt and pepper. Eat immediately."]}, {"isVegetarian": true, "title": "Truffles", "url": "www_bbc_co_uk_food_recipes_truffles_67741", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz dark chocolate, broken into pieces ", "175ml/6fl oz double cream", "5 tbsp brandy, rum or other spirit of your choice (optional)", "cocoa, icing sugar or finely crushed nuts, to finish"], "serves": "Makes 12-15 truffles", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Cover a baking tray tightly with two layers of cling film to put the truffles on to set.", "Tip the chocolate pieces into a bowl.  ", "Pour the cream into a pan and bring to a rolling boil.  ", "Pour over the chocolate and stir until all the chocolate is melted.  If you want to add booze, mix it in at this point.", "Allow the mixture to cool at room temperature - this will take about 1½ hours - by which time it should be set.", "Using a melon baller or teaspoon, scoop out bite-sized pieces.  Dust your hands with icing sugar to stop them sticking and roll the pieces into balls.", "Roll in sifted icing sugar, cocoa or crushed nuts and place them on the prepared tray.", "Once they are set you can store them in an airtight container in the fridge for about a week."]}, {"isVegetarian": true, "title": "Tumbet", "url": "www_bbc_co_uk_food_recipes_tumbet_98868", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tumbet_98868_16x9.jpg", "ingredients": ["2 medium aubergines, cut into 1.5cm/⅝in rounds", "up to 200ml/7fl oz olive oil", "2 medium courgettes, cut into 2cm/¾in slices", "500g/1lb 2oz large waxy potatoes (such as Charlotte), thinly sliced (around 3mm/⅛in)", "2 roasted red peppers (from a jar), cut into strips", "small bunch fresh oregano", "small bunch fresh basil", "2 tbsp olive oil", "4 garlic cloves, crushed", "400g/14oz ripe tomatoes, peeled and chopped", "1 tsp dried thyme ", "salt and freshly ground black pepper", "pinch sugar (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/Fan 180C/Gas 6. ", "Arrange the aubergine slices on a large baking tray and brush with olive oil. Season with salt. Roast for 20–25 minutes, or until softened and lightly browned. Remove from the oven and allow to cool.", "Pour a 5mm/¼in thick layer of olive oil in the base of a large, heavy-based frying pan. Fry the courgettes on a medium heat, for a couple of minutes on each side, then remove and drain onto kitchen towel. Season lightly with salt. ", "Add the potato slices to the frying pan and fry on both sides until they are softened all the way through and a very light golden colour around the edges. This will take up to 10 minutes. Drain on a plate lined with kitchen paper.", "To make the sauce, put the olive oil in a saucepan and add the garlic. Cook for 3–4 minutes on a low–medium heat until soft and aromatic, then add the tomatoes and thyme. Season with salt and pepper. ", "Bring to the boil, then reduce the heat and cook gently, uncovered, until well reduced – around 25 minutes. Taste after 10 minutes – if the sauce tastes acidic, add a pinch of sugar. ", "Reduce the oven to 180C/160C Fan/Gas 4. ", "To assemble, spread a couple of tablespoons of tomato sauce in the base of an oven dish. Sprinkle over some fresh oregano and basil leaves. Top with all the aubergines. ", "Add more tomato sauce, then sprinkle with more herbs and add the courgettes. Repeat with more tomato sauce, more herbs and the peppers, then finish with the last of the tomato sauce and herbs, and top with the potatoes. ", "Sprinkle over more salt and pepper and drizzle with a little more olive oil. Bake in the oven for 25–30 minutes, or until the potatoes are crisp and browned and the vegetables underneath are tender."]}, {"isVegetarian": true, "title": "Tuna and red pepper sandwich", "url": "www_bbc_co_uk_food_recipes_tuna_and_red_pepper_28066", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g tin tuna in water, drained", "1 spring onion, thinly sliced", "½ small red pepper (40g/1½oz), cut into small dice", "2 tsp light mayonnaise", "2 x 30g/1oz slices wholemeal or granary bread", "salt and freshly ground black pepper"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Mix the tuna, spring onion, red pepper and mayonnaise in a bowl. Season lightly with salt and pepper. Spread over one slice of bread and top with the second to make a sandwich."]}, {"isVegetarian": false, "title": "Tuna and broccoli pasta bake", "url": "www_bbc_co_uk_food_recipes_tuna_and_broccoli_pasta_25783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_broccoli_pasta_25783_16x9.jpg", "ingredients": ["200g/7oz dried short pasta shapes, such as fusilli or penne ", "250g/9oz small frozen broccoli florets", "40g/1½oz butter", "40g/1½oz plain flour", "600ml/20fl oz semi-skimmed milk", "75g/2½oz mature cheddar", "salt and freshly ground black pepper ", "1 x 185g tin tuna chunks in water or brine, drained ", "2 firm, ripe tomatoes, sliced (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Half-fill a large saucepan with water and bring it to the boil. Add the pasta, return the water to the boil and cook according to the packet instructions until just tender. Just before the end of the cooking time, add the frozen broccoli florets to the pan and cook with the pasta for the final 2-3 minutes, until just tender. ", "Meanwhile, heat the butter, flour and milk in a saucepan over a medium heat until the mixture is just bubbling, whisking constantly with a balloon whisk until smooth and thickened to a roux. ", "Continue to cook the roux for a further 2-3 minutes, stirring constantly until it has thickened enough to coat the back of a spoon. Stir in half of the cheese until melted, then season, to taste, with salt and freshly ground black pepper. ", "Preheat the grill to its highest setting.", "Drain the pasta and broccoli in a large colander and transfer to a pre-warmed shallow ovenproof dish (a lasagne dish is ideal). Flake the tuna on top of the pasta and broccoli. ", "Pour the cheese sauce over the pasta mixture, then top with the sliced tomatoes, if using. Sprinkle over the remaining cheese. ", "Place the pasta bake under the hot grill for 4-5 minutes, or until the cheese melts and starts to turn golden-brown. Serve immediately."]}, {"isVegetarian": true, "title": "Tumbet (layered pepper and Manchego bake)", "url": "www_bbc_co_uk_food_recipes_tumbetlayeredpeppera_88137", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400g/14½oz canned chopped tomatoes", "1 tsp fresh oregano, plus extra for serving", "3 garlic cloves, sliced", "50ml/1¾fl oz extra virgin olive oil", "dash olive oil", "knob butter ", "500g/1lb 1½oz baking potatoes, peeled and finely sliced ", "500g/1lb 1½oz aubergine, sliced", "1 red pepper", "1 green pepper", "salt and freshly ground black pepper", "4 slices Manchego cheese"], "serves": "Serves 4-6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, place the canned tomatoes, oregano, garlic and olive oil in a pan and simmer for 25 minutes.", "Meanwhile, for the tumbet, preheat the oven to 180C/350F/Gas 4. Heat the oil and butter in a large frying pan. Add the potatoes and fry for about 3-4 minutes until coloured. Remove with a slotted spoon and drain on kitchen paper.", "Repeat with the aubergine, also draining on kitchen paper.", "Slice the two peppers in half, scrape out and discard the seeds, then fry for two minutes until slightly blackened. Transfer to a plate lined with kitchen paper.", "In an ovenproof dish, divide the potatoes into four piles. Top each with some aubergine, a pepper half and a slice of cheese. Secure with a cocktail stick.", "To finish the sauce, cool slightly before blending until smooth (using a hand-blender). You can pass the sauce through a fine metal sieve for a really smooth finish. ", "Spoon the sauce over the tumbet and bake in the oven for 20 minutes.", "Serve in wedges scattered with more oregano."]}, {"isVegetarian": false, "title": "Tuna and bean salad", "url": "www_bbc_co_uk_food_recipes_tuna_and_bean_salad_93054", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["80g/3oz green beans, halved", "160g tin tuna in water, drained", "50g/1¾oz red pepper, cut into dice", " 1 tbsp fat-free dressing"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the beans in a saucepan of boiling water for 5 minutes, or until tender. Drain and place in a bowl of cold water. When they are cool, drain off the cold water and mix the beans with the tuna, pepper and dressing in a bowl. Serve."]}, {"isVegetarian": false, "title": "Tuna bean salad", "url": "www_bbc_co_uk_food_recipes_tuna_bean_salad_54783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_bean_salad_54783_16x9.jpg", "ingredients": ["100g/3½oz green beans, halved", "2 free-range eggs", "400g tin mixed beans in water, drained and rinsed", "100g/3½oz cherry tomatoes, halved", "4 spring onions, thinly sliced", "160g tin tuna steak in water, drained", "1 tbsp extra virgin olive oil", "1 tsp red wine vinegar", "1 tsp Dijon mustard", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the green beans in a pan of boiling water for 4 minutes. Plunge them into a bowl of very cold water. ", "Cook the eggs in a pan of boiling water for 8 minutes. Drain in a sieve under cold running water until cold. Peel and cut the eggs into quarters.", "For the dressing, whisk the oil, vinegar and mustard in a large bowl until thick. Season with black pepper.", "Add the green beans, mixed beans, cherry tomatoes and spring onions to the dressing and mix. Flake the tuna on top and add the hard-boiled eggs. Season with black pepper."]}, {"isVegetarian": false, "title": "Tuna carpaccio with sourdough and tuna tartare", "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_25315", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb 2oz very fresh tuna loin, trimmed", "2 tbsp olive oil", "1 loaf sourdough bread, sliced", "1 shallot, finely diced", "pinch Dijon mustard", "½ lemon, juice only", "4 tbsp chives, finely chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place a piece of cling film on the work surface and place ¾ of the tuna on top. Place another piece of cling film on top and, using a rolling pin, hit the tuna until it is very thin.", "Remove the top piece of cling film. Place a 20cm/8in diameter plate over the tuna and cut round it. Flip everything upside down so the plate is on the bottom.", "Heat a frying pan and add the oil, once hot add the sliced bread and cook on each side until crisp.", "Remove the remaining cling film and lay the toasted sourdough over the tuna.", "Place a serving plate on top, upside down. Flip the plates over, so the tuna is on top of the bread, on the serving plate.", "For the tuna tartare, finely dice the rest of the tuna and place in the bowl with the shallot, mustard, lemon juice and half of the chives.", "To serve, garnish the tuna carpaccio with the tuna tartare and the rest of the chives."]}, {"isVegetarian": false, "title": "Tuna Niçoise", "url": "www_bbc_co_uk_food_recipes_tuna_nicoise_87874", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz anchovies in oil", "400g/14oz pitted black olives", "75g/2½oz capers, drained and rinsed", "2-3 garlic cloves", "1 tsp Dijon mustard", "2 tsp lemon juice", "2 tbsp good-quality olive oil", "handful fresh basil, chopped", "fresh black pepper", "2 tsp Dijon mustard", "1 tbsp white wine vinegar", "100ml/3½oz extra virgin olive oil", "½ lemon, juice only", "pinch of salt and pepper", "4 Baby Gem lettuce ", "200g/7oz green beans, topped, tailed and blanched", "4 tsp capers, drained and rinsed", "200g/7oz cooked new potatoes", "24 baby plum tomatoes, cut in half", "4 tuna steaks, approximately 175g/6oz each", "1 tbsp olive oil", "salt and freshly ground black pepper", "4 soft-boiled medium eggs, peeled and halved", "1 tbsp chopped chives", "1 loaf olive sourdough fougasse   "], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tapenade, combine everything except half of the basil and the black pepper in a food processor and blend until roughly chopped up, but not puréed. Pour into a dish and garnish with black pepper and the remaining basil leaves.  ", "To make the dressing, place all ingredients in a clean jam jar. Put the lid on and shake well until the dressing has emulsified.", "To make the salad, tear the Baby Gem leaves and place in a bowl with the remaining salad ingredients.", "To make the tuna, heat a griddle pan until hot. Rub a little olive oil on both sides of the tuna steaks and season with salt and freshly ground black pepper.", "Fry the tuna in a hot pan for two minutes on each side, or until cooked to your liking. ", "To serve, drizzle two tablespoons of dressing over the salad. Very gently, using your hands, mix the salad so that it’s coated in the dressing. Arrange the salad on a large platter or board. Place the eggs around the salad.", "Slice the tuna on the diagonal and lay slices on top of the salad. Sprinkle over the chives. Pour any remaining dressing in a jug leave on the table next to the salad. Serve with the fougasse and tapenade."]}, {"isVegetarian": false, "title": "Tuna and sweetcorn pasta salad", "url": "www_bbc_co_uk_food_recipes_tuna_and_sweetcorn_pasta_75779", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_and_sweetcorn_pasta_75779_16x9.jpg", "ingredients": ["150g/5oz whole wheat pasta, cooked according to packet instructions", "150g/5oz frozen or tinned sweetcorn ", "150g/5½oz tinned tuna in spring water, drained", "2 tbsp plain yoghurt", "1 tbsp mayonnaise", "freshly ground black pepper", "squeeze lemon (optional)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Mix all the ingredients together until thoroughly combined. Transfer to a sealed plastic tub and keep in the fridge. "]}, {"isVegetarian": false, "title": "Tuna carpaccio with caramelised watermelon", "url": "www_bbc_co_uk_food_recipes_tuna_carpaccio_with_42630", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ watermelon, peeled, flesh cut into 1cm/½in-thick slices", "2 thin slices sourdough bread", "4 x 50-75g/2-3oz fresh tuna loin steaks (ask the fishmonger for sushi-grade tuna)", "1 lemon, juice only", "2 tbsp very finely chopped fresh chives, plus extra to serve", "1 shallot, very finely chopped, plus extra to serve", "knob of butter", "sea salt and freshly ground black pepper", "2 tbsp extra virgin olive oil, to serve"], "serves": "Serves 4", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Scoop all of the watermelon slices into a re-sealable food bag. Add a pinch of salt and chill in the fridge for 2-3 days.", "When the watermelon is ready, preheat the oven to 150C/130C Fan/Gas 4.", "Toast the bread, then slice each in half widthways to create four slices, each with one toasted side and one untoasted side. Sandwich them between 2 clean baking trays. Bake in the oven for 5 minutes, or until hard and crisp. Remove the trays from the oven and set the bread aside to cool, still sandwiched between the trays.", "Lay a sheet of cling film onto a clean work surface. Place the tuna steaks on top and cover with a second sheet of cling film. Flatten the tuna steaks to a thickness of 2mm using a meat mallet or rolling pin. (Do this one steak at a time if it is easier.)", "Trim each piece of flattened tuna into a circle, using an upturned bowl as a guide. Set aside.", "Chop the tuna trimmings very finely and place them into a bowl. Squeeze over half of the lemon juice and add the chives and shallots. Season, to taste, with salt and freshly ground black pepper, then mix well.", "Heat the butter in a frying pan over a high heat until it starts to brown. Chop the watermelon slices into small pieces and add them to the pan in batches, frying for 1-2 minutes on each side, or until caramelised and heated through. Season with a pinch of salt. Remove from the pan and set aside on a warmed plate while you fry the remaining watermelon.", "To serve, spoon some of the tuna tartare onto each piece of toast. Place onto the serving plates and top with a piece of cooked watermelon. Turn over each circle of flattened tuna carpaccio, discarding the cling film, and place one circle alongside each toast. Brush each circle of tuna carpaccio with a little of the extra virgin olive oil, then sprinkle over the shallot and chives, squeeze over the lemon juice, and season, to taste, with freshly ground black pepper."]}, {"isVegetarian": false, "title": "Tuna Niçoise wrap", "url": "www_bbc_co_uk_food_recipes_tuna_nioise_wrap_20414", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/tuna_nioise_wrap_20414_16x9.jpg", "ingredients": ["50g/2oz green beans, trimmed", "1 free-range egg (fridge cold)", "2 tbsp light mayonnaise", "1 tbsp baby capers, drained", "4 baby gherkins, drained and sliced", "¼ tsp dried mixed herbs", "1 x 185g/6½oz can tuna in spring water", "2 large flour tortillas or wraps (white, wholemeal or a combination)", "small handful baby spinach leaves", "1 large ripe tomato, cut into 8 pieces", "20g/¾oz pitted black olives in brine, drained", "freshly ground black pepper"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Bring a pan of water to the boil, add the beans and cook for four minutes. ", "Lift the beans out with a slotted spoon and dunk them into a large bowl of cold water. Alternatively, tip the beans into a sieve and rinse them under running water until cold. Drain.", "To boil the egg, put the pan with the hot water back on the heat, add the egg and bring the water back to the boil. Cook for eight minutes, then put the egg in a sieve under running water until cold. Leave the egg in cold water while you prepare the rest of the filling.", "Mix the mayonnaise, capers, gherkins, herbs and a few twists of ground black pepper in a bowl. Add the tuna and stir everything lightly, without mashing the tuna too much. ", "Peel the egg, then slice it into quarters, lengthwise.", "Place the tortillas on a board and cover each one with a layer of spinach leaves, leaving a gap of about 5cm/2in at the top and bottom of the tortilla. Add the green beans, all heading in one direction.", "Divide the tuna mixture between the tortillas, then the egg and tomato pieces. Sprinkle with the olives, pressing each one lightly between your thumb and finger to flatten them slightly.", "Fold the top and bottom of each wrap inwards to cover most of the filling and then roll up fairly tightly. Wrap them in foil – no need do this if eating immediately – then chill the wrapped tortillas until ready to eat. Eat within 24 hours and transport with an ice pack if serving as a packed lunch. Unwrap the foil as you eat the wrap.", "If you are taking your wrap to work, don’t forget to use a cool bag and ice pack to keep it chilled and in tip-top condition until you are ready to eat."]}]