[{"isVegetarian": true, "title": "Gruyère and courgette muffins", "url": "www_bbc_co_uk_food_recipes_gruyere_and_courgette_61507", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gruyere_and_courgette_61507_16x9.jpg", "ingredients": ["225g/8oz self-raising flour", "1 tsp baking powder", "100g/3½oz courgette, grated", "salt and freshly ground black pepper", "75g/2¾oz Gruyère, grated", "175ml/6fl oz full fat milk", "1 free-range egg, beaten", "75ml/2¾fl oz olive oil, plus extra for greasing", "1 tbsp chopped fresh rosemary", "butter, to serve"], "serves": "Makes 5 large muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease 5 of the holes in a 12-hole muffin tray with olive oil.", "Mix the flour, baking powder, courgette, seasoning and 50g/1¾oz of the cheese together in a bowl.", "In a separate bowl, whisk the milk, egg and olive oil together until well combined. Add the liquid mixture and rosemary to the dry ingredients and mix until well combined.", "Divide the mixture among the muffin holes and bake for 10 minutes in the oven, then sprinkle over the remaining cheese. Bake for a further 10-15, or until risen and golden-brown.", "Serve the muffins warm, with butter."]}, {"isVegetarian": false, "title": "Quiche Lorraine with Gruyère and chive flowers", "url": "www_bbc_co_uk_food_recipes_gruyre_and_chive_flower_97220", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["200g/7oz plain flour, sifted", "pinch of salt\u2028", "125g/4½oz chilled butter, cubed", "1 medium free-range egg, beaten", "1 tbsp olive oil", "175g/6oz streaky bacon, cut into 1cm/½in lardons", "100g/3½oz onions, chopped", "2 free-range eggs", "2 free-range egg yolks", "300ml/½ pint double cream", "1 tbsp chopped parsley\u2028", "2 tsp chopped chives", "1 tsp chopped thyme", "50g/2oz cheddar, grated", "50g/2oz Gruyère, grated", "salt and freshly ground black pepper", "small handful chive flowers, to garnish (optional)"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["For the pastry, place the flour, salt and butter in a food processor and pulse briefly. Add half of the beaten egg and continue to pulse. You might add a little more egg, but not too much as the mixture should be just moist enough to come together. ", "If making by hand, rub the butter into the flour until it resembles coarse breadcrumbs then, using your hands, add just enough beaten egg to bring it together. ", "With your hands, flatten out the ball of dough until it is about 2cm/¾in thick, then wrap in cling film or place in a plastic bag and leave in the fridge for at least 30 minutes or, if you are pushed for time, in the freezer for 10–15 minutes.", "Remove the pastry from the fridge and place between two sheets of cling film (larger in size than your tart tin). Using a rolling pin, roll the pastry out to no thicker than 5mm/¼in or even thinner for small tartlet tins. If the tin is round, make sure to keep the pastry in a round shape and also large enough to line the base and sides of the tin.", "Remove the cling film and place into a 18cm/7in quiche tin (with 3cm/1¼in high sides) If you wish, retain the top layer of cling film to help you shape the pastry. Press the pastry into the edges and, using your thumb, ‘cut’ the pastry along the edge of the tin for a neat finish. Remove the cling film, if used, prick over the base with a fork and chill the pastry in the fridge for 30 minutes or the freezer for 10 minutes. (Or cover it back up and keep in the freezer for a few weeks).", "Preheat the oven to 180C/350F/Gas 4.", "Line the pastry with foil, greaseproof or parchment paper, leaving plenty to come up the sides. Fill with baking beans or dried pulses. Place in the oven and bake for 15-20 minutes, or until the pastry feels dry.", "For the filling, heat the oil in a frying pan and cook the bacon until crisp. Remove and set aside to drain on kitchen paper. Fry the onions gently in the same oil for a further 10 minutes. Meanwhile, whisk the eggs in a medium-sized bowl, add the cream, herbs, cheeses and bacon and onions. Mix well and add salt and freshly ground black pepper.", "Remove the pastry from the oven and remove the paper and beans, pour the filling into the pastry base and return to the oven for 30-40 minutes, or until the centre has just set. Serve warm, garnished with chive flowers."]}, {"isVegetarian": false, "title": "Gruyère and pancetta brioche sandwich", "url": "www_bbc_co_uk_food_recipes_gruyre_and_pancetta_42737", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gruyre_and_pancetta_42737_16x9.jpg", "ingredients": ["12 rashers thinly sliced pancetta", "2 tbsp maple syrup", "8 slices brioche", "4 large slices Gruyère", "2 free-range eggs, lightly beaten", "1 tsp caster sugar", "150ml/5fl oz full-fat milk", "50g/2oz unsalted butter", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a frying pan over a high heat. When the pan is smoking, add the pancetta and dry-fry for 1-2 minutes on each side, or until crisp and cooked through. Drizzle over the maple syrup and transfer the pancetta to a warm plate.", "Lay four slices of the brioche onto a chopping board and top each with a slice of Gruyère and three slices of the pancetta. Drizzle over the pan juices, then top with the remaining slices of brioche.", "Whisk the eggs, sugar and milk in a shallow, wide bowl until well combined, then season, to taste, with salt and freshly ground black pepper. ", "Dip each sandwich into the egg mixture, allowing the brioche slices to soak for a few seconds on each side.", "Heat half of the butter in a large frying pan over a medium heat. When the butter is foaming, add two of the soaked sandwiches and fry gently for 4-5 minutes on each side, or until golden-brown on both sides and heated through. Keep warm. Repeat the process with the remaining butter and the remaining two sandwiches. Serve immediately."]}, {"isVegetarian": true, "title": "Gâteau Mont Blanc", "url": "www_bbc_co_uk_food_recipes_gteau_mont_blanc_89256", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 free-range egg whites", "300g/10½oz caster sugar", "500ml/18fl oz double cream", "250g/9oz sweetened chestnut purée", "1 vanilla pod, split in half and seeds scraped out using a sharp knife", "8-10 marrons glacés (available from delicatessens), chopped", "50g/1¾oz plain chocolate", "1 fresh chestnut, peeled, to garnish"], "serves": "Serves 8-10", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the meringue, preheat the oven to 100C/80C Fan/Gas ½. Line a large baking sheet with silicone or baking paper.", "Suspend a heatproof bowl over a pan of barely simmering water, making sure the base of the bowl does not touch the surface of the water. Add the egg whites and sugar to the bowl and start whisking them immediately using an electric whisk, until the sugar has dissolved and the mixture has reached about 60C/140F. ", "Transfer the mixture to a freestanding food mixer. Continue to whisk until smooth and glossy but still slightly warm, about 2-3 minutes.", "Spoon the meringue mixture onto the prepared baking tray, making a large disc with raised edges. Bake in the oven for 2½ hours, or until firm, then remove from the oven and set aside to cool.", "In a bowl, whisk the double cream with the chestnut purée and vanilla seeds until soft peaks form when the whisk is removed. Chill, covered, until needed.", "When ready to serve, spoon the cream over the cooled meringue, then decorate the top with the marrons glacés. Grate over the plain chocolate and garnish with the fresh chestnut. "]}, {"isVegetarian": false, "title": "Grilled squid with lemon, garlic and cumin", "url": "www_bbc_co_uk_food_recipes_grilledsquidwithlemo_70508", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledsquidwithlemo_70508_16x9.jpg", "ingredients": ["4 squid weighing about 250g/9oz each, cleaned", "1 lemon, zest only", "good pinch cumin", "pinch sea salt", "olive oil", "1 garlic clove, pasted", "½ handful of fresh coriander, chopped"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Take the prepared squid, make a cut down one side of the body tube and open it.  If you have had to use chunks of a large squid, then just lightly score the inside of the flesh, which will help tenderise it.  ", "Mix the lemon zest, cumin, sea salt, garlic and olive oil and rub into the squid and leave to marinate for a minimum of two hours in the fridge.", "Heat your grill plate until white patches start to appear.", "Remove the squid from the marinade and grill either side for no more than two minutes to ensure that you get those lovely black grill lines across the flesh.", "Push the squid down with the back of a fish slice and do the same with the tentacles.", "Take the squid off the hot grill and serve on a plate with a sprinkling of sea salt, juice of the lemon and sprinkling of fresh chopped coriander. Serve with a mixed green salad."]}, {"isVegetarian": true, "title": "Gâteau Saint Honoré", "url": "www_bbc_co_uk_food_recipes_gteau_saint_honor_39706", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4fl oz milk", "100g/3½oz butter, cut into small pieces, plus extra for greasing", "3g fine salt", "5g caster sugar", "150g/5½oz plain flour, sifted", "4 medium free-range eggs", "1 quantity choux pastry (see above)", "300ml/10fl oz double cream", "1 vanilla pod, seeds only", "200ml/7fl oz fresh custard", "100g/3½oz caster sugar", "50ml/2fl oz orange liqueur", "10-12 small white and pink roses", "small twisted twigs"], "serves": "Serves 6-8", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the choux pastry, preheat the oven to 180C/350F/Gas 4. Line two baking trays with parchment paper. Place a 23cm/9in metal ring on one of the lined trays.", "Put 125ml/4fl oz of water, the milk, butter, salt and caster sugar in a saucepan set over a high heat for one minute, stirring with a spatula. Turn off the heat and, stirring all the time, quickly add the flour until the mixture is very smooth.", "When the mixture is smooth, return the pan to the heat and stir with the spatula for one minute. The paste will begin to poach and some of the water will evaporate. Don’t let the paste dry out too much, or it will crack during cooking. Immediately remove from the heat and add the eggs, one at a time, mixing in with a spatula between each addition.", "Stir well with the spatula until the eggs are thoroughly combined and the paste has a very smooth texture. It is now ready to use.", "Carefully spoon the mixture into a large piping bag fitted with a plain 1cm/½in nozzle.", "For the gâteau Saint Honoré, use half of the choux pastry to pipe 12 small buns on one of the prepared baking trays. Pipe the remaining choux pastry into the metal ring on the other baking tray. Transfer the baking trays to the oven and cook for 10-15 minutes, or until risen and golden-brown. Set aside to cool.", "Whip the double cream in a bowl until firm, split the vanilla pod and add the seeds to the cream. Fold the custard into the cream together with two tablespoons of the sugar and a dash of the orange liqueur. Set aside.", "Heat the remaining sugar in a non-stick pan over a medium heat and melt to form a caramel. Grease a baking tray with butter.", "Carefully dip each choux bun into the caramel and then place on the greased baking tray to cool. If the caramel begins to set, warm it gently.", "Remove the ring from the pastry base and drizzle the remaining liqueur over the middle. Using an ice cream scoop or a tablespoon warmed in hot water, place half of the custard and cream mixture in the centre of the base. ", "Fill a piping bag fitted with a small plain nozzle with the remaining cream mixture. Use a small, sharp knife to cut small holes in the underside of the choux buns and fill them with the cream mixture. Arrange the buns around the edge of the flan. Garnish one side with roses and twigs and serve."]}, {"isVegetarian": true, "title": "Gâteau Saint Honoré à la passion", "url": "www_bbc_co_uk_food_recipes_gteau_saint_honor_a_la_52768", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300g/10½oz plain flour, plus extra for dusting", "200g/7oz salted butter, diced", "150ml/5fl oz ice cold water", "squeeze lemon juice", "1 free-range egg, white only, lightly beaten", "110g/4oz butter, chopped", "157g/5½oz plain flour", "4 large free-range eggs", "1 tbsp flavourless oil, for greasing", "2 tsp sugar ", "4 large free-range eggs, yolks only", "100g/3½oz caster sugar", "1 vanilla pod, seeds only", "50g/1¾oz cornflour", "500ml/17fl oz whole milk", "25g/1oz unsalted butter", "12 passionfruit, pulp scraped out", "150g/5¼oz golden caster sugar", "2 large free-range eggs", "2 large free-range egg yolks", "100g/3½oz unsalted butter, chopped", "500ml/17fl oz double cream", "1 vanilla pod, seeds only", "6 tbsp icing sugar ", "200g/7oz caster sugar ", "100g/3½oz milk chocolate", "50g/1¾oz double cream", "400g/14oz strawberries, hulled and halved  ", "150g/5½oz caster sugar", "2 sheets of gold leaf"], "serves": "Serves 10-12", "time": {"preparation": "over 2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["To make the rough puff pastry, sift the flour into a large bowl and add the butter. Mix the butter around to coat it in flour (stop before it starts to look like breadcrumbs as you want squashed pieces of butter showing in the mixture). Mix the water and lemon juice together in a jug and pour it into the flour and butter mixture.", "Chop the butter into the flour, until the dough comes together. When the dough has formed a loose lump, tip it onto a lightly floured work surface and shape it into a thick rectangle. Roll the dough out, then fold one-third of the dough to the centre, then fold the other third over that. Roll the pastry out again to the same proportions as before and fold in the same way as before. Rotate the pastry a quarter turn and repeat the rolling and folding. Continue for another 3-4 more times. Wrap the pastry in cling film and place into the fridge to chill for several hours.", "Preheat the oven to 200C/400F/Gas 6 and lightly grease a baking tray with flavourless oil.", "To make the choux pastry, in a large pan bring the butter and 300ml/10fl oz water to boil. Add the flour, remove from the heat and mix well before beating in the eggs one by one. Set aside while you roll the rough puff pastry. ", "Lightly dust a clean work surface with flour. Remove the pastry from the fridge and roll out until it’s the thickness of a pound coin. Use a 30cm/12in flan ring to cut the pastry to shape. Using a large circular nozzle, pipe some large choux buns around the edge of the puff pastry (approximately 10). On the greased baking tray, pipe out approximately 20 small choux buns. Place the pastry and choux buns into the oven for 25 minutes. ", "For the crème pâtissière, whisk the egg yolks and sugar together in a bowl until pale and light, then fold in the vanilla seeds and cornflour. Bring the milk to the boil in a small saucepan and then whisk it gradually into the egg mixture. Pour the mixture into a clean pan and bring it slowly to the boil until it thickens. Stir in the butter and simmer for a minute and then remove the pan from the heat.", "For the passionfruit curd, in a food processor blend the passionfruit pulp and sieve into a heatproof bowl. If you are using a microwavem, whisk in the whole eggs, egg yolks and sugar. Stir in the butter and place the bowl in a microwave on a medium temperature for two minutes. Whisk, then return to the microwave for two more minutes. Whisk again, then return to the microwave for a final minute. By now the curd should be thick and smooth. If you don’t have a microwave, beat the eggs, egg yolks and sugar together in a bowl. Melt the butter over a low heat in a heavy-based pan and add the egg mixture and blended passionfruit. Cook gently, stirring constantly until thickened. Pour into a shallow bowl, cover with cling film and place in the fridge to cool. ", "When the puff pastry is cooked, remove from the oven and brush with the egg white. Cook for a further minute then set aside to cool. ", "For the small choux buns, prick the undersides with the tip of a sharp knife and place back into the oven for five minutes to crisp up. Remove and set aside to cool. ", "To make the crème Chantilly, whip the cream until thickened using a handheld electric beater and add the vanilla seeds and icing sugar. Place in the fridge in a large mixing bowl. ", "Spoon the crème Chantilly into a piping bag fitted with the large star nozzle. Pipe into the choux buns by inserting the nozzle into the cut made earlier. ", "Once the choux buns are filled, make the caramel.  In a medium pan set over a high heat, add the sugar and 100ml/3½fl oz water and melt to an amber caramel. Remove from the heat and, using tongs, dip the choux buns into the caramel and place the choux buns into the middle of the gâteau, ensuring some room is left for the cream, chocolate ganache and curd to go on top. ", "To make the ganache, in a heat proof jug melt the chocolate and cream in a microwave on a low setting. Allow to cool slightly, then pour into the centre of the gâteau. Spread the passionfruit curd over the top. ", "To decorate, pipe the crème Chantilly in the centre of the gâteau, and into any gaps between the choux buns. Place the strawberries in a ring around the edge of the cream. ", "To make the spun sugar decorations, in a pan set over a medium heat melt the sugar with two tablespoons of water until a caramel forms (it will be a deep amber colour). Remove from the heat and allow the caramel to cool a little. Line a tray with parchment paper. Using a spoon, carefully drizzle the caramel into shapes on the parchment paper. Take care not to burn yourself as sugar gets very hot. Set aside to cool and harden. ", "Spike the sugar shapes into the cream in between the choux buns and decorate with a sprinkling of the gold leaf."]}, {"isVegetarian": false, "title": "Gâteau St Honoré", "url": "www_bbc_co_uk_food_recipes_gteau_st_honor_27070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125ml/4½fl oz full-fat milk", "100g/3½oz unsalted butter, cut into small cubes", "1 tsp caster sugar", "175g/6oz plain flour", "4 free-range eggs", "200ml/7fl oz vanilla custard", "300ml/10½fl oz double cream", "50ml/2fl oz orange liqueur", "100g/3½oz caster sugar", "200g/7oz mixed soft fruit, such as strawberries, raspberries, blackberries and blackcurrants", "2 small twisted willow sprigs, to decorate (optional)"], "serves": "Serves 8-10", "time": {"preparation": "1-2 hours", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line two baking trays with silicone mats or baking paper.", "Heat the milk, butter, sugar and 125ml/4½fl oz water in a saucepan over a high heat until the butter has melted (do not boil). ", "Add the flour all in one go and beat firmly and quickly with a spatula or wooden spoon, keeping the pan over the heat. Cook the mixture for one minute, then transfer to the bowl of a food mixer and beat for a further 1-2 minutes, or until cooled slightly (you can do this by hand if preferred). ", "Add the eggs one at a time, beating well after each addition, until the mixture is smooth and glossy.", "Transfer the pastry to a piping bag fitted with a large plain nozzle and pipe a large spiral, about 24cm/10in in diameter and 1cm/½in deep, onto one of the prepared baking trays. ", "Pipe small, evenly sized balls of the remaining choux pastry onto the second baking tray. Using a wet finger, gently smooth any pointed peaks on the top of the balls.", "Bake the choux pastry in the oven for 20-25 minutes, or until golden-brown and cooked through. Set aside to cool slightly, then pierce the sides of the small buns once using a small, sharp knife to let the steam out. Do the same to the large pastry base.", "For the filling, whisk the custard with the double cream until soft peaks form when the whisk is removed. Add the orange liqueur and whisk until firm peaks form when the whisk is removed. Spoon one-third of the mixture into a piping bag fitted with a small nozzle.", "Pierce the flat bases of 16 of the small choux buns with a knife, insert the nozzle of the piping bag, and fill each with some of the cream mixture.", "Heat the sugar in a frying pan over a high heat until it melts and starts to caramelise to a light golden-brown; swirl the pan, but don’t stir. (CAUTION: melted sugar is very hot. Take care not to burn yourself.) Working quickly, dip the tops of each filled choux bun into the caramel to coat, then return them to the tray until the caramel has set.", "To serve, place the choux pastry base onto a serving plate. Cover the pastry base with quenelles of the remaining cream mixture. Arrange the caramel-topped choux buns at the edge of the pastry base, then fill the centre with the soft fruit and twisted willow sprigs, if using."]}, {"isVegetarian": true, "title": "Gâteau St Honoré", "url": "www_bbc_co_uk_food_recipes_gteau_st_honor_85590", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250g/9oz strong plain flour", "1 tsp fine salt", "250g/9oz butter, diced", "125ml/4fl oz whole milk", "100g/3½oz butter", "½ tsp salt", "1½ tsp caster sugar", "150g/5½oz plain flour", "4 large free-range eggs", "1 free-range egg, beaten, for egg wash", "9 free-range eggs, yolks only", "180g/6¼oz caster sugar", "60g/2¼oz plain flour", "750ml/25fl oz whole milk", "1¼ tsp vanilla paste", "150g/5½oz dark chocolate (approximately 60% solids), broken into pieces", "150ml/5½fl oz whipping cream, cold", "500ml/18fl oz double cream, cold", "60g/2¼oz icing sugar", "1 tsp vanilla extract", "200g/7oz caster sugar", "200g/7oz dark chocolate (approximately 60% solids)"], "serves": "Serves 10", "time": {"preparation": "1-2 hours", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["For the rough puff pastry, sift the flour and salt into a large bowl.  Rub the butter into the flour using your fingers until you have small lumps of butter remaining (stop before it starts to look like breadcrumbs as you want squashed pieces of butter showing in the mix).  Add 150ml/5fl oz water, or enough to bring the mix together (you may not need all the water).  ", "Flour the work surface and roll out the dough to a neat rectangle that is about three times longer than its width.  Fold in one third of dough to the centre and cover this with the remaining third. Cover and leave to rest in fridge for 20 minutes. Roll the pastry out again to the previous length and width, and fold in thirds as before. Cover and let rest again for at least 20 minutes in fridge (or if you have time an hour). ", "Preheat the oven to 180C/350F/Gas 4 and line a baking tray with parchment paper. ", "For the choux pastry, in a medium-sized pan over a low heat, bring the milk to a simmer. Add the butter, 124ml/4fl oz water, salt and sugar and bring to boiling point. Add the flour and mix with a wooden spoon. Cook for about a minute until the paste leaves the sides of the pan. Transfer to the bowl of an electric mixer and set aside to let it cool slightly before adding the eggs one at a time, beating constantly. The paste will become smooth and shiny.", "To make the small choux buns, using a piping bag and plain nozzle pipe 16 small choux buns on to the lined baking tray. Set aside the remaining choux pastry. Brush each choux bun with egg wash and bake on the middle shelf for 15-20 minutes. Turn off the oven and leave the choux buns in the residual heat for 10 minutes to dry out. Remove the buns from the oven and then return the oven to 180C/350F/Gas 4.", "Cut a 27cm/10in disk from the rough puff pastry and place it on a lined baking tray. Pipe a spiral of choux paste starting from centre of the disk, stopping when two thirds of the disk is covered. Now pipe a border of choux paste round the edge leaving a 5mm/¼in of space at the outer edge of the pastry base (the choux ring will expand to reach it). Brush with egg wash and bake at 180C/350F/Gas 4 for 25–35 minutes. Turn off the oven and leave in the residual heat for 10 minutes to allow the choux pastry to crisp up. Transfer to a cooling rack. ", "For the crème pâtissière, whisk the egg yolks and a third of the sugar in a bowl until light in colour and fluffy. Add the flour and mix thoroughly. In a large pan, heat the milk, vanilla paste and the rest of the sugar. When it comes to the boil, pour it over the egg yolk mixture and whisk together. Transfer to a clean saucepan, bring it back to the boil - whisking continuously - and cook for a few minutes until thick.  Pass through a sieve into a bowl and put some cling film directly onto the surface to prevent a skin forming.  Transfer to the fridge to chill.", "When the crème pâtissière has cooled, spoon it into a piping bag with a medium circular nozzle attached and pipe it into the small choux and over the pastry base. ", "For the crème Chantilly, melt the chocolate in the microwave and then set aside to cool. In a chilled bowl combine both creams with the icing sugar and vanilla extract.  Whisk until it thickens enough to pipe, but do not overbeat (it should be a light consistency).  Transfer half the crème to another bowl and add the cooled, melted chocolate to it. Fold in carefully (do not whisk) and then spoon into a piping bag with a large round nozzle attached.", "In another piping bag with the same nozzle attached, add the plain crème Chantilly. Pipe alternating rows of both creams to cover the crème pâtissière completely. ", "Make a caramel by melting the sugar and 50ml/2fl oz water in a heavy-based pan. Heat until the caramel is a deep amber colour, then remove from the heat and plunge the base of the pan into cold water to prevent the remaining caramel burning. ", "Line a baking tray with parchment paper. Carefully dip each choux into the caramel and transfer to the baking tray, caramel-side down. When the caramel has cooled and set, attach the choux buns round the outside of the choux ring using the caramel (heat it a little to soften if you need to). Leave a 1½cm/½in space between each choux.", "To decorate, make chocolate curls by scraping a vegetable peeler down the edge of the block of chocolate. Pipe crème Chantilly between each choux and place a chocolate curl on top. "]}, {"isVegetarian": true, "title": "Guacamole and tortilla strips", "url": "www_bbc_co_uk_food_recipes_guacamoleandtortilla_84510", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 ready-made flour tortillas, sliced into strips", "2 tsp olive oil", "½ avocado, peeled, stone removed", "1 chilli, halved, seeds removed", "1 lime, juice only", "2 tbsp Greek yoghurt", "sprig fresh parsley, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Heat a griddle pan until smoking. Drizzle the tortilla strips with olive oil and place into the griddle pan. Cook for 1-2 minutes on each side, until crisp.", "Place all of the remaining ingredients, except the parsley sprig, into a food processor and blend until smooth.", "To serve, place the guacamole into a serving bowl and garnish with the parsley. Place the crisp tortilla strips on a plate alongside."]}, {"isVegetarian": true, "title": "Guacamole with fried tortillas", "url": "www_bbc_co_uk_food_recipes_guacamolewithfriedto_85935", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp olive oil", "1 garlic clove, chopped", "1 smoked chipotle chilli, chopped (available at some supermarkets and from online suppliers)", "½ avocado, peeled and stone removed", "1 lime, juice only", "handful fresh coriander, chopped", "salt and freshly ground black pepper", "500ml/18fl oz vegetable oil, for deep frying", "4 ready-made flour tortillas, cut into 8 wedges"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the guacamole, place all of the guacamole ingredients into a food processor and blend until smooth.", "For the tortillas, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Carefully place the tortilla wedges into the hot oil and deep fry until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper.", "To serve, place the fried tortillas onto a serving plate with the guacamole in a small bowl alongside."]}, {"isVegetarian": true, "title": "Guacamole with griddled pitta bread", "url": "www_bbc_co_uk_food_recipes_guacamolewithgriddle_85064", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["½ avocado, peeled, chopped", "2 tbsp plain yoghurt", "squeeze lemon juice", "1 garlic clove, chopped", "1 tbsp olive oil", "salt and freshly ground black pepper", "6 ready-made mini pittas, split", "3 sun-blushed tomatoes ", "½ avocado, sliced, to garnish"], "serves": "Serves 2-3", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["For the guacamole, place all of the guacamole ingredients into a blender and pulse until combined but still slightly chunky.", "Heat a griddle pan and cook the pittas for 1-2 minutes on each side, until warmed through.", "To serve, place the guacamole into a serving bowl. Top with the sun-blushed tomatoes and sliced avocado and place the pitta breads alongside."]}, {"isVegetarian": true, "title": "Guava kulfi with tropical fruit salad", "url": "www_bbc_co_uk_food_recipes_guavakulfiwithtropic_86120", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["350ml/12fl oz whole milk", "150ml/5fl oz double cream", "125/4fl oz condensed milk", "50g/2oz powdered milk ", "25g/1oz caster sugar ", "½ tsp freshly grated nutmeg", "800g/2lb ripe yellow-skinned guavas, trimmed and halved", "100ml/3fl oz water", "500g/1lb 4oz prepared fresh fruit - a combination of Alphonso mango, pineapple, lychee, watermelon, persimmon and starfruit works especially well", "2 passion fruit, pulp and seeds scraped out", "1 lime, juice and zest only", "caster sugar, to taste"], "serves": "Serves 4-6", "time": {"preparation": "overnight", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 30, "preparationMins": 0}, "recommendations": 0, "method": ["For the kulfi, place the milk, cream, condensed milk, powdered milk, sugar and nutmeg into a non-stick pan and rapidly bring to the boil. Lower the heat and simmer gently for 15 minutes. Remove from the heat and allow to cool.", "Meanwhile, place the guavas into a blender with the water and blend to make a purée. Push the puree through a sieve with the back of a spoon and discard the seeds. You should be left with 500ml/½ litre of purée.", "Add the guava purée to the milk mixture and stir well.", "Spoon the mixture into six individual kulfi moulds, jelly moulds or yoghurt pots and freeze overnight.", "Just before serving the kulfi, prepare the fruit salad. Place the prepared fruit into a bowl with the passion fruit pulp and seeds, lime juice and zest and sugar and stir to coat the fruit.", "To serve, turn the kulfi out of their moulds onto serving plates and serve with the fruit salad."]}, {"isVegetarian": false, "title": "'Guilt-free gourmet' sticky toffee pudding", "url": "www_bbc_co_uk_food_recipes_guilt-free_gourmet_20918", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/guilt-free_gourmet_20918_16x9.jpg", "ingredients": ["225g/8oz dates, pitted and chopped", "200ml/7fl oz boiling water", "100ml/3½oz rice milk", "90g/3¼oz dairy-free butter (such as sunflower spread)", "150g/5½oz coconut palm sugar ", "3 free-range eggs", "2 tbsp date syrup ", "180g/6oz gluten-free flour or rice flour, plus extra for flouring the moulds", "1 tsp baking powder", "1 tsp bicarbonate of soda", "1 tsp vanilla extract", "pinch sea salt", "100g/3½oz dairy-free butter (such as sunflower spread)", "175g/6oz coconut palm sugar", "1 tbsp blackstrap molasses ", "100ml/3½oz maple syrup", "230ml/8oz soy cream, plus extra to serve", "½ tsp vanilla extract", "pinch of sea salt"], "serves": "Makes 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease and flour the moulds, then line the bases with a disc of oiled parchment paper. ", "To make the pudding, soak the dates in the boiling water for five minutes, then blend in a food processor until smooth. Add the remaining ingredients and blend again until well combined. ", "Spoon the mixture into the prepared moulds (but not right to the top, as they rise quite a bit) and bake in the preheated oven for 20 minutes, or until they are risen and firm. (You can check they are cooked by inserting a skewer into the middle - if it comes out clean, the pudding is ready.) ", "Ten minutes before the puddings are ready, make the toffee sauce. Melt the butter, coconut palm sugar, blackstrap molasses and maple syrup in a saucepan over low heat, then simmer for a few minutes. Gradually stir in the soy cream, vanilla extract and salt and bring to the boil for 1–2 minutes, or until slightly thickened. Keep warm until ready to serve.", "Leave the puddings to cool in their moulds for a few minutes, then turn out onto serving plates. Spoon the toffee sauce over and around with a little extra soy cream to top it off. "]}, {"isVegetarian": false, "title": "Guinea fowl choux farci", "url": "www_bbc_co_uk_food_recipes_guinea_fowl_choux_farci_32334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": [" 900g/2lb shallots, ends trimmed", "120ml/4fl oz olive oil", "1 fresh thyme sprig", "knob of butter", "6 tbsp double cream", "salt and freshly ground black pepper", "50g/1¾oz unsalted butter", "1 tbsp olive oil", "1 banana shallot, chopped", "500g/1lb 2oz chestnut mushrooms, finely chopped", "4 guinea fowl legs, boned and minced\t\t", "200g/7oz mushroom duxelles (see above)", "1 tsp Dijon mustard\t", "1 tbsp snipped fresh chives\t\t\t\t\t\t\t", "1 tbsp chopped fresh parsley\t\t\t\t\t", "1 tbsp chopped fresh tarragon\t\t\t\t", "6 hispi cabbage leaves, stems removed", "75g/2¾oz unsalted butter", "200g/7oz girolles mushrooms, cleaned", "2 large potatoes, peeled and spiralised", "400ml/14fl oz gravy or jus"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["For the purée, preheat the oven to 180C/160C Fan/Gas 4. ", "Lay two large sheets of foil on top of each other on a work surface. Put the shallots in the centre of the foil, pour over the oil, add the thyme and season well. Draw the sides of the foil up to the centre and crinkle the edges to seal and form a parcel. Put on a baking tray and bake for 1½ hours, or until the shallots are really soft.", "Remove the skins from the shallots and put the flesh in a blender with the butter and cream. Blitz well, then transfer to a bowl and season. ", "For the mushroom duxelles, heat a medium sauté pan and add the oil and butter, one hot add the shallots and cook for 3-4 minutes. Add the mushrooms and cook for a further 8-10 minutes or until all the water has gone out of the mushrooms. Set aside.", "For the guinea fowl, put the mince, duxelles, mustard, chives, parsley and tarragon in a large bowl and mix. Roll the mixture into six balls.", "Blanch the cabbage in lightly salted water for 3–4 minutes, then plunge into iced water.  Drain on kitchen paper.", "Lay a sheet of cling film out and place a cabbage leaf on it. Put a guinea fowl ball in the centre and wrap the leaf around. Bring the cling film up around the leaf and tie like a balloon. Repeat with the remaining leaves and guinea fowl balls. ", "Bring a pan of water to 90C. Poach the balls for 15 minutes. Remove and set aside. ", "Heat a medium frying pan and add half the butter. Once hot and melted, add the mushrooms and cook for 2–3 minutes.", "Heat the remaining butter in a separate pan, add the spirlised potato and cook until crispy.", "Serve the guinea fowl with the shallot puree, sautéed girolles, crispy potatoes and gravy."]}, {"isVegetarian": false, "title": "Guinea fowl cooked with Riesling and chanterelles", "url": "www_bbc_co_uk_food_recipes_guinea_fowl_cooked_with_67526", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["12 baby white onions", "130g/4½oz butter", "300g/10½oz Tenderstem broccoli spears, trimmed", "200g/7oz chanterelles ", "1 guinea fowl, about 1.6kg/3lb 8oz, cut into 8 pieces, carcass and neck chopped and reserved ", "3 shallots, thinly sliced", "2 thyme sprigs ", "2 bay leaves", "2 tarragon sprigs, leaves and stalks separated", "500ml/18fl oz Riesling white wine", "300ml/10fl oz chicken stock", "300ml double cream", "½ lemon, juice only", "salt and freshly ground pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Put the onions and 30g/1oz of the butter in a small pan and cover with cold water. Add a pinch of salt and cook over a medium heat for 15 minutes. Remove from the heat and set aside, leaving the onions in their cooking water. ", "Preheat the oven to 200C/400F/Gas 6.", "Melt the remaining butter over a very gentle heat and bring slowly to the boil. Skim off the froth from the surface. Carefully pour the liquid butter into a bowl, holding back the milky sediment in the bottom of the pan. The clarified butter should be the colour of light olive oil.", "Cook the broccoli stems in boiling salted water for two minutes, the refresh in cold water and drain. Cover with cling film and set aside.", "Trim the chanterelle stalks, then use a damp tea towel to gently wipe away any traces of sand or earth. ", "Heat three tablespoons of the clarified butter in a frying pan over a medium-high heat, add the chanterelles and a pinch of salt and cook gently for 3-4 minutes. As soon as they have released their liquid, transfer to a bowl and cover with cling film, perforated in several places. ", "Heat the remaining clarified butter in an ovenproof pan set over a moderately high heat. Sprinkle the guinea fowl pieces and carcass with salt and add to the pan. Colour on all sides, then transfer the pan to the oven and cook for 15 minutes. ", "Take the guinea fowl out of the pan and put in a dish, leaving the browned carcass pieces in the pan. Cover the dish with foil and set aside. Pour off the fat from the pan.", "Add the shallots, thyme, bay leaves and tarragon stalks to the carcass pieces in the pan. Pour in the wine and turn the heat up to high. ", "Use a wooden spoon or spatula to scrape the cooked on parts from the bottom of the pan to deglaze it. Continue to cook until the volume of liquid is reduced by two-thirds. ", "Pour in the stock and cook to reduce the volume of liquid by half, then add the cream and cook over a gentle heat until the sauce is thick enough to lightly coat the back of a spoon. Strain through a chinois cloth or fine sieve into a large pan and season with salt and pepper to taste.", "Add the pieces of guinea fowl to the sauce, along with the onions, broccoli and chanterelles, making sure each is well drained. Bring to the barest simmer over a gentle heat, then add the lemon juice and two-thirds of the tarragon leaves and immediately remove from the heat. ", "To serve, tip the contents of the pan into a shallow serving dish, sprinkle with the remaining tarragon leaves and serve, with bread to mop up the delicious juices."]}, {"isVegetarian": false, "title": "Guinea fowl Maryland", "url": "www_bbc_co_uk_food_recipes_guinea_fowl_maryland_95208", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz butter", "198g tin sweetcorn, drained", "100ml/3½fl oz chicken stock", "2 large florets cauliflower, cooked", "vegetable oil, for deep frying", "1 tsp paprika", "1 tsp Cajun spice", "1 tsp ground ginger", "2 guinea fowl breasts, skin on", "5 tbsp brandy", "200ml/7fl oz chicken stock", "100g/3½oz  butter ", "198g tin sweetcorn, drained ", "2 tbsp birch syrup (alternatively use maple syrup mixed with a touch of soy sauce)", "1 very ripe banana, at room temperature", "3-4 tbsp double cream", "1 bunch of watercress, to garnish"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the sweetcorn purée, heat half the butter in a large frying pan and add the corn. Cook for 1-2 minutes then add the stock and simmer for 3-4 minutes. Stir in the remaining butter and the cauliflower and blend until smooth. Set aside.", "For the guinea fowl Maryland, preheat the oven to 180C/160C Fan/Gas 4.", "Heat a deep-fat fryer to 180C, or alternatively half fill a large deep saucepan with vegetable oil and heat it until a cube of bread turns golden-brown within 1 minute of being added to the oil. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Combine the spices and rub them into the guinea fowl. Heat an ovenproof frying pan and, once hot, add the meat and cook until golden-brown all over. Deglaze the pan with the brandy by stirring the bottom to loosen any charred bits of meat. Cook for a few minutes to allow the alcohol to burn off. Add the chicken stock to the pan, cover with aluminium foil and finish in the oven for 8-10 minutes.", "In a frying pan, heat a knob of butter and fry the sweetcorn until the butter is brown. Stir in the birch syrup. Keep warm until ready to serve.", "With the skin on, use kitchen paper to ensure the banana is dry. Deep fry the banana, with the skin on, until it is brown and bubbling then remove from the fryer. Cut in half widthways. ", "When the guinea fowl is cooked, remove it from the pan and set aside to rest. Put the pan on the hob and heat until the volume of liquid has reduced to a sauce. Remove from the heat and whisk in the remaining butter and cream to finish.", "To serve, carve the breasts and serve with the toasted corn, banana halves and sweetcorn purée. Spoon over the sauce and garnish with watercress."]}, {"isVegetarian": false, "title": "Guinea fowl with porcini and lardons", "url": "www_bbc_co_uk_food_recipes_guinea_fowl_with_bacon_26194", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 guinea fowl about 1.2kg/2lb 12oz each ", "10g/¼oz dried porcini mushrooms", "2 tbsp olive oil", "200g/7oz smoked bacon lardons", "4 banana shallots, chopped", "4 sprigs thyme", "300ml/½ pint pale dry amontillado sherry or dry white wine ", "50g/1¾oz butter", "50g/1¾oz plain flour ", "200g/7oz small chestnut mushrooms ", "2-3 tbsp full-fat crème fraîche", "small bunch fresh parsley, chopped"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["To joint the birds, bend the legs and thighs away from the birds, then cut between the joint to separate them. Cut between the thigh and leg joints to make two pieces. Bend back the wings and cut them off.  Set aside the wings for the stock.  ", "Cut either side of the breast bone and remove the breasts. Pull the skin off all the pieces of meat. Place the carcasses, skin and the wings in a pan with 900ml/1½ pints of water and bring to the boil to make stock. Simmer for 30 minutes, then remove from the heat. ", "Set the oven to 180C/350F/Gas 4 (160C fan). Place the porcini mushrooms in a small bowl, cover with four tablespoons of boiling water and set aside to plump up. ", "Heat the oil in a large frying pan and fry the guinea fowl pieces for about five minutes, or until golden-brown on all sides. You may need to do this in two batches.  Remove the meat with a slotted spoon and place in a large roasting tin. Don't wash the frying pan, you will need it later.", "Roast the guinea fowl in the oven for 25 minutes and then remove the guinea fowl breasts. Return the legs and thighs to the oven to cook for a further 15 minutes.  Cut the breasts diagonally in half to give two portions. Set the meat aside once cooked and keep it warm for serving. ", "Add the lardons and shallots to the frying pan and fry gently for 10 minutes, or until the shallots are tender, but not browned. Add the thyme and sherry (or wine) and boil for a few minutes, or until the volume of liquid has reduced by a third. ", "Melt the butter in a small pan, add the flour and cook for a minute, or until thickened. Gradually pour in 500ml/18fl oz of the stock, stirring until thickened. Pour the sauce into the pan with the lardons and onions. ", "Strain the soaked mushrooms through a sieve, reserving the water.  Chop the mushrooms finely and add them to the sauce with the soaking water. Add the fresh mushrooms. ", "Cook for five minutes, or until the mushrooms are tender. Season to taste. Stir in the crème fraiche, sprinkle with parsley. Serve the guinea fowl with the sauce alongside."]}, {"isVegetarian": false, "title": "Guinea fowl with bread sauce", "url": "www_bbc_co_uk_food_recipes_guinea_fowl_with_bread_78715", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["¼ onion, roughly chopped", "½ stick celery, roughly chopped", "½ carrot, roughly chopped", "1 bay leaf", "125ml/4fl oz red wine", "giblets from the guinea fowl", "1 guinea fowl (about 1.2-1.5kg/2lb 12oz-3lb 5oz)", "about 250g/9oz butter", "1 small onion or 1 banana shallot, peeled and finely chopped", "2 cloves", "3 fresh bay leaves", "1.2 litres/2 pints full-fat milk", "½ loaf good-quality white bread", "200ml/7fl oz jus (see above)", "2 tbsp olive oil", "250g/9oz kale", "250g/9oz cavolo nero"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["For the jus, preheat the oven to 150C/300F/Gas 2. Place all the ingredients along with 250ml/9fl oz water into a small saucepan with a lid. Place a piece of greaseproof on top of the ingredients and place a lid on top.\r\n\r\n", "Cook in the oven for two hours. Remove from the oven and pass the jus through a sieve.", "For the guinea fowl, using kitchen string, tie the legs in front of the bird and season with salt and pepper.", "In a large casserole, melt 150g/5½oz of the butter and brown the bird over a moderate heat until really well browned all over, basting with the brown butter as you go.", "Place the bird on a trivet on top of a roasting tin and cook in the oven at 150C/300F/Gas 2 for about 35 minutes, or until the juices run clear when pierced with a skewer.", "Fry the onion in 50g/1¾oz of the butter in a pan, add the cloves, bay leaves and milk, bring to a simmer and then set aside. ", "Remove the crusts from the bread and blend the crusts into breadcrumbs in a food processor. Set aside the white of the bread for now. ", "Sprinkle the crumbs onto an oven tray, dot with all but a knob of the remaining butter and cook for 10 minutes.", "Dice the white crumb of the remaining bread, add it to the infused milk and remove the cloves and bay leaves. Bring back to a simmer and do not stir. Add a knob of butter and leave it to cook over a low heat.", "Take the bird from the oven, cover and set aside to rest for 20 minutes in a warm place. Place the tin over a medium heat and add the jus. Let it bubble, stirring all the time to remove any meat sediment in the tray. ", "Heat the oil in a separate pan and fry the kale and cavolo nero until tender. Season with salt and pepper.", "Beat the bread sauce and then spoon it onto each plate. Serve some greens alongside. Carve the bird and place on the cabbage, spoon the roasting juice over and serve the toasted breadcrumbs on the side. "]}, {"isVegetarian": false, "title": "Poussin Georgian style", "url": "www_bbc_co_uk_food_recipes_guineafowlgeorgianst_76688", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 poussin or small guinea fowl, weighing about 450g/1 lb each", "80g/3oz butter", "salt and freshly ground black pepper", "200g/7oz pearl barley", "2 tbsp olive oil", "1 shallot, finely chopped", "100g/3oz dried, plump sour cherries", "100g/3oz toasted walnuts, chopped", "3 tbsp fresh parsley, chopped", "2 tbsp pomegranate molasses", "½ lemon, juice and finely grated zest only", "150ml/5fl oz dry white wine", "100ml/4fl oz pomegranate juice"], "serves": "Serves 2", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Cook the pearl barley in a pan of boiling water for about 20 minutes, until soft. Drain and put to one side.", "Preheat the oven to 180C/350F/Gas 4.", "Rinse the poussin or guinea fowls under cold running water and pat dry thoroughly.", "For the stuffing, heat the olive oil in a heavy frying pan and cook the shallot and sour cherries for a few minutes until the cherries are plump and juicy.", "Add the cooked pearl barley and continue cooking for 2-3 minutes.", "Add the toasted walnuts, parsley, pomegranate molasses and lemon juice and zest. Stir well and leave to cool.", "Once the stuffing has cooled, use it to stuff the cavities of the birds, dividing it evenly between the two. Don't worry if the stuffing overspills.", "Smear the outside of the birds with butter and sprinkle with salt and freshly ground black pepper.", "Place the birds in a large roasting tray and add the wine and pomegranate juice. Roast for 30-35 minutes or until cooked through, basting at regular intervals.", "When the poussin or guinea fowl are cooked, remove from the oven and leave to rest for 10 minutes. Carve and serve with the stuffing."]}, {"isVegetarian": false, "title": "Guinea fowl with garlic and rosemary served with bruschetta", "url": "www_bbc_co_uk_food_recipes_guineafowlwithgarlic_14050", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 guinea fowl, cut into chunks ", "salt and freshly ground black pepper ", "plain flour for dusting ", "150ml/10 tbsp extra virgin olive oil ", "4 garlic cloves, sliced lengthways ", "large bunch rosemary, broken in half ", "150ml/5fl oz white wine ", "few slices bread ", "garlic cloves"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Season the guinea fowl chunks with salt and pepper and coat with plain flour.", "In a large heavy-based frying pan, heat the extra virgin olive oil.  When hot, add the floured guinea fowl and seal well on all sides until golden-brown and quite crispy.", "At this stage, reduce the heat to low, add the garlic and rosemary, cover with a lid and cook for 30 minutes, turning the meat from time to time.  ", "After 30 minutes increase the heat to high, remove the lid, add the white wine (if you wish you could flambé the fowl now) or allow to evaporate.  ", "To make the bruschetta, when the guinea fowl is ready, toast some slices of bread. Immediately rub on some garlic and drizzle some of the olive oil from the guinea fowl sauce.  Serve the guinea fowl with slices of bruschetta."]}, {"isVegetarian": false, "title": "Guinea fowl with wild mushrooms", "url": "www_bbc_co_uk_food_recipes_guineafowlwithwildmu_77765", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 small sprig fresh thyme ", "4 cloves of garlic, unpeeled and lightly crushed", "1 large guinea fowl, weighing about 1.5 kg/3lb 5oz", "salt and freshly ground black pepper ", "4 tbsp light olive oil", "100ml/3fl oz Madeira or port", "250ml/9fl oz brown chicken or beef stock", "2 tbsp butter", "½ tsp fresh thyme leaves", "½ tbsp fresh parsley, chopped", "salt and freshly ground black pepper", "25g/1oz butter ", "250g/9oz wild mushrooms, such as chanterelles, shiitake", "salt", "1 savoy cabbage                    ", "pinch of nutmeg"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 200C/400F/Gas 6. ", "Place the thyme and garlic inside the guinea fowl and season inside and out. ", "Heat two tablespoons of the oil in a roasting tin in the oven. Place the guinea fowl on its side in the tin and roast for 10 minutes. ", "Turn the guinea fowl on to its other side and continue to roast for another 10 minutes. Turn the guinea fowl breast-side up, lower the oven temperature to 180C/350F/Gas 4, and roast for 20 minutes.", "Remove the guinea fowl from the oven, transfer to a clean dish, cover with foil and allow to rest for 15 minutes. To make the sauce, pour the fat from the roasting pan and deglaze the pan with Madeira or port. Tip the juices into a saucepan and add the stock. Boil until reduced by half.", "Heat a large frying pan over a high heat, add the remaining oil and fry the mushrooms with a little salt for 3-4 minutes. Tip onto a roasting tray. ", "Cut the legs off the guinea fowl and place on the roasting tray with the mushrooms. Cut down the side of the breastbone and remove the breasts. Place on the roasting tray.", "To serve, warm the mushrooms and guinea fowl in the oven for 3-4 minutes. Meanwhile, bring the sauce to the boil, then whisk in the butter and herbs. Season to taste.", "Heat a frying pan until hot. Add butter and the cabbage. Stir fry until wilted season with salt, pepper and nutmeg.", "Place a little cabbage and some mushrooms on each warmed plate. Top with the guinea fowl and pour over the sauce."]}, {"isVegetarian": true, "title": "Guinness and ginger float", "url": "www_bbc_co_uk_food_recipes_guinness_and_ginger_72284", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["400ml/14fl oz full-fat milk", "100ml/3½fl oz double cream", "1 vanilla pod, split in half lengthways, seeds scraped out with a sharp knife", "6 free-range egg yolks", "65g/2¼oz caster sugar", "2 tbsp ground ginger", "125g/4½oz crème fraîche", "125ml/4½fl oz double cream", "2 tsp stem ginger syrup, from a jar ", "225g/8oz plain flour", "2 tsp ground ginger", "pinch ground cinnamon", "pinch ground mixed spice", "pinch salt", "85g/3oz butter, melted, plus extra for greasing", "225g/8oz golden syrup", "55g/2¼oz demerara sugar", "1 free-range egg", "4 tsp milk", "100g/3½oz ginger cake, cut into cubes (see above)", "icing sugar, for dusting", "1 small firm pear, peeled, core removed, diced", "1 piece stem ginger (from a jar), finely chopped", "1 x 440ml can Irish stout", "1 x 500ml bottle spicy ginger ale"], "serves": "Serves 4", "time": {"preparation": "over 2 hours", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 150, "preparationMins": 120}, "recommendations": 0, "method": ["For the ginger ice cream, bring the milk, cream and vanilla seeds to the boil in a saucepan. Whisk the egg yolks and sugar in a bowl until pale and fluffy.", "When the cream mixture is just boiling, pour it over the egg yolk mixture, whisking continuously to combine.", "Return the custard mixture to the saucepan and cook over a medium heat, stirring constantly, until it has thickened enough to coat the back of a spoon. Strain the custard into a jug and stir in the ground ginger. Set aside to cool. Once cool, chill the custard in the fridge.", "Transfer the chilled custard to an ice-cream machine and churn according to the manufacturers' instructions until set. Freeze until needed.", "For the crème, whisk together all of the crème ingredients in a large bowl until well combined. Chill for at least 30 minutes.", "For the ginger cake, preheat the oven to 170C/150C Fan/Gas 3. Grease a 35x25cm Swiss roll tin with butter.", "In a large bowl, mix together the dry ingredients until well combined. In a separate bowl, mix together the melted butter, syrup and sugar until well combined. In a third bowl, whisk together the egg and milk.", "Mix the egg mixture, dry ingredients and syrup mixture together until well combined, then pour the cake mixture into the prepared tin. Bake in the oven for 8-10 minutes, or until a skewer inserted into the centre of the cake comes out clean. Roughly chop 100g/3½oz of the ginger cake into small cubes.", "For the crumble, dust the ginger cake cubes in icing sugar and place them onto a baking tray. Bake in the oven for 2-3 minutes, or until the sugar has melted and caramelised and the cake is slightly toasted. Remove from the oven and set aside.", "In a bowl, mix together the pear and confit ginger until well combined. Just before serving, mix the pear mixture with the toasted ginger cake.", "To serve, sprinkle some of the crumble mixture into the bottom of a large glass bowl, or 4 individual glass bowls. Top with some of the ginger ice cream. Cover the ice cream with a layer of the crème mixture. Drizzle over some of the Guinness and ginger ale (you may not need to use all of the liquids). Serve immediately."]}, {"isVegetarian": false, "title": "Beef, stout and chestnut casserole with leek colcannon", "url": "www_bbc_co_uk_food_recipes_guinnessbeefandchest_93084", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 heaped tbsp plain flour", "1 tsp sea salt flakes", "1 tsp freshly ground black pepper", "1kg/2lb 3oz stewing steak, cut into chunks", "2 tbsp vegetable oil", "3 large onions, peeled, sliced", "1 tbsp tomato purée", "8 carrots, peeled and cut into discs", "2 sticks celery, chopped", "500ml/17½fl oz beef stock", "250ml/9fl oz Irish stout", "1 tsp caraway seeds", "1 tbsp raisins", "20 chestnuts, cooked and sliced", "2 tbsp chopped fresh parsley, to serve", "1kg/2lb 3oz floury potatoes, such as King Edward or Maris Piper, peeled and cut into large chunks", "250ml/9fl oz milk", "500g/17½oz leeks, washed and cut into rounds", "2 tbsp butter", "1 tbsp double cream", "sea salt flakes and white pepper"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 160C/320F/Gas 2.", "For the casserole, place the flour in a plastic bag, add the sea salt and freshly ground black pepper and shake to mix together. Add the chunks of stewing steak and toss to coat them in the flour. ", "Heat a large frying pan over a high heat and add the vegetable oil. Brown the beef in small batches, frying until the beef is golden-brown all over. Transfer each bath of seared beef to a casserole dish and repeat the process as necessary.", "Fry the onions in the pan the beef was cooked in for 2-3 minutes, or until softened, then stir in the tomato purée and cook for a further two minutes. Transfer the mixture to the casserole dish. ", "Add the carrots, celery, beef stock, Irish stout, caraway seeds and raisins to the casserole and mix well to combine. Cover the casserole with a lid and cook in the oven for two hours, or until the beef is very tender. ", "Add the chestnuts and cook for a further 30 minutes. ", "Meanwhile, for the leek colcannon, cook the potatoes in a pan of simmering water for 15-20 minutes, or until the potatoes are tender. Drain the potatoes and set aside. ", "In a separate pan, bring the milk to a simmer and poach the leeks for 4-5 minutes, or until tender. Drain the leeks, reserving a few tablespoons of the milk. ", "Mash the potatoes and fold in the butter and the cream. Add the leeks and a few tablespoons of the reserved milk and mash together until creamy. Season, to taste, with sea salt and white pepper. ", "To serve, spoon the beef casserole into serving bowls and spoon the leek colcannon alongside."]}, {"isVegetarian": true, "title": "Gulab jamun", "url": "www_bbc_co_uk_food_recipes_gulabjambu_81245", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/gulabjambu_81245_16x9.jpg", "ingredients": ["225g/8oz powdered milk", "110g/4oz plain flour", "1¼ tsp baking powder", "½ tsp bicarbonate of soda", "350ml/12fl oz milk", "25g/1oz butter, melted", "vegetable oil, for deep frying", "200g/7oz caster sugar", "100ml/3½fl oz water", "few strands saffron", "1 tbsp chopped pistachio nuts", "1 tbsp flaked almonds, toasted in a pan"], "serves": "Serves 2", "time": {"preparation": "1-2 hours", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["For the dough balls, mix all the ingredients together in a bowl, adding enough extra water to form a soft, sticky dough. Cover with cling film and set aside for 10 minutes.  Shape the dough into small round balls.", "Heat the oil in a deep heavy-bottomed frying pan. It is ready when a breadcrumb dropped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep fry the balls until golden brown, then remove from the oil with a slotted spoon and set aside on kitchen papper to drain.", "Make a sugar syrup by heating the sugar and water together with the saffron until the sugar has dissolved and the mixture is syrupy.", "When the dough balls are cool, add to the syrup and leave to soak for about 1 hour. ", "Garnish with chopped pistachio nuts and flaked almonds and serve."]}]