[{"ingredients": ["300g / 10½oz de haggis", "300 g / 10½oz herby salchicha", "2 cucharadas de miel de brezo", "2 cucharadas de whisky escocés", "1 granizo, pelado y picado en cubos ásperos", "2 patatas grandes, Maris Piper o similar, peladas y picadas en cubos ásperos", "30g / 1oz de mantequilla derretida, más extra para freír", "Harina normal de 75 g / 2½ oz", "sal marina y pimienta negra", "aceite de oliva"], "method": ["Precalentar la barbacoa para asar directamente o una parrilla a fuego.", "Combina el haggis y la carne de salchicha en un bol. Divide en 12 piezas iguales y rueda en bolas. Ensarte tres bolas en cada pincho, colóquelas en un plato o bandeja y refrigere por 30 minutos, o hasta que estén firmes.", "Para hacer las neeps y tatties, hierva el colinabo y las papas en una sartén grande con agua con sal durante 20 minutos o hasta que estén tiernas. Escurra y deje en la cacerola con la tapa para secar al vapor durante 10-15 minutos.", "Pase el colinabo y las papas a través de un ricer de patata o empuje a través de un tamiz grueso en un tazón grande. Agregue la mantequilla hasta que se derrita, luego agregue la harina y mucha sal y pimienta.", "Coloque una sartén de hierro fundido sobre la barbacoa para calentar o caliente la cocina. Pat la mezcla de papa en una ronda grande, o divídala en cuartos y pat en rondas más pequeñas. Calentar un chorrito de aceite en la sartén, agregar un poco de mantequilla y calentar hasta que se forme espuma. Freír la torta de patata durante 4-5 minutos por cada lado hasta que se dore, luego retírela de la sartén. Si elabora un pastel más grande, déjelo reposar durante 2 minutos y luego córtelo en rodajas.", "Mientras tanto, asa a la parrilla los kebab de haggis durante 8-10 minutos, volteándolos regularmente. Hacia el final de la cocción, mezcle la miel y el whisky en un tazón pequeño y cepille los kebabs.", "Retire los kebabs del fuego, déles un pincel final del glaseado, luego sirva con las rodajas de pastel de papa."], "url": "www_bbc_co_uk_food_recipes_haggis_kebabs_with_neeps_35842", "title": "Haggis kebabs con pastel de neeps y tatties", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 litro / 1¾ de caldo de verduras", "200ml / 7fl oz de vinagre de vino blanco", "200 g / 7 oz de azúcar en polvo", "1 hoja de laurel", "4 ramitas de tomillo", "6 granos de pimienta", "3-4 dientes de ajo, en rodajas", "1 nabo, en rodajas finas", "2 zanahorias, finamente picadas", "1 cebolla, finamente picada", "75g / 2½oz de mantequilla sin sal", "5 granos de pimienta", "1 bouquet garnis, incluyendo apio, tomillo, laurel y perejil", "2 dientes de ajo picados", "100ml / 3½fl oz de brandy", "200ml / 7fl oz Madeira", "200ml / 7fl oz puerto", "500ml / 18fl oz de vino tinto", "400ml / 14fl oz de carne de ternera", "100 ml / 3½ fl oz de caldo de pollo", "½ piel de cerdo", "mantequilla, para engrasar", "1 haggis entero (cocido)", "1 patata grande, cortada finamente en una mandolina", "4 cucharaditas de mantequilla clarificada", "sal al gusto"], "method": ["Para los neeps, hierva todos los ingredientes, excepto el nabo, en una sartén. Retirar del fuego, agregar el nabo y dejar en infusión durante 2-3 horas para que tome los sabores agridulces del líquido decapante.", "Para la piel de cerdo, precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "En una sartén de fondo grueso, freír las zanahorias y la cebolla suavemente en la mantequilla durante 4-5 minutos. Agregue los granos de pimienta, bouquet garni y ajo y fría por otros 1-2 minutos. Agregue el brandy, Madeira, el puerto y el vino tinto. Llevar a ebullición y cocinar hasta que el volumen del líquido se haya reducido a la mitad.", "Agregue los caldos de ternera y pollo y deje que hierva. Agregue la piel de cerdo, cubra la superficie con un círculo de papel para hornear y cueza en el horno por 3-4 horas, agregando más caldo de pollo si comienza a secarse.", "Una vez cocido, retire cuidadosamente la piel de cerdo y córtela en pedazos de 13x8cm / 5x3 in. Reserve el licor de cocina. Unte con mantequilla un trozo grande de papel de aluminio y coloque los pedazos de piel uno al lado del otro en una línea, asegurándose de que se superpongan. Coloque los haggis encima, enrolle en forma de salchicha (para que los haggis estén envueltos en piel de cerdo) y envuélvalos en papel de aluminio. Coloque en un vaporizador y cocine por 15 minutos.", "Para las patatas crujientes, mezcle las rodajas de patata con la mantequilla clarificada y la sal en una sartén antiadherente. Incline las rebanadas para hacer 4 círculos de aproximadamente 5 cm de ancho, cocine a fuego lento hasta que estén crujientes y déjelos aparte.", "Una vez cocido al vapor, corte los haggis en porciones de 5 cm / 2 pulgadas y colóquelos en platos para servir. Cubra con los nee en escabeche y coloque la patata crujiente al costado. Vierta sobre el licor de cocina de cerdo reservado y sirva."], "url": "www_bbc_co_uk_food_recipes_haggis_pickled_neeps_and_98546", "title": "Haggis, neeps en escabeche y tatties", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de mantequilla sin sal, suavizada", "½ cucharadita de semillas de comino", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "1 cebolla pequeña, finamente picada", "250-300 g / 9-10½ oz de haggis que contienen urogallo, faisán y pato (como Macs entre haggis de 3 aves), sin piel, contenido triturado", "500ml / 18fl oz de reserva o agua", "100 ml / 3½ fl oz de crema individual", "½ cucharada de cilantro recién picado (hojas y tallos)", "sal y pimienta", "1 cucharada de aceite o mantequilla, para freír", "Jengibre fresco de raíz de 5cm / 2in, pelado y finamente picado", "2-3 dientes de ajo, finamente picados", "2-3 chiles verdes (tipo de dedos delgados), finamente picados", "1 cebolla mediana, finamente picada", "Haggis tradicionales de 250-300 g / 9-10½ oz, sin piel y contenidos triturados", "1 cucharadita de semillas de cilantro, tostadas y trituradas en un mortero hasta que estén finas pero no en polvo", "1 cucharada de cilantro recién picado", "2 cucharadas de menta recién picada", "2-3 huevos de gallinas camperas, batidos para lavar huevos", "200-250g / 7-9oz pan rallado blanco seco (o sémola)", "Harina normal de 100 g / 3½ oz", "5-6 cucharadas de ketchup de tomate", "1-2 chiles verdes, picados", "pocos batidos Tabasco, al gusto", "1 cucharadita de mostaza inglesa", "400-500 g / 14oz-1lb 2 oz de patatas harinas, peladas y cortadas en rodajas gruesas", "½ cucharadita de semillas de comino, finamente trituradas", "1 chile verde fresco, finamente picado", "pellizcar el polvo de mango seco (opcional)", "2-4 huevos enteros de gallinas camperas (1 por persona)", "rollos crujientes o tostadas", "hojas de ensalada"], "method": ["Para la sopa, derrita la mantequilla en una cacerola. Cuando haga espuma, agregue las semillas de comino y después de 30-40 segundos agregue el jengibre y la cebolla. Freír suavemente durante 1-2 minutos, o hasta que la cebolla esté suave y translúcida. Agregue los haggis y fría por 3-4 minutos. Verter en el caldo, llevar a ebullición y hervir a fuego lento durante 5-6 minutos. Luego retírelo del fuego.", "Purifique el contenido hasta que esté muy suave usando una licuadora (si usa una batidora, tenga cuidado de evitar las salpicaduras del líquido caliente). Agregue la crema y continúe mezclando. Regrese la sopa a la sartén y cocine a fuego lento. Si la sopa es demasiado espesa para su gusto, diluya con un poco de caldo o agua. Condimentar con sal y pimienta.", "Para los haggis y las tortas de papa, caliente una cucharada de aceite o mantequilla en una sartén. Cuando esté caliente, agregue el jengibre, el ajo y los chiles verdes. Fríe suavemente hasta que el ajo comience a colorear ligeramente. Agregue la cebolla y fríela suavemente hasta que esté suave y translúcida. Agregue el haggis triturado y fríalo suavemente durante 3-4 minutos. Condimentar con sal y pimienta.", "A continuación, agregue las semillas de cilantro, cilantro fresco y menta fresca. Dejar de lado para enfriar por completo.", "Para el ketchup de tomate, mezcle todos los ingredientes, luego pruebe y ajuste el Tabasco para que se adapte a su paladar. Coloque en un tazón pequeño para servir. (Si prefiere, también puede mezclar algo de mayonesa en esto para obtener una salsa más cremosa).", "Para las papas trituradas, ponga las papas en suficiente agua salada hirviendo para cubrir las papas por lo menos una pulgada de agua. Hierva hasta que las rebanadas estén tiernas. Escurra y devuelva las papas a la sartén. Sécalos a fuego lento, usando una espátula para remover y asegúrate de que no se peguen al fondo. Retirar del fuego y mezclarlos (o pasar a través de un ricer si tiene uno).", "Extienda las papas en una bandeja y déjelas enfriar. Cuando se enfríe, mezcle el comino, el chile, la sal y la pimienta triturados. También puede agregar polvo de mango seco si tiene alguno.", "Para terminar los haggis y las tortas de papa, ponga el huevo en un tazón poco profundo y el pan rallado y la harina en platos separados. Divida las papas trituradas en porciones iguales (idealmente 6) y divida la mezcla de haggis de manera similar.", "Aplane cada porción de papa en la palma de su mano a aproximadamente 1cm / ½ pulgada de grosor y coloque la mezcla de haggis en el centro de la misma. Doble la patata para cubrir los haggis de manera uniforme y luego aplánelos para formar una torta gruesa de aproximadamente 2.5 cm / 1 pulgada de grosor. Dale forma suavemente hasta que no tengas bordes rotos y no se filtre ningún relleno. Rocíe un poco de harina en los pasteles de papa para ayudarlo a suavizar la superficie.", "Enrolle los pasteles de patata en la cantidad justa de harina para cubrir, elimine el exceso de polvo. Sumérgete en el huevo batido para cubrirlo y cúbrelo con pan rallado.", "Precaliente el horno a 100C / 80C Fan / Gas ¼.", "Calienta 1-2 pulgadas de aceite en una sartén profunda o cacerola. Cuando esté caliente, freír los pasteles de patata hasta que estén dorados por todos lados. Transfiéralos a una bandeja para hornear forrada con papel de cocina (para absorber el exceso de aceite) y colócalos en el horno caliente. Caliente las placas para servir en el horno también.", "Freír los huevos en la misma sartén (puede que tenga que quitar un poco del aceite). Deje que el blanco se arrugue un poco, pero asegúrese de que la yema permanezca blanda.", "Para servir, recaliente la sopa, agregue el cilantro picado y colóquelo en tazones. Pon una cucharada de ketchup con especias en cada pastel de papa. Cubra con un huevo frito y sirva con un rollo crujiente caliente o pan tostado, algunas hojas de ensalada y la sopa."], "url": "www_bbc_co_uk_food_recipes_haggis_two_ways_54636", "title": "Haggis de dos maneras", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Sirve 2-4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz haggis", "500g / 1lb 2oz de patatas harinas, como Maris Piper o King Edward, peladas, picadas", "500g / 1lb 2oz colinabo (nabo amarillo), pelado, picado", "50g / 2oz de mantequilla", "75ml / 2¾ fl oz crema doble", "sal marina y pimienta blanca recién molida", "1 cucharada de cebolletas frescas picadas", "Crema doble 500ml / 17fl oz", "2 cucharaditas de mostaza integral", "1 cucharada de mostaza Dijon", "2 cucharaditas de whisky", "sal marina y pimienta blanca recién molida", "1 cucharada de cebolletas frescas picadas", "½ limón, solo jugo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Envuelva los haggis con fuerza en papel de aluminio y colóquelos en una bandeja para hornear. Hornee en el horno durante 45 minutos a una hora, o hasta que estén cocidos.", "Mientras tanto, para el clapshot, hierva las papas y la nata en cazos separados de agua con sal durante 15-18 minutos, o hasta que estén tiernas. Escurrir bien. Agregue el colinabo drenado a las papas escurridas y machaque bien. Agregue la mantequilla y la crema y revuelva hasta que esté suave y bien combinado. Sazonar, al gusto, con sal y pimienta blanca recién molida. Agregue la cucharada de cebollín. Apartar y mantener caliente.", "Para la salsa de whisky, caliente la crema doble en una sartén a fuego medio. Agregue la mostaza integral, la mostaza Dijon y el whisky y revuelva para combinar. Aumente el fuego hasta que la mezcla esté hirviendo a fuego lento y continúe cocinando durante 1-2 minutos.", "Retire la sartén del fuego y condimente, al gusto, con sal y pimienta blanca recién molida. Agregue la cucharada de cebollín, luego mezcle el jugo de limón.", "Para servir, divida la captura de pantalla por igual entre cuatro platos para servir. Coloque una cucharada de haggis al vapor a cada lado. Cuchara sobre la salsa de whisky caliente."], "url": "www_bbc_co_uk_food_recipes_haggisclapshotandwhi_92144", "title": "Haggis, clapshot y salsa de whisky", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/haggisclapshotandwhi_92144_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite", "½ puerro, cortado en cubitos", "½ patata, pelada y cortada en cubitos", "¼ de nabo, pelado y cortado en cubitos", "¾pinturas de pollo picado", "sal y pimienta negra recién molida", "85g-110g / 3-4 oz de haggis"], "method": ["Caliente el aceite en una sartén y saltee el puerro, la patata y el colinabo durante unos minutos para que se ablanden. Sazonar con sal y pimienta negra recién molida.", "Vierte el caldo de pollo y llévalo a ebullición. Reduzca el fuego, agregue los haggis y cocine a fuego lento durante 10-12 minutos.", "Retire del fuego y la cuchara en un tazón de sopa para servir."], "url": "www_bbc_co_uk_food_recipes_haggissoup_82603", "title": "Sopa Haggis", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ haggis, cocido", "½ colinabo, pelado y cortado en cubitos", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "½ repuestos de carne de vacuno", "salpicaduras de vino tinto", "botón de mantequilla", "sal y pimienta negra recién molida"], "method": ["Cocine los haggis en el microondas de acuerdo con las instrucciones del paquete.", "Ponga a hervir una olla de agua y cocine el colinabo durante 8-10 minutos, hasta que se ablande. Escurrir y macerar hasta que estén suaves. Pase a través de un tamiz hasta que quede suave. Sazonar con sal y pimienta negra recién molida.", "Cortar los haggis cocidos y colocarlos en el anillo de un chef colocado en un plato. Poner el puré en la parte superior y sazonar con sal y pimienta negra recién molida. Cepille la parte superior con el huevo batido y glasee la parte superior con un soplete. Retire el anillo.", "Para hacer la salsa, reduzca el caldo de carne y el vino tinto para espesar. Agregue la mantequilla y sazone con sal y pimienta negra recién molida. Cocine a fuego lento durante unos minutos más para espesar aún más.", "Rocíe la salsa sobre los haggis para servir."], "url": "www_bbc_co_uk_food_recipes_haggistattiesandneep_82604", "title": "Haggis y neeps", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo entero de 1.6kg / 3½lb", "15g / ½ oz de mantequilla", "2 cucharaditas de pimienta de cayena", "350ml / 12fl oz de caldo de pollo", "4 cucharadas de ron", "50g / 1¾oz de mantequilla", "½ cebolla, finamente picada", "2 cebolletas, cortadas, picadas", "2 dientes de ajo, finamente picados", "pizca de nuez moscada recién rallada", "3 rebanadas de pan blanco, costras eliminadas, hechas en pan rallado", "4 ramitas de tomillo fresco, solo hojas", "1 lima, ralladura y jugo", "2 cucharadas de ron", "2 cucharaditas de azúcar moreno claro o demerara", "15g / ½ oz de mantequilla", "2 plátanos muy maduros, pelados y en rodajas", "2 tomates de ciruela maduros, cortados en cuartos", "sal y pimienta negra recién molida", "550ml / 1 pinta de agua fría", "Carne de calabaza 400g / 14oz, picada", "3 ramitas de tomillo fresco", "1 cucharadita de sal", "450 g / 1 libra de arroz basmati, enjuagado y escurrido dos veces para eliminar el exceso de almidón", "15g / ½ oz de mantequilla"], "method": ["Suavemente extienda la piel alrededor del cuello y la pechuga del pollo alejándola de la carne con los dedos, llegando lo más abajo posible de las piernas. Dejar de lado.", "Para el relleno del pan, caliente la mantequilla en una sartén a fuego medio. Agregue la cebolla y fría por 2-3 minutos, o hasta que se ablanden.", "Agregue las cebollas tiernas y el ajo y cocine durante 2-3 minutos más, o hasta que se ablanden.", "Agregue la nuez moscada y las migas de pan y continúe freír hasta que las migas estén crujientes y doradas.", "Agregue las hojas de tomillo, la ralladura de limón y el jugo, el ron y el azúcar y revuelva bien hasta que se combinen. Cuando los ingredientes se hayan calentado y el azúcar se haya disuelto, retire la sartén del fuego y déjela a un lado.", "Cuando la mezcla de relleno de pan esté lo suficientemente fría como para manipularla, empuje los puñados pequeños debajo de la piel suelta del pollo, hasta que toda la mezcla de relleno de pan se haya agotado. Meta cualquier piel suelta del cuello en la cavidad del ave. Dejar de lado.", "Precalentar el horno a 190C / 375F / Gas 5.", "Mientras tanto, para el relleno de tomate y plátano, derrita la mantequilla en una sartén separada a fuego medio. Agregue el plátano y fría por 4-5 minutos, o hasta que estén tiernos.", "Agregue los tomates y continúe freír durante 4-5 minutos, o hasta que los tomates comiencen a descomponerse y la salsa se espese. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Rellena la cavidad del pollo con el relleno de tomate y plátano. (Alternativamente, cocine el relleno de tomate y plátano en una bandeja pequeña para asar durante 25-30 minutos mientras el pollo está cocinando).", "Para el pollo asado, unte la mantequilla sobre la piel del pollo relleno y espolvoree sobre la pimienta de cayena. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Coloque el pollo en una lata grande para asar, luego transfiéralo al horno y tápelo durante 1½-1¾ hora, o hasta que los jugos salgan limpios cuando se inserte un pincho en el pollo donde el muslo se encuentra con el cuerpo.", "Mientras tanto, para el arroz de calabaza, lleve el agua, la calabaza, dos ramitas de tomillo y sal a ebullición en una sartén grande y cubierta, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y hierva a fuego lento durante 8-10 minutos o hasta que la calabaza es tierno.", "Retire y deseche las ramitas de tomillo, luego mezcle la calabaza y el líquido de cocción con un machacador de patata, hasta que la calabaza se descompone. (NB: la mezcla no tiene que ser macerada hasta que esté suave).", "Agregue el arroz a la sartén con la mezcla de calabaza y revuelva. El líquido debe cubrir el arroz por 2-2½ cm / 1-1¼in, así que agregue más agua según sea necesario.", "Agregue la mantequilla y revuelva hasta que se derrita, luego cubra la olla con la tapa y vuelva a hervir la mezcla. Cuando la mezcla hierva, inmediatamente reduzca el fuego a fuego lento. Cubra y cocine a fuego lento durante 18-20 minutos, sin quitar la tapa, hasta que la parte inferior del arroz se haya dorado un poco y todo el arroz esté tierno.", "Cuando el arroz esté cocido, agregue la ramita restante de tomillo, luego apague el fuego y deje la sartén con el calor residual por otros 3-4 minutos.", "Cuando el pollo se haya cocinado, transfiéralo a un plato caliente y cúbralo con papel de aluminio.", "Para la salsa, agregue el caldo de pollo a los jugos que se acumularon en la bandeja de tostado y deje que hierva, raspando cualquier trozo dorado del fondo de la bandeja con una cuchara de madera. Cocine a fuego lento la salsa hasta que se espese, luego tamice, reservando el líquido.", "Caliente el ron en una sartén a fuego alto, luego retírelo del fuego y enciéndalo con una cerilla. Permita que las llamas se enciendan y luego desaparezcan. (NB: mantenga los objetos inflamables lejos de la llama.) Vierta el ron sobre el pollo asado.", "Para servir, esculpe el pollo asado y divídalo entre seis platos para servir. Coloque una porción del relleno de tomate y plátano encima de cada porción. Coloque el arroz de calabaza al costado. Rocíe sobre la salsa."], "url": "www_bbc_co_uk_food_recipes_haitianroastchickenw_91735", "title": "Pollo asado haitiano con dos rellenos servidos con arroz de calabaza", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva extra virgen", "1 chalote, finamente picado", "1 zanahoria, finamente picada", "1 hoja de laurel", "150g / 5½oz de lentejas verdes pequeñas secas", "500ml / 18fl oz de caldo de pollo, frío", "sal marina y pimienta negra recién molida", "40 g / 1½ oz de espinaca baby", "50g/1¾oz jamón iberico, cut into1cm/½in cubes", "1 yema de huevo grande de gallinas camperas, a temperatura ambiente", "1 cucharada de jugo de limón", "½ cucharadita de mostaza Dijon", "copos de sal marina", "75ml / 2½fl oz de aceite de oliva virgen extra", "75ml / 2½ fl oz de aceite de girasol", "2 cucharadas de perejil picado", "aceite de oliva, para freír", "4 porciones de merluza de x 170g / 6oz", "Harina normal de 100 g / 3½ oz, para recubrimiento", "2 huevos grandes de gallinas camperas, golpeados", "sal marina y pimienta negra recién molida"], "method": ["Para hacer las lentejas salteadas, caliente el aceite en una cacerola y fría la chalota, la zanahoria y el laurel hasta que comiencen a dorarse. Agregue las lentejas y el caldo de pollo frío, revuelva bien todo y deje cocer durante 20-25 minutos o hasta que el caldo se haya reducido en volumen. Retire la hoja de laurel y sazone con sal y pimienta. Mantener caliente", "Para la mayonesa, ponga la yema de huevo, el jugo de limón, la mostaza y la sal del mar en un tazón y mezcle ligeramente. Poco a poco mezcle los aceites, poco a poco, hasta que haya producido una mayonesa suave y espesa. Mezcle el perejil.", "Para los peces, vierta 1 cm / ½ pulgada de aceite de oliva en una sartén antiadherente grande, colocada a fuego medio, o también puede usar una freidora de grasa calentada a 170 ° C / 340 ° F (Precaución: el aceite caliente puede ser peligroso. No dejes desatendido).", "Cubra los pedazos de merluza en harina, elimine el exceso y luego cubra bien en el huevo batido. Coloque en el aceite caliente y fría durante aproximadamente cuatro minutos en cada sitio, dependiendo del grosor del pescado, hasta que se doren. Levante sobre papel de cocina y déjelo escurrir.", "Finalmente, agregue la espinaca a las lentejas y deje que se marchite por un minuto más o menos.", "Para servir, divide las lentejas entre las placas de servir. Coloque la merluza encima. Agregue una cucharada de mayonesa de limón encima del pescado, y finalmente algunas de las piezas de jamón."], "url": "www_bbc_co_uk_food_recipes_hake_a_la_romana_sauted_04453", "title": "Merluza a la romana, lentejas salteadas y mayonesa de jamón ibérico, limón y aceite de oliva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 tomate de ternera", "125g / 4½oz de camarones en macetas", "1 chalote, cortado en cubitos", "1 cucharada de cebollines frescos finamente picados", "1 cucharada de perejil de flatleaf fresco finamente picado", "Alcaparras 50g / 1¾oz, preferiblemente lilliput", "1 limón, zested y en rodajas finas", "berro, para adornar", "4-5 papas nuevas grandes, preferiblemente Chipre o Jersey Royals, lavadas, peladas y cortadas en cubitos", "Crema doble 50ml / 2fl oz", "50 g / 1¾oz de mantequilla sin sal", "pizca de nuez moscada recién rallada", "sal y pimienta blanca molida", "2 cucharadas de aceite vegetal", "4 x 150-200 g / 5½ oz-7 oz de filetes de lomo de merluza", "sal marina copos", "Pimiento de Espelette", "50 g / 1¾oz de mantequilla sin sal", "Espinaca de la hoja del bebé 200g / 7oz, lavada", "100g / 3½oz de hojas de ajo silvestre", "cabezas de flores de ajo, para adornar (opcional)"], "method": ["Corta una pequeña cruz en el fondo del tomate con un cuchillo pequeño y afilado y blanquea en una cacerola con agua hirviendo durante unos diez segundos, luego escurre y sumérgete en agua helada. Pele el tomate y deseche la piel.", "Corta el tomate pelado en cuartos y quita las semillas. Pat las piezas de tomate secas con una toalla de té limpia y corta en dados pequeños. Dejar de lado.", "Calentar una sartén a fuego medio y agregar los camarones en macetas, chalotes y tomate. Cocine por 5-7 minutos hasta que la mantequilla se haya derretido en una salsa. Agregue las hierbas y las alcaparras y manténgase caliente.", "Para las papas, hierva una olla con agua y cocine las papas durante 6-8 minutos, o hasta que estén tiernas,", "Escurra las papas y vuelva a colocarlas en la sartén para que se sequen al aire durante unos minutos. Poco a poco agregue la crema y la mantequilla y mezcle con una batidora de mano hasta que quede suave. Rallar en nuez moscada y sazonar. Cubra con papel impermeable y manténgalo caliente.", "Para la merluza, precaliente la parrilla a fuego medio-alto. Calentar el aceite vegetal en una sartén hasta el punto de ahumado, sazonar el lado de la piel de la merluza con sal marina y el lado de la carne con sal y pimienta de Espelette. Cocine con la piel hacia abajo en la sartén durante 1-2 minutos. Coloque la sartén debajo de la parrilla durante 2-3 minutos o hasta que el pescado esté ligeramente traslúcido.", "Agregue un poco de mantequilla a la sartén, voltee los filetes de pescado y hilvane con la mantequilla derretida.", "Caliente la mantequilla restante en una sartén a fuego alto. Agregue las espinacas y las hojas de ajo silvestre y cocine por 1 minuto.", "Sirva la merluza con la muselina pommes, los verdes marchitos y la salsa de camarones en la parte superior. Adorne con ralladura de limón, rodajas y perifollo y flores silvestres de ajo, si las usa."], "url": "www_bbc_co_uk_food_recipes_hake_with_pommes_91976", "title": "Merluza con mousseline pommes y una salsa de camarones, limón y alcaparras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite de oliva", "2 chalotes, finamente picados", "2 dientes de ajo, aplastados", "algunas pequeñas hojas sabias", "Setas de rebozuelo 300g / 10½oz, limpiadas", "100 ml / 3½ fl oz de pescado fresco", "4 x 175g / 6oz de filetes de merluza", "sal marina y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1 cebolla grande, finamente picada", "2 dientes de ajo, en rodajas finas", "2 pimientos rojos, sin semillas y en rodajas finas", "1 tsp pimentón (Spanish paprika)", "500g / 1lb 2 oz de papas harinosas, en rodajas", "750g / 1lb 10oz de acelga suiza, tallos picados y hojas trituradas", "750ml / 26fl oz pinta de verduras frescas", "sal marina y pimienta negra recién molida", "pan crujiente, para servir"], "method": ["Para el estofado de acelgas, caliente un poco de aceite en una cazuela a prueba de llamas y fría la cebolla durante 10 minutos hasta que se ablande. Agregue el ajo y fría por un minuto, luego agregue los pimientos y el pimentón y fría por unos minutos más.", "Agregue las papas y el caldo. Sazone generosamente con sal y pimienta y luego cocine a fuego lento. Cubra y cocine durante 20 minutos", "Mientras tanto, para la merluza, caliente un poco de aceite de oliva en una sartén grande y fría los chalotes durante 5-10 minutos hasta que estén realmente suaves. Agregue el ajo y la salvia y cocine durante 30 segundos, luego aumente el fuego y agregue los champiñones. Freír durante 4-5 minutos, luego agregar el caldo y cocinar a fuego lento durante un par de minutos. Sazonar con sal y pimienta y reservar.", "Calentar un poco de aceite en una sartén de base pesada a fuego medio. Agregue la merluza, con la piel hacia abajo y cocine durante 4-5 minutos, o hasta que esté casi cocida. Gire y cocine durante 30 segundos en el otro lado. Coloque la merluza cocida con la piel hacia arriba en la sartén que contiene los champiñones. Cocine por un minuto o dos más.", "Agregue la acelga al estofado durante los últimos minutos, luego sirva con la merluza y un montón de pan crujiente para limpiar los jugos."], "url": "www_bbc_co_uk_food_recipes_hake_with_chanterelles_25340", "title": "Merluza con rebozuelos y un guiso de acelgas suizas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Lanzas de espárragos blancos 8 (o 4 grandes), cortadas y escaldadas durante 5-8 minutos", "200 g / 7 oz de almejas frescas, fregadas con agua corriente fría y recogidas", "3 cucharadas de aceite de oliva", "3 dientes de ajo, finamente picados", "1 chalote pequeño, finamente picado", "1 cucharada de harina normal", "200ml / 7fl oz de vino blanco seco (idealmente Txakoli)", "150 ml / 5 fl oz de pescado fresco", "4 x 180g filetes de merluza", "Guisantes 200 g / 7 oz", "1 pequeño puñado de perejil de flautín, finamente picado", "pan crujiente, para servir", "sal marina y pimienta negra recién molida"], "method": ["Ponga a hervir una cacerola grande de agua salada y cocine los espárragos preparados por otros 4 a 6 minutos. Escurrir y apartar.", "Deseche las almejas con conchas rotas y las que se nieguen a cerrarse al tocarlas.", "Calentar el aceite en una sartén a fuego medio. Freír el ajo y la chalota durante 3-4 minutos, o hasta que estén suaves y ligeramente dorados. Agregue la harina y cocine por unos 2 minutos. Poco a poco agregue el vino y cocine durante 2 minutos, luego agregue el caldo. Cocine a fuego lento hasta que tenga una salsa suave como la seda.", "Sazone la merluza con sal y pimienta y agréguelos a la salsa. Cocine la merluza durante 4-5 minutos, luego agregue los guisantes y las almejas. Cubra y cocine por 2-3 minutos, o hasta que las almejas se abran. Deseche cualquier almeja que no se abra.", "Para finalizar, agregue los espárragos y el perejil, y cocine a fuego lento durante un minuto. Sazone al gusto con sal y pimienta. Sirva en tazones calientes con pan crujiente."], "url": "www_bbc_co_uk_food_recipes_hake_with_salsa_verde_15301", "title": "Merluza y almejas en salsa verde (merluza en salsa verde)", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "150g / 5¼oz de patatas nuevas cocidas", "4 cebolletas, picadas", "pizca de curry en polvo", "pizca de cúrcuma", "exprimir jugo de limón", "150ml / 5fl oz de crema doble", "puñado de hojas de perejil fresco, picado", "pizca de semillas de comino", "1 filete de merluza", "4 rebanadas de tocino", "Aceite para freír", "sal y pimienta negra recién molida"], "method": ["Para hacer las papas al curry, caliente el aceite en un sofrito o en una sartén grande. Freír las papas y cebollas de primavera durante unos minutos, para suavizar.", "Agregue el curry en polvo y la cúrcuma para cubrir. Agregue el jugo de limón a la sartén y luego vierta la crema.", "Agregue las semillas de perejil y comino y cocine a fuego lento durante 8-10 minutos, hasta que espese.", "Para el pescado, envuelva las rebanadas de panceta alrededor del filete de merluza. Caliente el aceite en una sartén antiadherente y cocine el pescado durante 2-3 minutos en cada lado, o hasta que la panceta esté dorada.", "Para servir, transfiera el pescado envuelto a un plato de servir y sirva las papas al curry al costado."], "url": "www_bbc_co_uk_food_recipes_hakewrappedinpancett_76448", "title": "Merluza envuelta en panceta con papas al curry", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 naranja media", "3-4 fresas frescas, cascadas, picadas"], "method": ["Corta la parte superior de la naranja alrededor de un tercio del camino hacia abajo, con un cuchillo afilado, y reserva. Suspenda las piezas de color naranja sobre un recipiente para mezclar y saque la mayor cantidad de carne posible, permitiendo que los jugos entren en el tazón. Reserve el jugo y la piel de naranja.", "Coloque las fresas picadas en la piel de naranja. Vierta sobre el zumo de naranja reservado, agregando un poco de agua fría para recargar según sea necesario.", "Coloque la parte superior de la naranja de nuevo en la parte inferior. Con cuidado, transfiera la naranja a un recipiente tapable y congelable (sosteniéndola según sea necesario con papel de aluminio arrugado). Congele durante al menos dos horas, o hasta que el relleno se haya congelado.", "Para servir, quite la parte superior de la naranja de la naranja y comer el contenido con una cucharadita."], "url": "www_bbc_co_uk_food_recipes_half-time_ices_15023", "title": "Helados de medio tiempo", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 120}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["sal de roca, para cubrir la base de una bandeja de horno", "3 papas grandes Maris Piper", "100 g / 3½ oz recogido cangrejo, carne blanca y marrón", "2 lima, ralladura solamente", "Harina normal de 100 g / 3½ oz", "pan rallado listo para usar", "2 huevos de gallinas camperas, golpeados", "aceite vegetal, para freír en grasa", "6 zanahorias", "Setas de castaña de 200g / 7oz, cortadas en cuartos", "botón de mantequilla", "300 g / 10½ oz de espinaca baby", "1 litro / 1¾ pinta de pescado fresco", "250g / 9oz de mantequilla", "50ml / 2fl oz de vermut", "sal y pimienta negra recién molida", "guión de aceite vegetal", "6 piezas de fletán, piel en"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Cubra la base de una bandeja para hornear con sal de roca, ponga las papas encima y hornee por una hora.", "Una vez cocinado, deje que se enfríe un poco antes de partir las pieles y raspar la patata suave.", "Para las verduras, corte las zanahorias en rondas grandes, colóquelas en una sartén con agua fría con sal, deje hervir y deje hervir durante 10 minutos. Las zanahorias deben estar al dente (con un ligero mordisco). Escurrir bien y refrescar en un recipiente con agua helada. Drenar de nuevo una vez genial.", "Para terminar las croquetas de cangrejo y lima, mezcle el cangrejo, la lima y las papas. Sazonar y formar en forma de barril con las manos, colocar en un plato y poner en la nevera para enfriar y reafirmar.", "Coloque la harina y las migas de pan en platos separados poco profundos, y prepare un cuenco de huevo batido para el lavado de huevos. Una vez frío, sumerja cada croqueta en la harina preparada, huevo batido y luego migajas de pan hasta que esté completamente cubierto y reservado.", "Para hacer la salsa, caliente el caldo de pescado en una sartén y bata gradualmente la mantequilla hasta que quede espeso y brillante. Agregue el vermut y sazone con sal y pimienta negra recién molida.", "Para las verduras, fría los champiñones con un poco de mantequilla y sal y pimienta durante unos cinco minutos, o hasta que estén cocidos.", "Mezcle la espinaca del bebé con los champiñones y empiece a marchitarse.", "Para el pescado, caliente una pizca de aceite vegetal y fría el pescado en una sartén caliente, con la piel hacia abajo. Coloque en el horno para cocinar durante 5-6 minutos, o hasta que el pescado esté recién cocinado.", "Calienta un poco de mantequilla en una sartén y freír las zanahorias semicocidas para que comiencen a ablandarse alrededor de los bordes.", "Saque el pescado del horno, cúbralo con papel de aluminio y déjelo reposar durante cinco minutos.", "Caliente el aceite en una freidora de grasa profunda o en una cacerola de base pesada a 190 ° C / 375 ° F. Con cuidado, freír las croquetas durante unos cinco minutos o hasta que estén doradas. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido.) Retire las croquetas de la freidora o sartén con una espumadera y colóquelas en un plato forrado con papel de cocina.", "Para servir, coloque las espinacas y los champiñones en cada una de las seis placas y el pescado en la parte superior.", "Coloque las zanahorias alrededor del pescado y cubra con una croqueta. Sirva con la salsa en el lado."], "url": "www_bbc_co_uk_food_recipes_halibut_with_crab_and_27912", "title": "Fletán con croquetas de cangrejo y lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 18fl oz de caldo de pollo", "125g / 4½oz de mantequilla sin sal", "400 g / 14 oz de setas silvestres (preferiblemente una mezcla de colmenillas, ceps y trompetas negras)", "100ml / 3½ fl oz crema doble", "Brócoli de brotación púrpura de 150g / 5oz, cortado en pequeños floretes", "1½ racimos de zanahorias heredadas del bebé, en una combinación de colores", "sal y pimienta negra recién molida", "4 cucharadas de aceite de oliva", "4 filetes de fletán, con piel y hueso, sazonados con sal y pimienta", "100g / 3½oz de mantequilla sin sal", "8 ramitas de perifollo fresco, para adornar", "aceite vegetal, para freír", "1 papa grande, pelada", "1 yema de huevo", "12 huevos de codorniz hervidos"], "method": ["Coloque el caldo de pollo en una cacerola a fuego medio-alto. Cocine hasta que el volumen de líquido se haya reducido en un tercio.", "Para el halibut, caliente una sartén grande y agregue el aceite. Cuando esté caliente, agregue el pescado con la piel hacia abajo y cocine por 2-3 minutos. Voltee el pescado y cocine durante 2-3 minutos más.", "Mientras tanto, para los champiñones, caliente una sartén grande y agregue 50 g / 1¾ oz de la mantequilla. Cuando la mantequilla esté espumosa, agregue los champiñones y cocine durante 2 minutos. Agregue la crema y reduzca el caldo, luego sazone con sal y pimienta.", "Caliente una olla grande de agua hirviendo y blanquee el brócoli y las zanahorias. Cuando esté tierno, escurra y refresque las verduras en agua helada.", "Caliente una sartén grande y agregue la mantequilla restante, una vez caliente agregue el brócoli y las zanahorias y cocine por 1-2 minutos.", "Precaliente una freidora a 180 ° C. Alternativamente, caliente el aceite vegetal en un molde de fondo profundo y profundo, hasta que el pan rallado se ponga dorado cuando lo agregue a la sartén. (PRECAUCIÓN: el aceite caliente es peligroso. No lo deje desatendido).", "Para el halibut, agregue la mantequilla a la sartén e hilvane el pescado. Reserve para descansar antes de servir.", "Para los huevos de codorniz, ponga la papa en el espiralizador y gírelo para crear largas hebras de papa. Coloque en un tazón con la yema de huevo y mezcle para cubrir la papa. Envuelva la papa spiralised alrededor de los huevos de codorniz. Coloque en la freidora durante 1-2 minutos y escurra sobre papel de cocina.", "Coloque el pescado en el centro de los platos para servir y coloque las verduras, los champiñones y los huevos de codorniz alrededor del pescado. Adorne con unas ramitas de perifollo y sirva."], "url": "www_bbc_co_uk_food_recipes_halibut_with_sauted_32388", "title": "Fletán con champiñones salteados y huevos de codorniz fritos envueltos en patatas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 x 250g / 9oz filetes de fletán sin espinas", "500g / 1lb de mantequilla sin sal 2 oz", "250 g / 9 oz de samphire", "500g / 1lb 2oz de patatas nuevas, peladas y cortadas a la mitad", "2 ramitas de lavanda", "12 dientes de ajo mojados, pelados", "aceite de oliva", "botón de mantequilla", "sal marina y pimienta negra recién molida", "200g / 7oz de mantequilla salada", "1 chalote grande, pelado, finamente cortado", "1 zanahoria mediana, pelada, finamente cortada", "6 botones de champiñones, en rodajas", "200ml / 7fl oz de champán", "300 ml / 10 fl oz de pescado blanco", "300 ml / 10 fl oz doble crema", "1 cucharada de caviar Sevruga", "sal marina y pimienta negra recién molida"], "method": ["Para el fletán, calentar una sartén hasta que esté caliente, agregar la mantequilla y calentar hasta que se vuelva marrón. Cuando el beurre noisette llegue a los 50 ° C, baje el halibut a la mantequilla y cocine durante 5 minutos.", "Precaliente la barbacoa. Engrase una doble capa de papel de cocina y coloque las papas en el centro de la lámina con la lavanda y el ajo. Sazonar con sal y pimienta y sellar las papas en un paquete al juntar los bordes largos y doblar los bordes para crear un sello sólido. Cocine en la barbacoa durante 30-40 minutos.", "Blanquee la salmonete en agua hirviendo durante 30 segundos. Escurrir y remover un poco de mantequilla.", "Derrita un pomo de mantequilla en una olla grande. Agregue la chalota y la zanahoria y cocine durante 1-2 minutos. Agregue los champiñones y cocine por otros 2 minutos.", "Agregue el champán y reduzca a la mitad. Agregue el caldo y la burbuja hasta que el volumen se haya reducido a la mitad. Agregue la crema y reduzca nuevamente. Revuelva a través del caviar y revise el condimento", "Sirva el halibut con la samphire y las patatas asadas a la barbacoa con la salsa de champán y caviar."], "url": "www_bbc_co_uk_food_recipes_halibut_with_samphire_26810", "title": "Halibut con samphire y patatas nuevas a la brasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Vinagre de vino de arroz de 200ml / 7fl oz", "50ml / 2fl oz de salsa de pescado", "50g / 1¾oz de azúcar de palma", "2 cucharaditas de chile coreano en polvo", "50ml / 2fl oz de jugo de limón", "1 col de hoja china, núcleo removido, hojas en rodajas finas", "2-4 chiles rojos (al gusto), finamente cortados en cubitos", "2 zanahorias, en rodajas finas con un pelador de verduras", "Jengibre fresco de raíz 5cm / 2in, pelado, finamente picado", "2 dientes de ajo, finamente picados", "15 g / ½ oz de algas secas, rehidratadas en agua, escurridas y finamente picadas", "4 vieiras, preferiblemente dobladas a mano, limpiadas, cortadas de huevas", "1 lima, ralladura y jugo", "pizca de sal", "2 cucharadas de aceite de colza", "25g / 1oz de mantequilla", "4 filetes de fletán x 200 g / 7 oz, huesos de alfiler eliminados", "2 cucharadas de berro de coriandro, para adornar"], "method": ["Coloque el vinagre de vino de arroz, la salsa de pescado, el azúcar de palma y el chile coreano en polvo en una cacerola pequeña y deje que la mezcla hierva a fuego lento, revolviendo hasta que el azúcar se disuelva. Revuelva a través del jugo de limón.", "Mezcle el repollo, los chiles, las zanahorias, el jengibre, el ajo y las algas marinas en un tazón grande. Transfiera a un recipiente hermético.", "Vierta la mezcla de limón caliente sobre las verduras, selle el recipiente, luego agite para cubrir las verduras en el adobo. Deje el recipiente a un lado para que se enfríe, luego déjelo durante 1 semana a temperatura ambiente para fermentar.", "Cuando el kimchi haya fermentado, corte las vieiras muy finas y colóquelas en un plato para servir. Espolvorea la ralladura de lima y luego exprime el jugo de lima. Sazonar, al gusto, con sal.", "Caliente el aceite de colza en una sartén a fuego medio a alto. Agregue los filetes de halibut, con la cara de presentación hacia abajo, y fría durante 1-2 minutos, luego agregue la mantequilla y fría por un minuto más. Voltee y fríe el fletán en el otro lado por otros 2 minutos, hilvanando continuamente con los jugos de la sartén.", "Para servir, cuchara una porción del kimchi en cada plato. Cubra con algunas de las vieiras en rodajas, luego coloque un filete de halibut en la parte superior. Adorne con un poco de berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_halibut_with_spicy_37680", "title": "Halibut con kimchi picante", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ limón, cortado en rodajas finas", "Fletán 100g / 3½oz", "sal y pimienta negra recién molida", "75g / 2¾oz de espinaca", "50ml / 2fl oz de vino blanco"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Corta un círculo de 30 cm en papel de hornear y el otro en papel de aluminio. Coloque el círculo de papel para hornear encima de la lámina y dóblelo por la mitad (para que el papel de hornear quede en el medio).", "Abra el papel de nuevo y coloque las rodajas de limón en la mitad de la mitad.", "Coloque el fletán en la parte superior de las rodajas de limón y sazone con sal y pimienta negra recién molida.", "Coloque la espinaca encima y vierta sobre el vino.", "Dobla la mitad transparente del papel y envuelve el papel con los ingredientes y sella los bordes frunciendo el papel.", "Coloque en una bandeja para hornear y cocine durante 12-14 minutos en el horno, hasta que el halibut esté cocido.", "Para servir, coloque el paquete en un plato y barra la parte superior abierta con un cuchillo para que escape el aroma."], "url": "www_bbc_co_uk_food_recipes_halibutandspinachenp_83506", "title": "Halibut y espinaca en papillote", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 tomates cherry", "Fletán 100 g / 3½ oz, cortado en cubos", "1 cucharada de aceite de oliva, más extraño para lloviznar", "4-5 hojas de albahaca picadas para servir", "1 cucharadita de vinagre balsámico, para servir"], "method": ["Pase los cubos de halibut y los tomates cherry por los pinchos de bambú.", "Caliente una sartén a fuego alto. Rocíe los pinchos de fletán con aceite de oliva y la plancha durante 3-5 minutos, o hasta que estén cocidos.", "Transfiera los pinchos a un plato para servir, esparza sobre la albahaca picada y rocíe con el vinagre."], "url": "www_bbc_co_uk_food_recipes_halibutandtomatoskew_84436", "title": "Pinchos de fletán y tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1-2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Fletán 50g / 1¾oz, en rodajas finas", "½ lima, solo jugo", "½ limón, solo jugo", "sal y pimienta negra recién molida", "½ lima, cortada en cuñas para adornar", "hoja fresca del perejil del flatleaf, para adornar"], "method": ["Coloque las rodajas de halibut en el centro de un plato y vierta sobre el jugo de limón y lima. Sazonar bien con sal y pimienta negra recién molida, luego dejar que se \"cure\" durante 15-20 minutos.", "Para servir, adorne el plato con trozos de lima y la hoja fresca de perejil."], "url": "www_bbc_co_uk_food_recipes_halibutceviche_83505", "title": "Halibut ceviche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]