[{"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "500ml / 18fl oz de caldo de pollo", "100g / 3½oz de arroz basmati", "½ zanahoria, pelada y picada", "½ calabacín, picado", "1 cucharada de aceite de oliva", "1 muslo de pollo", "sal y pimienta negra recién molida", "1 cucharada de cebolletas frescas picadas"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el caldo, caliente el aceite en una sartén a fuego medio y fría la cebolla durante 3-4 minutos. Agregue los ingredientes restantes y lleve la mezcla a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 10-12 minutos o hasta que el arroz esté tierno.", "Mientras tanto, para el pollo, caliente el aceite en una sartén a prueba de horno a fuego medio. Sazonar el pollo con sal y pimienta negra recién molida y freír durante 2-3 minutos, hasta que se dore por todos lados. Transfiera al horno y tueste por 12-15 minutos o hasta que el pollo esté bien cocido. (El pollo se cuece cuando los jugos se vuelven transparentes cuando se perfora en la parte más gruesa con un pincho).", "Para servir, corta la carne del muslo de pollo. Vierta el caldo en un recipiente y cubra con las rebanadas de muslo de pollo. Adornar con las cebolletas picadas .."], "url": "www_bbc_co_uk_food_recipes_chickenbroth_92566", "title": "Caldo de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina simple de 75g / 2¾oz", "sal y pimienta negra recién molida", "1 x 1,5 kg / 3 lb 5 oz de pollo, unidas en 8 piezas", "2 cucharadas de aceite vegetal", "2 cebollas en rodajas", "2 dientes de ajo picados", "30g / 1oz de puré de tomate", "800 g / 1 libra de tomates maduros de 12 oz, picados", "2 ramitas de romero fresco", "1 hoja de laurel", "100ml / 3½fl oz de vino blanco", "150ml / 5fl oz de caldo de pollo", "1 cucharada de vinagre de vino tinto", "puñado de hojas frescas de perejil", "papas asadas"], "method": ["Sazone la harina con sal y pimienta negra recién molida, luego drague las piezas de pollo en ella.", "Calentar el aceite en una cacerola a fuego medio, luego freír el pollo durante 2-3 minutos en cada lado, hasta que se dore por todos lados. Eliminar y reservar.", "En la misma cazuela, freír la cebolla y el ajo durante 8-10 minutos a fuego lento, hasta que se ablanden.", "Agregue el puré de tomate y cocine durante cinco minutos.", "Agregue los tomates, el romero, la hoja de laurel, el vino, el caldo y el vinagre y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 20 minutos.", "Regrese las piezas de pollo a la cacerola y cubra con una tapa. Cocine a fuego lento durante 30-40 minutos, o hasta que el pollo esté tierno.", "Para servir, quite la tapa y espolvoree con hojas de perejil. Cuchara en platos y servir con patatas asadas."], "url": "www_bbc_co_uk_food_recipes_chickencacciatora_89886", "title": "Cacciadora de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 rebanadas de mota (o jamón)", "2 pechugas de pollo deshuesadas, hueso y piel eliminados", "botón de mantequilla", "2 rebanadas gruesas de pan blanco, en cubos", "2 cos lechuga", "2 dientes de ajo", "75ml / 3fl oz de vino blanco", "2 huevos, solo yemas", "1 filete de anchoa", "Queso parmesano 75 g / 3 oz, rallado", "150ml / 5fl oz de aceite de oliva virgen extra", "2 cucharaditas de mostaza Dijon", "sal y pimienta"], "method": ["Precalentar la parrilla a alto.", "Coloque la mota o jamón en una bandeja para hornear y colóquela debajo de la parrilla durante 3-4 minutos, o hasta que esté crujiente. Retire la mota y coloque en un plato forrado con papel de cocina para drenar.", "Corta ambas pechugas de pollo por el medio, sin cortarlas, para formar una gran pieza plana. Sazonar, al gusto, con sal y pimienta negra y untar con aceite de oliva.", "Caliente una sartén hasta que esté caliente, luego coloque las pechugas de pollo y cocine durante 2-3 minutos en cada lado, o hasta que estén recién cocidas.", "Calentar una sartén hasta que esté caliente y agregar la mantequilla y luego el pan en cubos. Freír hasta que estén doradas, luego quitar.", "Separe las hojas de la lechuga y córtelas en trozos gruesos.", "Para el aderezo, en una cacerola mediana, hierva el ajo y el vino y cocine a fuego lento durante unos 5 minutos, hasta que el ajo se haya ablandado. Deja enfriar.", "Combine el vino y el ajo con las yemas de huevo, la anchoa y el queso en un tazón. Mezcle con una batidora de mano o procesador de alimentos hasta que quede suave. Rocíe el aceite en una corriente fina y constante, teniendo cuidado de no agregarlo demasiado rápido, de lo contrario podría romperse y cuajarse. Agregue la mostaza y agregue el condimento al gusto.", "Agregue la mota frita crujiente, los crutones y la lechuga al aderezo y revuelva para combinar. Para servir, coloque la ensalada en el plato, cubra con el pollo y vierta el aderezo."], "url": "www_bbc_co_uk_food_recipes_chickencaesarsalad_84099", "title": "Ensalada César de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencaesarsalad_84099_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "Cubos de panceta 50 g / 2 oz, o tocino rayado ahumado, picado finamente", "125 g / 4½ oz de pechuga de pollo cortadas en tiras", "200g / 7oz de espagueti seco", "2 huevos de gallinas camperas, golpeados", "2 yemas de huevo de gallinas camperas, batidas", "75ml / 2¾ fl oz crema doble", "75g / 2¾oz de queso parmesano, rallado, más extra para servir", "pimienta negra recién molida"], "method": ["Calentar el aceite en una sartén a fuego medio. Agregue la panceta y fría hasta que esté crujiente y dorado. Retire de la sartén con una espumadera y déjelo a un lado.", "Agregue el pollo a la misma sartén y fría por 4-5 minutos, o hasta que esté completamente cocido.", "Ponga a hervir una olla grande de agua con sal y cocine los espaguetis según las instrucciones del paquete. Drene, reservando un poco del agua de cocción.", "Pon los huevos batidos en un tazón grande. Agregue los espaguetis a los huevos y un poco del agua de cocción reservada y mezcle bien. Agregue la crema, el parmesano, el pollo cocido y los cubos de panceta cocidos y revuelva para combinar.", "Para servir, divida la pasta y la salsa entre dos tazones. Cubra con parmesano extra y pimienta negra recién molida."], "url": "www_bbc_co_uk_food_recipes_chickencarbonara_90044", "title": "Carbonara de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencarbonara_90044_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo, o 600g / 1lb 5 oz de pollo asado sobrante cocinado", "2 cebollas, 1 más o menos picada, 1 rebanada fina", "1 zanahoria, más o menos picada", "1 tallo de apio, aproximadamente picado", "6 granos de pimienta enteros", "1 hoja de laurel fresca", "Agua para cubrir", "55 g / 2 oz de mantequilla", "Harina normal de 30g / 1oz", "sal y pimienta negra recién molida", "1 brócoli pequeño con cabeza, cortado en florecillas y blanqueado", "1 x 225g / 8oz de castañas de agua de estaño, escurridas", "1 yema de huevo de gallinas camperas, ligeramente batida", "2-3 cucharadas de crema doble", "exprimir jugo de limón", "1 cucharada de perejil fresco picado, para servir", "zanahorias baby hervidas, para servir"], "method": ["Coloque las pechugas de pollo, la cebolla picada, la zanahoria, el apio, los granos de pimienta y la hoja de laurel en una sartén grande y agregue suficiente agua para cubrir los ingredientes.", "Deje que la mezcla hierva lentamente, luego reduzca el fuego y cocine a fuego lento durante 25-30 minutos, o hasta que el pollo esté completamente cocido.", "Retire el pollo de la sartén y déjelo a un lado. Mantener caliente Cuele el líquido de cocción y reserve 450 ml / 16 fl oz de él. Dejar de lado.", "Caliente la mitad de la mantequilla en una sartén grande y agregue la harina. Revuelva a fuego lento hasta que la mezcla forme una pasta suave que deje limpios los lados y la base de la sartén. Poco a poco agregue el líquido de cocción reservado, revolviendo bien después de cada adición, para hacer una salsa. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Agregue el brócoli y castañas de agua a la salsa.", "En un tazón, mezcle la yema de huevo con la crema y agregue lentamente esta mezcla a la salsa. Agregue un chorrito de jugo de limón y revuelva para combinar.", "Cortar el pollo cocido en pedazos del tamaño de un bocado y volver a la salsa. Revuelva bien.", "En una sartén por separado, caliente la mantequilla restante y fría la cebolla restante rebanada finamente hasta que esté suave y dorada.", "Para servir, espolvoree la cebolla sobre la cazuela, adorne con perejil y sirva con las zanahorias baby hervidas."], "url": "www_bbc_co_uk_food_recipes_chickencasserole_85719", "title": "Cazuela de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencasserole_85719_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pollo grande, aproximadamente 2,5 kg / 5½ lb, menudencias quitadas", "1 zanahoria, pelada y partida en dos", "1 cebolla, pelada y partida por la mitad", "6 granos de pimienta negra", "gran ramita de perejil fresco", "gran ramita de tomillo fresco", "750ml / 1¼ pintas de caldo de pollo", "250ml / 8fl oz de vino blanco", "sal y pimienta negra recién molida", "250ml / 8fl oz de crema individual", "50g / 2oz de mantequilla", "Harina normal de 50g / 2oz", "25g / 1oz de mantequilla", "1 cebolla pequeña, picada", "300g / 11oz de arroz basmati", "750ml / 1¼ pintas de verduras o caldo de pollo", "sal y pimienta negra recién molida", "selección de hojas y hierbas comestibles y flores comestibles, como ajo silvestre, capuchina, crisantemo comestible y cebolleta", "3 cucharadas de aceite de oliva virgen extra", "1 cucharada de vinagre de vino blanco", "1 cucharadita de mostaza integral", "1 cucharadita de miel clara", "1 diente de ajo grande, finamente picado", "ramita de perejil fresco", "algunas cebolletas frescas picadas", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Para la cazuela de pollo, coloque el pollo en una sartén grande a prueba de horno o en una cazuela. Agregue la zanahoria, la cebolla, los granos de pimienta, las hierbas, el caldo y el vino blanco y deje que hierva. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Cubra con una tapa y colóquelo en el horno para que se cocine durante 1½-2 horas, o hasta que el pollo esté completamente cocido. Puedes probar si el pollo está listo tirando suavemente de la pierna para separarlo de la carcasa; debe salir fácilmente y los jugos deben quedar claros cuando se perforan con un pincho o un cuchillo afilado. (Para un pollo más grande, cocine durante 20 minutos por 450 g / 1 libra, más 30 minutos adicionales).", "Retire el pollo del caldo (reservando el caldo) y colóquelo en un plato grande. Retire toda la carne del cadáver, descartando la piel y los huesos.", "Cortar la carne de pollo en tiras de aproximadamente 1 cm / ½ pulgadas de ancho y 5 cm / 2 pulgadas de largo. Cúbralo y manténgalo caliente", "Cuele el caldo en una sartén limpia y deseche las verduras, los granos de pimienta y las hierbas. Agregue la crema a la sartén, deje hervir y hierva, destapada, durante unos minutos. Si el sabor es un poco débil, hierva por más tiempo hasta que se reduzca ligeramente. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, caliente una cacerola a fuego medio y coloque la mantequilla en la sartén. Cuando la mantequilla se haya derretido, agregue la harina, revolviendo continuamente. Cocine a fuego lento durante dos minutos para formar un roux.", "Mientras la salsa de crema todavía esté hirviendo, bata gradualmente en el roux: necesitas lo suficiente para espesarlo de modo que solo cubra la parte posterior de una cuchara.", "Coloque el pollo y los jugos de nuevo en la sartén y sazone, al gusto, con sal y pimienta negra recién molida.", "Mientras tanto, para el pilaf, caliente la mantequilla en una cacerola lo suficientemente grande como para contener todo el arroz. Agregue la cebolla picada, coloque la tapa y cocine a fuego lento durante unos diez minutos, hasta que la cebolla esté suave.", "Agregue el arroz y revuelva durante unos dos minutos.", "Agregue el caldo y la temporada, al gusto, con sal y pimienta negra recién molida. Llevar a ebullición, luego baje la temperatura y cocine a fuego lento durante unos diez minutos, o hasta que el arroz esté recién cocido y todo el líquido se haya absorbido.", "Para la ensalada, lava y seca las hojas y las flores y luego destrózalas en trozos del tamaño de un bocado. Coloque en una ensaladera.", "Coloque todos los ingredientes restantes en un recipiente con tapa, selle y agite para mezclar.", "Rocíe el aderezo con moderación sobre la ensalada y revuelva para cubrir las hojas.", "Para servir, apile el arroz y la ensalada en los platos para servir y ponga la cazuela de pollo sobre el arroz."], "url": "www_bbc_co_uk_food_recipes_chickencasserolewith_88573", "title": "Cazuela de pollo con pilaff y ensalada verde", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 180}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de alubias blancas secas", "1 cebolla, pelada", "1 zanahoria grande", "250 g / 9 oz de tocino sin ahumar en la pieza, con su grasa y piel", "2-3 hojas de laurel", "un hueso de jamón", "2-3 dientes de ajo", "8-10 granos de pimienta enteros, negros", "2 cucharadas de grasa de pato, más 1 cucharada de llovizna", "500g / 1lb 2oz hombro o pierna de cerdo deshuesada, en cubos", "4 salchichas de Toulouse", "4 pechugas de pollo, en rodajas", "6 rebanadas gruesas de carne en conserva", "2 cebollas, rebanadas gruesas", "4 dientes de ajo gordos, picados", "3 tomates grandes, pelados y picados", "4 hojas de laurel", "4 piezas de confit de pato, preferiblemente piernas", "80g pan rallado blanco"], "method": ["Coloque los frijoles en un recipiente hondo y cúbralos con abundante agua fría. Deja la noche para engordar.", "Al día siguiente, escurra los frijoles y póngalos en una olla grande. Agregue la cebolla, la zanahoria y el tocino a la sartén. Meta las hojas de laurel, el jamón y el ajo.", "Cúbralo completamente con agua y llévelo a ebullición. Elimine cualquier espuma que aparezca en la superficie y deséchela. Baje el fuego a fuego lento, cubra y luego déjelo durante una hora hasta que los frijoles estén casi tiernos.", "Mientras tanto, derrita la grasa de pato en una segunda cacerola con tapa grande a fuego moderadamente alto.", "Agregue el cerdo en cubos y fríalo hasta que sus bordes estén dorados. Retire con una espumadera y déjelo a un lado.", "Corta las salchichas a la mitad para darles ocho trozos cortos, luego dóralas en la grasa como lo hiciste con la carne de cerdo y retírala.", "Cocine el pollo rebanado de la misma manera y quítelo con una cuchara ranurada, antes de hacer lo mismo con la carne en conserva.", "Cocine las cebollas cortadas en rodajas en la grasa de pato durante unos minutos hasta que se ablanden, pero no se colorean. Agregue el ajo y los tomates a la sartén, junto con las hojas de laurel.", "Devuelva las carnes a la sartén y cúbralas con agua. Llevar a ebullición, luego cocine a fuego lento durante unos 45 minutos cubiertos con una tapa, hasta que el líquido llegue a una consistencia de guiso.", "Precalentar el horno a 160 ° C / 325 ° F / Gas 3.", "Escurra los frijoles, reservando el licor de cocinado y el tocino. Deseche la zanahoria y la cebolla.", "Corta la carne de cerdo y su corteza en tiras gruesas. Picar el tocino que se cocinó con los frijoles. Coloque la carne en el fondo de una cazuela de barro profunda o una cazuela de hierro esmaltado y cúbrala con algunos de los frijoles.", "Agregue una capa de carne y cebollas, luego otra de frijoles. Meta las piezas de pato entre los frijoles, luego agregue más frijoles y carne hasta que todo se haya agotado. Rellene con cualquier líquido de la carne y un chorrito del licor de cocción de los frijoles.", "Cubra con la mitad de las migas de pan y transfiéralo al horno; cocinar por una hora.", "Mezcle las migas de pan cocidas en la cassoulet y cubra con las migas restantes. Rocíe un poco del licor de frijoles y un poco más de grasa de pato derretida sobre las migajas y vuelva al horno durante aproximadamente media hora más o menos, hasta que la masa esté dorada."], "url": "www_bbc_co_uk_food_recipes_chickencassoulet_83807", "title": "Cassoulet de pollo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1,5 kg / 3 lb 5 oz pollo, cortado en 8 piezas", "sal y pimienta negra recién molida", "Harina normal de 50g / 2oz", "2 cucharadas de aceite de oliva", "110g / 4oz de mantequilla", "175g / 6oz champiñones", "150g / 5oz chalotes, en rodajas gruesas", "40 g / 1½ oz de azúcar en polvo", "175ml / 6fl oz de vino blanco", "350ml / 12fl oz de caldo de pollo", "3 cucharadas de puré de tomate", "pequeño puñado de estragón fresco, medio dejado como ramitas, medio finamente picado", "2 tomates, pelados, sin semillas, picados", "2 cucharadas de perejil fresco de flatleaf, finamente picado", "1 kg / 2lb 2 oz de papas harinosas (como King Edwards o Desiree), peladas, cortadas en trozos", "110g / 4oz de mantequilla", "Leche entera 110ml / 4fl oz", "sal y pimienta negra recién molida"], "method": ["Sazonar las piezas de pollo con sal y pimienta negra recién molida, luego dragar la harina para cubrir.", "Caliente una sartén grande y profunda a fuego medio. Agregue el aceite y un tercio de la mantequilla y caliente hasta que la mantequilla esté en forma de espuma.", "Agregue las piezas de pollo y freír con la piel hacia abajo durante 1-2 minutos hasta que estén doradas, luego voltee el pollo y fría en el otro lado durante otros 1-2 minutos.", "Mientras tanto, caliente una sartén por separado a fuego medio y agregue otro tercio de la mantequilla. Cuando la mantequilla esté espumante, agregue los champiñones y fría, revolviendo ocasionalmente, hasta que se doren por todas partes.", "Agregue los champiñones al sartén de pollo.", "A la sartén que se usa para freír los champiñones, agregue el tercio restante de la mantequilla, los chalotes y el azúcar impalpable y fría durante 2-3 minutos hasta que los chalotes estén dorados y caramelizados.", "Agregue el vino y hierva, raspando la base de la sartén con una cuchara de madera para desalojar cualquier trozo marrón.", "Vierta la mezcla de chalotes y vino sobre el pollo, luego agregue el caldo, el puré de tomate y las ramitas de estragón entero. Llevar a ebullición, luego reduzca el fuego a fuego lento durante 45 minutos a una hora, o hasta que el pollo esté completamente cocido y la salsa se haya reducido ligeramente.", "Agregue los tomates, el perejil de hojaldre y el estragón picado y sazone al gusto con sal y pimienta negra recién molida. Cocine a fuego lento por otros dos minutos.", "Mientras tanto, para el puré de papas, coloque las papas en una sartén de agua con sal y deje que hierva. Reduzca el fuego y cocine a fuego lento durante 12-15 minutos, o hasta que las papas estén tiernas.", "Escurra las papas y vuelva a la sartén. Coloque a fuego lento durante un minuto para eliminar el exceso de humedad.", "Aplaste bien las papas, luego agregue la mantequilla y la leche, batiendo bien para formar un puré suave. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque dos pedazos de pollo en cada plato. Rocíe la salsa sobre cada uno y coloque una cucharada de puré de patatas al lado."], "url": "www_bbc_co_uk_food_recipes_chickenchasseurwithc_89917", "title": "Cazador de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150g / 5oz de fideos de harina de trigo shi amarillos secos o fideos de huevo medianos", "tablero de aceite de sésamo tostado", "Filetes de pechuga de pollo sin piel de 300g / 11oz, cortados en tiras", "2 cucharadas de salsa de soja ligera", "1 cucharadita de polvo de cinco especias", "1 cucharadita de salsa de chile (opcional)", "1 cucharada de harina de maíz", "1-2 cucharadas de aceite de cacahuete", "1 pimiento rojo, sin semillas y finamente cortado", "Brotes de soja 150 g / 5oz", "1 cebolleta, cortada longitudinalmente", "pimienta negra recién molida"], "method": ["Cocine los fideos en una cacerola de agua hirviendo durante 2-3 minutos hasta que estén al dente, o según las instrucciones del paquete. Drene, luego enjuague con agua corriente fría y drene nuevamente. Rocíe con una pizca de aceite de sésamo y revuelva para evitar que los fideos se peguen entre sí.", "Coloque las tiras de pollo en un tazón y sazone con una pizca de salsa de soja liviana, el polvo de cinco especias y la salsa de chile, si lo usa. Mezcle bien, luego pula ligeramente las tiras de pollo con la harina de maíz.", "Caliente un wok hasta que esté humeando y agregue el aceite de cacahuete, luego agregue el pollo y saltee durante 3-4 minutos, o hasta que el pollo esté dorado y cocido.", "Agregue el pimiento rojo y saltee durante 1 minuto, luego agregue los brotes de soja y la cebolla tierna y saltee durante 30 segundos. Agregue los fideos cocidos y sazone con la salsa de soja, una pizca de aceite de sésamo y pimienta negra recién molida.", "Coloque los fideos en un plato para servir y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chickenchowmein_89258", "title": "Pollo chow mi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenchowmein_89258_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cebolla, picada", "100 g / 3½ oz de muslos de pollo sin hueso, cortados en cubitos", "1 cucharadita de curry en polvo", "pizca de chile en polvo", "½ cucharadita de cúrcuma", "Guisantes 70 g / 2½ oz"], "method": ["Calentar el aceite en una sartén y freír la cebolla durante unos minutos, para suavizar. Agregue el pollo y fría hasta que el pollo esté dorado por completo.", "Agregue el curry en polvo, el chile en polvo y la cúrcuma y revuelva para cubrir el pollo con las especias.", "Agregue los guisantes y 70 ml / 2 ½ oz de agua. Reduzca el fuego y cocine a fuego lento durante 10-12 minutos, o hasta que el pollo esté bien cocido.", "Retire del fuego y sirva con arroz basmati hervido, pan naan y cualquier encurtido o salsas picantes que tenga a mano."], "url": "www_bbc_co_uk_food_recipes_chickencurry_82610", "title": "Pollo al curry por uno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickencurry_82610_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125g / 4½oz de pan rallado fresco", "½ cucharadita de pimienta de cayena (opcional)", "sal y pimienta para probar", "4 pechugas de pollo deshuesadas y sin piel, cortadas en tiras", "Harina normal de 50g / 2oz", "3 huevos medianos de granja, golpeados", "2 cucharadas de aceite vegetal"], "method": ["Precalentar el horno a 190 ° C / 375 ° F / Gas 5. Aceite dos bandejas para hornear con aceite vegetal.", "Mezcle las migas de pan, pimienta de cayena en un tazón poco profundo. Sazonar, al gusto, con sal y pimienta negra recién molida. Coloque la harina en otro recipiente poco profundo.", "Sumerja las piezas de pollo en harina común, luego en el huevo batido y finalmente cubra en las migas de pan. Sacuda el exceso y coloque los goujons de pollo en la bandeja de horno engrasada. (El proceso es más fácil si mantienes una mano limpia de huevo para sumergir el pollo en la harina y en el pan rallado).", "Rocíe los goujons por todas partes con más aceite vegetal.", "Hornee en el horno durante 30-35 minutos, volteándolo una vez. Retirar del horno cuando esté completamente cocido y dorado por todas partes.", "Sirva los goujons con ketchup, salsa barbacoa o en un suave rollo blanco."], "url": "www_bbc_co_uk_food_recipes_chickengoujons_82608", "title": "Goujons de pollo al horno", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickengoujons_82608_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "buen puñado de colmenillas secas y empapadas (retener los jugos de remojo)", "1 chalote, finamente picado", "1 diente de ajo, aplastado", "2 perillas de mantequilla", "Harina sasonada", "½ vaso de vino blanco", "1 vaso de coñac", "doble crema", "sal y pimienta", "1 patata mediana, pelada", "puñado de salvia picada"], "method": ["Espolvorea los trozos de pechuga de pollo cortados en tiras con harina sazonada, luego saltea durante aproximadamente 1 minuto en mantequilla hasta que estén dorados. Retire el pollo de la sartén y ponga en otra sartén con un poco de mantequilla para seguir cocinando.", "Mientras tanto, en la sartén anterior, agregue las colmenillas, chalotes y ajo a la sartén con un poco de mantequilla y saltee durante 30 segundos. Agregue un poco de vino blanco, coñac y fuego apagado.", "A continuación, agregue la crema doble y reduzca la salsa. Puede agregar algunos de los jugos de remojo si es demasiado espeso.", "Para el puré, coloque la papa en una fuente de agua fría y cocine a fuego lento hasta que esté cocida. Agregue la mantequilla, la crema y la salvia y mezcle bien.", "Coloque una cucharada de puré de papa y salvia en el centro del plato y coloque el pollo alrededor. Vierta sobre la salsa para servir."], "url": "www_bbc_co_uk_food_recipes_chickenforestiere_67440", "title": "Bosque de pollos", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "1 cebolla, pelada, finamente picada", "2 dientes de ajo, pelados, en rodajas", "1 cucharadita de chile en polvo", "3 cucharaditas de cúrcuma molida", "pizca de sal", "Pechuga de pollo sin piel de 750 g / 1 lb 10 oz, cortada en trozos grandes", "1 x 400 g de tomate picado", "2 cucharaditas de jengibre molido", "3 cucharaditas de comino molido", "3 cucharaditas de cilantro molido", "2 cucharadas de mantequilla derretida", "1 limón, solo jugo", "arroz basmati, cocinado según las instrucciones del paquete", "6-8 chapatis preparados o panes naan", "2 limas, cortadas en cuñas", "2 puñados de hojas de cilantro fresco picado", "1-2 chiles rojos, en rodajas"], "method": ["Calentar el aceite en una sartén y freír la cebolla y el ajo a fuego medio o bajo durante 4-5 minutos, o hasta que se ablanden.", "Mezcle el chile en polvo, la cúrcuma y la sal en un tazón hasta que estén bien combinados, luego agregue las piezas de pollo y mezcle bien para cubrir. Agregue el pollo cubierto a la sartén y freír durante 10-15 minutos, o hasta que esté dorado y cocido.", "Revuelva los tomates, el jengibre, el comino y el cilantro en la sartén, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Cubra la olla con una tapa y cocine durante 20-30 minutos, revuelva de vez en cuando y agregue una cucharada de agua cada cierto tiempo si la mezcla parece demasiado seca.", "Agregue la mantequilla y agregue el jugo de limón al gusto.", "Para servir, cuchara el pollo jalfrezi en platos para servir. Sirva con rodajas de arroz, naan y lima en un costado, luego adorne con el cilantro picado y los chiles rojos rebanados."], "url": "www_bbc_co_uk_food_recipes_chickenjalfrezi_91772", "title": "Pollo jalfrezi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenjalfrezi_91772_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Suplementos de pollo 4 x 225 g / 8 oz (pechugas de pollo con wingbone adjunto), pelado", "45-60 g / 3-4 cucharadas de perejil de hoja plana recién picado", "45-60 g / 3-4 cucharadas de cebollines recién picados", "1 cucharadita de hojas de estragón recién cortadas", "115g / 4oz de mantequilla sin sal ablandada", "2 dientes de ajo, pelados y triturados", "Sal y pimienta negra recién molida", "¾ cucharadita de mostaza inglesa", "Harina normal de 50g / 2oz", "4 huevos, golpeados", "175g / 6oz de pan rallado natural", "25 g / 1 oz de queso parmesano, rallado", "Aceite vegetal, para freír"], "method": ["Para preparar la mantequilla de hierbas de ajo: coloque las hierbas en un recipiente y agregue la mantequilla ablandada. Para aplastar el ajo, rocíe un poco de sal de roca en una tabla de cortar. Usando el borde de su cuchillo y usando un movimiento de remo, triture el ajo en una pasta suave. Agregue a la mezcla de mantequilla. Agregue la mostaza y la pimienta y mezcle con un tenedor.", "Divida la mantequilla en cuatro y déjela a un lado hasta que esté lista para usar. Sumerja sus manos en un tazón de agua fría antes de moldear la mantequilla. Ruede cada uno en papel parafinado para formar una forma de torpedo. Coloque en la nevera durante 30 minutos para permitir que la mantequilla se endurezca. (La mantequilla de hierbas se puede usar con pescado, carne y pollo).", "Coloque las pechugas de pollo, con el hueso unido, con la parte lisa hacia abajo sobre una tabla para cortar. Retire los cuatro filetes de bebé (o exceso) y déjelos a un lado. Haz un corte vertical a lo largo de la pechuga de pollo, pero no a través de todo.", "Coloque los cuatro pechos entre la película adhesiva y bash con un rodillo para asegurar un filete uniforme. Repita el proceso con los filetes más pequeños (bebé). Esto evitará que la mantequilla de ajo se filtre desde los lados del pollo.", "Coloque los filetes de pechuga en un tablero, con el lado áspero hacia arriba y sazone con pimienta. Desenvuelva la mantequilla de hierbas de ajo y coloque cada torpedo de mantequilla de ajo en el centro de cada seno. Coloque los filetes más pequeños encima de la mantequilla, empujando hacia abajo para sellar y enrollar. Haz una forma de torpedo en la parte inferior de cada filete.", "Coloque las migas de pan en un plato poco profundo. Rallar el queso parmesano directamente en las migas de pan y mezclar. Coloque la harina y los huevos batidos en dos platos separados poco profundos.", "Sumerja cada pechuga de pollo en la harina, asegurándose de que cada una esté cubierta. Repita el proceso con el huevo y luego con el pan rallado de parmesano, asegurándose de que en cada etapa esté bien cubierto. Enfríe por 30 minutos. Repita y enfríe por otros 30 minutos o hasta que esté listo para cocinar.", "Caliente el aceite en una sartén grande o una freidora a 180C / 350F / Gas 4. Agregue las pechugas de pollo y fría hasta que estén doradas durante 8-10 minutos y drene en papel de cocina.", "Sirva inmediatamente con arroz con hierbas."], "url": "www_bbc_co_uk_food_recipes_chickenkiev_5492", "title": "Pedazos de pollo", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 pechugas de pollo de 175g / 6oz, sin piel", "3 dientes de ajo, finamente picados", "1 limón, solo jugo", "sal y pimienta negra recién molida", "1 cucharada de estragón fresco picado", "Mantequilla 230g / 8oz, levemente ablandada", "2 cucharadas de harina normal", "1 huevo de gallinas camperas, golpeado", "10-12 cucharadas de pan rallado fresco", "aceite de oliva, para freír", "250g / 9oz de arroz blanco y arroz cocido (de un paquete de arroz blanco y arroz mezclado)", "100g / 3½ oz de tocino lardons, fritos hasta que estén crujientes", "1 cucharada de perejil fresco picado", "100g / 3½oz de piñones, tostados", "2 cucharadas de mantequilla derretida"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el kiev de pollo, corte una pieza del centro de la pechuga de pollo para hacer un bolsillo con un cuchillo afilado. Coloque el ajo, el jugo de limón, la sal y la pimienta negra recién molida, el estragón y la mantequilla en un tazón y mezcle bien. Rellena esta mezcla en el bolsillo de las pechugas de pollo.", "Separe las pechugas de pollo en la harina, luego sumérjalo en el huevo batido y luego en las migas de pan para cubrir completamente, sacudiendo cualquier exceso.", "Calentar el aceite en una sartén a prueba de horno y freír las pechugas de pollo en todos los lados hasta que estén ligeramente doradas. Transfiera al horno y hornee durante 18-20 minutos, o hasta que estén dorados y completamente cocidos.", "Para el arroz, coloque todos los ingredientes del arroz en un tazón y mezcle bien. Empaque la mezcla de arroz en cuatro tazas o moldes.", "Para servir, voltee el arroz en platos para servir con el pollo al lado."], "url": "www_bbc_co_uk_food_recipes_chickenkievs_86309", "title": "Pedazos de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenkievs_86309_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 17fl oz de aceite vegetal, para freír", "50 g / 1¾oz de mantequilla sin sal", "½ guindilla, finamente picada", "½ diente de ajo, aplastado", "1 cucharadita de perejil fresco, picado", "1 cucharadita de jugo de limón", "1 pechuga de pollo", "50g / 1¾oz de pan rallado blanco", "50g / 1¾oz de harina, sazonado con sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "1 patata grande, pelada y picada", "50 g / 1¾oz de mantequilla sin sal", "2 cucharadas de crema", "1 cucharadita de cebollín fresco, picado", "50g / 1¾oz de queso cheddar rallado", "sal y pimienta negra recién molida"], "method": ["Para el kiev, caliente una sartén profunda de fondo grueso, un tercio llena de aceite vegetal, hasta que una migaja de pan chisporrotee suavemente en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No deje desatendido).", "En un tazón, mezcle la mantequilla con el chile, el ajo, el perejil y el jugo de limón.", "Use un cuchillo afilado para dividir el pecho casi en la mitad horizontalmente.", "Abra la pechuga y colóquela entre dos hojas de papel resistente a la grasa. Bash el pollo con un mazo de carne (o un rodillo) para aplanar la carne.", "Coloque la mezcla de mantequilla en el medio del pollo. Doble la carne para que la mantequilla esté completamente envuelta.", "Saque el kiev de pollo con la harina sazonada, luego sumérjalo en el huevo batido y luego enrolle cuidadosamente el kiev en pan rallado. Repita el proceso de huevo y pan rallado.", "Con cuidado, agregue el kiev al aceite caliente y fría durante diez minutos. Retire del aceite y drene las toallas de cocina.", "Mientras tanto, para el puré herby, hierva la papa hasta que esté tierna, escurra y vuelva a la sartén tibia.", "Agregue la mantequilla, la crema, el cebollín y el queso en la sartén y mezcle bien. Sazonar, al gusto, con sal y pimienta negra recién molida.", "Para servir, coloque el kiev en un plato calentado. Rebana para liberar la mantequilla derretida y coloca una cucharada de puré de hierbas al lado."], "url": "www_bbc_co_uk_food_recipes_chickenkievwithherbm_79447", "title": "Kiev de pollo con puré de hierbas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 x 225 g / 8 oz de pechugas de pollo, dejando el hueso del ala pero la piel retirada", "puñado de perejil fresco, picado", "120g / 4oz de mantequilla, a temperatura ambiente", "2 dientes de ajo, pelados y triturados", "sal y pimienta negra recién molida", "1 cucharadita de mostaza Dijon", "Harina normal de 60 g / 2½ oz", "1 huevo, ligeramente batido", "1 cucharada de leche", "Pan blanco de 100g / 3½oz, cortezas eliminadas, secadas y procesadas en pan rallado", "120ml / 4fl oz de aceite de oliva", "puré de patatas", "judías verdes", "Rodajas de limón"], "method": ["Precalentar el horno a 190C / 370F / Gas 5.", "Para el pollo, retire el mini filete en la parte posterior de las pechugas de pollo y déjelo a un lado. Con un cuchillo afilado, corte los pechos para que puedan abrirse como un libro de arriba hacia abajo. Suavemente golpee los pechos con un mazo de carne o un rodillo para que queden planos.", "Repita el proceso de aplanamiento con los mini-filetes. Estos pequeños filetes se usarán como yesos pegados para evitar que la mantequilla rezume durante la cocción.", "Para la mantequilla de hierbas, coloque el perejil, la mantequilla, el ajo, la mostaza de Dijon y la sal y la pimienta en un tazón y mezcle bien. Divida la mezcla de mantequilla en cuatro pedazos del tamaño de un pulgar y colóquela en el refrigerador para enfriarla y ponerla.", "Voltee cada pechuga de pollo aplastada y ponga un rollo de mantequilla de hierbas en el centro de cada una y luego enrolle como un cigarro. Cubra cualquier orificio con las piezas de filete aplanadas.", "Separe los senos con harina y colóquelos en el congelador por 2 o 3 minutos para que se enfríen.", "Mientras tanto, batir el huevo y la leche juntos en un bol.", "Retire el pollo enharinado del congelador y sumerja en la mezcla de huevo para cubrir completamente.", "Enrolle los senos en las migas de pan, asegurándose de que estén bien cubiertos, luego coloque en la nevera durante 30 minutos.", "Caliente 120 ml de aceite en una sartén a fuego medio. Agregue las pechugas de pollo y fría por dos minutos, hasta que estén doradas. Gire los senos y transfiéralos al horno para cocinar durante 12-14 minutos, hasta que estén dorados y completamente cocidos.", "Retirar del horno y escurrir en papel de cocina.", "Sirva con puré de papa y judías verdes, con rodajas de limón para adornar."], "url": "www_bbc_co_uk_food_recipes_chickenkievwithmashe_83483", "title": "Kiev de pollo con puré de patatas y judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenkievwithmashe_83483_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["50g / 1¾oz de gorgonzola", "1 pechuga de pollo, cortada por la mitad, un corte de bolsillo en el costado de cada pieza", "50g / 1¾oz de harina natural sazonada", "2 huevos de gallinas camperas, golpeados", "50g / 1¾oz de pan rallado blanco", "500ml / 17½fl oz de aceite vegetal", "50 g / 1¾oz de mantequilla sin sal", "1 cucharada de aceite de oliva", "2 rebanadas gruesas de patata, blanqueadas en caldo de pollo hirviendo", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "½ pimiento rojo, picado", "50 g / 1 oz de azúcar en polvo", "1 cucharada de vinagre balsámico"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el kiev, divide el gorgonzola en dos rondas planas y cosas dentro de los bolsillos de las pechugas de pollo. Cierre sobre el pollo para sellar el queso dentro.", "Coloque la harina en un plato y drague las pechugas de pollo en harina, luego sumérjalas en el huevo batido y cúbralas con el pan rallado. Repita esto de nuevo para asegurarse de que el pollo esté completamente cocinado.", "Caliente el aceite en una sartén honda hasta que la miga de pan chisporrotee y se ponga marrón cuando se caiga. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido). Fríe las pechugas de pollo durante cuatro minutos hasta que estén crujientes y doradas, luego retíralas con una cuchara ranurada.", "Escurra las pechugas de pollo en papel de cocina y colóquelas en una bandeja para hornear. Hornee durante cinco minutos o hasta que el pollo esté completamente cocido.", "Para las patatas fondant, derrita la mantequilla con el aceite de oliva en una sartén. Agregue las rodajas de papa y saltee durante dos minutos en cada lado hasta que estén doradas. Sazonar con sal y pimienta negra recién molida.", "Para la salsa, caliente el aceite de oliva en una sartén y fría el pimiento rojo.", "Agregue el azúcar y el vinagre balsámico y hierva para reducir hasta que la salsa se espese.", "Para servir, coloque el pollo kiev sobre las papas fondant en un plato y espolvoree la salsa de pimiento dulce."], "url": "www_bbc_co_uk_food_recipes_chickenkievwithsweet_85842", "title": "Kiev de pollo con salsa de pimiento dulce y patatas fondant", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "1 cebolla, finamente picada", "1 diente de ajo, aplastado", "Picadillo de pollo de 450g / 1lb", "1 chile de ojo de pájaro, picado", "½ cucharadita de canela molida", "nuez moscada recién rallada, al gusto", "½ cucharadita de pimentón", "½ cucharadita de comino molido", "1 cucharada de perejil fresco picado", "sal y pimienta negra recién molida", "mantequilla, derretida, para hilvanar", "jugo de limón, para hilvanar", "200g / 7fl oz de yogur al estilo griego", "2 cucharadas de menta fresca picada", "½ pepino, sin semillas, rallado", "½ lima, solo jugo", "pan plano", "arroz, cocinado según las instrucciones del paquete", "1 cucharada de perejil fresco picado", "Rodajas de limón"], "method": ["Precalentar la parrilla a su configuración más alta.", "Calentar el aceite en una sartén a fuego medio. Agregue la cebolla y el ajo y fría hasta que se ablanden. Retirar del fuego y dejar enfriar.", "Coloque la carne picada de pollo en un tazón grande. Agregue la cebolla frita y la mezcla de ajo.", "Agregue el chile, la canela, la nuez moscada, el pimentón, el comino y el perejil. Sazonar con sal y pimienta negra recién molida y mezclar bien.", "Forme pequeños puñados de la mezcla de pollo en bolas del tamaño de una nuez.", "Ensarta tres bolas de pollo en un pincho de madera que ha sido remojado en agua durante diez minutos (para evitar que se queme). Repita con la mezcla restante en brochetas separadas, tres bolas en un pincho.", "Coloque los koftas debajo de la parrilla para cocinar durante 8-10 minutos. Gire regularmente hasta que se dore por todas partes.", "Una vez dorado y crujiente, hilvane todo con la mantequilla derretida y el jugo de limón, y continúe asando a la parrilla hasta que esté completamente cocido.", "Para el aderezo de yogur, coloque todos los ingredientes del aderezo de yogur en un tazón y mezcle bien.", "Para servir, coloca un pan plano en cada plato. Agregue un par de cucharadas de arroz cocido a cada pan plano, luego cubra con kofta.", "Rocíe con el aderezo de yogur, espolvoree con perejil picado y adorne con rodajas de limón."], "url": "www_bbc_co_uk_food_recipes_chickenkoftaswithyog_86636", "title": "Koftas de pollo con aderezo de yogur", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pollo entero de 1,4 kg / 3 lb, cortado en trozos", "150g / 5¼oz de ghee o mantequilla clarificada", "2 cebollas grandes, peladas y en rodajas", "1 cucharadita de chile en polvo", "4 cucharaditas de cebolla en polvo", "1 cucharadita de semillas de cilantro", "2 cucharadas de polvo de canela", "½ cucharadita de jengibre molido seco", "10 granos de pimienta negra", "5 dientes", "6 vainas de cardamomo, molidas", "2 dientes de ajo, pelados y triturados", "1 cucharadita de sal", "300ml / 10½fl oz de yogurt natural", "3 hojas de laurel", "300ml / 10½fl oz de caldo de pollo o agua", "1 limón, solo jugo"], "method": ["Derrita el ghee o mantequilla clarificada en una sartén grande y fría las cebollas hasta que estén doradas.", "Retire de la sartén con una cuchara ranurada y colóquela a un lado.", "Agregue todas las especias y el ajo a la sartén y fría hasta que se dore, luego agregue el pollo y la sal y cocine hasta que se dore.", "Agregue el yogur, las hojas de laurel y el caldo o el agua y devuelva las cebollas fritas a la sartén.", "Llevar a ebullición, reducir el fuego, cubrir con una tapa hermética y cocinar a fuego lento de una hora y media a dos horas, hasta que el pollo esté tierno.", "Retire la sartén del fuego, vierta el jugo de limón y mezcle bien.", "Retire las hojas de laurel y sirva con arroz hervido simple."], "url": "www_bbc_co_uk_food_recipes_chickenkorma_72074", "title": "Curry de pollo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]