[{"ingredients": ["Tubos y tentáculos de calamar fresco de 500 g / 1 libra y 2 onzas, tubos cortados por la mitad a lo largo y carne anotada", "4 cucharaditas de aceite de oliva", "2 limones, solo jugo", "2 chiles rojos largos, sin semillas, finamente picados", "sal marina y pimienta negra recién molida", "60g / 2¼oz de berros", "1 huevo de gallinas camperas", "300ml / 10fl oz de aceite vegetal", "1 chile rojo, sin semillas, finamente picado", "2 cucharaditas de mostaza Dijon", "1 cucharadita de vinagre blanco", "Cohete salvaje de 100 g / 3½ oz", "½ manojo de berros"], "method": ["Para hacer la mayonesa, pula el berro en una olla grande de agua hirviendo durante 2 minutos. Drene y renueve con agua fría hasta que esté completamente frío. Exprima cualquier exceso de agua. Mezcle el berro en un bol con los ingredientes restantes más sal y pimienta negra recién molida, usando una licuadora de mano, hasta que tenga una mayonesa suave.", "Precalentar una sartén a fuego medio-alto. Sazone el calamar con sal y pimienta y rocíe con el aceite, luego cocine en la plancha caliente durante 2 minutos (debe enrollarse e irse oscuro y pegajoso por fuera). Gire el calamar y cocine por un minuto más.", "Mientras tanto, mezcle la mitad del jugo de limón con los chiles rojos. Retire la plancha del fuego y vierta la mezcla de limón y chile sobre el calamar.", "Para servir, coloca un puñado de rúcula y berros en cada uno de los cuatro platos. Coloque el calamar encima, vierta sobre el jugo de limón restante y sirva con una cucharada de mayonesa."], "url": "www_bbc_co_uk_food_recipes_grilled_squid_with_an_81647", "title": "Calamar a la plancha con mayonesa instantánea con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cebollas blancas medianas", "1 cucharada de aceite de oliva", "1 ramita de tomillo", "1 pepino, lavado", "2 pizcas de pimentón molido", "1 cucharada de aceite de oliva", "1 cucharada de aceite de nuez", "1 cucharada de aceite de oliva", "1 cucharada de mostaza Dijon", "1 cucharada de vinagre balsámico", "sal y pimienta negra recién molida", "8 langostinos tigre, cabezas y caparazones eliminados, desvenados", "1 limón, ralladura solamente", "2 cucharadas de aceite de oliva", "pizca de pimentón molido", "2 chiles rojos, en juliana y fritos", "2 cucharadas de berro de coriandro"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Para el puré de cebolla, recorte ambos extremos de las cebollas, pero no pele. Coloque ambas cebollas enteras en una hoja de papel de aluminio. Agregue el aceite y el tomillo y sazone con sal y pimienta. Asar durante 1 hora y media hasta que esté muy suave.", "Una vez cocido, retire del horno y deseche la capa exterior de las cebollas junto con el tomillo. Coloque las cebollas tiernas y los jugos de cocina en una licuadora y presione hasta obtener un puré suave (agregue una cucharada de agua si es necesario).", "Para la guarnición, la cáscara y la mitad del pepino (mantenga la cáscara para usar en el aderezo), luego corte en trozos elegantes del tamaño de un bocado. Sazonar el pepino con sal, pimienta y pimentón.", "Calentar el aceite en una sartén y freír el pepino hasta que esté dorado. Dejar de lado.", "Para el aderezo, coloque toda la cáscara de pepino (reservada de la guarnición) en un exprimidor para producir un jugo verde oscuro. Pon el jugo en un tazón pequeño con todos los demás ingredientes. Sazonar con sal y pimienta, luego batir para crear un aderezo de vinagreta.", "Para los langostinos tigre, coloque los langostinos en un recipiente para mezclar, mezcle los ingredientes restantes y luego sazone con sal y pimienta.", "Precalentar una sartén a fuego alto. Una vez caliente, freír las gambas por un minuto en cada lado, o hasta que estén bien cocidas (el tiempo exacto de cocción variará dependiendo del tamaño de las gambas).", "Para servir, divida las gambas entre platos para servir. Cucharee el puré de cebolla al lado. Coloque el pepino frito alrededor de los platos y rocíe sobre el aderezo. Sirva con los chiles rojos fritos y el berro de cilantro."], "url": "www_bbc_co_uk_food_recipes_grilled_tiger_prawns_36749", "title": "Gambas de tigre a la plancha, puré de cebolla blanca y pepino chamuscado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125ml / 4fl oz de aceite de oliva virgen extra", "2 limones, jugo y ralladura", "1 cucharadita de miel", "1 chalote de plátano pequeño, finamente picado", "50g / 1¾oz de aceitunas verdes, picadas", "50g / 1¾oz de aceitunas negras, picadas", "1 diente de ajo, triturado o rallado", "2 cucharaditas de orégano seco", "½ cucharadita de sal marina", "¼ cucharadita de pimienta negra recién molida", "4 x filetes de atún fresco (aproximadamente 150 g / 5½ oz cada uno)", "2 tomates de ciruela, sin semillas y cortados en cubitos", "2 cucharadas de alcaparras, más o menos picadas", "Cohete de 100g / 3½ oz, más o menos picado", "4 rebanadas de pan de masa fermentada", "2 cucharadas de aceite de oliva", "1 diente de ajo", "1 tomate de ciruela, picado y puré con un poco de aceite de oliva", "sal y pimienta negra recién molida"], "method": ["Para la vinagreta, mezcle el aceite, el zumo de limón, la ralladura de limón, la miel, el chalote, las aceitunas, el ajo, el orégano, la sal y la pimienta en un tazón y déjelos a un lado.", "Coloque los filetes de atún en una capa en un plato para hornear poco profundo y vierta dos tercios de la vinagreta sobre ellos. Gire el atún para cubrir bien. Cubra con film transparente y colóquelo en la nevera por 15 minutos.", "Mientras tanto, combine la vinagreta restante con los tomates, las alcaparras y el cohete. Dejar de lado.", "Caliente la parrilla o la sartén a fuego medio-alto. Ase el atún durante 3-4 minutos a cada lado por raras o hasta que esté cocido a su gusto.", "Rocíe el pan con aceite y cocine en una sartén caliente durante 1-2 minutos por cada lado o hasta que aparezcan las marcas. Enfríe un poco, frote con el ajo crudo, coloque el tomate molido encima y sazone con sal y pimienta.", "Sirva los filetes de atún cubiertos con la salsa y el bruschetta de ajo y tomate en el lado."], "url": "www_bbc_co_uk_food_recipes_grilled_tuna_with_tomato_29511", "title": "Atún a la plancha con salsa de tomate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cebolla roja, finamente picada", "1 cucharada de azúcar moreno", "1 diente de ajo, aplastado", "3 cucharadas de vinagre balsámico", "1 manojo de espárragos, extremos recortados", "aceite de oliva", "15g / ½ oz de mantequilla", "30g / 1¼oz de queso Stilton"], "method": ["Para la salsa picante coloque todos los ingredientes en una cacerola pequeña y cocine a fuego lento durante quince minutos.", "Para los espárragos, caliente una parrilla y cepille ligeramente los espárragos con aceite.", "Ase a la parrilla hasta que esté bien carbonizado por todos lados durante 4-5 minutos.", "En una sartén pequeña, derrita la mantequilla y agregue trozos de Stilton hasta que se derrita.", "Cuando esté listo para servir, coloque los espárragos sobre la mesa, rocíe con la mantequilla Stilton y coloque una cucharada de chutney en un lado."], "url": "www_bbc_co_uk_food_recipes_grilledasparaguswith_78067", "title": "Espárragos a la parrilla con mantequilla de Stilton y salsa picante de cebolla roja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 caballa, limpiada con agua fría y fileteada", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida, al gusto", "3 cucharadas de rábano picante fresco, rallado", "90ml / 3½ fl oz crema doble", "1 limón, solo jugo", "1 cucharada de vinagre de vino blanco", "3 cucharadas de aceite de colza", "2 cucharadas de perifollo, finamente picado", "2 cucharadas de cebollín, finamente picado", "2 cucharadas de estragón, finamente picado", "2 remolachas cocidas grandes, peladas y cortadas en rodajas de 5 mm, para servir", "1 cebolla roja, finamente cortada en anillos, para servir"], "method": ["Precalentar la parrilla a alto. Cubra la base de un wok con una doble capa de papel de aluminio, esparza una capa de virutas de madera y luego coloque un inserto de vapor en la parte superior. Cubra con una tapa y colóquelo a fuego alto.", "Engrase ligeramente la mitad de los filetes de caballa con la mitad del aceite de oliva y coloque el lado de la piel hacia arriba en el inserto de vapor. Cubra el vaporizador con una tapa ajustada.", "Reduzca el fuego y cocine por 4-7 minutos (dependiendo del tamaño de la caballa), o hasta que esté recién cocido. Eliminar y reservar. (Fumar genera una gran cantidad de humo. Asegúrese de trabajar en un área bien ventilada).", "Precalentar la parrilla a caliente.", "Coloque los filetes de caballa restantes, con la piel hacia abajo, sobre una superficie de trabajo limpia, sazone con pimienta negra recién molida y extienda sobre una cucharada de rábano picante fresco y el aceite de oliva restante.", "Coloque la caballa con la piel hacia arriba en una bandeja para asar y cocine debajo de la parrilla durante 3-4 minutos, o hasta que esté bien cocida.", "Coloque la crema doble en un bol, agregue la mitad del jugo de limón y la sal y pimienta negra recién molida, al gusto. Batir hasta que espese. Agregue el rábano picante restante y revuelva para combinar. Dejar de lado.", "Coloque el jugo de limón restante, el vinagre de vino blanco y el aceite de colza en otro recipiente y mezcle. Agregue las hierbas y sazone con sal y pimienta negra recién molida.", "Para servir, coloque un filete de caballa ahumada en la parte superior de cada plato, con la piel hacia arriba. Coloque las rodajas de remolacha junto a la caballa, en una línea. Cubra con aros de cebolla roja, luego coloque la caballa a la parrilla junto a la remolacha, con la piel hacia arriba.", "Rocíe la remolacha con el aderezo de hierbas y coloque una cucharada de crema de rábano picante al lado. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_grilledandsmokedmack_90876", "title": "Caballa a la parrilla y ahumada en casa con crema de rábano picante y ensalada de remolacha", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["24 lanzas de espárragos, tallos duros eliminados", "tazón de fuente de agua helada", "aceite de oliva", "1 limón, solo jugo", "3-4 cucharadas de aceite de oliva, o al gusto", "1 chalote, finamente picado", "pequeño puñado de cebollín fresco, picado", "sal y pimienta negra recién molida"], "method": ["Para los espárragos, ponga a hervir una sartén de agua con sal. Agregue los espárragos al agua y blanquee brevemente.", "Con unas pinzas o una cuchara ranurada, retire los espárragos del agua hirviendo y colóquelos inmediatamente en el agua helada, luego escurra.", "Caliente una sartén hasta que esté muy caliente. Rocíe el aceite de oliva sobre los espárragos y coloque sobre la plancha. Cocine, volteando ocasionalmente, hasta que esté bien marcado y dorado por todos lados.", "Para el aderezo de limón y cebollín, mezcle el jugo del limón en un tazón con aceite de oliva, chalote picado y cebollín y sazone con sal y pimienta negra recién molida.", "Para servir, coloca seis lanzas de espárragos en cada una de las cuatro placas. Vístase con la vinagreta de limón y cebollín."], "url": "www_bbc_co_uk_food_recipes_grilledasparaguswith_86532", "title": "Espárragos a la plancha con aderezo de limón y cebolleta", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 berenjenas japonesas o 1 berenjena morada grande", "aceite vegetal, para freír poco", "4 cebolletas, solo parte verde", "4 cucharadas de pasta de miso ligera (dulce) (disponible en algunos supermercados y tiendas de comestibles asiáticas)", "2 cucharaditas de azúcar", "1 pomo pequeño de jengibre fresco", "1 cucharada de shoyu o salsa de soja ligera", "2 cucharadas de mirin"], "method": ["Prepara las berenjenas. Cortar las berenjenas por la mitad a lo largo, manteniendo el tallo intacto.", "Marca el lado cortado de las berenjenas en diagonal, formando un patrón de diamantes en la carne.", "Caliente aproximadamente 0.5 cm / 0.25 en aceite en una sartén de fondo grueso. Cuando esté caliente, agregue las mitades de berenjena, corte hacia abajo. Freír las mitades hasta que estén ligeramente doradas, alrededor de tres minutos. Voltee y fríe ligeramente el otro lado por un minuto o dos más. Las berenjenas deben ser bastante suaves.", "Con cuidado, retire las berenjenas de la sartén con una rebanada de pescado y escurra sobre papel de cocina.", "Precalentar la parrilla a mediano.", "Prepara el relleno de miso. Coloque el miso en un recipiente y agregue el azúcar. Rallar el jengibre en el bol, luego agregar salsa shoyu o soya y mirin.", "Coloque las berenjenas en una bandeja para hornear, con el lado cortado hacia arriba. Vierta el miso sobre las mitades de berenjena y colóquelas debajo de la parrilla. Ase hasta que el relleno del miso comience a dorarse y burbujee un poco, pero no permita que se queme.", "Cortar finamente las cebolletas.", "Coloque las berenjenas a la parrilla en un plato para servir, esparza las cebollas tiernas en rodajas sobre la parte superior y sirva."], "url": "www_bbc_co_uk_food_recipes_grilledaubergineswit_90214", "title": "Berenjenas a la plancha con miso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/grilledaubergineswit_90214_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 berenjenas rebanadas longitudinalmente y a la parrilla con aceite de oliva hasta que estén doradas", "1 bola de mozzarella", "1 limón, jugo y ralladura solamente", "1 diente de ajo, finamente picado", "2 cucharadas de perejil plano picado", "Pan rallado blanco fresco de 150g / 5oz", "100g / 3½oz de tomates cherry", "gran manojo de menta", "gran manojo de albahaca", "gran manojo de perejil", "1 diente de ajo", "1 limón, jugo y ralladura solamente", "70ml / 2½fl oz buen aceite de oliva", "30g / 1oz de piñones"], "method": ["En un procesador de alimentos, mezcle las migas de pan, mozzarella, limón, ajo y perejil hasta que aparezca una consistencia de miga.", "Haga bolitas de este y enrollelas en las rodajas de berenjena. Colocar en una fuente para horno.", "Ase los tomates cherry en un poco de aceite de oliva durante unos 20 minutos, hasta que estén blandos. Cuando estén cocidos, aplastarlos ligeramente con un tenedor.", "Con una cuchara, coloque algunos de los tomates triturados sobre los rollos de berenjena y hornéelos en el horno con abundante aceite de oliva de diez a quince minutos a 200C / 400F / Gas 6.", "Coloque todos los ingredientes de salsa verde en un procesador de alimentos y mezcle hasta obtener una consistencia gruesa. Divida el resto de los tomates triturados entre cuatro platos para servir, coloque dos o tres panecillos de berenjenas encima y ponga una salsa verde para servir."], "url": "www_bbc_co_uk_food_recipes_grilledauberginewith_72909", "title": "Berenjena a la plancha con salsa verde", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 berenjenas, cortadas en lonchas largas de 1cm / ½ pulgada de grosor", "harina blanca, sazonada con sal y pimienta negra recién molida", "2 huevos de gallinas camperas, batidos con una pizca de sal", "3 cucharadas de aceite de oliva ligero", "300 g / 10 oz de queso mozzarella, en rodajas", "Queso parmesano 110 g / 4 oz, recién rallado", "sal y pimienta para probar", "aceite de oliva virgen extra", "1 cebolla, finamente picada", "3 dientes de ajo, finamente picados", "500g / 1lb 2oz de tomates frescos, toscamente picados", "500g / 1lb 2 oz de tomates picados en conserva", "¼ cucharadita de orégano seco", "12 hojas de albahaca fresca", "aceite vegetal, para freír", "Harina normal de 25g / 1oz", "25g / 1 oz de harina de maíz", "pizca de sal", "75-110ml / 3-4fl oz de agua con gas", "4 flores de calabacín"], "method": ["Para las berenjenas, precaliente la parrilla a altura.", "Dragar las rodajas de berenjena en la harina, luego sumergir en el huevo batido.", "Calentar una sartén hasta que esté caliente y agregar el aceite de oliva.", "Agregue las rodajas de berenjena y fría, volteándolas una vez, hasta que estén doradas por ambos lados. Retire con cuidado cada rebanada de berenjena y colóquela sobre papel de cocina y déjela a un lado para drenarla.", "Transfiera las berenjenas a una bandeja de horno y cubra con la mozzarella picada y el parmesano rallado.", "Sazonar con sal y pimienta negra recién molida y colocar debajo de la parrilla para cocinar hasta que la cobertura esté dorada y burbujeante.", "Para la salsa de tomate, caliente una sartén hasta que esté caliente y agregue el aceite de oliva, la cebolla y el ajo y fríe durante 4-5 minutos.", "Agregue los tomates y lleve a ebullición, luego agregue el orégano, reduzca el fuego y cocine a fuego lento durante 10-15 minutos. A mitad de la cocción agregar las hojas de albahaca.", "Sazonar, al gusto, con sal y pimienta negra recién molida y colocar en un procesador de alimentos. Deje que se enfríe durante un par de minutos, luego mezcle hasta que quede suave.", "Para las flores de calabacín, caliente una sartén profunda de fondo grueso dos tercios llena de aceite vegetal hasta que la miga de pan chisporrotee y se ponga marrón cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Tamiza la harina, la harina de maíz y la sal en un recipiente y agrega el agua con gas. Revuelva para combinarlo muy brevemente, hasta que la mezcla se una, dejando los grumos.", "Sumerja las flores de calabacín en la masa y vuélvalas a cubrir completamente, luego coloque cuidadosamente en el aceite caliente. Freír en ambos lados hasta que estén dorados y crujientes. Retire de la sartén con una espumadera y escurra sobre papel de cocina.", "Para servir, vierta un poco de salsa de tomate en cada plato y cubra con algunas rodajas de berenjena a la parrilla. Adorne con una flor de calabacín rebozada y sirva."], "url": "www_bbc_co_uk_food_recipes_grilledauberginewith_86571", "title": "Berenjena a la plancha con salsa de tomate y flores de calabacín", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 plátanos grandes, piel sobre", "4 ramitas de romero fresco", "Crema doble de 200 ml / 7 fl oz", "150g / 5oz de mantequilla", "150g / 5oz de azúcar moreno oscuro", "2 cucharadas de melaza negra", "2 cucharadas de jarabe de oro", "4 plátanos, pelados, cortados en trozos y congelados en una bolsa de congelador o en una bandeja", "¼ cucharadita de esencia de vainilla", "3-4 cucharadas de azúcar en polvo", "150ml / 5fl oz de suero de leche"], "method": ["Inserta un cuchillo afilado en un extremo de los plátanos para crear una hendidura en la piel e inserta la ramita de romero fresco. Caliente una sartén hasta que esté muy caliente.", "Coloque los plátanos con la piel todavía sobre la sartén y la plancha durante 3-4 minutos por cada lado, o hasta que la piel esté marrón oscura y comience a separarse.", "Para hacer la salsa de caramelo, simplemente coloque la crema doble, la mantequilla, el azúcar, la melaza y el jarabe dorado en una cacerola a fuego medio y deje que hierva. Revuelva bien para asegurar que todos los ingredientes se combinen y disuelvan.", "Para hacer el helado, incline los trozos de plátano congelado en un procesador de alimentos. Agregue la esencia de vainilla, azúcar y 75 ml / 2 ½ oz de suero de leche. Encienda el procesador y déjelo funcionar durante 20-30 segundos.", "Mientras el procesador de alimentos todavía está funcionando, vierta gradualmente el suero restante en un flujo constante. Deje que la máquina funcione hasta que la mezcla esté suave y cremosa.", "Sirva cada plátano en un tazón como lo haría con una chaqueta de papa: corte abierto por el centro, con la piel puesta. Vierta una cucharada de la salsa de caramelo y coloque una bola de helado en la parte superior."], "url": "www_bbc_co_uk_food_recipes_grilledbananaswithro_83882", "title": "Plátanos a la parrilla con romero, salsa de caramelo y helado instantáneo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Filete de rape 250 g / 9 oz", "2 ramitas de romero fresco, solo hojas", "2 dientes de ajo picados", "3 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "Colinabo de 75 g / 2½ oz, cortado en rodajas en 4 cm / 1½ pulg x 1½ cm / ½ en piezas redondas", "150ml / ¼ pinta de caldo de pollo caliente"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para la carne de res, coloque todos los ingredientes en un tazón pequeño y deje que la carne se margine durante unos diez minutos.", "Caliente la sartén a fuego alto y cocine la carne marinada durante 3-4 minutos. Voltee la carne y cocine en el otro lado durante 2-3 minutos. Poner a un lado y dejar reposar en un lugar cálido.", "Para el fondant, caliente el aceite en una sartén a prueba de horno, agregue el solomillo y cocínelo por 2-3 minutos por cada lado, hasta que se dore. Agregue el caldo de pollo para cubrir el colinabo.", "Transfiera la sartén al horno y hornee por 12-14 minutos, o hasta que se ablande.", "Para servir, coloque la carne de ternera marinada en un plato junto con el fondant de colinabo."], "url": "www_bbc_co_uk_food_recipes_grilledbeefrumpsteak_84729", "title": "Filete de ternera a la parrilla con fondant de colinabo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cabeza mediana de brócoli, dividida en florecillas", "1 cucharada de aceite de oliva"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Caliente una sartén a prueba de horno hasta que esté caliente. Coloque el brócoli en la sartén y rocíe con el aceite.", "Ase a la parrilla durante dos minutos en cada lado y luego transfiéralo al horno por cinco minutos, hasta que esté cocido."], "url": "www_bbc_co_uk_food_recipes_grilledbroccoli_83988", "title": "Brócoli asado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["85g / 3oz Tenderstem brócoli, blanqueado y escurrido", "1 cucharada de aceite vegetal", "2 cucharadas de salsa de soja", "1 chile rojo, picado", "3 cucharadas de perifollo fresco picado", "1 cucharada de aceite de sésamo", "1 cucharada de vinagre balsámico"], "method": ["Caliente una sartén hasta que fume, luego rocíe el brócoli con el aceite vegetal y agregue a la sartén. Chargrill durante 2-3 minutos, volteándolo ocasionalmente, o hasta que el brócoli esté dorado por todas partes.", "Combine los ingredientes restantes en un tazón pequeño para el aderezo.", "Coloque el brócoli a la brasa en un plato para servir y rocíe sobre el aderezo. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledbroccoliwithc_90677", "title": "Brócoli a la parrilla con salsa de chile y soja", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Brócoli de brotación púrpura de 110 g / 4 oz, recortado", "2 cucharadas de salsa de soja", "1 cucharadita de miel", "4 castañas de agua, cortadas en cubitos"], "method": ["Ponga a hervir una olla grande de agua. Agregue el brócoli y cocínelo durante dos o tres minutos y escurra.", "Calentar una sartén a la parrilla y dorar el brócoli hasta que esté bien coloreado.", "Para hacer el aderezo, mezcle la miel, la salsa de soja y las castañas de agua.", "Sirva el brócoli caliente, rociado con el aderezo."], "url": "www_bbc_co_uk_food_recipes_grilledbroccoliwithw_78109", "title": "Brócoli a la parrilla con aderezo de castañas de agua", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 dientes de ajo, pelados", "150ml / 6fl oz de vino blanco", "1 cucharada de mostaza Dijon", "4 yemas de huevo de gallinas camperas", "3 filetes de anchoa marinadas, picadas", "150ml / 6fl oz de aceite de oliva virgen extra", "150ml / 6fl oz de aceite de colza", "pimienta negra recién molida, al gusto", "16 anchoas frescas, limpiadas, deshuesadas y aplastadas", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "Harina normal de 50g / 2oz", "2 cucharaditas de pimentón dulce ahumado", "Pan de campo de 110 g / 4 oz, cortado en cubos pequeños", "2 cucharadas de aceite de oliva", "sal y pimienta negra recién molida", "25 g / 1 oz de queso parmesano, rallado", "3 lechugas Little Gem, hojas separadas", "8 filetes de anchoas marinadas, en rodajas finas"], "method": ["Para el aderezo César, coloque el ajo y el vino blanco en una olla pequeña y deje que hierva. Cocine a fuego lento durante cinco minutos hasta que el ajo se ablande.", "Saque la sartén del fuego y agregue la mostaza, las yemas de huevo y las anchoas marinadas, mezcle para combinar.", "Con una batidora de varillas, mezcle con un puré y transfiera a un bol.", "Poco a poco agregue los dos aceites, batiendo constantemente. Sazonar con pimienta negra recién molida, al gusto y dejar de lado.", "Para las anchoas, precaliente la parrilla a alto.", "Sazone las anchoas con sal y pimienta negra recién molida y cepille con el aceite de oliva.", "Mezcle la harina con el pimentón en un tazón pequeño y luego mezcle las anchoas con la harina para cubrir.", "Coloque las anchoas en un molde para parrilla y colóquelas debajo de la parrilla durante dos minutos hasta que estén recién cocidas.", "Dé vuelta y cocine por un minuto más y luego retírelo de la parrilla.", "Para la ensalada, mezcle el pan de campo con aceite de oliva, sal y pimienta negra recién molida.", "Caliente una sartén hasta que esté caliente, agregue el pan y cocínelo durante 3-4 minutos, revolviendo ocasionalmente, hasta que se dore por todos lados y esté crujiente.", "Retire la sartén del fuego, agregue el parmesano y mezcle para cubrir los croutons con parmesano.", "Coloque las hojas de Little Gem y las anchoas en rodajas en un recipiente con un poco de aderezo César y mezcle para cubrir.", "En el último minuto, agregue los croutons y mezcle.", "Para servir, coloque una pila de ensalada en el centro de cada uno de los cuatro platos. Acomode las anchoas a la parrilla junto a la ensalada y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_grilledbutterfliedan_87801", "title": "Anchoas asadas a la parrilla con ensalada César", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 filetes de caballa grandes", "8 vainas de cardamomo, solo semillas, aplastadas", "3cm / 1in pieza de rábano picante fresco, rallado", "sal y pimienta negra recién molida", "1kg / 2lb 2oz de patatas nuevas, lavadas", "Coliflor de 300 g / 11 oz, cortada en florecillas", "Frijoles verdes de 300g / 11oz, recortados", "3 cucharadas de aceite de oliva virgen extra", "12 filetes de anchoa en salazón, enjuagados y escurridos", "20g / ¾oz de alcaparras saladas, remojadas en agua durante 2 horas", "1 diente de ajo, finamente cortado"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque los filetes de caballa con la carne hacia arriba en la bandeja de la parrilla. Espolvorear con semillas de cardamomo trituradas y el rábano picante rallado y sazonar ligeramente con sal y pimienta negra recién molida.", "Coloque debajo de la parrilla durante 3-4 minutos, luego gire y cocine el otro lado durante 30 segundos, o hasta que el pescado esté recién cocido.", "Para la ensalada, coloque las papas en un recipiente con agua, deje hervir y cocine a fuego lento hasta que estén tiernas. Escurra y deje hasta que esté lo suficientemente frío como para manipularlo, luego quite las pieles.", "Mientras tanto, trae una olla grande de agua con sal a ebullición. Agregue la coliflor y cocine por tres minutos.", "Agregue los frijoles y cocine la coliflor y los frijoles durante tres minutos, o hasta que estén tiernos. Escurrir y apartar.", "Calentar una sartén hasta que esté caliente, agregar el aceite de oliva, los filetes de anchoas, las alcaparras y el ajo y freír durante un minuto.", "Agregue las papas, la coliflor y las judías verdes y mezcle bien.", "Para servir, coloque porciones iguales de la ensalada en el centro de cada plato. Cubra cada uno con dos filetes de caballa y rocíe sobre cualquier zumo de pan de la ensalada."], "url": "www_bbc_co_uk_food_recipes_grilledcardamomandho_89899", "title": "Cardamomo a la parrilla y caballa de rábano picante con ensalada de otoño", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 pechuga de pollo", "dash aceite de oliva", "sal y pimienta negra recién molida", "85g / 3oz de queso feta, desmenuzado", "1 ramita de tomillo fresco, picado", "1 rebanada de pan ciabatta, tostado", "85g / 3oz de tomates cherry en la vid", "dash aceite de oliva", "dash vinagre balsámico", "2 patatas nuevas, cortadas a la mitad", "dash aceite de oliva"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el pollo, caliente una sartén de plancha. Frote aceite de oliva sobre la pechuga de pollo, sazone con sal y pimienta negra recién molida, para probar, y luego colóquela en la sartén con la piel hacia abajo con la cara hacia abajo durante 4-5 minutos, o hasta que esté dorada. Dar la vuelta, cubrir con queso feta y tomillo y sazonar, al gusto, con sal y pimienta negra recién molida. Coloque en una bandeja para hornear, transfiéralo al horno y hornee durante ocho minutos, o hasta que el pollo esté bien cocido. Coloque la pechuga de pollo en una rebanada de pan ciabatta tostado.", "Para los tomates cherry asados, coloque los tomates en una bandeja para hornear, rocíe sobre el aceite de oliva y tueste durante diez minutos. Agregue el vinagre balsámico y tápelo durante 2-3 minutos más.", "Para las papas asadas, hierva las papas en agua hirviendo con sal durante diez minutos, o hasta que se ablanden, y escurra. Calentar un poco de aceite de oliva en una sartén y freír hasta que esté dorado.", "Para servir, coloque el pollo en un plato para servir, cubra con los tomates cherry asados ​​y sirva las papas asadas a los lados."], "url": "www_bbc_co_uk_food_recipes_grilledchickentopped_86839", "title": "Pollo a la parrilla de queso feta con tomates cherry asados ​​y patatas asadas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ pechuga de pollo, sin piel", "2 cucharadas de aceite de oliva", "1 cucharada de perifollo picado", "sal y pimienta negra recién molida", "Brócoli brotación púrpura de 100 g / 3½ oz", "½ limón, solo jugo", "ramita de eneldo fresco, para adornar"], "method": ["Usando un ablandador de carne o la base de una cacerola pesada, coloque la pechuga de pollo en una tabla de cortar y aplánela a 1 cm / ½ pulgada de espesor.", "Coloque el pollo en un recipiente pequeño de vidrio con una cucharada de aceite de oliva y el perifollo. Sazonar con sal y pimienta negra recién molida.", "Ponga a hervir una olla de agua con sal, agregue el brócoli y cocínelo durante un minuto. Drene e inmediatamente enjuague con agua fría. Cuando se haya enfriado, drene nuevamente y seque con un paño de cocina.", "Caliente una sartén hasta que esté caliente. Coloque el pollo en la sartén y cocine durante 3-4 minutos en cada lado, o hasta que esté bien cocido.", "Mezcle el brócoli en la cucharada restante de aceite de oliva y colóquelo en la sartén caliente. Cocine por 1-2 minutos o hasta que estén tiernos.", "Para servir, coloque el brócoli en un plato y cubra con el pollo. Exprima el jugo de limón y adorne con eneldo."], "url": "www_bbc_co_uk_food_recipes_grilledchickenwithch_86875", "title": "Pollo a la parrilla con brócoli carbonizado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 supremas de pollo (pechos con el hueso pequeño todavía unido), piel sobre", "2 cucharadas de aceite de oliva", "Tocino 75g / 2½ oz", "8 lanzas de espárragos blancos", "120g / 4¼oz de setas de castaña, descuartizado", "60g / 3oz de mantequilla sin sal", "½ limón, solo jugo", "1 pequeño racimo de perejil italiano, picado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 390F / Gas 6.", "Sazonar los supremas de pollo con sal y pimienta negra recién molida y untar con un poco de aceite de oliva.", "Calentar una sartén a fuego medio y agregar el pollo. Freír durante unos dos minutos en cada lado, o hasta que estén dorados.", "Transfiera el pollo a una bandeja para hornear (mantenga la bandeja a un lado para usarla más adelante en la receta) y cocine en el horno durante 20-25 minutos, o hasta que esté bien cocida.", "Al mismo tiempo, coloque la panceta en una bandeja para hornear por separado y cocine en el horno durante unos 15 minutos o hasta que esté crujiente. Retire y reserve en papel de cocina.", "Mientras tanto, recorte los extremos leñosos de los espárragos. Llevar a ebullición una gran sartén de agua hirviendo con sal y escaldar los espárragos. Escurra los espárragos, revuelva en agua fría y reserve.", "Caliente el aceite de oliva restante en la sartén que utilizó para cocinar el pollo y agregue los champiñones. Cocine por 4-5 minutos hasta que se suavice. Suba el fuego y agregue los espárragos blanqueados y la mantequilla y deje dorar.", "Agregue el jugo de limón y el perejil.", "Para servir, divida los espárragos y los champiñones entre dos platos calientes. Cubra cada una con un suprema de pollo, rocíe sobre los jugos que quedan en la sartén y adorne con la panceta crujiente."], "url": "www_bbc_co_uk_food_recipes_grilledchickenwithcr_74661", "title": "Pollo a la parrilla con panceta crujiente, espárragos blancos y mantequilla marrón", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["dash aceite de oliva", "1 pechuga de pollo, piel anotada", "sal y pimienta negra recién molida", "1 cucharada de vinagre de vino tinto", "½ zanahoria, rallada", "pellizcar canela molida", "pellizcar jengibre molido", "1 cucharadita de azúcar en polvo", "sal y pimienta negra recién molida", "85g / 3oz de judías verdes", "2 cucharadas de aceite de oliva", "15 g / ½ oz de raíz de jengibre fresco, finamente picado", "1 diente de ajo, finamente picado", "sal y pimienta negra recién molida", "2 naranjas, solo jugo", "2 vainas de cardamomo, aplastadas", "1 vaina de vainilla, dividida", "1-2 cucharadas de aceite de oliva"], "method": ["Para el pollo, caliente el aceite de oliva en una sartén, sazone el pollo con sal y pimienta negra recién molida y fría por cinco minutos en cada lado, o hasta que esté completamente cocido. Retire del fuego y luego corte densamente.", "Para el puré de zanahoria con especias, coloque el vinagre de vino tinto, zanahoria rallada, canela, jengibre, azúcar, sal y pimienta negra recién molida recién molida en una olla pequeña y cocine a fuego lento durante 3-4 minutos, o hasta que la zanahoria se haya suavizado. Cuchara en una mini licuadora y procesar hasta que quede suave.", "Para la ensalada de judías verdes, ponga las judías verdes en una sartén de agua hirviendo con sal y hierva durante cuatro minutos, o hasta que estén tiernas. Escurrir, arriba y la cola y luego dividir por la mitad a lo largo. Calentar el aceite de oliva en una olla pequeña, agregar el jengibre y el ajo y retirar del fuego. Revuelva los frijoles en el aceite caliente y reserve.", "Para el aderezo, exprime el zumo de naranja en una sartén pequeña, agrega las cápsulas de cardamomo y divide la vaina de vainilla y coloca a fuego medio durante diez minutos, o hasta que se reduzca. Cuele a través de un colador y agregue el aceite de oliva.", "Para servir, apile los frijoles en un plato y cubra con el pollo. Vierta el puré de zanahoria en un lado y vierta sobre el aderezo."], "url": "www_bbc_co_uk_food_recipes_grilledchickenwithsp_88187", "title": "Pollo con puré de zanahoria con especias, ensalada de judías verdes y naranja, cardamomo y aderezo de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]