[{"isVegetarian": false, "title": "Carne de res Wellington con salsa de setas silvestres de Madeira", "url": "www_bbc_co_uk_food_recipes_beef_wellington_with_98256", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_wellington_with_98256_16x9.jpg", "ingredients": ["1 cucharadita de aceite de oliva", "1 x 1kg / 2lb filete de ternera a 4 oz (pregunte a su carnicero por la sección del medio)", "50-100g / 2-3½oz de mantequilla", "4 hongos Portobello, limpios y muy finamente picados", "150g / 5½oz de hojas de espinaca baby", "2 huevos de gallinas camperas, más 3 yemas de huevo de gallinas camperas", "60g / 2¼ oz de harina común", "200ml / 7fl de leche en oz", "Paté de hígado de pollo 150 g / 5½ oz", "500g / 1lb 2 oz de hojaldre listo", "150 g / 5½ oz de setas silvestres mezcladas, limpiadas y recortadas", "50 ml / 2 fl oz en Madeira", "300 ml / 10 fl oz concentrado de carne de vacuno (hervir 600 ml / 1 pinta stock de carne de vacuno hasta que el volumen se haya reducido a la mitad)", "sal y pimienta negra recién molida"], "serves": "Sirve 6-8", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 100C / 80C Fan / Gas ½.", "Caliente el aceite en una sartén a fuego alto. Freír rápidamente el filete de carne, volteándolo cada pocos segundos, hasta que se dore por todos lados.", "Corta 4 pedazos grandes de película adhesiva resistente al calor o papel de aluminio lo suficientemente grande como para enrollar el filete de res y colócalos uno encima del otro. Coloque el filete de carne en el centro y envuélvalo con fuerza para formar un cilindro, girando los extremos para asegurar. Coloque el filete de carne envuelto en una bandeja para hornear y tueste en el horno durante una hora.", "Retire la carne del horno, déjela a un lado hasta que se enfríe a temperatura ambiente, luego enfríe en el refrigerador hasta que esté completamente fría.", "Mientras tanto, caliente un poco de mantequilla en una sartén a fuego medio. Cuando la mantequilla esté espumante, agregue los champiñones picados y fríalos durante 1-2 minutos, o hasta que todo el líquido se haya evaporado y los hongos se hayan suavizado. Transfiera los champiñones a un tazón y limpie la sartén con un rollo de cocina.", "Agregue un poco más de mantequilla a la sartén, luego fría la espinaca por un minuto o hasta que comience a marchitarse. Retire la sartén del fuego y continúe revolviendo la espinaca hasta que esté completamente marchita. Ponlo en un bol y déjalo a parte.", "Luego, haz los panqueques. Coloque los dos huevos enteros y la harina en un bol y mezcle hasta que estén bien combinados. Poco a poco bata la leche hasta que la mezcla forme una masa suave que sea lo suficientemente gruesa como para cubrir la parte posterior de una cuchara.", "Caliente un poco de mantequilla en una sartén a fuego alto. Cuando la mantequilla esté espumante y comience a humear, agregue un cucharón de la masa de panqueque y agite la sartén para cubrir uniformemente la base. Freír durante 1-2 minutos, o hasta que la parte inferior del panqueque esté dorada. Voltee el panqueque y cocine por un minuto más, o hasta que el panqueque esté bien cocido y dorado por todas partes. Deslice el panqueque en un plato forrado con papel resistente a la grasa, luego cúbralo con otra capa de papel resistente a la grasa. Repita el proceso con la mantequilla restante y la masa de panqueques.", "Coloque el paté de hígado de pollo en un bol y bata hasta que quede suave y suave.", "Aumente la temperatura del horno a 230 ° C / 210 ° Ventilador / Gas 8.", "Extienda la masa de hojaldre en una superficie de trabajo ligeramente enharinada en un rectángulo de 40x50 cm / 16x20 pulgadas con un espesor de 2-3 mm (debe ser lo suficientemente grande como para envolver el filete de res).", "Coloque los panqueques en toda la masa, superponiendo ligeramente los bordes y dejando un borde de 2,5 cm / 1 pulg. Libre en el borde. Recorte los bordes superpuestos de los panqueques con un cuchillo afilado para que se sientan en una sola capa.", "Extienda el paté ablandado en una capa uniforme en todos los panqueques. Arregle una capa de espinaca marchita en la parte superior. Extienda los champiñones cocidos sobre la espinaca. Sazonar, al gusto, con sal y pimienta negra recién molida. Finalmente, pele la película adhesiva o la lámina del filete de carne y colóquelo en el centro.", "Batir las yemas de huevo en un recipiente, luego cepillarlas alrededor del borde de la repostería. Gire firmemente el filete de res en la masa, asegurándose de que el sello quede en la parte inferior del Wellington. Meta los extremos debajo del Wellington sin recortarlos. Transfiera el Wellington a una bandeja para hornear forrada con papel de hornear y cúbralo con las yemas de huevo batidas restantes. Si lo desea, decore con adornos de pastelería.", "Hornee la carne Wellington en el horno durante 20-25 minutos (para el medio), o hasta que la masa se haya levantado y esté dorada.", "Mientras tanto, caliente un poco de mantequilla en una sartén a fuego alto. Cuando la mantequilla esté espumosa, agregue los hongos silvestres y fríalos durante 2 a 3 minutos, o hasta que se ablanden. Agregue el Madeira y enciéndalo usando un fósforo. (Precaución: Mantenga los ojos y el cabello alejados de las llamas y apague el extractor antes de encenderlos). Deje que las llamas se inflamen y se apaguen.", "Agregue el caldo concentrado de carne y lleve a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 3-4 minutos o hasta que el volumen del líquido se haya reducido en un tercio. Agregue la mantequilla restante hasta que se derrita.", "Para servir, esculpe la carne Wellington en rodajas gruesas y colóquelas en el centro de un plato para servir. Rocíe el champiñón y la salsa de Madeira alrededor del borde de los platos."]}, {"isVegetarian": false, "title": "Carne de res con un risotto de ajo y perejil y chalotes asados", "url": "www_bbc_co_uk_food_recipes_beef_with_a_garlic_and_62404", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_with_a_garlic_and_62404_16x9.jpg", "ingredients": ["50g / 1¾oz de mantequilla", "50g / 1¾oz de perejil fresco, picado", "½ diente de ajo, aplastado", "4 chalotes de plátano, tres cortados a la mitad (con la piel encendida) y uno cortado finamente", "2 dientes de ajo, finamente picados", "50g / 1¾oz de arroz arborio", "50ml / 2fl oz de vino blanco", "300ml / 10fl oz de caldo de pollo", "25ml / 1fl oz de aceite de oliva", "1 x 500 g / 1 libra de filete de ternera de 2 oz (preferiblemente carne de ternera de Dexter)", "sal y pimienta negra recién molida", "2 cucharadas de mascarpone", "50 g / 1¾oz de queso parmesano, rallado", "1 manojo pequeño de perejil fresco, hojas picadas"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar una barbacoa o una sartén a fuego lento.", "En un procesador de alimentos, mezcle la mantequilla, el perejil y el ajo. (Si lo hace por adelantado, puede guardarlo en la nevera en este momento hasta que esté listo para usar).", "Derrita la mantequilla con sabor en una cacerola y luego fríe con cuidado la chalota picada y el ajo durante 1-2 minutos.", "Agregue el arroz y revuelva para cubrir con la mantequilla. Agregue el vino y deje hervir antes de agregar el caldo. Cocine a fuego lento durante 12-15 minutos revolviendo ocasionalmente.", "Rocíe la mitad del aceite sobre el bistec y sazone generosamente con pimienta negra. Coloque sobre la barbacoa o la sartén de la plancha. Rocíe el aceite restante sobre las mitades de chalote y coloque sobre la barbacoa con la carne hacia abajo. Cocine ambos durante 8-10 minutos, volteando a la mitad.", "Agregue el mascarpone, el parmesano y el perejil picado al risotto y sazone al gusto con sal y pimienta.", "Para servir, espolvorear el risotto en platos para servir. Cortar el bistec y colocar al lado. Retire la piel de las chalotas y coloque sobre las placas."]}, {"isVegetarian": false, "title": "Carne de res con fritto misto y salsa de chile", "url": "www_bbc_co_uk_food_recipes_beef_with_fritto_misto_77954", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 filetes de solomillo de 175g / 6oz", "sal y pimienta negra recién molida", "1 cucharada de romero fresco picado", "3 cucharadas de aceite de oliva", "2 chiles rojos, finamente picados", "1 cucharada de perejil de flatleaf fresco picado", "1 diente de ajo, aplastado con un poco de sal marina", "1 cucharadita de vinagre de vino tinto", "aceite vegetal, para freír", "4 cucharadas de aceite de oliva", "Harina normal de 300g / 11oz", "1 litro / 1¾ pintas de agua tibia", "1 huevo blanco de corral", "2 alcachofas violetas, hojas exteriores duras y obturador eliminado", "2 alcachofas de Jerusalén, peladas, en rodajas", "1 radicchio de cabeza pequeña, hojas externas eliminadas, descuartizado", "4 hojas frescas de salvia", "sal"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa de carne y chile, caliente una sartén hasta que esté muy caliente.", "Sazone los filetes con sal, pimienta negra recién molida y el romero picado.", "Cepillar con dos cucharadas de aceite de oliva y freír durante 2-3 minutos en cada lado (para el medio), luego retirar de la sartén y dejar reposar durante 10 minutos.", "Mezcle el chile rojo, el perejil, el ajo, el vinagre y la cucharada restante de aceite de oliva en un bol.", "Cortar los filetes y una cuchara sobre la salsa de chile.", "Para el fritto misto, caliente el aceite en una freidora a 180C / 350F. No deje desatendida la freidora.", "Coloque la harina en un tazón grande, haga un pozo en el centro y vierta el aceite de oliva. Bata lentamente en el agua tibia hasta que la mezcla tenga la consistencia de la miel que moquea. (Puede que no necesite toda el agua).", "Batir la clara de huevo en un recipiente aparte hasta que se formen picos suaves cuando se quite la batidora. Dobla la clara de huevo en la masa.", "Agregue los vegetales preparados a un tazón junto con un cucharón lleno de masa y mezcle hasta que estén bien combinados.", "Cocine las verduras en la freidora por 2-3 minutos o hasta que estén crujientes. Retirar de la freidora con una cuchara ranurada, reservar para escurrir sobre papel de cocina y espolvorear con sal. (Es posible que necesite cocinar las verduras en lotes).", "Para servir, coloque la carne en platos para servir y coloque el fritto misto al lado."]}, {"isVegetarian": false, "title": "Pastel de carne de vaca y ale", "url": "www_bbc_co_uk_food_recipes_beefandalepie_81022", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["900 g / 2lb de ternera guisada en cubitos", "25 g / 1 oz de harina, aderezada con sal y pimienta negra recién molida, más extra para espolvorear", "100 g / 3½ oz de mantequilla", "2 cebollas, más o menos picadas", "2 dientes de ajo, toscamente picados", "2 zanahorias medianas, aproximadamente picadas", "150g / 5½ oz champiñones", "2 ramitas de tomillo fresco", "1 hoja de laurel", "400ml / 14fl oz de buena calidad ale", "500ml / 17fl oz de caldo de carne", "sal y pimienta negra recién molida", "1 huevo entero de campo abierto batido con 1 yema de huevo de gallinas camperas", "300g / 10½oz de hojaldre laminado listo para usar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Sumerja la carne en la harina sazonada, luego coloque una sartén grande con tapa en la placa.", "Calienta la mitad de la mantequilla en la sartén y agrega la carne. Raspe todo hasta que esté dorado.", "Agregue las verduras y las hierbas, luego vierta la cerveza y el caldo. Traiga a fuego lento, luego cubra con una tapa y cocine a fuego lento sobre la estufa durante 1 hora y media.", "Precalentar el horno a 220C / 425F / Gas 7.", "Una vez cocido, sazone el estofado, agregue la mantequilla restante y la punta en un plato para servir a prueba de horno. Cepille el borde del plato con el huevo batido.", "Si es necesario, saque la masa con la menor cantidad de harina posible y colóquela sobre el plato. Pellizque los bordes del plato para que la masa se adhiera a él y recorte las piezas restantes de la masa alrededor del borde. Corta los restos de hojaldre en hojas y agrégalos a la parte superior, usando el huevo batido como un \\\"pegamento\\\", para decorar.", "Cepille la superficie de la masa a fondo con el huevo batido restante y colóquelo en una bandeja para hornear. Hornee en el horno durante 20-30 minutos hasta que la masa esté dorada en la parte superior. Servir."]}, {"isVegetarian": false, "title": "Pastel de carne de vaca, cerveza y zanahoria", "url": "www_bbc_co_uk_food_recipes_beefaleandcarrotpie_90442", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 75g / 3oz", "sal y pimienta negra recién molida", "Filete de estofado 750g / 1½lb, cortado en cubos de 5cm / 2in", "2 cucharadas de aceite vegetal", "2 chalotes, picados", "125g / 4½oz cebollas bebé (o cebollas pequeñas), peladas", "Zanahorias de 400g / 14oz cortadas en trozos grandes", "4 ramitas de tomillo fresco", "3 hojas de laurel", "4 cucharadas de puré de tomate", "300ml / 10fl de onza de cerveza", "300 ml / 10 fl oz de caldo de carne caliente", "Pasta de hojaldre lista para usar de 500 g / 1 libra, laminada a 0.5 cm / ½ pulgada de grosor", "1 huevo de gallinas camperas, golpeado", "verduras al vapor de su elección, para servir"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Espolvoree la harina en un plato y sazone bien con sal y pimienta negra recién molida. Dragar las piezas de carne en la harina sazonada.", "Caliente una cacerola a prueba de horno a fuego alto, agregue las piezas de carne en lotes y fría durante 3-4 minutos, o hasta que estén doradas por todos lados, revolviendo regularmente. Retire el filete cocido del plato, transfiéralo a un plato caliente y déjelo a un lado. Repita el proceso con las piezas de carne restantes, luego reserve.", "Agregue los chalotes, las cebollas y las zanahorias a la cacerola vacía y fríalos por 2-3 minutos, o hasta que estén suaves.", "Agregue el tomillo, las hojas de laurel y el puré de tomate y mezcle bien para combinar.", "Agregue la cerveza y mezcle bien, raspando cualquier sedimento del fondo de la cazuela con una cuchara de madera.", "Regrese las piezas de filete doradas a la cazuela, agregue el caldo caliente, revuelva bien y lleve la mezcla a ebullición.", "Transfiera el plato al horno y cocínelo durante 1½ horas, o hasta que la carne esté tierna y la salsa espesa. Retire del horno y deje a un lado para que se enfríe un poco.", "Aumente el calor del horno a 220C / 425F / Gas 7.", "Divida la mezcla de carne y salsa entre cuatro platos pequeños a prueba de horno.", "Corta la masa en cuatro partes iguales, cada una lo suficientemente grande como para cubrir los pequeños platos de tarta.", "Cepille un poco de agua alrededor del borde de cada plato para pastel pequeño, luego coloque una pieza de pastel sobre cada pastel y presione los bordes para sellar la masa al plato.", "Cepille cada pastel con un poco de huevo batido, luego coloque los pasteles en el horno y cocínelos durante 15-20 minutos, o hasta que la masa esté dorada y pálida y se haya levantado.", "Para servir, coloque los pequeños platos de tarta en platos para servir y mezcle verduras al vapor de su elección al lado."]}, {"isVegetarian": false, "title": "Estofado de ternera con albóndigas", "url": "www_bbc_co_uk_food_recipes_beef_stew_with_dumplings_15297", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_stew_with_dumplings_15297_16x9.jpg", "ingredients": ["4 cucharadas de aceite de oliva", "500g / 1lb 2 oz chuck steak, en cubos", "2 cebollas, más o menos picadas", "1 zanahoria grande, pelada, más o menos picada", "1 tallo de apio, cortado, toscamente picado", "½ colinabo, pelado, toscamente picado", "2 cucharadas de harina normal", "1 litro / 1¾ pintas de caldo de carne", "400ml / 14fl oz de vino tinto", "2 hojas de laurel", "sal y pimienta negra recién molida", "125g / 4½oz de harina natural", "Sebo triturado de 65 g / 2¼ oz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "4-5 cucharadas de agua fría, para mezclar", "70g / 2½oz de avena fina", "Harina normal de 70 g / 2½ oz", "1 cucharadita de polvo de hornear", "1 cucharadita de sal", "1 cucharada de perejil fresco picado", "2 cucharaditas de hojas de Romero fresco picado", "2 cucharaditas de hojas frescas de tomillo", "80g / 2¾oz de mantequilla fría", "4-5 cucharadas de agua fría, para mezclar"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el estofado de ternera, caliente el aceite en una cazuela grande con tapa a fuego medio. Freír el chuletón durante 3-4 minutos, hasta que se dore por todos lados. Retire de la sartén y reserve.", "Agregue las cebollas, la zanahoria, el apio y el colinabo y fría por 6-8 minutos, o hasta que estén doradas, agregando un poco más de aceite de oliva si es necesario. Condimentar con sal y pimienta.", "Agregue la harina común y mezcle bien. Cocine por 1-2 minutos, o hasta que se vuelva de color castaño. Vierta el caldo y revuelva bien hasta que la salsa se espese.", "Regrese la carne a la cazuela, agregue el vino tinto y las hojas de laurel y deje que la mezcla hierva. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego deje hervir a fuego lento durante 1 hora con la tapa ligeramente entreabierta.", "Mientras tanto, para las albóndigas de sebo, combine la harina, el sebo, el polvo de hornear y la sal en un tazón hasta que estén bien combinados. Agregue el agua gradualmente, revolviendo la mezcla con los dedos, hasta que se una como una masa ligeramente descuidada. Forme la masa en bolas aproximadamente del tamaño de una ciruela.", "Para las albóndigas de avena herby, combine la harina de avena, la harina, el polvo de hornear, la sal y las hierbas en un tazón para mezclar hasta que estén bien combinadas. Ralla la mantequilla helada en el bol y vuelve a mezclar. Junta la masa con los dedos, agregando gradualmente suficiente agua, como antes, para hacer una masa húmeda. Forma la masa en bolas de ciruela.", "Cuando el guisado se haya cocinado a fuego lento durante una hora, sazonarlo nuevamente con sal y pimienta, si es necesario. Coloque las albóndigas encima del estofado, cubra la cazuela con la tapa y cocine por otros 15-20 minutos o hasta que las albóndigas se hinchen con orgullo. Servir."]}, {"isVegetarian": false, "title": "Estofado de carne y cerveza con albóndigas", "url": "www_bbc_co_uk_food_recipes_beefandalestewwithdu_90180", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de aceite vegetal", "1kg / 2lb 3 oz de espina cortada en tiras (cortar el hueso en pedazos grandes)", "2 palitos de apio", "2 zanahorias", "2 cebollas grandes", "3 dientes de ajo", "1 puré de tomate con cucharadita colmada", "1 cucharada de harina normal", "sal y pimienta negra recién molida", "½ litro / 17fl oz de ale real o amargo", "200 ml / 7 fl oz de caldo de carne oscura", "2 hojas de laurel", "1 ramita de tomillo fresco", "150 g / 5 oz de sebo de carne", "Harina de 150g / 5oz para crianza, tamizada, más extra para espolvorear", "sal y pimienta negra recién molida", "1 cucharadita de rábano picante preparado (opcional)", "agua para unir"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precalentar el horno a 160 ° C / 320 ° F / Gas 2. Caliente una cazuela grande en la placa. Agregue un poco de aceite vegetal y, cuando esté caliente, agregue un poco de la carne en una sola capa y cocine a fuego alto hasta que se dore. Cuando esté dorado, retire la carne en un recipiente, antes de agregar el siguiente lote y dorar. No llenes la sartén. Retire el último lote de carne y colóquelo en un recipiente.", "Corta bastante el apio. Agregue el último pedacito de aceite a la cazuela y agregue el apio.", "Corta aproximadamente las zanahorias y las cebollas y agrégalas a la cazuela.", "Rebane el ajo y agregue a la cazuela. Revuelva todas las verduras a fondo y deje que se doren suavemente, raspando los trozos dorados del fondo de la sartén sobre la marcha.", "Una vez que las verduras estén coloreadas, agregue el puré de tomate y revuelva. Agregue la harina y mezcle bien hasta que la harina se incorpore. Sazonar con sal y pimienta negra recién molida.", "Agregue la cerveza a la cazuela, seguido del caldo de carne.", "Llevar a fuego lento y devolver la carne dorada a la cazuela. Cubra con una tapa y cocine a fuego lento.", "Hacer las albóndigas. Coloque el sebo en un recipiente limpio y agregue la harina. Con las manos, mezcle bien el sebo y la harina, y sazone con sal y pimienta negra recién molida. Si quieres albóndigas de rábano picante, ahora es el momento de agregarlo a la mezcla.", "Haga un pozo en el centro de la mezcla de harina y sebo y agregue agua un poco a la vez. Mezcle con sus manos hasta obtener una masa firme que se desprenda limpiamente de los lados del recipiente.", "Coloque la masa sobre una tabla limpia y espolvoree un poco de harina. Enrolle la masa en forma de salchicha, luego forme seis albóndigas del tamaño de una pelota de golf (doblarán de tamaño cuando cocine). Con cuidado, colocar las albóndigas en el guiso. Puede guardar cualquier masa de dumpling no utilizada envuelta en film transparente en el refrigerador durante dos o tres días.", "Cubra la cacerola con una tapa y colóquela en el horno precalentado para cocinar por 2½-3 horas, verificando periódicamente.", "Después de dos horas, voltee las albóndigas. Agregue las hojas de laurel y el tomillo y continúe cocinando durante media hora más a una hora. Cuando la carne esté lista, debe desmoronarse al tacto y las albóndigas deben ser livianas y esponjosas.", "Sirva las albóndigas y el estofado de ternera en tazones grandes."]}, {"isVegetarian": false, "title": "Estofado jamaicano de carne de res y mango", "url": "www_bbc_co_uk_food_recipes_beefandmangojamaican_92087", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharadita de nuez moscada recién rallada", "1 cucharada de curry en polvo", "1 cucharada de salsa de soja ligera", "1 guindilla Scotch, finamente picada", "sal y pimienta negra recién molida", "450 g / 1 libra de bistec estofado, cortado en trozos", "2 cucharadas de aceite vegetal", "1 cebolla, pelada, finamente cortada", "1 pimiento verde, semillas eliminadas, en rodajas", "1 diente de ajo, pelado, aplastado", "1 cucharada de puré de tomate", "4 tomates, picados", "1 papa para hornear, pelada y cortada en trozos grandes", "50ml / 2fl oz de ron", "300ml / 10½fl oz de caldo de carne", "2 mangos maduros, pelados, sin piedras, picados", "1 cucharada de tomillo fresco picado", "arroz de grano largo, cocido de acuerdo con las instrucciones del paquete, escurrido, para servir"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Coloque la nuez moscada, el polvo de curry, la salsa de soya, el chile y la sal y la pimienta negra recién molida en un bol y mezcle bien. Agregue los trozos de carne y mezcle bien para cubrir uniformemente en la mezcla.", "Caliente el aceite vegetal en una sartén hasta que esté humeando, luego fríe la carne durante 1-2 minutos por todos lados, o hasta que se dore por todas partes. Retire la carne de la cacerola y déjela a un lado.", "Agregue la cebolla, el pimiento y el ajo a la sartén y freír durante 3-4 minutos, o hasta que se ablanden, luego mezcle el puré de tomate y los tomates picados y cocine por 2-3 minutos más.", "Vuelva a colocar la carne en la sartén junto con los trozos de patata, el ron y el caldo, y luego llévela a ebullición. Reduzca a fuego lento y cocine durante 1 hora a 1 hora y 30 minutos, o hasta que la carne esté tierna.", "Agregue los mangos y el tomillo y cocine durante 4-5 minutos más para calentar.", "Sirva el guiso de Jamaica junto con arroz cocido de grano largo y un cóctel de ron si lo desea."]}, {"isVegetarian": false, "title": "Pastel de carne y cebolla con corteza de queso", "url": "www_bbc_co_uk_food_recipes_beefandonionpiewithc_92634", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina común 225 / 8oz, más extra para quitar el polvo", "75g / 2¾oz de mantequilla fría, cortada en cubos, más extra para engrasar", "pizca de sal", "75g / 2¾oz de queso Lancashire maduro, o similar queso desmenuzable maduro, rallado", "4 cucharadas de agua", "1 yema de huevo de gallinas camperas", "1-2 cucharadas de aceite vegetal", "Carne picada de carne 250 g / 9 oz", "1 cebolla, pelada, picada", "1 zanahoria, pelada, finamente picada", "1 tallo de apio, cortado, finamente picado", "1 cucharada de puré de tomate", "1 cucharada de salsa Worcestershire", "splash bitter ale", "1 huevo de gallinas camperas, golpeado", "puré", "salsa marrón"], "serves": "Para 6", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la masa, mezcle la harina, los cubos de mantequilla y la sal en un procesador de alimentos hasta que la mezcla se asemeje a pan rallado.", "Agregue el queso, el agua y la yema de huevo y continúe mezclando hasta que la mezcla se una como masa.", "Extienda la masa sobre una superficie de trabajo ligeramente enharinada y amasar ligeramente durante 3-4 minutos o hasta que quede suave y elástica. Envuelva la masa en una película adhesiva y enfríe en la nevera durante al menos una hora.", "Mientras tanto, para el relleno, caliente el aceite en una sartén a fuego medio. Agregue la carne picada de carne, en tandas si es necesario, y freír durante 6-8 minutos, volteando una vez, o hasta que se dore por todas partes. Retirar de la sartén y reservar (mantener caliente). Repita el proceso con los lotes restantes de carne molida de res.", "Agregue la cebolla, la zanahoria y el apio a la sartén utilizada para freír la carne picada. Freír durante 3-4 minutos, revolviendo bien, hasta que se ablanden.", "Regrese la carne picada a la sartén y mezcle el puré de tomate, la salsa Worcestershire y la cerveza amarga. Deje que la mezcla hierva a fuego lento y cocine, revolviendo regularmente, durante 8-10 minutos, o hasta que la mayoría del líquido se haya evaporado.", "Precaliente el horno a 200C / 400F / Gas 6. Engrase un plato para pastel de 20cm-25cm / 8-10in con mantequilla.", "Cuando la masa se haya enfriado, divídala por la mitad. Estirar la mitad sobre una superficie de trabajo ligeramente enharinada hasta que sea un poco más grande que la placa de pastel. Cuidadosamente alinee la placa de pastel con la masa, presionándola en los bordes de la placa.", "Vierta el relleno en la caja de tarta.", "Enrolle la masa restante sobre una superficie de trabajo ligeramente enharinada hasta que sea un poco más grande que el plato para pastel.", "Cepille el borde de la caja de pastel con un poco de la colada de huevo. Coloque el disco de repostería sobre la tarta y presione los bordes entre sí. Cepille la tapa del pastel con el resto del huevo batido. Pinche la masa varias veces con un tenedor.", "Hornee el pastel en el horno durante 35-40 minutos, o hasta que la masa esté crujiente y dorada. Sirva con puré de patatas y salsa marrón."]}, {"isVegetarian": false, "title": "Carne de res y pimiento rojo salteado con arroz frito con huevo", "url": "www_bbc_co_uk_food_recipes_beefandredpepperstir_79707", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g / 3½oz de arroz basmati cocido", "1 huevo de gallinas camperas", "1 cucharada de salsa de soja", "2 cucharadas de cilantro fresco, picado", "1 cucharada de salsa de soja", "1 cucharada de miel", "1 cucharada de aceite de sésamo", "100 g / 3½ oz de carne de rabadilla, cortada en tiras", "½ calabacín, finamente cortado", "½ pimiento rojo, finamente cortado", "¼ de cebolla, en rodajas", "1 diente de ajo, en rodajas", "1 cucharada de semillas de sésamo", "sal y pimienta negra recién molida"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer el arroz frito con huevo, coloca el wok a fuego alto.", "Coloque el arroz y la salsa de soya en un tazón y mezcle. Agregue el arroz al wok y siga revolviendo por un minuto.", "Rompa el huevo y revuelva por un minuto más hasta que el huevo se haya cocinado.", "Servir en un tazón con el cilantro picado espolvoreado.", "Para hacer el sofrito, coloca la salsa de soja, la miel y el aceite de sésamo en un bol", "Agregue la carne en rodajas a la mezcla y deje marinar durante cinco minutos.", "Coloque un wok limpio a fuego alto. Agregue el calabacín, el pimiento rojo, la cebolla, el ajo, la carne de res marinada y las semillas de sésamo y saltee durante dos minutos.", "Agregue los jugos de adobo y cocine por dos minutos más. Sazonar, al gusto, con sal y pimienta negra recién molida y colocar en un bol.", "Sirva el tazón de arroz al lado del tazón de carne de res salteado."]}, {"isVegetarian": false, "title": "Carne de res y hongos shiitake salteados", "url": "www_bbc_co_uk_food_recipes_beefandshitakemushro_86551", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharada de aceite de sésamo", "Filete de carne de vacuno de 300 g / 10½ oz, en rodajas finas", "1 diente de ajo, aplastado", "Jengibre 10g / ¾oz, rallado", "100 g / 3½ oz de champiñones shiitake, en rodajas", "Col de primavera de 100 g / 3½ oz, en rodajas", "50g / 2oz de cebolla roja, en rodajas", "Brotes de soja 50g / 2oz", "50g / 2oz mangetout", "1 cucharadita de polvo chino de cinco especias", "1 cucharada de semillas de sésamo", "1 lima, solo jugo", "sal al gusto", "salsa de soja, al gusto"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Caliente el aceite de sésamo en una sartén grande o wok. Agregue la carne a la sartén y saltee durante 1-2 minutos hasta que se coloree por todos lados. Agregue el ajo y el jengibre y revuelva bien. Agregue las verduras y sofría por otro minuto o hasta que la carne esté cocida a su gusto.", "Tan pronto como la carne esté cocida, agregue el polvo de cinco especias, las semillas de sésamo y el jugo de lima, remueva y retire del fuego.", "Para servir, sazone con sal y / o salsa de soja y divídalo entre cuatro platos."]}, {"isVegetarian": false, "title": "Pastel de carne y Stilton con puré de apio y remolacha asada con miel", "url": "www_bbc_co_uk_food_recipes_beefandstiltonpiewit_92225", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Harina normal de 250g / 9oz, más extra para espolvorear", "250 g / 9 oz de mantequilla fría, cortada en cubos pequeños", "½ cucharadita de sal", "125ml / 4½fl oz de agua helada", "1kg / 2lb 2oz de bistec estofado, cortado en trozos", "2 dientes de ajo, pelados, aplastados", "1 pequeño racimo de tomillo fresco", "1 cucharada de pimienta negra", "400ml / 14fl oz Leicestershire pale ale", "2 cucharadas de harina natural, condimentada con sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "2 cucharadas de mantequilla", "100g / 3½ oz de champiñones castaños", "8 chalotes, pelados, partidos por la mitad", "500ml / 17½fl oz de caldo de carne", "75 g / 2½ oz de queso Stilton, desmenuzado", "sal y pimienta negra recién molida", "1 huevo de gallinas camperas, golpeado", "Acelga 350g / 12oz, pelado, cortado en trozos", "800g / 1lb 12oz de patatas Maris Piper", "150ml / 5fl oz de crema doble", "1 cucharada de mantequilla", "2 cucharaditas de mostaza de grano grueso", "sal y pimienta blanca", "2 cucharaditas de tomillo fresco picado", "2 cucharaditas de vinagre balsámico", "2 cucharadas de aceite de oliva", "2 cucharadas de miel clara", "Remolacha cocinada 500g / 17½oz (no en vinagre)", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Para la pasta de hojaldre áspera, tamiza la harina en un tazón y haz un pozo en el centro. Agregue la mantequilla y la sal y frote en la harina con los dedos hasta que la mezcla se asemeje a pan rallado.", "Poco a poco agregue el agua helada, mezcle hasta que la masa se una (tenga cuidado de no trabajar en exceso la masa). Enrolle la masa en una bola, envuélvala en una película adhesiva y déjela enfriar en la nevera durante 20 minutos.", "Retire la masa de la nevera y desenvuelva. Enharine la superficie de trabajo y extienda la masa a un rectángulo de 40cm x 20cm / 16in x 8in. Dobla la masa en tres partes y dale un cuarto de vuelta. Voltee la pasta de nuevo en un rectángulo de 40cm x 20cm / 16in x 8in como antes y vuelva a doblarla en tres. Envuelva la masa doblada en una película adhesiva y déjela enfriar en la nevera durante 30 minutos.", "Retire la masa de la nevera y desenvuelva. Repita el proceso de despliegue y plegado otras dos veces, girando la masa por un cuarto cada vez. Después de doblarlo por última vez, vuelva a envolverlo en una película adhesiva y enfríelo en la nevera hasta que lo necesite.", "Para el relleno del pastel, coloque la carne, el ajo, el tomillo, los granos de pimienta y la cerveza en un bol. Cúbralo con una película adhesiva y déjelo marinar en el refrigerador durante al menos 2-3 horas, preferiblemente durante la noche.", "Retire la carne del adobo, seque con papel de cocina y arrastre con la harina sazonada. Cuele el adobo a través de un colador fino en un recipiente limpio y déjelo a un lado.", "Caliente el aceite y una cucharada de mantequilla en una cazuela a prueba de llamas y fría la carne en pequeños lotes durante 2-3 minutos cada vez, o hasta que se dore por todas partes. Una vez que la carne esté dorada, retírela de la cazuela y déjela a un lado.", "Regrese la fuente de cazuela al fuego y fría los champiñones y los chalotes durante 4-5 minutos, o hasta que se ablanden.", "Devuelva la carne y el líquido de marinado reservado a la cazuela y agregue el caldo de carne. Cubra con una tapa y cocine a fuego lento durante 1 hora y media, o hasta que la carne esté tierna.", "Cuele la mitad del líquido de cocción de la cazuela y déjelo a un lado para preparar la salsa para servir.", "Desmenuce el Stilton en la cazuela y revuelva hasta que se derrita. Sazonar, al gusto, con sal y pimienta negra recién molida y reservar para enfriar.", "Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase cuatro anillos de 10 cm / 4 in en el cocinero y cuélelos con harina.", "Coloque los anillos de los chefs en una bandeja para hornear y llene cada uno con la carne y el relleno de Stilton.", "En una superficie de trabajo enharinada, extienda la masa de hojaldre hasta un espesor de aproximadamente 2.5 cm. Recorta cuatro círculos de masa lo suficientemente grandes como para cubrir los anillos de los cocineros con un poco de saliente.", "Cepille los bordes de la masa con un poco del huevo batido y colóquelo sobre los anillos de los chefs. Prensar la masa para sellar, luego cortar cualquier exceso de pastelería, asegurándose de que no haya espacios entre los anillos de los chefs y la masa. Haga un pequeño orificio en el medio de cada tapa de pastelería para que salga el vapor, luego cepille todo con el huevo batido restante.", "Hornee los pasteles en el horno durante 20-25 minutos, o hasta que la masa esté crujiente y dorada.", "Mientras tanto, coloque el líquido de cocción reservado en una olla limpia y cocine a fuego lento durante 8-10 minutos, o hasta que se reduzca a una consistencia de salsa. Agregue la cucharada restante de mantequilla hasta que se derrita, y la salsa es lisa y brillante. Mantener caliente", "Para el apio y el puré de mostaza, coloque el apio nabo y las papas en recipientes separados de agua fría y llévelos a ebullición. Reduzca a fuego lento y cocine el apionabo durante 15-20 minutos y las papas durante 10-12 minutos, o hasta que los dos estén tiernos. Escurra bien, luego coloque el apionabo y las papas en una sartén y vuelva a colocar sobre el fuego durante unos minutos para eliminar el exceso de humedad.", "Aplaste el apio nabo y las papas, luego bata la mantequilla, la crema y la mostaza hasta que estén bien combinados. Sazone al gusto con sal y pimienta blanca.", "Para la remolacha asada con miel, precaliente el horno a 220C / 425F / Gas 7.", "Mezcle el tomillo, el vinagre, el aceite de oliva y la miel en un tazón hasta que estén bien combinados.", "Usando una pequeña bola de melón o una cuchara pequeña, saque las bolas de remolacha y coloque en el tazón con la mezcla de miel y sazone, al gusto, con sal y pimienta negra recién molida.", "Coloque la remolacha en una bandeja de asar profunda y tueste en el horno durante 15 minutos o hasta que la remolacha esté pegajosa y glaseada.", "Para servir, transfiera los pasteles a un plato con una rebanada de pescado o una espátula. Retire con cuidado los anillos de los cocineros. Con una cuchara, aplaste el apio y el puré de papa al costado. Coloque las bolas de remolacha asadas en miel al costado y sirva con una jarra pequeña de salsa."]}, {"isVegetarian": false, "title": "Bavette de ternera (filete de falda) con puré de hongos Portobello y ajo", "url": "www_bbc_co_uk_food_recipes_beefbavettewithmasha_92174", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 filetes de falda de ternera gruesa de 4 x 250 g / 9 oz", "sal y pimienta negra recién molida", "2 cucharadas de aceite de oliva", "1½ cucharadas de vinagre de vino blanco", "50ml / 2fl oz de brandy", "200ml / 7fl oz de caldo de carne", "2 dientes de ajo, pelados", "1 puñado de hojas frescas de tomillo", "2 cucharaditas de mantequilla", "25g / 1oz de granos de pimienta verde", "100ml / 3½ fl oz crema doble", "3 yemas de huevo de gallinas camperas", "25ml / 1fl oz de vinagre de vino blanco", "2 cucharaditas de agua tibia", "120g / 4oz de mantequilla, derretida", "1 ramita de estragón fresco, solo hojas, finamente picado", "salpicar aceite de oliva", "1kg / 2lb 3oz Maris Piper o papas King Edward", "1 cucharada de mantequilla", "100ml / 3½ fl oz crema doble", "sal y pimienta negra recién molida", "500 g / 17½ oz de hongos Portobello", "50g / 2oz de mantequilla", "2 dientes de ajo, pelados, en rodajas finas", "sal y pimienta negra recién molida", "1 puñado de hojas de tomillo fresco"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la carne, sazone los filetes con sal y pimienta recién molida.", "Caliente una sartén no reactiva hasta que esté caliente, luego agregue el aceite y luego los filetes. Filete los filetes durante 2-3 minutos en ambos lados, o hasta que se doren por todas partes.", "Con cuidado agregue el vinagre de vino blanco a la sartén, agregue la mitad del brandy e incline cuidadosamente la sartén hacia la llama de la olla, para que el alcohol se prenda (Nota: mantenga la ropa y la tela alejados de la llama y no se vaya desesperado). Cuando la llama se haya apagado, agregue el caldo de carne, el ajo y el tomillo. Cocine durante otros 2-3 minutos, luego retire el bistec de la sartén y déjelo a un lado para descansar sobre un plato caliente.", "Regrese la sartén al fuego y agregue la pimienta verde y el brandy restante. Cocine a fuego lento la mezcla durante 8-10 minutos, o hasta que el líquido se haya reducido a una consistencia de salsa. Agregue la crema doble y cocine a fuego lento de nuevo durante otros 6-8 minutos, o hasta que la salsa esté espesa y brillante. Mantenga caliente y vierta en un barco de salsa cuando esté listo para servir.", "Para la salsa bearnesa, coloque las yemas de huevo en un recipiente resistente al calor y agregue el vinagre de vino blanco y agua tibia. Batir para combinar, luego coloque el recipiente sobre una fuente de agua hirviendo a fuego lento (asegúrese de que el fondo del recipiente no toque el agua) y bata continuamente durante 3-4 minutos, o hasta que la mezcla esté pálida y esponjosa y se haya duplicado en volumen.", "Lentamente rocíe en la mantequilla derretida en una corriente fina y constante mientras bate continuamente, hasta que se incorpore toda la mantequilla y la mezcla se espese y se emulsione. Agregue el estragón picado y bata un poco de aceite de oliva. Verter en una salsera cuando esté listo para servir.", "Para el puré, cocine las papas en una sartén de agua hirviendo durante 10-12 minutos, o hasta que estén tiernas. Escurra, devuelva las papas a la sartén y vuelva a colocarlas sobre el fuego durante unos minutos para eliminar el exceso de humedad, luego pase las papas a través de un ricero de patata o macere con un triturador. Batir la mantequilla y la crema hasta que estén bien combinados y sazonar, al gusto, con sal y pimienta negra recién molida.", "Para las setas de ajo, derrita la mantequilla en una sartén hasta que haga espuma, luego agregue los champiñones y fríalos por 2-3 minutos, o hasta que estén dorados y tiernos. Sazonar, al gusto, con sal y pimienta negra recién molida y agregar el ajo y el tomillo. Cocine por un minuto más, o hasta que los champiñones se ablanden.", "Para servir, coloque los filetes en los platos para servir y espolvoréelos junto con los champiñones y el ajo. Sirve con una selección de salsa de pimienta verde o bearnesa."]}, {"isVegetarian": false, "title": "Carne bourguignon", "url": "www_bbc_co_uk_food_recipes_beefbourguignon_5151", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefbourguignon_5151_16x9.jpg", "ingredients": ["1,5 kg / 3lb5 oz de carne de res o filete de estofado, cortado en trozos de 5 cm / 2 in", "3 cucharadas de aceite de oliva", "1 zanahoria grande, pelada y cortada en trozos", "1 cebolla grande, pelada y cortada en trozos", "2 palitos de apio, áspero picado", "2 botellas de vino tinto de Borgoña", "2 ramitas de tomillo fresco", "1 cabeza de ajo, cortado por la mitad horizontalmente", "4 hojas de laurel", "50g / 2oz de mantequilla sin sal", "225 g / 8 oz de pieza entera de tocino ahumado o panceta", "450g / 1lb chalotes, pelados", "2 cucharadas de harina normal", "Setas de castañas 375g / 12oz", "290 ml / ½ litro de caldo de carne fresca", "5 cucharadas de aguardiente", "perejil de flatleaf recién picado"], "serves": "Para 6", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Caliente 1 cucharada de aceite en una olla grande. Agregue la zanahoria, la cebolla y el apio y cocine por 2-3 minutos. Agregue el vino, el tomillo, el ajo y 2 hojas de laurel. Llevar a ebullición y cocine a fuego lento durante 15 minutos. Dejar enfriar.", "Coloque la carne en un tazón grande y vierta sobre el adobo de vino. Cubra y coloque en la nevera durante la noche. Esto se conoce como adobo de cocinero.", "Precalentar el horno a 150C / 300F / Gas2. Escurra la carne del adobo en un colador sobre un recipiente de vidrio. Reserve el adobo y reserve.", "Caliente 25 g / 1 oz de mantequilla y 1 cucharada de aceite en una sartén grande. Agregue el tocino y cocine hasta que estén dorados y dorados. Agregue las chalotas y transfiera a una cazuela grande.", "Calienta 1 cucharada de aceite en una sartén grande. Seque los cubos de carne de la mezcla de adobo con un papel de cocina absorbente. Agregue la mitad de la carne a la sartén y cocine hasta que se dore por todos lados. Retire la carne y transfiérala a la cazuela con tocino, chalotes y vegetales. Repita con la carne restante y agregue a la cacerola.", "Agregue 2-3 cucharadas grandes de la mezcla de adobo reservada para desglasar o eliminar cualquier sedimento de la sartén. Vierta en la cacerola.", "Agregue la harina común, la mezcla de adobo restante y el caldo de carne en la cazuela.", "Llevar a ebullición, tapar y colocar en el horno durante 3-3½ horas o hasta que la carne esté tierna.", "A la mitad de la cocción, caliente el aceite y la mantequilla restante en una sartén grande y cocine los champiñones hasta que estén dorados. Agregue el brandy y cocine por unos minutos.", "Agregue los champiñones a la cazuela, revuelva y regrese al horno el tiempo de cocción restante.", "Servir con papas nuevas, espolvoreado con perejil recién picado y brócoli morado."]}, {"isVegetarian": false, "title": "Carne bourguignon", "url": "www_bbc_co_uk_food_recipes_beefbourguignon_90175", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Filete de chuletón 900g / 2lb, cortado en cubos de 5cm / 2in", "500ml / 17½ fl oz de vino tinto", "1 cucharada de tomillo fresco", "1 hoja de laurel", "1 diente de ajo, picado", "1 cucharada de aceite vegetal", "Tocino tocino 100 g / 3½ oz", "1 cebolla, en rodajas", "1 zanahoria, en rodajas", "sal y pimienta negra recién molida", "Harina normal de 30g / 1oz", "30g / 1oz de puré de tomate", "Juego de 250 ml / 9 fl oz, o caldo de pollo", "50g / 2oz de mantequilla", "16 chalotes pequeños", "300g / 10½ oz champiñones", "puñado de perejil fresco, picado", "arroz, cocinado de acuerdo con las instrucciones del paquete, o papas hervidas"], "serves": "Sirve 4-6", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque la carne, el vino tinto, el tomillo, la hoja de laurel y el ajo en un tazón grande. Cubra y deje marinar en el refrigerador durante al menos dos horas, preferiblemente durante la noche.", "Precalentar el horno a 160 ° C / 320 ° F / Gas 3.", "Caliente el aceite vegetal en una sartén a fuego medio. Agregue las piezas de tocino y fría hasta que estén crujientes y doradas.", "Retire la carne del adobo. Reserve el líquido de adobo para más tarde. Agregue la carne a la sartén y cocine hasta que se dore por todos lados. Retire la carne de la sartén.", "Agregue la cebolla y la zanahoria a la misma sartén y fría por 5-6 minutos, hasta que se ablanden.", "Regrese la carne a la sartén y sazone bien con sal y pimienta negra recién molida.", "Espolvoree con la harina, mezcle bien y cocine por otros dos minutos.", "Agregue el puré de tomate, revuelva para combinar y cocine durante cuatro minutos.", "Agregue el adobo de vino y el juego (o caldo de pollo) y deje que hierva.", "Cubra con una tapa y cocine en el horno durante dos horas.", "Hacia el final del tiempo de cocción, derrita la mitad de la mantequilla en una sartén a fuego lento. Agregue las chalotas y fría por 10-12 minutos, hasta que estén doradas por todas partes.", "En una sartén separada, derrita la mantequilla restante y fría los champiñones hasta que estén dorados por completo.", "Retire la cazuela de res del horno y cuele cuidadosamente la salsa en una cacerola limpia. Reserve la carne y las verduras. Ponga a hervir la salsa y cocine para reducir el volumen a la mitad.", "Devuelva la carne y las verduras reservadas a la sartén de salsa reducida y agregue los chalotes cocidos y los champiñones. Cocine a fuego lento durante tres minutos, revolviendo de vez en cuando.", "Para servir, cuchara porciones iguales de la carne bourguignon en placas calentadas. Adorne con perejil y sirva con arroz o papas hervidas."]}, {"isVegetarian": false, "title": "Ternera bourguignon con burbujas y chillidos", "url": "www_bbc_co_uk_food_recipes_beefbourguignonwithb_73425", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["600g / 1lb¼oz shin beef, picada en trozos grandes", "sal", "pimienta negra recién molida", "2 cucharadas de grasa de pato o ganso", "50 g / 1¾oz de tocino ahumado, cortado en cubitos", "4 dientes de ajo, picados", "18 chalotes, pelados pero abandonados enteros", "2 cebollas en rodajas", "1 cucharada de puré de tomate", "1 bouquet garni, (ramitas de tomillo, romero y perejil de hoja plana)", "12 champiñones cépe pequeños, o champiñones castaños", "Vino de Borgoña 750ml / 26½floz hecho de uvas pinot noir de Francia", "25g / 1oz de mantequilla", "25 g / 1 oz de harina", "500 g / 17½ oz de puré de patatas", "¼ repollo savoy, finamente cortado", "Guisantes 200 g / 7¼ oz", "25g / 1oz de mantequilla", "1 cebolla, en rodajas", "sal", "pimienta negra recién molida", "grasa de pato, aceite o manteca de cerdo para freír"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 150C / 300F / Gas2", "Sazone la espinilla de carne con sal y pimienta.", "Calienta la mitad de la grasa de pato en una cazuela.", "Agregue la carne y fría hasta que esté dorado. Retire la carne, reserve y agregue el resto de la grasa de pato a la cazuela.", "Agregue tocino, ajo, chalotes y cebollas, fría hasta que estén doradas.", "Agregue el puré de tomate, devuelva la carne a la cazuela y agregue el bouquet garni.", "Agregue los champiñones y vierta suficiente vino para cubrir la carne. Cubra y cocine a fuego lento.", "Mueva la mezcla de carne en la cacerola al horno y cocine durante tres horas.", "Cuando la carne esté tierna, use una cuchara ranurada para quitar la carne y los chalotes de la mezcla y colóquelos en un tazón para servir. Mantener caliente", "En el fogón llevar la salsa a fuego lento. Mezcle la harina y la mantequilla y mezcle esto en la mezcla a fuego lento poco a poco.", "Vierta la salsa sobre la carne y sirva.", "Para la burbuja y el chirrido: hierva el repollo y la cebolla en agua con sal durante 20 minutos, luego drene y enfríe.", "Ponga la mantequilla en la papa, asegurándose de que se mantenga bastante seca en textura.", "Mezcle la col, la cebolla y los guisantes y sazone bien.", "Forme la burbuja en tortas y fría en aceite durante diez minutos por cada lado. El exterior debe ser dorado y los pasteles deben mantenerse firmes."]}, {"isVegetarian": false, "title": "Carne de res estofada en cerveza con albóndigas de sebo inglesas clásicas servidas con puré de mantequilla", "url": "www_bbc_co_uk_food_recipes_beefbraisedinbeerwit_79803", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 cucharadas de harina natural, condimentada con sal y pimienta negra recién molida", "1kg / 2lb 3oz bistec estofado, cortado en piezas de 5cm / 2in", "55g / 2oz de mantequilla sin sal", "Tocino rayado ahumado de 150g / 5½ oz, cortado en dados de 1cm / ¼in", "2 cebollas, peladas y en rodajas finas", "1 ramita de tomillo", "1 hoja de laurel", "650ml / 23fl oz Irish stout, como Guinness", "Ciruelas sin piedra de 80 g / 3oz cortadas por la mitad", "80g / 3oz de nueces encurtidas, en rodajas", "4 cucharaditas de vinagre balsámico", "4 cucharaditas de azúcar moreno oscuro", "2 cucharaditas de mostaza Dijon", "500ml / 10½fl oz de caldo de carne", "sal y pimienta negra recién molida", "Harina común 235g / 8oz", "120 g / 4oz de sebo triturado", "Pan rallado blanco fino de 80g / 3oz", "2 cucharaditas de perejil picado", "2 cucharaditas de cebollín, picadas", "sal y pimienta blanca recién molida", "500ml / 17fl oz de caldo de carne", "Patatas harinosas de 1kg / 2¼lb, peladas, lavadas y cortadas en trozos de 2.5cm / 1in", "sal y pimienta blanca molida", "85g / 3oz de mantequilla sin sal", "225 ml / 8 fl oz de leche semidesnatada, calentada"], "serves": "Para 4 personas", "time": {"preparation": "durante la noche", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 120, "preparationMins": 0}, "recommendations": 0, "method": ["Precaliente el horno a 140C / 285F / Gas 1.", "Coloque la harina y la carne en una bolsa de polietileno y agite para cubrir la carne.", "Caliente la mitad de la mantequilla en una cazuela profunda y fría la carne hasta que esté dorada y crujiente por todos lados. Retire la carne y reserve.", "Agregue la mantequilla restante a la misma sartén y fría el tocino hasta que quede crujiente. Agregue las cebollas, el tomillo y las hojas de laurel y cocine hasta que la cebolla se haya ablandado. Agregue la harina restante y revuelva para combinar.", "Vierta la Guinness y revuelva vigorosamente.", "Regrese la carne a la sartén; revuelva para combinar, agregue los ingredientes restantes y lleve a ebullición.", "Cubra la cacerola con una tapa y colóquela en el horno.", "Cocine durante al menos cuatro horas (o preferiblemente durante la noche) hasta que la carne esté tierna.", "Para las albóndigas de sebo, combine los primeros cinco ingredientes y mezcle bien. Trabajar para unir con caldo de res frio, agregando solo lo suficiente para unir todos los ingredientes. Sazone al gusto.", "Calentar el caldo de carne restante en una olla y llevar a ebullición. Forme la pasta en albóndigas de 2cm / ¾in y colóquelos en caldo de carne hirviendo. Cocine hasta que esté suave e hinchado. Esto debería demorar unos 30 minutos.", "Retire del caldo y agregue a su cazuela de res.", "Para el puré de papa, cocine a fuego lento las papas en agua con sal durante 12-15 minutos. Escurra, luego coloque el colador sobre la sartén a fuego lento durante dos minutos para secar las papas.", "Regrese las papas a la cacerola con una pizca de sal y pimienta blanca molida y macere hasta que quede suave.", "Dobla la mantequilla y la leche tibia y bate hasta que se combinen. Verifica el condimento.", "Sirve la carne y las albóndigas con una cucharada de puré de patatas."]}, {"isVegetarian": false, "title": "Hamburguesas de carne", "url": "www_bbc_co_uk_food_recipes_beefburgers_83748", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1kg / 2¼lb de carne picada", "1 cebolla grande, rallada", "3 cucharadas de perejil fresco y tomillo", "sal y pimienta para probar"], "serves": "Sirve 4-6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar la barbacoa a caliente.", "Coloque todos los ingredientes en un tazón grande y mezcle con un tenedor.", "Con las manos húmedas (y limpias), dé forma a la carne en rondas planas de igual profundidad para garantizar una cocción uniforme y completa.", "Cocine en la barbacoa por aproximadamente 5 minutos en cada lado - las hamburguesas deben ser marrones en el medio y en el exterior."]}, {"isVegetarian": false, "title": "Hamburguesa de ternera con rodajas de tomillo y papa", "url": "www_bbc_co_uk_food_recipes_beefburgerwithpepper_88281", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefburgerwithpepper_88281_16x9.jpg", "ingredients": ["1 papa grande, cortada en cuñas", "2 dientes de ajo sin pelar", "2 cucharadas de aceite de oliva", "1 ramita de tomillo fresco, solo hojas", "sal y pimienta negra recién molida", "¼ de cebolla, finamente picada", "150 g / 5½ oz de carne picada", "pizca de copos de chile seco", "dash aceite de oliva", "2 rebanadas de ciabatta o 1 rollo de ciabatta, reducido a la mitad"], "serves": "Sirve 1", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 220C / 200C Fan / Gas 7.", "Para las cuñas, trae una olla de agua con sal a ebullición. Con cuidado, coloque las cuñas en la sartén y deje hervir durante 4 minutos, luego drene bien.", "Coloque las rodajas de papa en una bandeja para hornear con el ajo. Rocíe con aceite de oliva, espolvoree sal, pimienta y el tomillo y tueste durante 30 minutos, o hasta que estén dorados y tiernos.", "Para la hamburguesa, mezcle la cebolla, la carne de res, los copos de chile, la sal y la pimienta en un bol. Con las manos, dé forma a la mezcla en una hamburguesa y frótela con aceite de oliva. Calentar una sartén hasta que se caliente y freír la hamburguesa durante 4-5 minutos en cada lado, o hasta que esté bien cocida.", "Mientras tanto, precalentar la parrilla a fuego alto y a la parrilla la ciabatta hasta que esté crujiente. Ponga la hamburguesa en la ciabatta tostada y cubra con los aderezos deseados. Sirva la hamburguesa con las rodajas de papa al lado."]}, {"isVegetarian": false, "title": "Curry de carne con fideos crujientes", "url": "www_bbc_co_uk_food_recipes_beefcurrywithcrispyn_86429", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 cucharadita de semillas de comino", "1 cucharadita de semillas de cilantro", "1 cucharadita de semillas de hinojo", "1 cucharadita de semillas de fenogreco", "2 vainas de cardamomo, ligeramente trituradas", "1 cucharada de aceite vegetal", "Filete de filete en cubos de 500 g / 1 lb 2 oz", "2 cebollas en rodajas", "2 dientes de ajo, finamente picados", "2 pequeños chiles rojos de ojo de pájaro, finamente picados", "1 x 400 g / 14 oz pueden cortar tomates", "1 cucharada de jengibre fresco rallado", "1 cucharada de cúrcuma", "250ml / 10½fl oz de caldo de carne", "1 paquete de fideos gruesos de arroz, partidos en trozos de 7cm / 3in", "arroz basmati, cocinado según las instrucciones del paquete", "rodajas de limón"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Seque suavemente las especias en una sartén grande a fuego medio durante 2-3 minutos, hasta que estén fragantes y tostadas. Transfiera a una mano de mortero y triture juntos.", "En la misma sartén, caliente el aceite y agregue los trozos de carne. Freír durante 2-3 minutos, revolviendo de vez en cuando, hasta que se dore por todas partes, luego retírelo de la sartén.", "Agregue la cebolla a la sartén. Reduzca el fuego y fríe con cuidado durante 10-12 minutos, hasta que esté suave y dorado.", "Agregue el ajo y los chiles y fría por dos minutos.", "Agregue la mezcla de especias molidas, los tomates, el jengibre y la cúrcuma y deje que hierva.", "Agregue el caldo y vuelva a hervir. Reduzca el fuego y cocine a fuego lento durante 25 minutos, hasta que espese.", "Regrese la carne a la salsa y deje que se caliente.", "Mientras tanto, para los fideos, caliente el aceite en una sartén profunda de fondo grueso hasta que la miga de pan chisporrotee y se ponga marrón cuando se deje caer en ella. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Agregue los fideos al aceite en pequeños lotes y freír durante 1-2 minutos, o hasta que se hinchen y se vuelvan crujientes.", "Con cuidado, retire los fideos cocidos del aceite con una espumadera y escurra sobre papel de cocina.", "Para servir, coloque una cucharada grande de arroz basmati en cada plato y espolvoree el curry sobre o al lado.", "Coloque un puñado de fideos crujientes sobre el curry y sirva con rodajas de limón en el costado."]}]