[{"ingredients": ["aceite vegetal o aceite en aerosol", "200g / 7oz de mantequilla, suavizada", "200 g / 7 oz de azúcar en polvo", "4 huevos de gallinas camperas", "Harina normal 140g / 5oz", "60 g / 2½ oz de cacao en polvo", "pizca de sal", "2 cucharaditas de polvo de hornear", "Cigarillos de chocolate blanco, leche o puré de 400 g / 14 oz (aproximadamente 75-80 en total)", "Mantequilla 250g / 9oz, ablandada", "500g / 1lb 2oz de azúcar glas", "100g / 3½oz de buen chocolate negro (al menos un 70% de sólidos de cacao), derretido y ligeramente enfriado", "flores frescas, para un pastel de bautizo", "fresas o frambuesas, para las niñas", "higos, descuartizados, para los niños"], "method": ["Precaliente el horno a 180 / C / 350F / Gas 4 y forre una lata redonda de 20cm / 8pulg con papel de hornear y cepille o rocíe con aceite.", "Crema la mantequilla y el azúcar en un tazón grande hasta que empiecen a ponerse pálidos. Agregue la mitad de los huevos y la mitad de la harina y mezcle bien. Agregue el resto de los huevos, la harina, el cacao en polvo, la sal y el polvo de hornear y bata durante uno o dos minutos hasta que la mezcla esté uniforme. Mézclalo en la lata preparada y hornea en el horno durante aproximadamente 30-40 minutos, o hasta que una brocheta insertada en el medio salga limpia. Dejar enfriar en la lata.", "Mientras tanto, prepare la crema de mantequilla: coloque la mantequilla y el azúcar glas en un bol y mezcle hasta que la mezcla quede esponjosa. Agregue el chocolate derretido y enfriado y mezcle por otros dos minutos.", "Una vez que el pastel esté completamente frío, quítelo de la lata. Corta con cuidado el plano superior con un cuchillo dentado grande. (¡Come esto como un beneficio del chef!)", "Voltea la tarta boca abajo en una tabla de pastel de 20 cm / 8 pulgadas para que la parte inferior se convierta en una bonita superficie plana. Dividir la torta horizontalmente y unir la parte superior e inferior con una capa de 1cm / ½ pulgada de crema de mantequilla.", "Extienda la mitad de la crema de mantequilla restante en la parte superior y los lados de la torta, haciéndola lo más suave posible. Póngalo en la nevera para que se fije antes de hacer otra capa; esto hace que sea mucho más fácil obtener bordes cuadrados ajustados.", "Suavemente empuje los cigarros verticalmente en los lados de la torta, colocándolos tan rectos como sea posible y asegurándose de que toquen la parte inferior.", "El próximo paso depende de ti; no puedo decirte la mirada con los ojos abiertos que obtendrás cuando entras en una habitación con este pastel terminado. Sirva con una sonrisa satisfecha de sí mismo."], "url": "www_bbc_co_uk_food_recipes_i_cant_believe_you_made_90494", "title": "'No puedo creer que hayas hecho ese' pastel '", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 10-12", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/i_cant_believe_you_made_90494_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Paleta de cerdo ibérico de 200g / 7oz, finamente rebanada", "6 anchoas", "1 cucharada de aceite de oliva", "10 g de hojas de perejil de flatleaf, finamente picadas", "Crotones de 100 g / 3½ oz", "4 tomates negros o rojos, cortados en cuñas delgadas", "3 cebollas de primavera, picadas", "½ chalote, pelado y en rodajas finas", "2 calamares medianos, limpiados, cortados y marcados", "100 g / 3½ oz de chorizo ​​dulce, cortado en cubos", "6 cucharadas de aceite de oliva, preferiblemente español", "2 cucharadas de Moscatel o vinagre de vino blanco", "sal y pimienta negra recién molida", "½ perifollo de racimo, finamente picado, para adornar"], "method": ["Para la papada de cerdo ibérica, coloque las rodajas en cuatro platos y cubra con las anchoas. Rocíe con el aceite de oliva y esparza sobre el perejil y croûtons. Dejar de lado.", "Para la ensalada de calamar, coloque el tomate, la cebolleta y la chalota en un recipiente. Cocine el calamar en una sartén durante 60-90 segundos en cada lado a fuego medio. Sazonar con sal y pimienta, cortar el calamar en anillos de 2cm / ¾ de espesor y reservar. Agregue el chorizo ​​a la sartén con 1 cucharada de aceite de oliva y sude por 30-40 segundos.", "Agregue el calamar y el chorizo ​​al tazón de ensalada de tomate. Mezcle el aceite restante y el vinagre en un tazón pequeño y sazone con sal y pimienta. Vierta el aderezo de aceite sobre la ensalada, revuelva y luego divida la ensalada entre los cuatro platos de papada. Adorne con el perifollo y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_iberian_pork_jowl_with_92104", "title": "Papada de cerdo ibérico con ensalada de calamar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["80g / 2¾oz de sal marina", "40 g / 1½ oz de azúcar en polvo", "tomillo de ramita", "4 x 200g/7oz Iberico pluma", "2 cucharadas de aceite de oliva", "½ manojo de perejil, finamente picado", "¼ manojo de orégano, finamente picado", "1 diente de ajo, aplastado", "1 chile verde, sin semillas y finamente picado", "¼ cucharadita de semillas de comino, trituradas", "¼ cucharadita de pimentón dulce", "½ chalota, finamente picada", "50ml / 2fl oz de vinagre de vino tinto", "100ml / 3½fl oz de aceite de oliva virgen extra", "sal y pimienta negra recién molida", "1 chalote, en rodajas finas", "1 diente de ajo, en rodajas finas", "aceite de oliva", "150g / 5½oz de pimientos del piquillo", "25ml / 1fl oz de vinagre de jerez", "50ml / 2fl oz de caldo de pollo", "50 g / 1¾oz de garbanzos cocidos", "¼ cucharadita de semillas de comino, trituradas", "¼ cucharadita de pimentón dulce", "1 cucharadita de sal", "aceite vegetal, para freír"], "method": ["Para hacer la salmuera, ponga 1 litro / 1¾ de agua y todos los ingredientes en una cacerola y caliente hasta que la sal y el azúcar se disuelvan. Deje que se enfríe, coloque el cerdo en la salmuera, cubra y deje en la nevera durante 2 horas y media. Retirar de la salmuera, enjuagar bien con agua fría y secar.", "Para hacer la vinagreta de hierbas, mezcle todos los ingredientes en un recipiente y sazone con sal y pimienta.", "Para hacer el puré de pimienta, cocine suavemente los chalotes y el ajo en aceite de oliva durante 5 minutos. Agregue los pimientos, seguido del vinagre y el caldo de pollo. Cocine durante 5 minutos y luego rellene en una licuadora. Sazone al gusto con sal y pimienta.", "Para los garbanzos, caliente el aceite en una freidora de grasa profunda o una sartén honda de fondo profundo a 180 ° C, o hasta que la miga de pan chisporrotee y se ponga dorada cuando se la deje caer. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No llene demasiado la bandeja ni la deje desatendida). Fríe los garbanzos por 2 minutos. Mezcle las especias y la sal juntas, escurra los garbanzos y sazone con la sal especiada.", "Engrase ligeramente el cerdo en ambos lados y colóquelo en una plancha caliente. Cocine por 2 minutos, luego voltee y cocine durante 2-3 minutos más.", "Para servir, cortar la carne de cerdo y colocar en un plato grande, cuchara la vinagreta sobre la parte superior y luego agregue una cucharada de puré a un lado. Para terminar, esparza los garbanzos sobre la carne de cerdo."], "url": "www_bbc_co_uk_food_recipes_iberico_pork_pluma_herb_48331", "title": "Iberico pork pluma, herb vinaigrette and piquillo pepper purée", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ onzas de mantequilla, suavizadas", "250g / 9 oz de azúcar granulada", "4 huevos de gallinas camperas", "5 cucharadas de café expreso frío fuerte", "4 cucharadas de esencia de achicoria y café, como Camp", "Harina simple de 650g / 1lb 7oz", "50 g / 1¾oz de cacao en polvo", "2 cucharaditas de bicarbonato de soda", "1 cucharadita de sal", "Crema doble de 1 litro / 1¾ pinta", "1 cucharada de esencia de achicoria y café, como Camp", "125ml / 3½ fl oz de jarabe de jengibre tallo", "42 galletas de café", "3 bolas de tallo de jengibre, en rodajas finas"], "method": ["Para las galletas de café con caja de hielo, coloque la mantequilla y el azúcar en un bol y bata hasta que esté suave y esponjoso, luego agregue los huevos y bata bien.", "Agregue la esencia fría de café y café y mezcle bien. Doble la harina, el cacao, el bicarbonato de soda y la sal y agréguelos para formar una masa firme.", "Presione dentro de un bloque de 2cm / ¾ pulg de espesor, luego envuélvalo en una película adhesiva y colóquelo en la nevera durante una hora para que descanse.", "Precalentar el horno a 180C / 350F / Gas 4.", "Haga rodar la masa a 5 mm / ¼ de grosor, luego apisonar los discos con un cortador de galletas de 7cm / 2¾ pulgadas de diámetro.", "Coloque en una bandeja para hornear y hornee durante 8-10 minutos, o hasta que se haya levantado y firme para tocar.", "Para el pastel, mezcle la crema doble con la esencia de café en un bol hasta que solo contenga picos suaves cuando retire el batidor del bol, luego doble el jarabe de jengibre y la esencia de café.", "Tome un plato grande o un soporte para pasteles y coloque un poco de crema en la base, luego coloque un tarta redonda de 25 cm / 9 pulgadas en la parte superior.", "Vierte dos cucharadas de crema en el medio y extiéndelas a 2 cm / ¾ pulg. Del borde, luego coloca una galleta en el centro y seis alrededor en un círculo. Extienda una capa de crema sobre la parte superior, asegurándose de que los bizcochos aún estén visibles en el lateral.", "Repita el proceso de capas de galletas como ladrillos, hasta que haya agotado toda la crema y todos los bizcochos, terminando con una capa de crema.", "Coloque en la nevera durante la noche, preferiblemente durante 24 horas para que las galletas se ablanden.", "Decora la parte superior de la torta con las rodajas de tallo de jengibre. Servir cortado en rodajas directamente de la nevera."], "url": "www_bbc_co_uk_food_recipes_ice_box_cake_59770", "title": "Pastel de hielo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Sirve 10-14", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Crema doble 250ml / 9fl oz", "4 cucharadas de licor de limoncello", "200g / 7oz de chocolate blanco, finamente picado", "500 g / 1 libra 2 onzas de bayas mixtas congeladas (sin untar)"], "method": ["Ponga la crema doble y dos cucharadas de limoncello en una bandeja de leche, y caliéntelo hasta que esté a punto de hervir, pero no hirviendo realmente.", "Saque la olla del fuego y agregue el chocolate blanco, luego agite la sartén para que quede todo sumergido.", "Saque las bayas del congelador y colóquelas en una sola capa en un plato o placa que tenga un borde pequeño (para que la salsa no gotee más tarde). Espolvoree con las dos cucharadas restantes de limoncello y déjelas durante cinco minutos, tiempo durante el cual puede hacer girar su bandeja de chocolate blanco de vez en cuando para ayudar a que el chocolate se derrita en la crema con limón.", "Usando una espátula de goma, mezcle suavemente la mezcla de crema de chocolate, aún sin calentar, hasta que esté suave, luego viértala sobre las bayas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_iced_berries_with_63709", "title": "Bayas heladas con salsa de chocolate blanco limoncello", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_berries_with_63709_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina de pan blanco fuerte", "2 cucharaditas de sal", "40 g / 1½ oz de azúcar en polvo", "2 saquitos de 7 g de levadura de acción rápida", "40 g / 1½ oz de mantequilla sin sal, ablandada", "150ml / 5fl oz de leche entera", "2 cucharaditas de cardamomo verde molido", "2 cucharaditas de nuez moscada molida", "250ml / 9fl oz de leche entera", "40 g / 1½ oz de azúcar en polvo", "2 yemas de huevo de rango medio", "20g / ¾oz de harina de maíz", "¼ cucharadita de sal marina fina", "1 cucharadita de extracto de almendra", "50ml / 2fl oz crema batida", "300g / 10½oz de guindas (peso escurrido)", "300g / 10½ oz de mermelada de azúcar", "1 cucharada de jugo de limón", "aromatizante de esencia de cereza", "Sabor a esencia de cereza Morello", "1 clara de huevo pasteurizada", "1 cucharada de jugo de limón", "250 g / 9 oz de azúcar glas, cernida", "400 ml / 14 fl oz crema doble", "4 cucharadas de azúcar glas, cernida", "50 g / 1¾oz de almendras troceadas, tostadas", "polvo de cardamomo verde, para quitar el polvo", "azúcar en polvo, para quitar el polvo"], "method": ["Para la masa, coloque la harina en el cuenco de un mezclador independiente equipado con un gancho de masa. Agregue la sal y el azúcar a un lado del tazón y la levadura al otro. Agregue la mantequilla, la leche y 150 ml / 5 fl oz de agua. Mezcle hasta que se forme una masa y amasar en la batidora durante 5 minutos. Cubra el recipiente con una película adhesiva y déjelo en un lugar cálido durante 1 hora o hasta que duplique su tamaño.", "Una vez que la masa ha demostrado, divídala en 2 partes iguales. Aplanar cada pieza de masa y agregar el cardamomo a uno y la nuez moscada a la otra. Amasar para distribuir las especias y eliminar el aire.", "Divida cada pieza de masa en 8 partes iguales. Enrolle la masa de cardamomo en bolas y la masa de nuez moscada en los dedos. Coloque en bandejas para hornear, cubra y deje probar durante 30 minutos.", "Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 5. Hornear el pan durante 10 minutos.", "Para la crema de almendras, caliente la leche y el azúcar en una cacerola. En un recipiente, mezcle las yemas de huevo y la harina de maíz. Poco a poco agregue la leche caliente a la mezcla de huevo revolviendo todo el tiempo. Regrese a la sartén y caliente, revolviendo todo el tiempo, hasta que espese. Retire del fuego y agregue la sal y el extracto de almendra. Cubra la superficie con film transparente y deje que se enfríe por completo.", "Batir la crema hasta que se formen picos suaves, luego doblar en la crema enfriada.", "Para la mermelada de guindas, escurra las cerezas y mézclelas hasta que se peguen en una licuadora. Transfiera a una cacerola y agregue el azúcar y el jugo de limón. Hierva la mezcla hasta que alcance 105C en un termómetro de azúcar. Retirar del fuego y agregar los saborizantes de cereza. Pasa a través de un colador y deja enfriar por completo. Cuando la transferencia de frío a una manga pastelera equipada con una pequeña boquilla simple.", "Para el glaseado real, bata la clara de huevo y el jugo de limón con una cuchara de madera hasta que estén espumosos, luego agrega 3 cucharadas de azúcar glas y bate de nuevo. Siga batiendo y agregue algunas cucharadas de azúcar glas hasta que todo el azúcar glas esté incorporado y tenga una pasta suave (si la formación de hielo es demasiado espesa, agregue un poco de agua para aflojarla). Transfiera a una manga pastelera equipada con una boquilla simple.", "Para la crema de Chantilly, agregue la crema y el azúcar glas a un tazón grande. Batir hasta que se formen picos suaves cuando se quite el batidor. Transfiera a una manga pastelera equipada con una boquilla de estrella grande y déjela en la nevera.", "Para armar el cardamomo y los bollos de almendras, corte los bollos por la mitad horizontalmente y llénelos con la crema de almendras. Pipe la formación de hielo en la parte superior del panecillo, cubra con almendras tostadas, una pizca de polvo de cardamomo y una capa de azúcar glas.", "Para ensamblar la nuez moscada y los dedos de guindas, haga una hendidura profunda en la parte superior de los dedos del pan. Pipe la formación de hielo en ambos lados de las rajas y déjelo para fijar.", "Ponga un poco de mermelada de cereza en el fondo de la hendidura. Coloca la crema cuidadosamente encima y coloca dos tiras de mermelada de cereza a cada lado de la crema."], "url": "www_bbc_co_uk_food_recipes_iced_buns_15490", "title": "Bollos con glaseado de cereza amarga y almendra", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 16 bollos helados", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["500g / 1lb 2oz de harina blanca fuerte", "50 g / 1 oz de azúcar en polvo", "40 g / 1½ oz de mantequilla sin sal, ablandada", "2 huevos de gallinas camperas", "2 x 7 g / ¼ oz de levadura instantánea", "2 cucharaditas de sal", "150ml / 5fl oz de leche caliente", "140ml / 4½fl oz de agua", "200g / 7oz de azúcar glasé", "5 cucharaditas de agua fría", "200ml / 7fl oz crema batida", "100 g / 4 oz de mermelada de fresa", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 220C / 425F / Gas 7.", "Para hacer la masa, coloque todos los ingredientes en un tazón grande, reteniendo un cuarto del agua. Mezcle la mezcla con las manos, luego agregue lentamente el agua restante para formar una masa y amasar en el tazón durante cuatro minutos.", "Convierta la masa en una superficie ligeramente enharinada y amase bien durante 10 minutos o hasta que la masa esté suave y elástica. Regrese la masa al tazón, cubra con una toalla de té húmeda y deje que se levante en un lugar cálido durante una hora.", "Divida la masa en 12 piezas, cada una de aproximadamente 70 g / 2½ oz, luego enrolle en bolas y dé forma a los dedos de aproximadamente 13 cm de largo.", "Coloque los dedos de la masa en una bandeja para hornear engrasada, dejando espacio para que doblen en tamaño, luego déjelos a un lado en un lugar cálido durante 40 minutos. Deben simplemente tocarse cuando hayan resucitado. Hornee en el horno por 10 minutos y déjelos a un lado para que se enfríen.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y revuelva gradualmente en el agua fría para formar una pasta espesa.", "Sumerja la parte superior de los dedos enfriados en la formación de hielo, alisándola con el dedo, luego déjelo reposar sobre una rejilla de alambre.", "Ligeramente batir la crema y ponerla en una bolsa de plástico con una boquilla pequeña. Coloque la mermelada de fresa en otra manga pastelera.", "Cortó los dedos helados horizontalmente, dejando intacto un borde largo. Pipe en una generosa línea de crema batida en el centro de cada dedo, luego una línea más delgada de mermelada. Espolvorea los dedos helados con azúcar glas y sirve."], "url": "www_bbc_co_uk_food_recipes_iced_fingers_34133", "title": "Dedos helados", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 240}, "serves": "Hace 12 bollos", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iced_fingers_34133_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7fl de leche en oz", "Crema doble de 200 ml / 7 fl oz", "1 vaina de vainilla, dividida y sin semillas", "5 huevos de gallinas camperas, solo yemas", "50 g / 1 oz de azúcar en polvo", "1 granizado de menta, hojas recogidas", "3-4 gotas de esencia de menta", "3 huevos de gallinas camperas, solo para blancos", "150 g / 5½ oz de azúcar en polvo", "Crema doble 450ml / 16fl oz", "115g / 4oz de chocolate negro, toscamente rallado", "75g / 2¾oz de azúcar en polvo", "50 g / 1¾oz de avellanas picadas", "115g / 4oz% 20dark% 20chocolate,% 2070 %% 20cocoa% 20solids", "2 cucharadas de azúcar demerara", "3-4 gotas de esencia de menta"], "method": ["Para la crème anglaise, coloque la leche, la crema, la vaina de vainilla y las semillas en una cacerola y deje que hierva.", "Coloque las yemas de huevo y el azúcar impalpable en un tazón, luego vierta sobre la mezcla de leche caliente y bata para combinar.", "Vierta la mezcla en la olla, cocine a fuego lento y cocine hasta que espese, revolviendo todo el tiempo. Retire la sartén del fuego y divida la mezcla - ¼ en un tazón para la crema de avellanas, y ¾ en otro para el parfait de menta.", "Blanquee las hojas de menta en agua hirviendo durante 30 segundos y luego drene y revuelva en agua helada.", "Vierta la ¾ de la crema inglesa en un procesador de alimentos con las hojas de menta y la esencia de menta y mezcle hasta lograr un puré muy fino de color verde pálido. Colar a través de un colador fino en un recipiente limpio y dejar enfriar.", "Para el parfait, engrase una lata de pan con un poco de aceite vegetal y luego forre con dos capas de película adhesiva.", "En un tazón limpio, bate las claras de huevo hasta que formen picos suaves. Incorpora el azúcar para hacer una mezcla de merengue cruda y luego agrégala a la crema de leche con sabor a ajo.", "Coloque la crema en un recipiente limpio y látigo hasta que forme picos suaves. Dobla la crema en la mezcla de menta y dobla el chocolate rallado con mucho cuidado. Vierta la mezcla en la lata de pan revestida y colóquela en el congelador durante al menos cuatro horas hasta que esté firme.", "Para la crema de avellanas, forrar una bandeja para hornear con papel resistente a la grasa. Calentar una sartén a fuego alto hasta que esté caliente. Agregue el azúcar y cocine hasta que el azúcar se haya derretido por completo y esté pegajoso y dorado.", "Agregue las avellanas picadas y revuelva hasta que estén cubiertas con la mezcla de azúcar, luego vierta la mezcla en la bandeja de horno preparada. Dejar de lado hasta que la mezcla se haya endurecido.", "Cuando la mezcla de praliné se haya endurecido, cúbrala con una lámina de película adhesiva y divídala en pequeños trozos con un martillo de toffee o un rodillo, colóquela en un procesador de alimentos y mezcle con un polvo fino. Mezcle en el ¼ reservado de la crème inglaise.", "Para los fragmentos de menta de chocolate, derrita el chocolate en un tazón sobre una fuente de agua hirviendo a fuego lento. Agregue el azúcar demerara y la esencia de menta, luego espolvoree en una bandeja para hornear forrada con silicona o pergamino para hornear y déjelo reposar. Cuando esté listo, divida el chocolate en fragmentos grandes.", "Para servir, corte el parfait en rodajas gruesas y colóquelo en los platos. Ponga un poco de crema de avellana alrededor y luego termine con un trozo de chocolate con menta."], "url": "www_bbc_co_uk_food_recipes_iced_peppermint_and_37509", "title": "Parfait helado de menta y chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6 - 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal, ablandada a temperatura ambiente", "100 g / 3½ oz de azúcar en polvo", "1 huevo mediano de granja, ligeramente golpeado", "Harina normal de 275g / 10oz", "1 cucharadita de extracto de vainilla", "400g / 14oz de azúcar glasé", "3-4 cucharadas de agua", "2-3 gotas de colorantes de alimentos"], "method": ["Precaliente el horno a 190C / 170C Fan / Gas 5. Cubra una bandeja de hornear con papel resistente a la grasa.", "Bata la mantequilla y el azúcar juntos en un tazón hasta que se combinen.", "Batir el huevo y el extracto de vainilla, poco a poco, hasta que estén bien combinados.", "Agregue la harina hasta que la mezcla se una como masa.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 1 cm / ½ pulg.", "Usando cortadores de galletas, corte los bizcochos de la masa y colóquelos cuidadosamente sobre la bandeja para hornear.", "Hornee durante 8-10 minutos, o hasta que estén pálidas doradas. Poner a un lado para endurecer durante 5 minutos, luego enfríe en una rejilla de alambre.", "Para la formación de hielo, tamice el azúcar glas en un tazón grande y agregue suficiente agua para crear una mezcla suave. Agregue el colorante de alimentos.", "Cuidadosamente, extienda el glaseado sobre los bizcochos con un cuchillo y déjelo a un lado hasta que la formación de hielo se endurezca."], "url": "www_bbc_co_uk_food_recipes_icedbiscuits_3054", "title": "Galletas heladas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 24 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedbiscuits_3054_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½ oz de harina de auto crianza", "100g / 3½oz de harina integral", "2 cucharaditas de azúcar en polvo de oro", "1 cucharadita de polvo de hornear", "1 limón, ralladura solamente", "pellizcar canela molida", "pellizcar clavos de tierra", "pizca de anís estrellado", "pellizcar nuez moscada molida", "25 g / 1 oz de sultanas doradas", "25 g / 1 oz de cerezas glace", "125ml / 4fl de leche en oz", "1 huevo de gallinas camperas, golpeado", "100ml / 3½fl oz de yogur natural", "3 cucharadas de miel clara", "75 g / 2½ oz de mantequilla", "300g / 10½oz de azúcar glas", "25ml / 1fl oz de jugo de limón", "25 ml / 1 fl oz de agua", "bolas decorativas de azúcar de plata, para decorar"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Tamiza la harina, la harina integral, el azúcar y el polvo de hornear en un bol.", "Agregue la ralladura de limón, la canela, el clavo de olor, el anís estrellado y la nuez moscada y mezcle bien.", "Agregue las pasas y las cerezas y vuelva a mezclar.", "Coloque la leche, el huevo y el yogur en un recipiente limpio y mezcle bien.", "Coloque la miel y la mantequilla en la sartén a fuego medio y cocine hasta que la mantequilla se haya derretido. Revuelva suavemente para combinar.", "Agregue la mezcla de miel y mantequilla a la mezcla de yogur y huevo y mezcle bien.", "Agregar a los ingredientes secos y doblar juntos hasta que se combinen.", "Coloca la mezcla en cajas de muffins y transfiérelas al horno para hornear durante 20-25 minutos, hasta que estén doradas. Retire del horno y deje enfriar en una rejilla de alambre.", "Para la formación de hielo, coloque el azúcar glas, el jugo de limón y el agua en un tazón y mezcle bien, hasta que quede suave.", "Para servir, extiende la formación de hielo sobre los muffins una vez que se hayan enfriado y decora con bolas de azúcar plateadas."], "url": "www_bbc_co_uk_food_recipes_icedchristmasmuffins_87589", "title": "Magdalenas heladas de Navidad", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Hace 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["aceite vegetal, para engrasar", "400 g / 14 oz de azúcar en polvo", "110ml / 4fl oz de miel clara", "2 cucharadas de glucosa líquida (disponible en la sección de horneado de la mayoría de los supermercados)", "110 ml / 4 fl oz de agua", "1½ cucharadita de bicarbonato de soda", "3 huevos de gallinas camperas, separados", "110ml / 4fl oz de café expreso frío", "150 g / 5 oz de azúcar en polvo", "Crema doble 450ml / 16fl oz", "4 yemas de huevo de gallinas camperas", "40 g / 1½ oz de azúcar en polvo", "150ml / 5fl de leche en oz", "150ml / 5fl oz de crema doble", "1 vaina de vainilla, dividida", "75g / 3oz de chocolate puro, picado", "25g / 1oz de granos de café espresso tostados"], "method": ["Para el panal, forre una bandeja para hornear con papel resistente a la grasa y grasa con aceite vegetal.", "Coloque el azúcar, la miel, la glucosa líquida y el agua en una cacerola y déjela hervir.", "Continúe cocinando hasta que la temperatura alcance los 160 ° C / 320 ° F en un termómetro de azúcar, teniendo cuidado ya que el azúcar a esta temperatura puede ser muy peligroso.", "Retirar del fuego y rápidamente batir en el bicarbonato de soda con una cuchara de madera, revolviendo constantemente.", "Vierta la mezcla en la bandeja de horno forrada. Poner a un lado hasta que esté duro y luego romper en pedazos con las manos.", "Para el parfait, coloca las yemas de huevo, el café y la mitad del azúcar en una sartén pequeña y bate para combinar.", "Coloque a fuego lento y cocine suavemente, revolviendo ocasionalmente, durante aproximadamente diez minutos, o hasta que la mezcla se espese.", "Retire del fuego y vierta a través de un tamiz de metal en un tazón. Batir hasta que la mezcla se enfríe y esté ligera y esponjosa. Dejar de lado.", "En un tazón para mezclar limpio, bata las claras de huevo para formar picos suaves cuando se quita el batidor del tazón. Doble el azúcar restante para hacer una mezcla de merengue cruda.", "Bata la mezcla de merengue en la mezcla de café retirada.", "Coloque la crema en un recipiente aparte. Batir la crema hasta que se formen picos suaves cuando se quite la batidora del bol. Dobla la crema en la mezcla de café.", "Alinee una lata de pan rectangular con película adhesiva. Vierta la mitad de la mezcla de postre en la lata.", "Coloque los pedazos del panal en la parte superior del parfait para cubrir. Vierta el resto del postre helado sobre el panal.", "Toque para asentarse y cubrir con película adhesiva. Coloque en el congelador durante dos horas hasta que se congele solo.", "Para la crema pastelera, coloque las yemas de huevo y el azúcar en un tazón y mezcle hasta que estén bien mezclados.", "Coloque la leche y la crema en una olla.", "Con un cuchillo afilado, raspe las semillas de la vaina de vainilla y agregue a la mezcla de leche. Llevar a ebullición.", "Vierta la leche y la crema caliente sobre los huevos, batiendo todo el tiempo. Vierta la mezcla nuevamente en la cacerola y caliente suavemente, revolviendo ocasionalmente, hasta que la mezcla se espese. Mantener caliente", "Para los granos de café recubiertos de chocolate, alinee una bandeja con papel resistente a la grasa. Coloque el chocolate en un recipiente y colóquelo sobre una fuente de agua hirviendo hasta que se derrita.", "Agregue los granos de café al chocolate y revuelva para cubrir. Vierta en la bandeja forrada y deje enfriar. Rompe en pedazos cuando sea genial.", "Para servir, quite el parfait del congelador 20 minutos antes de servir. Corte rebanadas de 2 cm / of del parfait y colóquelas en el centro de cada plato para servir. Coloque la crema en el borde y espolvoree sobre los granos de café recubiertos de chocolate."], "url": "www_bbc_co_uk_food_recipes_icedcoffeeparfaitwit_88170", "title": "Parfait de café helado y panal con crema de vainilla y granos de café recubiertos de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 limón, ralladura solamente, rallado", "1 cucharada de jugo de limón", "175g / 6oz de harina de auto crianza, tamizada", "1 cucharadita de polvo de hornear de nivel", "175g / 6oz de mantequilla, a temperatura ambiente", "175g / 6oz de azúcar en polvo", "3 huevos", "1 limón jugoso grande, ralladura rallada y jugo solamente", "75g / 3oz de azúcar en polvo", "2 huevos", "50g / 2oz de mantequilla sin sal", "1 limón grande, solo cáscara", "50 g / 2 oz tamizado azúcar glas", "2-3 cucharaditas de jugo de limón"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Mida todos los ingredientes de la torta en un bol y bata, idealmente con un batidor de mano eléctrico, hasta que tenga una consistencia suave y cremosa. Luego, divida la mezcla de manera uniforme entre las dos latas y hornee en el estante central del horno durante aproximadamente 35 minutos o hasta que los centros se sientan elásticos al tocarlos ligeramente con el dedo meñique.", "Mientras los pasteles se cocinan, prepare la cuajada de limón, coloque el azúcar y la ralladura de limón rallado en un bol, bata el jugo de limón junto con los huevos, luego vierta esto sobre el azúcar. A continuación, agregue la mantequilla cortada en trozos pequeños y coloque el recipiente sobre una sartén con agua apenas hirviendo. Revuelva con frecuencia hasta que espese, unos 20 minutos. No tiene que quedarse con eso, solo regrese de vez en cuando para darle un susto.", "Cuando los pasteles estén cocidos, quítelos del horno y después de unos 30 segundos, apáguelos en una rejilla de alambre. Cuando estén absolutamente fríos, y no antes, cuidadosamente corte cada uno horizontalmente en dos con un cuchillo afilado de sierra. Ahora extiende la cuajada espesa para unir las esponjas juntas.", "Para la formación de hielo, comience por eliminar la ralladura del limón: lo mejor es usar un zester para obtener tiras largas y rizadas. A continuación, tamice el azúcar glas en un bol y mezcle gradualmente el jugo de limón hasta que tenga una consistencia suave y líquida.", "Deje reposar la guinda durante 5 minutos antes de extenderla sobre la torta con un cuchillo, casi hasta los bordes, y no se preocupe si se extiende un poco por los lados del pastel. Luego esparza la ralladura de limón sobre la parte superior y déjela durante media hora para que el glaseado se solidifique antes de servir."], "url": "www_bbc_co_uk_food_recipes_icedlemoncurdlayerca_67258", "title": "Torta de capas de requesón helado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icedlemoncurdlayerca_67258_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["60 g / 2¼ oz de mantequilla", "1 cebolla grande, finamente rebanada", "1 repollo rojo (alrededor de 750g-1kg / 1lb 10oz-2lb 4oz), finamente triturado", "1 manzana Bramley grande, pelada, sin corazón y picada", "50ml / 2fl oz de vinagre de vino tinto", "60 g / 2¼ oz de arándanos", "2 cucharadas de azúcar moreno oscuro", "4 cucharadas de jalea de zarza o mermelada (o jalea de grosella)", "3 dientes", "Palito de canela de 5cm / 2in de longitud", "pimienta negra recién molida", "1½ cucharadita de sal", "16 pequeñas chuletas de cordero pequeñas", "Harina normal de 100 g / 3½ oz", "2 huevos de gallinas camperas, golpeados", "100g / 3½ oz de pan blanco fresco", "60 g / 2¼ oz de mantequilla, para freír", "2 cucharadas de aceite vegetal o de colza", "sal y pimienta", "patatas nuevas, hervidas", "botón de mantequilla", "1 cucharadita de perejil recién picado"], "method": ["Para la col lombarda, derrita la mantequilla en una cacerola grande y fría la cebolla hasta que esté suave. Agregue el repollo rojo y cocine por 2 minutos. Agregue la manzana, el vinagre, los arándanos, el azúcar moreno, la jalea de zarzaparrilla, el clavo de olor, la canela y 125ml / 4 fl oz de agua. Sazonar con 20 vueltas de un molinillo de pimienta negro y la sal. Cúbralo con una tapa hermética y cocínelo por 45 minutos, luego verifique el líquido, si se seca, agregue un poco más de agua; si hay mucho líquido en la bandeja, retire la tapa para que el exceso se evapore. Cocine por otros 15 minutos.", "Para el cordero, sazone las chuletas con sal y pimienta. Ponga la harina, los huevos batidos y las migas de pan en recipientes separados poco profundos. Mezcle las chuletas con la harina, luego sumerja el huevo batido y cúbralo con las migas de pan.", "Caliente la mantequilla y el aceite en una sartén grande. Una vez caliente, freír las chuletas hasta que estén doradas por completo y cocidas (alrededor de 7-8 minutos en cada lado).", "Para servir, quita la canela y el clavo del repollo. Sirva la col y las chuletas con papas hervidas recién hechas, enrolladas en mantequilla derretida y espolvoreadas con perejil picado."], "url": "www_bbc_co_uk_food_recipes_icelandic_breaded_lamb_29809", "title": "Tajadas de cordero empanadas islandesas con repollo rojo con especias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/icelandic_breaded_lamb_29809_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["500ml / 17fl de leche en oz", "semillas de vainilla de una vaina de vainilla", "4 yemas de huevo de gallinas camperas, más 1 huevo entero de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "100 g / 3½ oz de azúcar en polvo", "4 claras de huevo de gallinas camperas", "500ml / 17fl de leche en oz", "100 g / 3½ oz de azúcar en polvo"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6.", "Para la crema pastelera, caliente la leche y las semillas de vainilla en una cacerola a fuego medio. Llevar la mezcla a fuego lento y cocinar a fuego lento durante 3 minutos.", "Mientras tanto, en un tazón grande, mezcle las yemas de huevo, el huevo entero y el azúcar hasta que estén pálidos y bien combinados.", "Vierta la leche tibia sobre la mezcla de huevo un poco a la vez, batiendo continuamente.", "Regrese la mezcla de crema a la cacerola y cocine a fuego medio, revolviendo continuamente con una cuchara de madera, durante 5-10 minutos, o hasta que la mezcla se espese lo suficiente como para cubrir la parte posterior de una cuchara. Dejar de lado para enfriar, luego enfriar en la nevera.", "Mientras tanto, para los merengues, espolvoree el azúcar impalpable en una bandeja de horno de lados altos. Cocine el azúcar en el horno durante 4 minutos.", "En un tazón grande, bata las claras de huevo con un batidor eléctrico. Mientras lo bate, vierte poco a poco el azúcar ligeramente caliente, hasta que se haya incorporado a la mezcla y se formen picos rígidos cuando se quite el batidor.", "Llevar la leche a fuego lento a fuego lento en una cacerola.", "Coloque una cuchara para servir debajo del grifo, luego tome 3 cucharadas ovaladas de la mezcla de merengue y suavemente bájelos en la leche tibia. Cueza durante 3-4 minutos en cada lado, o hasta que esté cocido. Retire de la leche con una espumadera y déjela a un lado para escurrir sobre papel de cocina.", "Para el caramelo, derrita el azúcar en 50 ml / 2 fl oz de agua en una cacerola a fuego medio. Mezcle con una cuchara de madera hasta que el azúcar se disuelva en el agua y la mezcla se vuelva de color cobre. Retire del fuego.", "Para servir, cuela la crema fría en tazones. Flote una 'isla' de merengue encima de cada porción de flan. Rocíe un chorrito de caramelo sobre cada uno para terminar."], "url": "www_bbc_co_uk_food_recipes_iles_flottantes_64016", "title": "Islas flotantes", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "Sirve 3", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/iles_flottantes_64016_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["6 claras de huevo de gallinas camperas", "exprimir jugo de limón", "120 g / 4 oz de azúcar en polvo", "1 litro / 1¾fl oz pintas de leche entera, preferiblemente orgánica", "2 cucharaditas de pasta de vainilla", "10 yemas de huevo de gallinas camperas", "Azúcar en polvo 80g / 3oz", "cubos de hielo", "50 ml / 2 fl oz de agua", "100 g / 3½ oz de azúcar en polvo"], "method": ["Para los merengues, bata las claras de huevo y el jugo de limón en un tazón limpio hasta que se formen picos suaves cuando se quita el batidor.", "Agregue el azúcar un tercio a la vez, batiendo después de cada adición, hasta que se formen picos rígidos cuando se quite el batidor.", "Ponga a hervir la leche y la pasta de vainilla en una sartén grande y poco profunda. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento.", "Sumerja 2 cucharadas en agua caliente, luego haga 8 quenelles de la mezcla de merengue, usando las cucharas para darle forma al merengue. Con cuidado, baje cada quenelle de merengue en la leche hirviendo a fuego lento. Cubra la sartén con la tapa y cocine por 7-10 minutos, cuidadosamente girando los merengues a la mitad de la cocción.", "Retire los merengues escalfados de la sartén con una cuchara ranurada y déjelos a un lado para drenarlos en una bandeja pequeña hasta que los necesite. Reserve la leche furtiva y manténgala caliente.", "Para la crema de vainilla, mezcle ligeramente las yemas de huevo y el azúcar impalpable en un tazón, hasta que quede suave.", "Poco a poco agregue la leche caliente a las yemas de huevo, batiendo continuamente, luego regrese la mezcla de crema a la sartén y caliente a fuego medio, revolviendo continuamente con una cuchara de madera, hasta que la crema esté lo suficientemente espesa como para cubrir la parte posterior de la cuchara.", "Vierta la crema pastelera inmediatamente en una fuente grande y colóquela sobre un tazón de cubitos de hielo o agua helada. Revuelva ocasionalmente hasta que la crema se enfríe.", "Cuando la natilla se haya enfriado, transfiéralo a un tazón para servir. Flote los merengues escalfados en la parte superior de la crema refrigerada, luego enfríe en la nevera durante un máximo de 24 horas.", "Para el caramelo, vierta el agua en una sartén de lados rectos, luego agregue el azúcar y cocine a fuego medio, hasta que el azúcar se haya disuelto. Una vez que no queden cristales de azúcar, hierva la mezcla hasta que esté caramelizado hasta obtener un color marrón dorado oscuro.", "Con cuidado sumerja la base de la sartén en un recipiente o sumérjala en agua fría para evitar que el caramelo se siga cocinando.", "Vierta el caramelo sobre los merengues flotantes y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_ilesflottantefaconma_93228", "title": "Camino de las islas flotantes White Mom '", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de semillas de cilantro", "1½ cucharadita de semillas de comino", "1½ cucharadita de hojuelas de chile", "1½ cucharadita de cúrcuma molida", "1 palito de canela, roto en pedazos", "½ cucharadita de semillas de hinojo", "½ cucharadita de pimienta negra agrietada", "½ cucharadita de semillas de fenogreco", "¼ cucharadita de clavo de olor", "1 x 2.5-3kg / 5lb 8oz-6lb 8oz de hombro de cordero (con hueso)", "2 cucharadas de aceite vegetal", "2 cebollas, finamente picadas", "2 chiles verdes largos, divididos por la mitad a lo largo (se eliminan las semillas si se desea)", "4 dientes de ajo, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado, cortado fino", "1 cucharadita de cápsulas de cardamomo, ligeramente trituradas", "8 hojas de curry", "2 cucharadas de pulpa de tamarindo", "1 x 400 g de tomate picado", "1 litro / 1¾ pintas de caldo de carne", "2 cucharadas de hojas de cilantro fresco picado", "2 cucharadas de hojas de menta fresca picada", "sal y pimienta negra recién molida", "Papas de 750g / 1lb 10oz, cortadas en cubos de 3cm / 1¼in", "4 cucharadas de aceite vegetal sin sabor", "1 cebolla, finamente picada", "1 diente de ajo, finamente picado", "1 cucharadita de semillas de mostaza", "1 cucharadita de chile en polvo", "1 cucharadita de cilantro molido", "1 cucharadita de comino molido", "½ cucharadita de cúrcuma molida", "1 x 400 g de tomate picado", "1 cucharada de cilantro fresco picado", "1 cucharada de hojas de menta fresca picadas", "sal y pimienta negra recién molida"], "method": ["Para la mezcla de especias, fría el cilantro y las semillas de comino en una sartén a fuego alto durante 1-2 minutos, o hasta que estén fragantes. Moler a polvo con los ingredientes restantes de la mezcla de especias. Dejar de lado.", "Para el cordero, precaliente el horno a 150C / 130C Fan / Gas 2. Sazone el cordero con sal y pimienta negra recién molida.", "Caliente el aceite en una cazuela grande, a prueba de llamas y con tapa a fuego medio. Agregue el hombro de cordero y espere 1-2 minutos en cada lado, o hasta que se dore por todas partes. Retire de la sartén y reserve.", "Agregue las cebollas y los chiles y fríe durante 4-5 minutos, o hasta que estén blandos y coloreados. Agregue la mezcla de especias, el ajo y el jengibre, revuelva bien, luego fría por otros 1-2 minutos. Agregue las semillas de cardamomo, hojas de curry y pulpa de tamarindo.", "Agregue los tomates picados y el caldo y lleve la mezcla a ebullición. Reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento, luego cubra la cazuela con una tapa.", "Transfiera la cacerola al horno y cocine durante 3-4 horas, o hasta que el cordero esté muy tierno.", "Mientras tanto, para las papas de Bombay, hierva las papas en una sartén de agua con sal durante 12-15 minutos, o hasta que estén tiernas. Escurrir bien.", "Caliente el aceite en una sartén grande a fuego medio. Agregue la cebolla, el ajo, las semillas de mostaza, el chile en polvo, el cilantro molido, el comino molido y la cúrcuma molida y revuelva bien.", "Agregue los tomates picados, revuelva nuevamente, luego traiga la mezcla a fuego lento.", "Agregue las papas cocidas y continúe cocinando durante 4-5 minutos más, o hasta que las papas hayan absorbido parte de la salsa y estén muy tiernas. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregue las hierbas.", "Cuando el hombro de cordero esté cocido, retire la tapa de la cacerola, hilvane el cordero con la salsa y cocine por otros 5 minutos. Sazonar, al gusto, con sal y pimienta negra recién molida, luego agregue las hierbas.", "Para servir, espolvorea un poco del cordero con especias de la India en platos para servir. Sirva un montón de papas de Bombay junto a cada porción."], "url": "www_bbc_co_uk_food_recipes_indian-spiced_lamb_48529", "title": "Paletilla de cordero con especias indias con patatas de Bombay", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian-spiced_lamb_48529_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["½ cucharadita de sal masala", "pellizcar copos de chile rojo seco", "1 cucharada de mantequilla, ablandada", "2 x 100 g / 3½ oz de filetes de caballa ahumada", "2 cucharadas de yogur natural de estilo griego", "1 cucharada de menta fresca picada", "½ lima, solo jugo", "½ pepino, cortado a la mitad longitudinalmente y en rodajas finas", "6 rábanos, toscamente picados", "sal"], "method": ["Para hacer la raita, mezcle el yogur, la menta y un chorrito de jugo de lima en un tazón y sazone con una pizca de sal. Agregue el pepino y los rábanos, cubra y coloque en el refrigerador hasta que esté listo para usar.", "Precaliente la parrilla a lo alto y forre una bandeja de horno con papel de cocina.", "En un tazón pequeño, mezcle el garam masala, el chile y la mantequilla. Extienda la mantequilla especiada sobre la caballa y coloque los filetes en la bandeja de hornear. Grill durante 1 minuto, o hasta que la mantequilla se derrita, sumergiendo las especias en el pescado tibio.", "Sirve la caballa inmediatamente con la raita."], "url": "www_bbc_co_uk_food_recipes_indian-spiced_smoked_54887", "title": "Caballa ahumada con especias indias", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian-spiced_smoked_54887_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4-6 cucharadas de aceite vegetal", "½ hombro de cordero, cortado, deshuesado y cortado en 4 piezas", "2 cucharaditas de semillas de comino", "1 cebolla, pelada y rebanada", "Jengibre fresco de raíz de 2.5cm / 1in, pelado y picado", "2 dientes de ajo, pelados y picados", "1 chile verde, sin semillas, picadas", "2 cucharaditas de sal masala", "1 cucharadita de canela molida", "4 vainas de cardamomo, aplastadas", "2 dientes", "Anís de 2 estrellas (opcional)", "600ml / 20fl oz de caldo de carne marrón (cordero, pollo o ternera)", "sal al gusto", "Jengibre de 2,5 cm / 1 pulgada, pelado y finamente picado", "2 dientes de ajo, pelados y finamente picados", "1 cucharada de aceite vegetal", "100ml / 3½fl oz de yogur natural", "1 lima, cáscara y jugo solamente", "sal y pimienta negra", "1 x 8 hueso costillar de cordero, francés recortado (y cortado en 4 x 2 huesos)", "Papas Charlotte de 300 g / 10½ oz, o papas cerosas, peladas", "1 cucharadita de polvo de comino molido", "1 chile verde, picado (sin semillas, opcional)", "2 dientes de ajo, pelados y finamente picados / rallados", "puñado de cilantro, picado", "sal y pimienta", "Aceite para freír", "mantequilla, para freír", "2 cucharadas de aceite vegetal", "1 cucharadita de semillas de comino", "2 dientes de ajo, pelados y rallados", "Jengibre de 2.5cm / 1in, pelado y rallado", "½ chile verde, sin semillas (opcional), cortado en cubitos finos", "1 cebolla, finamente picada", "1 cucharadita de cúrcuma molida", "sal", "1 berenjena, cortada en trozos", "apretón de jugo de limón", "pequeño puñado de cilantro, picado", "1 manojo pequeño de menta fresca, rallado", "1 cilantro fresco de racimo pequeño, rallado", "½ chile verde, finamente picado", "1 cm / ½ en pieza de jengibre, finamente picado", "1 diente de ajo pequeño, pelado y picado", "1 lima, cáscara y jugo solamente", "1 cucharadita de azúcar en polvo, al gusto", "2 cucharadas de aceite vegetal, para mezclar", "sal y pimienta negra recién molida"], "method": ["Para el hombro de cordero, caliente la mitad del aceite en una sartén grande y dore el hombro del cordero con las semillas de comino hasta que esté bien coloreado. Dejar de lado en un tazón grande.", "Calienta dos cucharadas de aceite en una sartén grande y freír la cebolla en rodajas con el jengibre, el ajo, el chile y todas las especias.", "Agregue el cordero a la sartén y suficiente caldo para cubrir la carne. Coloque una tapa en la sartén y cocine por 2-2 ½ horas, o hasta que esté tierna.", "Para el asador de cordero, haga una pasta mezclando el jengibre y el ajo en un procesador de alimentos. Transfiera a un tazón y mezcle el aceite, el yogur, la ralladura de limón y el jugo de lima. Sazone al gusto con sal y pimienta negra recién molida.", "Cubra los estantes de cordero con la pasta y déjelos marinar durante una hora, o más si el tiempo lo permite. Calienta un horno tandoor.", "Ensarte los estantes de cordero en los pinchos y tueste en el horno tandoor durante 12-15 minutos. Retire con cuidado la carne del horno y déjela reposar antes de tallar. Talla por la mitad para servir.", "Para las tortas de patata con comino, cocine al vapor las papas durante 25 minutos, o hasta que se ablanden. Una vez que esté frío, ralla la mitad de las papas en un tazón y aplasta aproximadamente la mitad restante en un recipiente aparte. Combina ambas texturas de papas.", "Agregue el polvo de comino molido, el chile, el ajo y el cilantro. Sazone al gusto con sal y pimienta negra recién molida. Dale forma a cuatro hamburguesas o tortas usando tus manos.", "Caliente la mantequilla y el aceite en una sartén y fría las tortas de patata de comino hasta que estén ligeramente doradas.", "Para la berenjena, caliente el aceite en una sartén grande y tueste las semillas de comino con el ajo, el jengibre, el chile y la cebolla durante unos minutos hasta que se ablanden.", "Agregue la cúrcuma, sal al gusto y agregue la berenjena y un chorrito de jugo de limón. Calentar durante 2-3 minutos, reducir el fuego y cocinar lentamente durante 15-20 minutos. Agregue el cilantro picado cuando esté listo para servir.", "Para el hombro de cordero, retire el cordero de la sartén y mezcle la salsa hasta que quede suave. Cuele la salsa, vuelva a calentar y sazone al gusto con sal y pimienta. Vuelva a poner el cordero en la salsa para que se caliente antes de servir.", "Para el chutney de menta, mezcle la menta, el cilantro, el chile, el ajo, la ralladura de lima y el jugo en un procesador de alimentos hasta que quede suave. Agregue azúcar en polvo al gusto y un poco de aceite, pulse nuevamente para combinar. Sazone al gusto con sal y pimienta negra recién molida.", "Para servir, sirva la berenjena, las tortas de papa, la chutney a la menta, dos huesos del estante y un trozo de hombro y un poco de salsa en cada plato."], "url": "www_bbc_co_uk_food_recipes_indian_barbecue_rack_of_30534", "title": "Parrilla de cordero indio y cordero jalfrezi", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 cucharadas de semillas de cilantro", "5-6 chiles rojos secos", "4 cucharadas de aceite de girasol", "1 cucharadita de semillas de fenogreco", "2 cebollas blancas grandes, en rodajas", "5 dientes de ajo, triturados y picados", "Jengibre fresco de la raíz 2.5cm / 1in, rallado", "1 cucharadita de chile rojo en polvo", "1 cucharadita de cilantro molido", "800 g / 1 lb 12 oz de pechugas de pollo deshuesadas y sin piel, cortadas en cubos de 2,5 cm / 1 in", "1 x 400 g / 14 oz pueden cortar tomates", "sal de mesa, al gusto", "½ cucharadita de mango en polvo", "1 cucharadita de sal masala", "Harina simple de 450g / 1lb", "100g / 3½oz de harina blanca fuerte", "75g / 2½oz de mantequilla fría sin sal", "½ cucharadita de sal fina", "100 g / 3½ oz de grasa vegetal sólida (como Cookeen o Trex), más extra para engrasar", "1 yema de huevo, batida, para glasear"], "method": ["Engrase una lata de torta Springform de 20 cm / 8 in con grasa vegetal.", "Para el relleno, coloque las semillas de cilantro en una sartén seca pequeña a fuego lento. Mantenga a fuego lento y tueste ligeramente hasta que comiencen a cambiar de color. Una vez hecho esto, coloca las semillas de cilantro en un almirez y mortero y aplástalas en polvo.", "Calentar el aceite en una sartén grande. Agregue las semillas de fenogreco y los chiles enteros y revuelva hasta que se tornen dorados. Agregue las cebollas y cocine hasta que se doren. Agregue el ajo, el jengibre, las semillas de cilantro trituradas, el chile en polvo y el cilantro molido.", "Agregue el pollo y freír a fuego alto durante cinco minutos, o hasta que el pollo comience a colorear. Agregue los tomates picados, cocine durante cinco minutos y luego agregue la sal, el mango en polvo y el garam masala. Cocine por 15 minutos, o hasta que el pollo esté bien cocido. Transferir a la nevera para enfriar. Retire los chiles enteros y deséchelos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer la masa, combine las harinas en un tazón grande. Agregue la mantequilla y, con las yemas de los dedos, frótelo en la harina hasta que se asemeje a pan rallado. En una sartén, caliente 200 ml / 7 fl oz de agua, la sal y la grasa hasta que hierva. Vierta el líquido en la mezcla de harina y mezcle con una cuchara de madera.", "Incline la masa sobre una superficie de trabajo ligeramente enharinada y amase hasta obtener una masa homogénea.", "Trabajando lo más rápido posible, tome dos tercios de la masa y despliegue un círculo grande de masa sobre una superficie ligeramente enharinada. Usando el rodillo para ayudarlo, alinee la lata preparada.", "Vierta el relleno en la lata revestida de bollería. Presione hacia abajo y nivele la superficie.", "Usando la masa restante, extienda una tapa de pastel sobre una superficie de trabajo ligeramente enharinada.", "Cepille los bordes superiores de la masa en la lata con yema de huevo batida y coloque la tapa de la pastelería en la parte superior. Engarce los bordes para sellar y recortar cualquier exceso de masa. Haga un par de hendiduras en la parte superior del pastel para permitir que salga el vapor y cepille la tapa de la masa con la yema de huevo. Use cualquier pastel sobrante para hacer decoraciones para la parte superior del pastel.", "Hornee durante 1 hora o hasta que la parte superior esté dorada. Dejar enfriar en la lata durante 10 minutos, luego retirar de la lata y dejar enfriar completamente en una rejilla de alambre antes de servir."], "url": "www_bbc_co_uk_food_recipes_indian_chicken_pie_73681", "title": "Pastel de pollo indio", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 10", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Cales de 500 g / 1 lb 2 oz (aproximadamente 5-6 limas), cortadas en rodajas", "2 cucharadas de sal marina fina", "1 cucharada de aceite vegetal", "1 cucharada de semillas de mostaza", "4 dientes de ajo, finamente picados", "Jengibre fresco de la raíz de los 5cm / 2in, pelado y cortado fino", "1 cucharada de comino molido", "1 cucharada de cilantro molido", "½ cucharadita de asafétida", "1½ cucharadita de chile en polvo suave", "300g / 10½oz de azúcar moreno claro y suave", "50ml / 2fl oz de vinagre de vino blanco", "Jengibre fresco de la raíz de los 5cm / 2in, rallado", "4 dientes de ajo, aplastados", "1 cucharada de cilantro molido", "2 cucharaditas de comino molido", "1 cucharadita de chile rojo en polvo", "4 cucharadas de hojas y tallos de cilantro fresco picado", "4 cucharadas de harina de gramo", "2 limas, jugo y ralladura finamente rallada", "4 cucharadas de aceite de cacahuete", "8 pequeños cangrejos de caparazón blando", "aceite vegetal, para freír", "sal al gusto"], "method": ["Para el pepinillo de lima, mezcle las rodajas de lima con la sal en un tazón grande. Cubra el recipiente y enfríe en la nevera durante 48 horas, revolviendo ocasionalmente.", "Cuando las limas se hayan curado, caliente el aceite en una sartén grande a fuego alto. Agregue las semillas de mostaza. (Precaución: las semillas de mostaza saldrán, mantendrá los ojos y la cara bien despejados).", "Cuando las semillas de mostaza comienzan a reventar, agregue el ajo y el jengibre y saltee durante 1-2 minutos.", "Agregue el comino, el cilantro, la asafétida y el chile en polvo y saltee durante otros 1-2 minutos, luego agregue el azúcar y continúe cocinando hasta que se derrita.", "Agregue las limas curadas y todos los jugos del tazón a la sartén. Cubra con el vinagre de vino blanco y 200 ml / 7 fl oz de agua fría.", "Llevar el contenido de la sartén a ebullición, luego reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento y cocine a fuego lento durante 1 hora y media hasta que la mezcla se haya espesado y las limas estén muy suaves. Dejar enfriar un poco.", "Mezcle la salmuera de lima enfriada en un procesador de alimentos durante 20 segundos, o hasta que los trozos de lima sean bastante pequeños. Coloque el pepinillo en frascos esterilizados hasta que lo necesite.", "Para el cangrejo, mezcle todos los ingredientes del cangrejo, excepto los cangrejos y el aceite vegetal, en un tazón grande hasta que esté bien combinado como una pasta espesa.", "Agregue los cangrejos y vuelva a mezclar hasta que los cangrejos estén cubiertos con la mezcla picante. Cubra el recipiente y enfríe en la nevera durante al menos dos horas.", "Antes de cocinar, retire los cangrejos del refrigerador y vuelva a la temperatura ambiente.", "Caliente el aceite vegetal en una freidora a 160C / 315F. Alternativamente, caliente el aceite vegetal en una sartén profunda de salsas pesadas hasta que la miga de pan chisporrotee y se ponga marrón cuando la deje caer en ella. (Precaución: el aceite caliente puede ser peligroso. No lo deje sin supervisión).", "Freír los cangrejos con especias (en tandas si es necesario) en el aceite caliente durante 1-2 minutos, o hasta que estén bien cocidos. Retirar del aceite con una cuchara ranurada, luego dejar de lado para escurrir sobre papel de cocina. Sazonar con un poco de sal.", "Sirva los cangrejos de concha blanda especiados con cucharadas de la salmuera de lima."], "url": "www_bbc_co_uk_food_recipes_indian_deep-fried_91443", "title": "Cangrejo de caparazón blando frito indio con pepinillo", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 120}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/indian_deep-fried_91443_16x9.jpg", "isVegetarian": false, "recommendations": 0}]