[{"isVegetarian": true, "title": "palos", "url": "www_bbc_co_uk_food_recipes_baguettes_11543", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baguettes_11543_16x9.jpg", "ingredients": ["250g / 9oz de harina blanca fuerte, más extra para espolvorear", "5g / ¼ oz de sal", "Levadura seca de acción rápida de 5 g / ¼ oz", "30ml / 1fl oz de aceite de oliva, más extra para engrasar", "180ml / 6fl oz de agua"], "serves": "Hace 2 baguettes pequeñas", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Coloque la harina, la sal, la levadura, el aceite de oliva y la mayor parte del agua en un mezclador de alimentos con un gancho de masa, teniendo cuidado de que la levadura no toque la sal hasta que comience a mezclar.", "Comience a mezclar a baja velocidad, agregando gradualmente el resto del agua hasta que tenga una masa suave. Esto debería demorar unos cinco minutos.", "Incline la masa en un recipiente engrasado, cubra y deje la masa para probar durante dos horas.", "Incline la masa sobre una superficie engrasada. Espolvorea tus manos en un poco de harina y divide la masa en dos.", "Retrasa la masa, estira y dobla, y luego enrolla la masa en forma de baguette.", "Coloque en una bandeja de baguette o en una bandeja grande para hornear, cubra y deje probar hasta que haya doblado su tamaño.", "Caliente un plato para asar en el fondo del horno y vierta un poco de agua para crear algo de vapor (esto ayudará a formar la corteza). Precaliente el horno a 220C / 425F / Gas 7 en un horno sin ventilador.", "Justo antes de hornear, barra la parte superior de cada baguette tres veces.", "Hornea las baguettes por 30 minutos. Luego baje la temperatura a 200C / 400G / Gas 6 y cocine durante 10 minutos. Las baguettes horneadas deben ser doradas y tener un ligero brillo para ellas."]}, {"isVegetarian": true, "title": "Tarta de queso irlandesa de crema y chocolate", "url": "www_bbc_co_uk_food_recipes_baileysandchocolatec_72293", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileysandchocolatec_72293_16x9.jpg", "ingredients": ["100 g / 3½ oz de mantequilla", "250g / 8¾oz galletas digestivas, aplastadas", "600g / 1lb 5oz de queso crema", "25ml / 1fl oz Baileys u otro licor de crema irlandés", "100ml / 3½ oz de azúcar glas", "Crema doble de 300ml / 10½oz, batida", "100g / 3½oz de chocolate rallado", "Crema doble de 200ml / 7¼ oz, batida", "cacao en polvo, al polvo"], "serves": "Hace 1", "time": {"preparation": "más de 2 horas", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 130, "preparationMins": 120}, "recommendations": 0, "method": ["Derrita la mantequilla en una sartén y agregue los bizcochos digestivos triturados. Mezcle bien hasta que las galletas hayan absorbido toda la mantequilla.", "Retirar del fuego y presionar en la parte inferior de una lata forrada de 18cm / 7in. Coloque en el refrigerador y deje reposar por una hora.", "Mientras tanto, prepara el relleno. Látigo ligeramente el queso crema y luego batir con la crema irlandesa y el azúcar glasé. Agregue la crema batida y el chocolate rallado. Cuando esté suave, cuchara uniformemente sobre los bizcochos.", "Refrigere y deje reposar durante dos horas más. Una vez que esté listo, quítelo y decórelo con crema batida y cacao en polvo espolvoreado sobre la parte superior. Servir."]}, {"isVegetarian": true, "title": "Alaska horneada", "url": "www_bbc_co_uk_food_recipes_baked_alaska_96104", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Crema doble de 300 ml / ½ pinta", "300 ml / ½ litro de leche", "1 vaina de vainilla (suave y fresca)", "3 yemas de huevo de gallinas camperas", "100 g / 3½ oz de azúcar en polvo", "3 claras de huevo de gallinas camperas", "175g / 6oz de azúcar en polvo", "2-3 cucharadas de mermelada de cereza", "Bizcocho hecho a mano del círculo 20cm / 8in alrededor de los 2.5cm / 1in densamente"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para el helado de vainilla, vierta la crema y la leche en una cacerola de base pesada. Divida la vaina de vainilla a lo largo y raspe las semillas; luego agrega las semillas y la vaina a la sartén. Caliente la mezcla hasta justo debajo del punto de ebullición.", "Retire la sartén del fuego y déjela enfriar durante una hora para permitir que el sabor a vainilla se infunda en la mezcla. Retire la vaina de vainilla y deséchela.", "Batir las yemas de huevo y el azúcar en un bol hasta que estén pálidas y espesas. Bata lentamente alrededor de un cuarto de la mezcla de crema. Vuelva a calentar la mezcla de crema restante hasta que hierva, luego lentamente bátala en la mezcla de huevo.", "Vierta la mezcla de huevo en una cacerola limpia y cocine a fuego lento, revolviendo continuamente hasta que la crema espese lo suficiente como para cubrir la parte posterior de una cuchara, no debe hervir. Vierta la crema pastelera en un recipiente y deje enfriar, luego cubra y deje enfriar en la nevera durante la noche.", "Vierta la crema enfriada en una máquina de helados y revuelva según las instrucciones del fabricante, hasta que quede espeso y suave. Coloque la cuchara en un recipiente congelador y congélelo hasta que lo necesite.", "Para el merengue, bata las claras de huevo en un tazón grande y limpio hasta que se formen picos rígidos cuando se quite el batidor. Bata lentamente el azúcar, batiendo bien entre cada adición. Continúe batiendo hasta que se formen picos brillantes y muy rígidos cuando se quite la batidora.", "Para ensamblar Alaska, distribuya la mermelada sobre el círculo de bizcocho, luego coloque bolas de helado en forma de pirámide en la parte superior, dejando un borde de 1.5 cm / ½ pulgadas. Coloque el merengue sobre el helado, asegurándose de que no haya espacios, y use la parte posterior de una cuchara para hacer un patrón de remolino.", "El Alaska horneado ahora puede congelarse hasta que sea necesario.", "Para cocinar el Alaska al horno, precaliente el horno a 200C / 400F / Gas 6 y hornee por 8-10 minutos, o hasta que se dore por todas partes."]}, {"isVegetarian": false, "title": "Tortilla de desayuno brillante", "url": "www_bbc_co_uk_food_recipes_baileys_breakfast_24338", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baileys_breakfast_24338_16x9.jpg", "ingredients": ["3 huevos de gallinas camperas", "1 cucharada de leche", "1 cucharadita de mantequilla", "1 tomate, finamente picado", "2 cucharadas de queso cheddar rallado", "1 cucharada de perejil fresco finamente picado o 1 cucharadita de perejil seco", "2 lonchas finas de jamón de buena calidad", "sal y pimienta"], "serves": "Sirve 1-2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 10, "cooking": "menos de 10 minutos", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Coge tus huevos y córtalos en un tazón. ¡No los coloques directamente en la sartén ya que debes mezclarlos primero! Agregue una pizca de sal y pimienta a los huevos y agregue la leche.", "Batir los huevos con un tenedor, primero usa el tenedor para romper las yemas de los huevos (esto hace que batir los huevos sea más fácil). Luego, incline el recipiente suavemente y, con un tenedor en un movimiento circular, bata los huevos hasta que las yemas y los blancos se combinen y la mezcla tenga un color uniforme.", "Lleva la sartén a fuego alto y agrega la mantequilla. Vierta la mezcla de huevo y cocine a fuego alto durante 2 minutos, asegurándose de que la mezcla se distribuya uniformemente. Reduce el calor.", "A medida que el huevo comienza a ponerse, use una espátula para empujar el huevo hacia el centro de la tortilla e incline la sartén para que el huevo que gotea llene el espacio. Agregue los tomates y la mayor parte del queso y el perejil. Arregle el jamón en la parte superior.", "Cocine la tortilla durante otro minuto, luego afloje los bordes con una espátula. Deslice la tortilla de la sartén sobre un plato calentado, inclinando la sartén para que la tortilla se pliegue bien en el plato.", "Espolvoree con el queso y el perejil restantes, luego sirva."]}, {"isVegetarian": true, "title": "Alaska al horno con salsa cremosa de chocolate", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_creamy_40265", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["300 g / 10½ oz de azúcar en polvo", "6 claras de huevo de gallinas camperas", "1 pequeña caja de flan de esponja lista para usar, cortada en dos horizontalmente para crear dos discos más delgados (solo se necesita uno en esta receta)", "50ml / 2fl oz Armagnac", "1 x 500g / 1lb 2oz bañera firme helado de vainilla (no soft-scoop)", "200g / 7oz de chocolate puro, toscamente picado", "Crema doble de 200 ml / 7 fl oz"], "serves": "Sirve 8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Para el Alaska al horno, traiga 50 ml / 5 fl oz de agua y el azúcar a ebullición en una cacerola. Mantenga hirviendo hasta que la mezcla alcance 121C en un termómetro de azúcar. (Precaución: el azúcar caliente puede ser peligroso ya que hierve muy rápido. No lo deje desatendido).", "Mientras tanto, bata las claras de huevo en un tazón limpio grande, usando un mezclador independiente o un batidor eléctrico, hasta que se formen picos rígidos cuando se quite el batidor.", "Cuando el azúcar alcanza 121C, retire la sartén del fuego. Con la batidora o la batidora funcionando lentamente, vierta cuidadosamente el jarabe de azúcar en las claras de huevo batidas en una corriente delgada, teniendo cuidado de que el azúcar caliente no golpee los batidores ya que puede salpicar. Continúe batiendo hasta que todo el jarabe se haya incorporado a las claras de huevo y la mezcla esté brillante.", "Continúe batiendo la mezcla de clara de huevo a baja velocidad hasta que se haya enfriado casi por completo (aproximadamente 5 minutos).", "Para la salsa de chocolate, caliente el chocolate con 2 cucharadas de agua en una cacerola a fuego lento. Cuando el chocolate se haya derretido, agrega la mitad de la crema y lleva la mezcla a ebullición, batiendo continuamente.", "Cuando la mezcla esté hirviendo, retire la sartén del fuego y bata la mezcla hasta que quede suave. Agregue la crema restante hasta que esté combinada. Decantar en una jarra de servir y dejar de lado hasta que sea necesario.", "Para armar Alaska al horno, coloque el disco de esponja en un plato de servir a prueba de calor y rocíe el Armagnac por todas partes. Levante la bañera de helado en el centro de la base de esponja y corte el embalaje.", "Extienda la mitad de la mezcla de merengue por todo el helado y la base de esponja con una espátula. Transfiera la mezcla restante de merengue a una manga pastelera con una boquilla estrella y póngala sobre la capa de merengue para decorarla.", "Usando una soplete de cocineros, caliente el merengue por todas partes hasta que se caramelice a un dorado claro. Alternativamente, caliente el horno a su configuración más alta y coloque el Alaska horneado en el horno durante unos segundos.", "Sirva inmediatamente con la salsa de chocolate al lado."]}, {"isVegetarian": true, "title": "Alaska al horno con salsa de chocolate caliente", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_hot_20041", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_alaska_with_hot_20041_16x9.jpg", "ingredients": ["1 litro / 1¾ pintas de helado de vainilla, café o chocolate", "50g / 1¾oz de chocolate negro, en gotas o roto en pedazos", "125g / 4½oz de mantequilla, ablandada, más extra para engrasar", "125 g / 4½ oz de azúcar en polvo", "2 huevos de gallinas camperas, golpeados", "125g / 4½ oz de harina de auto crianza, tamizada", "3 claras de huevo de gallinas camperas", "200 g / 7 oz de azúcar en polvo", "pizca de crema de tártaro", "Crema doble de 200 ml / 7 fl oz", "200 g / 7 oz de chocolate negro, en gotas o picado en trozos", "1-2 cucharadas de ron o brandy (opcional)"], "serves": "Sirve 8-10", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Para la base, alinee el recipiente de budín con dos capas de película adhesiva, dejando suficiente colgando sobre el borde para cubrir los lados del lavabo.", "Coloque el helado en el lavabo (es posible que deba dejar que se ablande durante unos minutos, pero no lo deje derretir) y presione hacia abajo para obtener una superficie lisa, dándole un toque suave para ayudar a eliminar cualquier orificio de ventilación . Cubre la parte superior con la película adhesiva y regrésala al congelador.", "Precalentar el horno a 180 ° C / 350 ° F / Gas 4, unte los lados del molde para pasteles y forrar la base con un disco de pergamino para hornear.", "Coloque el chocolate en un tazón resistente al calor sobre una fuente de agua hirviendo a fuego lento. Dejar hasta que se derrita, revolviendo ocasionalmente, luego retirar del fuego y dejar de lado.", "En un tazón grande o en una batidora eléctrica, bata la mantequilla hasta que esté suave. Agregue el azúcar y bata hasta que la mezcla sea ligera y esponjosa. Poco a poco agregue los huevos a la mezcla de crema de mantequilla, batiendo todo el tiempo.", "Batir el chocolate derretido, luego doble suavemente la harina hasta que se combinen.", "Vierta la mezcla en la lata de torta preparada y hornee durante 25-30 minutos, o hasta que un pincho de madera insertado en el centro de la torta salga limpio.", "Retire la torta del horno y suba la temperatura hasta 220C / 425F / Gas 7 (si cocina el merengue de inmediato).", "Permita que la torta se enfríe en la lata durante 10 minutos, luego afloje los bordes con un cuchillo pequeño y filoso y retire cuidadosamente la torta. Coloque sobre una rejilla de alambre para que se enfríe completamente.", "Para el merengue, en un tazón grande, impecablemente limpio, batir las claras de huevo hasta que formen picos suaves cuando se quita el batidor.", "Agregue la mitad del azúcar impalpable y la crema de tártaro y bata hasta que se formen picos rígidos cuando se quite el batidor y el merengue esté satinado y brillante. Agregue el azúcar restante con una cuchara de metal o una espátula.", "Para la salsa de chocolate, coloque la crema en una cacerola y llévela a ebullición. Agregue el chocolate y revuelva hasta que se derrita, luego agregue el ron o el brandy (si se usa). Guarde a un lado hasta que esté listo para servir (vuelva a calentar la salsa suavemente si es necesario).", "Para ensamblar, una vez que la torta se haya enfriado, colóquela en el medio de una bandeja para hornear (una que esté completamente plana, sin ningún \\\"labio\\\", de modo que la Alaska horneada se pueda quitar fácilmente).", "Saca el helado del congelador. Con la ayuda de la película adhesiva, retire el helado del bol con leche y colóquelo boca abajo sobre la torta, retire toda la película adherida.", "Rápidamente cuchara sobre el merengue, extendiéndolo espeso y en picos sobre el helado y los lados de la torta hasta la bandeja de horno. Puede cocinar el Alaska al horno inmediatamente o puede devolverlo al congelador por hasta una hora (se necesitarán 3-4 minutos adicionales en el horno si se cocina congelado).", "Coloque en el centro del horno caliente durante 3-4 minutos o hasta que el merengue esté en el exterior y dorado.", "Con cuidado, transfiera el Alaska horneado a un plato de servir, usando una espátula humedecida en agua caliente para ayudarlo a deslizarla y empujarla sobre el plato.", "Sirva inmediatamente con la salsa de chocolate."]}, {"isVegetarian": true, "title": "Tarta de queso almendra al horno", "url": "www_bbc_co_uk_food_recipes_baked_almond_cheesecake_31585", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["15 g / ½ oz de mantequilla ablandada, para engrasar", "Galletas crocantes de amaretti de 40g / 1½ oz", "750g / 1lb 10oz de queso ricotta", "150 g / 5½ oz de azúcar en polvo", "6 huevos de gallinas camperas", "100ml / 3½ fl oz crema doble", "1 limón, ralladura solamente", "4 cucharadas de licor de amaretto"], "serves": "Sirve 8-10", "time": {"preparation": "más de 2 horas", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 240, "preparationMins": 120}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase una lata de torta con forma de resorte de 24 cm / 9½ pulgadas con un poco de mantequilla en la base y alrededor de los lados. (Coloque la base de la lata al revés para que sea más fácil quitar la tarta de queso una vez que esté lista).", "Coloque las galletas de amaretti en un procesador de alimentos y mezcle en migas finas. (Si no tiene un procesador de alimentos, coloque los bizcochos en una bolsa de plástico resistente y aplaste con un rodillo). Espolvoree las galletas amaretti en el fondo y los lados del molde para pasteles, inclinándolas y agitándolas para obtener un resultado uniforme. revestimiento. Reserve algunas de las migas para espolvorear en la parte superior de la tarta de queso terminada.", "Escurrir el queso ricotta y poner en un tazón con el azúcar. Usando batidores eléctricos, mezcle hasta que estén bien combinados. Poco a poco agregue los huevos, uno a la vez, batiendo bien entre cada adición.", "Agregue la crema, la ralladura de limón y el licor de amaretto. La mezcla debe ser muy suave y ligera.", "Vierta toda la mezcla de queso lentamente en la lata preparada, comenzando en el medio para evitar perturbar las migas. Coloque una bandeja para hornear y hornee en el centro del horno durante 10 minutos.", "Reduzca la temperatura del horno a 160 ° C / 140 ° Ventilador / Gas 3 y cocínelo durante una hora más, o hasta que la tarta de queso esté recién colocada. No permita que se more demasiado. Si la tarta de queso comienza a dorarse mientras todavía está tambaleante, cubra la lata con un trozo grande de papel de aluminio.", "Cuando la tarta de queso esté lista, apague el horno y abra la puerta ligeramente. Cuña una toalla doblada o una cuchara de madera en la puerta para mantenerla entreabierta y dejar que la tarta de queso se enfríe por completo. Esto llevará de 3 a 4 horas y evitará que la parte superior se agriete. Cuando la torta esté completamente fría, transfiérala a la nevera y déjela enfriar durante al menos 2 horas antes de sacarla de la lata.", "Deslice un cuchillo alrededor de la tarta de queso, teniendo cuidado de retener la mayor cantidad de miga posible, y suelte suavemente de la lata. Deslízate con cuidado de la base de lata a un plato de servir y espolvorea la parte superior con las migas de amaretti reservadas. Servir en cuñas"]}, {"isVegetarian": true, "title": "Alaska al horno con manzanas salteadas", "url": "www_bbc_co_uk_food_recipes_baked_alaska_with_sauted_94738", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125 g / 4½ oz de azúcar en polvo", "4 huevos medianos de granja", "125g / 4½oz de harina natural", "25g / 1oz de mantequilla, derretida", "2 manzanas Bramley, peladas, sin corazón, en rodajas finas", "75g / 2¾oz de mantequilla, derretida", "4 cucharadas de azúcar en polvo", "300 g / 10½ oz de azúcar en polvo", "6 claras de huevo de gallinas camperas", "Calvados 50ml / 2fl oz", "1 x 500g / 1lb 2oz bañera firme helado de vainilla", "75g / 2¾oz de mantequilla sin sal", "2 comiendo manzanas, peladas y rebanadas", "2 cucharadas de aguardiente"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Engrase y forme una lata redonda de pastel de 23 cm / 9 pulg.", "Para la esponja génoise, coloca el azúcar y los huevos en un tazón grande y bate hasta que estén espesos y pálidos. Doble la harina y la mantequilla derretida y vierta en la lata de torta preparada.", "Hornee en el horno durante 20-30 minutos, o hasta que se levante y elástico al tacto. Retirar del horno y reservar para enfriar. Cuando se enfríe lo suficiente como para manipularlo, enciéndalo en una rejilla metálica para que se enfríe por completo.", "Para el puré de manzana, coloca las manzanas, la mantequilla, el azúcar y 2 cucharadas de agua en un recipiente con tapa y cúbrelo. Colocar a fuego medio y llevar a fuego lento. Cocine por 3-4 minutos hasta que las manzanas se hayan vuelto livianas y suavizadas. Batir las manzanas hasta obtener un puré suave, luego reservar para enfriar.", "Para Alaska horneada, lleve 50 ml / 2 fl oz de agua y el azúcar impalpable hasta que hierva en una cacerola (PRECAUCIÓN: el azúcar caliente puede ser peligroso ya que hierve muy rápido. No lo deje desatendido).", "Mientras tanto, bata las claras de huevo en un tazón limpio grande, usando un mezclador independiente o un batidor eléctrico, hasta que se formen picos rígidos cuando se quite el batidor.", "Cuando el azúcar alcance 121C en un termómetro de azúcar, retire la sartén del fuego. Con la batidora o la batidora funcionando lentamente, vierta cuidadosamente el jarabe de azúcar en las claras de huevo batidas en una corriente delgada, teniendo cuidado de que el azúcar caliente no golpee los batidores ya que puede salpicar. Continúe batiendo hasta que todo el jarabe se haya incorporado a las claras de huevo y la mezcla esté brillante. Continúe batiendo la mezcla de clara de huevo a baja velocidad hasta que se haya enfriado casi por completo (aproximadamente 5 minutos).", "Corta un círculo de esponja con un plato o un cortador. Coloque el círculo de esponja en un plato de servir a prueba de calor y rocíe los calvados por todas partes. Vierta el puré de manzana sobre la esponja.", "Forma el helado en el centro de la base de esponja. Extiende la mitad de la mezcla de merengue por toda la base de helado y esponja con una espátula, asegurándote de que no haya espacios vacíos. Transfiera la mezcla de merengue restante a una manga pastelera equipada con una boquilla estrella y póngala sobre la parte superior de la capa de merengue para decorar.", "Usando una soplete de cocineros, caliente el merengue por todas partes hasta que se caramelice a un dorado claro. Alternativamente, caliente el horno a su configuración más alta y coloque el Alaska horneado en el horno durante unos minutos.", "Para las manzanas salteadas, caliente una sartén mediana y agregue la mantequilla, una vez caliente agregue las manzanas y cocine hasta que estén doradas. Termine con el brandy y reduzca hasta que la mayoría del líquido se haya evaporado.", "Coloque el Alaska al horno en un plato y sirva las manzanas salteadas al lado."]}, {"isVegetarian": true, "title": "Manzanas al horno en soufflé de sémola", "url": "www_bbc_co_uk_food_recipes_baked_apples_in_a_74612", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["60 g / 2¼ oz de mantequilla sin sal", "4 manzanas, como Blenheim Orange o Chivers Delight, tallos intactos", "60g / 2¼ oz de azúcar en polvo", "20 g / ¾oz de mantequilla sin sal", "100 g / 3½ oz de azúcar en polvo, más extra para rociar", "500ml / 18fl oz de leche entera", "2 gotas de extracto de vainilla", "Sémola de 70 g / 2½ oz", "Sultanas 70 g / 2½ oz", "1 cucharada de calvados (opcional)", "4 huevos medianos de campo abierto, separados", "8 gotas de jugo de limón", "azúcar en polvo"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para las manzanas horneadas, precaliente el horno a 170C / 150C Fan / Gas 3½. Engrase una bandeja para hornear con un poco de mantequilla.", "Derretir la mantequilla. Cepille las manzanas con la mantequilla derretida y agregue el azúcar impalpable para cubrir todo. Coloque en la bandeja engrasada y hornee en el horno durante 25-30 minutos, hasta que estén casi tiernos y aún manteniendo su forma. Dejar de lado.", "Para el soufflé, precaliente el horno a 190C / 170C Fan / Gas 5.", "Derrita 10 g / ¼ onza de mantequilla. Engrase la fuente para hornear con la mantequilla derretida, luego espolvoree con 20 g / ¾ oz de azúcar. Limpie el borde del plato con un paño húmedo, esto evitará que el soufflé se adhiera al borde y le permitirá subir de manera uniforme.", "Verter la leche en una cacerola, agregar la vainilla y llevar a ebullición. Baje el fuego y agregue 60 g / 2¼ oz de azúcar, la sémola, sultanas y calvados (si se usa). Cocine a fuego lento durante 3 minutos, o hasta que espese, batiendo constantemente para mantenerlo suave. Transfiera a un tazón grande, espolvoree un poco de azúcar para evitar que se forme una costra y deje que la mezcla se enfríe un poco, durante 2-3 minutos.", "En un tazón limpio, bata las claras de huevo con el jugo de limón hasta que se formen picos suaves y luego, lentamente, agregue el azúcar impalpable restante de 20 g / ¾ oz, batiendo constantemente. Continúe batiendo hasta que se formen picos rígidos cuando se quite el batidor.", "Mezcle las yemas de huevo en la mezcla de leche tibia, luego batir rápidamente en un tercio de las claras de huevo batidas. Con cuidado, dobla las claras de huevo restantes con una espátula o cuchara de metal grande. Mientras pliega las claras de huevo, corte delicadamente y levante la mezcla para asegurarse de que haya una pérdida mínima de volumen y ligereza.", "Vierta la mezcla en la fuente para hornear preparada y coloque las manzanas horneadas en ella. Ponga un trozo de mantequilla encima de cada manzana y espolvoree el azúcar impalpable uniformemente sobre la superficie del pudin. Hornee durante 25 minutos o hasta que el soufflé se haya levantado y dorado. Espolvorear con azúcar glas y servir."]}, {"isVegetarian": false, "title": "Sopa de frijoles horneados", "url": "www_bbc_co_uk_food_recipes_baked_bean_soup_08513", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["Frijoles borlotti enlatados 60g / 2½, escurridos y enjuagados", "1 tallo de apio, cortado, picado", "1 cebolla de primavera, cortada, rebanada", "50g / 2oz de tocino cocido, picado", "1 diente de ajo, pelado y aplastado", "pizca de copos de chile seco", "Puré de tomate 25 g / 1 oz", "acción de pellizco o polvo de caldo", "250ml / 9fl oz de agua"], "serves": "Rinde 2 cuencos pequeños", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Coloque los frijoles Borlotti en un plato con tapa para horno y aplane con la parte posterior de una cuchara para aflojar las pieles. Agregue el apio, la cebolla tierna, las piezas de tocino y el ajo. Agregue los copos de chile y el puré de tomate.", "Vierta sobre el agua, agregue el caldo en polvo o el caldo y revuelva hasta que esté bien combinado. Cubra el plato con la tapa.", "Transfiera el plato al horno y cocine durante 25-30 minutos, o hasta que la sopa se espese. Revuelva bien antes de servir en tazones de sopa con pan y mantequilla en el lado, si lo desea."]}, {"isVegetarian": false, "title": "Frijoles al horno con burbuja y chuletas hash chirridos", "url": "www_bbc_co_uk_food_recipes_baked_beans_with_bubble_72371", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_beans_with_bubble_72371_16x9.jpg", "ingredients": ["600g / 1lb 5oz harinas de papa", "2-3 cucharadas de crema doble", "30g / 1oz de mantequilla sin sal", "Tocino de 200 g / 7 oz, en cubos", "1 gran manojo de tomillo fresco", "Col de col rizada de 300 g / 10½oz, finamente triturada", "1 perejil grande de hoja plana, toscamente picado", "3-4 ramitas de orégano, hojas recogidas", "1 cucharada de mostaza integral", "aceite de girasol para freír", "sal y pimienta negra recién molida", "30g / 1oz de porcini secos", "1 cucharada de aceite de girasol", "2 cucharadas de mantequilla sin sal", "400g / 14oz de panceta ahumada, en cubos", "10 ramitas de tomillo fresco", "2 hojas frescas de laurel", "3 ramitas de romero fresco", "1 cebolla blanca grande, finamente picada", "1 zanahoria grande, pelada y finamente picada", "2 palitos de apio, finamente picados", "3 dientes de ajo, aplastados", "1 ramita de canela", "300ml / 10fl oz de vino tinto", "2 cucharadas de puré de tomate", "1 cucharada de pasta de umami", "50g / 1¾oz de azúcar moreno claro", "500ml / 18fl oz de caldo de carne fresca", "200ml / 7fl oz pasados", "1 cucharada de pimentón ahumado", "400 g de frijoles pinto", "400 g de alubias de estaño", "gran puñado de perejil fresco de hoja plana, más o menos picado", "3 ramitas de orégano, hojas recogidas", "sal y pimienta negra recién molida"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Para hacer los hash browns, ponga a hervir un sartén grande de agua con sal y cocine las papas durante 15-20 minutos, o hasta que estén tiernas. Escurrir y mascar con la crema. Sazonar y apartar.", "Coloque una sartén a fuego medio y agregue la mantequilla. Freír la panceta y el tomillo hasta que estén crujientes. Retirar con una espumadera y agregar al puré.", "Agregue el repollo a la misma sartén con un poco de agua, cubra y cocine por 2-3 minutos, o hasta que la col esté tierna. Revuelva en el puré con las hierbas y la mostaza. Sazonar, dejar enfriar completamente y luego refrigerar.", "Mientras tanto, para hacer los frijoles, coloque los champiñones en un recipiente y cúbralos con agua hirviendo para rehidratar. Escurrir y picar finamente.", "Coloque una sartén grande a fuego medio con el aceite y la mantequilla. Freír la panceta, el tomillo, las hojas de laurel, la pimienta y el romero hasta que se doren y empiecen a crujir. Retire con una espumadera y deséchela. Agregue la cebolla, la zanahoria y el apio a la sartén y fría por 10 minutos, o hasta que estén blandos. Agregue los champiñones, ajo y canela durante 1 minuto. Agregue el vino tinto y cocine a fuego lento hasta que se reduzca a la mitad. Agregue el puré de tomate, la pasta de umami, el azúcar, el caldo y la passata y deje hervir hasta que se reduzca a la mitad nuevamente. Agregue el pimentón y los frijoles y caliente.", "Divida la mezcla de papa enfriada en 10 pedazos iguales y déle forma a las hamburguesas.", "Caliente una capa de aceite de 1 cm de profundidad en una sartén antiadherente a fuego alto y fría las papas fritas durante 2-3 minutos por cada lado, o hasta que estén doradas y bien calientes (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje sin vigilancia .).", "Revuelva las hierbas frescas a través de los frijoles, retire la ramita de canela y sirva con los papas fritos."]}, {"isVegetarian": true, "title": "Arroz con grosella negra al horno", "url": "www_bbc_co_uk_food_recipes_baked_blackcurrant_rice_06422", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["250ml / 8fl oz de jugo de manzana", "50g / 2oz de arroz arborio", "40 g / 1½ oz de grosellas frescas", "2 cucharadas de azúcar", "½ cucharadita de extracto de vainilla"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Antes de cocinar, lávese las manos y colóquese un delantal. Pesar o medir todos los ingredientes. Pídale a un adulto que precaliente el horno a 220C / 425F / Gas 7.", "Vierta el jugo en el plato refractario, luego agregue el arroz.", "Prepare las grosellas negras pellizcando los tallos leñosos antes de agregarlos a la fuente del horno.", "Agregue el azúcar y el extracto de vainilla. Revuelva la mezcla y ponga la tapa. Coloque en una bandeja para hornear.", "Tendrá que pedirle a un adulto que lo ayude con esta parte. Cocine durante 20 minutos y luego déjela reposar durante al menos 10 minutos con la tapa puesta (el arroz continuará cocinando). Cuando el arroz se haya enfriado un poco, ¡puedes comerlo!"]}, {"isVegetarian": true, "title": "Tarta de queso de arándanos al horno con compota de arándanos", "url": "www_bbc_co_uk_food_recipes_baked_blueberry_91786", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150 g / 5½ oz de mantequilla, derretida, más extra para engrasar", "Galletas digestivas de 300 g / 10½ oz, aplastadas", "1 vaina de vainilla, semillas raspadas", "1 limón, ralladura y jugo", "200 g / 7 oz de azúcar en polvo", "50g / 1¾oz de harina de maíz", "850g / 1lb 4oz de queso crema con toda su grasa", "375 ml / 13 fl oz crema doble", "4 huevos grandes de gallinas camperas", "250 g / 9 oz de arándanos", "250 g / 7 oz de arándanos", "100 g / 3½ oz de azúcar en polvo"], "serves": "Sirve 6-8", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "más de 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Engrase y forre una lata de torta con forma de resorte de 23 cm / 9 in con papel para hornear.", "Para la tarta de queso al horno de arándanos, derrita la mantequilla en una cacerola mediana y agregue los bizcochos triturados y mezcle.", "Incline en la lata preparada y presione las migajas hacia abajo firmemente y uniformemente para formar una costra inferior. Hornea durante 10 minutos, luego deja reposar para que se enfríe por completo.", "Coloque las semillas de vainilla, la ralladura de limón y el jugo, el azúcar impalpable, la harina de maíz, el queso crema y la crema en un tazón grande de vidrio y mezcle.", "Agregue los huevos batiendo continuamente hasta que la mezcla esté suave, luego agregue los arándanos y revuelva con cuidado.", "Vierta sobre la base horneada y golpee ligeramente la lata contra la superficie de trabajo para colocar la mezcla en la lata. Envuelva la parte exterior de la lata en doble espesor de papel de aluminio si le preocupa la estanqueidad del estaño.", "Coloque la torta en una lata para asar profunda que contenga 2 cm / 1 en agua caliente.", "Hornee en el horno durante 1¼-1½ horas o hasta que la tarta de queso esté dorada y recién colocada.", "Apague el fuego en el horno y deje la torta en el horno durante al menos dos horas o preferiblemente durante la noche.", "Para la compota de arándanos, coloque los arándanos y el azúcar en una cacerola y cocine hasta que la salsa se espese.", "Sirva la tarta de queso fría en rodajas con la compota de arándanos."]}, {"isVegetarian": true, "title": "Manzana Bramley al horno con crema especiada y granizado de manzana", "url": "www_bbc_co_uk_food_recipes_baked_bramley_apple_with_15070", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 manzanas Bramley (o 125 ml / 4 fl oz jugo de manzana si no tienes un exprimidor)", "azúcar al gusto", "2 manzanas Bramley, peladas, sin corazón y cortadas por la mitad", "100 g / 3½ oz de mantequilla", "50g / 1¾oz demerara azúcar", "110 g / 3¾oz pasas", "50ml / 1¾fl oz de crema doble", "110g / 3½oz de azúcar morena suave", "5 g de especias mixtas molidas", "1 limón, ralladura solamente", "1 naranja, solo ralladura", "Leche 250ml / 9fl oz", "250ml / 9fl oz crema", "50g / 1¾oz de agujas frescas de pino abeto de Douglas", "200g / 7oz de yema de huevo pasteurizada, o yemas de huevo frescas", "80g / 2¾oz de azúcar en polvo"], "serves": "Para 4 personas", "time": {"preparation": "más de 2 horas", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 180, "preparationMins": 120}, "recommendations": 0, "method": ["Para el granizado de manzana, exprima las manzanas con un exprimidor (o, alternativamente, use jugo de manzana comprado). Necesitará 125ml / 4fl oz de jugo de manzana. Agregue un poco de azúcar si está demasiado agrio, luego cuele a través de un tamiz de metal fino en una tina freezable. Congelar hasta que esté completamente congelado.", "Para las manzanas horneadas, precaliente el horno a 240C / 475F / Gas 9.", "Use una brocha de pastelería para cubrir las manzanas con un poco de mantequilla y espolvorear sobre el azúcar demerara. Dejar de lado hasta que sea necesario.", "Coloque los ingredientes horneados restantes de la manzana, excepto la mezcla de especias y zumos, en una sartén. Llevar a ebullición y cocine a fuego lento durante dos minutos. Retire del fuego y agregue la especia y la ralladura mezcladas.", "Divida la mezcla entre cuatro ollas o moldes pequeños a prueba de horno y cubra con las manzanas mitades. Traslade al horno y hornee por 10 minutos.", "Reduzca la temperatura del horno a 160 ° C / 325 ° F / Gas 3 y cocine hasta que esté blanda (aproximadamente 10 minutos), luego reserve.", "Para la crema de pino, en una sartén llevar la leche, la crema y las agujas de pino hasta el punto de ebullición. Apague el fuego y déjelo a un lado durante 30 minutos para infundir.", "Cuando la mezcla se haya infundido, vuelva a hervir lentamente.", "Batir las yemas de huevo y el azúcar en un tazón grande y resistente al calor hasta que estén pálidas.", "Cuando la leche infundida esté hirviendo, apague el fuego. Viértalo gradualmente, en una corriente constante, en la mezcla de yema de huevo, batiendo constantemente. Siga batiendo hasta que la mezcla se haya enfriado un poco, luego cuele a través de un tamiz de metal fino en una olla limpia y manténgalo caliente.", "Cuando esté listo para servir, raspe el jugo congelado con el dorso de una cuchara para formar un granizado.", "Para servir, divida la crema entre cuatro tazones y coloque una manzana horneada encima y espolvoree sobre el granizado. Servir a la vez"]}, {"isVegetarian": false, "title": "Burrito al horno", "url": "www_bbc_co_uk_food_recipes_baked_burrito_04690", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_burrito_04690_16x9.jpg", "ingredients": ["1 cebolla pequeña", "aceite para cocinar", "600g / 1lb 5oz pechuga de pavo o muslo sin piel y sin hueso", "3 cucharaditas de condimentos mexicanos, como el condimento suave de taco", "2 tomates, cortados a la mitad", "200g de estaño de maíz dulce, escurrido", "200g / 7oz de queso rallado, como el Cheddar", "4 envolturas de tortilla blandas grandes", "4 cucharadas de yogur natural, para servir"], "serves": "Para 4 personas", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 200C / 180C Fan / Gas 4.", "Pele y corte la cebolla aproximadamente. Caliente una sartén grande a fuego medio, luego agregue una pizca de aceite y la cebolla. Cocine por 7-10 minutos, o hasta que esté suave y translúcido, pero no marrón. Reduce el calor si la cebolla comienza a colorear.", "Cortar la carne de pavo en cubos de 2½cm / 1in y agregarlos y el condimento mexicano a la cebolla. Cocine por 10 minutos, revolviendo de vez en cuando, o hasta que el pavo esté bien cocido y sin signos de jugos rosados ​​cuando se corta en el cubo más grande.", "Rallar los lados cortados de los tomates en la sartén, usando un rallador de queso, y revuelva. Deseche la piel una vez que la carne se ralla. Aumente el fuego a medio-alto y cocine por 3-4 minutos, o hasta que la mezcla de tomate se espese y cubra el pavo. Agregue el maíz dulce y revuelva.", "Coloque las envolturas de tortilla en una tabla de cortar y coloque la mezcla de carne en el centro de las envolturas. Espolvorear con el queso rallado. Doble los lados de las envolturas sobre el relleno, luego enrolle las envolturas desde la parte inferior hacia la parte superior para encerrar por completo el relleno.", "Coloque las envolturas, dobladas hacia abajo sobre una bandeja para hornear. Pon un poco de aceite en tu mano y frótalo suavemente sobre las envolturas. Coloque en el horno y hornee por 7 minutos, luego dé vuelta las envolturas y hornee por otros 5 minutos, o hasta que estén doradas y crujientes por todas partes.", "Sirva cada burrito con una cucharada de yogur en un lado para mojarlo."]}, {"isVegetarian": true, "title": "Apio de pavo al horno y ensalada de huevo de pato crujiente", "url": "www_bbc_co_uk_food_recipes_baked_celeriac_and_74227", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 huevos de pato de gallinas camperas", "Harina de 115g / 4oz", "2 huevos de gallinas camperas, ligeramente golpeados", "115g / 4oz de pan rallado", "1 apio nabo medio, pelado", "sal y pimienta negra recién molida", "1 cucharada de aceite vegetal", "50g / 2oz de mantequilla", "1 ramita de tomillo", "3 cucharadas de mayonesa", "½ limón, solo jugo", "3 cucharadas de aceite de oliva virgen extra", "1 cucharadita de trufa rallada", "1 puñado de hojas de apio", "1 puñado de berros, hojas recogidas", "1 trufa fresca, finamente afeitada"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Poner a hervir con agua salada una sartén. Baje los huevos de pato con una espumadera y hierva durante seis minutos. Escurra los huevos y colóquelos en agua helada durante 30 minutos.", "Coloque la harina en un recipiente grande y poco profundo, los huevos batidos en otro recipiente y las migajas de pan en un tercer recipiente.", "Pelar los huevos de pato y enrollarlos en harina, luego los huevos batidos y finalmente en las migas de pan. Colóquelos en una bandeja para hornear y déjelos a un lado, tapados, en la nevera.", "Precalentar el horno a 180C / 350F / Gas 4.", "Sazone todo el apio con sal y pimienta.", "Coloque una sartén resistente a prueba de horno a fuego medio. Agregue el aceite vegetal y luego fría el apio nabo suavemente hasta que se dore por todas partes. Esto tomará aproximadamente 30 minutos. (Necesitará equilibrar el apionabo en el lado de la sartén para colorearlo por todos lados).", "Cuando el apionabo esté dorado, agregue la mantequilla y la ramita de tomillo. Coloque el apionabo en el horno y hornee durante 20-30 minutos, rociando el apionabo con la mantequilla 2-3 veces, o hasta que esté suave y cocido. Dejar de lado para enfriar.", "Cuando esté lo suficientemente frío, corte el apionabo muy finamente.", "Finamente juliana unas rodajas de apio nabo y mezclar con la mayonesa.", "Batir el jugo de limón, el aceite de oliva y la trufa rallada junto con una pizca de sal y pimienta negra para hacer un aderezo.", "Viste las rebanadas de apio nabo con el aderezo de trufa y una pizca de sal marina.", "Caliente una freidora a 190C / 375F o coloque suficiente aceite en una cacerola grande para llegar a la mitad de la sartén y caliente hasta que el cubo de pan caiga en el aceite y se ponga dorado. (PRECAUCIÓN: el aceite caliente puede ser peligroso. No lo deje desatendido).", "Freír el huevo directamente de la nevera durante un minuto o hasta que el pan rallado esté dorado. Retire el huevo del aceite con una espumadera y déjelo a un lado para drenarlo sobre papel de cocina.", "Para servir, divida las rebanadas de apio entre cuatro platos para servir, organícelos para obtener altura y mostrar la textura.", "Coloque una cucharada del apionabo finamente cortado en mayonesa (remoulade) en el centro de cada plato.", "Corte la parte superior de cada huevo para revelar la yema líquida y coloque el huevo encima del apionabo.", "Esparce las hojas de apio y berros y las rodajas de trufa sobre el plato y sirve."]}, {"isVegetarian": true, "title": "Tarta de queso al horno con arándanos", "url": "www_bbc_co_uk_food_recipes_baked_cheesecake_with_97326", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["75g / 2½oz de mantequilla, derretida, más extra para engrasar", "Galletas digestivas de 175g / 6oz", "175g / 6oz de arándanos, más extra para decorar", "450 g / 1 libra de queso crema", "150 g / 5½ oz de azúcar en polvo", "1 cucharadita de extracto de vainilla", "4 huevos de gallinas camperas, ligeramente golpeados", "azúcar glas, al polvo"], "serves": "Sirve 10", "time": {"preparation": "menos de 30 minutos", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Unte con mantequilla los lados y la base de una lata para pasteles de 23 cm / 9 pulgadas.", "Coloque los bizcochos en un procesador de alimentos y pulse hasta que la mezcla se asemeje a pan rallado áspero. Alternativamente, colóquelos en una bolsa de plástico y golpee con un rodillo. Mezcle los bizcochos triturados con la mantequilla derretida y presione hacia abajo en la base de la lata. Extiende los arándanos sobre la base y enfría en el refrigerador hasta que sea necesario.", "Batir el queso crema, el azúcar, el extracto de vainilla y los huevos juntos en un tazón grande hasta que estén suaves y cremosos. Verter sobre la parte superior de los arándanos y luego hornear en el horno durante 40 minutos, o hasta que esté pálido dorado y solo se tambalea un poco cuando agita suavemente la lata.", "Retira del horno y deja enfriar en la lata durante unos 10-15 minutos, luego pasa un cuchillo por el borde para aflojarlo y retira con cuidado la tarta de queso de la lata. Transfiera a un plato de servir. Espolvorea sobre algunos arándanos y luego espolvorea con azúcar glas.", "Cortar en rodajas para servir. Esta tarta de queso se come mejor cuando está a temperatura ambiente."]}, {"isVegetarian": false, "title": "Calabacín al horno con parmesano", "url": "www_bbc_co_uk_food_recipes_baked_courgette_with_40269", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["guión aceite vegetal, para engrasar", "1 calabacín mediano, cortado, rallado", "1 loncha de tocino cocinado, picado", "1 cucharada de yogurt natural", "25 g / 1 oz de queso feta", "1 cucharada de queso parmesano rallado", "pizca de pimienta negra molida", "1 huevo de gallinas camperas, golpeado", "2 tomates, en rodajas, para servir (opcional)"], "serves": "Porciones 2", "time": {"preparation": "menos de 30 minutos", "cookingMins": 30, "cooking": "10 a 30 minutos", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Engrasar un plato a prueba de horno con un poco de aceite con un cepillo de pastelería. Agregue el calabacín rallado, luego esparza sobre el tocino picado.", "En un tazón, mezcle el yogurt natural, el queso feta, el parmesano y la pimienta negra molida hasta que estén bien combinados. Agregue el huevo batido hasta que esté bien combinado.", "Vierta la mezcla de huevo y yogur en la parte superior de la mezcla de calabacín y tocino. Transfiera el plato al horno y hornee durante 20-25 minutos, o hasta que la mezcla de huevo y yogur se haya fijado y esté dorada en la parte superior.", "Retire el plato del horno y déjelo a un lado para que se enfríe un poco. Sirva con los tomates en rodajas, si lo desea."]}, {"isVegetarian": true, "title": "Buñuelos de calabacín al horno con salsa marinara", "url": "www_bbc_co_uk_food_recipes_baked_courgette_fritters_54670", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baked_courgette_fritters_54670_16x9.jpg", "ingredients": ["1 cucharadita de aceite de oliva virgen extra", "1 bulbo de ajo grande, con la parte superior cortada", "200g / 7oz de queso bajo en grasa", "3 cucharadas de yogur griego bajo en grasa", "½ manojo de cebollín, finamente picado", "2 cucharadas de aceite de oliva", "1 cebolla roja grande, finamente picada", "2 dientes de ajo, finamente picados", "400 g / 14 oz pueden cortar tomates", "2 ramitas de tomillo, hojas finamente picadas (alrededor de 1 cucharadita de hojas picadas)", "azúcar impalpable (opcional)", "sal marina escamada y pimienta negra recién molida", "grandes hojas de albahaca fresca, toscamente desgarradas", "3 huevos medianos de granja", "50g / 1¾oz de harina integral o simple", "125g / 4½oz de pan rallado natural seco", "2 cucharadas de queso parmesano finamente rallado (o un queso duro vegetariano similar)", "2 cucharaditas de hojas de romero picadas", "2 calabacines medianos (lo más recto posible)", "aceite en aerosol", "1 limón pequeño, cortado en cuñas"], "serves": "Para 6", "time": {"preparation": "menos de 30 minutos", "cookingMins": 60, "cooking": "30 minutos a 1 hora", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Para la salsa de ajo tostado, precaliente el horno a 220 ° C / 425 ° F / Gas 7 (ventilador 200 ° C). Rocíe el aceite en el centro de un trozo de papel de aluminio de 20 cm / 8 pulgadas y coloque el ajo, con el lado del corte hacia abajo en la parte superior. Envuélvalo sin apretar, siéntese en una bandeja pequeña para hornear e introduzca el horno inmediatamente (incluso si el horno no está lo suficientemente caliente) para cocinar durante aproximadamente 50-55 minutos, o hasta que esté muy suave.", "Para la salsa marinara, caliente el aceite en una sartén mediana a fuego lento. Agregue la cebolla y cocínela durante aproximadamente 6-8 minutos, o hasta que comience a ablandarse, revolviendo regularmente. Agregue el ajo y cocine por un minuto más. Revuelva los tomates, el tomillo, el azúcar (si cree que necesita un poco de edulcorante) y un poco de sal y pimienta. Baje el fuego para que la mezcla esté hirviendo a fuego lento y deje cocer durante 15-20 minutos, o hasta que la salsa se espese y los sabores se hayan intensificado.", "Mientras tanto, haz los buñuelos de calabacín. Línea dos bandejas de hornear grandes con pergamino para hornear. Batir los huevos en un tazón grande y poco profundo. Ponga la harina en otra y agregue un par de grandes pizcas de sal y mucha pimienta. Divida las migas de pan, el parmesano y el romero en partes iguales entre dos grandes cuencos poco profundos y déjelos a un lado.", "Recorta los extremos del calabacín y corta uno longitudinalmente en tres rebanadas de tamaño uniforme. Corte cada rebanada en tres tiras largas, de un tamaño uniforme y luego a la mitad en su ancho para dar 18 chips. Repita con el segundo calabacín para dar 36 fichas en total. Cada uno tendrá aproximadamente 1.5cm / ¾ de ancho y 7-8cm de largo, dependiendo del tamaño de sus calabacines.", "Trabajando con unos pocos a la vez, mezcle los bastones del calabacín en la harina hasta que estén bien cubiertos, esto ayudará al huevo a pegarse en la próxima etapa. Mezcle a través del huevo batido y, después de dejar que el exceso de huevo gotee, gírelo en uno de los lotes de pan rallado para pegarlo todo uniformemente. Arregle en una sola capa en las bandejas para hornear a medida que avanza. Repita hasta que todos los calabacines estén cubiertos, usando el segundo lote de migas de pan una vez que el primero se haya agotado.", "La salsa marinara probablemente sea buena y espesa en esta etapa. Si es demasiado espeso para verter, agregue un poco de agua. Retirar del fuego, sazonar al gusto con sal y pimienta, agregar las hojas de albahaca y cubrir para mantener caliente hasta que esté listo para servir.", "Rocíe los calabacines con el aceite y colóquelos en el horno durante 20 minutos. Si está apretado en el espacio, coloque el paquete de ajo en una de las bandejas de calabacín. A la mitad del tiempo de cocción, retire los calabacines, voltéelos, aplique otro aerosol y vuelva a colocarlos en el horno, esta vez en los estantes opuestos a los que ya tenían. Una vez cocidos, deben estar ligeramente dorados y muy crujientes por todas partes.", "Una vez ablandado, retire el ajo del horno y, cuando esté lo suficientemente frío como para manejarlo, desenvuélvalo y exprima los dientes de ajo de sus pieles de papel en un bol. Mash ligeramente con un tenedor y luego agregue el queso crema, yogur y cebollino y revuelva todo junto muy bien. Sazone al gusto y espolvoréelo en un tazón para servir.", "Coloque la salsa Marinara en un tazón para servir. Coloque los calabacines en un plato para servir y sirva con las rodajas de limón."]}, {"isVegetarian": false, "title": "Apio nabo con trucha ahumada y salsa de alcaparras", "url": "www_bbc_co_uk_food_recipes_baked_celeriac_with_34623", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 apio nabo medio, piel frotada pero dejada encendida, cortada por la mitad a lo largo", "2 cucharadas de aceite de oliva", "Ramitas de tomillo de 10 g / ¼ oz", "80 g / 2 oz de crema fresca", "20 g / oz de rábano picante fresco, pelado y finamente rallado (use crema de rábano picante como alternativa)", "150g / 5½oz de trucha ahumada o salmón, cortado en tiras de 3cm / 1¼in", "2 cucharaditas de jugo de limón", "sal marina escamosa y pimienta negra", "20g / ¾oz de alcaparras pequeñas (o alcaparras regulares, picadas)", "1 cucharada de perejil finamente picado", "1 cucharadita de estragón finamente picado", "1½ cucharadas de aceite de oliva"], "serves": "Para 4 personas", "time": {"preparation": "30 minutos a 1 hora", "cookingMins": 120, "cooking": "1 a 2 horas", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4.", "Coloque las mitades de apio nabo en 2 pedazos separados de papel de aluminio, lo suficientemente grandes como para cubrir el apionabo. Rocíe 1 cucharada de aceite sobre cada mitad, junto con el tomillo y ¾ cucharadita de sal (en cada mitad) y frote todo uniformemente. Termine con una generosa rutina de pimienta y luego selle el apionabo en la lámina. Hornea por una hora, hasta que esté suave. Retírelo del horno, desenvuélvalo y lávelo y déjelo a un lado durante aproximadamente media hora, para que el apionabo alcance la temperatura ambiente.", "Mientras tanto, mezcle la crème fraiche y el rábano picante, con una pizca de sal y una pizca de pimienta. Guarde en el refrigerador hasta que esté listo para servir.", "Para la salsa, mezcle todos los ingredientes y reserve.", "Cuando esté listo para servir, corte cada mitad de apio nabo en 4 cuñas largas, cada una de 4-5 cm / 1½-2 pulgadas de ancho. Coloque 2 cuñas en cada plato y luego espolvoree la crema de rábano picante encima. Coloque la trucha o el salmón en la parte superior de este, seguido de la salsa. Rocíe cada porción con jugo de limón y sirva."]}]