[{"ingredients": ["2 huevos de gallinas camperas", "130 g / 4 oz de azúcar en polvo", "½ cucharada de café negro fuerte", "20 g / oz de mantequilla", "200g / 7oz de chocolate blanco, roto en pedazos", "Harina normal de 30g / 1oz, tamizada", "¼ cucharadita de polvo de hornear", "pizca de sal", "50 g / 2 oz de nueces de macadamia, cortadas por la mitad", "50g / 2oz de chocolate blanco, picado"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "En un tazón, mezcle los huevos, el azúcar y el café durante 7-8 minutos o hasta que el color sea más claro, espeso y bien combinado. Dejar de lado.", "Ponga un poco de agua a hervir en una sartén, luego reduzca el fuego hasta que el agua esté hirviendo a fuego lento. Suspenda un recipiente resistente al calor sobre el agua (no permita que la base del recipiente toque el agua). Agregue la mantequilla y el chocolate normal y revuelva hasta que se derrita, suave y bien combinado.", "Cuando el chocolate y la mantequilla se hayan derretido, retire el tazón de la fuente y déjelo enfriar durante 4-5 minutos.", "Cuando la mezcla de chocolate y mantequilla se haya enfriado un poco, agregue la mezcla de huevo y café hasta que estén bien combinados.", "Con cuidado, doble la harina, el polvo de hornear y la sal en la mezcla de la mezcla hasta que estén bien combinados.", "Con cuidado, dobla las nueces y el chocolate blanco en la mezcla de la mezcla hasta que se combinen bien.", "Línea 1-2 bandejas para hornear muy poco profundas con papel antigrasa. Coloque cucharadas de la mezcla de la mezcla en el papel resistente a las grasas, dejando un espacio generoso entre cada cucharada de masa (las galletas de brownie se expandirán durante la cocción).", "Transfiera los bizcochos de brownie al horno y hornee por 10 minutos, o hasta que los bizcochos de brownie hayan subido pero todavía estén blandos en el centro y las tapas se hayan agrietado levemente. Poner a un lado para enfriar y endurecer en una rejilla de alambre antes de servir."], "url": "www_bbc_co_uk_food_recipes_chocolatebrowniebisc_92027", "title": "Galletas de brownie de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Rinde 20", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12oz% 20dark% 20chocolate% 20 (55-60 %% 20cocoa% 20solids)", "250g / 9oz de mantequilla sin sal", "3 huevos de gallinas camperas", "250g / 9oz de azúcar mascabado oscuro", "Harina normal 110 g / 4 oz, tamizada", "1 cucharadita de polvo de hornear", "pizca de sal", "175g / 6oz de frambuesas frescas"], "method": ["Precaliente el horno a 170 ° C / 325 ° F / Gas 3. Unte con mantequilla una lata de torta cuadrada de 23 cm / 9 in.", "Derretir el chocolate y la mantequilla juntos, luego enfriar un poco.", "Batir los huevos hasta que estén gruesos, luego agregar gradualmente el azúcar y batir hasta que estén brillantes. Batir la mezcla derretida de chocolate, luego doblar suavemente la harina, el polvo de hornear y la sal.", "Vierta un poco más de la mitad de la mezcla en la lata de torta preparada. Dispersar sobre las frambuesas, luego cubrir con la mezcla restante.", "Hornee en el horno precalentado durante aproximadamente 40 minutos o hasta que la superficie esté lista. Se cocinará cuando salga una brocheta en el centro con solo una pequeña mezcla adherida.", "Retire la torta a una rejilla de alambre y déjela reposar durante aproximadamente 20 minutos. Corta el pastel en cuadrados y retíralos de la lata cuando esté frío."], "url": "www_bbc_co_uk_food_recipes_chocolatebrownies_68041", "title": "Brownies de chocolate y frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 16 brownies", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto crianza de 170g / 6oz", "sal", "2 cucharadas de cacao en polvo", "170 g / 6 oz de azúcar en polvo", "5 cucharadas de aceite de girasol, más extra para engrasar", "230ml / 8fl oz de leche de soya endulzada", "1 cucharadita de extracto de vainilla"], "method": ["Precaliente el horno a 180C / 350F / Gas 4.", "Engrase y enharine una lata cuadrada de 20cm / 8in con un poco de aceite de girasol.", "En un recipiente tamiza la harina, la sal, el cacao en polvo y el azúcar.", "Agregue el aceite, la leche de soja y el extracto de vainilla, y mezcle cuidadosamente hasta que esté completamente mezclado.", "Viértalo en la lata y hornee durante unos 25 minutos, hasta que los brownies vuelvan a brotar cuando los presione suavemente.", "Deje que se enfríe durante cinco minutos, luego colóquelo sobre una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_chocolatebrownies_83803", "title": "Brownies de chocolate vegano", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 9", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["115g / 4oz de mantequilla sin sal, ablandada, más extra para engrasar", "170 g / 6 oz de azúcar en polvo", "2 huevos de gallinas camperas", "40g / 1% C2% BD% 20oz% 20plain% 20chocolate% 20 (% mínimo 2065 %% 20cocoa% 20solids)", "Pacanas de 55 g / 2 oz (opcional)", "1 cucharadita de extracto de vainilla", "2 cucharaditas de gránulos de café instantáneo", "2 cucharadas de agua tibia", "1 cucharadita de polvo de hornear", "Harina normal de 55g / 2oz", "55 g / 2 oz de cacao en polvo", "azúcar en polvo, para quitar el polvo"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Prepare la lata de la torta. Engrase una lata de torta cuadrada de 18 cm / 7 pulgadas y alinee con un pergamino para hornear antiadherente.", "En un tazón limpio, unte la mantequilla y el azúcar hasta que quede pálido y esponjoso. Golpe en los huevos uno a la vez.", "Pica el chocolate y ponlo a un lado.", "Pica las pacanas, si las estás usando. Doble suavemente las nueces y el chocolate en la mezcla de mantequilla y huevo. Agregue el extracto de vainilla.", "Disuelva los gránulos de café en dos cucharadas de agua tibia y agregue a la mezcla. Mezclar bien", "Agregue el polvo de hornear, luego tamice la harina y el cacao en polvo. Mezclar bien; la mezcla estará bastante húmeda.", "Vierta la mezcla de brownie en la lata preparada y nivele la parte superior con una espátula.", "Hornee en el horno durante 35-40 minutos. Deje que se enfríe en la lata durante diez minutos, luego colóquelo sobre una rejilla para que se enfríe.", "Para servir, cortar en rectángulos y espolvorear con azúcar glas."], "url": "www_bbc_co_uk_food_recipes_chocolatebrownies_90193", "title": "Brownies de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 9", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatebrownies_90193_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "225 g / 8oz de mantequilla sin sal, derretida", "Harina normal de 75g / 3oz", "75g / 30z cacao en polvo", "225g / 8 oz de chocolate negro (mínimo 70 por ciento de sólidos de cacao), fundido", "100g / 3½oz de avellanas peladas, picadas", "mantequilla, para engrasar", "Crema doble de 300 ml / ½ pinta", "50 g / 2 oz de azúcar en polvo", "1 vaina de vainilla, semillas raspadas", "100 g / 3 ½ oz de malvaviscos rosa"], "method": ["Precalentar el horno a 180C / 355F / Gas 4.", "Coloque los huevos y el azúcar en un bol y bata hasta que estén pálidos y cremosos.", "Agregue la mantequilla derretida y revuelva bien.", "Tamiza la harina y el cacao en la mezcla de huevo, luego agrega el chocolate derretido y las avellanas y revuelve bien.", "Vierta la mezcla en un plato engrasado a prueba de horno de 20cm / 8in y transfiera al horno para hornear durante 30-35 minutos, o hasta que la superficie esté lista, pero sale un pincho con un poco de la mezcla pegada a él. Retirar del horno y dejar enfriar.", "Para la salsa de malvavisco, coloque la crema, el azúcar y las semillas de vainilla en una cacerola a fuego lento y deje que hierva lentamente. Cocine a fuego lento durante unos cinco minutos para espesar el líquido, luego retire del fuego.", "Agregue los malvaviscos a la mezcla de crema y revuelva bien para que se derrita.", "Para servir, corte porciones de brownie y coloque en platos. Vierta la salsa."], "url": "www_bbc_co_uk_food_recipes_chocolatebrownieswit_85480", "title": "Brownies de chocolate con salsa de malvavisco", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["250 g / 8½ oz de mantequilla, más extra para engrasar", "400 g / 14 oz de azúcar en polvo de oro", "3 cucharadas de aceite de girasol", "1 cucharadita de extracto de vainilla", "3 huevos de gallinas camperas, golpeados", "Harina simple 400g / 14oz", "1 cucharadita de bicarbonato de soda", "2 cucharaditas de polvo de hornear", "½ cucharadita de sal", "Pizca de canela", "85g / 3oz de cacao en polvo", "220ml / 8fl oz de cola plana", "150g / 5oz de mermelada de fresa", "Crema doble de 150 ml / 5 fl oz, batida hasta que se forman picos rígidos cuando se quita la batidora", "100g / 3½oz de chocolate con leche, roto en pedazos", "dulces en gelatina, para decorar", "botones de chocolate, para decorar"], "method": ["Precalentar el horno a 170 C / 325 F / Gas 3.", "Engrase una lata para pastel de 25 cm / 10 in con mantequilla y cubra con papel antigrasa.", "Para la torta de chocolate, en un tazón grande, unte la mantequilla y el azúcar hasta que la mezcla esté pálida y ligera.", "En un recipiente aparte, mezcle el aceite de girasol y el extracto de vainilla en los huevos batidos.", "Poco a poco batir la mezcla de huevo en la mezcla de mantequilla y azúcar, agregando solo una pequeña mezcla de huevo a la vez y asegurándose de que esté bien incorporada antes de agregar más, hasta que toda la mezcla de huevo se haya incorporado y la mezcla esté bien combinada.", "En un recipiente aparte, mezcle la harina, el bicarbonato de soda, el polvo de hornear, la sal, la canela y el cacao en polvo hasta que estén bien combinados.", "Poco a poco, doble la mezcla de harina a la mezcla de masa de torta, una cucharada a la vez, hasta que toda la mezcla de harina se haya incorporado en la masa de torta.", "Agregue la cola plana a la masa de la torta y revuelva cuidadosamente hasta que esté bien combinada.", "Vierta la masa de la torta en la lata de torta engrasada y forrada. Nivele la parte superior de la torta con un espátula o espátula.", "Transfiera la torta al horno y hornee por 1 hora, 15 minutos a 1 hora y 20 minutos, revisando regularmente, o hasta que la torta se haya levantado y un pincho salga limpio cuando se inserte en el centro del pastel. (Si la parte superior de la torta se dora demasiado rápido durante la cocción, cúbrala con una hoja de papel de aluminio).", "Retire con cuidado la torta de la lata y déjela a un lado sobre una rejilla para que se enfríe.", "Cuando el pastel se haya enfriado, corte el pastel por la mitad horizontalmente para crear dos tortas más finas.", "Extienda la mermelada sobre uno de los pasteles y luego extienda la crema batida sobre la capa de mermelada. Coloque la segunda torta en la parte superior para crear un sándwich de esponja.", "Ponga a hervir un poco de agua en una sartén, reduzca el fuego a fuego lento y suspenda un recipiente resistente al calor sobre el agua hirviendo. (No permita que la base del recipiente toque el agua.) Agregue el chocolate al recipiente y permita que se derrita. Extiende el chocolate derretido sobre la parte superior y los lados del pastel.", "Mientras el chocolate todavía esté suave, coloque los dulces en gelatina y los botones de chocolate por todo el pastel para decorar. Déjelo enfriar hasta que el chocolate se haya enfriado."], "url": "www_bbc_co_uk_food_recipes_chocolatecake_89765", "title": "Pastel de chocolate", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Hace 1", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatecake_89765_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["115g / 4oz de mantequilla, más extra para engrasar", "300 g / 11 oz de azúcar en polvo", "225 g / 8 oz de chocolate negro, alrededor del 70% de sólidos de cacao", "Harina normal de 75g / 3oz", "75g / 3oz de cacao en polvo", "5 huevos de gallinas camperas", "750g / 1lb 10 oz frambuesas", "150g / 5oz de azúcar glasé", "500g / 1lb 2oz mascarpone"], "method": ["Precalentar el horno a 180C / 375F / Gas 4.", "Coloque la mantequilla y el azúcar en un bol y bata juntos hasta que estén suaves y esponjosos.", "Coloque el chocolate en un tazón resistente al calor colocado sobre una olla de agua a fuego lento (el fondo del recipiente no debe tocar el agua) y mezcle de vez en cuando hasta que se derrita y alise. Retirar del fuego y dejar enfriar ligeramente.", "Agregue el chocolate derretido a la mezcla de mantequilla y bata para combinar.", "Agregue la harina, el cacao en polvo y los huevos y mezcle bien, luego doble en 250 g / 9 oz de las frambuesas.", "Engrase y forme una bandeja para hornear de 25cm x 30cm (10in x12in). Vierta la mezcla en la lata, luego transfiera al horno y hornee por 20 minutos, o hasta que esté listo pero aún húmedo en el medio.", "Mientras tanto, coloque el resto de las frambuesas y el azúcar glas en un procesador de alimentos y mezcle con un puré. Pase a través de un colador en un recipiente limpio.", "Coloque el mascarpone en un recipiente y mezcle la mitad del puré de frambuesa.", "Para servir, corte el brownie en trozos y colóquelo en platos para servir con una cucharada de crema de frambuesa. Rocíe el resto del puré de frambuesa."], "url": "www_bbc_co_uk_food_recipes_chocolatebrownieswit_86958", "title": "Brownies de chocolate con crema de frambuesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75g / 3oz de mantequilla", "Azúcar demerara 75 g / 3 oz", "Harina común 75g-110g / 3-4oz", "½ cucharadita de sal marina, o al gusto", "200g / 7oz de chocolate negro de buena calidad, aproximadamente picado", "200g/7oz caramel condensed milk (or dulce de leche)", "2-3 pellizcos de sal marina, al gusto", "Crema doble de 50 ml / 2 fl oz, batida hasta que se forman picos suaves cuando se quita la batidora", "Cajas de pastelería prefabricadas de 4 x 12 cm / 5 pulgadas (cada una de 2 cm)", "4 cucharadas de helado de vainilla listo para usar (aproximadamente 300 g / 11 oz en total), devuelto al congelador, para servir"], "method": ["Para el helado de crumble salado, precalentar el horno a 180 ° C / 350 ° F / Gas 4.", "Mezcle la mantequilla y el azúcar juntos hasta que estén bien combinados. Mezcle la harina hasta que la mezcla se asemeje a pan rallado, luego espolvoree la mezcla en una bandeja para hornear.", "Hornee la mezcla de azúcar y harina en el horno durante 12-15 minutos, o hasta que estén crujientes y doradas. Dejar de lado hasta que esté completamente frío.", "Transfiera la mezcla de crumble a un procesador de alimentos. Agregue la sal marina y mezcle la mezcla hasta que se asemeje a migas de pan finas.", "Coloque la mezcla de crumble mezclado en un plato y déjelo a un lado.", "Mientras tanto, para la tarta, suspenda un recipiente resistente al calor sobre una olla de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua). Agregue el chocolate y revuelva de vez en cuando hasta que se derrita.", "Coloque la leche condensada de caramelo en un recipiente aparte y agregue la sal marina hasta que esté bien combinada.", "Batir la crema doble batida en la mezcla de caramelo hasta que la mezcla esté bien combinada y se formen picos rígidos cuando se quite la batidora. Pruebe la mezcla, agregando un poco más de sal, si lo desea.", "Divida la mezcla de caramelo por igual entre los casos de pastelería.", "Vierte un poco del chocolate derretido sobre cada tarta hasta que cubra el relleno de caramelo. Dejar de lado hasta que la mezcla de llenado se haya enfriado un poco y el chocolate se haya endurecido.", "Justo antes de servir, retire las bolas de helado uno por uno del congelador y enrolle cada una en la mezcla de crumble salado hasta que esté completamente cubierto.", "Para servir, coloque una tarta de caramelo de chocolate en el centro de cada una de las cuatro placas de servir. Cubra cada tarta con una bola de helado de migajas salada. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chocolatecarameltart_93446", "title": "Tarta de caramelo de chocolate con helado de migajas salada", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["200ml / 7¼fl oz de agua", "225g / 8 oz de chocolate amargo de mejor calidad, roto en pedazos"], "method": ["Pon el chocolate y el agua en una sartén y derretir a fuego medio, revolviendo ocasionalmente.", "Tenga dos cuencos listos, uno que se siente dentro del otro. En el cuenco más grande, pon algo de hielo y un poco de agua, y coloca el recipiente más pequeño en él.", "Vierta el chocolate derretido en el recipiente más pequeño y bata con una batidora eléctrica hasta que la mezcla se espese y adopte la apariencia de crema batida. Si sobre-azota la mezcla de chocolate, simplemente voltéela en la sartén y comience nuevamente."], "url": "www_bbc_co_uk_food_recipes_chocolatechantilly_74864", "title": "Chocolate Chantilly", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de galletas de bourbon", "65g / 2½oz de mantequilla, derretida", "100 g / 3½ oz de chocolate negro de buena calidad, mínimo 70 por ciento de sólidos de cacao", "200g / 7oz de queso crema con toda su grasa", "Ricotta 400 g / 14 oz", "75 g / 2½ oz de azúcar en polvo de oro", "3 huevos", "40 g / 1½ oz de cacao en polvo", "125g / 4½oz de pudín de Navidad de buena calidad, cocido, desmenuzado en trozos (opcional)", "125g / 4½oz de chocolate negro de buena calidad, con un mínimo de 70% de sólidos de cacao", "Crema doble 125ml / 4½fl oz", "15g / ½ oz de mantequilla", "chocolate de buena calidad, rallado", "cacao en polvo, para quitar el polvo", "crema coagulada, para servir"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para la tarta de queso, triture las galletas de bourbon en migas y colóquelas en un tazón. Vierta sobre la mantequilla derretida. Presiona en una lata de torta en forma de resorte de 20cm / 8in para formar la base.", "Coloque el chocolate en un tazón con agua apenas a fuego lento y derrita, asegurándose de que el agua no toque el fondo del tazón.", "Coloque el queso crema, la ricotta y el azúcar en un procesador de alimentos y mezcle hasta que quede suave.", "Luego agregue los huevos, luego el cacao en polvo y el chocolate derretido. Agregue el pudín de Navidad, si lo está usando.", "Vierta la mezcla en la base. Coloque la torta en el horno y cocine durante aproximadamente 45 minutos, o hasta que la torta esté elástica al tacto. Dejar enfriar en la lata.", "Cuando esté frío, salga de la lata y cubra con chocolate picado o rallado y un poco de cacao.", "Para la salsa, coloque el chocolate y la crema en un tazón limpio sobre una fuente de agua hirviendo y derrita, asegurándose de que el agua no toque el fondo del tazón. Cuando se derrita, mezcle con la mantequilla. La salsa debe prepararse justo antes de servir el pastel, ya que no se puede recalentar.", "Sirva rebanadas grandes con una cucharada grande de salsa y una cucharada de crema cuajada. Espolvorea el borde del plato con cacao."], "url": "www_bbc_co_uk_food_recipes_chocolatecheesecake_79990", "title": "Tarta de queso de chocolate con leche", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatecheesecake_79990_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["350g / 12¼ oz de harina sin coser", "1 cucharadita de bicarbonato de soda", "1 cucharadita de sal", "225g / 8oz de mantequilla", "175g / 6¼ oz de azúcar en polvo", "175g / 6¼oz de azúcar morena suave", "1 cucharadita de extracto de vainilla", "2 huevos", "350g / 12¼ oz de chocolate negro, desmenuzado"], "method": ["Precalentar el horno a 190C / 375F / Gas 5.", "En un recipiente, combine la harina, el bicarbonato de sodio y la sal.", "En otro tazón, combine la mantequilla, el azúcar, el azúcar moreno y el extracto de vainilla hasta que estén cremosos. Batir los huevos. Poco a poco batir en la mezcla de harina. Agregue el chocolate.", "Divida la masa flexible en dos mitades, enrollando cada una en forma de salchicha, de aproximadamente 5 cm de diámetro. Envuélvalos en una película adhesiva y transfiéralos al refrigerador hasta que estén listos para usar.", "Cuando esté listo para hornear las galletas, simplemente corte el tronco en rebanadas de 2cm / ¾ de grueso y colóquelas en una bandeja para hornear, ampliamente espaciadas. Hornea de 9 a 11 minutos.", "Servir."], "url": "www_bbc_co_uk_food_recipes_chocolatechipcookies_72335", "title": "Galletas de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "12-15", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatechipcookies_72335_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "140g / 5oz de queso crema", "3 cucharadas de azúcar glas", "1 cucharada de cacao en polvo", "Crema doble de 50 ml / 2 fl oz, batida hasta que se forman suaves picos cuando se quita la batidora", "3 galletas digestivas, aplastadas", "55 g / 2 oz de chocolate negro, rallado", "1 naranja, pelada, segmentada", "ramita de menta fresca", "Leche 200ml / 8fl oz", "Crema doble 150ml / 6fl oz", "3 yemas de huevo de gallinas camperas", "85g / 3oz de azúcar en polvo", "3 vainas de cardamomo, ligeramente trituradas", "1 vaina de vainilla, partido, semillas raspadas", "30 g / 1 oz de azúcar en polvo"], "method": ["Engrase un anillo de chefs de 10cm / 4in con mantequilla y colóquelo en un plato.", "Coloque el queso crema, el azúcar glas, el polvo de cacao y la crema en un tazón y mezcle.", "Presione las migas de galletas en la parte inferior del molde de anillo, luego agregue la mezcla de queso crema para llenar el anillo.", "Suave por encima y espolvorea el chocolate.", "Con cuidado, retire el anillo y la parte superior con los segmentos de naranja y menta.", "Para la crème anglaise, caliente la leche y la crema en una cacerola a fuego medio, hasta que casi hirviendo, luego retire del fuego.", "En un tazón, mezcle las yemas de huevo y el azúcar, luego agregue gradualmente la mezcla de crema caliente, revolviendo constantemente.", "Regrese la mezcla a la cacerola. Agregue el cardamomo y las semillas de vainilla y revuelva a fuego lento, hasta que se espese lo suficiente como para cubrir la parte posterior de una cuchara.", "Cuele la mezcla a través de un tamiz en un recipiente y deje enfriar.", "Para el azúcar hilado, derrita el azúcar en una sartén pequeña hasta que esté dorado, luego retírelo del fuego. Con un tenedor, coloca los hilos del caramelo sobre un cuenco boca abajo. Deje que se asiente, luego retire y sirva sobre la tarta de queso con la crema inglesa vertida."], "url": "www_bbc_co_uk_food_recipes_chocolatecheesecakew_84307", "title": "Tarta de chocolate con crema de cardamomo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 fresa de cilantro (con tallos si es posible)", "1 paquete de uchuvas", "Cerezas 225g / ½lb con tallos, lavados", "200g / 7oz% 20block% 20of% 20quality% 20dark% 20chocolate% 20 (70 %% 20cocoa% 20solids% 20if% 20possible),% 20broken% 20into% 20pieces"], "method": ["Cubra una bandeja para hornear o una bandeja con papel resistente a la grasa.", "Calentar un poco de agua hasta el punto de ebullición en una cacerola.", "Coloque el chocolate en un recipiente grande a prueba de calor y colóquelo sobre la bandeja de agua hirviendo. Asegúrese de que la base del recipiente no entre en contacto con el agua. Revuelva hasta que el chocolate se derrita.", "Exponga las bayas de las grosellas del capullo retirando las pieles de papel.", "Sostenga estas pieles de papel y sobre los tallos de la fruta, y sumerja cada pieza de fruta en el chocolate derretido. Colóquelos en el papel resistente a las grasas y déjelos en un lugar fresco durante 2 horas.", "Sirve con café después de la cena."], "url": "www_bbc_co_uk_food_recipes_chocolatecoatedfruit_1386", "title": "Frutas recubiertas de chocolate", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 130}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["125g / 4½oz de harina natural", "25 g / 1 oz de cacao en polvo", "1½ cucharadita de polvo de hornear", "150 g / 5 oz de azúcar en polvo", "150 g / 5oz de mantequilla sin sal ablandada a temperatura ambiente", "1 huevo de gallinas camperas", "8 cucharadas de leche", "50g / 2oz de queso crema", "25g / 1oz de mantequilla, ablandada a temperatura ambiente", "125g / 4oz de azúcar glas, tamizado", "½ cucharadita de esencia de vainilla", "25g / 1oz de azúcar glas", "1 cucharada de cacao en polvo"], "method": ["Precaliente el horno a 180 ° C / 350 ° F / Gas 4. Alinee una bandeja para muffins con 9 cajas de papel.", "Tamiza la harina, el cacao en polvo y el polvo de hornear en un bol. Agregue el azúcar y la mantequilla y bata la mezcla hasta que esté bien combinada.", "Agregue el huevo y la leche hasta que la mezcla esté espesa y suave.", "Divida la mezcla entre la caja de papel y hornéela en el horno durante 20-25 minutos, o hasta que el contacto sea flexible y la broche insertada en el centro de uno de los pasteles salga limpia. Dejar de lado para enfriar en una rejilla de alambre.", "Para el glaseado de queso crema, bata el queso crema y la mantequilla en un bol hasta que estén bien combinados. Batir el azúcar glas y la vainilla.", "Coloque la guinda en los pastelitos, dejando un borde pequeño alrededor del borde.", "Para el glaseado de chocolate, tamice el azúcar glas y el polvo de cacao en un bol. Agregue 2 cucharadas de agua para formar un glaseado suave y espeso.", "Transfiera la mezcla a una manga pastelera con una boquilla fina. (Alternativamente, coloque la mezcla en la esquina de una bolsa de sándwich y recorte la esquina, para formar un pequeño orificio).", "Con cuidado, canalice 3 círculos concéntricos en cada magdalena. Pase un palillo de dientes desde el centro hasta el borde del pastel, a través de cada círculo de formación de hielo, a intervalos de 2 cm / 1 pulgada para crear un efecto de telaraña.", "Déjelo a un lado durante 20 minutos para permitir que la formación de hielo se endurezca."], "url": "www_bbc_co_uk_food_recipes_chocolatecobwebcupca_93842", "title": "Cupcakes de Halloween", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 9 cupcakes grandes", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatecobwebcupca_93842_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Harina de auto aumento 250g / 9 oz", "300 g / 10½ oz de azúcar en polvo de oro", "3 cucharadas colmadas de cacao", "generoso pizca de bicarbonato de soda", "250g / 9oz de mantequilla", "250ml / 8½fl oz de bebida de cola", "125ml / 4¼fl de onza de leche", "2 huevos, golpeados", "1 cucharadita de extracto de vainilla", "100 g / 3½ oz de mantequilla", "2 cucharadas de refresco de cola", "2 cucharadas de cacao", "200g / 7oz de azúcar glasé", "barra de chocolate con caramelo (tamaño king)", "toque de crema doble", "2 cucharadas de mini malvaviscos (opcional)"], "method": ["Caliente el horno a 180C / 350F / Gas4.", "Tamiza la harina, el azúcar, el cacao y el bicarbonato de soda en un bol. Derrita la mantequilla y la bebida de cola suavemente en una sartén y luego agregue los ingredientes secos, junto con la leche, los huevos y la vainilla.", "Mezclar con cuidado, pero a fondo y la punta en una lata de pastel a base de mantequilla, suelta (24 cm / 9½ de diámetro). Hornee durante aproximadamente 40 minutos o hasta que un pincho insertado en el centro del pastel salga limpio. Retira del horno y deja durante unos 15 minutos mientras preparas el relleno. Ponga la mantequilla, la bebida de cola y el cacao en una sartén y derrita lentamente. Llevar la mezcla a ebullición y luego verter sobre el azúcar glas. Batir hasta que quede suave y verter sobre la torta mientras todavía está caliente. Enfriar la torta en la lata.", "Sirva con la salsa, hecha derretiendo suavemente la barra de chocolate en una sartén con un chorrito de crema (es posible que desee agregar un poco de agua tibia para lograr una consistencia de vertido), agregue los malvaviscos si lo usa."], "url": "www_bbc_co_uk_food_recipes_chocolatecolacake_7614", "title": "Pastel de chocolate y cola", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 12 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatecolacake_7614_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75ml / 2½ oz de mantequilla, derretida, más extra para engrasar", "250 g / 9 oz de azúcar moreno oscuro", "1 cucharada de agua", "1 huevo de gallinas camperas", "Harina normal de 325g / 11oz, más extra para quitar el polvo", "media cucharadita de polvo de hornear", "media cucharadita de bicarbonato de soda", "pizca de sal", "Chips de chocolate de 150 g / 5 oz (disponibles en supermercados y panaderías)", "chocolates crujientes (como Smarties o M", "75 g / 2½ oz de mantequilla", "75g / 2½ oz de azúcar", "75ml / 2½ fl oz crema doble", "75 g / 2½ oz de cacao en polvo", "75ml / 2½fl oz de agua", "75 g / 2½ oz de chocolate negro, picado", "helado de vainilla"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para las galletas, coloque la mantequilla, el azúcar, el agua y el huevo en un tazón grande y mezcle bien.", "Tamiza la harina, el polvo de hornear, el bicarbonato de soda y la sal en el bol y mezcla bien para formar una masa.", "Doble las chispas de chocolate.", "Extiende la masa para galletas sobre una superficie de trabajo limpia y enharinada y, usando un cortador de galletas, córtala en círculos de 10cm / 4 pulgadas.", "Decora cada galleta con chocolates recubiertos de azúcar y colócala en una bandeja de horno engrasada.", "Transfiera al horno para hornear durante 9-10 minutos, o hasta que esté cocido.", "Mientras tanto, para la salsa de chocolate, coloque la mantequilla, el azúcar, la crema, el cacao en polvo, el agua y el chocolate en una sartén a fuego lento y revuelva hasta que se combinen. Cocine suavemente durante 4-5 minutos hasta que esté espeso y brillante.", "Para servir, coloque una galleta en cada plato. Agregue una cucharada grande de helado y sándwich con una segunda galleta en la parte superior. Rocíe con salsa de chocolate y sirva."], "url": "www_bbc_co_uk_food_recipes_chocolatecookieicecr_88723", "title": "Sándwich de helado de galleta de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 5-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de avellanas tostadas", "100g / 3½ oz de azúcar, derretida a fuego lento hasta que se forme un caramelo", "Copos de salvado 150 g / 5¼ oz, ligeramente triturados", "140ml / 5fl oz de leche entera", "Crema doble de 325ml / 11½ fl oz", "2 huevos de gallinas camperas", "340g / 12oz de chocolate negro de buena calidad, mínimo 60 por ciento de sólidos de cacao, aproximadamente picados", "125 g / 4½ oz de azúcar en polvo", "8 avellanas, conchas eliminadas, ligeramente tostadas en una sartén seca", "200ml / 7¼fl oz de café espresso negro fuerte", "1 hoja de gelatina, empapada en agua fría durante 10 minutos, escurrida", "2-3 cucharadas de cacao en polvo", "1 cucharada de granos de café recién molidos"], "method": ["Para la base, mezcle las avellanas y el azúcar caramelizado en un procesador de alimentos hasta que tenga una pasta homogénea. Caliente la pasta en una sartén pequeña a fuego suave hasta que se caliente.", "Coloque los copos de salvado y la pasta de praliné calentado en un tazón y frótelos juntos, con las manos, hasta que los copos de salvado se hayan descompuesto y se hayan incorporado a la pasta.", "Cubra una bandeja para hornear con una hoja de papel resistente a la grasa, luego transfiera la mezcla de praliné sobre ella. Cubra la mezcla de praliné con una segunda hoja de papel resistente a la grasa, luego enrolle la mezcla hasta que mida al menos 14cm x 20cm / 5½ in x 8 in y tenga 0.5cm / ¼ de grosor.", "Retire la hoja superior de papel resistente a la grasa, luego inserte un marco rectangular para pasteles de 14 cm x 20 cm x 3 cm / 5½ pulgadas x 8 pulgadas x 1¼ pulgadas sobre la mezcla de praliné y recorte el exceso. (NB: Si es necesario, la mezcla de praliné sobrante se puede presionar en cualquier hueco del molde).", "Cubra el molde con papel resistente a la grasa y enfríe el praliné en la nevera durante 30 minutos, o hasta que se endurezca.", "Mientras tanto, para el licor, caliente la leche y la crema en una cacerola y caliéntela suavemente a fuego medio hasta que alcance el punto de ebullición.", "Mientras tanto, bate los huevos en un tazón.", "A medida que la mezcla de leche y crema hierva, viértala sobre los huevos, luego bata la mezcla constantemente hasta que quede suave y espesa.", "Agregue el chocolate picado y bata de nuevo hasta que el chocolate se haya derretido y la crema esté suave.", "Retire la base de la nevera y vierta el delice chocolate para llenar el molde. Toque suavemente los lados del molde para liberar cualquier burbuja de aire atrapada, luego alise la superficie con una espátula. Enfríe en el refrigerador durante 6-12 horas, o hasta que esté completamente fraguado.", "Mientras tanto, para las avellanas caramelizadas, caliente el azúcar en polvo en una sartén a fuego lento, revolviendo de vez en cuando hasta que esté dorado y caramelizado. Retirar del fuego y reservar para enfriar un poco. (NB: El caramelo es lo suficientemente frío cuando un palito de cóctel arrastrado por su superficie deja un rastro impreso).", "Lanza cada avellana en un palillo de cóctel, luego sumerge las avellanas en el caramelo hasta que esté cubierto. Coloque un poco de masilla adhesiva en la parte inferior de un estante o armario sobre una superficie de trabajo y asegure la barra de cóctel en la masilla, para que el caramelo gotee de la avellana y cree una cola. (NB: Coloque una bandeja para hornear o hojas de papel antigrasa debajo de las avellanas para atrapar el caramelo que gotea).", "Ponga las avellanas caramelizadas a un lado para que se enfríen y endurezcan durante al menos 30 minutos.", "Para la espuma de café, justo antes de servir, caliente la mitad del café en una sartén hasta que esté caliente pero no hirviendo.", "Exprime la hoja de gelatina en seco, luego agrégala al café caliente y continúa calentando hasta que la gelatina se haya disuelto por completo.", "Vierta el café frío restante en un recipiente, luego agregue la mezcla de café caliente. Batir bien hasta que la mezcla comience a formar espuma.", "Para servir, caliente la parte exterior del molde con un soplete de chefs para aflojar la base del delice. Retire con cuidado el marco de pastelería del delice.", "Calienta la parte superior del delice muy rápidamente usando un soplete de chefs para hacer que la superficie sea brillante. Espolvorea el delice con algo de cacao en polvo y granos de café molidos.", "Unte una cucharadita de espuma de café con un ancho de entre seis y ocho platos para servir. Sumerja la hoja de un cuchillo en agua hirviendo para calentar el metal, luego corte el delice en seis u ocho piezas y coloque uno en cada frotis de espuma, en ángulo. Descanse una avellana de caramelo contra cada rebanada. Espolvorea cada porción con el cacao en polvo restante."], "url": "www_bbc_co_uk_food_recipes_chocolatedelice_93624", "title": "Delice de chocolate", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 6-8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["125 g / 4½ oz de chocolate negro", "125g / 4½oz de mantequilla sin sal, más extra para engrasar", "Azúcar en polvo de 65 g / 2¼ oz", "3 huevos enteros de gallinas camperas", "3 yemas de huevo de gallinas camperas", "Harina simple de 100 g / 3½ oz, más extra para enharinar", "gran perilla de mantequilla", "2 peras firmes, peladas, sin corazón y cortadas a la mitad", "75 g / 2½ oz de azúcar en polvo", "Crema doble de 350 ml / 12¼ fl oz, batida hasta que se formen picos suaves cuando se quita la batidora", "100 g / 3½ oz de azúcar en polvo", "1 vaina de vainilla, solo semillas", "50ml / 1¾fl oz calvados"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Para el fondant de chocolate, engrase cuatro moldes dariole con mantequilla, espolvoree ligeramente con harina y colóquelos en una bandeja para hornear.", "Coloque el chocolate amargo y la mantequilla en un tazón grande sobre una fuente de agua hirviendo a fuego lento (no permita que el agua toque el fondo del tazón). Deja durante unos cinco minutos o hasta que el chocolate y la mantequilla se hayan derretido y luego revuelve. Dejar enfriar por unos minutos.", "Con cuidado agregue el azúcar y luego agregue los huevos de a uno por vez, revolviendo bien entre cada adición. Mezcle bien y luego doble suavemente la harina.", "Divida la mezcla por igual entre los moldes. Coloque en el horno precalentado y cocine durante 8-10 minutos. Retire del horno y deje enfriar por 2-3 minutos. Mientras el fondant está en el horno, prepare las peras caramelizadas.", "Para las peras caramelizadas, caliente la mantequilla en una sartén hasta que comience a burbujear. Agregue las peras y fría, revolviendo regularmente hasta que estén tiernas (aproximadamente cinco minutos).", "Agregue el azúcar y cocine hasta que el azúcar se dore. Gire las peras en el azúcar y la mantequilla hasta que estén completamente cubiertas. Dejar de lado.", "Para los calvados y la crema de vainilla, mezcle cuidadosamente la crema, el azúcar, las semillas de vainilla y los calvados en un tazón, asegurándose de que el azúcar esté bien incorporado.", "Para servir, coloque cada fondant en el centro de una de las cuatro placas; el exterior debería haber formado una costra ligera alrededor del centro cálido y húmedo. Cubra con una cucharada de calvados y crema de vainilla y sirva las peras al lado."], "url": "www_bbc_co_uk_food_recipes_chocolatefondantcara_91425", "title": "Fondant de chocolate, peras caramelizadas y calvados y crema de vainilla", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["15g / ½ oz de azúcar moreno oscuro", "200ml / 7fl oz azotes o crema doble", "Glucosa 20 g / ¾oz", "60g / 2¼ oz de azúcar en polvo", "jugo de limón, al gusto", "pizca de sal", "pimienta negra recién molida, al gusto", "15 g / ½ oz de cacao en polvo", "15 g / ½ oz de azúcar en polvo", "80g / 2¾oz de chocolate negro de buena calidad, mínimo 60% de sólidos de cacao, aproximadamente picados", "80g / 2¾oz de mantequilla, más extra para engrasar", "2 huevos de gallinas camperas", "1 yema de huevo de gallinas camperas", "45g / 1½ oz de azúcar glas", "18g / ¼-½ oz de arrurruz", "90ml / 3¼fl oz de leche entera", "130g / 4½oz de chocolate negro de buena calidad, mínimo de 80% de sólidos de cacao, aproximadamente picados", "azúcar glas, al polvo", "2-3 cucharadas de almendras caramelizadas y pistachos, picados", "4 quenelles de helado de pistacho confeccionado"], "method": ["Para el caramelo salado, coloque el azúcar moreno oscuro y la crema en una cacerola. Con las manos y la cuchara bien mojadas, agregue la glucosa a la mezcla de azúcar y crema y lleve la mezcla a ebullición. (NB: la glucosa se pega a las manos y cucharas secas).", "Mientras tanto, caliente el azúcar en polvo en otra sartén a fuego lento, revolviendo continuamente hasta que esté dorado y caramelizado. Retire del fuego al instante.", "Con cuidado, vierta la crema caliente y la mezcla de glucosa sobre el azúcar caramelizado (la mezcla puede chisporrotear) y vuelva a hervir a fuego lento la mezcla. Continúe cocinando a fuego lento hasta que la mezcla de caramelo se espese y oscurezca y la temperatura llegue a 102ºC. (NB: Use un termómetro de azúcar para verificar la temperatura del caramelo.)", "Retire la sartén del fuego y mezcle cuidadosamente el jugo de limón y la sal. Sazonar con pimienta negra recién molida y revuelva suavemente una vez más. Dejar enfriar un poco.", "Vierta el caramelo en pequeños moldes de silicona o bandejas de cubitos de hielo. Cuando el caramelo se haya enfriado por completo, congélelo durante al menos 2 horas o hasta que esté listo. (NB: No necesitará todo el caramelo para esta receta. El caramelo restante puede guardarse en el congelador hasta por 3 meses).", "Para el fondant de chocolate, engrase el interior de 4 moldes para anillos, de 5 cm / 2 pulgadas de diámetro y 6 cm / 2½ pulgadas de profundidad, con mantequilla ablandada.", "En un tazón, mezcle el cacao en polvo y el azúcar en polvo hasta que estén bien combinados. Polvo el interior del anillo se moldea con la mezcla, sacudiendo cualquier exceso. Coloque los moldes de anillo preparados en una bandeja de horno forrada con papel resistente a la grasa.", "Derrita el chocolate y la mantequilla en un tazón resistente al calor colocado sobre una fuente de agua hirviendo a fuego lento (no permita que la base del recipiente toque el agua).", "Mientras tanto, coloca los huevos y la yema de huevo en un bol y mezcle hasta que estén pálidos y esponjosos.", "Tamizar el azúcar glas en los huevos batidos, batiendo hasta que estén bien combinados. A continuación, tamice en el arrurruz y bata hasta que la mezcla esté pálida, espesa, duplique su volumen y los batidores dejen un rastro en la superficie de la mezcla cuando se levante. (NB: Esto se llama la etapa de cinta).", "Batir la mezcla derretida de chocolate en la mezcla de huevo hasta que esté bien combinada.", "Usando un cucharón, llene cada uno de los moldes de anillo preparados con la mezcla de fondant de chocolate hasta que estén llenos tres cuartos.", "Agregue una pieza de caramelo congelado al centro de cada molde anular y presione hacia abajo para que quede anclado a la mitad del molde. Suavemente empuje la mezcla de fondant de chocolate sobre el caramelo para cubrirlo por completo. Enfríe los fondant de chocolate en la nevera durante al menos 30 minutos y hasta 24 horas.", "Cuando los fondants de chocolate se hayan enfriado, precaliente el horno a 200C / 390F / Gas 6.", "Transfiera los fondant de chocolate refrigerados al horno y hornee por 5 minutos, o hasta que las partes superiores hayan formado una costra. Retire los fondants del horno y permita que se enfríen.", "Cuando los fondants se hayan enfriado, pase un cuchillo de mantequilla por el interior de cada molde para aflojar los fondants. Retire con cuidado los moldes. Enfríe los fondants en la nevera durante al menos 30 minutos.", "Mientras tanto, para la salsa de chocolate, caliente la leche en una sartén hasta que esté hirviendo a fuego lento. Agregue el chocolate y bata bien hasta que esté suave y bien combinado, luego retírelo del fuego.", "Cuando esté listo para servir, precaliente el horno a 180 ° C / 355 ° F / Gas 4.", "Hornee los fondants por 8 minutos o hasta que los pasteles se hayan levantado.", "Para servir, coloque una cucharada de salsa de chocolate en el centro de cada una de las cuatro placas para servir, alisándola en forma oblonga. Espolvorea los fondant de chocolate con azúcar glas y colócalos encima del charco de salsa, en el medio. Espolvorea los pistachos caramelizados y las almendras alrededor del plato. Coloque una quenelle de helado de pistacho al lado del fondant. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_chocolatefondantwith_93623", "title": "Fondant de chocolate con caramelo salado", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["55g / 2 oz de azúcar", "55 ml / 7 fl oz de agua", "200g / 7oz de chocolate puro, roto en pedazos", "1 cucharada de jarabe de oro", "selección de frutas cortadas en piezas del tamaño de un bocado, como naranja, plátano, uvas, dátiles o piña."], "method": ["Caliente el azúcar y el agua en una cacerola hasta que el azúcar se derrita y la mezcla se asemeje a un jarabe.", "Derretir el chocolate en un recipiente a prueba de calor sobre una olla de agua hirviendo. (No mucho, la base del recipiente toca el agua).", "Agregue el almíbar dorado y suficiente jarabe de azúcar para formar una salsa suave. (Precaución: la mezcla de chocolate estará muy caliente, permita que se enfríe un poco antes de servir).", "Sirve con el plato de fruta."], "url": "www_bbc_co_uk_food_recipes_chocolatefonduewithf_10465", "title": "Fondue de chocolate con bandeja de frutas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolatefonduewithf_10465_16x9.jpg", "isVegetarian": true, "recommendations": 0}]