[{"ingredients": ["300g / 10½oz de arroz basmati", "Filete de ternera magra de 500 g / 1 lb 2 oz", "1 cucharada de aceite de sésamo", "1 diente de ajo, finamente picado", "1 tallo de limoncillo, finamente triturado", "2.5cm / 1 en pieza de jengibre fresco de raíz, finamente picado", "1 pimiento rojo, sin corazón, sin semillas y en rodajas gruesas", "1 pimiento verde, sin corazón, sin semillas y rebanado grueso", "1 cebolla, rebanada gruesa", "2 cucharadas de jugo de lima", "pimienta negra recién molida", "hojas de cilantro, para adornar"], "method": ["Coloque el arroz en una olla con tapa, cúbralo con agua y llévelo a ebullición. Coloque la tapa sobre la olla y reduzca el calor. Cocine a fuego lento durante unos 10 minutos, o hasta que el arroz esté suave.", "Cortar la carne a través del grano en tiras largas y delgadas.", "Caliente el aceite en un wok o en una sartén grande a fuego alto. Agregue el ajo y saltee por 1 minuto. Agregue la carne y saltee durante otros 2-3 minutos, o hasta que estén ligeramente coloreados. Agregue la hierba de limón y el jengibre y retire la sartén del fuego. Retire la carne de la cacerola y déjela a un lado.", "Regrese la sartén al fuego. Agregue los pimientos y la cebolla a la sartén y saltee durante 2-3 minutos, o hasta que las cebollas comiencen a dorarse y suavizarse.", "Regrese la carne a la sartén, mezcle el jugo de lima y sazone al gusto con pimienta negra. Adorne con el cilantro y sirva."], "url": "www_bbc_co_uk_food_recipes_thai_beef__mixed_pepper_58157", "title": "Carne de res tailandesa y pimienta mezclada salteados", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_beef__mixed_pepper_58157_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Pescado blanco de 400g / 14oz, como la pescadilla o abadejo", "1 cucharada de salsa de pescado", "1 cucharada de pasta de curry rojo", "1 tira de ralladura de lima", "1 cucharada de cilantro fresco picado", "1 huevo de gallinas camperas", "1 cucharada de azúcar mascabado", "Frijoles finos de 60 g / 2¼ oz, picados", "½ cucharadita de sal", "70 ml / 2½ fl oz de agua", "Vinagre de vino de arroz 150ml / 5fl oz", "150 g / 5½ oz de azúcar en polvo", "1½ cucharadita de salsa de pescado tailandés", "3 chiles rojos picados", "1 zanahoria, finamente picada", "¼ de cebolla, finamente picada", "1 pepino, cortado en tiras"], "method": ["Para las croquetas de pescado, mezcle el pescado, la salsa de pescado, la pasta de curry rojo y la ralladura de lima en un procesador de alimentos o licuadora.", "Agregue el cilantro picado, los huevos, el azúcar mascabado, los frijoles finos y la sal.", "Con las manos mojadas, moldee la mezcla en empanadas y colóquela en una bandeja para hornear. Transferir a la nevera para establecer.", "Precalentar el horno a 180C / 350F / Gas 4.", "Cuando esté listo para cocinar, caliente una sartén a prueba de horno a fuego medio y coloque las hamburguesas en la sartén para colorear a cada lado, luego hornee en el horno durante cinco minutos hasta que estén cocidas.", "Para el pepino agridulce, vierta el agua, el vinagre, el azúcar y la salsa de pescado en una sartén pequeña y cocine a fuego lento.", "Agregue los ingredientes restantes y retírelos del fuego para que se asienten y se enfríen.", "Sirva los pasteles de pescado con los pepinos agridulces en un tazón de servir al costado."], "url": "www_bbc_co_uk_food_recipes_thai-style_fishcakes_68632", "title": "Tarta de pescado al estilo tailandés con pepinos agridulces", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 filetes de carne frita", "1 cucharada de aceite vegetal", "1 cucharada de salsa de soja", "2 zanahorias pequeñas", "5 cebollas de primavera", "1 mango maduro", "2 lechugas gemelas bebé o 1 lechuga pequeña", "puñado de cacahuetes salados (aproximadamente 40 g / 1½ oz), opcional", "1 diente de ajo", "1 lima, solo jugo", "1 cucharada de azúcar en polvo", "1 cucharadita de hojuelas de chile"], "method": ["Pon los filetes en un tazón poco profundo. Vierta el aceite y la salsa de soja y frótelos en la carne para que quede toda recubierta. Déjelo marinar mientras preparas las verduras. (Lávese las manos después de tocar carne cruda).", "Pele las zanahorias y luego use el pelador para hacer cintas delgadas. Separar las hojas de lechuga, lavar las hojas y escurrir en un colador. Cortar finamente las cebollas de primavera, luego pelarlas, cortarlas con piedra y cortar finamente el mango. Combina las verduras en un tazón grande.", "Caliente una sartén grande a fuego alto, agregue los filetes y cocínelos durante 1 minuto por cada lado, o cocine por un minuto extra en cada lado para obtener un medio. Retire los filetes de la sartén y transfiéralos a un plato para descansar.", "Mientras los filetes están en reposo, prepare el aderezo. Pele y ralle el ajo y luego colóquelo en un tazón con el jugo de lima, azúcar y hojuelas de chile y agítelos juntos. Vierta el aderezo sobre las verduras preparadas y agregue los cacahuetes. Cortar la carne finamente, agregar al recipiente junto con los jugos de reposo y mezclar. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_thai_beef_and_mango_98996", "title": "Ensalada tailandesa de carne y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_beef_and_mango_98996_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 pechugas de pollo sin piel y sin hueso", "3 cucharadas de pasta de curry rojo tailandés", "3 cucharadas de aceite de girasol", "2 cebollas en rodajas", "4cm / 1½ en perilla de jengibre fresco de raíz, pelado y finamente rallado", "1 cucharada de harina normal", "2 x 400 g de leche de coco con toda su grasa", "1 cucharada de salsa de pescado tailandesa", "1 cucharada de azúcar mascabado ligero", "1 tallo de hierba de limón, golpeado (ver consejo)", "4 hojas de lima Kaffir", "250g / 9 oz de azúcar guisantes, cortados por la mitad a lo largo", "½ lima, ralladura y jugo", "1 x 225 g de castañas de agua de estaño, escurridas, partidas a la mitad y descuartizadas si son grandes", "sal y pimienta negra recién molida"], "method": ["Corta las pechugas de pollo por la mitad y luego en rodajas largas y delgadas. Incline en un recipiente y agregue 1 cucharada de pasta de curry tailandés, sazone con sal y pimienta negra recién molida y mezcle.", "Caliente 1 cucharada de aceite de girasol en una sartén honda, agregue las rodajas de pollo y fríaselas a fuego alto durante 5 minutos hasta que queden bien cocidas; es posible que deba hacerlo en tandas. Transfiere las rodajas de pollo cocidas a un plato.", "Agregue el aceite restante a la sartén y fría las cebollas durante 3 minutos. Cubra con una tapa, baje el fuego y cocine por otros 10 minutos para ablandar.", "Aumentar el fuego y agregar el jengibre con la pasta de curry tailandés restante y freír durante un minuto. Espolvoree la harina y mezcle la leche de coco con la salsa de pescado y el azúcar, agregando poco a poco. Revuelve la mezcla y lleva a ebullición. Agregue la hierba de limón y las hojas de lima y sazone con sal y pimienta negra recién molida. Regrese el pollo a la sartén, vuelva a hervir y luego cubra, reduzca el fuego y cocine a fuego lento durante aproximadamente 5 minutos, o hasta que esté caliente.", "Mientras tanto, cocine los chícharos en agua hirviendo con sal durante 2 minutos, escurra y vuelva a cargar en agua fría.", "Retire la hierba de limón y las hojas de lima del curry y deséchelas. Agregue la ralladura de limón y el jugo, las castañas de agua y los guisantes de azúcar. Llevar a ebullición, luego retirar del fuego y servir con arroz."], "url": "www_bbc_co_uk_food_recipes_thai_chicken_curry_06763", "title": "Curry de pollo tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_chicken_curry_06763_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 raíces de cilantro picadas", "4 dientes de ajo", "5 chiles, finamente picados (semillas opcionales)", "1 cucharada de salsa de ostras", "1 cucharada de vinagre de vino de arroz", "2 cucharadas de salsa de soja", "2 cucharadas de salsa de pescado tailandesa", "½ lima, solo jugo", "4 chiles de ojo de pájaro picados", "4 dientes de ajo, toscamente picados", "½ cucharadita de sal marina gruesa", "aceite vegetal, para freír", "10 chalotes tailandeses, en rodajas finas", "700 g / 1 lb 9 oz de carne (ya sea solomillo o costilla), picada en trozos grandes (como si se tratara de un filete de carne: puedes pedirle a tu carnicero que lo pique groseramente)", "1 pimiento rojo pequeño, finamente cortado en cubitos", "4 huevos de gallinas camperas", "2 cucharadas de salsa de pescado tailandesa", "1 cucharada de salsa de ostras", "2 cucharadas de salsa de soja", "1½ cucharadas de azúcar de palma", "un buen puñado de albahaca tailandesa y un puñado más pequeño de albahaca santa (opcional)", "arroz recién hecho, para servir"], "method": ["Para la salsa, coloque las raíces de cilantro, el ajo y los chiles en un almirez y mortero y aplaste ligeramente. Agregue los ingredientes restantes para la salsa al mortero y déle una buena molienda para infundir los sabores. Poner en un tazón para servir o en tazones para mojar.", "Para la carne de res, en el mismo mortero (no se preocupe por lavarlo), coloque los chiles, los dientes de ajo y la sal marina. Moler hasta que tenga una pasta.", "Calentar un wok con tres cucharadas de aceite vegetal, agregar los chalotes picados y freír durante 3-4 minutos. Baje el fuego y luego agregue el chile molido y la pasta de ajo hasta que estén ligeramente dorados (aproximadamente un minuto), revolviendo continuamente a fuego lento para que el ajo no se queme. Encienda el fuego y agregue la carne de res y los pimientos rojos, y cocine hasta que la carne esté casi cocinada, esto solo tomará de 4 a 5 minutos.", "Mientras tanto, mientras la carne se cocina, caliente una sartén mediana con dos cucharadas de aceite vegetal. Freír cuatro huevos hasta que estén crujientes por fuera, pero las yemas todavía están líquidas", "Agregue la salsa de pescado, salsa de ostras, salsa de soja y azúcar de palma y un buen puñado de hojas de albahaca y doblar a través de la carne cocida. Dividir en tazones adecuados y servir con el arroz y la salsa en el lado."], "url": "www_bbc_co_uk_food_recipes_thai_beef_stir_fry_28048", "title": "Salteado de carne tailandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 muslos de pollo deshuesados ​​y sin piel (aproximadamente 150 g / 5½ oz)", "2 pechugas de pollo deshuesadas y sin piel (aproximadamente 300 g / 10½ oz)", "2 cucharadas de aceite vegetal", "2 chalotes de plátano, picados", "2 dientes de ajo, finamente picados", "1 chile rojo, sin semillas, finamente picado", "1 cucharadita de jengibre rallado finamente rallado", "2 cucharaditas de pasta de curry verde tailandés", "200ml / 7fl oz crema de coco", "150ml / 5fl oz de caldo de pollo", "2 hojas de lima, rasgadas", "1 tallo de limoncillo, magullado", "1 batata pequeña (aproximadamente 175g / 6oz), pelada y cortada en cubos de 1cm / ½ en cubitos", "1 cucharada de harina de maíz, mezclada con un chorrito de agua", "pimienta negra", "salpicaduras de salsa de pescado tailandés", "Harina normal 150g / 5½ oz", "pizca de sal fina", "40 g / 1½ oz de mantequilla sin sal, refrigerada, cortada en aproximadamente 1 cm / ½ en cubos", "35 g / 1 / oz de manteca de cerdo, refrigerado, cortado en aproximadamente 1 cm / ½ en cubos", "1 cucharadita de jugo de limón (opcional)", "1 huevo de gallinas camperas, batido, para esmaltar"], "method": ["Para el relleno, corte todo el pollo en trozos de 15 mm / 5/8 pulg. Caliente el aceite en una sartén o en una cacerola ancha a fuego medio-bajo. Agregue los chalotes, el ajo, el chile y el jengibre y freír suavemente durante unos minutos, o hasta que estén suaves pero no coloreados.", "Agregue la pasta de curry y cocine por un minuto o dos. Agregue las piezas de pollo, aumente el fuego un poco y cocine, revolviendo todo el tiempo, hasta que el pollo haya perdido su aspecto crudo. Agregue la crema de coco, caldo de pollo, hojas de lima, limoncillo y camote. Cocine a fuego lento durante 12-15 minutos, o hasta que la batata esté tierna.", "Agregue la harina de maíz, hierva a fuego lento y revuelva hasta que la salsa comience a espesarse. Quítate el fuego y condimenta, al gusto, con pimienta negra y un poco de salsa de pescado. Deja enfriar. Retire el limoncillo y las hojas de lima y transfiera a un plato de tarta de 1,2 litros / 2 pinta.", "Para hacer la masa de copos, ponga la harina y la sal en un tazón. Agregue la mantequilla y la manteca de cerdo y frote ligeramente con las puntas de los dedos hasta que la mezcla se asemeje a finas migas de pan. Alternativamente, haga esto en un procesador de alimentos o en un mezclador y luego transfiéralo a un tazón.", "Usando un cuchillo de mesa, trabaje en dos cucharadas de agua fría y el jugo de limón (si se usa) hasta que la masa se una. Agregue un poco de agua extra si es necesario.", "Cuando la masa comience a pegarse, use sus manos para amasar suavemente en forma de bola. Envuelva la masa en una película adhesiva y colóquela en la nevera para que descanse durante aproximadamente 30 minutos.", "Precalentar el horno a 200C / 400F / Gas 6.", "Estirar la masa sobre una superficie de trabajo ligeramente enharinada. Corta una tira larga de 2cm / ¾ pulgada de ancho, humedece el borde del plato para pastel con agua y presiona la tira de repostería. Use un cortador de celosía para cortar un patrón en la masa restante. Tire de la masa muy suavemente para abrir el enrejado, luego coloque sobre el pastel. Presione los bordes hacia abajo para sellar, luego recorte el exceso de masa. Cepille la parte superior del pastel con huevo batido.", "Hornee durante aproximadamente 30 minutos o hasta que la masa esté dorada. Deje la tarta para sentarse en la lata durante cinco minutos antes de servir."], "url": "www_bbc_co_uk_food_recipes_thai_chicken_pie_20300", "title": "Pastel de pollo tailandés", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_chicken_pie_20300_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["4 cm / 1½ en pieza de galanga fresca, pelada, picada", "2.5cm / 1 en pieza de jengibre fresco, pelado, picado", "2 tallos de limoncillo, hojas exteriores eliminadas, núcleo interno picado", "2 dientes de ajo, pelados", "1 chile rojo, sin tallo", "2 limas, cáscara y jugo", "3 cucharadas de salsa de soja", "pequeño racimo de cilantro fresco, raíces y hojas picadas por separado", "1 x 100 g / 3½ oz bloque de coco seco", "24 gambas grandes, peladas, sin cabeza", "½ coco fresco, solo carne", "½ lima, cortada en cuñas, para servir"], "method": ["Mezcle la galanga, el jengibre, el limoncillo, el ajo, el chile, la ralladura y el jugo de las limas, la salsa de soja, las raíces de cilantro y el coco seco en un procesador de alimentos hasta que se combinen bien como una pasta espesa y áspera.", "Transfiera la pasta a una bolsa de congelador que se pueda volver a sellar y añada las gambas. Selle la bolsa, eliminando la mayor cantidad de aire posible mientras lo hace, luego masajee la mezcla en las gambas y déjela a un lado en el refrigerador para marinar durante 1-2 horas, o durante la noche, si es posible.", "Calentar una sartén a fuego medio. Usando un pelador de patatas, afeite el coco fresco en la sartén, luego seque las virutas de coco hasta que estén ligeramente tostadas. Dejar de lado.", "Cuando las gambas se hayan marinado, caliente una sartén a fuego medio a alto. Cuando la sartén esté caliente, sacuda el exceso de adobo de las gambas, colóquelas en la plancha, en lotes si es necesario, y ase de 2 a 3 minutos, o hasta que estén rosadas y opacas.", "Para servir, divida los camarones de coco y chile por igual entre cuatro platos para servir. Espolvorear sobre las hojas de cilantro, virutas de coco y adornar con una rodaja de limón."], "url": "www_bbc_co_uk_food_recipes_thai_coconut-chilli_60337", "title": "Gambas tailandesas de coco y chili", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 10}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_coconut-chilli_60337_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filete de fletán deshuesado y deshuesado de 500 g / 1 lb 2 oz, picado", "1 cucharada de salsa de pescado tailandesa", "1 cucharada de salsa de curry rojo tailandés", "1 hoja de lima kaffir, finamente rebanada", "1 pieza de tamaño galangal, picado finamente", "1 stick lemongrass (solo la parte blanda), finamente rebanada", "1 raíz de cilantro y hojas picadas", "1 huevo de gallinas camperas", "1 cucharadita de azúcar de palma rallada", "50g / 1¾oz de frijoles serrados, en rodajas finas (alternativamente, use judías verdes)", "½ lima, solo jugo", "harina común, para quitar el polvo", "3 cucharadas de aceite de cacahuete, para freír poco", "2 cucharadas de vinagre de vino de arroz", "2 cucharadas de miel clara", "½ lima, solo jugo", "1 cucharada de salsa de pescado tailandesa", "100g / 3½oz de pepino, pelado, sin corazón y cortado en cubitos", "50g / 1¾oz de zanahoria, finamente picada", "1 chalote, finamente cortado en cubitos", "2 chiles de ojo de pájaro, semillas retiradas (si se desea), cortadas en rodajas finas", "hojas de banana", "lechuga de cordero"], "method": ["Para las tortas de pescado, coloque el pescado, la salsa de pescado, la pasta de curry rojo, la hoja de lima, galanga, hierba de limón, raíz de cilantro, huevo, azúcar de palma, frijoles y jugo de lima en un procesador de alimentos y mezcle hasta obtener una pasta. Alternativamente, esto se puede hacer en una mano de mortero - machacar los ingredientes en una pasta similar a la gelatina.", "Retire y, con las manos húmedas, tome una pieza del tamaño de una nuez. Enróllalo en una bola y luego aplástalo en un disco delgado. Poner en un plato enharinado. Repita hasta que se haya usado toda la mezcla. Refrigere hasta que esté listo para cocinar.", "Para la inmersión, bata el vinagre, la miel, dos cucharadas de agua, el jugo de limón y la salsa de pescado. Pruebe y ajuste la miel y el jugo de lima para que sea más dulce o más amargo, como lo desee. Agregue el pepino, la zanahoria, la chalota y el chile. Deja durante 30 minutos a una hora para que se desarrollen los sabores.", "Caliente el aceite de cacahuete en una sartén y cocine las tortas de pescado hasta que estén doradas, esto debería llevar un par de minutos por cada lado.", "Servir en una hoja de plátano con la salsa en un plato a un lado. Adorne con la lechuga de cordero."], "url": "www_bbc_co_uk_food_recipes_thai_fish_cakes_with_a_37638", "title": "Tartas de pescado tailandés con salsa de miel y pepino", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Hace 18-20", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_fish_cakes_with_a_37638_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 caparazón de cangrejo, roto", "300ml / 10fl oz de caldo de pollo", "1 tallo de limoncillo, finamente picado", "2 hojas de lima kaffir, finamente trituradas", "1 guindilla roja larga, más o menos picada", "2 chalotes, 1 más o menos picado, 1 finamente picado", "1 cucharada de puré de tomate", "300ml / 10fl oz de aceite vegetal", "50g / 1¾oz de mantequilla", "75g / 3oz de arroz arborio", "1 cucharadita de pasta de curry verde tailandés", "5 cucharadas de vino Moscatel", "1 cucharada de cilantro picado", "1 chile verde, finamente picado", "Crema doble 50ml / 2fl oz", "50g / 1¾oz escogió carne de cangrejo marrón", "110g / 4oz escogió carne de cangrejo blanca", "2 cucharadas de parmesano recién rallado", "1 cucharada de mascarpone", "1 lima, solo jugo", "1 cucharada de berro de coriandro"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para hacer una reserva, coloque la mitad de la cáscara de cangrejo en una olla. Agregue el caldo de pollo, la hierba de limón y una hoja de lima kaffir y caliente suavemente.", "Coloque el resto de la cáscara de cangrejo en una lata de asar con el chile rojo, el chalote picado y el puré de tomate. Vierta todo el aceite vegetal, luego coloque en el horno durante 30 minutos.", "Retire el cangrejo del horno, mezcle bien y luego cuele cuidadosamente el aceite en un recipiente esterilizado y déjelo a un lado.", "Caliente una sartén grande o saltee la sartén hasta que esté a fuego medio. Agregue la mantequilla, la chalota finamente picada y la hoja de lima kaffir restante.", "Agregue el arroz y mezcle bien para cubrir con la mezcla mantecosa, luego agregue la pasta de curry verde tailandés y el vino y cocine hasta que el líquido haya sido absorbido y el arroz esté casi seco.", "Colar el caldo de cangrejo tibio y agregarlo al arroz poco a poco. Cocine por 15-20 minutos, o hasta que el arroz esté tierno y la mayor parte del caldo absorbido.", "Cuando el arroz esté tierno, mezcle el cilantro picado, el chile verde, la crema y doble el cangrejo recogido.", "Agregue el parmesano, el mascarpone y el jugo de lima. Controle el condimento y agregue más sal y pimienta según sea necesario.", "Cuchara en platos para servir y luego esparza con un poco de berro de cilantro y termina con un chorrito de aceite de cangrejo."], "url": "www_bbc_co_uk_food_recipes_thai_crab_risotto_with_18400", "title": "Risotto de cangrejo tailandés con limoncillo y lima kaffir", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 120}, "serves": "Sirve 2-3", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Filetes de pescado blanco sin piel de 450 g / 1 lb (como el ling, eglefino o bacalao), huesos extraídos", "1 cucharada de salsa de pescado", "1 huevo grande de gallinas camperas", "buen puñado de cilantro fresco, toscamente picado", "1 cucharada de pasta de curry rojo", "1 chile rojo, sin grano y finamente picado", "2 dientes de ajo, finamente picados", "1 pedazo de raíz de jengibre fresco, del tamaño de un pulgar, pelado y finamente picado", "1 lima, ralladura y jugo", "75 g / 2½ oz de judías verdes, finamente picadas", "6 cebollas de primavera, más o menos picadas", "200 g / 7 oz de semillas de sésamo", "4 cucharadas de aceite de girasol", "salsa dulce de chile, para servir", "1 cucharadita de azúcar en polvo", "1 lima, ralladura y jugo", "3 cucharadas de salsa de pescado", "½ chile rojo, finamente picado", "cacahuetes grandes y tostados, tostados", "1 zanahoria, pelada y cortada en tiras parecidas a espaguetis con un pelador juliana o espiralizador", "1 pepino, rebanado en hebras de espagueti con un pelador juliana o espiralizador", "3-4 chalotes, en rodajas finas", "1 chile rojo, finamente cortado", "gran puñado de brotes de soja", "buenas hojas de menta"], "method": ["Para las tortas de pescado, coloque el pescado en un procesador de alimentos y mezcle durante 3 segundos hasta que quede suave. Agregue la salsa de pescado, el huevo, el cilantro, la pasta de curry, el chile, el ajo, el jengibre, la ralladura de lima y el jugo y vuelva a mezclar hasta que todo esté combinado.", "Retire la cuchilla del procesador de alimentos y revuelva a través de las judías verdes y la mitad de las cebolletas. Con las manos húmedas, forma la mezcla en 12 bolas y aplástalas para hacer pasteles de pescado. Cubra cada torta de pescado con las semillas de sésamo.", "Calentar el aceite en una sartén grande y freír las croquetas de pescado en lotes durante unos 2 minutos por cada lado. Retirar con una rodaja de pescado y escurrir en un plato forrado con papel de cocina.", "Mientras tanto, para el aderezo, bata el azúcar impalpable, la ralladura de lima y el jugo y la salsa de pescado hasta que el azúcar impalpable se haya disuelto. Batir en el chile rojo.", "Para la ensalada, tueste los cacahuetes en una sartén seca hasta que estén dorados, retire de la sartén y revuelva aproximadamente en un mortero.", "Coloque todo el resto de los ingredientes de la ensalada en un tazón grande. Verter sobre el aderezo y darle una buena mezcla para combinar.", "Adorne los pasteles de pescado con las cebolletas restantes y sirva inmediatamente con la ensalada y salsa de chile dulce."], "url": "www_bbc_co_uk_food_recipes_thai_fish_cakes_with_a_57303", "title": "Tartas de pescado tailandés con una ensalada crujiente de pepino y zanahoria", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Mejillones de 1kg / 2lb 4 oz, fregados y rellenos", "4 cebolletas, más o menos picadas", "4 dientes de ajo, finamente picados", "15g / ½ oz de jengibre fresco, pelado y más o menos picado", "1 varita de limoncillo, amoratada", "4 hojas de lima Kaffir frescas o secas", "1 cucharada de pasta de curry verde tailandés", "1 leche de coco de 400ml de estaño", "1 cucharada de salsa de pescado tailandesa", "4 cucharadas de aceite de girasol", "1 chile verde, finamente cortado", "1 chalota de plátano, en rodajas finas", "cilantro de racimo pequeño, picado"], "method": ["Precaliente el horno a 200 ° C / 180 ° Ventilador / Gas 6. Cubra una bandeja para hornear con una hoja grande de papel de cocina.", "Deseche los mejillones con cáscaras rotas y los que se nieguen a cerrarse al tocarlos.", "Coloque los mejillones, cebolletas, ajo, jengibre, limoncillo y hojas de lima en la mitad de la lámina. Coloca los mejillones con la pasta de curry tailandés y rocía con un poco de leche de coco y salsa de pescado. Selle la lámina alrededor de los bordes para hacer una bolsa con forma de pastel y hornee en el horno durante 5-10 minutos.", "Para hacer la guarnición, caliente el aceite en una sartén pequeña y agregue el chile y los chalotes, y cocínelos durante 3-4 minutos o hasta que estén crujientes. Drene en papel de cocina una vez.", "Retire los mejillones del horno y abra el paquete. Deseche los mejillones que permanecen cerrados, luego decore con chile frito y chalotas y una pizca de cilantro fresco."], "url": "www_bbc_co_uk_food_recipes_thai_fragrant_mussels_59021", "title": "Mejillones fragantes tailandeses", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 tallos de limoncillo, picados", "4 chiles verdes, sin semillas, picados", "4 hojas de lima, picadas", "1 lima, cáscara y jugo solamente", "1 chalote de plátano, picado", "Botón de 2cm / gain galangal (o jengibre fresco de raíz)", "2 dientes de ajo, pelados y picados", "4 cucharadas de raíz de cilantro", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de granos de pimienta negra triturada", "2 cucharadas de salsa de pescado tailandesa", "1 cucharadita de azúcar de palma", "2 cucharadas de aceite vegetal", "Leche de coco 400ml / 14fl oz", "125g / 4½ oz de berenjenas", "2 limas, solo jugo", "12 vieiras salteadas a mano, vieiras retiradas y huevas descartadas", "2 cucharadas de hojas de cilantro picado", "2 cucharadas de albahaca tailandesa, rasgada"], "method": ["Para la pasta, coloque todos los ingredientes en una licuadora y mezcle hasta que quede suave.", "Para el curry, caliente un wok y agregue una cucharada de aceite y la pasta. Cocine por un par de minutos y luego agregue la leche de coco, las berenjenas y el jugo de lima.", "Mientras tanto, caliente una sartén grande y agregue el aceite restante. Una vez caliente, agregue las vieiras. Cocine por un par de minutos en cada lado.", "Para servir, coloque las vieiras en platos para servir y vierta sobre la salsa, o deje caer las vieiras en la salsa justo antes de servir. Adorne con el cilantro y la albahaca tailandesa."], "url": "www_bbc_co_uk_food_recipes_thai_green_curry_with_67823", "title": "Curry verde tailandés con vieiras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["3 tallos de limoncillo, picados", "4 chiles verdes de ojo de pájaro, semillas retiradas y picadas", "4 hojas de lima, picadas", "1 lima, cáscara y jugo solamente", "1 chalote de plátano, picado", "Botón de 2cm / gain galangal (o jengibre fresco de raíz)", "4 cucharadas de tallos de cilantro picado", "1 cucharadita de comino molido", "1 cucharadita de cilantro molido", "½ cucharadita de granos de pimienta negra triturada", "2 cucharadas de salsa de pescado tailandesa", "1 cucharadita de azúcar de palma", "2 cucharadas de aceite vegetal", "8 muslos de pollo, desollados, deshuesados ​​y picados", "Leche de coco 400ml / 14fl oz", "125g / 4½ oz de berenjenas", "2 limas, solo jugo", "2 cucharadas de hojas de cilantro picado", "2 cucharadas de albahaca tailandesa, rasgada", "400g / 14oz de arroz pegajoso", "150ml / 5fl oz de leche de coco", "1 cucharadita de sal", "1 cabeza de brócoli o 250 g / 9 oz de brócoli brotación púrpura", "300g / 10½ oz azucarados guisantes", "1 chalota, en rodajas", "2 cucharadas de aceite vegetal", "4 cucharadas de cilantro fresco", "75g / 2¾oz de cacahuetes salados, picados"], "method": ["Coloque todos los ingredientes para la pasta en una licuadora y mezcle hasta que quede suave.", "Caliente un wok y agregue 1 cucharada de aceite. Agregue la pasta y el pollo y cocine por un par de minutos. Luego agregue la leche de coco, las berenjenas y el jugo de lima. Cubra con una tapa y cocine a fuego lento durante 10-15 minutos, o hasta que el pollo esté completamente cocido.", "Para el arroz pegajoso, enjuague el arroz 3 veces y drene. Ponga el arroz en una cacerola y cubra con leche de coco y agua a aproximadamente 1 cm / ½ pulgada por encima del arroz. Agregue la sal y cubra con una tapa. Coloque en el fuego y llevar a ebullición. Hierva durante 5 minutos, luego, sin abrir la tapa, apague el fuego y caliente durante 20 minutos.", "Caliente un vaporizador y cocine el brócoli y los guisantes durante 2-3 minutos.", "Para la guarnición, caliente una sartén pequeña y agregue el aceite. Una vez caliente, agregue las chalotas y freír hasta que estén doradas, escurrir sobre papel de cocina.", "Coloque el arroz pegajoso y el curry en tazones para servir y decore con cilantro fresco, cacahuates y chalotes fritos. Sirva los vegetales al vapor en un lado."], "url": "www_bbc_co_uk_food_recipes_thai_green_curry_with_89282", "title": "Curry verde tailandés con arroz pegajoso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 huevos de gallinas camperas", "75g / 3oz de carne picada de pavo", "90g / 3¼oz de pan rallado, dividido", "1 cucharadita de pasta de curry verde tailandés", "2 cucharadas de harina normal"], "method": ["Precalentar el horno a 180C / 350F / Gas 4.", "Batir uno de los huevos en un tazón. Agregue la carne picada de pavo, pan rallado de 30 g / 1 oz y pasta de curry verde tailandés hasta que estén bien combinados. Divida la mezcla en cuatro porciones y enrolle cada una en una bola.", "Batir el huevo restante en un recipiente, espolvorear la harina y las migas de pan restante en placas separadas. Enrolle las albóndigas en la harina, luego sumerja el huevo batido y revuelva en las migas de pan.", "Transfiera a una bandeja para hornear y hornee en el horno por 15-20 minutos, o hasta que se dore."], "url": "www_bbc_co_uk_food_recipes_thai_green_turkey_balls_28079", "title": "Albóndigas de pavo verde tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 chalotes tailandeses, finamente picados", "3 dientes grandes de ajo, finamente picados", "pieza del tamaño de un pulgar galangal, rallada groseramente", "5 chiles verdes tailandeses, finamente picados", "12cm / 5in stalk lemongrass, hojas exteriores eliminadas y parte blanca finamente cortada en rodajas", "6 raíces de cilantro, lavadas y picadas", "½ cucharadita de pasta de camarón", "3 hojas de lima Kaffir, finamente picadas", "1 cucharadita de granos de pimienta blanca, aplastados", "3 cucharadas de aceite vegetal", "Solomillo de cerdo de 500 g / 1 lb 2 oz, picado", "5 berenjenas verdes tailandesas, cortadas en cuartos", "400g / 14oz de caldo de pollo", "2 chiles rojos pequeños perforados para obtener calor adicional, picados, con o sin semillas", "2 cucharadas de salsa de pescado tailandesa", "4 hojas de lima kaffir", "25g / 1oz de krachai, en rodajas finas (una versión más suave de galangal y jengibre, de la misma familia)", "1 cucharada de azúcar de palma", "Calabaza de 400 g / 14 oz, en cubitos", "Berenjenas de guisantes de 40 g / 1½ oz, disponibles en tarros en grandes supermercados o frescos en supermercados asiáticos", "1 tallo de granos de pimienta verdes frescos (opcional), alternativamente use ½ cucharadita de granos de pimienta verde en salmuera de un recipiente", "7 judías largas chinas, cortadas en rodajas de 2,5 cm / 1 in, alternativamente, use judías verdes", "1 gran puñado de albahaca santa, desgarrada", "arroz al vapor o hervido, para servir"], "method": ["Para la pasta, coloque todos los ingredientes en una licuadora pequeña con dos cucharadas de agua y mezcle, o pique finamente y triture en un mortero.", "Para el curry, coloque un wok grande a fuego medio, agregue el aceite vegetal y luego agregue la pasta. Revuelva de vez en cuando durante 3-4 minutos para cocinar.", "Agregue la carne de cerdo y saltee para dorar la carne por todos lados. Agregue los cuartos de berenjena verde tailandesa, el caldo de cultivo, el chile y la salsa de pescado. Llevar a ebullición y luego reducir el fuego a fuego lento y cocinar durante 5-8 minutos.", "Agregue las hojas de lima, kracthai, azúcar de palma, calabaza, berenjenas de guisantes y granos de pimienta verdes frescos (o granos de pimienta en salmuera).", "Cocine por otros 10 minutos o hasta que la calabaza y las berenjenas verdes estén a punto de cocinarse.", "Finalmente agregue los frijoles largos picados y cocine a fuego lento durante cuatro minutos. Revuelve a través de la albahaca santa justo antes de servir. Sirva con arroz al vapor o hervido."], "url": "www_bbc_co_uk_food_recipes_thai_jungle_curry_13331", "title": "Curry tailandés de la selva", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["2 chiles rojos, 1 picado, 1 rebanado fino (para decorar)", "4 dientes de ajo, aplastados", "90g / 3¼ oz de raíz de jengibre, más o menos picada", "2 cucharadas de azúcar de palma (o azúcar moreno claro)", "6 cucharadas de salsa de soja", "4 cucharadas de salsa de pescado", "300g / 10½oz de cordero sobrante cocinado, grasa dejada en, corte en rodajas gruesas", "½ pepino, cortado por la mitad a lo largo, finamente cortado en diagonal", "100g / 3½oz de guisantes frescos", "100g / 3½oz de guisantes azucarados, cortados longitudinalmente", "75g / 3oz de soja", "6 cebollas de primavera, cortadas, cortadas en diagonal", "3 cucharadas de hojas de menta fresca picadas", "pequeñas ramitas de cilantro puñado", "2 limas, solo jugo", "Brotes de 25 g / 1 oz de guisantes"], "method": ["Mezcle el chile picado, el ajo, el jengibre y el azúcar de palma en una pasta fina en un procesador de alimentos. Agregue las salsas de soja y pescado y mezcle nuevamente. Pruebe y ajuste el aderezo si es necesario.", "Calentar una sartén a fuego medio a alto. Agregue las rodajas de cordero y fría por 2-3 minutos, o hasta que estén crujientes por un lado. Agregue la mitad del aderezo de chile y jengibre y continúe cocinando hasta que las rodajas de cordero estén cubiertas y se caliente. Retire el cordero pegajoso de la sartén y déjelo a un lado.", "En un tazón, mezcle bien el pepino, los guisantes, los chícharos, los frijoles, las cebolletas, las hojas de menta y el cilantro hasta que estén bien combinados. Agregue suficiente del aderezo restante para cubrir los ingredientes, luego rocíe gradualmente en el jugo de lima, probando regularmente. Agregue los brotes de guisantes y mezcle bien.", "Para servir, divida la ensalada por igual entre cuatro platos para servir. Cubra cada porción con algo del cordero. Rocíe un poco más del aderezo, espolvoree con el chile en rodajas finas y sirva inmediatamente."], "url": "www_bbc_co_uk_food_recipes_thai_lamb_salad_with_26133", "title": "Ensalada tailandesa de cordero con aderezo picante", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_lamb_salad_with_26133_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 vainas de cardamomo, solo semillas", "1 cucharadita de semillas de comino", "5 dientes", "1½ anís estrellado", "1 cucharadita de granos de pimienta entera", "½ cucharadita de canela molida", "2 cucharaditas de copos de chile seco", "2 cucharadas de aceite de cacahuete", "Cacahuetes de 25g / 1oz", "5 dientes de ajo, pelados y toscamente picados", "5 hojas de lima finamente cortadas", "3.5cm / 1½ en pieza de galanga fresca, pelada y picada", "2 ramas de limoncillo, hojas externas retiradas, núcleo interno finamente picado", "1 cucharadita de pasta de camarón", "2 cucharadas de salsa de pescado", "½ cucharadita de nuez moscada rallada o molida", "2 cucharadas de azúcar de palma", "2 cucharadas de agua fría", "2 cucharadas de aceite vegetal", "2 cebollas rojas, en rodajas", "Pechuga de pollo de 500 g / 1 lb 2 oz, cortada en tiras de 1,5 cm / ½ pulgada", "1 papa grande, pelada y cortada en cubos de 1.5cm / ½ in", "2 chiles rojos de ojo de pájaro, cortados casi por la mitad a lo largo (o más, al gusto)", "250ml / 9fl oz de caldo de pollo de buena calidad, preferiblemente hecho en casa", "200ml / 7fl oz de leche de coco", "2 tomates, pieles eliminadas, carne picada", "6 hojas de lima", "2 cucharadas de salsa de pescado", "1½ cucharadas de azúcar de palma", "2 cucharadas de salsa de soja", "1 lima, solo jugo", "pequeño puñado de albahaca tailandesa dulce (o albahaca normal), más ramitas adicionales para servir", "Cacahuetes tostados 25g / 1oz, tostados", "arroz pegajoso al vapor", "1 chile rojo grande, rebanado diagonalmente"], "method": ["Para la pasta de curry massaman, calienta una sartén pequeña a fuego medio. Cuando la sartén esté caliente, agregue las semillas de cardamomo, semillas de comino y clavo de olor y fríalos durante 1-2 minutos, o hasta que estén fragantes.", "Transfiera las especias a un molinillo de especias o una mano de mortero y muela hasta formar un polvo.", "Mezcle las especias molidas con todos los ingredientes restantes de masa de curry massaman en un procesador de alimentos, hasta que estén suaves y bien combinados. (Alternativamente, machaque la pasta hasta que esté suave en un almirez y mortero.) Enfríe hasta que se necesite, cubierto.", "Para hacer el pollo al curry, caliente el aceite en una cazuela de tamaño mediano, a prueba de llamas y con tapa. Agregue las cebollas y fría por 8-10 minutos, o hasta que estén suaves y doradas.", "Aumente el fuego, empuje las cebollas a un lado de la cacerola, luego agregue las tiras de pollo al otro lado y fría por 2-3 minutos en todos los lados, o hasta que estén selladas por completo.", "Agregue la mitad de la pasta de curry massaman a la cazuela (ver consejo). Revuelva bien para cubrir el pollo y las cebollas en la pasta. Freír la mezcla durante 1-2 minutos, o hasta que esté fragante.", "Agregue las papas, chiles, caldo de pollo, leche de coco, tomates, hojas de lima, salsa de pescado, azúcar de palma y salsa de soja a la cazuela. Revuelva bien y lleve la mezcla a ebullición, luego cubra la cazuela con la tapa y reduzca el fuego hasta que la mezcla esté hirviendo a fuego lento. Continúe cocinando a fuego lento durante 12-15 minutos, o hasta que el pollo esté bien cocido (no cocine demasiado el pollo ya que se secará). Sazonar, al gusto, con un poco más de salsa de pescado o un poco de jugo de limón.", "Justo antes de servir, agregue las hojas de albahaca y la mitad de los cacahuetes.", "Para servir, vierta el curry massaman tailandés en tazones y adorne con las hojas de albahaca tailandesas adicionales, el chile rojo rebanado y los cacahuates restantes. Sirva con arroz pegajoso al vapor."], "url": "www_bbc_co_uk_food_recipes_thai_massaman_chicken_82428", "title": "Curry de pollo massaman tailandés", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["100g / 3½oz de fideos secos de trigo integral", "200 g / 7 oz de carne picada de cerdo", "2 cucharadas de aceite de oliva", "2 cucharadas de pasta de curry verde tailandés", "700ml / 1¼ pintas de caldo de verduras buenas y buenas", "sal y pimienta negra recién molida", "gran racimo de cilantro fresco, picado, para servir (opcional)"], "method": ["Hervir los fideos en agua con sal según las instrucciones del paquete.", "Coloque la carne picada de cerdo en un recipiente y sazone con sal y pimienta. Ruede en ocho bolas con las palmas de sus manos.", "Calienta la mitad del aceite en una sartén de base pesada. Freír las albóndigas, volteándolas regularmente, durante 6-8 minutos, o hasta que estén doradas por todos lados y cocidas.", "Caliente el aceite restante en una cacerola de base pesada. Agregue la pasta de curry y cocine, revolviendo, durante 1 minuto. Vierta el caldo y cocine a fuego lento durante 5 minutos.", "Divide los fideos entre dos tazones. Vierta el caldo tailandés. Coloque las albóndigas y agregue el cilantro, si lo usa."], "url": "www_bbc_co_uk_food_recipes_thai_noodle_and_pork_29741", "title": "Sopa de fideos y carne de cerdo tailandesa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de girasol", "2 dientes de ajo, picados", "3cm / 1¼ en pieza de raíz fresca de jengibre, pelada y cortada en fósforos finos", "1 estrella de anís", "½ canela largo o 1 palo corto, roto en fragmentos", "2-3 tallos frondosos de la parte superior de 1 apio en barra, tallos cortados en trozos cortos, hojas toscamente picadas", "1½ cucharada de salsa ligera de soja", "1 cucharada de salsa de soja oscura", "1 cucharada de salsa de ostras", "¼ cucharadita de pimienta blanca molida", "1 cucharadita de concentrado de caldo de pollo", "1 cucharada de ketjap manis (o 1 cucharada de salsa de soja oscura mezclada con 1 cucharada de azúcar moreno oscuro)", "10 gambas crudas peladas, descongeladas si están congeladas", "80g / 2¾oz de fideos de frijol mungo (vidrio) o fideos de arroz, empapados y escurridos según las instrucciones del paquete", "pizca de grasa canela molida", "pizca de tierra pizca grasa"], "method": ["En un alto fuego, caliente el aceite en un wok grande. Agregue el ajo, el jengibre, el anís estrellado, la canela y los tallos de apio en rodajas, reserve las hojas de apio para una guarnición. Cocine, revolviendo, durante 1 minuto. Agregue las dos salsas de soja y deje hervir a fuego lento durante 30 segundos, luego agregue la salsa de ostras y la pimienta molida.", "Agregue 100ml / 3½fl oz de agua fría, seguido del concentrado de caldo de pollo y el ketjap manis (o la mezcla de salsa de soja oscura con azúcar morena), revuelva hasta que todo esté bien combinado y llévelo a ebullición.", "Agregue los langostinos, sumergiéndolos en el líquido. Cocine a fuego lento hasta que las gambas estén cocidas. Finalmente, agregue los fideos escurridos y revuelva bien - encuentro un par de horquillas de pasta, una en cada mano, lo mejor para esto - para que todo se combine y la mayor parte del líquido oscuro se absorba. Agregue las pizcas de canela molida y clavo de olor, revuelva de nuevo, y si no está sirviendo directamente del wok, viértalo en un recipiente para servir y espolvoree con las hojas de apio picadas reservadas."], "url": "www_bbc_co_uk_food_recipes_thai_noodles_with_72276", "title": "Fideos tailandeses con canela y gambas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Porciones 2", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/thai_noodles_with_72276_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["6 cápsulas de cardamomo, agrietadas y semillas reservadas", "1 cucharadita de semillas de comino", "5 dientes", "1½ anís estrellado", "1 cucharadita de granos de pimienta blanca", "½ cucharadita de canela molida", "2 cucharaditas de copos de chile seco", "2 cucharadas de aceite de cacahuete", "5g cacahuetes", "5 dientes de ajo, picados", "5 hojas de lima finamente cortadas", "Galanga 30g / 1oz, pelado y toscamente picado", "2 tallos de limoncillo, pelados y finamente picados", "1 cucharadita de pasta seca de camarón", "2 cucharadas de salsa de pescado tailandesa", "½ cucharadita de nuez moscada recién rallada", "2 cucharadas de azúcar de palma rallado", "2 cucharadas de aceite de cacahuete", "2 cebollas rojas en rodajas", "Jersey Royals de 250 g / 9 oz, divididos a la mitad o en cuartos según el tamaño", "2 chiles rojos de ojo de pájaro, cortados", "250ml / 9fl oz de caldo de pollo", "250ml / 9fl oz de leche de coco baja en grasa", "2 tomates, desollados y finamente picados", "6 hojas de lima kaffir", "1½ cucharadita de azúcar de palma rallada", "2 cucharadas de salsa de soja", "2 cucharadas de salsa de pescado tailandés, más extra a gusto", "500g / 1lb 2 oz de gambas, sin venas", "1 lima, solo jugo", "puñado de albahaca tailandesa", "Cacahuetes tostados 25g / 1oz, cortados áspero", "1 chile rojo grande, sin semillas y cortado en ángulo", "arroz cocido al vapor, para servir"], "method": ["Para hacer la pasta de curry, en una sartén pequeña y seca tuesta el cardamomo, semillas de comino, clavo de olor y anís estrellado. Incline en una licuadora pequeña o molinillo de especias, o mortero, y póngalo a polvo. Agregue todos los demás ingredientes junto con 2 cucharadas de agua y mezcle hasta obtener un pegamento. Dejar de lado.", "Para el curry, caliente el aceite en una sartén grande y cocine las cebollas durante unos minutos hasta que estén suaves y doradas. Agregue la mitad de la pasta de curry y cocine por un minuto más o menos. Agregue las papas, los chiles cortados en rodajas, el caldo, la leche de coco, los tomates picados, las hojas de lima, el azúcar de palma, la salsa de soja y la salsa de pescado. Cocine a fuego lento durante unos 15 minutos hasta que las papas estén tiernas y los maravillosos sabores se hayan desarrollado.", "Agregue las gambas y cocine por un par de minutos hasta que estén cocidas.", "Verifique el condimento, agregue un poco más de salsa de pescado si es necesario, y agregue el jugo de limón y la albahaca, guardando algunas hojas para adornar. Agregue la mitad de los cacahuetes picados.", "Para servir, espolvorear en tazones y decorar con la albahaca reservada, los cacahuetes y completar con el chile rojo. Sirva con un poco de arroz cocido al vapor."], "url": "www_bbc_co_uk_food_recipes_thai_massaman_prawn_09170", "title": "Curry tailandés de massaman gambas con papas Jersey Royal", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}]