[{"ingredients": ["aceite de girasol, para engrasar", "3 hojas de gelatina de hoja", "150ml / 5fl oz de leche entera", "600 ml / 1 pinta de crema individual", "150g / 5fl oz de azúcar en polvo", "1 canela grande", "7 bolsitas de té con té verde", "1 bolsita de té de desayuno inglés", "12 vainas de cardamomo, solo semillas", "115g / 4oz de mantequilla sin sal ablandada", "115g / 4oz de azúcar glas", "Harina común 115g / 4oz", "3 claras de huevo de gallinas camperas grandes, ligeramente batidas", "1 cucharadita de extracto de vainilla", "½ cucharadita de vainas de cardamomo, solo semillas"], "method": ["Para la panna cotta de té verde, engrase ligeramente seis platos de ramekin de 150ml / 5fl oz o moldes dariole con aceite de girasol.", "Remoje la gelatina de hojas en un recipiente con agua fría durante 10 minutos.", "Vierta la leche y la crema en una cacerola y agregue el azúcar, la canela, las bolsitas de té y las semillas de cardamomo. Calienta a fuego muy lento, gradualmente lleva la leche a ebullición y revuelve suavemente hasta que todo el azúcar se haya disuelto. Retire la sartén del fuego.", "Exprima el exceso de agua de las hojas de gelatina suavizadas y mezcle con la leche tibia hasta que se disuelva. Cuele la mezcla a través de un tamiz forrado con muselina en una jarra resistente al calor, luego vierta la mezcla en los moldes de dariole preparados o moldes. Dejar enfriar por completo, luego enfriar en la nevera durante al menos cuatro horas, pero preferiblemente durante la noche, hasta que se endurezca.", "Para las galletas tuile, bata la mantequilla y el azúcar glas juntos en un tazón para mezclar hasta que estén pálidos, esponjosos y suaves. Cuidadosamente doblar la harina, seguido por los huevos batidos blancos y extracto de vainilla. Cubra el tazón con film transparente y enfríe en la nevera durante una hora.", "Mientras la mezcla de galleta tuile está en reposo, cubra una bandeja para hornear con papel de silicona. Tome un pedazo de plástico resistente, como la tapa limpia de un cartón de helado y corte cuatro agujeros de 5cm / 2in, dejando un espacio de 2.5cm en cada hoyo y descartando los círculos que corta (la tapa del helado sé tu plantilla).", "Cuando la mezcla de galletas tuile descansa, precaliente el horno a 180C / 350F / Gas 4.", "Coloque la plantilla sobre el papel de silicona. Con una espátula, distribuya un poco de la mezcla en los orificios para crear cuatro discos delgados, planos y uniformes. Retire la plantilla con cuidado y espolvoree los bizcochos con semillas de cardamomo.", "Hornee las galletas tuile en el horno durante 5-10 minutos, o hasta que estén crujientes y doradas en los bordes. Retire del horno y, aún caliente, envuelva la cara expuesta de cada galleta sobre un rodillo (u otra superficie curva, como una taza), retire con cuidado el papel de silicona y déjelo enfriar.", "Repita el proceso de cocción y configuración con la mezcla restante de galleta tuile. Deberías terminar con galletas elegantemente rizadas.", "Cuando la panna cotta esté lista para servir, sumerja los moldes rápidamente en agua hirviendo y coloque la panna cotta en platos para servir. Sirve con las galletas tuile."], "url": "www_bbc_co_uk_food_recipes_green_tea_panna_cotta_14475", "title": "Panna cotta de té verde con galletas de cardamomo tuile", "time": {"preparation": "durante la noche", "preparationMins": 0, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 30}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/green_tea_panna_cotta_14475_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de harina italiana '00'", "2 huevos de gallinas camperas", "pizca de sal", "75g / 2½oz de espinaca cocida en polvo, bien drenada", "600 g / 1 libra de queso burrata mozzarella de 5 oz", "50 g / 1¾oz de queso parmesano, recién rallado", "60 g / 2¼ oz de mantequilla sin sal", "20 g / ¾oz de piñones, tostados", "1 cucharada de hojas frescas de romero", "80g / 3oz de queso parmesano, recién rallado"], "method": ["Para hacer la pasta, tamice la harina en una superficie de trabajo, formando un montículo en forma de volcán con un pozo en el centro. Rompe los huevos en el pozo y agrega la sal y la espinaca. Incorpore los huevos y la espinaca en la harina con un tenedor y sus manos, y gradualmente arrastre la harina en la mezcla de huevo hasta que forme una pasta gruesa.", "Agregue un poco más de harina si la mezcla es demasiado suave o pegajosa, o un poco de agua si la mezcla está demasiado seca. Usando un cuchillo (o una espátula), raspa cualquier trozo de masa.", "Antes de amasar la masa, limpie sus manos y la superficie de trabajo. Enharina ligeramente la superficie de trabajo, y empiece a amasar la masa con la palma de una mano ya que puede romper la masa. Trabaje la masa durante 10-15 minutos hasta que la consistencia sea suave y elástica. Si la masa se pega a tus dedos, frota tus manos con un poco de harina. Envuelva la masa en una película adhesiva o papel de aluminio y déjelo reposar durante al menos media hora.", "Estirar la pasta, a máquina o con un rodillo, en dos hojas largas, de aproximadamente 15-20 cm de ancho y 2 mm de grosor. Corta la mozzarella burrata en 12 piezas.", "Coloque una hoja de pasta en la superficie de trabajo. Ponga seis pedazos de mozzarella en forma pareja a lo largo de un lado de la lámina de pasta y espolvoree con la mitad del parmesano.", "Cepille los pedazos de queso con agua y doble el otro lado de la lámina de pasta. Cubra los seis pedazos de queso presionando la masa alrededor de cada uno para expulsar el aire. Cortar en rectángulos con una rueda de pasta o un cuchillo afilado para hacer seis grandes raviolis. Cubra con un paño de cocina mientras prepara los ravioles restantes.", "Repita con la otra hoja de pasta, usando el resto de las piezas de burrata y el parmesano restante.", "Cocine los raviolis con cuidado en abundante agua hirviendo con sal durante 2-3 minutos o hasta que estén al dente. Derretir la mantequilla en una sartén con los piñones y el romero. Deje que la mantequilla caliente absorba el sabor de la hierba durante dos minutos. Saque los ravioles del agua y colóquelos en la sartén con la mantequilla derretida y los piñones.", "Sirva la pasta en platos calientes, espolvoreados con más parmesano."], "url": "www_bbc_co_uk_food_recipes_green_pasta_ravioli_with_90869", "title": "Ravioles de pasta verde con burrata mozzarella", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 70}, "serves": "Sirve 4-6 (hace 12 raviolis grandes)", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["175g / 6oz de azúcar moreno claro", "Vinagre de vino blanco 150ml / 5fl oz", "1 chalote, pelado, finamente picado", "1 diente de ajo, pelado, finamente picado", "2cm / ¾ en pieza de jengibre fresco, pelado, finamente rallado", "1 chile rojo, finamente picado", "125g / 4½oz sultanas", "600 g / 1 libra de tomates verdes de 5 oz, en cuartos"], "method": ["Caliente el azúcar en una sartén hasta que el azúcar se derrita y caramelice.", "Agregue el vinagre de vino blanco, el chalote, el ajo, el jengibre, el chile, la pasas sultanas y los tomates verdes y deje que la mezcla hierva. Reduzca el fuego y cocine a fuego lento durante 1 hora, o hasta que la salsa picante se haya espesado y puede dibujar una cuchara de madera en la base de la sartén para que deje un canal detrás que no se llene de líquido inmediatamente.", "Vierta la salsa picante en frascos esterilizados."], "url": "www_bbc_co_uk_food_recipes_green_tomato_chutney_41573", "title": "Chutney de Tomate Verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Hace aproximadamente 600 g / 1 libra 5 oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/green_tomato_chutney_41573_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frijoles verdes finos de 300g / 10½oz, cortados y partidos a la mitad", "Habas de bebé de 200g / 7oz", "Mangetout de 200 g / 7 oz, reducido a la mitad longitudinalmente", "2 cucharadas de menta fresca picada", "sal marina gruesa y pimienta negra", "30g / 1oz de mantequilla", "3 cucharadas de alcaparras, mantenidas enteras", "1 cucharada de jugo de limón"], "method": ["Ponga a hervir una olla grande de agua con sal y cocine los frijoles y las habas durante 3 minutos. Agregue el mangetout y cocine por otros 2 minutos. Escurrir y verter en un recipiente caliente. Agregue la mitad de la menta, sazone con sal y pimienta y mezcle.", "Derrita la mantequilla en una cacerola a fuego alto. Agregue las alcaparras, el jugo de limón, las verduras blanqueadas y la menta restante. Calentar brevemente y mezclar antes de servir. Sirve caliente."], "url": "www_bbc_co_uk_food_recipes_green_vegetables_with_71110", "title": "Verduras verdes con mantequilla de alcaparra menta", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Frijoles verdes finos de 225 g / 8 oz, coronados y con cola", "Mangetout de 100 g / 4 oz, rallado en diagonal", "175g / 6oz de soja", "1 cebolla roja, cortada muy finamente", "200g / 7oz de setas de paja enlatadas", "1 cucharada de arroz o vinagre de vino blanco", "2 cucharadas de salsa de soja ligera", "5-10ml / 1-2tsp de aceite de sésamo", "1 cucharadita de azúcar morena sin procesar", "1 cucharada de hojas de cilantro fresco, picado aproximadamente", "1 cucharada de albahaca tailandesa, picada aproximadamente", "3 cebollas de primavera, ralladas finamente", "algunas ramitas de cilantro fresco y hojas de albahaca", "1 cucharada de semillas de sésamo, tostadas"], "method": ["Cueza al vapor las judías verdes y mangetout por 3 minutos. Colóquelo en un colador y revuélvalo con agua corriente fría. Desagüe.", "Coloque los frijoles, el mangetout, los brotes de soja, la cebolla y los champiñones en un tazón grande y mezcle bien.", "En un tazón pequeño mezcle el vinagre, la salsa de soya, el aceite de sésamo y el azúcar. Agregue el cilantro y las hojas de albahaca, vierta sobre los ingredientes de la ensalada y mezcle bien.", "Transfiera a un plato de servir y esparza sobre cebollas de primavera, hojas de hierba y semillas de sésamo tostadas."], "url": "www_bbc_co_uk_food_recipes_greenbeanandbeanspro_8812", "title": "Ensalada de frijoles verdes y frijoles", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["75 g / 2½ oz de judías verdes, coronadas y de cola", "1 pimiento rojo, en rodajas", "2 cucharadas de cilantro fresco picado", "2 cucharaditas de semillas de sésamo, tostadas", "30g / 1oz de nueces de Brasil, picadas", "4 cucharadas de aceite de oliva", "2 cucharadas de vinagre balsámico", "1 cucharada de vinagre de vino tinto", "1 cucharadita de mostaza Dijon", "sal y pimienta negra recién molida"], "method": ["Coloque las judías verdes en un recipiente de vapor y déjelas hervir durante 4-5 minutos, hasta que estén tiernas. Transfiera a un tazón, agregue el resto de los ingredientes de la ensalada y sazone al gusto con sal y pimienta negra recién molida. Revuelva bien para combinar.", "Cuchara en un recipiente para servir y servir."], "url": "www_bbc_co_uk_food_recipes_greenbeanredpepperan_88959", "title": "Ensalada de judías verdes, pimiento rojo y nuez de Brasil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 yema de huevo de gallinas camperas", "½ chalota, finamente picada", "½ cucharadita de vinagre de vino blanco", "50ml / 2fl oz de aceite de oliva", "100 g / 3½ oz de judías verdes, blanqueadas, refrescadas", "sal y pimienta negra recién molida"], "method": ["En un tazón grande mezcle la yema de huevo, la chalota y el vinagre. Poco a poco agregue el aceite mientras bate para crear una emulsión espesa, y luego sazone, al gusto, con sal y pimienta negra recién molida.", "Agregue los frijoles al aderezo y mezcle.", "Para servir, apile los frijoles en un plato alto."], "url": "www_bbc_co_uk_food_recipes_greenbeansalad_84217", "title": "Ensalada de judías verdes", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 libra de judías verdes o bobby francesas", "3 cucharadas de aceite de oliva", "2 dientes de ajo, en rodajas finas", "100g / 4oz de almendras troceadas o enteras", "2 cucharadas de salsa de soja tamari"], "method": ["Coloque los frijoles en agua hirviendo y deje hervir durante 10 minutos. Escurrir y amontonar en un plato caliente.", "Suavemente caliente el aceite con el ajo hasta que esté dorado, rápidamente mezcle las almendras y el tamari, revuelva y dore unos minutos más. Incline sobre las judías verdes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_greenbeanswithgarlic_11974", "title": "Judías verdes con ajo y almendras", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 cucharada de aceite de oliva", "½ cucharadita de semillas de mostaza", "Frijoles verdes de 200g / 7oz, cortados y hervidos", "1 cucharadita de comino en polvo", "1 cucharadita de jengibre rallado pelado y rallado", "¼ cucharadita de sal"], "method": ["Calentar el aceite en una olla. Agregue las semillas de mostaza.", "Unos segundos más tarde vuelca los frijoles con el comino y fríe durante 1 minuto.", "Agregue el jengibre y la sal y saltee a fuego lento durante 5 minutos."], "url": "www_bbc_co_uk_food_recipes_greenbeanswithginger_67362", "title": "Judías verdes con jengibre y mostaza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 buen puñado de judías verdes, recortadas", "4 o más rebanadas de jamón serrano, cortadas en tiras", "3-4 rodajas gruesas de queso taleggio", "un buen aceite de oliva con sabor a glug", "pimienta negra recién molida", "pan de masa fermentada, para servir"], "method": ["Cocine los frijoles en una sartén de agua hirviendo con sal por unos cinco minutos (desea que se doblen un poco, es decir, cuando sean más sabrosos). Escurra los frijoles y agréguelos rápidamente a la sartén caliente, espolvoree el jamón y el queso, gotee sobre el aceite de oliva y sazone bien con pimienta negra recién molida. Mezcle suavemente a fuego lento para que el queso se derrita y haga un aderezo voluptuoso y tibio para los frijoles. Sirva inmediatamente con pan crujiente de masa fermentada. Brie o camembert funcionan bien si no puedes encontrar taleggio."], "url": "www_bbc_co_uk_food_recipes_greenbeanswithhamand_92489", "title": "Judías verdes con jamón y queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de judías verdes, recortadas", "25g / 1oz de mantequilla", "3 cebollas de primavera, en rodajas", "sal y pimienta negra recién molida", "1 cucharada de miel", "2 cucharadas de perejil fresco picado"], "method": ["Cocine los frijoles en una olla con agua hirviendo con sal durante 3-4 minutos, o hasta que se hayan suavizado un poco pero no estén bien cocidos, luego escurra.", "Derrita la mantequilla en una sartén hasta que esté espumosa, luego agregue los frijoles, las cebollas en rodajas y sal y pimienta. Cocine por 2-3 minutos.", "Rocíe las verduras con la miel y agregue el perejil, luego sirva."], "url": "www_bbc_co_uk_food_recipes_greenbeanswithspring_89357", "title": "Judías verdes con cebolletas y mantequilla de perejil", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["450 g / 1 lb de judías verdes o frijoles largos de serpiente", "200 g / 7 oz de carne de cerdo picada", "1 cucharada de salsa de soja", "½ cucharadita de harina de maíz", "1 cucharadita de azúcar", "3 cucharadas de aceite vegetal", "2 dientes de ajo, pelados y aplastados", "1 cucharada de vino de arroz chino", "½ cucharadita de aceite de ají o menos, al gusto", "sal marina y pimienta negra recién molida"], "method": ["Recorte las partes superiores de los frijoles y córtelos en longitudes de 15 cm (6 pulgadas).", "Cocine los frijoles en agua hirviendo a fuego lento durante dos minutos.", "Escurrir y enfriar con agua corriente fría.", "Mezcle el cerdo picado con la salsa de soja, harina de maíz, azúcar, sal marina y pimienta negra recién molida.", "Caliente una cucharada de aceite vegetal en un wok. Cuando el aceite esté caliente agregue los frijoles y saltee rápidamente con una pizca de sal durante un minuto hasta que se arruguen.", "Retire los frijoles y vuelva a calentar el wok, agregue el aceite vegetal restante y los dientes de ajo.", "Cuando esté caliente, deseche el ajo (habrá aromatizado el aceite lo suficiente) y agregue la mezcla de cerdo. Sofreír rápidamente durante tres minutos hasta que se oscurezca.", "Agregue el vino de arroz y el aceite de chile y revuelva.", "Vuelva a poner los frijoles en la salsa y sofríalos brevemente hasta que se mezclen.", "Sirva con abundante arroz al vapor."], "url": "www_bbc_co_uk_food_recipes_greenbeanswoktossedw_74499", "title": "Judías verdes wok-arrojadas con carne de cerdo picante y una lenta quema de chile", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["350g / 12oz de chiles verdes", "350g / 12oz de tomates ciruela, picados", "1 cebolla roja mediana, cortada en cubitos", "3 dientes de ajo picados", "¼ cucharadita de comino molido", "sal", "pimienta negra recién molida"], "method": ["Coloque los chiles en una bandeja de asar y tueste a 220C / 425F / Gas 7 por 10-15 minutos, dependiendo del tamaño de los chiles.", "Deberían estar ennegrecidos por fuera y suaves al tacto.", "Retire la piel negra de los chiles y páselos por un colador fino.", "Dobla junto con los tomates, el ajo, la cebolla y el comino."], "url": "www_bbc_co_uk_food_recipes_greenchillisalsa_71295", "title": "Salsa de chile verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["80g / 2¾oz de hojas y tallos frescos de cilantro, lavados", "20g / ¾oz de hojas de menta fresca, lavadas", "1 diente de ajo, pelado y más o menos picado", "2.5cm / 1 en pieza de jengibre fresco, pelado y toscamente picado", "½ cebolla pequeña picada", "1-2 chiles verdes, o al gusto, semillas retiradas, picadas", "15 nueces de pistacho crudas, conchas eliminadas, picadas", "2 cucharadas de jugo de limón, o al gusto", "sal al gusto", "3 cucharadas de agua"], "method": ["Coloque todos los ingredientes en un procesador de alimentos y mezcle hasta que quede suave."], "url": "www_bbc_co_uk_food_recipes_greenchutney_86561", "title": "Salsa verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace 200ml / 7fl oz", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greenchutney_86561_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["250g / 9oz de coco rallado o coco congelado, descongelado", "o 150g / 5oz de coco desecado", "1 gran manojo de cilantro fresco", "1 gran manojo de menta fresca", "4-5 chiles verdes", "6-8 dientes de ajo", "1 cucharadita (colmada) de semillas de comino", "1 cucharada de azúcar", "1 lima grande, en jugo (o al gusto)", "sal"], "method": ["Pon todos los ingredientes en una licuadora y haz clic hasta que tengas una pasta espesa, agregando un poco de agua si es necesario.", "Pruebe y ajuste el condimento, agregando más jugo de lima si lo desea."], "url": "www_bbc_co_uk_food_recipes_greencoconutchutney_12733", "title": "Chutney de coco verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Hace aprox. 250 g / 9 oz", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["2 cucharadas de aceite vegetal", "½ cucharadita de semillas de mostaza marrón", "4 dientes", "6 vainas de cardamomo verde, ligeramente trituradas", "1 pedazo grande de canela", "1 cebolla pequeña, finamente picada", "Jengibre fresco de 5cm / 2in en pieza, pelado y descuartizado", "2 dientes grandes de ajo", "1 cucharadita de cilantro molido", "300ml / 10½ fl oz de leche de coco", "2-4 chiles verdes, todo entero", "sal al gusto", "100 ml / 3½ fl oz de agua", "10 hojas de curry (disponibles en algunos supermercados y tiendas de comestibles asiáticas)", "½-1 cucharadita de pimienta negra recién molida", "¾ cucharadita de sal masala", "500 g / 1 libra 2 oz de salmón o filetes de pescado blanco firme, cortados en trozos grandes", "2-3 cucharaditas de jugo de limón", "50g / 2oz de hojas y tallos frescos de cilantro picados"], "method": ["Caliente el aceite en una sartén antiadherente, agregue las semillas de mostaza, el clavo de olor, las vainas de cardamomo y la ramita de canela y saltee durante 20 segundos (tenga cuidado, las semillas pueden explotar). Agregue la mitad de la cebolla picada y fría por 4-5 minutos hasta que esté suave.", "Mientras tanto, coloque la cebolla restante, el jengibre, el ajo, el cilantro molido y 100 ml / 3½ fl oz de la leche de coco en una licuadora o procesador de alimentos y mezcle hasta lograr un puré suave.", "Agregue esta mezcla a la sartén junto con los chiles verdes enteros y la sal, al gusto. Cubra con una tapa y cocine a fuego lento durante 12-15 minutos, revolviendo la olla de vez en cuando.", "Agregue la leche de coco restante, el agua, las hojas de currry, la pimienta negra y el garam masala y los pescados, y déjelos cocinar sin interrupción durante aproximadamente 3-5 minutos, hasta que el pescado esté opaco y cocido.", "Para servir, agregue el jugo de limón y el cilantro. Pruebe y ajuste el condimento si es necesario, luego vierta en tazones y sirva con arroz."], "url": "www_bbc_co_uk_food_recipes_greencoconutfishcurr_86736", "title": "Curry de pescado de coco verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 4-6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greencoconutfishcurr_86736_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Colas de rape de 900 g / 2lb, recortadas", "Jengibre fresco de raíz de 5cm / 2in en pieza, pelado y aproximadamente picado", "4 dientes de ajo, toscamente picados", "½ cucharadita de sal", "½ limón, solo jugo", "Raíz de cilantro de 90 g / 3½ oz, más o menos picada", "2 chiles verdes, más o menos picados", "2 cucharadas de aceite vegetal", "200g / 7oz de tomates enlatados, picados", "150ml / 5fl oz de yogur completo natural sin grasa", "sal y pimienta negra recién molida", "4 cucharadas de hojas de cilantro toscamente picadas", "aceite vegetal, para freír", "200g / 7oz de harina de gramo (también llamada harina de garbanzo o besan)", "2 cucharadas de semillas de cilantro, trituradas", "75ml / 3fl oz de agua"], "method": ["Para el rape, corte las colas de rape en rodajas gruesas de 2 cm / 1 en un recipiente.", "Combine el jengibre, el ajo, la sal y el jugo de limón en un procesador de alimentos y mezcle hasta formar una pasta.", "Agregue la pasta al rape y mezcle bien. Déjelo marinar por hasta 30 minutos.", "Mientras tanto, mezcle la raíz de cilantro y los chiles verdes en el procesador para hacer un puré grueso.", "Calentar un wok, luego agregar el aceite vegetal y el rape marinado y saltear durante 1-2 minutos.", "Agregue el cilantro y el chile en puré, y fría por un minuto más. Agregue los tomates y deje hervir, antes de reducir inmediatamente el fuego a fuego lento.", "Cocine a fuego lento durante 2-3 minutos, luego agregue el yogur y cocine durante otros dos minutos, o hasta que espese un poco. Prueba el condimento y agrega sal y pimienta negra recién molida según sea necesario. Agregue la mitad del cilantro picado.", "Para los poppadoms, caliente una sartén pequeña hasta que esté caliente y llénela con 3cm / 1½ en aceite vegetal; mantenga a fuego lento hasta que esté listo para cocinar los poppadoms. No dejes desatendido", "Mezcle la harina de gramo y las semillas de cilantro en un tazón. Agregue el agua y revuelva para formar una masa dura.", "Retire una bola de masa del tazón del tamaño de una nuez y extiéndala sobre una superficie limpia para formar un círculo fino no mayor que la sartén.", "Ajuste el calor hasta que el aceite esté medio caliente (la superficie debe brillar ligeramente). Cocine los poppadoms, uno a la vez, durante 30-45 segundos en cada lado. Retire con una espumadera y escurra sobre papel de cocina. Repita con la masa restante.", "Para servir, espolvorea el rape de cilantro entre cuatro tazones, cúbrelo con el cilantro restante y apila los poppadoms al costado."], "url": "www_bbc_co_uk_food_recipes_greencoriandermonkfi_91175", "title": "Rape verde de cilantro con poppadoms de cilantro", "time": {"preparation": "30 minutos a 1 hora", "preparationMins": 60, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 90}, "serves": "4", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Harina normal de 80g / 3oz", "80g / 3oz de almendras molidas", "Azúcar demerara 80 g / 3 oz", "Azúcar en polvo 80g / 3oz", "una pizca de sal", "80g / 3oz de mantequilla sin sal refrigerada, cortada en cubitos", "500 g / 1 libra de grosella, a la mitad", "125 g / 4½ oz de azúcar en polvo", "½ limón, solo jugo", "2 hojas de gelatina, empapadas en agua fría durante cinco minutos", "250 g / 9 oz de azúcar en polvo", "150ml / 5fl oz de vino rosado", "4 nectarinas grandes y maduras, cortadas a la mitad, sin piedras", "300 g / 10½ oz de grosellas, tallos eliminados, reducido a la mitad", "75g / 2¾oz de azúcar en polvo", "½ limón, jugo y ralladura", "300 ml / 10 fl oz doble crema", "2 vainas de vainilla, divididas longitudinalmente, semillas raspadas", "50g / 1¾oz de azúcar glas", "8 greengages maduros y firmes, cortados a la mitad, sin piedras"], "method": ["Precaliente el horno a 170 ° C / 320 ° F / Gas 3. Engrase ligeramente una bandeja para hornear.", "Para el crumble de almendras, coloque todos los ingredientes secos en un mezclador eléctrico independiente equipado con el accesorio de paleta. Mezcle brevemente a velocidad media, luego agregue la mantequilla y mezcle hasta que se forme una masa desmenuzable.", "Desmenuce la masa en la bandeja de horno engrasada y colóquela en el horno durante 20 minutos, o hasta que se dore, y luego retírela del horno y déjela enfriar.", "Para la mermelada de grosella, coloque las grosellas espinosas, el azúcar, el jugo de limón y 200 ml / 7 fl oz de agua en un tazón y colóquelo sobre una fuente de agua hirviendo, asegurándose de que el agua no toque la base del tazón. Cubra con una tapa y déjelo durante una hora.", "Vierta la mezcla a través de un tamiz fino en un recipiente, descartando los sólidos.", "Mida 400ml / 14fl oz del jugo de grosella, viértalo en una sartén y caliéntelo hasta el punto de ebullición. Retire del fuego.", "Exprima el exceso de agua de la gelatina suavizada y agregue la gelatina al jugo. Batir hasta que la gelatina se disuelva. Divida la mezcla entre ocho vasos redondos y déjelos enfriar. Coloque en la nevera para establecer.", "Para las nectarinas escaldadas, coloque el azúcar y el vino en una sartén de base pesada, agregue 500 ml / 18 fl oz de agua y lleve a ebullición, revolviendo hasta que el azúcar se disuelva.", "Coloca suavemente las nectarinas en el jarabe de caza furtiva. Regrese a ebullición a fuego medio, luego baje la temperatura, tape y cocine a fuego lento durante 8-10 minutos, hasta que las nectarinas estén tiernas cuando las pruebe con un cuchillo pequeño y afilado.", "Retire la sartén del fuego y reserve para enfriar a temperatura ambiente.", "Saque la fruta del jarabe y quite las pieles, luego devuelva la fruta al almíbar y déjela a un lado, tapada, a temperatura ambiente.", "Para el tonto de la grosella espinosa, coloque las grosellas espinosas en una sartén de base pesada y agregue el azúcar, el jugo de limón y la ralladura y una cucharada de agua. Cocine a fuego medio durante unos cinco minutos, hasta que tenga una compota húmeda; la fruta ablandada debe estar unida en sus jugos, pero sin exceso de líquido restante. Retirar del fuego y reservar para enfriar.", "Vierta la crema en un tazón grande y agregue las semillas de vainilla.", "Agregue el azúcar glas a la crema y bata hasta que la crema esté rica y aireada, pero aún conserva su fluidez. Doble suavemente la compota de grosella con una espátula de goma. El tonto terminado debe caerse fácilmente de la espátula, debe ser cremoso, no una mousse rígida y fija.", "Para servir, corte cada mitad de greengage en tres cuñas. Saca las nectarinas del almíbar y córtalas en pedazos de 1cm / ½.", "Divida las nectarinas picadas por igual entre las copas que contienen la mermelada de grosella, y divida todas menos dos cucharadas de la mezcla de almendras entre las copas.", "Cubra la migaja con una capa de tonto de grosella espinosa. Vierta las rodajas verdes en un poco del jarabe de nectarina, colóquelas encima del tonto y termine con una pizca fina del resto del crumble."], "url": "www_bbc_co_uk_food_recipes_greengage_nectarine_and_67971", "title": "Greengage, nectarine y gooseberry tonto", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Sirve 8", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["Greenpeace 750g / 1lb 10oz, piedras removidas, cortadas en cuartos", "270 g / 9½ oz de azúcar en polvo", "5 claras de huevo", "150g / 5½oz de azúcar glas", "300 ml / 10 fl oz doble crema", "1 vaina de vainilla, dividida por la mitad a lo largo, semillas raspadas"], "method": ["Precaliente el horno a 100C / 80C Fan / Gas ¼.", "En una cacerola, caliente los vegetales verdes con 2 cucharadas de agua y 120 g / 4¼ oz de azúcar en polvo a fuego medio durante 15-20 minutos, revolviendo ocasionalmente, hasta que los granos verdes se hayan descompuesto y estén cubiertos con un jarabe pegajoso. Retire la sartén del fuego y déjela enfriar por completo.", "Batir las claras de huevo en un recipiente limpio con un batidor eléctrico hasta que se formen picos suaves cuando se quita el batidor. Agregue el azúcar impalpable restante de 150 g / 5½ oz y bata de nuevo hasta que se formen picos rígidos cuando se quite la batidora.", "Tamice el azúcar glas y continúe batiendo las claras de huevo hasta que la mezcla esté realmente tieso, brillante y se asemeje a la espuma de afeitar.", "Cubra una bandeja para hornear con papel de hornear o silicona, pasando un punto de mezcla de merengue en cada esquina para pegar el papel a la bandeja.", "Con cuidado, dobla la mitad de la mezcla de greengage enfriada en las claras de huevo batidas hasta que hayas creado un efecto dominó. Ponga ocho cucharadas grandes de mezcla de merengue en la bandeja de hornear, dejando un espacio entre cada una.", "Hornee los merengues en el horno durante 2 horas, luego apague el horno y abra ligeramente la puerta (abrirla con una cuchara de madera es un buen truco). Deje que los merengues se enfríen completamente en el horno.", "Mientras tanto, bata la crema doble con las semillas de vainilla hasta que se formen picos suaves cuando se quite la batidora.", "Para servir, extiende un círculo de la mezcla de greengage reservada en el centro de cada plato. Coloque un merengue en la parte superior y cuchara sobre la crema batida. Cubra con un segundo merengue, luego cuchara más greengages. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_greengage_meringues_with_90358", "title": "Merengues greengage con crema", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "más de 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4-6 chiles verdes medianos, sin semillas y picados", "2 chalotes, toscamente picados", "5cm / 2in pieza de jengibre fresco, pelado y rallado", "2 dientes de ajo, aplastados", "pequeño racimo de cilantro fresco, tallos y raíces adjuntos si es posible", "2 tallos de limoncillo, picado (si no está disponible, use 2 cucharadas de secado)", "1 lima, ralladura y jugo", "8 hojas de lima kaffir, rotas en pedazos (si no están disponibles, use la ralladura de 1 lima extra)", "2.5 cm / 1 en pieza galangal, pelado y picado (si está disponible)", "1 cucharada de semillas de cilantro, trituradas", "1 cucharadita de comino molido", "1 cucharadita de pimienta negra, aplastada", "2 cucharaditas de salsa de pescado tailandés o salsa de soja ligera", "3 cucharadas de aceite de oliva"], "method": ["Coloque todos los ingredientes en un procesador de alimentos y rellene hasta pegar. Úselo de inmediato o guárdelo en un frasco en el refrigerador hasta por 3 semanas. Esta cantidad es suficiente para un curry para 8 personas."], "url": "www_bbc_co_uk_food_recipes_greencurrypaste_67789", "title": "La pasta de curry verde", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Sirve 8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/greencurrypaste_67789_16x9.jpg", "isVegetarian": false, "recommendations": 0}]