[{"ingredients": ["1,2 kg / 2 libras 12 oz patatas harinas, como el rey Eduardo, peladas, cortadas en trozos", "aceite de cocina spray", "sal y pimienta negra recién molida"], "method": ["Precaliente el horno a 230C / 210C Fan / Gas 8 o su ajuste más caliente.", "Hervir las papas en agua hirviendo con sal durante 3-4 minutos, luego escurrir en un colador. Pelusa los bordes con un tenedor, luego sazone con sal y pimienta, rocíe bien con aceite de cocina en aerosol.", "Incline las papas en una bandeja grande para hornear y tueste durante 25 minutos. Mézclelos, rocíe con más aceite de cocina y rocíe durante otros 25 minutos, hasta que se doren por todas partes."], "url": "www_bbc_co_uk_food_recipes_low-fat_roast_potatoes_35344", "title": "Patatas asadas bajas en grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-fat_roast_potatoes_35344_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100g / 3½oz de mantequilla sin sal, ablandada", "60g / 2¼oz de azúcar morena mascabado", "1 huevo de gallinas camperas", "2 cucharaditas de extracto de vainilla", "275g / 9¾oz de harina natural, más extra para quitar el polvo", "1 cucharadita de canela molida", "1 cucharada de cáscara confitada finamente picada", "a la mitad de almendras blanqueadas, para decorar"], "method": ["Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4. Cubra una bandeja de hornear con papel resistente a la grasa.", "Bata la mantequilla y el azúcar en un tazón hasta que estén pálidos, livianos y esponjosos. Agriete el huevo y agregue el extracto de vainilla, luego vuelva a batir.", "Mezcle la harina, la canela y la cáscara confitada hasta que la mezcla se una como masa.", "Haga rodar la masa sobre una superficie de trabajo ligeramente enharinada a un grosor de 1 cm / ½ pulg.", "Usando cortadores de galletas o un vaso, corte los bizcochos de la masa y colóquelos cuidadosamente sobre la bandeja para hornear. Decora con las mitades de almendras. Para hacer adornos de árboles de Navidad, haga un agujero cuidadosamente en la parte superior de la galleta con una pajita.", "Hornee los bizcochos por 8-10 minutos hasta que queden dorados. Poner a un lado para endurecer durante 5 minutos, luego enfríe en una rejilla de alambre."], "url": "www_bbc_co_uk_food_recipes_low-sugar_christmas_13043", "title": "Galletas de Navidad baja en azúcar", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Hace 36 galletas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low-sugar_christmas_13043_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 zanahorias", "1 cebolla", "3 ramas de apio, cortadas y lavadas", "1 diente de ajo, pelado", "2 ramitas de tomillo", "1-2 hojas de laurel", "5-6 tallos de perejil, hojas reservadas para decorar", "pizca de sal y pimienta negra recién molida", "1 cucharada de aceite de oliva", "2 cebollas medianas, picadas", "sal marina y pimienta negra", "2 dientes de ajo picados", "1 chile rojo, sin grano y finamente picado", "4 lonchas de tocino ahumado, sin grasa, cortadas en pequeños trozos", "200g / 7oz de lentejas rojas, lavadas a fondo", "1 x 400 g / 14 oz de tomates de hojalata", "1 litro de caldo de verduras casero (ver arriba)", "hojas de perejil (desde arriba), finamente picadas"], "method": ["Primero, haga su caldo de verduras. Rallar las verduras y colocarlas (junto con cualquier otro extremo que no pueda rallar) en un tazón grande resistente al calor. Agregue el tomillo, las hojas de laurel y los tallos del perejil. Sazonar con una pizca de sal y pimienta. Cubra las verduras con 1 litro / 1¾ pintas de agua hirviendo. Deje reposar durante 10 minutos o hasta que se enfríe. Una vez frío, cuele el caldo a través de un colador y deseche las verduras.", "Para la sopa principal, caliente el aceite en una cacerola grande o en una cazuela a fuego medio. Agregue las cebollas y una pizca de sal. Freír suavemente durante dos minutos, luego agregar el ajo y el chile y cocinar a fuego lento durante cinco minutos o hasta que las cebollas estén completamente blandas, pero no coloreadas. Agregue el tocino y fría por 2-3 minutos, o hasta que esté cocido.", "Agregue las lentejas y los tomates, separando los tomates con la cuchara. Cocine por 2-3 minutos, luego agregue suficiente cantidad de vegetales para cubrir (puede necesitarlo todo). Llevar a ebullición y luego reducir a fuego lento. Cocine por 15-20 minutos o hasta que las lentejas estén completamente blandas. Apaga el fuego", "Vierta la mitad de la sopa en una licuadora y pulse hasta que quede suave. Regrese a la sartén con la sopa restante y caliente, pruebe y ajuste el condimento si es necesario.", "Divida la sopa entre tazones para servir, espolvoree con perejil picado y sirva."], "url": "www_bbc_co_uk_food_recipes_low_fat_bacon_and_lentil_02962", "title": "Sopa baja en grasa de tocino y lentejas", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/low_fat_bacon_and_lentil_02962_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150ml / 5fl oz café muy fuerte", "60ml / 2fl oz Tia Maria (opcional)", "½ vaina de vainilla, sin grano", "Crema baja en grasa 250 g / 9 oz", "250ml / 8½fl oz de crema baja en grasa", "2 cucharadas de cacao en polvo", "10 a 12 galletas boudoir", "granos de café cubiertos de chocolate, un poco rallado", "chocolate o un polvo de cacao en polvo"], "method": ["Mezcle el café y la Tía María (si se usa) y déjelo a un lado.", "En un recipiente aparte, agregue la vainilla a la crema fresca, doble la crema y reserve.", "Sumerja los bizcochos en el café y coloque 2 en la parte inferior de cada vaso para servir.", "Vierta una capa de la mezcla de crema en la parte superior y repita.", "Cubra con una guarnición de su elección."], "url": "www_bbc_co_uk_food_recipes_lowfattiramisu_11016", "title": "Tiramisú bajo en grasa", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "no se requiere cocinar", "cookingMins": 0, "totalMins": 30}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["225g / 8oz de mantequilla, ablandada o horneada, más extra para engrasar", "4 huevos de gallinas camperas", "225 g / 8 oz de azúcar en polvo", "300g / 10½ oz de harina de auto crianza", "Polvo de hornear 2 cucharaditas de nivel", "4 cucharadas de leche", "1 cucharadita de extracto de vainilla", "2 cucharadas de mermelada de fresa", "1 cucharadita de jugo de limón", "Fresas frescas pequeñas de 300g / 10½oz, descascadas y cortadas por la mitad", "Crema doble de 300ml / 10½oz, batida", "200ml / 7fl oz crema de grasa", "azúcar en polvo, para quitar el polvo"], "method": ["Precaliente el horno a 180 ° C / 160 ° C Ventilador / Gas 4. Engrase la lata de bandeja con mantequilla o pasta para untar y forre la base y los costados con papel de hornear.", "Mida todos los ingredientes de la torta en un tazón grande y bata bien con una batidora eléctrica durante aproximadamente 2 minutos hasta que estén bien mezclados. Convierta la mezcla en la lata preparada y alise la superficie.", "Hornee durante 35 minutos, o hasta que la torta se haya encogido desde los lados de la lata y salte hacia atrás cuando se presione en el centro con las puntas de los dedos. Dejar enfriar en la lata.", "Retire la torta de la lata y recorte los bordes para que queden perfectamente derechos. Corte la torta longitudinalmente en tres tiras, luego corte a través de cada tira para obtener nueve rodajas de 7x3 cm / 2 x 1½ pulgadas. Corte cada rebanada por la mitad horizontalmente listo para llenar como lo haría con un sándwich.", "Para el relleno, coloque la mermelada en un tazón con el jugo de limón y mezcle, luego mezcle las fresas en la mermelada para obtener un glaseado. Mezcle la crema batida y la crème fraîche juntas y extienda o vierta una capa bastante gruesa sobre la base de cada media esponja. Coloque dos o tres trozos glaseados de fresa en la parte superior y coloque la mitad superior de la esponja encima. Polvo con azúcar glas para servir."], "url": "www_bbc_co_uk_food_recipes_lucys_strawberry_slices_64042", "title": "Rodajas de fresa de Lucy", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Hace 27 rebanadas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lucys_strawberry_slices_64042_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["1 cucharadita de aceite de colza", "1 cebolla, más o menos picada", "1 pimiento rojo, semillas eliminadas, picadas", "Chorizo ​​200g / 7oz, sin piel y picada", "6 huevos de gallinas camperas", "50ml / 2fl de leche en oz", "1 diente de ajo, finamente picado", "200g / 7oz de papas cocidas, más o menos picadas", "100g / 3½oz de guisantes congelados", "2 cucharadas de perejil de flatillo picado", "ensalada verde, para servir", "sal marina y pimienta negra recién molida"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Caliente una sartén a prueba de horno en la cocina hasta que esté caliente, luego agregue el aceite, la cebolla y el pimiento rojo y fría por 2 minutos, hasta que se ablande. Encienda el fuego, agregue el chorizo ​​y cocine por 3-4 minutos hasta que haya liberado su aceite y esté crujiente alrededor de los bordes. La mezcla tendrá un hermoso color rojo.", "Mientras tanto, romper los huevos en una jarra grande y batir con la leche, una pizca de sal y un montón de pimienta negro.", "Agregue el ajo y las papas a la mezcla de chorizo ​​y freír durante otros 2 minutos, revolviendo suavemente, hasta que esté bien caliente. Agregue los guisantes y cocine por otro minuto, hasta que toda la mezcla esté caliente.", "Vierta el huevo, revuelva brevemente, baje a fuego medio y esparza el perejil sobre la parte superior. Fríe sin remover, durante 1-2 minutos, luego levante cuidadosamente el borde de la frittata con una espátula para comprobar si está cocido y dorado por debajo. Si no es así, cocine por un minuto más y luego vuelva a verificar.", "Coloque la sartén en el horno y hornee durante 10-12 minutos. Cuando la parte superior esté burbujeante y ligeramente dorada, use un paño de cocina para agarrar el asa y agite suavemente la sartén. Si el medio se tambalea, necesita un poco más de tiempo. Si es bastante firme, déjalo a un lado para que se enfríe un poco.", "Deslice la frittata fuera de la sartén en un plato. Puedes servir esto caliente o frío, pero asegúrate de dejarlo enfriar a temperatura ambiente antes de guardarlo en un recipiente sellable en la nevera. Cortar en rodajas y servir con una ensalada verde."], "url": "www_bbc_co_uk_food_recipes_lunchbox_chorizo_07622", "title": "Lonchera de chorizo ​​frittata", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lunchbox_chorizo_07622_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["mantequilla, para engrasar", "3 huevos de gallinas camperas", "115 g / 4 oz de azúcar en polvo, más 4 cucharadas de dragado", "1 limón sin cebar, solo cáscara", "Harina común 115g / 4oz", "200g / 7oz de azúcar glas, tamizado", "125g / 4½oz de mantequilla ablandada", "2 cucharaditas de jugo de limón recién exprimido", "125g / 4½oz de cuajada de limón"], "method": ["Engrase y forme una lata de rollo suizo de 33cm x 23cm / 13in x 9in con pergamino horneado con mantequilla.", "Precalentar el horno a 200C / 400F / Gas 6.", "Ponga los huevos, 115 g / 4 oz del azúcar y la ralladura de limón en un recipiente a prueba de calor y coloque sobre una olla de agua hirviendo a fuego lento.", "Batir con un batidor eléctrico hasta que la mezcla esté pálida, cremosa y lo suficientemente espesa como para dejar un rastro cuando se levante el batidor.", "Retire con cuidado la taza del fuego y continúe batiendo por otros cinco minutos.", "Tamiza la mitad de la harina y, con una cuchara grande de metal, dobla ligeramente en la mezcla de huevo.", "Tamice la harina restante y dóblela en la mezcla; es importante usar movimientos suaves para retener la mayor cantidad de aire posible en la mezcla.", "Verter la mezcla lentamente en la lata preparada y extender suavemente con una espátula para que la base de la lata esté uniformemente cubierta.", "Hornee durante 10-12 minutos hasta que estén bien aliñados, de un color marrón dorado claro y firmes al tacto.", "Coloque una toalla de té húmeda sobre la superficie de trabajo y cubra con una hoja de pergamino para hornear.", "Raspe con las cuatro cucharadas de azúcar, esto ayudará a evitar que se pegue la parte exterior de la esponja. Trabajando rápidamente, coloque la torta sobre el papel azucarado y retire cuidadosamente el papel de revestimiento.", "Con un cuchillo afilado, corte los bordes crujientes de los dos lados largos. Haga rodar el rollo suizo desde uno de los extremos cortos, comenzando con un giro cerrado para hacer una buena forma redonda y manteniendo el papel azucarado dentro del rollo. Coloque en una rejilla y déjelo enfriar.", "Para hacer la guinda, ponga el azúcar glas y la mantequilla en un bol y bata hasta que quede suave y cremoso. Agregue el jugo de limón y bata nuevamente.", "Cuando el pastel esté frío, desenrósquelo suavemente pero no lo aplaste o podría romperse.", "Extienda la torta con glaseado de mantequilla de limón, dejando un borde de 1 cm / ½ pulgada.", "Coloque la cuajada de limón en forma pareja sobre la guinda.", "Lentamente, vuelva a enrollar el pastel, encerrando el relleno y colóquelo en un plato. Espolvorea con azúcar extra si quieres."], "url": "www_bbc_co_uk_food_recipes_luscious_lemon_swiss_13163", "title": "Luscious lemon Swiss roll cake", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 1 rollo suizo", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luscious_lemon_swiss_13163_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4 cucharadas de miel clara", "2 cucharadas de mostaza Dijon", "3 dientes de ajo, pelados, rallados", "3-4 cucharaditas de pimienta negra agrietada, al gusto", "2 limones, ralladura y jugo", "4 pechugas de pollo con hueso, sin piel, cada seno marcado tres o cuatro veces con un cuchillo afilado", "4-5 ramitas de romero fresco", "1 limón, en rodajas finas", "Papas nuevas bebé 700g / 1½lb", "sal y pimienta negra recién molida", "puñado de hojas frescas de perejil de flatleaf picadas, para servir"], "method": ["Para el adobo, mezcle todos los ingredientes del adobo en un tazón hasta que estén bien combinados.", "Para el pollo con pimienta de limón, frote un poco del adobo en el pollo rayado, luego coloque las pechugas de pollo en un recipiente y vierta sobre el adobo restante. Cubra el recipiente con film transparente y deje enfriar en la nevera durante al menos 10 minutos y hasta dos horas.", "Cuando el pollo esté marinado, precaliente el horno a 200C / 180C Fan / Gas 6.", "Coloque las ramitas de romero y las rodajas de limón en el fondo de una bandeja para asar. Incline las papas en la bandeja de asar, luego coloque las pechugas de pollo marinado encima de las papas. Dar al pollo una capa final de adobo y sazonar, al gusto, con sal y pimienta negra recién molida.", "Asar durante 30-35 minutos, o hasta que las papas y el pollo estén cocidos (el pollo se cuece cuando los jugos se hacen transparentes cuando se perfora en la parte más gruesa con un pincho).", "Cubra la bandeja de asar con papel de aluminio y deje el pollo a un lado para que descanse durante 10-15 minutos. Justo antes de servir, esparza el perejil picado."], "url": "www_bbc_co_uk_food_recipes_lush_lemon_pepper_19156", "title": "Pollo exuberante de limón y pimienta", "time": {"preparation": "más de 2 horas", "preparationMins": 120, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 180}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/lush_lemon_pepper_19156_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["600ml / 20fl oz de caldo de pescado", "Licor con sabor a anís 50ml / 2fl oz, como Pernod", "1 cebolla pequeña, más o menos picada", "1 bombilla de hinojo pequeña, picada", "2 palitos de apio, más o menos picados", "1 hoja de laurel", "algunas ramitas de perejil fresco", "500 g / 1 libra de filete de abadejo de 2 oz (u otro pescado blanco de su elección), desollado y deshuesado", "Filete de salmón de 250 g / 9 oz, despellejado y deshuesado", "Langostinos ahumados 250 g / 9 oz", "1,5 kg / 3 lb 5 oz patatas harinosas (como King Edward), peladas y cortadas en trozos grandes", "sal y pimienta negra", "100ml / 3½ fl oz crema doble", "pizca de azafrán", "50 g / 1¾oz de mantequilla sin sal", "40 g / 1½ oz de mantequilla sin sal", "Harina normal de 40 g / 1½ oz", "300ml / 10½fl oz de reserva furtiva reservada (desde arriba)", "100ml / 3½ fl oz crema doble", "2 cucharadas de estragón fresco picado", "sal y pimienta negra"], "method": ["Precalentar el horno a 200C / 400F / Gas 6.", "Para el caldo de caza furtiva, coloque todos los ingredientes en una sartén grande y deje que hierva. Reduzca el fuego a fuego lento.", "Agregue el eglefino y el salmón al caldo, presionándolos suavemente hacia abajo en el líquido hirviendo a fuego lento. Cueza el pescado por unos minutos o hasta que esté cocido. Cuele la mezcla, reservando todo el líquido. Elija las verduras y la hoja de laurel y deséchelas. Deje que el pescado se enfríe.", "Coloque el líquido colado furtivamente en una sartén limpia. Llevar a ebullición y hervir hasta que el volumen de líquido se haya reducido a la mitad. Necesitará 300ml / 10½fl oz del líquido reducido para la salsa. Dejar de lado.", "Para el puré, coloca las papas en una sartén grande. Cubra con agua fría, agregue un poco de sal y lleve a ebullición. Cocine por 15-20 minutos, o hasta que estén tiernos.", "Mientras tanto, para hacer la salsa, derrita la mantequilla en una sartén. Agregue la harina para formar un roux. Deje que se cocine a fuego medio, revolviendo con frecuencia, durante 2-3 minutos. Quite el fuego y gradualmente agregue el líquido de caza furtiva reducido, un cucharón a la vez, batiendo bien después de cada adición para crear una salsa suave. Regrese al fuego y cocine, revolviendo a menudo, durante aproximadamente cinco minutos. Termine la salsa agregando la crema, el estragón y un poco de sal y pimienta.", "Escurra bien las papas y reserve. Caliente la crema, el azafrán y la mantequilla suavemente en la sartén de patata, hasta que la mantequilla se haya derretido, luego quite el fuego y pase las papas a través de un ricer en la sartén (o simplemente colóquelas en el molde y aplaste). Sazone con sal y pimienta al gusto y revuelva para combinar.", "Agita el pescado cocido sobre la base de tu plato a prueba de horno, teniendo cuidado de eliminar cualquier hueso sobre la marcha. Dispersión sobre las langostinos. Vierta sobre la salsa. Cubra con el puré, alisarlo y luego marque en un patrón de vieiras con la punta de una cuchilla de paleta, o el mango de una cuchara grande.", "Hornea de 25 a 30 minutos, o hasta que se dore en la parte superior y burbujee hasta el final. Si su pastel ensamblado se ha enfriado, puede tomar más tiempo. Sirve con guisantes con mantequilla."], "url": "www_bbc_co_uk_food_recipes_luxury_fish_pie_18997", "title": "Pastel de pescado de lujo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luxury_fish_pie_18997_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "50 ml / 2 fl oz de agua", "150 g / 5½ oz de lichis frescos, pelados", "½ lima, jugo y ralladura solamente"], "method": ["Coloque el azúcar y el agua en una cacerola pequeña a fuego medio. Una vez que el azúcar se haya disuelto, retíralo del fuego.", "Coloque los lichis, el jugo de lima y la ralladura de lima en un recipiente y mezcle.", "Agregue el jarabe de azúcar al tazón de lichis y lima y mezcle.", "Servir en un tazón."], "url": "www_bbc_co_uk_food_recipes_lycheeandlimesyrup_79745", "title": "Lychee y jarabe de lima", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Sirve 1", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Patatas para hornear 900 g / 2lb, peladas y cortadas en trozos", "150ml / ¼ de pinta de crema individual", "55 g / 2 oz de mantequilla, más extra para engrasar", "sal y pimienta blanca", "pizca de nuez moscada recién rallada", "225g / 8oz filete de eglefino deshuesado y sin piel", "Salmón de 450g / 1lb, cortado de la cola, sin piel y sin hueso", "exprimir jugo de limón", "4 huevos duros, conchas eliminadas, descuartizado", "85g / 3oz de mantequilla", "gran manojo de perejil, solo hojas, finamente picado", "Harina normal de 30g / 1oz", "570ml / 1 litro de leche", "toque de crema individual, al gusto"], "method": ["Cocine las papas en agua hirviendo con sal hasta que estén suaves.", "Escurrir bien y macerar. Agregue la crema y la mantequilla, luego sazone con sal y pimienta y nuez moscada. Mezcle bien hasta que quede suave y cremoso. Pruebe, agregue más aderezo si es necesario, y luego déjelo a un lado.", "Para la salsa de perejil, caliente la mantequilla en una sartén de base pesada a fuego muy lento y luego agregue el perejil. Cocine por unos diez minutos.", "Agregue la harina y revuelva bien. Cocine, revolviendo regularmente, durante aproximadamente tres minutos. No dejes que la mezcla se ponga marrón.", "En otra sartén, llevar la leche a ebullición. Vierta esto en el \"roux\" (la mezcla de mantequilla y harina) poco a poco, batiendo o batiendo después de cada adición hasta que esté completamente suave. Batir en una sola crema, al gusto. Llevar la salsa a ebullición, luego reduzca el fuego y cocine a fuego lento durante 5-6 minutos.", "Mientras se cocina la salsa, precaliente el horno a 200C / 400F / Gas 6 y generosamente un plato hondo para horno.", "Cortar el eglefino y el salmón en una pieza para servir, colocar en el plato, sazonar ligeramente y exprimir un poco de jugo de limón.", "Vierta la salsa de perejil caliente sobre la parte superior, coloque los huevos descuartizados uniformemente sobre la salsa y cuchara sobre el puré de papas.", "Hornee durante 35-40 minutos, hasta que la parte superior esté crujiente y dorada. Servir a la vez"], "url": "www_bbc_co_uk_food_recipes_luxuryfishpie_67647", "title": "Pastel de pescado de lujo", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "1 a 2 horas", "cookingMins": 120, "totalMins": 150}, "serves": "Para 6", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/luxuryfishpie_67647_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300ml / 10½ fl oz de leche", "1 huevo de gallinas camperas", "50 g / 2 oz de azúcar en polvo", "Harina de auto crianza de 200g / 7oz", "pizca de sal", "Lichis frescos de 110 g / 4 oz, pelados, sin piedras, finamente picados", "50g / 2oz de mantequilla", "2 mangos, pelados, sin piedras, cortados en trozos", "75g / 3oz de mantequilla sin sal", "Lichis frescos de 500 g / 1 libra 2 onzas, pelados, sin piedras, partidos por la mitad", "75g / 3oz de azúcar en polvo", "helado de vainilla"], "method": ["Para los bollos, coloque la leche, el huevo y el azúcar juntos en un bol y bata hasta que estén bien combinados.", "En un recipiente aparte, tamiza la harina y la sal y haz un pozo en el centro. Poco a poco vierta la mezcla de leche, huevo y azúcar, batiendo hasta que la mezcla se convierta en una masa espesa (es posible que no necesite toda la mezcla de leche, huevo y azúcar).", "Agregue los lichis y mezcle bien.", "Caliente una sartén grande o una sartén plana hasta que esté medio caliente. Agregue la mitad de la mantequilla y agítelo alrededor de la sartén para cubrir. Cuando la mantequilla se derrita y espumejee, vierta cucharadas de la mezcla de bollos en la sartén, asegurándose de que haya suficiente espacio entre cada cucharada.", "Freír los bollos de la gota durante 2-3 minutos, o hasta que las burbujas comiencen a formarse en la superficie de la mezcla. Cuidadosamente voltee los bollos de la gota y cocínelos durante 1-2 minutos más, o hasta que estén dorados por completo y cocinados. Retire y escurra sobre papel de cocina. Repita con la masa restante de bollo, agregando más mantequilla restante a la sartén si es necesario.", "Para los lichis salteados y el mango, coloque un tercio del mango cortado en un procesador de alimentos y mezcle hasta obtener un puré suave.", "Derrita la mantequilla en una sartén hasta hacer espuma, luego agregue el mango restante y los lichis y fríalos durante 1-2 minutos. Agregue el azúcar a la sartén y revuelva para cubrir, luego freír durante 2-3 minutos más, o hasta que la fruta comience a caramelizar. Retire la fruta de la sartén y déjela a un lado, luego agregue el puré de mango y revuelva para mezclar con el azúcar caramelizado restante en la sartén.", "Para servir, amontone unos cuantos panecillos en cuatro platos para servir. Cubra con los lichis salteados y mango y rocíe sobre la salsa de mango. Servir inmediatamente con una bola de helado de vainilla al lado."], "url": "www_bbc_co_uk_food_recipes_lycheedropsconeswith_92168", "title": "Bollos de lichi con lichis salteados y mango", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla o ghee", "350g / 12oz de sémola fina", "Harina normal de 100 g / 3½ oz", "½ cucharadita de levadura seca de acción rápida", "2 cucharadas de azúcar en polvo", "pizca de sal", "2 cucharadas de agua de azahar", "130ml / 5oz de leche", "Fechas de 200g / 7oz, más o menos picadas", "25g / 1oz de mantequilla", "½ cucharadita de canela molida", "½ cucharadita de cardamomo molido", "2 cucharadas de azúcar glas, para servir"], "method": ["Para hacer la masa, derrita la mantequilla y vierta en un procesador de alimentos con la sémola, la harina, la levadura, el azúcar y la sal. Pulse hasta que la mezcla tenga la textura de arena fina.", "Agregue el agua y la leche de azahar y mezcle hasta que la mezcla se una para formar una masa dura. Transfiera a un tazón limpio, cubra con una toalla de té limpia y déjelo reposar a temperatura ambiente durante 1 hora.", "Mientras tanto, para hacer el relleno, coloque las fechas, la mantequilla y las especias en una cacerola con 50 ml / 2 fl oz de agua y deje que hierva. Reduzca el fuego y revuelva durante 4-5 minutos hasta que se forme una pasta espesa. Retirar del fuego y reservar para enfriar.", "Precaliente el horno a 180 ° C / 160 ° Ventilador / Gas 4 y alinee una bandeja de horno con papel de hornear.", "Rompe las bolas de masa del tamaño de una nuez y aplástalas contra una superficie limpia. Recoge la masa aplanada en tu mano y rellena con una cucharadita de la mezcla de dátiles. Dobla la masa alrededor del relleno y sella.", "Si usa un molde ma'amoul, presione la masa llena en la cavidad del molde. Toque con fuerza contra una superficie dura para liberar la masa con forma. Si está moldeando a mano, aplaste la masa llena en una ronda y cree una hendidura en el centro con el pulgar. Si lo desea, use un cuchillo afilado o un palillo de cóctel para trazar un patrón en la masa.", "Continúe llenando y dando forma a los bizcochos hasta que toda la masa y pasta se haya usado. Coloque las rondas en la bandeja y hornee durante 15 minutos hasta que estén recién cocidas. No deberían colorear y se endurecerán a medida que se enfríen.", "Transfiera a una rejilla para que se enfríe completamente. Polvo con un poco de azúcar glas antes de servir."], "url": "www_bbc_co_uk_food_recipes_maamoul_93602", "title": "Que esperanza", "time": {"preparation": "1-2 horas", "preparationMins": 120, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 150}, "serves": "Hace 30", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/maamoul_93602_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["100 g / 3½ oz de mantequilla, más extra para engrasar", "Harina normal de 100 g / 3½ oz", "1 cucharadita de mostaza Dijon", "1,2 litros / 2 pintas de leche entera", "75ml / 2½ fl oz crema doble", "1 hoja de laurel", "Queso cheddar maduro 400 g / 14 oz, rallado", "pizca de nuez moscada recién rallada", "500g / 1lb 2oz de macarrones secos", "100g / 3½ oz de tocino ahumado lardons o cubos de panceta ahumados", "60g / 2¼ oz de pan rallado blanco", "50g / 1¾oz de queso parmesano, rallado", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200C / 180C Fan / Gas 6 y engrasar un plato a prueba de horno de 35x20cm / 14x8 pulgadas.", "Derrita la mantequilla en una cacerola grande a fuego lento. Agregue la harina común y cocine durante 1 minuto. Agregue la mostaza, quite la sartén del fuego y bata gradualmente la leche y la crema. Agregue la hoja de laurel.", "Coloque la sartén sobre el fuego, revolviendo constantemente, hasta que hierva y se espese. Vuelva a sacar la sartén del fuego, retire la hoja de laurel y agregue el queso cheddar. Revuelva hasta que el queso se haya derretido. Sazone con mucha pimienta negra y algo de nuez moscada.", "Pon a hervir una olla grande de agua con sal y agrega los macarrones. Cocine por 10 minutos, o hasta que esté al dente, escurra bien y agregue a la salsa.", "Freír el tocino en una sartén hasta que esté crujiente. Revuelva en el queso macarrones y vierta la mezcla en el plato refractario.", "Mezcle las migas de pan con el parmesano y esparza por la parte superior. Hornee durante 25-30 minutos o hasta que estén dorados y burbujeantes. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_mac_n_cheese_70611", "title": "Macarrones con queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Sirve 6-8", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mac_n_cheese_70611_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["150 g / 5½ oz de azúcar en polvo", "150 g / 5½ oz de nueces de macadamia, tostadas"], "method": ["Caliente el azúcar en una cacerola durante 4-5 minutos, hasta que se derrita y se ponga dorado.", "Agregue las nueces de macadamia, revuelva bien y quite la sartén del fuego.", "Vierta la mezcla en una bandeja para hornear antiadherente y deje que se enfríe por completo.", "Para servir, rompe el quebradizo en pedazos."], "url": "www_bbc_co_uk_food_recipes_macadamianutbrittle_85003", "title": "Nuez de macadamia, quebradiza", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "menos de 10 minutos", "cookingMins": 10, "totalMins": 40}, "serves": "Porciones 2", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["1 coliflor pequeña (aproximadamente 775g / 1¾lb), hojas y tallo eliminados, cortados en florecillas", "Macarrones secos de 250 g / 9 oz o formas de pasta pequeñas similares", "50 g / 2 oz de mantequilla, más extra para engrasar", "Harina normal de 50g / 2oz", "500ml / 17fl de leche en oz", "150g / 5oz de queso cheddar maduro, finamente rallado", "sal (opcional) y pimienta negra recién molida"], "method": ["Precaliente el horno a 200C / 180C Ventilador / Gas 6. Engrase ligeramente un plato antiadherente de 2 litros / 3½ pinta con mantequilla.", "Mitad llene una olla grande con agua y llévela a ebullición. Agregue los floretes de coliflor y hiérvalos durante 10-12 minutos, o hasta que estén muy suaves. Escurrir y apartar.", "Llene a la mitad la misma sartén con agua y vuelva a hervir. Agregue los macarrones y cocínelos durante 8-10 minutos, o hasta que estén al dente.", "Mientras tanto, derrita la mantequilla en una sartén a fuego lento, luego bata la harina hasta que la mezcla forme una pasta suave. Cocine, batiendo constantemente, durante 30 segundos.", "Poco a poco bata la leche un poco a la vez, llevando la mezcla a fuego lento y esperando a que se espese después de cada adición. Continúe cocinando, revolviendo constantemente, hasta que se haya incorporado toda la leche y la salsa se haya espesado lo suficiente como para cubrir la parte posterior de una cuchara (aproximadamente 6-8 minutos).", "Agregue dos tercios del queso, luego sazone con sal y pimienta.", "Agregue la coliflor a la salsa, mezcle hasta que quede suave con una licuadora de mano. Caliente la mezcla suavemente, agregando un poco más de aderezo o leche, según sea necesario. La salsa terminada debe tener la consistencia de flan derramado.", "Escurra la pasta y transfiérala al plato refractario. Vierta sobre la salsa y mezcle para combinar. Espolvorea sobre el queso restante. Hornee durante 20-25 minutos, o hasta que la parte superior esté dorada y la salsa burbujee."], "url": "www_bbc_co_uk_food_recipes_macaroni_cauliflower_53315", "title": "Macarrones con queso de coliflor", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Rinde 4", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroni_cauliflower_53315_16x9.jpg", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["4-6 gambas grandes sin cocer, sin pelar", "5 cucharadas de aceite de oliva", "3 cucharadas de ajo, finamente picado", "150 g / 5½ oz de cebolla, finamente picada", "2 cucharadas de cebolletas finamente picadas", "50g / 1¾oz de chile rojo, finamente picado", "sal y pimienta negra recién molida, al gusto", "100g / 3½oz de mantequilla fría, cortada en cubos pequeños", "1 limón, cortado en cuñas"], "method": ["Precalentar el horno a 180 ° C / 160 ° Ventilador / Gas 5.", "Para los langostinos de Macao, usando un cuchillo muy afilado, marque con cuidado los langostinos pero cortándolos por la mitad horizontalmente. Mantenga la cáscara intacta y, usando la punta del cuchillo, quite el cordón digestivo oscuro. Enjuague suavemente las gambas con agua fría y séquelas con papel de cocina.", "Caliente un wok hasta que esté caliente. Agregue 2 cucharadas de aceite de oliva, el ajo, la cebolla, la cebolleta y los chiles. Revuelva freír durante unos 2 minutos. Sazonar con sal y pimienta al gusto. Transfiera a un recipiente y déjelo a un lado mientras cocina las gambas.", "Vuelva a calentar el wok y agregue las 3 cucharadas restantes de aceite de oliva. Freír suavemente las gambas durante unos 30 segundos en cada lado.", "Coloque las gambas en una bandeja para hornear y rellene cada una de las gambas con la mezcla de ajo y cebolla. Reserve cualquier relleno restante para la salsa.", "Coloque las gambas en el horno durante aproximadamente 3-4 minutos, o hasta que estén cocidas.", "Para la salsa, agregue el relleno restante a una cacerola pequeña colocada a fuego medio. Incorpore suavemente la mantequilla y cocine a fuego lento durante aproximadamente 3 minutos.", "Para servir, poner las gambas en un plato de servir y servir con las rodajas de limón y la salsa de mantequilla."], "url": "www_bbc_co_uk_food_recipes_macanese_grilled_prawns_11527", "title": "Gambas a la parrilla de Macao", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["300g / 10½oz de macarrones secos", "2 puerros", "45 g / 1½ oz de mantequilla", "45 g / 1½ oz de harina", "600 ml / 1 litro de leche", "1 cucharadita de mostaza", "dash salsa Worcestershire", "Queso cheddar 200g / 7oz, rallado", "60g / 2¼ oz de pan rallado", "250g / 9oz de guisantes congelados, para servir", "sal y pimienta negra recién molida"], "method": ["Precalentar el horno a 200 ° C / 180 ° Ventilador / Gas 6. Poner a hervir una olla grande de agua con sal y agregar los macarrones. Cocine por 5 minutos y luego drene.", "Mientras tanto, corte los puerros, descarte las partes verdes, luego corte en rodajas finas. Derrita la mantequilla en una cacerola grande, agregue los puerros y cocine suavemente durante 5 minutos, o hasta que estén suaves. Agregue la harina y cocine durante 2 minutos, revolviendo constantemente. Agregue la leche poco a poco, revolviendo constantemente, luego cocine suavemente durante 5 minutos, revolviendo todo el tiempo hasta que la salsa se espese. Agregue la salsa de mostaza y salsa inglesa y luego retírela del fuego. Agregue el queso rallado y sazone con sal y pimienta.", "Agregue la pasta a la salsa, revuelva para combinar y luego vierta en un plato a prueba de horno de 2 litros / 3½ pinta. Espolvorea sobre las migas de pan y hornea durante 25 minutos hasta que estén doradas.", "Hacia el final de la cocción, hierva una olla de agua. Agregue los guisantes, cocínelos durante 3-4 minutos y luego escurra. Sirve el queso macarrones con los guisantes."], "url": "www_bbc_co_uk_food_recipes_macaroni_cheese_51582", "title": "Macarrones con queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaroni_cheese_51582_16x9.jpg", "isVegetarian": false, "recommendations": 0}, {"ingredients": ["570ml / 1 litro de leche", "½ cebolla", "6 granos de pimienta negros enteros", "2 hojas de laurel", "1 cucharadita de tomillo", "½ cucharadita de nuez moscada rallada", "Propagación baja en grasa de 50 g / 2 oz", "25 g / 1 oz de harina", "sal y pimienta negra recién molida", "175g / 6oz macarrones de trigo integral", "175g / 6oz de queso cheddar bajo en grasa, rallado", "1 cucharada de perejil fresco picado"], "method": ["Precalentar la parrilla a su configuración más alta.", "Coloque la leche en una cacerola a fuego medio. Agregue la cebolla, los granos de pimienta, las hojas de laurel y el tomillo y deje que hierva para infundir los sabores.", "Retire la sartén del fuego, cubra con una tapa y deje reposar la leche durante 10-15 minutos. Cuele la leche a través de un colador en un recipiente y deseche los ingredientes sólidos.", "Coloque la extensión baja en grasa en una cacerola limpia sobre un calor suave. Una vez derretido, agregue la harina y cocine, revolviendo bien, durante 2-3 minutos.", "Agregue la leche infundida, revuelva todo el tiempo y lleve la salsa gradualmente a ebullición.", "Sazone con sal y pimienta negra recién molida, luego deje que la salsa hierva a fuego lento durante 3-5 minutos, revolviendo ocasionalmente.", "Mientras tanto, cocine los macarrones según las instrucciones del paquete. Cuando esté recién cocinado, escurrir y colocar en una cazuela de barro o plato a prueba de calor.", "Agregue 110 g / 4 oz del queso cheddar rallado y todo el perejil picado a la salsa blanca, revuelva bien, luego vierta esto sobre los macarrones cocidos.", "Cubra con el queso rallado restante y coloque el plato debajo de la parrilla para cocinar durante 5-7 minutos, hasta que el queso burbujee y se dore.", "Servir en la mesa en el plato."], "url": "www_bbc_co_uk_food_recipes_macaronicheese_83784", "title": "Macarrones con queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "30 minutos a 1 hora", "cookingMins": 60, "totalMins": 90}, "serves": "Para 4 personas", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "isVegetarian": true, "recommendations": 0}, {"ingredients": ["Macarrones de 250 g / 9 oz", "40 g / 1½ oz de mantequilla", "Harina simple 40g / 1½", "600ml / 1pint 1½ fl oz de leche", "250g / 9oz de queso cheddar rallado", "50g / 2oz de queso parmesano rallado (o una alternativa vegetariana similar)"], "method": ["Cocine los macarrones en una olla grande de agua hirviendo con sal durante 8-10 minutos; Escurrir bien y dejar reposar.", "Derretir la mantequilla a fuego medio en una cacerola ligeramente más grande que la utilizada para los macarrones. Agregue la harina y revuelva para formar un roux, cocinando durante unos minutos.", "Poco a poco bata la leche, poco a poco. Cocine por 10-15 minutos hasta obtener una salsa espesa y suave.", "Mientras tanto, precalentar la parrilla a fuego.", "Retire la salsa de la placa, agregue 175 g / 6 oz del queso y revuelva hasta que el queso esté bien combinado y derretido.", "Agregue los macarrones a la salsa y mezcle bien. Transfiera a un plato hondo a prueba de horno de tamaño adecuado.", "Espolvorea sobre el queso cheddar restante y el queso parmesano y coloca el plato debajo de la parrilla caliente. Cocine hasta que el queso esté dorado y burbujeante. Servir inmediatamente."], "url": "www_bbc_co_uk_food_recipes_macaronicheese_83521", "title": "Macarrones con queso", "time": {"preparation": "menos de 30 minutos", "preparationMins": 30, "cooking": "10 a 30 minutos", "cookingMins": 30, "totalMins": 60}, "serves": "Para 4 personas", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/macaronicheese_83521_16x9.jpg", "isVegetarian": true, "recommendations": 0}]