[{"isVegetarian": false, "title": "Penne with sausage, pancetta and Swiss chard", "url": "www_bbc_co_uk_food_recipes_penne_with_sausage_26109", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["800g/1lb 12oz Swiss chard", "2 tbsp olive oil", "1 small onion, finely chopped", "1 garlic clove, finely sliced", "75g/3oz sliced pancetta, cut into matchsticks ", "150g/5oz Tuscan sausages, skin removed, finely chopped", "50ml/2floz double cream", "pinch dried chilli flakes", "400g/14oz penne rigate", "sea salt and freshly ground black pepper", "freshly grated parmesan, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Trim the ends of the Swiss chard and cut the green leaves off the white stems. ", "Cut the stems into fine matchsticks and blanch in boiling salted water for 1-2 minutes, or until soft. Drain and set aside. ", "Blanch the green leaves in boiling salted water for 4-5 minutes, then drain and chop roughly.", "Heat the olive oil in a large, heavy-based saucepan, add the onion and garlic and cook gently for 5-6 minutesm, or until soft. ", "Add the pancetta and sausage meat and cook over a low heat for 20 minutes, then drain off the excess fat. ", "Add the cream to the sauce and bring to the boil. Stir in the dried chilli and the blanched Swiss chard stalks and their leaves, then cook for 4-5 minutes. Season to taste, with salt and freshly ground black pepper.", "Cook the penne in a large pan of boiling water, according to packet instructions, until al dente. Drain, reserving a few spoonfuls of the cooking water. ", "Add the pasta to the sauce, mix well and add a little of the reserved water if necessary to loosen the sauce. ", "Cook gently for 2 minutes, then serve with freshly ground black pepper and grated parmesan."]}, {"isVegetarian": false, "title": "Penne all'Amatriciana", "url": "www_bbc_co_uk_food_recipes_penneallamatriciana_86982", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3-4 tbsp extra virgin olive oil", "1 onion, peeled and chopped", "4 slices streaky bacon, rind removed, chopped", "500g/1lb 2oz ripe cherry tomatoes, cut in half", "salt and freshly ground black pepper", "1 tsp salt", "2 litres/3½pints boiling water", "250g/9oz penne pasta", "20g/3/4 oz parmesan cheese, finely grated, to serve", "2 ciabatta rolls, cut in half", "1 garlic clove, peeled and cut in half", "extra virgin olive oil, for drizzling", "250g/9oz ripe cherry tomatoes, cut into quarters", "1 x 125g/4½oz ball buffalo mozzarella", "salt, to taste", "1 small bunch fresh basil, leaves only"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the sauce, heat the oil in a frying pan, add the onion and cook over a medium heat for about 2-3 minutes, until softened.", "Add the bacon to the pan and fry gently until lightly golden-brown, about ten minutes.", "Add the tomatoes to the pan and stir well.", "Reduce the heat and simmer until the tomatoes begin to break down, about five minutes. Season, to taste, with salt and freshly ground black pepper, but take care with the salt as the bacon is salty.", "For the pasta, place the salt into a saucepan of boiling water and add the penne.", "Boil for 8-10 minutes, or according to packet instructions, until al dente (the pasta should give some resistance when bitten into). Drain, then add to the pan with the sauce and mix well.", "Meanwhile, for the bruschetta, preheat the grill to medium. Toast the ciabatta halves on both sides.", "Lightly rub the cut sides of the garlic clove over the ciabatta halves.", "Drizzle generously with olive oil.", "Place the tomatoes on top of the ciabatta. Tear the mozzarella into pieces and place on top of the tomatoes.", "Season, to taste, with salt and drizzle over a little more olive oil. Tear the basil leaves into pieces and scatter over the top.", "To serve, divide the pasta between two bowls and sprinkle over the parmesan. Serve with the bruschetta with mozzarella."]}, {"isVegetarian": true, "title": "Penne al'arrabiata (pasta with a tomato and chilli sauce)", "url": "www_bbc_co_uk_food_recipes_pennealarrabiatapast_83813", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennealarrabiatapast_83813_16x9.jpg", "ingredients": ["6 tbsp extra virgin olive oil, plus an extra dash for cooking the pasta", "2 medium hot chillies, finely sliced", "2 garlic cloves, chopped", "handful basil leaves", "600g/1lb 5oz canned chopped tomato", "salt, to taste", "400g/14oz fresh penne pasta", "parmesan shavings (or similar vegetarian hard cheese), to serve"], "serves": "Makes 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the olive oil in a frying pan. Add the chilli and garlic to the pan. After about a minute, add the basil leaves and gently wilt them in the flavoured oil. ", "Remove the garlic, basil and chilli from the pan and set aside. Add the chopped tomatoes to the frying pan.", "Put the garlic, basil and chilli back in the pan with the tomatoes. Simmer for at least 10 minutes, until the sauce has thickened a little. Add salt to taste.", "Meanwhile, cook the pasta for a few minutes in large saucepan of boiling, salted water with a dash of olive oil. Drain the pasta and the tomato sauce to it. Serve with shavings of parmesan."]}, {"isVegetarian": false, "title": "Penne alla torrese", "url": "www_bbc_co_uk_food_recipes_penneallatorrese_65964", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/penneallatorrese_65964_16x9.jpg", "ingredients": ["250g/9oz penne pasta,  previously cooked al dente", "150g/5oz pancetta, cubed", "1 medium red onion, sliced", "70g/3oz defrosted peas\t\t", "3 tbsp sun-dried tomato flavoured olive oil ", "1 tbsp chilli flavoured olive oil ", "salt, to taste"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["In a large pan fry the onions, pancetta and peas in the sun-dried tomato flavoured olive oil.  ", "Allow to cook for apprimately  2 minutes until crispy.", "Blanch the pasta in boiling water for approximately 30-40 seconds, drain and immediately put in the sauce and mix well. ", "Drizzle chilli flavoured olive oil over the pasta and serve hot."]}, {"isVegetarian": true, "title": "Pasta with tomato and vodka sauce", "url": "www_bbc_co_uk_food_recipes_pennealpomodoroevodk_10819", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["500g/1lb2oz pack of short dried pasta, such as farfalle, penne or fusilli", "200ml/7fl oz (approx.) jar of good quality tomato passata ", "2 tbsp of extra virgin olive oil", "2 cloves of garlic, sliced", "5 leaves fresh basil", "200ml/7fl oz of single cream ", "1 small glass of vodka", "60g/2oz of butter ", "1 tbsp crushed pepper ", "salt", "3 tbsp freshly grated parmesan"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["To make the tomato sauce, heat the olive oil in a small saucepan. Add the chopped garlic and fry gently until golden. ", "Add the jar of tomato passata and season with salt and pepper. Add several fresh basil leaves and cook gently for about 10 minutes.", "While the sauce is simmering, bring a pan of salted water to the boil and cook the pasta until  al dente . Drain well .", "Meanwhile, in a large frying pan melt the butter, add the crushed pepper and the drained pasta. Toss well, making sure that all the pasta is well coated with butter. Keep the heat high and toss the pasta with a spatula, while adding the tomato sauce and the cream. Add the glass of vodka, toss again and turn the heat off; if the vodka evaporates, you will loose the taste of it.", "Sprinkle with parmesan and serve immediately."]}, {"isVegetarian": true, "title": "Penne arrabiata with avocado and rocket salad", "url": "www_bbc_co_uk_food_recipes_pennearabattiawithav_84013", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz penne pasta, cooked according to packet instructions", "1 tbsp olive oil", "1 garlic clove, finely chopped", "¼ red onion, finely chopped", "½ tsp dried chilli flakes", "1 tbsp tomato purée", "½ avocado, stone removed, sliced", "small handful rocket leaves", "1 tbsp olive oil", "½ tbsp balsamic vinegar"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place all the ingredients for the pasta into a serving bowl, mixing well to combine the ingredients.", "For the salad, place all the ingredients on a separate bowl, mixing together well. Serve alongside the bowl of pasta."]}, {"isVegetarian": true, "title": "Penne with chilli, garlic, herbs and olive oil", "url": "www_bbc_co_uk_food_recipes_pennewithchilligarli_88845", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 tbsp olive oil", "3 tbsp fresh parsley leaves", "1 garlic clove, crushed", "1 tsp chilli flakes", "a pinch of salt", "150g/5½oz penne pasta, cooked according to packet instructions", "6 fresh basil leaves, torn", "a few shavings of fresh white truffle, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oil, parsley, garlic, chilli flakes and salt into a food processor and blend until smooth. ", "Stir the mixture into the cooked penne pasta, and pile onto a plate. Garnish with fresh torn basil leaves and the shavings of white truffle."]}, {"isVegetarian": false, "title": "Creamy pasta with cherry tomato and prosciutto", "url": "www_bbc_co_uk_food_recipes_penneprosciuttonestw_88842", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil", "55g/2oz fresh peas", "6 cherry tomatoes, halved", "2 tbsp white wine", "100ml/3½fl oz double cream", "salt and freshly ground black pepper", "150g/5½oz penne pasta, cooked according to packet instructions", "4 slices prosciutto"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a pan and lightly fry the peas and tomatoes for 3-4 minutes. Add the wine to the pan, bring to the boil, then pour in the cream and season, to taste, with salt and freshly ground black pepper. ", "Bring the sauce to a simmer and cook for 4-5 minutes, then stir through the cooked penne pasta. Tear the prosciutto into the pasta and serve in a warmed pasta bowl. "]}, {"isVegetarian": true, "title": "Penne with fresh green pesto", "url": "www_bbc_co_uk_food_recipes_pennewithfreshgreenp_88289", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 large handfuls fresh basil leaves", "2 garlic cloves, peeled", "75g/2½oz pecorino cheese, grated, plus extra to serve", "3 tbsp pine nuts, toasted", "4 tbsp olive oil", "salt and freshly ground black pepper", "125g/4½oz fresh penne pasta"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the basil leaves, garlic, grated pecorino and pine nuts into a blender and process, gradually adding the olive oil until the mixture reaches the desired consistency. Season with salt and freshly ground black pepper.", "Cook the fresh penne according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Add the green pesto to the hot pasta and stir to coat.", "To serve, spoon into a serving dish and scatter with grated pecorino."]}, {"isVegetarian": false, "title": "Penne with prawns, tomato and crème fraîche", "url": "www_bbc_co_uk_food_recipes_pennewithprawnstomat_65890", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["255g/8oz cooked peeled prawns", "200g/7oz penne pasta", "mirepoix  (finely chopped vegetables) such as 1 onion, 1 celery stalk, 1 carrot, 1 clove of garlic", "½ pint fish stock (shop bought)", "½ glass white wine", "1 tbsp tomato purée", "1 bay leaf", "3 tbsp crème fraîche", "bunch fresh basil", "good handful parmesan", "1 lemon, juice only", "2 tbsp olive oil", "1 tbsp plain flour"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne for 8 minutes in boiling salted water, strain and toss in olive oil. ", "Preheat the olive oil in a pan and add the mirapois of onions, celery, garlic and carrot and cook until soft. ", "Add the flour and stir into the vegetables.", "Add the tomato purée, bay leaf, lemon juice, wine and reduce, then add the fish stock. Bring to the boil and reduce.   ", "Pass the liquid through a sieve and return to the pan. ", "Add the cooked prawns and bring back to the boil and add the crème fraîche.", "Add the cook penne and then  stir in half the parmesan and some torn basil leaves.", "Serve with a sprinkle of parmesan and some more basil."]}, {"isVegetarian": false, "title": "Tuna steak with penne, lemon and rocket", "url": "www_bbc_co_uk_food_recipes_pennewithlemonandroc_84012", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["125g/4½oz penne pasta, cooked according to packet instructions", "1 tbsp olive oil, plus 1 tbsp ", "1 lemon, juice and zest", "small handful rocket", "55g/2oz fresh tuna steak", "sea salt and freshly ground black pepper", "½ tomato, chopped"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the hot pasta, olive oil, lemon and rocket into a serving bowl, mixing the ingredients together.", "Heat the extra oil in a frying pan on a high heat. Season the tuna, to taste, with salt and freshly ground black pepper on each side. Place the tuna into the frying pan and fry for two minute on each side, or until cooked to your liking.", "Remove the tuna from the frying pan and place on top of the pasta. Sprinkle the chopped tomato over the top to serve."]}, {"isVegetarian": true, "title": "Penne with halloumi and cherry tomatoes", "url": "www_bbc_co_uk_food_recipes_pennewithhaloumiandc_92783", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithhaloumiandc_92783_16x9.jpg", "ingredients": ["250g/9oz cherry tomatoes, on the vine", "1 tbsp olive oil", "1 red onion, peeled, finely chopped", "2 garlic cloves, peeled, finely chopped", "1 red chilli, finely chopped", "250g/9oz halloumi cheese, cut into 1cm/½in cubes", "400g/14oz canned cherry tomatoes", "1 tbsp chopped fresh oregano leaves", "salt and freshly ground black pepper", "400g/14oz fresh penne, cooked according to packet instructions", "1 tsp Dijon mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "75g/3oz rocket leaves", "1 head Little Gem lettuce, cut in half lengthways, leaves separated, washed", "75g/3oz lamb's lettuce", "3 tbsp freshly grated parmesan (or alternative vegetarian hard cheese)"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["For the pasta, heat a frying pan until hot over a medium heat, add the fresh cherry tomatoes and fry for 4-5 minutes, or until just softened. Remove from the pan and set aside.", "Add the olive oil, red onion, garlic and chilli to the pan the tomatoes were cooked in and fry for 2-3 minutes.", "Add the halloumi cheese and cook for 1-2 minutes on each side, or until pale golden-brown on both sides. Add the canned cherry tomatoes and bring to the boil, then reduce the heat and simmer for 2-3 minutes. Add the fresh cherry tomatoes and oregano and cook for a further minute. Season, to taste, with salt and freshly ground black pepper.", "Add the cooked pasta to the pan and mix gently until well combined.", "For the salad, whisk the mustard and vinegar together in a bowl, then whisk in the olive oil. Season, to taste, with salt and freshly ground black pepper.", "Place all the salad leaves into a bowl and pour over the dressing. Stir until well combined.", "To serve, spoon the pasta onto four serving plates and sprinkle over the grated parmesan. Spoon the dressed salad alongside."]}, {"isVegetarian": false, "title": "Penne pasta with pancetta and parsley and Little Gem salad", "url": "www_bbc_co_uk_food_recipes_pennewithpancettaand_88250", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["4 slices pancetta", "175g/6oz pancetta, cut into cubes", "250g/10½oz fresh penne pasta", "3 free-range egg yolks", "110ml/4fl oz double cream", "175g/6oz parmesan, grated, plus parmesan shavings, to serve", "salt and freshly ground black pepper", "6 tbsp flatleaf parsley, roughly chopped", "2 tbsp extra virgin olive oil", "3 slices crusty bread, cut into cubes", "4 tbsp extra virgin olive oil", "2 Little Gem lettuce, leaves separated", "1 tbsp red wine vinegar", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the grill to its highest setting.", "For the pasta, place the pancetta slices onto a tray and place under the grill for 2-3 minutes, or until crisp and golden-brown.", "Meanwhile, heat a frying pan until hot. Add the pancetta cubes and cook for 3-4 minutes, until golden-brown all over.", "Bring a large pan of salted water to the boil and add the pasta. Cook according to packet instructions or until al dente.", "While the pasta is cooking, mix the egg yolks, cream and freshly grated parmesan together in a bowl. Season the mixture well with salt and freshly ground black pepper, then add the flatleaf parsley and cooked pancetta cubes.", "Drain the pasta and quickly add to the eggs and cream mixture. Add a little olive oil and check the seasoning, adding more salt and freshly ground black pepper if necessary.", "Spoon the pasta and sauce into bowls and top with parmesan shavings and a little extra freshly ground black pepper. Serve with the grilled pancetta slices on the top.", "For the salad, heat a clean frying pan until hot. Add one tablespoon of the olive oil and the bread cubes. Fry until golden-brown all over to make croûtons.", "Place the Little Gem leaves into a large salad bowl and add the croûtons.", "Whisk the remaining olive oil and the vinegar together in a clean bowl and season with salt and freshly ground black pepper.", "Pour the dressing over the salad, mix well to combine, and serve with the pasta."]}, {"isVegetarian": false, "title": "Penne with radicchio and pancetta", "url": "www_bbc_co_uk_food_recipes_pennewithradicchioan_8647", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 packet of penne", "4 shallots, chopped", "2 cloves garlic, chopped ", "olive oil", "2 packets of pancetta", "1 red chilli, chopped", "2 heads of radicchio", "glass white wine", "150ml/5fl oz vegetable stock ", "small tub double cream", "zest and juice of 1 lemon", "1 tbsp mascarpone ", "handful fresh parsley, chopped ", "shavings of parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Cook the penne in a large pan of salted water, drain and return to the pan.", "While the pasta is cooking, sweat the onion and garlic gently in a little oil until just soft and remove from the pan. Turn up the heat and add the pancetta, chilli and radicchio. Cook for a few minutes.", "Add the wine, stock and reduce, add the cream and cook for a few minutes more. Add the mascarpone, lemon juice and zest and mix well.", "Add the radicchio mixture to the cooked pasta and stir well. Tip into a bowl, scatter with parsley and shavings of parmesan and serve immediately."]}, {"isVegetarian": true, "title": "Penne with spicy tomato and mozzarella sauce", "url": "www_bbc_co_uk_food_recipes_pennewithspicytomato_92443", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithspicytomato_92443_16x9.jpg", "ingredients": ["2 tsp olive oil", "1 onion, finely chopped", "3 garlic cloves, finely chopped", "1 red chilli, seeds removed, finely chopped", "400g tin chopped tomatoes ", "splash red wine vinegar ", "1 tbsp tomato purée", "Tabasco sauce, to taste", "1 tsp sugar", "small bunch fresh basil leaves, torn", "125g ball fresh buffalo mozzarella, crumbled", "400g/14oz dried penne pasta, cooked according to packet instructions, drained", "grated Parmesan, to serve", "salt and freshly ground black pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a saucepan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened and beginning to colour. Add the garlic and chilli and continue to fry for 1-2 minutes.", "Pour in the chopped tomatoes, red wine vinegar, tomato purée, a splash or two of Tabasco (to taste), sugar and half of the basil leaves, and stir well. Season with salt and pepper. ", "Bring the mixture to a simmer, then continue to simmer until the sauce has thickened and reduced in volume.", "Just before serving, stir the crumbled mozzarella into the tomato sauce. Then stir the drained pasta into the sauce. ", "Divide the pasta and sauce equally among four serving plates. Sprinkle over the remaining basil leaves and the grated Parmesan."]}, {"isVegetarian": true, "title": "Penne with spicy roasted pepper sauce", "url": "www_bbc_co_uk_food_recipes_pennewithroastedpepp_88288", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["3 roasted red peppers from a jar, drained", "2 garlic cloves, chopped", "pinch dried chilli flakes", "1 tbsp tomato purée", "2-3 tbsp olive oil", "pinch dried oregano", "dash Tabasco sauce", "salt and freshly ground black pepper", "125g/4½oz fresh penne pasta", "grated pecorino, to serve", "fresh basil leaves, to garnish"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Place the roasted red peppers, garlic, chilli flakes, tomato purée, olive oil, oregano, Tabasco, salt and freshly ground black pepper into a mini blender and blend until almost smooth. Set aside.", "Cook the pasta according to the packet instructions and drain, leaving a little of the cooking liquid in the bottom of the pan. Add the roasted pepper sauce to the hot pasta and stir well.", "To serve, spoon into a serving bowl, scatter with grated pecorino and garnish with basil leaves."]}, {"isVegetarian": false, "title": "Penne with tomatoes, chorizo and cream", "url": "www_bbc_co_uk_food_recipes_pennewithtomatoesspi_73926", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pennewithtomatoesspi_73926_16x9.jpg", "ingredients": ["450g/1lb penne pasta", "25g/1oz butter", "1 tsp finely chopped rosemary", "700g/1½ lb fresh ripe tomatoes, peeled, seeded and diced", "salt and freshly ground pepper ", "sugar, pinch of", "175-225g/6-8oz chorizo or kabanossi sausage", "pinch crushed chilies", "125-175ml/4-6 fl oz cream", "3 tbsp finely chopped flatleaf parsley", "4 tbsp freshly grated parmesan"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Melt the butter in a sauce pan, add chopped rosemary and diced tomatoes. ", "Season with salt and pepper and sugar.", "Cook until the tomatoes have just begun to soften into a sauce, which takes about 5 minutes.", "Slice the sausage into 5mm/¼in rounds and add to the pan with the crushed chilies.", "Add the cream and two tablespoons of chopped flatleaf parsley, and allow to bubble for 3-4 minutes, stirring frequently until the cream has reduced by half. Remove the pan from the heat and set aside. ", "Cook the pasta until it is 'al dente', drain and stir into the sauce with the grated parmesan.", "Sprinkle with remaining flatleaf parsley, and serve."]}, {"isVegetarian": true, "title": "Spaghetti with garlic and chilli", "url": "www_bbc_co_uk_food_recipes_peperoncino_99009", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peperoncino_99009_16x9.jpg", "ingredients": ["200g/7oz dried spaghetti", "1 fat garlic clove", "handful fresh parsley leaves", "3 tbsp extra virgin olive oil ", "2 pinches dried chilli flakes, to taste", "sea salt"], "serves": "Serves 2", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Add 2 tablespoons salt to 2 litres water and bring to the boil in a large saucepan. Add the spaghetti and return to the boil quickly, then cook until al dente.", "Finely chop the garlic and parsley together. ", "Heat the oil in a frying pan over a low heat. Add the garlic and parsley and fry for 1 minute, or until the garlic is softened but not coloured. Add the chilli flakes and cook for 1 more minute. ", "Drain the spaghetti lightly, then add to the frying pan with the water still clinging to it. Mix to coat with the oil. Add a little extra cooking water if needed. Sprinkle the spaghetti with the parsley, toss, season with salt and serve. "]}, {"isVegetarian": true, "title": "Pepper boats", "url": "www_bbc_co_uk_food_recipes_pepper_boats_77216", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 red pepper ", "4 cherry tomatoes ", "1 tbsp olive oil ", "1 dessertspoon pine nuts ", "4 basil leaves", "30g/1½oz soft goats’ cheese", "pinch ground black pepper"], "serves": "", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Preheat the oven to 200C/400F/Gas 6.", "Pop the pepper by pushing down on the stalk with your thumbs until you push it inside – then tear the pepper carefully to make two even-sized halves. These are your boats. Knock the pepper halves upside down to shake out all the seeds and pull off all the pale soft bits.", "Add the tomatoes into the bowl, then chop them up with scissors. Add the olive oil and a pinch of pepper and stir well.", "Sprinkle in the pine nuts and tear in the basil leaves, then give the mixture a good stir.  ", "Spoon half of the filling to each pepper boat. Finally, crumble the goats’ cheese on top of the tomato mixture.", "Bake for 20-25 minutes or until the cheese topping is golden-brown. Serve with crusty French bread."]}, {"isVegetarian": true, "title": "Pepper, tomato and basil pasta", "url": "www_bbc_co_uk_food_recipes_pepper_tomato_and_basil_74401", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/pepper_tomato_and_basil_74401_16x9.jpg", "ingredients": ["3  peppers, red, yellow or orange", "handful cherry tomatoes ", "2 cloves of garlic, peeled", "2 tbsp olive oil ", "large bunch basil ", "400g/14oz pasta shapes (orecchiette is nice) ", "salt and pepper"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Pre-heat the oven to 180C/350F/Gas 4.", "Halve the peppers lengthways, trim out the seeds and membrane. Lay them in a fairly large roasting tin facing upwards. Halve the cherry tomatoes and place them inside the peppers. Finely slice the garlic and tuck them in with the tomatoes. Drizzle the peppers with olive oil, season, to taste, with salt and freshly pepper. Bake in the oven while you get on with the basil oil.", "Set aside a few sprigs of basil and blend the rest in a food processor with 3 tablespoons of olive oil and a little salt until you have a bright green basil oil. ", "When 30 minutes or so have passed and the peppers and tomatoes are beginning to soften, pour over the basil dressing. Return to the oven for a further 20 minutes or until the vegetables are slightly charred around the edges. Lift the peppers and tomatoes out of the tray with a slotted spoon and set aside. ", "Cook the pasta in boiling salted water according to the packet instructions. Drain.", "Tip the cooked, drained pasta into the roasting tin, and stir well to scrape up any caramelised peppers stuck to the pan. ", "Serve the pasta in bowls, tearing in the remaining basil. Spoon the roasted peppers and tomatoes on top."]}, {"isVegetarian": true, "title": "Pepper and sun-blushed tomato soup", "url": "www_bbc_co_uk_food_recipes_pepperandsunblushedt_82614", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1-2 tbsp olive oil", "½ red pepper, sliced", "85g/3oz sun-blushed tomatoes", "½pint chicken stock (vegetarians can substitute vegetable stock)", "handful of fresh basil leaves", "salt and freshly ground black pepper", "drizzle of olive oil"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the oil in a medium saucepan and sauté the pepper slices for 3-4 minutes, to soften. Stir in the tomatoes and heat for a further few minutes. ", "Add the chicken stock, bring to the boil, then reduce the heat and simmer gently for 8-10 minutes.", "Stir in the basil and season well with salt and freshly ground black pepper.", "Transfer to a serving bowl and drizzle with a little olive oil, to serve."]}, {"isVegetarian": false, "title": "Beef steak for one", "url": "www_bbc_co_uk_food_recipes_peppercrustedbeefste_87038", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/peppercrustedbeefste_87038_16x9.jpg", "ingredients": ["200g/7oz sirloin steak", "1 small free-range egg, lightly beaten", "2 tsp coarsely ground black pepper", "1 tbsp olive oil", "green salad, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Dip the steak in the beaten egg and sprinkle with the pepper to coat.", "Heat the olive oil in a non-stick frying pan and fry the steak for four minutes on each side, or until cooked to your liking.", "Leave the steak to rest for 5 minutes before serving with the salad."]}, {"isVegetarian": false, "title": "Peppercorn and herb-crusted venison with homemade tomato chutney and buttered kale", "url": "www_bbc_co_uk_food_recipes_peppercornandherbcru_88332", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz venison fillet", "dash olive oil", "salt and freshly ground black pepper", "25g/1oz butter", "2 garlic cloves, peeled and crushed ", "4 sprigs fresh thyme, leaves only", "55g/2oz fresh breadcrumbs", "small handful fresh parsley, chopped", "salt, to taste", "1 tsp black peppercorns, crushed", "2 tsp red wine vinegar", "150g/5½oz fresh cherry tomatoes, quartered", "1 tsp caster sugar", "2 tsp tomato purée", "salt and freshly ground black pepper", "25g/1oz butter", "large handful fresh kale, chopped", "salt and freshly ground black pepper", "splash hot water"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. ", "For the venison, tie the venison up with kitchen string - this will help it to retain its shape. Rub with olive oil and season with salt and freshly ground black pepper.", "Heat a frying pan and sear the venison until browned on all sides. Add a knob of the butter, reserving the rest for the crust, and brush the meat with the melted butter. Turn down the heat and add the garlic and half of the thyme. Fry gently for about ten minutes. Remove from the pan and leave to rest for five minutes, then remove the string and cut in half.", "Place the breadcrumbs, parsley, salt, crushed peppercorns and the remaining thyme and butter into a mini blender and process until combined.", "Spread the crust mixture on top of the venison fillet halves and place onto a baking sheet. Place into the oven and bake for 2-3 minutes, or until golden-brown on top.", "For the homemade tomato chutney, place all the ingredients into a small non-reactive pan and simmer for five minutes, or until the tomatoes have softened. Beat with a wooden spoon until smooth and well combined.", "For the buttered kale, heat the butter in a large saucepan and add the kale, salt and freshly ground black pepper and a splash of boiling water. Stir over a low heat until wilted.", "To serve, place the tomato chutney onto a serving plate. Place the venison on top and serve with the buttered kale."]}, {"isVegetarian": false, "title": "Pepper-crusted chicken with sugar snap peas and red pepper", "url": "www_bbc_co_uk_food_recipes_peppercrustedchicken_87088", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 tbsp olive oil, plus extra for drizzling", "1 chicken breast, skin scored", "1 tsp crushed black peppercorns ", "1 tbsp olive oil, plus extra for drizzling", "½ red pepper, deseeded", "1 garlic clove, sliced", "100g/3½oz sugar snap peas, sliced", "1 tbsp soy sauce", "2 tbsp lemon juice", "1 lime, cut into wedges, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "For the chicken, heat the olive oil in a frying pan. Rub the chicken breast with a little extra olive oil, then rub the skin with the crushed peppercorns.", "Place the chicken into the pan skin-side down and cook for 5-10 minutes. Turn over and cook for 4-5 minutes on the other side, or until completely cooked through.", "For the sugar snap peas and red pepper, drizzle the red pepper half with olive oil and place onto a baking sheet. Transfer to the oven and roast for 8-10 minutes, or until softened.", "Remove the pepper from the oven, place into a bowl and cover the bowl with cling film. After 3-4 minutes, remove the cling film, peel the skin off the pepper and cut into wedges.", "Heat the oil in a frying pan and fry the roasted pepper slices with the sliced garlic for 1-2 minutes. Add the sliced sugar snap peas, soy sauce and lemon juice and cook for a further 1-2 minutes.", "To serve, place the sugar snap pea and red pepper salad onto a serving plate and top with the pepper-crusted chicken. Garnish with lime wedges."]}, {"isVegetarian": false, "title": "Pepper crusted monkfish with mustard dill sauce", "url": "www_bbc_co_uk_food_recipes_peppercrustedmonkfis_68035", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 monkfish tail, about 500g/1lb 2oz, filleted and skinned", "2 tbsp olive oil, for frying", "3 tbsp cracked black pepper", "sea salt and freshly ground black pepper", "1 tbsp olive oil", "1 shallot, chopped", "1 garlic glove, chopped", "3 tbsp white wine", "110ml/4fl oz double cream", "3 tbsp coarse grain mustard", "2 tbsp chopped fresh dil"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 70, "preparationMins": 60}, "recommendations": 0, "method": ["Trim the monkfish, then cut into medallions about 2.5cm/1in thick. Season with a little salt and press each medallion lightly into the cracked pepper to coat. Place in the refrigerator.", "To make the sauce, heat the oil in a frying pan, add the shallot and garlic and sauté for 3 minutes. Add the wine and cook until evaporated. Stir in the cream and bring to the boil, then add the mustard, dill and seasoning. Reduce the heat and keep warm.", "Wipe out the pan with kitchen paper. Heat the oil for frying until very hot, add the monkfish medallions and cook for about 2 minutes on each side until browned and just firm when pressed. Remove and drain on kitchen paper.", "Place the medallions on 4 warmed serving plates and spoon the sauce around", "Serve with bubble and squeak cakes and a salad of crisp mixed leaves."]}]