[{"isVegetarian": false, "title": "Balsamic figs with roasted duck breast and crispy leeks", "url": "www_bbc_co_uk_food_recipes_balsamicfigswithroas_76272", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 duck breast", "2 fresh figs", "2 tbsp honey", "2 tbsp balsamic vinegar", "1 tbsp butter", "2 tbsp vegetable oil", "100g/3½oz new potatoes, grated ", "salt and freshly ground black pepper ", "Hot vegetable oil for deep frying", "100g/3½oz leek, white part only, finely sliced"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven 200C/400F/Gas 6.", "Score the duck breast in a criss-cross pattern.", "Place the duck breast into a cold pan, skin-side down, and cook on a high heat for three minutes.  Strain off and discard the fat.", "For the figs, place the figs into the saucepan with the duck and cook for a further two minutes.  Then place into the preheated oven for four minutes.", "Take out of the oven, remove the duck and figs, and deglaze the pan with honey and balsamic vinegar. ", "Finish with the butter and rest for three minutes.", "For the rösti, in a small frying pan heat the oil until hot.", "Add the grated potato and season with the salt and freshly ground black pepper.", "Cover the base of the pan, with the potatoes.  Turn over after three minutes or when golden brown.  Cook for a further two minutes.", "For the crispy leeks, heat the oil in a large saucepan or deep-fryer. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.)", "Deep-fry the leek strips and drain on kitchen paper.", "Serve the duck on top of the rösti with the balsamic figs and crispy leeks to garnish."]}, {"isVegetarian": true, "title": "Banana and coconut porridge", "url": "www_bbc_co_uk_food_recipes_banana_and_coconut_40749", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["20g/¾oz porridge oats", "100ml/3½fl oz skimmed milk", "100ml/3½fl oz coconut water", "1 small banana (80g/3oz peeled weight), sliced ", "pinch ground cinnamon (optional)", "low-calorie sweetener, to taste (optional)"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 40, "preparationMins": 30}, "recommendations": 0, "method": ["Place the oats, milk and coconut water in a saucepan and refrigerate overnight.", "When ready to eat, place over a low heat and add half the banana and the cinnamon, if using. Cook for 3–5 minutes. ", "Serve in a warm bowl and top with the remaining banana slices and the sweetener, if using. "]}, {"isVegetarian": true, "title": "Banana and custard tart", "url": "www_bbc_co_uk_food_recipes_banana_and_custard_tart_86132", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour", "50g/2oz caster sugar", "125g/4½oz butter, slightly softened", "1 free-range egg, plus 1 egg yolk", "1 vanilla pod, seeds scraped out", "3-4 bananas, peeled, thickly sliced", "1 free-range egg, plus 2 egg yolks", "2 tsp dark rum", "50g/2oz caster sugar", "400ml/14fl oz double cream", "75g/3oz butter", "2 bananas, peeled, sliced diagonally", "2 tbsp rum", "50g/2oz caster sugar", "½ tsp ground cinnamon", "½ tsp ground allspice", "250g/9oz clotted cream"], "serves": "Serves 8-10", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 120, "preparationMins": 60}, "recommendations": 0, "method": ["Lightly grease a 20cm/8in loose-bottomed tart tin", "For the pastry, place the flour, sugar, butter and vanilla seeds in a bowl and rub together with your fingertips until the mixture resembles breadcrumbs (or pulse in a food processor). ", "Lightly beat the whole egg and pour it into the flour mixture. Stir the mixture together until it forms clumps, then bring together with your hands to form a dough. Wrap in clingfilm and rest in the fridge for 30 minutes.", "Roll the pastry out to a 3mm/⅛in thickness and use it to line the tart tin, leaving any excess pastry hanging over the edge. Chill in the fridge for 10 minutes. ", "Preheat the oven to 180C/350F/Gas 4. Preheat a large baking tray.", "Line the pastry case with greaseproof paper and fill with dried beans or rice. ", "Put the tin onto the preheated baking sheet and bake for eight minutes. ", "Remove the paper and beans and bake the pastry case for a further five minutes. ", "Beat the remaining egg yolk in a bowl.", "Carefully trim off the overhanging pastry edge level with the top of the tin, then brush the inside of the case with the egg yolk. ", "Put the pastry case back into the oven for a further five minutes, then remove it from the oven and set aside to cool.", "Reduce the oven to 170C/325F/Gas 3. ", "For the filling, arrange the banana slices in the bottom of the pastry case. ", "Beat the egg, eggs yolks, rum and sugar together in a bowl until well combined.", "Heat the cream in a saucepan until boiling, then whisk the cream into the egg mixture until well combined.", "Pour the custard into the pastry case and bake in the oven for 20 minutes, or until the custard is just set and the top is pale golden-brown. ", "Meanwhile, for the spiced sautéed bananas, melt the butter in a frying pan and fry the bananas for 1-2 minutes, or until just golden-brown. Carefully pour in the rum and flambé the liquid by slowly tilting the pan towards the gas flame, or light it with a match. Let the flames flare up then die down. (Caution: keep your face and hair away from the flames. Do not leave unattended.)", "Add the sugar, ground cinnamon and ground allspice and fry for another minute.", "To serve, cut the tart into wedges, place onto serving plates and spoon some bananas and clotted cream alongside."]}, {"isVegetarian": true, "title": "Banana and pecan cupcakes", "url": "www_bbc_co_uk_food_recipes_banana_and_pecan_21476", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150g/5½oz butter, softened", "100g/3½oz caster sugar", "2 eggs", "2 ripe bananas", "50g/1¾oz pecans", "150g/5½oz self-raising flour", "140g/5oz butter, softened", "175g/6oz icing sugar", "1-2 tbsp milk"], "serves": "Makes 12 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with paper cupcake cases. ", "For the cupcakes, beat together the butter and caster sugar using a wooden spoon until light and creamy. Stir in the eggs, one at a time, until they are completely mixed in.", "Mash the bananas using a fork. Roughly chop the pecans. Stir both into the egg mixture until evenly mixed.", "Fold the flour into the wet ingredients until completely combined.", "Divide the mixture between the paper cupcake cases. Bake in the oven for 15 minutes, or until risen and golden. Leave to cool a little, then transfer to a wire rack to cool completely.", "Meanwhile, make the icing. Beat together the butter, icing sugar and milk. Add a spoonful to the top of each cupcake and spread out using a butter knife. "]}, {"isVegetarian": true, "title": "Banana and salted caramel cupcakes", "url": "www_bbc_co_uk_food_recipes_banana_and_salted_48285", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["140g/5oz unsalted butter", "340g/11¾oz plain flour", "500g/1lb 2oz caster sugar", "100g/3½oz cocoa powder", "2 tsp baking powder\u2028", "1 tsp salt", "420ml/15fl oz full-fat milk", "4 large free-range eggs", "1 large banana, peeled and mashed", "200g/7oz dulce de leche", "670g/1lb 7oz icing sugar", "210g/7¼oz unsalted butter", "5 tbsp whole milk", "30g/1oz dulce de leche", "flaked sea salt", "fudge, cut into small squares", "dark chocolate, grated"], "serves": "Makes 24 cupcakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/170C Fan/Gas 3 and line two 12-hole cupcake tins with paper cases.", "Put the butter, flour, sugar, cocoa powder, baking powder and salt in a large mixing bowl. Mix the ingredients using an electric whisk until a sandy consistency is achieved. Lightly beat the milk and eggs in a jug. With the whisk going, gradually pour half of the milk and eggs into the bowl and mix thoroughly to combine. When the batter is smooth add the remaining liquid and continue to mix until combined. Stir the banana in. ", "Divide the batter equally among the 24 cupcake cases and bake for 20-25 minutes, or until the sponge bounces back when lightly touched. Leave to cool for 5 minutes in the tin, then place on a wire rack.", "For the buttercream, use an electric whisk to beat together the icing sugar and butter until well combined. Gradually add the milk while mixing on a slow speed to make a smooth icing.  Add the dulce de leche and mix thoroughly. Turn up the speed and beat until for a further 5-10 minutes, or until the icing is light and fluffy. Transfer to a piping bag fitted with a large star nozzle.", "Once the cupcakes are cool, use a sharp knife to make a hollow in the centre of each cupcake, keep the cut-out piece of sponge. Put a teaspoonful of the dulce de leche into each hollow. Replace the cut-out piece of sponge, trimming to fit and pressing down gently to ensure that the top is level.", "Pipe a swirl of buttercream on top of each cupcake and decorate with a little sea salt and pieces of fudge and dark chocolate."]}, {"isVegetarian": true, "title": "Banana and maple syrup cake", "url": "www_bbc_co_uk_food_recipes_banana_and_maple_syrup_03992", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_and_maple_syrup_03992_16x9.jpg", "ingredients": ["200g/7oz butter, softened, plus extra for greasing", "400g/14oz plain flour, plus extra for dusting", "4 ripe bananas, peeled", "200ml/7fl oz maple syrup", "25-50ml/1-2fl oz milk (optional)", "150g/5¼oz caster sugar", "4 free-range eggs", "2 tsp baking powder", "100g/3½oz pecan nuts, roughly chopped", "200ml/7fl oz double cream"], "serves": "Serves 6-8", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 170C/150 Fan/Gas 3. Grease a 23cm/9in springform cake tin with butter. Add a tablespoon of flour to the tin and tip the tin this way and that until the base and sides are coated with flour. Shake out any excess flour.", "Blend the bananas in a food processor until roughly chopped, then add 75ml/2¾fl oz of the maple syrup and blend to a smooth paste. Pour in up to 50ml/2fl oz of milk and blend again to obtain a smoother consistency, if necessary.", "In a large bowl, beat together the butter and sugar until pale and fluffy. Add the eggs one at a time, beating after each addition until each egg is fully incorporated into the mixture.", "Add the baking powder, flour, banana purée and three-quarters of the pecan nuts to the bowl. Gently fold the mixture together until just combined.", "Spoon the cake mixture into the prepared tin. Bang the base of the tin carefully against the work surface a couple of times to settle the mixture, then sprinkle the remaining chopped pecan nuts over the top of the cake.", "Bake for 45-60 minutes, or until the top is golden-brown and a skewer inserted into the centre of the cake comes out clean. Set the cake aside to cool in the tin for 10 minutes, then turn out onto a wire rack and allow to cool completely.", "Meanwhile, bring the cream and remaining maple syrup to the boil in a saucepan. Continue to boil for 3-5 minutes, or until the mixture has thickened slightly, then set aside until completely cooled.", "Before serving, spread the maple-syrup glaze over the top of the cake, allowing it to drizzle down the sides slightly. Set aside for 10 minutes, then cut into slices and serve."]}, {"isVegetarian": true, "title": "Banana and toffee pudding", "url": "www_bbc_co_uk_food_recipes_banana_and_toffee_80843", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["vegetable oil, for greasing", "2 tbsp ready-made toffee sauce", "1 ripe banana, peeled, sliced", "70g/3oz self-raising flour", "70g/3oz butter, softened", "70g/3oz caster sugar", "½ tsp mixed spice", "1 free-range egg, beaten", "custard, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4. Grease the base and sides of an ovenproof dish with the oil, then place the dish onto a baking tray. ", "Drizzle the toffee sauce evenly into the bottom of the dish.", "Arrange a layer of the sliced banana in the dish, keeping a few slices back for decoration.", "Beat the flour, butter, sugar and mixed spice together in a mixing bowl until fluffy and well combined. Gradually beat in the egg until the mixture is smooth and all of the egg has been incorporated. ", "Spread the sponge mixture evenly over the banana and toffee layers using a spatula. Top with the remaining slices of banana.", "Bake in the oven for 25-30 minutes, or until the sponge has risen and is golden-brown. Serve with custard."]}, {"isVegetarian": true, "title": "Banana and treacle pudding", "url": "www_bbc_co_uk_food_recipes_banana_and_treacle_52470", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["2 tbsp golden syrup", "2 large bananas (1 cut into slices on the diagonal, 1 mashed)", "175g/6oz softened butter, plus extra to line the pudding basin", "175g/6oz soft light brown sugar", "3 free-range eggs", "175g/6oz self-raising flour", "squeeze lime juice", "250ml/9fl oz full-fat milk", "250ml/9fl oz double cream", "1 vanilla pod, split down the middle, lengthways or 1 tsp vanilla extract", "6 free-range egg yolks", "50g/1¾oz caster sugar", "1 tbsp banana liqueur (optional)"], "serves": "Serves 6", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 120, "cooking": "over 2 hours", "totalMins": 180, "preparationMins": 60}, "recommendations": 0, "method": ["For the banana and treacle pudding, butter the insides of a large pudding basin thoroughly. Put the golden syrup in the base, then arrange the sliced banana on top.", "Cream the butter and sugar together, then add the eggs one at a time with a tablespoon of flour after each one. Incorporate the rest of the flour and the banana. Add a squeeze of lime juice to loosen the consistency slightly, then scrape the mixture into the pudding basin.", "Cover the basin with a sheet of greaseproof paper (or foil) with a pleat folded down the middle (this lets the air expand during cooking). Put an upturned heatproof saucer or small trivet in a large, deep saucepan, and place the pudding basin on top. Add enough just-boiled water to the pan to come halfway up the sides of the basin. Cover the pan with a tight-fitting lid and place over a low heat. Allow to steam in the gently simmering water for 2 hours, adding more water to the pan if necessary. (Make sure the pan does not boil dry.) The pudding is done when a skewer inserted into the centre of the pudding (through the foil or paper) comes out clean. When done, turn off the heat and carefully lift the basin from the water. Leave to stand for 5 minutes.", "Discard the aluminium foil and paper. Run a cutlery knife around the edge of the pudding to loosen the sides. Carefully invert onto a deep plate and remove the basin. ", "While the pudding is steaming, make the custard. Put the milk and the cream into a saucepan with the vanilla pod or extract. Bring almost to the boil, then remove from the heat and leave it so the flavours will infuse until it cools.", "Whisk the egg yolks and sugar together until pale with a foamy, aerated texture. Reheat the milk and cream again until just below boiling point. Strain the milk mixture through a sieve into a jug and rinse out the saucepan. ", "Slowly pour the milk mixture over the eggs, whisking constantly as you do so, then pour back into the saucepan. Set over a very low heat and stir constantly until the custard has thickened slightly and you can draw a line through it when it coats the back of a spoon.", "Strain the custard again and stir in the banana liqueur, if using. ", "To serve, turn the pudding out onto a plate and serve with the custard."]}, {"isVegetarian": true, "title": "Vegan banana, blueberry and pecan pancakes", "url": "www_bbc_co_uk_food_recipes_banana_blueberry_and_50179", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_blueberry_and_50179_16x9.jpg", "ingredients": ["100g/3½oz porridge oats ", "50g/1¾oz pecan nuts, roughly chopped", "1 tsp baking powder", "pinch sea salt", "1 ripe banana, peeled and mashed", "150ml/5fl oz coconut milk or almond milk", "2 tsp coconut oil, for frying", "200g/7oz blueberries", "100g/3½oz blueberries", "3 tbsp caster sugar", "2 bananas, peeled and cut into thin slices", "a few pecan nuts, finely chopped", "1 lime, cut into wedges", "8 tbsp maple syrup (optional)"], "serves": "Makes 8 small pancakes", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 120C/100C fan/Gas ½.", "In a food processor, pulse the oats until you have a scruffy flour. Transfer to a large bowl. Add the pecans, baking powder and salt.", "In a separate bowl, mix the mashed banana with the milk (you can do this in the food processor, if you like). Beat the banana mixture into the dry ingredients and leave the batter to sit for a few minutes.", "For the blueberry compôte, put the blueberries and sugar in a small pan with a teaspoon of water and cook for 3-4 minutes, or until you have a thick shiny compôte. Set aside until ready to serve.\r\n", "Heat a non-stick pan over a medium heat. Add the banana slices and fry on both sides in the dry pan until golden-brown and caramelised. Keep warm in the oven.", "Put the pan back on the heat and add a little coconut oil or butter. Drop in a generous tablespoon of batter for each pancake. Once the sides are cooked and bubbles have risen to the top, scatter over a handful of blueberries and flip the pancake over. Cook for another couple of minutes on the other side, or until lightly coloured. (The pancakes will stay a little moist in the middle because of the banana, so don’t worry.) Keep them warm in the oven while you cook the remaining pancakes.", "Serve the pancakes in a stack with the banana slices. Add some chopped pecans and a squeeze of lime, and, if you like, with a drizzle of maple syrup. Serve the compôte on the side."]}, {"isVegetarian": true, "title": "Banana cake", "url": "www_bbc_co_uk_food_recipes_banana_bread_06221", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_bread_06221_16x9.jpg", "ingredients": ["6 very ripe bananas", "125ml/4½fl oz vegetable oil", "115g/4oz butter, softened, plus extra for greasing", "335g/11½oz caster sugar", "4 free-range eggs", "450g/1lb plain flour ", "2 tsp baking powder", "1 tbsp ground cinnamon ", "1 tsp ground cloves ", "½ tsp salt", "225g/8oz raisins ", "225g/8oz pecans"], "serves": "Makes 2 loaves", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6. Grease and line two medium (or three small) loaf tins.", "Mash the bananas and vegetable oil together in a bowl and set aside. ", "In a separate mixing bowl, cream the butter and sugar together until pale and fluffy. Beat in the eggs, one at a time, then stir in the mashed banana mixture until well combined.", "Mix the flour, baking powder, ground spices and salt together in another bowl and lightly fold into the banana mixture. Add the raisins and pecans and fold together lightly.", "Spoon the cake mixture into the loaf tins and bake in the oven for 1½ hours, or until risen and golden-brown. Check after one hour and reduce the oven temperature slightly if the loaves are browning too quickly on the top, or cover the loaves loosely with aluminium foil. ", "Leave the banana bread to cool in the tins, then turn out and serve in thick slices. "]}, {"isVegetarian": false, "title": "Banana cake with miso caramel and sunflower seed praline", "url": "www_bbc_co_uk_food_recipes_banana_cake_with_banana_07454", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["6 bananas", "250g/9oz unsalted butter, softened", "150g/5½oz caster sugar", "150g/5½oz dark brown sugar", "100g/4oz golden syrup", "4 free-range eggs", "100ml/3½fl oz milk", "2 tsp bicarbonate of soda", "550g/1lb 4oz self-raising flour", "300g/10½oz caster sugar", "4 overripe bananas, mashed", "100g/4oz muscovado sugar", "80g/3oz rum", "25g/1oz miso paste", "100ml/3½fl oz milk", "300g/10½oz g double cream", "100g/4oz unsalted butter, cut into cubes", "200g/8oz sunflower seeds, heavily toasted", "100g/4oz caster sugar", "25g/1oz miso paste", "50g/2oz muscovado sugar", "100ml/3½fl oz milk", "300ml/10fl oz double cream", "100g/4oz crème fraiche"], "serves": "Serves 8 –12", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line two baking trays with baking paper. ", "To make the banana cake, pierce the banana skins, place them onto one of the prepared trays and bake for 10 minutes. Once cool enough to handle, remove the bananas from their skins and mash them together in a bowl. ", "Turn the oven down to 170C/150C Fan/Gas 3½ and line a large, deep 25x30cm/10x12in baking tin with baking paper.", "Cream the butter and sugar in a bowl, until fluffy. Add the eggs and mashed banana and mix well.", "Pour the milk into a small saucepan and heat until hot, but not boiling, over a medium heat. Add the bicarbonate of soda and stir to dissolve then pour into the cake bowl and mix well. ", "Fold in the flour, mix through and pour into the prepared baking tray. Bake for 20-25 minutes or until a skewer comes out clean. ", "Meanwhile, to make the banana miso caramel, place the caster sugar in a saucepan over a medium heat until it starts to caramelise, shaking the pan occasionally to stop it from burning. Add the bananas and muscovado sugar and shake to combine. Cook until the liquid has come out of the bananas. ", "Add the rum to the pan and cook until the liquid has evaporated. Add the miso, milk and cream and whisk well to combine. Add the butter a cube at a time, mixing each one in until you have a smooth caramel. ", "To make the sunflower seed praline, place the sugar in a saucepan over a medium heat and caramelise, shaking the pan occasionally to prevent it from burning. Add the sunflower seeds and mix in well then pour into a prepared baking tray and leave to cool. Once cool, blend in a food processor with a few drops of water to form a paste.  ", "To make the miso and muscovado cream, place the miso, muscovado and milk in a saucepan and cook over a medium heat until the sugar has dissolved. Pour into a large bowl and set aside to cool. ", "Whisk the double cream and crème fraiche together in a bowl until stiff, then fold into the miso and muscovado milk. ", "To serve,spoon some of the paste onto a serving plate and cut a slice of the cake and place on top of the paste. Top with the caramel sauce and a spoonful of cream next to the cake."]}, {"isVegetarian": true, "title": "Banana cocoa crunch overnight oats", "url": "www_bbc_co_uk_food_recipes_banana_cocoa_crunch_06267", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_cocoa_crunch_06267_16x9.jpg", "ingredients": ["40g/1½oz rolled oats (use gluten-free oats if required)", "small handful hazelnuts ", "150ml/5fl oz milk or soya milk", "1 tbsp maple syrup", "½ banana, chopped", "1 tsp cocoa nibs"], "serves": "Serves 1", "time": {"preparation": "overnight", "cookingMins": 10, "cooking": "less than 10 mins", "totalMins": 10, "preparationMins": 0}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Put the oats and hazelnuts on a baking tray and toast for 7 minutes, until they smell fragrant. Alternatively, toast them in a frying pan. Set aside to cool.", "Roughly chop the hazelnuts and put them in a lidded jar. Add the oats. Pour over the milk and maple syrup and top with the banana and cocoa nibs. Leave overnight in the fridge.", "To serve, top with more banana and cocoa nibs if you like. "]}, {"isVegetarian": true, "title": "Banana cream profiteroles with whiskey caramel", "url": "www_bbc_co_uk_food_recipes_banana_cream_53293", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["85g/3oz butter", "100g/3½oz plain flour", "3 free-range eggs", "3 bananas, skin on", "1 vanilla pod, cut into 3", "2 tbsp runny honey ", "pinch ground cinnamon ", "250g/9oz double cream, lightly whipped", "250g/9oz mascarpone ", "250g/9oz caster sugar ", "splash bourbon whiskey, to taste", "250g/9oz double cream", "3 bananas, peeled and sliced at an angle", "200g/7oz caster sugar, plus extra for caramelising the bananas", "icing sugar, for dusting"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a large baking tray with baking paper.", "To make the choux pastry, melt the butter with 220ml/8fl oz water in a saucepan and bring to the boil, tip in the flour and, using a wooden spoon, immediately beat it until smooth. Remove the pan from the heat and continue to beat until it has cooled slightly.", "Beat in the eggs one at a time until fully incorporated and glossy. Set aside to cool. ", "Spoon into a piping bag. Pipe balls of the pastry onto the prepared baking tray, leaving a generous gap between each. Bake for 25 minutes. Hollow out a small hole in the pastry and bake for another 5 minutes. Set aside.", "To make the banana filling, turn the oven down to 190C/170C Fan/Gas 5.", "Make a slit down each banana and fill with a third of the vanilla pod, honey and cinnamon. Wrap in kitchen foil and bake for 20 minutes. Scrape the flesh out of the skin and push through a sieve into a clean bowl. Mix with the lightly whipped cream and mascarpone. Pour into a piping bag and pipe into the buns. Set aside.", "To make the whiskey caramel, heat the sugar over a low heat until melted. Remove from the heat then stir in a splash of whiskey and the double cream, then place over a low heat to warm. Set aside.", "To serve, place the caster sugar in a pan over a low heat until melted. Dip each choux bun into the caramel and make a cone-shaped tower. Sprinkle caster sugar over the sliced banana and caramelise with a cook’s blowtorch. Scatter over the tower. Spoon over some whiskey caramel and finish with a dusting of icing sugar. "]}, {"isVegetarian": true, "title": "Banana muffins", "url": "www_bbc_co_uk_food_recipes_banana_muffins_51549", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_muffins_51549_16x9.jpg", "ingredients": ["125g/4½oz wholemeal flour", "3 level tbsp light muscovado sugar", "2 level tsp baking powder", "1 medium free-range egg, beaten", "50g/1¾oz low-fat plain yoghurt  ", "50ml/2fl oz rapeseed oil, plus a little extra for greasing", "2 ripe bananas (175g/6oz peeled weight), roughly mashed"], "serves": "Makes 6 muffins", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/180C Fan/Gas 6. Line a six-hole muffin tin with muffin cases or grease it. ", "Mix together the flour, sugar and baking powder in a bowl. In a separate bowl, beat together the egg, yoghurt and oil. Make a well in the flour, pour in the liquid and mix well. Stir in the mashed bananas, taking care not over-mix. ", "Spoon the mixture into the prepared cases and bake for 20–30 minutes, or until a skewer inserted into the centre comes out clean. Transfer the muffins to a wire rack to cool. "]}, {"isVegetarian": false, "title": "Banana pancakes with streaky bacon", "url": "www_bbc_co_uk_food_recipes_banana_pancakes_with_98240", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/banana_pancakes_with_98240_16x9.jpg", "ingredients": ["55g/2oz butter, cubed", "275g/9¾oz self–raising flour", "1 tsp baking powder", "2 free-range eggs", "2 tbsp soft light brown sugar", "300ml/½ pint whole milk", "1 large banana, roughly chopped", "1-2 tbsp sunflower oil", "8 rashers rindless streaky bacon", "maple or golden syrup, to serve"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 110C/225F/Gas ¼. ", "Melt 25g/1oz of the butter in a small pan over a low heat and leave to cool for five minutes. ", "Put the melted butter, flour, baking powder, eggs, sugar and milk in a food processor and blend until smooth. ", "Pour into a large bowl and mash the banana into the batter with a potato masher.", "Melt a little of the oil with a cube of butter in a large non-stick frying pan over a medium heat. Wipe around the base of the pan with a thick wad of kitchen paper.", "Drop four large serving spoonfuls of the banana pancake mixture into the frying pan, spacing well apart. Cook for three minutes, or until the pancakes rise, bubbles appear and the surface appears dry. ", "Flip over with a palette knife and cook on the other side for a further 2-3 minutes, or until pale golden-brown. ", "Transfer to a heatproof plate and keep warm in the oven while you cook the remaining eight pancakes in exactly the same way.", "Return the frying pan to the heat and add the streaky bacon. Cook for about three minutes on each side until golden and crisp, turning once. Add a splash of oil if the rashers begin to stick.", "Pile the pancakes onto four warmed plates and top with the fried bacon. Drizzle with a little maple syrup (or golden syrup) and serve the rest separately."]}, {"isVegetarian": true, "title": "Banana smoothie", "url": "www_bbc_co_uk_food_recipes_banana_smoothie_17334", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz fat-free Greek-style yoghurt ", "1 small banana (75g/2½oz peeled weight), broken up", "175ml/6fl oz skimmed milk", "pinch ground cinnamon "], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Put all the ingredients in a food processor and blend until smooth. Pour into a glass and serve, or into a takeaway bottle and drink on the go."]}, {"isVegetarian": true, "title": "Banana splits", "url": "www_bbc_co_uk_food_recipes_banana_split_90276", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["50g/1¾oz shelled hazelnuts, toasted, skins rubbed off", "25g/1oz caster sugar", "1 tbsp butter", "100g/3½oz dark chocolate, broken into pieces", "50ml/2fl oz whipping cream ", "1 tbsp golden syrup", "small knob of butter", "1 tbsp rum", "50g/1¾oz butter", "4 large bananas, split lengthways and halved", "75g/2¾oz light soft brown sugar", "pinch of salt", "ice cream", "whipped cream"], "serves": "Serves 4", "time": {"preparation": "30 mins to 1 hour", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 90, "preparationMins": 60}, "recommendations": 0, "method": ["For the candied hazelnuts, line a baking tray with baking paper. Put the hazelnuts, sugar and butter into a small frying pan. Cook over a low heat until the sugar has melted, swirling occasionally but not stirring. ", "Turn up the heat slightly and continue to cook and swirl until the caramel has turned a deep golden-brown. Immediately tip the hazelnuts on to the baking tray and separate them out. Leave to harden and break up a little if you want them in smaller pieces.", "For the chocolate sauce. Put the chocolate, cream and golden syrup into a saucepan and melt on a very low heat, whisking to combine. Whisk in the butter and rum, and keep warm while you prepare the bananas.", "For the banana splits, gently melt the butter in a large frying pan. When it starts foaming, add the bananas, then sprinkle over the sugar and a pinch of salt. Turn up the heat to medium-high and cook the bananas, turning every so often, until they are well coated in caramelised, buttery sugar. ", "Divide the bananas between four bowls and top with ice cream, whipped cream, the candied hazelnuts and the chocolate rum sauce."]}, {"isVegetarian": true, "title": "Banana tart tatin", "url": "www_bbc_co_uk_food_recipes_banana_tart_tatin_74566", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "1½ tbsp rum", "25g/½oz butter", "8 bananas, peeled and cut into 2½cm/1in chunks", "500g/1lb 2oz puff pastry", "1 egg, beaten, for glaze"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 200C/400F/Gas 6.", "Place the caster sugar in a 20cm/8in non-stick ovenproof frying pan. Heat gently until the sugar turns to caramel. Once the sugar has dissolved, add one and a half tablespoons of water and the rum and let it bubble. ", "When the caramel is golden-brown remove it from the heat and stir in the butter.", "Sit the banana chunks in the caramel, packing them close together and leaving no gaps.", "Roll out the puff pastry on a lightly floured work surface and sit it on top of the bananas, tucking any excess down the side of the pan. Glaze the pastry with egg wash. Transfer the pan to the oven for 20 minutes, or until the pastry is crisp and golden-brown.", "Before serving, carefully pour off any excess liquid. Invert a plate over the pan and turn out the tatin."]}, {"isVegetarian": true, "title": "Banana tarte tatin", "url": "www_bbc_co_uk_food_recipes_banana_tarte_tatin_23202", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["100g/3½oz caster sugar", "75g/2¾oz butter, plus extra for greasing", "pinch ground cardamom (optional)", "1 orange, zest only (optional)", "4-5 bananas, peeled and cut into 2cm/¾in chunks.", "375g/13oz block puff pastry", "250ml/9fl oz full-fat milk", "250ml/9fl oz double cream", "4 free-range egg yolks", "50g/1¾oz caster sugar", "3 tbsp cocoa powder", "1 tsp cornflour"], "serves": "Serves 6", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/160C Fan/Gas 4. Generously butter a tarte tatin dish or similar of around 23–24cm/9–9½in diameter – you can also use a cast iron skillet as this is ovenproof. ", "Melt the sugar in a fairly wide saucepan, being careful not to stir but just swirling it around once in a while, until the sugar has melted and turned a light caramel colour. Remove from the heat and add the butter. ", "The liquid will bubble up, then subside, and you can then whisk the butter in. If the caramel splits, you can add a tablespoon of warm water and re-whisk – the sauce should re-emulsify.", "Pour the caramel over the tarte tatin dish or skillet, then sprinkle in the cardamom and orange zest, if using. Arrange the bananas cut-side up over the caramel – they should be quite a snug fit.", "Roll out the puff pastry into a round – or you can just roll it out and trim it to a round. Prick it lightly all over with a fork, then place on top of the bananas, tucking the edges in as you go. Bake for between 40–45 minutes, or until the pastry is a rich golden-brown. It may be slightly risen.", "For the custard, heat the milk and cream together until just below boiling point. Remove from the heat. ", "Whisk the egg yolks, sugar, cocoa powder and cornflour in a bowl together, then pour in the milk and cream mixture into the bowl from a height in a steady steam, whisking as you go. Return to the saucepan (rinse it out first), then cook on a low heat, stirring constantly, until the custard thickens.", "Serve slices of the tarte tatin with the chocolate custard on the side."]}, {"isVegetarian": true, "title": "Banana tarte tatin", "url": "www_bbc_co_uk_food_recipes_banana_tarte_tatin_69729", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["225g/8oz plain flour, plus extra for dusting", "pinch sea salt ", "190g/6¾oz unsalted butter, cold, cut into 2cm/¾in cubes", "½ tbsp lemon juice", "100g/3½oz granulated white sugar", "60g/2¼oz salted butter ", "3 firm bananas "], "serves": "Serves 8", "time": {"preparation": "overnight", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 60, "preparationMins": 0}, "recommendations": 0, "method": ["For the rough puff pastry, sift the flour and salt into a large bowl and add the butter. Move the butter around until coated in the flour.", "Mix 125ml/4fl oz of water and the lemon juice together in a jug and pour into the flour and butter. Using a butter knife, mix in the liquid and chop the butter slightly as you go, turning the bowl round, until the ingredients have combined into a dough.", "On a floured work surface, tip the dough out and quickly shape it into a block. Roll out the dough into a rectangle roughly 35cmx20cm/14inx8in in size. With the short side of the pastry rectangle in front of you, fold the bottom third of the pastry to the middle, then fold the top half down to cover it.  Roll the pastry out into a rectangle again and repeat the folding process. Turn the pastry a quarter turn and roll out and fold again.  Repeat this 4-5 times.", "After the last folding, wrap the pastry in cling film and leave to chill in the fridge for a few hours, or preferably overnight. When the pastry has chilled, preheat the oven to 180C/350F/Gas 4. ", "To make the caramel, heat the sugar with a tablespoon of water in an ovenproof frying pan over a low heat and slowly bring to the boil. Keep boiling until the syrup turns a light golden colour - this will take between 5-7 minutes.  Add the butter in and swirl the pan (don’t stir) until it has all melted. Remove from the heat and leave to cool for a few minutes.", "Slice the bananas into rounds and arrange in a pattern on the caramel. ", "Roll out the pastry and cut out a circle slightly bigger than your pan.  Place the pastry on top of the bananas and tuck it in around the edges.  Pierce the top of the pastry with a fork and place in the pre heated oven for 40-45 minutes, or until the pastry is golden and puffed up.  Immediately turn the tart out onto a plate (take care as the caramel will still be very hot and may splash) and serve. "]}, {"isVegetarian": true, "title": "Banana and rum milkshake", "url": "www_bbc_co_uk_food_recipes_bananaandrummilkshak_89127", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["1 banana, peeled and chopped", "2 tbsp dark rum", "250g/9oz vanilla ice cream", "100ml/3½fl oz milk", "1 tbsp caster sugar", "½ tsp grated nutmeg", "4 ice cubes, to serve"], "serves": "Serves 1", "time": {"preparation": "less than 30 mins", "cookingMins": 0, "cooking": "no cooking required", "totalMins": 30, "preparationMins": 30}, "recommendations": 0, "method": ["Place all of the milkshake ingredients, except the ice cubes, into a blender and pulse until smooth. Serve in a tall glass over ice cubes."]}, {"isVegetarian": true, "title": "Banana and semolina sheera", "url": "www_bbc_co_uk_food_recipes_bananaandsemolinashe_73018", "image": "https://food.files.bbci.co.uk/kandl-food/1911/images/bbc_placeholder.png", "ingredients": ["150 ml/¼ pint clarified butter, (unsalted butter, melted and strained through a sieve)", "125g/5 oz semolina", "100g/4oz sugar", "1 medium banana, ripe", "550ml/1 pint milk, warmed", "¼ tsp saffron strands, soaked in 1 tbsp milk", "pinch of grated nutmeg", "1 tbsp sultanas", "1 tsp cardamom seeds, crushed", "1 tbsp flaked almonds, lightly toasted"], "serves": "Serves 4", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Heat the butter in a non-stick frying pan and add the semolina. Fry on a low heat until it changes colour and has a toasty aroma, but be careful not to burn it. ", "Add the sugar and stir until the mixture becomes syrupy.", "Peel and mash the banana and add to the semolina, along with the milk, saffron, nutmeg, sultanas and cardamom.", "Simmer, stirring occassionally, until the mixture is cooked.", "Serve warm in little ramekins, garnished with almonds."]}, {"isVegetarian": true, "title": "Banana bran muffins", "url": "www_bbc_co_uk_food_recipes_bananabranmuffins_77392", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bananabranmuffins_77392_16x9.jpg", "ingredients": ["115g/4¼ oz butter ", "100g/3½ oz brown sugar ", "3 bananas, mashed ", "115ml/4¼ fl oz milk ", "1 tsp vanilla extract ", "2 free-range eggs ", "175g/6¼ oz wholemeal flour ", "100g/3½ oz wheat bran ", "1 tsp baking powder ", "1 tsp baking soda ", "¼ tsp salt ", "handful chopped walnuts, to taste"], "serves": "Makes 15-20", "time": {"preparation": "less than 30 mins", "cookingMins": 30, "cooking": "10 to 30 mins", "totalMins": 60, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 190C/375F/Gas 5 and grease a muffin tin or line with muffin cases. ", "In a large mixing bowl, cream the butter and brown sugar until fluffy. Add the bananas, milk, vanilla and eggs and mix well. ", "Combine the flour, bran, baking powder, baking soda and salt and blend into the banana mixture. Stir in as many walnuts as you desire and pour the mixture into the muffin tray or cases. ", "Bake for 20-25 minutes or until a toothpick inserted into the centre of the muffin comes out clean. Cool in the tray for five minutes then place on a wire rack to cool completely."]}, {"isVegetarian": true, "title": "Gluten-free banana bread", "url": "www_bbc_co_uk_food_recipes_bananabread_74771", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bananabread_74771_16x9.jpg", "ingredients": ["40g/1½oz cherries", "75g/3oz sultanas", "110g/4oz butter, softened", "110g/4oz caster sugar", "2 large eggs, preferably free-range", "3 large ripe bananas", "175g/6oz fine rice flour", "50g/2oz cornflour", "2 tsp gluten-free baking powder", "½ tsp salt", "1kg/2lb loaf tin, lined with parchment paper, or 24 small paper muffin cases"], "serves": "Makes 1 x 900g/2lb loaf", "time": {"preparation": "less than 30 mins", "cookingMins": 120, "cooking": "1 to 2 hours", "totalMins": 150, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Wash and dry the cherries. Cut into quarters and mix with the sultanas. Set aside. ", "Cream the butter and sugar together until pale, light and soft. Add the eggs, one by one, and beat well between each addition. ", "Mash the bananas and add to the creamed mixture. Sift the rice flour, cornflour, gluten-free baking powder and salt together and fold carefully into the banana mixture. Very gently, stir in the cherries and sultanas, so that they are evenly distributed through the mixture.", "Pour the mixture into the loaf tin or into 24 small muffin cases and bake in the oven for about 1¼ - 1½ hours for the loaf, 25 minutes for the mini muffins, until golden on top and a skewer inserted into the centre comes out clean. ", "Remove the loaf from the tin and cool on a wire rack; cool mini muffins on a rack in their paper cases. Slice the loaf into eight slices to serve."]}, {"isVegetarian": true, "title": "Banana bread", "url": "www_bbc_co_uk_food_recipes_bananabread_85720", "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bananabread_85720_16x9.jpg", "ingredients": ["285g/10oz plain flour ", "1 tsp bicarbonate of soda", "½ tsp salt", "110g/4oz butter, plus extra for greasing", "225g/8oz caster sugar", "2 free-range eggs", "4 ripe bananas, mashed ", "85ml/3fl oz buttermilk (or normal milk mixed with 1½ tsp lemon juice or vinegar)", "1 tsp vanilla extract"], "serves": "Makes 1 loaf", "time": {"preparation": "less than 30 mins", "cookingMins": 60, "cooking": "30 mins to 1 hour", "totalMins": 90, "preparationMins": 30}, "recommendations": 0, "method": ["Preheat the oven to 180C/350F/Gas 4.", "Sift the flour, bicarbonate of soda and salt into a large mixing bowl.", "In a separate bowl, cream the butter and sugar together until light and fluffy.", "Add the eggs, mashed bananas, buttermilk and vanilla extract to the butter and sugar mixture and mix well. Fold in the flour mixture.", "Grease a 20cm x 12.5cm/8in x 5in loaf tin and pour the cake mixture into the tin.", "Transfer to the oven and bake for about an hour, or until well-risen and golden-brown.", "Remove from the oven and cool in the tin for a few minutes, then turn out onto a wire rack to cool completely before serving."]}]